[
  {
    "title": "Trump says ‘NO ONE GOES ON VACATION’ until the big, beautiful bill is done, but not all GOP lawmakers are on board",
    "description": "With Democrats flatly opposed to Trump's 'big, beautiful bill', it's all leaving GOP leaders scrambling days before final votes.",
    "link": "https://fortune.com/2025/06/25/trump-big-beautiful-bill-what-is-it/",
    "timestamp": "2025-06-25T09:15:47Z"
  },
  {
    "title": "Trump Bombed Iranian Nuclear Sites—Was It a Good Idea? Newsweek Contributors Debate",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe U.S. bombed three Iranian nuclear sites over the weekend, and on Monday night President Donald Trump announced a ceasefire with Iran.\nWere the strikes a good idea? Should the United States seek regime chan…",
    "link": "https://biztoc.com/x/c7d6b674975a14b5",
    "timestamp": "2025-06-25T09:10:57Z"
  },
  {
    "title": "Donald Trump compares US strikes on Iran to atomic bombing of Hiroshima",
    "description": "Israeli intelligence expected to provide impact assessment, US president says",
    "link": "https://biztoc.com/x/cd3962f0862af2f2",
    "timestamp": "2025-06-25T09:10:39Z"
  },
  {
    "title": "Nelson Mandela's Great-Grandson Urges Trump To Deport White South Africans",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNelson Mandela's great-grandson, Mayibuye Melisizwe Mandela, has called on U.S. President Donald Trump to deport the Afrikaners he accepted as refugees\n\"If Trump is honest, he should deport those people becaus…",
    "link": "https://biztoc.com/x/ed607d52f50362cd",
    "timestamp": "2025-06-25T09:10:35Z"
  },
  {
    "title": "Saudi Oil Export Revenue Slumps to Lowest in Almost Four Years",
    "description": "Saudi Arabia’s revenue from oil exports slumped to the lowest in almost four years in April as crude prices crashed.",
    "link": "https://financialpost.com/pmn/business-pmn/saudi-oil-export-revenue-slumps-to-lowest-in-almost-four-years",
    "timestamp": "2025-06-25T09:09:50Z"
  },
  {
    "title": "Conservative influencers have gone silent on Pierre Poilievre",
    "description": "Movements rely on momentum, and there’s no doubt that Poilievre has lost his. He rode the same wave of anger that fuelled the influencers who supported him; now that anger has dissipated, and so has Poilievre’s fire.",
    "link": "https://www.nationalobserver.com/2025/06/25/opinion/conservative-influencers-silent-pierre-poilievre",
    "timestamp": "2025-06-25T09:09:06Z"
  },
  {
    "title": "Trump says intelligence on Iran was inconclusive, but suggests severe damage",
    "description": "THE HAGUE (Reuters) -U.S. President Donald Trump said on Wednesday that the intelligence following the strikes on Iranian nuclear sites was inconclusive, but also suggested the damage could have been severe. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/25/trump-says-intelligence-on-iran-was-inconclusive-but-suggests-severe-damage",
    "timestamp": "2025-06-25T09:07:00Z"
  },
  {
    "title": "Greek PM says all NATO members should commit to defence spending target",
    "description": "THE HAGUE (Reuters) -Greek Prime Minister Kyriakos Mitsotakis said on Wednesday that all 32 members of the NATO alliance should do their part in defence spending and commit to the agreed target so that there would be no sense of \"free-riding\". Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/25/greek-pm-says-all-nato-members-should-commit-to-defence-spending-target",
    "timestamp": "2025-06-25T09:07:00Z"
  },
  {
    "title": "Bitcoin Pepe price outlook as Arizona lawmakers advance crypto reserve bill",
    "description": "Bitcoin Pepe seeks to integrate Bitcoin’s security with the scalability of platforms like Solana. The ongoing BPEP presale has raised over $15.5 million to date, and the token is currently priced at around 0.0416. As per the team, the BPEP token is to be list…",
    "link": "https://coinjournal.net/news/bitcoin-pepe-price-outlook-as-arizona-lawmakers-advance-crypto-reserve-bill/",
    "timestamp": "2025-06-25T09:06:33Z"
  },
  {
    "title": "Bosch CEO warns Europe against regulating 'itself to death' on AI",
    "description": "FRANKFURT :Bosch CEO Stefan Hartung warned on Wednesday that Europe risks hindering its progress in artificial intelligence compared with other parts of the world through over-regulation.\"Europe is unnecessarily delaying its AI future with excessive regulatio…",
    "link": "https://www.channelnewsasia.com/business/bosch-ceo-warns-europe-against-regulating-itself-death-ai-5202596",
    "timestamp": "2025-06-25T09:06:11Z"
  },
  {
    "title": "From Price Rage to Brand Mutiny: How Shopper Activism Is Quietly Rewriting FMCG Strategy in Europe",
    "description": "In today’s Europe, the most powerful protest doesn’t always happen on the streets. It happens at the checkout counter. A quiet revolution is unfolding in fast-moving consumer goods (FMCG). While most headlines focus on political elections or street demonstrat…",
    "link": "https://thecuriousbrain.com/?p=147325",
    "timestamp": "2025-06-25T09:05:18Z"
  },
  {
    "title": "IDF Shares Iran Nuclear Assessment as Trump Doubles Down on 'Obliteration'",
    "description": "U.S. President Donald Trump has described the strikes as causing \"total obliteration\" to the nuclear sites.",
    "link": "https://www.newsweek.com/idf-shares-iran-nuclear-assessment-trump-doubles-down-obliteration-2090390",
    "timestamp": "2025-06-25T09:04:21Z"
  },
  {
    "title": "Asian shares gain as investors shift focus to Federal Reserve, tariffs",
    "description": "Shares have logged modest gains in Europe and Asia after U.S. stocks climbed to near their all-time high.",
    "link": "https://www.clickondetroit.com/business/2025/06/25/asian-shares-gain-as-investors-shift-focus-to-federal-reserve-tariffs/",
    "timestamp": "2025-06-25T09:02:16Z"
  },
  {
    "title": "Asian shares gain as investors shift focus to Federal Reserve, tariffs",
    "description": "Shares have logged modest gains in Europe and Asia after U.S. stocks climbed to near their all-time high",
    "link": "https://abcnews.go.com/US/wireStory/asian-shares-gain-investors-shift-focus-federal-reserve-123183294",
    "timestamp": "2025-06-25T09:02:11Z"
  },
  {
    "title": "JD Vance’s Finger-Flipping ‘Gag’ Has Critics Cringing So Hard",
    "description": "The awkward \"joke\" was mocked as peak try-hard.",
    "link": "https://www.huffpost.com/entry/jd-vance-joke-reaction_n_685baca2e4b04f1da81ccf99",
    "timestamp": "2025-06-25T09:02:01Z"
  },
  {
    "title": "The U.S. revoked visas from a top basketball player's country. How the NBA kept his dream alive.",
    "description": "When Khaman Maluach’s freshman season at Duke University ended in April, the biggest question about the 7-foot-2 big man’s ability to play in the NBA had nothing to do with his shooting, size or skill",
    "link": "https://www.nbcnews.com/sports/nba/nba-draft-khaman-maluach-duke-south-sudan-rcna213634",
    "timestamp": "2025-06-25T09:01:00Z"
  },
  {
    "title": "Fast-Tracking A Bitcoin Rally: Expert Identifies 3 Bullish Catalysts",
    "description": "The cryptocurrency market is currently experiencing heightened volatility, particularly with Bitcoin (BTC) fluctuating dramatically. Recently, the price dipped below $99,000 before rebounding to over $106,000 within a span of just 24 hours. Bullish Bitcoin Se…",
    "link": "http://www.newsbtc.com/bitcoin-news/fast-tracking-a-bitcoin-rally-expert-identifies-3-bullish-catalysts/",
    "timestamp": "2025-06-25T09:00:56Z"
  },
  {
    "title": "Late-Night Hosts Joke About Trump’s F-Bomb: ‘Talk About Dropping a Big Load’",
    "description": "\"As of now, the ceasefire has held, and it's about as stable as an Ikea cabinet with eight screws missing,\" Jimmy Fallon quipped",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/late-night-host-donald-trump-f-bomb-jokes-1235371533/",
    "timestamp": "2025-06-25T09:00:44Z"
  },
  {
    "title": "Trump Delivers Victory in 12-Day War",
    "description": "Is this as good as it gets? Maybe. The high water mark of the first Trump administration came with the firing of a ninja missile into the car of IRGC Quds Force chief Qassem Soleimani, avenging the murder and maiming of so many American servicemen. That was f…",
    "link": "https://freebeacon.com/america/trump-delivers-victory-in-12-day-war/",
    "timestamp": "2025-06-25T09:00:44Z"
  },
  {
    "title": "'Utterly Deranged': Trump Ripped After Posting Outrageous New Video",
    "description": "The president's post came amid a tenuous ceasefire between Israel and Iran.",
    "link": "https://www.huffpost.com/entry/trump-bomb-iran-video_n_685bac82e4b04f1da81ccf74",
    "timestamp": "2025-06-25T09:00:28Z"
  },
  {
    "title": "I'm a veteran and former Democratic congressman. Here's why the GOP ought to think hard about Iran",
    "description": "Republican silence on Trump's Iran military strikes, done without congressional approval, is unacceptable. Veterans will hold the GOP accountable.",
    "link": "https://www.foxnews.com/opinion/im-veteran-former-democratic-congressman-heres-why-gop-ought-think-hard-about-iran",
    "timestamp": "2025-06-25T09:00:25Z"
  },
  {
    "title": "ASRA NOMANI: Iran’s ideological foot soldiers wage proxy war in America",
    "description": "Investigation reveals a network of 93 groups with $100 million in annual revenues conducting a coordinated proxy campaign for Iran in the US, including socialist revolutionaries",
    "link": "https://www.foxnews.com/opinion/asra-nomani-irans-ideological-foot-soldiers-wage-proxy-war-america",
    "timestamp": "2025-06-25T09:00:10Z"
  },
  {
    "title": "As Trump Defends Iran Nuclear Site Destruction, Kim Jong Un Takes Notes",
    "description": "\"The B-2 have to certainly give the North Koreans great pause,\" a former U.S. intelligence officer told Newsweek.",
    "link": "https://www.newsweek.com/trump-defends-iran-nuclear-site-destruction-kim-jong-un-takes-notes-2090311",
    "timestamp": "2025-06-25T09:00:01Z"
  },
  {
    "title": "The US is staring down a fate worse than recession, and 4 other bold forecasts from a top economist",
    "description": "There's still a 25% chance the US could enter a recession sometime in the next 12 months, according to Apollo's chief economist.",
    "link": "https://www.businessinsider.com/stagflation-recession-us-economy-inflation-unemployment-outlook-apollo-torsten-slok-2025-6",
    "timestamp": "2025-06-25T09:00:01Z"
  },
  {
    "title": "Exclusive: Nelson Mandela's Great-Grandson Urges Trump To Deport White South Africans",
    "description": "Mayibuye Melisizwe Mandela called for white South African refugees to be deported from the U.S. so they can face criminal charges.",
    "link": "https://www.newsweek.com/nelson-mandela-donald-trump-white-south-africa-afrikaans-refugees-2088563",
    "timestamp": "2025-06-25T09:00:01Z"
  },
  {
    "title": "Trump Bombed Iranian Nuclear Sites—Was It a Good Idea? Newsweek Contributors Debate",
    "description": "Should the United States seek regime change in Tehran? And what might the future hold for the Iranian government?",
    "link": "https://www.newsweek.com/trump-bombed-iranian-nuclear-siteswas-it-good-idea-newsweek-contributors-debate-2089357",
    "timestamp": "2025-06-25T09:00:01Z"
  },
  {
    "title": "California’s Much-Touted IVF Law May Be Delayed Until 2026, Leaving Many in the Lurch",
    "description": "California lawmakers are poised to approve a six-month delay in implementing the state’s in vitro fertilization law, pushing its start to January 2026. The plan to postpone, which has drawn little attention, is part of the state budget package and has left pa…",
    "link": "https://kffhealthnews.org/news/article/california-ivf-law-delay-2026-newsom/",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Trump’s Anger at AOC Boils Over—and Reveals a New Way Forward for Dems",
    "description": "On Tuesday, President Donald Trump and Representative Alexandria Ocasio-Cortez got into a major online battle over Trump’s bombing of Iran. AOC said Trump had committed impeachable offenses. Trump responded with a wild, lengthy, unhinged rant that dared Democ…",
    "link": "https://newrepublic.com/article/197188/trump-anger-aoc-boils-over-and-reveals-new-way-forward-dems",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Trump ended the Israel-Iran war. Now Saudi Crown Prince MBS can do the same for Gaza",
    "description": "When it came to Iran, U.S. President Donald Trump helped Prime Minister Benjamin Netanyahu down from his tree. When it comes to Gaza, Perhaps Saudi Crown Prince Mohammad Bin Salman can play a similar role",
    "link": "https://www.haaretz.com/opinion/2025-06-25/ty-article-opinion/.premium/trump-ended-the-israel-iran-war-now-saudi-crown-prince-mbs-can-do-the-same-for-gaza/00000197-9f45-d344-a59f-9f45d60c0000",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "How Bombing Iran May Have Made Nuclear Diplomacy Much Harder",
    "description": "While Trump claims to have destroyed Iran’s nuclear program, analysts say U.S. and Israeli attacks may have pushed the country closer to building a weapon.",
    "link": "https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Trump says Iran nuclear programme set back 'decades'",
    "description": "President Donald Trump insisted on Wednesday that U.S. strikes resulted in the \"total obliteration\" of Iran's nuclear capabilities, setting the country's atomic programme back by \"decades\".",
    "link": "https://www.hurriyetdailynews.com/trump-says-iran-nuclear-programme-set-back-decades-210726",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Iran's strategic blunders paved the way for humiliating defeats, experts say",
    "description": "Iran has suffered a series of humiliating defeats brought on by the regime’s own diplomatic miscalculations and strategic blunders, former officials say.",
    "link": "https://www.nbcnews.com/politics/national-security/irans-strategic-blunders-paved-way-humiliating-defeats-experts-say-rcna214584",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Trump's pick for appeals judge seen as 'ill-suited' to lifetime appointment",
    "description": "The nomination of the president's former personal lawyer Emil Bove to an appellate judgeship could represent a pivot point in Trump's approach to the judiciary.",
    "link": "https://www.npr.org/2025/06/25/g-s1-74064/trump-emil-bove-judge-nomination",
    "timestamp": "2025-06-25T09:00:00Z"
  },
  {
    "title": "Donald Trump damage assessment of Iran’s nuclear programme was ‘inconclusive’ after US bunker buster strikes",
    "description": "US President Donald Trump said on Wednesday that the intelligence following the strikes on Iranian nuclear sites was inconclusive, but also suggested the damage could have been severe.",
    "link": "https://www.independent.ie/world-news/donald-trump-damage-assessment-of-irans-nuclear-programme-was-inconclusive-after-us-bunker-buster-strikes/a1008592080.html",
    "timestamp": "2025-06-25T08:59:39Z"
  },
  {
    "title": "Donald Trump admits damage assessment of Iran’s nuclear programme was ‘inconclusive’ after US bunker buster strikes",
    "description": "US President Donald Trump said on Wednesday that the intelligence following the strikes on Iranian nuclear sites was inconclusive, but also suggested the damage could have been severe.",
    "link": "https://www.independent.ie/world-news/donald-trump-admits-damage-assessment-of-irans-nuclear-programme-was-inconclusive-after-us-bunker-buster-strikes/a1008592080.html",
    "timestamp": "2025-06-25T08:59:39Z"
  },
  {
    "title": "Defense Department intelligence report suggests U.S. strikes only set back Iran’s nuclear program by a few months",
    "description": "A U.S. intelligence report suggests that Iran’s nuclear program has been set back only a few months after U.S. strikes and was not “completely and fully obliterated” as President Donald Trump has said, according to two people familiar with the early assessmen…",
    "link": "https://biztoc.com/x/11e975d492df4dfa",
    "timestamp": "2025-06-25T08:59:27Z"
  },
  {
    "title": "Best crypto to buy now as markets hope for a Fed rate cut in July",
    "description": "Bitcoin Pepe has seen steady inflows ever since its presale launched in February. The project’s presale has raised over $15.5 million. The team has also secured listings on MEXC and BitMart. Another listing announcement is scheduled for next week. Bitcoin ext…",
    "link": "https://coinjournal.net/news/best-crypto-to-buy-now-as-markets-hope-for-a-fed-rate-cut-in-july/",
    "timestamp": "2025-06-25T08:58:12Z"
  },
  {
    "title": "Trump Arrives At NATO Summit As Allies Look To Boost Spending To Appease US",
    "description": "US President Donald Trump has arrived in the Netherlands to take part in the annual NATO summit as European allies look to commit to significantly boosting defense spending to appease Washington.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250624-rferl02.htm",
    "timestamp": "2025-06-25T08:56:57Z"
  },
  {
    "title": "Trump on Iran Nuclear Sites: It Was Total Obliteration",
    "description": "One U.S. intelligence assessment contradicted the White House's assertion about its Iran strikes.",
    "link": "https://www.newsweek.com/trump-iran-nuclear-sites-it-was-total-obliteration-2090387",
    "timestamp": "2025-06-25T08:55:36Z"
  },
  {
    "title": "Diddy Declines To Take The Stand In Sex Trafficking Trial",
    "description": "Diddy has declined to take the stand to give evidence to support his not guilty plea as his sex trafficking trial begins to wind down.",
    "link": "https://hiphopdx.com/news/diddy-declines-take-stand-sex-trafficking-trial",
    "timestamp": "2025-06-25T08:55:32Z"
  },
  {
    "title": "Bank of America CEO Brian Moynihan on how he shrugged off Trump’s accusations",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/06/25/bank-of-america-ceo-brian-moynihan-on-how-he-shrugged-off-trumps-accusations/",
    "timestamp": "2025-06-25T08:54:20Z"
  },
  {
    "title": "NATO summit yields a big win on defense spending for Trump but key questions over the alliance remain",
    "description": "NATO leaders convening Wednesday in the Netherlands were prepared to offer President Donald Trump a major win by boosting their defense spending targets.",
    "link": "https://www.cnn.com/2025/06/25/politics/nato-meeting-trump-defense-spending",
    "timestamp": "2025-06-25T08:54:01Z"
  },
  {
    "title": "Trump Jr Says Obama Getting Nobel Prize Over Father Is 'Affirmative Action'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump Jr. has said that Barack Obama winning the Nobel Peace Prize while his father has not is the result of \"affirmative action.\"\nThe president's oldest son wrote on X, formerly Twitter, on Tuesday: \"A…",
    "link": "https://biztoc.com/x/ae12c748a23977ba",
    "timestamp": "2025-06-25T08:48:38Z"
  },
  {
    "title": "Trump: Getting along very well with Iran right now",
    "description": "United States President Donald Trump said at the NATO summit on Wednesday that his administration is \"getting along very well\" with Iran since the start of the ceasefire with Israel.Trump claimed Iran...",
    "link": "https://biztoc.com/x/52b169162ad88e79",
    "timestamp": "2025-06-25T08:48:30Z"
  },
  {
    "title": "Trump: Gaza deal very close",
    "description": "United States President Donald Trump claimed on Wednesday that an agreement on settling the crisis in Gaza is \"very close.\"Speaking on the sidelines of the North Atlantic Treaty Organization's (NATO) ...",
    "link": "https://biztoc.com/x/19f821a4f2f2758f",
    "timestamp": "2025-06-25T08:48:25Z"
  },
  {
    "title": "12 posts from ‘12 day war’: How Trump live-posted Israel-Iran conflict",
    "description": "The US president, always busy on social media, was extra communicative during the recent Israel-Iran conflict.",
    "link": "https://www.aljazeera.com/news/2025/6/25/12-posts-from-12-day-war-how-trump-live-posted-israel-iran-conflict",
    "timestamp": "2025-06-25T08:48:10Z"
  },
  {
    "title": "Trump Says Does Not Want Regime Change in Iran Due to Possible Chaos",
    "description": "US President Donald Trump said on Tuesday that he does not want to see a regime change in Iran because such events \"take chaos,\" and chaos can stall the normalization of the situation in the region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-sputnik02.htm",
    "timestamp": "2025-06-25T08:47:23Z"
  },
  {
    "title": "Iran Took Measures in Advance to Restore Nuclear Industry - State Atomic Energy Organization",
    "description": "Tehran has taken measures in advance to restore the nuclear industry so that there are no pauses in its work, Iranian Vice President and head of the Atomic Energy Organization of Iran (AEOI) Mohammad Eslami said on Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-sputnik04.htm",
    "timestamp": "2025-06-25T08:47:06Z"
  },
  {
    "title": "GCC Ministerial Council Issues Statement on Iran Aggression Against Qatar",
    "description": "The Gulf Cooperation Council (GCC) Ministerial Council held its 49th extraordinary meeting Tuesday under the chairmanship of Kuwait's Minister of Foreign Affairs and president of the current session of the Ministerial Council Abdullah Ali Abdullah Al Yahya",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250625-spa01.htm",
    "timestamp": "2025-06-25T08:46:45Z"
  },
  {
    "title": "Trump Blasts Reports Questioning Success Of US Bombing Of Iranian Nuclear Sites",
    "description": "President Donald Trump and the Pentagon have blasted US media reports based on unidentified sources that the bombing of three Iranian nuclear sites over the weekend likely only set back Tehran's nuclear program by months.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250625-rferl02.htm",
    "timestamp": "2025-06-25T08:46:40Z"
  },
  {
    "title": "Defense Department intelligence report suggests U.S. strikes only set back Iran’s nuclear program by a few months",
    "description": "The White House strongly pushed back on the DIA assessment, calling it “flat-out wrong”—“Everyone knows what happens when you drop fourteen 30,000 pound bombs perfectly on their targets: total obliteration.”",
    "link": "https://fortune.com/2025/06/25/defense-dia-intelligence-report-us-strikes-iran-nuclear-program-few-months/",
    "timestamp": "2025-06-25T08:46:21Z"
  },
  {
    "title": "Iran's nuclear industry too deep-rooted to be uprooted through aggression: AEOI",
    "description": "The spokesman for the Atomic Energy Organization of Iran (AEOI) has reiterated that the country's nuclear program will continue to expand despite acts of aggression against the peaceful nuclear facilities.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv08.htm",
    "timestamp": "2025-06-25T08:45:36Z"
  },
  {
    "title": "In significant policy shift, Trump says China can keep buying oil from Iran",
    "description": "US President Donald Trump said on Tuesday that China can keep buying oil from Iran, marking a significant shift from his so-called maximum pressure campaign.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv09.htm",
    "timestamp": "2025-06-25T08:45:29Z"
  },
  {
    "title": "Guterres urges Iran and Israel to 'fully respect' ceasefire",
    "description": "The UN Secretary-General on Tuesday welcomed the ceasefire announcement between Iran and Israel which was announced on social media overnight by US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-unnews02.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Trump Says Cease-Fire In Effect After Expressing Anger Over Violations",
    "description": "US President Donald Trump claimed a cease-fire between Iran and Israel was \"in effect\" on June 24 after lashing out at both sides for violating the agreement he brokered and calling for calm.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-rferl03.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "UN urges renewed diplomacy on Iran nuclear deal, hails Tehran-Tel Aviv ceasefire as 'significant achievement'",
    "description": "A fragile ceasefire brokered by the United States between Iran and Israel appears to be holding, marking a tentative halt to a dangerous regional escalation that included airstrikes, retaliatory missile attacks and mounting civilian casualties.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-unnews01.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Iranian armed forces' general staff rejects claims of new missile launches at Zionist entity",
    "description": "Iran has firmly denied reports about any new missile launches from the Islamic Republic toward the occupied territories after the regime ceased its aggression early on Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv18.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Iranian armed forces dealt 'severe, historic' punishment to Israel: Pezeshkian",
    "description": "President Masoud Pezeshkian on Tuesday said the Israeli regime was forced to unilaterally halt its aggression against the Islamic Republic after receiving a \"severe and historic\" punishment at the hands of the Iranian nation and its armed forces.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv04.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Last wave of Op. True Promise III delivered 'historic lesson' to Zionist enemy: IRGC",
    "description": "Islamic Revolution Guards Corps (IRGC) says the 22nd and last phase of Operation True Promise III on Tuesday taught a \"historic and unforgettable lesson\" to the Israeli regime.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv12.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Trump Announces 'Complete and Total' Ceasefire Between Iran and Israel",
    "description": "Iran and Israel have agreed on a complete and total ceasefire that will end the \"12-day war,\" US President Donald Trump said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-sputnik07.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Iran determined the timing of 'ceasefire', not Zionist regime: Israeli general",
    "description": "A reserve general in the Israeli military has acknowledged that it was the Islamic Republic of Iran—not the Tel Aviv regime—that determined the timing of the cessation of Israeli aggression.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv10.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Saudi Arabia Welcomes US President's Announcement of Ceasefire in Regional Conflict",
    "description": "The Ministry of Foreign Affairs issued a statement today expressing Saudi Arabia's welcome of the announcement by US President Donald Trump regarding a ceasefire agreement between the parties involved in the regional escalation, and its appreciation for the e…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-spa02.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Skies Calm Over Israel, Iran As Truce Appears To Hold After Tumultuous Start",
    "description": "The skies over Israel and Iran appeared calm as the second day of a cease-fire brokered by US President Donald Trump appeared to be holding after a shaky beginning.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250625-rferl01.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "All NATO Member States Support Talks With Iran - Rutte",
    "description": "All NATO member states are in favor of holding talks with Iran on its nuclear program, NATO Secretary General Mark Rutte said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-sputnik08.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Iran says powerful military response forced Israel to halt aggression unilaterally",
    "description": "Iran's top security body says the powerful Iranian military response as part of True Promise III forced the Israeli regime to halt its aggression unilaterally.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv19.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Chinese UN envoy hopes for no more deceptions in Israel-Iran ceasefire",
    "description": "\"We hope the ceasefire could hold and be abided by faithfully by all parties. No more deceptions this time,\" said Fu Cong, China's permanent representative to the United Nations, on Tuesday local time ahead of a related UN Security Council meeting regarding t…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250625-globaltimes01.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Israeli war minister orders 'intense strikes' on Iran shortly after regime halted aggression",
    "description": "Israel's minister for military affairs, Israel Katz, says he has ordered \"intense strikes\" against Iran, immediately after the cessation of aggression after 12 days.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv20.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "Irani Confirms Ceasefire, Warns of Retaliation if Israel Strikes Again",
    "description": "Tehran confirms ceasefire with Israel, but will respond to any aggression against it, Iran's Supreme National Security Council said on Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-sputnik06.htm",
    "timestamp": "2025-06-25T08:43:27Z"
  },
  {
    "title": "UK Culture Minister Chris Bryant Downplays Likelihood Of Improvements To High-End TV Tax Credit",
    "description": "EXCLUSIVE: UK Culture Minister Chris Bryant has downplayed the likelihood of the Labour government improving the UK’s high-end TV (HETV) tax credit following calls from across the industry. Speaking to Deadline, Bryant said the tax rebate situation is being “…",
    "link": "http://deadline.com/2025/06/chris-bryant-downplays-improving-high-end-tv-tax-credit-1236441096/",
    "timestamp": "2025-06-25T08:42:44Z"
  },
  {
    "title": "President Herzog visits site of Iranian missile strike in Be'er Sheva",
    "description": "What we've seen here is outrageous and extremely painful. That missile landed here specifically to kill women, children, the elderly, people living ordinary lives, and unfortunately had a heavy toll of four innocent civilians.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/06/israel-250624-israel-mfa01.htm",
    "timestamp": "2025-06-25T08:42:32Z"
  },
  {
    "title": "US will not sanction Russia yet, Rubio tells Politico",
    "description": "(Reuters) -U.S. Secretary of State Marco Rubio told Politico that the United States will not impose further sanctions on Russia yet, and still wants room to negotiate a peace deal. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/25/us-will-not-sanction-russia-yet-rubio-tells-politico",
    "timestamp": "2025-06-25T08:42:00Z"
  },
  {
    "title": "Chicago Teachers Union president suggests children belong to the school system",
    "description": "Davis Gates cited James Baldwin, a prominent writer and civil rights activist.",
    "link": "https://nypost.com/2025/06/25/us-news/chicago-teachers-union-president-stacy-davis-gates-suggests-children-belong-to-school-system/",
    "timestamp": "2025-06-25T08:40:49Z"
  },
  {
    "title": "Trump Jr Says Obama Getting Nobel Prize Over Father Is 'Affirmative Action'",
    "description": "Barack Obama won the Nobel Peace Prize in 2009 for his \"extraordinary efforts to strengthen international diplomacy and cooperation between peoples.\"",
    "link": "https://www.newsweek.com/donald-trump-jr-nobel-peace-prize-barack-obama-affirmative-action-2090362",
    "timestamp": "2025-06-25T08:39:06Z"
  },
  {
    "title": "China Responds to Trump's Cryptic Post About Iran Oil",
    "description": "Trump had posted to Truth Social and Chinese purchases of Iranian oil.",
    "link": "https://www.newsweek.com/china-trump-iran-oil-post-2090373",
    "timestamp": "2025-06-25T08:39:02Z"
  },
  {
    "title": "Trump says China can buy Iranian oil, but urges it to purchase US crude",
    "description": "Donald Trump said China can continue to purchase Iranian oil after the Israel-Iran ceasefire. The White House clarified this does not relax US sanctions. A senior official said Trump wants China to buy US oil instead. This news sent oil prices down. Experts b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-china-can-buy-iranian-oil-but-urges-it-to-purchase-us-crude/articleshow/122066228.cms",
    "timestamp": "2025-06-25T08:38:40Z"
  },
  {
    "title": "Trump: Iran is not going to enrich uranium",
    "description": "United States President Donald Trump said on Wednesday that Iran is \"not going to enrich\" uranium or have a nuclear bomb. \"The last thing they want to do is enrich anything, they want to recover\" from...",
    "link": "https://biztoc.com/x/25d2adabfad8e2cb",
    "timestamp": "2025-06-25T08:37:30Z"
  },
  {
    "title": "How a Former U.S. Enemy Lined Up With Trump on Iran",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA 12-day conflict between Israel and Iran showed how far Syria has moved from being one of Iran's closest regional allies to alignment with U.S. President Donald Trump.\nAs the ceasefire takes hold between Iran…",
    "link": "https://biztoc.com/x/a45c11f6b678a0d9",
    "timestamp": "2025-06-25T08:37:26Z"
  },
  {
    "title": "Turkey Breathes Easier As Iran-Israel Truce Eases Fallout Risk",
    "description": "As the fragile Iran-Israel truce took hold, there was no letup in Turkey's diplomatic efforts Wednesday to prevent any return to a conflict fraught with risk for Ankara's domestic and regional policies.",
    "link": "https://www.ibtimes.com/turkey-breathes-easier-iran-israel-truce-eases-fallout-risk-3776778",
    "timestamp": "2025-06-25T08:36:23Z"
  },
  {
    "title": "How a Former U.S. Enemy Lined Up With Trump on Iran",
    "description": "Syria's reaction to the Israeli and U.S. bombing of Iran showed how its position has shifted under Ahmed al-Sharaa",
    "link": "https://www.newsweek.com/how-former-us-enemy-lined-trump-iran-2089361",
    "timestamp": "2025-06-25T08:33:33Z"
  },
  {
    "title": "US strikes on Iran may strengthen North Korea's nuclear resolve, experts warn",
    "description": "The U.S. air strikes on Iran's nuclear facilities will have reinforced North Korea's perception that possessing nuclear weapons is essential for its survival and may even prompt Pyongyang to accelerate the development of its nuclear capabilities, warned South…",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2025/dprk-250623-rfa01.htm",
    "timestamp": "2025-06-25T08:31:21Z"
  },
  {
    "title": "UK to Buy Nuclear-Capable F-35s Amid Trump Threats to Pull Back",
    "description": "The UK will buy at least a dozen new US-made F-35 fighter jets capable of carrying nuclear weapons, as Prime Minister Keir Starmer seeks to curry favor with President Donald Trump while hedging against a pull-back in American security support.",
    "link": "https://www.livemint.com/companies/company-results/uk-to-buy-nuclear-capable-f-35s-amid-trump-threats-to-pull-back-11750840270586.html",
    "timestamp": "2025-06-25T08:31:10Z"
  },
  {
    "title": "VA Announces Benefit Milestone: 'All-Time Record'",
    "description": "The VA said it has processed more than 2 million disability claims so far in fiscal year 2025.",
    "link": "https://www.newsweek.com/va-benefit-milestone-all-time-record-2090344",
    "timestamp": "2025-06-25T08:27:43Z"
  },
  {
    "title": "'Time to get serious on defense': A moment of truth for NATO as leaders seek unity on spending hike",
    "description": "NATO members have been facing pressure, particularly from ally Washington, to more than double their defense spending target.",
    "link": "https://www.cnbc.com/2025/06/25/its-time-to-get-serious-on-defense-moment-of-truth-for-nato.html",
    "timestamp": "2025-06-25T08:26:28Z"
  },
  {
    "title": "US intelligence contradicts Trump, says Iran's nuclear sites intact after attacks",
    "description": "A preliminary US intelligence assessment suggests that the American airstrikes on Iran's nuclear facilities failed to dismantle the core elements of its nuclear program, contradicting the claims made by President Donald Trump and his aides.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250624-presstv05.htm",
    "timestamp": "2025-06-25T08:19:24Z"
  },
  {
    "title": "United Kingdom to Buy F-35A Lightning for Tactical Nuclear Strike Role",
    "description": "The British government has announced it will purchase 12 new F-35A Lightning II fighter jets to contribute to NATO’s tactical nuclear forces. Prime Minister Sir Keir Starmer is to make the announcement at the NATO summit started on Jun. 24, 2025, that the UK …",
    "link": "https://theaviationist.com/2025/06/25/united-kingdom-to-buy-f-35a/",
    "timestamp": "2025-06-25T08:16:23Z"
  },
  {
    "title": "Article 5: How NATO's collective defence clause works - and the one time it has been invoked",
    "description": "President Donald Trump's visit to the NATO summit on Wednesday is being closely watched for one big reason: will he commit America to Article 5?",
    "link": "https://news.sky.com/story/article-5-how-natos-collective-defence-clause-works-and-the-one-time-it-has-been-invoked-13388300",
    "timestamp": "2025-06-25T08:15:00Z"
  },
  {
    "title": "U.S. Treasury yields: investors monitor Israel-Iran ceasefire",
    "description": "U.S. Treasury yields held steady on Wednesday as investors monitored the Israel-Iran ceasefire and awaited Fed Chairman Jerome Powell's congressional testimony.",
    "link": "https://www.cnbc.com/2025/06/25/us-treasury-yields-investors-monitor-israel-iran-ceasefire-.html",
    "timestamp": "2025-06-25T08:14:44Z"
  },
  {
    "title": "Trump's ‘worst nightmare’ Zohran Mamdani, who credited Bangladeshi aunties, is worth this much and his family details",
    "description": "Zohran Mamdani, poised to become New York City's youngest mayor, is drawing comparisons to Donald Trump. Mamdani frames his campaign as the antithesis to Trump's politics. His net worth contrasts sharply with Trump's wealth. Mamdani advocates for policies opp…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-worst-nightmare-zohran-mamdani-who-credited-bangladeshi-aunties-is-worth-this-much-and-his-family-details/articleshow/122065511.cms",
    "timestamp": "2025-06-25T08:10:52Z"
  },
  {
    "title": "Tariffs, taxes, turmoil: Trump enters fraught two-week run",
    "description": "US President Trump faces a critical period, navigating a fragile Israel-Iran ceasefire, a divided party for his tax bill, and global economic uncertainty over tariffs. With deadlines looming, including a July 4 target for the tax bill and the July 9 tariff pa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-deadline-2025-tax-turmoil-iran-trade-ceasefire-us-president-donald-trump-enters-fraught-two-week-run/articleshow/122063321.cms",
    "timestamp": "2025-06-25T08:09:13Z"
  },
  {
    "title": "Iran ‘much further away’ from building nuclear weapon after US strike, Rubio says",
    "description": "Secretary of State Marco Rubio told Politico on Wednesday that Iran was \" much further away from a nuclear weapon\" following a US strike on Tehran's three main nuclear sites over the weekend.",
    "link": "https://nypost.com/2025/06/25/world-news/iran-much-further-away-from-building-nuclear-weapon-after-us-strike-rubio-says/",
    "timestamp": "2025-06-25T08:05:06Z"
  },
  {
    "title": "Iranian parliament votes to suspend cooperation with international nuclear watchdog",
    "description": "Iran has not been shown to be developing nuclear weapons, despite claims to the contrary.",
    "link": "https://www.thejournal.ie/iranian-parliament-votes-to-suspend-cooperation-with-international-nuclear-watchdog-6743002-Jun2025/",
    "timestamp": "2025-06-25T08:03:43Z"
  },
  {
    "title": "Donald Trump’s disdain for wind energy could create windfall for Nova Scotia: experts",
    "description": "HALIFAX — U.S. President Donald Trump’s opposition to renewable energy could create a “golden opportunity” for Nova Scotia’s fledgling offshore wind energy industry, a leading international consulting firm says. Aegir Insights, based in Denmark, recently pres…",
    "link": "https://financialpost.com/pmn/donald-trumps-disdain-for-wind-energy-could-create-windfall-for-nova-scotia-experts",
    "timestamp": "2025-06-25T08:02:15Z"
  },
  {
    "title": "Rodney King-era 'rooftop Korean' calls left-wing riots manufactured: 'looking for the next George Floyd'",
    "description": "Former \"rooftop Korean\" who defended businesses during 1992 Rodney King riots claims current LA protests are politically manufactured amid ongoing anti-ICE demonstrations",
    "link": "https://www.foxnews.com/us/rodney-king-era-rooftop-korean-calls-left-wing-riots-manufactured-looking-next-george-floyd",
    "timestamp": "2025-06-25T08:00:55Z"
  },
  {
    "title": "NATO Summit begins – The defense spending deal and Trump’s show of strength",
    "description": "The U.S. President is expected to make a \"show of strength\" at the Summit – His scheduled meetings and the Greek stance\nThe post NATO Summit begins – The defense spending deal and Trump’s show of strength appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/25/nato-summit-begins-the-defense-spending-deal-and-trumps-show-of-strength/",
    "timestamp": "2025-06-25T08:00:28Z"
  },
  {
    "title": "Bitcoin Price Crash Below $100,000: Pundit Reveals Next Area Of Action To Start Buying",
    "description": "After the Bitcoin price breakdown below $100,000 over the weekend, multiple new narratives have emerged for where the digital asset may be headed. Calls for the next Bitcoin bear market continue to ring loud as analysts predict lower prices. One crypto analys…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-crash-100000-2/",
    "timestamp": "2025-06-25T08:00:14Z"
  },
  {
    "title": "Dream car plus 25% tariff? Ontario retiree's classic Mustang caught in trade war",
    "description": "Among the U.S. goods Canada has imposed a 25 per cent tariff on are classic cars. Including sales tax, Cameron Gillespie estimates he will be paying $30,000 in extra duties to Ottawa if he wants to import a 1969 Mustang.",
    "link": "https://www.cbc.ca/news/canada/hamilton/us-mustang-tariffs-1.7569274",
    "timestamp": "2025-06-25T08:00:00Z"
  }
]