[
  {
    "title": "The Trump Family Is Going All-In on Crypto Projects, From Bitcoin Mining to Stablecoins (Bloomberg)",
    "description": "Bloomberg:\nThe Trump Family Is Going All-In on Crypto Projects, From Bitcoin Mining to Stablecoins  —  President Donald Trump and his family have taken a interest in just about every corner of the crypto industry. … Taken together, the various projects are ap…",
    "link": "https://www.memeorandum.com/250412/p32",
    "timestamp": "2025-04-12T15:55:03Z"
  },
  {
    "title": "UK Parliament Approves Bill to Halt Closure of British Steel by Chinese Owners",
    "description": "UK lawmakers returned to Parliament from their Easter break on Saturday to approve an emergency rescue of the country's last remaining factory that makes steel from scratch.\nThe post UK Parliament Approves Bill to Halt Closure of British Steel by Chinese Owne…",
    "link": "https://www.breitbart.com/europe/2025/04/12/uk-parliament-approves-bill-to-halt-closure-of-british-steel-by-chinese-owners/",
    "timestamp": "2025-04-12T15:53:58Z"
  },
  {
    "title": "Trump Blinks (For Now)",
    "description": "From Bloomberg: President Donald Trump’s administration exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, representing a major reprieve for global technology manufacturers including Apple Inc. and Nvidia Corp. even i…",
    "link": "https://econbrowser.com/archives/2025/04/trump-blinks-for-now",
    "timestamp": "2025-04-12T15:53:37Z"
  },
  {
    "title": "Supreme Court allows Trump to deport Venezuelans under Alien Enemies Act",
    "description": "In a bitterly divided decision Monday, the court said the administration must give Venezuelans who it claims are gang members “reasonable time” to go to court.",
    "link": "https://www.lex18.com/news/supreme-court-allows-trump-to-deport-venezuelans-under-alien-enemies-act-after-judges-review",
    "timestamp": "2025-04-12T15:53:31Z"
  },
  {
    "title": "US now exempts tech products including smartphones and laptops from insane 145% tariff",
    "description": "In an interesting move, the Trump administration has announced tariff exemptions for tech and electronic products which include smartphones and laptops. The latest exemption comes after the the US government announced a staggering 145% reciprocal tariff on go…",
    "link": "https://soyacincau.com/2025/04/12/us-china-tariff-exempt-tech-products-smartphones-iphone-laptops-memory-ssd/",
    "timestamp": "2025-04-12T15:52:15Z"
  },
  {
    "title": "Why China's Rare Earth Curbs Could Devastate US Defense Industry",
    "description": "President Donald Trump knows his hike in tariffs for China's goods to 145 percent will up the ante in a trade war, but Beijing also holds a strong hand with its control of the materials critical for the United States defense industry. China first responded on…",
    "link": "https://freerepublic.com/focus/f-news/4310602/posts",
    "timestamp": "2025-04-12T15:52:02Z"
  },
  {
    "title": "Updating: All the tariff price increases in the tech world so far",
    "description": "President Donald Trump's tariff policies have only just gone into effect, and we're already seeing price hikes across consumer tech.\nPresident Trump has imposed a huge tariff rate of 145 percent on China (where many tech products are manufactured), as well as…",
    "link": "https://biztoc.com/x/6b121cd8ef361435",
    "timestamp": "2025-04-12T15:51:49Z"
  },
  {
    "title": "Bill Ackman Issues Stark Warning About Tariffs: 'When Markets Crash, New Investments Stop, Consumers Stop Spending Money'",
    "description": "Bill Ackman has outperformed the stock market over the past five years with Pershing Square Capital Management. The hedge fund chief was an advocate for Donald Trump during the campaign but doesn't agree with the president's stance on tariffs.\nStock market pa…",
    "link": "https://biztoc.com/x/fed97ad9c6abe2ea",
    "timestamp": "2025-04-12T15:51:48Z"
  },
  {
    "title": "Iran and U.S. agree to more talks about Tehran’s nuclear program after first round in Oman",
    "description": "Iran and the United States will hold more negotiations next week over Tehran’s rapidly advancing nuclear program, Iranian state television reported Saturday at the end of the first round of talks between the two countries since President Donald Trump returned…",
    "link": "https://biztoc.com/x/1c5df623440136ad",
    "timestamp": "2025-04-12T15:51:41Z"
  },
  {
    "title": "Why All US Immigrants, H-1B Workers, Green Card Holders Must Carry ID 24x7",
    "description": "This directive, part of Trump&#039;s executive order &#039;Protecting the American People Against Invasion&#039;, went into effect on April 11 and aims to crack down on illegal immigration and deport millions living illegally.",
    "link": "https://www.ndtv.com/world-news/why-all-us-immigrants-h1b-workers-green-card-holders-must-carry-id-24x7-8149722",
    "timestamp": "2025-04-12T15:47:44Z"
  },
  {
    "title": "I've roasted coffee for 25 years. The industry was in denial about Trump's tariffs until they disrupted our imports.",
    "description": "TJ Semanchin is the co-owner of Wonderstate Coffee, a Wisconsin-based coffee roaster. Donald Trump's 10% blanket tariffs mean Semanchin's company will have to make some hard decisions. Wonderstate typically imports 40,000 pounds of coffee in one transaction. …",
    "link": "https://freerepublic.com/focus/f-chat/4310600/posts",
    "timestamp": "2025-04-12T15:46:56Z"
  },
  {
    "title": "Tariffs can boost manufacturing, but are India's factories ready?",
    "description": "India has a golden opportunity to boost its manufacturing sector amidst US-China trade tensions, but restrictive land regulations hinder progress. These regulations, concerning ground coverage, setbacks, parking, and floor area ratio, lead to suboptimal land …",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/tariffs-can-boost-manufacturing-but-are-indias-factories-ready/articleshow/120237201.cms",
    "timestamp": "2025-04-12T15:44:53Z"
  },
  {
    "title": "Iran and U.S. agree to more talks about Tehran’s nuclear program after first round in Oman",
    "description": "Iran and the United States will hold more negotiations next week over Tehran’s rapidly advancing nuclear program, Iranian state television reported Saturday at the end of the first round of talks between the two countries since President Donald Trump returned…",
    "link": "https://www.pbs.org/newshour/world/iran-and-u-s-agree-to-more-talks-about-tehrans-nuclear-program-after-first-round-in-oman",
    "timestamp": "2025-04-12T15:43:47Z"
  },
  {
    "title": "'Not what I expected': Black Americans for Trump member unable to defend president's chaos",
    "description": "During an appearance on CNN's \"Table for Five,\" Black Americans for Trump Coalition member Melik Abdul came clean and admitted he had no answers or excuses for the president's \"chaotic week.\"Speaking with the panel, he singled out mixed messages from the Trum…",
    "link": "https://www.rawstory.com/trump-chaos-2671758984/",
    "timestamp": "2025-04-12T15:42:53Z"
  },
  {
    "title": "Tariffs could lead to major nightmare for U.S. tech stocks",
    "description": "Since last week, the U.S. government’s new tariff policies have dominated news cycles, generating panic for investors and consumers.\nPresident Donald Trump kicked off a highly volatile economic period with an event he described as “Liberation Day.” But as the…",
    "link": "https://biztoc.com/x/b5cad19d94bda12e",
    "timestamp": "2025-04-12T15:40:57Z"
  },
  {
    "title": "NATO Chief Warns Russia Looking to Deploy Nuclear Weapons in Space",
    "description": "Russia is looking to deploy nuclear weapons in outer space to increase its influence and potentially target satellites, the head of NATO claimed.\nThe post NATO Chief Warns Russia Looking to Deploy Nuclear Weapons in Space appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/12/nato-chief-warns-russia-looking-to-deploy-nuclear-weapons-in-space/",
    "timestamp": "2025-04-12T15:40:47Z"
  },
  {
    "title": "Queen says King wants to do 'more and more and more' despite health worries",
    "description": "I'm not sure their police officers felt the same from the looks on their faces, but the King and Queen, we're told, were on a \"huge high\" after making their way through the scrum of entourage, security and locals while on walkabout in Ravenna.",
    "link": "https://news.sky.com/story/queen-says-king-wants-to-do-more-and-more-and-more-despite-health-worries-13347362",
    "timestamp": "2025-04-12T15:40:00Z"
  },
  {
    "title": "Russia and Ukraine Accuse Each Other of Violating Truce on Energy Infrastructure Attacks",
    "description": "Russia and Ukraine's top diplomats on Saturday used a high-level conference in Turkey to once again trade accusations of violating a tentative U.S.-brokered deal to pause strikes on energy infrastructure, underscoring the challenges of negotiating an end to t…",
    "link": "https://www.breitbart.com/europe/2025/04/12/russia-and-ukraine-accuse-each-other-of-violating-truce-on-energy-infrastructure-attacks/",
    "timestamp": "2025-04-12T15:39:48Z"
  },
  {
    "title": "Bill Maher Dishes On Dinner With Trump, Calls Him 'Gracious And Measured'",
    "description": "The \"Real Time\" host, who recently lobbed preemptive insults at critics of the meeting, recounted it Friday in a lengthy monologue.",
    "link": "https://www.huffpost.com/entry/bill-maher-donald-trump-dinner-gracious-measured_n_67fa6b01e4b0493abe65e7ca",
    "timestamp": "2025-04-12T15:39:05Z"
  },
  {
    "title": "Trump says he took a cognitive test during his physical and ‘got every answer right’",
    "description": "President Donald Trump said he “got every answer right” on a cognitive test that he took as part of his annual physical exam on Friday.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-cognitive-test-physical-exam-annual-2025-rcna200983",
    "timestamp": "2025-04-12T15:38:08Z"
  },
  {
    "title": "America First or Made in China? Trump Hotel’s gift shop under fire as majority of products trace back to Chinese factories, Americans mock as video goes viral on social media",
    "description": "Trump Hotel gift shop controversy is going viral after a video revealed most Trump Store products are made in China and other countries—not the USA. Despite President Donald Trump's strong “America First” message, items like hats, shirts, and pullovers sold a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/america-first-or-made-in-china-trump-hotels-gift-shop-under-fire-as-majority-of-products-trace-back-to-chinese-factories-americans-mock-as-video-goes-viral-on-social-media/articleshow/120235714.cms",
    "timestamp": "2025-04-12T15:34:55Z"
  },
  {
    "title": "Trump's China tariff shocks US importers. One CEO calls it 'end of days'",
    "description": "U.S. importers are bracing for the impact of President Donald Trump's staggering 145% levy on Chinese imports.",
    "link": "https://www.clickondetroit.com/business/2025/04/12/trumps-china-tariffs-swing-a-sledgehammer-at-importers-and-cheap-goods/",
    "timestamp": "2025-04-12T15:31:25Z"
  },
  {
    "title": "With Trump's backing Israel pushes deeper into Gaza as pressure builds for hostage deal",
    "description": "An Israeli official says military operations and hostage talks are fully coordinated with the U.S., as officials remain optimistic about a deal. Israel continues its advance in Gaza.",
    "link": "https://www.foxnews.com/world/trumps-backing-israel-pushes-deeper-gaza-pressure-builds-hostage-deal",
    "timestamp": "2025-04-12T15:30:58Z"
  },
  {
    "title": "Trump likely to propose pay freeze for federal workers in 2026",
    "description": "In OMB’s response to agency budget submissions, the White House budget office told officials to prepare for a freeze on federal civilian pay next year.",
    "link": "https://www.govexec.com/pay-benefits/2025/04/trump-likely-propose-pay-freeze-federal-workers-2026/404502/",
    "timestamp": "2025-04-12T15:30:17Z"
  },
  {
    "title": "Record number of adult baptisms in France shows surge among youth",
    "description": "The choir, clergy and guests stand during the ceremony to mark the reopening of Notre-Dame of Paris Cathedral on Dec. 7, 2024, in Paris, France. After five years of restoration, Notre-Dame Cathedral in Paris reopened its doors to the world in the presence of …",
    "link": "https://www.catholicnewsagency.com/news/263349/france-sees-record-10384-adult-baptisms-in-2025-45-percent-increase-as-young-catholics-lead-revival",
    "timestamp": "2025-04-12T15:30:00Z"
  },
  {
    "title": "Amex Stock: 2 Experts Argue Pros and Cons of ‘Buying the Dip’ Amid Trump Tariff Drama",
    "description": "In the recent stock market turmoil that has coincided with President Donald Trump’s reciprocal tariffs, so many stocks across industries have taken substantial hits. Even companies that aren’t necessarily directly affected by tariffs, due to not basing their …",
    "link": "https://biztoc.com/x/b9982f0dc61a34ec",
    "timestamp": "2025-04-12T15:29:51Z"
  },
  {
    "title": "Iran and US agree to more talks over Tehran’s nuclear program after first round in Oman",
    "description": "Iran and the United States will hold more negotiations next week over Tehran’s rapidly advancing nuclear program, Iranian state television reported Saturday at the end of the first round of talks between the two countries since President Donald Trump returned…",
    "link": "https://biztoc.com/x/455dc79f9bb7c318",
    "timestamp": "2025-04-12T15:29:46Z"
  },
  {
    "title": "Trump Exempts Phones, Computers From Reciprocal Tariffs: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's \"reciprocal\" tariffs, as of a Friday night update, spares smartphones, computers, and other electronic products that had been expected to face steep duties under sweeping new levies, p…",
    "link": "https://biztoc.com/x/dffea0d75a21ff58",
    "timestamp": "2025-04-12T15:29:44Z"
  },
  {
    "title": "Trump Tariffs Rattle China to Vietnam",
    "description": "US President Donald Trump shocked the world -- and global markets -- with tariffs that exceeded expectations last week. But there was one region that was hit harder than most: Asia. Exporting powerhouses like China and Vietnam were slapped with some of the hi…",
    "link": "https://biztoc.com/x/afd6ca42a8787da1",
    "timestamp": "2025-04-12T15:29:39Z"
  },
  {
    "title": "Trump Exempts Phones, Computers From Reciprocal Tariffs: What to Know",
    "description": "In a Friday night update, the Trump administration spared computers, smartphones, and other electronic parts from his latest \"reciprocal tariffs.\"",
    "link": "https://www.newsweek.com/trump-exempts-phones-computers-reciprocal-tariffs-china-2058997",
    "timestamp": "2025-04-12T15:28:43Z"
  },
  {
    "title": "Smartphones and computers are exempt from Trump's global tariffs, US announces",
    "description": "The exemptions announced cover various electronic goods entering the US from China.",
    "link": "https://www.thejournal.ie/phones-and-computers-exempt-from-tariffs-us-6676475-Apr2025/",
    "timestamp": "2025-04-12T15:27:45Z"
  },
  {
    "title": "Trump exempts smartphones and computers from new tariffs",
    "description": "US President Donald Trump's administration has exempted smartphones and computers from reciprocal tariffs, including the 125% levies imposed on Chinese imports.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/Trump-exempts-smartphones-and-computers-from-new-tariffs-1979629",
    "timestamp": "2025-04-12T15:18:23Z"
  },
  {
    "title": "Trump Family Now Reportedly Selling Ethereum At A Loss 2 Months After Eric Said 'It's A Great Time To Add ETH'",
    "description": "An entity partly controlled by Eric Trump may be selling its Ethereum holdings despite his infamous buy the dip post in February. The reported sale has...",
    "link": "https://finance.yahoo.com/news/trump-family-now-reportedly-selling-151633370.html",
    "timestamp": "2025-04-12T15:16:33Z"
  },
  {
    "title": "Government Announces Plan to Liquidate Millions of Acres of Forest",
    "description": "Now well into his second term, it's no secret that Donald Trump wields his emergency powers like Musk uses slurs. That is to say, he does it a lot. So far, Trump's declared national emergencies to classify drug smugglers as terrorists, the migrant crisis as a…",
    "link": "https://futurism.com/government-plans-harvest-forest-nepa",
    "timestamp": "2025-04-12T15:15:26Z"
  },
  {
    "title": "What Happened To The Cast Of Charles In Charge?",
    "description": "Charles in Charge was canceled after one season before being brought back and retooled to great success. But what happened to the show's cast after it was over?",
    "link": "https://www.slashfilm.com/1830250/what-happened-charles-in-charge-cast/",
    "timestamp": "2025-04-12T15:15:00Z"
  },
  {
    "title": "Iran, U.S. hold talks on Tehran's nuclear program amid heightened Middle East tensions",
    "description": "Iran and the United States held talks in Oman on Saturday aimed at jump-starting negotiations over Tehran's fast-advancing nuclear program, with U.S. President Donald Trump threatening military action if there is no deal.",
    "link": "https://www.cbc.ca/news/world/iran-u-s-nuclear-talks-trump-oman-1.7508906",
    "timestamp": "2025-04-12T15:13:29Z"
  },
  {
    "title": "Russia And Ukraine Accuse Each Other Of Failing To Pause Strikes After U.S. Envoy Leaves Moscow",
    "description": "Ukraine has endorsed a broader U.S. ceasefire proposal, but Russia has effectively blocked it by imposing far-reaching conditions.",
    "link": "https://www.huffpost.com/entry/russia-ukraine-accuse-each-other-failing-pause-strikes-united-states-envoy-leaves-moscow_n_67fa8019e4b0493abe65e8be",
    "timestamp": "2025-04-12T15:10:38Z"
  },
  {
    "title": "JOSH HAMMER: Trump’s Life’s Work Culminates In Confronting Communist China",
    "description": "Trump has long seen things differently than most of his white-shoe brethren",
    "link": "https://dailycaller.com/2025/04/12/opinion-trumps-lifes-work-culminates-in-confronting-communist-china-josh-hammer/",
    "timestamp": "2025-04-12T15:09:13Z"
  },
  {
    "title": "Britain’s MPs vote to take control of British Steel",
    "description": "Dramatic intervention follows tense standoff with Chinese firm Jingye, British Steel’s owner.",
    "link": "https://www.politico.eu/article/britains-mps-vote-to-take-control-of-british-steel/",
    "timestamp": "2025-04-12T15:08:42Z"
  },
  {
    "title": "Bike shop owners expect bumpy road as U.S., China trade war heats up",
    "description": "Roger Walsworth is riding out the latest tariff talks with China officials led by U.S. President Donald Trump.\nWalsworth, the owner of Buck’s Bicycle Shop in Valparaiso, has been selling bikes for 53 years in Valparaiso.\nHe’s well aware of the latest tariff d…",
    "link": "https://biztoc.com/x/986530989dee0763",
    "timestamp": "2025-04-12T15:07:24Z"
  },
  {
    "title": "US wants control of key gas pipeline in Ukraine — Reuters",
    "description": "The demand is an “Easter egg” contained in Washington’s proposed minerals deal, the agency has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615674-us-ukraine-gazprom-minerals/",
    "timestamp": "2025-04-12T15:06:42Z"
  },
  {
    "title": "Iran and U.S. agree to more talks over Tehran’s nuclear program",
    "description": "Iran and the United States will hold more negotiations next week over Tehran’s rapidly advancing nuclear program, Iranian state television reported Saturday.",
    "link": "https://www.nbcnews.com/news/world/iran-us-agree-to-more-talks-nuclear-program-rcna200991",
    "timestamp": "2025-04-12T15:05:02Z"
  },
  {
    "title": "Whew! Trump tariffs won’t hit iPhone, Mac and other electronics.",
    "description": "President Trump removed the hefty tariffs he’d imposed on phone, computers and many other electronics.\n(via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "link": "https://www.cultofmac.com/news/iphone-trump-tariff-exemption",
    "timestamp": "2025-04-12T15:01:52Z"
  },
  {
    "title": "What We Now Know About the IRS-ICE Tax Data Deal",
    "description": "With only a few days left before Tuesday’s filing deadline, the Internal Revenue Service made a major change in how President Donald Trump’s administration can use the tax records of certain undocumented immigrants. On April 7, Secretary of the Treasury Scott…",
    "link": "https://www.kqed.org/news/12035735/what-we-now-know-about-the-irs-ice-tax-data-deal",
    "timestamp": "2025-04-12T15:00:59Z"
  },
  {
    "title": "Bitcoin Long-Term Holders Are Buying Again — Can They Push BTC Price Higher?",
    "description": "After a dreadful start to the week, the price of Bitcoin appears to be recovering nicely with a strong rally to begin the weekend. The latest on-chain data shows that a specific class of investors might be behind the relative stability experienced by the prem…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-long-term-holders-are-buying-again-price-higher/",
    "timestamp": "2025-04-12T15:00:43Z"
  },
  {
    "title": "US toy industry faces major blow with China tariffs",
    "description": "Trump's tariffs on China are making it more expensive for Americans to buy toys, as nearly 80% of all toys sold in the US are manufactured in China.",
    "link": "https://www.wishtv.com/news/business/china-toys-tariffs-145-percent/",
    "timestamp": "2025-04-12T15:00:40Z"
  },
  {
    "title": "After 1st Round Today, Iran, US Agree To Continue Nuclear Talks Next Week",
    "description": "Iran and the US will hold more negotiations next week over Tehran&#039;s rapidly advancing nuclear program, Iranian state television reported at the end of the first round of talks between the two countries since Trump returned to the White House.",
    "link": "https://www.ndtv.com/world-news/after-1st-round-today-iran-us-agree-to-continue-nuclear-talks-next-week-8149388",
    "timestamp": "2025-04-12T14:57:36Z"
  },
  {
    "title": "Trump exempts smartphones and computers from new tariffs",
    "description": "Trump exempts smartphones and computers from new tariffs\nUS President Donald Trump's administration has exempted smartphones and computers from reciprocal tariffs, including the 125% levies imposed on Chinese imports.\nUS Customs and Border Patrol published a …",
    "link": "https://biztoc.com/x/5913f8fa7b7c867f",
    "timestamp": "2025-04-12T14:57:04Z"
  },
  {
    "title": "Donald Trump's Approval Rating Falls to New Low With Republican Pollster",
    "description": "Trump has struggled in the polls on the economy, once a strong topic for the president, amid waves of new tariffs.",
    "link": "https://biztoc.com/x/4432f4f77807ae80",
    "timestamp": "2025-04-12T14:56:29Z"
  },
  {
    "title": "MSNBC’s Nicolle Wallace: Trump’s Tariffs Are ‘Emasculating’",
    "description": "MSNBC host Nicolle Wallace said Friday on “Deadline” that there was “nothing more emasculating” than the tariffs being implemented by President Donald Trump. Wallace said, “So, Mitch, I spent nine months having to learn about the power of the manosphere and s…",
    "link": "https://freerepublic.com/focus/f-news/4310590/posts",
    "timestamp": "2025-04-12T14:51:16Z"
  },
  {
    "title": "Donald Trump health update: Oldest US President undergoes physical examination, White House to release full results that could offer clear look at condition since his ear was grazed by a bullet in Pennsylvania",
    "description": "The physical test results could offer the first clear look at President Donald Trump's condition since his ear was grazed by a bullet in an assassination attempt during a campaign rally in Butler, Pennsylvania, last July.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-health-update-oldest-us-president-undergoes-physical-examination-white-house-to-release-full-results-that-could-offer-clear-look-at-condition-since-his-ear-was-grazed-by-a-bullet-in-pennsylvania/articleshow/120236662.cms",
    "timestamp": "2025-04-12T14:50:48Z"
  },
  {
    "title": "Donald Trump's Approval Rating Falls to New Low With Republican Pollster",
    "description": "Trump has struggled in the polls on the economy, once a strong topic for the president, amid waves of new tariffs.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-today-2058972",
    "timestamp": "2025-04-12T14:50:13Z"
  },
  {
    "title": "Iran and US agree to more talks over Tehran's nuclear program after 1st round in Oman",
    "description": "Iran and the United States convened in Oman for negotiations regarding Tehran's nuclear program, marking the first talks since President Trump's return. Discussions, mediated by Omani officials, addressed Iran's enrichment levels and potential sanctions relie…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-and-us-agree-to-more-talks-over-tehrans-nuclear-program-after-1st-round-in-oman/articleshow/120236728.cms",
    "timestamp": "2025-04-12T14:48:26Z"
  },
  {
    "title": "Smartphones and laptops among items excluded from reciprocal tariffs, US says",
    "description": "Electronics such as smartphones and laptops will be excluded from reciprocal tariffs, the Trump administration has said.",
    "link": "https://news.sky.com/story/smartphones-and-laptops-among-items-excluded-from-reciprocal-tariffs-us-says-13347295",
    "timestamp": "2025-04-12T14:48:00Z"
  },
  {
    "title": "NATO Is a Corpse",
    "description": "NATO is a corpse. All that remains is the grotesque performance art of a diplomatic zombie stumbling from summit to summit, mouthing tired clichés about “shared values” and “burden sharing,” even as its core strategic logic lies rotting beneath the surface. T…",
    "link": "https://freerepublic.com/focus/f-news/4310587/posts",
    "timestamp": "2025-04-12T14:47:23Z"
  },
  {
    "title": "'This is bull!' George Conway dismantles Trump administration's 'game playing'",
    "description": "Conservative attorney George Conway hammered away at Donald Trump and his administration's efforts to deny responsibility for mistakenly shipping a 29-year-old Maryland man to El Salvador and then doing all they can do to avoid bringing him back.Noting the DO…",
    "link": "https://www.rawstory.com/trump-game-playing/",
    "timestamp": "2025-04-12T14:47:12Z"
  },
  {
    "title": "Trump exempts phones, computers, chips from new tariffs (Erin Doherty/CNBC)",
    "description": "Erin Doherty / CNBC:\nTrump exempts phones, computers, chips from new tariffs … Smartphones and computers will be exempted from President Donald Trump's reciprocal tariffs, according to new guidance from U.S. Customs and Border Protection.  —  The guidance com…",
    "link": "https://www.memeorandum.com/250412/p24",
    "timestamp": "2025-04-12T14:45:00Z"
  },
  {
    "title": "Bitcoin Price Tops $84.5K, Looks to End Downtrend as Trump Exempts Key Tech From Reciprocal Tariffs",
    "description": "Major cryptocurrencies like ETH, XRP, and ADA saw significant gains, indicating increased risk-taking in the market.",
    "link": "https://www.coindesk.com/markets/2025/04/12/bitcoin-price-tops-usd84-5k-looks-to-end-downtrend-as-trump-exempts-key-tech-from-reciprocal-tariffs",
    "timestamp": "2025-04-12T14:42:33Z"
  },
  {
    "title": "There’s No Coming Back From Trump’s Tariff Disaster",
    "description": "America was the world’s economic anchor. Thanks to the president, it may never have that role again.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/trump-tariff-chaos-unfixable/682419/",
    "timestamp": "2025-04-12T14:38:54Z"
  },
  {
    "title": "US exempts smartphones and computers from Trump's reciprocal tariffs",
    "description": "The exemptions announced by the US Customs and Border Protection office cover various electronic goods including smartphones and components entering the United States from China.",
    "link": "https://www.abc.net.au/news/2025-04-13/us-exempts-smartphones-computers-from-trump-tariffs/105170196",
    "timestamp": "2025-04-12T14:38:03Z"
  },
  {
    "title": "Trump’s retribution sends a chilling message to dissenters",
    "description": "Donald Trump’s White House has a threatening message for anyone who might even be perceived to disagree with the president: Don’t. Or else.",
    "link": "https://www.cnn.com/2025/04/12/politics/trump-krebs-khalil-taylor-crackdown-dissent-what-matters/index.html",
    "timestamp": "2025-04-12T14:37:11Z"
  },
  {
    "title": "My Pillow's Correspondent Asks How Trump Got So Hunky And Buff",
    "description": "When did the United States become North Korea?\nSource: The Independent\nWhite House press secretary Karoline Leavitt ended Friday’s press briefing by calling on Cara Castronuova, a former boxer and failed MAGA candidate who now works at the pro-Trump propagand…",
    "link": "https://crooksandliars.com/2025/04/my-pillows-correspondent-asks-how-trump",
    "timestamp": "2025-04-12T14:33:56Z"
  },
  {
    "title": "Donald Trump exempts phones, chips from new tariffs",
    "description": "According to new guidance, Donald Trump will be exempting smartphones and other electronic components and parts from tariffs.",
    "link": "https://www.androidcentral.com/phones/donald-trump-exempts-phones-chips-from-new-tariffs",
    "timestamp": "2025-04-12T14:30:19Z"
  },
  {
    "title": "Trump spares smartphones, computers, other electronics from his 125% China tariffs",
    "description": "WASHINGTON/WEST PALM BEACH: The US government has granted tariff exclusions for smartphones, computers and other electronics imported largely from China, sparing them from President Donald Trump's steep 125 pe",
    "link": "https://www.channelnewsasia.com/business/trump-spares-smartphones-computers-other-electronics-his-125-china-tariffs-5062011",
    "timestamp": "2025-04-12T14:30:00Z"
  },
  {
    "title": "US excludes smartphones, computers from Trump's reciprocal tariffs",
    "description": "The Trump administration has granted tariff exclusions for smartphones, computers and other electronics imports supplied largely by China, sparing them from much of US President Donald Trump's steep 145 p",
    "link": "https://www.channelnewsasia.com/business/us-excludes-smartphones-computers-trumps-reciprocal-tariffs-5062011",
    "timestamp": "2025-04-12T14:30:00Z"
  },
  {
    "title": "President Trump exempts smartphones and computers from new U.S. import tariffs",
    "description": "President Donald Trump's administration has excluded smartphones and computers from its reciprocal tariffs, which include a 125% tariff…\nThe post President Trump exempts smartphones and computers from new U.S. import tariffs appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/04/12/president-trump-exempts-smartphones-and-computers-from-new-u-s-import-tariffs/",
    "timestamp": "2025-04-12T14:24:43Z"
  },
  {
    "title": "Phones and computers exempted from US ‘reciprocal’ tariffs",
    "description": "<p>WASHINGTON - President Donald Trump&rsquo;s administration has exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, potentially cushioning consumers from sticker shock while benefiting electronics giants including Ap…",
    "link": "https://www.bangkokpost.com/business/general/3001854/phones-and-computers-exempted-from-us-reciprocal-tariffs",
    "timestamp": "2025-04-12T14:24:00Z"
  },
  {
    "title": "The Trump administration couldn't pass its own citizenship test",
    "description": "Could Donald Trump, Elon Musk, JD Vance or Dan Bongino pass the U.S. citizenship test? Their past answers suggest it might be harder than they think.",
    "link": "https://biztoc.com/x/286979705e5b6687",
    "timestamp": "2025-04-12T14:23:36Z"
  },
  {
    "title": "Trump and His Sycophants Are Dismantling the Capacity to Govern",
    "description": "I was in Spain for the month of February while President Donald Trump and his merry band of corrupt oligarchs and sycophants brought a cruel chaos to the United States. While in Spain, it was easy enough to get an overview of the extent to which America seeme…",
    "link": "https://www.fairobserver.com/politics/trump-and-his-sycophants-are-dismantling-the-capacity-to-govern/",
    "timestamp": "2025-04-12T14:19:25Z"
  },
  {
    "title": "Trump and Musk’s Attack on Government Is an Attack on Equity and Stability",
    "description": "U.S. President Donald Trump and Elon Musk’s shared goal of fully privatizing public services from the postal service to Social Security and Medicare will destabilize society, broadening the wide chasm of socioeconomic inequalities already haunting the nation’…",
    "link": "https://www.commondreams.org/opinion/trump-musk-attack-government",
    "timestamp": "2025-04-12T14:17:03Z"
  },
  {
    "title": "Conservatives Shut Out By ‘Big Law’ Have Little Sympathy As Firms Face Major Upset Under Trump",
    "description": "Lawyers who faced professional penalties for sticking by President Donald Trump's side can't help but see objections to law firm deals as hypocritical.",
    "link": "https://dailycaller.com/2025/04/12/conservatives-big-law-firms-upset-trump/",
    "timestamp": "2025-04-12T14:17:00Z"
  },
  {
    "title": "Why 4 Democrats defied their party to protect American elections from illegal aliens",
    "description": "The House passed a Republican-led bill requiring proof of citizenship for voter registration on Thursday. Despite Democrats' overwhelming disapproval of the key legislation, four Democratic lawmakers reached across the aisle. Texas Republican Rep. Chip Roy's …",
    "link": "https://www.theblaze.com/news/why-4-democrats-defied-their-party-to-protect-american-elections-from-illegal-aliens",
    "timestamp": "2025-04-12T14:15:00Z"
  },
  {
    "title": "Israel Cuts Off Gaza's City Of Rafah, Vows To 'Vigorously' Expand In The Territory",
    "description": "Israel imposed a monthlong blockade on food, fuel and humanitarian aid that has left the territory’s roughly 2 million Palestinians facing acute shortages.",
    "link": "https://www.huffpost.com/entry/israel-cuts-off-gaza-rafah-vows-vigorously-expand-territory_n_67fa730ce4b0493abe65e7d9",
    "timestamp": "2025-04-12T14:13:50Z"
  },
  {
    "title": "BREAKING: Trump Exempts Phones, Computers and More From Tariffs",
    "description": "Smartphones and computers will be exempt from Trump's steep China tariffs, the U.S. Customs and Border Protection revealed late on Friday night.\nThe post BREAKING: Trump Exempts Phones, Computers and More From Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/breaking-trump-exempts-phones-computers-and-more-from-tariffs/",
    "timestamp": "2025-04-12T14:13:22Z"
  },
  {
    "title": "Trump omits smartphones, chips from China duties",
    "description": "United States Donald Trump excluded a variety of technological devices, including semiconductors and smartphones, from his 145% tariff on Chinese exports, according to new guidance published by Custom...",
    "link": "https://biztoc.com/x/0e26ea85e2b5cef2",
    "timestamp": "2025-04-12T14:13:02Z"
  },
  {
    "title": "'Dream news' for tech sector as US announces tariff exemptions",
    "description": "Donald Trump talks to reporters on February 2, 2025, in Maryland.\nJim WATSON / AFP\nThe US has announced that a number of key tech products will be exempted from Trump's \"reciprocal\" tariffs.\nSmartphones, chip making equipment, and other electronics will be ex…",
    "link": "https://biztoc.com/x/ae938007e8afe994",
    "timestamp": "2025-04-12T14:12:46Z"
  },
  {
    "title": "Trump carves out massive exemptions from reciprocal tariffs, including smartphones, chips and computers",
    "description": "In a notice published late Friday night, US Customs and Border Protection issued new guidance on President Donald Trump's so-called reciprocal tariffs, listing several exemptions like smartphones, computers, chips and other electronics. That carves out a mass…",
    "link": "https://biztoc.com/x/029d2ce05b8734bf",
    "timestamp": "2025-04-12T14:12:34Z"
  },
  {
    "title": "Donald Trump issues list of exemptions from 'Liberation Day' tariffs including phones and laptops in latest move",
    "description": "Donald Trump has exempted out selected products from the 'Liberation Day' tariffs",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-liberation-day-tariffs-exemptions-518588-20250412",
    "timestamp": "2025-04-12T14:11:51Z"
  },
  {
    "title": "Donald Trump exempts phones, computers and chips from ‘reciprocal’ tariffs",
    "description": "Products may yet be subject to a different tariff",
    "link": "https://www.irishtimes.com/world/us/2025/04/12/donald-trump-exempts-phones-computers-and-chips-from-reciprocal-tariffs/",
    "timestamp": "2025-04-12T14:11:37Z"
  },
  {
    "title": "Mark Hamill Shares Meme Hoping Trump Will 'Just Die' in BlueSky's Fever Swamp",
    "description": "Disney's Stars Wars star Mark Hamill took his Trump derangement to a new level this week, sharing a meme on the anti-MAGA social media cesspool Bluesky, hoping President Donald Trump would \"Just Die.\"",
    "link": "https://www.breitbart.com/entertainment/2025/04/12/mark-hamill-shares-meme-hoping-trump-will-just-die-in-blueskys-fever-swamp/",
    "timestamp": "2025-04-12T14:11:35Z"
  },
  {
    "title": "‘Camouflaged invasion’: Panama opposition slams security pact with the US",
    "description": "Panama's opposition speaks out against deal that allows the deployment of US troops in the Central American nation.",
    "link": "https://www.aljazeera.com/news/2025/4/12/camouflaged-invasion-panama-opposition-slams-security-pact-with-the-us",
    "timestamp": "2025-04-12T14:10:43Z"
  },
  {
    "title": "Trump exempts phones, computers, chips from new tariffs",
    "description": "Smartphones and computers are among many tech devices and components that will be exempted from new tariffs imposed by President Donald Trump, according to new guidance from U.S.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-exempts-phones-computers-chips-new-tariffs-rcna200988",
    "timestamp": "2025-04-12T14:08:32Z"
  },
  {
    "title": "The popular baseball food that increases the risk of colorectal cancer according to doctors",
    "description": "It may seem like a monumental truism, but sometimes we need to be told things as they are, and the truth about one of the most popular and consumed foods inside a baseball stadium",
    "link": "https://www.marca.com/en/mlb/2025/04/12/67fa703d268e3e236a8b458a.html",
    "timestamp": "2025-04-12T14:05:49Z"
  },
  {
    "title": "Team Trump Is Gaming Out How to Ship U.S. Citizens to El Salvador (Rolling Stone)",
    "description": "Rolling Stone:\nTeam Trump Is Gaming Out How to Ship U.S. Citizens to El Salvador  —  Trump officials are talking internally about denaturalizing American citizens — and potentially sending some to El Salvador  —  Donald Trump and his White House have moved to…",
    "link": "https://www.memeorandum.com/250412/p19",
    "timestamp": "2025-04-12T14:05:00Z"
  },
  {
    "title": "Trump's Horrifying Removal of Man in \"Error\" Takes an Even Darker Turn (Greg Sargent/New Republic)",
    "description": "Greg Sargent / New Republic:\nTrump's Horrifying Removal of Man in “Error” Takes an Even Darker Turn … On Thursday, the Supreme Court issued a simple directive to the U.S. government.  Or it would have been simple, anyway, if President Donald Trump weren't eng…",
    "link": "https://www.memeorandum.com/250412/p20",
    "timestamp": "2025-04-12T14:05:00Z"
  },
  {
    "title": "'Dream news' for tech sector as US announces tariff exemptions",
    "description": "Wall Street analyst Dan Ives called it \"dream news\" for the tech industry and \"massive relief\" for tech stocks.",
    "link": "https://www.businessinsider.com/dream-news-tech-sector-trump-announces-tariff-exemptions-2025-4",
    "timestamp": "2025-04-12T14:04:02Z"
  },
  {
    "title": "It’s not just a tariff war, a meme war has broken out between the U.S. and China; here’s how Americans are responding to Chinese videos",
    "description": "U.S.-China meme war has taken over digital platforms as a new chapter in the ongoing trade conflict. With rising tensions, Chinese state-affiliated accounts are using AI-generated memes and videos to poke fun at American figures like President Donald Trump an…",
    "link": "https://economictimes.indiatimes.com/news/international/us/its-not-just-a-tariff-war-a-meme-war-has-broken-out-between-the-u-s-and-china-heres-how-americans-are-responding-to-chinese-videos/articleshow/120233700.cms",
    "timestamp": "2025-04-12T14:02:57Z"
  },
  {
    "title": "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down",
    "description": "Casual attitude as markets fall suggests man detached from anxieties of ordinary voters – and surrounded by yes men\nAfter lighting a fuse under global financial markets, Donald Trump stepped back – all the way to a Florida golf course. A week later, having ju…",
    "link": "https://biztoc.com/x/733f7ccca4989bd7",
    "timestamp": "2025-04-12T14:02:02Z"
  },
  {
    "title": "Trump Envoy Proposes NATO 'Resiliency Force' Across Ukraine",
    "description": "Keith Kellogg, President Donald Trump's special envoy, announced his plans for a ceasefire between Kyiv and Moscow.",
    "link": "https://biztoc.com/x/6ffedaf74afd0d04",
    "timestamp": "2025-04-12T14:01:46Z"
  },
  {
    "title": "Here's what happened during Trump's 12th week in office",
    "description": "Trump announced the U.S. would lower reciprocal tariffs for other countries, while also revealing that his administration would immediately hike tariffs on Chinese goods to 145%.",
    "link": "https://www.foxnews.com/politics/heres-what-happened-during-trumps-12th-week-office",
    "timestamp": "2025-04-12T14:00:17Z"
  },
  {
    "title": "‘Consequences’ Come for Maine After Failure to Agree to Title IX Compliance",
    "description": "\"Governor Mills would have done well to adhere to the wisdom embedded in the old idiom—be careful what you wish for. Now she will see the Trump Administration in court.\"\nThe post ‘Consequences’ Come for Maine After Failure to Agree to Title IX Compliance firs…",
    "link": "https://legalinsurrection.com/2025/04/consequences-come-for-maine-after-failure-to-agree-to-title-ix-compliance/",
    "timestamp": "2025-04-12T14:00:12Z"
  },
  {
    "title": "Tax Breaks: The Week That Turned Out To Be A Wild Ride Edition",
    "description": "Plus: Tariffs, more cuts coming at IRS, paying taxes with a credit card, tax season filing statistics, IRS website errors, conferences & deadlines, tax trivia and more.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/04/12/tax-breaks-the-week-that-turned-out-to-be-a-wild-ride-edition/",
    "timestamp": "2025-04-12T14:00:00Z"
  },
  {
    "title": "Trump’s Tariffs Shook the Economy. This Website’s Response Might Matter More.",
    "description": "Inside the strange, high-stakes debate over one word—and who gets to define history in real time.",
    "link": "https://slate.com/technology/2025/04/trump-news-2025-stock-market-crash-wikipedia-controversy.html",
    "timestamp": "2025-04-12T14:00:00Z"
  },
  {
    "title": "Trump’s Iran talks can succeed if the administration embraces reality rather than myth",
    "description": "The talks between Iran and the U.S. set to begin today have a chance to succeed if the Trump administration grounds its policy in the realities of Iran's nuclear program, not fearmongering promoted by Israel and its allies.",
    "link": "https://mondoweiss.net/2025/04/trumps-iran-talks-can-succeed-if-the-administration-embraces-reality-rather-than-myth/",
    "timestamp": "2025-04-12T14:00:00Z"
  }
]