[
  {
    "title": "‘Raises serious questions’: White House blasts Episcopal church over refusal to help white refugees",
    "description": "Doubts expressed about organization's 'commitment to humanitarian aid'",
    "link": "https://www.wnd.com/2025/05/raises-serious-questions-white-house-blasts-episcopal-church-over-refusal-to-help-white-refugees/",
    "timestamp": "2025-05-14T13:48:32Z"
  },
  {
    "title": "Normalizing Relations",
    "description": "Trump says we might normalize relations with Syria: Last year, Bashar al-Assad's regime collapsed. Now, President Donald Trump is in the Middle East, exploring normalizing relations with the new government of Syria and promising to lift sanctions. \nTrump met …",
    "link": "https://biztoc.com/x/06fea0cc1b20093c",
    "timestamp": "2025-05-14T13:48:21Z"
  },
  {
    "title": "World Now Sees China, Xi More Favourably Than US, Trump",
    "description": "Global perceptions of the world’s two biggest economies have undergone a dramatic change – with the United States and its leader Donald Trump now seen in a worse light than China and its President Xi Jinping, a new survey has shown.\nOver the past year, the nu…",
    "link": "https://biztoc.com/x/9d4408bcd6350507",
    "timestamp": "2025-05-14T13:48:18Z"
  },
  {
    "title": "Trump Meets Emir Of Qatar—As He Insists On Gifted Plane Amid 'Qatar-A-Lago' Criticism",
    "description": "The Democratic National Committee said it will fly a “Qatar-a-Lago” banner over Palm Beach Wednesday.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/14/trump-meets-emir-of-qatar-as-he-insists-on-gifted-plane-amid-qatar-a-lago-criticism/",
    "timestamp": "2025-05-14T13:45:20Z"
  },
  {
    "title": "Macron Says France Has “Given Everything” to Ukraine, Signals Fatigue as Peace Talks Loom",
    "description": "In a rare moment of candor during a lengthy televised interview yesterday, French President Emmanuel Macron appeared to  concede that France has exhausted its military aid capacity to Ukraine.\nThe post Macron Says France Has “Given Everything” to Ukraine, Sig…",
    "link": "https://www.thegatewaypundit.com/2025/05/macron-says-france-has-given-everything-ukraine-signals/",
    "timestamp": "2025-05-14T13:45:04Z"
  },
  {
    "title": "Merz vows to rev up German economic ‘growth engine’",
    "description": "BERLIN - German Chancellor Friedrich Merz on Wednesday pledged reforms and investment for Europe&rsquo;s biggest economy to transform it once again into a &ldquo;growth engine&rdquo; after two years of recession.",
    "link": "https://www.bangkokpost.com/business/general/3025680/merz-vows-to-rev-up-german-economic-growth-engine",
    "timestamp": "2025-05-14T13:45:00Z"
  },
  {
    "title": "California governor, Gavin Newsom, proposes pausing expansion of health care to low-income immigrants",
    "description": "Gov. Gavin Newsom wants California to stop enrolling more low-income immigrants without legal status in a state-funded health care program starting in 2026 and…",
    "link": "https://www.nbcsandiego.com/news/local/california-governor-proposes-pausing-expansion-of-health-care-to-low-income-immigrants/3825529/",
    "timestamp": "2025-05-14T13:44:03Z"
  },
  {
    "title": "Stephen A Smith agrees AOC would 'turn off' centrists if she ran for president, poses question to Dems",
    "description": "ESPN personality Stephen A. Smith weighed in on the possibility that Rep. Alexandria Ocasio Cortez may run for president and wondered something about the Democrats.",
    "link": "https://www.foxnews.com/sports/stephen-smith-agrees-aoc-would-turn-off-centrists-she-ran-president-poses-question-dems",
    "timestamp": "2025-05-14T13:43:13Z"
  },
  {
    "title": "Nolte: Regime Media Forced to Admit Tariffs ‘Have Little Impact on Prices’",
    "description": "The anti-science freak-out predicting President Donald Trump’s tariffs would explode consumer prices has now been debunked as yet another legacy media hoax. The far-left Politico grudgingly admits: “Trump tariffs have little impact on prices so far, defying g…",
    "link": "https://freerepublic.com/focus/f-news/4316921/posts",
    "timestamp": "2025-05-14T13:42:51Z"
  },
  {
    "title": "Truce or Trap? India’s calculated calm with Pakistan",
    "description": "Islamabad’s political instability, revisionist objectives, ideological mindset pose great challenges for the ceasefire agreed by New Delhi Read Full Article at RT.com",
    "link": "https://www.rt.com/india/617473-indias-uneasy-truce-with-pakistan/",
    "timestamp": "2025-05-14T13:42:45Z"
  },
  {
    "title": "CAE stands to grow with global upswing in military spending, CEO says",
    "description": "MONTREAL — Flight simulator maker CAE Inc. stands to grow with a global upswing in military spending, chief executive Marc Parent said Wednesday as the company reported its latest quarterly results. Parent pointed to increasing defence budgets across NATO and…",
    "link": "https://financialpost.com/pmn/cae-stands-to-grow-with-global-upswing-in-military-spending-ceo-says",
    "timestamp": "2025-05-14T13:42:15Z"
  },
  {
    "title": "Germany's Merz urges Europe-US unity on Ukraine war",
    "description": "Western powers must not be divided in confronting Russia over the Ukraine war, German Chancellor Friedrich Merz said Wednesday, urging a united stance between Europe and the United States.",
    "link": "https://www.thelocal.de/20250514/germanys-merz-urges-europe-us-unity-on-ukraine-war",
    "timestamp": "2025-05-14T13:41:51Z"
  },
  {
    "title": "California Governor Newsom proposes pausing expansion of health care to low-income immigrants",
    "description": "Newsom wants California to stop enrolling more low-income immigrant adults without legal status in a state-funded health care program.",
    "link": "https://abc30.com/post/california-governor-newsom-proposes-pausing-expansion-health-care-low-income-immigrants/16413283/",
    "timestamp": "2025-05-14T13:41:35Z"
  },
  {
    "title": "More than 100 members of congress urge RFK Jr not to close LGBTQ+ suicide helpline",
    "description": "Warning: This article contains themes of suicide and mental-health distress for LGBTQ+ youngsters, including statistics and details. Reader discretion is advised. US secretary of health Robert F Kennedy Jr has been urged to stop the “lethal” closure of an LGB…",
    "link": "https://www.thepinknews.com/2025/05/14/988-lifeline-rfk-jr-donald-trump-budget-draft-proposal/",
    "timestamp": "2025-05-14T13:41:29Z"
  },
  {
    "title": "Trump’s Prized Tax Bill Doesn’t Do Anything He Promised",
    "description": "Donald Trump’s tax promises for the middle and working classes are actually not in his tax proposal. \r\nThe president has trumpeted the extension of his 2017 tax plan, attempting to make the bill more palatable to non-millionaires by claiming that it would end…",
    "link": "https://newrepublic.com/post/195227/donald-trump-tax-bill-campaign-promises-tips",
    "timestamp": "2025-05-14T13:40:32Z"
  },
  {
    "title": "Relief on China's factory floors as US tariffs put on hold",
    "description": "A surprise deal in the trade war gives businesses breathing room - but many now want to find new markets.",
    "link": "https://www.bbc.com/news/articles/cy8d9ygd4yqo",
    "timestamp": "2025-05-14T13:40:27Z"
  },
  {
    "title": "Trump Fully Loses It Over Pushback Against Qatar Private Jet",
    "description": "It seems that Donald Trump is starting to sweat after getting heat for accepting what appears to be a massive bribe from the Qatari government. \r\nThe claims of corruption cracked the president’s demeanor, as he took to Truth Social to try to defend receiving …",
    "link": "https://newrepublic.com/post/195229/donald-trump-loses-it-pushback-qatar-private-jet",
    "timestamp": "2025-05-14T13:40:23Z"
  },
  {
    "title": "California Governor Newsom proposes pausing expansion of health care to low-income immigrants",
    "description": "Gov. Gavin Newsom wants California to stop enrolling more low-income immigrant adults without legal status in a state-funded health care program and begin charging those already enrolled a monthly premium.",
    "link": "https://abc7.com/post/california-governor-newsom-proposes-pausing-expansion-health-care-low-income-immigrants/16413283/",
    "timestamp": "2025-05-14T13:40:07Z"
  },
  {
    "title": "Watch Live: Robert F. Kennedy Jr. Testifies Before House Committee",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. testifies before the House Appropriations Committee on Wednesday, May 14.\nThe post Watch Live: Robert F. Kennedy Jr. Testifies Before House Committee appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/14/watch-live-robert-f-kennedy-jr-testifies-before-house-committee/",
    "timestamp": "2025-05-14T13:39:56Z"
  },
  {
    "title": "Trump’s Middle East visit comes as his family deepens its business, crypto ties in the region",
    "description": "Trump's press secretary says it's “ridiculous” to suggest Trump \"is doing anything for his own benefit.”",
    "link": "https://www.bostonherald.com/2025/05/14/trump-mideast-business-ties/",
    "timestamp": "2025-05-14T13:39:29Z"
  },
  {
    "title": "Trump’s Middle East visit comes as his family deepens its business, crypto ties in the region",
    "description": "Trump's press secretary says it's “ridiculous” to suggest Trump \"is doing anything for his own benefit.”",
    "link": "https://www.denverpost.com/2025/05/14/trump-mideast-business-ties/",
    "timestamp": "2025-05-14T13:39:29Z"
  },
  {
    "title": "PM Modi chairing Cabinet Committee on Security meet, first since pause in India-Pak hostilities",
    "description": "Prime Minister Narendra Modi is leading a Cabinet Committee on Security meeting, the first since the cessation of hostilities between India and Pakistan, with key ministers present to evaluate the current security landscape. Following this, he will chair a Un…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-chairing-cabinet-committee-on-security-meet-first-since-pause-in-india-pak-hostilities/articleshow/121166267.cms",
    "timestamp": "2025-05-14T13:39:13Z"
  },
  {
    "title": "California Gov. Gavin Newsom to propose pausing immigrant health care coverage expansion",
    "description": "Gov. Gavin Newsom will propose that California pause enrolling more low-income immigrants without legal status for state-funded health care benefits in 2026.",
    "link": "https://www.cbsnews.com/sacramento/news/california-budget-may-revise-gavin-newsom-health-care-immigration/",
    "timestamp": "2025-05-14T13:39:00Z"
  },
  {
    "title": "Pregnant Cuban immigrant worries about baby’s citizenship as Supreme Court weighs Trump order",
    "description": "The asylum seeker and former lawyer who fled religious persecution in 2022  says it \"scares\" her that her baby would be born without U.S. citizenship and is part of a group suing the administration.",
    "link": "https://www.nbcnews.com/news/latino/pregnant-cuban-immigrant-birthright-citizenship-trump-worries-rcna206708",
    "timestamp": "2025-05-14T13:37:36Z"
  },
  {
    "title": "Is No Tax on Social Security in GOP House Bill? What to Know",
    "description": "President Donald Trump first vowed to nix taxes on Social Security income during his campaign for the 2024 election.",
    "link": "https://biztoc.com/x/2f061448a1e9e11b",
    "timestamp": "2025-05-14T13:37:28Z"
  },
  {
    "title": "Helping Syria’s economy: Trump’s decision to lift sanctions is a triumph for Syria’s president",
    "description": "Trump’s decision to lift sanctions is a triumph for Syria’s president\nBut Ahmed al-Sharaa badly needs to reassure minorities at home\nA beaming portrait of Donald Trump in central Damascus was a tribute to the Syrian revolution’s most unlikely hero. His face f…",
    "link": "https://biztoc.com/x/ed29cb99b0190d2b",
    "timestamp": "2025-05-14T13:37:26Z"
  },
  {
    "title": "Saudi CubeSat gets golden ticket on doomed SLS rocket",
    "description": "Trump greenlights slot for Riyadh as NASA's pricey booster teeters on the brink\nNASA will launch a Saudi satellite aboard what could be its penultimate SLS rocket on the Artemis II mission following a deal announced in Riyadh by US President Donald Trump and …",
    "link": "https://biztoc.com/x/eab980d2d58b8b58",
    "timestamp": "2025-05-14T13:37:09Z"
  },
  {
    "title": "President Trump meets with a Specially Designated Global Terrorist, lifts sanctions on Syria",
    "description": "US President Donald Trump met with Syrian interim president Ahmad al Sharaa, a US and UN-designated terrorist and the former leader of Al Qaeda’s branch in Syria, and committed to removing US sanctions on Syria. \nThe post President Trump meets with a Speciall…",
    "link": "https://www.longwarjournal.org/archives/2025/05/president-trump-meets-with-a-specially-designated-global-terrorist-lifts-sanctions-on-syria.php",
    "timestamp": "2025-05-14T13:36:18Z"
  },
  {
    "title": "Imprisoned Suge Knight says Trump will pardon Diddy if convicted in sex trafficking case: ‘Puffy’s gonna be alright’",
    "description": "Suge Knight reasoned that President Donald Trump will pardon Sean ‘Diddy’ Combs because he commuted the sentence of his Death Row Records co-founder, Michael Harris, in 2021",
    "link": "https://www.the-independent.com/news/world/americas/crime/suge-knight-diddy-court-case-b2750840.html",
    "timestamp": "2025-05-14T13:36:17Z"
  },
  {
    "title": "Children to feel the brunt of the Trump administration’s regressive agenda",
    "description": "As one MSNBC anchor put it, Trump administration officials have been \"gutting services that keep children alive and well.” The evidence is overwhelming.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/children-feel-brunt-trump-administrations-regressive-agenda-rcna206721",
    "timestamp": "2025-05-14T13:36:04Z"
  },
  {
    "title": "California Governor Newsom proposes pausing expansion of health care to low-income immigrants",
    "description": "Gov. Gavin Newsom wants California to stop enrolling more low-income immigrant adults without legal status in a state-funded health care program and begin charging those already enrolled a monthly premium.",
    "link": "https://abc7news.com/post/california-governor-newsom-proposes-pausing-expansion-health-care-low-income-immigrants/16413283/",
    "timestamp": "2025-05-14T13:35:24Z"
  },
  {
    "title": "Robert De Niro Rips into “Philistine President” Trump Once More at Cannes 2025",
    "description": "“We can’t just all sit back and watch,” De Niro said in a rousing speech as he received the honorary Palme d'Or at the Cannes Film Festival 2025. “We have to act, and we have to act now—without violence, but with great passion and determination.”",
    "link": "https://www.vanityfair.com/hollywood/story/robert-de-niro-rips-into-trump-cannes-2025",
    "timestamp": "2025-05-14T13:35:15Z"
  },
  {
    "title": "Health vs. Wealth: Arizona groups coordinate to save Medicaid from GOP",
    "description": "A GOP budget proposal cuts Medicaid, which serves 2 million Arizonans, by $880 billion. These groups hope to stop it.",
    "link": "https://www.phoenixnewtimes.com/news/health-vs-wealth-arizona-groups-coordinate-save-medicaid-gop-21744791",
    "timestamp": "2025-05-14T13:35:00Z"
  },
  {
    "title": "Trump’s pause on China tariffs still a ‘huge nightmare’ for U.S. businesses",
    "description": "U.S. President Donald Trump’s move to lower tariffs on Chinese goods helps businesses, but the reprieve is limited. Read more.",
    "link": "https://financialpost.com/news/retail-marketing/trumps-pause-china-tariffs-small-businesses",
    "timestamp": "2025-05-14T13:34:43Z"
  },
  {
    "title": "Trump says 'there's something wrong' with top Democrat he's known 'a long time'",
    "description": "President Donald Trump suggested there may be \"something wrong\" with Senate Minority Leader Chuck Schumer after the top Democrat threatened to block the president's DOJ appointees.",
    "link": "https://www.foxnews.com/politics/trump-says-theres-something-wrong-top-democrat-hes-known-a-long-time",
    "timestamp": "2025-05-14T13:34:29Z"
  },
  {
    "title": "6 Stocks To Buy To Avoid Tariff Uncertainty",
    "description": "Looking for stocks to help avoid tariff uncertainty? Discover resilient sectors and explore companies with strong focus to navigate trade tensions.",
    "link": "https://www.forbes.com/sites/investor-hub/article/6-stocks-to-buy-now-avoid-tariff-uncertainty/",
    "timestamp": "2025-05-14T13:33:32Z"
  },
  {
    "title": "Microsoft cuts staff; Airbnb’s India play",
    "description": "Despite a streak of profitable quarters, Microsoft is undertaking its largest round of layoffs in two years. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/microsoft-cuts-staff-airbnbs-india-play/articleshow/121165481.cms",
    "timestamp": "2025-05-14T13:33:21Z"
  },
  {
    "title": "The 1600: The Folly of Trump",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-folly-trump-2072129",
    "timestamp": "2025-05-14T13:33:21Z"
  },
  {
    "title": "Is No Tax on Social Security in GOP House Bill? What to Know",
    "description": "President Donald Trump first vowed to nix taxes on Social Security income during his campaign for the 2024 election.",
    "link": "https://www.newsweek.com/no-tax-social-security-house-gop-budget-spending-bill-2072068",
    "timestamp": "2025-05-14T13:33:14Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs Trial Underway: Cassie Ventura Testifies Combs Abused And Controlled Her",
    "description": "The latest news on Sean 'Diddy' Combs' as he awaits trial on charges of sex trafficking and racketeering.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/14/sean-diddy-combs-trial-underway-cassie-ventura-testifies-combs-abused-and-controlled-her/",
    "timestamp": "2025-05-14T13:32:58Z"
  },
  {
    "title": "Upcoming Russia-Ukraine talks in Türkiye: Live Updates",
    "description": "Moscow and Kiev have not held direct negotiations since meeting in Istanbul in April 2022 Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617518-ukraine-talks-istanbul-zelensky/",
    "timestamp": "2025-05-14T13:32:52Z"
  },
  {
    "title": "Opinion: Six Big - But Less Noticed - Takeaways From Operation Sindoor",
    "description": "Though the S-400 system hogged media limelight, it was the indigenous radars, SAM and Counter Unmanned Aerial Systems that formed the backbone of our ground-based air defence, highlighting the value of indigenous armament.",
    "link": "https://www.ndtv.com/opinion/six-big-but-less-noticed-takeaways-from-operation-sindoor-8413530",
    "timestamp": "2025-05-14T13:32:37Z"
  },
  {
    "title": "WATCH LIVE: FAA officials testify on air traffic safety in Senate Commerce hearing",
    "description": "The recent chronic delays and cancellations at New Jersey's largest airport have highlighted the shortage of air traffic controllers and the aging equipment they use, which President Donald Trump's administration wants to replace.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-faa-officials-testify-on-air-traffic-safety-in-senate-commerce-hearing",
    "timestamp": "2025-05-14T13:32:30Z"
  },
  {
    "title": "Leaders of Israel's Druze say the state owes it to them to defend Syrian kin",
    "description": "Israeli Druze renew their push for the IDF to defend their relatives in Syria as Jerusalem worries over new US-Syrian relations.",
    "link": "https://www.jpost.com/israel-news/article-853945",
    "timestamp": "2025-05-14T13:31:58Z"
  },
  {
    "title": "Virginia GOP embraced a diverse ticket in this year’s elections. Then things got complicated",
    "description": "Republicans engaged in scrubbing the federal government of DEI programs are fielding a historically diverse ticket in Virginia in one of the only states holding elections this year.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/virginia-gop-embraced-diverse-ticket-years-elections-things-got-compli-rcna206722",
    "timestamp": "2025-05-14T13:31:14Z"
  },
  {
    "title": "Up in the sky, flying at nearly 600 miles per hour, Air Force One meets its fan in a Qatari F-15 fighter pilot",
    "description": "Donald Trump arrived in Qatar. Qatari F-15 fighter jets escorted Air Force One. A pilot photographed the US President’s aircraft. This gesture shows the importance of the US relationship with Gulf nations. Trump's Middle East tour includes meetings to strengt…",
    "link": "https://economictimes.indiatimes.com/news/international/us/up-in-the-sky-flying-at-nearly-600-miles-per-hour-air-force-one-meets-its-fan-in-a-qatari-f-15-fighter-pilot/articleshow/121166061.cms",
    "timestamp": "2025-05-14T13:30:55Z"
  },
  {
    "title": "Coinbase CEO Brian Armstrong Invites Ex-DOGE Staff to Join Crypto Exchange",
    "description": "The move comes after a former DOGE staffer, Ethan Shaotran, praised the team’s mission and work ethic despite the backlash he faced.",
    "link": "https://www.coindesk.com/business/2025/05/14/coinbase-ceo-brian-armstrong-invites-ex-doge-staff-to-join-crypto-exchange",
    "timestamp": "2025-05-14T13:30:18Z"
  },
  {
    "title": "Trump’s Cronies Are Tearing Down the Government to Rule Ashes",
    "description": "There is so much that is so wrong emanating these days from US President Donald Trump and his merry band of corrupt oligarchs and sycophants that it is hard to know where to begin. A good starting place is the complete absence of accountability, which continu…",
    "link": "https://www.fairobserver.com/politics/trumps-cronies-are-tearing-down-the-government-to-rule-ashes/",
    "timestamp": "2025-05-14T13:30:17Z"
  },
  {
    "title": "Steelmaker Nucor Shuts Down Some Output After Cyberattack",
    "description": "Nucor Corp., the biggest steel manufacturer in North America, shut down production at some of its facilities after detecting an unauthorized intrusion into its computer systems. The company took potentially affected systems offline and implemented other conta…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/05/14/823663.htm",
    "timestamp": "2025-05-14T13:30:04Z"
  },
  {
    "title": "Steelmaker Nucor Shuts Down Some Output After Cyberattack",
    "description": "Nucor Corp., the biggest steel manufacturer in North America, shut down production at some of its facilities after detecting an unauthorized intrusion into its computer systems. The company took potentially affected systems offline and implemented other conta…",
    "link": "https://www.insurancejournal.com/magazines-national-section/2025/05/14/823663.htm",
    "timestamp": "2025-05-14T13:30:04Z"
  },
  {
    "title": "10 Terrible Policies in Trump and the GOP’s Bill to Cut Taxes for the Rich",
    "description": "Donald Trump and the GOP's tax plan includes several provisions that benefit the rich and hurt the poor, while raising the national debt by trillions.",
    "link": "http://www.rollingstone.com/politics/politics-news/republican-tax-bill-helps-rich-hurts-poor-1235338933/",
    "timestamp": "2025-05-14T13:30:00Z"
  },
  {
    "title": "Tariffs Explained: Trump Eases China Feud Slightly but Other Costs Mount",
    "description": "The Trump administration has made moves to ease tariff tensions with China but new reports indicate that prices, including for cars, are on the rise.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-trump-eases-china-feud-a-bit-but-other-costs-mount/",
    "timestamp": "2025-05-14T13:30:00Z"
  },
  {
    "title": "Unintended Truth and Ambiguity in the Middle East’s Hall of Mirrors",
    "description": "Fair Observer’s board member and former chairman, Gary Grappo, having spent a good part of his career as a diplomat in the Middle East, possesses a deep and extensive knowledge of the region, its actors and its ongoing drama. Although no longer active in a re…",
    "link": "https://www.fairobserver.com/world-news/us-news/unintended-truth-and-ambiguity-in-the-middle-easts-hall-of-mirrors/",
    "timestamp": "2025-05-14T13:29:07Z"
  },
  {
    "title": "Trump shocks and delights Syrians by lifting sanctions after 45 years. Now what?",
    "description": "Syrians celebrated after President Donald Trump made the surprise announcement that the U.S. would lift sanctions on the country’s economy after 45 years.",
    "link": "https://www.nbcnews.com/world/syria/trump-syria-sanctions-sharaa-damascus-mohammed-salman-saudi-assad-rcna206691",
    "timestamp": "2025-05-14T13:28:52Z"
  },
  {
    "title": "Normalizing Relations",
    "description": "Trump says we might normalize relations with Syria: Last year, Bashar al-Assad's regime collapsed. Now, President Donald Trump is in the Middle East,",
    "link": "https://reason.com/2025/05/14/normalizing-relations/",
    "timestamp": "2025-05-14T13:28:34Z"
  },
  {
    "title": "Harvard Expands Lawsuit After Trump Administration Orders More Funding Cuts",
    "description": "The Ivy League school argues the administration's sweeping demands violate the free speech guarantees of the U.S. Constitution's First Amendment.",
    "link": "https://www.huffpost.com/entry/harvard-expands-lawsuit-against-trump-admin_n_682497dde4b021b5064a7517",
    "timestamp": "2025-05-14T13:27:39Z"
  },
  {
    "title": "Saudi CubeSat gets golden ticket on doomed SLS rocket",
    "description": "Trump greenlights slot for Riyadh as NASA's pricey booster teeters on the brink NASA will launch a Saudi satellite aboard what could be its penultimate SLS rocket on the Artemis II mission following a deal announced in Riyadh by US President Donald Trump and …",
    "link": "https://www.theregister.com/2025/05/14/saudi_cubesat_sls/",
    "timestamp": "2025-05-14T13:26:08Z"
  },
  {
    "title": "Trump pressures Iran for a nuclear deal but says nation must ‘stop using terror’",
    "description": "President Donald Trump told Gulf leaders on Wednesday he urgently wants “to make a deal” with Iran to wind down its nuclear program but Tehran must end its support of proxy groups throughout the region as part of any potential agreement.Iran “must stop sponso…",
    "link": "https://biztoc.com/x/5b09d483830488c2",
    "timestamp": "2025-05-14T13:26:07Z"
  },
  {
    "title": "In a bizarre speech attended by some of the world’s business elites, Donald Trump asks Saudi Crown Prince MBS, 'How do you sleep at night?'",
    "description": "Donald Trump's recent Saudi Arabia trip sparked attention. He praised Crown Prince Mohammed bin Salman. He lauded Saudi Arabia as a global business hub. Trump announced easing Syria sanctions. He mentioned meeting Syrian President Ahmed al-Shara. The speech i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/in-a-bizarre-speech-attended-by-some-of-the-worlds-business-elites-donald-trump-asks-saudi-crown-prince-mbs-how-do-you-sleep-at-night/articleshow/121165954.cms",
    "timestamp": "2025-05-14T13:24:53Z"
  },
  {
    "title": "Buck Sexton tells Megyn Kelly what surprise he thinks would have happened if Biden refused to debate Trump",
    "description": "'They sold their souls to defeat Trump, and they failed. Now they're trying to buy them back off of layaway'",
    "link": "https://www.wnd.com/2025/05/buck-sexton-tells-megyn-kelly-what-surprise-he-thinks-would-have-happened-if-biden-refused-to-debate-trump/",
    "timestamp": "2025-05-14T13:24:17Z"
  },
  {
    "title": "Sony considering all options in face of tariffs — even making PS5 in the US",
    "description": "Presenting Sony’s latest financial report to investors on Wednesday, executives at the company were inevitably asked about the impact of President Donald Trump’s tariffs on the business, and how they were going to respond. They had a number of different answe…",
    "link": "https://www.polygon.com/playstation/599078/sony-ps5-price-increase-tariffs",
    "timestamp": "2025-05-14T13:23:02Z"
  },
  {
    "title": "Wall Street wobbles ahead of new retail sales data and public appearances by Fed officials",
    "description": "Wall Street bounced between small gains and losses as markets await retail sector data and hints from the Fed.",
    "link": "https://www.bostonherald.com/2025/05/14/stock-market-today-sales-data/",
    "timestamp": "2025-05-14T13:22:11Z"
  },
  {
    "title": "Toyota Settlement, Walmart Lawsuit Scrapped by CFPB",
    "description": "The U.S. Consumer Financial Protection Bureau has canceled a 2023 settlement with the financing arm of Toyota over allegations the auto giant illegally steered thousands of consumers into costly and unwanted product bundles, according to documents published b…",
    "link": "https://www.insurancejournal.com/news/national/2025/05/14/823657.htm",
    "timestamp": "2025-05-14T13:22:11Z"
  },
  {
    "title": "'It gave Susie a key window': Insiders reveal why Trump finally 'blinked' on China tariffs",
    "description": "President Donald Trump's top aides spent weeks working behind the scenes to persuade him to back down on China tariffs that had rattled global markets before they finally spotted an opening.White House Chief of Staff Susie Wiles, Treasury Secretary Scott Bess…",
    "link": "https://www.rawstory.com/trump-china-tariffs-2672017246/",
    "timestamp": "2025-05-14T13:22:06Z"
  },
  {
    "title": "Qatar's $400 million jet offered as free Air Force One stop-gap, but security overhauls could cost millions",
    "description": "Trump has expressed his displeasure at Boeing falling behind on a $3.8 billion project to replace the Air Force One fleet. The company initially aimed to deliver two new Air Force One planes by 2024, but Air Force acquisition official Darlene Costello told Co…",
    "link": "https://www.techspot.com/news/107913-qatar-400-million-jet-offered-free-air-force.html",
    "timestamp": "2025-05-14T13:21:00Z"
  },
  {
    "title": "Democratic Rep Forces Trump Impeachment Vote, Gets Emphatic Response from His Own Party",
    "description": "The tactics a Democrat has used to force a vote on impeaching President Donald Trump have his colleagues furious.",
    "link": "https://www.westernjournal.com/democratic-rep-forces-trump-impeachment-vote-gets-emphatic-response-party/",
    "timestamp": "2025-05-14T13:20:08Z"
  },
  {
    "title": "Half of American Jewish voters believe Trump is antisemitic, poll finds (Grace Gilson/The Forward)",
    "description": "Grace Gilson / The Forward:\nHalf of American Jewish voters believe Trump is antisemitic, poll finds  —  The poll also found that only a fraction of American Jewish voters believe Trump's campus crackdown reduced antisemitism  —  (JTA) — About half of American…",
    "link": "https://www.memeorandum.com/250514/p47",
    "timestamp": "2025-05-14T13:20:02Z"
  },
  {
    "title": "Here Are the Winners and Losers in the Republican Tax Bill",
    "description": "Wealthy Americans and business investors are among the big winners in House Republicans’ draft tax legislation while targets of President Donald Trump’s ire such as immigrants and elite universities were hammered.",
    "link": "https://financialpost.com/pmn/business-pmn/here-are-the-winners-and-losers-in-the-republican-tax-bill",
    "timestamp": "2025-05-14T13:19:51Z"
  },
  {
    "title": "Trump given Cybertruck motorcade through Qatar after fighter-jet escort",
    "description": "DOHA, Qatar — President Trump was given a cybertruck-led motorcade through the streets of Qatar’s capital city Wednesday. Two of the distinctive Tesla vehicles, with red-painted hoods, drove ahead of the procession. Trump landed in Qatar, the second of three …",
    "link": "https://nypost.com/2025/05/14/us-news/trump-given-cybertruck-motorcade-through-qatar-after-fighter-jet-escort/",
    "timestamp": "2025-05-14T13:19:45Z"
  },
  {
    "title": "Call of Duty Got Your Six Event: Here’s start and end date, timings, duration and leaked rewards",
    "description": "Call of Duty's Got Your Six event will begin on May 15, 2025. It ends on May 29, the same day Season 4 updates arrive for Black Ops 6 and Warzone. The event includes new rewards, and players can complete challenges or tasks to unlock them.",
    "link": "https://economictimes.indiatimes.com/news/international/us/call-of-duty-got-your-six-event-heres-start-and-end-date-timings-duration-and-leaked-rewards/articleshow/121165810.cms",
    "timestamp": "2025-05-14T13:19:27Z"
  },
  {
    "title": "First female mayor of Omaha concedes in race against likely first Black mayor",
    "description": "Omaha’s first female mayor, Jean Stothert, has conceded the mayoral race to John Ewing, who will likely become the community’s first Black mayor.",
    "link": "https://www.nbcnews.com/politics/elections/first-female-mayor-omaha-concedes-race-likely-first-black-mayor-rcna206713",
    "timestamp": "2025-05-14T13:19:26Z"
  },
  {
    "title": "Tariffs May Come and Go but the Canadiano Seems Here to Stay",
    "description": "On Feb. 5, Invermere, British Columbia-based cafe and roastery Kicking Horse Coffee posted a call to action, urging Canadian coffee shops to rename the Americano as the Canadiano. “For 16...",
    "link": "https://dailycoffeenews.com/2025/05/14/tariffs-may-come-and-go-but-the-canadiano-seems-here-to-stay/",
    "timestamp": "2025-05-14T13:19:16Z"
  },
  {
    "title": "Alan Dershowitz Breaks Down If Trump Can Legally Accept $400 Million Qatari Plane",
    "description": "Noted attorney Alan Dershowitz detailed two reasons Donald Trump would probably be able to keep a 747 reportedly being gifted to the United States by Qatar.",
    "link": "https://dailycaller.com/2025/05/14/alan-dershowitz-breaks-down-if-trump-can-legally-accept-400-million-qatari-plane/",
    "timestamp": "2025-05-14T13:18:52Z"
  },
  {
    "title": "OpenAI plans Stargate data centre in UAE in push beyond US: Report",
    "description": "It is not clear whether the ChatGPT maker will use the UAE data centre for its own work in the artificial intelligence (AI) space.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-plans-stargate-data-centre-in-uae-in-push-beyond-us-report/articleshow/121165803.cms",
    "timestamp": "2025-05-14T13:17:55Z"
  },
  {
    "title": "House Works Into The Night As Republicans Push Ahead On Trump's Big Bill",
    "description": "Tax breaks tallying more than $5 trillion.",
    "link": "https://www.huffpost.com/entry/house-works-into-the-night-republicans-push-ahead-trumps-big-bill_n_682495b1e4b023f4744f1360",
    "timestamp": "2025-05-14T13:17:30Z"
  },
  {
    "title": "Israel missing on Trump's Middle East itinerary amid him sidelining Netanyahu buzz. But US President says...",
    "description": "Tensions rise between US and Israel as Donald Trump bypasses Benjamin Netanyahu. Analysts feel Netanyahu is being sidelined. Trump proceeds with Iran nuclear talks and hostage negotiations with Hamas without informing Israel and this has fuelled unease in Isr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/israel-missing-on-trumps-middle-east-itinerary-amid-him-sidelining-netanyahu-buzz-but-us-president-says-/articleshow/121165518.cms",
    "timestamp": "2025-05-14T13:16:41Z"
  },
  {
    "title": "Nolte: Regime Media Forced to Admit Tariffs ‘Have Little Impact on Prices’",
    "description": "The anti-science freak-out predicting President Donald Trump’s tariffs would explode consumer prices has now been debunked as yet another legacy media hoax.\nThe post Nolte: Regime Media Forced to Admit Tariffs ‘Have Little Impact on Prices’ appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/05/14/nolte-regime-media-forced-to-admit-tariffs-have-little-impact-on-prices/",
    "timestamp": "2025-05-14T13:15:34Z"
  },
  {
    "title": "Video podcasts are having a moment at media upfronts",
    "description": "Podcasts, which are increasingly more popular as videos, are taking the stage at media companies' annual pitch to advertisers this year.",
    "link": "https://www.cnbc.com/2025/05/14/upfront-advertising-pitches-video-podcasts.html",
    "timestamp": "2025-05-14T13:15:18Z"
  },
  {
    "title": "Newsom proposes pausing expansion of health care to low-income immigrants",
    "description": "Gov. Newsom will propose that California pause enrolling more low-income immigrants without legal status for state-funded health care benefits in 2026.",
    "link": "https://www.10news.com/news/california-gov-newsom-proposes-pausing-expansion-of-health-care-to-low-income-immigrants",
    "timestamp": "2025-05-14T13:15:08Z"
  },
  {
    "title": "Trump Says US Exploring Normalizing Relations With Syria",
    "description": "President Donald Trump said the US would explore normalizing relations with Syria after the toppling of longtime autocrat Bashar al-Assad, adding to a pledge to lift sanctions against the country’s new government.\nRead more:…",
    "link": "https://biztoc.com/x/2ef191a59dbc474e",
    "timestamp": "2025-05-14T13:15:03Z"
  },
  {
    "title": "Russian general issues chilling 'number one target' WW3 threat to Brits",
    "description": "Major-General Nikolay Plotnikov issued a WW3 warning to the UK on Russian state TV",
    "link": "https://www.ladbible.com/news/politics/russia-ww3-warning-nikolay-plotnikov-uk-256612-20250514",
    "timestamp": "2025-05-14T13:14:19Z"
  },
  {
    "title": "Prime Minister Mark Carney vows new cabinet will act with 'urgency and determination'",
    "description": "Prime Minister Mark Carney shook up his cabinet on Tuesday by moving some key players involved in Canada-US relations into new positions and promoting 24 new faces in a move meant to signal change at the top.",
    "link": "https://www.nationalobserver.com/2025/05/14/news/prime-minister-mark-carney-vows-new-cabinet-will-act-urgency-determination",
    "timestamp": "2025-05-14T13:14:01Z"
  },
  {
    "title": "Accused of making starvation a 'bargaining chip,' Israel launches another wave of strikes on Gaza",
    "description": "Israel accused of “unashamedly” imposing inhumane conditions on Palestinians, including the risk of famine, launched a wave of deadly strikes across Gaza.",
    "link": "https://www.nbcnews.com/world/gaza/israel-gaza-blockade-starvation-strikes-hamas-trump-syria-rcna206698",
    "timestamp": "2025-05-14T13:13:27Z"
  },
  {
    "title": "\"Cannot Do Everything\": WHO Halves Management Team After US Funding Cuts",
    "description": "The World Health Organization has reduced its management team by half and will have to scale back operations, its director-general said on Wednesday, four months after the United States announced it was leaving the agency and cutting funding.",
    "link": "https://www.ndtv.com/world-news/who-halves-management-team-scales-back-work-after-us-funding-cuts-8413074",
    "timestamp": "2025-05-14T13:13:12Z"
  },
  {
    "title": "Trump Says 'Possibility' Of Meeting Putin For Ukraine Talks In Turkey",
    "description": "US President Donald Trump offered Wednesday to head to Turkey for talks on ending the Ukraine conflict, so long as his Russian counterpart Vladimir Putin also showed up.",
    "link": "https://www.ibtimes.com/trump-says-possibility-meeting-putin-ukraine-talks-turkey-3773527",
    "timestamp": "2025-05-14T13:12:07Z"
  },
  {
    "title": "A mother's plea: Bring my sons home from Gaza",
    "description": "After 584 days, Edan Alexander's reunion with his family in Gaza brings hope to Sylvia Cunio and others still waiting for their loved ones' return from captivity.",
    "link": "https://www.foxnews.com/opinion/mothers-plea-bring-my-sons-home-from-gaza",
    "timestamp": "2025-05-14T13:11:58Z"
  },
  {
    "title": "DHS Claims Tourism To Afghanistan Reason To End Immigration Protection",
    "description": "To justify ending immigration protections for Afghans, Trump officials have cited tourism to the violent and impoverished country.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/05/14/dhs-claims-tourism-to-afghanistan-reason-to-end-immigration-protection/",
    "timestamp": "2025-05-14T13:10:57Z"
  },
  {
    "title": "Merz vows to rev up German economic ‘growth engine’",
    "description": "German Chancellor Friedrich Merz on Wednesday pledged reforms and investment for Europe’s biggest economy to transform it once again into a “growth engine” after two years of recession. In his first major speech to parliament, the conservative leader reeled o…",
    "link": "https://www.digitaljournal.com/world/merz-vows-to-rev-up-german-economic-growth-engine/article",
    "timestamp": "2025-05-14T13:07:21Z"
  }
]