[
  {
    "title": "Trump signals a trans-Atlantic shift",
    "description": "Before the public spat, the UK and France had done some groundwork. A month earlier, on  January 25, the UK had signed a 100-year security partnership   with Ukraine  for free trade and strategic relations, that gave Britain access to the Black Sea, the Balti…",
    "link": " https://en.setopati.com/International/164332 ",
    "timestamp": "2025-03-05T09:45:31Z"
  },
  {
    "title": "Tesla vandalism happening in Malaysia? Woman throws rock at Model 3, act captured by Sentry Mode",
    "description": "Click to enlarge Of late, Tesla CEO Elon Musk has been in the news a lot, not as the EV company’s CEO, but as US president Donald Trump‘s right-hand man and the head of the […]\nThe post Tesla vandalism happening in Malaysia? Woman throws rock at Model 3, act …",
    "link": "https://paultan.org/2025/03/05/tesla-vandalism-happening-in-malaysia-woman-throws-rock-at-model-3-act-captured-by-sentry-mode/",
    "timestamp": "2025-03-05T09:43:25Z"
  },
  {
    "title": "Russia 'will never agree' to European peacekeepers in Ukraine, Lukashenko says",
    "description": "Russia 'will never agree' to European peacekeepers in Ukraine, Lukashenko saysgo.com",
    "link": "https://abcnews.go.com/International/russia-agree-european-peacekeepers-ukraine-lukashenko/story?id=119466901",
    "timestamp": "2025-03-05T09:41:55Z"
  },
  {
    "title": "Trump's April 2 threat to India may cost $7 billion a year",
    "description": "President Donald Trump announces reciprocal tariffs starting April 2, targeting countries including India, which charges higher tariffs on US goods. The move could impact India's export sectors, possibly leading to $7 billion annual losses. India's trade mini…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trumps-april-2-threat-to-india-may-cost-7-billion-a-year/articleshow/118731793.cms",
    "timestamp": "2025-03-05T09:34:58Z"
  },
  {
    "title": "Canada files World Trade Organization complaint against US tariffs",
    "description": "Canada has lodged a complaint with the WTO against U.S. over President Trump's tariff hikes on Canadian goods. Ambassador Nadia Theodore announced the move, criticizing the tariffs as unjustified. This follows similar actions by Beijing on U.S. tariffs and es…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/canada-files-world-trade-organization-complaint-against-us-tariffs/articleshow/118731872.cms",
    "timestamp": "2025-03-05T09:34:00Z"
  },
  {
    "title": "'Please explain to Governor Trudeau...': Trump's big warning to Canada on tariffs after Justin's 'dumb' jibe",
    "description": "Trump tariff row: US President Donald Trump on Tuesday threatened to impose reciprocal tariffs on Canada's exports to match its retaliatory 25% duties targeting American exports. His jibe came after Justin Trudeau said  Canada would plaster retaliatory tariff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-threatens-canada-reciprocal-tariffs-please-explain-to-governor-trudeau-trumps-big-massive-to-canada-on-tariffs-after-justins-dumb-jibe/articleshow/118731748.cms",
    "timestamp": "2025-03-05T09:33:31Z"
  },
  {
    "title": "Why Russia-US talks are a good sign for all",
    "description": "The shift in relations between Russia and the US may open a door for a more balanced multipolar system Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/613652-russia-us-peace-talks-africa/",
    "timestamp": "2025-03-05T09:33:20Z"
  },
  {
    "title": "‘Public execution’: The Israeli checkpoint terrorising a Palestinian town",
    "description": "Israel put a checkpoint on Deir Sharaf's main street in October 2022, spreading fear around the village.",
    "link": "https://www.aljazeera.com/features/2025/3/5/public-execution-the-israeli-checkpoint-terrorising-a-palestinian-town",
    "timestamp": "2025-03-05T09:32:03Z"
  },
  {
    "title": "Medvedev Makes Russia's Plan Clear: 'Inflict Maximum Defeat'",
    "description": "U.S. President Donald Trump has said he thinks his Russian counterpart, President Vladimir Putin, wants peace.",
    "link": "https://www.newsweek.com/medvedev-makes-russias-plan-clear-inflict-maximum-defeat-2039763",
    "timestamp": "2025-03-05T09:31:43Z"
  },
  {
    "title": "DeepSeek Has Discredited the Idea That Money Will Win AI",
    "description": "Big tech faces reckoning as DeepSeek levels the AI playing field.\nIn his first month, President Donald Trump let loose a barrage of U.S. policy pivots. But I dare say Trump was trumped by China’s DeepSeek, a free AI-powered chatbot that began modestly as a si…",
    "link": "https://biztoc.com/x/4ed0abba6623bc4d",
    "timestamp": "2025-03-05T09:31:01Z"
  },
  {
    "title": "The Uncomfortable Truth Behind Tesla’s Falling Stock Prices",
    "description": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\nElon Musk has become as much the face of Donald Trump’s presidency as Trump himself. Musk speaks at Cabinet meetings, sits down with S…",
    "link": "https://biztoc.com/x/5faf4aa79031aec2",
    "timestamp": "2025-03-05T09:30:41Z"
  },
  {
    "title": "The Centerpieces of the Ideal Trump Tax Cut",
    "description": "Now that House Republicans have agreed on a budget resolution to finance their legislative priorities, debate begins on the specific tax cuts to include in the final \"big, beautiful bill.\"\nAt the top of this list is fulfilling President Donald Trump's oft-rep…",
    "link": "https://biztoc.com/x/d6455c6cdbbf3799",
    "timestamp": "2025-03-05T09:30:35Z"
  },
  {
    "title": "Nvidia Stock: Are Tariff Fears Overblown?",
    "description": "Nvidia’s chips are primarily manufactured by TSMC in Taiwan; however, some systems and computers utilizing these chips are produced in other regions, including Mexico.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/03/05/nvidia-stock-are-tariff-fears-overblown/",
    "timestamp": "2025-03-05T09:30:34Z"
  },
  {
    "title": "Bitcoin Hashrate At Risk? US Trade War Could Hit 5% Mining Power",
    "description": "Bitcoin faces significant uncertainty as the trade war between the US and Canada could disrupt mining operations. Ontario Premier Doug Ford has warned that Canada may impose retaliatory tariffs on electricity exports to northern US states—or even cut the flow…",
    "link": "https://bitcoinist.com/bitcoin-hashrate-us-trade-war-hit-5-mining-power/",
    "timestamp": "2025-03-05T09:30:11Z"
  },
  {
    "title": "China’s latest naval exercises have shown how far it can project power",
    "description": "Beijing seems bent on dominating the high seas of the Indo-Pacific. Given the geopolitical implications of China’s emergence as a maritime power that could soon rival the US, it’s odd that America has shown little concern.",
    "link": "https://www.livemint.com/opinion/online-views/chinas-naval-exercises-expansionism-peoples-liberation-army-pla-indo-pacific-geopolitics-navy-live-fire-taiwan-taipei-11741076301665.html",
    "timestamp": "2025-03-05T09:30:08Z"
  },
  {
    "title": "Ethereum Price ‘Between Heaven And Hell’: $2,000 Level Retest Key For ETH’s Next Move",
    "description": "On Tuesday, Ethereum (ETH) retested the $2,000 support zone, falling below this level for the first time in over a year. Some analysts suggested the second-largest crypto risks a 40% correction as its price attempts to hold its support level “between heaven a…",
    "link": "http://www.newsbtc.com/news/ethereum-price-between-heaven-and-hell-2000-level-retest-key-for-eths-next-move/",
    "timestamp": "2025-03-05T09:30:05Z"
  },
  {
    "title": "Trump State Department nominee says private sector investment should replace foreign aid",
    "description": "A senior official poised to be the next US deputy secretary of state testified before lawmakers on Tuesday that Washington should shift US foreign engagement...",
    "link": "https://www.yahoo.com/news/trump-state-department-nominee-says-093000984.html",
    "timestamp": "2025-03-05T09:30:00Z"
  },
  {
    "title": "Fact-Checking Trump’s Speech to Congress",
    "description": "The President’s remarks included false and misleading information on immigration, the economy, Democrats, and more.",
    "link": "https://time.com/7264693/fact-check-trump-congress-speech-immigration-social-security-ev-mandate/",
    "timestamp": "2025-03-05T09:30:00Z"
  },
  {
    "title": "I will put incremental money in market now & keep deploying on further corrections: Jitendra Arora",
    "description": "Jitendra Arora of ICICI Prudential Life Insurance believes the market hasn't bottomed yet, despite significant corrections. He advises a cautious approach, suggesting equity investments are best for those with a two-three year horizon. He sees strong potentia…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/i-will-put-incremental-money-in-market-now-keep-deploying-on-further-corrections-jitendra-arora/articleshow/118731782.cms",
    "timestamp": "2025-03-05T09:29:42Z"
  },
  {
    "title": "Virginia Sen. Tim Kaine plans to force Republicans to vote on Trump's Canada tariffs",
    "description": "Republicans are \"nervous\" about President Trump's tariffs raising prices, says Democratic Sen. Tim Kaine of Virginia. He plans to force a vote in the Senate on them soon.",
    "link": "https://www.npr.org/2025/03/05/nx-s1-5317682/trump-tariffs-canada-china-mexico-senate-vote",
    "timestamp": "2025-03-05T09:29:04Z"
  },
  {
    "title": "What does Ukraine have that the US wants?",
    "description": "Donald Trump pushed Volodymyr Zelenskyy to repay US aid with Ukraine's minerals. But the deal fell through.",
    "link": "https://www.aljazeera.com/program/by-the-numbers-3/2025/3/5/what-does-ukraine-have-that-the-us-wants",
    "timestamp": "2025-03-05T09:28:21Z"
  },
  {
    "title": "TSMC plans $100B investment boost for US AI chip production",
    "description": "TSMC said its historic $100 billion investment would create thousands of construction jobs and boost U.S. capacity for AI chips. However, its timeframe is fuzzy.",
    "link": "https://www.techtarget.com/searchenterpriseai/news/366620133/TSMC-plans-100B-investment-boost-for-US-AI-chip-production",
    "timestamp": "2025-03-05T09:27:00Z"
  },
  {
    "title": "Polish Space Agency POLSA disconnected its network following a cyberattack",
    "description": "The Polish space agency POLSA announced it has disconnected its network from the internet following a cyberattack. The Polish space agency POLSA was forced to disconnect its network from the internet in response to a cyberattack. The agency revealed that it h…",
    "link": "https://securityaffairs.com/174930/security/polish-space-agency-polsa-disconnected-its-network-following-a-cyberattack.html",
    "timestamp": "2025-03-05T09:22:40Z"
  },
  {
    "title": "Trump tariffs leave Mexican tequila producers with sour taste",
    "description": "Mexico’s booming tequila industry was left reeling Wednesday after US President Donald Trump slapped sweeping tariffs on the Central American nation that producers say threaten the popularity of its most famous liquor. Trump imposed 25 percent levies on Mexic…",
    "link": "https://www.digitaljournal.com/world/trump-tariffs-leave-mexican-tequila-producers-with-sour-taste/article",
    "timestamp": "2025-03-05T09:22:33Z"
  },
  {
    "title": "Trump mulling Canada, Mexico tariff compromise, Lutnick Says",
    "description": "Comments marked first public signal since duties imposed that the president may be wavering on his decision",
    "link": "https://www.irishtimes.com/business/economy/2025/03/05/trump-mulling-canada-mexico-tariff-compromise-lutnick-says/",
    "timestamp": "2025-03-05T09:22:02Z"
  },
  {
    "title": "Belarus president proposes hosting Ukraine-Russia peace talks",
    "description": "MOSCOW: Belarusian President Alexander Lukashenko offered in an interview published on Wednesday (Mar 5) to host Russia-Ukraine peace talks that could involve United States officials. \"Tell (US President Donald) Trump that I expect him here with (Russian Pres…",
    "link": "https://www.channelnewsasia.com/world/belarus-president-alexander-lukashenko-offer-host-russia-ukraine-peace-talks-united-states-trump-4978751",
    "timestamp": "2025-03-05T09:20:25Z"
  },
  {
    "title": "Critics Sink Their Teeth Into Trump’s ‘Let Them Eat Cake’ Speech Confession",
    "description": "The president's \"little disturbance\" admission did not go down well.",
    "link": "https://www.huffpost.com/entry/donald-trump-let-them-eat-cake-moment_n_67c80d85e4b04c15d9302c13",
    "timestamp": "2025-03-05T09:16:29Z"
  },
  {
    "title": "Diplomat Charles: UK King's Role In Trump-Ukraine Tightrope Act",
    "description": "From showing solidarity with Volodymyr Zelensky to inviting US President Donald Trump for a historic state visit, Britain&#039;s diplomatic drive over Ukraine has a surprising pivotal figure: King Charles III.",
    "link": "https://www.ndtv.com/world-news/diplomat-charles-uk-kings-role-in-trump-ukraine-tightrope-act-7853221",
    "timestamp": "2025-03-05T09:11:47Z"
  },
  {
    "title": "People make same observation about Vice President JD Vance as he's ridiculed during Trump's speech to Congress",
    "description": "Viewers are currently mocking Vice President JD Vance's choice in pants as Donald Trump made his address to Congress yesterday (4 March).",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-congress-speech-jd-vance-pants-length-727857-20250305",
    "timestamp": "2025-03-05T09:11:16Z"
  },
  {
    "title": "Hot mic reveals what Trump said before Zelenskyy walked out of Oval Office",
    "description": "A microphone has reportedly picked up what US President Donald Trump said before Volodymyr Zelenskyy exited the Oval Office and left the White House.",
    "link": "https://www.ladbible.com/news/politics/donald-trump-volodymyr-zelenskyy-hot-mic-oval-office-309853-20250305",
    "timestamp": "2025-03-05T09:07:23Z"
  },
  {
    "title": "SoftBank’s Arm to Drive Malaysia’s $270 Billion Chip Goals",
    "description": "Arm Holdings Plc has agreed to provide chip designs and technology to Malaysia over the next decade, to help catapult the Southeast Asian country beyond chip assembly and into more valuable semiconductor production.",
    "link": "https://financialpost.com/pmn/business-pmn/softbanks-arm-to-drive-malaysias-270-billion-chip-goals",
    "timestamp": "2025-03-05T09:05:00Z"
  },
  {
    "title": "Rumors are flying over Trump's deportations and shopkeepers say it's having a chilling effect on business",
    "description": "Reality hasn't lived up to Trump's mass deportation threats, but worries are keeping some immigrants at home, two business owners told BI.",
    "link": "https://www.businessinsider.com/ice-raids-business-sales-down-low-foot-traffic-immigrant-neighrbodhood-2025-3",
    "timestamp": "2025-03-05T09:01:01Z"
  },
  {
    "title": "US consortium to buy Panama Canal ports",
    "description": "A Hong Kong-based firm has agreed to sell a majority stake to a US consortium amid Donald Trump’s vows to take back the canal Read Full Article at RT.com",
    "link": "https://www.rt.com/business/613739-us-consortium-buy-panama-ports/",
    "timestamp": "2025-03-05T09:01:01Z"
  },
  {
    "title": "Boston mayor faces heat over sanctuary city policies as Patriots owner's son goes on offensive",
    "description": "Boston Mayor Michelle Wu will take questions regarding sanctuary city policies from Congress on Wednesday amid a recent spar with border czar Tom Homan.",
    "link": "https://www.foxnews.com/us/boston-mayor-faces-heat-sanctuary-city-policies-patriots-owners-son-goes-offensive",
    "timestamp": "2025-03-05T09:00:54Z"
  },
  {
    "title": "Top 5 moments from Trump's address to joint session of Congress",
    "description": "Fox News Digital compiled the top moments from President Donald Trump's address to a joint session of Congress Tuesday evening.",
    "link": "https://www.foxnews.com/politics/top-5-moments-from-trumps-address-joint-session-congress",
    "timestamp": "2025-03-05T09:00:50Z"
  },
  {
    "title": "Red state leader calls for states to stand behind Trump's ban on funding illegal immigration",
    "description": "As Democratic states double down on resisting the Trump administration, Oklahoma Education Superintendent Ryan Walters is calling on states to stand behind the president.",
    "link": "https://www.foxnews.com/politics/red-state-leader-calls-states-stand-behind-trumps-ban-funding-illegal-immigration",
    "timestamp": "2025-03-05T09:00:11Z"
  },
  {
    "title": "'America is back': Lawmakers rally around Trump after 'phenomenal' joint address to Congress",
    "description": "Lawmakers, speaking with Fox News Digital on Capitol Hill, reveal their thoughts about President Trump's joint address to Congress.",
    "link": "https://www.foxnews.com/politics/america-back-lawmakers-rally-around-trump-after-phenomenal-joint-address-congress",
    "timestamp": "2025-03-05T09:00:04Z"
  },
  {
    "title": "Here are the likely market winners and losers if Trump stays aggressive on tariffs",
    "description": "Trump's tariffs aren't just a negotiation tactic anymore. They'll help the economy in some areas but hurt it in others.",
    "link": "https://www.businessinsider.com/stock-market-winners-losers-trump-tariffs-stagflation-manufacturing-mexico-canada-2025-3",
    "timestamp": "2025-03-05T09:00:01Z"
  },
  {
    "title": "How Canadians' wallets will take a hit during the trade war",
    "description": "Canadians' wallets will likely be the victim of a prolonged trade war with the U.S., with the prices on consumer goods potentially rising over the next weeks, some analysts say.",
    "link": "https://www.cbc.ca/news/business/tariff-trump-canadians-pocketbook-prices-1.7474652",
    "timestamp": "2025-03-05T09:00:00Z"
  },
  {
    "title": "Quebec food prices expected to climb and variety to shrink as trade war escalates",
    "description": "Quebecers can expect higher food prices and fewer American products as the U.S.-Canada trade war escalates. Businesses are bracing for impact, with some stocking up ahead of new tariffs.",
    "link": "https://www.cbc.ca/news/canada/montreal/quebec-food-trade-war-impact-1.7474808",
    "timestamp": "2025-03-05T09:00:00Z"
  },
  {
    "title": "U.S.-eh? Who are the Canadians who would support a 51st state?",
    "description": "U.S. President Donald Trump's consistent coercion tactics about the 51st state have angered many Canadians but it’s also speaking to a small group for a variety of reasons, say analysts.",
    "link": "https://www.cbc.ca/news/canada/u-s-eh-who-are-the-canadians-who-would-support-a-51st-state-1.7472194",
    "timestamp": "2025-03-05T09:00:00Z"
  },
  {
    "title": "Ethereum Pectra upgrade live on testnet, but mainnet may face delays",
    "description": "Ethereum’s Pectra upgrade was successfully deployed on the Sepolia testnet, but developers may delay the mainnet launch due to unresolved issues on Holesky.",
    "link": "https://cointelegraph.com/news/ethereum-pectra-upgrade-sepolia-testnet-mainnet-delay-possible",
    "timestamp": "2025-03-05T08:59:44Z"
  },
  {
    "title": "Trump says 'transgender mice,' internet says 'wait, what?', and the memes go wild",
    "description": "Donald Trump’s first address to a joint session of Congress in his second term focused on policy topics like tax cuts, trade wars, and national security victories. Notable moments included a slip-up on 'transgenic mice,' a claim of restored free speech, and a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-congress-speech-trump-says-transgender-mice-internet-says-wait-what-and-the-memes-go-wild/articleshow/118730520.cms",
    "timestamp": "2025-03-05T08:58:54Z"
  },
  {
    "title": "\"Pressure, Coercion Or Threats\": China Tells US How To Not Deal With Them",
    "description": "Calling the fentanyl issue &#039;a flimsy excuse&#039; to raise US tariffs on Chinese imports, Beijing on Wednesday said tactics of pressure, coercion or threats are not the right way to deal with them.",
    "link": "https://www.ndtv.com/world-news/china-tells-us-how-to-not-deal-with-them-pressure-coercion-or-threats-7853099",
    "timestamp": "2025-03-05T08:58:13Z"
  },
  {
    "title": "'Extremely Dishonest': CNN Fact-Checker Nails Trump On 13 'Flat False' Claims",
    "description": "Daniel Dale said the president's speech before a joint session of Congress was filled with falsehoods.",
    "link": "https://www.huffpost.com/entry/daniel-dale-trump-joint-speech_n_67c805f5e4b0efaf8f9f842b",
    "timestamp": "2025-03-05T08:56:07Z"
  },
  {
    "title": "Macron to address France over global ‘uncertainty’",
    "description": "French President Emmanuel Macron said he would address the nation Wednesday over the current global uncertainty in the wake of the radical change in US policy on Ukraine under Donald Trump. “My dear compatriots — I will address you tonight at 8:00 pm (1900 GM…",
    "link": "https://www.digitaljournal.com/world/macron-to-address-france-over-global-uncertainty/article",
    "timestamp": "2025-03-05T08:55:24Z"
  },
  {
    "title": "Reclaiming the Panama Canal, the end of wokism, flag on Mars: Highlights from Trump’s keynote speech to Congress",
    "description": "The US president claimed that he’s been making good on his agenda weeks into his second term Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613742-trump-congress-speech-recap/",
    "timestamp": "2025-03-05T08:51:42Z"
  },
  {
    "title": "Elizabeth Warren Turns Trump Speech Taunt Into A Power Move",
    "description": "Social media users hailed the Democratic senator's \"dignified\" response to the president's \"disgusting\" remark during his address to Congress.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-responds-trump-speech-taunt_n_67c8081ee4b04c15d93029af",
    "timestamp": "2025-03-05T08:49:44Z"
  },
  {
    "title": "Sen. Elizabeth Warren Turns Donald Trump Speech Taunt Into A Power Move",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f53070b7-7c66-4cc7-81e4-5ee205c30628",
    "timestamp": "2025-03-05T08:49:44Z"
  },
  {
    "title": "$XRP Pumps After Ripple CEO Hints Trump Crypto Summit Attendance: Who Else Got Invites?",
    "description": "$XRP climbed early Wednesday amid speculation Ripple CEO Brad Garlinghouse will attend the White House's first ever crypto summit to be hosted by President Donald Trump – several crypto executives have announced they received invitations, but Garlinghouse has…",
    "link": "https://www.ibtimes.com/xrp-pumps-after-ripple-ceo-hints-trump-crypto-summit-attendance-who-else-got-invites-3765136",
    "timestamp": "2025-03-05T08:47:32Z"
  },
  {
    "title": "China targets 5% economic growth despite tariffs",
    "description": "Premier Li Qiang acknowledged the headwinds facing the Chinese economy and promised an action plan to boost consumption",
    "link": "https://www.irishtimes.com/business/2025/03/05/china-targets-5-economic-growth-despite-tariffs/",
    "timestamp": "2025-03-05T08:47:25Z"
  },
  {
    "title": "Trump: Japan, South Korea want to partner with US on Alaska gas pipeline",
    "description": "WASHINGTON: President Donald Trump said on Tuesday (Mar 4) that Japan and South Korea are among countries looking to work with the United States on a natural gas pipeline in Alaska. Addressing a joint session of Congress, Trump said his administration is \"wor…",
    "link": "https://www.channelnewsasia.com/world/donald-trump-japan-south-korea-partner-us-alaska-gas-pipeline-4978711",
    "timestamp": "2025-03-05T08:47:12Z"
  },
  {
    "title": "Barron is Donald Trump's only child absent from President's address to Congress. Why was he missing?",
    "description": "US President Donald Trump addressed the joint session of Congress today where his entire family was in attendance, except his youngest son Barron Trump. Trump's 18-year-old son was no where to be seen at his joint address to Congress tonight despite Ivanka an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-is-donald-trumps-only-child-absent-from-presidents-address-to-congress-why-was-he-missing/articleshow/118730671.cms",
    "timestamp": "2025-03-05T08:45:08Z"
  },
  {
    "title": "As Trump rattles stock markets, investors bet on Europe’s defence",
    "description": "European defence stocks are flying high as Trump's pause on aid to Ukraine spurs calls for continent's rearmament.",
    "link": "https://www.aljazeera.com/economy/2025/3/5/as-trump-rattles-stock-markets-investors-bet-on-europes-defence",
    "timestamp": "2025-03-05T08:43:08Z"
  },
  {
    "title": "Li Ka-Shing’s CK Hutchison To Sell Panama Canal Ports To BlackRock As Part Of $23 Billion Deal",
    "description": "The deal comes after U.S. President Donald Trump repeatedly threatened to take control of the Panama Canal and end what he sees as China’s influence over the waterway critical to global trade.",
    "link": "https://www.forbes.com/sites/zinnialee/2025/03/05/li-ka-shings-ck-hutchison-to-sell-panama-canal-ports-to-blackrock-as-part-of-23-billion-deal/",
    "timestamp": "2025-03-05T08:42:10Z"
  },
  {
    "title": "Kim Jong Un's sister warns of provocative response to U.S. aircraft carrier deployment",
    "description": "Washington DC (UPI) Mar 4, 2025 \n\n\n North Korean leader Kim Jong Un's influential sister said Tuesday that the deployment of a U.S. aircraft carrier to South Korea would compel Pyongyang to bolster its nuclear arsenal and ramp up military provocations. \n The …",
    "link": "https://www.spacewar.com/reports/Kim_Jong_Uns_sister_warns_of_provocative_response_to_US_aircraft_carrier_deployment_999.html",
    "timestamp": "2025-03-05T08:41:59Z"
  },
  {
    "title": "US to get Greenland ‘one way or the other’ – Trump",
    "description": "US President Donald Trump has reaffirmed his interest in acquiring Greenland from Denmark Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613743-trump-speech-greenland-claim/",
    "timestamp": "2025-03-05T08:41:48Z"
  },
  {
    "title": "Medvedev: Trump wants Zelensky, Europe to beg",
    "description": "Russian Security Council Deputy Chairman Dmitry Medvedev called the United States' decision to suspend military aid to Ukraine a \"symbolic gesture,\" claiming that US President Donald Trump wants Ukrai...",
    "link": "https://biztoc.com/x/9bceebfa9e7e5ac6",
    "timestamp": "2025-03-05T08:41:05Z"
  },
  {
    "title": "Trump calls for an end to the Chips Act, redirecting funds to national debt",
    "description": "In his first address to the joint session of Congress since he returned as President, Trump blasted the Chips Act.Read Entire Article",
    "link": "https://www.techspot.com/news/107023-trump-calls-end-chips-act-redirect-funds-national.html",
    "timestamp": "2025-03-05T08:41:00Z"
  },
  {
    "title": "FactChecking Trump’s Address to Congress",
    "description": "In his first address to a joint session of Congress in his second term, President Donald Trump distorted the facts on fraud, immigration, aid to Ukraine, the economy, autism and more.\nThe post FactChecking Trump’s Address to Congress appeared first on FactChe…",
    "link": "https://www.factcheck.org/2025/03/factchecking-trumps-address-to-congress-2/",
    "timestamp": "2025-03-05T08:36:06Z"
  },
  {
    "title": "German election: Green's Baerbock wants to take back seat",
    "description": "Outgoing Foreign Minister Annalena Baerbock says she want no leading role in her Green Party parliamentary group. Germany's conservatives and the Social Democrats are continuing preliminary coalition talks. DW has more. Outgoing German Foreign Minister Annale…",
    "link": "https://www.dw.com/en/german-election-greens-baerbock-wants-to-take-back-seat/live-71829944",
    "timestamp": "2025-03-05T08:36:00Z"
  },
  {
    "title": "\"If War Is What US Wants...\": China's Sharp Retort To Trump's Tariff Charge",
    "description": "In a sharp retort to US President Donald Trump&#039;s reciprocal tariffs charge, the Chinese embassy in the US said Beijing is ready to &quot;fight till the end&quot; in any type of war the US wants.",
    "link": "https://www.ndtv.com/world-news/donald-trump-us-tariff-war-if-war-is-what-us-wants-chinas-sharp-retort-to-trumps-tariff-charge-7852931",
    "timestamp": "2025-03-05T08:34:55Z"
  },
  {
    "title": "More Than 100 Buildings Vanish From Trump's 'For Sale' Wishlist",
    "description": "The Trump administration&#039;s list of federal properties that could be offered for sale quickly shrank from 443 to 320 in the span of hours, as the General Services Administration pulled some iconic buildings from the website.",
    "link": "https://www.ndtv.com/world-news/more-than-100-buildings-vanish-from-trumps-for-sale-wishlist-7852921",
    "timestamp": "2025-03-05T08:33:23Z"
  },
  {
    "title": "Big Daddy Breaks Down Lamenting Being Unable to Access ARVs, Says Wife Left Him: \"Dawa Ni Expensive\"",
    "description": "Big Daddy recently lamented after his wife filed for divorce and noted he risked being deported. He is now asking for help to access his expensive meds.",
    "link": "https://www.tuko.co.ke/entertainment/celebrities/580943-big-daddy-breaks-lamenting-unable-access-arvs-wife-left-dawa-ni-expensive/",
    "timestamp": "2025-03-05T08:32:41Z"
  },
  {
    "title": "Hume: Trump Speech Boisterous, Partisan — But Effective",
    "description": "Tuesday, following President Donald Trump's address to a joint session of Congress, Fox News Channel analyst Brit Hume offered his feedback on the President's remarks.\nThe post Hume: Trump Speech Boisterous, Partisan — But Effective appeared first on Breitbar…",
    "link": "https://www.breitbart.com/clips/2025/03/05/hume-trump-speech-boisterous-partisan-but-effective/",
    "timestamp": "2025-03-05T08:32:37Z"
  },
  {
    "title": "Austerity is back globally and may prove even more self-destructive this time",
    "description": "The idea was always controversial from an economic perspective, but now it’s being deployed—in the US and Argentina, for example—as a political weapon in the shape of a redistributive tool.",
    "link": "https://www.livemint.com/opinion/online-views/austerity-globally-self-destructive-donald-trump-javier-milei-elon-musk-inflation-redistribution-europe-fiscal-policy-11740644211026.html",
    "timestamp": "2025-03-05T08:30:07Z"
  },
  {
    "title": "Trump vows again to take Panama Canal, Greenland",
    "description": "WASHINGTON, March 4 (Xinhua) -- U.S. President Donald Trump on Tuesday repeated his pledge to take b",
    "link": "http://en.people.cn/n3/2025/0305/c90000-20285127.html",
    "timestamp": "2025-03-05T08:27:09Z"
  },
  {
    "title": "Google Urges DOJ to Reverse Course on Breaking Up Company",
    "description": "Representatives for the Alphabet unit asked the government in a meeting last week to take a less aggressive stance as the US looks to end what a judge ruled to be an illegal online search monopoly, said the people, who asked not to be identified discussing th…",
    "link": "https://www.gadgets360.com/internet/news/google-urges-donald-trump-doj-reverse-course-breaking-up-company-7852856",
    "timestamp": "2025-03-05T08:23:23Z"
  },
  {
    "title": "MSNBC Host Skewers Democrats' Protest Stunt During Trump Speech",
    "description": "Symone Sanders-Townsend said it gave off a certain vibe.",
    "link": "https://www.huffpost.com/entry/symone-sanders-townsend-trump-speech-democrats_n_67c7f86fe4b0efaf8f9f7b36",
    "timestamp": "2025-03-05T08:21:32Z"
  },
  {
    "title": "Germany reviews US ties after Trump-Zelensky meeting, finding them too long and not fooling anyone into thinking Cheetolini is any slimmer [Obvious]",
    "description": "Germany reviews US ties after Trump-Zelensky meeting, finding them too long and not fooling anyone into thinking Cheetolini is any slimmer",
    "link": "https://www.fark.com/comments/13583764/Germany-reviews-US-ties-after-Trump-Zelensky-meeting-finding-them-too-long-not-fooling-anyone-into-thinking-Cheetolini-is-any-slimmer",
    "timestamp": "2025-03-05T08:20:00Z"
  },
  {
    "title": "The Parable of Peanut the Memecoin",
    "description": "The Parable of Peanut the Memecoin\nMemecoins are having a moment. Everyone from Hawk Tuah to President Donald Trump to animal influencers like Moo Deng the pygmy hippo have been turned into cryptocurrency. But what are the costs of all the hype?\nOn today's sh…",
    "link": "https://biztoc.com/x/4c9680ab40518c2d",
    "timestamp": "2025-03-05T08:19:56Z"
  },
  {
    "title": "Israel, Gaza and hostages get just brief mention in Trump’s address to Congress",
    "description": "He also briefly spoke of plans for a “Golden Dome” modeled off of Israel’s Iron Dome missile defense system.",
    "link": "https://www.jpost.com/american-politics/article-844778",
    "timestamp": "2025-03-05T08:19:48Z"
  },
  {
    "title": "Trump's Tariffs Could Wipe Out Profits For GM, Ford And Stellantis, Barclays Warns: 'Tariffs Of This Magnitude Are Unlikely To Stick'",
    "description": "Barclays issued a warning that the tariffs recently imposed by U.S. President Donald Trump could potentially eliminate the profits of Detroit’s “Big Three” automakers – General Motors (NYSE:GM), Ford (NYSE:F), and Stellantis NV (NYSE:STLA).\nWhat Happened: Pre…",
    "link": "https://biztoc.com/x/8b43d7baedfd313e",
    "timestamp": "2025-03-05T08:19:33Z"
  },
  {
    "title": "Trump hails 'reclaiming' of Panama canal after BlackRock-led group's deal to buy stake",
    "description": "U.S. President Donald Trump has hailed a deal led by U.S. firm BlackRock to buy most of the $22.8 billion ports business of Hong Kong conglomerate CK Hutchison which includes assets along the Panama Canal.",
    "link": "https://www.independent.ie/world-news/latin-america/trump-hails-reclaiming-of-panama-canal-after-blackrock-led-groups-deal-to-buy-stake/a1886886932.html",
    "timestamp": "2025-03-05T08:19:15Z"
  },
  {
    "title": "Trump Touts Plans to Spur Mammoth Alaska Gas Export Project",
    "description": "President Donald Trump on Tuesday touted his administration’s work on a “gigantic natural gas pipeline in Alaska,” signifying his efforts to invigorate a long-stalled $44 billion project to transport natural gas across the state and export it overseas.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-touts-plans-to-spur-mammoth-alaska-gas-export-project",
    "timestamp": "2025-03-05T08:19:12Z"
  },
  {
    "title": "Le Pen accuses Trump of ‘brutality’ over reported Ukraine aid halt",
    "description": "The alleged move by the US president is “cruel,” the former National Rally party leader has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613740-le-pen-trump-ukraine/",
    "timestamp": "2025-03-05T08:19:07Z"
  },
  {
    "title": "Trump hails ‘reclaiming’ of Panama Canal after ports deal",
    "description": "<p>US President Donald Trump has hailed a deal led by the US investment firm BlackRock to buy most of the $22.8-billion ports business of the Hong Kong conglomerate CK Hutchison which includes assets along the <strong>Panama Cana</strong>l.</p>",
    "link": "https://www.bangkokpost.com/business/general/2973576/trump-hails-reclaiming-of-panama-canal-after-ports-deal",
    "timestamp": "2025-03-05T08:16:00Z"
  },
  {
    "title": "'Waging war' and 'taking back' Greenland: Five things Trump told Congress in his 99-minute speech",
    "description": "Almost every line got loud applause from Republican Party members.",
    "link": "https://www.thejournal.ie/waging-war-and-reclaiming-land-here-are-5-things-trump-told-congress-in-his-99-minute-speech-6640100-Mar2025/",
    "timestamp": "2025-03-05T08:15:51Z"
  },
  {
    "title": "China’s Leaders Aren’t Changing Course—No Matter How the World Changes Around Them",
    "description": "Beijing’s biggest annual political meeting is unlikely to make any big splashes. That could be a problem.",
    "link": "https://time.com/7264683/china-national-peoples-congress-2025-li-work-report-xi-analysis/",
    "timestamp": "2025-03-05T08:15:00Z"
  },
  {
    "title": "Trump calls for termination of CHIPS Act at first address to Congress",
    "description": "On March 5, US President Donald Trump delivered his first address to a joint session of Congress since taking office. He opened by stating that despite facing economic headwinds, \"America is back,\" emphasizing the importance of attracting businesses to invest…",
    "link": "https://www.digitimes.com/news/a20250305PD224/taiwan-donald-trump-chips-act-tariff-subsidies.html",
    "timestamp": "2025-03-05T08:13:42Z"
  },
  {
    "title": "Trump announces reciprocal tariffs against India, China from April 2",
    "description": "President Trump criticizes high tariffs by India and China, announces reciprocal tariffs starting April 2.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/trump-reciprocal-tariffs-april-2-india-china-trade/article69293470.ece",
    "timestamp": "2025-03-05T08:12:42Z"
  },
  {
    "title": "Can Europe arm Ukraine now that US has halted military aid?",
    "description": "LONDON — Ukrainians reacted with alarm on Tuesday to Washington's announcement that it is halting military aid shipments to the country with immediate effect, a move that the Trump administration said was aimed at forcing all sides to the negotiating table.\n\n…",
    "link": "https://www.voanews.com/a/can-europe-arm-ukraine-now-that-us-has-halted-military-aid-/7998393.html",
    "timestamp": "2025-03-05T08:10:03Z"
  },
  {
    "title": "Trump will 'probably' cut Mexico and Canada tariffs - US commerce chief",
    "description": "Trump will 'probably' cut Mexico and Canada tariffs - US commerce chief\nUS Commerce Secretary Howard Lutnick has said President Donald Trump will \"probably\" announce a deal to reduce tariffs on Canada and Mexico on Wednesday.\n\"Both the Canadians and Mexicans …",
    "link": "https://biztoc.com/x/6b84ed88cb0c67b6",
    "timestamp": "2025-03-05T08:09:53Z"
  },
  {
    "title": "Trump Seeks To End CHIPS Act: Who Stands To Lose? Here's A List Of Beneficiaries That Could Be Affected",
    "description": "President Donald Trump during his joint address to Congress on Tuesday evening called for ending the CHIPS Act, which provides manufacturing incentives to semiconductor companies setting up their facilities in the U.S.\nWhat Happened: During a primetime addres…",
    "link": "https://biztoc.com/x/8a8c9056aaef5979",
    "timestamp": "2025-03-05T08:09:47Z"
  },
  {
    "title": "CK Hutchison stock soars over 20% as port sale dodges Trump",
    "description": "HONG KONG -- Shares of Hong Kong conglomerate CK Hutchison soared more than 20% on Tuesday after the group struck a $22.8 billion deal to sell much of its port business, including control of two facilities on the Panama Canal that had drawn the ire of U.S. Pr…",
    "link": "https://biztoc.com/x/2f54f156ccd1f972",
    "timestamp": "2025-03-05T08:09:36Z"
  },
  {
    "title": "Samsung Mulls US Battery Plant Despite Trump Anti-EV Stance",
    "description": "South Korea’s Samsung SDI Co. said it’s weighing the idea of another manufacturing plant in the US, signaling optimism about the market’s growth despite President Donald Trump rolling back subsidies for electric vehicles.",
    "link": "https://financialpost.com/pmn/business-pmn/samsung-mulls-us-battery-plant-despite-trump-anti-ev-stance",
    "timestamp": "2025-03-05T08:09:01Z"
  },
  {
    "title": "Trump: Deporting Biden's Migrants Is 'Great Liberation of America'",
    "description": "The deportation of President Joe Biden's migrant flood is the \"Great Liberation of America,\" President Donald Trump told a Joint Session of Congress on March 4.\nThe post Trump: Deporting Biden’s Migrants Is ‘Great Liberation of America’ appeared first on Brei…",
    "link": "https://www.breitbart.com/immigration/2025/03/05/trump-deporting-bidens-migrants-is-great-liberation-of-america/",
    "timestamp": "2025-03-05T08:08:07Z"
  },
  {
    "title": "CFPB drops Zelle lawsuit in latest reversal under Trump administration",
    "description": "The Consumer Financial Protection Bureau has dropped its lawsuit over peer-to-peer payment system Zelle, the latest in a series of dismissals from this department under President Donald Trump's administration. The agency had only just announced the suit \u0097 fil…",
    "link": "http://www.madshrimps.be/news/item/237359",
    "timestamp": "2025-03-05T08:07:24Z"
  },
  {
    "title": "Slotkin Slams Trump's 'Reckless' Policies, Musk's Unchecked Power Over Americans' Data In Democratic Rebuttal",
    "description": "\"There's a responsible way to make change and a reckless way. Change doesn't need to be chaotic or make us less safe,\" stated first-term Senator Elissa Slotkin in her rebuttal to President Donald Trump's joint congressional address.",
    "link": "https://www.ibtimes.com/slotkin-slams-trumps-reckless-policies-musks-unchecked-power-over-americans-data-democratic-3765133",
    "timestamp": "2025-03-05T08:06:50Z"
  },
  {
    "title": "Protestors in Santa Rosa rally outside Tesla dealership",
    "description": "The demonstration was part of a day of protests Saturday against Elon Musk and his slashing of government jobs and spending on behalf of President Trump.",
    "link": "https://www.pressdemocrat.com/article/north-bay/tesla-protest-santa-rosa/",
    "timestamp": "2025-03-05T08:05:30Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Taoiseach to visit UK, Trump caims ‘America is back’ and Australia braces for cyclone…",
    "link": "https://www.thejournal.ie/8-at-8-wednesday-115-6640108-Mar2025/",
    "timestamp": "2025-03-05T08:02:21Z"
  },
  {
    "title": "A look at the human toll of the construction of the Panama Canal",
    "description": "The Panama Canal's impact on the geopolitical stage far outreaches its roughly 51-mile stretch of land and water. This week, we're trying to understand the canal's murky future - from climate change to President Trump's threat to take it for the U.S. - by loo…",
    "link": "https://www.npr.org/2025/03/05/1235939381/a-look-at-the-human-toll-of-the-construction-of-the-panama-canal",
    "timestamp": "2025-03-05T08:00:59Z"
  }
]