[
  {
    "title": "India not so badly impacted by US tariffs, says ASSOCHAM president Sanjay Nayar",
    "description": "India is less impacted by the US tariffs announced by President Trump, says ASSOCHAM president Sanjay Nayar. With a 26% tariff, India fares better than China (34%) and Vietnam (46%). Pharma remains exempt, reducing the impact. Nayar predicts an intra-Asia tra…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-not-so-badly-impacted-by-us-tariffs-says-assocham-president-sanjay-nayar/articleshow/119932628.cms",
    "timestamp": "2025-04-03T06:15:41Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Thursday",
    "description": "Industry reeling after Trump tariff announcement, police shut down major child pornography site, Bavarian priest jailed for climate activism and more news from around Germany on Thursday.",
    "link": "https://www.thelocal.de/20250403/today-in-germany-a-roundup-of-the-latest-news-on-thursday-67",
    "timestamp": "2025-04-03T06:15:39Z"
  },
  {
    "title": "What Does 'JDPON Don' Mean And What's With Memes About Donald Trump Being A Secret Maoist? The 'MAGACommunism' Conspiracy Theories Explained",
    "description": "Did Donald Trump accidentally kickstart Chinese world domination? The internet thinks so, and the memes are wild.",
    "link": "https://knowyourmeme.com/editorials/guides/what-does-jdpon-don-mean-and-whats-with-memes-about-donald-trump-being-a-secret-maoist-the-magacommunism-conspiracy-theories-explained",
    "timestamp": "2025-04-03T06:15:34Z"
  },
  {
    "title": "Canada says to fight U.S. tariffs with countermeasures",
    "description": "OTTAWA, April 2 (Xinhua) -- Canadian Prime Minister Mark Carney said Wednesday that Canada will figh",
    "link": "http://en.people.cn/n3/2025/0403/c90000-20297842.html",
    "timestamp": "2025-04-03T06:13:08Z"
  },
  {
    "title": "A diamond industry in Pennsylvania? Do Trump's numbers add up?",
    "description": "Donald Trump's Rose Garden \"Liberation Day\" moment was a set piece event for the ages - an historic day he believes will kickstart a gradual American revival.",
    "link": "https://news.sky.com/story/do-trumps-tariff-numbers-add-up-after-liberation-day-announcement-13340903",
    "timestamp": "2025-04-03T06:13:00Z"
  },
  {
    "title": "U.S. slaps Kenya with 10% export tariff",
    "description": "The United States on Wednesday imposed a 10 percent reciprocal tariff on Kenya as part of President Donald Trump’s latest round of trade tariffs on all imports to America.",
    "link": "https://www.citizen.digital/business/us-slaps-kenya-with-10-export-tariff-n360349",
    "timestamp": "2025-04-03T06:12:00Z"
  },
  {
    "title": "China eyes ‘resolute countermeasures’ to Trump tariffs",
    "description": "Beijing holds off on retaliatory levies for now",
    "link": "https://www.irishtimes.com/business/2025/04/03/china-eyes-resolute-countermeasures-to-trump-tariffs/",
    "timestamp": "2025-04-03T06:11:50Z"
  },
  {
    "title": "Donald Trump’s tariffs & travel: Will your next US trip get more expensive? All details here",
    "description": "US President Donald Trump imposes a 26% tariff on Indian imports, targeting sectors like electronics and gems. The goal is to counter higher tariffs on American goods and address the $46 billion trade deficit. The move may boost India's chance as an alternati…",
    "link": "https://timesofindia.indiatimes.com/life-style/travel/news/donald-trumps-tariffs-travel-will-your-next-us-trip-get-more-expensive-all-details-here/articleshow/119932251.cms",
    "timestamp": "2025-04-03T06:11:32Z"
  },
  {
    "title": "India assessing impact of reciprocal tariff imposed by US: MoS Finance",
    "description": "India is evaluating the impact of the 27 per cent reciprocal tariffs imposed by the US on its goods. The assessment focuses on understanding how these tariffs, aimed at countering India's high import duties on American products, will affect the country's expo…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-assessing-impact-of-reciprocal-tariff-imposed-by-us-mos-finance/articleshow/119932511.cms",
    "timestamp": "2025-04-03T06:11:00Z"
  },
  {
    "title": "Elon Musk’s Tesla Sales Troubles Are Only Getting Started",
    "description": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\nDonald Trump turned the South Lawn of the White House into a Tesla exhibition lot. His attorney general has moved to treat people who …",
    "link": "https://biztoc.com/x/d498c8b192960160",
    "timestamp": "2025-04-03T06:10:54Z"
  },
  {
    "title": "Reciprocal tariffs: India may gain competitive edge but growth, exports to be hit",
    "description": "Trump tariffs: All eyes on bilateral trade agreement negotiations with US, how tariffs will be applied yet to be seen.",
    "link": "https://www.businesstoday.in/latest/economy/story/reciprocal-tariffs-india-may-gain-competitive-edge-but-growth-exports-to-be-hit-470492-2025-04-03",
    "timestamp": "2025-04-03T06:10:48Z"
  },
  {
    "title": "Trump’s Tariffs On These 2 Islands Comes With An Absurd Twist",
    "description": "Wait until you hear who lives there.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs-islands_n_67ee15cbe4b0cb3642d387b3",
    "timestamp": "2025-04-03T06:08:47Z"
  },
  {
    "title": "An uninhabited island, a military base and a ‘desolate’ former whaling station. Trump’s trade war includes unlikely targets",
    "description": "The sweeping tariffs announced by US President Donald Trump on Wednesday target not only economic superpowers but also financial minnows. In fact, a White House list notes some territories with no economy, and no people, at all.",
    "link": "https://www.cnn.com/2025/04/03/business/trump-tariffs-uninhabited-islands-intl-hnk/index.html",
    "timestamp": "2025-04-03T06:08:31Z"
  },
  {
    "title": "Is Tesla’s EV Supremacy in the Rearview Mirror?",
    "description": "BYD’s battery breakthrough is a “DeepSeek moment,” says Craig Trudell on this week’s episode of Zero.",
    "link": "https://financialpost.com/pmn/business-pmn/is-teslas-ev-supremacy-in-the-rearview-mirror",
    "timestamp": "2025-04-03T06:07:06Z"
  },
  {
    "title": "'Won’t drag Americans into the workforce...': Startup founder on why Trump’s trade war won’t create jobs, is only a 'political flex'",
    "description": "He cited data showing that U.S. consumers paid an extra $46 billion due to tariffs by 2019, while American farmers suffered from retaliatory trade policies",
    "link": "https://www.businesstoday.in/latest/world/story/wont-drag-americans-into-the-workforce-startup-founder-on-why-trumps-trade-war-wont-create-jobs-is-only-a-political-flex-pritesh-lakhani-470491-2025-04-03",
    "timestamp": "2025-04-03T06:05:38Z"
  },
  {
    "title": "Tuberculosis sees a resurgence and is only going to get worse",
    "description": "The spread of the deadly infection is buoyed by global unrest",
    "link": "https://theweek.com/health/tuberculosis-resurgence-public-health-disease",
    "timestamp": "2025-04-03T06:00:50Z"
  },
  {
    "title": "Alaska Natives cheer Trumpâ\u0080\u0099s energy revival: “Our voices are finally being heard”",
    "description": "The Trump administration overturned Biden-era drilling restrictions in Alaska’s NPR-A and ANWR, reopening oil and gas leasing to boost energy independence and tribal economies. Native Alaskan leaders, who criticized Biden’s policies as economically harmful an…",
    "link": "https://www.naturalnews.com/2025-04-03-alaska-natives-cheer-trumps-energy-revival.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "President Trump announces new tariff rates to compete globally and rebuild American economy",
    "description": "In a move aimed at re-balancing international trade and restoring American economic power, President Donald Trump unveiled a comprehensive list of new tariff rates during a Rose Garden event on Wednesday. The announcement, which followed a background briefing…",
    "link": "https://www.naturalnews.com/2025-04-03-trump-announces-new-tariff-rates-to-compete-globally.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s energy sanctions strike again: Venezuelaâ\u0080\u0099s oil exports plummet 11.5%â\u0080\u0094hereâ\u0080\u0099s why it matters",
    "description": "U.S. sanctions, including a 25% tariff on nations buying Venezuelan crude and revoked operating licenses for foreign firms, caused a 11.5% drop in Venezuela’s March oil exports, further straining its economy. The sanctions aim to pressure Nicolás Maduro’s reg…",
    "link": "https://www.naturalnews.com/2025-04-03-venezuelas-oil-exports-plummet-heres-why-it-matters.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "X CEO Yaccarino stunned, Musk intrigued after reading bombshell report on far-left NGOs targeting Tesla",
    "description": "Update: There has been a race against time to uncover the complex web of dark-money-funded, far-left NGOs fueling the Tesla Takedown color revolution operation that far-left corporate media outlets have cheerleaded. (Article by Tyler Durden republished from Z…",
    "link": "https://www.naturalnews.com/2025-04-03-musk-intrigued-after-reading-bombshell-report.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "We Meet Again: Prepping for Another TikTok Deadline",
    "description": "Whether TikTok is sold or silenced, change is coming. Here’s what you can do to stay ahead.",
    "link": "https://www.adweek.com/social-marketing/we-meet-again-prepping-for-april-5-tiktok-deadline/",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "Greenlandâ\u0080\u0099s strategic riches: The new Cold War frontier as U.S. and China vie for Arctic dominance",
    "description": "Greenland has emerged as a geopolitical flashpoint due to its vast rare earth mineral deposits, Arctic shipping lanes and location between North America and Europe, drawing intense U.S.-China rivalry. Greenland holds 25 of 34 critical minerals essential for t…",
    "link": "https://www.naturalnews.com/2025-04-03-new-cold-war-frontier-us-china-arctic-dominance.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "NASA, State Dept. admit to renaming DEI programs to dodge Trumpâ\u0080\u0099s ban in undercover sting",
    "description": "Project Veritas exposed NASA and State Department employees circumventing Trump’s DEI bans by rebranding programs. A State Department officer admitted renaming DEI initiatives to evade scrutiny, vowing to repeat the tactic. A NASA scientist revealed renaming …",
    "link": "https://www.naturalnews.com/2025-04-03-nasa-renaming-dei-programs-to-dodge-ban.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "Italy orders heightened security at Tesla dealerships after suspected anarchists destroy 17 vehicles in Rome",
    "description": "Italian authorities increased security at Tesla dealerships after anarchists burned 17 EVs in Rome as part of a global anti-Musk campaign. The U.S. is treating similar attacks as domestic terrorism, with severe penalties for perpetrators. Italy’s deputy PM co…",
    "link": "https://www.naturalnews.com/2025-04-03-italy-security-tesla-dealerships-anarchists-destroy-vehicles.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "Indian refiners seek alternatives to Russian oil after Trump tariff threat",
    "description": "• Indian oil refiners are seeking alternative crude oil suppliers following President Trump’s threat of secondary sanctions on Russian energy exports. • India has been one of the largest buyers of Russian crude since the Ukraine war began, with Urals oil acco…",
    "link": "https://www.naturalnews.com/2025-04-03-indian-refiners-seek-alternatives-to-russian-oil.html",
    "timestamp": "2025-04-03T06:00:00Z"
  },
  {
    "title": "Albanese takes a tumble and Dutton gets himself in a twist",
    "description": "Today on the campaign trail the leaders talked tough on Trump's tariff war, thousands of people enrolled to vote and the prime minister took a tumble.",
    "link": "https://www.abc.net.au/news/2025-04-03/trump-tariffs-albanese-tumble-gambling-advertising/105131120",
    "timestamp": "2025-04-03T05:59:52Z"
  },
  {
    "title": "Taiwan says US tariffs unreasonable, partly blames Trump policies for trade surplus",
    "description": "TAIPEI: Taiwan's government said on Thursday (Apr 3) that US tariffs levied on the island were unreasonable and it would discuss them with Washington, partly blaming US tech curbs on China in President Donald Trump's first term for driving the trade imbalance…",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-trump-us-tariffs-unreasonable-blames-trump-trade-surplus-5041736",
    "timestamp": "2025-04-03T05:58:56Z"
  },
  {
    "title": "Trump’s new tariff plan stanches demand for Greek olives, olive oil, feta cheese and wine",
    "description": "The imposition of 20% tariffs imposed horizontally by the Trump administration on all imported products from the European Union has dealt a severe blow to the loyalty of US consumers…\nTrump’s new tariff plan stanches demand for Greek olives, olive oil, feta c…",
    "link": "https://www.naftemporiki.gr/english/1940539/trumps-new-tariff-plan-stanches-demand-for-greek-olives-olive-oil-feta-cheese-and-wine/",
    "timestamp": "2025-04-03T05:57:50Z"
  },
  {
    "title": "US bans staff in China from romantic ties with citizens",
    "description": "<p>WASHINGTON &mdash; The United States has banned government personnel based in China from having romantic or sexual relationships with Chinese citizens, the <em>Associated Press</em> (<em>AP</em>) reported citing people familiar with the matter.</p>",
    "link": "https://www.bangkokpost.com/world/2994702/us-bans-staff-in-china-from-romantic-ties-with-citizens",
    "timestamp": "2025-04-03T05:56:00Z"
  },
  {
    "title": "India not so badly impacted by US tariffs: ASSOCHAM president Sanjay Nayar",
    "description": "Indian economy more inward-looking compared to its peer Asian markets, states ASSOCHAM president Sanjay Nayar",
    "link": "https://www.thehindubusinessline.com/economy/india-not-so-badly-impacted-by-us-tariffs-assocham-president-sanjay-nayar/article69407070.ece",
    "timestamp": "2025-04-03T05:55:28Z"
  },
  {
    "title": "Israel's industry body warns of U.S. tariffs' impact on trade",
    "description": "JERUSALEM, April 3 (Xinhua) -- The Manufacturers Association of Israel (MAI) on Thursday voiced conc",
    "link": "http://en.people.cn/n3/2025/0403/c90000-20297840.html",
    "timestamp": "2025-04-03T05:54:34Z"
  },
  {
    "title": "Trump tariffs may lead to slump in global GDP; what happens to Apple exports from India? Swaminathan Aiyar explains",
    "description": "Swaminathan Aiyar warns that the world may be at initial stages of a potential prolonged trade war led by Trump, predicting severe global economic impacts. With high tariffs, industries like Apple's Indian plant may face significant export challenges. Aiyar f…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/trump-tariffs-may-lead-to-slump-in-global-gdp-what-happens-to-apple-exports-from-india-swaminathan-aiyar-explains/articleshow/119931523.cms",
    "timestamp": "2025-04-03T05:54:15Z"
  },
  {
    "title": "That’s Somebody Else’s Car",
    "description": "“Fights between individuals, as well as governments and nations”  Nikola Tesla wrote in 1905, “invariably result from misunderstandings in the broadest interpretation of this term. Misunderstandings are always caused by the inability of appreciating one anoth…",
    "link": "https://www.counterpunch.org/2025/04/03/thats-somebody-elses-car/",
    "timestamp": "2025-04-03T05:53:48Z"
  },
  {
    "title": "'Daily Show' Nails Trump With His Own Damning Words",
    "description": "Michael Kosta hits the president with some very specific receipts.",
    "link": "https://www.huffpost.com/entry/daily-show-trump-tariffs-prices_n_67ee0e98e4b04834ca70ee3f",
    "timestamp": "2025-04-03T05:53:41Z"
  },
  {
    "title": "Trump imposes 14% tariff on Nigerian exports to US",
    "description": "US President Donald Trump has announced that exports from Nigeria to the United States will now be subjected to a 14 per cent tariff. The decision, which was made public during a ‘Make America Wealthy Again’ event in the Rose Garden on Wednesday, is part of a…",
    "link": "https://punchng.com/trump-imposes-14-tariff-on-nigerian-exports-to-us/",
    "timestamp": "2025-04-03T05:53:04Z"
  },
  {
    "title": "ACMA Hopeful Of Strong Trade-Related Relations Between India and USA",
    "description": "ACMA remains hopeful that the ongoing bilateral negotiations between the Indian and U.S. governments will lead to a balanced resolution that benefits both economies.",
    "link": "https://www.ndtv.com/auto/acma-hopeful-of-strong-trade-related-relations-between-india-and-usa-8075431",
    "timestamp": "2025-04-03T05:51:00Z"
  },
  {
    "title": "John Browne to Newsmax: Trump Championing Fair Trade",
    "description": "John Browne, an adviser to the late British Prime Minister Margaret Thatcher, praised on Newsmax Wednesday President Donald Trump's actions to instill fair trade for the United States.\"Who can possibly argue with someone who's fighting for fair trade? Even tr…",
    "link": "https://freerepublic.com/focus/f-news/4308519/posts",
    "timestamp": "2025-04-03T05:50:44Z"
  },
  {
    "title": "'No order in the disorder': Von der Leyen says EU ready to respond to sweeping US tariffs",
    "description": "Trump has announced a series of reciprocal tariffs on other nations, including 20% on the European Union imports to the US.",
    "link": "https://www.thejournal.ie/von-der-leyen-us-tariffs-eu-response-6666574-Apr2025/",
    "timestamp": "2025-04-03T05:49:10Z"
  },
  {
    "title": "Trump’s April 2 Deadline for New Tariffs is a Distraction from Deeper North American Trade Challenges",
    "description": "Mexicans have heaped massive praise on their president, Claudia Sheinbaum, for her negotiations against an increasingly frenzied and unpredictable Donald Trump.  She drew hundreds of thousands to Mexico City’s central square — Zócalo — on March 9 to rally for…",
    "link": "https://www.counterpunch.org/2025/04/03/trumps-april-2-deadline-for-new-tariffs-is-a-distraction-from-deeper-north-american-trade-challenges/",
    "timestamp": "2025-04-03T05:47:29Z"
  },
  {
    "title": "'Strong nations can do what they want': Nilesh Shah on Trump tariffs, says India hit lower than most of its peers",
    "description": "Taking a jibe at the announcement, Shah said that strong nations can do what they want.",
    "link": "https://www.businesstoday.in/india/story/strong-nations-can-do-what-they-want-nilesh-shah-on-trump-tariffs-says-india-hit-lower-than-most-of-its-peers-470488-2025-04-03",
    "timestamp": "2025-04-03T05:45:52Z"
  },
  {
    "title": "India's $32 billion gems & jewellery industry braces for sharp fall after Trump's tariff announcement",
    "description": "India’s $32 billion gems and jewellery industry faces a sharp decline in exports due to new U.S. tariffs, impacting its position as the global leader. The tariffs, higher than expected, threaten to reduce the industry’s exports to its largest market, the Unit…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/fashion-/-cosmetics-/-jewellery/indias-32-billion-gems-jewellery-industry-braces-for-sharp-fall-after-trumps-tariff-announcement/articleshow/119931238.cms",
    "timestamp": "2025-04-03T05:45:44Z"
  },
  {
    "title": "Trump’s tariff bombshell hits India, but some desi sectors dodge the shrapnel",
    "description": "Trump Tariffs: US President Donald Trump has imposed significant tariffs on imports from over 60 countries, including a 26% tariff on Indian exports. These measures aim to address trade imbalances but may allow India to strengthen its position in certain sect…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trumps-tariff-bombshell-hits-india-with-26-import-tax-but-some-desi-sectors-like-agriculture-farm-pharma-textile-electronics-steel-medicinesdodge-the-shrapnel-while-trump-odi-relation-remains-india-us-trade-ties-ariff-impact/articleshow/119931671.cms",
    "timestamp": "2025-04-03T05:45:29Z"
  },
  {
    "title": "Trump’s tariff bombshell hits India, but some desi sectors dodge the shrapnel",
    "description": "Trump Tariffs: US President Donald Trump has imposed significant tariffs on imports from over 60 countries, including a 26% tariff on Indian exports. These measures aim to address trade imbalances but may allow India to strengthen its position in certain sect…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trumps-tariff-bombshell-hits-india-with-26-import-tax-but-some-desi-sectors-like-agriculture-farm-pharma-textile-electronics-steel-medicinesdodge-the-shrapnel-while-trump-odi-relation-remains-india-us-trade-ties-ariff-impact/articleshow/119929599.cms",
    "timestamp": "2025-04-03T05:45:29Z"
  },
  {
    "title": "Trump’s tariff bombshell hits India, but some desi sectors dodge the shrapnel",
    "description": "Trump Tariffs: US President Donald Trump has imposed significant tariffs on imports from over 60 countries, including a 26% tariff on Indian exports. These measures aim to address trade imbalances but may allow India to strengthen its position in certain sect…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trumps-tariff-bombshell-hits-india-with-26-import-tax-but-some-desi-sectors-like-agriculture-farm-pharma-textile-electronics-steel-medicinesdodge-the-shrapnel-while-trump-odi-relation-remains-india-us-trade-ties-ariff-impact/articleshow/119931668.cms",
    "timestamp": "2025-04-03T05:45:29Z"
  },
  {
    "title": "Albanese outlines five-point plan to respond to Trump's tariffs",
    "description": "The prime minister has outlined his government's strategy for responding to American tariffs, indicating further announcements in the weeks ahead.",
    "link": "https://www.abc.net.au/news/2025-04-03/albanese-outlines-five-point-plan-trump-tariffs-election-2025/105131590",
    "timestamp": "2025-04-03T05:43:56Z"
  },
  {
    "title": "EU says consequences of Trump tariffs will be 'dire'",
    "description": "The EU's Ursula von der Leyen has warned that the bloc is prepared to respond to new US tariffs imposed by President Donald Trump's administration. Taiwan has described the tariffs as \"unreasonable.\" DW has more.",
    "link": "https://www.dw.com/en/eu-says-consequences-of-trump-tariffs-will-be-dire/live-72122323",
    "timestamp": "2025-04-03T05:42:00Z"
  },
  {
    "title": "EU says consequences of Trump tariffs will be 'dire'",
    "description": "The EU's Ursula von der Leyen has warned that the bloc is prepared to respond to new US tariffs imposed by President Donald Trump's administration. Taiwan has described the tariffs as \"unreasonable.\" DW has more. Many countries have responded with dismay afte…",
    "link": "https://www.dw.com/en/eu-says-consequences-of-trump-tariffs-will-be-dire/live-72122323",
    "timestamp": "2025-04-03T05:42:00Z"
  },
  {
    "title": "Trump’s delivers ‘Liberation Day’ tariffs with a flourish",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/04/03/trumps-delivers-liberation-day-tariffs-with-a-flourish/",
    "timestamp": "2025-04-03T05:41:38Z"
  },
  {
    "title": "Is Elon Musk's Political Career Coming Back To Earth?",
    "description": "Donald Trump hinted at a gradual break-up this week, telling reporters that &quot;at some point, Elon&#039;s going to want to go back to his company.&quot;",
    "link": "https://www.ndtv.com/world-news/is-elon-musks-political-career-coming-back-to-earth-8075352",
    "timestamp": "2025-04-03T05:41:22Z"
  },
  {
    "title": "Lawmakers Press SEC for Details on Trump’s Crypto Connections",
    "description": "Trump’s crypto ties pose “an unprecedented conflict of interest,” said lawmakers asking the SEC for answers on paused enforcement cases.",
    "link": "https://decrypt.co/313094/lawmakers-press-sec-details-trumps-crypto-connections",
    "timestamp": "2025-04-03T05:40:23Z"
  },
  {
    "title": "Who are affected by the 25% tariffs on all cars announced by Trump?",
    "description": "Volkswagen's first reaction - Tariffs also on Turkish spare parts - Increase in sales of imported cars before tariffs\nThe post Who are affected by the 25% tariffs on all cars announced by Trump? appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/04/03/who-are-affected-by-the-25-tariffs-on-all-cars-announced-by-trump/",
    "timestamp": "2025-04-03T05:38:21Z"
  },
  {
    "title": "Trump hits Apple’s global supply chain with reciprocal tariffs",
    "description": "President Donald Trump has hit Apple's major manufacturing hubs, like India and Taiwan, with heavy reciprocal tariffs.\n(via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "link": "https://www.cultofmac.com/news/trump-hits-apples-global-supply-chain-with-reciprocal-tariffs",
    "timestamp": "2025-04-03T05:37:25Z"
  },
  {
    "title": "Did ChatGPT come up with Trump’s tariff rate formula?",
    "description": "There’s a crazy theory on social media that US President Donald Trump's newly announced reciprocal tariff plan — which hits all countries with a minimum 10% tariff — could have been designed by an artificial intelligence chatbot.Only a short period after Trum…",
    "link": "https://cointelegraph.com/news/trump-tariff-rate-formula-replicated-chatgpt-observers-claim",
    "timestamp": "2025-04-03T05:36:08Z"
  },
  {
    "title": "Many countries will retaliate against Trump's tariffs. India must not.",
    "description": "Indian tariff protection is too high as it is. Also, India does not want to risk tariffs spilling over into services, which are vital to its economy.",
    "link": "https://www.livemint.com/opinion/online-views/us-tariffs-india-impact-trump-trade-policy-india-india-us-trade-relations-global-trading-system-india-export-tariffs-11743656919259.html",
    "timestamp": "2025-04-03T05:35:45Z"
  },
  {
    "title": "Donald Trump is nothing if not a showman but his instincts deserted him on Liberation Day",
    "description": "World saw familiar Trumpian concoction of threat, uncertainty, imminent chaos - and a sad little chart",
    "link": "https://www.irishtimes.com/world/us/2025/04/03/donald-trump-us-tariffs-liberation-day/",
    "timestamp": "2025-04-03T05:34:16Z"
  },
  {
    "title": "Australia baffled by 29% US tariff on small island",
    "description": "SYDNEY: Australia expressed puzzlement on Thursday (Apr 3) over Donald Trump's decision to slap a 29 per cent trade tariff on its tiny Pacific territory of Norfolk Island.",
    "link": "https://www.channelnewsasia.com/world/australia-norfolk-island-trump-tariffs-us-anthony-albanese-5041706",
    "timestamp": "2025-04-03T05:32:35Z"
  },
  {
    "title": "Big pharma not subject to US tariffs for now, but there's worry we're not out of the woods",
    "description": "Pharmaceutical products are exempt from the 20% tariff, for now.",
    "link": "https://www.thejournal.ie/pharma-exempt-from-us-tariffs-6666489-Apr2025/",
    "timestamp": "2025-04-03T05:30:54Z"
  },
  {
    "title": "Pat Leahy: Trump’s 20% tariffs mark the beginning of full scale global trade war",
    "description": "Global effect will surely be a slowdown in trade, growth and wealth creation",
    "link": "https://www.irishtimes.com/politics/2025/04/03/pat-leahy-trumps-20-tariffs-mark-the-beginning-of-full-scale-global-trade-war/",
    "timestamp": "2025-04-03T05:28:52Z"
  },
  {
    "title": "Donald Trump slaps new tariffs on New Zealand, other countries; economic implications explained",
    "description": "US President Trump introduced new reciprocal tariffs on various countries, including New Zealand, due to their tariffs on US goods. However, some claims about the tariffs were incorrect. Experts are concerned about potential economic impacts on markets, expor…",
    "link": "https://economictimes.indiatimes.com/news/international/new-zealand/donald-trump-slaps-new-tariffs-on-new-zealand-other-countries-economic-implications-explained/articleshow/119930237.cms",
    "timestamp": "2025-04-03T05:28:15Z"
  },
  {
    "title": "A tiny Australian outpost gets a steep Trump tariff despite few exports",
    "description": "Richard Cottle, a concrete-mixing business owner on Norfolk Island, is baffled by a 29% U.S. tariff since the island has minimal exports. Norfolk is on a tariff list with China and the EU, despite its lack of manufacturing. The high tariff is seen as an error…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-tiny-australian-outpost-gets-a-steep-trump-tariff-despite-few-exports/articleshow/119930965.cms",
    "timestamp": "2025-04-03T05:27:05Z"
  },
  {
    "title": "Trump\u0092s aluminium tariffs bring 25 per cent hike",
    "description": "Donald [hamburger-eating surrender monkey] Trump\u0092s aluminium tariffs are now impacting the PC hardware world, with vendors discovering too late that finished goods, such as cases and GPUs, are being hit with the same 25 per cent levy initially intended to tar…",
    "link": "http://www.madshrimps.be/news/item/238170",
    "timestamp": "2025-04-03T05:26:55Z"
  },
  {
    "title": "Apple and other US tech groups hit as Donald Trump targets suppliers",
    "description": "Apple and other US tech groups hit as Donald Trump targets suppliers\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and …",
    "link": "https://biztoc.com/x/7c5d778d1eff4336",
    "timestamp": "2025-04-03T05:26:33Z"
  },
  {
    "title": "Prime Minister Anthony Albanese takes a tumble on stage while posing for photos on campaign trail in Lovedale",
    "description": "Prime Minister Anthony Albanese takes a tumble on stage while posing for photos on campaign trail in Lovedale7news.com.au",
    "link": "https://7news.com.au/news/prime-minister-anthony-albanese-takes-a-tumble-on-stage-while-posing-for-photos-on-campaign-trail-in-lovedale-c-18252960",
    "timestamp": "2025-04-03T05:24:06Z"
  },
  {
    "title": "Explained: What Are Tariffs, Why Countries Use Them, Who Pays",
    "description": "US President Donald Trump on Wednesday imposed sweeping tariffs that target key economic partners, escalating global trade tensions.",
    "link": "https://www.ndtv.com/world-news/explained-what-are-tariffs-why-countries-use-them-who-pays-8075156",
    "timestamp": "2025-04-03T05:23:20Z"
  },
  {
    "title": "Le Pen’s appeal: What’s next?",
    "description": "In today’s edition of The Capitals, read about Czech MEP on the automotive industry’s payroll leading work on a key EU climate file, the coast of Bulgaria’s largest Black Sea city deliberately polluted with oil, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-le-pens-appeal-whats-next/",
    "timestamp": "2025-04-03T05:23:00Z"
  },
  {
    "title": "Trump tariff tidal wave hits markets: Why India may dodge the trade bullet",
    "description": "Donald Trump's recent tariffs have shaken global markets, but India remains relatively resilient, with its Sensex and Nifty showing minimal declines. Despite a 26% tariff, India's exports, particularly in IT services and pharmaceuticals, remain competitive. T…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariff-tidal-wave-hits-markets-why-india-may-dodge-the-trade-bullet/articleshow/119930702.cms",
    "timestamp": "2025-04-03T05:21:59Z"
  },
  {
    "title": "India’s steel industry relieved as US exempts exports from additional tariffs",
    "description": "The US has exempted Indian steel and aluminium from additional reciprocal tariffs, easing concerns for India’s metal industry. However, a 10% tariff on all imports will take effect from April 5, 2025. With EU exports to the US becoming unviable, India may fac…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/steel/indias-steel-industry-relieved-as-us-exempts-exports-from-additional-tariffs/articleshow/119930595.cms",
    "timestamp": "2025-04-03T05:21:51Z"
  },
  {
    "title": "Trump promises new dawn for US economy, as EU says it is prepared to respond with countermeasures",
    "description": "US president says sweeping tariffs will entice firms to open factories in America and money raised will pay for tax cuts",
    "link": "https://www.irishtimes.com/politics/2025/04/03/trump-promises-new-dawn-for-us-economy-as-eu-says-it-is-prepared-to-respond-with-countermeasures/",
    "timestamp": "2025-04-03T05:21:20Z"
  },
  {
    "title": "Danish PM In 'Unity' Greenland Visit Amid US Takeover Threats",
    "description": "Denmark's prime minister will aim to shore up a united front with Greenland on Thursday during a visit to the autonomous territory, which US President Donald Trump has vowed to take over.",
    "link": "https://www.ibtimes.com/danish-pm-unity-greenland-visit-amid-us-takeover-threats-3768668",
    "timestamp": "2025-04-03T05:21:11Z"
  },
  {
    "title": "'Abject failure' of negotiations: Congress MP Manish Tewari slams Centre over US tariffs",
    "description": "\"It represents an abject failure of the negotiations that were taking place between the US and the government of India. The US has imposed tariffs, expelling our students, and cancelling visas without any provocation, and the government is absolutely silent..…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/abject-failure-of-negotiations-congress-mp-manish-tewari-slams-centre-over-us-tariffs/articleshow/119930669.cms",
    "timestamp": "2025-04-03T05:20:56Z"
  },
  {
    "title": "U.S. bans government personnel in China from romantic or sexual relations with Chinese citizens",
    "description": "The U.S. government has banned American government personnel in China, as well as family members and contractors with security clearances, from any romantic or sexual relationships with Chinese citizens, The Associated Press has learned. Four people with dire…",
    "link": "https://japantoday.com/category/world/us-bans-government-personnel-in-china-from-romantic-or-sexual-relations-with-chinese-citizens",
    "timestamp": "2025-04-03T05:20:33Z"
  },
  {
    "title": "Trump just started a global economic war – Isolationism that will cost you a lot",
    "description": "The American president is launching a new global economic reality, with China in the spotlight - The \"strange\" tariffs on Japan and Taiwan, Australia that received tariffs in installments & the uninhabited islands\nThe post Trump just started a global economic…",
    "link": "https://en.protothema.gr/2025/04/03/trump-just-started-a-global-economic-war-isolationism-that-will-cost-you-a-lot/",
    "timestamp": "2025-04-03T05:19:25Z"
  },
  {
    "title": "Danish PM in ‘unity’ Greenland visit amid US takeover threats",
    "description": "Denmark’s prime minister will aim to shore up a united front with Greenland on Thursday during a visit to the autonomous territory, which US President Donald Trump has vowed to take over. Tensions between the United States and Denmark have soared since Trump …",
    "link": "https://www.digitaljournal.com/world/danish-pm-in-unity-greenland-visit-amid-us-takeover-threats/article",
    "timestamp": "2025-04-03T05:17:20Z"
  },
  {
    "title": "New Triada Trojan comes preinstalled on Android devices",
    "description": "A new Triada trojan variant comes preinstalled on Android devices, stealing data on setup, warn researchers from Kaspersky. Kaspersky researchers discovered a new Triada trojan variant preinstalled on thousands of Android devices, enabling data theft upon set…",
    "link": "https://securityaffairs.com/176143/malware/new-triada-comes-preinstalled-on-android-devices.html",
    "timestamp": "2025-04-03T05:16:20Z"
  },
  {
    "title": "Australia says U.S. tariffs 'not act of a friend' but rules out reciprocal move",
    "description": "Australian Prime Minister Anthony Albanese said on Thursday the decision by U.S. President Donald Trump to impose a 10% tariff on its ally was &quot;not the act of a friend,&quot; but ruled out reciprocal tariffs against the United States. In comments outside…",
    "link": "https://japantoday.com/category/world/australia-says-us-tariffs-%27not-act-of-a-friend%27-but-rules-out-reciprocal-move1",
    "timestamp": "2025-04-03T05:15:58Z"
  },
  {
    "title": "China urges U.S. to immediately lift tariffs, vows retaliation",
    "description": "China on Thursday urged the United States to immediately cancel its latest tariffs and vowed countermeasures to safeguard its own interests, after President Donald Trump declared sweeping levies on all U.S. trading partners around the world. The U.S. move dis…",
    "link": "https://japantoday.com/category/world/china-urges-us-to-immediately-lift-tariffs-vows-retaliation4",
    "timestamp": "2025-04-03T05:14:51Z"
  },
  {
    "title": "China urges US to immediately lift tariffs, vows retaliation",
    "description": "The US move disregards the balance of interests reached in multilateral trade negotiations over the years and the fact that it has long benefited greatly from international trade, the Chinese Commerce Ministry says",
    "link": "https://www.rappler.com/world/asia-pacific/china-urges-united-states-immediately-lift-tariffs/",
    "timestamp": "2025-04-03T05:14:31Z"
  },
  {
    "title": "CNA Explains: What are tariffs, and how will Trump's actions affect Asia?",
    "description": "What's “reciprocal\" about the US tariffs, why is Donald Trump doing this and what's been the reaction from this part of the world?",
    "link": "https://www.channelnewsasia.com/world/tariffs-reciprocal-trump-us-cna-explains-5041551",
    "timestamp": "2025-04-03T05:12:45Z"
  },
  {
    "title": "Taiwan Says US Tariffs 'Highly Unreasonable'",
    "description": "US President Donald Trump's tariffs were \"highly unreasonable\" and the government planned to start \"serious negotiations\" with Washington, Taipei said Thursday.",
    "link": "https://www.ibtimes.com/taiwan-says-us-tariffs-highly-unreasonable-3768667",
    "timestamp": "2025-04-03T05:12:17Z"
  },
  {
    "title": "Trump slaps Indonesia with 32-percent tariff",
    "description": "US President Donald Trump has imposed a near-universal tariff on products imported from foreign countries to the United States, with Indonesia not being an ...",
    "link": "https://en.antaranews.com/news/350577/trump-slaps-indonesia-with-32-percent-tariff",
    "timestamp": "2025-04-03T05:10:19Z"
  },
  {
    "title": "Taiwan says US tariffs ‘highly unreasonable’",
    "description": "US President Donald Trump’s tariffs were “highly unreasonable” and the government planned to start “serious negotiations” with Washington, Taipei said Thursday. Taiwan had sought to avoid Trump’s threatened levies by pledging increased investment in the Unite…",
    "link": "https://www.digitaljournal.com/world/taiwan-says-us-tariffs-highly-unreasonable/article",
    "timestamp": "2025-04-03T05:07:32Z"
  },
  {
    "title": "John Downing: Ireland’s best hope is that tariffs backfire and make Donald Trump a lame duck",
    "description": "Franklin D Roosevelt, the hero US president in the fight against the 1930s Great Depression, gave world politics the phrase “the first 100 days”.",
    "link": "https://www.independent.ie/irish-news/politics/john-downing-irelands-best-hope-is-that-tariffs-backfire-and-make-donald-trump-a-lame-duck/a1949278543.html",
    "timestamp": "2025-04-03T05:07:00Z"
  },
  {
    "title": "Von der Leyen ready to respond to new US tariffs but open to dialogue",
    "description": "The EU is prepared to respond to sweeping new US tariffs, European Commission President Ursula von der Leyen warned on Thursday, while urging President Donald Trump to seek dialogue instead.",
    "link": "https://biztoc.com/x/a4a2171dce42d83e",
    "timestamp": "2025-04-03T05:04:37Z"
  },
  {
    "title": "Commerce Secretary to Newsmax: World Has Exploited US",
    "description": "Commerce Secretary Howard Lutnick told Newsmax on Wednesday that President Donald Trump’s “Liberation Day” is “a great day because the rest of the world has been leaning on us, exploiting us, and taking advantage of us.”Earlier in the day Trump announced his …",
    "link": "https://freerepublic.com/focus/f-news/4308516/posts",
    "timestamp": "2025-04-03T05:04:20Z"
  },
  {
    "title": "The Czech Republic, and its quiet automotive giant Skoda, are bucking an economic downturn unfolding in its crucial ally Germany",
    "description": "There is a shadow hanging over the Europe. The ascent of Donald Trump to the White House has exposed brewing fragilities within the continent's economy and military prowess. That hasn’t been evident anywhere more than in Germany, the industrial powerhouse ree…",
    "link": "https://biztoc.com/x/07ff2aa037249319",
    "timestamp": "2025-04-03T05:04:16Z"
  },
  {
    "title": "Apple production hubs hard hit by tariffs",
    "description": "<p><strong>Apple</strong> Inc is finding itself squarely in the crosshairs of US President Donald Trump&rsquo;s new <strong>tariffs</strong>, even after a years-long effort to insulate the <strong>iPhone</strong> maker from trade wars and supply chain disrupt…",
    "link": "https://www.bangkokpost.com/business/general/2994667/apple-production-hubs-hard-hit-by-tariffs",
    "timestamp": "2025-04-03T05:03:00Z"
  },
  {
    "title": "Wide majority of Americans oppose impeaching judges who rule against Trump | CNN Politics",
    "description": "A wide majority of Americans – 70% - oppose impeaching federal judges who are slowing down President Donald Trump’s agenda as the idea continues to gain traction among Republicans in Congress, according to a poll released Thursday morning.",
    "link": "https://www.cnn.com/2025/04/03/politics/wide-majority-of-americans-oppose-impeaching-judges-who-rule-against-trump/index.html",
    "timestamp": "2025-04-03T05:00:35Z"
  },
  {
    "title": "After years of skilfully playing both sides of the ‘Boston or Berlin’ binary, we must now choose one of them",
    "description": "European capitals have arguably been better friends of Ireland for a much longer time",
    "link": "https://www.irishtimes.com/opinion/2025/04/03/after-years-of-skilfully-playing-both-sides-of-the-boston-or-berlin-binary-we-must-now-choose-between-them/",
    "timestamp": "2025-04-03T05:00:24Z"
  },
  {
    "title": "Kingspan backs up planned Ukraine investment",
    "description": "Insulation firm breaks ground on manufacturing campus in west of country despite ongoing Russian attacks",
    "link": "https://www.irishtimes.com/business/2025/04/03/kingspan-backs-up-planned-ukraine-investment/",
    "timestamp": "2025-04-03T05:00:01Z"
  },
  {
    "title": "The morning after Trump’s so-called ‘Liberation Day’: US president ignites historic trade war, EU to now prepare countermeasures",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/politics/the-morning-after-trumps-so-called-liberation-day-us-president-ignites-historic-trade-war-eu-to-now-prepare-countermeasures/a616185087.html",
    "timestamp": "2025-04-03T05:00:00Z"
  },
  {
    "title": "The morning after Trump’s so-called ‘Liberation Day’: US president ignites historic trade war, EU to now prepare countermeasures",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/the-morning-after-trumps-so-called-liberation-day-us-president-ignites-historic-trade-war-eu-to-now-prepare-countermeasures/a616185087.html",
    "timestamp": "2025-04-03T05:00:00Z"
  },
  {
    "title": "U.S. Bans Government Personnel in China From ‘Romantic or Sexual’ Relationships With Chinese Citizens",
    "description": "Though some U.S. agencies had rules on relationships, a blanket “non-fraternization” policy has been unheard of publicly since the Cold War.",
    "link": "https://time.com/7274178/us-china-government-fraternization-romantic-sexual-relationship-ban-cold-war/",
    "timestamp": "2025-04-03T05:00:00Z"
  },
  {
    "title": "US: End Campaign of Draconian Campus Arrests",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Pro-Palestinian student protesters at a demonstration at Columbia University on the third day of \"Gaza Solidarity Encampment\" in New York, US, April 19, 2024.\n © 2024 Selcuk Acar/Anadolu via Getty Images\n \n \n\n\n \n(Was…",
    "link": "https://www.hrw.org/news/2025/04/03/us-end-campaign-draconian-campus-arrests",
    "timestamp": "2025-04-03T05:00:00Z"
  },
  {
    "title": "What to buy in a falling market? Here are top 6 trading ideas for 3 April 2025",
    "description": "The Indian market is expected to open lower on Thursday as global cues remain weak following U.S. President Trump’s announcement of a 26% tariff on Indian imports. Analysts suggest a broader trading range for Nifty while highlighting key support and resistanc…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-to-buy-in-a-falling-market-here-are-top-6-trading-ideas-for-3-april-2025/articleshow/119929978.cms",
    "timestamp": "2025-04-03T04:58:21Z"
  },
  {
    "title": "Stephen Colbert Jokes Trump Tariffs Liberated America ‘From the Tyranny of Being Able to Buy Stuff’ Video",
    "description": "\"Who's ready to learn how to make their own iPad from scratch?\" the \"Late Show\" host adds\nThe post Stephen Colbert Jokes Trump Tariffs Liberated America ‘From the Tyranny of Being Able to Buy Stuff’ Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-monologue-trump-tariffs/",
    "timestamp": "2025-04-03T04:58:10Z"
  },
  {
    "title": "Europe prepares countermeasures to Trump’s tariffs, calling them a ‘major blow to the world economy’ | CNN Business",
    "description": "The European Union is preparing countermeasures to US President Donald Trump’s announcement of 20% tariffs on imports from the bloc, which it called a “major blow to the world economy.”",
    "link": "https://www.cnn.com/2025/04/03/business/europe-tariffs-us-von-der-leyen-intl-hnk/index.html",
    "timestamp": "2025-04-03T04:55:38Z"
  },
  {
    "title": "Crude oil futures sink as Trump imposes sweeping tariffs on trade partners",
    "description": "Crude oil futures drop over 2% as Trump announces 10% tariff on imports, impacting global energy demand concerns.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-sink-as-trump-imposes-sweeping-tariffs-on-trade-partners/article69406894.ece",
    "timestamp": "2025-04-03T04:55:02Z"
  }
]