[
  {
    "title": "Questions on Gaza's Future Remain After Hostages Freed",
    "description": "President Donald Trump pressed world leaders gathered at a summit on Gaza’s future to ensure the US-led truce between Israel and Hamas turns into a lasting peace, hailing the agreement as a “new beginning” for the war-torn region.\n“Today, for the first time a…",
    "link": "https://biztoc.com/x/cf9d9270ea577937",
    "timestamp": "2025-10-13T23:36:03Z"
  },
  {
    "title": "Don Jr calls bluff of The View cohost who vowed to wear MAGA hat on-air if Trump got all Israeli hostages out",
    "description": "The View’s Alyssa Farah Griffin made the pronouncement in December 2024",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-jr-the-view-maga-israel-hostages-b2844685.html",
    "timestamp": "2025-10-13T23:35:37Z"
  },
  {
    "title": "Did You Know, María Corina Machado, Who Thanked Trump After Receiving The Nobel Peace Prize, Is A Bitcoin Supporter",
    "description": "Venezuelan opposition leader María Corina Machado, who recently won the Nobel Peace Prize, has been a Bitcoin (CRYPTO: BTC) supporter, labeling it as a...",
    "link": "https://finance.yahoo.com/news/did-know-mar-corina-machado-233106122.html",
    "timestamp": "2025-10-13T23:31:06Z"
  },
  {
    "title": "Miss Major Griffin-Gracy, activist since Stonewall, has died",
    "description": "Miss Major Griffin-Gracy, a legendary transgender activist who had been in the movement since Stonewall, died Monday at age 78.",
    "link": "https://www.advocate.com/news/miss-major-griffin-gracy-obituary",
    "timestamp": "2025-10-13T23:29:19Z"
  },
  {
    "title": "Montreal suburb honours Hamas attack victims as hostages freed, Gaza looks to rebuild",
    "description": "Côte Saint-Luc held a commemorative event Monday for victims of Oct. 7, including Montrealer Alexandre Look. Others in Montreal are welcoming the ceasefire in Gaza and the release of hostages and prisoners, but are concerned about the future.",
    "link": "https://www.cbc.ca/news/canada/montreal/montreal-reaction-israel-hamas-hostage-release-9.6936911",
    "timestamp": "2025-10-13T23:26:53Z"
  },
  {
    "title": "As generative AI accelerates distrust, even Trump’s choice of tie can fuel conspiracy theories",
    "description": "The rise of artificial intelligence has seen the conversation surrounding media shift in recent years, and is helping fuel a new set of conspiracies across the political spectrum.\nThe post As generative AI accelerates distrust, even Trump’s choice of tie can …",
    "link": "http://www.crikey.com.au/2025/10/14/artificial-intelligence-conspiracy-theories-right-left/",
    "timestamp": "2025-10-13T23:18:35Z"
  },
  {
    "title": "David Jolly Takes Bid For Governor To Reddest Stretches Of Increasingly Red Florida",
    "description": "The former GOP lawmaker went to his likely opponent Byron Donalds’ hometown for a “town hall” question and answer session.",
    "link": "https://www.huffpost.com/entry/david-jolly-florida-governor_n_68ed12b3e4b00067de81d49b",
    "timestamp": "2025-10-13T23:18:21Z"
  },
  {
    "title": "Breaking down allegation Tom Homan accepted $50K bribe from undercover FBI agents",
    "description": "The FBI closed the case after U.S. President Donald Trump took office, according to several reliable news outlets.",
    "link": "https://www.snopes.com//news/2025/10/13/tom-homan-bribe/",
    "timestamp": "2025-10-13T23:16:00Z"
  },
  {
    "title": "Trump's talk of heaven and hate tests his evangelical followers",
    "description": "Pastor Paula White, third from left, and other faith leaders pray with President Donald Trump, center, during a rally for evangelical supporters on Jan. 3, 2020 in Miami, FL.",
    "link": "https://biztoc.com/x/c34e0d027ef02f47",
    "timestamp": "2025-10-13T23:14:13Z"
  },
  {
    "title": "Joint Egypt-Qatar-Turkiye-US statement on Gaza: The full text",
    "description": "Trump-backed proclamation backing Gaza ceasefire stresses equality, but stops short of supporting Palestine statehood.",
    "link": "https://www.aljazeera.com/news/2025/10/13/joint-egypt-qatar-turkiye-us-statement-on-gaza-the-full-text",
    "timestamp": "2025-10-13T23:10:48Z"
  },
  {
    "title": "'Confused' Trump told to sit back down amid attempt to speak out of turn: report",
    "description": "President Donald Trump seemed confused at the Israeli parliament on Monday, where he was slated to give a speech celebrating the release of the 20 surviving hostages taken by Hamas on Oct. 7, 2023, reports The Daily Beast.According to the Beast, \"the awkward …",
    "link": "https://www.rawstory.com/donald-trump-cognitive-health/",
    "timestamp": "2025-10-13T23:06:02Z"
  },
  {
    "title": "NASA's Jet Propulsion Laboratory lays off 550 workers",
    "description": "NASA’s Jet Propulsion Laboratory in California announced that it will cut around 550 jobs — around 10% of its staff.",
    "link": "https://www.nbcnews.com/science/space/nasa-jet-propulsion-laboratory-layoffs-rcna237435",
    "timestamp": "2025-10-13T23:03:26Z"
  },
  {
    "title": "‘Rare earths are a very useful weapon for China’: Former Commerce Secretary Wilbur Ross on the big economic danger",
    "description": "China’s tightening grip on the minerals that power America’s high-tech is no longer a distant geopolitical concern: it’s an economic threat already moving through U.S. supply chains.That’s the warning from Wilbur Ross, former U.S. Secretary of Commerce under …",
    "link": "https://biztoc.com/x/9c2ab3e1d746c27d",
    "timestamp": "2025-10-13T23:02:59Z"
  },
  {
    "title": "Israeli-born actress Natalie Portman praises Israel peace deal",
    "description": "Israeli-American actress Natalie Portman expressed excitement over end of Israel-Hamas war and hostage release during film festival appearance in Lyon, France.",
    "link": "https://www.foxnews.com/media/israeli-born-actress-natalie-portman-praises-israel-peace-deal",
    "timestamp": "2025-10-13T23:00:23Z"
  },
  {
    "title": "Russiagate Revisited: Uncovering the Truth (Part 2 of my notes on the 38 minute Podcast)",
    "description": "https://justthenews.com/podcasts/john-solomon-reports/russiagate-revisited-uncovering-truthRussiagate Revisited: Uncovering the TruthJohn Solomon ReportsThe link provided leads to a page which hosts the podcast - scroll down to find it. What to look for shown…",
    "link": "https://freerepublic.com/focus/f-chat/4346194/posts",
    "timestamp": "2025-10-13T22:54:22Z"
  },
  {
    "title": "Amid celebration of the hostages’ release, Mamdani issues rebuke to Israel, US over Gaza",
    "description": "NEW YORK — Democratic mayoral front-runner Zohran Mamdani welcomed the ceasefire agreement between Israel and Hamas on Monday, but also took clear shots at...",
    "link": "https://www.nydailynews.com/2025/10/13/as-cuomo-sliwa-celebrate-return-of-israeli-hostages-from-gaza-mamdani-remains-mum/",
    "timestamp": "2025-10-13T22:54:00Z"
  },
  {
    "title": "Videos Show Freed Hostages Reunite With Loved Ones Amid Trump Peace Deal",
    "description": "Freed Israeli hostages ran into the arms of loved ones on Monday as emotional reunion videos swept across social media.",
    "link": "https://dailycaller.com/2025/10/13/video-freed-hostages-reunite-love-ones-trump-peace-deal/",
    "timestamp": "2025-10-13T22:52:54Z"
  },
  {
    "title": "Wall Street stocks bounce as Trump softens posture on China after tariff threats",
    "description": "Wall Street stocks rebounded on Monday from steep pre-weekend falls as US President Donald Trump softened his posture on China following earlier threats of large tariffs.\nEuropean stock markets made modest gains while Asia’s leading stock markets began the we…",
    "link": "https://biztoc.com/x/4c0c225d2c9027dc",
    "timestamp": "2025-10-13T22:51:44Z"
  },
  {
    "title": "US Republican leader warns government shutdown could be longest in history",
    "description": "House Speaker Mike Johnson says that he will not negotiate with Democrats until they drop healthcare demands.",
    "link": "https://www.aljazeera.com/news/2025/10/13/us-republican-leader-warns-government-shutdown-could-be-longest-in-history",
    "timestamp": "2025-10-13T22:48:27Z"
  },
  {
    "title": "‘Rare earths are a very useful weapon for China’: Former Commerce Secretary Wilbur Ross on the big economic danger",
    "description": "The last week could just be a preview to China weaponizing its entire supply chain, the investor told Fortune.",
    "link": "https://fortune.com/2025/10/13/rare-earths-china-us-deal-trump-ross-wilbur-xi/",
    "timestamp": "2025-10-13T22:47:01Z"
  },
  {
    "title": "'Start Being Human!': Martin Sheen Destroys Trump and Rages 'You Are the Biggest Nothing in the World' in Blistering Rant Against 'Narcissistic' Prez",
    "description": "The actor advised the president to stop listening to the 'sycophants' he's surrounded himself with and 'start being human.'",
    "link": "https://radaronline.com/p/martin-sheen-donald-trump-narissist-rant-ego-fear-controlling-white-house/",
    "timestamp": "2025-10-13T22:45:00Z"
  },
  {
    "title": "New York Times, AP, Newsmax among news outlets who say they won’t sign new Pentagon rules",
    "description": "Journalists say the policy punishes routine newsgathering.",
    "link": "https://www.bostonherald.com/2025/10/13/news-outlets-pentagon-rules/",
    "timestamp": "2025-10-13T22:44:22Z"
  },
  {
    "title": "Vance Warns Of ‘Deeper’ Cuts Ahead For Federal Workers Amid Government Shutdown",
    "description": "The vice president blamed Democrats for what’s to come.",
    "link": "https://www.huffpost.com/entry/jd-vance-job-cuts-federal-workers-government-shutdown_n_68ed24bce4b00067de81f037",
    "timestamp": "2025-10-13T22:43:15Z"
  },
  {
    "title": "DR. MARC SIEGEL: From Horror to Hope: What Gaza's freed hostages teach a weary world",
    "description": "Twenty living hostages were finally released from captivity in Gaza on Monday. They demonstrate courage and survival, echoing historical stories of faith during the Holocaust.",
    "link": "https://www.foxnews.com/opinion/dr-marc-siegel-from-horror-hope-what-gazas-freed-hostages-teach-weary-world",
    "timestamp": "2025-10-13T22:41:03Z"
  },
  {
    "title": "Israel-Hamas: Read Donald Trump's Peace Declaration for the War in Gaza",
    "description": "A peace declaration has been signed by U.S. President Donald Trump and other world leaders.",
    "link": "https://biztoc.com/x/c542250c0fce240d",
    "timestamp": "2025-10-13T22:40:30Z"
  },
  {
    "title": "Trump Refuses To Let Go Of Macron During Aggressively Long Handshake At Egypt Summit (Graeme Demianyk/HuffPost)",
    "description": "Graeme Demianyk / HuffPost:\nTrump Refuses To Let Go Of Macron During Aggressively Long Handshake At Egypt Summit  —  When the French president attempted to break away, Trump continued to hold firm.  —  Video  —  President Donald Trump and French President Emm…",
    "link": "https://www.memeorandum.com/251013/p100",
    "timestamp": "2025-10-13T22:40:00Z"
  },
  {
    "title": "Pakistan announces intention for second Nobel Peace Prize nomination for Trump over Gaza ceasefire role",
    "description": "Prime Minister Shehbaz Sharif said Pakistan will nominate President Donald Trump for Nobel Peace Prize, citing his contributions to Middle East and peace.",
    "link": "https://www.foxnews.com/politics/pakistan-announces-intention-second-nobel-peace-prize-nomination-trump-over-gaza-ceasefire-role",
    "timestamp": "2025-10-13T22:37:05Z"
  },
  {
    "title": "Glenn Beck Says the FBI Came to His House To Learn About Antifa: ‘Saturday, I Get a Phone Call…’",
    "description": "Right-wing media personality Glenn Beck said FBI Director Kash Patel dispatched agents to his house to ask him questions about Antifa.\nThe post Glenn Beck Says the FBI Came to His House To Learn About Antifa: ‘Saturday, I Get a Phone Call…’ first appeared on …",
    "link": "https://www.mediaite.com/politics/glenn-beck-says-the-fbi-came-to-his-house-to-learn-about-antifa-saturday-i-get-a-phone-call/",
    "timestamp": "2025-10-13T22:36:23Z"
  },
  {
    "title": "Trump’s ‘shock and awe’ foreign policy achieved a breakthrough in Gaza — but is it sustainable?",
    "description": "Donald Trump's unique approach to diplomacy has seen results in Gaza, but questions remain over how effective it is in tackling larger geostrategic problems.\nThe post Trump’s ‘shock and awe’ foreign policy achieved a breakthrough in Gaza — but is it sustainab…",
    "link": "http://www.crikey.com.au/2025/10/14/donald-trump-shock-and-awe-foreign-policy-gaza-israel-hamas/",
    "timestamp": "2025-10-13T22:33:48Z"
  },
  {
    "title": "Rachel Maddow Believes Trump Indictments Aim to Make It ‘Illegal or Terrifying’ to Oppose Him | Video",
    "description": "\"They're putting heads on pikes and putting those pikes up at the gates to the city to say it's not possible to criticize, let alone oppose, this president,\" the MSNBC host adds\nThe post Rachel Maddow Believes Trump Indictments Aim to Make It ‘Illegal or Terr…",
    "link": "https://www.thewrap.com/rachel-maddow-trump-indictments-illegal-terrifying-to-oppose/",
    "timestamp": "2025-10-13T22:31:25Z"
  },
  {
    "title": "Trump and world leaders meet in Egypt on future of Gaza as Israel celebrates return of hostages (Washington Post)",
    "description": "Washington Post:\nTrump and world leaders meet in Egypt on future of Gaza as Israel celebrates return of hostages  —  President Donald Trump departed Sharm el-Sheikh, Egypt, on Monday, after meeting with world leaders at a summit to discuss the future of Gaza.…",
    "link": "https://www.memeorandum.com/251013/p97",
    "timestamp": "2025-10-13T22:30:02Z"
  },
  {
    "title": "Before publicly turning on San Francisco, Marc Benioff had privately left it behind",
    "description": "Several hours after the New York Times quoted him calling on Donald Trump (opens in new tab) to deploy the National Guard to his hometown, Marc Benioff — the billionaire Salesforce founder and longtime champion of San Francisco — still had a lot to get off hi…",
    "link": "https://biztoc.com/x/97e65459c9264199",
    "timestamp": "2025-10-13T22:29:49Z"
  },
  {
    "title": "Trump says time to drop ‘old feuds’",
    "description": "President Donald Trump called for a new era of harmony in the Middle East on Monday during a global summit on Gaza's future, trying to advance broader peace in the region after visiting Israel to celebrate a U.S.-brokered ceasefire with Hamas.",
    "link": "https://www.bostonherald.com/2025/10/13/trump-says-time-to-drop-old-feuds/",
    "timestamp": "2025-10-13T22:29:42Z"
  },
  {
    "title": "Trump's talk of heaven and hate tests his evangelical followers",
    "description": "The MAGA movement has long tried to portray their leader as a Christ-like figure. Trump has leaned into that, but lately he's making it harder.",
    "link": "https://www.msnbc.com/top-stories/latest/trumps-talk-heaven-hate-tests-evangelical-followers-rcna237407",
    "timestamp": "2025-10-13T22:27:38Z"
  },
  {
    "title": "Did Trump's 100% Tariff on Chinese Goods Drive a Man to Suicide? Crypto Influencer Found Dead in His Car",
    "description": "Popular crypto influencer Konstantin Galich supposedly took his own life inside his Lamborghini right after US President Donald Trump's tariff announcement on China triggered a massive crypto liquidation event.",
    "link": "https://www.ibtimes.com/did-trumps-100-tariff-chinese-goods-drive-man-suicide-crypto-influencer-found-dead-his-car-3786806",
    "timestamp": "2025-10-13T22:27:10Z"
  },
  {
    "title": "China’s demographic crisis means it’s going to run out of workers",
    "description": "The biggest challenge China faces right now isn’t the Trump administration and its campaign to decouple the world’s two biggest economies. It comes from within: China is experiencing population decline on a scale and at a speed the world has never seen. This …",
    "link": "https://freerepublic.com/focus/f-news/4346190/posts",
    "timestamp": "2025-10-13T22:27:02Z"
  },
  {
    "title": "After hostages and prisoners are freed, complex issues remain for Israel-Hamas ceasefire",
    "description": "JERUSALEM (AP) — Israel and Hamas moved ahead on a key first step of the tenuous Gaza ceasefire agreement on Monday by freeing hostages and prisoners, raising hopes that the U.S.-brokered deal might lead to a permanent end to the two-year war that ravaged the…",
    "link": "https://freerepublic.com/focus/f-news/4346189/posts",
    "timestamp": "2025-10-13T22:26:13Z"
  },
  {
    "title": "Hakeem Jeffries Highlights Marjorie Taylor Greene’s ‘Surprisingly Enlightened’ Break With GOP",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., has repeatedly criticized the GOP for the government shutdown, which has lasted nearly two weeks.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/13/hakeem-jeffries-highlights-marjorie-taylor-greenes-surprisingly-enlightened-break-with-gop/",
    "timestamp": "2025-10-13T22:25:59Z"
  },
  {
    "title": "WATCH: Notorious network anchor claims Israeli hostages ‘treated better’ than Gazans, apologizes after backlash",
    "description": "'Hamas used these hostages as pawns and bargaining chips. It was insensitive and wrong'",
    "link": "https://www.wnd.com/2025/10/watch-notorious-network-anchor-claims-israeli-hostages-treated/",
    "timestamp": "2025-10-13T22:25:48Z"
  },
  {
    "title": "Bad Bunny at the Super Bowl Sparks MAGA Conspiracy Around Patrick Mahomes",
    "description": "A provocative social media post claiming that Kansas City Chiefs quarterback Patrick Mahomes vowed to boycott the Super Bowl over Bad Bunny as the headliner halftime show, has gone viral. The post, shared widely across Facebook and fan pages, alleges that Mah…",
    "link": "https://www.ibtimes.com/bad-bunny-super-bowl-sparks-maga-conspiracy-around-patrick-mahomes-3786815",
    "timestamp": "2025-10-13T22:24:41Z"
  },
  {
    "title": "RFK Jr. Claims There Are Studies Linking Circumcision To Autism. Here's What the Science Really Says.",
    "description": "On October 9th, RFK Jr stated that boys who undergo circumcision are “twice as likely” to be later diagnosed with autism. Here's what the experts have to say.",
    "link": "https://www.menshealth.com/sex-women/a69021312/rfk-claims-circumcision-autism/",
    "timestamp": "2025-10-13T22:21:00Z"
  },
  {
    "title": "New York Times, AP, Newsmax among news outlets who say they won't sign new Pentagon rules",
    "description": "News organizations including The New York Times, The Associated Press and the conservative Newsmax television network said Monday they will not sign a...",
    "link": "https://www.yahoo.com/news/articles/york-times-ap-newsmax-among-222017341.html",
    "timestamp": "2025-10-13T22:20:17Z"
  },
  {
    "title": "Multiple news outlets say they won't sign new Pentagon rules on access",
    "description": "The New York Times, The Associated Press and the conservative television network Newsmax are among five outlets on Monday who say they won't sign a new Defense Department document about its new press rules. Defense Secretary Pete Hegseth's team has said that …",
    "link": "https://apnews.com/article/pentagon-press-access-defense-department-rules-95878bce05096912887701eaa6d019c6",
    "timestamp": "2025-10-13T22:20:17Z"
  },
  {
    "title": "Patrick Bet-David Predicts Dems Will Campaign In ‘Weirdest Way’ For 2028, Try To ‘Build Up Trump’ While Knocking Vance",
    "description": "Patrick Bet-David predicted that Democrats would “build up” President Donald Trump in the 2028 campaign in order to defeat Vice President J.D. Vance.",
    "link": "https://dailycaller.com/2025/10/13/patrick-bet-david-predicts-dems-will-campaign-weirdest-way-2028-build-up-trump-knocking-vance/",
    "timestamp": "2025-10-13T22:19:48Z"
  },
  {
    "title": "Israel-Hamas peace plan underway after hostages and prisoners are released",
    "description": "Israel and Hamas have signed a peace agreement, ending two years of conflict, with President Donald Trump receiving praise for his role in brokering the deal.",
    "link": "https://www.wbaltv.com/article/israel-hamas-peace-plan-gaza-rebuilding/69021112",
    "timestamp": "2025-10-13T22:16:55Z"
  },
  {
    "title": "Israel-Hamas peace plan underway after hostages and prisoners are released",
    "description": "Israel and Hamas have signed a peace agreement, ending two years of conflict, with President Donald Trump receiving praise for his role in brokering the deal.",
    "link": "https://www.wmur.com/article/israel-hamas-peace-plan-gaza-rebuilding/69021112",
    "timestamp": "2025-10-13T22:16:24Z"
  },
  {
    "title": "Alec and Stephen Baldwin Plow Their Range Rover into a Tree, and Survive",
    "description": "Alec Baldwin can't seem to catch a break ... because he was just involved in a vehicle crash in The Hamptons, TMZ has learned. The Oscar-winning actor and his brother Stephen got into an accident in East Hampton, New York, on Monday when they…",
    "link": "https://www.tmz.com/2025/10/13/alec-baldwin-car-crash-hamptons/",
    "timestamp": "2025-10-13T22:15:01Z"
  },
  {
    "title": "Calls grow for release of Gaza’s Dr Hussam Abu Safia after ceasefire deal",
    "description": "There have been conflicting reports on whether Israel would free prominent Gaza medic as part of the truce agreement.",
    "link": "https://www.aljazeera.com/news/2025/10/13/calls-grow-for-release-of-gazas-dr-hussam-abu-safia-after-ceasefire-deal",
    "timestamp": "2025-10-13T22:14:21Z"
  },
  {
    "title": "Dallas Auto Lender For Illegal Aliens Collapses Amid Fraud Allegations",
    "description": "A Dallas-based auto lender once praised by the U.S. Treasury for “community development” has filed for bankruptcy amid allegations of fraud and financial misconduct, leaving major U.S. banks facing heavy losses. Tricolor Holdings, which specialized in selling…",
    "link": "https://freerepublic.com/focus/f-bloggers/4346183/posts",
    "timestamp": "2025-10-13T22:14:09Z"
  },
  {
    "title": "Israeli opposition politicians interrupt Trump’s Knesset speech (VIDEO)",
    "description": "Two Israeli politicians were escorted from the Knesset for holding pro-Palestine signs during US President Donald Trump’s speech Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626393-israeli-mks-interrupt-trump/",
    "timestamp": "2025-10-13T22:13:23Z"
  },
  {
    "title": "Salesforce CEO Marc Benioff, SF Mayor Scrap Event After National Guard Comment",
    "description": "The event was scheduled days after Benioff praised President Donald Trump in an interview with The New York Times, advocating for him to send troops to San Francisco.",
    "link": "https://www.kqed.org/news/12059728/salesforce-ceo-marc-benioff-sf-mayor-scrap-event-after-national-guard-comment",
    "timestamp": "2025-10-13T22:12:35Z"
  },
  {
    "title": "3 reasons why a Bitcoin rally to $125K could be delayed",
    "description": "Friday’s flash crash reduced short-term risk appetite but did not affect Bitcoin’s long-term potential, possibly delaying a new all-time high by weeks or even months.",
    "link": "https://cointelegraph.com/news/3-reasons-why-a-bitcoin-rally-to-dollar125k-could-be-delayed",
    "timestamp": "2025-10-13T22:12:04Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks fell Tuesday, resuming the selling seen late last week, as trade worries were reignited overnight by China.",
    "link": "https://www.cnbc.com/2025/10/13/stock-market-today-live-updates.html",
    "timestamp": "2025-10-13T22:11:48Z"
  },
  {
    "title": "Trump Likened to Ancient Biblical Ruler Who Came to Aid of Israel, As Hostages Released, Peace Deal Signed",
    "description": "Israelis likened President Donald Trump to an ancient king recorded in the Bible after the release of Jewish hostages from Hamas.",
    "link": "https://www.westernjournal.com/trump-likened-ancient-biblical-ruler-came-aid-israel-hostages-released-peace-deal-signed/",
    "timestamp": "2025-10-13T22:11:01Z"
  },
  {
    "title": "Trump's ICE raids causing 'moral horror' for top ally who sees no 'off-ramp': analysts",
    "description": "President Donald Trump's immigration policies appear to be creating a \"moral horror\" for at least one of the president's allies in Congress, according to two analysts.Krystal Ball and Emily Jashinsky, co-hosts of the \"Breaking Points\" podcast, said on Monday …",
    "link": "https://www.rawstory.com/trump-immigration-2674180702/",
    "timestamp": "2025-10-13T22:08:02Z"
  },
  {
    "title": "Trump Says Gaza Hostages Released On Schedule",
    "description": "President Donald Trump kicked off a global summit in Egypt on Gaza’s future, aimed at ensuring the US-led truce in the Middle East turns into a lasting peace.\nThe stop was Trump’s second during his whirlwind trip to the region, following a visit to Israel to …",
    "link": "https://biztoc.com/x/834090d74abe8ed9",
    "timestamp": "2025-10-13T22:07:39Z"
  },
  {
    "title": "Former Louisiana Gov. John Bel Edwards, a Democrat, says he will not run for US Senate",
    "description": "Democratic former Louisiana Gov. John Bel Edwards has announced that he will not run for the U.S. Senate in 2026",
    "link": "https://abcnews.go.com/Politics/wireStory/former-louisiana-gov-john-bel-edwards-democrat-run-126490874",
    "timestamp": "2025-10-13T22:06:01Z"
  },
  {
    "title": "Got a pair of these? There's more to them than meets the eye - and it may mean global trade war",
    "description": "Right now, about 70% of the world's rare earth elements - key to everything from AirPods to cars - are mined in China, which announced last week that anyone using Chinese rare earths would have to apply for a licence. This has been seen as a declaration of ec…",
    "link": "https://news.sky.com/story/got-a-pair-of-these-theres-more-to-them-than-meets-the-eye-and-it-may-mean-global-trade-war-13449786",
    "timestamp": "2025-10-13T22:02:00Z"
  },
  {
    "title": "Mamdani breaks silence on freed Israeli hostages in statement that doesn't mention Trump",
    "description": "New York City socialist mayoral candidate Zohran Mamdani broke his silence on the release of Israeli hostages on Monday in a statement that did not mention President Trump.",
    "link": "https://www.foxnews.com/politics/mamdani-breaks-silence-on-freed-israeli-hostages-in-statement-that-doesnt-mention-trump",
    "timestamp": "2025-10-13T22:01:21Z"
  },
  {
    "title": "Time magazine heralds Israel-Hamas peace plan as Trump's 'triumph' on new cover",
    "description": "President Donald Trump received praise from Time magazine, which touted his \"triumph\" in the Middle East for brokering the Israel-Hamas peace agreement on its new cover.",
    "link": "https://www.foxnews.com/media/time-magazine-heralds-israel-hamas-peace-plan-trumps-triumph-new-cover",
    "timestamp": "2025-10-13T22:00:58Z"
  },
  {
    "title": "President Donald Trump Receives Egypt’s Highest State Honor, the Order of the Nile",
    "description": "The honor is is traditionally awarded by presidential decree to figures whose efforts have offered exceptional service to Egypt or humanity.\nThe post President Donald Trump Receives Egypt’s Highest State Honor, the Order of the Nile first appeared on Le·gal I…",
    "link": "https://legalinsurrection.com/2025/10/president-donald-trump-receives-egypts-highest-state-honor-the-order-of-the-nile/",
    "timestamp": "2025-10-13T22:00:13Z"
  },
  {
    "title": "U.S. consumers bearing more than half the cost of tariffs so far, Goldman Sachs says (Rob Wile/NBC News)",
    "description": "Rob Wile / NBC News:\nU.S. consumers bearing more than half the cost of tariffs so far, Goldman Sachs says  —  The findings suggest U.S. consumers will continue to struggle with high prices — something Trump had promised to address in the run-up to his re-elec…",
    "link": "https://www.memeorandum.com/251013/p95",
    "timestamp": "2025-10-13T22:00:01Z"
  },
  {
    "title": "Trump’s CBD Medicare signal sparks 36% boost in cannabis stocks — but should investors hold or brace for policy risks?",
    "description": "Is it high time to invest in cannabis stock?",
    "link": "https://finance.yahoo.com/news/trump-cbd-medicare-signal-sparks-220000818.html",
    "timestamp": "2025-10-13T22:00:00Z"
  },
  {
    "title": "'Buy As Much As You Can': MAGA Reporter Records Commercial From Inside White House",
    "description": "A correspondent who supports President Donald Trump was allowed to record a commercial inside the White House.\n\n\nIn a video recording from the White House briefing room, reporter Corinne Cliford encouraged her followers to purchase satellite phones from her s…",
    "link": "https://crooksandliars.com/2025/10/buy-much-you-can-maga-reporter-records",
    "timestamp": "2025-10-13T21:59:03Z"
  },
  {
    "title": "Alleged Hyperliquid whale denies insider trading with Trumps",
    "description": "Former BitForex CEO Garrett Jin took to social media to criticize Changpeng Zhao and deny allegations of insider trading based on reports about a massive Bitcoin short.",
    "link": "https://cointelegraph.com/news/garrett-jin-whale-denies-allegations-shorting-bitcoin",
    "timestamp": "2025-10-13T21:58:30Z"
  },
  {
    "title": "Commentary: Trump may be a more serious contender for Nobel Peace Prize in 2026",
    "description": "While he deserves some credit for his efforts, US President Donald Trump does not have a spotless track record as a peacemaker, says a University of Birmingham professor.",
    "link": "https://www.channelnewsasia.com/commentary/trump-nobel-peace-prize-maria-corina-machado-end-war-5398691",
    "timestamp": "2025-10-13T21:58:00Z"
  },
  {
    "title": "In Portland, naked bike riders protest Trump’s military plans",
    "description": "As the threat of National Guard troops descending on the city looms, protesters in Portland, Oregon, are putting a new spin on their demonstrations against the Trump administration",
    "link": "https://www.msnbc.com/top-stories/latest/portland-naked-bike-protest-trump-national-guard-rcna237364",
    "timestamp": "2025-10-13T21:57:32Z"
  },
  {
    "title": "Trump allies accused of misleading donors with bogus 'Treasury' summit pitch",
    "description": "Ethics experts are furious after Trump allies running a private investment firm promoted an event called the “Inaugural U.S. Treasury A.I. Summit,” that was billed as having Treasury Secretary Scott Bessent deliver an address and was heavily implied to be an …",
    "link": "https://www.rawstory.com/trump-bessent/",
    "timestamp": "2025-10-13T21:57:02Z"
  },
  {
    "title": "Fighting flares in Gaza as Donald Trump says “The war is over”",
    "description": "Fighting flares in Gaza as Donald Trump says “The war is over”\nClashes between Hamas and armed gangs threaten his peace plan\nIT TOOK Donald Trump less than 12 hours on the ground to bring peace to the Middle East. At least this is how the American president’s…",
    "link": "https://biztoc.com/x/d7ccbf855ade7e30",
    "timestamp": "2025-10-13T21:56:24Z"
  },
  {
    "title": "Wall Street ends sharply higher on Trump China comments | Honolulu Star-Advertiser",
    "description": "Wall Street’s main indexes ended sharply higher today, led by gains in Broadcom and other chipmakers, after President Donald Trump struck a conciliatory tone about renewed U.S.-China trade tensions, easing investor worries.",
    "link": "https://www.staradvertiser.com/2025/10/13/breaking-news/wall-street-ends-sharply-higher-on-trump-china-comments/",
    "timestamp": "2025-10-13T21:56:18Z"
  },
  {
    "title": "New poll shows Trump is beating Obama and Bush, winning over Americans (Joseph Mackinnon/Blaze Media)",
    "description": "Joseph Mackinnon / Blaze Media:\nNew poll shows Trump is beating Obama and Bush, winning over Americans  —  Trump is outperforming two of his recent predecessors at this stage in his second term.  —  President Donald Trump successfully brokered a peace last we…",
    "link": "https://www.memeorandum.com/251013/p94",
    "timestamp": "2025-10-13T21:55:01Z"
  },
  {
    "title": "‘Inherently Corrupting’: Obama Rips Trump’s Military Deployment In Chicago",
    "description": "Former President Barack Obama tore into President Donald Trump‘s attempts to use the military in American cities, saying that democracy is being“weakened deliberately.” Obama cited Trump’s deployment of National Guard troops into Chicago, arguing that a presi…",
    "link": "https://crooksandliars.com/2025/10/inherently-corrupting-obama-rips-trump-s",
    "timestamp": "2025-10-13T21:53:55Z"
  },
  {
    "title": "Explaining the Bitcoin Crash: What Are Liquidations and Leverage?",
    "description": "Here's why Trump's China tariff announcement on Friday was so devastating for leveraged traders.",
    "link": "https://decrypt.co/344141/explaining-bitcoin-crash-liquidations-leverage",
    "timestamp": "2025-10-13T21:52:40Z"
  },
  {
    "title": "The Trump Declaration for Enduring Peace and Prosperity - The White House (.gov)",
    "description": "The Trump Declaration for Enduring Peace and ProsperityThe White House (.gov) Five key takeaways from Donald Trump’s Gaza remarks in Middle EastAl Jazeera FirstFT: Trump hails ‘historic dawn’ in Middle EastFinancial Times When Biden visited Israel, wounds wer…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179773280",
    "timestamp": "2025-10-13T21:52:39Z"
  },
  {
    "title": "Hegseth pushes fitness standards after Texas replaces some National Guard troops",
    "description": "Hegseth told military leaders last month that it was \"tiring\" to see \"fat troops\" and \"unacceptable to see fat generals and admirals in the halls of the Pentagon leading commands around the country and the world.”",
    "link": "https://justthenews.com/government/security/hegseth-pushes-fitness-standards-after-texas-replaces-some-national-guard",
    "timestamp": "2025-10-13T21:51:28Z"
  },
  {
    "title": "Newsom Forces Schools To Promote Radical Trans Group’s LGBTQ ‘Hotline’ On Student IDs",
    "description": "California Gov. Gavin Newsom signed a bill into law requiring student IDs to include the phone number for a transgender advocacy group’s LGBTQ youth hotline.",
    "link": "https://dailycaller.com/2025/10/13/newsom-forces-schools-to-promote-radical-trans-groups-lgbtq-hotline-on-student-ids/",
    "timestamp": "2025-10-13T21:51:11Z"
  },
  {
    "title": "LISTEN LIVE: SCOTUS hears redistricting case that could reduce representation for Black voters",
    "description": "In arguments Wednesday, lawyers for Louisiana and the Trump administration will try to persuade the justices to wipe away the state's second majority Black congressional district and make it much harder, if not impossible, to take account of race in redistric…",
    "link": "https://www.pbs.org/newshour/politics/listen-live-scotus-hears-redistricting-case-that-could-reduce-representation-for-black-voters",
    "timestamp": "2025-10-13T21:50:31Z"
  },
  {
    "title": "'A lifeline' - Americans fear spike in healthcare costs, making Republicans nervy",
    "description": "The cost of health insurance could double for millions of people, which could hurt Republicans.",
    "link": "https://www.bbc.com/news/articles/c0l7899352ro?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-13T21:50:14Z"
  },
  {
    "title": "How Trump worked a Mideast miracle with his two-sided ‘America First’ doctrine",
    "description": "President Trump wants his tariffs to reshore manufacturing and end the fleecing of America, but he’s simultaneously using them to accomplish all manner of policy wins — including Mideast peace.",
    "link": "https://nypost.com/2025/10/13/opinion/how-trumps-america-first-doctrine-worked-a-mideast-miracle/",
    "timestamp": "2025-10-13T21:47:38Z"
  },
  {
    "title": "This is why the story of Abraham is coming up in the push for Middle East peace",
    "description": "President Donald Trump repeatedly touted the “Abraham Accords” in his Middle East trip on Monday, seeking to build on 2020 agreements that expanded the...",
    "link": "https://www.yahoo.com/news/articles/abraham-dont-surprised-biblical-figure-214208194.html",
    "timestamp": "2025-10-13T21:42:08Z"
  },
  {
    "title": "DOJ stuns CNN reporter saying 'quiet part out loud' about Trump ally",
    "description": "President Donald Trump's hand-picked prosecutor in the Eastern District of Virginia is getting a lot of pushback from career prosecutors in the office because of her efforts to prosecute the president's political foes, CNN reporter Katelyn Polantz revealed on…",
    "link": "https://www.rawstory.com/trump-doj-2674180761/",
    "timestamp": "2025-10-13T21:40:02Z"
  },
  {
    "title": "A Tale of Two Political Parties",
    "description": "In America today, our two major political parties are moving in opposite directions. For Republicans, it might be the “best of times.” Under the leadership of President Donald Trump, the GOP is feeling confident. Republicans have a strong chance to retain con…",
    "link": "https://freerepublic.com/focus/f-chat/4346174/posts",
    "timestamp": "2025-10-13T21:37:18Z"
  },
  {
    "title": "'A lifeline' - Americans fear spike in healthcare costs, making Republicans nervy",
    "description": "The cost of health insurance could double for millions of people, which could hurt Republicans.",
    "link": "https://www.bbc.com/news/articles/c0l7899352ro",
    "timestamp": "2025-10-13T21:36:52Z"
  },
  {
    "title": "World leaders meet in Egypt to discuss post-war Gaza plans amid hostage, prisoner swap",
    "description": "U.S. President Donald Trump embarked on a whirlwind trip to the Middle East on Monday to cement the end of the war between Israel and Hamas, and to reaffirm his ambitions to usher in peace between the two.",
    "link": "https://www.cbc.ca/news/world/egypt-gaza-trump-summit-9.6937028",
    "timestamp": "2025-10-13T21:33:34Z"
  },
  {
    "title": "Venezuela says US navy raided a tuna boat in the Caribbean as tensions rise",
    "description": "The fishing boat had authorization from the Ministry of Fisheries to carry out its work.",
    "link": "https://www.bostonherald.com/2025/10/13/venezuela-us-tensions/",
    "timestamp": "2025-10-13T21:33:26Z"
  },
  {
    "title": "‘Wonderful Day’: Chuck Schumer Thanks Trump For Release Of Israeli Hostages Held By Hamas",
    "description": "Chuck Schumer commended President Donald Trump on Monday for brokering the Middle East peace deal to end the Israel-Hamas war and release Israeli hostages.",
    "link": "https://dailycaller.com/2025/10/13/chuck-schumer-israeli-hostages/",
    "timestamp": "2025-10-13T21:33:08Z"
  },
  {
    "title": "GOP ‘RINOs’ Consider Attending Big Globalist Climate Shindig",
    "description": "GOP Utah Sen. John Curtis is reportedly planning to lead a delegation to the massive annual U.N. climate conference.",
    "link": "https://dailycaller.com/2025/10/13/gop-rinos-consider-attending-cop-30/",
    "timestamp": "2025-10-13T21:32:48Z"
  },
  {
    "title": "Crypto Trader Dies By Suicide In Ukraine Amid $19 Billion Market Crash",
    "description": "According to local police and multiple news reports, crypto trader Konstantin Galish — also known by the name Kostya Kudo — was discovered dead inside his Lamborghini Urus in the Obolon district of Kyiv. He was 32. Related Reading: Bitcoin Or Your Life? Israe…",
    "link": "https://bitcoinist.com/crypto-trader-dies-by-suicide-in-ukraine-amid-19-billion-market-crash/",
    "timestamp": "2025-10-13T21:30:54Z"
  },
  {
    "title": "Trump takes swipe at Hillary Clinton, blasts Obama and Biden in passionate address to Israeli parliament",
    "description": "President Donald Trump settled scores with his political foes during his passionate address to the Israeli parliament on Monday, taking a swipe at Hillary Clinton and blasting his predecessors Joe Biden and Barack Obama.",
    "link": "https://nypost.com/2025/10/13/us-news/trump-takes-swipe-at-hillary-clinton-blasts-obama-and-biden-in-knesset-speech/",
    "timestamp": "2025-10-13T21:28:24Z"
  },
  {
    "title": "Reviving US-Iran diplomacy difficult despite Trump’s ‘hand of friendship’",
    "description": "Analysts say US may be comfortable with the status quo, and many in Iran are wary of negotiations after the 12-day war.",
    "link": "https://www.aljazeera.com/news/2025/10/13/reviving-us-iran-diplomacy-difficult-despite-trumps-hand-of-friendship",
    "timestamp": "2025-10-13T21:27:25Z"
  },
  {
    "title": "Through A Biblical Lens: Don’t Expect The Present Peace Plan To Lead To ‘An Everlasting Peace In The Middle East’",
    "description": "As I write this, the people of Israel, Gaza, and the world hope that the Gaza war is finally coming to an end. Will there be more delays? Probably. Has Hamas been removed? Over time, will Hamas be reborn or will a Hamas-like entity rise to take its place? The…",
    "link": "https://freerepublic.com/focus/f-religion/4346172/posts",
    "timestamp": "2025-10-13T21:25:58Z"
  },
  {
    "title": "Eurovision organizers push back Israel decision to December",
    "description": "The Eurovision Song Contest's organizers said Monday they had put back taking a decision on Israel's participation in next year's event, given the Gaza ceasefire. The European Broadcasting Union's members were due to hold a vote next month, after a growing nu…",
    "link": "https://japantoday.com/category/entertainment/eurovision-organisers-push-back-israel-decision-to-december",
    "timestamp": "2025-10-13T21:25:30Z"
  },
  {
    "title": "Ukraine's Zelenskyy to meet with Trump at the White House on Friday",
    "description": "Ukrainian President Volodymyr Zelenskyy is expected to meet with President Donald Trump at the White House on Friday, according to an administration official, a Western official and a Ukrainian embassy spokesperson. Ukraine's ambassador to the U.S., Olga Stef…",
    "link": "https://freerepublic.com/focus/f-news/4346170/posts",
    "timestamp": "2025-10-13T21:25:06Z"
  }
]