[
  {
    "title": "BREAKING: Trump Considering to Fire Kash Patel, Report Says",
    "description": "President Donald Trump is weighing whether or not to fire Kash Patel as the FBI director in the “coming months,’ reported MS NOW on Tuesday. The report cited “three people with knowledge of the situation who requested anonymity in order to speak freely.” Whit…",
    "link": "https://www.mediaite.com/media/news/breaking-trump-considering-to-fire-kash-patel-report-says/",
    "timestamp": "2025-11-25T19:25:59Z"
  },
  {
    "title": "University of Minnesota Offers 'Whiteness Pandemic' Resources for 'Antiracist' Parenting",
    "description": "The University of Minnesota is offering \"Whiteness Pandemic\" resources to caregivers as a way to \"re-educate\" themselves and guide children.\nThe post University of Minnesota Offers ‘Whiteness Pandemic’ Resources for ‘Antiracist’ Parenting appeared first on Br…",
    "link": "https://www.breitbart.com/education/2025/11/25/university-of-minnesota-offers-whiteness-pandemic-resources-for-antiracist-parenting/",
    "timestamp": "2025-11-25T19:25:30Z"
  },
  {
    "title": "U.S Government shutdown impact: Budget deficit jump to $284 billion. What does this mean for Americans?",
    "description": "Budget deficit last month was up $27 billion, or 10% higher, than the $257 billion deficit posted in October 2024, largely due to the shift of some $105 billion worth of November benefit outlays for some military and healthcare programs into October.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-government-shutdown-impact-budget-deficit-jump-to-284-billion-what-does-this-mean-for-americans/articleshow/125572907.cms",
    "timestamp": "2025-11-25T19:25:05Z"
  },
  {
    "title": "Russia says amended US peace plan must reflect 'spirit and letter' of Trump-Putin summit in Alaska",
    "description": "Speaking at a news conference in Moscow, Lavrov said Russia had welcomed an initial version of a U.S. peace plan for Ukraine - which Kyiv and its allies deemed too favourable for Moscow - but was waiting for an amended \"interim\" version after Washington had f…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-says-amended-us-peace-plan-must-reflect-spirit-and-letter-of-trump-putin-summit-in-alaska/articleshow/125573028.cms",
    "timestamp": "2025-11-25T19:24:24Z"
  },
  {
    "title": "Trump said to be weighing firing FBI Director Patel",
    "description": "United States President Donald Trump is weighing removing Kash Patel as FBI director in the coming months, MS NOW reported on Tuesday, citing sources familiar with the discussions.More to come......",
    "link": "https://biztoc.com/x/0ba94ae15f6e6586",
    "timestamp": "2025-11-25T19:22:57Z"
  },
  {
    "title": "Rush Hour 4 Greenlit at Paramount Following Donald Trump Push",
    "description": "Paramount to release “Rush Hour 4” after a Trump push, distributing Brett Ratner’s sequel as Jackie Chan and Chris Tucker return.",
    "link": "https://biztoc.com/x/483578dcc3a53fc0",
    "timestamp": "2025-11-25T19:22:51Z"
  },
  {
    "title": "Trump says 'close' to Ukraine war deal, but Europeans cautious",
    "description": "WASHINGTON: US President Donald Trump said on Tuesday (Nov 25) that a deal to end the Ukraine war was “very close”, even as European leaders urged caution and Russian missiles struck Kyiv during t",
    "link": "https://www.channelnewsasia.com/world/trump-says-close-ukraine-war-deal-europeans-cautious-5490056",
    "timestamp": "2025-11-25T19:22:30Z"
  },
  {
    "title": "All 24 kidnapped Nigerian schoolgirls rescued after armed attack in Kebbi, president says",
    "description": "All 24 schoolgirls kidnapped from Nigeria's Kebbi state have been rescued, President Tinubu announced, calling for increased security in vulnerable areas.",
    "link": "https://www.foxnews.com/world/all-24-kidnapped-nigerian-schoolgirls-rescued-after-armed-attack-kebbi-president",
    "timestamp": "2025-11-25T19:22:22Z"
  },
  {
    "title": "Rep Maxine Waters Describes Trump Perfectly",
    "description": "California Democratic Rep. Maxine Waters (D-Calif.) took a minute during a Democratic hearing on the Trump administration's immigration raids to offer a perfect description of our clearly mentally unstable, morally bankrupt president. \n\"This is an important p…",
    "link": "https://crooksandliars.com/2025/11/rep-maxine-waters-describes-trump",
    "timestamp": "2025-11-25T19:21:57Z"
  },
  {
    "title": "Pete Hegseth's Hissy Fit At Mark Kelly Is Ridiculous",
    "description": "The Department of Defense has appeased Donald Trump and opened up a review of alleged misconduct against Democratic Sen. Mark Kelly, which could lead to a court martial for taking part in a video telling the military they don't have to follow unlawful orders.…",
    "link": "https://crooksandliars.com/2025/11/pete-hegseth-threatens-court-martial-sen",
    "timestamp": "2025-11-25T19:21:27Z"
  },
  {
    "title": "Poll Shows Cornyn [RINO-TX] Slipping to Third in GOP Senate Primary",
    "description": "A new poll of likely Republican primary voters shows U.S. Sen. John Cornyn’s support continuing to decline ahead of the 2026 Texas GOP primary, with Cornyn now falling into third place in a three-way matchup. The poll, conducted November 21–22 by Stratus Inte…",
    "link": "https://freerepublic.com/focus/f-news/4354563/posts",
    "timestamp": "2025-11-25T19:20:10Z"
  },
  {
    "title": "Who is Kirill Dmitriev, the Russian envoy who helped craft the Ukraine peace proposal?",
    "description": "Kirill Dmitriev has emerged as a key player in drafting a new proposal to end Moscow’s war in Ukraine.",
    "link": "https://www.pbs.org/newshour/world/who-is-kirill-dmitriev-the-russian-envoy-who-helped-craft-the-ukraine-peace-proposal",
    "timestamp": "2025-11-25T19:19:14Z"
  },
  {
    "title": "50 Cent Helped Make a New Netflix Doc About His Longtime Nemesis Sean Combs",
    "description": "Netflix has announced a premiere date for 'Sean Combs: The Reckoning,' a new documentary produced by 50 Cent and directed by Alexandria Stapleton.",
    "link": "http://www.rollingstone.com/music/music-news/50-cent-sean-combs-documentary-the-reckoning-netflix-1235472761/",
    "timestamp": "2025-11-25T19:18:46Z"
  },
  {
    "title": "'We're in a pivotal place' - Tennessee voters on Trump's performance",
    "description": "The last congressional election of the year is taking place in the state's 7th District, where Trump won by 22% in the 2024 election.",
    "link": "https://www.bbc.com/news/videos/cjrj49981gyo",
    "timestamp": "2025-11-25T19:17:04Z"
  },
  {
    "title": "Report: The FBI Has the 'Seditious Six' in Its Sights, Is Pursuing Interviews with Each Lawmaker",
    "description": "The FBI has reportedly contacted the Capitol Police to schedule interviews with the \"Seditious Six\" members of Congress appearing in a video.",
    "link": "https://www.westernjournal.com/report-fbi-seditious-six-sights-pursuing-interviews-lawmaker/",
    "timestamp": "2025-11-25T19:17:04Z"
  },
  {
    "title": "Trump’s Healthcare Plan Is Just a Mirage",
    "description": "Trump’s health-care plan is still just a mirage. A plan to fix Obamacare subsidies seemed imminent but is now on hold. Did Johnson kill it, or was it always a just a feint?",
    "link": "http://nymag.com/intelligencer/article/trumps-healthcare-plan-is-still-just-a-mirage.html",
    "timestamp": "2025-11-25T19:15:55Z"
  },
  {
    "title": "Despite Trump’s best efforts to reshore manufacturing, blue-collar employment is plunging for the first time since the pandemic with 59,000 lost jobs",
    "description": "Back in April, President Donald Trump touted his aggressive tariff policy as a catalyst for the reshoring of manufacturing jobs. Eight months later, reshoring progress is nowhere to be seen.\nThe jobs report from the Bureau of Labor Statistics released last we…",
    "link": "https://biztoc.com/x/4b32588ed5bd9805",
    "timestamp": "2025-11-25T19:11:53Z"
  },
  {
    "title": "At Turkey Pardon, Trump Predicts Imminent Ukraine Peace Deal",
    "description": "President Donald Trump kept the Thanksgiving tradition alive Tuesday, pardoning two turkeys — Gobble and Waddle — during a Rose Garden ceremony that quickly shifted into politics and foreign policy. \nTrump said a U.S.-brokered peace deal between Ukraine and R…",
    "link": "https://biztoc.com/x/c9cf46962bf3ba86",
    "timestamp": "2025-11-25T19:11:41Z"
  },
  {
    "title": "Dozens of state attorneys general urge US Congress not to block AI laws",
    "description": "Republican and Democratic attorneys general from 35 states and the District of Columbia urged congressional leaders on Tuesday not to block state laws governing artificial intelligence, warning of \"disastrous consequences\" if the technology is left unregulate…",
    "link": "https://www.channelnewsasia.com/business/dozens-state-attorneys-general-urge-us-congress-not-block-ai-laws-5490051",
    "timestamp": "2025-11-25T19:10:26Z"
  },
  {
    "title": "Republican Talks Of 'Military Oath' That Doesn't Exist",
    "description": "Donald Trump opened the floodgates for his sycophants, losing every one of his shits after six Democratic veterans released a video reminding military members that they do not have to follow \"illegal orders.\" In fact, it's a military member's duty to refuse a…",
    "link": "https://crooksandliars.com/2025/11/republican-talks-oath-military-members",
    "timestamp": "2025-11-25T19:10:01Z"
  },
  {
    "title": "US envoy urges Sudan rivals to accept ceasefire plan",
    "description": "Washington has been stepping up diplomatic pressure as its regional partners attempt to push Sudan's warring commanders toward a humanitarian truce after two years of conflict.",
    "link": "https://www.dw.com/en/us-envoy-urges-sudan-rivals-to-accept-ceasefire-plan/a-74895217",
    "timestamp": "2025-11-25T19:10:00Z"
  },
  {
    "title": "‘This is truly insane’: Trump stuns with eye-popping multi-million-dollar purchase",
    "description": "Buried within a mountain of financial disclosures made public recently is a potentially multi-million-dollar purchase made by President Donald Trump between August and October, a purchase that has left some critics stunned by its lack of news coverage.“In a n…",
    "link": "https://www.rawstory.com/trump-2674341799/",
    "timestamp": "2025-11-25T19:09:28Z"
  },
  {
    "title": "'Two Weeks Forever': Trump's 2020 Healthcare Promise Resurfaces As White House Delays New Proposal",
    "description": "A resurfaced 2020 video of Donald Trump promising a health-care plan 'in two weeks' has gone viral as the White House delays unveiling a new proposal to address rising Obamacare premiums.",
    "link": "https://www.ibtimes.com/two-weeks-forever-trumps-2020-healthcare-promise-resurfaces-white-house-delays-new-proposal-3791229",
    "timestamp": "2025-11-25T19:08:56Z"
  },
  {
    "title": "Jimmy Kimmel Embraces Marjorie Taylor Greene: ‘Welcome to Reality, Marj. Make Yourself at Home’",
    "description": "Left-wing late-night TV comedian Jimmy Kimmel is thrilled to welcome soon-to-be former Representative Marjorie Taylor Greene (R-GA) into the fold of rabid Trump haters.\nThe post Jimmy Kimmel Embraces Marjorie Taylor Greene: ‘Welcome to Reality, Marj. Make You…",
    "link": "https://www.breitbart.com/entertainment/2025/11/25/jimmy-kimmel-embraces-marjorie-taylor-greene-welcome-to-reality-marj-make-yourself-at-home/",
    "timestamp": "2025-11-25T19:08:50Z"
  },
  {
    "title": "North Carolina Turkeys, Gobble and Waddle, Pardoned by President Trump",
    "description": "National Turkey Federation Celebrates 78-year Tradition of National Thanksgiving Turkey Presentation National Turkey Federation Celebrates 78-year Tradition of National Thanksgiving Turkey Presentation",
    "link": "https://www.globenewswire.com/news-release/2025/11/25/3194666/0/en/North-Carolina-Turkeys-Gobble-and-Waddle-Pardoned-by-President-Trump.html",
    "timestamp": "2025-11-25T19:08:00Z"
  },
  {
    "title": "‘Just enough to spend, not enough to splurge’: The low-hire labor market bites for Gen Z and lower-income Americans, JPMorgan finds",
    "description": "Workers aged 50-54 are experiencing negative real income growth, year-over-year, so reality bites for Gen Xers in the 2025 economy, too.",
    "link": "https://fortune.com/2025/11/25/gen-z-holiday-season-economy-affordability-just-enough-to-spend-not-splurge-jpmorgan/",
    "timestamp": "2025-11-25T19:04:44Z"
  },
  {
    "title": "Kate Beckinsale Leads Jimmy Kimmel On A Trump Tangent, And It’s Kinda Weird",
    "description": "The host and the “Underworld” star went with the Trump flow.",
    "link": "https://www.huffpost.com/entry/kate-beckinsale-spanking-trump-bubba-jimmy-kimmel_n_6925e0f0e4b0774c10d4891e",
    "timestamp": "2025-11-25T19:03:23Z"
  },
  {
    "title": "Trump pardons turkeys Gobble and Waddle in annual tradition",
    "description": "The annual turkey pardoning is a favorite tradition at the White House.",
    "link": "https://www.cbsnews.com/news/trump-turkey-pardon-gobble-waddle/",
    "timestamp": "2025-11-25T19:01:57Z"
  },
  {
    "title": "FBI Interviewing ‘Seditious 6’ Democratic Lawmakers Who Urged Military to ‘Refuse Illegal Orders’ From Trump",
    "description": "The FBI will be interviewing the 6 Democratic lawmakers who said military members must “refuse illegal orders\" — a plea President Trump ripped as \"SEDITIOUS\"\nThe post FBI Interviewing ‘Seditious 6’ Democratic Lawmakers Who Urged Military to ‘Refuse Illegal Or…",
    "link": "https://www.mediaite.com/politics/fbi-interviewing-seditious-6-democratic-lawmakers-who-urged-military-to-refuse-illegal-orders-from-trump/",
    "timestamp": "2025-11-25T19:01:20Z"
  },
  {
    "title": "Donald Trump Shades Chuck Schumer & Nancy Pelosi While Pardoning Turkeys",
    "description": "Donald Trump never misses an opportunity to talk smack about his political rivals ... he went after Chuck Schumer and Nancy Pelosi while pardoning a pair of turkeys at the White House Tuesday. The president was addressing the crowd at the event…\n Permalink",
    "link": "https://www.tmz.com/2025/11/25/donald-trump-insults-turkey-pardon/",
    "timestamp": "2025-11-25T19:01:18Z"
  },
  {
    "title": "John Bolton thinks America is past “peak Trump”",
    "description": "Donald Trump’s former national security adviser speaks to The Economist",
    "link": "https://biztoc.com/x/bf331237699e14c4",
    "timestamp": "2025-11-25T19:01:07Z"
  },
  {
    "title": "Hamas Victims Sue Binance And CZ — Accusations Of Terror Financing Rock Crypto World",
    "description": "Based on reports, victims of the October 7 attacks in Israel have filed a federal lawsuit against Binance and its founder, Changpeng “CZ” Zhao, claiming the exchange allowed large crypto flows to militant groups. Related Reading: Bitcoin Creator Somehow Becom…",
    "link": "http://www.newsbtc.com/binance/hamas-victims-sue-binance-and-cz-accusations-of-terror-financing-rock-crypto-world/",
    "timestamp": "2025-11-25T19:00:55Z"
  },
  {
    "title": "Trump approval drops to a new low for his second term",
    "description": "Donald Trump has hit a new low in job approval for his second term, with women and older Americans hitting new record levels of disapproval in the November 21 - 24, 2025 Economist / YouGov Poll",
    "link": "https://biztoc.com/x/7cfe66273179f0b2",
    "timestamp": "2025-11-25T19:00:50Z"
  },
  {
    "title": "Japanese PM Takaichi says Trump called her after he spoke with China’s leader",
    "description": "Japan's Prime Minister Sanae Takaichi says she has spoken with U.S. President Donald Trump right after he spoke with China, which was angered by her recent comments about Taiwan.",
    "link": "https://biztoc.com/x/94339377be9ee5a3",
    "timestamp": "2025-11-25T19:00:46Z"
  },
  {
    "title": "EXCLUSIVE: Heritage Foundation Offers Drastic Reforms To H1-B Visas As Trump Defends Program",
    "description": "The Heritage Foundation is weighing in on the H1-B debate, calling for Congress and the administration to drastically reform the policy.",
    "link": "https://dailycaller.com/2025/11/25/heritage-foundation-h1-b-visas-donald-trump-immigration/",
    "timestamp": "2025-11-25T19:00:07Z"
  },
  {
    "title": "Taryn Manning, 46, Dances Around Topless as Troubled Actress Rants About Taxes and Not Trusting Trump in Alarming Video",
    "description": "The former Netflix star flashed her chest while complaining about paying taxes and how she no longer trusts Donald Trump.",
    "link": "https://radaronline.com/p/taryn-manning-topless-taxes-not-trusting-trump-video/",
    "timestamp": "2025-11-25T19:00:00Z"
  },
  {
    "title": "Despite Trump’s best efforts to reshore manufacturing, blue-collar employment is plunging for the first time since the pandemic with 59,000 lost jobs",
    "description": "\"It is striking how soft manufacturing has been because in theory, you put tariffs in place to protect domestic manufacturing…and we have seen the opposite of that,” one economist said.",
    "link": "https://fortune.com/2025/11/25/jobs-report-manufacturing-reshoring-tariffs-factor-job-loss/",
    "timestamp": "2025-11-25T18:59:51Z"
  },
  {
    "title": "BBC to Lay Off Staff in $130 Million Cost-Savings Effort, AI Pivot: ‘We Need to Continuously Transform’",
    "description": "“Our goal is to be a creative and tech leader in an AI-driven world,” COO Leigh Tavaziva says\nThe post BBC to Lay Off Staff in $130 Million Cost-Savings Effort, AI Pivot: ‘We Need to Continuously Transform’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bbc-layoffs-coo-memo/",
    "timestamp": "2025-11-25T18:58:07Z"
  },
  {
    "title": "Consumer confidence slips as Americans grow wary of high costs and labor market",
    "description": "Consumers were much less confident in the economy in November in the aftermath of the government shutdown and amid weak hiring and stubborn inflation.",
    "link": "https://www.pbs.org/newshour/economy/consumer-confidence-slips-as-americans-grow-wary-of-high-costs-and-labor-market",
    "timestamp": "2025-11-25T18:57:15Z"
  },
  {
    "title": "Trump Includes 2024 Turkeys in Pardon, Jokes Biden Used 'Autopen' in 'Invalid' Pardons",
    "description": "President Donald Trump pardoned four turkeys on Tuesday at the White House, joking that former President Joe Biden used an autopen in the 2024 pardons, rendering them invalid.\nThe post Trump Includes 2024 Turkeys in Pardon, Jokes Biden Used ‘Autopen’ in ‘Inva…",
    "link": "https://www.breitbart.com/politics/2025/11/25/trump-includes-2024-turkeys-pardon-jokes-biden-used-autopen-invalid-pardons/",
    "timestamp": "2025-11-25T18:55:23Z"
  },
  {
    "title": "How the European Union looks to counter China in Africa",
    "description": "European and African leaders are holding negotiations in Angola on raw materials, security and the Global Gateway initiative. How can the EU compete with China on the continent?",
    "link": "https://www.dw.com/en/eu-african-union-summit-angola-critical-minerals-security-belt-and-road-global-gateway-initiative/a-74888365",
    "timestamp": "2025-11-25T18:55:00Z"
  },
  {
    "title": "Polymarket wins regulatory approval to operate US trading platform",
    "description": "Regulatory approval from the CFTC was obtained five months after US authorities reportedly concluded their investigation into Polymarket over US-based users.",
    "link": "https://cointelegraph.com/news/us-cftc-regulatory-approval-polymarket",
    "timestamp": "2025-11-25T18:54:52Z"
  },
  {
    "title": "Prices increase as Americans prepare for Thanksgiving",
    "description": "Despite White House claims, prices on key staples are on the rise, including cranberry sauce and potatoes.",
    "link": "https://www.aljazeera.com/economy/2025/11/25/prices-increase-as-americans-prepare-for-thanksgiving",
    "timestamp": "2025-11-25T18:53:28Z"
  },
  {
    "title": "Bolsonaro exhausts appeals, to serve 27-year sentence",
    "description": "Brazil's Supreme Court has ruled that former president Jair Bolsonaro's coup conviction was final, with no more appeals allowed, clearing the way for him to begin serving a 27-year sentence.",
    "link": "https://www.rte.ie/news/world/2025/1125/1545829-bolsonaro-court/",
    "timestamp": "2025-11-25T18:52:28Z"
  },
  {
    "title": "Latest Trump reversal puts GOP in 'no-win position'",
    "description": "After more than a decade of opposing Obamacare’s healthcare subsidies, President Donald Trump is now considering proposing a two-year extension of the soon-to-expire tax credits.The Hill reports his sudden reversal is putting Republicans in a bind and setting…",
    "link": "https://www.rawstory.com/alternet-posts/trump-healthcare-2674340809/",
    "timestamp": "2025-11-25T18:51:21Z"
  },
  {
    "title": "Trump pardons Thanksgiving turkeys Gobble and Waddle",
    "description": "US President Donald Trump pardons turkeys Gobble and Waddle at the White House ahead of the Thanksgiving holiday\nhttps://www.bloomberg.com/news/newsletters/2025-11-21/is-trump-cutting-cost-of-thanksgiving-it-depends-who-you-ask\n----------\nLike this video? Sub…",
    "link": "https://biztoc.com/x/c2fa680b8b06918d",
    "timestamp": "2025-11-25T18:49:53Z"
  },
  {
    "title": "Trump Pardons Turkeys, Nursing Home Fraudster And Crudely Attacks Illinois Gov.",
    "description": "The president is really in the spirit of Thanksgiving.",
    "link": "https://www.huffpost.com/entry/trump-turkey-pardon-gov-pritzker_n_6925e815e4b0774c10d49058",
    "timestamp": "2025-11-25T18:49:47Z"
  },
  {
    "title": "Who is Kevin Hassett? The frontrunner for Trump's next fed Chair, reports say",
    "description": "White House economic adviser Kevin Hassett is emerging as the leading candidate for the next U.S. Federal Reserve chair. Sources suggest President Trump sees Hassett as a close ally who would align with his views on lowering interest rates. The White House ha…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-kevin-hassett-the-frontrunner-for-trumps-next-fed-chair-reports-say/articleshow/125571302.cms",
    "timestamp": "2025-11-25T18:49:44Z"
  },
  {
    "title": "Kirill Dmitriev: From investment banker to a key player in crafting the Ukraine peace proposal",
    "description": "Kirill Dmitriev: From investment banker to a key player in crafting the Ukraine peace proposalwftv.com",
    "link": "https://www.wftv.com/news/world/look-kirill-dmitriev/EM23BTEQGM4L5GDKUPLYXK236I/",
    "timestamp": "2025-11-25T18:49:32Z"
  },
  {
    "title": "The Democrats’ reckless call for military disobedience",
    "description": "Elected Democrats have every right, indeed, they have a duty, to conduct oversight over the president’s use of the military to defend the nation. But what they may not do is encourage service members to disobey orders they don’t like, and that is what Sens. E…",
    "link": "https://freerepublic.com/focus/f-news/4354548/posts",
    "timestamp": "2025-11-25T18:49:09Z"
  },
  {
    "title": "Japanese PM Takaichi says Trump called her after he spoke with China’s leader",
    "description": "Japan's Prime Minister Sanae Takaichi says she has spoken with U.S. President Donald Trump right after he spoke with China, which was angered by her recent comments about Taiwan.",
    "link": "https://www.pbs.org/newshour/world/japanese-pm-takaichi-says-trump-called-her-after-he-spoke-with-chinas-leader",
    "timestamp": "2025-11-25T18:48:35Z"
  },
  {
    "title": "Erika Kirk 8 Weeks Pregnant Rumor",
    "description": "Erika Kirk 8 Weeks Pregnant Rumor refers to online rumors that Erika Kirk, the widow of Charlie Kirk, was eight to nine weeks pregnant about 10 to 11 weeks after Charlie Kirk's death, implying that she is pregnant with somebody else's baby. The rumor came sho…",
    "link": "https://knowyourmeme.com/memes/events/erika-kirk-8-weeks-pregnant-rumor",
    "timestamp": "2025-11-25T18:48:15Z"
  },
  {
    "title": "Mike Huckabee Peddling Sleep Supplements While Serving as Ambassador to Israel...",
    "description": "Mike Huckabee Peddling Sleep Supplements While Serving as Ambassador to Israel...\r\n\n \n \n \n (Third column, 3rd story, link)",
    "link": "https://www.notus.org/money/mike-huckabee-relaxium-supplement-israel",
    "timestamp": "2025-11-25T18:46:38Z"
  },
  {
    "title": "It’s not just Marjorie Taylor Greene: The Republicans considering quitting over Trump",
    "description": "Congressional Republicans are considering quitting their jobs ahead of the 2026 midterm elections amid frustration with the White House.",
    "link": "https://uk.news.yahoo.com/not-just-marjorie-taylor-greene-184524920.html",
    "timestamp": "2025-11-25T18:45:24Z"
  },
  {
    "title": "24 schoolgirls abducted from Kebbi in Nigeria have been rescued, president says",
    "description": "A total of 25 girls were abducted Nov. 17 from the Government Girls Comprehensive Secondary School in Kebbi state’s Maga town, but one of them was able to...",
    "link": "https://www.yahoo.com/news/articles/24-schoolgirls-abducted-kebbi-nigeria-184420958.html",
    "timestamp": "2025-11-25T18:44:20Z"
  },
  {
    "title": "Dismissal of Comey, James cases won’t be the final word. Here’s what the path ahead may look like",
    "description": "The Justice Department says it plans to immediately appeal the dismissals.",
    "link": "https://www.bostonherald.com/2025/11/25/comey-james-whats-next/",
    "timestamp": "2025-11-25T18:44:13Z"
  },
  {
    "title": "Joy Reid Wants You To Believe MAGA Is The Murderous ‘Cult’ Despite Trump And Charlie Kirk Shootings",
    "description": "Despite the recent shootings of Donald Trump and Charlie Kirk, Joy Reid argued that the Make America Great Again movement is the real murderous cult.",
    "link": "https://dailycaller.com/2025/11/25/joy-reid-maga-murderous-cult-despite-trump-charlie-kirk-shootings/",
    "timestamp": "2025-11-25T18:44:07Z"
  },
  {
    "title": "Trump pardons Thanksgiving turkeys, blasts Biden and says Ukraine peace deal is ‘very close’",
    "description": "Trump pardoned Thanksgiving turkeys at the White House, said a Ukraine peace deal may be getting close and attacked Biden over autopen as turkey prices rise.",
    "link": "https://www.cnbc.com/2025/11/25/trump-turkey-pardon-biden-ukraine-2025.html",
    "timestamp": "2025-11-25T18:43:41Z"
  },
  {
    "title": "L.A. Mayor Karen Bass Says You Can Defeat NIMBYism by Building Less",
    "description": "Plus: The DOJ and RealPage reach a settlement, the ROAD to Housing Act hits a speed bump, and Donald Trump and Zohran Mamdani talk housing policy.",
    "link": "https://reason.com/2025/11/25/l-a-mayor-karen-bass-says-you-can-defeat-nimbyism-by-building-less/",
    "timestamp": "2025-11-25T18:43:22Z"
  },
  {
    "title": "Trump Says He Believes Ukraine Peace Deal ‘Very Close’",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said Tuesday that he believes a Ukrainian peace deal is close to being agreed.",
    "link": "https://sputnikglobe.com/20251125/trump-says-he-believes-ukraine-peace-deal-very-close-1123171404.html",
    "timestamp": "2025-11-25T18:42:02Z"
  },
  {
    "title": "The United States Is Moving Through the Stages of Grief Over China’s Rise",
    "description": "The Trump-Xi agreement may be a sign the U.S. position is shifting.",
    "link": "http://foreignpolicy.com/2025/11/25/china-united-states-rise-hegemon/",
    "timestamp": "2025-11-25T18:41:19Z"
  },
  {
    "title": "Historian criticises BBC for removing Trump line from Radio 4 lecture",
    "description": "Rutger Bregman says he is \"genuinely dismayed\" after a line about the US president was edited out.",
    "link": "https://www.bbc.com/news/articles/cpvdzdnnp8xo",
    "timestamp": "2025-11-25T18:40:33Z"
  },
  {
    "title": "Donald Trump Comments on His Weight During Turkey Pardon",
    "description": "President Donald Trump said during a speech at the White House Turkey Pardon ceremony Tuesday that he'd like to lose some weight but was unlikely to during Thanksgiving.\nThe event, held at the White House and attended by members of the Trump family, administr…",
    "link": "https://biztoc.com/x/6f10d1feb4dbbda5",
    "timestamp": "2025-11-25T18:38:40Z"
  },
  {
    "title": "Hassett Emerges as Frontrunner to Be Next Fed Chair",
    "description": "White House National Economic Council Director Kevin Hassett is seen by advisers and allies of President Donald Trump as the ...",
    "link": "https://biztoc.com/x/632144478529119c",
    "timestamp": "2025-11-25T18:36:50Z"
  },
  {
    "title": "After Trump Pressure, Paramount Greenlights Rush Hour 4 with Brett Ratner: Report",
    "description": "Jackie Chan, 71, and Chris Tucker, 54, would return to star.\nAfter Trump Pressure, Paramount Greenlights Rush Hour 4 with Brett Ratner: Report\nWren Graves",
    "link": "https://consequence.net/2025/11/rush-hour-4-trump-paramount-brett-ratner/",
    "timestamp": "2025-11-25T18:36:02Z"
  },
  {
    "title": "It Turns Out Lindsey Halligan Was a Fake Prosecutor All Along",
    "description": "Can the president circumvent Congress and the judiciary to install partisan loyalists as prosecutors so they can charge his political adversaries for crimes they did not commit? On Monday, a court held that he cannot. The decision, by U.S. District Judge Came…",
    "link": "https://freerepublic.com/focus/f-news/4354542/posts",
    "timestamp": "2025-11-25T18:35:21Z"
  },
  {
    "title": "Trump’s Immigration Forces Deploy “Less Lethal” Weapons in Dangerous Ways, Skirting Rules and Maiming Protesters",
    "description": "Civil rights and weapons experts cite the consequences of federal agents’ use of crowd control weapons: religious leaders shot with pepper balls and noxious chemicals. A nurse nearly blinded by tear gas. Protestors trapped, struggling to breathe.",
    "link": "http://www.propublica.org/article/ice-border-patrol-less-lethal-weapons",
    "timestamp": "2025-11-25T18:35:00Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez Questions Donald Trump’s Mental Capacity",
    "description": "Congresswoman Alexandria Ocasio-Cortez is just like everyone else, wondering what in the world is up with Donald Trump’s mental state. AOC blasted the current occupant in the White House after he continually lied and called for six Democrats, Michigan Sen. El…",
    "link": "https://hiphopwired.com/2922784/alexandria-ocasio-cortez-questions-donald-trumps-mental-capacity/",
    "timestamp": "2025-11-25T18:34:31Z"
  },
  {
    "title": "Michigan GOP Launches Attack On Overseas Voters Before Midterm Elections",
    "description": "A new Republican lawsuit in the state acknowledges that overseas ballots tend to favor Democrats.",
    "link": "https://www.huffpost.com/entry/michigan-gop-launches-attack-on-overseas-voters-before-midterm-elections_n_6925d147e4b0774c10d478fb",
    "timestamp": "2025-11-25T18:34:29Z"
  },
  {
    "title": "DOGE Claims Reuters Report Of Its Closure Is “Fake News”",
    "description": "The Department of Government Efficiency has come out against a report by Reuters, in which the media outlet declared that the agency was no longer operational and said it \"doesn't exist.\" DOGE has rejected the report as \"fake news.\"",
    "link": "https://www.shtfplan.com/headline-news/doge-claims-reuters-report-of-its-closure-is-fake-news",
    "timestamp": "2025-11-25T18:30:19Z"
  },
  {
    "title": "It Looks Like Donald Trump Is Getting His Way as the Rush Hour Sequel From Brett Ratner Is Confirmed",
    "description": "It looks like Donald Trump is getting his way, as Rush Hour 4 is actually happening at Paramount with original director Brett Ratner involved.",
    "link": "https://www.ign.com/articles/it-looks-like-donald-trump-is-getting-his-way-as-the-rush-hour-sequel-from-brett-ratner-is-confirmed",
    "timestamp": "2025-11-25T18:29:51Z"
  },
  {
    "title": "'Vought Should Resign,' CFPB Workers Say of 'Pledge' to Be Nice to Wall Street Fraudsters",
    "description": "“Why is Russell Vought showing the world his weird, creepy pledge of allegiance to big corporations? Have some dignity, Russell.\"That's what Consumer Financial Protection Bureau Union member Alexis Goldstein said on Monday about the CFPB acting director's new…",
    "link": "https://www.commondreams.org/news/russell-vought-cfpb",
    "timestamp": "2025-11-25T18:29:45Z"
  },
  {
    "title": "The rise of resistance cinema in the era of Trump",
    "description": "Filmmakers the world over are stepping into the breach.",
    "link": "https://www.bostonherald.com/2025/11/25/resistance-cinema/",
    "timestamp": "2025-11-25T18:28:20Z"
  },
  {
    "title": "Binance sued by Oct. 7 victims' families for allegedly aiding Hamas through crypto exchange",
    "description": "President Donald Trump last month pardoned CZ, whom the White House said was a casualty of the Biden administration's \"war on cryptocurrency.\"",
    "link": "https://biztoc.com/x/29a95bda0198ba68",
    "timestamp": "2025-11-25T18:27:21Z"
  },
  {
    "title": "Trump Calls BS on His Own Administration During Wild Riff on Crime at Turkey Pardon",
    "description": "Trump cast doubt on his own administration's reporting as he went on a wild riff about crime during the annual White House Turkey Pardon ceremony.\nThe post Trump Calls BS on His Own Administration During Wild Riff on Crime at Turkey Pardon first appeared on M…",
    "link": "https://www.mediaite.com/media/news/trump-calls-bs-on-his-own-administration-during-wild-riff-on-crime-at-turkey-pardon/",
    "timestamp": "2025-11-25T18:26:50Z"
  },
  {
    "title": "Trump envoy denies bias as he pushes for Sudan peace plan",
    "description": "Efforts to negotiate an end to the war, which has displaced 12 million people, remain unfruitful.",
    "link": "https://www.bbc.com/news/articles/c1lrgr741z3o",
    "timestamp": "2025-11-25T18:26:34Z"
  },
  {
    "title": "France's Macron: working with EU countries on Ukraine financing solution",
    "description": "PARIS (Reuters) -France will finalise with other European Union countries a solution for providing financial support to Ukraine using frozen Russian assets, President Emmanuel Macron said on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/26/france039s-macron-working-with-eu-countries-on-ukraine-financing-solution",
    "timestamp": "2025-11-25T18:22:00Z"
  },
  {
    "title": "Binance sued by Oct. 7 victims' families for allegedly aiding Hamas through crypto exchange",
    "description": "President Donald Trump last month pardoned CZ, whom the White House said was a casualty of the Biden administration's \"war on cryptocurrency.\"",
    "link": "https://www.cnbc.com/2025/11/25/binance-trump-crypto-lawsuit-pardon.html",
    "timestamp": "2025-11-25T18:21:07Z"
  },
  {
    "title": "DOT walks back on promise of automatic reimbursements for flight delays and cancellations",
    "description": "The Department of Transportation has announced it will roll back widely lauded Biden-era plans to reimburse travelers for flight delays and cancellations automatically.",
    "link": "https://nypost.com/2025/11/25/lifestyle/dot-reverses-biden-era-auto-reimbursement-rule-for-delayed-travelers/",
    "timestamp": "2025-11-25T18:20:38Z"
  },
  {
    "title": "I Was Always in Favor of Releasing the Epstein Files, Even as I Was Desperately Trying to Prevent Their Release",
    "description": "“President Donald Trump on Wednesday sought to bring a swift end to perhaps the most damaging saga of his term, signing a measure compelling the release of the Epstein files after losing a monthslong, tooth-and-nail fight to prevent their disclosure.” – CNN -…",
    "link": "https://www.mcsweeneys.net/articles/i-was-always-in-favor-of-releasing-the-epstein-files-even-as-i-was-desperately-trying-to-prevent-their-release",
    "timestamp": "2025-11-25T18:20:00Z"
  },
  {
    "title": "'Punishment is the process': Expert calls Trump's bluff over attack on Dem senator",
    "description": "A former Bush administration official is calling the Trump administration out on its bluff to prosecute Sen. Mark Kelly (D-AZ) over comments he made urging service members to defy illegal orders, suggesting on Fox News Tuesday that the administration is well …",
    "link": "https://www.rawstory.com/mark-kelly-2674340918/",
    "timestamp": "2025-11-25T18:18:30Z"
  },
  {
    "title": "2026 World Cup draw can separate top-ranked Spain, Argentina, France and England until semifinals",
    "description": "The 2026 World Cup draw next week will reward the four highest-ranked teams — Spain, Argentina, France and England — who will be placed in separate sections of a new tennis-style seeded tournament bracket. FIFA said Tuesday the top four teams in the latest me…",
    "link": "https://sports.yahoo.com/articles/2026-world-cup-draw-separate-181758352.html",
    "timestamp": "2025-11-25T18:17:58Z"
  },
  {
    "title": "Trump pardons Thanksgiving turkeys Waddle and Gobble and jabs political rivals",
    "description": "Trump pardons Thanksgiving turkeys Waddle and Gobble and jabs political rivalsgo.com",
    "link": "https://abcnews.go.com/Politics/trump-pardons-thanksgiving-turkeys-waddle-gobble-jabs-political/story?id=127861187",
    "timestamp": "2025-11-25T18:16:41Z"
  },
  {
    "title": "The problem with Lindsey Halligans appointment was clear from the start",
    "description": "Monday’s dismissals of indictments against former FBI Director James Comey and New York Attorney General Letitia James represent a significant setback for President Donald Trump and his Justice Department. The dismissals are the direct result of Trump and Att…",
    "link": "https://biztoc.com/x/60a56e3d83537110",
    "timestamp": "2025-11-25T18:16:34Z"
  },
  {
    "title": "Twenty-nine ways that Canada has changed during Trump’s tariff-plagued second term",
    "description": "Prime Minister Mark Carney likes to call U.S. President Donald Trump “transformative.” One year after Mr. Trump first unleashed his threats of tariffs and territorial expansion, Canada has indeed been transformed.\nIt was a year ago this week when Mr. Trump th…",
    "link": "https://biztoc.com/x/b9dc59b208883043",
    "timestamp": "2025-11-25T18:16:21Z"
  },
  {
    "title": "Judge Tosses Conviction Of Somali Who Ripped Off Minnesota Taxpayers",
    "description": "A Hennepin County, Minnesota, judge set aside a jury’s guilty verdict in a $7.2 million Medicaid fraud case Monday, leaving jurors shocked.",
    "link": "https://dailycaller.com/2025/11/25/judge-tosses-conviction-of-somali-who-ripped-off-minnesota-taxpayers/",
    "timestamp": "2025-11-25T18:16:08Z"
  },
  {
    "title": "Some DACA recipients have been arrested in the Trump’s immigration crackdown",
    "description": "At least 20 cases have been documented.",
    "link": "https://www.bostonherald.com/2025/11/25/immigration-daca-arrests/",
    "timestamp": "2025-11-25T18:15:43Z"
  },
  {
    "title": "Some DACA recipients have been arrested in the Trump’s immigration crackdown",
    "description": "At least 20 cases have been documented.",
    "link": "https://www.denverpost.com/2025/11/25/immigration-daca-arrests/",
    "timestamp": "2025-11-25T18:15:43Z"
  },
  {
    "title": "WATCH: Trump reveals what he REALLY wanted to name pardoned turkeys",
    "description": "When I first saw their pictures I thought we should ... well, I shouldn't say this'",
    "link": "https://www.wnd.com/2025/11/watch-trump-reveals-what-he-really-wanted-name/",
    "timestamp": "2025-11-25T18:15:05Z"
  },
  {
    "title": "Ukrainians will eventually realize how West used them – Russia’s top senator",
    "description": "The Ukraine conflict is the West’s proxy war to inflict a strategic defeat on Russia, Federation Council chief Valentina Matviyenko has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/628381-ukraine-conflict-western-proxy-war-russia/",
    "timestamp": "2025-11-25T18:12:39Z"
  },
  {
    "title": "Trump jokes that Biden turkey pardon in 2024 'invalid' due to autopen",
    "description": "President Donald Trump joked that former President Joe Biden's pardons for last year's Thanksgiving turkeys are \"null and void\" due to autopen use.",
    "link": "https://www.foxnews.com/politics/trump-jokes-biden-turkey-pardon-2024-invalid-due-autopen",
    "timestamp": "2025-11-25T18:12:09Z"
  },
  {
    "title": "Cristiano Ronaldo Gets Probation, Won't Miss World Cup Opener For Red Card",
    "description": "Cristiano Ronaldo will likely avoid missing any Portugal games at the World Cup despite his red card in a game against Ireland earlier this month.",
    "link": "https://www.foxsports.com/stories/soccer/cristiano-ronaldo-set-to-avoid-ban-at-world-cup-after-fifa-redcard-verdict-offers-probation",
    "timestamp": "2025-11-25T18:10:54Z"
  },
  {
    "title": "Tim Cook In Attendance In White House Dinner for the Crown Prince of Saudi Arabia",
    "description": "Tim Cook, Apple CEO, was in attendance at the White House dinner arranged by Donald Trump for the Crown Prince of Saudi Arabia, Prince Mohammed bin Salman. The Prince visited the United States for the first time in October 2018 since the murder of the Washing…",
    "link": "https://www.ilounge.com/news/tim-cook-in-attendance-in-white-house-dinner-for-the-crown-prince-of-saudi-arabia",
    "timestamp": "2025-11-25T18:10:04Z"
  },
  {
    "title": "Trump Declares Biden’s ‘Autopen’ Turkey Pardons ‘Invalid’ at Thanksgiving Ceremony",
    "description": "President Trump declared Joe Biden's pardons for two turkeys last year were \"totally invalid\" because Biden used the autopen to sign their clemency papers.\nThe post Trump Declares Biden’s ‘Autopen’ Turkey Pardons ‘Invalid’ at Thanksgiving Ceremony first appea…",
    "link": "https://www.mediaite.com/politics/trump-declares-bidens-autopen-turkey-pardons-invalid-at-thanksgiving-ceremony/",
    "timestamp": "2025-11-25T18:10:03Z"
  }
]