[
  {
    "title": "The Fallout of Operation Midnight Hammer",
    "description": "How will President Trump’s decision to bomb Iran’s nuclear program affect the US position in the Middle East? What’s Next After the Strikes on Iran? (w/ Joshua Yaphe) On June 13, as US-Iran talks stalled, Israel began striking key military and scientific targ…",
    "link": "https://nationalinterest.org/blog/middle-east-watch/the-fallout-of-operation-midnight-hammer",
    "timestamp": "2025-06-30T17:53:44Z"
  },
  {
    "title": "Trump Forces Canada's Hand -- Digital Tax Killed to Save $440B Trade Lifeline",
    "description": "Canada caves under tariff threat, scraps tech tax as both nations race to salvage a critical trade deal by July",
    "link": "https://finance.yahoo.com/news/trump-forces-canadas-hand-digital-175338608.html",
    "timestamp": "2025-06-30T17:53:38Z"
  },
  {
    "title": "GameStop And Trump's Bitcoin Buys: What It Means For Future Institutional Crypto Adoption In 2025",
    "description": "What do GameStop and Trump's Bitcoin investments mean? Analyze their impact on future institutional crypto adoption and market trends.",
    "link": "https://www.forbes.com/sites/digital-assets/article/gamestop-trump-bitcoin-institutional-crypto-adoption/",
    "timestamp": "2025-06-30T17:53:35Z"
  },
  {
    "title": "Social Security and Medicare clocks tick to depletion",
    "description": "As President Donald Trump and Congress fumble through his One Big Beautiful Bill on the budget for fiscal year 2025-26, they have been ignoring the mastodon in the room: Social Security and Medicar…",
    "link": "https://www.presstelegram.com/2025/06/29/social-security-and-medicare-clocks-tick-to-depletion/",
    "timestamp": "2025-06-30T17:53:18Z"
  },
  {
    "title": "National pride is declining in America —and it’s splitting by party lines: Gallup poll",
    "description": "Only 36% of Democrats say they’re “extremely” or “very” proud to be American, according to a new Gallup poll, reflecting a dramatic decline in national pride that’s also clear among young people.…",
    "link": "https://nypost.com/2025/06/30/us-news/national-pride-is-declining-in-america-and-its-splitting-by-party-lines-poll/",
    "timestamp": "2025-06-30T17:51:30Z"
  },
  {
    "title": "European stocks retreat as markets await tariff deadline",
    "description": "Irish index of shares ends the day slightly higher",
    "link": "https://www.irishtimes.com/business/2025/06/30/european-stocks-retreat-as-markets-await-tariff-deadline/",
    "timestamp": "2025-06-30T17:50:26Z"
  },
  {
    "title": "Karoline Levitt Accuses Zohran Mamdani of ‘Peddling Anti-Semitism’ While Pitching Trump Spending Bill",
    "description": "Karoline Leavitt derailed a Trump bill presser to blast Zohran Mamdani as a \"communist\" who \"petals anti-semitism\" in a wild swing at the left.\nThe post Karoline Levitt Accuses Zohran Mamdani of ‘Peddling Anti-Semitism’ While Pitching Trump Spending Bill firs…",
    "link": "https://www.mediaite.com/politics/karoline-levitt-accuses-zohran-mamdani-of-peddling-anti-semitism-while-pitching-trump-spending-bill/",
    "timestamp": "2025-06-30T17:49:05Z"
  },
  {
    "title": "Billionaire Showdown again? Elon Musk could be Trump’s greatest political obstacle, insider claims",
    "description": "Philip Low, a neuroscientist and founder of NeuroVigil who was once part of Elon Musk’s close professional circle, has alleged that Musk is prepared to \"do everything possible to undermine the president.\"",
    "link": "https://economictimes.indiatimes.com/news/international/us/billionaire-showdown-again-elon-musk-could-be-trumps-greatest-political-obstacle-insider-claims/articleshow/122166046.cms",
    "timestamp": "2025-06-30T17:48:14Z"
  },
  {
    "title": "Health care, food cuts won’t only hurt Ohio’s poor, but the entire economy, study says - NewsBreak",
    "description": "President Donald Trump’s One Big Beautiful Bill Act is being sold on promises that it will save Ohioans money. But its safety-net cuts will cost Ohio and o",
    "link": "https://www.newsbreak.com/share/4081874358486-health-care-food-cuts-won-t-only-hurt-ohio-s-poor-but-the-entire-economy-study-says?s=a2&amp;share_destination_id=MjM5OTg1MTY1LTE3NTEzMDU2NjU0ODM%3D&amp;pd=0GEx6TJG&amp;hl=en_US&amp;send_time=1751305665&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v4%2Cns_foryou_model_exp_25q2_v2-v8",
    "timestamp": "2025-06-30T17:48:14Z"
  },
  {
    "title": "A theory of Republicans' hatred of America",
    "description": "I suppose if one wished to be philosophical about Republicans' orgiastic debauchery imbued in the appalling Bigass Ugliest Bill Ever, now sliming its way through the Reichstagsbegäude's Senate chamber, one could write off the whole hideous scene as determinis…",
    "link": "https://www.pmcarpenter.com/post/a-theory-of-republicans-hatred-of-america",
    "timestamp": "2025-06-30T17:48:07Z"
  },
  {
    "title": "Trump demands 1% interest rates, blasts Fed chair Jerome 'Too Late' Powell for ‘costing trillions’",
    "description": "Donald Trump has strongly criticized Federal Reserve Chairman Jerome Powell and the Fed Board, accusing them of mismanagement and costing the U.S. trillions in interest. Trump believes the Fed's inaction and high interest rates are detrimental to the country'…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-demands-1-interest-rates-blasts-fed-chair-jerome-too-late-powell-for-costing-trillions/articleshow/122166035.cms",
    "timestamp": "2025-06-30T17:47:54Z"
  },
  {
    "title": "Trump, administration 'geniuses' for doing at least 1 crucial thing, USWNT legend Abby Wambach says",
    "description": "U.S. women's soccer legend Abby Wambach broke down her thoughts and feelings on President Donald Trump and his administration with Nicolle Wallace.",
    "link": "https://www.foxnews.com/sports/trump-administration-geniuses-doing-least-1-crucial-thing-uswnt-legend-abby-wambach-says",
    "timestamp": "2025-06-30T17:47:43Z"
  },
  {
    "title": "Suspected shooter in Idaho firefighter ambush identified",
    "description": "The alleged sniper who killed two firefighters and wounded a third in an ambush-styled attack in Idaho has been identified as Wess Roley. The Associated Pressd reported, citing a law enforcement official, that Roley deliberately set a brush fire on Canfield M…",
    "link": "https://freerepublic.com/focus/f-news/4326129/posts",
    "timestamp": "2025-06-30T17:47:00Z"
  },
  {
    "title": "Trump Unveils 'Temporary Pass' Plan for Tax-Paying Immigrant Workers, Gives Power to America's Farmers",
    "description": "President Donald Trump is reportedly working on a \"temporary pass\" program that would allow tax-paying illegal immigrant workers, particularly those employed on farms and in the hospitality industry, to remain in the U.S. legally for work purposes, even if th…",
    "link": "https://freerepublic.com/focus/f-news/4326128/posts",
    "timestamp": "2025-06-30T17:46:40Z"
  },
  {
    "title": "At least 58 killed as Israel intensifies offensive in Gaza",
    "description": "Despite hopes of a ceasefire between Israel and Hamas, the Israeli Defense Force stepped up its latest offensive in the Palestinian enclave on Monday.",
    "link": "https://www.abc.net.au/news/2025-07-01/israeli-bombardment-in-gaza-kills-58-people-in-one-day/105479464",
    "timestamp": "2025-06-30T17:46:27Z"
  },
  {
    "title": "Trump to visit ‘Alligator Alcatraz’ immigration detention facility in Florida Everglades",
    "description": "President Donald Trump is planning to visit a new immigration detention facility in the Florida Everglades, according to Gov. Ron DeSantis.",
    "link": "https://www.pbs.org/newshour/nation/trump-to-visit-alligator-alcatraz-immigration-detention-facility-in-florida-everglades",
    "timestamp": "2025-06-30T17:46:24Z"
  },
  {
    "title": "A Georgia town that solidly backed Trump could fall victim to his tax bill's green energy cuts",
    "description": "No state may have more to lose than Georgia as Republicans in Congress look to gut federal subsidies that aid both the solar and electric vehicle industries.",
    "link": "https://www.wsls.com/news/politics/2025/06/30/a-georgia-town-that-solidly-backed-trump-could-fall-victim-to-his-tax-bills-green-energy-cuts/",
    "timestamp": "2025-06-30T17:46:17Z"
  },
  {
    "title": "This summer will be decisive for the economy and Wall Street",
    "description": "More fiscal sticker shock could send Treasury yields higher and add more pressure on the dollar, which is already down 10% this year, its worst first-half performance in more than 50 years.",
    "link": "https://fortune.com/2025/06/30/economic-outlook-stock-market-forecast-summer-data-trade-war-trump-tariffs-inflation/",
    "timestamp": "2025-06-30T17:45:21Z"
  },
  {
    "title": "Todd and Julie Chrisley break silence on Trump pardon in first interview since release from prison",
    "description": "Reality TV stars Todd and Julie Chrisley thank President Trump after receiving full pardons from fraud convictions, sharing their family's reaction on \"My View with Lara Trump.\"",
    "link": "https://www.foxnews.com/media/todd-julie-chrisley-break-silence-trump-pardon-first-interview-since-release-from-prison",
    "timestamp": "2025-06-30T17:44:15Z"
  },
  {
    "title": "Senate races toward final vote on Trump's megabill after weekend of debate, drama",
    "description": "The Senate is plowing ahead toward a final vote on President Trump's sweeping tax and immigration bill, as Republicans rush to get it across the finish line by July 4.",
    "link": "https://abcnews.go.com/Politics/senate-races-final-vote-trumps-megabill-after-weekend/story?id=123336634",
    "timestamp": "2025-06-30T17:41:34Z"
  },
  {
    "title": "Trump administration sues Los Angeles over sanctuary policies that 'impede' ICE operations",
    "description": "The Trump administration sues Los Angeles over sanctuary policies after protests in riots in the city earlier this month against federal immigration authorities.",
    "link": "https://www.foxnews.com/politics/trump-administration-sues-los-angeles-over-sanctuary-policies-impede-ice-operations",
    "timestamp": "2025-06-30T17:40:22Z"
  },
  {
    "title": "Who wins and loses in Republicans' 'big, beautiful bill'",
    "description": "The \"big beautiful bill\" gives big tax breaks to businesses and the wealthy, paid for partly by cutting health coverage for lower-income households.",
    "link": "https://www.nbcnews.com/politics/congress/republican-big-beautiful-bill-win-loses-rcna215910",
    "timestamp": "2025-06-30T17:40:02Z"
  },
  {
    "title": "Ron DeSantis Defends Alligator Alcatraz: Trump to Visit and Is 'Excited' About It",
    "description": "Florida Gov. Ron DeSantis (R) defended \"Alligator Alcatraz\" during a press conference this week.\nThe post Ron DeSantis Defends Alligator Alcatraz: Trump to Visit and Is ‘Excited’ About It appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/30/ron-desantis-defends-alligator-alcatraz-trump-to-visit-is-excited-about-it/",
    "timestamp": "2025-06-30T17:39:34Z"
  },
  {
    "title": "Key House GOP moderate Don Bacon won't seek re-election",
    "description": "A House GOP centrist from a key battleground district, Rep. Don Bacon, R-Neb., announced Monday that he will not seek re-election next year. Bacon's announcement comes as Congress works overtime to pass President Donald Trump's \"big, beautiful bill\" by their …",
    "link": "https://freerepublic.com/focus/f-news/4326124/posts",
    "timestamp": "2025-06-30T17:37:49Z"
  },
  {
    "title": "White House says Trump wrote Powell to urge lower rates",
    "description": "U.S. President Donald Trump wrote Fed Chair Jerome Powell urging him to lower interest rates, White House press secretary Karoline Leavitt told reporters on ...",
    "link": "https://finance.yahoo.com/news/white-house-says-trump-wrote-173748534.html",
    "timestamp": "2025-06-30T17:37:48Z"
  },
  {
    "title": "Trump’s fight to keep non-citizens off voter rolls reignites in second term",
    "description": "Part one of President Donald Trump's battle to keep illegal aliens off voter rolls began near the end of his first term and will likely come hurtling back in the near future. The Supreme Court has never made a determination on the legal merits of the argument…",
    "link": "https://freerepublic.com/focus/f-news/4326123/posts",
    "timestamp": "2025-06-30T17:37:47Z"
  },
  {
    "title": "Iranian Cleric Issues Fatwa Against Trump, Netanyahu After Ceasefire",
    "description": "Grand Ayatollah Naser Makarem Shirazi issued a fatwa Sunday urging Muslims to seek retribution against U.S. President Donald Trump and Israeli Prime Minister Benjamin Netanyahu, labeling them \"enemies of God\" for threatening Iran's leadership. \nThe decree fol…",
    "link": "https://biztoc.com/x/de6ba61b96377819",
    "timestamp": "2025-06-30T17:35:09Z"
  },
  {
    "title": "Chrisley Family Speaks Out After Donald Trump Pardon: “God Touched President Trump’s Heart”",
    "description": "They also revealed their plans of returning to reality television.",
    "link": "https://decider.com/2025/06/30/chrisley-family-donald-trump-pardon-god-president/",
    "timestamp": "2025-06-30T17:35:06Z"
  },
  {
    "title": "Trump takes aim at central bank chair again and says he 'should be ashamed'",
    "description": "Donald Trump has launched his latest attack on the US central bank, saying the interest rate setters had \"failed\".",
    "link": "https://news.sky.com/story/trump-takes-aim-at-fed-chair-jerome-powell-again-and-says-he-should-be-ashamed-13390649",
    "timestamp": "2025-06-30T17:33:00Z"
  },
  {
    "title": "Canada cancelled its digital services tax. What was it and why did the US hate it?",
    "description": "Tech giants such as Amazon and Google will not have to shell out close to $2 billion as expected today, as Canada moved to cancel the controversial digital services tax on Sunday, just one day before the first payment was due.",
    "link": "https://www.nationalobserver.com/2025/06/30/news/canada-cancelled-its-digital-services-tax-what-was-it-why-did-us-hate-it",
    "timestamp": "2025-06-30T17:32:26Z"
  },
  {
    "title": "The 'big, beautiful bill' is poised to cut Medicaid. Here's what's at stake for five Philly-area families.",
    "description": "Medicaid insures one in four Pennsylvania residents, and it is poised for cuts under President Donald Trump’s first major policy package, “The Big Beautiful Bill.\"",
    "link": "https://www.inquirer.com/health/medicaid-cuts-big-beautiful-bill-philadelphia-families-20250630.html",
    "timestamp": "2025-06-30T17:31:30Z"
  },
  {
    "title": "Glastonbury 2025 Recap: Politics, Girl Power and Indie Nostalgia Deliver an Action-Packed Fest Before Next Year’s Break",
    "description": "“Glastoooo!” a stranger yelled behind me as I checked into the hospitality campsite at Glastonbury Festival on Wednesday. Only, it wasn’t really a stranger: it was Louis Tomlinson of One Direction fame, lugging a huge rucksack and getting hyped with his frien…",
    "link": "https://variety.com/2025/music/global/glastonbury-2025-recap-politics-girl-power-indie-nostalgia-rule-1236443912/",
    "timestamp": "2025-06-30T17:30:32Z"
  },
  {
    "title": "DRC wants peace agreement with Rwanda-backed rebels before July meeting with Trump",
    "description": "M23 rebels occupy large area of mineral-rich eastern DRC",
    "link": "https://www.irishtimes.com/world/africa/2025/06/30/drc-wants-peace-agreement-with-rwanda-backed-rebels-before-july-meeting-with-trump/",
    "timestamp": "2025-06-30T17:30:23Z"
  },
  {
    "title": "Poll: National pride is declining in America. And it's splitting by party lines",
    "description": "The findings are a stark illustration of how many — but not all — Americans have felt less of a sense of pride in their country over the past decade.",
    "link": "https://richmond.com/news/nation-world/article_96cdf415-334c-5ccc-8246-1dd8aae719c3.html",
    "timestamp": "2025-06-30T17:30:00Z"
  },
  {
    "title": "Poll: National pride is declining in America. And it's splitting by party lines",
    "description": "The findings are a stark illustration of how many — but not all — Americans have felt less of a sense of pride in their country over the past decade.",
    "link": "https://roanoke.com/news/nation-world/article_6fa974e4-993e-55bd-bc92-1ee54725ec45.html",
    "timestamp": "2025-06-30T17:30:00Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is threatening to upend multi-billion dollar investments promising thousands of new jobs for a Georgia town",
    "description": "Republicans in Congress want to gut the subsidies for projects across the country in a tax cut bill.",
    "link": "https://fortune.com/2025/06/30/trump-tax-bill-georgia-factory-investment-hyundai-qcells-jobs/",
    "timestamp": "2025-06-30T17:28:30Z"
  },
  {
    "title": "Mamdani Says Billionaires Shouldn’t Exist: “What We Need More of Is Equality”",
    "description": "Mamdani has proposed raising taxes on corporations and the wealthy in New York City.",
    "link": "https://truthout.org/articles/mamdani-says-billionaires-shouldnt-exist-what-we-need-more-of-is-equality/",
    "timestamp": "2025-06-30T17:26:52Z"
  },
  {
    "title": "Palantir Is Building Trump's Mass Surveillance Platform",
    "description": "President Donald Trump grabs headlines, but the work of billionaire Peter Thiel's Palantir platform will keep you up at night. The tech company is quietly building an American mass surveillance system. Before the 2024 election, Republican leaders frequently r…",
    "link": "https://crooksandliars.com/2025/06/palantir-building-trumps-mass-surveillance",
    "timestamp": "2025-06-30T17:26:31Z"
  },
  {
    "title": "Trump: Hey, NY, Nice City You Have There. Be A Shame If I Withheld Funds",
    "description": "Fox News's Maria Bartiroma interviewed Donald Trump, and he once again sounded like a Mafia boss. He promised to withhold funding for New York City if presumptive Democratic mayoral nominee Zohran Mamdani wins the November general election and doesn't do the …",
    "link": "https://crooksandliars.com/2025/06/trump-hey-ny-nice-city-you-have-there-be",
    "timestamp": "2025-06-30T17:26:25Z"
  },
  {
    "title": "ICE in LA Sets Hollywood Summer on Edge as Latino Workers Hide: ‘It’s Like Anne Frank’",
    "description": "The man swimming laps next to me in the public pool in Santa Monica paused at the edge of the limpid water and sighed. A fifth-generation Angeleno of Chinese descent, Colin said he’s been driving his two daughters to their activities all over town – today is …",
    "link": "https://freerepublic.com/focus/f-chat/4326121/posts",
    "timestamp": "2025-06-30T17:26:04Z"
  },
  {
    "title": "Many Believe This Prophecy That Predicts the Return of Christ Is Coming True …Thanks Trump …",
    "description": "Whether you're religious or not, we know the stories of Sodom and Gomorrah and Noah's Ark, but how about the one predicting Jesus' return? \nThe post Many Believe This Prophecy That Predicts the Return of Christ Is Coming True …Thanks Trump … appeared first on…",
    "link": "https://www.theroot.com/many-believe-this-prophecy-that-predicts-the-return-of-2000046795",
    "timestamp": "2025-06-30T17:25:31Z"
  },
  {
    "title": "Could This Christian Prophecy Accurately Predict the Return of Christ??",
    "description": "Whether you're religious or not, we know the stories of Sodem and Gomorrah and Noah's Ark, but how about the one predicting Jesus' return? \nThe post Could This Christian Prophecy Accurately Predict the Return of Christ?? appeared first on The Root.",
    "link": "https://www.theroot.com/could-this-christian-prophecy-accurately-predict-the-re-2000046795",
    "timestamp": "2025-06-30T17:25:31Z"
  },
  {
    "title": "Nintendo Is Changing The Switch Price For Millions Of People Soon",
    "description": "Nintendo has strongly suggested that the original Switch is about to get more expensive for millions of people. In Canada, Nintendo said it will change prices on the Switch family of consoles, including the Switch, Switch Lite, and Switch OLED.Physical and di…",
    "link": "https://www.gamespot.com/articles/nintendo-is-changing-the-switch-price-for-millions-of-people-soon/1100-6532846/",
    "timestamp": "2025-06-30T17:25:00Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Briefing",
    "description": "Trump Press Secretary Karoline Leavitt briefs reporters at the White House on Monday, June 30.\nThe post Watch Live: Karoline Leavitt Holds White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/30/watch-live-karoline-leavitt-holds-white-house-press-briefing-20/",
    "timestamp": "2025-06-30T17:24:46Z"
  },
  {
    "title": "GOP's Tillis Rips Trump Tax Bill Medicaid Cuts",
    "description": "North Carolina Senator Thom Tillis said he won’t seek reelection following a primary threat from President Donald Trump. Tillis was one of the most vulnerable senators up for reelection in 2026. The decision could help Senate Democrats’ uphill quest to flip t…",
    "link": "https://biztoc.com/x/e42c304b580caec2",
    "timestamp": "2025-06-30T17:24:23Z"
  },
  {
    "title": "Can the GOP Pass the ‘Big Beautiful Bill’ Without Tillis?",
    "description": "Can the ‘Big Beautiful Bill’ pass without Tillis? Here are the misleading narratives Republicans are pushing to stop more Senate defections, which could kill the megabill.",
    "link": "http://nymag.com/intelligencer/article/big-beautiful-bill-pass-tillis.html",
    "timestamp": "2025-06-30T17:24:21Z"
  },
  {
    "title": "Trump says TikTok buyer group found, needs China nod",
    "description": "(Bloomberg/Hadriana Lowenkron and María Paula Mijares Torres) — President Donald Trump said he has identified a buyer for the US operations of TikTok, the social media app owned by Chinese company ByteDance Ltd., without naming the winning bidder.\nCompleting …",
    "link": "https://biztoc.com/x/0bf4b37474fe2615",
    "timestamp": "2025-06-30T17:24:13Z"
  },
  {
    "title": "Bitcoin needs to clear this key technical resistance level to open the door to a 25% rally, strategist says",
    "description": "Bitcoin is getting a boost from a handful of catalysts that could take its price as high as $143,000, Rosenberg Research said.",
    "link": "https://www.businessinsider.com/bitcoin-price-forecast-btc-technical-analysis-rally-2025-6",
    "timestamp": "2025-06-30T17:23:41Z"
  },
  {
    "title": "50 Cent is Being Dragged Over This Super-Shady Move Toward NYC Mayor Hopeful Zohran Mamdani",
    "description": "50 Cent doesn't shy away from the beef, so after Zohran Mamdani name-dropped him, the 49-year-old took to Instagram to get some things off his chest.\nThe post 50 Cent is Being Dragged Over This Super-Shady Move Toward NYC Mayor Hopeful Zohran Mamdani appeared…",
    "link": "https://www.theroot.com/50-cent-is-being-dragged-over-this-super-shady-move-tow-2000047820",
    "timestamp": "2025-06-30T17:23:24Z"
  },
  {
    "title": "U.S. dollar suffers worst start to year since 1973",
    "description": "Donald Trump's trade policies and rising debt levels have sparked decline of more than 10% in first half of 2025. Read more",
    "link": "https://financialpost.com/financial-times/u-s-dollar-suffers-worst-start-to-year-since-1973",
    "timestamp": "2025-06-30T17:23:21Z"
  },
  {
    "title": "Today in History: July 9, 14th Amendment ratified",
    "description": "Today in History\nToday is Wednesday, July 9, the 190th day of 2024. There are 175 days left in the year.\nToday in History:\nOn July 9, 1868, the 14th Amendment to the US Constitution was ratified, granting citizenship and “equal protection under the laws” to a…",
    "link": "https://www.seattlepi.com/news/article/today-in-history-july-9-14th-amendment-ratified-20400924.php",
    "timestamp": "2025-06-30T17:23:02Z"
  },
  {
    "title": "A public lands sell-off is struck from the GOP policy bill",
    "description": "Sen. Mike Lee, R-Utah, said late Saturday that he had dropped his contentious plan to sell millions of acres of public lands from the sweeping domestic policy package that the Senate will soon begin debating.",
    "link": "https://www.denverpost.com/2025/06/30/public-lands-sell-off-gop-policy-bill/",
    "timestamp": "2025-06-30T17:21:44Z"
  },
  {
    "title": "Bob Vylan have US visas revoked over 'hateful tirade at Glastonbury'",
    "description": "Bob Vylan have had their US visas revoked over their \"hateful tirade at Glastonbury\", a Trump official has said. It comes after the band were dropped by their talent agency following their anti-IDF chant at the music festival. The BBC has said it regrets not …",
    "link": "https://freerepublic.com/focus/f-news/4326119/posts",
    "timestamp": "2025-06-30T17:20:10Z"
  },
  {
    "title": "Peter Thiel faces backlash for backing Palantir — key facts Americans should be aware of",
    "description": "Peter Thiel's Palantir Technologies faces scrutiny for its role in a massive data-sharing initiative under the Trump administration. Critics fear the AI-powered platform, combining data from various federal agencies, could be misused for political targeting a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/peter-thiel-faces-backlash-for-backing-palantir-key-facts-americans-should-be-aware-of-peter-thiels-latest-news-palantir-stock-latest-news/articleshow/122164790.cms",
    "timestamp": "2025-06-30T17:19:48Z"
  },
  {
    "title": "John Fetterman Complains About Missing Family Beach Trip to Vote on Trump Bill: ‘Oh My God, I Just Want to Go Home!’",
    "description": "Sen. John Fetterman (D-PA) fumed about missing a family beach trip as Congress was busy voting on President Donald Trump's economic bill.\nThe post John Fetterman Complains About Missing Family Beach Trip to Vote on Trump Bill: ‘Oh My God, I Just Want to Go Ho…",
    "link": "https://www.mediaite.com/politics/john-fetterman-complains-about-missing-family-beach-trip-to-vote-on-trump-bill-oh-my-god-i-just-want-to-go-home/",
    "timestamp": "2025-06-30T17:17:46Z"
  },
  {
    "title": "Trump Threatens to Strip All Harvard Federal Funding in New War Front",
    "description": "Donald Trump’s administration is formally threatening to revoke all of Harvard University’s federal funding over allegations that the elite school violated Title VI. \r\nThe Department of Justice’s task force to combat antisemitism sent a formal notice to unive…",
    "link": "https://newrepublic.com/post/197431/donald-trump-harvard-federal-funding-civil-rights",
    "timestamp": "2025-06-30T17:16:32Z"
  },
  {
    "title": "Canada ended its digital tax for Trump. Could others follow?",
    "description": "Canada has withdrawn a tax that could have reaped billions in revenue to bring Donald Trump back to the table. It raises the possibility that other taxes targeting big tech could be in the US president's sights next.",
    "link": "https://www.dw.com/en/canada-ended-its-digital-tax-for-trump-could-others-follow/a-73096359",
    "timestamp": "2025-06-30T17:16:00Z"
  },
  {
    "title": "Canada axes digital tax to ease Trump trade tensions",
    "description": "Canada has withdrawn a tax that could have reaped billions in revenue to bring Donald Trump back to the table. It raises the possibility that other taxes targeting big tech could be in the US president's sights next.",
    "link": "https://www.dw.com/en/canada-us-digital-tax-trump-tariffs-trade-big-tech/a-73096359",
    "timestamp": "2025-06-30T17:16:00Z"
  },
  {
    "title": "French President Emmanuel Macron calls tariffs imposed by powerful countries a form of 'blackmail'",
    "description": "Emmanuel Macron spoke against tariffs imposed by powerful nations. He called them a form of blackmail. Macron wants a fairer international trade system. He suggested reforms for the World Trade Organization. Macron highlighted the negative impact of tariffs o…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/french-president-emmanuel-macron-calls-tariffs-imposed-by-powerful-countries-a-form-of-blackmail/articleshow/122165487.cms",
    "timestamp": "2025-06-30T17:15:32Z"
  },
  {
    "title": "Trump’s AI Critics Now Competing For His Defense Contracts",
    "description": "Anthropic has publicly criticized the Trump administration's pro-innovation AI policies while quietly pursuing lucrative defense contracts.",
    "link": "https://dailycaller.com/2025/06/30/anthropics-democrats-ai-artificial-intelligence-alarmism-trump-contracts/",
    "timestamp": "2025-06-30T17:14:51Z"
  },
  {
    "title": "MSNBC’s ‘Morning Joe’ Charges Toward Its 20th Year: ‘We Want To Break New Ground’",
    "description": "\"Going into our 19th year, 'Morning Joe' continues to be at the center of political conversation' says co-host Joe Scarborough.",
    "link": "https://www.forbes.com/sites/markjoyella/2025/06/30/msnbcs-morning-joe-charges-toward-its-20th-year-we-want-to-break-new-ground/",
    "timestamp": "2025-06-30T17:14:38Z"
  },
  {
    "title": "I knew it! Governor Newsom and Mayor Bass were lying when they said it would be “easy” for fire victims to get a permit to rebuild their homes. From March 1 through June 30, 2025, more than 5,000 fire victims have visited...",
    "description": "I knew it! Governor Newsom and Mayor Bass were lying when they said it would be “easy” for fire victims to get a permit to rebuild their homes. From March 1 through June 30, 2025, more than 5,000 fire victims have visited the government’s “one stop center,” a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326117/posts",
    "timestamp": "2025-06-30T17:12:30Z"
  },
  {
    "title": "President Trump: Group of 'Very Wealthy People' Are Ready to Buy China's TikTok",
    "description": "President Donald Trump has announced that he has a group of \"very wealthy people\" prepared to purchase the popular video-sharing app TikTok, pending approval from the Chinese government. The identities of the potential buyers has not been disclosed.\nThe post …",
    "link": "https://www.breitbart.com/tech/2025/06/30/president-trump-group-of-very-wealthy-people-are-ready-to-buy-chinas-tiktok/",
    "timestamp": "2025-06-30T17:11:25Z"
  },
  {
    "title": "A Twelve-Day War’s Twelve Surprises",
    "description": "For those who follow international politics, the days following Israel’s June 13 attack on Iran meant an addictive check of the smartphone every few hours to learn the latest twist. From that avalanche of surprises, twelve stand out, one marking each day of t…",
    "link": "https://freerepublic.com/focus/f-news/4326116/posts",
    "timestamp": "2025-06-30T17:11:15Z"
  },
  {
    "title": "‘Coming back with nothing’: Inside the reverse migration away from the US",
    "description": "Hardline immigration policies under US President Donald Trump have forced some migrants to abandon their American dream.",
    "link": "https://www.aljazeera.com/news/longform/2025/6/30/coming-back-with-nothing-inside-the-reverse-migration-away-from-the-us",
    "timestamp": "2025-06-30T17:10:19Z"
  },
  {
    "title": "MSNBC Latina Contributor: Trump A Threat To The 'Undocumented Community'",
    "description": "Who knew? Illegal aliens aren't lawbreakers: they're a \"community!\" Just ask Maria Teresa Kumar, the MSNBC contributor and head of Voto Latino. On Monday's Morning Joe, discussing the impact of the Supreme Court ruling limiting the right of federal district c…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326115/posts",
    "timestamp": "2025-06-30T17:10:10Z"
  },
  {
    "title": "MSNBC Latina Contributor: Trump A Threat To The 'Undocumented Community'",
    "description": "Who knew? Illegal aliens aren't lawbreakers: they're a \"community!\" Just ask Maria Teresa Kumar, the MSNBC contributor and head of Voto Latino. On Monday's Morning Joe, discussing the impact of the Supreme Court ruling limiting the right of federal district c…",
    "link": "https://freerepublic.com/focus/f-news/4326115/posts",
    "timestamp": "2025-06-30T17:10:10Z"
  },
  {
    "title": "The world is changing, the U.S. market is not",
    "description": "To date, the Trump shock is that he has had so little impact. Read more.",
    "link": "https://financialpost.com/financial-times/world-changing-us-market-not",
    "timestamp": "2025-06-30T17:10:01Z"
  },
  {
    "title": "Transcript: Trump Is Screwing His Voters in \"Mind-Boggling\" New Scam (New Republic)",
    "description": "New Republic:\nTranscript: Trump Is Screwing His Voters in “Mind-Boggling” New Scam … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  On many fronts at once, it's suddenl…",
    "link": "https://www.memeorandum.com/250630/p86",
    "timestamp": "2025-06-30T17:10:00Z"
  },
  {
    "title": "A timeline of the U.S.-Canada trade dispute",
    "description": "U.S.-Canada trade talks resumed late Sunday, days after Trump suspended them.",
    "link": "https://abcnews.go.com/Business/timeline-us-canada-trade-dispute/story?id=123335160",
    "timestamp": "2025-06-30T17:07:48Z"
  },
  {
    "title": "“Shocking and concerning”: Trump DOJ to “aggressively investigate” naturalized citizens",
    "description": "A memo from the DOJ lays out the broad ground rules for \"aggressively\" prosecuting immigrants over citizenship",
    "link": "https://www.salon.com/2025/06/30/shocking-and-concerning-trump-doj-to-aggressively-investigate-naturalized-citizens/",
    "timestamp": "2025-06-30T17:07:27Z"
  },
  {
    "title": "Canada scraps tax on tech giants in bid to revive US trade talks",
    "description": "US President Donald Trump had stopped negotiations with Canada over what he called an “attack” on American businesses Read Full Article at RT.com",
    "link": "https://www.rt.com/business/620789-canada-drops-digital-tax-trump/",
    "timestamp": "2025-06-30T17:07:10Z"
  },
  {
    "title": "Today in History: July 6, Althea Gibson wins Wimbledon",
    "description": "Today in History\nToday is Sunday, July 6, the 187th day of 2024. There are 178 days left in the year.\nToday’ in History:\nOn July 6, 1957, Althea Gibson became the first Black tennis player to win a Wimbledon singles title as she defeated fellow American Darle…",
    "link": "https://www.seattlepi.com/news/article/today-in-history-july-6-althea-gibson-wins-20400901.php",
    "timestamp": "2025-06-30T17:07:00Z"
  },
  {
    "title": "US' shocking move: Bob Vylan's visas revoked after ‘death to the IDF’ chant at UK's Glastonbury festival",
    "description": "The Trump administration has revoked U.S. visas for members of punk-rap duo Bob Vylan after the group’s inflammatory remarks about Israel during a performance at the U.K.’s Glastonbury Festival. The performers drew broad rebuke after lead singer Bobby Vylan l…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-shocking-move-bob-vylans-visas-revoked-after-death-to-the-idf-chant-at-uks-glastonbury-festival/articleshow/122165158.cms",
    "timestamp": "2025-06-30T17:06:30Z"
  },
  {
    "title": "White House promotes ‘Big Beautiful Bill’ with lo-fi cartoon and social media can't look away",
    "description": "The White House has released a calming lo-fi video promoting Donald Trump's \"Big Beautiful Bill,\" featuring an animated Trump flipping burgers and touting policy achievements. This follows a similar earlier livestream and references campaign stunts, aiming to…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/white-house-promotes-big-beautiful-bill-with-lo-fi-cartoon-and-social-media-cant-look-away/articleshow/122165275.cms",
    "timestamp": "2025-06-30T17:05:10Z"
  },
  {
    "title": "We Still Have An Imperial Judiciary, Yet Trump Continues To Exercise Extreme Restraint",
    "description": "What the judges have yet to appreciate is that their own lawlessness is destroying the reputation of the courts.Everyone, from the President on down, is bound by law.’ That goes for judges too,” the Supreme Court declared last week in holding several lower co…",
    "link": "https://freerepublic.com/focus/f-news/4326114/posts",
    "timestamp": "2025-06-30T17:03:36Z"
  },
  {
    "title": "Intel suggests US strikes on Iran caused limited damage – WaPo",
    "description": "Tehran expected its nuclear facilities to suffer worse from US attacks, intercepted conversations between Iranian officials reportedly show Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620799-iran-nuclear-facilities-us-attack/",
    "timestamp": "2025-06-30T17:02:51Z"
  },
  {
    "title": "PHOTO: Billboard in Israel Shows Trump Uniting Middle East",
    "description": "A billboard has gone up in Tel Aviv, Israel, depicting Israeli and Arab leaders -- including the Palestinians -- uniting in peace, with President Donald Trump leading the throng.\nThe post PHOTO: Billboard in Israel Shows Trump Uniting Middle East appeared fir…",
    "link": "https://www.breitbart.com/middle-east/2025/06/30/photo-billboard-in-israel-shows-trump-uniting-middle-east/",
    "timestamp": "2025-06-30T17:02:20Z"
  },
  {
    "title": "Trump administration sues Los Angeles over sanctuary city' immigration policies",
    "description": "WASHINGTON — The Trump administration has sued the city of Los Angeles over its immigration policies, claiming that the city's law discriminates against federal law enforcement by treating them differently from other law enforcement authorities",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-administration-sues-los-angeles-sanctuary-city-immigration-polic-rcna216011",
    "timestamp": "2025-06-30T17:02:18Z"
  },
  {
    "title": "Senate Dems Deploy ‘Nuclear Option’ In Fruitless Effort To Tank Trump’s Bill",
    "description": "Senate Democrats went nuclear Monday morning in an effort to prevent Republicans from enacting a permanent extension of President Donald Trump’s 2017 tax cuts. Senate Democrats moved to overrule the presiding chair’s ruling that Senate Republicans can use a c…",
    "link": "https://dailycaller.com/2025/06/30/senate-dems-nuclear-option-big-beautiful-bill/",
    "timestamp": "2025-06-30T17:01:06Z"
  },
  {
    "title": "Harvard found in violation of Civil Rights Act over anti-semitism, Trump admin says",
    "description": "Harvard University is \"in violent violation\" of Title VI of the Civil Rights Act, the federal government’s Task Force to Combat Anti-Semitism said in a Monday letter threatening to cut all the school's federal funding if changes aren't made.",
    "link": "https://www.nbcnews.com/news/us-news/harvard-university-found-violent-violation-civil-rights-act-anti-semit-rcna216007",
    "timestamp": "2025-06-30T17:00:35Z"
  },
  {
    "title": "Balancing US alliance and global peace – Editorial",
    "description": "OPINION: America celebrates its 249th birthday this week.",
    "link": "https://www.nzherald.co.nz/nz/balancing-us-alliance-and-global-peace-editorial/2PWJCAUC2FBFHG25G2XPYLWTX4/",
    "timestamp": "2025-06-30T17:00:00Z"
  },
  {
    "title": "Savannah Chrisley Threatens Run for Congress After Securing Pardon for Parents’ …",
    "description": "Reading Time: 4 minutesSavannah Chrisley is considering a sun for Congress!\nSavannah Chrisley Threatens Run for Congress After Securing Pardon for Parents’ … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/06/savannah-chrisley-politcal-run-congress/",
    "timestamp": "2025-06-30T16:59:57Z"
  },
  {
    "title": "Trump eyes Fed vacancy in early 2026 to appoint Powell successor: Bessent",
    "description": "Powell's term as chair ends in late May 2026. Trump has said he would not give the job to anyone who does not align with his demands for the Fed to cut rates.",
    "link": "https://nypost.com/2025/06/30/business/trump-eyes-fed-vacancy-in-early-2026-to-appoint-powell-successor-bessent/",
    "timestamp": "2025-06-30T16:58:56Z"
  },
  {
    "title": "U.S. Jews turned out for Trump in 2024 in unprecedented numbers, Pew survey finds",
    "description": "A new study from the Pew Research Center demonstrated that more Jews voted Republican and fewer voted Democrat in 2024 than in 2020, bolstering claims that U.S. Jews are moving to the right",
    "link": "https://www.haaretz.com/us-news/2025-06-30/ty-article/.premium/u-s-jews-turned-out-for-trump-in-2024-in-unprecedented-numbers-pew-survey-finds/00000197-c1b5-df44-a9f7-edff299a0000",
    "timestamp": "2025-06-30T16:58:28Z"
  },
  {
    "title": "Stay Sane",
    "description": "\"Betting against Donald Trump is usually a bad idea.\" —Insurrection Barbie on \"X\" What apparently riles the credentialed political Left — the “gay / race communists” in the apt new phrase — more than anything, is that most of the country has opted to not be i…",
    "link": "https://freerepublic.com/focus/f-news/4326113/posts",
    "timestamp": "2025-06-30T16:57:38Z"
  },
  {
    "title": "Watch As Pollster Eats Crow After New 2024 Election Data Shows Trump’s ‘Remarkable’ Gains With Key Voters",
    "description": "Kristen Soltis Anderson acknowledged that she was wrong when she predicted Donald Trump would destroy her party's progress with youth and minority voters.",
    "link": "https://dailycaller.com/2025/06/30/pollster-eats-crow-2024-election-data-shows-trumps-remarkable-gains-key-voters/",
    "timestamp": "2025-06-30T16:57:32Z"
  },
  {
    "title": "Pam Bondi sues Los Angeles alleging discrimination against ICE agents",
    "description": "U.S. Attorney General Pam Bondi announced that she is suing the city of Los Angeles, claiming that it's discriminating against ICE agents. Fox News is reporting that President Donald Trump's Department of Justice has found a way to go after L.A.'s sanctuary c…",
    "link": "https://www.rawstory.com/trump-los-angeles-2672502084/",
    "timestamp": "2025-06-30T16:57:25Z"
  },
  {
    "title": "Eat, don't choke: what store shelves really looked like in the last years of the USSR",
    "description": "Many Ukrainians recall the USSR with warmth and nostalgia, which is not surprising, as it was the time of their youth and prosperity. However, photographs and objective facts show that Soviet life was far from easy and carefree.",
    "link": "https://freerepublic.com/focus/f-chat/4326112/posts",
    "timestamp": "2025-06-30T16:56:06Z"
  },
  {
    "title": "Nelly Defends Performing At Trump Event, Slams Kamala Harris",
    "description": "Nelly defended his choice to perform at President Trump‘s Liberty Inaugural Ball, and had critique for Kamala Harris in the process.",
    "link": "https://www.vibe.com/news/entertainment/nelly-defends-performing-trump-slams-kamala-harris-1235081894/",
    "timestamp": "2025-06-30T16:55:43Z"
  },
  {
    "title": "Socialist President In America Not That Far Off If You Take Close Look",
    "description": "An avowed socialist, pro-Palestine, America-hating Muslim who became an American citizen the year The Incredibles 2 was released is now a whisker away from becoming the mayor of New York City.",
    "link": "https://dailycaller.com/2025/06/30/peachy-keenan-socialist-president-america-data-voting-bloc-zohran-mamdani-nyc/",
    "timestamp": "2025-06-30T16:55:30Z"
  },
  {
    "title": "NATO Launches Global Arms Race As Defense Spending Set To Explode",
    "description": "agreed to boost defense spending to 5% of GDP by 2035, with a floor of 3.5% earmarked for “core military needs.”",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/06/30/nato-launches-global-arms-race-as-defense-spending-set-to-explode/",
    "timestamp": "2025-06-30T16:51:42Z"
  },
  {
    "title": "Trump’s Iran Oil Comments Strain His ‘Maximum Pressure’ Policy",
    "description": "President Donald Trump indicated that he might be preparing to ease his “maximum pressure” campaign against Iran, potentially undercutting a central policy dating to his first term and provoking consternation among foreign policy hawks who argue that now is t…",
    "link": "https://gcaptain.com/trumps-iran-oil-comments-strain-his-maximum-pressure-policy/",
    "timestamp": "2025-06-30T16:51:14Z"
  },
  {
    "title": "Democratic groups target 'non-political spaces' in new campaign ahead of fall elections and 2026 midterms",
    "description": "WASHINGTON — Democratic groups are kicking off a new community organizing effort this summer, taking aim at Republican priorities and widening their scope to include \"non-political spaces\" like book clubs and sports forums",
    "link": "https://www.nbcnews.com/politics/elections/democratic-groups-target-non-political-spaces-new-campaign-ahead-fall-rcna215922",
    "timestamp": "2025-06-30T16:50:54Z"
  },
  {
    "title": "Supreme Court to Hear JD Vance Case",
    "description": "The case, which centers on free speech claims, involves VP Vance, who was a Senate candidate in Ohio when the lawsuit was initiated.",
    "link": "https://www.newsweek.com/supreme-court-jd-vance-campaign-finance-ohio-case-2092657",
    "timestamp": "2025-06-30T16:48:23Z"
  },
  {
    "title": "Exclusive — Rwandan Foreign Minister: Trump ‘Absolutely’ ‘Deserves the Nobel Peace Prize’ for Helping End 30-Year Conflict with Congo Peace Agreement",
    "description": "WASHINGTON — Rwanda’s Foreign Minister Olivier Nduhungirehe told Breitbart News exclusively on Saturday that U.S. President Donald Trump \"absolutely... deserves the Nobel Peace Prize” for his work to help end the bloody 30-year conflict in the agreement Trump…",
    "link": "https://www.breitbart.com/politics/2025/06/30/exclusive-rwandan-foreign-minister-trump-absolutely-deserves-the-nobel-peace-prize-for-helping-end-30-year-conflict-with-congo-peace-agreement/",
    "timestamp": "2025-06-30T16:47:36Z"
  },
  {
    "title": "A more defensive Pride: Activists say celebrations are more critical as US, conservative states rescind LGBTQ protections",
    "description": "'There’s a lot of anxiety about the rights that we have and are they going to stick around much longer?'",
    "link": "https://www.bostonherald.com/2025/06/30/pride-under-attack/",
    "timestamp": "2025-06-30T16:46:15Z"
  }
]