[
  {
    "title": "Doctor Who, Wednesday, Smiling Friends & More: BCTV Daily Dispatch",
    "description": "Welcome back, folks! With My Chemical Romance kicking things off with \"Sing\" (BCTV DD's unofficial \"official\" theme) – welcome back to the BCTV Daily Dispatch! Here's where we look back at what we've been doing for the past 24 hours that you might've missed o…",
    "link": "https://bleedingcool.com/tv/doctor-who-wednesday-smiling-friends-more-bctv-daily-dispatch/",
    "timestamp": "2025-05-17T11:37:07Z"
  },
  {
    "title": "Dozens of Silicon Valley Sycophants Now Work at Regulatory Agencies",
    "description": "Elon Musk, Peter Thiel, Marc Andreessen, and Palmer Luckey have stacked the deck.",
    "link": "https://gizmodo.com/dozens-of-silicon-valley-sycophants-now-work-at-regulatory-agencies-2000603435",
    "timestamp": "2025-05-17T11:30:16Z"
  },
  {
    "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
    "description": "As the Trump administration resumes collections on defaulted student loans, hundreds of thousands of older Americans with decades-old debts are now at risk of having their Social Security checks garnished.",
    "link": "https://richmond.com/news/nation-world/education/article_165880a3-cf30-5a0a-a3da-2c2d2b4c7fec.html",
    "timestamp": "2025-05-17T11:30:00Z"
  },
  {
    "title": "The Broadband Divide Worsened in 32 States in 2024, Ookla Reports",
    "description": "New data shows internet performance gaps are growing between urban and rural areas despite improved broadband speeds.",
    "link": "https://www.cnet.com/home/internet/the-broadband-divide-worsened-in-32-states-in-2024-ookla-reports/",
    "timestamp": "2025-05-17T11:30:00Z"
  },
  {
    "title": "Dollar under threat led to Trump’s about-face on tariffs",
    "description": "President Trump’s so-called tariff “liberation day” brought significant financial fallout for the US, threatening the dollar’s supremacy and revealing deeper vulnerabilities in the US macroeconomic outlook. Fabio Sabatini writes that the threat to the dominan…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/05/17/dollar-under-threat-led-to-trumps-about-face-on-tariffs/",
    "timestamp": "2025-05-17T11:30:00Z"
  },
  {
    "title": "So where are the Democrats who condemn James Comey's implicit call to kill the president?",
    "description": "They've tut-tutted about violence for decades. They've smeared their political opponents as violent, setting up whole government units to investigate them in the military, as well as throw the book at those caught up in the crowds on Jan. 6, 2021 as violent. …",
    "link": "https://freerepublic.com/focus/f-chat/4317510/posts",
    "timestamp": "2025-05-17T11:26:59Z"
  },
  {
    "title": "Trump’s moment in the Middle East",
    "description": "Dissecting the spectacle and substance of Trump’s Middle East tour.",
    "link": "https://www.aljazeera.com/program/the-listening-post/2025/5/17/trumps-moment-in-the-middle-east",
    "timestamp": "2025-05-17T11:24:32Z"
  },
  {
    "title": "Iran's Supreme Leader says Trump is lying when he speaks of peace",
    "description": "Ayatollah Ali Khamenei criticised Donald Trump's peace claims. Khamenei stated Trump provides weapons to Israel. President Masoud Pezeshkian questioned Trump's dual stance of peace talks and threats. Abbas Araqchi denied receiving any US nuclear proposal. Ara…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/irans-supreme-leader-says-trump-is-lying-when-he-speaks-of-peace/articleshow/121234908.cms",
    "timestamp": "2025-05-17T11:22:12Z"
  },
  {
    "title": "Travis Kelce reacts to Donald Trump's latest criticism of Taylor Swift: \"He is furious\"",
    "description": "Taylor Swift has been in the spotlight recently, as between the subpoena over Blake Lively and Justin Baldoni&apos;s lawsuit and her recent rekindled public feud with rapper Kanye",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/05/17/68286cb3268e3ec41e8b45b6.html",
    "timestamp": "2025-05-17T11:21:06Z"
  },
  {
    "title": "Donald Trump attacks ‘dried out prune of a rocker’ Bruce Springsteen and ‘no longer hot’ Taylor Swift",
    "description": "Veteran musician’s fiery speeches trigger angry insults from US president",
    "link": "https://www.irishtimes.com/world/us/2025/05/17/donald-trump-attacks-dried-out-prune-of-a-rocker-bruce-springsteen-and-no-longer-hot-taylor-swift/",
    "timestamp": "2025-05-17T11:18:30Z"
  },
  {
    "title": "Ex-Vikings player rips Minnesota AG as state sues Trump to keep trans athletes in girls sports",
    "description": "Former Minnesota Vikings and University of Minnesota football player Jack Brewer shared a grievance with Minnesota Attorney General Keith Ellison. The AG is waging a legal battle against President Donald Trump and the Department of Justice to ensure transgend…",
    "link": "https://freerepublic.com/focus/f-chat/4317509/posts",
    "timestamp": "2025-05-17T11:15:52Z"
  },
  {
    "title": "Ukraine updates: Trump to call Putin, Zelenskyy next week",
    "description": "Just a day after the rare direct peace talks between Russia and Ukraine, nine people were killed in a Russian strike on a bus in northeastern Ukraine. Meanwhile, Trump said he will call Putin next week. DW has more. At least nine killed in Russian attack on b…",
    "link": "https://www.dw.com/en/ukraine-updates-trump-to-call-putin-zelenskyy-next-week/live-72572831",
    "timestamp": "2025-05-17T11:09:00Z"
  },
  {
    "title": "How Paychecks of the Lower Middle Class Would Look in Each State If Trump Ended Federal Income Tax",
    "description": "Throughout his 2024 presidential campaign, Donald Trump continually (and publicly) mused that he might abolish the federal income tax in the United States...",
    "link": "https://finance.yahoo.com/news/paychecks-lower-middle-class-look-130452139.html",
    "timestamp": "2025-05-17T11:08:15Z"
  },
  {
    "title": "More Americans are taking a look at property in Scotland — Trump's favorite part of the UK",
    "description": "Rightmove found a sharp rise in the number of enquiries from potential US buyers about homes in the UK this year, with Scotland overtaking London.",
    "link": "https://www.businessinsider.com/americans-searching-property-uk-scotland-london-trump-rightmove-2025-5",
    "timestamp": "2025-05-17T11:07:01Z"
  },
  {
    "title": "While Trump Was Away, His Megabill Went Astray",
    "description": "President Donald Trump was only a few hours into a marathon flight from Abu Dhabi on Friday when he sent a crystal-clear message to Capitol Hill: Tidy up the house, kids, because dad’s coming home from his big work trip. \nOr, translated into Trump-ese, “Repub…",
    "link": "https://biztoc.com/x/a727bf9f94f94db2",
    "timestamp": "2025-05-17T11:04:33Z"
  },
  {
    "title": "Do you really believe Donald Trump has come to his senses about tariffs?",
    "description": "John Rapley is a contributing columnist for The Globe and Mail. He is an author and academic whose books include Why Empires Fall and Twilight of the Money Gods.\nParty now, pay later?",
    "link": "https://biztoc.com/x/daa61c4540a1f965",
    "timestamp": "2025-05-17T11:04:22Z"
  },
  {
    "title": "Trump Asks Apple to Stop Moving iPhone Production to India #trump #apple #technology",
    "description": "US President Donald Trump urges Apple to stop moving iPhone manufacturing to India and boost domestic production as it pivots from China.\nHere's why that might be a tall order. Tap the link in the bio to read more.\nbloom.bg/44IGHDp\n----------\nLike this video?…",
    "link": "https://biztoc.com/x/574170a53ff1007c",
    "timestamp": "2025-05-17T11:04:08Z"
  },
  {
    "title": "My e-commerce business sells pickleball paddles made in China. Tariffs haven't hit yet, but I'm ready to make one strategic shift.",
    "description": "I've avoided tariffs so far but couldn't help but wonder, should I be worried about working exclusively with suppliers in China?",
    "link": "https://www.businessinsider.com/how-to-mitigate-trump-tariffs-ecommerce-business-diversify-supply-chain-2025-5",
    "timestamp": "2025-05-17T11:02:01Z"
  },
  {
    "title": "HHS SEC ROBERT F KENNEDY JR: American patients pay more so others can pay less — that stops now",
    "description": "President Donald Trump's drug pricing order seeks to balance innovation with affordability, ending the burden on American patients and ensuring fair global contributions.",
    "link": "https://www.foxnews.com/opinion/hhs-sec-robert-f-kennedy-jr-american-patients-pay-more-so-others-can-pay-less-stops-now",
    "timestamp": "2025-05-17T11:00:56Z"
  },
  {
    "title": "How dismantling DEI endangers the future of medical care",
    "description": "Shortly after taking the oath of office on January 20, 2025, President-elect Donald Trump issued two Executive Orders: One halted diversity, equity, and inclusion (DEI) initiatives within the federal government, and another mandated the use of “sex,” rather t…",
    "link": "https://kevinmd.com/2025/05/how-dismantling-dei-endangers-the-future-of-medical-care.html",
    "timestamp": "2025-05-17T11:00:54Z"
  },
  {
    "title": "James Carville dismisses Democratic Party's record-low polling: 'We're winning elections'",
    "description": "Democratic Party faces record low favorability, but Democratic strategist James Carville highlights recent election wins and future prospects as signs of potential recovery.",
    "link": "https://www.foxnews.com/politics/james-carville-dismisses-democratic-partys-record-low-polling-were-winning-elections",
    "timestamp": "2025-05-17T11:00:46Z"
  },
  {
    "title": "At home and abroad: FP Video on continuing tariff turbulence",
    "description": "FP Video looks at Canadian ex-pats in the U.S., cottage country real estate, EV manufacturing, and one Canadian brewer's success. Watch here",
    "link": "https://financialpost.com/news/at-home-and-abroad-fp-video-on-continuing-tariffs-turbulence",
    "timestamp": "2025-05-17T11:00:45Z"
  },
  {
    "title": "Sex Workers Already Predicted There's A Recession Coming — Here's How They Know",
    "description": "The past has shown that nontraditional measures like brothels, beer and lipstick can tell us a lot about the economy’s health.",
    "link": "https://www.huffpost.com/entry/sex-workers-already-predicted-theres-a-recession-coming-heres-how-they-know-goog_n_682648fee4b0a8ff0de701e2",
    "timestamp": "2025-05-17T11:00:26Z"
  },
  {
    "title": "Top former Democratic counsel urges party to reject 'cultural leftism' after electoral losses",
    "description": "Former House Judiciary chief counsel Julian Epstein is warning Democrats to abandon progressive policies, blaming them for alienating voters and driving the party off course.",
    "link": "https://www.foxnews.com/media/top-former-democratic-counsel-urges-party-reject-cultural-leftism-after-electoral-losses",
    "timestamp": "2025-05-17T11:00:02Z"
  },
  {
    "title": "How student loan borrowers can avoid default as Trump administration ramps up collection efforts",
    "description": "Some student loan borrowers mistakenly believe they're in default. Meanwhile, those who have defaulted can take steps to get current on their loans.",
    "link": "https://www.cnbc.com/2025/05/17/student-loan-borrowers-how-to-avoid-delinquency-default-garnishment.html",
    "timestamp": "2025-05-17T11:00:01Z"
  },
  {
    "title": "Nvidia gets an AI boost, Meta hits a AI roadblock, and Apple's brutal year: Tech news roundup",
    "description": "Meta (META) reportedly has delayed the release of its latest artificial intelligence model, known internally as “Behemoth,” raising concerns among employees about the effectiveness and direction of the company’s massive AI investments. Read more...",
    "link": "https://qz.com/nvidia-meta-ai-apple-sam-altman-openai-chatgpt-1851781049",
    "timestamp": "2025-05-17T11:00:00Z"
  },
  {
    "title": "Comey Levels Odd Charge Against Comey",
    "description": "Rep. James Comer (R-KY) accused former FBI Director James Comey of trying to “jizz up some type of coup” against President Donald Trump, the Daily Beast reports.",
    "link": "https://politicalwire.com/2025/05/17/comey-levels-odd-charge-against-comey/",
    "timestamp": "2025-05-17T10:59:03Z"
  },
  {
    "title": "Pedro Pascal Says That With ‘Eddington’ Ari Aster Wrote A Movie That’s “All Our Worst Fears” In Post-Covid Political Era",
    "description": "When it came to unpacking the politics of MAGA-culture and Donald Trump in Ari Aster’s Eddington, there was no dodging the subject for filmmaker Ari Aster and stars Pedro Pascal and Joaquin Phoenix at the Cannes presser this afternoon. Actually, Phoenix let P…",
    "link": "http://deadline.com/2025/05/pedro-pascal-cannes-eddington-donald-trump-maga-politics-1236401971/",
    "timestamp": "2025-05-17T10:58:52Z"
  },
  {
    "title": "US Issues First Terrorism Charges Over Mexican Cartel Support: What To Know",
    "description": "Federal charges have been issued against Mexican national Maria Del Rosario Navarro-Sanchez.",
    "link": "https://www.newsweek.com/mexico-cartel-terrorism-charges-2073582",
    "timestamp": "2025-05-17T10:55:59Z"
  },
  {
    "title": "Appeals court lifts block on Trump executive order targeting federal worker unions",
    "description": "A federal appeals court has lifted a lower-court order that prevented the federal government from implementing President Donald Trump’s plan to end collective bargaining by workers at more than a dozen federal agencies. In a 2-1 ruling Friday, the D.C. Circui…",
    "link": "https://freerepublic.com/focus/f-news/4317506/posts",
    "timestamp": "2025-05-17T10:53:54Z"
  },
  {
    "title": "Russian Drone Strike in Northeastern Ukraine Kills Nine People, Officials Say",
    "description": "A Russian drone on Saturday hit a bus evacuating civilians from a front-line area in Ukraine's northeastern Sumy region, killing nine people and injuring seven, Ukrainian officials said, hours after Moscow and Kyiv had held their first direct peace talks in y…",
    "link": "https://www.breitbart.com/europe/2025/05/17/russian-drone-strike-in-northeastern-ukraine-kills-nine-people-officials-say/",
    "timestamp": "2025-05-17T10:47:49Z"
  },
  {
    "title": "Trump Remkes the Foreign Trip",
    "description": "“The first multi-day foreign trip of President Donald Trump’s second term bucked the norms of presidential travel, demonstrating just how swiftly and drastically his transactional approach to foreign policy has reshaped the way other countries",
    "link": "https://politicalwire.com/2025/05/17/trump-remkes-the-foreign-trip/",
    "timestamp": "2025-05-17T10:47:00Z"
  },
  {
    "title": "Israeli bombing kills at least 146 Palestinians in Gaza in 24 hours, local health authorities say",
    "description": "Israel's airforce killed at least 146 Palestinians in new attacks on Gaza over the past 24 hours and injured many more, local health authorities said on Saturday, as the country appeared set to press ahead with a new ground offensive.",
    "link": "https://www.independent.ie/world-news/israeli-bombing-kills-at-least-146-palestinians-in-gaza-in-24-hours-local-health-authorities-say/a869754822.html",
    "timestamp": "2025-05-17T10:46:30Z"
  },
  {
    "title": "Israeli Strikes Kill 146 Palestinians In Gaza In 24 hours: Report",
    "description": "Israel&#039;s airforce killed at least 146 Palestinians in new attacks on Gaza over the past 24 hours and injured many more, local health authorities said on Saturday, as the country appeared set to press ahead with a new ground offensive.",
    "link": "https://www.ndtv.com/india-news/israel-hamas-war-israeli-strikes-kill-146-palestinians-in-gaza-in-24-hours-report-8437887",
    "timestamp": "2025-05-17T10:43:43Z"
  },
  {
    "title": "A Russian drone strike in northeastern Ukraine kills 9 people, officials say",
    "description": "The drone hit a bus evacuating civilians from a front-line area in Ukraine's northeastern Sumy region Saturday, hours after Moscow and Kyiv had held their first direct peace talks in years.",
    "link": "https://www.npr.org/2025/05/17/g-s1-67402/russian-drone-strike-kills-9",
    "timestamp": "2025-05-17T10:42:55Z"
  },
  {
    "title": "Trump tariffs seen lowering Chinese firms’ US investment plans",
    "description": "Findings based on survey of Chinese firms in US shortly before 'Liberation Day' tariffs were announced Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/17/trump-tariffs-seen-lowering-chinese-firms-us-investment-plans",
    "timestamp": "2025-05-17T10:39:00Z"
  },
  {
    "title": "Americans’ economic hope crashes to a record low under Donald Trump amid inflation fears and tariffs",
    "description": "US consumer sentiment plummeted to its lowest since 1961 under President Trump, even surpassing Great Recession levels. Inflation fears, fueled by tariffs, are a major driver, with nearly three-quarters of those surveyed spontaneously mentioning tariffs. Desp…",
    "link": "https://economictimes.indiatimes.com/news/international/us/americans-economic-hope-crashes-to-a-record-low-under-donald-trump-amid-inflation-fears-and-tariffs/articleshow/121234098.cms",
    "timestamp": "2025-05-17T10:36:40Z"
  },
  {
    "title": "The extravagant ways Gulf leaders rolled out the red (and lavender) carpet for Trump, in photos - Business Insider",
    "description": "The extravagant ways Gulf leaders rolled out the red (and lavender) carpet for Trump, in photosBusiness Insider Inside Trump’s Trip to the Middle East: Adulation and Not a Whiff of ProtestsThe New York Times What Gulf Arab states got, and didn’t get, out of T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177581573",
    "timestamp": "2025-05-17T10:34:49Z"
  },
  {
    "title": "Supreme Court makes new decision after Donald Trump reintroduced 227-year-old law last used in WW2",
    "description": "The US Supreme Court has made a decision after Donald Trump used the Alien Enemies Act, an 18th Century law, to deport people.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-supreme-court-alien-enemies-act-434215-20250517",
    "timestamp": "2025-05-17T10:31:51Z"
  },
  {
    "title": "Ivanka Trump searches Eagles locker room for the 23-year-old player who called her \"beautiful\" and leaves him a special message",
    "description": "Ivanka Trump turned a viral moment into a playful and classy exchange with Philadelphia Eagles cornerback Eli Ricks after he publicly gushed over her appearance during the team&apo",
    "link": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/05/17/6828617c22601d2d528b4587.html",
    "timestamp": "2025-05-17T10:31:35Z"
  },
  {
    "title": "Five mainstream media figures who ran for office as Democrats",
    "description": "As reporter Hanna Trudo considers running for Congress as a Democrat, here are five other mainstream media figures who plunged into party politics.",
    "link": "https://www.foxnews.com/media/five-mainstream-media-figures-who-ran-office-democrats",
    "timestamp": "2025-05-17T10:30:16Z"
  },
  {
    "title": "The Saudi Real Estate Tycoon Who’s A “Member Of The Trump Family”",
    "description": "In his second term, Donald Trump is still pushing forward with new deals all over the world. No one has more of them than Saudi real estate developer Yousef Al Shelash.",
    "link": "https://www.forbes.com/sites/giacomotognini/2025/05/17/the-saudi-real-estate-tycoon-whos-a-member-of-the-trump-family/",
    "timestamp": "2025-05-17T10:30:00Z"
  },
  {
    "title": "Coinbase Will Reimburse Customers Up to $400 Million After Data Breach",
    "description": "Plus: 12 more people are indicted over a $263 million crypto heist, and a former FBI director is accused of threatening Donald Trump thanks to an Instagram post of seashells.",
    "link": "https://www.wired.com/story/coinbase-will-reimburse-customers-up-to-400-million-after-data-breach/",
    "timestamp": "2025-05-17T10:30:00Z"
  },
  {
    "title": "Watch: Pro Border-Control Polish Voters Chant 'Donald Trump' Ahead of Presidential Elections",
    "description": "Both Poland and Romania will host presidential elections this Sunday, and a joint rally by the sovereigntist candidates from both nations saw a crowd of Polish voters chant the U.S. President's name in response to a call for border control.\nThe post Watch: Pr…",
    "link": "https://www.breitbart.com/europe/2025/05/17/watch-pro-border-control-polish-voters-chant-donald-trump/",
    "timestamp": "2025-05-17T10:29:01Z"
  },
  {
    "title": "Coinbase Global Stock (COIN) Prepares for S&P 500 Listing With 16% Spike",
    "description": "Cryptoeconomy enabler Coinbase Global (COIN) rallied 16% over the past five days to celebrate its public listing on the S&P 500 index, scheduled for next...",
    "link": "https://finance.yahoo.com/news/coinbase-global-stock-coin-prepares-102657308.html",
    "timestamp": "2025-05-17T10:26:57Z"
  },
  {
    "title": "Trump’s Trade Deals Endanger Farmers and Our Food System",
    "description": "Trump is reversing protections of the US food system, subjecting farmers to a race to the bottom in international markets",
    "link": "https://www.nakedcapitalism.com/2025/05/trumps-trade-deals-endanger-farmers-and-our-food-system.html",
    "timestamp": "2025-05-17T10:25:32Z"
  },
  {
    "title": "Russia ‘demands Ukraine cede more territory’",
    "description": "ISTANBUL - Russian negotiators at  peace talks  in Istanbul demanded that  Ukraine  pull its troops out of all the Ukrainian regions claimed by Moscow before they would agree to a ceasefire, a senior Ukrainian official familiar with the talks told Reuters.",
    "link": "https://www.bangkokpost.com/world/3027890/russia-demands-ukraine-cede-more-territory",
    "timestamp": "2025-05-17T10:24:00Z"
  },
  {
    "title": "DC Comics August 2025 Full Solicits in The Daily LITG, 17th May, 2025",
    "description": "DC Comics August 2025 Full Solicits was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past six years. Founded sixteen years ago and steeped in a histor…",
    "link": "https://bleedingcool.com/comics/dc-comics-august-2025-full-solicits-in-the-daily-litg-17th-may-2025/",
    "timestamp": "2025-05-17T10:23:07Z"
  },
  {
    "title": "Kremlin Says Putin-Zelensky Meeting Possible Only After Agreement",
    "description": "The Kremlin on Saturday said a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky would be possible only after both sides reach an agreement, a day after after Moscow and Kyiv held their first direct talks in more than…",
    "link": "https://www.ibtimes.com.au/kremlin-says-putin-zelensky-meeting-possible-only-after-agreement-1858912",
    "timestamp": "2025-05-17T10:21:06Z"
  },
  {
    "title": "Court lifts block on Trump order to strip federal workers of union rights",
    "description": "A federal appeals court on Friday lifted a block on an executive order from President Donald Trump that seeks to strip union rights from federal workers at dozens of agencies and offices. Trump in March issued an executive order that said that parts of the Un…",
    "link": "https://freerepublic.com/focus/f-news/4317503/posts",
    "timestamp": "2025-05-17T10:20:17Z"
  },
  {
    "title": "Donald Trump Suffers Double Deportation Loss In Hours: 'Irreparable Harm'",
    "description": "The courts have emerged as one of the main obstacles to the Trump administration's policies.",
    "link": "https://biztoc.com/x/360eb9fe060aeae6",
    "timestamp": "2025-05-17T10:20:07Z"
  },
  {
    "title": "Officials from Israel and Syria held direct talks in Azerbaijan",
    "description": "Among the Israeli officials included the IDF Operations Directorate chief Maj.-Gen. Oded Basyuk.",
    "link": "https://www.jpost.com/middle-east/article-854310",
    "timestamp": "2025-05-17T10:20:05Z"
  },
  {
    "title": "Donald Trump Suffers Double Deportation Loss In Hours: 'Irreparable Harm'",
    "description": "The courts have emerged as one of the main obstacles to the Trump administration's policies.",
    "link": "https://www.newsweek.com/donald-trump-suffers-double-deportation-loss-2073578",
    "timestamp": "2025-05-17T10:17:21Z"
  },
  {
    "title": "Left-wing extremism reflects psychological disorders, mental health professionals say - NewsBreak",
    "description": "Their images and videos became Exhibit A for the winning 2024 campaign of President Donald Trump and his loyal followers, as Democratic rival Kamala Harris",
    "link": "https://www.newsbreak.com/share/4010278562785-left-wing-extremism-reflects-psychological-disorders-mental-health-professionals-say?s=a2&amp;share_destination_id=MzI4NDE2NDQtMTc0NzQ3Njk3Nzg0NA%3D%3D&amp;pd=02DnbwWz&amp;hl=en_US&amp;send_time=1747476977&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v6%2Cns_local_strategy_25q1_exp-v11%2Cns_foryou_recall_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v7",
    "timestamp": "2025-05-17T10:16:51Z"
  },
  {
    "title": "Russia demanded Ukraine cede more territory at Turkey talks, Ukrainian source says",
    "description": "ISTANBUL (Reuters) -Russian negotiators at peace talks in Istanbul demanded Ukraine pull its troops out of all the Ukrainian regions claimed by Moscow before they would agree to a ceasefire, a senior Ukrainian official familiar with the talks told Reuters. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/05/17/russia-demanded-ukraine-cede-more-territory-at-turkey-talks-ukrainian-source-says",
    "timestamp": "2025-05-17T10:13:00Z"
  },
  {
    "title": "Federal funding for Hawaiian Home Lands on chopping block | Honolulu Star-Advertiser",
    "description": "The state agency helping Native Hawaiians with housing needs is at risk again of a federal funding cutoff.",
    "link": "https://www.staradvertiser.com/2025/05/17/hawaii-news/federal-funding-for-hawaiian-home-lands-on-chopping-block/",
    "timestamp": "2025-05-17T10:12:45Z"
  },
  {
    "title": "Left-wing extremism reflects psychological disorders, mental health professionals say - NewsBreak",
    "description": "Their images and videos became Exhibit A for the winning 2024 campaign of President Donald Trump and his loyal followers, as Democratic rival Kamala Harris",
    "link": "https://www.newsbreak.com/share/4010278562785-left-wing-extremism-reflects-psychological-disorders-mental-health-professionals-say?s=a2&amp;share_destination_id=MjkwODMzMzM4LTE3NDc0NzY2MTIxMTE%3D&amp;pd=0JgJ2I5i&amp;hl=en_US&amp;send_time=1747476612&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v6%2Cns_local_strategy_25q1_exp-v7",
    "timestamp": "2025-05-17T10:10:39Z"
  },
  {
    "title": "Silences and mumbling: What the leaked interview revealed about Joe Biden's memory lapse",
    "description": "Audio of President Joe Biden's interview with Special Counsel Robert Hur is out. It shows Biden struggling with memory. He had trouble recalling key details. These included his son's death year and Trump's election. The recordings offer insight into his cogni…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/silences-and-mumbling-what-the-leaked/articleshow/121233259.cms",
    "timestamp": "2025-05-17T10:06:28Z"
  },
  {
    "title": "Arrival of Afrikaners renews focus on plight of thousands of other refugees still in limbo",
    "description": "Resettlement groups say the arrival of the Afrikaners shows how the government can quickly move and hope others with long waits can come to the US.",
    "link": "https://www.usatoday.com/story/news/nation/2025/05/17/afrikaners-white-ethnic-group-south-africa-refugees/83655038007/",
    "timestamp": "2025-05-17T10:01:29Z"
  },
  {
    "title": "As Musk steps back, DOGE moves forward with more cuts, sweeping agency changes | CNN Politics",
    "description": "Elon Musk’s prominent role in President Donald Trump’s White House appears to be fading, but the tech billionaire’s brainchild — the budget-slashing Department of Government Efficiency — is poised to continue its work after his departure.",
    "link": "https://www.cnn.com/2025/05/17/politics/musk-doge-future",
    "timestamp": "2025-05-17T10:00:51Z"
  },
  {
    "title": "Trump’s Middle East trip handed Israel a historic opportunity — if it chooses to act, experts say",
    "description": "Despite headlines about a rift, President Donald Trump’s tour pressed Iran, advanced normalization and backed Israel’s security. Experts say that if Jerusalem acts, a historic opportunity awaits.",
    "link": "https://www.foxnews.com/world/trumps-middle-east-trip-handed-israel-historic-opportunity-chooses-act-experts-say",
    "timestamp": "2025-05-17T10:00:18Z"
  },
  {
    "title": "DAN GAINOR: Journalism's original spin. 7 ways the Tapper/Thompson Biden book attempts to absolve media",
    "description": "\"Original Sin\" by Jake Tapper and Alex Thompson explores President Joe Biden's decline. But the book wants to rewrite the legacy media's role in covering it up.",
    "link": "https://www.foxnews.com/opinion/dan-gainor-journalisms-original-spin-7-ways-tapper-thompson-biden-book-attempts-absolve-media",
    "timestamp": "2025-05-17T10:00:12Z"
  },
  {
    "title": "How Chinese Exporter Adapts to Thrive Amid US Tariff Relief From Geneva Deal",
    "description": "BEIJING (Sputnik), Tommy Yang - As the latest US-China trade deal signed this week in Geneva offered temporary relief from steep tariffs, a Shenzhen-based Chinese exporter shared with Sputnik her story of resilience and ingenuity, navigating escalating trade …",
    "link": "https://sputnikglobe.com/20250517/how-chinese-exporter-adapts-to-thrive-amid-us-tariff-relief-from-geneva-deal-1122071101.html",
    "timestamp": "2025-05-17T10:00:02Z"
  },
  {
    "title": "Trump’s White House accidentally admitted the truth about its tax plan",
    "description": "Earlier this week the White House published evidence that the president's \"big, beautiful bill\" hikes taxes on the poor to cut taxes for the rich.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trumps-white-house-accidentally-admitted-truth-tax-plan-rcna207301",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Trump’s Embrace of White South Africans Takes Dark, Unnerving New Turn",
    "description": "When President Donald Trump welcomed dozens of white South Africans into the United States this week after granting them refugee status, reporters reasonably asked him to square this with his suspension of refugee resettlement from, well, every other country …",
    "link": "https://newrepublic.com/article/195383/trump-south-africans-takes-immigration",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "What are the House primaries outside the Richmond area?",
    "description": "Here's a look at the June 17 House of Delegates primary races in 11 districts outside the Richmond region.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_2b4a3330-f45e-4818-a450-8007b6d1fbf6.html",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Dems fight for nominations in five Richmond-area House primaries",
    "description": "This year’s June 17 primary will decide which Democrats run in five Richmond region House of Delegates districts. Statewide, there are five more Democratic and eight Republican House primaries.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_04a4ea3e-0e9f-45cc-9b87-a3b069402f4d.html",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Let’s Start Talking About Jail Time for Trump and His MAGA Enablers",
    "description": "What’s in the water in the state of Maryland? Whatever it is, it’s certainly more invigorating than the sewage that Robert F. Kennedy Jr. and his grandchildren have been swimming in. A few weeks ago, one of the Old Line State’s senators, Chris Van Hollen, dro…",
    "link": "https://newrepublic.com/post/195324/trump-administration-crimes-jail-time",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "How President Donald Trump Became a Prophet",
    "description": "Manvir Singh writes about the mystical history predating the appeal of Donald Trump, as discussed in Singh’s book “Shamanism: The Timeless Religion.”",
    "link": "https://www.newyorker.com/culture/the-weekend-essay/the-president-who-became-a-prophet",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Behind the Birthright-Citizenship Case",
    "description": "The Trump Administration is trying to use the case to stop lower-court judges from issuing “nationwide injunctions” against its unconstitutional executive orders, Ruth Marcus writes.",
    "link": "https://www.newyorker.com/magazine/2025/05/26/behind-the-birthright-citizenship-case",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Rural voters are key to Trump's base. They're about to pay the price for his trade war.",
    "description": "After Walmart announced it would raise prices due to Trump's tariffs, Claire McCaskill explains how the GOP is punishing a key part of their base, rural voters.",
    "link": "https://www.msnbc.com/top-stories/latest/walmart-raise-prices-trump-tariffs-rcna207351",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Trump’s Russia-Ukraine peace talks are a thinly veiled attempt to mask the disturbing truth",
    "description": "President Donald Trump is denying a central cynical truth about the Russia-Ukraine war, and the U.S.'s efforts to help resolve it.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trumps-russia-ukraine-peace-talks-are-farce-rcna207156",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Joe Biden, Donald Trump, and the Challenges of Covering an Aging President",
    "description": "On The Political Scene, the Washington Roundtable discusses Biden’s deterioration, and how Trump’s bluster protects him from questions about age-related decline.",
    "link": "https://www.newyorker.com/podcast/political-scene/biden-trump-and-the-challenges-of-covering-an-aging-president",
    "timestamp": "2025-05-17T10:00:00Z"
  },
  {
    "title": "Russian drone strike in Ukraine kills 9, injures 4 after peace talks, officials say",
    "description": "A Russian drone strike hit a passenger bus in northeastern Ukraine on Saturday, killing nine people and injuring four others, according to Ukrainian officials.",
    "link": "https://www.foxnews.com/world/russian-drone-strike-ukraine-kills-9-injures-4-after-peace-talks-officials-say",
    "timestamp": "2025-05-17T09:53:03Z"
  },
  {
    "title": "Kremlin to announce if Putin and Trump decide to talk",
    "description": "Kremlin spokesman Dmitry Peskov said the Kremlin would inform the media if Russian President Vladimir Putin and United States President Donald Trump agree to speak about the recent Russia-Ukraine talk...",
    "link": "https://biztoc.com/x/718a613c358b887a",
    "timestamp": "2025-05-17T09:46:34Z"
  },
  {
    "title": "Boeing was the real winner of Donald Trump's trip to the Middle East",
    "description": "Donald Trump congratulated Boeing's CEO after signing a record-breaking order in Qatar.\nBrian Snyder/REUTERS\nBoeing secured a record-breaking $96 billion order from Qatar Airways during Donald Trump's trip.\nIt was one of several wins this week, showing the pl…",
    "link": "https://biztoc.com/x/5e008a115a17411f",
    "timestamp": "2025-05-17T09:46:29Z"
  },
  {
    "title": "Trump’s Big Beautiful Bill Is in Turmoil, but at Least He’s Getting a New Ride",
    "description": "We’re heading into the turbulent final stages of the Medicaid fight. Buckle up!",
    "link": "https://slate.com/news-and-politics/2025/05/trump-big-beautiful-bill-medicaid-cuts-republicans-qatar-plane.html",
    "timestamp": "2025-05-17T09:45:00Z"
  },
  {
    "title": "Boeing was the real winner of Donald Trump's trip to the Middle East",
    "description": "Boeing secured a record-breaking order from Qatar Airways and support from Donald Trump in valuable signs of confidence after tensions and turmoil.",
    "link": "https://www.businessinsider.com/boeing-donald-trump-middle-east-qatar-air-force-one-747-2025-5",
    "timestamp": "2025-05-17T09:42:01Z"
  },
  {
    "title": "Kremlin Names Condition for Putin-Zelensky Meeting",
    "description": "MOSCOW (Sputnik) - A meeting between Russian President Vladimir Putin and his Ukrainian counterpart Volodymyr Zelensky is possible if delegations of both countries reach certain agreements, Kremlin spokesman Dmitry Peskov said on Saturday.",
    "link": "https://sputnikglobe.com/20250517/kremlin-names-condition-for-putin-zelensky-meeting-1122070504.html",
    "timestamp": "2025-05-17T09:41:10Z"
  },
  {
    "title": "TV show where immigrants compete for US citizenship being considered by Trump administration",
    "description": "The Trump administration is considering a TV show whereby immigrants compete for the prize of US citizenship, the Department for Homeland Security has confirmed.",
    "link": "https://news.sky.com/story/tv-show-where-immigrants-compete-for-us-citizenship-being-considered-by-trump-administration-13369391",
    "timestamp": "2025-05-17T09:40:00Z"
  },
  {
    "title": "Iran says it will continue nuclear talks with the US, shrugging off Trump's threats",
    "description": "Iran's President Masoud Pezeshkian affirmed that nuclear talks with the United States will proceed. He stated that Iran will not relinquish its rights under the pressure. Donald Trump has warned of potential airstrikes if a deal is not reached. Mohammad Eslam…",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/iran-says-it-will-continue-nuclear-talks-with-the-us-shrugging-off-trumps-threats/articleshow/121232866.cms",
    "timestamp": "2025-05-17T09:38:58Z"
  },
  {
    "title": "I was in the courtroom for Diddy's trial. Cassie's testimony was more graphic than I ever imagined.",
    "description": "In the Sean \"Diddy\" Combs sex-trafficking trial, Cassie Ventura testified about the shocking, sordid moments in their 11-year relationship.",
    "link": "https://www.businessinsider.com/diddy-trial-cassie-testimony-inside-courtroom-2025-5",
    "timestamp": "2025-05-17T09:31:02Z"
  },
  {
    "title": "Moody’s delivers first US credit rating downgrade since 1917",
    "description": "The reduction comes shortly after the Treasury Secretary warned of a possible default by the end of summer Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617755-moodys-us-credit-rating-downgrade/",
    "timestamp": "2025-05-17T09:29:22Z"
  },
  {
    "title": "Nvidia CEO sees ‘no evidence’ of AI chip diversion into China",
    "description": "Huang spoke after joining a US delegation to the Middle East led by President Donald Trump, lauding the opening up of trade of Nvidia’s hardware.",
    "link": "https://biztoc.com/x/d2ee1affa2d9750b",
    "timestamp": "2025-05-17T09:24:21Z"
  },
  {
    "title": "Iran's Khamenei says Trump's comments on Tehran 'not worth responding to'",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei said on Saturday that US President Donald Trump's comments on his",
    "link": "https://www.jpost.com/breaking-news/article-854309",
    "timestamp": "2025-05-17T09:23:15Z"
  },
  {
    "title": "Israel carries out 'extensive strikes' in Gaza as it prepares to expand operations",
    "description": "Israel's military says it has been \"conducting extensive strikes and mobilising troops\" as part of preparations to expand operations in Gaza.",
    "link": "https://news.sky.com/story/israel-carries-out-extensive-strikes-in-gaza-as-it-prepares-to-expand-operations-13369386",
    "timestamp": "2025-05-17T09:16:00Z"
  },
  {
    "title": "Gone in 40 days: how Trump’s ‘liberation day’ tariff assault unraveled",
    "description": "The impact of those six chaotic weeks, from higher prices to slowing growth, is still unfolding, and the story continues\nDonald Trump hailed a new chapter in the US’s economic history on 2 April, dubbed “liberation day” by his administration, as he announced …",
    "link": "https://biztoc.com/x/7d3027ab9f2d8e1d",
    "timestamp": "2025-05-17T09:13:49Z"
  },
  {
    "title": "Trump's talking about a twin-engine F-35. It sounds like this F-55 could be a whole new plane",
    "description": "President Donald Trump floated the idea of redesigning Lockheed Martin's F-35 with two engines this week.\nAlex Wong/Getty Images\nTrump wants an F-35 stealth fighter with two engines because he doesn't like single-engine planes.\nHe wants to call this new twin-…",
    "link": "https://biztoc.com/x/d82f511381339643",
    "timestamp": "2025-05-17T09:13:45Z"
  },
  {
    "title": "Everstake defends non-custodial staking as SEC weighs industry input",
    "description": "The US Securities and Exchange Commission (SEC) has held discussions with Everstake, one of the largest non-custodial staking providers globally, to explore clearer regulatory definitions around staking in blockchain networks.The meeting, which also involved …",
    "link": "https://cointelegraph.com/news/everstake-defends-non-everstake-sec-non-custodial-staking-guidance-staking-as-sec-weighs-industry-input",
    "timestamp": "2025-05-17T09:12:28Z"
  },
  {
    "title": "Iran says it will continue nuclear talks with the US, shrugging off Trump's threats",
    "description": "Iran’s president says his country will continue talks over its rapidly advancing nuclear program but will not withdraw from its rights because of U.S. threats",
    "link": "https://abcnews.go.com/International/wireStory/iran-continue-nuclear-talks-us-shrugging-off-trumps-121900747",
    "timestamp": "2025-05-17T09:10:39Z"
  },
  {
    "title": "India and US at odds on Kashmir truce: analysts",
    "description": "US President Donald Trump’s claim to have helped end fighting between arch-rivals India and Pakistan has driven a wedge between him and Indian Prime Minister Narendra Modi, analysts say. A week since Trump announced a surprise truce between India and Pakistan…",
    "link": "https://www.digitaljournal.com/world/india-and-us-at-odds-on-kashmir-truce-analysts/article",
    "timestamp": "2025-05-17T09:07:20Z"
  },
  {
    "title": "India And US At Odds On Kashmir Truce: Analysts",
    "description": "US President Donald Trump's claim to have helped end fighting between arch-rivals India and Pakistan has driven a wedge between him and Indian Prime Minister Narendra Modi, analysts say.",
    "link": "https://www.ibtimes.com/india-us-odds-kashmir-truce-analysts-3773838",
    "timestamp": "2025-05-17T09:06:19Z"
  },
  {
    "title": "India And US At Odds On Kashmir Truce: Analysts",
    "description": "US President Donald Trump's claim to have helped end fighting between arch-rivals India and Pakistan has driven a wedge between him and Indian Prime Minister Narendra Modi, analysts say.",
    "link": "https://www.ibtimes.com.au/india-us-odds-kashmir-truce-analysts-1858910",
    "timestamp": "2025-05-17T09:06:12Z"
  },
  {
    "title": "Trump's talking about a twin-engine F-35. It sounds like this F-55 could be a whole new plane.",
    "description": "The president pitched plans on Thursday for a supercharged version of the F-35 with two engines, which would likely require building a new aircraft.",
    "link": "https://www.businessinsider.com/trump-f-55-twin-engine-f-35-fighter-new-plane-2025-5",
    "timestamp": "2025-05-17T09:06:02Z"
  }
]