[
  {
    "title": "Salvador man at center of Trump deportations row freed",
    "description": "A wrongly deported Salvadoran man returned to the US during a fierce row over President Donald Trump’s hardline immigration policies was released Friday from prison, where he had been detained on human smuggling charges, his lawyer told AFP. The US Supreme Co…",
    "link": "https://www.digitaljournal.com/world/salvador-man-at-center-of-trump-deportations-row-freed/article",
    "timestamp": "2025-08-22T20:52:20Z"
  },
  {
    "title": "Trump's Meandering Response To The John Bolton Raid",
    "description": "A sickly looking Donald Trump wore a ridiculous hat and looked tired at a press gaggle.\nHe said John Bolton could be unpatriotic, and he may have called for the raid, or he may not have called for the raid, but he is a top law enforcement officer of the count…",
    "link": "https://crooksandliars.com/2025/08/trumps-meandering-response-john-bolton",
    "timestamp": "2025-08-22T20:52:14Z"
  },
  {
    "title": "Fox News Contributor Slams Trump For FBI Raid On John Bolton's Home: 'Very Sad'",
    "description": "Former federal prosecutor Andrew McCarthy accused the president of engaging in so-called \"lawfare\" by reviving what he called an \"ancient feud.\"",
    "link": "https://www.huffpost.com/entry/fox-news-andrew-mccarthy-slams-trump-fbi-raid-john-bolton_n_68a8b04be4b0d5177bea510d",
    "timestamp": "2025-08-22T20:51:53Z"
  },
  {
    "title": "Donald Trump to Achieve the Largest Cut in Federal Workforce in 80 Years",
    "description": "In what is being called the largest single-year cut in civilian federal employment since World War II, 2025 will end with 300,000 fewer workers employed by the U.S. government.\nThe post Donald Trump to Achieve the Largest Cut in Federal Workforce in 80 Years …",
    "link": "https://www.breitbart.com/pre-viral/2025/08/22/trump-to-achieve-largest-cut-federal-workforce-80-years/",
    "timestamp": "2025-08-22T20:51:27Z"
  },
  {
    "title": "'I think the United States should be given 10% of Intel': US president Trump wants a piece of the action, says CEO Lip Bu Tan has already forked over $10 billion because he wants to 'keep his job'",
    "description": "The deal might already be done.",
    "link": "https://www.pcgamer.com/gaming-industry/i-think-the-united-states-should-be-given-10-percent-of-intel-us-president-trump-wants-a-piece-of-the-action-says-ceo-lip-bu-tan-has-already-forked-over-usd10-billion-because-he-wants-to-keep-his-job/",
    "timestamp": "2025-08-22T20:51:27Z"
  },
  {
    "title": "Salvador Man At Center Of Trump Deportations Row Freed",
    "description": "A wrongly deported Salvadoran man returned to the US during a fierce row over President Donald Trump's hardline immigration policies was released Friday from prison, where he had been detained on human smuggling charges, his lawyer told AFP.\nThe US Supreme Co…",
    "link": "https://www.ibtimes.com/salvador-man-center-trump-deportations-row-freed-3781494",
    "timestamp": "2025-08-22T20:51:18Z"
  },
  {
    "title": "Exclusive-Trump plans to make Cold War-era plutonium available for nuclear power",
    "description": "WASHINGTON (Reuters) -The Trump administration plans to make available about 20 metric tons of Cold War-era plutonium from dismantled nuclear warheads to U.S...",
    "link": "https://www.yahoo.com/news/articles/exclusive-trump-plans-cold-war-205110288.html",
    "timestamp": "2025-08-22T20:51:10Z"
  },
  {
    "title": "2026 World Cup draw will be held at Washington's Kennedy Center, Trump says",
    "description": "President Donald Trump said Friday that the draw for the 2026 World Cup will take place on Dec 5 at the Kennedy Center in Washington, and didn't rule out that he himself might oversee the event. “It’s the biggest, probably the biggest event in sports, I guess…",
    "link": "https://japantoday.com/category/sports/2026-world-cup-draw-will-be-held-at-washington%27s-kennedy-center-trump-says",
    "timestamp": "2025-08-22T20:51:07Z"
  },
  {
    "title": "B.C. jobs minister surprised at Ottawa's move to drop retaliatory tariffs against U.S.",
    "description": "Prime Minister Mark Carney said Friday that removing some retaliatory tariffs is the best approach for Canada at this stage in the trade war. B.C.'s jobs minister says he doesn't \"have as much faith\" as Carney that Trump will play ball.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/b-c-jobs-minister-retaliatory-tariffs-drop-1.7615886",
    "timestamp": "2025-08-22T20:51:07Z"
  },
  {
    "title": "Hegseth fires general whose agency's intel assessment of damage from Iran strikes angered Trump",
    "description": "Defense Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of damage to Iranian nuclear sites from U.S. strikes angered President Donald Trump, according to two people familiar with the decision and a White House officia…",
    "link": "https://japantoday.com/category/world/hegseth-fires-general-whose-agency%27s-intel-assessment-of-damage-from-iran-strikes-angered-trump",
    "timestamp": "2025-08-22T20:50:22Z"
  },
  {
    "title": "FBI searches home and office of ex-Trump national security adviser John Bolton",
    "description": "The FBI on Friday searched the Maryland home and Washington office of former Trump administration national security adviser John Bolton as part of a criminal investigation into the potential mishandling of classified information, a person familiar with the ma…",
    "link": "https://japantoday.com/category/world/fbi-searches-home-of-former-trump-national-security-adviser-john-bolton-ap-source-says",
    "timestamp": "2025-08-22T20:50:11Z"
  },
  {
    "title": "Gaza City officially in famine, with hunger spreading, says global hunger monitor",
    "description": "Gaza City and surrounding areas are officially suffering from famine, and it will likely spread, a global hunger monitor determined on Friday, an assessment that will escalate pressure on Israel to allow more aid into the Palestinian territory. The Integrated…",
    "link": "https://japantoday.com/category/world/gaza-city-officially-in-famine-with-hunger-spreading-says-global-hunger-monitor2",
    "timestamp": "2025-08-22T20:49:43Z"
  },
  {
    "title": "Trump threatens federal intervention in Chicago, government takeover in D.C",
    "description": "U.S. President Donald Trump on Friday said he would expand his crime crackdown to Chicago, using federal powers to intervene in another city governed by Democrats, and threatened to take full control of Washington, D.C., rather than only its policing. Saying …",
    "link": "https://japantoday.com/category/world/trump-threatens-federal-intervention-in-chicago-government-takeover-in-d.c",
    "timestamp": "2025-08-22T20:49:35Z"
  },
  {
    "title": "Trump says Intel agreed to give the government 10% of the chipmaker. ‘We do a lot of deals like that. I’ll do more of them’",
    "description": "Commerce Secretary Howard Lutnick previously said the U.S. government should receive equity in return for the CHIPS Act cash grants Intel has received.",
    "link": "https://fortune.com/2025/08/22/trump-intel-stock-10-percent-stake-tech-chipmakers/",
    "timestamp": "2025-08-22T20:49:31Z"
  },
  {
    "title": "Epstein associate Maxwell says she never saw Trump behave inappropriately",
    "description": "Ghislaine Maxwell, an associate of the late financier and sex offender Jeffrey Epstein, told a top Justice Department official in July that she never saw President Donald Trump in an &quot;inappropriate setting,&quot; according to a transcript of an interview…",
    "link": "https://japantoday.com/category/world/epstein-associate-maxwell-says-she-never-saw-trump-behave-inappropriately2",
    "timestamp": "2025-08-22T20:49:17Z"
  },
  {
    "title": "What To Watch This Weekend: New Shows And Movies To Stream On Netflix, Hulu, Prime Video, Apple TV And More",
    "description": "Everything new to stream this weekend on all your favorite streaming services from Netflix to Apple TV to Hulu and more.",
    "link": "https://www.forbes.com/sites/erikkain/2025/08/22/what-to-watch-this-weekend-new-shows-and-movies-to-stream-on-netflix-hulu-prime-video-apple-tv-and-more/",
    "timestamp": "2025-08-22T20:48:22Z"
  },
  {
    "title": "With no Ukraine peace deal, Trump again threatens Russia sanctions",
    "description": "U.S. President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in …",
    "link": "https://japantoday.com/category/world/with-no-ukraine-peace-deal-trump-again-threatens-russia-sanctions1",
    "timestamp": "2025-08-22T20:48:17Z"
  },
  {
    "title": "Ghislaine Maxwell told DOJ she did not see Trump act in ‘inappropriate way.’ Read the interview transcripts",
    "description": "The Trump administration issued hundreds of pages of transcripts from interviews that Deputy Attorney General Todd Blanche conducted with Ghislaine Maxwell last month as the administration was scrambling to present itself as transparent amid a fierce backlash…",
    "link": "https://www.pbs.org/newshour/politics/ghislaine-maxwell-told-doj-she-did-not-see-trump-act-in-inappropriate-way-read-the-interview-transcripts",
    "timestamp": "2025-08-22T20:48:09Z"
  },
  {
    "title": "The Resistance is Active in DC—You’re Just Not Looking Closely Enough",
    "description": "It’s 7 p.m. on Thursday and Elli, a 19-year-old transplant from Chattanooga, Tennessee, just took an Adderall. The DC resident, who goes by they/them pronouns and asked Mother Jones not to publish their last name, needed the boost of energy. They’re drained f…",
    "link": "https://www.motherjones.com/politics/2025/08/dc-pushback-national-gauard-ice-federal-agents-protest/",
    "timestamp": "2025-08-22T20:47:57Z"
  },
  {
    "title": "‘Waste, fraud, and abuse’: Senator delivers update on work of DOGE caucus",
    "description": "Joni Ernst: 'The days of bureaucrats 'working' from their bubble bath are over'",
    "link": "https://www.wnd.com/2025/08/waste-fraud-abuse-senator-delivers-update-work-doge/",
    "timestamp": "2025-08-22T20:46:55Z"
  },
  {
    "title": "'What is the point?' MSNBC flabbergasted by Ghislaine Maxwell's chat with Trump DOJ",
    "description": "MSNBC host Katy Tur was among those going through the transcript of the interview that President Donald Trump's former defense lawyer did with Jeffrey Epstein's accomplice, Ghislaine Maxwell. After what she read, she couldn't figure out the point of the inter…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-2673911990/",
    "timestamp": "2025-08-22T20:44:48Z"
  },
  {
    "title": "Ghislaine Maxwell Says She First Met Elon Musk at Sergey Brin’s Birthday Party",
    "description": "\"Don't know Ghislaine at all,\" Musk tweeted in 2020.",
    "link": "https://gizmodo.com/epstein-musk-maxwell-brin-google-trump-doj-interview-2000647044",
    "timestamp": "2025-08-22T20:44:41Z"
  },
  {
    "title": "Trump says Intel has agreed to sell stake to government",
    "description": "President Donald Trump said that the U.S. government is looking to take a 10% stake in struggling chipmaker Intel. \"They've ...",
    "link": "https://biztoc.com/x/7724614288c08946",
    "timestamp": "2025-08-22T20:44:11Z"
  },
  {
    "title": "‘Gentleman In All Respects’: Ghislaine Maxwell Insists Trump Never Acted Inappropriately With Epstein",
    "description": "Epstein associate Ghislaine Maxwell told U.S. attorneys in July that she \"never\" saw President Donald Trump \"in any inappropriate setting.\"",
    "link": "https://dailycaller.com/2025/08/22/gentleman-in-all-respects-ghislaine-maxwell-insists-trump-never-acted-inappropriately-with-epstein/",
    "timestamp": "2025-08-22T20:44:03Z"
  },
  {
    "title": "Ghislaine Maxwell Says She Never Saw Donald Trump Getting Massage From Minor Girls",
    "description": "Ghislaine Maxwell's drawing a hard line -- insisting she never saw Donald Trump tangled up in her and Jeffrey Epstein’s sordid business or doing anything remotely inappropriate with underage girls. The Justice Department just unsealed Maxwell’s…\n Permalink",
    "link": "https://www.tmz.com/2025/08/22/ghislaine-maxwell-donald-trump-massage-jeffrey-epstein-transcipt/",
    "timestamp": "2025-08-22T20:42:27Z"
  },
  {
    "title": "Ethereum Is Now More Valuable Than Palantir. Which Is a Better Buy: PLTR Stock or the ETH Crypto?",
    "description": "The data mining company has been the best-performing stock in the S&P 500, but Ethereum is on a great run right now.",
    "link": "https://www.barchart.com/story/news/34339559/ethereum-is-now-more-valuable-than-palantir-which-is-a-better-buy-pltr-stock-or-the-eth-crypto",
    "timestamp": "2025-08-22T20:41:47Z"
  },
  {
    "title": "U.S. takes 10% stake in Intel, Trump administration says",
    "description": "The Trump administration said Friday it took a 10% stake in Intel, President Donald Trump’s latest extraordinary move to exert government control over business.",
    "link": "https://biztoc.com/x/33ad82babbc6d37d",
    "timestamp": "2025-08-22T20:41:20Z"
  },
  {
    "title": "Trump threatens to fire Fed Governor Cook if she doesn't resign",
    "description": "President Donald Trump on Friday threatened to fire a member of the Federal Reserve's board of governors if she doesn't resign from her role.\nFederal Reserve Governor Lisa Cook is facing mortgage fraud allegations that are under investigation by the Departmen…",
    "link": "https://biztoc.com/x/f56eb1d3dfe16f6e",
    "timestamp": "2025-08-22T20:41:10Z"
  },
  {
    "title": "Trump says Intel has agreed to give U.S. a stake in its company. Here’s what to know",
    "description": "President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business. Speaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president c…",
    "link": "https://biztoc.com/x/d7bb7d21cd50dc75",
    "timestamp": "2025-08-22T20:40:54Z"
  },
  {
    "title": "Gavin Newsom's 2028 Chances Jump After Trolling Offensive Against Trump",
    "description": "Gavin Newsom's press office has been mocking President Trump with tweets in his style over the past few weeks.",
    "link": "https://www.newsweek.com/gavin-newsoms-2028-chances-jump-after-trolling-offensive-against-trump-2118007",
    "timestamp": "2025-08-22T20:40:44Z"
  },
  {
    "title": "Ghislaine Maxwell, who wants a pardon, says she never saw Donald Trump 'in any inappropriate setting' (Politico)",
    "description": "Politico:\nGhislaine Maxwell, who wants a pardon, says she never saw Donald Trump ‘in any inappropriate setting’ … The information in those files is not yet public.  The moves are part of the department's continued efforts to quell the uproar from Trump's MAGA…",
    "link": "https://www.memeorandum.com/250822/p107",
    "timestamp": "2025-08-22T20:40:01Z"
  },
  {
    "title": "Trump says Intel agreed to give US a stake in its company",
    "description": "President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-intel-agreed-give-us-stake-company-124897729",
    "timestamp": "2025-08-22T20:38:35Z"
  },
  {
    "title": "Chip Roy is running for Texas AG — First campaign video",
    "description": "Texas has a long and proud tradition of rising to defend our homes, our freedom, and our communities. I’m running for Attorney General to carry on that legacy… unafraid to fight, unafraid to win, and unafraid to defend Texas at every turn.",
    "link": "https://freerepublic.com/focus/f-bloggers/4336165/posts",
    "timestamp": "2025-08-22T20:37:57Z"
  },
  {
    "title": "Pete Hegseth just fired a top general who pissed off Trump",
    "description": "Inconvenient truths don’t go unpunished in the Trump administration. It’s a lesson that Lt. Gen. Jeffrey Kruse learned the hard way on Friday, as The Washington Post reported that he’s been fired from his position as chief of the Defense Intelligence Agency b…",
    "link": "https://newrepublic.com/post/199485/pete-hegseth-jeffrey-kruse-iran-donald-trump",
    "timestamp": "2025-08-22T20:36:52Z"
  },
  {
    "title": "Trump's command economy",
    "description": "It appears that Trump has successfully extorted $10 billion from Intel CEO Lip-Bu Tan whom he has previously derided as in cahoots with China",
    "link": "http://thespectator.com/topic/trumps-command-economy/",
    "timestamp": "2025-08-22T20:36:30Z"
  },
  {
    "title": "Ghislaine Maxwell Accused of 'Protecting' Trump and Claims Epstein Was 'Murdered' in Just-Released Bombshell Interview — As Jailed Madam Begs For Early Release",
    "description": "Ghislaine Maxwell's bombshell interview revelations saw her accused of 'protecting' Donald Trump, and claiming Jeffrey Epstein was killed.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-protecting-trump-epstein-murdered-justice-department/",
    "timestamp": "2025-08-22T20:36:05Z"
  },
  {
    "title": "Wrongfully deported Kilmar Abrego Garcia released from Tennessee jail",
    "description": "Abrego Garcia will return to family as he awaits trial over alleged human smuggling brought by Trump administration.",
    "link": "https://www.aljazeera.com/news/2025/8/22/wrongfully-deported-kilmar-abrego-garcia-released-from-tennessee-jail",
    "timestamp": "2025-08-22T20:35:18Z"
  },
  {
    "title": "Trump, 79, Smears Right Hand In Makeup Amid Cankles Cover-Up (Sarah Ewall-Wice/The Daily Beast)",
    "description": "Sarah Ewall-Wice / The Daily Beast:\nTrump, 79, Smears Right Hand In Makeup Amid Cankles Cover-Up  —  BAD BLEND  —  The 79-year-old president had a glob of cover-up on his hand as he ventured out in Washington.  —  President Donald Trump's hand was coated in a…",
    "link": "https://www.memeorandum.com/250822/p106",
    "timestamp": "2025-08-22T20:35:00Z"
  },
  {
    "title": "Democrat consultants tell politicians to stop using terms like 'LGBTQIA' and 'cisgender'",
    "description": "If you ask this consulting firm, Democrats aren't unpopular because they compromise with Republicans to maintain their corporate interests — it's because they talk about the rights of LGBTQ+ people and other minorities too much.",
    "link": "https://www.advocate.com/politics/democrat-consultants-words-avoid-lgbtq",
    "timestamp": "2025-08-22T20:34:44Z"
  },
  {
    "title": "The News Roundup For August 22, 2025",
    "description": "President Donald Trump is continuing his efforts to <a href=\"https://www.washingtonpost.com/politics/2025/08/20/trump-resignation-fed-governor-cook/\"target=\"_blank\"   >influence the Federal Reserve.</a> <br><br>He’s calling on one of its governors to resign, …",
    "link": "https://www.npr.org/2025/08/22/nx-s1-5511239/the-news-roundup-for-august-22-2025",
    "timestamp": "2025-08-22T20:34:01Z"
  },
  {
    "title": "10 Most Shocking Discoveries From The John Bolton FBI Raid",
    "description": "The Maryland home of former National Security Advisor John Bolton was raided by government agents today, leaving the public wondering what the FBI was looking for — and what they found.",
    "link": "https://babylonbee.com/news/10-most-shocking-discoveries-from-the-john-bolton-fbi-raid",
    "timestamp": "2025-08-22T20:32:41Z"
  },
  {
    "title": "Republicans started the redistricting arms race. It’s up to Democrats to finish it.",
    "description": "Chris Hayes urges Democrats to follow California's lead on redistricting as Republicans and Trump look to crack and pack districts ahead of the midterm election.",
    "link": "https://www.msnbc.com/top-stories/latest/california-texas-redistricting-trump-congress-control-rcna226645",
    "timestamp": "2025-08-22T20:32:41Z"
  },
  {
    "title": "Hegseth fires general whose agency’s intel assessment of damage from Iran strikes angered Trump | CNN Politics",
    "description": "Defense Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of damage to Iranian nuclear sites from US strikes angered President Donald Trump, according to two people familiar with the decision and a White House official.",
    "link": "https://www.cnn.com/2025/08/22/politics/hegseth-fires-head-of-defense-intelligence-agency",
    "timestamp": "2025-08-22T20:32:02Z"
  },
  {
    "title": "Trump says Intel has agreed to give U.S. a stake in its company. Here’s what to know",
    "description": "President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business. Speaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president c…",
    "link": "https://www.pbs.org/newshour/politics/trump-says-intel-has-agreed-to-give-u-s-a-stake-in-its-company-heres-what-to-know",
    "timestamp": "2025-08-22T20:31:37Z"
  },
  {
    "title": "U.S. takes 10% stake in Intel, Trump administration says",
    "description": "The Trump administration said Friday it took a 10% stake in Intel, President Donald Trump’s latest extraordinary move to exert government control over business.",
    "link": "https://www.nbcnews.com/business/business-news/intel-agrees-us-stake-in-company-how-much-what-to-know-rcna226667",
    "timestamp": "2025-08-22T20:31:15Z"
  },
  {
    "title": "Trump: Furniture tariffs coming",
    "description": "United States President Donald Trump announced on Friday that more products will be added to his tariff list, now listing furniture coming into the US as one of them.More to come......",
    "link": "https://biztoc.com/x/40aae12fe7fc9a44",
    "timestamp": "2025-08-22T20:30:10Z"
  },
  {
    "title": "Trump says Intel CEO agreed to give the US a 10% stake | CNN Business",
    "description": "President Donald Trump said on Friday he reached an agreement with Intel CEO Lip-Bu Tan that would involve the struggling chipmaker giving the United States a company stake worth $10 billion, a deal model that Trump said he hopes to revisit with other compani…",
    "link": "https://www.cnn.com/2025/08/22/tech/trump-intel-10-percent-stake",
    "timestamp": "2025-08-22T20:30:01Z"
  },
  {
    "title": "Boca Raton board approves Batmasians’ project near Mizner Park",
    "description": "Boca Raton’s Planning & Zoning Board voted in favor of developers James and Marta Batmasian’s proposal to build a mixed-use hotel near the Mizner Park shopping and entertainment district. Despite pleas from downtown area condo residents, the board voted 5 to …",
    "link": "https://therealdeal.com/miami/2025/08/22/batmasians-score-approval-for-boca-raton-hotel-near-mizner/",
    "timestamp": "2025-08-22T20:29:32Z"
  },
  {
    "title": "Donald Trump Is Waging a Whole-of-Government Retribution Campaign",
    "description": "The Trump administration’s campaign of vengeance against perceived political enemies escalated Friday morning when the FBI raided the home and office of former national security adviser John Bolton, a vocal Trump critic. That search follows Attorney General P…",
    "link": "https://www.motherjones.com/politics/2025/08/donald-trump-bolton-raid-patel-bondi-martin-pulte/",
    "timestamp": "2025-08-22T20:27:33Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "A federal website that informs the public about data collection has gone down, causing concern among advocates",
    "link": "https://www.ketv.com/article/federal-data-website-outage-raises-concerns/65867583",
    "timestamp": "2025-08-22T20:25:29Z"
  },
  {
    "title": "Ghislaine Maxwell Reveals Whether She Witnessed Bill Clinton Getting A Massage",
    "description": "Ghislaine Maxwell said that she does not believe that former President Bill Clinton ever received a massage aboard Jeffrey Epstein's plane.",
    "link": "https://dailycaller.com/2025/08/22/ghislaine-maxwell-bill-clinton-massage-epstein/",
    "timestamp": "2025-08-22T20:24:56Z"
  },
  {
    "title": "Texas Democrat Rep. Lloyd Doggett Announces Potential Retirement",
    "description": "Texas Democrat Congressman Lloyd Doggett has announced he will not seek reelection if Republicans’ new congressional map becomes the law of the land in the... Read More\nThe post Texas Democrat Rep. Lloyd Doggett Announces Potential Retirement appeared first o…",
    "link": "https://www.dailysignal.com/2025/08/22/texas-democrat-rep-lloyd-doggett-announces-potential-retirement/",
    "timestamp": "2025-08-22T20:23:09Z"
  },
  {
    "title": "Kilmar Abrego Garcia released from jail and retuning to Maryland",
    "description": "The El Salvadoran was mistakenly deported by the Trump administration but was brought back to face human smuggling charges.",
    "link": "https://www.bbc.com/news/articles/c5y0720p0x5o",
    "timestamp": "2025-08-22T20:22:35Z"
  },
  {
    "title": "Was There a Side Deal Between Donald Trump and David Ellison?",
    "description": "Two leading House Democrats are now investigating the terms of the settlement between Paramount and the President, with the aim of answering whether David Ellison offered \"a bribe.\"",
    "link": "http://www.hollywoodreporter.com/business/business-news/paramount-trump-side-deal-1236350919/",
    "timestamp": "2025-08-22T20:21:23Z"
  },
  {
    "title": "Oil Rises on Fed Rate Cut Hopes",
    "description": "Oil prices inched higher after Fed Chair Powell signaled a possible September rate cut.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_on_fed_rate_cut_hopes-22-aug-2025-181562-article/",
    "timestamp": "2025-08-22T20:21:10Z"
  },
  {
    "title": "Epstein associate Maxwell says she never saw Trump behave inappropriately (Luc Cohen/Reuters)",
    "description": "Luc Cohen / Reuters:\nEpstein associate Maxwell says she never saw Trump behave inappropriately  —  Ghislane Maxwell, an associate of the late financier and sex offender Jeffrey Epstein, told a top Justice Department official last month that she never saw Pres…",
    "link": "https://www.memeorandum.com/250822/p102",
    "timestamp": "2025-08-22T20:20:00Z"
  },
  {
    "title": "The Retribution Phase of Trump's Presidency Has Begun (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nThe Retribution Phase of Trump's Presidency Has Begun  —  There was a certain awful predictability about the F.B.I.'s Friday-morning raids targeting the former Trump adviser turned critic John Bolton.  —  It's not like he was hi…",
    "link": "https://www.memeorandum.com/250822/p100",
    "timestamp": "2025-08-22T20:20:00Z"
  },
  {
    "title": "Ghislaine Maxwell interview released by DOJ (CNBC)",
    "description": "CNBC:\nGhislaine Maxwell interview released by DOJ … A top Department of Justice official questioned imprisoned Jeffrey Epstein accomplice Ghislaine Maxwell about interactions with President Donald Trump — Epstein's former friend — during a two-day interview i…",
    "link": "https://www.memeorandum.com/250822/p101",
    "timestamp": "2025-08-22T20:20:00Z"
  },
  {
    "title": "What Ghislaine Maxwell told deputy AG about former President Bill Clinton",
    "description": "Maxwell said that Bill Clinton never visited Epstein's private island estate.",
    "link": "https://abcnews.go.com/US/ghislaine-maxwell-told-deputy-ag-former-president-bill/story?id=124898831",
    "timestamp": "2025-08-22T20:20:00Z"
  },
  {
    "title": "‘South Park’ Is Going After Trump Like Never Before. It’s Exactly What We Need Right Now.",
    "description": "- snip - Satan has taken up residence in the White House. This isn’t a play-by-play of the current news cycle in America, although it surely sounds like it. This is, in fact, the latest episode of “South Park,” once again scathingly calling out the Trump admi…",
    "link": "https://freerepublic.com/focus/f-chat/4336163/posts",
    "timestamp": "2025-08-22T20:20:00Z"
  },
  {
    "title": "MI6 and CIA: Will Broken Bromance Lead to Divide on Ukraine?",
    "description": "\"There is now a cooling of the relationship between the US and British governments, and particularly between the CIA and MI6,\" retired CIA officer and State Department official Larry Johnson tells Sputnik.",
    "link": "https://sputnikglobe.com/20250822/mi6-and-cia-will-broken-bromance-lead-to-divide-on-ukraine-1122661984.html",
    "timestamp": "2025-08-22T20:18:48Z"
  },
  {
    "title": "Lorne Michaels Teases ‘Saturday Night Live’ Cast Shake-Up Ahead Of Season 51",
    "description": "Michaels said any updates to the cast will \"be announced in a week or so.\"",
    "link": "https://decider.com/2025/08/22/lorne-michaels-saturday-night-live-cast-season-51/",
    "timestamp": "2025-08-22T20:18:45Z"
  },
  {
    "title": "Ghislaine Maxwell interview transcripts released by Justice Department",
    "description": "The Department of Justice has released transcripts and audio files of from a recent interview with Jeffery Epstein's accomplice, Ghislaine Maxwell. The transcripts show Maxwell denied the existence of a client list, claims she never witnessed wrongdoing by Do…",
    "link": "https://biztoc.com/x/43ecd4feeac97d51",
    "timestamp": "2025-08-22T20:18:43Z"
  },
  {
    "title": "National Guard in Washington DC to be armed amid crime crackdown",
    "description": "Donald Trump has suggested he could extend the mission and declare a national emergency.",
    "link": "https://www.bbc.com/news/articles/cd7yperjxneo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-22T20:18:23Z"
  },
  {
    "title": "National Guard in Washington DC to be armed amid crime crackdown",
    "description": "Donald Trump has suggested he could extend the mission and declare a national emergency.",
    "link": "https://www.bbc.com/news/articles/cd7yperjxneo",
    "timestamp": "2025-08-22T20:18:19Z"
  },
  {
    "title": "Hegseth fires general whose agency’s intel assessment of U.S. strikes on Iran angered Trump",
    "description": "Defense Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of damage to Iranian nuclear sites from U.S. strikes angered President Donald Trump, according to two people familiar with the decision and a White House officia…",
    "link": "https://biztoc.com/x/1d1221f67bee3ea0",
    "timestamp": "2025-08-22T20:18:15Z"
  },
  {
    "title": "Trump’s Distortions on Cashless Bail",
    "description": "Since announcing the temporary federal takeover of Washington, D.C.'s, law enforcement, President Donald Trump has repeatedly criticized state laws limiting the use of cash bail. But his arguments have strayed from the facts in three key areas.\nThe post Trump…",
    "link": "https://www.factcheck.org/2025/08/trumps-distortions-on-cashless-bail/",
    "timestamp": "2025-08-22T20:16:58Z"
  },
  {
    "title": "Dow closes up 840 points after Fed Chair Powell signals possible interest rate cut",
    "description": "Dow closes up 840 points after Fed Chair Powell signals possible interest rate cutgo.com",
    "link": "https://abcnews.go.com/Business/dow-closes-840-points-after-fed-chair-powell/story?id=124897730",
    "timestamp": "2025-08-22T20:16:41Z"
  },
  {
    "title": "Netanyahu to OAN: Hamas starving hostages while media spreads lies",
    "description": "In an exclusive interview with One America News, PM Netanyahu discusses the Gaza war, the propaganda against Israel, and his strong alliance with President Donald Trump, emphasizing that Hamas starves hostages.(Israel National News' North American desk is kee…",
    "link": "https://www.israelnationalnews.com/flashes/664874",
    "timestamp": "2025-08-22T20:15:14Z"
  },
  {
    "title": "Netanyahu to OAN: Hamas starving hostages while media spreads lies",
    "description": "In an exclusive interview with One America News, PM Netanyahu discusses the Gaza war, the propaganda against Israel, and his strong alliance with President Donald Trump, emphasizing that Hamas starves hostages.",
    "link": "https://www.israelnationalnews.com/news/413719",
    "timestamp": "2025-08-22T20:15:13Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "A federal website that informs the public about data collection has gone down, causing concern among advocates",
    "link": "https://www.wmtw.com/article/federal-data-website-outage-raises-concerns/65867583",
    "timestamp": "2025-08-22T20:15:00Z"
  },
  {
    "title": "Ghislaine Maxwell Doesn’t Remember Trump Giving Epstein A Birthday Card",
    "description": "Ghislaine Maxwell does not remember President Donald Trump giving Jeffrey Epstein a birthday card, she said during her Department of Justice (DOJ) interview.",
    "link": "https://dailycaller.com/2025/08/22/ghislaine-maxwell-doesnt-remember-trump-giving-epstein-birthday-card/",
    "timestamp": "2025-08-22T20:14:32Z"
  },
  {
    "title": "Hegseth fires general whose agency’s intel assessment of U.S. strikes on Iran angered Trump",
    "description": "Defense Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of damage to Iranian nuclear sites from U.S. strikes angered President Donald Trump, according to two people familiar with the decision and a White House officia…",
    "link": "https://www.pbs.org/newshour/politics/hegseth-fires-general-whose-agencys-intel-assessment-of-u-s-strikes-on-iran-angered-trump",
    "timestamp": "2025-08-22T20:11:06Z"
  },
  {
    "title": "Inflation bites: Impact on the UK economy revealed",
    "description": "Inflation dangers: Low-income consumers tend to spend a higher proportion of their incomes on necessities than those with higher incomes. They have less of a cushion against the loss of purchasing power that’s inherent in inflation.\nThe post Inflation bites: …",
    "link": "https://www.digitaljournal.com/business/inflation-bites-impact-on-the-uk-economy-revealed/article",
    "timestamp": "2025-08-22T20:11:05Z"
  },
  {
    "title": "Four Perfect Airplane Movies",
    "description": "And two other ways to enjoy your flight.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/airplane-movie-recommendations/683985/",
    "timestamp": "2025-08-22T20:11:00Z"
  },
  {
    "title": "Ghislaine Maxwell: ‘I never witnessed the president in any inappropriate setting in any way’",
    "description": "Tapes of interview released as Dems' demands for Jeffrey Epstein 'client list' surge",
    "link": "https://www.wnd.com/2025/08/ghislaine-maxwell-i-never-witnessed-president-any-inappropriate/",
    "timestamp": "2025-08-22T20:10:19Z"
  },
  {
    "title": "Hegseth fires general whose agency's intel assessment of damage from Iran strikes angered Trump (Associated Press)",
    "description": "Associated Press:\nHegseth fires general whose agency's intel assessment of damage from Iran strikes angered Trump  —  Defense Secretary Pete Hegseth has fired a general whose agency's initial intelligence assessment of damage to Iranian nuclear sites from U.S…",
    "link": "https://www.memeorandum.com/250822/p98",
    "timestamp": "2025-08-22T20:10:00Z"
  },
  {
    "title": "Five Wins That Trump’s New Deputy FBI Director Scored as Missouri Attorney General",
    "description": "President Donald Trump announced this week that Missouri’s Republican attorney general, Andrew Bailey, will join Dan Bongino as co-deputy director of the FBI. “He has... Read More\nThe post Five Wins That Trump’s New Deputy FBI Director Scored as Missouri Atto…",
    "link": "https://www.dailysignal.com/2025/08/22/five-wins-trumps-new-deputy-fbi-director-scored-missouri-attorney-general/",
    "timestamp": "2025-08-22T20:10:00Z"
  },
  {
    "title": "Intel agrees to give US a stake in its company, Trump says",
    "description": "Speaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president called for Tan to resign over his past ties to China.",
    "link": "https://www.4029tv.com/article/trump-intel-agreed-give-us-stake-in-company/65874278",
    "timestamp": "2025-08-22T20:07:35Z"
  },
  {
    "title": "Trump Says Kennedy Center to Host 2026 World Cup Draw",
    "description": "President Donald Trump announced that Washington’s John F. Kennedy Center for the Performing Arts will host the draw for the 2026 FIFA World Cup. #fifa #worldcup #worldnews #politics #trump #messi #soccer #futbol \nThe draw will be held on Dec. 5, Trump said F…",
    "link": "https://biztoc.com/x/07bd32df32b67e60",
    "timestamp": "2025-08-22T20:07:28Z"
  },
  {
    "title": "Trump says Intel agreed to a $10 billion deal with the US government, sending stock up over 6%",
    "description": "\"We have to. They have to be able to defend themselves,\" President Donald Trump said of the US plans to send Ukraine weapons.\nJoe Raedle via Getty Images\nPresident Donald Trump on Friday said that Intel has agreed to a $10 billion deal with the US government.…",
    "link": "https://biztoc.com/x/968971e4e208f4b0",
    "timestamp": "2025-08-22T20:07:19Z"
  },
  {
    "title": "Intel agrees to give US a 10% stake in company, Trump says",
    "description": "By Michelle L. Price and Michael Liedtke | Associated Press\nWASHINGTON — President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business.\nSpeaking with reporters on Friday, Trump said the deal came out of a meeting la…",
    "link": "https://biztoc.com/x/b75b795405508d04",
    "timestamp": "2025-08-22T20:07:05Z"
  },
  {
    "title": "Kilmar Abrego Garcia freed from Tennessee jail to rejoin family in Maryland and await trial",
    "description": "The Salvadoran national’s case became a flashpoint in President Donald Trump’s immigration agenda after he was mistakenly deported in March. Facing a court order, the Trump administration brought him back to the U.S. in June, only to detain him on criminal ch…",
    "link": "https://biztoc.com/x/37ba323cffb0ddd6",
    "timestamp": "2025-08-22T20:06:58Z"
  },
  {
    "title": "Ghislaine Maxwell reveals truth about Donald Trump’s role in Jeffrey Epstein scandal",
    "description": "Ghislaine Maxwell transcript: The US Justice Department has released Ghislaine Maxwell's interview transcripts amid criticism over withheld Epstein case records. Maxwell, convicted of sex trafficking, recalled meeting Donald Trump in 1990 through her father, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/ghislaine-maxwell-transcript-reveals-truth-about-donald-trumps-role-in-jeffrey-epstein-scandal/articleshow/123462208.cms",
    "timestamp": "2025-08-22T20:06:49Z"
  },
  {
    "title": "Hegseth fires head of Defense Intelligence Agency",
    "description": "The firing follows the agency's June initial assessment indicating strikes against Iran’s nuclear facilities had more limited effect than Trump said.",
    "link": "https://www.nbcnews.com/politics/national-security/hegseth-fires-head-defense-intelligence-agency-rcna226677",
    "timestamp": "2025-08-22T20:06:22Z"
  },
  {
    "title": "Trump says U.S. gov't will take a 10% ownership stake in Intel — Lip Bu-Tan reportedly agreed to unprecedented arrangement for a domestic chipmaker",
    "description": "President Trump says that the US government and Intel have come to a deal to give the US a 10% stake in the chipmaker's business.",
    "link": "https://www.tomshardware.com/tech-industry/big-tech/trump-says-u-s-govt-will-take-a-10-percent-ownership-stake-in-intel-lip-bu-tan-reportedly-agreed-to-unprecedented-arrangement-for-a-domestic-chipmaker",
    "timestamp": "2025-08-22T20:03:53Z"
  },
  {
    "title": "Transgenderism Among Youth Continues To Grow",
    "description": "More than 3% of youth aged 13 to 17 now think they are transgender, a new report released Wednesday found.",
    "link": "https://dailycaller.com/2025/08/22/transgenderism-among-youth-continues-to-grow/",
    "timestamp": "2025-08-22T20:03:34Z"
  },
  {
    "title": "Hegseth fires general whose agency’s intel assessment of damage from Iran strikes angered Trump",
    "description": "Defense Secretary Pete Hegseth has fired a general whose agency’s initial intelligence assessment of damage to Iranian nuclear sites from U.S. strikes angered President Donald Trump, according to two people familiar with the decision and a White House officia…",
    "link": "https://freerepublic.com/focus/f-news/4336161/posts",
    "timestamp": "2025-08-22T20:02:46Z"
  },
  {
    "title": "Ghislaine Maxwell Told Trump’s DOJ She’s ‘Always Liked’ and ‘Admires’ Him",
    "description": "The Justice Department released transcripts of its interview with Jeffrey Epstein accomplice Ghislaine Maxwell, who said she has “always liked” Trump.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-epstein-ghislaine-maxwell-doj-interview-transcript-1235414168/",
    "timestamp": "2025-08-22T20:02:36Z"
  },
  {
    "title": "Russia Bombed a U.S. Factory in Ukraine. Here’s How Trump Responded.",
    "description": "If another country were to bomb an American-owned factory on foreign soil, one might expect—at the very least—harsh condemnation from the sitting U.S. president.The anticipated response from a president who enjoys a reputation as both a champion of American b…",
    "link": "https://newrepublic.com/post/199482/russia-bombed-us-factory-ukraine-trump-putin",
    "timestamp": "2025-08-22T20:02:36Z"
  },
  {
    "title": "Trump says Intel agreed to a $10 billion deal with the US government, sending stock up over 6%",
    "description": "A US investment in Intel would be a remarkable development and a rare example of the government taking a stake in a private company.",
    "link": "https://www.businessinsider.com/trump-says-intel-agreed-us-investment-deal-stock-price-2025-8",
    "timestamp": "2025-08-22T20:02:33Z"
  },
  {
    "title": "Another 'Trump Burger' Owner Was Detained By ICE. His Lawyer Says They’re ‘Waiting For Him To Die’",
    "description": "Iyad Abuelhawa, who founded the President Donald Trump-themed restaurant, was convicted in 2007 on charges accusing him of administering fake flu vaccines.",
    "link": "https://www.huffpost.com/entry/iyad-abuelhawa-trump-burger-detained_n_68a8a692e4b0371e6a9ad3f0",
    "timestamp": "2025-08-22T20:02:28Z"
  }
]