[
  {
    "title": "Trump calls for jailing Illinois leaders over National Guard dispute",
    "description": "Trump says the Illinois governor and Chicago mayor should be jailed as they oppose his deployment of National Guard troops for his immigration and crime crackdown in the nation's third-largest city.",
    "link": "https://www.wmur.com/article/trump-national-guard-chicago-illinois-leaders/68905815",
    "timestamp": "2025-10-08T17:41:31Z"
  },
  {
    "title": "Omar Says Trump Plot to Invoke Insurrection Act ‘Another Unhinged Act of Authoritarianism’",
    "description": "President Donald Trump was nonchalant in his response to a question on Tuesday about the potential invocation of the Insurrection Act, which authorizes the president to deploy military forces inside the country to suppress rebellion, violence, or enforce the …",
    "link": "https://www.commondreams.org/news/ilhan-omar-trump",
    "timestamp": "2025-10-08T17:40:47Z"
  },
  {
    "title": "Supreme Court ruling could let GOP add 19 House seats and “clear the path for a one-party system”",
    "description": "Supreme Court case could wipe out all Democratic-held seats in some deep-red Southern states.",
    "link": "https://www.salon.com/2025/10/08/supreme-court-ruling-could-let-gop-add-19-house-seats-and-clear-the-path-for-a-one-party-system/",
    "timestamp": "2025-10-08T17:40:38Z"
  },
  {
    "title": "Comey pleads not guilty",
    "description": "Former FBI Director James Comey pled not guilty at his arraignment on Wednesday. He faces federal charges from the Department of Justice for obstructing a congressional proceeding and making false statements. The charges are related to his testimony before th…",
    "link": "https://www.theblaze.com/news/comey-pleads-not-guilty",
    "timestamp": "2025-10-08T17:40:21Z"
  },
  {
    "title": "Roberts Court to invent inalienable right to impose disabilities on LGBTQ people",
    "description": "Apparently in consecutive terms the Republican Six are going to rule that states can ban medical treatments for trans people that doctors think are appropriate but cannot ban “gender conversion” therapy that vast majorities of doctors consider harmful and cou…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/roberts-court-to-invent-inalienable-right-to-impose-disabilities-on-lgbtq-people",
    "timestamp": "2025-10-08T17:38:28Z"
  },
  {
    "title": "ROOKE: Trump Scores Major Optics Win In Schumer Shutdown Battle",
    "description": "President Trump has found a way to fund federal programs, despite Senate Democrats, led by Minority Leader Chuck Schumer, keeping the government shut down.",
    "link": "https://dailycaller.com/2025/10/08/rooke-trump-wic-military-tariff-schumer-shutdown-battle/",
    "timestamp": "2025-10-08T17:36:35Z"
  },
  {
    "title": "Trump Calls for Chicago Mayor, Illinois Governor to Be Put “in Jail”",
    "description": "Illinois Gov. JB Pritzker responded by saying that Trump is “on the path to full-blown authoritarianism.”…",
    "link": "https://truthout.org/articles/trump-calls-for-chicago-mayor-illinois-governor-to-be-put-in-jail/",
    "timestamp": "2025-10-08T17:36:14Z"
  },
  {
    "title": "AMD's deal with OpenAI gives Nvidia much-needed challenger in market it dominates",
    "description": "The last time AMD played the role of distant challenger Intel was the giant in semiconductors.",
    "link": "https://www.cnbc.com/2025/10/08/amd-deal-with-openai-gives-nvidia-a-needed-challenger-in-ai-chips.html",
    "timestamp": "2025-10-08T17:35:47Z"
  },
  {
    "title": "WATCH: ‘Do your damn job,’ federal worker union leaders tell Congress mired in shutdown",
    "description": "Union leaders criticized both parties in Congress but also targeted President Donald Trump, accusing him of using federal workers as “political pawns” after warnings Tuesday that back pay is not guaranteed.",
    "link": "https://www.pbs.org/newshour/politics/watch-do-your-damn-job-federal-worker-union-leaders-tell-congress-mired-in-shutdown",
    "timestamp": "2025-10-08T17:35:23Z"
  },
  {
    "title": "UFC's Bruce Buffer says it will be an 'honor' to be at White House: 'It's gonna be amazing'",
    "description": "UFC ring announcer Bruce Buffer said it was an “honor\" to have the opportunity to step inside the Octagon at next year’s UFC event at the White House.",
    "link": "https://www.foxnews.com/sports/ufcs-bruce-buffer-says-honor-white-house-its-gonna-amazing",
    "timestamp": "2025-10-08T17:32:59Z"
  },
  {
    "title": "Judge Grants NYT’s Demand for List of Elon Musk’s Security Clearances, Citing His Own Public Admissions",
    "description": "A federal judge in New York granted a summary judgment motion to The New York Times regarding its public records request for a list of Elon Musk's security clearances -- and Musk's own public comments are a major reason why.\nThe post Judge Grants NYT’s Demand…",
    "link": "https://www.mediaite.com/lawcrime/judge-grants-nyts-demand-for-list-of-elon-musks-security-clearances-citing-his-own-public-admissions/",
    "timestamp": "2025-10-08T17:32:45Z"
  },
  {
    "title": "Israel to spend up to $4.1M to bolster support among Christians in western US, filings show",
    "description": "With its popularity in the United States crashing, Israel is bankrolling what organizers say will be the largest campaign of its kind to bolster support among evangelical churches, until recently seen as an unshakable base of support for the Jewish state. Isr…",
    "link": "https://freerepublic.com/focus/f-news/4345093/posts",
    "timestamp": "2025-10-08T17:32:15Z"
  },
  {
    "title": "Megyn Kelly Excoriates Joy Reid As ‘Insane Lunatic’ Who’s ‘Extremely Racist’",
    "description": "SiriusXM’s Megyn Kelly condemned fired MSNBC host Joy Reid on \"Pod Force One\" Wednesday over her racism.",
    "link": "https://dailycaller.com/2025/10/08/megyn-kelly-excoriates-joy-reid-as-insane-lunatic-whos-extremely-racist/",
    "timestamp": "2025-10-08T17:32:12Z"
  },
  {
    "title": "Are Low-Income Workers Being 'Priced Out Of The Entire Car Market?' Used Cars That Were Once Affordable Are Now 'Way Out Of Reach'",
    "description": "Used cars that once cost less than $20,000 are quickly disappearing from the market, and low-income workers are asking whether they’re being “priced out of...",
    "link": "https://finance.yahoo.com/news/low-income-workers-being-priced-173107298.html",
    "timestamp": "2025-10-08T17:31:07Z"
  },
  {
    "title": "Trump: US Forces Could Soon Be On The Ground In Venezuela",
    "description": "President Donald Trump has suggested that United States forces could soon be on the ground in Venezuela. The U.S. ruling class could quickly escalate a brewing conflict from sea to land operations, expanding what the ruler has called “a war on terrorist drug …",
    "link": "https://www.shtfplan.com/headline-news/trump-us-forces-could-soon-be-on-the-ground-in-venezuela",
    "timestamp": "2025-10-08T17:30:34Z"
  },
  {
    "title": "Bring Back High-Stakes School Testing",
    "description": "Former Education Secretary Margaret Spellings on testing, accountability, and how to reverse the decade-long decline in U.S. student achievement. Plus: David Frum on Donald Trump’s cult of sycophancy.",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/10/the-david-frum-show-margaret-spellings-school-testing/684489/",
    "timestamp": "2025-10-08T17:30:00Z"
  },
  {
    "title": "Schumer Keeps Government Closed Despite Mounting Costs of Shutdown",
    "description": "'Rejected a bipartisan funding measure'",
    "link": "https://dailycaller.com/2025/10/08/schumer-keeps-government-closed-despite-mounting-costs-of-shutdown/",
    "timestamp": "2025-10-08T17:29:25Z"
  },
  {
    "title": "“People Do Evil Things”: Pacific Palisades Fire Suspect Arrested By Feds; Pam Bondi Takes Partisan Swipe At Newsom & Bass",
    "description": "In a revelation that overturns much of previous probes into he devastating Pacific Palisades fire, the Department of Justice today said the blaze was a “holdover” fire  and the result of the actions of a 29-year-old Uber driver, federal prosecutors revealed t…",
    "link": "http://deadline.com/2025/10/palisades-fire-arrest-1236573310/",
    "timestamp": "2025-10-08T17:28:37Z"
  },
  {
    "title": "USA Rare Earth (USAR) Soars to New High as Investors Optimistic for US Govt Deal",
    "description": "We recently published 10 Hot Stocks Sparking Buying Frenzy. USA Rare Earth, Inc. (NASDAQ:USAR) is one of the best performers on Tuesday. USA Rare Earth...",
    "link": "https://finance.yahoo.com/news/usa-rare-earth-usar-soars-172452568.html",
    "timestamp": "2025-10-08T17:24:52Z"
  },
  {
    "title": "Tilray Brands (TLRY) Climbs 8% Ahead of Cannabis, CBD Policy Decision",
    "description": "We recently published 10 Hot Stocks Sparking Buying Frenzy. Tilray Brands Inc. (NASDAQ:TLRY) is one of the best performers on Tuesday. Tilray Brands Inc...",
    "link": "https://finance.yahoo.com/news/tilray-brands-tlry-climbs-8-172434280.html",
    "timestamp": "2025-10-08T17:24:34Z"
  },
  {
    "title": "Are Democrats Using The Nuclear Option In Shutdown Fight Against Trump?",
    "description": "As the shutdown battle in Washington, D.C., rages on, Democrats are playing with fire in the riskiest gamble they have taken so far during Trump's second term.",
    "link": "https://dailycaller.com/2025/10/08/democratic-party-government-shut-down-trump-us-economy/",
    "timestamp": "2025-10-08T17:24:27Z"
  },
  {
    "title": "'We have to think beyond President Trump,' says Ford",
    "description": "\"If we can&#39t get a deal, we have to hit him back twice as hard,\" said Ford at the U.S.-Canada Summit, calling Ontario an economic powerhouse",
    "link": "https://nationalpost.com/news/canada/ford-smith-trump-summit",
    "timestamp": "2025-10-08T17:23:49Z"
  },
  {
    "title": "Trump Calls for Arrest of Chicago Mayor and Illinois Gov. Pritzker",
    "description": "Republican President Donald Trump posted on social media today that Chicago Mayor Brandon Johnson and Illinois Gov. JB Pritzker, both Democrats, should be arrested for refusing to assist federal Immigration and Customs Enforcement (ICE) agents.\n\"Chicago Mayor…",
    "link": "https://biztoc.com/x/7bb28625bde90f74",
    "timestamp": "2025-10-08T17:23:46Z"
  },
  {
    "title": "Senate Democrats defy White House warnings, again block GOP bid to reopen government",
    "description": "External pressure from the White House has had little sway on Senate Democrats in their bid to extend expiring Obamacare subsidies, forcing the government shutdown into an eighth day.",
    "link": "https://www.foxnews.com/politics/senate-democrats-defy-white-house-warnings-again-block-gop-bid-reopen-government",
    "timestamp": "2025-10-08T17:23:45Z"
  },
  {
    "title": "White House Fires Back After Rosie O'Donnell Says She's Applied For Irish Citizenship",
    "description": "Trump first threatened to revoke the comedian's U.S. citizenship in July.",
    "link": "https://www.huffpost.com/entry/white-house-rosie-o-donnell-citizenship_n_68e67810e4b038265cc8eefd",
    "timestamp": "2025-10-08T17:20:53Z"
  },
  {
    "title": "Ontario Premier Doug Ford says Trump’s hands shouldn’t be on Canadian critical minerals",
    "description": "Doug Ford says Ottawa needs to be “tougher” to ensure that only “friends” get to invest in the Canadian critical minerals sector. Read here",
    "link": "https://financialpost.com/commodities/mining/ontario-premier-doug-ford-says-trumps-hands-shouldnt-be-on-canadian-critical-minerals",
    "timestamp": "2025-10-08T17:19:25Z"
  },
  {
    "title": "Trump Is Turning the US Into the Planet's Rogue Nation",
    "description": "Tuesday was one of those days when you can feel the world shifting. The think tank Ember reported that for the first half of 2025 renewable energy produced more electricity than coal. More to the point, solar and wind grew so fast that they covered all the gr…",
    "link": "https://billmckibben.substack.com/p/something-extraordinary-just-happened",
    "timestamp": "2025-10-08T17:19:17Z"
  },
  {
    "title": "Katie Porter’s Bombshell Meltdown Over Trump Voters Hides Dirty Media Secret — She Wasn’t Wrong",
    "description": "Katie Porter's (D-CA) viral meltdown over a question about Trump voters illustrates a dirty media secret that's getting lost in the outrage — she wasn't wrong.\nThe post Katie Porter’s Bombshell Meltdown Over Trump Voters Hides Dirty Media Secret — She Wasn’t …",
    "link": "https://www.mediaite.com/opinion/katie-porters-bombshell-meltdown-over-trump-voters-hides-dirty-media-secret-she-wasnt-wrong/",
    "timestamp": "2025-10-08T17:18:28Z"
  },
  {
    "title": "France's Le Pen Vows To Block Any Government",
    "description": "France's far-right leader Marine Le Pen said Wednesday she would thwart all action by any new government, throwing into doubt Prime Minister Sebastien Lecornu's ability to solve the country's deepening political crisis with a coalition cabinet.",
    "link": "https://www.ibtimes.com.au/frances-le-pen-vows-block-any-government-1860759",
    "timestamp": "2025-10-08T17:18:17Z"
  },
  {
    "title": "France's Le Pen Vows To Block Any Government",
    "description": "France's far-right leader Marine Le Pen said Wednesday she would thwart all action by any new government, throwing into doubt Prime Minister Sebastien Lecornu's ability to solve the country's deepening political crisis with a coalition cabinet.",
    "link": "https://www.ibtimes.com/frances-le-pen-vows-block-any-government-3786200",
    "timestamp": "2025-10-08T17:18:09Z"
  },
  {
    "title": "Trump Calls For Chicago Mayor, Illinois Governor To Be Jailed After Resisting Troop Deployment",
    "description": "Illinois Gov. JB Pritzker condemned the president's “full-blown authoritarianism.”",
    "link": "https://www.huffpost.com/entry/tump-jail-chicago-mayor-governor-pritzker_n_68e67f6de4b038265cc8f49c",
    "timestamp": "2025-10-08T17:14:01Z"
  },
  {
    "title": "Gavin Newsom Coins Damning Nickname for Bondi",
    "description": "Gavin Newsom unveiled a biting, new nickname for Pam Bondi in a fresh round of potshots at President Trump and his inner circle. The California governor...",
    "link": "https://www.thedailybeast.com/gavin-newsom-coins-damning-nickname-for-bondi/",
    "timestamp": "2025-10-08T17:13:13Z"
  },
  {
    "title": "Government Shutdown: Mike Johnson Refutes White House Threat To Withhold Pay From Furloughed Workers",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/08/government-shutdown-mike-johnson-refutes-white-house-threat-to-withhold-pay-from-furloughed-workers/",
    "timestamp": "2025-10-08T17:11:50Z"
  },
  {
    "title": "People Are Apparently Betting On Whether Or Not Diddy Will Get Pardoned And Be Out Of Prison By The Holidays",
    "description": "Let's talk about the odds.",
    "link": "https://www.cinemablend.com/streaming-news/people--betting-whether-diddy-will-get-pardoned-out-prison-holidays",
    "timestamp": "2025-10-08T17:11:48Z"
  },
  {
    "title": "Manchester terrorist pledged allegiance to Islamic State during synagogue stabbings",
    "description": "The Manchester terrorist phoned police to proclaim his allegiance to Islamic State in the middle of his stabbing spree that left two dead. Jihad Al-Shamie, 35, claimed responsibility for the attack after driving at worshippers in his car outside Heaton Park H…",
    "link": "https://freerepublic.com/focus/f-news/4345091/posts",
    "timestamp": "2025-10-08T17:09:40Z"
  },
  {
    "title": "Who is the judge overseeing the Trump administration’s case against James Comey?",
    "description": "Michael Nachmanoff has built a quiet reputation in the federal courthouse in northern Virginia — a onetime public defender turned judge known for methodical preparation and a cool temperament.",
    "link": "https://www.pbs.org/newshour/politics/who-is-the-judge-overseeing-the-trump-administrations-case-against-james-comey",
    "timestamp": "2025-10-08T17:09:39Z"
  },
  {
    "title": "Elon Musk Settles Severance Pay Lawsuit Brought By Ex-Twitter Executives",
    "description": "The former executives say that Musk falsely accused them of misconduct and forced them out of Twitter.",
    "link": "https://www.huffpost.com/entry/elon-musk-twitter-severance-pay-lawsuit_n_68e6977be4b07aeeb19574eb",
    "timestamp": "2025-10-08T17:06:57Z"
  },
  {
    "title": "Kid Rock Wants Pearl Jam + Others to 'Step Up' in Ticketing Fight",
    "description": "Kid Rock wants Pearl Jam and other 'outlaw country singers' to join the fight against ticketing companies over price gauging. Continue reading…",
    "link": "https://loudwire.com/kid-rock-pearl-jam-others-step-up-ticketing-companies/",
    "timestamp": "2025-10-08T17:06:03Z"
  },
  {
    "title": "“Morphing Into MAGA”: Taylor Swift Fans Call Out Cosmetic Procedures After New Interview Goes Viral",
    "description": "\"I just want my beautiful expressive sis’ eyebrows to be free to move,\" wrote one fan.",
    "link": "https://www.boredpanda.com/taylor-swift-fans-call-out-cosmetic-procedures-after-viral-interview/",
    "timestamp": "2025-10-08T17:05:58Z"
  },
  {
    "title": "‘Hellscape’: Investigative reporter warns of what Dems had planned for U.S. without Trump in office",
    "description": "'Imagine what would be happening under that lawless, vicious, unaccountable thug had Kamala Harris won'",
    "link": "https://www.wnd.com/2025/10/hellscape-investigative-reporter-warns-what-dems-had-planned/",
    "timestamp": "2025-10-08T17:04:22Z"
  },
  {
    "title": "Virginia Democrats have a violence problem",
    "description": "Jay Jones wished death on former House Speaker Todd Gilbert's children in 2022 messagesLast week, Virginians across the political spectrum were shocked to read text messages from Democratic attorney general nominee Jay Jones fantasizing about murdering a form…",
    "link": "https://freerepublic.com/focus/f-news/4345090/posts",
    "timestamp": "2025-10-08T17:03:12Z"
  },
  {
    "title": "Trump’s vague and confusing immigration policies are the point",
    "description": "In August, the US Citizenship and Immigration Services, the agency that adjudicates and grants immigration benefits like visas, residency, and naturalization, put out a bizarre three-page policy alert. Among other things, it noted vaguely that the agency woul…",
    "link": "https://www.theverge.com/policy/794893/anti-american-activities-immigration-policy",
    "timestamp": "2025-10-08T17:01:47Z"
  },
  {
    "title": "Schiff to Force Vote Calling Out Trump’s Extrajudicial Boat Attacks",
    "description": "Senate Democrats said Wednesday that they plan to force a vote on President Donald Trump’s extrajudicial military strikes on foreign vessels he claims are smuggling drugs. Senators Adam Schiff and Tim Kaine announced their intention to force a vote on the Tru…",
    "link": "https://newrepublic.com/post/201492/adam-schiff-force-vote-donald-trump-boat-attacks",
    "timestamp": "2025-10-08T17:01:39Z"
  },
  {
    "title": "Apple nears agreement with EU over Digital Markets Act rules",
    "description": "Meta and Apple are nearing agreements with the European Commission to resolve two antitrust cases, aiming to avoid escalating fines…\nThe post Apple nears agreement with EU over Digital Markets Act rules appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/10/08/apple-nears-agreement-with-eu-over-digital-markets-act-rules/",
    "timestamp": "2025-10-08T17:01:22Z"
  },
  {
    "title": "Why higher ed's AI rush could put corporate interests over public service and independence",
    "description": "Artificial intelligence technology has begun to transform higher education, raising a new set of profound questions about the role of universities in society. A string of high-profile corporate partnerships reflect how universities are embracing AI technology.",
    "link": "https://phys.org/news/2025-10-higher-ed-ai-corporate-independence.html",
    "timestamp": "2025-10-08T17:01:05Z"
  },
  {
    "title": "Stonewall vet Miss Major Griffin-Gracy 'surrounded by love' as she enters hospice care",
    "description": "Stonewall veteran and activist Miss Major Griffin-Gracy is in hospice care, her partner has announced, shortly after she was hospitalized for a bloodstream infection.",
    "link": "https://www.advocate.com/news/stonewall-miss-major-hospice-care",
    "timestamp": "2025-10-08T17:00:49Z"
  },
  {
    "title": "Kentucky Senate Primary: Andy Barr Labeled 'Amnesty Andy,' 'Mitch McConnell's Understudy' in Ad",
    "description": "A new ad in Kentucky's GOP primary for the state's open Senate seat labels Rep. Andy Barr (R-KY) \"Mitch McConnell's understudy.\"\nThe post Kentucky Senate Primary: Andy Barr Labeled ‘Amnesty Andy,’ ‘Mitch McConnell’s Understudy’ in Ad appeared first on Breitba…",
    "link": "https://www.breitbart.com/politics/2025/10/08/kentucky-senate-primary-andy-barr-labeled-amnesty-andy-mitch-mcconnels-understudy-ad/",
    "timestamp": "2025-10-08T17:00:39Z"
  },
  {
    "title": "Trump’s call for Fannie, Freddie to spur building is ‘a mystery’",
    "description": "While the president pushes for cheaper housing and more building, his tariffs have raised the cost of the raw materials needed to build those new homes.",
    "link": "https://www.ocregister.com/2025/10/08/trump-call-for-fannie-freddie-to-spur-building-is-a-mystery/",
    "timestamp": "2025-10-08T17:00:30Z"
  },
  {
    "title": "“What’s Going On?“: MTG’s Break With GOP Leaves Trump Stunned",
    "description": "Representative Marjorie Taylor Greene isn’t quite the MAGA acolyte she once was.Greene has publicly broken with Donald Trump several times since his inauguration, differing from her “favorite president” on issues ranging from artificial intelligence to Russia…",
    "link": "https://newrepublic.com/post/201494/marjorie-taylor-greene-break-gop-donald-trump",
    "timestamp": "2025-10-08T17:00:29Z"
  },
  {
    "title": "HarperCollins UK is pulling copies of a book that alleges Epstein introduced Melania and Donald Trump.",
    "description": "HarperCollins UK is pulping copies of a recently published book about Prince Andrew over unsubstantiated rumors that have maddened the Trumps, according to The Hill, Axios, and others. Entitled: The Rise and Fall of the House of York by Andrew",
    "link": "https://lithub.com/harpercollins-uk-is-pulling-copies-of-a-book-that-alleges-epstein-introduced-melania-and-donald-trump/",
    "timestamp": "2025-10-08T17:00:05Z"
  },
  {
    "title": "Chicago Mayor Johnson: 'Unhinged' Trump Is a 'Threat to Our Democracy'",
    "description": "Wednesday on CNN's \"The Situation Room,\" Chicago Mayor Brandon Johnson (D) claimed that President Donald Trump was unhinged and therefore a \"threat to our democracy.\"\nThe post Chicago Mayor Johnson: ‘Unhinged’ Trump Is a ‘Threat to Our Democracy’ appeared fir…",
    "link": "https://www.breitbart.com/clips/2025/10/08/chicago-mayor-johnson-unhinged-trump-is-a-threat-to-our-democracy/",
    "timestamp": "2025-10-08T16:59:36Z"
  },
  {
    "title": "'I don’t think he's the only one!' Jim Jordan name drops next target for DOJ after Comey",
    "description": "Rep. Jim Jordan (R-OH) dropped a bombshell live on Newsmax Wednesday after naming a former top intelligence official that he suspected might be next in line for criminal prosecution following the indictment of former FBI Director James Comey.“This whole lawfa…",
    "link": "https://www.rawstory.com/james-comey-2674166122/",
    "timestamp": "2025-10-08T16:58:31Z"
  },
  {
    "title": "Democrats have only themselves to blame for Trump’s National Guard patrols",
    "description": "President Trump wanted an excuse to send National Guard troops to Chicago, and now he’s got one. The Windy City in recent days has done its best imitation of Los Angeles, where resistance to Immigration and Customs Enforcement operations created the justifica…",
    "link": "https://freerepublic.com/focus/f-news/4345089/posts",
    "timestamp": "2025-10-08T16:58:23Z"
  },
  {
    "title": "Uber Driver Purposely Started Fire That Destroyed Thousands Of Palisades And Malibu Homes: DOJ...Authorities have made an arrest in connection to the deadly Palisades Fire.",
    "description": "Authorities have arrested a 29-year-old Uber driver in connection to the investigation into the deadly January Palisades Fire. Jonathan Rinderknecht, of Melbourne, Florida, was arrested Tuesday near his home on suspicion of destruction of property by means of…",
    "link": "https://freerepublic.com/focus/f-news/4345088/posts",
    "timestamp": "2025-10-08T16:57:23Z"
  },
  {
    "title": "US Congress Members Call For 'Recalibration, Not Confrontation' With India",
    "description": "A group of US Congress members on Wednesday urged President Donald Trump to take immediate steps to reset and repair the country's partnership with India, following recent tariff measures that they said have strained ties with the world's largest democracy, A…",
    "link": "https://www.ndtvprofit.com/world/trade-tensions-us-congress-members-call-for-recalibration-not-confrontation-with-india",
    "timestamp": "2025-10-08T16:57:06Z"
  },
  {
    "title": "Team Trump’s clashes with the faith community go from bad to worse",
    "description": "The political world is overdue for a conversation about the severity and frequency of the conflicts between the Trump administration and the faith community.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trumps-clashes-faith-community-go-bad-worse-rcna236412",
    "timestamp": "2025-10-08T16:56:02Z"
  },
  {
    "title": "Indonesia calls Trump's Gaza peace proposal a concrete step",
    "description": "Indonesia&#39;s Foreign Minister Sugiono has described the peace proposal for Gaza initiated by US President Donald Trump as a concrete and progressive step ...",
    "link": "https://en.antaranews.com/news/385033/indonesia-calls-trumps-gaza-peace-proposal-a-concrete-step",
    "timestamp": "2025-10-08T16:54:20Z"
  },
  {
    "title": "Trump Is Not Afraid of Civil War. Neither Is Stephen Miller.",
    "description": "President Trump has unleashed new weaponry in his war against Democrats, liberals and the left. Over the past four weeks, he has initiated what amounts to a unique form of partisan civil war designed to amass power in a nominal democracy and defang, decimate …",
    "link": "https://freerepublic.com/focus/f-news/4345087/posts",
    "timestamp": "2025-10-08T16:53:47Z"
  },
  {
    "title": "Congresswoman Carolyn Cheeks Kilpatrick, a tireless advocate for Detroit, dies at age 80",
    "description": "Former Detroit Congresswoman Carolyn Cheeks Kilpatrick has died at age 80",
    "link": "https://abcnews.go.com/Politics/wireStory/congresswoman-carolyn-cheeks-kilpatrick-tireless-advocate-detroit-dies-126333434",
    "timestamp": "2025-10-08T16:53:46Z"
  },
  {
    "title": "Handover of Tomahawks to Kiev to Irreparably Damage US-Russia Ties — Diplomat",
    "description": "Moscow is hopeful that Washington will hear its message on the potential supply of Tomahawk missiles to Ukraine, Maria Zakharova statedMOSCOW, October 8. /TASS/. If the United States makes the decision to supply Kiev with Tomahawk long-range missiles, it will…",
    "link": "https://freerepublic.com/focus/f-news/4345086/posts",
    "timestamp": "2025-10-08T16:53:13Z"
  },
  {
    "title": "Trump's Plan for Gaza Currently Best Option That Exists - Lavrov",
    "description": "MOSCOW (Sputnik) - US President Donald Trump's plan for the settlement of the situation in the Gaza Strip is currently the best option that exists in terms of its acceptability for Arab countries and \"non-rejection\" of the plan by Israel, Russian Foreign Mini…",
    "link": "https://sputnikglobe.com/20251008/trumps-plan-for-gaza-currently-best-option-that-exists---lavrov-1122927929.html",
    "timestamp": "2025-10-08T16:50:31Z"
  },
  {
    "title": "Trump’s former USDA chief economist warns the shutdown makes the president’s $15 billion farmer bailout a fantasy: ‘You can’t just flip a switch’",
    "description": "President Donald Trump’s plan to use tariff revenue to bail out farmers could be stalled by the ongoing government shutdown.\nTrump said last month the administration would roll out subsidies for struggling farmers using revenue from his sweeping tariff polici…",
    "link": "https://biztoc.com/x/ed2ed016221e81f1",
    "timestamp": "2025-10-08T16:50:21Z"
  },
  {
    "title": "National Guard troops are now outside Chicago and could be in Memphis soon",
    "description": "Illinois Gov. JB Pritzker has accused President Donald Trump of using troops as “political props” and “pawns,” and said he didn’t get a heads-up from Washington about their deployment.",
    "link": "https://biztoc.com/x/cd760c718b4e2e8e",
    "timestamp": "2025-10-08T16:50:12Z"
  },
  {
    "title": "Trump looms large over Nobel Peace Prize (Richard Milne/Financial Times)",
    "description": "Richard Milne / Financial Times:\nTrump looms large over Nobel Peace Prize  —  US president pressures Norwegian government and independent committee to select him on Friday  —  Nobody has campaigned for a Nobel Peace Prize quite like Donald Trump.  —  The US p…",
    "link": "https://www.memeorandum.com/251008/p73",
    "timestamp": "2025-10-08T16:50:01Z"
  },
  {
    "title": "Podcast: Is Trump's Peace Plan the only way for Gaza?",
    "description": "A plan by US President Donald Trump for Gaza is \"the only way to get to a rapid ceasefire\", one expert has told Behind the Story.",
    "link": "https://www.rte.ie/news/2025/1008/1537528-podcast-is-trumps-peace-plan-the-only-way-for-gaza/",
    "timestamp": "2025-10-08T16:49:46Z"
  },
  {
    "title": "Charlie Kirk's group chases anti-fascism professor out of the country",
    "description": "A history professor is abruptly leaving the U.S. after a conservative group founded by the late Charlie Kirk singled him out for persecution. Mark Bray, who has taught about antifascist movements at Rutgers University since 2019, notified students Sunday that…",
    "link": "https://www.rawstory.com/mark-bray-antifascist-charlie-kirk/",
    "timestamp": "2025-10-08T16:49:01Z"
  },
  {
    "title": "21 US lawmakers urge Donald Trump to 'repair and reset' ties with India",
    "description": "Twenty-one US lawmakers urged President Trump to reset ties with India, warning his punitive tariffs are harming both nations and pushing New Delhi towards rivals like China and Russia. The letter highlighted the strategic importance of India in the Indo-Paci…",
    "link": "https://timesofindia.indiatimes.com/world/us/21-us-lawmakers-urge-donald-trump-to-repair-and-reset-ties-with-india-over-tariffs/articleshow/124393034.cms",
    "timestamp": "2025-10-08T16:47:51Z"
  },
  {
    "title": "Stephen Miller Says ‘Quiet Part Out Loud,’ Claims Trump Has Unlimited ‘Plenary Authority’ Before Going Silent in Interview",
    "description": "White House deputy chief of staff Stephen Miller appeared to slip up in an interview Monday, admitting that he believes President Donald Trump possesses the authority of a dictator.Miller, who has made himself the face of the Trump administration's efforts to…",
    "link": "https://www.commondreams.org/news/stephen-miller-plenary-authority",
    "timestamp": "2025-10-08T16:46:02Z"
  },
  {
    "title": "Government shutdown leaves Colorado’s community health centers in financial limbo",
    "description": "A long shutdown could also jeopardize other programs supporting health centers, such as loan repayment for doctors working in underserved areas.",
    "link": "https://www.denverpost.com/2025/10/08/colorado-community-health-centers-government-shutdown/",
    "timestamp": "2025-10-08T16:45:28Z"
  },
  {
    "title": "Trump faces backlash: Approval rating drops to 40%, most Americans say no to troop deployment",
    "description": "Donald Trump’s approval rating has fallen to 40 percent as many Americans oppose sending troops to cities. He wants federal forces in places like Portland and Chicago, calling them dangerous. Governors like J.B. Pritzker and Gavin Newsom have pushed back, say…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-faces-backlash-approval-rating-drops-to-40-most-americans-say-no-to-troop-deployment/articleshow/124393073.cms",
    "timestamp": "2025-10-08T16:45:21Z"
  },
  {
    "title": "Senator warns health insurance costs will spike for 20M+ Americans if tax credit expires Dec. 31 — how to prepare now",
    "description": "She says it will also lead to about 4 million people losing their health insurance entirely.",
    "link": "https://finance.yahoo.com/news/senator-warns-health-insurance-costs-164500771.html",
    "timestamp": "2025-10-08T16:45:00Z"
  },
  {
    "title": "Why a Gaza peace deal may finally suit the key players",
    "description": "The moment for a peace deal in Gaza may finally suit the key players, even without the promised \"total defeat\" of Hamas.",
    "link": "https://news.sky.com/story/why-a-gaza-peace-deal-may-finally-suit-the-key-players-13447143",
    "timestamp": "2025-10-08T16:43:00Z"
  },
  {
    "title": "Did Gavin Newsom win 2025 Nobel Peace Prize?",
    "description": "The rumor spread days before the Norwegian Nobel Committee was set to announce the winner of the Nobel Peace Prize on Oct. 10.",
    "link": "https://www.snopes.com//fact-check/newsom-2025-nobel-peace-prize/",
    "timestamp": "2025-10-08T16:43:00Z"
  },
  {
    "title": "Trump Is Supporting Transnational Repression",
    "description": "Instead of sheltering pro-democracy dissidents, America is now returning them for arrest.",
    "link": "http://foreignpolicy.com/2025/10/08/trump-russia-iran-dissidents-democracy-repression/",
    "timestamp": "2025-10-08T16:41:54Z"
  },
  {
    "title": "North Dakota to Issue Stablecoin With Fiserv as Digital Dollar Trend Expands",
    "description": "The Fiserv-powered U.S. dollar stablecoin will be available to local banks and credit unions, joining a growing list of U.S. state crypto experiments.",
    "link": "https://www.coindesk.com/business/2025/10/08/north-dakota-to-issue-stablecoin-with-fiserv-as-digital-dollar-trend-expands",
    "timestamp": "2025-10-08T16:41:37Z"
  },
  {
    "title": "Jared Kushner Is in Egypt for Israel-Hamas Negotiations. Here’s Why That Matters.",
    "description": "President Donald Trump has deployed son-in-law Jared Kushner to Egypt amid negations for a hostage deal and ceasefire between Israel and Hamas.   Kushner is... Read More\nThe post Jared Kushner Is in Egypt for Israel-Hamas Negotiations. Here’s Why That Matters…",
    "link": "https://www.dailysignal.com/2025/10/08/jared-kushner-egypt-israel-hamas-negotiations-why-is-matters/",
    "timestamp": "2025-10-08T16:41:29Z"
  },
  {
    "title": "‘I’m Sorry. I’m Aggravated’: Mike Johnson Has to Calm Himself Down While Going Off on Schumer Over Shutdown",
    "description": "Mike Johnson had to take a moment to bring the temperature down a notch as he blasted Chuck Schumer over the current government shutdown.\nThe post ‘I’m Sorry. I’m Aggravated’: Mike Johnson Has to Calm Himself Down While Going Off on Schumer Over Shutdown firs…",
    "link": "https://www.mediaite.com/media/news/im-sorry-im-aggravated-mike-johnson-has-to-calm-himself-down-while-going-off-on-schumer-over-shutdown/",
    "timestamp": "2025-10-08T16:41:28Z"
  },
  {
    "title": "Starving children screaming for food as US aid cuts unleash devastation and death across Myanmar",
    "description": "Families say their loved ones have died as a direct result of the U.S. foreign aid cuts.",
    "link": "https://www.bostonherald.com/2025/10/08/foreign-aid-starving-children/",
    "timestamp": "2025-10-08T16:41:18Z"
  },
  {
    "title": "5 things Nvidia's Jensen Huang said about the state of the AI race with China",
    "description": "While the U.S. may be leading in advanced chip designs, Huang warned not to discount China's growing chip development.",
    "link": "https://www.cnbc.com/2025/10/08/nvidia-huang-ai-race-china-us-trump.html",
    "timestamp": "2025-10-08T16:41:03Z"
  },
  {
    "title": "‘Retribution agenda’: GOP senators laugh and shrug over Trump’s vicious shutdown cuts",
    "description": "WASHINGTON — Retribution is in the air.The federal government is shut down and President Donald Trump’s chomping at the bit, canceling blue-state projects, threatening (more) mass layoffs and diverting funds — and the jobs that come with them — to the red sta…",
    "link": "https://www.rawstory.com/raw-investigates/government-shutdown-2674165606/",
    "timestamp": "2025-10-08T16:40:02Z"
  },
  {
    "title": "Chicago Mayor Torches Trump for Calling for His Arrest: ‘Not the First Time’ He’s Wanted to ‘Unjustly’ Arrest a ‘Black Man’",
    "description": "Chicago Mayor Brandon Johnson suggested President Trump is targeting him because he is a black man, soon after the president called for him to be jailed\nThe post Chicago Mayor Torches Trump for Calling for His Arrest: ‘Not the First Time’ He’s Wanted to ‘Unju…",
    "link": "https://www.mediaite.com/media/chicago-mayor-torches-trump-for-calling-for-his-arrest-not-the-first-time-hes-wanted-to-unjustly-arrest-a-black-man/",
    "timestamp": "2025-10-08T16:38:22Z"
  },
  {
    "title": "Trump’s former USDA chief economist warns the shutdown makes the president’s $15 billion farmer bailout a fantasy: ‘You can’t just flip a switch’",
    "description": "“How to fund this bailout is very complicated, and different than it was in 2018,” said Joe Glauber, former chief economist at the U.S. Department of Agriculture during Trump’s first term.",
    "link": "https://fortune.com/2025/10/08/trump-former-usda-chief-economist-joe-glauber-government-shutdown-farmer-bailout/",
    "timestamp": "2025-10-08T16:37:59Z"
  },
  {
    "title": "The Progressive Left’s Descent Into Barbarism",
    "description": "The Progressive Left’s Descent Into BarbarismCan we re-civilize our society?There often comes a moment in the pursuit of a noble but hopeless cause when the idealist discards both ideals and human bonds, embracing barbarism in the name of a higher purpose. Th…",
    "link": "https://freerepublic.com/focus/f-news/4345083/posts",
    "timestamp": "2025-10-08T16:37:07Z"
  },
  {
    "title": "National Guard troops are now outside Chicago and could be in Memphis soon",
    "description": "Illinois Gov. JB Pritzker has accused President Donald Trump of using troops as “political props” and “pawns,” and said he didn’t get a heads-up from Washington about their deployment.",
    "link": "https://www.pbs.org/newshour/nation/national-guard-troops-are-now-outside-chicago-and-could-be-in-memphis-soon",
    "timestamp": "2025-10-08T16:36:24Z"
  },
  {
    "title": "Lawrence O'Donnell Champions AOC For 1 Idea Past Hippie Icons 'Would Like'",
    "description": "The MSNBC host lauded Rep. Alexandria Ocasio-Cortez for hitting \"insecure men\" like senior White House aide Stephen Miller where it hurts.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-champions-alexandria-ocasio-cortez-stephen-miller_n_68e65e5de4b038265cc8dfe8",
    "timestamp": "2025-10-08T16:35:31Z"
  },
  {
    "title": "IMF chief warns of economic uncertainty and offers this advice: 'Buckle up'",
    "description": "The global economy may be holding up better than expected despite major shocks such as President Donald Trump’s tariffs, but the head of the International Monetary Fund says that resilience may not last.",
    "link": "https://www.news4jax.com/business/2025/10/08/imf-chief-warns-of-economic-uncertainty-and-offers-this-advice-buckle-up/",
    "timestamp": "2025-10-08T16:33:44Z"
  },
  {
    "title": "Hamas demands release of fearsome ‘symbol of terrorism’ in Gaza Deal talks",
    "description": "Hamas is demanding the release of vicious murderers — including one dubbed “the symbol of terrorism” by Israel’s Prime Minister Benjamin Netanyahu — in negotiations this week to release all remaining Israeli hostages and end the war in Gaza. At the top of Ham…",
    "link": "https://nypost.com/2025/10/08/world-news/hamas-demands-release-of-marwan-barghouti-in-gaza-deal-talks/",
    "timestamp": "2025-10-08T16:32:54Z"
  },
  {
    "title": "Liberal media darling in the hot seat after explosive interview goes viral",
    "description": "California Democratic gubernatorial candidate Katie Porter faced backlash over a viral clip of her attempting to end an interview over the line of questioning.",
    "link": "https://www.foxnews.com/politics/liberal-media-darling-hot-seat-after-explosive-interview-goes-viral",
    "timestamp": "2025-10-08T16:32:00Z"
  },
  {
    "title": "Ex-FBI director James Comey pleads not guilty to federal charges",
    "description": "The former FBI leader will go to trial in January but his legal team argue the case is politically motivated.",
    "link": "https://www.bbc.com/news/articles/cy4r3xj78dpo",
    "timestamp": "2025-10-08T16:32:00Z"
  },
  {
    "title": "Where jobs are scarce, over 1 million people could dodge Trump’s Medicaid work rules",
    "description": "Millions living in areas of high unemployment could be spared the work requirement.",
    "link": "https://www.bostonherald.com/2025/10/08/where-jobs-are-scarce-over-1-million-people-could-dodge-trumps-medicaid-work-rules/",
    "timestamp": "2025-10-08T16:31:34Z"
  },
  {
    "title": "Soy Wars: Trump takes on Xi as China’s ban leaves US farmers stuck with mountains of beans",
    "description": "China's sudden halt in soybean imports, a key U.S. export, is causing alarm among American farmers as prices collapse and storage overflows. President Trump plans to address this \"negotiating\" tactic with President Xi at the APEC summit, highlighting the sign…",
    "link": "https://economictimes.indiatimes.com/news/international/business/soy-wars-trump-takes-on-xi-as-chinas-ban-leaves-us-farmers-stuck-with-mountains-of-beans/articleshow/124392708.cms",
    "timestamp": "2025-10-08T16:31:00Z"
  },
  {
    "title": "Gold Blasts Past $4,000 as Investors Flee to Safety Amid U.S. Political Turmoil",
    "description": "Gold prices were surging above $4,000 per ounce on Tuesday for the first time ever, as escalating political tension in the United States and renewed fears over global financial stability drove investors out of risk assets and into safe havens. Spot gold jumpe…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Gold-Blasts-Past-4000-as-Investors-Flee-to-Safety-Amid-US-Political-Turmoil.html",
    "timestamp": "2025-10-08T16:30:00Z"
  },
  {
    "title": "‘Buckle up’: IMF chief warns of economic uncertainty",
    "description": "IMF’s Kristalina Georgieva says 'uncertainty is the new normal' as tariffs weigh on the global economy.",
    "link": "https://www.aljazeera.com/economy/2025/10/8/buckle-up-imf-chief-warns-of-economic-uncertainty",
    "timestamp": "2025-10-08T16:29:30Z"
  },
  {
    "title": "‘Buckle up’: IMF chief warns of economic uncertainty",
    "description": "IMF’s Kristalina Georgieva says ‘uncertainty is the new normal’ as tariffs weigh on the global economy.",
    "link": "https://www.aljazeera.com/economy/2025/10/8/buckle-up-imf-chief-warns-of-economic-uncertainty",
    "timestamp": "2025-10-08T16:29:30Z"
  },
  {
    "title": "James Comey’s indictment is a trademark tactic of authoritarians",
    "description": "The former FBI director’s indictment breaks a principle that has protected American democracy for 50 years.",
    "link": "https://theconversation.com/james-comeys-indictment-is-a-trademark-tactic-of-authoritarians-266214",
    "timestamp": "2025-10-08T16:29:10Z"
  },
  {
    "title": "Judge Says Govt’s Prosecution Of Kilmar Abrego Garcia Looks Vindictive, Orders Hearing",
    "description": "A brief-ish history of events leading up to this point: Kilmar Abrego Garcia was one of hundreds of migrants rounded up by ICE, denied of their due process rights, and dumped into an infamous torture prison in El Salvador, a country overseen by a man who clai…",
    "link": "https://www.techdirt.com/2025/10/08/judge-says-govts-prosecution-of-kilmar-abrego-garcia-looks-vindictive-orders-hearing/",
    "timestamp": "2025-10-08T16:29:08Z"
  }
]