[
  {
    "title": "Ukraine proposes fresh peace talks with Russia next week",
    "description": "Kiev has proposed to Moscow a new round of peace talks next week, Ukraine's President Volodymyr Zelensky said Saturday, hours after Russian strikes across Ukraine claimed more lives.",
    "link": "https://www.hurriyetdailynews.com/ukraine-proposes-fresh-peace-talks-with-russia-next-week-211687",
    "timestamp": "2025-07-21T05:38:48Z"
  },
  {
    "title": "In South Korea, Trump’s tariff threats place US love affair under strain",
    "description": "South Koreans' perceptions of the US have taken a dive amid Trump's 'America First' foreign policy and trade agenda.",
    "link": "https://www.aljazeera.com/economy/2025/7/21/in-south-korea-trumps-tariff-threats-place-us-love-affair-under-strain",
    "timestamp": "2025-07-21T05:36:13Z"
  },
  {
    "title": "John Oliver Says ‘Late Show’ Cancellation Is “Incredibly Sad” - The Hollywood Reporter",
    "description": "John Oliver Says ‘Late Show’ Cancellation Is “Incredibly Sad”The Hollywood Reporter Canceling ‘The Late Show’ Is Bad News for Late-Night TV, Not for Stephen ColbertThe New York Times Keith Olbermann pours cold water on claims Colbert was fired for political r…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178428758",
    "timestamp": "2025-07-21T05:32:04Z"
  },
  {
    "title": "Newspoll and Resolve give Labor big leads as parliament resumes after the election",
    "description": "Prime Minister Anthony Albanese goes into the 48th parliament with a strong polling performance - but not as good as this time in 2022.",
    "link": "https://theconversation.com/newspoll-and-resolve-give-labor-big-leads-as-parliament-resumes-after-the-election-261538",
    "timestamp": "2025-07-21T05:28:18Z"
  },
  {
    "title": "As Trump flip-flops on US academia, China’s brightest head back home. Here’s why",
    "description": "Annual global ratings list is latest indicator of growing influence of Chinese institutions as US-based talent heads overseas Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/21/as-trump-flip-flops-on-us-academia-chinas-brightest-head-back-home-heres-why",
    "timestamp": "2025-07-21T05:26:00Z"
  },
  {
    "title": "Asian shares are mixed after Wall Street logs a 3rd straight winning week",
    "description": "BANGKOK (AP) — Asian shares are mixed and U.S. futures have edged higher after U.S. stocks logged their third straight winning week. Markets were closed for a holiday in Japan, where the ruling Liberal Democrats have lost their coalition majorities in both ho…",
    "link": "https://financialpost.com/pmn/asian-shares-are-mixed-after-wall-street-logs-a-3rd-straight-winning-week",
    "timestamp": "2025-07-21T05:24:32Z"
  },
  {
    "title": "High-level talks held on support for Ukraine a week after Trump said Europe will pay for weapons",
    "description": "Britain and Germany are leading a meeting regarding Donald Trump's plan. The plan involves NATO allies providing weapons to Ukraine. This follows increased Russian attacks. Trump has given Russia a deadline for a ceasefire. Discussions include Patriot air def…",
    "link": "https://economictimes.indiatimes.com/news/defence/high-level-talks-held-on-support-for-ukraine-a-week-after-trump-said-europe-will-pay-for-weapons/articleshow/122806991.cms",
    "timestamp": "2025-07-21T05:22:56Z"
  },
  {
    "title": "These U.S. States Have Passed Bitcoin Reserve Laws",
    "description": "New Hampshire, Arizona, and Texas have all pushed to enable their treasuries to hold Bitcoin. Others are trying and failing.",
    "link": "https://decrypt.co/330965/these-u-s-states-have-passed-bitcoin-reserve-laws",
    "timestamp": "2025-07-21T05:22:54Z"
  },
  {
    "title": "Asian shares are mixed after Wall Street logs a 3rd straight winning week",
    "description": "Shares are mostly higher in key markets in Europe and Asia after U.S. stocks logged their third straight winning week.  Markets were closed for a holiday in ...",
    "link": "https://finance.yahoo.com/news/asian-shares-mixed-wall-street-051819923.html",
    "timestamp": "2025-07-21T05:18:19Z"
  },
  {
    "title": "Trump urges Commanders and Guardians teams to reverse name change",
    "description": "US President Donald Trump on Sunday called for Washington's football and Cleveland's baseball teams to revert to their former names, which had long been criticized as racist. \"The Washington 'Whatever's' should IMMEDIATELY change their name back to the Washin…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:250721-99-508847/",
    "timestamp": "2025-07-21T05:13:25Z"
  },
  {
    "title": "Congress MP Gaurav Gogoi moves adjournment motion notice in Lok Sabha ahead of Parliament Monsoon Session",
    "description": "Gaurav Gogoi seeks adjournment in Lok Sabha to discuss the Pahalgam attack and Operation Sindoor, questioning the ceasefire terms and alleged US intervention. Sanjay Singh requests suspension of business in Rajya Sabha to address government school shutdowns i…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-mp-gaurav-gogoi-moves-adjournment-motion-notice-in-lok-sabha-ahead-of-monsoon-session/articleshow/122806739.cms",
    "timestamp": "2025-07-21T05:08:33Z"
  },
  {
    "title": "G-20 communique delivers rare show of unity amid Trump trade war",
    "description": "The agreement, forged during the G-20 summit in South Africa’s eastern KwaZulu-Natal province, was reached despite simmering tensions over US President Donald Trump’s trade war",
    "link": "https://www.bloomberg.com/news/articles/2025-07-18/g-20-pledges-to-strengthen-cooperation-as-it-seals-communique",
    "timestamp": "2025-07-21T05:07:07Z"
  },
  {
    "title": "Drone Crashes, Security Threats Have States Demanding Power to Take Them Down",
    "description": "While authorities were desperately trying to save people from the deadly Fourth of July floods in Kerr County, Texas, a private drone collided with a search and rescue helicopter and forced it to make an emergency landing, one of the …",
    "link": "https://www.insurancejournal.com/news/national/2025/07/21/832320.htm",
    "timestamp": "2025-07-21T05:03:35Z"
  },
  {
    "title": "Pausing for breath: Five questions for the ECB",
    "description": "LONDON (Reuters) -The European Central Bank is set to pause for breath on Thursday after eight consecutive interest rate cuts, with the prospect of steeper...",
    "link": "https://finance.yahoo.com/news/pausing-breath-five-questions-ecb-050131859.html",
    "timestamp": "2025-07-21T05:01:31Z"
  },
  {
    "title": "Trump’s Lawsuit Against Bob Woodward Over Audiobook Is Dismissed",
    "description": "A federal judge on Friday dismissed U.S. President Donald Trump’s nearly $50 million lawsuit against the journalist Bob Woodward for publishing tapes from interviews for his 2020 best-seller “Rage” as an audiobook. The decision by U.S. District Judge Paul Gar…",
    "link": "https://www.insurancejournal.com/news/east/2025/07/21/832378.htm",
    "timestamp": "2025-07-21T05:00:38Z"
  },
  {
    "title": "Pilita Clark: Who answers the phone and says nothing? People under 25",
    "description": "Younger workers who don’t say hello when they answer a call need to know it’s a problem",
    "link": "https://www.irishtimes.com/business/work/2025/07/21/pilita-clark-who-answers-the-phone-and-says-nothing-people-under-25/",
    "timestamp": "2025-07-21T05:00:01Z"
  },
  {
    "title": "Ciarán O’Connor: Donald Trump is in danger of being swallowed up by an Epstein conspiracy he helped to create",
    "description": "Trump is learning that conspiracy theories are elastic, self-sealing and practically impossible to disprove to a base radicalised over time",
    "link": "https://www.irishtimes.com/opinion/2025/07/21/ciaran-oconnor-donald-trump-is-in-danger-of-being-swallowed-up-by-an-epstein-conspiracy-he-helped-to-create/",
    "timestamp": "2025-07-21T05:00:00Z"
  },
  {
    "title": "Number of Irish seeking State help to avoid US deportation almost triples",
    "description": "At least 41 sought assistance this year, but the number of Irish deported from US may be significantly higher",
    "link": "https://www.irishtimes.com/ireland/2025/07/21/number-of-irish-seeking-state-help-to-avoid-us-deportation-almost-triples/",
    "timestamp": "2025-07-21T05:00:00Z"
  },
  {
    "title": "World's top court to deliver landmark climate ruling",
    "description": "THE HAGUE: The top United Nations court will on Wednesday (Jul 23) hand down a landmark global legal blueprint for tackling climate change that also sets out top polluters' responsibilities towards the countries suffering most. The International Court of Just…",
    "link": "https://www.channelnewsasia.com/sustainability/worlds-top-court-deliver-landmark-climate-ruling-5249026",
    "timestamp": "2025-07-21T04:45:00Z"
  },
  {
    "title": "Inside Maria Farmer’s testimony that may reveal why Donald Trump’s name is in Epstein’s records",
    "description": "Trump-Epstein: Artist Maria Farmer’s claims about Jeffrey Epstein and a 1995 encounter with Donald Trump have resurfaced, reigniting calls to scrutinise what remains hidden in sealed federal files. Farmer, one of Epstein’s earliest accusers, says she urged au…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-is-maria-farmer-inside-maria-farmers-testimony-that-may-reveal-why-donald-trumps-name-is-in-epsteins-records/articleshow/122805288.cms",
    "timestamp": "2025-07-21T04:37:13Z"
  },
  {
    "title": "US Administration Concerned With Netanyahu's Actions in Syria - Reports",
    "description": "MOSCOW (Sputnik) - US President Donald Trump's administration is concerned with the \"mad\" regional policy of Israeli Prime MInister Benjamin Netanyahu, especially in the light of his latest attack on Syria, Axios reported on Sunday, citing unnamed US official…",
    "link": "https://sputnikglobe.com/20250721/us-administration-concerned-with-netanyahus-actions-in-syria---reports-1122464605.html",
    "timestamp": "2025-07-21T04:34:41Z"
  },
  {
    "title": "Morning Bid: Could have been worse, is enough for the yen",
    "description": "As far as investors are concerned, Japan's upper house election has been a sell on the rumour, buy (a little) on the fact.  Japanese markets are closed for...",
    "link": "https://finance.yahoo.com/news/morning-bid-could-worse-enough-043405495.html",
    "timestamp": "2025-07-21T04:34:05Z"
  },
  {
    "title": "Tax law takes aim at popular perk: office snacks",
    "description": "The SkinnyPop in the break room may not last. Donald Trump is targeting the office snack.\nThe president’s signature tax law allows a long-standing business deduction for the cost of food provided to employees to expire, imperiling a workplace perk popularized…",
    "link": "https://biztoc.com/x/2ab742dbf12a8eae",
    "timestamp": "2025-07-21T04:30:33Z"
  },
  {
    "title": "Putin wants Ukraine ceasefire deal but not before ‘achieving its goals’, says Russia",
    "description": "Russia says Vladimir Putin is open to peace after Ukrainian president Volodymyr Zelensky suggested fresh ceasefire talks and the US threatened steep tariffs.",
    "link": "https://www.independent.ie/world-news/europe/putin-wants-ukraine-ceasefire-deal-but-not-before-achieving-its-goals-says-russia/a1977468031.html",
    "timestamp": "2025-07-21T04:30:00Z"
  },
  {
    "title": "Ireland’s smallest trade partner revealed, after ‘confidentiality’ clause lifted",
    "description": "While political attention has been focused on how much Ireland sells to the US, because of the tariffs threatened by president Donald Trump, the identities of the countries to which we buy the least have just been revealed.",
    "link": "https://www.independent.ie/business/irelands-smallest-trade-partner-revealed-after-confidentiality-clause-lifted/a184291978.html",
    "timestamp": "2025-07-21T04:30:00Z"
  },
  {
    "title": "Just three people now missing after deadly July 4 floods in Texas, days after 100 were still feared lost",
    "description": "Officials in Texas have dramatically revised downwards the number of people missing from the catastrophic floods from 100 to just three.",
    "link": "https://www.independent.ie/world-news/north-america/just-three-people-now-missing-after-deadly-july-4-floods-in-texas-days-after-100-were-still-feared-lost/a1858364166.html",
    "timestamp": "2025-07-21T04:30:00Z"
  },
  {
    "title": "Tax law takes aim at popular perk: office snacks",
    "description": "The SkinnyPop in the break room may not last. Donald Trump is targeting the office snack.",
    "link": "https://www.bostonherald.com/2025/07/21/tax-law-takes-aim-at-popular-perk-office-snacks/",
    "timestamp": "2025-07-21T04:25:51Z"
  },
  {
    "title": "Bangladesh signs deal with US to import 7,00,000 tonnes of wheat annually ahead of tariff talks",
    "description": "Bangladesh and the United States have signed an MoU for the annual import of 700,000 tonnes of high-quality US wheat for five years, preceding tariff discussions. Despite inconclusive tariff talks where the US sought increased security cooperation, joint mili…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/bangladesh-signs-deal-with-us-to-import-700000-tonnes-of-wheat-annually-ahead-of-tariff-talks/articleshow/122805995.cms",
    "timestamp": "2025-07-21T04:25:39Z"
  },
  {
    "title": "European markets on Mon July 21: Stoxx 600, FTSE, DAX, CAC",
    "description": "European markets on Mon July 21: Stoxx 600, FTSE, DAX, CACcnbc.com",
    "link": "https://www.cnbc.com/2025/07/21/european-markets-on-mon-july-21-stoxx-600-ftse-dax-cac.html",
    "timestamp": "2025-07-21T04:22:36Z"
  },
  {
    "title": "ECB Expected To Hold Rates As Trump Tariff Uncertainty Lingers",
    "description": "The European Central Bank is set to hold interest rates for the first time in almost a year when policymakers meet this week, despite concerns over the potential impact of higher US tariffs on the eurozone economy.",
    "link": "https://www.ibtimes.com/ecb-expected-hold-rates-trump-tariff-uncertainty-lingers-3779000",
    "timestamp": "2025-07-21T04:21:19Z"
  },
  {
    "title": "Philippines' Marcos to meet Trump hoping to secure trade deal",
    "description": "MANILA: Philippine President Ferdinand Marcos Jr meets US President Donald Trump this week, hoping Manila's status as a key Asian ally will secure a more favourable trade deal before an Aug 1 deadline. Marcos will be the first Southeast Asian leader to meet T…",
    "link": "https://www.channelnewsasia.com/asia/us-tariffs-trump-philippines-marcos-meeting-5248961",
    "timestamp": "2025-07-21T04:20:40Z"
  },
  {
    "title": "What US economic madness means for the rest of the world",
    "description": "Tariffs and a weaker dollar spell trouble for Irish exporters",
    "link": "https://www.irishtimes.com/business/economy/2025/07/21/what-us-economic-madness-means-for-the-rest-of-the-world/",
    "timestamp": "2025-07-21T04:08:00Z"
  },
  {
    "title": "Whose Country is this, Anyway: The Struggle to Survive Trump",
    "description": "The Struggle to Thrive and Not Just Barely Survive in Trump's America By Liz Theoharis and Noam Sandweiss-Back ( Tomdispatch.com ) - Most days, in the heart of Pennsylvania’s Bible Belt, the old sanctuary at Christ Lutheran Church sits empty. Decades ago, it …",
    "link": "https://www.juancole.com/2025/07/country-struggle-survive.html",
    "timestamp": "2025-07-21T04:04:44Z"
  },
  {
    "title": "TRF deserves designation as foreign terrorist organisation: US House Foreign Affairs Committee",
    "description": "The US House Committee on Foreign Affairs supports the designation of The Resistance Front as a global terrorist group. This follows the Pahalgam attack. The committee emphasizes justice for those who harm civilians. They also criticized a New York Times repo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trf-deserves-designation-as-foreign-terrorist-organisation-us-house-foreign-affairs-committee/articleshow/122805693.cms",
    "timestamp": "2025-07-21T04:04:06Z"
  },
  {
    "title": "Donald Trump’s threats: ‘Taco’ trade gives way to paradox",
    "description": "in trying to predict Trump’s moves, the market may be changing them, sometimes to its own peril",
    "link": "https://www.irishtimes.com/your-money/2025/07/21/donald-trumps-threats-taco-trade-gives-way-to-paradox/",
    "timestamp": "2025-07-21T04:02:00Z"
  },
  {
    "title": "Why Don’t Americans Rise up Against Unpopular Policy Anymore?",
    "description": "The last time a political party paid a price for legislation was in 1989.",
    "link": "http://foreignpolicy.com/2025/07/21/medicare-cuts-unpopular-policy/",
    "timestamp": "2025-07-21T04:01:39Z"
  },
  {
    "title": "The difference Susie Wiles makes",
    "description": "I have been a lifelong Republican and a yuge fan of President Donald Trump.  He has advanced more conservative policies than any president in my lifetime.  As I wrote in 2018; Trump is no Reagan — and that is a goo...",
    "link": "https://www.americanthinker.com/blog/2025/07/the_difference_susie_wiles_makes.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Tariffs an unwelcome shock to a German economy already battling an exports slowdown",
    "description": "New Merz government promises to slash red tape to incentivise companies but Trump tariffs could render those plans moot",
    "link": "https://www.irishtimes.com/business/2025/07/21/tariffs-an-unwelcome-shock-to-a-german-economy-already-battling-an-exports-slowdown/",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "English, por favor",
    "description": "The fun part of sharing these posts with our AT readers is that you learn something new every day. Check this out:\r\n\r\n\r\nMexican truck drivers in the border city of Ciudad Juarez have begun studying English in efforts to comply with an execu...",
    "link": "https://www.americanthinker.com/blog/2025/07/english_por_favor.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Leftists Can’t-Don’t-Won’t Ever Learn",
    "description": "Photo Credit:\n \n Public DomainThroughout history, people have gained great power by making promises to the poorly-educated and instead brought only misery and oppression.",
    "link": "https://www.americanthinker.com/articles/2025/07/leftists_can_t_don_t_won_t_ever_learn.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "The US Supreme Court’s ‘Cliff Clavin’",
    "description": "Perhaps among the most annoying personality traits is that of the proverbial “know-it-all.” Fans of the television comedy hit “Cheers” (1982–1993)—which centered around a Boston bar, its employees and customers&mda...",
    "link": "https://www.americanthinker.com/blog/2025/07/the_us_supreme_court_s_cliff_clavin.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Inside the Media Matrix",
    "description": "For four years, large parts of the media have covered up the mental and physical decline of U.S. president Joe Biden. Now, a blue bruise on the right hand of his successor, Donald Trump, has caused gasps in newsrooms. Within the media matrix, they&#3...",
    "link": "https://www.americanthinker.com/articles/2025/07/inside_the_media_matrix.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Why now is not the time to be complacent on mortgage arrears",
    "description": "Mortgage market players need to offer more ways to allow once distressed borrowers to clear their mortgage debt",
    "link": "https://www.irishtimes.com/business/2025/07/21/why-now-is-not-the-time-to-be-complacent-on-mortgage-arrears/",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Barry’s arc gets bent",
    "description": "Do you want the good news or the bad news first? O.K. then, let’s start with the bad. \r\n\r\nBarack Obama’s not going to get charged with anything for his sundry offenses against our country and Donald Trump, detailed by Tulsi&nbsp...",
    "link": "https://www.americanthinker.com/blog/2025/07/barry_s_arc_gets_bent.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "US: Immigrants Abused in Florida Detention Sites",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n © 2025 John Holmes for Human Rights Watch\n \n \n\n\n \nDetainees in Florida immigration detention centers are being subjected to inhuman conditions, including denial of medical care, overcrowding, and degrading treatment.…",
    "link": "https://www.hrw.org/news/2025/07/21/us-immigrants-abused-in-florida-detention-sites",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Where's the Reckoning?",
    "description": "President Donald Trump is six months into his second term.\r\n\r\nHe has accomplished a lot, including preventing a nuclear war in the Middle East.\r\n\r\nHe used President Obama’s approach of “a pen and a phone” to revoke numerous Biden au...",
    "link": "https://www.americanthinker.com/articles/2025/07/where_s_the_reckoning.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "When it comes to events in 2016, the truth may finally set America free",
    "description": "We are on the cusp of learning about the two big lies of 2016, lies that have cast incredibly long shadows in America, corrupting everything they touched. The Democrats have been inundating the American people with half-truths and outright falsehoods...",
    "link": "https://www.americanthinker.com/blog/2025/07/when_it_comes_to_events_in_2016_the_truth_may_finally_set_america_free.html",
    "timestamp": "2025-07-21T04:00:00Z"
  },
  {
    "title": "Off-duty Border Patrol agent shot in a Manhattan park in apparent botched robbery, police say",
    "description": "A U.S. Customs and Border Protection officer has been shot in a Manhattan park in what authorities say was an apparent botched robbery",
    "link": "https://abcnews.go.com/US/wireStory/off-duty-border-patrol-agent-shot-manhattan-park-123910061",
    "timestamp": "2025-07-21T03:58:25Z"
  },
  {
    "title": "Buy alert! 2 ASX 200 blue-chip shares worth a look now: expert",
    "description": "Dylan Evans from Catapult Wealth has identified two blue-chip shares that he thinks are good buys today. \nThe post Buy alert! 2 ASX 200 blue-chip shares worth a look now: expert appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/07/21/buy-alert-2-asx-200-blue-chip-shares-worth-a-look-now-expert/",
    "timestamp": "2025-07-21T03:57:00Z"
  },
  {
    "title": "AMERICA Prayer Vigil 7/21/25 {Prayer}",
    "description": "Join together with Fellow FREEPERS to Pray for AMERICA: For those in Authority in Government, Family, Military, Business, Healthcare, Education, Churches, and the Media.'I Urge, then, First of All, that Requests, Prayers, Intercession and Thanksgiving be Made…",
    "link": "https://freerepublic.com/focus/f-religion/4329836/posts",
    "timestamp": "2025-07-21T03:51:54Z"
  },
  {
    "title": "Parliament Session: Congress gives Adjournment Motion notice in Lok Sabha, seeks Suspension of Business in Rajya Sabha",
    "description": "Congress MPs Manickam Tagore and Randeep Surjewala have moved notices in the Lok Sabha and Rajya Sabha, respectively, to discuss the Pahalgam terror attack and Operation Sindoor. Tagore seeks an adjournment motion citing security lapses and questionable forei…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/parliament-session-congress-gives-adjournment-motion-notice-in-lok-sabha-seeks-suspension-of-business-in-rajya-sabha/articleshow/122805416.cms",
    "timestamp": "2025-07-21T03:45:13Z"
  },
  {
    "title": "Trump pledged to save Afghans. But UAE already sent some evacuees back, cable shows",
    "description": "Despite Trump's pledge to help Afghan evacuees in the UAE, the Emirati government had already begun returning them to Afghanistan, informing Washington of their plans. The UAE cited a desire to \"close this chapter\" and sought assurances from the Taliban regar…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-pledged-to-save-afghans-but-uae-already-sent-some-evacuees-back-cable-shows/articleshow/122805343.cms",
    "timestamp": "2025-07-21T03:38:59Z"
  },
  {
    "title": "ICJ to deliver landmark climate ruling",
    "description": "The top United Nations court will on Wednesday hand down a landmark global legal blueprint for tackling climate change.\nThe post ICJ to deliver landmark climate ruling appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/icj-to-deliver-landmark-climate-ruling/article",
    "timestamp": "2025-07-21T03:26:30Z"
  },
  {
    "title": "Democrat Congressman: Zohran Mamdani 'Isn't Speaking for Our Party'",
    "description": "The divide in the Democratic Party further widened this week when Rep. Adam Smith (D-WA) publicly said that New York City mayoral candidate Zohran Mamdani \"isn't speaking for our party.\"\nThe post Democrat Congressman: Zohran Mamdani ‘Isn’t Speaking for Our Pa…",
    "link": "https://www.breitbart.com/politics/2025/07/20/democrat-congressman-zohran-mamdani-isnt-speaking-party/",
    "timestamp": "2025-07-21T03:24:50Z"
  },
  {
    "title": "U.S. Firms In China Committed To Market Amid Headwinds – Survey",
    "description": "More than 80% of U.S.-China Business Council members made money in China in 2024",
    "link": "https://www.forbes.com/sites/forbeschina/2025/07/20/us-firms-in-china-committed-to-market-amid-headwinds--survey/",
    "timestamp": "2025-07-21T03:23:28Z"
  },
  {
    "title": "Japan PM hangs on after election debacle",
    "description": "Japanese Prime Minister Shigeru Ishiba was clinging on Monday even after his coalition disastrously lost its upper house majority, as painful new US tariffs loom. The Liberal Democratic Party (LDP), which has governed almost continuously since 1955, and its p…",
    "link": "https://www.digitaljournal.com/news/japan-pm-hangs-on-after-election-debacle/article",
    "timestamp": "2025-07-21T03:22:20Z"
  },
  {
    "title": "Japan’s ruling bloc suffers double blow, Ishiba vows to stay on",
    "description": "Japan PM Shigeru Ishiba’s coalition loses upper house majority, deepening political instability amid voter anger over inflation and rising populist sentiment.",
    "link": "https://www.thehindubusinessline.com/news/world/japans-ruling-bloc-suffers-double-blow-ishiba-vows-to-stay-on/article69836786.ece",
    "timestamp": "2025-07-21T03:21:27Z"
  },
  {
    "title": "ICJ To Deliver Landmark Climate Ruling",
    "description": "The top United Nations court will on Wednesday hand down a landmark global legal blueprint for tackling climate change that also sets out top polluters' responsibilities towards the countries suffering most.",
    "link": "https://www.ibtimes.com/icj-deliver-landmark-climate-ruling-3778993",
    "timestamp": "2025-07-21T03:21:07Z"
  },
  {
    "title": "Trump and Epstein: What was their relationship?",
    "description": "Donald Trump’s past ties with Jeffrey Epstein are under scrutiny after the US president slammed a Wall Street Journal report that he sent a lewd letter to the infamous sex offender as “fake news.” AFP looks at the pair’s relationship as the Trump administrati…",
    "link": "https://www.digitaljournal.com/world/trump-and-epstein-what-was-their-relationship/article",
    "timestamp": "2025-07-21T03:17:20Z"
  },
  {
    "title": "ICJ to deliver landmark climate ruling",
    "description": "The top United Nations court will on Wednesday hand down a landmark global legal blueprint for tackling climate change that also sets out top polluters...",
    "link": "https://www.yahoo.com/news/icj-deliver-landmark-climate-ruling-031506325.html",
    "timestamp": "2025-07-21T03:15:06Z"
  },
  {
    "title": "Prime Minister's silence on Trump's involvement in ceasefire raises questions: Bhupesh Baghel",
    "description": "Former Chhattisgarh CM Bhupesh Baghel questions PM's silence on Trump's claim of mediating a ceasefire between India and Pakistan after the Pahalgam terror attack and Operation Sindoor. Trump asserted five jets were shot down, prompting Congress MPs to demand…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/prime-ministers-silence-on-trumps-involvement-in-ceasefire-raises-questions-bhupesh-baghel/articleshow/122805100.cms",
    "timestamp": "2025-07-21T03:15:03Z"
  },
  {
    "title": "Trump, 79, Posts Deranged AI Video of Obama Being Arrested (Josephine Harvey/The Daily Beast)",
    "description": "Josephine Harvey / The Daily Beast:\nTrump, 79, Posts Deranged AI Video of Obama Being Arrested  —  SUNDAY SCARIES  —  The bizarre post came as the president seeks to move on from the Epstein controversy tearing apart his base.  —  President Donald Trump share…",
    "link": "https://www.memeorandum.com/250720/p66",
    "timestamp": "2025-07-21T03:15:00Z"
  },
  {
    "title": "Kiev hit by missiles and drones in reported retaliatory strike (VIDEOS)",
    "description": "Ukrainian officials have claimed that Moscow launched multiple waves of missile and drone strikes on Kiev overnight Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621745-kiev-missile-drone-strikes/",
    "timestamp": "2025-07-21T03:09:55Z"
  },
  {
    "title": "Miranda Devine: Trump wins the Epstein battle — as the left, media foolishly believe prez on the skids",
    "description": "If you listened to the rest of the media — both mainstream and social media — you would think Donald Trump was on the skids, that MAGA was at last turning on the president over the so-called Epstein Files. But nothing could be further from the truth, accordin…",
    "link": "https://freerepublic.com/focus/f-news/4329833/posts",
    "timestamp": "2025-07-21T03:06:24Z"
  },
  {
    "title": "Obama on knees, handcuffed, in jail: Trump posts AI video of Obama after Tulsi Gabbard’s claims of 'treasonous plot'",
    "description": "Donald Trump has shared a deepfake video of Barack Obama being arrested by FBI agents in the White House. The clip, originally from TikTok, comes amid claims by Tulsi Gabbard that the Obama administration led a “treasonous conspiracy” against Trump. The video…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/obama-on-knees-handcuffed-in-jail-trump-posts-ai-video-of-obama-after-tulsi-gabbards-claims-of-treasonous-plot/articleshow/122804911.cms",
    "timestamp": "2025-07-21T03:02:41Z"
  },
  {
    "title": "RIP Stephen Colbert, the Bravest Man on Television. Which Overpaid Celeb Is Next To Fall in Trump's Authoritarian Purge?",
    "description": "CBS announced last week it was cancelling the Late Show with Stephen Colbert, the former comedian whose self-righteous rants and anti-Trump therapy sessions endeared him to annoying online libs who think comedy shouldn't be funny and rich celebs have a moral …",
    "link": "https://freebeacon.com/media/rip-stephen-colbert-the-bravest-man-on-television-which-overpaid-celeb-is-next-to-fall-in-trumps-authoritarian-purge/",
    "timestamp": "2025-07-21T03:00:42Z"
  },
  {
    "title": "Charlie Munger On Trump",
    "description": "Before Trump as elected in 2016, Charlie Munger, then-vice chairman of Berkshire Hathaway, was asked if Trump would be a good president and his insights were right on target.\nMunger, who passed in 2023, and helped Warren Buffett create Berkshire Hathaway, was…",
    "link": "https://crooksandliars.com/2025/07/charlie-munger-trump",
    "timestamp": "2025-07-21T03:00:01Z"
  },
  {
    "title": "Ellen DeGeneres Confirms Donald Trump Is Reason For Her & Portia de Rossi's Move to the UK",
    "description": "Ellen DeGeneres spoke out about moving to the UK in a new public appearance in England! The 67-year-old comedian and former talk show host and her wife Portia de Rossi moved to the Cotswolds region in the country late last year. During a conversation with bro…",
    "link": "https://www.justjared.com/2025/07/20/ellen-degeneres-confirms-donald-trump-is-reason-for-her-portia-de-rossis-move-to-the-uk/",
    "timestamp": "2025-07-21T02:59:01Z"
  },
  {
    "title": "Hong Kong leads stocks higher, yen gains as Ishiba vows to stay",
    "description": "Equities mostly rose Monday on optimism countries will reach US trade deals before an August 1 deadline, while the yen gained after Japanese Prime Minister Shigeru Ishiba said he would stay in office despite another election defeat. Hong Kong topped 25,000 po…",
    "link": "https://www.digitaljournal.com/world/hong-kong-leads-stocks-higher-yen-gains-as-ishiba-vows-to-stay/article",
    "timestamp": "2025-07-21T02:57:32Z"
  },
  {
    "title": "Hong Kong Leads Stocks Higher, Yen Gains As Ishiba Vows To Stay",
    "description": "Equities mostly rose Monday on optimism countries will reach US trade deals before an August 1 deadline, while the yen gained after Japanese Prime Minister Shigeru Ishiba said he would stay in office despite another election defeat.",
    "link": "https://www.ibtimes.com.au/hong-kong-leads-stocks-higher-yen-gains-ishiba-vows-stay-1859736",
    "timestamp": "2025-07-21T02:57:17Z"
  },
  {
    "title": "Hong Kong Leads Stocks Higher, Yen Gains As Ishiba Vows To Stay",
    "description": "Equities mostly rose Monday on optimism countries will reach US trade deals before an August 1 deadline, while the yen gained after Japanese Prime Minister Shigeru Ishiba said he would stay in office despite another election defeat.",
    "link": "https://www.ibtimes.com/hong-kong-leads-stocks-higher-yen-gains-ishiba-vows-stay-3778990",
    "timestamp": "2025-07-21T02:57:15Z"
  },
  {
    "title": "BREAKING: Texts and Emails Indicate Hillary Clinton Campaign Directly Coordinated with Obama White House to Launch Trump-Russia Hoax",
    "description": "The Hillary Clinton campaign was directly coordinated with the Obama White House to launch the Trump-Russia hoax in July 2016. Hillary Clinton unleashed hell on this country when she hatched the ‘Trump-Russia collusion’ plot in 2016 to distract from her email…",
    "link": "https://freerepublic.com/focus/f-news/4329832/posts",
    "timestamp": "2025-07-21T02:56:31Z"
  },
  {
    "title": "Democrats bow to nuclear-energy reality — but the left won’t give up their delusions",
    "description": "Kathy Hochul's plan to embrace nuclear power rests entirely on the foundation Donald Trump laid in recent weeks — and it's giving the climate-activist left the vapors.",
    "link": "https://nypost.com/2025/07/20/opinion/democrats-bow-to-nuclear-reality-leaving-the-left-behind/",
    "timestamp": "2025-07-21T02:55:06Z"
  },
  {
    "title": "Epstein Accuser Twice Told FBI About His Ties to Trump",
    "description": "“Maria Farmer twice reported Donald Trump‘s connection with sex trafficker Jeffrey Epstein to the FBI, shining light on how the president may be mentioned in the Epstein files held by the Justice Department,” Rolling Stone",
    "link": "https://politicalwire.com/2025/07/20/epstein-accuser-twice-told-fbi-about-his-ties-to-trump/",
    "timestamp": "2025-07-21T02:53:00Z"
  },
  {
    "title": "As Trump courts a more assertive Beijing, China hawks are losing out",
    "description": "The Trump administration has reversed a ban on Nvidia’s H20 AI chip sales to China, easing tensions in a complex trade dispute. This shift follows China’s restrictions on rare earth exports. Both nations are cautiously rebuilding ties, with potential trade ta…",
    "link": "https://economictimes.indiatimes.com/tech/technology/as-trump-courts-a-more-assertive-beijing-china-hawks-are-losing-out/articleshow/122804868.cms",
    "timestamp": "2025-07-21T02:49:38Z"
  },
  {
    "title": "UK battles anti-vax misinformation after child’s death",
    "description": "Health officials stress the MMR jab's importance amid rising misinformation.",
    "link": "https://www.nzherald.co.nz/world/uk-battles-anti-vax-misinformation-after-childs-death/RC5U7FAP4JAXRLLPZMBEDZ5AWI/",
    "timestamp": "2025-07-21T02:39:03Z"
  },
  {
    "title": "'Donald certainly knew': Trump biographer reveals new evidence of intimate ties to Epstein",
    "description": "One of Donald Trump's biographers shared some intimate details on Sunday about Trump's relationship with disgraced financier Jeffrey Epstein. Michael Wolff, author of \"Fire and Fury: Inside the Trump White House,\" joined Trump's former attorney, Michael Cohen…",
    "link": "https://www.rawstory.com/trump-2673534192/",
    "timestamp": "2025-07-21T02:38:27Z"
  },
  {
    "title": "China Rare-Earth Magnet Exports Jump 158% After Trade Truce",
    "description": "(Bloomberg) -- China boosted shipments of rare earth magnets in June — including to the US — after a global supply squeeze that threatened factory closures...",
    "link": "https://finance.yahoo.com/news/china-rare-earth-magnet-exports-023712859.html",
    "timestamp": "2025-07-21T02:37:12Z"
  },
  {
    "title": "‘Higher Than They’ve Ever Been’: CNN’s Scott Jennings Backs Trump Up on Record Approval Ratings Claim",
    "description": "CNN's Scott Jennings backed up Trump's claims on Sunday to have higher than ever approval among his base despite the Epstein controversy.\nThe post ‘Higher Than They’ve Ever Been’: CNN’s Scott Jennings Backs Trump Up on Record Approval Ratings Claim first appe…",
    "link": "https://www.mediaite.com/media/tv/higher-than-theyve-ever-been-cnns-scott-jennings-backs-trump-up-on-record-approval-ratings-claim/",
    "timestamp": "2025-07-21T02:32:03Z"
  },
  {
    "title": "Japan PM Ishiba vows to stay on after bruising election defeat",
    "description": "TOKYO: Japanese Prime Minister Shigeru Ishiba vowed to remain in office on Monday (Jul 21) after his ruling coalition suffered a bruising defeat in Upper House elections, prompting some of his o",
    "link": "https://www.channelnewsasia.com/east-asia/japan-election-pm-shigeru-ishiba-upper-house-defeat-5248866",
    "timestamp": "2025-07-21T02:28:00Z"
  },
  {
    "title": "Ellen DeGeneres considering remarrying wife in UK after leaving US ‘because of Trump’",
    "description": "Former talk show host and comedian Ellen DeGeneres has confirmed she and wife Portia de Rossi’s 2024 move to the UK was Trump’s re-election – and shared their plans to remarry. Ellen DeGeneres, best known for her eponymous American chat show The Ellen Show, m…",
    "link": "https://www.thepinknews.com/2025/07/21/ellen-degeneres-trump-remarrying-uk-us/",
    "timestamp": "2025-07-21T02:26:34Z"
  },
  {
    "title": "Centre to discuss courage, valour of armed forces in Parliament: BJP leader Mayank Nayak",
    "description": "The Parliament's monsoon session is set to begin. Discussions will focus on the armed forces' response to Pakistan. The Pahalgam attack and Operation Sindoor will also be addressed. The opposition seeks accountability from the government regarding the attack.…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/centre-to-discuss-courage-valour-of-armed-forces-in-parliament-bjp-leader-mayank-nayak/articleshow/122804598.cms",
    "timestamp": "2025-07-21T02:24:41Z"
  },
  {
    "title": "Trump calls Bitcoin speech by Coin Center director the GOAT",
    "description": "Trump's endorsement of Bitcoin marks a significant shift in US crypto policy, potentially influencing global financial systems and regulations.\nThe post Trump calls Bitcoin speech by Coin Center director the GOAT appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/bitcoin-explanation-trump-praise/",
    "timestamp": "2025-07-21T02:22:59Z"
  },
  {
    "title": "Miranda Devine: Trump wins the Epstein battle — as the left, media foolishly believe prez on the skids",
    "description": "If you listened to the rest of the media — both mainstream and social media — you would think Donald Trump was on the skids, that MAGA was at last turning on the president over the so-called Epstein Files.",
    "link": "https://nypost.com/2025/07/20/opinion/miranda-devine-trump-wins-the-epstein-battle-as-the-left-media-foolishly-believe-prez-on-the-skids/",
    "timestamp": "2025-07-21T02:20:46Z"
  },
  {
    "title": "Tony Abbott and News Corp wanted to hand our sovereignty to China — so spare us the warmongering",
    "description": "Tony Abbott, News Corp and the Coalition attack Anthony Albanese for visiting China. But they happily surrendered Australian sovereignty to Beijing a decade ago.\nThe post Tony Abbott and News Corp wanted to hand our sovereignty to China — so spare us the warm…",
    "link": "http://www.crikey.com.au/2025/07/21/news-corp-coalition-tony-abbott-criticism-albanese-china-trip-hypocritical/",
    "timestamp": "2025-07-21T02:17:20Z"
  },
  {
    "title": "5 reasons Wall Street is in chill mode",
    "description": "Key US indexes have been hitting record highs on a winning streak post \"Liberation Day.\"",
    "link": "https://markets.businessinsider.com/news/stocks/reasons-why-wall-street-stock-markets-complacent-trump-trade-tariffs-2025-7",
    "timestamp": "2025-07-21T02:14:26Z"
  },
  {
    "title": "AI-generated Obama arrest video shared by Trump",
    "description": "President Trump shared an AI-generated video of former President Obama being arrested after Tulsi Gabbard's allegations that Obama's intelligence officials manufactured Russia hoax.",
    "link": "https://www.foxnews.com/politics/trump-posts-ai-generated-video-showing-obama-getting-arrested-ymca",
    "timestamp": "2025-07-21T02:12:35Z"
  },
  {
    "title": "Still waiting for a fourth stimulus cheque in July or August? Here's why that $2,000 isn't coming",
    "description": "Stimulus Checks: Talk of a new $2,000 stimulus cheque landing in July or August 2025 has gone viral. But as of now, neither the IRS nor the US Congress has proposed or approved such a payment. The rumour, fuelled by social media and unverified reports, has no…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/still-waiting-for-a-fourth-stimulus-cheque-in-july-or-august-heres-why-that-2000-isnt-coming-this-is-what-you-can-still-claim/articleshow/122804465.cms",
    "timestamp": "2025-07-21T02:07:30Z"
  },
  {
    "title": "EU to prepare retaliation plan as U.S. trade stance hardens",
    "description": "The overwhelming preference is to keep negotiations with Washington on track in a bid for an outcome to the impasse ahead of next month’s deadline.",
    "link": "https://www.japantimes.co.jp/business/2025/07/21/eu-retaliation-plan-us-trade/",
    "timestamp": "2025-07-21T02:07:00Z"
  },
  {
    "title": "Rupee to track dollar recovery, bond market focused on rate cut bets",
    "description": "The Indian Rupee's performance hinges on the dollar's strength this week. Bond movements will depend on expected interest rate cuts by the Reserve Bank of India. Traders anticipate the rupee fluctuating between 85.80 and 86.70. Market participants will closel…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/rupee-to-track-dollar-recovery-bond-market-focused-on-rate-cut-bets/articleshow/122804464.cms",
    "timestamp": "2025-07-21T02:01:42Z"
  },
  {
    "title": "Xi Plans Summit with Trump and Putin During WWII Anniversary Parade",
    "description": "China is positioning itself to host a summit with US President Donald Trump and Russian President Vladimir Putin, with the aim of aligning their meeting with the 80th anniversary of the end of the Second World War, as was reported on July 18. As China prepare…",
    "link": "https://freerepublic.com/focus/f-news/4329824/posts",
    "timestamp": "2025-07-21T02:01:27Z"
  },
  {
    "title": "President Trump Sets Internet on Fire with Video of Obama Getting Arrested by FBI Agents and Tossed Into Jail",
    "description": "President Trump set the internet on fire on Sunday evening after he posted an AI video of Barack Obama being arrested by FBI agents and tossed in prison.\nThe post President Trump Sets Internet on Fire with Video of Obama Getting Arrested by FBI Agents and Tos…",
    "link": "https://www.thegatewaypundit.com/2025/07/president-trump-sets-internet-fire-video-obama-getting/",
    "timestamp": "2025-07-21T02:00:51Z"
  },
  {
    "title": "Trump's attempt to terminate Musk's contracts backfires as review reveals NASA's reliance on SpaceX",
    "description": "Donald Trump's efforts to cut ties with Elon Musk and SpaceX hit a road block when a formal review laid out just how crucial his contracts are to America's dominance in space. Trump had suggested at the height of his feud with the world's richest man that the…",
    "link": "https://freerepublic.com/focus/f-news/4329823/posts",
    "timestamp": "2025-07-21T02:00:44Z"
  },
  {
    "title": "Did Hugh Hefner ban Trump from Playboy Mansion? Here's what we know",
    "description": "Hefner reportedly soured on Trump at the end of his life. Snopes examined the reasons for the falling-out.",
    "link": "https://www.snopes.com//news/2025/07/21/hefner-trump-playboy-mansion/",
    "timestamp": "2025-07-21T02:00:00Z"
  },
  {
    "title": "The Wolff-Epstein Tapes",
    "description": "Michael Wolff is sitting on a trove of 100 hours of interviews with Jeffrey Epstein and says he sent the disgraced financier a message only hours before his death.\nThe post The Wolff-Epstein Tapes appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/20/the-wolff-epstein-tapes/",
    "timestamp": "2025-07-21T01:57:28Z"
  },
  {
    "title": "Trump’s Budget Could Break the Economy",
    "description": "For once, the deficit hawks are right. The tax cuts for the wealthy in the Republican budget could cause the third economic meltdown this century. Unlike the Financial Crisis and the pandemic, we couldn't spend our way out.\nThe post Trump’s Budget Could Break…",
    "link": "http://washingtonmonthly.com/2025/07/20/trumps-deficits-could-break-the-economy/",
    "timestamp": "2025-07-21T01:56:34Z"
  }
]