[
  {
    "title": "Trump warns 'hell to pay' if Honduras changes election results",
    "description": "United States President Donald Trump said \"it looks like\" Honduras is \"trying to change the results\" of Sunday's presidential election and warned there \"will be hell to pay\" should this turn out to be...",
    "link": "https://biztoc.com/x/98e5cd94913edf73",
    "timestamp": "2025-12-02T03:06:03Z"
  },
  {
    "title": "'There will be hell to pay!' Trump threatens foreign country over election results",
    "description": "President Donald Trump threatened a foreign country in a new social media post on Monday night over the country's election results. \"Looks like Honduras is trying to change the results of their Presidential Election. If they do, there will be hell to pay!\" Tr…",
    "link": "https://www.rawstory.com/trump-2674360025/",
    "timestamp": "2025-12-02T03:04:44Z"
  },
  {
    "title": "ALLIES FLEEING...",
    "description": "Venezuelan President Nicolás Maduro appears even more isolated this week after losing two regional allies, Honduras and St. Vincent and the Grenadines, at the polls as he confronts Washington’s naval buildup in the Caribbean.",
    "link": "https://www.cnn.com/2025/12/01/americas/venezuela-allies-diplomacy-us-military-caribbean-latam-intl",
    "timestamp": "2025-12-02T03:00:16Z"
  },
  {
    "title": "'Not acceptable': Red-state Republicans demand answers from Trump on drug policy chaos",
    "description": "President Donald Trump is facing harsh criticism from Republican senators in solidly red states over his exploding drug policy scandals.According to Semafor's Burgess Everett, several GOP senators are upset both over recent reports that Trump's military comma…",
    "link": "https://www.rawstory.com/gop-senators-2674359984/",
    "timestamp": "2025-12-02T02:59:01Z"
  },
  {
    "title": "Sen. Murphy: Hegseth Has to 'Resign' or Trump Has to 'Fire Him'",
    "description": "Monday on CNN's \"OutFront,\" Sen. Chris Murphy (D-CT) said Secretary of War Pete Hegseth must resign, or President Donald Trump should fire him over the follow-up strike on a drug boat in the Caribbean in September.\nThe post Sen. Murphy: Hegseth Has to ‘Resign…",
    "link": "https://www.breitbart.com/clips/2025/12/01/sen-murphy-hegseth-has-to-resign-or-trump-has-to-fire-him/",
    "timestamp": "2025-12-02T02:55:52Z"
  },
  {
    "title": "‘WE DON’T WANT THEM’: Kristi Noem Urges Trump To Issue ‘Travel Ban on Every Damn Country That’s Been Flooding Our Nation With Killers, Leeches’",
    "description": "Noem urged President Trump to issue a full travel ban on \"every damn country that's been flooding our nation with killers, leeches, and entitlement junkies.\"\nThe post ‘WE DON’T WANT THEM’: Kristi Noem Urges Trump To Issue ‘Travel Ban on Every Damn Country Tha…",
    "link": "https://www.mediaite.com/politics/we-dont-want-them-kristi-noem-urges-trump-to-issue-travel-ban-on-every-damn-country-thats-been-flooding-our-nation-with-killers-leeches/",
    "timestamp": "2025-12-02T02:55:07Z"
  },
  {
    "title": "Watch: Melania Trump reveals White House Christmas decorations",
    "description": "This year's theme is \"Home Is Where the Heart Is\" and features Lego portraits of Donald Trump and George Washington, and 3D-printed ornaments.",
    "link": "https://www.bbc.com/news/videos/cwyg7vvrp3ro",
    "timestamp": "2025-12-02T02:53:16Z"
  },
  {
    "title": "‘Why Would He Do It?’: Gregg Jarrett Explains Why Walz Let MN Taxpayers Get Fleeced Out Of $100 Billion",
    "description": "Gregg Jarrett said that Democratic Minnesota Gov. Tim Walz allowed the state’s massive COVID-era fraud scandal to fester.",
    "link": "https://dailycaller.com/2025/12/01/gregg-jarrett-tim-walz-minnesota-somali-fraud-covid/",
    "timestamp": "2025-12-02T02:51:28Z"
  },
  {
    "title": "Putin Slams European Leaders for Triggering Panic in the Russian Federation",
    "description": "Brussels is openly opposing the attempts by Donald Trump to end the conflict in Ukraine, desperately seeking ways to gain influence and relevance.\nThe post Putin Slams European Leaders for Triggering Panic in the Russian Federation appeared first on Global Re…",
    "link": "https://www.globalresearch.ca/putin-slams-european-leaders-scaring-citizens/5907512",
    "timestamp": "2025-12-02T02:50:02Z"
  },
  {
    "title": "'Not Going To Silence Me': Mark Kelly Takes Down Trump, Hegseth Amid Pentagon Probe",
    "description": "The senator and U.S. Navy veteran reminded the president and the defense secretary why he won't be intimidated by them.",
    "link": "https://www.huffpost.com/entry/mark-kelly-trump-pete-hegseth-investigation_n_692e2ad8e4b017c8f3f98657",
    "timestamp": "2025-12-02T02:48:27Z"
  },
  {
    "title": "White House says admiral ordered follow-up strike on alleged drug boat, insists attack was lawful",
    "description": "The White House says a Navy admiral ordered a second strike on an alleged drug boat in the Caribbean Sea and insists the September attack that has come under bipartisan scrutiny was lawful",
    "link": "https://abcnews.go.com/US/wireStory/white-house-admiral-ordered-follow-strike-alleged-drug-128014230",
    "timestamp": "2025-12-02T02:45:51Z"
  },
  {
    "title": "WSJ warns Trump may have shot himself in the foot with strikes",
    "description": "The Wall Street Journal's conservative editorial board on Monday slammed President Donald Trump's strikes against alleged drug boats in international waters and argued the move could backfire on the president. The Trump administration has conducted more than …",
    "link": "https://www.rawstory.com/wall-street-journal-2674360008/",
    "timestamp": "2025-12-02T02:42:33Z"
  },
  {
    "title": "National Guard member who survived D.C. shooting shows signs of improvement",
    "description": "The National Guard member hospitalized in critical condition after a fellow guard member was fatally shot near the White House is improving, West Virginia's governor said Monday",
    "link": "https://www.nbcnews.com/news/us-news/guard-member-survived-dc-attack-shows-signs-improvement-west-virginia-rcna246893",
    "timestamp": "2025-12-02T02:42:14Z"
  },
  {
    "title": "Australia won't be intimidated by firms over social media ban, minister tells BBC",
    "description": "Anika Wells says she is 'ready to help' nations that wish to copy Australia's social media ban for under-16s.",
    "link": "https://www.bbc.com/news/articles/cnv2z059745o",
    "timestamp": "2025-12-02T02:40:47Z"
  },
  {
    "title": "Shooting of National Guard members prompts flurry of US immigration restrictions",
    "description": "The Trump administration has announced new immigration restrictions following the shooting of two National Guard members by a suspect who is an Afghan national",
    "link": "https://abcnews.go.com/US/wireStory/shooting-national-guard-members-prompts-flurry-us-immigration-128017967",
    "timestamp": "2025-12-02T02:37:34Z"
  },
  {
    "title": "Noem calls for 'full travel ban' on countries 'flooding' US with immigrants after DC attack",
    "description": "Homeland Security Secretary Kristi Noem announced Monday that, following a meeting with President Donald Trump, she is recommending a sweeping travel ban on every country she claims is sending dangerous immigrants to the United States. Noem made the announcem…",
    "link": "https://freerepublic.com/focus/f-news/4355531/posts",
    "timestamp": "2025-12-02T02:36:00Z"
  },
  {
    "title": "'12-YEAR-OLD PLAYING ARMY'",
    "description": "'12-YEAR-OLD PLAYING ARMY'\r\n\n \n \n \n (Main headline, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:WAR CRIME?\r\nHEGSETH BLOODLUST\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.washingtonexaminer.com/news/senate/3903298/kelly-hegseth-illegal-orders-double-tap/",
    "timestamp": "2025-12-02T02:34:37Z"
  },
  {
    "title": "'Get the hell out': GOP senator has harsh words after bombshell report on Pentagon strike",
    "description": "Sen. Thom Tillis (R-NC) delivered a sharp rebuke on Monday following reports on the Pentagon's controversial boat strike, in which Defense Secretary Pete Hegseth was reported to have authorized a second attack on survivors of an initial strike. If the allegat…",
    "link": "https://www.rawstory.com/thom-tillis-2674359998/",
    "timestamp": "2025-12-02T02:34:07Z"
  },
  {
    "title": "Monday Night Open Thread",
    "description": "Super busy day today with the back to work stuff and on top of it we went in and got Joelle’s cryo injection into her knee before her surgery on the 16th. If you don’t know, there is apparently a new technique where they numb the area with lidocaine, locate t…",
    "link": "https://balloon-juice.com/2025/12/01/monday-night-open-thread-118/",
    "timestamp": "2025-12-02T02:34:04Z"
  },
  {
    "title": "China Can Still Meet Ambitious US Soybean Pledge, Traders Say",
    "description": "China is expected to step up US soybean purchases to meet a pledge to buy at least 12 million tons by the end of the year, according to multiple traders, underscoring a wider market hope that — at least in agriculture — a fragile trade truce can hold.",
    "link": "https://financialpost.com/pmn/business-pmn/china-can-still-meet-ambitious-us-soybean-pledge-traders-say",
    "timestamp": "2025-12-02T02:33:56Z"
  },
  {
    "title": "Donald Trump's MRI test results released by White House doctor - BBC",
    "description": "Donald Trump's MRI test results released by White House doctorBBC White House releases details of Trump’s medical imaging, saying results were ‘perfectly normal’CNN Trump October MRI results were 'perfectly normal,' White House doctor saysCNBC White House giv…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180255261",
    "timestamp": "2025-12-02T02:33:12Z"
  },
  {
    "title": "'My god': Megyn Kelly shocks observers with 'incredibly gross' remark on Trump's strikes",
    "description": "Political analysts and observers were stunned on Monday after a high-profile GOP media personality made an \"incredibly gross\" claim about the lethal strikes President Donald Trump's administration has conducted against alleged drug traffickers. During a new e…",
    "link": "https://www.rawstory.com/megyn-kelly-2674359986/",
    "timestamp": "2025-12-02T02:25:24Z"
  },
  {
    "title": "US approves $1B sale of helicopter parts, training to Saudi Arabia",
    "description": "The US approves a potential $1B sale to Saudi Arabia for helicopter support, spares, and training services, covering the Royal Saudi Land Forces Aviation Corps’ fleet.",
    "link": "https://www.israelnationalnews.com/news/418669",
    "timestamp": "2025-12-02T02:25:18Z"
  },
  {
    "title": "Costco Sues Trump Administration, Seeks ‘Full Refund’ of Tariffs",
    "description": "Costco is suing the federal government, asking the court to strike down President Donald Trump's executive order on tariffs.\nThe post Costco Sues Trump Administration, Seeks ‘Full Refund’ of Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/lawcrime/costco-sues-trump-administration-seeks-full-refund-of-tariffs/",
    "timestamp": "2025-12-02T02:11:52Z"
  },
  {
    "title": "For Trump, Hegseth’s take-no-prisoners approach is a growing liability",
    "description": "As investigations mount into the legality of strikes that have killed scores of people in the waters off Venezuela, his take-no-prisoners, leave-no-survivors approach has led even Republican supporters to demand answers.",
    "link": "https://indianexpress.com/article/world/for-trump-hegseth-take-no-prisoners-approach-is-a-growing-liability-10397044/",
    "timestamp": "2025-12-02T02:11:39Z"
  },
  {
    "title": "Rupee has fallen and that is not a bad thing",
    "description": "The Reserve Bank of India’s (RBI) data shows the REER index dipping from an all-time high of 108.1 in November 2024 to 97.5 in October 2025.",
    "link": "https://indianexpress.com/article/opinion/editorials/rupee-has-fallen-and-that-is-not-a-bad-thing-10396775/",
    "timestamp": "2025-12-02T02:10:32Z"
  },
  {
    "title": "Oil rises on geopolitical risks to supply",
    "description": "Oil prices edged higher for a second day, influenced by Ukrainian drone strikes on Russian energy sites and escalating U.S.-Venezuela tensions. The Caspian Pipeline Consortium resumed some shipments after a drone attack, while analysts anticipate continued ma…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rises-on-geopolitical-risks-to-supply/articleshow/125707431.cms",
    "timestamp": "2025-12-02T02:09:56Z"
  },
  {
    "title": "UN chief proposes slashing 2026 budget by $577 million, cutting 18% of jobs",
    "description": "The UN faces a significant cash crisis, prompting Secretary-General Guterres to propose a $577 million budget cut and over 18% job reductions.  This move aims to boost efficiency as the organization turns 80.  Outstanding U.S. arrears are a major driver of th…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/un-chief-proposes-slashing-2026-budget-by-577-million-cutting-18-of-jobs/articleshow/125707414.cms",
    "timestamp": "2025-12-02T02:07:44Z"
  },
  {
    "title": "Gold edges lower as investors book profits",
    "description": "Gold prices dipped slightly in early Asian trading after reaching a six-week high, as investors took profits ahead of key Federal Reserve remarks and economic data. Market participants are closely watching for interest rate cut cues, with U.S. rate futures in…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-lower-as-investors-book-profits/articleshow/125707371.cms",
    "timestamp": "2025-12-02T02:04:55Z"
  },
  {
    "title": "Costco Sues Trump Administration, Demands Refund On Tariffs",
    "description": "The popular members-only retailer has said about one-third of its sales are on imported goods.",
    "link": "https://www.huffpost.com/entry/costco-sues-trump-tariffs_n_692e2b87e4b017c8f3f986bd",
    "timestamp": "2025-12-02T02:04:23Z"
  },
  {
    "title": "Far-left commentator condemns ‘White MAGA voters,’ declares America will become 's---hole' without immigrants",
    "description": "Wajahat Ali sparked controversy by condemning White Trump supporters' culture and predicting America would become a \"s---hole\" without immigrants like him.",
    "link": "https://www.foxnews.com/media/far-left-commentator-condemns-white-maga-voters-declares-america-become-s-hole-without-immigrants",
    "timestamp": "2025-12-02T02:00:18Z"
  },
  {
    "title": "Noem Wants Full Travel Ban on Every County ‘Flooding’ U.S. With Killers, Leeches",
    "description": "\"WE DON'T WANT THEM. NOT ONE.\"\nThe post Noem Wants Full Travel Ban on Every County ‘Flooding’ U.S. With Killers, Leeches first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/noem-wants-full-travel-ban-on-every-county-flooding-u-s-with-killers-leeches/",
    "timestamp": "2025-12-02T02:00:12Z"
  },
  {
    "title": "The IMF’s critique of India’s economic statistics is not a cause for alarm but a cue to improve data quality",
    "description": "The Fund awarded India a ‘C’ grade in its assessment of our macro data quality. Its criticism of our estimates is best taken as a cue to further improve the country’s statistical framework. Thankfully, remedial work has already begun.",
    "link": "https://www.livemint.com/opinion/online-views/imf-india-economic-statistics-data-quality-international-monetary-fund-mospi-gdp-11764592323494.html",
    "timestamp": "2025-12-02T02:00:00Z"
  },
  {
    "title": "Oil prices steady on worries about geopolitical risks to supply",
    "description": "Dec 2 : Oil prices held firm in early trading on Tuesday as market participants assessed risks stemming from Ukrainian drone strikes on Russian energy sites, mounting U.S.-Venezuela tensions and mixed expectations for U.S. fuel inventories.Brent crude futures…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-steady-worries-about-geopolitical-risks-supply-5521601",
    "timestamp": "2025-12-02T01:58:29Z"
  },
  {
    "title": "Oil rises on geopolitical risks to supply",
    "description": "Dec 2 : Oil prices climbed in early trade on Tuesday for a second consecutive session as market participants assessed risks stemming from Ukrainian drone strikes on Russian energy sites and mounting U.S.-Venezuela tensions.Brent crude futures rose 14 cents, o…",
    "link": "https://www.channelnewsasia.com/business/oil-rises-geopolitical-risks-supply-5521601",
    "timestamp": "2025-12-02T01:58:29Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,377",
    "description": "These are the key developments from day 1,377 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/2/russia-ukraine-war-list-of-key-events-day-1377",
    "timestamp": "2025-12-02T01:54:33Z"
  },
  {
    "title": "Trump’s righteous Education Dept. battle against abject failure",
    "description": "Despite spending a staggering $4 trillion since it was established, the department has done nothing to meet its original mandate. Time to shut it down.",
    "link": "https://nypost.com/2025/12/01/opinion/trumps-education-dept-fight-strikes-a-mortal-blow-to-big-government/",
    "timestamp": "2025-12-02T01:52:26Z"
  },
  {
    "title": "Who is Kevin Hassett? The rumored Fed pick says inflation is ‘way down,’ sees ‘political bias’ in data",
    "description": "The National Economic Council chief Kevin Hassett is suddenly the name to beat in the race to replace Jerome Powell at the Federal Reserve. Prediction markets are leaning his way; President Donald Trump cheekily hinted that he “knows who he’s going to pick”; …",
    "link": "https://biztoc.com/x/619584e167acef1d",
    "timestamp": "2025-12-02T01:48:22Z"
  },
  {
    "title": "Madonna Calls Trump's World AIDS Day Decision 'Unthinkable'",
    "description": "\"I refuse to acknowledge that these people have died in vain,\" the pop star wrote on Instagram.",
    "link": "https://www.huffpost.com/entry/madonna-trump-world-aids-day_n_692e27b0e4b017c8f3f98624",
    "timestamp": "2025-12-02T01:46:24Z"
  },
  {
    "title": "Michael Douglas, Catherine Zeta-Jones Reportedly Livid Over Son’s Embarrassing CNN Appearance",
    "description": "Michael Douglas and Catherine Zeta-Jones are reportedly fuming after their son Dylan Douglas was left visibly rattled and embarrassed during a political roundtable.",
    "link": "https://dailycaller.com/2025/12/01/michael-douglas-catherine-zeta-jones-livid-dylan-embarrassing-cnn-appearance/",
    "timestamp": "2025-12-02T01:44:21Z"
  },
  {
    "title": "Donald Trump Strikes 'Renewable' From National Renewable Energy Lab",
    "description": "The Trump administration is renaming the National Renewable Energy Laboratory the National Laboratory of the Rockies, in its latest move to re-characterise federal entities associated with clean energy.",
    "link": "https://www.ndtvprofit.com/world/donald-trump-strikes-renewable-from-national-renewable-energy-lab",
    "timestamp": "2025-12-02T01:42:34Z"
  },
  {
    "title": "Trump Puts Senate GOP on Blast, Demands They End ‘Gridlock’",
    "description": "President Donald Trump put Republicans in the Senate on blast, Monday, demanding that they end their \"gridlock\" and vote to terminate the filibuster.\nThe post Trump Puts Senate GOP on Blast, Demands They End ‘Gridlock’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-puts-senate-gop-on-blast-demands-they-end-gridlock/",
    "timestamp": "2025-12-02T01:41:36Z"
  },
  {
    "title": "Monday Afternoon News Updates - 12/1/25 (Ben Meiselas/Meidas+)",
    "description": "Ben Meiselas / Meidas+:\nMonday Afternoon News Updates - 12/1/25  —  Hi all, Ben here.  —  I hope you were able to get some rest and detach a little bit over the long weekend.  Let me fill you in on what's happening today.  —  An erratic Donald Trump returned …",
    "link": "https://www.memeorandum.com/251201/p120",
    "timestamp": "2025-12-02T01:40:01Z"
  },
  {
    "title": "The Game Wants Diddy, R. Kelly Freed From Prison",
    "description": "The Game got on his soap box at his birthday party ... grabbing the mic and telling the world to free Diddy and R. Kelly ... and then he started talking baby oil and urination ... and it's all on video. TMZ obtained footage from The Game's Friday…",
    "link": "https://www.tmz.com/2025/12/01/the-game-says-free-diddy-r-kelly/",
    "timestamp": "2025-12-02T01:38:52Z"
  },
  {
    "title": "U.S. moves to deepen minerals supply chain in AI race with China",
    "description": "The initiative, which builds on efforts dating back to the first administration of President Donald Trump, unfolds as the U.S. looks to cut its dependence on China.",
    "link": "https://biztoc.com/x/ea761bc153f9c99c",
    "timestamp": "2025-12-02T01:37:20Z"
  },
  {
    "title": "Is Economic Anxiety Driving People to Socialism?",
    "description": "This week, editors Peter Suderman, Katherine Mangu-Ward, Nick Gillespie, and Matt Welch dig into the disconnect between strong Black Friday spending and a public mood shaped by rising costs, economic anxiety, and slipping approval numbers for President Donald…",
    "link": "https://biztoc.com/x/2edf895b4829d653",
    "timestamp": "2025-12-02T01:37:17Z"
  },
  {
    "title": "US escalation with Maduro halts deportation flights to Venezuela",
    "description": "Venezuela halts deportation flights as Trump escalates military pressure on Maduro government, ending key cooperation between Washington and Caracas.",
    "link": "https://www.foxnews.com/politics/us-escalation-maduro-halts-deportation-flights-venezuela",
    "timestamp": "2025-12-02T01:35:38Z"
  },
  {
    "title": "Trump Signs Law To Unlock Billions For Drug Addiction Recovery",
    "description": "President Donald Trump on Monday signed into law a measure authorizing billions of dollars in federal funding to help prevent drug overdoses and aid patients recovering from addiction, according to the White House.",
    "link": "https://www.ndtvprofit.com/world/trump-signs-law-to-unlock-billions-for-drug-addiction-recovery",
    "timestamp": "2025-12-02T01:35:26Z"
  },
  {
    "title": "Suffolk World AIDS Day celebrants say life is all the recognition they need",
    "description": "Suffolk World AIDS Day celebrants say life is all the recognition they neednewsday.com",
    "link": "https://www.newsday.com/news/health/world-aids-day-h-lee-dennison-building-in-hauppauge-pnv3ru4b",
    "timestamp": "2025-12-02T01:35:15Z"
  },
  {
    "title": "Costco sues US to preserve tariff refunds if Trump loses appeal",
    "description": "Costco has sued the U.S. government to secure potential refunds if the Supreme Court rejects President Trump's tariff authority. The retail giant argued that U.S. Customs and Border Protection denied its request for more time to calculate tariffs, jeopardizin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/costco-sues-us-to-preserve-tariff-refunds-if-trump-loses-appeal/articleshow/125707147.cms",
    "timestamp": "2025-12-02T01:31:47Z"
  },
  {
    "title": "Anti-ICE chaos in Lower Manhattan is a sign of trouble ahead",
    "description": "New York’s ever-ready professional protesters have wreaked havoc, but with Zohran Mamdani and other pols backing them, the situation's sure to get worse.",
    "link": "https://nypost.com/2025/12/01/opinion/anti-ice-chaos-in-lower-manhattan-is-a-taste-of-whats-to-come-if-mamdani-amp-feds-cant-cooperate/",
    "timestamp": "2025-12-02T01:27:10Z"
  },
  {
    "title": "Sometimes In Life, You Get What You Ask For",
    "description": "Cue the tiny violins: Joe Ceballos, a longtime Republican and small-town mayor in Kansas, is facing felony voter fraud charges and possible deportation from the presidential administration he voted for. Kansas Attorney General Kris Kobach (R) announced the ch…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/sometimes-in-life-you-get-what-you-ask-for-4",
    "timestamp": "2025-12-02T01:23:33Z"
  },
  {
    "title": "Is Economic Anxiety Driving People to Socialism?",
    "description": "Plus: War crime allegations against Hegseth, Congress threatens the legal hemp industry, and reflections on the legacy of Tom Stoppard",
    "link": "https://reason.com/podcast/2025/12/01/is-economic-anxiety-driving-people-to-socialism/",
    "timestamp": "2025-12-02T01:23:25Z"
  },
  {
    "title": "Hooray for Manhattan US Attorney Jay Clayton and his war against gangs",
    "description": "How about that: Trump-appointed Chairman Jay Clayton is standing up for public-housing tenants.",
    "link": "https://nypost.com/2025/12/01/opinion/hooray-for-manhattan-us-attorney-jay-clayton-and-his-war-against-gangs/",
    "timestamp": "2025-12-02T01:19:14Z"
  },
  {
    "title": "'A taste of what's to come': GOP ex-Speaker issues stark warning about Republican turnover",
    "description": "A former Republican Speaker of the House issued a stark warning to Speaker Mike Johnson (R-LA) on Monday about the party's chances of maintaining its majority following the 2026 midterm election. Former Speaker Kevin McCarthy discussed the Republican Party's …",
    "link": "https://www.rawstory.com/kevin-mccarthy-2674359946/",
    "timestamp": "2025-12-02T01:18:25Z"
  },
  {
    "title": "US confirms South Korea's 15% tariff rate retroactive to November 1",
    "description": "Tariffs on South Korean imports, including cars, will now be 15 per cent, effective from November 1. The U.S. is also removing tariffs on airplane parts. South Korea has agreed to invest billions in U.S. industries. This move strengthens the economic partners…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-confirms-south-koreas-15-tariff-rate-retroactive-to-november-1/articleshow/125707065.cms",
    "timestamp": "2025-12-02T01:16:19Z"
  },
  {
    "title": "Indiana Republican Says He Received Bomb Threats After Breaking With Trump",
    "description": "Indiana State Senator Mike Bohacek announced on Monday that his family \"received threats of a bomb placed at our home\" after the Republican lawmaker recently broke with President Donald Trump on redistricting efforts in the state.\nNewsweek reached out Bohacek…",
    "link": "https://biztoc.com/x/ed7862b7e9b6780c",
    "timestamp": "2025-12-02T01:14:58Z"
  },
  {
    "title": "Disease-Ridden Homosexuals Stage Border ‘Kiss-In’ To Protest Trump Immigration Policies",
    "description": "A group of HIV-positive men gathered at the U.S.–Mexico border Sunday and staged a coordinated \"kiss-in.\"",
    "link": "https://dailycaller.com/2025/12/01/hiv-positive-mexico-border-kiss-in-protest-trump-policy/",
    "timestamp": "2025-12-02T01:12:16Z"
  },
  {
    "title": "Oil Holds Gain As Traders Focus On Venezuela, Black Sea Outage",
    "description": "Oil held a gain as the market watched for US President Donald Trump’s next steps on Venezuela, and assessed the fallout from damage to a crude export terminal in the Black Sea. West Texas Intermediate was steady above $59 a barrel after advancing 1.3% in the …",
    "link": "https://www.ndtvprofit.com/markets/oil-holds-gain-as-traders-focus-on-venezuela-black-sea-outage",
    "timestamp": "2025-12-02T01:09:46Z"
  },
  {
    "title": "Noem calls for 'full travel ban' on countries 'flooding' US with immigrants after DC attack",
    "description": "Homeland Security Secretary Kristi Noem recommends a sweeping travel ban on countries sending dangerous immigrants to U.S. following meeting with Trump.",
    "link": "https://www.foxnews.com/politics/noem-calls-full-travel-ban-countries-flooding-us-immigrants-dc-attack",
    "timestamp": "2025-12-02T01:06:37Z"
  },
  {
    "title": "Fees to Access National Parks to Significantly Increase For Visitors of the United States",
    "description": "As part of an effort to modernize access and keep fees for citizens of the United States affordable, the National Park Service of the United States will substantially increase fees for visitors from foreign countries.\nEffective as of...\nThe post Fees to Acces…",
    "link": "https://thegatewithbriancohen.com/fees-to-access-national-parks-to-significantly-increase-for-visitors-of-the-united-states/",
    "timestamp": "2025-12-02T01:03:38Z"
  },
  {
    "title": "White House account of second strike on alleged drug boat at odds with what Trump said",
    "description": "White House account of second strike on alleged drug boat at odds with what Trump saidgo.com",
    "link": "https://abcnews.go.com/Politics/white-house-account-strike-alleged-drug-boat-odds/story?id=128006261",
    "timestamp": "2025-12-02T00:56:46Z"
  },
  {
    "title": "Gov. Walz, President Trump clash on Somali immigration in Minnesota",
    "description": "After President Trump posted that Somali refugees were \"completely taking over\" Minnesota, Gov. Walz accused Trump of \"demonizing an entire community.\"",
    "link": "https://www.kare11.com/article/news/politics/gov-walz-president-trump-clash-on-somali-immigration-in-minnesota/89-c4d6c4ef-5fa2-46df-aefd-a6a7323439cb",
    "timestamp": "2025-12-02T00:48:56Z"
  },
  {
    "title": "Monday, December 1. Russia’s War On Ukraine: News And Information From Ukraine.",
    "description": "Dispatches from Ukraine. Day 1,377.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/12/01/monday-december-1-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-12-02T00:47:43Z"
  },
  {
    "title": "Costco sues Trump's tariff in bid to secure refund before Supreme Court ruling",
    "description": "In a complaint submitted Friday, the retailer said it is seeking a \"full refund\" of duties it paid after Trump levied tariffs.",
    "link": "https://www.businessinsider.com/costco-sues-trumps-tariff-in-bid-to-secure-refund-2025-12",
    "timestamp": "2025-12-02T00:47:40Z"
  },
  {
    "title": "On World AIDS Day, thinking of progress and how to build on it in the face of hostility",
    "description": "On World AIDS Day, it’s worth remembering how far we’ve come in combating HIV and AIDS — and that we can cross the finish line to eliminate the disease, says Matthew Rose, senior public policy advocate at the Human Rights Campaign.",
    "link": "https://www.advocate.com/news/world-aids-day-progress-setbacks",
    "timestamp": "2025-12-02T00:47:27Z"
  },
  {
    "title": "Trump Signs Bill Raising Pension for Medal of Honor Recipients",
    "description": "President Donald Trump signed a pair of bills on Monday, including one that substantially increases the monthly pension for Medal of Honor recipients.\nThe post Trump Signs Bill Raising Pension for Medal of Honor Recipients appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/01/trump-signs-bill-raising-pension-for-medal-of-honor-recipients/",
    "timestamp": "2025-12-02T00:47:10Z"
  },
  {
    "title": "Trump warns of major consequences if GOP fails to 'terminate the filibuster'",
    "description": "President Donald Trump renewed his calls for Republicans to get rid of the Senatorial filibuster on Monday in a meandering social media post where he attacked a former U.S. attorney general. Trump posted on Truth Social about an interview former Attorney Gene…",
    "link": "https://www.rawstory.com/trump-2674359902/",
    "timestamp": "2025-12-02T00:42:02Z"
  },
  {
    "title": "Schumer warns Congress will curb Trump on Venezuela",
    "description": "United States Senate Minority Leader Chuck Schumer warned that Congress would act if US President Donald Trump expanded military operations against Venezuela. He pointed to plans for a War Powers Reso...",
    "link": "https://biztoc.com/x/6564efe0b613924b",
    "timestamp": "2025-12-02T00:41:19Z"
  },
  {
    "title": "Trump’s push against Venezuela faces Republican blowback at pivotal moment",
    "description": "The News\nAs President Donald Trump draws closer to a potential decision on expanding his military pressure on Venezuela, his administration is facing skepticism from congressional Republicans on multiple fronts.\nGOP senators questioned the administration’s de…",
    "link": "https://biztoc.com/x/0b7448bc0952a9b9",
    "timestamp": "2025-12-02T00:41:05Z"
  },
  {
    "title": "Elissa Slotkin says she is receiving violent messages after video to military",
    "description": "Sen. Elissa Slotkin says she has received threatening messages after President Donald Trump suggested that she and several other Democrats had engaged in conduct warranting capital punishment by telling members of the military and intelligence communities tha…",
    "link": "https://biztoc.com/x/70c6478959027a37",
    "timestamp": "2025-12-02T00:41:02Z"
  },
  {
    "title": "MRI shows Trump in 'excellent' cardiovascular health: Physician",
    "description": "WASHINGTON: United States President Donald Trump has \"excellent\" cardiovascular health, his doctor said on Monday (Dec 1), citing an MRI taken during an unannounced hospital visit that ignited fresh scrutiny over his medical condition.The Republican billionai…",
    "link": "https://www.channelnewsasia.com/world/us-trump-mri-cardiovascular-health-5521421",
    "timestamp": "2025-12-02T00:36:21Z"
  },
  {
    "title": "Trump Seizes Back the Spotlight",
    "description": "That may not be the boon he thinks it is.",
    "link": "https://www.theatlantic.com/newsletters/2025/12/trump-immigration-afghanistan-shooting/685105/",
    "timestamp": "2025-12-02T00:34:00Z"
  },
  {
    "title": "Trump, Melania Return to White House After Thanksgiving in Florida",
    "description": "President Donald Trump decamped to his Mar-a-Lago resort in Florida late Tuesday for the Thanksgiving holiday with any effort to control spiking health care premiums — a key issue for Republicans whose economic appeal to voters has waned since last year’s ele…",
    "link": "https://biztoc.com/x/f64edc7606c4cadd",
    "timestamp": "2025-12-02T00:30:01Z"
  },
  {
    "title": "National Guard member Andrew Wolfe, shot in DC, has shown positive signs, West Virginia governor says",
    "description": "A West Virginia National Guard member who was shot last week in a brazen daytime attack in Washington, D.C., remains in serious condition but shows promise.",
    "link": "https://apnews.com/article/national-guard-shooting-andrew-wolfe-2321ef0cb141f1736d101f6b9c65534e",
    "timestamp": "2025-12-02T00:17:08Z"
  },
  {
    "title": "Thomas Jefferson Could Have Predicted Massive Somali Minnesota Fraud Schemes",
    "description": "Fraudsters in the Somali community of Minnesota stole billions of dollars from American taxpayers over a period of years and the state government did nothing... Read More\nThe post Thomas Jefferson Could Have Predicted Massive Somali Minnesota Fraud Schemes ap…",
    "link": "https://www.dailysignal.com/2025/12/01/thomas-jefferson-could-have-predicted-massive-somali-minnesota-fraud-schemes/",
    "timestamp": "2025-12-02T00:15:00Z"
  },
  {
    "title": "Trump slapped with major lawsuit as Costco demands refund on his tariffs",
    "description": "The wholesale membership big-box chain Costco is suing the Trump administration, demanding a refund on its tariff expenses.According to NBC News, \"The company said in a Nov. 28 filing that it is seeking a 'full refund' of all ... duties paid as a result of Pr…",
    "link": "https://www.rawstory.com/costco/",
    "timestamp": "2025-12-02T00:11:38Z"
  },
  {
    "title": "Major Canadian steel company Algoma to lay off 1,000 workers",
    "description": "Algoma said Monday it is laying off 1,000 workers and closing its blast furnace and coke-making operations.",
    "link": "https://www.thestar.com/business/canadian-steel-company-algoma-to-lay-off-40-per-cent-of-workers-blames-trump-tariffs/article_0436d338-ebac-4106-abb2-135e02d77224.html",
    "timestamp": "2025-12-02T00:11:11Z"
  },
  {
    "title": "Too-close Tennessee election warns GOP: Damning the left isn’t enough",
    "description": "Aftyn Behn's far-left views and outrageous comments should kill her election chances in a district that voted for Trump by 22 points — but she’s polling better than she has any right to.",
    "link": "https://nypost.com/2025/12/01/opinion/tennessee-vote-a-gop-warning-damning-the-left-isnt-enough/",
    "timestamp": "2025-12-02T00:10:26Z"
  },
  {
    "title": "Trump Launches 'Hall of Shame' on White House Website to Name and Shame Female Reporters He Disagrees With",
    "description": "The White House has launched a 'Hall of Shame' listing media outlets and journalists it claims 'misrepresented President Trump', with most of them being female reporters.",
    "link": "https://www.ibtimes.com/trump-launches-hall-shame-white-house-website-name-shame-female-reporters-he-disagrees-3791771",
    "timestamp": "2025-12-02T00:10:13Z"
  },
  {
    "title": "Costco joins companies suing for refunds if Trump’s tariffs fall",
    "description": "It’s one of the biggest corporate players to jump into a fight largely driven this year by small businesses and Democratic state officials.",
    "link": "https://fortune.com/2025/12/01/costco-trump-tariff-refunds-lawsuit-supreme-court-case-ieepa/",
    "timestamp": "2025-12-02T00:09:55Z"
  },
  {
    "title": "WSJ Editorial Board Says Trump Will 'Lose' If He Doesn't Oust Venezuela's Maduro",
    "description": "The Wall Street Journal's editorial board said President Donald Trump will \"lose\" if his administration's pressure campaign against the Venezuelan regime doesn't end up with the ousting of Nicolas Maduro.",
    "link": "https://www.ibtimes.com/wsj-editorial-board-says-trump-will-lose-if-he-doesnt-oust-venezuelas-maduro-3791765",
    "timestamp": "2025-12-02T00:08:07Z"
  },
  {
    "title": "Elon Musk Likens Failed DOGE to 'Save the Baby Pandas NGO' Before Its Shutdown",
    "description": "Elon Musk defended his failed Department of Government Efficiency (DOGE) by comparing fraud to a 'Save the Baby Pandas NGO' that featured no actual pandas.",
    "link": "https://www.ibtimes.com/elon-musk-likens-failed-doge-save-baby-pandas-ngo-before-its-shutdown-3791762",
    "timestamp": "2025-12-02T00:07:52Z"
  },
  {
    "title": "Boston Mayor Wu sues President Trump over $29M in federal homelessness funding cuts",
    "description": "Boston Mayor Michelle Wu said the Trump administration’s efforts to place restrictions on a critical federal funding program for housing and homelessness services will cost the city $29 million and leave 1,100 people out on the streets this winter.",
    "link": "https://www.bostonherald.com/2025/12/01/boston-mayor-wu-sues-president-trump-over-29m-in-federal-homelessness-funding-cuts/",
    "timestamp": "2025-12-02T00:04:03Z"
  },
  {
    "title": "Scott Bessent: Treasury Department to Investigate Allegations of Minnesota Taxpayer Funds Being 'Diverted' to Al-Shabaab",
    "description": "Treasury Secretary Scott Bessent announced that the Treasury Department was investigating reports that Minnesota taxpayer funds \"may have been diverted to the terrorist organization\" Al-Shabaab.\nThe post Scott Bessent: Treasury Department to Investigate Alleg…",
    "link": "https://www.breitbart.com/politics/2025/12/01/scott-bessent-treasury-department-to-investigate-allegations-of-minnesota-taxpayer-funds-being-diverted-to-al-shabaab/",
    "timestamp": "2025-12-02T00:03:33Z"
  },
  {
    "title": "White House Claims Trump 'Has the Authority to Kill' Survivors of Boat Strikes",
    "description": "While continuing to deny that the Pentagon chief ordered those carrying out the first known US military strike on an alleged drug-running boat to \"kill everybody\" on board, the top White House spokesperson on Monday reiterated the administration's position th…",
    "link": "https://www.commondreams.org/news/trump-boat-strikes",
    "timestamp": "2025-12-02T00:02:26Z"
  },
  {
    "title": "Democratic Senator Says 'It's Very Possible There Was a War Crime Committed' in September Drug-Boat Strike",
    "description": "Sen. Chris Van Hollen, D-Md., said that \"it's very possible there was a war crime committed\" in the Trump administration's first strike against a suspected drug-trafficking boat in the Caribbean Sea in September.",
    "link": "https://www.ibtimes.com/democratic-senator-says-its-very-possible-there-was-war-crime-committed-september-drug-boat-3791751",
    "timestamp": "2025-12-02T00:01:35Z"
  },
  {
    "title": "Trump's MRI Revealed: What the White House Doctors Say",
    "description": "Donald Trump's doctor released a memo with comprehensive details of the president's health, determined through an MRI",
    "link": "https://www.ibtimes.com/trumps-mri-revealed-what-white-house-doctors-say-3791749",
    "timestamp": "2025-12-02T00:00:17Z"
  },
  {
    "title": "When Populists Unite, the Neocon Horseshoe Closes",
    "description": "The American public watched in shock and awe as the democratic socialist mayor-elect of New York City, Zohran Mamdani, and the right-wing populist President Donald Trump had a “chummy” visit in the White House. Some have cited this bewildering bond as an exam…",
    "link": "https://original.antiwar.com/jd_hester/2025/12/01/when-populists-unite-the-neocon-horseshoe-closes/",
    "timestamp": "2025-12-02T00:00:04Z"
  },
  {
    "title": "EU tells Trump: You can’t pardon Putin for war crimes in Ukraine",
    "description": "Donald Trump’s drive to secure peace in Ukraine must not let Vladimir Putin off the hook for war crimes committed by Russian forces, a top EU official has warned, effectively setting a new red line for a deal. In an interview with POLITICO, Michael McGrath, t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4355515/posts",
    "timestamp": "2025-12-01T23:56:51Z"
  },
  {
    "title": "War on Women Report: Antiabortion Extremist Charged in S.C. Shooting; Army OB-GYN Accused of Abusing Women Patients",
    "description": "MAGA Republicans are back in the White House, and Project 2025 is their guide—the right-wing plan to turn back the clock on women’s rights, remove abortion access, and force women into roles as wives and mothers in the “ideal, natural family structure.” We kn…",
    "link": "https://msmagazine.com/2025/12/01/war-on-women-report-trump-hegseth-anti-abortion-clinic-violence-fort-hood-texas-army-abuse-ob-gyn/",
    "timestamp": "2025-12-01T23:56:03Z"
  },
  {
    "title": "Radical 'feminist' group in the hot seat after anti-ICE ad goes viral: 'BEYOND evil'",
    "description": "The Women’s March is being slammed online for releasing an “insane\" and \"beyond evil\" ad attacking U.S. Immigration and Customs Enforcement, urging agents to walk away from the job.",
    "link": "https://www.foxnews.com/politics/radical-feminist-group-hot-seat-after-anti-ice-ad-goes-viral-beyond-evil",
    "timestamp": "2025-12-01T23:55:50Z"
  },
  {
    "title": "Trump rejected Maduro requests on call, options narrow for Venezuela leader, sources say",
    "description": "Dec 1 (Reuters) - Venezuela's President Nicolas Maduro is running out of options to step down and leave his country under U.S.-guaranteed safe passage, following a short call with U.S. President Donald Trump last month where Trump refused a series of requests…",
    "link": "https://www.thestar.com.my/news/world/2025/12/02/trump-rejected-maduro-requests-on-call-options-narrow-for-venezuela-leader-sources-say",
    "timestamp": "2025-12-01T23:50:00Z"
  },
  {
    "title": "Charlie Puth Responds to Backlash Over Singing National Anthem at Super Bowl: ‘It’ll Be One of My Best Vocal Performances’",
    "description": "Charlie Puth has spoken out against critics who claim that he isn’t the best choice to sing the National Anthem at the Super Bowl. On Sunday, the singer-songwriter was announced as a performer for Super Bowl LX in February alongside Coco Jones and Brandi Carl…",
    "link": "https://variety.com/2025/music/news/charlie-puth-backlash-super-bowl-national-anthem-1236596810/",
    "timestamp": "2025-12-01T23:48:34Z"
  },
  {
    "title": "Madonna Slams Trump’s Call to End World AIDS Day as ‘Unthinkable’: ‘He’s Never Watched His Best Friend Die’",
    "description": "\"I refuse to acknowledge that these people have died in vain,\" the Queen of Pop adds\nThe post Madonna Slams Trump’s Call to End World AIDS Day as ‘Unthinkable’: ‘He’s Never Watched His Best Friend Die’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/madonna-slams-trump-ending-world-aids-day/",
    "timestamp": "2025-12-01T23:46:17Z"
  },
  {
    "title": "Costco sues for Trump tariff refunds before Supreme Court rules on if they're illegal",
    "description": "Costco joins dozens of other companies that are seeking to protect their rights to refunds of Trump's tariffs without first waiting for the Supreme Court.",
    "link": "https://www.cnbc.com/2025/12/01/costco-sues-trump-tariffs-trade-supreme-court.html",
    "timestamp": "2025-12-01T23:46:06Z"
  },
  {
    "title": "Indiana Republicans Release New Congressional Map That Could Flip Multiple Seats Red",
    "description": "It may be a long shot, but Indiana House Republicans are moving forward with a new redistricting plan that could make waves.",
    "link": "https://www.westernjournal.com/indiana-republicans-release-new-congressional-map-flip-multiple-seats-red/",
    "timestamp": "2025-12-01T23:44:42Z"
  }
]