[
  {
    "title": "European Leaders React To U.S.-Ukraine Fallout: French Politician Calls Musk ‘Jester High On Ketamine’",
    "description": "The United States’ decision to freeze military aid, as well as other comments made by President Donald Trump and Vice President JD Vance, have sparked rebukes from across the European political spectrum.",
    "link": "https://www.forbes.com/sites/conormurray/2025/03/06/european-leaders-react-to-us-ukraine-fallout-french-politician-calls-musk-jester-high-on-ketamine/",
    "timestamp": "2025-03-06T16:39:06Z"
  },
  {
    "title": "Trump reaches 36.6 million television viewers for first address to Congress in second term",
    "description": "NEW YORK — President Donald Trump reached an estimated 36.6 million television viewers for his address to Congress on Tuesday night, the Nielsen company said. That beat the 32.2 million people who watched former President Joe Biden's final State of the Union …",
    "link": "https://freerepublic.com/focus/f-chat/4302530/posts",
    "timestamp": "2025-03-06T16:38:50Z"
  },
  {
    "title": "‘Whoa!’: CNN’s Harry Enten ‘Truly Surprised’ That ‘Majority’ Of Americans Want Trump And DOGE To Cut Gov’t",
    "description": "Harry Enten expressed surprise about the popularity of Donald Trump and Elon Musk’s Department of Government Efficiency (DOGE) cuts to the federal government.",
    "link": "https://dailycaller.com/2025/03/06/harry-enten-surprised-majority-americans-support-trump-doge/",
    "timestamp": "2025-03-06T16:36:43Z"
  },
  {
    "title": "Trump: Mexico not required to pay tariffs on USMCA products",
    "description": "United States President Donald Trump revealed on Thursday that following a conversation with Mexican President Claudia Sheinbaum, Mexico \"will not be required to pay Tariffs on anything that falls und...",
    "link": "https://biztoc.com/x/aaac756102a41bd8",
    "timestamp": "2025-03-06T16:36:20Z"
  },
  {
    "title": "Trump Calls on Congress to End Chips Act",
    "description": "Speaking to a joint session of Congress Tuesday night, President Donald Trump called for the repeal of the 2022 Chips Act to applause from congressional Republicans, including those whose states have benefited.\n“Your Chips Act is a horrible, horrible thing,” …",
    "link": "https://biztoc.com/x/933ce38e6bc3d871",
    "timestamp": "2025-03-06T16:36:14Z"
  },
  {
    "title": "Elon Musk’s Starlink business could soon tap into $42 billion federal program | CNN Business",
    "description": "The Commerce Department has changed its rules in a way that could open the door for Starlink, Elon Musk’s satellite internet service, to become part of a federal $42 billion grant program to bring high-speed service to rural and poor areas of the United State…",
    "link": "https://www.cnn.com/2025/03/06/business/musks-starlink-federal-program/index.html",
    "timestamp": "2025-03-06T16:36:12Z"
  },
  {
    "title": "Rep. Al Green censured by House colleagues, sings ‘We Shall Overcome’ - Roll Call",
    "description": "The House voted Thursday to censure Texas Rep. Al Green for heckling President Donald Trump during his joint address to Congress this week.",
    "link": "https://rollcall.com/2025/03/06/rep-al-green-censured-by-house-colleagues-sings-we-shall-overcome/",
    "timestamp": "2025-03-06T16:35:52Z"
  },
  {
    "title": "Bitwise makes first institutional DeFi allocation",
    "description": "Bitwise, a US asset manager, has made its first institutional DeFi allocation, depositing into Maple Finance’s overcollateralized Bitcoin lending protocol, as institutions warm up to DeFi.",
    "link": "https://cointelegraph.com/news/bitwise-makes-first-institutional-defi-allocation",
    "timestamp": "2025-03-06T16:35:00Z"
  },
  {
    "title": "This Ontario man saw U.S.-made soup on shelf with maple leaf label — one reason buying Canadian can be tricky",
    "description": "The trade war triggered by U.S. President Donald Trump's tariffs has been inspiring patriotic stances among customers at Canadian grocery stores, but buying only Canadian products isn't as simple as looking for a maple leaf — as Jim Kreski of Windsor, Ont., f…",
    "link": "https://www.cbc.ca/news/canada/windsor/buying-canadian-trade-war-freshco-1.7475613",
    "timestamp": "2025-03-06T16:34:14Z"
  },
  {
    "title": "Trump’s erratic trade policies are baffling businesses, threatening investment and economic growth",
    "description": "Trump 2.0 is proving even more unnerving to business.",
    "link": "https://www.bostonherald.com/2025/03/06/trump-tariffs-business-uncertainty/",
    "timestamp": "2025-03-06T16:33:39Z"
  },
  {
    "title": "Government Watchdog That Trump Fired Drops Lawsuit",
    "description": "Hampton Dellinger said he would drop his case following a weekslong tug-of-war with the Trump administration.",
    "link": "https://www.huffpost.com/entry/official-trump-fired-drops-lawsuit_n_67c9cc6ee4b0e47c273d4b05",
    "timestamp": "2025-03-06T16:33:16Z"
  },
  {
    "title": "As Trump goes after Education Department, staff cuts leave student loan borrowers in the dark",
    "description": "The Education Department's role working on federal student loan borrowers' complaints is at risk after significant staff cuts under Trump, agency employees say.",
    "link": "https://www.cnbc.com/2025/03/06/student-loan-borrowers-in-the-dark-as-trump-targets-education-dept.html",
    "timestamp": "2025-03-06T16:32:05Z"
  },
  {
    "title": "'Stay in your lane': George Floyd's brother blasts conservatives for backing killer cop",
    "description": "Elon Musk expressed support for a presidential pardon for Derek Chauvin, a former Minneapolis police officer convicted of the murder of George Floyd.The killing sparked nationwide \"Black Lives Matter\" protests in summer 2020 and Chauvin got concurrent sentenc…",
    "link": "https://www.rawstory.com/derek-chauvin-pardon/",
    "timestamp": "2025-03-06T16:31:35Z"
  },
  {
    "title": "Trump Will Likely Bail On Planned Canada-Mexico Tariffs, Lutnick Says",
    "description": "Howard Lutnick told CNBC “hopefully Mexico and Canada will have done a good enough job on fentanyl” that the U.S. will focus only on reciprocal tariffs.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/06/trump-will-likely-bail-on-planned-canada-mexico-tariffs-lutnick-says/",
    "timestamp": "2025-03-06T16:31:14Z"
  },
  {
    "title": "Tesla purchases soar by over 30% in Ireland amid sales slump in Europe",
    "description": "A total of 539 Tesla vehicles have been sold in Ireland so far this year.",
    "link": "https://www.thejournal.ie/tesla-sales-ireland-europe-6641598-Mar2025/",
    "timestamp": "2025-03-06T16:31:13Z"
  },
  {
    "title": "Social Security Advantage: Trump and Musk’s Evil Plan to Privatize Our Safety Net",
    "description": "Tuesday night, U.S. President Donald Trump stood before the nation and, with the full backing of billionaires like Elon Musk, laid the groundwork for the biggest heist in American history—the rapid, systematic destruction of Social Security, disguised as “ref…",
    "link": "https://www.commondreams.org/opinion/evil-plans",
    "timestamp": "2025-03-06T16:30:50Z"
  },
  {
    "title": "Mother of Jocelyn Nungaray Fires Back at ‘Shameful’ Democrats Who Refused to Stand for Her Murdered Daughter (Video)",
    "description": "In a poignant response to the Democrats' refusal to honor her daughter's memory during a recent address, Jocelyn Nungaray's mother criticizes their lack of compassion and highlights the tragedy of her daughter's murder.\nThe post Mother of Jocelyn Nungaray Fir…",
    "link": "https://www.thegatewaypundit.com/2025/03/mother-jocelyn-nungaray-fires-back-shameful-democrats-who/",
    "timestamp": "2025-03-06T16:30:10Z"
  },
  {
    "title": "'We had to cancel': Tourism industry at risk as largest visitor group boycotts Trump plans (Travis Gettys/Raw Story)",
    "description": "Travis Gettys / Raw Story:\n‘We had to cancel’: Tourism industry at risk as largest visitor group boycotts Trump plans  —  Canadians are scrapping plans to visit the U.S. to protest Donald Trump's economic and geopolitical attacks on their nation.  —  The pres…",
    "link": "https://www.memeorandum.com/250306/p67",
    "timestamp": "2025-03-06T16:30:00Z"
  },
  {
    "title": "Cedarville University aims to ease transition for international students",
    "description": "Cedarville University in the U.S. state of Ohio says it’s got more than 140 international students representing 44 countries.\n\n\nHere, the school interviews Jonathan Sutton, director of international student services. He talks about his job and the opportuniti…",
    "link": "https://www.voanews.com/a/cedarville-university-aims-to-ease-transition-for-international-students-/8000695.html",
    "timestamp": "2025-03-06T16:30:00Z"
  },
  {
    "title": "Checks and Balances",
    "description": "Still offering some hope that they are functioning, at least.A federal judge ruled in favor of dozens of states Thursday by finding that President Donald Trump’s massive federal funding freeze in late January encroached upon Congress’s power of the purse.\r\nDi…",
    "link": "https://www.eschatonblog.com/2025/03/checks-and-balances.html",
    "timestamp": "2025-03-06T16:30:00Z"
  },
  {
    "title": "What is a Strategic Bitcoin Reserve? How Nation States Could Hold BTC",
    "description": "Proponents of a strategic Bitcoin reserve argue that nation states should stockpile Bitcoin alongside assets such as gold.",
    "link": "https://decrypt.co/resources/what-is-a-strategic-bitcoin-reserve-how-nation-states-could-hold-btc",
    "timestamp": "2025-03-06T16:28:19Z"
  },
  {
    "title": "US exits $9.3 billion climate deal with developing nations",
    "description": "The United States has exited JETP, a massive climate deal designed to help South Africa, Indonesia and other developing nations transition to clean energy.",
    "link": "https://www.dw.com/en/us-exits-93-billion-climate-deal-with-developing-nations/a-71847744",
    "timestamp": "2025-03-06T16:28:00Z"
  },
  {
    "title": "Watch Live: Hearing on Preventing Wildfires After Devastating California Fires",
    "description": "The Senate Subcommittee on Conservation, Forestry, Natural Resources, and Biotechnology holds a hearing on preventing wildfires after the California fires that devastated neighborhoods around Los Angeles.\nThe post Watch Live: Hearing on Preventing Wildfires A…",
    "link": "https://www.breitbart.com/environment/2025/03/06/watch-live-hearing-on-preventing-wildfires-after-devastating-california-fires/",
    "timestamp": "2025-03-06T16:27:52Z"
  },
  {
    "title": "Madison cheese shop owner writes President Trump, says actions threaten Wisconsin dairy industry (WI)",
    "description": "MADISON, Wis. - 'Fromagination' Cheese Shop has sat across the street from the Capitol for 17 years. But the owner says this year, with executive orders and federal policies, he's concerned about the future of his business and the dairy industry. “We want to …",
    "link": "https://freerepublic.com/focus/f-chat/4302527/posts",
    "timestamp": "2025-03-06T16:27:49Z"
  },
  {
    "title": "Big Swings, Bigger Misses: Donald Trump's Administration Is Stumbling",
    "description": "Scaling back tariffs, grounding military deportation flights, and potentially abandoning government building sales; the president's radical agenda keeps colliding head-on with reality.",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-administration-is-stumbling",
    "timestamp": "2025-03-06T16:27:27Z"
  },
  {
    "title": "Democrats Hit With Brutal Poll About Their Resistance to Trump",
    "description": "Democrats so-called resistance to Donald Trump is getting bad reviews among voters. \r\nA new survey from Blueprint, a liberal research firm, found that registered voters have lost the plot on what—if anything—Democratic lawmakers are doing to oppose Trump’s sw…",
    "link": "https://newrepublic.com/post/192420/democrats-poll-resistance-donald-trump",
    "timestamp": "2025-03-06T16:26:53Z"
  },
  {
    "title": "Justice Department Drops Biden-Era Idaho Abortion Lawsuit",
    "description": "The Department of Justice has dropped a Biden-era lawsuit that had attempted to compel Idaho to allow abortions in violation of the state’s Defense of... Read More\nThe post Justice Department Drops Biden-Era Idaho Abortion Lawsuit appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/03/06/justice-department-drops-biden-era-idaho-abortion-lawsuit/",
    "timestamp": "2025-03-06T16:25:42Z"
  },
  {
    "title": "10 Democrats Vote to Censure Al Green After Trump Protest",
    "description": "Ten Democrats joined the Republican-led House in censuring Representative Al Green for disrupting Donald Trump’s speech to Congress on Tuesday and protesting the president’s aggressive cuts to Medicaid.\r\n“You have no mandate to cut Medicaid!” the Texas Democr…",
    "link": "https://newrepublic.com/post/192418/10-democrats-vote-censure-al-green-trump-protest",
    "timestamp": "2025-03-06T16:25:38Z"
  },
  {
    "title": "Trump Pulled Trans Soldier Out of Combat and Fired Her—Lawsuit",
    "description": "A special forces sergeant has been pulled out of a combat zone and fired for being trans, a lawsuit says.\nIn a lawsuit filed on February 6 against President Donald Trump and the Department of Defense, a group of soldiers said they had been fired for being tra…",
    "link": "https://biztoc.com/x/35de881fd84c6865",
    "timestamp": "2025-03-06T16:25:23Z"
  },
  {
    "title": "As Trump Hails Taking Back of Panama Canal, Hong Kong Inc Walks Tightrope",
    "description": "Hong Kong's edge as a financial hub will erode further as the city becomes embroiled in China-U.S. tensions, with the flash sale of a Hong Kong-owned global ports business highlighting geopolitical volatility, executives and analysts said.",
    "link": "https://gcaptain.com/as-trump-hails-taking-back-of-panama-canal-hong-kong-inc-walks-tightrope/",
    "timestamp": "2025-03-06T16:24:52Z"
  },
  {
    "title": "Democrat Al Green censured over Trump speech disruption",
    "description": "The Texas congressman was ejected from the House chamber earlier this week during Trump's address to the nation.",
    "link": "https://www.bbc.com/news/articles/ce8v369gdjdo",
    "timestamp": "2025-03-06T16:24:24Z"
  },
  {
    "title": "Even some Republicans express concern about the White House’s vetting process",
    "description": "As the number of Trump administration officials with bigoted online records grows, the White House’s vetting process is facing bipartisan pushback.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/even-republicans-express-concern-white-houses-vetting-process-rcna195116",
    "timestamp": "2025-03-06T16:23:50Z"
  },
  {
    "title": "House Censures Al Green for Disrupting Trump Address to Congress",
    "description": "The House on Thursday voted to censure Rep. Al Green (D-TX) for his protest during President Donald Trump's address to Congress.\nThe post House Censures Al Green for Disrupting Trump Address to Congress appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/06/house-censures-al-green-for-disrupting-trump-address-to-congress/",
    "timestamp": "2025-03-06T16:23:23Z"
  },
  {
    "title": "Marjorie Taylor Greene votes to censure Al Green — after her boyfriend urges not to",
    "description": "Rep. Marjorie Taylor Greene (R-GA) voted Thursday to censure Rep. Al Green (D-TX) for speaking out at President Donald Trump's speech to Congress even though her boyfriend, reporter Brian Glenn, urged Republicans not to support the punishment.Ten Democrats jo…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-censure-al-green/",
    "timestamp": "2025-03-06T16:22:54Z"
  },
  {
    "title": "IMF Says US Tariffs Risk ‘Significant’ Hit to Canada, Mexico",
    "description": "The IMF warned Canada and Mexico are vulnerable to “significant adverse economic impact” if President Donald Trump sustains tariffs on those countries given their exposure to US markets.",
    "link": "https://financialpost.com/pmn/business-pmn/imf-says-us-tariffs-risk-significant-hit-to-canada-mexico",
    "timestamp": "2025-03-06T16:22:44Z"
  },
  {
    "title": "Commerce Secretary Lutnick says most tariffs on Canada, Mexico likely to be delayed a month",
    "description": "U.S. Commerce Secretary Howard Lutnick said Thursday in a television interview that President Donald Trump will “likely” suspend the 25% tariffs on Canada and Mexico for most products and services for a month, broadening an exemption that was granted o...",
    "link": "https://abcnews.go.com/US/wireStory/commerce-secretary-lutnick-tariffs-canada-mexico-delayed-month-119513771",
    "timestamp": "2025-03-06T16:22:27Z"
  },
  {
    "title": "Dem protests during Trump speech 'good illustration' of why party is so unpopular, says CNN data analyst",
    "description": "CNN's Harry Enten said Wednesday that Democratic reaction to President Donald Trump's speech on Tuesday was a good illustration of why the party has such a low approval rating.",
    "link": "https://www.foxnews.com/media/dem-protests-during-trump-speech-good-illustration-why-party-so-unpopular-cnn-data-analyst",
    "timestamp": "2025-03-06T16:22:21Z"
  },
  {
    "title": "House Votes To Censure Al Green After Disruption Of Donald Trump’s Speech To Congress",
    "description": "Rep. Al Green (D-TX) was censured by the House of Representatives for disrupting President Donald Trump’s address to a joint session of Congress on Tuesday. In one of the highlights of a raucous House chamber during Trump’s speech, Green was removed when he r…",
    "link": "http://deadline.com/2025/03/al-green-censure-house-trump-speech-1236312580/",
    "timestamp": "2025-03-06T16:21:25Z"
  },
  {
    "title": "CNBC Blames Trump and DOGE for Bombshell Job Loss Data: ‘Played the Biggest Part’",
    "description": "CNBC reporter Steve Liesman blamed President Donald Trump and DOGE czar Elon Musk for contributing to bombshell job losses in February.\nThe post CNBC Blames Trump and DOGE for Bombshell Job Loss Data: ‘Played the Biggest Part’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/cnbc-blames-trump-and-doge-for-bombshell-job-loss-data-played-the-biggest-part/",
    "timestamp": "2025-03-06T16:21:08Z"
  },
  {
    "title": "The Right And Wrong Way To Negotiate, Including Tariffs And Peace",
    "description": "Through decisive action on international trade and security matters, Trump has articulated a coherent philosophy: America achieves peace and prosperity only through mi...",
    "link": "https://www.forbes.com/sites/robertdaugherty/2025/03/06/the-right-and-wrong-way-to-negotiate-including-tariffs-and-peace/",
    "timestamp": "2025-03-06T16:20:21Z"
  },
  {
    "title": "China To Fired Gov’t Workers: Come To Our ‘Metropolis Of The Future’",
    "description": "Tech firms in China are actively recruiting U.S. scientists recently laid off from federal research agencies through President Trump's cost-cutting initiatives.",
    "link": "https://dailycaller.com/2025/03/06/china-doge-government-workers-technology-future/",
    "timestamp": "2025-03-06T16:19:34Z"
  },
  {
    "title": "Zelenskyy didn't exactly say 'raising volume of your voice' but not 'your logic' in Trump meeting",
    "description": "Ukrainian President Volodymyr Zelenskyy told U.S. President Donald Trump and Vice President JD Vance during their contentious February 2025 Oval Office meeting, “You're raising the volume of your voice, but not the logic of your argument.\"",
    "link": "https://www.snopes.com//fact-check/trump-zelenskyy-meeting-quote/",
    "timestamp": "2025-03-06T16:19:00Z"
  },
  {
    "title": "Jack Daniel’s maker says Canada pulling US alcohol off shelves ‘worse than tariff’",
    "description": "Brown-Forman has been reeling from a slowdown in demand so far this year, led by the US, Canada and Europe.",
    "link": "https://nypost.com/2025/03/06/business/jack-daniels-maker-says-canada-pulling-us-alcohol-off-shelves-worse-than-tariff/",
    "timestamp": "2025-03-06T16:18:08Z"
  },
  {
    "title": "Would You Pay $100 Grand Theft Auto VI?",
    "description": "One analyst thinks Take-Two Interactive may try to sell users on a $100 version of GTA VI that also grants fake money for a new version of GTA Online.",
    "link": "https://gizmodo.com/would-you-pay-100-grand-theft-auto-vi-2000572522",
    "timestamp": "2025-03-06T16:18:04Z"
  },
  {
    "title": "Tesla sales rise in UK despite global backlash against Elon Musk",
    "description": "The Society of Motor Manufacturers and Traders (SMMT) writes that almost 4,000 Teslas were sold in the UK in February, up 20.7% year on year and increasing Tesla's market share from 3.75% in February 2024 to 4.6% last month.Read Entire Article",
    "link": "https://www.techspot.com/news/107047-tesla-sales-rise-uk-despite-global-backlash-against.html",
    "timestamp": "2025-03-06T16:18:00Z"
  },
  {
    "title": "Trump administration floats more exemptions from tariffs on Canadian and Mexican goods",
    "description": "Commerce Secretary Howard Lutnick suggested new action is coming from President Donald Trump to issue exemptions to the sweeping 25% tariffs he imposed Tuesday on most goods imported into the U.S. from Mexico and Canada.",
    "link": "https://www.nbcnews.com/politics/economics/trump-administration-floats-exemptions-tariffs-canadian-mexican-goods-rcna195110",
    "timestamp": "2025-03-06T16:17:29Z"
  },
  {
    "title": "Trump's White House Crypto Summit is in focus. Will Bitcoin be integrated into US financial strategy?",
    "description": "White House Crypto Summit: President Donald Trump will host his first White House crypto summit this Friday and there's a lot of buzz around it. The high-profile event attracted significant attention across the industry and is expected to include more than 25…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trumps-white-house-crypto-summit-is-in-focus-will-bitcoin-be-integrated-into-us-financial-strategy/articleshow/118766055.cms",
    "timestamp": "2025-03-06T16:16:27Z"
  },
  {
    "title": "Trudeau expects a trade war between Canada and the US for the 'foreseeable future'",
    "description": "Canadian Prime Minister Justin Trudeau expects a prolonged trade war with the U.S., following a constructive call with President Donald Trump. They discussed tariffs, with Trudeau reiterating that Canada will maintain its response tariffs until the U.S. lifts…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trudeau-expects-a-trade-war-between-canada-and-the-us-for-the-foreseeable-future/articleshow/118766214.cms",
    "timestamp": "2025-03-06T16:16:16Z"
  },
  {
    "title": "MAGA wants to sic DOGE on Amy Coney Barrett after Supreme Court blocks spending freeze",
    "description": "Right-wingers are going all in against Amy Coney Barrett after the conservative Supreme Court justice sided with Chief Justice John Roberts and the liberal minority to block President Donald Trump from freezing nearly $2 billion in foreign aid.\n\n\nThe court's …",
    "link": "https://www.dailydot.com/debug/amy-coney-barrett-foreign-aid-supreme-court/",
    "timestamp": "2025-03-06T16:15:40Z"
  },
  {
    "title": "ACLU Sues NEA for Enforcing Trump’s Anti-LGBTQ+ Mandate",
    "description": "The suit argues that the federal art funding agency's new grant requirement violates the First Amendment in what may be the first major legal challenge to the controversial policy changes.",
    "link": "http://hyperallergic.com/994318/aclu-sues-nea-for-enforcing-trumps-anti-lgbtq-mandate/",
    "timestamp": "2025-03-06T16:15:03Z"
  },
  {
    "title": "Trump Likely to Defer Tariffs on USMCA Goods, Lutnick Says (Josh Wingrove/Bloomberg)",
    "description": "Josh Wingrove / Bloomberg:\nTrump Likely to Defer Tariffs on USMCA Goods, Lutnick Says  —  President Donald Trump is likely to defer his 25% tariffs on Canada and Mexico for all goods and services covered by the North American trade agreement known as USMCA, C…",
    "link": "https://www.memeorandum.com/250306/p63",
    "timestamp": "2025-03-06T16:15:00Z"
  },
  {
    "title": "Trump: Trudeau using tariff issue to run again",
    "description": "United States President Donald Trump on Thursday accused Canadian outgoing Prime Minister Justin Trudeau of using the tariffs issue to get a chance to become prime minister again.\"Believe it or not, d...",
    "link": "https://biztoc.com/x/a358b86b30b85468",
    "timestamp": "2025-03-06T16:14:31Z"
  },
  {
    "title": "'Exactly what Trump wanted him to do': Dems say Al Green censure was a trap to distract",
    "description": "WASHINGTON — Republicans Thursday passed the censure of Rep. Al Green (R-TX), who had an outburst during President Donald Trump's joint session in Congress on Tuesday. Speaker Mike Johnson had Green removed from the chamber. Trump told the crowd that he has a…",
    "link": "https://www.rawstory.com/raw-investigates/al-green-censure-trap/",
    "timestamp": "2025-03-06T16:14:22Z"
  },
  {
    "title": "Report: Target’s Stock Valuation Drops Due To Boycott",
    "description": "A one-day economic blackout directed at Target among other stores had an impact on the retailer, mainly seeing drops in its online traffic and dedicated app usage. Another extended boycott against the chain kicks off on Wednesday.",
    "link": "https://hiphopwired.com/2637515/report-target-stock-valuation-drops-due-to-boycott/",
    "timestamp": "2025-03-06T16:14:17Z"
  },
  {
    "title": "US House censures Democratic lawmaker for disrupting Trump's address to Congress",
    "description": "Washington — The House of Representatives on Thursday voted to censure an unrepentant Rep. Al Green, a Democrat from Texas, for disrupting President Donald Trump's address to Congress.\n\n\nRepublican House Speaker Mike Johnson had Green removed from the chamber…",
    "link": "https://www.voanews.com/a/us-house-censures-democratic-lawmaker-for-disrupting-trump-s-address-to-congress/8001174.html",
    "timestamp": "2025-03-06T16:14:14Z"
  },
  {
    "title": "Mexican companies hold back U.S.-bound exports, hoping for tariff reversal",
    "description": "The flow of Mexican goods exported to the United States has slowed as companies anxiously hold back stock and wait to see if U.S. President Donald Trump might reverse his decision to implement 25 per cent tariffs on Mexico this week.\nOn Tuesday, the first day…",
    "link": "https://biztoc.com/x/41873bbfda154801",
    "timestamp": "2025-03-06T16:14:04Z"
  },
  {
    "title": "Trump Says Russia and Ukraine Ready to Make a Deal",
    "description": "President Donald Trump delivered the biggest speech of his presidency yet, hitting on partisan talking points favored by his conservative base, while largely sidestepping the effects of his sweeping tariff proposals on consumers.\nThe speech was largely aimed …",
    "link": "https://biztoc.com/x/7acb349303953c89",
    "timestamp": "2025-03-06T16:13:39Z"
  },
  {
    "title": "The D Brief: Deportation costs; DOGE cuts; Pressure on Ukraine; Campaign-planning AI; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/03/the-d-brief-march-06-2025/403518/",
    "timestamp": "2025-03-06T16:12:41Z"
  },
  {
    "title": "Trump Could Sign Order To Close Department Of Education: Here’s What That Means",
    "description": "Shuttering the agency is unlikely as it would require congressional approval and some Democratic votes to break the Senate filibuster.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/06/trump-could-sign-order-to-close-department-of-education-heres-what-that-means/",
    "timestamp": "2025-03-06T16:12:22Z"
  },
  {
    "title": "Second judge extends block preventing Trump administration from freezing funding",
    "description": "BOSTON, Massachusetts — A second federal judge on Thursday extended a block barring the Trump administration from freezing grants and loans potentially totaling trillions of dollars.\n\n\nU.S. District Court Judge John McConnell in Rhode Island granted the preli…",
    "link": "https://www.voanews.com/a/second-judge-extends-block-preventing-trump-administration-from-freezing-funding/8001155.html",
    "timestamp": "2025-03-06T16:12:13Z"
  },
  {
    "title": "House censures Rep. Al Green for heckling Trump during speech to Congress",
    "description": "Fewer than 30 members of the House of Representatives have been censured. Green said about interrupting Trump, \"Truthfully, I would do it again.\"",
    "link": "https://www.cnbc.com/2025/03/06/house-censures-rep-al-green-for-heckling-trump-during-speech-to-congress.html",
    "timestamp": "2025-03-06T16:10:37Z"
  },
  {
    "title": "EU leaders hold emergency summit to bolster support for Ukraine",
    "description": "Talks held amid fears of waning US support for Ukraine after Trump pauses aid and suspends intel sharing with Kyiv.",
    "link": "https://www.aljazeera.com/news/2025/3/6/eu-leaders-hold-emergency-summit-to-bolster-support-for-ukraine",
    "timestamp": "2025-03-06T16:10:19Z"
  },
  {
    "title": "Mexico seizes 275,000 fentanyl pills from cactus bound for Arizona",
    "description": "Authorities found 70 pounds of fentanyl hidden inside boxes of slices of cactus, a Mexican food stable known as nopales.",
    "link": "https://www.cbsnews.com/news/mexico-fentanyl-seizure-united-states-arizona-cactus/",
    "timestamp": "2025-03-06T16:09:51Z"
  },
  {
    "title": "After Trump’s fiery row with Zelenskyy, Russia heaps praise on US leader",
    "description": "Meanwhile, Europeans are considering how to replace the US with raised defence commitments to Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/3/6/europe-rallies-to-ukraines-defence-as-trump-cuts-off-military-aid",
    "timestamp": "2025-03-06T16:09:13Z"
  },
  {
    "title": "Cautious of Trump's Russian pivot, Israel debates sharing intel",
    "description": "Some officials in other allied countries played down the idea that Trump's policies on Russia would disrupt intelligence cooperation that dates back decades.",
    "link": "https://www.jpost.com/breaking-news/article-845031",
    "timestamp": "2025-03-06T16:09:04Z"
  },
  {
    "title": "‘Truly Surprised by This’: CNN’s Harry Enten Highlights ‘Shocking’ Approval for Trump and DOGE Spending Cuts",
    "description": "CNN's Harry Enten reported that President Donald Trump's efforts to make sweeping spending cuts in the federal government has a majority support.\nThe post ‘Truly Surprised by This’: CNN’s Harry Enten Highlights ‘Shocking’ Approval for Trump and DOGE Spending …",
    "link": "https://www.mediaite.com/tv/truly-surprised-by-this-cnns-harry-enten-highlights-shocking-approval-for-trump-and-doge-spending-cuts/",
    "timestamp": "2025-03-06T16:08:30Z"
  },
  {
    "title": "Families of Ukrainian POWs anxiously watch peace effort",
    "description": "KYIV (Reuters) - As U.S. President Donald Trump presses on with a plan to end the war in Ukraine, Kateryna Bohutska wants to make sure her 24-year-old son isn't forgotten. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/07/families-of-ukrainian-pows-anxiously-watch-peace-effort",
    "timestamp": "2025-03-06T16:07:00Z"
  },
  {
    "title": "CIA starts firing recently hired officers",
    "description": "The CIA has started to fire some recently hired officers as part of the Trump administration’s effort to quickly slash the federal workforce.",
    "link": "https://www.nbcnews.com/politics/national-security/cia-starts-firing-recently-hired-officers-rcna195115",
    "timestamp": "2025-03-06T16:06:54Z"
  },
  {
    "title": "US tariff war could roil financial, real markets",
    "description": "A downturn in global trade will lead to deficient aggregate demand but if Trump insists on a balanced budget, there will be no policy tool to increase it",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/us-tariff-war-could-roil-financial-real-markets/article69297883.ece",
    "timestamp": "2025-03-06T16:06:44Z"
  },
  {
    "title": "BREAKING: House CENSURES Dem Rep. Al Green for Disrupting President Trump’s Address to Congress with 10 Democrats Voting YES",
    "description": "The House of Representatives voted today to censure Rep. Al Green (D-TX) for his stupid stunt during President Trump’s joint address to Congress on Tuesday. The vote was 224-198. Every Republican voted yes, while 10 Democrats surprisingly also voted to censur…",
    "link": "https://freerepublic.com/focus/f-news/4302521/posts",
    "timestamp": "2025-03-06T16:06:23Z"
  },
  {
    "title": "Yusril says Indonesia anticipates US immigration policy",
    "description": "Coordinating Minister for Law, Human Rights, Immigration, and Corrections Yusril Ihza Mahendra said that the Indonesian Government will prepare measures to ...",
    "link": "https://en.antaranews.com/news/347421/yusril-says-indonesia-anticipates-us-immigration-policy",
    "timestamp": "2025-03-06T16:06:08Z"
  },
  {
    "title": "In the Face of a Measles Outbreak, Our Dingbat Health Secretary Is Recommending Cod Liver Oil",
    "description": "For the first time in decades, measles cases are on the rise in the United States — and our brainwormed health czar, Robert F. Kennedy, Jr., is hawking nutritional supplements. In an interview with Fox News, the alleged dog-eater who now helms the Department …",
    "link": "https://futurism.com/neoscope/rfk-jr-cod-liver-oil-measles",
    "timestamp": "2025-03-06T16:05:02Z"
  },
  {
    "title": "EU must win arms race – Poland",
    "description": "Polish Prime Minister Donald Tusk has called for Europe to escalate its military buildup, while claiming Russia will “lose” like the USSR Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613832-tusk-eu-russia-arms-race/",
    "timestamp": "2025-03-06T16:05:01Z"
  },
  {
    "title": "Meet the Influencers Courting the Australian Vote",
    "description": "Political influencers on platforms like YouTube and TikTok are already a force likely to shape how elections are covered, even if they don’t swing votes.",
    "link": "https://thediplomat.com/2025/03/meet-the-influencers-courting-the-australian-vote/",
    "timestamp": "2025-03-06T16:03:39Z"
  },
  {
    "title": "Commerce Secretary Lutnick says most tariffs on Canada, Mexico likely to be delayed a month",
    "description": "U.S. Commerce Secretary Howard Lutnick said Thursday in a television interview that President Donald Trump will “likely” suspend the 25% tariffs on Canada and Mexico for most products and services for a month, broadening an exemption that was granted on Wedne…",
    "link": "https://biztoc.com/x/acd15a8368371f61",
    "timestamp": "2025-03-06T16:03:17Z"
  },
  {
    "title": "Trump delays tariffs on most goods from Mexico for a month",
    "description": "This is the second one-month postponement Trump has announced.",
    "link": "https://www.denverpost.com/2025/03/06/trump-tariffs-delay/",
    "timestamp": "2025-03-06T16:02:54Z"
  },
  {
    "title": "Commerce Secretary Lutnick says most tariffs on Canada, Mexico likely to be delayed a month",
    "description": "The move would broaden an exemption granted to autos on Wednesday.",
    "link": "https://www.bostonherald.com/2025/03/06/trump-tariffs-delay/",
    "timestamp": "2025-03-06T16:02:54Z"
  },
  {
    "title": "Red States Snap Into Gear To Help Trump Enforce Immigration Laws",
    "description": "'Having employers that are knowingly coming in and bringing in illegal aliens who they know should not be in our country ... there needs to be stiff penalties.'",
    "link": "https://thefederalist.com/2025/03/06/red-states-snap-into-gear-to-help-trump-enforce-immigration-laws/",
    "timestamp": "2025-03-06T16:02:54Z"
  },
  {
    "title": "Trump Likely to Defer Tariffs on USMCA Goods, Lutnick Says",
    "description": "President Donald Trump is likely to defer his 25% tariffs on Canada and Mexico for all goods and services covered by the North American trade agreement known as USMCA, Commerce Secretary Howard Lutnick said, a potentially major reprieve for the US’s two large…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-likely-to-defer-tariffs-on-usmca-goods-lutnick-says",
    "timestamp": "2025-03-06T16:02:37Z"
  },
  {
    "title": "Europe-Nato ‘coalition of the willing’ scrambles for collective response to hostility from Trump and threat from Putin",
    "description": "US foreign policy is forcing a security rethink, particularly in Europe.",
    "link": "https://theconversation.com/europe-nato-coalition-of-the-willing-scrambles-for-collective-response-to-hostility-from-trump-and-threat-from-putin-251332",
    "timestamp": "2025-03-06T16:00:45Z"
  },
  {
    "title": "Trump Threatens To Destroy Hamas If It Refuses To Hand Over Hostages",
    "description": "United States ruler President Donald Trump has told Hamas to release all remaining hostages, dead bodies, or he would assist Israel in bringing about the destruction of the terrorist group. “Release all of the Hostages now, not later, and immediately return a…",
    "link": "https://www.shtfplan.com/headline-news/trump-threatens-to-destroy-hamas-if-it-refuses-to-hand-over-hostages",
    "timestamp": "2025-03-06T16:00:38Z"
  },
  {
    "title": "Incoming CBS Boss Jeff Shell Pressuring Underlings To Settle With Trump, Trample Journalistic Freedom, And Kiss Authoritarian Ass (Karl Bode/Techdirt)",
    "description": "Karl Bode / Techdirt:\nIncoming CBS Boss Jeff Shell Pressuring Underlings To Settle With Trump, Trample Journalistic Freedom, And Kiss Authoritarian Ass  —  Last October, Donald Trump sued CBS claiming (falsely) that a “60 Minutes” interview of Kamala Harris h…",
    "link": "https://www.memeorandum.com/250306/p61",
    "timestamp": "2025-03-06T16:00:36Z"
  },
  {
    "title": "Russia dismisses crypto for national reserves, citing volatility concerns",
    "description": "Russia’s Deputy Finance Minister Vladimir Kolychev has dismissed speculation about including cryptocurrencies in the country’s National Wealth Fund (NWF). Earlier in the week, local media outlet Interfax reported that Kolychev clarified that the Ministry of F…",
    "link": "https://cryptoslate.com/russia-dismisses-crypto-for-national-reserves-citing-volatility-concerns/",
    "timestamp": "2025-03-06T16:00:07Z"
  },
  {
    "title": "As Trump and DOGE Block Federal Grants, Wildfire Prevention Projects Are at Risk",
    "description": "Efforts to limit wildfires in a conservative swath of northern Colorado are the latest casualty of the Trump administration’s on-and-off federal spending freeze",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/03/06/nonprofits-in-limbo-as-grants-disappear-00206202",
    "timestamp": "2025-03-06T16:00:00Z"
  },
  {
    "title": "Sean Evans on 10 Years of ‘Hot Ones’ on YouTube: ‘The Best Dumb Idea Ever’",
    "description": "Sean Evans’ celebrity guests on “Hot Ones” have cursed at him. They’ve cried. They’ve expressed deep regret about agreeing to come on his show. It’s the hottest hot seat on YouTube, and Evans and his business partners are now looking to take “Hot Ones” to the…",
    "link": "https://variety.com/2025/digital/news/seans-evans-hot-ones-10-years-youtube-interview-1236324823/",
    "timestamp": "2025-03-06T16:00:00Z"
  },
  {
    "title": "War and Peace in Munich",
    "description": "On the first morning of the Munich Security Conference, February 14, I arrived at the press office to request an escort to enter the Bayerischer Hof, the opulent hotel that hosts this annual convening of politicians, generals, weapons manufacturers, and techn…",
    "link": "https://www.nybooks.com/online/2025/03/06/war-and-peace-in-munich/",
    "timestamp": "2025-03-06T16:00:00Z"
  },
  {
    "title": "Ex-Wisconsin justice who led election review should be compelled to sit for deposition in ethics case, motion says",
    "description": "A former Wisconsin Supreme Court justice should be compelled to sit for a deposition before a disciplinary review board, a lawyer for the Wisconsin Office of Lawyer Regulation argued in a Feb. 28 motion.",
    "link": "https://www.abajournal.com/news/article/ex-wisconsin-justice-should-be-compelled-to-sit-for-deposition-in-ethics-case-motion-says",
    "timestamp": "2025-03-06T16:00:00Z"
  },
  {
    "title": "It Turns Out Trump Didn’t Need Border Bill That Dems Said Was Essential to Taming Illegal Immigration Crisis",
    "description": "DAILY CALLER NEWS FOUNDATION—President Donald Trump pushed border encounters to historical lows, and did so without signing into law a bipartisan border deal relentlessly lauded... Read More\nThe post It Turns Out Trump Didn’t Need Border Bill That Dems Said W…",
    "link": "https://www.dailysignal.com/2025/03/06/it-turns-out-trump-didnt-need-border-bill-that-dems-said-was-essential-taming-illegal-immigration-crisis/",
    "timestamp": "2025-03-06T16:00:00Z"
  },
  {
    "title": "Lone wolf attacks surge in the West as terrorism intensifies globally",
    "description": "The Global Terrorism Index says 93% of all fatal terrorist attacks in the West are carried out by lone wolves.",
    "link": "https://www.foxnews.com/world/lone-wolf-attacks-surge-west-terrorism-intensifies-globally",
    "timestamp": "2025-03-06T15:59:02Z"
  },
  {
    "title": "The Supreme Court's Rejection of Trump End Run Is Great News | Opinion",
    "description": "The Supreme Court decision allowing normal legal process to proceed in the Trump administration's foreign aid case is an important reminder that we have three equal branches of government.",
    "link": "https://www.newsweek.com/supreme-courts-rejection-trump-end-run-great-news-opinion-2040688",
    "timestamp": "2025-03-06T15:57:43Z"
  },
  {
    "title": "Is the US prepared to host World Cup 2026? Here are the challenges it could face",
    "description": "The 2026 World Cup will include 48 teams and will finish with the final on July 19, 2026 at MetLife Stadium in New Jersey. The tournament will begin at Mexico City's famous Estadio Azteca, with the United States' first match scheduled for the following day in…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-the-us-prepared-to-host-world-cup-2026-here-are-the-challenges-it-could-face/articleshow/118765988.cms",
    "timestamp": "2025-03-06T15:57:28Z"
  },
  {
    "title": "“A Generational Loss of Talent” – Scientist Warns Funding Cuts in Science, Tech, and Health Undermine U.S. Leadership",
    "description": "Scientist and entrepreneur Phillip Alvelda explains how DOGE cuts threaten the innovative capacities that made America a powerhouse",
    "link": "https://www.nakedcapitalism.com/2025/03/a-generational-loss-of-talent-scientist-warns-funding-cuts-in-science-tech-and-health-undermine-u-s-leadership.html",
    "timestamp": "2025-03-06T15:55:16Z"
  },
  {
    "title": "Consumer resistance is rising in the age of Trump. History shows how boycotts can be effective",
    "description": "Boycotts are back. With people worried about everything from labor practices and human rights to tariffs and equal opportunity initiatives, collective consumer resistance has been rising globally.",
    "link": "https://phys.org/news/2025-03-consumer-resistance-age-trump-history.html",
    "timestamp": "2025-03-06T15:54:38Z"
  },
  {
    "title": "Stock market today: Wall Street falls as AI stars lose more of their glow",
    "description": "U.S. stocks are resuming their slide, led by AI superstars that are feeling painful downside of big expectations.",
    "link": "https://www.bostonherald.com/2025/03/06/stock-market-results-march-6/",
    "timestamp": "2025-03-06T15:54:09Z"
  },
  {
    "title": "U.S. stocks struggle as 'America First' bets backfire",
    "description": "European assets were predicted to suffer under United States President Donald Trump but are now surging. Find out more.",
    "link": "https://financialpost.com/financial-times/us-stocks-struggle-america-first-bets-backfire",
    "timestamp": "2025-03-06T15:54:09Z"
  }
]