[
  {
    "title": "US strikes another alleged drug boat in Caribbean",
    "description": "The US has carried out several strikes in the region as part of an anti-drug trafficking effort",
    "link": "https://www.bbc.com/news/articles/c891gzx7xn4o",
    "timestamp": "2025-10-24T13:46:05Z"
  },
  {
    "title": "US ‘Bibi-sitters’ keep a close eye on Israel",
    "description": "Washington is keeping Israel on a tight leash, doing everything it can to preserve the Gaza ceasefire",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/24/us-bibi-sitters-keep-a-close-eye-on-israel/",
    "timestamp": "2025-10-24T13:46:00Z"
  },
  {
    "title": "Trump halts trade discussions with Canadian officials",
    "description": "President Donald Trump announced the termination of trade negotiations with Canada on Thursday, citing concerns over an advertisement released by Ontario’s provincial government that featured audio from former President Ronald Reagan criticizing tariffs. The …",
    "link": "https://rollingout.com/2025/10/24/trump-halts-canada-trade-discussions/",
    "timestamp": "2025-10-24T13:45:59Z"
  },
  {
    "title": "Is the Argentina Bailout a Glimpse Into the Future of the United States? (Ben Raderstorf/The Bulwark)",
    "description": "Ben Raderstorf / The Bulwark:\nIs the Argentina Bailout a Glimpse Into the Future of the United States?  —  Trumpism could dominate American politics long after Trump himself is gone—just as Perónism continues to dominate politics in Argentina.  —  AFTER DONAL…",
    "link": "https://www.memeorandum.com/251024/p48",
    "timestamp": "2025-10-24T13:45:04Z"
  },
  {
    "title": "One way Japan might try to win over Trump: Buying American pickup trucks",
    "description": "As Japan tries to placate President Donald Trump amid contentious trade talks, officials may be eyeing an icon of American manufacturing that has virtually no presence there: the pickup truck.",
    "link": "https://biztoc.com/x/7ac188a785079ec2",
    "timestamp": "2025-10-24T13:44:22Z"
  },
  {
    "title": "Canada's Antagonism",
    "description": "Reagan, weaponized: President Donald Trump said last night that he was ending tariff negotiations with Canada over a video the province of Ontario put out criticizing Trump's tariff approach using the words of former President Ronald Reagan, a vociferous oppo…",
    "link": "https://biztoc.com/x/1f44408ce3c13dd4",
    "timestamp": "2025-10-24T13:44:05Z"
  },
  {
    "title": "Trump's beef import plan ignores key issue squeezing American cattle ranchers",
    "description": "President Trump says importing more Argentine beef will lower prices, but ranchers argue the real problem isn’t supply, it’s the corporate giants controlling America’s meat industry.",
    "link": "https://www.foxnews.com/politics/trumps-beef-import-plan-ignores-key-issue-squeezing-american-cattle-ranchers",
    "timestamp": "2025-10-24T13:43:43Z"
  },
  {
    "title": "Trump demolishes the East Wing — and White House norms",
    "description": "The East Wing's rapid razing bypassed a detailed process for major federal renovation projects in Washington. Now, Senate Democrats are demanding answers.",
    "link": "https://www.msnbc.com/msnbc/news/trump-demolishes-east-wing-white-house-norms-rcna239516",
    "timestamp": "2025-10-24T13:43:34Z"
  },
  {
    "title": "What do Americans fear most? The answers to this foreboding study might surprise you",
    "description": "It's not ghosts and ghouls that are keeping Americans up at night this Halloween.",
    "link": "https://nypost.com/2025/10/24/lifestyle/what-americans-fear-the-most-in-2025-survey/",
    "timestamp": "2025-10-24T13:41:21Z"
  },
  {
    "title": "Pete Hegseth says the U.S. carried out another strike on an alleged drug-carrying boat in the Caribbean Sea",
    "description": "Defense Secretary Pete Hegseth said Friday that the U.S. struck a boat allegedly carrying drugs in the Caribbean Sea, marking at least the third time this week that the U.S. has attacked a vessel it says was involved in drug trafficking.“The vessel was known …",
    "link": "https://www.nbcnews.com/politics/politics-news/us-strike-drug-boat-carribean-rcna239564",
    "timestamp": "2025-10-24T13:41:15Z"
  },
  {
    "title": "U.S. strikes another alleged drug-carrying boat in the Caribbean, Pete Hegseth says",
    "description": "Defense Secretary Pete Hegseth said Friday that the U.S. struck a boat allegedly carrying drugs in the Caribbean Sea, marking at least the third time this week that the U.S. has attacked a vessel it says was involved in drug trafficking.“The vessel was known …",
    "link": "https://www.nbcnews.com/politics/politics-news/us-strike-drug-boat-rcna239564",
    "timestamp": "2025-10-24T13:41:15Z"
  },
  {
    "title": "Trump Plan Would Open Almost All Coast to Offshore Drilling",
    "description": "The Trump administration is readying a proposal to open almost all US coastal waters to new offshore oil drilling despite opposition from state governors and the president’s previous efforts to close off some of the territory. The draft plan for …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/10/24/845071.htm",
    "timestamp": "2025-10-24T13:40:17Z"
  },
  {
    "title": "One way Japan might try to win over Trump: Buying American pickup trucks",
    "description": "As Japan tries to placate President Donald Trump amid contentious trade talks, officials may be eyeing an icon of American manufacturing that has virtually no presence there: the pickup truck.",
    "link": "https://www.nbcnews.com/world/asia/japan-trump-trade-buying-ford-f-150-pickup-trucks-rcna238832",
    "timestamp": "2025-10-24T13:39:32Z"
  },
  {
    "title": "Gold at $4,000: The Price of Fiscal Dominance",
    "description": "On Monday, October 13, gold broke above $4,000 an ounce for the first time in history. The milestone capped a year-long rally that has left even seasoned investors questioning whether this is simply another speculative surge or a signal of something deeper: t…",
    "link": "https://www.fairobserver.com/economics/gold-at-4000-the-price-of-fiscal-dominance/",
    "timestamp": "2025-10-24T13:37:54Z"
  },
  {
    "title": "U.S. Strike In Caribbean Targets Alleged Drug-Running Boat, Killing 6, Hegseth Says",
    "description": "The pace of the strikes has quickened in recent days from one every few weeks in September when they first began to three in one week now.",
    "link": "https://www.huffpost.com/entry/another-us-strike-in-carribean_n_68fb7fc5e4b0bc7dc61fac19",
    "timestamp": "2025-10-24T13:36:39Z"
  },
  {
    "title": "US stocks open higher as softening inflation fuels Fed rate cut bets",
    "description": "Wall Street opened on solid ground on Friday, as investors welcomed a cooler-than-expected inflation reading, while Intel's upbeat results offered a boost.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-softening-inflation-fuels-fed-rate-cut-bets/articleshow/124787081.cms",
    "timestamp": "2025-10-24T13:36:33Z"
  },
  {
    "title": "Developing: NY AG Letitia James set for arraignment in federal bank fraud case",
    "description": "New York Attorney General Letitia James, a longtime political foe of President Donald Trump who previously sued him for making ...",
    "link": "https://biztoc.com/x/21db1febd26f66d3",
    "timestamp": "2025-10-24T13:36:31Z"
  },
  {
    "title": "US kills 6 suspected narco-terrorists in overnight strike on alleged drug smuggling boat, Hegseth says",
    "description": "President Donald Trump directed a nighttime U.S. strike on a Tren de Aragua vessel in the Caribbean Sea, killing six narco-terrorists, officials say.",
    "link": "https://www.foxnews.com/world/us-kills-6-suspected-narco-terrorists-overnight-strike-alleged-drug-smuggling-boat-hegseth-says",
    "timestamp": "2025-10-24T13:36:19Z"
  },
  {
    "title": "ICE Spent Over $71 Million on Guns, Armor, and Chemical Munitions in 2025 So Far",
    "description": "The total is over 600 percent more than what the agency spent from January to October 2024.",
    "link": "https://reason.com/2025/10/24/ice-spent-over-71-million-on-guns-armor-and-chemical-munitions-in-2025-so-far/",
    "timestamp": "2025-10-24T13:36:15Z"
  },
  {
    "title": "“This Is A New Era,” Syria Central Bank Says Amid Investment Push",
    "description": "Syria’s new economic team is seeking global reintegration after years of war and isolation—pursuing stabilization, investment, and a vision for national revival.",
    "link": "https://www.forbes.com/sites/afshinmolavi/2025/10/24/this-is-a-new-era-syria-central-bank-says-amid-investment-push/",
    "timestamp": "2025-10-24T13:36:00Z"
  },
  {
    "title": "U.S. equity funds see strong inflows as earnings optimism boost risk appetite",
    "description": "equity funds saw robust inflows in the week through October 22 bolstered by optimism over a broadly upbeat quarterly earnings season so far.-China trade...",
    "link": "https://finance.yahoo.com/news/u-equity-funds-see-strong-133530808.html",
    "timestamp": "2025-10-24T13:35:30Z"
  },
  {
    "title": "Trump Crypto Partner Suspends CEO With No Explanation After Stock Falls 74%",
    "description": "Alt5 Sigma suspended Peter Tassiopoulos just two months after the company announced a $1.5 billion deal involving the Trump-backed World Liberty Financial.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/10/24/trump-crypto-partner-suspends-ceo-with-no-explanation-after-stock-falls-74/",
    "timestamp": "2025-10-24T13:35:23Z"
  },
  {
    "title": "Hayley Williams, Jack Antonoff, María Zardoya, Role Model Rock Rolling Stone’s Musicians on Musicians Event",
    "description": "Rolling Stone's Musicians on Musicians Event at the Beacon Theater featured Hayley Williams, Jack Antonoff, Role Model, and Maria Zardoya",
    "link": "http://www.rollingstone.com/music/music-live-reviews/hayley-williams-jack-antonoff-maria-role-model-live-1235453416/",
    "timestamp": "2025-10-24T13:34:34Z"
  },
  {
    "title": "What – or who – is behind the troubling and sinister rise in fake LGBTQ+ news on Facebook?",
    "description": "Dallas Cowboys wide receiver CeeDee Lamb refused to wear a rainbow armband during a game, Olympian Mollie O’Callaghan pledged to no longer compete if trans swimmer Lia Thomas is allowed to, and singer Sam Smith took issue with conjoined twins Abby and Brittan…",
    "link": "https://www.thepinknews.com/2025/10/24/what-or-who-is-behind-the-troubling-and-sinister-rise-in-fake-lgbtq-news-on-facebook/",
    "timestamp": "2025-10-24T13:32:07Z"
  },
  {
    "title": "Congresswoman Maxine Waters Lambastes President Trump’s Pardon Of Binance’s CZ",
    "description": "US President Donald Trump’s recent pardon of Binance founder Changpeng “CZ” Zhao has grabbed headlines.",
    "link": "https://zycrypto.com/congresswoman-maxine-waters-lambastes-president-trumps-pardon-of-binances-cz/",
    "timestamp": "2025-10-24T13:32:02Z"
  },
  {
    "title": "Prayers For Former ‘Today Show’ Host Bryant Gumbel, 77, After Health Scare. How He Overcame Lung Cancer After Smoking ‘Three Packs A Day’",
    "description": "Bryant Gumbel, 77, is recovering after a recent medical emergency, 16 years after surviving lung cancer—a diagnosis he initially kept private before sharin",
    "link": "https://www.newsbreak.com/share/4307321503338-prayers-for-former-today-show-host-bryant-gumbel-77-after-health-scare-how-he-overcame-lung-cancer-after-smoking-three-packs-a-day?s=a2&amp;share_destination_id=MzA0MjE4OTYwLTE3NjEzMTI2MzE5OTE%3D&amp;pd=0KaTFQ5z&amp;hl=en_US&amp;send_time=1761312632&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-24T13:31:51Z"
  },
  {
    "title": "Why Did Indiana University Axe Its Award-Winning Print Newspaper?",
    "description": "Ella Curlin\n\n\n\nIf the administration can censor the Indiana Daily Student—one of the most acclaimed student publications in the nation—then student journalism everywhere is at risk.\r\n\n\r\n\n\nThe post Why Did Indiana University Axe Its Award-Winning Print Newspap…",
    "link": "https://www.thenation.com/article/society/indiana-university-student-newspaper-censorship/",
    "timestamp": "2025-10-24T13:31:34Z"
  },
  {
    "title": "Another US strike in Caribbean targets alleged drug-running boat",
    "description": "The U.S. military is sending an aircraft carrier to the waters off South America, in the latest escalation and buildup of military forces in the region.",
    "link": "https://www.wgal.com/article/us-military-strike-drug-vessel-caribbean/69146471",
    "timestamp": "2025-10-24T13:30:42Z"
  },
  {
    "title": "5 stories you must read today, October 24: From Trump ending trade negotiations with Canada to ad legend Piyush Pandey passing away and more",
    "description": "Read about why US President Donald Trump ended all trade talks with neighbouring Canada, the death of ad legend Piyush Pandey, Assam to table Nellie massacre report and more, here.",
    "link": "https://indianexpress.com/article/india/5-stories-you-must-read-today-october-24-from-trump-ending-trade-negotiations-with-canada-to-ad-legend-piyush-pandey-passing-away-and-more-10324771/",
    "timestamp": "2025-10-24T13:30:17Z"
  },
  {
    "title": "Trump says he's ending trade talks with Canada over TV ads",
    "description": "Trump said on social media he's ending \"all trade negotiations\" with Canada because of recent television ads protesting U.S. tariffs, which he calls \"egregious behavior\" aimed at influencing court decisions.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_e294ce50-04fa-5621-84fb-b7480c692d58.html",
    "timestamp": "2025-10-24T13:30:00Z"
  },
  {
    "title": "“Of course you do, you’re twelve” is the internet’s new favorite way to explain American behavior",
    "description": "A new theory on why Americans are like that grew into a meme that the left is now using to mock right-wing accounts like Homeland Security. The idea is simple—everyone in the U.S., especially those who espouse conservative values, is basically 12 years old.\n\n…",
    "link": "https://www.dailydot.com/culture/of-course-you-do-youre-twelve/",
    "timestamp": "2025-10-24T13:30:00Z"
  },
  {
    "title": "Why stocks are recovering from previous session losses",
    "description": "Major stock indexes posted gains Thursday as investors processed corporate earnings results and developments in China trade discussions. The technology heavy Nasdaq Composite rose 0.9%, while the benchmark S&P 500 increased 0.6% and the blue chip Dow Jones In…",
    "link": "https://rollingout.com/2025/10/24/stocks-recover-from-previous-losses/",
    "timestamp": "2025-10-24T13:29:25Z"
  },
  {
    "title": "Urals freight rates to India accelerate in October amid high exports, tighter sanctions, sources say",
    "description": "In October, the shipping costs for Urals crude from Russia to India escalated sharply, propelled by fresh sanctions from the US and EU that have significantly affected Russian oil producers and transportation. While export volumes remained robust, driving fre…",
    "link": "https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/urals-freight-rates-to-india-accelerate-in-october-amid-high-exports-tighter-sanctions-sources-say/articleshow/124786986.cms",
    "timestamp": "2025-10-24T13:28:52Z"
  },
  {
    "title": "Malaysia: Can ASEAN summit deliver regional peace?",
    "description": "Malaysia hosts the ASEAN Summit this weekend, with regional leaders set to discuss peace efforts in Myanmar and a potential accord between Thailand and Cambodia. Thailand-Cambodia border tensions and Myanmar's civil war will be key topics of discussion at the…",
    "link": "https://www.dw.com/en/malaysia-can-asean-summit-deliver-regional-peace/a-74485977",
    "timestamp": "2025-10-24T13:28:00Z"
  },
  {
    "title": "Why is Iran clinging to its nuclear weapons program?",
    "description": "The strength of the Islamic Republic's regional proxies is a fraction of what it used to be, and international nuclear sanctions have been reapplied. Still, the regime in Tehran says it won't negotiate.",
    "link": "https://www.dw.com/en/why-is-iran-clinging-to-its-nuclear-weapons-program/a-74488131",
    "timestamp": "2025-10-24T13:27:00Z"
  },
  {
    "title": "Colbert Skewers Trump for Blocking ‘Ridiculous’ Ballroom Demolitions by Linking Everything Back to Epstein | Video",
    "description": "\"If none of it's on camera, they can just claim the East Wing hanged itself in prison,\" the \"Late Show\" host mocks\nThe post Colbert Skewers Trump for Blocking ‘Ridiculous’ Ballroom Demolitions by Linking Everything Back to Epstein | Video appeared first on Th…",
    "link": "https://www.thewrap.com/stephen-colbert-skewers-trump-ridiculous-ballroom-demolitions-epstein/",
    "timestamp": "2025-10-24T13:26:48Z"
  },
  {
    "title": "Turkey urges US to act after accusing Israel of breaching Gaza ceasefire",
    "description": "The country's president Recep Tayyip Erdogan said Washington should consider sanctions and halting arms sales to put pressure on Israel to abide by the truce's terms.",
    "link": "https://news.sky.com/story/turkey-urges-us-to-act-after-accusing-israel-of-breaching-gaza-ceasefire-13456611",
    "timestamp": "2025-10-24T13:26:00Z"
  },
  {
    "title": "BNB Jumps, Sees 35% Volume Spike After Trump Pardons Binance Founder CZ",
    "description": "Trading volume for BNB increased nearly 35% above its seven-day average, with market analysts suggesting the price movement reflects long-term accumulation.",
    "link": "https://www.coindesk.com/markets/2025/10/24/bnb-jumps-sees-35-volume-spike-after-trump-pardons-binance-founder-cz",
    "timestamp": "2025-10-24T13:25:43Z"
  },
  {
    "title": "Watch the ad featuring Ronald Reagan that angered Trump and threw US-Canada trade talks into disarray",
    "description": "President Donald Trump ended trade talks with Canada after Ontario aired an ad including comments made by former President Ronald Reagan about tariffs.",
    "link": "https://www.businessinsider.com/watch-reagan-ad-led-trump-to-end-canada-trade-talks-2025-10",
    "timestamp": "2025-10-24T13:23:30Z"
  },
  {
    "title": "'We need the place to be open!' GOP lawmakers fume as Mike Johnson keeps House on break",
    "description": "Congressional Republicans are fuming over House Speaker Mike Johnson’s insistence that the House remain in recess over the government shutdown fight, complaining that the extended recess is jeopardizing the Senate’s ability to do other “substantive things.”“T…",
    "link": "https://www.rawstory.com/mike-johnson-2674229814/",
    "timestamp": "2025-10-24T13:23:26Z"
  },
  {
    "title": "Trump Rages That Canada Tried to ‘Illegally Influence’ US Supreme Court With Reagan Ads After Halting Trade Talks: ‘CHEATED AND GOT CAUGHT!’",
    "description": "President Donald Trump accused Canada of trying to \"illegally influence\" the U.S. Supreme Court on tariffs after he halted trade talks with the company.\nThe post Trump Rages That Canada Tried to ‘Illegally Influence’ US Supreme Court With Reagan Ads After Hal…",
    "link": "https://www.mediaite.com/media/news/trump-rages-that-canada-tried-to-illegally-influence-us-supreme-court-with-reagan-ads-after-halting-trade-talks-cheated-and-got-caught/",
    "timestamp": "2025-10-24T13:22:56Z"
  },
  {
    "title": "Trump axes trade talks with Canada over Reagan ad",
    "description": "President Donald Trump said all trade talks with Canada were terminated following what he called a fraudulent advertisement in which former President Ronald Reagan spoke negatively about tariffs.",
    "link": "https://biztoc.com/x/d42f0237a56aaa2f",
    "timestamp": "2025-10-24T13:21:57Z"
  },
  {
    "title": "Pritzker Beclowns Himself With Preposterous Lie",
    "description": "It is hard to believe that even true-believer Democrats could isolate themselves from reality enough to believe the outrageous lies JB Pritzker vomits in a continuous stream. His arrogance is astonishing as he claims that the stratospheric murder rate in … Co…",
    "link": "https://moonbattery.com/pritzker-beclowns-himself-with-preposterous-lie/",
    "timestamp": "2025-10-24T13:21:53Z"
  },
  {
    "title": "Trump announces he’s ending U.S. trade talks with Canada. Here’s why",
    "description": "President Donald Trump announced he’s ending “all trade negotiations” with Canada because of a television ad opposing U.S. tariffs that he said misstated the facts and called “egregious behavior” aimed at influencing U.S. court decisions.The post on Trump’s s…",
    "link": "https://biztoc.com/x/e7a1d3488e7ede3c",
    "timestamp": "2025-10-24T13:21:44Z"
  },
  {
    "title": "Letitia James Expected To Plead Not Guilty Today—Here’s What To Know",
    "description": "The New York attorney general has already said she intends to argue prosecutor Lindsey Halligan was improperly appointed and can’t oversee her case.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/10/24/letitia-james-expected-to-plead-not-guilty-today-heres-what-to-know/",
    "timestamp": "2025-10-24T13:21:25Z"
  },
  {
    "title": "Shots fired at vehicle after it backs into US Coast Guard base in the San Francisco Bay Area",
    "description": "Law enforcement officers fired shots at a vehicle that backed into a U.S. Coast Guard base in the San Francisco Bay Area that had earlier been the site of...",
    "link": "https://www.yahoo.com/news/articles/shots-fired-vehicle-backs-us-131818462.html",
    "timestamp": "2025-10-24T13:18:18Z"
  },
  {
    "title": "Trump Raged at the Secret Service Over His Disastrous Dinner Stunt",
    "description": "President Donald Trump threw a hissy fit at the Secret Service after he was ambushed by protesters who called him “Hitler” during a Washington, D.C., dinner ...",
    "link": "https://www.thedailybeast.com/trump-raged-at-the-secret-service-over-his-disastrous-dinner-stunt/",
    "timestamp": "2025-10-24T13:17:35Z"
  },
  {
    "title": "Another US strike in Caribbean targets alleged drug-running boat, killing 6, Hegseth says",
    "description": "Defense Secretary Pete Hegseth announced Friday that the U.S. military conducted its 10th strike on a vessel suspected of carrying drugs overnight.",
    "link": "https://www.denverpost.com/2025/10/24/hegseth-us-strike-caribbean-target/",
    "timestamp": "2025-10-24T13:15:53Z"
  },
  {
    "title": "Social Security recipients get a 2.8% cost-of-living boost in 2026, average of $56 per month",
    "description": "Some seniors say the Social Security Administration's cost-of-living adjustment won’t help much in their ability to pay for their daily expenses.",
    "link": "https://www.ksat.com/business/2025/10/24/social-security-recipients-get-a-28-cost-of-living-boost-in-2026-average-of-56-per-month/",
    "timestamp": "2025-10-24T13:15:08Z"
  },
  {
    "title": "Trump’s Pardon of His Crypto Pal Is a New Height of Corruption",
    "description": "I often think of Donald Trump not as a president or even as a human being but rather as a social science experiment in how much out-in-the-open corruption the American public will tolerate before it calls foul.Does Trump collecting $2 billion from the United …",
    "link": "https://newrepublic.com/article/202209/trump-pardon-changpeng-zhao-crypto",
    "timestamp": "2025-10-24T13:13:06Z"
  },
  {
    "title": "Can Israel annex the West Bank if the US says no?",
    "description": "One day after the Israeli parliament votes to annex the West Bank, Donald Trump declares he will forbid it.",
    "link": "https://www.aljazeera.com/news/2025/10/24/can-israel-annex-the-west-bank-if-the-us-says-no",
    "timestamp": "2025-10-24T13:12:31Z"
  },
  {
    "title": "Rubio Seeks Quick Deployment Of International Gaza Force",
    "description": "US Secretary of State Marco Rubio voiced hope Friday of soon putting together an international force to police the ceasefire in Gaza and said Israel, which opposes including Turkey, could veto participants.",
    "link": "https://www.ibtimes.com/rubio-seeks-quick-deployment-international-gaza-force-3788364",
    "timestamp": "2025-10-24T13:12:21Z"
  },
  {
    "title": "Another US strike in Caribbean targets alleged drug-running boat, killing 6, Hegseth says",
    "description": "The U.S. military has conducted its 10th strike on a suspected drug-running boat, Defense Secretary Pete Hegseth said on Friday, blaming the Tren de Aragua...",
    "link": "https://www.yahoo.com/news/articles/another-us-strike-caribbean-targets-131154620.html",
    "timestamp": "2025-10-24T13:11:54Z"
  },
  {
    "title": "‘People’s Heads May Explode!’ Jen Psaki And Lis Smith Drop ‘Hard Truths’ on Key Trump Appeal",
    "description": "Jen Psaki and Democratic strategist Lis Smith dropped some \"hard truths\" about the way Democrats should deal with a key Trump political strength.\nThe post ‘People’s Heads May Explode!’ Jen Psaki And Lis Smith Drop ‘Hard Truths’ on Key Trump Appeal first appea…",
    "link": "https://www.mediaite.com/media/podcasts/peoples-heads-may-explode-jen-psaki-and-lis-smith-drop-hard-truths-on-key-trump-appeal/",
    "timestamp": "2025-10-24T13:11:37Z"
  },
  {
    "title": "Trump Says US Will Target Drugs Coming Into US Over Land",
    "description": "President Donald Trump said “the land is going to be next” in his campaign to halt the flow of drugs into the US from Venezuela, the clearest sign yet that he’s preparing to broaden strikes that have so far been limited to targets at sea.\n----------\nLike this…",
    "link": "https://biztoc.com/x/142bc164dd3f13e7",
    "timestamp": "2025-10-24T13:10:34Z"
  },
  {
    "title": "Climate change impacting Tropical Storm Melissa",
    "description": "Real-time data shows the water temperatures underneath Tropical Storm Melissa are 600 times more likely due to climate change. The analysis is operated by Climate Central, a nonprofit organization that focuses on the science and communication behind climate c…",
    "link": "https://freerepublic.com/focus/f-chat/4348318/posts",
    "timestamp": "2025-10-24T13:09:33Z"
  },
  {
    "title": "Canada's Antagonism",
    "description": "Plus: Betting scandal in the NBA, inside the most worrisome porn subculture, and more...",
    "link": "https://reason.com/2025/10/24/canadas-antagonism/",
    "timestamp": "2025-10-24T13:09:30Z"
  },
  {
    "title": "China vows massive high-tech sector development in next decade",
    "description": "China is gearing up for a revolutionary leap in its high-tech industries over the next ten years, unveiling a comprehensive plan that highlights pivotal fields like quantum technology and fusion energy. Officials envision this ambitious agenda as a pathway fo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-vows-massive-high-tech-sector-development-in-next-decade/articleshow/124786624.cms",
    "timestamp": "2025-10-24T13:06:06Z"
  },
  {
    "title": "Bad Bunny earns massive 21st century artist award",
    "description": "Bad Bunny accepts career-defining recognition Bad Bunny added another accolade to his growing list of accomplishments Thursday night when he accepted the best artist of the 21st century award at the Latin Billboard Awards. The Puerto Rican superstar took the …",
    "link": "https://rollingout.com/2025/10/24/bad-bunny-earns-21st-century-award/",
    "timestamp": "2025-10-24T13:06:03Z"
  },
  {
    "title": "Trump Ends All Trade Talks With Canada Over Ad He Doesn’t Like",
    "description": "Donald Trump is mad at Canada again, this time over a TV ad criticizing his tariffs. In a Truth Social post late Thursday night, Trump declared that “ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED” thanks to an ad, paid for by the government of Onta…",
    "link": "https://newrepublic.com/post/202218/trump-trade-talks-canada-ad-tariffs",
    "timestamp": "2025-10-24T13:05:49Z"
  },
  {
    "title": "Wall Street set to open higher after US inflation data",
    "description": "PARIS :European stock markets struggled for direction on Friday, but were still on track for another weekly gain, while Wall Street futures got a boost after data showed U.S. inflation rose less than expected last month.Wall Street had closed higher on Thursd…",
    "link": "https://www.channelnewsasia.com/business/wall-street-set-open-higher-after-us-inflation-data-5422106",
    "timestamp": "2025-10-24T13:05:10Z"
  },
  {
    "title": "Stocks climb, US benchmark Treasury yields briefly fall after US inflation data",
    "description": "NEW YORK/PARIS :Major stock indexes rose, with U.S. stocks hitting record highs, and benchmark U.S. Treasury yields briefly fell on Friday as data showed U.S. inflation rose less than expected last month, reinforcing expectations that the Federal Reserve will…",
    "link": "https://www.channelnewsasia.com/business/stocks-climb-us-benchmark-treasury-yields-briefly-fall-after-us-inflation-data-5422106",
    "timestamp": "2025-10-24T13:05:10Z"
  },
  {
    "title": "Stocks jump after US inflation data; US dollar nearly flat",
    "description": "NEW YORK :Major stock indexes rose, with U.S. stocks hitting record highs, on Friday on news that U.S. inflation rose less than expected last month, while the U.S. dollar index was nearly flat.The U.S. Consumer Price Index rose 0.3 per cent last month, slight…",
    "link": "https://www.channelnewsasia.com/business/stocks-jump-after-us-inflation-data-us-dollar-nearly-flat-5422106",
    "timestamp": "2025-10-24T13:05:10Z"
  },
  {
    "title": "Dems lagging in make or break outreach campaign that could decide New Jersey election, DNC leader warns",
    "description": "DNC co-chair Shasti Conrad warns Democrats risk losing New Jersey's gubernatorial election due to insufficient outreach to Asian American voters.",
    "link": "https://www.foxnews.com/politics/dems-lagging-make-break-outreach-campaign-could-decide-new-jersey-election-dnc-leader-warns",
    "timestamp": "2025-10-24T13:02:42Z"
  },
  {
    "title": "Dems lagging behind GOP on Asian American outreach could make or break blue state election, DNC leader warns",
    "description": "DNC co-chair Shasti Conrad warns Democrats risk losing New Jersey's gubernatorial election due to insufficient outreach to Asian American voters.",
    "link": "https://www.foxnews.com/politics/dems-lagging-behind-gop-asian-american-outreach-could-make-break-blue-state-election-dnc-leader-warns",
    "timestamp": "2025-10-24T13:02:42Z"
  },
  {
    "title": "Trump Ends Trade Talks With Canada Over Ontario’s ‘Fake’ Anti-Tariff Ad",
    "description": "\"Using every tool we have, we’ll never stop making the case against American tariffs on Canada. The way to prosperity is by working together.\"\nThe post Trump Ends Trade Talks With Canada Over Ontario’s ‘Fake’ Anti-Tariff Ad first appeared on Le·gal In·sur·rec…",
    "link": "https://legalinsurrection.com/2025/10/trump-ends-trade-talks-with-canada-over-ontarios-fake-anti-tariff-ad/",
    "timestamp": "2025-10-24T13:00:53Z"
  },
  {
    "title": "Trump and Leavitt watch with glee as the press is crumbling",
    "description": "The administration is staging the news and telling reporters how to present it. When will it stop?",
    "link": "https://www.salon.com/2025/10/24/trump-and-leavitt-watch-with-glee-as-the-press-is-crumbling/",
    "timestamp": "2025-10-24T13:00:31Z"
  },
  {
    "title": "Trump’s Redistricting Race Is Already Going Off the Rails",
    "description": "Trump’s redistricting race is already going off the rails. Virginia is just the latest state to rush into an unscheduled remapping of congressional seats as Democrats try to counter Republican power grabs.",
    "link": "http://nymag.com/intelligencer/article/trumps-redistricting-race-is-already-going-off-the-rails.html",
    "timestamp": "2025-10-24T13:00:17Z"
  },
  {
    "title": "Glenn Kessler: Trump and the Destruction of Bonwit Teller’s Artistic Treasures",
    "description": "Glenn Kessler, recently retired as the Washington Post’s fact checker, has his own blog at Substack. He now dedicates his time to fact-checking Trump’s lies. That’s a full-time job. He writes about a forgotten episode in Trump’s past that foreshadows his demo…",
    "link": "https://dianeravitch.net/2025/10/24/glenn-kessler-trump-and-the-destruction-of-bonwit-tellers-artistic-treasures/",
    "timestamp": "2025-10-24T13:00:00Z"
  },
  {
    "title": "CNN Looks West With Elex Michaelson’s New L.A. Based Nighttime Show",
    "description": "When CNN launches The Story Is with Elex Michaelson at 9 p.m. PT/midnight ET on Monday, it will be going up against main cable rivals’ reruns and, perhaps more importantly, will be one of the few news network shows based in Los Angeles. Michaelson, who depart…",
    "link": "http://deadline.com/2025/10/elex-michaelson-cnn-los-angeles-show-1236595985/",
    "timestamp": "2025-10-24T13:00:00Z"
  },
  {
    "title": "Kathryn Bigelow’s Gripping Netflix Thriller Hits Because It’s So Realistic",
    "description": "If a nuclear missile hurtled toward the US, it would look a lot like 'A House of Dynamite'—as screenwriter Noah Oppenheim and consultant Lieutenant General Daniel L. Karbler explain.",
    "link": "https://www.vanityfair.com/hollywood/story/kathryn-bigelows-a-house-of-dynamite-is-it-real",
    "timestamp": "2025-10-24T13:00:00Z"
  },
  {
    "title": "Did Trump propose 'Congressional Reform Act of 2025' to limit lawmakers' privileges? Here's the truth",
    "description": "In fall 2025, U.S. President Donald Trump asked supporters to forward a proposal called the \"Congressional Reform Act of 2025\" that would restrict legislative lawmakers' privileges and actions.",
    "link": "https://www.snopes.com//fact-check/trump-congressional-reform-act/",
    "timestamp": "2025-10-24T13:00:00Z"
  },
  {
    "title": "At the Hollow in Florida, the ‘medical freedom’ movement finds its base camp | CNN",
    "description": "Florida’s surgeon general, spiritual healers, and Trump allies push their cures in a swampy outpost of anti-government absolutism and mystical belief.",
    "link": "https://www.cnn.com/2025/10/24/health/florida-maha-medical-freedom-movement",
    "timestamp": "2025-10-24T12:59:19Z"
  },
  {
    "title": "US inflation stays elevated but prices rose less than feared last month",
    "description": "Inflation figures in America remain elevated as we move past last month, with import costs soaring while rent prices show signs of easing. Year-over-year, consumer prices have jumped 3%. Following a government shutdown, analysts are closely watching for a pot…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-inflation-stays-elevated-but-prices-rose-less-than-feared-last-month/articleshow/124786428.cms",
    "timestamp": "2025-10-24T12:58:25Z"
  },
  {
    "title": "Bitcoin and Ethereum Rise as Delayed Report Shows Inflation Cooled in September",
    "description": "Bitcoin rises 2% as U.S. inflation cools to 3% in September, slightly below economists' 3.1% forecast, boosting crypto markets ahead of Fed meeting.",
    "link": "https://decrypt.co/345837/bitcoin-ethereum-rise-september-inflation",
    "timestamp": "2025-10-24T12:58:11Z"
  },
  {
    "title": "Government Shutdown: Federal Employees Miss First Full Paycheck",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/24/government-shutdown-federal-employees-miss-first-full-paycheck/",
    "timestamp": "2025-10-24T12:57:54Z"
  },
  {
    "title": "Don't Let Drug Warriors Like Trump Act as Judge, Jury, and Executioner",
    "description": "The Trump administration has been blowing up fishing boats in the Caribbean—and now one in the Pacific—claiming without evidence that they’re “drug boats.”These are extrajudicial executions outside any system of law. And there’s a reason we shouldn’t allow dr…",
    "link": "https://otherwords.org/blowing-up-fishing-boats-wont-win-the-drug-war/",
    "timestamp": "2025-10-24T12:57:03Z"
  },
  {
    "title": "More Flights Delayed Due to Air Traffic Control Staffing Issues",
    "description": "Air traffic control staffing issues are delaying travel at airports in New York, Washington, Newark and Houston, the Federal Aviation Administration said late on Thursday, as a U.S. government shutdown hit its 23rd day. The FAA was reporting staffing issues …",
    "link": "https://www.insurancejournal.com/news/east/2025/10/24/845045.htm",
    "timestamp": "2025-10-24T12:55:55Z"
  },
  {
    "title": "‘Cheated and got caught’: Trump accuses Canada of attempting to influence US Supreme Court",
    "description": "The US Supreme Court is set to hear arguments on 5 November in a case that will determine the legality of Trump’s sweeping global tariffs, a recurring campaign theme in his current political comeback.",
    "link": "https://indianexpress.com/article/world/cheated-and-got-caught-trump-accuses-canada-of-attempting-to-influence-us-supreme-court-10324678/",
    "timestamp": "2025-10-24T12:55:29Z"
  },
  {
    "title": "Jack Smith ready to respond to GOP questions, but he wants the public to see his answers",
    "description": "Last week, congressional Republicans tried to go on the offensive against Jack Smith. This week, the former special counsel called their bluff.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jack-smith-ready-respond-gop-questions-wants-public-see-answers-rcna239538",
    "timestamp": "2025-10-24T12:55:02Z"
  },
  {
    "title": "Some furloughed workers will return to manage health insurance open enrollment as shutdown drags on",
    "description": "The Center for Medicare and Medicaid Services says it will temporarily bring all its furloughed employees back to work starting Monday to manage health insurance open enrollment.",
    "link": "https://www.weau.com/2025/10/24/some-furloughed-workers-will-return-manage-health-insurance-open-enrollment-shutdown-drags/",
    "timestamp": "2025-10-24T12:54:42Z"
  },
  {
    "title": "Social Security recipients get a 2.8% cost-of-living boost in 2026, average of $56 per month",
    "description": "The Social Security cost-of-living increase will go up by 2.8% in 2026, which translates to an average increase of more than $56 for retirees every month...",
    "link": "https://www.yahoo.com/news/articles/social-security-recipients-2-8-125354646.html",
    "timestamp": "2025-10-24T12:53:54Z"
  },
  {
    "title": "Pro Trans Leftist Launches Bid For Pelosi’s Seat Before She Has A Chance To Announce Retirement",
    "description": "As speculation mounts that House Speaker Nancy Pelosi will soon announce her retirement, one California lawmaker is wasting no time entering the succession race. California State Senator Scott Wiener announced his candidacy Wednesday, hours after Politico rep…",
    "link": "https://freerepublic.com/focus/f-news/4348313/posts",
    "timestamp": "2025-10-24T12:53:37Z"
  },
  {
    "title": "Some furloughed workers will return to manage health insurance open enrollment as shutdown drags on",
    "description": "The Center for Medicare and Medicaid Services says it will temporarily bring all its furloughed employees back to work starting Monday to manage health insurance open enrollment.",
    "link": "https://www.14news.com/2025/10/24/some-furloughed-workers-will-return-manage-health-insurance-open-enrollment-shutdown-drags/",
    "timestamp": "2025-10-24T12:51:18Z"
  },
  {
    "title": "Republicans Up in Arms After Texas Dem Makes Throat-Slash Gesture While Vowing to ‘Wipe’ Them Out",
    "description": "Jolanda Jones kicked up a hornet's nest after she appeared on CNN and made a throat-slashing gesture while declaring Republicans need to be \"wiped out.\"\nThe post Republicans Up in Arms After Texas Dem Makes Throat-Slash Gesture While Vowing to ‘Wipe’ Them Out…",
    "link": "https://www.mediaite.com/media/tv/republicans-up-in-arms-after-texas-dem-makes-throat-slash-gesture-while-vowing-to-wipe-them-out/",
    "timestamp": "2025-10-24T12:50:57Z"
  },
  {
    "title": "Inflation climbs to highest level since January",
    "description": "A recent uptick in prices has coincided with a sharp slowdown of hiring.",
    "link": "https://abcnews.go.com/Business/inflation-expected-reach-highest-level-year/story?id=126752284",
    "timestamp": "2025-10-24T12:50:19Z"
  },
  {
    "title": "Why J. D. Vance Just Called an Israeli Parliament Vote ‘Stupid’ and an ‘Insult’",
    "description": "And why it matters for the future of U.S.-Israel relations",
    "link": "https://www.theatlantic.com/international/archive/2025/10/why-j-d-vance-just-called-an-israeli-parliament-vote-stupid-and-an-insult/684676/",
    "timestamp": "2025-10-24T12:49:41Z"
  },
  {
    "title": "Ex-GOP Senator Enters Highly Competitive Race In Hopes To Flip New Hampshire Red",
    "description": "The New Hampshire Senate race was shaken up on Wednesday when former Senator John Sununu jumped into the Republican primary. Sununu was a senator for the Granite State from 2003 until 2009 and served in the House of Representatives prior to that. He is the br…",
    "link": "https://freerepublic.com/focus/f-news/4348311/posts",
    "timestamp": "2025-10-24T12:48:48Z"
  },
  {
    "title": "Congress Is Split Over Trump’s Expanding Venezuela Operations",
    "description": "President Donald Trump’s expanded military operations near Venezuela — including nine strikes on boats allegedly smuggling drugs — have sparked both support and dissent in Congress. \nJUST IN: President Trump fires back after reporter asks him why he doesn't g…",
    "link": "https://biztoc.com/x/62ff74056652fb10",
    "timestamp": "2025-10-24T12:48:41Z"
  },
  {
    "title": "Daylight saving time ends Nov. 2: essential details",
    "description": "Mark your calendars for the fall time change Americans across most of the country will need to adjust their clocks once again as daylight saving time comes to an end on Nov. 2, 2025. The annual ritual means setting clocks back one hour, giving most people an …",
    "link": "https://rollingout.com/2025/10/24/daylight-saving-time-ends-nov-2-details/",
    "timestamp": "2025-10-24T12:46:30Z"
  },
  {
    "title": "Some furloughed workers will return to manage health insurance open enrollment as shutdown drags on",
    "description": "The Center for Medicare and Medicaid Services says it will temporarily bring all its furloughed employees back to work starting Monday to manage health insurance open enrollment.",
    "link": "https://www.kktv.com/2025/10/24/some-furloughed-workers-will-return-manage-health-insurance-open-enrollment-shutdown-drags/",
    "timestamp": "2025-10-24T12:45:29Z"
  },
  {
    "title": "Kamala Harris Family Secret Service Agent Reportedly Moonlighted As Plus Size Model",
    "description": "A female agent formerly on the Secret Service detail for Vice President Kamala Harris’ stepdaughter Ella Emhoff moonlighted as a model and never passed her physical fitness test, sources told RealClearPolitics. Former Secret Service Director Kimberly Cheatle …",
    "link": "https://freerepublic.com/focus/f-news/4348310/posts",
    "timestamp": "2025-10-24T12:44:23Z"
  }
]