[
  {
    "title": "India sends strong signal: ‘Pakistan must pay for its terror links’, say officials",
    "description": "India has set a new standard with Pakistan. Pakistan will face consequences for supporting terrorism. Retaliation followed the Pahalgam attack. India struck terror camps in Pakistan. India warned it would target those involved in terrorism. Prime Minister Nar…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/india-sends-strong-signal-pakistan-must-pay-for-its-terror-links-say-officials/articleshow/121087465.cms",
    "timestamp": "2025-05-11T23:30:00Z"
  },
  {
    "title": "India sends strong signal: ‘Pakistan must pay for its terror links’, say officials",
    "description": "India has set a new standard with Pakistan. Pakistan will face consequences for supporting terrorism. Retaliation followed the Pahalgam attack. India struck terror camps in Pakistan. India warned it would target those involved in terrorism. Prime Minister Nar…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/india-sends-strong-signal-pakistan-must-pay-for-its-terror-links-say-officials/articleshow/121087022.cms",
    "timestamp": "2025-05-11T23:30:00Z"
  },
  {
    "title": "Senate President invites Trump to the Bay State to see how ‘we do it right’",
    "description": "The President of the United States should come to Massachusetts to witness the positive impact of policies he frequently derides, according to a leading Bay State lawmaker.",
    "link": "https://www.bostonherald.com/2025/05/11/senate-president-invites-trump-to-the-bay-state-to-see-how-we-do-it-right/",
    "timestamp": "2025-05-11T23:29:32Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications.",
    "link": "https://www.clickondetroit.com/health/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-11T23:26:20Z"
  },
  {
    "title": "Separatism Is Surging in Oil-Rich Province of Alberta, Where Many Want to Ditch Ultraliberal Canada and Become 51st State of the US",
    "description": "Albrta’s Premiere Danielle Smith has floated a referendum on leaving Canada – and many citizens want to join the US. ============================================================================== For someone who isn’t paying close attention, the current US-Ca…",
    "link": "https://freerepublic.com/focus/f-news/4316417/posts",
    "timestamp": "2025-05-11T23:25:03Z"
  },
  {
    "title": "‘A Flying Grift!’ Democrat Rep. Sends Blistering Demand Trump Face ‘Immediate’ IG Ethics Review On Qatari Jet Gift",
    "description": "In an official letter from his office to the GAO and the Office of Ethics, Torres demanded an Inspector General review of the reported gift from Qatar to Trump.\nThe post ‘A Flying Grift!’ Democrat Rep. Sends Blistering Demand Trump Face ‘Immediate’ IG Ethics …",
    "link": "https://www.mediaite.com/news/a-flying-grift-democrat-rep-sends-blistering-demand-trump-face-immediate-ig-ethics-review-on-qatari-jet-gift/",
    "timestamp": "2025-05-11T23:23:43Z"
  },
  {
    "title": "Breaking: Trump Announces Earth-Shaking Change to Prescription Drug Prices for Every Single American",
    "description": "\"Our Country will finally be treated fairly, and our citizens Healthcare Costs will be reduced by numbers never even thought of before.\"",
    "link": "https://www.westernjournal.com/breaking-trump-announces-earth-shaking-change-prescription-drug-prices-every-single-american-one-consequential-executive-orders-countrys-history/",
    "timestamp": "2025-05-11T23:22:44Z"
  },
  {
    "title": "Trump says will sign order to cut drug prices by 30-80%",
    "description": "United States President Donald Trump announced on Truth Social that he would sign an executive order on Monday that will reduce prescription drug and pharmaceutical prices by 30-80% \"almost immed...",
    "link": "https://biztoc.com/x/aef61b07989df50f",
    "timestamp": "2025-05-11T23:22:01Z"
  },
  {
    "title": "Staff layoffs in UK gain pace amid Trump tariff turmoil and labour cost increases",
    "description": "UK employers laid off staff in April at a faster pace than the previous month as the combination of higher employment costs and shock waves from Donald Trump’s tariff war sent boardroom confidence levels plummeting.\nThe human resources association, CIPD, said…",
    "link": "https://biztoc.com/x/48f701088fd310e1",
    "timestamp": "2025-05-11T23:21:45Z"
  },
  {
    "title": "Trump signs executive order cutting drug prices by 30% to 80%, industry braces for losses",
    "description": "Donald Trump has signed an executive order to cut U.S. prescription drug prices by 30% to 80%, and the pharmaceutical industry is bracing for a financial hit when markets open. The Most Favored Nation policy ensures that Americans will pay no more than the lo…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316416/posts",
    "timestamp": "2025-05-11T23:20:26Z"
  },
  {
    "title": "Stocks, dollar gain on US-China trade talks, detail needed",
    "description": "Wall Street stock futures jumped and the dollar firmed against safe haven peers on Monday as signs of progress in U.S.-China trade talks boosted hopes a...",
    "link": "https://finance.yahoo.com/news/stocks-dollar-gain-us-china-232014833.html",
    "timestamp": "2025-05-11T23:20:14Z"
  },
  {
    "title": "Trump announces he’ll sign executive order that aims to cut drug prices | CNN Politics",
    "description": "President Donald Trump announced Sunday that he plans to resurrect a controversial policy from his first term that aims to reduce drug costs by basing payments for certain medicines on their prices in other countries.",
    "link": "https://www.cnn.com/2025/05/11/politics/trump-prescription-drug-prices",
    "timestamp": "2025-05-11T23:18:59Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he'll sign an executive order on Monday that, if implemented, could bring down the costs of some medications — reviving a failed ...",
    "link": "https://www.yahoo.com/news/trump-promises-order-us-pay-231718137.html",
    "timestamp": "2025-05-11T23:17:18Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications.",
    "link": "https://www.news4jax.com/health/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-11T23:17:18Z"
  },
  {
    "title": "PM Modi tells forces to respond harder to Pakistan actions: Sources",
    "description": "NEW DELHI, May 11: There is a new normal in India’s response to cross-border terrorism, with Prime Minister Narendra Modi instructing the armed forces that the country’s response to every action by Pakistan should be more forceful, government sources said on …",
    "link": "https://thehillstimes.in/national/pm-modi-tells-forces-to-respond-harder-to-pakistan-actions-sources",
    "timestamp": "2025-05-11T23:15:00Z"
  },
  {
    "title": "Trump seeks to match US drug costs with cheaper ones abroad",
    "description": "President Donald Trump said he plans to sign an executive order to cut prescription drug prices by mandating that the US pays the same price for drugs as whichever country pays the lowest price in the world.\nHe said in a social media post that that he would s…",
    "link": "https://biztoc.com/x/10069f503fa0d006",
    "timestamp": "2025-05-11T23:10:50Z"
  },
  {
    "title": "US, China tease 'substantial' trade talk progress",
    "description": "The News\nThe US touted “substantial progress” following two days of trade talks with China in Switzerland, with details of a possible deal set to be announced Monday.\nThe outcome of the meeting — which US President Donald Trump characterized as “a total reset…",
    "link": "https://biztoc.com/x/3b85ad03acd1a132",
    "timestamp": "2025-05-11T23:10:37Z"
  },
  {
    "title": "Trump confirms: Edan Alexander is coming home",
    "description": "US President confirms that Edan Alexander will be released by Hamas: This was a step taken in good faith towards the United States. Hopefully this is the first of those final steps necessary to end this brutal conflict.",
    "link": "https://www.israelnationalnews.com/news/408192",
    "timestamp": "2025-05-11T23:10:37Z"
  },
  {
    "title": "Staff layoffs in UK gain pace amid Trump tariff turmoil and labour cost increases",
    "description": "Surveys show employer confidence at record low, prompting job cuts and hiring freeze",
    "link": "https://finance.yahoo.com/news/staff-layoffs-uk-gain-pace-230035511.html",
    "timestamp": "2025-05-11T23:00:35Z"
  },
  {
    "title": "No, Karoline Leavitt did not debate Rachel Maddow on the latter's MSNBC show",
    "description": "In April or May 2025, White House Press Secretary Karoline Leavitt debated and confronted MSNBC host Rachel Maddow on live television.",
    "link": "https://www.snopes.com//fact-check/karoline-leavitt-rachel-maddow/",
    "timestamp": "2025-05-11T23:00:00Z"
  },
  {
    "title": "Trump Doesn't Want Netanyahu To Spoil His Gulf Visit As Frustrations Boil",
    "description": "Trump Doesn't Want Netanyahu To Spoil His Gulf Visit As Frustrations Boil\n \nVia Middle East Eye\nUS President Donald Trump seems to think Israel could ruin his big trip to the Middle East, and it’s causing trouble. Trump appears to want the Middle East to have…",
    "link": "https://biztoc.com/x/957699f2de90882b",
    "timestamp": "2025-05-11T22:59:30Z"
  },
  {
    "title": "Israel must consider if it can rely on Trump whose choices seem driven by personal gain",
    "description": "The Israeli public has every right to wonder whether Trump’s commitments to its nation are contingent on his personal financial interests.",
    "link": "https://www.jpost.com/opinion/article-853567",
    "timestamp": "2025-05-11T22:56:12Z"
  },
  {
    "title": "‘Suckers’: Trump to sign ‘one of the most consequential executive orders’ in history, reducing prescription drug prices by up to 80%",
    "description": "'We are going to do the right thing, something that the Democrats have fought for many years'",
    "link": "https://www.wnd.com/2025/05/suckers-trump-to-sign-one-of-the-most-consequential-executive-orders-in-history-reducing-prescription-drug-prices-by-up-to-80/",
    "timestamp": "2025-05-11T22:55:54Z"
  },
  {
    "title": "Indira ‘mishandled’ situation post- Bangladesh creation: Assam CM Himanta Biswa Sarma",
    "description": "GUWAHATI, May 11: Chief Minister Himanta Biswa Sarma on Sunday criticised former Prime Minister Indira Gandhi for her “mishandling” of the situation following the creation of Bangladesh after India’s historic 1971 win against Pakistan. In a post on X, Sarma a…",
    "link": "https://thehillstimes.in/assam/indira-mishandled-situation-post-bangladesh-creation-assam-cm-himanta-biswa-sarma",
    "timestamp": "2025-05-11T22:55:00Z"
  },
  {
    "title": "Donald Trump says he will sign executive order to slash prices of prescription drugs in US",
    "description": "US president says pharmaceutical prices will fall by 30-80%",
    "link": "https://www.irishtimes.com/world/us/2025/05/11/donald-trump-says-he-will-sign-executive-order-to-slash-prices-of-prescription-drugs-in-us/",
    "timestamp": "2025-05-11T22:53:29Z"
  },
  {
    "title": "Trump to sign executive order he says will slash drug prices by up to 80%",
    "description": "President Trump will sign an executive order Monday that he says will drop the prices of prescription drugs between 30-80% \"almost immediately.\"",
    "link": "https://www.foxnews.com/politics/trump-sign-executive-order-he-says-slash-drug-prices-up-80",
    "timestamp": "2025-05-11T22:53:00Z"
  },
  {
    "title": "Edan Alexander release: (bosses of \"Palestinian\") Qatar pressured Hamas to give Trump win.",
    "description": "Israeli sources speaking to Maariv said that Qatar pressured the terrorist group hard to give Trump an achievement he could celebrate during his visit to the Middle East.Donald J. Trump @realDonaldTrump: I am happy to announce that Edan Alexander, an American…",
    "link": "https://freerepublic.com/focus/f-news/4316413/posts",
    "timestamp": "2025-05-11T22:52:24Z"
  },
  {
    "title": "Donald Trump Vows to Reduce Prescription Drug Costs by Up to 80 Percent",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump on Sunday evening announced in a Truth Social post that he would sign an executive order that would bring down the price of prescription drugs by 30 to 80 percent for Americans.\nTrump te…",
    "link": "https://biztoc.com/x/e153bb12ff358203",
    "timestamp": "2025-05-11T22:48:29Z"
  },
  {
    "title": "Donald Trump Vows to Reduce Prescription Drug Costs by Up to 80 Percent",
    "description": "President Donald Trump announced his plan to sign an executive order on Monday through a post on Truth Social on Sunday evening.",
    "link": "https://www.newsweek.com/donald-trump-vows-reduce-prescription-drug-costs-80-percent-2070726",
    "timestamp": "2025-05-11T22:48:06Z"
  },
  {
    "title": "Time spent in Europe gave me perspective on the U.S. and our stocks",
    "description": "It's almost as if you can see why these European markets are roaring, and we are way behind.",
    "link": "https://www.cnbc.com/2025/05/11/jim-cramer-time-spent-in-europe-gave-me-perspective-on-the-us-and-our-stocks.html",
    "timestamp": "2025-05-11T22:45:53Z"
  },
  {
    "title": "트석열 계엄과 관세 여파 피부로 와 닿는다",
    "description": "US consumer prices probably picked up in April, likely foreshadowing a broader acceleration in inflation as companies seek to pass on higher tariffs. https://t.co/eUW7JCMSKu— Bloomberg (@business) May 11, 2025 US consumer borrowing increased in March by the m…",
    "link": "https://ryueyes11.tistory.com/511622",
    "timestamp": "2025-05-11T22:44:24Z"
  },
  {
    "title": "1st group of white South Africans heads for US after Trump offers them refugee status",
    "description": "A group of 49 white South Africans has departed their homeland for the United States on a private charter plane having been offered refugee status by the Trump administration",
    "link": "https://abcnews.go.com/US/wireStory/group-49-white-south-africans-leaves-us-after-121696684",
    "timestamp": "2025-05-11T22:43:27Z"
  },
  {
    "title": "‘FAIRNESS TO AMERICA!’ Trump Announces Executive Order to Slash Prescription Drug Prices ‘By 30% to 80%’",
    "description": "Trump said he's issuing an executive order to reduce domestic drug prices with a \"favored nation\" plan that will raise prices everywhere else for \"fairness.\"\nThe post ‘FAIRNESS TO AMERICA!’ Trump Announces Executive Order to Slash Prescription Drug Prices ‘By…",
    "link": "https://www.mediaite.com/trump/fairness-to-america-trump-announces-executive-order-to-slash-prescription-drug-prices-by-30-to-80/",
    "timestamp": "2025-05-11T22:37:36Z"
  },
  {
    "title": "Trump: Prescription drug, pharma prices will be cut by 30-80%",
    "description": "United States President Donald Trump announced that he would be signing an executive order tomorrow to reduce prescription drug and pharmaceutical prices by 30-80%, \"almost immediately.\"\nMo...",
    "link": "https://biztoc.com/x/cf94464a6eeda33a",
    "timestamp": "2025-05-11T22:37:16Z"
  },
  {
    "title": "Stock futures surge as White House touts China trade deal",
    "description": "Investing.com -- U.S. stock futures opened sharply higher Sunday evening after the White House announced a trade deal with China had been reached following...",
    "link": "https://finance.yahoo.com/news/stock-futures-surge-white-house-223624280.html",
    "timestamp": "2025-05-11T22:36:24Z"
  },
  {
    "title": "Trump spills details about 'one of the most consequential orders in our country's history'",
    "description": "Donald Trump on Sunday released the details of what he has said is one of the most important orders ever issued.\n\nTrump over the weekend took to Truth Social to tease the announcement, which he described as one of the \"most important and impactful.\"\n\nA few ho…",
    "link": "https://www.rawstory.com/trump-details-prescription-history/",
    "timestamp": "2025-05-11T22:35:30Z"
  },
  {
    "title": "Trump to sign EO - Prescription Drug and Pharmaceutical prices will be REDUCED, almost immediately, by 30% to 80%.",
    "description": "For many years the World has wondered why Prescription Drugs and Pharmaceuticals in the United States States of America were SO MUCH HIGHER IN PRICE THAN THEY WERE IN ANY OTHER NATION, SOMETIMES BEING FIVE TO TEN TIMES MORE EXPENSIVE THAN THE SAME DRUG, MANUF…",
    "link": "https://freerepublic.com/focus/f-news/4316409/posts",
    "timestamp": "2025-05-11T22:32:39Z"
  },
  {
    "title": "US touts 'substantial progress' in tariff talks with China, but details are still scarce",
    "description": "The lead U.S. negotiator in trade talks with China cheered “a great deal of productivity” in resolving differences between the world’s two leading economic powers, after officials wrapped two days of bargaining in Switzerland following President Donald...",
    "link": "https://abcnews.go.com/US/wireStory/us-touts-substantial-progress-tariff-talks-china-details-121683286",
    "timestamp": "2025-05-11T22:30:19Z"
  },
  {
    "title": "ABC News: Trump to accept 747 from Qatar to use as Air Force One | Honolulu Star-Advertiser",
    "description": "The Trump administration intends to accept a Boeing 747-8 plane as a gift from the Qatari royal family that would then be outfitted to serve as Air Force One, ABC News reported on Sunday, citing unnamed sources familiar with the matter.",
    "link": "https://www.staradvertiser.com/2025/05/11/breaking-news/abc-news-trump-to-accept-747-from-qatar-to-use-as-air-force-one/",
    "timestamp": "2025-05-11T22:26:15Z"
  },
  {
    "title": "Witkoff dismisses reports of Trump-Netanyahu rift as 'preposterous'",
    "description": "Trump’s Middle East envoy dismisses reports of a rift with Netanyahu as \"preposterous,\" reaffirms the strong US-Israel alliance.",
    "link": "https://www.israelnationalnews.com/news/408191",
    "timestamp": "2025-05-11T22:25:27Z"
  },
  {
    "title": "Separatism Is Surging in Oil-Rich Province of Alberta, Where Many Want to Ditch Ultraliberal Canada and Become 51st State of the US",
    "description": "For someone who isn’t paying close attention, the current US-Canada bilateral relations seem like a defeat for the Donald J.\nThe post Separatism Is Surging in Oil-Rich Province of Alberta, Where Many Want to Ditch Ultraliberal Canada and Become 51st State of …",
    "link": "https://www.thegatewaypundit.com/2025/05/separatism-is-surging-oil-rich-province-alberta-where/",
    "timestamp": "2025-05-11T22:20:52Z"
  },
  {
    "title": "Trump’s Ukraine push coming to a head with challenge to Putin",
    "description": "Following a weekend of hectic diplomacy, Zelenskyy said he will travel to Istanbul on May 15 where Putin has proposed direct negotiations between the two countries.",
    "link": "https://www.japantimes.co.jp/news/2025/05/12/world/politics/trump-zelenskyy-challenge-putin/",
    "timestamp": "2025-05-11T22:20:00Z"
  },
  {
    "title": "Hamas Agrees To Release Last Living U.S. Hostage In Gaza Truce Efforts",
    "description": "U.S. envoy Steve Witkoff confirmed that the militant group will free Israeli American soldier Edan Alexander for a ceasefire and an end to the aid blockade.",
    "link": "https://www.huffpost.com/entry/hamas-agrees-release-american-hostage-israel-gaza_n_68211a80e4b0d06d24342a05",
    "timestamp": "2025-05-11T22:19:03Z"
  },
  {
    "title": "White House says it has a deal with China while Chinese call it 'consensus'",
    "description": "After second day of talks with the U.S., Chinese Vice Premier He Lifeng said trade talks with the U.S. “achieved substantial progress and reached important consensus.”",
    "link": "https://abcnews.go.com/Politics/white-house-deal-china-chinese-call-consensus/story?id=121694971",
    "timestamp": "2025-05-11T22:18:44Z"
  },
  {
    "title": "Stock futures rise after ‘substantial progress’ is made in US-China trade negotiations | CNN Business",
    "description": "Stock futures rose Sunday after Treasury Secretary Scott Bessent said “substantial progress” was made in trade negotiations with Chinese officials, potentially thawing tensions kickstarted by Trump’s escalating tariff policy.",
    "link": "https://www.cnn.com/2025/05/11/business/stock-futures-china-tariff-deal",
    "timestamp": "2025-05-11T22:18:25Z"
  },
  {
    "title": "Stock futures rise after ‘substantial progress’ is made in US-China trade negotiations | CNN Business",
    "description": "US stocks rose Monday as traders rallied on the Trump administration’s exemption for tariffs on smartphones, computers and various electronics imported from China.",
    "link": "https://www.cnn.com/2025/05/11/business/stock-futures-trump-tariffs",
    "timestamp": "2025-05-11T22:18:25Z"
  },
  {
    "title": "Trump tariffs and US Imperialism",
    "description": "Trump’s April 2025 tariff blitz ignited market chaos and deepened rifts within his own coalition. Beneath the turmoil lies a battle between technocrats, ultranationalists, and anti-imperial populists, all vying to reshape—or destroy—American global power.",
    "link": "https://africasacountry.com/2025/05/trump-tariffs-and-us-imperialism/",
    "timestamp": "2025-05-11T22:14:21Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "The White House on Sunday touted a “China trade deal” — without providing details — after two top U.S. officials alluded to a potential agreement with China following talks between the two countries in Switzerland over the weekend.",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-may-11-rcna205695",
    "timestamp": "2025-05-11T22:06:59Z"
  },
  {
    "title": "Puerto Rico seeks to lure manufacturing to boost its economy as Trump's tariff war deepens",
    "description": "A global trade war is offering Puerto Rico hope as the island attempts to strengthen its fragile economy",
    "link": "https://abcnews.go.com/Business/wireStory/puerto-rico-seeks-lure-manufacturing-boost-economy-trumps-121685817",
    "timestamp": "2025-05-11T22:06:26Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Trump administration announced a \"trade deal\" with China following negotiations over the weekend in Switzerland.",
    "link": "https://www.cnbc.com/2025/05/11/stock-market-today-live-updates.html",
    "timestamp": "2025-05-11T22:04:00Z"
  },
  {
    "title": "Trump Says He’s ‘OK’ With Raising Taxes On Wealthy",
    "description": "President Donald Trump said he supports raising taxes on the wealthy to pay for other cuts in his signature economic package, ...",
    "link": "https://biztoc.com/x/9f653216a54e5126",
    "timestamp": "2025-05-11T22:02:10Z"
  },
  {
    "title": "Hamas Claims It Will Release Israeli American Hostage Edan Alexander",
    "description": "Hamas issued a statement claiming it will release Edan Alexander, who is believed to be the last known living American being held hostage by the terrorist group, according to several reports.\nThe post Hamas Claims It Will Release Israeli American Hostage Edan…",
    "link": "https://www.breitbart.com/middle-east/2025/05/11/hamas-claims-it-will-release-israeli-american-hostage-edan-alexander/",
    "timestamp": "2025-05-11T21:58:52Z"
  },
  {
    "title": "Toyota faces biggest hit from Trump tariffs among auto companies",
    "description": "Toyota Motor Corp. is the biggest carmaker in the world — and also the auto industry’s biggest loser when it comes to projected losses from US President Donald Trump’s trade war.\nDuties on imported cars and auto parts forced General Motors Co. to slash its fu…",
    "link": "https://biztoc.com/x/5d9826245c2a8b8d",
    "timestamp": "2025-05-11T21:52:54Z"
  },
  {
    "title": "‘Everything that doesn’t work’: Pollster explains why Dems double down on what already blew up in their faces",
    "description": "'There's going to be a big battle at some point as to who's going to be the darling of the Democratic Party'",
    "link": "https://www.wnd.com/2025/05/everything-that-doesnt-work-pollster-explains-why-dems-double-down-on-what-already-blew-up-in-their-faces/",
    "timestamp": "2025-05-11T21:49:48Z"
  },
  {
    "title": "What To Watch For When The Details Of The Trade Deal With China Are Announced",
    "description": "The whole world has been shocked by the fact that the U.S. and China were able to work out a “trade deal” in just a single weekend.  Ultimately, I think that the Chinese were a lot more motivated to get something done than a lot of us originally thought.  So …",
    "link": "http://theeconomiccollapseblog.com/what-to-watch-for-when-the-details-of-the-trade-deal-with-china-are-announced/",
    "timestamp": "2025-05-11T21:49:09Z"
  },
  {
    "title": "Zelensky Agrees to Meet Putin",
    "description": "“Ukrainian President Volodymyr Zelensky said he would agree to meet Kremlin leader Vladimir Putin in Turkey on Thursday after U.S. President Donald Trump told him immediately to accept Putin's proposal of direct talks,” USA Today",
    "link": "https://politicalwire.com/2025/05/11/zelensky-agrees-to-meet-putin/",
    "timestamp": "2025-05-11T21:40:00Z"
  },
  {
    "title": "Raut questions timing of India-Pakistan understanding, seeks all-party meet to discuss issue",
    "description": "Mumbai, May 11: Shiv Sena (UBT) leader Sanjay Raut on Sunday lambasted the government for agreeing to reach an understanding with Pakistan at a juncture when there was an opportunity to teach the neighbouring country a lesson, and demanded an all-party meetin…",
    "link": "https://thehillstimes.in/national/raut-questions-timing-of-india-pakistan-understanding-seeks-all-party-meet-to-discuss-issue",
    "timestamp": "2025-05-11T21:40:00Z"
  },
  {
    "title": "Jawaharlal Nehru had convened special session during Indo-China war: Digvijaya",
    "description": "Guna (MP), May 11: Congress leader Digvijaya Singh on Sunday reminded the Union government of the then Prime Minister Jawaharlal Nehru convening a special session of Parliament during the war with China following a request by Atal Bihari Vajpayee.  Singh wond…",
    "link": "https://thehillstimes.in/national/jawaharlal-nehru-had-convened-special-session-during-indo-china-war-digvijaya",
    "timestamp": "2025-05-11T21:35:00Z"
  },
  {
    "title": "'Forces unleashed': Fox reporter warns of 'nasty market turns' from 'draconian' Trump plan",
    "description": "A veteran Donald Trump reporter on Sunday said that his sources fear Donald Trump may have already set things in motion for a massive economic downturn.\nFOX Biz senior correspondent Charles Gasparino, who reports on Trump often and earned the ire of MAGA when…",
    "link": "https://www.rawstory.com/trump-fox-nasty-market-turn/",
    "timestamp": "2025-05-11T21:30:59Z"
  },
  {
    "title": "Musk says testing gold card visa program in ‘quiet trial’",
    "description": "President Donald Trump’s “gold card” visa program is quietly being tested to ensure the system works properly, Elon Musk said in a post on X.\n“Once it is fully tested, it will be rolled out to the public with an announcement by the president,” Musk said.\nThe …",
    "link": "https://biztoc.com/x/f5db5300692a2405",
    "timestamp": "2025-05-11T21:30:42Z"
  },
  {
    "title": "Normalization between al Sharaa's Syria, Israel possible after decades of hostilities",
    "description": "If al Sharaa eventually delivers the state that he promises, he will have proved himself the most remarkable leader to have emerged in the Arab world.",
    "link": "https://www.jpost.com/opinion/article-853558",
    "timestamp": "2025-05-11T21:28:40Z"
  },
  {
    "title": "Laura Loomer Slams Trump Qatari Jet Gift As ‘Such a Stain’ On His Presidency: ‘I’m So Disappointed’",
    "description": "Loomer, a longtime Trump loyalist, posted a series of statements on X condemning the acceptance of the $400 million Boeing jet from the country\nThe post Laura Loomer Slams Trump Qatari Jet Gift As ‘Such a Stain’ On His Presidency: ‘I’m So Disappointed’ first …",
    "link": "https://www.mediaite.com/politics/laura-loomer-slams-trump-qatari-jet-gift-as-such-a-stain-on-his-presidency-im-so-disappointed/",
    "timestamp": "2025-05-11T21:26:05Z"
  },
  {
    "title": "Trump health cuts create ‘real danger’ around disease outbreaks, workers warn - NewsBreak",
    "description": "Key programs from child-support services to HIV treatment also gutted, leaving global populations vulnerable",
    "link": "https://www.newsbreak.com/share/4002624614235-trump-health-cuts-create-real-danger-around-disease-outbreaks-workers-warn?s=a2&amp;share_destination_id=MjE0MDc5NjUwLTE3NDY5OTg2NTQzMDE%3D&amp;pd=0EUFtaFN&amp;hl=en_US&amp;send_time=1746998654&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v2%2Cns_local_strategy_25q1_exp-v3%2Cns_foryou_recall_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v3%2Cns_foryou_blend_exp_25q2-v2",
    "timestamp": "2025-05-11T21:24:43Z"
  },
  {
    "title": "Trump set to accept luxury 747 from Qatar to use as Air Force One, ABC News says",
    "description": "(Reuters) -The Trump administration intends to accept a Boeing 747-8 plane as a gift from the Qatari royal family that would then be outfitted to serve as Air Force One, ABC News reported on Sunday, citing unnamed sources familiar with the matter. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/05/12/trump-set-to-accept-luxury-747-from-qatar-to-use-as-air-force-one-abc-news-says",
    "timestamp": "2025-05-11T21:24:00Z"
  },
  {
    "title": "Economic jitters and soaring gold prices create a frenzy for U.S. jewelry merchants",
    "description": "At the biggest jewelry center in the United States, Alberto Hernandez fired up his machine on a recent day and waited until it glowed bright orange inside before shoveling in an assortment of rings, earrings and necklaces weighing about as much as a bar of so…",
    "link": "https://japantoday.com/category/business/economic-jitters-and-soaring-gold-prices-create-a-frenzy-for-us-jewelry-merchants",
    "timestamp": "2025-05-11T21:23:26Z"
  },
  {
    "title": "Japan, Chile leaders reaffirm free trade importance",
    "description": "The leaders of Japan and Chile on Sunday reaffirmed the importance of free trade as both countries feel the impact of tariffs unleashed by the administration of U.S. President Donald Trump. In a meeting with Chilean President Gabriel Boric, Prime Minister Shi…",
    "link": "https://japantoday.com/category/politics/japan-chile-leaders-reaffirm-free-trade-importance-amid-u.s.-tariffs",
    "timestamp": "2025-05-11T21:22:08Z"
  },
  {
    "title": "Cannes, the global Colosseum of film, readies for 78th edition with new challenges on horizon",
    "description": "Nowhere is the border-crossing nature of cinema more evident than the Cannes Film Festival, which kicks off Tuesday in the wake of U.S. President Donald Trump’s vow to enact tariffs on international films. Cannes, where filmmakers, sales agents and journalist…",
    "link": "https://japantoday.com/category/entertainment/cannes-the-global-colosseum-of-film-readies-for-78th-edition-with-new-challenges-on-the-horizon",
    "timestamp": "2025-05-11T21:21:12Z"
  },
  {
    "title": "BBC team's tense encounter with sanctioned Israeli settler while filming in West Bank",
    "description": "Israeli settler Moshe Sharvit established a so-called 'outpost'  in occupied West Bank",
    "link": "https://www.bbc.com/news/articles/c8d1j3v2y3mo",
    "timestamp": "2025-05-11T21:20:47Z"
  },
  {
    "title": "Iran, U.S. conclude 4th round of negotiations over Tehran's nuclear program in Oman",
    "description": "Iran and the United States held a fourth round of negotiations Sunday over Tehran’s rapidly advancing nuclear program, just ahead of a visit by President Donald Trump to the Middle East this week. The talks ran for some three hours in Muscat, the capital of O…",
    "link": "https://japantoday.com/category/world/iran-and-the-us-begin-a-4th-round-of-negotiations-over-tehran%27s-nuclear-program-in-oman",
    "timestamp": "2025-05-11T21:20:06Z"
  },
  {
    "title": "Trump to accept luxury ‘flying palace’ gift plane from Qatar – media",
    "description": "The opulent Boeing 747-8 is expected to replace the aging Air Force One Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617397-trump-flying-palace-gift/",
    "timestamp": "2025-05-11T21:20:03Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan as Trump offers more help",
    "description": "A ceasefire between India and Pakistan was holding on Sunday after both sides blamed the other for initial violations, as U.S. President Donald Trump vowed to help the arch-rivals find a solution on the disputed Kashmir region. The truce that took effect on S…",
    "link": "https://japantoday.com/category/world/fragile-ceasefire-holds-between-india-pakistan-as-trump-offers-more-help2",
    "timestamp": "2025-05-11T21:19:50Z"
  },
  {
    "title": "Witkoff: Claims of Trump, Netanyahu's rift false",
    "description": "United States Special Envoy to the Middle East Steve Witkoff dismissed the allegations of a rift between President Donald Trump and Israeli Prime Minister Benjamin Netanyahu as \"preposterous.\"Speaking...",
    "link": "https://biztoc.com/x/162031a5e3720dd6",
    "timestamp": "2025-05-11T21:19:40Z"
  },
  {
    "title": "Trump to accept lavish jet from Qataris as Air Force One: reports",
    "description": "Donald Trump intends to accept a luxury Boeing jet from the Qatari royal family for use as Air Force One, then continue flying in it after his tenure, despite strict rules on U.S. presidential gifts, media reported Sunday. Calling the plane a &quot;flying pal…",
    "link": "https://japantoday.com/category/world/trump-to-accept-lavish-jet-from-qataris-as-air-force-one-reports",
    "timestamp": "2025-05-11T21:19:26Z"
  },
  {
    "title": "White House claims 'substantial progress' on China trade deal",
    "description": "The White House announced that talks between the United States and China regarding a trade deal have made \"substantial progress,\" yet no official deal has been announced at this time, leaving investors in doubt.According to a May 11 announcement from the Whit…",
    "link": "https://cointelegraph.com/news/white-house-claims-substantial-progress-china-trade-deal",
    "timestamp": "2025-05-11T21:19:23Z"
  },
  {
    "title": "U.S. officials say deal struck to cut China trade deficit; details on Monday",
    "description": "U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer said on Sunday they reached a deal with China to cut the U.S. trade deficit, describing &quot;substantial progress&quot; in high-stakes talks with Chinese officials but offering no …",
    "link": "https://japantoday.com/category/world/us-officials-say-deal-struck-to-cut-china-trade-deficit-details-on-monday",
    "timestamp": "2025-05-11T21:19:10Z"
  },
  {
    "title": "Zelenskyy hopes for ceasefire with Russia and says he'll be 'waiting for Putin' in Turkey personally",
    "description": "Ukrainian President Volodymyr Zelenskyy said Sunday he is hoping for a full and temporary ceasefire with Russia starting Monday, adding he would be in Turkey to negotiate with Russian President Vladimir Putin “personally.” His comments came after U.S. Preside…",
    "link": "https://japantoday.com/category/world/ukrainian-president-welcomes-russian-overtures-but-says-ceasefire-must-come-before-peace-talks",
    "timestamp": "2025-05-11T21:19:03Z"
  },
  {
    "title": "Trump set to accept luxury 747 from Qatar to use as Air Force One, ABC News says",
    "description": "(Reuters) -The Trump administration intends to accept a Boeing 747-8 plane as a gift from the Qatari royal family that would then be outfitted to serve as...",
    "link": "https://ca.news.yahoo.com/trump-set-accept-luxury-747-211828882.html",
    "timestamp": "2025-05-11T21:18:28Z"
  },
  {
    "title": "USDA Halts Livestock Imports at Southern Border Amid Parasite Threat",
    "description": "The agency suspended livestock imports as a deadly screwworm parasite spreads northward in Mexico, threatening U.S. agriculture and food security.",
    "link": "https://www.newsweek.com/usda-halts-livestock-imports-southern-border-amid-parasite-threat-2070719",
    "timestamp": "2025-05-11T21:17:43Z"
  },
  {
    "title": "US, China hail ‘substantial progress’ made in tariff talks in Geneva",
    "description": "The two countries have said they will issue a joint statement on the talks on Monday.",
    "link": "https://www.aljazeera.com/economy/2025/5/11/us-china-hail-substantial-progress-made-in-tariff-talks-in-geneva",
    "timestamp": "2025-05-11T21:10:15Z"
  },
  {
    "title": "Ed Husic hits back as Albanese finalises new cabinet",
    "description": "Ed Husic and Mark Dreyfus' anger has boiled to the surface as Anthony Albanese prepares to confirm his new frontbench, while the Nationals are gearing up for Matt Canavan's tilt at the party leadership.\nThe post Ed Husic hits back as Albanese finalises new ca…",
    "link": "http://www.crikey.com.au/2025/05/12/ed-husic-mark-dreyfus-labor-matt-canavan-nationals-leadership/",
    "timestamp": "2025-05-11T21:04:17Z"
  },
  {
    "title": "Donald Trump secures China trade deal that may ease smartphone and PC prices",
    "description": "President Trump just pulled off what might be one of the biggest wins of his second term, and it could have major implications for the tech world. After some high-stakes negotiations in Geneva, the United States and China have struck a trade deal that could r…",
    "link": "https://betanews.com/2025/05/11/donald-trump-secures-china-trade-deal-that-may-ease-smartphone-and-pc-prices/",
    "timestamp": "2025-05-11T21:02:38Z"
  },
  {
    "title": "Trump Presses Ukraine to Accept Putin's Proposal for Talks",
    "description": "President Donald Trump on Sunday pressed Ukraine via Truth Social to accept Russian President Vladimir Putin's proposal to meet in Turkey on Thursday to hammer out an end to the war. Trump wrote in the post that \"President Putin of Russia doesn’t want to have…",
    "link": "https://freerepublic.com/focus/f-news/4316398/posts",
    "timestamp": "2025-05-11T21:02:31Z"
  },
  {
    "title": "U.S. and Iran Conclude Fourth Round of Nuclear Talks Ahead of President Trump’s Middle East Visit",
    "description": "The United States and Iran concluded a fourth round of nuclear negotiations in Oman on Sunday, just days before President Donald Trump embarks on a high-stakes diplomatic tour of the Middle East.\nThe post U.S. and Iran Conclude Fourth Round of Nuclear Talks A…",
    "link": "https://www.thegatewaypundit.com/2025/05/u-s-iran-conclude-fourth-round-nuclear-talks/",
    "timestamp": "2025-05-11T21:00:29Z"
  },
  {
    "title": "McGregor For President? With Bitcoin In His Corner, Anything’s Possible",
    "description": "Ex-UFC champion Conor McGregor has suggested Ireland construct a national reserve of Bitcoin. He called on May 9, 2025, in a message posted on X that doing so would give “power back to the people’s money.” He’s contesting the presidency as an independent cand…",
    "link": "https://bitcoinist.com/mcgregor-for-president-with-bitcoin-in-his-corner-anythings-possible/",
    "timestamp": "2025-05-11T21:00:08Z"
  },
  {
    "title": "Ivanka Trump honors late mom Ivana with rare childhood photos in emotional Mother’s Day tribute",
    "description": "Ivana died after falling down the stairs of her New York City apartment in 2022.",
    "link": "https://pagesix.com/2025/05/11/parents/ivanka-trump-shares-rare-childhood-photos-with-late-mom-ivana/",
    "timestamp": "2025-05-11T20:55:00Z"
  },
  {
    "title": "Trump’s ‘Cartographic Compulsion’",
    "description": "Politico looks at what they call Donald Trump’s “cartographic compulsion”—the ways that maps have turned up in his political career over and over, from his use of election maps to Sharpie-gate in his first term,… More",
    "link": "https://www.maproomblog.com/2025/05/trumps-cartographic-compulsion/",
    "timestamp": "2025-05-11T20:53:59Z"
  },
  {
    "title": "Western reporting on India-Pakistan escalation ‘one-sided’ – ex-Indian foreign secretary",
    "description": "The press is obscuring terrorism as the root cause of the latest flare-up between New Delhi and Islamabad, Kanwal Sibal has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/india/617379-ex-indian-foreign-secretary-western-media-distorted-reports-pakistan/",
    "timestamp": "2025-05-11T20:53:37Z"
  },
  {
    "title": "Jordon Hudson falls short at Miss Maine USA pageant as she appears to send message to haters",
    "description": "Jordon Hudson, the girlfriend of Bill Belichick, finished in third place at the Miss Maine USA pageant on Sunday after weeks of turmoil in the media.",
    "link": "https://www.foxnews.com/sports/jordon-hudson-falls-short-miss-maine-usa-pageant-she-appears-send-message-haters",
    "timestamp": "2025-05-11T20:51:18Z"
  },
  {
    "title": "Copyright chief fired by administration",
    "description": "The Trump administration has fired the nation's top copyright official, Shira Perlmutter, days after abruptly terminating the head of the Library of Congress, which oversees the U.S. Copyright Office.",
    "link": "https://www.bostonherald.com/2025/05/11/copyright-chief-fired-by-administration/",
    "timestamp": "2025-05-11T20:48:57Z"
  },
  {
    "title": "GOP Rep Calls ICE Threat to Arrest Democrat Reps ‘Very Drastic’: ‘We Can Peacefully Protest In This Country’",
    "description": "Rep. Michael McCaul called the ICE threat to arrest Democrat lawmakers “very drastic,” saying such action is only justified if a crime was committed.\nThe post GOP Rep Calls ICE Threat to Arrest Democrat Reps ‘Very Drastic’: ‘We Can Peacefully Protest In This …",
    "link": "https://www.mediaite.com/tv/gop-rep-calls-ice-threat-to-arrest-democrat-reps-very-drastic-we-can-peacefully-protest-in-this-country/",
    "timestamp": "2025-05-11T20:48:13Z"
  },
  {
    "title": "Israel maintains ultimatum issued to Hamas over expanded Gaza invasion, source tells ‘Post’",
    "description": "This comes after Israeli officials said that they would not launch the invasion while US President Trump will be in the Middle East.",
    "link": "https://www.jpost.com/breaking-news/article-853586",
    "timestamp": "2025-05-11T20:46:57Z"
  }
]