[
  {
    "title": "Trump calls Team USA ahead of 4 Nations final",
    "description": "Members of the U.S. hockey team said it was \"pretty cool\" to hear from President Donald Trump ahead of Thursday night's 4 Nations Face-Off final against Canada.",
    "link": "https://www.espn.com/nhl/story/_/id/43937974/team-usa-appreciative-trump-call-ahead-4-nations-final",
    "timestamp": "2025-02-20T19:06:49Z"
  },
  {
    "title": "The 45 companies on the MAGA anti-DEI hit list",
    "description": "45 companies with a combined market value of almost $10 trillion have been attacked for their DEI efforts.",
    "link": "https://www.bostonherald.com/2025/02/20/the-45-companies-on-the-maga-anti-dei-hit-list/",
    "timestamp": "2025-02-20T19:05:36Z"
  },
  {
    "title": "Gaza plan requires Hamas removal, no forced relocation, Saudi officials say",
    "description": "A senior Egyptian official added: “The US administration has conveyed to Arab states that it is open to alternative plans regarding Gaza, beyond Trump’s initiative.”",
    "link": "https://www.jpost.com/arab-israeli-conflict/gaza-news/article-843087",
    "timestamp": "2025-02-20T19:02:41Z"
  },
  {
    "title": "Trump's war against federal workers is hurting Washington D.C.'s residents",
    "description": "President Donald Trump's attacks on the federal workforce and home rule for Washington, D.C. are hurting a great American city.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-federal-worker-firings-washington-dc-rcna192634",
    "timestamp": "2025-02-20T19:02:29Z"
  },
  {
    "title": "‘Frankensteinian’ campaign to ‘transition’ kids now in courts",
    "description": "Democrats have sued Trump to force taxpayers to keep funding 'atrocities'",
    "link": "https://www.wnd.com/2025/02/frankensteinian-campaign-to-transition-kids-now-in-courts/",
    "timestamp": "2025-02-20T19:01:10Z"
  },
  {
    "title": "JD FOSTER: How Republicans Can Break History And Hold On To House",
    "description": "Conventional wisdom says Republicans will lose the House in the 2026 mid-term elections.",
    "link": "https://dailycaller.com/2025/02/20/opinion-how-republicans-can-break-history-and-hold-on-to-house-jd-foster/",
    "timestamp": "2025-02-20T19:00:44Z"
  },
  {
    "title": "Trump’s Financial Empire Makes Waves With $10 Million WLFI, $125K SEI Purchase",
    "description": "United States President Donald Trump’s World Liberty Financial announced another round of investments this week to further build its crypto portfolio. According to on-chain data, World Liberty Financial withdrew $10 million USDC from its Coinbase account to p…",
    "link": "https://bitcoinist.com/trumps-financial-empire-makes-waves-with-10-million-wlfi-125k-sei-purchase/",
    "timestamp": "2025-02-20T19:00:42Z"
  },
  {
    "title": "2:00PM Water Cooler 2/20/2025",
    "description": "~ Today's Water Cooler: Politics, Syndemics ~",
    "link": "https://www.nakedcapitalism.com/2025/02/200pm-water-cooler-2-20-2025.html",
    "timestamp": "2025-02-20T19:00:26Z"
  },
  {
    "title": "Inside the effort to dismantle the Department of Education",
    "description": "The Trump administration has cut Education Department spending by hundreds of millions of dollars over the past few weeks. What does that mean for the department's future?",
    "link": "https://www.wbur.org/onpoint/2025/02/20/trump-shut-down-department-of-education",
    "timestamp": "2025-02-20T19:00:24Z"
  },
  {
    "title": "How Trump's 25% auto tariffs can bring the industry to a standstill, a Canadian expert warns",
    "description": "'It would effectively be what we had during 9-11, and during the great recession (of 2008),' a University of Toronto professor tells National Post",
    "link": "https://nationalpost.com/news/canada/how-trumps-25-auto-tariffs-can-bring-the-industry-to-a-standstill-a-canadian-expert-warns",
    "timestamp": "2025-02-20T19:00:07Z"
  },
  {
    "title": "ICE agent faints after touching 'suspicious white powder'...",
    "description": "ONE person has been arrested after an immigration agent touched white powder sent to an ICE office and fainted, according to reports. Federal agents swarmed an Immigration and Customs Enforcement o…",
    "link": "https://www.the-sun.com/news/13585441/white-powder-miramar-immigration-facility-hazmat/",
    "timestamp": "2025-02-20T19:00:03Z"
  },
  {
    "title": "Is the Era of Net Zero Pledges Coming to an End?",
    "description": "Just a few short years ago BP proudly told us they were embarking on a journey – and I quote – “in support of our purpose to reimagine energy for people and our planet, and our ambition to become a Net Zero company by 2050 or sooner and help the world get to …",
    "link": "https://oilprice.com/Energy/Energy-General/Is-the-Era-of-Net-Zero-Pledges-Coming-to-an-End.html",
    "timestamp": "2025-02-20T19:00:00Z"
  },
  {
    "title": "American scientists say their work is under attack and ask Canadians for help",
    "description": "In this week's issue of our environmental newsletter, CBC's Jaela Bernstien gives us an inside look at how U.S. President Donald Trump's crackdown is affecting science, we admire a new highly commended wildlife photo, and we discover what beautiful things can…",
    "link": "https://www.cbc.ca/news/science/what-on-earth-us-scientists-1.7463617",
    "timestamp": "2025-02-20T19:00:00Z"
  },
  {
    "title": "Spared by DOGE—For Now",
    "description": "America's first line of defense against public-health threats is hanging in the balance.",
    "link": "https://www.theatlantic.com/health/archive/2025/02/epidemic-intelligence-service-doge-layoffs/681771/",
    "timestamp": "2025-02-20T19:00:00Z"
  },
  {
    "title": "Tell Your Dad That Reacher Hates Matt Gaetz and His Ilk",
    "description": "Dads freaking love Reacher, and I should know because I am one. Did I watch the second season? -- OK, no, but I do want to watch the new season where Reacher fights an even bigger Reacher. That's a hook,...\nRead more...",
    "link": "https://www.pajiba.com/news/tell-your-dad-that-reacher-hates-matt-gaetz-and-his-ilk.php",
    "timestamp": "2025-02-20T19:00:00Z"
  },
  {
    "title": "US-Zelenskyy news conference called off, Putin ally says Trump '200pc right'",
    "description": "A joint press conference between Ukrainian President Volodymyr Zelenskyy and a key Donald Trump adviser was cancelled on Thursday, amid deteriorating relations between Kyiv and Washington.",
    "link": "https://www.abc.net.au/news/2025-02-21/donald-trump-praised-by-putin-ally-us-ukraine-tensions-continue/104963496",
    "timestamp": "2025-02-20T18:59:45Z"
  },
  {
    "title": "Bessent Is Stealing a Playbook He Didn't Even Like",
    "description": "The new Treasury secretary blasted his predecessor's debt issuance structure when she was in charge. Now, he wants to use it.",
    "link": "https://www.livemint.com/companies/news/bessent-is-stealing-a-playbook-he-didn-t-even-like-11740077983360.html",
    "timestamp": "2025-02-20T18:59:42Z"
  },
  {
    "title": "Could Kamala Harris’ Next Move Be A Run For CA Governor?",
    "description": "Here are the morning's top stories on Thursday, February 20, 2025… Former Vice President Kamala Harris has returned home to Los Angeles after losing to Donald Trump in the November election. The question now is what will she do next? Many pundits are speculat…",
    "link": "https://www.kqed.org/news/12027862/could-kamala-harris-next-move-be-a-run-for-ca-governor",
    "timestamp": "2025-02-20T18:58:19Z"
  },
  {
    "title": "Trump's Elections Demand for Ukraine is Aimed to Make Zelensky Pay a Heavy Price",
    "description": "Zelensky’s “completely disrespectful” verbal sparring match with Donald Trump is “absolutely insane on his part” and can only end badly for him, Larry Johnson, retired CIA intelligence officer, told Sputnik.",
    "link": "https://sputnikglobe.com/20250220/trumps-elections-demand-for-ukraine-is-aimed-to-make-zelensky-pay-a-heavy-price-1121591111.html",
    "timestamp": "2025-02-20T18:57:20Z"
  },
  {
    "title": "Donald Trump’s sons enter AI and data centre space: Will their investment gain from US policies?",
    "description": "Donald Trump’s recent push for AI infrastructure and data centre expansion has coincided with his sons, Donald Trump Jr and Eric Trump, investing in a new company called American Data Centres. Their involvement with Dominari Holdings and its latest subsidiary…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-sons-enter-ai-and-data-centre-space-will-their-investment-gain-from-us-policies/articleshow/118428704.cms",
    "timestamp": "2025-02-20T18:57:18Z"
  },
  {
    "title": "France's Macron Says Will Tell Trump He Cannot \"Be Weak\" With Putin",
    "description": "French President Emmanuel Macron, who is due to make a visit to the White House next week, said Thursday he planned to tell US President Donald Trump that he cannot &quot;be weak&quot; with Vladimir Putin.",
    "link": "https://www.ndtv.com/world-news/frances-emmanuel-macron-says-will-tell-donald-trump-he-cannot-be-weak-with-vladimir-putin-7757554",
    "timestamp": "2025-02-20T18:57:09Z"
  },
  {
    "title": "As Melania Trump returns to the White House, she’s winning Chinese fans",
    "description": "Social media posts reflect an admiration for her taste in fashion.",
    "link": "https://www.bostonherald.com/2025/02/20/china-melania-trump/",
    "timestamp": "2025-02-20T18:57:07Z"
  },
  {
    "title": "Trump signs order banning illegal immigrants from receiving taxpayer-funded benefits",
    "description": "Migrants argue with Panamanian National Border Service members as they try to cross the border between Panama and Costa Rica while trying to return to Venezuela at Paso Canoas between the Panama-Costa Rica border on Feb. 11, 2025. Dozens of Venezuelan migrant…",
    "link": "https://www.catholicnewsagency.com/news/262319/trump-signs-order-banning-illegal-immigrants-from-receiving-taxpayer-funded-benefits",
    "timestamp": "2025-02-20T18:55:00Z"
  },
  {
    "title": "IRS to cut 7,000 jobs as Donald Trump administration pushes federal downsizing",
    "description": "The Internal Revenue Service (IRS) is set to lay off around 7,000 employees across the US as part of the Donald Trump administration’s effort to reduce the size of the federal workforce. The cuts, primarily affecting compliance staff with less than a year’s s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-to-cut-7000-jobs-as-donald-trump-administration-pushes-federal-downsizing/articleshow/118428527.cms",
    "timestamp": "2025-02-20T18:53:34Z"
  },
  {
    "title": "Salt Typhoon hackers exploited stolen credentials and a 7-year-old software flaw in Cisco systems",
    "description": "The Chinese hacking collective has widely leveraged vulnerabilities in communications infrastructure to breach dozens of telecom providers in the U.S. and overseas.",
    "link": "https://www.nextgov.com/cybersecurity/2025/02/salt-typhoon-hackers-exploited-stolen-credentials-and-7-year-old-software-flaw-cisco-systems/403146/",
    "timestamp": "2025-02-20T18:52:00Z"
  },
  {
    "title": "New York Gov. Kathy Hochul Won't Remove Mayor Eric Adams: Reports",
    "description": "Adams faces allegations he sought to help implement Trump's immigration policies in exchange for having his federal corruption charges dropped.",
    "link": "https://www.huffpost.com/entry/new-york-gov-kathy-hochul-wont-remove-mayor-eric-adams_n_67af81a4e4b053b7510fd5d5",
    "timestamp": "2025-02-20T18:50:31Z"
  },
  {
    "title": "Trump and Musk Double Down on Bogus ‘Stranded’ Starliner Astronauts Narrative",
    "description": "The president and his right-hand man baselessly accused Joe Biden of stranding Boeing astronauts on the ISS for political reasons.",
    "link": "https://gizmodo.com/trump-and-musk-double-down-on-bogus-stranded-starliner-astronauts-narrative-2000566280",
    "timestamp": "2025-02-20T18:50:26Z"
  },
  {
    "title": "Mitch McConnell Won’t Seek Re-Election in 2026, Ending Tenure as Republican Power Broker",
    "description": "McConnell, the longest-serving Senate party leader in U.S. history, chose his 83rd birthday to share his decision.",
    "link": "https://time.com/7259997/sen-mitch-mcconnell-republican-wont-seek-re-election-in-2026/",
    "timestamp": "2025-02-20T18:47:35Z"
  },
  {
    "title": "Dems Seek to Block GOP Attack on Mail-In Voting",
    "description": "The Democratic National Committee argues that the effort to restrict ballot access in Nevada is a sign of Republican plans for a national offensive against mail-in voting",
    "link": "http://www.rollingstone.com/politics/politics-news/dems-seek-block-gop-attack-mail-in-voting-nevada-1235273996/",
    "timestamp": "2025-02-20T18:46:09Z"
  },
  {
    "title": "Ukraine: Zelenskyy wants 'strong ties' to United States",
    "description": "Ukrainian President Volodymyr Zelenskyy met US official Keith Kellogg in Kyiv amid a push to end the war. After the meeting, the Ukrainian leader stressed the importance of good relations with the US. DW has more.",
    "link": "https://www.dw.com/en/ukraine-zelenskyy-wants-strong-ties-to-united-states/live-71678356",
    "timestamp": "2025-02-20T18:46:00Z"
  },
  {
    "title": "Congress seeks white paper on USAID flow to India",
    "description": "The Congress party on Thursday dismissed former U.S. President Donald Trump’s questioning of the $21-million USAID funding for India’s voter turnout, calling his remarks \"nonsensical.\" Trump had criticised the funding, which has since been scrapped, accusing …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/congress-seeks-white-paper-on-usaid-flow-to-india/articleshow/118428490.cms",
    "timestamp": "2025-02-20T18:43:57Z"
  },
  {
    "title": "What is Humphrey’s Executor? A look at the 90-year-old Supreme Court decision Trump is targeting",
    "description": "The 1935 case has been critical to the development of the modern U.S. government.",
    "link": "https://www.bostonherald.com/2025/02/20/what-is-humphreys-executor/",
    "timestamp": "2025-02-20T18:42:30Z"
  },
  {
    "title": "Trump admin to press ahead with Amazon, Meta antitrust cases",
    "description": "Questions lingered on whether the Trump would continue with the cases, given the new proximity between President and tech bosses.\nThe post Trump admin to press ahead with Amazon, Meta antitrust cases appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/trump-admin-to-press-ahead-with-amazon-meta-antitrust-cases/article",
    "timestamp": "2025-02-20T18:42:00Z"
  },
  {
    "title": "EU trade chief says tariff reciprocity 'must work for both' bloc and US",
    "description": "WASHINGTON: EU trade chief Maros Sefcovic said Thursday (Feb 20) that reciprocity in tariffs should apply to both the bloc and Washington, after talks with his counterparts in US President Donald Trump's administration. With the",
    "link": "https://www.channelnewsasia.com/world/eu-trade-chief-says-tariff-reciprocity-must-work-both-bloc-and-us-4950426",
    "timestamp": "2025-02-20T18:39:53Z"
  },
  {
    "title": "'Heartburn to the White House': Expert claims aides in panic over economy failures",
    "description": "The majority of Americans are unhappy with President Donald Trump's first month in office — especially his efforts to bring down food prices, according to a new CNN poll.Trump campaigned to make groceries more affordable \"on day one\" of his presidency, and sa…",
    "link": "https://www.rawstory.com/heartburn-to-the-white-house/",
    "timestamp": "2025-02-20T18:38:41Z"
  },
  {
    "title": "Donald Jessica Trump (PBUH) did six unhinged things in the last 24 hours. Sure, that sounds kinda low, but remember that he's being judged on a curve that's pointing straight up right now [Murica]",
    "description": "Donald Jessica Trump (PBUH) did six unhinged things in the last 24 hours. Sure, that sounds kinda low, but remember that he's being judged on a curve that's pointing straight up right now",
    "link": "https://www.fark.com/comments/13569370/Donald-Jessica-Trump-PBUH-did-six-unhinged-things-in-last-24-hours-Sure-that-sounds-kinda-low-but-remember-that-hes-being-judged-on-a-curve-thats-pointing-straight-up-right-now",
    "timestamp": "2025-02-20T18:38:34Z"
  },
  {
    "title": "Over-the-top martial arts manga spoofs Donald Trump, Elon Musk",
    "description": "The latest installment of Baki Rahen, the sixth and ongoing manga series in Keisuke Itagaki’s long-running Baki the Grappler franchise, features cameos by two characters, “Trunp” and “Elom,” who are very obviously based on U.S. president Donald Trump and guy …",
    "link": "https://www.polygon.com/manga/526484/baki-grappler-rahen-donald-trump-elon-musk-parody",
    "timestamp": "2025-02-20T18:37:51Z"
  },
  {
    "title": "Top Republican right-winger Mitch McConnell announces leaving U.S. Senate",
    "description": "Mitch McConnell, the powerful Republican lawmaker who was instrumental in steering the current U.S. shift to the political right but had a tempestuous relationship with Donald Trump, announced Thursday he will step down from the Senate.At 83 and in increasing…",
    "link": "https://www.rawstory.com/top-republican-right-winger-mitch-mcconnell-announces-leaving-us-senate/",
    "timestamp": "2025-02-20T18:35:29Z"
  },
  {
    "title": "Vance Proclaims Trump Will Be the 'President of Peace' as the President Faces Continued Backlash for Calling Zelensky a 'Dictator'",
    "description": "Vice President JD Vance defended Trump as the \"president of peace\" amid bipartisan backlash over Trump's claim that Ukrainian President Volodymyr Zelensky is a \"dictator.\"",
    "link": "https://www.ibtimes.com/vance-proclaims-trump-will-president-peace-president-faces-continued-backlash-calling-3764486",
    "timestamp": "2025-02-20T18:32:15Z"
  },
  {
    "title": "How Mexico’s president has kept Trump at bay — for now",
    "description": "Her steady hand has calmed nervous markets and boosted her popularity at home.",
    "link": "https://www.bostonherald.com/2025/02/20/mexico-president/",
    "timestamp": "2025-02-20T18:30:53Z"
  },
  {
    "title": "One month into Trump’s second term, many feel buyers’ remorse",
    "description": "As we pause at the one-month mark, the question isn’t whether Donald Trump is engaging in maximalist radicalism. The question is whether it’s working.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/one-month-trumps-second-term-many-feel-buyers-remorse-rcna193009",
    "timestamp": "2025-02-20T18:29:27Z"
  },
  {
    "title": "Trump’s cuts to federal wildfire crews could have ‘scary’ consequences",
    "description": "States, tribes and fire chiefs are preparing for a fire season with minimal federal support.",
    "link": "https://www.bostonherald.com/2025/02/20/trumps-cuts-to-federal-wildfire-crews-could-have-scary-consequences/",
    "timestamp": "2025-02-20T18:28:56Z"
  },
  {
    "title": "WATCH LIVE: Trump participates in White House Black History Month celebration",
    "description": "With Thursday's event, Trump is preserving a tradition at the same time his far-reaching executive order ending diversity, equity and inclusion programs in the federal government is disrupting its observance elsewhere.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-participates-in-white-house-black-history-month-celebration",
    "timestamp": "2025-02-20T18:24:43Z"
  },
  {
    "title": "DOGE: Feds Spent $40 Billion on 4.6 Million Credit Cards in FY2024",
    "description": "The Department of Government Efficiency (DOGE) is working to \"simplify\" the federal government's credit card program — which spent nearly $40 billion in Fiscal Year 2024 — announcing they will \"report back\" in one week after working to \"reduce admin costs.\"\nT…",
    "link": "https://www.breitbart.com/economy/2025/02/20/doge-feds-spent-40-billion-on-4-6-million-credit-cards-in-fy2024/",
    "timestamp": "2025-02-20T18:24:38Z"
  },
  {
    "title": "Everyone Who’s Resigned From the Trump Administration in Protest",
    "description": "Several prominent government officials have decided to resign from the Trump Administration after thousands of federal workers were fired.",
    "link": "https://time.com/7259962/trump-administration-officials-resign/",
    "timestamp": "2025-02-20T18:24:28Z"
  },
  {
    "title": "Stablecoin Legislation Could Unleash 1,000 Tether and USDC Rivals, Expert Says",
    "description": "A federal framework would embolden countless companies to dive into the stablecoin market, according to Chronicle Labs founder Niklas Kunkel.",
    "link": "https://decrypt.co/307022/stablecoin-legislation-could-unleash-1000-new-coins",
    "timestamp": "2025-02-20T18:24:21Z"
  },
  {
    "title": "Trump’s Next Planned Cuts Guarantee Disaster—Literally",
    "description": "Donald Trump is taking aim at a government agency that helps the U.S. recover from natural disasters. \r\nThe New York Times reports that the Trump administration plans to cut the Office of Community Planning and Development, part of the Department of Housing a…",
    "link": "https://newrepublic.com/post/191767/trump-cuts-disaster-red-states-recovery-hud",
    "timestamp": "2025-02-20T18:24:16Z"
  },
  {
    "title": "US envoy Kellogg, Zelenskyy talk in Kyiv",
    "description": "U.S. envoy Keith Kellogg met in Kyiv Thursday with Ukrainian President Volodymyr Zelenskyy, but there was no immediate word on whether they had eased U.S.-Ukrainian relations after U.S. President Donald Trump and Zelenskyy traded barbs this week over Russia’s…",
    "link": "https://www.voanews.com/a/us-envoy-kellogg-zelenskyy-talk-in-kyiv/7982134.html",
    "timestamp": "2025-02-20T18:23:34Z"
  },
  {
    "title": "Mexico to reform constitution in wake of US terrorism designations",
    "description": "There are worries it's a precursor to U.S. military intervention on Mexican territory.",
    "link": "https://www.bostonherald.com/2025/02/20/mexico-us-constitutional-reforms/",
    "timestamp": "2025-02-20T18:23:17Z"
  },
  {
    "title": "CBS Wants Trump's Personal Financial Info If Lawsuit Moves To Discovery",
    "description": "Trump wants $20 billion in damages — more than double the value of CBS's parent company.",
    "link": "https://www.huffpost.com/entry/cbs-60-minutes-lawsuit-donald-trump_n_67b75988e4b04144c748a2af",
    "timestamp": "2025-02-20T18:22:31Z"
  },
  {
    "title": "Musk’s Coup at the Treasury Has Been Ruled Illegal. Will That Stop Him?",
    "description": "An unelected IT task force is taking over the controls of government with no legal authority, putting us all at risk.",
    "link": "https://truthout.org/articles/musks-coup-at-the-treasury-has-been-ruled-illegal-will-that-stop-him/",
    "timestamp": "2025-02-20T18:22:04Z"
  },
  {
    "title": "Leland Vittert Confronts Byron Donalds Over Trump ‘Parroting’ Russia: ‘Exactly the Same Things That Vladimir Putin Says!’",
    "description": "Leland Vittert pressed Byron Donalds over his defense of Donald Trump's recent controversial remarks about the Russia-Ukraine war.\nThe post Leland Vittert Confronts Byron Donalds Over Trump ‘Parroting’ Russia: ‘Exactly the Same Things That Vladimir Putin Says…",
    "link": "https://www.mediaite.com/tv/leland-vittert-confronts-byron-donalds-over-trump-parroting-russia-exactly-the-same-things-that-vladimir-putin-says/",
    "timestamp": "2025-02-20T18:20:30Z"
  },
  {
    "title": "Trump Repeats Claim That Biden Sent Condoms Worth $100 Million To Hamas",
    "description": "Trump said this was just one example of wasteful US spending and even alleged that they were being used as makeshift bomb balloons.",
    "link": "https://www.ndtv.com/world-news/donald-trump-elon-musk-gaza-usaid-trump-repeats-debunked-claim-that-biden-sent-condoms-worth-100-million-to-hamas-7753793",
    "timestamp": "2025-02-20T18:20:09Z"
  },
  {
    "title": "Ottawa designates cartels and street gangs as terrorist groups, fulfilling promise to Trump",
    "description": "The federal government designated seven criminal organizations — including cartels and street gangs — as terrorists on Thursday, delivering on a promise made to U.S. President Donald Trump in hopes of staving off economically devastating tariffs.",
    "link": "https://www.cbc.ca/news/politics/mexican-cartels-terrorists-list-1.7463758",
    "timestamp": "2025-02-20T18:19:54Z"
  },
  {
    "title": "Former NFL punter Chris Kluwe arrested for protesting California city appearing to honor Donald Trump",
    "description": "Kluwe was arrested on a charge of disturbing an assembly for criticizing Trump's 'MAGA' movement",
    "link": "https://www.cbssports.com/nfl/news/former-nfl-punter-chris-kluwe-arrested-for-protesting-california-city-appearing-to-honor-donald-trump/",
    "timestamp": "2025-02-20T18:18:47Z"
  },
  {
    "title": "EU must negotiate with US to avoid ‘the worst’ including job losses, says Paschal Donohoe amid Trump trade war",
    "description": "Job losses and higher prices are all part of “the worst” that could happen here if there is a reduction in trading between the US and EU, Finance Minister Paschal Donohoe has said.",
    "link": "https://www.independent.ie/irish-news/politics/eu-must-negotiate-with-us-to-avoid-the-worst-including-job-losses-says-paschal-donohoe-amid-trump-trade-war/a1105292788.html",
    "timestamp": "2025-02-20T18:18:46Z"
  },
  {
    "title": "Bianca Del Rio will emcee Equality PAC’s National Pride Gala during WorldPride D.C. (exclusive)",
    "description": "Drag superstar Bianca Del Rio will serve as the special guest emcee for Equality PAC’s National Pride Gala reception and dinner on Wednesday, June 4, at the Mellon Auditorium in Washington, D.C., The Advocate has exclusively learned.",
    "link": "https://www.advocate.com/politics/bianca-del-rio-equality-pac",
    "timestamp": "2025-02-20T18:18:46Z"
  },
  {
    "title": "India US Trade Pact: Ministry-level talks likely to take place soon",
    "description": "India has started preparing for its first bilateral trade agreement (BTA) talks with the US, involving sector-specific consultations. The commerce ministry aims to understand inter-ministerial interests and ensure alignment with potential tariff concessions a…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-pact-ministry-level-talks-likely-to-take-place-soon/articleshow/118427985.cms",
    "timestamp": "2025-02-20T18:18:22Z"
  },
  {
    "title": "‘I’m considered a national hero’: A month ago Trump pardoned these J6ers. Now CPAC says they’re not welcome",
    "description": "The Conservative Political Action Conference (CPAC) kicks off this week. This year, the event is infused with triumph over President Donald Trump's victory. Vice President J.D. Vance spoke this morning and Trump is slated to close the event on Saturday night.…",
    "link": "https://www.dailydot.com/debug/cpac-kicks-out-capitol-rioters-tarrio-rhodes/",
    "timestamp": "2025-02-20T18:18:01Z"
  },
  {
    "title": "Mitch McConnell announces he will not run for re-election",
    "description": "The Republican senator has spent 40 years in Congress, but said he has \"unfinished business\" before he goes.",
    "link": "https://www.bbc.com/news/articles/cp8le2p353zo",
    "timestamp": "2025-02-20T18:17:28Z"
  },
  {
    "title": "Trump backs direct payments to Americans from savings generated by DOGE - NewsBreak",
    "description": "President Trump backed an idea pitched to Elon Musk of sending checks of up to $5,000 to Americans if DOGE is able to cut federal government costs.",
    "link": "https://www.newsbreak.com/share/3821562477178-trump-backs-direct-payments-to-americans-from-savings-generated-by-doge?s=a2&share_destination_id=MTkxODYyMzA0LTE3NDAwNzUzMjQ4MzA%3D&pd=0Cz29IAZ&hl=en_US&send_time=1740075324&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v3",
    "timestamp": "2025-02-20T18:17:18Z"
  },
  {
    "title": "Trump’s IVF Executive Order Is a Glorified Press Release",
    "description": "President Trump’s new executive order to expand access to IVF  doesn’t do much of anything, and certainly doesn’t lower costs or compel insurance coverage.",
    "link": "http://www.thecut.com/article/what-you-need-to-know-about-trumps-ivf-executive-order.html",
    "timestamp": "2025-02-20T18:15:58Z"
  },
  {
    "title": "Western leaders back Zelensky amid war of words with Trump",
    "description": "The US president has called the Ukrainian leader a “dictator” over Zelensky’s refusal to hold elections amid martial law Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613076-western-leaders-back-zelensky-trump-spat/",
    "timestamp": "2025-02-20T18:15:54Z"
  },
  {
    "title": "President Donald Trump Implies He’s A King For Declaring End To Congestion Pricing, Social Media Reacts",
    "description": "President Donald Trump took to his Truth Social media program to boast about ending New York's congestion pricing, framing himself as a king.",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-king-social-media-reactions/",
    "timestamp": "2025-02-20T18:15:33Z"
  },
  {
    "title": "What's next for NYC Mayor Eric Adams as a judge weighs dismissing his corruption case?",
    "description": "New York City Mayor Eric Adams is in a state of legal and political purgatory",
    "link": "https://abcnews.go.com/Politics/wireStory/nyc-mayor-eric-adams-judge-weighs-dismissing-corruption-119011544",
    "timestamp": "2025-02-20T18:14:24Z"
  },
  {
    "title": "Hochul won’t call on Mayor Adams to resign — yet — but wants to increase oversight, source says",
    "description": "Hochul plans to pen ethics legislation meant to give the state more oversight over the mayor.",
    "link": "https://nypost.com/2025/02/20/us-news/hochul-considering-beefing-up-state-oversight-of-mayor-eric-adams-sources-say/",
    "timestamp": "2025-02-20T18:13:17Z"
  },
  {
    "title": "Trump is 'not happy' with Boeing over Air Force One delays, but airlines are growing upbeat",
    "description": "President Trump has expressed frustration about delays of new Air Force One aircraft from Boeing.",
    "link": "https://www.cnbc.com/2025/02/20/trump-boeing-air-force-one-delays.html",
    "timestamp": "2025-02-20T18:12:17Z"
  },
  {
    "title": "'I Was Wrong to Withhold': Rand Paul Praises Trump and Cabinet, Offers 'Admittedly a Little Tardy' Endorsement",
    "description": "Sen. Rand Paul (R-KY) on Thursday offered his \"admittedly a little tardy\" endorsement of President Donald Trump and his cabinet.\nThe post ‘I Was Wrong to Withhold’: Rand Paul Praises Trump and Cabinet, Offers ‘Admittedly a Little Tardy’ Endorsement appeared f…",
    "link": "https://www.breitbart.com/politics/2025/02/20/i-was-wrong-withhold-rand-paul-praises-trump-and-cabinet-offers-admittedly-little-tardy-endorsement/",
    "timestamp": "2025-02-20T18:11:58Z"
  },
  {
    "title": "US Senate advances Kash Patel’s nomination as FBI director for confirmation vote",
    "description": "The Senate has voted 51-47 to end debate over Kash Patel's nomination as the FBI director. The final confirmation vote is set to take place later on Thursday afternoon. The members of the Senate Judiciary Committee had, earlier this month, voted 12 to 10, to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-senate-advances-kash-patels-nomination-as-fbi-director-for-confirmation-vote/articleshow/118427813.cms",
    "timestamp": "2025-02-20T18:11:43Z"
  },
  {
    "title": "Trump calls Team USA hours before 4 Nations Face-Off final vs. Canada as he won’t attend game",
    "description": "President Trump will not be in attendance at TD Garden for Team USA's match against Canada, but he called the Americans on Thursday morning to wish them luck ahead of the 4 Nations championship game.",
    "link": "https://nypost.com/2025/02/20/sports/trump-calls-team-usa-hours-before-4-nations-face-off-final-vs-canada/",
    "timestamp": "2025-02-20T18:10:43Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing as Trump calls Ukrainian president Zelenskyy a ‘dictator’",
    "description": "A news conference that was planned to follow talks between Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump's Ukraine envoy has been canceled.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-briefing-as-trump-calls-ukrainian-president-zelenskyy-a-dictator",
    "timestamp": "2025-02-20T18:09:30Z"
  },
  {
    "title": "Elon Musk Hits Astronaut With Shocking Slur After Being Slammed Over ‘Lie’",
    "description": "Elon Musk called a Danish astronaut “fully ret---ed” in an argument on the billionaire’s social media platform. Musk’s used the term, which many in the...",
    "link": "https://www.thedailybeast.com/elon-musk-calls-astronaut-andreas-morgensen-fully-retarded-after-being-slammed-over-lie/",
    "timestamp": "2025-02-20T18:09:00Z"
  },
  {
    "title": "When Republicans Said They Wanted Federal Workers Fired, They Didn't Mean Jesse Watters's Friends!",
    "description": "Leopards, faces, etc.",
    "link": "https://www.wonkette.com/p/when-republicans-said-they-wanted",
    "timestamp": "2025-02-20T18:07:38Z"
  },
  {
    "title": "Tiger Woods joins another White House meeting as PGA Tour moves closer to Saudi deal",
    "description": "Tiger Woods and PGA Tour Commissioner Jay Monahan are part of a White House meeting that signals more progress in getting a deal done with the Saudi backers of LIV Golf",
    "link": "https://abcnews.go.com/Politics/wireStory/tiger-woods-joins-white-house-meeting-pga-tour-119012000",
    "timestamp": "2025-02-20T18:06:41Z"
  },
  {
    "title": "Trump Launches Large-Scale Offensive Against Media Bias, Igniting Hyperbolic Freakout",
    "description": "The establishment media's grip on public opinion is under threat after the Trump administration launched a large-scale investigation of the industry. \nThe post Trump Launches Large-Scale Offensive Against Media Bias, Igniting Hyperbolic Freakout appeared firs…",
    "link": "https://www.breitbart.com/the-media/2025/02/20/trump-launches-large-scale-offensive-against-media-bias-igniting-hyperbolic-freakout/",
    "timestamp": "2025-02-20T18:05:02Z"
  },
  {
    "title": "Royal Caribbean and other cruise stocks are sinking after a top Trump official promised to make them pay",
    "description": "Cruise operator stocks are sinking Thursday after a top U.S. official pledged to force them to pay taxes. Read more...",
    "link": "https://qz.com/cruise-line-taxes-trump-commerce-lutnick-carnival-royal-1851765677",
    "timestamp": "2025-02-20T18:05:00Z"
  },
  {
    "title": "Trump targets taxpayers’ money used to ‘incentivize or support’ illegals",
    "description": "Nation's resources are for the 'interests of American citizens …'",
    "link": "https://www.wnd.com/2025/02/trump-targets-taxpayers-money-used-to-incentivize-or-support-illegals/",
    "timestamp": "2025-02-20T18:03:59Z"
  },
  {
    "title": "Donald Trump’s “Concepts” of a Healthcare Plan: Make His Voters Pay",
    "description": "A mere day after promising to safeguard Medicaid, the president endorsed a budget plan that would slash the program, presumably to subsidize $4.5 trillion in tax breaks.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-healthcare-plan-medicaid",
    "timestamp": "2025-02-20T18:03:56Z"
  },
  {
    "title": "US switches stance on Ukraine war, seeking $500bn in payback",
    "description": "A war of words has broken out between Trump and Zelenskyy, while Europe feels the US is no longer a dependable ally.",
    "link": "https://www.aljazeera.com/news/2025/2/20/us-switches-stance-on-ukraine-war-seeking-500bn-in-payback",
    "timestamp": "2025-02-20T18:03:23Z"
  },
  {
    "title": "Bessent: Everything President Donald Trump Is Doing Is 'Disinflationary'",
    "description": "Treasury Secretary Scott Bessent said Thursday on Bloomberg Television's \"Bloomberg Surveillance\" that everything President Donald Trump was doing is \"disinflationary.\"\nThe post Bessent: Everything President Donald Trump Is Doing Is ‘Disinflationary’ appeared…",
    "link": "https://www.breitbart.com/clips/2025/02/20/bessent-everything-president-donald-trump-is-doing-is-disinflationary/",
    "timestamp": "2025-02-20T18:02:13Z"
  },
  {
    "title": "Trump’s art of the deal horrifies Ukraine and its allies",
    "description": "The ‘great negotiator’ Trump appears to have conceded several key points to Putin before the talks proper have even started.",
    "link": "https://theconversation.com/trumps-art-of-the-deal-horrifies-ukraine-and-its-allies-250461",
    "timestamp": "2025-02-20T18:01:52Z"
  },
  {
    "title": "Don't let them sue: What private-equity bosses want from Trump on 401(k)s",
    "description": "Trump opened the door for private equity to tap 401(k)s, and now private-equity bosses want legal protection. Here's what that could mean for savers.",
    "link": "https://www.businessinsider.com/trump-401k-fees-lawsuits-private-equity-apollo-kkr-2025-2",
    "timestamp": "2025-02-20T18:01:14Z"
  },
  {
    "title": "U.S. Intelligence Reports Heightened Risk of Israeli Strike on Iran",
    "description": "U.S. intelligence has concluded that the odds of an Israeli attack on Iran's nuclear program in the next few months are high, according to major American media, but the jury is out on whether Israel can destroy its archfoe's nuclear facilities on its own. Ira…",
    "link": "https://oilprice.com/Geopolitics/International/US-Intelligence-Reports-Heightened-Risk-of-Israeli-Strike-on-Iran.html",
    "timestamp": "2025-02-20T18:00:00Z"
  },
  {
    "title": "The US has a long history of meddling in Latin America. What’s different about Donald Trump’s approach?",
    "description": "Donald Trump’s threat to take back control of the Panama Canal harks back to decades of US intervention in Latin America.",
    "link": "https://theconversation.com/the-us-has-a-long-history-of-meddling-in-latin-america-whats-different-about-donald-trumps-approach-249678",
    "timestamp": "2025-02-20T17:59:58Z"
  },
  {
    "title": "Vance Urges CPAC Audience to Persuade Others About Sanctity of Unborn Life",
    "description": "Vice President JD Vance urged pro-life Americans to persuade their fellow citizens about the sanctity of unborn life. Vance’s speech, on the one-month mark of... Read More\nThe post Vance Urges CPAC Audience to Persuade Others About Sanctity of Unborn Life app…",
    "link": "https://www.dailysignal.com/2025/02/20/vance-urges-cpac-audience-persuade-others-about-sanctity-unborn-life/",
    "timestamp": "2025-02-20T17:59:09Z"
  },
  {
    "title": "Venezuelans sue in US to challenge Trump's end to deportation protections",
    "description": "(Reuters) - A group of Venezuelans filed a U.S. lawsuit challenging the Trump administration's decision to end temporary protections against deportation for hundreds of thousands of immigrants from Venezuela living in the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/21/venezuelans-sue-in-us-to-challenge-trump039s-end-to-deportation-protections",
    "timestamp": "2025-02-20T17:59:00Z"
  },
  {
    "title": "Deeply Unfunny Man JD Vance Says Telling Jokes Makes Him a Man",
    "description": "JD Vance has weighed in on what he thinks masculinity is, and it’s one big joke. \r\nDuring an interview to kick off the Conservative Political Action Conference in Washington Thursday, Vance pontificated over what makes him a man. \r\n“I think about like, ‘What …",
    "link": "https://newrepublic.com/post/191769/jd-vance-define-masculinity-jokes",
    "timestamp": "2025-02-20T17:58:36Z"
  },
  {
    "title": "IOC presidential candidate Seb Coe says Donald Trump ‘right in principle’ to ban trans athletes from women’s sport",
    "description": "US president Donald Trump is right in principle to seek the exclusion of transgender athletes from women's sport, International Olympic Committee presidential candidate Sebastian Coe has said.",
    "link": "https://www.independent.ie/sport/womens-sport/ioc-presidential-candidate-seb-coe-says-donald-trump-right-in-principle-to-ban-trans-athletes-from-womens-sport/a1000636821.html",
    "timestamp": "2025-02-20T17:58:12Z"
  },
  {
    "title": "Ukraine’s natural resources are at centre stage in the ongoing war, and will likely remain there",
    "description": "Ukraine’s mineral riches have always had strategic importance in the Russia-Ukraine war — first, to Russia, and now to the United States under President Donald Trump.",
    "link": "https://theconversation.com/ukraines-natural-resources-are-at-centre-stage-in-the-ongoing-war-and-will-likely-remain-there-249254",
    "timestamp": "2025-02-20T17:56:02Z"
  },
  {
    "title": "Fox’s Maria Bartiromo Hits Trump-Musk Plan to Send Americans Checks From DOGE Savings: ‘Huge Amount of Debt’",
    "description": "Maria Bartiromo voiced her opposition to a plan floated by Donald Trump and Elon Musk to pay out a \"dividend\" from spending cuts to taxpayers.\nThe post Fox’s Maria Bartiromo Hits Trump-Musk Plan to Send Americans Checks From DOGE Savings: ‘Huge Amount of Debt…",
    "link": "https://www.mediaite.com/tv/foxs-maria-bartiromo-hits-trump-musk-plan-to-cut-americans-checks-from-doge-dividend-sounds-nice-but-better-to-pay-down-debt/",
    "timestamp": "2025-02-20T17:54:30Z"
  }
]