[
  {
    "title": "US Senate fails to curb Trump’s power to strike drug cartels",
    "description": "Democrats say President Donald Trump does not have the power to use force without the approval of Congress.",
    "link": "https://www.aljazeera.com/news/2025/10/9/us-senate-fails-to-curb-trumps-power-to-strike-drug-cartels",
    "timestamp": "2025-10-09T07:08:06Z"
  },
  {
    "title": "North Korea expected to stage military parade as party turns 80",
    "description": "Seoul (AFP) Oct 9, 2025\n\n\n North Korea is set to host top officials from China and Russia to mark 80 years under the ruling Workers' Party, a celebration that is expected to feature a massive military parade showcasing its latest advanced weaponry. \n\nPlanning…",
    "link": "https://www.spacewar.com/reports/North_Korea_expected_to_stage_military_parade_as_party_turns_80_999.html",
    "timestamp": "2025-10-09T07:02:55Z"
  },
  {
    "title": "Trump Says Israel And Hamas Have Agreed To First Phase Of Peace Deal—IDF Readies Partial Troop Withdrawal",
    "description": "President Donald Trump suggested he may travel to Gaza.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/09/trump-says-israel-and-hamas-have-agreed-to-first-phase-of-peace-deal-idf-readies-partial-troop-withdrawal/",
    "timestamp": "2025-10-09T07:02:26Z"
  },
  {
    "title": "Palestinians in war-ravaged Gaza celebrate ceasefire news, joy in Tel Aviv",
    "description": "Relative calm returns to Gaza for the first time in months, as Palestinians hope first phase of deal will end the war.",
    "link": "https://www.aljazeera.com/news/2025/10/9/palestinians-in-war-ravaged-gaza-celebrate-ceasefire-news-joy-in-tel-aviv",
    "timestamp": "2025-10-09T07:01:37Z"
  },
  {
    "title": "Capitol agenda: Trump muddies the GOP shutdown message (Mia McCarthy/Politico)",
    "description": "Mia McCarthy / Politico:\nCapitol agenda: Trump muddies the GOP shutdown message  —  One week into the shutdown, Republicans are trying to stay on message — but President Donald Trump is making that difficult.  Speaker Mike Johnson and Senate Majority Leader J…",
    "link": "https://www.memeorandum.com/251009/p5",
    "timestamp": "2025-10-09T07:00:01Z"
  },
  {
    "title": "The Global Energy Transition Rolls On—Even As The U.S. Hits Reverse",
    "description": "Policy reversals in the U.S. have created a barrage of headlines which might create the impression that the global energy transition is reversing - this is not the case.",
    "link": "https://www.forbes.com/sites/sverrealvik/2025/10/09/the-global-energy-transition-rolls-on-even-as-the-us-hits-reverse/",
    "timestamp": "2025-10-09T06:58:47Z"
  },
  {
    "title": "Thursday's papers: Why is Orpo going to DC? a teacher's porn scandal, and late check-outs for geese",
    "description": "There is a good deal of speculation in Finland that the White House meeting could see a major business deal unfold.",
    "link": "https://yle.fi/a/74-20187459",
    "timestamp": "2025-10-09T06:54:53Z"
  },
  {
    "title": "Erdoğan welcomes Gaza ceasefire, vows Türkiye will monitor implementation",
    "description": "President Recep Tayyip Erdoğan on Thursday welcomed the ceasefire reached between Hamas and Israel following talks in Sharm El-Sheikh, saying Ankara would closely monitor its implementation.",
    "link": "https://www.hurriyetdailynews.com/erdogan-welcomes-gaza-ceasefire-vows-turkiye-will-monitor-implementation-214482",
    "timestamp": "2025-10-09T06:53:00Z"
  },
  {
    "title": null,
    "description": "The Ceasefire Illusion: Why the World Keeps Mistaking Control for Peace They called it a ceasefire.The headlines declared history.Flags fluttered. Cameras framed relief as redemption. In Gaza, the smoke thinned but didn’t clear. The same drones hovered overhe…",
    "link": "https://thecuriousbrain.com/?p=148910",
    "timestamp": "2025-10-09T06:48:42Z"
  },
  {
    "title": "Ceasefire deal a major breakthrough, but war not over yet",
    "description": "The agreement of the first-phase of the peace plan for Gaza, announced by US President Donald Trump, is a big moment.",
    "link": "https://www.bbc.com/news/articles/c99gzzd9yvzo",
    "timestamp": "2025-10-09T06:47:48Z"
  },
  {
    "title": "World reacts to Gaza ceasefire deal announced by Trump",
    "description": "Leaders and groups around the world celebrate negotiators signing off on first phase of the Gaza ceasefire agreement.",
    "link": "https://www.aljazeera.com/news/2025/10/9/world-reacts-to-gaza-ceasefire-deal-announced-by-trump",
    "timestamp": "2025-10-09T06:44:00Z"
  },
  {
    "title": "Netanyahu and Trump hail the “historic achievement” of the Gaza agreement",
    "description": "Israeli Prime Minister invites US President to address Knesset - Tel Aviv expects hostages to start being released on Saturday\nThe post Netanyahu and Trump hail the “historic achievement” of the Gaza agreement appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/09/netanyahu-and-trump-hail-the-historic-achievement-of-the-gaza-agreement/",
    "timestamp": "2025-10-09T06:40:51Z"
  },
  {
    "title": "Watch: Hostage families celebrate after Gaza breakthrough",
    "description": "Relatives of Israeli hostages celebrated in Tel Aviv after the announcement that Israel and Hamas had signed the first phase of a peace deal.",
    "link": "https://www.bbc.co.uk/news/videos/c5y4nnpvqw2o",
    "timestamp": "2025-10-09T06:38:11Z"
  },
  {
    "title": "Taiwan says anti-drone measures will be a top priority in defense against China",
    "description": "Taiwan's Ministry of National Defense has issued a report saying it is training soldiers to shoot down drones and actively looking to procure new anti-drone weapons systems, which comes in response to Chinese drone incursions",
    "link": "https://abcnews.go.com/International/wireStory/taiwan-anti-drone-measures-top-priority-defense-china-126354652",
    "timestamp": "2025-10-09T06:37:39Z"
  },
  {
    "title": "Israeli hostages may be released as early as Saturday after Gaza ceasefire deal",
    "description": "A Hamas source said the living hostages would be handed over within 72 hours of the Israeli government approving the deal.",
    "link": "https://www.channelnewsasia.com/world/israel-hostages-gaza-ceasefire-release-saturday-trump-hamas-5391441",
    "timestamp": "2025-10-09T06:36:19Z"
  },
  {
    "title": "Trump Goes Viral With 'Extremely Hilarious If Not So Extremely Dangerous' Habeas Corpus Answer",
    "description": "“President Non Compos Mentis has no idea what the writ of habeas corpus is,” conservative attorney George Conway mocked Donald Trump.",
    "link": "https://www.huffpost.com/entry/donald-trump-habeas-corpus-moment_n_68e74d7de4b0b4458cb6f566",
    "timestamp": "2025-10-09T06:33:38Z"
  },
  {
    "title": "Ben & Jerry's Cohen expects corporate conflict to go on",
    "description": "Ice cream brand Ben & Jerry's is set to switch corporate owners next month, but for Ben Cohen, the counterculture brand's co-founder, it is a case of meet the new boss, same as the old boss.",
    "link": "https://www.rte.ie/news/business/2025/1009/1537592-ben-jerrys-cohen-expects-corporate-conflict-to-go-on/",
    "timestamp": "2025-10-09T06:33:09Z"
  },
  {
    "title": "Financial markets full of gamblers placing clueless bets put entire economies at risk",
    "description": "Retail investors are embracing high-risk trades, from meme stocks to leveraged ETFs. This tidal wave of speculation could crash, sending ripples across the global economy. As apps ease trading and the young inherit vast sums, is the next financial crisis taki…",
    "link": "https://www.livemint.com/opinion/online-views/retail-investor-india-sebi-speculative-trading-global-financial-crisis-nasdaq-etf-nifty-50-options-stock-market-bse-nse-11759919033775.html",
    "timestamp": "2025-10-09T06:30:16Z"
  },
  {
    "title": "CNBC Daily Open: It's AI's world and the Fed's just living in it",
    "description": "AI stocks such as Nvidia are now masters of the market narrative, driving record highs across the S&P 500 and Nasdaq.",
    "link": "https://www.cnbc.com/2025/10/09/cnbc-daily-open-its-ais-world-and-the-feds-just-living-in-it.html",
    "timestamp": "2025-10-09T06:30:01Z"
  },
  {
    "title": "Trump reveals when hostages will be released as he announces 'peace plan' between Israel and Hamas",
    "description": "Donald Trump told families of Israeli hostages they will see them soon as he announced a peace plan between Israel and Hamas",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-israel-palestine-peace-deal-hostages-release-821960-20251009",
    "timestamp": "2025-10-09T06:28:41Z"
  },
  {
    "title": "China outlines more controls on exports of rare earths and technology",
    "description": "China has outlined new curbs on exports of rare earths and related technologies, extending controls over the use of the elements critical for many products",
    "link": "https://abcnews.go.com/International/wireStory/china-outlines-controls-exports-rare-earths-technology-126354562",
    "timestamp": "2025-10-09T06:19:42Z"
  },
  {
    "title": "Netanyahu government to approve Israel-Hamas deal in Gaza: Here's what happens next",
    "description": "The Israeli army will begin moving to the first withdrawal line within 24 hours, and all living hostages are expected to be released within 72 hours",
    "link": "https://www.haaretz.com/israel-news/2025-10-09/ty-article/.premium/netanyahu-government-to-approve-israel-hamas-deal-in-gaza-heres-what-happens-next/00000199-c75b-d7d2-add9-f7fb649a0000",
    "timestamp": "2025-10-09T06:17:16Z"
  },
  {
    "title": "World leaders express hope after Trump says Israel, Hamas agreed to first phase of peace deal",
    "description": "Hamas will release all 20 living hostages in the coming days in exchange for Palestinian prisoners, while the Israeli military will begin a withdrawal from the majority of Gaza",
    "link": "https://www.thehindubusinessline.com/news/world/world-leaders-express-hope-after-trump-says-israel-hamas-agreed-to-first-phase-of-peace-deal/article70142454.ece",
    "timestamp": "2025-10-09T06:17:01Z"
  },
  {
    "title": "Kidnapped soldier's mother: Bring everyone home before Hamas receives anything in exchange",
    "description": "Leah and Simcha Goldin, parents of killed and kidnapped soldier Hadar, urge government to recover all hostages, including their son, before giving anything to Hamas. 'Until he is home, we are still at war.'",
    "link": "https://www.israelnationalnews.com/news/416011",
    "timestamp": "2025-10-09T06:16:31Z"
  },
  {
    "title": "China outlines more controls on exports of rare earths and technology",
    "description": "China has outlined new curbs on exports of rare earths and related technologies, extending controls over the use of the elements critical for many products",
    "link": "https://abcnews.go.com/Technology/wireStory/china-outlines-controls-exports-rare-earths-technology-126354565",
    "timestamp": "2025-10-09T06:14:33Z"
  },
  {
    "title": "Carney: U.S. auto sector needs CUSMA to compete",
    "description": "Prime Minister Mark Carney said North America’s interwoven supply chain makes U.S. auto manufacturers more competitive on costs. Read more.",
    "link": "https://financialpost.com/transportation/autos/us-auto-sector-continental-trade-compete-carney",
    "timestamp": "2025-10-09T06:13:49Z"
  },
  {
    "title": "US Auto Sector Needs Continental Trade to Compete, Carney Says",
    "description": "Canadian Prime Minister Mark Carney pushed back against US President Donald Trump’s protectionism in the auto industry, saying North America’s interwoven supply chain makes US manufacturers more competitive on costs.",
    "link": "https://financialpost.com/pmn/business-pmn/us-auto-sector-needs-continental-trade-to-compete-carney-says",
    "timestamp": "2025-10-09T06:13:49Z"
  },
  {
    "title": "Key moments in the Gaza war",
    "description": "US President Donald Trump says Israel and Hamas have agreed the first phase of a Gaza peace plan after more than two years of war that killed tens of thousands and unleashed a major humanitarian crisis.",
    "link": "https://www.rte.ie/news/middle-east/2025/1009/1537587-gaza-war-key-moments/",
    "timestamp": "2025-10-09T06:12:05Z"
  },
  {
    "title": "Europe mixed premarket with Gaza deal in spotlight",
    "description": "Major European stock indexes were mixed during premarket trading on Thursday after United States President Donald Trump announced that Israel and Hamas agreed to the first stage of his peace plan for ...",
    "link": "https://biztoc.com/x/a56ecf05534e47a2",
    "timestamp": "2025-10-09T06:10:44Z"
  },
  {
    "title": "China outlines more controls on exports of rare earths and technology",
    "description": "HONG KONG (AP) — China outlined new curbs on exports of rare earths and related technologies on Thursday, extending controls over use of the elements critical for many products ahead of a meeting later this month between President Donald Trump and Chinese lea…",
    "link": "https://financialpost.com/pmn/china-outlines-more-controls-on-exports-of-rare-earths-and-technology",
    "timestamp": "2025-10-09T06:09:06Z"
  },
  {
    "title": "China outlines more controls on exports of rare earths and technology",
    "description": "China outlined new curbs on exports of rare earths and related technologies on Thursday, extending controls over use of the elements critical for many...",
    "link": "https://finance.yahoo.com/news/china-outlines-more-controls-exports-060254768.html",
    "timestamp": "2025-10-09T06:02:54Z"
  },
  {
    "title": "What we know about the new Gaza ceasefire deal",
    "description": "US President Donald Trump announced last night that Israel and Hamas have agreed to the first phase of a ceasefire in Gaza, after days of indirect talks in Egypt - here's what we know so far.",
    "link": "https://www.rte.ie/news/middle-east/2025/1009/1537586-gaza-deal-explainer/",
    "timestamp": "2025-10-09T06:02:46Z"
  },
  {
    "title": "The pulse of a city on edge - hundreds protest Trump's plan to deploy troops in Chicago",
    "description": "Hundreds of National Guard troops have set up camp at an army training centre on the outskirts of Chicago. Their presence drew a diverse crowd of protesters to the city centre - their faces lit by phone screens, voices raised and fists raised in defiance.",
    "link": "https://news.sky.com/story/the-pulse-of-a-city-on-edge-hundreds-protest-trumps-plan-to-deploy-troops-in-chicago-13447337",
    "timestamp": "2025-10-09T06:02:00Z"
  },
  {
    "title": "FBI disbands controversial CR-15 squad as reports of political surveillance targeting GOP lawmakers surface",
    "description": "FBI Director Kash Patel disbanded the bureau’s CR-15 public corruption unit and fired several agents following revelations of politically motivated surveillance targeting Republican lawmakers during the Biden administration. Documents show Special Counsel Jac…",
    "link": "https://www.naturalnews.com/2025-10-09-fbi-disbands-controversial-cr-15-corruption-unit.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Trump’s border crackdown reshapes migration flows",
    "description": "Trump’s border crackdown is credited with sharply reducing illegal crossings—and is now prompting migration routes to reroute entirely toward places like Mexico City. Supporters argue this approach doesn’t just deter entry—it changes regional migration logic …",
    "link": "https://www.naturalnews.com/2025-10-09-trump-border-crackdown-reshapes-migration-flows.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Questions emerge over Trumpâ\u0080\u0099s Gaza-Israel peace proposal and its political implications",
    "description": "Netanyahu’s regime operates under a “Satanic death cult” ideology rooted in Ezekiel 38-39 prophecies, inciting global chaos to trigger divine intervention, framing Gaza violence as fabricated ritualistic sacrifices. Gaza bombing campaigns intentionally target…",
    "link": "https://www.naturalnews.com/2025-10-09-questions-gaza-israel-peace-proposal-and-its-political-implications.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Historic Gaza ceasefire agreed as Trump announces hostage release and Israeli withdrawal",
    "description": "President Trump has announced a U.S.-brokered ceasefire agreement between Israel and Hamas, marking a potential end to the two-year conflict. The first phase involves the release of all remaining Israeli hostages and a withdrawal of Israeli troops to an agree…",
    "link": "https://www.naturalnews.com/2025-10-09-gaza-ceasefire-hostage-release-israeli-withdrawal.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Taiwan seeks advanced Patriot missiles amid rising military threats from Beijing",
    "description": "Taiwan is pursuing additional advanced Patriot missile systems (up to 500 interceptors) from the U.S. to counter China’s escalating military threats, including expanded missile bases and ballistic deployments near Taiwan. The PAC-3 MSE interceptors, with doub…",
    "link": "https://www.naturalnews.com/2025-10-09-taiwan-seeks-patriot-missiles-amid-beijing-threats.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Trump moves boldly: Declares Antifa a terror threat, promises crackdown",
    "description": "President Trump has declared Antifa a “foreign terrorist organization,” equating it with groups like ISIS and Al Qaeda. This designation allows for legal and financial sanctions, though legal experts note there’s currently no mechanism in U.S. law for designa…",
    "link": "https://www.naturalnews.com/2025-10-09-trump-moves-boldly-declares-antifa-terror-threat.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "A high-stakes neighborly negotiation between Trump and Carney",
    "description": "President Trump hosted Canadian Prime Minister Mark Carney for trade talks, signaling no immediate deal. The U.S. maintains significant tariffs on Canadian goods, citing border security and economic competition. Trump acknowledged Canada’s improved efforts on…",
    "link": "https://www.naturalnews.com/2025-10-09-high-stakes-neighborly-negotiation-between-trump-carney.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Russia OPPOSES U.S. reclamation of Bagram Air Base in Afghanistan",
    "description": "Russian Foreign Minister Sergey Lavrov warned against any U.S. military re-entry into Afghanistan, calling it “categorically unacceptable” and invoking the Soviet Union’s failed Afghan war as a cautionary tale. U.S. President Trump has publicly demanded the U…",
    "link": "https://www.naturalnews.com/2025-10-09-russia-opposes-us-reclamation-bagram-air-base.html",
    "timestamp": "2025-10-09T06:00:00Z"
  },
  {
    "title": "Elizabeth Warren Reminds Trump He Once Said, 'If There's A Shutdown, I think It Would Be A Tremendously Negative Mark On The President'",
    "description": "Sen. Elizabeth Warren (D-Mass.) said Wednesday that President Donald Trump is the wrong leader for the moment, pointing to Trump's own past comments during earlier shutdown showdowns as evidence that presidents, not Congress, bear ultimate responsibility when…",
    "link": "https://biztoc.com/x/4112aa38b8fcd2fa",
    "timestamp": "2025-10-09T05:59:06Z"
  },
  {
    "title": "Trump Shares When Both Dead and Alive Hamas Hostages Are Expected To Be Released",
    "description": "Trump said the hostages, both dead and alive, held by Hamas since Oct. 7, 2023, are expected to be released by Monday.",
    "link": "https://dailycaller.com/2025/10/09/trump-shares-hostages-alive-deceased-released-hamas-israel-war/",
    "timestamp": "2025-10-09T05:58:51Z"
  },
  {
    "title": "Israel and Hamas peace plan agreement is monumental but questions remain",
    "description": "The announcement that Israel and Hamas have agreed to phase one of a peace deal in Gaza is significant. But despite the celebrations, the end of the war is still far from certain, writes Matthew Doran.",
    "link": "https://www.abc.net.au/news/2025-10-09/question-marks-on-israel-hamas-peace-agreement-details/105870198",
    "timestamp": "2025-10-09T05:54:54Z"
  },
  {
    "title": "UN gutting peacekeeper force due to lack of US funding – media",
    "description": "Over 10,000 personnel will have to be sent home across nine missions globally, according to Reuters and AP Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626115-un-gutting-peacekeeper-force-us-funding/",
    "timestamp": "2025-10-09T05:54:07Z"
  },
  {
    "title": "Ukraine says Russian strikes kill three",
    "description": "Russian strikes killed three people and wounded two in Ukraine's northeastern Sumy region, its military administration said.",
    "link": "https://www.hurriyetdailynews.com/ukraine-says-russian-strikes-kill-three-214475",
    "timestamp": "2025-10-09T05:51:32Z"
  },
  {
    "title": "The Problem of No Man’s Land",
    "description": "Palestine is a special case of “no man’s land.” For the moment, Palestinians still live there. But, according to the Israeli government and the tourism-inspired dreams of Donald Trump, they should not. Israeli soldiers are actively making their lives hell on …",
    "link": "https://www.counterpunch.org/2025/10/09/the-problem-of-no-mans-land/",
    "timestamp": "2025-10-09T05:50:25Z"
  },
  {
    "title": "Gaza peace deal: Trump says Israel and Hamas have signed-off on first phase",
    "description": "All hostages in Gaza will be released very soon, Donald Trump says",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/gaza-peace-deal-trump-says-israel-and-hamas-have-signed-off-on-first-phase/",
    "timestamp": "2025-10-09T05:50:17Z"
  },
  {
    "title": "Federal court to weigh Trump's deployment of National Guard troops in Chicago area",
    "description": "President Donald Trump’s deployment of National Guard troops to Illinois will face scrutiny at a pivotal court hearing, hours after a small number of Texas Guard members started protecting federal property in the the Chicago area",
    "link": "https://abcnews.go.com/US/wireStory/federal-court-weigh-trumps-deployment-national-guard-troops-126354288",
    "timestamp": "2025-10-09T05:50:13Z"
  },
  {
    "title": "Urgent Next Steps for Palestine at the UN",
    "description": "As U.S. President Donald Trump surely intended, his “20-point Gaza plan” succeeded in upstaging calls by many other world leaders at the UN General Assembly for concrete, coordinated UN-led measures to force Israel to end its criminal genocide in Gaza and the…",
    "link": "https://www.counterpunch.org/2025/10/09/urgent-next-steps-for-palestine-at-the-un/",
    "timestamp": "2025-10-09T05:50:12Z"
  },
  {
    "title": "Will Takaichi's 'Abenomics' weaken the yen and raise the ire of Trump?",
    "description": "Markets have responded to Takaichi's victory with the \"Takaichi trade,\" pushing the Nikkei to record highs and weakening the yen to beyond the 150 mark.",
    "link": "https://www.cnbc.com/2025/10/09/the-takaichi-trade-dilemma-japan-currency-tightrope-with-trump-abenomics.html",
    "timestamp": "2025-10-09T05:49:38Z"
  },
  {
    "title": "Israeli President: 'No Doubt' Trump 'Deserves the Nobel Peace Prize' for Hostage Deal",
    "description": "Israeli President Isaac Herzog said Thursday that President Donald Trump deserves the Nobel Peace Prize for negotiating a hostage deal that will bring an end to the Gaza war.\nThe post Israeli President: ‘No Doubt’ Trump ‘Deserves the Nobel Peace Prize’ for Ho…",
    "link": "https://www.breitbart.com/middle-east/2025/10/08/israeli-president-no-doubt-trump-deserves-the-nobel-peace-prize-for-hostage-deal/",
    "timestamp": "2025-10-09T05:49:06Z"
  },
  {
    "title": "Türkiye's top diplomat to attend Gaza meeting in Paris",
    "description": "Foreign Minister Hakan Fidan will participate in a meeting on Gaza, hosted by France in Paris on Thursday, according to the Turkish Foreign Ministry.",
    "link": "https://www.hurriyetdailynews.com/turkiyes-top-diplomat-to-attend-gaza-meeting-in-paris-214471",
    "timestamp": "2025-10-09T05:47:03Z"
  },
  {
    "title": "Gaza Peace Deal: World Leaders React To Israel-Hamas Ceasefire Deal: 'Fighting Must Stop Once And For All'",
    "description": "In a statement, Donald Trump said all hostages would be released \"very soon\" and promised fair treatment for all sides.",
    "link": "https://www.ndtvprofit.com/world/gaza-peace-deal-world-leaders-react-to-israel-hamas-ceasefire-deal-under-trump-fighting-must-stop-once-and-for-all",
    "timestamp": "2025-10-09T05:46:38Z"
  },
  {
    "title": "China tightens rare earth export controls, targets defence, semiconductor users",
    "description": "BEIJING (Reuters) -China tightened its rare earth export controls on Thursday, expanding restrictions on processing technology and spelling out its intention...",
    "link": "https://finance.yahoo.com/news/china-tightens-rare-earth-export-054554821.html",
    "timestamp": "2025-10-09T05:45:54Z"
  },
  {
    "title": "Hamas, Israel agree hostage release, ceasefire under Trump plan",
    "description": "Israel and Hamas on Thursday agreed a Gaza ceasefire deal that could free the remaining living hostages within days, in a major step toward ending a war that has killed tens of thousands and unleashed a humanitarian crisis.",
    "link": "https://www.hurriyetdailynews.com/hamas-israel-agree-hostage-release-ceasefire-under-trump-plan-214470",
    "timestamp": "2025-10-09T05:44:29Z"
  },
  {
    "title": "Is Gaza peace plan ‘first phase’ breakthrough Trump’s final push before Nobel Peace Prize announcement? 10 key facts you need to know",
    "description": "Trump announced a breakthrough in the Israel-Hamas conflict, with both sides agreeing to a \"first phase\" peace plan involving hostage and prisoner exchanges and troop withdrawal. This development comes just before the Nobel Peace Prize announcement. The US pr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-gaza-peace-plan-first-phase-breakthrough-trumps-final-push-before-nobel-peace-prize-announcement-10-key-facts-you-need-to-know/articleshow/124405898.cms",
    "timestamp": "2025-10-09T05:43:56Z"
  },
  {
    "title": "World leaders express hope after Trump says Israel and Hamas agreed to first phase of peace deal",
    "description": "World leaders have expressed hope for peace after U.S. President Donald Trump announced a breakthrough deal between Israel and Hamas",
    "link": "https://abcnews.go.com/International/wireStory/world-leaders-express-hope-after-trump-israel-hamas-126353825",
    "timestamp": "2025-10-09T05:41:44Z"
  },
  {
    "title": "France in limbo",
    "description": "In today’s edition: Ursula von der Leyen’s Commission faces two censure votes in Parliament, both expected to fail, Friedrich Merz comes under pressure as car industry chiefs arrive in Berlin for a major summit, the new US ambassador to the EU says Brussels a…",
    "link": "https://www.euractiv.com/news/rapporteur-france-in-limbo/",
    "timestamp": "2025-10-09T05:40:53Z"
  },
  {
    "title": "JP Morgan’s Jamie Dimon warns ‘serious stock market correction in US’ on the cards",
    "description": "JP Morgan CEO Jamie Dimon has warned of a potential major U.S. stock market correction within six months to two years, citing geopolitical tensions, heavy fiscal spending, and global uncertainty. While optimistic about AI, he cautioned against overconfidence …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/jp-morgans-jamie-dimon-warns-serious-stock-market-correction-in-us-on-the-cards/articleshow/124405909.cms",
    "timestamp": "2025-10-09T05:39:05Z"
  },
  {
    "title": "What do we know about Trump’s Gaza deal?",
    "description": "Israel and Hamas sign off first phase of the plan to bring release of all hostages, alive and dead, ‘very soon’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/qa-what-do-we-know-about-trumps-gaza-deal/",
    "timestamp": "2025-10-09T05:37:33Z"
  },
  {
    "title": "What we know about the 'first phase' of the Gaza peace deal",
    "description": "Donald Trump says all hostages will be released and Israel will withdraw troops to an \"agreed upon line\", but there is no update to other aspects of his 20-point peace plan.",
    "link": "https://www.bbc.com/news/articles/cvgqx7ygq41o",
    "timestamp": "2025-10-09T05:36:27Z"
  },
  {
    "title": "What we know about the 'first phase' Gaza peace deal",
    "description": "Donald Trump says all hostages will be released and Israel will withdraw troops to an \"agreed upon line\", but there is no update to other aspects of his 20-point peace plan.",
    "link": "https://www.bbc.co.uk/news/articles/cvgqx7ygq41o",
    "timestamp": "2025-10-09T05:36:27Z"
  },
  {
    "title": "'Momentous opportunity': Global reaction to news of Gaza peace deal",
    "description": "Officials from around the world have welcomed the agreement between Israel and Hamas.",
    "link": "https://www.bbc.com/news/articles/c8rvzzjnxe1o",
    "timestamp": "2025-10-09T05:35:09Z"
  },
  {
    "title": "M'sia ready to support any UN peacekeeping effort in Palestine, Dewan Rakyat told",
    "description": "KUALA LUMPUR: Any proposal for a military alliance of Muslim countries should be considered carefully to ensure the objectives of peace are achieved, says Deputy Foreign Minister Datuk Mohamad Alamin. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/09/m039sia-ready-to-support-any-un-peacekeeping-effort-in-palestine-dewan-rakyat-told",
    "timestamp": "2025-10-09T05:33:00Z"
  },
  {
    "title": "Gavin Newsom Slams Trump for ‘Abandoning’ LA Fire Victims by Withholding Aid: ‘Where Is the Accountability?’ | Video",
    "description": "\"It’s disgusting and disqualifying,\" the California governor adds\nThe post Gavin Newsom Slams Trump for ‘Abandoning’ LA Fire Victims by Withholding Aid: ‘Where Is the Accountability?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gavin-newsom-donald-trump-criticism-la-fire-victims-aid/",
    "timestamp": "2025-10-09T05:31:52Z"
  },
  {
    "title": "Donald Trump, 79, Going for ‘Yearly’ Health Check After Just Six Months",
    "description": "The annual checkup is the second time this year as speculation on the president’s health swirls.",
    "link": "https://www.thedailybeast.com/donald-trump-79-going-for-yearly-health-check-after-just-six-months/",
    "timestamp": "2025-10-09T05:30:07Z"
  },
  {
    "title": "Will the SEC’s ‘innovation exemptions’ change U.S. crypto regulations for good?",
    "description": "The SEC is moving fast, but what does the 'innovation exemption' mean for everyday crypto investors?",
    "link": "https://ambcrypto.com/will-secs-innovation-exemptions-change-u-s-crypto-regulations-for-good/",
    "timestamp": "2025-10-09T05:30:00Z"
  },
  {
    "title": "UN Chief Guterres Hails Israel-Hamas Ceasefire Deal",
    "description": "UN Secretary-General Antonio Guterres welcomed the peace agreement between Israel and Palestinian movement Hamas, stating that the global organization is ready to support the deal and increase humanitarian aid.",
    "link": "https://sputnikglobe.com/20251009/un-chief-guterres-hails-israel-hamas-ceasefire-deal-1122929076.html",
    "timestamp": "2025-10-09T05:27:57Z"
  },
  {
    "title": "No to Trump: Why Afghanistan’s neighbours have opposed US Bagram plan",
    "description": "Regional powers gather in Moscow to discuss Afghanistan’s future, signalling a new phase of post-US diplomacy.",
    "link": "https://www.aljazeera.com/news/2025/10/9/no-to-trump-why-afghanistans-neighbours-have-opposed-us-bagram-plan",
    "timestamp": "2025-10-09T05:23:43Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire and return of hostages",
    "description": "Crucial questions remain, including postwar administration and fate of Hamas",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/israel-and-hamas-agree-to-gaza-ceasefire-and-return-of-hostages/",
    "timestamp": "2025-10-09T05:21:10Z"
  },
  {
    "title": "Trump Says US Attack on Iran's Nuclear Facilities Brought Israel-Hamas Deal Closer",
    "description": "US President Donald Trump has said that the US Air Force attack on Iran's nuclear facilities was one of the reasons for the agreement between Israel and Hamas.",
    "link": "https://sputnikglobe.com/20251009/trump-says-us-attack-on-irans-nuclear-facilities-brought-israel-hamas-deal-closer-1122928940.html",
    "timestamp": "2025-10-09T05:18:49Z"
  },
  {
    "title": "Trump calls for jailing of Illinois governor and Chicago mayor in immigration standoff",
    "description": "President Donald Trump has called for the jailing of Illinois officials, accusing them of not doing enough to ensure the safety of federal immigration officers who are conducting raids in Chicago. The president wrote in a social media post that Chicago Mayor …",
    "link": "https://thechronicle.com.gh/trump-calls-for-jailing-of-illinois-governor-and-chicago-mayor-in-immigration-standoff/",
    "timestamp": "2025-10-09T05:16:40Z"
  },
  {
    "title": "Israeli hostages, including Bipin Joshi, will be released very soon: US",
    "description": "Kathmandu, Oct 9: The United States said Israeli hostages held by Hamas, including Nepali national Bipin Joshi, are expected to […]\nThe post Israeli hostages, including Bipin Joshi, will be released very soon: US appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/10/09/israeli-hostages-including-bipin-joshi-will-be-released-very-soon-us/",
    "timestamp": "2025-10-09T05:15:00Z"
  },
  {
    "title": "US and regional mediators join talks in push to end Gaza war",
    "description": "Top US envoys and regional figures are taking part in the third day of indirect talks between Israel and Hamas in Egypt on President Donald Trump’s plan to end the war in Gaza. Steve Witkoff and Trump’s son-in-law, Jared Kushner, arrived in Sharm el-Sheikh on…",
    "link": "https://thechronicle.com.gh/us-and-regional-mediators-join-talks-in-push-to-end-gaza-war/",
    "timestamp": "2025-10-09T05:14:55Z"
  },
  {
    "title": "Herzog: President Trump deserves Nobel Prize for Gaza hostage deal",
    "description": "President Isaac Herzog hailed the agreement to free hostages and end the Gaza war, thanking Prime Minister Netanyahu and President Donald Trump, whom he said deserves the Nobel Peace Prize.",
    "link": "https://www.israelnationalnews.com/news/416010",
    "timestamp": "2025-10-09T05:13:00Z"
  },
  {
    "title": "Live updates: Israel, Hamas agree to first phase of Gaza ceasefire plan, Trump says hostages could be released Monday",
    "description": "President Trump says Israel and Hamas have agreed on the first phase of a framework that will allow for the swift release of all hostages. Follow live updates.",
    "link": "https://www.cnn.com/world/live-news/israel-hamas-gaza-ceasefire-agreement-10-09-25",
    "timestamp": "2025-10-09T05:10:01Z"
  },
  {
    "title": "China tightens rare earth export curbs, taking aim at military and chip applications | CNN Business",
    "description": "Beijing imposed new restrictions on rare earth exports on Thursday, targeting critical minerals production technologies and their overseas use, including for military and semiconductor applications.",
    "link": "https://www.cnn.com/2025/10/09/business/china-tightens-rare-earth-export-controls-intl-hnk",
    "timestamp": "2025-10-09T05:08:57Z"
  },
  {
    "title": "US diplomat fired over relationship with woman accused of ties to Chinese Communist Party",
    "description": "The State Department said Wednesday that it has fired a US diplomat over a romantic relationship he admitted having with a Chinese woman alleged to have ties to the Chinese Communist Party.",
    "link": "https://nypost.com/2025/10/09/us-news/us-state-department-diplomat-fired-over-relationship-with-chinese-communist-party-woman/",
    "timestamp": "2025-10-09T05:07:13Z"
  },
  {
    "title": "Trump announces Gaza ceasefire deal: What we know and what’s next",
    "description": "This is the first phase of a 20-point plan announced by Trump last week.",
    "link": "https://www.aljazeera.com/news/2025/10/9/trump-announces-gaza-ceasefire-deal-what-we-know-and-whats-next",
    "timestamp": "2025-10-09T05:05:38Z"
  },
  {
    "title": "Inside the room where Nobel Peace Prize is decided – but will Trump get his wish?",
    "description": "For the first time in its 125-year history, the committee allows an exclusive behind-the-scenes glimpse.",
    "link": "https://www.bbc.com/news/articles/cg5ejm4qrzyo",
    "timestamp": "2025-10-09T05:04:22Z"
  },
  {
    "title": "IDF to significantly withdraw from Khan Yunis in southern Gaza",
    "description": "Amended maps for Gaza deal include significant IDF withdrawal in Khan Yunis and southern Gaza, as per Hamas' request.",
    "link": "https://www.israelnationalnews.com/news/416006",
    "timestamp": "2025-10-09T05:03:41Z"
  },
  {
    "title": "Prosecutors assure judge of fair trial despite posts about assassination of UnitedHealthcare CEO",
    "description": "Federal prosecutors say no harm was done to the prospects for a fair trial when two U.S. Justice Department officials reposted potentially inflammatory comments President Donald Trump made about Luigi Mangione after his arrest in the killing of UnitedHealthca…",
    "link": "https://www.whio.com/news/business/prosecutors-say-no/GQWBH2ROCY54LJXZPN4EBKUDQE/",
    "timestamp": "2025-10-09T05:02:02Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire and return of hostages",
    "description": "Israel and Hamas said they had agreed to a long-awaited ceasefire and hostage deal, the first phase of U.S. President Donald Trump's plan to end a war in Gaza that has killed more than 67,000 people and reshaped the Middle East.",
    "link": "https://www.independent.ie/world-news/middle-east/israel-and-hamas-agree-to-gaza-ceasefire-and-return-of-hostages/a846528435.html",
    "timestamp": "2025-10-09T05:01:52Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire as hostages may be released on Saturday",
    "description": "Israeli hostages may be released as early as Saturday under a U.S. plan to end the war in Gaza and the country's military will complete the first part of a partial withdrawal from the enclave within 24 hours of the deal being signed, said a source briefed on …",
    "link": "https://www.independent.ie/world-news/middle-east/israel-and-hamas-agree-to-gaza-ceasefire-as-hostages-may-be-released-on-saturday/a846528435.html",
    "timestamp": "2025-10-09T05:01:52Z"
  },
  {
    "title": "Watch: Scenes of celebration in Gaza after peace deal announcement",
    "description": "Palestinians celebrate on the streets of Khan Younis after the first phase of a Gaza peace deal was agreed.",
    "link": "https://www.bbc.co.uk/news/videos/c5yennkdjyyo",
    "timestamp": "2025-10-09T04:59:54Z"
  },
  {
    "title": "Israel and Hamas agree to ceasefire after 2 years of war – “Hostages will be back on Monday” says Trump",
    "description": "\"Gaza will be rebuilt and the US will participate in peacekeeping,\" said the US president, who aspires to receive the Nobel Peace Prize, in an interview.\nThe post Israel and Hamas agree to ceasefire after 2 years of war – “Hostages will be back on Monday” say…",
    "link": "https://en.protothema.gr/2025/10/09/israel-and-hamas-agree-to-ceasefire-after-2-years-of-war-hostages-will-be-back-on-monday-says-trump/",
    "timestamp": "2025-10-09T04:51:42Z"
  },
  {
    "title": "Trump to have 'routine' medical check on Friday: White House",
    "description": "President Donald Trump is scheduled for a routine medical checkup this Friday at Walter Reed Medical Center. This marks his second annual appointment this year, following a clean bill of health in April. At 79, Trump, who often highlights his fitness, will un…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-have-routine-medical-check-on-friday-white-house/articleshow/124405058.cms",
    "timestamp": "2025-10-09T04:50:07Z"
  },
  {
    "title": "US approves some Nvidia UAE sales, Bloomberg News reports",
    "description": "America has approved billions of dollars in Nvidia chip exports to the United Arab Emirates. This is part of a bilateral artificial intelligence agreement. The deal will help the UAE build data centres for AI model development. The agreement allows for signif…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-approves-some-nvidia-uae-sales-bloomberg-news-reports/articleshow/124405043.cms",
    "timestamp": "2025-10-09T04:49:03Z"
  },
  {
    "title": "Crude oil futures decline as Trump announces Israel-Hamas peace plan",
    "description": "October crude oil futures trade at ₹5,529 on MCX during initial hour of trading on Thursday against previous close of ₹5,576, down by 0.84%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-as-trump-announces-israel-hamas-peace-plan/article70142310.ece",
    "timestamp": "2025-10-09T04:46:00Z"
  },
  {
    "title": "Opportunity where beyond services, India will now create those products: Niranjan Hiranandani on US tariffs",
    "description": "US tariffs present a golden opportunity for India to shift from a services-centric model to indigenous product creation, boosting the Atmanirbhar Bharat vision. Businessman Dr. Niranjan Hiranandani believes this challenge will accelerate India's self-reliance…",
    "link": "https://economictimes.indiatimes.com/news/india/opportunity-where-beyond-services-india-will-now-create-those-products-niranjan-hiranandani-on-us-tariffs/articleshow/124404968.cms",
    "timestamp": "2025-10-09T04:45:46Z"
  },
  {
    "title": "Frustrated lawmakers say lack of trust is making it harder to end the government shutdown",
    "description": "Lawmakers are openly venting their frustration as they try to gain traction to end the government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/frustrated-lawmakers-lack-trust-making-harder-end-government-126352928",
    "timestamp": "2025-10-09T04:45:39Z"
  },
  {
    "title": "Donald Trump's Second 'Yearly' Check-Up in 6 Months Sparks Health Panic - Inquisitr News",
    "description": "Despite claims of Trump being in great shape, the President has a second health checkup coming up, only within six months after the first one.",
    "link": "https://www.inquisitr.com/donald-trumps-second-yearly-check-up-in-6-months-sparks-health-panic",
    "timestamp": "2025-10-09T04:44:53Z"
  },
  {
    "title": "Gold price vs US Dollar: $6,000 to $9,000 - where will gold rate go up? Is Donald Trump responsible for gold rush over slipping USD?",
    "description": "Gold prices rally in the longer term would come from how central banks think about monetary policy and how central banks think about their own reserves, experts said.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-vs-us-dollar-6000-to-9000-where-will-gold-rate-go-is-donald-trump-responsible-for-gold-rush-over-slipping-usd/articleshow/124404865.cms",
    "timestamp": "2025-10-09T04:43:42Z"
  }
]