[
  {
    "title": "Best Crypto to Buy as Bitcoin’s Largest-Ever Options Expiry Set to Push the King Crypto over $110K",
    "description": "Bitcoin is headed towards its largest option expiry of 2025 at around $13.8B on May 30. Just a week earlier, the OG crypto crossed its previous high of $109K and made a new all-time high. However, over the past week, the prices have corrected by around 3%, me…",
    "link": "http://www.newsbtc.com/news/best-crypto-to-buy-as-bitcoins-largest-ever-options-expiry-set-to-push-the-king-crypto-over-110k/",
    "timestamp": "2025-05-24T13:52:46Z"
  },
  {
    "title": "Syria’s al-Sharaa meets Erdogan in Turkiye as sanctions lifted",
    "description": "The meeting comes after US and EU agreed to lift sanctions to allow the civil war-hit country to recover and rebuild.",
    "link": "https://www.aljazeera.com/news/2025/5/24/syrias-al-sharaa-meets-erdogan-in-turkiye-as-sanctions-lifted",
    "timestamp": "2025-05-24T13:52:15Z"
  },
  {
    "title": "Trump Loyalist On CNN Rips Memecoin Sweepstakes Gala — Trump ‘Probably Shouldn’t Have Done’",
    "description": "CNN analyst and ex-Trump aide David Urban ripped  President Donald Trump over his crypto investors’ gala, saying he didn't \"like it.\"\nThe post Trump Loyalist On CNN Rips Memecoin Sweepstakes Gala — Trump ‘Probably Shouldn’t Have Done’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/trump-loyalist-on-cnn-rips-memecoin-sweepstakes-gala-trump-probably-shouldnt-have-done/",
    "timestamp": "2025-05-24T13:50:51Z"
  },
  {
    "title": "Trump’s new tariff threats show trade uncertainty here to stay",
    "description": "Hopes for easing trade tensions under Donald Trump were dashed as he threatened new tariffs on the EU and smartphones, causing market instability. Despite some progress with the UK and potential deals with India, Trump asserted his aggressive trade strategy, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-new-tariff-threats-show-trade-uncertainty-here-to-stay/articleshow/121381587.cms",
    "timestamp": "2025-05-24T13:44:18Z"
  },
  {
    "title": "Donald Trump makes risky bet by rekindling his trade war with the EU",
    "description": "Donald Trump makes risky bet by rekindling his trade war with the EU\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and …",
    "link": "https://biztoc.com/x/d5606c849fa88b99",
    "timestamp": "2025-05-24T13:41:11Z"
  },
  {
    "title": "미국이 국내외 경제를 재편하는 가장 확실한 방법",
    "description": "Treasury Secretary Scott Bessent said that US regulators may lift a rule that’s served as a constraint on banks’ trading in the $29 trillion Treasuries market this summer https://t.co/JgOEiKie04— Bloomberg (@business) May 23, 2025 Bank of Canada Governor Tiff…",
    "link": "https://ryueyes11.tistory.com/511645",
    "timestamp": "2025-05-24T13:36:23Z"
  },
  {
    "title": "Trump to speak at a West Point upended by his changes - The Washington Post",
    "description": "Trump to speak at a West Point upended by his changesThe Washington Post The latest on Trump’s tariffs, legal battles and West Point addressCNN Donald Trump at West Point graduation 2025: President to address US Military Academy grads following DEI crackdownA…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177722115",
    "timestamp": "2025-05-24T13:35:33Z"
  },
  {
    "title": "Donald Trump makes risky bet by rekindling his trade war with the EU - Financial Times",
    "description": "Donald Trump makes risky bet by rekindling his trade war with the EUFinancial Times Pivoting From Tax Cuts to Tariffs, Trump Ignores Economic Warning SignsThe New York Times Trump's tariff threat risks a trade war with Europe years in the makingNBC News Trade…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177722105",
    "timestamp": "2025-05-24T13:35:02Z"
  },
  {
    "title": "Trump Admin Responds To Greenland-Europe Minerals Deal Blow",
    "description": "The Trump administration has said it is ready \"to expand its partnership with Greenland.\"",
    "link": "https://www.newsweek.com/trump-greenland-minerals-2076693",
    "timestamp": "2025-05-24T13:34:36Z"
  },
  {
    "title": "Corporate America Retreats From Gay Pride Events Across US Amid Trump DEI Crackdown",
    "description": "There have been reports that major gay pride parades across the U.S. have been scrambling for funds due to corporate sponsors scaling back their support.",
    "link": "https://dailycaller.com/2025/05/24/corporate-america-retreats-from-gay-pride-events-across-us-amid-trump-dei-crackdown/",
    "timestamp": "2025-05-24T13:31:08Z"
  },
  {
    "title": "Pharmacists stockpile most common drugs on chance of targeted Trump tariffs",
    "description": "Independent pharmacists and makers of generic drugs see trouble ahead for patients.",
    "link": "https://www.bostonherald.com/2025/05/24/pharmacists-drugs-trump-tariffs/",
    "timestamp": "2025-05-24T13:30:41Z"
  },
  {
    "title": "Trump’s wild tariff tactics risk giving everyone a bad case of burnout",
    "description": "On Friday morning, Trump threatened a 50% duty on goods coming out of the European Union and a 25% tariff on Apple, sending markets reeling.",
    "link": "https://nypost.com/2025/05/24/opinion/trumps-whim-driven-strategy-risks-giving-everyone-a-bad-case-of-tariff-burnout/",
    "timestamp": "2025-05-24T13:30:17Z"
  },
  {
    "title": "How to Meet with Trump: A South African Masterclass in Diplomatic Strategy",
    "description": "You probably saw the cringe-worthy spectacle a few months ago: U.S. President Donald Trump, Vice President JD Vance, and Ukrainian President Volodymyr Zelenskyy in the White House. The Ukrainian president's pained expression as he described facing down Russia…",
    "link": "https://www.commondreams.org/opinion/south-africa-meet-trump",
    "timestamp": "2025-05-24T13:30:03Z"
  },
  {
    "title": "Trump aims tariff threats at Apple and sends stock markets spiraling",
    "description": "President Donald Trump is ramping up his tariff threats on social media, this time aimed at Apple. The Dow dropped .6% yesterday after Trump said phones sold in the U.S. should be made in the U.S. The S&P and Nasdaq also tumbled.",
    "link": "https://www.cbsnews.com/video/trump-aims-tariff-threats-at-apple-and-sends-stock-markets-spiraling/",
    "timestamp": "2025-05-24T13:30:00Z"
  },
  {
    "title": "Ordering the Reform of the Nuclear Regulatory Commission (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nOrdering the Reform of the Nuclear Regulatory Commission  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpos…",
    "link": "https://www.memeorandum.com/250524/p16",
    "timestamp": "2025-05-24T13:30:00Z"
  },
  {
    "title": "Morning Movers: Apple slips following President Trump tariff threat",
    "description": "In This Article:\nStock futures are trending lower, reflecting investor concerns over escalating trade tensions and fiscal uncertainties.\nConfident Investing Starts Here:\n-\nEasily unpack a company's performance with TipRanks' new KPI Data for smart investment …",
    "link": "https://biztoc.com/x/982bca25f3edb663",
    "timestamp": "2025-05-24T13:29:46Z"
  },
  {
    "title": "‘Father of IVF’? Trump freezes out experts while pushing fertility plan",
    "description": "Republican President Donald Trump, who called himself the “father of IVF” on the campaign trail, issued an executive order in February directing policy advisers to create a report on how to make in vitro fertilization more accessible for Americans.\n\n“Today, m…",
    "link": "https://www.rawstory.com/trump-ivf-2672199251/",
    "timestamp": "2025-05-24T13:29:43Z"
  },
  {
    "title": "California’s AG suggests potential lawsuit over Trump’s Apple tariff threats",
    "description": "Yesterday’s big story was Trump threatening Apple with at least a 25% Tariff on iPhones if the company didn’t make them in the U.S. Late in the day, California Attorney General Rob Bonta stated that he’s prepared to sue if appropriate to defend the state’s co…",
    "link": "https://www.patentlyapple.com/2025/05/californias-ag-suggests-potential-lawsuit-over-trumps-apple-tariff-threats.html",
    "timestamp": "2025-05-24T13:29:41Z"
  },
  {
    "title": "Cop's Daughter Accepts Award From President Trump With the Most Unbothered Energy",
    "description": "Cop's Daughter Accepts Award From President Trump With the Most Unbothered Energycafemom.com",
    "link": "https://cafemom.com/entertainment/cops-daughter-accepts-award-from-president-trump-with-the-most-unbothered-energy",
    "timestamp": "2025-05-24T13:25:49Z"
  },
  {
    "title": "5 Issues That Might Decide Fate Of Trump’s ‘Big, Beautiful’ Bill In Senate",
    "description": "The Senate is currently considering a host of changes President Trump's \"one big, beautiful bill.\" Here are five areas of contention.",
    "link": "https://dailycaller.com/2025/05/24/what-gop-senators-might-change-big-beautiful-bill/",
    "timestamp": "2025-05-24T13:25:33Z"
  },
  {
    "title": "These companies will raise prices because of Trump’s tariffs | CNN Business",
    "description": "President Donald Trump’s sweeping tariffs have given many Americans whiplash. The list of companies announcing price changes as a result is equally daunting.",
    "link": "https://www.cnn.com/2025/05/24/business/companies-raise-prices-trump-tariffs",
    "timestamp": "2025-05-24T13:20:58Z"
  },
  {
    "title": "Now It All Makes Sense: Tapper Lets It Slip That Coming Clean on Biden Is Really About Getting Trump",
    "description": "If chutzpah could take human form, it would strongly resemble CNN’s Jake Tapper. The recent spectacle of Tapper making the rounds on the interview circuit to promote his latest book, “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous C…",
    "link": "https://freerepublic.com/focus/f-news/4318844/posts",
    "timestamp": "2025-05-24T13:20:47Z"
  },
  {
    "title": "Arson attack probed as Cannes and parts of southern France suffer power cut",
    "description": "Major power outage hits the prominent film festival on its closing day and impacts 160,000 homes in the area.",
    "link": "https://www.aljazeera.com/news/2025/5/24/arson-attack-probed-as-cannes-and-parts-of-southern-france-suffer-power-cut",
    "timestamp": "2025-05-24T13:19:55Z"
  },
  {
    "title": "US Treasury Secretary Scott Bessent warns of 'detox period.' 3 ways to shockproof your portfolio",
    "description": "Moneywise and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nFor much of last year, President Donald Trump promised “extraordinary” economic benefits from his policies and “the brightest economic future the world has e…",
    "link": "https://biztoc.com/x/c3887076edeeb6a2",
    "timestamp": "2025-05-24T13:19:31Z"
  },
  {
    "title": "Trump and the far right don’t fight antisemitism. They exploit it",
    "description": "Antisemitism is increasing on university campuses — and throughout the world. But let’s be clear: Donald Trump and the right wing are not fighting antisemitism. They are exploiting it. And they are deliberately doing so, using Jewish people as pawns in a broa…",
    "link": "https://freerepublic.com/focus/f-news/4318843/posts",
    "timestamp": "2025-05-24T13:17:48Z"
  },
  {
    "title": "Will Trump deport Belgium's future queen? She's caught up in Harvard foreign student ban and situation is uncertain",
    "description": "Princess Elisabeth of Belgium, heir to the throne, faces uncertainty regarding her studies at Harvard due to the Trump administration's ban on international students. The royal palace is currently analyzing the situation and awaiting further clarification, as…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-trump-deport-belgiums-future-queen-shes-caught-up-in-harvard-foreign-student-ban-and-situation-is-uncertain/articleshow/121381186.cms",
    "timestamp": "2025-05-24T13:17:01Z"
  },
  {
    "title": "Morning Movers: Apple slips following President Trump tariff threat",
    "description": "Stock futures are trending lower, reflecting investor concerns over escalating trade tensions and fiscal uncertainties. President Donald Trump’s recent...",
    "link": "https://finance.yahoo.com/news/morning-movers-apple-slips-following-131522487.html",
    "timestamp": "2025-05-24T13:15:22Z"
  },
  {
    "title": "Pivoting From Tax Cuts to Tariffs, Trump Ignores Economic Warning Signs - The New York Times",
    "description": "Pivoting From Tax Cuts to Tariffs, Trump Ignores Economic Warning SignsThe New York Times Any trade deal with US must be based on ‘respect not threats’, says EU commissionerThe Guardian Trump's tariff threat risks a trade war with Europe years in the makingNB…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177721969",
    "timestamp": "2025-05-24T13:14:37Z"
  },
  {
    "title": "Europe at risk of becoming ‘technological supplicant’ to US and China, says McMafia writer Misha Glenny",
    "description": "Discussion took place during The Independent’s daily News Review event at the 2025 Hay Festival",
    "link": "https://www.the-independent.com/arts-entertainment/books/news/misha-glenny-hay-festival-2025-china-us-europe-ai-b2757188.html",
    "timestamp": "2025-05-24T13:11:48Z"
  },
  {
    "title": "Trump-Roasting Comic Fires Off Brutal Gags On Fox News — Host Can’t Help Laughing",
    "description": "rump-roasting comic Matt Friend fired off some brutal gags in a Fox News interview that host Jesse Watters couldn't keep from laughing at.\nThe post Trump-Roasting Comic Fires Off Brutal Gags On Fox News — Host Can’t Help Laughing first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/entertainment/trump-roasting-comic-fires-off-brutal-gags-on-fox-news-host-cant-help-laughing/",
    "timestamp": "2025-05-24T13:11:43Z"
  },
  {
    "title": "Some states reexamine school discipline as Trump order paves go-ahead",
    "description": "New legislation already is trending toward giving teachers more authority to address student misbehavior.",
    "link": "https://www.bostonherald.com/2025/05/24/states-school-discipline/",
    "timestamp": "2025-05-24T13:10:51Z"
  },
  {
    "title": "Haitians with HIV defy stigma as they publicly denounce USAID cuts and dwindling medication",
    "description": "Haitians with HIV are defying stigma as they publicly denounce USAID cuts implemented by the administration of U.S. President Donald Trump that has led to a dwindling of life-saving medication",
    "link": "https://abcnews.go.com/Health/wireStory/haitians-hiv-defy-stigma-publicly-denounce-usaid-cuts-122146010",
    "timestamp": "2025-05-24T13:10:29Z"
  },
  {
    "title": "'Could Amount to a Bribe': Group Threatens Lawsuit If Paramount Caves to Trump",
    "description": "If Paramount Global, the parent company of CBS News, settles a $20 billion lawsuit brought by U.S. President Donald Trump, it could face another lawsuit from a leading press freedom organization.\n\n\nThe Freedom of the Press Foundation (FPF), a Paramount shareh…",
    "link": "https://www.commondreams.org/news/paramount-trump-lawsuit",
    "timestamp": "2025-05-24T13:10:25Z"
  },
  {
    "title": "McCaul touts money in Trump tax bill to pay Texas back for fighting Biden border policies",
    "description": "House Republicans secured $12 billion in their reconciliation bill for states that incurred costs over the border crisis during the Biden administration.",
    "link": "https://www.foxnews.com/politics/mccaul-touts-money-trump-tax-bill-pay-texas-back-fighting-biden-border-policies",
    "timestamp": "2025-05-24T13:08:34Z"
  },
  {
    "title": "Haitians with HIV defy stigma as they publicly denounce USAID cuts and dwindling medication",
    "description": "Haitians with HIV are defying stigma as they publicly denounce USAID cuts implemented by the administration of U.S. President Donald Trump that has led to a dwindling of life-saving medication.",
    "link": "https://www.clickondetroit.com/health/2025/05/24/haitians-with-hiv-defy-stigma-as-they-publicly-denounce-usaid-cuts-and-dwindling-medication/",
    "timestamp": "2025-05-24T13:08:19Z"
  },
  {
    "title": "Trump’s use of presidential seal at memecoin event raises legal questions",
    "description": "President Donald Trump is facing scrutiny after speaking at a private event for top investors in his $TRUMP memecoin while standing behind a lectern emblazoned with the official presidential seal — a move that may violate federal law.\nThe event took place Thu…",
    "link": "https://biztoc.com/x/7b29178797d6a42d",
    "timestamp": "2025-05-24T13:08:05Z"
  },
  {
    "title": "Benzinga Bulls And Bears: Alphabet, L3Harris, Target — And Latest Tariff News Roils Markets",
    "description": "Benzinga examined the prospects for many investors' favorite stocks over the last week — here's a look at some of our top stories.\nU.S. markets experienced heightened volatility this week as President Donald Trump intensified trade tensions by threatening a 2…",
    "link": "https://biztoc.com/x/d554eebc76787d61",
    "timestamp": "2025-05-24T13:07:35Z"
  },
  {
    "title": "Europe is finally taking action for Palestine, but it is too little and too late",
    "description": "The European Union has the power to stop Israel's rampant slaughter in Gaza. But even recent moves to pressure Israel reflect the EU's unwillingness to stop the genocide.",
    "link": "https://mondoweiss.net/2025/05/europe-is-finally-taking-action-for-palestine-but-it-is-too-little-and-too-late/",
    "timestamp": "2025-05-24T13:05:00Z"
  },
  {
    "title": "JORGE MARTINEZ: President Trump Is Powering America’s Economic Comeback",
    "description": "The shelves are fuller, the prices are lower, and the American worker is finally getting ahead, not just surviving, but thriving again.",
    "link": "https://dailycaller.com/2025/05/24/opinion-president-trump-is-powering-americas-economic-comeback-jorge-martinez/",
    "timestamp": "2025-05-24T13:04:38Z"
  },
  {
    "title": "Credibility crisis: When CNN criticized questioning Biden's mental fitness",
    "description": "CNN figures and reports pushed back last year against the notion of President Joe Biden's mental decline in office. Here are some examples.",
    "link": "https://www.foxnews.com/media/credibility-crisis-when-cnn-criticized-questioning-bidens-mental-fitness",
    "timestamp": "2025-05-24T13:00:55Z"
  },
  {
    "title": "SCOOP: House Republicans request ban on federally funded 'transgender animal' experiments in 2026 budget",
    "description": "A group of House Republicans, led by Arizona Rep. Paul Gosar, have requested Fiscal Year 2026 spending bills to include language prohibiting federal funding for transgender experiments on animals.",
    "link": "https://www.foxnews.com/politics/house-republicans-request-ban-federally-funded-transgender-animal-experiments-2026-budget",
    "timestamp": "2025-05-24T13:00:48Z"
  },
  {
    "title": "Rapidly expanding school voucher programs pinch state budgets",
    "description": "Universal vouchers could drive up costs by creating two parallel education systems.",
    "link": "https://www.bostonherald.com/2025/05/24/school-vouchers-budgets/",
    "timestamp": "2025-05-24T13:00:26Z"
  },
  {
    "title": "‘Unprecedented’: ICE Officers Operating Inside Bay Area Immigration Courts, Lawyers Say",
    "description": "Attorneys have seen US Immigration and Customs Enforcement officers in the halls and waiting rooms of several California courthouses. Advocates reported the arrest of one man at a Concord court.",
    "link": "https://www.kqed.org/news/12041473/unprecedented-ice-officers-operating-inside-bay-area-immigration-courts-lawyers-say",
    "timestamp": "2025-05-24T13:00:21Z"
  },
  {
    "title": "Trump Tries to Make Sure States Don’t Fight Climate Change Either",
    "description": "Donald Trump’s administration isn't just ending climate action in the federal government. It's trying to end climate efforts in the states, too.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-climate-states-lawsuits-republicans-justice-1235347292/",
    "timestamp": "2025-05-24T13:00:00Z"
  },
  {
    "title": "Weekend News Roundup May 24, 2025",
    "description": "Screenshot: Instagram, Metropolitan Police Department, GoFundMe, YouTube, abcnews.go, Photo: Pascal Le Segretain (Getty Images), Jemal Countess (Getty Images), Harford County Sheriff’s Office, Dukas/Christian Heeb/Universal Images Group (Getty Images), Michae…",
    "link": "https://www.theroot.com/weekend-news-roundup-may-24-2025-1851782187",
    "timestamp": "2025-05-24T13:00:00Z"
  },
  {
    "title": "5 Top Cryptocurrency Trends Shaping The Second Half Of 2025",
    "description": "Prepare for the second half of 2025! Explore the 5 top cryptocurrency trends set to define the market's direction in the coming months.",
    "link": "https://www.forbes.com/sites/digital-assets/article/top-cryptocurreny-trends-second-half-2025/",
    "timestamp": "2025-05-24T13:00:00Z"
  },
  {
    "title": "Cracks Are Showing in the U.S.-Israel Alliance",
    "description": "Trump hasn’t been shy about undermining Netanyahu’s interests.",
    "link": "https://www.theatlantic.com/international/archive/2025/05/trump-middle-east-israel-relations/682934/",
    "timestamp": "2025-05-24T13:00:00Z"
  },
  {
    "title": "Father of Suspected Killer of Israeli Diplomats Received an Invitation from a Democratic Congressman",
    "description": "A connection has been revealed between a congressional Democrat and the father of the suspect in the murder of two Israeli embassy workers.",
    "link": "https://www.westernjournal.com/father-suspected-killer-israeli-diplomats-received-invitation-democratic-congressman/",
    "timestamp": "2025-05-24T12:58:45Z"
  },
  {
    "title": "Invading Greenland Won’t Protect Us From the Climate Crisis",
    "description": "Greenland does not, on the face of it, seem to be the kind of place that a superpower like the United States would regard as a vital component of its security. With fewer than 60,000 inhabitants in an area roughly one-quarter the size of the contiguous United…",
    "link": "https://www.commondreams.org/opinion/invading-greenland-climate",
    "timestamp": "2025-05-24T12:57:03Z"
  },
  {
    "title": "Trump returning to West Point for military commencement address",
    "description": "The last time President Trump gave a speech at the U.S. Military Academy came amid nationwide reckoning following the police killing of George Floyd in 2020.",
    "link": "https://www.cbsnews.com/news/president-trump-west-point-military-commencement-address/",
    "timestamp": "2025-05-24T12:52:21Z"
  },
  {
    "title": "'Immensely vulnerable' Trump has has handed critics three paths to derail him",
    "description": "Now that Donald Trump has far surpassed his first hundred in office, longtime New York Times columnist Nicholas Kristof claims the president has provided his critics with enough ammunition –– if properly used –– to hamper and derail his second term.In a colum…",
    "link": "https://www.rawstory.com/vulnerable-trump/",
    "timestamp": "2025-05-24T12:49:41Z"
  },
  {
    "title": "How the U.S. clean energy boom could go bust if Trump's 'big, beautiful bill' becomes law",
    "description": "The legislation still has to pass the Senate and changes could still be made.",
    "link": "https://www.cnbc.com/2025/05/24/how-the-us-clean-energy-boom-could-go-bust-if-trumps-big-beautiful-bill-becomes-law.html",
    "timestamp": "2025-05-24T12:49:25Z"
  },
  {
    "title": "CASEY RYAN: Teachers’ Unions Are A Stain On Education",
    "description": "In recent decades, political activists with an agenda have conquered America’s education system from K-12 schools to universities.",
    "link": "https://dailycaller.com/2025/05/24/casey-ryan-teachers-unions-are-a-stain-on-education/",
    "timestamp": "2025-05-24T12:49:21Z"
  },
  {
    "title": "Any trade deal with US must be based on ‘respect not threats’, says EU commissioner",
    "description": "Maroš Šefčovič’s remarks come after pace of talks prompted Trump to propose 50% tariff on goods from bloc\nThe European Union’s trade chief has struck a defiant tone after Donald Trump threatened to place a 50% tariff on all goods from the bloc, saying any pot…",
    "link": "https://biztoc.com/x/bc2dd81aa2fb8c1f",
    "timestamp": "2025-05-24T12:45:33Z"
  },
  {
    "title": "President Trump Announces “Magnificent Parade” in DC to Celebrate 250th Anniversary of US Army",
    "description": "President Donald Trump announced on Friday the long talked about military parade to celebrate the 250th anniversary of the establishment of the United States Army by the Continental Congress will indeed take place in Washington, D.C.\nThe post President Trump …",
    "link": "https://www.thegatewaypundit.com/2025/05/president-trump-announces-magnificent-parade-dc-celebrate-250th/",
    "timestamp": "2025-05-24T12:45:31Z"
  },
  {
    "title": "Gavin Newsom Defies Senate Vote: 'Illegal'",
    "description": "Calling a move to block a ban on the sale of new gas-powered cars by 2035 \"illegal\" and \"an unconstitutional attack,\" Newsom vowed to take the fight to court.",
    "link": "https://www.newsweek.com/gavin-newsom-senate-gas-powered-cars-california-2076700",
    "timestamp": "2025-05-24T12:43:03Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduateswmtw.com",
    "link": "https://www.wmtw.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:36:26Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduatesketv.com",
    "link": "https://www.ketv.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:36:26Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduateswlky.com",
    "link": "https://www.wlky.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:35:49Z"
  },
  {
    "title": "Germany Discusses Nuclear Issues With Partners But Relies on US Shield - Defense Minister",
    "description": "MOSCOW (Sputnik) - Germany is engaged in a confidential nuclear dialogue with partners but recognizes the irreplaceability of the United States' nuclear shield for Europe in the foreseeable future, German Defense Minister Boris Pistorius said on Saturday.",
    "link": "https://sputnikglobe.com/20250524/germany-discusses-nuclear-issues-with-partners-but-relies-on-us-shield---defense-minister-1122122283.html",
    "timestamp": "2025-05-24T12:35:04Z"
  },
  {
    "title": "Restoring Gold Standard Science (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nRestoring Gold Standard Science  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby o…",
    "link": "https://www.memeorandum.com/250524/p13",
    "timestamp": "2025-05-24T12:35:00Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduateswlwt.com",
    "link": "https://www.wlwt.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:34:53Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduateswcvb.com",
    "link": "https://www.wcvb.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:34:44Z"
  },
  {
    "title": "Trump to give commencement address to West Point graduates",
    "description": "Trump to give commencement address to West Point graduateswmur.com",
    "link": "https://www.wmur.com/article/president-trump-commencement-address-west-point-graduates/64870312",
    "timestamp": "2025-05-24T12:34:40Z"
  },
  {
    "title": "CZ Slams WSJ For Anti-Crypto ‘Hit Piece’, Denies Being WLFI’s ‘Fixer’",
    "description": "Binance co-founder and former CEO, Changpeng Zhao, has accused The Wall Street Journal (WSJ) of targeting him and the crypto industry, alleging that “forces” in the US are attempting to hinder the country’s effort to develop the sector. Related Reading: Trump…",
    "link": "https://bitcoinist.com/cz-slams-wsj-for-anti-crypto-hit-piece-denies-being-wlfis-fixer/",
    "timestamp": "2025-05-24T12:30:49Z"
  },
  {
    "title": "Trump’s latest tariff threats seem to pour cold water hopes for EU-US deal",
    "description": "But US Treasury Secretary Scott Bessent said Trump's latest threats should \"light a fire under the EU\" to offer more trade concessions.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/trumps-latest-tariff-threats-pour-cold-water-on-eu-us-trade-deal-hopes/",
    "timestamp": "2025-05-24T12:30:20Z"
  },
  {
    "title": "A Living Nightmare: My Family Was Destroyed by a Weaponized Government Under the Biden Regime",
    "description": "This article originally appeared on Loomered.com and was republished with permission.\nThe post A Living Nightmare: My Family Was Destroyed by a Weaponized Government Under the Biden Regime appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/living-nightmare-my-family-was-destroyed-weaponized-government/",
    "timestamp": "2025-05-24T12:30:04Z"
  },
  {
    "title": "The Big, Beautiful Republican Shrug",
    "description": "Republicans routinely criticized Democrats for rushing bills through Congress. Now that they’re in power, they don’t seem to mind.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/read-big-beautiful-bill-1100-pages/682933/",
    "timestamp": "2025-05-24T12:30:00Z"
  },
  {
    "title": "While Trump overhauls FEMA, Mississippi tornado survivors await assistance",
    "description": "The delays could provide a glimpse into what's in store around the country as the summer storm season arrives and the Federal Emergency Management Agency is mired in turmoil.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_ba5be947-88f8-5b60-b621-7a505234e5a2.html",
    "timestamp": "2025-05-24T12:30:00Z"
  },
  {
    "title": "Joe Exotic’s deported hubby fears for his life, pleads for President Trump to free him and the ‘Tiger King’",
    "description": "\"Tiger King\" Joe Exotic's husband, Jorge Flores Maldonado, told The Post he fears for his life in his native Mexico after getting deported -- and pleaded for President Donald Trump's help.",
    "link": "https://nypost.com/2025/05/24/us-news/tiger-king-joe-exotics-husband-pleads-to-return-to-us/",
    "timestamp": "2025-05-24T12:30:00Z"
  },
  {
    "title": "Leaked Video: Trump Does Shock Assassination Joke At Crypto Memecoin Gala",
    "description": "Leaked videos on social media show President Donald Trump doing a shock assassination joke, ad-libbing a line during a speech at his crypto investors’ gala..\nThe post Leaked Video: Trump Does Shock Assassination Joke At Crypto Memecoin Gala first appeared on …",
    "link": "https://www.mediaite.com/media/news/leaked-video-trump-does-shock-assassination-joke-at-crypto-memecoin-gala/",
    "timestamp": "2025-05-24T12:29:24Z"
  },
  {
    "title": "Touted as the world’s most exclusive invite, Trump’s crypto dinner served shockingly bad food - see the menu",
    "description": "Donald Trump's exclusive crypto gala, intended for top meme coin purchasers, left attendees disappointed due to subpar food and limited interaction with the former president. The event, funded by $148 million in token purchases, drew criticism for inadequate …",
    "link": "https://economictimes.indiatimes.com/news/international/us/touted-as-the-worlds-most-exclusive-invite-trumps-crypto-dinner-served-shockingly-bad-food-see-the-menu/articleshow/121380736.cms",
    "timestamp": "2025-05-24T12:28:52Z"
  },
  {
    "title": "Stumblebum's Legacy",
    "description": "\"Every time I watch The View, I become even more misogynistic.\" — Laura Loomer. Saint Jake Tapper.Bad as it was, “Joe Biden,” the figment president, was merely one manifestation of a nation made mad by power-seeking demons, real-live, ill-intentioned human be…",
    "link": "https://freerepublic.com/focus/f-chat/4318837/posts",
    "timestamp": "2025-05-24T12:27:05Z"
  },
  {
    "title": "Russia And Ukraine Swap Hundreds More Prisoners, Hours After Massive Attack On Kyiv",
    "description": "“We expect more to come tomorrow,” Zelenskyy said on his official Telegram channel.",
    "link": "https://www.huffpost.com/entry/russia-ukraine-swap-hundreds-prisoners-hours-after-massive-attack-kyiv_n_6831b5f1e4b0ca4a5f56bfa3",
    "timestamp": "2025-05-24T12:20:21Z"
  },
  {
    "title": "Hyperliquid trader James Wynn goes ‘all-in’ on $1.25B Bitcoin Long",
    "description": "Well-known Hyperliquid trader James Wynn has increased his 40x leverage long Bitcoin bet to $1.25 billion after closing his $PEPE position for a $25.2 million profit.On May 24, Lookonchain reported that Wynn entered an 11,588 BTC position with an average entr…",
    "link": "https://cointelegraph.com/news/james-wynn-bitcoin-leverage-position-hyperliquid",
    "timestamp": "2025-05-24T12:18:53Z"
  },
  {
    "title": "Fate of $20 Billion US Home Solar Market Lies in GOP Senate Hands",
    "description": "House tax bill would gut the rooftop solar industry, executives warn.",
    "link": "https://financialpost.com/pmn/business-pmn/fate-of-20-billion-us-home-solar-market-lies-in-gop-senate-hands",
    "timestamp": "2025-05-24T12:18:00Z"
  },
  {
    "title": "Prove citizenship to vote? For some married women, it might not be so easy. (Washington Post)",
    "description": "Washington Post:\nProve citizenship to vote?  For some married women, it might not be so easy.  —  Legislation in Texas, part of a broad GOP push led by President Donald Trump to require voters to show proof of U.S. citizenship, is expected to go before the st…",
    "link": "https://www.memeorandum.com/250524/p11",
    "timestamp": "2025-05-24T12:15:03Z"
  },
  {
    "title": "New Olympics-Style Games Will Let Contestants Dope Up on as Many Steroids and Drugs as They Want",
    "description": "A Donald Trump Jr. and Peter Thiel-backed Olympics-style sporting event invites athletes to get as doped up on as many drugs as they want to compete. The so-called Enhanced Games, which are set to kick off exactly a year from now at Resorts World on the Las V…",
    "link": "https://futurism.com/neoscope/olympics-style-games-ehanced-drugs",
    "timestamp": "2025-05-24T12:15:03Z"
  },
  {
    "title": "Nvidia CEO calls Trump's re-industrialization policies 'visionary'",
    "description": "The leading chipmaker announced a partnership with a group of Swedish businesses to develop AI infrastructure in Sweden.",
    "link": "https://www.cnbc.com/2025/05/24/nvidia-ceo-calls-trumps-re-industrialization-policies-visionary.html",
    "timestamp": "2025-05-24T12:13:42Z"
  },
  {
    "title": "If Donald Trump wants his speech at West Point to be memorable, here’s what he should say",
    "description": "President Donald Trump will deliver the commencement address to the class of 2025 at the United States Military Academy at West Point.",
    "link": "https://biztoc.com/x/2e0e14b666de2ce6",
    "timestamp": "2025-05-24T12:12:42Z"
  },
  {
    "title": "Russia strikes Kyiv as hundreds more POWs exchanged with Ukraine",
    "description": "Russia's defence ministry said each side exchanged 307 prisoners of war on Saturday via Belarus, a Kremlin ally.",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-prisoners-war-exchange-day-2-strikes-5151176",
    "timestamp": "2025-05-24T12:10:00Z"
  },
  {
    "title": "Trump shocks markets by touting US-Steel-Nippon deal",
    "description": "US President Donald Trump has announced a partnership between United States Steel Corp and Nippon Steel Corp of Japan, shocking markets with an agreement the he said would keep the once-iconic American firm in the US but otherwise providing no specifics.",
    "link": "https://www.bangkokpost.com/business/general/3033470/trump-shocks-markets-by-touting-us-steel-nippon-deal",
    "timestamp": "2025-05-24T12:08:00Z"
  },
  {
    "title": "Alibaba Chair Says Asian Firms Can Look For Growth Outside of US",
    "description": "Alibaba Group Holding Ltd. Chairman Joe Tsai said Asian companies can look to inter-Asia opportunities and the European market for growth as tensions between Washington and Beijing persist.",
    "link": "https://www.livemint.com/companies/news/alibaba-chair-says-asian-firms-can-look-for-growth-outside-of-us-11748088261372.html",
    "timestamp": "2025-05-24T12:04:20Z"
  },
  {
    "title": "King Charles' Canada Tour Has Donald Trump Hanging Over It",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKing Charles III will open the Canadian Parliament next week in a historic ceremony against the backdrop of President Donald Trump's threats to annex America's northern neighbor.\nCanada recognizes Charles, 76,…",
    "link": "https://biztoc.com/x/d79f7ca30678bc47",
    "timestamp": "2025-05-24T12:01:13Z"
  },
  {
    "title": "Trump threatens new 50% tariffs on EU and 25% on Apple",
    "description": "The stock market took a drop after President Donald Trump threatened to slap the European Union with a 50% tax on imports and tech giant Apple with a 25% tariff on smartphones. In another political battle, a federal judge blocked the Trump administration’s pl…",
    "link": "https://biztoc.com/x/db0828eec2479d78",
    "timestamp": "2025-05-24T12:01:01Z"
  },
  {
    "title": "How Trump’s megabill transfers wealth in the US",
    "description": "It took intense lobbying from President Donald Trump, an all-nighter, and a vote on a bill for which many people did not yet have a clear grasp of the final changes, but House Republicans got it done this week. They passed their version of the “one big, beaut…",
    "link": "https://www.cnn.com/2025/05/24/politics/house-tax-spending-cuts-bill-explained",
    "timestamp": "2025-05-24T12:00:50Z"
  },
  {
    "title": "For Your Weekend Listening",
    "description": "The latest episode of Trial Balloon is live for members. Republicans pass a massive tax bill in the dead of night. And Donald Trump holds a dinner for buyers of Trump coin. . You’ll get",
    "link": "https://politicalwire.com/2025/05/24/for-your-weekend-listening-72/",
    "timestamp": "2025-05-24T12:00:47Z"
  },
  {
    "title": "Grading Trump: Where the president stands in the eyes of Americans four months into his second term",
    "description": "Trump's legislative success contrasts with low approval ratings on economic issues like tariffs and inflation overshadowing his presidency's achievements.",
    "link": "https://www.foxnews.com/politics/where-president-stands-eyes-americans-four-months-his-second-term",
    "timestamp": "2025-05-24T12:00:14Z"
  },
  {
    "title": "Marlon Wayans weighs in on controversial Tony Hinchcliffe joke, which politician could be a comic",
    "description": "Comedian Marlon Wayans talks about the role of comedians in pushing boundaries, defending Tony Hinchcliffe's controversial joke amid cultural sensitivities.",
    "link": "https://www.foxnews.com/media/marlon-wayans-weighs-controversial-tony-hinchcliffe-joke-which-politician-could-comic",
    "timestamp": "2025-05-24T12:00:12Z"
  },
  {
    "title": "Images Show Trump Tower Saudi Arabia Planned for 2029",
    "description": "The new tower is to be constructed in the western coastal city of Jeddah.",
    "link": "https://www.newsweek.com/trump-tower-saudi-arabia-images-2029-2076193",
    "timestamp": "2025-05-24T12:00:03Z"
  },
  {
    "title": "How On is taking on Nike and Adidas in the sneaker race",
    "description": "Nike and Adidas have long dominated the global sportswear market, but Swiss sneaker company On is quickly gaining ground.",
    "link": "https://www.cnbc.com/2025/05/24/on-running-shoes-nike-adidas.html",
    "timestamp": "2025-05-24T12:00:02Z"
  },
  {
    "title": "King Charles' Canada Tour Has Donald Trump Hanging Over It",
    "description": "King Charles will walk a diplomatic tightrope as he opens Canada's Parliament for the first time, 48 years after his mother.",
    "link": "https://www.newsweek.com/king-charles-canada-tour-donald-trump-2074443",
    "timestamp": "2025-05-24T12:00:02Z"
  },
  {
    "title": "Kiev’s drone raids meant to derail peace process – Moscow",
    "description": "Russia’s commitment to peace dialogue remains unchanged, the Russian Foreign Ministry has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618094-ukraine-drone-raids-talks/",
    "timestamp": "2025-05-24T11:59:22Z"
  },
  {
    "title": "How Donald Trump's new $175 billion Golden Dome will work following chilling warning to rest of the world",
    "description": "This is how Donald Trump's new $175 billion Golden Dome proposal will work, why Trump has announced it and reactions from other countries.",
    "link": "https://www.ladbible.com/news/us-news/trump-what-is-golden-dome-defense-system-688499-20250524",
    "timestamp": "2025-05-24T11:59:18Z"
  },
  {
    "title": "Russia launches one of its biggest aerial attacks on Kyiv since the start of the war",
    "description": "Russia has launched a 'massive' drone and ballistic missiles attack on the Ukrainian capital overnight, which officials have described as one of the largest of the war.",
    "link": "https://www.abc.net.au/news/2025-05-24/russia-launches-aerial-attack-kyiv/105333044",
    "timestamp": "2025-05-24T11:52:45Z"
  },
  {
    "title": "Trump's top meme coin investors visit White House - ABC News",
    "description": "Trump's top meme coin investors visit White HouseABC News Who Won a Seat at Trump’s Crypto Dinner?The New York Times Donald Trump May Have Broken Federal Law at Meme Coin Dinner: AttorneyNewsweek Influencer who attended Trump’s memecoin dinner says he got a ‘…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177721447",
    "timestamp": "2025-05-24T11:52:37Z"
  },
  {
    "title": "Springsteen Drops New EP And It's A Middle Finger To Trump",
    "description": "If Donald Trump thought that yelling threats on his social media platform at Bruce Springsteen was going to intimidate him, Felon 47 has probably gotten a rude awakening.\nApparently, the rock superstar’s criticisms of Trump during while touring in England hur…",
    "link": "https://crooksandliars.com/2025/05/springsteen-drops-new-ep-and-its-middle",
    "timestamp": "2025-05-24T11:52:24Z"
  }
]