[
  {
    "title": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct | CNN",
    "description": "Chicago Mayor Brandon Johnson on Saturday signed an executive order directing city police to investigate and document alleged misconduct by federal immigration officers with an eye toward prosecution.",
    "link": "https://www.cnn.com/2026/01/31/us/chicago-ice-misconduct-executive-order",
    "timestamp": "2026-01-31T21:53:25Z"
  },
  {
    "title": "Treasury severs ties with federal consulting giant over Trump tax return leak",
    "description": "Booz Allen 'failed to implement adequate safeguards to protect sensitive data'",
    "link": "https://www.wnd.com/2026/01/treasury-severs-ties-federal-consulting-giant-trump-tax/",
    "timestamp": "2026-01-31T21:51:24Z"
  },
  {
    "title": "'Unsubscribe' and 'opt out': A new Big Tech boycott to protest ICE starts February 1",
    "description": "Small businesses struggled to observe the national shutdown to protest ICE. Here's why a boycott of companies like OpenAI and Amazon could be easier and more effective.",
    "link": "https://www.businessinsider.com/tech-ai-boycott-february-protest-ice-scott-galloway-2026-2",
    "timestamp": "2026-01-31T21:46:08Z"
  },
  {
    "title": "Iranian, Egyptian presidents call for diplomacy to resolve regional issues",
    "description": "TEHRAN/CAIRO, Jan. 31 (Xinhua) -- Iranian President Masoud Pezeshkian and his Egyptian counterpart Abdel-Fattah al-Sisi on Saturday discussed in a phone call the necessity of resorting to diplomacy for the resolution of regional issues, amid rising Iran-U.S. …",
    "link": "https://www.thestar.com.my/news/world/2026/02/01/iranian-egyptian-presidents-call-for-diplomacy-to-resolve-regional-issues",
    "timestamp": "2026-01-31T21:45:00Z"
  },
  {
    "title": "JUST IN: President Trump Instructs DHS Chief Noem to be “Forceful” Against Far-Left Rioters Who Attack Federal Property",
    "description": "President Trump on Saturday instructed Department of Homeland Security Chief Kristi Noem to be “forceful” against far-left rioters who attack federal property.\nThe post JUST IN: President Trump Instructs DHS Chief Noem to be “Forceful” Against Far-Left Rioter…",
    "link": "https://www.thegatewaypundit.com/2026/01/just-president-trump-instructs-dhs-chief-noem-be/",
    "timestamp": "2026-01-31T21:40:04Z"
  },
  {
    "title": "Trump Urges ICE to Be ‘Very Forceful’ Defending Buildings Against ‘Anarchists’ — But Will Only Send Help If Local Politicians Say ‘PLEASE’",
    "description": "President Donald Trump instructed ICE and other federal agents to be \"very forceful\" in defending federal buildings against anti-ICE \"anarchists\"\nThe post Trump Urges ICE to Be ‘Very Forceful’ Defending Buildings Against ‘Anarchists’ — But Will Only Send Help…",
    "link": "https://www.mediaite.com/politics/trump-urges-ice-to-be-very-forceful-defending-buildings-against-anarchists-but-will-only-send-help-if-local-politicians-say-please/",
    "timestamp": "2026-01-31T21:38:56Z"
  },
  {
    "title": "Shutdown expected to last until at least Tuesday as Jeffries says Democrats won’t help pass funding bill | CNN Politics",
    "description": "The federal government likely won’t reopen until at least Tuesday, when the House is expected to hold critical votes on a must-pass funding package, as Minority Leader Hakeem Jeffries warns Republicans they can’t rely on Democrats.",
    "link": "https://www.cnn.com/2026/01/31/politics/government-funding-bill-shutdown-fears",
    "timestamp": "2026-01-31T21:36:29Z"
  },
  {
    "title": "Is America a Nation of Citizens, or a Territory of ‘People’?",
    "description": "Is America for its citizens, or is it for its “people”? That’s the biggest question on my mind right now. It may sound like a semantic argument, but it isn’t. It is a foundational question, and thanks to constitutional ambiguity, decades of legislative and ju…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364911/posts",
    "timestamp": "2026-01-31T21:36:12Z"
  },
  {
    "title": "Trump vows not to help blue cities with riots, instructs ICE and Border Patrol to protect federal property",
    "description": "President Donald Trump says the federal government will not assist blue cities with riot response unless requested, while ordering ICE and Border Patrol to aggressively protect federal property.",
    "link": "https://www.foxnews.com/politics/trump-vows-not-help-blue-cities-riots-instructs-ice-border-patrol-protect-federal-property",
    "timestamp": "2026-01-31T21:33:41Z"
  },
  {
    "title": "Watchdog alleges Netflix coordinated with FBI to promote left-wing narratives",
    "description": "Company 'appears to have an outsized role in socially engineering millions of Americans into a predisposition to accept preferred left-wing ideological dogma'",
    "link": "https://www.wnd.com/2026/01/watchdog-alleges-netflix-coordinated-fbi-promote-left-wing/",
    "timestamp": "2026-01-31T21:31:52Z"
  },
  {
    "title": "Crypto Fear Gauge Stuck In The Red — Analysts Say That’s Good News",
    "description": "Reports say social and on-chain mood around crypto has dropped to a yearly low, a sign that fear is running high among many investors. Santiment’s social-data read shows negative chatter spiking and the balance of bearish to bullish comments tilting heavily t…",
    "link": "https://bitcoinist.com/crypto-fear-gauge-stuck-in-the-red-analysts-say-thats-good-news/",
    "timestamp": "2026-01-31T21:30:49Z"
  },
  {
    "title": "Sanctuary cities are sanctuaries for criminals",
    "description": "In recent days, it has become clear that the Battle of Minneapolis is, at its core, a battle over the continued existence of sanctuary cities. During the 2024 presidential campaign, President Donald Trump promised to pursue “the worst of the worst” of illegal…",
    "link": "https://freerepublic.com/focus/f-news/4364909/posts",
    "timestamp": "2026-01-31T21:28:52Z"
  },
  {
    "title": "No Frauds? Nicki Minaj’s Gold Trump Card Is ‘Worthless’ According To White House Insider",
    "description": "Nicki Minaj may have gotten the attention she desperately wanted from buddying up to Donald Trump, but a White House insider is calling cap on her gold card flexing. After leaving her pinkprint all across Trump’s hindparts, the “No Frauds” rapper made sure to…",
    "link": "https://bossip.com/4330735/nicki-minaj-gold-trump-card-is-worthless/",
    "timestamp": "2026-01-31T21:28:28Z"
  },
  {
    "title": "Judge orders 5-year-old Liam Ramos and his dad released from ICE detention",
    "description": "A judge on Saturday ordered the U.S. government to release by Tuesday a 5-year-old boy and his father from a Texas detention center where they were taken after being detained by immigration officers in a Minneapolis suburb last month.",
    "link": "https://www.wpxi.com/news/national/judge-orders-5-year-old-liam-ramos-his-dad-released-ice-detention/XZSE6Y4OYRDLLKDBUZGSO6G7YE/",
    "timestamp": "2026-01-31T21:14:20Z"
  },
  {
    "title": "Biden Judge Rejects Minnesota’s Request To End ICE Operation",
    "description": "A judge appointed by former President Joe Biden rejected the Minnesota government’s request to end federal immigration operations in the state Saturday.",
    "link": "https://dailycaller.com/2026/01/31/judge-kate-menendez-declines-lawsuit-ending-immigration-customs-enforcement-operation-metro-surge-minnesota/",
    "timestamp": "2026-01-31T21:12:52Z"
  },
  {
    "title": "Heavier Than Usual Police Presence Reported In Iran",
    "description": "Security forces have flooded the streets of Tehran and other major Iranian cities as the regime braces for potential unrest amid rising tensions with the US.",
    "link": "https://dailycaller.com/2026/01/31/iran-heavy-police-presence-tehran-trump-irgc-tensions/",
    "timestamp": "2026-01-31T21:10:09Z"
  },
  {
    "title": "Trump Admin Roasted Hard for Taking to Recruiting Lawyers on Twitter: ‘Have They Tried Putting an Ad on Craigslist?’",
    "description": "Donald Trump's administration is in need of prosecutors to help his \"anti-crime agenda\" and they're being mocked for taking to X to fill the positions.\nThe post Trump Admin Roasted Hard for Taking to Recruiting Lawyers on Twitter: ‘Have They Tried Putting an …",
    "link": "https://www.mediaite.com/media/news/trump-admin-roasted-hard-for-taking-to-recruiting-lawyers-on-twitter-have-they-tried-putting-an-ad-on-craigslist/",
    "timestamp": "2026-01-31T21:06:44Z"
  },
  {
    "title": "Jacob Frey says Minneapolis was 'never going to agree' to enforce federal immigration laws",
    "description": "Minneapolis Mayor Jacob Frey told The New York Times on Saturday that the city was \"never going to agree\" to enforce federal immigration laws, and that it's not the city's job to do so.",
    "link": "https://www.foxnews.com/media/jacob-frey-says-minneapolis-never-going-agree-enforce-federal-immigration-laws",
    "timestamp": "2026-01-31T21:06:21Z"
  },
  {
    "title": "Binance Not Responsible for Worsening Market Crash: CZ",
    "description": "Binance founder Changpeng Zhao, aka CZ, has dismissed claims that the exchange is complicit in major market crashes, especially the infamous one in October last year that wiped out hundreds of billions of dollars. He stated that these claims are “far-fetched”…",
    "link": "https://zycrypto.com/binance-not-responsible-for-worsening-market-crash-cz/",
    "timestamp": "2026-01-31T21:02:56Z"
  },
  {
    "title": "Trump’s ‘cash to you’ health plan slammed as a joke as premiums soar - NewsBreak",
    "description": "President Donald Trump is selling his new “Great Healthcare Plan” as a way to lower costs and send “cash to you” at a moment when premiums are spiking for",
    "link": "https://www.newsbreak.com/share/4470269520322-trump-s-cash-to-you-health-plan-slammed-as-a-joke-as-premiums-soar?s=a2&amp;share_destination_id=MzM1OTg0NTg4LTE3Njk4OTMyODY4MDk%3D&amp;pd=0MjkwG6Y&amp;hl=en_US&amp;send_time=1769893286&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.4.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-31T21:01:53Z"
  },
  {
    "title": "STI sets new records above 4,900, JPMorgan lifts 2026 target to 6,000",
    "description": "The rally also extended beyond blue chips to include smaller companies on the SGX. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/sti-sets-new-records-above-4900-jpmorgan-lifts-2026-target-to-6000",
    "timestamp": "2026-01-31T21:01:32Z"
  },
  {
    "title": "ASX 200 energy shares lead the market as oil and uranium prices spike",
    "description": "Brent and WTI crude oil prices are on track for their best month of price growth since July 2023.\nThe post ASX 200 energy shares lead the market as oil and uranium prices spike appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2026/02/01/asx-200-energy-shares-lead-the-market-as-oil-and-uranium-prices-spike-week-5-2026/",
    "timestamp": "2026-01-31T21:00:00Z"
  },
  {
    "title": "Iraq Shia bloc reiterates support for al-Maliki despite Trump’s threats",
    "description": "The Coordination Framework said that selecting a PM is an internal constitutional matter.",
    "link": "https://www.aljazeera.com/news/2026/1/31/iraq-shia-bloc-reiterates-support-for-al-maliki-despite-trumps-threats",
    "timestamp": "2026-01-31T20:57:55Z"
  },
  {
    "title": "AOC, Elon Musk, Bill Gates and More Respond to Latest Epstein Files Release: ‘We Need Them All’",
    "description": "The release of three million more pages of documents pertaining to the Epstein files prompted a variety of reactions from political leaders, Elon Musk, and victims of Epstein and his associates. Representative Alexandria Ocasio-Cortez cautioned supporters the…",
    "link": "https://www.thewrap.com/media-platforms/politics/alexandria-ocasio-cortez-elon-musk-bill-gates-respond-epstein-files/",
    "timestamp": "2026-01-31T20:54:38Z"
  },
  {
    "title": "US oil companies going to Venezuela – Trump",
    "description": "US President Donald Trump has said he has “major oil companies going to Venezuela now” following reform of the country’s hydrocarbons policy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631813-trump-us-oil-companies-going-to-venezuela/",
    "timestamp": "2026-01-31T20:53:14Z"
  },
  {
    "title": "Trump thinks a weaker dollar is great, but the U.S. needs a stable currency as national debt heads toward $40 trillion, former Fed president says",
    "description": "\"And when you have that much debt, I think stability of the currency probably trumps exports.\"",
    "link": "https://fortune.com/2026/01/31/national-debt-trump-weak-dollar-stable-currency-40-trillion-former-fed-president-says/",
    "timestamp": "2026-01-31T20:48:08Z"
  },
  {
    "title": "Prepare for the Leftist Tantrums: the New 'Melania' Documentary Is Hitting Amazing Numbers",
    "description": "My colleague Bob Hoge had the good fortune to attend a screening of the new \"Melania\" documentary on Thursday in the...",
    "link": "https://redstate.com/nick-arama/2026/01/31/prepare-for-the-leftist-tantrums-the-melania-documentary-is-hitting-amazing-numbers-n2198711",
    "timestamp": "2026-01-31T20:47:36Z"
  },
  {
    "title": "Biden’s push for renewables is funding Trump’s push to ‘drill, baby, drill’",
    "description": "Democrat 'had an agenda to decarbonize without asking the important questions of reliability and affordability'",
    "link": "https://www.wnd.com/2026/01/bidens-push-renewables-is-funding-trumps-push-drill/",
    "timestamp": "2026-01-31T20:47:00Z"
  },
  {
    "title": "Kash Patel confirms FBI had 'probable cause' for Fulton County election hub raid",
    "description": "FBI Director Kash Patel told \"Saturday in America\" that investigators had probable cause to execute a warrant at a Georgia election hub after an \"extensive\" investigation.",
    "link": "https://www.foxnews.com/media/kash-patel-confirms-fbi-had-probable-cause-fulton-county-election-hub-raid",
    "timestamp": "2026-01-31T20:46:55Z"
  },
  {
    "title": "Stephen A Smith defends Don Lemon, says arrest violates First Amendment",
    "description": "Stephen A. Smith spoke out after Don Lemon’s arrest, saying it went against the First Amendment and that Lemon’s decades of journalism experience should have been respected.",
    "link": "https://www.foxnews.com/sports/stephen-a-smith-defends-don-lemon-says-arrest-violates-first-amendment",
    "timestamp": "2026-01-31T20:46:40Z"
  },
  {
    "title": "Witkoff says talks with Russian envoy were 'productive and constructive' amid Trump admin's peace push",
    "description": "Trump envoy reports \"productive\" meetings with Russian envoy on Ukraine peace deal, days after touting progress made toward peace after years of war.",
    "link": "https://www.foxnews.com/world/witkoff-says-talks-russian-envoy-were-productive-constructive-amid-trump-admins-peace-push",
    "timestamp": "2026-01-31T20:46:02Z"
  },
  {
    "title": "24% of hit documentary ‘Melania’ attendees subscribe to Apple TV",
    "description": "The hit documentary \"Melania,\" distributed by Amazon MGM Studios, has surprised observers with its strong opening weekend performance…\nThe post 24% of hit documentary ‘Melania’ attendees subscribe to Apple TV appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2026/01/31/24-of-hit-documentary-melania-attendees-subscribe-to-apple-tv/",
    "timestamp": "2026-01-31T20:44:23Z"
  },
  {
    "title": "New Epstein Files Appear to Show Andrew Mountbatten-Windsor Crouched Over Woman on Floor",
    "description": "Also in the Epstein files dump: An email exchange in which Jeffrey Epstein was seemingly invited to dinner at Buckingham Palace.",
    "link": "https://www.vanityfair.com/style/story/epstein-files-prince-andrew-photos",
    "timestamp": "2026-01-31T20:39:38Z"
  },
  {
    "title": "Trump says Gulf allies kept in dark as US negotiates with Iran: 'Cant' tell them the plan'",
    "description": "President Donald Trump says U.S. cannot share military plans with Gulf allies during Iran negotiations, as Saudi Arabia restricts airspace access.",
    "link": "https://www.foxnews.com/politics/trump-keeps-gulf-allies-dark-iran-military-plans-we-cant-tell-them",
    "timestamp": "2026-01-31T20:33:13Z"
  },
  {
    "title": "NY attorney general opposes stay of ruling invalidating Sarcone appointment",
    "description": "Attorney General Letitia James is opposing the Justice Department's request for a stay pending an appeal of a judge's decision invalidating two subpoenas...",
    "link": "https://www.timesunion.com/capitol/article/ny-attorney-general-opposes-stay-ruling-21326178.php",
    "timestamp": "2026-01-31T20:32:08Z"
  },
  {
    "title": "Bitcoin crashes below $80K again as investors panic",
    "description": "The cryptocurrency market suffered a massive blow on Jan. 31 as Bitcoin (BTC) crashed below $80,000. BTC fell 5% in a day to trade at $78,479.21 at the time ...",
    "link": "https://www.thestreet.com/crypto/markets/bitcoin-crashes-below-80k-again-as-investors-panic",
    "timestamp": "2026-01-31T20:31:38Z"
  },
  {
    "title": "Melania Is the Nightmare End Point of Celebrity Docs",
    "description": "Brett Ratner’s ‘Melania’ is the nightmare end point of celebrity docs. This is what we get for putting up with so many subject-approved portraits of famous people.",
    "link": "http://www.vulture.com/article/melania-review-the-nightmare-end-point-of-celebrity-docs.html",
    "timestamp": "2026-01-31T20:30:11Z"
  },
  {
    "title": "AI Boom Is Triggering a Loan Meltdown for Software Companies: Credit Weekly",
    "description": "Amid broad euphoria in credit markets, one type of debt is facing growing fear.",
    "link": "https://www.livemint.com/companies/ai-boom-is-triggering-a-loan-meltdown-for-software-companies-credit-weekly-11769891070757.html",
    "timestamp": "2026-01-31T20:24:30Z"
  },
  {
    "title": "AI Boom Is Triggering a Loan Meltdown for Software Companies: Credit Weekly",
    "description": "Amid broad euphoria in credit markets, one type of debt is facing growing fear.",
    "link": "https://financialpost.com/pmn/business-pmn/ai-boom-is-triggering-a-loan-meltdown-for-software-companies-credit-weekly",
    "timestamp": "2026-01-31T20:22:58Z"
  },
  {
    "title": "US judge declines to halt immigration surge in Minnesota amid protests",
    "description": "Minneapolis mayor criticises judge's ruling, calling the Trump administration's immigration crackdown 'an invasion'.",
    "link": "https://www.aljazeera.com/news/2026/1/31/us-judge-declines-to-halt-immigration-surge-in-minnesota-amid-protests",
    "timestamp": "2026-01-31T20:18:12Z"
  },
  {
    "title": "(LETTERS) Views on ICE, Venezuela effort, obesity tax and abortion",
    "description": "Oil City News publishes letters, cartoons and opinions as a public service. The content does not necessarily reflect the opinions of Oil City News or its",
    "link": "http://oilcity.news/opinion/2026/01/31/letters-views-on-ice-venezuela-effort-obesity-tax-and-abortion/",
    "timestamp": "2026-01-31T20:11:26Z"
  },
  {
    "title": "'Melania' Doc Lands Brutal 6% Score On Rotten Tomatoes: 'Pure, Endless Hell\"",
    "description": "The first reviews for the exorbitant $75 million project are in, and critics didn't hold back.",
    "link": "https://www.huffpost.com/entry/melania-documentary-rotten-tomatoes_n_697e1225e4b0b1de95c51a13",
    "timestamp": "2026-01-31T20:10:30Z"
  },
  {
    "title": "What is the nose ring Theory? Woman's viral video sparks raging online debate",
    "description": "It all began on Tuesday, August 19, 2025, after X user Desiree (@DesireeAmerica4) shared a post with a video of a TikToker defending the piercing. In the clip, the woman claimed comments criticizing the accessory were doing the opposite of what it was intende…",
    "link": "https://freerepublic.com/focus/f-chat/4364890/posts",
    "timestamp": "2026-01-31T20:07:46Z"
  },
  {
    "title": "Trump’s Fed pick Kevin Warsh is “not nervous” about Bitcoin while plotting a digital dollar takeover",
    "description": "President Donald Trump announced he will nominate former Federal Reserve Governor Kevin Warsh to lead the US central bank. In a Jan. 30 post on Truth Social, the president confirmed the selection, writing: “I have known Kevin for a long period of time, and ha…",
    "link": "https://cryptoslate.com/trumps-fed-pick-kevin-warsh-views-bitcoin-as-mere-software-while-plotting-a-major-digital-dollar-takeover/",
    "timestamp": "2026-01-31T20:05:47Z"
  },
  {
    "title": "Tommy Tuberville says Super Bowl is 'getting more and more woke' with Bad Bunny's halftime show",
    "description": "Sen. Tommy Tuberville plans to avoid the Super Bowl halftime show, dismissing Bad Bunny as too “woke\" and saying the event has changed for the worse.",
    "link": "https://www.foxnews.com/sports/tommy-tuberville-says-super-bowl-getting-more-more-woke-bad-bunnys-halftime-show",
    "timestamp": "2026-01-31T20:04:16Z"
  },
  {
    "title": "Bitcoin dips below $78,000 as market digests silver sell-off, Trump's Fed chair pick",
    "description": "Bitcoin and Ethereum plunged following wide swings in the commodities market.",
    "link": "https://www.cnbc.com/2026/01/31/bitcoin-dips-below-78000-after-silver-selloff.html",
    "timestamp": "2026-01-31T19:59:22Z"
  },
  {
    "title": "Melania Trump Boasts Early Achievements of ‘Melania’ Documentary: ‘#1 Highest Opening In 10 Yrs (Doc), Loved By All – “A” CinemaScore’",
    "description": "Melania Trump took to X on Saturday morning to flaunt the early achievements of her new documentary, “Melania,” which opened on Friday. The First Lady posted that “Melania” is projecting the best weekend debut in 10 years for a documentary (excluding concert …",
    "link": "https://variety.com/2026/film/news/melania-trump-doc-highest-opening-cinemascore-1236647159/",
    "timestamp": "2026-01-31T19:55:46Z"
  },
  {
    "title": "Donald Trump Erupts in Late-Night Rant to Defend Kristi Noem After Deadly Minneapolis Shootings Spark Calls for Her to be Fired",
    "description": "President Donald Trump has issued a late-night Truth Social post defending Homeland Security Secretary Kristi Noem.",
    "link": "https://radaronline.com/p/donald-trump-erupts-late-night-rant-defend-kristi-noem-minneapolis-shootings/",
    "timestamp": "2026-01-31T19:30:00Z"
  },
  {
    "title": "Peter Kornbluh: Is Trump pushing a new imperialism in Latin America?",
    "description": "Peter Kornbluh speaks to Marc Lamont Hill on Trump’s abduction of Venezuela’s president and fallout for Latin America.",
    "link": "https://www.aljazeera.com/video/upfront/2026/1/31/peter-kornbluh-is-trump-pushing-a-new-imperialism-in-latin-america",
    "timestamp": "2026-01-31T19:30:00Z"
  },
  {
    "title": "Iran: A framework for negotiations with the US is taking shape",
    "description": "“The formation of the structure for negotiations is underway,” said senior Iranian security official Ali Larijani, just hours after Trump’s statements that Iran wants to “strike a deal” with the US\nThe post Iran: A framework for negotiations with the US is ta…",
    "link": "https://en.protothema.gr/2026/01/31/iran-a-framework-for-negotiations-with-the-us-is-taking-shape/",
    "timestamp": "2026-01-31T19:22:24Z"
  },
  {
    "title": "Ousted border chief exposed for unhinged phone call that left lawyers 'deeply unsettled'",
    "description": "Greg Bovino, formally the face of Border Patrol and President Donald Trump’s immigration crackdown before his demotion\r\n earlier this week, was exposed Saturday for making “disparaging remarks” to a Trump-nominated\r\n prosecutor over their Jewish faith, The Ne…",
    "link": "https://www.rawstory.com/msn/greg-bovino/",
    "timestamp": "2026-01-31T19:21:07Z"
  },
  {
    "title": "Jeffrey Epstein Claims Friend of the Trumps Had Sex with Marla Maples' Shoes",
    "description": "Jeffrey Epstein says one of Donald Trump and Marla Maples' friends had a serious foot fetish ... once stealing her high heels and going to town on it! The disgraced financier made the allegation in an email to Deepak Chopra from 2016 -- released as…\n Permalink",
    "link": "https://www.tmz.com/2026/01/31/jeffrey-epstein-trump-friend-sex-with-marla-maple-shoe/",
    "timestamp": "2026-01-31T19:20:04Z"
  },
  {
    "title": "Meidas: Americans Want Trump Out",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump’s terrible Saturday morning as the walls continue to close in and Americans want him removed.",
    "link": "https://littlegreenfootballs.com/article/55249_Meidas-_Americans_Want_Trump_O",
    "timestamp": "2026-01-31T19:14:02Z"
  },
  {
    "title": "Judge Sides With Trump Administration Against Minnesota and Allows ICE Raids to Roll On",
    "description": "A federal judge on Saturday denied Minnesota AG Keith Ellison's attempt to block President Donald Trump's administration's from carrying out more ICE raids\nThe post Judge Sides With Trump Administration Against Minnesota and Allows ICE Raids to Roll On first …",
    "link": "https://www.mediaite.com/politics/judge-sides-with-trump-administration-against-minnesota-and-allows-ice-raids-to-roll-on/",
    "timestamp": "2026-01-31T19:13:34Z"
  },
  {
    "title": "The man behind Trump's hardline immigration policy is from a family of migrants",
    "description": "From a young age, Stephen Miller was campaigning for ideas that were extremely conservative and extremely strange for a teenager from California. Now, he's running Donald Trump's immigration agenda.",
    "link": "https://www.abc.net.au/news/2026-02-01/stephen-miller-donald-trumps-immigration-policy-architect/106272938",
    "timestamp": "2026-01-31T19:11:57Z"
  },
  {
    "title": "Blast in Iran port city kills 1, wounds 14 before Strait of Hormuz naval drill watched by US",
    "description": "An explosion has ripped through an apartment building in the Iranian port city of Bandar Abbas, killing a 4-year-old girl",
    "link": "https://abcnews.go.com/Business/wireStory/blast-iran-port-city-kills-1-wounds-14-129738369",
    "timestamp": "2026-01-31T19:09:41Z"
  },
  {
    "title": "MS NOW's Velshi: Trump Post on Pretti in Confrontation With Officials an 'Effort to Undermine Constitutional Observers and Protesters'",
    "description": "On Saturday’s broadcast of MS NOW’s “Velshi,” host Ali Velshi said that President Donald Trump’s post about the video of Alex Pretti in a confrontation with federal agents is part of a “constant effort to undermine constitutional observers and protesters\nThe …",
    "link": "https://www.breitbart.com/clips/2026/01/31/ms-nows-velshi-trump-post-on-pretti-in-confrontation-with-officials-an-effort-to-undermine-constitutional-observers-and-protesters/",
    "timestamp": "2026-01-31T19:02:03Z"
  },
  {
    "title": "UPDATES...",
    "description": "Files related to Jeffrey Epstein and his onetime girlfriend Ghislaine Maxwell revealed details of his communications with the wealthy and powerful.",
    "link": "https://apnews.com/live/epstein-files-news-updates-1-31-2026",
    "timestamp": "2026-01-31T19:00:12Z"
  },
  {
    "title": "The Elitist Media Still Impose a Dominant Partisan Narrative",
    "description": "Conservatives could look at today’s incredibly fractured media environment and wonder why anyone would need to worry about the elite media, considering their trust numbers... Read More\nThe post The Elitist Media Still Impose a Dominant Partisan Narrative appe…",
    "link": "https://www.dailysignal.com/2026/01/31/the-elitist-media-still-impose-a-dominant-partisan-narrative/",
    "timestamp": "2026-01-31T19:00:00Z"
  },
  {
    "title": "‘Why Are You Yelling!’ Joe Scarborough Gets In Smackdown With Bill Maher Over Trump and Omar",
    "description": "Bill Maher got into a heated smackdown with Joe Scarborough in a discussion of the feud between Rep. Ilhan Omar  (D-MN) and President Donald Trump.\nThe post ‘Why Are You Yelling!’ Joe Scarborough Gets In Smackdown With Bill Maher Over Trump and Omar first app…",
    "link": "https://www.mediaite.com/media/news/why-are-you-yelling-joe-scarborough-gets-in-smackdown-with-bill-maher-over-trump-and-omar/",
    "timestamp": "2026-01-31T18:58:38Z"
  },
  {
    "title": "Trump says Kristi Noem doing ‘great job,’ being attacked because she’s a ‘woman’",
    "description": "President Trump heaped praise on embattled Department of Homeland Security head Kristi Noem after protests nationwide over ICE tactics, and said critics are attacking her because of her gender. “The Radical Left Lunatics, Insurrectionists, Agitators, and Thug…",
    "link": "https://nypost.com/2026/01/31/us-news/trump-says-kristi-noem-is-doing-a-great-job-and-says-shes-being-attacked-because-shes-a-woman/",
    "timestamp": "2026-01-31T18:54:51Z"
  },
  {
    "title": "In The Latest Epstein Files Are Famous Names And New Details About An Earlier Investigation",
    "description": "Newly disclosed government files on Jeffrey Epstein are offering more details about his interactions with the rich and famous.",
    "link": "https://www.huffpost.com/entry/justice-department-jeffrey-epstein-rich-famous_n_697e4e17e4b0b1de95c8d798",
    "timestamp": "2026-01-31T18:53:42Z"
  },
  {
    "title": "It Sure Seems Like Elon Musk Was Excited To Go To Epstein's Island, Emails Show",
    "description": "\"A peaceful island experience is the opposite of what I’m looking for,\" Musk emailed Epstein on Christmas Day 2012.",
    "link": "https://www.huffpost.com/entry/it-sure-seems-like-elon-musk-was-excited-to-go-to-jeffrey-epsteins-island-new-emails-show_n_697e4849e4b0b1de95c8d51b",
    "timestamp": "2026-01-31T18:52:13Z"
  },
  {
    "title": "US judge denies Minnesota bid to suspend immigration sweeps",
    "description": "A US judge delivered a blow Saturday to Minnesota’s bid to force Immigration and Customs Enforcement to suspend its sweeping detention and deportation operation in the state. Federal authorities under US President Donald Trump have swept through Minnesota com…",
    "link": "https://www.digitaljournal.com/world/us-judge-denies-minnesota-bid-to-suspend-immigration-sweeps/article",
    "timestamp": "2026-01-31T18:47:20Z"
  },
  {
    "title": "Iraq’s Shi’ite bloc reaffirms backing for Maliki despite Trump’s warnings",
    "description": "Jan 31 (Reuters) - Iraq’s alliance of Shi’ite political blocs, the Coordination Framework, reaffirmed on Saturday its support for former premier Nouri al-Maliki to lead t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/31/iraq-s-shi-ite-bloc-reaffirms-backing-for-maliki-despite-trump-s-warnings",
    "timestamp": "2026-01-31T18:47:13Z"
  },
  {
    "title": "Donald J. Trump: My Tariffs Have Brought America Back",
    "description": "The ‘experts’ predicted market crashes, massive inflation and recession. They were all wrong.When I imposed historic tariffs on nearly all foreign countries last April, the critics said my policies would cause a global economic meltdown. Instead, they have cr…",
    "link": "https://freerepublic.com/focus/f-news/4364883/posts",
    "timestamp": "2026-01-31T18:47:10Z"
  },
  {
    "title": "Tim Dillon Torches Trump’s ‘Fundamentally Cruel and Inhumane’ ICE Raids: ‘This Is Barbarism’",
    "description": "Comedian Tim Dillon told the MAGA faithful who don't have a problem with \"fundamentally cruel and inhumane\" ICE raids to wake up.\nThe post Tim Dillon Torches Trump’s ‘Fundamentally Cruel and Inhumane’ ICE Raids: ‘This Is Barbarism’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/tim-dillon-torches-trumps-fundamentally-cruel-and-inhumane-ice-raids-this-is-barbarism/",
    "timestamp": "2026-01-31T18:45:05Z"
  },
  {
    "title": "Protesters in Copenhagen rally for Danish veterans after Trump remarks",
    "description": "COPENHAGEN, Jan 31 (Reuters) - Hundreds of Danes gathered outside the U.S. Embassy ‌in Copenhagen on Saturday in support of veterans who said ‌they had been insulted by President Donald Trump's comment that European allies had kept \"off the front lines\" in th…",
    "link": "https://www.thestar.com.my/news/world/2026/02/01/protesters-in-copenhagen-rally-for-danish-veterans-after-trump-remarks",
    "timestamp": "2026-01-31T18:45:00Z"
  },
  {
    "title": "Saudi Arabia warns: If Trump backtracks, it will strengthen the Iranian regime",
    "description": "If US President Donald Trump doesn't follow through on promises to strike Iran, IRGC will be 'emboldened,' Saudi Defense Minister Khalid bin Salman warns.",
    "link": "https://www.israelnationalnews.com/news/421743",
    "timestamp": "2026-01-31T18:45:00Z"
  },
  {
    "title": "Chinese Communist Background Threatens Eric Swalwell's Run for CA Governor",
    "description": "Rep. Eric Swalwell’s (D-CA) dealings with Chinese communists may be coming back to haunt him during his run to be the next governor of the state of California.\nThe post Chinese Communist Background Threatens Eric Swalwell’s Run for CA Governor appeared first …",
    "link": "https://www.breitbart.com/politics/2026/01/31/chinese-communist-background-threatens-eric-swalwells-run-for-ca-governor/",
    "timestamp": "2026-01-31T18:44:03Z"
  },
  {
    "title": "Trump claims Minnesota fraud exceeds $19B, faults Biden administration",
    "description": "President Donald Trump renews attacks on Rep. Ilhan Omar and Gov. Tim Walz over the Minnesota fraud scandal linked to the Somali community.",
    "link": "https://www.foxnews.com/politics/trump-claims-minnesota-fraud-exceeds-19b-faults-biden-administration",
    "timestamp": "2026-01-31T18:42:58Z"
  },
  {
    "title": "Judge declines to halt Trump's Minnesota immigration agent surge",
    "description": "The lawsuit seeks to block or rein in a U.S. Department of Homeland Security operation that sent thousands of immigration agents to Minneapolis-St. Paul, sparking weeks of protests and leading to the killings of two U.S. citizens by federal agents.",
    "link": "https://www.inforum.com/news/minnesota/judge-declines-to-halt-trumps-minnesota-immigration-agent-surge",
    "timestamp": "2026-01-31T18:41:26Z"
  },
  {
    "title": "Blast in Iran port city kills 1, wounds 14 before navy drill",
    "description": "An explosion has ripped through an apartment building in the Iranian port city of Bandar Abbas, killing a 4-year-old girl. Local media footage showed a security force member being carried out by rescuers. The blast happened on Saturday, a day before a planned…",
    "link": "https://apnews.com/article/iran-bandar-abbas-explosion-us-tensions-protests-881d9b0c3e1178242ff150bd8bb0e091",
    "timestamp": "2026-01-31T18:40:03Z"
  },
  {
    "title": "Iran's president accuses Trump, Netanyahu, Europe of provoking unrest: 'They brought them into the streets'",
    "description": "Iran's president accused President Donald Trump, Israeli Prime Minister Benjamin Netanyahu and European leaders of trying to \"fragment society.\"",
    "link": "https://www.foxnews.com/world/irans-president-accuses-trump-netanyahu-europe-provoking-unrest-they-brought-them-streets",
    "timestamp": "2026-01-31T18:35:55Z"
  },
  {
    "title": "Get Out of Our Cities: Another Nationwide Uprising Against ICE",
    "description": "Many thousands of protestors across hundreds of demonstrations around the country on Friday once again took to their streets to tell President Donald Trump’s federal immigration agents a simple message: Get out of our towns and cities.  Friday’s nationwide mo…",
    "link": "https://www.motherjones.com/politics/2026/01/get-out-of-our-cities-another-nationwide-uprising-against-ice/",
    "timestamp": "2026-01-31T18:31:04Z"
  },
  {
    "title": "Trump Blurts Out Boast About Positive Post-Pretti Killing Poll — Of Just Trump Supporters",
    "description": "Trump kicked off a social media posting frenzy by blurting out a boast on a new poll conducted after the killing of Alex Pretti by Trump deportation agents.\nThe post Trump Blurts Out Boast About Positive Post-Pretti Killing Poll — Of Just Trump Supporters fir…",
    "link": "https://www.mediaite.com/media/news/trump-blurts-out-boast-about-positive-post-pretti-killing-poll-of-just-trump-supporters/",
    "timestamp": "2026-01-31T18:30:33Z"
  },
  {
    "title": "India Budget 2026 Live: Nirmala Sitharaman is ready to take the floor for Union Budget at 11 AM",
    "description": "Budget 2026 Live Updates: Finance Minister Nirmala Sitharaman is set to present her record 9th consecutive Union Budget today at 11 am. Centre is likely to announce measures to improve ease of doing business and boost infrastructure spending, while sticking t…",
    "link": "https://m.economictimes.com/news/newsblogs/budget-2026-live-updates-finance-minister-nirmala-sitharaman-union-budget-live-speech-defence-manufacturing-exports-and-pli-key-announcements-takeaways-1-february-latest-news/liveblog/127826872.cms",
    "timestamp": "2026-01-31T18:30:22Z"
  },
  {
    "title": "Trump continues to defend Homan, Noem over immigration enforcement",
    "description": "President Donald Trump took to social media to defend his top administration officials following this week's shakeup in Minnesota.",
    "link": "https://abcnews.go.com/Politics/trump-continues-defend-homan-noem-amid-immigration-enforcement/story?id=129731874",
    "timestamp": "2026-01-31T18:29:01Z"
  },
  {
    "title": "US envoy Witkoff says Ukraine talks with Russia ‘productive’",
    "description": "The talks come just a day before a second round of US-mediated talks between Russia and Ukraine in Abu Dhabi.",
    "link": "https://www.aljazeera.com/news/2026/1/31/us-envoy-witkoff-says-ukraine-talks-with-russia-productive",
    "timestamp": "2026-01-31T18:25:14Z"
  },
  {
    "title": "President Trump: 'Scammer' Ilhan Omar Should Be Jailed over Minnesota's Billions in Fraud",
    "description": "President Donald Trump had a fiery message for Minnesota's Democrat leaders on Saturday, saying the fraud in Minnesota is bigger than initially projected. \nThe post President Trump: ‘Scammer’ Ilhan Omar Should Be Jailed over Minnesota’s Billions in Fraud appe…",
    "link": "https://www.breitbart.com/politics/2026/01/31/president-trump-scammer-ilhan-omar-should-be-jailed-minnesotas-billions-fraud/",
    "timestamp": "2026-01-31T18:21:07Z"
  },
  {
    "title": "Witness told FBI Trump threatened to ‘disappear’ girl and have her ‘whole family killed’",
    "description": "Under penalty of perjury, a witness told the FBI back in 2016 that they had “personally witnessed” President Donald Trump threaten to “disappear” a girl and have her entire family killed, according to a document\r\n released by the Justice Department on Friday.…",
    "link": "https://www.rawstory.com/trump-epstein-2675065475/",
    "timestamp": "2026-01-31T18:16:36Z"
  },
  {
    "title": "DeSantis signals reset with Trump as Florida backs ‘Make America Healthy Again’ plan",
    "description": "Trump and DeSantis rebuild their relationship, as Florida works on its \"Healthy Florida First\" initiative inspired by the \"Make America Healthy Again\" efforts.",
    "link": "https://www.foxnews.com/politics/desantis-signals-reset-trump-florida-backs-make-america-healthy-again-plan",
    "timestamp": "2026-01-31T18:13:55Z"
  },
  {
    "title": "Silver tumbles nearly 19% to ₹3.12 lakh/kg; gold falls ₹3,500 amid dollar rebound",
    "description": "Silver plunges 19% and gold slips 2% in India as a stronger US dollar sparks global profit booking after record highs. January gains stay intact.",
    "link": "https://www.thehindubusinessline.com/markets/gold/silver-tumbles-nearly-19-to-312-lakhkg-gold-falls-3500-amid-dollar-rebound/article70575533.ece",
    "timestamp": "2026-01-31T18:12:45Z"
  },
  {
    "title": "US envoy reports 'constructive' Ukraine talks with Russia",
    "description": "US envoy Steve Witkoff has said he held constructive talks with a Russian envoy in Florida as part of the US drive to end the war in Ukraine.",
    "link": "https://www.rte.ie/news/world/2026/0131/1556157-ukraine-russia/",
    "timestamp": "2026-01-31T18:09:30Z"
  },
  {
    "title": "Pete Buttigieg Torpedoes Fox Host’s Claim Americans ‘Stand’ With Trump Deportation Forces",
    "description": "Pete Buttigieg torpedoed Fox Host Kayleigh McEnany's claim that the American people \"stand\" with Donald Trump's deportation forces.\nThe post Pete Buttigieg Torpedoes Fox Host’s Claim Americans ‘Stand’ With Trump Deportation Forces first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/pete-buttigieg-torpedoes-fox-hosts-claim-americans-stand-with-trump-deportation-forces/",
    "timestamp": "2026-01-31T18:08:58Z"
  },
  {
    "title": "Bitcoin falls below $80,000, continuing decline as liquidity worries mount",
    "description": "Bitcoin, the world's largest cryptocurrency by market value, was down by 6.53% at $78,719.63 at 12:48 p.m. ET (1748 GMT) ​on Saturday, continuing its decline...",
    "link": "https://finance.yahoo.com/news/bitcoin-falls-below-80-000-180248860.html",
    "timestamp": "2026-01-31T18:02:48Z"
  },
  {
    "title": "Appropriating the death count: Manufacturing consent for an attack on Iran",
    "description": "Protest death toll speculations are used to rally support for an attack on Iran and downplay the genocide in Gaza.",
    "link": "https://www.aljazeera.com/opinions/2026/1/31/appropriating-the-death-count-manufacturing-consent-for-an-attack-on-iran",
    "timestamp": "2026-01-31T18:01:03Z"
  },
  {
    "title": "No Deal With Iran! An Apocalyptic “Regime Change War” Appears To Be Imminent",
    "description": "It appears that an apocalyptic war is about to begin in the Middle East, and yet most people living in the Western world don’t seem alarmed by this at all.  But they should be, because once the missiles start flying, the death and destruction that we will wit…",
    "link": "https://www.shtfplan.com/headline-news/no-deal-with-iran-an-apocalyptic-regime-change-war-appears-to-be-imminent",
    "timestamp": "2026-01-31T18:00:17Z"
  },
  {
    "title": "Donald Trump, 79, Confuses Reporters by Mistakenly Declaring Sitting Senator 'No Longer' in Office in Rambling Fed Fight",
    "description": "Donald Trump incorrectly said that Thom Tillis was 'no longer a senator' after Tillis opposed one of Trump's nominees.",
    "link": "https://radaronline.com/p/donald-trump-mistakenly-declaring-sitting-senator-no-longer-in-office/",
    "timestamp": "2026-01-31T18:00:00Z"
  },
  {
    "title": "Putin envoy hails ‘constructive’ talks with US delegation",
    "description": "Russia’s chief Ukraine negotiator has flown to Florida for a last-minute meeting with US officials ahead of peace talks in Abu Dhabi Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631802-dmitriev-miami-ukraine-talks/",
    "timestamp": "2026-01-31T17:55:11Z"
  }
]