[
  {
    "title": "Hungary’s Orban Refuses to Budge on Trump Russian Energy Demand",
    "description": "Hungarian Prime Minister Viktor Orban openly pushed back against US President Donald Trump, digging in his heels over purchases of Russian energy.",
    "link": "https://financialpost.com/pmn/business-pmn/hungarys-orban-refuses-to-budge-on-trump-russian-energy-demand",
    "timestamp": "2025-09-26T07:41:42Z"
  },
  {
    "title": "Greta Thunberg Booted Off Her Own Ship As Flotilla Mission Falls Apart!",
    "description": "Greta left ship in Tunisia because \"focus not on Gaza\" and got on a different ship/took a plane (confusion). waaah. Transcript linked below video.",
    "link": "https://freerepublic.com/focus/f-bloggers/4342741/posts",
    "timestamp": "2025-09-26T07:35:33Z"
  },
  {
    "title": "Trump: “I’ve been on the side of Israel really my whole life.”",
    "description": "Trump To Macron: 'I've always been on Israel's side'. Presidents Trump and Macron held a joint press conference where they clashed over the French initiative to declare a Palestinian state. Yoni Kempinski. Sep 25, 2025, 10:24 AM (GMT+3) At a joint press confe…",
    "link": "https://freerepublic.com/focus/f-news/4342739/posts",
    "timestamp": "2025-09-26T07:24:38Z"
  },
  {
    "title": "Did the UN try to trip up Donald Trump and Melania Trump? How a 3-second jolt and Laura Loomer’s explosive claims became an international scandal",
    "description": "A United Nations escalator incident has triggered a political clash. Donald Trump accuses the UN of sabotage after an escalator malfunctioned as he and Melania Trump entered the building. Laura Loomer alleges an assassination attempt, claiming remote control …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/did-the-un-try-to-trip-up-donald-trump-and-melania-trump-how-a-3-second-jolt-and-laura-loomers-explosive-claims-became-an-international-scandal/articleshow/124150374.cms",
    "timestamp": "2025-09-26T07:17:53Z"
  },
  {
    "title": "Trump announces new tariffs on drugs, kitchen cabinets, trucks",
    "description": "President Donald Trump has announced a slew of tariffs to go into effect at the start of next month impacting pharmaceuticals, kitchen cabinets, bathroom...",
    "link": "https://www.upi.com/Top_News/US/2025/09/26/Trump-new-tariffs/3431758867060/",
    "timestamp": "2025-09-26T07:14:05Z"
  },
  {
    "title": "Why ex-FBI Director James Comey has been indicted – what it means",
    "description": "The former director of the US Federal Bureau of Investigations has been accused of lying to Congress.",
    "link": "https://www.aljazeera.com/news/2025/9/26/why-ex-fbi-director-james-comey-has-been-indicted-what-it-means",
    "timestamp": "2025-09-26T07:13:44Z"
  },
  {
    "title": "'I live for this': Europe prepares to take on the home dominance of the US at the Ryder Cup",
    "description": "Gavin Cooney of The 42 previews the 45th Ryder Cup at Bethpage Black, New York.",
    "link": "https://www.the42.ie/ryder-cup-preview-3-6827350-Sep2025/",
    "timestamp": "2025-09-26T07:09:46Z"
  },
  {
    "title": "Asian shares tumble after Trump says he will impose new tariffs on drugs and other goods",
    "description": "Asian shares have slipped after President Donald Trump announced plans for new tariffs including 100% import taxes on pharmaceutical drugs, starting on Oct. 1",
    "link": "https://biztoc.com/x/096deee5e535908e",
    "timestamp": "2025-09-26T07:04:51Z"
  },
  {
    "title": "Howie Carr: Feds SNAP up this illegal sob story",
    "description": "This is a sob story about an illegal alien. But my sad tale is the not the sort of hoax-y piece pushed daily in regime-controlled media.",
    "link": "https://www.bostonherald.com/2025/09/26/howie-carr-feds-snap-up-this-illegal-sob-story/",
    "timestamp": "2025-09-26T07:03:27Z"
  },
  {
    "title": "India and Russia eye ‘win-win’ cooperation in agriculture – Modi",
    "description": "New Delhi and Moscow have discussed the setting up of a BRICS grain exchange to boost agricultural trade Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625284-india-and-russia-eye-win/",
    "timestamp": "2025-09-26T07:03:08Z"
  },
  {
    "title": "Trump's 100% drug tariff: India's generic edge limits immediate fallout",
    "description": "India's vast generic drug production and cost efficiency offer an immediate buffer to US President Donald Trump's 100% tariff on branded and patented pharmaceutical products. Indian pharma stocks, however, fell following the tariff announcement.",
    "link": "https://www.livemint.com/industry/trump-100pc-pharma-tariff-india-impact-generic-edge-11758864872060.html",
    "timestamp": "2025-09-26T07:03:03Z"
  },
  {
    "title": "Netanyahu Set For Defiant UN Speech As Trump Warns On Annexation",
    "description": "Israeli Prime Minister Benjamin Netanyahu was expected to deliver a defiant message to the UN on Friday against a Palestinian state, but faces rare pressure from US President Donald Trump who seeks a deal on Gaza.",
    "link": "https://www.ibtimes.com/netanyahu-set-defiant-un-speech-trump-warns-annexation-3784531",
    "timestamp": "2025-09-26T07:00:19Z"
  },
  {
    "title": "James Comey: 'I'm Innocent'",
    "description": "James Comey responded quickly to his indictment at the hands of the Trump administration, saying in an Instagram video Thursday, \"I'm innocent. So let's have a trial.\" He said he and his family \"have known for years that there are costs to standing up to Dona…",
    "link": "https://www.newser.com/story/375842/james-comey-im-innocent.html",
    "timestamp": "2025-09-26T07:00:00Z"
  },
  {
    "title": "U.K. Weighs Streamlining Visa Process for Researchers",
    "description": "U.K. Weighs Streamlining Visa Process for Researchers\n\n \n\n\n \nSusan H. Greenberg\n\nFri, 09/26/2025 - 03:00 AM\n\nResearch organizations are calling on the British government to remove barriers for entry to capitalize on President Trump’s new visa restrictions for…",
    "link": "https://www.insidehighered.com/news/global/2025/09/26/uk-weighs-streamlining-visa-process-researchers",
    "timestamp": "2025-09-26T07:00:00Z"
  },
  {
    "title": "Netanyahu set for defiant UN speech as Trump warns on annexation",
    "description": "Israeli Prime Minister Benjamin Netanyahu was expected to deliver a defiant message to the UN on Friday against a Palestinian state, but faces rare pressure from US President Donald Trump who seeks a deal on Gaza. Netanyahu will address the United Nations Gen…",
    "link": "https://www.digitaljournal.com/world/netanyahu-set-for-defiant-un-speech-as-trump-warns-on-annexation/article",
    "timestamp": "2025-09-26T06:57:20Z"
  },
  {
    "title": "Iran sanctions look set to return after last-ditch UN vote",
    "description": "Sweeping UN sanctions are poised to return on Iran, despite China and Russia's plea for delay to allow further talks. European powers are pushing Iran to reverse actions taken after bombings by Israel and the United States. The return of sanctions, especially…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-sanctions-look-set-to-return-after-last-ditch-un-vote/articleshow/124149893.cms",
    "timestamp": "2025-09-26T06:56:07Z"
  },
  {
    "title": "Jimmy Kimmel Taunts Trump With A Blunt Personal Message",
    "description": "Jimmy Kimmel Taunts Trump With A Blunt Personal Messagehuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-message_n_68d61708e4b0d6db5599f9e5",
    "timestamp": "2025-09-26T06:53:44Z"
  },
  {
    "title": "Elon Musk 'Thanks' Donald Trump As White House Approves Grok For Federal Use In 'Longest' xAI-GSA Deal",
    "description": "Trump administration has given the go-ahead for Elon Musk‘s artificial intelligence (AI) chatbot, Grok, to be used by all federal agencies. The approval comes with a unique offer from the General Services Administration (GSA).\nGSA Approves Grok With Musk's xA…",
    "link": "https://biztoc.com/x/a18d243523d8215c",
    "timestamp": "2025-09-26T06:51:08Z"
  },
  {
    "title": "Trump's New Furniture Tariffs Sends RH Stock Down After Hours: What You Should Know",
    "description": "RH Inc. (NYSE: RH) shares are trending on Friday.\nCheck out the current price of RH stock here. \nThe shares of the home-furnishing company dropped 3.39% to $204.14 during after-hours trading on Thursday following President Donald Trump‘s tariff announcement t…",
    "link": "https://biztoc.com/x/267e03a0475093c7",
    "timestamp": "2025-09-26T06:51:06Z"
  },
  {
    "title": "Win – win meeting between Trump and Erdogan at the White House: The goal is weaning from Russia",
    "description": "Everything that was discussed in the \"contract meeting\" prepared by the Turkish president with the aim of his \"total reintroduction\" to the American political scene\nThe post Win – win meeting between Trump and Erdogan at the White House: The goal is weaning f…",
    "link": "https://en.protothema.gr/2025/09/26/win-win-meeting-between-trump-and-erdogan-at-the-white-house-the-goal-is-weaning-from-russia/",
    "timestamp": "2025-09-26T06:51:05Z"
  },
  {
    "title": "A look at the Trump-Comey relationship and the indictment against the former FBI director (Eric Tucker/Associated Press)",
    "description": "Eric Tucker / Associated Press:\nA look at the Trump-Comey relationship and the indictment against the former FBI director  —  The indictment of former FBI Director James Comey represents the first criminal case against a perceived adversary of President Donal…",
    "link": "https://www.memeorandum.com/250926/p3",
    "timestamp": "2025-09-26T06:45:00Z"
  },
  {
    "title": "The 8 at 8: Friday",
    "description": "Search for missing fisherman underway, Trump announces new pharma tariffs and ex-FBI chief James Comey indicted.",
    "link": "https://www.thejournal.ie/8-at-8-friday-111-6827723-Sep2025/",
    "timestamp": "2025-09-26T06:44:41Z"
  },
  {
    "title": "Conor McGregor demands $100 million and Gold Card visas for UFC White House card",
    "description": "Conor McGregor has once again taken centre stage in the ongoing conversation about the UFC's proposed 2026 White House card, this time by outlining the extraordinary terms under which he would agree to compete.",
    "link": "https://www.sportingnews.com/us/mma/news/conor-mcgregor-demands-100-million-gold-card-ufc-white-house/aec29c218c6c5b4a59016584",
    "timestamp": "2025-09-26T06:41:59Z"
  },
  {
    "title": "TikTok’s US business valued at $14bn as Trump signs exec order to change ownership",
    "description": "US president Donald Trump has signed an executive order changing the ownership structure for TikTok in America, with the new entity valued at around US$14bn. Under the new structure, US investors will ...",
    "link": "https://www.c21media.net/news/tiktoks-us-business-valued-at-14bn-as-trump-signs-exec-order-to-change-ownership/",
    "timestamp": "2025-09-26T06:41:54Z"
  },
  {
    "title": "Roche points to U.S. plans after Trump pharma tariff announcement",
    "description": "ZURICH (Reuters) -Switzerland's Roche on Friday pointed to the fact that one of its U.S. units broke ground on a new facility in August and that the pharma...",
    "link": "https://finance.yahoo.com/news/roche-points-u-plans-trump-064152225.html",
    "timestamp": "2025-09-26T06:41:52Z"
  },
  {
    "title": "Trump Presses Erdogan on Russian Oil in ‘Conclusive’ Meeting",
    "description": "President Donald Trump urged Turkey to curb energy imports from Russia, warning that US sales of stealth fighter jets to the North Atlantic Treaty Organization ally depend on Ankara’s support for American goals.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-presses-erdogan-on-russian-oil-in-conclusive-meeting",
    "timestamp": "2025-09-26T06:40:44Z"
  },
  {
    "title": "Late Night Open Thread: Grifting Harpy, Sweaty Thug",
    "description": "Aside from the usual corruption never let these guys scream 'stolen valor' because a Dem mispronounces one of his ribbons again. Noem has never served, dresses up in SEAL kit, and has stolen housing reserved for military officers so she can fuck her psycho ra…",
    "link": "https://balloon-juice.com/2025/09/26/late-night-open-thread-grifting-harpy-sweaty-thug/",
    "timestamp": "2025-09-26T06:39:43Z"
  },
  {
    "title": "U.S. turns to Bryson DeChambeau and Justin Thomas to launch Ryder Cup bid",
    "description": "History favors the Americans when the current setup is in play: the U.S. own a 9-3-1 record in Ryder Cups where foursomes have led off play on both Friday and Saturday.",
    "link": "https://www.japantimes.co.jp/sports/2025/09/26/more-sports/ryder-cup-opening-day/",
    "timestamp": "2025-09-26T06:39:00Z"
  },
  {
    "title": "Trump announces 100pc import tariff on pharmaceutical drugs, causing further uncertainty for Ireland",
    "description": "President Donald Trump has announced a raft of import taxes, including 100pc on branded pharmaceutical drugs, to start on October 1.",
    "link": "https://www.independent.ie/world-news/north-america/trump-announces-100pc-import-tariff-on-pharmaceutical-drugs-causing-further-uncertainty-for-ireland/a2017268476.html",
    "timestamp": "2025-09-26T06:37:22Z"
  },
  {
    "title": "Trump vows to block Israel annexation of West Bank",
    "description": "U.S. President Donald Trump vowed Thursday to stop Israel from annexing the West Bank as he presses to end the Gaza war, ahead of a high-stakes visit by Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.hurriyetdailynews.com/trump-vows-to-block-israel-annexation-of-west-bank-214011",
    "timestamp": "2025-09-26T06:35:59Z"
  },
  {
    "title": "TikTok’s future secured in US as Trump signs executive order: Here’s all you need to know",
    "description": "President Donald Trump signed an executive order approving the sale of TikTok’s US operations to American investors, addressing national security concerns. The new US-based company, valued at $14 billion, will control data and the algorithm. China retains a m…",
    "link": "https://economictimes.indiatimes.com/tech/technology/tiktoks-future-secured-in-us-as-trump-signs-executive-order-heres-all-you-need-to-know/articleshow/124148981.cms",
    "timestamp": "2025-09-26T06:33:27Z"
  },
  {
    "title": "US to fight efforts to ban Israel’s football team from World Cup 2026",
    "description": "Pressure is growing to ban Israel from the 2026 World Cup, with a key vote reportedly expected as early as next week.",
    "link": "https://www.aljazeera.com/news/2025/9/26/us-to-fight-efforts-to-ban-israels-football-team-from-world-cup-2026",
    "timestamp": "2025-09-26T06:31:29Z"
  },
  {
    "title": "Turkish Airlines to expand fleet with 225 new Boeing aircraft after Erdoğan's US visit",
    "description": "Turkish Airlines has announced plans to add 225 Boeing aircraft to its fleet",
    "link": "https://abcnews.go.com/Business/wireStory/turkish-airlines-expand-fleet-225-new-boeing-aircraft-125955460",
    "timestamp": "2025-09-26T06:30:26Z"
  },
  {
    "title": "Arizona judge blocks Trump administration from deporting migrant Guatemalan and Honduran children",
    "description": "A federal judge in Arizona has temporarily blocked President Donald Trump’s administration from immediately deporting dozens of Guatemalan and Honduran children who came to the U.S. alone",
    "link": "https://abcnews.go.com/US/wireStory/arizona-judge-blocks-trump-administration-deporting-migrant-guatemalan-125955188",
    "timestamp": "2025-09-26T06:30:25Z"
  },
  {
    "title": "Iran Sanctions Look Set To Return After Last-ditch UN Vote",
    "description": "Sweeping UN sanctions look likely to return on Iran despite a last-ditch effort on Friday by China and Russia for a delay to allow further talks, diplomats say.",
    "link": "https://www.ibtimes.com/iran-sanctions-look-set-return-after-last-ditch-un-vote-3784525",
    "timestamp": "2025-09-26T06:30:19Z"
  },
  {
    "title": "Donald Trump approves proposed deal to put TikTok under US ownership. Here's what we know",
    "description": "Vice President JD Vance said that “there was some resistance on the Chinese side.\nPresident Donald Trump signed an executive order Thursday that he says will allow TikTok to continue operating in the United States in a way that meets national security concern…",
    "link": "https://biztoc.com/x/284eb6bdb12725e6",
    "timestamp": "2025-09-26T06:28:50Z"
  },
  {
    "title": "Trump advocates for 100 per cent MAGA-focused TikTok content but...",
    "description": "President Trump expressed his desire for TikTok to reflect his MAGA message, but acknowledged the impracticality of a completely one-sided platform. He signed an executive order paving the way for a deal that would give American investors majority ownership o…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-advocates-for-100-per-cent-maga-focused-tiktok-content-but-/articleshow/124148862.cms",
    "timestamp": "2025-09-26T06:28:17Z"
  },
  {
    "title": "Trump signs order declaring TikTok sale ready",
    "description": "US President Donald Trump has signed an executive order declaring that his plan to sell Chinese-owned TikTok's US operations to US and global investors will address the national security requirements in a 2024 law.",
    "link": "https://www.rte.ie/news/business/2025/0926/1535429-trump-signs-order-declaring-tiktok-sale-ready/",
    "timestamp": "2025-09-26T06:28:01Z"
  },
  {
    "title": "Iran sanctions look set to return after last-ditch UN vote",
    "description": "Sweeping UN sanctions look likely to return on Iran despite a last-ditch effort on Friday by China and Russia for a delay to allow further talks, diplomats say. European powers were urging Iran to reverse a series of steps it took after Israel and the United …",
    "link": "https://www.digitaljournal.com/world/iran-sanctions-look-set-to-return-after-last-ditch-un-vote/article",
    "timestamp": "2025-09-26T06:27:20Z"
  },
  {
    "title": "AI boom fuels market mania as Jefferies flags warning signs",
    "description": "Jefferies cautions investors about speculative excesses in US markets fueled by AI spending, despite a weakening dollar. Oracle's surge after a deal with OpenAI mirrors early-2000s tech bubble concerns. Meanwhile, China's AI-driven rally gains momentum, attra…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-boom-fuels-market-mania-as-jefferies-flags-warning-signs/articleshow/124148843.cms",
    "timestamp": "2025-09-26T06:27:02Z"
  },
  {
    "title": "'I'm not afraid': Ex-FBI director and Trump critic James Comey indicted on two charges",
    "description": "The charges came days after Trump publicly urged Attorney General Pam Bondi to take action against Comey and others he sees as enemies.",
    "link": "https://www.thejournal.ie/james-comey-indicted-criminal-charges-trump-6827699-Sep2025/",
    "timestamp": "2025-09-26T06:26:52Z"
  },
  {
    "title": "Donald Trump says London wants ‘to go to sharia law’",
    "description": "US president Donald Trump has claimed in an address to the United Nations that London wants to “go to sharia law”. Speaking to the UN General Assembly in New York on Tuesday, Trump again attacked London Mayor Sir Sadiq Khan and also criticised UN assistance f…",
    "link": "https://thechronicle.com.gh/donald-trump-says-london-wants-to-go-to-sharia-law/",
    "timestamp": "2025-09-26T06:25:28Z"
  },
  {
    "title": "Tony Blair in discussions to run transitional Gaza authority, BBC understands",
    "description": "The former prime minister has been in high-level planning talks over the territory's future, the BBC understands.",
    "link": "https://www.bbc.com/news/articles/c3drmk95xlzo",
    "timestamp": "2025-09-26T06:24:58Z"
  },
  {
    "title": "Explained: What Dr Trump’s 100% bitter tariff pill means for India’s $10 billion pharma export machine",
    "description": "The US has imposed a 100% tariff on branded and patented pharmaceuticals, targeting imports from India’s $10 billion export industry. While generics remain unaffected for now, uncertainty persists around complex drugs. Sun Pharma, Dr. Reddy’s, Cipla, and Zydu…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-dr-trumps-100-bitter-tariff-pill-means-for-indias-10-billion-pharma-export-machine/articleshow/124148742.cms",
    "timestamp": "2025-09-26T06:24:06Z"
  },
  {
    "title": "CNN’s Harry Enten Names Trump Official In Poll Spiral: ‘Not A Place You Want To Be’",
    "description": "The network's chief data analyst also expanded on the \"real worry\" of the Cabinet member's actions.",
    "link": "https://www.huffpost.com/entry/harry-enten-donald-trump-cabinet-member_n_68d62b38e4b085d511c5cec1",
    "timestamp": "2025-09-26T06:23:12Z"
  },
  {
    "title": "Trump announces steep new tariffs, reviving trade war",
    "description": "U.S. President Donald Trump announced Thursday punishing tariffs on pharmaceuticals, big-rig trucks, home renovation fixtures and furniture, reviving his global trade war.",
    "link": "https://www.hurriyetdailynews.com/trump-announces-steep-new-tariffs-reviving-trade-war-214008",
    "timestamp": "2025-09-26T06:19:44Z"
  },
  {
    "title": "Turkish Airlines to expand fleet with 225 new Boeing aircraft after Erdoğan’s US visit",
    "description": "ANKARA, Turkey (AP) — Turkish Airlines, Turkey’s national carrier, has announced plans to add 225 Boeing aircraft to its fleet. In an a declaration to the Istanbul Stock Exchange on Friday, the airline said it has decided to purchase 75 Boeing B787-9 and B787…",
    "link": "https://financialpost.com/pmn/turkish-airlines-to-expand-fleet-with-225-new-boeing-aircraft-after-erdogans-us-visit",
    "timestamp": "2025-09-26T06:16:50Z"
  },
  {
    "title": "Gold Heads for Sixth Weekly Gain on Risk-Off Tone and ETF Flows",
    "description": "Gold traded just below a record — on track for a sixth weekly gain — supported by elevated geopolitical tensions, inflows into bullion-backed exchange-traded funds, and a risk-off tone in broader markets.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-heads-for-sixth-weekly-gain-on-risk-off-tone-and-etf-flows",
    "timestamp": "2025-09-26T06:15:29Z"
  },
  {
    "title": "Turkish Airlines says will buy 225 Boeing planes",
    "description": "Turkish Airlines said on Friday it had ordered 75 Boeing aircraft and finalised the purchase of 150 others.",
    "link": "https://www.hurriyetdailynews.com/us-envoy-to-turkiye-confirms-boeing-deal-is-done-214007",
    "timestamp": "2025-09-26T06:15:00Z"
  },
  {
    "title": "LARRY ELDER: Jimmy Kimmel Didn’t Apologize — Maybe Van Jones Will",
    "description": "Disney-owned ABC late-night show host Jimmy Kimmel did not apologize for offending much of the nation when he returned to his show after a one-week suspension.",
    "link": "https://dailycaller.com/2025/09/26/opinion-jimmy-kimmel-didnt-apologize-maybe-van-jones-will-larry-elder/",
    "timestamp": "2025-09-26T06:13:50Z"
  },
  {
    "title": "Erdoğan wraps up US visit after UN address, key meetings",
    "description": "President Recep Tayyip Erdoğan concluded a five-day visit to the United States on Thursday, following his address to the 80th UN General Assembly and bilateral talks focused on regional issues, defense cooperation and trade.",
    "link": "https://www.hurriyetdailynews.com/erdogan-wraps-up-us-visit-after-un-address-key-meetings-214006",
    "timestamp": "2025-09-26T06:13:17Z"
  },
  {
    "title": "Turkish Airlines to expand fleet with 225 new Boeing aircraft after Erdoğan's US visit",
    "description": "Turkish Airlines, Turkey’s national carrier, has announced plans to add 225 Boeing aircraft to its fleet.  In an a declaration to the Istanbul Stock Exchange...",
    "link": "https://finance.yahoo.com/news/turkish-airlines-expand-fleet-225-061137835.html",
    "timestamp": "2025-09-26T06:11:37Z"
  },
  {
    "title": "Netanyahu to address Palestinian state recognition at UN",
    "description": "Israeli Prime Minister Benjamin Netanyahu is expected to outline his response to the growing recognition of a Palestinian state by the international community when he addresses the UN General Assembly this afternoon.",
    "link": "https://www.rte.ie/news/middle-east/2025/0926/1535424-netanyahu-general-assembly/",
    "timestamp": "2025-09-26T06:10:37Z"
  },
  {
    "title": "Europe mixed premarket with tariffs in focus",
    "description": "Major European stock indexes traded mixed during premarket hours on Friday after United States President Donald Trump announced 100% tariffs on branded or patented drugs and 25% duties on imports of h...",
    "link": "https://biztoc.com/x/157de859f0bdef52",
    "timestamp": "2025-09-26T06:06:26Z"
  },
  {
    "title": "Sikh granny deported after 'unacceptable' treatment by US immigration",
    "description": "Harjit Kaur, 73, had lived in the US for over 30 years before being deported to India.",
    "link": "https://www.bbc.com/news/articles/c0jqvz24llyo",
    "timestamp": "2025-09-26T06:06:25Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Faces Impeachment Over 'Health Care Chaos' From Democrats: 'Enough Is Enough!' - NewsBreak",
    "description": "Robert F. Kennedy Jr. Faces Impeachment Over 'Health Care Chaos' From Democrats: 'Enough Is Enough!' - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4256849261267-robert-f-kennedy-jr-faces-impeachment-over-health-care-chaos-from-democrats-enough-is-enough?s=a2&amp;share_destination_id=MjI5MTQ2MzUwLTE3NTg4NjY2OTU5NDE%3D&amp;pd=0FVTQsxU&amp;hl=en_US&amp;send_time=1758866695&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.37.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control%2Csc_android_comment_share_v3-v3",
    "timestamp": "2025-09-26T06:06:14Z"
  },
  {
    "title": "HongShan-Backed Hong Kong Crypto Payment Startup Becomes Unicorn With $47 Million Round",
    "description": "Redotpay’s recent round drew participation from investors including Coinbase Ventures, Temasek’s Vertex Ventures and Galaxy Ventures.",
    "link": "https://www.forbes.com/sites/zinnialee/2025/09/26/hongshan-backed-hong-kong-crypto-payment-startup-becomes-unicorn-with-47-million-round/",
    "timestamp": "2025-09-26T06:05:15Z"
  },
  {
    "title": "Dagan to Netanyahu: 'No more October 7s—apply sovereignty'",
    "description": "Samaria Council chairman calls on PM Netanyahu to apply sovereignty in Judea and Samaria despite Trump's opposition to 'annexation.'",
    "link": "https://www.israelnationalnews.com/news/415443",
    "timestamp": "2025-09-26T06:01:49Z"
  },
  {
    "title": "Tylenol is Just the Latest Brand Trump Has Picked a Fight With",
    "description": "Presidents have historically avoided taking aim at American corporations by name, at least publicly. It’s not hard to see why. No occupant of the Oval Office wants to make enemies […]",
    "link": "https://www.adweek.com/brand-marketing/tylenol-is-just-the-latest-brand-trump-has-picked-a-fight-with/",
    "timestamp": "2025-09-26T06:00:00Z"
  },
  {
    "title": "The forensics crisis: When “scientific evidence” lacks science",
    "description": "Many courtroom forensic techniques (firearms matching, bite marks, hair analysis) rely on subjective judgment rather than validated science, raising doubts about their reliability. Methods like bullet matching use vague, experience-based criteria, with studie…",
    "link": "https://www.naturalnews.com/2025-09-26-forensics-crisis-when-scientific-evidence-lacks-science.html",
    "timestamp": "2025-09-26T06:00:00Z"
  },
  {
    "title": "Former FBI Director Comey INDICTED over his role in the Russiagate hoax",
    "description": "Former FBI Director James Comey has been federally indicted for misleading Congress during his 2020 Senate testimony about the FBI’s role in leaking classified information related to investigations into Trump and Hillary Clinton. Special Counsel Robert Muelle…",
    "link": "https://www.naturalnews.com/2025-09-26-james-comey-indicted-over-his-role-russiagate.html",
    "timestamp": "2025-09-26T06:00:00Z"
  },
  {
    "title": "NORAD scrambles jets after Russian warplanes fly near Alaska airspace amid rising global tensions",
    "description": "Russian nuclear-capable bombers and fighters were intercepted by U.S. and Canadian jets near Alaska in the ninth such incident this year. Trump urges NATO to intensify Ukraine support, shifting from negotiation calls to a more aggressive stance against Russia…",
    "link": "https://www.naturalnews.com/2025-09-26-norad-scrambles-jets-russian-warplanes-near-alaska.html",
    "timestamp": "2025-09-26T06:00:00Z"
  },
  {
    "title": "California Sen. Alex Padilla rings the alarm on looming government shutdown and impact on health care for Californians",
    "description": "Senator Alex Padilla is ringing the alarm -- specifically about the 1.7 million Californians who will lose their health care if a deal between Democrats and Republicans isn't reached before Oct. 1.",
    "link": "https://abc7.com/post/california-sen-alex-padilla-rings-alarm-looming-government-shutdown-impact-health-care-californians/17883270/",
    "timestamp": "2025-09-26T05:59:51Z"
  },
  {
    "title": "Erdoğan, Trump discuss Gaza, Ukraine, F-35 in White House meeting",
    "description": "President Recep Tayyip Erdoğan met US President Donald Trump at the White House on Wednesday, covering key issues including Gaza, Syria, the Russia-Ukraine war, F-35 and F-16 aircraft acquisitions.",
    "link": "https://www.hurriyetdailynews.com/erdogan-trump-discuss-gaza-ukraine-f-35-in-white-house-meeting-214005",
    "timestamp": "2025-09-26T05:59:00Z"
  },
  {
    "title": "Donald Trump’s Reign of Terror",
    "description": "Donald Trump is provoking fear in the United States. His declarations and actions are part of a deliberate strategy of creating enough fear to have established a reign of terror. Trump is being compared with Vladimir Putin in Russia – see M. Gessen in the New…",
    "link": "https://www.counterpunch.org/2025/09/26/donald-trumps-reign-of-terror/",
    "timestamp": "2025-09-26T05:56:21Z"
  },
  {
    "title": "Shakedown Shack: The Trump White House",
    "description": "Corruption is always a potential problem in government, although if we get beyond the idiocy about the “Biden crime family,” the last two Democratic administrations were remarkably scandal-free. However, Donald Trump is determined to make scandal the normal c…",
    "link": "https://www.counterpunch.org/2025/09/26/shakedown-shack-the-trump-white-house/",
    "timestamp": "2025-09-26T05:54:24Z"
  },
  {
    "title": "Trump announces new tariffs on pharmaceuticals from October",
    "description": "Latest tariff sweep to include imported heavy trucks, kitchen cabinets and bathrooms",
    "link": "https://www.irishtimes.com/business/2025/09/26/trump-announces-new-tariffs-on-pharmaceuticals-from-october/",
    "timestamp": "2025-09-26T05:53:52Z"
  },
  {
    "title": "Trump Admin Opens Coal Tender",
    "description": "The Bureau of Land Management has launched a tender for a deposit with over 300 million tons of coal in the latest demonstration that the federal government means business with regard to conventional energy. The deposit that the BLM is tendering is on federal…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Admin-Opens-Coal-Tender.html",
    "timestamp": "2025-09-26T05:51:44Z"
  },
  {
    "title": "Trump says South Korea, Japan will pay billions 'upfront' in investment",
    "description": "SEOUL (Reuters) -U.S. President Donald Trump insisted South Korea will provide billions of dollars in investments \"upfront\", despite Seoul's assertion that it would suffer a financial crisis if it meets the U.S. demands without safeguards. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/26/trump-says-south-korea-japan-will-pay-billions-039upfront039-in-investment",
    "timestamp": "2025-09-26T05:50:00Z"
  },
  {
    "title": "Ex-FBI Director James Comey Indicted Amid Push To Prosecute Trump Opponents",
    "description": "Comey has long been a target of President Donald Trump, who has called the former FBI director a “sick guy” who “did terrible things” at the agency.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/26/ex-fbi-director-james-comey-indicted-amid-push-to-prosecute-trump-opponents/",
    "timestamp": "2025-09-26T05:49:57Z"
  },
  {
    "title": "Trump announces new 100% tariff on some imported pharmaceuticals",
    "description": "The US agreed to a 15% cap on tariffs for pharma imports from the EU in August.",
    "link": "https://www.thejournal.ie/trump-new-tariff-pharmaceuticals-6827693-Sep2025/",
    "timestamp": "2025-09-26T05:48:31Z"
  },
  {
    "title": "UW doctor disputes causal link between Tylenol and autism | My Northwest",
    "description": "Dr. Michelle Terry, a clinical professor of pediatrics at the UW School of Medicine, clarified the difference between association and causation in relation to President Trump’s statement that Tylenol may contribute to elevated autism rates.",
    "link": "https://mynorthwest.com/gee-and-ursula/tylenol-autism-pregnant/4135236",
    "timestamp": "2025-09-26T05:47:01Z"
  },
  {
    "title": "NATO’s Dutch Dr Strangelove, Rutte Knows Nothing of War",
    "description": "Mark Rutte became secretary general of NATO despite having no military experience. He is however a combatant in the holy war against social welfare in Europe. One glance at Rutte’s actual record reveals the warfare that NATO currently engages in as being econ…",
    "link": "https://www.counterpunch.org/2025/09/26/natos-dutch-dr-strangelove-rutte-knows-nothing-of-war/",
    "timestamp": "2025-09-26T05:46:23Z"
  },
  {
    "title": "Tariffs, tech and market turbulence: Peter Cardillo on what’s driving Wall Street",
    "description": "U.S. markets are navigating a complex landscape of new tariffs, a thriving AI sector, and revised economic data, creating investor uncertainty. Peter Cardillo suggests the announced pharmaceutical tariffs are a negotiation tactic, while AI continues to attrac…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/tariffs-tech-and-market-turbulence-peter-cardillo-on-whats-driving-wall-street/articleshow/124147200.cms",
    "timestamp": "2025-09-26T05:44:06Z"
  },
  {
    "title": "Donald Trump says World Cup matches will be moved if host cities are not safe",
    "description": "Trump was asked by reporters in the Oval Office specifically about games in Seattle and San Francisco.",
    "link": "https://www.japantimes.co.jp/sports/2025/09/26/soccer/world-cup/trump-world-cup-cities-change/",
    "timestamp": "2025-09-26T05:44:00Z"
  },
  {
    "title": "Left Wing Versus Right Wing Politics Explained In Simple Terms",
    "description": "Let me guess. You’ve heard people arguing about left wing versus right wing politics, and you’re sitting there like, “Wait, what does that even mean?!” Don’t worry. You’re not alone, and honestly? You’re not wrong for being confused. Because let’s face it—pol…",
    "link": "https://www.dumblittleman.com/left-wing-versus-right-wing-politics/",
    "timestamp": "2025-09-26T05:42:12Z"
  },
  {
    "title": "Trump's 100% tariff on pharma will not impact generic makers, says Indian Pharma Alliance",
    "description": "The Indian Pharmaceutical Alliance clarifies that Trump's proposed 100% tariff targets patented and branded drugs, not generics, potentially impacting a segment of Indian exports. While the immediate effect on Indian exports may be limited due to their focus …",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/trumps-100-tariff-on-pharma-will-not-impact-generic-makers-says-indian-pharma-alliance/articleshow/124147160.cms",
    "timestamp": "2025-09-26T05:41:54Z"
  },
  {
    "title": "'Time to stop': Trump says he 'will not allow Israel to annex the West Bank'",
    "description": "Trump confirmed that he had spoken to PM Netanyahu on Thursday, saying 'we're getting pretty close to having a deal on Gaza'",
    "link": "https://www.haaretz.com/israel-news/2025-09-26/ty-article/time-to-stop-trump-says-he-will-not-allow-israel-to-annex-the-west-bank/00000199-847f-d27b-affd-deff107b0000",
    "timestamp": "2025-09-26T05:41:38Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Faces Impeachment Over 'Health Care Chaos' From Democrats: 'Enough Is Enough!' - NewsBreak",
    "description": "Robert F. Kennedy Jr. Faces Impeachment Over 'Health Care Chaos' From Democrats: 'Enough Is Enough!' - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4256849261267-robert-f-kennedy-jr-faces-impeachment-over-health-care-chaos-from-democrats-enough-is-enough?_f=app_share&amp;pd=060itnLV&amp;lang=en_US&amp;send_time=1758865113&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.38.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3%2Csc_ios_comment_share_v2-v1&amp;s=i2",
    "timestamp": "2025-09-26T05:39:17Z"
  },
  {
    "title": "Asian markets drop as US data, new tariff threats dent sentiment",
    "description": "HONG KONG: Markets retreated Friday (Sep 26) as nagging uncertainty about the US interest rate outlook was compounded by data showing the world's biggest economy faring much better than expected and fresh tariff warnings from President Donald Trump.Asian inve…",
    "link": "https://www.channelnewsasia.com/business/asian-markets-drop-us-data-new-tariff-threats-dent-sentiment-5370851",
    "timestamp": "2025-09-26T05:39:01Z"
  },
  {
    "title": "'Time to stop': Trump vows Israel will not annex West Bank",
    "description": "U.S. President Donald Trump said on Thursday that he would not allow Israel to annex the West Bank, rejecting calls from some far-right politicians in Israel who want to extend sovereignty over the area and snuff out hopes for a Palestinian state.",
    "link": "https://www.independent.ie/world-news/middle-east/time-to-stop-trump-vows-israel-will-not-annex-west-bank/a1470751899.html",
    "timestamp": "2025-09-26T05:37:59Z"
  },
  {
    "title": "State exploring ways to exclude fast food from VAT cut",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/09/26/government-exploring-ways-to-exclude-fast-food-franchises-from-vat-cut-2/",
    "timestamp": "2025-09-26T05:37:55Z"
  },
  {
    "title": "China stocks set to end week near 3-1/2-year high on AI optimism",
    "description": "Chinese stocks saw a modest setback on Friday, yet they are on track to end the week near their highest point in over three years. Investor optimism in the realm of artificial intelligence in China is on the rise, contributing to the CSI300 Index's nearly two…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/china-stocks-set-to-end-week-near-3-1/2-year-high-on-ai-optimism/articleshow/124147008.cms",
    "timestamp": "2025-09-26T05:36:53Z"
  },
  {
    "title": "Trump Pushes Turkey on Russian oil, Hints at Lifting Sanctions",
    "description": "President Donald Trump said on Thursday he believes Turkey will agree to his request to stop purchasing Russian oil and that he may lift U.S. sanctions on Ankara so it can buy advanced American F-35 jets.",
    "link": "https://gcaptain.com/trump-pushes-turkey-on-russian-oil-hints-at-lifting-sanctions/",
    "timestamp": "2025-09-26T05:35:46Z"
  },
  {
    "title": "AI Boom Will Boost US Renewables Despite Trump, Fortescue Says",
    "description": "President Donald Trump’s dismissal of climate change and attacks on renewable energy won’t significantly damp demand for clean power in the US, where artificial intelligence will further accelerate the shift to cheap, low-carbon energy, according to Fortescue…",
    "link": "https://financialpost.com/pmn/business-pmn/ai-boom-will-boost-us-renewables-despite-trump-fortescue-says",
    "timestamp": "2025-09-26T05:34:31Z"
  },
  {
    "title": "Former FBI chief Comey charged as Trump ramps up campaign against critics",
    "description": "The U.S. Justice Department filed criminal charges against former FBI Director James Comey on Thursday, in a dramatic escalation of President Donald Trump's retribution campaign against his political enemies.",
    "link": "https://www.independent.ie/world-news/north-america/former-fbi-chief-comey-charged-as-trump-ramps-up-campaign-against-critics/a1007456064.html",
    "timestamp": "2025-09-26T05:33:28Z"
  },
  {
    "title": "Trump says US will impose new tariffs on heavy trucks, drugs and kitchen cabinets",
    "description": "President announces 100% tariffs on imported branded drugs, 25% on heavy-duty trucks and 50% on cabinets\nDonald Trump on Thursday announced a new round of punishing tariffs, saying the United States will impose a 100% tariffs on imported branded drugs, 25% ta…",
    "link": "https://biztoc.com/x/db1ab47f3d973471",
    "timestamp": "2025-09-26T05:33:19Z"
  },
  {
    "title": "Kimmel Thanks Trump for Record Ratings Amid Station Boycott: ‘Couldn’t Have Done It Without You’",
    "description": "The host's broadcast return raked in 6.2 million viewers on Tuesday despite being preempted by 20 percent of ABC affiliates",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/kimmel-thanks-trump-record-ratings-station-boycott-1235435845/",
    "timestamp": "2025-09-26T05:33:00Z"
  },
  {
    "title": "Trump Unveils 21-Point Peace Plan for Gaza ️",
    "description": "Trump Unveils 21-Point Plan for Gaza Peace: A New Path to Stability? The United States, under former President Donald Trump, has reportedly introduced a new 21-point plan aimed at achieving lasting peace in Gaza. This initiative, shared with key leaders from …",
    "link": "https://nep123.com/trump-unveils-21-point-peace-plan-for-gaza-%f0%9f%95%8a%ef%b8%8f%f0%9f%a4%9d%f0%9f%8c%8d/",
    "timestamp": "2025-09-26T05:32:53Z"
  },
  {
    "title": "US: Trump's new tariffs to target drugs, furniture, trucks",
    "description": "Asian stock markets fell after US President Donald Trump announced a new wave of tariffs. He said taxes on medicines, imported kitchen cabinets and sofas were needed \"for national security and other reasons.\" US President Donald Trump on Thursday announced ne…",
    "link": "https://www.dw.com/en/us-trumps-new-tariffs-to-target-drugs-furniture-trucks/a-74141849",
    "timestamp": "2025-09-26T05:32:00Z"
  },
  {
    "title": "US plans to require a 1:1 ratio of domestically made to imported chips, WSJ reports",
    "description": "The US is set to enforce new regulations mandating that semiconductor companies produce as many chips domestically as they import. Any company unable to maintain a 1:1 production ratio could face hefty tariffs. This initiative is in line with President Trump'…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-plans-to-require-a-11-ratio-of-domestically-made-to-imported-chips-wsj-reports/articleshow/124146820.cms",
    "timestamp": "2025-09-26T05:31:27Z"
  },
  {
    "title": "Sean Penn ‘not surprised’ by Charlie Kirk shooting: ‘This kind of horror was coming into fashion’",
    "description": "Penn plays a white supremacist in Paul Thomas Anderson’s new movie, ‘One Battle After Another’",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/sean-penn-charlie-kirk-shooting-one-battle-after-another-b2834102.html",
    "timestamp": "2025-09-26T05:29:14Z"
  }
]