[
  {
    "title": "US gun trafficking to Mexico: Independent gun shops supply the most dangerous weapons",
    "description": "Independent gun dealers supplied 83% of crime guns seized in Mexico and traced back to  purchases in the US. Chain stores supplied the other 17%.",
    "link": "https://theconversation.com/us-gun-trafficking-to-mexico-independent-gun-shops-supply-the-most-dangerous-weapons-254974",
    "timestamp": "2025-05-23T13:46:06Z"
  },
  {
    "title": "Plenty Of Those Kids Are Going To Be Special",
    "description": "I doubt they even thought that one through.\nThe Trump administration has moved to end Harvard's ability to enrol international students, escalating a standoff with America's oldest university.\n\nHomeland Security Secretary Kristi Noem said the administration h…",
    "link": "https://www.eschatonblog.com/2025/05/plenty-of-those-kids-are-going-to-be.html",
    "timestamp": "2025-05-23T13:45:00Z"
  },
  {
    "title": "Cliff Taylor: Brace yourself for a summer economic wobble as Trump ups the ante with a new tariff threat",
    "description": "Already the first signs were there – businesses not investing, top-end asking prices for houses trimmed. And now the US president is at it again, threatening 50 per cent tariffs on the EU",
    "link": "https://www.irishtimes.com/opinion/2025/05/23/cliff-taylor-brace-yourself-for-a-summer-economic-wobble-as-trump-ups-the-ante-with-a-new-tariff-threat/",
    "timestamp": "2025-05-23T13:45:00Z"
  },
  {
    "title": "Starlink May Launch In South Africa Soon After Govt Policy Changes",
    "description": "South Africa has published a “proposed policy direction” that should allow Elon Musk’s Starlink to offer the satellite service in the country of his birth.",
    "link": "https://www.forbes.com/sites/tobyshapshak/2025/05/23/starlink-may-launch-in-south-africa-soon-after-govt-policy-changes/",
    "timestamp": "2025-05-23T13:44:32Z"
  },
  {
    "title": "‘Mind Your Dogs’: Chris Cuomo Erupts At Democrats Over Double Murder Of Israeli Embassy Employees",
    "description": "'Manifestation of their efforts'",
    "link": "https://dailycaller.com/2025/05/23/chris-cuomo-erupts-democrats-over-double-murder-israeli-embassy-employees/",
    "timestamp": "2025-05-23T13:43:30Z"
  },
  {
    "title": "Trump Tells Apple ‘Start Making iPhone’s in U.S. or Face 25% Tariff",
    "description": "U.S. President Donald Trump has warned Apple that it would be hit with a 25% tariff unless the company moves iPhone production stateside.Read More...",
    "link": "https://www.mactrast.com/2025/05/trump-tells-apple-start-making-iphones-in-u-s-or-face-25-tariff/",
    "timestamp": "2025-05-23T13:42:45Z"
  },
  {
    "title": "Trump Tariff Threats On Europe And Apple Send Markets Lower",
    "description": "Apple sank after Trump threatened to put a 25% tariff on its products unless the company moves iPhone manufacturing to the U.S.",
    "link": "https://www.huffpost.com/entry/trump-tariff-threats-on-europe-and-apple-send-markets-lower_n_68307a64e4b097a9e044723d",
    "timestamp": "2025-05-23T13:42:19Z"
  },
  {
    "title": "You Need Allies to Win a Trade War",
    "description": "Trump could have cornered China—instead, it’s the biggest winner of his attack on global trade.",
    "link": "http://foreignpolicy.com/2025/05/23/trump-tariffs-trade-war-china-europe-eu-allies-exports-imports/",
    "timestamp": "2025-05-23T13:41:11Z"
  },
  {
    "title": "Stock Market Sinks After Trump Threatens Tariffs on Apple, EU",
    "description": "In posts to Truth Social on Friday morning, Trump threatened steep new tariffs on both the iPhone manufacturer and the European Union.",
    "link": "https://www.newsweek.com/stock-market-sinks-trump-eu-apple-tariffs-2076376",
    "timestamp": "2025-05-23T13:41:08Z"
  },
  {
    "title": "Harvard sues Trump administration for blocking enrollment of foreign students",
    "description": "(Reuters) - Harvard University sued the Trump administration on Friday over its decision to revoke the Ivy League school's ability to enroll foreign students, ratcheting up White House efforts to conform practices in academia to President Donald Trump's polic…",
    "link": "https://www.thestar.com.my/news/world/2025/05/23/harvard-sues-trump-administration-for-blocking-enrollment-of-foreign-students",
    "timestamp": "2025-05-23T13:40:00Z"
  },
  {
    "title": "EU Eyes Nord Stream 2 Sanctions to Stamp Out Russian Gas Return",
    "description": "The European Union is nearing a decision to include the Nord Stream 2 gas pipelines linking Germany and Russia in a fresh proposal of sanctions against Moscow amid persistent rumors about reviving flows that the bloc wants to stop.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-eyes-nord-stream-2-sanctions-to-stamp-out-russian-gas-return",
    "timestamp": "2025-05-23T13:39:25Z"
  },
  {
    "title": "Trump’s Apple tariff threat; Zepto Cafe’s roadblock",
    "description": "US President Donald Trump has warned Apple to produce iPhones sold in the US domestically or face consequences. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/trump-warns-apple-of-25-tariffs-zepto-cafes-roadblock/articleshow/121364918.cms",
    "timestamp": "2025-05-23T13:39:12Z"
  },
  {
    "title": "World stocks are mixed and oil prices slip after Treasury yields ease",
    "description": "Trump tariff threats on EU, Apple, send US futures and global markets skidding\nTrump tariff threats on EU, Apple, send US futures and global markets skidding\nU.S. futures and global markets slumped Friday after President Donald Trump posted a pair of tariff t…",
    "link": "https://biztoc.com/x/f3d944edc7aec038",
    "timestamp": "2025-05-23T13:38:43Z"
  },
  {
    "title": "Dow drops 450 pts at open after Trump tariff threats",
    "description": "US stock markets plunged on Friday after President Donald Trump announced a new wave of tariffs targeting the European Union and Apple Inc.\nTrump has proposed a 50% tariff on goods from the European ...",
    "link": "https://biztoc.com/x/69bbdfc811a23e72",
    "timestamp": "2025-05-23T13:38:38Z"
  },
  {
    "title": "Trump vowed to help US farmers. These four say his policies are ‘wreaking havoc’",
    "description": "Farm country voted for Trump in 2024, but many of his actions – from tariffs to federal cuts – are hurting growers\nDonald Trump may have won the votes of the US’s most farming-dependent counties by an average of 78% in the 2024 election. But the moves made by…",
    "link": "https://biztoc.com/x/989a9a3ee4ba4e78",
    "timestamp": "2025-05-23T13:38:27Z"
  },
  {
    "title": "South Africa presses US on renewing trade pact",
    "description": "The News\nSouth African officials privately tried to push their economic agenda during President Cyril Ramaphosa’s visit to Washington despite his heated televised discussions with US President Donald Trump.\nThe future of the African Growth and Opportunity Act…",
    "link": "https://biztoc.com/x/6919e88c617ec526",
    "timestamp": "2025-05-23T13:38:26Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on Apple as his trade war intensifies",
    "description": "The threats, delivered over social media, reflect Trump's ability to disrupt the global economy with a burst of typing as well as the reality that his tariffs are not producing the sufficient trade deals he is seeking or the return of domestic manufacturing h…",
    "link": "https://www.thehindubusinessline.com/news/world/trump-threatens-50-tariffs-on-eu-and-25-penalties-on-apple-as-his-trade-war-intensifies/article69610739.ece",
    "timestamp": "2025-05-23T13:37:27Z"
  },
  {
    "title": "Did Trump punish EU over Greenland minerals deal?",
    "description": "Donald Trump announced a 50% tariff on all goods imported from the EU, effective June 1, 2025, citing unfair trade practices and a significant trade deficit. This move follows a minerals deal between the EU and Greenland, sidelining U.S. interests in the Arct…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-trump-punish-eu-over-greenland-minerals-deal/articleshow/121365381.cms",
    "timestamp": "2025-05-23T13:37:07Z"
  },
  {
    "title": "Stocks slide as Trump threatens tariffs on Apple and European Union",
    "description": "Market dip erases some gains made in recent weeks as Trump rolled back levies.",
    "link": "https://abcnews.go.com/Business/stocks-slide-trump-threatens-tariffs-apple-european-union/story?id=122108451",
    "timestamp": "2025-05-23T13:37:07Z"
  },
  {
    "title": "Trump Threatens Apple With ‘At Least 25%’ Tariff if Company Does Not Make iPhone in the US",
    "description": "President Donald Trump has threatened Apple with a tariff of \"at least 25%\" if iPhone models sold in the United States are not manufactured in the U.S. This very targeted escalation in trade policy rhetoric sent Apple's stock down 3.7% as of writing. The comp…",
    "link": "https://petapixel.com/2025/05/23/trump-threatens-apple-with-at-least-25-tariff-if-company-does-not-make-iphones-in-the-us/",
    "timestamp": "2025-05-23T13:34:53Z"
  },
  {
    "title": "Why El Salvador President Bukele's foreign agents law is fueling democratic concerns",
    "description": "Human rights organizations, politicians and experts have sharply criticized a law approved by El Salvador’s Congress this week that seeks to limit foreign influence and corruption",
    "link": "https://abcnews.go.com/International/wireStory/el-salvador-president-bukeles-foreign-agents-law-fueling-122111644",
    "timestamp": "2025-05-23T13:34:28Z"
  },
  {
    "title": "Trump’s 50% EU tariff bombshell: are we heading back to brutal trade wars or a high-stakes economic showdown that could shake global markets to their core?",
    "description": "Trump 50% tariff on EU goods has shaken up global markets and reignited fears of a U.S.-EU trade war. President Donald Trump announced the steep tariff hike starting June 1, 2025, citing unfair EU trade practices and a $250 billion annual deficit. This surpri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-50-eu-tariff-bombshell-are-we-heading-back-to-brutal-trade-wars-or-a-high-stakes-economic-showdown-that-could-shake-global-markets-to-their-core/articleshow/121364448.cms",
    "timestamp": "2025-05-23T13:34:07Z"
  },
  {
    "title": "Trump threatens 25% tariff on iPhones, but your Android phone isn’t safe either",
    "description": "President Donald Trump has directly threatened a 25% minimum tariff on imported iPhones, and Android fans shouldn't be rejoicing at this.",
    "link": "https://www.androidauthority.com/president-trump-25-percent-tariff-threat-apple-3560749/",
    "timestamp": "2025-05-23T13:33:55Z"
  },
  {
    "title": "Nasdaq, S&P snap 1% at open after Trump threatens EU, Apple with fresh tariffs",
    "description": "Wall Street dropped at the open on Friday after U.S. President Donald Trump recommended 50% tariffs on the European Union, while Apple slid after he warned the company would have to pay tariffs if its phones were not made in the United States.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-sp-snap-1-at-open-after-trump-threatens-eu-apple-with-fresh-tariffs/articleshow/121365274.cms",
    "timestamp": "2025-05-23T13:33:29Z"
  },
  {
    "title": "Bitcoin Rally Wavers as Trump Drops 50% EU Tariff Bombshell",
    "description": "Analysts had been saying the latest Bitcoin rally had \"less frothy momentum-chasing and stronger fundamental underpinnings.”",
    "link": "https://decrypt.co/321767/bitcoin-rally-wavers-as-trump-drops-50-eu-tariff-bombshell",
    "timestamp": "2025-05-23T13:33:17Z"
  },
  {
    "title": "Trump Threatens Apple with 25% Tariff on iPhones Not Made in the USA",
    "description": "President Donald Trump has threatened to impose a tariff of at least 25 percent on Apple iPhones not manufactured in the United States.\nThe post Trump Threatens Apple with 25% Tariff on iPhones Not Made in the USA appeared first on Breitbart.",
    "link": "https://www.breitbart.com/tech/2025/05/23/trump-threatens-apple-25-tariff-on-iphones-not-made-in-the-usa/",
    "timestamp": "2025-05-23T13:32:33Z"
  },
  {
    "title": "Trump Threatens Apple With Tariff on iPhones if They’re Not Made in the US",
    "description": "The president says Apple will be hit with a tariff \"of at least 25%\" on iPhones that are made in India and shipped to the States\nThe post Trump Threatens Apple With Tariff on iPhones if They’re Not Made in the US appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-threatens-apple-tariffs-iphones/",
    "timestamp": "2025-05-23T13:32:18Z"
  },
  {
    "title": "Donald Trump hits Apple and Tim Cook, making iPhones more expensive after latest move",
    "description": "Donald Trump threatened on Friday to impose a 50% tax on all imports from the European Union, as well as a 25% tariff on Apple products, unless iPhones are made in the United State",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/05/23/683075abca47415f178b45ce.html",
    "timestamp": "2025-05-23T13:32:03Z"
  },
  {
    "title": "'This Is The Stuff Of Tyranny': Summers Shreds Trump Administration Over 'Vicious' Action",
    "description": "\"If I had been a member of an administration where such unlawful orders had come from the White House, I would have resigned immediately,\" he said.",
    "link": "https://www.huffpost.com/entry/larry-summers-blasts-trump-admin-harvard_n_68305732e4b0a3c83b17b59a",
    "timestamp": "2025-05-23T13:31:30Z"
  },
  {
    "title": "Trump Resumes Effort to Destroy Economy",
    "description": "Donald Trump threatened to impose big tariffs on Apple products, unless the company moves production to the U.S., and the European Union.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-threatens-tariffs-apple-europena-1235346853/",
    "timestamp": "2025-05-23T13:31:20Z"
  },
  {
    "title": "Apple Shares Fall 3% As Trump Threatens 25% Tariff—Sparking Market Selloff",
    "description": "Trump claimed a 25% tariff “must be paid by Apple” unless the company shifted iPhone production to the U.S.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/23/apple-shares-fall-3-as-trump-threatens-25-tariff-sparking-market-selloff/",
    "timestamp": "2025-05-23T13:30:43Z"
  },
  {
    "title": "Goolsbee says Fed now has to wait longer before moving rates because of trade policy uncertainty",
    "description": "The central bank official indicated that while he still sees the direction of rates being lower, the Fed likely will be on hold.",
    "link": "https://www.cnbc.com/2025/05/23/goolsbee-says-fed-now-has-to-wait-longer-before-moving-rates-because-of-trade-policy-uncertainty.html",
    "timestamp": "2025-05-23T13:30:22Z"
  },
  {
    "title": "How the Trump administration's move will affect Harvard's international students",
    "description": "The Trump administration escalated its standoff with Harvard on Thursday, revoking the school's ability to enroll international students.",
    "link": "https://richmond.com/news/nation-world/education/article_b13720d1-3b47-5805-b3fb-9cb5b9576b36.html",
    "timestamp": "2025-05-23T13:30:00Z"
  },
  {
    "title": "Trump’s Tax Bill Would Decimate the Affordable Care Act",
    "description": "Republicans are no longer trying to repeal Democrats’ health care law, but the Trump tax bill would quietly gut the ACA and its insurance marketplaces",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-gop-tax-bill-affordable-care-act-1235346500/",
    "timestamp": "2025-05-23T13:30:00Z"
  },
  {
    "title": "Last Week I Gave A Stock to Buy: Here’s One to Sell",
    "description": "Last week, after I wrote a piece recommending buying a BTU, a coal stock that is risky by nature, several people I know declared themselves somewhat confused. They knew from earlier conversations that I am expecting at the very least a “summer swoon” for stoc…",
    "link": "https://oilprice.com/Energy/Energy-General/Last-Week-I-Gave-A-Stock-to-Buy-Heres-One-to-Sell.html",
    "timestamp": "2025-05-23T13:30:00Z"
  },
  {
    "title": "Trump Threatens Apple With Tariff After Previously Exempting Tech Company",
    "description": "Apple CEO Tim Cook received a message from President Donald Trump, who urged the company to move both iPhone manufacturing and assembly operations to the U.S.",
    "link": "https://dailycaller.com/2025/05/23/apple-iphone-manufactoring-india-donald-trump-truth-social-tim-cook/",
    "timestamp": "2025-05-23T13:29:14Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Friday",
    "description": "1. President Donald Trump said on social media today that Apple must pay at a 25% tariff on iPhones not made in the United States. Most iPhone manufacturing is out of China. Apple has been moving more and more production to India. The starting price for an iP…",
    "link": "https://biztoc.com/x/06c64f2c64326cc6",
    "timestamp": "2025-05-23T13:27:54Z"
  },
  {
    "title": "$TRUMP Crypto Investors Say They Attended Private Gala With ‘Explicit Intent’ To Influence President Trump: Report",
    "description": "Trump hosted a high-dollar dinner at his Washington golf club for the top buyers of his personal memecoin that several attendees used to lobby the president.\nThe post $TRUMP Crypto Investors Say They Attended Private Gala With ‘Explicit Intent’ To Influence P…",
    "link": "https://www.mediaite.com/media/news/trump-crypto-investors-say-they-attended-private-gala-with-explicit-intent-to-influence-president-trump-report/",
    "timestamp": "2025-05-23T13:27:48Z"
  },
  {
    "title": "Apple Stock Falls As Trump Threatens iPhone Tariff",
    "description": "Apple stock fell Friday after President Donald Trump threatened to put a tariff on Apple iPhones of “at least 25%.”\nThe post Apple Stock Falls As Trump Threatens iPhone Tariff appeared first on Investor's Business Daily.",
    "link": "https://biztoc.com/x/1b5f1499acdfe8e1",
    "timestamp": "2025-05-23T13:27:38Z"
  },
  {
    "title": "President Donald Trump tariff threats on EU, Apple, send US futures and global markets skidding",
    "description": "U.S. futures and global markets slumped Friday after President Donald Trump posted a pair of tariff threats on social media, one aimed at Apple and the other at the European Union.\nFutures for the S&P 500 and the Dow Jones Industrial Average slid 1.5% and Nas…",
    "link": "https://biztoc.com/x/252b6bfbebd41e17",
    "timestamp": "2025-05-23T13:27:28Z"
  },
  {
    "title": "Donald Trump big beautiful bill passed in the us house in which remittance tax reduce from 5 percent to 3 point five percent Marathi News",
    "description": "Donald Trump big beautiful bill passed in the us house in which remittance tax reduce from 5 percent to 3 point five percent Marathi Newsabplive.com",
    "link": "https://marathi.abplive.com/business/donald-trump-big-beautiful-bill-passed-in-the-us-house-in-which-remittance-tax-reduce-from-5-percent-to-3-point-five-percent-marathi-news-1360587",
    "timestamp": "2025-05-23T13:27:21Z"
  },
  {
    "title": "Ukraine and Russia exchange prisoners a week after direct talks failed to produce a ceasefire",
    "description": "Word of the developments emerged when U.S. President Donald Trump said on social media that Russia and Ukraine had carried out a large exchange of prisoners.",
    "link": "https://biztoc.com/x/253363863ee6b038",
    "timestamp": "2025-05-23T13:27:19Z"
  },
  {
    "title": "Trump's tariffs hit European luxury industry, shares tank",
    "description": "PARIS (Reuters) -European luxury shares tanked on Friday as U.S. President Donald Trump said he is recommending a straight 50% tariff on goods from the...",
    "link": "https://finance.yahoo.com/news/trumps-tariffs-hit-european-luxury-132718525.html",
    "timestamp": "2025-05-23T13:27:18Z"
  },
  {
    "title": "How US Mortgage Rates Change if Trump Takes Fannie Mae, Freddie Mac Public",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's plan to privatize mortgage giants Fannie Mae and Freddie Mac risks pushing U.S. homeowners' monthly payments even higher, experts told Newsweek, further exacerbating the affordability …",
    "link": "https://biztoc.com/x/1cc73ae30aa9d0a1",
    "timestamp": "2025-05-23T13:27:14Z"
  },
  {
    "title": "RCMP, city police prepare for 'largest domestic security operation' as G7 summit nears",
    "description": "RCMP and local police say security planning is well underway for next month's G7 summit in Alberta.",
    "link": "https://www.nationalobserver.com/2025/05/23/news/rcmp-city-police-prepare-largest-domestic-security-operation-g7-summit-nears",
    "timestamp": "2025-05-23T13:27:10Z"
  },
  {
    "title": "Stumblebum's Legacy",
    "description": "\"Every time I watch The View, I become even more misogynistic.\" — Laura Loomer",
    "link": "https://www.kunstler.com/p/stumblebums-legacy",
    "timestamp": "2025-05-23T13:26:29Z"
  },
  {
    "title": "Venezuelans head to the polls as opposition calls for boycotts and the government tightens grip",
    "description": "Venezuelans are again finding themselves as pawns in their country’s political game",
    "link": "https://abcnews.go.com/International/wireStory/venezuelans-head-polls-opposition-calls-boycotts-government-tightens-122111436",
    "timestamp": "2025-05-23T13:26:27Z"
  },
  {
    "title": "Trump will sign nuclear power orders on Friday, energy chief Wright says",
    "description": "US Energy Secretary Chris Wright said that President Donald Trump will sign executive orders on Friday aimed a",
    "link": "https://www.jpost.com/breaking-news/article-855207",
    "timestamp": "2025-05-23T13:26:16Z"
  },
  {
    "title": "Trump takes aim at 'difficult' EU and iPhones with new tariff threat",
    "description": "The US president says he's \"recommending\" a 50 per cent tariff be put on goods from the European Union from June 1, because trade negotiations with the bloc are \"going nowhere\", and that Apple could face a 25 per cent penalty if iPhones aren't manufactured in…",
    "link": "https://www.abc.net.au/news/2025-05-23/donald-trump-takes-aim-at-eu-and-iphones-with-new-tariff-threat/105331590",
    "timestamp": "2025-05-23T13:26:01Z"
  },
  {
    "title": "Kremlin comments on possible changes to Kiev’s negotiation team",
    "description": "Kremlin spokesman Dmitry Peskov has highlighted the importance of all details in high-stake diplomatic engagements Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618052-ukraine-talks-nuances-kremlin/",
    "timestamp": "2025-05-23T13:26:00Z"
  },
  {
    "title": "Palantir CEO Alex Karp sells more than $50 million in stock",
    "description": "Chief Technology Officer Shyam Sankar, co-founder and president Stephen Cohen and other executives also dumped millions worth of shares.",
    "link": "https://www.cnbc.com/2025/05/23/palantir-shares-alex-karp.html",
    "timestamp": "2025-05-23T13:25:35Z"
  },
  {
    "title": "RFK Jr.’s MAHA report raises concerns about vaccines, American foods and prescription drugs",
    "description": "The much-anticipated report calls for increased scrutiny of the vaccine schedule and describes the nation’s children as overmedicated.",
    "link": "https://www.kctv5.com/2025/05/23/rfk-jrs-maha-report-raises-concerns-about-vaccines-american-foods-prescription-drugs/",
    "timestamp": "2025-05-23T13:25:33Z"
  },
  {
    "title": "Crowd's Response to Howard Lutnick's Price Rise Question Goes Viral",
    "description": "The commerce secretary has repeatedly argued that Americans will feel no negative effects from President Donald Trump's tariffs.",
    "link": "https://www.newsweek.com/viral-howard-lutnick-tariff-question-audience-response-2076242",
    "timestamp": "2025-05-23T13:23:49Z"
  },
  {
    "title": "Trump Fires New Tariff Threats At Apple And EU",
    "description": "President Donald Trump ratcheted up the US trade war on Friday, threatening to impose a new 25 percent levy against Apple, and a 50 percent tariff on the European Union.",
    "link": "https://www.ibtimes.com/trump-fires-new-tariff-threats-apple-eu-3774355",
    "timestamp": "2025-05-23T13:21:17Z"
  },
  {
    "title": "Ukraine and Russia exchange prisoners a week after direct talks failed to produce a ceasefire",
    "description": "Word of the developments emerged when U.S. President Donald Trump said on social media that Russia and Ukraine had carried out a large exchange of prisoners.",
    "link": "https://www.pbs.org/newshour/world/ukraine-and-russia-exchange-prisoners-a-week-after-direct-talks-failed-to-produce-a-ceasefire",
    "timestamp": "2025-05-23T13:19:37Z"
  },
  {
    "title": "Trump Threatens EU With a 50% Tariff Starting June 1",
    "description": "\"Our discussions with them are going nowhere!\"\nThe post Trump Threatens EU With a 50% Tariff Starting June 1 first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-threatens-eu-with-a-50-tariff-starting-june-1/",
    "timestamp": "2025-05-23T13:18:13Z"
  },
  {
    "title": "Blow to Trump: Europe gains control over rare earth minerals in Greenland",
    "description": "Blow to Trump: Europe gains control over rare earth minerals in Greenlandspotmedia.ro",
    "link": "https://spotmedia.ro/en/news/business/blow-to-trump-europe-gains-control-over-rare-earth-minerals-in-greenland",
    "timestamp": "2025-05-23T13:18:10Z"
  },
  {
    "title": "How US Mortgage Rates Change if Trump Takes Fannie Mae, Freddie Mac Public",
    "description": "Experts fear that the move, though it could help the government's budget woes, could disrupt the fragile U.S. mortgage market.",
    "link": "https://www.newsweek.com/how-us-mortgages-rates-change-fannie-mae-freddie-mac-public-2076201",
    "timestamp": "2025-05-23T13:18:04Z"
  },
  {
    "title": "UK newspaper The Telegraph set for US ownership",
    "description": "British right-wing newspaper The Telegraph has agreed a takeover by US investment group RedBird Capital Partners, ending a two-year saga marked by UK government intervention over press freedoms. RedBird has struck an “in-principle agreement” to purchase The T…",
    "link": "https://www.digitaljournal.com/world/uk-newspaper-the-telegraph-set-for-us-ownership/article",
    "timestamp": "2025-05-23T13:17:32Z"
  },
  {
    "title": "Trump fires new tariff threats at Apple and EU",
    "description": "President Donald Trump ratcheted up the US trade war on Friday, threatening to impose a new 25 percent levy against Apple, and a 50 percent tariff on the European Union. Lamenting that negotiations with the EU “are going nowhere,” Trump said on Truth Social t…",
    "link": "https://www.digitaljournal.com/world/trump-fires-new-tariff-threats-at-apple-and-eu/article",
    "timestamp": "2025-05-23T13:17:20Z"
  },
  {
    "title": "Merz, Xi discuss Ukraine war, trade woes amid global ‘chaos’",
    "description": "Germany’s Friedrich Merz urged Chinese President Xi Jinping on Friday to support a Ukraine ceasefire push and discussed thorny economic ties, in the leaders’ first call since Merz became chancellor. Asia’s economic giant and Europe’s top economy have long-sta…",
    "link": "https://www.digitaljournal.com/world/merz-xi-discuss-ukraine-war-trade-woes-amid-global-chaos/article",
    "timestamp": "2025-05-23T13:17:20Z"
  },
  {
    "title": "President Trump slaps 50% tariff on EU goods starting June 1st, exempts American-made products",
    "description": "President Trump has announced a 50% tariff on European Union goods starting June 1, 2025, with exemptions for products built in America…\nThe post President Trump slaps 50% tariff on EU goods starting June 1st, exempts American-made products appeared first on …",
    "link": "https://macdailynews.com/2025/05/23/president-trump-slaps-50-tariff-on-eu-goods-starting-june-1st-exempts-american-made-products/",
    "timestamp": "2025-05-23T13:17:19Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Friday",
    "description": "Wall Street was headed for a sharply lower open today on Trump's Apple comments and his call for a straight 50% tariff on the EU.",
    "link": "https://www.cnbc.com/2025/05/23/jim-cramers-top-10-things-to-watch-in-the-stock-market-friday.html",
    "timestamp": "2025-05-23T13:17:04Z"
  },
  {
    "title": "Trump Charges Up Risk-Off Move. Gold Rallies, Yields Fall",
    "description": "10 min ago\nTrump Charges Up Risk-Off Move. Gold Rallies, Yields Fall.\nPresident Donald Trump's series of posts on his Truth Social platform this morning has investors running for safety.\nTrump threatened a 25% tariff on iPhones not made in the U.S. and a 50% …",
    "link": "https://biztoc.com/x/07abc6d68cd9cab2",
    "timestamp": "2025-05-23T13:16:41Z"
  },
  {
    "title": "Trump threatens 25% tariff on iPhones, 50% tariff on EU goods amid trade tensions",
    "description": "President Donald Trump on Friday threatened to impose fresh tariffs on both Apple and the European Union, saying that the iPhone manufacturer and the trading bloc have not heeded to his previous demands. \nIn two quick-fire posts on Truth Social, Trump warned …",
    "link": "https://biztoc.com/x/0115ffba2afd23f7",
    "timestamp": "2025-05-23T13:16:11Z"
  },
  {
    "title": "Enhanced Games AKA ‘Olympics on Steroids’ to Be Held Next Year in Las Vegas",
    "description": "Enhanced Games, a sports competition where performance-enhancing drugs are not only allowed but encouraged, will be held for the first time in May next year, in Las Vegas. Ever wondered how much better top human athletes could be if they were allowed to use p…",
    "link": "https://www.odditycentral.com/events/enhanced-games-aka-olympics-on-steroids-to-be-held-next-year-in-las-vegas.html",
    "timestamp": "2025-05-23T13:16:10Z"
  },
  {
    "title": "Donald Trump’s ‘big, beautiful bill’ faces a swarm of Senate GOP objections",
    "description": "The 1,116-page bill the House passed early Thursday morning to enact President Trump’s ambitious legislative agenda faces a swarm of objections from Senate Republicans. GOP senators are calling for a rewrite of the bill to address concerns ranging from Medica…",
    "link": "https://freerepublic.com/focus/f-news/4318677/posts",
    "timestamp": "2025-05-23T13:16:00Z"
  },
  {
    "title": "Trump threatens 25% tariff on Apple if it does not start making iPhones in America (NBC News)",
    "description": "NBC News:\nTrump threatens 25% tariff on Apple if it does not start making iPhones in America  —  It's the president's latest salvo directly targeting a U.S. company after he hit out at Walmart and Mattel.  —  President Donald Trump has threatened Apple with a…",
    "link": "https://www.memeorandum.com/250523/p25",
    "timestamp": "2025-05-23T13:15:01Z"
  },
  {
    "title": "Johnson again corrals GOP factions to pass Trump's sweeping tax bill (Washington Post)",
    "description": "Washington Post:\nJohnson again corrals GOP factions to pass Trump's sweeping tax bill  —  House Speaker Mike Johnson kept President Donald Trump's trust as he navigated tricky negotiations with lawmakers over the president's top legislative priority.  —  For …",
    "link": "https://www.memeorandum.com/250523/p24",
    "timestamp": "2025-05-23T13:15:01Z"
  },
  {
    "title": "Trump Threatens 25% Tariff on Apple iPhones Made Outside U.S.",
    "description": "President Donald Trump on Friday warned that Apple will face a 25% tariff if it fails to manufacture iPhones inside the United States. The threat follows Apple’s recent move to shift more of its iPhone production to India.\n\n\n\nTrump issued the warning on Truth…",
    "link": "https://www.macobserver.com/news/trump-threatens-25-tariff-on-apple-iphones-made-outside-u-s/",
    "timestamp": "2025-05-23T13:13:54Z"
  },
  {
    "title": "Will U.S deport 10,000 foreign students after Donald Trump's Harvard ban? Here's what you should know",
    "description": "Harvard can't take new foreign students right now. The US government gave the university 72 hours to share some student records. If it doesn't, thousands of students, including many Indians, may have to leave.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-u-s-deport-10000-foreign-students-after-donald-trumps-harvard-ban-heres-what-you-should-know/articleshow/121364380.cms",
    "timestamp": "2025-05-23T13:13:23Z"
  },
  {
    "title": "‘Thanks, Brexit’: UK counts its fortunes as Trump slaps 50% tariff on EU",
    "description": "Donald Trump plans to impose a 50% tariff on European Union exports to America. This action is scheduled to start on June 1, 2025. The United Kingdom is reacting positively. Many feel Brexit is shielding their economy from these tariffs. A new trade understan…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/thanks-brexit-uk-counts-its-fortunes-as-trump-slaps-50-tariff-on-eu/articleshow/121364926.cms",
    "timestamp": "2025-05-23T13:12:45Z"
  },
  {
    "title": "Trump holds swanky dinner for meme coin investors, says ‘Biden administration persecuted crypto innovators’",
    "description": "President Trump hosted a swanky dinner in the DC-area for the biggest investors of his meme coin, telling them \"The Biden administration persecuted crypto innovators.\"",
    "link": "https://www.foxnews.com/politics/trump-holds-swanky-dinner-meme-coin-investors-says-biden-administration-persecuted-crypto-innovators",
    "timestamp": "2025-05-23T13:12:29Z"
  },
  {
    "title": "Friday, May 23, 2025",
    "description": "Health cuts in the tax bill; MAHA report on kids' health; covid vaccines, variants; GLP-1 drugs; cancer deaths; and more. Plus, weekend reads.",
    "link": "https://kffhealthnews.org/morning-briefing/friday-may-23-2025/",
    "timestamp": "2025-05-23T13:10:32Z"
  },
  {
    "title": "Elon Musk is using his Grok chatbot at DOGE to analyze sensitive data belonging to millions of Americans",
    "description": "Billionaire Elon Musk’s DOGE team is expanding use of his artificial intelligence chatbot Grok in the U.S. federal government to analyze data, said three people familiar with the matter, potentially violating conflict-of-interest laws and putting at risk sens…",
    "link": "https://www.fastcompany.com/91340107/elon-musk-using-grok-chatbot-doge-analyze-sensitive-data-belonging-millions-americans",
    "timestamp": "2025-05-23T13:09:51Z"
  },
  {
    "title": "Greenland dumps Donald Trump, signs lucrative minerals deal with Europe in a major blow to the president",
    "description": "Greenland has granted a 30-year mining permit to a Danish-French consortium, Greenland Anorthosite Mining (GAM), for anorthosite extraction, a key component in fiberglass production. This move effectively sidelines US President Donald Trump's ambitions to acq…",
    "link": "https://economictimes.indiatimes.com/news/international/us/greenland-dumps-donald-trump-signs-lucrative-minerals-deal-with-europe-in-a-major-blow-to-the-president/articleshow/121364193.cms",
    "timestamp": "2025-05-23T13:09:33Z"
  },
  {
    "title": "Trump Threatens Apple With Tariffs If it Continues to Produce iPhones Abroad",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said on Friday that tech giant Apple would be subject to 25% tariffs if it continues to produce iPhones outside the United States.",
    "link": "https://sputnikglobe.com/20250523/trump-threatens-apple-with-tariffs-if-it-continues-to-produce-iphones-abroad-1122116740.html",
    "timestamp": "2025-05-23T13:05:55Z"
  },
  {
    "title": "The potential winners and losers from Trump's tax bill",
    "description": "Donald Trump\nAndrew Harnik/Getty Images\nThis post originally appeared in the Business Insider Today newsletter.\nYou can sign up for Business Insider's daily newsletter here.\nHappy Friday! Let me offer a penny for your thoughts while I still can. The Treasury …",
    "link": "https://biztoc.com/x/4be279db10ba83a7",
    "timestamp": "2025-05-23T13:05:32Z"
  },
  {
    "title": "What is Donald Trump's proposed 'Golden Dome' missile defence system and how would it work?",
    "description": "US President Donald Trump announced the Iron Dome-like missile defence project this week. Euronews Next takes a look at what we know so far about it.",
    "link": "https://biztoc.com/x/6af673e0a598521c",
    "timestamp": "2025-05-23T13:05:30Z"
  },
  {
    "title": "Gold gains 2% as trade uncertainty rises",
    "description": "The price of gold increased by more than 2% on Friday as the Trump administration raised the possibility of further tariffs. United States President Donald Trump proposed that levies on imports from t...",
    "link": "https://biztoc.com/x/3f1c1c0f8eaa4fc1",
    "timestamp": "2025-05-23T13:05:19Z"
  },
  {
    "title": "Trump threatens EU with 50% tariff, iPhone maker Apple with 25%",
    "description": "U.S. President Donald Trump cranked up his trade threats on Friday, targeting both smartphone giant Apple and imports from the European Union, sending the global market roiling after weeks of de-escalation provided some reprieve.",
    "link": "https://biztoc.com/x/bb74a71ce705bffe",
    "timestamp": "2025-05-23T13:05:10Z"
  },
  {
    "title": "Trump's student loan policies will be harsh reality for struggling American borrowers, new report says—how you may be affected",
    "description": "U.S. federal student loan borrowers had a lot of leeway under President Joe Biden. That's changing under President Donald Trump.",
    "link": "https://www.cnbc.com/2025/05/23/trumps-student-loan-policies-will-be-harsh-on-us-borrowers-report.html",
    "timestamp": "2025-05-23T13:05:01Z"
  },
  {
    "title": "Trump Slams UK’s North Sea Energy Policy, Again",
    "description": "U.S. President Donald Trump has taken to social media to criticize once again the UK’s energy policy to pursue renewables and tax North Sea oil and gas operators more. Referring to the UK, President Trump posted on Truth Social, “I strongly recommend to them,…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Slams-UKs-North-Sea-Energy-Policy-Again.html",
    "timestamp": "2025-05-23T13:05:00Z"
  },
  {
    "title": "President Trump: iPhone sold in America will be made in America or Apple will pay a 25% tariff",
    "description": "President Trump has announced that he expects Apple to manufacture iPhones sold in the United States domestically, warning CEO Tim Cook…\nThe post President Trump: iPhone sold in America will be made in America or Apple will pay a 25% tariff appeared first on …",
    "link": "https://macdailynews.com/2025/05/23/president-trump-iphone-sold-in-america-will-be-made-in-america-or-apple-will-pay-a-25-tariff/",
    "timestamp": "2025-05-23T13:04:00Z"
  },
  {
    "title": "Inside the room at Trump’s meme coin dinner | CNN Politics",
    "description": "More than 200 wealthy crypto bros gathered for a private event at President Donald Trump’s golf club just outside Washington, DC, on Thursday night — dining on filet mignon and halibut while the president stood at a podium regaling them with tales of his 2024…",
    "link": "https://www.cnn.com/2025/05/23/politics/trump-crypto-meme-coin-dinner",
    "timestamp": "2025-05-23T13:03:55Z"
  },
  {
    "title": "Will Nvidia become victim in USA vs China AI war?",
    "description": "AI or Artificial Intelligence race between world's top two largest economies are getting interesting and Nvidia has become cynosure of all eyes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-nvidia-become-victim-in-usa-vs-china-ai-war/articleshow/121364708.cms",
    "timestamp": "2025-05-23T13:03:37Z"
  },
  {
    "title": "Judge extends block on Trump’s mass layoffs at several agencies | CNN Politics",
    "description": "A federal judge said late Thursday that she will continue to halt President Donald Trump’s orders for mass terminations at several agencies, handing down a preliminary injunction that follows up the temporary restraining order she issued earlier this month.",
    "link": "https://www.cnn.com/2025/05/23/politics/judge-extends-block-on-trumps-mass-layoffs",
    "timestamp": "2025-05-23T13:03:05Z"
  },
  {
    "title": "European stocks tumble, bonds rally after Trump recommends 50% tariff on EU",
    "description": "European stocks tumbled, the euro gave back some gains, and euro zone government bond yields fell sharply on Friday after U.S. President Donald Trump said he is recommending a straight 50% tariff on goods from the European Union starting on June 1.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-tumble-bonds-rally-after-trump-recommends-50-tariff-on-eu/articleshow/121364724.cms",
    "timestamp": "2025-05-23T13:02:47Z"
  },
  {
    "title": "The potential winners and losers from Trump's tax bill",
    "description": "How Trump's tax bill could impact Americans' finances, and the one group that thinks they'll lose out the most.",
    "link": "https://www.businessinsider.com/trump-tax-bill-potential-winners-losers-parents-students-investors-ev-2025-5",
    "timestamp": "2025-05-23T13:02:00Z"
  },
  {
    "title": "Trump Proposes 50% Tariffs on EU Starting From June 1",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said on Friday that the EU is difficult to deal with and trade talks are \"going nowhere,\" adding that he proposes 50% tariffs on the bloc from June 1.",
    "link": "https://sputnikglobe.com/20250523/trump-proposes-50-tariffs-on-eu-starting-from-june-1-1122116636.html",
    "timestamp": "2025-05-23T13:00:46Z"
  },
  {
    "title": "Trump to Apple: Build the iPhone in America or Face a 25% Tariff",
    "description": "The phone would be way more expensive if built in America compared to a 25% tariff.\nThe post Trump to Apple: Build the iPhone in America or Face a 25% Tariff first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-to-apple-build-the-iphone-in-america-or-face-a-25-tariff/",
    "timestamp": "2025-05-23T13:00:25Z"
  },
  {
    "title": "‘Trump’s crypto con’ under fire with new Bill, hours before gala dinner",
    "description": "Trump’s memecoin sees rollercoaster trading and lawmakers introduce the “Stop TRUMP Act.”",
    "link": "https://ambcrypto.com/trumps-crypto-con-under-fire-with-new-bill-hours-before-gala-dinner/",
    "timestamp": "2025-05-23T13:00:24Z"
  },
  {
    "title": "Newly Adopted WHO Pandemic Pact Is a Step Toward ‘Global Surveillance Superstate,’ Expert Warns",
    "description": "After three years of negotiations, delegates to the World Health Organization’s annual meeting have adopted a global pandemic agreement that threatens national sovereignty, requires the... Read More\nThe post Newly Adopted WHO Pandemic Pact Is a Step Toward ‘G…",
    "link": "https://www.dailysignal.com/2025/05/23/newly-adopted-who-pandemic-pact-is-step-toward-global-surveillance-superstate-expert-says/",
    "timestamp": "2025-05-23T13:00:00Z"
  }
]