[
  {
    "title": "GOP lawmaker behind Congress’ Epstein push says Commerce Secretary Lutnick should resign over links | CNN Politics",
    "description": "Republican Rep. Thomas Massie, a co-author of the law that compelled the release of the Jeffrey Epstein files, called on Commerce Secretary Howard Lutnick to resign over his links to the late sex offender.",
    "link": "https://www.cnn.com/2026/02/08/politics/massie-howard-lutnick-epstein-files",
    "timestamp": "2026-02-08T19:35:56Z"
  },
  {
    "title": "In a first for India, a desi aerospace firm gains in-orbit snooping capability, takes images of ISS",
    "description": "India's space sector has achieved a significant milestone as Azista Space successfully imaged the International Space Station from its own satellite. This groundbreaking \"space watch\" capability, demonstrated by the ABA First Runner satellite, marks a first f…",
    "link": "https://timesofindia.indiatimes.com/india/in-a-first-for-india-a-desi-aerospace-firm-gains-in-orbit-snooping-capability-takes-images-of-iss/articleshow/128083737.cms",
    "timestamp": "2026-02-08T19:30:28Z"
  },
  {
    "title": "Iran sentences Nobel laureate and activist Narges Mohammadi to 7 more years in prison",
    "description": "Iran sentenced Nobel Peace Prize laureate Narges Mohammadi to over seven more years in prison after she began a hunger strike, supporters said Sunday.",
    "link": "https://www.pbs.org/newshour/world/iran-sentences-nobel-laureate-and-activist-narges-mohammadi-to-7-more-years-in-prison",
    "timestamp": "2026-02-08T19:29:58Z"
  },
  {
    "title": "Bessent sees ‘unruly’ Chinese trading behind gold price swings",
    "description": "“They’re having to tighten margin requirements. So gold looks to me kind of like a classical, speculative blowoff.”",
    "link": "https://fortune.com/2026/02/08/gold-prices-scott-bessent-unruly-chinese-trading-margin-requirements/",
    "timestamp": "2026-02-08T19:28:15Z"
  },
  {
    "title": "Steve Bannon Sounds the Alarm That Trump’s MAGA Base is Disenchanted: ‘Massive Lack of Enthusiasm’",
    "description": "Steve Bannon said there is a \"massive lack of enthusiasm\" among the MAGA base for President Donald Trump and Republicans heading into the 2026 midterms\nThe post Steve Bannon Sounds the Alarm That Trump’s MAGA Base is Disenchanted: ‘Massive Lack of Enthusiasm’…",
    "link": "https://www.mediaite.com/politics/steve-bannon-sounds-the-alarm-that-trumps-maga-base-is-disenchanted-massive-lack-of-enthusiasm/",
    "timestamp": "2026-02-08T19:21:31Z"
  },
  {
    "title": "Gambling stocks sag as prediction markets steal Super Bowl bets",
    "description": "DraftKings stock is trading around the lowest levels since 2023 and is down more than 60% from its all-time high five years ago.",
    "link": "https://fortune.com/2026/02/08/gambling-stocks-draftkings-flutter-prediction-markets-kalshi-super-bowl-bets/",
    "timestamp": "2026-02-08T19:20:23Z"
  },
  {
    "title": "Calangute sarpanch: Can’t stop works approved under ODP until SC order",
    "description": "Calangute: Until and unless the Supreme Court decides on the appeals, the Calangute panchayat cannot stop any of the ongoing constructions which had b.",
    "link": "https://timesofindia.indiatimes.com/city/goa/calangute-sarpanch-cant-stop-works-approved-under-odp-until-sc-order/articleshow/128083372.cms",
    "timestamp": "2026-02-08T19:15:53Z"
  },
  {
    "title": "Gold price, silver rate predictions: Big corrections expected this week? Analysts have a warning",
    "description": "Gold rate, silver price witnessed extreme volatility as there is a sharp dollar rebound.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-silver-rate-predictions-big-corrections-expected-this-week-analysts-have-a-warning/articleshow/128083301.cms",
    "timestamp": "2026-02-08T19:14:46Z"
  },
  {
    "title": "Did ancient Egypt record biblical giants? A 3,300-year-old text raises new questions",
    "description": "A 3,300-year-old Egyptian papyrus held by the British Museum has reignited debate over whether biblical references to giants reflect historical encounters or myth. The Anastasi I manuscript describes unusually tall Shosu people, drawing interest from faith-ba…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/did-ancient-egypt-record-biblical-giants-a-3300-year-old-text-raises-new-questions/articleshow/128081688.cms",
    "timestamp": "2026-02-08T19:14:16Z"
  },
  {
    "title": "MPA seeks Rs 1,300 crore for capital dredging & berth 9 redevelopment",
    "description": "Panaji: Mormugao Port Authority (MPA) outlined plans to seek Rs 1,300 crore in funding from the ministry of ports, shipping and waterways to redevelop.",
    "link": "https://timesofindia.indiatimes.com/city/goa/mpa-seeks-rs-1300-crore-for-capital-dredging-berth-9-redevelopment/articleshow/128083296.cms",
    "timestamp": "2026-02-08T19:13:48Z"
  },
  {
    "title": "Retired general argues military action against Iran is 'best option' as Trump faces 'historic opportunity'",
    "description": "Retired Gen. Jack Keane advocated for military action against Iran, saying Trump has a \"historic opportunity\" to achieve regime collapse and regional stability.",
    "link": "https://www.foxnews.com/media/retired-general-argues-military-action-against-iran-best-option-trump-faces-historic-opportunity",
    "timestamp": "2026-02-08T19:12:13Z"
  },
  {
    "title": "Iran adds 7 more years to sentence of jailed Nobel Peace laureate, supporters say",
    "description": "Iran sentenced Nobel Peace Prize laureate Narges Mohammadi to over seven more years in prison after she began a hunger strike, supporters said Sunday, as Tehran cracks down on all dissent following nationwide protests and the deaths of thousands at the hands …",
    "link": "https://www.cbc.ca/news/world/nobel-peace-laureate-narges-mohammadi-sentence-hunger-strike-9.7080002",
    "timestamp": "2026-02-08T19:12:08Z"
  },
  {
    "title": "GFP writes to PM, seeks dual citizenship for Goans",
    "description": "Panaji: GFP president Vijai Sardesai wrote to Prime Minister Narendra Modi, appealing for intervention to stop what he termed the “humiliation and har.",
    "link": "https://timesofindia.indiatimes.com/city/goa/gfp-writes-to-pm-seeks-dual-citizenship-for-goans/articleshow/128083214.cms",
    "timestamp": "2026-02-08T19:09:50Z"
  },
  {
    "title": "Investigation continues a week after Savannah Guthrie mother was reported missing",
    "description": "Savannah Guthrie solemnly told the potential kidnappers in a social media video released Saturday that the family was prepared to pay for her safe return.",
    "link": "https://indianexpress.com/article/world/us-news/savannah-guthrie-mother-nancy-missing-arizona-ransom-investigation-updates-10521387/",
    "timestamp": "2026-02-08T19:05:21Z"
  },
  {
    "title": "CNN Political Analyst Calls for ‘Fumigation’ to ‘Surgically Remove the Cancer’ of MAGA",
    "description": "\"Joe Biden was ... supposed to be a bridge or a palette cleanser. Or somebody who morally and ethically was antithetical to who Donald Trump was.\"\nThe post CNN Political Analyst Calls for ‘Fumigation’ to ‘Surgically Remove the Cancer’ of MAGA first appeared o…",
    "link": "https://legalinsurrection.com/2026/02/cnn-political-analyst-calls-for-fumigation-to-surgically-remove-the-cancer-of-maga/",
    "timestamp": "2026-02-08T19:00:40Z"
  },
  {
    "title": "Weird fishes: Alison Healy on obscure competitions and the contestants they attract",
    "description": "Fancy your chances at fish flinging? The knack is to fold the fish first",
    "link": "https://www.irishtimes.com/opinion/an-irish-diary/2026/02/08/weird-fishes-alison-healy-on-obscure-competitions-and-the-contestants-they-attract/",
    "timestamp": "2026-02-08T19:00:01Z"
  },
  {
    "title": "Has Gen Z’s Relationship With Religion Really Shifted? A New Chapter in Belief",
    "description": "President Donald Trump announced Thursday that on May 17, in conjunction with America’s 250 birthday celebration, a prayer event will be held on the National... Read More\nThe post Has Gen Z’s Relationship With Religion Really Shifted? A New Chapter in Belief …",
    "link": "https://www.dailysignal.com/2026/02/08/gen-zs-relationship-with-religion-shifted/",
    "timestamp": "2026-02-08T19:00:00Z"
  },
  {
    "title": "Super Bowl 2026 and Bad Bunny's halftime show: 6 claims we've unpacked",
    "description": "Snopes has looked into numerous claims surrounding the NFL's showpiece event ahead of Bad Bunny's 2026 Super Bowl performance.",
    "link": "https://www.snopes.com/collections/super-bowl-2026-bad-bunny-halftime/",
    "timestamp": "2026-02-08T19:00:00Z"
  },
  {
    "title": "'It was a them thing': Epstein files spotlight Maxwell's role",
    "description": "This week, Ghislaine Maxwell could be a very unwelcome distraction for Donald Trump as she appears before one of America’s top political institutions.",
    "link": "https://www.abc.net.au/news/2026-02-09/epstein-files-spotlight-maxwells-role/106313368",
    "timestamp": "2026-02-08T18:55:39Z"
  },
  {
    "title": "Dana Bash Puts Hakeem Jeffries On The Spot Over Democrats’ Voter ID Stance",
    "description": "CNN's Dana Bash pressed House Minority Leader Hakeem Jeffries on Sunday's  \"State of the Union\" about his opposition to requiring voter ID for elections.",
    "link": "https://dailycaller.com/2026/02/08/dana-bash-confronts-hakeem-jeffries-democrats-voter-identification-stance-cnn-state-union/",
    "timestamp": "2026-02-08T18:54:59Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Feb. 8, 2026",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Sen. Mark Warner and Rep. Tony Gonzales join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-02-08-2026/",
    "timestamp": "2026-02-08T18:53:37Z"
  },
  {
    "title": "Green Day Slams ICE Agents Ahead of Super Bowl Performance",
    "description": "The Super Bowl pre-game band is urging ICE agents to \"quit that shitty job you have.\"",
    "link": "http://www.hollywoodreporter.com/music/music-news/green-day-ice-agents-super-bowl-1236499804/",
    "timestamp": "2026-02-08T18:52:49Z"
  },
  {
    "title": "Japan's 'Iron Lady' leads coalition to landslide election victory",
    "description": "Sanae Takaichi's Liberal Democratic Party and its coalition partner are expected to hold upwards of two-thirds of the seats in Japan's lower house.",
    "link": "https://www.abc.net.au/news/2026-02-09/japan-election-sanae-takaichi-landslide-victory/106320228",
    "timestamp": "2026-02-08T18:52:41Z"
  },
  {
    "title": "Voters are worried about the cost of housing. But Trump wants home prices to keep climbing",
    "description": "“I don’t want to drive housing prices down. I want to drive housing prices up for people that own their homes, and they can be assured that’s what’s going to happen,” Trump told his Cabinet on Jan.…",
    "link": "https://www.ocregister.com/2026/02/08/voters-are-worried-about-the-cost-of-housing-but-trump-wants-home-prices-to-keep-climbing/",
    "timestamp": "2026-02-08T18:47:25Z"
  },
  {
    "title": "Iran’s top diplomat says nation’s power lies in defying pressure: ‘No to the great powers’",
    "description": "Iran's Foreign Minister said Tehran's strength lies in its ability to stand against pressure from \"great powers,\" emphasizing readiness for diplomacy and war.",
    "link": "https://www.foxnews.com/world/irans-top-diplomat-says-nations-power-lies-defying-pressure-no-great-powers",
    "timestamp": "2026-02-08T18:45:48Z"
  },
  {
    "title": "Apps to boycott US goods gained traction in crisis over Greenland",
    "description": "“Maybe we can send a signal and people will listen and we can make a change,” the creator of one app said.",
    "link": "https://www.ocregister.com/2026/02/08/apps-to-boycott-us-goods-gained-traction-in-crisis-over-greenland/",
    "timestamp": "2026-02-08T18:45:29Z"
  },
  {
    "title": "Ukraine says only Trump can end war with Russia",
    "description": "Ukraine's foreign minister stated that direct talks between Ukrainian and Russian leaders are essential to resolve the most challenging issues in peace negotiations. He believes only U.S. President Donald Trump possesses the leverage to broker an agreement, u…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-says-only-trump-can-end-war-with-russia/articleshow/128082446.cms",
    "timestamp": "2026-02-08T18:44:20Z"
  },
  {
    "title": "VIDEO: Nancy Guthrie Ransom Demand Reaches $6 Million",
    "description": "The people claiming to have kidnapped NBC News's Today show host Savannah Guthrie's elderly mother are reportedly demanding a $6 million ransom.\nThe post VIDEO: Nancy Guthrie Ransom Demand Reaches $6 Million appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2026/02/08/video-nancy-guthrie-ransom-demand-reaches-6-million/",
    "timestamp": "2026-02-08T18:37:38Z"
  },
  {
    "title": "Trump calls Olympian Hunter Hess 'loser' over comments about representing US",
    "description": "President Donald Trump took to social media in response to U.S. Olympian Hunter Hess' comments that it's \"hard\" to represent the country right now.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_17ab828b-35d9-4db2-8720-2cdeb1d0fe98",
    "timestamp": "2026-02-08T18:34:04Z"
  },
  {
    "title": "Thomas Massie reacts to microphone incident; says Trump should apologize for racist Obamas meme",
    "description": "“Some of what he does is brash, it's funny, but he's gone past that line, and the public is pushing back in this instance,\" Rep. Massie told WHAS11 on Sunday.",
    "link": "https://www.whas11.com/article/news/local/thomas-massie-microphone-incident-trump-racist-obamas-meme/417-363da00c-fd36-429d-a1ff-cea53b866980",
    "timestamp": "2026-02-08T18:32:52Z"
  },
  {
    "title": "‘Trump Accounts’ Super Bowl Spot Anchors a High-Profile Policy Push",
    "description": "The pregame ad, paid for by advocacy group Invest America, is part of a broader campaign to drive awareness for the new child investment program.",
    "link": "https://www.adweek.com/brand-marketing/trump-accounts-super-bowl-spot/",
    "timestamp": "2026-02-08T18:32:52Z"
  },
  {
    "title": "HHS Secretary RFK Jr. reveals his Super Bowl splurge ahead of the big game: ‘Meat and ferments’",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. revealed his top Super Bowl snacks Sunday ahead of the big game.",
    "link": "https://nypost.com/2026/02/08/us-news/rfk-jr-reveals-his-super-bowl-splurge-ahead-of-big-game-meat-and-ferments/",
    "timestamp": "2026-02-08T18:32:11Z"
  },
  {
    "title": "US To Pay Billions To United Nations",
    "description": "Trump administration announces initial UN payment within weeks. Ambassador Waltz demands continued reforms, cites bloated bureaucracy & seven climate agencies.",
    "link": "https://dailycaller.com/2026/02/08/us-pay-billions-united-nations-waltz-reform/",
    "timestamp": "2026-02-08T18:29:18Z"
  },
  {
    "title": "Trump targets 'real loser' American Olympic skier in angry screed: 'Hard to root for'",
    "description": "Donald Trump Sunday set his sights on an American Olympic skier currently on the U.S. team in the winter Olympics, calling the athlete a \"real loser\" who is \"hard to root for.\"Trump targeted Hunter Hess, who recently expressed misgivings about ICE killing Ame…",
    "link": "https://www.rawstory.com/trump-olympics-2675158868/",
    "timestamp": "2026-02-08T18:27:28Z"
  },
  {
    "title": "GOP Congressman Abruptly Pivots When Asked if Trump Should Apologize For Racist Post",
    "description": "Tony Gonzales made a wild pivot when asked Sunday whether Donald Trump should apologize for the racist post that appeared on his social media account.\nThe post GOP Congressman Abruptly Pivots When Asked if Trump Should Apologize For Racist Post first appeared…",
    "link": "https://www.mediaite.com/media/news/gop-congressman-abruptly-pivots-when-asked-if-trump-should-apologize-for-racist-post/",
    "timestamp": "2026-02-08T18:18:41Z"
  },
  {
    "title": "Songs That Bad Bunny Should Perform At The Super Bowl",
    "description": "We’re a little more than 48 hours away from being treated to a free televised Bad Bunny concert that will include a football game on the side, and while MAGA patiently waits for any and every reason to hate on the upcoming Super Bowl halftime show on social m…",
    "link": "https://hiphopwired.com/3033341/songs-that-bad-bunny-should-perform-at-the-super-bowl/",
    "timestamp": "2026-02-08T18:16:43Z"
  },
  {
    "title": "Savannah Guthrie pleads for safe return of mother, says 'We will pay'",
    "description": "Savannah Guthrie has told the potential kidnappers of her mother Nancy Guthrie that the family is prepared to pay for her safe return",
    "link": "https://www.wftv.com/news/national/we-will-pay-savannah/6FZUEENK4AYJNAPRNXQB2UPHTE/",
    "timestamp": "2026-02-08T18:15:25Z"
  },
  {
    "title": "Bad Bunny delivers a heartfelt homage to Puerto Rico on the Super Bowl halftime stage",
    "description": "The 31-year-old Puerto Rican superstar took to an elaborate set depicting his home island’s landscape on Saturday night, delivering a high-energy performance filled with hit tracks.",
    "link": "https://www.cbc.ca/news/entertainment/bad-bunny-half-time-show-9.7078043",
    "timestamp": "2026-02-08T18:15:07Z"
  },
  {
    "title": "Trump insults US freestyler as a 'real Loser'",
    "description": "US President Donald Trump insulted US freestyler Hunter Hess following Hess' comments about the current situation in the United States. \"U.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_121b10fd-aaf8-45d8-aed8-9cae313a69ba",
    "timestamp": "2026-02-08T18:13:28Z"
  },
  {
    "title": "Japan’s Takaichi Scores Historic Landslide in Snap Election Gamble",
    "description": "Japanese Prime Minister Takaichi Sanae’s wager on a snap election paid off spectacularly Sunday, with her Liberal Democratic Party securing an unprecedented single-handed two-thirds majority in the 465-seat lower house – a feat the party has never previously …",
    "link": "https://variety.com/2026/politics/news/japan-election-takaichi-win-1236656213/",
    "timestamp": "2026-02-08T18:08:35Z"
  },
  {
    "title": "Iran sentences locked-up Nobel Peace Prize winner to seven more years in prison during hunger strike",
    "description": "The new convictions against Narges Mohammadi come as Iran tries to negotiate with the United States over its nuclear program to avert a threatened military strike by President Trump.",
    "link": "https://nypost.com/2026/02/08/world-news/iran-sentences-nobel-peace-prize-winner-narges-mohammadi-to-seven-more-years-in-prison/",
    "timestamp": "2026-02-08T18:04:45Z"
  },
  {
    "title": "“My party is taking up for pedophiles”: Massie explains split with MAGA, Trump",
    "description": "The Kentucky representative explained his ongoing feud with President Donald Trump in an interview with CNN.",
    "link": "https://www.salon.com/2026/02/08/my-party-is-taking-up-for-pedophiles-massie-explains-split-with-maga-trump/",
    "timestamp": "2026-02-08T18:02:32Z"
  },
  {
    "title": "Transcript: David Becker on \"Face the Nation with Margaret Brennan,\" Feb. 8, 2026",
    "description": "The following is the transcript of the interview with David Becker, executive director of the Center for Election Innovation and Research and a CBS News election law contributor, that aired on \"Face the Nation with Margaret Brennan\" on Feb. 8, 2026.",
    "link": "https://www.cbsnews.com/news/david-becker-election-law-face-the-nation-transcript-02-08-2026/",
    "timestamp": "2026-02-08T18:02:27Z"
  },
  {
    "title": "Super Bowl: How to watch Taika Waititi’s Super Bowl appearance and why non-sports fans should still watch",
    "description": "From the rules simplified to history being made, here's everything you need to know.",
    "link": "https://www.nzherald.co.nz/entertainment/how-to-watch-taika-waititis-super-bowl-appearance-and-why-non-sports-fans-should-still-watch/2TANAIPBORCOZLEUAA7FYXJ7TM/",
    "timestamp": "2026-02-08T18:00:00Z"
  },
  {
    "title": "T20 World Cup 2026: President Donald Trump says America is rooting for USA Cricket team. How to watch matches live for free in U.S, Canada?",
    "description": "T20 World Cup matches are live streamed for free in the U.S. and Canada. The US had co-hosted the 2024 ICC Men's T20 World Cup",
    "link": "https://economictimes.indiatimes.com/news/international/us/t20-world-cup-2026-president-donald-trump-says-america-is-rooting-for-usa-cricket-team-how-to-watch-matches-live-for-free-in-u-s-canada/articleshow/128080129.cms",
    "timestamp": "2026-02-08T17:46:19Z"
  },
  {
    "title": "Jon Jones Rips 'Absolute Asshole' Who Leaked Arthritis Revelation",
    "description": "Jon Jones didn’t want the whole world to know that he has arthritis.",
    "link": "https://www.sherdog.com/news/news/Jon-Jones-Rips-Absolute-Asshole-Who-Leaked-Arthritis-Revelation-200061",
    "timestamp": "2026-02-08T17:44:34Z"
  },
  {
    "title": "Is Bad Bunny a U.S. Citizen? Super Bowl Backlash Sparks Confusion",
    "description": "Bad Bunny, the 31-year-old Puerto Rican superstar headlining today’s (February 8) 2026 Super Bowl halftime show, has faced a wave of online backlash, including questions about whether he’s a U.S. citizen amid backlash and criticism from some conservative comm…",
    "link": "https://www.justjared.com/2026/02/08/is-bad-bunny-a-u-s-citizen-super-bowl-backlash-sparks-confusion/",
    "timestamp": "2026-02-08T17:43:10Z"
  },
  {
    "title": "‘He Should Just Resign!’ Massie Calls for Trump Commerce Secretary to Step Down Over Epstein Ties in Blistering CNN Interview",
    "description": "Rep. Thomas Massie (R-KY) is calling for President Trump's Commerce Secretary, Howard Lutnick, to resign over his ties to the late sex trafficker.\nThe post ‘He Should Just Resign!’ Massie Calls for Trump Commerce Secretary to Step Down Over Epstein Ties in Bl…",
    "link": "https://www.mediaite.com/media/news/he-should-just-resign-massie-calls-for-trump-commerce-secretary-to-step-down-over-epstein-ties-in-blistering-cnn-interview/",
    "timestamp": "2026-02-08T17:41:41Z"
  },
  {
    "title": "Democrats will stop Trump from trying to nationalize midterms, Jeffries says",
    "description": "Top House Democrat says president’s suggestion for Republicans to ‘take over’ elections really means ‘steal it’",
    "link": "https://www.yahoo.com/news/articles/democrats-stop-trump-trying-nationalize-174105435.html",
    "timestamp": "2026-02-08T17:41:05Z"
  },
  {
    "title": "Donald Trump wishes Team USA luck in T20 World Cup in India",
    "description": "US President Donald Trump wished Team USA good luck in the T20 World Cup in India, saying America is rooting for the players as the tournament continues.",
    "link": "https://www.thehindubusinessline.com/news/sports/donald-trump-wishes-team-usa-luck-in-t20-world-cup-in-india/article70608537.ece",
    "timestamp": "2026-02-08T17:40:33Z"
  },
  {
    "title": "Tim Cook Reportedly Reassures Apple Employees That He Doesn’t Want His Friend Trump to Deport Them",
    "description": "Cook and Trump seem to have a difference of opinion on immigration.",
    "link": "https://gizmodo.com/tim-cook-trump-immigration-disagreement-lobbying-2000718266",
    "timestamp": "2026-02-08T17:40:24Z"
  },
  {
    "title": "“Bring her home”: Guthrie pleads with kidnappers in heartbreaking video",
    "description": "The \"Today\" show host offered to pay a ransom for the return of her mother, who has been missing for a week.",
    "link": "https://www.salon.com/2026/02/08/bring-her-home-guthrie-pleads-with-kidnappers-in-heartbreaking-video/",
    "timestamp": "2026-02-08T17:32:39Z"
  },
  {
    "title": "4 House Primaries You Need to Watch",
    "description": "2026 will be a decisive year for the balance of power in the House of Representatives, as voters go to the polls and decide whether... Read More\nThe post 4 House Primaries You Need to Watch appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/08/4-house-primaries-you-need-to-watch/",
    "timestamp": "2026-02-08T17:30:00Z"
  },
  {
    "title": "Trump predicts major DOW milestone after record-breaking market close | Fox News Video",
    "description": "Treasury Secretary Scott Bessent discusses the Dow Jones Industrial Average hitting the 50,000 milestone, the future of the 'Clarity Act' and the ongoing legal battle over President Donald Trump's tariff authority on 'Sunday Morning Futures.'",
    "link": "https://www.foxnews.com/video/6388958472112",
    "timestamp": "2026-02-08T17:29:16Z"
  },
  {
    "title": "Iranian Nobel laureate Narges Mohammadi sentenced to seven more years in jail",
    "description": "Iranian Nobel Peace Prize laureate Narges Mohammadi has been sentenced to seven more years in prison after she began a hunger strike, supporters said.",
    "link": "https://www.independent.ie/world-news/middle-east/iranian-nobel-laureate-narges-mohammadi-sentenced-to-seven-more-years-in-jail/a1665221478.html",
    "timestamp": "2026-02-08T17:27:15Z"
  },
  {
    "title": "Team USA Figure Skater Amber Glenn Speaks Up for LGBTQ+ Community Amid \"Hard Times\" With Trump Administration",
    "description": "Amber Glenn, Team USA figure skater, talked about President Donald Trump's effect on the LGBTQ+ community in a press conference at the 2026 Winter Olympics.",
    "link": "https://www.cosmopolitan.com/entertainment/a70279491/team-usa-figure-skater-amber-glenn-lgbtq-community-hard-times-trump-administration/",
    "timestamp": "2026-02-08T17:26:00Z"
  },
  {
    "title": "Unmasking ICE in Philly could test the limits of local power over federal agents",
    "description": "The widespread use of facial coverings by U.S. Immigration and Customs Enforcement officers is among the suite of tactics that have fueled immigration advocates’ use of terms like “kidnappings” and “abductions.”",
    "link": "https://www.pennlive.com/nation-world/2026/02/unmasking-ice-in-philly-could-test-the-limits-of-local-power-over-federal-agents.html",
    "timestamp": "2026-02-08T17:24:12Z"
  },
  {
    "title": "DAVID MARCUS: In rural Virginia, mixed signals for Trump and the GOP",
    "description": "Trump's poll numbers show wild swings, but what do voters really think? A Virginia trip reveals the complex reality behind conflicting polling surveys.",
    "link": "https://www.foxnews.com/opinion/david-marcus-rural-virginia-mixed-signals-trump-gop",
    "timestamp": "2026-02-08T17:14:16Z"
  },
  {
    "title": "​Trump 'buying' Maxwell's silence to protect 'Epstein island afterparty' admin: lawmaker",
    "description": "Rep. Melanie Stansbury (D-NM) accused President Donald Trump on Sunday of openly trying to “buy” the silence of a key witness in Congress’ investigation into Jeffrey Epstein, and all to protect his “Epstein island afterparty” administration.Ghislaine Maxwell,…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-2675150180/",
    "timestamp": "2026-02-08T17:12:52Z"
  },
  {
    "title": "Feds arrest Trumbull County man accused of threatening Trump, ICE",
    "description": "NORTH BLOOMFIELD, Ohio - Federal agents arrested a Trumbull County man Wednesday morning after he allegedly posted a series of graphic threats on YouTube targeting immigration officers, politicians, and American citizens. Charles Bronson Ingram, 47, of North …",
    "link": "https://freerepublic.com/focus/f-chat/4365978/posts",
    "timestamp": "2026-02-08T17:11:04Z"
  },
  {
    "title": "Israel tightens grip on West Bank ahead of Netanyahu’s visit to US | CNN",
    "description": "Ahead of Israeli Prime Minister Benjamin Netanyahu’s visit to Washington, DC, this week, Israel has taken a series of sweeping steps to tighten its grip on the occupied West Bank.",
    "link": "https://www.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
    "timestamp": "2026-02-08T17:10:59Z"
  },
  {
    "title": "‘You Don’t Have To Speak Spanish To Feel That Vibe.’ Jon Hamm Addresses ‘Outrage’ Over Bad Bunny Performing At The Super Bowl",
    "description": "Jon Hamm didn't hold back his thoughts.",
    "link": "https://www.cinemablend.com/television/jon-hamm-addresses-outrage-bad-bunny-performing-super-bowl",
    "timestamp": "2026-02-08T17:09:31Z"
  },
  {
    "title": "Transcript: Sen. Mark Warner on \"Face the Nation with Margaret Brennan,\" Feb. 8, 2026",
    "description": "The following is the transcript of the interview with Sen. Mark Warner, Democrat of Virginia, that aired on \"Face the Nation with Margaret Brennan\" on Feb. 8, 2026.",
    "link": "https://www.cbsnews.com/news/mark-warner-virginia-demoract-face-the-nation-transcript-02-08-2026/",
    "timestamp": "2026-02-08T17:04:43Z"
  },
  {
    "title": "This Trump obsession has caused only harm — and remains a danger to the whole world",
    "description": "Whenever Donald Trump mucks around in any serious international situation, as the world’s self-anointed savior, odds are things will only get worse. Iran is a good example.In 2015, the US was part of an international coalition that reached agreement with Iran…",
    "link": "https://www.rawstory.com/raw-investigates/trump-iran-2675086614/",
    "timestamp": "2026-02-08T17:01:34Z"
  },
  {
    "title": "GOP Rep. Lawler: Trump Should Apologize for Obama Meme",
    "description": "Sunday on ABC's \"This Week,\" Rep. Mike Lawler (R-NY) said President Donald Trump should apologize for the now-deleted social media post that included caricatures of Barack and Michelle Obama.\nThe post GOP Rep. Lawler: Trump Should Apologize for Obama Meme app…",
    "link": "https://www.breitbart.com/clips/2026/02/08/gop-rep-lawler-trump-should-apologize-for-obama-meme/",
    "timestamp": "2026-02-08T17:00:54Z"
  },
  {
    "title": "Trump blasts Olympic skier over comments about representing US",
    "description": "Feb 8 : U.S. President Donald Trump criticized American Olympic skier Hunter Hess on Sunday, days after the athlete expressed mixed feelings about representing the U.S. at the Winter Olympics in northern Italy.\"If that's the case, he shouldn't have tried out …",
    "link": "https://www.channelnewsasia.com/sport/trump-blasts-olympic-skier-over-comments-about-representing-us-5916206",
    "timestamp": "2026-02-08T17:00:01Z"
  },
  {
    "title": "White House Staff Say Donald Trump is 'Off His Meds' After Posting Video of Barack and Michelle Obama as Apes",
    "description": "White House staff say Trump is 'off his meds' after posting racist Obama video on Truth Social.",
    "link": "https://radaronline.com/p/white-house-staff-donald-trump-off-meds-video-barack-michelle-obama-apes/",
    "timestamp": "2026-02-08T17:00:00Z"
  },
  {
    "title": "Trump criticizes Olympic skier over comments about representing US",
    "description": "Feb 8 : U.S. President Donald Trump criticized American Olympic skier Hunter Hess on Sunday, days after the athlete expressed mixed feelings about representing the U.S. at the Winter Olympics in northern Italy.\"If that's the case, he shouldn't have tried out …",
    "link": "https://www.channelnewsasia.com/sport/trump-criticizes-olympic-skier-over-comments-about-representing-us-5916206",
    "timestamp": "2026-02-08T17:00:00Z"
  },
  {
    "title": "Denuclearizing North Korea Is Unrealistic",
    "description": "The Trump administration should prioritize arms control and stable relations with Pyongyang.\nThe post Denuclearizing North Korea Is Unrealistic appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/denuclearizing-north-korea-is-unrealistic/",
    "timestamp": "2026-02-08T17:00:00Z"
  },
  {
    "title": "Iran sentences Nobel laureate Narges Mohammadi to 7 more years in prison",
    "description": "Nobel laureate Narges Mohammadi received over seven additional years in prison and an internal exile sentence after beginning a hunger strike. This crackdown on dissent follows nationwide protests and comes as Iran negotiates its nuclear program with the U.S.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/iran-sentences-nobel-laureate-narges-mohammadi-to-7-more-years-in-prison/articleshow/128078914.cms",
    "timestamp": "2026-02-08T16:59:56Z"
  },
  {
    "title": "Nancy Guthrie's Alleged Kidnappers’ Demands Revealed in Ransom Letter",
    "description": "One of the reported demands for Nancy Guthrie’s safe return has been revealed. The person or people who allegedly took Today cohost Savannah Guthrie’s mom, 84, have asked for the family to pay them millions of dollars in bitcoin, according to a local news sta…",
    "link": "https://www.usmagazine.com/celebrity-news/news/nancy-guthrie-kidnappers-ransom-letter-demands-reportedly-revealed/",
    "timestamp": "2026-02-08T16:57:58Z"
  },
  {
    "title": "Days after big layoffs at The Washington Post, publisher Will Lewis says he's stepping down",
    "description": "Washington Post publisher Will Lewis said Saturday that he's stepping down, ending a troubled tenure days after the newspaper said that it was laying off one-third of its staff.",
    "link": "https://www.pbs.org/newshour/nation/days-after-big-layoffs-at-the-washington-post-publisher-will-lewis-says-hes-stepping-down",
    "timestamp": "2026-02-08T16:53:20Z"
  },
  {
    "title": "Israel to take more West Bank powers and relax settler land buys, media say",
    "description": "Israel's security cabinet has approved new measures. These steps will make it easier for settlers in the occupied West Bank to buy land. Israeli authorities will also gain more enforcement powers over Palestinians. Palestinian President Mahmoud Abbas called t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-to-take-more-west-bank-powers-and-relax-settler-land-buys-media-say/articleshow/128078409.cms",
    "timestamp": "2026-02-08T16:47:28Z"
  },
  {
    "title": "Every trade deal provides for a re-balancing of concessions: Goyal",
    "description": "Union Minister Piyush Goyal discusses India's trade deal with the US amidst concerns over Russian oil purchases and tariff implications.",
    "link": "https://www.thehindubusinessline.com/economy/every-trade-deal-provides-for-a-re-balancing-of-concessions-goyal/article70608400.ece",
    "timestamp": "2026-02-08T16:46:14Z"
  },
  {
    "title": "Trump Refuses To Apologize For Racist Ape Video Of Obamas, Says He ‘Didn’t See’ It: ‘I Didn’t Make A Mistake’",
    "description": "President Donald Trump is doubling down amid bipartisan backlash for posting a racist video depicting former President Barack Obama and former first lady Michelle Obama as apes. While the late Thursday night video has since been removed, Trump insists he did …",
    "link": "https://bossip.com/4353430/trump-refuses-apology-racist-video-depicting-obamas-as-apes/",
    "timestamp": "2026-02-08T16:45:53Z"
  },
  {
    "title": "‘Rats are leaving the ship’: Scott Bessent says U.S. Treasury has new goal as ‘economic chaos’ in Iran becomes ‘crazy’",
    "description": "'What doesn't work is handing the regime pallets of cash like we saw in Democratic administrations'",
    "link": "https://www.wnd.com/2026/02/rats-are-leaving-ship-scott-bessent-says-u/",
    "timestamp": "2026-02-08T16:45:03Z"
  },
  {
    "title": "Kid Rock says Turning Point USA’s Super Bowl halftime show is for ‘underserved’ Americans",
    "description": "Turning Point USA’s halftime show will air at the same time as Bad Bunny’s Super Bowl performance",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/kid-rock-super-bowl-halftime-show-tpusa-b2916229.html",
    "timestamp": "2026-02-08T16:42:15Z"
  },
  {
    "title": "Democratic Sen. Schiff says Trump intends to 'subvert' 2026 midterm elections",
    "description": "\"They're willing to go to extraordinary and lawless lengths,\" Schiff said.",
    "link": "https://abcnews.go.com/Politics/democratic-sen-schiff-trump-intends-subvert-2026-midterm/story?id=129964131",
    "timestamp": "2026-02-08T16:40:19Z"
  },
  {
    "title": "Boycott on US goods in Greenland surges as app sees massive spike in downloads",
    "description": "The creator of the “Made O’Meter” app, Ian Rosenfeldt, said he saw around 30,000 downloads of the free app in just three days at the height of the trans-Atlantic diplomatic crisis in late January out of more than 100,000 since it was launched in March.",
    "link": "https://nypost.com/2026/02/08/tech/apps-to-boycott-us-goods-over-greenland/",
    "timestamp": "2026-02-08T16:40:14Z"
  },
  {
    "title": "Trump Trashes Olympic Skier Who Says He Has ‘Mixed Emotions’ Representing US: ‘A Real Loser’",
    "description": "President Donald Trump attacked Olympic skier Hunter Hess for saying he has \"mixed emotions\" about representing the U.S. at the 2026 Games.\nThe post Trump Trashes Olympic Skier Who Says He Has ‘Mixed Emotions’ Representing US: ‘A Real Loser’ first appeared on…",
    "link": "https://www.mediaite.com/media/news/trump-trashes-olympic-skier-who-says-he-has-mixed-emotions-representing-us-a-real-loser/",
    "timestamp": "2026-02-08T16:39:59Z"
  },
  {
    "title": "Trump Trashes Olympic Skier Who Says He Has ‘Mixed Emotions’ Representing US: ‘A Real Loser’",
    "description": "President Donald Trump attacked Olympic skier Hunter Hess for saying he has \"mixed emotions\" about representing the U.S. at the 2026 Games.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d342b5e7-6987-4919-934e-2ae3e09d8296",
    "timestamp": "2026-02-08T16:39:59Z"
  },
  {
    "title": "Israel to take more West Bank powers and relax settler land buys, media say",
    "description": "JERUSALEM, Feb 8 (Reuters) - Israel’s security cabinet approved a series of steps on Sunday that would make it easier for settlers in the occupied West Bank to buy land w… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/08/israel-to-take-more-west-bank-powers-and-relax-settler-land-buys-media-say",
    "timestamp": "2026-02-08T16:34:25Z"
  },
  {
    "title": "Canada and France move into Greenland as US eyes the island",
    "description": "Canada and France have established consulates in Greenland after President Donald Trump doubled down on the US claim to the Danish territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632169-canada-france-open-consulates-greenland-us-rift-trump/",
    "timestamp": "2026-02-08T16:33:14Z"
  },
  {
    "title": "RFK Jr backs beef, declaring 'war on protein is over' as he thanks America's cattle ranchers",
    "description": "Speaking in Nashville, RFK Jr. declared the \"war on protein is over\" at the cattle ranchers event Cattlecon, announcing \"beef is back on the menu\" under new dietary guidelines.",
    "link": "https://www.foxnews.com/food-drink/rfk-jr-backs-beef-declaring-war-protein-over-he-thanks-americas-cattle-ranchers",
    "timestamp": "2026-02-08T16:30:30Z"
  },
  {
    "title": "The single crushing problem American cattle ranchers wish Trump would fix instead",
    "description": "Trump expands beef imports to cut prices, but American cattle ranchers say the real problem squeezing their profits lies elsewhere.",
    "link": "https://www.foxnews.com/politics/single-crushing-problem-american-cattle-ranchers-wish-trump-would-fix-instead",
    "timestamp": "2026-02-08T16:28:53Z"
  },
  {
    "title": "A Diminishing Special Providence: A Plea for Humility and Self-Awareness Prior to War With Iran",
    "description": "God has a special providence for fools, drunkards and the United States of America. ~Otto von Bismarck (attributed) It is the same in all wars; the soldiers do the fighting, the journalists do the shouting, and no true patriot ever gets near a front-line tren…",
    "link": "https://www.antiwar.com/blog/2026/02/08/a-diminishing-special-providence-a-plea-for-humility-and-self-awareness-prior-to-war-with-iran/",
    "timestamp": "2026-02-08T16:27:02Z"
  },
  {
    "title": "\"His Brain Is Sinking\" — Medical Expert Sounds the Alarm on Trump’s Cognitive Health",
    "description": "Donald Trump’s cognitive health sparked renewed scrutiny as expert pointed to \"frontal lobe\" issues.",
    "link": "https://www.inquisitr.com/his-brain-is-sinking-medical-expert-sounds-the-alarm-on-trumps-cognitive-health",
    "timestamp": "2026-02-08T16:20:50Z"
  },
  {
    "title": "Green Day Issue Warning to ICE Agents During Pre-Super Bowl Party",
    "description": "\"Quit your sh-tty ass job,\" Armstrong told ICE agents before warning them about what'll happen \"when this is over.\" Continue reading…",
    "link": "https://loudwire.com/green-day-billie-joe-armstrong-warning-ice-agents-super-bowl/",
    "timestamp": "2026-02-08T16:17:30Z"
  },
  {
    "title": "Epstein confirmation of death dated one day before he was found discovered in files",
    "description": "The Manhattan US Attorney’s office document has caused some confusion",
    "link": "https://www.ladbible.com/news/us-news/jeffrey-epstein-files-document-death-one-day-before-110890-20260208",
    "timestamp": "2026-02-08T16:15:38Z"
  },
  {
    "title": "Trump’s plan to send home prices higher will help him with baby boomer voters ahead of midterm elections but could spark a ‘generational war’",
    "description": "In the 2024 presidential election, 81% of Trump's voters were homeowners, according to AP VoteCast data.",
    "link": "https://fortune.com/2026/02/08/housing-market-affordability-crisis-trump-plan-home-prices-baby-boomer-voters-midterm-elections-generational-war/",
    "timestamp": "2026-02-08T16:15:30Z"
  },
  {
    "title": "'Oh, come on': CNN's friendly Trump appointee interview goes sideways with one statement",
    "description": "Mehmet Oz, President Donald Trump’s administrator for the Centers of Medicare and Medicaid, made a remark Sunday that caught CNN’s Dana Bash so off guard that it instantly upended the otherwise friendly interview.Oz was speaking to the Trump administration’s …",
    "link": "https://www.rawstory.com/mehmet-oz-2675146373/",
    "timestamp": "2026-02-08T16:11:33Z"
  },
  {
    "title": "Who is Leqaa Kordia, the Columbia protester still in ICE detention?",
    "description": "Palestinian woman in custody for nearly a year is hospitalised in the US after a seizure at detention facility.",
    "link": "https://www.aljazeera.com/news/2026/2/8/who-is-leqaa-kordia-the-columbia-protester-still-in-ice-detention",
    "timestamp": "2026-02-08T16:10:52Z"
  }
]