[
  {
    "title": "The President Holds the Trump Card in His Meeting with Putin. Will He Play It?",
    "description": "The President Holds the Trump Card in His Meeting with Putin. Will He Play It?btm25@yale.edu\nWed, 08/13/2025 - 10:37\n Faculty Viewpoints\n <li>\n Jeffrey A. Sonnenfeld\n\n\n Senior Associate Dean for Leadership Studies & Lester Crown Professor in the Practice of M…",
    "link": "https://insights.som.yale.edu/insights/the-president-holds-the-trump-card-in-his-meeting-with-putin-will-he-play-it",
    "timestamp": "2025-08-13T14:37:57Z"
  },
  {
    "title": "Glanbia weighs impact of reciprocal tariffs on investment decisions",
    "description": "The tariffs imposed by President Donald Trump, and reciprocal taxes imposed by other countries on imports from the US, are prompting Glanbia to carefully assess its future capital allocation, according to chief financial officer Mark Garvey.",
    "link": "https://www.independent.ie/irish-news/glanbia-weighs-impact-of-reciprocal-tariffs-on-investment-decisions/a34918554.html",
    "timestamp": "2025-08-13T14:37:26Z"
  },
  {
    "title": "Hopes Are High For An Interest Rate Cut Next Month—Here’s What To Know",
    "description": "Wall Street’s fear gauge fell to its lowest level this year after inflation appeared to slow down.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/13/hopes-are-high-for-an-interest-rate-cut-next-month-heres-what-to-know/",
    "timestamp": "2025-08-13T14:37:04Z"
  },
  {
    "title": "‘You May Be Misremembering’: Scott Jennings, Maxwell Frost Duke It Out Over Trump’s Smithsonian Vetting",
    "description": "Salem Radio Network host Scott Jennings corrected Democratic Rep. Maxwell Frost of Florida over the tearing down of statues during the 2020 George Floyd riots.",
    "link": "https://dailycaller.com/2025/08/13/you-may-be-misremembering-scott-jennings-maxwell-frost-duke-it-out-over-trumps-smithsonian-vetting/",
    "timestamp": "2025-08-13T14:35:43Z"
  },
  {
    "title": "China Rival Eyes More US Weapons: Full List",
    "description": "The Trump administration has urged Taiwan to boost its defense spending amid China's rapid military buildup.",
    "link": "https://www.newsweek.com/taiwan-eyes-more-us-weapons-china-2112814",
    "timestamp": "2025-08-13T14:35:40Z"
  },
  {
    "title": "I Walked Through Trump’s D.C. Hellscape. It’s Now Clear What Exactly the Feds Are Doing Here.",
    "description": "It’s not what the president would have you believe.",
    "link": "https://slate.com/news-and-politics/2025/08/trumps-washington-dc-takeover-heres-what-the-feds-are-really-doing.html",
    "timestamp": "2025-08-13T14:35:30Z"
  },
  {
    "title": "U.S. national debt soars past $37 trillion — now bigger than the economy; is Trump’s record tariff windfall enough as deficit hits historic highs? Key numbers inside",
    "description": "U.S. debt hits $37 trillion as President Donald Trump’s sweeping tariffs pump billions into federal coffers, yet the nation’s deficit keeps growing. Treasury figures confirm America is adding roughly $1 trillion to its debt every five months — a pace unseen i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-national-debt-soars-past-37-trillion-now-bigger-than-the-economy-is-trumps-record-tariff-windfall-enough-as-deficit-hits-historic-highs-key-numbers-inside/articleshow/123282970.cms",
    "timestamp": "2025-08-13T14:34:32Z"
  },
  {
    "title": "Trump's pride vs Putin's legacy: What to expect from pivotal summit",
    "description": "An Alaskan army base will be the focus of the world's media when the two leaders come face to face - here's what three of our correspondents think it could mean for the two men and Ukraine.",
    "link": "https://news.sky.com/story/trumps-pride-vs-putins-legacy-what-to-expect-from-pivotal-summit-13411124",
    "timestamp": "2025-08-13T14:34:00Z"
  },
  {
    "title": "Is This the Hardest Physical Contest in the World?",
    "description": "The Best Ranger Competition belies the idea that the Army is weak or “woke.”",
    "link": "https://www.theatlantic.com/national-security/archive/2025/08/army-best-ranger-competition/683848/",
    "timestamp": "2025-08-13T14:33:54Z"
  },
  {
    "title": "Trump Will Announce First Kennedy Center Honorees Since Takeover Today—Rumored Winners Include ‘Kiss’",
    "description": "The Washington Post reported honorees may include country singer George Strait and rock band Kiss.",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/13/trump-will-announce-first-kennedy-center-honorees-since-takeover-today-rumored-winners-include-kiss/",
    "timestamp": "2025-08-13T14:33:44Z"
  },
  {
    "title": "Macron: US wants ceasefire in Ukraine",
    "description": "French President Emmanuel Macron said following a call with United States President Donald Trump and European leaders on Wednesday that the US wants to negotiate a ceasefire between Russia and Ukraine...",
    "link": "https://biztoc.com/x/79cb6ab04cdfeb5f",
    "timestamp": "2025-08-13T14:33:10Z"
  },
  {
    "title": "Court rules Trump admin can freeze foreign aid",
    "description": "A United States appeals court ruled on Wednesday that the administration of President Donald Trump can freeze billions of dollars in foreign aid programs allocated by Congress for the year 2024. The c...",
    "link": "https://biztoc.com/x/e9a5666bf785605c",
    "timestamp": "2025-08-13T14:33:00Z"
  },
  {
    "title": "MS-13 Gang Member Serving Time for Murder Suing Trump to Be 'Recognized' as Female",
    "description": "An MS-13 gang member serving time in prison for murder is suing President Donald Trump to be \"recognized\" as a woman.\nThe post MS-13 Gang Member Serving Time for Murder Suing Trump to Be ‘Recognized’ as Female appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/13/ms-13-gang-member-serving-time-for-murder-suing-trump-to-be-recognized-as-female/",
    "timestamp": "2025-08-13T14:31:55Z"
  },
  {
    "title": "Julie Chrisley Says No One Ever 'Hit on Me' in Prison: 'I Was Their Mom'",
    "description": "Julie Chrisley didn’t strike up a romance during her 28-month prison stay — but was known as “the mom” of her fellow inmates. “Did anybody ever hit on you?” Real Housewives of Atlanta alum Kandi Burruss asked Julie, 52, during the Wednesday, August 13, episod…",
    "link": "https://www.usmagazine.com/celebrity-news/news/julie-chrisley-says-she-never-thought-about-a-prison-romance/#article",
    "timestamp": "2025-08-13T14:30:23Z"
  },
  {
    "title": "National Guard troops spotted in Washington DC as Trump launches crackdown on street crime (Louis Casiano/Fox News)",
    "description": "Louis Casiano / Fox News:\nNational Guard troops spotted in Washington DC as Trump launches crackdown on street crime  —  Federal and local authorities made 23 arrests on first day, including murder suspects and gun offenses  —  National Guard troops were spot…",
    "link": "https://www.memeorandum.com/250813/p33",
    "timestamp": "2025-08-13T14:30:00Z"
  },
  {
    "title": "One-man show? Shock poll shows Zohran Mamdani’s support matches all rivals combined in stunning upset",
    "description": "Zohran Mamdani, a 33-year-old state assemblyman, is currently leading the New York City mayoral race, garnering support equal to his three main opponents combined after defeating Andrew Cuomo in the primary. Recent polls indicate strong support from younger v…",
    "link": "https://economictimes.indiatimes.com/news/international/us/one-man-show-shock-poll-shows-zohran-mamdanis-support-matches-all-rivals-combined-in-stunning-upset/articleshow/123282554.cms",
    "timestamp": "2025-08-13T14:26:39Z"
  },
  {
    "title": "President Nawrocki representing Poland during Trump call, his office says",
    "description": "WARSAW (Reuters) -Polish President Karol Nawrocki is representing Poland at a teleconference on Ukraine involving U.S. President Donald Trump and European leaders on Wednesday, his office said on X. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/13/president-nawrocki-representing-poland-during-trump-call-his-office-says",
    "timestamp": "2025-08-13T14:26:00Z"
  },
  {
    "title": "MSNBC Legal Analyst Claims Democrats ‘Created’ a ‘Political Opening’ for Trump’s DC Takeover",
    "description": "Coley blamed Democrats sitting on Washington, D.C.’s council for “creating” a “political opening” for Trump’s policing takeover in the laws they passed.\nThe post MSNBC Legal Analyst Claims Democrats ‘Created’ a ‘Political Opening’ for Trump’s DC Takeover firs…",
    "link": "https://www.mediaite.com/media/tv/msnbc-legal-analyst-claims-democrats-created-a-political-opening-for-trumps-dc-takeover/",
    "timestamp": "2025-08-13T14:22:47Z"
  },
  {
    "title": "'His brain was frozen': Trump's new comment renews concern about 'dementia'",
    "description": "President Donald Trump renewed concerns about his mental fitness with an early morning social media complaint about media coverage of his planned summit with Vladimir Putin.The president singled out his former national security adviser-turned-nemesis John Bol…",
    "link": "https://www.rawstory.com/donald-trump-putin-talks-leningrad/",
    "timestamp": "2025-08-13T14:21:42Z"
  },
  {
    "title": "Healthy Returns: FDA launches program to streamline creation of new U.S. drug manufacturing sites",
    "description": "A new FDA program will use a two-phase approach to help boost domestic drug manufacturing, while OpenAI is leaning into health care with the launch of GPT-5.",
    "link": "https://www.cnbc.com/2025/08/13/healthy-returns-fda-launches-program-to-boost-us-drug-manufacturing-.html",
    "timestamp": "2025-08-13T14:21:15Z"
  },
  {
    "title": "Truth Social just installed an AI chatbot that actually exposes Trump's lies",
    "description": "President Donald Trump’s social media platform Truth Social now has an AI chat bot that offers inconvenient fact checks of reality.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-truth-social-ai-chatbot-fact-check-rcna224590",
    "timestamp": "2025-08-13T14:17:25Z"
  },
  {
    "title": "Trump-Putin meet to be held at military base in Alaska",
    "description": "The meeting will be the first time in four years that a U.S. president has met with Putin since the Russia-Ukraine war began.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/13/trump-putin-meeting-location-joint-base-elmendorf-richardson/85639795007/",
    "timestamp": "2025-08-13T14:17:10Z"
  },
  {
    "title": "Maggie Haberman Connects Trump Assault On History to White Supremacist Charlottesville Riot",
    "description": "Maggie Haberman connected President Donald Trump’s push to strong-arm museums with the White supremacist riot in Charlottesville that sparked national outrage.\nThe post Maggie Haberman Connects Trump Assault On History to White Supremacist Charlottesville Rio…",
    "link": "https://www.mediaite.com/media/tv/maggie-haberman-connects-trump-assault-on-history-to-white-supremacist-charlottesville-riot/",
    "timestamp": "2025-08-13T14:16:34Z"
  },
  {
    "title": "Trump asked Polish President Nawrocki to replace Tusk in Ukraine meeting",
    "description": "WARSAW (Reuters) -U.S. President Donald Trump at the last minute requested MAGA-allied Polish President Karol Nawrocki join the Ukraine teleconference with...",
    "link": "https://www.yahoo.com/news/articles/president-nawrocki-representing-poland-during-141536347.html",
    "timestamp": "2025-08-13T14:15:36Z"
  },
  {
    "title": "Bombshell New Report Casts More Doubt on Trump’s Epstein Claims",
    "description": "The timeline of Jeffrey Epstein and Donald Trump’s friendship is not adding up.Despite Trump’s doing everything within his power to distance himself from the pedophilic financier, interviews conducted prior to Epstein’s death suggest that the pair were close …",
    "link": "https://newrepublic.com/post/199049/donald-trump-epstein-claims-friendship-report",
    "timestamp": "2025-08-13T14:15:12Z"
  },
  {
    "title": "Senate Democrat: Trump ‘playing dictator,’ pushing democracy to ‘brink’",
    "description": "Sen. Chris Van Hollen (D-Md.) accused President Trump of a “raw authoritarian power grab” after the president moved to federalize the District of Columbia’s police department and call the National Guard to the District’s streets. “He’s playing dictator in our…",
    "link": "https://freerepublic.com/focus/f-chat/4334345/posts",
    "timestamp": "2025-08-13T14:15:07Z"
  },
  {
    "title": "White House hopes monthly U.S. jobs report to continue despite claim by labour statistics nominee",
    "description": "Donald Trump's selection as next commissioner of the U.S. Bureau of Labor Statistics threatens to bring a new level of politicization to what for decades has been a nonpartisan agency issuing reports on the nation's economic health, according to Democrats and…",
    "link": "https://www.cbc.ca/news/world/labour-nominee-antoni-jobs-report-1.7607610",
    "timestamp": "2025-08-13T14:13:17Z"
  },
  {
    "title": "Aaron Rodgers says he did 'the Joe Biden' during Steelers preseason game while explaining wandering behavior",
    "description": "In his first season with the Pittsburgh Steelers, Aaron Rodgers, in his final NFL campaign, joked about “wandering\" like Joe Biden while adjusting to his new team.",
    "link": "https://www.foxnews.com/sports/aaron-rodgers-says-he-did-the-joe-biden-during-steelers-preseason-game-while-explaining-wandering-behavior",
    "timestamp": "2025-08-13T14:12:43Z"
  },
  {
    "title": "This Trump Tariff Could Increase America's Trade Deficit",
    "description": "Switzerland might respond to Trump’s double-digit “reciprocal” tariff by canceling its multibillion-dollar F-35 order.",
    "link": "https://reason.com/2025/08/13/this-trump-tariff-could-increase-americas-trade-deficit/",
    "timestamp": "2025-08-13T14:11:05Z"
  },
  {
    "title": "Israel Is Not An Ally—It’s A Liability",
    "description": "By Sina Toossi, Ron Paul Institute for Peace and Prosperity | August 11, 2025\n“My people are starting to hate Israel.” That’s what President Donald Trump reportedly told a prominent Jewish donor recently. His remark wasn’t just a political aside; it was a war…",
    "link": "https://biztoc.com/x/0ae5e5a50d9b577f",
    "timestamp": "2025-08-13T14:10:45Z"
  },
  {
    "title": "'Into the gutter': Expert says Trump's latest poll numbers spell 'abject disaster' for GOP",
    "description": "As new reporting continues to show inflation ticking up, with the consumer price index rising by 2.7%\r\n in July, President Donald Trump’s poll numbers on inflation have plummeted in what CNN’s Harry Enten labeled an “abject disaster for the president.”“Into t…",
    "link": "https://www.rawstory.com/inflation-2673881327/",
    "timestamp": "2025-08-13T14:10:41Z"
  },
  {
    "title": "FDA Worker Quits, Goes Viral After Giving Middle Finger to Trump and Vance",
    "description": "Elizabeth Booker Houston shared why she left her job at the FDA in a post that quickly went viral.",
    "link": "https://www.newsweek.com/elizabeth-booker-houston-fda-trump-vance-middle-finger-viral-2111891",
    "timestamp": "2025-08-13T14:09:59Z"
  },
  {
    "title": "Jaishankar, Lavrov to meet in Moscow on August 21 amidst tariff tension",
    "description": "Discussions on key aspects of cooperation within international frameworks on the agenda, says Russian Foreign Ministry",
    "link": "https://www.thehindubusinessline.com/economy/jaishankar-lavrov-to-meet-in-moscow-on-august-21-amidst-tariff-tension/article69929195.ece",
    "timestamp": "2025-08-13T14:09:57Z"
  },
  {
    "title": "Ukraine 'Made Fake Russian Company' to Carry Out Operation Spider Web",
    "description": "Ukrainian intelligence chief Vasyl Malyuk reveals details about the audacious drone attacks targeting Russian airfields far from the front line in June.",
    "link": "https://www.newsweek.com/ukraine-russia-spider-web-drones-2112788",
    "timestamp": "2025-08-13T14:08:52Z"
  },
  {
    "title": "Trump Bros. Admit Vendetta Against Big Banks Motivated New Crypto Push After Family Accounts Targeted",
    "description": "Eric Trump and Donald Trump Jr. unloaded on Big Banks that they said were “weaponized” against MAGA and had abruptly shuttered family business accounts.\nThe post Trump Bros. Admit Vendetta Against Big Banks Motivated New Crypto Push After Family Accounts Targ…",
    "link": "https://www.mediaite.com/media/tv/trump-bros-admit-vendetta-against-big-banks-motivated-new-crypto-push-after-family-accounts-targeted/",
    "timestamp": "2025-08-13T14:08:48Z"
  },
  {
    "title": "Newsom says California's new congressional maps will take down Trump",
    "description": "Newsom said the new maps will \"END THE TRUMP PRESIDENCY.\"",
    "link": "https://abcnews.go.com/Politics/newsom-californias-new-congressional-maps-trump/story?id=124609132",
    "timestamp": "2025-08-13T14:06:10Z"
  },
  {
    "title": "Newsom mocks Trump in all-caps post promising a 2026 Democratic victory",
    "description": "California Gov. Gavin Newsom mocked President Donald Trump with an all-caps tweet amid a heated redistricting effort in Texas.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/13/newsom-trolls-trump-over-redistricting/85639411007/",
    "timestamp": "2025-08-13T14:03:34Z"
  },
  {
    "title": "Did Somebody Say JEFFREY EPSTEIN?",
    "description": "How’s that Epstein Files coverup going?",
    "link": "https://www.wonkette.com/p/did-somebody-say-jeffrey-epstein",
    "timestamp": "2025-08-13T14:01:57Z"
  },
  {
    "title": "Back to the Future 2: Easter Eggs You Might Have Missed!",
    "description": "We unpack the many easter eggs in Back to the Future: Part II, including a whole bunch you might have missed!\nThe post Back to the Future 2: Easter Eggs You Might Have Missed! appeared first on JoBlo.",
    "link": "https://www.joblo.com/back-to-the-future-2-easter-eggs/",
    "timestamp": "2025-08-13T14:01:11Z"
  },
  {
    "title": "Bessent Warns Europe It’s ‘Put Up or Shut Up’ Time on Russia",
    "description": "Treasury Secretary Scott Bessent urged European nations to be prepared to get on board with higher tariffs on China and other nations that buy Russian energy, lamenting that he got a cool response when he floated the idea at a Group of Seven meeting earlier t…",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-warns-europe-its-put-up-or-shut-up-time-on-russia",
    "timestamp": "2025-08-13T14:01:03Z"
  },
  {
    "title": "Who’s In Control of D.C.’s Police?",
    "description": "Washington Post: “A day after President Donald Trump said he would deploy the National Guard in the nation’s capital, federalized the local police department and issued officers a far-reaching mandate to ‘do whatever the hell",
    "link": "https://politicalwire.com/2025/08/13/whos-in-control-of-d-c-s-police/",
    "timestamp": "2025-08-13T14:00:29Z"
  },
  {
    "title": "Tea, cakes and funny signs greet Vance in quintessentially British countryside",
    "description": "Vice President JD Vance was greeted with protesters  holding funny signs as he vacationed in the Cotswolds in England's countryside.",
    "link": "https://www.nbcnews.com/world/united-kingdom/jd-vance-protest-england-the-cotswolds-jeremy-clarkson-david-cameron-rcna224681",
    "timestamp": "2025-08-13T14:00:06Z"
  },
  {
    "title": "Becky Pringle: Hungry Children Can’t Learn",
    "description": "Trump and his compliant allies in Congress took pride in the One Big Ugly Bill that they passed in early July. But it offers reasons for shame, not pride. The Trump bill finances tax cuts for the richest Americans by cutting food for schoolchildren and Medica…",
    "link": "https://dianeravitch.net/2025/08/13/becky-pringle-hungry-children-cant-learn/",
    "timestamp": "2025-08-13T14:00:00Z"
  },
  {
    "title": "“America’s Best Idea” Slams Into One of Trump’s Worst Ones",
    "description": "The national parks are a huge boon for local economies. It makes no sense to gut their budgets.",
    "link": "https://slate.com/news-and-politics/2025/08/national-parks-jobs-budget-cuts-trump.html",
    "timestamp": "2025-08-13T14:00:00Z"
  },
  {
    "title": "EU Scrambles to Stay Relevant as Trump-Putin Alaska Summit Looms",
    "description": "The planned meeting in Alaska between US President Donald Trump and his Russian counterpart, Vladimir Putin, has left Europe scrambling. The European Union, and most other European nations, are seeking to prevent the United States from \"falling into a trap\" w…",
    "link": "https://oilprice.com/Energy/Energy-General/EU-Scrambles-to-Stay-Relevant-as-Trump-Putin-Alaska-Summit-Looms.html",
    "timestamp": "2025-08-13T14:00:00Z"
  },
  {
    "title": "Why Housing Feels Hopeless",
    "description": "Redfin CEO Glenn Kelman on zoning, generational inequality, and how to fix the U.S. housing market. Plus: What Trump gets dangerously wrong about World War II.",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/08/david-frum-show-housing-glenn-kelman-redfin/683851/",
    "timestamp": "2025-08-13T14:00:00Z"
  },
  {
    "title": "Trump May Travel to Russia After Putin Summit, White House Says",
    "description": "Donald Trump plans to meet Russian President Vladimir Putin in Alaska as the US president looks to broker an agreement that will bring an end to the war in Ukraine. The face-to-face summit with Putin represents a gamble for the US president, who on the campai…",
    "link": "https://biztoc.com/x/027fac6febde2bb3",
    "timestamp": "2025-08-13T13:59:14Z"
  },
  {
    "title": "Iran and Russia Vow to Block U.S. Caucasus Ambitions",
    "description": "How the much-bruited Trump Caucasus deal, meant to cause trouble for Iran and Russia, is only a napkin doodle and may never be more than that",
    "link": "https://www.nakedcapitalism.com/2025/08/iran-and-russia-vow-to-block-u-s-caucasus-ambitions.html",
    "timestamp": "2025-08-13T13:55:45Z"
  },
  {
    "title": "Faster NextGen Acela Trains Are Coming to the U.S. at the Worst Time",
    "description": "The new Acela trains are scheduled to start running on the Northeast Corridor soon.",
    "link": "https://gizmodo.com/faster-nextgen-acela-trains-are-coming-to-the-u-s-at-the-worst-time-2000642421",
    "timestamp": "2025-08-13T13:55:33Z"
  },
  {
    "title": "Is ‘South Park’ New Tonight? How to Watch Season 27, Episode 3",
    "description": "Wednesday marks the 28th anniversary since Trey Parker and Matt Stone's animated sitcom premiered on Comedy Central\nThe post Is ‘South Park’ New Tonight? How to Watch Season 27, Episode 3 appeared first on TheWrap.",
    "link": "https://www.thewrap.com/is-south-park-new-tonight-season-27/",
    "timestamp": "2025-08-13T13:55:00Z"
  },
  {
    "title": "SCOOP: Trump's newest DC crime crackdown yields more than 100 arrests",
    "description": "Law enforcement officials in Washington, D.C., have arrested more than 100 people since Aug. 7, Fox Digital has learned, as President Donald Trump cracks down on crime in the city.",
    "link": "https://www.foxnews.com/politics/scoop-trumps-new-dc-crime-crackdown-yields-more-than-100-arrests",
    "timestamp": "2025-08-13T13:54:52Z"
  },
  {
    "title": "Trump–European leaders–Zelensky video conference begins",
    "description": "The meeting is seen as a prelude to Friday’s summit in Alaska between the U.S. president and his Russian counterpart, Vladimir Putin\nThe post Trump–European leaders–Zelensky video conference begins appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/08/13/trump-european-leaders-zelensky-video-conference-begins/",
    "timestamp": "2025-08-13T13:53:09Z"
  },
  {
    "title": "What’s up with… NTT Data & Google Cloud, Veon, Lumen",
    "description": "NTT Data and Google Cloud team up on agentic AI, cloud servicesVeon sells unit, advances D2C strategyLumen tops 1,000 NaaS customers",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/what-s-up-with-ntt-data-google-cloud-veon-lumen-53629/",
    "timestamp": "2025-08-13T13:52:27Z"
  },
  {
    "title": "‘Now they’ve been caught’: Trump torches ‘sick’ media ahead of Alaska summit with Putin",
    "description": "'If I got Moscow and Leningrad free, as part of the deal with Russia, the Fake News would say that I made a bad deal!'",
    "link": "https://www.wnd.com/2025/08/now-theyve-been-caught-trump-torches-sick-media/",
    "timestamp": "2025-08-13T13:51:01Z"
  },
  {
    "title": "Fox News’ Lawrence Jones Challenges Dem Maryland Gov. Wes Moore Over Criticism of Trump’s DC Crime Crackdown",
    "description": "Lawrence Jones pressed Wes Moore about his criticism of President Donald Trump's administration's effort to clamp down on crime in Washington, D.C.,",
    "link": "https://dailycaller.com/2025/08/13/foxn-news-lawrence-jones-questions-wes-moore-over-comments-about-trump-dc-takeover/",
    "timestamp": "2025-08-13T13:50:41Z"
  },
  {
    "title": "WATCH: Morning Joe Segment Inspires Trump Truth Social Tirade",
    "description": "A Wednesday Morning Joe segment on MSNBC appears to have inspired an early Truth Social tirade from President Donald Trump.\nThe post WATCH: Morning Joe Segment Inspires Trump Truth Social Tirade first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/watch-morning-joe-segment-inspires-trump-truth-social-tirade/",
    "timestamp": "2025-08-13T13:50:37Z"
  },
  {
    "title": "How a Goldman Sachs economist became Trump’s latest target",
    "description": "Donald Trump doesn't just think Goldman Sachs’ chief economist is wrong about tariffs, the president also wants him fired. That's a power he does not have.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/goldman-sachs-economist-became-trumps-latest-target-rcna224708",
    "timestamp": "2025-08-13T13:50:04Z"
  },
  {
    "title": "MSNBC’s Mike Barnicle Admits National Guard Presence Is Probably Making DC Residents Feel Safer",
    "description": "MSNBC contributor Mike Barnicle admitted that the National Guard's presence in Washington, D.C. is likely making residents feel a \"sense of security.\"",
    "link": "https://dailycaller.com/2025/08/13/msnbc-mike-barnicle-dc-residents-national-guard/",
    "timestamp": "2025-08-13T13:50:02Z"
  },
  {
    "title": "AriZona To Raise Prices For 1st Time In Decades Thanks To Trump Tariffs",
    "description": "Just a year ago (when Joe Biden was President), AriZona Iced Tea’s co-founder, Don Vultaggio, explained that the reason that his beloved iced tea remained at just $1 for the past 30 years was because there simply was no need to raise the price on consumers be…",
    "link": "https://hiphopwired.com/2803086/arizona-to-raise-prices-for-first-time-in-decades-thanks-to-trump-tariffs/",
    "timestamp": "2025-08-13T13:48:47Z"
  },
  {
    "title": "Republican Met With Loud Boos, 'Shame' Chants at Town Hall",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRepresentative Doug LaMalfa, a California Republican, was met with boos and jeers at a town hall meeting on Monday over his support for President Donald Trump.\nIt comes after a series of similar incidents, inc…",
    "link": "https://biztoc.com/x/9e0962ac89c09b5b",
    "timestamp": "2025-08-13T13:48:30Z"
  },
  {
    "title": "WATCH LIVE: Trump visits Kennedy Center as new honorees announced",
    "description": "The center said in a statement that “our beautiful building will undergo renovations to restore its prestige and grandeur” and credited Trump’s advocacy. Trump complained during a March visit that the building is in a state of “tremendous disrepair.”",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-visits-kennedy-center-as-new-honorees-announced",
    "timestamp": "2025-08-13T13:43:45Z"
  },
  {
    "title": "Conservative's Epstein claim leaves puzzled CNN host scratching her head",
    "description": "CNN's Kate Bolduan was left scratching her head in puzzlement after a conservative panelist declared the Jeffrey Epstein scandal had passed out of the public consciousness.President Donald Trump has been trying to shift the narrative after his long-standing t…",
    "link": "https://www.rawstory.com/epstein-trump-scandal-cnn-scratch/",
    "timestamp": "2025-08-13T13:42:08Z"
  },
  {
    "title": "Ghislaine Maxwell Work Release: Is Reality TV Next for the Convicted Sex Offender?",
    "description": "Reading Time: 4 minutesGhislaine Maxwell might soon embark on a new career.\nGhislaine Maxwell Work Release: Is Reality TV Next for the Convicted Sex Offender? was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/08/ghislaine-maxwell-work-release-reality-tv/",
    "timestamp": "2025-08-13T13:42:05Z"
  },
  {
    "title": "Indian Illegal Alien Sex, Labor, Drug Trafficking Ring Busted by Feds in Nebraska",
    "description": "Federal authorities in Nebraska carried out a series of raids, leading to the arrest of a group of Indian nationals who were allegedly engaged in an elaborate scheme involving sex, labor, and drug trafficking. In addition to multiple businesses owned by the s…",
    "link": "https://freerepublic.com/focus/f-news/4334339/posts",
    "timestamp": "2025-08-13T13:41:59Z"
  },
  {
    "title": "US SPACE FORCE Trademark Applicant Takes Constitutional, Lanham Act Challenges to High Court",
    "description": "In a petition for certiorari docketed August 6, trademark applicant Thomas Foster filed a petition for writ of certiorari with the U.S. Supreme Court asking to overturn a May ruling by the U.S. Court of Appeals for the Federal Circuit affirming a trademark ex…",
    "link": "https://ipwatchdog.com/2025/08/13/us-space-force-trademark-applicant-takes-constitutional-lanham-act-challenges-high-court/id=191112/",
    "timestamp": "2025-08-13T13:40:32Z"
  },
  {
    "title": "Republican Met With Loud Boos, 'Shame' Chants at Town Hall",
    "description": "Republicans lawmakers have faced the scorn of voters over the Trump administration's policies in recent months.",
    "link": "https://www.newsweek.com/doug-lamalfa-republican-town-hall-2112778",
    "timestamp": "2025-08-13T13:40:27Z"
  },
  {
    "title": "South Sudan: Reports of relocation of Gazans baseless",
    "description": "The South Sudanese Foreign Ministry denied that it was in talks with Israel to accept Gazan immigrants, says report 'does not reflect the official position or policy.'",
    "link": "https://www.israelnationalnews.com/news/413218",
    "timestamp": "2025-08-13T13:39:18Z"
  },
  {
    "title": "Sebastian Telfair Reports To Prison",
    "description": "Sebastian Telfair is now behind bars ... TMZ Sports has learned the former NBA star has officially begun his prison sentence. Records show the 40-year-old reported to Fort Dix FCI in New Jersey, where he's expected to remain for the next six…",
    "link": "https://www.tmz.com/2025/08/13/sebastian-telfair-reports-to-prison/",
    "timestamp": "2025-08-13T13:39:06Z"
  },
  {
    "title": "US opens higher with Ukraine meeting in focus",
    "description": "Major stock market indexes in the United States opened higher on Wednesday in anticipation of the meeting between United States President Donald Trump and the leaders of European countries, including ...",
    "link": "https://biztoc.com/x/d5dc66b0065acda7",
    "timestamp": "2025-08-13T13:37:28Z"
  },
  {
    "title": "Indian and Russian foreign ministers to meet in Moscow",
    "description": "S. Jaishankar is expected to discuss key bilateral issues with Sergey Lavrov Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622838-indian-and-russian-foreign-ministers/",
    "timestamp": "2025-08-13T13:36:18Z"
  },
  {
    "title": "No experts in the room: Donald Trump to meet Vladimir Putin after loss of Russia specialists (Amy Mackinnon/Financial Times)",
    "description": "Amy Mackinnon / Financial Times:\nNo experts in the room: Donald Trump to meet Vladimir Putin after loss of Russia specialists  —  Reduction in federal workforce has hollowed out the number of knowledgeable officials in Washington  —  In 2018, when Donald Trum…",
    "link": "https://www.memeorandum.com/250813/p24",
    "timestamp": "2025-08-13T13:35:01Z"
  },
  {
    "title": "Zelenskiy in Berlin for online meeting with Trump, European leaders (Reuters)",
    "description": "Reuters:\nZelenskiy in Berlin for online meeting with Trump, European leaders  —  Ukrainian President Volodymyr Zelenskiy visited Berlin on Wednesday for a German-hosted virtual meeting with Donald Trump and European leaders, two days before the U.S. president…",
    "link": "https://www.memeorandum.com/250813/p25",
    "timestamp": "2025-08-13T13:35:01Z"
  },
  {
    "title": "Swiss Face Higher Fighter-Jet Cost as US Squeezes Government",
    "description": "Switzerland faces additional costs of as much as 1.3 billion Swiss francs ($1.6 billion) to buy Lockheed Martin Corp. F-35A fighter jets after failing to push through a fixed-price deal, in another setback for the government after the US slapped surprisingly …",
    "link": "https://www.livemint.com/companies/news/swiss-face-higher-fighter-jet-cost-as-us-squeezes-government-11755092087627.html",
    "timestamp": "2025-08-13T13:34:47Z"
  },
  {
    "title": "US national debt soars past record $37 trillion — years sooner than expected",
    "description": "Rapid run-up reflects emergency spending during the multi-year COVID-19 crisis, when the government borrowed heavily under Trump and Biden.",
    "link": "https://nypost.com/2025/08/13/business/us-national-debt-soars-past-37-trillion-years-sooner-than-expected/",
    "timestamp": "2025-08-13T13:33:31Z"
  },
  {
    "title": "The Trump Family’s Crypto Empire Is Expanding—Fast",
    "description": "A new deal will see a publicly traded company buy up to $1.5 billion of the Trump family's proprietary crypto token, further blurring the lines between the White House and their private business interests.",
    "link": "https://gizmodo.com/the-trump-familys-crypto-empire-is-expanding-fast-2000642425",
    "timestamp": "2025-08-13T13:31:43Z"
  },
  {
    "title": "Chubby face memes plague JD Vance vacation as Brit protesters go on mockery bonanza",
    "description": "Vice President JD Vance's English countryside getaway descended into mockery overload as protesters gathered to demand the Trump administration official \"go home\" from his luxury vacation spot.The \"Dance Against Vance\" demonstration, organized by the Stop Tru…",
    "link": "https://www.rawstory.com/jd-vance-uk-2673881221/",
    "timestamp": "2025-08-13T13:30:56Z"
  },
  {
    "title": "At least 123 Palestinians killed as Israeli army pounds Gaza City ahead of planned takeover",
    "description": "Israel's military pounded Gaza City on Wednesday prior to a planned takeover, with another 123 people killed in the last day, according to the Gaza health ministry, while militant group Hamas held further talks with Egyptian mediators.",
    "link": "https://www.cbc.ca/news/world/gaza-city-israel-army-1.7607607",
    "timestamp": "2025-08-13T13:29:31Z"
  },
  {
    "title": "Drunk, Belligerent Vagrants Blockade The Federalist’s Office As Leftist Journalists Insist DC Is America’s Purest City",
    "description": "Left-wing journalists and their Democrat friends have been shrieking since Monday about how gloriously safe Washington, D.C., is, and how, as one particularly low-IQ White House correspondent stated, there is a “nonexistent crime crisis” in the nation’s capit…",
    "link": "https://freerepublic.com/focus/f-news/4334335/posts",
    "timestamp": "2025-08-13T13:27:12Z"
  },
  {
    "title": "Venezuelan migrants, progressive group sue Trump admin after Noem nixes Biden-era ‘protected status’",
    "description": "Venezuelan Association of Massachusetts files federal suit over sudden policy shift ending protected status for migrants who used required CBP One app process",
    "link": "https://www.foxnews.com/politics/venezuelan-migrants-progressive-group-sue-dhs-cbp-after-noem-nixes-biden-era-protected-status",
    "timestamp": "2025-08-13T13:26:37Z"
  },
  {
    "title": "'Went too far': GOP strategist says Trump may regret big Smithsonian directive",
    "description": "As President Donald Trump continues his effort to reshape exhibits at Smithsonian museums to fit his own “historical vision\r\n,” scrutiny continues to mount, including from one Republican strategist who says they believe Trump is likely to end up seeing the mo…",
    "link": "https://www.rawstory.com/smithsonian-2673881200/",
    "timestamp": "2025-08-13T13:25:29Z"
  },
  {
    "title": "Zohran Mamdani’s Fantasy Island",
    "description": "The mayoral candidate’s support comes from a young, mostly white, often childless, likely temporary population insulated from the consequences of the urban decline they’re about to cause. There is a version of American liberalism that treats progress as a sha…",
    "link": "https://freerepublic.com/focus/f-chat/4334331/posts",
    "timestamp": "2025-08-13T13:21:59Z"
  },
  {
    "title": "Record-breaking $27.7 tariff haul in July has Trump celebrating, but will it last?",
    "description": "Record US tariff revenue July 2025: US President Donald Trump is celebrating record tariff revenue, reaching $27.7 billion in July. While Trump hails this as a win, economists caution that American businesses and consumers are primarily bearing the costs. Tar…",
    "link": "https://economictimes.indiatimes.com/news/international/us/record-us-tariff-revenue-july-2025-record-breaking-27-7-tariff-haul-in-july-has-trump-celebrating-but-will-it-last-us-economy-latest-news-trump-tariffs-news/articleshow/123281854.cms",
    "timestamp": "2025-08-13T13:20:09Z"
  },
  {
    "title": "Court weighs unusual Trump lawsuit against Maryland-based federal judges",
    "description": "A judge will consider a Trump administration lawsuit against all 15 federal judges in Maryland over an order related to immigration and deportations.",
    "link": "https://www.nbcnews.com/politics/justice-department/court-weighs-unusual-trump-lawsuit-maryland-based-federal-judges-rcna224627",
    "timestamp": "2025-08-13T13:19:51Z"
  },
  {
    "title": "Should We Sacrifice The Seabed Floor For Next-Generation Technology?",
    "description": "When President Donald Trump issued an executive order this summer promoting deep sea mining — which is currently prohibited under international law — he didn’t take into account the creatures that live on the seabed floor. Thousands of meters below sea level …",
    "link": "https://cleantechnica.com/2025/08/13/should-we-sacrifice-the-seabed-floor-for-next-generation-technology/",
    "timestamp": "2025-08-13T13:16:16Z"
  },
  {
    "title": "‘South Park’ Highlights Brutal New Scene Attacking Kristi Noem",
    "description": "The animated series shared an alternate end-credits scene from last week's controversial episode mocking the homeland security secretary.",
    "link": "https://www.huffpost.com/entry/south-park-new-end-credits-scene-kristi-noem_n_689c6291e4b03bdc47500025",
    "timestamp": "2025-08-13T13:11:54Z"
  },
  {
    "title": "Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin",
    "description": "President Trump raged against the “unfair” media over its coverage of his high-stakes summit with Russian tyrant Vladimir Putin in Alaska on Friday. President Trump took aim at the media’s coverage of his high-stakes meeting with Putin Wednesday. “Very unfair…",
    "link": "https://nypost.com/2025/08/13/world-news/trump-slams-media-coverage-ahead-of-high-stakes-putin-meeting/",
    "timestamp": "2025-08-13T13:10:13Z"
  },
  {
    "title": "Trump's awful turn against mRNA vaccine research (Matthew Yglesias/Slow Boring)",
    "description": "Matthew Yglesias / Slow Boring:\nTrump's awful turn against mRNA vaccine research  —  Operation Warp Speed, we hardly knew ye  —  Donald Trump made a lot of mistakes in his handling of the Covid-19 pandemic, but he did champion rapid development of mRNA vaccin…",
    "link": "https://www.memeorandum.com/250813/p21",
    "timestamp": "2025-08-13T13:10:00Z"
  },
  {
    "title": "House Democrat presses DOJ on Ghislaine Maxwell prison transfer, meeting with top official",
    "description": "Rep. Jamie Raskin demands Justice Department explain Ghislaine Maxwell's transfer out of a maximum security prison, citing witness tampering concerns.",
    "link": "https://www.foxnews.com/politics/house-democrat-presses-doj-ghislaine-maxwell-prison-transfer-meeting-top-official",
    "timestamp": "2025-08-13T13:07:53Z"
  },
  {
    "title": "Vance to visit US troops during high-stakes UK trip ahead of Trump's Putin meeting",
    "description": "Vice President JD Vance will visit U.S. troops stationed at a key military installation for the U.S. Air Force in England that supports heavy bomber aircraft.",
    "link": "https://www.foxnews.com/politics/vance-visit-us-troops-during-high-stakes-uk-trip-ahead-trumps-putin-meeting",
    "timestamp": "2025-08-13T13:05:31Z"
  },
  {
    "title": "Older student loan borrowers face high delinquency rates as Trump administration ramps up collections",
    "description": "There's still time for older student loan borrowers who are behind on their bills to avoid default, and garnishment of their retirement benefits and wages.",
    "link": "https://www.cnbc.com/2025/08/13/older-student-loan-delinquencies-under-trump.html",
    "timestamp": "2025-08-13T13:05:01Z"
  },
  {
    "title": "Trump's Military Crackdowns Are Only Going to Get Worse (Rolling Stone)",
    "description": "Rolling Stone:\nTrump's Military Crackdowns Are Only Going to Get Worse  —  L.A. and D.C. are only the beginning, as the president's team has been drawing up plans to unleash federal forces in other Democratic strongholds  —  President Donald Trump has expande…",
    "link": "https://www.memeorandum.com/250813/p20",
    "timestamp": "2025-08-13T13:05:00Z"
  },
  {
    "title": "Donald Trump Scores Major Legal Win in Accessing Sensitive Data of Millions",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA divided federal appeals court has ruled that the Trump administration's Department of Government Efficiency (DOGE) can access sensitive personal data held by several federal agencies, rejecting claims that t…",
    "link": "https://biztoc.com/x/23ca3d07194c7aac",
    "timestamp": "2025-08-13T13:04:27Z"
  },
  {
    "title": "Thailand: Is the military preparing another coup?",
    "description": "The recent border clashes with Cambodia have left Thailand's politics in chaos while boosting the already immense power of its military leaders. The border conflict between Thailand and Cambodia has strengthened the hand of the pro-junta leaders in Bangkok at…",
    "link": "https://www.dw.com/en/thailand-is-the-military-preparing-another-coup/a-73624722",
    "timestamp": "2025-08-13T13:04:00Z"
  },
  {
    "title": "Eleanor Holmes Norton keeps a low profile as Trump takes aim at DC",
    "description": "Washington's locally elected government is under attack from President Donald Trump and congressional Republicans. But the capital city's self-proclaimed \"warrior on the Hill\" is nowhere to be seen on the front lines. \nEleanor Holmes Norton, the District of C…",
    "link": "https://biztoc.com/x/209af5b1412297d6",
    "timestamp": "2025-08-13T13:03:58Z"
  },
  {
    "title": "Trump Will Tell Putin 'All Options Are on the Table': Bessent",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. Treasury Secretary Scott Bessent said President Donald Trump wants to end the bloodshed in Ukraine but \"not at any cost\" ahead of the crunch summit with Russian President Vladimir Putin.\nTrump and Putin a…",
    "link": "https://biztoc.com/x/7767c05551f9de3b",
    "timestamp": "2025-08-13T13:03:46Z"
  }
]