[
  {
    "title": "Ghislaine Maxwell takes the Fifth in U.S. House committee appearance from prison",
    "description": "Lawmakers tried on Monday to interview Ghislaine Maxwell but the former girlfriend and confidante of Jeffrey Epstein invoked her Fifth Amendment rights to avoid answering questions that would be self-incriminating.",
    "link": "https://www.cbc.ca/news/world/us-congress-maxwell-appearance-9.7081068",
    "timestamp": "2026-02-09T18:40:11Z"
  },
  {
    "title": "US to turn over 2 NATO command posts to Europeans, military source says",
    "description": "BRUSSELS, Feb 9 (Reuters) - The United States will turn over two of NATO’s major command posts - in Naples, Italy and Norfolk, Virginia - to European officers, a military… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/us-to-turn-over-2-nato-command-posts-to-europeans-military-source-says",
    "timestamp": "2026-02-09T18:39:14Z"
  },
  {
    "title": "Jeff Bezos Reportedly Afraid Trump Would Seek ‘Vengeance’ on Him After Making Himself an ‘Enemy’—He’s ‘Dependent’ on the President",
    "description": "What happened between them?",
    "link": "https://stylecaster.com/entertainment/celebrity-news/1234878620/jeff-bezos-trump-washington-post/",
    "timestamp": "2026-02-09T18:39:05Z"
  },
  {
    "title": "Remi Tinubu met US lawmakers on Christian safety concerns — Report",
    "description": "Nigeria’s First Lady, Remi Tinubu, met with US lawmakers in Washington to discuss Christian safety in Nigeria, addressing concerns of religious persecution\n\nRead More: https://punchng.com/remi-tinubu-met-us-lawmakers-on-christian-safety-concerns-report/",
    "link": "https://punchng.com/remi-tinubu-met-us-lawmakers-on-christian-safety-concerns-report/",
    "timestamp": "2026-02-09T18:36:28Z"
  },
  {
    "title": "Cuba Warns Airlines They Can’t Refuel After Trump Tariff Threat",
    "description": "Cuba is at risk of losing vital airline service as it prepares to run out of aviation fuel, with at least one major carrier, Air Canada, suspending all service to the island as a result.",
    "link": "https://financialpost.com/pmn/business-pmn/cuba-warns-airlines-they-cant-refuel-after-trump-tariff-threat",
    "timestamp": "2026-02-09T18:36:01Z"
  },
  {
    "title": "How Long Will Japan Be a One-Woman Show?",
    "description": "Despite a landslide victory, questions remain over the prime minister’s popularity and her fiscal plans.",
    "link": "http://foreignpolicy.com/2026/02/09/japan-sanae-takaichi-election-economy/",
    "timestamp": "2026-02-09T18:34:30Z"
  },
  {
    "title": "‘They are freaking out’: NFL and advertisers ‘panicking’ over ‘staggering’ size of Turning Point USA’s Super Bowl Halftime Show",
    "description": "'The greatest sin of them all: you can't even listen to it! It's like mumble rap but Spanish and no songs that anybody knows. All the videos coming out from the stands showed people standing like statues'",
    "link": "https://www.wnd.com/2026/02/they-are-freaking-nfl-advertisers-panicking-staggering-size/",
    "timestamp": "2026-02-09T18:33:41Z"
  },
  {
    "title": "Epstein accomplice Ghislaine Maxwell refuses to answer questions from US House panel",
    "description": "Ghislaine Maxwell, currently serving a 20-year prison sentence for sex trafficking, was subpoenaed to appear before the House Oversight Committee. The committee sought her testimony regarding her connections with a disgraced financier. However, Republican com…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/epstein-accomplice-ghislaine-maxwell-refuses-to-answer-questions-from-us-house-panel/articleshow/128126806.cms",
    "timestamp": "2026-02-09T18:31:16Z"
  },
  {
    "title": "Radiohead’s Jonny Greenwood asks for music to be removed from Melania documentary",
    "description": "The rock musician, who composed the 2017 drama ‘Phantom Thread’, alleges breach of agreement after score reused in controversial documentary",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jonny-greenwood-melania-documentary-radiohead-b2916922.html",
    "timestamp": "2026-02-09T18:30:37Z"
  },
  {
    "title": "Trump's immigration crackdown is straining federal courts. Judges are raising the alarm",
    "description": "Federal judges around the country are scrambling to address a deluge of lawsuits from immigrants locked up under the Trump administration’s mass deportation campaign",
    "link": "https://abcnews.go.com/US/wireStory/trumps-immigration-crackdown-straining-federal-courts-judges-raising-129998944",
    "timestamp": "2026-02-09T18:30:18Z"
  },
  {
    "title": "Nancy Guthrie’s family faces $6 million Bitcoin ransom demand: How such a payment would take place",
    "description": "Savannah Guthrie and her siblings released a video saying ‘we will pay’.",
    "link": "https://fortune.com/2026/02/09/nancy-guthries-family-faces-6-million-bitcoin-ransom-demand/",
    "timestamp": "2026-02-09T18:28:59Z"
  },
  {
    "title": "'This number blew my mind': Independents hand Trump 'staggering' 53-point drop in support",
    "description": "President Donald Trump lost a \"staggering\" measure of support on one of his greatest strengths with voters just a year into his second term, according to a new analysis.The 79-year-old president boasted in a new interview that he's very proud of the economy r…",
    "link": "https://www.rawstory.com/trump-economic-approval-2675230418/",
    "timestamp": "2026-02-09T18:28:22Z"
  },
  {
    "title": "Student loan complaints hit record high, CFPB finds — but the watchdog agency omits details",
    "description": "The Consumer Financial Protection Bureau's latest student loan report cites a record number of complaints from borrowers but leaves out certain information.",
    "link": "https://www.cnbc.com/2026/02/09/cfpb-student-loan-complaints.html",
    "timestamp": "2026-02-09T18:28:19Z"
  },
  {
    "title": "Faith Groups Sue Over Trump's Christian Nationalist 'Religious Liberty Commission'",
    "description": "\"Religious freedom for some is religious freedom for none.\"That's what Rev. Paul Brandeis Raushenbush, president and CEO of Interfaith Alliance, said in a Monday statement as faith groups filed a federal lawsuit in the Southern District of New York over Presi…",
    "link": "https://www.commondreams.org/news/religious-liberty-commission-trump",
    "timestamp": "2026-02-09T18:26:52Z"
  },
  {
    "title": "Bari Weiss Promotes New CBS Reporting Disputing Trump Boast: ‘Is Trump Really Deporting the Worst of the Worst?’",
    "description": "Bari Weiss touted new reporting from CBS that disputed Donald Trump's claim that he is focused on removing \"the worst\" illegal immigrants from the U.S.\nThe post Bari Weiss Promotes New CBS Reporting Disputing Trump Boast: ‘Is Trump Really Deporting the Worst …",
    "link": "https://www.mediaite.com/media/news/bari-weiss-promotes-new-cbs-reporting-disputing-trump-boast-is-trump-really-deporting-the-worst-of-the-worst/",
    "timestamp": "2026-02-09T18:26:39Z"
  },
  {
    "title": "Jasmine Crockett's vulgar 6-word message for Trump in Epstein probe",
    "description": "House Democratic Rep. Jasmine Crockett tore into President Donald Trump after the Oversight Committee's closed-door deposition of Ghislaine Maxwell.",
    "link": "https://www.foxnews.com/politics/jasmine-crocketts-vulgar-6-word-message-trump-epstein-probe",
    "timestamp": "2026-02-09T18:26:37Z"
  },
  {
    "title": "Trump says China's Xi Jinping to visit US 'toward the end of the year'",
    "description": "Since returning to the White House a year ago, President Trump has introduced numerous tariffs. These levies have targeted specific industries, including steel and autos, and have also been used for broader policy goals. The administration has engaged in trad…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-chinas-xi-jinping-to-visit-us-toward-the-end-of-the-year/articleshow/128126535.cms",
    "timestamp": "2026-02-09T18:22:40Z"
  },
  {
    "title": "Truth Behind Nicki Minaj's Love for Donald Trump: Rapper's Unlikely MAGA Links Exposed as Desperate Bid for 'Relevancy' Amid Suspicion Over Support",
    "description": "Nicki Minaj’s unlikely transformation into MAGA 'It Girl' and Donald Trump's 'number one fan' seems to be a desperate bid to become relevant again.",
    "link": "https://radaronline.com/p/truth-behind-nicki-minaj-love-for-donald-trump-exposed/",
    "timestamp": "2026-02-09T18:20:00Z"
  },
  {
    "title": "“Uptick In Abductions”: ICE Ramps Up Targeting of Minneapolis Legal Observers",
    "description": "In one 30-minute stretch, three legal observers were arrested — as Trump’s Border czar Tom Homan calls on locals to “end the resistance.”\nThe post “Uptick In Abductions”: ICE Ramps Up Targeting of Minneapolis Legal Observers appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/09/ice-minneapolis-legal-observers-abduction/",
    "timestamp": "2026-02-09T18:18:24Z"
  },
  {
    "title": "Ghislaine Maxwell refuses to answer questions at congressional deposition, lawmakers say",
    "description": "WASHINGTON, Feb 9 () - Jeffrey Epstein associate Ghislaine Maxwell refused to answer questions at a deposition before the U. House's Committee on Oversight...",
    "link": "https://www.yahoo.com/news/articles/ghislaine-maxwell-refuses-answer-questions-180838450.html",
    "timestamp": "2026-02-09T18:18:11Z"
  },
  {
    "title": "Amber Glenn Says She Got ‘Threats’ for Speaking Out Against Trump",
    "description": "Olympic athletes like figure skater Amber Glenn, freestyle skier Hunter Hess, and snowboarder Chloe Kim have made their feelings on the U.S. political climate clear.",
    "link": "http://www.thecut.com/article/usa-athletes-comments-trump-winter-olympics-amber-glenn.html",
    "timestamp": "2026-02-09T18:18:08Z"
  },
  {
    "title": "WATCH: U.S. Military Hunts Down, Boards Vessel Defying 'American Power' in Indian Ocean",
    "description": "The U.S. military stealthily boarded a tanker overnight in the Indian Ocean that was defying President Donald Trump's established quarantine.\nThe post WATCH: U.S. Military Hunts Down, Boards Vessel Defying ‘American Power’ in Indian Ocean appeared first on Br…",
    "link": "https://www.breitbart.com/national-security/2026/02/09/watch-u-s-military-hunts-down-boards-vessel-defying-american-power-in-indian-ocean/",
    "timestamp": "2026-02-09T18:17:43Z"
  },
  {
    "title": "Inside the Right-Wing Movement Pushing Alberta to Secede From Canada",
    "description": "Trump officials have repeatedly met with secessionist leaders from the province, which has large oil and gas deposits.",
    "link": "https://truthout.org/articles/inside-the-right-wing-movement-pushing-alberta-to-secede-from-canada/",
    "timestamp": "2026-02-09T18:17:12Z"
  },
  {
    "title": "Ghislaine Maxwell refuses to answer questions at congressional deposition, lawmakers say",
    "description": "WASHINGTON, Feb 9 (Reuters) - Jeffrey Epstein associate Ghislaine ‌Maxwell refused to answer questions at a deposition before the U.S.  House's Committee on Oversight and ‌Government Reform on Monday, according to lawmakers, drawing criticism from both Republ…",
    "link": "https://www.thestar.com.my/news/world/2026/02/10/ghislaine-maxwell-refuses-to-answer-questions-at-congressional-deposition-lawmakers-say",
    "timestamp": "2026-02-09T18:14:00Z"
  },
  {
    "title": "Newsom’s Betrayal: How to Bury California’s High Speed Train Scandal for 2028 Election",
    "description": "$16 billion and still no train and no track 18 years later California Governor Gavin Newsom and the state’s elected Democrat politicians show a strange level of desperation to build any part of California’s boondoggle High-Speed Rail system. $16 billion has a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366121/posts",
    "timestamp": "2026-02-09T18:12:36Z"
  },
  {
    "title": "Ghislaine Maxwell refuses to answer questions at congressional deposition, lawmakers say",
    "description": "WASHINGTON, Feb 9 (Reuters) - Jeffrey Epstein associate Ghislaine Maxwell refused to answer questions at a deposition before the U.S.  House’s Committee on Oversight and … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/ghislaine-maxwell-refuses-to-answer-questions-at-congressional-deposition-lawmakers-say",
    "timestamp": "2026-02-09T18:12:11Z"
  },
  {
    "title": "Mexico's Sheinbaum says US tariffs on oil suppliers would 'strangle' Cuba",
    "description": "Mexico's President Claudia Sheinbaum says the US president's threat to put tariffs on countries that sell oil to Cuba is \"very unfair\".",
    "link": "https://www.channelnewsasia.com/world/mexico-sheinbaum-trump-us-cuba-oil-tariffs-5918551",
    "timestamp": "2026-02-09T18:11:00Z"
  },
  {
    "title": "US delegation to visit Mauritius for security pact talks, Diego Garcia base",
    "description": "A US delegation will visit Mauritius to discuss a security partnership and cooperation in the Indian Ocean. This comes as the UK transfers sovereignty of the Chagos Islands to Mauritius. India supports Mauritius in this matter and will assist with surveys and…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-delegation-to-visit-mauritius-for-security-pact-talks-diego-garcia-base/articleshow/128125888.cms",
    "timestamp": "2026-02-09T18:10:25Z"
  },
  {
    "title": "During Black History Month: Wes Moore, The Only Black Governor In America, Not Invited To National Governors Association Dinner At White House",
    "description": "Donald Trump loves nothing more than petty political games, especially ones that involve race. but his latest hijinks have stirred up quite a bit of racial animus. Fresh off of his AI-generated portrayal of former President Barack Obama and former First Lady …",
    "link": "https://bossip.com/4355871/wes-moore-not-invited-to-national-governors-association-dinner/",
    "timestamp": "2026-02-09T18:10:14Z"
  },
  {
    "title": "Marina SUA a confiscat un petrolier în Oceanul Indian, după ce l-a urmărit mii de mile marine, din Caraibe. Pentagonul susține că nava încălca blocada impusă de Donald Trump, care vizează transporturile de țiței din Venezuela.",
    "description": "When the @DeptofWar says quarantine, we mean it. Nothing will stop DoW from defending our Homeland — even in oceans halfway around the world. Overnight, U.S. military forces conducted a right-of-visit, maritime interdiction and boarding on the Aquila II witho…",
    "link": "https://www.biziday.ro/347668-2/",
    "timestamp": "2026-02-09T18:09:33Z"
  },
  {
    "title": "Purported Nancy Guthrie ransom note deadline approaches as search enters a second week",
    "description": "The investigation into what happened to the mother of \"Today\" show host Savannah Guthrie entered a second week with still no word on whether the 84-year-old is alive.",
    "link": "https://www.wisn.com/article/nancy-guthrie-search-enters-second-week/70289221",
    "timestamp": "2026-02-09T18:08:27Z"
  },
  {
    "title": "Trump brands skier a 'loser'...",
    "description": "Trump brands skier a 'loser'...\r\n\n \n \n \n (Third column, 14th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Olympic athletes' medals breaking during celebrations...\r\nMedal Count...",
    "link": "https://ca.news.yahoo.com/olympics-u-athletes-speak-trump-164455335.html",
    "timestamp": "2026-02-09T18:04:39Z"
  },
  {
    "title": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm",
    "description": "Immigrants by the thousands have been turning to federal courts by using habeas corpus petitions.",
    "link": "https://www.bostonherald.com/2026/02/09/trump-immigration-strained-courts/",
    "timestamp": "2026-02-09T18:01:07Z"
  },
  {
    "title": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm",
    "description": "Immigrants by the thousands have been turning to federal courts by using habeas corpus petitions.",
    "link": "https://www.denverpost.com/2026/02/09/trump-immigration-strained-courts/",
    "timestamp": "2026-02-09T18:01:07Z"
  },
  {
    "title": "Protestors clash outside Pete Hegseth’s visit to Bath Iron Works",
    "description": "Dozens of people gathered near the U.S. Navy shipbuilder's facilities Monday afternoon ahead of a visit by Defense Secretary Pete Hegseth.",
    "link": "https://www.pressherald.com/2026/02/09/protestors-clash-outside-pete-hegseths-visit-to-bath-iron-works/",
    "timestamp": "2026-02-09T18:01:03Z"
  },
  {
    "title": "Failed 2016 GOP Candidate John Kasich Rushes To Slobber Over Bad Bunny Halftime Show",
    "description": "Former Republican Ohio governor and 2016 Republican presidential candidate John Kasich praised the controversial Super Bowl performance by artist Bad Bunny.",
    "link": "https://dailycaller.com/2026/02/09/john-kasich-bad-bunny-halftime-show/",
    "timestamp": "2026-02-09T18:00:56Z"
  },
  {
    "title": "This Is Trump’s Plan to Steal the Midterms",
    "description": "For months, Democrats have gamed out all the wild ways Donald Trump might try to sabotage the midterm elections — ICE agents at polling places and even talk of canceling elections outright. Most of that is noise. Join now to continue reading. Members get excl…",
    "link": "https://politicalwire.com/2026/02/09/this-is-trumps-plan-to-steal-the-midterms/",
    "timestamp": "2026-02-09T18:00:35Z"
  },
  {
    "title": "Senate Republicans Have The Power To Force Democrats To Filibuster Voter ID — So Why Don’t They?",
    "description": "Senate Republicans could force Democrats into a talking filibuster on voter identification, but it’s unclear if they will use the strategy to pass the bill.",
    "link": "https://dailycaller.com/2026/02/09/mike-lee-chip-roy-save-america-act-donald-trump-talking-filibuster-election-integrity-voter-id/",
    "timestamp": "2026-02-09T18:00:33Z"
  },
  {
    "title": "India may skip Feb 19 Gaza Peace Board meet",
    "description": "As the United States rolls out its Gaza Peace Board initiative, India finds itself at a crossroads. While the nation has not yet pledged its involvement, early signs suggest it may skip the inaugural meeting. Ongoing discussions reveal India's attempt to navi…",
    "link": "https://economictimes.indiatimes.com/news/india/india-may-skip-feb-19-gaza-peace-board-meet/articleshow/128125361.cms",
    "timestamp": "2026-02-09T18:00:27Z"
  },
  {
    "title": "Two Fundraisers for Hundreds of Laid Off Washington Post Journalists Climb to $724K",
    "description": "Two fundraisers for the hundreds of laid-off Washington Post (WP) journalists have exploded as the far-left newsroom struggles.\nThe post Two Fundraisers for Hundreds of Laid Off Washington Post Journalists Climb to $724K appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2026/02/09/two-fundraisers-for-hundreds-of-laid-off-washington-post-journalists-climb-to-724k/",
    "timestamp": "2026-02-09T17:59:23Z"
  },
  {
    "title": "Dr. Oz begs Americans to take the measles vaccine as infections soar",
    "description": "The call for vaccinations runs counter to Kennedy's vaccine-skeptical agenda",
    "link": "https://www.salon.com/2026/02/09/dr-oz-begs-americans-to-take-the-measles-vaccine-as-infections-soar/",
    "timestamp": "2026-02-09T17:58:58Z"
  },
  {
    "title": "Middle East on the brink of war: Why US-Iran talks may be the last chance for peace",
    "description": "As war clouds gather over Iran, will Hezbollah and the Houthis step in to defend Tehran? Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632204-middle-east-on-brink-of-war/",
    "timestamp": "2026-02-09T17:55:27Z"
  },
  {
    "title": "Bill Maher Open to Trump’s Pursuit of Greenland: ‘Is It the Craziest Idea Anybody Has Ever Had? No!’",
    "description": "Bill Maher said he has to give President Trump credit for coming up with ideas that he never thought of before, like the U.S. controlling Greenland\nThe post Bill Maher Open to Trump’s Pursuit of Greenland: ‘Is It the Craziest Idea Anybody Has Ever Had? No!’ f…",
    "link": "https://www.mediaite.com/media/bill-maher-open-to-trumps-pursuit-of-greenland-is-it-the-craziest-idea-anybody-has-ever-had-no/",
    "timestamp": "2026-02-09T17:54:49Z"
  },
  {
    "title": "Amber Glenn faces backlash after Olympic gold",
    "description": "Amber Glenn won Olympic gold in the team event but faces backlash over her political and LGBTQ+ comments.",
    "link": "https://www.kmbc.com/article/amber-glenn-faces-backlash-over-politics-copyright-issues/70289086",
    "timestamp": "2026-02-09T17:53:46Z"
  },
  {
    "title": "VIDEO: First Lady slams critics, says ‘re-election potholes’ hehind negative portrayals",
    "description": "Nigeria’s First Lady Oluremi Tinubu says ‘re-election potholes’ are behind negative portrayals as she discusses economic and security reforms.\n\nRead More: https://punchng.com/video-first-lady-slams-critics-says-re-election-potholes-hehind-negative-portrayals/",
    "link": "https://punchng.com/video-first-lady-slams-critics-says-re-election-potholes-hehind-negative-portrayals/",
    "timestamp": "2026-02-09T17:52:30Z"
  },
  {
    "title": "Donald Trump Threw a Temper Tantrum Over Bad Bunny's Super Bowl Halftime Show",
    "description": "\"Nobody understands a word this guy is saying,\" he whined. (To be fair, we don't understand you either, President Mumble.)",
    "link": "https://www.esquire.com/entertainment/a70289269/super-bowl-halftime-show-donald-trump-reaction/",
    "timestamp": "2026-02-09T17:52:00Z"
  },
  {
    "title": "Irishman detained by ICE in El Paso ‘concentration camp’ asks Taoiseach to raise case with Donald Trump",
    "description": "An Irishman who has been detained by US Immigration and Customs Enforcement (ICE) has described the facilities as “like a modern-day concentration camp”.",
    "link": "https://www.independent.ie/irish-news/irishman-detained-by-ice-in-el-paso-concentration-camp-asks-taoiseach-to-raise-case-with-donald-trump/a1878119332.html",
    "timestamp": "2026-02-09T17:50:09Z"
  },
  {
    "title": "Irishman detained by Ice in El Paso ‘concentration camp’ asks Taoiseach to raise case",
    "description": "An Irishman who has been detained by Ice (US Immigration and Customs Enforcement) has described the facilities as “like a modern day concentration camp”.",
    "link": "https://www.independent.ie/irish-news/irishman-detained-by-ice-in-el-paso-concentration-camp-asks-taoiseach-to-raise-case/a1878119332.html",
    "timestamp": "2026-02-09T17:50:09Z"
  },
  {
    "title": "Bad Bunny Joyfully Forces Football Fans To Acknowledge Existence Of Puerto Rico For 13 Whole Minutes",
    "description": "Will MAGA ever recover?",
    "link": "https://www.wonkette.com/p/bad-bunny-joyfully-forces-football",
    "timestamp": "2026-02-09T17:50:04Z"
  },
  {
    "title": "'We got your back': Massive union refuses to discipline worker who heckled Trump",
    "description": "A Michigan autoworker who heckled President Donald Trump last month during a campaign visit escaped punishment from his union.A United Auto Workers official confirmed Monday that Local 600 line worker TJ Sabula kept his job and \"has no discipline on his recor…",
    "link": "https://www.rawstory.com/heckler-trump/",
    "timestamp": "2026-02-09T17:49:52Z"
  },
  {
    "title": "US snowboard star Chloe Kim calls for unity after Trump bashes teammate over immigrant crackdown",
    "description": "Chinese freeski star Eileen Gu also backed Hunter Hess.",
    "link": "https://www.bostonherald.com/2026/02/09/chloe-kim-trump/",
    "timestamp": "2026-02-09T17:49:42Z"
  },
  {
    "title": "US snowboard star Chloe Kim calls for unity after Trump bashes teammate over immigrant crackdown",
    "description": "Chinese freeski star Eileen Gu also backed Hunter Hess.",
    "link": "https://www.denverpost.com/2026/02/09/chloe-kim-trump/",
    "timestamp": "2026-02-09T17:49:42Z"
  },
  {
    "title": "MFA Boston Denies Targeting DEI Staff in Cutbacks, Former French Culture Minister Jack Lang Stepping Down: Morning Links for February 9, 2026",
    "description": "Former French Culture Minister Jack Lang Stepping Down",
    "link": "https://www.artnews.com/art-news/news/mfa-boston-denies-targeting-dei-staff-in-cutbacks-former-french-culture-minister-jack-lang-stepping-down-morning-links-for-february-9-2026-1234772770/",
    "timestamp": "2026-02-09T17:47:35Z"
  },
  {
    "title": "Ghislane Maxwell Gives James Comer The Middle Finger",
    "description": "Jeffrey Epstein co-conspirator Ghislaine Maxwell invoked her Fifth Amendment right to refuse to answer all questions put to her by the House Oversight Committee during a virtual deposition earlier today.\nChairman James Comer, who spent the entirety of his cha…",
    "link": "https://crooksandliars.com/2026/02/ghislane-maxwell-gives-james-comer-middle",
    "timestamp": "2026-02-09T17:46:16Z"
  },
  {
    "title": "Venezuelan opposition leader seized by armed men after being released from jail",
    "description": "María Corina Machado said Venezuelan opposition leader Juan Pablo Guanipa was seized by armed men in Caracas after his release from prison.",
    "link": "https://www.foxnews.com/world/venezuelan-opposition-leader-seized-armed-men-after-being-released-from-jail",
    "timestamp": "2026-02-09T17:44:39Z"
  },
  {
    "title": "Ed Martin Denies Rift With Deputy AG Todd Blanche",
    "description": "Pardon Attorney Ed Martin denied claims of friction between him and Deputy Attorney General Todd on Monday.",
    "link": "https://dailycaller.com/2026/02/09/ed-martin-denies-rift-with-deputy-ag-todd-blanche/",
    "timestamp": "2026-02-09T17:43:45Z"
  },
  {
    "title": "At Least One Country Is Having a Serious Epstein Reckoning",
    "description": "U.K. Prime Minister Keir Starmer is facing Cabinet resignations and calls to step down for appointing Epstein friend Peter Mandelson as U.S. ambassador.",
    "link": "http://nymag.com/intelligencer/article/the-u-k-s-real-political-crisis-over-epstein-and-mandelson.html",
    "timestamp": "2026-02-09T17:43:36Z"
  },
  {
    "title": "US snowboard star Chloe Kim calls for unity after Trump bashes teammate over immigrant crackdown",
    "description": "Chloe Kim and Eileen Gu, two Olympic standouts who have faced their share of hate over the years, each weighed in Monday on Donald Trump's bashing of their friend, American freeskier Hunter Hess, for having said he didn't back the U.S. president's heightened …",
    "link": "https://sports.yahoo.com/articles/us-snowboard-star-chloe-kim-173948498.html",
    "timestamp": "2026-02-09T17:39:48Z"
  },
  {
    "title": "Bill Maher Vents to Jimmy Kimmel’s Former Co-Host About His Feud With ABC Host: ‘I Don’t Think I Did Anything Wrong’",
    "description": "Bill Maher opened up about his ongoing feud with late-night host Jimmy Kimmel during an interview with Kimmel's former co-host Adam Carolla on Monday.\nThe post Bill Maher Vents to Jimmy Kimmel’s Former Co-Host About His Feud With ABC Host: ‘I Don’t Think I Di…",
    "link": "https://www.mediaite.com/media/tv/bill-maher-vents-to-jimmy-kimmels-former-co-host-about-his-feud-with-abc-host-i-dont-think-i-did-anything-wrong/",
    "timestamp": "2026-02-09T17:39:20Z"
  },
  {
    "title": "Arizona Mexican restaurant offering free meals to ICE agents sparks online reaction",
    "description": "A Trump-backing Arizona restaurant owner offers free meals to ICE agents, faces fierce online backlash and boycott threats over immigration enforcement support policy.",
    "link": "https://www.foxnews.com/media/arizona-mexican-restaurant-offering-free-meals-ice-agents-sparks-online-reaction",
    "timestamp": "2026-02-09T17:39:09Z"
  },
  {
    "title": "Gabbard’s office denies wrongdoing amid scrutiny over whistleblower complaint",
    "description": "ODNI said she acted within her authority in response to reports describing an NSA-intercepted phone call tied to the case.",
    "link": "https://www.nextgov.com/people/2026/02/gabbards-office-denies-wrongdoing-amid-scrutiny-over-whistleblower-complaint/411287/",
    "timestamp": "2026-02-09T17:39:00Z"
  },
  {
    "title": "US Vice President Vance in Armenia for peace talks",
    "description": "Vice President JD Vance became the highest-ranking US politician ever to visit Armenia. He will travel to Azerbaijan on Tuesday in hopes of finalizing a peace deal kicked off in the White House last August.",
    "link": "https://www.dw.com/en/us-vice-president-vance-in-armenia-for-peace-talks/a-75885494",
    "timestamp": "2026-02-09T17:36:00Z"
  },
  {
    "title": "US, Armenia sign nuclear deal during Vance visit",
    "description": "During a visit by Vice President JD Vance, the US and Armenia agreed to cooperate in the civil nuclear sector. Vance will also travel to Azerbaijan, hoping to finalize a peace deal kicked off in the White House.",
    "link": "https://www.dw.com/en/us-armenia-sign-nuclear-deal-during-vance-visit/a-75885494",
    "timestamp": "2026-02-09T17:36:00Z"
  },
  {
    "title": "US military boards sanctioned oil tanker in the Indian Ocean after pursuit from the Caribbean",
    "description": "The Pentagon didn't say whether the ship was connected to Venezuela.",
    "link": "https://www.bostonherald.com/2026/02/09/pentagon-oil-tanker/",
    "timestamp": "2026-02-09T17:35:54Z"
  },
  {
    "title": "US shifts NATO commands to Britain, Italy",
    "description": "The US is handing over two key NATO commands to European allies, a significant NATO commands shift as President Trump pushes for greater responsibility.\n\nRead More: https://punchng.com/us-shifts-nato-commands-to-britain-italy/",
    "link": "https://punchng.com/?p=2059628",
    "timestamp": "2026-02-09T17:35:13Z"
  },
  {
    "title": "Trump Bashes Bad Bunny Super Bowl Show He Said He Was Skipping, Gets Clowned",
    "description": "On Sunday (Feb. 8), the Puerto Rican superstar Bad Bunny thrilled the audience at the 2026 Super Bowl halftime show. The most vocal critic of his performance was President Donald Trump, who soundly slammed him on his Truth Social media platform – and was swif…",
    "link": "https://hiphopwired.com/3037267/trump-bashes-bad-bunny-super-bowl-show-gets-clowned/",
    "timestamp": "2026-02-09T17:35:10Z"
  },
  {
    "title": "Ghislaine Maxwell declined to answer questions from a House committee, citing 5th Amendment rights",
    "description": "House lawmakers tried Monday to interview Ghislaine Maxwell, but the former girlfriend and confidant of Jeffrey Epstein invoked her Fifth Amendment rights to avoid answering questions that would be self-incriminating.",
    "link": "https://www.wpxi.com/news/local/ghislaine-maxwell-declined-answer-questions-house-committee-citing-5th-amendment-rights/XIPSAAXNEJECXMMKEP3IIGH7TQ/",
    "timestamp": "2026-02-09T17:35:01Z"
  },
  {
    "title": "Ghislaine Maxwell Refuses to Testify Unless Trump Grants Clemency, Lawyer Says",
    "description": "Maxwell’s lawyer warned on Monday that she would not say a word unless Trump intervenes with clemency after she declined to answer questions before Congress.\nThe post Ghislaine Maxwell Refuses to Testify Unless Trump Grants Clemency, Lawyer Says first appeare…",
    "link": "https://www.mediaite.com/media/news/ghislaine-maxwell-refuses-to-testify-unless-trump-grants-clemency-lawyer-says/",
    "timestamp": "2026-02-09T17:34:02Z"
  },
  {
    "title": "Bad Bunny Mysteriously Deletes All Instagram Posts After Super Bowl Halftime Show",
    "description": "Bad Bunny has inexplicably scrubbed all of his Instagram posts in the hours since his Super Bowl Halftime Show performance in California on Sunday evening.\nThe post Bad Bunny Mysteriously Deletes All Instagram Posts After Super Bowl Halftime Show first appear…",
    "link": "https://www.mediaite.com/media/entertainment/bad-bunny-mysteriously-deletes-all-instagram-posts-after-super-bowl-halftime-show/",
    "timestamp": "2026-02-09T17:33:39Z"
  },
  {
    "title": "WATCH: Ghislaine Maxwell not cooperating because she is campaigning for Trump pardon, Democrats say",
    "description": "An attorney for Ghislaine Maxwell told lawmakers Manday that she would be willing to testify that neither President Donald Trump nor former President Bill Clinton were culpable for wrongdoing in their relationships with Epstein, according to both Democratic a…",
    "link": "https://www.pbs.org/newshour/politics/watch-ghislaine-maxwell-not-cooperating-because-she-is-campaigning-for-trump-pardon-democrats-say",
    "timestamp": "2026-02-09T17:32:26Z"
  },
  {
    "title": "US set to relinquish several senior NATO command posts",
    "description": "The United States is transferring leadership of two key NATO regional commands to Italy and Britain as part of a broader push for allies to increase defense responsibilities.",
    "link": "https://economictimes.indiatimes.com/news/defence/us-set-to-relinquish-several-senior-nato-command-posts/articleshow/128124627.cms",
    "timestamp": "2026-02-09T17:31:25Z"
  },
  {
    "title": "Doctors increasingly see AI scribes in a positive light. But hiccups persist",
    "description": "AI's potential to transform the health care system is an area of intense focus.",
    "link": "https://www.bostonherald.com/2026/02/09/health-care-ai-scribes/",
    "timestamp": "2026-02-09T17:31:23Z"
  },
  {
    "title": "‘White With Fear,’ Coming To PBS Next Month, Argues Conservative Politicians “Successfully Weaponized Racism And Fear For Decades”",
    "description": "EXCLUSIVE: President Trump’s dissemination of a video last week depicting former Pres. Obama and First Lady Michelle Obama as apes has earned widespread condemnation. But it’s not the first time Republican Party leaders have used racist imagery for political …",
    "link": "http://deadline.com/2026/02/white-with-fear-pbs-documentary-1236712929/",
    "timestamp": "2026-02-09T17:30:00Z"
  },
  {
    "title": "Bombshell Report Reveals Minnesota Officials Were Right About FBI",
    "description": "Donald Trump’s Department of Justice blocked prosecutors in Minnesota from investigating Renee Good’s killing, several people told The New York Times. Before he resigned from his role last month, former acting U.S. Attorney Joseph H. Thompson emailed colleagu…",
    "link": "https://newrepublic.com/post/206355/minnesota-officials-fbi-investigation-renee-nicole-good",
    "timestamp": "2026-02-09T17:26:26Z"
  },
  {
    "title": "Musk shifts focus to Moon as Mars mission remains years away",
    "description": "Elon Musk took to X to proclaim that SpaceX would focus on building out a base on the moon before sending humans to Mars.",
    "link": "https://www.mercurynews.com/2026/02/09/elon-musk-shifts-focus-moon/",
    "timestamp": "2026-02-09T17:25:42Z"
  },
  {
    "title": "Cuba Makes Major Fuel Shortage Announcement",
    "description": "Cuba’s government says international airlines can’t refuel on the island nation starting Monday. Cuban authorities issued an official Notice to Airmen over the weekend, warning... Read More\nThe post Cuba Makes Major Fuel Shortage Announcement appeared first o…",
    "link": "https://www.dailysignal.com/2026/02/09/cuba-makes-major-fuel-shortage-announcement/",
    "timestamp": "2026-02-09T17:25:36Z"
  },
  {
    "title": "In this Trump era, the Olympics are no longer neutral ground for American politics",
    "description": "Officials avoided answering questions about President Donald Trump calling a U.S. skier a 'real Loser' after the athlete expressed 'mixed feelings' about representing his divided nation",
    "link": "https://nationalpost.com/sports/olympics/olympics-no-longer-neutral-ground-u-s-politics",
    "timestamp": "2026-02-09T17:25:01Z"
  },
  {
    "title": "MAHA’s Views on Food Are Widely Popular. Its Anti-Vaccine Identity Isn’t.",
    "description": "Even the MAHA base says in polling that they don't trust RFK Jr.'s views on vaccines. So why is he crafting vaccine policy?",
    "link": "https://www.jezebel.com/maha-platform-position-vaccine-food-safety-pyramid-polling-candidates-measles",
    "timestamp": "2026-02-09T17:24:53Z"
  },
  {
    "title": "JPMorgan’s nationwide home price forecast hides a Sun Belt full of pain. Watch out, Florida and Texas",
    "description": "JPMorgan Global Research sees prices falling quickest on the West Coast and in the Sun Belt.",
    "link": "https://fortune.com/2026/02/09/housing-market-outlook-forecast-home-prices-0-percent-growth-2026-trump-mortgage-rates/",
    "timestamp": "2026-02-09T17:23:11Z"
  },
  {
    "title": "The View’s Ana Navarro Gets Emotional Over Bad Bunny’s Performance: ‘Can’t Overstate What it Means’ After What Trump ‘Has Done to My Community’",
    "description": "Ana Navarro heralded Bad Bunny's Super Bowl half time performance as a \"micro joy\" needed to help with \"macro sadness\" being experienced by Latinos.\nThe post The View’s Ana Navarro Gets Emotional Over Bad Bunny’s Performance: ‘Can’t Overstate What it Means’ A…",
    "link": "https://www.mediaite.com/media/news/the-views-ana-navarro-gets-emotional-over-bad-bunnys-performance-cant-overstate-what-it-means-after-what-trump-has-done-to-my-community/",
    "timestamp": "2026-02-09T17:22:02Z"
  },
  {
    "title": "Paul Thomas Anderson, Jonny Greenwood want 'Phantom Thread' score pulled from 'Melania' movie",
    "description": "Director Paul Thomas Anderson and Radiohead’s Jonny Greenwood requested that music from their 2017 film “Phantom Thread” be removed from the Melania Trump documentary.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/paul-thomas-anderson-jonny-greenwood-want-phantom-thread-score-pulled-rcna258192",
    "timestamp": "2026-02-09T17:20:59Z"
  },
  {
    "title": "US senators visit Greenland to 'rebuild trust' broken by Trump",
    "description": "The visit comes after the US president backed off from a series of threats to take over the Arctic Island and agreed to a \"framework\" deal.",
    "link": "https://www.channelnewsasia.com/world/us-senators-trump-greenland-denmark-5918461",
    "timestamp": "2026-02-09T17:20:00Z"
  },
  {
    "title": "Great News! The Turning Point USA Halftime Show Is On!",
    "description": "Isn’t Bad Bunny an American artist? Don’t millions of people love his music? At the Turning Point USA alternative show, we forget about all that.",
    "link": "https://www.theatlantic.com/newsletters/2026/02/turning-point-usa-halftime-show/685932/",
    "timestamp": "2026-02-09T17:19:00Z"
  },
  {
    "title": "Trump’s anti-DEI orders can proceed after appeals courts ends block",
    "description": "A preliminary injunction blocking President Donald Trump’s executive orders to withhold federal funding for diversity, equity and inclusion grants and contracts was lifted by the 4th U.S. Circuit Court of Appeals at Richmond, Virginia, on Friday.",
    "link": "https://www.abajournal.com/news/article/trumps-anti-dei-orders-can-proceed-after-appeals-courts-ends-block",
    "timestamp": "2026-02-09T17:18:00Z"
  },
  {
    "title": "Where Sanders and AOC backed progressive congressional candidate Analilia Mejia stands on key issues",
    "description": "Where progressive Analilia Mejia, the Bernie Sanders and AOC back candidate who is close to pulling off an upset victory in a Democratic congressional primary, stands on issues",
    "link": "https://www.foxnews.com/politics/where-sanders-aoc-backed-progressive-congressional-candidate-analilia-mejia-stands-key-issues",
    "timestamp": "2026-02-09T17:14:25Z"
  },
  {
    "title": "In the Arctic, the major climate threat of black carbon is overshadowed by geopolitical tensions",
    "description": "Black carbon absorbs sunlight and speeds up melting.",
    "link": "https://www.bostonherald.com/2026/02/09/climate-arctic-black-carbon/",
    "timestamp": "2026-02-09T17:14:13Z"
  },
  {
    "title": "What did Hunter Hess say at Olympics about representing the U.S.?",
    "description": "The freestyle skier spoke out about representing the United States at the Winter Olympics, but the \"mixed emotions\" that come with it.",
    "link": "https://ftw.usatoday.com/story/sports/olympics/2026/02/09/hunter-hess-olympics-team-usa-flag-olympics-trump/88590165007/",
    "timestamp": "2026-02-09T17:06:03Z"
  },
  {
    "title": "‘The View’ Co-Host Visibly Chokes Up While She Gushes Over Bad Bunny",
    "description": "\"The View\" co-host Ana Navarro choked up on Monday while she gushed over rapper Bad Bunny's performance during the Super Bowl Halftime Show.",
    "link": "https://dailycaller.com/2026/02/09/the-view-ana-navarro-bad-bunny-super-bowl/",
    "timestamp": "2026-02-09T17:04:48Z"
  },
  {
    "title": "Dalai Lama Breaks Silence After He Appears More Than 150 Times In The Epstein Files",
    "description": "90-year-old Tibetan spiritual leader, the Dalai Lama, issued a statement after his name appeared more than 150 times in the Epstein files released by the U.S. Department of Justice.",
    "link": "https://www.boredpanda.com/dalai-lama-breaks-silence-after-he-appears-more-than-150-times-in-the-epstein-files/",
    "timestamp": "2026-02-09T17:01:46Z"
  },
  {
    "title": "Mars can wait: Elon Musk shifts focus to the Moon first. Here’s what changed",
    "description": "Elon Musk now aims for the Moon first.  He believes a lunar base offers quicker protection for life.  Mars colonization remains a long-term goal.  SpaceX will align with NASA's Artemis program.  New business ventures like space-based data centers could fund t…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/mars-can-wait-elon-musk-shifts-focus-to-the-moon-first-heres-what-changed/articleshow/128123467.cms",
    "timestamp": "2026-02-09T17:01:20Z"
  },
  {
    "title": "Hong Kong jails democracy advocate Jimmy Lai",
    "description": "The former media tycoon was sentenced to 20 years in prison",
    "link": "https://theweek.com/crime/hong-kong-sentences-jimmy-lai-20-years",
    "timestamp": "2026-02-09T17:01:10Z"
  }
]