[
  {
    "title": "“They’re in a lot of trouble”: Rubio refuses to rule out Cuba strike from US",
    "description": "Trump's Cabinet is not shying away from the president's chatter about war in Latin America.",
    "link": "https://www.salon.com/2026/01/04/theyre-in-a-lot-of-trouble-rubio-refuses-to-rule-out-cuba-strike-from-us/",
    "timestamp": "2026-01-04T19:31:36Z"
  },
  {
    "title": "Report: Iran leadership in panic amid protests and external threats",
    "description": "A New York Times report says Iran’s leadership is grappling with mounting protests while facing increased pressure from the US and Israel, raising fears of further escalation.",
    "link": "https://www.israelnationalnews.com/news/420388",
    "timestamp": "2026-01-04T19:31:00Z"
  },
  {
    "title": "Well-oiled machine behind US’ Maduro operation",
    "description": "A covert CIA operation gathered crucial intelligence on Venezuelan President Nicolás Maduro. This information facilitated a swift and precise U.S. military raid to extract Maduro. The operation, codenamed Absolute Resolve, involved elite Delta Force commandos…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/well-oiled-machine-behind-us-maduro-operation/articleshow/126339760.cms",
    "timestamp": "2026-01-04T19:29:59Z"
  },
  {
    "title": "The U.S. military emerged as a big winner after Maduro’s capture. The other sensation is this Nike outfit",
    "description": "\"Maduro looks like a man who was on Xmas break and wearing his Nike Tech Fleece for a third straight day.\"",
    "link": "https://fortune.com/2026/01/04/nicolas-maduro-venezuela-arrest-outfit-nike-tech-fleece/",
    "timestamp": "2026-01-04T19:28:18Z"
  },
  {
    "title": "The Media Refuses to Call Trump’s Venezuela Attack an Act of War",
    "description": "By framing this brazen act of aggression in euphemistic terms, the media is falling in line with Trump.\nThe post The Media Refuses to Call Trump’s Venezuela Attack an Act of War appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/04/trump-maduro-venezuela-war-media/",
    "timestamp": "2026-01-04T19:28:07Z"
  },
  {
    "title": "Trump Wants Venezuela's Oil. Getting It Might Not Be So Simple",
    "description": "The administration has made it clear that Nicolás Maduro's capture was tied to Venezuela's vast oil reserves. Much less certain is how US companies will actually access them—or if they even want to.",
    "link": "https://www.wired.com/story/trump-wants-venezuelas-oil-getting-it-might-not-be-so-simple/",
    "timestamp": "2026-01-04T19:25:38Z"
  },
  {
    "title": "What Is the Real Reason For the Historic Drop In US Homicide Rates?",
    "description": "Trump admin has overseen largest-ever drop in homicides in the US, but concerns linger about accuracy of data in Democrat cities Despite a flurry of politically charged violence and a number of Islamic and left-wing motivated terror attacks, 2025 also experie…",
    "link": "https://freerepublic.com/focus/f-chat/4360391/posts",
    "timestamp": "2026-01-04T19:23:34Z"
  },
  {
    "title": "Rubio defends Venezuela operation after NBC questions lack of congressional approval for Maduro capture",
    "description": "Secretary of State Marco Rubio defended the U.S. Venezuela operation on \"Meet the Press,\" and argued that congressional approval wasn't needed for the precise mission that captured Nicolás Maduro.",
    "link": "https://www.foxnews.com/media/rubio-defends-venezuela-operation-after-nbc-questions-lack-congressional-approval-maduro-capture",
    "timestamp": "2026-01-04T19:23:19Z"
  },
  {
    "title": "Rubio says US won’t govern Venezuela but will press changes through oil blockade",
    "description": "Secretary of State Marco Rubio suggested Sunday that the United States would not take a day-to-day role in governing Venezuela.",
    "link": "https://www.wsbtv.com/news/national/rubio-says-us-wont-govern-venezuela-will-press-changes-through-oil-blockade/IFYXQMNIZVFADDCIAJCROAM73I/",
    "timestamp": "2026-01-04T19:23:14Z"
  },
  {
    "title": "Martina Navratilova under fire for calling Trump 'insane' and 'serial criminal' after Venezuela strikes",
    "description": "Tennis legend Martina Navratilova criticized Trump's Venezuela intervention as 'pillaging' despite fleeing communist Czechoslovakia in 1975, drawing mixed reactions on social media.",
    "link": "https://www.foxnews.com/sports/martina-navratilova-under-fire-calling-trump-insane-saying-we-have-do-again-after-venezuela",
    "timestamp": "2026-01-04T19:22:59Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Jan. 4, 2026",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Secretary of State Marco Rubio and Sen. Chris Van Hollen join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-01-04-2026/",
    "timestamp": "2026-01-04T19:22:09Z"
  },
  {
    "title": "Satellite images show damage from US strikes at site where Maduro was captured",
    "description": "Satellite imagery captures the scale of destruction from US strikes at the Fuerte Tiuna military base, where Venezuelan officials say president Nicolas Maduro was captured.",
    "link": "https://www.abc.net.au/news/2026-01-05/satellite-images-fuerte-tiuna-strikes-maduro-capture-venezuela/106197796",
    "timestamp": "2026-01-04T19:21:50Z"
  },
  {
    "title": "Trump Team Moved to Oust Maduro Because They Were Put Off By Videos of His Dancing: Report",
    "description": "Donald Trump was reportedly so incensed by Nicolas Maduro's dance moves that he gave the word for the U.S. to invade Venezuela and remove him from power.\nThe post Trump Team Moved to Oust Maduro Because They Were Put Off By Videos of His Dancing: Report first…",
    "link": "https://www.mediaite.com/media/news/trump-reportedly-pushed-to-capture-maduro-because-he-felt-mocked-by-the-venezuelan-leaders-dancing/",
    "timestamp": "2026-01-04T19:19:33Z"
  },
  {
    "title": "Delcy Rodriguez: From Maduro’s ‘tigress’ to acting Venezuelan president",
    "description": "Venezuela’s acting president Delcy Rodriguez is known for her anti-imperialist rhetoric, earning her the nickname “the tigress” from toppled leader Nicolas Maduro. A fierce defender of Maduro, who was snatched by US forces in an extraordinary raid early Satur…",
    "link": "https://www.digitaljournal.com/world/delcy-rodriguez-from-maduros-tigress-to-acting-venezuelan-president/article",
    "timestamp": "2026-01-04T19:17:20Z"
  },
  {
    "title": "Rep. Jim Himes says Maduro capture is \"clearly illegal under international law\"",
    "description": "Rep. Jim Himes, the top Democrat on the House Intelligence Committee, pointed to the broader implications of the operation to remove former Venezuelan President Nicolás Maduro.",
    "link": "https://www.cbsnews.com/news/jim-himes-maduro-capture-clearly-illegal-face-the-nation/",
    "timestamp": "2026-01-04T19:16:54Z"
  },
  {
    "title": "Oil Is Market To Watch as Venezuela Raid Raises Stakes",
    "description": "The US raid on Venezuela could significantly impact the oil market. The price of crude oil, which directly influences American consumer prices at the pump...",
    "link": "https://finance.yahoo.com/news/oil-market-watch-venezuela-raid-191643822.html",
    "timestamp": "2026-01-04T19:16:43Z"
  },
  {
    "title": "Donald Trump & Cabinet Clowned For Trying To Mimic Barack Obama’s Bin Laden Situation Room Photo Moment",
    "description": "Some even spied in the photo that they were using X to search for commentary on Venezuela during the mission.",
    "link": "https://hiphopwired.com/2986116/donald-trump-mar-a-lago-scif-barack-obama-situation-room-venezuela-reactions/",
    "timestamp": "2026-01-04T19:16:33Z"
  },
  {
    "title": "‘Smorgasbord of stupid’: Gregg Jarrett explains how Democrats suing Trump backfired",
    "description": "'It boomeranged against them big time'",
    "link": "https://www.wnd.com/2026/01/smorgasbord-stupid-gregg-jarrett-explains-how-democrats-suing/",
    "timestamp": "2026-01-04T19:14:35Z"
  },
  {
    "title": "Can Maduro's trusted lieutenant now work for Trump?",
    "description": "Delcy Rodríguez, a close ally of captured Venezuelan leader Nicolás Maduro, has been named interim president.",
    "link": "https://www.bbc.com/news/articles/cvgx0ylzy8vo",
    "timestamp": "2026-01-04T19:13:45Z"
  },
  {
    "title": "NBC Host Gives Marco Rubio The Third Degree On Trump Not Getting Congressional Approval For Venezuela Strike",
    "description": "The secretary of state accused Democrats of only going “bonkers” when it’s an issue involving the president.",
    "link": "https://www.huffpost.com/entry/marco-rubio-trump-no-approval-congress-venezuela-strike_n_695a8e3ce4b0bdbffbb44c72",
    "timestamp": "2026-01-04T19:13:35Z"
  },
  {
    "title": "Here are the countries with the most oil reserves, and where Venezuela ranks",
    "description": "Trump says the US will look to tap Venezuela's oil. Venezuela has the most oil reserves, but only accounts for 1% of global production.",
    "link": "https://www.businessinsider.com/oil-reserves-by-country-and-where-venezuela-ranks-2026-1",
    "timestamp": "2026-01-04T19:09:38Z"
  },
  {
    "title": "Democratic leaders condemn Trump’s claims about Hortman’s death",
    "description": "Conspiracy theories perpetuated by Truth Social posts suggest Minnesota Gov. Tim Walz was behind the assassination of his friend and colleague",
    "link": "https://www.inforum.com/news/minnesota/democratic-leaders-condemn-trumps-claims-about-hortmans-death",
    "timestamp": "2026-01-04T19:07:43Z"
  },
  {
    "title": "Ben Shapiro Calls Out Tucker Carlson’s Claim ‘Globo Homo’ People Wanted Venezuela’s Maduro Ousted",
    "description": "Ben Shapiro bashed Tucker Carlson for suggesting \"globo homo\" was driving the ouster of Venezuelan dictator Nicolás Maduro following his capture by Trump\nThe post Ben Shapiro Calls Out Tucker Carlson’s Claim ‘Globo Homo’ People Wanted Venezuela’s Maduro Ouste…",
    "link": "https://www.mediaite.com/media/ben-shapiro-calls-out-tucker-carlsons-claim-globo-homo-people-wanted-venezuelas-maduro-ousted/",
    "timestamp": "2026-01-04T19:07:14Z"
  },
  {
    "title": "Florida mayor says Maduro capture a 'light at the end of the tunnel' as Venezuelan Americans celebrate",
    "description": "Venezuelan Americans celebrate after Nicolás Maduro was captured by the U.S. military, sparking renewed hope for democracy in in the nation.",
    "link": "https://www.foxnews.com/media/florida-mayor-says-maduro-capture-light-end-tunnel-venezuelan-americans-celebrate",
    "timestamp": "2026-01-04T19:05:12Z"
  },
  {
    "title": "PwC ‘leans in’ to crypto as Donald Trump and lawmakers embrace sector",
    "description": "",
    "link": "https://biztoc.com/x/c0996cb667a82a92",
    "timestamp": "2026-01-04T19:02:20Z"
  },
  {
    "title": "Fact-checking Trump's claims after U.S. strike on Venezuela and capture of Maduro",
    "description": "After the U.S. captured Venezuelan President Nicolás Maduro, President Donald Trump made false and misleading statements about previous U.S. strikes on Venezuelan boats and Maduro sending the gang Tren de Aragua to to the U.S., according to fact-checking by P…",
    "link": "https://biztoc.com/x/901238622e3ff69d",
    "timestamp": "2026-01-04T19:01:49Z"
  },
  {
    "title": "Kamala Harris Humiliates Herself Condemning Capture of Maduro",
    "description": "It’s been over a year now since her humiliating loss to President Donald Trump, yet for some reason, Kamala Harris still hasn’t figured out that she’s a joke and should fade away into the sunset rather than subject herself to future embarrassment for opening …",
    "link": "https://freerepublic.com/focus/f-bloggers/4360389/posts",
    "timestamp": "2026-01-04T19:00:08Z"
  },
  {
    "title": "Kamala Harris Humiliates Herself Condemning Capture of Maduro",
    "description": "It’s been over a year now since her humiliating loss to President Donald Trump, yet for some reason, Kamala Harris still hasn’t figured out that she’s a joke and should fade away into the sunset rather than subject herself to future embarrassment for opening …",
    "link": "https://freerepublic.com/focus/f-news/4360389/posts",
    "timestamp": "2026-01-04T19:00:08Z"
  },
  {
    "title": "Venezuela has the world’s largest oil reserves but US companies will approach with caution",
    "description": "The Trump administration is betting on US energy companies, but they are unlikely to rush to invest amid instability",
    "link": "https://www.irishtimes.com/world/americas/2026/01/04/venezuela-has-the-worlds-largest-oil-reserves-but-us-companies-will-approach-with-caution/",
    "timestamp": "2026-01-04T19:00:01Z"
  },
  {
    "title": "Richard Haas Assays U.S. Invasion of Venezuela",
    "description": "Richard Haas was president of the council on Foreign Relations for 20 years, so he qualifies as an expert on foreign affairs, not a pundit. He writes a blog called “Home and Away,” where he comments on international issues. Open the link to his post to see hi…",
    "link": "https://dianeravitch.net/2026/01/04/richard-haas-assays-u-s-invasion-of-venezuela/",
    "timestamp": "2026-01-04T19:00:00Z"
  },
  {
    "title": "Chinese social media hails US move as template for Taiwan",
    "description": "Trump's operation against the Venezuelan strongman shot to the top of China's Weibo late Saturday, with the topic gaining some 440 million views on the X-like platform. Many commentators were quick to make comparisons between the fate of the South American na…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinese-social-media-hails-us-move-as-template-for-taiwan/articleshow/126339409.cms",
    "timestamp": "2026-01-04T18:59:08Z"
  },
  {
    "title": "‘We Need It’: Trump Signals US is Coming for Greenland Next",
    "description": "President Donald Trump suggested the next U.S. takeover target might be Greenland, telling The Atlantic’s Michael Scherer on Sunday that “we need it for defense.” Trump called Scherer to discuss the American military action conducted on Friday night which res…",
    "link": "https://www.mediaite.com/media/news/we-need-it-trump-signals-us-is-coming-for-greenland-next/",
    "timestamp": "2026-01-04T18:57:02Z"
  },
  {
    "title": "Iran’s regime is teetering on the edge — the West should help push it over",
    "description": "Three years shy of its 50th anniversary, Iran’s tyrannical, terror-sponsoring regime may finally be nearing its breaking point. Cross your fingers. The key question now is: What will the world — particularly America — do to ensure, and hasten, its demise, and…",
    "link": "https://nypost.com/2026/01/04/opinion/irans-regime-is-teetering-on-the-edge-the-west-should-help-push-it-over/",
    "timestamp": "2026-01-04T18:56:35Z"
  },
  {
    "title": "Trump wants the US oil industry to thrive in Venezuela again. That won’t be easy - CNN",
    "description": "Trump wants the US oil industry to thrive in Venezuela again. That won’t be easyCNN Trump takedown of Venezuela’s dictator could inject price premium into oil market, strategist projectsMarketWatch Trump’s focus on Venezuelan oil reinforces claim action was n…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180513519",
    "timestamp": "2026-01-04T18:52:50Z"
  },
  {
    "title": "Were the US actions in Venezuela legal under international law?",
    "description": "International law is created by all states, not just the powerful few. This makes international community reactions to breaches particularly important.",
    "link": "https://www.abc.net.au/news/2026-01-05/were-the-us-actions-in-venezuela-legal-under-international-law/106198134",
    "timestamp": "2026-01-04T18:50:05Z"
  },
  {
    "title": "Tom Cotton Swipes At Dana Bash Asking If The US Is ‘Repeating The Mistakes in Iraq with Venezuela’",
    "description": "Tom Cotton swiped at CNN's Dana Bash Sunday for equating the 2003 invasion of Iraq with the Trump administration's successful removal of Nicolas Maduro.\nThe post Tom Cotton Swipes At Dana Bash Asking If The US Is ‘Repeating The Mistakes in Iraq with Venezuela…",
    "link": "https://www.mediaite.com/media/news/tom-cotton-swipes-at-dana-bash-asking-if-the-us-is-repeating-the-mistakes-in-iraq-with-venezuela/",
    "timestamp": "2026-01-04T18:48:49Z"
  },
  {
    "title": "Australian dollar at a critical crossroads but which way will it go?",
    "description": "The value of Australia's currency could move significantly up or down depending on the direction of interest rates. But the global economic backdrop will also be crucial in determining its direction.",
    "link": "https://www.abc.net.au/news/2026-01-05/australian-dollar-now-dependent-on-interest-rates-commodities/106186480",
    "timestamp": "2026-01-04T18:48:46Z"
  },
  {
    "title": "Reviving Venezuela’s oil sector will be slow and risky despite Trump’s push, industry executives say",
    "description": "US oil companies face significant hurdles in reviving Venezuela's oil sector, despite President Trump's optimism. Industry executives highlight the need for political stability and legal certainty before companies will commit billions, citing past expropriati…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/reviving-venezuelas-oil-sector-will-be-slow-and-risky-despite-trumps-push-industry-executives-say/articleshow/126339248.cms",
    "timestamp": "2026-01-04T18:48:35Z"
  },
  {
    "title": "Trump warns Venezuela VP Rodríguez may pay bigger price than ousted leader if she ‘doesn't do what's right’",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"6958ea93bc1b8c1e795e9602\"\n}",
    "link": "https://www.independent.ie/world-news/north-america/trump-warns-venezuela-vp-rodriguez-may-pay-bigger-price-than-ousted-leader-if-she-doesnt-do-whats-right/a227793681.html",
    "timestamp": "2026-01-04T18:48:01Z"
  },
  {
    "title": "Trump Says Venezuelan Vice President Will Pay Higher Price Than Maduro if She Disobeys US",
    "description": "MOSCOW (Sputnik) - US President Donald Trump warned on Sunday that Venezuelan Vice President Delcy Rodriguez might have to pay an even higher price than Venezuelan President Nicolas Maduro if she did not make the \"right\" decisions.",
    "link": "https://sputnikglobe.com/20260104/trump-says-venezuelan-vice-president-will-pay-higher-price-than-maduro-if-she-disobeys-us-1123418781.html",
    "timestamp": "2026-01-04T18:47:32Z"
  },
  {
    "title": "Fact-checking Trump's claims after U.S. strike on Venezuela and capture of Maduro",
    "description": "After the U.S. captured Venezuelan President Nicolás Maduro, President Donald Trump made false and misleading statements about previous U.S. strikes on Venezuelan boats and Maduro sending the gang Tren de Aragua to to the U.S., according to fact-checking by P…",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-claims-after-u-s-strike-on-venezuela-and-capture-of-maduro",
    "timestamp": "2026-01-04T18:46:05Z"
  },
  {
    "title": "Trump Hosts Musk at Mar-a-Lago Dinner After Shock Maduro Raid, Photo Shows",
    "description": "A photo exclusively obtained by Newsweek on Sunday showed Elon Musk dining with President Donald Trump at Mar-a-Lago, seemingly around the time that Musk announced his Starlink satellite internet service would deploy in Venezuela following the capture of Nico…",
    "link": "https://biztoc.com/x/1df43e2d87546512",
    "timestamp": "2026-01-04T18:40:07Z"
  },
  {
    "title": "‘Trump Accounts’ start soon: How to get $1,000 for your child",
    "description": "Parents can soon get $1,000 for their child, thanks to a provision in President Donald Trump’s big bill signed into law last year.\nThe so-called “Trump Accounts” will receive $1,000 for every baby born between 2025 and 2028, as long as their parents open an a…",
    "link": "https://biztoc.com/x/ae0fd67c20ee72fe",
    "timestamp": "2026-01-04T18:39:55Z"
  },
  {
    "title": "Trump just gave countries worldwide the 'green light' for military invasions: analysis",
    "description": "The Trump administration’s repeated justification for capturing Venezuela's president has been that he was facing criminal charges from the United States, but one political commentator noted that by that same logic, President Donald Trump had just given count…",
    "link": "https://www.rawstory.com/trump-2674846471/",
    "timestamp": "2026-01-04T18:38:30Z"
  },
  {
    "title": "In Venezuela acting prez, US sees a champion of American oil interests",
    "description": "Weeks earlier, U.S. officials had already settled on an acceptable candidate to replace Maduro, at least for the time being: Vice President Delcy Rodriguez, who had impressed Trump officials with her management of Venezuela's crucial oil industry.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-venezuela-acting-prez-us-sees-a-champion-of-american-oil-interests/articleshow/126339113.cms",
    "timestamp": "2026-01-04T18:38:11Z"
  },
  {
    "title": "International law cannot be violated unilaterally: Congress",
    "description": "The Congress party has voiced serious concern regarding recent United States actions in Venezuela. Party leaders emphasized that established international law principles must not be disregarded. While not directly condemning the military actions or the captur…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/international-law-cannot-be-violated-unilaterally-congress/articleshow/126339106.cms",
    "timestamp": "2026-01-04T18:37:39Z"
  },
  {
    "title": "Marjorie Taylor Greene Hits Out at ‘MAGA Mar-a-Lago Sexualization’",
    "description": "Several beauty trends for conservative women have emerged this year, some with a certain underlying level of humor—from the so-called Mar-a-Lago face to the \"conservative girl\" makeup. What all these trends have in common under the umbrella of MAGA beauty is …",
    "link": "https://freerepublic.com/focus/f-chat/4360387/posts",
    "timestamp": "2026-01-04T18:36:08Z"
  },
  {
    "title": "What is Delta Force? The elite US special ops unit reported to be at the center of the raid to capture Venezuela's Maduro",
    "description": "The US's highly elite but secretive Delta Force captures and eliminates high-value targets. They reportedly helped capture Venezuela's Maduro.",
    "link": "https://www.businessinsider.com/what-is-delta-force-special-ops-unit-2026-1",
    "timestamp": "2026-01-04T18:29:44Z"
  },
  {
    "title": "Rubio says the U.S. doesn’t need Venezuelan oil but seeks to deny adversaries control over it—and doesn’t rule out occupying the country",
    "description": "President Donald Trump touted U.S. access to Venezuelan oil after ousting Nicolas Maduro, but Secretary of State Marco Rubio pointed to other foreign policy priorities.\nTrump said U.S. oil companies will invest billions of dollars to rebuild the country’s ene…",
    "link": "https://biztoc.com/x/d9571c24b3b2c389",
    "timestamp": "2026-01-04T18:29:02Z"
  },
  {
    "title": "Denmark urges 'respect' after Trump aide's wife posts on Greenland",
    "description": "Katie Miller's message showed an altered image of the Danish autonomous territory alongside the word \"SOON\".",
    "link": "https://www.bbc.com/news/articles/c4g0zg974v1o",
    "timestamp": "2026-01-04T18:27:38Z"
  },
  {
    "title": "Yes, the US wants Venezuela's oil but that's not all",
    "description": "",
    "link": "https://www.rte.ie/news/analysis-and-comment/2026/0104/1551434-venezuela-maduro/",
    "timestamp": "2026-01-04T18:21:43Z"
  },
  {
    "title": "'We Need to Do This Once A Week:' Top Gaming Streamer 'Asmongold' Praises Trump for Maduro Capture",
    "description": "Top gaming streamer Zach \"Asmongold\" Hoyt reacted to President Donald Trump's Saturday morning announcement that the United States military captured Venezuela's socialist dictator Nicolás Maduro, telling the President to \"keep the same energy\" going, and sugg…",
    "link": "https://www.breitbart.com/tech/2026/01/04/we-need-to-do-this-once-a-week-top-gaming-streamer-asmongold-praises-trump-for-maduro-capture/",
    "timestamp": "2026-01-04T18:17:48Z"
  },
  {
    "title": "Cooperate or pay a ‘very big price’, Trump warns new Venezuelan leader",
    "description": "President Trump warns new Venezuelan leader Delcy Rodriguez to cooperate with the US or face a ‘very big price’ after the capture of Nicolas Maduro.\n\nRead More: https://punchng.com/cooperate-or-pay-a-very-big-price-trump-warns-new-venezuelan-leader/",
    "link": "https://punchng.com/?p=2027301",
    "timestamp": "2026-01-04T18:16:55Z"
  },
  {
    "title": "Sunday TV Exposed the Constitutional Breakdown Behind Trump’s Venezuela Claim",
    "description": "On Sunday TV, Marco Rubio couldn’t explain the legal authority for Trump’s Venezuela claim—and Congress signaled it had no interest in asking.\nThe post Sunday TV Exposed the Constitutional Breakdown Behind Trump’s Venezuela Claim first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/sunday-tv-exposed-the-constitutional-breakdown-behind-trumps-venezuela-claim/",
    "timestamp": "2026-01-04T18:15:39Z"
  },
  {
    "title": "'Why Is X on the Screen?': Donald Trump Ridiculed for Massive Social Media Screen in Mar-a-Lago 'War Room' Images",
    "description": "President Donald Trump posted photos showing what he described as a Mar-a-Lago 'war room' on Truth Social.",
    "link": "https://radaronline.com/p/donald-trump-ridiculed-social-media-screen-mar-a-lago-war-room-images/",
    "timestamp": "2026-01-04T18:15:00Z"
  },
  {
    "title": "Retired Delta Force vet reveals biggest challenge in Maduro capture mission in Venezuela",
    "description": "Retired Delta Force member reveals the biggest challenge in capturing Venezuela's Nicolás Maduro wasn't the target — it was addressing the country's air defenses.",
    "link": "https://www.foxnews.com/media/retired-delta-force-vet-reveals-biggest-challenge-venezuela-maduro-capture-mission",
    "timestamp": "2026-01-04T18:14:27Z"
  },
  {
    "title": "‘You’re confused?’: Marco Rubio destroys network news anchor over ‘absurd’ question on U.S. capture of Maduro in Venezuela",
    "description": "'I don't know why that's confusing to you'",
    "link": "https://www.wnd.com/2026/01/youre-confused-marco-rubio-destroys-network-news-anchor/",
    "timestamp": "2026-01-04T18:13:00Z"
  },
  {
    "title": "Lorde Had A Surprising Take On Her South Park Parody",
    "description": "Here's what Lorde had to say about her South Park parody, which sees Stan Marsh's goofy, middle-aged dad Randy seemingly impersonating the pop star.",
    "link": "https://www.tvline.com/2065253/lorde-south-park-parody-thoughts/",
    "timestamp": "2026-01-04T18:12:00Z"
  },
  {
    "title": "Over 30 killed, several kidnapped in Nigeria",
    "description": "Armed gangs killed more than 30 people and kidnapped others in a raid in Nigeria in the same state where hundreds of schoolchildren were abducted late last year, police said.",
    "link": "https://www.rte.ie/news/world/2026/0104/1551439-nigeria-kidnap/",
    "timestamp": "2026-01-04T18:11:38Z"
  },
  {
    "title": "US will not run Venezuela day to day, Rubio says after Trump remarks",
    "description": "Rubio said the US would instead continue enforcing an existing oil quarantine on sanctioned tankers as leverage to press policy changes, including curbing drug trafficking",
    "link": "https://www.thehindubusinessline.com/news/world/us-will-not-run-venezuela-day-to-day-rubio-says-after-trump-remarks/article70471913.ece",
    "timestamp": "2026-01-04T18:06:51Z"
  },
  {
    "title": "From Caracas 'fort' to New York court: Maduro's capture in pictures and maps",
    "description": "An elite unit of the US army captured the Venezuelan leader in an extraordinary operation that can be followed through photos, satellite images and maps.",
    "link": "https://www.bbc.com/news/articles/c5yvxnlw1pzo",
    "timestamp": "2026-01-04T18:05:10Z"
  },
  {
    "title": "Venezuela still owes US energy companies billions as Trump calls for new investment",
    "description": "Trump wants U.S. oil companies to invest billions in Venezuela's broken infrastructure, but massive unpaid debts to American firms complicate plans.",
    "link": "https://www.foxnews.com/politics/venezuela-still-owes-us-energy-companies-billions-trump-calls-new-investment",
    "timestamp": "2026-01-04T18:04:30Z"
  },
  {
    "title": "Greenland slams 'disrespectful' pic posted by Trump aide's wife",
    "description": "Greenland and Denmark on Sunday expressed their distaste after the wife of President Donald Trump's most influential aide posted a social media picture of...",
    "link": "https://www.yahoo.com/news/articles/denmark-irritated-wife-trump-aide-130735420.html",
    "timestamp": "2026-01-04T18:04:03Z"
  },
  {
    "title": "Maduro, wife greeted by jeers of ‘down with the dictator’ by hundreds of revelers at Brooklyn lock up",
    "description": "Hundreds of revelers chanted and celebrated outside a Brooklyn lockup as Venezuelan strongman Nicolás Maduro and his wife, Cilia Flores, were hauled inside to face federal narco-terrorism charges. The couple were greeted at the Brooklyn Detention Center with …",
    "link": "https://freerepublic.com/focus/f-chat/4360384/posts",
    "timestamp": "2026-01-04T18:03:11Z"
  },
  {
    "title": "Maharashtra: Rs 36.3 lakh awarded to kin of man killed in 2020 bus mishap",
    "description": "Thane: The Motor Accident Claims Tribunal (MACT) directed MSRTC to pay Rs 36.3 lakh to the family of a 44-year-old man killed in a collision with an S.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/maharashtra-rs-36-3-lakh-awarded-to-kin-of-man-killed-in-2020-bus-mishap/articleshow/126337975.cms",
    "timestamp": "2026-01-04T18:03:00Z"
  },
  {
    "title": "Getting rid of ‘mentality of slavery’, reforms push likely central themes of Prez address at Parl’s joint sitting",
    "description": "India News: NEW DELHI: Getting rid of the “mentality of slavery” and the thrust on “reform, perform and transform” are likely to be the central themes of the Pres.",
    "link": "https://timesofindia.indiatimes.com/india/getting-rid-of-mentality-of-slavery-reforms-push-likely-central-themes-of-prez-address-at-parls-joint-sitting/articleshow/126338308.cms",
    "timestamp": "2026-01-04T18:02:09Z"
  },
  {
    "title": "Man dies by suicide after Rs 42 lakh cyberfraud in Rohtas",
    "description": "Sasaram: A 42-year-old man, allegedly driven to despair over a Rs 42 lakh cyberfraud, ended his life by consuming poison in Khaira village under the D.",
    "link": "https://timesofindia.indiatimes.com/city/patna/man-dies-by-suicide-after-rs-42-lakh-cyberfraud-in-rohtas/articleshow/126338307.cms",
    "timestamp": "2026-01-04T18:01:26Z"
  },
  {
    "title": "How Trump is reviving the Monroe Doctrine after Maduro’s arrest",
    "description": "President Donald Trump’s reference to the Monroe Doctrine while explaining the US operation that led to Nicolas Maduro’s arrest has revived debate over a 200-year-old policy and how Washington is using it to justify intervention in Venezuela today.",
    "link": "https://www.thehindubusinessline.com/news/world/how-trump-is-reviving-the-monroe-doctrine-after-maduros-arrest/article70471893.ece",
    "timestamp": "2026-01-04T18:00:33Z"
  },
  {
    "title": "‘Jeevika Didi Ki Rasoi’ set to open at 19 bus depots",
    "description": "In a groundbreaking effort to enhance passenger experiences, 'Jeevika Didi Ki Rasoi' canteens will soon open at nineteen major bus depots across Bihar. This initiative, forged by a partnership between the transport and rural development departments, will prov…",
    "link": "https://timesofindia.indiatimes.com/city/patna/jeevika-didi-ki-rasoi-set-to-open-at-19-bus-depots/articleshow/126338187.cms",
    "timestamp": "2026-01-04T18:00:19Z"
  },
  {
    "title": "After Attacking Venezuela, Trump Threatens 3 More Latin Countries",
    "description": "United States ruler Donald Trump issued a command to attack Venezuela. The dramatic military operation in Caracas led to the capture of President Nicolas Maduro and his wife, who are now in U.S. custody and on American soil.",
    "link": "https://www.shtfplan.com/war/after-attacking-venezuela-trump-threatens-3-more-latin-countries",
    "timestamp": "2026-01-04T18:00:15Z"
  },
  {
    "title": "Peace Talks Over Prime Rib: Donald Trump and Elon Musk Bury the Hatchet in Front of Applauding Crowd at Mar-a-Lago",
    "description": "Donald Trump and Elon Musk were seen enjoying a dinner together despite their months of feuding.",
    "link": "https://radaronline.com/p/donald-trump-and-elon-musk-put-past-spats-aside-at-mar-a-lago-dinner-photos/",
    "timestamp": "2026-01-04T18:00:00Z"
  },
  {
    "title": "Ichiro Suzuki net worth: MLB career highlights, contracts, brand deals, and business ventures",
    "description": "Ichiro Suzuki's remarkable baseball career began in Japan before a seamless transition to MLB, where he won Rookie of the Year and MVP in his debut season. His 3000+ MLB hits and over 4300 combined hits solidified his status as a legend, earning him significa…",
    "link": "https://timesofindia.indiatimes.com/sports/mlb/news/ichiro-suzuki-net-worth-mlb-career-highlights-contracts-brand-deals-and-business-ventures/articleshow/126338223.cms",
    "timestamp": "2026-01-04T17:57:48Z"
  },
  {
    "title": "Pizza orders near Pentagon ‘suddenly surged in traffic’ during Venezuela attack — and it might be connected to bizarre theory",
    "description": "A pizza place near the Pentagon received an unusual rush in orders just an hour after the US launched its attack on Venezuela. Pizzato Pizza in Arlington, Virginia, “suddenly surged in traffic” at 2 a.m. Friday, according to Pentagon Pizza Report, an online a…",
    "link": "https://freerepublic.com/focus/f-news/4360383/posts",
    "timestamp": "2026-01-04T17:56:59Z"
  },
  {
    "title": "Def minister to commission Coast Guard’s 1st indigenously-built pollution control vessel",
    "description": "India News: NEW DELHI: The Indian Coast Guard’s first indigenously built pollution control vessel, ‘Samudra Pratap’, is set to be commissioned by defence minister.",
    "link": "https://timesofindia.indiatimes.com/india/def-minister-to-commission-coast-guards-1st-indigenously-built-pollution-control-vessel/articleshow/126337968.cms",
    "timestamp": "2026-01-04T17:56:32Z"
  },
  {
    "title": "Maduro arrives in New York to face charges after U.S. operation questioned by legal experts",
    "description": "Deposed Venezuelan leader Nicolás Maduro arrived in the United States to face criminal charges after being captured in an audacious nighttime military operation that President Donald Trump said would set the U.S. up to \"run\" the South American country and tap…",
    "link": "https://biztoc.com/x/b0d3e1f5853d9b12",
    "timestamp": "2026-01-04T17:56:09Z"
  },
  {
    "title": "Questions swirl about who is going to 'run' Venezuela after Maduro's ouster",
    "description": "Questions swirl about who is going to 'run' Venezuela after Maduro's oustergo.com",
    "link": "https://abcnews.go.com/Politics/questions-swirl-run-venezuela-after-maduros-ouster/story?id=128889162",
    "timestamp": "2026-01-04T17:55:38Z"
  },
  {
    "title": "Why hollywood actor Tom Hardy turned down Arman Tsarukyan’s grappling challenge despite his jiu-jitsu background",
    "description": "Tom Hardy has turned down a grappling challenge from Arman Tsarukyan, citing a busy filming schedule until March 2026. The proposed match was set for December 30, 2025, and details surfaced through a shared message on social media. Hardy thanked the organizer…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/why-hollywood-actor-tom-hardy-turned-down-arman-tsarukyans-grappling-challenge-despite-his-jiu-jitsu-background/articleshow/126338130.cms",
    "timestamp": "2026-01-04T17:54:17Z"
  },
  {
    "title": "Maduro Capture Memes Melt the Internet",
    "description": "The recent capture of Venezuela's socialist dictator Nicolás Maduro by U.S forces immediately led to a deluge of memes across social media making fun of the captured dictator.\nThe post Maduro Capture Memes Melt the Internet appeared first on Breitbart.",
    "link": "https://www.breitbart.com/tech/2026/01/04/maduro-capture-memes-melt-the-internet/",
    "timestamp": "2026-01-04T17:53:41Z"
  },
  {
    "title": "Venezuela: Why Nigerians seeking Trump’s protection should rethink – Ex-INEC boss",
    "description": "A former INEC boss warns Nigerians seeking Trump’s protection to learn from the US invasion of Venezuela, arguing the motive is resource control.\n\nRead More: https://punchng.com/venezuela-why-nigerians-seeking-trumps-protection-should-rethink-ex-inec-boss/",
    "link": "https://punchng.com/venezuela-why-nigerians-seeking-trumps-protection-should-rethink-ex-inec-boss/",
    "timestamp": "2026-01-04T17:53:33Z"
  },
  {
    "title": "Trump's Venezuela action may redraw geopolitics; time for India to get its act together",
    "description": "As the United States expands its footprint internationally, the acquisition of Venezuela's rich oil reserves marks a pivotal moment in South America. This sudden strategy pivot poses significant implications for China's position in the global market, while it…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/trumps-venezuela-action-may-redraw-geopolitics-time-for-india-to-get-its-act-together/articleshow/126337790.cms",
    "timestamp": "2026-01-04T17:52:21Z"
  },
  {
    "title": "The Undertaker bike collection: Love for Harley-Davidson, custom builds, luxury lifestyle, and personal favorites",
    "description": "Wrestling icon The Undertaker, Mark William Callaway, has a profound passion for motorcycles, viewing them as integral to his identity. His collection features custom builds and a significant number of Harley-Davidson models, including the iconic Fat Boy and …",
    "link": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/the-undertaker-bike-collection-love-for-harley-davidson-custom-builds-luxury-lifestyle-and-personal-favorites/articleshow/126337855.cms",
    "timestamp": "2026-01-04T17:51:53Z"
  },
  {
    "title": "‘Let Me Ask the Question Again’: Stephanopoulos Pushes Rubio for Answers On Venezuela in Tense Battle",
    "description": "ABC's George Stephanopoulos battled Secretary of State Marco Rubio Sunday morning — questioning him repeatedly on the legality of the U.S. running Venezuela.\nThe post ‘Let Me Ask the Question Again’: Stephanopoulos Pushes Rubio for Answers On Venezuela in Ten…",
    "link": "https://www.mediaite.com/media/news/let-me-ask-the-question-again-stephanopoulos-pushes-rubio-for-answers-on-venezuela-in-tense-battle/",
    "timestamp": "2026-01-04T17:51:49Z"
  },
  {
    "title": "Elon Musk falls for 'transparently fake' video of Venezuelans thanking Trump",
    "description": "Tesla founder and rabid supporter of President Donald Trump Elon Musk shared a video late Saturday of what appears to be Venezuelans “crying on their knees thanking Trump” for his hostile takeover of Venezuela, but critics were quick to point out that Musk – …",
    "link": "https://www.rawstory.com/venezuela-2674846427/",
    "timestamp": "2026-01-04T17:51:39Z"
  },
  {
    "title": "Venezuela was already invaded",
    "description": "Sorry about the source, Facebook, but it is the California Patriots Network. This gentleman makes an impassioned case about Venezuela and what is really happening and it isn’t about oil, as the mainstream press insists. https://www.facebook.com/reel/200374959…",
    "link": "https://freerepublic.com/focus/f-chat/4360380/posts",
    "timestamp": "2026-01-04T17:50:52Z"
  },
  {
    "title": "Why the Pittsburgh Pirates are backing off Eugenio Suárez as $10.25M Alec Bohm buzz grows amid Bo Bichette talks?",
    "description": "Bo Bichette’s name moved back into MLB trade talk on Saturday after Toronto’s spending spree. With the Phillies now linked to him, insiders say Alec Bohm could be the odd man out. Pittsburgh Pirates voices believe Bohm fits their budget better than Eugenio Su…",
    "link": "https://timesofindia.indiatimes.com/sports/mlb/news/why-the-pittsburgh-pirates-are-backing-off-eugenio-surez-as-10-25m-alec-bohm-buzz-grows-amid-bo-bichette-talks/articleshow/126338007.cms",
    "timestamp": "2026-01-04T17:50:05Z"
  },
  {
    "title": "Probe ordered into alleged police assault",
    "description": "A shocking video has emerged from Patna, featuring a plainclothes officer allegedly attacking a young man. In the footage, the officer can be heard expressing anti-BJP sentiments and threatening the victim, who asserts he was singled out for his support of De…",
    "link": "https://timesofindia.indiatimes.com/city/patna/probe-ordered-into-alleged-police-assault/articleshow/126337944.cms",
    "timestamp": "2026-01-04T17:49:56Z"
  },
  {
    "title": "$2.75M for Jesus: Trump auctions live-painted portrait",
    "description": "The live-painted portrait sold for $2.75 million at Mar‑a‑Lago, again blending art, faith and political theater",
    "link": "https://www.salon.com/2026/01/04/2-75m-for-jesus-trump-auctions-live-painted-portrait/",
    "timestamp": "2026-01-04T17:47:36Z"
  },
  {
    "title": "Far-left Maine Dem urges ‘comrades’ to resist Trump over Venezuela and ‘retake our country’",
    "description": "Some of the Maine candidate's backers showed up to the event with signs such as \"ICE Out of Maine Now,\" which were seemingly mismatched for his speech to address Maduro's ouster.",
    "link": "https://nypost.com/2026/01/04/us-news/graham-platner-urges-comrades-to-resist-trump-on-venezuela/",
    "timestamp": "2026-01-04T17:47:10Z"
  },
  {
    "title": "Rubio explains how U.S. might 'run' Venezuela after Maduros' ouster",
    "description": "President Donald Trump on Saturday said the U.S. will \"run\" Venezuela until a new leader is determined.",
    "link": "https://www.cnbc.com/2026/01/04/rubio-explains-how-us-might-run-venezuela-after-maduros-ouster-.html",
    "timestamp": "2026-01-04T17:45:50Z"
  },
  {
    "title": "Trump: Delcy Rodríguez Might Be Next (Michael Scherer/The Atlantic)",
    "description": "Michael Scherer / The Atlantic:\nTrump: Delcy Rodríguez Might Be Next  —  The president told The Atlantic that the interim Venezuelan president will meet a fate worse than Maduro's unless she complies with U.S. wishes.  —  In a telephone interview this morning…",
    "link": "https://www.memeorandum.com/260104/p32",
    "timestamp": "2026-01-04T17:45:00Z"
  },
  {
    "title": "Rubio says the U.S. doesn’t need Venezuelan oil but seeks to deny adversaries control over it—and doesn’t rule out occupying the country",
    "description": "\"What we're not going to allow is for the oil industry in Venezuela to be controlled by adversaries of the United States.\"",
    "link": "https://fortune.com/2026/01/04/marco-rubio-venezuelan-oil-us-adversaries-control-trump-occupation-troops/",
    "timestamp": "2026-01-04T17:44:49Z"
  },
  {
    "title": "US says ready to work with new Venezuelan authorities",
    "description": "United States officials confirmed they will work with Venezuela's current leaders following President Nicolas Maduro's capture and transfer to New York for trial. US commandos conducted a raid to seize Maduro and his wife. The streets of Caracas remained calm…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-says-ready-to-work-with-new-venezuelan-authorities/articleshow/126337852.cms",
    "timestamp": "2026-01-04T17:44:06Z"
  },
  {
    "title": "‘Fentanyl Doesn’t Come from Venezuela’: CNN’s Dana Bash Bristles at Jim Jordan’s Defense of Strike",
    "description": "Dana Bash bristled when Rep. Jim Jordan tried to justify the apprehension of Venezuela's illegitimate president as a way of stopping the flow of fentanyl.\nThe post ‘Fentanyl Doesn’t Come from Venezuela’: CNN’s Dana Bash Bristles at Jim Jordan’s Defense of Str…",
    "link": "https://www.mediaite.com/media/news/fentanyl-doesnt-come-from-venezuela-cnns-dana-bash-bristles-at-jim-jordans-defense-of-strike/",
    "timestamp": "2026-01-04T17:42:41Z"
  },
  {
    "title": "US attack on Venezuela gives China diplomatic opening, analysts say",
    "description": "Beijing is expected to use the episode to challenge US claims of a rules-based international order and reinforce its positions on Taiwan and the South China Sea.",
    "link": "https://www.thehindubusinessline.com/news/world/us-attack-on-venezuela-gives-china-diplomatic-opening-analysts-say/article70471855.ece",
    "timestamp": "2026-01-04T17:41:55Z"
  },
  {
    "title": "The Labour apologists for Maduro trying to turn Starmer against the US",
    "description": "When he entered No 10, Sir Keir Starmer staked his reputation on upholding international law. That commitment is now being put to the test after Britain’s closest ally stormed into a sovereign country and seized its leader, leaving the Prime Minister firmly b…",
    "link": "https://freerepublic.com/focus/f-news/4360379/posts",
    "timestamp": "2026-01-04T17:41:06Z"
  },
  {
    "title": "Maduro arrives in New York to face charges after U.S. operation questioned by legal experts",
    "description": "Deposed Venezuelan leader Nicolás Maduro arrived in the United States to face criminal charges after being captured in an audacious nighttime military operation that President Donald Trump said would set the U.S. up to \"run\" the South American country and tap…",
    "link": "https://www.pbs.org/newshour/world/maduro-arrives-in-new-york-to-face-charges-after-u-s-operation-questioned-by-legal-experts",
    "timestamp": "2026-01-04T17:40:33Z"
  }
]