[
  {
    "title": "Trump Endorses Julia Letlow Over Bill Cassidy",
    "description": "No matter how much Cassidy prostituted himself by voting for all of Trump's ridiculous cabinet nominees, Trump could not forget that Cassidy voted to convict Trump in his impeachment trial. Of the seven Republicans who did, Bill Cassidy and Susan Collins are …",
    "link": "https://crooksandliars.com/2026/01/trump-endorses-julia-letlow-over-bill",
    "timestamp": "2026-01-18T20:35:48Z"
  },
  {
    "title": "Hotel Kicks Out ICE Agents As Threats From Left-Wing Mobs Grow",
    "description": "The St. Paul Downtown DoubleTree by Hilton canceled the rooms of ICE agents, citing concerns over protests in Minneapolis following the shooting of Renee Good.",
    "link": "https://dailycaller.com/2026/01/18/hilton-doubletree-hotel-kicks-out-immigration-customs-enforcement-agents-left-wing-mob-threats-minneapolis/",
    "timestamp": "2026-01-18T20:35:07Z"
  },
  {
    "title": "WTH? “It’s About Love,” Minneapolis Mayor Jacob Frey Says of Violent Anti-ICE Riots While he Defends Telling ICE to “Get the F*ck Out of Minneapolis” – “I Don’t Regret it at All” (VIDEO)",
    "description": "Minneapolis Mayor Jacob Frey claimed that the violent insurrection in Minneapolis is “about love” and ironically defended his hatred for ICE agents during a Sunday appearance on ABC’s This Week.  Looking “stoned to the bone,” Frey went on a hippie tirade abou…",
    "link": "https://www.thegatewaypundit.com/2026/01/video-its-about-love-minneapolis-mayor-jacob-frey/",
    "timestamp": "2026-01-18T20:30:10Z"
  },
  {
    "title": "Bruce Springsteen Slams ICE at New Jersey Benefit Show",
    "description": "Bruce Springsteen delivered a pointed message to ICE during a surprise appearance at the 2026 Light of Day Winterfest benefit show in New Jersey.",
    "link": "http://www.billboard.com/music/music-news/bruce-springsteen-ice-minneapolisbenefitshow-new-jersey-1236157356/",
    "timestamp": "2026-01-18T20:30:03Z"
  },
  {
    "title": "DEMOCRATS IN FULL PANIC MODE!",
    "description": " DEMOCRATS IN FULL PANIC MODE! New DEVASTATING poll drops: Americans TRUST Republicans MORE than Dems on: • Economy & Inflation: +6 points • Tariffs: +2 points • Immigration: +11 points • Border Security: +28 POINTS",
    "link": "https://freerepublic.com/focus/f-bloggers/4362811/posts",
    "timestamp": "2026-01-18T20:27:11Z"
  },
  {
    "title": "Army readies Minnesota deployment",
    "description": "The Pentagon has ordered about 1,500 active-duty soldiers to be ready in case of a possible deployment to Minnesota, where federal authorities have been conducting a massive immigration enforcement operation, two defense officials said Sunday.",
    "link": "https://www.bostonherald.com/2026/01/18/army-readies-minnesota-deployment/",
    "timestamp": "2026-01-18T20:27:06Z"
  },
  {
    "title": "Trump's voice in a new Fannie Mae ad is generated by artificial intelligence, with his permission",
    "description": "What sounds like President Donald Trump narrating a new Fannie Mae ad actually is an AI-cloned voice reading text, according to a disclaimer at the end of the video. The ad comes as the Trump administration is making a big push to make housing affordable and …",
    "link": "https://apnews.com/article/trump-voice-ai-housing-fannie-ad-davos-7a792aed20c56bcc3f7b53733ec331ad",
    "timestamp": "2026-01-18T20:26:07Z"
  },
  {
    "title": "Trump met with stunned silence as he mocks health of cancer victim Joe Biden - NewsBreak",
    "description": "Donald Trump has once again taken the opportunity to mock his predecessor Joe Biden by embarking on a mock coughing fit",
    "link": "https://www.newsbreak.com/share/4441595748947-trump-met-with-stunned-silence-as-he-mocks-health-of-cancer-victim-joe-biden?s=a2&amp;share_destination_id=MTA5Njg4OTM2LTE3Njg3Njc3Nzg2NTg%3D&amp;pd=07QF6O8l&amp;hl=en_US&amp;send_time=1768767778&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.2.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-18T20:23:26Z"
  },
  {
    "title": "1st LD Writethru: EU ready to defend itself against any coercion: European Council President",
    "description": "BRUSSELS, Jan. 18 (Xinhua) -- European Council President Antonio Costa said Sunday on X that the European Union (EU) is \"ready to defend itself against any form of coercion\" in response to U.S. President Donald Trump's tariff threats over Greenland. Read full…",
    "link": "https://www.thestar.com.my/news/world/2026/01/19/1st-ld-writethru-eu-ready-to-defend-itself-against-any-coercion-european-council-president",
    "timestamp": "2026-01-18T20:23:00Z"
  },
  {
    "title": "Live: Wall Street flat, ASX on edge ahead of tariff threat fallout",
    "description": "The ASX is on edge after a renewed escalation on trade tensions between the US and Europe and ahead of key Chinese data. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2026-01-19/asx-markets-business-news-live-updates/106242752",
    "timestamp": "2026-01-18T20:22:55Z"
  },
  {
    "title": "Europeans reeling as Trump imposes tariffs on 8 countries over Greenland dispute (Associated Press)",
    "description": "Associated Press:\nEuropeans reeling as Trump imposes tariffs on 8 countries over Greenland dispute  —  The eight European countries targeted by U.S. President Donald Trump for a 10% tariff for opposing American control of Greenland blasted the move Sunday, wa…",
    "link": "https://www.memeorandum.com/260118/p59",
    "timestamp": "2026-01-18T20:20:00Z"
  },
  {
    "title": "Trump’s new tariffs on NATO allies cause crack in GOP",
    "description": "The US president has imposed 10% levies on imports from key allies after they sent troops to Greenland amid his push to annex the island Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631119-trumps-tariffs-nato-allies-gop/",
    "timestamp": "2026-01-18T20:17:20Z"
  },
  {
    "title": "EU mulls responding to Trump by reviving €93 billion tariff move",
    "description": "Last year, the EU had approved retaliatory tariffs on €93 billion of US products but suspended their implementation after the two sides reached a trade pact.",
    "link": "https://fortune.com/2026/01/18/eu-retaliation-trump-tariffs-greenland-nato-troops-emmanuel-macron-aci/",
    "timestamp": "2026-01-18T20:17:03Z"
  },
  {
    "title": "Analysis | Beneath the bombast, Trump's cease-fire plan in Gaza is on the rocks",
    "description": "If neither Hamas nor Netanyahu want the Gaza cease-fire, why would grand announcements and vague plans, against the backdrop of the immense geopolitical chaos wrought by Trump, change anything on the ground?",
    "link": "https://www.haaretz.com/israel-news/2026-01-18/ty-article-magazine/.premium/beneath-the-bombast-trumps-cease-fire-plan-in-gaza-is-on-the-rocks/0000019b-d258-db88-a7df-d27c8fc80000",
    "timestamp": "2026-01-18T20:16:41Z"
  },
  {
    "title": "The Roundhouse Report: Trump calls New Mexico elections 'corrupt'",
    "description": "A new candidate for lieutenant governor, House Democrats outline session priorities and more New Mexico political news.",
    "link": "https://www.santafenewmexican.com/news/roundhouse_report/the-roundhouse-report-trump-calls-new-mexico-elections-corrupt/article_9e5d624e-e148-488d-9216-a494fa1c7ef9.html",
    "timestamp": "2026-01-18T20:15:12Z"
  },
  {
    "title": "'Planning a lingerie show?': Trump's $1M Victoria's Secret investment questioned ahead of Lex Wesner's testimony",
    "description": "Donald Trump recently invested up to $1 million in Victoria's Secret corporate bonds, sparking online debate. The move coincides with former CEO Les Wexner's subpoena regarding his ties to Jeffrey Epstein. While Trump denies financial links to Wexner or the b…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/planning-a-lingerie-show-trumps-1m-victorias-secret-investment-questioned-ahead-of-lex-wesners-testimony/articleshow/126661351.cms",
    "timestamp": "2026-01-18T20:14:05Z"
  },
  {
    "title": "Keir Starmer must stand up to Donald Trump",
    "description": "Donald Trump’s attempt to bully his Nato allies into handing over Greenland by imposing tariffs is, even by his standards, a step too far. The President is used to getting what he wants — to use his own words, “the soft way or the hard way”. And with one eye …",
    "link": "https://freerepublic.com/focus/f-bloggers/4362810/posts",
    "timestamp": "2026-01-18T20:14:00Z"
  },
  {
    "title": "Nobel Doubles Down on No-Sharing Peace Prize Stance After Machado Gift to Trump: ‘Not Even Symbolically’",
    "description": "\"A prize can therefore not ... be passed on or further distributed,\" the organization insists\nThe post Nobel Doubles Down on No-Sharing Peace Prize Stance After Machado Gift to Trump: ‘Not Even Symbolically’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/nobel-foundation-peace-prize-machado-gift-trump/",
    "timestamp": "2026-01-18T20:13:20Z"
  },
  {
    "title": "Top Trump Official Says FBI Won’t Investigate Killing by ICE Agent",
    "description": "In an interview on Fox News Sunday, US Deputy Attorney General Todd Blanche told Shannon Bream that the Federal Bureau of Investigation is not, nor are they planning to, investigate Jonathan Ross—the Immigration and Customs Enforcement agent who shot and kill…",
    "link": "https://www.motherjones.com/politics/2026/01/fbi-ice-jonathan-ross-renee-good-todd-blanche/",
    "timestamp": "2026-01-18T20:12:14Z"
  },
  {
    "title": "Exclusive -- Terry Schilling: ACLU Had ‘Total Garbage Argument’ in Trans Athletes SCOTUS Case, ‘We’re Going to Win’",
    "description": "President of the American Principles Project (APP) Terry Schilling is predicting a Supreme Court victory after the court heard two cases this week about state laws that ban males, including transgender-identifying males, from playing on female sports teams\nTh…",
    "link": "https://www.breitbart.com/politics/2026/01/18/exclusive-terry-schilling-aclu-had-total-garbage-argument-in-trans-athletes-scotus-case-were-going-to-win/",
    "timestamp": "2026-01-18T20:10:35Z"
  },
  {
    "title": "U.S.-based activist agency reports at least 3,766 deaths from Iran protests",
    "description": "A U.S.-based activist agency said Sunday it has verified at least 3,766 deaths during a wave of protests that swept Iran and led to a bloody crackdown, and fears the number could be significantly higher.",
    "link": "https://www.pbs.org/newshour/world/u-s-based-activist-agency-reports-at-least-3766-deaths-from-iran-protests",
    "timestamp": "2026-01-18T20:06:30Z"
  },
  {
    "title": "Pitfalls and promises for Gaza: An ambitious and controversial start",
    "description": "The two-year war in Gaza between Israel and Hamas eased with a ceasefire three months ago, but there has been neither peace nor reconstruction. Phase 2 promises progress, but the peace process itself is becoming increasingly controversial.",
    "link": "https://www.cbc.ca/news/world/gaza-ceasefire-phase-2-board-of-peace-9.7050525",
    "timestamp": "2026-01-18T20:06:05Z"
  },
  {
    "title": "Many women and doctors dismiss Trump’s Tylenol claim as more research suggests no autism link",
    "description": "Experts stress that autism has many potential causes—including genetics, advanced parental age, and prenatal exposure to air pollution or certain pesticides—and that the science linking it to acetaminophen remains far",
    "link": "https://www.wxow.com/news/health/many-women-and-doctors-dismiss-trump-s-tylenol-claim-as-more-research-suggests-no-autism/article_384ddb60-3559-577e-bc50-50a61df09878.html",
    "timestamp": "2026-01-18T20:05:54Z"
  },
  {
    "title": "Fraud scandal and ICE unrest scramble 2026 races in blue-leaning Minnesota",
    "description": "Just days into 2026, Minnesota’s Democratic Gov. Tim Walz announced he would not run for a third term, citing his need to focus on a growing welfare fraud scandal — a surprise announcement that sent shock waves through the state. Forty-eight hours later, a 37…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362808/posts",
    "timestamp": "2026-01-18T20:05:31Z"
  },
  {
    "title": "‘Trying To Play Catch Up’: Scott Bessent Dismantles Kristen Welker’s ‘False Choice’ Between NATO, Greenland",
    "description": "Scott Bessent dismissed Kristen Welker's \"false choice\" framing that the U.S. must decide between NATO and Greenland during a Sunday \"Meet the Press\" interview.",
    "link": "https://dailycaller.com/2026/01/18/europe-play-catch-up-scott-bessent-dismantles-kristen-welker-donald-trump-false-choice-nato-greenland-meet-press/",
    "timestamp": "2026-01-18T20:05:20Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-18-01-26-6930943-Jan2026/",
    "timestamp": "2026-01-18T20:00:57Z"
  },
  {
    "title": "Wife of former American detainee released after more than a year in Venezuelan prison",
    "description": "The wife of an American citizen freed from Venezuelan prison after year-long detention on alleged espionage charges, reunites with husband in emotional call.",
    "link": "https://www.foxnews.com/politics/wife-former-american-detainee-released-more-year-venezuelan-prison",
    "timestamp": "2026-01-18T20:00:46Z"
  },
  {
    "title": "Iran considers 'gradually' restoring internet after shutdown",
    "description": "The internet blackout was used to mask a violent crackdown on protestors, rights groups say",
    "link": "https://timesofmalta.com/article/iran-considers-gradually-restoring-internet-shutdown.1122701",
    "timestamp": "2026-01-18T20:00:45Z"
  },
  {
    "title": "Sunday shows expose cracks in Trump’s Greenland strategy",
    "description": "Bipartisan lawmakers acknowledged the diplomatic and constitutional risks of Trump's empire-building approach",
    "link": "https://www.salon.com/2026/01/18/sunday-shows-expose-cracks-in-trumps-greenland-strategy/",
    "timestamp": "2026-01-18T20:00:43Z"
  },
  {
    "title": "Stellan Skarsgård rips Trump’s ‘absurd’ Greenland threats: ‘It’s a little man who got megalomania’",
    "description": "Trump threatened to impose tariffs on European countries that oppose his plans to annex Greenland",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/stellan-skarsgard-trump-greenland-b2902826.html",
    "timestamp": "2026-01-18T20:00:13Z"
  },
  {
    "title": "No Compromise on the Hyde Amendment",
    "description": "Last year we went through the longest government shutdown in history.   The point of contention was the extension of what were supposed to be temporary... Read More\nThe post No Compromise on the Hyde Amendment  appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/18/no-compromise-on-the-hyde-amendment/",
    "timestamp": "2026-01-18T20:00:00Z"
  },
  {
    "title": "Good Trouble",
    "description": "Robert Reich is speaking for me again, talking about writing more in sorrow than in anger.  I am back in my sorrow phase, with tears streaming down my face as I think about what this country has become.  Senile Satan, indeed.  (all hail Betty Cracker and her …",
    "link": "https://balloon-juice.com/2026/01/18/good-trouble-2/",
    "timestamp": "2026-01-18T19:55:00Z"
  },
  {
    "title": "Army puts 1,500 soldiers on standby for possible Minnesota deployment",
    "description": "The Pentagon has ordered about 1,500 active-duty soldiers to be ready in case of a possible deployment to Minnesota, two defense officials said Sunday.",
    "link": "https://www.pbs.org/newshour/nation/army-puts-1500-soldiers-on-standby-for-possible-minnesota-deployment",
    "timestamp": "2026-01-18T19:51:31Z"
  },
  {
    "title": "1st LD Writethru: EU considering hitting U.S. with 93 bln euro worth of tariffs: media",
    "description": "BRUSSELS, Jan. 18 (Xinhua) -- The European Union is considering hitting Washington with 93 billion euros (107.68 billion U.S. dollars) worth of tariffs or restricting American companies from the bloc's market, in response to U.S. President Donald Trump's tari…",
    "link": "https://www.thestar.com.my/news/world/2026/01/19/1st-ld-writethru-eu-considering-hitting-us-with-93-bln-euro-worth-of-tariffs-media",
    "timestamp": "2026-01-18T19:47:00Z"
  },
  {
    "title": "Pentagon could deploy troops to Minnesota protests, US officials say",
    "description": "The possible deployment comes after US President Donald Trump threatened to invoke the Insurrection Act to quell anti-ICE protests in the state.",
    "link": "https://www.abc.net.au/news/2026-01-19/pentagon-readies-troops-for-minnesota-deployment/106243210",
    "timestamp": "2026-01-18T19:43:11Z"
  },
  {
    "title": "Trump Announces Executive Order to Give Army-Navy Football Game an Exclusive 4-Hour Broadcast Window",
    "description": "Donald Trump announced plans to sign an executive order giving the Army-Navy football game an exclusive four-hour broadcast window on its traditional date in mid-December – which, if successful, would benefit David Ellison and Paramount, who own the rights to…",
    "link": "https://www.thewrap.com/media-platforms/tv/trump-executive-order-army-navy-football-game-exclusive-window-paramount/",
    "timestamp": "2026-01-18T19:42:23Z"
  },
  {
    "title": "New Virginia governor rescinds executive order requiring state cooperation with ICE",
    "description": "She reversed the executive order on day one of her governorship, drawing sharp criticism from Republicans who argue the commonwealth will be less safe. Virginia Democratic Gov. Abigail Spanberger reversed a high-profile immigration enforcement policy establis…",
    "link": "https://freerepublic.com/focus/f-chat/4362804/posts",
    "timestamp": "2026-01-18T19:42:07Z"
  },
  {
    "title": "Trump Hits Europe with 10% Tariff Over Greenland Opposition",
    "description": "President Donald Trump announced on Jan. 17 that the United States will impose a 10 percent tariff on eight European countries that have opposed America’s efforts to acquire Greenland—a move the president says is critical for U.S. national security. The tarif…",
    "link": "https://freerepublic.com/focus/f-news/4362803/posts",
    "timestamp": "2026-01-18T19:38:32Z"
  },
  {
    "title": "Karoline Leavitt Caught on Tape Warning CBS 'We'll Sue Your A-- Off' If They Didn't Air Trump Interview in Full",
    "description": "Karoline Leavitt has been caught on tape. The 28-year-old White House press secretary warned CBS Evening News anchor Tony Dokoupil that his 13-minute conversation with President Donald Trump had to air in full, or “we’ll sue your a– off,” per the President. I…",
    "link": "https://www.justjared.com/2026/01/18/karoline-leavitt-caught-on-tape-warning-cbs-well-sue-your-a-if-they-didnt-air-trump-interview-in-full/",
    "timestamp": "2026-01-18T19:37:04Z"
  },
  {
    "title": "American energy dominance is lowering costs and powering the future",
    "description": "'Administration’s focus on unleashing U.S. resources such as oil, natural gas, and critical minerals is so important'",
    "link": "https://www.wnd.com/2026/01/american-energy-dominance-is-lowering-costs-powering-future/",
    "timestamp": "2026-01-18T19:35:44Z"
  },
  {
    "title": "What Is Trump Admin Hiding In Ghislaine Maxwell Prison Records?",
    "description": "It’s the other Epstein files cover up. The Trump administration looks just as desperate to cover up this one as it does to cover up the bulk of the Epstein files.\nAs I have previously written, Jeffrey Epstein’s convicted sex-trafficking accomplice, Ghislaine …",
    "link": "https://crooksandliars.com/2026/01/what-trump-admin-hiding-ghislaine-maxwell",
    "timestamp": "2026-01-18T19:35:20Z"
  },
  {
    "title": "Trump has threatened European countries with higher tariffs if he doesn’t get Greenland. Will it work?",
    "description": "The US remains unliked to take the semi-autonomous Danish territory by force. But there’s still plenty of room for a radical shift in the international order.",
    "link": "https://theconversation.com/trump-has-threatened-european-countries-with-higher-tariffs-if-he-doesnt-get-greenland-will-it-work-273698",
    "timestamp": "2026-01-18T19:33:04Z"
  },
  {
    "title": "Why Trump zeroed in on Greenland and why it matters in 3 maps",
    "description": "Trump's interest in Greenland isn't random – the Arctic island holds military bases and rare earth minerals as ice melts open strategic opportunities.",
    "link": "https://www.foxnews.com/politics/why-trump-zeroed-greenland-why-matters-3-maps",
    "timestamp": "2026-01-18T19:32:10Z"
  },
  {
    "title": "'Apple went in, Nvidia went in, a lot of smart people went in': Did Apple join Nvidia in investing in Intel? Trump seems to suggest so - or was it just a slip of the tongue?",
    "description": "Trump’s cryptic comments fuel rumors of Apple investing in Intel following Nvidia and other high-profile industry players",
    "link": "https://www.techradar.com/pro/apple-went-in-nvidia-went-in-a-lot-of-smart-people-went-in-did-apple-join-nvidia-in-investing-in-intel-trump-seems-to-suggest-so-or-was-it-just-a-slip-of-the-tongue",
    "timestamp": "2026-01-18T19:30:00Z"
  },
  {
    "title": "How Greenland issue became the most serious crisis in transatlantic relations in decades",
    "description": "The prime minister will attempt to negotiate with Trump to see off the tariff threat, but he will not back down over the principle of the sovereignty of Denmark.",
    "link": "https://news.sky.com/story/greenland-issue-the-most-serious-crisis-in-transatlantic-relations-in-decades-where-do-we-go-from-here-13495988",
    "timestamp": "2026-01-18T19:26:00Z"
  },
  {
    "title": "Army readies 1,500 paratroopers specializing in arctic operations for possible deployment to Minnesota if Trump invokes Insurrection Act",
    "description": "Two infantry battalions of the Army’s 11th Airborne Division have been given prepare-to-deploy orders.",
    "link": "https://fortune.com/2026/01/18/army-1500-paratroopers-arctic-operations-deployment-minnesota-trump-insurrection-act/",
    "timestamp": "2026-01-18T19:25:16Z"
  },
  {
    "title": "Team India ready for Davos 2026: Over 80 CEOs and senior ministers to present growth script at WEF to attract long-term capital",
    "description": "Davos is buzzing as India takes center stage, presenting itself as a beacon for investors looking for assurance in a tumultuous global economy. Spearheaded by influential CEOs and key ministers, the Indian delegation is set to drive home the message of the na…",
    "link": "https://economictimes.indiatimes.com/news/india/team-india-ready-for-davos-2026-over-80-ceos-and-senior-ministers-to-present-growth-script-at-wef-to-attract-long-term-capital/articleshow/126660830.cms",
    "timestamp": "2026-01-18T19:22:59Z"
  },
  {
    "title": "Six countries confirm US invitations to Gaza peace board",
    "description": "Trump invites multiple countries including Jordan, Greece, and India to join his \"Board of Peace\" for Gaza reconstruction and governance oversight.",
    "link": "https://www.foxnews.com/world/six-countries-confirm-us-invitations-gaza-peace-board",
    "timestamp": "2026-01-18T19:21:27Z"
  },
  {
    "title": "Trump bluntly admits why Venezuelan action was needed",
    "description": "'It is entirely admirable for him to remind the U.S. and the world of the importance of energy dominance'",
    "link": "https://www.wnd.com/2026/01/trump-bluntly-admits-why-venezuelan-action-was-needed/",
    "timestamp": "2026-01-18T19:20:00Z"
  },
  {
    "title": "The US is turning 250. Here are Trump's plans for 'the biggest party ever'",
    "description": "The United States of America is celebrating the 250th anniversary of its union as a nation and experts say Donald Trump appears to be exploiting the events for his own political gain.",
    "link": "https://www.abc.net.au/news/2026-01-19/donald-trump-united-states-of-america-250-celebrations/106125384",
    "timestamp": "2026-01-18T19:17:46Z"
  },
  {
    "title": "Economist corrects Trump and issues ominous prediction: 'Collapse will follow'",
    "description": "Donald Trump's recent economic claims are \"backwards,\" according to an economist who also unleashed a grim prediction about the future for the United States.Peter Schiff, a financial commentator and radio personality who has been raising alarms about America’…",
    "link": "https://www.rawstory.com/trump-peter-schiff/",
    "timestamp": "2026-01-18T19:17:19Z"
  },
  {
    "title": "Trump Vows to Sign Executive Order Over Army-Navy Game Broadcast",
    "description": "The move would benefit Paramount, led by Trump ally David Ellison, which has exclusive broadcast rights to the Army-Navy game.",
    "link": "https://www.tvinsider.com/1239948/donald-trump-army-navy-game-executive-order-broadcast-window/",
    "timestamp": "2026-01-18T19:13:31Z"
  },
  {
    "title": "‘Yankee, go home’: Greenlanders protest US takeover plans",
    "description": "Demonstrators in Nuuk waved Greenlandic flags, as some people openly cried in the rain",
    "link": "https://www.irishtimes.com/world/2026/01/18/yankee-go-home-greenlanders-protest-us-takeover-plans/",
    "timestamp": "2026-01-18T19:13:20Z"
  },
  {
    "title": "In Cuba, 30 eggs cost a whole month's pension as Trump's manoeuvres bite",
    "description": "Many experts are predicting life in Cuba is about to get even harder.",
    "link": "https://www.abc.net.au/news/2026-01-19/cuba-us-venezuela-trump-economic-crisis-migration/106231474",
    "timestamp": "2026-01-18T19:10:28Z"
  },
  {
    "title": "Hassett Says Trump May Be Right to Keep Him Out as Fed Chair (María Paula Mijares Torres/Bloomberg)",
    "description": "María Paula Mijares Torres / Bloomberg:\nHassett Says Trump May Be Right to Keep Him Out as Fed Chair  —  White House economic adviser Kevin Hassett said President Donald Trump may well keep him in his current job, which would eliminate him from contention for…",
    "link": "https://www.memeorandum.com/260118/p55",
    "timestamp": "2026-01-18T19:10:00Z"
  },
  {
    "title": "CNN poll: Democrats are deeply motivated for the midterms despite having dismal views of party leaders (CNN)",
    "description": "CNN:\nCNN poll: Democrats are deeply motivated for the midterms despite having dismal views of party leaders  —  Congressional news Donald Trump Election polls  —  The Democratic Party has a deeply motivated base and a clear advantage on the generic congressio…",
    "link": "https://www.memeorandum.com/260118/p56",
    "timestamp": "2026-01-18T19:10:00Z"
  },
  {
    "title": "Congress’ power has been diminishing for years, leaving Trump to act with impunity",
    "description": "Trump has spent the first year of his second term pushing the limits of presidential power. He’s the latest in a long line of leaders who try to bypass Congress.",
    "link": "https://theconversation.com/congress-power-has-been-diminishing-for-years-leaving-trump-to-act-with-impunity-273099",
    "timestamp": "2026-01-18T19:07:28Z"
  },
  {
    "title": "Ukrainian drone strikes leave hundreds of thousands without power across Russian-controlled area",
    "description": "Ukrainian drone strikes against Russian energy infrastructure left over 200,000 without power as both sides continue targeting electrical grids.",
    "link": "https://www.foxnews.com/world/ukrainian-drone-strikes-leave-hundreds-thousands-without-power-across-russian-controlled-area",
    "timestamp": "2026-01-18T19:07:16Z"
  },
  {
    "title": "Piers Morgan Reveals He Broke His Femur in Freak Accident: ‘New Year Off to a Cracking Start!’",
    "description": "Piers Morgan seems to be in good spirits despite taking a nasty spill that sent him to the hospital for a broken femur, based on an X post on Sunday\nThe post Piers Morgan Reveals He Broke His Femur in Freak Accident: ‘New Year Off to a Cracking Start!’ first …",
    "link": "https://www.mediaite.com/media/piers-morgan-reveals-he-broke-his-femur-in-freak-accident-new-year-off-to-a-cracking-start/",
    "timestamp": "2026-01-18T19:04:35Z"
  },
  {
    "title": "BlackRock’s Rick Rieder bid for Fed chair is gaining traction",
    "description": "Rieder, BlackRock’s chief investment officer of global fixed income, is viewed as potentially easier to confirm.",
    "link": "https://fortune.com/2026/01/18/blackrock-rick-rieder-bid-fed-chair-trump-jerome-powell-hassett/",
    "timestamp": "2026-01-18T19:02:46Z"
  },
  {
    "title": "These familiar steps show how Trump is walking us into autocracy",
    "description": "By Konstantin Zhukov, Assistant Professor of Economics, Indiana University; Institute for Humane Studies. The FBI search of a Washington Post reporter’s home on Jan. 14, 2026, was a rare and intimidating move by an administration focused on repressing critici…",
    "link": "https://www.rawstory.com/trump-authoritarian-2674900029/",
    "timestamp": "2026-01-18T19:01:55Z"
  },
  {
    "title": "Trump wants nations to pay $1 billion for permanent Board of Peace seats",
    "description": "The Trump administration wants nations to pay $1 billion to remain on his Gaza peace board, reports show.",
    "link": "https://www.cnbc.com/2026/01/18/trump-board-of-peace.html",
    "timestamp": "2026-01-18T19:01:42Z"
  },
  {
    "title": "Trump pardon of former Puerto Rico governor failed to include a relevant criminal case (NBC News)",
    "description": "NBC News:\nTrump pardon of former Puerto Rico governor failed to include a relevant criminal case  —  The White House said that an additional document pardoning Wanda Vázquez Garced will be signed out of an abundance of caution.  —  WASHINGTON — President Dona…",
    "link": "https://www.memeorandum.com/260118/p53",
    "timestamp": "2026-01-18T19:00:01Z"
  },
  {
    "title": "16 rumors about NATO that we've examined",
    "description": "As Trump calls for a U.S. takeover of Greenland, NATO's future hangs in the balance. Here are 15 claims about the security alliance.",
    "link": "https://www.snopes.com/collections/nato-rumors/",
    "timestamp": "2026-01-18T19:00:00Z"
  },
  {
    "title": "Will Trump Create an American Comeback After Biden’s Dismal Economy?",
    "description": "After a four-year economic bacchanalia, America was left with a cost-of-living crisis. Runaway government spending and overregulation pushed up prices for many essentials at a... Read More\nThe post Will Trump Create an American Comeback After Biden’s Dismal E…",
    "link": "https://www.dailysignal.com/2026/01/18/will-trump-create-an-american-comeback-after-bidens-dismal-economy/",
    "timestamp": "2026-01-18T19:00:00Z"
  },
  {
    "title": "Army puts 1,500 soldiers on standby for possible Minnesota deployment, AP sources say",
    "description": "By KONSTANTIN TOROPIN WASHINGTON (AP) — The Pentagon has ordered about 1,500 active-duty soldiers to be ready in case of a possible deployment to Minnesota, where federal authorities have been conducting a massive immigration enforcement operation, two defens…",
    "link": "https://www.denverpost.com/2026/01/18/army-puts-1500-soldiers-on-standby-for-possible-minnesota-deployment-ap-sources-say/",
    "timestamp": "2026-01-18T18:59:21Z"
  },
  {
    "title": "Trump Planning Executive Order to Block Postseason Football from Interfering with Army vs. Navy Game",
    "description": "Trump is set to sign an order banning the broadcast of any other college football game during the Army-Navy game.\nThe post Trump Planning Executive Order to Block Postseason Football from Interfering with Army vs. Navy Game appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/01/18/trump-planning-executive-order-block-postseason-football-interfering-army-navy-game/",
    "timestamp": "2026-01-18T18:56:29Z"
  },
  {
    "title": "US needs Greenland because of European ‘weakness,’ Bessent says",
    "description": "By Nicholas P. BrownNEW YORK, Jan 18 (Reuters) - European “weakness” necessitates U.S. control of Greenland for global stability, U.S. Treasury Secretary Scott Bessent sa… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/18/us-needs-greenland-because-of-european-weakness-bessent-says",
    "timestamp": "2026-01-18T18:55:19Z"
  },
  {
    "title": "Republicans and Democrats are trying to contain Trump’s Greenland aggression. Will it be enough?",
    "description": "Republican lawmakers are scrambling to contain President Donald Trump’s threats of taking possession of Greenland, with some showing the most strident opposition to almost anything the Trump administration has done since taking office.",
    "link": "https://www.denverpost.com/2026/01/18/trump-greenland-republicans-democrats/",
    "timestamp": "2026-01-18T18:54:35Z"
  },
  {
    "title": "What California audits show as Trump moves in on fraud probe",
    "description": "Already 10 federally funded programs in the state confirmed to have failed to follow rules",
    "link": "https://www.wnd.com/2026/01/what-california-audits-show-as-trump-moves-fraud/",
    "timestamp": "2026-01-18T18:53:35Z"
  },
  {
    "title": "‘He Keeps Rattling the Cage!’ Rand Paul Trashes Trump’s Greenland Threats",
    "description": "Sen. Rand Paul (R-KY) assured NBC's Kristen Welker that congressional Republicans do not support President Donald Trump's threats to take over Greenland.\nThe post ‘He Keeps Rattling the Cage!’ Rand Paul Trashes Trump’s Greenland Threats first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/he-keeps-rattling-the-cage-rand-paul-trashes-trumps-greenland-threats/",
    "timestamp": "2026-01-18T18:53:33Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent says Trump's Greenland push is about avoiding a 'hot war'",
    "description": "Treasury Secretary Scott Bessent said US annexation of Greenland is a national security strategy meant to avoid a future armed conflict.",
    "link": "https://www.businessinsider.com/greenland-scott-bessent-treasury-secretary-tariffs-denmark-european-union-2026-1",
    "timestamp": "2026-01-18T18:52:53Z"
  },
  {
    "title": "ABC’s Jon Karl Confronts Mayor Frey On Telling ICE to ‘Get the F*ck Out’: ‘Doesn’t Sound Like Turning the Temperature Down’",
    "description": "ABC's Jon Karl confronted Minneapolis Mayor Jacob Frey (D) about telling ICE to \"get the f*ck out\" of his city following the shooting death of Renee Good\nThe post ABC’s Jon Karl Confronts Mayor Frey On Telling ICE to ‘Get the F*ck Out’: ‘Doesn’t Sound Like Tu…",
    "link": "https://www.mediaite.com/politics/abcs-jon-karl-confronts-mayor-frey-on-telling-ice-to-get-the-fck-out-doesnt-sound-like-turning-the-temperature-down/",
    "timestamp": "2026-01-18T18:49:01Z"
  },
  {
    "title": "From Green Day to Bad Bunny — meet the stars set to take the stage at Super Bowl 2026",
    "description": "Super Bowl LX will take place Sunday, February 8, in California",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-super-bowl-2026-green-day-who-when-b2902788.html",
    "timestamp": "2026-01-18T18:47:54Z"
  },
  {
    "title": "'SNL' Roasts Trump's Hand-Me-Down Nobel Prize In Chaotic Cabinet Spoof",
    "description": "There was no shortage of news to cover during the first cold open of 2026.",
    "link": "https://www.huffpost.com/entry/trump-nobel-prize-snl-cold-open_n_696cf0aae4b0e4bac192cfc0",
    "timestamp": "2026-01-18T18:45:38Z"
  },
  {
    "title": "The biggest challenge in Venezuela? Forget the oil, it's stocking the fridge",
    "description": "Venezuelans are struggling with soaring prices and a deepening economic crisis following the U.S. military raid that removed Nicolás Maduro.  With the bolivar rapidly devaluing and the dollar's unofficial rate spiking, basic groceries are becoming unaffordabl…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-biggest-challenge-in-venezuela-forget-the-oil-its-stocking-the-fridge/articleshow/126660368.cms",
    "timestamp": "2026-01-18T18:44:53Z"
  },
  {
    "title": "'Europe won't be blackmailed,' Danish PM says in wake of Trump Greenland threats",
    "description": "The US president threatens to impose tariffs on countries that oppose his plans to take over the territory.",
    "link": "https://www.bbc.com/news/articles/ceqz0llpnyqo",
    "timestamp": "2026-01-18T18:44:52Z"
  },
  {
    "title": "Trump Awkwardly Snubs RFK Jr.",
    "description": "Trump Awkwardly Snubs RFK Jr.littlethings.com",
    "link": "https://littlethings.com/entertainment/trump-rfk-jr-snub",
    "timestamp": "2026-01-18T18:43:50Z"
  },
  {
    "title": "‘It could work’: Columnist sounds alarm over Trump’s new ‘brazen’ attempt to expand power",
    "description": "The Trump administration submitted a seemingly innocuous memo\r\n to a federal court this month to legally justify its unprecedented attack and takeover of Venezuela, but when analyzed under scrutiny, the memo could be interpreted as an effort to grossly expand…",
    "link": "https://www.rawstory.com/trump-2674906567/",
    "timestamp": "2026-01-18T18:42:55Z"
  },
  {
    "title": "Nobel Foundation weighs in after Machado presents Peace Prize to Trump",
    "description": "The Nobel Foundation firmly rejected Venezuela's Maria Corina Machado's symbolic transfer of her Peace Prize to Trump, stating prizes cannot be passed on.",
    "link": "https://www.foxnews.com/politics/nobel-foundation-weighs-after-machado-presents-peace-prize-trump",
    "timestamp": "2026-01-18T18:39:09Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Jan. 18, 2026",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, DHS Secretary Kristi Noem and Minneapolis Mayor Jacob Frey join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-01-18-2026/",
    "timestamp": "2026-01-18T18:37:47Z"
  },
  {
    "title": "DoubleTree by Hilton Hotel in St Paul Cancels Room Reservations For ICE",
    "description": "NEW: “Due to heightened public safety concerns in St. Paul, we have made the difficult decision to temporarily close our hotel…” Several hotels are now closing in the Twin Cities because of safety concerns—The Double Tree downtown St. Paul sliding this notifi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362792/posts",
    "timestamp": "2026-01-18T18:37:29Z"
  },
  {
    "title": "Piers Morgan Shares Health Update After Gnarly Fall",
    "description": "The British journalist joked that he blames Donald Trump for his hospitalization.",
    "link": "https://www.thedailybeast.com/piers-morgan-shares-health-update-after-gnarly-fall/",
    "timestamp": "2026-01-18T18:32:56Z"
  },
  {
    "title": "Ilhan Omar refers to 'U.S. God---- States' during impassioned remarks about ICE",
    "description": "Rep. Ilhan Omar, D-Minn., was accused of making treasonous remarks when she referred to the U.S. \"god----\" states at a Democratic field hearing on Friday.",
    "link": "https://www.foxnews.com/media/ilhan-omar-refers-u-s-god-states-during-impassioned-remarks-about-ice",
    "timestamp": "2026-01-18T18:30:31Z"
  },
  {
    "title": "Trump administration social posts seen as appealing to far right",
    "description": "The posts renewed criticism about the administration's sometimes cryptic use of imagery popular with the far right and white supremacists.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_e412f777-3ba5-5492-9968-f39ebded109b.html",
    "timestamp": "2026-01-18T18:30:00Z"
  },
  {
    "title": "Trump administration social posts seen as appealing to far right",
    "description": "The posts renewed criticism about the administration's sometimes cryptic use of imagery popular with the far right and white supremacists.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_c7f0b4b0-afca-535a-b7d6-12a0014b06fc.html",
    "timestamp": "2026-01-18T18:30:00Z"
  },
  {
    "title": "Who Is Jake Lang? About the Conservative Influencer",
    "description": "The controversial conservative influencer with ties to the Jan. 6 insurrection is back in the spotlight after a recent rally drew backlash and counterprotests. Learn more about him here.",
    "link": "https://hollywoodlife.com/feature/who-is-jake-lang-5498900/",
    "timestamp": "2026-01-18T18:29:47Z"
  },
  {
    "title": "Watch live: Christopher Luxon faces questions ahead of State of Nation speech as election year kicks off",
    "description": "The Prime Minister is tipped to reveal the election date in the middle of the week.",
    "link": "https://www.nzherald.co.nz/nz/christopher-luxon-faces-questions-ahead-of-state-of-nation-speech-as-election-year-kicks-off/KPWRV2XIIZECNHRQMMVY37GWGM/",
    "timestamp": "2026-01-18T18:23:49Z"
  },
  {
    "title": "Israel PM holds coalition meeting after objecting to Gaza panel",
    "description": "Amid heightened tensions, Israeli Prime Minister Netanyahu reached out to his coalition partners, expressing deep concerns about the US-backed Gaza Executive Board that includes Turkey's foreign minister. Netanyahu's administration labeled the board's formati…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/israel-pm-holds-coalition-meeting-after-objecting-to-gaza-panel/articleshow/126659359.cms",
    "timestamp": "2026-01-18T18:23:26Z"
  }
]