[
  {
    "title": "Trump Endorses Vivek Ramaswamy for Ohio Governor",
    "description": "President Donald Trump endorsed Vivek Ramaswamy in his bid for Ohio governor on Monday, hailing him as a \"truly good person who truly loves our country.\"\nThe post Trump Endorses Vivek Ramaswamy for Ohio Governor appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/24/trump-endorses-vivek-ramaswamy-ohio-governor/",
    "timestamp": "2025-02-25T03:56:27Z"
  },
  {
    "title": "Sam Bankman-Fried Breaks Silence on Twitter, Rants About US Government Layoffs",
    "description": "His Monday evening posts have sparked curiosity among crypto industry insiders who have closely followed him since FTX’s notorious collapse.",
    "link": "https://decrypt.co/307577/sam-bankman-fried-breaks-silence-on-twitter",
    "timestamp": "2025-02-25T03:55:18Z"
  },
  {
    "title": "Trump, Macron strike optimistic tone on Ukraine after talks",
    "description": "Donald Trump and Emmanuel Macron expressed hope that peace could be achieved in Ukraine. But questions remain at what cost, as the French President said that any agreement cannot amount to \"the surrender of Ukraine.\"",
    "link": "https://www.dw.com/en/trump-macron-strike-optimistic-tone-on-ukraine-after-talks/a-71736924",
    "timestamp": "2025-02-25T03:53:00Z"
  },
  {
    "title": "Confusion over Musk demand that federal workers justify their jobs",
    "description": "Employees get conflicting advice over compliance with a Musk-backed order to list their last week's work or face termination.",
    "link": "https://www.bbc.com/news/articles/clyz2xk7d9xo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-25T03:50:56Z"
  },
  {
    "title": "Stupid Musk tricks",
    "description": "One of the enduring right wing myths is that if only the government was run like a business, then everything would be fine. Not just any kind of business but a sole proprietorship where one person has the ability to make all the decisions. They think that if …",
    "link": "https://freethoughtblogs.com/singham/2025/02/24/stupid-musk-tricks/",
    "timestamp": "2025-02-25T03:50:33Z"
  },
  {
    "title": "Metals Decline as Rising China Tensions Spark Risk-Off Sentiment",
    "description": "Metals including aluminum and copper declined as moves by US President Donald Trump to restrict Chinese investments undermined market sentiment, with raw materials losing ground along with local equities.",
    "link": "https://financialpost.com/pmn/business-pmn/metals-decline-as-rising-china-tensions-spark-risk-off-sentiment",
    "timestamp": "2025-02-25T03:48:33Z"
  },
  {
    "title": "John Bolton Says Trump’s Brain Is Cooked: ‘His Mind Is Full of Mush’",
    "description": "John Bolton, a former National Security Advisor in President Donald Trump's first term, said his ex-boss is cognitively damaged.\nThe post John Bolton Says Trump’s Brain Is Cooked: ‘His Mind Is Full of Mush’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/john-bolton-says-trumps-brain-is-cooked-his-mind-is-full-of-mush/",
    "timestamp": "2025-02-25T03:47:21Z"
  },
  {
    "title": "Vladimir Putin says Europe is needed in Ukraine talks, but suggests deal still distant",
    "description": "Russian President Vladimir Putin suggests building trust with the U.S. is crucial before bringing European countries into Ukraine peace talks. While President Trump indicates the conflict might end soon, Putin remains non-committal, emphasizing initial discus…",
    "link": "https://economictimes.indiatimes.com/news/defence/vladimir-putin-says-europe-is-needed-in-ukraine-talks-but-suggests-deal-still-distant/articleshow/118545348.cms",
    "timestamp": "2025-02-25T03:46:58Z"
  },
  {
    "title": "Macron Fact-Checks Trump On Ukraine Aid At Press Conference, He Reacts",
    "description": "During a joint press conference, Emmanuel Macron interrupted Donald Trump when he claimed that Europe was merely loaning Ukraine money and would get it back.",
    "link": "https://www.ndtv.com/world-news/frances-emmanuel-macron-fact-checks-donald-trump-on-ukraine-aid-at-press-conference-he-reacts-7788604",
    "timestamp": "2025-02-25T03:46:55Z"
  },
  {
    "title": "Justin Trudeau trolled by Donald Trump as he and other world leaders show support for Ukraine",
    "description": "OTTAWA—As Prime Minister Justin Trudeau and other world leaders declared solidarity with Ukraine on the third anniversary of Russia’s full-scale invasion, U.S. President Donald Trump doubled down on plans to work with Russia to end the gruelling war and “reco…",
    "link": "https://freerepublic.com/focus/f-news/4300269/posts",
    "timestamp": "2025-02-25T03:43:37Z"
  },
  {
    "title": "‘Your President Is Right’: Macron Says He’ll Boost Defense Spending At Trump’s Request",
    "description": "French President Emmanuel Macron confirmed he plans to increase the country's defense spending as a NATO member, acknowledging that Trump's request was correct.",
    "link": "https://dailycaller.com/2025/02/24/emmanuel-macron-defense-spending-donald-trump-nato/",
    "timestamp": "2025-02-25T03:43:31Z"
  },
  {
    "title": "Crypto trading booms in India's interiors as job growth and incomes disappoint",
    "description": "Thousands of Indians like Ashish Nagose are diving into cryptocurrency trading amid government restrictions on equity derivatives. Their interest has doubled trading volumes on major exchanges to $1.9 billion in Q4 2024. Often driven by a need to supplement t…",
    "link": "https://economictimes.indiatimes.com/news/india/crypto-trading-booms-in-indias-interiors-as-job-growth-and-incomes-disappoint/articleshow/118545275.cms",
    "timestamp": "2025-02-25T03:41:28Z"
  },
  {
    "title": "GOP lawmaker blames town hall outburst on 'outside agitators' who 'wanted to do me harm'",
    "description": "Ever since centibillionaire Elon Musk was tasked by President Donald Trump to identify wasteful spending in federal agencies, the tech entrepreneur and his team have been busy making sweeping cuts throughout multiple federal agencies — including money already…",
    "link": "https://www.rawstory.com/mark-allford/",
    "timestamp": "2025-02-25T03:40:02Z"
  },
  {
    "title": "Carney, Freeland Jockey in Debate Over Who Can Be Toughest Opponent to Trump",
    "description": "Mark Carney, the front-runner in the race to become Canada’s next prime minister, squared off for the first time with his main rival Chrystia Freeland in a French-language TV debate that focused on how to handle President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-freeland-jockey-in-debate-over-who-can-be-toughest-opponent-to-trump",
    "timestamp": "2025-02-25T03:38:23Z"
  },
  {
    "title": "FTT Briefly Spikes After Sam Bankman-Fried Tweets for First Time in 2 Years",
    "description": "Bankman-Fried is currently in the Metropolitan Detention Center, serving a 25-year prison sentence.",
    "link": "https://www.coindesk.com/policy/2025/02/24/ftt-briefly-spikes-after-sam-bankman-fried-tweets-for-first-time-in-2-years",
    "timestamp": "2025-02-25T03:38:05Z"
  },
  {
    "title": "Fmr. Obama ICE Director: Trump 'Created Additional Deterrence', Sent Message 'There's No More Crossing the Border'",
    "description": "On Monday’s broadcast of “NewsNation Now,” John Sandweg, who served as acting ICE Director under President Obama, stated that President Donald Trump’s election “has created additional deterrence at the border and the executive actions he signed sent a message…",
    "link": "https://www.breitbart.com/clips/2025/02/24/fmr-obama-ice-director-trump-created-additional-deterrence-sent-message-theres-no-more-crossing-the-border/",
    "timestamp": "2025-02-25T03:33:44Z"
  },
  {
    "title": "Trump, Musk endorse Vivek Ramaswamy for Ohio governor",
    "description": "President Donald Trump and billionaire Elon Musk on Monday separately endorsed entrepreneur Vivek Ramaswamy in Ohio's 2026 gubernatorial race.",
    "link": "https://www.foxnews.com/politics/trump-musk-endorse-vivek-ramaswamy-ohio-governor",
    "timestamp": "2025-02-25T03:31:06Z"
  },
  {
    "title": "Republican Lawmaker Tells Trump He May Vote Against GOP Budget Bill Over Medicaid Cuts",
    "description": "Rep. Jeff Van Drew said the President “understood” his concerns, which are also shared by a number of other Republicans.",
    "link": "https://time.com/7261307/jeff-van-drew-trump-republican-budget-bill-medicaid-cuts-concerns/",
    "timestamp": "2025-02-25T03:30:00Z"
  },
  {
    "title": "ETMarkets Smart Talk: Gold defies trends by rising alongside dollar: What's driving this anomaly?",
    "description": "Higher interest rates to tame inflation and slowing global economy contributed to some slowdown in our economy. The story of earnings downgrade and hence valuations being expensive were to be followed.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-gold-defies-trends-by-rising-alongside-dollar-whats-driving-this-anomaly/articleshow/118525520.cms",
    "timestamp": "2025-02-25T03:30:00Z"
  },
  {
    "title": "Kentucky flooding and cold weather death toll rises to 22; FEMA to tour damage",
    "description": "Meanwhile, Kentucky, Gov. Andy Beshear said that state officials are still waiting for approval of an expedited major disaster declaration.",
    "link": "https://www.usatoday.com/story/news/nation/2025/02/24/kentucky-flooding-weather-death-toll-fema/80097222007/",
    "timestamp": "2025-02-25T03:29:54Z"
  },
  {
    "title": "DOGE's productivity email deadline for federal workers looms, with differing guidance",
    "description": "\"Subject to the discretion of the President, they will be given another chance,\" Elon Musk said of federal workers who did not send in their emails.",
    "link": "https://www.businessinsider.com/doge-productivity-email-deadline-looms-with-differing-guidance-2025-2",
    "timestamp": "2025-02-25T03:28:09Z"
  },
  {
    "title": "Rudy Giuliani satisfies Fulton County election workers' $148 million defamation case",
    "description": "Former New York City mayor Rudy Giuliani was found liable for defamation in 2023 and ordered to pay two election workers $148 million -- which has now been satisfied.",
    "link": "https://abcnews.go.com/US/rudy-giuliani-pays-148-million-fulton-county-election/story?id=119151328",
    "timestamp": "2025-02-25T03:26:49Z"
  },
  {
    "title": "Trump admin allegedly considering eliminating US Africa Command",
    "description": "United States President Donald Trump's administration is supposedly thinking about eliminating the US Africa Command (AFRICOM) as part of a downsizing of the Pentagon, NBC News reported, citing tw...",
    "link": "https://biztoc.com/x/b27daf5776e5da19",
    "timestamp": "2025-02-25T03:26:31Z"
  },
  {
    "title": "Crypto firm pleads guilty to operating illegally in US",
    "description": "Financial firms, including crypto currency exchanges, that operate in the United States are required to register with federal regulators as a money transmitting business in order to comply with anti-money laundering laws.",
    "link": "https://economictimes.indiatimes.com/tech/technology/crypto-firm-pleads-guilty-to-operating-illegally-in-us/articleshow/118545070.cms",
    "timestamp": "2025-02-25T03:22:00Z"
  },
  {
    "title": "‘Most Atrocious Abuses Of The System’: Democratic Strategist Breaks Down Party’s Failures",
    "description": "Julian Epstein discussed Monday on Fox Business discussed the issues within the Democratic Party, pointing out what he perceives as its systemic failures.",
    "link": "https://dailycaller.com/2025/02/24/julian-epstein-dems-failures/",
    "timestamp": "2025-02-25T03:16:16Z"
  },
  {
    "title": "Scientists find clues on why COVID vaccine causes chronic health problems in some - NewsBreak",
    "description": "Yale researchers have found clues as to why certain people experience adverse health effects after the COVID-19 vaccine, which they have dubbed “post-vacci",
    "link": "https://www.newsbreak.com/share/3827656864106-scientists-find-clues-on-why-covid-vaccine-causes-chronic-health-problems-in-some?_f=app_share&amp;pd=0DzKWhMe&amp;lang=en_US&amp;send_time=1740453186&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v6&amp;s=i2",
    "timestamp": "2025-02-25T03:13:40Z"
  },
  {
    "title": "Trump wants Keystone XL pipeline built 'now'",
    "description": "U.S. President Donald Trump said he wants to revive the Keystone XL oil pipeline, even though its developer has walked away. Read more.",
    "link": "https://financialpost.com/commodities/energy/oil-gas/trump-canada-us-keystone-xl-oil-pipeline-built",
    "timestamp": "2025-02-25T03:12:53Z"
  },
  {
    "title": "Trump Wants Canada-to-US Keystone XL Oil Pipeline Built ‘Now’",
    "description": "US President Donald Trump said Monday he wanted to revive the Keystone XL oil pipeline, even though its developer has already walked away from the project.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-wants-canada-to-us-keystone-xl-oil-pipeline-built-now",
    "timestamp": "2025-02-25T03:12:53Z"
  },
  {
    "title": "Trump calls for company building Keystone XL Pipeline to return to America and ‘get it built’",
    "description": "President Donald Trump is working to restore the Keystone XL Pipeline construction project and asking the company who was initially tasked to build it to come back and resume operations.",
    "link": "https://www.foxnews.com/politics/trump-calls-company-building-keystone-xl-pipeline-return-america-get-built",
    "timestamp": "2025-02-25T03:08:54Z"
  },
  {
    "title": "Judge Denies Associated Press Emergency Motion to Restore White House Access",
    "description": "A federal judge Monday denied an emergency motion from the Associated Press (AP) to restore its access to White House press pool events.\nThe post Judge Denies Associated Press Emergency Motion to Restore White House Access appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/24/judge-denies-associated-press-emergency-motion-restore-white-house-access/",
    "timestamp": "2025-02-25T03:08:22Z"
  },
  {
    "title": "U.S. defense spending demands could transform global security",
    "description": "The level of spending the U.S. is demanding could spark an arms race as adversaries try to match NATO and America's Asian allies.",
    "link": "https://www.japantimes.co.jp/commentary/2025/02/25/japan/defense-spending-demands/",
    "timestamp": "2025-02-25T03:07:00Z"
  },
  {
    "title": "China’s Xi affirms ‘no limits’ partnership with Putin in call on Ukraine war anniversary",
    "description": "Chinese President Xi Jinping affirmed his “no limits” partnership in a phone call with Russian President Vladimir Putin, China’s state media reported, on the third anniversary of Russia’s invasion of Ukraine.",
    "link": "https://www.nbcnews.com/news/world/china-xi-affirms-no-limits-partnership-putin-call-ukraine-rcna193574",
    "timestamp": "2025-02-25T03:05:05Z"
  },
  {
    "title": "Alina Habba Asked on TV What She Got Done Last Week Amid Email Controversy",
    "description": "Alina Habba, counselor to President Donald Trump, was asked on live TV by Fox News host Jesse Watters to share one of her bullet points from last week, a poke at Elon Musk's email request for all federal workers.\nWhy It Matters\nMusk, head of the Department of…",
    "link": "https://biztoc.com/x/b71e3e5b02ee4eca",
    "timestamp": "2025-02-25T03:03:51Z"
  },
  {
    "title": "Alina Habba Asked on TV What She Got Done Last Week Amid Email Controversy",
    "description": "Counselor to President Donald Trump Alina Habba spoke about Elon Musk's email deadline for federal workers.",
    "link": "https://www.newsweek.com/alina-habba-asked-tv-what-she-got-done-last-week-amid-email-controversy-2035650",
    "timestamp": "2025-02-25T03:02:12Z"
  },
  {
    "title": "Sanders Gets Big Crowds On 'Fighting Oligarchy' Midwest Tour",
    "description": "After addressing more than 3,400 Nebraska residents in Omaha Friday evening, U.S. Sen. Bernie Sanders on Saturday made his second stop on his National Tour to Fight Oligarchy—telling Iowa City, Iowa residents that \"Trumpism will not be defeated by politicians…",
    "link": "https://crooksandliars.com/2025/02/sanders-gets-big-crowds-fighting-oligarchy",
    "timestamp": "2025-02-25T03:00:02Z"
  },
  {
    "title": "Trump aid freeze disrupts anti-narcotics program at Mexican ports",
    "description": "U.S. President Donald Trump's sweeping foreign aid freeze has stalled a United Nations program in Mexico aimed at stopping imported fentanyl chemicals from reaching the country's drug cartels, according to eight people familiar with the situation. It’s one of…",
    "link": "https://www.bangkokpost.com/video/world/2967635",
    "timestamp": "2025-02-25T03:00:00Z"
  },
  {
    "title": "Trump Hints At Meeting With Ukraine's Zelensky To Sign Minerals Deal",
    "description": "US President Donald Trump has invited his Ukrainian counterpart Volodymyr Zelensky for a meeting in Washington to sign a deal on critical minerals and suggested that the war between Russia and Ukraine could end &quot;within weeks&quot;.",
    "link": "https://www.ndtv.com/world-news/trump-hints-at-meeting-with-ukraines-zelensky-to-sign-minerals-deal-7788394",
    "timestamp": "2025-02-25T02:59:31Z"
  },
  {
    "title": "Trump's chip tariff threats raise stakes for Taiwan",
    "description": "Taiwan produces more than half of the world's chips and nearly all of the most advanced ones, making the island essential to global supply chains.",
    "link": "https://www.japantimes.co.jp/business/2025/02/25/tech/trump-chip-tariff-taiwan/",
    "timestamp": "2025-02-25T02:59:00Z"
  },
  {
    "title": "Musk offers 'another chance' to respond to productivity email, but warns failure again means termination",
    "description": "Elon Musk said federal employees who fail to respond to his productivity email will be given a another chance, but failure a second time means termination.",
    "link": "https://www.foxnews.com/politics/musk-offers-another-chance-respond-productivity-email-warns-failure-again-means-termination",
    "timestamp": "2025-02-25T02:57:32Z"
  },
  {
    "title": "Asian markets sink as Trump tariffs, China curbs stunt rally",
    "description": "Asian markets sank Tuesday as fears of US President Donald Trump’s trade war returning to the fore and he called for fresh curbs on Chinese investments in strategic sectors including technology. The losses followed a broadly negative day in New York, where mi…",
    "link": "https://www.digitaljournal.com/world/asian-markets-sink-as-trump-tariffs-china-curbs-stunt-rally/article",
    "timestamp": "2025-02-25T02:57:32Z"
  },
  {
    "title": "All Over But the Shouting (Ukraine peace deal)",
    "description": "France’s President Emmanuel Macron is in Washington, and did a joint press conference with President Trump today, on the Russia-Ukraine war. News reports on the press conference fall along predictably partisan lines. This Sky News report is objective, if only…",
    "link": "https://freerepublic.com/focus/f-news/4300261/posts",
    "timestamp": "2025-02-25T02:57:14Z"
  },
  {
    "title": "Tesla hit with Australian class action over ‘phantom braking’",
    "description": "Law firm alleges the electric vehicle company has been dishonest in its marketing, backed out of its promises and has not ensured its products are safe.",
    "link": "https://www.smh.com.au/technology/tesla-hit-with-australian-class-action-over-phantom-braking-20250225-p5lex5.html",
    "timestamp": "2025-02-25T02:56:00Z"
  },
  {
    "title": "Institutional Resistance To Trump Proves The Left’s Disdain For Democracy",
    "description": "Those condemning President Trump’s firings of resistance officials are not attacking the executive — they are attacking our democracy. Donald Trump is not acting like a dictator. And he’s not acting like a king. He’s governing as the executive — the position …",
    "link": "https://freerepublic.com/focus/f-news/4300260/posts",
    "timestamp": "2025-02-25T02:55:13Z"
  },
  {
    "title": "Macron walks tightrope with Trump as he makes Europe's case on Ukraine - BBC.com",
    "description": "Macron walks tightrope with Trump as he makes Europe's case on UkraineBBC.com Trump, Meeting With Macron, Says He Might Visit RussiaThe New York Times French President Macron tells Trump to 'be careful' in the negotiation process to end Russia's war in Ukrain…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176467811",
    "timestamp": "2025-02-25T02:53:08Z"
  },
  {
    "title": "Fake Videos of Trump Kissing Musk's Feet Go Viral After HUD TV Protest",
    "description": "An AI-generated video of President Donald Trump kissing Elon Musk's feet is going viral online after playing unauthorized on TV monitors at the U.S. Department of Housing and Urban Development (HUD) headquarters on Monday.\nNewsweek reached out for comment to …",
    "link": "https://biztoc.com/x/79b980004478e08d",
    "timestamp": "2025-02-25T02:52:50Z"
  },
  {
    "title": "Seth Moulton: 'Trump Is Selling Out Ukraine to Russia'",
    "description": "Representative Seth Moulton (D-MA) said Monday on CNN's \"OutFront\" that President Donald Trump was \"selling out Ukraine to Russia.\"\nThe post Seth Moulton: ‘Trump Is Selling Out Ukraine to Russia’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/02/24/seth-moulton-trump-is-selling-out-ukraine-to-russia/",
    "timestamp": "2025-02-25T02:50:07Z"
  },
  {
    "title": "MSNBC hosts say final goodbyes to Joy Reid following her show’s sudden cancellation: ‘Despair is the autocrat’s tool’",
    "description": "Reid used her final hour on television for the foreseeable future to remind her audience about the importance of remaining vigilant and advocating against \"fascism.\"",
    "link": "https://nypost.com/2025/02/24/media/msnbc-hosts-say-final-goodbyes-to-joy-reid-following-her-shows-sudden-cancellation-despair-is-the-autocrats-tool/",
    "timestamp": "2025-02-25T02:50:05Z"
  },
  {
    "title": "Hong Kong, Asian Stocks Drop as US Pressures China: Markets Wrap",
    "description": "(Bloomberg) -- Asian stocks fell after President Donald Trump’s move to curb Chinese investments and proceed with tariffs on Canada and Mexico prompted...",
    "link": "https://finance.yahoo.com/news/asian-stocks-set-losses-us-223500641.html",
    "timestamp": "2025-02-25T02:50:01Z"
  },
  {
    "title": "After heated town halls, Republicans seek more information — and compassion — from DOGE",
    "description": "After facing blowback from constituents, several House Republicans are returning to Washington this week on a mission to demand both more information and a more considerate approach from the Elon Musk-led effort to downsize the government.",
    "link": "https://www.nbcnews.com/politics/congress/heated-town-halls-republicans-seek-information-compassion-doge-rcna193567",
    "timestamp": "2025-02-25T02:49:52Z"
  },
  {
    "title": "Trump and Paramount seeking mediator, fueling settlement chatter in CBS News lawsuit",
    "description": "Fox News Digital has confirmed that lawyers for President Trump and Paramount are seeking a mediator, signaling that the high-stakes lawsuit will result in a settlement.",
    "link": "https://www.foxnews.com/media/trump-paramount-seeking-mediator-fueling-settlement-chatter-cbs-news-lawsuit",
    "timestamp": "2025-02-25T02:46:39Z"
  },
  {
    "title": "Fake Videos of Trump Kissing Musk's Feet Go Viral After HUD TV Protest",
    "description": "AI-generated images appearing to show Trump kissing Musk's feet appeared on screens at HUD headquarters on Monday.",
    "link": "https://www.newsweek.com/fake-videos-trump-kissing-musks-feet-go-viral-after-hud-tv-protest-2035648",
    "timestamp": "2025-02-25T02:45:53Z"
  },
  {
    "title": "FBI Director Kash Patel sworn in as acting ATF chief, visits DC HQ",
    "description": "Kash Patel will lead both the FBI and Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) after he was charged to head both by President Donald Trump.",
    "link": "https://www.foxnews.com/politics/fbi-director-kash-patel-sworn-acting-atf-chief-visits-dc-hq",
    "timestamp": "2025-02-25T02:45:24Z"
  },
  {
    "title": "Government funding deal 'very close' as negotiations hinge on Trump power struggle (Politico)",
    "description": "Politico:\nGovernment funding deal ‘very close’ as negotiations hinge on Trump power struggle  —  The fight over curbing President Donald Trump's ability to freeze cash is now the make-or-break dispute as leading lawmakers close in on a deal to avert a governm…",
    "link": "https://www.memeorandum.com/250224/p161",
    "timestamp": "2025-02-25T02:45:01Z"
  },
  {
    "title": "Ukraine is just a pawn in a Russian reset",
    "description": "Donald Trump's approach makes U.S. actions more logical, but no less shameful.",
    "link": "https://www.japantimes.co.jp/commentary/2025/02/25/world/ukraine-and-a-russian-reset/",
    "timestamp": "2025-02-25T02:45:00Z"
  },
  {
    "title": "'What is the status?' MAGA rep demands to know why Pam Bondi hasn't kept key Trump promise",
    "description": "Rep. Anna Paulina Luna (R-FL) wants some answers on why President Donald Trump's new attorney general hasn't followed through on one of his major promises yet.Luna, a far-right lawmaker known for her outbursts on the House floor, took to the X platform on Mon…",
    "link": "https://www.rawstory.com/anna-paulina-luna-2671209490/",
    "timestamp": "2025-02-25T02:44:11Z"
  },
  {
    "title": "Asian stocks slide on US-China trade moves",
    "description": "Equities on the Asian markets traded lower on Tuesday as investors reacted to renewed trade uncertainty following US policy changes affecting China.\nUS President Donald Trump moved to restrict Chines...",
    "link": "https://biztoc.com/x/5f4bb5b1cc27e853",
    "timestamp": "2025-02-25T02:42:10Z"
  },
  {
    "title": "Senator Warren Is Investigating Trump-Musk Attacks On American Consumers",
    "description": "Senator Elizabeth Warren is convening a forum to investigate the President Donald Trump-Elon Musk attack on the CFPB.",
    "link": "https://www.forbes.com/sites/mayrarodriguezvalladares/2025/02/24/senator-warren-is-investigating-trump-musk-attacks-on-american-consumers/",
    "timestamp": "2025-02-25T02:40:10Z"
  },
  {
    "title": "How Dan Bongino Went From Infowars to FBI Deputy Director (David Gilbert/Wired)",
    "description": "David Gilbert / Wired:\nHow Dan Bongino Went From Infowars to FBI Deputy Director  —  Dan Bongino rose through the ranks of right-wing media thanks to his unflinching loyalty to Donald Trump and willingness to push baseless conspiracies—including about the FBI…",
    "link": "https://www.memeorandum.com/250224/p160",
    "timestamp": "2025-02-25T02:40:00Z"
  },
  {
    "title": "WSJ: Hezbollah Throwing in the Towel in Southern Lebanon? UPDATE: Hamas Too, Maybe?",
    "description": "Over the weekend, Hezbollah held a long-delayed public memorial service to its former chief terrorist, Hassan Nasrallah. The terror network filled a stadium in Beirut nearly five months after the Israeli Defense Forces killed him in an airstrike, that coming …",
    "link": "https://freerepublic.com/focus/f-news/4300256/posts",
    "timestamp": "2025-02-25T02:37:54Z"
  },
  {
    "title": "Federal workers left in limbo as clock ticks down to Musk’s email deadline",
    "description": "Federal workers spent Monday trying to figure out how – or even whether – to respond to Elon Musk’s weekend email blast telling them to explain their work last week or risk losing their job.",
    "link": "https://www.cnn.com/2025/02/24/politics/email-elon-musk-federal-employees/index.html",
    "timestamp": "2025-02-25T02:35:26Z"
  },
  {
    "title": "Trump says Canada, Mexico tariffs on schedule despite border, fentanyl efforts",
    "description": "WASHINGTON — President Donald Trump said on Monday that tariffs on Canadian and Mexican imports are \"on time and on schedule\" despite efforts by the countries to beef up border security and halt the flow of fentanyl into the U.S. ahead of a March 4 deadline.\n…",
    "link": "https://www.voanews.com/a/trump-says-canada-mexico-tariffs-on-schedule-despite-border-fentanyl-efforts/7986957.html",
    "timestamp": "2025-02-25T02:34:57Z"
  },
  {
    "title": "Exclusive– Alaska Gov. Dunleavy Lauds Trump's Energy Executive Actions as Talks with Burgum, Wright Underway",
    "description": "Gov. Mike Dunleavy (R-AK), who maintains that President Donald Trump has been the best president ever for Alaska, exclusively told Breitbart News he believes the Trump administration is serious about moving quickly to help unleash Alaska's energy potential.\nT…",
    "link": "https://www.breitbart.com/politics/2025/02/24/exclusive-gov-dunleavy-lauds-trumps-energy-executive-actions/",
    "timestamp": "2025-02-25T02:34:51Z"
  },
  {
    "title": "Letters: Future of democracy now rests on the shoulders of leaders in Europe and UK",
    "description": "The events of the past week have been stunning. In seven days, Donald Trump has effectively dissolved the post-World War II Western alliance, reordered the global geopolitical map and initiated a nascent friendship between the US and Russia. All at the expens…",
    "link": "https://www.independent.ie/opinion/letters/letters-future-of-democracy-now-rests-on-the-shoulders-of-leaders-in-europe-and-uk/a1420476741.html",
    "timestamp": "2025-02-25T02:30:00Z"
  },
  {
    "title": "Trump says ceasefire close but leaders hit back, placing demands of peace guarantees on Russia",
    "description": "US president Donald Trump said he is hopeful Russia’s war in Ukraine is nearing an endgame as he met with French president Emmanuel Macron yesterday on the third anniversary of the invasion.",
    "link": "https://www.independent.ie/world-news/europe/trump-says-ceasefire-close-but-leaders-hit-back-placing-demands-of-peace-guarantees-on-russia/a1653116432.html",
    "timestamp": "2025-02-25T02:30:00Z"
  },
  {
    "title": "Patricia Lopez: Arab Americans who took stand against Joe Biden over Gaza now dealing with fact they helped elect Donald Trump",
    "description": "The pro-Palestinian groups that came to be known as the Uncommitted movement have been uncharacteristically quiet since US president Donald Trump won re-election – even as the new president threatens to “take over” Gaza.",
    "link": "https://www.independent.ie/world-news/north-america/patricia-lopez-arab-americans-who-took-stand-against-joe-biden-over-gaza-now-dealing-with-fact-they-helped-elect-donald-trump/a318905755.html",
    "timestamp": "2025-02-25T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: With the US no longer to be counted upon, Europe must act smart if Ukraine’s future is to be protected",
    "description": "The shallowness of the war of words that US president Donald Trump has opened up with Ukraine must not deflect from the actual war, in which bombs and bullets – not tweets and sideswipes – are being lethally used.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-with-the-us-no-longer-to-be-counted-upon-europe-must-act-smart-if-ukraines-future-is-to-be-protected/a1743961976.html",
    "timestamp": "2025-02-25T02:30:00Z"
  },
  {
    "title": "John Downing: It’s hard to find a silver lining in the dark clouds cast by Donald Trump, but here are three",
    "description": "I keep trying to find a semblance of silver lining in some of those dark, Trumpian clouds, though sometimes surrendering to the gloom is inevitable. But the Prince of Chaos, in tearing up 80 years of rules-based global order, does offer at least three inadver…",
    "link": "https://www.independent.ie/opinion/comment/john-downing-its-hard-to-find-a-silver-lining-in-the-dark-clouds-cast-by-donald-trump-but-here-are-three/a38894317.html",
    "timestamp": "2025-02-25T02:30:00Z"
  },
  {
    "title": "Hilarious: Danish Petition Calls for Buying California",
    "description": "Be careful what you wish for. You might get it. Can we please make this happen!! What about Oregon and Washington to Boot?? A package deal for all 3! pic.twitter.com/1CZljIdyaq— Larry Gator (@LarryLarrygator) February 24, 2025In what I hope for their sake i…",
    "link": "https://freerepublic.com/focus/f-chat/4300255/posts",
    "timestamp": "2025-02-25T02:28:52Z"
  },
  {
    "title": "S. Korea’s central bank cuts rate, growth outlook over tariff fears",
    "description": "South Korea’s central bank on Tuesday slashed interest rates and its annual growth forecast as it looks to bolster the economy in the face of US tariffs and the fallout from President Yoon Suk Yeol’s brief declaration of martial law last year. The South Korea…",
    "link": "https://www.digitaljournal.com/world/s-koreas-central-bank-cuts-rate-growth-outlook-over-tariff-fears/article",
    "timestamp": "2025-02-25T02:27:33Z"
  },
  {
    "title": "Brazilian illegal alien charged with rape caught in Massachusetts, handed over to ICE in rare case",
    "description": "Willian Robert Vasconcelos-Dos Santos is charged with rape, and remains in ICE custody.",
    "link": "https://nypost.com/2025/02/24/us-news/brazilian-illegal-alien-charged-with-rape-caught-in-massachusetts-handed-over-to-ice-in-rare-case/",
    "timestamp": "2025-02-25T02:22:23Z"
  },
  {
    "title": "WATCH: Joy Reid Concludes Lackluster Career at MSNBC",
    "description": "Joy Reid wore an MSNBC-branded tracksuit Monday night while hosting the final episode of her show on the failing left-wing network. The defiant performance came after news leaked on Sunday that MSNBC was canceling The ReidOut and firing Reid due to her abysma…",
    "link": "https://freebeacon.com/media/watch-joy-reid-concludes-lackluster-career-at-msnbc/",
    "timestamp": "2025-02-25T02:20:50Z"
  },
  {
    "title": "Trump takes a victory lap on Apple's $500 billion U.S. investment, but one analyst calls it 'completely unrealistic'",
    "description": "Trump takes a victory lap on Apple’s $500 billion U.S. investment, but one analyst calls it ‘completely unrealistic’\nApple CEO Tim Cook (left) and Donald Trump in 2019.\nMANDEL NGAN/AFP via Getty Images",
    "link": "https://biztoc.com/x/0145c2ac8c2e0cbc",
    "timestamp": "2025-02-25T02:20:18Z"
  },
  {
    "title": "Big Tech battle with Europe heats up following U.S. officials' latest move",
    "description": "Even supposed allies have disagreements about the finer points of their alliances, and a long-running disagreement about how American technology companies operate in Europe may be coming to a head this week. \nPresident Donald Trump has made no secret of his i…",
    "link": "https://biztoc.com/x/a04568cbc25be7aa",
    "timestamp": "2025-02-25T02:20:15Z"
  },
  {
    "title": "Right-wing Zionist group Betar wars with ADL after being added to its extremism database",
    "description": "Pro-Israel group Betar US escalates feud with ADL after being added to extremism database, highlighting growing divisions in the Jewish community's approach to fighting antisemitism",
    "link": "https://www.jpost.com/israel-news/article-843617",
    "timestamp": "2025-02-25T02:19:52Z"
  },
  {
    "title": "AI-Generated Clip of Trump Licking Elon Musk’s Toes Runs on a Loop at HUD Offices | Video",
    "description": "The video, of unknown origin, played on several TVs days after Musk's latest mass-firing threat\nThe post AI-Generated Clip of Trump Licking Elon Musk’s Toes Runs on a Loop at HUD Offices | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-licking-elon-musks-toes-ai-generated-hud-video/",
    "timestamp": "2025-02-25T02:19:37Z"
  },
  {
    "title": "In Major Policy Shift, US Sides With Russia In Ukraine Vote At UN",
    "description": "The US in the past has voted for resolutions that favoured Ukraine and condemned Russia.",
    "link": "https://www.ndtv.com/world-news/russia-ukraine-war-in-major-policy-shift-us-sides-with-moscow-over-kyiv-in-vote-at-un-after-donald-trump-slams-zelensky-7788245",
    "timestamp": "2025-02-25T02:18:30Z"
  },
  {
    "title": "Trump calls for revival of Keystone XL Pipeline project axed by Biden",
    "description": "\"The company building the Keystone XL Pipeline that was viciously jettisoned by the incompetent Biden Administration should come back to America, and get it built - NOW!\" Trump wrote on his Truth Social platform, referring to the Canadian company involved in …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-for-revival-of-keystone-xl-pipeline-project-axed-by-biden/articleshow/118543696.cms",
    "timestamp": "2025-02-25T02:16:40Z"
  },
  {
    "title": "Podcaster picked by Trump for FBI deputy",
    "description": "President Donald Trump announced the appointment in a post on his Truth Social platform, praising Bongino as \"a man of incredible love and passion for our country\".",
    "link": "https://www.abc.net.au/news/2025-02-25/dan-bongino-appointed-to-the-fbi-after-kash-patel-/104978390",
    "timestamp": "2025-02-25T02:13:58Z"
  },
  {
    "title": "Trump says U.S. tariffs on Canada will proceed and here's his full statement",
    "description": "U.S. President Donald Trump confirmed today that U.S. tariffs will be proceeding against Canada and they could start as early as next week. \r\nTrump responded to a reporter's question about tariffs during a joint press conference with French President Emmanuel…",
    "link": "https://www.blogto.com/city/2025/02/trump-us-tariffs-canada-will-proceed-statement/",
    "timestamp": "2025-02-25T02:13:12Z"
  },
  {
    "title": "Taiwan economy ministry has received no information about any TSMC investment in Intel, US",
    "description": "TAIPEI : Taiwan's economy minister said on Tuesday his ministry had not received information about an overseas investment application by Taiwanese chipmaker TSMC, when asked about possible investment in Intel and the United States.U.S. media has reported that…",
    "link": "https://www.channelnewsasia.com/business/taiwan-economy-ministry-has-received-no-information-about-any-tsmc-investment-intel-us-4958111",
    "timestamp": "2025-02-25T02:13:12Z"
  },
  {
    "title": "Canadian Banks’ Earnings Clouded by Economic Uncertainty",
    "description": "Canadian banks are set to announce their quarterly earnings this week, and while analysts are optimistic about the results, they note that potential U.S. tariffs may dampen the mood. The Big Six banks — namely, Royal Bank of Canada, Toronto-Dominion Bank, Ban…",
    "link": "https://www.pymnts.com/earnings/2025/canadian-banks-earnings-clouded-by-economic-uncertainty/",
    "timestamp": "2025-02-25T02:12:16Z"
  },
  {
    "title": "Honor Seiki eyes post-Russo-Ukraine war boom as tariffs loom",
    "description": "Since taking office, US President Donald Trump has wielded tariffs aggressively, drawing industry attention. Honor Seiki's General Manager Zheng Jun Chen sees limited immediate impact on the high-end aerospace tooling firm, expecting any fallout to take sever…",
    "link": "https://www.digitimes.com/news/a20250225PD209/donald-trump-honor-production-tongtai-high-end.html",
    "timestamp": "2025-02-25T02:11:48Z"
  },
  {
    "title": "U.S. refuses to blame Russia for Ukraine war, splitting with European allies in U.N. votes",
    "description": "In a dramatic shift in transatlantic relations under President Donald Trump, the United States split with its European allies by refusing to blame Russia for its invasion of Ukraine in votes on three U.N. resolutions Monday seeking an end to the three-year wa…",
    "link": "https://japantoday.com/category/world/the-un-will-vote-to-demand-russia-pull-troops-out-of-ukraine.-but-the-us-wants-a-softer-approach",
    "timestamp": "2025-02-25T02:11:44Z"
  },
  {
    "title": "Report: NSA Confirms Investigation into Employees' 'Secret Sex Chats'",
    "description": "The National Security Agency (NSA) confirmed it is investigating \"secret sex chats\" that several employees have been taking part in during the workday, according to a recent report.\nThe post Report: NSA Confirms Investigation into Employees’ ‘Secret Sex Chats…",
    "link": "https://www.breitbart.com/politics/2025/02/24/report-nsa-confirms-investigation-employees-secret-sex-chats/",
    "timestamp": "2025-02-25T02:10:52Z"
  },
  {
    "title": "Trump's New Deputy F.B.I. Director Has It Out for the 'Scumbag Commie Libs' (Michelle Goldberg/New York Times)",
    "description": "Michelle Goldberg / New York Times:\nTrump's New Deputy F.B.I. Director Has It Out for the ‘Scumbag Commie Libs’  —  When a New York jury found Donald Trump guilty on 34 felony counts last year, the conservative podcaster Dan Bongino made a veiled threat on so…",
    "link": "https://www.memeorandum.com/250224/p157",
    "timestamp": "2025-02-25T02:10:01Z"
  },
  {
    "title": "Trump says Putin treated him with ‘great respect’",
    "description": "US President Donald Trump has said that Russian President Vladimir Putin treated him with “great respect” during their conversation Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613258-trump-putin-great-respect/",
    "timestamp": "2025-02-25T02:09:26Z"
  },
  {
    "title": "Trump’s chip tariff threats raise stakes for Taiwan",
    "description": "US President Donald Trump’s threat of tariffs on semiconductor chips has complicated Taiwan’s bid to remain a global powerhouse in the critical sector and stay onside with key backer Washington, analysts said. Since taking office last month, Trump has warned …",
    "link": "https://www.digitaljournal.com/world/trumps-chip-tariff-threats-raise-stakes-for-taiwan/article",
    "timestamp": "2025-02-25T02:07:32Z"
  },
  {
    "title": "Laura Ingraham Dunks on Laid-Off Federal Employees: ‘Need To Get Real Jobs’",
    "description": "Laura Ingraham denigrated federal workers who have been laid off in recent weeks and said they now \"need to get real jobs.\"\nThe post Laura Ingraham Dunks on Laid-Off Federal Employees: ‘Need To Get Real Jobs’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/laura-ingraham-dunks-on-laid-off-federal-employees-need-to-get-real-jobs/",
    "timestamp": "2025-02-25T02:07:28Z"
  },
  {
    "title": "Eagles have not received White House invitation after Super Bowl win but plan to accept if invited, per report",
    "description": "The Eagles reportedly would go to the White House despite speculation claiming otherwise",
    "link": "https://www.cbssports.com/nfl/news/eagles-have-not-received-white-house-invitation-after-super-bowl-win-but-plan-to-accept-if-invited-per-report/",
    "timestamp": "2025-02-25T02:07:22Z"
  },
  {
    "title": "\"Ignore\": Trump Administration to Agencies On Musk's \"Justify-Your-Job\" Mail",
    "description": "Ahead of the Monday deadline, the Trump administration in the United States is reportedly backing off from Elon Musk&#039;s weekend mandate for all government employees to submit five things they accomplished in the last week or face dismissal.",
    "link": "https://www.ndtv.com/world-news/trump-administration-asks-agencies-to-ignore-elon-musks-justify-your-job-mail-7788204",
    "timestamp": "2025-02-25T02:05:48Z"
  },
  {
    "title": "US sides with Russia in UN resolutions on Ukraine",
    "description": "The UK and France abstain as the UN Security Council passes a text that does not criticise Moscow.",
    "link": "https://www.bbc.com/news/articles/c7435pnle0go",
    "timestamp": "2025-02-25T02:05:10Z"
  },
  {
    "title": "US sides with Russia in UN resolutions on invasion of Ukraine",
    "description": "The UK and France abstain as the UN Security Council passes a text that does not criticise Moscow.",
    "link": "https://www.bbc.co.uk/news/articles/c7435pnle0go",
    "timestamp": "2025-02-25T02:05:10Z"
  },
  {
    "title": "Joy Reid warns MSNBC viewers fascism is 'already here' in her final show at liberal network",
    "description": "Liberal TV host Joy Reid warned about \"fascism\" already in American during her final broadcast on MSNBC after the network canceled her show.",
    "link": "https://www.foxnews.com/media/joy-reid-warns-msnbc-viewers-fascism-already-here-final-show-liberal-network",
    "timestamp": "2025-02-25T02:04:12Z"
  },
  {
    "title": "Trump, Macron display stark differences on Ukraine despite friendly veneer",
    "description": "U.S. President Donald Trump and French President Emmanuel Macron exposed their differing strategies on handling the Ukraine crisis during their talks. While Trump aimed for a swift ceasefire and peace deal, Macron advocated for a more deliberate approach with…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-macron-display-stark-differences-on-ukraine-despite-friendly-veneer/articleshow/118543563.cms",
    "timestamp": "2025-02-25T02:03:15Z"
  },
  {
    "title": "Trump says Canada and Mexico tariffs are 'going forward' with more import taxes to come",
    "description": "Trump says Canada and Mexico tariffs are 'going forward' with more import taxes to comenews4jax.com",
    "link": "https://www.news4jax.com/business/2025/02/24/trump-says-canada-and-mexico-tariffs-are-going-forward-with-more-import-taxes-to-come/",
    "timestamp": "2025-02-25T02:00:40Z"
  },
  {
    "title": "'Aren't you embarrassed?' Dem gives tongue-lashing to GOP colleagues after Trump decision",
    "description": "A Vermont Democratic lawmaker launched a stinging takedown of congressional Republicans on Monday in an impassioned House floor speech where she castigated the majority party while delivering what she called “the cold hard truth” about the Russia-Ukraine war.…",
    "link": "https://www.rawstory.com/becca-balint-2671209436/",
    "timestamp": "2025-02-25T02:00:18Z"
  },
  {
    "title": "Elon Musk renews firing threat after being stymied by federal officials",
    "description": "A federal judge blocked Elon Musk's team from accessing sensitive government data. Unions updated their lawsuit over the legality of Musk's email demanding federal workers justify their jobs. Despite official guidance deeming responses voluntary, some agencie…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-renews-firing-threat-after-being-stymied-by-federal-officials/articleshow/118543538.cms",
    "timestamp": "2025-02-25T02:00:06Z"
  },
  {
    "title": "Philadelphia Eagles Have Not Been Invited To The White House By Trump Despite Reports They Rejected Invite",
    "description": "There are conflicting reports regarding the Eagles’ feelings about the White House. Over the weekend, the US Sun reported that the Eagles would not accept an invitation after winning the Super Bowl. Via The US Sun “A source at the Eagles, who spoke anonymousl…",
    "link": "https://brobible.com/sports/article/philadelphia-eagles-white-house-trump/",
    "timestamp": "2025-02-25T01:57:10Z"
  }
]