[
  {
    "title": "Microsoft Is Torpedoing Xbox With Yet Another Price Hike",
    "description": "It’s blaming today’s ‘macroeconomic environment,’ aka President Donald Trump.",
    "link": "https://gizmodo.com/microsoft-is-torpedoing-xbox-with-yet-another-price-hike-2000661572",
    "timestamp": "2025-09-19T19:54:04Z"
  },
  {
    "title": "Trump to add $100,000 fee for skilled worker visa applicants",
    "description": "The proclamation will reportedly mention \"abuse\" of the programme and will restrict entry unless payment is made.",
    "link": "https://www.bbc.com/news/articles/cm2zk4l8g26o",
    "timestamp": "2025-09-19T19:54:03Z"
  },
  {
    "title": "A TikTok Deal Is 'Approved' But Not Yet Finalized, President Donald Trump Reveals",
    "description": "A TikTok Deal Is 'Approved' But Not Yet Finalized, President Donald Trump Reveals President Trump wrote on Truth Social that he had a \"very productive\" call on Friday with China's leader, Xi Jinping.\nKey Takeaways\nPresident Donald Trump announced on Truth Soc…",
    "link": "https://biztoc.com/x/a4d095e62f14e099",
    "timestamp": "2025-09-19T19:52:44Z"
  },
  {
    "title": "US rolls toward a 'terrible' government shutdown, no exit ramp in sight",
    "description": "As lawmakers dig in, federal employees face mounting uncertainty over pay, operations and the ripple effects of another prolonged funding lapse.",
    "link": "https://www.newsfromthestates.com/article/us-rolls-toward-terrible-government-shutdown-no-exit-ramp-sight",
    "timestamp": "2025-09-19T19:52:00Z"
  },
  {
    "title": "Judge throws out Trump's 'improper' $15bn lawsuit against The New York Times",
    "description": "The judge gave the US President 28 days to refile the lawsuit “in a professional and dignified manner”.",
    "link": "https://www.thejournal.ie/judge-throws-out-trump-lawsuit-new-york-times-6822037-Sep2025/",
    "timestamp": "2025-09-19T19:49:50Z"
  },
  {
    "title": "'May be the last time you ever see me': Actor Rob Reiner makes ominous prediction on CNN",
    "description": "Actor and director Rob Reiner told CNN anchor Brianna Keilar \"this may be the last time you ever see me\" in response to speaking out against President Donald Trump and FCC Chairman Brendan Carr in the aftermath of comedian Jimmy Kimmel's suspension.\"This may …",
    "link": "https://www.rawstory.com/jimmy-kimmel-2674011120/",
    "timestamp": "2025-09-19T19:49:12Z"
  },
  {
    "title": "RIPE FOR INVESTIGATION: Trump Administration Is Right to Probe Potential Funding of Antifa Violence",
    "description": "The Charlie Kirk assassination has underscored the Left’s radicalization, and President Donald Trump is right to respond, in part, by investigating the potential funding sources... Read More\nThe post RIPE FOR INVESTIGATION: Trump Administration Is Right to Pr…",
    "link": "https://www.dailysignal.com/2025/09/19/ripe-for-investigation-trump-administration-is-right-probe-potential-funding-antifa-violence/",
    "timestamp": "2025-09-19T19:49:06Z"
  },
  {
    "title": "TPUSA insider: Erika Kirk is 'absolute force' ready to grow group '10x' after tragedy",
    "description": "Conservative organization Turning Point USA appoints Erika Kirk as CEO and board chair after founder Charlie Kirk's assassination, aiming for major growth.",
    "link": "https://www.foxnews.com/politics/erika-kirk-wants-expand-turning-point-usa-ten-times-larger-insider-reveals",
    "timestamp": "2025-09-19T19:45:25Z"
  },
  {
    "title": "Microsoft Xbox prices to go up big time in October. Check new rates for Series S, X, X 2TB, claims report",
    "description": "Microsoft Xbox prices for all series are reportedly to be increased. This comes after Sony raised prices of its PlayStation 5 consoles in the United States.",
    "link": "https://economictimes.indiatimes.com/news/international/us/microsoft-xbox-prices-to-go-up-big-time-in-october-check-new-rates-for-series-s-x-x-2tb-claims-report/articleshow/124005825.cms",
    "timestamp": "2025-09-19T19:45:24Z"
  },
  {
    "title": "N.C. Congressman Says Kimmel Boot Should Be Business Issue, Defends Free Speech",
    "description": "The FCC should have never gotten involved with the decision to pull \"Jimmy Kimmel Live!\" from ABC, North Carolina U.S. Rep. Pat Harrigan (R) says. TMZ caught up with Harrigan Friday, and while he's not opposed to Jimmy being indefinitely booted…\n Permalink",
    "link": "https://www.tmz.com/2025/09/19/pat-harrigan-fcc-stay-out-of-jimmy-kimmel/",
    "timestamp": "2025-09-19T19:45:14Z"
  },
  {
    "title": "Ex-Dem Strategist Says Party May Have Rioted If Their Own Charlie Kirk Were Assassinated",
    "description": "Dan Turrentine speculated that members of his party might have rioted had a left-wing version of Charlie Kirk been assassinated.",
    "link": "https://dailycaller.com/2025/09/19/ex-dem-strategist-says-party-may-have-rioted-if-their-own-charlie-kirk-were-assassinated/",
    "timestamp": "2025-09-19T19:43:48Z"
  },
  {
    "title": "More than 400 arrests made in Chicago area operation so far, top immigration official says",
    "description": "Immigration and Customs Enforcement officials have arrested over 400 people in the Chicago area as part of an operation that began less than two weeks ago",
    "link": "https://abcnews.go.com/Politics/wireStory/400-arrests-made-chicago-area-operation-top-immigration-125747227",
    "timestamp": "2025-09-19T19:42:22Z"
  },
  {
    "title": "EXCLUSIVE: Attempted Kavanaugh Assassin Identifies As Transgender Woman, Legal Filings Show",
    "description": "The man who attempted to kill Supreme Court Justice Brett Kavanaugh identifies as a transgender woman and was deeply mentally ill and suicidal, according to court documents first obtained by The Daily Wire. The Department of Justice is recommending that the d…",
    "link": "https://freerepublic.com/focus/f-bloggers/4341576/posts",
    "timestamp": "2025-09-19T19:42:13Z"
  },
  {
    "title": "Trump administration asks Supreme Court to strip legal protections from Venezuelan migrants",
    "description": "The Trump administration on Friday asked the Supreme Court for an emergency order allowing it to strip legal protections from more than 300,000 Venezuelan...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-asks-supreme-court-194152415.html",
    "timestamp": "2025-09-19T19:41:52Z"
  },
  {
    "title": "Tim Cook Swears Tariffs Aren’t to Blame for iPhone 17 Pro Price Hike",
    "description": "Apple CEO Tim Cook says tariffs played no role in the higher price 'to be totally clear.'",
    "link": "https://gizmodo.com/tim-cook-swears-tariffs-arent-to-blame-for-iphone-17-pro-price-hike-2000661496",
    "timestamp": "2025-09-19T19:40:43Z"
  },
  {
    "title": "2 more jets buzz Polish oil rig...",
    "description": "NATO forces were scrambled to intercept three Russian jets flying over Estonia as the Baltic nation triggered an emergency meeting. The MiGs brazenly entered the country’s airspace today in a…",
    "link": "https://www.the-sun.com/news/15220087/russian-fighter-jets-nato-airspace/",
    "timestamp": "2025-09-19T19:40:37Z"
  },
  {
    "title": "Watch out for claim video shows anti-Trump protests in London",
    "description": "Authentic video shows thousands of protesters marching on the Westminster Bridge in London to protest the Sept. 16, 2025, visit of U.S. President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/video-london-anti-trump-protest/",
    "timestamp": "2025-09-19T19:39:00Z"
  },
  {
    "title": "Trump's final Cabinet pick, Mike Waltz, confirmed by Senate in narrow vote",
    "description": "Former Green Beret Mike Waltz wins Senate confirmation as U.N. ambassador with bipartisan support, despite earlier dismissal from Trump's National Security Council.",
    "link": "https://www.foxnews.com/politics/trumps-final-cabinet-pick-mike-waltz-confirmed-senate-narrow-vote",
    "timestamp": "2025-09-19T19:38:29Z"
  },
  {
    "title": "Trump is not popular, and Trump’s agenda is less popular than Trump",
    "description": "I can understand a feeling of creeping doom — I feel it myself often — but it is important to remember that Trump’s authoritarian moves are coming from a position of political weakness: And the full consequences of Trump’s engineered price increases and decmi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/trump-is-not-popular-and-trumps-agenda-is-less-popular-than-trump",
    "timestamp": "2025-09-19T19:37:45Z"
  },
  {
    "title": "Microsoft raises Xbox prices in U.S. due to economic environment",
    "description": "Many consumer companies have been warning for months that higher prices are on the way following President Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/09/19/microsoft-xbox-prices-tariffs-macroeconomic-conditions.html",
    "timestamp": "2025-09-19T19:37:08Z"
  },
  {
    "title": "Trump to Add New $100,000 Fee for H-1B Visas in Latest Crackdown (Bloomberg)",
    "description": "Bloomberg:\nTrump to Add New $100,000 Fee for H-1B Visas in Latest Crackdown  —  President Donald Trump is expected to sign a proclamation as soon as Friday that would move to extensively overhaul the H-1B visa program, requiring a $100,000 fee for application…",
    "link": "https://www.memeorandum.com/250919/p101",
    "timestamp": "2025-09-19T19:35:01Z"
  },
  {
    "title": "‘Morning Joe’ Says Trump Wants ‘Critics Off the Air,’ Slams Kimmel’s ABC Pause as ‘Government Repression’ | Video",
    "description": "\"It's really not much to do with Charlie Kirk,\" The Atlantic staff writer Anne Applebaum says\nThe post ‘Morning Joe’ Says Trump Wants ‘Critics Off the Air,’ Slams Kimmel’s ABC Pause as ‘Government Repression’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-trump-censorship-jimmy-kimmel-abc-charlie-kirk/",
    "timestamp": "2025-09-19T19:34:51Z"
  },
  {
    "title": "Donald Trump knows how to ‘trigger’ and ‘manipulate’ people, Leo Varadkar says",
    "description": "US president Donald Trump knows how to “trigger” and “manipulate” people, former taoiseach Leo Varadkar has said.",
    "link": "https://www.independent.ie/irish-news/politics/donald-trump-knows-how-to-trigger-and-manipulate-people-leo-varadkar-says/a1270096621.html",
    "timestamp": "2025-09-19T19:33:28Z"
  },
  {
    "title": "Moscow rejects media claims it capitalized on Kirk murder",
    "description": "The Russian Foreign Ministry has asked why the Washington Post never alleged Biden exploited George Floyd’s death for political gain Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624932-moscow-responds-us-media-claims-kirk-murder/",
    "timestamp": "2025-09-19T19:31:15Z"
  },
  {
    "title": "Florida federal judge tosses Trump's $15B defamation lawsuit against The New York Times",
    "description": "A Florida federal judge has tossed out a $15 billion defamation lawsuit filed by President Donald Trump against The New York Times.",
    "link": "https://www.news4jax.com/news/2025/09/19/federal-judge-tosses-trumps-15b-defamation-lawsuit-against-new-york-times/",
    "timestamp": "2025-09-19T19:30:30Z"
  },
  {
    "title": "Here's What Happened Today: Friday",
    "description": "Here’s your round-up of what made the headlines today.",
    "link": "https://www.thejournal.ie/evening-fix-news-headlines-72-6821939-Sep2025/",
    "timestamp": "2025-09-19T19:30:25Z"
  },
  {
    "title": "Hillary Clinton on the Psychology of Autocrats",
    "description": "On The Political Scene Podcast:  The former Secretary of State discusses the Trump Administration’s efforts to reshape American politics and culture.",
    "link": "https://www.newyorker.com/podcast/political-scene/hillary-clinton-on-the-psychology-of-autocrats",
    "timestamp": "2025-09-19T19:30:00Z"
  },
  {
    "title": "'What It Looks Like When ICE Violates' First Amendment: Candidate Kat Abughazaleh Thrown to Ground",
    "description": "Protests at a US Immigration and Customs Enforcement facility in suburban Chicago continued on Friday, with ICE and Border Patrol agents tear-gassing, pepper-spraying, and detaining demonstrators—and even throwing congressional candidate Kat Abughazaleh to th…",
    "link": "https://www.commondreams.org/news/kat-abughazaleh",
    "timestamp": "2025-09-19T19:29:56Z"
  },
  {
    "title": "More than 400 arrested in Chicago area operation so far, top immigration official says",
    "description": "Protesters tried to block vehicles Friday outside a federal immigration enforcement building, leading to a confrontation with authorities.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_6dfbbe1d-8fa2-54fb-9beb-8e2299f6b325.html",
    "timestamp": "2025-09-19T19:29:00Z"
  },
  {
    "title": "Greenies Rage Against Energy Charges They Helped Unleash",
    "description": "Supporters of a rapid green energy transition are sounding the alarm over an impending jump in Nevada utility costs that they helped unleash.",
    "link": "https://dailycaller.com/2025/09/19/greenies-rage-against-energy-charges-they-helped-unleash/",
    "timestamp": "2025-09-19T19:28:38Z"
  },
  {
    "title": "Kimmel's suspension spreads fear and anger through the late-night world as insiders wonder if Fallon and Meyers are next",
    "description": "Jimmy Kimmel's suspension has provoked dread in the late-night world. Hollywood writers rallied against Disney and Trump.",
    "link": "https://www.businessinsider.com/jimmy-kimmel-fear-anger-among-late-night-tv-writers-2025-9",
    "timestamp": "2025-09-19T19:27:17Z"
  },
  {
    "title": "Senate confirms Mike Waltz as Trump's ambassador to the United Nations after months of delays",
    "description": "The Senate confirmed Mike Waltz to be the next U.S. ambassador to the United Nations",
    "link": "https://abcnews.go.com/US/wireStory/senate-confirms-mike-waltz-trumps-ambassador-united-nations-125744611",
    "timestamp": "2025-09-19T19:26:27Z"
  },
  {
    "title": "Texas A&M president steps down but doesn't say if controversial classroom video was a factor",
    "description": "Texas A&M University’s president is stepping down amid a controversy roiling the campus",
    "link": "https://abcnews.go.com/US/wireStory/texas-president-steps-controversial-classroom-video-factor-125744794",
    "timestamp": "2025-09-19T19:26:27Z"
  },
  {
    "title": "Kamala Harris' nod to Pete Buttigieg tees up potential 2028 run: DNC vice chair",
    "description": "Kamala Harris's upcoming book highlighting Pete Buttigieg could tee him up as a potential 2028 presidential contender, DNC Vice Chair Shasti Conrad said.",
    "link": "https://www.foxnews.com/politics/kamala-harris-book-tees-up-potential-2028-pete-buttigieg-run-dnc-vice-chair",
    "timestamp": "2025-09-19T19:25:23Z"
  },
  {
    "title": "Trump administration places Harvard on heightened financial oversight",
    "description": "The Trump administration announced it has placed Harvard University on heightened cash monitoring as a result of \"growing concerns\" regarding its \"financial position,\" the latest pressure tactic against the school.",
    "link": "https://www.nbcnews.com/news/us-news/trump-administration-places-harvard-heightened-financial-oversight-rcna232493",
    "timestamp": "2025-09-19T19:25:18Z"
  },
  {
    "title": "The free speech paradox",
    "description": "Jimmy Kimmel wasn’t suspended because of poor ratings. He wasn’t suspended because he crossed some ethical red line. He was suspended because the president of the United States decided to make an example of him.  The supposed justification came on Kimmel’s Mo…",
    "link": "https://www.vox.com/politics/462120/trump-kimmel-free-speech-paradox-democracy",
    "timestamp": "2025-09-19T19:24:45Z"
  },
  {
    "title": "TikTok's New US App Launches Sept 5: What Changes",
    "description": "TikTok's U.S. saga has been a rollercoaster of uncertainty, deadline extensions, and regulatory drama. Here’s the twist. Despite months of political turbulence, TikTok is reportedly building a new version specifically for American users with a targeted launch…",
    "link": "https://smartphones.gadgethacks.com/news/tiktoks-new-us-app-launches-sept-5-what-changes/",
    "timestamp": "2025-09-19T19:24:36Z"
  },
  {
    "title": "Here’s What Trump’s Offering People Who Help Fund His New Ballroom",
    "description": "If you donate to President Donald Trump’s vanity construction project, then you, too, could have the privilege of leaving a physical stain on American history: In exchange for contributions, donors may be able to have their names etched into the stone of the …",
    "link": "https://newrepublic.com/post/200713/donald-trump-offering-people-donate-ballroom",
    "timestamp": "2025-09-19T19:24:14Z"
  },
  {
    "title": "Kimmel Embroils Disney’s Iger in Culture Wars He Tried to Avoid",
    "description": "Since returning to lead Walt Disney Co. in 2022, Chief Executive Officer Bob Iger has tried to steer clear of the culture wars.",
    "link": "https://www.livemint.com/companies/news/kimmel-embroils-disney-s-iger-in-culture-wars-he-tried-to-avoid-11758309844055.html",
    "timestamp": "2025-09-19T19:24:03Z"
  },
  {
    "title": "Why Trump's Newest Fed Appointee Wants Steep Rate Cuts",
    "description": "According to Stephen Miran, President Donald Trump's economic policies are pushing down inflation, clearing the way for the Federal Reserve to swiftly and...",
    "link": "https://www.investopedia.com/why-trump-appointee-stephen-miran-wants-steep-fed-interest-rate-cuts-11813737",
    "timestamp": "2025-09-19T19:23:04Z"
  },
  {
    "title": "Erika Kirk Is Taking Over Turning Point USA. Here’s What to Know About Her",
    "description": "Erika Kirk, the widow of assassinated right-wing activist Charlie Kirk, was elected CEO of Turning Point USA, the youth-focused conservative group.",
    "link": "http://www.rollingstone.com/politics/politics-news/who-is-erika-kirk-charlie-kirk-widow-turning-point-usa-1235431462/",
    "timestamp": "2025-09-19T19:22:47Z"
  },
  {
    "title": "Bizarre Trump Bitcoin Statue Appears in Washington, D.C.",
    "description": "Apparently produced by crypto investors, the statue airbrushes out all of Trump's flaws, which may be the point.",
    "link": "https://www.artnews.com/art-news/news/trump-bitcoin-statue-washington-dc-crypto-1234752921/",
    "timestamp": "2025-09-19T19:20:28Z"
  },
  {
    "title": "Trump administration imposes new restrictions on Harvard over financial concerns",
    "description": "BOSTON: The Trump administration escalated its campaign against Harvard University on Friday (Sep 19), placing new restrictions on the Ivy League school’s access to federal student aid and",
    "link": "https://www.channelnewsasia.com/world/trump-administration-imposes-new-restrictions-harvard-over-financial-concerns-5358976",
    "timestamp": "2025-09-19T19:19:00Z"
  },
  {
    "title": "Ryder Cup organizers worry about Donald Trump's presence at New York event and seek help from Secret Service",
    "description": "Officials running the Ryder Cup have revealed they are coordinating with the Secret Service ahead of Donald Trump&apos;s expected attendance at the tournament next week in New York",
    "link": "https://www.marca.com/en/golf/ryder-cup/2025/09/19/68cd8d3ee2704ec4428b457c.html",
    "timestamp": "2025-09-19T19:17:51Z"
  },
  {
    "title": "More than 400 arrests made in Chicago area operation so far, top immigration official says",
    "description": "The figure includes arrests made by other federal agencies besides ICE.",
    "link": "https://www.bostonherald.com/2025/09/19/chicago-immigration-arrests/",
    "timestamp": "2025-09-19T19:17:01Z"
  },
  {
    "title": "'An ambush': Accusations fly as secret recording plunges state university into turmoil",
    "description": "\"How a secret recording of a gender identity lecture upended Texas A&M\" was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, government and statewide…",
    "link": "https://www.rawstory.com/an-ambush-accusations-fly-as-woke-firings-leave-state-university-in-turmoil/",
    "timestamp": "2025-09-19T19:16:39Z"
  },
  {
    "title": "House Passes Shutdown-Averting Spending Bill, Only One Democrat Votes Yes",
    "description": "The House of Representatives passed a spending bill Friday morning to prevent a government shutdown for another seven weeks with only one Democrat voting supporting the critical bill. The seven-week continuing resolution (CR) received 217 votes with 213 again…",
    "link": "https://www.breitbart.com/politics/2025/09/19/house-passes-shutdown-averting-spending-bill-only-one-democrat-votes-yes/",
    "timestamp": "2025-09-19T19:16:35Z"
  },
  {
    "title": "Tennessee Congressman Innocently Asking If Underwater Aliens Want To Steal Our Essence",
    "description": "We're supposed to take these people seriously, we think?",
    "link": "https://www.wonkette.com/p/tennessee-congressman-innocently",
    "timestamp": "2025-09-19T19:15:27Z"
  },
  {
    "title": "Israel may win in Gaza. But at what cost?",
    "description": "Israel’s ground offensive is pushing Hamas to the wall, but also isolating the country abroad and tearing its society apart Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624925-israel-may-win-in-gaza/",
    "timestamp": "2025-09-19T19:14:19Z"
  },
  {
    "title": "Colombia Slams 'Excessive' US Military Buildup, Warns Against Venezuela Intervention",
    "description": "Colombia on Friday blasted the United States' \"excessive\" military presence in the Caribbean as destabilizing for all Latin America, a sharp rebuke from one of Washington's oldest regional allies.",
    "link": "https://www.ibtimes.com/colombia-slams-excessive-us-military-buildup-warns-against-venezuela-intervention-3783977",
    "timestamp": "2025-09-19T19:12:20Z"
  },
  {
    "title": "Ex-Disney CEO Rips ABC Call To Pull Kimmel Off Air: ‘Where Has All The Leadership Gone?’",
    "description": "Michael Eisner condemned the network’s decision to succumb to pressure from the Trump administration.",
    "link": "https://www.huffpost.com/entry/michael-eisner-slams-abc-kimmel-suspension_n_68cd9f45e4b02387cfec07ff",
    "timestamp": "2025-09-19T19:10:25Z"
  },
  {
    "title": "Jimmy Kimmel could flee ABC for the internet. That wouldn't solve his problems.",
    "description": "Jimmy Kimmel should just leave ABC and go online, people have been saying this week. But it's not that easy: Donald Trump can find you there, too.",
    "link": "https://www.businessinsider.com/jimmy-kimmel-online-podcast-show-donald-trump-fcc-2025-9",
    "timestamp": "2025-09-19T19:08:42Z"
  },
  {
    "title": "Colombia slams ‘excessive’ US military buildup, warns against Venezuela intervention",
    "description": "Colombia on Friday blasted the United States’ “excessive” military presence in the Caribbean as destabilizing for all Latin America, a sharp rebuke from one of Washington’s oldest regional allies.   Rosa Villavicencio told AFP that the US deployment of severa…",
    "link": "https://www.digitaljournal.com/world/colombia-slams-excessive-us-military-buildup-warns-against-venezuela-intervention/article",
    "timestamp": "2025-09-19T19:07:20Z"
  },
  {
    "title": "3 Ways Crypto Firms Gain from SEC Corporate Disclosure Shakeup Backed by Paul Atkins",
    "description": "U.S. Securities and Exchange Commission (SEC) Chairman Paul Atkins said on Friday that the agency is preparing reforms to corporate disclosure rules, a move ...",
    "link": "https://cryptonews.com/news/3-ways-crypto-firms-gain-from-sec-corporate-disclosure-shakeup-backed-by-paul-atkins/",
    "timestamp": "2025-09-19T19:05:33Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Sept. 13: La Vuelta descends into chaos, the United States blacklists Colombia, and Malawi heads to the polls.",
    "link": "http://foreignpolicy.com/2025/09/19/foreign-policy-news-quiz-la-vuelta-china-united-states-deal-malawi-election-israel-qatar/",
    "timestamp": "2025-09-19T19:04:47Z"
  },
  {
    "title": "The Biggest Difference Between the Trump Era and the Obama Era",
    "description": "How did literally everything go up for debate?",
    "link": "https://slate.com/news-and-politics/2025/09/trump-era-vs-obama-era-politics-lessons-democrats.html",
    "timestamp": "2025-09-19T19:04:42Z"
  },
  {
    "title": "Donald Trump Is Saying There's a TikTok Deal. China Isn't",
    "description": "Donald Trump claimed victory on a deal that would put TikTok in the hands of his allies after a call with Xi Jinping. But details on the agreement—and Beijing's buy-in—remain murky.",
    "link": "https://www.wired.com/story/trump-xi-us-china-tiktok-deal/",
    "timestamp": "2025-09-19T19:02:40Z"
  },
  {
    "title": "Open Thread: No More Profiteering",
    "description": "NYT INVESTIGATION: Anatomy of Two Giant Deals: The U.A.E. Got Chips. The Trump Team Got Crypto Riches. NYT digs into links between a lucrative transaction involving the Trump family’s cryptocurrency firm and an agreement giving the Emiratis access to A.I. chi…",
    "link": "https://balloon-juice.com/2025/09/19/open-thread-no-more-profiteering/",
    "timestamp": "2025-09-19T19:01:38Z"
  },
  {
    "title": "Education Department Will Work With Turning Point USA To Develop \"Patriotic\" Civics Content",
    "description": "Education Department Will Work With Turning Point USA To Develop \"Patriotic\" Civics Contentscarymommy.com",
    "link": "https://www.scarymommy.com/parenting/education-department-will-work-with-turning-point-usa-to-develop-patriotic-civics-content",
    "timestamp": "2025-09-19T19:00:50Z"
  },
  {
    "title": "Russia’s Troubling Church Takeover",
    "description": "The Kremlin is leveraging tsarist-era assets to expand its global influence.",
    "link": "http://foreignpolicy.com/2025/09/19/russia-orthodox-church-france-history-putin-moscow-patriarchate/",
    "timestamp": "2025-09-19T19:00:19Z"
  },
  {
    "title": "Climate and Israel will be a focus at United Nations meeting",
    "description": "The UN's role in areas beyond diplomacy, such as in humanitarian aid and refugees, cultural heritage, health, and climate, are all under assault from savage budget cuts.",
    "link": "https://www.abc.net.au/news/2025-09-20/united-nations-general-assembly-israel-trump-climate/105778680",
    "timestamp": "2025-09-19T19:00:00Z"
  },
  {
    "title": "State-sponsored censorship week (This week in books)",
    "description": "This week! Books! I’m back, and luckily nothing at all happened while I was away (okay everything happened while I was away). Lots and lots of links this week! Let’s get to it. 2026 We Need Diverse Books Mentorship Program Application – Applications are now o…",
    "link": "https://nathanbransford.com/blog/2025/09/state-sponsored-censorship-week-this-week-in-books",
    "timestamp": "2025-09-19T19:00:00Z"
  },
  {
    "title": "The 4 industries worst hit by tariffs so far",
    "description": "The Trump administration's tariffs on U.S. imports are rippling through supply chains.  Consumer goods companies have been worst affected.  A Reuters news...",
    "link": "https://qz.com/tariffs-industries-consumer-goods-automakers-steel-agriculture",
    "timestamp": "2025-09-19T18:56:09Z"
  },
  {
    "title": "FedEx redeploys air fleet after US ends parcel tariff exemption",
    "description": "The U.S. cancellation of duty-free treatment for de minimis packages cut FedEx income by $150 million and forced the airline unit to reduce flights. The post...",
    "link": "https://finance.yahoo.com/news/fedex-redeploys-air-fleet-us-185517429.html",
    "timestamp": "2025-09-19T18:55:17Z"
  },
  {
    "title": "Mike Johnson Has 4 Words For Chuck Schumer’s Demand That Taxpayers Prop Up Left-Wing Media",
    "description": "House Speaker Mike Johnson flatly rejected Chuck Schumer’s demand that Congress allocate $500 million for certain media outlets, saying, “We’re not doing that.”",
    "link": "https://dailycaller.com/2025/09/19/mike-johnson-has-4-words-for-chuck-schumers-demand-that-taxpayers-prop-up-left-wing-media/",
    "timestamp": "2025-09-19T18:52:30Z"
  },
  {
    "title": "International treaty protecting world’s oceans to take effect",
    "description": "A multinational treaty to protect vast expanses of the world’s oceans is finally set to become law in January 2026, with environmentalists hailing its enactment Friday as crucial to safeguarding the marine ecosystems.  The move by Morocco and Sierra Leone to …",
    "link": "https://www.digitaljournal.com/world/international-treaty-protecting-worlds-oceans-to-take-effect/article",
    "timestamp": "2025-09-19T18:52:20Z"
  },
  {
    "title": "Analysts react to call between Trump and Xi over trade, TikTok",
    "description": "A phone call between U.S. President Donald Trump and Chinese leader Xi Jinping on Friday may have lowered the temperature between the superpowers, but it...",
    "link": "https://tech.yahoo.com/social-media/articles/analysts-react-call-between-trump-185148233.html",
    "timestamp": "2025-09-19T18:51:48Z"
  },
  {
    "title": "The Trump administration’s chilling censorship of Jimmy Kimmel violates the First Amendment and warrants Trump’s immediate impeachment and removal",
    "description": "Amid political pressure from President Donald Trump and his Federal Communications Commission Chairman Brendan Carr, American Broadcasting Company (ABC), a subsidiary of the Walt Disney Company, has pulled Jimmy Kimmel’s late-night talk show off the air indef…",
    "link": "https://www.commondreams.org/newswire/the-trump-administrations-chilling-censorship-of-jimmy-kimmel-violates-the-first-amendment-and-warrants-trumps-immediate-impeachment-and-removal",
    "timestamp": "2025-09-19T18:51:18Z"
  },
  {
    "title": "International Treaty Protecting World's Oceans To Take Effect",
    "description": "A multinational treaty to protect vast expanses of the world's oceans is finally set to become law in January 2026, with environmentalists hailing its enactment Friday as crucial to safeguarding the marine ecosystems.",
    "link": "https://www.ibtimes.com/international-treaty-protecting-worlds-oceans-take-effect-3783967",
    "timestamp": "2025-09-19T18:51:13Z"
  },
  {
    "title": "Antifa agitators disrupt Boston Charlie Kirk vigil; 2 arrested",
    "description": "Police arrested two protesters at a Boston vigil honoring Charlie Kirk, with one charged for using amplification devices and another for suspicion of assault and battery.",
    "link": "https://www.foxnews.com/us/antifa-agitators-disrupt-boston-charlie-kirk-vigil-2-arrested",
    "timestamp": "2025-09-19T18:50:18Z"
  },
  {
    "title": "Senate confirms Mike Waltz as Trump's ambassador to the United Nations after months of delays",
    "description": "The Senate has confirmed Mike Waltz as the next US ambassador to the United Nations. This fills a key vacancy in President Donald Trump's cabinet. The confirmation followed some procedural delays. Democrats raised objections regarding Waltz's role at the Gene…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/senate-confirms-mike-waltz-as-trumps-ambassador-to-the-united-nations-after-months-of-delays/articleshow/124005015.cms",
    "timestamp": "2025-09-19T18:49:25Z"
  },
  {
    "title": "Nissan pulls 2026 Ariya electric SUV from US lineup over Trump’s 15% tariff on Japan",
    "description": "Industry observers say Nissan's move was pushed over the edge by President Donald Trump’s 15% tariff on Japanese-built electric vehicles.",
    "link": "https://nypost.com/2025/09/19/business/nissan-pulls-2026-ariya-electric-suv-from-us-lineup-over-trumps-japan-tariff/",
    "timestamp": "2025-09-19T18:48:06Z"
  },
  {
    "title": "US attorney whose office is investigating Letitia James is told he's being removed, AP source says",
    "description": "U.S. attorney Erik Siebert told to resign amid Letitia James mortgage fraud investigation, a person familiar with the matter told The Associated Press",
    "link": "https://www.wmur.com/article/us-attorney-erik-siebert-letitia-james-investigation/67965390",
    "timestamp": "2025-09-19T18:47:26Z"
  },
  {
    "title": "The Trump admin theme song: No data, no cry",
    "description": "The Trump administration is curtailing data collection on critical issues like climate change, extreme weather, and public health by defunding programs and dismissing officials. These actions include ending greenhouse gas reporting, decommissioning climate-mo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-trump-admin-theme-song-no-data-no-cry/articleshow/124004972.cms",
    "timestamp": "2025-09-19T18:47:04Z"
  },
  {
    "title": "H-1B visa to get expensive; Trump mulling $100K fee in latest immigration move",
    "description": "President Donald Trump is planning to introduce a new $100,000 fee for H-1B visas",
    "link": "https://freerepublic.com/focus/f-news/4341566/posts",
    "timestamp": "2025-09-19T18:46:35Z"
  },
  {
    "title": "FCC Says 'No Basis' for Pulling Licenses Over Jimmy Kimmel",
    "description": "ABC suspended Jimmy Kimmel’s program Wednesday over comments he made about the assassination of conservative activist Charlie Kirk. FCC Commissioner Anna Gomez pushed back, saying\"there is no basis for revoking any licenses.\"\nPresident Donald Trump said US br…",
    "link": "https://biztoc.com/x/2ceefa282da4fb41",
    "timestamp": "2025-09-19T18:45:51Z"
  },
  {
    "title": "Senate confirms former national security adviser Mike Waltz as Trump’s UN ambassador",
    "description": "Waltz served for mere weeks as Trump’s national security adviser before he was ousted in May after mistakenly adding a journalist to a private Signal chat used to discuss sensitive military plans.",
    "link": "https://www.pbs.org/newshour/politics/senate-confirms-former-national-security-adviser-mike-waltz-as-trumps-un-ambassador",
    "timestamp": "2025-09-19T18:45:35Z"
  },
  {
    "title": "Estonia says 3 Russian fighter jets entered its airspace in ‘brazen’ incursion",
    "description": "Russia’s violation of Poland’s airspace was the most serious cross-border incident into a NATO member country since the war in Ukraine began with Russia’s all-out invasion in February 2022.",
    "link": "https://www.pbs.org/newshour/world/estonia-says-3-russian-fighter-jets-entered-its-airspace-in-brazen-incursion",
    "timestamp": "2025-09-19T18:45:00Z"
  },
  {
    "title": "EXCLUSIVE: 'Dishonest' Trump Keeping Information From UK Prime Minister During Meeting, Body Language Expert Claims... as Prez Signs Massive $350B Tech Deal",
    "description": "Donald Trump and Keir Starmer were all smiles when they signed a $350billion deal, but the president may have been hiding something from the Prime Minister.",
    "link": "https://radaronline.com/p/trump-keeping-information-from-uk-prime-minister-keir-starmer-tech-deal/",
    "timestamp": "2025-09-19T18:45:00Z"
  },
  {
    "title": "“Unacceptable”: Prominent U.S. Senators Demand FDA Provide Names of Troubled Foreign Drugmakers Skirting Import Bans",
    "description": "by Debbie Cenziper and Megan Rose, ProPublica, and Katherine Dailey, Medill Investigative Lab \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nT…",
    "link": "https://www.propublica.org/article/senators-letter-fda-drug-import-bans",
    "timestamp": "2025-09-19T18:45:00Z"
  },
  {
    "title": "Top Democrat Sounds The Alarm: 'They're Making Comedy Illegal'",
    "description": "Democrats are understandably upset over Federal Communications Commission (FCC) Chair Brendan Carr's move to silence another Trump critic by launching a pressure campaign against late-night host Jimmy Kimmel. Democratic California Rep. Ro Khanna (D-Calif.) mo…",
    "link": "https://crooksandliars.com/2025/09/top-democrat-sounds-alarm-theyre-making",
    "timestamp": "2025-09-19T18:43:49Z"
  },
  {
    "title": "Trump administration places new restrictions on Harvard, citing financial concerns",
    "description": "The Trump administration escalated its conflict with Harvard University by imposing stricter regulations on the institution's access to federal student aid, citing concerns about its financial stability. The Education Department demands Harvard to use its own…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administration-places-new-restrictions-on-harvard-citing-financial-concerns/articleshow/124004902.cms",
    "timestamp": "2025-09-19T18:43:44Z"
  },
  {
    "title": "As Putin grows more bold, here’s how Trump can fight back",
    "description": "Fresh polling finds that Republican voters are itching for action on Russia, and if Trump doesn’t move first Congress looks ready to force his hand.",
    "link": "https://nypost.com/2025/09/19/opinion/as-putin-grows-more-bold-heres-how-trump-can-fight-back/",
    "timestamp": "2025-09-19T18:43:39Z"
  },
  {
    "title": "House passes spending bill as Democrats protest healthcare cuts: ‘We don’t work for Trump’",
    "description": "US nears government shutdown after Democrats oppose Republican bill that ‘guts healthcare’",
    "link": "https://www.yahoo.com/news/articles/us-nears-government-shutdown-democrats-160328276.html",
    "timestamp": "2025-09-19T18:43:29Z"
  },
  {
    "title": "Trump’s tariffs roil trade: Container freight rates set to stay weak through FY25",
    "description": "Container freight rates are projected to remain low due to global trade uncertainties caused by US tariffs. Exporters accelerated shipments to the US before tariff deadlines, leading to an 18% increase in exports during April-August 2025. Oversupply of capaci…",
    "link": "https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/trumps-tariffs-roil-trade-container-freight-rates-set-to-stay-weak-through-fy25/articleshow/124004880.cms",
    "timestamp": "2025-09-19T18:42:39Z"
  },
  {
    "title": "What good is bad language?",
    "description": "The use of swear words is now common. The 'F' word has lost its shock value. Political correctness has made other words offensive. YouTube now allows profanity early in videos. Some research suggests swearing helps with pain.",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/what-good-is-bad-language/articleshow/124004866.cms",
    "timestamp": "2025-09-19T18:42:14Z"
  },
  {
    "title": "White House releases video tribute to Charlie Kirk",
    "description": "Charlie Kirk's widow, Erika, declares \"the movement my husband built will not die\" in emotional White House tribute video following his Sept. 10 killing.",
    "link": "https://www.foxnews.com/politics/white-house-releases-video-tribute-charlie-kirk",
    "timestamp": "2025-09-19T18:41:00Z"
  },
  {
    "title": "Trumps $175 Billion Golden Dome is Turning Into a Disaster",
    "description": "Months after US president Donald Trump signed off on a long-range missile defense system called the \"Golden Dome,\" officials and the public are still in the dark on how to finish the project — and experts warn its price tag will be far higher than previously …",
    "link": "https://futurism.com/trump-golden-dome-disaster",
    "timestamp": "2025-09-19T18:41:00Z"
  },
  {
    "title": "ABC’s suspension of Jimmy Kimmel is corporate cowardice",
    "description": "Claire McCaskill says ABC’s decision to pull Jimmy Kimmel off the air shows there’s at least one thing Trump and corporate executives have in common: cowardice.",
    "link": "https://www.msnbc.com/top-stories/latest/abc-suspends-jimmy-kimmel-corporate-cowardice-trump-rcna232425",
    "timestamp": "2025-09-19T18:40:33Z"
  },
  {
    "title": "What the Heck Is the Status of Trump’s TikTok Deal With China?",
    "description": "President Donald Trump posted on Truth Social Friday boasting that China had approved a deal that would allow TikTok to keep operating in the United States under new ownership—but Chinese President Xi Jinping seems to think otherwise.After the presidents spok…",
    "link": "https://newrepublic.com/post/200711/donald-trump-tiktok-deal-china-status",
    "timestamp": "2025-09-19T18:40:28Z"
  },
  {
    "title": "Steve Bannon floats idea of Bessent running both Treasury and the Fed",
    "description": "White House confidante Steve Bannon has an unusual solution for who should take over as Federal Reserve Chair Jerome Powell next year.",
    "link": "https://www.cnbc.com/2025/09/19/steve-bannon-floats-idea-of-bessent-running-both-treasury-and-the-fed.html",
    "timestamp": "2025-09-19T18:39:12Z"
  },
  {
    "title": "US Attorney Erik Siebert under pressure from Trump tells staff he will be resigning, source says | CNN Politics",
    "description": "US Attorney Erik Siebert told his staff Friday he will be stepping down, according to a person familiar with the matter, after facing intense pressure from President Donald Trump to charge New York Attorney General Letitia James with mortgage fraud.",
    "link": "https://www.cnn.com/2025/09/19/politics/trump-letitia-james-fire-us-attorney",
    "timestamp": "2025-09-19T18:38:03Z"
  },
  {
    "title": "The US-China TikTok Standoff Appears to Be Over After a Call",
    "description": "Trump announced a deal with Chinese Premier Xi Jinping to resolve the TikTok standoff after a call this Friday, averting a potential ban.",
    "link": "https://www.androidheadlines.com/2025/09/us-china-tiktok-deal-trump-call.html",
    "timestamp": "2025-09-19T18:35:36Z"
  }
]