[
  {
    "title": "Elon Musk backs ‘free trade zone’ between US and Europe",
    "description": "Elon Musk calls for a US-Europe free-trade zone with zero tariffs while EU plans a response to US import duties.",
    "link": "https://www.aljazeera.com/news/2025/4/5/elon-musk-backs-free-trade-zone-between-us-and-europe",
    "timestamp": "2025-04-05T20:49:57Z"
  },
  {
    "title": "Anti-Trump Protesters Assemble in Every State and Cities Worldwide",
    "description": "Hundreds of thousands gathered for the largest opposition protest against Trump and Musk since the president’s inauguration.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-musk-protests-america-world-hands-off-1235311342/",
    "timestamp": "2025-04-05T20:49:12Z"
  },
  {
    "title": "Netanyahu reportedly plans to meet Trump on Monday at the White House",
    "description": "Israeli Prime Minister Benjamin Netanyahu plans to meet with President Donald Trump in the White House on Monday, and will likely discuss new tariffs on U.S....",
    "link": "https://www.upi.com/Top_News/US/2025/04/05/Trump-host-Netanyahu/5421743874799/",
    "timestamp": "2025-04-05T20:43:28Z"
  },
  {
    "title": "Trump gives TikTok additional 75 days",
    "description": "WASHINGTON, D.C. — United States President Donald Trump on Friday extended the deadline for TikTok to find a non-Chinese buyer or face a ban in the United States, allowing 75 more days to find a solution.",
    "link": "https://www.manilatimes.net/2025/04/06/business/top-business/trump-gives-tiktok-additional-75-days/2087077",
    "timestamp": "2025-04-05T20:42:02Z"
  },
  {
    "title": "Kamala Harris Claims Vindication After Crushing Election Loss: 'I Told You So'",
    "description": "Former Vice President Kamala Harris joked \"I told you so\" in a public appearance this week, suggesting that she prophetically warned President Donald Trump's second term would bring disastrous consequences during her presidential campaign that ended in humili…",
    "link": "https://www.breitbart.com/pre-viral/2025/04/05/kamala-harris-claims-vindication-after-crushing-election-loss-i-told-you-so/",
    "timestamp": "2025-04-05T20:41:56Z"
  },
  {
    "title": "Former OAN Anchor Harshly Reminded She Called Tariffs ‘Tax Hikes’ in Brutal Community Note Flashback",
    "description": "Shortly after Liz Wheeler's post gained traction on X, it was appended with a community note pointing to a 2018 tweet from her own page opposing tariffs.\nThe post Former OAN Anchor Harshly Reminded She Called Tariffs ‘Tax Hikes’ in Brutal Community Note Flash…",
    "link": "https://www.mediaite.com/news/former-oan-anchor-harshly-reminded-she-called-tariffs-tax-hikes-in-brutal-community-note-flashback/",
    "timestamp": "2025-04-05T20:41:47Z"
  },
  {
    "title": "Supreme Court uses shadow docket to help Trump again",
    "description": "Only the shadow docket knows: The Supreme Court on Friday allowed President Donald Trump to temporarily freeze millions of dollars in grants to states for addressing teacher shortages, the administration’s first win at the high court since reclaiming power in…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/supreme-court-uses-shadow-docket-to-help-trump-again",
    "timestamp": "2025-04-05T20:40:26Z"
  },
  {
    "title": "\"Hands Off!\" demonstrations protest Trump, Musk across U.S. (CBS News)",
    "description": "CBS News:\n“Hands Off!” demonstrations protest Trump, Musk across U.S.  —  Opponents of President Donald Trump and billionaire Elon Musk rallied across the U.S. on Saturday to protest the administration's actions on government downsizing, the economy, human ri…",
    "link": "https://www.memeorandum.com/250405/p61",
    "timestamp": "2025-04-05T20:40:02Z"
  },
  {
    "title": "President Trump tells Americans to 'hang tough,' golfs again as universal tariffs begin",
    "description": "President Trump on Saturday urged Americans to \"hang tough\" and played golf as his baseline 10% universal tariffs went into effect.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/05/trump-tells-americans-hang-tough-universal-tariffs-begin/82953727007/",
    "timestamp": "2025-04-05T20:37:40Z"
  },
  {
    "title": "Musk Calls For United States And European Union To Move To Zero-Tariff System",
    "description": "President Donald Trump imposed tariffs of 20% on the European Union as part of his “Liberation Day” tariff policy.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/05/musk-calls-for-united-states-and-european-union-to-move-to-zero-tariff-system/",
    "timestamp": "2025-04-05T20:37:26Z"
  },
  {
    "title": "‘It is time for you to leave the United States’: Ukrainians receive erroneous email from Department of Homeland Security",
    "description": "Some Ukrainians living legally in the US under a Biden-era humanitarian parole program received a notice this week from the Department of Homeland Security telling them to leave the country — a message that prompted panic and later turned out to be erroneous.",
    "link": "https://www.cnn.com/2025/04/05/politics/homeland-security-ukrainians-email-parole-program/index.html",
    "timestamp": "2025-04-05T20:36:30Z"
  },
  {
    "title": "Huge crowds gather in 'Hands Off' rallies nationwide in protest of Trump admin",
    "description": "Tens of thousands of protesters mustered in cities and towns across the country on Saturday to sound off against the Trump administration.",
    "link": "https://abcnews.go.com/Politics/huge-crowds-gather-hands-off-rallies-nationwide-protest/story?id=120523176",
    "timestamp": "2025-04-05T20:34:26Z"
  },
  {
    "title": "Maya Angelou memoir and Holocaust book are among Naval Academy library's DEI purge",
    "description": "The Navy late Friday provided the list of 381 books that were taken out of its library after a Trump executive order.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_05093bac-1226-5a02-b572-e65bd05a8cad.html",
    "timestamp": "2025-04-05T20:30:00Z"
  },
  {
    "title": "Maya Angelou memoir and Holocaust book are among Naval Academy library's DEI purge",
    "description": "The Navy late Friday provided the list of 381 books that were taken out of its library after a Trump executive order.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_d1d5f5aa-f9b8-5f30-a31e-14e5adcb01f6.html",
    "timestamp": "2025-04-05T20:30:00Z"
  },
  {
    "title": "Oh, Donald… Trump Insists He's 'Deliberately' Tanking Global Stock Markets and Costing World TRILLIONS as Part of 'Genius Chess Move' — Forcing Investment Titan Warren Buffet Into Astonishing Denial",
    "description": "President Donald Trump shared a fan-made video describing his tariffs as a 'genius chess move'.",
    "link": "https://radaronline.com/p/donald-trump-deliberately-tanking-global-stock-markets-costing-trillions/",
    "timestamp": "2025-04-05T20:30:00Z"
  },
  {
    "title": "Trump urges US to 'hang tough' as 10% tariffs come into effect",
    "description": "It comes on the largest day of protests against Trump's administration since he returned to office.",
    "link": "https://www.bbc.com/news/articles/c8rg5lp7m8no",
    "timestamp": "2025-04-05T20:28:46Z"
  },
  {
    "title": "Trump Tariffs: U.K.'s Jaguar Land Rover Announces Month-Long Shipment Pause to U.S.",
    "description": "Britain's Jaguar Land Rover decided to deal with President Donald Trump's tariffs by pausing shipments of its U.K.-made cars to the U.S.\nThe post Trump Tariffs: U.K.’s Jaguar Land Rover Announces Month-Long Shipment Pause to U.S. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/05/british-jaguar-land-rover-announces-month-long-shipment-pause-to-u-s-amid-trumps-tariffs/",
    "timestamp": "2025-04-05T20:28:32Z"
  },
  {
    "title": "Tesla Stock Is Crashing Real Bad",
    "description": "The world economy is reeling today as businesses and investors try to unpack Donald Trump's so-called \"reciprocal tariffs.\"\nTrump aims to curb the United States' reliance on foreign goods by raising the import cost for different countries, which is throwing t…",
    "link": "https://biztoc.com/x/b05da82385efa0dd",
    "timestamp": "2025-04-05T20:20:49Z"
  },
  {
    "title": "Elon Musk says he wants 'zero' tariffs between the US and Europe",
    "description": "Elon Musk on Saturday said he wants to see a \"free trade zone\" between the US and Europe.\n- On April 2, US President Donald Trump set a 20% tariff rate for the European Union.\n- Musk's comments came as he spoke remotely to a meeting of Italy's League Party.\nE…",
    "link": "https://biztoc.com/x/b78bdfeb3d5566f3",
    "timestamp": "2025-04-05T20:20:41Z"
  },
  {
    "title": "Amid Tariff Turmoil, Here's Why Mike Johnson and John Thune Stand by Trump",
    "description": "Republican leaders are reportedly standing firm in their support for President Donald Trump despite internal worries about his global tariffs.\nWhat Happened: According to a report, Speaker Mike Johnson and Senate Majority Leader John Thune have not indicated …",
    "link": "https://biztoc.com/x/385e30c708a43bda",
    "timestamp": "2025-04-05T20:20:22Z"
  },
  {
    "title": "Trump is shaking up the stock market — and can still prove naysayers wrong",
    "description": "Wall Street’s Trump supporters — and they are legion — were riding high.",
    "link": "https://nypost.com/2025/04/05/business/trump-is-shaking-up-the-stock-market-and-can-still-prove-naysayers-wrong/",
    "timestamp": "2025-04-05T20:18:50Z"
  },
  {
    "title": "US Inflation Is Set to Give Hints of Trump Tariff Pain to Come",
    "description": "US households probably experienced slightly less overall inflation last month, a reprieve that economists view as temporary in the wake of President Donald Trump’s tariff tsunami.",
    "link": "https://financialpost.com/pmn/business-pmn/us-inflation-is-set-to-give-hints-of-trump-tariff-pain-to-come",
    "timestamp": "2025-04-05T20:18:19Z"
  },
  {
    "title": "Senate GOP approves framework for Trump's tax breaks and spending cuts",
    "description": "The vote, 51-48, fell along mostly party lines, but with sharp dissent from two prominent Republicans.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_f546d304-3622-5c76-8d4c-1d040fedc040.html",
    "timestamp": "2025-04-05T20:15:00Z"
  },
  {
    "title": "Barack Obama calls on Americans to defend democratic values in face of Trump agenda - The Guardian",
    "description": "Barack Obama calls on Americans to defend democratic values in face of Trump agendaThe Guardian Barack Obama’s stark warning on Donald Trump’s attacks on free speech, media, and law firms: ‘I’m more deeply concerned’Mint Obama Calls for Universities to Stand …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176937115",
    "timestamp": "2025-04-05T20:12:23Z"
  },
  {
    "title": "Thousands join protests against Donald Trump and Elon Musk",
    "description": "Demonstrations mark the first big display of public resistance to president’s frenetic second term",
    "link": "https://biztoc.com/x/97ae0b0eb042fef4",
    "timestamp": "2025-04-05T20:09:35Z"
  },
  {
    "title": "'Hands Off!' rally held in Westmoreland County",
    "description": "Hundreds in Westmoreland County gathered Saturday in what organizers have dubbed a national day of action, targeting Trump and Musk's actions in regards to government downsizing, the economy, human rights, and other issues.",
    "link": "https://www.wtae.com/article/hundreds-hands-off-rally-trump-musk-policies-westmoreland-county/64395468",
    "timestamp": "2025-04-05T20:09:09Z"
  },
  {
    "title": "Canada Warns Residents Their Phones May Be Searched at US Border",
    "description": "The Canadian government issued a new warning for travelers entering the US, saying they should “expect scrutiny” at the border and that their phones and other electronic devices may be searched.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-warns-residents-their-phones-may-be-searched-at-us-border",
    "timestamp": "2025-04-05T20:08:50Z"
  },
  {
    "title": "DOGE expected to take aim at DHS with staffing cuts, including at US Secret Service | CNN Politics",
    "description": "Elon Musk’s Department of Government Efficiency is expected to take aim at the Department of Homeland Security in the coming days, seeking potentially major cuts to personnel across its agencies, including the US Secret Service, multiple sources tell CNN.",
    "link": "https://www.cnn.com/2025/04/05/politics/doge-dhs-secret-service/index.html",
    "timestamp": "2025-04-05T20:04:47Z"
  },
  {
    "title": "DC slammed Trump’s tariffs. Biden’s decision to keep them draws a very different reaction.",
    "description": "Back in 2018, lawmakers of both parties greeted President Donald Trump’s decision to slap tariffs on Chinese imports with widespread derision. Six years later, most members of Congress are applauding President Joe Biden’s extension — and in some cases, expans…",
    "link": "https://freerepublic.com/focus/f-news/4309066/posts",
    "timestamp": "2025-04-05T20:04:38Z"
  },
  {
    "title": "Donald Trump Colorado Portrait Artist Fires Back at President's Attacks",
    "description": "The artist of the Donald Trump's portrait in the Colorado Capitol Building is firing back at the president's claims she distorted his image for political reasons ... insisting she didn't do that, and adding his comments have hurt her career. Sarah…\n Permalink",
    "link": "https://www.tmz.com/2025/04/05/donald-trump-portrait-artist-slams-his-claims/",
    "timestamp": "2025-04-05T20:03:10Z"
  },
  {
    "title": "Landry considers putting formerly indicted Jindal official in charge of health department again",
    "description": "Gov. Jeff Landry might put a former Louisiana agency leader who was charged with lying to a grand jury under oath back in his old position overseeing billions of dollars at the Louisiana Department of Health.",
    "link": "https://www.fox8live.com/2025/04/05/landry-considers-putting-formerly-indicted-jindal-official-charge-health-department-again/",
    "timestamp": "2025-04-05T20:00:41Z"
  },
  {
    "title": "Obama Goes After Trump in Appearance at Hamilton College: ‘Imagine if I Had Done Any of This’",
    "description": "\"That kind of behavior is contrary to the basic compact we have as Americans\"\nThe post Obama Goes After Trump in Appearance at Hamilton College: ‘Imagine if I Had Done Any of This’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/obama-goes-after-trump-in-appearance-at-hamilton-college-imagine-if-i-had-done-any-of-this/",
    "timestamp": "2025-04-05T20:00:31Z"
  },
  {
    "title": "Over 75% of Canadians support Government funding for Alberta to Eastern Canada pipeline / The New Voice of Ukraine",
    "description": "More than three in four Canadians back government funding for a pipeline to transport oil from Alberta to eastern Canada, a Bloomberg-commissioned poll shows on April 5.",
    "link": "https://english.nv.ua/business/over-75-of-canadians-support-government-funding-for-alberta-to-eastern-canada-pipeline-50503827.html",
    "timestamp": "2025-04-05T19:59:26Z"
  },
  {
    "title": "As tough new tariff reality dawns, New Zealand needs to hold its nerve - Liam Dann",
    "description": "OPINION: Our economy faces yet another challenge to fragile recovery hopes.",
    "link": "https://www.nzherald.co.nz/business/liam-dann-as-tough-new-tariff-reality-dawns-new-zealand-needs-to-hold-its-nerve/AYVM74JCARDKZD3KL7UXBXRYSQ/",
    "timestamp": "2025-04-05T19:59:08Z"
  },
  {
    "title": "Hundreds jam downtown Attleboro to tell Trump 'Hands Off!'",
    "description": "ATTLEBORO -- Hundreds of people lined the streets of downtown Attleboro on Saturday to protest the actions of President Donald Trump and his billionaire adviser, Elon Musk.",
    "link": "https://www.thesunchronicle.com/news/local_news/hundreds-jam-downtown-attleboro-to-tell-trump-hands-off/article_23deeb48-825d-4b3b-8a72-9c6eaf7ae186.html",
    "timestamp": "2025-04-05T19:59:00Z"
  },
  {
    "title": "CIA psychic Uri Geller drops apocalyptic bombshell: Terrifying Donald Trump premonition and chilling date for global catastrophe",
    "description": "Uri Geller, known for accurate predictions, claims to have had a vision of a nuclear apocalypse caused by Iran. He warns Donald Trump against signing any nuclear deal with Iran, stating it could lead to global catastrophe. Geller urges Trump to act immediatel…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cia-psychic-uri-geller-drops-apocalyptic-bombshell-terrifying-donald-trump-premonition-and-chilling-date-for-global-catastrophe/articleshow/120024617.cms",
    "timestamp": "2025-04-05T19:58:47Z"
  },
  {
    "title": "Trump’s tariffs may have minimal impact on Nigeria’s us exports – Report",
    "description": "Nigeria’s exports to the United States account for about two per cent of the country’s Gross Domestic Product, according to a report by Renaissance Capital Africa. The report, titled “The African Continent is (relatively) Immune to Trump’s Tariffs”, suggests …",
    "link": "https://punchng.com/trumps-tariffs-may-have-minimal-impact-on-nigerias-us-exports-report/",
    "timestamp": "2025-04-05T19:53:40Z"
  },
  {
    "title": "Protesters Across the U.S. Rally Against Trump and Musk: ‘Stop Destroying America’",
    "description": "One woman at the Washington D.C. rally on the National Mall was pictured holding a sign that read “Stop Destroying America.”",
    "link": "https://time.com/7275249/protesters-across-us-global-rally-against-trump-musk/",
    "timestamp": "2025-04-05T19:51:57Z"
  },
  {
    "title": "Trump Says America Will Win 'Economic Revolution,' Promises 'Historic' Result",
    "description": "President Donald Trump said the United States is in the midst of an \"economic revolution\" and urged Americans to \"hang tough\" for a \"historic\" result.\nThe post Trump Says America Will Win ‘Economic Revolution,’ Promises ‘Historic’ Result appeared first on Bre…",
    "link": "https://www.breitbart.com/politics/2025/04/05/trump-says-america-will-win-economic-revolution-promises-historic-result/",
    "timestamp": "2025-04-05T19:51:10Z"
  },
  {
    "title": "Controversial ‘Snow White’ star Rachel Zegler invited to Met Gala — with star-studded guest list revealed",
    "description": "A source tells us the \"Snow White\" star, who drew ire for her social media posts while promoting the film, did receive a coveted invite to the event.",
    "link": "https://pagesix.com/2025/04/05/celebrity-news/controversial-snow-white-star-rachel-zegler-invited-to-met-gala-with-star-studded-guest-list-revealed/",
    "timestamp": "2025-04-05T19:50:59Z"
  },
  {
    "title": "\"I'm spending the kids' inheritance to teach them the value of money\" [Interesting]",
    "description": "\"I'm spending the kids' inheritance to teach them the value of money\"",
    "link": "https://www.fark.com/comments/13623750/Im-spending-kids-inheritance-to-teach-them-value-of-money",
    "timestamp": "2025-04-05T19:50:43Z"
  },
  {
    "title": "More than 1,200 rallies rally worldwide protest Trump and Musk",
    "description": "People are gathering in cities all over the United States and globally to protest an “illegal, billionaire power grab” by President Donald Trump and Elon Musk. They’re being put on by over 150 different organizations, including civil rights groups, labor unio…",
    "link": "https://www.theverge.com/news/644113/hands-off-rally-protests-trump-musk-footage",
    "timestamp": "2025-04-05T19:45:49Z"
  },
  {
    "title": "Trump Regime Gives FEMA Chief a Lie Detector Test Because That’s Just the Reality We Live in Now",
    "description": "\"We will track down leakers and prosecute them to the fullest extent of the law,\" a spokesperson for DHS said.",
    "link": "https://gizmodo.com/trump-regime-gives-fema-chief-a-lie-detector-test-because-thats-just-the-reality-we-live-in-now-2000585549",
    "timestamp": "2025-04-05T19:45:33Z"
  },
  {
    "title": "'Turbulence far away': NYT exposes Trump 'moneymaking weekend' amid huge 'market meltdown'",
    "description": "As the global markets were tumbling at record levels, President Donald Trump was reportedly on a money-making spree in Mar-a-Lago.As everyday folks were checking in on their 401ks and worrying about losing their Social Security payments, Trump's family was pu…",
    "link": "https://www.rawstory.com/trump-turbulence-market-meltdown-money/",
    "timestamp": "2025-04-05T19:41:29Z"
  },
  {
    "title": "Elon Musk at odds with Trump tariffs policy, wants ‘zero tariff situation’ between US and EU | CNN Business",
    "description": "The Tesla CEO’s comments come after President Donald Trump on Wednesday announced 20% tariffs on goods from the European Union.",
    "link": "https://www.cnn.com/2025/04/05/business/musk-tariffs-us-europe/index.html",
    "timestamp": "2025-04-05T19:41:11Z"
  },
  {
    "title": "Laura Loomer Uncovers ANOTHER Shocking Conflict of Interest Involving Obama Judge Who Is Threatening to Jail Trump Officials for Not Bringing Violent Illegals Back to US Homeland",
    "description": "Laura Loomer reveals a troubling conflict of interest involving Judge Boasberg, whose daughter's ties to a far-left organization raise serious questions about taxpayer-funded influence on immigration policies.\nThe post Laura Loomer Uncovers ANOTHER Shocking C…",
    "link": "https://www.thegatewaypundit.com/2025/04/laura-loomer-uncovers-another-shocking-conflict-interest-involving/",
    "timestamp": "2025-04-05T19:40:14Z"
  },
  {
    "title": "'Hands off!' demos against Trump and Musk across US, Europe",
    "description": "Demos against US President Donald Trump and Elon Musk are taking place across the US and Europe. Meanwhile, Trump's 10% \"universal\" tariffs hit many countries, sparking fears of a global trade war. DW has the latest. Anti-Trump and anti-Musk protests take pla…",
    "link": "https://www.dw.com/en/updates-protesters-take-part-in-hands-off-demos-against-trump-and-musk-across-the-us-and-europe-dw-has-the-latest/live-72149383",
    "timestamp": "2025-04-05T19:39:00Z"
  },
  {
    "title": "Elon Musk Loses $11 Billion As Tesla Stock Plummets In Wake Of New Trump Tariffs",
    "description": "President Donald Trump‘s recent announcement of new tariffs sent the U.S. stock futures into a tailspin.\nWhat Happened: The imposition of tariffs, including a 10% charge on all imported goods and a 25% levy on foreign automobiles, caused Tesla Inc. (NASDAQ:TS…",
    "link": "https://biztoc.com/x/619966e54bf6ccbd",
    "timestamp": "2025-04-05T19:36:22Z"
  },
  {
    "title": "Hundreds gather at California Capitol for protests against Trump, Musk",
    "description": "With organized protests against President Donald Trump and billionaire Elon Musk underway across the US on Saturday, more than 1000 people are rallying at the California Capitol.",
    "link": "https://www.kcra.com/article/california-capitol-protests-trump-musk-hands-off/64395558",
    "timestamp": "2025-04-05T19:33:24Z"
  },
  {
    "title": "Jaguar Land Rover to pause shipments to US over tariffs",
    "description": "Jaguar Land Rover will pause shipments of its Britain-made cars to the United States for a month, it said on Saturday, as it considers how to mitigate the cost of President Donald Trump’s 25% tariff.",
    "link": "https://www.nbcnews.com/business/autos/jaguar-land-rover-pause-shipments-us-tariffs-rcna199840",
    "timestamp": "2025-04-05T19:32:19Z"
  },
  {
    "title": "Musk wants a 'zero tariff situation', 'free trade zone' for Europe",
    "description": "Elon Musk broke with the president's decision to impose expansive tariffs on most foreign nations, saying that he hopes to see a 'zero tariff situation' with Europe.",
    "link": "https://www.nbcnews.com/politics/politics-news/elon-musk-zero-tariff-free-trade-zone-europe-rcna199849",
    "timestamp": "2025-04-05T19:32:19Z"
  },
  {
    "title": "Why Melania Trump's White House comeback is under fire",
    "description": "Melania Trump stepped back into the White House spotlight, but the internet&apos;s got her under fire. On April 3, the First Lady made her first public appearance since Donald Trum",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/04/05/67f1850322601d42448b4571.html",
    "timestamp": "2025-04-05T19:31:59Z"
  },
  {
    "title": "'Hands Off:' Protesters rally in Seattle against Trump and Musk's influence",
    "description": "On April 5, a nationwide mobilization is set to take place under the banner \"Hands Off!\" in response to what organizers describe as \"the most brazen power grab",
    "link": "https://komonews.com/news/local/hands-off-protesters-rally-in-seattle-against-trump-and-musks-influence-government-economy-human-rights-billionaire-law-president-executive-order-immigration-tariffs-medicaid-taxes",
    "timestamp": "2025-04-05T19:31:21Z"
  },
  {
    "title": "Stephen Miller Mocks Judge Who Ordered Return of Man Mistakenly Deported to El Salvador Mega-Prison: 'Thinks She's President of El Salvador'",
    "description": "President Donald Trump's Chief of Staff Stephen Miller took to social media to mock a Maryland judge on Friday.",
    "link": "https://www.ibtimes.com/stephen-miller-mocks-judge-who-ordered-return-man-mistakenly-deported-el-salvador-mega-prison-3768932",
    "timestamp": "2025-04-05T19:30:28Z"
  },
  {
    "title": "Trump's trade wars threaten America's craft brewers already reeling from changing tastes",
    "description": "America’s craft brewers already had problems. But President Donald Trump’s tariffs, which include levies of 25% on imported steel and aluminum, pose a new threat.",
    "link": "https://roanoke.com/news/nation-world/business/article_8df59ae0-73b5-5d58-a8e4-1ae8c76a4213.html",
    "timestamp": "2025-04-05T19:30:00Z"
  },
  {
    "title": "Trump's trade wars threaten America's craft brewers already reeling from changing tastes",
    "description": "America’s craft brewers already had problems. But President Donald Trump’s tariffs, which include levies of 25% on imported steel and aluminum, pose a new threat.",
    "link": "https://richmond.com/news/nation-world/business/article_8456f4f5-5e2c-5795-bc79-fa7bf4c17992.html",
    "timestamp": "2025-04-05T19:30:00Z"
  },
  {
    "title": "Trump After Bombing Houthis Gathering for Attack Instructions: 'Oops, There Will Be No Attack'",
    "description": "President Trump on Friday posted a video on his social media accounts of a U.S. military strike against Iran-backed Houthi rebels in Yemen who have been targeting American ships in the Red Sea.\nThe post Trump After Bombing Houthis Gathering for Attack Instruc…",
    "link": "https://www.breitbart.com/politics/2025/04/05/trump-after-bombing-houthis-gathering-attack-instructions-oops-there-will-be-no-attack/",
    "timestamp": "2025-04-05T19:29:19Z"
  },
  {
    "title": "'Hands off!': Protests against Trump and Musk across US",
    "description": "Demos against US President Donald Trump and Elon Musk are taking place across the US and Europe. Meanwhile, Trump's 10% \"universal\" tariffs have many countries, sparking fears of a global trade war. DW has the latest. Anti-Trump and anti-Musk protests take pl…",
    "link": "https://www.dw.com/en/hands-off-demos-against-trump-and-musk-across-us-europe/live-72149383",
    "timestamp": "2025-04-05T19:28:00Z"
  },
  {
    "title": "Tesla estimates cut further on ‘unprecedented brand damage’",
    "description": "Tesla estimates cut further on ‘unprecedented brand damage’\nWhite House Senior Advisor, Tesla and SpaceX CEO Elon Musk attends a cabinet meeting held by U.S. President Donald Trump at the White House on March 24, 2025 in Washington, DC.\nPhoto by Win McNamee/G…",
    "link": "https://biztoc.com/x/4d03eb5900e587af",
    "timestamp": "2025-04-05T19:25:44Z"
  },
  {
    "title": "Netanyahu May Meet Trump at White House on Monday, With Tariffs, Iran, and Gaza on the Table",
    "description": "Israeli Prime Minister Benjamin Netanyahu is reportedly planning a visit to the White House on Monday.\nIf the visit goes ahead, Netanyahu will meet with President Donald Trump in person to address key geopolitical and economic issues, including Trump’s newly …",
    "link": "https://biztoc.com/x/f5a31c78fdbdefba",
    "timestamp": "2025-04-05T19:25:41Z"
  },
  {
    "title": "Berkshire Hathaway rushes to deny false claims that Warren Buffett endorsed Trump’s trade policies",
    "description": "Berkshire Hathaway rushes to deny false claims that Warren Buffett endorsed Trump’s trade policies\nA video posted by X user @AmericaPapaBear has been viewed 2 million times and shared by President Donald Trump on his Truth Social account. The clip includes a …",
    "link": "https://biztoc.com/x/fa07c2ac65c459bf",
    "timestamp": "2025-04-05T19:25:40Z"
  },
  {
    "title": "Youngkin: Trump approves major disaster declaration for SWVA",
    "description": "RICHMOND — Gov. Glenn Youngkin announced Friday that President Donald J. Trump approved Virginia's major disaster declaration and significant additional funding for Southwest Virginia after historic flood and severe winter storms.",
    "link": "https://heraldcourier.com/news/local/government-politics/article_3cb56066-73cb-427c-b8dd-250c3ab5bb92.html",
    "timestamp": "2025-04-05T19:25:00Z"
  },
  {
    "title": "‘Astonishingly Tone Deaf’: Media Fiercely React to Trump Touting Golf Win ‘North Korea Style’ After Market ‘Carnage’, Missing Solemn Ceremony",
    "description": "Trump was raked over the coals for sending out his golf win update as the markets plunged and he skipped a ceremony for fallen American soldiers.\nThe post ‘Astonishingly Tone Deaf’: Media Fiercely React to Trump Touting Golf Win ‘North Korea Style’ After Mark…",
    "link": "https://www.mediaite.com/politics/astonishingly-tone-deaf-media-fiercely-react-to-trump-touting-golf-win-north-korea-style-after-market-carnage-missing-solemn-ceremony/",
    "timestamp": "2025-04-05T19:23:49Z"
  },
  {
    "title": "Marcon may talk with Russia about ending Ukraine conflict – Telegraph",
    "description": "French President Emmanuel Macron could become the point man for Kiev’s backers in talks with Russia, The Telegraph has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615278-macron-talk-russia-ukraine-conflict/",
    "timestamp": "2025-04-05T19:23:42Z"
  },
  {
    "title": "Middle East: Video contradicts IDF on aid workers' deaths",
    "description": "The Palestinian Red Crescent said the footage shows ambulances driving with emergency lights on, contradicting the Israeli military's account that it opened fire on suspicious vehicles. A video released by the Palestinian Red Crescent has cast doubt over the …",
    "link": "https://www.dw.com/en/middle-east-video-contradicts-idf-on-aid-workers-deaths/live-72150541",
    "timestamp": "2025-04-05T19:16:00Z"
  },
  {
    "title": "Nancy Pelosi Down Millions in Trump Tariffs Market Plunge – Report",
    "description": "Nancy Pelosi's reported losses are notable in the sense that amateur traders often attempt to emulate her market success, but she's not the only lawmaker cashing in.\nThe post Nancy Pelosi Down Millions in Trump Tariffs Market Plunge – Report first appeared on…",
    "link": "https://www.mediaite.com/news/nancy-pelosi-down-millions-in-trump-tariffs-market-plunge-report/",
    "timestamp": "2025-04-05T19:15:48Z"
  },
  {
    "title": "Trump is playing a dangerous game with Iran",
    "description": "Recent aggressive moves by the Trump administration have clearly been meant to threaten Iran. While this pressure might be an attempt to intimidate Iran into nuclear concessions, the threat of all-out war appears to be growing by the day.",
    "link": "https://mondoweiss.net/2025/04/trump-is-playing-a-dangerous-game-with-iran/",
    "timestamp": "2025-04-05T19:15:00Z"
  },
  {
    "title": "'I’d love to bring sanity back’: Ron Paul says Elon Musk asked him to advise the Dept. of Government Efficiency — but warns Americans of an ‘urgent threat’ to their retirement funds",
    "description": "Time to ‘end the Fed’?",
    "link": "https://www.aol.com/finance/d-love-bring-sanity-back-145800743.html",
    "timestamp": "2025-04-05T19:15:00Z"
  },
  {
    "title": "Jaguar Land Rover suspends shipments to US after Trump tariffs",
    "description": ", U.K.-based luxury automaker, said it will \"pause\" shipments of vehicles to the United States this month, after U.S. President Donald Trump's imposition of hefty tariffs on foreign-made cars.\nThe company, which exports almost a quarter of its annual producti…",
    "link": "https://biztoc.com/x/d4580272d64ae940",
    "timestamp": "2025-04-05T19:14:43Z"
  },
  {
    "title": "President Trump to host Netanyahu at White House Monday to talk Gaza war, tariffs",
    "description": "Israeli Prime Minister Netanyahu and President Trump will meet Monday at the White house, their second in-person meeting since Trump's inauguration.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/05/trump-netanyahu-white-house-gaza-israel/82952931007/",
    "timestamp": "2025-04-05T19:10:25Z"
  },
  {
    "title": "Photos: Massive Crowds at Anti-Trump, Musk 'Hands Off' Rallies Across US",
    "description": "Taking place in over 1,000 locations, the mobilization represents what organizers call \"a nationwide mobilization to stop the most brazen power grab in modern history.\"",
    "link": "https://www.newsweek.com/massive-crowds-anti-trump-musk-protests-hands-off-across-us-2055887",
    "timestamp": "2025-04-05T19:04:07Z"
  },
  {
    "title": "18 photos from Boston's 'Hands Off!' protest against Trump, Musk",
    "description": "Senator Ed Markey and Boston Mayor Michelle Wu were among the notable speakers at Boston's \"Hands Off!\" protest.",
    "link": "https://www.boston.com/news/local-news/2025/04/05/boston-hands-off-rally-protest-donald-trump-elon-musk-photos-images/",
    "timestamp": "2025-04-05T19:03:49Z"
  },
  {
    "title": "Australian share market set to dive as threat of US recession grows",
    "description": "With US President Donald Trump's tariffs risking a global trade war and a US recession, the Australian share market is set to dive when it opens on Monday morning.",
    "link": "https://www.abc.net.au/news/2025-04-06/australian-share-market-set-to-dive/105141828",
    "timestamp": "2025-04-05T19:03:42Z"
  },
  {
    "title": "TikTok ban in the US extends 75 more days",
    "description": "Donald Trump, US president, issued an executive decree to stay the ban on TikTok for 75 more days. The executive order allows for the continuation of a potential company sale to a US firm. On January 19, the short form video social network was banned in the U…",
    "link": "https://www.ilounge.com/news/tiktok-ban-in-the-us-extends-75-more-days",
    "timestamp": "2025-04-05T19:03:17Z"
  },
  {
    "title": "US Will Not Use Force to Claim Greenland - Finnish Minister",
    "description": "MOSCOW (Sputnik) - The United States will not use force to take Greenland, Finnish Foreign Minister Elina Valtonen said on Saturday.",
    "link": "https://sputnikglobe.com/20250405/us-will-not-use-force-to-claim-greenland---finnish-minister-1121745993.html",
    "timestamp": "2025-04-05T19:02:10Z"
  },
  {
    "title": "Kamala Harris’s concession call to Donald Trump was awkward; here’s what they said to each other",
    "description": "Vice President Kamala Harris called President-elect Donald Trump to concede the 2024 election. Despite the tension, they had a cordial conversation. Trump congratulated Harris and complimented her husband. One of Harris’s aides found Trump's response manipula…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kamala-harriss-concession-call-to-donald-trump-was-awkward-heres-what-they-said-to-each-other/articleshow/120023035.cms",
    "timestamp": "2025-04-05T19:02:01Z"
  },
  {
    "title": "SEC Staff to Reassess Biden-Era Crypto Guidance Amid Regulatory Shakeup",
    "description": "This review is part of efforts to ease regulatory pressure on the digital assets sector and may lead to new regulatory frameworks.",
    "link": "https://www.coindesk.com/policy/2025/04/05/sec-staff-to-reassess-biden-era-crypto-guidance-amid-regulatory-shakeup",
    "timestamp": "2025-04-05T19:01:41Z"
  },
  {
    "title": "Trump administration ‘temporarily’ stops Title X funds for Planned Parenthood’s abortion cartel",
    "description": "Offices got notice they have 10 days to show a willingness to comply with Trump's orders",
    "link": "https://www.wnd.com/2025/04/trump-administration-temporarily-stops-title-x-funds-for-planned-parenthoods-abortion-cartel/",
    "timestamp": "2025-04-05T19:01:40Z"
  },
  {
    "title": "Senate Republicans Reinvent Math So They Can Make America Super Poor",
    "description": "Lindsey Graham is drunk with power.",
    "link": "https://www.wonkette.com/p/senate-republicans-reinvent-math",
    "timestamp": "2025-04-05T19:01:03Z"
  },
  {
    "title": "Alarm bells start to ring for Dutton's campaign after Trump's tariff rampage",
    "description": "The Trump effect is becoming a vicious political accelerant. While he might be the left's worst nightmare, the US president may cause the most damage to the right.",
    "link": "https://www.abc.net.au/news/2025-04-06/dutton-liberals-campaign-concerns-after-trump-tariffs/105142210",
    "timestamp": "2025-04-05T19:00:37Z"
  },
  {
    "title": "Bring him back now: Judge slams Donald Trump, gives U.S 72 hours ultimatum to return wrongfully deported Maryland man after shocking error",
    "description": "Kilmar Abrego Garcia was wrongfully deported from Maryland to El Salvador in a shocking immigration mistake ICE admits was an “administrative error.” A federal judge slammed the government and gave just 72 hours to bring Kilmar home. His wife, kids, and suppo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bring-him-back-now-judge-slams-donald-trump-gives-u-s-72-hours-ultimatum-to-return-wrongfully-deported-maryland-man-after-shocking-error/articleshow/120022012.cms",
    "timestamp": "2025-04-05T19:00:23Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "Silence over a murdered woman, Trump’s tariffs and Mick O’Dwyer remembered.",
    "link": "https://www.thejournal.ie/news-fix-evening-headlines-11-6669879-Apr2025/",
    "timestamp": "2025-04-05T19:00:15Z"
  },
  {
    "title": "\"Hands Off!\" demonstrations protest Trump, Musk across U.S.",
    "description": "More than 1,200 \"Hands Off!\" demonstrations were planned by more than 150 groups.",
    "link": "https://www.cbsnews.com/news/trump-musk-hands-off-demonstrators-protest/",
    "timestamp": "2025-04-05T19:00:13Z"
  },
  {
    "title": "‘Pure deception’: Walmart shopper reaches for bag of green beans ‘made in Mexico.’ Then she accuses store of trying to trick customers",
    "description": "A Canadian Walmart shopper believes the retailer is trying to avert efforts to boycott American products after she spots a suspicious sticker on a bag of green beans.\n\n\nIn a video with over 308,000 views, Courtney Pickles (@picklesreads) shows a sticker that …",
    "link": "https://www.dailydot.com/news/walmart-green-beans/",
    "timestamp": "2025-04-05T19:00:00Z"
  },
  {
    "title": "A flaw in Verizon’s iOS Call Filter app exposed call records of millions",
    "description": "A now-patched flaw in Verizon ’s iOS Call Filter app exposed call records of millions. No abuse found. Only phone numbers and timestamps were at risk. A now-patched vulnerability in Verizon ’s iOS Call Filter app could have been exploited to harvest the call …",
    "link": "https://securityaffairs.com/176217/hacking/verizon-s-ios-call-filter-app-flaw.html",
    "timestamp": "2025-04-05T18:59:52Z"
  },
  {
    "title": "CNN Runs Brutal Montage of Trump Complaining About Obama Golfing Too Much After He Skips Dignified Transfer To Hit the Links",
    "description": "CNN aired a brutal montage of golf-loving President Donald Trump complaining about former President Barack Obama golfing too much while in office.\nThe post CNN Runs Brutal Montage of Trump Complaining About Obama Golfing Too Much After He Skips Dignified Tran…",
    "link": "https://www.mediaite.com/tv/cnn-runs-brutal-montage-of-trump-complaining-about-obama-golfing-too-much-after-he-skips-dignified-transfer-to-hit-the-links/",
    "timestamp": "2025-04-05T18:58:15Z"
  },
  {
    "title": "Anti-Trump ‘Hands Off!’ protests draw big crowds across N.J.",
    "description": "Thousands of protesters showed up at New Jersey rallies that were part of the larger \"hands-off\" demonstrations held across the nation Saturday to protest President Donald Trump and his policies. Sen. Cory Booker spoke at one gathering in Montclair.",
    "link": "https://www.nj.com/news/2025/04/anti-trump-hands-off-protests-draw-hundreds-across-nj.html",
    "timestamp": "2025-04-05T18:57:45Z"
  },
  {
    "title": "Michael Jordan's Jumpman logo unexpectedly linked to Venezuelan gang in new Trump immigration crackdown",
    "description": "As US President Donald Trump ramps up immigration enforcement in his return to office, one of the most unexpected developments in the administration&apos;s latest crackdown has pul",
    "link": "https://www.marca.com/en/basketball/nba/chicago-bulls/2025/04/05/67f16414ca47416e388b4597.html",
    "timestamp": "2025-04-05T18:54:25Z"
  },
  {
    "title": "Donald Trump Says 'Market Is Going To Boom,' Claiming '$6-7 Trillion' Worth Of Inflows Will Come After The Worst Selloff Since 2020",
    "description": "In This Article:\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nDespite a bloodbath on Thursday following the tariff announcements on several U.S. trading partners, President Donald Trump dismissed the con…",
    "link": "https://biztoc.com/x/1b91955498b7c15b",
    "timestamp": "2025-04-05T18:52:13Z"
  },
  {
    "title": "Elon Musk breaks silence on Trump tariffs after losing millions, torches key White House adviser Navarro",
    "description": "Elon Musk, who lost billions in the market crash triggered by Donald Trump's tariff, mostly maintained silence on the issue, but on Saturday, he did not mince his words for Trump's close economic adviser Peter Navarro. Navarro was in favor of strict tariffs t…",
    "link": "https://biztoc.com/x/9e00c75704815f6a",
    "timestamp": "2025-04-05T18:51:50Z"
  },
  {
    "title": "'Scary' White House insider observation about Trump should set off alarms: analyst",
    "description": "In a column published on Saturday, Washington Post political analyst Aaron Blake noted a description of Donald Trump by an anonymous White House official that he feels should have received more attention.Describing it as scary, Blake noted it not only may hav…",
    "link": "https://www.rawstory.com/trump-scary/",
    "timestamp": "2025-04-05T18:50:04Z"
  },
  {
    "title": "Viola Davis Doesn’t Think Her ‘G20’ Black Woman POTUS Requires “Suspension Of Disbelief”",
    "description": "With her new presidential action flick G20, Viola Davis understands the desire to politicize her role. Noting they made the movie before Kamala Harris lost the 2024 election to Donald Trump, the Oscar winner can see “probably in hindsight” how her butt-kickin…",
    "link": "http://deadline.com/2025/04/viola-davis-g20-black-woman-potus-suspension-disbelief-1236360514/",
    "timestamp": "2025-04-05T18:46:54Z"
  },
  {
    "title": "Holy Smoke, Sen. John Kennedy Rips Trump's Tariffs",
    "description": "Sen. John Kennedy from Louisiana admitted that Trump's global tariffs have not been good for the country and if it doesn't change soon Trump has to recalibrate.\nThat was surprising. \nFox News host Harris Faulkner soft-peddled her first question to the faux fo…",
    "link": "https://crooksandliars.com/2025/04/holy-smoke-sen-john-kennedy-rips-trumps",
    "timestamp": "2025-04-05T18:46:43Z"
  },
  {
    "title": "Crypto Markets Skate Sideways on Friday as US Fed Chair Jerome Powell Strikes Neutral Tone in New Policy Speech",
    "description": "Crypto markets skated sideways on Friday while stocks crumbled as U.S. Federal Reserve Chairman Jerome Powell suggested the Fed would take a wait-and-see approach to monetary policy. The Fed chair says at a conference in Virginia that the US economy faces “a …",
    "link": "https://dailyhodl.com/2025/04/05/crypto-markets-skate-sideways-on-friday-as-us-fed-chair-jerome-powell-strikes-neutral-tone-in-new-policy-speech/",
    "timestamp": "2025-04-05T18:45:50Z"
  }
]