[
  {
    "title": "(no subject)",
    "description": "Posted by RISKS List Owner on Oct 25Content-Type: text/plain; charset=UTF-8\nContent-Transfer-Encoding: 8bit\nprecedence: bulk\nSubject: Risks Digest 34.78\n\nRISKS-LIST: Risks-Forum Digest Saturday 25 October 2025 Volume 34 : Issue 78\n\nACM FORUM ON RISKS TO THE P…",
    "link": "https://seclists.org/risks/2025/q4/2",
    "timestamp": "2025-10-25T23:49:13Z"
  },
  {
    "title": "Thailand-Cambodia peace deal to be ‘signed immediately’ upon Trump’s arrival",
    "description": "KUALA LUMPUR: President Donald Trump says the \"peace deal\" that he \"proudly brokered\" between Thailand and Cambodia will be signed immediately upon his arrival in Malaysia. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/26/thailand-cambodia-peace-deal-to-be-signed-immediately-upon-trumps-arrival",
    "timestamp": "2025-10-25T23:49:00Z"
  },
  {
    "title": "Is Secret Service chief committed to reforming DEI, ‘woke’ culture?",
    "description": "Facing headwinds from 'cronyism, nepotism, and uneven discipline' in addition to damaging DEI ideologies",
    "link": "https://www.wnd.com/2025/10/is-secret-service-chief-committed-reforming-dei-woke/",
    "timestamp": "2025-10-25T23:48:04Z"
  },
  {
    "title": "U.S. may hit Russia with more sanctions but wants Europe to increase pressure",
    "description": "While it's unclear whether Washington will act on these moves, it shows a toolkit within the administration to up the ante",
    "link": "https://www.japantimes.co.jp/news/2025/10/26/world/politics/us-russia-sanctions-europe-ukraine/",
    "timestamp": "2025-10-25T23:47:00Z"
  },
  {
    "title": "The bulldozer and the ballroom: Trump puts permanent stamp on the White House",
    "description": "To many, the plan symbolizes a presidency that has taken a wrecking ball to national norms, international institutions and the world order itself.",
    "link": "https://www.japantimes.co.jp/news/2025/10/26/world/politics/trump-white-house-analysis/",
    "timestamp": "2025-10-25T23:46:00Z"
  },
  {
    "title": "WaPo Editorial Board Praises Trump’s ‘Aggressive Approach’ To Building His New Ballroom",
    "description": "The Washington Post Editorial Board is praising President Donald Trump's \"aggressive approach\" to building his White House ballroom in a new story on Saturday\nThe post WaPo Editorial Board Praises Trump’s ‘Aggressive Approach’ To Building His New Ballroom fir…",
    "link": "https://www.mediaite.com/media/news/wapo-editorial-board-praises-trumps-aggressive-approach-to-building-his-new-ballroom/",
    "timestamp": "2025-10-25T23:45:09Z"
  },
  {
    "title": "Trump to Increase Canada Tariffs by 10% After Ontario Premier Doug Ford’s Ronald Reagan Ad",
    "description": "Ontario Premier Doug Ford previously agreed to pull the ad\nThe post Trump to Increase Canada Tariffs by 10% After Ontario Premier Doug Ford’s Ronald Reagan Ad appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-increase-canada-tariffs-10-percent-ronald-reagan-ad/",
    "timestamp": "2025-10-25T23:43:54Z"
  },
  {
    "title": "Rubio says mediators of Gaza ceasefire shared information to uncover a recent threat",
    "description": "Secretary of State Marco Rubio said Saturday that Israel, the U.S. and the other mediators of the Gaza ceasefire deal are sharing information to disrupt any ...",
    "link": "https://www.yahoo.com/news/articles/rubio-says-mediators-gaza-ceasefire-233946785.html",
    "timestamp": "2025-10-25T23:39:46Z"
  },
  {
    "title": "DAVID BLACKMON: Promises Made, Promises Kept On ANWR",
    "description": "The U.S. Interior Department announced plans to reopen part of the Arctic National Wildlife Reserve (ANWR) to oil and gas leasing in the coming months.",
    "link": "https://dailycaller.com/2025/10/25/opinion-promises-made-promises-kept-trump-keeps-another-one-in-anwr-david-blackmon/",
    "timestamp": "2025-10-25T23:39:02Z"
  },
  {
    "title": "Tether Projected To Hit $15 Billion Profit In 2025 – Report",
    "description": "Tether, issuer of the USDT stablecoin, expects to report a net profit of $15 billion at the end of 2025. This projection comes amid a favorable crypto regulatory environment in the United States, driving interest in stablecoins and other digital assets. Relat…",
    "link": "https://bitcoinist.com/tether-projected-to-hit-15-billion-profit-in-2025/",
    "timestamp": "2025-10-25T23:30:23Z"
  },
  {
    "title": "Trump Meets with Emir of Qatar Aboard Air Force One During Refuel",
    "description": "President Donald Trump met with Emir of Qatar Tamim bin Hamad Al Thani and Qatari Prime Minister Mohammed bin Abdulrahman bin Jassim Al Thani aboard Air Force One Saturday at Al-Udeid Air Base in Qatar during refueling on Trump’s voyage to Asia. Trump called …",
    "link": "https://freerepublic.com/focus/f-news/4348634/posts",
    "timestamp": "2025-10-25T23:30:23Z"
  },
  {
    "title": "ASEAN summit in Malaysia: Who’s attending and what to expect",
    "description": "The Cambodian-Thai border conflict and the US trade war will feature prominently at Southeast Asian bloc summit.",
    "link": "https://www.aljazeera.com/news/2025/10/25/asean-summit-in-malaysia-whos-attending-and-what-to-expect",
    "timestamp": "2025-10-25T23:23:18Z"
  },
  {
    "title": "Trump adds tariff after Canada runs Reagan ad during the World Series",
    "description": "President Donald Trump will add a 10% tariff to Canadian goods after the airing of an ad featuring former President Ronald Reagan during the World Series.",
    "link": "https://www.upi.com/Top_News/US/2025/10/25/trump-canada-tariff/4521761433506/",
    "timestamp": "2025-10-25T23:20:25Z"
  },
  {
    "title": "Trump threatens Canada with 10% tariff increase for not pulling down critical ad sooner",
    "description": "President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario.",
    "link": "https://biztoc.com/x/04eb005b5f3db10b",
    "timestamp": "2025-10-25T23:18:49Z"
  },
  {
    "title": "James Carville Rings Alarm On Trump Admin, 2028 Election: 'They're Just Getting Started'",
    "description": "The longtime Democratic strategist says President Donald Trump's administration will dangerously \"accelerate their craziness\" as voters jump ship.",
    "link": "https://www.huffpost.com/entry/james-carville-warning-trump-admin-2028-election_n_68fd3f33e4b0049ce5fd217b",
    "timestamp": "2025-10-25T23:16:58Z"
  },
  {
    "title": "Trump says increasing tariffs on Canada by 10 per cent",
    "description": "<![CDATA[ The fallout continues over a Canadian anti-tariff ad that featured late US leader Ronald Reagan. ]]>",
    "link": "https://www.channelnewsasia.com/world/us-canada-tariff-up-10-cent-trump-5425261",
    "timestamp": "2025-10-25T23:14:00Z"
  },
  {
    "title": "'Straw that broke the camel's back': Ex-prosecutor warns Pam Bondi her law license at risk",
    "description": "Pam Bondi and Todd Blanche should watch out, according to a former prosecutor.Andrew Weissmann, a former senior prosecutor for special counsel Robert Mueller, appeared on MSNBC on Saturday, where he was asked about Donald Trump reportedly demanding hundreds o…",
    "link": "https://www.rawstory.com/pam-bondi-law-license-camel/",
    "timestamp": "2025-10-25T23:11:37Z"
  },
  {
    "title": "Trump gives Hamas 48 hours to return all deceased Gaza hostages or 'other countries will take action'",
    "description": "President Donald Trump gives Hamas 48-hour ultimatum to return bodies of 13 deceased hostages or face consequences from countries involved in Gaza peace deal.",
    "link": "https://www.foxnews.com/politics/trump-gives-hamas-48-hours-return-all-deceased-gaza-hostages-other-countries-take-action",
    "timestamp": "2025-10-25T23:10:58Z"
  },
  {
    "title": "Trump threatens Canada with 10% tariff increase for not pulling down critical ad sooner",
    "description": "President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario.",
    "link": "https://www.pbs.org/newshour/politics/trump-threatens-canada-with-10-tariff-increase-for-not-pulling-down-critical-ad-sooner",
    "timestamp": "2025-10-25T23:10:37Z"
  },
  {
    "title": "Trump Hits Back Despite Ontario, Caught ‘Red Handed,’ Suspending $54,000,000 Anti-Tariff Ad Campaign",
    "description": "President Donald Trump announced Saturday he is increasing U.S. tariffs on Canada by 10% after a province's leader said he would be pulling an anti-tariff ad.",
    "link": "https://dailycaller.com/2025/10/25/donald-trump-doug-ford-ontario-canada-tariff-ad-ronald-reagan/",
    "timestamp": "2025-10-25T23:09:32Z"
  },
  {
    "title": "Ohio judge could face further consequences over Charlie Kirk comments",
    "description": "Online snark: 'How’s he feel about gun violence and gun control in Hell, now?'",
    "link": "https://www.wnd.com/2025/10/ohio-judge-could-face-further-consequences-charlie-kirk/",
    "timestamp": "2025-10-25T23:03:05Z"
  },
  {
    "title": "Trump To Install New Pro-Crypto CFTC Chair? Here’s What We Know So Far",
    "description": "New reports reveal that United States President Donald Trump has picked pro-crypto Michael Selig as the new chair nominee for the Commodity Futures Trading Commission. The CFTC’s role involves overseeing the futures, options, and crypto markets, ensuring thes…",
    "link": "http://www.newsbtc.com/news/trump-to-install-new-pro-crypto-cftc-chair-heres-what-we-know-so-far/",
    "timestamp": "2025-10-25T23:00:42Z"
  },
  {
    "title": "World meets Asean",
    "description": "As world leaders gather to experience Malaysian hospitality, it would be nice if they fully appreciated why they are here beyond the cocktails and small talk. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/behind-the-headlines/2025/10/26/world-meets--asean",
    "timestamp": "2025-10-25T23:00:00Z"
  },
  {
    "title": "US-China in talks ahead of summit",
    "description": "KUALA LUMPUR: Top economic officials from the United States and China have begun talks in Kuala Lumpur, as both global powers seek to resolve ongoing tariff tensions and lay the groundwork for a possible meeting between their presidents next week. Read full s…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/26/us-china-in-talks-ahead-of-summit",
    "timestamp": "2025-10-25T23:00:00Z"
  },
  {
    "title": "Zohran Mamdani Slams Trump’s Republican Party: ‘Only Agenda’ Is ‘Cruelty and Punishment’ Towards Muslims and Minorities",
    "description": "NYC mayoral frontrunner Zohran Mamdani slammed President Trump and Republican lawmakers nationwide, saying their \"only agenda\" is \"cruelty and punishment\"\nThe post Zohran Mamdani Slams Trump’s Republican Party: ‘Only Agenda’ Is ‘Cruelty and Punishment’ Toward…",
    "link": "https://www.mediaite.com/media/zohran-mamdani-slams-trumps-republican-party-only-agenda-is-cruelty-and-punishment-towards-muslims-and-minorities/",
    "timestamp": "2025-10-25T22:59:33Z"
  },
  {
    "title": "Trump: Cambodia-Thailand will be signed immediately",
    "description": "United States President Donald Trump announced that the peace deal between Cambodia and Thailand will be signed \"immediately upon arrival.\"In a post on Truth Social, Trump wrote that he was on his \"wa...",
    "link": "https://biztoc.com/x/59560b5a3948d6b4",
    "timestamp": "2025-10-25T22:57:01Z"
  },
  {
    "title": "Newsom Suggests MAGA Is ‘Putting America In Reverse,’ Says ‘Anti-Woke' Is ‘Anti-Black’",
    "description": "“I mean, they're rewriting history, censoring historical facts,\" Newsom said on the \"All the Smoke\" podcast.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-maga-anti-dei-black_n_68fd3ab8e4b0a3c9efbb189f",
    "timestamp": "2025-10-25T22:52:01Z"
  },
  {
    "title": "Trump: Qatar is readying peacekeepers for Gaza",
    "description": "Washington DC (UPI) Oct 25, 2025 \n\n\n Qatari officials are preparing peacekeeping troops for Gaza if needed to help maintain a cease-fire between Hamas and Israel, President Donald Trump said during a refueling stop. \n Air Force One stopped in Qatar on Saturda…",
    "link": "https://www.spacewar.com/reports/Trump_Qatar_is_readying_peacekeepers_for_Gaza_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "Israel army says targeted IJ militant in Gaza strike; 2 killed in strikes in south Lebanon",
    "description": "Jerusalem (AFP) Oct 25, 2025\n\n The Israeli military said Saturday it had conducted an air strike targeting an alleged Islamic Jihad militant in central Gaza, despite a ceasefire brokered by US President Donald Trump. \n\nFor the past two weeks there has been a …",
    "link": "https://www.spacewar.com/reports/Israel_army_says_targeted_Islamic_Jihad_militant_in_Gaza_strike_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "Hegseth confirms 8th U.S. strike on alleged drug boat",
    "description": "Washington DC (UPI) Oct 22, 2025 \n\n\n The U.S. military struck another alleged drug vessel on Tuesday night, marking the eighth time the United States has targeted and destroyed an alleged drug boat since Sept. 2. \n Defense Secretary Pete Hegseth confirmed the…",
    "link": "https://www.terradaily.com/reports/Hegseth_confirms_8th_US_strike_on_alleged_drug_boat_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "Washington's hard line in South China Sea tests allies, raises risks",
    "description": "Washington DC (UPI) Oct 23, 2025 \n\n\n President Donald Trump's upcoming diplomatic sweep through Asia - first to Malaysia for the ASEAN Summit and then to South Korea for the APEC leaders' meeting, with a pivotal sideline encounter planned with China's Xi Jinp…",
    "link": "https://www.spacewar.com/reports/Washingtons_hard_line_in_South_China_Sea_tests_allies_raises_risks_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "U.S. deploys carrier strike group to the Caribbean",
    "description": "Washington DC (UPI) Oct 24, 2025 \n\n\n The USS Gerald R. Ford Carrier Strike Group is headed to the Caribbean Sea to escalate the nation's military presence amid strikes on alleged drug-running vessels. \n The carrier strike group currently is in the Mediterrane…",
    "link": "https://www.spacewar.com/reports/US_deploys_carrier_strike_group_to_the_Caribbean_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "Hegseth requires Pentagon's approval of interactions with Congress",
    "description": "Washington DC (UPI) Oct 22, 2025 \n\n\n Most Pentagon personnel will need approval from the agency's legislative affairs office before talking to members of Congress or state legislators, according to a memo by Defense Secretary Pete Hegseth. \n The memo, which w…",
    "link": "https://www.terradaily.com/reports/Hegseth_requires_Pentagons_approval_of_interactions_with_Congress_999.html",
    "timestamp": "2025-10-25T22:51:05Z"
  },
  {
    "title": "Trump announces additional 10-per-cent tariff on Canada over Ontario ad",
    "description": "U.S. President Donald Trump announced an additional 10 per cent tariff on Canada on Saturday because the Ontario government didn’t immediately pull down an anti-tariff ad it was running in U.S. markets. The tariff will be “over and above what they are paying …",
    "link": "https://financialpost.com/pmn/trump-announces-additional-10-per-cent-tariff-on-canada-over-ontario-ad",
    "timestamp": "2025-10-25T22:50:52Z"
  },
  {
    "title": "Barron Trump boyfriend is Argentine ballroom dancer? Here's complete truth about viral claims, shocking rumors explained and is Barron Trump dating anyone",
    "description": "Barron Trump boyfriend is Argentine ballroom dancer? Rumors about Barron Trump dating an Argentine dancer named Carlos have gone viral. Reports confirm no official verification. This explainer details Barron’s dating rumors, social media claims, family commen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/barron-trump-boyfriend-is-argentine-ballroom-dancer-heres-complete-truth-about-viral-claims-shocking-rumors-explained-and-is-barron-trump-dating-anyone-youngest-son-of-donald-trump-carlos-relationship-freshman-at-new-york-university/articleshow/124820272.cms",
    "timestamp": "2025-10-25T22:41:37Z"
  },
  {
    "title": "Trump ally says grand jury in Florida to investigate conspiracy against Trump",
    "description": "A key Trump ally says a federal grand jury has been empaneled in Florida that will begin meeting in January.",
    "link": "https://abcnews.go.com/Politics/trump-ally-grand-jury-empaneled-florida-investigate-sweeping/story?id=126854433",
    "timestamp": "2025-10-25T22:41:22Z"
  },
  {
    "title": "Saturday, October 25. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,340.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/10/25/saturday-october-25-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-10-25T22:37:48Z"
  },
  {
    "title": "This mysterious billionaire and top Trump backer is behind a $130 million donation to pay troops during the government shutdown, report says",
    "description": "But the Antideficiency Act prevents federal agencies from spending more money than Congress allows or from using unpaid help that Congress hasn’t approved.",
    "link": "https://fortune.com/2025/10/25/billionaire-trump-130-million-donation-troops-government-shutdown-workers/",
    "timestamp": "2025-10-25T22:28:51Z"
  },
  {
    "title": "Trump hands Canada 10pc extra import tax for not pulling anti-tariff ad sooner",
    "description": "US President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10pc because of an anti-tariff television ad aired by the province of Ontario.",
    "link": "https://www.independent.ie/world-news/trump-hands-canada-10pc-extra-import-tax-for-not-pulling-anti-tariff-ad-sooner/a1916110756.html",
    "timestamp": "2025-10-25T22:26:00Z"
  },
  {
    "title": "U of T creates emergency fund for researchers facing U.S. funding cuts",
    "description": "University of Toronto has created an emergency fund to support its researchers who are facing unexpected losses in funding due to cuts and policy changes at U.S. federal research agencies.",
    "link": "https://www.cbc.ca/news/canada/toronto/university-of-toronto-research-funding-9.6953829",
    "timestamp": "2025-10-25T22:24:35Z"
  },
  {
    "title": "Trump raises tariffs on Canada by 10% in retaliation for anti-tariff TV ad",
    "description": "Move is response to ad sponsored by Ontario that referenced Ronald Reagan’s support for free trade\nDonald Trump announced on Saturday that he will raise US tariffs on Canada by 10% in retaliation for an anti-tariff advertisement sponsored by the Ontario gover…",
    "link": "https://biztoc.com/x/e8a15f0b99808792",
    "timestamp": "2025-10-25T22:23:46Z"
  },
  {
    "title": "Trump threatens Canada with 10% extra import tax over anti-tariffs ad",
    "description": "Trump threatens Canada with 10% extra import tax over anti-tariffs ad\nABOARD AIR FORCE ONE — President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by th…",
    "link": "https://biztoc.com/x/161d2bf5ce284469",
    "timestamp": "2025-10-25T22:23:43Z"
  },
  {
    "title": "'Not a joke': Internet aghast as Trump orders higher tariffs because Canada 'made him sad'",
    "description": "Donald Trump Saturday announced higher tariff rates on Canada, specifically because of an anti-tariff ad using Ronald Reagan's own words, and spurred outrage from observers.The president has for days raged about the ad, which plays the words of Reagan talking…",
    "link": "https://www.rawstory.com/trump-10-percent-internet-outrage/",
    "timestamp": "2025-10-25T22:22:53Z"
  },
  {
    "title": "Is Ford’s ad to blame for Trump’s 10-per-cent tariff hike? Please, it’s an excuse",
    "description": "Ford’s message may not be the right one. Saying that protectionism and Trump’s tariff plan is bad is all well and good, but the Americans the ad is talking to no longer believe that",
    "link": "https://www.theglobeandmail.com/business/commentary/article-doug-ford-anti-tariff-advertisement-trump-tariffs-canada/",
    "timestamp": "2025-10-25T22:21:37Z"
  },
  {
    "title": "Virginia MAGA Republican Winsome Earle-Sears’s recent donations reveal a split with Donald Trump on IVF",
    "description": "With less than two weeks to go until a hotly contested gubernatorial election in Virginia, the Republican candidate, whom her Democratic opponent’s campaign calls “so far right, she’s wrong for Virginia,” is trying to appeal to a broad swath of voters. Howeve…",
    "link": "https://www.advocate.com/politics/winsome-earle-sears-against-ivf",
    "timestamp": "2025-10-25T22:15:38Z"
  },
  {
    "title": "Bill Maher Makes Foreboding Prediction About Trump's White House Ballroom",
    "description": "The late night host made a blunt remark on the \"symbolism\" of President Donald Trump's planned White House ballroom.",
    "link": "https://www.huffpost.com/entry/bill-maher-trump-white-house-ballroom_n_68fd36b9e4b0fb1b9514a126",
    "timestamp": "2025-10-25T22:09:46Z"
  },
  {
    "title": "FAFO: Pro-Trump Florida Store Goes Bankrupt Due To Tariffs",
    "description": "I know this will shock all of our readers, but tariffs are a bad thing for consumers and not good business. \nA Florida grocery store run by a Trump supporting family of immigrants is learning that lesson the hard way: all the way to bankruptcy proceedings. Th…",
    "link": "https://crooksandliars.com/2025/10/fafo-pro-trump-florida-store-goes-bankrupt",
    "timestamp": "2025-10-25T22:08:29Z"
  },
  {
    "title": "Trump threatens Canada with 10% extra import tax over anti-tariffs ad",
    "description": "The ad, which used the words of former President Ronald Reagan to criticize U.S. tariffs, aired during a World Series game.  Trump said that Ontario's premier didn't act quickly enough to pull the ad.",
    "link": "https://www.npr.org/2025/10/25/g-s1-95116/trump-canada-anti-tariffs-ad-import-tax",
    "timestamp": "2025-10-25T22:07:35Z"
  },
  {
    "title": "Israeli military carries out ‘targeted strike’ in Gaza during ceasefire",
    "description": "Egyptian officials enter Palestinian territory to help locate bodies of hostages taken captive by Hamas",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/25/israeli-military-carries-out-targeted-strike-in-gaza-during-ceasefire/",
    "timestamp": "2025-10-25T22:06:39Z"
  },
  {
    "title": "Trump's week in Asia: BBC correspondents on the wins and potential losses",
    "description": "Here's what you should know as the US president arrives for a whirlwind week of diplomacy.",
    "link": "https://www.bbc.com/news/articles/c9d6jnn37l2o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-25T22:04:34Z"
  },
  {
    "title": "Trump slaps Canada with 10% tariff increase",
    "description": "Trade tensions reach new heights President Donald Trump announced Saturday that he is raising tariffs on Canada by an additional 10% beyond current levels, intensifying an already strained trade relationship over what he characterized as a misleading advertis…",
    "link": "https://rollingout.com/2025/10/25/trump-increases-canada-tariff-10-percent/",
    "timestamp": "2025-10-25T22:04:31Z"
  },
  {
    "title": "Trump: Hamas must return hostage bodies",
    "description": "United States President Donald Trump said that he felt the peace in the Middle East had a \"good chance of being EVERLASTING,\" however, he said that Hamas would need to return the bodies of deceased ho...",
    "link": "https://biztoc.com/x/5f6bc6b1b0b81ebb",
    "timestamp": "2025-10-25T22:01:41Z"
  },
  {
    "title": "Trump's week in Asia: BBC correspondents on the wins and potential losses",
    "description": "Here's what you should know as the US president arrives for a whirlwind week of diplomacy.",
    "link": "https://www.bbc.com/news/articles/c9d6jnn37l2o",
    "timestamp": "2025-10-25T22:01:29Z"
  },
  {
    "title": "NYT Identifies Anonymous Trump Pal Paying Military During Government Shutdown",
    "description": "The New York Times has identified the anonymous friend of President Donald Trump who donated $130 million to pay U.S. troops during the government shutdown.\nThe post NYT Identifies Anonymous Trump Pal Paying Military During Government Shutdown first appeared …",
    "link": "https://www.mediaite.com/media/news/nyt-identifies-anonymous-trump-pal-paying-military-during-government-shutdown/",
    "timestamp": "2025-10-25T22:00:43Z"
  },
  {
    "title": "Trump’s ‘peace plan’ traps Gaza in limbo",
    "description": "Gaza is now trapped in the limbo of the uncertainty surrounding the Trump plan. The U.S. might prevent Netanyahu from resuming Israel’s genocide, but unless Palestinians gain full control over Gaza’s future, it’s just a slower form of killing.",
    "link": "https://mondoweiss.net/2025/10/trumps-peace-plan-traps-gaza-in-limbo/",
    "timestamp": "2025-10-25T22:00:00Z"
  },
  {
    "title": "Louvre Heist Encapsulates a Western Culture That Will Not Defend Itself",
    "description": "I write from a quiet, mountainous part of Central Europe. The scenery is idyllic, and the fall air is crisp. But much as the case... Read More\nThe post Louvre Heist Encapsulates a Western Culture That Will Not Defend Itself appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/25/louvre-heist-encapsulates-a-western-culture-that-will-not-defend-itself/",
    "timestamp": "2025-10-25T22:00:00Z"
  },
  {
    "title": "Breaking: Trump Hits Canada with Tariff Hike Over 'Hostile Act,' Demands Misleading Regan Ad Be Taken Down",
    "description": "President Donald Trump just let Canada know how angry he is over its fake Reagan ad on tariffs by increasing tariffs on Canada.",
    "link": "https://www.westernjournal.com/breaking-trump-hits-canada-tariff-hike-hostile-act-demands-misleading-regan-ad-taken/",
    "timestamp": "2025-10-25T21:58:42Z"
  },
  {
    "title": "Trump threatens Canada with 10% extra import tax",
    "description": "The ad used the words of former President Ronald Reagan to criticize U.S. tariffs, angering President Trump, who said he would end trade talks with Canada",
    "link": "https://www.wmur.com/article/trump-threatens-canada-extra-import-tax/69155550",
    "timestamp": "2025-10-25T21:56:32Z"
  },
  {
    "title": "Trump: Middle East peace 'good chance to be everlasting'",
    "description": "United States President Donald Trump said that he felt the peace in the Middle East had a \"good chance of being EVERLASTING,\" however, he said that Hamas would need to return the bodies of deceased ho...",
    "link": "https://biztoc.com/x/889630a16bcd0f19",
    "timestamp": "2025-10-25T21:50:28Z"
  },
  {
    "title": "Donald Trump threatens Canada with 10% extra import tax for not pulling down anti-tariffs ad sooner",
    "description": "ABOARD AIR FORCE ONE — President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario.\nThe ad used the words of former President Ronal…",
    "link": "https://biztoc.com/x/80a06ec82f7d782c",
    "timestamp": "2025-10-25T21:50:22Z"
  },
  {
    "title": "Trump says he's increasing tariffs on Canada by 10% after Ontario's Reagan ad (Auzinea Bacon/CNN)",
    "description": "Auzinea Bacon / CNN:\nTrump says he's increasing tariffs on Canada by 10% after Ontario's Reagan ad  —  President Donald Trump said Saturday he is increasing the tariff on Canada by 10% over current levels, further escalating trade tensions over what he called…",
    "link": "https://www.memeorandum.com/251025/p50",
    "timestamp": "2025-10-25T21:50:00Z"
  },
  {
    "title": "MSNBC Guest Issues Warning About Trump's 'Unconstrained' Military Strikes",
    "description": "Tom Nichols, a staff writer at The Atlantic and former professor of strategy at the U.S. Naval War College in Rhode Island, envisioned bleak developments Friday.",
    "link": "https://www.huffpost.com/entry/tom-nichols-warning-trump-unconstrained-military-strikes-drug-boats_n_68fd1b6ae4b011e808869340",
    "timestamp": "2025-10-25T21:45:47Z"
  },
  {
    "title": "Trump Says He’ll Raise Canada Tariff by 10% After Reagan Ad",
    "description": "President Donald Trump said he’s increasing US tariffs on Canada by 10% in response to an anti-tariff advertisement by the province of Ontario that is roiling one of the world’s biggest bilateral trade relationships.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-hell-raise-canada-tariff-by-10-after-reagan-ad",
    "timestamp": "2025-10-25T21:42:54Z"
  },
  {
    "title": "Trump hits Canada with an extra 10% duty because Ontario’s anti-tariff ad ran during the World Series and didn’t come down immediately",
    "description": "President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario.\nThe ad used the words of former President Ronald Reagan to criticize U…",
    "link": "https://biztoc.com/x/9c06484587313d2a",
    "timestamp": "2025-10-25T21:39:17Z"
  },
  {
    "title": "How the anti-establishment candidate won the Irish presidency",
    "description": "Our Dublin correspondent takes a look at the president-elect's campaign and priorities for her seven-year tenure.",
    "link": "https://www.bbc.com/news/articles/cgjd8z8049do",
    "timestamp": "2025-10-25T21:39:16Z"
  },
  {
    "title": "Lawmakers rage over new Trump claim: 'His mental faculties are increasingly compromised'",
    "description": "Donald Trump recently made a claim on social media that had some lawmakers raising an alarm on Saturday.Trump on Friday claimed, \"Just in: Documents show conclusively that Christopher Wray, Deranged Jack Smith, Merrick Garland, Lisa Monaco, and other crooked …",
    "link": "https://www.rawstory.com/trump-mental-faculties/",
    "timestamp": "2025-10-25T21:38:30Z"
  },
  {
    "title": "Trump Hikes Canada’s Tariffs by 10 Percent for Not Pulling Anti-Tariff Ad Immediately",
    "description": "The U.S. president accused an ad campaign by the provincial government of Ontario of misrepresenting Reagan’s speech on tariffs.",
    "link": "https://www.theepochtimes.com/business/trump-hikes-canadas-tariffs-by-10-percent-for-not-pulling-anti-tariff-ad-immediately-5934896",
    "timestamp": "2025-10-25T21:37:50Z"
  },
  {
    "title": "Trump, complaining about Ontario ad, announces additional 10-per-cent tariff on Canada",
    "description": "The tariff will be \"over and above what they are paying now,\" Trump said Saturday on his social media platform Truth Social.",
    "link": "https://www.nationalobserver.com/2025/10/25/news/trump-complaining-about-ontario-ad-announces-additional-10-cent-tariff-canada",
    "timestamp": "2025-10-25T21:36:41Z"
  },
  {
    "title": "Trump announces 10% increase in tariffs on Canada",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Saturday he was increasing tariffs on Canada by an additional 10% \"above what they're paying now,\" just two days after ending trade talks with Ottawa over what Trump said was as a misleading advertisem…",
    "link": "https://www.thestar.com.my/news/world/2025/10/26/trump-announces-10-increase-in-tariffs-on-canada",
    "timestamp": "2025-10-25T21:36:00Z"
  },
  {
    "title": "Trump hits Canada with an extra 10% duty because Ontario’s anti-tariff ad ran during the World Series and didn’t come down immediately",
    "description": "Trump told reporters traveling with him that he had no intention of meeting Canadian Prime Minister Mark Carney at the ASEAN summit in Malaysia.",
    "link": "https://fortune.com/2025/10/25/trump-canada-extra-10-percent-tariff-world-series-ontario-ad/",
    "timestamp": "2025-10-25T21:29:28Z"
  },
  {
    "title": "Trump says he's adding another 10% tariff on Canada in retaliation for its Reagan ad",
    "description": "President Donald Trump announced a 10% tariff increase on Canada on Truth Social.\nAlex Wong/Getty Images\nTrump said in a Truth Social post that he'll increase tariffs on Canada by another 10%.\nTrump announced the increase in response to an anti-tariff ad made…",
    "link": "https://biztoc.com/x/31da0b840feea52a",
    "timestamp": "2025-10-25T21:28:18Z"
  },
  {
    "title": "Louvre heist was inside job, detectives believe",
    "description": "Detectives investigating the £76m heist at the Louvre have uncovered evidence of an inside job, The Telegraph understands. Sources close to the investigation claim that digital forensic evidence shows a member of security was in contact before the heist with …",
    "link": "https://freerepublic.com/focus/f-news/4348617/posts",
    "timestamp": "2025-10-25T21:26:00Z"
  },
  {
    "title": "Trump aims to start his Asia trip with dealmaking in Malaysia",
    "description": "President Donald Trump plans to burnish his reputation as an international dealmaker on Sunday by solidifying a trade agreement with Malaysia and overseeing the signing of an expanded ceasefire between Cambodia and Thailand, two nations that skirmished along …",
    "link": "https://japantoday.com/category/world/trump-aims-to-start-his-asia-trip-with-dealmaking-in-malaysia",
    "timestamp": "2025-10-25T21:24:47Z"
  },
  {
    "title": "Trump announces 10% increase in tariffs on Canada",
    "description": "President Donald Trump said on Saturday he was increasing tariffs on Canada by an additional 10% \"above what they're paying now,\" just two days after ending ...",
    "link": "https://finance.yahoo.com/news/trump-announces-10-increase-tariffs-212419153.html",
    "timestamp": "2025-10-25T21:24:19Z"
  },
  {
    "title": "'I'm not done', Kamala Harris tells the BBC's Laura Kuenssberg",
    "description": "The former vice president made her strongest suggestion to date that she will make another presidential bid in 2028 - after losing to Donald Trump last year.",
    "link": "https://www.bbc.com/news/videos/cj0e9d5126eo",
    "timestamp": "2025-10-25T21:22:28Z"
  },
  {
    "title": "Trump meets Qatar leaders on way to Asia",
    "description": "U.S. President Donald Trump on Saturday thanked Qatar's emir and prime minister for being a &quot;big factor&quot; in helping secure a Gaza ceasefire deal, during a refueling stop on his way to Asia. The Qatari leaders boarded Air Force One when it landed at …",
    "link": "https://japantoday.com/category/world/trump-meets-qatar-leaders-on-way-to-asia",
    "timestamp": "2025-10-25T21:20:54Z"
  },
  {
    "title": "Venezuela's Maduro says U.S. is fabricating a war",
    "description": "Venezuela’s President Nicolás Maduro said the U.S. government is forging a war against him as the world's biggest warship approached the South American country, while moving to revoke the citizenship of an opponent he accuses of egging on an invasion. Maduro …",
    "link": "https://japantoday.com/category/world/venezuela%27s-maduro-says-the-us-is-fabricating-a-war-seeks-to-revoke-citizenship-of-opponent-lopez",
    "timestamp": "2025-10-25T21:20:46Z"
  },
  {
    "title": "Trump punishes Canada with 10% extra import tax for not pulling down anti-tariffs ad sooner",
    "description": "President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario. The ad used the words of former President Ronald Reagan to criticize U…",
    "link": "https://japantoday.com/category/world/trump-punishes-canada-with-10-extra-import-tax-for-not-pulling-down-anti-tariffs-ad-sooner",
    "timestamp": "2025-10-25T21:20:40Z"
  },
  {
    "title": "U.S. could hit Russia with more sanctions over Ukraine war, but also wants Europe to increase pressure",
    "description": "U.S. President Donald Trump's administration has prepared additional sanctions it could use to target key areas of Russia's economy if President Vladimir Putin continues to delay ending Moscow's war in Ukraine, according to a U.S. official and another person …",
    "link": "https://japantoday.com/category/world/us-could-hit-russia-with-more-sanctions-over-ukraine-war-but-also-wants-europe-to-increase-pressure",
    "timestamp": "2025-10-25T21:20:25Z"
  },
  {
    "title": "Trump says he won't waste time meeting Putin unless Ukraine deal is likely to happen soon",
    "description": "President Trump refuses to waste time on unproductive summit with Vladimir Putin, citing need for guaranteed Ukraine peace agreement before any meeting occurs.",
    "link": "https://www.foxnews.com/politics/trump-says-he-wont-waste-time-meeting-putin-unless-ukraine-deal-likely-happen-soon",
    "timestamp": "2025-10-25T21:19:54Z"
  },
  {
    "title": "Trump says he’s increasing tariffs on Canada by 10% after Ontario’s Reagan ad | CNN Business",
    "description": "President Donald Trump said Saturday he is increasing the tariff on Canada by 10% over current levels, further escalating trade tensions over what he called a “fake” ad that featured parts of an anti-tariff speech by former President Ronald Reagan in 1987.",
    "link": "https://www.cnn.com/2025/10/25/business/trump-tariffs-canada-reagan",
    "timestamp": "2025-10-25T21:18:49Z"
  },
  {
    "title": "Trump Slaps Canada With Tariff Hike After ‘Fraudulent’ Ad: ‘Caught, Red Handed!’",
    "description": "President Donald Trump said he is slapping an additional 10% tariff on Canada after a \"fraudulent\" TV advertisement where Ronald Reagan bashes tariffs ran\nThe post Trump Slaps Canada With Tariff Hike After ‘Fraudulent’ Ad: ‘Caught, Red Handed!’ first appeared…",
    "link": "https://www.mediaite.com/politics/trump-slaps-canada-with-tariff-hike-after-fraudulent-ad-caught-red-handed/",
    "timestamp": "2025-10-25T21:18:46Z"
  },
  {
    "title": "Breaking: Trump punishes Canada with 10pc tariff increase over TV ad stoush",
    "description": "US President Donald Trump says he plans to hike tariffs on imports of Canadian goods by an extra 10 per cent because of an anti-tariff television ad aired by the province of Ontario.",
    "link": "https://www.abc.net.au/news/2025-10-26/trump-punishes-canada-with-10pc-tariff-increase-over-tv-ad/105935220",
    "timestamp": "2025-10-25T21:17:32Z"
  },
  {
    "title": "US could move on Venezuela to curb Russian and Chinese influence – whistleblower",
    "description": "The US could invade Venezuela to establish control and deny “white space” to Russia or China, Jordan Goudreau told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626963-us-move-venezuela-russia-china/",
    "timestamp": "2025-10-25T21:17:15Z"
  },
  {
    "title": "Trump says he's adding another 10% tariff on Canada in retaliation for its Reagan ad",
    "description": "Trump said he will increase tariffs on Canada by another 10% in response to a Canadian anti-tariff ad featuring former President Ronald Reagan.",
    "link": "https://www.businessinsider.com/trump-canada-tariffs-ronald-reagan-ad-ontario-2025-10",
    "timestamp": "2025-10-25T21:17:01Z"
  },
  {
    "title": "Hakeem Jeffries finally bends the knee to socialist Zohran Mamdani ahead of early voting",
    "description": "'Has relentlessly focused on addressing the affordability crisis and explicitly committed to being a mayor for all New Yorkers'",
    "link": "https://www.wnd.com/2025/10/hakeem-jeffries-finally-bends-knee-socialist-zohran-mamdani/",
    "timestamp": "2025-10-25T21:16:42Z"
  },
  {
    "title": "Europe fights to avoid being sidelined by Trump’s world-shaping plans",
    "description": "When President Donald Trump took the stage in Egypt to hail the U.S.-brokered ceasefire deal between Israel and Hamas, a row of world leaders stood behind him like extras in a political drama. It was a telling image. European governments have struggled to pla…",
    "link": "https://japantoday.com/category/features/opinions/europe-fights-to-avoid-being-sidelined-by-trump%E2%80%99s-world-shaping-plans",
    "timestamp": "2025-10-25T21:15:52Z"
  },
  {
    "title": "Hunter Biden Reaches Out To Trump Voters in Closing Message",
    "description": "Hunter Biden reached out to supporters of Trump who might have a poor opinion of him, saying it's important not to confuse Trump's voters with Trump.\nThe post Hunter Biden Reaches Out To Trump Voters in Closing Message first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/hunter-biden-reaches-out-to-trump-voters-in-closing-message/",
    "timestamp": "2025-10-25T21:13:21Z"
  },
  {
    "title": "Hamas official claims return of hostages' bodies a matter of 'months'",
    "description": "Moussa Abu Marzouk, a senior Hamas official, insists Hamas has no more hostages to hand over, claims transfer of remaining 13 hostages' bodies could take 'months.' 'This is not a matter of weeks.'",
    "link": "https://www.israelnationalnews.com/news/416799",
    "timestamp": "2025-10-25T21:13:00Z"
  },
  {
    "title": "They're Asking for It: Majority Of Californians Now Back Gavin Newsom's Gerrymandering Gambit, Poll Says",
    "description": "A strong majority of Californians now support Governor Gavin Newsom's gerrymandering schemes, which will likely come to pass.",
    "link": "https://www.westernjournal.com/asking-majority-californians-now-back-gavin-newsoms-gerrymandering-gambit-poll-says/",
    "timestamp": "2025-10-25T21:12:41Z"
  },
  {
    "title": "Trump raises tariffs on Canadian goods in response to Reagan advert",
    "description": "He had already walked away from trade talks with Canada on Thursday after the commercial, which he called a \"fraud\", initially aired.",
    "link": "https://www.bbc.com/news/articles/cx2ljgrm78zo",
    "timestamp": "2025-10-25T21:12:12Z"
  },
  {
    "title": "Trump announces 10% increase in tariffs on Canada",
    "description": "President Donald Trump said on Saturday he was increasing tariffs on Canada by an additional 10% \"above what they're paying now,\" just two days after ending ...",
    "link": "https://finance.yahoo.com/news/trump-announces-10-increase-tariffs-210822553.html",
    "timestamp": "2025-10-25T21:08:22Z"
  },
  {
    "title": "Trump Names SEC Crypto Task Force Head Selig as Next Nominee to Run U.S. CFTC",
    "description": "Trump Names SEC Crypto Task Force Head Selig as Next Nominee to Run U.S. CFTC\nIf confirmed, current SEC official Mike Selig would take over the U.S. commodities watchdog as it's poised to be given wide authority over crypto.\nPresident Donald Trump has named h…",
    "link": "https://biztoc.com/x/174ab9009bc378fb",
    "timestamp": "2025-10-25T21:06:27Z"
  },
  {
    "title": "Russia’s ‘disposable-goods’ war economy is getting busier but poorer, and Trump’s new sanctions could trigger a recession, analysts say",
    "description": "\"But the country has exhausted its reserves of manufacturing capacity and manpower.\"",
    "link": "https://fortune.com/2025/10/25/russia-economy-recession-ukraine-war-us-sanctions-rosneft-lukoil-vladimir-putin/",
    "timestamp": "2025-10-25T21:06:24Z"
  },
  {
    "title": "Trump punishes Canada with 10% extra import tax for not pulling down anti-tariffs ad sooner",
    "description": "President Donald Trump said on Saturday that he plans to hike tariffs on imports of Canadian goods by an extra 10% because of an anti-tariff television ad aired by the province of Ontario.",
    "link": "https://www.wpxi.com/news/local/trump-punishes-canada-with-10-extra-import-tax-not-pulling-down-anti-tariffs-ad-sooner/7EPFDPBQUJFUHO3HKLHTEVEH2U/",
    "timestamp": "2025-10-25T21:05:38Z"
  }
]