[
  {
    "title": "Texas hospital that discharged woman with doomed pregnancy violated law",
    "description": "Texas hospital that discharged woman with doomed pregnancy violated lawtwincities.com",
    "link": "https://www.twincities.com/2025/06/04/abortion-texas-hospital/",
    "timestamp": "2025-06-04T15:42:53Z"
  },
  {
    "title": "Dem Strategist Says Party Should Ditch ‘Liberal Joe Rogan’ Plan For … Jasmine Crockett",
    "description": "Max Burns wrote in an op-ed published in The Hill that Democratic Texas Rep. Jasmine Crockett is one of Democrats' \"rawest and most watchable communicators.\"",
    "link": "https://dailycaller.com/2025/06/04/dem-strategist-liberal-joe-rogan-jasmine-crockett/",
    "timestamp": "2025-06-04T15:42:45Z"
  },
  {
    "title": "Anderson Cooper Hilariously Rejects Birthday Offer From Fellow CNN Reporter: 'Uh, I'm Good'",
    "description": "The 58-year-old kindly vetoed a gift from fellow CNN reporter Donie O'Sullivan, who reported live from MyPillow CEO Mike Lindell's defamation trial in Colorado.",
    "link": "https://www.huffpost.com/entry/anderson-cooper-donie-osullivan-mypillow-birthday-offer_n_68401b98e4b0d48557aa7464",
    "timestamp": "2025-06-04T15:42:20Z"
  },
  {
    "title": "Semiconductor Supplier GlobalFoundries to Spend $16B to Boost US Chip Production",
    "description": "In This Article:\nKey Takeaways\n-\nGlobalFoundries plans to spend more than $16 billion to increase chip production in the U.S.\n-\nThe supplier of major tech firms said the move followed calls by President Donald Trump to increase domestic manufacturing.\n-\nGloba…",
    "link": "https://biztoc.com/x/bdddaf017dba10c0",
    "timestamp": "2025-06-04T15:41:32Z"
  },
  {
    "title": "Slog AM: Layoffs at SIFF, FBI Raids Nazi House in Lacey, Harvey Milk Ship Too Gay—Even For The Navy",
    "description": "The Stranger's morning news roundup.\n \n by Vivian McCall\n \n \n \n SIFF Layoffs: The nonprofit that runs the Seattle International Film Festival (and many cool movie theaters in town) is laying off nine full-time workers across multiple departments, according to…",
    "link": "https://www.thestranger.com/slog-am/2025/06/04/80086578/slog-am-layoffs-at-siff-fbi-raids-nazi-house-in-lacey-harvey-milk-ship-too-gay-even-for-the-navy",
    "timestamp": "2025-06-04T15:41:00Z"
  },
  {
    "title": "CBO: Trump 'Big Beautiful Bill Act' could add $2.4T to deficit, leave 11 million without health insurance",
    "description": "The budget office is projecting 10.9 million more people will be uninsured in 2034 because of changes to health care.",
    "link": "https://abc30.com/post/trump-urges-senators-get-big-tax-bill-done-july-4th/16655506/",
    "timestamp": "2025-06-04T15:40:59Z"
  },
  {
    "title": "Elon Musk may be the only person in the world who can criticize Donald Trump in public. For now",
    "description": "Donald Trump gave Elon Musk a \"key to the White House\" after Musk criticized Trump's budget bill. Now Musk has criticized the same bill with even stronger language — and Trump has yet to respond.\nALLISON ROBBERT/AFP via Getty Images\nIf you come at Donald Trum…",
    "link": "https://biztoc.com/x/18134d89690f800e",
    "timestamp": "2025-06-04T15:40:55Z"
  },
  {
    "title": "Weak private sector jobs report has Trump fuming at Powell to lower interest rates",
    "description": "The labor market is flashing a warning sign: Private employers added just 37,000 jobs in May, according to Wednesday’s ADP National Employment Report. That’s the weakest reading since early 2022 and well below Wall Street’s already muted forecast of 110,000 j…",
    "link": "https://qz.com/adp-report-may-jobs-donald-trump-fed-jerome-powell-1851783583",
    "timestamp": "2025-06-04T15:40:00Z"
  },
  {
    "title": "Texas hospital that discharged woman with doomed pregnancy violated the law, a federal inquiry finds",
    "description": "Kyleigh Thurman ultimate lost part of her reproductive system.",
    "link": "https://www.bostonherald.com/2025/06/04/abortion-texas-hospital/",
    "timestamp": "2025-06-04T15:37:09Z"
  },
  {
    "title": "Trump budget bill will add $2.4 trillion to the deficit and leave 10.9 million more uninsured, CBO says",
    "description": "President Donald Trump’s big bill will cut taxes by $3.75 trillion but increase deficits by $2.4 trillion and leave 10.9 million more people without health insurance over the next decade.",
    "link": "https://www.clickorlando.com/news/politics/2025/06/04/trumps-big-bill-will-cut-taxes-by-37t-and-add-24t-to-deficit-budget-office-says/",
    "timestamp": "2025-06-04T15:36:07Z"
  },
  {
    "title": "The Punishment For This L.A. Deputy Convicted of Excessive Force Against a Black Woman Will Make Your Blood Boil",
    "description": "This cop just dodged a maximum 10 year prison sentence for assaulting an unarmed woman.\nThe post The Punishment For This L.A. Deputy Convicted of Excessive Force Against a Black Woman Will Make Your Blood Boil appeared first on The Root.",
    "link": "https://www.theroot.com/the-punishment-for-this-l-a-deputy-convicted-of-excess-2000043736",
    "timestamp": "2025-06-04T15:35:00Z"
  },
  {
    "title": "Texas hospital that discharged woman with doomed pregnancy violated the law, a federal inquiry finds",
    "description": "A Texas hospital that repeatedly sent a woman who was bleeding and in pain home without ending her nonviable, life-threatening pregnancy violated the law, according to a newly released federal investigation",
    "link": "https://abcnews.go.com/US/wireStory/texas-hospital-discharged-woman-doomed-pregnancy-violated-law-122492295",
    "timestamp": "2025-06-04T15:34:48Z"
  },
  {
    "title": "Trump sons disavow Trump-linked memecoin wallet",
    "description": "Even Donald Trump’s sons are finding their family’s crypto business a bit cryptic.Read more...",
    "link": "https://qz.com/trump-sons-disavow-trump-linked-memecoin-wallet-1851783578",
    "timestamp": "2025-06-04T15:34:00Z"
  },
  {
    "title": "US judge dismisses DNC election commission lawsuit, in a victory for Trump",
    "description": "U.S. District Judge Amir Ali ruled that the DNC failed to prove imminent harm from President Donald Trump’s executive order affecting the Federal Election Committee’s regulatory independence.",
    "link": "https://www.foxnews.com/politics/us-judge-dismisses-dnc-election-lawsuit-victory-trump",
    "timestamp": "2025-06-04T15:30:55Z"
  },
  {
    "title": "Elon Musk's Denouncement of Trump's Tax Bill Sparks GOP Tensions",
    "description": "The former head of the Department of Government Efficiency said the president's budget package was a \"disgusting abomination.\"",
    "link": "https://www.newsweek.com/elon-musk-denouncement-trump-tax-bill-sparks-gop-tensions-2080879",
    "timestamp": "2025-06-04T15:30:49Z"
  },
  {
    "title": "Judge overrules Trump and tells prisons to keep giving trans inmates their meds in blockbuster decision",
    "description": "President has signed several orders ruling the two 'immutable sexes' are 'not changeable'",
    "link": "https://www.wnd.com/2025/06/judge-overrules-trump-and-tells-prisons-to-keep-giving-trans-inmates-their-meds-in-blockbuster-decision/",
    "timestamp": "2025-06-04T15:30:21Z"
  },
  {
    "title": "Elon Musk may be the only person in the world who can criticize Donald Trump in public. For now.",
    "description": "Donald Trump always fires back at critics — but for now, he's staying quiet about Elon Musk. That tells you a lot about their alliance.",
    "link": "https://www.businessinsider.com/donald-trump-elon-musk-budget-bill-response-attack-explained-why-2025-6",
    "timestamp": "2025-06-04T15:30:13Z"
  },
  {
    "title": "Trump to Use Emergency Powers to Boost U.S. Critical Minerals Industry",
    "description": "In a bid to wean the U.S. critical minerals supply chain off China, U.S. President Donald Trump plans to use emergency powers under the Defense Production Act to bolster domestic production and processing of these metals vital for the energy and defense indus…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-to-Use-Emergency-Powers-to-Boost-US-Critical-Minerals-Industry.html",
    "timestamp": "2025-06-04T15:30:00Z"
  },
  {
    "title": "Clarence Thomas' Former Clerk Warns Trump Did Something 'Truly Outrageous'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA law professor and former clerk to conservative Supreme Court Justice Clarence Thomas called President Donald Trump's decision to publicly turn against the Federalist Society and one of its top figures, Leona…",
    "link": "https://biztoc.com/x/bef0edefcae5d251",
    "timestamp": "2025-06-04T15:29:58Z"
  },
  {
    "title": "White House responds to the latest Elon Musk jab",
    "description": "It appears that some distance from Washington, D.C. has given Tesla CEO Elon Musk some clarity about President Donald Trump and his economic agenda. \nTrump has repeatedly said that balancing the budget was one of his top priorities. In fact, during a recent c…",
    "link": "https://biztoc.com/x/4664ffbc855a1a9b",
    "timestamp": "2025-06-04T15:29:45Z"
  },
  {
    "title": "Schumer: Republican bill will raise energy prices 10 percent",
    "description": "Senate Democratic Leader Chuck Schumer (N.Y.) is warning that the House-passed budget reconciliation bill will cause energy prices to increase by 10 percent because it will “kill” clean energy programs around the country, increasing the nation’s reliance on f…",
    "link": "https://biztoc.com/x/9a7aab65cf64adea",
    "timestamp": "2025-06-04T15:29:39Z"
  },
  {
    "title": "Under Trump's 'big, beautiful' bill, over 10 million more Americans projected to lose insurance",
    "description": "There would be an increase of 10.9 million people without health insurance under US President Donald Trump's big beautiful bill by 2034,  according to an analysis released Wednesday by the nonpartisan Congressional Budget Office. The bill will cut taxes by $3…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/under-trumps-big-beautiful-bill-over-10-million-more-americans-projected-to-lose-insurance/articleshow/121627516.cms",
    "timestamp": "2025-06-04T15:29:18Z"
  },
  {
    "title": "Iran’s Khamenei Rejects U.S. Nuclear Proposal, Vows to Keep Enriching Uranium",
    "description": "Iran's Ayatollah Khamenei: The U.S. and Israel \"can’t do a damn thing about\" regime's nuclear weapons program. \nThe post Iran’s Khamenei Rejects U.S. Nuclear Proposal, Vows to Keep Enriching Uranium first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/irans-khamenei-rejects-u-s-nuclear-proposal-vows-to-keep-enriching-uranium/",
    "timestamp": "2025-06-04T15:28:40Z"
  },
  {
    "title": "US Said to Deny Air Cover to Europe Force in Postwar Ukraine",
    "description": "The US is refusing to provide air defenses to back the “reassurance force” the UK and France are planning in a postwar Ukraine, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/us-said-to-deny-air-cover-to-europe-force-in-postwar-ukraine",
    "timestamp": "2025-06-04T15:28:21Z"
  },
  {
    "title": "Carney says Canada will take ‘some time’ to respond to doubled U.S. metal tariffs",
    "description": "WASHINGTON — Prime Minister Mark Carney says Canada will take “some time” on its response to increased U.S. tariffs on steel and aluminum. Tariffs on imports of steel and aluminum to the United States increased to 50 per cent Wednesday after President Donald …",
    "link": "https://financialpost.com/pmn/carney-says-canada-will-take-some-time-to-respond-to-doubled-u-s-metal-tariffs",
    "timestamp": "2025-06-04T15:28:14Z"
  },
  {
    "title": "Marketing Authoritarianism",
    "description": "Mimicking his Salvadoran ally Nayib Bukele, Trump is using spectacles of disappearance to project a total power he does not yet possess.",
    "link": "https://jewishcurrents.org/marketing-authoritarianism-trump-bukele-disappearance-videos",
    "timestamp": "2025-06-04T15:23:12Z"
  },
  {
    "title": "Not Your Average Nightclub Raid: Inside DHS’s Shocking Discovery Near Charleston, S.C.",
    "description": "Here's yet another reason why we can't have open borders. Over the weekend, United States Immigration and Customs Enforcement (ICE) finally responded to information that a nightclub called \"The Alamo,\" which was located in an industrial area in Summerville, S…",
    "link": "https://freerepublic.com/focus/f-bloggers/4320939/posts",
    "timestamp": "2025-06-04T15:22:56Z"
  },
  {
    "title": "Clarence Thomas' Former Clerk Warns Trump Did Something 'Truly Outrageous'",
    "description": "John Yoo reacts to the president turning on legal conservatives following a pivotal tariff ruling.",
    "link": "https://www.newsweek.com/clarence-thomas-supreme-court-clerk-warns-donald-trump-outrageous-2080860",
    "timestamp": "2025-06-04T15:22:46Z"
  },
  {
    "title": "Wall Street’s rally eases off the accelerator following discouraging updates on the economy",
    "description": "Traders upped expectations for cuts to interest rates by the Federal Reserve.",
    "link": "https://www.bostonherald.com/2025/06/04/financial-markets-june-4/",
    "timestamp": "2025-06-04T15:22:19Z"
  },
  {
    "title": "Huh, Trump's Numbers Crashing With Latino Voters",
    "description": "After Latino voters moved toward President Donald Trump in November, a new in-depth survey of this demographic shows their support for him could be breaking, according to polling shared first with POLITICO.\nThroughout the president’s first few months in offic…",
    "link": "https://crooksandliars.com/2025/06/trumps-number-crashing-latino-voters-cant",
    "timestamp": "2025-06-04T15:21:27Z"
  },
  {
    "title": "CBO: Trump 'Big Beautiful Bill Act' could add $2.4T to deficit, leave 11 million without health insurance",
    "description": "The budget office is projecting 10.9 million more people will be uninsured in 2034 because of changes to health care.",
    "link": "https://6abc.com/post/trump-urges-senators-get-big-tax-bill-done-july-4th/16655506/",
    "timestamp": "2025-06-04T15:20:31Z"
  },
  {
    "title": "Trump Has Taken Fewer Briefings Than Biden and Obama. Now Officials Are Turning to Fox News for Inspiration: Report",
    "description": "President Donald Trump has received fewer intelligence briefings than his predecessors, leading officials to consider remaking the briefing resemble Fox News.",
    "link": "https://www.ibtimes.com/trump-has-taken-fewer-briefings-biden-obama-now-officials-are-turning-fox-news-inspiration-3775153",
    "timestamp": "2025-06-04T15:20:13Z"
  },
  {
    "title": "Steve Bannon Says 'President Trump Is A Very Sophisticated Businessman,' Calls Scott Bessent 'Safe Pair Of Hands'",
    "description": "Former White House chief strategist Steve Bannon had high praise for both President Donald Trump and Treasury Secretary Scott Bessent during his appearance at the Semafor World Economy Summit in April, calling Trump a \"very sophisticated businessman\" and desc…",
    "link": "https://biztoc.com/x/a5cddd791fda0c5b",
    "timestamp": "2025-06-04T15:18:51Z"
  },
  {
    "title": "Trump Says China’s Xi Is ‘Extremely Hard to Make a Deal With’",
    "description": "President Donald Trump called Xi Jinping \"VERY TOUGH, AND EXTREMELY HARD TO MAKE A DEAL WITH\" in a late-night social media post, raising questions about the fragile economic truce between the US and China. Tensions between the two countries are increasing, wi…",
    "link": "https://biztoc.com/x/20a1155c9afa9058",
    "timestamp": "2025-06-04T15:18:35Z"
  },
  {
    "title": "Miller Hits Back: Trump Budget Cuts $1.6 Trillion, Not Adds It",
    "description": "White House Deputy Chief of Staff Stephen Miller on Tuesday defended President Donald Trump’s flagship budget bill, pushing back against criticism that it raises the federal deficit.\nIn comments shared with reporters, Miller said confusion stems from critics …",
    "link": "https://biztoc.com/x/5ba18d9220efc1f4",
    "timestamp": "2025-06-04T15:18:17Z"
  },
  {
    "title": "USNS Harvey Milk renaming: Who was Harvey Milk and why does the US Navy want a new name?",
    "description": "Defense Secretary Pete Hegseth has directed the Navy to rename the USNS Harvey Milk during Pride Month, sparking fierce backlash. The decision, part of an effort to \"reestablish the warrior culture,\" aligns with the Trump administration's priorities.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/usns-harvey-milk-renaming-who-was-harvey-milk-and-why-does-the-us-navy-want-a-new-name/articleshow/121627039.cms",
    "timestamp": "2025-06-04T15:18:17Z"
  },
  {
    "title": "Stubb calls Trump and Zelensky; Häkkänen discusses Ukraine in Brussels",
    "description": "President Alexander Stubb has maintained frequent contacts with Donald Trump since his return to the White House in January.",
    "link": "https://yle.fi/a/74-20165806",
    "timestamp": "2025-06-04T15:16:56Z"
  },
  {
    "title": "Trump More Popular Than Bush, Obama Were At This Point In Second Terms",
    "description": "President Trump’s approval rating beats that of former presidents Bush and Obama at the same point in their second terms, a new Real Clear Politics poll shows.",
    "link": "https://dailycaller.com/2025/06/04/trump-more-popular-bush-obama-second-terms/",
    "timestamp": "2025-06-04T15:16:52Z"
  },
  {
    "title": "Why Poland’s dramatic election result is a setback for Europe",
    "description": "Inside Politics podcast with Hugh Linehan",
    "link": "https://www.irishtimes.com/podcasts/inside-politics/why-polands-dramatic-election-result-is-a-setback-for-europe/",
    "timestamp": "2025-06-04T15:15:08Z"
  },
  {
    "title": "Trump Rescinds Biden-Era Guidance Requiring Emergency Room Doctors to Perform Abortions",
    "description": "The Trump administration rescinded the guidance issued by the Biden administration to require emergency room doctors to perform abortions. In 1986, Congress passed the Emergency... Read More\nThe post Trump Rescinds Biden-Era Guidance Requiring Emergency Room …",
    "link": "https://www.dailysignal.com/2025/06/04/trump-rescinds-biden-era-guidance-requiring-emergency-room-doctors-to-perform-abortions/",
    "timestamp": "2025-06-04T15:13:49Z"
  },
  {
    "title": "Donald Trump's 50 percent tariffs on steel and aluminum imports begin",
    "description": "President Trump’s steel and aluminum tariffs doubled on Wednesday to 50 percent, in a dramatic move aimed at protecting U.S. industries that economists say could increase prices for American consumers. The tariff hike on foreign metals went into effect just a…",
    "link": "https://thehill.com/business/5331938-donald-trump-double-steel-aluminum-tariffs/",
    "timestamp": "2025-06-04T15:12:07Z"
  },
  {
    "title": "BarkBox CEO Apologizes for 'Disrespectful' Message About Pride Merchandise",
    "description": "The company's approach to Pride Month sparked backlash from both conservatives and the LGBTQ+ community.",
    "link": "https://www.newsweek.com/barkbox-ceo-apologizes-disrespectful-message-lgbtq-pride-merchandise-2080901",
    "timestamp": "2025-06-04T15:11:12Z"
  },
  {
    "title": "CBO: Trump bill will add $2.4T to deficit, leave 11 million without health insurance - NewsBreak",
    "description": "CBO: Trump bill will add $2.4T to deficit, leave 11 million without health insurance - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4037395344103-cbo-trump-bill-will-add-2-4t-to-deficit-leave-11-million-without-health-insurance?s=a2&amp;share_destination_id=MTc0NjgxNTIwLTE3NDkwNDk3NDY4MTI%3D&amp;pd=0BowdsUz&amp;hl=en_US&amp;send_time=1749049746&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.21.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-control%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q2-v4",
    "timestamp": "2025-06-04T15:11:12Z"
  },
  {
    "title": "‘Big Balls’ Is Officially a Full-Time Government Employee",
    "description": "The first wave of DOGE staffers was supposed to be gone after 130 days. Instead, core members of the team have signed on for the long haul.",
    "link": "https://www.wired.com/story/big-balls-young-doge-converted-into-full-time-government-employees/",
    "timestamp": "2025-06-04T15:08:17Z"
  },
  {
    "title": "Nintendo fans stoked for Switch 2 ‘mega launch’",
    "description": "With shops planning midnight launch parties after a run on pre-orders, Nintendo releases the Switch 2 on Thursday.\nThe post Nintendo fans stoked for Switch 2 ‘mega launch’ appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/nintendo-fans-stoked-for-switch-2-mega-launch/article",
    "timestamp": "2025-06-04T15:07:20Z"
  },
  {
    "title": "Donald Trump Finds His Approval Rating Sinking Once More",
    "description": "Pollster G. Elliott Morris' tracker shows that on the issue of the economy, Trump's approval rating is underwater by 15.75 points.",
    "link": "https://biztoc.com/x/2ff4aacae621c6eb",
    "timestamp": "2025-06-04T15:07:10Z"
  },
  {
    "title": "U.S. and European trade negotiators make progress but no breakthrough yet",
    "description": "The European Union’s top trade negotiator, Maroš Šefčovič, met Wednesday with his American counterpart, U.S. Trade Representative Jamieson Greer, on the sidelines of a meeting of the Organization for Economic Cooperation and Development.",
    "link": "https://www.pbs.org/newshour/economy/u-s-and-european-trade-negotiators-make-progress-but-no-breakthrough-yet",
    "timestamp": "2025-06-04T15:06:30Z"
  },
  {
    "title": "Economist Details How GOP Medicaid Cuts Would Be Disastrous for Everyone—Except the Super-Rich",
    "description": "The impacts of congressional Republicans' proposed Medicaid cuts would be most destructive for those directly impacted—the millions of people who would be forced to pay more for coverage, subjected to onerous red tape, or kicked off benefits entirely.\n\nBut ec…",
    "link": "https://www.commondreams.org/news/economist-medicaid-cuts",
    "timestamp": "2025-06-04T15:06:28Z"
  },
  {
    "title": "Tackling America’s Diploma Divide",
    "description": "It is a cliché of American politics that Trumpian populism was fueled by the divide between arrogant college graduates brandishing elite degrees and regular folks with a high-school diploma or less. But it is a cliché that contains more than a kernel of truth.",
    "link": "https://www.project-syndicate.org/commentary/diploma-divide-driving-trump-war-on-universities-by-andres-velasco-2025-06",
    "timestamp": "2025-06-04T15:06:24Z"
  },
  {
    "title": "Elon Musk Declares Open War on Republican Party",
    "description": "After spending hundreds of millions and most of his time getting Donald Trump elected, billionaire Elon Musk has openly declared war against Republicans. In an ominous tweet, Musk vowed that \"in November next year, we fire all politicians who betrayed the Ame…",
    "link": "https://futurism.com/elon-musk-declares-war-republicans",
    "timestamp": "2025-06-04T15:04:49Z"
  },
  {
    "title": "‘WHAT The F—CK??’ Woman at Anti-Trump Town Hall Makes Stunning Claim — Workers Forced to Write Trump Fan Letters",
    "description": "A DOD worker at an anti-Trump town hall made the stunning claim that new employees are required to submit essays on  their support for President Donald Trump.\nThe post ‘WHAT The F—CK??’ Woman at Anti-Trump Town Hall Makes Stunning Claim — Workers Forced to Wr…",
    "link": "https://www.mediaite.com/media/news/what-the-f-ck-woman-at-anti-trump-town-hall-makes-stunning-claim-workers-forced-to-write-trump-fan-letters/",
    "timestamp": "2025-06-04T15:03:04Z"
  },
  {
    "title": "Republican Tax Bill Adds $2.4 Trillion to US Deficits, CBO Says",
    "description": "The House-passed version of President Donald Trump’s tax and spending bill would add $2.42 trillion to US budget deficits over the next decade, according to a new estimate from the nonpartisan Congressional Budget Office.",
    "link": "https://financialpost.com/pmn/business-pmn/republican-tax-bill-adds-2-4-trillion-to-us-deficits-cbo-says",
    "timestamp": "2025-06-04T15:02:45Z"
  },
  {
    "title": "Trump blasts Jerome Powell after new report shows lowest jobs growth in two years",
    "description": "President Trump ramped up his call for Fed Chair Jerome Powell to lower interest rates after a new report showed sluggish hiring in May.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/04/trump-jerome-powell-jobs-reports/84026470007/",
    "timestamp": "2025-06-04T15:01:13Z"
  },
  {
    "title": "Germany launches bid for more Ukraine air defense",
    "description": "At a meeting of Kyiv's allies in Brussels, German Defense Minister Boris Pistorius announced a new initiative to organize additional air defense systems for Ukraine. DW has more. Germany is making a new attempt on the international stage to strengthen and mai…",
    "link": "https://www.dw.com/en/germany-launches-bid-for-more-ukraine-air-defense/live-72788529",
    "timestamp": "2025-06-04T15:01:00Z"
  },
  {
    "title": "US Military Backs Bitcoin Reserve To Counter China, Says Senator Lummis",
    "description": "United States Senator Cynthia Lummis (R-Wyo.) says elements of the nation’s uniformed leadership are now “big supporters” of plans to build a Strategic Bitcoin Reserve (SBR), marking the first time a sitting law-maker has publicly claimed high-level military …",
    "link": "https://bitcoinist.com/us-military-bitcoin-reserve-counter-china/",
    "timestamp": "2025-06-04T15:00:41Z"
  },
  {
    "title": "Helen Lewis: The Dark Side of Genius",
    "description": "In \"The Genius Myth\", the journalist delivers a sharp, funny takedown of our obsession with \"brilliant\" men, showing that behind every so-called genius is a crowd and a big PR machine.",
    "link": "https://reason.com/podcast/2025/06/04/helen-lewis-the-dark-side-of-genius/",
    "timestamp": "2025-06-04T15:00:11Z"
  },
  {
    "title": "How the MAGA Movement Is Erasing the Legacy of #MeToo",
    "description": "Ben Schwartz\n\n\n\nSexual predators are getting free passes from Donald Trump and the right-wing mediasphere. \r\n\n\r\n\n\nThe post How the MAGA Movement Is Erasing the Legacy of #MeToo appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=558640",
    "timestamp": "2025-06-04T15:00:00Z"
  },
  {
    "title": "How Trump’s big bill will affect taxes, deficit and health care, according to the budget office",
    "description": "President Donald Trump’s big bill making its way through Congress will cut taxes by $3.7 trillion but also increase deficits by $2.4 trillion over the next decade, according to an analysis released Wednesday by the nonpartisan Congressional Budget Office.",
    "link": "https://www.pbs.org/newshour/politics/how-trumps-big-bill-will-affect-taxes-deficit-and-health-care-according-to-the-budget-office",
    "timestamp": "2025-06-04T14:59:04Z"
  },
  {
    "title": "Donald Trump Finds His Approval Rating Sinking Once More",
    "description": "Pollster G. Elliott Morris' tracker shows that on the issue of the economy, Trump's approval rating is underwater by 15.75 points.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-economy-polls-2080916",
    "timestamp": "2025-06-04T14:58:06Z"
  },
  {
    "title": "India weighs legal uncertainties around Trump tariffs as trade pact talks start this week",
    "description": "India is approaching upcoming trade talks with the US cautiously due to legal uncertainties surrounding Trump's tariffs. These uncertainties, including a court challenge to the tariffs and potential further increases, could influence India's strategy for a pr…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-weighs-legal-uncertainties-around-trump-tariffs-as-trade-pact-talks-start-this-week/articleshow/121627132.cms",
    "timestamp": "2025-06-04T14:57:54Z"
  },
  {
    "title": "Trump Gets Grouchy Over Xi Jinping In Wee-Hours Gripe Sesh",
    "description": "The president appeared to get personal over his tariff impasse with the Chinese leader.",
    "link": "https://www.huffpost.com/entry/donald-trump-xi-jinping-very-tough-extremely-hard_n_684047b3e4b0cc37620111fa",
    "timestamp": "2025-06-04T14:56:54Z"
  },
  {
    "title": "Treasury yields slide as ADP payrolls fall to lowest in more than two years",
    "description": "U.S. Treasury yields tumbled Wednesday in response to a report that private sector job creation in May was the weakest in more than two years, prompting President Donald Trump to urge the Federal Reserve to lower interest rates and as 50% steel tariffs went i…",
    "link": "https://biztoc.com/x/e99b319d89d899bf",
    "timestamp": "2025-06-04T14:56:29Z"
  },
  {
    "title": "Trump's big bill will cut taxes by $3.7T and add $2.4T to deficit, budget office says",
    "description": "President Donald Trump’s big bill is likely to unleash trillions in tax cuts and slash spending, but also spike deficits by $2.4 trillion over the decade and leave some 10.9 million more people without health insurance.",
    "link": "https://www.news4jax.com/news/politics/2025/06/04/trumps-big-bill-will-cut-taxes-by-37t-and-add-24t-to-deficit-budget-office-says/",
    "timestamp": "2025-06-04T14:56:21Z"
  },
  {
    "title": "Trump spending bill to cut taxes by $3.7T, add $2.4T to deficit, CBO says",
    "description": "President Donald Trump's \"Big, Beautiful Bill\" would cut taxes by $3.7 trillion while adding $2.4 trillion to the national debt, the Congressional Budget Office says.\nThe CBO released its report on Trump's bill on Wednesday. The report also estimates that it …",
    "link": "https://biztoc.com/x/fdfb5c59e3d19b81",
    "timestamp": "2025-06-04T14:56:05Z"
  },
  {
    "title": "Trump’s 50% tariffs on steel and aluminum go into effect. Here’s what to know",
    "description": "Economists warn that such heightened levies could significantly squeeze the wallets of both companies and shoppers alike. But President Donald Trump argues that his latest import taxes are necessary to protect U.S. industries.",
    "link": "https://biztoc.com/x/70dfba8bc83b8320",
    "timestamp": "2025-06-04T14:55:58Z"
  },
  {
    "title": "Stephen King on 'The Life of Chuck,' the end of the world and, yes, joy",
    "description": "So vividly drawn is Stephen King’s fiction that it’s offered the basis for some 50 feature films",
    "link": "https://abcnews.go.com/Entertainment/wireStory/stephen-king-life-chuck-end-world-joy-122491144",
    "timestamp": "2025-06-04T14:54:53Z"
  },
  {
    "title": "US and Europe trade negotiators say progress but no breakthroughs on tariff talks in Paris",
    "description": "Europe and the United States say progress has been made but there were no breakthroughs during a meeting in Paris to negotiate a settlement of a tense tariff spat with global economic ramifications",
    "link": "https://abcnews.go.com/International/wireStory/us-europe-trade-negotiators-progress-breakthroughs-tariff-talks-122491109",
    "timestamp": "2025-06-04T14:54:35Z"
  },
  {
    "title": "The Latest: 10.9 million more people projected to lose insurance in 2034 from GOP tax bill cuts",
    "description": "The Congressional Budget Office estimates an increase of 10.9 million people without health insurance under President Donald Trump’s big bill, including 1.4 million who are in the country without legal status in state-funded programs",
    "link": "https://abcnews.go.com/US/wireStory/latest-109-million-people-projected-lose-insurance-2034-122482970",
    "timestamp": "2025-06-04T14:54:20Z"
  },
  {
    "title": "Elon Musk’s New Budget Bill Threat Sends Republicans Scrambling",
    "description": "Congressional Republicans are stuck between a rock and a hard place as their former financier, Elon Musk, threatens to use his gargantuan fortune to unseat anyone who supports the president’s “big, beautiful bill.”\r\nLast month, Musk confessed in an interview …",
    "link": "https://newrepublic.com/post/196114/elon-musk-budget-bill-threat-republicans-scrambling",
    "timestamp": "2025-06-04T14:53:46Z"
  },
  {
    "title": "New CBO report makes the Republicans' Trump agenda megabill look even worse",
    "description": ".@stevebenen: The original CBO score of the Republicans’ domestic policy megabill was brutal. A revised analysis of the final bill made matters worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/cbo-office-budget-analysis-republicans-megabill-worse-rcna210890",
    "timestamp": "2025-06-04T14:53:18Z"
  },
  {
    "title": "Indian and Pakistani ‘dueling’ delegations land in Washington",
    "description": "Both New Delhi and Islamabad have initiated a diplomatic push to convey their positions on the military standoff Read Full Article at RT.com",
    "link": "https://www.rt.com/india/618648-india-pakistan-delegations-washington/",
    "timestamp": "2025-06-04T14:52:59Z"
  },
  {
    "title": "\"Butthurt” Elon Musk Has Billions of Reasons to Hate the GOP Spending Bill",
    "description": "The Tesla CEO says he’s angry about America’s ballooning debt. White House sources say it’s personal.",
    "link": "https://www.vanityfair.com/news/story/elon-musk-big-beautiful-bill-tesla",
    "timestamp": "2025-06-04T14:51:58Z"
  },
  {
    "title": "Khamenei dismisses US nuclear proposal, and says Iran will keep enriching uranium",
    "description": "Five rounds of nuclear talks have not bridged gaps as Iran’s leaders grapple with multiple crises",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/04/khamenei-dismisses-us-nuclear-proposal-and-says-iran-will-keep-enriching-uranium/",
    "timestamp": "2025-06-04T14:51:19Z"
  },
  {
    "title": "BlackRock Escapes Texas Oil-Boycott List After ESG Retreat",
    "description": "BlackRock Inc. was removed from Texas' blacklist of companies that boycott fossil fuels.",
    "link": "https://www.rigzone.com/news/wire/blackrock_escapes_texas_oilboycott_list_after_esg_retreat-04-jun-2025-180739-article/",
    "timestamp": "2025-06-04T14:51:13Z"
  },
  {
    "title": "Australia and EU revive trade talks but agriculture still a sticking point",
    "description": "A pact with the bloc was \"about building economic resilience in a rapidly changing global environment,\" Don Farrell said.",
    "link": "https://www.abc.net.au/news/2025-06-05/australia-and-eu-trade-deal/105378252",
    "timestamp": "2025-06-04T14:51:12Z"
  },
  {
    "title": "The Trump-Hating Left’s Worst Nightmare: Things Really Are Looking Up",
    "description": "The economy appears to be booming, consumer confidence is rising, inflation is coming in lower, and job growth higher, than expected. Normally, we’d all be celebrating good news like this. But not when Donald Trump is sitting in the White House. Then it must …",
    "link": "https://freerepublic.com/focus/f-chat/4320935/posts",
    "timestamp": "2025-06-04T14:50:58Z"
  },
  {
    "title": "Incoming US Centralized Federal Government Database — When Data Becomes Power",
    "description": "If you were unfamiliar with the American analytics company Palanatir Technologies, prepare to hear about it on every news channel in the coming months. Donald Trump secured the presidency twice because he was the anti-establishment candidate. The White House …",
    "link": "https://freerepublic.com/focus/f-chat/4320934/posts",
    "timestamp": "2025-06-04T14:49:31Z"
  },
  {
    "title": "Incoming US Centralized Federal Government Database — When Data Becomes Power",
    "description": "If you were unfamiliar with the American analytics company Palanatir Technologies, prepare to hear about it on every news channel in the coming months. Donald Trump secured the presidency twice because he was the anti-establishment candidate. The White House …",
    "link": "https://freerepublic.com/focus/f-news/4320934/posts",
    "timestamp": "2025-06-04T14:49:31Z"
  },
  {
    "title": "Russia Seeks Sustainable Peace in Ukraine that Prevents the Rise of Radical Ideologies",
    "description": "The second round of negotiations between delegations from Moscow and Kiev took place on June 2 for just over an hour, aiming to reach a solution to the conflict in Ukraine. Remarkably, despite Ukraine’s constant attacks and provocations, Russia remains …\nThe …",
    "link": "https://www.globalresearch.ca/russia-seeks-sustainable-peace-ukraine/5889477",
    "timestamp": "2025-06-04T14:49:18Z"
  },
  {
    "title": "Trump’s 50% tariffs on steel and aluminum go into effect. Here’s what to know",
    "description": "Economists warn that such heightened levies could significantly squeeze the wallets of both companies and shoppers alike. But President Donald Trump argues that his latest import taxes are necessary to protect U.S. industries.",
    "link": "https://www.pbs.org/newshour/economy/trumps-50-tariffs-on-steel-and-aluminum-go-into-effect-heres-what-to-know",
    "timestamp": "2025-06-04T14:48:06Z"
  },
  {
    "title": "Trump’s Truth Social to Launch Bitcoin ETF: Will This Presale Pump Next?",
    "description": "Magic Eden, a popular NFT marketplace, announced that it’ll be launching the official $TRUMP wallet app backed by the president himself. However, Donald Trump Junior took to X to say that the Trump Organization has zero involvement with this wallet, and he kn…",
    "link": "https://bitcoinist.com/trumps-truth-social-to-launch-bitcoin-etf-will-this-presale-pump-next/",
    "timestamp": "2025-06-04T14:48:01Z"
  },
  {
    "title": "Zelenskyy calls Russia’s peace proposal an 'ultimatum' and he wants face-to-face talks with Putin",
    "description": "Ukrainian President Volodymyr Zelenskyy has dismissed Russia’s ceasefire proposal as “an ultimatum” and renewed his call for direct talks with Russian President Vladimir Putin to break the deadlock over the war",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-calls-russias-peace-proposal-ultimatum-face-face-122490324",
    "timestamp": "2025-06-04T14:46:29Z"
  },
  {
    "title": "Trump tax leaker takes 5th in House inquiry into Biden DOJ plea deal",
    "description": "A man who pleaded guilty to leaking President Donald Trump’s and thousands of others’ tax information asserted his Fifth Amendment right to the House Judiciary Committee and declined to testify.",
    "link": "https://www.foxnews.com/politics/trump-tax-leaker-takes-fifth-house-inquiry-plea-deal",
    "timestamp": "2025-06-04T14:45:58Z"
  },
  {
    "title": "‘The Swamp Isn’t Being Drained’: Right-Winger Denounces ‘Cheap Date’ Trump for Backing RINOs",
    "description": "Daniel Horowitz, a senior editor at The Blaze, denounced President Donald Trump for failing to drain the swamp in a new column.\nThe post ‘The Swamp Isn’t Being Drained’: Right-Winger Denounces ‘Cheap Date’ Trump for Backing RINOs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/the-swamp-isnt-being-drained-right-winger-denounces-cheap-date-trump-for-backing-rinos/",
    "timestamp": "2025-06-04T14:45:55Z"
  },
  {
    "title": "Laura Loomer’s White House access erases the line between the fringe and mainstream",
    "description": "In a normal White House, activists like Laura Loomer wouldn't have high-level access. In this White House, she gets to meet with Donald Trump and JD Vance.",
    "link": "https://biztoc.com/x/23924f2309dc8c75",
    "timestamp": "2025-06-04T14:45:05Z"
  },
  {
    "title": "Zelensky calls Russian ceasefire plan an ‘ultimatum’",
    "description": "KYIV - President Volodymyr Zelensky on Wednesday said that Russia was giving Ukraine an ultimatum at peace negotiations but said he was ready to hold direct talks with Russia&rsquo;s Vladimir Putin and US President Donald Trump &ldquo;any day&rdquo;.",
    "link": "https://www.bangkokpost.com/world/3041880/zelensky-calls-russian-ceasefire-plan-an-ultimatum",
    "timestamp": "2025-06-04T14:45:00Z"
  },
  {
    "title": "Laura Loomer's White House access erases the line between the fringe and mainstream (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nLaura Loomer's White House access erases the line between the fringe and mainstream  —  In a normal White House, right-wing activists like Loomer wouldn't have access.  But that's not Donald Trump's White House.  —  Amid speculation that …",
    "link": "https://www.memeorandum.com/250604/p51",
    "timestamp": "2025-06-04T14:45:00Z"
  },
  {
    "title": "Jasmine Crockett surprises reporter with claim Republicans 'tell me how much they like me'",
    "description": "Reporter Jason Whitely questioned Rep. Jasmine Crockett on Sunday after she said Republicans walk up to her and tell her how much they like her, responding with, \"Are you serious?\"",
    "link": "https://www.foxnews.com/media/jasmine-crockett-surprises-reporter-claim-republicans-tell-me-how-much-like-me",
    "timestamp": "2025-06-04T14:44:05Z"
  },
  {
    "title": "State Department Cables Reveal the Harrowing Consequences of Elon Musk’s USAID Demolition",
    "description": "Elon Musk is trying to rewrite the history of his four-month tenure in Washington. As the billionaire founder of Tesla and Space X returns to the private sector after four months as a “special government employee,” he has put aside the celebratory chainsaw an…",
    "link": "https://www.motherjones.com/politics/2025/06/state-department-cables-pepfar-lesotho-malawi-usaid-elon-musk/",
    "timestamp": "2025-06-04T14:43:27Z"
  },
  {
    "title": "Tesla's Collapse Continues",
    "description": "In this morning's edition, Tesla's decline continues, and China's tight control of magnet exports is changing how automakers think about assembly.",
    "link": "https://www.jalopnik.com/1877567/tesla-continues-collapse/",
    "timestamp": "2025-06-04T14:43:13Z"
  },
  {
    "title": "TIME CEO Jessica Sibley Announces First-Half 2025 Progress and Shares Strategic Outlook on AI Innovation",
    "description": "TIME Chief Executive Officer Jessica Sibley sent the following memo to staff on Monday: Team, As we near the halfway point of 2025, I’m proud to share that TIME is delivering across the board: advancing our mission to be a strong and commercially viable compa…",
    "link": "https://time.com/7291055/time-ceo-jessica-sibley-announces-first-half-2025-progress/",
    "timestamp": "2025-06-04T14:41:42Z"
  },
  {
    "title": "UK’s Insane Strategy of Fighting Russia, China and Giving Nukes to Neo-Nazi Junta",
    "description": "According to the SDR, the British military needs to be ready for a conflict against not only Russia and China, but also North Korea and Iran.\nThe post UK’s Insane Strategy of Fighting Russia, China and Giving Nukes to Neo-Nazi Junta appeared first on Global R…",
    "link": "https://www.globalresearch.ca/uk-fighting-russia-china-giving-nukes-neo-nazi-junta/5889445",
    "timestamp": "2025-06-04T14:41:00Z"
  },
  {
    "title": "Dismissed by DEI: Trump’s Purge Made Black Women With Stable Federal Jobs an “Easy Target”",
    "description": "by J. David McSwane \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn February 2020, President Donald Trump’s first education secretary issued…",
    "link": "https://www.propublica.org/article/trump-dei-black-women-minorities-careers-jobs-dismissed",
    "timestamp": "2025-06-04T14:40:00Z"
  }
]