[
  {
    "title": "'Depraved': Trump's DHS chief dragged after vulgar celebration",
    "description": "President Donald Trump's Homeland Security Secretary Kristi Noem responded to a legal victory with a vulgar post to X on Thursday.\"Suck it,\" she wrote, posting an image of a filing announcing the plaintiffs in Espinoza Escalona v. Noem were voluntarily withdr…",
    "link": "https://www.rawstory.com/kristi-noem-2672190562/",
    "timestamp": "2025-05-23T01:46:46Z"
  },
  {
    "title": "Donald Trump Stages an Oval Office Mugging (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nDonald Trump Stages an Oval Office Mugging  —  Race-baiting South Africa's visiting leader was a perfect summation of Trump's racially charged second term.  —  Considering Donald Trump's many outrages, his theatrically hostile r…",
    "link": "https://www.memeorandum.com/250522/p165",
    "timestamp": "2025-05-23T01:40:01Z"
  },
  {
    "title": "South Korea's defence ministry says no talks held with US on troop withdrawal",
    "description": "SEOUL (Reuters) -South Korea's defence ministry said on Friday that Seoul and Washington had not had discussions about the withdrawal of some U.S. troops stationed in the country. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/23/south-korea039s-defence-ministry-says-no-talks-held-with-us-on-troop-withdrawal",
    "timestamp": "2025-05-23T01:40:00Z"
  },
  {
    "title": "Trump's conversation with European leaders triggers controversy",
    "description": "LOS ANGELES, May 22 (Xinhua) -- What U.S. President Donald Trump told European leaders after his two",
    "link": "http://en.people.cn/n3/2025/0523/c90000-20318664.html",
    "timestamp": "2025-05-23T01:39:58Z"
  },
  {
    "title": "Trump admin blocks Harvard from enrolling int'l students",
    "description": "A student walks on the campus of Harvard University in Cambridge of Massachusetts, the United State",
    "link": "http://en.people.cn/n3/2025/0523/c90000-20318658.html",
    "timestamp": "2025-05-23T01:38:07Z"
  },
  {
    "title": "South Korea's defence ministry says no talks held with US on troop withdrawal",
    "description": "South Korea's defense ministry refuted a Wall Street Journal report suggesting the U.S. might withdraw approximately 4,500 troops. While Seoul denies discussions on troop reduction, the U.S. may consider relocating forces to other Indo-Pacific locations like …",
    "link": "https://economictimes.indiatimes.com/news/defence/south-koreas-defence-ministry-says-no-talks-held-with-us-on-troop-withdrawal/articleshow/121349692.cms",
    "timestamp": "2025-05-23T01:35:16Z"
  },
  {
    "title": "Did George Floyd protesters miss their moment for change?",
    "description": "Outrage over George Floyd’s killing by police catapulted Black Lives Matter into one of the largest protest movements in US history, with angry crowds chanting the slogan at rallies from Los Angeles to Washington. But five years on, the protesters are gone an…",
    "link": "https://www.digitaljournal.com/world/did-george-floyd-protesters-miss-their-moment-for-change/article",
    "timestamp": "2025-05-23T01:32:22Z"
  },
  {
    "title": "Ex-Obama Chief Of Staff Reveals Why Democrats Shouldn't Fall For This Trump 'Trap'",
    "description": "Rahm Emanuel explained what will lead voters to start turning to Democrats as a check on the president's \"chaotic corruption.\"",
    "link": "https://www.huffpost.com/entry/rahm-emanuel-democrats-trump-big-beautiful-bill_n_682fa7dde4b0239ca9a6ea27",
    "timestamp": "2025-05-23T01:31:41Z"
  },
  {
    "title": "PM Netanyahu Speaks with US President Donald Trump",
    "description": "Prime Minister Benjamin Netanyahu, today , spoke with US President Donald Trump, who expressed deep sorrow over the shocking murder in Washington of two Israeli Embassy employees: Yaron Lischinsky and Sarah Milgrim, of blessed memory.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/05/israel-250522-israel-pm02.htm",
    "timestamp": "2025-05-23T01:30:35Z"
  },
  {
    "title": "Did George Floyd Protesters Miss Their Moment For Change?",
    "description": "Outrage over George Floyd's killing by police catapulted Black Lives Matter into one of the largest protest movements in US history, with angry crowds chanting the slogan at rallies from Los Angeles to Washington.",
    "link": "https://www.ibtimes.com/did-george-floyd-protesters-miss-their-moment-change-3774298",
    "timestamp": "2025-05-23T01:30:21Z"
  },
  {
    "title": "Donald Trump’s ‘beautiful tax bill’ not popular with bond market",
    "description": "US president Donald Trump cut a deal with blue-state Republicans on taxes and put down an 11th-hour rebellion by conservatives over spending to get his “one big, beautiful bill” passed by the US House of Representatives.",
    "link": "https://www.independent.ie/business/world/donald-trumps-beautiful-tax-bill-not-popular-with-bond-market/a318711967.html",
    "timestamp": "2025-05-23T01:30:00Z"
  },
  {
    "title": "Musk claimed Starlink isn't allowed to operate in South Africa because he's not Black. Here's what we know",
    "description": "Tech billionaire Elon Musk was born in South Africa but emigrated at age 17 and eventually became a naturalized U.S. citizen.",
    "link": "https://www.snopes.com//news/2025/05/23/starlink-banned-south-africa-musk-black/",
    "timestamp": "2025-05-23T01:30:00Z"
  },
  {
    "title": "Donald Trump’s attacks taking toll on Apple as shares fall yet again",
    "description": "Apple has become a frequent target for attacks by president Donald Trump, a factor that has held the stock back as other big tech companies have rebounded over the past month.",
    "link": "https://www.independent.ie/business/technology/donald-trumps-attacks-taking-toll-on-apple-as-shares-fall-yet-again/a1121358554.html",
    "timestamp": "2025-05-23T01:30:00Z"
  },
  {
    "title": "Wealthy foreign crypto investors descend on President Trump's golf club for $148 million meme coin dinner",
    "description": "Donald Trump's meme coin dinner drew global attendees. Justin Sun, a crypto billionaire, won the contest. Investors spent millions to attend. Protests erupted outside Trump's club. Trump defended crypto innovators. Democrats criticized Trump's crypto dealings…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/wealthy-foreign-crypto-investors-descend-on-president-trumps-golf-club-for-148-million-meme-coin-dinner/articleshow/121349578.cms",
    "timestamp": "2025-05-23T01:28:29Z"
  },
  {
    "title": "Israeli PM Benjamin Netanyahu condemns killing of Israeli diplomats, thanks US for standing with Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu condemned the murder of two Israeli diplomats in Washington, D.C., labeling it an antisemitic attack. He refuted claims about aid not reaching Gaza, stating Israel has sent substantial aid while accusing Hamas of thef…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-pm-benjamin-netanyahu-condemns-killing-of-israeli-diplomats-thanks-us-for-standing-with-israel/articleshow/121349573.cms",
    "timestamp": "2025-05-23T01:28:19Z"
  },
  {
    "title": "Police: Woman in Wisconsin used mace on restaurant customers, hit employee with tip jar",
    "description": "MADISON, Wis. (WFRV) – Police in southern Wisconsin are asking the public’s help in identifying a woman allegedly involved in a fight at a restaurant. On March 28, around 11:10 p.m., officers with the Madison Police Department were sent to the restaurant for …",
    "link": "https://freerepublic.com/focus/f-chat/4318614/posts",
    "timestamp": "2025-05-23T01:27:54Z"
  },
  {
    "title": "How should central banks respond to US tariffs? The RBA provides some clues",
    "description": "Central banks around the world are faced with conflicting forces as the tariff wars continue. The Reserve Bank of Australia has war-gamed how it could play out.",
    "link": "https://theconversation.com/how-should-central-banks-respond-to-us-tariffs-the-rba-provides-some-clues-257329",
    "timestamp": "2025-05-23T01:27:33Z"
  },
  {
    "title": "'Big, Beautiful Bill' Immediately Runs Into Trouble in Senate After Squeaking Through House",
    "description": "The President Donald Trump-backed \"One Big Beautiful Bill\" passed the House Thursday by a one-vote margin, so now it is off to the Senate.",
    "link": "https://www.westernjournal.com/big-beautiful-bill-immediately-runs-into-trouble-in-senate-after-squeaking-through-house/",
    "timestamp": "2025-05-23T01:24:03Z"
  },
  {
    "title": "CNBC Daily Open: Trump's 'big, beautiful' tax bill might only be a short-term boost to the U.S. economy",
    "description": "Further into the future, the bill will likely saddle America with a higher fiscal deficit, as tax cuts are coupled with increased spending on defense.",
    "link": "https://www.cnbc.com/2025/05/23/cnbc-daily-open-trumps-tax-bill-might-only-have-short-term-benefits.html",
    "timestamp": "2025-05-23T01:23:55Z"
  },
  {
    "title": "This Louisiana community preps for hurricane season as questions linger about federal storm response",
    "description": "“These hurricanes are coming at us faster and they’re coming for a longer time of the year. They’re producing more rain, higher winds. And they’re going to places that may never have experienced that before.\"",
    "link": "https://www.pbs.org/newshour/nation/this-louisiana-community-preps-for-hurricane-season-as-questions-linger-about-federal-storm-response",
    "timestamp": "2025-05-23T01:23:27Z"
  },
  {
    "title": "Melania Trump Releases Audiobook Of Memoir Narrated By AI",
    "description": "US First Lady Melania Trump warned recently of the danger of AI deepfakes. Now she is releasing an audiobook narrated by an artificial intelligence-generated version of her own voice.",
    "link": "https://www.ndtv.com/world-news/melania-trump-releases-audiobook-of-memoir-narrated-by-artificial-intelligence-8484721",
    "timestamp": "2025-05-23T01:20:06Z"
  },
  {
    "title": "Disney Sues YouTube, Accuses Competitor of Poaching Executive",
    "description": "Over the years, Disney has seen its fair share of lawsuits — typically coming from theme park guests, dissatisfied customers, other entertainment companies, small creators, and even President Donald Trump. Disney has also filed its own lawsuits, many against …",
    "link": "https://insidethemagic.net/?p=773388&preview=true&preview_id=773388",
    "timestamp": "2025-05-23T01:19:58Z"
  },
  {
    "title": "\"New Era\": Melania Trump Uses AI To Narrate Her Memoir In Her Own Voice",
    "description": "US First Lady Melania Trump has announced the release of an audiobook version of her memoir &#039;Melania&#039;, narrated entirely by artificial intelligence in her own voice.",
    "link": "https://www.ndtv.com/world-news/new-era-in-publishing-melania-trump-uses-ai-to-narrate-her-memoir-in-her-own-voice-8484720",
    "timestamp": "2025-05-23T01:18:33Z"
  },
  {
    "title": "Russia’s Two Minds on Ukraine",
    "description": "The double-headed eagle that dominates Russia’s coat of arms holds many meanings, from signifying a historical connection to the Byzantine empire to acknowledging the influence of the vast country’s eastern and western regions. Following the recent meeting be…",
    "link": "https://english.khabarhub.com/2025/23/469677/",
    "timestamp": "2025-05-23T01:15:06Z"
  },
  {
    "title": "'You don’t have to die here’: Young House Dems demand 'reckoning' for aging party",
    "description": "Young House Democrats demanded what Axios called an \"age reckoning\" on Thursday after a third Democrat died while in office, with some remarking that President Donald Trump's \"Big, Beautiful Bill\" passed through the chamber this week, and the \"difference is t…",
    "link": "https://www.rawstory.com/house-democrats-2672190547/",
    "timestamp": "2025-05-23T01:14:02Z"
  },
  {
    "title": "Apple set to expand India supply chain through $1.5bn Foxconn plant",
    "description": "iPhone-maker continues manufacturing pivot away from China but Donald Trump demands shift back to US",
    "link": "https://biztoc.com/x/666220260eb19deb",
    "timestamp": "2025-05-23T01:13:59Z"
  },
  {
    "title": "Why Donald Trump has put Asia on the precipice of a nuclear arms race",
    "description": "In Seoul, Tokyo and even Taipei, a once-unthinkable idea — building nuclear weapons — has begun to look disturbingly pragmatic.",
    "link": "https://theconversation.com/why-donald-trump-has-put-asia-on-the-precipice-of-a-nuclear-arms-race-256577",
    "timestamp": "2025-05-23T01:05:15Z"
  },
  {
    "title": "Asian shares start cautious, treasuries hold gains",
    "description": "Asian stock markets show a slow start. US Treasury bonds stabilize as worries about America's finances ease. Japan's inflation rises. The US Federal Reserve might lower interest rates in 2025 if tariff issues are resolved. The Supreme Court protects the Fed f…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-start-cautious-treasuries-hold-gains/articleshow/121349154.cms",
    "timestamp": "2025-05-23T01:03:55Z"
  },
  {
    "title": "There’s a much worse Trump threat to Australia’s economy than a trade war",
    "description": "The Reserve Bank is worried about Trump's trade war. But another threat may prove every bit as damaging and worse.\nThe post There’s a much worse Trump threat to Australia’s economy than a trade war appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/23/donald-trump-trade-war-us-bonds-debt-rba/",
    "timestamp": "2025-05-23T00:57:11Z"
  },
  {
    "title": "A New Orleans lawyer could be the next inspector general for the CIA. Here's what to know.",
    "description": "WASHINGTON – New Orleans lawyer Peter M. Thomson was nominated by President Donald Trump as inspector general of the Central Intelligence Agency, according to his law firm, Stone Pigman Walther Wittmann L.L.C.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/new-orleans-lawyer-nominated-cia-inspector-general/article_1fe112ed-f2ac-5077-b814-fdada8002a90.html",
    "timestamp": "2025-05-23T00:57:00Z"
  },
  {
    "title": "Trump's image of dead 'white farmers' did not come from footage of South Africa",
    "description": "The image U.S. President Donald Trump used was pulled from footage shot following deadly battles with Rwanda-backed M23 rebels in the Democratic Republic of Congo.",
    "link": "https://www.japantimes.co.jp/news/2025/05/23/world/trump-dead-white-farmers-picture-false/",
    "timestamp": "2025-05-23T00:54:00Z"
  },
  {
    "title": "Asian Shares Start Cautious, Treasuries Hold Gains: Markets Wrap",
    "description": "Asian shares were off to a tepid start at the open Friday and Treasuries held Thursday’s gains in a sign of calming US fiscal fears that rocked markets earlier in the week.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-shares-start-cautious-treasuries-hold-gains-markets-wrap",
    "timestamp": "2025-05-23T00:45:31Z"
  },
  {
    "title": "Trump Team’s ‘Game of Thrones’ on Venezuela Whiplashes Chevron",
    "description": "It took barely 24 hours this week for the Trump administration to execute its latest reversal on Venezuela, with the fate of a huge Chevron Corp. venture hanging in the balance as closed-door White House differences broke into the open.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-teams-game-of-thrones-on-venezuela-whiplashes-chevron",
    "timestamp": "2025-05-23T00:45:16Z"
  },
  {
    "title": "Supreme Court upholds Trump's removal of Biden appointees from federal boards",
    "description": "The Supreme Court ruled for Trump’s removal of two Democratic appointees from federal boards, upholding/discarding limits on the president’s power to fire agency officials.",
    "link": "https://www.foxnews.com/politics/supreme-court-upholds-trumps-removal-biden-appointees-federal-boards",
    "timestamp": "2025-05-23T00:41:21Z"
  },
  {
    "title": "US Court Allows Trump To Fire Independent Board Members -- But Not At Fed",
    "description": "The US Supreme Court on Thursday allowed President Donald Trump to fire leaders of two independent agencies, but signalled that such dismissals would not be permitted for the Federal Reserve.",
    "link": "https://www.ndtv.com/world-news/us-court-allows-donald-trump-to-fire-independent-board-members-but-not-at-fed-8484574",
    "timestamp": "2025-05-23T00:33:06Z"
  },
  {
    "title": "Mahmoud Khalil permitted to hold newborn son for the 1st time despite government objections",
    "description": "Detained Palestinian activist Mahmoud Khalil has been allowed to hold his one-month-old son for the first time after a federal judge blocked the Trump administration’s efforts to keep the father and infant separated by a plexiglass divider",
    "link": "https://abcnews.go.com/Politics/wireStory/mahmoud-khalil-permitted-hold-newborn-son-1st-time-122077166",
    "timestamp": "2025-05-23T00:30:29Z"
  },
  {
    "title": "ET Explainer: What is Trump's Take it Down Act to tackle ‘revenge porn’",
    "description": "President Trump has signed the Take it Down Act, a federal law criminalising the publication of non-consensual intimate images, including deepfakes. Offenders face imprisonment and fines, with harsher penalties for content involving minors. Platforms must rem…",
    "link": "https://economictimes.indiatimes.com/tech/technology/et-explainer-what-is-trumps-take-it-down-act-to-tackle-revenge-porn/articleshow/121347202.cms",
    "timestamp": "2025-05-23T00:30:00Z"
  },
  {
    "title": "'Social Security?' Trump official boasts he Googled his new job in leaked audio",
    "description": "Social Security Administration (SSA) Commissioner Frank Bisignano, who was a Wall Street executive before overseeing SSA, recently made a stunning admission to agency employees during a town hall event this week.ABC News reported Thursday that it had obtained…",
    "link": "https://www.rawstory.com/social-security-2672190532/",
    "timestamp": "2025-05-23T00:29:20Z"
  },
  {
    "title": "Deaf President Now! traces the powerful uprising that led to Deaf rights in the US – now again under threat",
    "description": "The powerful documentary on Apple TV+ is shining a light on a decades-long revolution that’s still unfolding, and now threatened under Trump.",
    "link": "https://theconversation.com/deaf-president-now-traces-the-powerful-uprising-that-led-to-deaf-rights-in-the-us-now-again-under-threat-257233",
    "timestamp": "2025-05-23T00:29:17Z"
  },
  {
    "title": "College Student Unloads on Charlie Kirk: ‘People Will See You and the People You Supported as Corrupt’",
    "description": "A Cambridge University student unloaded on Turning Point USA founder Charlie Kirk during a debate this week, accusing him and his allies of being \"corrupt.\"\nThe post College Student Unloads on Charlie Kirk: ‘People Will See You and the People You Supported as…",
    "link": "https://www.mediaite.com/politics/college-student-unloads-on-charlie-kirk-people-will-see-you-and-the-people-you-supported-as-corrupt/",
    "timestamp": "2025-05-23T00:29:00Z"
  },
  {
    "title": "Denmark hires Louisiana's David Vitter as Trump talks about buying Greenland",
    "description": "WASHINGTON – Denmark has turned to former Louisiana U.S. Sen. David Vitter to build “warmer relations” with President Donald Trump, who has set his sights on acquiring Greenland, according to EUobserver, a non-profit news publication covering the European Uni…",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/denmark-hires-louisianas-david-vitter-as-trump-talks-about-buying-greenland/article_173a5590-d5b7-5da9-91c8-d86caec08333.html",
    "timestamp": "2025-05-23T00:27:00Z"
  },
  {
    "title": "'Golden Dome' another way to fleece US taxpayers",
    "description": "US President Donald Trump said on Tuesday that his administration had",
    "link": "http://en.people.cn/n3/2025/0523/c90000-20318510.html",
    "timestamp": "2025-05-23T00:25:06Z"
  },
  {
    "title": "Iranian FM: Zero bombs = deal, zero enrichment = no deal",
    "description": "Ahead of next round of nuclear talks with the US, Foreign Minister Abbas Araghchi again reiterates his country’s stance on nuclear enrichment.",
    "link": "https://www.israelnationalnews.com/news/408829",
    "timestamp": "2025-05-23T00:23:26Z"
  },
  {
    "title": "Trump’s Harvard Ban Echoes USSR’s Historic Mistake To China’s Long-Term Gain",
    "description": "In the complex interplay of geopolitics, technology, and economic power, clean technology has emerged decisively as the defining economic driver of this century. Nations that dominate in solar energy, wind turbines, electric vehicles, batteries, and smart gri…",
    "link": "https://cleantechnica.com/2025/05/22/trumps-harvard-ban-echoes-ussrs-historic-mistake-to-chinas-long-term-gain/",
    "timestamp": "2025-05-23T00:22:33Z"
  },
  {
    "title": "Kentucky congressman 1 of only 2 Republican 'nays' on Trump's 'big, beautiful bill'",
    "description": "After a marathon overnight session, House Republicans passed their multi-trillion-dollar tax breaks package, dubbed the \"One Big Beautiful Bill.\" The bill passed the chamber by a single vote, 215-214, with Democrats unanimously opposing and only two Republica…",
    "link": "https://freerepublic.com/focus/f-news/4318607/posts",
    "timestamp": "2025-05-23T00:21:38Z"
  },
  {
    "title": "Eclipse of the Forgotten: \"The Resurgent Legacy of the Blackout Bestiary – Part II",
    "description": "Part 2 explores the mystery fueled by viral momentum and audience demand. We compare two case studies: the Nord Stream pipeline explosions and the Enigmatic Bestiary of the Blackout. Hypothesis 1: If the Nord Stream blasts in September 2022 are seen as a test…",
    "link": "https://energycentral.com/c/og/eclipse-forgotten-resurgent-legacy-blackout-bestiary-%E2%80%93-part-ii",
    "timestamp": "2025-05-23T00:20:06Z"
  },
  {
    "title": "Supreme Court Backs Trump’s Ouster of Agency Leaders",
    "description": "The US Supreme Court shielded the Federal Reserve from Donald Trump’s push to oust top officials at independent federal agencies. The court on Thursday said the Fed is “uniquely structured, quasi-private entity” as it let Trump fire top officials at two other…",
    "link": "https://biztoc.com/x/b8e0aa07059fa083",
    "timestamp": "2025-05-23T00:18:18Z"
  },
  {
    "title": "U.S. Supreme Court shields Fed but lets Trump fire agency leaders",
    "description": "In a ruling Thursday that let Trump oust officials at two other agencies, the court said its decision wouldn’t apply to the Fed.",
    "link": "https://www.japantimes.co.jp/news/2025/05/23/world/crime-legal/supreme-court-shields-fed/",
    "timestamp": "2025-05-23T00:17:00Z"
  },
  {
    "title": "Trump administration bars Harvard from enrolling foreign students",
    "description": "The Trump administration has revoked Harvard University’s ability to enroll international students in its escalating battle with the Ivy League school. It says thousands of current students must transfer to other schools or leave the country. The Department o…",
    "link": "https://apnews.com/article/harvard-trump-foreign-student-457d07268fba9c1f6f7f32fe0424bc3b",
    "timestamp": "2025-05-23T00:15:12Z"
  },
  {
    "title": "Trump is hosting a private dinner for the top 220 buyers of his memecoin tonight—and even the crypto lobby is grumbling",
    "description": "Trump is hosting a private dinner for the top 220 buyers of his memecoin tonight—and even the crypto lobby is grumbling\nU.S. President Donald Trump and White House crypto czar David Sacks speak at the White House Digital Assets Summit in March.\nAnna Moneymake…",
    "link": "https://biztoc.com/x/5f96b7b567d2ce64",
    "timestamp": "2025-05-23T00:06:44Z"
  },
  {
    "title": "RFK Jr.'s MAHA Report Goes After Vaccines, Prescription Meds, Food Supply",
    "description": "HHS Secretary Robert F. Kennedy Jr. said Thursday he wants to fight chronic disease in children even though he and President Donald Trump have sought to slash public health infrastructure and research.",
    "link": "https://www.huffpost.com/entry/maha-report-claims-prescription-meds-environmental-chemicals-processed-foods-to-blame-for-sick-kids_n_682f9144e4b0e1fe96d6520b",
    "timestamp": "2025-05-23T00:01:35Z"
  },
  {
    "title": "Nothing Big Enough To Topple US Dollar Dominance Just Yet, According to Central Bank of Brazil Director: Report",
    "description": "Brazil’s central bank reportedly believes that the US dollar will maintain its position as the world’s leading currency over the next decade. According to Reuters, the central bank’s monetary policy director, Nilton David, says that the financial institution …",
    "link": "https://dailyhodl.com/2025/05/22/nothing-big-enough-to-topple-us-dollar-dominance-just-yet-according-to-central-bank-of-brazil-director-report/",
    "timestamp": "2025-05-23T00:00:52Z"
  },
  {
    "title": "Supreme Court Stays Order Forcing Trump to Reinstate Fired Labor Regulators",
    "description": "Cathy Harris of the Merit Systems Protection Board (MSPB) and Gwynne Wilcox of National Labor Relations Board (NLRB) cannot have their jobs back as their case moves through the courts.\nThe post Supreme Court Stays Order Forcing Trump to Reinstate Fired Labor …",
    "link": "https://legalinsurrection.com/2025/05/supreme-court-stays-order-forcing-trump-to-reinstate-fired-labor-regulators/",
    "timestamp": "2025-05-23T00:00:44Z"
  },
  {
    "title": "Trump-voting movie star Zachary Levi defends Trump-hating ‘Snow White’ star Rachel Zegler from backlash",
    "description": "In a new interview with Variety, Trump-supporting actor Zachary Levi said he has no hard feelings for \"Shazam! Fury of The Gods\" co-star Rachel Zegler after she condemned Trump voters.",
    "link": "https://www.foxnews.com/media/trump-voting-movie-star-zachary-levi-defends-trump-hating-snow-white-star-rachel-zegler-backlash",
    "timestamp": "2025-05-23T00:00:15Z"
  },
  {
    "title": "How the Trump administration's move will affect Harvard's international students",
    "description": "President Donald Trump’s administration escalated its standoff with Harvard University on Thursday, revoking the school’s ability to enroll international students",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-administrations-move-affect-harvards-international-students-122097755",
    "timestamp": "2025-05-22T23:58:19Z"
  },
  {
    "title": "Trump Hosts Meme Coin Dinner—What We Know About The Exclusive Crypto Gathering",
    "description": "Dinner guests on average invested well over $1 million in the $TRUMP meme coin, according to NBC News.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/22/trump-hosts-meme-coin-dinner-what-we-know-about-the-exclusive-crypto-gathering/",
    "timestamp": "2025-05-22T23:56:41Z"
  },
  {
    "title": "The Conquest Never Ends: Horrors Inflicted for 500 Years",
    "description": "Originally appeared at TomDispatch. Leon Golub once related a story to a mutual friend. A Chicago artist famous for large canvases depicting crimson torture rooms in Central America, Golub had been asked what it meant to him to be a “Jewish political artist.”…",
    "link": "https://www.antiwar.com/blog/2025/05/22/the-conquest-never-ends-horrors-inflicted-for-500-years/",
    "timestamp": "2025-05-22T23:51:55Z"
  },
  {
    "title": "RFK Jr.'s MAHA report raises concerns about vaccines, American foods and prescription drugs",
    "description": "A new government-issued report reflects some of the most controversial views on vaccines, the nation’s food supply, pesticides and prescription drugs held by Health and Human Services Secretary Robert F",
    "link": "https://abcnews.go.com/Business/wireStory/rfk-jrs-maha-report-raises-concerns-vaccines-american-122079962",
    "timestamp": "2025-05-22T23:50:20Z"
  },
  {
    "title": "GOP Senator Tommy Tuberville Plans to Launch 2026 Alabama Governor Bid",
    "description": "Tuberville has aligned himself closely with President Donald Trump both in his 2020 Senate campaign and during his Senate term.",
    "link": "https://www.newsweek.com/gop-senator-tommy-tuberville-plans-launch-2026-alabama-governor-bid-2076148",
    "timestamp": "2025-05-22T23:47:51Z"
  },
  {
    "title": "The Senate just voted to block California’s gas car ban",
    "description": "Legal experts say Congress misused a federal law to do so, potentially “opening up a Pandora’s box it cannot close.”",
    "link": "http://grist.org/regulation/senate-rescinds-californias-ev-rules-congressional-review-act/",
    "timestamp": "2025-05-22T23:43:23Z"
  },
  {
    "title": "‘It Has Everything To Do With Enriching Himself’: CNN Reporter Gets Blunt on Trump’s Dinner With Crypto Investors",
    "description": "CNN's Jeff Zeleny gave a blunt assessment of President Donald Trump's dinner with holders of the president's cryptocurrency on Wednesday night.\nThe post ‘It Has Everything To Do With Enriching Himself’: CNN Reporter Gets Blunt on Trump’s Dinner With Crypto In…",
    "link": "https://www.mediaite.com/media/tv/it-has-everything-to-do-with-enriching-himself-cnn-reporter-gets-blunt-on-trumps-dinner-with-crypto-investors/",
    "timestamp": "2025-05-22T23:37:53Z"
  },
  {
    "title": "Melania Trump uses AI vocal replica to narrate audiobook",
    "description": "US First Lady Melania Trump warned recently of the danger of AI deepfakes. Now she is releasing an audiobook narrated by an artificial intelligence-generated version of her own voice. The 55-year-old wife of President Donald Trump announced the release of the…",
    "link": "https://www.digitaljournal.com/world/melania-trump-uses-ai-vocal-replica-to-narrate-audiobook/article",
    "timestamp": "2025-05-22T23:37:49Z"
  },
  {
    "title": "Overruling 90 years of precedent (except for the Fed ;)) in an unreasoned four-paragraph opinion for Daddy Trump",
    "description": "To elaborate on Paul’s post below, the Court today overruled the Court’s unanimous 1935 opinion holding that Congress can require that members of executive agencies it creates to be fired only for cause sub silentio. (Literally — as Kagan observes the Court’s…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/overruling-90-years-of-precedent-except-for-the-fed-in-an-unreasoned-four-paragraph-opinion-for-daddy-trump",
    "timestamp": "2025-05-22T23:35:00Z"
  },
  {
    "title": "'Legislating From the Bench,' Supreme Court Greenlights Trump Firing of Labor Regulators",
    "description": "In a decision that alarmed legal experts, the U.S. Supreme Court on Thursday blocked the reinstatement of two labor regulators fired by President Donald Trump in apparent violation of federal law intended to prevent such ousters for political reasons.\n\nThe Tr…",
    "link": "https://www.commondreams.org/news/humphrey-s-executor",
    "timestamp": "2025-05-22T23:33:48Z"
  },
  {
    "title": "Trump Openly Sells Access To Those Who Put The Most Cash In His Pocket",
    "description": "WASHINGTON — President Donald Trump is taking his efforts to use his office for personal enrichment — the very definition of corruption — to new levels Thursday night, selling face time to those who put money into his bank account by purchasing nearly $200 mi…",
    "link": "https://biztoc.com/x/96b65eb2f1a7675d",
    "timestamp": "2025-05-22T23:33:40Z"
  },
  {
    "title": "Will Trump liberate South Africa?",
    "description": "The latest Oval Office danse macabre saw President Donald Trump accuse South Africa’s Cyril Ramaphosa of some sort of complicity in genocide against white farmers. ​​“This is sort of the opposite of Apartheid,” the American president claimed on Wednesday.\nThe…",
    "link": "https://biztoc.com/x/1e5a48252bd696c0",
    "timestamp": "2025-05-22T23:33:39Z"
  },
  {
    "title": "Justice Kagan Warns Supreme Court Just Went Against 90 Years of History",
    "description": "The Supreme Court analyzed if the president could remove members of independent agencies without cause.",
    "link": "https://www.newsweek.com/justice-kagan-warns-supreme-court-went-90-years-history-2076125",
    "timestamp": "2025-05-22T23:31:35Z"
  },
  {
    "title": "'Sealed their fate': New memo shows Dems giddy over looming elections",
    "description": "Democrats are already plotting to go on the offense over House Republicans' vote to pass President Donald Trump's \"big, beautiful bill.\"According to Punchbowl News' Max Cohen, the Democratic Congressional Campaign Committee has already circulated a memo stati…",
    "link": "https://www.rawstory.com/house-democrats-2672190376/",
    "timestamp": "2025-05-22T23:31:25Z"
  },
  {
    "title": "White House shuts down reporter's 'ridiculous' challenge of White South African farmer deaths (Fox News)",
    "description": "Fox News:\nWhite House shuts down reporter's ‘ridiculous’ challenge of White South African farmer deaths  —  The White House pushed back against questions from a reporter challenging statements by the Trump administration regarding the treatment of White South…",
    "link": "https://www.memeorandum.com/250522/p151",
    "timestamp": "2025-05-22T23:30:01Z"
  },
  {
    "title": "Disney suspends Venezuelan workers after protected status revoked",
    "description": "Entertainment giant Disney has placed at least 45 Venezuelan employees on unpaid leave, the company told AFP Thursday, following the US Supreme Court’s decision to allow the revocation of a special legal status that shielded them from deportation. Shortly aft…",
    "link": "https://www.digitaljournal.com/world/disney-suspends-venezuelan-workers-after-protected-status-revoked/article",
    "timestamp": "2025-05-22T23:27:33Z"
  },
  {
    "title": "Trump’s ‘Golden Dome’ missile defense is costly, ambitious — and necessary",
    "description": "Our margin of safety has badly eroded in the face of Chinese and Russian weapons advances — but Trump's $25 billion down payment for missile defense isn't nearly enough.",
    "link": "https://nypost.com/2025/05/22/opinion/trumps-golden-dome-costly-ambitious-and-necessary/",
    "timestamp": "2025-05-22T23:24:27Z"
  },
  {
    "title": "The loud hum sparking unrest in Trump's MAGA heartlands",
    "description": "Trump has said he wants to turn the US into the crypto-mining capital of the world - but that has real-world implications for many of his core voters",
    "link": "https://www.bbc.com/news/articles/cx2qg6e03l2o",
    "timestamp": "2025-05-22T23:23:52Z"
  },
  {
    "title": "Social Security income tax deduction clears critical hurdle",
    "description": "On the campaign trail, President Donald Trump pledged to eliminate federal income taxes on Social Security benefits for seniors. \nHowever, that promise went unfulfilled, largely due to legislative constraints. Social Security tax policy cannot be changed thro…",
    "link": "https://biztoc.com/x/d3c3ef4f00cf068b",
    "timestamp": "2025-05-22T23:22:28Z"
  },
  {
    "title": "Tapper and Thompson discuss book claiming Biden’s inner circle hid signs of decline",
    "description": "The presidential debate between Joe Biden and Donald Trump altered the state of the race, upended the Democratic presidential ticket and changed the course of political history. It also revealed a version of Biden that Jake Tapper and Alex Thompson argue thos…",
    "link": "https://biztoc.com/x/9aa87ba4675d2963",
    "timestamp": "2025-05-22T23:22:11Z"
  },
  {
    "title": "Two cheers on passing the tax bill — too bad spending’s still out of control",
    "description": "We can’t help but mourn the missed opportunity to truly cut federal spending, which remains on an unsustainable trajectory that guarantees future fiscal disaster.",
    "link": "https://nypost.com/2025/05/22/opinion/two-cheers-on-passing-the-tax-bill-too-bad-spendings-still-out-of-control/",
    "timestamp": "2025-05-22T23:21:32Z"
  },
  {
    "title": "Mike Benz Warns ‘Every Center Institute Department At Harvard’ ‘Weaponized Against’ Trump",
    "description": "Mike Benz accused Harvard University on Thursday of acting as a central hub for anti-Trump activity",
    "link": "https://dailycaller.com/2025/05/22/mike-benz-harvard-university-anti-trump/",
    "timestamp": "2025-05-22T23:19:40Z"
  },
  {
    "title": "Secret Service investigates ‘86-47’ sign at Fargo protest",
    "description": "A Secret Service investigation is underway after Judd and Wendy Hoff protested on Interstate 94 bridge with a sign reading “86-47,” seen by some as a threat to President Trump.",
    "link": "https://www.inforum.com/news/fargo/secret-service-investigates-86-47-sign-at-fargo-protest",
    "timestamp": "2025-05-22T23:16:39Z"
  },
  {
    "title": "Indus Waters Treaty will remain in abeyance till Pak stops cross-border terrorism: India",
    "description": "NEW DELHI, May 22: India on Thursday once again asserted that the Indus Waters Treaty with Pakistan will remain in “abeyance” until Islamabad “credibly and irrevocably” abjures support to  cross-border terrorism as “water and blood” cannot flow together. Exte…",
    "link": "https://thehillstimes.in/national/indus-waters-treaty-will-remain-in-abeyance-till-pak-stops-cross-border-terrorism-india",
    "timestamp": "2025-05-22T23:15:00Z"
  },
  {
    "title": "The curious case of Trump's disappearing media transcripts (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nThe curious case of Trump's disappearing media transcripts  —  The Trump White House, which touts itself as “the most transparent” administration in history, has removed a database of official transcripts documenting President Donald Trum…",
    "link": "https://www.memeorandum.com/250522/p150",
    "timestamp": "2025-05-22T23:15:00Z"
  },
  {
    "title": "Golden Dome: An aerospace engineer explains the proposed nationwide missile defense system",
    "description": "President Trump has set aggressive goals for Golden Dome, but many parts of the system already exist.",
    "link": "https://theconversation.com/golden-dome-an-aerospace-engineer-explains-the-proposed-nationwide-missile-defense-system-257408",
    "timestamp": "2025-05-22T23:11:06Z"
  },
  {
    "title": "Hegseth Vows to Involve ‘Best’ US Companies in Missile-Defense ‘Golden Dome’ Construction",
    "description": "Defense Secretary Pete Hegseth reaffirmed America’s commitment to making all the materials for the “Golden Dome” missile-defense shield domestically. “We’re going to defend America with... Read More\nThe post Hegseth Vows to Involve ‘Best’ US Companies in Miss…",
    "link": "https://www.dailysignal.com/2025/05/22/hegseth-vows-involve-best-us-companies-golden-dome-construction/",
    "timestamp": "2025-05-22T23:09:20Z"
  },
  {
    "title": "What RFK Jr.'s MAHA Plan Says About Weed Killers",
    "description": "HHS Secretary Robert F. Kennedy Jr. raised concerns about herbicides in a report released Thursday.",
    "link": "https://www.newsweek.com/what-rfk-jrs-maha-plan-says-about-weed-killers-2076095",
    "timestamp": "2025-05-22T23:08:48Z"
  },
  {
    "title": "Suspect charged with murder of two Israeli embassy workers in Washington DC",
    "description": "The attack is being investigated as a hate crime and could lead to the death penalty, prosecutors say.",
    "link": "https://www.bbc.com/news/articles/c0mr8x9vjwgo",
    "timestamp": "2025-05-22T23:08:25Z"
  },
  {
    "title": "US govt revokes Harvard’s right to enroll foreign students",
    "description": "Donald Trump’s administration on Thursday revoked Harvard’s ability to enroll foreign nationals — more than a quarter of the student body — in a dramatic escalation of the US president’s fight against the prestigious university. The school in Cambridge, Massa…",
    "link": "https://www.digitaljournal.com/world/us-govt-revokes-harvards-right-to-enroll-foreign-students/article",
    "timestamp": "2025-05-22T23:07:20Z"
  },
  {
    "title": "Suspected Jewish Museum Shooter Charged With First-Degree Murder",
    "description": "A man who allegedly shot and killed 2 Israeli Embassy employees in Washington, D.C. outside the Capital Jewish Museum Wednesday night has been charged with first-degree murder and other charges. Elias Rodriguez -- the suspected shooter who was…",
    "link": "https://www.tmz.com/2025/05/22/jewish-museum-shooter-charged-with-first-degree-murder-elias-rodriguez/",
    "timestamp": "2025-05-22T23:06:54Z"
  },
  {
    "title": "Melania Trump Reacts to Israeli Embassy Staffers' Killings",
    "description": "The fatal shooting in D.C. on Wednesday night resulted in the killing of a couple soon to be engaged.",
    "link": "https://www.newsweek.com/melania-trump-reacts-israeli-embassy-staffers-killings-2076137",
    "timestamp": "2025-05-22T23:06:28Z"
  },
  {
    "title": "US to kill off the penny",
    "description": "The US Treasury has confirmed plans to phase out the penny, with one cent coins no longer produced from next year.",
    "link": "https://www.finextra.com/newsarticle/46029/us-to-kill-off-the-penny",
    "timestamp": "2025-05-22T23:05:02Z"
  },
  {
    "title": "Tax bill passed by House Republicans would gut Biden-era clean energy tax credits",
    "description": "At least four Republican senators have urged continuation of energy tax credits.",
    "link": "https://www.bostonherald.com/2025/05/22/congress-clean-energy-tax-credits/",
    "timestamp": "2025-05-22T23:03:00Z"
  },
  {
    "title": "China Is Unhappy with Trump’s “Golden Dome” Missile Defense Plans",
    "description": "The project draws conceptual inspiration from Israel's Iron Dome but is designed to be far more expansive.\nThe post China Is Unhappy with Trump’s “Golden Dome” Missile Defense Plans first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/china-is-unhappy-with-trumps-golden-dome-missile-defense-plans/",
    "timestamp": "2025-05-22T23:00:56Z"
  },
  {
    "title": "Trump says US 'dominating' in crypto",
    "description": "United States President Donald Trump said the US is leading the world in cryptocurrency, writing on Truth Social that the country is \"DOMINATING in Crypto, Bitcoin, etc.\"\n\"We are going...",
    "link": "https://biztoc.com/x/2a828a627f20115c",
    "timestamp": "2025-05-22T23:00:09Z"
  },
  {
    "title": "Springsteen includes anti-Trump speech that sent president into spiral in his new EP",
    "description": "Springsteen includes anti-Trump speech that sent president into spiral in his new EPnj.com",
    "link": "https://www.nj.com/entertainment/2025/05/springsteens-new-ep-includes-anti-trump-speech-that-sent-president-into-spiral.html",
    "timestamp": "2025-05-22T23:00:00Z"
  },
  {
    "title": "Donald Trump Stages an Oval Office Mugging",
    "description": "Susan B. Glasser on how Trump’s ambush on South Africa’s President at the Oval Office was a perfect summation of his racially charged second term.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/donald-trump-stages-an-oval-office-mugging",
    "timestamp": "2025-05-22T22:58:14Z"
  },
  {
    "title": "Lance Bass Reflects On 10th Anniversary, LGBTQ Rights",
    "description": "\"The amount of hate we feel today? It’s worse than 10 years ago,\" the *NSYNC star told Love Inc. on the eve of his 10th anniversary with Michael Turchin.",
    "link": "https://www.huffpost.com/entry/lance-bass-michael-turchin-10th-anniversary-marriage-equality_n_682f7f68e4b0239ca9a6e0db",
    "timestamp": "2025-05-22T22:57:11Z"
  }
]