[
  {
    "title": "How a Government Mind Control Experiment Backfired",
    "description": "Historian John Lisle uncovers how Cold War paranoia, LSD, and unchecked power led the CIA to fund torture, deception, and mind control experiments on unwitting Americans.",
    "link": "https://reason.com/podcast/2025/07/16/how-a-government-mind-control-experiment-backfired/",
    "timestamp": "2025-07-16T15:00:09Z"
  },
  {
    "title": "Tariff Troubles Ahead: Auto Experts Advice on Rising EV and Car Prices",
    "description": "Experts predict near-term price instability for EVs and other vehicles due to Trump's tariffs, potentially leveling off by 2027. Here's what you can do now if you're in the market to buy one.",
    "link": "https://www.cnet.com/home/electric-vehicles/tariff-troubles-ahead-auto-experts-advice-on-rising-ev-and-car-prices/",
    "timestamp": "2025-07-16T15:00:05Z"
  },
  {
    "title": "Cancer risk higher for children who lived near Coldwater Creek, new Harvard study says",
    "description": "The study examined cancer diagnoses in individuals who grew up near Coldwater Creek in the 1950s and ’60s and found that radiation-linked cancers were more common the closer they lived to the creek.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_f64b69d2-242a-4b55-8ff7-376be35476b4.html",
    "timestamp": "2025-07-16T15:00:00Z"
  },
  {
    "title": "July 16 editorial cartoons",
    "description": "Wednesday’s political cartoons include the Epstein files landing on everyone's summer reading list, and the relationship between Donald Trump and Vladimir Putin.",
    "link": "https://theweek.com/cartoons/july-16-2025-editorial-cartoons",
    "timestamp": "2025-07-16T15:00:00Z"
  },
  {
    "title": "Trump Jr.'s 'Gold Digger' Girlfriend Bettina Anderson Wants 'Marriage and Kids' With President's Son — As Family Accuses Socialite Of Using Him to Make Name For Herself",
    "description": "Donald Trump Jr. and his girlfriend, Bettina Anderson, are still going strong, with the socialite said to be aiming for marriage and kids with the president's son.",
    "link": "https://radaronline.com/p/don-trump-jr-gold-digger-girlfriend-bettina-anderson-marriage-kids/",
    "timestamp": "2025-07-16T15:00:00Z"
  },
  {
    "title": "Defeat the Press: How Donald Trump’s Attacks on News Outlets Undermine the First Amendment",
    "description": "Kiss the ring; bend the knee. Whatever metaphor you choose, President Trump has cowed the owners of two major media outlets into paying him millions of dollars. The settlements over Trump’s lawsuits reached between his lawyers and Paramount Global and Disney …",
    "link": "https://variety.com/2025/biz/news/donald-trump-attacks-news-media-first-amendment-1236460374/",
    "timestamp": "2025-07-16T15:00:00Z"
  },
  {
    "title": "Bank of America expects to launch stablecoins as Morgan Stanley weighs use",
    "description": "NEW YORK (Reuters) -Bank of America has been working on stablecoins like the rest of the industry and investors can expect the lender to move forward on this...",
    "link": "https://tech.yahoo.com/business/articles/bank-america-expects-launch-stablecoins-145752756.html",
    "timestamp": "2025-07-16T14:57:52Z"
  },
  {
    "title": "Bank of America expects to launch stablecoin, Morgan Stanley weighs use",
    "description": "NEW YORK :Bank of America is working on launching a stablecoin, and investors can expect the lender to move forward with the cryptocurrency, CEO Brian Moynihan said on Wednesday, without giving a timeline.Stablecoins, a type of cryptocurrency designed to main…",
    "link": "https://www.channelnewsasia.com/business/bank-america-expects-launch-stablecoin-morgan-stanley-weighs-use-5241746",
    "timestamp": "2025-07-16T14:57:52Z"
  },
  {
    "title": "Bank of America expects to launch stablecoins as Morgan Stanley weighs use",
    "description": "NEW YORK (Reuters) -Bank of America has been working on stablecoins like the rest of the industry and investors can expect the lender to move forward on this...",
    "link": "https://finance.yahoo.com/news/bank-america-expects-launch-stablecoins-145752358.html",
    "timestamp": "2025-07-16T14:57:52Z"
  },
  {
    "title": "Bank of America expects to launch stablecoins as Morgan Stanley weighs use",
    "description": "NEW YORK :Bank of America has been working on stablecoins like the rest of the industry and investors can expect the lender to move forward on this, CEO Brian Moynihan said on Wednesday, without giving a timeline.\"We feel both the industry and ourselves will …",
    "link": "https://www.channelnewsasia.com/business/bank-america-expects-launch-stablecoins-morgan-stanley-weighs-use-5241746",
    "timestamp": "2025-07-16T14:57:52Z"
  },
  {
    "title": "Some big US banks plan to launch stablecoins, expecting crypto-friendly regulations",
    "description": "NEW YORK :Some large U.S. lenders, including Bank of America and Citibank, are working on launching stablecoins at a time when the country is looking to adopt more crypto-friendly regulations.BofA CEO Brian Moynihan said on Wednesday the bank is working on la…",
    "link": "https://www.channelnewsasia.com/business/some-big-us-banks-plan-launch-stablecoins-expecting-crypto-friendly-regulations-5241746",
    "timestamp": "2025-07-16T14:57:52Z"
  },
  {
    "title": "Trump insists he wasn’t ‘fooled’ by Russia’s Putin, but the record suggests otherwise",
    "description": "Donald Trump wants the public to believe that Vladimir Putin “didn’t fool” him, but the Republican's recent record is in the way of his absurd talking point.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-insists-wasnt-fooled-russias-putin-record-suggests-otherwise-rcna219081",
    "timestamp": "2025-07-16T14:56:41Z"
  },
  {
    "title": "Barack & Michelle Obama Break Silence on Divorce Rumors: ‘She Took Me …",
    "description": "Reading Time: 3 minutesBarack and Michelle Obama are breaking their silence.\nBarack & Michelle Obama Break Silence on Divorce Rumors: ‘She Took Me … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/07/barack-michelle-obama-break-silence-on-divorce-rumors-she-took-me-back/",
    "timestamp": "2025-07-16T14:55:31Z"
  },
  {
    "title": "'Mark of the beast': Greene warns of End Times as she opposes Trump's pet bill",
    "description": "Rep. Marjorie Taylor Greene (R-GA) suggested that a crypto bill backed by President Donald Trump could be a sign of the End Times predicted in the book of Revelation.Writing Wednesday on X, Greene said she could not support the so-called GENIUS Act after Trum…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-revelation/",
    "timestamp": "2025-07-16T14:55:14Z"
  },
  {
    "title": "Is Donald Trump's Turnberry golf course back in consideration to host a British Open?",
    "description": "Four years after stating Turnberry would not host an Open 'in the foreseeable future,' the R&A says it's had discussions with Trump leadership about hosting the event.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_48265f0d-0323-4ae1-9ef1-02fa2b184065",
    "timestamp": "2025-07-16T14:55:09Z"
  },
  {
    "title": "Asymmetric economic power?",
    "description": "America’s trading partners have largely failed to retaliate against Donald Trump’s sweeping tariffs, allowing a president taunted for “always chickening out” to raise nearly $50bn in extra customs revenues at little cost.\nFour months since Trump fired the ope…",
    "link": "https://biztoc.com/x/b432732e17ee302c",
    "timestamp": "2025-07-16T14:54:49Z"
  },
  {
    "title": "US said to have asked Israel again to halt Syria attacks",
    "description": "The administration of United States President Donald Trump has supposedly asked Israel again to halt its attacks on Syria, Axios' journalist Barak Ravid reported on Wednesday.\"The Trump administration...",
    "link": "https://biztoc.com/x/a32153a013dab7fe",
    "timestamp": "2025-07-16T14:54:45Z"
  },
  {
    "title": "How Trump could use an expensive Fed building renovation to oust Powell",
    "description": "President Donald Trump says he has finally found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, who has resisted the Republican president's calls to slash interest rates out of concerns about the administration's tariffs sparking h…",
    "link": "https://biztoc.com/x/b3287e448fa46147",
    "timestamp": "2025-07-16T14:54:30Z"
  },
  {
    "title": "Trump Says Epstein Controversy Is ‘Bullshit’",
    "description": "President Donald Trump is accusing some of his onetime supporters of being “weaklings” who are falling prey to Democratic “bullshit” about the late sex offender Jeffrey Epstein — concluding that he no longer wants their",
    "link": "https://politicalwire.com/2025/07/16/trump-says-epstein-controversy-is-bullshit/",
    "timestamp": "2025-07-16T14:54:06Z"
  },
  {
    "title": "Microsoft employs engineers in China to manage US DoD systems",
    "description": "Engineers in China are maintaining US Department of Defense computer systems under a contract with Microsoft, a news report said Tuesday.\r\n\n\n\n\nThe arrangement relies on US staff known as “digital escorts” to supervise the Chinese workers, but the escorts ofte…",
    "link": "https://www.computerworld.com/article/4023404/microsoft-employs-engineers-in-china-to-manage-us-dod-systems.html",
    "timestamp": "2025-07-16T14:54:00Z"
  },
  {
    "title": "Trump Says No Longer Supports MAGA 'Weaklings' Still Pressuring Him to Release Epstein Files, Now Labeling Whole Fiasco a 'Hoax'",
    "description": "Donald Trump has declared that he no longer supports conservatives pressuring him to release the files on Jeffrey Epstein, blasting them as \"weaklings.\"",
    "link": "https://www.ibtimes.com/trump-says-no-longer-supports-maga-weaklings-still-pressuring-him-release-epstein-files-now-3778653",
    "timestamp": "2025-07-16T14:52:15Z"
  },
  {
    "title": "President Donald Trump to sign executive order establishing national NIL standards amid evolving legislation",
    "description": "This would be President Trump's latest push to establish NIL standards in college athletics",
    "link": "https://www.cbssports.com/college-football/news/president-donald-trump-to-sign-executive-order-establishing-national-nil-standards-amid-evolving-legislation/",
    "timestamp": "2025-07-16T14:52:14Z"
  },
  {
    "title": "R&A discussed Turnberry British Open with Trump's son",
    "description": "PORTRUSH, Northern Ireland :R&A officials met with the son of U.S. President Donald Trump this year to discuss the possibility of golf's British Open returning to Turnberry, R&A Chief Executive Mark Darbon said on Wednesday.The Scottish course last staged the…",
    "link": "https://www.channelnewsasia.com/sport/ra-discussed-turnberry-british-open-trumps-son-5241711",
    "timestamp": "2025-07-16T14:52:14Z"
  },
  {
    "title": "Trump Admin Ramps Up Election Integrity Pressure On States",
    "description": "The Trump administration is seeking voter data and access to voting equipment from states to strengthen election integrity, The Washington Post reported.",
    "link": "https://dailycaller.com/2025/07/16/trump-admin-ramps-up-election-integrity-pressure-on-states/",
    "timestamp": "2025-07-16T14:51:50Z"
  },
  {
    "title": "'We're going to remind everybody what you did to them': Stefanik put on notice",
    "description": "With the Republican-dominated Congress about to send President Donald Trump a budget bill for his signature that will severely impact people living in rural communities, combined with Trump tariffs that are already hitting consumers in their pocketbooks, GOP …",
    "link": "https://www.rawstory.com/stefanik-2026/",
    "timestamp": "2025-07-16T14:51:38Z"
  },
  {
    "title": "Canada PM Mark Carney Concedes He May Not Be Able to Convince Trump to Drop Tariffs",
    "description": "Leftist Canadian Prime Minister Mark Carney told reporters on Tuesday that he believes it is possible a final trade agreement with the United States would still raise tariffs on Canadian goods, suggesting he may not win any negotiation with President Donald T…",
    "link": "https://www.breitbart.com/economy/2025/07/16/canada-pm-mark-carney-concedes-he-may-not-be-able-to-convince-trump-to-drop-tariffs/",
    "timestamp": "2025-07-16T14:50:51Z"
  },
  {
    "title": "Gold and Silver Are Grinding Sideways. Here’s What Could Change That, and When It Might Happen.",
    "description": "Here are the current bullish and bearish elements in gold and silver, along with my take on what will happen in the precious metals markets next.",
    "link": "https://www.barchart.com/story/news/33441096/gold-and-silver-are-grinding-sideways-heres-what-could-change-that-and-when-it-might-happen",
    "timestamp": "2025-07-16T14:49:59Z"
  },
  {
    "title": "Leaked Memo: ICE To Block Bond Hearings for Millions of Undocumented Immigrants. Detentions To Skyrocket.",
    "description": "Immigrants who arrive illegally in the U.S. may be detained for months or years as they await a resolution to their immigration cases.",
    "link": "https://reason.com/2025/07/16/leaked-memo-ice-to-block-bond-hearings-for-millions-of-undocumented-immigrants-detentions-to-skyrocket/",
    "timestamp": "2025-07-16T14:49:03Z"
  },
  {
    "title": "Trump Stuns by Attacking His Own Supporters Over Epstein: ‘How to Get Even More Questions’",
    "description": "Trump poured more fuel on the Epstein fire as many observers argued his post only raises more questions about his motives.\nThe post Trump Stuns by Attacking His Own Supporters Over Epstein: ‘How to Get Even More Questions’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-stuns-by-attacking-his-own-supporters-over-epstein-how-to-get-even-more-questions/",
    "timestamp": "2025-07-16T14:48:36Z"
  },
  {
    "title": "Trump unloads on Epstein info-seekers: ‘I don’t want their support anymore!’",
    "description": "\"I have had more success in 6 months than perhaps any President in our Country’s history, and all these people want to talk about, with strong prodding by the Fake News and the success starved Dems, is the Jeffrey Epstein Hoax. Let these weaklings continue fo…",
    "link": "https://freerepublic.com/focus/f-chat/4328986/posts",
    "timestamp": "2025-07-16T14:46:57Z"
  },
  {
    "title": "Trump’s Shipbuilding Push Falters as NSC Maritime Office Gutted",
    "description": "Two senior officials at the White House National Security Council have left their roles in recent days, according to two sources familiar with the moves, the latest departures for a body that has been cut sharply in recent months.",
    "link": "https://gcaptain.com/trump-nsc-shipbuilding-office-shakeup/",
    "timestamp": "2025-07-16T14:46:51Z"
  },
  {
    "title": "Support for Canada's battered steel industry expected as Carney lowers hopes for tariff-free trade deal",
    "description": "Prime Minister Mark Carney is expected to announce support for the Canadian steel industry, which has been clobbered by U.S. President Donald Trump’s tariffs, at an event in Hamilton, Ont., later this morning.",
    "link": "https://www.cbc.ca/news/politics/carney-steel-support-steel-1.7586256",
    "timestamp": "2025-07-16T14:46:40Z"
  },
  {
    "title": "By the numbers: Wisconsin's race for governor",
    "description": "The latest fundraising numbers and campaign spending in Wisconsin’s closely watched race for governor shed some light on how the race is shaping up more than a year before voters will start casting ballots",
    "link": "https://abcnews.go.com/Politics/wireStory/numbers-wisconsins-race-governor-123799728",
    "timestamp": "2025-07-16T14:46:29Z"
  },
  {
    "title": "Iran's leader threatens 'even bigger blow' against US, Trump says he's in ‘no rush’ to talk",
    "description": "Iranian Supreme Leader Ayatollah Ali Khamenei warns of further attacks against the U.S. and Israel despite degraded military program, though experts caution that Tehran's missile capabilities remain a threat.",
    "link": "https://www.foxnews.com/world/irans-leader-threatens-even-bigger-blow-against-us-trump-says-hes-no-rush-talk",
    "timestamp": "2025-07-16T14:45:03Z"
  },
  {
    "title": "Mystery bruise reappears on Trump's hand — White House blames handshaking",
    "description": "The White House attempted to explain away a huge bruise on President Donald Trump's hand that aides tried to cover up with thick makeup.According to The Daily Beast, \"Trump, 79, was spotted with a healthy dose of flesh-colored concealer on his right hand as h…",
    "link": "https://www.rawstory.com/white-house-blames-trump-s-huge-hand-bruise-on-serial-handshaking/",
    "timestamp": "2025-07-16T14:44:08Z"
  },
  {
    "title": "Speaker Johnson reveals Musk left MAGA ally's lengthy text hanging in 'the ether' after Trump blowup",
    "description": "Speaker Mike Johnson revealed his text to Elon Musk during his Trump feud went undelivered after the tech billionaire changed his phone number following disagreements.",
    "link": "https://www.foxnews.com/politics/speaker-johnson-reveals-musk-left-maga-allys-lengthy-text-hanging-the-ether-after-trump-blowup",
    "timestamp": "2025-07-16T14:43:43Z"
  },
  {
    "title": "‘Unchanged, Zero!’: CNBC Editor Lauds ‘Very Good News’ About Inflation Under Trump",
    "description": "CNBC editor Rick Santelli revealed on Wednesday that inflationary wholesale prices came in \"better than expected\" in June.",
    "link": "https://dailycaller.com/2025/07/16/santelli-wholesale-inflation-trump/",
    "timestamp": "2025-07-16T14:43:26Z"
  },
  {
    "title": "Trump urges Texas Republicans to make House elections even less democratic to mitigate his enormously unpopular agenda",
    "description": "The contempt Republican elites have for democracy isn’t incidental to the unpopularity of the policies they support: President Donald Trump wants lawmakers in Texas to redraw the state’s congressional district map to give Republicans five more House seats, he…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/trump-urges-texas-republicans-to-make-house-elections-even-less-democratic-to-mitigate-his-enormously-unpopular-agenda",
    "timestamp": "2025-07-16T14:42:00Z"
  },
  {
    "title": "Trump administration sends deportees to tiny African nation Eswatini",
    "description": "The five men hail from Yemen, Laos, Vietnam, Cuba and Jamaica and have long criminal records.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/16/dhs-trump-deports-convicted-criminal-immigrants-eswatini/85238383007/",
    "timestamp": "2025-07-16T14:41:57Z"
  },
  {
    "title": "Trump sprang Ukraine surprise on NATO states – Reuters",
    "description": "Several NATO members reportedly only learned they were to fund American weapons for Kiev when it was announced by the US president Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621575-trump-ukraine-weapons-surprise/",
    "timestamp": "2025-07-16T14:41:29Z"
  },
  {
    "title": "How Trump could use an expensive Fed building renovation to oust Powell",
    "description": "President Donald Trump says he has finally found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, who has resisted the Republican president's calls to slash interest rates out of concerns about the administration's tariffs sparking h…",
    "link": "https://www.pbs.org/newshour/politics/how-trump-could-use-an-expensive-fed-building-renovation-to-oust-powell",
    "timestamp": "2025-07-16T14:41:12Z"
  },
  {
    "title": "Republican Governor Defies Her Party and Vetoes Seven Right-Wing Bills",
    "description": "New Hampshire Republican Governor Kelly Ayotte on Tuesday struck down seven separate right-wing bills in an open rebuke of her party’s MAGA arm. Ayotte vetoed House Bill 324, which gave parents greater power to remove any classroom content they felt was obsce…",
    "link": "https://newrepublic.com/post/198022/new-hampshire-republican-governor-defies-party-vetoes-seven-bills",
    "timestamp": "2025-07-16T14:41:01Z"
  },
  {
    "title": "Former NYPD head accuses Mayor Adams, police brass of 'criminal enterprise'",
    "description": "Tom Donlon, former head of the NYPD, says the organization was rife with crime and corruption\n \n\nTom Donlon, who took over the NYPD after former Commissioner Edward Caban resigned amid a federal probe, said the department was awash in corruption. [ more › ]",
    "link": "https://gothamist.com/news/former-nypd-head-accuses-mayor-adams-police-brass-of-criminal-enterprise",
    "timestamp": "2025-07-16T14:40:00Z"
  },
  {
    "title": "US manufacturing output edges up in June",
    "description": "WASHINGTON (Reuters) -U.S. factory production edged up in June as a decline in motor vehicle output was offset by gains elsewhere, though manufacturing...",
    "link": "https://finance.yahoo.com/news/us-manufacturing-output-edges-june-143728744.html",
    "timestamp": "2025-07-16T14:37:28Z"
  },
  {
    "title": "The Onion skewers Trump administration’s trans panic in hilarious parody video",
    "description": "The Onion is back on top satiricial form after posting a hilarious news clip about a “trans alarm” scare in the White House. The satirical news site, which brands itself as “America’s finest news source” and claims to have been running for over “268 years,” t…",
    "link": "https://www.thepinknews.com/2025/07/16/the-onion-trans-parody-video/",
    "timestamp": "2025-07-16T14:37:08Z"
  },
  {
    "title": "Trump told MAGA to be quiet about Jeffrey Epstein. Fox News obeyed. (MSNBC)",
    "description": "MSNBC:\nTrump told MAGA to be quiet about Jeffrey Epstein.  Fox News obeyed.  —  The president's media allies have mostly followed his marching orders.  —  President Donald Trump's allies at Fox News — and other major MAGA media figures — are obeying his march…",
    "link": "https://www.memeorandum.com/250716/p59",
    "timestamp": "2025-07-16T14:35:01Z"
  },
  {
    "title": "Elon Musk: World's richest man a year after endorsing Trump",
    "description": "The world's richest man backed US President Donald Trump's successful campaign with his funds and high profile. Even after his falling out with Trump, his impact on politics could only be just beginning.",
    "link": "https://www.dw.com/en/elon-musk-supports-trump-2025-election/a-70724719",
    "timestamp": "2025-07-16T14:35:00Z"
  },
  {
    "title": "India's Russian oil imports up slightly in January-June, data shows",
    "description": "India's oil imports from Russia saw a slight increase in the first half of the year, with Reliance Industries and Nayara Energy leading purchases. Despite potential U.S. sanctions, Russian oil remains India's top supplier, constituting 35% of overall supplies…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/indias-russian-oil-imports-up-slightly-in-january-june-data-shows/articleshow/122579709.cms",
    "timestamp": "2025-07-16T14:32:48Z"
  },
  {
    "title": "Donald Trump Is Finally Making Good On Pharma Tariffs Threats, But Stocks Yawn",
    "description": "Trump said late Tuesday his administration will begin implementing pharmaceutical tariffs next month, making good on months of threats.\nThe post Donald Trump Is Finally Making Good On Pharma Tariffs Threats, But Stocks Yawn appeared first on Investor's Busine…",
    "link": "https://biztoc.com/x/b3159a6d0184a51f",
    "timestamp": "2025-07-16T14:32:37Z"
  },
  {
    "title": "Bondi should release 'credible' Epstein files, Trump says",
    "description": "President Donald Trump comments on the Jeffrey Epstein case files amid controversy over DOJ and FBI closing their investigation, contradicting Attorney General Pam Bondi's claims about having a \"truckload\" of information.",
    "link": "https://www.foxnews.com/politics/bondi-should-release-credible-epstein-files-trump-says",
    "timestamp": "2025-07-16T14:32:27Z"
  },
  {
    "title": "Speaker Johnson Calls for Release of Epstein Files",
    "description": "The rift within the Republican Party over the release of documents related to disgraced financier Jeffrey Epstein continued to widen, with top congressional allies of President Donald Trump — including House Speaker Mike Johnson — calling for his administrati…",
    "link": "https://biztoc.com/x/82a8b922756685ae",
    "timestamp": "2025-07-16T14:32:11Z"
  },
  {
    "title": "'Can't fit it in my brain': MAGA hosts implode as Trump calls them 'bad people'",
    "description": "Hosts of the pro-MAGA Real America's Voice network struggled to cope after President Donald Trump said people seeking the truth about Jeffrey Epstein were \"bad people.\"In remarks on Tuesday, the president insisted \"only pretty bad people\" were still intereste…",
    "link": "https://www.rawstory.com/maga-epstein-bad-people/",
    "timestamp": "2025-07-16T14:31:54Z"
  },
  {
    "title": "Aubrey O’Day Reflects on Donald Trump Jr. Romance: ‘He Loved My Mind’",
    "description": "Aubrey O’Day won’t forget the way Donald Trump Jr. made her feel during their relationship. “Don Jr. made me feel the most beautiful,” O’Day, 41, exclusively shared with Us Weekly before appearing on Botched Presents: Plastic Surgery Rewind. “He made me feel …",
    "link": "https://www.usmagazine.com/celebrity-news/news/aubrey-oday-reflects-on-donald-trump-jr-romance-and-confidence/#article",
    "timestamp": "2025-07-16T14:30:44Z"
  },
  {
    "title": "France, Italy reportedly opt out of US-NATO arms deal for Ukraine",
    "description": "France and Italy will not take part in a new NATO-led initiative to finance the delivery of U.S. weapons to Ukraine, Politico and La Stampa reported on July 16, citing undisclosed government officials in both countries. Despite being a long-standing supporter…",
    "link": "https://freerepublic.com/focus/f-news/4328982/posts",
    "timestamp": "2025-07-16T14:30:15Z"
  },
  {
    "title": "Prabowo prioritizes Indonesian workers in landmark US trade agreement",
    "description": "President Prabowo Subianto has stated that the government prioritizes the interests of Indonesians and the protection of Indonesian workers in every ...",
    "link": "https://en.antaranews.com/news/366857/prabowo-prioritizes-indonesian-workers-in-landmark-us-trade-agreement",
    "timestamp": "2025-07-16T14:29:53Z"
  },
  {
    "title": "Dershowitz on Epstein: No 'Client List,' but Jailers May Have Assisted Suicide",
    "description": "Attorney and legal scholar Alan Dershowitz, who once represented Jeffrey Epstein, says the disgraced late billionaire did not maintain a \"client list\" or work for foreign intelligence, but may have had help killing himself.\nThe post Dershowitz on Epstein: No …",
    "link": "https://www.breitbart.com/politics/2025/07/16/dershowitz-on-epstein-no-client-list-but-jailers-may-have-assisted-suicide/",
    "timestamp": "2025-07-16T14:28:00Z"
  },
  {
    "title": "Trump lashes out at ‘weaklings’ who believe Epstein ‘bullsh*t’ amid building GOP pressure to release documents | CNN Politics",
    "description": "President Donald Trump is accusing some of his onetime supporters of being “weaklings” who are falling prey to Democratic “bullshit” about the late sex offender Jeffrey Epstein — concluding that he no longer wants their support.",
    "link": "https://www.cnn.com/2025/07/16/politics/trump-epstein-weaklings-supporters",
    "timestamp": "2025-07-16T14:27:30Z"
  },
  {
    "title": "Court orders Le Pen family to give EU €300k",
    "description": "The ruling concerns the late opposition leader Jean-Marie Le Pen, who was accused of misuse of funds Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621574-le-pen-family-eu-repayment/",
    "timestamp": "2025-07-16T14:27:26Z"
  },
  {
    "title": "BREAKING: Trump Blames Democrats for “Jeffrey Epstein Hoax” – “My PAST Supporters have Bought into this ‘Bullsh*t,’ Hook, Line, and Sinker… I Don’t Want Their Support Anymore!”",
    "description": "Menu GET YOUR TICKETS America First Ground Zero Conference Sponsored by The Gateway Pundit, Aug. 9-10 in Las Vegas, with: Rudy Giuliani, Gen. Mike Flynn, Roger Stone, Lara Logan, Dr. Simone Gold, Christina Bobb, and many more! Tickets are Selling Fast! ADVERT…",
    "link": "https://freerepublic.com/focus/f-bloggers/4328979/posts",
    "timestamp": "2025-07-16T14:25:45Z"
  },
  {
    "title": "Donald Trump says those interested in Jeffrey Epstein inquiry are 'bad people' (Oliver Holmes/The Guardian)",
    "description": "Oliver Holmes / The Guardian:\nDonald Trump says those interested in Jeffrey Epstein inquiry are ‘bad people’  —  US president faces Maga backlash over suspicion his administration is hiding details of Epstein's crimes to protect rich elite - including Trump  …",
    "link": "https://www.memeorandum.com/250716/p58",
    "timestamp": "2025-07-16T14:25:00Z"
  },
  {
    "title": "Analysis-Zelenskiy aims to woo both public and Trump with fresh-faced Ukraine cabinet",
    "description": "KYIV (Reuters) -Ukraine will get its first new prime minister of the war on Thursday, as President Volodymyr Zelenskiy tries to wrestle wartime defence spending into shape and win over both Donald Trump and a war-weary public with fresh-faced leadership. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/07/16/analysis-zelenskiy-aims-to-woo-both-public-and-trump-with-fresh-faced-ukraine-cabinet",
    "timestamp": "2025-07-16T14:25:00Z"
  },
  {
    "title": "U.S. Spy Plane Tracked Near Iran",
    "description": "Flight data map shows the aircraft's mission near Iran just weeks after Israeli and U.S. attacks on its nuclear program",
    "link": "https://www.newsweek.com/us-spy-plane-tracked-near-iran-2099615",
    "timestamp": "2025-07-16T14:24:23Z"
  },
  {
    "title": "Megyn Kelly Calls Out Trump Supporters Blinded by ‘Loyalty’ to President on Epstein",
    "description": "Megyn Kelly called out MAGA influencers and supporters of Trump in the media for letting their \"loyalty\" blind them to the Epstein Files fallout.\nThe post Megyn Kelly Calls Out Trump Supporters Blinded by ‘Loyalty’ to President on Epstein first appeared on Me…",
    "link": "https://www.mediaite.com/media/podcasts/megyn-kelly-calls-out-trump-supporters-blinded-by-loyalty-to-president-on-epstein/",
    "timestamp": "2025-07-16T14:22:28Z"
  },
  {
    "title": "Exclusive—Sen. Jim Banks: Taxpayers Should Not Be Giving NPR Another Dime",
    "description": "We should not be giving NPR another dime for its liberal propaganda masquerading as “news.”\nThe post Exclusive—Sen. Jim Banks: Taxpayers Should Not Be Giving NPR Another Dime appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/16/exclusive-sen-jim-banks-taxpayers-should-not-be-giving-npr-another-dime/",
    "timestamp": "2025-07-16T14:22:06Z"
  },
  {
    "title": "Trump's Turnberry faces hurdles for Open return",
    "description": "President Donald Trump is not getting a British Open to the Turnberry course he owns in the near future, an issue the R&A's new chief executive said was more about transportation than politics.",
    "link": "https://www.espn.com/golf/story/_/id/45753345/donald-trump-turnberry-faces-logistical-hurdles-open-return",
    "timestamp": "2025-07-16T14:21:58Z"
  },
  {
    "title": "Trump Unleashes on His MAGA Base Over Jeffrey Epstein “Bullshit”",
    "description": "Donald Trump started his Tuesday morning with a stark warning to his MAGA followers still interested in the Jeffrey Epstein case: Anyone who wants answers is falling for a Democratic “bullshit.”“The Radical Left Democrats have hit pay dirt, again! Just like w…",
    "link": "https://newrepublic.com/post/198019/trump-unleashes-maga-followers-jeffrey-epstein-bullshit",
    "timestamp": "2025-07-16T14:21:24Z"
  },
  {
    "title": "Trump Lashes Out Over Epstein, Says He Doesn’t ‘Want Support’ of Those Seeking More Info.",
    "description": "In a Truth Social post on Wednesday, President Donald Trump addressed ongoing discussions about Jeffrey Epstein, labeling them as a “hoax” perpetuated by his former supporters and the media. Trump criticized these supporters for being misled by what he descri…",
    "link": "https://freerepublic.com/focus/f-news/4328977/posts",
    "timestamp": "2025-07-16T14:20:45Z"
  },
  {
    "title": "Barack Obama addresses divorce rumors with ‘touch and go’ joke on Michelle’s podcast",
    "description": "Divorce rumors between Barack and Michelle first started in January when she did not attend Jimmy Carter’s funeral",
    "link": "https://www.the-independent.com/life-style/barack-obama-michelle-divorce-rumors-b2790137.html",
    "timestamp": "2025-07-16T14:20:44Z"
  },
  {
    "title": "Democrats Must Lean into Defense of Immigrants (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nDemocrats Must Lean into Defense of Immigrants  —  Trump's reign of terror is rotten policy  —  The multiplicity of lies that Donald Trump and his MAGA followers have perpetrated about immigrants (e.g., they are a bunch of “ki…",
    "link": "https://www.memeorandum.com/250716/p57",
    "timestamp": "2025-07-16T14:20:00Z"
  },
  {
    "title": "Lauren Boebert Floats Worst Person Possible as Epstein Special Counsel",
    "description": "Who better to re-investigate the Epstein case for the Trump administration than another alleged sex trafficker?That’s apparently Colorado Representative Lauren Boebert’s line of thinking. Speaking with far-right commentator Benny Johnson on Tuesday, the QAnon…",
    "link": "https://newrepublic.com/post/198017/lauren-boebert-matt-gaetz-epstein-special-counsel",
    "timestamp": "2025-07-16T14:19:40Z"
  },
  {
    "title": "Little evidence to suggest a U.S. trade deal can be reached without tariffs: Carney",
    "description": null,
    "link": "https://www.nationalobserver.com/2025/07/16/news/little-evidence-suggest-us-trade-deal-can-be-reached-without-tariffs-carney",
    "timestamp": "2025-07-16T14:19:27Z"
  },
  {
    "title": "KALLAS COMPLAINS: Top EU Diplomat Gripes That US Is Not Paying for New Weapons for Ukraine, Thinks 50-Day Ultimatum for Russia ‘Is Too Long’",
    "description": "The new NATO initiative to arm Ukraine rubs Kallas wrong.\nThe post KALLAS COMPLAINS: Top EU Diplomat Gripes That US Is Not Paying for New Weapons for Ukraine, Thinks 50-Day Ultimatum for Russia ‘Is Too Long’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/kallas-complains-top-eu-diplomat-gripes-that-us/",
    "timestamp": "2025-07-16T14:15:47Z"
  },
  {
    "title": "Trump's controversial plan to fire federal workers finds favor with Supreme Court",
    "description": "The Supreme Court cleared the way for mass Education Department layoffs, bolstering President Donald Trump’s federal workforce cuts while legal battles continue.",
    "link": "https://www.foxnews.com/politics/trumps-controversial-plan-fire-federal-workers-finds-favor-supreme-court",
    "timestamp": "2025-07-16T14:15:35Z"
  },
  {
    "title": "The Award For Worst Idea Ever Made on Cable News Goes To…Greg Gutfeld",
    "description": "Greg Gutfeld said conservatives should reclaim the word Nazi like Black Americans did the N-word. It was a joke—but a reckless one with real consequences.\nThe post The Award For Worst Idea Ever Made on Cable News Goes To…Greg Gutfeld first appeared on Mediait…",
    "link": "https://www.mediaite.com/opinion/the-award-for-worst-idea-ever-made-on-cable-news-goes-togreg-gutfeld/",
    "timestamp": "2025-07-16T14:13:24Z"
  },
  {
    "title": "Hunter Biden blames Dems’ disloyalty to his father for their defeat",
    "description": "“We had the advantage of incumbency, we had the advantage of an incredibly successful administration, and the Democratic Party literally melted down,” the former first son said.",
    "link": "https://nypost.com/2025/07/16/us-news/hunter-biden-blames-dems-disloyalty-to-his-father-for-their-defeat/",
    "timestamp": "2025-07-16T14:12:59Z"
  },
  {
    "title": "SEO’s Next Era: Manick Bhan on AI, Content Strategy, and Building a Brand That Lasts",
    "description": "SEO’s Next Era: Manick Bhan on AI, Content Strategy, and Building a Brand That Lasts written by John Jantsch read more at Duct Tape Marketing\nListen to the full episode: Overview In this episode of the Duct Tape Marketing Podcast, John Jantsch interviews Mani…",
    "link": "https://ducttapemarketing.com/ai-seo-strategy-manick-bhan/",
    "timestamp": "2025-07-16T14:12:13Z"
  },
  {
    "title": "GrabAGun Digital Holdings Inc (PEW) crashes 19% on NYSE debut despite Donald Trump Jr. hype — what went wrong and is there a bounce ahead?",
    "description": "GrabAGun Digital Holdings Inc stock (PEW) made a dramatic entrance on the NYSE, catching attention with Donald Trump Jr. ringing the opening bell. But the hype turned fast as the stock tumbled nearly 19% on its debut day, falling to $17.33. Backed by a $179 m…",
    "link": "https://economictimes.indiatimes.com/news/international/us/grabagun-digital-holdings-inc-pew-crashes-19-on-nyse-debut-despite-donald-trump-jr-hype-what-went-wrong-and-is-there-a-bounce-ahead/articleshow/122578321.cms",
    "timestamp": "2025-07-16T14:10:47Z"
  },
  {
    "title": "Trump Slams Supporters for Believing Jeffrey Epstein 'Bulls***'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump has lashed out at Republicans who have criticized the Justice Department's decision to close the Epstein case without releasing a client list or further evidence.\nBlaming \"Radical Left Democrats,\"…",
    "link": "https://biztoc.com/x/7f53de3eb5aed959",
    "timestamp": "2025-07-16T14:10:26Z"
  },
  {
    "title": "Donald Trump reaps US$50 billion tariff haul as world ‘chickens out’",
    "description": "U.S. trading partners have failed to retaliate against Donald Trump's tariffs, allowing him to raise US$50 billion in revenue. Read more.",
    "link": "https://financialpost.com/financial-times/donald-trump-tariff-world-chickens-out",
    "timestamp": "2025-07-16T14:10:11Z"
  },
  {
    "title": "Zelensky urges Trump to revisit Ukrainian missile proposal",
    "description": "Ukraine’s first request to host nuclear-capable Tomahawks was rejected under the Biden administration Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621571-zelensky-trump-missiles-ukraine/",
    "timestamp": "2025-07-16T14:09:36Z"
  },
  {
    "title": "‘I’m Taking A Certain Win’: CNN Airs Segment About Family That Self-Deported To Mexico Under Trump",
    "description": "CNN on Tuesday aired a segment of a family that chose to self-deport to Mexico from Pittsburgh, Pennsylvania under Donald Trump's second administration.",
    "link": "https://dailycaller.com/2025/07/16/cnn-airs-segment-family-that-self-deported-mexico-trump/",
    "timestamp": "2025-07-16T14:06:49Z"
  },
  {
    "title": "Trump Slams Supporters for Believing Jeffrey Epstein 'Bulls***'",
    "description": "Trump has hit out at his \"past\" supporters who criticized the Justice Department's decision to close the Epstein case.",
    "link": "https://www.newsweek.com/trump-slams-supporters-believing-jeffrey-epstein-bulls-2099697",
    "timestamp": "2025-07-16T14:05:24Z"
  },
  {
    "title": "Selected Articles: Fidel Castro’s Message against Nuclear War: “In a nuclear war, the ‘collateral damage’ would be the life of all humanity.”",
    "description": "Fidel Castro’s Message against Nuclear War: “In a nuclear war, the ‘collateral damage’ would be the life of all humanity.”\nBy Fidel Castro Ruz, July 16, 2025\nThe use of nuclear weapons in a new war would mean the …\nThe post Selected Articles: Fidel Castro’s M…",
    "link": "https://www.globalresearch.ca/selected-articles-fidel-castro-message-against-nuclear-war/5895208",
    "timestamp": "2025-07-16T14:05:05Z"
  },
  {
    "title": "Japan decries China threat after string of risky encounters",
    "description": "Japan's defense officials have warned China's intensifying military activities could \"seriously impact\" its security, while also using their annual white paper to highlight the growing alliance of North Korea and Russia.",
    "link": "https://www.dw.com/en/japan-decries-china-threat-after-string-of-risky-encounters/a-73296532",
    "timestamp": "2025-07-16T14:05:00Z"
  },
  {
    "title": "Trump Says He Doesn’t Understand Interest In ‘Boring’ Epstein Files: Here’s A Timeline Of Events",
    "description": "The president asked his supporters to “let Pam Bondi do her job” as she faces scrutiny over handling the release of documents related to the disgraced financier.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/16/trump-says-he-doesnt-understand-interest-in-boring-epstein-files-heres-a-timeline-of-events/",
    "timestamp": "2025-07-16T14:04:15Z"
  },
  {
    "title": "How Trump could use a building renovation to oust Fed Chair Powell",
    "description": "President Donald Trump says he's found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, accusing him of mismanaging the U.S. central bank’s $2.5 billion renovation project.",
    "link": "https://www.news4jax.com/news/politics/2025/07/16/how-trump-could-use-a-building-renovation-to-oust-the-fed-chair/",
    "timestamp": "2025-07-16T14:00:57Z"
  },
  {
    "title": "EXCLUSIVE: Conservative groups urging Trump admin to expose anti-Christian ‘pattern’ in Biden FBI",
    "description": "A coalition of conservative groups is urging the Trump DOJ and FBI to release documents about the “pattern of dishonesty and religious discrimination\" under the Biden FBI.",
    "link": "https://www.foxnews.com/politics/exclusive-conservative-groups-urging-trump-admin-expose-anti-christian-pattern-biden-fbi",
    "timestamp": "2025-07-16T14:00:28Z"
  },
  {
    "title": "Russian bombardment targets Zelenskyy's hometown, injuring at least 15 people",
    "description": "Russia has pounded four Ukrainian cities, injuring at least 15 people in an attack that mostly targeted energy infrastructure, officials said.",
    "link": "https://www.abc.net.au/news/2025-07-17/russian-drone-attack-injures-at-least-15-ahead-of-trump-deadline/105540158",
    "timestamp": "2025-07-16T14:00:02Z"
  },
  {
    "title": "Thom Tillis isn't mad — but he is prepared to tangle with the 'disrespectful' (Burgess Everett/Semafor)",
    "description": "Burgess Everett / Semafor:\nThom Tillis isn't mad — but he is prepared to tangle with the ‘disrespectful’  —  Thom Tillis isn't in rebellion mode against President Donald Trump or Republican leadership.  He's simply making clear that he won't tolerate disrespe…",
    "link": "https://www.memeorandum.com/250716/p53",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Why Donald Trump is facing doubts in the 'manosphere' (Steve Contorno/CNN)",
    "description": "Steve Contorno / CNN:\nWhy Donald Trump is facing doubts in the ‘manosphere’  —  Justin Centers fits the profile of many younger men who helped power Donald Trump's political comeback last fall.  —  He's a 21-year-old autoworker from the Detroit suburbs and wa…",
    "link": "https://www.memeorandum.com/250716/p52",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Heather Cox Richardson: Everything You Need to Know About Immigration Law",
    "description": "Before he was elected President, John F. Kennedy published a book titled “A Nation of Immigrants.” He celebrated the fact that his family was descended from Irish immigrants, and almost every one else (excluding native Americans) was descended from immigrants…",
    "link": "https://dianeravitch.net/2025/07/16/heather-cox-richardson-everything-you-need-to-know-about-immigration-law/",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Live Around the Planet: Wednesday July 16th",
    "description": "UPPESTDATE! If you missed today's edition of Mark's Clubland Q&A live around the planet, here's the action replay. UPPERDATE! We're live now, so let's have at it! UPDATE! We'll be going live in about fifteen minutes, so do get ready to fire off your",
    "link": "https://www.steynonline.com/15452/live-around-the-planet-wednesday-july-16th",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "WATCH: Victor Davis Hanson predicts what ‘egomaniac, narcissistic’ judges will try next to sabotage Trump",
    "description": "'They think that they can run the country. I don't know how they would enforce it. They're not federal law enforcement'",
    "link": "https://www.wnd.com/2025/07/watch-victor-davis-hanson-predicts-what-egomaniac-narcissistic/",
    "timestamp": "2025-07-16T13:58:57Z"
  },
  {
    "title": "How Donald Trump's Plan to Arm Ukraine Differs From Joe Biden's",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's push for European NATO members to purchase U.S.-made weapons for Ukraine marks a shift from the more direct military support for Kyiv of his predecessor, Joe Biden.\nBut unlike Biden, T…",
    "link": "https://biztoc.com/x/06df5e58e94f74d7",
    "timestamp": "2025-07-16T13:58:48Z"
  },
  {
    "title": "Trump Melts Down Over Epstein ‘Hoax,’ Slams Supporters Who Believe ‘This Bullsh*t’: ‘I Don’t Want Their Support Anymore!’",
    "description": "Trump, in a stunning social media post, branded the Epstein story a \"hoax\" and said he doesn't want the support of those who \"bought into this bullsh*t.\"\nThe post Trump Melts Down Over Epstein ‘Hoax,’ Slams Supporters Who Believe ‘This Bullsh*t’: ‘I Don’t Wan…",
    "link": "https://www.mediaite.com/media/news/trump-melts-down-over-epstein-hoax-slams-supporters-who-believe-this-bullsht-i-dont-want-their-support-anymore/",
    "timestamp": "2025-07-16T13:57:29Z"
  }
]