[
  {
    "title": "South Park S27: JD Vance Offers Baby Oil-Free Response to Episode",
    "description": "The good news for Donald Trump? Wednesday night's episode of Trey Parker and Matt Stone's South Park, S27E02: \"Got a Nut,\" took it easy on him this week (though he didn't walk away clean). The same cannot be said for U.S. Dept. of Homeland Security \"Cosplay Q…",
    "link": "https://bleedingcool.com/tv/south-park-s27-jd-vance-offers-baby-oil-free-response-to-episode/",
    "timestamp": "2025-08-07T14:53:05Z"
  },
  {
    "title": "Inside Jeffrey Epstein’s mansion: A Pope, a President, and a PM share space with Trump",
    "description": "At these gatherings, celebrities, scientists, financiers, intellectuals, and several young women would rub shoulders as framed portraits of Jeffrey Epstein with a prime minister, a Pope, an oil-rich Prince and a President would keep them company.",
    "link": "https://indianexpress.com/article/world/jeffrey-epstein-bill-gates-donald-trump-pope-pm-president-mansion-pics-10175824/",
    "timestamp": "2025-08-07T14:52:56Z"
  },
  {
    "title": "Ex-Superman Dean Cain Says He’s Joining ICE",
    "description": "Between 1993 and 1997, Cain spent much of his time time unclothed with Teri Hatcher. Now he’s reacting to James Gunn’s Superman by apparently becoming an immigration enforcement agent.",
    "link": "https://www.vanityfair.com/hollywood/story/dean-cain-joining-ice",
    "timestamp": "2025-08-07T14:52:17Z"
  },
  {
    "title": "Trump's Latest Executive Orders Live Updates: President To Sign New Directives Into Law",
    "description": "President Donald Trump is expected to sign a series of executive orders on Thursday, focusing on banking and investments. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/trumps-latest-executive-orders-live-updates-president-sign-new-directives-law-2110273",
    "timestamp": "2025-08-07T14:51:35Z"
  },
  {
    "title": "Key GOP Vote To Confirm RFK Jr. Now Calls His Vaccine Policies 'Unfortunate'",
    "description": "Sen. Bill Cassidy is facing the consequences of his vote to confirm the anti-vaxxer as Donald Trump's health and human services secretary.",
    "link": "https://www.huffpost.com/entry/rfk-jr-vaccines-bill-cassidy_n_6894a384e4b0fd51291b6a98",
    "timestamp": "2025-08-07T14:50:13Z"
  },
  {
    "title": "Apple in, Intel out: Trump remakes the US tech industry to MAGA specs",
    "description": "US News: The TOI correspondent from Washington: In an ominous sign for foreign-born CEOs of globalized American tech companies, MAGA supremo Donald Trump on Th.",
    "link": "https://timesofindia.indiatimes.com/world/us/apple-in-intel-out-trump-remakes-the-us-tech-industry-to-maga-specs/articleshow/123169163.cms",
    "timestamp": "2025-08-07T14:48:30Z"
  },
  {
    "title": "Trump Tariffs: Did Swiss gold refiners fuel the crisis?",
    "description": "Many were baffled when Donald Trump slapped a steep 39% tariff on imports from Switzerland. The Swiss aren't known for flooding the US with cheap goods, but their outsized role in gold refining is distorting trade data.",
    "link": "https://biztoc.com/x/ca7393a820ac331d",
    "timestamp": "2025-08-07T14:47:41Z"
  },
  {
    "title": "Why the oil market does not believe Trump's threats to tariff countries that buy Russian crude",
    "description": "Oil closed 1% lower Wednesday after President Donald Trump announced new India tariffs. Traders seem to believe Trump won't really follow through.",
    "link": "https://biztoc.com/x/3b729392b3cd007a",
    "timestamp": "2025-08-07T14:47:33Z"
  },
  {
    "title": "BCG analysed plan to ‘relocate’ Gazans to Somalia: What Financial Times’ report found",
    "description": "What kind of work did the consultancy firm BCG do on Gaza, and why did it later disavow it? We explain.",
    "link": "https://indianexpress.com/article/explained/explained-global/bcg-plan-relocate-gaza-somalia-ft-riviera-10176212/",
    "timestamp": "2025-08-07T14:47:24Z"
  },
  {
    "title": "Trump’s endless new tariffs are threatening businesses — and you",
    "description": "Stop me if you've heard this one before: a new wave of tariffs are taking effect today. Announced on July 31st, the latest set of tariffs imposed by President Donald Trump on foreign imports - possibly illegally - will set a floor of 15 percent for around 40 …",
    "link": "https://www.theverge.com/policy/754356/trump-reciprocal-tariffs-august",
    "timestamp": "2025-08-07T14:45:46Z"
  },
  {
    "title": "Doctor exposes shocking disparity in medicine costs between the US and Australia",
    "description": "Why do Australians pay less than $10 for medicines that cost Americans thousands?",
    "link": "https://www.news.com.au/lifestyle/health/shocking-comparison-of-medicine-costs-between-the-us-and-australia/news-story/d5334f68bfb37a57fb51d25df41a031d",
    "timestamp": "2025-08-07T14:45:45Z"
  },
  {
    "title": "“Well, I Finally Made It”: JD Vance Responds To His Blistering ‘South Park’ Debut",
    "description": "Vice President JD Vance gave a short response to South Park, as the show skewered him and other Trump administration figures in the second episode of the latest season. “Well, I’ve finally made it,” Vance wrote on X, linking to the show’s post featuring a min…",
    "link": "http://deadline.com/2025/08/jd-vance-south-park-debut-1236481177/",
    "timestamp": "2025-08-07T14:45:07Z"
  },
  {
    "title": "Spencer Pratt Visits D.C. to Support L.A. Fires Investigation, Escalating Battle With Gavin Newsom and Karen Bass: ‘I’m Literally Their Worst Nightmare’ (EXCLUSIVE)",
    "description": "Mr. Pratt goes to Washington, indeed. On Aug. 4, the reality star touched down in the nation’s capital for a three-day trip to meet with a slew of top federal officials including Attorney General Pam Bondi about the catastrophic fires that ravaged Los Angeles…",
    "link": "https://variety.com/2025/tv/news/spencer-pratt-la-fires-washington-dc-gavin-newsom-1236481427/",
    "timestamp": "2025-08-07T14:45:00Z"
  },
  {
    "title": "Kremlin says Putin and Trump will meet soon, Zelensky confers with Europeans",
    "description": "Vladimir Putin and Donald Trump will meet in the coming days, the Kremlin said on Thursday, as the U.S. president seeks a breakthrough to end the Ukraine war after voicing mounting frustration with his Russian counterpart and threatening him with new sanction…",
    "link": "https://www.independent.ie/world-news/kremlin-says-putin-and-trump-will-meet-soon-zelensky-confers-with-europeans/a980386516.html",
    "timestamp": "2025-08-07T14:44:42Z"
  },
  {
    "title": "Manitoba premier calls U.S. politicians 'attention-seekers' throwing a 'timber tantrum' over wildfire smoke",
    "description": "Manitoba Premier Wab Kinew accused a group of Republicans of throwing a \"timber tantrum\" and playing \"political games\" after they called out Canada over wildfires sending smoke billowing across the international border into their states.",
    "link": "https://www.cbc.ca/news/canada/manitoba/premier-us-republicans-wildfire-smoke-timber-tantrum-1.7603143",
    "timestamp": "2025-08-07T14:43:26Z"
  },
  {
    "title": "Zelenskyy tells Putin to 'be brave' and finally agree to trilateral meeting with Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy on Thursday confirmed he discussed a trilateral meeting to include Russian President Vladimir Putin, potentially as soon as next week, in a call with President Donald Trump one day prior. Zelenskyy – who echoed comments…",
    "link": "https://freerepublic.com/focus/f-chat/4333216/posts",
    "timestamp": "2025-08-07T14:42:15Z"
  },
  {
    "title": "HTX Partners with World Liberty Financial to Support USD1 Points Program",
    "description": "PANAMA CITY, Aug. 7, 2025 /PRNewswire/ -- HTX, a global leading cryptocurrency exchange, is proud to announce its partnership with World Liberty Financial (WLFI), becoming one of the esteemed launch partners for the USD1 Points Program — the world's first glo…",
    "link": "https://www.prnewswire.co.uk/news-releases/htx-partners-with-world-liberty-financial-to-support-usd1-points-program-302524460.html",
    "timestamp": "2025-08-07T14:42:00Z"
  },
  {
    "title": "Skydance Closes $8 Billion Paramount Deal After Colbert Got the Axe",
    "description": "The Skydance-Paramount merger is officially a done deal -- and it’s all going down as \"The Late Show with Stephen Colbert\" rolls through its final season. Skydance Media, led by CEO David Ellison, closed its massive $8 billion acquisition of…",
    "link": "https://www.tmz.com/2025/08/07/skydance-closes-paramount-deal-stephen-colbert-david-ellison/",
    "timestamp": "2025-08-07T14:40:59Z"
  },
  {
    "title": "Alan Dershowitz Yelled Out of Farmers Market for Being a Jerk",
    "description": "Alan Dershowitz was once again denied pierogies at a farmers market. After being turned away by the vendors of the Good Pierogi stand at the West Tisbury Farmer’s Market in Martha’s Vineyard last week, Donald Trump’s former lawyer once again left the market e…",
    "link": "https://newrepublic.com/post/198889/alan-dershowitz-farmers-market-pierogis",
    "timestamp": "2025-08-07T14:40:57Z"
  },
  {
    "title": "Trump's Attack on Wind, Solar Cuts Deeper Than Industry Expected (Bloomberg)",
    "description": "Bloomberg:\nTrump's Attack on Wind, Solar Cuts Deeper Than Industry Expected  —  Takeaways by Bloomberg AI  —  Hide … Tell us how AI is shaping your news experience.  Share your feedback  —  President Donald Trump is escalating his attacks on wind and solar po…",
    "link": "https://www.memeorandum.com/250807/p53",
    "timestamp": "2025-08-07T14:40:00Z"
  },
  {
    "title": "Trump to Sign Order Targeting Banks on Political Discrimination",
    "description": "President Donald Trump plans to sign an executive order Thursday aimed at eliminating practices by banks and their regulators that result in certain customers being denied access to financial services for ideological reasons.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-sign-order-targeting-banks-on-political-discrimination",
    "timestamp": "2025-08-07T14:38:19Z"
  },
  {
    "title": "Saudi Arabia Crown Prince MBS to Meet Trump in Washington in November",
    "description": "Saudi Crown Prince Mohammed Bin Salman plans to meet US President Donald Trump in Washington in November, according to people with knowledge of the preparations.",
    "link": "https://financialpost.com/pmn/business-pmn/saudi-arabia-crown-prince-mbs-to-meet-trump-in-washington-in-november",
    "timestamp": "2025-08-07T14:38:06Z"
  },
  {
    "title": "ICE takes a page from Patriot Front's playbook, which is also ICE's playbook [Asinine]",
    "description": "ICE takes a page from Patriot Front's playbook, which is also ICE's playbook",
    "link": "https://www.fark.com/comments/13769068/ICE-takes-a-page-from-Patriot-Fronts-playbook-which-is-also-ICEs-playbook",
    "timestamp": "2025-08-07T14:37:58Z"
  },
  {
    "title": "Trump demands resignation of Intel’s new CEO",
    "description": "Intel is a company in crisis, failing to compete with the products of its booming rivals and struggling to get back on its feet after a high-profile leadership shakeup and devastating layoffs. The last thing it needs is to be in the crosshairs of an increasin…",
    "link": "https://www.pcworld.com/article/2871288/trump-demands-resignation-of-intels-new-ceo.html",
    "timestamp": "2025-08-07T14:37:44Z"
  },
  {
    "title": "Trump seeks to change how census collects data and wants to exclude immigrants in US illegally",
    "description": "Trump is seeking to exclude immigrants in the United States illegally.",
    "link": "https://www.denverpost.com/2025/08/07/trump-us-census-changes/",
    "timestamp": "2025-08-07T14:37:13Z"
  },
  {
    "title": "Trump seeks to change how census collects data and wants to exclude immigrants in US illegally",
    "description": "Trump is seeking to exclude immigrants in the United States illegally.",
    "link": "https://www.bostonherald.com/2025/08/07/trump-us-census-changes/",
    "timestamp": "2025-08-07T14:37:13Z"
  },
  {
    "title": "Trump accuses Intel CEO of being ‘highly conflicted,’ demands resignation as Tom Cotton highlights reporting into China ties",
    "description": "President Donald Trump sent a jolt through the tech industry on Thursday, demanding the immediate resignation of Intel’s chief executive officer, Lip-Bu Tan, and branding him as “highly conflicted.” The call, issued via Trump’s Truth Social platform, follows …",
    "link": "https://biztoc.com/x/47ce3ef5b6a63547",
    "timestamp": "2025-08-07T14:36:37Z"
  },
  {
    "title": "Intel’s stock tumbles after Trump says its CEO must resign",
    "description": "Shares of Intel slumped Thursday after President Donald Trump said in a social media post that the chipmaker’s CEO needs to resign.\n“The CEO of Intel is highly CONFLICTED and must resign, immediately,” Trump posted on Truth Social. “There is no other solution…",
    "link": "https://biztoc.com/x/fdd0e9d2137cee9d",
    "timestamp": "2025-08-07T14:36:19Z"
  },
  {
    "title": "Trump Treasury Dept. Sanctions ‘Narco-Rapper’ El Makabelico Who Laundered Streaming Proceeds to Mexican Drug Lords",
    "description": "Aug. 7 (UPI) — The United States has blacklisted three high-ranking members and an associated rapper of the notorious Cartel del Noreste, as the Trump administration targets drug trafficking organizations amid it immigration crackdown.\nThe post Trump Treasury…",
    "link": "https://www.breitbart.com/entertainment/2025/08/07/trump-treasury-dept-sanctions-narco-rapper-el-makabelico-who-laundered-streaming-proceeds-to-mexican-drug-lords/",
    "timestamp": "2025-08-07T14:36:01Z"
  },
  {
    "title": "CBS Host’s Fears Of ‘Colonialism’ On The Moon Are Too Crazy Even For Lefty Scientist",
    "description": "CBS News host Vladimir Duthiers feared on Wednesday that President Donald Trump's plans to put a nuclear reactor on the moon will lead to \"colonialism.\"",
    "link": "https://dailycaller.com/2025/08/07/cbs-vladimir-duthiers-claims-new-space-race-would-lead-to-moon-colonialism/",
    "timestamp": "2025-08-07T14:35:47Z"
  },
  {
    "title": "A woman accused of fraud hired the AG's brother as her lawyer. Months later, DOJ dropped charges (ABC News)",
    "description": "ABC News:\nA woman accused of fraud hired the AG's brother as her lawyer.  Months later, DOJ dropped charges  —  The woman was represented by Brad Bondi, the brother of AG Pam Bondi.  —  Attorney General Pam Bondi speaks during a news conference with President…",
    "link": "https://www.memeorandum.com/250807/p50",
    "timestamp": "2025-08-07T14:35:01Z"
  },
  {
    "title": "Trump set to sign executive order going after ‘debanking’ | CNN Business",
    "description": "President Donald Trump is expected to sign an executive order Thursday that would punish banks for restricting services to customers based on their political or religious beliefs, formalizing “debanking” protections that conservatives and crypto industry advo…",
    "link": "https://www.cnn.com/2025/08/07/business/debanking-executive-order-trump",
    "timestamp": "2025-08-07T14:34:38Z"
  },
  {
    "title": "Former Superman actor Dean Cain says he’s joining ICE",
    "description": "Former Superman actor Dean Cain joins ICE to support President Trump’s immigration policies and calls the system “broken”",
    "link": "https://www.wisn.com/article/dean-cain-joins-ice-trump-immigration-crackdown/65625331",
    "timestamp": "2025-08-07T14:34:35Z"
  },
  {
    "title": "Former Superman actor Dean Cain says he’s joining ICE",
    "description": "Former Superman actor Dean Cain joins ICE to support President Trump’s immigration policies and calls the system “broken”",
    "link": "https://www.wmur.com/article/dean-cain-joins-ice-trump-immigration-crackdown/65625331",
    "timestamp": "2025-08-07T14:34:28Z"
  },
  {
    "title": "Trump Is Considering Intervening in NYC Mayor's Race to Thwart Mamdani: Report",
    "description": "A new report says President Donald Trump is considering some form of intervention in the New York City mayoral election.",
    "link": "https://www.westernjournal.com/trump-considering-intervening-nyc-mayors-race-thwart-mamdani-report/",
    "timestamp": "2025-08-07T14:34:19Z"
  },
  {
    "title": "Trump Set To Meet With Putin With Peace Deadline Looming",
    "description": "Russian President Vladimir Putin is set to meet with President Donald Trump in the coming days as the end of Trump's 10-day peace deadline looms.",
    "link": "https://dailycaller.com/2025/08/07/trump-meet-putin-peace-deadline-looming-ukraine-war/",
    "timestamp": "2025-08-07T14:34:09Z"
  },
  {
    "title": "Apple’s new investment in US may be just enough to appease Trump, for now at least",
    "description": "Apple to invest an additional $100bn in the US over four years, beefing up its manufacturing capabilities there",
    "link": "https://www.irishtimes.com/business/2025/08/07/apples-new-investment-in-us-may-be-just-enough-to-appease-trump-for-now-at-least/",
    "timestamp": "2025-08-07T14:33:49Z"
  },
  {
    "title": "Wall Street Indices Edge Higher As Trump's Chip Tariffs Include Broad Exemptions",
    "description": "All the three major US stock indices edged higher during the early minutes of trade on Thursday as the chip tariffs announced by US President Donald Trump include broad exemptions. The S&P 500 rose 0.73% while the Nasdaq Composite climbed 1.21% The Dow Jones …",
    "link": "https://www.ndtvprofit.com/markets/us-stock-market-today-wall-street-indices-edge-higher-as-trumps-chip-tariffs-include-broad-exemptions",
    "timestamp": "2025-08-07T14:33:43Z"
  },
  {
    "title": "The vice president tried to laugh off his cartoon roasting as the show keeps coming after Team Trump.",
    "description": "Vice President JD Vance attempted to make light of South Park shrinking him to a pint-size “manbaby” who oils Satan’s backside for President Donald Trump...",
    "link": "https://www.thedailybeast.com/jd-vance-addresses-south-park-humiliation-as-trumps-manbaby-minion/",
    "timestamp": "2025-08-07T14:33:20Z"
  },
  {
    "title": "Who is Intel CEO Lip-Bu Tan — and why is Donald Trump demanding his resignation?",
    "description": "Trump demands Intel CEO resignation: Donald Trump is demanding Intel CEO Lip-Bu Tan's resignation, citing alleged ties to Chinese tech firms with military links, raising national security concerns. Senator Tom Cotton echoed these worries, questioning Tan's in…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-intel-ceo-lip-bu-tan-and-why-is-donald-trump-demanding-his-resignation-intel-ceo-latest-news/articleshow/123168518.cms",
    "timestamp": "2025-08-07T14:32:24Z"
  },
  {
    "title": "Intel CEO, Malaysia-born tech veteran Lip-Bu Tan's connections with China companies, PLA army exposed. Details here",
    "description": "Intel CEO Lip-Bu Tan has made hundreds of investments in Chinese companies over decades through Walden International, the San Francisco venture capital firm he founded in 1987, and two Hong Kong-based holding companies, Sakarya Limited and Seine Limited.",
    "link": "https://economictimes.indiatimes.com/news/international/us/intel-ceo-malaysia-born-tech-lip-bu-tans-connections-with-china-companies-pla-army-exposed-details-here/articleshow/123168916.cms",
    "timestamp": "2025-08-07T14:31:13Z"
  },
  {
    "title": "Trump Defends Elon Musk as Howard Lutnick Snickers Over Billionaire’s Dismal Polling Crash",
    "description": "Trump defended Elon Musk during a presser as Commerce Secretary Howard Lutnick laughed behind him at the mention of the tech billionaire’s polling crash.\nThe post Trump Defends Elon Musk as Howard Lutnick Snickers Over Billionaire’s Dismal Polling Crash first…",
    "link": "https://www.mediaite.com/media/tv/trump-defends-elon-musk-as-howard-lutnick-snickers-over-billionaires-dismal-polling-crash/",
    "timestamp": "2025-08-07T14:30:41Z"
  },
  {
    "title": "Catholic Bishops Celebrate Overturning Biden Abortion Policy: “Abortion is Not Health Care” - LifeNews.com",
    "description": "The president of the United States Conference of Catholic Bishops (USCCB) and the USCCB Committee on Pro-life Activities chairman this week praised a policy proposal to reinstate a long-standing Department of Veterans Affairs rule that ensured abortion was no…",
    "link": "https://www.lifenews.com/2025/08/07/catholic-bishops-celebrate-overturning-biden-abortion-policy-abortion-is-not-health-care/",
    "timestamp": "2025-08-07T14:30:23Z"
  },
  {
    "title": "Trump’s Farmworker Remarks Remind X Users Of His Racism",
    "description": "President Donald Trump's comments on the need for immigrants to be farm labor during an interview drew heavy backlash, with many on social media seeing analogies to the defenders of slavery and calling out his past racist remarks.",
    "link": "https://hiphopwired.com/playlist/trumps-farmworker-remarks-remind-x-users-of-his-racism/",
    "timestamp": "2025-08-07T14:30:13Z"
  },
  {
    "title": "Donald Trump Says He Knows Exactly When Howard Stern Lost His Audience",
    "description": "No, it wasn't when Trump told Stern he could call Ivanka 'a piece of ass'",
    "link": "https://www.cracked.com/article_47769_donald-trump-says-he-knows-exactly-when-howard-stern-lost-his-audience.html",
    "timestamp": "2025-08-07T14:30:00Z"
  },
  {
    "title": "Exclusive: India train bagpiper banned from TikTok speaks out: 'Can we be proud of our past?'",
    "description": "A Scottish bagpiper has received a bounty of backlash after going viral with videos promoting Western culture in foreign countries. At just 20 years old, Robin Alderslowe decided to travel around the world and spread Scottish music with a desire to keep his c…",
    "link": "https://www.theblaze.com/align/bagpiper-banned-from-tik-tok",
    "timestamp": "2025-08-07T14:30:00Z"
  },
  {
    "title": "What's The Point of Being Rich",
    "description": "So strangeApple is putting another $100 billion toward expanding manufacturing in the US as the company responds to pressure from President Donald Trump to manufacture more of its products in the US. The move builds upon the company’s initial plan to invest $…",
    "link": "https://www.eschatonblog.com/2025/08/whats-point-of-being-rich.html",
    "timestamp": "2025-08-07T14:30:00Z"
  },
  {
    "title": "Bad history v. fake history",
    "description": "Last night I watched Denial, the 2016 film about the David Irving-Deborah Lipstadt libel trial. It’s a pretty good film about an extremely important subject, which is the crisis of knowledge in contemporary societies — a crisis that has gotten much worse sinc…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/bad-history-v-fake-history",
    "timestamp": "2025-08-07T14:29:50Z"
  },
  {
    "title": "‘That’s A New One’: Scott Jennings Cracks Up When CNN Panelist Claims DOGE Shut Down Diners",
    "description": "CNN Senior Political Commentator Scott Jennings appeared incredulous when Tara Setmayer claimed the Department of Government Efficiency (DOGE) shut down diners.",
    "link": "https://dailycaller.com/2025/08/07/scott-jennings-laughs-cnn-panelist-claims-doge-shut-down-diners/",
    "timestamp": "2025-08-07T14:29:46Z"
  },
  {
    "title": "Sen. John Cornyn says the FBI granted his request to help find absent Texas Democrats",
    "description": "Sen. John Cornyn, R-Texas, said Thursday that the FBI has approved his request for federal law enforcement to help locate Texas state Democratic lawmakers who left the state in an effort to block GOP redistricting efforts.\"I am proud to announce that Director…",
    "link": "https://www.nbcnews.com/politics/congress/sen-john-cornyn-says-fbi-granted-request-help-find-texas-democrats-rcna223599",
    "timestamp": "2025-08-07T14:29:09Z"
  },
  {
    "title": "Trump accuses Intel CEO of being ‘highly conflicted,’ demands resignation as Tom Cotton highlights reporting into China ties",
    "description": "“The CEO of Intel is highly CONFLICTED and must resign, immediately. There is no other solution to this problem. Thank you for your attention to this problem!” Trump wrote Thursday morning.",
    "link": "https://fortune.com/2025/08/07/trump-intel-ceo-resign-highly-conflicted-china-chips/",
    "timestamp": "2025-08-07T14:27:58Z"
  },
  {
    "title": "Diddy plans comeback concert at Madison Square Garden",
    "description": "Sean ‘Diddy’ Combs is aiming to headline Madison Square Garden for a return concert after being convicted and jailed on federal charges. The rapper, 55, is currently languishing in jail awaiting his sentencing in October after his recent trial, and his lawyer…",
    "link": "https://rollingout.com/2025/08/07/diddy-plans-comeback-concert/",
    "timestamp": "2025-08-07T14:27:22Z"
  },
  {
    "title": "'We're Fast Stumbling Into Stagflation,' Expert Warns as Unemployment Rolls Hit 4-Year High Under Trump",
    "description": "The flow of abysmal U.S. economic data continued Thursday with the release of figures showing that the number of Americans collecting unemployment benefits has reached its highest level in nearly four years, heightening concerns that the Trump administration …",
    "link": "https://www.commondreams.org/news/trump-economy-stagflation",
    "timestamp": "2025-08-07T14:27:16Z"
  },
  {
    "title": "Trump Demands New US Census As Redistricting War Spreads",
    "description": "US President Donald Trump on Thursday ordered officials to work on a new census excluding undocumented immigrants, as the White House presses Republican states to draw more favorable voter maps ahead of the 2026 midterm elections.",
    "link": "https://www.ibtimes.com/trump-demands-new-us-census-redistricting-war-spreads-3780429",
    "timestamp": "2025-08-07T14:27:09Z"
  },
  {
    "title": "Putin says he hopes to meet Trump as the White House presses for a peace deal on Ukraine",
    "description": "Putin’s foreign affairs adviser Yuri Ushakov said a summit could possibly take place next week. A meeting would be a significant milestone.",
    "link": "https://www.pbs.org/newshour/world/putin-says-he-hopes-to-meet-trump-as-the-white-house-presses-for-a-peace-deal-on-ukraine",
    "timestamp": "2025-08-07T14:26:50Z"
  },
  {
    "title": "Apple to switch to advanced American-made iPhone camera sensors",
    "description": "Samsung Electronics will produce digital image sensors for Apple at its semiconductor facility in Austin, Texas in the latest sign…\nThe post Apple to switch to advanced American-made iPhone camera sensors appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/07/apple-to-switch-to-advanced-american-made-iphone-camera-sensors/",
    "timestamp": "2025-08-07T14:26:50Z"
  },
  {
    "title": "EXCLUSIVE: Trump Makes Universities Fork Over Admissions Data To Prove They’re Not Doing Affirmative Action",
    "description": "Trump is expected to sign an order on Thursday, ordering higher education institutions to hand over their admissions data, an official told the Daily Caller.",
    "link": "https://dailycaller.com/2025/08/07/donald-trump-affirmative-action-higher-education-institutions-universities-admissions-data/",
    "timestamp": "2025-08-07T14:26:02Z"
  },
  {
    "title": "Trump tariffs hit dozens of countries",
    "description": "Sweeping new tariffs on more than 90 countries around the world - which US president Donald Trump has advocated for - have come into effect.\n\nProducers of staple goods such as Brazilian coffee say the tariffs will have a big impact on their industry.\n\nAlso in…",
    "link": "https://www.bbc.co.uk/programmes/w172zss6c83q8ns",
    "timestamp": "2025-08-07T14:26:00Z"
  },
  {
    "title": "Democrats press Google on Trump talks",
    "description": "Senate Democrats, including Elizabeth Warren, on Thursday questioned whether Google is negotiating with President Donald Trump's legal team to settle a censorship lawsuit in exchange for \"favorable tr...",
    "link": "https://biztoc.com/x/21fb2bfd50bbb57c",
    "timestamp": "2025-08-07T14:25:33Z"
  },
  {
    "title": "Trump demands CEO of Intel resign over ties to China",
    "description": "President Donald Trump has called for Lip-Bu Tan to immediately resign as Intel’s CEO over his reported ties to Chinese tech firms. The demand follows Arkansas Senator Tom Cotton questioning Intel’s board chairman whether Tan’s alleged connections to China wo…",
    "link": "https://www.theverge.com/news/754269/trump-intel-ceo-lip-bu-tan-china",
    "timestamp": "2025-08-07T14:25:28Z"
  },
  {
    "title": "The Secondary Sanctions Squeeze",
    "description": "By Moon of Alabama, Ron Paul Institute for Peace and Prosperity | August 06, 2025\nUS President Donald Trump is now largely following his predecessors hostile policy towards Russia. If the war in Ukraine continues on its current path, Russia will end it with a…",
    "link": "https://biztoc.com/x/ebbbb2c124d6bd59",
    "timestamp": "2025-08-07T14:25:20Z"
  },
  {
    "title": "Ontario premier warns Ottawa needs to be ready for Trump to reopen CUSMA trade pact ahead of schedule",
    "description": "OTTAWA — Ontario Premier \n \n \n \n \n \n \n \n \n \n Doug Ford\n \n \n \n \n \n \n \n \n \n is warning that United States President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n could choose to suddenly “pull the carpet out from underneath us” by opening up the trade agr…",
    "link": "https://biztoc.com/x/dbae703d77fa7f07",
    "timestamp": "2025-08-07T14:25:19Z"
  },
  {
    "title": "US applications for jobless benefits up modestly but remain at a healthy level",
    "description": "Jobless claims saw a slight increase last week, signaling a potential softening in the labor market amid economic uncertainties. Despite remaining within a healthy historical range, the rise coincides with disappointing jobs data, significant revisions to pre…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-applications-for-jobless-benefits-up-modestly-but-remain-at-a-healthy-level/articleshow/123168883.cms",
    "timestamp": "2025-08-07T14:24:32Z"
  },
  {
    "title": "New Detail Blows Huge Hole in Trump’s Story About Epstein Friendship",
    "description": "A resurfaced line from a 2007 New York Post report has called into question whether Donald Trump actually booted Jeffrey Epstein from Mar-a-Lago when he said he did.The president has claimed that his long friendship with the pedophilic socialite corroded afte…",
    "link": "https://newrepublic.com/post/198888/new-detail-donald-trump-story-epstein-friendship",
    "timestamp": "2025-08-07T14:23:18Z"
  },
  {
    "title": "GOP Rep Posts Photo of Naked Man, in Wild Fight With Rival Congressman",
    "description": "Elected Republicans these days seem to view the gravity of their office with naked contempt—but this Wisconsin representative took it to a whole new level.Republican Representative Derrick Van Orden tweeted out a picture of a nude dude with a ski mask, taggin…",
    "link": "https://newrepublic.com/post/198886/republican-representative-van-orden-fight-photo-naked-man-ski-mask",
    "timestamp": "2025-08-07T14:22:25Z"
  },
  {
    "title": "FBI granted request to locate fleeing Texas House Democrats, Sen. Cornyn says",
    "description": "Sen. John Cornyn says FBI Director Kash Patel granted his request to assist with locating Texas Democrats who fled the state over GOP redistricting efforts.",
    "link": "https://abcnews.go.com/Politics/sen-cornyn-fbi-granted-request-locate-fleeing-texas/story?id=124446304",
    "timestamp": "2025-08-07T14:20:48Z"
  },
  {
    "title": "Trump energizes conservative Christians with new religious policies (Peter Smith/Associated Press)",
    "description": "Peter Smith / Associated Press:\nTrump energizes conservative Christians with new religious policies  —  In his first half-year in office — amid his tariff campaign, government-slashing moves and immigration crackdown — President Donald Trump has also repeated…",
    "link": "https://www.memeorandum.com/250807/p45",
    "timestamp": "2025-08-07T14:20:00Z"
  },
  {
    "title": "Viral: Apple CEO Tim Cook gifts a 24K gold and glass statue to Donald Trump, netizens react",
    "description": "Apple plans to invest heavily in American manufacturing. Tim Cook presented Donald Trump with a custom-made gift. It symbolizes Apple's commitment to the US. The gift includes a Corning glass and a 24K gold base. Apple will invest $600 billion over four years…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/viral-apple-ceo-tim-cook-gifts-a-24k-gold-and-glass-statue-to-donald-trump-netizens-react/articleshow/123168731.cms",
    "timestamp": "2025-08-07T14:19:52Z"
  },
  {
    "title": "Truth Social's AI search is powered by Perplexity, but the platform can set limits on sources | TechCrunch",
    "description": "The search engine, dubbed Truth Search AI, is already available on the web version of Truth Social, with public Beta testing on the iOS and Android apps planned for “the near future.”",
    "link": "https://techcrunch.com/2025/08/07/truth-socials-ai-search-is-powered-by-perplexity-but-the-platform-can-set-limits-on-sources/",
    "timestamp": "2025-08-07T14:19:30Z"
  },
  {
    "title": "Man charged with killing a top Minnesota House Democrat is expected to plead not guilty",
    "description": "A man is expected to plead not guilty in the killings of the top Democrat in the Minnesota House and her husband.",
    "link": "https://www.bostonherald.com/2025/08/07/minnesota-lawmakers-shot-defendant-plead/",
    "timestamp": "2025-08-07T14:17:25Z"
  },
  {
    "title": "EXCLUSIVE: Federal Prosecutors Drop Bogus Case Against Carolina Amesty and Immediately the MSM Falsely Implicates AG Pam Bondi of Wrongdoing",
    "description": "The DOJ finally drops the bogus charges against rising GOP star Carolina Amesty and immediately the corrupt MSM accuses Pam Bondi of wrongdoing.  We reported a week ago that an up and coming GOP superstar in the Florida House was targeted by the Biden regime’…",
    "link": "https://joehoft.com/breaking-exclusive-federal-prosecutors-finally-drop-bogus-case-against-carolina-amesty-and-immediately-the-msm-falsely-implicates-ag-pam-bondi-of-wrongdoing/",
    "timestamp": "2025-08-07T14:15:07Z"
  },
  {
    "title": "RFK Jr. touts rural health investment during Fairbanks stop, draws protests",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. and U.S. Sens. Lisa Murkowski and Dan Sullivan discussed rural health care with Tanana Chiefs Conference leaders at Chief Andrew Isaac Health Center Wednesday afternoon, the second day of Kennedy’s tou…",
    "link": "https://www.newsminer.com/news/local_news/rfk-jr-touts-rural-health-investment-during-fairbanks-stop-draws-protests/article_baa35031-2210-4b43-b08b-d9cbad13e320.html",
    "timestamp": "2025-08-07T14:15:00Z"
  },
  {
    "title": "Tua Tagovailoa Awkwardly Hypes Presidential Fitness Council While Admitting He Didn’t Know He’d Joined Before The White House Issued A Press Release",
    "description": "Tua Tagovailoa was one of a handful of notable NFL players who were among the high-profile athletes who’d seemingly agreed to throw their support behind Donald Trump’s President’s Council on Sports, Fitness, and Nutrition. However, as was the case with Saquon…",
    "link": "https://brobible.com/sports/article/tua-tagovailoa-unaware-presidential-fitness-council-appointment/",
    "timestamp": "2025-08-07T14:14:51Z"
  },
  {
    "title": "1 Reason to Watch Diageo Stock in 2025",
    "description": "In This Article:\nKey Points\n-\nIt's all about the tariffs.\n-\nThe company said it was able to mitigate about half the effect of the previous, lower levies from the Trump administration.\nOver the past few months, the stop-and-start tariffs imposed by President D…",
    "link": "https://biztoc.com/x/335c4bd067554bcb",
    "timestamp": "2025-08-07T14:14:22Z"
  },
  {
    "title": "Trump calls for Intel CEO's head over alleged China links",
    "description": "Chipzilla boss accused of huge conflict of interest\nUS President Donald Trump has called for the immediate resignation of Intel's recently installed chief exec, following concerns raised by a Republican Senator over his links with China.…",
    "link": "https://biztoc.com/x/308c0bbad8cb6dc7",
    "timestamp": "2025-08-07T14:14:20Z"
  },
  {
    "title": "Donald Trump opens US 401Ks to crypto and private equity investments",
    "description": "",
    "link": "https://biztoc.com/x/048226558a9a5ce6",
    "timestamp": "2025-08-07T14:13:56Z"
  },
  {
    "title": "Why the oil market does not believe Trump's threats to tariff countries that buy Russian crude",
    "description": "Oil closed 1% lower Wednesday after President Donald Trump announced new India tariffs. Traders seem to believe Trump won't really follow through.",
    "link": "https://www.cnbc.com/2025/08/07/trump-putin-russia-oil-secondary-tariffs-sanctions-india-china-ukraine.html",
    "timestamp": "2025-08-07T14:13:21Z"
  },
  {
    "title": "Israel Is Weighing Its Options In Gaza. Here Are 4 Scenarios For What May Happen Next.",
    "description": "For days now, Israeli media have reported that Prime Minister Benjamin Netanyahu is on the verge of ordering the full reoccupation of Gaza.",
    "link": "https://www.huffpost.com/entry/whats-next-for-israel-gaza_n_6894b321e4b0da3ab57f5074",
    "timestamp": "2025-08-07T14:11:04Z"
  },
  {
    "title": "Putin says United Arab Emirates possible site for his meeting with Trump",
    "description": "Vladimir Putin has indicated that the United Arab Emirates could be a potential location for a meeting with US President Donald Trump. This announcement followed Putin's discussions with Sheikh Mohammed bin Zayed Al Nahyan, the UAE's president, in the Kremlin.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-says-united-arab-emirates-possible-site-for-his-meeting-with-trump/articleshow/123168688.cms",
    "timestamp": "2025-08-07T14:10:21Z"
  },
  {
    "title": "‘South Park’ mocks Kristi Noem and the Trump administration in its latest episode | CNN",
    "description": "“South Park” creators Trey Parker and Matt Stone are clearly not done with the Trump administration.",
    "link": "https://www.cnn.com/2025/08/07/entertainment/south-park-kristi-noem-trump-administration",
    "timestamp": "2025-08-07T14:10:00Z"
  },
  {
    "title": "This Group ‘WILL NOT BE COUNTED’ in Census, Trump Says",
    "description": "President Donald Trump ordered the Department of Commerce to start work on a new census in which illegal immigrants will not be counted. “I have... Read More\nThe post This Group ‘WILL NOT BE COUNTED’ in Census, Trump Says appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/07/this-group-will-not-be-counted-in-census-trump-says/",
    "timestamp": "2025-08-07T14:10:00Z"
  },
  {
    "title": "Trump Fired the BLS Chief. He Was Right–But for All the Wrong Reasons",
    "description": "President Donald Trump fired the Commissioner of the Bureau of Labor Statistics, Dr. Erika McEntarfer, stating, without evidence, that she falsified job numbers to assist\nThe post Trump Fired the BLS Chief. He Was Right–But for All the Wrong Reasons appeared …",
    "link": "https://www.evilhrlady.org/2025/08/trump-fired-the-bls-chief-he-was-right-but-for-all-the-wrong-reasons.html",
    "timestamp": "2025-08-07T14:09:38Z"
  },
  {
    "title": "'Liberation Day' tariffs: How they could impact prices",
    "description": "President Donald Trump's so-called \"Liberation Day\" tariffs take effect Thursday, raising economists' concerns of the potential financial burden on businesses and consumers.",
    "link": "https://www.wpbf.com/article/liberation-day-tariffs-impacts/65624067",
    "timestamp": "2025-08-07T14:09:33Z"
  },
  {
    "title": "Stock Market Highlights: Nifty, Sensex Shrug Off Trump Tariff Jitters As Bulls Charge Back In Last Hour",
    "description": "Stock Market Highlights: The Indian equity benchmark indices closed in the green, recovering sharply during the last hour of trade snapping its two day decline. Hero MotoCorp, Tech Mahindra, JSW Steel, Wipro and Eternal marked notable gains for the index. The…",
    "link": "https://www.ndtvprofit.com/markets/stock-market-highlights-nifty-sensex-shrug-off-trump-tariff-hike-sharp-recovery-in-the-last-hour-of-trade",
    "timestamp": "2025-08-07T14:09:26Z"
  },
  {
    "title": "Seth Meyers Stunned to See Trump Do the Impossible: He’s Gotten ‘Democrats Off Their Asses’ | Video",
    "description": "\"Seriously, this might be Trump's only actual accomplishment,\" the NBC host says\nThe post Seth Meyers Stunned to See Trump Do the Impossible: He’s Gotten ‘Democrats Off Their Asses’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-trump-accomplishment-motivating-democrats/",
    "timestamp": "2025-08-07T14:09:03Z"
  },
  {
    "title": "Trump Outlandishly Demands Intel CEO Tan's Resignation Over Chinese Ties",
    "description": "Many pundits celebrated the hiring of Lip-Bu Tan to replace Intel's ousted chief executive officer (CEO) earlier this year, but if U.S. President Donald Trump has his way, Tan's tenure as the man in charge of one of the biggest semiconductor firms on the plan…",
    "link": "https://hothardware.com/news/trump-demands-intel-ceo-tans-resignation-chinese-ties",
    "timestamp": "2025-08-07T14:08:00Z"
  },
  {
    "title": "GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts to Vaccine Funding",
    "description": "Sen. Bill Cassidy criticized HHS Secretary Robert F. Kennedy's decision to cut vaccine funding months after being a key vote to have him confirmed.\nThe post GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts t…",
    "link": "https://www.mediaite.com/media/news/gop-senator-bill-cassidy-who-was-key-vote-to-confirm-rfk-jr-blasts-health-honcho-for-massive-cuts-to-vaccine-funding/",
    "timestamp": "2025-08-07T14:07:39Z"
  },
  {
    "title": "Trump's Tariff Formula Confound Economists On Faulty Assumptions, Nil Economic Rationale-Here's Why",
    "description": "US President Donald Trump imposed additional 25% tariffs on import of Indian goods, over India's continued purchase of Russian crude oil. The total tariff on India has now doubled to 50%. Trump's...",
    "link": "https://www.ndtvprofit.com/economy-finance/india-us-trade-deal-trumps-tariff-formula-dead-economy-claims-for-india-are-baseless-heres-why",
    "timestamp": "2025-08-07T14:07:10Z"
  },
  {
    "title": "Trump Says Jimmy Kimmel, Jimmy Fallon Could Lose Late-Night Shows: 'They're Next'",
    "description": "President Donald Trump suggested that late-night hosts Jimmy Fallon and Jimmy Kimmel could face the same cancelation as Stephen Colbert.\nThe post Trump Says Jimmy Kimmel, Jimmy Fallon Could Lose Late-Night Shows: ‘They’re Next’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/07/trump-cryptically-suggests-jimmy-kimmel-and-jimmy-fallon-could-lose-late-night-shows/",
    "timestamp": "2025-08-07T14:06:14Z"
  },
  {
    "title": "Is Intel collapsing under CEO Lip-Bu Tan? What went wrong with one of Silicon Valley's most iconic companies",
    "description": "Intel, once a shining tech giant of Silicon Valley, is slowly losing the AI-chip battle against Taiwanese rival TSMC and Nvidia. Now, President Donald Trump's ultimatum to Intel CEO Lip-Bu Tan over China connections may perhaps deal a body blow.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-intel-collapsing-under-ceo-lip-bu-tan-what-went-wrong-with-one-of-silicon-valleys-most-iconic-companies/articleshow/123168584.cms",
    "timestamp": "2025-08-07T14:05:44Z"
  },
  {
    "title": "VA terminates major union contracts and it will impact over 400,000 federal workers. What's at stake for you?",
    "description": "The Veterans Affairs Department ended collective bargaining agreements with unions. This impacts around 360,000 healthcare workers. The move follows a Trump executive order. It also coincides with plans to reduce the VA workforce. The agency claims this will …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-va-terminates-major-union-contracts-and-it-will-impact-over-400000-federal-workers-whats-at-stake/articleshow/123168576.cms",
    "timestamp": "2025-08-07T14:05:28Z"
  },
  {
    "title": "Truth Social’s new AI search engine basically just pushes Fox News",
    "description": "Donald Trump’s Truth Social has launched a new AI search feature that consistently pushes conservative media sources. The feature, Truth Search AI, is powered by the AI startup Perlexity and is now available on the web version of Trump’s social media platform…",
    "link": "https://www.theverge.com/news/753863/trump-truth-social-ai-search-perplexity-conservative-bias",
    "timestamp": "2025-08-07T14:04:06Z"
  },
  {
    "title": "Can Rupert Murdoch Conquer LA?",
    "description": "Ben Schwartz\n\n\n\nThe tabloid baron will launch a West Coast version of the New York Post next year.\r\n\n\r\n\n\nThe post Can Rupert Murdoch Conquer LA? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/california-post-rupert-murdoch-tabloid-journalism/",
    "timestamp": "2025-08-07T14:03:25Z"
  },
  {
    "title": "Trump calls for Intel CEO's head over alleged China links",
    "description": "Chipzilla boss accused of huge conflict of interest US President Donald Trump has called for the immediate resignation of Intel's recently installed chief exec, following concerns raised by a Republican Senator over his links with China.…",
    "link": "https://www.theregister.com/2025/08/07/republican_senator_queries_intel_over/",
    "timestamp": "2025-08-07T14:03:19Z"
  },
  {
    "title": "Trump To Settle On New Fed Governor By End Of Week",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 05, 2025\nPresident Donald Trump said he would select a new Federal Reserve governor before the end of the week. At a White House event Tuesday in which Trump signed an executive order about preparation…",
    "link": "https://biztoc.com/x/d3b9541b4b665ecd",
    "timestamp": "2025-08-07T14:03:03Z"
  }
]