[
  {
    "title": "DOJ subpoenas more than 20 doctors and clinics providing transgender medical procedures to minors: ‘Mutilated children’",
    "description": "\"Medical professionals and organizations that mutilated children in the service of a warped ideology will be held accountable by this Department of Justice.\"",
    "link": "https://nypost.com/2025/07/11/us-news/doj-subpoenas-over-20-doctors-and-clinics-that-mutilated-children-during-transgender-medical-procedures/",
    "timestamp": "2025-07-11T04:45:33Z"
  },
  {
    "title": "‘Bears in disbelief’ — $1B in crypto shorts wiped as Bitcoin pumps",
    "description": "Crypto analysts quickly highlighted the “massive short squeeze” on Thursday, as surging prices in Bitcoin and Ether led to the liquidation of over 232,149 traders within 24 hours.",
    "link": "https://cointelegraph.com/news/bitcoin-price-bears-surprise-significant-liquidation-shorts",
    "timestamp": "2025-07-11T04:42:35Z"
  },
  {
    "title": "Markets open lower amid trade tensions and IT sector concerns",
    "description": "Sensex opened at 82,820.76, lower than its previous close of 83,190.28. Similarly, the Nifty opened at 25,255.50 compared to its previous close of 25,355.25",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-open-lower-amid-trade-tensions-and-it-sector-concerns/article69799008.ece",
    "timestamp": "2025-07-11T04:42:24Z"
  },
  {
    "title": "Signs of World War III: Trump’s favourite ‘two weeks’ warning returns, major Russia statement looms as White House keeps Putin guessing",
    "description": "President Trump’s cryptic “two weeks” timeline has returned, this time hinting at a “major statement” on Russia amid escalating US-NATO arms shipments to Ukraine and rising tensions with Moscow. Trump’s history of using the phrase before swift, dramatic actio…",
    "link": "https://economictimes.indiatimes.com/news/international/us/signs-of-world-war-iii-trumps-favourite-two-weeks-warning-returns-major-russia-statement-looms-as-white-house-keeps-putin-guessing/articleshow/122378969.cms",
    "timestamp": "2025-07-11T04:37:35Z"
  },
  {
    "title": "House Democrats decry health cuts in GOP tax law",
    "description": "The party is seeking a pathway back to power in Washington but is grappling for a message that will resonate with the working class voters who have migrated toward Republicans in recent elections.",
    "link": "https://www.wbaltv.com/article/house-democrats-decry-health-cuts-gop/65374607",
    "timestamp": "2025-07-11T04:37:02Z"
  },
  {
    "title": "Trump plans to tour Texas flood damage as scope of disaster tests his pledge to shutter FEMA",
    "description": "President Trump is set to visit Texas to assess the flood devastation, a move that contrasts with his earlier pledges to dismantle FEMA. While he acknowledges the tragedy's unprecedented scale and focuses on aiding victims, his administration hasn't abandoned…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-plans-to-tour-texas-flood-damage-as-scope-of-disaster-tests-his-pledge-to-shutter-fema/articleshow/122379234.cms",
    "timestamp": "2025-07-11T04:36:16Z"
  },
  {
    "title": "House Democrats decry health cuts in GOP tax law",
    "description": "The party is seeking a pathway back to power in Washington but is grappling for a message that will resonate with the working class voters who have migrated toward Republicans in recent elections.",
    "link": "https://www.wcvb.com/article/house-democrats-decry-health-cuts-gop/65374607",
    "timestamp": "2025-07-11T04:35:24Z"
  },
  {
    "title": "House Democrats decry health cuts in GOP tax law",
    "description": "The party is seeking a pathway back to power in Washington but is grappling for a message that will resonate with the working class voters who have migrated toward Republicans in recent elections.",
    "link": "https://www.wdsu.com/article/house-democrats-decry-health-cuts-gop/65374607",
    "timestamp": "2025-07-11T04:35:17Z"
  },
  {
    "title": "House Democrats decry health cuts in GOP tax law",
    "description": "The party is seeking a pathway back to power in Washington but is grappling for a message that will resonate with the working class voters who have migrated toward Republicans in recent elections.",
    "link": "https://www.wmur.com/article/house-democrats-decry-health-cuts-gop/65374607",
    "timestamp": "2025-07-11T04:34:50Z"
  },
  {
    "title": "Looming ‘patent cliff’ facing Big Pharma adds to sector’s woes",
    "description": "When blockbuster drugs lose intellectual property protections it can wipe out billions of dollars in revenue for companies",
    "link": "https://www.irishtimes.com/business/2025/07/11/the-looming-patent-cliff-facing-big-pharma/",
    "timestamp": "2025-07-11T04:33:00Z"
  },
  {
    "title": "Israel Believes Some of Iran's Enriched Uranium Survived But not Concerned Over That - Reports",
    "description": "WASHINGTON (Sputnik) - Israel believes that some of the Iranian enriched uranium has survived the US and Israeli attacks, but is not concerned over that, The New York Times reported.",
    "link": "https://sputnikglobe.com/20250711/israel-believes-some-of-irans-enriched-uranium-survived-but-not-concerned-over-that---reports-1122425485.html",
    "timestamp": "2025-07-11T04:31:13Z"
  },
  {
    "title": "EU agrees deal with Israel to get more food and fuel into Gaza as 10 children die outside clinic",
    "description": "European officials struck a new deal with Israel to allow desperately needed food and fuel into Gaza, the European Union’s foreign policy chief said yesterday as an Israeli airstrike killed 10 children and five adults waiting for care outside a medical clinic.",
    "link": "https://www.independent.ie/world-news/middle-east/eu-agrees-deal-with-israel-to-get-more-food-and-fuel-into-gaza-as-10-children-die-outside-clinic/a402990589.html",
    "timestamp": "2025-07-11T04:30:00Z"
  },
  {
    "title": "Annual meeting of Tesla shareholders is delayed to November",
    "description": "Tesla has scheduled an annual shareholders meeting for November, one day after it came under pressure from major shareholders to do so.",
    "link": "https://www.independent.ie/business/annual-meeting-of-tesla-shareholders-is-delayed-to-november/a1136927326.html",
    "timestamp": "2025-07-11T04:30:00Z"
  },
  {
    "title": "Letters: What is happening in Gaza can be compared with horrors of World War II",
    "description": "The punishment of Gaza’s civilian Palestinian population continues.",
    "link": "https://www.independent.ie/opinion/letters/letters-what-is-happening-in-gaza-can-be-compared-with-horrors-of-world-war-ii/a386011411.html",
    "timestamp": "2025-07-11T04:30:00Z"
  },
  {
    "title": "House Democrats decry health cuts in GOP tax law",
    "description": "The party is seeking a pathway back to power in Washington but is grappling for a message that will resonate with the working class voters who have migrated toward Republicans in recent elections.",
    "link": "https://www.wmtw.com/article/house-democrats-decry-health-cuts-gop/65374607",
    "timestamp": "2025-07-11T04:27:39Z"
  },
  {
    "title": "Mayor Of NC Town Hit By Hurricane Helene Says Things ‘Getting Done Faster’ Under Trump Than Biden",
    "description": "Mayor of Hot Springs, North Carolina told CNN that recovery has been getting done \"faster\" under Trump than Biden since Hurricane Helene hit the state in 2024.",
    "link": "https://dailycaller.com/2025/07/11/north-carolina-hot-springs-mayor-hurricane-helene-faster-trump-versus-biden/",
    "timestamp": "2025-07-11T04:20:34Z"
  },
  {
    "title": "Longtime WaPo Columnist Resigns in Scathing Post Denouncing Jeff Bezos’ Influence on Editorial Policy: ‘A Death Blow’",
    "description": "“As a columnist, I can’t live with that level of constraint,” Joe Davidson says\nThe post Longtime WaPo Columnist Resigns in Scathing Post Denouncing Jeff Bezos’ Influence on Editorial Policy: ‘A Death Blow’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/longtime-wapo-columnist-resigns-jeff-bezos-editorial-policy/",
    "timestamp": "2025-07-11T04:19:30Z"
  },
  {
    "title": "NATO Will Pay for US Weapons Designed to Be Supplied to Ukraine - Trump",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said NATO, whose member Washington is, will pay for American weapons that the alliance will subsequently supply to Ukraine.",
    "link": "https://sputnikglobe.com/20250711/nato-will-pay-for-us-weapons-designed-to-be-supplied-to-ukraine---trump-1122425333.html",
    "timestamp": "2025-07-11T04:18:16Z"
  },
  {
    "title": "How Vietnam became a target in Trump’s trade war",
    "description": "Vietnam's economy faces uncertainty as Trump's trade war impacts exports, threatening the country's growth and stability.",
    "link": "https://www.bloomberg.com/news/articles/2025-07-10/how-vietnam-found-itself-a-target-in-trump-s-trade-war",
    "timestamp": "2025-07-11T04:17:41Z"
  },
  {
    "title": "'Wow!': 'Daily Show' Praises Fox News Reporter For Unlocking This 'Core' Trump Memory",
    "description": "Ronny Chieng made light of the president's \"very strong response\" to a wildly \"specific\" assassination threat from Iran.",
    "link": "https://www.huffpost.com/entry/daily-show-ronny-chieng-iran-threat-trump-sunbathe_n_68707664e4b0ec4e1b978c49",
    "timestamp": "2025-07-11T04:12:17Z"
  },
  {
    "title": "An Anarchist Appeal to the Disgruntled Deplorable",
    "description": "“Ooh, that smell Can’t you smell that smell? Ooh, that smell The smell of death surrounds you” ‘Ooh That Smell’ by Lynyrd Skynyrd I may be a hedonistic, post-left, genderfuck, heathen but I’m also a fiercely localist, small town agrarian, Appalachian Luddite …",
    "link": "https://www.counterpunch.org/2025/07/11/an-anarchist-appeal-to-the-disgruntled-deplorable/",
    "timestamp": "2025-07-11T04:11:37Z"
  },
  {
    "title": "Chaos breaks out during immigration raid on world’s largest cannabis farm (VIDEOS)",
    "description": "An immigration raid on a weed farm in California descended into clashes with demonstrators Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621323-ice-agents-raid-pot-farm/",
    "timestamp": "2025-07-11T04:09:02Z"
  },
  {
    "title": "TikTok reorganizes US operations as Trump 'deal' still up in the air",
    "description": "PALO ALTO, California/HONG KONG -- TikTok is restructuring its U.S. operations, including revamping its trust and safety team and its e-commerce arm TikTok Shop, as the popular social media app waits for clarity on a deal to sell its American business that Pr…",
    "link": "https://biztoc.com/x/c1c4550774bc55ea",
    "timestamp": "2025-07-11T04:06:36Z"
  },
  {
    "title": "Plans to Concentrate Gaza Palestinians in Rafah Camp a Crime against Humanity",
    "description": "By James Sweeney, Lancaster University (The Concentration) - The Israel Defense Forces (IDF) are refusing to implement a government plan to move hundreds of thousands of Palestinians into a what it calls a “humanitarian city” in Rafah on Gaza’s southern borde…",
    "link": "https://www.juancole.com/2025/07/concentrate-palestinians-humanity.html",
    "timestamp": "2025-07-11T04:06:06Z"
  },
  {
    "title": "Panasonic to postpone US EV battery plan on slow Tesla sales, Nikkei says",
    "description": "The new target date to reach full production of 30 gigawatt-hours at the $4 billion plant in the US state of Kansas has yet to be fixed",
    "link": "https://www.thehindubusinessline.com/companies/panasonic-to-postpone-us-ev-battery-plan-on-slow-tesla-sales-nikkei-says/article69798940.ece",
    "timestamp": "2025-07-11T04:05:04Z"
  },
  {
    "title": "I Love America: And now it is Bombing my Family in Iran",
    "description": "( Tomdispatch.com ) - We bombed Iran and, despite a temporary cessation of hostilities, it’s likely that President Donald Trump and his counterpart in Tel Aviv, Prime Minister Benjamin Netanyahu, intend to drag the United States into yet another destabilizing…",
    "link": "https://www.juancole.com/2025/07/america-bombing-family.html",
    "timestamp": "2025-07-11T04:04:41Z"
  },
  {
    "title": "MAGA vs. Ultra-MAGA",
    "description": "The movement is splitting between those who value fealty to Trump no matter what and those who still believe in what it originally stood for.\nThe post MAGA vs. Ultra-MAGA appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/maga-vs-ultra-maga/",
    "timestamp": "2025-07-11T04:03:00Z"
  },
  {
    "title": "Myanmar junta chief asks Trump for sharp reduction in 40% tariff rate",
    "description": "Myanmar's ruling military general, Min Aung Hlaing, has appealed to U.S. President Donald Trump for a decrease in the 40% tariff on Myanmar's exports to the U.S. He suggested a reduced rate of 10% to 20%. Myanmar is also ready to lower its levy on U.S. import…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/myanmar-junta-chief-asks-trump-for-sharp-reduction-in-40-tariff-rate/articleshow/122378697.cms",
    "timestamp": "2025-07-11T04:01:57Z"
  },
  {
    "title": "Marco Rubio Drops the Hammer",
    "description": "Photo Credit:Image: Marco Rubio.  Credit: Gage Skidmore via Flickr, CC BY-SA 2.0 (cropped).\r\n\n\n \n Gage SkidmoreFrancesca Albanese, the UN boss trying to turn the ICC into an anti-American, anti-Israeli star chamber, hit with heavy sanctions.",
    "link": "https://www.americanthinker.com/articles/2025/07/marco_rubio_drops_the_hammer.html",
    "timestamp": "2025-07-11T04:00:00Z"
  },
  {
    "title": "Cuba: Protesters Detail Abuses in Prison",
    "description": "A man is arrested during a demonstration against the government of President Miguel Diaz-Canel in Havana, Cuba, July 12, 2021.\n © 2021 YAMIL LAGE/AFP via Getty Images\n \n \n\n\n \nProtesters detained for participating in the peaceful July 2021 protests in Cuba hav…",
    "link": "https://www.hrw.org/news/2025/07/11/cuba-protesters-detail-abuses-in-prison",
    "timestamp": "2025-07-11T04:00:00Z"
  },
  {
    "title": "The Jeffrey Epstein Case Is Far Bigger Than Jeffrey Epstein",
    "description": "On Tuesday, President Trump took umbrage at a question about the Justice Department’s assertion that there are no Epstein tapes, there is no client list, and there is nothing more to be released. The Twitterverse has been brutal towards AG Pam ...",
    "link": "https://www.americanthinker.com/articles/2025/07/the_jeffrey_epstein_case_is_far_bigger_than_jeffrey_epstein.html",
    "timestamp": "2025-07-11T04:00:00Z"
  },
  {
    "title": "DOJ’s Epstein cover-up is a ‘civics test’ for Americans",
    "description": "(See also, “The Jeffrey Epstein Case Is Far Bigger Than Jeffrey Epstein” by Vince Coyner.)\r\n\r\nIt’s fairly rare that I agree with Glenn Beck on a political issue (he’s too much of a neocon for me), but he recently posted a bril...",
    "link": "https://www.americanthinker.com/blog/2025/07/doj_s_epstein_cover_up_is_a_civics_test_for_americans.html",
    "timestamp": "2025-07-11T04:00:00Z"
  },
  {
    "title": "Tom Barrack’s Unrealistic Optimism in Beirut",
    "description": "It is rare to see a seasoned diplomat describe a country’s half-formed political promise as “spectacular,” but Thomas Barrack, the U.S. special envoy to Syria and ambassador to Turkey, appears to believe he has witnessed nothing sho...",
    "link": "https://www.americanthinker.com/articles/2025/07/tom_barrack_s_unrealistic_optimism_in_beirut.html",
    "timestamp": "2025-07-11T04:00:00Z"
  },
  {
    "title": "Philippines' president to discuss tariffs in Trump meeting this month, top diplomat says",
    "description": "KUALA LUMPUR: Philippine President Ferdinand Marcos Jr will meet US President Donald Trump in Washington this month, Manila's top diplomat said on Friday (Jul 11), with an increased trade tariff on one of Washington's top defence allies set to be discussed.  …",
    "link": "https://www.channelnewsasia.com/asia/philippines-president-ferdinand-marcos-jr-discuss-tariffs-meeting-trump-5232991",
    "timestamp": "2025-07-11T03:59:32Z"
  },
  {
    "title": "IT stocks drag Sensex over 300 pts lower, Nifty below 25,300",
    "description": "Indian equity benchmark indices commenced trading on a negative note on Friday, influenced by disappointing Q1 results from Tata Consultancy Services. Fresh tariffs imposed by US President Donald Trump on Canada further contributed to the market's decline. Th…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-drag-sensex-over-300-pts-lower-nifty-below-25300/articleshow/122378598.cms",
    "timestamp": "2025-07-11T03:59:04Z"
  },
  {
    "title": "Trump to host Philippine president to discuss trade and security in Asia",
    "description": "The Philippines' ambassador to the U.S. said President Donald Trump will host his Philippine counterpart in the White House “very soon” to discuss how the longtime treaty allies can further deepen their security and economic engagements and bolster det...",
    "link": "https://abcnews.go.com/International/wireStory/trump-host-philippine-president-discuss-trade-security-asia-123665329",
    "timestamp": "2025-07-11T03:58:25Z"
  },
  {
    "title": "Rupee Opens Weak Against US Dollar Amid Tariff Tensions",
    "description": "The Indian rupee opened weak against the US dollar at 85.83 on Friday, after closing at 85.65 on Thursday. The rupee's trading range for the day is expected to be between 85.52 and 85.9, said Amit Gupta, research support at Kedia Stocks & Commodities Research…",
    "link": "https://www.ndtvprofit.com/markets/rupee-opens-weak-against-us-dollar-amid-tariff-tensions",
    "timestamp": "2025-07-11T03:58:19Z"
  },
  {
    "title": "Trump plans to hike tariffs on Canadian goods to 35%",
    "description": "President Donald Trump says he will raise taxes on many imported goods from Canada to 35%, deepening a rift between two North American countries that have suffered a debilitating blow to their decades-old alliance",
    "link": "https://abcnews.go.com/Business/wireStory/trump-plans-hike-tariffs-canadian-goods-35-123664989",
    "timestamp": "2025-07-11T03:58:17Z"
  },
  {
    "title": "Israel warns: Iran’s uranium potentially retrievable after US strikes",
    "description": "Israeli official says that the deeply buried enriched uranium at an Iranian nuclear facility may be retrievable, complicating assessments of US strike damage.",
    "link": "https://www.israelnationalnews.com/news/411498",
    "timestamp": "2025-07-11T03:53:09Z"
  },
  {
    "title": "Donald Trump threatens new tariffs on Canada - Financial Times",
    "description": "Donald Trump threatens new tariffs on CanadaFinancial Times Trump Threatens Higher Tariffs on Canada in the Middle of Trade TalksThe New York Times Trump threatens a 35% tariff on Canadian goods, and he may double what most other nations are chargedCNN Trump …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178331162",
    "timestamp": "2025-07-11T03:52:38Z"
  },
  {
    "title": "‘Bitten By Their Own Creation’: Victor Davis Hanson Explains How AOC Squad Ended Up In ‘Lose-Lose’ Dilemma",
    "description": "Victor Davis Hanson appeared on Fox News Thursday and placed much of the blame for the Democrats' growing struggles on the progressive faction of the party.",
    "link": "https://dailycaller.com/2025/07/10/victor-davis-hanson-aoc-democrats-dilemma/",
    "timestamp": "2025-07-11T03:44:49Z"
  },
  {
    "title": "'A familiar position': CNN host chides contradictions in Trump's deportations",
    "description": "CNN host Omar Jimenez chided some glaring contradictions in President Donald Trump's deportation policies during the opening segment of \"Laura Coates Live\" on Thursday. Jimenez's comments happened just hours after a U.S. District Court judge in New Hampshire …",
    "link": "https://www.rawstory.com/trump-2673069066/",
    "timestamp": "2025-07-11T03:42:58Z"
  },
  {
    "title": "Bitcoin jumps to record on institutional investor demand",
    "description": "Bitcoin surged to a record high of $116,781.10 on Friday, driven by strong institutional demand and pro-crypto policies under US President Donald Trump. Supportive measures include a strategic crypto reserve and favourable appointments. Ether also rose over 5…",
    "link": "https://economictimes.indiatimes.com/tech/technology/bitcoin-jumps-to-record-on-institutional-investor-demand/articleshow/122378332.cms",
    "timestamp": "2025-07-11T03:39:33Z"
  },
  {
    "title": "Trump threatens 35% tariff on Canadian goods over dangerous cross-border fentanyl dispute",
    "description": "President Donald Trump is threatening to impose an additional tariff of 35% on Canadian goods on Aug. 1, after accusing the U.S. neighbor to the north of failing to stop the flow of fentanyl into the country and instead retaliating with its own tariffs.\nIn a …",
    "link": "https://biztoc.com/x/d873b63fdbc3830a",
    "timestamp": "2025-07-11T03:32:26Z"
  },
  {
    "title": "Tinubu rejects Trump’s amazing offer",
    "description": "The presidential convoy spread out on the Third Mainland Bridge like a cloud of bats on seasonal migration. Sirens screamed. Lights flashed. The convoy of vehicles unfolds like the hail of light produced when the welder’s electrode kisses a metal, shraaaah! s…",
    "link": "https://punchng.com/tinubu-rejects-trumps-amazing-offer/",
    "timestamp": "2025-07-11T03:30:50Z"
  },
  {
    "title": "India buys more Russian oil—but its rupee-rouble plan isn’t working",
    "description": "Despite a currency deal aimed at bypassing the dollar, Indian refiners are paying for Russian crude through UAE-based traders in dirhams—highlighting limits of the rupee-rouble mechanism.",
    "link": "https://www.livemint.com/industry/energy/india-russia-oil-imports-rupee-rouble-payment-dirham-uae-oil-prices-china-yuan-11752065196437.html",
    "timestamp": "2025-07-11T03:30:14Z"
  },
  {
    "title": "Musk's Tesla marks formal India entry with Mumbai launch event",
    "description": "(Reuters) -Tesla will open its first India showroom in Mumbai next week, having imported $1 million worth of cars and merchandise, marking its entry into the...",
    "link": "https://ca.finance.yahoo.com/news/tesla-launch-first-india-store-032434230.html",
    "timestamp": "2025-07-11T03:24:34Z"
  },
  {
    "title": "Trump Says Noem Did Bang-Up Job on Flood Response Because ‘She Was Literally the First Person I Saw on Television’",
    "description": "President Donald Trump praised Homeland Security Secretary Kristi Noem for her response to the deadly floods in central Texas that have killed more than 120 people.\nThe post Trump Says Noem Did Bang-Up Job on Flood Response Because ‘She Was Literally the Firs…",
    "link": "https://www.mediaite.com/media/tv/trump-says-noem-did-bang-up-job-on-flood-response-because-she-was-literally-the-first-person-i-saw-on-television/",
    "timestamp": "2025-07-11T03:21:28Z"
  },
  {
    "title": "Trump puts 35% tariff on Canada and eyes 15% to 20% tariffs for others",
    "description": "U.S. President Donald Trump told Canadian Prime Minister Mark Carney the new rate would go into effect on Aug. 1 and would go up if Canada retaliated.",
    "link": "https://biztoc.com/x/14c086c0e127f3ca",
    "timestamp": "2025-07-11T03:21:24Z"
  },
  {
    "title": "Trump's copper tariffs plan to include semi-finished products, Bloomberg News reports",
    "description": "Donald Trump plans to impose 50% tariffs on copper starting August 1. The tariffs will include semi-finished products. These products are used for power grids and military applications. The move aims to boost domestic copper industry. A Section 232 investigat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-copper-tariffs-plan-to-include-semi-finished-products-bloomberg-news-reports/articleshow/122378046.cms",
    "timestamp": "2025-07-11T03:21:05Z"
  },
  {
    "title": "Potential U.S. tariffs, pricing rules raise uncertainty in drug industry",
    "description": "The Canadian pharmaceutical industry is bracing for headwinds from the U.S., as President Donald Trump floats 200-per-cent tariffs on the sector and readies a controversial pricing scheme.\nPharmaceuticals have been a frequent target of Mr. Trump’s ire, and he…",
    "link": "https://biztoc.com/x/96baab9f4edc1ac5",
    "timestamp": "2025-07-11T03:20:59Z"
  },
  {
    "title": "Trump Plans 'Major' Russia Statement Monday, Mulls Sanctions (Derek Wallbank/Bloomberg)",
    "description": "Derek Wallbank / Bloomberg:\nTrump Plans ‘Major’ Russia Statement Monday, Mulls Sanctions  —  President Donald Trump said he plans to make a “major statement” on Russia, as the US prepares to send more American weapons to Ukraine via purchases from NATO allies…",
    "link": "https://www.memeorandum.com/250710/p164",
    "timestamp": "2025-07-11T03:20:01Z"
  },
  {
    "title": "Some of Iran's enriched uranium survived U.S. bombing, Israeli official says",
    "description": "Israel believes at least some of Iran’s highly enriched uranium was buried by U.S. strikes and not destroyed or moved beforehand.",
    "link": "https://www.nbcnews.com/world/iran/iran-recover-uranium-israel-watching-israeli-official-says-rcna217966",
    "timestamp": "2025-07-11T03:19:44Z"
  },
  {
    "title": "Trump declares war on the international economic order",
    "description": "Trump has a simple understanding of international relations. In his mind, might makes right.",
    "link": "https://www.japantimes.co.jp/editorials/2025/07/11/trump-war-on-global-economic-order/",
    "timestamp": "2025-07-11T03:19:00Z"
  },
  {
    "title": "Trump puts 35% tariff on Canada and eyes 15% to 20% tariffs for others",
    "description": "U.S. President Donald Trump told Canadian Prime Minister Mark Carney the new rate would go into effect on Aug. 1 and would go up if Canada retaliated.",
    "link": "https://www.japantimes.co.jp/business/2025/07/11/economy/us-canada-tariffs/",
    "timestamp": "2025-07-11T03:19:00Z"
  },
  {
    "title": "China’s economy likely grew 5.2% in Q2 despite trade war: AFP poll",
    "description": "China’s economy is expected to have expanded more than five percent in the second quarter thanks to strong exports, analysts say, but they warned Donald Trump’s trade war could cause a sharp slowdown in the final six months. The world’s second-largest economy…",
    "link": "https://www.digitaljournal.com/world/chinas-economy-likely-grew-5-2-in-q2-despite-trade-war-afp-poll/article",
    "timestamp": "2025-07-11T03:17:32Z"
  },
  {
    "title": "US targets attempts to dodge Trump tariffs with China in crosshairs",
    "description": "Donald Trump's government increases tariff threats. It targets Chinese firms allegedly avoiding duties via third countries. This is called 'transshipping'. Goods rerouted to dodge tariffs will face higher charges. The US aims to close China's backdoor and war…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-targets-attempts-to-dodge-trump-tariffs-with-china-in-crosshairs/articleshow/122378003.cms",
    "timestamp": "2025-07-11T03:17:11Z"
  },
  {
    "title": "Secret Service agents suspended over Trump assassination attempt",
    "description": "Six Secret Service agents suspended for their roles in the July 2024 assassination attempt on Donald Trump. The move follows multiple investigations and the resignation of the agency's director.",
    "link": "https://www.israelnationalnews.com/news/411497",
    "timestamp": "2025-07-11T03:16:20Z"
  },
  {
    "title": "Trump plans to hit Canada with 35% tariff - while warning of blanket hike for other countries",
    "description": "Donald Trump has said he plans to hit Canada with a 35% tariff on imported goods, as he warned of a blanket 15 or 20% hike for most other countries.",
    "link": "https://news.sky.com/story/donald-trump-plans-to-hit-canada-with-new-tariff-while-warning-of-blanket-hike-for-other-countries-13395231",
    "timestamp": "2025-07-11T03:16:00Z"
  },
  {
    "title": "Traders Brush Off New Trump Threats To Extend Stocks Rally",
    "description": "Stocks mostly rose Friday in Asia, tracking records in New York and London, as investors absorbed US President Donald Trump's latest tariff salvos amid optimism that most countries will strike a deal to avoid the worst of his levies.",
    "link": "https://www.ibtimes.com/traders-brush-off-new-trump-threats-extend-stocks-rally-3778189",
    "timestamp": "2025-07-11T03:15:20Z"
  },
  {
    "title": "China's Economy Likely Grew 5.2% In Q2 Despite Trade War: AFP Poll",
    "description": "China's economy is expected to have expanded more than five percent in the second quarter thanks to strong exports, analysts say, but they warned Donald Trump's trade war could cause a sharp slowdown in the final six months.",
    "link": "https://www.ibtimes.com/chinas-economy-likely-grew-52-q2-despite-trade-war-afp-poll-3778186",
    "timestamp": "2025-07-11T03:15:18Z"
  },
  {
    "title": "China's Economy Likely Grew 5.2% In Q2 Despite Trade War: AFP Poll",
    "description": "China's economy is expected to have expanded more than five percent in the second quarter thanks to strong exports, analysts say, but they warned Donald Trump's trade war could cause a sharp slowdown in the final six months.",
    "link": "https://www.ibtimes.com.au/chinas-economy-likely-grew-52-q2-despite-trade-war-afp-poll-1859623",
    "timestamp": "2025-07-11T03:15:16Z"
  },
  {
    "title": "Trump plans to hike tariffs on Canadian goods to 35%",
    "description": "Canadian Prime Minister Mark Carney says Canada will keep working toward a new trade framework with the United States despite U.S. President Donald Trump saying he'll raise taxes on many imported goods from Canada to 35%.",
    "link": "https://www.clickondetroit.com/business/2025/07/11/trump-plans-to-hike-tariffs-on-canadian-goods-to-35/",
    "timestamp": "2025-07-11T03:15:10Z"
  },
  {
    "title": "Cory Booker: I Don't Care If Trump Throws Me in Jail, I Won't Stop Fighting",
    "description": "Senator Cory Booker (D-NJ) said Thursday on MSNBC's \"The Briefing\" that he would not stop fighting even if President Donald Trump throws him in jail.\nThe post Cory Booker: I Don’t Care If Trump Throws Me in Jail, I Won’t Stop Fighting appeared first on Breitb…",
    "link": "https://www.breitbart.com/clips/2025/07/10/cory-booker-i-dont-care-if-trump-throws-me-in-jail-i-wont-stop-fighting/",
    "timestamp": "2025-07-11T03:13:45Z"
  },
  {
    "title": "Traders brush off new Trump threats to extend stocks rally",
    "description": "Stocks mostly rose Friday in Asia, tracking records in New York and London, as investors absorbed US President Donald Trump’s latest tariff salvos amid optimism that most countries will strike a deal to avoid the worst of his levies. The US president has ramp…",
    "link": "https://www.digitaljournal.com/world/traders-brush-off-new-trump-threats-to-extend-stocks-rally/article",
    "timestamp": "2025-07-11T03:12:32Z"
  },
  {
    "title": "Bessent Says Trump and Soros Have Something in Common: Impatience",
    "description": "Treasury Secretary Scott Bessent told a room full of billionaires in Sun Valley that President Donald Trump shares a personality trait with his former boss, the famously liberal financier George Soros: Both are impatient when working on high-stakes deals.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-says-trump-and-soros-have-something-in-common-impatience",
    "timestamp": "2025-07-11T03:12:27Z"
  },
  {
    "title": "Trump floats 15 to 20% blanket tariff on trading partners",
    "description": "US President Donald Trump on Thursday said he was considering imposing a 15 or 20 percent blanket tariff on countries that had not yet received specific notifications, effective August 1. Trump this week began issuing letters to many US trading partners as he…",
    "link": "https://www.digitaljournal.com/world/trump-floats-15-to-20-blanket-tariff-on-trading-partners/article",
    "timestamp": "2025-07-11T03:12:20Z"
  },
  {
    "title": "Netanyahu: Israel's 'Never Had Such a Friend' as Trump",
    "description": "During an interview aired on Thursday’s broadcast of Newsmax TV’s “The Record,” Israeli Prime Minister Benjamin Netanyahu said that “We’ve never had such a friend, such a supporter of Israel, the Jewish state in the White House” than President Donald\nThe post…",
    "link": "https://www.breitbart.com/clips/2025/07/10/netanyahu-israels-never-had-such-a-friend-as-trump/",
    "timestamp": "2025-07-11T03:12:12Z"
  },
  {
    "title": "Lena Dunham Says She Wasn’t Surprised By MAGA’s Rise As She Experienced “Angry” & “Incredibly Conservative” Backlash For ‘Girls’",
    "description": "When it premiered on HBO in 2012, Lena Dunham’s Girls — about the trials and tribulations of a squad of 20-something privileged, often self-involved friends in New York City — was the talk of the town, the subject of many thinkpieces, critiques and praise bef…",
    "link": "http://deadline.com/2025/07/lena-dunham-girls-hbo-backlash-alt-right-trump-1236454799/",
    "timestamp": "2025-07-11T03:07:54Z"
  },
  {
    "title": "Gold rises on Trump's latest tariffs, firmer dollar caps gains",
    "description": "Gold rises on Trump's tariff announcements, but dollar strength caps gains amid global trade turmoil.",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-rises-on-trumps-latest-tariffs-firmer-dollar-caps-gains/article69798864.ece",
    "timestamp": "2025-07-11T03:07:27Z"
  },
  {
    "title": "Venezuelans deported from US demand return of their children",
    "description": "Hundreds of people protested in Caracas Thursday demanding the return of at least 30 children who remain in the United States after being separated from their Venezuelan parents during deportation. Mariale Castellano, deported on May 28, was among the protest…",
    "link": "https://www.digitaljournal.com/world/venezuelans-deported-from-us-demand-return-of-their-children/article",
    "timestamp": "2025-07-11T03:07:20Z"
  },
  {
    "title": "A timeline of U.S. President Donald Trump’s trade war with Canada",
    "description": "For over a year before the November 2024 presidential election, Donald Trump had been signalling plans to impose across-the-board tariffs if he won the United States presidency. Trump was elected on Nov. 5, and it’s been a roller-coaster ever since for Canadi…",
    "link": "https://financialpost.com/pmn/a-timeline-of-u-s-president-donald-trumps-trade-war-with-canada",
    "timestamp": "2025-07-11T03:04:32Z"
  },
  {
    "title": "As all sides wait for a cease-fire, Israel's pointless war in Gaza claims more lives",
    "description": "At the end of Netanyahu's weeklong visit to the United States, two things are clear: the war in Gaza has no purpose and the prime minister isn't pushing for a deal ■ Recent wars show that the IDF's entire understanding of the concept of 'deterrence' is fundam…",
    "link": "https://www.haaretz.com/israel-news/2025-07-11/ty-article/.premium/as-all-sides-wait-for-a-cease-fire-israels-pointless-war-in-gaza-claims-more-lives/00000197-f5c3-df97-a797-ffc7d5200000",
    "timestamp": "2025-07-11T03:01:12Z"
  },
  {
    "title": "The countries that received Trump’s tariff letters – and where things stand now",
    "description": "U.S. President Donald Trump has sent letters to Canada and a handful of other countries this week outlining higher tariffs they’ll face if they don’t make trade deals with the U.S. by Aug. 1.\nSome of these import taxes mirror the same, so-called “reciprocal” …",
    "link": "https://biztoc.com/x/973b8d180a9ba75c",
    "timestamp": "2025-07-11T02:58:41Z"
  },
  {
    "title": "Trump threatens to withhold endorsements for GOP senators who don't back rescissions bill (Aaron Pellish/Politico)",
    "description": "Aaron Pellish / Politico:\nTrump threatens to withhold endorsements for GOP senators who don't back rescissions bill  —  President Donald Trump is threatening to withhold endorsements from Republican senators who don't support the administration's effort to cl…",
    "link": "https://www.memeorandum.com/250710/p160",
    "timestamp": "2025-07-11T02:55:00Z"
  },
  {
    "title": "DC’s Crypto Policy Endgame: Coinbase Pushes Congress For Clear Rules",
    "description": "From July 14 to 18, the House of Representatives is expected to vote on three major digital asset bills—collectively dubbed “Crypto Week”— in a historic moment for the US",
    "link": "https://www.forbes.com/sites/jasonbrett/2025/07/10/dcs-crypto-policy-endgame-coinbase-pushes-congress-for-clear-rules/",
    "timestamp": "2025-07-11T02:54:35Z"
  },
  {
    "title": "Six Secret Service agents suspended over Trump assassination failings",
    "description": "The agency said the six unnamed individuals face punishments ranging from '10- to 42-day suspensions without pay'.",
    "link": "https://www.aljazeera.com/news/2025/7/11/six-secret-service-agents-suspended-over-trump-assassination-failings",
    "timestamp": "2025-07-11T02:53:35Z"
  },
  {
    "title": "Google’s Gemini AI lets users create videos from photos with Veo 3",
    "description": "Google's Gemini lets users make eight-second videos from still images.",
    "link": "https://www.nzherald.co.nz/technology/googles-gemini-ai-lets-users-create-videos-from-photos-with-veo-3/PFZGIUOA65AIHFOTPRMLQA7MEM/",
    "timestamp": "2025-07-11T02:50:35Z"
  },
  {
    "title": "If You Bought Ethereum When Eric Trump Said So, You’re Finally in the Green",
    "description": "Ethereum plunged as much as 37% after the president's son called it a buy in February. Five months later, it has slowly clawed its way back.",
    "link": "https://decrypt.co/329655/ethereum-eric-trump-youre-finally-green",
    "timestamp": "2025-07-11T02:48:11Z"
  },
  {
    "title": "Trump says US to supply weapons to Ukraine via NATO",
    "description": "WASHINGTON: United States President Donald Trump said on Thursday (Jul 10) the US would supply weapons to Ukraine via NATO and that he would make a \"major statement\" on Russia on Monday. In recent days, Trump has",
    "link": "https://www.channelnewsasia.com/world/trump-us-supply-weapons-ukraine-russia-war-nato-5232921",
    "timestamp": "2025-07-11T02:47:58Z"
  },
  {
    "title": "State Department to begin mass layoffs of about 1,800 employees in coming days",
    "description": "The State Department informed U.S.-based employees on Thursday that it would soon be laying off nearly 2,000 workers as part of a plan to downsize its domestic workforce.",
    "link": "https://www.foxnews.com/politics/state-department-begin-mass-layoffs-estimated-1800-employees-coming-days",
    "timestamp": "2025-07-11T02:47:50Z"
  },
  {
    "title": "Trump seems to be warming to new sanctions on Russia",
    "description": "US News: BERLIN: Since President Donald Trump retook the Oval Office, leaders across Europe have prodded him to forcefully back Ukraine in its fight against Ru.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-seems-to-be-warming-to-new-sanctions-on-russia/articleshow/122377570.cms",
    "timestamp": "2025-07-11T02:47:29Z"
  },
  {
    "title": "Netanyahu says he hopes hostage deal can be done in few days",
    "description": "Benjamin Netanyahu anticipates a hostage release deal with Hamas soon. Fifty hostages remain, with only twenty believed alive. A potential agreement aims to free half the living and deceased. Netanyahu hopes to secure the release of all hostages. Ceasefire ta…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-says-he-hopes-hostage-deal-can-be-done-in-few-days/articleshow/122377516.cms",
    "timestamp": "2025-07-11T02:43:24Z"
  },
  {
    "title": "OneRepublic co-founder Tim Myers announces run for California lieutenant governor to ‘fight back’ against Trump",
    "description": "OneRepublic co-founder and former bassist Tim Myers announced his campaign for California lieutenant governor on Monday.",
    "link": "https://nypost.com/2025/07/10/entertainment/onerepublic-founder-announces-run-for-california-lieutenant-governor-to-fight-back-against-trump/",
    "timestamp": "2025-07-11T02:43:12Z"
  },
  {
    "title": "The Hero With a Bloodied Face",
    "description": "Donald Trump is the first mythic hero of the twenty-first century.That many recoil at this statement does not deny its obvious truth. Heroism isn't about winning a popularity contest. The moder",
    "link": "https://www.realclearhistory.com/articles/2025/07/11/the_hero_with_a_bloodied_face_1121812.html",
    "timestamp": "2025-07-11T02:43:12Z"
  },
  {
    "title": "Bannon Calls for Special Prosecutor for Epstein Files",
    "description": "“Steve Bannon has called for a special prosecutor to investigate the Epstein files as MAGA world’s noisiest voices cause trouble for Donald Trump with political wrangling over the issue,” The Telegraph reports. Said Rob Finnerty",
    "link": "https://politicalwire.com/2025/07/10/bannon-calls-for-special-prosecutor-for-epstein-files/",
    "timestamp": "2025-07-11T02:40:43Z"
  },
  {
    "title": "Trump warns Canada with 35% tariffs in letter to PM Carney",
    "description": "he move, effective August 1, marks a significant escalation in US-Canada trade tensions, as Trump cited fentanyl smuggling and broader trade grievances.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-warns-canada-with-35-tariffs-in-letter-to-pm-carney/article69798841.ece",
    "timestamp": "2025-07-11T02:39:48Z"
  },
  {
    "title": "Grok’s MechaHitler disaster is a preview of AI disasters to come",
    "description": "From the beginning, Elon Musk has marketed Grok, the chatbot integrated into X, as the unwoke AI that would give it to you straight, unlike the competitors.  But on X over the last year, Musk’s supporters have repeatedly complained of a problem: Grok is still…",
    "link": "https://www.vox.com/future-perfect/419631/grok-hitler-mechahitler-musk-ai-nazi",
    "timestamp": "2025-07-11T02:39:33Z"
  },
  {
    "title": "Rubio To Meet China's Wang On Sidelines Of ASEAN Talks",
    "description": "US Secretary of State Marco Rubio will meet his Chinese counterpart Wang Yi on Friday on the sidelines of ASEAN talks in Malaysia where Washington's tariffs are in sharp focus.",
    "link": "https://www.ibtimes.com/rubio-meet-chinas-wang-sidelines-asean-talks-3778184",
    "timestamp": "2025-07-11T02:36:06Z"
  },
  {
    "title": "Trump says US will impose 35pc tariff on Canadian goods",
    "description": "US President Donald Trump says Washington will impose the tariff on Canadian goods from next month, in an aggressive increase to the 25 per cent tariff he announced in February.",
    "link": "https://www.abc.net.au/news/2025-07-11/trump-threatens-35-per-cent-tariff-on-canadian-goods/105521012",
    "timestamp": "2025-07-11T02:33:52Z"
  },
  {
    "title": "Rubio to meet China’s Wang on sidelines of ASEAN talks",
    "description": "US Secretary of State Marco Rubio will meet his Chinese counterpart Wang Yi on Friday on the sidelines of ASEAN talks in Malaysia where Washington’s tariffs are in sharp focus. Rubio and Wang’s first face-to-face meeting since US President Donald Trump return…",
    "link": "https://www.digitaljournal.com/world/rubio-to-meet-chinas-wang-on-sidelines-of-asean-talks/article",
    "timestamp": "2025-07-11T02:32:20Z"
  },
  {
    "title": "‘Why Are We Not Pressing?’: Harris Faulkner Demands Bipartisan Push For Answers On Trump’s Assassination Attempt",
    "description": "Faulkner demanded there be a bipartisan push to get to the bottom of what happened at Trump’s Butler rally where a shooter attempted to kill him.",
    "link": "https://dailycaller.com/2025/07/10/harris-faulkner-trump-butler-assasination-attempt-crooks/",
    "timestamp": "2025-07-11T02:31:53Z"
  },
  {
    "title": "Trump admin still deciding where it would deport Kilmar Abrego Garcia, ICE official tells judge",
    "description": "The Trump administration hasn’t decided where it would deport Kilmar Abrego Garcia if he is freed from a Tennessee jail.",
    "link": "https://nypost.com/2025/07/10/us-news/trump-admin-still-deciding-where-it-would-deport-kilmar-abrego-garcia-ice-official-tells-judge/",
    "timestamp": "2025-07-11T02:31:43Z"
  },
  {
    "title": "Brazil threatens to match Trump’s tariffs amid Bolsonaro trial row",
    "description": "Brazil’s Lula warns of 50% retaliatory tariffs if Trump imposes taxes over Bolsonaro trial. US-Brazil trade talks now uncertain amid rising tensions.",
    "link": "https://www.thehindubusinessline.com/news/world/brazil-threatens-to-match-trumps-tariffs-amid-bolsonaro-trial-row/article69798830.ece",
    "timestamp": "2025-07-11T02:31:40Z"
  },
  {
    "title": "Trump slaps 35 percent tariff on Canada starting August 1",
    "description": "US president also eyes blanket tariffs of 15 to 20 percent on other trading partners as his trade war widens.",
    "link": "https://www.aljazeera.com/news/2025/7/11/trump-slaps-35-percent-tariff-on-canada-starting-august",
    "timestamp": "2025-07-11T02:31:20Z"
  }
]