[
  {
    "title": "BBC reporter asks Trump about return to pre-2014 Ukraine borders",
    "description": "The US President took questions from the press in the Oval Office after announcing he would be meeting Putin in Saudi Arabia.",
    "link": "https://www.bbc.com/news/videos/c391mm78yego",
    "timestamp": "2025-02-12T22:38:49Z"
  },
  {
    "title": "The relationship between the White House and its press corps is time-tested — and can be contentious",
    "description": "When the Trump administration barred Associated Press reporters from presidential events, it did so after an or-else demand that the news agency change its style from the “Gulf of Mexico” to the “Gulf of America,” in line with the president's executive...",
    "link": "https://abcnews.go.com/US/wireStory/relationship-white-house-press-corps-time-tested-contentious-118758542",
    "timestamp": "2025-02-12T22:38:45Z"
  },
  {
    "title": "Trump and DOGE Approval Skyrockets, Dems Scramble to Block",
    "description": "We’re seeing numbers that are nothing short of incredible. President Donald Trump and Elon Musk’s DOGE are not just doing well; they’re smashing records. A new poll by Trafalgar Group and Insider Advantage spells it out – Americans are all over this. Trump’s …",
    "link": "https://freerepublic.com/focus/f-bloggers/4297123/posts",
    "timestamp": "2025-02-12T22:38:38Z"
  },
  {
    "title": "Russian missiles rained down on Ukraine just ahead of Treasury Secretary Scott Bessent's visit",
    "description": "Russian missiles struck Kyiv in the early hours of Wednesday, killing at least one civilian, Ukrainian officials said. The barrage of ballistic missiles hit hours before Treasury Secretary Scott Bessent visited the Ukrainian capital, the first Cabinet-level T…",
    "link": "https://freerepublic.com/focus/f-chat/4297122/posts",
    "timestamp": "2025-02-12T22:38:04Z"
  },
  {
    "title": "Video Shows Flight Attendant From DC Crash Joking With Passengers",
    "description": "Ian Epstein was one of the four crew members on the flight that crashed midair near Reagan National Airport on January 29.",
    "link": "https://www.newsweek.com/ian-epstein-dc-plane-crash-video-2030230",
    "timestamp": "2025-02-12T22:37:52Z"
  },
  {
    "title": "House Democrats Made a Meal Out of Majorie Taylor-Greene and Co-President Musk",
    "description": "And yet, the Democrats' efforts have changed nothing and affected nothing.",
    "link": "https://www.esquire.com/news-politics/politics/a63777062/congressional-hearing-on-government-waste/",
    "timestamp": "2025-02-12T22:37:00Z"
  },
  {
    "title": "We have the right to political anger",
    "description": "As students face repression for protesting genocide, universities must decide: will they defend freedom or enforce silence?",
    "link": "https://africasacountry.com/2025/02/we-have-the-right-to-political-anger/",
    "timestamp": "2025-02-12T22:36:41Z"
  },
  {
    "title": "Musk Claims To Know The Net Worths Of Federal Employees",
    "description": "His Oval Office remark suggests a remarkable invasion of privacy of potentially millions of federal employees.",
    "link": "https://www.huffpost.com/entry/musk-trump-employee-net-worths_n_67ad1a43e4b0239406deed9e",
    "timestamp": "2025-02-12T22:36:21Z"
  },
  {
    "title": "US Tariffs Will Weaken Dollar If Nations Strike Back, Bank of America Says",
    "description": "US President Donald Trump tariff policies will eventually be a drag on the dollar despite providing an initial boost, according to Bank of America Corp.",
    "link": "https://financialpost.com/pmn/business-pmn/us-tariffs-will-weaken-dollar-if-nations-strike-back-bank-of-america-says",
    "timestamp": "2025-02-12T22:36:17Z"
  },
  {
    "title": "Trump And Putin Set To Meet In Saudi Arabia On Ukraine",
    "description": "US President Donald Trump revealed Wednesday he expected to meet Russian President Vladimir Putin in Saudi Arabia for Ukraine peace talks, in an extraordinary thaw in relations after a surprise phone call between the two leaders.",
    "link": "https://www.ibtimes.com.au/trump-putin-set-meet-saudi-arabia-ukraine-1856123",
    "timestamp": "2025-02-12T22:36:13Z"
  },
  {
    "title": "What Exactly Did Americans Expect?",
    "description": "Donald Trump keeps doing what he said he’d do, and some of his supporters keep being surprised.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/02/the-trump-supporters-who-didnt-take-him-at-his-word/681674/",
    "timestamp": "2025-02-12T22:36:00Z"
  },
  {
    "title": "Elon Musk's DOGE has worked quickly to cut federal agencies. Here's a list of what's been targeted so far.",
    "description": "Elon Musk's Department of Government Efficiency has targeted federal agencies like USAID, CFPB, and NOAA to reduce government spending.",
    "link": "https://www.businessinsider.com/federal-agencies-musk-doge-targeted-list-2025-2",
    "timestamp": "2025-02-12T22:34:55Z"
  },
  {
    "title": "The relationship between the White House and its press corps is time-tested — and can be contentious",
    "description": "This week, the White House barred Associated Press journalists from three media appearances by President Donald Trump — two of them in the Oval Office itself. Some of the reaction said, effectively, this: What right do you have to be there, anyway?\nThe answer…",
    "link": "https://biztoc.com/x/b2e8794bb88fe416",
    "timestamp": "2025-02-12T22:34:32Z"
  },
  {
    "title": "Trump Vows To ‘Immediately’ Shut The Department of Education: ‘It’s A Big Con Job’",
    "description": "President Donald Trump vowed to “immediately” shutter the US Department of Education during a presser in the Oval Office on Wednesday afternoon. Trump slammed the department, accused some employees of fraud, and questioned its efficacy, noting that American s…",
    "link": "https://www.mediaite.com/tv/trump-vows-to-immediately-shut-the-department-of-education-its-a-big-con-job/",
    "timestamp": "2025-02-12T22:34:04Z"
  },
  {
    "title": "Trump Vows To ‘Immediately’ Shut The Department of Education: ‘It’s A Big Con Job’ - NewsBreak",
    "description": "President Donald Trump vowed to “immediately” shutter the US Department of Education during a presser in the Oval Office on Wednesday afternoon. Trump slam",
    "link": "https://www.newsbreak.com/share/3807055743536-trump-vows-to-immediately-shut-the-department-of-education-it-s-a-big-con-job?s=a2&share_destination_id=MTAxNDk4NTAtMTczOTQ3MDg2ODUzMg%3D%3D&pd=00gaRGX1&hl=en_US&send_time=1739470868&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v3",
    "timestamp": "2025-02-12T22:34:04Z"
  },
  {
    "title": "House GOP's budget impasse thaws just as winter storm sacks Capitol",
    "description": "As snow falls on D.C., House Republicans push forward on President Donald Trump's agenda with multiple bills and visits to the Capitol.",
    "link": "https://www.foxnews.com/politics/house-gops-budget-impasse-thaws-out-just-winter-storm-sacks-capitol",
    "timestamp": "2025-02-12T22:33:59Z"
  },
  {
    "title": "Pro-Trump Republicans beg him to reverse course on part of his immigration crackdown",
    "description": "Two Florida lawmakers who’ve been vocal cheerleaders of Donald Trump’s immigration crackdowns are now asking him to spare some of their constituents.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/trump-tps-venezuelans-gimenez-diaz-balart-rcna191920",
    "timestamp": "2025-02-12T22:33:52Z"
  },
  {
    "title": "The relationship between the White House and its press corps is time-tested – and can be contentious",
    "description": "This week, the White House barred Associated Press journalists from three media appearances by President Donald Trump _ two of them in the Oval Office itself. Some of the reaction said, effectively, this: What right do you have to be there, anyway? The answer…",
    "link": "https://financialpost.com/pmn/the-relationship-between-the-white-house-and-its-press-corps-is-time-tested-and-can-be-contentious",
    "timestamp": "2025-02-12T22:33:47Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL (Feb 13, 2025) *PRAYER*",
    "description": "Join with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media. This is the confidence we have in approaching God: that if we a…",
    "link": "https://freerepublic.com/focus/f-religion/4297121/posts",
    "timestamp": "2025-02-12T22:33:40Z"
  },
  {
    "title": "DOJ announces lawsuit against New York, Hochul and state AG James over ‘sanctuary’ status",
    "description": "The Justice Department announced Wednesday it was suing New York state over its policy of limiting cooperation with federal immigration enforcement, with Gov. Kathy Hochul, state AG Letitia James and DMV chief Mark Schroeder in AG Pam Bondi’s crosshairs. “Thi…",
    "link": "https://freerepublic.com/focus/f-news/4297120/posts",
    "timestamp": "2025-02-12T22:32:35Z"
  },
  {
    "title": "Trump Administration ‘Committed to a Peace Deal’ in Ukraine, Says Leavitt",
    "description": "Following groundbreaking developments regarding the Russia-Ukraine war, a Wednesday briefing from White House press secretary Karoline Leavitt offered more details about President Donald Trump’s phone... Read More\nThe post Trump Administration ‘Committed to a…",
    "link": "https://www.dailysignal.com/2025/02/12/trump-administration-committed-peace-deal-ukraine-says-leavitt/",
    "timestamp": "2025-02-12T22:32:19Z"
  },
  {
    "title": "Taylor Swift Defended by Saquon Barkley Against Super Bowl Booing",
    "description": "Taylor Swift was defended by Saquon Barkley after the Super Bowl, where she was booed by Philadelphia Eagles fans. See what he said.",
    "link": "http://www.billboard.com/music/music-news/taylor-swift-defended-saquon-barkley-super-bowl-booing-1235900976/",
    "timestamp": "2025-02-12T22:30:50Z"
  },
  {
    "title": "Shonda Rhimes Resigns from Kennedy Center Board After Trump Appoints Himself as Chairman",
    "description": "Shonda Rhimes has resigned from the board of trustees for the Kennedy Center after Donald Trump appointed himself chairman.",
    "link": "https://www.indiewire.com/news/breaking-news/shonda-rhimes-resigns-kennedy-center-board-trump-appoints-himself-chairman-1235094916/",
    "timestamp": "2025-02-12T22:30:00Z"
  },
  {
    "title": "Schapiro: For Dems, there's a political upside to downsizing",
    "description": "First in federal contracts and second in federal employment, Virginia readies for the high hand from its rich Uncle Sam on the other side of the Potomac.",
    "link": "https://richmond.com/news/state-regional/government-politics/virginia-economic-threats-political-opportunity-spanberger-youngkin-trump/article_f8cdb29c-e950-11ef-a30e-8ffa361c8508.html",
    "timestamp": "2025-02-12T22:30:00Z"
  },
  {
    "title": "Trump funding cuts leave Australian researchers in limbo",
    "description": "Australian researchers dependent on US funding are facing an uncertain future as the Trump administration attempts to slash funding and slap restrictions on medical and scientific research.",
    "link": "https://www.abc.net.au/news/health/2025-02-13/trump-funding-cuts-medical-scientific-research/104927168",
    "timestamp": "2025-02-12T22:30:00Z"
  },
  {
    "title": "Musk's X agrees to pay about $10 million to settle Trump lawsuit, WSJ reports",
    "description": "Trump's team considered letting the lawsuit fizzle out, people familiar with the matter told WSJ, citing the billionaire's close proximity to the president...",
    "link": "https://ca.finance.yahoo.com/news/musks-x-agrees-pay-10-222823513.html",
    "timestamp": "2025-02-12T22:28:23Z"
  },
  {
    "title": "Musk's X agrees to pay about $10 million to settle Trump lawsuit, WSJ reports",
    "description": "Elon Musk's social media platform X has agreed to pay about $10 million to settle a lawsuit that U.S. President Donald Trump brought against the company and its former chief executive, the Wall Street Journal reported on Wednesday.Trump's team considered lett…",
    "link": "https://www.channelnewsasia.com/business/musks-x-agrees-pay-about-10-million-settle-trump-lawsuit-wsj-reports-4934616",
    "timestamp": "2025-02-12T22:28:23Z"
  },
  {
    "title": "Poll Finds Strong Majority of US Voters Reject Trump Plan to “Own” Gaza",
    "description": "Trump has said that forcibly expelled Palestinians would not have the right to return under his plan.",
    "link": "https://truthout.org/articles/poll-finds-strong-majority-of-us-voters-reject-trump-plan-to-own-gaza/",
    "timestamp": "2025-02-12T22:27:26Z"
  },
  {
    "title": "Some Hospitals Are Being Called Out For Already Bending To Trump's Orders",
    "description": "One parent said he felt \"betrayed\" when he heard the news about his local hospital's restrictions.",
    "link": "https://www.huffpost.com/entry/outrage-grows-trump-order-gender-affirming-care-youth-across-the-country_n_67ad0302e4b0232270789391",
    "timestamp": "2025-02-12T22:27:09Z"
  },
  {
    "title": "Germany’s ‘Slow-Motion Suicide’",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to... Read More\nThe post Germany’s ‘Slow-Motion Suicide’ appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/12/germanys-slow-motion-suicide/",
    "timestamp": "2025-02-12T22:26:06Z"
  },
  {
    "title": "Stock market today: Most of Wall Street sinks after inflation worsens",
    "description": "Most U.S. stocks fell after a report said inflation is unexpectedly worsening for Americans. The S&P 500 dropped 0.3% Wednesday, though it had been on track for a much worse loss of 1.1% at the start of trading. The Dow…",
    "link": "https://apnews.com/article/stock-markets-tariffs-trump-trade-66c4a754d716821ec8f65a15af9ad23c",
    "timestamp": "2025-02-12T22:24:31Z"
  },
  {
    "title": "Trump’s tariffs could inflate onshore wind costs by up to 7%",
    "description": "Trump’s new trade tariffs and more import restrictions could drive up costs for US onshore wind power, potentially slowing down the industry’s momentum, according to a new report from Wood Mackenzie.\n\n\n\n more…",
    "link": "http://electrek.co/2025/02/12/trumps-tariffs-could-inflate-onshore-wind-costs-by-up-to-7/",
    "timestamp": "2025-02-12T22:24:15Z"
  },
  {
    "title": "50501 Organizers Launch 'Not My President's Day' Nationwide Day of Action",
    "description": "The 50501 organizers behind the nationwide \"anti-Trump\" protest at U.S. state capitols are back again with a day of action planned for President's Day.",
    "link": "https://www.newsweek.com/50501-movement-organizaers-not-my-presidenti-day-protests-2029529",
    "timestamp": "2025-02-12T22:23:57Z"
  },
  {
    "title": "Trump's Pick to Lead Gutted Consumer Agency Is 'Gift to Big Banks': Watchdog",
    "description": "The government watchdog Accountable.US said Wednesday that Americans need look no further than comments from a top trade association for big banks to know that President Donald Trump's pick to lead the Consumer Financial Protection Bureau won't provide them w…",
    "link": "https://www.commondreams.org/news/trump-cfpb",
    "timestamp": "2025-02-12T22:23:36Z"
  },
  {
    "title": "Trump wants interest rate cuts. The market isn't buying it",
    "description": "Just before the release of Wednesday’s monthly consumer price report, President Donald Trump called for lower interest rates in a post on his Truth Social platform.\n“Interest Rates should be lowered, something which would go hand in hand with upcoming Tariffs…",
    "link": "https://biztoc.com/x/e58ca8f5906911eb",
    "timestamp": "2025-02-12T22:23:36Z"
  },
  {
    "title": "Warren: Only Congress, Not Musk, Can Shut Down CFPB",
    "description": "Senator Warren responds to DOGE cost-cutting efforts, saying that Congress has the power to shut down the CFPB, not Elon Musk.\nPresident Donald Trump directed agencies to work with Elon Musk’s government cost-cutting effort to slash their workforces, accordin…",
    "link": "https://biztoc.com/x/417be06e828b21b5",
    "timestamp": "2025-02-12T22:23:31Z"
  },
  {
    "title": "House DOGE Panel Fires Its First Salvo in ‘War on Waste’",
    "description": "The House Subcommittee on Delivering on Government Efficiency held its first hearing Tuesday as part of an investigation into the “war on waste” in the... Read More\nThe post House DOGE Panel Fires Its First Salvo in ‘War on Waste’ appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/02/12/house-doge-panel-fires-its-first-salvo-war-on-waste/",
    "timestamp": "2025-02-12T22:22:54Z"
  },
  {
    "title": "Rory McIlroy reveals Donald Trump’s side amid LIV Golf, PGA Tour battle",
    "description": "Rory McIlroy spoke at length about a recent interaction with the President.",
    "link": "https://www.sbnation.com/golf/2025/2/12/24364446/rory-mcilroy-donald-trump-liv-golf-pga-tour-saga",
    "timestamp": "2025-02-12T22:22:34Z"
  },
  {
    "title": "Live: PM Modi To Arrive In US Shortly, To Hold Bilateral Meeting With Trump",
    "description": "PM Narendra Modi is set to arrive in the US on Thursday (local time) for a bilateral meeting with President Donald Trump. PM Modi&#039;s visit to the White House, scheduled for February 12-13, marks the fourth week of Trump&#039;s second term in office.",
    "link": "https://www.ndtv.com/world-news/pm-modi-us-visit-live-prime-minister-narendra-modi-to-arrive-in-us-shortly-to-hold-bilateral-meeting-with-donald-trump-7697333",
    "timestamp": "2025-02-12T22:22:19Z"
  },
  {
    "title": "Federal workers say they increasingly distrust platforms like Facebook",
    "description": "As Elon Musk and President Donald Trump have sought to gut and remake the federal government to their liking, federal workers have changed how they communicate with one another and with friends. They have locked down communication channels, migrated to new pl…",
    "link": "https://www.theverge.com/news/610951/federal-workers-privacy-surveillance-signal-facebook-messenger",
    "timestamp": "2025-02-12T22:22:16Z"
  },
  {
    "title": "Trump upends US policy on Ukraine and says he and Putin have agreed to begin talks on ending the war",
    "description": "WASHINGTON (AP) — President Donald Trump upended three years of U.S. policy toward Ukraine on Wednesday, saying that he and Russian leader Vladimir Putin had agreed to begin negotiations on ending the war following a sudden prisoner swap.Trump said in a socia…",
    "link": "https://freerepublic.com/focus/f-news/4297119/posts",
    "timestamp": "2025-02-12T22:21:38Z"
  },
  {
    "title": "Edits to Vera Rubin’s Biography Downplay the Need for Women in Science Amid Federal DEI Crackdown",
    "description": "To comply with Trump's executive order about DEI, a federally funded telescope project has altered the biography of its namesake astronomer.",
    "link": "https://gizmodo.com/edits-to-vera-rubins-biography-downplay-the-need-for-women-in-science-amid-federal-dei-crackdown-2000562941",
    "timestamp": "2025-02-12T22:20:42Z"
  },
  {
    "title": "Jeffrey Toobin Says Biden, Trump Reveal True Colors With Presidential Pardons",
    "description": "Jeffrey Toobin says Joe Biden tarnished his legacy by pardoning his son, and Donald Trump cemented one of the knocks against him with his own slew of presidential pardons. The lawyer, author and legal analyst joined us on \"TMZ Live\" Wednesday and…",
    "link": "https://www.tmz.com/2025/02/12/jeffrey-toobin-biden-trump-pardons-reveal-true-colors/",
    "timestamp": "2025-02-12T22:20:25Z"
  },
  {
    "title": "Mitch McConnell Lands Rare Praise From Democrat Over Tulsi Gabbard",
    "description": "McConnell's decision to vote against Tulsi Gabbard was praised by his Democratic colleague on Wednesday.",
    "link": "https://www.newsweek.com/richard-blumenthal-praise-mitch-mcconnell-tulsi-gabbard-2030289",
    "timestamp": "2025-02-12T22:19:59Z"
  },
  {
    "title": "No longer taken advantage of: Trump signs order prioritizing ‘unified’ US foreign policy front",
    "description": "The new executive order emphasizes the State Department's responsibility to uphold President Donald Trump's foreign policy priorities.",
    "link": "https://www.foxnews.com/politics/no-longer-taken-advantage-of-trump-signs-executive-order-prioritizing-unified-front-us-foreign-policy",
    "timestamp": "2025-02-12T22:15:07Z"
  },
  {
    "title": "Cardi B blasts President Trump for Super Bowl chaos that ruined her $3k shoes",
    "description": "Cardi B did not hold back her frustration after her Super Bowl LIX experience took an unexpected turn, courtesy of heightened security measures surrounding President Donald Trump&a",
    "link": "https://www.marca.com/en/nfl/super-bowl/2025/02/12/67acfa6946163f81778b4590.html",
    "timestamp": "2025-02-12T22:15:02Z"
  },
  {
    "title": "'You don’t get to slither around in the dark': Dem slams Musk and his 'little suck-ups'",
    "description": "There’s “real energy” in the halls of Congress and across the country as voters begin to take notice of “just how lawless” President Donald Trump’s new administration is prepared to be – and Elon Musk is at that top of that list, according to Sen. Elizabeth W…",
    "link": "https://www.rawstory.com/elizabeth-warren-elon-musk/",
    "timestamp": "2025-02-12T22:14:37Z"
  },
  {
    "title": "Trump Says Not Practical For Ukraine To Join NATO",
    "description": "U.S. President Donald Trump said on Wednesday he did not think it was practical for Ukraine to join NATO and that it was unlikely Ukraine will get back all of its land.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-not-practical-for-ukraine-to-join-nato-7697691",
    "timestamp": "2025-02-12T22:14:11Z"
  },
  {
    "title": "House GOP Reveals Plan to Devastate Medicaid and Food Stamp Programs - NewsBreak",
    "description": "House Republicans have released their budget plan , and in order to pay for massive tax cuts for the wealthy, they are planning to slash funding for Medic",
    "link": "https://www.newsbreak.com/share/3807035214072-house-gop-reveals-plan-to-devastate-medicaid-and-food-stamp-programs?s=a2&share_destination_id=MTk4Njc4Mzg1LTE3Mzk0NjcxMTQwNzY%3D&pd=0DRdK5xe&hl=en_US&send_time=1739467114&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2",
    "timestamp": "2025-02-12T22:13:53Z"
  },
  {
    "title": "House GOP Reveals Plan to Devastate Medicaid and Food Stamp Programs - NewsBreak",
    "description": "House Republicans have released their budget plan , and in order to pay for massive tax cuts for the wealthy, they are planning to slash funding for Medic",
    "link": "https://www.newsbreak.com/share/3807035214072-house-gop-reveals-plan-to-devastate-medicaid-and-food-stamp-programs?_f=app_share&pd=05WApuMu&lang=en_US&send_time=1739451224&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.1.6%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v8&s=i2",
    "timestamp": "2025-02-12T22:13:53Z"
  },
  {
    "title": "Republicans Reveal Budget Plan to Take Wrecking Ball to Medicaid",
    "description": "House Republicans have released their budget plan, and in order to pay for massive tax cuts for the wealthy, they are planning to slash funding for Medicaid and food stamps. \r\nThe early budget includes a statement where representatives on the House Budget Com…",
    "link": "https://newrepublic.com/post/191476/house-republicans-budget-medicaid-snap-food-stamps",
    "timestamp": "2025-02-12T22:13:53Z"
  },
  {
    "title": "House GOP Reveals Plan to Devastate Medicaid and Food Stamp Programs - NewsBreak",
    "description": "House Republicans have released their budget plan , and in order to pay for massive tax cuts for the wealthy, they are planning to slash funding for Medic",
    "link": "https://www.newsbreak.com/share/3807035214072-house-gop-reveals-plan-to-devastate-medicaid-and-food-stamp-programs?s=a2&share_destination_id=MTA2NDY1NDYtMTczOTQ1OTU5ODIzNA%3D%3D&pd=00ifeUBN&hl=en_US&send_time=1739459598&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v8",
    "timestamp": "2025-02-12T22:13:53Z"
  },
  {
    "title": "Trump Says He Expects To Meet Putin In Saudi Arabia After ‘Highly Productive’ Call About War In Ukraine",
    "description": "Word of President Donald Trump’s call with Russian President Vladimir Putin came one day after Russia released a wrongfully detained American prisoner.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/02/12/trump-says-he-expects-to-meet-putin-in-saudi-arabia-after-highly-productive-call-about-war-in-ukraine/",
    "timestamp": "2025-02-12T22:13:08Z"
  },
  {
    "title": "Nationwide Economic Blackout on February 28: List of Stores Being Targeted",
    "description": "Americans are pledging to stop making any purchases for a full 24 hours on February 28.\nThe national economic blackout is scheduled as a way for Americans to boycott major retailers that have pulled back on diversity, equity and inclusion (DEI) policies as a …",
    "link": "https://biztoc.com/x/08f4dea95e55c973",
    "timestamp": "2025-02-12T22:12:42Z"
  },
  {
    "title": "How Mitch McConnell Blew America’s Best Chance to Stop Trump",
    "description": "After January 6, the Kentucky senator passed on the opportunity to potentially bar the impeached ex-president from returning to office. Now we’re all paying the price.",
    "link": "https://www.vanityfair.com/news/story/how-mitch-mcconnell-blew-americas-best-chance-to-stop-trump",
    "timestamp": "2025-02-12T22:11:47Z"
  },
  {
    "title": "Tesla Is About to Get a Nice Big Handout as Musk Takes Over Government",
    "description": "Elon Musk’s Tesla will receive one of the largest government contracts in 2025 to produce armored vehicles. \r\nDrop Site first reported Wednesday on the latest filing of the Department of State’s Procurement Forecast for the fiscal year 2025, which was revised…",
    "link": "https://newrepublic.com/post/191477/tesla-elon-musk-government-contract",
    "timestamp": "2025-02-12T22:11:10Z"
  },
  {
    "title": "Ukraine peace talks risk rewarding Putin whose red lines haven't shifted",
    "description": "Donald Trump has promised peace talks and teased the prospect of ending the war in Ukraine but, in the background, there are potential complications.",
    "link": "https://news.sky.com/story/ukraine-war-peace-talks-risk-short-term-win-that-rewards-putin-whose-red-lines-havent-shifted-13308171",
    "timestamp": "2025-02-12T22:11:00Z"
  },
  {
    "title": "Trump makes first big foray into Ukraine diplomacy, speaking to Putin, Zelenskyy",
    "description": "Zelenskyy's office said Trump and Zelenskyy spoke by phone for about an hour, while the Kremlin said Putin's call with Trump lasted nearly an hour and a half.",
    "link": "https://www.japantimes.co.jp/news/2025/02/13/world/politics/trump-ukraine-diplomacy-putin-zelenskyy/",
    "timestamp": "2025-02-12T22:11:00Z"
  },
  {
    "title": "Trump Gives DOGE Broad Powers as GOP Announces Budget Designed to Screw Most Americans",
    "description": "The new Republican budget would add $3 trillion to the U.S. debt over the next ten years.",
    "link": "https://gizmodo.com/trump-gives-doge-broad-powers-as-gop-announces-budget-designed-to-screw-most-americans-2000563069",
    "timestamp": "2025-02-12T22:10:11Z"
  },
  {
    "title": "Trump Promises to Keep Sending Military Aid to Ukraine Until a Peace Deal Is Made: ‘As Long As We Have To’",
    "description": "\"We're the thing that's holding it back. And frankly, we'll go as long as we have to go because we're not going to let the other happen.\"\nThe post Trump Promises to Keep Sending Military Aid to Ukraine Until a Peace Deal Is Made: ‘As Long As We Have To’ first…",
    "link": "https://www.mediaite.com/news/trump-promises-to-keep-sending-military-aid-to-ukraine-until-a-peace-deal-is-made-as-long-as-we-have-to/",
    "timestamp": "2025-02-12T22:10:00Z"
  },
  {
    "title": "Restrictions on trans athletes focus on exclusion, when participation should be the goal",
    "description": "The International Boxing Association's attempt to take the International Olympic Committee is about scapegoating vulnerable people while actively working against gender equity in sport.",
    "link": "https://www.cbc.ca/sports/opinion-morgan-campbell-restrictions-trans-dsd-athletes-1.7457511",
    "timestamp": "2025-02-12T22:09:54Z"
  },
  {
    "title": "‘Trump effect’: How US tariffs, ’51st state’ threats are shaking up Canada",
    "description": "Canadian politicians are trying to tap into growing nationalist sentiment amid US President Donald Trump's threats.",
    "link": "https://www.aljazeera.com/news/2025/2/12/trump-effect-how-us-tariffs-51st-state-threats-are-shaking-up-canada",
    "timestamp": "2025-02-12T22:09:32Z"
  },
  {
    "title": "Trump announces negotiations to end Ukraine war will start 'immediately'",
    "description": "Donald Trump has announced that talks to end the war in Ukraine will start immediately. The US President had 'a lengthy and highly productive' phone call with Russian President Vladimir Putin, followed by a call to Ukrainian President Volodomyr Zelensky. We h…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9cr2slx7l",
    "timestamp": "2025-02-12T22:08:00Z"
  },
  {
    "title": "Nationwide Economic Blackout on February 28: List of Stores Being Targeted",
    "description": "The national economic blackout is scheduled as a way for Americans to boycott major retailers that have pulled back on DEI policies.",
    "link": "https://www.newsweek.com/nationwide-economic-blackout-february-28-list-stores-being-targeted-2030269",
    "timestamp": "2025-02-12T22:07:54Z"
  },
  {
    "title": "This Consumer Protection Cop Was Just Thrown Off the Beat by DOGE",
    "description": "The Trump and Musk administration hollowed out the Consumer Financial Protection Bureau, removing the watchdogs who were “protecting people's money.”",
    "link": "http://www.rollingstone.com/politics/politics-features/musk-trump-cfpb-consumer-protection-cop-dismissed-form-letter-1235265684/",
    "timestamp": "2025-02-12T22:07:44Z"
  },
  {
    "title": "Malawi university students feel impact of US aid freeze",
    "description": "BLANTYRE, MALAWI — Public universities in Malawi have ordered all students sponsored by USAID to drop out or seek other sources of funding if they want to remain in school. This follows the 90-day freeze on U.S. foreign assistance recently announced by Presid…",
    "link": "https://www.voanews.com/a/malawi-university-students-feel-impact-of-us-aid-freeze/7972824.html",
    "timestamp": "2025-02-12T22:07:37Z"
  },
  {
    "title": "McConnell Finally Defies Trump, Now That He’s Irrelevant",
    "description": "Mitch McConnell is finally defying Trump, now that he’s irrelevant. The former Senate majority leader broke with his GOP colleagues to vote against two Trump Cabinet picks, Pete Hegseth and Tulsi Gabbard. It’s too little, too late.",
    "link": "http://nymag.com/intelligencer/article/mcconnell-finally-defies-trump-now-that-hes-irrelevant.html",
    "timestamp": "2025-02-12T22:06:35Z"
  },
  {
    "title": "Panama vessel registry says it is 'not a haven for sanctions evasion'",
    "description": "PANAMA CITY (Reuters) - Panama has made progress stripping vessels from its registry that do not meet its flag's standards, the Central American nation's Maritime Authority said on Wednesday, responding to U.S. criticism that it allowed sanctioned countries t…",
    "link": "https://www.thestar.com.my/news/world/2025/02/13/panama-vessel-registry-says-it-is-039not-a-haven-for-sanctions-evasion039",
    "timestamp": "2025-02-12T22:06:00Z"
  },
  {
    "title": "DOGE’s Illegal Takeover Pulls From Fascist Playbooks",
    "description": "When we see a parallel government taking shape, we should not refrain from calling fascism what it is.",
    "link": "https://truthout.org/articles/doges-illegal-takeover-pulls-from-fascist-playbooks/",
    "timestamp": "2025-02-12T22:04:56Z"
  },
  {
    "title": "Exclusive — Rep. Andy Barr Details Republican Plan to 'Whip Inflation' with Tax Cuts, DOGE, Energy Dominance",
    "description": "Rep. Andy Barr (R-KY) told Breitbart News about how enacting President Donald Trump's economic agenda will work to \"whip inflation\" by cutting taxes, slashing spending with DOGE, and unleashing energy dominance.\nThe post Exclusive — Rep. Andy Barr Details Rep…",
    "link": "https://www.breitbart.com/politics/2025/02/12/exclusive-rep-andy-barr-details-republican-plan-to-whip-inflation-with-tax-cuts-doge-energy-dominance/",
    "timestamp": "2025-02-12T22:04:16Z"
  },
  {
    "title": "Trump says he may sign reciprocal tariff order on Wednesday",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said that he may sign an order on Wednesday to impose reciprocal tariffs on every country that charges duties on U.S. imports.\"I may do it later on, or I may do it tomorrow morning, but we'll be signing recip…",
    "link": "https://www.thestar.com.my/news/world/2025/02/13/trump-says-he-may-sign-reciprocal-tariff-order-on-wednesday",
    "timestamp": "2025-02-12T22:04:00Z"
  },
  {
    "title": "Trump Promises In-Person Meeting With Putin as Ukraine Talks Get Underway",
    "description": "An American president hasn't visited Russia in more than a decade. That could change soon, according to President Donald Trump, who said Wednesday that he and Russian President Vladimir had agreed to visit \"each other's Nations\" as part of an effort to end th…",
    "link": "https://biztoc.com/x/dea42398c41b7a27",
    "timestamp": "2025-02-12T22:01:30Z"
  },
  {
    "title": "Warren: Only Congress — not Trump or Musk — can ‘get rid of the CFPB’",
    "description": "Senator Elizabeth Warren said Wednesday that the law clearly states only Congress can shutter the Consumer Financial Protection Bureau, setting up a potential legal clash with President Donald Trump after the administration moved to freeze the agency’s operat…",
    "link": "https://biztoc.com/x/3ec5032ce552ac37",
    "timestamp": "2025-02-12T22:01:06Z"
  },
  {
    "title": "World Becomes Brighter as Trump Reverses Biden’s Incandescent Light Bulb Ban",
    "description": "And user-friendly toilets, dishwashers, and showers are coming back soon, too!\nThe post World Becomes Brighter as Trump Reverses Biden’s Incandescent Light Bulb Ban first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/world-becomes-brighter-as-trump-reverses-bidens-incandescent-light-bulb-ban/",
    "timestamp": "2025-02-12T22:00:47Z"
  },
  {
    "title": "AP WH Reporter Blocked For Second Day From Covering Trump Oval Office Presser",
    "description": "A White House reporter with the Associated Press was blocked from an Oval Office event for a second consecutive day on Wednesday. CNN’s Brian Stelter reported that an AP reporter on pool duty who attempted to cover the swearing-in of Tulsi Gabbard as the Dire…",
    "link": "https://www.mediaite.com/media/ap-wh-reporter-blocked-for-second-day-from-covering-trump-oval-office-presser/",
    "timestamp": "2025-02-12T22:00:26Z"
  },
  {
    "title": "Elon Musk’s humanizing moment: He made DOGE a family affair | CNN Business",
    "description": "Tuesday’s press conference in the Oval Office was already unusual, with Elon Musk standing behind President Donald Trump at the Resolute Desk to talk about the Department of Government Efficiency – illustrating the power the world’s richest man now holds.",
    "link": "https://www.cnn.com/2025/02/12/tech/elon-musk-x-oval-office/index.html",
    "timestamp": "2025-02-12T22:00:11Z"
  },
  {
    "title": "Commentary: Why Trump’s Gaza plan is a non-starter for Arab states",
    "description": "US President Donald Trump has doubled down on his shock proposal to take over Gaza and relocate Palestinians. Here’s why Egypt and Jordan are pushing back, say NUS Middle East Institute’s Clemens Chay and Evangeline Cheng.",
    "link": "https://www.channelnewsasia.com/commentary/trump-take-over-gaza-palestinians-jordan-egypt-4933056",
    "timestamp": "2025-02-12T22:00:00Z"
  },
  {
    "title": "Commentary: Putting the Trump-Modi bromance to the test",
    "description": "Donald Trump’s victory in the 2024 US presidential election raised hopes in India for a reset in bilateral relations, says professor of strategic studies Brahma Chellaney.",
    "link": "https://www.channelnewsasia.com/commentary/donald-trump-narendra-modi-us-india-ties-tariff-trade-4933011",
    "timestamp": "2025-02-12T22:00:00Z"
  },
  {
    "title": "Cardi B V Donald Trump! Rapper Accuses President of 'F------ Up' Her $3,000 Shoes at Super Bowl 2025 — And Demands Return of Deported Uncle as 'Payback' As His Brutal Deportations Grow",
    "description": "Cardi B slammed Donald Trump on Instagram after her shoes were apparently ruined due to the president's appearance at the Super Bowl on Sunday.",
    "link": "https://radaronline.com/p/cardi-b-donald-trump-shoes-super-bowl-deported-uncle-payback/",
    "timestamp": "2025-02-12T22:00:00Z"
  },
  {
    "title": "Trump Promises In-Person Meeting With Putin as Ukraine Talks Get Underway",
    "description": "The meeting could take place in Saudi Arabia, the president suggested. It's been a decade since a Russian or American president has set foot in the other's country.",
    "link": "https://www.newsweek.com/trump-putin-meeting-saudi-arabia-ukraine-2030275",
    "timestamp": "2025-02-12T21:59:53Z"
  },
  {
    "title": "Trump’s Approval Rating Dips 8 Points After Issuing Dozens of Executive Orders",
    "description": "Vice President J.D. Vance has errantly suggested that federal judges have no right to review executive branch actions.",
    "link": "https://truthout.org/articles/trumps-approval-rating-dips-8-points-after-issuing-dozens-of-executive-orders/",
    "timestamp": "2025-02-12T21:58:18Z"
  },
  {
    "title": "Trump Takes Over Kennedy Center In War On ‘Woke’ Programming—Here’s What To Know",
    "description": "Trump announced plans last week to gut the Kennedy Center board, citing some of its shows that involved drag.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/12/trump-takes-over-kennedy-center-in-war-on-woke-programming-heres-what-to-know/",
    "timestamp": "2025-02-12T21:57:51Z"
  },
  {
    "title": "Judge rules against Aurora landlords accused of threatening to report tenants to immigration authorities",
    "description": "\"Landlords cannot threaten, harass, intimidate, coerce tenants based on their perceived immigration status,\" said Tim Macdonald, the legal director of the ACLU of Colorado, which filed the lawsuit on behalf of a Venezuelan couple.",
    "link": "https://www.denverpost.com/2025/02/12/aurora-judge-ruling-landlord-venezuelan-tenants-colorado-immigration/",
    "timestamp": "2025-02-12T21:56:40Z"
  },
  {
    "title": "Donald Trump and Elon Musk 'illegally' revoked $80 million federal aid for shelters from NYC, Comptroller Brad Lander alleges (New York Post)",
    "description": "New York Post:\nDonald Trump and Elon Musk ‘illegally’ revoked $80 million federal aid for shelters from NYC, Comptroller Brad Lander alleges  —  Millions in FEMA funds sent to New York City last week to help with the migrant crisis were clawed back Wednesday …",
    "link": "https://www.memeorandum.com/250212/p126",
    "timestamp": "2025-02-12T21:55:00Z"
  },
  {
    "title": "Musk works for Trump, Dems’ lawfare rages on and other commentary",
    "description": "“Nobody elected Elon Musk” has become Democrats’ “new rallying cry,” snarks National Review’s Jim Geraghty, as if DOGE is “some sort of long-hidden trap sprung on the American people.”…",
    "link": "https://nypost.com/2025/02/12/opinion/musk-works-for-trump-dems-lawfare-rages-on-and-other-commentary/",
    "timestamp": "2025-02-12T21:54:47Z"
  },
  {
    "title": "AI feud: How Musk and Altman's partnership turned toxic",
    "description": "The feud between Elon Musk and Sam Altman has become one of the bitterest rivalries in business history, with the Tesla tycoon bidding to buy Altman's OpenAI in an apparent attempt to derail the ChatGPT maker's ascent to becoming one of the world's most impor…",
    "link": "https://japantoday.com/category/tech/ai-feud-how-musk-and-altman%27s-partnership-turned-toxic",
    "timestamp": "2025-02-12T21:54:17Z"
  },
  {
    "title": "Modi Arrives in Washington",
    "description": "The Indian leader’s trip comes on the heels of an electoral boost for his party back home.",
    "link": "https://foreignpolicy.com/2025/02/12/modi-trump-visit-washington-india/",
    "timestamp": "2025-02-12T21:53:54Z"
  },
  {
    "title": "Lawrence: Elon Showed The World That 'Trump Is Not The Boss Of Me'",
    "description": "MSNBC’s Lawrence O’Donnell explained that Donald is distracting us by claiming to take over Gaza, Greenland, and Canada. O'Donnell nailed it as the optics of the event put Donald at the children's table as Musk took control of the moment of the Executive Orde…",
    "link": "https://crooksandliars.com/2025/02/lawrence-elon-showed-world-trump-not-boss",
    "timestamp": "2025-02-12T21:53:42Z"
  },
  {
    "title": "Trump administration considering using defense funding to ramp up deportations",
    "description": "Tapping into DoD funding to hire contractors would vastly expand the scale and scope of immigrant arrests and deportations in the U.S.",
    "link": "https://www.nbcnews.com/politics/national-security/trump-admin-considering-using-defense-funding-deportations-rcna191879",
    "timestamp": "2025-02-12T21:53:21Z"
  },
  {
    "title": "Premiers to meet with Trump’s senior advisers to talk tariffs",
    "description": "Experts say Trump's tariff threats are likely a negotiating tactic meant to rattle Canada and Mexico ahead of a 2026 review of the trilateral continental trade pact",
    "link": "https://financialpost.com/news/premiers-meet-with-trumps-advisers",
    "timestamp": "2025-02-12T21:53:10Z"
  },
  {
    "title": "'Do some oversight': Dem chastises 'weak and afraid' MAGA colleagues",
    "description": "Rep. Dan Goldman (D-NY) laid into his Republican colleagues at a hearing of the House Oversight Committee on Wednesday, accusing them of ignoring direct attacks by the Trump administration on the separation of powers and specifically Congress' power to decide…",
    "link": "https://www.rawstory.com/dan-goldman/",
    "timestamp": "2025-02-12T21:53:08Z"
  },
  {
    "title": "Shakira kicks off first world tour in seven years",
    "description": "Shakira launched her first worldwide tour in seven years from Rio de Janeiro this week for her latest Grammy-winning album &quot;Las mujeres ya no lloran&quot; (Women Don't Cry Anymore). The Colombian singer-songwriter treated fans at the 46,000-capacity Nilt…",
    "link": "https://japantoday.com/category/entertainment/shakira-kicks-off-first-world-tour-in-seven-years",
    "timestamp": "2025-02-12T21:53:07Z"
  },
  {
    "title": "Cardi B Has Another Reason to Hate Trump",
    "description": "Cardi B has a bone to pick with President Trump. In an Instagram Live, she claimed his Super Bowl visit messed up her Louboutins. Devastating.",
    "link": "http://www.thecut.com/article/cardi-b-mad-trump-over-shoes-super-bowl.html",
    "timestamp": "2025-02-12T21:53:02Z"
  },
  {
    "title": "In Egypt, US Has Slashed Humanitarian Aid But Maintained Military Spending",
    "description": "Though USAID helped some Egyptians, it also always put “America first,” local development sector workers say.",
    "link": "https://truthout.org/articles/in-egypt-us-has-slashed-humanitarian-aid-but-maintained-military-spending/",
    "timestamp": "2025-02-12T21:52:52Z"
  },
  {
    "title": "New 'Captain America' film flies into Trumpian headwinds",
    "description": "The latest in the Captain America film franchise which premiered in Hollywood Tuesday presents a vision of the United States out of step with the Trump era, with a diverse cast, a core message about unity and an endorsement of international diplomacy. Written…",
    "link": "https://japantoday.com/category/entertainment/new-%27captain-america%27-film-flies-into-trumpian-headwinds",
    "timestamp": "2025-02-12T21:52:49Z"
  },
  {
    "title": "Is the U.S.-Ukraine Rare-Earth Deal All Talk?",
    "description": "Kyiv may have the critical minerals, but that’s just one part of the equation.",
    "link": "https://foreignpolicy.com/2025/02/12/trump-ukraine-rare-earth-critical-mineral-deal-bessent/",
    "timestamp": "2025-02-12T21:51:48Z"
  },
  {
    "title": "SoftBank reports 3rd-quarter loss weeks after announcing AI investment with Trump",
    "description": "Japanese technology company SoftBank Group Corp. reported a 369.2 billion yen loss for the fiscal third quarter as it racked up red ink from its Vision Fund investments. That's compared to a 950 billion yen profit in October-December 2023. Quarterly sales ros…",
    "link": "https://japantoday.com/category/business/SoftBank-reports-3rd-quarter-loss-weeks-after-announcing-AI-investment-with-Trump",
    "timestamp": "2025-02-12T21:50:16Z"
  },
  {
    "title": "Google Removes Black History Month, Pride Month & More From Google Calendar",
    "description": "Google isn't done kissing Donald Trump's ring. The company has removed Black History Month, Pride Month & more from the calendar.",
    "link": "https://hiphopwired.com/playlist/google-removes-black-history-month-pride-from-calendar-reactions/",
    "timestamp": "2025-02-12T21:50:14Z"
  }
]