[
  {
    "title": "Billionaires' wealth hits new peak as their clout grows, Oxfam says",
    "description": "Billionaire wealth surged at three times its recent pace last year to reach its highest level on record, deepening economic ‌and political divides that threaten democratic stability, anti-poverty group Oxfam said on Monday. In a report timed for the opening o…",
    "link": "https://japantoday.com/category/world/billionaires%27-wealth-hits-new-peak-as-their-clout-grows-oxfam-says",
    "timestamp": "2026-01-19T03:05:03Z"
  },
  {
    "title": "EU loads ‘trade bazooka’ in Greenland clash with Trump",
    "description": "The EU is preparing its most powerful trade weapons in response to US President Donald Trump’s escalating tariff threats over Greenland Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631126-eu-greenland-trade-bazooka/",
    "timestamp": "2026-01-19T03:04:53Z"
  },
  {
    "title": "Cruz backs US strike on Iran after all other steps exhausted",
    "description": "Sen. Ted Cruz says the US should exhaust all non‑military options against Iran’s regime but supports force as a last resort.",
    "link": "https://www.israelnationalnews.com/news/421107",
    "timestamp": "2026-01-19T03:02:16Z"
  },
  {
    "title": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirl",
    "description": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirlnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4446547469992-donald-trump-comes-clean-about-his-health-everything-he-s-said-so-far-about-his-well-being-as-dementia-rumors-swirl?_f=app_share&amp;pd=05jRa00W&amp;lang=en_US&amp;send_time=1768791638&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-19T03:01:05Z"
  },
  {
    "title": "'Bomb on plane': Handwritten note in toilet forces diversion of IndiGo Delhi–Bagdogra flight; threat later declared hoax",
    "description": "An IndiGo flight from Delhi to Bagdogra was diverted to Lucknow after a bomb threat was found in a handwritten note. After extensive searches lasting over seven hours, authorities declared the threat a hoax. The aircraft, carrying 230 passengers and crew, was…",
    "link": "https://timesofindia.indiatimes.com/city/lucknow/bomb-on-plane-handwritten-note-in-toilet-forces-diversion-of-indigo-delhibagdogra-flight-threat-later-declared-hoax/articleshow/126666504.cms",
    "timestamp": "2026-01-19T02:57:06Z"
  },
  {
    "title": "Gold, silver hit new highs as US punishes Europe with tariffs over Greenland stance",
    "description": "The United States wants to buy Greenland for security purposes. \nThe post Gold, silver hit new highs as US punishes Europe with tariffs over Greenland stance appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2026/01/19/gold-silver-hit-new-highs-as-us-punishes-europe-with-tariffs-over-greenland-stance/",
    "timestamp": "2026-01-19T02:56:47Z"
  },
  {
    "title": "Viral protest video against Iran’s supreme leader sparks copycat demonstrations worldwide",
    "description": "Viral video shows Iranian refugee lighting cigarette with burning photo of supreme leader, sparking global defiance movement amid Iran protests.",
    "link": "https://www.foxnews.com/world/viral-protest-video-against-irans-supreme-leader-sparks-copycat-demonstrations-worldwide",
    "timestamp": "2026-01-19T02:52:54Z"
  },
  {
    "title": "ICE says 2 demonstrators were arrested in Minnesota for allegedly assaulting officers",
    "description": "Two protesters allegedly assaulted federal officers during anti-ICE demonstrations in Minnesota, leading to their arrests as clashes between protesters and officers continue.",
    "link": "https://www.foxnews.com/us/ice-says-2-demonstrators-were-arrested-minnesota-allegedly-assaulting-officers",
    "timestamp": "2026-01-19T02:49:57Z"
  },
  {
    "title": "December core consumer prices rose at a 2.6% annual rate, less than expected",
    "description": "Core U.S. consumer prices rose less than predicted in December, reinforcing hopes that inflation is tempering as the Federal Reserve contemplates its next move on interest rates. Excluding volatile food and energy prices, the consumer price index showed a sea…",
    "link": "https://freerepublic.com/focus/f-news/4362874/posts",
    "timestamp": "2026-01-19T02:46:04Z"
  },
  {
    "title": "$1 billion gets a permanent seat on Trump's Board of 'Peace for Gaza', as India and others invited",
    "description": "At least eight more countries have been invited to join President Trump's new Board of Peace, intended to oversee Gaza's next steps and potentially expand its global influence. Hungary and Vietnam have accepted invitations, with a $1 billion contribution secu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/1-billion-gets-a-permanent-seat-on-trumps-board-of-peace-for-gaza-as-india-and-others-invited/articleshow/126666216.cms",
    "timestamp": "2026-01-19T02:41:21Z"
  },
  {
    "title": "US National Anthem Singer Heckled By British Fans At NBA London Game",
    "description": "The NBA returned to the UK for the first time since 2019, but it seems like British fans were not thrilled with the league playing the US National Anthem before the game. Earlier this week, President Trump threatened to impose tariffs on the UK and several ot…",
    "link": "https://brobible.com/sports/article/us-national-anthem-singer-heckled-by-british-fans-nba-london-game/",
    "timestamp": "2026-01-19T02:40:17Z"
  },
  {
    "title": "Turns out Trump and RFK Jr.’s obsession with whole milk has nothing to do with health and everything to do with money",
    "description": "Turns out Trump and RFK Jr.’s obsession with whole milk has nothing to do with health and everything to do with moneynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4448510372237-turns-out-trump-and-rfk-jr-s-obsession-with-whole-milk-has-nothing-to-do-with-health-and-everything-to-do-with-money?s=a2&amp;share_destination_id=MjA0NzIxOTY0LTE3Njg3ODk4MDMwMDM%3D&amp;pd=0DqzXAk4&amp;hl=en_US&amp;send_time=1768789803&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.2.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-19T02:30:44Z"
  },
  {
    "title": "Top Business & Market Headlines Today — BL Morning Report, Jan 19, 2026",
    "description": "Latest global and business news covering proposed GST reforms to ease compliance and boost exports, the postponement of Neville Tata’s appointment to the Sir Ratan Tata Trust board, mixed signals from the US economy and markets after one year of Trump’s secon…",
    "link": "https://www.thehindubusinessline.com/multimedia/audio/bl-morning-report-january-19-2026/article70521533.ece",
    "timestamp": "2026-01-19T02:30:00Z"
  },
  {
    "title": "China economy poised to hit 2025 growth target despite weaker Q4, outlook darkens",
    "description": "The world's second-largest economy showed remarkable resilience in 2025, helped by smaller-than-expected U.S. tariff hikes and exporters' push to diversify away from the United States, allowing policymakers to keep stimulus to modest levels.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-economy-poised-to-hit-2025-growth-target-despite-weaker-q4-outlook-darkens/articleshow/126666082.cms",
    "timestamp": "2026-01-19T02:28:07Z"
  },
  {
    "title": "China's economy grows 5% in 2025, buoyed by strong exports despite Trump's tariffs",
    "description": "China has reported its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite U.S. President Donald Trump’s tariffs.",
    "link": "https://www.clickondetroit.com/business/2026/01/19/chinas-economy-grows-5-in-2025-buoyed-by-strong-exports-despite-trumps-tariffs/",
    "timestamp": "2026-01-19T02:25:55Z"
  },
  {
    "title": "Oil prices steady as ebbing Iranian protests lower chance of US attack",
    "description": "Oil prices saw little change. Iran's crackdown on protests eased concerns about a U.S. attack disrupting supplies. Brent crude traded at $64.18 a barrel. U.S. West Texas Intermediate for February rose to $59.52. U.S. military movements to the Gulf continue. V…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-steady-as-ebbing-iranian-protests-lower-chance-of-us-attack/articleshow/126666054.cms",
    "timestamp": "2026-01-19T02:23:12Z"
  },
  {
    "title": "War for Ukraine Day 1,424: If You Look Around the Table & Can’t Tell Who the Mark Is, You’re the Mark",
    "description": "Pivoting off of last week’s widely reported announcement by Macron that France had replaced the US in supplying the vast majority of intelligence to Ukraine, the Kremlin recognized the opening this created in the information environment (IE) and decided to st…",
    "link": "https://balloon-juice.com/2026/01/18/war-for-ukraine-day-1424-if-you-look-around-the-table-cant-tell-who-the-mark-is-youre-the-mark/",
    "timestamp": "2026-01-19T02:18:56Z"
  },
  {
    "title": "President Trump wants Army-Navy game to remain exclusive TV territory",
    "description": "President Donald Trump sets order to keep Army-Navy football game in an exclusive December television window.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_24f14926-2092-437a-8e2f-3037d92341ec",
    "timestamp": "2026-01-19T02:17:18Z"
  },
  {
    "title": "Oil prices steady as ebbing Iranian protests lower chance of US attack",
    "description": "BEIJING, Jan 19 : Oil prices were little changed on Monday, after rising in the previous session, as Iran's deadly crackdown on protests quelled the civil unrest in the country, reducing the chance of a U.S. attack on the major Middle Eastern producer that co…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-steady-ebbing-iranian-protests-lower-chance-us-attack-5867461",
    "timestamp": "2026-01-19T02:17:08Z"
  },
  {
    "title": "Josh Shapiro: Harris team asked if I was an 'agent of Israel'",
    "description": "Pennsylvania Governor’s new memoir reveals tense Israel‑focused questioning during Harris’s VP vetting, including being asked if he was an “agent of Israel,\" a moment he describes as deeply offensive.",
    "link": "https://www.israelnationalnews.com/news/421105",
    "timestamp": "2026-01-19T02:16:22Z"
  },
  {
    "title": "China's economy expands at a 5% pace in 2025",
    "description": "China has reported its economy expanded at a 5% annual pace in 2025, buoyed by strong exports despite U.S. President Donald Trump’s tariffs. However, growth slowed to a 4.5% rate in the last quarter of the year. That was the slowest quarterly growth since lat…",
    "link": "https://apnews.com/article/china-economy-exports-trump-tariffs-6b3f53af8f22692bcd4d276c0695b1fc",
    "timestamp": "2026-01-19T02:11:54Z"
  },
  {
    "title": "CBS Finally Airs Shelved ’60 Minutes’ ‘Inside CECOT’ Report Despite Trump Admin No-Show | Analysis",
    "description": "CBS News chief Bari Weiss didn’t get Trump officials on camera as desired, but U.S. viewers witnessed the plight of Venezuelan men sent to a hellish El Salvador mega-prison\nThe post CBS Finally Airs Shelved ’60 Minutes’ ‘Inside CECOT’ Report Despite Trump Adm…",
    "link": "https://www.thewrap.com/commentary-analysis/columns/60-minutes-cecot-bari-weiss-cbs-trump/",
    "timestamp": "2026-01-19T02:07:50Z"
  },
  {
    "title": "World leaders query Trump Board of Peace amid fears for UN",
    "description": "Member states would need to pay $1 billion to retain their seat on the board.",
    "link": "https://7news.com.au/news/world-leaders-query-trump-board-of-peace-fears-for-un-c-21349454",
    "timestamp": "2026-01-19T02:05:35Z"
  },
  {
    "title": "China hits 2025 economic growth target as exports boom",
    "description": "Official figures show the world's second largest economy grew by xx%, hitting Beijing's \"around 5%\" target.",
    "link": "https://www.bbc.com/news/articles/cgk8zd287myo",
    "timestamp": "2026-01-19T02:04:05Z"
  },
  {
    "title": "Trump's 'Great Healthcare Plan' Has Promise but Should Add More Freedom for Americans",
    "description": "Empowering patients is good. Let’s give them a lot more choice and independence.",
    "link": "https://reason.com/2026/01/19/trumps-great-healthcare-plan-has-promise-but-should-add-more-freedom-for-americans/",
    "timestamp": "2026-01-19T02:01:06Z"
  },
  {
    "title": "PM to give No 10 speech over Greenland row",
    "description": "The prime minister will take to the Downing Street lectern this morning, after another extraordinary weekend of diplomatic turmoil prompted by US President Donald Trump. Sir Keir Starmer knows that people and businesses in the UK will expect him to respond, i…",
    "link": "https://freerepublic.com/focus/f-news/4362867/posts",
    "timestamp": "2026-01-19T01:57:41Z"
  },
  {
    "title": "Surging billionaire wealth a political threat, Oxfam warns as Davos opens",
    "description": "Davos (Switzerland) (AFP) – The collective wealth of the planet's billionaires soared to a record level in 2025, charity Oxfam reported Monday, warning of \"highly dangerous\" political consequences as the global elite gathers for the World Economic Forum. US P…",
    "link": "https://freerepublic.com/focus/f-news/4362866/posts",
    "timestamp": "2026-01-19T01:55:25Z"
  },
  {
    "title": "'Nonsensical': WSJ warns Trump's 'reckless risk' could make a Russian dream come true",
    "description": "President Donald Trump is taking a \"reckless risk\" by trying to acquire Greenland, one that could make one of Russia's biggest dreams come true, warned the Wall Street Journal's conservative editorial board on Sunday. Trump has relentlessly pursued acquiring …",
    "link": "https://www.rawstory.com/trump-russia-2674906910/",
    "timestamp": "2026-01-19T01:51:40Z"
  },
  {
    "title": "Dollar under pressure, safe havens rise as Trump ups tariff ante over Greenland",
    "description": "The dollar weakened on Monday as President Trump's latest tariff threats against European nations over Greenland prompted investors to seek safe-haven currencies like the yen and Swiss franc. Major EU states condemned the threats, with France proposing econom…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-under-pressure-safe-havens-rise-as-trump-ups-tariff-ante-over-greenland/articleshow/126665687.cms",
    "timestamp": "2026-01-19T01:47:54Z"
  },
  {
    "title": "Trump is charging world leaders $1 billion each for their countries to permanently join Gaza ‘Board of Peace’",
    "description": "Two of the countries, Hungary and Vietnam, said they have accepted.",
    "link": "https://fortune.com/2026/01/18/trump-gaza-board-of-peace-1-billion-contribution/",
    "timestamp": "2026-01-19T01:47:11Z"
  },
  {
    "title": "Nobel Foundation speaks out after Machado gifts Trump Peace Prize",
    "description": "The Nobel Foundation, the group responsible for administrating the various Nobel prizes, on Sunday issued a clarification around the rules for handing out the prizes after Venezuela‘s opposition leader María Corina Machado offered her peace prize to President…",
    "link": "https://freerepublic.com/focus/f-news/4362865/posts",
    "timestamp": "2026-01-19T01:47:02Z"
  },
  {
    "title": "Gold, silver jump to record highs on Trump tariff threats over Greenland",
    "description": "Gold and silver prices reached record highs as escalating U.S.-Europe trade tensions drove investors to safe-haven assets. President Trump's threat of new tariffs on European countries over Greenland prompted a broad risk-averse market move, with U.S. stock f…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-silver-jump-to-record-highs-on-trump-tariff-threats-over-greenland/articleshow/126665661.cms",
    "timestamp": "2026-01-19T01:45:48Z"
  },
  {
    "title": "Minneapolis mayor defiant over prospect of troopers in the street: ‘It is not fair, it’s not just, and it’s completely unconstitutional’",
    "description": "The Pentagon has ordered about 1,500 active-duty soldiers based in Alaska to be ready in case of a possible deployment, two defense officials said Sunday.",
    "link": "https://fortune.com/2026/01/18/minneapolis-mayor-jacob-frey-troops-unconstitutional-ridiculous/",
    "timestamp": "2026-01-19T01:43:16Z"
  },
  {
    "title": "Treasury Secretary Claims Trump Wants To Annex Greenland To Prevent Getting ‘Dragged’ Into ‘Attack’ From Russia",
    "description": "Scott Bessent argued that Trump is “looking beyond next year to what could happen for a battle in the Arctic.”",
    "link": "https://www.huffpost.com/entry/scott-bessent-trump-annex-greenland-war-attack-russia_n_696d118ee4b0e4bac192dff5",
    "timestamp": "2026-01-19T01:43:03Z"
  },
  {
    "title": "UK prime minister tells Donald Trump tariffs on Nato allies are ‘wrong’ in Greenland call",
    "description": "UK prime minister Keir Starmer has repeatedly said that Greenland’s future must be decided by its own people and Denmark, which governs the autonomous territory.",
    "link": "https://indianexpress.com/article/world/uk-prime-minister-tells-donald-trump-tariffs-on-nato-allies-are-wrong-in-greenland-call-10481857/",
    "timestamp": "2026-01-19T01:42:47Z"
  },
  {
    "title": "PM to give No 10 speech after weekend of Greenland and tariffs turmoil",
    "description": "Sir Keir Starmer is due to respond to US President Donald Trump's latest move to take over the Danish territory.",
    "link": "https://www.bbc.com/news/articles/cy09kyww4j2o",
    "timestamp": "2026-01-19T01:42:02Z"
  },
  {
    "title": "Islamic Jihad knows where Ran is - but sets a condition",
    "description": "An Islamic Jihad spokesman claims the body of Ran Gvili is being held in a tunnel into which the IDF poured concrete.",
    "link": "https://www.israelnationalnews.com/news/421104",
    "timestamp": "2026-01-19T01:40:29Z"
  },
  {
    "title": "Iranians Protest and Fight Back Against Murderous Islamic Regime",
    "description": "The Iranian people are tired of living under the murderous Islamic regime; they are protesting like never before to gain their country back.  The people of Iran have protested the … Read more\nThe post Iranians Protest and Fight Back Against Murderous Islamic …",
    "link": "https://joehoft.com/iranian-people-protest-and-fight-back-against-murderous-islamic-regime/",
    "timestamp": "2026-01-19T01:40:25Z"
  },
  {
    "title": "Trump plans to charge $1 billion for permanent seat on 'Board of Peace' (Washington Post)",
    "description": "Washington Post:\nTrump plans to charge $1 billion for permanent seat on ‘Board of Peace’  —  New details about a Trump-led board conceived to oversee rebuilding in Gaza have given rise to predictions that it could be used in place of U.N.'s traditional role. …",
    "link": "https://www.memeorandum.com/260118/p78",
    "timestamp": "2026-01-19T01:40:00Z"
  },
  {
    "title": "Bruce Springsteen Accuses ICE Of 'Gestapo Tactics' After Death Of Renee Good",
    "description": "During a concert on Saturday, the Boss demanded that ICE agents \"get the f**k out of Minneapolis.\"",
    "link": "https://www.huffpost.com/entry/bruce-springsteen-ice-gestapo-tactics-renee-good_n_696d5104e4b0fb912e9910b4",
    "timestamp": "2026-01-19T01:39:25Z"
  },
  {
    "title": "'Russian threat' to be moved from Greenland 'now' - Trump",
    "description": "US President Donald Trump ⁠has said that Denmark has not been able to do anything to get the \"Russian threat\" away from Greenland, and said: \"Now it is time, and it will be done!\"",
    "link": "https://www.rte.ie/news/2026/0119/1553807-world-greenland/",
    "timestamp": "2026-01-19T01:38:41Z"
  },
  {
    "title": "'Russian threat' to be moved from Greenland 'now' - Trump",
    "description": "US President Donald Trump ⁠has said that Denmark has not been able to do anything to get the \"Russian threat\" away from Greenland, and said: \"Now it is time, and it will be done!\"",
    "link": "https://www.rte.ie/news/world/2026/0119/1553807-world-greenland/",
    "timestamp": "2026-01-19T01:38:41Z"
  },
  {
    "title": "Harris to attend EU ministers meeting on US levy threats",
    "description": "Tánaiste Simon Harris will travel to Brussels for a meeting of EU finance ministers, which is set to be dominated by concerns over US President Donald Trump's latest tariff threats.",
    "link": "https://www.rte.ie/news/politics/2026/0119/1553807-us-eu-tariffs/",
    "timestamp": "2026-01-19T01:38:41Z"
  },
  {
    "title": "Iranian regime elites allegedly move millions of dollars out of country amid sanctions",
    "description": "Treasury sanctions target Iran's shadow banking as Mojtaba Khamenei allegedly transferred $328 million overseas according to Treasury Department reports.",
    "link": "https://www.foxnews.com/world/iranian-regime-elites-allegedly-move-tens-millions-dollars-out-country-amid-sanctions",
    "timestamp": "2026-01-19T01:29:51Z"
  },
  {
    "title": "FBI asks agents to travel to Minneapolis for temporary assignments amid protests, sources say",
    "description": "The FBI has asked agents from field offices across the United States to voluntarily travel to Minneapolis for temporary assignments as the city reels from anti-ICE protests and the fatal shooting of Renee Good, according to two sources.",
    "link": "https://www.nbcnews.com/news/us-news/fbi-asks-agents-travel-minneapolis-temporary-assignments-protests-sour-rcna254711",
    "timestamp": "2026-01-19T01:29:45Z"
  },
  {
    "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
    "description": "BERLIN (AP) — The eight European countries targeted by U.S. President Donald Trump for a 10% tariff for opposing American control of Greenland blasted the move Sunday, warning that his threats “undermine transatlantic relations and risk a dangerous downward s…",
    "link": "https://freerepublic.com/focus/f-news/4362862/posts",
    "timestamp": "2026-01-19T01:27:15Z"
  },
  {
    "title": "Trump Refuses to Rule Out Leaving NATO Over Greenland Tussle—Can He Legally Do That?",
    "description": "After talks between the Greenland and Denmark foreign ministers and U.S. officials on Wednesday yielded no results, President Donald Trump was met with questions as to what his next steps might be. Talking to reporters in the Oval Office, Trump—who continues …",
    "link": "https://freerepublic.com/focus/f-news/4362860/posts",
    "timestamp": "2026-01-19T01:26:07Z"
  },
  {
    "title": "60 Minutes: Trump DHS ‘Deflected All Questions’ About ‘Brutal’ El Salvador Prison — Even After Report Was Delayed a Month",
    "description": "60 Minutes claimed DHS \"deflected all questions\" about abuses at the El Salvadoran CECOT prison, even after having an extra month to respond.\nThe post 60 Minutes: Trump DHS ‘Deflected All Questions’ About ‘Brutal’ El Salvador Prison — Even After Report Was De…",
    "link": "https://www.mediaite.com/media/news/60-minutes-trump-dhs-deflected-all-questions-about-brutal-el-salvador-prison-even-after-report-was-delayed-a-month/",
    "timestamp": "2026-01-19T01:26:04Z"
  },
  {
    "title": "Piers Morgan Suffers a Broken Femur, Shares Hospital Bed Photo After Hip Replacement: ‘I Blame Donald Trump’",
    "description": "Piers Morgan shared a surprise injury update on social media Sunday — and found a way to blame former friend Donald Trump in the process. Morgan revealed he fell and fractured his femur, which necessitated hip replacement surgery.",
    "link": "https://www.thewrap.com/culture-lifestyle/culture/piers-morgan-broken-femur-hospital-bed-photo-blame-donald-trump/",
    "timestamp": "2026-01-19T01:17:23Z"
  },
  {
    "title": "EU Scrambles To Avert Trump Greenland Tariffs, Prepares Retaliation",
    "description": "They're also intensifying efforts to persuade the President against imposing the levies over Greenland.",
    "link": "https://www.huffpost.com/entry/europe-greenland-trump_n_696d7f63e4b0fb912e991935",
    "timestamp": "2026-01-19T01:16:37Z"
  },
  {
    "title": "CNBC Daily Open: Trump's Greenland tariffs draw the EU into the fray",
    "description": "If economic sanctions are designed to apply pressure without firing a shot, then U.S. President Donald Trump has aimed at America's closest military allies.",
    "link": "https://www.cnbc.com/2026/01/19/cnbc-daily-open-trumps-greenland-tariffs-draw-the-eu-into-the-fray.html",
    "timestamp": "2026-01-19T01:15:42Z"
  },
  {
    "title": "Surging billionaire wealth a political threat, Oxfam warns as Davos opens",
    "description": "The collective wealth of the planet’s billionaires soared to a record level in 2025, charity Oxfam reported Monday, warning of “highly dangerous” political consequences as the global elite gathers for the World Economic Forum. US President Donald Trump’s poli…",
    "link": "https://www.digitaljournal.com/world/surging-billionaire-wealth-a-political-threat-oxfam-warns-as-davos-opens/article",
    "timestamp": "2026-01-19T01:12:34Z"
  },
  {
    "title": "Asian stocks dip, gold hits record as tariff woes return",
    "description": "Markets reacted negatively as US President Donald Trump proposed new tariffs on eight European nations. This move revived tariff concerns, causing risk assets to slip and safe-haven demand to strengthen. Gold and silver prices surged to record highs. Equity f…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-dip-gold-hits-record-as-tariff-woes-return/articleshow/126665337.cms",
    "timestamp": "2026-01-19T01:10:39Z"
  },
  {
    "title": "Iraq announces full withdrawal of US forces from its federal territory",
    "description": "Iraq announces full withdrawal of US forces from its federal territory",
    "link": "https://www.cnn.com/2026/01/18/world/iraq-announces-full-withdrawal-of-us-forces-from-its-federal-territory",
    "timestamp": "2026-01-19T01:09:17Z"
  },
  {
    "title": "US considering asylum for British Jews",
    "description": "The Trump administration is discussing the possibility of offering asylum to Britain’s Jews, The Telegraph can reveal.Robert Garson, Donald Trump’s personal lawyer, said he had been in talks with the State Department about providing sanctuary for Jews fleeing…",
    "link": "https://freerepublic.com/focus/f-news/4362857/posts",
    "timestamp": "2026-01-19T01:05:57Z"
  },
  {
    "title": "Turns out Trump and RFK Jr.’s obsession with whole milk has nothing to do with health and everything to do with money",
    "description": "Turns out Trump and RFK Jr.’s obsession with whole milk has nothing to do with health and everything to do with moneynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4448510372237-turns-out-trump-and-rfk-jr-s-obsession-with-whole-milk-has-nothing-to-do-with-health-and-everything-to-do-with-money?s=a2&amp;share_destination_id=MjUzNDkwMDA1LTE3Njg3ODQ2NDg1OTQ%3D&amp;pd=0H9cKTOf&amp;hl=en_US&amp;send_time=1768784648&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.2.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-19T01:05:50Z"
  },
  {
    "title": "‘Trying to play catch up’: Watch Scott Bessent dismantle Kristen Welker’s ‘false choice’ between NATO and Greenland",
    "description": "'President Trump believes in NATO, but he does not believe in the American people being dragged in'",
    "link": "https://www.wnd.com/2026/01/trying-play-catch-up-watch-scott-bessent-dismantle/",
    "timestamp": "2026-01-19T01:03:03Z"
  },
  {
    "title": "EU scrambles to avert Trump Greenland tariffs, prepares retaliation",
    "description": "Greenland tariffs: Trump vowed on Saturday to implement a wave of increasing tariffs from February 1 on EU members Denmark, Sweden, France, Germany, the Netherlands and Finland, along with Britain and Norway, until the U.S. is allowed to buy Greenland, a step…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-scrambles-to-avert-trump-greenland-tariffs-prepares-retaliation/articleshow/126665218.cms",
    "timestamp": "2026-01-19T01:01:02Z"
  },
  {
    "title": "Trump says he will sue JPMorgan Chase over ‘incorrect’ post-Jan 6 debanking",
    "description": "President Donald Trump said Saturday he plans to sue JPMorgan Chase, accusing the banking giant of improperly cutting off his accounts in the aftermath of the Jan. 6, 2021, Capitol riot. Trump made the allegation in a lengthy post on Truth Social, where he al…",
    "link": "https://freerepublic.com/focus/f-news/4362856/posts",
    "timestamp": "2026-01-19T01:00:19Z"
  },
  {
    "title": "House Democrats Blast SEC Over Dropped Crypto Cases, Ripple Lawsuit Talk Resurfaces",
    "description": "House Democrats have accused the SEC of abandoning many high-profile investigations, including its legal battle with Ripple, which has brought attention back to the agency’s handling of crypto enforcement.  Related Reading: Steak ’N Shake Doubles Down On Bitc…",
    "link": "https://bitcoinist.com/house-democrats-blast-sec-over-dropped-crypto-cases-ripple-lawsuit-talk-resurfaces/",
    "timestamp": "2026-01-19T01:00:04Z"
  },
  {
    "title": "One Year of Trump. The Time to Act Is Now, While We Still Can. (M. Gessen/New York Times)",
    "description": "M. Gessen / New York Times:\nOne Year of Trump.  The Time to Act Is Now, While We Still Can.  —  A year into Donald Trump's second term, friends who live outside the United States continue to express shock at the news that comes from this country, often mixed …",
    "link": "https://www.memeorandum.com/260118/p72",
    "timestamp": "2026-01-19T00:55:00Z"
  },
  {
    "title": "Dollar sinks as Trump’s new tariffs raise fears about U.S. debt and reserve currency status. ‘When it’s lost, economic collapse will follow’",
    "description": "\"The dollar’s reserve-currency status allows us to live beyond our means.\"",
    "link": "https://fortune.com/2026/01/18/dollar-euro-reserve-currecy-us-debt-trump-tariffs-nato-greenland/",
    "timestamp": "2026-01-19T00:54:03Z"
  },
  {
    "title": "Counterprotesters chase off far-right activists at pro-ICE rally in Minneapolis",
    "description": "Jake Lang’s anti-Islam, anti-Somali and pro-ICE rally near City Hall outnumbered by hundreds of counterprotestersHundreds of counterprotesters on Saturday drowned out a far-right activist’s attempt to hold a small rally in support of the Trump administration’…",
    "link": "https://freerepublic.com/focus/f-news/4362854/posts",
    "timestamp": "2026-01-19T00:51:12Z"
  },
  {
    "title": "How to Watch ’60 Minutes’ Online Without Cable for Free",
    "description": "We've found the best ways to stream new episodes of the acclaimed news program '60 Minutes' online free without cable — here's how to livestream.",
    "link": "http://www.rollingstone.com/product-recommendations/lifestyle/how-to-watch-60-minutes-stream-online-free-1234947824/",
    "timestamp": "2026-01-19T00:50:00Z"
  },
  {
    "title": "Sending soldiers to Minneapolis for immigration crackdown would be unconstitutional, mayor says - Boston News, Weather, Sports | WHDH 7News",
    "description": "MINNEAPOLIS (AP) — The mayor of Minneapolis said Sunday that sending active duty soldiers into Minnesota to help with an immigration crackdown is a ridiculous and unconstitutional<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/sending-soldiers-to-min…",
    "link": "https://whdh.com/news/sending-soldiers-to-minneapolis-for-immigration-crackdown-would-be-unconstitutional-mayor-says/",
    "timestamp": "2026-01-19T00:44:57Z"
  },
  {
    "title": "Canada Weighs Sending Troops to Greenland Despite Tariff Threat",
    "description": "Mark Carney is considering sending Canadian soldiers to Greenland to take part in military exercises with NATO allies, a move that would risk retaliation from the US.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-weighs-sending-troops-to-greenland-despite-tariff-threat",
    "timestamp": "2026-01-19T00:38:30Z"
  },
  {
    "title": "Bruce Springsteen Excoriates ICE’s “Gestapo Tactics,” Dedicates Song To Renee Good During Surprise New Jersey Performance",
    "description": "In an unannounced stage appearance at the 2026 Light of Day Winterfest, Bruce Springsteen excoriated President Donald Trump and ICE’s invasive presence in Minneapolis following an agent’s killing of Renee Good. While performing at the Count Basie Theater in R…",
    "link": "http://deadline.com/2026/01/bruce-springsteen-ice-gestapo-renee-good-trump-1236689385/",
    "timestamp": "2026-01-19T00:36:30Z"
  },
  {
    "title": "Dr Farid Faridasr: ‘External forces creating anarchy, but we can deal with it…Iran is not Venezuela’",
    "description": "Cultural Counsellor and Head of Iran Cultural House in New Delhi, Dr Farid Faridasr, talks about the present crisis and how protests back home are fuelled by external forces, the Indian students in Iran, and how Iranians in New Delhi are lining up at the emba…",
    "link": "https://indianexpress.com/article/india/dr-farid-faridasr-external-forces-creating-anarchy-but-we-can-deal-with-itiran-is-not-venezuela-10481753/",
    "timestamp": "2026-01-19T00:30:45Z"
  },
  {
    "title": "A future fraught with uncertainties",
    "description": "The 3-player — US, China and the rest — phenomenon will be inherently unstable, making rational decision-making more complex",
    "link": "https://www.thehindubusinessline.com/opinion/a-future-fraught-with-uncertainties/article70522927.ece",
    "timestamp": "2026-01-19T00:30:00Z"
  },
  {
    "title": "Oil Edges Lower With Iran and Trump’s Greenland Threat in Focus",
    "description": "Oil fell as tensions over Iran cooled and wider markets carried a risk-off tone with President Donald Trump’s push to take over Greenland.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-edges-lower-with-iran-and-trumps-greenland-threat-in-focus",
    "timestamp": "2026-01-19T00:28:45Z"
  },
  {
    "title": "Fed chair race still up in the air",
    "description": "White House economic adviser Kevin Hassett said President Donald Trump may well keep him in his current job, which would eliminate him from contention for the next Federal Reserve chair.",
    "link": "https://www.bostonherald.com/2026/01/18/fed-chair-race-still-up-in-the-air/",
    "timestamp": "2026-01-19T00:23:44Z"
  },
  {
    "title": "Green Day Set to Headline NFL Super Bowl LX Opening Ceremony",
    "description": "The NFL's Super Bowl LX is shaping up nicely from the pop culture standpoint (because let's be honest, we all know the actual game takes a backseat to everything else going on around it). As if having global phenomenon Bad Bunny headline the NFL, Roc Nation, …",
    "link": "https://bleedingcool.com/tv/green-day-set-to-headline-nfl-super-bowl-lx-opening-ceremony/",
    "timestamp": "2026-01-19T00:23:08Z"
  },
  {
    "title": "Global markets face volatility amid US-Europe trade tensions",
    "description": "Global markets face renewed volatility as the US threatens tariffs on eight European nations, re-escalating US-Europe trade tensions and boosting safe-have\n\nRead More: https://punchng.com/global-markets-face-volatility-amid-us-europe-trade-tensions/",
    "link": "https://punchng.com/global-markets-face-volatility-amid-us-europe-trade-tensions/",
    "timestamp": "2026-01-19T00:20:05Z"
  },
  {
    "title": "Bessent: Europe is too weak to defend Greenland from future threats",
    "description": "The treasury secretary's comments come a day after President Donald Trump unveiled new tariffs against eight European nations who oppose Washington’s efforts to acquire Greenland.The Trump administration is intensifying its push to acquire Greenland, citing n…",
    "link": "https://freerepublic.com/focus/f-news/4362851/posts",
    "timestamp": "2026-01-19T00:17:40Z"
  },
  {
    "title": "Greenland needs US for defense because 'Europeans project weakness,' US Treasury Secretary argues",
    "description": "U.S. Treasury Secretary Scott Bessent defended President Donald Trump's latest efforts to acquire Greenland as a territory on NBC's \"Meet the Press\" Sunday.",
    "link": "https://www.foxnews.com/media/greenland-needs-us-because-europeans-project-weakness-us-treasury-secretary-argues",
    "timestamp": "2026-01-19T00:15:44Z"
  },
  {
    "title": "Steve Bannon reveals why Canada is the 'next Ukraine' as he details Trump's real motivations behind taking Greenland and his 'Donroe Doctrine'",
    "description": "President Donald Trump is preparing to counter Chinese influence in Canada as his 'Donroe Doctrine' for the Western Hemisphere expands beyond Latin America, his former campaign architect Steve Bannon has told the Daily Mail. 'The next big thing is going to be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362850/posts",
    "timestamp": "2026-01-19T00:12:19Z"
  },
  {
    "title": "Australia stays silent as allies learn no Trump deal is worth a damn",
    "description": "Donald Trump has once again demonstrated that no agreement with him is worth the paper it's written off. Yet Australia makes itself ever more reliant on him.\nThe post Australia stays silent as allies learn no Trump deal is worth a damn appeared first on Crike…",
    "link": "http://www.crikey.com.au/2026/01/19/donald-trump-tariffs-australia-greenland-denmark-united-kingdom-albanese-starmer/",
    "timestamp": "2026-01-19T00:12:12Z"
  },
  {
    "title": "Feature: Venezuela’s Machado gives Trump her Nobel Peace Prize: Is it his now?",
    "description": "Two weeks after United States special forces abducted Venezuelan President Nicholas Maduro, opposition leader Maria Corina Machado visited the White House for her first in-person meeting with US President Donald Trump. With Venezuela’s future uncertain, and T…",
    "link": "https://thechronicle.com.gh/feature-venezuelas-machado-gives-trump-her-nobel-peace-prize-is-it-his-now/",
    "timestamp": "2026-01-19T00:09:50Z"
  },
  {
    "title": "Hispanic voters sent Trump back to power. Now some are souring",
    "description": "After sending Trump to the White House in a historic shift, some Latinos feel he's not improving the economy.",
    "link": "https://www.bbc.com/news/articles/clym85ev64lo",
    "timestamp": "2026-01-19T00:05:05Z"
  },
  {
    "title": "Protests in Greenland and Denmark against Trump plans",
    "description": "Thousands of people in Greenland and Denmark have protested against plans by US President Donald Trump to take over Greenland – an autonomous Danish territory. Demonstrations were held in Danish cities including the capital, Copenhagen, as well as in Greenlan…",
    "link": "https://thechronicle.com.gh/protests-in-greenland-and-denmark-against-trump-plans/",
    "timestamp": "2026-01-19T00:03:57Z"
  },
  {
    "title": "Billionaires have ‘outsized’ political influence — and they’re richer than ever, says Oxfam",
    "description": "Billionaires' wealth has risen sharply to a record high of $18.3 trillion — with the super-rich seeking power \"for their own gain,\" according to Oxfam.",
    "link": "https://www.cnbc.com/2026/01/19/billionaires-richer-than-ever-oxfam-inequality-report.html",
    "timestamp": "2026-01-19T00:03:40Z"
  },
  {
    "title": "Why Companies Need a Chief Geopolitics Officer",
    "description": "Multinationals can no longer treat political risk as an afterthought, argues Bobby Ghosh.",
    "link": "https://time.com/7347206/why-companies-need-a-chief-geopolitics-officer/",
    "timestamp": "2026-01-19T00:03:36Z"
  },
  {
    "title": "After adding Trump administration statements, ’60 Minutes’ to air report on deportations that Bari Weiss abruptly pulled",
    "description": "When the segment critical of the administration was struck from the Dec. 21 episode, Alfonsi told her “60 Minutes” colleagues that it “was not an editorial decision, it was a political one.”",
    "link": "https://fortune.com/2026/01/18/60-minutes-report-deportations-bari-weiss-trump-administration-statements/",
    "timestamp": "2026-01-19T00:03:10Z"
  },
  {
    "title": "Oxfam says super rich should be taxed to tackle inequality",
    "description": "Australia now has 48 billionaires who hold more wealth than the bottom 40 per cent of the population combined, according to a new report from Oxfam.",
    "link": "https://www.abc.net.au/news/2026-01-19/income-inequality-oxfam-report-calls-to-tax-billionaires/106236612",
    "timestamp": "2026-01-19T00:02:59Z"
  },
  {
    "title": "CBS to Air ’60 Minutes’ Episode on Migrants It Earlier Pulled",
    "description": "CBS News said it will air an episode of 60 Minutes on Sunday night about the deportation of Venezuelan migrants to an overseas prison that it had earlier pulled in a controversial decision.",
    "link": "https://financialpost.com/pmn/business-pmn/cbs-to-air-60-minutes-episode-on-migrants-it-earlier-pulled",
    "timestamp": "2026-01-19T00:02:54Z"
  },
  {
    "title": "India gets invite to Trump’s Board of Peace — and to deal with many tricky questions",
    "description": "Board of Peace: Accepting the invite will mean that a sovereign nation joins an organisation of which Trump will remain chairman even when he is not US President. And that is not the only problem with 'Trump's new UN'. We explain.",
    "link": "https://indianexpress.com/article/explained/explained-global/india-invite-board-of-peace-tricky-questions-trump-10481712/",
    "timestamp": "2026-01-19T00:01:15Z"
  },
  {
    "title": "Davos: Trump looms large over biggest-ever World Economic Forum",
    "description": "Expect the World Economic Forum this week to be both the centre of the world and totally bizarre.",
    "link": "https://www.bbc.co.uk/news/articles/cx2p3e245npo",
    "timestamp": "2026-01-19T00:00:33Z"
  },
  {
    "title": "Faisal Islam: Global disruption looms large over biggest-ever Davos",
    "description": "Expect the World Economic Forum to be both the centre of the world this week, and totally bizarre, writes the BBC's economics editor.",
    "link": "https://www.bbc.com/news/articles/cx2p3e245npo",
    "timestamp": "2026-01-19T00:00:33Z"
  },
  {
    "title": "Maryland Democrat Pushes Plan to Punish ICE Veterans with Job Ban",
    "description": "A Maryland Democrat has introduced legislation that would prevent U.S. Immigration and Customs Enforcement (ICE) agents from being hired in state or local law enforcement roles.\nThe post Maryland Democrat Pushes Plan to Punish ICE Veterans with Job Ban appear…",
    "link": "https://www.breitbart.com/politics/2026/01/18/maryland-democrat-pushes-plan-to-punish-ice-veterans-with-job-ban/",
    "timestamp": "2026-01-19T00:00:26Z"
  },
  {
    "title": "'The finest in the world': Why the US is buying icebreakers from Finland",
    "description": "The Nordic nation leads the way when it comes to both the design and construction of the vessels.",
    "link": "https://www.bbc.com/news/articles/c0q48d71ke8o",
    "timestamp": "2026-01-19T00:00:19Z"
  },
  {
    "title": "‘Greed is the iron cage of our times’ — why nationalism is here to stay",
    "description": "A generation that missed out on economic growth is driving the trends overtaking politics today.",
    "link": "https://www.nature.com/articles/d41586-026-00186-8",
    "timestamp": "2026-01-19T00:00:00Z"
  },
  {
    "title": "‘Attack on our leader Khamenei means full-scale war,’ Iran’s president warns US after Donald Trump remarks",
    "description": "The latest unrest in Iran began on 28 December, when anger over high prices, a weak currency and economic hardship spread from Tehran to cities across the country.",
    "link": "https://indianexpress.com/article/world/attack-on-our-leader-khamenei-means-full-scale-war-irans-president-warns-us-10481801/",
    "timestamp": "2026-01-18T23:57:06Z"
  },
  {
    "title": "Gaza board extended membership to cost $1 billion — reports",
    "description": "According to media reports, the Gaza \"Board of Peace\" draft charter requires members to contribute $1 billion in cash to extend their membership.",
    "link": "https://www.dw.com/en/gaza-board-extended-membership-to-cost-1-billion-reports/a-75553537",
    "timestamp": "2026-01-18T23:57:00Z"
  },
  {
    "title": "Gaza board extended membership to cost $1 billion — reports",
    "description": "According to media reports, the Gaza \"Board of Peace\" draft charter requires members to contribute $1 billion in cash to extend their membership. A draft charter of the Gaza \"Board of Peace,\" sent to about 60 countries by the Trump administration in the Unite…",
    "link": "https://www.dw.com/en/gaza-board-extended-membership-to-cost-1-billion-reports/a-75553537",
    "timestamp": "2026-01-18T23:57:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,425",
    "description": "These are the key developments from day 1,425 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2026/1/18/russia-ukraine-war-list-of-key-events-day-1425",
    "timestamp": "2026-01-18T23:54:30Z"
  }
]