[
  {
    "title": "Trump’s Own RNC Chair Issues Chilling 2026 Prediction",
    "description": "President Donald Trump’s handpicked Republican National Committee chair is predicting GOP obliteration in the 2026 midterms. With party operatives fearing...",
    "link": "https://www.thedailybeast.com/trumps-own-republican-chair-issues-chilling-2026-prediction/",
    "timestamp": "2025-12-12T17:44:54Z"
  },
  {
    "title": "'Looming disaster': Top Republicans fear 'certain defeat' because Trump's 'message sucks'",
    "description": "President Donald Trump's handpicked chairman of the Republican National Committee predicted a dismal outcome for the GOP in next year's midterm elections.RNC chairman Joe Gruters tried to set expectations for 2026 as low as possible, according to The Bulwark'…",
    "link": "https://www.rawstory.com/republican-midterm-defeat/",
    "timestamp": "2025-12-12T17:44:19Z"
  },
  {
    "title": "White House will work with Congress on single framework for AI, adviser says",
    "description": "The Trump administration will work with Congress in coming weeks and months to craft a single national framework to regulate developments in the field of artificial intelligence (AI), White House adviser Sriram Krishnan said.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/white-house-will-work-with-congress-on-single-framework-for-ai-adviser-says/articleshow/125937946.cms",
    "timestamp": "2025-12-12T17:42:28Z"
  },
  {
    "title": "How to deal with US-Pak arms biradari",
    "description": "Donald Trump has lined up $686 mn military aid for Pakistan, this time to sustain interoperability in counterterrorism operations and joint exercises. The US Defense Security Cooperation Agency (DSCA) proposal to Congress this week will be reviewed over a 30-…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/how-to-deal-with-us-pak-arms-biradari/articleshow/125937894.cms",
    "timestamp": "2025-12-12T17:42:21Z"
  },
  {
    "title": "New Batch of Epstein Photos Include Bill Gates, Richard Branson, and Segway Inventor",
    "description": "President Trump is in there too, but you could probably guess that by now.",
    "link": "https://gizmodo.com/new-batch-of-epstein-photos-include-bill-gates-richard-branson-and-segway-inventor-2000699130",
    "timestamp": "2025-12-12T17:41:27Z"
  },
  {
    "title": "Germany Summons Russian Ambassador Over Alleged Sabotage and Election Interference",
    "description": "German officials have previously accused Russia of hybrid warfare attacks to destabilize Europe.\nThe post Germany Summons Russian Ambassador Over Alleged Sabotage and Election Interference appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/12/12/germany-summons-russian-ambassador-over-alleged-sabotage-and-election-interference/",
    "timestamp": "2025-12-12T17:41:24Z"
  },
  {
    "title": "Trump Signs Order to Limit State-Level AI Regulation",
    "description": "President Donald Trump signed an order aimed at thwarting state-level regulation of artificial intelligence through lawsuits and funding cuts.\nThe order directs the US attorney general to establish an \"AI Litigation Task Force\" to challenge state AI laws that…",
    "link": "https://biztoc.com/x/0d334556a65190b6",
    "timestamp": "2025-12-12T17:41:07Z"
  },
  {
    "title": "AI is powering Trump’s economy, but American voters are getting worried",
    "description": "(Bloomberg/Mark Niquette and Nancy Cook) — President Donald Trump is heading into the 2026 election year vowing to pull out all the stops to promote artificial intelligence — just as American voters are starting to voice some doubts.\nAll through Trump’s first…",
    "link": "https://biztoc.com/x/54bca223017e01db",
    "timestamp": "2025-12-12T17:41:01Z"
  },
  {
    "title": "Treasury rachets up investigations targeting Minnesota’s Somali community for fraud",
    "description": "WASHINGTON (AP) — The Treasury Department is targeting businesses that people use to wire money to family members abroad as the Trump administration rachets up investigations into fraud within Minnesota’s Somali community, Treasury Secretary Scott Bessent sai…",
    "link": "https://financialpost.com/pmn/treasury-rachets-up-investigations-targeting-minnesotas-somali-community-for-fraud",
    "timestamp": "2025-12-12T17:38:44Z"
  },
  {
    "title": "‘Unfairly convicted’: Trump hands Tina Peters ‘full Pardon for her attempts to expose Voter Fraud’",
    "description": "'The left wants her dead'",
    "link": "https://www.wnd.com/2025/12/unfairly-convicted-trump-hands-tina-peters-full-pardon/",
    "timestamp": "2025-12-12T17:38:11Z"
  },
  {
    "title": "Newly released photos from Epstein estate include images of Trump, Clinton",
    "description": "Democrats on the House Oversight Committee have released more photos from the estate of Jeffrey Epstein, including ones of Donald Trump and Bill Clinton.",
    "link": "https://abcnews.go.com/US/newly-released-photos-epstein-estate-include-images-trump/story?id=128345597",
    "timestamp": "2025-12-12T17:38:01Z"
  },
  {
    "title": "Danish intelligence report warns of U.S. military threat under Trump",
    "description": "The United States is using its economic power to “assert its will\" and threaten military force against friend and foe alike, a Danish intelligence agency said in a new report.",
    "link": "https://www.pbs.org/newshour/world/danish-intelligence-report-warns-of-u-s-military-threat-under-trump",
    "timestamp": "2025-12-12T17:35:22Z"
  },
  {
    "title": "Trump Touts U.S. Economy During EO Signing: 'Hottest Country Anywhere in the World'",
    "description": "President Donald Trump touted the U.S. economy Thursday during an Oval Office signing, highlighting a record-high stock market and falling gas prices.\nThe post Trump Touts U.S. Economy During EO Signing: ‘Hottest Country Anywhere in the World’ appeared first …",
    "link": "https://www.breitbart.com/economy/2025/12/12/trump-touts-u-s-economy-during-eo-signing-hottest-country-anywhere-in-the-world/",
    "timestamp": "2025-12-12T17:32:05Z"
  },
  {
    "title": "Letitia James Not Indicted Again, That'll Teach Her To Continue Not Being Criminal",
    "description": "This round unsurprisingly goes to the New York Attorney General.",
    "link": "https://www.wonkette.com/p/letitia-james-not-indicted-again",
    "timestamp": "2025-12-12T17:31:57Z"
  },
  {
    "title": "Former Iraqi President Salih slated to lead UN refugee agency",
    "description": "Salih, who fled Saddam Hussein's regime, campaigned for job on basis that he knows what it is like to be a refugee.",
    "link": "https://www.aljazeera.com/news/2025/12/12/former-iraqi-president-salih-slated-to-take-over-un-refugee",
    "timestamp": "2025-12-12T17:31:24Z"
  },
  {
    "title": "Trump’s Affordability Weave",
    "description": "The president can’t seem to stay focused on the issue that voters care about most.",
    "link": "https://www.theatlantic.com/politics/2025/12/trump-affordability-message/685236/",
    "timestamp": "2025-12-12T17:30:47Z"
  },
  {
    "title": "Trump’s Beloved Beauty Queen Prosecutor Set to Suffer Fresh Humiliation",
    "description": "Senate Democrats appear likely to deal yet another blow to Lindsey Halligan, President Donald Trump’s embattled pick to lead the U.S. Attorney’s Office for...",
    "link": "https://www.thedailybeast.com/donald-trumps-beloved-beauty-queen-prosecutor-lindsey-halligan-set-to-suffer-fresh-humiliation/",
    "timestamp": "2025-12-12T17:30:23Z"
  },
  {
    "title": "Intel has tested chipmaking tools from firm with sanctioned China unit, sources say",
    "description": "Chipmaker Intel, has tested chipmaking tools this year from a toolmaker with deep roots in China and two overseas units that were targeted by US sanctions.",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-has-tested-chipmaking-tools-from-firm-with-sanctioned-china-unit-sources-say/articleshow/125937661.cms",
    "timestamp": "2025-12-12T17:29:16Z"
  },
  {
    "title": "Husted files for 2026 Senate race, launching aggressive statewide re-election push",
    "description": "Ohio Sen. Jon Husted files for re-election with Trump backing in what's expected to be one of the most expensive Senate races nationwide in 2026.",
    "link": "https://www.foxnews.com/politics/husted-files-2026-senate-race-launching-aggressive-statewide-re-election-push",
    "timestamp": "2025-12-12T17:27:56Z"
  },
  {
    "title": "Draw marks 'starting gun' toward 2026 World Cup, Vancouver says",
    "description": "The first high-profile Canadian performance on the 2026 World Cup stage did not go smoothly: hockey legend Wayne Gretzky mispronounced several country names during the tournament draw -- including Jordan -- prompting widespread ridicule.\"They're not all house…",
    "link": "https://sports.yahoo.com/articles/draw-marks-starting-gun-toward-172732185.html",
    "timestamp": "2025-12-12T17:27:32Z"
  },
  {
    "title": "Power is a ‘drug’ for Zelensky – political scientist",
    "description": "Ukraine’s Vladimir Zelensky is desperate to retain power, as stepping down would mean “political death,” Anton Orlov has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629385-power-drug-zelensky-elections/",
    "timestamp": "2025-12-12T17:27:18Z"
  },
  {
    "title": "'Trump Condoms' Seen in Newly Released Batch of Epstein Photos",
    "description": "House Democrats on the House Oversight Committee on Friday unveiled a fresh batch of 19 images from the estate of the late financier and convicted sex offender Jeffrey Epstein, bringing renewed scrutiny to the sprawling archive of materials tied to his networ…",
    "link": "https://www.ibtimes.com/trump-condoms-seen-newly-released-batch-epstein-photos-3792506",
    "timestamp": "2025-12-12T17:25:28Z"
  },
  {
    "title": "House Democrats release photos of Trump, Clinton and Andrew from Epstein's estate (Stephen Groves/Associated Press)",
    "description": "Stephen Groves / Associated Press:\nHouse Democrats release photos of Trump, Clinton and Andrew from Epstein's estate  —  House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton …",
    "link": "https://www.memeorandum.com/251212/p54",
    "timestamp": "2025-12-12T17:25:00Z"
  },
  {
    "title": "Kiev and its backers waiting out ‘natural disaster’ Trump – expert (VIDEO)",
    "description": "Kiev and its European backers hope to wait out Trump to pursue a war with Russia with his successor, Stevan Gajic has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629378-ukraine-zelensky-expert-stevan-gajic/",
    "timestamp": "2025-12-12T17:23:56Z"
  },
  {
    "title": "CNN’s Elle Reeve Revisits Pro-Trumpers and Finds Their Excitement Is Fading: ‘Not the Biggest Fan’",
    "description": "CNN's Elle Reeve revisited Louisiana's Redneck Christmas Parade where residents were far more mixed on President Donald Trump than they were two years prior.\nThe post CNN’s Elle Reeve Revisits Pro-Trumpers and Finds Their Excitement Is Fading: ‘Not the Bigges…",
    "link": "https://www.mediaite.com/media/tv/cnns-elle-reeve-revisits-pro-trumpers-and-finds-their-excitement-is-fading-not-the-biggest-fan/",
    "timestamp": "2025-12-12T17:23:26Z"
  },
  {
    "title": "Abrego García freed from jail on judge’s order",
    "description": "The wrongfully deported man has been released from an ICE detention center",
    "link": "https://theweek.com/politics/abrego-garcia-released",
    "timestamp": "2025-12-12T17:23:06Z"
  },
  {
    "title": "Thai PM says asked Trump to press Cambodia on border truce",
    "description": "Thailand’s prime minister said he told US President Donald Trump in a phone call Friday that Cambodia was to blame for deadly border clashes, stopping short of declaring Bangkok was willing to halt fire. Fighting between the Southeast Asian neighbours this we…",
    "link": "https://www.digitaljournal.com/world/thai-pm-says-asked-trump-to-press-cambodia-on-border-truce/article",
    "timestamp": "2025-12-12T17:22:20Z"
  },
  {
    "title": "What to know about Trump's executive order to curtail state AI regulations",
    "description": "Critics from both political parties - as well as civil liberties and consumer rights groups - worry that banning state regulation would amount to a favor for big AI companies, who enjoy little to no oversight and that Trump's effort oversteps the limits of pr…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/what-to-know-about-trumps-executive-order-to-curtail-state-ai-regulations/articleshow/125937528.cms",
    "timestamp": "2025-12-12T17:21:39Z"
  },
  {
    "title": "Trump’s AI executive order promises ‘one rulebook.’ Startups may get legal limbo instead",
    "description": "President Donald Trump signed an executive order Thursday evening that directs federal agencies to take aim at state AI laws, arguing startups need relief from a “patchwork” of rules. But legal experts and startups say the order could prolong uncertainty, spa…",
    "link": "https://biztoc.com/x/0efe99e81fa15304",
    "timestamp": "2025-12-12T17:18:47Z"
  },
  {
    "title": "What To Know About Trump's New 'Gold Card' Visa Program",
    "description": "What To Know About Trump's New 'Gold Card' Visa Program\n \nAuthored by Savannah Hulsey Pointer via The Epoch Times,\nApplications opened on Dec. 10 for the Trump administration’s new Gold Card program that expedites visas for wealthy individuals.\nThe program, i…",
    "link": "https://biztoc.com/x/552aaf649f2eca7e",
    "timestamp": "2025-12-12T17:18:39Z"
  },
  {
    "title": "Trump expected to sign executive order to reclassify marijuana as soon as Monday, source tells CNBC; pot stocks surge",
    "description": "Cannabis stocks jumped on Friday as the White House prepared to significantly ease federal restrictions on marijuana. President Donald Trump is expected to issue an executive order as soon as Monday that would allow for reclassification of weed, a source fami…",
    "link": "https://freerepublic.com/focus/f-news/4357095/posts",
    "timestamp": "2025-12-12T17:15:58Z"
  },
  {
    "title": "US regulator grants crypto firms initial approval to launch trust banks",
    "description": "Dec 12 (Reuters) - Crypto giants including Ripple and Circle on Friday received preliminary approval from a top ​banking regulator to establish national...",
    "link": "https://finance.yahoo.com/news/us-regulator-grants-crypto-firms-171550389.html",
    "timestamp": "2025-12-12T17:15:50Z"
  },
  {
    "title": "Trump appears in photos released from Epstein estate",
    "description": "Democrats on a congressional oversight panel have released more images from the estate of the late convicted sex offender Jeffrey Epstein, including photos of US President Donald Trump.",
    "link": "https://www.rte.ie/news/world/2025/1212/1548739-epstein-pictures-released/",
    "timestamp": "2025-12-12T17:14:18Z"
  },
  {
    "title": "White House sued by historic preservation group over ballroom plans",
    "description": "The National Trust for Historic Preservation argues the White House failed to seek necessary reviews before demolishing the historic East Wing.",
    "link": "https://www.bbc.com/news/articles/c07555m4710o",
    "timestamp": "2025-12-12T17:13:52Z"
  },
  {
    "title": "'Who's Melanie?' Stephen Miller's wife makes awkward mistake trying to defend first lady",
    "description": "The wife of top Trump advisor and Trump administration immigration policy architect Stephen Miller made an awkward mistake Friday while trying to defend First lady Melania Trump and attack a Democrat. Conservative podcaster and Elon Musk employee Katie Miller…",
    "link": "https://www.rawstory.com/whos-melanie-stephen-miller-s-wife-makes-awkward-mistake-trying-to-defend-first-lady/",
    "timestamp": "2025-12-12T17:13:08Z"
  },
  {
    "title": "Trump Hit With Massive Lawsuit Over His Tacky Ballroom",
    "description": "President Donald Trump just got hit with a lawsuit over his enormous $300 million ballroom that would dwarf the White House.In a 65-page complaint filed Friday, the National Trust for Historic Preservation, a nonprofit organization working to save America’s h…",
    "link": "https://newrepublic.com/post/204360/trump-lawsuit-ballroom",
    "timestamp": "2025-12-12T17:11:08Z"
  },
  {
    "title": "Indiana Senate rejects Trump’s gerrymander push",
    "description": "The proposed gerrymander would have likely flipped the state’s two Democratic-held US House seats",
    "link": "https://theweek.com/politics/indiana-republicans-redistricting-vote-trump",
    "timestamp": "2025-12-12T17:11:05Z"
  },
  {
    "title": "Trump’s AI executive order promises 'one rulebook.' Startups may get legal limbo instead. | TechCrunch",
    "description": "Trump signed an AI executive order targeting state laws and promising one national rulebook. Critics warn it could trigger court battles and prolong uncertainty for startups while Congress debates federal rules.",
    "link": "https://techcrunch.com/2025/12/12/trumps-ai-executive-order-promises-one-rulebook-startups-may-get-legal-limbo-instead/",
    "timestamp": "2025-12-12T17:10:09Z"
  },
  {
    "title": "Trump's ballroom project could be halted by new lawsuit",
    "description": "The National Trust for Historic Preservation filed a lawsuit Friday to stop President Donald Trump's White House ballroom project.Historic preservationists had attempted to stop the president from rapidly demolishing the White House’s East Wing for the projec…",
    "link": "https://www.rawstory.com/white-house-ballroom-2674395162/",
    "timestamp": "2025-12-12T17:09:04Z"
  },
  {
    "title": "Trump's Bruised Hands: Aide Claims Marks Come From Aspirin and Constant Handshaking",
    "description": "White House explains President Trump's bruised, bandaged hands, citing daily aspirin use and constant handshaking, while deferring details on his cognitive tests.",
    "link": "https://www.ibtimes.com/trumps-bruised-hands-aide-claims-marks-come-aspirin-constant-handshaking-3792504",
    "timestamp": "2025-12-12T17:08:08Z"
  },
  {
    "title": "House Republicans make matters even worse for Trump on his day from hell",
    "description": "Donald Trump has suffered through plenty of awful days this year, but few could compete with the events that unfolded on Thursday.\nOver the course of roughly six hours, the president learned that a federal judge had ordered Kilmar Abrego Garcia to be released…",
    "link": "https://biztoc.com/x/62ec77eecd6638b2",
    "timestamp": "2025-12-12T17:07:35Z"
  },
  {
    "title": "Trump appears in newly released photographs from Epstein estate",
    "description": "Democrats on congressional oversight ​panel release more than a dozen new images",
    "link": "https://www.irishtimes.com/world/us/2025/12/12/trump-appears-in-newly-released-photographs-from-epstein-estate/",
    "timestamp": "2025-12-12T17:07:04Z"
  },
  {
    "title": "Donald Trump Condoms and Adult Toys: New Jeffrey Epstein Images Released",
    "description": "Donald condoms among the bizarre items Jeffrey kept. The post Donald Trump Condoms and Adult Toys: New Jeffrey Epstein Images Released appeared first on...",
    "link": "https://www.realitytea.com/2025/12/12/donald-trump-condoms-jeffrey-epstein-images-estate/",
    "timestamp": "2025-12-12T17:05:21Z"
  },
  {
    "title": "After Trump’s ‘garbage’ slur, a Vermont school building flew a Somali flag. Then came the threats",
    "description": "The Somali flag was flown alongside the Vermont state flag and beneath the United States flag at a building that includes K-12 classrooms. Somali students cheered and clapped, telling administrators the flag flying meant a great deal to them.",
    "link": "https://www.pbs.org/newshour/nation/after-trumps-garbage-slur-a-vermont-school-building-flew-a-somali-flag-then-came-the-threats",
    "timestamp": "2025-12-12T17:04:42Z"
  },
  {
    "title": "House Democrats release photos of Trump, Clinton and Andrew from Epstein's estate",
    "description": "House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton and the former Prince Andrew.",
    "link": "https://www.cbc.ca/news/world/democrats-photos-epstein-trump-clinton-andrew-9.7013497",
    "timestamp": "2025-12-12T17:04:27Z"
  },
  {
    "title": "Flooding Lingers in Washington State as More Rain Approaches",
    "description": "Rivers continued rising to the north and east of Seattle after record rains washed out highways and prompted evacuation warnings for more than 100,000 people.",
    "link": "https://financialpost.com/pmn/business-pmn/flooding-lingers-in-washington-state-as-more-rain-approaches",
    "timestamp": "2025-12-12T17:03:47Z"
  },
  {
    "title": "Trump signs executive order to block state AI regulations, including Colorado’s",
    "description": "Members of Congress from both parties, as well as civil liberties and consumer rights groups, have pushed for more regulations on AI, saying there is not enough oversight for the powerful technology.",
    "link": "https://www.denverpost.com/2025/12/12/trump-blocks-state-ai-regulations-colorado/",
    "timestamp": "2025-12-12T17:03:43Z"
  },
  {
    "title": "Trump Disaster: Polling 31% On Economy, With Huge Support To Extend ACA Subsides",
    "description": "Trump's approval rating on the economy is falling faster than Pete Hegseth at a keg party. (h/t Conover)\nIn the latest poll from AP-NORC, Donald Trump's approval rating on the economy, inflation, and immigration is at the lowest point at any time during his t…",
    "link": "https://crooksandliars.com/2025/12/trump-disaster-polling-31-economy",
    "timestamp": "2025-12-12T17:03:35Z"
  },
  {
    "title": "Lily Allen’s West End Girl reflects the idea women are becoming increasingly disaffected with men",
    "description": "Interest in Allen’s latest album goes beyond celebrity gossip, resonating with audiences for its raw contemplation of contemporary heterosexuality.",
    "link": "https://theconversation.com/lily-allens-west-end-girl-reflects-the-idea-women-are-becoming-increasingly-disaffected-with-men-271864",
    "timestamp": "2025-12-12T17:03:16Z"
  },
  {
    "title": "Lily Allen’s West End Girl reflects the idea that women are becoming increasingly disaffected with men",
    "description": "Interest in Allen’s latest album goes beyond celebrity gossip, resonating with audiences for its raw contemplation of contemporary heterosexuality.",
    "link": "https://theconversation.com/lily-allens-west-end-girl-reflects-the-idea-that-women-are-becoming-increasingly-disaffected-with-men-271864",
    "timestamp": "2025-12-12T17:03:16Z"
  },
  {
    "title": "J6 Chair Makes Jaw-Dropping Claim: Pipe Bomb Videos Outside RNC and DNC Deleted—‘Doesn’t Exist’",
    "description": "Barry Loudermilk, Chairman of the new House Republican-led Select Subcommittee on January 6, claims that key surveillance footage showing areas near the RNC and DNC where pipe bombs were placed the prior evening was not preserved. Republican Rep. Loudermilk (…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357093/posts",
    "timestamp": "2025-12-12T17:02:25Z"
  },
  {
    "title": "Americans Still Concerned About High Prices But Less So Than Under Biden, Poll Shows",
    "description": "Many Americans are still concerned about facing high prices this holiday season, according to an AP-NORC poll released on Friday.",
    "link": "https://dailycaller.com/2025/12/12/americans-proces-groceries-electricity-gas-biden/",
    "timestamp": "2025-12-12T17:02:14Z"
  },
  {
    "title": "Fermi Tanks 50% Amid Shock Exit of First Texas Data Center Customer",
    "description": "Fermi America announced their first potential tenant for the Project Matador data center campus terminated their $150 million Advance in Aid of Construction agreement (i.e., lease). The stock has plunged as much as 50% in premarket trading in what is a wild o…",
    "link": "https://oilprice.com/Energy/Energy-General/Fermi-Tanks-50-Amid-Shock-Exit-of-First-Texas-Data-Center-Customer.html",
    "timestamp": "2025-12-12T17:00:00Z"
  },
  {
    "title": "Today's news and jokes",
    "description": "The @ArmyNavyGame concessions on Saturday are ELITE:- Burnt End Tank Nachos- Crab Destroyer Nachos- Chicken Tender Humvees/Carriers⚓️ pic.twitter.com/hn7Dd8jlO7\r\n— RedditCFB (@RedditCFB) December 11, 2025 \n\n\n\n\n\n\n\n\n\n\n\n\none thing that doesn’t get enough…",
    "link": "https://www.superpunch.net/2025/12/todays-news-and-jokes_02080190916.html",
    "timestamp": "2025-12-12T17:00:00Z"
  },
  {
    "title": "SZA, Sabrina Carpenter and other celebs who have called out the White House for using their music",
    "description": "Divisive US President Donald Trump is making more enemies in the entertainment industry, including the likes of SZA and Sabrina Carpenter. From campaign rallies to social media posts, the White House team has been using pop music to soundtrack their online ac…",
    "link": "https://www.thepinknews.com/2025/12/12/sza-sabrina-carpenter-white-house-for-using-their-music/",
    "timestamp": "2025-12-12T16:59:41Z"
  },
  {
    "title": "Trump administration says sign language services ‘intrude’ on Trump’s ability to control his image",
    "description": "A federal judge recently ordered the White House to provide the interpreting.",
    "link": "https://www.bostonherald.com/2025/12/12/white-house-sign-language/",
    "timestamp": "2025-12-12T16:59:31Z"
  },
  {
    "title": "EU inches closer to new pharma legislation amid competitiveness drive",
    "description": "The framework has had a lukewarm reaction, with trade association EFPIA saying the policies are “not strong enough”.",
    "link": "https://www.pharmaceutical-technology.com/news/eu-inches-closer-to-new-pharma-legislation-amid-competitiveness-drive/",
    "timestamp": "2025-12-12T16:58:48Z"
  },
  {
    "title": "Randy Rainbow Sings A Christmas Downer To Crucify Trump And Co.",
    "description": "\"It's beginning to look a lot like f**k this,\" the Trump-tweaking comedian sings in his new parody.",
    "link": "https://www.huffpost.com/entry/randy-rainbow-its-beginning-to-look-a-lot-like-christmas_n_693c286de4b07bcd25431460",
    "timestamp": "2025-12-12T16:57:22Z"
  },
  {
    "title": "Kristi Noem handed impeachment ultimatum",
    "description": "Representative Delia Ramirez, an Illinois Democrat, demanded on Thursday that Department of Homeland Security (DHS) Secretary Kristi Noem either resign or face impeachment. The congresswoman requested that House Judiciary chairman Jim Jordan, an Ohio Republic…",
    "link": "https://freerepublic.com/focus/f-news/4357092/posts",
    "timestamp": "2025-12-12T16:57:18Z"
  },
  {
    "title": "Donald Trump Faces Lawsuit Over White House Ballroom Project",
    "description": "President Donald Trump was sued by preservationists on Friday, seeking to halt plans for a White House ballroom until the project undergoes architectural review and receives congressional approval.\nThe National Trust for Historic Preservation filed the lawsui…",
    "link": "https://biztoc.com/x/4bfa3f400d5ced8f",
    "timestamp": "2025-12-12T16:56:40Z"
  },
  {
    "title": "Donald Trump Faces Lawsuit Over White House Ballroom Project",
    "description": "President Donald Trump was sued by preservationists on Friday, seeking to halt plans for a White House ballroom until the project undergoes architectural review and receives congressional approval.\nThe National Trust for Historic Preservation filed the lawsui…",
    "link": "https://biztoc.com/x/4bfa3f400d5ced8f",
    "timestamp": "2025-12-12T16:56:40Z"
  },
  {
    "title": "Admiral hands over leadership of command overseeing the Trump administration’s boat strikes",
    "description": "Adm. Holsey retired one year into a posting that typically lasts 3-4 years.",
    "link": "https://www.bostonherald.com/2025/12/12/trump-cartel-attacks-admiral/",
    "timestamp": "2025-12-12T16:55:25Z"
  },
  {
    "title": "Top Indiana Republican Claims Trump Pledged to Withhold Funds If State Didn’t Approve Rigged Map",
    "description": "Republican Indiana Lt. Gov. Micah Beckwith posted and subsequently deleted a claim that President Donald Trump had threatened to cut off funding to his state unless its legislators approved a mid-decade gerrymander that would have changed the composition of i…",
    "link": "https://www.commondreams.org/news/trump-indiana-funding-threat",
    "timestamp": "2025-12-12T16:53:07Z"
  },
  {
    "title": "Historic preservation non-profit files lawsuit to stop White House ballroom construction",
    "description": "The National Trust for Historic Preservation has filed a lawsuit Friday in U.S. District Court to stop the construction of the White House ballroom.",
    "link": "https://wjla.com/news/local/white-house-ballroom-construction-president-donald-trump-national-trust-historic-preservation-files-lawsuit-congress-approval-nps-east-wing-demolition",
    "timestamp": "2025-12-12T16:52:52Z"
  },
  {
    "title": "19 More Photos From Epstein’s Estate Released, With More To Come",
    "description": "The 19 new photos are just a minor fraction of the 95,000 images that the House Oversight Committee said it has recently received.",
    "link": "https://www.huffpost.com/entry/19-more-photos-from-epsteins-estate-released-with-more-to-come_n_693c38c0e4b0898f030093e0",
    "timestamp": "2025-12-12T16:52:47Z"
  },
  {
    "title": "Trump administration says sign language services 'intrude' on Trump's ability to control his image",
    "description": "The Trump administration is arguing that requiring real-time American Sign Language interpretation of events like White House press briefings “would severely...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-says-sign-language-165203170.html",
    "timestamp": "2025-12-12T16:52:03Z"
  },
  {
    "title": "Trump’s HUD Accuses Boston of Engaging In “Redlining” Against White People",
    "description": "The Department of Housing and Urban Development announced Thursday that it is opening an investigation into Boston’s housing policies, accusing the city of discriminating against white people.  “No person or entity—the City of Boston included—is permitted to …",
    "link": "https://www.motherjones.com/politics/2025/12/trumps-hud-accuses-boston-of-engaging-in-redlining-against-white-people/",
    "timestamp": "2025-12-12T16:51:17Z"
  },
  {
    "title": "Admiral hands over leadership of command overseeing the Trump administration's boat strikes",
    "description": "A U.S. Navy admiral who oversees military operations in Latin America handed off command responsibilities Friday as scrutiny increases over the Trump...",
    "link": "https://www.yahoo.com/news/articles/admiral-hands-over-leadership-command-165048404.html",
    "timestamp": "2025-12-12T16:50:48Z"
  },
  {
    "title": "What the New Epstein Photos Show",
    "description": "Here’s what’s in the 19 new photos House Democrats just released from the Jeffrey Epstein estate, showing the financier with Donald Trump, Bill Clinton, and others.",
    "link": "http://nymag.com/intelligencer/article/new-epstein-photos-trump-clinton-house-oversight-committee.html",
    "timestamp": "2025-12-12T16:48:00Z"
  },
  {
    "title": "See the 19 Photos House Oversight Democrats Just Released From Epstein's Estate",
    "description": "US House Committee on Oversight and Reform Democrats on Friday released 19 of the 95,000 new photos they just received from the estate of deceased sex offender Jeffrey Epstein, as the Department of Justice is preparing to release its files from the federal ca…",
    "link": "https://www.commondreams.org/news/trump-and-epstein-photos",
    "timestamp": "2025-12-12T16:46:39Z"
  },
  {
    "title": "White House quickly deletes 'blacklist' of journalists",
    "description": "The White House appears to have tweeted then deleted a “Naughty List” of journalists, including top news reporters and outlets, in an act that is being described as “positively authoritarian” by one legal expert.The video was posted to X (formerly Twitter), T…",
    "link": "https://www.rawstory.com/alternet-posts/trump-naughty-list-journalists/",
    "timestamp": "2025-12-12T16:46:08Z"
  },
  {
    "title": "'Trump will not be happy': Internet erupts over new pictures of president and Epstein",
    "description": "A batch of new photos released Friday of late financier and child sex offender Jeffrey Epstein with President Donald Trump, Woody Allen, Steve Bannon, Bill Gates, Bill Clinton and Richard Branson prompted a series of reactions online. The images released Frid…",
    "link": "https://www.rawstory.com/donald-trump-jeffrey-epstein-2674395009/",
    "timestamp": "2025-12-12T16:45:06Z"
  },
  {
    "title": "Stock Soars On Reports Of Federal Rescheduling",
    "description": "Canopy Growth Corp (NASDAQ:CGC) shares are skyrocketing Friday morning, driven by reports that President Donald Trump intends to relax federal marijuana regulations. \nCanopy Growth stock is surging to new heights today. Why are CGC shares rallying?\nWhat To Kn…",
    "link": "https://biztoc.com/x/a883b4754858b603",
    "timestamp": "2025-12-12T16:44:59Z"
  },
  {
    "title": "Senate rejects extension of health care subsidies as costs are set to rise for millions of Americans",
    "description": "WASHINGTON (AP) — The Senate on Thursday rejected legislation to extend Affordable Care Act tax credits, essentially guaranteeing that millions of Americans will see a steep rise in costs at the beginning of the year.",
    "link": "https://www.newspressnow.com/news/top-stories/2025/12/12/senate-rejects-extension-of-health-care-subsidies-as-costs-are-set-to-rise-for-millions-of-americans/",
    "timestamp": "2025-12-12T16:44:04Z"
  },
  {
    "title": "MS NOW’s Jen Psaki Praises Fox News Journo For Confronting Trump Spox: ‘Good Question By My Old Buddy Peter Doocy!’",
    "description": "MS NOW's Jen Psaki praised Fox's Peter Doocy for confronting White House Press Secretary Karoline Leavitt over President Donald Trump's actions in Venezuela.\nThe post MS NOW’s Jen Psaki Praises Fox News Journo For Confronting Trump Spox: ‘Good Question By My …",
    "link": "https://www.mediaite.com/media/tv/ms-nows-jen-psaki-praises-fox-news-journo-for-confronting-trump-spox-good-question-by-my-old-buddy-peter-doocy/",
    "timestamp": "2025-12-12T16:43:14Z"
  },
  {
    "title": "Trump Sued Over White House Ballroom Project",
    "description": "The National Trust for Historic Preservation argues Trump exceeded his constitutional authority by not seeking congressional approval for a project of this scale.",
    "link": "https://www.huffpost.com/entry/trump-sued-white-house-ballroom_n_693c43cae4b07bcd25436378",
    "timestamp": "2025-12-12T16:41:57Z"
  },
  {
    "title": "[Catholic Caucus] Poll: Most Catholic voters support Trump, deportations despite bishops’ concern",
    "description": "[Catholic Caucus] Poll: Most Catholic voters support Trump, deportations despite bishops’ concernA majority of Catholic voters in the United States have a favorable opinion of President Donald Trump and support the broad-scale deportation of immigrants who ar…",
    "link": "https://freerepublic.com/focus/f-religion/4357089/posts",
    "timestamp": "2025-12-12T16:40:22Z"
  },
  {
    "title": "Trump sued by preservationists seeking architecture review over White House ballroom project",
    "description": "Preservationists have sued President Donald Trump. They seek a review and congressional approval for his White House ballroom project. The National Trust for Historic Preservation wants the project stopped until it undergoes reviews and gains approval. Trump'…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-sued-by-preservationists-seeking-architecture-review-over-white-house-ballroom-project/articleshow/125936924.cms",
    "timestamp": "2025-12-12T16:39:05Z"
  },
  {
    "title": "Omar accused by GOP opponent of opening up the door to massive Minneapolis fraud: 'Deep, deep ties'",
    "description": "Republican challenger John Nagel accuses Rep. Ilhan Omar of enabling $1 billion fraud scandal through her legislation in Minneapolis district race.",
    "link": "https://www.foxnews.com/politics/omar-accused-gop-opponent-opening-up-door-massive-minneapolis-fraud-deep-deep-ties",
    "timestamp": "2025-12-12T16:37:57Z"
  },
  {
    "title": "Germany Loves to Hate Friedrich Merz",
    "description": "Germany’s chancellor is doing far better than everyone seems to think.",
    "link": "http://foreignpolicy.com/2025/12/12/friedrich-merz-germany-chancellor-economy-ukraine-trump-america/",
    "timestamp": "2025-12-12T16:34:45Z"
  },
  {
    "title": "Trump Signs AI Executive Order Blocking State-Level Regulations",
    "description": "Trump signs an AI executive order limiting state regulations and shifting AI oversight to the federal government.",
    "link": "https://www.androidheadlines.com/2025/12/trump-signs-ai-executive-order-blocking-state-level-regulations.html",
    "timestamp": "2025-12-12T16:34:10Z"
  },
  {
    "title": "New York the 'worst offender' for improper non-domiciled CDLs: DOT",
    "description": "DOT Secretary Sean Duffy found 'alarming' errors with New York's issuance of non-domiciled CDLs. New York says Duffy is 'lying...",
    "link": "https://www.overdriveonline.com/regulations/article/15774044/new-york-the-worst-offender-for-improper-nondomiciled-cdls-dot",
    "timestamp": "2025-12-12T16:34:02Z"
  },
  {
    "title": "Slog AM: Skagit County Flood Risk Persists, a Ghost Ship in Mukilteo, Indiana Republicans Vote Against Trump Plan",
    "description": "The Stranger's morning news round-up.\n \n by Nathalie Graham\n \n \n \n Listen to the Evacuation Orders! Around 78,000 people live in the Skagit River's flood plain. While the rain has lessened, flood waters are still accumulating. The water level is rising in the…",
    "link": "https://www.thestranger.com/slog-am/2025/12/12/80369920/slog-am-skagit-county-flood-risk-persists-a-ghost-ship-in-mukilteo-indiana-republicans-vote-against-trump-plan",
    "timestamp": "2025-12-12T16:34:00Z"
  },
  {
    "title": "As Americans reject his handling of the economy, Trump turns to self-pity",
    "description": "Shortly before Thanksgiving, as his approval rating continued to sink, Donald Trump published an all-caps boast to his social media platform. “I have just gotten the highest poll numbers of my ‘political career,’” the president wrote, embracing an idiosyncrat…",
    "link": "https://biztoc.com/x/f24a97d464c96eca",
    "timestamp": "2025-12-12T16:33:57Z"
  },
  {
    "title": "Tilray Stock Surges as Trump Signals Major Shift in Federal Marijuana Policy",
    "description": "Tilray Brands, Inc. (NASDAQ:TLRY) shares are trading higher Friday following a report suggesting that President Donald Trump is expected to reclassify marijuana as a Schedule III drug.\nTilray Brands stock is charging ahead with explosive momentum. What’s fuel…",
    "link": "https://biztoc.com/x/0c621c90207ec9ed",
    "timestamp": "2025-12-12T16:33:51Z"
  },
  {
    "title": "U.S. Mint reveals coin designs commemorating 250th anniversary of America’s independence",
    "description": "The U.S. Mint unveiled the designs for coins commemorating the 250th anniversary of American independence next year. They depict the founding documents and the Revolutionary War, but so far, not President Donald Trump, despite a push among some of his allies …",
    "link": "https://www.fastcompany.com/wp-admin/post.php?post=91459664&amp;action=edit",
    "timestamp": "2025-12-12T16:31:16Z"
  },
  {
    "title": "Why is Latin America shifting hard right?",
    "description": "Chile looks set to elect its most right-wing president since Pinochet on Sunday, reflecting a broader regional swing away from leftist governments",
    "link": "https://www.irishtimes.com/world/americas/2025/12/12/why-is-latin-america-shifting-hard-right/",
    "timestamp": "2025-12-12T16:30:00Z"
  },
  {
    "title": "From nukes to AI, China seeks to write new global rules",
    "description": "China is making a bold bid to shape how the world thinks about war, peace, and power in the decades ahead Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629379-china-nukes-ai-rules/",
    "timestamp": "2025-12-12T16:28:54Z"
  },
  {
    "title": "CNN Anchor Struggles To Describe ‘Remarkable’ New Epstein Photos That Include Trump: ‘Hard To Even Explain What You’re Looking At’",
    "description": "CNN's Kaitlan Collins struggled to explain some images released by the estate of late predator Jeffrey Epstein, which includes a photo of Trump condoms.\nThe post CNN Anchor Struggles To Describe ‘Remarkable’ New Epstein Photos That Include Trump: ‘Hard To Eve…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchor-struggles-to-describe-remarkable-new-epstein-photos-that-include-trump-hard-to-even-explain-what-youre-looking-at/",
    "timestamp": "2025-12-12T16:27:28Z"
  },
  {
    "title": "Thailand PM tells Trump Cambodia is to blame for deadly border clashes",
    "description": "Thailand's prime minister, Anutin Charnvirakul, said he told US President Donald Trump in a phone call Friday that Cambodia was to blame for deadly border clashes.\"Trump said he want a ceasefire,\" Anutin told reporters after his call with the US president, ad…",
    "link": "https://www.israelnationalnews.com/flashes/672245",
    "timestamp": "2025-12-12T16:26:00Z"
  },
  {
    "title": "Newly released photos show Trump and other wealthy elites palling around with Epstein",
    "description": "House Democrats have released a massive trove of photographs of President Donald Trump and other rich and powerful individuals palling around with sex offender Jeffrey Epstein.Democrats on the House Oversight Committee published the photographs Friday obtaine…",
    "link": "https://www.rawstory.com/trump-and-epstein-photos-new/",
    "timestamp": "2025-12-12T16:25:27Z"
  },
  {
    "title": "Trump sued by preservationists seeking architecture review over White House ballroom project",
    "description": "The National Trust for Historic Preservation is asking a court to stop Trump’s ballroom project.",
    "link": "https://www.bostonherald.com/2025/12/12/trump-sued-white-house-ballroom/",
    "timestamp": "2025-12-12T16:25:05Z"
  },
  {
    "title": "Trump sued by preservationists seeking architecture review over White House ballroom project",
    "description": "The National Trust for Historic Preservation is asking a court to stop Trump’s ballroom project.",
    "link": "https://www.denverpost.com/2025/12/12/trump-sued-white-house-ballroom/",
    "timestamp": "2025-12-12T16:25:05Z"
  },
  {
    "title": "Why Donald Trump is threatening military intervention in Nigeria and what it means for the government",
    "description": "At the end of October, President Trump redesignated Nigeria as a “Country of Particular Concern” and threatened a “guns-a-blazing intervention, citing the killing and persecution of Christians by Islamic groups in the country. Olukayode Bakare writes that Tru…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/12/12/why-donald-trump-is-threatening-military-intervention-in-nigeria-and-what-it-means-for-the-government/",
    "timestamp": "2025-12-12T16:23:27Z"
  }
]