[
  {
    "title": "Vance Questions Biden's Health as President: 'World's Largest Nuclear Arsenal'",
    "description": "Former President Joe Biden was diagnosed with an aggressive form of prostate cancer.",
    "link": "https://www.newsweek.com/jd-vance-joe-biden-health-president-cancer-2074114",
    "timestamp": "2025-05-19T13:52:34Z"
  },
  {
    "title": "Video of Joe Biden Saying He Had Cancer in 2022 Picked Up by Critics",
    "description": "A resurfaced video of Joe Biden saying he had cancer three years ago has been resurfaced by people accusing him of a \"cover up.\"",
    "link": "https://www.newsweek.com/joe-biden-video-cancer-2022-2074102",
    "timestamp": "2025-05-19T13:51:38Z"
  },
  {
    "title": "Trump said Walmart earned billions more than expected. Here's why that's preposterous",
    "description": "President Donald Trump claimed over the weekend that Walmart (WMT) made “BILLIONS OF DOLLARS” more than expected last year. That’s not just wrong — it’s preposterous on multiple levels. In fact, you could say Walmart is one of the least likely companies in th…",
    "link": "https://qz.com/wmt-trump-bessent-surprise-billions-factcheck-1851781240",
    "timestamp": "2025-05-19T13:51:00Z"
  },
  {
    "title": "US Vice President Vance invites Pope Leo, an American, to visit home",
    "description": "After meeting Leo, Vance met on Monday with officials at the Vatican's Secretariat of State, the Church's top diplomatic office",
    "link": "https://www.jpost.com/breaking-news/article-854594",
    "timestamp": "2025-05-19T13:49:22Z"
  },
  {
    "title": "Bruce Springsteen Continues Trashing America to European Crowds, Trump WH Hits Back: 'Elitist and Out-of-Touch'",
    "description": "Rock star Bruce Springsteen has refused to quit his criticism of the USA under President Trump after being told to \"keep his mouth shut.\"",
    "link": "https://www.breitbart.com/entertainment/2025/05/19/springsteen-refuses-to-backdown-criticizing-usa-overseas/",
    "timestamp": "2025-05-19T13:49:12Z"
  },
  {
    "title": "Progressive Groups Marshal Opposition To Crypto Bill",
    "description": "The Senate is about to pass crypto-friendly legislation, the same week President Donald Trump rewards his biggest crypto buyers with a private dinner.",
    "link": "https://www.huffpost.com/entry/genius-act-senate-vote-elizabeth-warren_n_682b2ee3e4b025b439c2c436",
    "timestamp": "2025-05-19T13:49:06Z"
  },
  {
    "title": "New memorial to gay victims of Nazi persecution unveiled in Paris",
    "description": "A new memorial honouring and remembering LGBTQ+ victims of the Holocaust has been unveiled in Paris. Designed by French artist Jean-Luc Verna and unveiled on International Day Against Homophobia, Biphobia and Transphobia (IDAHOT) on Saturday ( 17 May), the mo…",
    "link": "https://www.thepinknews.com/2025/05/19/lgbtq-memorial-holocaust-paris-france/",
    "timestamp": "2025-05-19T13:48:15Z"
  },
  {
    "title": "Trump Dumps Netanyahu",
    "description": "Netanyahu long viewed Donald Trump as the US president of his dreams, who would eliminate any daylight remaining between Israel and the United States, thereby strengthening Netanyahu’s hold on power. But, from Iran to the Gulf, Trump is giving Israel a rude a…",
    "link": "https://www.project-syndicate.org/commentary/trump-middle-east-vision-demonstrates-a-split-from-netanyahu-by-shlomo-ben-ami-2025-05",
    "timestamp": "2025-05-19T13:45:59Z"
  },
  {
    "title": "FBI Director Kash Patel and Deputy Dan Bongino Face MASSIVE Patriot Backlash After Claiming “Epstein DID Kill Himself” and Downplaying the Trump Butler Assassination Plot (VIDEO)",
    "description": "The newly appointed FBI leadership under Director Kash Patel and Deputy Director Dan Bongino has ignited a firestorm across conservative circles after publicly backing the official narrative that Jeffrey Epstein died by suicide — AND brushing off explosive co…",
    "link": "https://www.thegatewaypundit.com/2025/05/fbi-director-kash-patel-deputy-dan-bongino-face/",
    "timestamp": "2025-05-19T13:45:42Z"
  },
  {
    "title": "Joe Biden thanks supporters for 'love' after cancer diagnosis",
    "description": "WASHINGTON - Joe Biden expressed his gratitude to Americans on Monday for their \"love and support\" after the former US president said he had been diagnosed with prostate cancer.",
    "link": "https://www.bangkokpost.com/world/3029396/joe-biden-thanks-supporters-for-love-after-cancer-diagnosis",
    "timestamp": "2025-05-19T13:45:00Z"
  },
  {
    "title": "Hillary Clinton bashes Republican women, says GOP female president would be 'handmaiden to the patriarchy'",
    "description": "Hillary Clinton took a swipe at female Republican Party leaders, calling on the future first female President of the United States to not be a \"handmaiden to the patriarchy.\"",
    "link": "https://www.foxnews.com/media/hillary-clinton-bashes-republican-women-says-gop-female-president-would-handmaiden-patriarchy",
    "timestamp": "2025-05-19T13:44:40Z"
  },
  {
    "title": "Trump tells Hamas he wants all hostages released",
    "description": "President Donald Trump told Hamas that he wants all hostages released, and the Trump administration is in cont",
    "link": "https://www.jpost.com/breaking-news/article-854591",
    "timestamp": "2025-05-19T13:43:57Z"
  },
  {
    "title": "Stocks, Bonds And The Dollar Fall After Moody's Downgrades U.S. Credit Rating",
    "description": "Global markets, U.S. futures and the dollar all retreated early Monday after Moody’s Ratings downgraded the sovereign credit rating for the United States.",
    "link": "https://www.huffpost.com/entry/financial-market-fallout-moodys-us-credit-rating-downgrade_n_682b346be4b087727d311721",
    "timestamp": "2025-05-19T13:42:55Z"
  },
  {
    "title": "Wes Anderson Questions Logic Behind Trump’s Movie Tariffs: ‘It Doesn’t Ship That Way’",
    "description": "\"Can you hold up the movie in customs?\" the director asked at Cannes Film Festival, wondering about how the president's would impose his supposed 100 percent tariffs on movies made outside of the U.S.",
    "link": "http://www.rollingstone.com/music/music-news/wes-anderson-donald-trump-movie-tariffs-cannes-1235342390/",
    "timestamp": "2025-05-19T13:41:10Z"
  },
  {
    "title": "Stocks slide after Moody's downgrades US debt",
    "description": "Credit downgrade hiked Treasury yields, triggering concern about interest rates.",
    "link": "https://abcnews.go.com/Business/stocks-slide-after-moodys-downgrades-us-debt/story?id=121944086",
    "timestamp": "2025-05-19T13:40:34Z"
  },
  {
    "title": "Trump Makes First Public Comments on Biden's Cancer, Proving He Is Spectacular Class Act",
    "description": "President Donald Trump respofnded to the news that former President Joe Biden has an aggressive form of prostate cancer",
    "link": "https://www.westernjournal.com/trump-makes-first-public-comments-bidens-cancer-proving-spectacular-class-act/",
    "timestamp": "2025-05-19T13:39:58Z"
  },
  {
    "title": "Donald Trump Jr Questions How Dr Jill Biden Missed Her Husband's Cancer. Her Degree is in Education, Not Medicine",
    "description": "Donald Trump Jr. falsely implied Jill Biden should have been able to detect her husband's cancer, despite her doctorate degree being in education, not medicine.",
    "link": "https://www.ibtimes.com/donald-trump-jr-questions-how-dr-jill-biden-missed-her-husbands-cancer-her-degree-education-3773968",
    "timestamp": "2025-05-19T13:39:08Z"
  },
  {
    "title": "Morning Joe Awkwardly Ignores Mike Allen’s Deep Dive Into Biden Decline Story",
    "description": "Something unique happened on the set of Morning Joe Monday morning—a deep-dive report focused on former President Joe Biden's alleged cognitive decline.\nThe post Morning Joe Awkwardly Ignores Mike Allen’s Deep Dive Into Biden Decline Story first appeared on M…",
    "link": "https://www.mediaite.com/tv/morning-joe-awkwardly-ignores-mike-allens-deep-dive-into-biden-decline-story/",
    "timestamp": "2025-05-19T13:37:32Z"
  },
  {
    "title": "Supreme Court turns blind eye to 'crazy' Trump idea because justices devised it: report",
    "description": "President Donald Trump has the Supreme Court to thank for his ability to accept a $400 million luxury jet from the government of Qatar at the same time he's inking diplomatic and business agreements in the Middle East, legal analyst Leah Litman wrote for Salo…",
    "link": "https://www.rawstory.com/supreme-court-corruption/",
    "timestamp": "2025-05-19T13:35:24Z"
  },
  {
    "title": "Why the latest downgrade of the U.S. credit rating is an embarrassment for Republicans",
    "description": "In 2011, Republicans were responsible for a U.S. credit rating downgrade. In 2023, it happened again. And in 2025, the GOP is again to blame.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/latest-downgrade-us-credit-rating-embarrassment-republicans-rcna207652",
    "timestamp": "2025-05-19T13:35:15Z"
  },
  {
    "title": "Donald Trump's Qatari gift jet may require a military escort wherever it goes and may not be allowed to fly abroad; here are the reasons",
    "description": "Qatar gave Donald Trump a Boeing 747-8, but it’s not safe like Air Force One. Experts say it needs big upgrades, and using it early could be risky or need military protection.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-qatari-gift-jet-may-require-a-military-escort-wherever-it-goes-and-may-not-be-allowed-to-fly-abroad-here-are-the-reasons/articleshow/121271300.cms",
    "timestamp": "2025-05-19T13:35:06Z"
  },
  {
    "title": "John Oliver Urges ABC to Keep Doctor Odyssey, Mocks ‘Premise-Defying’ Season 8 Renewal for The Rookie",
    "description": "John Oliver will not sit idly by and watch ABC sink Doctor Odyssey. During Sunday’s installment of Last Week Tonight, the late-night host railed against the aforementioned broadcast network for dragging its feet on a Season 2 renewal for Ryan Murphy’s seafari…",
    "link": "https://tvline.com/news/doctor-odyssey-renewed-cancelled-season-2-john-oliver-video-1235451381/",
    "timestamp": "2025-05-19T13:35:00Z"
  },
  {
    "title": "Trump Calls for ‘Major Investigation’ Into Kamala Endorsements From Springsteen, Beyoncé After The Boss Bashes President",
    "description": "Springsteen said last week that America is \"currently in the hands of a corrupt, incompetent, and treasonous administration”\nThe post Trump Calls for ‘Major Investigation’ Into Kamala Endorsements From Springsteen, Beyoncé After The Boss Bashes President appe…",
    "link": "https://www.thewrap.com/donald-trump-bruce-springsteen-beyonce-kamala-endorsements/",
    "timestamp": "2025-05-19T13:32:56Z"
  },
  {
    "title": "WH: Trump to call Zelensky after Putin",
    "description": "White House Press Secretary Karoline Leavitt said on Monday that United States President Donald Trump will call Ukrainian President Volodymyr Zelensky after speaking with Russian President Vladimir Pu...",
    "link": "https://biztoc.com/x/dcac4214e8168b81",
    "timestamp": "2025-05-19T13:31:08Z"
  },
  {
    "title": "Breaking: Explosive FBI Warning—CCP, Iran, and Mex-Cartels Partnering in Canada to Move Fentanyl and Terrorists Into U.S.",
    "description": "Patel’s warning echoes The Bureau’s exclusive reporting on a criminal convergence linking CCP-backed chemical suppliers, Iranian proxies, and Mexican cartels operating through Vancouver superlabs. WASHINGTON — In an explosive Sunday interview that will place …",
    "link": "https://freerepublic.com/focus/f-chat/4317846/posts",
    "timestamp": "2025-05-19T13:31:01Z"
  },
  {
    "title": "US Migrant Reality Show Would Not Be Like 'Hunger Games,' Producer Says",
    "description": "Producer Rob Worsoff told NewsNation that the intention is not to create a situation resembling the \"Hunger Games for migrants.\"",
    "link": "https://www.newsweek.com/migrant-reality-show-hunger-games-rob-worsoff-2074007",
    "timestamp": "2025-05-19T13:27:49Z"
  },
  {
    "title": "‘I Hated It’: Bill Maher Says SNL Sketch Depicting MAGA Racism Was ‘A Lie’",
    "description": "Bill Maher criticized \"Saturday Night Live\" during his podcast Sunday for its February sketch featuring actor Tom Hanks depicting a racist MAGA supporter.",
    "link": "https://dailycaller.com/2025/05/19/bill-maher-torches-snl-over-sketch-portraying-trump-supporters-racist/",
    "timestamp": "2025-05-19T13:26:52Z"
  },
  {
    "title": "Reports say Jamie Dimon's time as JPMorgan CEO is winding down; investors say, \"Don't go\"",
    "description": "Jamie Dimon, JPMorgan Chase's CEO, is reportedly considering stepping down, though some investors are reluctant to see him leave. His influence is at its peak, particularly within the Trump administration. While potential successors like Marianne Lake are bei…",
    "link": "https://economictimes.indiatimes.com/news/international/us/reports-say-jamie-dimons-time-as-jpmorgan-ceo-is-winding-down-investors-say-dont-go/articleshow/121269805.cms",
    "timestamp": "2025-05-19T13:26:45Z"
  },
  {
    "title": "Israel’s Netanyahu says allies pressed him to resume some aid to Gaza. So far, nothing has gone in",
    "description": "Netanyahu said that Israel’s allies had voiced concern about “images of hunger.”",
    "link": "https://www.bostonherald.com/2025/05/19/netanyahu-gaza-aid-pressure/",
    "timestamp": "2025-05-19T13:26:10Z"
  },
  {
    "title": "China-US trade truce prompts nations to consider tougher tactics",
    "description": "China's defiant stance in negotiating a tariff truce with the US has convinced some countries they need to take a tougher position in their own trade talks with the Trump administration. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/19/china-us-trade-truce-prompts-nations-to-consider-tougher-tactics",
    "timestamp": "2025-05-19T13:26:00Z"
  },
  {
    "title": "Snoop Dogg Breaks Silence On Trump Inaugural Ball Backlash",
    "description": "The rap star had a message for the \"motherf**kers\" trying \"to cancel me.\"",
    "link": "https://www.huffpost.com/entry/snoop-dogg-donald-trump-crypto-controversy_n_682b1925e4b087727d310ec8",
    "timestamp": "2025-05-19T13:23:31Z"
  },
  {
    "title": "US reiterates ‘red line’ in Iran nuclear talks",
    "description": "Severe limits on uranium enrichment by Tehran are non-negotiable, Washington’s envoy Steve Witkoff has insisted Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617839-us-red-line-iran-nuclear/",
    "timestamp": "2025-05-19T13:23:25Z"
  },
  {
    "title": "Trump to call Putin in a bid to end Russia's 'bloodbath' war with Ukraine",
    "description": "President Donald Trump will call Russian President Vladimir Putin on Monday in a renewed bid to negotiate a ceasefire after talks between Russian and Ukrainian officials over the weekend in Turkey.",
    "link": "https://www.foxnews.com/politics/trump-call-putin-bid-end-russias-bloodbath-war-ukraine",
    "timestamp": "2025-05-19T13:20:45Z"
  },
  {
    "title": "Trump Owns More Than $500k of Apple Stock: How Much Should You Own if You’re Middle Class?",
    "description": "According to Forbes, President Donald Trump has roughly doubled his net worth to about $5 billion over the past year, helped by a legion of followers who have pushed up the value of his crypto offerings and “money-losing” social media platform.\nRead Next: How…",
    "link": "https://biztoc.com/x/86d7321b1032475f",
    "timestamp": "2025-05-19T13:20:14Z"
  },
  {
    "title": "Japan passed a law allowing preemptive offensive cyber actions",
    "description": "Japan passed a law allowing preemptive offensive cyber actions, shifting from its pacifist stance to bolster defenses like major Western powers. Japan has enacted the Active Cyberdefense Law, allowing preemptive offensive cyber operations to counter threats b…",
    "link": "https://securityaffairs.com/178056/laws-and-regulations/japan-passed-a-law-allowing-preemptive-offensive-cyber-actions.html",
    "timestamp": "2025-05-19T13:20:05Z"
  },
  {
    "title": "Trump Attacks South Africa 'White Genocide' Before Ramaphosa Visit",
    "description": "US President Donald Trump for the second time in a week accused South Africa of perpetrating a genocide against White people — without any proof — just days before he is set to receive the country’s leader, Cyril Ramaphosa, in the White House.\n“We treat peopl…",
    "link": "https://biztoc.com/x/b11b9620580d35cb",
    "timestamp": "2025-05-19T13:19:50Z"
  },
  {
    "title": "African islands under threat: what to do about Trump’s withdrawal from climate change agreement",
    "description": "Pacific Island states have united, declaring climate change the single greatest threat to their security. African island states can adopt a similar approach.",
    "link": "https://theconversation.com/african-islands-under-threat-what-to-do-about-trumps-withdrawal-from-climate-change-agreement-256052",
    "timestamp": "2025-05-19T13:19:20Z"
  },
  {
    "title": "Is Israel finally feeling the heat on Gaza?",
    "description": "Benjamin Netanyahu allows aid to resume amid mounting international pressure and 'growing internal turmoil'",
    "link": "https://theweek.com/defence/is-israel-finally-feeling-the-heat-on-gaza",
    "timestamp": "2025-05-19T13:18:35Z"
  },
  {
    "title": "Peaceful solutions preferred for Ukraine conflict goals – Kremlin",
    "description": "Kremlin spokesman Dmitry Peskov reaffirmed Russia’s preference for diplomacy over military action in the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617832-kremlin-trump-call-peaceful/",
    "timestamp": "2025-05-19T13:16:26Z"
  },
  {
    "title": "UK, EU agree on several deals at London summit",
    "description": "The EU and UK are working towards a level of cooperation not seen since Brexit, with new agreements on fisheries, trade and security. Deals were agreed as British PM Starmer hosts EU leaders in London. British Prime Minister Keir Starmer is hosting the leader…",
    "link": "https://www.dw.com/en/uk-eu-agree-on-several-deals-at-london-summit/a-72592342",
    "timestamp": "2025-05-19T13:16:00Z"
  },
  {
    "title": "Trump's secret belief would leave true Republicans aghast",
    "description": "The Republicans have been using the term “communist” or “Marxist” to describe their opponents for as long as I can remember. Since at least the time of Ronald Reagan, they have accused liberals of using the power of the state to infringe individual rights and…",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-economy/",
    "timestamp": "2025-05-19T13:14:12Z"
  },
  {
    "title": "John Oliver Scorches Trump’s ‘Threats to the Free Press’ in Fiery 28-Minute Rant",
    "description": "HBO's John Oliver devoted nearly his entire show Sunday to what he termed \"threats to the free press\" by President Donald Trump and his allies.\nThe post John Oliver Scorches Trump’s ‘Threats to the Free Press’ in Fiery 28-Minute Rant first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/john-oliver-scorches-trumps-threats-to-the-free-press-in-fiery-28-minute-rant/",
    "timestamp": "2025-05-19T13:13:11Z"
  },
  {
    "title": "Ukraine updates: Trump holds phone call with Putin",
    "description": "The White House said Trump's goal was \"to see a ceasefire,\" but the Kremlin separately warned that \"painstaking\" work lies ahead. DW has more. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-updates-trump-holds-phone-call-with-putin/live-72586772",
    "timestamp": "2025-05-19T13:11:00Z"
  },
  {
    "title": "Ukraine: Trump says ceasefire talks to start 'immediately'",
    "description": "The White House said Trump's goal was \"to see a ceasefire,\" but the Kremlin separately warned that \"painstaking\" work lies ahead. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-trump-says-ceasefire-talks-to-start-immediately/live-72586772",
    "timestamp": "2025-05-19T13:11:00Z"
  },
  {
    "title": "Joe Biden shares first message and photo since announcing prostate cancer diagnosis",
    "description": "Following his cancer diagnosis announcement, Joe Biden thanked supporters and well wishers. He was diagnosed with prostate cancer three days prior and is reviewing treatment options.",
    "link": "https://www.today.com/health/news/joe-biden-breaks-silence-prostate-cancer-rcna207637",
    "timestamp": "2025-05-19T13:10:59Z"
  },
  {
    "title": "A Russia-NATO War Would Look Nothing Like Ukraine",
    "description": "Moscow will seek to avoid a full-on war and focus on breaking the bloc’s resolve.",
    "link": "http://foreignpolicy.com/2025/05/19/russia-nato-war-putin-ukraine-nuclear-strategy-baltics/",
    "timestamp": "2025-05-19T13:10:56Z"
  },
  {
    "title": "Musk brought 'world's biggest supercomputer' to Memphis. Residents choking on its pollution...",
    "description": "xAI has moved into an abandoned factory promising jobs and investment. Residents and environmental groups say the new facility is bringing yet more pollution to community that’s long been fighting for clean air",
    "link": "https://www.cnn.com/2025/05/19/climate/xai-musk-memphis-turbines-pollution",
    "timestamp": "2025-05-19T13:10:37Z"
  },
  {
    "title": "Selected Articles: Are Al Qaeda “Freedom Fighters” “Good Guys” or “Bad Guys”? “Yes. The CIA Entered Afghanistan Before the Russians.”",
    "description": "Are Al Qaeda “Freedom Fighters” “Good Guys” or “Bad Guys”? “Yes. The CIA Entered Afghanistan Before the Russians.” Zbigniew Brzezinski\nBy Dr. Zbigniew Brzezinski, Prof Michel Chossudovsky, and Le Nouvel Observateur, May 18, 2025\nAccording to this …\nThe post S…",
    "link": "https://www.globalresearch.ca/selected-articles-al-qaeda-freedom-fighters-cia-entered-afghanistan-before-russians/5887563",
    "timestamp": "2025-05-19T13:10:35Z"
  },
  {
    "title": "Ice cream and thousands of foods with emulsifiers may upset your gut health | CNN",
    "description": "Studies have found that emulsifiers can alter the mix of bacteria in the gut, known as the microbiome or microbiota; damage the lining of the gastrointestinal tract; and trigger inflammation, potentially contributing to problems elsewhere in the body.",
    "link": "https://www.cnn.com/2025/05/19/health/emulsifiers-gut-kff-health-news-wellness",
    "timestamp": "2025-05-19T13:10:28Z"
  },
  {
    "title": "Trump Calls for Investigation into Springsteen, Other Musicians Who Supported Kamala Harris",
    "description": "The president claims they these musicians made \"major and illegal campaign contributions\" to Harris' campaign. \nTrump Calls for Investigation into Springsteen, Other Musicians Who Supported Kamala Harris\nScoop Harrison",
    "link": "https://consequence.net/2025/05/trump-springsteen-investigation-harris-campaign/",
    "timestamp": "2025-05-19T13:09:07Z"
  },
  {
    "title": "LIVE UPDATES — Trump to speak with Putin in push for a ceasefire deal to end fighting in Ukraine. Follow DW for the latest.",
    "description": "The Kremlin said Russia \"highly valued\" US President Donald Trump's efforts to end the fighting. Meanwhile, long-awaited Abrams tanks are \"on their way\" to Ukraine from Australia. DW rounds up the latest.",
    "link": "https://www.dw.com/en/ukraine-updates-trump-to-hold-phone-call-with-putin/live-72586772",
    "timestamp": "2025-05-19T13:09:00Z"
  },
  {
    "title": "LIVE UPDATES — Trump to speak with Putin in push for a ceasefire deal to end fighting in Ukraine. Follow DW for the latest.",
    "description": "The Kremlin said Russia \"highly valued\" US President Donald Trump's efforts to end the fighting. Meanwhile, long-awaited Abrams tanks are \"on their way\" to Ukraine from Australia. DW rounds up the latest.",
    "link": "https://www.dw.com/en/ukraine-updates-trump-to-hold-phone-call-with-putin/live-72586772",
    "timestamp": "2025-05-19T13:09:00Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing ahead of expected Trump-Putin call",
    "description": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelenskyy will make progress toward a ceasefire in the war in Ukraine.",
    "link": "https://biztoc.com/x/d210f25cc6617916",
    "timestamp": "2025-05-19T13:08:49Z"
  },
  {
    "title": "Romania, Poland, Portugal election results: Who are the winners and losers?",
    "description": "Pro-EU forces prevail on electoral 'super Sunday', but far right gains ground.",
    "link": "https://www.aljazeera.com/news/2025/5/19/romania-poland-portugal-election-results-who-are-the-winners-and-losers",
    "timestamp": "2025-05-19T13:06:42Z"
  },
  {
    "title": "Up’ of Biden’s ‘Aggressive’ Cancer: ‘Inconceivable’ It Was Not Spotted During Presidency",
    "description": "America’s leading experts have been weighing in on the news that former President Joe Biden has been diagnosed with an “aggressive” form of prostate cancer. The news has led to allegations of a “cover-up” due to the cancer’s advanced stage so soon after Biden…",
    "link": "https://freerepublic.com/focus/f-bloggers/4317844/posts",
    "timestamp": "2025-05-19T13:05:16Z"
  },
  {
    "title": "Brics message to ‘ring hollow’ if Pakistan remains ‘blocked by India’: envoy Khalil Hashmi",
    "description": "Pakistan's ambassador in Beijing says China – and Trump – welcome to mediate Kashmir conflict Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/19/brics-message-to-ring-hollow-if-pakistan-remains-blocked-by-india-envoy-khalil-hashmi",
    "timestamp": "2025-05-19T13:05:00Z"
  },
  {
    "title": "Opinion: Trump's Hollywood Tariffs Are A Blow To A Struggling Industry",
    "description": "Cinema has long been a tool of soft power for both the United States and China. However, despite its cultural value, filmmaking remains a business - and an expensive one at that. If profitability is compromised, the industry will inevitably retreat.",
    "link": "https://www.ndtv.com/opinion/trumps-hollywood-tariffs-are-a-blow-to-a-struggling-industry-8454147",
    "timestamp": "2025-05-19T13:04:22Z"
  },
  {
    "title": "Joe Biden thanks supporters for ‘love’ after cancer diagnosis",
    "description": "Joe Biden expressed his gratitude to Americans on Monday for their “love and support” after the former US president said he had been diagnosed with prostate cancer. The weekend announcement that the 82-year-old had been diagnosed with an “aggressive” form of …",
    "link": "https://www.digitaljournal.com/world/joe-biden-thanks-supporters-for-love-after-cancer-diagnosis/article",
    "timestamp": "2025-05-19T13:03:27Z"
  },
  {
    "title": "Joe Biden thanks supporters for ‘love’ after cancer diagnosis",
    "description": "Joe Biden expressed his gratitude to Americans on Monday for their “love and support” after the former US president said he had been diagnosed with prostate cancer. The weekend announcement that the 82-year-old had been diagnosed with an “aggressive” form of …",
    "link": "https://www.digitaljournal.com/news/joe-biden-thanks-supporters-for-love-after-cancer-diagnosis/article",
    "timestamp": "2025-05-19T13:03:27Z"
  },
  {
    "title": "Joe Biden Thanks Supporters For 'Love' After Cancer Diagnosis",
    "description": "Joe Biden expressed his gratitude to Americans on Monday for their \"love and support\" after the former US president said he had been diagnosed with prostate cancer.",
    "link": "https://www.ibtimes.com/joe-biden-thanks-supporters-love-after-cancer-diagnosis-3773965",
    "timestamp": "2025-05-19T13:03:18Z"
  },
  {
    "title": "What is prostate cancer, which Joe Biden has been diagnosed with? What are the treatments, and is it curable?",
    "description": "Joe Biden prostate cancer diagnosis has shocked the nation as the 82-year-old former U.S. President is confirmed to have an aggressive form that has spread to his bones. With a Gleason score of 9, doctors say it’s fast-growing and advanced. This serious stage…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-prostate-cancer-which-joe-biden-has-been-diagnosed-with-what-are-the-treatments-and-is-it-curable/articleshow/121270107.cms",
    "timestamp": "2025-05-19T13:03:04Z"
  },
  {
    "title": "Virginia Gov Candidate’s Claims of Being Moderate Don’t Match the Record",
    "description": "Virginia gubernatorial candidate Abigail Spanberger is busy trying to portray herself as a moderate, but her policy record proves she’s far from that.  With a... Read More\nThe post Virginia Gov Candidate’s Claims of Being Moderate Don’t Match the Record appea…",
    "link": "https://www.dailysignal.com/2025/05/19/virginia-gov-candidates-claims-being-moderate-dont-match-record/",
    "timestamp": "2025-05-19T13:01:00Z"
  },
  {
    "title": "Blue state political battle intensifies after Dem mayor's arrest at ICE facility: 'Outraged'",
    "description": "Newark Mayor Ras Baraka's arrest at Delaney Hall protest highlights New Jersey's political divide on immigration, amid a heated gubernatorial race.",
    "link": "https://www.foxnews.com/politics/blue-state-political-battle-intensifies-after-dem-mayors-arrest-immigration-facility",
    "timestamp": "2025-05-19T13:00:54Z"
  },
  {
    "title": "The 1600: Hard Questions",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-hard-questions-2074096",
    "timestamp": "2025-05-19T13:00:25Z"
  },
  {
    "title": "DHS Slams Tim Walz for Describing ICE as ‘Trump’s Modern-Day Gestapo’",
    "description": "Walz running his mouth again, even calling Stephen Miller an \"aspiring fascist.\"\nThe post DHS Slams Tim Walz for Describing ICE as ‘Trump’s Modern-Day Gestapo’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/dhs-slams-tim-walz-for-describing-ice-as-trumps-modern-day-gestapo/",
    "timestamp": "2025-05-19T13:00:20Z"
  },
  {
    "title": "Cannes’ Message So Far: The World’s Going to Hell, but We Love Movies!",
    "description": "Cannes 2025: The overall tone of this year’s offerings is dark, just as it would be if festival-goers left the theaters, went back to their rooms and switched on the TV news\nThe post Cannes’ Message So Far: The World’s Going to Hell, but We Love Movies! appea…",
    "link": "https://www.thewrap.com/cannes-2025-recap-so-far-kristen-stewart-jennifer-lawrence/",
    "timestamp": "2025-05-19T13:00:00Z"
  },
  {
    "title": "No, Obama didn't get $22.9M from Venezuelan government for apartment atop his presidential library",
    "description": "Former U.S. President Barack Obama received a $22.9 million donation from the Venezuelan government for the construction of an apartment on top of his presidential library.",
    "link": "https://www.snopes.com//fact-check/obama-donation-venezuelan-government/",
    "timestamp": "2025-05-19T13:00:00Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing ahead of expected Trump-Putin call",
    "description": "President Donald Trump is hoping separate phone calls Monday with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelenskyy will make progress toward a ceasefire in the war in Ukraine.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-briefing-ahead-of-expected-trump-putin-call",
    "timestamp": "2025-05-19T12:59:39Z"
  },
  {
    "title": "US health groups vow to fight GOP cuts to Medicaid and Obamacare - NewsBreak",
    "description": "Cuts worth $880bn could leave 13 million Americans without insurance in proposal that has divided Republicans",
    "link": "https://www.newsbreak.com/share/4013943201408-us-health-groups-vow-to-fight-gop-cuts-to-medicaid-and-obamacare?_f=app_share&amp;pd=07xNZQW8&amp;lang=en_US&amp;send_time=1747659492&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.20.0.20%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v7%2Cns_foryou_recall_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v3%2Cns_local_strategy_25q1_exp-v11&amp;s=i2",
    "timestamp": "2025-05-19T12:58:41Z"
  },
  {
    "title": "Trump Preps for Putin Call With Another Meltdown Over Bruce Springsteen",
    "description": "Donald Trump melted down over Bruce Springsteen, Beyonce, Bono, and Oprah, calling for an investigation into their support for Kamala Harris.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-melts-down-bruce-springsteen-investigation-1235342386/",
    "timestamp": "2025-05-19T12:58:29Z"
  },
  {
    "title": "House GOP advances Trump’s ‘one big, beautiful bill’ in late night vote",
    "description": "President Donald Trump's \"one big, beautiful bill\" cleared a critical hurdle Sunday night.",
    "link": "https://dailycaller.com/2025/05/19/one-big-beautiful-bill-clears-hurdle-late-night-vote/",
    "timestamp": "2025-05-19T12:56:51Z"
  },
  {
    "title": "What is Gleason Score? Amid prostate cancer diagnosis, Joe Biden’s hormone-sensitive tumor gives doctors a promising path for targeted treatment",
    "description": "Joe Biden has been diagnosed with a serious type of prostate cancer that has spread to his bones. Doctors are discussing treatment options. This highlights the importance of early checks for prostate cancer in men.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-gleason-score-amid-prostate-cancer-diagnosis-joe-bidens-hormone-sensitive-tumor-gives-doctors-a-promising-path-for-targeted-treatment/articleshow/121270471.cms",
    "timestamp": "2025-05-19T12:56:24Z"
  },
  {
    "title": "Joe Biden thanks supporters with new photo after prostate cancer diagnosis announcement",
    "description": "Former President Joe Biden has thanked his supporters for their thoughts after his office announced that he has prostate cancer that has metastasized to his bones.",
    "link": "https://www.wsbtv.com/news/trending/joe-biden-thanks-supporters-with-new-photo-after-prostate-cancer-diagnosis-announcement/UOJ2GMFNU5EY3GDSDDA7QVLRJY/",
    "timestamp": "2025-05-19T12:56:13Z"
  },
  {
    "title": "Cardello: Nobody In The Biden Administration Should Survive The Tapes",
    "description": "We watched Joe Biden quickly age in prime time. We have all watched family members age, and it is sad, but it is the cycle of life. However, our family members are not being used as props by a political party to maintain power and control over our country. Jo…",
    "link": "https://freerepublic.com/focus/f-bloggers/4317841/posts",
    "timestamp": "2025-05-19T12:55:16Z"
  },
  {
    "title": "Attack of the Sadistic Zombies (Paul Krugman)",
    "description": "Paul Krugman:\nAttack of the Sadistic Zombies  —  The GOP budget is incredibly cruel — and that's the point  —  Republicans in Congress, taking their marching orders from Donald Trump, are on track to enact a hugely regressive budget — big tax giveaways to the…",
    "link": "https://www.memeorandum.com/250519/p24",
    "timestamp": "2025-05-19T12:55:00Z"
  },
  {
    "title": "Organizers Planning a ‘Nationwide’ Protest for Trump’s Birthday",
    "description": "Agitators are planning a not-too-surprising birthday gift for President Donald Trump on his 79th birthday — yet another anti-Trump demonstration. Organizers say they are hoping to upstage a military parade the president has planned for June 14 in Washington, …",
    "link": "https://freerepublic.com/focus/f-news/4317840/posts",
    "timestamp": "2025-05-19T12:54:18Z"
  },
  {
    "title": "Joe Biden 'Has Only 5 Years to Live' As 'Aggressive' Prostate Cancer has Metastasized to Bones — as Democrats Beg Public to 'Mute' Raging Cognitive Criticism",
    "description": "Joe Biden has been given just \"five years to live\" after his “aggressive” prostate cancer ripped through his body.",
    "link": "https://radaronline.com/p/joe-biden-feared-to-have-only-5-years-to-live-aggressive-prostate-cancer/",
    "timestamp": "2025-05-19T12:53:48Z"
  },
  {
    "title": "Israel’s Gaza aid reversal: Tactical shift or strategic confusion?",
    "description": "This leads Israel to continually lurch from crisis to crisis and be surprised at the fact that a friendly administration in the US will not accept a hunger crisis in Gaza.",
    "link": "https://www.jpost.com/israel-news/article-854580",
    "timestamp": "2025-05-19T12:52:10Z"
  },
  {
    "title": "Donald Trump Says He Plans To Call For Investigation Of Kamala Harris’ Endorsements From Bruce Springsteen, Beyoncé And Other Celebrities",
    "description": "Bruce Springsteen’s criticisms of Donald Trump last week appear to have triggered the president even further, as he is now calling for an investigation of...",
    "link": "https://deadline.com/2025/05/trump-springsteen-endorsement-investigation-1236404148/",
    "timestamp": "2025-05-19T12:51:28Z"
  },
  {
    "title": "Donald Trump Says He Plans To Call For Investigation Of Kamala Harris’ Endorsements From Bruce Springsteen, Beyoncé And Other Celebrities",
    "description": "Bruce Springsteen’s criticisms of Donald Trump last week appear to have triggered the president even further, as he is now calling for an investigation of the superstar singer’s endorsement of Kamala Harris, as well as other entertainers. Trump wrote on Truth…",
    "link": "http://deadline.com/2025/05/trump-springsteen-endorsement-investigation-1236404148/",
    "timestamp": "2025-05-19T12:51:28Z"
  },
  {
    "title": "Trump's 'big, beautiful bill' wins support from police for overtime tax elimination",
    "description": "Police rally behind President Donald Trump's plan to end overtime taxes, citing benefits for law enforcement families and retention, as Republicans work to push the budget bill forward.",
    "link": "https://www.foxnews.com/politics/trumps-big-beautiful-bill-wins-support-from-police-overtime-tax-elimination",
    "timestamp": "2025-05-19T12:50:52Z"
  },
  {
    "title": "Pakistan Inked Deal With Crypto Company In Which Trump Kin Has 60% Stake",
    "description": "NEW DELHI: US President Donald Trump’s attempt to be a broker in the conflict between India and Pakistan has the spotlight on a deal the hostile neighbour recently negotiated with World Liberty Financial (WLF), a cryptocurrency venture in which the president’…",
    "link": "https://freerepublic.com/focus/f-news/4317837/posts",
    "timestamp": "2025-05-19T12:49:29Z"
  },
  {
    "title": "An Incredibly Cruel Budget",
    "description": "Paul Krugman: \"Republicans in Congress, taking their marching orders from Donald Trump, are on track to enact a hugely regressive budget — big tax giveaways to the wealthy combined with cruel cuts in programs that",
    "link": "https://politicalwire.com/2025/05/19/an-incredibly-cruel-budget/",
    "timestamp": "2025-05-19T12:47:55Z"
  },
  {
    "title": "By trying to bully Walmart, Trump gives away the game on his tariffs agenda",
    "description": "If Donald Trump were right about foreign countries paying tariffs, why is he demanding that Walmart “eat the tariffs”? Because he's wrong about the basics.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trying-bully-walmart-trump-gives-away-game-tariffs-agenda-rcna207634",
    "timestamp": "2025-05-19T12:46:11Z"
  },
  {
    "title": "Critics say Trump's religion agenda will benefit conservative Christians the most (Peter Smith/Associated Press)",
    "description": "Peter Smith / Associated Press:\nCritics say Trump's religion agenda will benefit conservative Christians the most  —  White House Faith Office.  A Task Force to Eradicate Anti-Christian Bias.  A Religious Liberty Commission.  —  President Donald Trump has won…",
    "link": "https://www.memeorandum.com/250519/p20",
    "timestamp": "2025-05-19T12:45:00Z"
  },
  {
    "title": "US Economy to Lose $12.5B in Tourism Spending in 2025, Report Warns",
    "description": "The economy could lose billions as strict entry requirements and travel advisories take their toll on \"international traveler confidence.\"",
    "link": "https://www.newsweek.com/us-tourism-spending-declines-report-travel-advisories-2073999",
    "timestamp": "2025-05-19T12:44:39Z"
  },
  {
    "title": "Cutting HIV aid means undercutting US foreign and economic interests − Nigeria shows the human costs",
    "description": "Withdrawing or reducing aid has immediate and often fatal effects − not only for the countries receiving aid but for people around the globe.",
    "link": "https://theconversation.com/cutting-hiv-aid-means-undercutting-us-foreign-and-economic-interests-nigeria-shows-the-human-costs-253705",
    "timestamp": "2025-05-19T12:44:15Z"
  },
  {
    "title": "Military and economic deals in pipeline as UK looks to EU reset",
    "description": "London and Brussels to remove selected post-Brexit barriers as Trump's global disruptions drive return to closer ties.",
    "link": "https://www.aljazeera.com/news/2025/5/19/military-and-economic-deals-in-pipeline-as-uk-looks-to-eu-reset",
    "timestamp": "2025-05-19T12:43:55Z"
  },
  {
    "title": "Trump’s lifting of Syria sanctions is a win for Turkey, too – pointing to outsized role middle powers can play in regional affairs",
    "description": "Ankara sees the fall of the Assad regime and the rise of new Syrian leader Ahmad al-Sharaa as a generational opportunity for domestic and regional goals.",
    "link": "https://theconversation.com/trumps-lifting-of-syria-sanctions-is-a-win-for-turkey-too-pointing-to-outsized-role-middle-powers-can-play-in-regional-affairs-254162",
    "timestamp": "2025-05-19T12:43:47Z"
  },
  {
    "title": "Tomato trade dispute between the US and Mexico is boiling over again – with 21% tariffs due in July",
    "description": "Tomatoes are at the heart of a long-brewing controversy, driven by increasing imports and decreasing domestic production.",
    "link": "https://theconversation.com/tomato-trade-dispute-between-the-us-and-mexico-is-boiling-over-again-with-21-tariffs-due-in-july-255813",
    "timestamp": "2025-05-19T12:43:19Z"
  },
  {
    "title": "Vance Skips Visit to Israel to Avoid Encouraging New IDF Operation in Gaza - Reports",
    "description": "WASHINGTON (Sputnik) - US Vice President JD Vance has decided against his trip to Israel over the weekend amid the new offensive in the Gaza Strip, media reported on Monday, citing US officials.",
    "link": "https://sputnikglobe.com/20250519/vance-skips-visit-to-israel-to-avoid-encouraging-new-idf-operation-in-gaza---reports-1122083880.html",
    "timestamp": "2025-05-19T12:37:39Z"
  },
  {
    "title": "Attack of the Sadistic Zombies – Paul Krugman",
    "description": "The GOP budget is incredibly cruel — and that’s the point",
    "link": "https://paulkrugman.substack.com/p/attack-of-the-sadistic-zombies",
    "timestamp": "2025-05-19T12:36:38Z"
  },
  {
    "title": "Trump To Call Putin In Push For Ukraine Ceasefire",
    "description": "Donald Trump will speak by phone Monday with Russia's Vladimir Putin as part of the US leader's effort to end the grinding war set off by Moscow's 2022 invasion of Ukraine.",
    "link": "https://www.ibtimes.com.au/trump-call-putin-push-ukraine-ceasefire-1858957",
    "timestamp": "2025-05-19T12:36:11Z"
  },
  {
    "title": "Trump Wants To Lower Interest Rates: 4 Ways That Could Benefit Retirees",
    "description": "President Donald Trump has long been pushing for lower U.S. interest rates, exerting pressure on the Federal Reserve — despite the fact that the central bank is not controlled by the president. If Trump gets his way, however, there could be ripple effects acr…",
    "link": "https://biztoc.com/x/97ebefaec278f2fb",
    "timestamp": "2025-05-19T12:35:28Z"
  },
  {
    "title": "Trump Calls for 'Major Investigation' into Whether Kamala Harris Paid for Endorsements from Beyonce, Springsteen, Oprah",
    "description": "Did Kamala Harris pay members of the entertainment elites for endorsements during her dismal 2024 election campaign? Her vanquisher President Donald Trump would like to find out.\nThe post Trump Calls for ‘Major Investigation’ into Whether Kamala Harris Paid f…",
    "link": "https://www.breitbart.com/entertainment/2025/05/19/trump-calls-for-major-investigation-into-whether-kamala-harris-paid-for-endorsements-from-beyonce-springsteen-oprah/",
    "timestamp": "2025-05-19T12:35:02Z"
  }
]