[
  {
    "title": "Iran Promises Harsh Response After Trump Says Nuclear Sites Damaged",
    "description": "11 min ago\nIran Promises Harsh Response After Trump Says Nuclear Sites Damaged\nIran's armed forces threatened the U.S. with a decisive and harsh response to the strikes that President Donald Trump said \"obliterated\" the country's nuclear sites.\nPresident Dona…",
    "link": "https://biztoc.com/x/a13a7f8366ae7e76",
    "timestamp": "2025-06-23T09:38:17Z"
  },
  {
    "title": "OPINION: Why are people in London marching for the Ayatollah?",
    "description": "Iran blinds women, hangs gays and plots Israel’s destruction, yet some British people cheer it on. How did moral blindness and anti-Western zealotry create this alliance of the absurd?",
    "link": "https://www.jewishnews.co.uk/opinion-why-are-people-in-london-marching-for-the-ayatollah/",
    "timestamp": "2025-06-23T09:38:11Z"
  },
  {
    "title": "Iran issues stark warning to Trump 'the gambler' as Israel keeps up attacks",
    "description": "TEHRAN: Tehran threatened on Monday (Jun 23) to inflict \"serious\" damage in retaliation for US strikes on the Islamic republic's nuclear facilities, as the Iran-Israel war entered its 11th day despite c",
    "link": "https://www.channelnewsasia.com/world/us-iran-attack-warning-trump-5197961",
    "timestamp": "2025-06-23T09:37:02Z"
  },
  {
    "title": "Oil Market on Edge Waiting for What Iran Will Do",
    "description": "The oil market looks relaxed, but it is still on edge waiting for what Iran will do, SEB Chief Commodities Analyst Bjarne Schieldrop said.",
    "link": "https://www.rigzone.com/news/oil_market_on_edge_waiting_for_what_iran_will_do-23-jun-2025-180911-article/",
    "timestamp": "2025-06-23T09:36:23Z"
  },
  {
    "title": "Marjorie Taylor Greene Rages Against Trump Iran Strike With Chilling Warning",
    "description": "And \"we weren’t even thinking about any of this a week ago,\" railed the far-right Georgia lawmaker.",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-iran-strike_n_68590d1ce4b0d509390c4836",
    "timestamp": "2025-06-23T09:35:55Z"
  },
  {
    "title": "Senate Readies Tax Bill for Vote With Holdouts Threatening Delay",
    "description": "President Donald Trump’s tax-and-spending agenda is nearing a climatic vote in the Senate this week in the wake of air strikes on Iran, which risk embroiling the US in a prolonged Middle East conflict.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-readies-tax-bill-for-vote-with-holdouts-threatening-delay",
    "timestamp": "2025-06-23T09:35:41Z"
  },
  {
    "title": "Iran’s Underground Enrichment Site At Fordo Is Attacked Again, Iranian State TV Says",
    "description": "There was no immediate word on damage nor who launched the attack, though Israel said earlier it was conducting airstrikes on Iran.",
    "link": "https://www.huffpost.com/entry/iran-israel-conflict_n_68591e09e4b0c9a27d0088ab",
    "timestamp": "2025-06-23T09:35:14Z"
  },
  {
    "title": "Iran vows response to US strikes as it hits back at Israel",
    "description": "Tehran is weighing its military options as it follows up internationally on the US and Israeli strikes.",
    "link": "https://www.aljazeera.com/news/2025/6/23/iran-vows-response-to-us-strikes-as-it-hits-back-at-israel",
    "timestamp": "2025-06-23T09:34:04Z"
  },
  {
    "title": "Iran stands alone against Trump and Israel, stripped of allies",
    "description": "Iran faces isolation as US and Israel intensify actions. Traditional allies like Russia and China offer limited support. Militia groups are hesitant to assist Iran. The geopolitical landscape of the Middle East is undergoing a significant shift. Donald Trump'…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/iran-stands-alone-against-trump-and-israel-stripped-of-allies/articleshow/122022024.cms",
    "timestamp": "2025-06-23T09:33:03Z"
  },
  {
    "title": "Iran Vows to “End This War”",
    "description": "Iran on Monday vowed to retaliate against the U.S. strikes on Iranian nuclear facilities, claiming the U.S. attacks expand the scope for the Iranian military to respond. “Mr Trump, the gambler, you may start this war, but we will be the ones to end it,” Ebrah…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Vows-to-End-This-War.html",
    "timestamp": "2025-06-23T09:31:23Z"
  },
  {
    "title": "Bitcoin Week Ahead: Focus on Powell's Testimony, U.S. Core PCE as Tariff Deadline Looms",
    "description": "Friday's core PCE release is likely to show easing of price pressures, but there is a fix.",
    "link": "https://www.coindesk.com/markets/2025/06/23/focus-on-powell-s-testimony-u-s-core-pce-release-as-trump-s-tariff-deadline-looms",
    "timestamp": "2025-06-23T09:28:45Z"
  },
  {
    "title": "Johnny Depp Anoints Himself 'Crash Test Dummy for #MeToo'",
    "description": "\"It was before Harvey Weinstein. And I sponged it, took it all in,\" Depp told The Times U.K. about his purported cancellation following the trial from hell.",
    "link": "https://www.jezebel.com/johnny-depp-anoints-himself-crash-test-dummy-for-metoo",
    "timestamp": "2025-06-23T09:27:05Z"
  },
  {
    "title": "'Trump's gamble risks all-out war': Irish and global newspapers react to the US bombing Iran",
    "description": "Trump’s involvement in the Israel-Iran war is dominating most of the front pages this morning.",
    "link": "https://www.thejournal.ie/front-pages-us-bombing-iran-donald-trump-6740625-Jun2025/",
    "timestamp": "2025-06-23T09:25:57Z"
  },
  {
    "title": "After taking $60 billion from China, Pakistan offers critical mineral assets in Balochistan to US during Asim Munir–Trump meet",
    "description": "General Asim Munir's meeting with Donald Trump explored potential US access to Balochistan's mineral wealth, challenging China's dominance in the region. Discussions included trade, AI, and energy, signaling a broader strategic partnership. This move aligns w…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/after-taking-60-billion-from-china-pakistan-offers-critical-mineral-assets-in-balochistan-to-us-during-asim-munirtrump-meet/articleshow/122021836.cms",
    "timestamp": "2025-06-23T09:22:00Z"
  },
  {
    "title": "Ethereum whales open $100M of leveraged bets after US strikes Iran",
    "description": "Whales are betting hundreds of millions on Ether’s price recovery despite the industry’s most successful traders being net short amid escalating conflict in the Middle East.",
    "link": "https://cointelegraph.com/news/ether-whales-100m-leveraged-bets-after-us-airstrike-on-iran",
    "timestamp": "2025-06-23T09:18:30Z"
  },
  {
    "title": "'Desperate for American approval': Pakistan in tight spot for Trump Nobel nomination as US shifts from 'peacemaker' to aggressor",
    "description": "Pakistan's government faces intense criticism after nominating Donald Trump for the Nobel Peace Prize, coinciding with US airstrikes on Iranian nuclear sites. Islamabad strongly condemned the attacks, calling them a violation of international law.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/desperate-for-american-approval-pakistan-in-tight-spot-for-trump-nobel-nomination-as-us-shifts-from-peacemaker-to-aggressor/articleshow/122020464.cms",
    "timestamp": "2025-06-23T09:18:10Z"
  },
  {
    "title": "Spain wins exemption from NATO’s 5% defense spending goal",
    "description": "Spain obtained an exemption from NATO’s ambitious defense spending target of 5% of GDP after several days of diplomatic wrangling that drew scorn from Donald Trump, right before leaders of the military alliance gather on Tuesday.\n“We fully respect the legitim…",
    "link": "https://biztoc.com/x/b08196bef828c9e2",
    "timestamp": "2025-06-23T09:16:38Z"
  },
  {
    "title": "Donald Trump Touts 'Obliteration' of Iran Sites Seen in Satellite Images",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said \"monumental damage\" was done to Iran's nuclear sites citing satellite imagery after Tehran disputed whether the strikes on the facilities had dealt a knockout blow to the Islamic Re…",
    "link": "https://biztoc.com/x/040b15ccfabac0cc",
    "timestamp": "2025-06-23T09:16:28Z"
  },
  {
    "title": "Germany's Merz says Europe must end US defense 'free-ride'",
    "description": "The chancellor says, \"Europeans must become stronger on our own\" as Germany invests record sums in defense and infrastructure. Follow DW for more.",
    "link": "https://www.dw.com/en/germanys-merz-says-europe-must-end-us-defense-free-ride/live-73003399",
    "timestamp": "2025-06-23T09:16:00Z"
  },
  {
    "title": "Photos show huge damage to Iran’s nuclear facilities after US bomb strikes",
    "description": "Photos show huge damage to Iran’s nuclear facilities after US bomb strikes7news.com.au",
    "link": "https://7news.com.au/news/photos-show-huge-damage-to-irans-nuclear-facilities-after-us-bomb-strikes-c-19123504",
    "timestamp": "2025-06-23T09:13:05Z"
  },
  {
    "title": "Donald Trump Touts 'Obliteration' of Iran Sites Seen in Satellite Images",
    "description": "The president wrote on Truth Social that \"monumental damage\" had been done to all nuclear sites in Iran.",
    "link": "https://www.newsweek.com/trump-satellite-iran-obliteration-2089189",
    "timestamp": "2025-06-23T09:11:51Z"
  },
  {
    "title": "Iran issues stark warning to Trump ‘the gambler’: We will end this war",
    "description": "Iran and Israel traded air and missile strikes as the world braced on Monday for Tehran's response to the US attack on its nuclear sites and US President Donald Trump raised the idea of regime change in the Islamic Republic.",
    "link": "https://nypost.com/2025/06/23/world-news/iran-issues-stark-warning-to-trump-the-gambler-we-will-end-this-war/",
    "timestamp": "2025-06-23T09:08:50Z"
  },
  {
    "title": "Iran vows retaliation for US strikes as Israel keeps up attacks",
    "description": "Tehran threatened on Monday to inflict \"serious\" damage in retaliation for U.S. strikes on the Islamic republic's nuclear facilities, as the Iran-Israel war entered its 11th day despite calls for de-escalation.",
    "link": "https://www.hurriyetdailynews.com/iran-vows-retaliation-for-us-strikes-as-israel-keeps-up-attacks-210645",
    "timestamp": "2025-06-23T09:07:23Z"
  },
  {
    "title": "Several Airlines Cancel Flights To Dubai, Riyadh, Doha After US-Iran Tensions Rattle Global Air Travel: Report",
    "description": "As the tensions between Washington and Tehran rose after U.S. President Donald Trump ordered strikes at key Iranian nuclear sites at Fordow, Natanz and Isfahan.\nWhat Happened: The busy airspace between Iran, Iraq and the Mediterranean has been largely empty s…",
    "link": "https://biztoc.com/x/98d6f7676563f7c9",
    "timestamp": "2025-06-23T09:05:24Z"
  },
  {
    "title": "Trump is 'Our Generation's Cyrus' - we are experiencing miracles",
    "description": "Communications Minister Shlomo Karhi hails Trump as \"greater than Cyrus,\" revealing how the US President directly aided Israel's strike on Iran—and why this marks a turning point in Jewish destiny.",
    "link": "https://www.israelnationalnews.com/news/410506",
    "timestamp": "2025-06-23T09:05:03Z"
  },
  {
    "title": "China Rips Trump’s Iran Attack in First Comment Since US Hit",
    "description": "China criticized the US strike on Iranian nuclear facilities and reiterated that it’s willing to join international efforts to restore peace in the Middle East.",
    "link": "https://financialpost.com/pmn/business-pmn/china-rips-trumps-iran-attack-in-first-comment-since-us-hit",
    "timestamp": "2025-06-23T09:05:02Z"
  },
  {
    "title": "Iran launches missiles and drones at Israel following U.S. strikes on its nuclear targets",
    "description": "Iran fired a salvo of missiles and drones on Monday at Israel while also warning the United States that its military has been given a \"free hand\" to attack American targets in the wake of the Trump administration's massive strikes on Iranian nuclear sites.",
    "link": "https://www.cbc.ca/news/world/us-israel-iran-nuclear-sites-1.7568265",
    "timestamp": "2025-06-23T09:04:11Z"
  },
  {
    "title": "From the fringes to the mainstream: Meet the hardline anti-immigration activist who helped shape Trump's agenda",
    "description": "The former leader of FAIR, the Federation for American Immigration Reform, Dan Stein, retired this year after more than 40 at the helm of the organization. The right-wing group has long fought to reduce immigration and for tougher border controls. Under Presi…",
    "link": "https://www.npr.org/2025/06/23/nx-s1-5388929/from-the-fringes-to-the-mainstream-meet-the-hardline-anti-immigration-activist-who-helped-shape-trumps-agenda",
    "timestamp": "2025-06-23T09:03:00Z"
  },
  {
    "title": "Spain wins exemption from NATO’s 5% defense spending goal",
    "description": "PM Sanchez’s opposition to the 5% target—calling it unreasonable and counterproductive for his nation—prompted Trump to deride Spain on Friday as a “low payer” that should step up on defense.",
    "link": "https://fortune.com/europe/2025/06/23/spain-wins-exemption-nato-5-defense-spending-goal-pedro-sanchez-trump/",
    "timestamp": "2025-06-23T09:00:58Z"
  },
  {
    "title": "DOUG SCHOEN: Trump's Iran strategy could ignite long-awaited regime change. My Serbia experience is a guide",
    "description": "Israel's strikes on Iranian nuclear sites could spark regime change, drawing parallels to Serbia where bombing weakened rather than strengthened an unpopular government.",
    "link": "https://www.foxnews.com/opinion/doug-schoen-trumps-iran-strategy-could-ignite-long-awaited-regime-change-my-serbia-experience-guide",
    "timestamp": "2025-06-23T09:00:58Z"
  },
  {
    "title": "Obama Bros Go Ballistic After Trump Bombs Iranian Nuke Program",
    "description": "The mediocre white men who served as top advisers to failed president Barack Obama threw embarrassing tantrums on Saturday in response to the successful U.S. military strikes on Iran's nuclear facilities. Thomas Frederick Vietor IV, the lacrosse-playing frat …",
    "link": "https://freebeacon.com/democrats/obama-bros-go-ballistic-after-trump-bombs-iranian-nuke-program/",
    "timestamp": "2025-06-23T09:00:49Z"
  },
  {
    "title": "A Rare Presidential Power Could Enable Trump’s Authoritarianism",
    "description": "To rein in executive authority, Congress needs to reform the Insurrection Act.",
    "link": "http://foreignpolicy.com/2025/06/23/trump-congress-military-executive-branch-presidential-power-insurrection-act/",
    "timestamp": "2025-06-23T09:00:46Z"
  },
  {
    "title": "Midnight Hammer is 'mission accomplished' but there's one big red flag",
    "description": "Trump's action against Iran's nuclear program shows the importance of stealth bombers. But there are real concerns about America's limited B-2 fleet for potential conflicts with China.",
    "link": "https://www.foxnews.com/opinion/midnight-hammer-mission-accomplished-theres-one-big-red-flag",
    "timestamp": "2025-06-23T09:00:44Z"
  },
  {
    "title": "Israel Not Finished With Iran, Netanyahu Says After ‘Historic’ US Airstrikes",
    "description": "TEL AVIV—Prime Minister Benjamin Netanyahu said on Sunday that Israel was \"very, very close\" to achieving its war goals following U.S. airstrikes on Iran’s nuclear facilities the previous night. But, he emphasized, \"We are not done.\"\nIn a press conference, Ne…",
    "link": "https://freebeacon.com/israel/israel-not-finished-with-iran-netanyahu-says-after-historic-us-airstrikes/",
    "timestamp": "2025-06-23T09:00:43Z"
  },
  {
    "title": "Prominent Trump critics laud president's decision to strike Iran nuclear sites",
    "description": "Prominent Trump critics have lauded the president for his decision to strike Iran's nuclear program, calling it \"decisive action\" and the \"right call.\"",
    "link": "https://www.foxnews.com/media/trump-critics-john-bolton-adam-kinzinger-praise-presidents-decision-strike-iran",
    "timestamp": "2025-06-23T09:00:34Z"
  },
  {
    "title": "GREGG JARRETT: Why Trump's preemptive strike on Iran's nuclear facilities was legal, likely saved lives",
    "description": "Trump's strikes on Iranian nuclear sites were legally authorized under the 2001 AUMF, which granted presidents power to target nations that aided 9/11 terrorists",
    "link": "https://www.foxnews.com/opinion/gregg-jarrett-why-trumps-preemptive-strike-irans-nuclear-facilities-legal-likely-saved-lives",
    "timestamp": "2025-06-23T09:00:32Z"
  },
  {
    "title": "The financial impact of Marks & Spencer and Co-op cyberattacks could reach £440M",
    "description": "UK’s Cyber Monitoring Centre (CMC) labels Marks & Spencer and Co-op cyberattacks a Category 2 event, estimating financial impact at £270M–£440M. The Cyber Monitoring Centre (CMC) has labeled the recent cyberattacks on Marks & Spencer and Co-op as a Category 2…",
    "link": "https://securityaffairs.com/179225/cyber-crime/the-financial-impact-of-marks-spencer-and-co-op-cyberattacks-could-reach-440m.html",
    "timestamp": "2025-06-23T09:00:30Z"
  },
  {
    "title": "Adam Schiff, Beneficiary Of Crypto Campaign Cash, Introduces Presidential Crypto Ban",
    "description": "Democrats already passed on a chance to force Republicans to accept a crackdown on Donald Trump's brazen crypto self-enrichment schemes.",
    "link": "https://www.huffpost.com/entry/adam-schiff-coin-act-trump-crypto_n_6855afd2e4b02afc286ae8ee",
    "timestamp": "2025-06-23T09:00:17Z"
  },
  {
    "title": "Putin Is Still Attacking Ukraine, But NATO’s Bigger Problem Is Mollifying Trump",
    "description": "The alliance’s summit will minimize references to either Russia or Ukraine to avoid antagonizing the U.S. president who has sided with the aggressor.",
    "link": "https://www.huffpost.com/entry/nato-trump-summit_n_68545c23e4b0af4d580e924d",
    "timestamp": "2025-06-23T09:00:17Z"
  },
  {
    "title": "Ahead of this week's NATO summit, Europe is uncertain about its old ally, the U.S.",
    "description": "This year's NATO summit opens Tuesday, attended by a disengaged United States, which seems bent on fighting its own battles, rather than helping European allies with the increased threat from Russia.",
    "link": "https://www.npr.org/2025/06/23/nx-s1-5441752/nato-summit-alliance-trump-europe-iran-ukraine-russia",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "Let’s Not Induct a Sexual Predator Into Baseball’s Hall of Fame",
    "description": "June 23, 2025 Let’s Not Induct a Sexual Predator Into Baseball’s Hall of Fame Former Cincinnati Reds player and manager Pete Rose represents a poisonous form of masculinity that should be rooted out, not beatified. Robert Lipsyte Share Copy Link Facebook X (T…",
    "link": "https://www.thenation.com/?post_type=article&p=560806",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "Listen, MAGA: Presidents Rarely Defy the Courts",
    "description": "No, MAGA, Presidents Don’t Regularly Defy the Courts. Trump and his MAGA allies may point to Jefferson, Jackson, Lincoln, and others, but if he balks at judicial orders, he’ll be an outlier.\nThe post Listen, MAGA: Presidents Rarely Defy the Courts appeared fi…",
    "link": "http://washingtonmonthly.com/2025/06/23/listen-maga-presidents-rarely-defy-the-courts/",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "'Biden didn't start any wars': Democrats sharpen their arguments against Trump's foreign policy",
    "description": "Democrats are seizing on Donald Trump’s surprise attack on Iran’s nuclear facilities to make the case that the world is becoming more dangerous on his watch.",
    "link": "https://www.nbcnews.com/politics/donald-trump/democrats-arguments-trump-foreign-policy-iran-rcna214382",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "Polls show Trump's big bill is unpopular as Republicans stare down their deadline for passage",
    "description": "President Donald Trump is facing political headwinds for his \"big, beautiful bill\" as Republican leaders hope to begin votes on it in the Senate this week.",
    "link": "https://www.nbcnews.com/politics/congress/polls-trump-bill-unpopular-republicans-stare-deadline-passage-rcna213724",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "How a coastal Maine town almost became part of Canada",
    "description": "When U.S. President Donald Trump started talking about annexing Canada to make it the 51st state, people in Castine, Maine, took notice.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/castine-maine-canada-invasion-1.7567014",
    "timestamp": "2025-06-23T09:00:00Z"
  },
  {
    "title": "Iran Calls Trump 'the Gambler,' Warns 'Fighters of Islam' Ready for Revenge",
    "description": "Tehran warned Monday the U.S. attack on Iran's nuclear sites expanded the range of legitimate targets for the \"fighters of Islam\" to hit in revenge, adding U.S. President Donald Trump is a \"gambler\" for joining Israel's military campaign against the Islamic R…",
    "link": "https://www.breitbart.com/europe/2025/06/23/iran-calls-trump-the-gambler-warns-fighters-of-islam-ready-for-revenge/",
    "timestamp": "2025-06-23T08:59:48Z"
  },
  {
    "title": "Trump’s bombings present major constitutional and legal questions. But it’s up to Congress to force the issue | CNN Politics",
    "description": "President Donald Trump’s order to bomb Iran’s nuclear facilities presents a new test of the Constitution and the extent of presidential powers to conduct war despite a lack of congressional approval.",
    "link": "https://www.cnn.com/2025/06/23/politics/trump-iran-legal-constitutional-article-1-article-2",
    "timestamp": "2025-06-23T08:55:08Z"
  },
  {
    "title": "$92K dip vs. 'short-lived war' — 5 Things to know in Bitcoin this week",
    "description": "Bitcoin is about to juggle a slew of geopolitcal and macroeconomic volatility triggers in a nail-biting end to June as $100,000 support hangs in the balance.",
    "link": "https://cointelegraph.com/news/92k-dip-vs-short-term-war-5-things-bitcoin-this-week",
    "timestamp": "2025-06-23T08:54:50Z"
  },
  {
    "title": "Us, the war, and the Turks: What will change geopolitically for Greece if Khamenei falls",
    "description": "The possibility of regime change in Tehran is particularly problematic for Ankara\nThe post Us, the war, and the Turks: What will change geopolitically for Greece if Khamenei falls appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/23/us-the-war-and-the-turks-what-will-change-geopolitically-for-greece-if-khamenei-falls/",
    "timestamp": "2025-06-23T08:45:12Z"
  },
  {
    "title": "Americans Issued 'Worldwide' Travel Warning After Iran Strikes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe U.S. State Department on Sunday issued a \"worldwide caution\" alert for Americans traveling abroad, after President Donald Trump announced the U.S. had struck three nuclear sites in Iran.\n\"The conflict betw…",
    "link": "https://biztoc.com/x/1a581f8b517b105f",
    "timestamp": "2025-06-23T08:43:15Z"
  },
  {
    "title": "Judge will order Kilmar Abrego Garcia’s pre-trial release but ICE plans to detain him and possibly try to deport him again",
    "description": "Abrego Garcia pleaded not guilty on June 13 to smuggling charges that his attorneys have characterized as an attempt to justify his mistaken deportation in March to a notorious prison in El Salvador.",
    "link": "https://fortune.com/2025/06/23/judge-order-kilmar-abrego-garcias-pre-trial-release-ice-detain-deport-again/",
    "timestamp": "2025-06-23T08:41:41Z"
  },
  {
    "title": "Americans Issued 'Worldwide' Travel Warning After Iran Strikes",
    "description": "Several airlines canceled flights to the Middle East after the U.S. struck nuclear sites in Iran.",
    "link": "https://www.newsweek.com/americans-issued-worldwide-travel-warning-iran-strikes-2089199",
    "timestamp": "2025-06-23T08:40:49Z"
  },
  {
    "title": "Marjorie Taylor Greene Criticizes Trump Over Iran: 'Not Disloyalty'",
    "description": "The Georgia Republican criticized the president's decision to bomb Iran in a lengthy post on social media.",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-criticized-trump-iran-2089195",
    "timestamp": "2025-06-23T08:39:22Z"
  },
  {
    "title": "Trump Speaks Of Possible 'Regime Change' In Iran Following US Air Strikes",
    "description": "US President Donald Trump suggested he might welcome the toppling of the government in Tehran, hours after members of his administration insisted that recent attacks on Iran were not intended to bring about \"regime change.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250623-rferl01.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "U.S. attack on Iran's nuclear sites sparks fears of wider conflict",
    "description": "U.S. President Donald Trump said Saturday that the United States has completed attacks on three nuclear sites in Iran, namely Fordow, Natanz and Esfahan.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250623-pdo01.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "Strikes on Iran Were 'Highly Classified Mission' - Pentagon Chief",
    "description": "The Department of Defense said that the goal of US strikes on Iran's nuclear facilities was to \"destroy or severely degrade\" the Islamic Republic's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik04.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "US Has Achieved Objectives With Strikes on Iran, Now Ready to Negotiate - Rubio",
    "description": "The US has achieved its objectives with the strikes on Iran's nuclear facilities and is now ready to negotiate immediately if Tehran chooses to reach out, US Secretary of State Marco Rubio said on Sunday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik02.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "Trump Сalls for Peace, Threatening With New Attacks on Iran",
    "description": "US President Donald Trump said that if the escalation in the Middle East continues, the next attacks on Iran could be much worse.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik10.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "US Preparing for Possible Retaliatory Strike From Iran",
    "description": "The administration of US President Donald Trump is preparing for a possible retaliatory strike from Iran, the next 48 hours are of particular concern, NBC reported, citing two defense officials and a senior White House official.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik07.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "Iran Anticipated Attack on Fordow Nuclear Site, Evacuated It - Official",
    "description": "Iran expected an attack on the Fordow nuclear facility, so it was evacuated, there was no irreversible damage to the facility, Mehdi Mohammadi, an adviser to the chairman of the Iranian parliament, said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik11.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "US issues 'worldwide caution' as tensions in the Middle East escalate: report",
    "description": "The US State Department issued a \"worldwide caution\" for Americans on Sunday, saying that the conflict in the Middle East could put those traveling or living abroad at an increased security risk, the AFP reported.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250623-globaltimes03.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "US Launches Strikes on Iran's Nuclear Facilities - Trump",
    "description": "US President Donald Trump claimed a successful operation by the US army against Iran's nuclear facilities.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik12.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "US Strikes Iran: What's Known So Far?",
    "description": "US President Donald Trump said that the goal of the strikes was \"the destruction of Iran's nuclear enrichment capacity.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-sputnik08.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "United States Bombing of Iran's Nuclear Facilities Marks 'Perilous Turn' in Volatile Middle East, Secretary-General Warns Security Council during Emergency Meeting",
    "description": "The United States' bombing of Iran's nuclear facilities marks a \"perilous turn\" in an already volatile region, Secretary-General António Guterres warned during an emergency meeting of the Security Council today. The United Nations' top nuclear watchdog offici…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-unsc01.htm",
    "timestamp": "2025-06-23T08:30:05Z"
  },
  {
    "title": "Foreign Ministry Spokesperson's Remarks on the US Strikes on Iran's Nuclear Facilities",
    "description": "Q: US President Donald Trump announced that the US carried out strikes on three nuclear facilities in Iran—Fordow, Natanz and Esfahan. What's China's comment on this?",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-globaltimes03.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "International community must take a stand, says Iran FM after US aggression",
    "description": "In the wake of the unlawful US aggression against the peaceful Iranian nuclear sites, Foreign Minister Abbas Araghchi on Sunday called on the international community to take a clear stand, warning that the United Nations Charter itself is under attack.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv13.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iranian parliament moves to close Strait of Hormuz after US aggression: Lawmaker",
    "description": "In a decisive response to the US aggression against Iran's peaceful nuclear facilities, the Iranian parliament has voted to close the strategically vital Strait of Hormuz.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv12.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "China condemns US attacks on 3 nuclear sites in Iran",
    "description": "US President Donald Trump declared in a social media post on Saturday US local time that the US had completed \"very successful\" attacks on three nuclear sites in Iran, Fordow, Natanz and Esfahan, with Fordow being widely seen as \"the crown jewel\" of Tehran's …",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-globaltimes02.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "US 'primary force' behind Israel's acts of aggression against Iran: Pezeshkian",
    "description": "Iran's president says Tehran's decisive response to the Israeli regime's acts of aggression forced the US to \"step in\" and attack the peaceful nuclear sites.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv10.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "FM Sa'ar's statement on the US attack in Iran",
    "description": "U.S. President Donald Trump wrote his name tonight in golden letters in the history books. In his courageous decision to attack Iran's nuclear facilities, he proved in practice that he is worthy of the title of leader of the free world.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-israel-mfa01.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iran holds 'war-mongering' US responsible for consequences of its aggression",
    "description": "Iran's foreign ministry has strongly condemned the brutal military aggression against Iran's peaceful nuclear facilities, calling it \"a grave and unprecedented violation of the fundamental principles of the Charter of the United Nations and international law.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv14.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "UN chief 'gravely alarmed' by US bombing of Iranian nuclear sites",
    "description": "The UN Secretary-General António Guterres described the United States' bombing of three nuclear sites in Iran as a \"dangerous escalation\" on Saturday following eight days of deadly strikes and counter strikes between Tehran and Tel Aviv.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250621-unnews01.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "IRGC vows response to US aggression on nuclear sites in ways beyond enemy's calculations",
    "description": "The Islamic Revolution Guards Corps (IRGC) has strongly condemned the American \"unprecedented and blatant act of aggression\" against the Islamic Republic of Iran, vowing to respond in ways beyond the calculations of the aggressor.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv15.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iran will continue its nuclear program despite US aggression: Ex-Russia president",
    "description": "Russia's former president and senior security official, Dmitry Medvedev, has said that despite the illegal aggression of the United States on three Iranian nuclear sites, the Islamic Republic is expected to continue with its peaceful nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv11.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Condemnations pour in after US aggression against Iran's nuclear energy sites",
    "description": "Condemnations are pouring in against the US aggression on Iran's nuclear sites, with many countries describing it as an illegal act that threatens regional and global peace.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv16.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Analysis: Do US Strikes On Iran Set Back Russia's Ambitions, Or Can Putin Play Them To His Advantage?",
    "description": "US President Donald Trump's decision to launch strikes on Iran presents Russian President Vladimir Putin with peril and opportunity: the attacks hit a strategic partner of Moscow, but they may open a potential window for Russia's diplomatic relevance.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-rferl04.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "US Warns Tehran Not To Retaliate After Trump Says Bombing Mission 'Obliterated' Key Iranian Nuclear Sites",
    "description": "US officials warned Tehran not to retaliate and stressed that Washington is not out for regime change after the United States entered the conflict between Israel and Iran with unprecedented air strikes that President Donald Trump claimed \"obliterated\" key Ira…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-rferl02.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iran calls for emergency UNSC session over American attacks on nuclear sites",
    "description": "Iran's ambassador to the United Nations has held the United States and the Israeli regime responsible for Sunday's attacks on Iranian nuclear sites, urging the UN Council (UNSC) to hold an emergency session to address the unprovoked aggression.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv09.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "PH urges diplomacy as Middle East tension heats up after US strikes",
    "description": "The Philippines expressed deep concern over the latest security developments in the Middle East, calling for restraint and diplomacy amid fears of escalating conflict involving Iran, Israel, and the United States (US).",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-pna01.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "US Bombs Iran: What You Need To Know About A (Potentially) Transformational Event",
    "description": "A couple hours after midnight on June 22, a small mountain range about 200 kilometers southwest of the Iranian capital erupted in a series of earthshaking explosions.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-rferl03.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iran reserves 'complete and lawful right' to respond to US aggression: UN envoy",
    "description": "Iran's permanent representative to the United Nations, speaking at an emergency session of the UN Security Council on Monday, strongly condemned the US military aggression on Iranian soil, saying Tehran reserves the complete and lawful right to defend itself …",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250622-presstv05.htm",
    "timestamp": "2025-06-23T08:30:04Z"
  },
  {
    "title": "Iran Vows Retaliation For US Strikes As Israel Keeps Up Attacks",
    "description": "Tehran threatened on Monday to inflict \"serious\" damage in retaliation for US strikes on the Islamic republic's nuclear facilities, as the Iran-Israel war entered its 11th day despite calls for de-escalation.",
    "link": "https://www.ibtimes.com/iran-vows-retaliation-us-strikes-israel-keeps-attacks-3776506",
    "timestamp": "2025-06-23T08:27:11Z"
  },
  {
    "title": "Iran Vows Retaliation For US Strikes As Israel Keeps Up Attacks",
    "description": "Tehran threatened on Monday to inflict \"serious\" damage in retaliation for US strikes on the Islamic republic's nuclear facilities, as the Iran-Israel war entered its 11th day despite calls for de-escalation.",
    "link": "https://www.ibtimes.com.au/iran-vows-retaliation-us-strikes-israel-keeps-attacks-1859360",
    "timestamp": "2025-06-23T08:27:07Z"
  },
  {
    "title": "President Herzog visits sites of Iranian missile strikes",
    "description": "After viewing the vast damage caused to the apartments and homes in the residential area, President Herzog commented on the importance of the US action taken against the Iranian regime's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/06/israel-250622-israel-mfa01.htm",
    "timestamp": "2025-06-23T08:25:51Z"
  },
  {
    "title": "Did Iran move its uranium? Opinions split on fate of 400kg stockpile",
    "description": "Has Iran’s programme been destroyed or simply pushed into smaller, secret facilities that are harder to find?",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/23/did-iran-move-its-uranium-opinions-split-on-fate-of-400kg-stockpile/",
    "timestamp": "2025-06-23T08:25:34Z"
  },
  {
    "title": "Iran-Linked Threat Actors Cyber Fattah Leak Visitors and Athletes’ Data from Saudi Games",
    "description": "Cyber Fattah leaked thousands of records on athletes and visitors from past Saudi Games, per U.S.-based cybersecurity firm Resecurity. Resecurity (USA) identified the threat actors associated with the “Cyber Fattah” movement leaked thousands of records contai…",
    "link": "https://securityaffairs.com/179239/cyber-warfare-2/iran-linked-threat-actors-cyber-fattah-leak-visitors-and-athletes-data-from-saudi-games.html",
    "timestamp": "2025-06-23T08:23:31Z"
  },
  {
    "title": "Iran: What are the chances for regime change?",
    "description": "The longer Israel's attack on Iran goes on, the greater the speculation about the possibility of overthrowing the government in Tehran. But regime change has historically had disastrous consequences in the region. Israeli Prime Minister Benjamin Netanyahu ope…",
    "link": "https://www.dw.com/en/iran-what-are-the-chances-for-regime-change/a-72995153",
    "timestamp": "2025-06-23T08:22:00Z"
  },
  {
    "title": "Three Album Run: 21st Century Pop Has Never Bettered 4, Beyoncé & Lemonade",
    "description": "At the quarter way mark Stephanie Phillips is confident that nothing comes close to the brilliance of this consecutive trio of albums by Beyoncé Giselle Knowles-Carter\nThree Album Run is a new series on tQ where we explore the best unbroken run of LPs in diff…",
    "link": "https://thequietus.com/opinion-and-essays/black-sky-thinking/best-albums-by-beyonce/",
    "timestamp": "2025-06-23T08:21:41Z"
  },
  {
    "title": "Iran's supreme leader asks Putin to do more after US strikes",
    "description": "ISTANBUL/MOSCOW (Reuters) -Iran's supreme leader sent his foreign minister to Moscow on Monday to ask President Vladimir Putin for more help from Russia...",
    "link": "https://www.yahoo.com/news/irans-supreme-leader-asks-putin-081956482.html",
    "timestamp": "2025-06-23T08:19:56Z"
  },
  {
    "title": "U.S. turns Taiwan into cash machine through soaring arms sales",
    "description": "\"Ukraine is convinced that Iran's nuclear program must be brought to an end so that it never again poses a threat neither to the countries of the Middle East nor to any other state.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250623-pdo01.htm",
    "timestamp": "2025-06-23T08:19:53Z"
  },
  {
    "title": "Netanyahu says Israel \"very close\" to achieving goals in Iran, vows to avoid \"war of attrition\"",
    "description": "Israeli Prime Minister Benjamin Netanyahu announced that Israel is nearing its objectives in Iran, having significantly damaged its nuclear and ballistic missile programs. Following US strikes on Iranian nuclear sites, Netanyahu vowed to continue the campaign…",
    "link": "https://economictimes.indiatimes.com/news/defence/netanyahu-says-israel-very-close-to-achieving-goals-in-iran-vows-to-avoid-war-of-attrition/articleshow/122020625.cms",
    "timestamp": "2025-06-23T08:18:58Z"
  },
  {
    "title": "Iran’s Promise of Payback Keeps World Powers, Markets on Edge",
    "description": "Iran vowed retaliation and kept up attacks on Israel following the US strikes on its nuclear facilities over the weekend, fueling fears of a wider war in the Middle East and rattling global markets.",
    "link": "https://financialpost.com/pmn/business-pmn/irans-promise-of-payback-keeps-world-powers-markets-on-edge",
    "timestamp": "2025-06-23T08:14:12Z"
  },
  {
    "title": "JD Vance Roasted For Line That Inadvertently Seemed To Insult Trump",
    "description": "The vice president received a brutal reminder.",
    "link": "https://www.huffpost.com/entry/jd-vance-presidents-iran_n_685902efe4b03149323a0c55",
    "timestamp": "2025-06-23T08:12:45Z"
  },
  {
    "title": "White House calls CNN 'fake news' for report claiming Democratic leadership wasn't briefed on Iran strike",
    "description": "White House press secretary Karoline Leavitt demanded CNN retract a story on Sunday that claimed Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries were not briefed on President Donald Trump’s strike on Iran. Trump launched \"Operat…",
    "link": "https://freerepublic.com/focus/f-chat/4324749/posts",
    "timestamp": "2025-06-23T08:09:54Z"
  }
]