[
  {
    "title": "Target Sees Foot Traffic Down for 11th Straight Week Amid Boycott",
    "description": "Costco has seen an increase in customer traffic over the same time period.",
    "link": "https://www.newsweek.com/target-foot-traffic-falls-amid-boycott-costco-increase-2063711",
    "timestamp": "2025-04-24T16:40:16Z"
  },
  {
    "title": "Trump Eyes Sovereign Wealth Fund to Back U.S. Mining",
    "description": "U.S. President Donald Trump is weighing the creation of a U.S. sovereign wealth fund to directly invest in domestic and allied critical mineral producers, a bold economic intervention aimed at insulating the nation from China's dominance in battery metals and…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Eyes-Sovereign-Wealth-Fund-to-Back-US-Mining.html",
    "timestamp": "2025-04-24T16:40:00Z"
  },
  {
    "title": "Trump announces he'll be interviewed by The Atlantic's Jeffrey Goldberg",
    "description": "President Donald Trump will be interviewed by The Atlantic's Jeffrey Goldberg on Thursday. Goldberg was the journalist included on a private Signal chat of top Trump officials last month.",
    "link": "https://www.foxnews.com/media/trump-announces-hell-interviewed-atlantics-jeffrey-goldberg",
    "timestamp": "2025-04-24T16:36:44Z"
  },
  {
    "title": "Gen Z workers increasingly opt out of college and into the trades: ‘There are about 2 million fewer students,' says expert",
    "description": "Many young people choose skilled trades like construction or plumbing. \"I'm not going to go stop my business and pay for college,\" says Chase Gallagher, age 24.",
    "link": "https://www.cnbc.com/2025/04/24/gen-z-workers-opt-out-of-college-and-go-into-trades.html",
    "timestamp": "2025-04-24T16:36:21Z"
  },
  {
    "title": "Trump’s Transgender Military Ban Is On Its Way To SCOTUS",
    "description": "The order claimed these soldiers could not meet the “high standards for readiness, lethality, cohesion, honesty, humility, uniformity, and integrity.”",
    "link": "https://www.huffpost.com/entry/trumps-transgender-military-ban-is-on-its-way-to-scotus_n_6807d026e4b09d8446f84cec",
    "timestamp": "2025-04-24T16:35:27Z"
  },
  {
    "title": "The market keeps proving itself as the biggest foil for Trump and Musk",
    "description": "Investors have made it clear this year that they don't like what Donald Trump and Elon Musk are doing. Both have pivoted in the face of extreme volatility.",
    "link": "https://www.businessinsider.com/donald-trump-elon-musk-stock-market-tesla-tsla-bonds-selloff-2025-4",
    "timestamp": "2025-04-24T16:33:56Z"
  },
  {
    "title": "Judge blocks Trump on sanctuary city funds",
    "description": "A federal judge has barred the Trump administration from denying or conditioning the use of federal funds to “sanctuary” jurisdictions.",
    "link": "https://www.wtae.com/article/judge-blocks-trump-sanctuary-city-funding/64578863",
    "timestamp": "2025-04-24T16:33:28Z"
  },
  {
    "title": "Trump Announces Interview With Jeffrey Goldberg in Insult-Riddled Post, Says He’s Doing It ‘As a Competition With Myself’",
    "description": "\"Jeffrey is bringing with him Michael Scherer and Ashley Parker, not exactly pro-Trump writers, either, to put it mildly!\" Trump wrote on Truth Social\nThe post Trump Announces Interview With Jeffrey Goldberg in Insult-Riddled Post, Says He’s Doing It ‘As a Co…",
    "link": "https://www.mediaite.com/politics/trump-announces-interview-with-jeffrey-goldberg-in-insult-riddled-post-says-hes-doing-it-as-a-competition-with-myself/",
    "timestamp": "2025-04-24T16:32:49Z"
  },
  {
    "title": "Eric Trump Reacts After Donald Trump Slams Lawyer Advising His Own Company",
    "description": "President Donald Trump slammed Harvard University and a lawyer involved in the lawsuit against him in a Thursday Truth Social post.",
    "link": "https://www.newsweek.com/eric-trump-reacts-after-donald-trump-slams-lawyer-advising-his-own-company-2063673",
    "timestamp": "2025-04-24T16:32:37Z"
  },
  {
    "title": "Trump: Putin will listen to me on stopping strikes",
    "description": "US President Donald Trump expressed confidence on Thursday that Russia's President Vladimir Putin would heed his call to end attacks in Ukraine.Asked by a reporter if he thinks Putin will listen to hi...",
    "link": "https://biztoc.com/x/6f4991f9b935b616",
    "timestamp": "2025-04-24T16:32:09Z"
  },
  {
    "title": "Trump asks US Supreme Court to enforce transgender military ban",
    "description": "The Trump administration has asked the Supreme Court to allow the implementation of his executive order banning transgender people from serving in the military, reversing a policy implemented by President Biden. Lower courts have blocked the ban, citing const…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-asks-us-supreme-court-to-enforce-transgender-military-ban/articleshow/120591193.cms",
    "timestamp": "2025-04-24T16:31:59Z"
  },
  {
    "title": "Trump: I have my own deadline on Ukraine-Russia deal",
    "description": "United States President Donald Trump told the press on Thursday that he has his very own deadline for a Russia-Ukraine peace agreement, stating the US attitude would shift once this deadline passes.\"I...",
    "link": "https://biztoc.com/x/630b72a6db51402e",
    "timestamp": "2025-04-24T16:31:57Z"
  },
  {
    "title": "World Economic Forum greenlights new investigation into whistleblower claims against founder Klaus Schwab",
    "description": "The World Economic Forum board said it supports an \"independent investigation\" into former chairman of the globalist body, Klaus Schwab.",
    "link": "https://www.foxnews.com/world/world-economic-forum-greenlights-new-investigation-whistleblower-claims-against-founder-klaus-schwab",
    "timestamp": "2025-04-24T16:30:50Z"
  },
  {
    "title": "Jonathan Turley Says Trump Has ‘Fair Amount’ Of Leeway To Fight Against Courts Who May Try To Block Terrorism Charges",
    "description": "Jonathan Turley said that President Donald Trump has the \"discretion\" to fight against the courts who may dispute the terrorism charges against a gang member.",
    "link": "https://dailycaller.com/2025/04/24/turley-trump-courts-terrorism-charges/",
    "timestamp": "2025-04-24T16:30:18Z"
  },
  {
    "title": "Trump and Speaker Mike Johnson shoot down millionaire tax hike",
    "description": "Some Republicans had debated breaking from party orthodoxy by allowing taxes to go up on wealthy Americans to help pay for a massive bill for Trump's agenda.",
    "link": "https://www.nbcnews.com/politics/congress/trump-speaker-mike-johnson-shoot-down-millionaire-tax-hike-rcna202786",
    "timestamp": "2025-04-24T16:30:14Z"
  },
  {
    "title": "Trump Executive Order On Accreditation Could Reshape Student Loans",
    "description": "The Trump executive order on student loan accreditation could reshape student loans by raising college quality standards, impacting both current and future borrowers.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/04/24/trump-executive-order-on-accreditation-could-reshape-student-loans/",
    "timestamp": "2025-04-24T16:30:04Z"
  },
  {
    "title": "Is US dollar dominance at risk?",
    "description": "Donald Trump thinks a strong dollar is hurting US manufacturing. His team has backed the idea of currency weakening.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/4/24/is-us-dollar-dominance-at-risk",
    "timestamp": "2025-04-24T16:30:00Z"
  },
  {
    "title": "Europeans Saw Trump’s Trade War Coming and Gorged on US Booze",
    "description": "Europeans splurged on American spirits ahead of Donald Trump’s return to the White House and the potential for him to start another trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/europeans-saw-trumps-trade-war-coming-and-gorged-on-us-booze",
    "timestamp": "2025-04-24T16:29:29Z"
  },
  {
    "title": "Trump Signs Executive Order Putting A Stop To Dark Foreign Money Influence In American Universities",
    "description": "President Donald Trump on Wednesday signed an executive order requiring American universities to be more transparent about any foreign donations they accept.",
    "link": "https://dailycaller.com/2025/04/24/trump-signs-executive-order-putting-a-stop-to-dark-foreign-money-influence-in-american-universities/",
    "timestamp": "2025-04-24T16:28:38Z"
  },
  {
    "title": "Putin Ally Issues Warning on Nuclear Weapons and 'New Global War'",
    "description": "Imangali Tasmagambetov, the secretary-general of the Collective Security Treaty Organization, spoke at a conference this week.",
    "link": "https://www.newsweek.com/putin-ally-issues-warning-nuclear-weapons-global-war-2063675",
    "timestamp": "2025-04-24T16:28:22Z"
  },
  {
    "title": "Trump wants to overhaul the way colleges receive federal student loans and grants as part of DEI crackdown",
    "description": "Trump has deployed what he called his \"secret weapon\" to crack down on DEI initiatives at colleges and universities.",
    "link": "https://www.businessinsider.com/trump-overhaul-student-loan-grants-college-accreditation-higher-education-woke-2025-4",
    "timestamp": "2025-04-24T16:28:06Z"
  },
  {
    "title": "Bridgewater calls trade war a 'once-in-a-generation' shift with 'exceptional risks'",
    "description": "Bridgewater Associates has a dire warning about President Donald Trump’s trade war: It’s increasing the “probability of a recession.”Read more...",
    "link": "https://qz.com/bridgewater-trade-war-trump-tariffs-1851777687",
    "timestamp": "2025-04-24T16:28:00Z"
  },
  {
    "title": "ICE Is Also Relying On A Defunct Gang Database To Send Migrants To Foreign Concentration Camps",
    "description": "Gang databases are just handy racism. They’re a way for cops to harass, arrest, or otherwise make minorities’ lives more miserable. Very little in the way of logic or evidence is required to allow officers to add people to these databases. That’s why victims …",
    "link": "https://www.techdirt.com/2025/04/24/ice-is-also-relying-on-a-defunct-gang-database-to-send-migrants-to-foreign-concentration-camps/",
    "timestamp": "2025-04-24T16:27:48Z"
  },
  {
    "title": "Trump agrees to interview with journalist who was included in infamous 'Signalgate' chat",
    "description": "President Donald Trump announced that he will do an interview with the journalist who was mistakenly included in a Signal chat that exposed secret war plans.\"Later today I will be meeting with, of all people, Jeffrey Goldberg, the Editor of The Atlantic,\" Tru…",
    "link": "https://www.rawstory.com/jeffrey-goldberg-donald-trump-interview/",
    "timestamp": "2025-04-24T16:27:24Z"
  },
  {
    "title": "Despite MAGA Media’s Teacher’s Pet Status, It’s the Old Guard Churning Out Trump Scoops",
    "description": "Top editors from The Wall Street Journal, Axios, and Politico speak with VF about holding Donald Trump’s administration accountable in these nearly 100 days. What’s essential, says the Times’ Carolyn Ryan, is “reporting, reporting, reporting.”",
    "link": "https://www.vanityfair.com/news/story/donald-trump-media-scoops-100-days",
    "timestamp": "2025-04-24T16:27:01Z"
  },
  {
    "title": "How No-Code Platforms Are Changing Enterprise Systems",
    "description": "Also in the Forbes CIO newsletter: Leaders increasingly aren’t confident in data, Apple and Meta hit with EU fines, IRS CIO joins migration from government service.",
    "link": "https://www.forbes.com/sites/cio/2025/04/24/how-no-code-platforms-are-changing-enterprise-systems/",
    "timestamp": "2025-04-24T16:26:26Z"
  },
  {
    "title": "SANDOVAL: Trump Just Fired A Deadly Shot At DEI — And The Legacy Media Is Totally Ignoring It",
    "description": "President Donald Trump just took a sledgehammer to a load-bearing legislative pillar of Diversity, Equity, and Inclusion (DEI) with a new Executive Order",
    "link": "https://dailycaller.com/2025/04/24/donald-trump-disparate-impact-executive-order-diversity-equity-inclusion/",
    "timestamp": "2025-04-24T16:26:02Z"
  },
  {
    "title": "Trump should direct anger at Putin, who ‘must stop lying’ about Ukraine, Macron says",
    "description": "The French president's impassioned plea came during a conversation with reporters while in Madagascar.",
    "link": "https://www.politico.eu/article/emmanuel-macron-donald-trump-vladimir-putin-war-in-ukraine/",
    "timestamp": "2025-04-24T16:25:47Z"
  },
  {
    "title": "Can South Africa help Russia and Ukraine reach a peace deal?",
    "description": "As Ukraine's Zelenskyy meets South Africa's Ramaphosa in Pretoria, Moscow-allied politicians protest the state visit.",
    "link": "https://www.aljazeera.com/news/2025/4/24/can-south-africa-help-russia-and-ukraine-reach-a-peace-deal",
    "timestamp": "2025-04-24T16:25:30Z"
  },
  {
    "title": "India open to revising EV manufacturing policy for foreign automakers post US tariff clarity",
    "description": "This development comes at a time when negotiations on a bilateral trade agreement (BTA) are in full swing.",
    "link": "https://www.livemint.com/industry/manufacturing/india-ev-manufacturing-policy-foreign-automakers-us-tariff-bilateral-trade-agreement-bta-11745503400129.html",
    "timestamp": "2025-04-24T16:25:12Z"
  },
  {
    "title": "Judge Bars Trump From Denying Federal Funds To ‘Sanctuary’ Cities That Limit Immigration Cooperation",
    "description": "U.S. Judge Orrick said a preliminary injunction was appropriate because the executive orders were unconstitutional just as they were in 2017 when Trump announced a similar order.",
    "link": "https://www.huffpost.com/entry/judge-bars-trump-denying-federal-funds-to-sanctuary-cities-that-limit-immigration-cooperation_n_680a6419e4b0b3e1a66f129c",
    "timestamp": "2025-04-24T16:25:05Z"
  },
  {
    "title": "Trump wants heads to roll at Fake News outlet Fox News. So leopards are now eating faces of leopards? [Cool]",
    "description": "Trump wants heads to roll at Fake News outlet Fox News. So leopards are now eating faces of leopards?",
    "link": "https://www.fark.com/comments/13646550/Trump-wants-heads-to-roll-at-Fake-News-outlet-Fox-News-So-leopards-are-now-eating-faces-of-leopards",
    "timestamp": "2025-04-24T16:22:46Z"
  },
  {
    "title": "Trump welcomes Norwegian PM at WH",
    "description": "Norway's Prime Minister Jonas Gahr Store arrived at the White House on Thursday to meet with United States President Donald Trump.The leaders plan to address various topics, including Trump's trade du...",
    "link": "https://biztoc.com/x/99863a7c07e3648a",
    "timestamp": "2025-04-24T16:21:05Z"
  },
  {
    "title": "Canada election race tightens, Conservatives narrow gap with Liberals, poll says",
    "description": "WINNIPEG, Manitoba (Reuters) - Canada's ruling Liberals are still in the lead ahead of an election on Monday but the gap with the trailing Conservatives is tightening, a rolling three-day poll showed on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/canada-election-race-tightens-conservatives-narrow-gap-with-liberals-poll-says",
    "timestamp": "2025-04-24T16:21:00Z"
  },
  {
    "title": "Donald Trump's Meeting and Interview with Jeffrey Goldberg: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said on Thursday that he will meet with Jeffrey Goldberg, The Atlantic's editor-in-chief and the journalist at the heart of the \"Signalgate\" controversy involving key Trump administratio…",
    "link": "https://biztoc.com/x/0494e4e7e0b3be46",
    "timestamp": "2025-04-24T16:20:54Z"
  },
  {
    "title": "7 Things To Do With Your Money If Tariffs Are Making Your Lifestyle Harder To Afford",
    "description": "If the tariffs that President Donald Trump has promised on many of the country’s trade partners go into effect, many goods and services will likely become more expensive. For some Americans, their lifestyles may become harder to afford.\nLearn More: 4 Surprisi…",
    "link": "https://biztoc.com/x/18ee3cd23852eeba",
    "timestamp": "2025-04-24T16:20:49Z"
  },
  {
    "title": "Donald Trump's Meeting and Interview with Jeffrey Goldberg: What to Know",
    "description": "Administration officials allegedly discussed military plans in Yemen in a Signal chat on March 24 that included Jeffrey Goldberg.",
    "link": "https://www.newsweek.com/donald-trumps-meeting-interview-jeffrey-goldberg-what-know-2063743",
    "timestamp": "2025-04-24T16:20:26Z"
  },
  {
    "title": "The Data We Don’t Collect Is Killing Women",
    "description": "Since Roe v. Wade was overturned in 2022, at least 10 women have died as a direct result of their inability to access healthcare. But this number is only a guess, because there’s no single place that records and tracks these tragedies. And that’s not just an …",
    "link": "https://msmagazine.com/2025/04/24/data-abortion-ban-death-women-maternal-mortality-morbidity/",
    "timestamp": "2025-04-24T16:19:31Z"
  },
  {
    "title": "'Boeing should default China': Trump lashes out as trade negotiations stall",
    "description": "President Donald Trump may not be engaging in formal talks with China to negotiate tariffs, but he was lobbing threats against the rival economic giant on social media.China's foreign ministry denied any suggestion it was involved in active negotiations with …",
    "link": "https://www.rawstory.com/trump-china-tariff-negotiations/",
    "timestamp": "2025-04-24T16:18:59Z"
  },
  {
    "title": "Airlines, rattled by trade war and spending pullback, continue to cut flights, pull outlooks",
    "description": "Consumer reluctance to book vacations shows many people fear a recession.",
    "link": "https://www.bostonherald.com/2025/04/24/airlines-slowing-travel/",
    "timestamp": "2025-04-24T16:18:34Z"
  },
  {
    "title": "Final Fantasy Magic cards are helping protect Hasbro from Trump tariffs",
    "description": "Magic: The Gathering is already off to an incredible start in 2025, and that success appears to be helping shield its owner, game and toy maker Hasbro, from the immediate impact of United States President Donald Trump’s tariffs. Chief executive Chris Cocks to…",
    "link": "https://www.polygon.com/tabletop-games/564495/magic-final-fantasy-hasbro-trump-tariffs",
    "timestamp": "2025-04-24T16:18:09Z"
  },
  {
    "title": "Donald Trump Lashes Out At Fox News After Its Poll Shows His Approval Rating 11 Points Underwater",
    "description": "Donald Trump went after Fox News today after its latest poll showed him 11 points underwater in job approval. Despite the presence of a friendly slate of opinion hosts on Fox News, the president has lashed out over its polls, which are done under the directio…",
    "link": "http://deadline.com/2025/04/trump-fox-news-poll-1236376132/",
    "timestamp": "2025-04-24T16:17:05Z"
  },
  {
    "title": "Trump administration cuts $4.5 million in funding for Maine offshore wind projects",
    "description": "The University of Maine was told it has failed to comply with federal grant requirements, just weeks out from launching it's most experimental floating wind turbine yet.",
    "link": "https://www.pressherald.com/2025/04/24/umaines-offshore-wind-projects-were-nearly-complete-when-the-trump-administration-ordered-them-to-stop-work/",
    "timestamp": "2025-04-24T16:16:28Z"
  },
  {
    "title": "Judge bars Trump from denying federal funds to ‘sanctuary’ cities that limit immigration cooperation",
    "description": "The judge said a preliminary injunction was appropriate because the orders were unconstitutional.",
    "link": "https://www.denverpost.com/2025/04/24/trump-sanctuary-cities/",
    "timestamp": "2025-04-24T16:16:06Z"
  },
  {
    "title": "Judge bars Trump from denying federal funds to ‘sanctuary’ cities that limit immigration cooperation",
    "description": "The judge said a preliminary injunction was appropriate because the orders were unconstitutional.",
    "link": "https://www.bostonherald.com/2025/04/24/trump-sanctuary-cities/",
    "timestamp": "2025-04-24T16:16:06Z"
  },
  {
    "title": "How Trump backed away from promising to end the Russia-Ukraine war in 24 hours",
    "description": "Initially promising a swift resolution to the Russia-Ukraine war, Donald Trump's stance has softened since assuming office. While once claiming he could end the conflict in 24 hours, Trump and his administration now express caution. Secretary of State Rubio h…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-trump-backed-away-from-promising-to-end-the-russia-ukraine-war-in-24-hours/articleshow/120590893.cms",
    "timestamp": "2025-04-24T16:14:26Z"
  },
  {
    "title": "Elon Musk May Not Be Able to Save Tesla",
    "description": "Tesla's shares rallied on Wednesday, following a catastrophic earnings call the night before. The company's net income had plummeted by an astonishing 71 percent since Q1 of last year. Yet",
    "link": "https://futurism.com/elon-musk-too-late-save-tesla",
    "timestamp": "2025-04-24T16:14:16Z"
  },
  {
    "title": "Federal judge declares Trump admin blocking federal money from sanctuary cities unconstitutional",
    "description": "An Obama-appointed federal judge in San Francisco said President Donald Trump's orders blocking federal funds from sanctuary cities is unconstitutional.",
    "link": "https://www.foxnews.com/politics/federal-judge-declares-trump-admin-blocking-federal-money-from-sanctuary-cities-unconstitutional",
    "timestamp": "2025-04-24T16:12:49Z"
  },
  {
    "title": "Deja Foxx Is Running for Congress in Arizona to Fight for Young People and Reshape the Democratic Party",
    "description": "Deja Foxx talks to Teen Vogue about running for Congress, how the Democratic Party needs to change, and the future of Gen Z politics.",
    "link": "https://www.teenvogue.com/story/deja-foxx-congress-arizona-democratic-party",
    "timestamp": "2025-04-24T16:12:37Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: NFL Draft countdown",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-nfl-draft-countdown",
    "timestamp": "2025-04-24T16:12:06Z"
  },
  {
    "title": "Jon Stewart Agrees Trump Administration Is Obsessed With ‘Not Being Taken for a Sucker’ | Video",
    "description": "The \"Daily Show\" star analyzes America's current international reputation alongside \"The Rest Is Politics\" host Rory Stewart\nThe post Jon Stewart Agrees Trump Administration Is Obsessed With ‘Not Being Taken for a Sucker’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-weekly-show-jon-stewart-trump-administration-sucker/",
    "timestamp": "2025-04-24T16:12:02Z"
  },
  {
    "title": "Letters to the Editor dated April 24, 2024",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters/letters-to-editor/article69487926.ece",
    "timestamp": "2025-04-24T16:11:54Z"
  },
  {
    "title": "Trump Still Mentions Joe Biden a Shocking Number of Times Every Day, New Analysis Reveals",
    "description": "An NBC News analysis of Trump 2.0's first 100 days published this week found that the president is constantly bringing up Biden and his family.\nThe post Trump Still Mentions Joe Biden a Shocking Number of Times Every Day, New Analysis Reveals first appeared o…",
    "link": "https://www.mediaite.com/news/trump-still-mentions-joe-biden-a-shocking-number-of-times-every-day-new-analysis-reveals/",
    "timestamp": "2025-04-24T16:11:30Z"
  },
  {
    "title": "Schumer Promises Dems Will Retake Senate Despite Voters Souring On Their Job Performance",
    "description": "Senate Majority Leader Chuck Schumer is claiming Senate Democrats \"are on offense\" heading into the midterms and will retake control of the upper chamber.",
    "link": "https://dailycaller.com/2025/04/24/schumer-promises-dems-will-retake-senate-despite-voters-souring-on-their-job-performance/",
    "timestamp": "2025-04-24T16:11:27Z"
  },
  {
    "title": "Joy Behar Sends ‘The View’ Into Hysterics With Shocking Joke About Trump’s Inauguration: “If I Had To Listen To Trump Babble On For Hours, I’d Have Menstrual Cramps”",
    "description": "It's never a dull day on The View!",
    "link": "https://decider.com/2025/04/24/joy-behar-says-menstrual-cramps-if-had-listen-trump-babble-hours-the-view/",
    "timestamp": "2025-04-24T16:10:24Z"
  },
  {
    "title": "China denies any suggestion it is currently in talks with the US over tariffs",
    "description": "BANGKOK (AP) — China on Thursday denied any suggestion that it was in active negotiations with the administration of U.S. President Donald Trump over tariffs, saying that any notion of progress in the matter was as groundless as “trying to catch the wind.” Ch…",
    "link": "https://financialpost.com/pmn/china-denies-any-suggestion-it-is-currently-in-talks-with-the-us-over-tariffs",
    "timestamp": "2025-04-24T16:10:11Z"
  },
  {
    "title": "Trump Calls Harvard \"Liberal Mess\" As Funding Dispute Heads To Court",
    "description": "US President Donald Trump on Thursday bashed Harvard as an &quot;Anti-Semitic, Far Left Institution,&quot; as the prestigious university battles his administration&#039;s funding freeze in court.",
    "link": "https://www.ndtv.com/world-news/trump-calls-harvard-liberal-mess-as-funding-dispute-heads-to-court-8247874",
    "timestamp": "2025-04-24T16:10:11Z"
  },
  {
    "title": "Putin says Russia should use trade war opportunities to strengthen economy",
    "description": "MOSCOW (Reuters) -Russian President Vladimir Putin urged his economic officials on Thursday to take advantage of opportunities arising in the global economy from market turbulence and intensifying trade wars. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/putin-says-russia-should-use-trade-war-opportunities-to-strengthen-economy",
    "timestamp": "2025-04-24T16:10:00Z"
  },
  {
    "title": "Trump to meet The Atlantic editor for profile interview",
    "description": "United States President Donald Trump said on Thursday that he will meet with Jeffrey Goldberg, the editor-in-chief of The Atlantic.In a social media post, the president announced that Goldberg will br...",
    "link": "https://biztoc.com/x/78484752f5d0579e",
    "timestamp": "2025-04-24T16:09:59Z"
  },
  {
    "title": "Do Americans support Trump’s attitudes to Ukraine and Russia? Here’s what recent data shows",
    "description": "How far do American citizens support Donald Trump’s position on Ukraine and Russia?",
    "link": "https://theconversation.com/do-americans-support-trumps-attitudes-to-ukraine-and-russia-heres-what-recent-data-shows-255169",
    "timestamp": "2025-04-24T16:08:22Z"
  },
  {
    "title": "Are Tiger Woods & Vanessa Trump Dating? Inside the Rumors",
    "description": "Multiple reports surfaced in early March suggesting that Tiger and Vanessa were quietly dating. Find out if it's true and learn more about their relationship here.",
    "link": "https://hollywoodlife.com/2025/04/24/tiger-woods-vanessa-trump-dating/",
    "timestamp": "2025-04-24T16:08:08Z"
  },
  {
    "title": "Trump Blasts Harvard as 'Liberal Mess' and Attacks Its Lawyer (Pierre Paulden/Bloomberg)",
    "description": "Pierre Paulden / Bloomberg:\nTrump Blasts Harvard as ‘Liberal Mess’ and Attacks Its Lawyer  —  President Donald Trump launched a new broadside on Harvard University, attacking its lawyer, who's also represented him, and accusing the school of being a “liberal …",
    "link": "https://www.memeorandum.com/250424/p65",
    "timestamp": "2025-04-24T16:05:02Z"
  },
  {
    "title": "Trump Blows Up at Zelenskyy Over 'Very Harmful' Move Amid Tense Peace Negotiations",
    "description": "It's not the first time the U.S. and Ukrainian leaders have been publicly at odds. But President Donald Trump's patience is wearing thin.",
    "link": "https://www.westernjournal.com/trump-blows-zelenskyy-harmful-move-amid-tense-peace-negotiations/",
    "timestamp": "2025-04-24T16:05:01Z"
  },
  {
    "title": "San Francisco tech bros keep badgering Garry Tan about crime",
    "description": "The Y Combinator CEO is not an elected official or civil servant. Still, plenty within his tribe of VCs, founders, and coders seem to believe he might take up their pet causes and leverage his contacts and social media bullhorn to find solutions.",
    "link": "https://sfstandard.com/2025/04/24/the-dork-knight-why-tech-bros-keep-badgering-garry-tan-for-help/",
    "timestamp": "2025-04-24T16:04:44Z"
  },
  {
    "title": "BANNON: 'None of this makes sense'...",
    "description": "BANNON: 'None of this makes sense'...\r\n\n \n \n \n (First column, 5th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Musk had govt in his grasp. Then it unraveled...\r\nElon-owned company says it qualifies for federal contracts reserved for 'small businesses'...\r\nDOGE S…",
    "link": "https://www.semafor.com/article/04/23/2025/steve-bannon-wants-elon-musk-to-provide-specific-accounting-of-government-fraud-uncovered-by-doge",
    "timestamp": "2025-04-24T16:04:37Z"
  },
  {
    "title": "Trump hand bruise can no longer be masked by makeup, persists for 2 months...",
    "description": "Trump hand bruise can no longer be masked by makeup, persists for 2 months...\r\n\n \n \n \n (First column, 6th story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.irishstar.com/news/us-news/trumps-hand-bruise-lasts-2-35106646",
    "timestamp": "2025-04-24T16:04:37Z"
  },
  {
    "title": "Elon-owned company says it qualifies for federal contracts reserved for 'small businesses'...",
    "description": "Elon-owned company says it qualifies for federal contracts reserved for 'small businesses'...\r\n\n \n \n \n (First column, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Musk had govt in his grasp. Then it unraveled...\r\nDOGE Social Security Cuts Create Chaotic 'Day…",
    "link": "https://www.muskwatch.com/p/musk-owned-company-says-it-qualifies",
    "timestamp": "2025-04-24T16:04:37Z"
  },
  {
    "title": "European Carmakers On China Charm Offensive As Sales Droop",
    "description": "Once blithely dominant in China, European automakers are now launching full-fledged charm offensives at consumers in the world's largest car market, seeking to claw back sales lost to domestic rivals.",
    "link": "https://www.ibtimes.com.au/european-carmakers-china-charm-offensive-sales-droop-1858214",
    "timestamp": "2025-04-24T16:03:19Z"
  },
  {
    "title": "European Carmakers On China Charm Offensive As Sales Droop",
    "description": "Once blithely dominant in China, European automakers are now launching full-fledged charm offensives at consumers in the world's largest car market, seeking to claw back sales lost to domestic rivals.",
    "link": "https://www.ibtimes.com/european-carmakers-china-charm-offensive-sales-droop-3771265",
    "timestamp": "2025-04-24T16:03:09Z"
  },
  {
    "title": "Trump Admin Mistakenly Shares Doomed Plan to Kill Congestion Pricing",
    "description": "Oops! Attorneys for the Trump administration accidentally filed a memo breaking down the weaknesses of their own case to kill New York’s congestion pricing.",
    "link": "http://nymag.com/intelligencer/article/trump-admin-leaks-plan-to-kill-congestion-pricing-by-mistake.html",
    "timestamp": "2025-04-24T16:03:02Z"
  },
  {
    "title": "China denies any suggestion it is currently in talks with the US over tariffs",
    "description": "China has denied any suggestion it's in active negotiations with the administration of U_S_ President Donald Trump over tariffs, saying any notion of progress in the matter is as groundless as “trying to catch the wind.”.",
    "link": "https://www.local10.com/business/2025/04/24/china-says-there-are-no-negotiations-with-the-us-over-tariffs/",
    "timestamp": "2025-04-24T16:02:47Z"
  },
  {
    "title": "Stocks rally rolls on in US, fizzles elsewhere",
    "description": "Wall Street stocks pushed higher for a third day on Thursday but the rally fizzled elsewhere as China poured cold water on US President Donald Trump's...",
    "link": "https://finance.yahoo.com/news/asian-markets-mixed-china-dispels-091510720.html",
    "timestamp": "2025-04-24T16:02:46Z"
  },
  {
    "title": "7 Things To Do With Your Money If Tariffs Are Making Your Lifestyle Harder To Afford",
    "description": "If the tariffs that President Donald Trump has promised on many of the country's trade partners go into effect, many goods and services will likely become...",
    "link": "https://finance.yahoo.com/news/7-things-money-tariffs-making-160144196.html",
    "timestamp": "2025-04-24T16:01:44Z"
  },
  {
    "title": "BREAKING: Trump Justice Department asks Supreme Court to reinstate trans military ban blocked by courts",
    "description": "President Donald Trump’s administration asked the U.S. Supreme Court on Thursday to reinstate his sweeping ban on transgender military service—just two days after Justice Department attorneys faced sharp skepticism from a federal appeals court panel in Washin…",
    "link": "https://www.advocate.com/news/doj-scotus-trans-military-ban",
    "timestamp": "2025-04-24T16:01:36Z"
  },
  {
    "title": "Pete Hegseth's wife Jennifer Rauchet receives a brutal nickname from Pentagon staff. Here's why",
    "description": "Amid the massive Signalgate chat leak controversy, US Defense Secretary Pete Hegseth's wife Jennifer Rauchet has found herself at the receiving end. It has now come to the fore that the staffers at the Pentagon have given her a brutal and shocking nickname du…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-pete-hegseths-wife-jennifer-rauchet-receives-a-brutal-nickname-yoko-ono-from-pentagon-staff-amid-signal-chat-leak-scandal/articleshow/120590654.cms",
    "timestamp": "2025-04-24T16:00:49Z"
  },
  {
    "title": "The 5 at 5: Thursday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-24-04-25-6686625-Apr2025/",
    "timestamp": "2025-04-24T16:00:38Z"
  },
  {
    "title": "Trump Prioritizes Flirting with Putin Over, You Know, Actual Peace in Ukraine",
    "description": "By blaming Ukraine for resisting a surrender disguised as peace, Trump is not only rewarding Russian aggression—he’s encouraging it worldwide.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-ukraine-plan",
    "timestamp": "2025-04-24T16:00:32Z"
  },
  {
    "title": "'Sorry': Trump nominee apologizes to Jewish newspaper for praising Nazi sympathizer",
    "description": "Interim U.S. Attorney for D.C. Edward Martin has apologized after praising a Nazi sympathizer and white supremacist.In an interview with Forward, which has a Jewish audience, Martin said he had not known about the background of Timothy Hale-Cusanelli when he …",
    "link": "https://www.rawstory.com/trump-nazi-2671839552/",
    "timestamp": "2025-04-24T16:00:23Z"
  },
  {
    "title": "GDP numbers to be reviewed after IMF revises forecast",
    "description": "PUTRAJAYA: Malaysia will relook its real gross domestic product (GDP) growth after the International Monetary Fund (IMF) revised the forecast for this year down from 4.7% to 4.1%, Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/25/gdp-numbers-to-be-reviewed-after-imf-revises-forecast",
    "timestamp": "2025-04-24T16:00:00Z"
  },
  {
    "title": "A dozen states sue Trump to halt tariffs",
    "description": "What happened\nTwelve states, led by Oregon, sued the Trump administration Wednesday in the U.S. Court of International Trade, seeking to halt tariffs they said were illegal, arbitrary and damaging to their economies. California filed its own lawsuit against P…",
    "link": "https://biztoc.com/x/cb431f1857ca4fd1",
    "timestamp": "2025-04-24T15:59:04Z"
  },
  {
    "title": "Metropolitan Museum of Art Director Max Hollein Says Trump Anti-DEI Push ‘Doesn’t Apply to Us’",
    "description": "Metropolitan Museum of Art director Max Hollein said Trump push to eliminate DEI programs will have no effect on institution.",
    "link": "https://www.artnews.com/art-news/news/metropolitan-museum-of-art-trump-dei-programs-1234739754/",
    "timestamp": "2025-04-24T15:58:32Z"
  },
  {
    "title": "A dozen states sue Trump to halt tariffs",
    "description": "The states sued in the US Court of International Trade, seeking to stop tariffs they say will damage their economies",
    "link": "https://theweek.com/politics/states-tariffs-trump-lawsuit",
    "timestamp": "2025-04-24T15:57:35Z"
  },
  {
    "title": "European carmakers on China charm offensive as sales droop",
    "description": "Once blithely dominant in China, European automakers are now launching full-fledged charm offensives at consumers in the world’s largest car market, seeking to claw back sales lost to domestic rivals. At this week’s Auto Shanghai, the largest global industry …",
    "link": "https://www.digitaljournal.com/world/european-carmakers-on-china-charm-offensive-as-sales-droop/article",
    "timestamp": "2025-04-24T15:57:32Z"
  },
  {
    "title": "Expert Who Uncovered Letitia James Fraud Allegations Releases New Documents",
    "description": "Sam Antar shared new documents showing James identified her Brooklyn property as a four-unit dwelling.",
    "link": "https://www.newsweek.com/letitia-james-fraud-accusations-documents-2063639",
    "timestamp": "2025-04-24T15:57:10Z"
  },
  {
    "title": "‘Is this a throwback to the McCarthy era?’ Judges consider injunction bids by firms targeted in Trump orders",
    "description": "Two federal judges sharply questioned a government lawyer Wednesday as they considered bids by Perkins Coie and Wilmer Cutler Pickering Hale and Dorr to permanently enjoin executive orders that target them and their clients.",
    "link": "https://www.abajournal.com/news/article/is-this-a-throwback-to-the-mccarthy-era-judges-consider-injunction-bids-by-law-firms-targeted-in-trump-orders",
    "timestamp": "2025-04-24T15:57:00Z"
  },
  {
    "title": "Billionaire Richard Branson's take on Trump's 'erratic' and 'catastrophic' tariffs",
    "description": "Virgin Group billionaire Richard Branson criticized Trump's \"erratic\" tariffs, urging a change in course to prevent uncertainty and economic damage.",
    "link": "https://www.businessinsider.com/richard-branson-calls-out-donald-trump-over-tariff-war-2025-4",
    "timestamp": "2025-04-24T15:53:31Z"
  },
  {
    "title": "Trump Team Sinks Even Lower With New Attack on Abrego Garcia’s Wife",
    "description": "Donald Trump’s administration is now attempting to smear the wife of Kilmar Abrego Garcia, the Maryland man deported to El Salvador due to an “administrative error.”\r\nDuring an interview on Newsmax’s Wake Up America Thursday, assistant secretary for the Depar…",
    "link": "https://newrepublic.com/post/194360/donald-trump-team-new-attack-kilmar-abrego-garcia-wife",
    "timestamp": "2025-04-24T15:52:04Z"
  },
  {
    "title": "Keeping Score: Bill Disenfranchising Women Voters Passes U.S. House, Heads to Senate; Barbara Lee Becomes Mayor of Oakland; Republicans Threaten SNAP and Medicaid",
    "description": "In every issue of Ms., we track research on our progress in the fight for equality, catalogue can’t-miss quotes from feminist voices and keep tabs on the feminist movement’s many milestones. We’re Keeping Score online, too—in this biweekly roundup.\nThis week:…",
    "link": "https://msmagazine.com/2025/04/24/keeping-score-feminist-news-save-act-women-voters-senate-barbara-lee-mayor-oakland-republicans-snap-medicaid/",
    "timestamp": "2025-04-24T15:50:53Z"
  },
  {
    "title": "Trump's Skin Returns To Normal Human Color After Ban On Artificial Dyes",
    "description": "WASHINGTON, D.C. — The leader of the free world was sporting a new look this morning, as witnesses noticed that President Donald Trump's skin had returned to normal human color just one day after HHS Secretary Robert F. Kennedy Jr. began phasing out artificia…",
    "link": "https://freerepublic.com/focus/f-chat/4312999/posts",
    "timestamp": "2025-04-24T15:49:19Z"
  },
  {
    "title": "Foreign Policy Experts Warn Against Attack on Iran’s Nuke Facilities",
    "description": "Some lawmakers are calling for President Donald Trump to help Israel strike Iran’s nuclear facilities even as foreign policy experts warn about the potential consequences... Read More\nThe post Foreign Policy Experts Warn Against Attack on Iran’s Nuke Faciliti…",
    "link": "https://www.dailysignal.com/2025/04/24/trump-officials-warn-against-attack-iran/",
    "timestamp": "2025-04-24T15:48:40Z"
  },
  {
    "title": "US to Demand Putin Accept Ukraine’s Right to Military Force",
    "description": "The US will demand that Russia accept Ukraine’s right to have its own army and defense industry as part of a peace agreement between Moscow and Kyiv, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/us-to-demand-putin-accept-ukraines-right-to-military-force",
    "timestamp": "2025-04-24T15:48:28Z"
  },
  {
    "title": "Germany sees zero growth in 2025, blames Trump tariffs",
    "description": "The German government cut its economic growth forecast to zero citing the impact of US President Donald Trump's trade policies .\n\"There is above all one reason for this, namely Donald Trump's trade policy and the effects of the trade policy on Germany,\" outgo…",
    "link": "https://biztoc.com/x/b4bebeae95864944",
    "timestamp": "2025-04-24T15:47:40Z"
  },
  {
    "title": "Trump Says Could Meet Putin 'Shortly After' Upcoming Middle East Trip",
    "description": "Trump Says Could Meet Putin 'Shortly After' Upcoming Middle East Trip\n \nPresident Donald Trump has said he could meet with Russia's Vladimir Putin shortly after his upcoming trip to the Middle East in May, where's he expected to visit Saudi Arabia, Qatar and …",
    "link": "https://biztoc.com/x/22afec97abdca223",
    "timestamp": "2025-04-24T15:47:37Z"
  },
  {
    "title": "Trump’s Russia-Ukraine war negotiation strategy is incredibly unusual — and not in a good way",
    "description": "Ukrainian President Volodymyr Zelenskyy meeting with US President Donald Trump in the Oval Office of the White House on Friday, Feb. 28, 2025.",
    "link": "https://biztoc.com/x/39b064ca9f410a44",
    "timestamp": "2025-04-24T15:47:35Z"
  },
  {
    "title": "Trump blames Zelenskyy for peace deal setbacks",
    "description": "What happened\nPresident Donald Trump Wednesday criticized Ukrainian President Volodymyr Zelenskyy for rejecting elements of a \"final\" U.S. peace plan presented to Kyiv and Moscow last week. Vice President J.D. Vance, traveling in India, said Trump's \"very exp…",
    "link": "https://biztoc.com/x/43821a85108b0b08",
    "timestamp": "2025-04-24T15:47:14Z"
  },
  {
    "title": "Germany expects zero growth in 2025, blames Trump tariffs",
    "description": "Germany was the only G7 economy that failed to grow for the last two years, and is on track for a third year without growth in 2025.",
    "link": "https://www.dw.com/en/germany-expects-zero-growth-in-2025-blames-trump-tariffs/a-72338707",
    "timestamp": "2025-04-24T15:47:00Z"
  }
]