[
  {
    "title": "Democratic Senate primary erupts after candidate accused of ‘mediocre Black man’ remark",
    "description": "Texas Democratic Senate primary erupts as James Talarico is accused of calling former rival Colin Allred a \"mediocre Black man\" in private conversation.",
    "link": "https://www.foxnews.com/politics/democratic-senate-primary-erupts-after-candidate-accused-mediocre-black-man-remark",
    "timestamp": "2026-02-03T16:20:26Z"
  },
  {
    "title": "'Historic', 'very positive', 'quiet diplomacy': Ex-Indian envoys hail India-US trade deal",
    "description": "India and the United States have reached a significant trade agreement. Washington will lower tariffs on Indian products to 18 percent. Former diplomats have welcomed this development, calling it a positive step. This deal is expected to boost Indian exports …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/historic-very-positive-quiet-diplomacy-ex-indian-envoys-hail-india-us-trade-deal/articleshow/127890234.cms",
    "timestamp": "2026-02-03T16:20:21Z"
  },
  {
    "title": "Trump says India will stop buying Russian oil. Shadow fleet vessels are still unloading sanctioned crude at its ports",
    "description": "President Trump says India will stop buying sanctioned Russian oil as part of trade deal, but data shows shadow fleet vessels unloading the crude at its ports.",
    "link": "https://www.cnbc.com/2026/02/03/russian-oil-sanctions-trump-us-india-trade-deal.html",
    "timestamp": "2026-02-03T16:19:51Z"
  },
  {
    "title": "Twists and turns in our ties with America",
    "description": "Trade deal: We can spin it like a top but the fact remains: Trump has got what he wanted",
    "link": "https://www.thehindubusinessline.com/opinion/twists-and-turns-in-our-ties-with-america/article70588662.ece",
    "timestamp": "2026-02-03T16:19:01Z"
  },
  {
    "title": "India to restrict Russian oil buy, import only where supplies are irreplaceable: Sources",
    "description": "India will reduce its purchases of Russian crude oil. This is part of a new trade agreement with the United States. The deal lowers tariffs on Indian goods entering the US. In return, India will buy more US energy and other products. Refiners will continue cu…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-to-restrict-russian-oil-buy-import-only-where-supplies-are-irreplaceable-sources/articleshow/127890169.cms",
    "timestamp": "2026-02-03T16:17:05Z"
  },
  {
    "title": "NRA Claps Back at Jeanine Pirro, Pushes Bill to Legally Carry a Gun in DC",
    "description": "“And you bring a gun into the district, you mark my words, you’re going to jail,” Pirro insisted during an appearance on Fox News Monday.\nThe post NRA Claps Back at Jeanine Pirro, Pushes Bill to Legally Carry a Gun in DC first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/nra-claps-back-at-jeanine-pirro-pushes-bill-to-legally-carry-a-gun-in-dc/",
    "timestamp": "2026-02-03T16:17:04Z"
  },
  {
    "title": "Meet the Palm Beach billionaire who paid $2 million for a private White House visit with Trump",
    "description": "Herbert Wertheim won a Mar-a-Lago charity auction, reigniting ethics debates over Trump's closeness to donors.",
    "link": "https://fortune.com/2026/02/03/herbert-wertheim-2-million-dollar-bid-trump-meeting/",
    "timestamp": "2026-02-03T16:14:44Z"
  },
  {
    "title": "EU reiterates support for Greenland, Denmark amid uncertainty",
    "description": "OSLO, Feb. 3 (Xinhua) -- European Union (EU) High Representative for Foreign Affairs and Security Policy Kaja Kallas on Tuesday reiterated the EU's support for Greenland and Denmark amid uncertainty. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/04/eu-reiterates-support-for-greenland-denmark-amid-uncertainty",
    "timestamp": "2026-02-03T16:14:00Z"
  },
  {
    "title": "Migrant Encounters at Border Hit Historic Low Not Seen Since Nixon Administration",
    "description": "The Trump administration has transformed the situation along the Mexican border, as shown by Border Patrol data.",
    "link": "https://www.westernjournal.com/migrant-encounters-ay-border-hit-historic-low-not-seen-since-nixon-administration/",
    "timestamp": "2026-02-03T16:13:32Z"
  },
  {
    "title": "CNN’s Harry Enten Torpedoes Schumer’s Claim Voter ID Is ‘Jim Crow’ Legislation: ‘The American People Are With Nicki Minaj!’",
    "description": "Sen. Chuck Schumer (D-NY) may believe voter ID laws are racist — but most Americans do not agree with him, CNN chief data analyst Harry Enten showed on Tuesday. \nThe post CNN’s Harry Enten Torpedoes Schumer’s Claim Voter ID Is ‘Jim Crow’ Legislation: ‘The Ame…",
    "link": "https://www.mediaite.com/media/tv/cnns-harry-enten-torpedoes-schumers-claim-voter-id-is-jim-crow-legislation-the-american-people-are-with-nicki-minaj/",
    "timestamp": "2026-02-03T16:11:09Z"
  },
  {
    "title": "Insecurity: US lawmaker, Plateau gov discuss US-Nigeria ties",
    "description": "A US lawmaker and Plateau State’s governor discuss deepening US-Nigeria ties to address insecurity and the persecution of Christians in the Middle Belt.\n\nRead More: https://punchng.com/insecurity-us-lawmaker-plateau-gov-discuss-us-nigeria-ties/",
    "link": "https://punchng.com/insecurity-us-lawmaker-plateau-gov-discuss-us-nigeria-ties/",
    "timestamp": "2026-02-03T16:08:05Z"
  },
  {
    "title": "Hulk Actor Mark Ruffalo Responds To Reports He's Been Fired By Disney Following Anti-Trump Comments",
    "description": "Spider-Man: Brand New Day star Mark Ruffalo has responded to claims that Disney has fired him from his role as The Hulk following his recent anti-Trump and anti-ICE remarks.",
    "link": "https://comicbookmovie.com/avengers/avengers-doomsday/hulk-actor-mark-ruffalo-responds-to-reports-hes-been-fired-by-disney-following-anti-trump-comments-a226217",
    "timestamp": "2026-02-03T16:06:00Z"
  },
  {
    "title": "States scramble to gerrymander US House districts after Trump sought edge in midterm elections",
    "description": "Republicans and Democrats in some states are redrawing U.S. House districts to gain an advantage in the upcoming midterm elections",
    "link": "https://abcnews.go.com/Politics/wireStory/states-scramble-gerrymander-us-house-districts-after-trump-129816609",
    "timestamp": "2026-02-03T16:05:47Z"
  },
  {
    "title": "India has secured a better trade deal with the US than competitors: Goyal",
    "description": "India secures a favorable trade deal with the US, reducing tariffs to 18%, boosting exporters and stock market confidence.",
    "link": "https://www.thehindubusinessline.com/economy/india-has-secured-a-better-trade-deal-with-the-us-than-competitors-goyal/article70588533.ece",
    "timestamp": "2026-02-03T16:03:55Z"
  },
  {
    "title": "Top Business & Market Headlines Today — BL Morning Report, Feb 04, 2026",
    "description": "BL Morning Report February 04, 2026: Get today’s top business news, market headlines about the Stock Market, Sensex & Nifty trends, key market insights, economic highlights, and the latest updates from India and global markets.",
    "link": "https://www.thehindubusinessline.com/multimedia/audio/bl-morning-report-february-04-2026/article70587731.ece",
    "timestamp": "2026-02-03T16:02:57Z"
  },
  {
    "title": "Senate GOP Bets On Ex-Sports Broadcaster To Flip Minnesota — Local Republicans Aren’t Buying It",
    "description": "Local party activists are bristling over the GOP establishment's swift endorsement of former NFL sideline reporter Michele Tafoya's Senate campaign in Minnesota",
    "link": "https://dailycaller.com/2026/02/03/michele-tafoya-minnesota-senate-donald-trump-abortion-tina-smith/",
    "timestamp": "2026-02-03T16:01:53Z"
  },
  {
    "title": "World Liberty launches $3.4B stablecoin: How it fits into onchain credit systems",
    "description": "World Liberty’s $3.4-billion USD1 stablecoin enters onchain lending. Learn how stablecoins are powering decentralized credit and crypto borrowing markets.",
    "link": "https://cointelegraph.com/news/world-liberty-launches-3-4b-stablecoin-how-it-fits-into-onchain-credit-systems",
    "timestamp": "2026-02-03T16:01:04Z"
  },
  {
    "title": "Winter Olympics does not need Donald Trump’s extra ICE – Oliver Brown",
    "description": "OPINION: Italian leaders from left and centre denounce ICE as a violent militia.",
    "link": "https://www.nzherald.co.nz/sport/opinion-winter-olympics-does-not-need-donald-trumps-extra-ice/MRZ2OOVEA5HRDEPPKZEWC6BZEA/",
    "timestamp": "2026-02-03T16:01:00Z"
  },
  {
    "title": "Trump to Lower Tariffs as India ‘Agrees’ to Ditch Russia, Buy Oil from the U.S. and Venezuela",
    "description": "President Trump: Prime Minister Modi \"agreed to stop buying Russian Oil, and to buy much more from the United States and, potentially, Venezuela.\"\nThe post Trump to Lower Tariffs as India ‘Agrees’ to Ditch Russia, Buy Oil from the U.S. and Venezuela first app…",
    "link": "https://legalinsurrection.com/2026/02/trump-to-lower-tariffs-as-india-agrees-to-ditch-russia-buy-oil-from-the-u-s-and-venezuela/",
    "timestamp": "2026-02-03T16:00:30Z"
  },
  {
    "title": "Trump to close Kennedy Center two years",
    "description": "As you likely know, last year, Trump fired all of the board of the prestigious Kennedy center and installed his own handpicked board. that board then made Trump himself chairman. Trump then renamed the center the Donald J. Trump - John F. Kennedy center for t…",
    "link": "https://www.punknews.org/article/87476/trump-to-close-kennedy-center-two-years",
    "timestamp": "2026-02-03T16:00:01Z"
  },
  {
    "title": "A gay whistleblower just punked Colorado’s DEI machine",
    "description": "In the comic books, Galactus devours worlds without discrimination. In real life, that role belongs to the Democratic Party.You can see it play out in Minneapolis right now. Colorado offers its own case study. That’s where Rich Guggenheim is under attack insi…",
    "link": "https://www.theblaze.com/columns/opinion/a-gay-whistleblower-just-punked-colorados-dei-machine",
    "timestamp": "2026-02-03T16:00:00Z"
  },
  {
    "title": "Letters: When ageing leaders put nations at risk",
    "description": "OPINION: Global health, protest rights, environmental protection and public funding.",
    "link": "https://www.nzherald.co.nz/nz/letters-when-ageing-leaders-put-nations-at-risk/premium/SPGIIPSKGNANVE5WQBR4YSCYA4/",
    "timestamp": "2026-02-03T16:00:00Z"
  },
  {
    "title": "Analysis: Winston Peters meets Germany’s foreign minister in Northland - and their Pacific deal",
    "description": "David Fisher: Meeting between NZ and Germany sees shaping of a new global order.",
    "link": "https://www.nzherald.co.nz/nz/politics/analysis-winston-peters-meets-germanys-foreign-minister-in-northland-and-their-pacific-deal/premium/LGFZOMQLFZG7NKH2KNU72ZS4H4/",
    "timestamp": "2026-02-03T16:00:00Z"
  },
  {
    "title": "Community voices: Read recent letter to the editor submissions for the Billings Gazette",
    "description": "From ICE and the Constitutional rights, to the YAM and calls to Montana leaders, here's what your friends, neighbors and community had to say in recent letters to the editor.",
    "link": "https://billingsgazette.com/news/local/column/article_1c938089-6601-4e1b-a7cf-97b465043c61.html",
    "timestamp": "2026-02-03T16:00:00Z"
  },
  {
    "title": "Jon Stewart Breaks Silence After His Name Pops Up In The Epstein Files",
    "description": "Jon Stewart addressed his appearance in the Epstein files while slamming the lack of accountability.",
    "link": "https://www.boredpanda.com/jon-stewart-breaks-silence-after-his-name-pops-up-in-the-epstein-files/",
    "timestamp": "2026-02-03T15:59:51Z"
  },
  {
    "title": "Dirty Game: Don Lemon Says He Offered To Turn Himself In Before Arrest, Alleges Gov’t Wanted Public Embarrassment",
    "description": "The United States government, at the behest of Donald Trump, chose political revenge theater over protocol when arresting former CNN news anchor and now-independent journalist Don Lemon. Journalists are still reeling and repulsed by the idea that Lemon would …",
    "link": "https://bossip.com/4339310/don-lemon-on-jimmy-kimmel-live/",
    "timestamp": "2026-02-03T15:58:43Z"
  },
  {
    "title": "'It's Really Bad': Giuliani Won't Say Why Trump Didn't Call Police After Epstein Assault 'Nice And Slow': Trump Bizarrely Rants About Airplane Stairs When Asked About Policy",
    "description": "Rudy Giuliani revealed that he had investigated President Donald Trump's history with Jeffrey Epstein but had no evidence that the police were called after a masseuse was allegedly assaulted by the sex offender at Mar-a-Lago.\n\n\n\"I'll tell you a little about E…",
    "link": "https://crooksandliars.com/2026/02/its-really-bad-giuliani-wont-say-why-trump",
    "timestamp": "2026-02-03T15:58:29Z"
  },
  {
    "title": "'Nice And Slow': Trump Bizarrely Rants About Airplane Stairs When Asked About Policy",
    "description": "President Donald Trump unleashed a rant about risky airplane stairs after he was asked to explain his so-called Donroe Doctrine foreign policy.\n\n\nDuring a Monday interview on The Dan Bongino Show, the host asked the president for his take on the Monroe Doctri…",
    "link": "https://crooksandliars.com/2026/02/nice-and-slow-trump-bizarrely-rants-about",
    "timestamp": "2026-02-03T15:58:17Z"
  },
  {
    "title": "IndyCar legend Dario Franchitti to race NASCAR Truck at St. Pete",
    "description": "The IndyCar legend will take on the NASCAR Truck Series at a very familiar circuit",
    "link": "https://www.motorsport.com/nascar-truck/news/indycar-legend-dario-franchitti-to-run-nascar-truck-race-at-st-pete/10795036/",
    "timestamp": "2026-02-03T15:57:34Z"
  },
  {
    "title": "Nicki Minaj Responds To Trevor Noah’s Grammys Jokes",
    "description": "Nicki Minaj Responds To Trevor Noah’s Grammys Jokeslittlethings.com",
    "link": "https://littlethings.com/entertainment/nicki-minaj-responds-trevor-noah-grammys",
    "timestamp": "2026-02-03T15:55:54Z"
  },
  {
    "title": "Disney taps parks head Josh D'Amaro as CEO to lead post-Bob Iger era",
    "description": "Walt Disney has appointed Josh D'Amaro as its new CEO. D'Amaro, a long-time insider, takes over from Bob Iger on March 18.  He leads the company's profitable theme parks division.  The media industry faces challenges from AI and consolidation.  Dana Walden is…",
    "link": "https://economictimes.indiatimes.com/news/international/business/disney-taps-parks-head-josh-damaro-as-ceo-to-lead-post-bob-iger-era/articleshow/127889798.cms",
    "timestamp": "2026-02-03T15:55:48Z"
  },
  {
    "title": "Newly released Epstein files reveal further ties to Israel",
    "description": "The release of more Jeffrey Epstein files reveals further connections between the late, convicted sex criminal and the state of Israel.",
    "link": "https://mondoweiss.net/2026/02/newly-released-epstein-files-reveal-further-ties-to-israel/",
    "timestamp": "2026-02-03T15:54:23Z"
  },
  {
    "title": "Iran opens door to talks with US",
    "description": "Iran has signaled that it’s open to US talks while maintaining that it does not seek nuclear weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631912-iran-us-talks-nuclear-deal/",
    "timestamp": "2026-02-03T15:54:04Z"
  },
  {
    "title": "Trump’s Kennedy Center closure plan draws ire",
    "description": "Trump said he will close the center for two years for ‘renovations’",
    "link": "https://theweek.com/politics/trump-kennedy-center-closure-ire",
    "timestamp": "2026-02-03T15:52:09Z"
  },
  {
    "title": "Thane gets its fifth woman mayor",
    "description": "Thane: Sharmila Pimplolkar of the Shiv Sena was declared the 23rd mayor of Thane on Tuesday, becoming the fifth woman to assume the post in the histor.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/thane-gets-its-fifth-woman-mayor/articleshow/127889741.cms",
    "timestamp": "2026-02-03T15:51:53Z"
  },
  {
    "title": "House to hold votes on funding package to end partial government shutdown",
    "description": "The House will hold votes on Tuesday to try to reopen the government after it partially shut down over the weekend.",
    "link": "https://abcnews.go.com/Politics/house-hold-votes-funding-end-partial-government-shutdown/story?id=129813498",
    "timestamp": "2026-02-03T15:48:32Z"
  },
  {
    "title": "New Epstein Files Appear to Show Andrew Mountbatten-Windsor Crouched Over Woman on Floor",
    "description": "Also in the Epstein files dump: An email exchange in which Jeffrey Epstein was seemingly invited to dinner at Buckingham Palace.",
    "link": "https://www.vanityfair.com/news/story/new-epstein-files-appear-to-show-andrew-mountbatten-windsor-crouched-over-woman-on-floor",
    "timestamp": "2026-02-03T15:48:11Z"
  },
  {
    "title": "Bitcoin price (BTC USD) could crash to $10,000 as markets face 2008-style turmoil, Bloomberg analyst warns",
    "description": "Bitcoin BTC USD price crash prediction: Bloomberg analyst Mike McGlone warns that Bitcoin's price may crash to $10,000, reflecting significant losses amid broad market fears reminiscent of the 2008 financial crisis. As Bitcoin experiences recent declines, inv…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bitcoin-price-btc-usd-could-crash-to-10000-as-markets-face-2008-style-turmoil-bloomberg-analyst-warns/articleshow/127889017.cms",
    "timestamp": "2026-02-03T15:46:40Z"
  },
  {
    "title": "Walmart’s market value hits $1tn",
    "description": "US retail giant joins club dominated by tech groups",
    "link": "https://www.irishtimes.com/business/2026/02/03/walmarts-market-value-hits-1tn/",
    "timestamp": "2026-02-03T15:46:12Z"
  },
  {
    "title": "While the photo in the tub has gone viral, the Clintons have agreed to testify.",
    "description": "Former US President Bill Clinton and his wife, former Secretary of State Hillary Clinton, have agreed to testify before the congressional inquiry into sex offender Jeffrey Epstein. This decision was announced a few days before legal action was to be taken aga…",
    "link": "https://english.gossiplankanews.com/2026/02/while-photo-in-tub-has-gone-viral.html",
    "timestamp": "2026-02-03T15:45:19Z"
  },
  {
    "title": "NFL Commissioner Goodell Again Sides Against NFL Fans Who Love America – Backs Bad Bunny",
    "description": "NFL Commissioner Roger Goodell again sides against NFL fans who love America.  The NFL has a history of tough US football players who gave their all for their teams and … Read more\nThe post NFL Commissioner Goodell Again Sides Against NFL Fans Who Love Americ…",
    "link": "https://joehoft.com/nfl-commissioner-goodell-again-sides-against-nfl-fans-who-love-america-backs-bad-bunny/",
    "timestamp": "2026-02-03T15:45:00Z"
  },
  {
    "title": "Oops! Trump Official Says “Mistakes” Happened With Epstein Redactions",
    "description": "Deputy Attorney General Todd Blanche couldn’t care less about exposing the survivors of Jeffrey Epstein’s abuse. Don’t believe us? Listen for yourself. During an interview on Fox News Monday, Blanche was asked to answer for the thousands of redaction errors i…",
    "link": "https://newrepublic.com/post/206075/donald-trump-official-mistakes-epstein-redactions",
    "timestamp": "2026-02-03T15:44:57Z"
  },
  {
    "title": "NATO scrambles fighters as Russia launches major strike on Ukrainian energy targets",
    "description": "Ukrainian President Volodymyr Zelenskyy urged \"maximum pressure\" on Russia after Moscow fired hundreds of drones and missiles into Ukraine.",
    "link": "https://abcnews.go.com/International/russia-hits-ukraine-energy-targets-hundreds-drones-missiles/story?id=129805309",
    "timestamp": "2026-02-03T15:44:12Z"
  },
  {
    "title": "Trump hosts Colombia’s Petro just weeks after insulting him as a ‘sick man’ fueling the drug trade",
    "description": "The meeting comes weeks after Trump accused Petro of pumping cocaine into the United States.",
    "link": "https://www.bostonherald.com/2026/02/03/trump-hosts-colombia-president-petro/",
    "timestamp": "2026-02-03T15:43:20Z"
  },
  {
    "title": "“renovations”",
    "description": "Donald Trump has announced that he is closing the Kennedy Center — pardon me, the Trump Kennedy Center — for two years starting this July. This is for necessary renovations, he says. He also says he’s awaiting approval from the board. The president said that …",
    "link": "https://freethoughtblogs.com/pharyngula/2026/02/03/renovations/",
    "timestamp": "2026-02-03T15:43:19Z"
  },
  {
    "title": "Trump's ‘weaponization czar’ demoted at DOJ",
    "description": "Ed Martin lost his title as assistant attorney general",
    "link": "https://theweek.com/politics/trump-weaponization-czar-ed-martin-demoted-doj",
    "timestamp": "2026-02-03T15:42:57Z"
  },
  {
    "title": "Roger Goodell Doesn’t Expect Bad Bunny to Get Political During Super Bowl Halftime Show",
    "description": "The NFL Commissioner believes Bad Bunny understands \"this platform is used to unite people.\"\nRoger Goodell Doesn’t Expect Bad Bunny to Get Political During Super Bowl Halftime Show\nEddie Fu",
    "link": "https://consequence.net/2026/02/roger-goodell-bad-bunny-super-bowl-halftime-show-politics/",
    "timestamp": "2026-02-03T15:42:09Z"
  },
  {
    "title": "'Absolute collapse of MAGA' has left surprise state up for grabs: strategist",
    "description": "The apparent collapse of MAGA and support for President Donald Trump in parts of Florida has left it wide open for the Democratic Party, insiders believe.Ryan Ray, who chairs the Leon County Democratic Party, argued a change in mood, as well as infighting in …",
    "link": "https://www.rawstory.com/florida-midterms/",
    "timestamp": "2026-02-03T15:41:48Z"
  },
  {
    "title": "Marjorie Taylor Greene Takes a Flamethrower to Trump and ‘Weak Republicans’ for His Attack on Rep. Massie’s Wife",
    "description": "Rep. Marjorie Taylor Greene (R-GA) took a metaphorical flamethrower to President Donald Trump for a post he wrote attacking Rep. Thomas Massie's (R-KY) wife.\nThe post Marjorie Taylor Greene Takes a Flamethrower to Trump and ‘Weak Republicans’ for His Attack o…",
    "link": "https://www.mediaite.com/politics/marjorie-taylor-greene-takes-a-flamethrower-to-trump-and-weak-republicans-for-his-attack-on-rep-massies-wife/",
    "timestamp": "2026-02-03T15:41:38Z"
  },
  {
    "title": "Trump Is Dragging World Toward a New Nuclear Arms Race",
    "description": "Among the critical issues facing our country today, nuclear arms control is seldom top of mind for most people, understandably, given our myriad political, social and economic crises. Recent books and films such as Annie Jacobsen’s 2004 non-fiction tome Nucle…",
    "link": "https://www.commondreams.org/opinion/trump-putin-nuclear-start-treaty",
    "timestamp": "2026-02-03T15:40:14Z"
  },
  {
    "title": "10 Years of Trump, and the Alarm Keeps Going Off (The Bulwark)",
    "description": "The Bulwark:\n10 Years of Trump, and the Alarm Keeps Going Off  —  Every day of the past decade has felt like Groundhog Day.  —  Marjorie Taylor Greene's populist insurgency against Donald Trump continues!  The former congresswoman told a radio interviewer yes…",
    "link": "https://www.memeorandum.com/260203/p46",
    "timestamp": "2026-02-03T15:40:00Z"
  },
  {
    "title": "Politics, Not Barrels, Are Driving Oil Again",
    "description": "Oil markets remain hostage to Trump-driven uncertainty, as mixed signals on India’s stance toward Russian crude collide with renewed speculation around U.S.–Iran nuclear talks. Could Oil Be Back in Vogue? - 2026 was dubbed the year of oversupply, however Janu…",
    "link": "https://oilprice.com/Energy/Energy-General/Politics-Not-Barrels-Are-Driving-Oil-Again.html",
    "timestamp": "2026-02-03T15:40:00Z"
  },
  {
    "title": "David Rosenberg: Don’t give up on gold yet, this bull market could peak at $12,000",
    "description": "There's a reason gold has tripled since the beginning of Donald Trump’s first term. Gold loves policy chaos, and so does Trump",
    "link": "https://financialpost.com/investing/gold-bull-market-could-peak-12000-david-rosenberg",
    "timestamp": "2026-02-03T15:38:55Z"
  },
  {
    "title": "US said to have accepted India’s position on GM crops in lieu of concession on apples, nuts",
    "description": "Along with the Commerce Minister Piyush Goyal’s assertion on no compromise on sensitive sectors, businessline has reliably learnt that the redline on GM soya and maize has not been crossed",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/us-said-to-have-accepted-indias-position-on-gm-crops-in-lieu-of-concession-on-apples-nuts/article70588101.ece",
    "timestamp": "2026-02-03T15:37:16Z"
  },
  {
    "title": "MS NOW’s Rachel Maddow Gloats Over Resistance to ‘Trump Prison Camps’ in ‘Deep Red’ Trump Country",
    "description": "MS NOW host Rachel Maddow gloated over successful resistance to \"Trump prison camps\" in \"deep, deep red\" areas that President Donald Trump won by large margins.\nThe post MS NOW’s Rachel Maddow Gloats Over Resistance to ‘Trump Prison Camps’ in ‘Deep Red’ Trump…",
    "link": "https://www.mediaite.com/media/tv/ms-nows-rachel-maddow-gloats-over-resistance-to-trump-prison-camps-in-deep-red-trump-country/",
    "timestamp": "2026-02-03T15:36:45Z"
  },
  {
    "title": "WATCH LIVE: House holds key procedural vote on government funding to end partial shutdown",
    "description": "Speaker Mike Johnson's ability to carry out President Donald Trump's \"play call\" for funding the government will be put to the test on Tuesday as the House holds a procedural vote on a bill to end the partial shutdown.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-house-holds-key-procedural-vote-on-government-funding-to-end-partial-shutdown",
    "timestamp": "2026-02-03T15:36:16Z"
  },
  {
    "title": "Disney Stock Dips as Josh D’Amaro Crowned CEO",
    "description": "Shares of the entertainment giant, which fell 1.5% on Tuesday, are down 9.7% in the past year and 43% in the past five years\nThe post Disney Stock Dips as Josh D’Amaro Crowned CEO appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/business/disney-ceo-josh-damaro-stock-reaction/",
    "timestamp": "2026-02-03T15:36:12Z"
  },
  {
    "title": "‘Bring It On’: Michael Wolff Dares Trump to Sue Over Epstein – Teases Discovery Threat",
    "description": "Over the weekend Trump threatened legal action against Wolff, arguing he \"conspired\" with Epstein to \"damage\" his reputation and presidency.\nThe post ‘Bring It On’: Michael Wolff Dares Trump to Sue Over Epstein – Teases Discovery Threat first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/bring-it-on-michael-wolff-dares-trump-to-sue-over-epstein-teases-discovery-threat/",
    "timestamp": "2026-02-03T15:34:18Z"
  },
  {
    "title": "Gabbard faces questions on vote raid, secret complaint",
    "description": "This comes as Trump has pushed Republicans to ‘take over’ voting",
    "link": "https://theweek.com/politics/tulsi-gabbard-questions-vote-raid-complaint",
    "timestamp": "2026-02-03T15:33:29Z"
  },
  {
    "title": "Iran: Witnesses describe violence, chaos during protests",
    "description": "In an exclusive report from inside Iran, witnesses told DW how recent mass demonstrations escalated into deadly clashes.",
    "link": "https://www.dw.com/en/iran-witnesses-describe-violence-chaos-during-protests/a-75786890",
    "timestamp": "2026-02-03T15:33:00Z"
  },
  {
    "title": "Gavin Newsom attacks Trump’s wildfire rebuild order in bizarre rant: ‘Piss on the grasshoppers to hear them sing’",
    "description": "Gavin Newsom went on a rant over President Donald Trump's executive order to speed up the LA wildfire rebuilding effort.",
    "link": "https://nypost.com/2026/02/03/us-news/gavin-newsom-attacks-trumps-order-to-ramp-up-la-wildfire-rebuild/",
    "timestamp": "2026-02-03T15:32:52Z"
  },
  {
    "title": "China warns Panama of ‘heavy prices’ to pay after CK Hutchison contract quashed",
    "description": "BEIJING, Feb 3 (Reuters) - China warned Panama on Tuesday there would be “heavy prices” to pay after a court ruling there annulled Hong Kong-based CK Hutchison’s contract… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/03/china-warns-panama-of-heavy-prices-to-pay-after-ck-hutchison-contract-quashed",
    "timestamp": "2026-02-03T15:30:51Z"
  },
  {
    "title": "WHO appeals for Sh129 billion for world's worst health crises in 2026",
    "description": "WHO appeals for Sh 129 billion to tackle health crises this year across the world's 36 most severe emergencies, including in Gaza, Sudan, Haiti and the Democratic Republic of Congo.",
    "link": "https://www.standardmedia.co.ke/africa/article/2001540007/who-appeals-for-sh129-billion-for-worlds-worst-health-crises-in-2026",
    "timestamp": "2026-02-03T15:30:44Z"
  },
  {
    "title": "STT Hike On F&O Aimed At Curbing 'Satta' Trade, Not Revenue Raising Exercise: FM",
    "description": "Quoting a study, she told PTI Videos in an interview that more than 90% of people entering the F&amp;O market had lost huge money.",
    "link": "https://www.ndtvprofit.com/markets/stt-hike-on-f-o-aimed-at-curbing-satta-trade-not-revenue-raising-exercise-fm-10940143",
    "timestamp": "2026-02-03T15:30:19Z"
  },
  {
    "title": "A single Trump announcement sparks billions in losses across gold and silver",
    "description": "Trump's nomination of Kevin Warsh to lead the Federal Reserve has triggered a massive gold and silver selloff, erasing billions as markets react to policy shift.",
    "link": "https://www.foxnews.com/politics/single-trump-announcement-sparks-billions-losses-across-gold-silver",
    "timestamp": "2026-02-03T15:29:20Z"
  },
  {
    "title": "Kiev’s European backers preparing for talks with Putin – Macron",
    "description": "French President Emmanuel Macron has said Ukraine’s European backers are preparing for talks with Russian President Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631916-macron-putin-eu-talks/",
    "timestamp": "2026-02-03T15:28:49Z"
  },
  {
    "title": "Jeanine Pirro Takes Fire After Second Amendment Comments",
    "description": "D.C. US Attorney Jeanine Pirro came under fire after she said anyone who carried a firearm in the nation’s capital should “count on going to jail.”",
    "link": "https://dailycaller.com/2026/02/03/jeanine-pirro-takes-fire-after-2a-comments/",
    "timestamp": "2026-02-03T15:28:06Z"
  },
  {
    "title": "Trump and the Arts — Take 2: Jimmy Kimmel on the Kennedy Center Shutdown",
    "description": "As a sequel to my NPR show on Donald Trump’s incursions at the Kennedy Center, the NEH, and the NEA, here’s something Jimmy Kimmel said on TV the other night: Trump says he’s closing the Kennedy center for roughly two years, so it can be rebuilt into the fine…",
    "link": "https://www.artsjournal.com/uq/2026/02/trump-and-the-arts-take-2-jimmy-kimmel-on-the-kennedy-center-shutdown.html",
    "timestamp": "2026-02-03T15:25:52Z"
  },
  {
    "title": "TIPP Poll: Trump Approval Tough but Independents Grow",
    "description": "President Donald Trump's favorability ratings remain stagnant as he enters the 13th month of his second term, according to an I&I/TIPP poll. The poll, conducted at the end of January, found 41% of voters view Trump favorably, while 50% rated him unfavorably.L…",
    "link": "https://freerepublic.com/focus/f-news/4365262/posts",
    "timestamp": "2026-02-03T15:22:06Z"
  },
  {
    "title": "CNN panel erupts after guest calls out 'Hollywood jacka----' over political lectures at award shows",
    "description": "A CNN panel debated celebrity political commentary in Grammy Award speeches, as a Republican panelist slammed \"Hollywood jacka----\" telling people what to think.",
    "link": "https://www.foxnews.com/media/cnn-panel-erupts-after-guest-calls-out-hollywood-jacka-over-political-lectures-award-shows",
    "timestamp": "2026-02-03T15:21:22Z"
  },
  {
    "title": "‘Relief for our exporters’: Omar Abdullah welcomes US’ tariff cut on Indian goods",
    "description": "JAMMU: Jammu and Kashmir Chief Minister Omar Abdullah on Tuesday welcomed the US government’s decision to bring down reciprocal tariffs on Indian goods, saying this would bring relief to many exporters in the country who were facing difficulties in view of th…",
    "link": "https://statetimes.in/relief-for-our-exporters-omar-abdullah-welcomes-us-tariff-cut-on-indian-goods/",
    "timestamp": "2026-02-03T15:21:11Z"
  },
  {
    "title": "US-India trade deal: Rupee has its best trading session in seven years; gains over 100 paise vs dollar",
    "description": "The Indian currency (INR) appreciated about 1.4% to close at 90.2650 per US Dollar (USD), up about 125 paise as compared with the previous close of 91.5125",
    "link": "https://www.thehindubusinessline.com/markets/forex/us-india-trade-deal-rupee-has-its-best-trading-session-in-seven-years-gains-over-100-paise-vs-dollar/article70588116.ece",
    "timestamp": "2026-02-03T15:20:00Z"
  },
  {
    "title": "WSJ Anonymous Hit Piece On Gabbard Is Based On Complaints That ‘Weren’t Credible’",
    "description": "'Here’s the truth: There was no wrongdoing by @DNIGabbard, a fact that WSJ conveniently buried 13 paragraphs down,' a DNI official said.",
    "link": "https://thefederalist.com/2026/02/03/wsj-anonymous-hit-piece-on-gabbard-is-based-on-complaints-that-werent-credible/",
    "timestamp": "2026-02-03T15:18:00Z"
  },
  {
    "title": "Why Canada must step up to protect children in a period of global turmoil",
    "description": "Violence against children is a global crisis. States must take urgent action to prevent it or the cost will continue to impact communities around the world.",
    "link": "https://theconversation.com/why-canada-must-step-up-to-protect-children-in-a-period-of-global-turmoil-274398",
    "timestamp": "2026-02-03T15:16:03Z"
  },
  {
    "title": "Markets jump 2.5% as US trade deal boosts sentiment",
    "description": "Before Indian markets opened in the morning, American Depository Receipts (ADRs) of Indian companies listed on US exchanges had surged as investors cheered the late Monday announcement of a trade deal.",
    "link": "https://indianexpress.com/article/business/markets-jump-us-india-trade-deal-10511740/",
    "timestamp": "2026-02-03T15:15:27Z"
  },
  {
    "title": "Trump–Kennedy Center details massive repairs, warns venue won’t survive without fixes",
    "description": "Trump-Kennedy Center renovations will close Washington's performing arts venue for two years starting July 4 to address $250 million in deferred maintenance.",
    "link": "https://www.foxnews.com/politics/trump-kennedy-center-details-massive-repairs-warns-venue-wont-survive-without-fixes",
    "timestamp": "2026-02-03T15:15:19Z"
  },
  {
    "title": "Oil Tanker Rates Soar Amid Shipping Shortages and Middle East Tensions",
    "description": "Oil tanker rates on the key Middle East-to-China route surged this week to the highest level since November as vessel supply is tightening and persistent tensions around Iran put shippers on alert. The daily rate for an oil tanker to ship crude from the Middl…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Tanker-Rates-Soar-Amid-Shipping-Shortages-and-Middle-East-Tensions.html",
    "timestamp": "2026-02-03T15:15:00Z"
  },
  {
    "title": "Trump ballroom lawyers say project essential for 'national security'",
    "description": "President Donald Trump's administration insisted that there would be \"national security implications\" if the new White House ballroom was not built immediately.In a motion opposing an injunction to halt the building of a massive White House addition, attorney…",
    "link": "https://www.rawstory.com/ballroom-national-security/",
    "timestamp": "2026-02-03T15:11:45Z"
  },
  {
    "title": "'Very Frustrating': House Democrats Disgruntled with Senate Democrats Over Spending Package",
    "description": "Democrats are fueding with one another over the latest budget bill as they seek to undercut the efforts of ICE.",
    "link": "https://www.westernjournal.com/frustrating-house-democrats-disgruntled-senate-democrats-spending-package/",
    "timestamp": "2026-02-03T15:11:22Z"
  },
  {
    "title": "Standard Chartered Cuts Near-Term Solana Forecast, Sees $2,000 by Decade's End",
    "description": "Standard Chartered analyst says Solana's \"ultra-low-cost\" model will dominate micropayments, but scaling may take several more years.",
    "link": "https://decrypt.co/356774/standard-chartered-cuts-near-term-solana-forecast-sees-2000-by-decades-end",
    "timestamp": "2026-02-03T15:10:21Z"
  },
  {
    "title": "Venezuela to Continue Cooperation With All Nations, Including Russia - Ambassador",
    "description": "MOSCOW (Sputnik) - Caracas will keep cooperating with all countries, including Russia, Venezuelan Ambassador to Moscow Jesus Rafael Salazar Velasquez said on Tuesday.",
    "link": "https://sputnikglobe.com/20260203/venezuela-to-continue-cooperation-with-all-nations-including-russia---ambassador-1123574453.html",
    "timestamp": "2026-02-03T15:06:42Z"
  },
  {
    "title": "Next step for IndyCar race in Washington D.C. taken with promoter announced",
    "description": "The next step in holding an IndyCar race in the nation's capital was taken with an announced promoter.",
    "link": "https://www.indystar.com/story/sports/motor/2026/02/03/indycar-news-washington-d-c-race-promoter-monumental-sports-entertainment-freedom-250-donald-trump/88488603007/",
    "timestamp": "2026-02-03T15:05:55Z"
  },
  {
    "title": "India-US Trade Deal: OSAT, chip design stand to gain as ties deepen",
    "description": "In 2022, the US–India partnership inaugurated the Initiative on Critical and Emerging Technology (iCET), focused on cooperation in semiconductors, AI, quantum computing, wireless communication, especially for defence and security applications",
    "link": "https://www.thehindubusinessline.com/info-tech/india-us-trade-deal-osat-chip-design-stand-to-gain-as-ties-deepen/article70588255.ece",
    "timestamp": "2026-02-03T15:03:43Z"
  },
  {
    "title": "Sad Sack Ed Martin Booted From DOJ For Failing To Crush Fuhrer's Enemies",
    "description": "Ed, we barely knew ye, thank God.",
    "link": "https://www.wonkette.com/p/sad-sack-ed-martin-booted-from-doj",
    "timestamp": "2026-02-03T15:03:08Z"
  },
  {
    "title": "US trade deal: At Rs 5,236 crore, FIIs buying in Indian stocks is the highest in over three months",
    "description": "Foreign investors returned strongly to Indian equities after the India-US trade deal eased tariff fears. FIIs logged their biggest single-day buying since October, lifting stocks, strengthening the rupee and improving bond market sentiment amid hopes of trade…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-trade-deal-at-rs-5236-crore-fiis-buying-in-indian-stocks-is-the-highest-in-over-three-months/articleshow/127888894.cms",
    "timestamp": "2026-02-03T15:02:18Z"
  },
  {
    "title": "Judge rules against U.S. plan to strip 350,000 Haitians of legal status, notes 'racial animus' of Noem, Trump",
    "description": "A federal judge late  Monday blocked the end of protections that have allowed roughly 350,000 Haitians to live in the U.S., dealing President Donald Trump's immigration agenda another legal, though perhaps temporary, setback.",
    "link": "https://www.cbc.ca/news/world/us-judge-haiti-tps-9.7071886",
    "timestamp": "2026-02-03T15:02:17Z"
  },
  {
    "title": "Scouting America 'on the clock' to roll back DEI, War Dept says",
    "description": "Department of War demands Scouting America eliminate DEI policies to keep federal support, calling the organization \"great\" but says it has \"lost its way.\"",
    "link": "https://www.foxnews.com/politics/scouting-america-on-clock-roll-back-dei-war-dept-says",
    "timestamp": "2026-02-03T15:00:28Z"
  },
  {
    "title": "Trump’s Project Vault Gives US Critical Mineral Startups a Boost",
    "description": "Venture capitalists and companies see the planned $12 billion fund as a way to unlock more investments in the sector that’s also crucial to clean tech.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-project-vault-gives-us-critical-mineral-startups-a-boost",
    "timestamp": "2026-02-03T15:00:10Z"
  },
  {
    "title": "Trump Wants to Build a 250′ Arch to Mark Nation’s 250th Year",
    "description": "Years ago, when New York’s Governor Nelson Rockefeller commissions new government buildings in Albany, the state Capitol, critics remarked that he had an “edifice complex.” If ever there was a President with an “edifice complex,” it’s Donald J. Trump. He is d…",
    "link": "https://dianeravitch.net/2026/02/03/trump-wants-to-build-a-250-arch-to-mark-nations-250th-year/",
    "timestamp": "2026-02-03T15:00:00Z"
  },
  {
    "title": "MetaMask adds tokenized US stocks, ETFs, commodities via Ondo",
    "description": "The rollout provides access to tokenized US stocks, ETFs and commodities through Ondo GM tokens for non-US users on Ethereum, excluding 30 jurisdictions at launch.",
    "link": "https://cointelegraph.com/news/metamask-tokenized-stocks-etfs-commodities-ondo",
    "timestamp": "2026-02-03T15:00:00Z"
  },
  {
    "title": "Indian Oil Buyers Reassess Russian Crude Under New U.S. Deal",
    "description": "Following the trade deal announced by U.S. President Donald Trump, Indian refiners seek clarification about Russian oil imports from their government, with some pre-emptively halting purchases, sources with knowledge of the matter told Bloomberg on Tuesday.  …",
    "link": "https://oilprice.com/Energy/Crude-Oil/Indian-Oil-Buyers-Reassess-Russian-Crude-Under-New-US-Deal.html",
    "timestamp": "2026-02-03T15:00:00Z"
  },
  {
    "title": "Indian trade minister reveals details of deal with US",
    "description": "India intends to protect its sensitive sectors like agriculture, Trade Minister Piyush Goyal has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/631914-indian-trade-minister-reveals-details/",
    "timestamp": "2026-02-03T14:59:09Z"
  },
  {
    "title": "Trump: The U.S. Military Used a “Secret Weapon” To Kidnap Maduro",
    "description": "United States President Donald Trump claimed that the American military used a new secret weapon during the abduction of Venezuelan ruler, Nicolas Maduro, and his wife. The weapons supposedly used to disable Venezuela’s air defense systems during the raid on …",
    "link": "https://www.activistpost.com/trump-the-u-s-military-used-a-secret-weapon-to-kidnap-maduro/",
    "timestamp": "2026-02-03T14:56:00Z"
  },
  {
    "title": "US Military Helping DHS Build Massive Network of ‘Concentration Camps,’ Navy Contract Reveals",
    "description": "DHS is using a repurposed $55 billion Navy contract to turn warehouses into makeshift jails and plan sprawling tent cities in the boonies.",
    "link": "https://www.nakedcapitalism.com/2026/02/us-military-helping-dhs-build-massive-network-of-concentration-camps-navy-contract-reveals.html",
    "timestamp": "2026-02-03T14:55:48Z"
  },
  {
    "title": "Military stands down troops ordered to prep to deploy to Minneapolis",
    "description": "The Pentagon has stood down more than 1,500 federal troops placed on alert for potential deployment to Minneapolis, according to two U.S. officials",
    "link": "https://abcnews.go.com/Politics/military-stands-troops-ordered-prep-deploy-minneapolis/story?id=129797524",
    "timestamp": "2026-02-03T14:53:18Z"
  }
]