[
  {
    "title": "'Vaporizing': Columnist argues America's greatness is disappearing under Trump",
    "description": "President Donald Trump's actions of the past six weeks have positioned him to forfeit \"what could have been the next great American century,\" argued columnist Catherine Rampell in a new Washington Post opinion piece.Rampell proffered that three simple steps w…",
    "link": "https://www.rawstory.com/trump-2671265864/",
    "timestamp": "2025-03-04T21:41:07Z"
  },
  {
    "title": "Sen. Tuberville: America Is Back. President's Joint Address Will Celebrate It | Opinion",
    "description": "Tonight, President Donald Trump will give his first joint address to Congress since his triumphant return to the White House. For the past four years, Americans endured a national nightmare under the Biden administration. Democrats opened our borders—allowing…",
    "link": "https://biztoc.com/x/437c2d56fc2d29a6",
    "timestamp": "2025-03-04T21:39:09Z"
  },
  {
    "title": "Trump wants to use the 'God Squad' to increase logging, but it must follow strict rules",
    "description": "President Donald Trump wants to increase logging in national forests and on public lands, including by bypassing endangered species protections.\nTo do that, the federal government would have to activate a seldom-used committee nicknamed the “God Squad” becaus…",
    "link": "https://biztoc.com/x/62f0f7d9999d8c51",
    "timestamp": "2025-03-04T21:39:04Z"
  },
  {
    "title": "Democrats Would Be Better Off Not Responding To Trump’s Joint Address To Congress",
    "description": "It’s supposed to be a highly clever move by Democrats to have picked a Midwest “moderate” senator who outperformed Kamala Harris in 2024 — talk about a low bar — to deliver the party’s response to President Trump’s address to Congress on Tuesday. But in case …",
    "link": "https://thefederalist.com/2025/03/04/democrats-would-be-better-off-not-responding-to-trumps-joint-address-to-congress/",
    "timestamp": "2025-03-04T21:39:01Z"
  },
  {
    "title": "Trump doesn’t seem to know why he launched a giant trade war",
    "description": "President Donald Trump speaks during a Cabinet meeting at the White House on February 26, 2025 in Washington, DC.\nDonald Trump just imposed a 25 percent tariff on virtually all goods produced by America’s two largest trading partners — Canada and Mexico. He s…",
    "link": "https://biztoc.com/x/504b6777262272e6",
    "timestamp": "2025-03-04T21:38:51Z"
  },
  {
    "title": "Jittery Republicans Fear Trump Tariffs Will Cause ‘Disaster,' Hike Prices",
    "description": "President Trump's deepening trade war with Canada, Mexico and China generated lots of anxiety among Republicans on Capitol Hill.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariffs_n_67c76595e4b0afa088b6c761",
    "timestamp": "2025-03-04T21:38:37Z"
  },
  {
    "title": "Texas measles outbreak fueled by distrust in public health and personal choice",
    "description": "Measles had struck this West Texas town, sickening dozens of children, but at the Community Church of Seminole, more than 350 worshippers gathered for a Sunday service. Sitting elbow-to-elbow, they filled the pews, siblings in matching button-down shirts and …",
    "link": "https://japantoday.com/category/world/texas-measles-outbreak-fueled-by-distrust-in-public-health-and-personal-choice",
    "timestamp": "2025-03-04T21:38:33Z"
  },
  {
    "title": "Trump wants to go back to 1913. Canadians and Americans will suffer the consequences",
    "description": "Canadians have taken Donald Trump’s threats of trade action — now realized — very personally. Understandably and justifiably so. But the American president’s treatment of Ukraine — not to mention his administration’s larger withholding of foreign aid — demons…",
    "link": "https://www.cbc.ca/news/politics/trump-tariffs-trade-war-trudeau-analysis-1.7474518",
    "timestamp": "2025-03-04T21:38:15Z"
  },
  {
    "title": "BlackRock strikes deal to bring ports on both sides of Panama Canal under American control",
    "description": "A Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the ports under American control after President Donald Trump alleg…",
    "link": "https://japantoday.com/category/world/blackrock-strikes-deal-to-bring-ports-on-both-sides-of-panama-canal-under-american-control",
    "timestamp": "2025-03-04T21:38:14Z"
  },
  {
    "title": "Biden and Trump pardons come under scrutiny, renewing calls for reform",
    "description": "The back-to-back presidential clemencies by Biden and Trump leaned on politics, drawing intensive scrutiny of the process and its potential for abuse.",
    "link": "https://www.nbcnews.com/politics/donald-trump/biden-trump-pardons-scrutiny-renewing-calls-reform-rcna193056",
    "timestamp": "2025-03-04T21:37:57Z"
  },
  {
    "title": "Republicans target 4 'sanctuary' cities as Trump pushes mass deportations",
    "description": "Republicans in Congress are taking aim at four cities — often called “sanctuary cities” — over their policies limiting cooperation with immigration enforcement with a hearing this week that comes as President Donald Trump presses ahead with his campaign of ma…",
    "link": "https://japantoday.com/category/world/republicans-target-4-%27sanctuary%27-cities-as-trump-pushes-mass-deportations",
    "timestamp": "2025-03-04T21:37:57Z"
  },
  {
    "title": "Arab states adopt Egyptian alternative to Trump's 'Gaza Riviera'",
    "description": "Arab leaders adopted an Egyptian reconstruction plan for Gaza on Tuesday that would cost $53 billion and avoid displacing Palestinians from the enclave, in contrast to U.S. President Donald Trump's &quot;Middle East Riviera&quot; vision. Egyptian president Ab…",
    "link": "https://japantoday.com/category/world/arab-states-adopt-egyptian-alternative-to-trump%27s-%27gaza-riviera%272",
    "timestamp": "2025-03-04T21:37:48Z"
  },
  {
    "title": "Zelenskyy calls Oval Office spat with Trump 'regrettable' and says he's ready to work for peace",
    "description": "Ukrainian President Volodymyr Zelenskyy said Tuesday the Oval Office blowup with U.S. President Donald Trump last week was “regrettable,” adding that he stands ready to work under Trump's “strong leadership” to get a lasting peace. Zelenskyy’s remarks — an ap…",
    "link": "https://japantoday.com/category/world/trump%27s-pause-on-military-aid-alarms-ukrainians-but-kyiv-digs-in-on-peace-terms",
    "timestamp": "2025-03-04T21:37:40Z"
  },
  {
    "title": "Trump's trade war draws swift retaliation as Mexico, Canada and China impose tariffs on U.S.",
    "description": "U.S. President Donald Trump launched a trade war Tuesday against America’s three biggest trading partners, drawing immediate retaliation from Mexico, Canada and China and sending financial markets into a tailspin as the U.S. faced the threat of rekindled infl…",
    "link": "https://japantoday.com/category/world/trump%27s-long-threatened-tariffs-against-canada-and-mexico-are-now-in-effect-kicking-off-trade-war",
    "timestamp": "2025-03-04T21:37:32Z"
  },
  {
    "title": "Tech-Bro 'Masculinity' Sets Men Up for Failure | Opinion",
    "description": "Donald Trump has weaponized the real anxieties that surround what it means to be a man in the 21st century.",
    "link": "https://www.newsweek.com/tech-bro-masculinity-sets-men-failure-opinion-2038049",
    "timestamp": "2025-03-04T21:37:25Z"
  },
  {
    "title": "US and Ukraine to sign minerals deal on Tuesday; Justin Trudeau accuses Donald Trump of trying to ruin Canadian economy",
    "description": "Ukraine is \"firmly determined\" to continue cooperation with the United States, Prime Minister Denys Shmyhal said on Tuesday following the news that Washington paused its crucial military aid.",
    "link": "https://www.independent.ie/world-news/north-america/us-and-ukraine-to-sign-minerals-deal-on-tuesday-justin-trudeau-accuses-donald-trump-of-trying-to-ruin-canadian-economy/a241450640.html",
    "timestamp": "2025-03-04T21:36:13Z"
  },
  {
    "title": "Canada announces detailed counter tariff package against U.S.",
    "description": "OTTAWA, March 4 (Xinhua) -- The Canadian federal government on Tuesday announced a detailed tariff package after Prime Minister Justin Trudeau vowed that Canada will not back down from a fight against the trade war initiated by U.S. President Donald Trump. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/03/05/canada-announces-detailed-counter-tariff-package-against-us",
    "timestamp": "2025-03-04T21:35:00Z"
  },
  {
    "title": "Trump pause of U.S. military aid adds pressure for Zelenskyy to seek end of war",
    "description": "The halting of military aid comes some five years after President Donald Trump held up congressionally authorized assistance to Ukraine as he sought to pressure Zelenskyy to launch an investigation into Joe Biden, then a Democratic presidential candidate.",
    "link": "https://www.pbs.org/newshour/world/trump-pause-of-u-s-military-aid-adds-pressure-for-zelenskyy-to-seek-end-of-war",
    "timestamp": "2025-03-04T21:34:50Z"
  },
  {
    "title": "Will Trump green-light Israeli annexation of the West Bank at his address to Congress?",
    "description": "As Trump prepares to address Congress, speculation grows over whether he will endorse Israeli annexation of the West Bank, a move with major geopolitical stakes.",
    "link": "https://www.jpost.com/israel-news/article-844729",
    "timestamp": "2025-03-04T21:34:43Z"
  },
  {
    "title": "The crypto industry got what it paid for",
    "description": "The crypto market never closes, so it was fitting President Donald Trump made the announcement on a Sunday: he was going to reward the billionaires who funded his presidential run. â\u0080\u009cA U.S. Crypto Reserve will elevate this critical industry after years of co…",
    "link": "https://www.theverge.com/cryptocurrency/624108/crypto-reserve-bitcoin-trump-grift",
    "timestamp": "2025-03-04T21:33:58Z"
  },
  {
    "title": "Sen. Tuberville: America Is Back. President's Joint Address Will Celebrate It | Opinion",
    "description": "Tonight, President Donald Trump will give his first joint address to Congress since his triumphant return to the White House.",
    "link": "https://www.newsweek.com/sen-tuberville-america-back-presidents-joint-address-will-celebrate-it-opinion-2039069",
    "timestamp": "2025-03-04T21:33:55Z"
  },
  {
    "title": "'Chaos': Federal workers ordered to return to offices — even as leases terminated",
    "description": "President Donald Trump has ordered federal workers back into the office — after years of working from home following the pandemic — but some of those office spaces are being vacated, according to a new report. A lease had been canceled for office space in a s…",
    "link": "https://www.rawstory.com/government-cuts/",
    "timestamp": "2025-03-04T21:33:10Z"
  },
  {
    "title": "It’s Not Just Tariffs: US Growth Risks Are Piling Up Under Trump",
    "description": "President Donald Trump’s latest trade-war salvo, the largest act of American protectionism since the 1930s, will likely put the brakes on US growth in the near term – and it’s just one of the shocks piling up for increasingly nervous consumers, businesses and…",
    "link": "https://financialpost.com/pmn/business-pmn/its-not-just-tariffs-us-growth-risks-are-piling-up-under-trump",
    "timestamp": "2025-03-04T21:33:05Z"
  },
  {
    "title": "Government By Chaos",
    "description": "I guess this is good, but also this is all just such infuriating nonsense: President Donald Trump on Tuesday abruptly walked back his directive to federal agencies to fire thousands of probationary employees, a stunning reversal that comes days after a federa…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/government-by-chaos",
    "timestamp": "2025-03-04T21:33:00Z"
  },
  {
    "title": "Arab leaders endorse counterproposal to Trump’s Gaza plan, with ceasefire uncertain | CNN",
    "description": "Arab leaders on Tuesday endorsed Egypt’s postwar plan for the Gaza Strip that would allow its roughly 2 million Palestinians to remain, in a counterproposal to US President Donald Trump’s plan to depopulate the territory and redevelop it as a beach destinatio…",
    "link": "https://www.cnn.com/2025/03/04/middleeast/arab-leaders-gaza-counterproposal-intl-latam/index.html",
    "timestamp": "2025-03-04T21:32:55Z"
  },
  {
    "title": "Elon Musk Weighs In on Derek Chauvin Pardon Proposal From Ben Shapiro",
    "description": "The billionaire responded to the conservative commentator's proposal to pardon the officer who killed George Floyd, saying it was \"Something to think about.\"",
    "link": "https://www.newsweek.com/elon-musk-weighs-derek-chauvin-pardon-proposal-ben-shapiro-2039593",
    "timestamp": "2025-03-04T21:32:38Z"
  },
  {
    "title": "Grapevine March 5, 2025: A dynasty of social service",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-844693",
    "timestamp": "2025-03-04T21:32:06Z"
  },
  {
    "title": "Meet Everyone Hates Elon, the U.K.-Based Collective Attempting to Take Down Musk: “Let’s Make Billionaires Losers Again”",
    "description": "The group recently became an online sensation thanks to posters they plastered all over London picturing the richest man in the world making his infamous Hitler-like salute while in a Tesla (which they call a \"swasticar\"): \"This is a real moment where people …",
    "link": "https://freerepublic.com/focus/f-news/4302086/posts",
    "timestamp": "2025-03-04T21:31:59Z"
  },
  {
    "title": "Arab leaders endorse 'comprehensive' plan to rebuild Gaza under Palestinian Authority",
    "description": "The prospect of the Palestinian Authority governing Gaza remains far from certain, however, with Israel having ruled out any future role for the body.",
    "link": "https://www.thejournal.ie/arab-leaders-endorse-plan-rebuild-gaza-under-palestinian-authority-6639939-Mar2025/",
    "timestamp": "2025-03-04T21:30:39Z"
  },
  {
    "title": "DeSantis takes victory lap on Florida's 'momentous immigration legislation' enforcing Trump agenda",
    "description": "Florida Gov. Ron DeSantis uses State of State address to tout sweeping bills passed during special legislative session to enforce President Donald Trump's immigration crackdown",
    "link": "https://www.foxnews.com/politics/desantis-takes-victory-lap-floridas-momentous-immigration-legislation-enforcing-trump-agenda",
    "timestamp": "2025-03-04T21:30:20Z"
  },
  {
    "title": "Trump, Ukraine, and the Meme-ing of Marco Rubio",
    "description": "Why the secretary of state’s stone-like posture during the Zelenskyy meltdown might have been exactly as telling as observed.",
    "link": "https://www.vanityfair.com/news/story/trump-ukraine-and-the-meme-ing-of-marco-rubio",
    "timestamp": "2025-03-04T21:30:00Z"
  },
  {
    "title": "EU bishops call for unity and solidarity with Ukraine amid geopolitical uncertainty",
    "description": "The flag of the European Union. / Credit: U. J. Alexander/Shutterstock\n\nACI Prensa Staff, Mar 4, 2025 / 16:30 pm (CNA).\nIn the context of the growing geopolitical complexity and uncertainty surrounding peace in Ukraine, the presidency of the Commission of the…",
    "link": "https://www.catholicnewsagency.com/news/262553/eu-bishops-call-for-unity-and-solidarity-with-ukraine-amid-geopolitical-uncertainty",
    "timestamp": "2025-03-04T21:30:00Z"
  },
  {
    "title": "Trump doesn’t seem to know why he launched a giant trade war",
    "description": "Donald Trump just imposed a 25 percent tariff on virtually all goods produced by America’s two largest trading partners — Canada and Mexico. He simultaneously established a 20 percent across-the-board tariff on Chinese goods.  As a result, America’s average t…",
    "link": "https://www.vox.com/politics/402530/trump-tariffs-canada-mexico-explanation",
    "timestamp": "2025-03-04T21:28:57Z"
  },
  {
    "title": "How springing forward to daylight saving time could affect your health",
    "description": "Most of America \"springs forward\" Sunday for daylight saving time and losing that hour of sleep can do more than leave you tired and cranky the next day. It also could harm your health.",
    "link": "https://www.wbaltv.com/article/how-springing-forward-to-daylight-saving-time-affect-health/64040128",
    "timestamp": "2025-03-04T21:28:35Z"
  },
  {
    "title": "Comcast CEO Brian Roberts Says U.S. Still Best Country To “Grow Your Business”",
    "description": "“I continue to be an optimist,” said Comcast chairman-CEO Brian Roberts, asked at tail of a media conference Q&A why he remains so upbeat on the company’s growth prospects. “Obviously, look at the world around us, and there’s instability. We’re pretty much fo…",
    "link": "http://deadline.com/2025/03/comcast-nbcuniversal-brian-roberts-us-still-best-country-for-business-1236310882/",
    "timestamp": "2025-03-04T21:28:24Z"
  },
  {
    "title": "Stagflation fears rise as Trump tariffs take effect, economy slows",
    "description": "A growth scare in the economy has accompanied worries over a resurgence in inflation, in turn potentially rekindling an ugly condition that the U.S. has not seen in 50 years.\nFears over “stagflation” have come as President Donald Trump seems determined to sla…",
    "link": "https://biztoc.com/x/8e509ca73642f29a",
    "timestamp": "2025-03-04T21:28:22Z"
  },
  {
    "title": "Ticker: BlackRock strikes Panama Canal deal; Starbucks brings in new CFO",
    "description": "A Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the ports under American control after President Donald Trump alleg…",
    "link": "https://biztoc.com/x/29f0f05c8769afd4",
    "timestamp": "2025-03-04T21:28:09Z"
  },
  {
    "title": "Investors brace for more volatility with Trump set to address Congress",
    "description": "Investors are bracing for more U.S. stock market volatility when President Donald Trump delivers an address to Congress on Tuesday evening, on the heels of his implementation of new tariffs that rattled asset prices earlier in the day.The president's remarks …",
    "link": "https://www.channelnewsasia.com/business/investors-brace-more-volatility-trump-set-address-congress-4977121",
    "timestamp": "2025-03-04T21:27:59Z"
  },
  {
    "title": "Target and Best Buy said they’ll raise prices due to Trump tariffs. These other companies could be next",
    "description": "Target and Best Buy, two of the country’s largest retail chains, warned their prices will increase after President Donald Trump’s 25% tariffs on goods from Mexico and Canada went into effect on Tuesday, sending the stock market plunging over 650 points and sh…",
    "link": "https://biztoc.com/x/c29e94dc94d4bf0f",
    "timestamp": "2025-03-04T21:27:54Z"
  },
  {
    "title": "What's Going On With Wells Fargo (WFC) Stock?",
    "description": "Wells Fargo & Co (NYSE:WFC) shares fell 4.8% to $73.30 on Tuesday as investor anxiety over U.S. tariffs on Mexico and Canada rattled financial markets.\nWhat To Know: With President Donald Trump ruling out further trade negotiations, concerns over economic gro…",
    "link": "https://biztoc.com/x/31580eb167c173e1",
    "timestamp": "2025-03-04T21:27:52Z"
  },
  {
    "title": "Blockstream Reportedly Secures Billions for Crypto Lending Funds",
    "description": "Bitcoin developer Blockstream has reportedly landed a multibillion-dollar investment to launch a trio of funds. Two of those funds will allow for cryptocurrency lending, Bloomberg News reported Tuesday (March 4), citing sources familiar with the matter. The r…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/blockstream-reportedly-secures-billions-for-crypto-lending-funds/",
    "timestamp": "2025-03-04T21:27:50Z"
  },
  {
    "title": "Elissa Slotkin, Jewish Democrat delivering the response to Trump, has a riveting immigrant story",
    "description": "Sen. Elissa Slotkin will deliver the Democratic response to Trump’s State of the Union speech, spotlighting her swing-state win, pro-Israel stance, and bipartisan approach.",
    "link": "https://www.jpost.com/american-politics/article-844728",
    "timestamp": "2025-03-04T21:27:24Z"
  },
  {
    "title": "Senate Democrats Tell N.Y. State Bar To Investigate Trump’s Deputy AG For Dropping Eric Adams Charges",
    "description": "Emil Bove committed professional misconduct by pressuring prosecutors to drop Adams’ charges, senators allege.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/04/senate-democrats-tell-ny-state-bar-to-investigate-trumps-deputy-ag-for-dropping-eric-adams-charges/",
    "timestamp": "2025-03-04T21:27:07Z"
  },
  {
    "title": "How springing forward to daylight saving time could affect your health",
    "description": "Most of America \"springs forward\" Sunday for daylight saving time and losing that hour of sleep can do more than leave you tired and cranky the next day. It also could harm your health.",
    "link": "https://www.kcra.com/article/how-springing-forward-to-daylight-saving-time-affect-health/64040128",
    "timestamp": "2025-03-04T21:26:12Z"
  },
  {
    "title": "Putin Agrees to Help Broker Talks Between Trump and Iran: Reports",
    "description": "Citing people familiar with the situation, Bloomberg stated Trump expressed an interest to work with Iran on both nuclear matters and Tehran's support for anti-U.S. proxies in the Middle East during a phone call with Russian President Vladimir Putin last mont…",
    "link": "https://freerepublic.com/focus/f-news/4302085/posts",
    "timestamp": "2025-03-04T21:25:35Z"
  },
  {
    "title": "How U.S. tariffs will likely affect Ontario industries like steel, trucking and auto",
    "description": "U.S. President Donald Trump’s long-threatened tariffs on Canadian goods went into effect after midnight Tuesday. Industry insiders explain what that could mean for business and employment in their sectors.",
    "link": "https://www.cbc.ca/news/canada/toronto/impact-us-tariffs-ontario-auto-steel-trucking-sector-impact-1.7474210",
    "timestamp": "2025-03-04T21:25:32Z"
  },
  {
    "title": "Trump Official Tells Americans to Buy Chickens to Deal With Egg Pricing Crisis",
    "description": "Egg prices have increased by nearly 25 percent since Trump took office.",
    "link": "https://truthout.org/articles/trump-official-tells-americans-to-buy-chickens-to-deal-with-egg-pricing-crisis/",
    "timestamp": "2025-03-04T21:25:09Z"
  },
  {
    "title": "David Sacks Quietly Divested From Crypto Company at Center of Conflict of Interest Controversy",
    "description": "Sacks' venture firm, Craft Ventures, exited its Bitwise position ahead of the new administration, according to a source close to the situation.",
    "link": "https://www.coindesk.com/policy/2025/03/04/david-sacks-quiety-divested-from-crypto-company-at-center-of-conflict-of-interest-controversy",
    "timestamp": "2025-03-04T21:25:02Z"
  },
  {
    "title": "Made in America: Trump Racks Up $3 Trillion of Investments in US Economy",
    "description": "For President Donald Trump, the Taiwan Semiconductor Manufacturing Co.’s $100 billion investment in U.S. chip manufacturing represented “a tremendous leap—like, a leap that nobody would... Read More\nThe post Made in America: Trump Racks Up $3 Trillion of Inve…",
    "link": "https://www.dailysignal.com/2025/03/04/trump-3-trillion-investment-american-economy/",
    "timestamp": "2025-03-04T21:24:51Z"
  },
  {
    "title": "Trump tariffs prompt Target, Best Buy to warn shoppers about higher prices - NewsBreak",
    "description": "Target and Best Buy warned shoppers to expect higher prices as a result of President Donald Trump’s escalating trade war.",
    "link": "https://www.newsbreak.com/share/3840100479145-trump-tariffs-prompt-target-best-buy-to-warn-shoppers-about-higher-prices?_f=app_share&amp;pd=07pZ0A0A&amp;lang=en_US&amp;send_time=1741123423&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v6%2Cns_foryou_recall_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v3&amp;s=i2",
    "timestamp": "2025-03-04T21:24:12Z"
  },
  {
    "title": "US stocks fall again as more Trump tariffs take effect",
    "description": "Wall Street stocks tumbled Tuesday after the United States proceeded with new tariffs on Canada, Mexico and China, exacerbating worries that higher inflation will prompt a recession. US President Donald Trump, who had suspended for a month an earlier plan for…",
    "link": "https://www.digitaljournal.com/world/us-stocks-fall-again-as-more-trump-tariffs-take-effect/article",
    "timestamp": "2025-03-04T21:22:32Z"
  },
  {
    "title": "Trump Threatens to Pull Funding From Schools Over Pro-Palestinian Protests",
    "description": "Trump threatened to halt all federal funding for any institution of higher education that allows \"illegal protests,\" vowing to imprison \"agitators.\"",
    "link": "https://www.newsweek.com/trump-threatens-pull-funding-universities-over-protests-2039549",
    "timestamp": "2025-03-04T21:22:03Z"
  },
  {
    "title": "Gay teacher who helped students, including Oscar-winner Julianne Moore, find their voice, takes final bow",
    "description": "Richard Floyd Smith wasn’t just a teacher\r\n. He was a lifeline for so many of us. He was a mentor, a director, a guiding force who saw what we couldn’t yet see in ourselves. He wasn’t the kind of educator who simply stood in front of a classroom — he pulled u…",
    "link": "https://www.advocate.com/voices/richard-floyd-smith-educator-obituary",
    "timestamp": "2025-03-04T21:21:00Z"
  },
  {
    "title": "'Devoid of humanity': Musk’s call to pardon George Floyd’s killer ignites fierce backlash",
    "description": "Tech billionaire and close adviser to President Donald Trump, Elon Musk, is lending his voice to encourage the pardon of former police officer Derek Chauvin, who killed George Floyd in May 2020.Far-right commentator Ben Shapiro posted a link to a Daily Wire l…",
    "link": "https://www.rawstory.com/derek-chauvin-2671265807/",
    "timestamp": "2025-03-04T21:20:55Z"
  },
  {
    "title": "Ben Shapiro Calls for Trump to Pardon Convicted George Floyd Killer Derek Chauvin: ‘It’s Absolutely Necessary’",
    "description": "Ben Shapiro on Tuesday called for Donald Trump to pardon Derek Chauvin, the former Minneapolis police officer responsible for the death of George Floyd.\nThe post Ben Shapiro Calls for Trump to Pardon Convicted George Floyd Killer Derek Chauvin: ‘It’s Absolute…",
    "link": "https://www.mediaite.com/news/ben-shapiro-calls-for-trump-to-pardon-convicted-george-floyd-killer-derek-chauvin-its-absolutely-necessary/",
    "timestamp": "2025-03-04T21:19:27Z"
  },
  {
    "title": "What to know about Trump’s halt on military aid to Ukraine",
    "description": "It's a major blow that threatens to remove some of the most formidable weapons in Ukraine’s battlefield arsenal, and ratchets up pressure on Kyiv to accept a peace agreement.",
    "link": "https://www.pbs.org/newshour/world/what-to-know-about-trumps-halt-on-military-aid-to-ukraine",
    "timestamp": "2025-03-04T21:18:08Z"
  },
  {
    "title": "Ticker: BlackRock strikes Panama Canal deal; Starbucks brings in new CFO",
    "description": "A Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the ports under American control after President Donald Trump alleg…",
    "link": "https://www.bostonherald.com/2025/03/04/ticker-blackrock-strikes-panama-canal-deal-starbucks-brings-in-new-cfo/",
    "timestamp": "2025-03-04T21:17:48Z"
  },
  {
    "title": "China gains U.N. clout, filling void left by Trump's 'America First'",
    "description": "NEW YORK -- China is on track to contribute over a fifth of the United Nations budget for the first time this year, increasing influence over the international body as the U.S. under President Donald Trump scales back engagement with the rest of the world.\nDu…",
    "link": "https://biztoc.com/x/f979e75961cb1b97",
    "timestamp": "2025-03-04T21:17:19Z"
  },
  {
    "title": "Why Is Everyone Suddenly on Substack?",
    "description": "Jim Acosta, the former CNN anchor known for antagonizing President Donald Trump during his first term, did not know what Substack was a month ago, when he was suddenly on the outs with the network he had called home for nearly two decades.\nToday, he has more …",
    "link": "https://biztoc.com/x/ad9099e3475db5a6",
    "timestamp": "2025-03-04T21:17:03Z"
  },
  {
    "title": "Trump Proposes Selling 443 Federal Properties Across 47 States, D.C., and Puerto Rico, Including DOJ and FBI Headquarters, Nancy Pelosi, and Dick Cheney Buildings",
    "description": "President Donald Trump is proving once again why he’s the king of slashing government waste and draining the swamp. In a blockbuster report from Bloomberg, the Trump administration has unveiled plans to unload a massive portfolio of 443 federal properties acr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302084/posts",
    "timestamp": "2025-03-04T21:16:37Z"
  },
  {
    "title": "Stagflation fears rise as Trump tariffs take effect, economy slows",
    "description": "Among consumers, long-run inflation expectations are at their highest level in almost 30 years while general sentiment is seeing multi-year lows.",
    "link": "https://www.nbcnews.com/business/economy/trump-tariffs-stoke-stagflation-fears-rcna194767",
    "timestamp": "2025-03-04T21:16:17Z"
  },
  {
    "title": "Why Is Everyone Suddenly on Substack?",
    "description": "Substack is on a journey to reinvent the media landscape with cable news' biggest names. So far, it seems to be working.",
    "link": "https://www.newsweek.com/why-everyone-suddenly-substack-2039011",
    "timestamp": "2025-03-04T21:14:37Z"
  },
  {
    "title": "CFPB drops Zelle lawsuit in latest reversal under Trump administration",
    "description": "The Consumer Financial Protection Bureau has dropped its lawsuit over peer-to-peer payment system Zelle, the latest in a series of dismissals from this department under President Donald Trump's administration. The agency had only just announced the suit — fil…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176615697",
    "timestamp": "2025-03-04T21:12:06Z"
  },
  {
    "title": "Andy Cohen Trashes Meghan McCain for “Vilification” of Trans Community",
    "description": "Reading Time: 3 minutesAndy Cohen has some harsh words for Meghan McCain. Earlier this week, McCain expressed her support for Payton McNabb… who …\nAndy Cohen Trashes Meghan McCain for “Vilification” of Trans Community was originally published on The Hollywood…",
    "link": "http://www.thehollywoodgossip.com/2025/03/andy-cohen-trashes-meghan-mccain-for-vilification-of-trans-community/",
    "timestamp": "2025-03-04T21:12:00Z"
  },
  {
    "title": "Trump threatens further tariff hikes after Canada retaliates",
    "description": "US president posts warning on social media after Canada PM Trudeau slammed 'dumb' trade war.",
    "link": "https://www.aljazeera.com/news/2025/3/4/trump-threatens-further-tariff-hikes-for-canada-retaliation",
    "timestamp": "2025-03-04T21:11:28Z"
  },
  {
    "title": "Dow Drops 1300 Points in Two Days Amid Trump Trade War",
    "description": "The tariffs between the US, China, Canada and Mexico helped to extend a recent slump for stocks prompted by signs of weakness.",
    "link": "https://www.newsweek.com/dow-drops-1300-points-two-days-amid-trump-trade-war-2039596",
    "timestamp": "2025-03-04T21:10:58Z"
  },
  {
    "title": "Farmers Fear More Pain From Trump’s Trade War",
    "description": "Already reeling, U.S. farmers say the new round of retaliatory tariffs will hurt business",
    "link": "https://time.com/7264403/farmers-trade-war-tariffs/",
    "timestamp": "2025-03-04T21:10:37Z"
  },
  {
    "title": "Democrats Plan to Protest Trump’s Speech by Wearing Pink",
    "description": "Democratic lawmakers are expected to communicate their opposition to Donald Trump during the president’s joint address to Congress on Tuesday night by color-coordinating.",
    "link": "http://www.thecut.com/article/democrats-wearing-pink-to-protest-trumps-speech-to-congress.html",
    "timestamp": "2025-03-04T21:10:35Z"
  },
  {
    "title": "I Knew The First Moment Leslie Bibb's Kate Brought Up Austin That It Was Over For Her In The White Lotus Season 3 Episode 3",
    "description": "Leslie Bibb's Kate in The White Lotus season 3 has certainly created an uphill battle with her friends, Laurie and Jaclyn, after bringing up politics.",
    "link": "https://screenrant.com/white-lotus-season-3-episode-3-kate-politics-gossip-destroy-op-ed/",
    "timestamp": "2025-03-04T21:10:14Z"
  },
  {
    "title": "Lawsuit Alleges Trump’s Guantánamo Transfers Aim to “Instill Fear” in Immigrants",
    "description": "Three have died in ICE custody as Trump rapidly expands government capacity to surveil and incarcerate immigrants.",
    "link": "https://truthout.org/articles/lawsuit-alleges-trumps-guantanamo-transfers-aim-to-instill-fear-in-immigrants/",
    "timestamp": "2025-03-04T21:08:04Z"
  },
  {
    "title": "Trump gives Chevron 30 days to stop pumping oil in Venezuela over Maduro’s stalled reforms, migrant returns",
    "description": "President Trump on Tuesday reversed a Biden-era license that allowed the oil giant to operate in Venezuela despite US sanctions",
    "link": "https://nypost.com/2025/03/04/business/trump-gives-chevron-30-days-to-stop-pumping-oil-in-venezuela/",
    "timestamp": "2025-03-04T21:07:38Z"
  },
  {
    "title": "China files complaint with WTO over US tariffs",
    "description": "Beijing said on Tuesday that it had filed a complaint with the World Trade Organisation against the United States over President Donald Trump’s tariff increases on Chinese goods. The statement comes a day after Trump ordered additional tariffs on Chinese good…",
    "link": "https://punchng.com/china-files-complaint-with-wto-over-us-tariffs/",
    "timestamp": "2025-03-04T21:07:12Z"
  },
  {
    "title": "Zelensky seeks to mend ties with Trump after aid freeze",
    "description": "President Volodymyr Zelensky said on Tuesday that he wanted to “make things right” with Donald Trump and work under the US president’s “strong leadership” to secure lasting peace in Ukraine. In his first public comments since Trump halted US military aid to U…",
    "link": "https://punchng.com/zelensky-seeks-to-mend-ties-with-trump-after-aid-freeze/",
    "timestamp": "2025-03-04T21:07:12Z"
  },
  {
    "title": "Stagflation fears bubble up as Trump tariffs take effect and the economy slows",
    "description": "A growth scare in the economy has accompanied worries over a resurgence in inflation, in turn potentially rekindling an ugly condition that the U.S. has not seen in 50 years.\nFears over \"stagflation\" have come as President Donald Trump seems determined to sla…",
    "link": "https://biztoc.com/x/f6913c4b2a3eca94",
    "timestamp": "2025-03-04T21:06:25Z"
  },
  {
    "title": "US closes lower as tariffs' impact sinks in",
    "description": "Major stock market indexes in the United States closed lower on Tuesday as investors continued to assess how the tariffs President Donald Trump imposed on Canada, China, and Mexico would impact the co...",
    "link": "https://biztoc.com/x/f7699b07351faff6",
    "timestamp": "2025-03-04T21:06:02Z"
  },
  {
    "title": "Zelenskiy Expresses Regret After Trump Fallout on Peace Deal",
    "description": "President Volodymyr Zelenskiy said that he’s ready to work speedily to end Russia’s war on Ukraine, stressing that his dramatic falling out with US President Donald Trump over the path toward peace was “regrettable.”\n“I would like to reiterate Ukraine’s commi…",
    "link": "https://biztoc.com/x/e5e9eb4e72770f5c",
    "timestamp": "2025-03-04T21:06:02Z"
  },
  {
    "title": "Newsmax Issues Statement Denying Report on Pete Hegseth Coverage",
    "description": "In December, Mediaite reported that Newsmax instructed staff to refrain from criticizing Pete Hegseth, who at the time was President Donald Trump’s nominee to serve as secretary of defense. Mediaite reported that the instruction came after a segment criticizi…",
    "link": "https://www.mediaite.com/news/newsmax-issues-statement-denying-report-on-pete-hegseth-coverage/",
    "timestamp": "2025-03-04T21:05:42Z"
  },
  {
    "title": "Trump’s World And The New Three Emperors’ League",
    "description": "Donald Trump’s America, Vladimir Putin’s Russia, and Xi Jinping’s China, a trio which splits the world into sectors of influence. As his former national security adviser, John Bolton, observes, Trump, “has no overarching national security philosophy,” and, “h…",
    "link": "https://nationalinterest.org/blog/paul-pillar/trumps-world-and-the-new-three-emperors-league/",
    "timestamp": "2025-03-04T21:05:36Z"
  },
  {
    "title": "China to Downplay Its Broken Economy at Lawmaking 'Two Sessions'",
    "description": "China's National People's Congress and the advisory Chinese People's Political Consultative Conference have begun their annual full sessions.\nThe post China to Downplay Its Broken Economy at Lawmaking ‘Two Sessions’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2025/03/04/china-to-downplay-its-broken-economy-lawmaking-two-sessions/",
    "timestamp": "2025-03-04T21:04:49Z"
  },
  {
    "title": "Trump tariffs prompt Target, Best Buy to warn shoppers about higher prices - NewsBreak",
    "description": "Target and Best Buy warned shoppers to expect higher prices as a result of President Donald Trump’s escalating trade war.",
    "link": "https://www.newsbreak.com/share/3840100479145-trump-tariffs-prompt-target-best-buy-to-warn-shoppers-about-higher-prices?_f=app_share&amp;pd=0IHFT4ZD&amp;lang=en_US&amp;send_time=1741122203&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v9%2Cns_foryou_recall_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v1&amp;s=i2",
    "timestamp": "2025-03-04T21:04:48Z"
  },
  {
    "title": "Thirsty Swedish influencer runs paid ad campaign to get hired in Trump’s White House",
    "description": "A self-proclaimed “diehard Trump loyalist” is taking his quest for a White House job to the next level, running ads on X to get President Donald Trump’s attention. \n\n\nThe internet personality Victor Carlstrom, who claims to be a prominent “whistleblower” from…",
    "link": "https://www.dailydot.com/debug/victor-carlstrom-x-ads-white-house-job-application/",
    "timestamp": "2025-03-04T21:03:45Z"
  },
  {
    "title": "Conservative leaders are failing Trump's tariff test",
    "description": "Attempts to appease Donald Trump have clearly failed. When will the remaining holdouts finally realize it?",
    "link": "https://www.nationalobserver.com/2025/03/04/opinion/conservative-leaders-trump-tariff-test",
    "timestamp": "2025-03-04T21:03:33Z"
  },
  {
    "title": "Texas measles outbreak fueled by distrust in public health and personal choice",
    "description": "Doctors worry anti-vaccine rhetoric from Robert F. Kennedy Jr. will make things worse as childhood vaccination rates decline.",
    "link": "https://www.cleveland19.com/2025/03/04/texas-measles-outbreak-fueled-by-distrust-public-health-personal-choice/",
    "timestamp": "2025-03-04T21:02:28Z"
  },
  {
    "title": "Stock market today: Dow sinks 650 points, S&P 500 wipes out post-election gains as Trump trade war intensifies",
    "description": "Investors weighed Canada and China's response to President Donald Trump's delivery of new tariffs",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sinks-650-points-sp-500-wipes-out-post-election-gains-as-trump-trade-war-intensifies-210135991.html",
    "timestamp": "2025-03-04T21:01:35Z"
  },
  {
    "title": "Exclusive-US and Ukraine prepare to sign minerals deal on Tuesday, sources say (May it be so)",
    "description": "NEW YORK (Reuters) - U.S. President Donald Trump's administration and Ukraine plan to sign the much-debated minerals deal following a disastrous Oval Office meeting Friday in which Ukrainian President Volodymyr Zelenskiy was dismissed from the building, four …",
    "link": "https://freerepublic.com/focus/f-news/4302080/posts",
    "timestamp": "2025-03-04T21:01:32Z"
  },
  {
    "title": "WINNING! Trump Administration Proposes Selling 443 Federal Properties Across 47 States, D.C., and Puerto Rico, Including DOJ and FBI Headquarters, Nancy Pelosi, and Dick Cheney Buildings",
    "description": "The Trump administration's bold proposal to sell 443 federal properties, including key agency headquarters, marks a significant stride in reducing government waste and reallocating taxpayer resources.\nThe post WINNING! Trump Administration Proposes Selling 44…",
    "link": "https://www.thegatewaypundit.com/2025/03/winning-trump-administration-proposes-selling-443-federal-properties/",
    "timestamp": "2025-03-04T21:00:37Z"
  },
  {
    "title": "Jon Stewart slams Elon Musk's 'bull----' reason for not doing interview",
    "description": "'The Daily Show' host Jon Stewart slammed Elon Musk for 'bull----' excuse as to why he seems to be backing away from an interview with the late-night comedian.",
    "link": "https://www.foxnews.com/media/jon-stewart-slams-elon-musks-bull-excuse-not-doing-interview",
    "timestamp": "2025-03-04T21:00:33Z"
  },
  {
    "title": "Coinbase CEO Brian Armstrong Says ‘Just Bitcoin’ the Best Option for US Crypto Strategic Reserve",
    "description": "Coinbase co-founder and CEO Brian Armstrong believes the US crypto strategic reserve recently announced by President Donald Trump should exclusively consist of Bitcoin (BTC). On the social media platform X, Armstrong says having “just Bitcoin” in the US crypt…",
    "link": "https://dailyhodl.com/2025/03/04/coinbase-ceo-brian-armstrong-says-just-bitcoin-the-best-option-for-us-crypto-strategic-reserve/",
    "timestamp": "2025-03-04T21:00:23Z"
  },
  {
    "title": "In Case You Missed It, People Tried To Arrange A One Day 'Economic Boycott' On February 28th",
    "description": "February 28th, 2025 Economic Boycott refers to a social media campaign that encouraged American citizens to boycott the economy on the last date of February 2025 in an attempt to protest the new Presidential administration. The boycott was supposedly started …",
    "link": "https://knowyourmeme.com/memes/events/february-28th-2025-economic-boycott",
    "timestamp": "2025-03-04T21:00:21Z"
  },
  {
    "title": "Zelenskyy suggests Ukraine didn’t receive direct notification that U.S. had paused military aid",
    "description": "Ukrainian President Volodymyr Zelenskyy also said Ukraine is ready to sign a lucrative deal on rare-earth minerals and security with Washington.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-suggests-ukraine-didnt-receive-direct-notification-that-u-s-had-paused-military-aid",
    "timestamp": "2025-03-04T21:00:11Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Boy stabbed in primary school, Tánaiste speaks to US Secretary of State and gardaí shoot a dog.",
    "link": "https://www.thejournal.ie/heres-what-happened-today-tuesday-68-6639826-Mar2025/",
    "timestamp": "2025-03-04T21:00:03Z"
  },
  {
    "title": "Trump Claims The U.S. Will “Get Back” The Money It Spent On Ukraine",
    "description": "United States ruler Donald Trump has claimed that the U.S. will “get back” the money it spent on the Ukraine war, in the form of natural resources. Trump had initially demanded the equivalent of up to $500 billion worth of natural resources as compensation fo…",
    "link": "https://www.activistpost.com/trump-ukraine-deal-potential-impact-on-resources/",
    "timestamp": "2025-03-04T21:00:00Z"
  },
  {
    "title": "Farewell Nato: The late, great military alliance",
    "description": "<p>The North Atlantic Treaty Organisation (Nato) retired to its sickbed as soon as Donald Trump won the presidential election last November. It finally died last Friday in the White House, when Mr Trump and Vice-President JD Vance launched a vicious attack on…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2973158/farewell-nato-the-late-great-military-alliance",
    "timestamp": "2025-03-04T21:00:00Z"
  },
  {
    "title": "Paopoom touts cheap stocks",
    "description": "<p>Deputy Finance Minister Paopoom Rojanasakul says smart investors will notice now is a good time to build up their portfolios, given stock market sentiment.</p>",
    "link": "https://www.bangkokpost.com/business/general/2973148/paopoom-touts-cheap-stocks",
    "timestamp": "2025-03-04T21:00:00Z"
  },
  {
    "title": "Greg Olear: What Democrats Should Do Tonight",
    "description": "Greg Olear has a plan for Democrats tonight at the State of the Union. Here it is: Tonight, at 9 pm Eastern Time—which is to say, 5 am Wednesday Moscow Time—Co-President Trump will deliver the first State of the Union Address of the Redux. Congressional Democ…",
    "link": "https://dianeravitch.net/2025/03/04/greg-olear-what-democrats-should-do-tonight/",
    "timestamp": "2025-03-04T21:00:00Z"
  },
  {
    "title": "Transatlantic Tensions Create Openings for Chinese Influence",
    "description": "After a week of runaway diplomacy around how to end the war in Ukraine that has widened rifts between the United States and other Western powers and raised new questions about the future of US assistance for Ukraine, China is looking at how it can capitalize.…",
    "link": "https://oilprice.com/Geopolitics/International/Transatlantic-Tensions-Create-Openings-for-Chinese-Influence.html",
    "timestamp": "2025-03-04T21:00:00Z"
  },
  {
    "title": "International Hater’s Anthem: Trump’s Tariffs Provoke Retaliation From Canada, Mexico And China",
    "description": "It’s almost as if President Donald Trump is on an unending MAGA mission to alienate all of the United States’ allies except Russia. When he’s not ticking off European nations by staging a performative shouting match with Ukrainian President Volodymyr Zelensky…",
    "link": "http://bossip.com/2796944/trump-trariffs-canada-mexico-and-china/",
    "timestamp": "2025-03-04T20:59:55Z"
  },
  {
    "title": "'The president’s violation of law': Judge permanently reinstates Biden-appointed member of civil service board who Trump illegally and ineffectually tried to fire",
    "description": "'The president’s violation of law': Judge permanently reinstates Biden-appointed member of civil service board who Trump illegally and ineffectually tried to firenewsbreak.com",
    "link": "https://www.newsbreak.com/share/3840262224397-the-president-s-violation-of-law-judge-permanently-reinstates-biden-appointed-member-of-civil-service-board-who-trump-illegally-and-ineffectually-tried-to-fire?s=a2&share_destination_id=MTg0NDY3NzUyLTE3NDExNTAwOTQ5MDM%3D&pd=0CU0UKNW&hl=en_US&send_time=1741150094&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-control%2Cns_foryou_model_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v5%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_blend_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v8",
    "timestamp": "2025-03-04T20:59:16Z"
  }
]