[
  {
    "title": "Bad Bunny Super Bowl performance to be cancelled? Latest update here",
    "description": "Bad Bunny has been a top-five streamed artist on the music platform Spotify every year, including the most streams in 2020, 2021 and 2022.",
    "link": "https://economictimes.indiatimes.com/news/international/us/bad-bunny-super-bowl-performance-to-be-cancelled-latest-update-here/articleshow/124748480.cms",
    "timestamp": "2025-10-22T21:24:15Z"
  },
  {
    "title": "Japan's exports and imports grow in September despite Trump's tariffs",
    "description": "Japan’s exports grew 4.2% in September, according to government data Wednesday, on robust shipments to Asia that offset a decline in exports to the U.S., which were impacted by President Donald Trump’s tariffs. Japan’s exports to Asia jumped 9.2% last month c…",
    "link": "https://japantoday.com/category/business/Japan%27s-exports-and-imports-grow-in-September-despite-Trump%27s-tariffs",
    "timestamp": "2025-10-22T21:22:13Z"
  },
  {
    "title": "Trump imposes sanctions against Russia's two biggest oil companies over Ukraine",
    "description": "In a major policy shift, the US has imposed sanctions against Rosneft and Lukoil and dozens of subsidiaries due to \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\".",
    "link": "https://news.sky.com/story/donald-trump-imposes-sanctions-against-russias-two-biggest-oil-companies-as-frustration-grows-with-vladimir-putin-over-the-ukraine-war-13455515",
    "timestamp": "2025-10-22T21:21:00Z"
  },
  {
    "title": "UN court finds Israel must let aid into Gaza",
    "description": "The International Court of Justrice, the UN’s top court, has found that Israel has a responsibility to ensure aid reaches the people of Gaza and cooperate with UN agencies, including UNRWA. Israel severed ties with UNRWA last year, accusing it of collusion wi…",
    "link": "https://www.bbc.co.uk/programmes/w172zssbc6l6vnt",
    "timestamp": "2025-10-22T21:21:00Z"
  },
  {
    "title": "Trump Nukes ‘FAKE NEWS’ Wall Street Journal Report That US Approved Ukraine Using Long-Rang Missiles",
    "description": "President Trump blasted the WSJ for a \"FAKE NEWS\" report he lifted \"a key restriction\" on Ukraine, allowing it to use long-range missiles against Russia.\nThe post Trump Nukes ‘FAKE NEWS’ Wall Street Journal Report That US Approved Ukraine Using Long-Rang Miss…",
    "link": "https://www.mediaite.com/politics/trump-nukes-fake-news-wall-street-journal-report-that-us-approved-ukraine-using-long-rang-missiles/",
    "timestamp": "2025-10-22T21:20:32Z"
  },
  {
    "title": "The Daily Wrap Up — [ Transcript edited for clarity and flow] — Are we still shocked? Really? (Mary L Trump/The Good in Us)",
    "description": "Mary L Trump / The Good in Us:\nThe Daily Wrap Up  —  [ Transcript edited for clarity and flow]  —  Are we still shocked?  Really?  Are we still shocked that a man as despicable and craven and greedy and grifty and destructive as Donald Trump would be all of t…",
    "link": "https://www.memeorandum.com/251022/p125",
    "timestamp": "2025-10-22T21:20:00Z"
  },
  {
    "title": "Ottawa gave Stellantis $105M for Ont. plants before automaker revealed U.S. plans",
    "description": "The federal government gave Stellantis close to $105 million to retool two Ontario plants and is now reviewing the contract to see if the automaker violated the deal by announcing it's moving some Canadian production to the U.S.",
    "link": "https://www.cbc.ca/news/politics/federal-government-gave-stellantis-millions-federal-funding-before-american-plans-9.6949109",
    "timestamp": "2025-10-22T21:19:35Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with NATO Secretary General",
    "description": "President Donald Trump meets with NATO Secretary General Mark Rutte in the Oval Office on Wednesday, October 22.\nThe post Watch Live: Donald Trump Meets with NATO Secretary General appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/10/22/watch-live-donald-trump-meets-with-nato-secretary-general/",
    "timestamp": "2025-10-22T21:18:42Z"
  },
  {
    "title": "Past presidents have made big changes, Trump White House argues",
    "description": "The White House is pushing back against criticism of the ongoing demolition of the building's East Wing, pointing to other renovations under previous presidents.",
    "link": "https://abcnews.go.com/Politics/past-presidents-made-big-trump-white-house-argues/story?id=126757248",
    "timestamp": "2025-10-22T21:17:28Z"
  },
  {
    "title": "Trump administration sanctions big Russian oil companies, presses for Ukraine ceasefire",
    "description": "The new sanctions are related to plans for a meeting between President Donald Trump and Russian leader Vladimir Putin being dropped.",
    "link": "https://biztoc.com/x/8e901055ebf55765",
    "timestamp": "2025-10-22T21:17:05Z"
  },
  {
    "title": "NFL chief Goodell shrugs off Bad Bunny Super Bowl critics",
    "description": "National Football League Commissioner Roger Goodell on Wednesday stood by the choice of Puerto Rican superstar Bad Bunny to headline next year's Super Bowl halftime show, a decision President Donald Trump has branded &quot;absolutely ridiculous.&quot; Speakin…",
    "link": "https://japantoday.com/category/sports/nfl-chief-goodell-shrugs-off-bad-bunny-super-bowl-critics",
    "timestamp": "2025-10-22T21:16:22Z"
  },
  {
    "title": "20 years of YouTube: 2024 brought us the “influencer election” — and a vision of the future",
    "description": "YouTube's first wave of stars rose up because they had something original to say. Lonelygirl15 spoke to a young, anxious generation in a novel way. iJustine ushered in a new era of tech review. Antoine Dodson had a very important safety announcement he wanted…",
    "link": "https://www.tubefilter.com/?p=188860",
    "timestamp": "2025-10-22T21:16:12Z"
  },
  {
    "title": "U.S. strikes eighth alleged drug-carrying boat, this time in Pacific Ocean, killing 2 people",
    "description": "The U.S. military conducted its eighth strike against an alleged drug vessel, killing two people, Defense Secretary Pete Hegseth said Wednesday. The Tuesday night strike occurred in the eastern Pacific Ocean. The seven previous strikes all targeted vessels in…",
    "link": "https://japantoday.com/category/world/trump-administration-announces-another-strike-on-alleged-drug-carrying-boat-in-the-pacific-ocean",
    "timestamp": "2025-10-22T21:15:21Z"
  },
  {
    "title": "North Carolina adopts new Trump-backed U.S. House districts aimed at gaining a Republican seat",
    "description": "North Carolina Republican legislative leaders completed their remapping of the state's U.S. House districts on Wednesday, intent on picking up one more seat to help President Donald Trump's efforts to retain GOP control of Congress in next year's midterm elec…",
    "link": "https://japantoday.com/category/world/north-carolina-gop-poised-to-redraw-house-map-aiming-to-secure-another-seat-for-trump",
    "timestamp": "2025-10-22T21:15:14Z"
  },
  {
    "title": "Air safety in focus as U.S. government shutdown hits fourth week",
    "description": "The U.S. government shutdown entered its fourth week Wednesday, becoming the second longest in history, as Donald Trump's Republicans and the opposition Democrats faced increasing pressure to end a stalemate that has crippled public services. Federal workers …",
    "link": "https://japantoday.com/category/world/air-safety-in-focus-as-us-government-shutdown-hits-fourth-week",
    "timestamp": "2025-10-22T21:15:08Z"
  },
  {
    "title": "Israel's parliament gives initial nod to occupied West Bank annexation",
    "description": "A bill applying Israeli law to the occupied West Bank, a move tantamount to annexation of land which Palestinians want for a state, won preliminary approval from Israel's parliament on Wednesday. The vote was the first of four needed to pass the law and it co…",
    "link": "https://japantoday.com/category/world/israel%27s-parliament-gives-initial-nod-to-occupied-west-bank-annexation2",
    "timestamp": "2025-10-22T21:14:59Z"
  },
  {
    "title": "Russia holds nuclear drills, Ukraine seeks Swedish jets as Trump delays summit",
    "description": "Russia said on Wednesday it had conducted a major training exercise involving nuclear arms, a day after the U.S. announced a delay in plans for a second summit between presidents Donald Trump and Vladimir Putin on the war in Ukraine. The Kremlin released vide…",
    "link": "https://japantoday.com/category/world/russia-holds-nuclear-drills-ukraine-seeks-swedish-jets-as-trump-delays-summit1",
    "timestamp": "2025-10-22T21:14:42Z"
  },
  {
    "title": "Entire White House East Wing to be demolished within days",
    "description": "US President Donald Trump previously said that his ballroom addition would not \"interfere with the current building\".",
    "link": "https://www.bbc.com/news/articles/czxn7lwzx5po",
    "timestamp": "2025-10-22T21:14:34Z"
  },
  {
    "title": "Vance denies U.S. dictates to Israel as he meets with Netanyahu over Gaza ceasefire",
    "description": "U.S. Vice President JD Vance sought Wednesday to ease concerns in Israel that the Trump administration was dictating terms to its closest ally in the Middle East, as he and other top U.S. envoys visit Israel this week to support the Gaza ceasefire agreement. …",
    "link": "https://japantoday.com/category/world/vance-and-netanyahu-meet-to-push-gaza-ceasefire-agreement-forward",
    "timestamp": "2025-10-22T21:14:28Z"
  },
  {
    "title": "Bitcoin to crash below $100K before shocking move, analyst predicts",
    "description": "It has been barely two weeks since Bitcoin (BTC) hit its new all-time high (ATH) of $126,198.07 on Oct. 6. But the rally didn't last long as the crypto...",
    "link": "https://www.thestreet.com/crypto/investing/bitcoin-analyst-price-prediction",
    "timestamp": "2025-10-22T21:13:12Z"
  },
  {
    "title": "Trump slams Ukraine long-range strikes report as 'fake news'",
    "description": "United States President Donald Trump denounced in a Truth Social post on Wednesday a report by the Wall Street Journal of the US allowing Ukraine to strike \"deep into Russia\" with Western-made long-range weapons as \"fake news.\" \"The US has nothing to do with …",
    "link": "https://freerepublic.com/focus/f-chat/4348014/posts",
    "timestamp": "2025-10-22T21:12:46Z"
  },
  {
    "title": "Trump’s Gerrymandering Scheme in Red State Falls Apart at the Seams",
    "description": "Indiana Senate Republicans aren’t falling in line behind President Donald Trump’s gerrymandering scheme to keep control of Congress in the 2026 midterm elections.Molly Swigart, a spokesperson for Indiana Senate President Pro Tempore Rodric Bray, put it simply…",
    "link": "https://newrepublic.com/post/202146/donald-trump-gerrymandering-indiana-falls-apart",
    "timestamp": "2025-10-22T21:12:39Z"
  },
  {
    "title": "JUST IN: Trump to Demolish Entire East Wing of the White House Despite Previous Pledge He Wouldn’t",
    "description": "President Donald Trump's controversial ballroom construction will entail the demolition of the entire East Wing of the White House, according to a new report by The New York Times -- a far more extensive change to the historic property than he originally prom…",
    "link": "https://www.mediaite.com/politics/trump/just-in-trump-to-demolish-entire-east-wing-of-the-white-house-despite-previous-pledge-he-wouldnt/",
    "timestamp": "2025-10-22T21:11:51Z"
  },
  {
    "title": "Political infighting as Iran navigates sanctions, lingering threat of war",
    "description": "Political rivals blame each other as Iranians are further squeezed by sanctions that are unlikely to be lifted soon.",
    "link": "https://www.aljazeera.com/news/2025/10/22/political-infighting-as-iran-navigates-sanctions-lingering-threat-of-war",
    "timestamp": "2025-10-22T21:11:26Z"
  },
  {
    "title": "$250M White House ballroom project grows in scope and raises concerns",
    "description": "The East Wing of the White House is undergoing a more extensive renovation than initially announced during the $250 million ballroom-construction project.",
    "link": "https://www.upi.com/Top_News/US/2025/10/22/east-wing-ballroom/2861761164124/",
    "timestamp": "2025-10-22T21:11:15Z"
  },
  {
    "title": "Bad Bunny Super Bowl halftime show not being reconsidered, Goodell says",
    "description": "The NFL is not considering dropping Bad Bunny as its Super Bowl halftime headline performer, NFL Commissioner Roger Goodell said.",
    "link": "https://www.cbsnews.com/sanfrancisco/news/super-bowl-lx-nfl-keeping-bad-bunny-halftime-show-roger-goodell-says/",
    "timestamp": "2025-10-22T21:10:00Z"
  },
  {
    "title": "Hamas Commandeers Schools and Hospitals To Interrogate Its Gazan Opponents",
    "description": "Hamas militants are reestablishing bases inside hospitals and schools, using civilian infrastructure to interrogate Gazans the terror group accuses of collaborating with Israel, according to Palestinian media reports. \"Hamas's internal security forces have be…",
    "link": "https://freerepublic.com/focus/f-news/4348013/posts",
    "timestamp": "2025-10-22T21:04:55Z"
  },
  {
    "title": "'Fake!' Raging Trump unloads on WSJ over missile report",
    "description": "President Donald Trump raged at the Wall Street Journal on Wednesday after the newspaper published a report about the U.S. lifting key restrictions on Ukraine's long-range missile use. The report says the Trump administration lifted a \"key restriction\" that e…",
    "link": "https://www.rawstory.com/trump-2674224018/",
    "timestamp": "2025-10-22T21:04:03Z"
  },
  {
    "title": "What to know about the $250 million ballroom Trump is adding to the White House",
    "description": "President Donald Trump is adding a $250 million ballroom to the east side of the White House",
    "link": "https://abcnews.go.com/US/wireStory/250-million-ballroom-trump-adding-white-house-126774533",
    "timestamp": "2025-10-22T21:02:29Z"
  },
  {
    "title": "Trump Sends Border Agents to San Francisco Area in Crackdown",
    "description": "The Trump administration is sending more than 100 federal officers to a Coast Guard base outside of San Francisco, a person familiar said, days after President Donald Trump singled out the city as the next target of his federal crime crackdown.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-22/trump-deploys-border-agents-to-san-francisco-area-in-crackdown",
    "timestamp": "2025-10-22T21:01:14Z"
  },
  {
    "title": "Jack Smith Subpoenaed Ted Cruz’s Phone Records; AT&T Refused to Hand Them Over",
    "description": "\"By the way, they launched Arctic Frost — this witch hunt — just three days after Donald Trump launched his reelection campaign. This was all about politics.\"\nThe post Jack Smith Subpoenaed Ted Cruz’s Phone Records; AT&T Refused to Hand Them Over first appear…",
    "link": "https://legalinsurrection.com/2025/10/jack-smith-subpoenaed-ted-cruzs-phone-records-att-refused-to-hand-them-over/",
    "timestamp": "2025-10-22T21:00:55Z"
  },
  {
    "title": "‘I Get it Now’: Stephen A. Smith Apologizes to Jasmine Crockett After Accusing Her of Using ‘Street Verbiage’",
    "description": "Stephen A. Smith on Wednesday apologized to Rep. Jasmine Crockett (D-TX) for accusing the congresswoman of using \"street verbiage.\"\nThe post ‘I Get it Now’: Stephen A. Smith Apologizes to Jasmine Crockett After Accusing Her of Using ‘Street Verbiage’ first ap…",
    "link": "https://www.mediaite.com/politics/i-get-it-now-stephen-a-smith-apologizes-to-jasmine-crockett-after-accusing-her-of-using-street-verbiage/",
    "timestamp": "2025-10-22T21:00:49Z"
  },
  {
    "title": "Immigration, AI, Social Media Intersect in Unions’ Battle With Trump Administration",
    "description": "Unions are suing the Trump administration to prevent the potential deportation of noncitizens who express support for Hamas terrorists or who celebrated the assassination of... Read More\nThe post Immigration, AI, Social Media Intersect in Unions’ Battle With …",
    "link": "https://www.dailysignal.com/2025/10/22/immigration-ai-social-media-intersect-union-battle-trump-administration/",
    "timestamp": "2025-10-22T21:00:37Z"
  },
  {
    "title": "US to unveil major Russia sanctions after Putin ‘not honest’ in talks, says Treasury chief",
    "description": "WASHINGTON: The United States will announce a major expansion of sanctions against Russia within hours, Treasury Secretary Scott Bessent said on Wednesday (Oct 22), a day after President Donald Tru",
    "link": "https://www.channelnewsasia.com/world/us-unveil-major-russia-sanctions-after-putin-not-honest-in-talks-says-treasury-chief-5418926",
    "timestamp": "2025-10-22T20:59:00Z"
  },
  {
    "title": "Trump administration agrees to deliver more student loan forgiveness",
    "description": "The Trump administration has agreed to cancel student debt under programs it had partially blocked, reopening a path to student loan forgiveness for millions of borrowers. The outcome is the result of an agreement reached on Friday between the U.S. Department…",
    "link": "https://freerepublic.com/focus/f-news/4348012/posts",
    "timestamp": "2025-10-22T20:58:00Z"
  },
  {
    "title": "Hakeem Jeffries Says Mike Johnson Gave Him Silent Treatment on Threats",
    "description": "House Speaker Mike Johnson has apparently chosen the silent treatment in response to a threat on the life of one of his colleagues.Minority Leader Hakeem Jeffries told reporters Wednesday that he still hadn’t heard from the Republican House leader, days after…",
    "link": "https://newrepublic.com/post/202147/hakeem-jeffries-mike-johnson-death-threats",
    "timestamp": "2025-10-22T20:56:43Z"
  },
  {
    "title": "Rand Paul Slams Trump Admin For Strikes On Alleged Drug Boats: 'It's Summary Execution!'",
    "description": "The constitutional Republican has been unwavering in his stance since the first U.S. military strike on a suspected drug vessel near Venezuela last month.",
    "link": "https://www.huffpost.com/entry/rand-paul-slams-trump-admin-military-strikes-drug-boats_n_68f903efe4b0d0ec549c6e9a",
    "timestamp": "2025-10-22T20:55:53Z"
  },
  {
    "title": "‘They Have Been Giving Health Care to Illegal Immigrants!’ Fox Anchor Brawls With Democrat Over Shutdown - NewsBreak",
    "description": "John Roberts and Chris Coons brawled on Tuesday over the current government shutdown, with Roberts pointing out that President Donald Trump is only benefit",
    "link": "https://www.newsbreak.com/share/4305154263184-they-have-been-giving-health-care-to-illegal-immigrants-fox-anchor-brawls-with-democrat-over-shutdown?s=a2&amp;share_destination_id=MTI5MzEyMjE2LTE3NjExNjY0NzkwMTQ%3D&amp;pd=08ka0uBv&amp;hl=en_US&amp;send_time=1761166479&amp;share_comment_id=t4jwqq24zly0&amp;actBtn=shareButton&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-22T20:55:07Z"
  },
  {
    "title": "Anti-Union, Pro-Israel Billionaires Are Behind Tim Walberg and His Show Trials",
    "description": "Rep. Tim Walberg’s weaponization of antisemitism neatly fulfills his donors’ agenda against unions and public education.",
    "link": "https://truthout.org/articles/anti-union-pro-israel-billionaires-are-behind-tim-walberg-and-his-show-trials/",
    "timestamp": "2025-10-22T20:54:59Z"
  },
  {
    "title": "University of Virginia strikes deal to pause Trump administration investigations",
    "description": "The U.S. Justice Department has announced an agreement with the University of Virginia to pause civil rights investigations",
    "link": "https://abcnews.go.com/US/wireStory/university-virginia-strikes-deal-pause-trump-administration-investigations-126772910",
    "timestamp": "2025-10-22T20:54:18Z"
  },
  {
    "title": "Jeanine Pirro Announces Charges Against Two More DC Teens Over ‘Big Balls’ Attack",
    "description": "U.S. Attorney for D.C. Jeanine Pirro announced on Monday charges against two teens allegedly involved in the attack against a Department of Government Efficiency staffer over the summer. Federal prosecutors have charged Lawrence Cotton-Powell, 19, along with …",
    "link": "https://freerepublic.com/focus/f-news/4348009/posts",
    "timestamp": "2025-10-22T20:52:27Z"
  },
  {
    "title": "Carney Plots ‘Talent Attraction’ Plan as US Upends H-1B Process",
    "description": "Canadian Prime Minister Mark Carney is set to announce that his government’s upcoming budget will introduce an immigration plan that includes a talent attraction strategy.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-plots-talent-attraction-plan-as-us-upends-h-1b-process",
    "timestamp": "2025-10-22T20:52:15Z"
  },
  {
    "title": "Carney plots 'talent attraction' plan as U.S. upends H-1B",
    "description": "Prime Minister Mark Carney says his government’s upcoming budget will introduce an immigration plan to attract talent. Read more.",
    "link": "https://financialpost.com/news/carney-talent-attraction-us-h-1b-process",
    "timestamp": "2025-10-22T20:52:15Z"
  },
  {
    "title": "Trump Claims He’d Give His $230 Million Justice Department Grift to Charity. Yeah, Right.",
    "description": "On Tuesday, shortly after the New York Times reported that President Donald Trump is demanding $230 million from the Department of Justice (DOJ) to reimburse him for legal costs related to earlier federal investigations against him, the president claimed he w…",
    "link": "https://www.motherjones.com/politics/2025/10/trump-230-million-justice-department-settlement-charity-grift/",
    "timestamp": "2025-10-22T20:51:31Z"
  },
  {
    "title": "Exclusive-US mulls curbs on exports to China made with US software, sources say",
    "description": "By Alexandra Alper, Michael Martina, Jeffrey Dastin and Karen Freifeld (Reuters) -The Trump administration is considering a plan to curb a dizzying array of ...",
    "link": "https://finance.yahoo.com/news/exclusive-us-mulls-curbs-exports-204954374.html",
    "timestamp": "2025-10-22T20:49:54Z"
  },
  {
    "title": "“Allowed Trump to win”: Sanders points out Harris campaign flaws on conservative podcast",
    "description": "The Vermont senator criticized Harris' campaign on comedian Tim Dillon's podcast.",
    "link": "https://www.salon.com/2025/10/22/allowed-trump-to-win-sanders-points-out-harris-campaign-flaws-on-conservative-podcast/",
    "timestamp": "2025-10-22T20:49:46Z"
  },
  {
    "title": "President says he's owed 'lot of money' over federal probes. Here's how govt could pay him...",
    "description": "President Donald Trump has suggested he’s entitled to compensation from the federal government over investigations he faced that he claims were politically motivated. Now, the Justice Department that Trump has exerted control over could approve a hefty payout…",
    "link": "https://apnews.com/article/trump-investigations-justice-department-payment-a16d573fc417592d5cefebbd2847094f",
    "timestamp": "2025-10-22T20:46:39Z"
  },
  {
    "title": "Fight over new US House districts in California could turn on advertising edge in closing days",
    "description": "Less than two weeks from Election Day, a potentially decisive edge in California's fight over new U.S. House districts has emerged: advertising",
    "link": "https://abcnews.go.com/Politics/wireStory/fight-new-us-house-districts-california-turn-advertising-126774069",
    "timestamp": "2025-10-22T20:46:28Z"
  },
  {
    "title": "Trump's White House makeover 'far more extensive than he let on': report",
    "description": "President Donald Trump announced over the summer that he wouldn't touch any of the historic White House in the construction of his massive gold ballroom. The New York Times reported, citing a senior administration official, that not only has it been proven no…",
    "link": "https://www.rawstory.com/trump-ballroom-2674223775/",
    "timestamp": "2025-10-22T20:46:13Z"
  },
  {
    "title": "Is Trump the Frontrunner for Nobel Peace Prize After Massive Diplomatic Successes?",
    "description": "The Following is a preview of Daily Signal Politics Editor Bradley Devlin’s interview with State Department Deputy Spokesman Tommy Pigott on “The Signal Sitdown.” The... Read More\nThe post Is Trump the Frontrunner for Nobel Peace Prize After Massive Diplomati…",
    "link": "https://www.dailysignal.com/2025/10/22/is-trump-the-frontrunner-for-nobel-peace-prize-after-massive-diplomatic-successes/",
    "timestamp": "2025-10-22T20:45:48Z"
  },
  {
    "title": "University of Virginia strikes deal with Trump administration to pause civil rights investigations",
    "description": "The U.S. Justice Department on Wednesday announced an agreement with the University of Virginia to pause Trump administration civil rights investigations.",
    "link": "https://www.pbs.org/newshour/education/university-of-virginia-strikes-deal-with-trump-administration-to-pause-civil-rights-investigations",
    "timestamp": "2025-10-22T20:44:37Z"
  },
  {
    "title": "Trump wins big in National Guard case, but court fights are far from over",
    "description": "The case is one of many court challenges centered on Trump's authority to deploy federalized National Guard troops to U.S. cities.",
    "link": "https://www.foxnews.com/politics/trump-wins-big-national-guard-case-court-fights-far-from-over",
    "timestamp": "2025-10-22T20:44:28Z"
  },
  {
    "title": "Why Senate Republicans ‘Cheered’ At Trump’s New Shutdown Advice",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 21, 2025\nRepublican senators were relieved when President Donald Trump urged them to remain steadfast in refusing to negotiate with Democrats until they vote to reopen the government, Sen. Steve Daine…",
    "link": "https://biztoc.com/x/9ebd9a7d5cc37823",
    "timestamp": "2025-10-22T20:44:10Z"
  },
  {
    "title": "Trump Admin Reveals Devastating Impact Of Shutdown On Small Businesses",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 21, 2025\nHundreds of small businesses are in peril during the federal government shutdown as they are unable to access their federal government loans, according to President Donald Trump’s Small Busin…",
    "link": "https://biztoc.com/x/4c7c8ab65d0c92c8",
    "timestamp": "2025-10-22T20:44:08Z"
  },
  {
    "title": "Trump Evaluates Chances Of Defeating Socialist Mamdani If GOP Candidate Quits NYC Mayoral Race",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 21, 2025\nPresident Donald Trump said Tuesday that independent New York mayoral candidate Andrew Cuomo has a chance of winning against socialist Zohran Mamdani if the Republican candidate, Curtis Sliwa…",
    "link": "https://biztoc.com/x/0122e7da58f42429",
    "timestamp": "2025-10-22T20:44:07Z"
  },
  {
    "title": "'Pro-Trump Propagandists' Take Over Pentagon Press Corps After Signing Loyalty Pledge",
    "description": "Less than a week after most journalists covering the US Department of Defense turned in their press credentials and carried out their belongings in boxes over Secretary Pete Hegseth's new restrictions on reporters, his chief spokesperson announced \"the next g…",
    "link": "https://www.commondreams.org/news/pentagon-propaganda",
    "timestamp": "2025-10-22T20:43:31Z"
  },
  {
    "title": "White House's entire East Wing to be demolished 'within days,' officials say",
    "description": "The entire East Wing of the White House will be demolished “within days,” according to two Trump administration officials.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-administration-demolishing-entire-east-wing-white-house-add-new-rcna239018",
    "timestamp": "2025-10-22T20:41:01Z"
  },
  {
    "title": "White House admits East Wing will be TOTALLY demolished as Trump goes for cheaper option",
    "description": "The White House has admitted that the East Wing will be totally demolished to make way for Donald Trump's new ballroom. Trump had originally claimed that the 83-year-old building wouldn't be touched in the construction of the $250 million privately-funded bal…",
    "link": "https://freerepublic.com/focus/f-news/4348008/posts",
    "timestamp": "2025-10-22T20:40:25Z"
  },
  {
    "title": "Trump says he's owed a 'lot of money' over federal probes. Here's how the government could pay him",
    "description": "President Donald Trump has suggested he’s entitled to compensation from the federal government over investigations he faced that he claims were politically motivated",
    "link": "https://abcnews.go.com/US/wireStory/trump-owed-lot-money-federal-probes-government-pay-126772999",
    "timestamp": "2025-10-22T20:37:48Z"
  },
  {
    "title": "More Than 170 U.S. Citizens Have Been Held By Immigration Agents. They’ve Been Kicked, Dragged And Detained For Days.",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. When the Supreme Court recently allowed immigration agents in the Los Angeles area to take race into consideration during sweeps, Justice Brett Kavanaugh said that…",
    "link": "https://www.techdirt.com/2025/10/22/more-than-170-u-s-citizens-have-been-held-by-immigration-agents-theyve-been-kicked-dragged-and-detained-for-days/",
    "timestamp": "2025-10-22T20:36:49Z"
  },
  {
    "title": "Arizona AG Sues House Over Speaker Johnson’s Refusal to Swear In Grijalva",
    "description": "Johnson claims he's following standard precedent — one that he himself disregarded for Republicans earlier this year.",
    "link": "https://truthout.org/articles/arizona-ag-sues-house-over-speaker-johnsons-refusal-to-swear-in-grijalva/",
    "timestamp": "2025-10-22T20:36:33Z"
  },
  {
    "title": "Rutte Holds a Last-Minute Meeting With Trump on Russia-Ukraine",
    "description": "Ahead of the meeting, the NATO chief stoked the U.S. president’s ego and brushed off concerns about a lack of progress in cease-fire talks.",
    "link": "http://foreignpolicy.com/2025/10/22/mark-rutte-trump-russia-ukraine-cease-fire-putin-zelensky/",
    "timestamp": "2025-10-22T20:35:04Z"
  },
  {
    "title": "Roger Goodell defends Bad Bunny as Super Bowl 60 halftime show headliner amid criticism",
    "description": "The announcement that Bad Bunny will headline the Super Bowl 60 Halftime Show has sparked a mix of excitement and controversy. \nSome critics have questioned the decision, but NFL C",
    "link": "https://www.marca.com/en/nfl/2025/10/22/68f92d7d268e3e695f8b460c.html",
    "timestamp": "2025-10-22T20:34:07Z"
  },
  {
    "title": "Trump slams Ukraine long-range strikes report as 'fake news'",
    "description": "United States President Donald Trump denounced in a Truth Social post on Wednesday a report by the Wall Street Journal of the US allowing Ukraine to strike Russia with Western-made long-range weapons ...",
    "link": "https://biztoc.com/x/aa843e02e549d28b",
    "timestamp": "2025-10-22T20:32:51Z"
  },
  {
    "title": "Homes With Trump Signs Were Passed Over For Federal Disaster Aid—Now The DOJ May Step In",
    "description": "By Fred Lucas, The Daily Signal | October 21, 2025\nThe Justice Department could investigate Biden administration emergency response employees who “systematically” avoided helping disaster survivors who displayed yard signs or flags supporting Donald Trump or …",
    "link": "https://biztoc.com/x/40b7b42cf80a3632",
    "timestamp": "2025-10-22T20:32:49Z"
  },
  {
    "title": "Trump delivers confusing speech amid shutdown crisis",
    "description": "President Donald Trump delivered an unconventional speech during a Rose Garden lunch event for Republican lawmakers, creating widespread discussion about his communication style amid the ongoing federal government shutdown. The address included unusual charac…",
    "link": "https://rollingout.com/2025/10/22/trumps-unusual-remarks-during-speech/",
    "timestamp": "2025-10-22T20:32:27Z"
  },
  {
    "title": "University of Virginia strikes deal to pause Trump administration investigations",
    "description": "Officials accused its president of failing to end diversity, equity and inclusion practices Trump has called unlawful.",
    "link": "https://www.bostonherald.com/2025/10/22/trump-education-virginia/",
    "timestamp": "2025-10-22T20:31:15Z"
  },
  {
    "title": "Maine Senate candidate Graham Platner admits using ‘indefensible’ antigay slurs in unearthed Reddit posts",
    "description": "A progressive U.S. Senate candidate in Maine, who has already apologized for earlier misogynistic and racially insensitive remarks and said he did not realize that a tattoo on his chest resembled a Nazi SS emblem, is again under scrutiny, this time for anti-L…",
    "link": "https://www.advocate.com/politics/graham-platner-homophobic-posts",
    "timestamp": "2025-10-22T20:29:34Z"
  },
  {
    "title": "Tesla’s Q3 Earnings Fall Short After Record Sales—As Revenues Soared",
    "description": "The automaker earlier reported a record-setting number of vehicle deliveries through the quarter.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/22/teslas-q3-earnings-fall-short-after-record-sales-as-revenues-soared/",
    "timestamp": "2025-10-22T20:29:03Z"
  },
  {
    "title": "Trump says he's owed a 'lot of money' over federal probes. Here's how the government could pay him",
    "description": "President Donald Trump has suggested he's entitled to compensation from the federal government over investigations he faced that he claims were politically...",
    "link": "https://www.yahoo.com/news/articles/trump-says-hes-owed-lot-202846184.html",
    "timestamp": "2025-10-22T20:28:46Z"
  },
  {
    "title": "US military strikes suspected drug vessel in the Pacific",
    "description": "WASHINGTON (Reuters) -The U.S. military killed two alleged drug smugglers in a strike against a vessel in the Eastern Pacific Ocean, U.S. Defense Secretary Pete Hegseth said on Wednesday, an attack that expands the Trump administration's use of the military i…",
    "link": "https://www.thestar.com.my/news/world/2025/10/23/us-military-strikes-suspected-drug-vessel-in-the-pacific",
    "timestamp": "2025-10-22T20:28:00Z"
  },
  {
    "title": "Paramount Skydance boss eyes Warner Bros. Discovery purchase— and Trump is in his corner",
    "description": "As the Post has exclusively reported, David Zaslav has rejected three private offers for WBD from Paramount Skydance.",
    "link": "https://nypost.com/2025/10/22/media/paramount-skydance-boss-has-trump-in-his-corner-as-he-seeks-to-buy-warner-bros-discovery/",
    "timestamp": "2025-10-22T20:27:15Z"
  },
  {
    "title": "US Set to Boost Russia Sanctions as Trump Puts Off Putin Meeting",
    "description": "The US will announce a “substantial” new round of sanctions against Russia, Treasury Secretary Scott Bessent said, signaling President Donald Trump is preparing to ratchet up pressure on Moscow a day after backing off plans for a meeting with President Vladim…",
    "link": "https://financialpost.com/pmn/business-pmn/us-set-to-boost-russia-sanctions-as-trump-puts-off-putin-meeting",
    "timestamp": "2025-10-22T20:26:35Z"
  },
  {
    "title": "South Africa Unveils New Energy Policy",
    "description": "The continent’s largest emitter aims to cut coal and invest in nuclear and gas.",
    "link": "http://foreignpolicy.com/2025/10/22/south-africa-nuclear-gas-coal-eskom-integrated-resource-plan/",
    "timestamp": "2025-10-22T20:22:58Z"
  },
  {
    "title": "'I certainly disagree': Defecting Dem called out by own party on CNN",
    "description": "A defecting Democrat was called out by his own party on Wednesday, with a leading Democrat telling CNN, \"I certainly disagree.\"Rep. Katherine Clark (D-MA), the House Minority Whip, responded to anchor Brianna Keilar's questions about the government shutdown a…",
    "link": "https://www.rawstory.com/john-fetterman-2674223718/",
    "timestamp": "2025-10-22T20:21:42Z"
  },
  {
    "title": "White House East Wing Being Fully Demolished For Trump’s Ballroom (Photos)",
    "description": "The privately funded ballroom will be approximately 90,000 square feet, much larger than the White House itself.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/22/white-house-east-wing-being-fully-demolished-for-trumps-ballroom-photos/",
    "timestamp": "2025-10-22T20:20:56Z"
  },
  {
    "title": "Why Europe needs Britain’s under-fire security chief Jonathan Powell",
    "description": "Amid a row over a collapsed China spying trial, it's not just Keir Starmer who relies on veteran Northern Ireland peace negotiator Jonathan Powell.",
    "link": "https://www.politico.eu/article/europe-britain-security-chief-jonathan-powell/",
    "timestamp": "2025-10-22T20:20:31Z"
  },
  {
    "title": "US to announce 'substantial' Russia sanctions",
    "description": "The announcement comes as NATO Secretary-General Mark Rutte was due to meet with Donald Trump in Washington.",
    "link": "https://www.bbc.com/news/articles/cd6758pn6ylo",
    "timestamp": "2025-10-22T20:19:44Z"
  },
  {
    "title": "Roger Goodell stands firm on Bad Bunny Super Bowl halftime show after Trump calls selection 'ridiculous'",
    "description": "NFL commissioner Roger Goodell defended Bad Bunny's Super Bowl halftime show amid President Trump criticism and fan backlash over the Puerto Rican star's political comments.",
    "link": "https://www.foxnews.com/sports/roger-goodell-stands-firm-bad-bunny-super-bowl-halftime-show-after-trump-calls-selection-ridiculous",
    "timestamp": "2025-10-22T20:18:45Z"
  },
  {
    "title": "Jeffries rips ICE as 'out of control,' claims Americans have 'turned on' Trump over immigration",
    "description": "House Democrats attack Trump's immigration efforts as the White House defends ICE officers facing increased assaults from \"unhinged rhetoric\" and activist criticism.",
    "link": "https://www.foxnews.com/politics/jeffries-rips-ice-out-control-claims-americans-have-turned-on-trump-over-immigration",
    "timestamp": "2025-10-22T20:18:12Z"
  },
  {
    "title": "NFL stands by Bad Bunny as Super Bowl halftime headliner despite criticism from Trump",
    "description": "The NFL is not considering replacing Bad Bunny as its Super Bowl halftime performer, Commissioner Roger Goodell said Wednesday, reaffirming the decision to put the Grammy-winning Puerto Rican artist on the league's biggest stage — a decision that's led to cri…",
    "link": "https://www.cbc.ca/news/entertainment/bad-bunny-halftime-nfl-9.6949081",
    "timestamp": "2025-10-22T20:17:59Z"
  },
  {
    "title": "Trump Kills Two People as He Expands “Drug Boat” Strikes to New Front",
    "description": "President Trump’s unilateral, indiscriminate “drug boat” bombings have expanded from the Caribbean Sea to the Pacific Ocean.“Yesterday, at the direction of President Trump, the Department of War conducted a lethal kinetic strike on a vessel being operated by …",
    "link": "https://newrepublic.com/post/202144/trump-kills-two-people-expands-drug-boat-strikes-pacific",
    "timestamp": "2025-10-22T20:17:13Z"
  },
  {
    "title": "Key members of Young Republicans group chat weren't 'college kids'",
    "description": "The Young Republicans group chat members whose jokes about rape, slavery and Hitler were exposed in a Politico investigation in October 2025 were all college kids.",
    "link": "https://www.snopes.com//fact-check/college-kids-young-republicans-group-chat/",
    "timestamp": "2025-10-22T20:16:00Z"
  },
  {
    "title": "Why is Trump targeting antifa under terrorism laws?",
    "description": "The US is bringing terrorism charges against protesters who allegedly provided material support to antifa.",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/10/22/aje-onl-usa_antifacharged_av_v2-221025",
    "timestamp": "2025-10-22T20:15:58Z"
  },
  {
    "title": "Melania Trump Sued By Michael Wolff In Response To First Lady’s $1B Defamation Threats Over Jeffrey Epstein Statements: “Turning The Tables On The Trumps,” Says Journo",
    "description": "“To be perfectly honest, I’d like nothing better than to get Donald Trump and Melania Trump under oath in front of a court reporter, and actually find out all of the details of their relationship with Epstein,” said Micheal Wolff today. Along a lawsuit filed …",
    "link": "http://deadline.com/2025/10/melania-trump-michael-wolff-lawsuit-defamation-epstein-1236594313/",
    "timestamp": "2025-10-22T20:15:45Z"
  },
  {
    "title": "She Thinks Charlie Kirk Deserved to Die—What We Heard at the No Kings Rally in DC",
    "description": "Thousands of people, most of them over the age of 60, hit the streets of Washington, D.C., on Saturday to protest our extremely authoritarian—and definitely... Read More\nThe post She Thinks Charlie Kirk Deserved to Die—What We Heard at the No Kings Rally in D…",
    "link": "https://www.dailysignal.com/2025/10/22/thinks-charlie-kirk-deserved-die-heard-kings-day-rally-dc/",
    "timestamp": "2025-10-22T20:15:00Z"
  },
  {
    "title": "Tesla stock lower after Q3 earnings miss, minimal robotaxi updates",
    "description": "Tesla reported mixed third quarter results on Wednesday after the bell, as the company forges ahead in post-EV tax credit environment, with investors eyeing ...",
    "link": "https://finance.yahoo.com/news/tesla-stock-lower-after-q3-earnings-miss-minimal-robotaxi-updates-201407352.html",
    "timestamp": "2025-10-22T20:14:07Z"
  },
  {
    "title": "EXCLUSIVE: Jim Banks Aims To Put The Kibosh On Foreign Billionaires Ruining America",
    "description": "Republican Indiana Sen. Jim Banks unveiled a bill on Wednesday to prohibit foreign donations on ballot measures, the Daily Caller News Foundation first learned.",
    "link": "https://dailycaller.com/2025/10/22/exclusive-jim-banks-put-kibosh-on-foreign-billionaires-ruining-america/",
    "timestamp": "2025-10-22T20:13:52Z"
  },
  {
    "title": "Christian Musician Arrested over Child Sexual Abuse Material",
    "description": "Christian Musician Arrested over Child Sexual Abuse Materialcafemom.com",
    "link": "https://cafemom.com/entertainment/christian-musician-trump-rally",
    "timestamp": "2025-10-22T20:11:10Z"
  },
  {
    "title": "Senate Democrats demand top Trump advisor Steve Witkoff provide details on crypto investments, lack of divestment",
    "description": "Senate Democrats sent Steve Witkoff, President Donald Trump’s special envoy to the Middle East, a letter Wednesday calling for more details about his personal crypto interests. Led by Sen. Adam Schiff (D—Calif.), eight senators demanded Witkoff to explain why…",
    "link": "https://biztoc.com/x/571057562253d2b5",
    "timestamp": "2025-10-22T20:10:47Z"
  },
  {
    "title": "Tylenol-Maker Kenvue’s Stock Is Down 30% in 2025. Its Fate May Be in the FDA’s Hands",
    "description": "could really use some good news. The Johnson & Johnson (JNJ) spinoff faced longlasting troubles regarding its talc-based baby powder products, including allegations that they caused cancer and related lawsuits.\nNow, the consumer health giant faces new trouble…",
    "link": "https://biztoc.com/x/c1c4e026ac950b9a",
    "timestamp": "2025-10-22T20:10:45Z"
  },
  {
    "title": "Trump 'Only One' Who Can End Russia's War: NATO's Rutte",
    "description": "NATO Secretary General Mark Rutte in Washington to meet with President Donald Trump at the White House on Wednesday.\nWhen asked by reporters on the merits of a potential second meeting between Trump and Putin, the NATO chief continued to stand behind Trump.\n\"…",
    "link": "https://biztoc.com/x/2f6938ecae2b06c6",
    "timestamp": "2025-10-22T20:10:36Z"
  },
  {
    "title": "NFL is not reconsidering Bad Bunny’s Super Bowl halftime show, Goodell says",
    "description": "The NFL is not considering dropping Bad Bunny as its Super Bowl halftime headline performer, Commissioner Roger Goodell said Wednesday, reaffirming a decision to put the Grammy-winning Puerto Rican artist on the league's biggest stage that led to criticism fr…",
    "link": "https://biztoc.com/x/831a73d2b3176c78",
    "timestamp": "2025-10-22T20:10:33Z"
  }
]