[
  {
    "title": "'Have my house' - Usyk invites Trump to witness Ukraine war",
    "description": "Ukrainian heavyweight champion Oleksandr Usyk offers his house to US president Donald Trump to experience the war in his country.",
    "link": "https://www.bbc.com/sport/boxing/articles/c4gej271x22o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-08T12:35:18Z"
  },
  {
    "title": "'Have my house' - Usyk invites Trump to witness Ukraine war",
    "description": "Ukrainian heavyweight champion Oleksandr Usyk offers his house to US president Donald Trump to experience the war in his country.",
    "link": "https://www.bbc.com/sport/boxing/articles/c4gej271x22o",
    "timestamp": "2025-06-08T12:35:15Z"
  },
  {
    "title": "Trump: $100 Million Ballroom For Me; No Health Care For You!",
    "description": "Trump also paused his adolescent feud with former Co-president Elon Musk to boast about the royal trappings the wannabe dictator longs for.\nVia Raw Story:\nPresident Donald Trump bragged that he was funding a \"beautiful Ballroom\" attached to the White House in…",
    "link": "https://crooksandliars.com/2025/06/trump-100-million-ballroom-me-no-health",
    "timestamp": "2025-06-08T12:33:27Z"
  },
  {
    "title": "Trump Federalizes CA Guard, Says He Will Send Troops To L.A.",
    "description": "So far, the national media mostly has taken the weekend off. As far as I know, no \"rioting and looting.\" Via BBC.com:\nUS President Donald Trump is deploying 2,000 National Guardsmen in Los Angeles to deal with unrest over raids on undocumented migrants.\r\n\nHis…",
    "link": "https://crooksandliars.com/2025/06/trump-federalizes-ca-guard-says-he-will",
    "timestamp": "2025-06-08T12:33:18Z"
  },
  {
    "title": "Bitcoin Rebound From $100,000 – Healthy Pullback Or Start Of Deeper Correction?",
    "description": "On Thursday, Bitcoin (BTC) prices dipped to below $101,000 as fallout between US President Donald Trump and world’s wealthiest man Elon Musk rocked the US financial markets. However, in the past 48 hours, the maiden cryptocurrency has registered a rebound cli…",
    "link": "https://bitcoinist.com/bitcoin-rebound-100000-pullback-deeper-correction/",
    "timestamp": "2025-06-08T12:30:49Z"
  },
  {
    "title": "What Hitler, Putin And Trump May Have In Common — By A Psychologist",
    "description": "Recent research reveals that the roots of a power-hungry leadership style may lie in early childhood experiences of trauma.",
    "link": "https://www.forbes.com/sites/traversmark/2025/06/08/what-hitler-putin-and-trump-may-have-in-common---by-a-psychologist/",
    "timestamp": "2025-06-08T12:30:43Z"
  },
  {
    "title": "Trump Taps Musk to “Rebuild Government from the Ground Up,” Says One Tech Insider",
    "description": "New briefing uncovers AI facility in Tennessee designed to power America’s future — and it’s not run by Washington, but by Elon Musk New briefing uncovers AI facility in Tennessee designed to power America’s future — and it’s not run by Washington, but by Elo…",
    "link": "https://www.globenewswire.com/news-release/2025/06/08/3095566/0/en/Trump-Taps-Musk-to-Rebuild-Government-from-the-Ground-Up-Says-One-Tech-Insider.html",
    "timestamp": "2025-06-08T12:30:00Z"
  },
  {
    "title": "U.S.-Backed Aid Project in Gaza Reopens After Threats from Hamas",
    "description": "The Gaza Humanitarian Foundation (GHF) reopened on Sunday after closing for the day on Saturday due to specific threats from Hamas, which opposes the project because it undermines its control over access to aid.\nThe post U.S.-Backed Aid Project in Gaza Reopen…",
    "link": "https://www.breitbart.com/middle-east/2025/06/08/u-s-backed-aid-project-in-gaza-reopens-after-threats-from-hamas/",
    "timestamp": "2025-06-08T12:25:35Z"
  },
  {
    "title": "June 7, 2025 — In April, John Phelan, the U.S. Secretary of the Navy under President Donald J. Trump ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nJune 7, 2025  —  In April, John Phelan, the U.S. Secretary of the Navy under President Donald J. Trump, posted that he visited the U.S.S. Arizona Memorial “to pay my respects to the service members and civili…",
    "link": "https://www.memeorandum.com/250608/p6",
    "timestamp": "2025-06-08T12:25:00Z"
  },
  {
    "title": "Chinese hackers and user lapses turn smartphones into a ‘mobile security crisis’ - Boston News, Weather, Sports | WHDH 7News",
    "description": "Cybersecurity investigators noticed a highly unusual software crash — it was affecting a small number of smartphones belonging to people who worked in government, politics,<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/chinese-hackers-and-user-lapse…",
    "link": "https://whdh.com/news/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/",
    "timestamp": "2025-06-08T12:24:08Z"
  },
  {
    "title": "How Will Trump-Elon Musk Feud Impact the ‘Big Beautiful Bill?’",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist to discuss how President Donald Trump and billionaire Elon Musk’s falling out over Trump’s budget bill will impact its fate in the Senate and Republican lawmakers who are forced to take…",
    "link": "https://www.today.com/video/how-will-trump-elon-musk-feud-impact-the-big-beautiful-bill-241132613743",
    "timestamp": "2025-06-08T12:23:49Z"
  },
  {
    "title": "Dave Chappelle Talks Political Comedy, Donald Trump and Hosting ‘SNL’",
    "description": "Dave Chappelle\r\n sat down with fellow comedian Mo Amer\r\n for a one-on-one interview as part of Variety’s “\r\nActors On Actors” series\r\n. In the interview, Chappelle admits that he wasn’t especially prepared for his first time hosting Saturday Night Live.\n“The …",
    "link": "https://www.okayplayer.com/dave-chappelle-talks-political-comedy-donald-trump-and-hosting-snl",
    "timestamp": "2025-06-08T12:21:48Z"
  },
  {
    "title": "Trump Tells NBC He Has ‘No Intention’ of Speaking to Elon Musk",
    "description": "After President Donald Trump and Elon Musk’s relationship ruptured over disagreement about the deficit impact in the president’s massive budget bill, the president told NBC he has “no intention” of speaking to Musk. Trump warned Musk not to retaliate politica…",
    "link": "https://www.today.com/video/trump-tells-nbc-he-has-no-intention-of-speaking-to-elon-musk-241131589578",
    "timestamp": "2025-06-08T12:21:37Z"
  },
  {
    "title": "LA Protests: Trump's National Guard Move Sparks Legal Concerns",
    "description": "On Saturday, the White House ordered the deployment of the National Guard to Los Angeles to quell protests against immigration raids.",
    "link": "https://www.newsweek.com/la-protests-trump-national-guard-move-legal-concerns-2082432",
    "timestamp": "2025-06-08T12:20:42Z"
  },
  {
    "title": "Congress is moving ahead on this Trump campaign promise",
    "description": "As a presidential candidate last year, Donald Trump called for no taxes on tips — an exemption from the federal income tax for all tipped income.\nSo where does that promise stand now? There is a provision in the “big, beautiful bill” passed by the House in Ma…",
    "link": "https://biztoc.com/x/b8943876fbd447b7",
    "timestamp": "2025-06-08T12:20:01Z"
  },
  {
    "title": "The Trump-Musk feud is a lose-lose for the American people",
    "description": "President Donald Trump and Elon Musk's fight has one threatening to fund Democrats or a new party and the other attacking SpaceX and Tesla funding.",
    "link": "https://biztoc.com/x/86372ba8a384d7f9",
    "timestamp": "2025-06-08T12:20:00Z"
  },
  {
    "title": "Trump to Deploy National Guard in LA Amid ICE Protests",
    "description": "President Donald Trump has ordered the National Guard to Los Angeles as federal agents continue to clash with protesters in the wake of a series of immigration raids around the city. The president signed a memorandum federalizing 2,000 California National Gua…",
    "link": "https://www.today.com/video/trump-orders-national-guard-to-la-amid-ice-protests-241130053988",
    "timestamp": "2025-06-08T12:18:50Z"
  },
  {
    "title": "President Trump Sans Elon Musk Receives a Rock Star Welcome at UFC 316 in Newark, NJ (Video)",
    "description": "Once again, President Trump received a rock star welcome on Saturday night as he entered the Prudential Center for UFC 316 in Newark, New Jersey.\nThe post President Trump Sans Elon Musk Receives a Rock Star Welcome at UFC 316 in Newark, NJ (Video) appeared fi…",
    "link": "https://www.thegatewaypundit.com/2025/06/president-trump-sans-elon-receives-rock-star-welcome/",
    "timestamp": "2025-06-08T12:15:35Z"
  },
  {
    "title": "Hegseth accused of 'straining at the leash' with threat to send Marines to LA",
    "description": "A decision by Defense Secretary Pete Hegseth to inflame tensions in Los Angeles as protesters take to the streets to confront militarized ICE and DHS agents invading communities looking for immigrants, led one military expert to be very alarmed on MSNBC on Su…",
    "link": "https://www.rawstory.com/hegseth-la-protesters/",
    "timestamp": "2025-06-08T12:13:01Z"
  },
  {
    "title": "Democrats wooing Musk after the Trump breakup is US plutocracy at its best",
    "description": "Apparently, Musk’s money can buy quick forgiveness in the ‘Democratic’ Party.",
    "link": "https://www.aljazeera.com/opinions/2025/6/8/democrats-wooing-musk-after-the-trump-breakup-is-us-plutocracy-at-its-best",
    "timestamp": "2025-06-08T12:11:31Z"
  },
  {
    "title": "Trump wants to bring manufacturing jobs back. The aviation industry can't hire fast enough",
    "description": "LAFAYETTE, Ind. — President Donald Trump has said he wants to bolster manufacturing jobs and other technical employment in the United States. But in the aviation industry, finding skilled workers to make airplanes and engines — and maintaining those jobs for …",
    "link": "https://biztoc.com/x/73654bafb0e8d720",
    "timestamp": "2025-06-08T12:09:06Z"
  },
  {
    "title": "Boston Consulting Group CEO Caves to Antisemitic Mob; Apologizes for Helping U.S.-Backed Gaza Aid Project",
    "description": "Christoph Schweizer, CEO of Boston Consulting Group (BCG), apologized Friday under pressure from anti-Israel activists for his company's past role in a U.S.-backed alternative to Hamas and the United Nations in Gaza.\nThe post Boston Consulting Group CEO Caves…",
    "link": "https://www.breitbart.com/middle-east/2025/06/08/boston-consulting-group-ceo-caves-to-antisemitic-mob-apologizes-for-helping-u-s-backed-gaza-aid-project/",
    "timestamp": "2025-06-08T12:08:53Z"
  },
  {
    "title": "Elon Musk couldn’t change Trump’s mind on electric vehicles",
    "description": "Elon Musk and President Donald Trump — two of the most powerful, outspoken billionaires in America — are still tangled up in a messy breakup over a variety of issues. It’s no shock that these two men with huge egos would have friction, but it’s interesting to…",
    "link": "https://biztoc.com/x/0a0317e06423a05b",
    "timestamp": "2025-06-08T12:08:43Z"
  },
  {
    "title": "Is strengthening the Canadian economic union another way for Ottawa to centralize power?",
    "description": "Mark Carney aims to create of a highly integrated Canadian economy. But will the provinces have their say and will they be considered true partners?",
    "link": "https://theconversation.com/is-strengthening-the-canadian-economic-union-another-way-for-ottawa-to-centralize-power-258132",
    "timestamp": "2025-06-08T12:07:00Z"
  },
  {
    "title": "Westinghouse pursues US nuclear expansion after Trump orders, FT says",
    "description": "Westinghouse is discussing with US officials and industry partners about deploying ten large reactors. This is in response to President Donald Trump's executive orders. These orders aim to cut regulations and fast-track licenses for reactors. The goal is to r…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/westinghouse-pursues-us-nuclear-expansion-after-trump-orders-ft-says/articleshow/121707194.cms",
    "timestamp": "2025-06-08T12:02:27Z"
  },
  {
    "title": "Golf has a long history in the White House — but for Trump, it's more than a pastime",
    "description": "From Taft to Biden, presidents have had varying relationships with golf, with Trump's approach standing out for using the course as a place to conduct business and forge political relationships.",
    "link": "https://www.foxnews.com/opinion/golf-long-history-white-house-trump-more-than-pastime",
    "timestamp": "2025-06-08T12:00:49Z"
  },
  {
    "title": "OPINION: What Is A Fact? Unfortunately, In Court, It Is Whatever Donald Trump Says It Is",
    "description": "The “political question” doctrine affords the president deference on factual assertions in court, presenting grave dangers to the republic.",
    "link": "https://www.huffpost.com/entry/trump-facts-political-question-doctrine_n_68424444e4b004bd5409c942",
    "timestamp": "2025-06-08T12:00:45Z"
  },
  {
    "title": "Former sex trafficking victim pardoned by President Trump reveals disturbing secrets of legal brothel",
    "description": "Rebecca \"Bekah\" Charleston was arrested in 2006 for tax evasion. The White House said she is a victim of sex trafficking who was forced into prostitution. She was pardoned in 2020.",
    "link": "https://www.foxnews.com/us/former-sex-trafficking-victim-pardoned-president-trump-reveals-disturbing-secrets-legal-brothel",
    "timestamp": "2025-06-08T12:00:37Z"
  },
  {
    "title": "Bold move to keep Americans safe from ‘terrorists’ is basis for US travel ban for some African nations",
    "description": "President Trump enacted travel restrictions for 10 African countries, citing national security concerns, terrorism threats and high visa overstay rates.",
    "link": "https://www.foxnews.com/world/bold-move-keep-americans-safe-from-terrorists-basis-us-travel-ban-some-african-nations",
    "timestamp": "2025-06-08T12:00:13Z"
  },
  {
    "title": "MUSK DAD: SON HAS PTSD FROM WHITE HOUSE...",
    "description": "ELON Musk has “White House PTSD” and thinks he made a mistake by helping Trump get re-elected, his dad has claimed. Errol Musk, 79, made the explosive remarks in Moscow, where he’…",
    "link": "https://www.the-sun.com/news/14426030/elon-musk-dad-ptsd-mistake-trump-white-house/",
    "timestamp": "2025-06-08T12:00:07Z"
  },
  {
    "title": "Trump wants to bring manufacturing jobs back. The aviation industry can't hire fast enough",
    "description": "The aviation industry is facing a retirement wave of workers who make and fix airplanes.",
    "link": "https://www.cnbc.com/2025/06/08/trump-jobs-aviation-airplanes-engines.html",
    "timestamp": "2025-06-08T12:00:01Z"
  },
  {
    "title": "Tears As Dogs Rescued From Animal Testing Center Touch Grass for First Time",
    "description": "Jason Bayless told Newsweek: \"They were denied everything a living being deserves: no sunlight, no fresh air, no gentle touch.\"",
    "link": "https://www.newsweek.com/tears-dogs-rescued-animal-testing-center-touch-grass-first-time-2080777",
    "timestamp": "2025-06-08T12:00:01Z"
  },
  {
    "title": "Harvard Is the Enemy",
    "description": "During his 2024 campaign, President Donald Trump correctly assailed elite universities like Harvard as controlled by “Marxist maniacs and lunatics.” He received a popular mandate... Read More\nThe post Harvard Is the Enemy appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/08/harvard-is-the-enemy/",
    "timestamp": "2025-06-08T12:00:00Z"
  },
  {
    "title": "Musk and Trump Still Agree on One Thing",
    "description": "Whatever they may be fighting about, they are both committed to showering tax cuts on Americans who already have more than they need.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/trump-musk-feud/683070/",
    "timestamp": "2025-06-08T12:00:00Z"
  },
  {
    "title": "Where Is Barack Obama?",
    "description": "The “audacity of hope” presidency has given way to the fierce lethargy of semi-retirement.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/obama-retirement-trump-era/683068/",
    "timestamp": "2025-06-08T12:00:00Z"
  },
  {
    "title": "How Poland’s new President could change Europe — and America",
    "description": "“We won!” announced Rafał Trzaskowski to an ecstatic crowd of supporters. It was just after 9 p.m. this past Sunday, and the exit polls had declared the dashing mayor of Warsaw the winner of Poland’s hard-fought, high-stakes presidential race.  Trzaskowski’s …",
    "link": "https://nypost.com/2025/06/08/world-news/how-polands-new-president-could-change-europe-and-america/",
    "timestamp": "2025-06-08T12:00:00Z"
  },
  {
    "title": "Kevin Holland Calls Out Colby Covington After Beating Vicente Luque at UFC 316",
    "description": "Kevin Holland considers Colby Covington to be an easier matchup than Vicente Luque.",
    "link": "https://www.sherdog.com/news/news/Kevin-Holland-Calls-Out-Colby-Covington-After-Beating-Vicente-Luque-at-UFC-316-197228",
    "timestamp": "2025-06-08T11:58:29Z"
  },
  {
    "title": "Trump deploys 2,000 National Guard troops to Los Angeles in response to anti-ICE protests",
    "description": "President Donald Trump signed a memo late Saturday night federalizing 2,000 California National Guard troops to address what a White House official called the “lawlessness that has been allowed to fester” in Los Angeles.\nThe move to deploy the National Guard …",
    "link": "https://biztoc.com/x/4b86860d1a2430b1",
    "timestamp": "2025-06-08T11:57:55Z"
  },
  {
    "title": "Pope Leo condemns 'exclusionary mindset' in Pentecost address",
    "description": "VATICAN CITY: Pope Leo XIV exhorted the faithful on Sunday (Jun 8) to reject an \"exclusionary mindset\" he said had led to nationalism around the world. Leo's homily did not call out current events and conflicts nor identify individual leaders. But his choice …",
    "link": "https://www.channelnewsasia.com/world/pope-leo-xiv-condemns-exclusionary-mindset-pentecost-address-5170426",
    "timestamp": "2025-06-08T11:54:00Z"
  },
  {
    "title": "Leo XIV, the first US-born pope, criticises nationalism at Sunday mass",
    "description": "Pope Leo criticised the emergence of nationalist political movements around the globe on Sunday, calling them \"unfortunate\" — without naming a specific country or national leader.",
    "link": "https://www.abc.net.au/news/2025-06-08/pope-leo-xiv-criticises-nationalism-sunday-mass/105392026",
    "timestamp": "2025-06-08T11:50:35Z"
  },
  {
    "title": "Shark Tank’s Kevin O’Leary has a bold take on Trump-Musk feud",
    "description": "Ever since President Donald Trump took office after his reelection last year, it's seemed as if he'd acquired a new bestie: Tesla CEO Elon Musk.\nWhen Musk was hired as a special government employee and tasked with running the Department of Government Efficien…",
    "link": "https://biztoc.com/x/22240741103181b0",
    "timestamp": "2025-06-08T11:46:43Z"
  },
  {
    "title": "Chinese hackers and user lapses turn smartphones into a ‘mobile security crisis’",
    "description": "By DAVID KLEPPER WASHINGTON (AP) — Cybersecurity investigators noticed a highly unusual software crash — it was affecting a small number of smartphones belonging to people who worked in government, politics, tech and journalism. The crashes, which began late …",
    "link": "https://www.bostonherald.com/2025/06/08/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/",
    "timestamp": "2025-06-08T11:40:45Z"
  },
  {
    "title": "A diminished DOGE reels from the departure of the ‘Dogefather,’ Elon Musk",
    "description": "Even before the blow-up between the billionaire entrepreneur and President Donald Trump, the cost-cutting group’s influence was waning.",
    "link": "https://biztoc.com/x/48a080708f0f99fc",
    "timestamp": "2025-06-08T11:35:48Z"
  },
  {
    "title": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 48",
    "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape Pure Crypter Malware Analysis: 99 Problems but Detection Ain’t One Attacker exploits misconfigured AI tool to run AI-generate…",
    "link": "https://securityaffairs.com/178766/malware/security-affairs-malware-newsletter-round-48.html",
    "timestamp": "2025-06-08T11:35:30Z"
  },
  {
    "title": "Immigration authorities highlight criminal history of multiple migrants arrested in Los Angeles",
    "description": "Federal immigration authorities said some of the migrants arrested in the Los Angeles area last week had criminal histories that included assault and drug offenses. Nearly 45 people were arrested by Immigration and Customs Enforcement on Friday alone, as offi…",
    "link": "https://freerepublic.com/focus/f-chat/4321666/posts",
    "timestamp": "2025-06-08T11:30:05Z"
  },
  {
    "title": "Trump Confirms Imminent Fed Decision—Bitcoin And Crypto Brace For Huge Price Earthquake",
    "description": "Trump has confirmed decision on the next Federal Reserve chair will be coming out soon, priming the bitcoin price and crypto market...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/08/trump-confirms-imminent-fed-decision-bitcoin-and-crypto-brace-for-huge-price-earthquake/",
    "timestamp": "2025-06-08T11:30:05Z"
  },
  {
    "title": "Trump threatens LA protesters in overnight rant after sending in the troops",
    "description": "Hours after sending in federalized National Guard troops into Los Angeles to support DHS and ICE agents who have been taking part in highly militarized raids on businesses in California and snatching up immigrants, Donald Trump threatened the pro-immigrant pr…",
    "link": "https://www.rawstory.com/trump-protesters-2672330516/",
    "timestamp": "2025-06-08T11:26:32Z"
  },
  {
    "title": "Iggy Pop at In the Meadows review: Old-school rock has rarely felt so timeless and incendiary",
    "description": "There is never a hint of nostalgia throughout a turn that feels powerfully rooted in the here and now",
    "link": "https://www.irishtimes.com/culture/music/review/2025/06/08/iggy-pop-at-in-the-meadows-review-old-school-rock-has-rarely-felt-so-timeless-and-incendiary/",
    "timestamp": "2025-06-08T11:21:23Z"
  },
  {
    "title": "Security Affairs newsletter Round 527 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly Security Affairs newsletter has arrived! Every week, the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Experts …",
    "link": "https://securityaffairs.com/178759/uncategorized/security-affairs-newsletter-round-527-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-06-08T11:20:49Z"
  },
  {
    "title": "Will Musk vs. Trump affect xAI’s $5 billion debt deal?",
    "description": "While the online feud between Elon Musk and President Donald Trump seemed to drive traffic to Musk’s social media platform X (formerly Twitter), it could also create issues for the platform’s parent company xAI.\nMusk merged X and xAI earlier this year, with B…",
    "link": "https://biztoc.com/x/e92bc691563e6014",
    "timestamp": "2025-06-08T11:13:19Z"
  },
  {
    "title": "Italy’s citizenship referendum: What’s at stake?",
    "description": "Left-wing parties decry the lack of public debate on move to speed up naturalisation of immigrants.",
    "link": "https://www.aljazeera.com/news/2025/6/8/italys-citizenship-referendum-whats-at-stake",
    "timestamp": "2025-06-08T11:12:59Z"
  },
  {
    "title": "What Pell Grant changes in Trump budget, House tax bill mean for students",
    "description": "Under both the White House's budget proposal and House Republicans' reconciliation bill, students' access to financial aid through the Pell Grant is at risk.",
    "link": "https://www.cnbc.com/2025/06/08/what-pell-grant-changes-in-trump-budget-house-tax-bill-mean-for-students.html",
    "timestamp": "2025-06-08T11:08:08Z"
  },
  {
    "title": "Trump sets feud with Musk aside and attends UFC fight",
    "description": "Donald Trump appeared and was given a standing ovation by the crowd just before the start of the UFC event at the Prudential Center on Saturday night.\nAt least momentarily, Trump p",
    "link": "https://www.marca.com/en/ufc/2025/06/08/68456b14268e3ead598b45a2.html",
    "timestamp": "2025-06-08T11:05:09Z"
  },
  {
    "title": "TRUMP DEPLOYS TROOPS TO LA",
    "description": "TRUMP DEPLOYS TROOPS TO LA\r\n\n \n \n \n (Main headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://abc7.com/post/protests-erupt-immigration-customs-enforcement-raids-los-angeles-california/16690197/",
    "timestamp": "2025-06-08T11:01:36Z"
  },
  {
    "title": "Iconic Hollywood filmmaker David Mamet dishes on why he was 'kicked out of the left'",
    "description": "Playwright, author and filmmaker David Mamet broke down his conservative values and criticized the entertainment industry's focus on \"social consciousness\" on \"Brian Kilmeade Show.\"",
    "link": "https://www.foxnews.com/media/iconic-hollywood-filmmaker-david-mamet-dishes-why-he-kicked-out-left",
    "timestamp": "2025-06-08T11:00:51Z"
  },
  {
    "title": "Maureen Dowd: Trump-Musk feud shows president knows how to hit a narcissist where it hurts",
    "description": "Trump threatens to take away government contracts that have handsomely enriched Musk",
    "link": "https://www.irishtimes.com/world/us/2025/06/08/trump-musk-feud-president-knows-how-to-hit-a-narcissist-where-it-hurts/",
    "timestamp": "2025-06-08T11:00:00Z"
  },
  {
    "title": "Top U.S. General in Africa Paints Grim Picture of U.S. Military Failures in Africa",
    "description": "After two decades, and many failed counterterrorism efforts, the Trump administration is considering shuttering U.S. Africa Command.\nThe post Top U.S. General in Africa Paints Grim Picture of U.S. Military Failures in Africa appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/08/africa-military-failures-michael-langley-africom/",
    "timestamp": "2025-06-08T11:00:00Z"
  },
  {
    "title": "Messenger: Faith, immigration are linked in our history. So who'll act as Good Samaritans?",
    "description": "Attacks on immigrants betray an American promise that is integral to our history.",
    "link": "https://www.stltoday.com/news/local/column/tony-messenger/article_75ecd617-87fc-41eb-8a12-276ee39a99f1.html",
    "timestamp": "2025-06-08T11:00:00Z"
  },
  {
    "title": "Tariffs Explained: How Trump's Ever-Changing Trade Policy Will Affect You",
    "description": "While Donald Trump's wide-ranging taxes on imports face scrutiny in court, he also continues to alter them and introduce or propose others. Here's what it will mean for you.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-how-trumps-ever-changing-trade-policy-will-effect-you/",
    "timestamp": "2025-06-08T11:00:00Z"
  },
  {
    "title": "Trump's travel ban on 12 countries goes into effect on June 9",
    "description": "Countries affected by latest travel ban are Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen",
    "link": "https://www.thehindubusinessline.com/news/world/trumps-travel-ban-on-12-countries-goes-into-effect-on-june-9/article69671196.ece",
    "timestamp": "2025-06-08T10:59:05Z"
  },
  {
    "title": "Trump Says US Will Ban Wearing Masks at Protests Amid Unrest in Los Angeles",
    "description": "MOSCOW (Sputnik) - The US authorities will prohibit wearing masks at protests against the background of unrest in Los Angeles, US President Donald Trump said on Sunday.",
    "link": "https://sputnikglobe.com/20250608/trump-says-us-will-ban-wearing-masks-at-protests-amid-unrest-in-los-angeles-1122213507.html",
    "timestamp": "2025-06-08T10:53:37Z"
  },
  {
    "title": "NATO Ally 'Can't Rely' Solely on US for Protection, Ex-Trump Adviser Warns",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe U.S. can no longer be considered a reliable ally for Britain and the other NATO members, former Russia adviser to President Donald Trump Fiona Hill said in a recent interview with British newspaper The Gua…",
    "link": "https://biztoc.com/x/cc94bc9fb1c7102d",
    "timestamp": "2025-06-08T10:51:06Z"
  },
  {
    "title": "NATO Ally 'Can't Rely' Solely on US for Protection, Ex-Trump Adviser Warns",
    "description": "Trump's former Russia adviser Fiona Hill said Britain and NATO allies can no longer rely on the U.S. to protect them from Moscow's ambitions.",
    "link": "https://www.newsweek.com/nato-ally-cant-rely-solely-us-protection-ex-trump-advisor-warns-2082427",
    "timestamp": "2025-06-08T10:50:39Z"
  },
  {
    "title": "Elon Musk 'rammed Trump Secretary like a rugby player’ during fiery clash at White House",
    "description": "A new report claims that Tesla CEO Elon Musk got into a physical altercation with a member of the Trump Administration",
    "link": "https://www.ladbible.com/news/us-news/elon-musk-rammed-donald-trump-secretary-white-house-674629-20250608",
    "timestamp": "2025-06-08T10:45:34Z"
  },
  {
    "title": "TIM GRAHAM: Hostile journalists pose as heroes while Trump faces their questions daily",
    "description": "Media reaction to Trump's press availability reveals partisan divide, with critics overlooking Biden's sheltered approach to journalists during his presidency",
    "link": "https://www.foxnews.com/opinion/tim-graham-hostile-journalists-pose-heroes-while-trump-faces-questions-daily",
    "timestamp": "2025-06-08T10:41:08Z"
  },
  {
    "title": "Everyone's rethinking how to tackle the job market these days",
    "description": "In this Sunday edition of Business Insider Today, we're talking about networking dos and don'ts, Florida real estate, and job offer text scams.",
    "link": "https://www.businessinsider.com/bi-today-everyone-rethinking-job-market-networking-2025-6",
    "timestamp": "2025-06-08T10:40:01Z"
  },
  {
    "title": "Trans Actor Laverne Cox Rips Trump at World Pride Parade: ‘F**k Him’",
    "description": "Trans actor and activist Laverne Cox was Grand Marshall on Saturday at the World Pride Parade that flooded the streets of Washington, DC.\nThe post Trans Actor Laverne Cox Rips Trump at World Pride Parade: ‘F**k Him’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/06/08/trans-actor-laverne-cox-rips-trump-at-world-pride-parade-fk-him/",
    "timestamp": "2025-06-08T10:36:26Z"
  },
  {
    "title": "Trump deploys National Guard troops to quell LA protests",
    "description": "US President Donald Trump has signed a memo to send 2,000 California National Guard troops to the Los Angeles area, as protests grow over ICE immigration raids. Follow live.",
    "link": "https://www.dw.com/en/trump-deploys-national-guard-troops-to-quell-la-protests/live-72832870",
    "timestamp": "2025-06-08T10:35:00Z"
  },
  {
    "title": "US updates: National Guard reaches Los Angeles — reports",
    "description": "First National Guard troops have arrived in downtown Los Angeles following clashes over ICE immigration raids, according to footage from the scene. Organizers have called for further protests. Follow DW for more.",
    "link": "https://www.dw.com/en/us-updates-national-guard-reaches-los-angeles-reports/live-72832870",
    "timestamp": "2025-06-08T10:35:00Z"
  },
  {
    "title": "US updates: National Guard reaches Los Angeles after unrest",
    "description": "First National Guard troops have arrived in downtown Los Angeles following clashes over ICE immigration raids, according to footage from the scene. Organizers have called for further protests. Follow DW for more.",
    "link": "https://www.dw.com/en/us-updates-national-guard-reaches-los-angeles-after-unrest/live-72832870",
    "timestamp": "2025-06-08T10:35:00Z"
  },
  {
    "title": "Trump's travel ban on 12 countries goes into effect early Monday",
    "description": "WASHINGTON: US President Donald Trump's order banning citizens of 12 countries from entering the United States goes into effect at 12.01am Eastern Time (12.01pm, Singapore time) on Monday (Jun 9), a move the president promulgated to",
    "link": "https://www.channelnewsasia.com/world/donald-trump-travel-ban-12-countries-goes-effect-early-monday-5170381",
    "timestamp": "2025-06-08T10:31:00Z"
  },
  {
    "title": "New disputes emerge ahead of US-China trade talks in London",
    "description": "U.S.-China trade talks in London this week are expected to take up a series of disputes that have buffeted relations",
    "link": "https://abcnews.go.com/US/wireStory/new-disputes-emerge-ahead-us-china-trade-talks-122623886",
    "timestamp": "2025-06-08T10:30:28Z"
  },
  {
    "title": "Elon Musk Has a History of Acrimonious Breakups",
    "description": "“The relationship between President Donald Trump and billionaire and self-styled “first buddy” Elon Musk ruptured this week, with the former allies trading insults and threats on social media. It’s not the first time Musk has",
    "link": "https://politicalwire.com/2025/06/08/elon-musk-has-a-history-of-acrimonious-breakups/",
    "timestamp": "2025-06-08T10:30:00Z"
  },
  {
    "title": "Arnold Schwarzenegger says it would now be ‘easier’ for him to achieve the ‘American Dream’",
    "description": "The Hollywood legend gave the response after he was asked whether the ‘American dream is still alive?’",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/arnold-schwarzenegger-american-dream-laura-kuenssberg-b2765920.html",
    "timestamp": "2025-06-08T10:21:02Z"
  },
  {
    "title": "Apple under pressure to show it maintained magic after AI slip",
    "description": "Pressure is building up for Apple to demonstrate it hasn&#039;t lost its magic despite broken promises to ramp up iPhones with generative artificial...",
    "link": "https://www.dailysabah.com/business/tech/apple-under-pressure-to-show-it-maintained-magic-after-ai-slip",
    "timestamp": "2025-06-08T10:20:33Z"
  },
  {
    "title": "'Pride' Group Reveals Just How Many Hundreds of Millions Trump Has Cost Them",
    "description": "President Donald Trump has rolled back certain fixtures of \"pride month,\" hitting certain LGBT activist groups right where it hurts.",
    "link": "https://www.westernjournal.com/pride-group-reveals-just-many-hundreds-millions-trump-cost/",
    "timestamp": "2025-06-08T10:18:30Z"
  },
  {
    "title": "‘Mean Girls’ Star Renee Rapp Slams Trump White House at World Pride Parade: ‘They Can F**k Off. They Can Die’",
    "description": "The World Pride Parade took over the streets of Washington, DC, on Saturday in what was self-regardingly hailed as \"a global celebration of 2SLGBTQIA+ culture and identity.\"\nThe post ‘Mean Girls’ Star Reneé Rapp Slams Trump White House at World Pride Parade: …",
    "link": "https://www.breitbart.com/entertainment/2025/06/08/mean-girls-star-renee-rapp-slams-trump-white-house-at-world-pride-parade-they-can-fk-off-they-can-die/",
    "timestamp": "2025-06-08T10:16:15Z"
  },
  {
    "title": "Leaders head to France for UN summit on oceans",
    "description": "World leaders descended on the French Riviera Sunday ahead of a high-level summit to tackle a deepening crisis in the oceans driven by overfishing, climate change and pollution.",
    "link": "https://www.hurriyetdailynews.com/leaders-head-to-france-for-un-summit-on-oceans-210046",
    "timestamp": "2025-06-08T10:15:28Z"
  },
  {
    "title": "What a ‘revenge tax’ in Trump’s spending bill could mean for investors",
    "description": "Trump's spending bill includes a \"revenge tax\" to countries that levy \"unfair foreign taxes\" on U.S. companies. Here's what to know about Section 899.",
    "link": "https://www.cnbc.com/2025/06/08/revenge-tax-trumps-spending-bill.html",
    "timestamp": "2025-06-08T10:15:01Z"
  },
  {
    "title": "From research to restrooms: Summer staffing crunch hits national parks after Trump cuts",
    "description": "CODY, Wyoming (Reuters) -At Yosemite National Park in California, one of the oldest and most popular U.S. natural preserves, the workforce is stretched so...",
    "link": "https://www.yahoo.com/news/research-restrooms-summer-staffing-crunch-100851367.html",
    "timestamp": "2025-06-08T10:08:51Z"
  },
  {
    "title": "How SNAP Benefits Are Impacted by Trump's Tax Bill: What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nHouse Republicans have advanced a sweeping tax and spending bill backed by President Donald Trump that makes significant changes to the Supplemental Nutrition Assistance Program (SNAP), also known as food stam…",
    "link": "https://biztoc.com/x/9c5a580d0c8aa6f1",
    "timestamp": "2025-06-08T10:07:13Z"
  },
  {
    "title": "Retail Investors Pile Into Tesla (TSLA) After 14% Plunge on Trump-Musk Rift",
    "description": "Retail investors bought $201 million net of TSLA stock, per Vanda Research",
    "link": "https://finance.yahoo.com/news/retail-investors-pile-tesla-tsla-100514350.html",
    "timestamp": "2025-06-08T10:05:14Z"
  },
  {
    "title": "Former NTSB Vice Chair Sues Over Unlawful Dismissal",
    "description": "Alvin Brown Was Fired in Early May for Unknown Reasons Alvin Brown, former Jacksonville mayor, is suing President Donald Trump after being removed from his position as vice chair of the National Transportation Safety Board. His dismissal had seemingly no reas…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=90270E90-C298-4F4A-B581-64C2D3EC0619",
    "timestamp": "2025-06-08T10:05:00Z"
  },
  {
    "title": "Bitcoin: How a $10.2M BTC investment is changing the corporate game",
    "description": "Even small firms are making billion-dollar crypto moves before the year ends.",
    "link": "https://ambcrypto.com/bitcoin-how-a-10-2m-btc-investment-is-changing-the-corporate-game/",
    "timestamp": "2025-06-08T10:00:37Z"
  },
  {
    "title": "Chad announces suspension of visas to US citizens in response to Trump travel ban",
    "description": "Chad's President, Mahamat Idriss Deby, announced a visa suspension for U.S. citizens. This is in response to the U.S. travel ban. Donald Trump had banned citizens from twelve countries, including Chad. He cited deficient screening as the reason. Other African…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chad-announces-suspension-of-visas-to-us-citizens-in-response-to-trump-travel-ban/articleshow/121706069.cms",
    "timestamp": "2025-06-08T10:00:29Z"
  },
  {
    "title": "The Head of Tesla’s Humanoid Robot Program Says That He DEFINITELY Wasn't Fired and Is Only Leaving to Spend Time With His Family, Not Because Elon Musk Is on the Warpath",
    "description": "Fresh on the heels of Elon Musk's disgraceful return to Tesla, the head of the company's humanoid robot program is departing — but he swears the decision was his alone. According to an insider who spoke to Bloomberg, Milan Kovac, the head of engineering for t…",
    "link": "https://futurism.com/tesla-humanoid-leader-departure",
    "timestamp": "2025-06-08T10:00:23Z"
  },
  {
    "title": "Apple’s Hotel California trap: It can check out but not leave China",
    "description": "The iPhone maker may shift some more of its gadget production to India and Vietnam, as a book by Patrick McGee argues, but it can’t really quit China. While Trump wants Apple to onshore output, CEO Tim Cook can’t afford to anger Beijing.",
    "link": "https://www.livemint.com/opinion/online-views/apple-china-tim-cook-donald-trump-foxconn-terry-gou-made-in-china-2025-patrick-mcgee-iphone-manufacturing-huawei-india-11749285611407.html",
    "timestamp": "2025-06-08T10:00:04Z"
  },
  {
    "title": "How SNAP Benefits Are Impacted by Trump's Tax Bill: What to Know",
    "description": "More than 40 million low-income Americans rely on SNAP to help pay for groceries each month.",
    "link": "https://www.newsweek.com/how-snap-benefits-impacted-trump-tax-bill-2081781",
    "timestamp": "2025-06-08T10:00:01Z"
  },
  {
    "title": "The anti-vaxxer behind the Meghan McCain-endorsed Covid shot ‘detox’",
    "description": "The daughter of the late Sen. John McCain shilled for a supplement that claims to be a \"detox\" for people who \"regret\" getting the Covid vaccine.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/meghan-mccain-antivax-covid-shot-detox-rcna211505",
    "timestamp": "2025-06-08T10:00:00Z"
  },
  {
    "title": "The Victims of the Trump Administration’s China-Bashing",
    "description": "Michael Luo on Chinese international students, a Cold War-era report, and the perils of the politics of suspicion.",
    "link": "https://www.newyorker.com/magazine/2025/06/16/the-victims-of-the-trump-administrations-china-bashing",
    "timestamp": "2025-06-08T10:00:00Z"
  },
  {
    "title": "Congress is moving ahead on this Trump campaign promise",
    "description": "Donald Trump campaigned on ending federal income tax on tips. Here's where that proposal stands in Congress.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/no-tax-on-tips-trump-beautiful-bill-worker-rcna210399",
    "timestamp": "2025-06-08T10:00:00Z"
  },
  {
    "title": "The Trump-Musk feud is a lose-lose for the American people",
    "description": "President Donald Trump and Elon Musk's fight has one threatening to fund Democrats or a new party and the other attacking SpaceX and Tesla funding.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-musk-feud-donations-contracts-rcna211336",
    "timestamp": "2025-06-08T10:00:00Z"
  },
  {
    "title": "Elon Musk's Father Says Feud With Trump 'a Mistake'",
    "description": "\"They've been under incredible stress for five months, give them a break,\" Errol Musk said while attending a forum by Putin's ultranationalist ally in Moscow.",
    "link": "https://www.newsweek.com/elon-musk-errol-musk-donald-trump-feud-2082425",
    "timestamp": "2025-06-08T09:59:33Z"
  },
  {
    "title": "Leo, the first US pope, criticises nationalist politics at Sunday Mass",
    "description": "VATICAN CITY (Reuters) -Pope Leo criticized the emergence of nationalist political movements on Sunday, calling them unfortunate, without naming a specific country or national leader. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/08/leo-the-first-us-pope-criticises-nationalist-politics-at-sunday-mass",
    "timestamp": "2025-06-08T09:56:00Z"
  }
]