[
  {
    "title": "Mamdani Identified as Asian and African American on College Application",
    "description": "As he runs for mayor of New York City, Zohran Mamdani has made his identity as a Muslim immigrant of South Asian descent a key part of his appeal. But as a high school senior in 2009, Mr. Mamdani, the Democratic nominee, claimed another label when he applied …",
    "link": "https://freerepublic.com/focus/f-news/4326776/posts",
    "timestamp": "2025-07-03T22:58:39Z"
  },
  {
    "title": "White knuckles and ‘massive unknowns’ ahead of Trump’s July 9th tariff deadline",
    "description": "The 90-day pause on reciprocal tariffs is set to expire on July 9, and U.S. consumers and investors are left waiting in limbo as President Donald Trump negotiates deals with trade partners. Experts tell Fortune Trump’s next moves could put his credibility in …",
    "link": "https://biztoc.com/x/03fb92f2b70c4a90",
    "timestamp": "2025-07-03T22:56:47Z"
  },
  {
    "title": "The Idaho firefighter attack shows the cost of missing early signs of extremism",
    "description": "Three firefighters were shot in Idaho this week, two of them killed, after a 20-year-old man set a fire and lured them into an ambush before attacking from a perch in a tree.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/idaho-firefighter-attack-extremism-signs-missed-deadly-rcna216716",
    "timestamp": "2025-07-03T22:54:31Z"
  },
  {
    "title": "Red Sox players meet President Trump on White House tour",
    "description": "Several Red Sox players met President Trump on Thursday while on a tour of the White House.",
    "link": "https://www.bostonherald.com/2025/07/03/red-sox-players-meet-president-trump-on-white-house-tour/",
    "timestamp": "2025-07-03T22:54:15Z"
  },
  {
    "title": "Why Republicans once staunchly opposed to Trump’s bill changed their minds",
    "description": "For more on how Republicans, even those who were staunchly opposed to the so-called \"One Big, Beautiful Bill,\" have since come around, William Brangham spoke with Sarah Longwell, a Republican strategist and publisher of The Bulwark.",
    "link": "https://www.pbs.org/newshour/show/why-republicans-once-staunchly-opposed-to-trumps-bill-changed-their-minds",
    "timestamp": "2025-07-03T22:53:49Z"
  },
  {
    "title": "MAGA-fueled group calls the feds on the Los Angeles Dodgers over DEI",
    "description": "America First Legal, a right-wing activist group founded by White House policy director Stephen Miller, claims the Dodgers’ diversity programs amount to illegal discrimination.",
    "link": "https://www.msnbc.com/top-stories/latest/los-angeles-dodgers-dei-complaint-stephen-miller-ice-raids-rcna216870",
    "timestamp": "2025-07-03T22:53:47Z"
  },
  {
    "title": "White knuckles and ‘massive unknowns’ ahead of Trump’s July 9th tariff deadline",
    "description": "Trump’s next moves could impact how countries go about the next round of trade talks",
    "link": "https://fortune.com/2025/07/03/trump-tariff-deadline-trade-deals-inflation-business/",
    "timestamp": "2025-07-03T22:52:24Z"
  },
  {
    "title": "Donald Trump’s Favorite Schtick Is Dead In The Water",
    "description": "The outcome of this bill will be a net negative for everyone except the rich — and it’s time to throw Donald Trump’s populist working-class schtick in the trash.",
    "link": "https://www.huffpost.com/entry/donald-trump-budget-bill_n_6866f478e4b0225e8f8c014e",
    "timestamp": "2025-07-03T22:52:21Z"
  },
  {
    "title": "Scoop: Ramaswamy pledges to spend at least $30M of his money in Ohio's race for governor",
    "description": "Trump-backed former presidential candidate and multi-millionaire Vivek Ramaswamy pledged to spend at least $30 million of his own money in his Republican campaign for Ohio governor.",
    "link": "https://www.foxnews.com/politics/scoop-ramaswamy-pledges-spend-least-30-million-his-money-ohio-governor-campaign",
    "timestamp": "2025-07-03T22:51:32Z"
  },
  {
    "title": "What Donald Trump’s “Big, Beautiful Bill” Does, And Does Not Do, For Hollywood",
    "description": "When Donald Trump signs the “Big, Beautiful Bill” on Friday, it will be a starting point for a big messaging battle with an eye on the 2026 midterms. Hollywood activists are likely to play a big part of that, particularly on the left, where the concern is not…",
    "link": "http://deadline.com/2025/07/trump-big-beautiful-bill-hollywood-1236449251/",
    "timestamp": "2025-07-03T22:49:40Z"
  },
  {
    "title": "Netanyahu vows to bring all Gaza hostages home",
    "description": "Israeli premier Benjamin Netanyahu vowed to bring home all the hostages still held by militants in war-stricken Gaza, where the civil defence agency said 73 ...",
    "link": "https://www.yahoo.com/news/gaza-civil-defence-says-israeli-163055024.html",
    "timestamp": "2025-07-03T22:45:47Z"
  },
  {
    "title": "Trump in midst of his own ‘Golden Age’ as list of accomplishments wows critics: ‘Nothing short of remarkable’",
    "description": "President Trump is at the height of his political power following Thursday's passage of his “One Big Beautiful Bill Act”.",
    "link": "https://nypost.com/2025/07/03/us-news/trump-in-midst-of-his-own-golden-age-as-list-of-remarkable-accomplishments-wows-critics/",
    "timestamp": "2025-07-03T22:40:33Z"
  },
  {
    "title": "'Big mask off moment': GOP rep caught gloating after '17 million people lost health care'",
    "description": "In a now-deleted social media post, Rep. Derrick Van Orden (R-Wis.) seemed to boast that millions would lose health coverage due to the Medicaid cuts in President Donald Trump’s “One Big Beautiful Bill Act,” which passed the House on Thursday after an overnig…",
    "link": "https://www.alternet.org/derrick-van-orden-bill-tweet/",
    "timestamp": "2025-07-03T22:39:48Z"
  },
  {
    "title": "EPA workers in Denver among 139 put on leave for signing ‘Declaration of Dissent’ letter",
    "description": "The “Declaration of Dissent” letter shows at least 13 current and retired Region 8 employees as signatories.",
    "link": "https://www.denverpost.com/2025/07/03/epa-dissent-letter-administrative-leave-region-8/",
    "timestamp": "2025-07-03T22:39:37Z"
  },
  {
    "title": "WATCH: Trump discusses House’s final passage of his big bill as he departs for Iowa",
    "description": "GOP leaders worked overnight to pass Trump’s $4.5 trillion tax breaks and spending cuts bill, and the president himself leaned on a handful of skeptics to drop their opposition and send the bill to his desk to become law.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-discusses-houses-final-passage-of-his-big-bill-as-he-departs-for-iowa",
    "timestamp": "2025-07-03T22:39:07Z"
  },
  {
    "title": "Trump Addresses One Of Two Republican Reps Who Voted Against BBB",
    "description": "Trump expressed his disappointment in Rep. Fitzpatrick after he voted \"no\" on the BBB, according to Daily Caller's White House correspondent Reagan Reese.",
    "link": "https://dailycaller.com/2025/07/03/donald-trump-republican-rep-brian-fitzpatrick-big-beautiful-bill/",
    "timestamp": "2025-07-03T22:38:40Z"
  },
  {
    "title": "Passage of budget reconciliation act sparks varied Catholic response",
    "description": "USCCB President Archbishop Timothy Broglio speaks at the bishops’ spring meeting, Thursday, June 13, 2024. / Credit: USCCB\n\nCNA Staff, Jul 3, 2025 / 18:38 pm (CNA).\nThe U.S. House of Representatives passed the “One Big Beautiful Bill Act” on Thursday, just in…",
    "link": "https://www.catholicnewsagency.com/news/265187/passage-of-budget-reconciliation-act-sparks-varied-catholic-response",
    "timestamp": "2025-07-03T22:38:00Z"
  },
  {
    "title": "Donald Trump's Daughter Tiffany Trump Unveils First Photo of Baby Boy",
    "description": "Tiffany Trump shared a photo of her husband Michael Boulos' new addition, Alexander, in a July 3 Instagram post. She announced his birth on May 15, when she shared a photo of only his foot.",
    "link": "https://www.eonline.com/news/1419449/donald-trumps-daughter-tiffany-trumps-first-photo-of-baby-boy",
    "timestamp": "2025-07-03T22:30:49Z"
  },
  {
    "title": "America Worst, Codified: Trump’s Horrific, Harmful, Horrendous Bill and Our Future",
    "description": "America Worst has arrived in full, right on time for July 4. Cue the war-mimicking fireworks, that ultra-American metaphor for this country’s “virtual” wars and endless militarism. Years in the making, decades of trickle-down, warmongering, and fearmongering …",
    "link": "https://www.commondreams.org/opinion/big-bill-is-america-worst",
    "timestamp": "2025-07-03T22:27:46Z"
  },
  {
    "title": "Despite Lisa Murkowski’s Deals, Alaskans Will Suffer Under Trump’s Tax Bill",
    "description": "The GOP senator knew the legislation would hurt her constituents and had a chance to tank the whole thing, but she voted to pass it anyway.",
    "link": "https://www.huffpost.com/entry/lisa-murkowski-alaska-suffer-trump-tax-bill_n_68658de4e4b0c546723f85ff",
    "timestamp": "2025-07-03T22:27:33Z"
  },
  {
    "title": "Mamdani campaign hires former Obama, Clinton spokesperson who wished death on Trump",
    "description": "Former Obama and Hillary Clinton staffer Zara Rahim, who publicly wished death on President Trump after his 2020 COVID-19 diagnosis, has found a new gig consulting for Zohran Mamdani’s mayoral campaign.",
    "link": "https://nypost.com/2025/07/03/us-news/mamdani-campaign-hires-former-obama-clinton-spokesperson-who-wished-death-on-trump/",
    "timestamp": "2025-07-03T22:26:59Z"
  },
  {
    "title": "Dr. Phil's Anti-Woke TV Network Sues Christian Broadcaster After Filing For Bankruptcy",
    "description": "Merit Street Media accused its distributor, Trinity Broadcasting Network, of \"sabotage.\"",
    "link": "https://www.huffpost.com/entry/dr-phil-merit-street-media-bankruptcy_n_6866e81fe4b0bde15485b1de",
    "timestamp": "2025-07-03T22:26:28Z"
  },
  {
    "title": "Trump administration torpedoes SCOTUS with emergency requests and sees surprising success",
    "description": "The Supreme Court's 6-3 majority has largely supported Trump's sweeping policy actions through emergency applications, allowing controversial measures to proceed.",
    "link": "https://www.foxnews.com/politics/trump-administration-torpedoes-scotus-emergency-requests-sees-surprising-success",
    "timestamp": "2025-07-03T22:26:27Z"
  },
  {
    "title": "Small business owners struggling to fill jobs, survey finds",
    "description": "A survey of thousands of the nation’s small businesses found that filling job openings remains a challenge. Some owners say finding quality labor is the biggest problem.",
    "link": "https://www.fox4news.com/news/small-business-owners-struggling-fill-jobs-survey-finds",
    "timestamp": "2025-07-03T22:25:54Z"
  },
  {
    "title": "SCOTUS: WH allowed to deport men to South Sudan",
    "description": "The United States Supreme Court has allowed the administration of US President Donald Trump to deport eight men who have been detained in a shipping container for six weeks to South Sudan after a lega...",
    "link": "https://biztoc.com/x/17cb3c493dbf7635",
    "timestamp": "2025-07-03T22:22:49Z"
  },
  {
    "title": "‘A slap in the face’: Georgia and Arkansas’ Medicaid work rules may preview the road ahead",
    "description": "President Donald Trump is expected to sign into law on Friday his sprawling domestic policy bill, which includes nearly $1 trillion in cuts to Medicaid, the government health insurance program for low-income and disabled Americans.",
    "link": "https://biztoc.com/x/560bf9d5ef0c8a71",
    "timestamp": "2025-07-03T22:22:45Z"
  },
  {
    "title": "‘A slap in the face’: Georgia and Arkansas’ Medicaid work rules may preview the road ahead",
    "description": "President Donald Trump is expected to sign into law on Friday his sprawling domestic policy bill, which includes nearly $1 trillion in cuts to Medicaid, the government health insurance program for low-income and disabled Americans.",
    "link": "https://biztoc.com/x/560bf9d5ef0c8a71",
    "timestamp": "2025-07-03T22:22:45Z"
  },
  {
    "title": "Wittman, Kiggans back Trump bill, despite Medicaid cuts",
    "description": "Rep. Rob Wittman, R-1st, and Rep. Jen Kiggans, R-2nd, had told Republican leaders that they could not support legislation that would reduce Medicaid health coverage for vulnerable populations.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_ff3b916f-b0c4-4e47-be23-e617b87bd4d6.html",
    "timestamp": "2025-07-03T22:22:00Z"
  },
  {
    "title": "Russia Doubles Budget for State-Sponsored ‘Youth Army’",
    "description": "The Kremlin has doubled its funding in 2025 for Yunarmiya (\"Youth Army\"), the state-sponsored youth organization that combines ideological indoctrination with military training for children and teenagers. According to documents reviewed by the independent Moz…",
    "link": "https://freerepublic.com/focus/f-news/4326773/posts",
    "timestamp": "2025-07-03T22:20:44Z"
  },
  {
    "title": "Zac Starkey on His New Supergroup, and Moving on After Being Fired Twice by the ‘F—ing Crazy’ Who: ‘I’m the Most Famous Drummer on Welfare’",
    "description": "“I’m now the most famous drummer on welfare,” jokes Zac Starkey, and few music fans who follow the news at all will have any trouble knowing what he’s talking about. Few musicians have been more visible in recent years as a permanent pickup player, as Starkey…",
    "link": "https://variety.com/2025/music/news/zac-starkey-drummer-who-fired-mantra-cosmos-interview-1236447116/",
    "timestamp": "2025-07-03T22:18:38Z"
  },
  {
    "title": "Dem ignites showdown after declaring GOP is only pro-life so kids can grow up and 'get shot in school’",
    "description": "Gen Z Congressman Maxwell Frost faces backlash after controversial remarks about Republicans' pro-life stance during a House hearing that resulted in a tense exchange with Virginia Foxx.",
    "link": "https://www.foxnews.com/politics/dem-ignites-showdown-after-declaring-gop-only-pro-life-so-kids-can-grow-up-get-shot-school",
    "timestamp": "2025-07-03T22:14:26Z"
  },
  {
    "title": "2nd LD Writethru: U.S. House passes Trump's One Big Beautiful Bill",
    "description": "NEW YORK, July 3 (Xinhua) -- The U.S. House of Representatives passed President Donald Trump's One Big Beautiful Bill with a vote of 218 to 214 on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/04/2nd-ld-writethru-us-house-passes-trump039s-one-big-beautiful-bill",
    "timestamp": "2025-07-03T22:14:00Z"
  },
  {
    "title": "Simon Harris tells 4th of July party ‘the bombs have to stop’ in Gaza",
    "description": "Tánaiste was addressing celebration held by the new US Ambassador to Ireland, Edward Walsh",
    "link": "https://www.irishtimes.com/politics/2025/07/04/simon-harris-tells-4th-of-july-party-the-bombs-have-to-stop-in-gaza/",
    "timestamp": "2025-07-03T22:12:04Z"
  },
  {
    "title": "Harris tells 4th of July party ‘the bombs have to stop’ in Gaza",
    "description": "Tánaiste was addressing celebration held by the new US Ambassador to Ireland, Edward Walsh",
    "link": "https://www.irishtimes.com/politics/2025/07/04/harris-tells-4th-of-july-party-the-bombs-have-to-stop-in-gaza/",
    "timestamp": "2025-07-03T22:12:04Z"
  },
  {
    "title": "‘I Have More Power Now’: Trump On His Grip Over the GOP Compared to His First Term",
    "description": "“I think I have more power now. I do,” Trump replied, adding, “You know, I could say, ‘Oh gee, I don't know.’ I think I probably do.\"\nThe post ‘I Have More Power Now’: Trump On His Grip Over the GOP Compared to His First Term first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/i-have-more-power-now-trump-on-his-grip-over-the-gop-compared-to-his-first-term/",
    "timestamp": "2025-07-03T22:09:53Z"
  },
  {
    "title": "‘YES!’: Republican Celebrates Americans Losing Health Care in Deleted Post",
    "description": "Rep. Derrick Van Orden (R-WI) joined Republicans in celebrating one of the lowest points in U.S. history.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-medicaid-cuts-republicans-celebrate-1235378986/",
    "timestamp": "2025-07-03T22:09:28Z"
  },
  {
    "title": "'Alligator Alcatraz' Unpopular Among Americans—Poll",
    "description": "Americans aren't on board with the Everglades detention center, according to a new YouGov poll released Thursday.",
    "link": "https://www.newsweek.com/alligator-alcartaz-florida-detention-center-unpopular-poll-2094509",
    "timestamp": "2025-07-03T22:09:04Z"
  },
  {
    "title": "Democrats warn 'Americans will die' as Congress passes Trump's 'big, beautiful bill'",
    "description": "Democratic National Committee Chair Ken Martin has warned that Americans will \"die\" as a result of Donald Trump's “big beautiful bill,” after Congress passed the president’s signature domestic policy package. The House narrowly voted to approve the bill Thurs…",
    "link": "https://freerepublic.com/focus/f-news/4326772/posts",
    "timestamp": "2025-07-03T22:08:43Z"
  },
  {
    "title": "Fox News Politics Newsletter: 'Big, Beautiful Bill' passed by Congress",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-july-3-draft2",
    "timestamp": "2025-07-03T22:06:44Z"
  },
  {
    "title": "300,000 Pennsylvania residents could lose Medicaid under 'big beautiful bill.'",
    "description": "300,000 Pennsylvania residents could lose Medicaid under 'big beautiful bill.'inquirer.com",
    "link": "https://www.inquirer.com/health/medicaid-expansion-federal-cuts-20250703.html",
    "timestamp": "2025-07-03T22:05:16Z"
  },
  {
    "title": "Trump ignored GOP warnings to gamble on a politically risky bill (Washington Post)",
    "description": "Washington Post:\nTrump ignored GOP warnings to gamble on a politically risky bill  —  In Trump's eagerness to score a win and extend tax cuts, he walked away from a key campaign promise on Medicaid.  —  Sen. Thom Tillis (R-North Carolina) told President Donal…",
    "link": "https://www.memeorandum.com/250703/p117",
    "timestamp": "2025-07-03T22:05:00Z"
  },
  {
    "title": "The Trump Administration Calls This ICE-Spotting App ‘Reckless’ — But It’s A Classic Form Of Protest",
    "description": "Is the ICE-spotting app really \"reckless and irresponsible\" — or is it just bringing some much needed accountability to law enforcement?",
    "link": "https://www.huffpost.com/entry/ice-sightings-iceblock-app-community-care_n_6866ae33e4b0bde154857598",
    "timestamp": "2025-07-03T22:04:58Z"
  },
  {
    "title": "‘No progress’ made in Putin call – Trump",
    "description": "US President Donald Trump has said he held a “pretty long” phone conversation with his Russian counterpart Vladimir Putin on Thursday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620966-trump-putin-ukraine-no-progress/",
    "timestamp": "2025-07-03T22:04:42Z"
  },
  {
    "title": "NY hospitals, health experts warn of 'catastrophic' Medicaid impacts - NewsBreak",
    "description": "If the omnibus Trump bill is approved, New York health officials say the overall impact to the state would be “devastating” and estimate billions in losses",
    "link": "https://www.newsbreak.com/share/4086274054065-ny-hospitals-health-experts-warn-of-catastrophic-medicaid-impacts?_f=app_share&amp;pd=0JcMU8B3&amp;lang=en_US&amp;send_time=1751580203&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.18.0.43%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v1%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_model_exp_25q2_v2-v8&amp;s=i2",
    "timestamp": "2025-07-03T22:03:50Z"
  },
  {
    "title": "As Rumors Swirl About Savannah Chrisley Joining DWTS, I'm Way More Intrigued By The Thought Of A Twilight Alum Joining",
    "description": "Let's get them all into the ballroom.",
    "link": "https://www.cinemablend.com/television/rumors-savannah-chrisley-joining-dwts-im-more-intrigued-by-thought-of-twilight-taylor-lautner-joining",
    "timestamp": "2025-07-03T22:01:19Z"
  },
  {
    "title": "First immigration detainees arrive at ‘Alligator Alcatraz’ in Florida Everglades",
    "description": "The first group of immigrants has arrived at a new detention center deep in the Florida Everglades that officials have dubbed “Alligator Alcatraz,” a spokesperson for Republican state Attorney General James Uthmeier told The Associated Press.",
    "link": "https://www.pbs.org/newshour/nation/first-immigration-detainees-arrive-at-alligator-alcatraz-in-florida-everglades",
    "timestamp": "2025-07-03T22:01:18Z"
  },
  {
    "title": "Commentary: Trump’s ‘Great Deal’ with Vietnam is no trade agreement",
    "description": "It’s impossible to assess the impact of President Donald Trump’s “great deal of cooperation” with Vietnam right now, beyond its clear message of the US desire for increasing decoupling from China, says US politics expert Steven R Okun.",
    "link": "https://www.channelnewsasia.com/commentary/us-vietnam-trade-deal-tariff-china-decoupling-5218471",
    "timestamp": "2025-07-03T22:00:00Z"
  },
  {
    "title": "Cato Demanded Mass Migration, Gets $170 Billion for Deportations",
    "description": "The pro-migration advocates who lobbied for President Joe Biden's mass migration are now mourning the result of their unpopular push: Congress's elected politicians voted to accelerate deportations with $170 billion in spending.\nThe post Cato Demanded Mass Mi…",
    "link": "https://www.breitbart.com/economy/2025/07/03/cato-demanded-mass-migration-gets-170-billion-for-deportations/",
    "timestamp": "2025-07-03T21:59:35Z"
  },
  {
    "title": "Dow jumps more than 300 points, S&P 500 sets new record after strong June jobs report",
    "description": "U.S. stocks rose on Thursday, with the S&P 500 and Nasdaq Composite hitting fresh record highs, after a better-than-expected jobs report fueled optimism the U.S. economy was hanging tough despite fast-changing trade policy and geopolitics",
    "link": "https://www.nbcnews.com/business/markets/dow-jumps-300-points-sp-500-sets-new-record-strong-june-jobs-report-rcna216774",
    "timestamp": "2025-07-03T21:59:08Z"
  },
  {
    "title": "Boxer Julio Cesar Chavez Jr arrested by US immigration",
    "description": "The boxer, who fought against Jake Paul on Saturday, is accused of ties to the Sinaloa drug cartel.",
    "link": "https://www.bbc.com/news/articles/czrypmzp88xo",
    "timestamp": "2025-07-03T21:55:25Z"
  },
  {
    "title": "‘A slap in the face’: Georgia and Arkansas’ Medicaid work rules may preview the road ahead",
    "description": "President Donald Trump is expected to sign into law on Friday his sprawling domestic policy bill, which includes nearly $1 trillion in cuts to Medicaid, the government health insurance program for low-income and disabled Americans.",
    "link": "https://www.nbcnews.com/health/health-news/georgia-arkansas-medicaid-work-rules-preview-s-coming-nationwide-rcna216235",
    "timestamp": "2025-07-03T21:54:45Z"
  },
  {
    "title": "Arkansas’s congressmen all vote to slash their constituents’ health insurance - Arkansas Times",
    "description": "When these Medicaid cuts kick in, Republicans are banking on voters being too stupid to remember where the cuts came from. It’s quite a gamble.",
    "link": "http://arktimes.com/arkansas-blog/2025/07/03/arkansass-congressmen-all-vote-to-slash-their-constituents-health-insurance",
    "timestamp": "2025-07-03T21:53:16Z"
  },
  {
    "title": "200 Marines among those being sent to Florida to help ICE",
    "description": "The Trump Administration is sending 200 Marines to Florida to aid federal immigration enforcement officers.",
    "link": "https://abcnews.go.com/Politics/200-marines-florida-ice/story?id=123466361",
    "timestamp": "2025-07-03T21:51:31Z"
  },
  {
    "title": "U.S. trade deficit widens in May as Trump tariffs fuel uncertainty",
    "description": "The U.S. trade deficit widened more than expected in May, with both imports and exports declining as U.S. President Donald Trump's tariffs sent shock waves through the economy and snagged supply chains. Trade data published Thursday showed the world's biggest…",
    "link": "https://japantoday.com/category/business/us-trade-deficit-widens-in-may-as-trump-tariffs-fuel-uncertainty",
    "timestamp": "2025-07-03T21:50:50Z"
  },
  {
    "title": "Union members threaten and harass residents who dare drop off garbage during Philadelphia strike: 'This is disgraceful'",
    "description": "On the third day of a union strike of municipal workers, garbage is piling up in Philadelphia, and some workers are resorting to threats and vandalism against residents who dare to break the strike. The City of Philadelphia is negotiating with members of the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4326770/posts",
    "timestamp": "2025-07-03T21:49:55Z"
  },
  {
    "title": "Donald Trump Reveals Details of Vladimir Putin Call",
    "description": "The call marked the sixth publicly acknowledged conversation between the two leaders since Trump returned to office earlier this year.",
    "link": "https://biztoc.com/x/ba12bbd27b02577a",
    "timestamp": "2025-07-03T21:49:36Z"
  },
  {
    "title": "Trump megabill gives the oil industry everything it wants and ends key support for solar and wind",
    "description": "President Donald Trump’s One Big Beautiful Bill Act ends long-standing federal support for solar and wind power, while creating a friendly environment for oil, gas and coal production",
    "link": "https://biztoc.com/x/41f85d414cbc09a1",
    "timestamp": "2025-07-03T21:49:18Z"
  },
  {
    "title": "Trump’s Defiance of TikTok Ban Prompted Immunity Promises to 10 Tech Companies",
    "description": "Newly disclosed records show Attorney General Pam Bondi gave cover to not only Apple and Google, but also several other companies that help TikTok operate in the US.",
    "link": "https://www.wired.com/story/pam-bondi-trump-tiktok-letters-google-apple-microsoft/",
    "timestamp": "2025-07-03T21:48:41Z"
  },
  {
    "title": "Laura Loomer posts about feeding 'illegals' to alligators are real",
    "description": "On June 30, 2025, right-wing influencer Laura Loomer made two X posts suggesting detainees at Florida’s new \"Alligator Alcatraz\" immigration detention center would be fed to alligators.",
    "link": "https://www.snopes.com//fact-check/laura-loomer-alligator-post/",
    "timestamp": "2025-07-03T21:48:00Z"
  },
  {
    "title": "Protest held at US Embassy’s July 4 celebrations boycotted by Opposition TDs",
    "description": "Around 50 people protested outside the US ambassador to Ireland’s Independence Day celebrations tonight, calling for guests to “walk away” due to the US role in the ongoing war on Gaza.",
    "link": "https://www.independent.ie/irish-news/protest-held-at-us-embassys-july-4-celebrations-boycotted-by-opposition-tds/a175400711.html",
    "timestamp": "2025-07-03T21:45:00Z"
  },
  {
    "title": "Does Trump really not understand his huge bill cuts Medicaid? (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nDoes Trump really not understand his huge bill cuts Medicaid?  —  Republicans are at varying levels of misleading, avoidance, or denial about this. … A strange thing happened on the way to Republicans' passage of their big Medicaid-cuttin…",
    "link": "https://www.memeorandum.com/250703/p113",
    "timestamp": "2025-07-03T21:45:00Z"
  },
  {
    "title": "Trump Says He Made No Progress On Ukraine-Russia War In Call With Putin",
    "description": "Trump, who campaigned on ending the war between Russia and Ukraine, has become less involved in dealmaking between the two countries.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/07/03/trump-says-he-made-no-progress-on-ukraine-russia-war-in-call-with-putin/",
    "timestamp": "2025-07-03T21:44:17Z"
  },
  {
    "title": "Japan seeks 8th round of tariff talks next week in U.S.",
    "description": "The Japanese government wants to send its chief tariff negotiator to the United States for an eighth round of ministerial-level talks early next week, a source close to the matter said Thursday. Tokyo is believed to have sounded out the administration of Pres…",
    "link": "https://japantoday.com/category/politics/update2-japan-seeks-tariff-talks-early-next-week-in-u.s.-amid-impasse",
    "timestamp": "2025-07-03T21:44:08Z"
  },
  {
    "title": "MAGA lawmaker pleaded with his state’s governor to protect hospitals from Trump’s budget",
    "description": "Republican Rep. Derrick Van Orden of Wisconsin wrote a letter urging his state’s Democratic governor to take steps to protect rural hospitals from the fallout of the GOP’s widely reviled megabill — which Van Orden voted for.",
    "link": "https://www.msnbc.com/top-stories/latest/van-orden-letter-evers-wisconsin-budget-medicaid-rcna216850",
    "timestamp": "2025-07-03T21:43:56Z"
  },
  {
    "title": "Key provisions in Donald Trump's 'Big Beautiful Bill'",
    "description": "US Republicans have passed a major legislative package, dubbed the \"One Big Beautiful Bill,\" giving President Donald Trump the biggest legislative victory of his second term.",
    "link": "https://www.rte.ie/news/us/2025/0703/1521768-trump-bill-explained/",
    "timestamp": "2025-07-03T21:43:41Z"
  },
  {
    "title": "Key provisions in Donald Trump's 'Big Beautiful' bill",
    "description": "US Republicans have passed a major legislative package, dubbed the \"One Big Beautiful Bill,\" giving President Donald Trump the biggest legislative victory of his second term.",
    "link": "https://www.rte.ie/news/world/2025/0703/1521768-trump-bill-explained/",
    "timestamp": "2025-07-03T21:43:41Z"
  },
  {
    "title": "South American bloc looks to Asia, Europe in face of Trump trade war",
    "description": "South America's Mercosur bloc sought Thursday to expand its markets in the face of U.S. President Donald Trump's global trade war, with Brazil calling for closer ties with dynamic Asian economies. &quot;It's time for Mercosur to look toward Asia,&quot; Presid…",
    "link": "https://japantoday.com/category/world/south-american-bloc-looks-to-asia-europe-in-face-of-trump-trade-war",
    "timestamp": "2025-07-03T21:43:36Z"
  },
  {
    "title": "Project 2025 architect helped pull megabill over the line",
    "description": "Russ Vought, one of the most conservative budget minds in Trump’s White House, helped sell skeptical House Republicans on the president’s massive economic...",
    "link": "https://www.politico.com/news/2025/07/03/project-2025-architect-helped-pull-megabill-over-the-line-00439753",
    "timestamp": "2025-07-03T21:43:30Z"
  },
  {
    "title": "Over 100 former senior officials warn against planned staff cuts at U.S. State Department",
    "description": "More than 130 retired diplomats and other former senior U.S. officials issued an open letter on Thursday criticizing a planned overhaul of the State Department that could see thousands of employees laid off. &quot;We strongly condemn Secretary of State Marco …",
    "link": "https://japantoday.com/category/world/over-100-former-senior-officials-warn-against-planned-staff-cuts-at-us-state-department1",
    "timestamp": "2025-07-03T21:43:23Z"
  },
  {
    "title": "First immigration detainees arrive at Florida center in the Everglades",
    "description": "The first group of immigrants has arrived at a new detention center deep in the Florida Everglades that officials have dubbed “Alligator Alcatraz,” a spokesperson for Republican state Attorney General James Uthmeier told The Associated Press. “People are ther…",
    "link": "https://japantoday.com/category/world/first-immigration-detainees-arrive-at-florida-center-in-the-everglades",
    "timestamp": "2025-07-03T21:43:17Z"
  },
  {
    "title": "Trump, Putin reiterate positions on Ukraine war in phone call, Kremlin aide says",
    "description": "U.S. President Donald Trump pushed for a quick halt to the Ukraine war in a Thursday phone call with Vladimir Putin, while a Kremlin aide said the Russian president reiterated that Moscow would keep pushing to solve the conflict's &quot;root causes.&quot; The…",
    "link": "https://japantoday.com/category/world/trump-putin-reiterate-positions-on-ukraine-war-in-phone-call-kremlin-aide-says3",
    "timestamp": "2025-07-03T21:43:11Z"
  },
  {
    "title": "Trump megabill gives the oil industry everything it wants and ends key support for solar and wind",
    "description": "President Donald Trump’s One Big Beautiful Bill Act ends long-standing federal support for solar and wind power, while creating a friendly environment for oil, gas and coal production",
    "link": "https://www.nbcnews.com/business/energy/trump-megabill-gives-oil-industry-everything-wants-ends-key-support-so-rcna216777",
    "timestamp": "2025-07-03T21:43:09Z"
  },
  {
    "title": "Donald Trump Reveals Details of Vladimir Putin Call",
    "description": "The call marked the sixth publicly acknowledged conversation between the two leaders since Trump returned to office earlier this year.",
    "link": "https://www.newsweek.com/donald-trump-putin-call-russia-revealed-2094508",
    "timestamp": "2025-07-03T21:43:07Z"
  },
  {
    "title": "Trump to kick off yearlong celebration of America's 250th anniversary with event in Iowa",
    "description": "President Donald Trump campaigned on a promise to deliver a “spectacular” yearlong birthday party to mark 250 years of American independence. On Thursday, he will be in the U.S. heartland to kick off the patriotic festivities — and to celebrate the final pass…",
    "link": "https://japantoday.com/category/world/trump-will-kick-off-a-yearlong-celebration-of-america%27s-250th-anniversary-with-event-in-iowa",
    "timestamp": "2025-07-03T21:43:06Z"
  },
  {
    "title": "Hamas seeks ceasefire guarantees as scores more are killed in Gaza",
    "description": "Hamas is seeking guarantees that a new U.S.-backed ceasefire proposal for Gaza would lead to the war's end, a source close to the militant group said on Thursday, as medics said Israeli strikes across the territory had killed scores more people. Israeli offic…",
    "link": "https://japantoday.com/category/world/hamas-seeks-ceasefire-guarantees-as-scores-more-are-killed-in-gaza2",
    "timestamp": "2025-07-03T21:42:54Z"
  },
  {
    "title": "Trump wins major victory as Congress passes flagship bill",
    "description": "U.S. President Donald Trump on Thursday secured a major political victory when Congress narrowly passed his signature tax and spending bill, cementing his radical second-term agenda and boosting funds for his anti-immigration drive. The bill underlined the pr…",
    "link": "https://japantoday.com/category/world/trump-wins-major-victory-as-flagship-bill-passes-congress",
    "timestamp": "2025-07-03T21:42:48Z"
  },
  {
    "title": "Mike Johnson touts 'beauty of unified government' after Trump's 'big, beautiful bill' sails through Congress",
    "description": "Celebrating the passage of the \"big, beautiful bill,\" House Speaker Mike Johnson, R-La., praised the Trump administration's close collaboration with Congress.",
    "link": "https://www.foxnews.com/politics/johnson-touts-beauty-unified-government",
    "timestamp": "2025-07-03T21:42:32Z"
  },
  {
    "title": "'Big, Beautiful Bill' passes House, bringing deep cuts to health coverage, food assistance for Texans - NewsBreak",
    "description": "An estimated 1.6 million Texans will lose healthcare coverage as a result of the bill, San Antonio U.S. Rep. Joaquin Castro said.",
    "link": "https://www.newsbreak.com/share/4088023115701-big-beautiful-bill-passes-house-bringing-deep-cuts-to-health-coverage-food-assistance-for-texans?s=a2&amp;share_destination_id=MTM1ODcyNzIyLTE3NTE1Nzg4NDUxMjU%3D&amp;pd=09C6hWpd&amp;hl=en_US&amp;send_time=1751578845&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v6%2Cns_foryou_rank_exp_25q2-v6%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_model_exp_25q2_v2-v9",
    "timestamp": "2025-07-03T21:41:09Z"
  },
  {
    "title": "Trump: I want to see the people of Gaza safe",
    "description": "Trump speaks to reporters amid speculation that a hostage release deal is close: I want to see the people of Gaza safe, they have been through hell.",
    "link": "https://www.israelnationalnews.com/news/411110",
    "timestamp": "2025-07-03T21:41:00Z"
  },
  {
    "title": "Columbia University's acting president apologizes after leaked texts over Jewish board member",
    "description": "Claire Shipman, the acting president of Columbia University, issued a private apology this week after leaked messages revealed she suggested removing a Jewish trustee over her pro-Israel advocacy, sparking a firestorm amid ongoing federal scrutiny of the univ…",
    "link": "https://freerepublic.com/focus/f-news/4326769/posts",
    "timestamp": "2025-07-03T21:39:26Z"
  },
  {
    "title": "Bear kills motorcyclist in Romanian mountains",
    "description": "A man has died after he was attacked by a bear in one of Romania's most scenic mountain regions. The victim, who had been riding a motorcycle, stopped at a popular tourist area on the Transfagarasan road on Tuesday morning, authorities said. The bear dragged …",
    "link": "https://freerepublic.com/focus/f-chat/4326768/posts",
    "timestamp": "2025-07-03T21:37:14Z"
  },
  {
    "title": "Melania Trump Visits DC Children Hospital as GOP Passes 'Big Beautiful Bill'",
    "description": "Cuts to Medicaid, which provides health care to low-income adults and children, are part of the \"big, beautiful bill.\" She had to have known, right?",
    "link": "https://www.huffpost.com/entry/melania-trump-childrens-hospital-medicaid_l_6866d2b0e4b0d0f8dccd2b10",
    "timestamp": "2025-07-03T21:36:16Z"
  },
  {
    "title": "Buttigieg goes off in profanity-laced tirade: GOP proved what it's 'all about'",
    "description": "Former Transportation Secretary Pete Buttigieg unleashed a tirade against President Donald Trump and the GOP on Thursday following the passage of their \"big, beautiful bill.\"The package extends tax cuts for the ultra-wealthy while slashing over $1 trillion fr…",
    "link": "https://www.rawstory.com/buttigieg-trump/",
    "timestamp": "2025-07-03T21:36:11Z"
  },
  {
    "title": "Trump’s Megabill and the New Art of G.O.P. Capitulation",
    "description": "Rarely have so many members of Congress voted for a measure they so actively disliked, Susan Glasser writes.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/trumps-megabill-and-the-new-art-of-gop-capitulation",
    "timestamp": "2025-07-03T21:36:01Z"
  },
  {
    "title": "Fears in Massachusetts that Trump’s bill could unravel health safety net",
    "description": "President Donald Trump's \"big, beautiful bill\" has many concerned about the impact on hundreds of thousands enrolled in the Massachusetts Health Connector.",
    "link": "https://www.nbcboston.com/news/politics/fears-in-massachusetts-that-trumps-bill-could-unravel-health-safety-net/3758969/",
    "timestamp": "2025-07-03T21:34:00Z"
  },
  {
    "title": "Watch the Rep. Raskin Interview That Inspired Trump’s Furious Post Calling Him ‘Ugly’",
    "description": "At 9.22 pm ET Wednesday evening, President Donald Trump wrote a post on his Truth Social account attacking Rep. Jamie Raskin (D-MD) as a \"third rate Democrat politician,\" \"DOPE,\" and \"TOTAL LOSER!\" who has an \"ugly face.\" Raskin \"just so happened\" to be on Al…",
    "link": "https://www.mediaite.com/media/tv/watch-the-rep-raskin-interview-that-inspired-trumps-furious-post-calling-him-ugly/",
    "timestamp": "2025-07-03T21:31:10Z"
  },
  {
    "title": "CNN Anchor Asks House Democrat: How Do You ‘Fight Back’ Against ‘The Wins Trump Can Tout?’",
    "description": "\"Gas prices down. Economic indicators are decent. Brand new jobs report shows that it's much better than expected, and border crossings are down.\"\nThe post CNN Anchor Asks House Democrat: How Do You ‘Fight Back’ Against ‘The Wins Trump Can Tout?’ first appear…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchor-asks-house-democrat-how-do-you-fight-back-against-the-wins-trump-can-tout/",
    "timestamp": "2025-07-03T21:30:10Z"
  },
  {
    "title": "The Autopen Speaks: Biden Comes Out of Retirement to Bash Trump’s Big, Beautiful Bill",
    "description": "Former President Joe Biden made a rare reentry into the spotlight Thursday to attack President Donald Trump’s landmark legislative victory, posting on X just hours after the “One Big Beautiful Bill” cleared the House. “The Republican budget bill is not only r…",
    "link": "https://freerepublic.com/focus/f-news/4326766/posts",
    "timestamp": "2025-07-03T21:28:40Z"
  },
  {
    "title": "Rural Clinic in Trump District Shuts Down as CEO Cites Medicaid Cuts",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA rural clinic located in a district President Donald Trump won by more than 50 points in the 2024 election is being forced to shut down as the CEO cites federal cuts to Medicaid as a driving factor.\nNewsweek …",
    "link": "https://biztoc.com/x/67222d9e89766312",
    "timestamp": "2025-07-03T21:27:24Z"
  },
  {
    "title": "Trump says he talked Iran and Ukraine with Putin",
    "description": "United States President Donald Trump said he spoke with Russian President Vladimir Putin about several global issues, including Iran, along with the war in Ukraine.\nTrump told reporters before leavin...",
    "link": "https://biztoc.com/x/6d1a3922c0c637c8",
    "timestamp": "2025-07-03T21:27:09Z"
  },
  {
    "title": "When will you feel the effects of Trump's megabill?",
    "description": "The cuts from the federal spending bill will affect millions of Americans, particularly vulnerable populations. But some of those impacts won't be felt for some time.",
    "link": "https://abcnews.go.com/Politics/feel-effects-trumps-megabill/story?id=123451885",
    "timestamp": "2025-07-03T21:26:44Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.07.03 WEB H264-onX",
    "description": "\"The REAL Terrorist Is YOU!\" Trump's Israel-Hamas Ceasefire Deal | Owen Jones Gets It Wrong!Donald Trump says he'll be \"very firm\" with Benjamin Netanyahu on ending the war in Gaza when the Israeli Prime Minister visits the White House on Monday. He's pressed…",
    "link": "https://post.rlsbb.cc/piers-morgan-uncensored-2025-07-03-web-h264-onx/",
    "timestamp": "2025-07-03T21:26:20Z"
  },
  {
    "title": "We Need To Talk About Why The Dollar Is Dying And How The Employment Numbers Are Being Manipulated",
    "description": "Why can’t we just be objective about the economic numbers?  When Joe Biden was in the White House, many Republicans (including Donald Trump) used the word “fake” to describe the economic numbers that the federal government was putting out.  And as I documente…",
    "link": "http://theeconomiccollapseblog.com/we-need-to-talk-about-why-the-dollar-is-dying-and-how-the-employment-numbers-are-being-manipulated/",
    "timestamp": "2025-07-03T21:25:36Z"
  },
  {
    "title": "Canada’s Finance Minister Sees Path to Avoid Baseline US Tariff",
    "description": "Canada’s finance minister said the country can negotiate a better trade deal with the Trump administration than other nations have received, pushing back on the idea that it may have to settle for a new baseline tariff on all exports to the US.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-finance-minister-sees-path-to-avoid-baseline-us-tariff",
    "timestamp": "2025-07-03T21:25:13Z"
  },
  {
    "title": "What Trump Told Me About His Complete Domination of Congress (Rachael Bade/Politico)",
    "description": "Rachael Bade / Politico:\nWhat Trump Told Me About His Complete Domination of Congress  —  Demanding a bill by Independence Day was a telling flourish for someone with zero tolerance for independence in the legislative branch.  —  When I reached President Dona…",
    "link": "https://www.memeorandum.com/250703/p108",
    "timestamp": "2025-07-03T21:25:00Z"
  },
  {
    "title": "Idea Proposed By RFK Has Some In MAHA Scratching Their Heads",
    "description": "Robert F. Kennedy Jr. surprised people when he announced June 24 that his agency would launch a campaign encouraging Americans to wear health trackers.",
    "link": "https://dailycaller.com/2025/07/03/rfks-wearable-technology-maha-palantir-calley-casey-means-trump/",
    "timestamp": "2025-07-03T21:21:58Z"
  }
]