[
  {
    "title": "Japan’s Ishiba Vows to Stay in Power After Debilitating Election Loss",
    "description": "The prime minister is prioritizing trade talks with the United States and curbing inflation.",
    "link": "http://foreignpolicy.com/2025/07/21/japan-upper-house-election-ishiba-ldp-loss-us-tariffs/",
    "timestamp": "2025-07-21T21:18:18Z"
  },
  {
    "title": "Might as well start eating gold or investing in beef futures at this point. And tariffs haven't even started to bite yet [Fail]",
    "description": "Might as well start eating gold or investing in beef futures at this point. And tariffs haven't even started to bite yet",
    "link": "https://www.fark.com/comments/13748816/Might-as-well-start-eating-gold-investing-in-beef-futures-at-this-point-And-tariffs-havent-even-started-to-bite-yet",
    "timestamp": "2025-07-21T21:18:08Z"
  },
  {
    "title": "US says it won’t rush trade deals ahead of August deadline, will engage China",
    "description": "WASHINGTON: The Trump administration is prioritising the quality of trade agreements over meeting a looming deadline, US Treasury Secretary Scott Bessent said on Monday (Jul 21), as countries scramb",
    "link": "https://www.channelnewsasia.com/world/us-says-it-wont-rush-trade-deals-ahead-august-deadline-will-engage-china-5250571",
    "timestamp": "2025-07-21T21:16:00Z"
  },
  {
    "title": "Epstein: Why MAGA won't move on",
    "description": "Trump's supporters are turning on him after he denied the existence of Epstein's client list",
    "link": "https://theweek.com/politics/epstein-maga-wont-move-on",
    "timestamp": "2025-07-21T21:15:58Z"
  },
  {
    "title": "Trump administration released FBI records on MLK Jr. despite his family’s opposition",
    "description": "Martin Luther King Jr.'s two living children are urging people to tread lightly with a newly released trove of records related to their father's assassination",
    "link": "https://www.wsoctv.com/news/politics/trump-administration/WKTDSEMHBBAZLAGNMV3BYGSUZE/",
    "timestamp": "2025-07-21T21:14:17Z"
  },
  {
    "title": "The Fed’s $2.5B renovation irking President Trump and team",
    "description": "The makeover of the Federal Reserve’s Washington D.C. headquarters, the Marriner S. Eccles Building, has become a lightning rod for Chairman Jerome Powell already under fire from President Donald Trump, U.S. Treasury Secretary Scott and others for not cutting…",
    "link": "https://biztoc.com/x/2844e2f44e15c497",
    "timestamp": "2025-07-21T21:14:02Z"
  },
  {
    "title": "Arms for Ukraine and an ultimatum for Russia",
    "description": "Donald Trump reverses course, sending weapons to Ukraine and threatening Russia with tariffs",
    "link": "https://theweek.com/politics/arms-ukraine-ultimatum-russia",
    "timestamp": "2025-07-21T21:13:57Z"
  },
  {
    "title": "Trump fiercely blamed after major company reportedly raises over 1,000 prices",
    "description": "Since President Donald Trump first announced his sweeping tariffs, Amazon has quietly raised the prices of more than 1,200 low-cost goods — including essentials — since January, according to an analysis from The Wall Street Journal.\nThe reported hike includes…",
    "link": "https://biztoc.com/x/8959708b812f19c1",
    "timestamp": "2025-07-21T21:13:38Z"
  },
  {
    "title": "US Stock Market: S&P 500, Nasdaq Composite hit fresh highs, Dow Jones drops",
    "description": "Wall Street traders are keeping close eyes as US President Donald Trump has threatened to impose a series of significant tariff hikes on August 1 if there are no deals with major trading partners.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-sp-500-nasdaq-composite-hit-fresh-highs-dow-jones-drops/articleshow/122822306.cms",
    "timestamp": "2025-07-21T21:13:13Z"
  },
  {
    "title": "Trump’s Epstein Letter Isn’t the Scandal You Think It Is",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump’s Epstein Letter Isn’t the Scandal You Think It Is appeared first…",
    "link": "https://www.dailysignal.com/2025/07/21/trumps-epstein-letter-isnt-the-scandal-you-think-it-is/",
    "timestamp": "2025-07-21T21:13:10Z"
  },
  {
    "title": "Trump's Crude Jokes On Howard Stern Show Come Back To Haunt Him",
    "description": "The president's cringy comments from long ago reemerged as his relationship to Jeffrey Epstein comes under closer scrutiny.",
    "link": "https://www.huffpost.com/entry/trumps-crude-dating-joke-on-howard-stern_n_687e7ae2e4b0502d85e5c987",
    "timestamp": "2025-07-21T21:12:24Z"
  },
  {
    "title": "‘He Had It’: Netanyahu Expresses Deep Admiration For Obama’s ‘Aura’",
    "description": "Former President Barack Obama has \"aura,\" Israeli Prime Minister Benjamin Netanyahu agreed in a Monday interview on the Full Send Podcast.",
    "link": "https://dailycaller.com/2025/07/21/he-had-it-netanyahu-expresses-deep-admiration-for-obamas-aura/",
    "timestamp": "2025-07-21T21:11:54Z"
  },
  {
    "title": "Trump administration releases files on Martin Luther King Jr",
    "description": "About 230,000 pages records are unsealed - including FBI surveillance files - despite opposition from some of the King family.",
    "link": "https://www.bbc.com/news/articles/cy0wr5j5k8lo",
    "timestamp": "2025-07-21T21:10:29Z"
  },
  {
    "title": "White House Introduces Rule Canceling Biden’s Paper Straw Mandate",
    "description": "'We're getting back to basics. Straws that work, an economy that works, a country that works,' Rhodes told the Federalist.",
    "link": "https://thefederalist.com/2025/07/21/white-house-introduces-rule-canceling-bidens-paper-straw-mandate/",
    "timestamp": "2025-07-21T21:10:20Z"
  },
  {
    "title": "Domestic violence and sexual assault organizations sue Trump admin over funding restrictions",
    "description": "More than 20 nonprofits that receive federal grants to serve victims of domestic violence and sexual assault, and those experiencing homelessness, filed a lawsuit Monday against the Trump administration over new funding requirements.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/domestic-violence-sexual-assault-organizations-sue-trump-administratio-rcna220074",
    "timestamp": "2025-07-21T21:09:26Z"
  },
  {
    "title": "Trump demands an end to ‘complete disaster’ cashless bail: ‘The worst criminals are flooding our streets’",
    "description": "President Donald Trump demanded cashless bail end immediately on Monday, citing crime in U.S. cities, as well as increased attacks on law enforcement.",
    "link": "https://nypost.com/2025/07/21/us-news/trump-calls-for-an-end-to-cashless-bail/",
    "timestamp": "2025-07-21T21:08:25Z"
  },
  {
    "title": "What's Real and What's Fake—Global Action Is Needed To Protect Us All",
    "description": "Most people only wake up when their bank accounts have been raided and the \"prince\" has long faded into safety.",
    "link": "https://www.newsweek.com/whats-real-whats-fakeglobal-action-needed-protect-us-all-2101981",
    "timestamp": "2025-07-21T21:07:39Z"
  },
  {
    "title": "Taxpayer-Funded Group Teaches Marxist, ‘Queer’ Resistance At Anti-Trump Summer Camp",
    "description": "A taxpayer-funded nonprofit in Chicago is hosting a ten-day summer camp focused on resisting \"fascist culture\" and engaging in activities such as \"queer magic.\"",
    "link": "https://dailycaller.com/2025/07/21/taxpayer-funded-nonprofit-marxist-queer-resistance-anti-trump-summer-camp/",
    "timestamp": "2025-07-21T21:07:35Z"
  },
  {
    "title": "Trump invokes Russia collusion hoax while calling for longtime foe Schiff to face jail time",
    "description": "President Trump floats Sen. Schiff face jail time over alleged mortgage fraud while citing declassified documents about the Russia collusion narrative.",
    "link": "https://www.foxnews.com/politics/trump-invokes-obama-era-russia-hoax-while-floating-longtime-foe-schiff-face-jail-time",
    "timestamp": "2025-07-21T21:07:14Z"
  },
  {
    "title": "Trump Hits Record Low Approval Rating on Immigration for Second Term: Poll",
    "description": "Immigration remains a cornerstone of Trump's second term in the White House and a defining issue of his administration.",
    "link": "https://www.newsweek.com/trump-record-low-approval-rating-second-term-poll-2102005",
    "timestamp": "2025-07-21T21:06:40Z"
  },
  {
    "title": "NASA loses another senior official as tension grows about the agency's future",
    "description": "The director of NASA’s Goddard Space Flight Center announced her resignation Monday, marking yet another high-profile departure as questions loom about the agency’s budget and future",
    "link": "https://www.nbcnews.com/science/space/nasa-loses-another-senior-official-tension-grows-agencys-future-rcna220064",
    "timestamp": "2025-07-21T21:06:34Z"
  },
  {
    "title": "Hunter Biden Rejects American Citizens, Praises Illegal Migrants",
    "description": "President Joe Biden's drug-addled son turned his back on ordinary Americans as he praised low-wage migrants for cleaning his hotel rooms, washing his clothes, and cooking his food.\nThe post Hunter Biden Rejects American Citizens, Praises Illegal Migrants appe…",
    "link": "https://www.breitbart.com/economy/2025/07/21/hunter-biden-rejects-citizens-praises-illegal-migrants/",
    "timestamp": "2025-07-21T21:05:18Z"
  },
  {
    "title": "'All the options': GOP eyes cutting August recess to move dozens of Trump nominees stalled by Dems",
    "description": "Senate Republicans consider shortening August recess following Trump's request to confirm more nominees, with Senate Majority Leader John Thune accusing Dems of obstructing the confirmation process.",
    "link": "https://www.foxnews.com/politics/all-options-gop-eyes-cutting-august-recess-move-dozens-trump-nominees-stalled-dems",
    "timestamp": "2025-07-21T21:05:03Z"
  },
  {
    "title": "Japanese PM Ishiba Refuses to Resign After Election Disaster",
    "description": "Japanese Prime Minister Ishiba Shigeru said on Sunday evening that he intends to remain in office as prime minister, even though his Liberal Democratic Party (LDP) suffered an anticipated defeat in Sunday’s elections and lost control of the upper house of the…",
    "link": "https://www.breitbart.com/asia/2025/07/21/japanese-pm-ishiba-refuses-to-resign-after-election-disaster/",
    "timestamp": "2025-07-21T21:04:49Z"
  },
  {
    "title": "MPs return to Canberra as Albo promises ‘year of delivery’",
    "description": "MPs swarmed back into Canberra yesterday, with Anthony Albanese promising a 'year of delivery'. And Australia has joined 24 other nations in signing a joint statement declaring Israel’s war in Gaza 'must end now'.\nThe post MPs return to Canberra as Albo promi…",
    "link": "http://www.crikey.com.au/2025/07/22/crikey-worm-parliament-returns-israel-gaza-criticism/",
    "timestamp": "2025-07-21T21:04:23Z"
  },
  {
    "title": "Amid Epstein fallout, the Trump administration turns to MAGA's other greatest hits",
    "description": "Facing backlash from MAGA supporters about Jeffrey Epstein, the Trump administration has released a flood of information on old grievances and issues popular with the base.",
    "link": "https://www.nbcnews.com/politics/trump-administration/jeffrey-epstein-fallout-trump-administration-maga-greatest-hits-rcna220038",
    "timestamp": "2025-07-21T21:03:52Z"
  },
  {
    "title": "Trading Day: Equity optimism hard to quell",
    "description": "U.S. and world stocks posted solid gains on Monday as the dollar and bond yields fell, while encouraging corporate earnings and investor optimism that the...",
    "link": "https://finance.yahoo.com/news/trading-day-equity-optimism-hard-210347024.html",
    "timestamp": "2025-07-21T21:03:47Z"
  },
  {
    "title": "The Giant Elon Musk ‘Make America Wait Again’ Head Made It to Yosemite This Weekend",
    "description": "With the tagline ‘Make America Wait Again: Now With Longer Lines Thanks to DOGE Cuts!’ a truck towing a giant bust of Elon Musk's head appeared in Yosemite National Park this week after first touring Arches in Utah earlier this month.",
    "link": "https://www.kqed.org/news/12049014/giant-elon-musk-head-yosemite-national-park-make-america-wait-again-doge",
    "timestamp": "2025-07-21T21:03:20Z"
  },
  {
    "title": "Will Zohran Mamdani help or hurt New York’s economy?",
    "description": "Free buses, rent freezes and city-run grocery stores won over Democratic voters as investor class pushes back.",
    "link": "https://www.aljazeera.com/economy/2025/7/21/will-zohran-mamdani-help-or-hurt-new-yorks-economy",
    "timestamp": "2025-07-21T21:01:05Z"
  },
  {
    "title": "Tulsi Gabbard Declassifies Files On Martin Luther King Jr. Assassination",
    "description": "Director of National Intelligence Tulsi Gabbard has announced the release of long-classified files related to the assassination of Dr. Martin Luther King Jr.",
    "link": "https://dailycaller.com/2025/07/21/martin-luther-king-jr-assassination-files-gabbard-trump/",
    "timestamp": "2025-07-21T21:01:05Z"
  },
  {
    "title": "Frustration and fear ripple through NPR and PBS affiliates after Congress approves clawbacks",
    "description": "Small, rural public media stations are disappointed that Congress ignored their campaign to preserve federal funding.",
    "link": "https://www.politico.com/news/2025/07/21/npr-pbs-affiliates-worry-congress-clawbacks-00465850",
    "timestamp": "2025-07-21T21:01:00Z"
  },
  {
    "title": "Scott Bessent: We Need to ‘Examine the Entire Federal Reserve’",
    "description": "\"So, you know, I think this idea of them not being able to break out of a certain mindset, you know, all these PhDs over there, I don't know what they do. I don't know what they do. This is like universal basic income for academic economists.\"\nThe post Scott …",
    "link": "https://legalinsurrection.com/2025/07/scott-bessent-we-need-to-examine-the-entire-federal-reserve/",
    "timestamp": "2025-07-21T21:00:55Z"
  },
  {
    "title": "Trump ‘caught off guard’ by Israel’s actions in Gaza and Syria last week as skepticism of Netanyahu grows inside White House",
    "description": "President Donald Trump was caught by surprise last week by Israeli actions in Gaza and Syria, and in both instances phoned Prime Minister Benjamin Netanyahu to “rectify” the matter, according to the White House.",
    "link": "https://www.cnn.com/2025/07/21/politics/trump-netanyahu-israel-gaza-syria",
    "timestamp": "2025-07-21T21:00:06Z"
  },
  {
    "title": "Terry McLaurin Considering Holdout or Trade Request From Washington Commanders",
    "description": "Terry McLaurin's frustration with the Washington Commanders is mounting and now he's apparently ready to demand a trade.",
    "link": "https://sportsnaut.com/nfl/terry-mclaurin-trade-request-holdout-washington-commanders/",
    "timestamp": "2025-07-21T21:00:00Z"
  },
  {
    "title": "Melania Trump Denies Epstein Rumor Via Subtweet",
    "description": "Did Jeffrey Epstein introduce Melania and Donald Trump? According to a cryptic, largely unnoticed social-media post from the First Lady, the answer is ‘no.’",
    "link": "http://nymag.com/intelligencer/article/melania-trump-epstein-introduced-rumor-subtweet.html",
    "timestamp": "2025-07-21T20:59:48Z"
  },
  {
    "title": "What Should Libertarians Make of the Epstein Files?",
    "description": "This week, we examine what, if anything, the Jeffrey Epstein saga reveals about the MAGA movement and its ties to conspiracy culture.",
    "link": "https://reason.com/podcast/2025/07/21/what-should-libertarians-make-of-the-epstein-files/",
    "timestamp": "2025-07-21T20:57:04Z"
  },
  {
    "title": "Stephen A. Smith Hits ‘Petty’ Trump for Pushing Washington Redskins Name Change: He’s Trying to ‘Distract’ from Epstein",
    "description": "Stephen A. Smith on Monday accused Trump of drumming up controversy on the Washington Commanders' name to turn the public's attention away from Jeffrey Epstein.\nThe post Stephen A. Smith Hits ‘Petty’ Trump for Pushing Washington Redskins Name Change: He’s Try…",
    "link": "https://www.mediaite.com/media/sports/stephen-a-smith-hits-petty-trump-for-pushing-washington-redskins-name-change-hes-trying-to-distract-from-epstein/",
    "timestamp": "2025-07-21T20:56:55Z"
  },
  {
    "title": "Low Cut Connie's Adam Weiner says band's show cut for 'political reasons'",
    "description": "Low Cut Connie's Adam Weiner says band's show cut for 'political reasons'pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2025/07/popular-rock-frontman-from-pa-who-ripped-trump-says-upcoming-show-cancelled-for-political-reasons.html",
    "timestamp": "2025-07-21T20:56:32Z"
  },
  {
    "title": "Speaker Mike Johnson Won't Allow House Vote On Jeffrey Epstein Files",
    "description": "House Republicans won't vote on a nonbinding resolution calling for the release of more information about the convicted sex offender who died in prison in 2019.",
    "link": "https://www.huffpost.com/entry/jeffrey-epstein-files-house-vote_n_687e951be4b0502d85e5e96d",
    "timestamp": "2025-07-21T20:55:00Z"
  },
  {
    "title": "Trump’s $10 Billion WSJ Lawsuit Over Epstein Article Reveals His Lawyers Can’t Read Good",
    "description": "We’ve seen some pretty ridiculous lawsuits here at Techdirt, but the one that Donald Trump filed on Friday against Rupert Murdoch and the Wall Street Journal over the article about the birthday card he was alleged to have given Epstein is so legally incompete…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178433414",
    "timestamp": "2025-07-21T20:54:23Z"
  },
  {
    "title": "Trump Finds Another Way to Take Revenge on Murdoch for Epstein Letter",
    "description": "In retaliation for reporting on Donald Trump’s relationship to Jeffrey Epstein, the White House is ousting The Wall Street Journal from the press pool for the president’s upcoming trip to Scotland.Trump’s press secretary, Karoline Leavitt, said in a statement…",
    "link": "https://newrepublic.com/post/198179/trump-revenge-wall-street-journal-epstein-birthday-letter-press-pool",
    "timestamp": "2025-07-21T20:52:22Z"
  },
  {
    "title": "Trump ‘Caught off Guard’ by Israel’s Syria Strike: White House",
    "description": "President Donald Trump was “caught off guard” by Israel’s bombing of Syria, the White House said Monday, amid reports that the US president was increasingly concerned by Israeli Prime Minister Benjamin Netanyahu’s aggressive military efforts.\nTrump “enjoys a …",
    "link": "https://biztoc.com/x/7a89c3ba9f9d5c04",
    "timestamp": "2025-07-21T20:51:24Z"
  },
  {
    "title": "‘Other People’s Money’: How New OPM Chief Is Maximizing Efficiency at Executive HR Agency",
    "description": "The new director of the executive branch’s human resources department is aiming to make the agency the most efficient in the government, he told reporters... Read More\nThe post ‘Other People’s Money’: How New OPM Chief Is Maximizing Efficiency at Executive HR…",
    "link": "https://www.dailysignal.com/2025/07/21/other-peoples-money-opms-new-director-maximizing-efficiency-executive-hr-agency/",
    "timestamp": "2025-07-21T20:50:00Z"
  },
  {
    "title": "Hunter Biden Rips George Clooney For Criticizing Joe, Unloads on Democrats",
    "description": "Hunter Biden is going scorched Earth on George Clooney and a bunch of other Democrats he blames for turning on his father and torpedoing his reelection bid. Joe Biden's son unloads on Clooney in a new interview with YouTube personality Andrew…\n Permalink",
    "link": "https://www.tmz.com/2025/07/21/hunter-biden-blasts-george-clooney-democrats-election/",
    "timestamp": "2025-07-21T20:49:52Z"
  },
  {
    "title": "'What are they hiding?' 'Desperate' Tulsi Gabbard slammed over MLK stunt",
    "description": "Director of National Intelligence Tulsi Gabbard faced sharp criticism on Monday after her office released a trove of 230,000 files related to Martin Luther King Jr.'s assassination instead of releasing more of the Jeffrey Epstein files. The move to release th…",
    "link": "https://www.rawstory.com/tulsi-gabbard-2673540008/",
    "timestamp": "2025-07-21T20:49:04Z"
  },
  {
    "title": "Kilmar Abrego Garcia’s lawyers ask judge to delay release from jail over deportation fears",
    "description": "Lawyers for Kilmar Abrego Garcia have asked a federal judge in Tennessee to delay releasing him from jail in order to prevent the Trump administration from trying to swiftly deport the Maryland construction worker.",
    "link": "https://www.pbs.org/newshour/nation/kilmar-abrego-garcias-lawyers-ask-judge-to-delay-release-from-jail-over-deportation-fears",
    "timestamp": "2025-07-21T20:48:27Z"
  },
  {
    "title": "Trump Forces Employers To Stop Turning Blind Eye To Illegal Workers",
    "description": "The Trump administration’s expanded immigration enforcement is forcing U.S. employers to stop turning a blind eye to the employment of illegal immigrants.",
    "link": "https://dailycaller.com/2025/07/21/trump-forces-employers-stop-blind-eye-illegal-workers/",
    "timestamp": "2025-07-21T20:48:08Z"
  },
  {
    "title": "White House Ousts Wall Street Journal From Scotland Press Pool Over Epstein Report",
    "description": "U.S. President Donald Trump's White House on Monday once again retaliated againstThe Wall Street Journal days after it published a story about a sexually explicit birthday card that Trump reportedly gave to late billionaire sex offender Jeffrey Epstein to cel…",
    "link": "https://www.commondreams.org/news/trump-wall-street-journal",
    "timestamp": "2025-07-21T20:47:52Z"
  },
  {
    "title": "ROOKE: Democrats Seem To Be Setting Themselves Up For More Chaos And Division",
    "description": "In just ten weeks, Republicans will face another funding battle, but fortunately for them, Democrats are still undecided on how to respond.",
    "link": "https://dailycaller.com/2025/07/21/republicans-democrats-budget-division-government-shutdown-brian-schatz-chip-roy/",
    "timestamp": "2025-07-21T20:47:32Z"
  },
  {
    "title": "Mike Davis Says Obama Has NO Immunity in Russia Hoax Cover-Up — Warns Co-Conspirators “Justice Is Coming” and “They Should Be Very Scared”",
    "description": "In a new interview with Benny Johnson, legal expert and Article III Project founder Mike Davis obliterated the left’s last line of defense in the Russia collusion hoax — Barack Obama’s supposed immunity.\nThe post Mike Davis Says Obama Has NO Immunity in Russi…",
    "link": "https://www.thegatewaypundit.com/2025/07/mike-davis-says-obama-has-no-immunity-russia/",
    "timestamp": "2025-07-21T20:45:07Z"
  },
  {
    "title": "Marjorie Taylor Greene Knows What MAGA Wants: War on Trump’s Enemies",
    "description": "Marjorie Taylor Greene has warned Trump that MAGA wants war on ‘enemies of the people,’ not just the Epstein files. Ed Kilgore writes it could mean arresting Obama may not be limited to a fantasy.",
    "link": "http://nymag.com/intelligencer/article/mtg-knows-what-maga-wants-war-on-trumps-enemies.html",
    "timestamp": "2025-07-21T20:44:59Z"
  },
  {
    "title": "Biden’s autopen granted 'sadistic criminal underclass' entry to US, Stephen Miller says",
    "description": "Former President Joe Biden’s use of the autopen allowed “the sadistic criminal underclass\" to enter the U.S. under his administration’s border policies.",
    "link": "https://www.foxnews.com/politics/bidens-autopen-granted-sadistic-criminal-underclass-entry-us-stephen-miller-says",
    "timestamp": "2025-07-21T20:43:18Z"
  },
  {
    "title": "Trump administration releases thousands of previously classified MLK assassination documents",
    "description": "Over 230,000 MLK assassination files made public by DNI Gabbard under Trump's initiative, containing FBI memos despite concerns from King's children.",
    "link": "https://www.foxnews.com/politics/trump-administration-releases-thousands-previously-classified-mlk-assassination-documents",
    "timestamp": "2025-07-21T20:43:05Z"
  },
  {
    "title": "David Letterman: “You Can’t Spell CBS Without BS”",
    "description": "Letterman's YouTube channel uploaded two not so subtle videos in the wake of Stephen Colbert's firing as host of Late Show.\nDavid Letterman: “You Can’t Spell CBS Without BS”\nScoop Harrison",
    "link": "https://consequence.net/2025/07/david-letterman-you-cant-spell-cbs-without-bs/",
    "timestamp": "2025-07-21T20:42:30Z"
  },
  {
    "title": "CNN Reporter Lists Off ALL the Topics Trump Has Been Posting About to Distract From Epstein",
    "description": "\"We know that President Trump wants to talk about literally anything else other than Jeffrey Epstein.\"\nThe post CNN Reporter Lists Off ALL the Topics Trump Has Been Posting About to Distract From Epstein first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-reporter-lists-off-all-the-topics-trump-has-been-posting-about-to-distract-from-epstein/",
    "timestamp": "2025-07-21T20:42:04Z"
  },
  {
    "title": "DUKE: Hunter ‘Failson’ Biden Outs Joe’s Secret Ambien Habit",
    "description": "The noted painter revealed that his father, Joe Biden, was taking Ambien prior to his “absolutely horrible debate” against President Donald Trump.",
    "link": "https://dailycaller.com/2025/07/21/duke-hunter-failson-biden-outs-joes-secret-ambien-habit/",
    "timestamp": "2025-07-21T20:42:00Z"
  },
  {
    "title": "White House says Donald Trump is serious about wanting the Commanders to revert to Redskins",
    "description": "A day after Donald Trump threatened to hold up a deal for a new football stadium in the nation's capital if the Washington Commanders did not go back to the name Redskins, White House press secretary Karoline Leavitt said the president's comments were not a j…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_64503f51-407a-4eda-892d-27bfb2185640",
    "timestamp": "2025-07-21T20:40:27Z"
  },
  {
    "title": "Trump releases 230,000 MLK Jr. assassination files as Americans demand more on Epstein",
    "description": "The Trump administration released a huge batch of previously classified documents on Dr. Martin Luther King Jr.'s assassination on Monday as Americans clamor for information about Jeffrey Epstein. Director of National Intelligence Tulsi Gabbard announced that…",
    "link": "https://freerepublic.com/focus/f-news/4329963/posts",
    "timestamp": "2025-07-21T20:38:51Z"
  },
  {
    "title": "Hunter Biden unloads on actor George Clooney, claims he sabotaged father with 'blessing' of Obama people",
    "description": "Hunter Biden went on a profane tirade against George Clooney over the actor's essay calling for President Biden to be replaced as Democratic nominee.",
    "link": "https://www.foxnews.com/media/hunter-biden-unloads-actor-george-clooney-claims-he-sabotaged-father-blessing-obama-people",
    "timestamp": "2025-07-21T20:38:31Z"
  },
  {
    "title": "Herzog to US Jewish delegation: We must scream for a deal",
    "description": "President Herzog hosts a US Jewish delegation alongside hostage Alon Ohel’s family, urging intensified global efforts to secure the release of 50 Israelis held by Hamas. Alon’s mother: “All of Israel feels like we’ve been taken hostage.”",
    "link": "https://www.israelnationalnews.com/news/412036",
    "timestamp": "2025-07-21T20:37:15Z"
  },
  {
    "title": "‘A Mount Rushmore kind of president’: Mike Johnson marks anniversary of Biden dropping out with montage of Dems insisting he was at ‘top of his game’",
    "description": "'The American people should never forget how far Democrats and the media went to hide the truth about the mental decline of the man holding the most powerful position on earth'",
    "link": "https://www.wnd.com/2025/07/mount-rushmore-kind-president-mike-johnson-marks-anniversary/",
    "timestamp": "2025-07-21T20:36:31Z"
  },
  {
    "title": "Why the Supreme Court could take up Ghislaine Maxwell’s appeal over Epstein agreement",
    "description": "If the justices step in, it wouldn’t necessarily have anything to do with the validity of the trafficking charges themselves against the Epstein associate.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-ghislaine-maxwell-appeal-epstein-trump-rcna220042",
    "timestamp": "2025-07-21T20:36:14Z"
  },
  {
    "title": "White House flips script on Hunter Biden's profanity-laced rant against Trump's immigration policies",
    "description": "Former president's son Hunter Biden faces White House backlash after controversial comments on immigration, seemingly comparing Trump's policies to Nazi Germany.",
    "link": "https://www.foxnews.com/politics/white-house-flips-script-hunter-bidens-profanity-laced-rant-trumps-immigration-policies",
    "timestamp": "2025-07-21T20:35:32Z"
  },
  {
    "title": "Japan’s ruling coalition loses majority for first time in 31 years",
    "description": "Prime Minister Shigeru Ishiba’s camp has lost control of both chambers of the country’s parliament Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621785-japan-ruling-coalition-loses-majority/",
    "timestamp": "2025-07-21T20:33:43Z"
  },
  {
    "title": "Hakeem Jeffries says quiet part out loud about Epstein",
    "description": "Hakeem Jeffries made a surprising admission Monday about how Democrats view their new effort to secure additional documents related to the late convicted sex predator Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/07/21/hakeem-jeffries-democrats-jeffrey-epstein/",
    "timestamp": "2025-07-21T20:33:19Z"
  },
  {
    "title": "Trump White House Boots Wall Street Journal From Press Pool Amid $10 Billion Lawsuit",
    "description": "Karoline Leavitt says the WSJ's \"fake and defamatory\" report on Trump's birthday note to Jeffrey Epstein led to its banishment from the president's upcoming Scotland trip\nThe post Trump White House Boots Wall Street Journal From Press Pool Amid $10 Billion La…",
    "link": "https://www.thewrap.com/trump-boots-wall-street-journal-press-pool-scotland-trip/",
    "timestamp": "2025-07-21T20:33:13Z"
  },
  {
    "title": "Is This Ohio DCCC Frontline Member’s Reelection at Risk?",
    "description": "Ohio could help determine which party controls the House of Representatives following the 2026 midterms. Two Democrats, Reps. Marcy Kaptur of Ohio’s 9th Congressional District... Read More\nThe post Is This Ohio DCCC Frontline Member’s Reelection at Risk? appe…",
    "link": "https://www.dailysignal.com/2025/07/21/is-this-ohio-dccc-frontline-members-reelection-at-risk/",
    "timestamp": "2025-07-21T20:30:55Z"
  },
  {
    "title": "Hunter Biden blames Ambien for President Biden's terrible Trump debate",
    "description": "President Joe Biden's disastrous debate performance set events in motion that concluded with his dropping out of the 2024 presidential election.",
    "link": "https://www.cnbc.com/2025/07/21/biden-trump-debate-ambien-hunter.html",
    "timestamp": "2025-07-21T20:30:43Z"
  },
  {
    "title": "Trump Media discloses $2B Bitcoin holdings as Congress approves key crypto legislation",
    "description": "Trump Media and Technology Group, the parent company of Truth Social, revealed it has amassed roughly $2 billion worth of Bitcoin (BTC) and related digital assets, expanding on an investment strategy disclosed earlier this year. The company’s July 21 filing c…",
    "link": "https://cryptoslate.com/trump-media-discloses-2b-bitcoin-holdings-as-congress-approves-key-crypto-legislation/",
    "timestamp": "2025-07-21T20:30:34Z"
  },
  {
    "title": "Trump ‘caught off guard’ by recent Israeli strikes, White House says",
    "description": "Her comments were a rare suggestion of daylight between Trump and the Israeli prime minister.",
    "link": "https://www.denverpost.com/2025/07/21/trump-israel-caught-off-guard/",
    "timestamp": "2025-07-21T20:30:08Z"
  },
  {
    "title": "Trump ‘caught off guard’ by recent Israeli strikes, White House says",
    "description": "Her comments were a rare suggestion of daylight between Trump and the Israeli prime minister.",
    "link": "https://www.bostonherald.com/2025/07/21/trump-israel-caught-off-guard/",
    "timestamp": "2025-07-21T20:30:08Z"
  },
  {
    "title": "White House Removes WSJ From Scotland Press Pool Over Epstein Article",
    "description": "The Wall Street Journal engaged in \"fake and defamatory conduct,\" White House press secretary Karoline Leavitt alleged.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-scotland-press-pool_n_687e97a9e4b0d91bafde2101",
    "timestamp": "2025-07-21T20:29:14Z"
  },
  {
    "title": "YouTube wipes out thousands of propaganda channels linked to China, Russia, others",
    "description": "Google removed YouTube channels and other accounts linked to RT, the Russian state-controlled media outlet accused of paying prominent conservative influencers.",
    "link": "https://www.cnbc.com/2025/07/21/youtube-channels-propaganda-china-russia.html",
    "timestamp": "2025-07-21T20:28:40Z"
  },
  {
    "title": "Trump's spy chief claims the Obama administration 'manufactured' intel on Russia",
    "description": "Director of National Intelligence Tulsi Gabbard has published the latest in a series of reports that scrutinize years-old intel community conclusions about Russian interference in the 2016 election.",
    "link": "https://www.npr.org/2025/07/21/nx-s1-5475171/trump-gabbard-russia-2016-election",
    "timestamp": "2025-07-21T20:28:01Z"
  },
  {
    "title": "NFL Washington Commanders will be with stadium? Donald Trump goes all out against former Washington Redskins",
    "description": "Washington's City Council is studying plans before voting on final approval for a deal struck by the club and Mayor Muriel Bowser to build a new 65,000-seat domed venue on the site of RFK Stadium",
    "link": "https://economictimes.indiatimes.com/news/international/us/nfl-washington-commanders-will-be-with-stadium-donald-trump-goes-all-out-against-former-washington-redskins/articleshow/122822219.cms",
    "timestamp": "2025-07-21T20:27:39Z"
  },
  {
    "title": "Mike Waltz Gears up for a New Role at the U.N.",
    "description": "Diplomats in New York are debating the meaning of the former national security advisor’s pledge to “make the U.N. great again.”",
    "link": "http://foreignpolicy.com/2025/07/21/mike-waltz-un-ambassador-confirmation-hearing-trump/",
    "timestamp": "2025-07-21T20:27:36Z"
  },
  {
    "title": "Trump Just Threw Pam Bondi and Kash Patel to the Wolves on Epstein",
    "description": "Donald Trump is letting his underlings take the fall for the administration’s seismic Epstein scandal.Facing enormous pressure from his base last week, Trump ordered the Justice Department to release additional documents pertaining to its investigation into E…",
    "link": "https://newrepublic.com/post/198181/donald-trump-pam-bondi-kash-patel-epstein",
    "timestamp": "2025-07-21T20:27:12Z"
  },
  {
    "title": "It's Hot Boo Summer For JD Vance",
    "description": "Guy's got a fetish for vacationing in the places he complains about the most!",
    "link": "https://www.wonkette.com/p/its-hot-boo-summer-for-jd-vance",
    "timestamp": "2025-07-21T20:24:28Z"
  },
  {
    "title": "San Diego Afghan advocacy group 'surprised' by President Trump's offer",
    "description": "AfghanEvac called President Donald Trump's offer to help Afghan detained in the United Arab Emirates on Truth Social, a \"welcome surprise.\"",
    "link": "https://www.kpbs.org/news/local/2025/07/21/san-diego-afghan-advocacy-group-surprised-by-trumps-offer",
    "timestamp": "2025-07-21T20:21:49Z"
  },
  {
    "title": "Texas GOP eyes redistricting, Dems poised to hit back. What to know.",
    "description": "At Trump's urging, Texas Gov. Greg Abbott has requested lawmakers potentially redraw the state's electoral map. Opponents warn it could backfire.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/21/trump-texas-special-session-redistricting-democrat-response/85311422007/",
    "timestamp": "2025-07-21T20:21:07Z"
  },
  {
    "title": "Obama-era officials mum on allegations of 'manufactured' intelligence launching Trump-Russia probe",
    "description": "Former Obama administration officials named in new revelations surrounding the origins of the Trump-Russia investigation have been silent amid allegations they \"manufactured\" intelligence that led to the opening of the yearslong probe.",
    "link": "https://www.foxnews.com/politics/obama-era-officials-mum-allegations-manufactured-intelligence-launching-trump-russia-probe",
    "timestamp": "2025-07-21T20:19:09Z"
  },
  {
    "title": "Jimmy Fallon and other top comedians set to hit ‘The Late Show’ to rally around cancelled Stephen Colbert",
    "description": "“Tonight Show” host Jimmy Fallon will cross the street from his NBC headquarters to offer support for CBS rival Stephen Colbert on Monday, The Post has learned. Fallon and a handful of other top comedians are expected to make a cameo at the Ed Sullivan Theate…",
    "link": "https://nypost.com/2025/07/21/media/jimmy-fallon-and-other-top-comedians-set-to-hit-the-late-show-to-rally-around-cancelled-stephen-colbert/",
    "timestamp": "2025-07-21T20:18:55Z"
  },
  {
    "title": "Report Details 400+ Attacks on Science in First 6 Months of Trump 2.0",
    "description": "A report published Monday by the Union of Concerned Scientists details how U.S. President Donald Trump \"has led a systemic and coordinated attack on science\" during the first six months of his second administration as \"part of a larger strategy to strip publi…",
    "link": "https://www.commondreams.org/news/trump-attack-on-science",
    "timestamp": "2025-07-21T20:17:49Z"
  },
  {
    "title": "False hope of accountability from the Epstein battle (Letters)",
    "description": "We should not delude ourselves, however, about whether these detractors will fall right back in line when it counts. They will, like they always do. They just approved his omnibus budget weeks ago. -- Nate Craig, Boulder",
    "link": "https://www.denverpost.com/2025/07/21/epstein-trump-musk-battle-accountability/",
    "timestamp": "2025-07-21T20:16:28Z"
  },
  {
    "title": "Sen. Nicole Mitchell announces resignation following burglary conviction. ( Minnesota )",
    "description": "\"She doesn't get to give the Senate two weeks' notice,\" Senate Minority Leader Mark Johnson said of Mitchell's plan to resign by Aug. 4 .... Senator Nicole Mitchell, DFL-Woodbury, has announced she will resign from the Minnesota Senate next month. Her announc…",
    "link": "https://freerepublic.com/focus/f-news/4329959/posts",
    "timestamp": "2025-07-21T20:16:26Z"
  },
  {
    "title": "Soros Network Behind Lawsuit Claiming Trump Is Violating Rights of Illegal Aliens Detained at 'Alligator Alcatraz'",
    "description": "Left-wing organizations linked financially to George and Alexander Soros's Open Society Foundations are suing Donald Trump's administration for allegedly violating the rights of illegal aliens at Florida's \"Alligator Alcatraz.\"\nThe post Soros Network Behind L…",
    "link": "https://www.breitbart.com/politics/2025/07/21/soros-network-behind-lawsuit-claiming-trump-is-violating-rights-illegal-aliens-detained-alligator-alcatraz/",
    "timestamp": "2025-07-21T20:16:06Z"
  },
  {
    "title": "Chicago’s $1 Billion Quantum Computer to Start Operating in 2028",
    "description": "The startup behind Chicago’s more than $1 billion quantum computing deal said operations are expected to start in three years, a win for Illinois Governor JB Pritzker, who backed the investment and is widely seen as a potential presidential candidate.",
    "link": "https://financialpost.com/pmn/business-pmn/chicagos-1-billion-quantum-computer-to-start-operating-in-2028",
    "timestamp": "2025-07-21T20:16:05Z"
  },
  {
    "title": "The Central Myth That the Supreme Court Wants You to Believe",
    "description": "The answer to the one question I get asked most about the court.",
    "link": "https://slate.com/news-and-politics/2025/07/myth-supreme-court-john-roberts-trump-oz.html",
    "timestamp": "2025-07-21T20:13:35Z"
  },
  {
    "title": "Beef prices soar to record highs in the U.S.",
    "description": "Anyone firing up the grill this summer already knows hamburger patties and steaks are expensive, but the latest numbers show prices have climbed to record highs.\n\n\n\nAnd experts say consumers shouldn’t expect much relief soon either.\n\n\n\nThe average price of a …",
    "link": "https://www.fastcompany.com/91371803/beef-prices-record-highs-us",
    "timestamp": "2025-07-21T20:13:25Z"
  },
  {
    "title": "U.S. senators meet with Carney, push to ‘reinvigorate’ CUSMA ahead of Trump deadline",
    "description": "Trump has threatened to impose a blanket tariff of 35% starting next month on Canadian goods, barring him and Carney reaching a new economic and security agreement before",
    "link": "https://nationalpost.com/news/us-senators-mark-carney-cusma-trump-tariffs",
    "timestamp": "2025-07-21T20:12:39Z"
  },
  {
    "title": "Iran to hold nuclear talks with European nations in Turkey, the first since ceasefire with Israel",
    "description": "The discussions, set for Friday in Istanbul, will involve officials from Britain, France, Germany, and the EU's foreign policy chief.",
    "link": "https://www.pbs.org/newshour/world/iran-to-hold-nuclear-talks-with-european-nations-in-turkey-the-first-since-ceasefire-with-israel",
    "timestamp": "2025-07-21T20:12:19Z"
  },
  {
    "title": "Washington Commanders shouldn't let Trump bully them in nickname battle | Opinion",
    "description": "It's time for the ownership of the Commanders, and the commissioner of the NFL, to stand up to Donald Trump in the team nickname controversy.",
    "link": "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/07/21/washington-commanders-trump-nickname/85313212007/",
    "timestamp": "2025-07-21T20:11:15Z"
  },
  {
    "title": "A recap of the trial over the Trump administration’s crackdown on pro-Palestinian campus protesters",
    "description": "U.S. District Judge William Young heard closing arguments Monday in Boston.",
    "link": "https://www.bostonherald.com/2025/07/21/ideological-deportations/",
    "timestamp": "2025-07-21T20:09:06Z"
  },
  {
    "title": "Six Months in, Trump Has Made American Life Immeasurably Worse",
    "description": "Sunday marked six months of President Donald Trump’s return to office. To celebrate, he and top Republicans kicked the hagiography into full gear. “Today is Six Month Anniversary of my Second Term. Importantly, it’s being hailed as one of the most consequenti…",
    "link": "https://www.motherjones.com/politics/2025/07/six-months-in-trump-has-made-american-life-immeasurably-worse/",
    "timestamp": "2025-07-21T20:09:03Z"
  },
  {
    "title": "Deal or No Deal? Why Israel Launched Ground Attack in a Gaza City It Hadn’t Entered Since War Began",
    "description": "Israel Defense Forces have pushed into a central Gaza city for the first time since Israel’s war with Hamas began following the militant group’s Oct. 7,... Read More\nThe post Deal or No Deal? Why Israel Launched Ground Attack in a Gaza City It Hadn’t Entered …",
    "link": "https://www.dailysignal.com/2025/07/21/deal-no-deal-why-israel-launched-ground-operation-gaza-city-it-hadnt-entered-since-war-began/",
    "timestamp": "2025-07-21T20:08:43Z"
  }
]