[
  {
    "title": "'You didn’t want to hear my lies?' Republican lashes out as town hall derailed by boos",
    "description": "Mark Alford faces questions about Trump Medicaid cuts, GOP priorities in Missouri town hallby Tyler Kirwan and Emily Skidmore, Missouri Independent August 28, 2025HARRISBURG — U.S. Rep. Mark Alford defended actions taken by President Donald Trump at a content…",
    "link": "https://www.rawstory.com/mark-alford-2673938842/",
    "timestamp": "2025-08-28T19:37:40Z"
  },
  {
    "title": "Intel receives $5.7bn as Trump administration buys 10 percent stake",
    "description": "CFO David Zinsner has also downplayed concerns that Intel's manufacturing arm could fall under outside control.",
    "link": "https://www.aljazeera.com/economy/2025/8/28/intel-receives-5-7bn-as-trump-administration-buys-10-percent-stake",
    "timestamp": "2025-08-28T19:37:27Z"
  },
  {
    "title": "Oil Climbs as Peace Talk Prospects Fade",
    "description": "Crude rose after Germany said a Putin and Zelensky meeting is unlikely, reducing expectations for more Russian oil supplies.",
    "link": "https://www.rigzone.com/news/wire/oil_climbs_as_peace_talk_prospects_fade-28-aug-2025-181621-article/",
    "timestamp": "2025-08-28T19:36:58Z"
  },
  {
    "title": "Fox News Bitched About Gavin Newsom In 71 Segments Over Two Weeks",
    "description": "Fox News is having a hard time with California Gov. Gavin Newsom’s tweets mocking President Donald Trump, and new research shows the network has spent hours on-air whining about Newsom’s jabs.\nAccording to data provided to Daily Kos by Media Matters for Ameri…",
    "link": "https://crooksandliars.com/2025/08/fox-bitched-about-gavin-newsom-71-segments",
    "timestamp": "2025-08-28T19:32:38Z"
  },
  {
    "title": "This State Has The Highest Number Of Executions So Far In 2025",
    "description": "One U.S. state far outpaces others in the number of executions carried out so far this year.",
    "link": "https://www.newsweek.com/us-states-highest-number-executions-2025-2121119",
    "timestamp": "2025-08-28T19:32:28Z"
  },
  {
    "title": "America's pilots and surgeons are paying too much in taxes",
    "description": "Under President Donald Trump, the tax code is harder on hard-working wealthy Americans such as pilots and surgeons than those who just got lucky.",
    "link": "https://biztoc.com/x/7f879356caeb763a",
    "timestamp": "2025-08-28T19:31:03Z"
  },
  {
    "title": "Convoy figure seeking U.S. asylum wanted on Canada-wide warrant",
    "description": "A key figure in the 2022 \"Freedom Convoy\" who's seeking asylum in the United States is being sought on a Canada-wide warrant after he failed to appear in court in Ottawa to face criminal charges for his role in the protest.",
    "link": "https://www.cbc.ca/news/canada/ottawa/convoy-figure-seeking-u-s-asylum-wanted-on-canada-wide-warrant-1.7620180",
    "timestamp": "2025-08-28T19:30:34Z"
  },
  {
    "title": "Why is Trump suddenly interested in his enemies' mortgages?",
    "description": "As the president continues targeting adversaries, he's turned to a surprising ally to provide ammunition for an emerging line of attack",
    "link": "https://theweek.com/politics/trump-lisa-cook-mortgage-housing-pulte",
    "timestamp": "2025-08-28T19:30:26Z"
  },
  {
    "title": "RFK Jr. Says He Can Diagnose Kids With Health Issues Just By Looking at Them: ‘You Can Tell From Their Faces’",
    "description": "Secretary of Health Robert F. Kennedy Jr. claimed in a speech on Wednesday that he could diagnose children with health issues just by looking at their face",
    "link": "https://www.newsbreak.com/share/4200760405887-rfk-jr-says-he-can-diagnose-kids-with-health-issues-just-by-looking-at-them-you-can-tell-from-their-faces?s=a2&amp;share_destination_id=MjMyMTkwMDI3LTE3NTY0MDkzOTY3OTM%3D&amp;pd=0FiFERcW&amp;hl=en_US&amp;send_time=1756409396&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button-v2",
    "timestamp": "2025-08-28T19:30:25Z"
  },
  {
    "title": "37",
    "description": "I think 37% is about as low as Trump can go unless a shit economy kicks in, or some other catastrophe, but if that isn't low enough for people to treat him as unpopular...\nPresident Donald Trump’s approval rating dropped to a new low of his second term, accor…",
    "link": "https://www.eschatonblog.com/2025/08/37.html",
    "timestamp": "2025-08-28T19:30:00Z"
  },
  {
    "title": "Pharma In The Crosshairs: Policy Pressure Meets Pipeline Progress",
    "description": "The political spotlight has turned squarely on the pharmaceutical industry. On Aug. 13, President Trump sent letters to 17 of the world’s largest drugmakers,...",
    "link": "https://www.forbes.com/sites/johnbuckingham/2025/08/28/pharma-in-the-crosshairs-policy-pressure-meets-pipeline-progress/",
    "timestamp": "2025-08-28T19:29:56Z"
  },
  {
    "title": "The vaccine and public health debate at the center of CDC upheaval, explained",
    "description": "The White House on Thursday said President Donald Trump had fired CDC Director Susan Monarez after she refused to resign.",
    "link": "https://www.cnbc.com/2025/08/28/cdc-upheaval-the-vaccine-and-public-health-debate-explained.html",
    "timestamp": "2025-08-28T19:29:50Z"
  },
  {
    "title": "Fed Governor Lisa Cook's Record Is a Reminder of the Social Justice Insanity of 2020",
    "description": "What Lisa Cook's cancel-culture past can tell us about the madness of 2020, and how things have changed since then.",
    "link": "https://reason.com/2025/08/28/fed-governor-lisa-cooks-record-is-a-reminder-of-the-social-justice-insanity-of-2020/",
    "timestamp": "2025-08-28T19:29:28Z"
  },
  {
    "title": "Kennedy diz que CDC deve cumprir agenda de Trump após Casa Branca demitir diretora",
    "description": "Kennedy diz que CDC deve cumprir agenda de Trump após Casa Branca demitir diretora\nThe post Kennedy diz que CDC deve cumprir agenda de Trump após Casa Branca demitir diretora appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mundo/kennedy-diz-que-cdc-deve-cumprir-agenda-de-trump-apos-casa-branca-demitir-diretora/",
    "timestamp": "2025-08-28T19:25:27Z"
  },
  {
    "title": "EU condemns Russian attack on Kyiv office",
    "description": "Ursula  Von der Leyen urged Putin \"to come to the negotiating table\" after a Russian attack hit an EU office in Kyiv. Ukraine said at least 21 people were killed in overnight Russian strikes.",
    "link": "https://www.dw.com/en/eu-condemns-russian-attack-on-kyiv-office/live-73789764",
    "timestamp": "2025-08-28T19:22:00Z"
  },
  {
    "title": "White House says US deal with Intel 'still being ironed out'",
    "description": "WASHINGTON :The deal that struggling chipmaker Intel struck with President Donald Trump to give the U.S. government a 10 per cent stake in the company is still under discussion, the White House said on Thursday.White House press secretary Karoline Leavitt tol…",
    "link": "https://www.channelnewsasia.com/business/white-house-says-us-deal-intel-still-being-ironed-out-5320976",
    "timestamp": "2025-08-28T19:18:17Z"
  },
  {
    "title": "Commentary: Trump’s trade war is hurting most sectors of the economy",
    "description": "The latest round of earnings reports revealed widespread damage from the Trump tariffs and other attacks on trade.",
    "link": "https://finance.yahoo.com/news/commentary-trumps-trade-war-is-hurting-most-sectors-of-the-economy-191706763.html",
    "timestamp": "2025-08-28T19:17:06Z"
  },
  {
    "title": "Federal judge bars Kari Lake from ousting Voice of America’s director | CNN Business",
    "description": "A federal judge on Thursday barred Kari Lake, an ally of President Donald Trump, from firing Voice of America Director Michael Abramowitz.",
    "link": "https://www.cnn.com/2025/08/28/business/kari-lake-voice-america",
    "timestamp": "2025-08-28T19:16:17Z"
  },
  {
    "title": "Jan. 6 rioter Ashli Babbitt offered full military funeral, Air Force confirms",
    "description": "The Air Force offered full military funeral honors to Ashli Babbitt, the rioter who was fatally shot by police as she stormed the U.S. Capitol.",
    "link": "https://www.nbcnews.com/news/us-news/jan-6-rioter-ashli-babbitt-offered-full-military-funeral-air-force-con-rcna227815",
    "timestamp": "2025-08-28T19:16:14Z"
  },
  {
    "title": "Mass Shooters Are Not Disproportionately Transgender",
    "description": "The suspect in the mass shooting responsible for killing two school-aged children and wounding 17 others at a Catholic church in Minneapolis on Wednesday has been identified as having changed her legal name in 2020 to reflect her identity as female. “Minor ch…",
    "link": "https://www.motherjones.com/politics/2025/08/mass-shooters-are-not-disproportionately-transgender/",
    "timestamp": "2025-08-28T19:14:35Z"
  },
  {
    "title": "Trump’s North Korea Gambit May Depend On Kim Jong Un’s Powerful Sister",
    "description": "Donald Trump wants to meet with North Korean leader Kim Jong Un, but Kim's increasingly powerful sister may have no desire to engage in fake diplomacy again this time.",
    "link": "https://www.forbes.com/sites/natashalindstaedt/2025/08/28/trumps-north-korea-gambit-may-depend-on-kim-jong-uns-powerful-sister/",
    "timestamp": "2025-08-28T19:14:22Z"
  },
  {
    "title": "Nuclear bomb-building plan faces sweeping Energy Department review",
    "description": "The NNSA's push to build new warhead cores is its \"largest and most complex\" effort since the end of the Manhattan Project, a former leader has said.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/28/nuclear-weapons-plan-energy-department-probe/85852393007/",
    "timestamp": "2025-08-28T19:13:53Z"
  },
  {
    "title": "David Hogg: Trump Is a 'Damn Coward' For Not Changing Gun Laws",
    "description": "Thursday on CNN’s \"The Situation Room,\" former Democratic National Committee co-vice chair David Hogg said President Donald Trump was a \"damn coward\" for not changing gun laws after the mass shooting in Minneapolis.\nThe post David Hogg: Trump Is a ‘Damn Cowar…",
    "link": "https://www.breitbart.com/clips/2025/08/28/david-hogg-trump-is-a-damn-coward-for-not-changing-gun-laws/",
    "timestamp": "2025-08-28T19:13:36Z"
  },
  {
    "title": "‘CDC is in trouble’: Resigning doctor warns of troubling revelations ahead",
    "description": "Dr. Debra Houry, the chief medical officer for the Centers for Disease Control and Prevention, was escorted from the facility on Thursday following the firing of the full department's director, Susan Monarez, on Wednesday. Speaking to MSNBC on Thursday, Houry…",
    "link": "https://www.rawstory.com/cdc-2673938642/",
    "timestamp": "2025-08-28T19:12:25Z"
  },
  {
    "title": "‘Looks Cleaner Than It Has In Years’: Reporter Blown Away By Trump’s Cleanup Success At Union Station",
    "description": "A reporter for a Washington, D.C., area TV station provided an update on how Union Station appeared after President Donald Trump ordered a crackdown on crime.",
    "link": "https://dailycaller.com/2025/08/28/reporter-blown-away-trumps-cleanup-success-dc-union-station/",
    "timestamp": "2025-08-28T19:11:27Z"
  },
  {
    "title": "Dem Rep. Frost: 'We’re Going to See an Uptick in Gun Violence' Under Trump",
    "description": "Thursday on CNN's \"Inside Politics,\" Rep. Maxwell Frost (D-FL) said that \"we're going to see an uptick in gun violence\" under President Donald Trump.\nThe post Dem Rep. Frost: ‘We’re Going to See an Uptick in Gun Violence’ Under Trump appeared first on Breitba…",
    "link": "https://www.breitbart.com/clips/2025/08/28/dem-rep-frost-were-going-to-see-an-uptick-in-gun-violence-under-trump/",
    "timestamp": "2025-08-28T19:11:24Z"
  },
  {
    "title": "‘It Feels Like the CDC Is Over’",
    "description": "The CDC's departing leaders discuss the agency’s future—or lack thereof.",
    "link": "https://www.theatlantic.com/health/archive/2025/08/cdc-resignations-tipping-point/684038/",
    "timestamp": "2025-08-28T19:10:41Z"
  },
  {
    "title": "Departures roil the CDC leadership. What's next for the agency?",
    "description": "Operations at the U.S. Centers for Disease Control and Prevention are in jeopardy after the ousting of the CDC director and the resignation of several high-profile agency leaders",
    "link": "https://abcnews.go.com/Health/wireStory/departures-roil-cdc-leadership-agency-125071756",
    "timestamp": "2025-08-28T19:10:03Z"
  },
  {
    "title": "5,000+ Blockchain Firms Already In The U.S. – Is A Global Power Shift Underway?",
    "description": "The United States is quickly becoming a home base for blockchain and crypto companies that were previously based outside the region.Recent data from...",
    "link": "https://cryptonews.com/news/why-global-blockchain-companies-are-moving-to-the-united-states/",
    "timestamp": "2025-08-28T19:08:35Z"
  },
  {
    "title": "NEW POLL: Literally 0% of Democrats Are Satisfied With How Things Are Going in the US",
    "description": "New polling shows that partisanship has reached new heights with less than 1% of Democrats satisfied with the direction of the country under Trump.\nThe post NEW POLL: Literally 0% of Democrats Are Satisfied With How Things Are Going in the US first appeared o…",
    "link": "https://www.mediaite.com/media/news/new-poll-literally-0-of-democrats-are-satisfied-with-how-things-are-going-in-the-us/",
    "timestamp": "2025-08-28T19:06:55Z"
  },
  {
    "title": "America's pilots and surgeons are paying too much in taxes",
    "description": "Under President Donald Trump, the tax code is harder on hard-working wealthy Americans such as pilots and surgeons than those who just got lucky.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/tax-code-nber-wealthy-pilots-surgeons-rcna227540",
    "timestamp": "2025-08-28T19:05:49Z"
  },
  {
    "title": "Trump is dangling the idea of government checks to get people to donate to his campaign",
    "description": "Trump hasn't actually committed to sending DOGE checks or tariff rebate checks to Americans. He's still mentioning them in fundraising emails.",
    "link": "https://www.businessinsider.com/trump-fundraising-doge-checks-tariff-rebate-2025-8",
    "timestamp": "2025-08-28T19:05:29Z"
  },
  {
    "title": "The “Mini-Trump” Attacking Lisa Cook Had Paperwork Problems of His Own",
    "description": "Donald Trump is attempting to seize control of the historically independent Federal Reserve by firing one of its leaders. Not the chair, Jerome Powell—at least not yet. Instead, the president has set his sights on another member of the Fed’s board: economist …",
    "link": "https://www.motherjones.com/politics/2025/08/the-mini-trump-attacking-lisa-cook-had-paperwork-problems-of-his-own/",
    "timestamp": "2025-08-28T19:04:38Z"
  },
  {
    "title": "After Kyiv assault, EU ambassador wants US help to compel Moscow to end war",
    "description": "“Nobody believes that Putin is committed to peace,\" Katarína Mathernová told POLITICO.",
    "link": "https://www.politico.eu/article/eu-ambassador-ukraine-katarina-mathernova-calls-for-tough-joint-sanctions-us-kyiv-attack-russia/",
    "timestamp": "2025-08-28T19:03:41Z"
  },
  {
    "title": "Tulsi Gabbard blindsided CIA with post-Putin meeting purge: report",
    "description": "Gabbard also outed a CIA agent who had been working undercover, according to reports.",
    "link": "https://www.salon.com/2025/08/28/tulsi-gabbard-blindsided-cia-with-post-putin-meeting-purge-report/",
    "timestamp": "2025-08-28T19:03:28Z"
  },
  {
    "title": "Ukraine says it hit a Russian missile ship with flying explosive-packed drones",
    "description": "The strikes marked the latest Ukrainian attack on Russia's embattled navy, which has suffered heavy losses in the Black Sea.",
    "link": "https://www.businessinsider.com/ukraine-hit-russian-missile-ship-with-flying-drones-2025-8",
    "timestamp": "2025-08-28T19:03:00Z"
  },
  {
    "title": "Minneapolis School Shooter Admitted He was ‘Tired of Being Trans’",
    "description": "\"I wish I never brain-washed myself.”\nThe post Minneapolis School Shooter Admitted He was ‘Tired of Being Trans’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/minneapolis-school-shooter-admitted-he-was-tired-of-being-trans/",
    "timestamp": "2025-08-28T19:00:43Z"
  },
  {
    "title": "European Leaders Begin Process to Restore Snapback Sanctions on Iran",
    "description": "The E3 nations – France, Germany, and the United Kingdom – initiated the process of imposing “snapback” sanctions on Iran at the United Nations on Thursday.\nThe post European Leaders Begin Process to Restore Snapback Sanctions on Iran appeared first on Breitb…",
    "link": "https://www.breitbart.com/europe/2025/08/28/european-leaders-begin-process-restore-snapback-sanctions-iran/",
    "timestamp": "2025-08-28T19:00:36Z"
  },
  {
    "title": "United Nations says children make up 50 percent of gang members in Haiti",
    "description": "US and Panama proposed a security force meant to counter gangs, despite setbacks with an existing policing operation.",
    "link": "https://www.aljazeera.com/news/2025/8/28/united-nations-says-children-make-up-50-percent-of-gang-members-in-haiti",
    "timestamp": "2025-08-28T19:00:26Z"
  },
  {
    "title": "Gavin Newsom Dishes Brutal Trump Mockery From World Leaders: ‘They’re Laughing Behind His Back!’",
    "description": "Gavin Newsom (D-CA) claimed President Donald Trump is being brutally mocked by \"dozens\" of world leaders who are \"laughing behind his back!\"\nThe post Gavin Newsom Dishes Brutal Trump Mockery From World Leaders: ‘They’re Laughing Behind His Back!’ first appear…",
    "link": "https://www.mediaite.com/media/tv/gavin-newsom-dishes-brutal-trump-mockery-from-world-leaders-theyre-laughing-behind-his-back/",
    "timestamp": "2025-08-28T19:00:08Z"
  },
  {
    "title": "'There's mostly confusion': European leaders befuddled by what Trump and Putin agreed to",
    "description": "European leaders were previously hopeful that the summit in Alaska between President Donald Trump and Russia's Vladimir Putin might yield some real progress toward ending the Russian invasion of Ukraine, The Atlantic reported on Thursday — but now they're lef…",
    "link": "https://www.rawstory.com/trump-putin-2673938319/",
    "timestamp": "2025-08-28T19:00:03Z"
  },
  {
    "title": "Charlie Kirk says Taylor Swift should ditch her name, “submit” to Travis Kelce, and have “lots of children”",
    "description": "Conservative commentator Charlie Kirk predicted that Taylor Swift will soon take a hard right turn because of her engagement to Travis Kelce. In a recent episode of his podcast, he based this assumption on the flimsy idea that most people become more right-wi…",
    "link": "https://www.dailydot.com/viral-politics/charlie-kirk-taylor-swift-travis-kelce-engagement/",
    "timestamp": "2025-08-28T19:00:00Z"
  },
  {
    "title": "I Walked Out Of ‘Honey Don’t!’ Confused About Everything BUT My Sexuality",
    "description": "Movies don’t always spell themselves out for us, and their endings don’t always wrap up neatly in a bow. Sometimes they’re gnarled knots we need to untangle once we’ve left …",
    "link": "https://thoughtcatalog.com/nicole-stawiarski/2025/08/i-walked-out-of-honey-dont-confused-about-everything-but-my-sexuality/",
    "timestamp": "2025-08-28T19:00:00Z"
  },
  {
    "title": "Democrats threaten charges for troops who commit crimes at Trump’s direction",
    "description": "Illinois Gov. JB Pritzker and Philadelphia District Attorney Larry Krasner have warned troops they’ll face charges that Trump can’t save them from if they violate residents.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-chicago-philadelphia-prosecute-troops-national-guard-rcna227798",
    "timestamp": "2025-08-28T18:58:47Z"
  },
  {
    "title": "Trump launches a new grift. Another new one. Yes, another",
    "description": "Trump Media, the private crypto/social media/streaming network/finance company run by President Donald Trump and his family, just agreed to a new deal with Crypto.com to do a complicated scammy crypto thing.\nIt’s super cool that the president gets to (not) re…",
    "link": "https://biztoc.com/x/85f86010d114f979",
    "timestamp": "2025-08-28T18:57:17Z"
  },
  {
    "title": "The 100 Most Influential People in AI 2025",
    "description": "Find out why Jensen Huang made TIME’s list of the most influential people in artificial intelligence.",
    "link": "https://time.com/collections/time100-ai-2025/7305861/jensen-huang-ai",
    "timestamp": "2025-08-28T18:57:00Z"
  },
  {
    "title": "It's not just about Russian oil, stupid!",
    "description": "India opted to pay a 25% tariff on US exports instead of stopping Russian oil imports. This decision stems from international politics and strategic negotiation. India believes the US penalty aims to force trade concessions, not just cut off Russia's funding.…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/its-not-just-about-russian-oil-stupid/articleshow/123571517.cms",
    "timestamp": "2025-08-28T18:51:22Z"
  },
  {
    "title": "3 senior leaders quit after CDC director is ousted",
    "description": "After officials said Susan Monarez was no longer director, its chief medical officer and two high-ranking disease experts resigned, citing budget cuts and politicization.",
    "link": "https://www.govexec.com/management/2025/08/3-cdc-senior-leaders-quit-following-agency-leaders-ouster/407742/",
    "timestamp": "2025-08-28T18:51:00Z"
  },
  {
    "title": "Florida taxpayers may lose $218M on ‘Alligator Alcatraz’ as judge orders shutdown",
    "description": "Florida taxpayers could be on the hook for the $218 million cost of converting a training airport in the Everglades into an immigration detention center that may soon be empty of detainees.",
    "link": "https://www.pbs.org/newshour/nation/florida-taxpayers-may-lose-218m-on-alligator-alcatraz-as-judge-orders-shutdown",
    "timestamp": "2025-08-28T18:48:27Z"
  },
  {
    "title": "CFTC: Crypto Firms That Left U.S. Can Open Doors Here as Foreign Boards of Trade",
    "description": "The U.S. derivatives regulator issued a \"reminder\" that foreign crypto firms registered with the CFTC as FBOTs can directly handle U.S. customers.",
    "link": "https://www.coindesk.com/policy/2025/08/28/cftc-crypto-firms-that-left-u-s-can-open-doors-here-as-foreign-boards-of-trade",
    "timestamp": "2025-08-28T18:46:18Z"
  },
  {
    "title": "Cracker Barrel quietly removes Pride page amid logo U-turn and backlash",
    "description": "Cracker Barrel faced backlash after rebranding efforts and criticism from conservative activists, leading to the removal of its LGBTQ+ Pride page and DEI content. The company cited website updates and a shift towards broader corporate giving initiatives as re…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cracker-barrel-quietly-removes-pride-page-amid-logo-u-turn-and-backlash/articleshow/123571404.cms",
    "timestamp": "2025-08-28T18:45:30Z"
  },
  {
    "title": "Spouse of DACA Recipient Detained by ICE—'We Will Never Get Back That Time'",
    "description": "Catalina \"Xochitl\" Santiago, a DACA recipient and community organizer, remains in ICE detention after being arrested this month.",
    "link": "https://www.newsweek.com/spouse-daca-recipient-detained-icewe-will-never-get-back-that-time-2120995",
    "timestamp": "2025-08-28T18:44:44Z"
  },
  {
    "title": "JD Vance Says He’s Ready to Be President If Donald Trump’s Health Fails",
    "description": "The vice president said he has received “good on-the-job training” since his swearing-in.",
    "link": "https://www.thedailybeast.com/jd-vance-says-hes-ready-to-be-president-if-donald-trumps-health-fails/",
    "timestamp": "2025-08-28T18:44:34Z"
  },
  {
    "title": "Alleged Assault on ICE Agents by California Health Workers Leads to Serious Charges",
    "description": "California health workers who've been accused of interfering with ICE agents were indicted on felony charges and will now face a trial.",
    "link": "https://www.westernjournal.com/alleged-assault-ice-agents-california-health-workers-leads-serious-charges/",
    "timestamp": "2025-08-28T18:43:59Z"
  },
  {
    "title": "Lotus to cut 550 UK jobs as sportscar maker restructures amid tariffs and market pressure",
    "description": "Lotus is planning big job cuts in the UK as the company faces tough times in the car market. The sportscar maker is trying to adjust its business for the future while staying committed to its Norfolk base. The move shows how global trade issues and changing c…",
    "link": "https://economictimes.indiatimes.com/news/international/uk/lotus-to-cut-550-uk-jobs-as-sportscar-maker-restructures-amid-tariffs-and-market-pressure/articleshow/123570582.cms",
    "timestamp": "2025-08-28T18:43:54Z"
  },
  {
    "title": "Everything You Need to Know About ‘Saturday Night Live’ Season 51 Amid the Major Cast Shakeup News",
    "description": "All the news and details we have so far on ‘Saturday Night Live’ Season 51, including confirmed cast shakeups and the premiere date.",
    "link": "https://www.cosmopolitan.com/entertainment/tv/a65923939/saturday-night-live-season-51-news-cast-premiere-date/",
    "timestamp": "2025-08-28T18:43:00Z"
  },
  {
    "title": "Marles's 'meeting' with Vance and Hegseth underlines chaos of Trump's White House",
    "description": "A flying trip to the home of US politics ended with Richard Marles grappling with an age-old problem in politics.",
    "link": "https://www.abc.net.au/news/2025-08-29/what-we-learnt-from-richard-marles-meeting-pete-hegseth-jd-vance/105710232",
    "timestamp": "2025-08-28T18:42:09Z"
  },
  {
    "title": "Federal Reserve’s Lisa Cook sues White House over Donald Trump firing threat",
    "description": "Federal Reserve Governor Lisa Cook has sued the Trump administration in an effort to overturn the US president’s attempt to fire her, launching an unprecedented legal battle that could significantly reshape the Fed’s longstanding political independence.",
    "link": "https://www.independent.ie/business/world/federal-reserves-lisa-cook-sues-white-house-over-donald-trump-firing-threat/a1296598842.html",
    "timestamp": "2025-08-28T18:41:10Z"
  },
  {
    "title": "Donald Trump’s threats over digital taxes came days after lobbying by Mark Zuckerberg",
    "description": "US president Donald Trump threatened to inflict \"substantial\" tariffs on countries that impose digital taxes just days after Meta CEO Mark Zuckerberg raised concerns about the levies during a White House meeting.",
    "link": "https://www.independent.ie/business/world/donald-trumps-threats-over-digital-taxes-came-days-after-lobbying-by-mark-zuckerberg/a1699734260.html",
    "timestamp": "2025-08-28T18:40:10Z"
  },
  {
    "title": "Doctor Groups Rail Against Trump's CDC Firing",
    "description": "The Trump White House’s decision to fire Centers for Disease Control and Prevention Director Susan Monarez has enraged the nation’s leading physician groups.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/08/28/doctor-groups-rail-against-trumps-cdc-firing/",
    "timestamp": "2025-08-28T18:38:05Z"
  },
  {
    "title": "Is Robert F. Kennedy, Jr. 'Weaponizing Public Health' by Removing the CDC Director?",
    "description": "The CDC needs drastic reform, but Robert F. Kennedy Jr.'s firing of agency head Susan Monarez does not achieve that.",
    "link": "https://reason.com/2025/08/28/is-rfk-jr-weaponizing-public-health/",
    "timestamp": "2025-08-28T18:35:06Z"
  },
  {
    "title": "Why the end of 'de minimis' can hurt consumers — especially lower-income ones",
    "description": "Consumers will have to start paying duties like tariffs on all online orders of less than $800 shipped directly to their doorstep.",
    "link": "https://www.cnbc.com/2025/08/28/why-the-end-of-de-minimis-can-hurt-consumers-especially-lower-income-ones.html",
    "timestamp": "2025-08-28T18:33:58Z"
  },
  {
    "title": "US Air Force Grants Full Military Funeral Honors To Ashli Babbitt, Reversing Biden Policy",
    "description": "Ashli Babbitt, a deceased Air Force veteran, will receive full military funeral honors, Judicial Watch announced Wednesday in a press release.",
    "link": "https://dailycaller.com/2025/08/28/air-force-ashli-babbitt-military-funeral-honors-judicial-watch-biden/",
    "timestamp": "2025-08-28T18:33:46Z"
  },
  {
    "title": "India may Seek WTO talks on US copper duties",
    "description": "India is contemplating initiating consultations with the United States at the World Trade Organization (WTO) regarding tariffs imposed by Washington on copper imports. This action mirrors previous consultations sought by India concerning US tariffs on steel, …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-may-seek-wto-talks-on-us-copper-duties/articleshow/123571116.cms",
    "timestamp": "2025-08-28T18:33:19Z"
  },
  {
    "title": "Poilievre says he will make Canada's case to American lawmakers 'at the appropriate time'",
    "description": "Conservative Leader Pierre Poilievre says he will speak with American lawmakers and argue Canada&#39s case \"at the appropriate time.\"",
    "link": "https://nationalpost.com/news/politics/poilievre-says-he-will-make-canadas-case-to-american-lawmakers-at-the-appropriate-time",
    "timestamp": "2025-08-28T18:33:17Z"
  },
  {
    "title": "The CDC Implosion Continues as Staff Plan Walkout",
    "description": "At least five senior CDC employees, including its director, have resigned or been fired since Wednesday.",
    "link": "https://gizmodo.com/the-cdc-implosion-continues-as-staff-plan-walkout-2000649819",
    "timestamp": "2025-08-28T18:32:44Z"
  },
  {
    "title": "Noem hits back at FEMA critics, reveals vision for disaster relief agency",
    "description": "DHS Secretary Noem punched back at critics of the administration's handling of FEMA as the future of the agency remains unclear.",
    "link": "https://www.foxnews.com/politics/noem-hits-back-fema-critics-reveals-vision-disaster-relief-agency",
    "timestamp": "2025-08-28T18:29:26Z"
  },
  {
    "title": "Karoline Leavitt Vows Fired CDC Director Will Exit Role: ‘This Woman Has Never Received a Vote’",
    "description": "CDC Director Susan Monarez is fighting back now that she has been fired for clashing with HHS secretary RFK Jr. and refusing to resign her post.\nThe post Karoline Leavitt Vows Fired CDC Director Will Exit Role: ‘This Woman Has Never Received a Vote’ first app…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-vows-fired-cdc-director-will-exit-role-this-woman-has-never-received-a-vote/",
    "timestamp": "2025-08-28T18:25:56Z"
  },
  {
    "title": "Kim Jong Un to meet with Xi and Putin at Chinese military parade",
    "description": "North Korean leader Kim Jong Un will make a rare trip abroad next week to attend a military parade in the Chinese capital.",
    "link": "https://www.pbs.org/newshour/world/kim-jong-un-to-meet-with-xi-and-putin-at-chinese-military-parade",
    "timestamp": "2025-08-28T18:25:13Z"
  },
  {
    "title": "Army Parade 'Disappointed' Trump, So Navy Will Do One Too (Margaret Hartmann/New York Magazine)",
    "description": "Margaret Hartmann / New York Magazine:\nArmy Parade ‘Disappointed’ Trump, So Navy Will Do One Too  —  Donald Trump fulfilled his yearslong dream of holding a military parade in Washington, D.C., this past June.  Miraculously, both the president and his opponen…",
    "link": "https://www.memeorandum.com/250828/p77",
    "timestamp": "2025-08-28T18:25:00Z"
  },
  {
    "title": "Karoline Leavitt Defiant as ‘Alligator Alcatraz’ Faces Closure: ‘We’re Not Backing Down!’",
    "description": "White House press secretary Karoline Leavitt defiantly claimed \"we're not backing down!\" as she was confronted about the imminent closure of the \"Alligator Alcatraz\" migrant detention center in Florida.\nThe post Karoline Leavitt Defiant as ‘Alligator Alcatraz…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-defiant-as-alligator-alcatraz-faces-closure-were-not-backing-down/",
    "timestamp": "2025-08-28T18:24:41Z"
  },
  {
    "title": "Trump fires Democratic member of U.S. Surface Transportation Board ahead of rail merger decision",
    "description": "President Donald Trump has fired one of two Democratic members of the U.S. Surface Transportation Board to break a 2-2 tie before the body considers the largest railroad merger ever proposed.\nBoard member Robert Primus said on LinkedIn that he received an e-m…",
    "link": "https://biztoc.com/x/920690738889919d",
    "timestamp": "2025-08-28T18:23:53Z"
  },
  {
    "title": "Gov. Jared Polis orders $103 million in spending cuts, sweeps state cash accounts to help close budget gap",
    "description": "Gov. Jared Polis will cut $103 million in state spending and sweep $146 million from cash accounts to help plug a large budget deficit caused by the federal tax bill, he announced Thursday.",
    "link": "https://www.denverpost.com/2025/08/28/colorado-budget-cuts-jared-polis/",
    "timestamp": "2025-08-28T18:23:39Z"
  },
  {
    "title": "ICE Preparing To Target Chicago For Immigration Crackdown",
    "description": "The Department of Homeland Security has requested a military base just north of Chicago for assistance on upcoming ICE and federal immigration operations.",
    "link": "https://dailycaller.com/2025/08/28/dhs-requested-naval-base-help-in-chicago/",
    "timestamp": "2025-08-28T18:23:32Z"
  },
  {
    "title": "Iran is facing a return of U.N. sanctions — what happens now?",
    "description": "Britain, France and Germany launched a 30-day process to reimpose U.N. sanctions on Iran over its nuclear programme on Thursday, according to a letter sent by the three nations to the U.N.",
    "link": "https://www.nbcnews.com/world/iran/iran-nuclear-snapback-un-rcna227762",
    "timestamp": "2025-08-28T18:22:48Z"
  },
  {
    "title": "PM Narendra Modi and Chinese President Xi Jinping likely to hold one-on-one meeting on Sunday",
    "description": "Narendra Modi is expected to meet Xi Jinping in Tianjin. This marks Modi's first China visit in seven years. Discussions will aim to rebuild India-China ties. Direct flights between the two nations may resume in September. Talks will cover border de-escalatio…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-narendra-modi-and-chinese-president-xi-jinping-likely-to-hold-one-on-one-meeting-on-sunday/articleshow/123570398.cms",
    "timestamp": "2025-08-28T18:21:28Z"
  },
  {
    "title": "Melania Trump Calls for 'Preemptive Intervention' After Minneapolis Catholic School Shooting",
    "description": "First Lady Melania Trump is calling for \"preemptive intervention\" after the tragic shooting at a Catholic school in Minneapolis, Minnesota, on Wednesday.\nThe post Melania Trump Calls for ‘Preemptive Intervention’ After Minneapolis Catholic School Shooting app…",
    "link": "https://www.breitbart.com/crime/2025/08/28/melania-trump-calls-for-preemptive-intervention-after-minneapolis-catholic-school-shooting/",
    "timestamp": "2025-08-28T18:21:28Z"
  },
  {
    "title": "Democrats slam Donald Trump of tariffs, back India",
    "description": "US Democrats on the House Foreign Affairs Committee are against Donald Trump's policies. They say Trump is unfairly targeting India with tariffs for buying Russian oil. China, a bigger buyer of Russian oil, faces no such penalties. Democrats suggest Trump's a…",
    "link": "https://economictimes.indiatimes.com/news/india/democrats-slam-donald-trump-of-tariffs-back-india/articleshow/123570839.cms",
    "timestamp": "2025-08-28T18:18:28Z"
  },
  {
    "title": "Democrats slam Donald Trump of tariffs, back India",
    "description": "US Democrats on the House Foreign Affairs Committee are against Donald Trump's policies. They say Trump is unfairly targeting India with tariffs for buying Russian oil. China, a bigger buyer of Russian oil, faces no such penalties. Democrats suggest Trump's a…",
    "link": "https://economictimes.indiatimes.com/news/india/democrats-slam-donald-trump-of-tariffs-back-india/articleshow/123570717.cms",
    "timestamp": "2025-08-28T18:18:28Z"
  },
  {
    "title": "Slavery Was Bad and Must Be Remembered",
    "description": "President Trump declared “The Smithsonian is OUT OF CONTROL,” but what’s awry, writes a constitutional scholar, is forgetting American history.\nThe post Slavery Was Bad and Must Be Remembered appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/08/28/message-to-trump-slavery-was-bad/",
    "timestamp": "2025-08-28T18:17:26Z"
  },
  {
    "title": "JD Vance Gives Update on Donald Trump's Health",
    "description": "Speculation about President Donald Trump's health remains rampant as photos continue to show bruising on his hands.",
    "link": "https://www.newsweek.com/donald-trump-health-issues-news-hand-jd-vance-2121065",
    "timestamp": "2025-08-28T18:15:33Z"
  },
  {
    "title": "Trump’s federal takeover of D.C. could do irreparable damage to police-community relations",
    "description": "Maya Wiley warns that Trump's unpopular federal takeover of Washington, D.C. could do great harm to police-community relations.",
    "link": "https://www.msnbc.com/top-stories/latest/washington-dc-national-guard-police-community-relations-rcna227744",
    "timestamp": "2025-08-28T18:12:28Z"
  },
  {
    "title": "RFK Jr. Says CDC Must Deliver On Trump’s Agenda After White House Fires Director",
    "description": "RFK Jr. on Thursday said the CDC needs to deliver on Trump's ambitions, a day after the White House fired the health agency's director and several top officials resigned.",
    "link": "https://www.huffpost.com/entry/rfk-trump-cdc-agenda-monarez_n_68b099d6e4b0d087ed3f3a91",
    "timestamp": "2025-08-28T18:12:16Z"
  },
  {
    "title": "As Iran-Australia relations fracture, Tehran faces a fresh diplomatic setback",
    "description": "Tehran's nuclear ambitions are no secret, and that could lead it to another round of crippling sanctions.",
    "link": "https://www.abc.net.au/news/2025-08-29/europe-countries-to-reimpose-sanctions-on-iran/105710530",
    "timestamp": "2025-08-28T18:10:12Z"
  },
  {
    "title": "White House Is Not Happy With ‘View’ Co-Host For Her Comments On ‘Latino Trumpers’",
    "description": "Ana Navarro has been reminding Latinos who voted for Donald Trump on her Instagram that recent raids and deportations are “s**t you all voted for.”",
    "link": "https://www.huffpost.com/entry/white-house-ana-navarro-latino-trumpers_n_68b07d70e4b0d087ed3f1c73",
    "timestamp": "2025-08-28T18:08:49Z"
  },
  {
    "title": "EXCLUSIVE: GOP Smells Blood In Water Over Defeated Dem Ex-Sen’s ‘Vulnerability’",
    "description": "Former Democratic Ohio Sen. Sherrod Brown faces long odds to reclaim a Senate seat in November 2026, but could also encounter problems right out the gate with a party base hungry for generational change, according to recent polling. A National Republican Sena…",
    "link": "https://dailycaller.com/2025/08/28/sherrod-brown-nrsc-poll-vulnerability/",
    "timestamp": "2025-08-28T18:08:09Z"
  },
  {
    "title": "RFK Jr. Says He Can Diagnose Kids With Health Issues Just By Looking at Them: ‘You Can Tell From Their Faces’",
    "description": "Secretary of Health Robert F. Kennedy Jr. claimed in a speech on Wednesday that he could diagnose children with health issues just by looking at their face",
    "link": "https://www.newsbreak.com/share/4200760405887-rfk-jr-says-he-can-diagnose-kids-with-health-issues-just-by-looking-at-them-you-can-tell-from-their-faces?_f=app_share&amp;pd=0F7zG5T5&amp;lang=en_US&amp;send_time=1756404407&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button-v2&amp;s=i2",
    "timestamp": "2025-08-28T18:07:49Z"
  },
  {
    "title": "Meta's Zuckerberg pressed Trump on digital taxes before tariff threat, Bloomberg News reports",
    "description": "Meta Platforms CEO Mark Zuckerberg had visited U.S. President Donald Trump last week to discuss the threat of digital service taxes, Bloomberg News reported on Thursday, citing people familiar with the private meeting.Days after the meeting, Trump threatened …",
    "link": "https://www.channelnewsasia.com/business/metas-zuckerberg-pressed-trump-digital-taxes-tariff-threat-bloomberg-news-reports-5320871",
    "timestamp": "2025-08-28T18:06:45Z"
  },
  {
    "title": "CNBC Analyst Rips Media’s Trump Panic After Latest Jobs Report Turns Out Good: ‘Not Sending Any Smoke Signals’",
    "description": "CNBC's Rick Santelli took a shot at the media's economic panic after the latest jobs report on Thursday turned out to be a good one.\nThe post CNBC Analyst Rips Media’s Trump Panic After Latest Jobs Report Turns Out Good: ‘Not Sending Any Smoke Signals’ first …",
    "link": "https://www.mediaite.com/media/tv/cnbc-analyst-rips-medias-trump-panic-after-latest-jobs-report-turns-out-good-not-sending-any-smoke-signals/",
    "timestamp": "2025-08-28T18:05:09Z"
  },
  {
    "title": "Price of Mounjaro could be discounted in UK pharmacies",
    "description": "The rebate allays fears of a 170% price rise but patients are warned the cost of the drug will still jump.",
    "link": "https://www.bbc.co.uk/news/articles/cvg3ykg4jrro",
    "timestamp": "2025-08-28T18:05:00Z"
  },
  {
    "title": "Trump pick for UN aviation office has long history donating to Dems, Nikki Haley",
    "description": "Former Delta pilot Jeffrey Anderson nominated as ICAO ambassador despite history of Democratic donations, unpaid taxes, and opposition from pilots union.",
    "link": "https://www.foxnews.com/politics/trump-pick-un-aviation-office-has-long-history-donating-dems-nikki-haley",
    "timestamp": "2025-08-28T18:04:34Z"
  },
  {
    "title": "Trump railroad regulator was fired by White House after Amtrak Acela event",
    "description": "\"I was just as surprised as anyone,\" the former board member, Robert Primus, said in an interview with CNBC's Eamon Javers.",
    "link": "https://www.cnbc.com/2025/08/28/trump-robert-primus-stb-amtrak-train.html",
    "timestamp": "2025-08-28T18:04:09Z"
  }
]