[
  {
    "title": "Szijjártó: Donald Trump’s\npresidency marks the golden age\nof Hungarian-American relations",
    "description": "Foreign Minister Péter Szijjártó emphasized the visit as the beginning of a new chapter in relations between the two countries, a stark contrast to what he called the “hostile” approach of the previous liberal U.S. administration. “With President Trump’s vict…",
    "link": "https://freerepublic.com/focus/f-news/4351087/posts",
    "timestamp": "2025-11-06T18:49:05Z"
  },
  {
    "title": "Trump punches new $35 billion hole in national debt with deal for Medicare to cover your Ozempic",
    "description": "America's waistline may shrink, but its national debt will swell.",
    "link": "https://fortune.com/2025/11/06/trump-ozempic-medicare-medicaid-wegovy-national-debt/",
    "timestamp": "2025-11-06T18:47:11Z"
  },
  {
    "title": "Trump punches new $35 billion hole in national debt with deal for Medicare to cover your Ozempic",
    "description": "America's waistline may shrink, but its national debt will swell.",
    "link": "https://finance.yahoo.com/news/trump-punches-35-billion-hole-184711550.html",
    "timestamp": "2025-11-06T18:47:11Z"
  },
  {
    "title": "Texts appear to show Border Patrol agent bragging about shooting a woman in Chicago",
    "description": "The messages were presented as evidence during a federal court hearing.",
    "link": "https://www.bostonherald.com/2025/11/06/federal-enforcement-chicago-shooting/",
    "timestamp": "2025-11-06T18:46:15Z"
  },
  {
    "title": "Oval Office Horror: Man Passes Out During Live Press Conference With Trump and Dr. Oz About Weight-Loss Drugs",
    "description": "A man passed out during a live press conference with Donald Trump.",
    "link": "https://radaronline.com/p/oval-office-gordon-findlay-passes-out-video-trump-dr-oz-press-conference/",
    "timestamp": "2025-11-06T18:45:24Z"
  },
  {
    "title": "Space Stock Tracker—BlackSky, Redwire Dump After Earnings; AST, Rocket Lab On Deck",
    "description": "Space stocks are in focus after President Donald Trump nominated a new head of NASA and earnings season gets underway for commercial space companies. \nHere's a look at what is happening in the space sector: \nRKLB stock is moving. See the real-time price actio…",
    "link": "https://biztoc.com/x/30a7d766a5dac1fe",
    "timestamp": "2025-11-06T18:45:16Z"
  },
  {
    "title": "Trump unveils deal with Eli Lilly and Novo Nordisk to lower costs and expand coverage for obesity drugs",
    "description": "President Donald Trump unveiled a deal Thursday with drugmakers Eli Lilly and Novo Nordisk to expand coverage and reduce prices for their popular obesity treatments Zepbound and Wegovy.\nThe drugs are part of a new generation of obesity medications known as GL…",
    "link": "https://biztoc.com/x/40573d8e4e0349af",
    "timestamp": "2025-11-06T18:45:07Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Announces Major Developments in Bringing Most-Favored-Nation Pricing to American Patients (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Announces Major Developments in Bringing Most-Favored-Nation Pricing to American Patients  —  ADVANCING MOST-FAVORED-NATION (MFN) PRICING: Today, President Donald J. Trump announced the latest in a series…",
    "link": "https://www.memeorandum.com/251106/p82",
    "timestamp": "2025-11-06T18:45:01Z"
  },
  {
    "title": "National Retail Federation predicts first $1 trillion holiday shopping season",
    "description": "American shoppers are expected to spend more during the holiday shopping season this year, compared with a year ago, despite shoppers’ downbeat attitude amid all the economic uncertainty and rising prices from President Donald Trump’s tariffs",
    "link": "https://abcnews.go.com/US/wireStory/national-retail-federation-predicts-1-trillion-holiday-shopping-127268560",
    "timestamp": "2025-11-06T18:43:42Z"
  },
  {
    "title": "Trump Just Stands There After Man Collapses During Press Conference",
    "description": "One of the guests at Donald Trump’s press conference on weight loss drugs passed out during the event.",
    "link": "https://newrepublic.com/post/202825/donald-trump-novo-nordisk-executive-collapses-drugs",
    "timestamp": "2025-11-06T18:43:19Z"
  },
  {
    "title": "Circle weighs in on GENIUS Act implementation: ‘Simple, strong rules’",
    "description": "Unlike Coinbase's recommendations, a summary of Circle’s comments to the US Treasury on the GENIUS Act did not appear to show any pushback on interest-bearing stablecoins.",
    "link": "https://cointelegraph.com/news/stablecoins-circle-genius-implementation-rules",
    "timestamp": "2025-11-06T18:41:57Z"
  },
  {
    "title": "Comedian John Mulaney watches from 'cheap seats' as Supreme Court justices weigh Trump's tariff powers",
    "description": "Lawyer Neal Katyal argues Trump tariff case at Supreme Court while collaborating with John Mulaney on \"The West Wing\"-style TV series about the high court.",
    "link": "https://www.foxnews.com/entertainment/comedian-john-mulaney-watches-from-cheap-seats-supreme-court-justices-weigh-trumps-tariff-powers",
    "timestamp": "2025-11-06T18:41:12Z"
  },
  {
    "title": "Trump taps DEI critic to lead workplace civil rights agency",
    "description": "President Donald Trump has appointed Andrea Lucas as chair of the nation's top workplace civil rights agency",
    "link": "https://abcnews.go.com/Business/wireStory/trump-taps-dei-critic-lead-workplace-civil-rights-127268150",
    "timestamp": "2025-11-06T18:37:48Z"
  },
  {
    "title": "Pharmaceutical Rep Collapses in Oval Office During Trump Weight Loss Drug Press Conference | Video",
    "description": "\"A representative with one of the companies fainted. The White House Medical Unit quickly jumped into action and the gentleman is okay,\" Press Secretary Karoline Leavitt says\nThe post Pharmaceutical Rep Collapses in Oval Office During Trump Weight Loss Drug P…",
    "link": "https://www.thewrap.com/trump-oval-office-man-collapses-weight-loss-drugs/",
    "timestamp": "2025-11-06T18:35:26Z"
  },
  {
    "title": "Trump makes deal to lower Ozempic and other GLP-1 costs",
    "description": "Trump announced new deals with Eli Lilly and Novo Nordisk to lower GLP-1 costs for Medicare, Medicaid, and cash-paying patients.",
    "link": "https://www.washingtonexaminer.com/policy/healthcare/3877608/trump-deal-lower-prices-obesity-drugs-eli-lilly-novo-nordisk/",
    "timestamp": "2025-11-06T18:35:16Z"
  },
  {
    "title": "Trump unveils deals to lower weight-loss drug prices",
    "description": "US President Donald Trump announces agreements with drug makers Eli Lilly and Novo Nordisk.",
    "link": "https://biztoc.com/x/544642fda3d3bdf1",
    "timestamp": "2025-11-06T18:34:06Z"
  },
  {
    "title": "‘It’s Insane!’ Karine Jean-Pierre Rips Media Over ‘Trump Standard’",
    "description": "Karine Jean-Pierre told SiriusXM radio host Dean Obeidallah that the media has a completely different and \"insane\" standard for covering President Donald Trump.\nThe post ‘It’s Insane!’ Karine Jean-Pierre Rips Media Over ‘Trump Standard’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/podcasts/its-insane-karine-jean-pierre-rips-media-over-trump-standard/",
    "timestamp": "2025-11-06T18:34:02Z"
  },
  {
    "title": "“It’s only a matter of time before people die”: Trump cuts hit food inspections",
    "description": "American inspections of foreign food facilities hit historic lows this year.",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179986316",
    "timestamp": "2025-11-06T18:32:34Z"
  },
  {
    "title": "Prices Are Rising From Trump’s Tariffs—Can Supreme Court Stop It? What To Know.",
    "description": "Businesses are reporting they’re increasingly having to pass the costs of tariffs on to consumers.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/11/06/prices-are-rising-from-trumps-tariffs-can-supreme-court-stop-it-what-to-know/",
    "timestamp": "2025-11-06T18:31:34Z"
  },
  {
    "title": "Trump taps DEI critic to lead workplace civil rights agency",
    "description": "President Donald Trump has named Andrea Lucas as chair of the country’s top workplace civil rights agency, the agency announced Thursday. The move signals a vote of confidence for Lucas’s efforts to stamp out diversity programs, roll back protections for tran…",
    "link": "https://financialpost.com/pmn/trump-taps-dei-critic-to-lead-workplace-civil-rights-agency",
    "timestamp": "2025-11-06T18:30:44Z"
  },
  {
    "title": "Mamdani and Trump Deepen Political Feud",
    "description": "The left vs. right paradigm lie has become very apparent as Zohran Mamdani, the newly elected mayor of New York City, calls out current president Donald Trump. The divide between extremist factions on both sides has never been deeper, and the only losers will…",
    "link": "https://www.shtfplan.com/headline-news/mamdani-and-trump-deepen-political-feud",
    "timestamp": "2025-11-06T18:30:27Z"
  },
  {
    "title": "Denmark eyes new law to protect citizens from AI deepfakes",
    "description": "If enacted, Danish citizens would get the copyright over their own likeness.",
    "link": "https://www.bostonherald.com/2025/11/06/denmark-ai-deepfake-law/",
    "timestamp": "2025-11-06T18:28:44Z"
  },
  {
    "title": "Voters signed up to deport criminals, not grandmas",
    "description": "When President Donald Trump won the 2024 election, many American voters wanted immigration reduced, and Trump quickly complied. He boosted funding for immigration enforcement, opened new detention centers, and pushed more Immigration and Customs Enforcement, …",
    "link": "https://www.vox.com/podcasts/467660/ice-deportations-poll-trump-2025",
    "timestamp": "2025-11-06T18:28:40Z"
  },
  {
    "title": "Shock moment man collapses yards from Donald Trump in the Oval Office during health announcement",
    "description": "Shock moment man collapses yards from Donald Trump in the Oval Office during health announcementyoutube.com",
    "link": "https://www.youtube.com/supported_browsers?next_url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DUXrVGllwKqI",
    "timestamp": "2025-11-06T18:28:38Z"
  },
  {
    "title": "Should the US resume nuclear testing?",
    "description": "Trump vows to restart testing, but China might benefit most",
    "link": "https://theweek.com/politics/nuclear-testing-us-resume-weapons-china",
    "timestamp": "2025-11-06T18:28:30Z"
  },
  {
    "title": "‘People Don’t Change’: The View’s Sunny Hostin Calls Out Marjorie Taylor Greene After Her Friendly Appearance on Show",
    "description": "View's Sunny Hostin called out Marjorie Taylor Greene after her visit to the show, accusing her of \"behaving differently\" to feed her political ambitions.\nThe post ‘People Don’t Change’: The View’s Sunny Hostin Calls Out Marjorie Taylor Greene After Her Frien…",
    "link": "https://www.mediaite.com/media/podcasts/people-dont-change-the-views-sunny-hostin-calls-out-marjorie-taylor-greene-after-her-friendly-appearance-on-show/",
    "timestamp": "2025-11-06T18:28:22Z"
  },
  {
    "title": "Federal officials reviewing options for having Tina Peters moved out of Colorado prison",
    "description": "Follows warning that case was 'oriented more toward inflicting political pain than toward pursuing actual justice'",
    "link": "https://www.wnd.com/2025/11/federal-officials-reviewing-options-having-tina-peters-moved/",
    "timestamp": "2025-11-06T18:26:04Z"
  },
  {
    "title": "Nancy Pelosi age, retirement: How old is U.S. Speaker? Saikat Chakrabarti or other Democrats -- Who will replace San Francisco politician?",
    "description": "Nancy Pelosi retirement comes after nearly 40 years in office. California Democrats hadn't been holding back in making plans.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nancy-pelosi-age-retirement-how-old-is-u-s-speaker-saikat-chakrabarti-or-other-democrats-who-will-replace-san-francisco-politician/articleshow/125141313.cms",
    "timestamp": "2025-11-06T18:25:59Z"
  },
  {
    "title": "South Sudanese migrants in US to lose Temporary Protected Status",
    "description": "The termination will be effective Jan. 5, the Department of Homeland Security said in a statement.",
    "link": "https://apnews.com/article/south-sudan-us-tps-immigration-52f386361302122137de94adac3b7aec",
    "timestamp": "2025-11-06T18:25:56Z"
  },
  {
    "title": "'Medical emergency' in Oval Office...",
    "description": "Top drugmakers nationwide came to the conference to discuss coverage and a reduction in cost for weight loss medication",
    "link": "https://www.the-sun.com/news/15452648/donald-trump-press-conference-cut-short-medical-emergency/",
    "timestamp": "2025-11-06T18:25:39Z"
  },
  {
    "title": "Trump unveils deals to lower weight-loss drug prices",
    "description": "US President Donald Trump announces agreements with drug makers Eli Lilly and Novo Nordisk.",
    "link": "https://www.bbc.com/news/articles/czxk7k9nd11o",
    "timestamp": "2025-11-06T18:25:36Z"
  },
  {
    "title": "Watch: Drug executive collapses in the Oval Office",
    "description": "Novo Nordisk executive Gordon Findlay collapses during a press conference about a new agreement with pharmaceutical companies aimed at reducing prices.",
    "link": "https://www.israelnationalnews.com/news/417411",
    "timestamp": "2025-11-06T18:25:10Z"
  },
  {
    "title": "Donald Trump keeps benefiting from the Supreme Court’s criminal immunity ruling",
    "description": "President Donald Trump just got a boost in his ongoing appeal of his New York state hush money conviction, thanks to the Supreme Court’s immunity ruling in his federal election interference case.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/donald-trump-supreme-court-presidential-immunity-ruling-rcna242344",
    "timestamp": "2025-11-06T18:25:09Z"
  },
  {
    "title": "Appeals court hands Trump legal win, orders review of hush money case over presidential immunity",
    "description": "A federal appeals court said a lower court must reconsider President Donald Trump’s bid to move his hush money case from state court to a federal court.",
    "link": "https://www.foxnews.com/politics/appeals-court-hands-trump-legal-win-orders-review-hush-money-case-over-presidential-immunity",
    "timestamp": "2025-11-06T18:25:04Z"
  },
  {
    "title": "Ecuador's President Vows to End Drug Trafficking in Meeting with Kristi Noem",
    "description": "President of Ecuador Daniel Noboa on Wednesday vowed to curb U.S.-bound drug trafficking routes coming from the coastal provinces of Manabí and Santa Elena during Department of Homeland Security (DHS) Sec. Kristi Noem's visit to the country.\nThe post Ecuador’…",
    "link": "https://www.breitbart.com/latin-america/2025/11/06/ecuadors-president-vows-to-end-drug-trafficking-in-meeting-with-kristi-noem/",
    "timestamp": "2025-11-06T18:24:42Z"
  },
  {
    "title": "‘We miss you’: Kalispell, Mont., launches campaign to woo back Canadian visitors",
    "description": "CALGARY — One of Montana’s main travel destinations is reaching out to Canadians — offering deals, discounts and specials in an effort to lure them back for a visit. Discover Kalispell, a tourism marketing and management organization for the city and northwes…",
    "link": "https://financialpost.com/pmn/we-miss-you-kalispell-mont-launches-campaign-to-woo-back-canadian-visitors",
    "timestamp": "2025-11-06T18:24:28Z"
  },
  {
    "title": "Man collapses during White House news conference",
    "description": "A press conference concerning the lowering of some obesity drug prices by President Donald Trump’s administration was abruptly stopped when one of the people there collapsed.",
    "link": "https://www.wsbtv.com/news/trending/man-collapses-during-white-house-news-conference/AEZT7UEF4ZA2XEDMMIYUPQL7G4/",
    "timestamp": "2025-11-06T18:24:00Z"
  },
  {
    "title": "Trump's Proposed 'Arc De Trump' Washington D.C. Monument May Cost $100 Million",
    "description": "Donald Trump is proposing an “Arc de Trump,” and it may come at a huge cost. He first spoke to the idea of building a huge monument to commemorate the 250th anniversary of the United States while talking to donors back in October, showing off mockups of the p…",
    "link": "https://www.justjared.com/2025/11/06/trumps-proposed-arc-de-trump-washington-d-c-monument-may-cost-100-million/",
    "timestamp": "2025-11-06T18:23:51Z"
  },
  {
    "title": "'Another Trump Lie': Despite Campaign Pledges, Electricity Costs Up $100 Per Family",
    "description": "As low-income households in northern states where the weather has already turned colder face the loss of heating assistance due to the government shutdown, a congressional report unveiled Thursday reveals that households across the country can expect to pay a…",
    "link": "https://www.commondreams.org/news/electric-bills-going-up",
    "timestamp": "2025-11-06T18:23:34Z"
  },
  {
    "title": "EXCLUSIVE: How Nancy Pelosi 'Blackmailed' Joe Biden Into Quitting His 'Doomed' Reelection Bid Against Trump — Before Pulling the Plug on Her Own Political Career",
    "description": "After his disastrous debate performance against Donald Trump, Pelosi gave Biden an ultimatum:  drop out, or she would join the voices publicly trashing him.",
    "link": "https://radaronline.com/p/nancy-pelosi-blackmailed-joe-biden-end-reelection-campaign-retirement-congress/",
    "timestamp": "2025-11-06T18:19:28Z"
  },
  {
    "title": "Gov. Shapiro Claims Voters Are Tired of ‘Extremism’ Despite Mamdani Victory",
    "description": "Democrat Pennsylvania Gov. Josh Shapiro sought to tie GOP losses in Tuesday’s election to President Donald Trump, saying voters are weary of the “chaos” he... Read More\nThe post Gov. Shapiro Claims Voters Are Tired of ‘Extremism’ Despite Mamdani Victory appea…",
    "link": "https://www.dailysignal.com/2025/11/06/gov-shapiro-claims-voters-are-tired-of-extremism-despite-mamdani-victory/",
    "timestamp": "2025-11-06T18:18:23Z"
  },
  {
    "title": "Pharma Exec Collapses During White House Event on Drug Prices",
    "description": "It happened right in front of president Trump.\nThe post Pharma Exec Collapses During White House Event on Drug Prices appeared first on Futurism.",
    "link": "http://futurism.com/health-medicine/pharma-exec-collapses-white-house-event-drug-prices",
    "timestamp": "2025-11-06T18:17:54Z"
  },
  {
    "title": "Trump’s Response To Pelosi’s Retirement Is As Statesmanlike As You’d Expect",
    "description": "It. Was. Quite. The. Reaction.",
    "link": "https://www.huffpost.com/entry/trump-reaction-pelosi-retirement_n_690cccd3e4b0799004d39688",
    "timestamp": "2025-11-06T18:16:31Z"
  },
  {
    "title": "Trump celebrates ‘evil’ Pelosi’s retirement as ‘a great thing for America’; says he’s honored she impeached him twice and failed miserably",
    "description": "Trump reacts to Pelosi's retirement: US President Donald Trump celebrated Nancy Pelosi's retirement from Congress, calling it \"a great thing for America\" and labeling her \"evil\" and \"corrupt.\" Pelosi, who served nearly 40 years and was the first woman Speaker…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-celebrates-evil-pelosis-retirement-as-a-great-thing-for-america-says-hes-honored-she-impeached-him-twice-and-failed-miserably/articleshow/125140988.cms",
    "timestamp": "2025-11-06T18:16:31Z"
  },
  {
    "title": "'First signs are visible': Republican ex-lawmaker flags evidence of 'migration' from GOP",
    "description": "A former Republican lawmaker says that people are fleeing the GOP in a great migration. The shift started slowly within the party, but now it's picking up speed, according to Arizona Republican Jeff Flake, former U.S. senator, representative and the former U.…",
    "link": "https://www.rawstory.com/maga-movement-2674271884/",
    "timestamp": "2025-11-06T18:13:42Z"
  },
  {
    "title": "Abby Zwerner trial update: Jury awards $10 million to Virginia teacher shot by 6-year-old student - CNN",
    "description": "Abby Zwerner trial update: Jury awards $10 million to Virginia teacher shot by 6-year-old studentCNN Abigail Zwerner wins $10 million in lawsuit over being shot by 6-year-old in Virginia schoolNBC News Virginia teacher shot by 6-year-old, school admin spar ov…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179986142",
    "timestamp": "2025-11-06T18:13:18Z"
  },
  {
    "title": "Trump admin will pay for more November SNAP benefits than expected - Politico",
    "description": "Trump admin will pay for more November SNAP benefits than expectedPolitico USDA revises SNAP reduction plan to provide more partial benefits in NovemberCNN USDA Raises Amount of Food Aid It Says It Can Pay After Church Group ComplainsBarron's Partial SNAP ben…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179986140",
    "timestamp": "2025-11-06T18:13:08Z"
  },
  {
    "title": "Media Ushered Out Of Oval Office After Man Collapses During Trump Announcement On Weight-Loss Drug Discounts",
    "description": "A man standing near Donald Trump in the Oval Office collapsed as the president was holding a press event to announce discounts to two popular weight loss drugs. Media was rushed out of the Oval Office as figures like Dr. Mehmet Oz tried to assist the man. Fox…",
    "link": "http://deadline.com/2025/11/trump-weight-loss-drug-discounts-1236609242/",
    "timestamp": "2025-11-06T18:12:38Z"
  },
  {
    "title": "Trump and RFK Double Down on Controversial Tylenol Claims at ‘Fat Drug’ Presser: ‘The Science Hasn’t Changed!",
    "description": "Donald Trump and Health and Robert F. Kennedy Jr. doubled-down on their controversial Tylenol claims during an Oval Office press conference Thursday.\nThe post Trump and RFK Double Down on Controversial Tylenol Claims at ‘Fat Drug’ Presser: ‘The Science Hasn’t…",
    "link": "https://www.mediaite.com/media/news/trump-and-rfk-double-down-on-controversial-tylenol-claims-at-fat-drug-presser-the-science-hasnt-changed/",
    "timestamp": "2025-11-06T18:11:07Z"
  },
  {
    "title": "WATCH: Man Collapses During Oval Office Address As Press Is Rushed Out Of Room",
    "description": "Video of the event shows Dr. Mehmet Oz coming to the aid of the man. Trump slowly stood up from behind the Resolute Desk and watched.",
    "link": "https://www.huffpost.com/entry/watch-man-collapses-during-oval-office-address-as-press-is-rushed-out-of-room_n_690ce231e4b094b50cf8b058",
    "timestamp": "2025-11-06T18:08:13Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.11.05 WEB H264-onX",
    "description": "Season , Episode – \"“Going To Change HISTORY” Mamdani WINS NYC Mayoral Election | With Vinny Oshana\"Zohran Mamdani is the new mayor of New York City, much to the chagrin of Republicans. After winning with a populist campaign, turbocharged by social media, the…",
    "link": "https://post.rlsbb.to/piers-morgan-uncensored-2025-11-05-web-h264-onx/",
    "timestamp": "2025-11-06T18:07:47Z"
  },
  {
    "title": "Nancy Pelosi Announces She Won’t Seek Re-Election to Congress",
    "description": "Former House Speaker Nancy Pelosi announces she will not seek re-election to Congress next year. Pelosi served as speaker twice and shepherded legislation like the Affordable Care Act into law during her first run and choreographed two impeachments of Preside…",
    "link": "https://www.today.com/video/nancy-pelosi-announces-retirement-after-decades-in-congress-251481669926",
    "timestamp": "2025-11-06T18:07:32Z"
  },
  {
    "title": "Man collapses during White House news conference",
    "description": "A press conference concerning the lowering of some obesity drug prices by President Donald Trump’s administration was abruptly stopped when one of the people there collapsed.",
    "link": "https://www.wftv.com/news/trending/man-collapses-during-white-house-news-conference/AEZT7UEF4ZA2XEDMMIYUPQL7G4/",
    "timestamp": "2025-11-06T18:06:56Z"
  },
  {
    "title": "MSNBC’s Jen Psaki Roasts Trump in Victory Lap Over ‘Absolute Thumping’ in Elections",
    "description": "Jen Psaki roasted President Donald Trump’s take on the \"thumping\" Democrats gave Republicans as she took a victory lap over the results.\nThe post MSNBC’s Jen Psaki Roasts Trump in Victory Lap Over ‘Absolute Thumping’ in Elections first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/msnbcs-jen-psaki-roasts-trump-in-victory-lap-over-absolute-thumping-in-elections/",
    "timestamp": "2025-11-06T18:06:34Z"
  },
  {
    "title": "Man collapses during White House news conference",
    "description": "A press conference concerning the lowering of some obesity drug prices by President Donald Trump’s administration was abruptly stopped when one of the people there collapsed.",
    "link": "https://www.wpxi.com/news/trending/man-collapses-during-white-house-news-conference/AEZT7UEF4ZA2XEDMMIYUPQL7G4/",
    "timestamp": "2025-11-06T18:06:14Z"
  },
  {
    "title": "Man collapses during White House news conference",
    "description": "A press conference concerning the lowering of some obesity drug prices by President Donald Trump’s administration was abruptly stopped when one of the people there collapsed.",
    "link": "https://www.wsoctv.com/news/trending/man-collapses-during-white-house-news-conference/AEZT7UEF4ZA2XEDMMIYUPQL7G4/",
    "timestamp": "2025-11-06T18:06:13Z"
  },
  {
    "title": "Trump ridiculed as he discovers 'new word' — and becomes obsessed with it",
    "description": "Donald Trump was ridiculed Thursday as he claimed to have discovered a \"new word\" — one that's in common usage but he's suddenly realized the importance of.MSNBC's Steve Benen pointed out the president's sudden obsession with \"affordability\" — a word that mar…",
    "link": "https://www.rawstory.com/trump-affordability/",
    "timestamp": "2025-11-06T18:03:42Z"
  },
  {
    "title": "Marjorie Taylor Greene Offers Surprising Praise For Retiring Nancy Pelosi",
    "description": "She has certainly not always had such positive remarks about the longtime Democratic House speaker.",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-offers-surprising-praise-for-retiring-nancy-pelosi_n_690cd2a0e4b027afb32269f8",
    "timestamp": "2025-11-06T18:02:07Z"
  },
  {
    "title": "SFO Delays Could Worsen Under Trump Plans to Cut Air Traffic in US by 10%",
    "description": "The plan could force the cancellation of thousands of flights across the country as the Trump administration ramps up pressure on Democrats in Congress to end the shutdown.",
    "link": "https://www.kqed.org/news/12063196/sfo-delays-could-worsen-under-trump-plans-to-cut-air-traffic-in-us-by-10",
    "timestamp": "2025-11-06T18:02:03Z"
  },
  {
    "title": "The United States Is Letting Its People Starve",
    "description": "Katrina vanden Heuvel\n\n\n\nUS leaders have long taken some responsibility to help poor people meet basic nutritional needs. That era appears over.\r\n\n\r\n\n\nThe post The United States Is Letting Its People Starve appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/snap-benefits-donald-trump/",
    "timestamp": "2025-11-06T18:01:31Z"
  },
  {
    "title": "Novo Nordisk Executive Findlay Collapses Behind Trump in Oval Office",
    "description": "Novo Nordisk Executive Gordon Findlay collapsed behind President Donald Trump during an Oval Office press conference on Thursday.",
    "link": "https://biztoc.com/x/a022f93290fc8c83",
    "timestamp": "2025-11-06T18:01:13Z"
  },
  {
    "title": "Trump event halted over health emergency",
    "description": "US President Donald Trump's announcement of drug price reductions for diabetes and obesity patients from the Oval Office was cut short when an elderly man in the surrounding crowd collapsed.The execut...",
    "link": "https://biztoc.com/x/3c2c6516532bc238",
    "timestamp": "2025-11-06T18:01:07Z"
  },
  {
    "title": "Appeals court revives Trump's effort to remove hush money case to federal court (Aaron Katersky/Associated Press)",
    "description": "Aaron Katersky / Associated Press:\nAppeals court revives Trump's effort to remove hush money case to federal court  —  The appellate court ordered a judge to reconsider his ruling denying the move.  —  President Donald Trump speaks to the America Business For…",
    "link": "https://www.memeorandum.com/251106/p72",
    "timestamp": "2025-11-06T18:00:34Z"
  },
  {
    "title": "Pharmacy benefit manager reform vs. direct drug plans",
    "description": "Much has been made of the move by President Donald Trump and the pharmaceutical industry to offer direct-purchase drug programs at heavily discounted rates. Following the announcement of these new programs and TrumpRx, we’ve heard news and opinion pieces from…",
    "link": "https://kevinmd.com/2025/11/pharmacy-benefit-manager-reform-vs-direct-drug-plans.html",
    "timestamp": "2025-11-06T18:00:22Z"
  },
  {
    "title": "Developer: Florida Real Estate Surges as New Yorkers 'Nervous' About Socialist Zohran Mamdani",
    "description": "The real estate business in South Florida is booming with residents of New York City looking to relocate as the political climate in the Big Apple appears to be taking a hard left turn, a developer told Fox Business.\nThe post Developer: Florida Real Estate Su…",
    "link": "https://www.breitbart.com/politics/2025/11/06/developer-florida-real-estate-surges-as-people-are-nervous-about-socialist-zohran-mamdani/",
    "timestamp": "2025-11-06T18:00:16Z"
  },
  {
    "title": "Troops pictured training in Puerto Rico forest as Venezuela invasion fears grow...",
    "description": null,
    "link": "https://www.the-express.com/news/politics/189759/trump-preparing-invade-venezuela-puerto-rico",
    "timestamp": "2025-11-06T18:00:15Z"
  },
  {
    "title": "“It’s giving Cheesecake Factory”: Trump’s Oval Office gets a new gold sign, and everyone has jokes",
    "description": "A new sign outside President Donald Trump’s Oval Office has the internet both puzzled and amused, with many calling the gold-lettered addition a “wedding reception” aesthetic for the White House.\n\n\nWhat is the new sign outside the Oval Office?\n\n\nOn Nov. 5, CN…",
    "link": "https://www.dailydot.com/viral-politics/trump-oval-office-sign-reactions/",
    "timestamp": "2025-11-06T18:00:00Z"
  },
  {
    "title": "U.S. Ambassador Warns That British Energy Costs Are Too High",
    "description": "The US ambassador to the UK has warned Britain’s sky-high energy prices threaten to undermine its status as a major global economy. Speaking at an event at the Savoy Hotel on Wednesday, Warren Stephens described UK energy prices, which are among the highest i…",
    "link": "https://oilprice.com/Energy/Energy-General/US-Ambassador-Warns-That-British-Energy-Costs-Are-Too-High.html",
    "timestamp": "2025-11-06T18:00:00Z"
  },
  {
    "title": "Trump Announces $250 Weight Loss Drugs In Latest ‘TrumpRx’ Deal",
    "description": "President Donald Trump unveiled steep discounts on GLP-1 weight loss drugs in deals with pharmaceutical giants Eli Lilly and Novo Nordisk.",
    "link": "https://dailycaller.com/2025/11/06/trump-announces-discounted-weight-loss-drugs/",
    "timestamp": "2025-11-06T17:59:38Z"
  },
  {
    "title": "Mamdani's Victory Has Shunned Right-Wing Movements In US: Experts",
    "description": "Establishing a strong footing for the Democrats, Zohran Mamdani's victory in the recently-concluded New York City mayoral election is an answer to the right-wing movements in the country, said two former Indian diplomats. They added that this turnaround has r…",
    "link": "https://www.ndtvprofit.com/world/mamdanis-victory-has-shunned-right-wing-movements-in-us-experts",
    "timestamp": "2025-11-06T17:58:33Z"
  },
  {
    "title": "'He's paranoid': Psychiatrist warns Trump could become 'more tyrannical' as health worsens - NewsBreak",
    "description": "A forensic and social psychiatrist said on Wednesday that President Donald Trump is likely to become \"more tyrannical\" as his health declines. Dr. Bandy X.",
    "link": "https://www.newsbreak.com/share/4334548391184-he-s-paranoid-psychiatrist-warns-trump-could-become-more-tyrannical-as-health-worsens?_f=app_share&amp;pd=0LZapAtY&amp;lang=en_US&amp;send_time=1762451813&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.44.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-06T17:58:22Z"
  },
  {
    "title": "Pharma Exec Passes Out In Oval Office As Dr. Oz Rushes To His Aid",
    "description": "Dr. Mehmet Oz rushed to the aid of Novo Nordisk executive Gordon Findlay as he passed out inside the Oval Office on Thursday.",
    "link": "https://dailycaller.com/2025/11/06/pharma-exec-passes-out-in-oval-office-as-dr-oz-rushes-to-his-aid/",
    "timestamp": "2025-11-06T17:58:11Z"
  },
  {
    "title": "TrumpRX.com Crashes Within Minutes of Trump Telling Staff to Make Sure It Works",
    "description": "TrumpRx.com is currently unavailable minutes after President Donald Trump announced it as a portal for newly discounted weight loss drugs Wegovy and Zepbound.\nThe post TrumpRX.com Crashes Within Minutes of Trump Telling Staff to Make Sure It Works first appea…",
    "link": "https://www.mediaite.com/politics/trump/trumprx-com-crashes-within-minutes-of-trump-telling-staff-to-make-sure-it-works/",
    "timestamp": "2025-11-06T17:57:03Z"
  },
  {
    "title": "Dems Say Trump Is Taking Credit For Something They Passed Without GOP Support",
    "description": "Trump took credit for a Biden-era program Thursday, while saying Biden couldn't have done it.",
    "link": "https://www.huffpost.com/entry/trump-drug-prices-medicare-democrats_n_690cd13ee4b0799004d39e3e",
    "timestamp": "2025-11-06T17:56:38Z"
  },
  {
    "title": "Get Ready To Be Baffled By GOP Lawmaker's Spin On Democrats’ Election Gains",
    "description": "Jake Tapper appeared to question her reasoning in an odd moment on CNN.",
    "link": "https://www.huffpost.com/entry/lisa-mcclain-republicans-happy-with-whats-happening-jake-tapper-cnn_n_690cbe02e4b027afb3224f8e",
    "timestamp": "2025-11-06T17:55:52Z"
  },
  {
    "title": "Announced: New ways to show anti-ICE rioters who is in charge",
    "description": "'We will not tolerate violence perpetuated by Antifa and other domestic extremists who are targeting federal property and law enforcement'",
    "link": "https://www.wnd.com/2025/11/announced-new-ways-show-anti-ice-rioters-who/",
    "timestamp": "2025-11-06T17:55:50Z"
  },
  {
    "title": "DC National Guard deployment in the nation’s capital ordered by Trump is extended to Feb. 28",
    "description": "Hundreds of guard members remain in the city.",
    "link": "https://www.bostonherald.com/2025/11/06/dc-federal-enforcement-national-guard-extended/",
    "timestamp": "2025-11-06T17:55:18Z"
  },
  {
    "title": "Trump Reaches Deal With Eli Lilly, Novo Nordisk to Lower Weight Loss Drug Prices",
    "description": "The deal lowers the cost of Wegovy from $1,350 a month to $250 a month. Zepbound will reduce from $1,08 a month to $346.\nThe post Trump Reaches Deal With Eli Lilly, Novo Nordisk to Lower Weight Loss Drug Prices first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-reaches-deal-with-eli-lilly-novo-nordisk-to-lower-weight-loss-drug-prices/",
    "timestamp": "2025-11-06T17:55:16Z"
  },
  {
    "title": "The fate of Trump tariffs and US trade agreements, including with India, hangs in balance",
    "description": "Supreme Court justices scrutinised Donald Trump's tariffs. Concerns arose over presidential power to impose tariffs, traditionally a congressional prerogative. Justices highlighted constitutional issues regarding the taxing authority. A ruling against the tar…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/the-fate-of-trump-tariffs-and-us-trade-agreements-including-with-india-hangs-in-balance/articleshow/125140561.cms",
    "timestamp": "2025-11-06T17:54:53Z"
  },
  {
    "title": "Trump Issues Jubilant Response Minutes After Pelosi Retirement Announcement",
    "description": "President Donald Trump celebrated the Thursday announcement by former House Speaker Nancy Pelosi that she will be retiring from Congress.",
    "link": "https://www.westernjournal.com/trump-issues-jubilant-response-minutes-pelosi-retirement-announcement/",
    "timestamp": "2025-11-06T17:54:53Z"
  },
  {
    "title": "Trump unveils deal to expand coverage and lower costs on obesity drugs",
    "description": "WASHINGTON (AP) -- President Donald Trump unveiled a deal Thursday with drugmakers Eli Lilly and Novo Nordisk to expand coverage and reduce prices for the popular obesity treatments Zepbound and Wegovy.",
    "link": "https://www.wral.com/story/trump-unveils-deal-to-expand-coverage-and-lower-costs-on-obesity-drugs/22235331/",
    "timestamp": "2025-11-06T17:54:45Z"
  },
  {
    "title": "Michelle Obama Tears Apart Trump’s “Renovation” of the White House",
    "description": "At a Brooklyn event for her new book, The Look, the former first lady talked fashion, life after the White House, and how she really feels about that incoming ballroom: “When we talk about the East Wing, it is the heart of the work. And to denigrate it, to te…",
    "link": "https://www.vanityfair.com/style/story/michelle-obama-book-trump-white-house-renovation",
    "timestamp": "2025-11-06T17:53:25Z"
  },
  {
    "title": "Report: Nigeria Threatening to Arrest Victims of Jihad if They Denounce Terrorism",
    "description": "Nigeria's Premium Times newspaper reported on Thursday, in the context of the federal government claiming to release over 500 hostages from \"bandit\" captivity, that the government has threatened locals plagued by jihadist violence with arrest if they speak pu…",
    "link": "https://www.breitbart.com/africa/2025/11/06/report-nigeria-threatening-to-arrest-victims-of-jihad-if-they-denounce-terrorism/",
    "timestamp": "2025-11-06T17:52:14Z"
  },
  {
    "title": "BREAKING: Health Emergency Interrupts Drug Price Announcement in Oval Office",
    "description": "A Thursday Oval Office event, where President Donald Trump announced price reductions for weight-loss drugs, was interrupted by a health emergency. One of the attendees, Novo Nordisk executive Gordon Findlay, appeared to faint live on air during the event.",
    "link": "https://freerepublic.com/focus/f-news/4351077/posts",
    "timestamp": "2025-11-06T17:52:11Z"
  },
  {
    "title": "Trump Dismisses Voters’ Concerns About The Economy After Tuesday’s GOP Rout",
    "description": "Trump insisted Thursday “the Democrats ‘affordability’ issue is DEAD!”",
    "link": "https://www.forbes.com/sites/saradorn/2025/11/06/trump-dismisses-voters-concerns-about-the-economy-after-tuesdays-gop-rout/",
    "timestamp": "2025-11-06T17:51:21Z"
  },
  {
    "title": "Joy Behar Slams President Trump On ‘The View’ For Celebrating Nancy Pelosi’s Retirement: “It Just Shows How Threatened He Was By Her”",
    "description": "\"She was really Trump's chief tormentor and I give her credit for that,\" Behar said.",
    "link": "https://decider.com/2025/11/06/joy-behar-president-trump-view-celebrating-nancy-pelosis-retirement/",
    "timestamp": "2025-11-06T17:50:51Z"
  },
  {
    "title": "Trump announces deals with Eli Lilly, Novo Nordisk to slash weight loss drug prices, offer some Medicare coverage",
    "description": "President Donald Trump on Thursday announced deals with Eli Lilly and Novo Nordisk to slash the prices of some of their obesity drugs, including upcoming pills, in a landmark effort to expand access to the costly blockbuster treatments.\nThe agreements will cu…",
    "link": "https://biztoc.com/x/63c80aaebaa83154",
    "timestamp": "2025-11-06T17:50:42Z"
  },
  {
    "title": "Progressives Tell Dems Thinking of Capitulating to GOP on Shutdown: 'You Cave, You Lose'",
    "description": "As the Senate Democratic caucus met privately on Thursday to discuss the party's approach to the ongoing government shutdown following key electoral victories earlier this week, progressives sent a message to any centrists thinking of breaking ranks: \"You cav…",
    "link": "https://www.commondreams.org/news/moderate-democrats-shutdown",
    "timestamp": "2025-11-06T17:50:36Z"
  },
  {
    "title": "World must face 'moral failure' of missing 1.5C: UN chief to COP30",
    "description": "UN chief Antonio Guterres on Thursday said leaders must confront the \"moral failure and deadly negligence\" of missing the 1.5C climate target and urgently correct course at the COP30 summit.",
    "link": "https://phys.org/news/2025-11-world-moral-failure-15c-chief.html",
    "timestamp": "2025-11-06T17:50:04Z"
  },
  {
    "title": "People will ‘flee communism’ in NYC – Trump",
    "description": "US President Donald Trump has claimed New Yorkers will flee after self-described democratic socialist Zohran Mamdani was elected mayor Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627434-trump-communism-new-york-mayor/",
    "timestamp": "2025-11-06T17:49:37Z"
  },
  {
    "title": "Trump-voting contractor fumes as policies 'slow construction and drive up costs'",
    "description": "NPR reports President Donald Trump’s policies are clearing out whole sections of the U.S. construction industry and upsetting the Trump voters who work it.Maryland-based plumbing and heating contractor Kenny Mallick says he voted for Trump and agrees with the…",
    "link": "https://www.rawstory.com/trump-voting-contractor-fumes-as-policies-slow-construction-and-drive-up-costs/",
    "timestamp": "2025-11-06T17:48:00Z"
  },
  {
    "title": "Trump on Mamdani’s threats: They put incoming NYC mayor ‘off to a bad start’",
    "description": "'For a thousand years, communism has not worked. Communism, or the concept of communism, has not worked. I tend to doubt it’s going to work this time'",
    "link": "https://www.wnd.com/2025/11/trump-mamdanis-threats-they-put-incoming-nyc-mayor/",
    "timestamp": "2025-11-06T17:46:17Z"
  },
  {
    "title": "President Trump unveils deal to expand coverage, lower costs on GLP-1 obesity drugs like Wegovy",
    "description": "President Donald Trump unveiled a deal Thursday with drugmakers Eli Lilly and Novo Nordisk to expand coverage and reduce prices for their popular obesity treatments Zepbound and Wegovy.",
    "link": "https://www.news4jax.com/news/local/2025/11/06/live-president-donald-trump-makes-announcement-from-the-oval-office/",
    "timestamp": "2025-11-06T17:44:47Z"
  }
]