[
  {
    "title": "California Gov. Newsom plans to sue Trump over National Guard deployment to LA protests",
    "description": "California Gov. Gavin Newsom said Monday that he will sue President Donald Trump for his deployment of the National Guard to deal with protests over federal immigration enforcement actions in Los Angeles.\nTrump \"flamed the fires and illegally acted to federal…",
    "link": "https://biztoc.com/x/aab692b288bbe997",
    "timestamp": "2025-06-09T16:57:12Z"
  },
  {
    "title": "1,800+ 'No Kings' Rallies Planned Across US as Trump Deploys Military to Crush Protests",
    "description": "U.S. President Donald Trump on Saturday ordered the deployment of National Guard troops to quell anti-U.S. Immigration and Customs Enforcement protests in Los Angeles, prompting a response from the coalition behind upcoming nationwide protests planned to coun…",
    "link": "https://www.commondreams.org/news/no-kings-trump-national-guard-los-angeles",
    "timestamp": "2025-06-09T16:56:56Z"
  },
  {
    "title": "'Unacceptable and inhumane': Latinas for Trump founder blasts immigration arrests",
    "description": "Ileana Garcia, who co-founded Latinas for Trump, criticized Donald Trump’s recent immigration enforcement actions as “unacceptable and inhumane.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/09/latinas-for-trump-immigration-arrests/84115411007/",
    "timestamp": "2025-06-09T16:56:43Z"
  },
  {
    "title": "Bannon Calls for a Special Counsel Investigation Into Elon Musk’s Drug Use and Federal Contracts",
    "description": "Bannon has long been a critic of Musk, even going so far as calling him a \"parasitic illegal immigrant” in the past. \nThe post Bannon Calls for a Special Counsel Investigation Into Elon Musk’s Drug Use and Federal Contracts first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/bannon-calls-for-a-special-counsel-investigation-into-elon-musks-drug-use-and-federal-contracts/",
    "timestamp": "2025-06-09T16:56:38Z"
  },
  {
    "title": "‘The View’s Sunny Hostin Warns Of “Fascism” And “Civil War” After Trump Deploys National Guard To Stop Immigration Protests: “It’s Not A Crime To Be Undocumented!”",
    "description": "\"It is a civil infraction, not a criminal.\"",
    "link": "https://decider.com/2025/06/09/the-view-sunny-hostin-warns-fascism-civil-war-trump-deploys-national-guard-stop-immigration-protests/",
    "timestamp": "2025-06-09T16:56:23Z"
  },
  {
    "title": "LA Could Face Losing Millions for Police Using Nonlethal Bullets",
    "description": "If people sue the City of Los Angeles over the LAPD's alleged use of rubber bullets, previous cases indicate it could lose millions.",
    "link": "https://www.newsweek.com/los-angeles-protests-riots-police-rubber-bullets-2082805",
    "timestamp": "2025-06-09T16:55:16Z"
  },
  {
    "title": "Los Angeles Anti-Deportation Protests Are Getting More Violent",
    "description": "Anti-deportation protests in Los Angeles are getting more violent as tensions escalate. President Donald Trump deployed ...",
    "link": "https://biztoc.com/x/392ea98c29a1ec7b",
    "timestamp": "2025-06-09T16:54:59Z"
  },
  {
    "title": "Elon Musk's father says his son and Donald Trump will patch things up after dramatic falling out",
    "description": "Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon.",
    "link": "https://news.sky.com/story/elon-musks-father-says-his-son-and-donald-trump-will-patch-things-up-after-dramatic-falling-out-13381348",
    "timestamp": "2025-06-09T16:53:00Z"
  },
  {
    "title": "The Trash Report: GIRLS (Trump and Elon), GIRLS (J. Lo and Cynthia), GIRLS (Oregonians)!!!",
    "description": "Get your bowls, it's time for a steaming ladle of hot, gossipy garbage.\n \n by Elinor Jones\n \n \n \n Hi babies, and welcome back to the Trash Report! This is the last week of school for families in the area, which means the days of \"I can't wait 'til summer\" wil…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/06/09/47830467/the-trash-report-girls-trump-and-elon-girls-j-lo-and-cynthia-girls-oregonians",
    "timestamp": "2025-06-09T16:53:00Z"
  },
  {
    "title": "Bitcoin, Solana Rise as U.S. and China Agree to Trade Talks Ahead of Key Bond Auction",
    "description": "A poorly received 20-year bond auction caused Bitcoin’s price to suddenly drop last month.",
    "link": "https://decrypt.co/324214/bitcoin-solana-rise-u-s-and-china-agree-talk-trade-ahead-key-bond-auction",
    "timestamp": "2025-06-09T16:51:33Z"
  },
  {
    "title": "California Gov. Newsom plans to sue Trump over National Guard deployment to LA protests",
    "description": "Trump is \"unhinged right now,\" Gov. Gavin Newsom said, accusing the president of making the situation in LA worse by federalizing National Guard troops.",
    "link": "https://www.cnbc.com/2025/06/09/trump-sued-national-guard-la-california-newsom.html",
    "timestamp": "2025-06-09T16:51:00Z"
  },
  {
    "title": "Cable Cut: CNN's Parent Company To Spin Off Struggling Network",
    "description": "CNN parent company Warner Bros. Discovery announced Monday that it will split into two publicly traded companies, cutting CNN off from the more profitable streaming business as the left-leaning network grapples with plummeting ratings.\nThe post Cable Cut: CNN…",
    "link": "https://freebeacon.com/latest-news/cable-cut-cnns-parent-company-to-spin-off-struggling-network/",
    "timestamp": "2025-06-09T16:50:39Z"
  },
  {
    "title": "US State Department orders embassies to resume processing Harvard student visas | CNN Politics",
    "description": "The US State Department ordered diplomatic posts around the world to “resume processing” of Harvard University student and exchange visitor visas on Friday after a judge halted President Donald Trump’s latest attempt to block international students from comin…",
    "link": "https://www.cnn.com/2025/06/09/politics/harvard-student-visas-resume-processing",
    "timestamp": "2025-06-09T16:50:23Z"
  },
  {
    "title": "FINNEAS Tear-Gassed at ICE Protest in Los Angeles",
    "description": "FINNEAS has become one of the most in-demand pop producers of our time, having produced all of his sister Billie Eilish's hits among others",
    "link": "https://exclaim.ca/music/article/finneas-tear-gassed-at-ice-protest-in-los-angeles",
    "timestamp": "2025-06-09T16:49:31Z"
  },
  {
    "title": "Eric Church Defends Bruce Springsteen’s Anti-Trump Speeches: “He’s Earned the Right to Say and Do What He Wants”",
    "description": "The country singer-songwriter supported The Boss’ right to free speech and to criticize Trump: “I respect the hell out of somebody having the balls to do something like that.”\nEric Church Defends Bruce Springsteen’s Anti-Trump Speeches: “He’s Earned the Right…",
    "link": "https://consequence.net/2025/06/eric-church-defends-bruce-springsteen/",
    "timestamp": "2025-06-09T16:49:03Z"
  },
  {
    "title": "TRUMP EFFECT: Higher Pay for American Workers",
    "description": "“President Trump’s America First Economic Agenda has created a BOOMING economy — jobs are up, unemployment is down, wages are increasing, and inflation is dead. More than 139,000 good jobs were added to the private sector in May, all accounted for by American…",
    "link": "https://freerepublic.com/focus/f-news/4321918/posts",
    "timestamp": "2025-06-09T16:48:29Z"
  },
  {
    "title": "Trump admin live updates: Trump to announce savings accounts for parents, guardians",
    "description": "Trump will host a roundtable on Monday to announce the provision in his funding bill called the \"Trump savings accounts.\"",
    "link": "https://abcnews.go.com/Politics/live-updates/trump-admin-updates-live/?id=122650591",
    "timestamp": "2025-06-09T16:48:02Z"
  },
  {
    "title": "Hurricane Barbara forms in Eastern Pacific becoming first of 2025 season. Will US coastline be impacted?",
    "description": "The first hurricane of 2025 has formed in the Pacific off Mexico’s west coast, with a second storm expected to reach minimal hurricane strength later today. The National Hurricane Center is currently tracking Hurricane Barbara and Tropical Storm Cosme. Both s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/hurricane-barbara-forms-in-eastern-pacific-becoming-first-of-2025-season-will-us-coastline-be-impacted/articleshow/121733832.cms",
    "timestamp": "2025-06-09T16:47:55Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "By JOEY CAPPELLETTI\nWASHINGTON (AP) — As President Donald Trump builds a crypto empire — including hosting a private dinner with top investors at his golf club — Democrats have united in condemning what they call blatant corruption from the White House.\nRelat…",
    "link": "https://biztoc.com/x/fb8fe6b7001de903",
    "timestamp": "2025-06-09T16:46:25Z"
  },
  {
    "title": "Dave Portnoy Says He Could Still Vote Democrat",
    "description": "Barstool Sports founder Dave Portnoy, a high-profile voice in the “manosphere,” spoke to NPR’s Morning Edition about his political leanings, media backlash, and his vote for Donald Trump. \nPortnoy said his support for Trump was “more an indictment of the Demo…",
    "link": "https://biztoc.com/x/8cee410dfbe22ed9",
    "timestamp": "2025-06-09T16:46:13Z"
  },
  {
    "title": "Nato needs quantum leap in defence, chief says",
    "description": "In a speech, Mark Rutte warns Russia could be ready to attack Nato within five years.",
    "link": "https://www.bbc.com/news/articles/cj3j637015jo",
    "timestamp": "2025-06-09T16:45:36Z"
  },
  {
    "title": "Lil Wayne Fleetingly Reminds Us Why He’s One of the Best",
    "description": "The legendary rapper sounds contented on 'Tha Carter VI,' even as he struggles to revive past glories",
    "link": "http://www.rollingstone.com/music/music-album-reviews/lil-wayne-tha-carter-vi-review-1235359341/",
    "timestamp": "2025-06-09T16:45:28Z"
  },
  {
    "title": "NATO chief calls for ‘quantum leap’ in defense and says Russia could attack in 5 years",
    "description": "At the moment, 22 of the 32 members meet or exceed NATO’s current 2% target.",
    "link": "https://www.bostonherald.com/2025/06/09/eu-nato-britain/",
    "timestamp": "2025-06-09T16:43:59Z"
  },
  {
    "title": "California Is Suing Trump for Sending National Guard Into L.A.",
    "description": "California Governor Gavin Newsom will sue President Donald Trump over his federalization of National Guard troops in response to Los Angeles protests.",
    "link": "http://www.rollingstone.com/politics/politics-news/newsom-california-suing-trump-national-guard-la-1235359375/",
    "timestamp": "2025-06-09T16:43:42Z"
  },
  {
    "title": "Roseanne Barr blames voting machines and China in unhinged  LA protests rant",
    "description": "Right-wing actress Roseanne Barr suggested that voting machines and the Chinese Communist Party (CCP) led to recent protests against ICE in California.During an interview on Monday, MAGA host Steve Bannon asked Barr to explain the weekend's demonstrations nea…",
    "link": "https://www.rawstory.com/roseanne-barr-protests/",
    "timestamp": "2025-06-09T16:42:26Z"
  },
  {
    "title": "Trump’s use of the national guard against LA protesters defies all precedents",
    "description": "Presidents have used the national guard before, but only to protect civil rights, not to deny the right to protest.",
    "link": "https://theconversation.com/trumps-use-of-the-national-guard-against-la-protesters-defies-all-precedents-258486",
    "timestamp": "2025-06-09T16:41:11Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "Big money and campaign donations flowing from cryptocurrency firms make them a political powerhouse.",
    "link": "https://www.twincities.com/2025/06/09/democrats-crypto/",
    "timestamp": "2025-06-09T16:39:37Z"
  },
  {
    "title": "California City Tears Up ICE Partnership As Riots Consume Los Angeles",
    "description": "Amid widespread riots in Los Angeles against ICE, Glendale, a California suburb, announced it's scrapping a years-long detention agreement with the agency.",
    "link": "https://dailycaller.com/2025/06/09/california-city-ice-agreement-riots/",
    "timestamp": "2025-06-09T16:39:22Z"
  },
  {
    "title": "Whoopi Goldberg Says With Straight Face It Is ‘Pure Fascism’ For Trump To Deport Illegal Immigrants",
    "description": "\"The View\" co-host Whoopi Goldberg said on Monday that it is \"pure fascism\" for President Donald Trump's administration to arrest and deport illegal immigrants.",
    "link": "https://dailycaller.com/2025/06/09/whoopi-goldberg-fascism-trump-deportations/",
    "timestamp": "2025-06-09T16:39:06Z"
  },
  {
    "title": "Nintendo Boss Says Switch 2 Should Be Available This Holiday In The US, But Tariff Threat Looms",
    "description": "Nintendo of America boss Doug Bowser has spoken up to assure people that the Switch 2 should be in stock through the holiday. Appearing on CBS Mornings, Bowser said Nintendo has a \"steady supply of manufacturing\" for the Switch 2 that should continue to make …",
    "link": "https://www.gamespot.com/articles/nintendo-boss-says-switch-2-should-be-available-this-holiday-in-the-us-but-tariff-threat-looms/1100-6532284/",
    "timestamp": "2025-06-09T16:38:00Z"
  },
  {
    "title": "Latinas For Trump Co-Founder Rips Trump Immigration Policies As ‘Unacceptable And Inhumane’",
    "description": "“This is not what we voted for,\" said Florida state Sen. Ileana Garcia (R), while accusing Trump of undermining “the sense of fairness and justice.”",
    "link": "https://www.huffpost.com/entry/ileana-garcia-condemns-trump-immigration-policies_n_6846ea24e4b0ee4cf20cef74",
    "timestamp": "2025-06-09T16:37:42Z"
  },
  {
    "title": "White House Bullies ABC Into Suspending Journo Who Hurt Sweet Stephen Miller's Feelings",
    "description": "Terry Moran is of course correct that Stephen Miller is a hateful sack of bile.",
    "link": "https://www.wonkette.com/p/white-house-bullies-abc-into-suspending",
    "timestamp": "2025-06-09T16:37:15Z"
  },
  {
    "title": "China has a valuable card to play as it holds trade talks with the US today",
    "description": "A new round of trade negotiations between the United States and China has started in London, with both sides trying to preserve a fragile truce brokered last month. The fresh talks were announced last week after a long-anticipated phone call between US Presid…",
    "link": "https://freerepublic.com/focus/f-news/4321914/posts",
    "timestamp": "2025-06-09T16:37:02Z"
  },
  {
    "title": "Conference bosses bullish on NIL enforcement",
    "description": "College conference commissioners are bullish in their ability to enforce NIL rules in a new system days after a multibillion-dollar legal settlement changed college athletics by allowing schools to directly pay their athlete.",
    "link": "https://www.espn.com/college-sports/story/_/id/45479869/conference-commissioners-bullish-enforcing-new-nil-rules",
    "timestamp": "2025-06-09T16:36:50Z"
  },
  {
    "title": "Phony Stark & Taco Trump’s Fallout Continues, Epstein Tweets Wiped",
    "description": "Last week, Elon Musk and Donald Trump had social media in a frenzy as their bromance very publicly (and expectedly) fell apart. Both men took swipes at one another, culminating with Elon Musk tweeting that the real reason the Epstein files were never released…",
    "link": "https://hiphopwired.com/2733982/elon-musk-donald-trump-social-media-fallout-continued-over-the-weekend/",
    "timestamp": "2025-06-09T16:36:39Z"
  },
  {
    "title": "Sheinbaum Vows to Protect Rights of Mexicans Detained in LA",
    "description": "Mexico’s President Claudia Sheinbaum condemned what she described as human rights violations during the detention of Mexican migrants in anti-deportation protests in Los Angeles, adding that her government has activated all available consular mechanisms to he…",
    "link": "https://financialpost.com/pmn/business-pmn/sheinbaum-vows-to-protect-rights-of-mexicans-detained-in-la",
    "timestamp": "2025-06-09T16:35:29Z"
  },
  {
    "title": "‘Wasted No Time Doing the Worst’: Charlamagne Slams Trump’s National Guard Deployment",
    "description": "Charlamagne tha God on Monday called out President Donald Trump for his decision to deploy the National Guard to respond to the protests in Los Angeles.\nThe post ‘Wasted No Time Doing the Worst’: Charlamagne Slams Trump’s National Guard Deployment first appea…",
    "link": "https://www.mediaite.com/media/news/wasted-no-time-doing-the-worst-charlamagne-slams-trumps-national-guard-deployment/",
    "timestamp": "2025-06-09T16:35:24Z"
  },
  {
    "title": "When Donald Trump calls, one Big Law firm answers",
    "description": "Getty Images; Jenny Chang-Rodriguez/BI\nRobert Giuffra, the head of Sullivan & Cromwell, recently began representing Donald Trump. \nGiuffra's role in the Trump administration's deal with another Big Law firm blurred the lines between personal and government bu…",
    "link": "https://biztoc.com/x/2b2ce8bf6584d09a",
    "timestamp": "2025-06-09T16:35:16Z"
  },
  {
    "title": "Tesla 'Remains The Most Undervalued AI Play': Dan Ives",
    "description": "The public feud between President Donald Trump and Tesla, Inc. (NASDAQ:TSLA) CEO Elon Musk has eased for now, but the tension has weighed on Tesla's stock. However, Wedbush analyst Dan Ives remains bullish on Tesla ahead of Thursday's robotaxi launch in Austi…",
    "link": "https://biztoc.com/x/fab8c54c99933ee9",
    "timestamp": "2025-06-09T16:35:16Z"
  },
  {
    "title": "Did Elon Musk really brawl with gay lawmaker Scott Bessent? Here’s what the White House has said",
    "description": "The White House has responded to claims of a physical altercation where former special advisor to Donald Trump Elon Musk is said to have “bodychecked” gay Treasury secretary Scott Bessent.  Right-wing podcaster and former chief strategist for Donald Trump, St…",
    "link": "https://www.thepinknews.com/2025/06/09/elon-musk-punch-scott-bessent-white-house/",
    "timestamp": "2025-06-09T16:33:49Z"
  },
  {
    "title": "CEO recession expectations decline from April scare, survey says",
    "description": "The latest poll showed less than 30% of CEOs expected some sort of recession or slowdown over the next six months.",
    "link": "https://www.cnbc.com/2025/06/09/ceo-recession-expectations-decline-from-april-scare-survey-says.html",
    "timestamp": "2025-06-09T16:33:37Z"
  },
  {
    "title": "Ukraine’s Drone Attack Doesn’t Matter",
    "description": "Unfortunately, the spectacular operation doesn’t change underlying realities.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraine-drone-attack-spiders-web-doesnt-matter/",
    "timestamp": "2025-06-09T16:33:21Z"
  },
  {
    "title": "Ukraine’s Drone Attack Doesn’t Matter",
    "description": "Unfortunately, the spectacular operation doesn’t change underlying realities.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraine-war-drone-attack-spiderweb-russia-air-bases/",
    "timestamp": "2025-06-09T16:33:21Z"
  },
  {
    "title": "Rare-Earth Negotiation Takes Front Seat in London U.S.-China Talks",
    "description": "Commerce Secretary Howard Lutnick, Treasury Secretary Scott Bessent, and Trade Representative Jamieson Greer met with high-level Chinese officials in London on Monday to seek a resolution to the trade dispute between the world’s two largest economies.\nThe pos…",
    "link": "https://www.breitbart.com/economy/2025/06/09/rare-earth-negotiation-takes-front-seat-in-london-u-s-china-talks/",
    "timestamp": "2025-06-09T16:32:10Z"
  },
  {
    "title": "Analysts Diverge on Tesla's Road Ahead Post-Feud",
    "description": "Price targets range from $275 to $410 as TSLA down 27% YTD",
    "link": "https://finance.yahoo.com/news/analysts-diverge-teslas-road-ahead-163125844.html",
    "timestamp": "2025-06-09T16:31:25Z"
  },
  {
    "title": "America’s Nuclear ‘Renaissance’ Reportedly Inches Closer Under Trump",
    "description": "Westinghouse is reportedly in discussions with government officials regarding the deployment of ten nuclear reactors.",
    "link": "https://dailycaller.com/2025/06/09/americas-nuclear-renaissance-reportedly-inches-closer/",
    "timestamp": "2025-06-09T16:31:09Z"
  },
  {
    "title": "Pfizer and other drug companies make 'no commitments' to the White House on lower drug prices",
    "description": "Pfizer's CEO says nothing concrete has happened in the 30 days since Trump's executive order",
    "link": "https://not-qz.com/pfizer-ceo-drug-prices-trump-executive-order-1851784085",
    "timestamp": "2025-06-09T16:30:12Z"
  },
  {
    "title": "'Lies': Trump slammed for trading 'nonsense' to cover own admin's failure",
    "description": "USA Today columnist Rex Huppke took on what he called Donald Trump's \"lies\" that the Los Angeles protests over ICE raids constituted an \"insurrection\" that needed to be put down by the federalized National Guard.\"Donald Trump, the president who glibly pardone…",
    "link": "https://www.rawstory.com/trump-los-angeles-2672335319/",
    "timestamp": "2025-06-09T16:30:02Z"
  },
  {
    "title": "Dem Sen. Padilla: Trump Administration Has an ‘Obsession of Being Cruel and Aggressive’",
    "description": "Senator Alex Padilla (D-CA) said Monday on MSNBC’s “Morning Joe” that President Donald Trump’s administration has an “obsession of being cruel and aggressive.” Padilla said, “This administration has been anything but forthcoming and transparent with informati…",
    "link": "https://freerepublic.com/focus/f-news/4321913/posts",
    "timestamp": "2025-06-09T16:29:48Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "Big money and campaign donations flowing from cryptocurrency firms make them a political powerhouse.",
    "link": "https://www.bostonherald.com/2025/06/09/democrats-crypto/",
    "timestamp": "2025-06-09T16:29:32Z"
  },
  {
    "title": "Los Angeles police order immigration protesters in downtown to go home",
    "description": "LOS ANGELES: Los Angeles braced for another day of unrest on Monday (Jun 9) over President Donald Trump's immigration policies, after police declared the city's downtown an unlawful assembly area a",
    "link": "https://www.channelnewsasia.com/world/los-angeles-police-order-immigration-protesters-downtown-go-home-5171296",
    "timestamp": "2025-06-09T16:29:21Z"
  },
  {
    "title": "US and China are holding trade talks in London after Trump’s phone call with Xi",
    "description": "The talks are due to last at least a day.",
    "link": "https://www.bostonherald.com/2025/06/09/us-china-trade-talks/",
    "timestamp": "2025-06-09T16:29:19Z"
  },
  {
    "title": "Trump backs arrest of California governor suing over Guard deployment to LA protests",
    "description": "LOS ANGELES: President Donald Trump said on Monday (Jun 9) he would support the arrest of California's Gavin Newsom, in a dramatic escalation of a growing conflict with the Democratic governor over imm",
    "link": "https://www.channelnewsasia.com/world/trump-backs-arrest-california-governor-suing-over-guard-deployment-la-protests-5171296",
    "timestamp": "2025-06-09T16:29:00Z"
  },
  {
    "title": "The ‘Golden Dome’ Is Pure Fantasy",
    "description": "Reprinted with permission from EricMargolis.com. Mutzig, France – First stop on my annual visit to France’s mighty Maginot Line forts is this lovely Alsatian town. Mutzig was built by the Germans 1893-1916 to defend against enemy approaches to the important c…",
    "link": "https://www.antiwar.com/blog/2025/06/09/the-golden-dome-is-pure-fantasy/",
    "timestamp": "2025-06-09T16:28:10Z"
  },
  {
    "title": "Harris ripped for 'appalling' LA ICE raids statement placing blame on Trump: 'The country dodged a bullet'",
    "description": "Former Vice President Kamala Harris was widely mocked on social media over her official statement on the riots that have broken out in Los Angeles in response to ICE raids.",
    "link": "https://www.foxnews.com/politics/harris-ripped-appalling-la-ice-raids-statement-placing-blame-trump-the-country-dodged-bullet",
    "timestamp": "2025-06-09T16:27:18Z"
  },
  {
    "title": "When Donald Trump calls, one Big Law firm answers",
    "description": "As President Trump waged war on Big Law, the head of Sullivan & Cromwell played double duty as his personal lawyer and a White House go-between.",
    "link": "https://www.businessinsider.com/sullivan-cromwell-trump-big-law-robert-giuffra-2025-6",
    "timestamp": "2025-06-09T16:26:03Z"
  },
  {
    "title": "Trump Orders 2000 National Guard Troops To California To Shut Down Anti-ICE Protests",
    "description": "As ICE continues to engage in a mass deportation program that more closely resembles a mass kidnapping program, communities have literally taken to the streets to chase ICE and their law enforcement enablers out of town. Rolling in looking like some sort of c…",
    "link": "https://www.techdirt.com/2025/06/09/trump-orders-2000-national-guard-troops-to-california-to-shut-down-anti-ice-protests/",
    "timestamp": "2025-06-09T16:25:00Z"
  },
  {
    "title": "Celebrities React to LA Riots",
    "description": "\"The Real Housewives of Beverly Hills\" star Lisa Rinna issued a warning to protestors.",
    "link": "https://www.newsweek.com/la-riots-protests-celebrities-react-2082836",
    "timestamp": "2025-06-09T16:24:34Z"
  },
  {
    "title": "Anti-ICE Protesters Clash With Police in LA",
    "description": "Tensions flared in Los Angeles on the third day of anti-deportation protests, as demonstrators clashed with law enforcement while President Donald Trump and California Governor Gavin Newsom exchanged blame over the unrest and responsibility for restoring orde…",
    "link": "https://biztoc.com/x/42ccadddf26dfbc0",
    "timestamp": "2025-06-09T16:24:15Z"
  },
  {
    "title": "Anti-ICE Protesters Clash With Police in LA",
    "description": "Tensions flared in Los Angeles on the third day of anti-deportation protests, as demonstrators clashed with law enforcement while President Donald Trump and California Governor Gavin Newsom exchanged blame over the unrest and responsibility for restoring orde…",
    "link": "https://biztoc.com/x/42ccadddf26dfbc0",
    "timestamp": "2025-06-09T16:24:15Z"
  },
  {
    "title": "'California is not a trivial target'",
    "description": "'Donald Trump vs. California (and everywhere else)'\nPhilip Bump at The Washington Post\nLos Angeles hasn't \"suddenly turned into a metropolis riddled with criminal immigrants,\" says Philip Bump. The \"president and his administration have been looking to Califo…",
    "link": "https://biztoc.com/x/cec2c9b08b5a9638",
    "timestamp": "2025-06-09T16:24:12Z"
  },
  {
    "title": "Trump lashes out at California leaders over LA protests",
    "description": "United States President Donald Trump criticized California Governor Gavin Newsom and Los Angeles Mayor Karen Bass on Monday, accusing them of incompetence in managing the recent wave of unrest. In a p...",
    "link": "https://biztoc.com/x/0b4a329c0c1e8634",
    "timestamp": "2025-06-09T16:24:10Z"
  },
  {
    "title": "California Governor Newsom Calls Trump 'Stone Cold Liar, Stoking Civil War'",
    "description": "California Governor Gavin Newsom unloaded on President Donald Trump Sunday amid violent protests in Los Angeles ... accusing the commander-in-chief of being a bald-faced liar and wanting to start a civil war over his immigration policies. Newsom…\n Permalink",
    "link": "https://www.tmz.com/2025/06/09/california-governor-gavin-newsom-calls-trump-liar-stoking-civil-war-los-angeles/",
    "timestamp": "2025-06-09T16:23:43Z"
  },
  {
    "title": "McDonald’s Keeps ‘Core’ Inclusion Programs Despite DEI Backlash",
    "description": "McDonald’s Corp. said it’s sticking to its most important inclusion initiatives, even as the Trump administration and conservative activists attack diversity, equity and inclusion practices. McDonald’s earlier this year retired “aspirational representation go…",
    "link": "https://www.insurancejournal.com/news/national/2025/06/09/826814.htm",
    "timestamp": "2025-06-09T16:22:59Z"
  },
  {
    "title": "Southern Baptists target porn, sports betting, same-sex marriage and ‘willful childlessness’",
    "description": "There is also a proposed ban on churches with women pastors.",
    "link": "https://www.bostonherald.com/2025/06/09/southern-baptist-convention/",
    "timestamp": "2025-06-09T16:22:29Z"
  },
  {
    "title": "Waymo suspends robotaxi rides near LA protests after 5 cars are set ablaze",
    "description": "The company said it doesn't think the vehicles were intentionally targeted, but that it had paused rides in downtown LA.",
    "link": "https://www.businessinsider.com/waymo-suspends-robotaxi-rides-fire-la-protests-ice-2025-6",
    "timestamp": "2025-06-09T16:21:53Z"
  },
  {
    "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump’s trade war",
    "description": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump’s trade warocregister.com",
    "link": "https://www.ocregister.com/2025/06/09/apple-showcase/",
    "timestamp": "2025-06-09T16:21:43Z"
  },
  {
    "title": "Liberals, anti-Trump figures bash ABC for suspending Terry Moran over anti-Trump social media rant",
    "description": "Liberal commentators took aim at ABC News and defended correspondent Terry Moran after his suspension over blasting President Trump and Stephen Miller in a social media post.",
    "link": "https://www.foxnews.com/media/liberals-anti-trump-figures-bash-abc-suspending-terry-moran-over-anti-trump-social-media-rant",
    "timestamp": "2025-06-09T16:20:00Z"
  },
  {
    "title": "Uber, Goldman Sachs and Salesforce CEOs to boost ‘Trump Accounts’ for kids at White House event",
    "description": "An octet of corporate giants will hit the White House Monday to support President Trump's plan to give $1,000 to almost every child born during his second term.",
    "link": "https://nypost.com/2025/06/09/us-news/uber-goldman-sachs-and-salesforce-ceos-to-boost-trump-accounts-for-kids-at-white-house-event/",
    "timestamp": "2025-06-09T16:19:53Z"
  },
  {
    "title": "JONATHAN TURLEY: Democrats' rabid anti-ICE resistance in LA against Trump could backfire",
    "description": "Yes, Trump's authority to deploy National Guard faces opposition from Gov. Newsom amid violent anti-ICE protests. But Democrats could lose this battle badly.",
    "link": "https://www.foxnews.com/opinion/jonathan-turley-democrats-rabid-anti-ice-resistance-la-against-trump-could-backfire",
    "timestamp": "2025-06-09T16:18:36Z"
  },
  {
    "title": "NATO chief calls for 'quantum leap' in defence and says Russia could attack in 5 years",
    "description": "NATO Secretary-General Mark Rutte warned that Russia could be ready to attack the alliance within five years, urging members to increase air and missile defenses by 400%. He expects a significant hike in military spending to be agreed upon at the upcoming sum…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/nato-chief-calls-for-quantum-leap-in-defense-and-says-russia-could-attack-in-5-years/articleshow/121733316.cms",
    "timestamp": "2025-06-09T16:17:35Z"
  },
  {
    "title": "BNB Price Climbs in Strong Rebound as Trump-Musk Spat Uncertainty Fades",
    "description": "The rebound comes amid fading uncertainty surrounding a public feud between Donald Trump and Elon Musk, as well as improving fundamentals on the BNB Chain.",
    "link": "https://www.coindesk.com/markets/2025/06/09/bnb-price-climbs-in-strong-rebound-as-trump-musk-spat-uncertainty-fades",
    "timestamp": "2025-06-09T16:16:51Z"
  },
  {
    "title": "Finneas says he was tear-gassed at ICE protest in L.A.",
    "description": "Finneas says that he was 'tear-gassed almost immediately' upon attending a 'very peaceful' ICE protest in Los Angeles over the weekend: 'They're inciting this.'",
    "link": "https://ew.com/finneas-tear-gassed-almost-immediately-ice-protest-11750506",
    "timestamp": "2025-06-09T16:16:43Z"
  },
  {
    "title": "Canada to meet NATO spending threshold before schedule, Carney says",
    "description": "Prime Minister Mark Carney pledges to shift defence spending away from the US and towards the EU.",
    "link": "https://www.aljazeera.com/news/2025/6/9/canada-to-meet-nato-spending-threshold-before-schedule-carney-says",
    "timestamp": "2025-06-09T16:16:42Z"
  },
  {
    "title": "'California is not a trivial target'",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-california-ocean-journalism-macron",
    "timestamp": "2025-06-09T16:16:07Z"
  },
  {
    "title": "US stock market today: S&P 500 flat, Dow Jones down, Nasdaq‑100 up— biggest gainers, losers as Wall Street eyes US-China trade talks and potential tariff deal",
    "description": "US stock market live update shows the Dow Jones drops 185 points as investors keep a close eye on crucial US-China trade talks happening in London. Early trading saw the S&P 500 slip 0.1%, while the Nasdaq edged up 0.1%. Markets remain cautious but hopeful th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-sp-500-flat-dow-jones-down-nasdaq100-up-biggest-gainers-losers-as-wall-street-eyes-us-china-trade-talks-and-potential-tariff-deal/articleshow/121732211.cms",
    "timestamp": "2025-06-09T16:15:50Z"
  },
  {
    "title": "LA RIOTS, WAIT FOR THE ENDING -- IT'S MAGNIFICENT.",
    "description": "0:37 VIDEO AT LINK................. Stupid should hurt.......................",
    "link": "https://freerepublic.com/focus/f-chat/4321909/posts",
    "timestamp": "2025-06-09T16:13:50Z"
  },
  {
    "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump’s trade war",
    "description": "There are nagging questions about Apple's ability to innovate and navigate other challenges.",
    "link": "https://www.bostonherald.com/2025/06/09/apple-showcase/",
    "timestamp": "2025-06-09T16:13:35Z"
  },
  {
    "title": "'Trump Is Losing,' Putin's Top Propagandist Says",
    "description": "A Russian political talk show says Donald Trump has lost a big ally.",
    "link": "https://biztoc.com/x/1b5373e9af355b2c",
    "timestamp": "2025-06-09T16:13:17Z"
  },
  {
    "title": "DNC chair ripped David Hogg over party infighting in leaked meeting audio: 'Really frustrating'",
    "description": "Leaked audio captures DNC Chair Martin's frustration with Vice Chair Hogg as tensions rise over Hogg's $20 million plan to support progressives.",
    "link": "https://www.foxnews.com/politics/dnc-chair-ripped-david-hogg-over-party-infighting-leaked-meeting-audio-really-frustrating",
    "timestamp": "2025-06-09T16:12:05Z"
  },
  {
    "title": "Unsubstantiated ‘chemtrail’ conspiracy theories lead to legislation proposed in US statehouses",
    "description": "State legislatures are passing bills based on decades-old conspiracy theories.",
    "link": "https://www.bostonherald.com/2025/06/09/chemtrails-misinformation/",
    "timestamp": "2025-06-09T16:11:51Z"
  },
  {
    "title": "ABC suspends Moran over Stephen Miller post",
    "description": "Journalist Terry Moran was suspended after making a social media post that criticized the White House deputy chief of staff",
    "link": "https://theweek.com/politics/terry-moran-abc-news-stephen-miller",
    "timestamp": "2025-06-09T16:11:35Z"
  },
  {
    "title": "The Internet System Elon Musk Installed at the White House Is Causing Concerns",
    "description": "Elon Musk's lackeys at his so-called Department of Government Efficiency installed a Starlink terminal on the roof of the White House — and then totally blew off the major security concerns raised by communications experts, the Washington Post reports. This i…",
    "link": "https://futurism.com/internet-elon-musk-installed-white-house",
    "timestamp": "2025-06-09T16:10:50Z"
  },
  {
    "title": "'Trump Is Losing,' Putin's Top Propagandist Says",
    "description": "A Russian political talk show says Donald Trump has lost a big ally.",
    "link": "https://www.newsweek.com/trump-losing-says-top-putin-propagandist-2082939",
    "timestamp": "2025-06-09T16:07:58Z"
  },
  {
    "title": "Soros-Funded Group Unleashing Millions Into Texas To Turn State Blue",
    "description": "A George Soros-backed political action committee is launching a multimillion-dollar effort to flip Texas blue.",
    "link": "https://dailycaller.com/2025/06/09/soros-funded-group-unleashing-millions-texas-turn-blue/",
    "timestamp": "2025-06-09T16:06:11Z"
  },
  {
    "title": "What is happening in Los Angeles is not law enforcement, it’s occupation",
    "description": "The tools and tactics of the federal response to the LA protests are taken from the US imperial playbook.",
    "link": "https://www.aljazeera.com/opinions/2025/6/9/what-is-happening-in-los-angeles-is-not-law-enforcement-its-occupation",
    "timestamp": "2025-06-09T16:04:58Z"
  },
  {
    "title": "Trump Official Responds to Gavin Newsom's Dare to Arrest Him",
    "description": "Gavin Newsom, a Democrat, told MSNBC he plans to file suit Monday against the Trump administration.",
    "link": "https://www.newsweek.com/homan-responds-newsom-arrest-dare-la-ice-protests-2082948",
    "timestamp": "2025-06-09T16:03:10Z"
  },
  {
    "title": "What the UK's 'Nato-first' defense approach tells us about Britain's place in a volatile world",
    "description": "Since the end of the cold war, the relevance of the North Atlantic Treaty Organization (Nato) has regularly been questioned, even by its most prominent leaders. Its members, therefore, find it necessary to remind each other and the world of its value from tim…",
    "link": "https://phys.org/news/2025-06-uk-nato-defense-approach-britain.html",
    "timestamp": "2025-06-09T16:03:03Z"
  },
  {
    "title": "Trump to promote $1,000 ‘Trump Accounts’ for newborns at White House event | CNN Politics",
    "description": "President Donald Trump is set to host a roundtable at the White House on Monday to promote a key feature of the sweeping Republican domestic policy bill – a provision that would provide every American newborn with a $1,000 investment account, a White House of…",
    "link": "https://www.cnn.com/2025/06/09/politics/trump-accounts-newborn-1000",
    "timestamp": "2025-06-09T16:02:29Z"
  },
  {
    "title": "Rocket Lab, AST SpaceMobile Shares Are Surging Monday: What's Fueling The Move?",
    "description": "Rocket Lab Corp (NASDAQ:RKLB) and AST SpaceMobile Inc (NASDAQ:ASTS) shares continue to climb on Monday following a public dispute between SpaceX's Elon Musk and President Donald Trump.\nWhat Happened: Trump and Musk feuded on social media last week sparked by …",
    "link": "https://biztoc.com/x/7864d02470887f16",
    "timestamp": "2025-06-09T16:02:05Z"
  },
  {
    "title": "Trump foists National Guard on unwilling California",
    "description": "What happened\nPresident Donald Trump mobilized the California National Guard to Los Angeles on Saturday over the objection of local officials and Gov. Gavin Newsom (D). Trump said his presidential memorandum was necessary to tackle the \"lawlessness\" in L.A. C…",
    "link": "https://biztoc.com/x/b2b99b4103d788b8",
    "timestamp": "2025-06-09T16:01:39Z"
  },
  {
    "title": "ROOKE: Trump Could Suffocate These Riots By Ending Massive Incentive Program For Illegal Immigrants",
    "description": "There's a surefire way to cut off the money flowing to Mexico, thus significantly reducing the financial incentive illegal immigrants have to be in the U.S.",
    "link": "https://dailycaller.com/2025/06/09/rooke-trump-la-riots-protests-illegal-immigration-ice-remittance/",
    "timestamp": "2025-06-09T16:00:54Z"
  },
  {
    "title": "The Boys Creator Eric Kripke Isn’t Trying to Predict the Future",
    "description": "“People come up to me like, ‘Will you just please write a happy ending?’ And I’m like, ‘I don’t really have control over any of this,’” says showrunner Eric Kripke.",
    "link": "http://www.vulture.com/article/the-boys-eric-kripke-season-4-interview.html",
    "timestamp": "2025-06-09T16:00:48Z"
  },
  {
    "title": "New York’s Office Market Could Win Big With Andy Byford",
    "description": "In an era when proximity to convenient mass transit is by itself a major office amenity, the decision to allow Amtrak executive Andy Byford to lead Penn Station’s long-delayed redevelopment could not have arrived at a more portentous time for New York commerc…",
    "link": "http://commercialobserver.com/2025/06/new-york-office-demand-transportation-andy-byford/",
    "timestamp": "2025-06-09T16:00:25Z"
  }
]