[
  {
    "title": "Activist Ancora drops US Steel campaign after Trump orders review of Nippon Steel bid",
    "description": "Investment firm Ancora Holdings on Wednesday walked away from a bitter board room fight with U.S. Steel, days after President Donald Trump signalled the iconic American company might be taken over by a Japanese rival after all.Ancora, which owns roughly 1 per…",
    "link": "https://www.channelnewsasia.com/business/activist-ancora-drops-us-steel-campaign-after-trump-orders-review-nippon-steel-bid-5055216",
    "timestamp": "2025-04-09T15:34:25Z"
  },
  {
    "title": "Trump Brags About Tariffs as New Trade War Front Opens Up",
    "description": "President Donald Trump counseled everyone to stay “cool” Wednesday following a disturbing escalation in his global trade war.\r\n“BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!” Trump wrote in a post on Truth …",
    "link": "https://newrepublic.com/post/193785/donald-trump-brags-tariffs-new-trade-war-front",
    "timestamp": "2025-04-09T15:34:22Z"
  },
  {
    "title": "James Carville’s Doomsday Prediction of Trump’s Collapse Is Coming True Faster Than Anyone Imagined",
    "description": "In late February, the longtime Democratic strategist told Mediaite founder Dan Abrams that the Trump administration would \"collapse\" in 30 days. He was right.\nThe post James Carville’s Doomsday Prediction of Trump’s Collapse Is Coming True Faster Than Anyone …",
    "link": "https://www.mediaite.com/opinion/james-carvilles-doomsday-prediction-of-trumps-collapse-is-coming-true-faster-than-anyone-imagined/",
    "timestamp": "2025-04-09T15:33:17Z"
  },
  {
    "title": "Scott Jennings Defends Deportations After CNN Host Attempts To Split Hairs On Legal Definition Of Illegal Immigration",
    "description": "Scott Jennings explained why deporting illegal immigrants was necessary after Abby Phillip claimed illegally entering the U.S. didn’t make people criminals.",
    "link": "https://dailycaller.com/2025/04/09/scott-jennings-defends-deportations-after-cnn-host-attempts-to-split-hairs-on-legal-definition-of-illegal-immigration/",
    "timestamp": "2025-04-09T15:33:03Z"
  },
  {
    "title": "President Trump: BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!",
    "description": "Donald J. Trump @realDonaldTrump BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before! Apr 09, 2025, 8:33 AM",
    "link": "https://freerepublic.com/focus/f-news/4309938/posts",
    "timestamp": "2025-04-09T15:32:21Z"
  },
  {
    "title": "Gretchen Whitmer says ‘I understand’ Trump tariff motive, but prez has gone too far",
    "description": "\"I don't know how I would've enacted them differently,\" Whitmer said Wednesday. \"I haven't really thought about that.\"",
    "link": "https://nypost.com/2025/04/09/us-news/gretchen-whitmer-says-i-understand-trump-tariff-motive-but-prez-has-gone-too-far/",
    "timestamp": "2025-04-09T15:31:35Z"
  },
  {
    "title": "Another IRS chief steps down among Trump-imposed chaos at the agency",
    "description": "As a rule, it’s not a great sign when a powerful government agency loses three chiefs in less than four months, but that's what's happening at the IRS.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/another-irs-chief-steps-trump-imposed-chaos-agency-rcna200421",
    "timestamp": "2025-04-09T15:31:01Z"
  },
  {
    "title": "John Cornyn Nukes GOP Primary Challenger in Scorched Earth Attack: ‘Ken Claims to Be a Man of Faith…’",
    "description": "Sen. John Cornyn (R-TX) pulled no punches this week in attacking his longtime nemesis turned GOP primary opponent, Ken Paxton.\nThe post John Cornyn Nukes GOP Primary Challenger in Scorched Earth Attack: ‘Ken Claims to Be a Man of Faith…’ first appeared on Med…",
    "link": "https://www.mediaite.com/politics/john-cornyn-nukes-gop-primary-challenger-in-scorched-earth-attack-ken-claims-to-be-a-man-of-faith/",
    "timestamp": "2025-04-09T15:30:44Z"
  },
  {
    "title": "The Watch Industry Reacts to Tariffs on Swiss Imports to the United States",
    "description": "Last week, midway through the watch industry’s biggest trade show, Donald Trump announced 31% tariffs on Swiss imports. The proposed tariffs, enacted as of this morning, immediately became the focus of many discussions in Geneva between brands, retailers, and…",
    "link": "https://wornandwound.com/the-watch-industry-reacts-to-potential-tariffs-on-swiss-imports-to-the-united-states/",
    "timestamp": "2025-04-09T15:30:01Z"
  },
  {
    "title": "How Sweeping Tariffs Came to Be and Why It Matters",
    "description": "Targeted tariffs could be an important part of an industrial policy tool kit—but Trump's sweeping tariff policy will harm workers, not help them.",
    "link": "https://inthesetimes.com/article/trump-tariffs-policy-workers",
    "timestamp": "2025-04-09T15:30:00Z"
  },
  {
    "title": "Trump ‘Floated’ Idea of Deporting U.S. Citizens",
    "description": "White House press secretary Karoline Leavitt said Tuesday that the Trump administration is not sure it is legal to deport U.S. citizens to El Salvador, but that President Donald Trump has “simply floated” the idea",
    "link": "https://politicalwire.com/2025/04/09/trump-floated-idea-of-deporting-u-s-citizens/",
    "timestamp": "2025-04-09T15:30:00Z"
  },
  {
    "title": "'BE COOL': Trump's two-word message as massive reciprocal tariffs take effect, shake global markets",
    "description": "US President Donald Trump urged calm on Wednesday as China and the EU retaliated to his tariffs, escalating a trade war that is shaking global markets. \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/be-cool-trumps-two-word-message-as-massive-reciprocal-tariffs-take-effect-shake-global-markets/articleshow/120133319.cms",
    "timestamp": "2025-04-09T15:29:47Z"
  },
  {
    "title": "Michelle Obama shuts down Barack divorce rumours as she explains current situation",
    "description": "If you've heard rumours that Barack and Michelle Obama are headed for divorce, drop it, she's shut them down",
    "link": "https://www.ladbible.com/news/us-news/michelle-obama-barack-divorce-rumours-shuts-down-837319-20250409",
    "timestamp": "2025-04-09T15:29:39Z"
  },
  {
    "title": "Liquidity crisis fear dominates the markets as bonds sell off",
    "description": "President Donald Trump.\nMANDEL NGAN/AFP via Getty Images",
    "link": "https://biztoc.com/x/5fed741c2a8fe6c0",
    "timestamp": "2025-04-09T15:29:21Z"
  },
  {
    "title": "Tariff Tantrum 2.0",
    "description": "U.S. stocks, lead by high tech growth, began to drop in mid-February after a steady start to the year.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/04/09/tariff-tantrum-20/",
    "timestamp": "2025-04-09T15:29:20Z"
  },
  {
    "title": "USTR: Tariffs on Russia choice up to Trump",
    "description": "United States Trade Representative (USTR) Jamieson Greer said on Wednesday that it is for President Donald Trump to decide whether the country should raise tariffs on Russian exports.Speaking before t...",
    "link": "https://biztoc.com/x/85e6f21769f3d4af",
    "timestamp": "2025-04-09T15:29:18Z"
  },
  {
    "title": "GOP holdouts dig in as Trump presses for House budget approval",
    "description": "Key GOP holdouts held firm against approval of a budget framework for Donald Trump's \"big, beautiful\" domestic policy bill even as the president continued working to quell the revolt from House fiscal hawks. \nRep. Eric Burlison (R-Mo.) said he was \"not going …",
    "link": "https://biztoc.com/x/e95e46aa52458903",
    "timestamp": "2025-04-09T15:29:14Z"
  },
  {
    "title": "Every Penny Musk Made Since Trump Won Has Been Wiped Out",
    "description": "Elon Musk has himself become a casualty of Donald Trump’s chaotic tariff rollout.\nThe Tesla CEO’s net worth dipped below $300 billion for the first time since November, when Trump won re-election.\nMusk lost $31 billion across Thursday and Friday last week, an…",
    "link": "https://biztoc.com/x/b2f933ddea76eb27",
    "timestamp": "2025-04-09T15:29:14Z"
  },
  {
    "title": "Beijing Claims Pete Hegseth 'Maliciously Attacking' China by Visiting Panama",
    "description": "Beijing accused U.S. Defense Secretary Pete Hegseth of \"maliciously attacking\" China and sabotaging its relationship with Panama during his official visit to the Central American nation.\nThe post Beijing Claims Pete Hegseth ‘Maliciously Attacking’ China by Vi…",
    "link": "https://www.breitbart.com/latin-america/2025/04/09/beijing-claims-pete-hegseth-maliciously-attacking-china-by-visiting-panama/",
    "timestamp": "2025-04-09T15:28:20Z"
  },
  {
    "title": "Bond Markets Retreat as US Treasuries Lead Yield Jump Worldwide",
    "description": "(Bloomberg) -- A pullback from US Treasuries sent longer-term yields surging by the most since pandemic struck in 2020, deepening losses in what’s supposed...",
    "link": "https://finance.yahoo.com/news/treasuries-fire-sale-sends-long-065717018.html",
    "timestamp": "2025-04-09T15:27:42Z"
  },
  {
    "title": "Resisting Repression: What’s Next for the Student Fight for Palestine?",
    "description": "Facing suspensions and threats from the Trump administration, students are evolving their organizing defenses.",
    "link": "https://www.yesmagazine.org/political-power/2025/04/09/campus-divestment-movement-new-york",
    "timestamp": "2025-04-09T15:27:01Z"
  },
  {
    "title": "Trump news: The president’s tariffs are already blowing up in his face in one big way.",
    "description": "He promised manufacturing jobs would come flocking back to America—but the opposite is happening.",
    "link": "https://slate.com/technology/2025/04/trump-news-tariffs-killing-manufacturing-jobs.html",
    "timestamp": "2025-04-09T15:26:51Z"
  },
  {
    "title": "Trans athletes are under more scrutiny than ever. Some have found a safe space in gymnastics",
    "description": "Just about anything goes. At its annual national meet, the NAIGC even offers the “decathlon,\" which allows athletes of all gender identities to compete...",
    "link": "https://sports.yahoo.com/article/trans-athletes-under-more-scrutiny-152645602.html",
    "timestamp": "2025-04-09T15:26:45Z"
  },
  {
    "title": "Ivory tower shakeup: Trump admin pulls plug on $1.8 billion in funding to Northwestern and Cornell universities over alleged civil rights violations",
    "description": "The Trump administration has frozen nearly $1.8 billion in federal funds to Northwestern and Cornell universities due to concerns over civil rights violations related to diversity programs and campus protests. Both universities are facing uncertainty about th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ivory-tower-shakeup-trump-admin-pulls-plug-on-1-8-billion-in-funding-to-northwestern-and-cornell-universities-over-alleged-civil-rights-violations/articleshow/120131681.cms",
    "timestamp": "2025-04-09T15:25:44Z"
  },
  {
    "title": "Exclusive-Fed's Musalem sees growth slipping below trend, higher inflation risk",
    "description": "U.S. economic growth will likely slip \"materially\" below trend and the unemployment rate will rise over the year as firms and households adjust to prices...",
    "link": "https://www.yahoo.com/news/exclusive-feds-musalem-sees-growth-152534721.html",
    "timestamp": "2025-04-09T15:25:34Z"
  },
  {
    "title": "Exclusive-Fed's Musalem sees growth slipping below trend, higher inflation risk",
    "description": "U.S. economic growth will likely slip \"materially\" below trend and the unemployment rate will rise over the year as firms and households adjust to prices...",
    "link": "https://finance.yahoo.com/news/exclusive-feds-musalem-sees-growth-152534432.html",
    "timestamp": "2025-04-09T15:25:34Z"
  },
  {
    "title": "US issues new sanctions on Iran as Trump seeks talks",
    "description": "WASHINGTON (Reuters) - The United States issued fresh sanctions on Iran on Wednesday, the Treasury Department said, two days after President Donald Trump announced the U.S. planned direct talks with Tehran over its nuclear program. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/09/us-issues-new-sanctions-on-iran-as-trump-seeks-talks",
    "timestamp": "2025-04-09T15:25:00Z"
  },
  {
    "title": "China slaps restrictions on 18 US firms over Trump tariffs",
    "description": "The trade restrictions are mainly targeted at US firms that supply the Pentagon and federal government agencies",
    "link": "https://www.thehindubusinessline.com/news/world/china-slaps-restrictions-on-18-us-firms-over-trump-tariffs/article69432272.ece",
    "timestamp": "2025-04-09T15:24:43Z"
  },
  {
    "title": "EU’s Russophobia a costly ‘obsession’ – Moscow",
    "description": "Anti-Russian policies have cost the bloc’s economy over $1.4 trillion, according to Foreign Ministry spokeswoman Maria Zakharova Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615451-eu-economy-loss-zakharova/",
    "timestamp": "2025-04-09T15:23:25Z"
  },
  {
    "title": "Walmart's 60 per cent imports are from China. Will multinational retail giant hike prices?",
    "description": "Walmart's shares, which have fallen nearly 9 per cent since the announcement of a raft of tariffs on April 2, rose about 5 per cent in early trading on Wednesday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/walmarts-60-per-cent-imports-are-from-china-will-multinational-retail-giant-hike-prices/articleshow/120133013.cms",
    "timestamp": "2025-04-09T15:22:29Z"
  },
  {
    "title": "U.S stock market shaky as bonds show more stress following tariff escalations",
    "description": "The S&P 500 rose 0.3% Wednesday after swinging between a loss of 0.5% and a gain of 1.4%.",
    "link": "https://www.pbs.org/newshour/nation/u-s-stock-market-shaky-as-bonds-show-more-stress-following-tariff-escalations",
    "timestamp": "2025-04-09T15:21:18Z"
  },
  {
    "title": "The True Story of Appomattox Exposes the Dangers of Letting Myths Replace History",
    "description": "The case of Robert E. Lee’s surrender at Appomattox dramatically illustrates the dangers of letting myth substitute for accurate history.",
    "link": "https://time.com/7275632/true-story-of-appomattox-dangers-myths/",
    "timestamp": "2025-04-09T15:20:43Z"
  },
  {
    "title": "‘I love it. I hope nobody disguises this charge’: Shoppers are spotting new tariff surcharges on their shopping receipts",
    "description": "A growing number of U.S.-based companies are adding tariff surcharges to receipts, directly passing import costs to customers.\n\n\nAs President Donald Trump’s administration rolls out drastic and wide-ranging global tariff hikes, businesses across sectors are r…",
    "link": "https://www.dailydot.com/culture/tariff-surcharge-line-item-fabletics/",
    "timestamp": "2025-04-09T15:19:16Z"
  },
  {
    "title": "How Shopping on Shein, Temu Could Change Under Trump's China Tariffs",
    "description": "President Donald Trump's tariffs could upend the cheap online stores popular with American consumers.",
    "link": "https://www.newsweek.com/shein-temu-online-shopping-trump-tariffs-2057463",
    "timestamp": "2025-04-09T15:18:55Z"
  },
  {
    "title": "Why Roche Holding, Eli Lilly, and AstraZeneca Stocks Dropped Today",
    "description": "In This Article:\nJust like the rest of the stock market, pharmaceutical stocks are in a funk approaching the midweek mark, and it's looking like things might be about to get even worse for this particular pocket of the stock market. On Wednesday, Reuters repo…",
    "link": "https://biztoc.com/x/efefaec3eb032d88",
    "timestamp": "2025-04-09T15:18:43Z"
  },
  {
    "title": "Disney World Hotels Could Get Cheaper Soon",
    "description": "Could tariffs mean a drop in hotel rates at Disney World?\nThe post Disney World Hotels Could Get Cheaper Soon first appeared on the disney food blog.",
    "link": "https://www.disneyfoodblog.com/2025/04/09/disney-world-hotels-could-get-cheaper-soon/",
    "timestamp": "2025-04-09T15:18:38Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Slips Despite China Trade War News; Nvidia, Tesla Jump As Trump Issues This Warning (Live Coverage)",
    "description": "The Dow Jones Industrial Average slipped while other indexes were mixed Wednesday as President Donald Trump's tariffs went into effect and China and the European Union retaliated. Nvidia (NVDA) jumped 3% while Tesla (TSLA) rallied 4% on the stock market today…",
    "link": "https://biztoc.com/x/ee54abcbe1af9526",
    "timestamp": "2025-04-09T15:18:29Z"
  },
  {
    "title": "US President Trump signs executive orders to increase coal production",
    "description": "US President Donald Trump has signed executive orders to increase coal production in the US, a move that defies international efforts to reduce carbon emissions.\nThe orders are part of Trump's broader agenda to revitalise the coal industry and increase energy…",
    "link": "https://biztoc.com/x/2871f20db7daf917",
    "timestamp": "2025-04-09T15:18:07Z"
  },
  {
    "title": "Walmart Stands Strong Despite Tariffs, Hits E-commerce Profitability",
    "description": "Walmart remains confident despite tariff challenges, highlighting e-commerce profitability and steady growth amid a shifting retail landscape.",
    "link": "http://wwd.com/business-news/financial/walmart-tariffs-ecommerce-growth-1237079153/",
    "timestamp": "2025-04-09T15:16:16Z"
  },
  {
    "title": "Samsung and Apple might have distanced themselves from under-display camera technology",
    "description": "It appears that the under-display technology isn't going to be used on future Samsung and Apple phones, at least for some years. Read more...",
    "link": "https://www.neowin.net/news/samsung-and-apple-might-have-distanced-themselves-from-under-display-camera-technology/",
    "timestamp": "2025-04-09T15:16:01Z"
  },
  {
    "title": "Investors Pull $326 Million From Bitcoin ETFs Amid Tariff Angst",
    "description": "Tuesday’s drawdown was the most pronounced pullback in nearly a month.",
    "link": "https://decrypt.co/314135/investors-pull-326-million-from-bitcoin-etfs-tariff-angst",
    "timestamp": "2025-04-09T15:15:13Z"
  },
  {
    "title": "Michigan Democratic Gov. Whitmer strays from her party in moving closer to Trump",
    "description": "Michigan Gov. Gretchen Whitmer is calling for Democrats and Republicans to work together to help boost American manufacturing.",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/09/michigan-democratic-gov-whitmer-strays-from-her-party-in-moving-closer-to-trump/",
    "timestamp": "2025-04-09T15:15:08Z"
  },
  {
    "title": "Canada's 1970s superhero 'Captain Canuck' has resurgence thanks to Trump",
    "description": "VANCOUVER (Reuters) - U.S. President Donald Trump's annexation threats and tariffs have breathed new life into a superhero from the 1970s – Captain Canuck, a government agent with inhuman strength who defends Canada's sovereignty. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/09/canada039s-1970s-superhero-039captain-canuck039-has-resurgence-thanks-to-trump",
    "timestamp": "2025-04-09T15:15:00Z"
  },
  {
    "title": "The Dumbest Economic Policy in Modern History",
    "description": "Trump’s tariff plan looks like an abject disaster for America, even judged against the benchmarks the administration has set for itself.",
    "link": "https://www.theatlantic.com/economy/archive/2025/04/economic-policy-trump-tariffs/682369/",
    "timestamp": "2025-04-09T15:15:00Z"
  },
  {
    "title": "Michigan Democratic Gov. Whitmer strays from her party in moving closer to Trump",
    "description": "Michigan Gov. Gretchen Whitmer is calling for Democrats and Republicans to work together to help boost American manufacturing",
    "link": "https://abcnews.go.com/US/wireStory/michigan-democratic-gov-whitmer-strays-party-moving-closer-120639229",
    "timestamp": "2025-04-09T15:13:01Z"
  },
  {
    "title": "US to deny visas, green cards over social media posts",
    "description": "WASHINGTON: United States immigration authorities said on Wednesday (Apr 9) they will look at social media accounts and deny visas or residence permits to people who post content considered anti-Semitic by President Donald Trump's administration. Posts define…",
    "link": "https://www.channelnewsasia.com/world/us-deny-visas-green-cards-social-media-posts-5055131",
    "timestamp": "2025-04-09T15:13:00Z"
  },
  {
    "title": "Apple bounces 3% after worst losing streak since 2000",
    "description": "Apple shares rallied more than 3% Tuesday after the iPhone maker posted its worst four-day stretch in more than two decades.",
    "link": "https://www.cnbc.com/2025/04/09/apple-bounces-3percent-after-worst-losing-streak-since-2000-tech-stocks.html",
    "timestamp": "2025-04-09T15:12:08Z"
  },
  {
    "title": "China slaps restrictions on 18 US firms over Trump tariffs",
    "description": "Beijing added 12 U.S. companies to a control list that prohibits exports of dual-use items and another six to its \"unreliable entities\" list, which allows Beijing to take punitive actions against foreign entities, according to commerce ministry statements.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-slaps-restrictions-on-18-us-firms-over-trump-tariffs/articleshow/120132676.cms",
    "timestamp": "2025-04-09T15:11:40Z"
  },
  {
    "title": "Trump's NASA Nominee Jared Isaacman Ready for Liftoff at Confirmation Hearing",
    "description": "The Senate Commerce Committee will hold a long-anticipated confirmation hearing Wednesday morning for President Donald Trump's nominee to lead NASA.\nThe post Trump’s NASA Nominee Jared Isaacman Ready for Liftoff at Confirmation Hearing appeared first on Breit…",
    "link": "https://www.breitbart.com/politics/2025/04/09/trumps-nasa-nominee-jared-isaacman-ready-for-liftoff-at-confirmation-hearing/",
    "timestamp": "2025-04-09T15:11:20Z"
  },
  {
    "title": "Razer Is Another Casualty In The US Trade War, As It Removes Its Gaming Laptops From Sale",
    "description": "Following US president Donald Trump's announcement of massive tariffs on major manufacturing hubs like China, Taiwan, and Vietnam--and dozens of other countries--Razer has removed its new Blade gaming laptops for sale in the US. While they were available to p…",
    "link": "https://www.gamespot.com/articles/razer-is-another-casualty-in-the-us-trade-war-as-it-removes-its-gaming-laptops-from-sale/1100-6530721/",
    "timestamp": "2025-04-09T15:11:00Z"
  },
  {
    "title": "Trump’s tariff gambit sparks global chain reaction: China, EU, and allies retaliate",
    "description": "Donald Trump’s tariffs triggered global backlash. China hit back with higher duties and mineral restrictions. The EU prepared countermeasures worth €20 billion. Japan opted for talks. South Korea unveiled a $2 billion aid package for carmakers. Canada matched…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-gambit-sparks-global-chain-reaction-china-eu-and-allies-retaliate/articleshow/120132634.cms",
    "timestamp": "2025-04-09T15:10:33Z"
  },
  {
    "title": "Trump Admin Freezes Over $1.8 Billion in Federal Funding to Cornell, Northwestern",
    "description": "The Trump administration has frozen more than $1.8 billion in federal funding to Cornell University and Northwestern University amid ongoing Title VI investigations into campus anti-Semitism, a senior administration official reportedly told Fox News.\nThe post…",
    "link": "https://freebeacon.com/latest-news/trump-admin-freezes-over-1-8-billion-in-federal-funding-to-cornell-northwestern/",
    "timestamp": "2025-04-09T15:10:31Z"
  },
  {
    "title": "Where Dem Dollas At? Walmart Faces Boycotts Over Alleged Corporate Greed, DEI Rollbacks",
    "description": "Walmart responds to The People's Union April 7-April 14 boycott that accuses them of corporate greed and tax evasion \nThe post Where Dem Dollas At? Walmart Faces Boycotts Over Alleged Corporate Greed, DEI Rollbacks appeared first on Bossip.",
    "link": "http://bossip.com/2852325/walmart-responds-to-the-peoples-union-boycott/",
    "timestamp": "2025-04-09T15:10:24Z"
  },
  {
    "title": "New Trump EO Would Punish States for Combatting Climate Change",
    "description": "On Tuesday, President Donald Trump signed an executive order aimed at “protecting” American energy from “state overreach.” The move, some energy experts say, is a legally dubious federal overstep designed to undermine the rights of states and local authoritie…",
    "link": "https://www.motherjones.com/politics/2025/04/trump-climate-change-punish-states-executive-order-greenhouse-gases-pam-pondi/",
    "timestamp": "2025-04-09T15:08:54Z"
  },
  {
    "title": "New Trump EO Would Punish States for Combating Climate Change",
    "description": "On Tuesday, President Donald Trump signed an executive order aimed at “protecting” American energy from “state overreach.” The move, some energy experts say, is a legally dubious federal overstep designed to undermine the rights of states and local authoritie…",
    "link": "https://www.motherjones.com/politics/2025/04/trump-climate-change-punish-states-executive-order-greenhouse-gases-pam-pondi-co2/",
    "timestamp": "2025-04-09T15:08:54Z"
  },
  {
    "title": "Owens & Minor, Inc. (OMI): Among Stocks Insiders Bought in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 20 Stocks Insiders Bought in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Owens & Minor, Inc. (NYSE:OMI) stands against other stocks that insiders bought in April after Trump’s tarif…",
    "link": "https://biztoc.com/x/4bbc68a47c97ab98",
    "timestamp": "2025-04-09T15:07:19Z"
  },
  {
    "title": "Michelle Obama breaks silence on rumors she and Barack are getting divorced",
    "description": "The couple sparked divorce rumors in January when Michelle did not attend Jimmy Carter’s funeral with Barack",
    "link": "https://www.the-independent.com/life-style/michelle-barack-obama-marriage-divorce-b2730277.html",
    "timestamp": "2025-04-09T15:07:12Z"
  },
  {
    "title": "Federal Reserve May Step In As Trump Tariffs Unglue 10-Year Treasury Yield, Bear Claws S&P 500",
    "description": "Federal Reserve Chairman Jerome Powell said just last Friday that there's no rush for policymakers to cushion the blow from escalating Trump tariffs. Yet he may already be rethinking that view as Treasury markets come unglued amid President Donald Trump's unp…",
    "link": "https://biztoc.com/x/74a543b2ec1bea08",
    "timestamp": "2025-04-09T15:07:02Z"
  },
  {
    "title": "China Raises Tariffs on US Goods to 84% in Retaliation to Trump",
    "description": "China retaliated against new tariffs imposed by President Donald Trump by announcing it would raise duties on US goods, roiling markets and deepening a trade war between the world’s largest economies.\nThe Chinese government will impose an 84% tariff on all im…",
    "link": "https://biztoc.com/x/8453b9f71307431a",
    "timestamp": "2025-04-09T15:06:47Z"
  },
  {
    "title": "Trump Urges Calm, Says 'Great Time to Buy' As Markets Convulse Over Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump urged calm and said it's a 'great time to buy' in Wednesday morning social media posts as markets continue to convulse over his tariffs.\nThe president posted on Truth Social, \"THIS IS A …",
    "link": "https://biztoc.com/x/91a5eff97a05f8b6",
    "timestamp": "2025-04-09T15:06:44Z"
  },
  {
    "title": "ICE Director: Deportations Will Be Like Amazon Prime—but With Humans",
    "description": "If Donald Trump’s mass deportations weren’t already dystopian enough, the acting director of Immigration and Customs Enforcement says he wants to make them look like Amazon Prime. \r\nTodd Lyons made the remarks at the 2025 Border Security Expo in Phoenix Tuesd…",
    "link": "https://newrepublic.com/post/193784/ice-director-deportations-amazon-prime-humans",
    "timestamp": "2025-04-09T15:06:31Z"
  },
  {
    "title": "AP wins access to White House events after judge rules government can’t bar its journalists",
    "description": "U.S.. District Judge Trevor N. McFadden, an appointee of Donald Trump, ruled that the government can't retaliate against the AP's decision not to follow the president's executive order to rename the Gulf of Mexico.",
    "link": "https://biztoc.com/x/82f91dccabfa1c05",
    "timestamp": "2025-04-09T15:06:21Z"
  },
  {
    "title": "Gold surges by Rs 2,800 per 10 gram as China, EU retaliate against US tariffs",
    "description": "Gold prices soared by ₹2,800 on MCX to ₹90,450 per 10g after Comex gold breached $3,000, driven by China and EU retaliatory tariffs against US trade moves. The Trump-led tariff escalation has intensified global trade tensions, boosting demand for safe-haven a…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-surges-by-rs-2800-per-10-gram-as-china-eu-retaliate-against-us-tariffs/articleshow/120132469.cms",
    "timestamp": "2025-04-09T15:06:07Z"
  },
  {
    "title": "The US Must Change Course on Myanmar",
    "description": "Since the Myanmar military’s overthrow of a civilian government in 2021, the US has taken a punitive approach to the country, emphasizing broad-based sanctions and aid to rebel groups. But far from promoting a democratic transition, this approach has perpetua…",
    "link": "https://www.project-syndicate.org/commentary/trump-administration-must-pursue-strategic-engagement-in-myanmar-by-brahma-chellaney-2025-04",
    "timestamp": "2025-04-09T15:05:51Z"
  },
  {
    "title": "MAGA Influencers Turn Against Trump as Tariffs Kick In",
    "description": "Some of Donald Trump’s most ardent supporters are expressing dread and alarm as the president’s tariff policy continues to throttle the stock market and hurt their own pockets. \r\nLast weekend, DOGE slasher-in-chief Elon Musk said that he preferred a “zero-tar…",
    "link": "https://newrepublic.com/post/193782/maga-trump-tariffs",
    "timestamp": "2025-04-09T15:05:18Z"
  },
  {
    "title": "Protecting American Energy From State Overreach (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nProtecting American Energy From State Overreach  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  My Ad…",
    "link": "https://www.memeorandum.com/250409/p59",
    "timestamp": "2025-04-09T15:05:01Z"
  },
  {
    "title": "Jessica Reed Kraus, RFK Jr. Fanblogger, Claims to be “Official” Press. The White House Differs.",
    "description": "The Associated Press is out, House Inhabit is in—but only sort of, a Trump administration official tells Vanity Fair.",
    "link": "https://www.vanityfair.com/style/story/jessica-reed-kraus-rfk-jr-official-press-pass-white-house",
    "timestamp": "2025-04-09T15:04:46Z"
  },
  {
    "title": "Pete Hegseth senior adviser pushing for Pentagon to cut ties with Scouting America",
    "description": "Critics like the adviser, a former Fox News producer, say the group formerly known as the Boy Scouts is too woke. No decision has been made.",
    "link": "https://www.nbcnews.com/politics/national-security/pete-hegseth-senior-adviser-pushing-pentagon-cut-ties-scouting-america-rcna200141",
    "timestamp": "2025-04-09T15:04:35Z"
  },
  {
    "title": "Democrats Question Social Security Administration Changes in Misleading Terms",
    "description": "Abrupt changes in staffing and some procedures at the Social Security Administration, coupled with false and misleading claims about widespread fraud, have prompted heated criticism from Democrats, with some statements leaving the wrong impression that benefi…",
    "link": "https://www.factcheck.org/2025/04/democrats-question-social-security-administration-changes-in-misleading-terms/",
    "timestamp": "2025-04-09T15:04:22Z"
  },
  {
    "title": "Meghan Markle reacts to Trump tariffs amid launch of her new business",
    "description": "The Duchess of Sussex’s business As Ever launched its first eight products last week",
    "link": "https://www.the-independent.com/life-style/royal-family/meghan-markle-as-ever-trump-tariffs-b2730289.html",
    "timestamp": "2025-04-09T15:04:19Z"
  },
  {
    "title": "Pandemonium Breaks Out Among Small Businesses Over Trump Tariffs",
    "description": "Panic is growing among U.S. small businesses, with owners fearing that Trump's new tariffs could threaten their survival.",
    "link": "https://www.newsweek.com/small-business-trump-reciprocal-tariffs-2057427",
    "timestamp": "2025-04-09T15:04:03Z"
  },
  {
    "title": "US Says Will Deny Visas, Residence Permits Over Social Media Posts",
    "description": "US immigration authorities said Wednesday they will look at social media accounts and deny visas or residence permits to people who post content considered anti-Semitic by President Donald Trump&#039;s administration.",
    "link": "https://www.ndtv.com/world-news/us-says-will-deny-visas-residence-permits-over-social-media-posts-8126493",
    "timestamp": "2025-04-09T15:03:55Z"
  },
  {
    "title": "Trump Urges Calm, Says 'Great Time to Buy' As Markets Convulse Over Tariffs",
    "description": "Stock futures were sinking again in premarket trading on Wednesday after massive U.S. tariffs against China kicked in overnight.",
    "link": "https://www.newsweek.com/trump-urges-calm-says-great-time-buy-markets-convulse-over-tariffs-2057490",
    "timestamp": "2025-04-09T15:03:43Z"
  },
  {
    "title": "US President Trump signs executive orders to increase coal production",
    "description": "The orders include measures to prevent the retirement of coal plants, using the 1950 Defense Production Act to bolster production.",
    "link": "https://www.mining-technology.com/news/us-coal-production/",
    "timestamp": "2025-04-09T15:01:35Z"
  },
  {
    "title": "Hope vs. Fear: Many Mature Americans Are Banking on President Trump Taking Gold and Silver Higher Again",
    "description": "Amidst a divided economic landscape, many mature Americans are turning to gold and silver as a hedge for their retirement savings, driven by a blend of hope in Trump’s policies and fear of global instability.\nThe post Hope vs. Fear: Many Mature Americans Are …",
    "link": "https://www.thegatewaypundit.com/2025/04/hope-vs-fear-many-mature-americans-are-banking-3/",
    "timestamp": "2025-04-09T15:00:43Z"
  },
  {
    "title": "Trump Hits China With 104% Tariffs",
    "description": "Brace for economic pain. Donald Trump has just slapped China with 104% tariffs on all imports. That means literally everything, from tools and equipment to products used to make \"American-made\" items. Prices are about to go up, and this will impact those who …",
    "link": "https://www.shtfplan.com/headline-news/trump-hits-china-with-104-tariffs",
    "timestamp": "2025-04-09T15:00:26Z"
  },
  {
    "title": "The Guy Running Trump's Trade War Has 2 Other Government Jobs",
    "description": "Jamieson Greer holds three government positions under Trump — one of which just happens to be waging a high-stakes global trade war.",
    "link": "https://www.huffpost.com/entry/jamieson-greer-trade-rep-other-jobs_n_67f667d3e4b0b09182ab25a4",
    "timestamp": "2025-04-09T15:00:13Z"
  },
  {
    "title": "Rex Huppke: Trump Golfs While His Tariffs Destroy the Global Economy",
    "description": "Rex Huppke writes opinion columns for USA Today. In his latest column, he muses about Trump’s on balance as most Americans watch their retirement savings melt away. He has a way of finding the humor in gut-wrenching events. Recently he has been writing about …",
    "link": "https://dianeravitch.net/2025/04/09/rex-huppke-trump-golfs-while-his-tariffs-destroy-the-global-economy/",
    "timestamp": "2025-04-09T15:00:00Z"
  },
  {
    "title": "Hackers go after influencers and content creators to hit followers with malware, steal data",
    "description": "Large social media channels are being targeted and abused in crypto scams, malware attacks, and more.",
    "link": "https://www.techradar.com/pro/security/hackers-go-after-influencers-and-content-creators-to-hit-followers-with-malware-steal-data",
    "timestamp": "2025-04-09T15:00:00Z"
  },
  {
    "title": "Lindsey Graham Warns of Iran Nuclear Bombs: 'They'll Come After Us'",
    "description": "Republican Senator Lindsey Graham claimed that Iran has enough highly enriched uranium to make six nuclear bombs.",
    "link": "https://www.newsweek.com/us-senator-lindsey-graham-warns-iran-nuclear-bomb-attack-2057302",
    "timestamp": "2025-04-09T14:59:54Z"
  },
  {
    "title": "What Does China Import From the U.S? Find Out Amid Tariffs",
    "description": "Amid ongoing tariff tensions, here’s a look at the American goods flowing into China—and how trade policy is shifting the landscape.",
    "link": "https://hollywoodlife.com/2025/04/09/what-does-china-import-from-us/",
    "timestamp": "2025-04-09T14:59:30Z"
  },
  {
    "title": "AP wins access to White House events after judge rules government can’t bar its journalists",
    "description": "U.S.. District Judge Trevor N. McFadden, an appointee of Donald Trump, ruled that the government can't retaliate against the AP's decision not to follow the president's executive order to rename the Gulf of Mexico.",
    "link": "https://www.pbs.org/newshour/politics/ap-wins-access-to-white-house-events-after-judge-rules-government-cant-bar-its-journalists",
    "timestamp": "2025-04-09T14:59:09Z"
  },
  {
    "title": "Billionaire spacewalker highlights Mars trip for astronauts in his bid to become NASA’s next chief",
    "description": "Jared Isaacman said he would prioritize sending astronauts to Mars in his confirmation hearing to become NASA's 15th administrator.",
    "link": "https://www.bostonherald.com/2025/04/09/trump-nasa-administrator-hearing/",
    "timestamp": "2025-04-09T14:58:58Z"
  },
  {
    "title": "Want to start buying stocks? Consider these 3 things before you make a move",
    "description": "Investors who want to deploy money in this volatile and uncertain market should keep these three considerations in mind.",
    "link": "https://www.cnbc.com/2025/04/09/want-to-start-buying-stocks-consider-these-3-things-before-you-make-a-move.html",
    "timestamp": "2025-04-09T14:58:39Z"
  },
  {
    "title": "Hackers Spied on 100 US Bank Regulators’ Emails for Over a Year",
    "description": "Hackers intercepted about 103 bank regulators’ emails for more than a year, gaining access to highly sensitive financial information, according to two people familiar with the matter and a draft letter to Congress seen by Bloomberg News. The attackers were …",
    "link": "https://www.insurancejournal.com/news/national/2025/04/09/819158.htm",
    "timestamp": "2025-04-09T14:58:12Z"
  },
  {
    "title": "Instagram for iPad? It Might Actually Be Happening",
    "description": "The photo-centric social media platform has long focused on its smartphone app. That may be about to change, according to a report.",
    "link": "https://www.cnet.com/tech/services-and-software/instagram-for-ipad-it-might-actually-be-happening/",
    "timestamp": "2025-04-09T14:58:00Z"
  },
  {
    "title": "US bill creates fund to enforce oil sanctions on Russia's ghost fleet",
    "description": "A new bipartisan bill would fund enforcement against Russia’s ghost fleet of oil tankers, aiming to curb sanctions evasion by Moscow and Tehran.",
    "link": "https://www.jpost.com/american-politics/article-849515",
    "timestamp": "2025-04-09T14:57:41Z"
  },
  {
    "title": "Brits warned over extortionate ‘new price of iPhones’ following Trump tariffs",
    "description": "Donald Trump's tariffs could cause the price of Apple's iPhone's and other tech gadgets to soar, financial analysts have warned.",
    "link": "https://www.ladbible.com/news/technology/donald-trump-tariffs-china-technology-impact-apple-iphone-prices-735916-20250409",
    "timestamp": "2025-04-09T14:57:28Z"
  },
  {
    "title": "AI-generated attorney outrages judge who scolds man over courtroom fake: ‘not a real person’",
    "description": "A New York man used an AI-avatar to argue his case in front of a panel of judges, sparking outrage within the courtroom during his legal proceedings.",
    "link": "https://www.foxnews.com/us/ai-generated-attorney-outrages-judge-who-scolds-man-over-courtroom-fake-not-real-person",
    "timestamp": "2025-04-09T14:57:23Z"
  },
  {
    "title": "Germany 'Back On Track' Says Merz, Unveiling New Coalition",
    "description": "Germany's next leader, the conservative Friedrich Merz, vowed Wednesday to \"move the country forward again\" by boosting the economy and defence as he presented a deal to launch his coalition government by early next month.",
    "link": "https://www.ibtimes.com/germany-back-track-says-merz-unveiling-new-coalition-3769407",
    "timestamp": "2025-04-09T14:57:21Z"
  },
  {
    "title": "Germany 'Back On Track' Says Merz, Unveiling New Coalition",
    "description": "Germany's next leader, the conservative Friedrich Merz, vowed Wednesday to \"move the country forward again\" by boosting the economy and defence as he presented a deal to launch his coalition government by early next month.",
    "link": "https://www.ibtimes.com.au/germany-back-track-says-merz-unveiling-new-coalition-1857717",
    "timestamp": "2025-04-09T14:57:07Z"
  },
  {
    "title": "Bitcoin price at risk of new 5-month low near $71K if tariff war and stock market tumult continues",
    "description": "Bitcoin (BTC) price made a swift move to $78,300 at the April 9 Wall Street open as “herd-like” price action in equities markets continued to spook risk-asset traders.BTC/USD 1-hour chart. Source: Cointelegraph/TradingView\r\nBitcoin gyrates as stocks make hist…",
    "link": "https://cointelegraph.com/news/bitcoin-price-at-risk-of-new-5-month-low-near-71-k-if-tariff-war-and-stock-market-tumult-continues",
    "timestamp": "2025-04-09T14:56:55Z"
  },
  {
    "title": "JPMorgan Chase's Jamie Dimon says it's now likely Trump tariffs will spark recession",
    "description": "JPMorgan Chase CEO Jamie Dimon says a recession will likely be triggered by President Trump's sweeping tariffs",
    "link": "https://www.usatoday.com/story/money/2025/04/09/jamie-dimon-trump-tariffs-recession/83006735007/",
    "timestamp": "2025-04-09T14:56:33Z"
  }
]