[
  {
    "title": "No plan to fire Fed chair despite probe: President Trump",
    "description": "International Business News: US President Donald Trump said on Wednesday he has no plans to fire Jerome Powell despite a justice department criminal probe into the Federal Reserve.",
    "link": "https://timesofindia.indiatimes.com/business/international-business/no-plan-to-fire-fed-chair-despite-probe-president-trump/articleshow/126555402.cms",
    "timestamp": "2026-01-16T01:43:47Z"
  },
  {
    "title": "'Appease Prize': Critics Stunned By Venezuela's Machado Nobel Hand Off To Trump",
    "description": "Machado said she \"presented\" Trump with the coveted medal despite the Nobel Committee's insistence that she can't share or transfer it.",
    "link": "https://www.huffpost.com/entry/maria-corina-machado-presented-nobel-peace-prize-trump-reactions_n_69697dd0e4b0774cc19f8eb5",
    "timestamp": "2026-01-16T01:43:23Z"
  },
  {
    "title": "US warns Iran that 'all options are on the table' in emergency UN meeting",
    "description": "U.S. envoy Mike Waltz renewed threats against Iran at the UN Security Council, vowing \"all options are on the table\" to stop the crackdown on protests. Iranian dissidents Masih Alinejad and Ahmad Batebi testified about their experiences, urging international …",
    "link": "https://economictimes.indiatimes.com/news/defence/us-warns-iran-that-all-options-are-on-the-table-in-emergency-un-meeting/articleshow/126555421.cms",
    "timestamp": "2026-01-16T01:42:24Z"
  },
  {
    "title": "All the global benefits Trump reaped by grabbing Maduro",
    "description": "President Trump has no wish to carve the world like an apple into spheres of influence, in which China, Russia and the US can plunder smaller nations at will.",
    "link": "https://nypost.com/2026/01/15/opinion/all-the-global-benefits-trump-reaped-by-grabbing-maduro/",
    "timestamp": "2026-01-16T01:41:36Z"
  },
  {
    "title": "The Minnesota War Zone Is Trump's Most Trumpian Accomplishment (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nThe Minnesota War Zone Is Trump's Most Trumpian Accomplishment  —  The President may have started out by trash-talking America; one year into his second term, he is simply trashing it.  —  In the past week, Donald Trump has thre…",
    "link": "https://www.memeorandum.com/260115/p146",
    "timestamp": "2026-01-16T01:40:00Z"
  },
  {
    "title": "One year on, it’s all about Trump. But for how long?",
    "description": "On a sunny January morning in Florida, Donald Trump went shopping for marble and onyx for his new White House ballroom. A few hours later, he was bombing Venezuela. It was just one day in an extraordinary year since his return to office, but it summed up how …",
    "link": "https://www.digitaljournal.com/world/one-year-on-its-all-about-trump-but-for-how-long/article",
    "timestamp": "2026-01-16T01:37:20Z"
  },
  {
    "title": "IMF's growth forecasts to show resilience to global trade shocks, Georgieva says",
    "description": "Global economy shows remarkable resilience, defying trade shocks with strong growth, according to IMF chief Kristalina Georgieva.  While performance is robust, she warns of potential risks from geopolitical tensions and rapid technological shifts.  Many natio…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/imfs-growth-forecasts-to-show-resilience-to-global-trade-shocks-georgieva-says/articleshow/126555388.cms",
    "timestamp": "2026-01-16T01:37:12Z"
  },
  {
    "title": "Dem Rep. Goldman: Trump 'Setting Up' Excuse to Cancel Elections",
    "description": "Thursday on CNN's \"The Arena,\" Rep. Dan Goldman (D-NY) claimed President Donald Trump was \"setting up\" a situation to cancel the midterms by sending Immigration and Customs Enforcement (ICE) agents into cities to inflame tensions, then invoke the Insurrection…",
    "link": "https://www.breitbart.com/clips/2026/01/15/dem-rep-goldman-trump-setting-up-excuse-to-cancel-elections/",
    "timestamp": "2026-01-16T01:35:49Z"
  },
  {
    "title": "Venezuelan opposition leader Machado says she presented Nobel medal to Trump | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> Venezuelan opposition leader Maria Corina Machado said she had presented her Nobel Peace Prize to President Donald Trump on Thursday during a high-stakes encounter that could affect how Trump seeks to shape the South American country’s political…",
    "link": "https://www.staradvertiser.com/2026/01/15/breaking-news/venezuelan-opposition-leader-machado-says-she-presented-nobel-medal-to-trump/",
    "timestamp": "2026-01-16T01:35:24Z"
  },
  {
    "title": "Piers Morgan panel erupts in fiery clash with guest being accused of spreading ‘Jihadi Islamist propaganda’",
    "description": "Iran debate turned heated as Goldie Ghamari accused \"Young Turks\" host Cenk Uygur of spreading \"jihadi Islamist propaganda\" during tense \"Piers Morgan Uncensored\" discussion.",
    "link": "https://www.foxnews.com/media/piers-morgan-panel-erupts-fiery-clash-guest-being-accused-spreading-jihadi-islamist-propaganda",
    "timestamp": "2026-01-16T01:35:11Z"
  },
  {
    "title": "US to Iran: ‘All options are on the table’ at UN emergency meet",
    "description": "Iranian dissidents Masih Alinejad and Ahmad Batebi delivered harrowing testimony detailing abuse by the Islamic Republic and urged stronger international action",
    "link": "https://www.thehindubusinessline.com/news/world/us-to-iran-all-options-are-on-the-table-at-un-emergency-meet/article70513178.ece",
    "timestamp": "2026-01-16T01:33:06Z"
  },
  {
    "title": "Putin ready to make Ukraine peace deal, Zelenskyy holding it up: Trump",
    "description": "Europe News: WASHINGTON: US President Donald Trump said that Ukraine - not Russia - is holding up a potential peace deal, rhetoric that stands in marked contrast t.",
    "link": "https://timesofindia.indiatimes.com/world/europe/putin-ready-to-make-ukraine-peace-deal-zelenskyy-holding-it-up-trump/articleshow/126555359.cms",
    "timestamp": "2026-01-16T01:31:58Z"
  },
  {
    "title": "'Pretty pathetic!' Trump's plans to keep foreign leader's Nobel Prize sparks outrage",
    "description": "President Donald Trump admitted on Thursday that he intends to keep the Nobel Peace Prize presented to him, even though it doesn't bear his name. Venezuelan opposition leader Maria Corina Machado traveled to Washington, D.C. on Thursday to present Trump with …",
    "link": "https://www.rawstory.com/trump-2674900143/",
    "timestamp": "2026-01-16T01:31:16Z"
  },
  {
    "title": "Mint Quick Edit | Trump’s Greenland game pushes Nato to a moment of reckoning: Could it crack up?",
    "description": "Trump looks unlikely to back off on taking over this Arctic island even as European forces head there on a plausibly dual mission. Is the Nato alliance on the verge of a rupture that could tilt geopolitics in favour of America’s adversaries?",
    "link": "https://www.livemint.com/opinion/online-views/mint-quick-edit-trump-greenland-game-nato-moment-of-reckoning-11768492365155.html",
    "timestamp": "2026-01-16T01:30:25Z"
  },
  {
    "title": "Another 340 firms approved to bid on Golden Dome work worth up to $151B",
    "description": "All but a handful of the 2,400-plus companies who sought approval have received it.",
    "link": "https://www.defenseone.com/business/2026/01/another-340-firms-approved-bid-golden-dome-work-worth-151b/410743/",
    "timestamp": "2026-01-16T01:28:26Z"
  },
  {
    "title": "CNBC Daily Open: TSMC earnings draw investors' eyes back to AI",
    "description": "Thursday offered markets a rare respite from nonstop geopolitical upheaval. Yet the week's headlines still reflected larger global dynamics.",
    "link": "https://www.cnbc.com/2026/01/16/cnbc-daily-open-tsmc-earnings-draw-investors-eyes-back-to-ai.html",
    "timestamp": "2026-01-16T01:27:32Z"
  },
  {
    "title": "Iran protests appear smothered after crackdown, prolonged internet outage",
    "description": "Iran’s protests appear smothered after a deadly crackdown as US, G7 and EU weigh new sanctions, Tehran shuts airspace and the UN meets on Iran.",
    "link": "https://www.thehindubusinessline.com/news/world/iran-protests-appear-smothered-after-crackdown-prolonged-internet-outage/article70513174.ece",
    "timestamp": "2026-01-16T01:25:12Z"
  },
  {
    "title": "US and Taiwan reach trade deal, with semiconductor chips and China in focus",
    "description": "The U.S. and Taiwan have finalized a trade deal cutting tariffs on Taiwanese semiconductor exports and encouraging U.S. investment. This agreement aims to boost domestic chip production, with Taiwanese companies committing billions to expand operations in the…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-and-taiwan-reach-trade-deal-with-semiconductor-chips-and-china-in-focus/articleshow/126555320.cms",
    "timestamp": "2026-01-16T01:23:28Z"
  },
  {
    "title": "Trump threatens to use 'Insurrection Act', deploy military to end protests in Minneapolis",
    "description": "President Trump threatened to invoke the Insurrection Act to quell protests against federal immigration officers in Minneapolis, following a shooting incident. Governor Walz urged de-escalation, while the Attorney General vowed legal challenges to the federal…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-threatens-to-use-insurrection-act-deploy-military-to-end-protests-in-minneapolis/articleshow/126555307.cms",
    "timestamp": "2026-01-16T01:20:57Z"
  },
  {
    "title": "Greenlander Opposes America Taking Over His Island Because He Hunts ‘Cute’ Whales, Seals",
    "description": "A Greenlander said he is against the U.S. gaining control of his island because he's afraid a takeover would upend his ability to hunt whales and seals.",
    "link": "https://dailycaller.com/2026/01/15/greenland-trump-takeover-whales-seals/",
    "timestamp": "2026-01-16T01:16:05Z"
  },
  {
    "title": "How Minneapolis rioters are forcing Trump’s hand with the Insurrection Act",
    "description": "Minnesota’s elected officials can’t help themselves — they keep portraying federal law-enforcement officers as an alien, invading force, bringing on the Insurrection Act.",
    "link": "https://nypost.com/2026/01/15/opinion/how-minneapolis-rioters-are-forcing-trumps-hand-with-the-insurrection-act/",
    "timestamp": "2026-01-16T01:15:36Z"
  },
  {
    "title": "From auction blocks to Trump’s hands: The Nobel medal has been sold before for millions",
    "description": "Nobel Prizes are fetching millions at auctions. Dmitry Muratov sold his for over 100 million dollars. James Watson and Francis Crick also sold theirs. This has led to ethical debates. Maria Corina Machado offered to share hers with Donald Trump. The Nobel Com…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-auction-blocks-to-trumps-hands-the-nobel-medal-has-been-sold-before-for-millions/articleshow/126555261.cms",
    "timestamp": "2026-01-16T01:14:39Z"
  },
  {
    "title": "'Greatest gaffe ever': Trump official torched by MS NOW host after Marie Antoinette moment",
    "description": "President Donald Trump's Agriculture Secretary's advice to Americans on how to eat affordably is clueless and insulting, MS NOW's Ari Melber said on Thursday night's \"The Beat\" — even comparing it to the almost certainly apocryphal tale of French monarch Mari…",
    "link": "https://www.rawstory.com/brooke-rollins-2674900041/",
    "timestamp": "2026-01-16T01:11:35Z"
  },
  {
    "title": "Trump's tariffs could be undone by one conservative doctrine: 'Life or death'",
    "description": "The Supreme Court is poised to rule soon on President Donald Trump’s use of a 1977 emergency wartime law to impose sweeping tariffs on most U.S. countries.",
    "link": "https://www.foxnews.com/politics/trumps-tariffs-could-be-undone-by-one-conservative-doctrine-life-death",
    "timestamp": "2026-01-16T01:11:31Z"
  },
  {
    "title": "Trump says he is backing 'newly appointed Palestinian Technocratic Government' in Gaza",
    "description": "President Donald Trump announced his backing for a newly appointed Palestinian Technocratic Government in Gaza, named the National Committee for the Administration of Gaza. Trump stated this government, supported by the Board's High Representative, will gover…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-he-is-backing-newly-appointed-palestinian-technocratic-government-in-gaza/articleshow/126555240.cms",
    "timestamp": "2026-01-16T01:10:22Z"
  },
  {
    "title": "Asian stocks head for fourth weekly gains as tech shares climb",
    "description": "Asian stocks are on track for their best weekly run since May. Technology shares are reaching new highs, driven by strong investor interest in artificial intelligence. This surge follows positive news from Taiwan Semiconductor Manufacturing Company, boosting …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-head-for-fourth-weekly-gain-on-tech/articleshow/126555221.cms",
    "timestamp": "2026-01-16T01:05:46Z"
  },
  {
    "title": "Trump met with stunned silence as he mocks health of cancer victim Joe Biden - NewsBreak",
    "description": "Donald Trump has once again taken the opportunity to mock his predecessor Joe Biden by embarking on a mock coughing fit",
    "link": "https://www.newsbreak.com/share/4441595748947-trump-met-with-stunned-silence-as-he-mocks-health-of-cancer-victim-joe-biden?s=a2&amp;share_destination_id=MjU3MzYyMjQ3LTE3Njg1MjUxMzA5MTY%3D&amp;pd=0HPrfzxu&amp;hl=en_US&amp;send_time=1768525130&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.1.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-16T01:03:09Z"
  },
  {
    "title": "Iran, Israel And The United States All Say That They Are Ready For War",
    "description": "Things are getting very tense in the Middle East.  The Islamic radicals that are ruling Iran believe that the United States and Israel intend to use the mass protests that have been going on for nearly two weeks to try to overthrow their regime.  If Ayatollah…",
    "link": "https://www.activistpost.com/iran-israel-and-the-united-states-all-say-that-they-are-ready-for-war/",
    "timestamp": "2026-01-16T01:00:00Z"
  },
  {
    "title": "Thanks to 'tariffs'?: Donald Trump claims there is 'virtually no inflation' in America",
    "description": "Donald Trump stated his administration's tariffs generated significant revenue and boosted the economy. He claimed hundreds of billions of dollars entered the US Treasury. Trump asserted this policy helped curb inflation and strengthened national security. He…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thanks-to-tariffs-donald-trump-claims-there-is-virtually-no-inflation-in-america/articleshow/126555188.cms",
    "timestamp": "2026-01-16T00:57:16Z"
  },
  {
    "title": "EXCLUSIVE: Meet the Elite, Brutal Greenland 'Dogs of War' Soldiers Gearing Up to Face Down U.S. Forces if Donald Trump Unleashes Invasion on Oil-Rich Island",
    "description": "Denmark's most unconventional special forces unit, is finding itself thrust into global attention as talk of a U.S. move on Greenland intensifies.",
    "link": "https://radaronline.com/p/donald-trump-greenland-dogs-of-war-soldiers-face-us-invasion/",
    "timestamp": "2026-01-16T00:48:57Z"
  },
  {
    "title": "'Stunning moment': CNN host taken aback as Trump's 'obsession' comes to the White House",
    "description": "The arrival of Venezuelan opposition leader Maria Corina Machado at the White House on Thursday was a \"stunning moment\" in history, according to one CNN anchor. Machado traveled to Washington, D.C., to meet with President Donald Trump amid the U.S.'s ongoing …",
    "link": "https://www.rawstory.com/trump-2674900123/",
    "timestamp": "2026-01-16T00:45:37Z"
  },
  {
    "title": "Trump announces 'board of peace' formed for Gaza",
    "description": "WASHINGTON: US President Donald Trump on Thursday (Jan 15) announced the formation of a Gaza \"board of peace,\" a key phase two element of a US-backed plan to end the war in the Palestinian territory.\"It is my Great Honor to announce that THE BOARD OF PEACE ha…",
    "link": "https://www.channelnewsasia.com/world/board-peace-gaza-peace-plan-trump-5862736",
    "timestamp": "2026-01-16T00:43:51Z"
  },
  {
    "title": "The Minnesota War Zone Is Trump’s Most Trumpian Accomplishment",
    "description": "Susan B. Glasser on Minnesota’s role in the pantheon of President Donald Trump’s assorted wars, after the killing of Renee Good by an ICE agent sparked protests.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/the-minnesota-war-zone-is-trumps-most-trumpian-accomplishment",
    "timestamp": "2026-01-16T00:43:08Z"
  },
  {
    "title": "Trump finally gets a Nobel? Venezuela's Machado 'presents' peace prize medal to US President",
    "description": "Venezuelan opposition leader Maria Corina Machado said Thursday she \"presented\" her Nobel Peace Prize medal to US President Donald Trump, who has openly coveted the award that the Nobel committee says cannot be transferred. \"I presented the president of the U…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-finally-gets-a-nobel-venezuelas-machado-presents-peace-prize-medal-to-us-president/articleshow/126555142.cms",
    "timestamp": "2026-01-16T00:43:00Z"
  },
  {
    "title": "Critics Say Trump 'Joke Healthcare Plan' Nothing But a 'Con' of the American People",
    "description": "US President Donald Trump on Thursday announced a \"Great Healthcare Plan\" that critics panned for being \"short on details,\" arguing that—contrary to White House claims—the scheme will lead to higher consumer costs and less care.Trump called on Congress to pas…",
    "link": "https://www.commondreams.org/news/trump-healthcare-plan-joke",
    "timestamp": "2026-01-16T00:42:58Z"
  },
  {
    "title": "Trump claims all the U.S. automakers are ‘doing great.’ Gretchen Whitmer says ‘this will only get worse without a serious shift’",
    "description": "“America stands more alone than she has in decades,” the Michigan governor said at the Detroit Auto Show.",
    "link": "https://fortune.com/2026/01/15/gretchen-whitmer-warns-china-electric-vehicles-competition-will-only-get-worse/",
    "timestamp": "2026-01-16T00:41:14Z"
  },
  {
    "title": "'We were in real danger': Australian who fled Iran recalls night crackdown arrived",
    "description": "On a visit to his hometown outside Tehran, this Iranian Australian joined the protests last Thursday night, then the regime's suppression methods turned from tear gas to live fire.",
    "link": "https://www.abc.net.au/news/2026-01-16/iranian-australian-escapes-crackdown-says-different-this-time/106232882",
    "timestamp": "2026-01-16T00:39:15Z"
  },
  {
    "title": "Cynical reason Jacob Frey and Tim Walz chose now to stop calling for chaos",
    "description": "Minneapolis Mayor Jacob Frey launched a remarkable 180 late Wednesday: “I’m calling for peace,” he announced after an ICE agent shot an illegal Venezuelan who’d tried to murder him after a car chase.",
    "link": "https://nypost.com/2026/01/15/opinion/cynical-reason-jacob-frey-and-tim-walz-chose-now-to-stop-calling-for-chaos/",
    "timestamp": "2026-01-16T00:37:10Z"
  },
  {
    "title": "The Pitt Season 2: Check Out Our S02E02: \"8:00 A.M.\" Preview",
    "description": "It goes without saying that the second season of EP John Wells and series creator/showrunner R. Scott Gemmill's Noah Wyle-starring and executive-producing The Pitt wasted little time reminding us why the HBO Max series has been pulling in big numbers and huge…",
    "link": "https://bleedingcool.com/tv/the-pitt-season-2-check-out-our-s02e02-800-a-m-preview/",
    "timestamp": "2026-01-16T00:37:07Z"
  },
  {
    "title": "Trump Will Keep Nobel Peace Prize Medal Offered by María Corina Machado (NOTUS)",
    "description": "NOTUS:\nTrump Will Keep Nobel Peace Prize Medal Offered by María Corina Machado  —  The extraordinary gift was given during a more than two-hour meeting between the two leaders at the White House Thursday afternoon.  — Copy  —  President Donald Trump will keep…",
    "link": "https://www.memeorandum.com/260115/p140",
    "timestamp": "2026-01-16T00:30:01Z"
  },
  {
    "title": "Trump’s Iran quandary is a question of strategic warfare — and showbiz",
    "description": "A well-done show of force overawes an opponent, but a misfire signals weakness and escalates conflict — making the prospect of a strike on Iran a major challenge.",
    "link": "https://nypost.com/2026/01/15/opinion/trumps-iran-quandary-is-a-question-of-strategic-warfare-and-showbiz/",
    "timestamp": "2026-01-16T00:23:36Z"
  },
  {
    "title": "US announces 'major sporting event' exemptions from broad visa bans",
    "description": "The Trump administration reveals the sporting events that athletes, coaches and support staff can attend in the US despite recent visa bans.",
    "link": "https://www.abc.net.au/news/2026-01-16/sporting-event-exemptions-us-visa-ban-trump/106236490",
    "timestamp": "2026-01-16T00:21:53Z"
  },
  {
    "title": "Trump Hosts Back-to-Back Stanley Cup Champion Florida Panthers at White House",
    "description": "President Donald Trump hosted the Florida Panthers at the White House on Thursday to celebrate their second consecutive Stanley Cup victory. \nThe post Trump Hosts Back-to-Back Stanley Cup Champion Florida Panthers at White House appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/15/trump-hosts-back-to-back-stanley-cup-champion-florida-panthers-at-white-house/",
    "timestamp": "2026-01-16T00:21:25Z"
  },
  {
    "title": "'What a waste': Trump ally under fire from Senate Republican as Iran lifeline cut off",
    "description": "Sen. Mitch McConnell (R-KY) is not happy with President Donald Trump's U.S. Agency for Global Media, accusing it of backing down from giving vital information to protesters in Iran.This comes as Iran's Islamic Republic regime is locked in an existential crisi…",
    "link": "https://www.rawstory.com/mitch-mcconnell-2674899996/",
    "timestamp": "2026-01-16T00:21:21Z"
  },
  {
    "title": "Inside The Invasion Of Minneapolis",
    "description": "Trump's agents bring violence and terror. Everyday people are responding with cameras, whistles and defiance.",
    "link": "https://www.huffpost.com/entry/minneapolis-trump-ice-local-resistance_n_6966ad39e4b0dd199b1aa10d",
    "timestamp": "2026-01-16T00:20:58Z"
  },
  {
    "title": "Trump, Schumer hold rare White House meeting (Jordain Carney/Politico)",
    "description": "Jordain Carney / Politico:\nTrump, Schumer hold rare White House meeting  —  President Donald Trump met with Senate Minority Leader Chuck Schumer on Thursday — a rare one-on-one meeting between the two native New Yorkers.  The two have shadow-boxed repeatedly …",
    "link": "https://www.memeorandum.com/260115/p137",
    "timestamp": "2026-01-16T00:20:00Z"
  },
  {
    "title": "Trump Moves to Make Data Centers Pay for Surging Power Costs (Bloomberg)",
    "description": "Bloomberg:\nTrump Moves to Make Data Centers Pay for Surging Power Costs  —  President Donald Trump and US Northeast governors will direct the nation's largest grid operator to hold an emergency power auction that would force technology giants to pay for the c…",
    "link": "https://www.memeorandum.com/260115/p139",
    "timestamp": "2026-01-16T00:20:00Z"
  },
  {
    "title": "Blaming 'wine moms' for ICE protests is an old tactic with a new target",
    "description": "Fox News posted a column on Sunday singling out \"organized gangs of wine moms\" for Renee Good's death at the hands of ICE agents. It's part of what experts say is a bigger, concerning and familiar change in the language used by the Trump administration and it…",
    "link": "https://www.cbc.ca/news/world/renee-good-killed-wine-moms-9.7046379",
    "timestamp": "2026-01-16T00:17:16Z"
  },
  {
    "title": "Democrats hope a blue wave washes over Wisconsin and gives them total control of battleground state",
    "description": "Democrats think new district boundaries will enhance their odds of taking the majority there.",
    "link": "https://www.bostonherald.com/2026/01/15/us-election-2026-wisconsin-democrats/",
    "timestamp": "2026-01-16T00:16:47Z"
  },
  {
    "title": "Live updates: Trump meets with Venezuelan opposition leader (Associated Press)",
    "description": "Associated Press:\nLive updates: Trump meets with Venezuelan opposition leader  —  Venezuelan opposition leader María Corina Machado discussed her country's future with U.S. President Donald Trump at the White House on Thursday, even though he has dismissed he…",
    "link": "https://www.memeorandum.com/260115/p136",
    "timestamp": "2026-01-16T00:15:01Z"
  },
  {
    "title": "Congress passes bill to fund U.S. science agencies, rebuffing Trump’s requested cuts",
    "description": "In a rebuff of the Trump administration’s proposal to drastically cut funding for federal science agencies, the Senate voted on Thursday to provide billions more to NOAA, NASA and the National Science Foundation than the president had asked for.",
    "link": "https://www.nbcnews.com/politics/politics-news/congress-passes-bill-fund-us-science-agencies-rebuffing-trumps-request-rcna254291",
    "timestamp": "2026-01-16T00:12:35Z"
  },
  {
    "title": "‘All options are on the table,’ US warns Iran at UN over crackdown on protests",
    "description": "US ambassador to the United Nations Mike Waltz said President Donald Trump was prepared to act if needed to stop the violence.",
    "link": "https://indianexpress.com/article/world/all-options-are-on-the-table-us-warns-iran-at-un-over-crackdown-on-protests-10476692/",
    "timestamp": "2026-01-16T00:09:20Z"
  },
  {
    "title": "Scott Jennings Says ICE Agents In Minneapolis Expected To Exhibit Standard Of Behavior Most People Can’t Meet",
    "description": "CNN senior political commentator Scott Jennings pushed back on criticism of federal immigration enforcement Thursday.",
    "link": "https://dailycaller.com/2026/01/15/scott-jennings-ice-agents-minneapolis-exhibit-standard-behavior/",
    "timestamp": "2026-01-16T00:08:31Z"
  },
  {
    "title": "Trump says he is backing ‘newly appointed Palestinian Technocratic Government’ in Gaza",
    "description": "Jan 15 (Reuters) - U.S. President Donald Trump on Thursday said he is backing “a newly appointed Palestinian Technocratic Government” in Gaza.“As Chairman of the Board of… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/16/trump-says-he-is-backing-newly-appointed-palestinian-technocratic-government-in-gaza",
    "timestamp": "2026-01-16T00:05:31Z"
  },
  {
    "title": "Top ICE official resigns to seek battleground congressional seat in Ohio",
    "description": "Former ICE Deputy Director Madison Sheahan accused Democrat Marcy Kaptur of “excuses and failure.\"",
    "link": "https://www.bostonherald.com/2026/01/15/us-election-2026-congress-ohio-ice-official/",
    "timestamp": "2026-01-16T00:05:29Z"
  },
  {
    "title": "President Trump Unveils The Great Healthcare Plan to Lower Costs and Deliver Money Directly to the People (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nPresident Trump Unveils The Great Healthcare Plan to Lower Costs and Deliver Money Directly to the People  —  President Donald J. Trump's Great Healthcare Plan is a broad healthcare initiative that will slash presc…",
    "link": "https://www.memeorandum.com/260115/p133",
    "timestamp": "2026-01-16T00:05:02Z"
  },
  {
    "title": "Judge deals blow to the Trump Justice Department's use of the Civil Rights Act to 'clean' voter rolls (Tierney Sneed/CNN)",
    "description": "Tierney Sneed / CNN:\nJudge deals blow to the Trump Justice Department's use of the Civil Rights Act to ‘clean’ voter rolls  —  Federal agencies Human rights Voting rights Donald Trump  —  The Trump administration's sweeping legal effort to obtain Americans' s…",
    "link": "https://www.memeorandum.com/260115/p134",
    "timestamp": "2026-01-16T00:05:02Z"
  },
  {
    "title": "Ambassador Waltz: Trump ready to act to 'stop the slaughter' in Iran",
    "description": "US Ambassador tells UN that “all options are on the table\" to stop Iran’s killings, blasting the regime.",
    "link": "https://www.israelnationalnews.com/news/420981",
    "timestamp": "2026-01-16T00:04:05Z"
  },
  {
    "title": "What we know about Ford autoworker's confrontation with Trump",
    "description": "A video shows the president flipping off a heckler during a visit to a Ford plant in Michigan.",
    "link": "https://www.snopes.com//news/2026/01/15/trump-flip-off-ford-worker/",
    "timestamp": "2026-01-16T00:04:00Z"
  },
  {
    "title": "RFK Jr Startled by Trump’s Ability to Remain Alive Despite Dumpster-Tier Diet",
    "description": "\"I don't know how he's alive, but he is.\"\nThe post RFK Jr Startled by Trump’s Ability to Remain Alive Despite Dumpster-Tier Diet appeared first on Futurism.",
    "link": "http://futurism.com/future-society/rfk-trump-diet-health",
    "timestamp": "2026-01-16T00:01:00Z"
  },
  {
    "title": "War Powers Resolution: The Senate Had One Job",
    "description": "On January 14, a “war powers resolution” went down to defeat in the US Senate on a 50-50 vote, with vice president JD Vance breaking the tie. The resolution, which would have required US president Donald Trump to at least casually mention to Congress that he …",
    "link": "https://original.antiwar.com/thomas-knapp/2026/01/15/war-powers-resolution-the-senate-had-one-job/",
    "timestamp": "2026-01-16T00:00:13Z"
  },
  {
    "title": "US drops China drone proposal; Taiwan suppliers press ahead",
    "description": "The US Department of Commerce has withdrawn a previously proposed plan to restrict imports of Chinese-made drones, a move that some observers view as a goodwill signal ahead of an expected meeting between US President Donald Trump and Chinese President Xi Jin…",
    "link": "https://www.digitimes.com/news/a20260114PD242/taiwan-policy-market-2025-fcc.html",
    "timestamp": "2026-01-15T23:59:29Z"
  },
  {
    "title": "Expert alarmed as Trump now taking a page from ISIS: 'Never seen anything like this'",
    "description": "A propaganda expert called out President Donald Trump's administration for \"taking a page from ISIS\" in social media campaigns boosting its immigration operations.Robert Page, a professor of political science at the University of Chicago, joined CNN's Jake Ta…",
    "link": "https://www.rawstory.com/trump-2674900040/",
    "timestamp": "2026-01-15T23:59:28Z"
  },
  {
    "title": "Trump Adviser Says President Is Creating ‘The New World Order’",
    "description": "Kevin Hassett, the director of the National Economic Council, boasted on Fox Business that President Donald Trump was \"creating\" the \"New World Order.\"\nThe post Trump Adviser Says President Is Creating ‘The New World Order’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-adviser-says-president-is-creating-the-new-world-order/",
    "timestamp": "2026-01-15T23:59:12Z"
  },
  {
    "title": "Counter-insurgency campaigns: US votes $413m for security operations in Nigeria, others",
    "description": "The US plans to spend $413m on counter-insurgency and security operations in Nigeria and other African nations to combat worsening regional insecurity.\n\nRead More: https://punchng.com/counter-insurgency-campaigns-us-votes-413m-for-security-operations-in-niger…",
    "link": "https://punchng.com/counter-insurgency-campaigns-us-votes-413m-for-security-operations-in-nigeria-others/",
    "timestamp": "2026-01-15T23:55:52Z"
  },
  {
    "title": "The Bob Cesca Podcast: The Yamsack Bramble Incident of 1919",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: The Yamsack Bramble Incident of 1919 -- Google AI says Bob is married to Stephanie Miller. Donald threatened to invoke the Insurrection Act again. Another ICE shooting in Minnesota. Stephen Mi…",
    "link": "https://littlegreenfootballs.com/article/55211_The_Bob_Cesca_Podcast-_The_Yam",
    "timestamp": "2026-01-15T23:53:40Z"
  },
  {
    "title": "‘Rats Fleeing the Ship’: Iran’s Ruling Elites 'Frantically Wiring' Millions Abroad, Bessent Says, as New Sanctions Hit",
    "description": "Treasury Secretary Scott Bessent announced sweeping new sanctions Thursday on senior Iranian officials and regime-linked financial networks, saying Tehran’s ruling elite are “rats fleeing the ship” as they frantically wire tens of millions of dollars out of t…",
    "link": "https://www.breitbart.com/politics/2026/01/15/rats-fleeing-the-ship-irans-ruling-elites-frantically-wiring-millions-abroad-bessent-says-as-new-sanctions-hit/",
    "timestamp": "2026-01-15T23:49:19Z"
  },
  {
    "title": "Maria Corina Machado Presented Her Nobel Peace Prize to Trump",
    "description": "Although President Donald Trump was disappointed about losing out on his hunt for a Nobel Peace Prize last year, he got a taste of how it felt to have one Thursday when Maria Corina Machado presented him with her medal. The Venezuelan opposition…\n Permalink",
    "link": "https://www.tmz.com/2026/01/15/maria-corina-machado-presents-prize-to-trump/",
    "timestamp": "2026-01-15T23:49:12Z"
  },
  {
    "title": "White House says 25% semiconductor tariffs a 'phase one' action",
    "description": "WASHINGTON, Jan 15 : The U.S. Commerce Department's 25 per cent national security tariff on certain high-end semiconductors announced on Wednesday is a \"phase one\" action to protect the sector and could be followed by other announcements pending negotiations …",
    "link": "https://www.channelnewsasia.com/business/white-house-says-25-semiconductor-tariffs-phase-one-action-5862656",
    "timestamp": "2026-01-15T23:47:49Z"
  },
  {
    "title": "What would Harry Reid do? — THE FIGHTER — For the past year, Democrats ... (Samuel Benson/Politico)",
    "description": "Samuel Benson / Politico:\nWhat would Harry Reid do?  —  THE FIGHTER — For the past year, Democrats — out of power and largely leaderless — have strategized how to best fight back against Donald Trump.  In search of their own bare-knuckled fighter, it's become…",
    "link": "https://www.memeorandum.com/260115/p129",
    "timestamp": "2026-01-15T23:45:01Z"
  },
  {
    "title": "US names major sporting events other than World Cup, Olympics exempt from Trump visa ban",
    "description": "Other events and leagues could be added to the list.",
    "link": "https://www.bostonherald.com/2026/01/15/trump-visas-sports-events/",
    "timestamp": "2026-01-15T23:44:51Z"
  },
  {
    "title": "Trump announces launch of 'Board of Peace for Gaza' as Phase Two moves forward",
    "description": "Trump launches the “Board of Peace for Gaza\" as part of his peace plan. The names of the members will be made public at a later date.",
    "link": "https://www.israelnationalnews.com/news/420980",
    "timestamp": "2026-01-15T23:44:21Z"
  },
  {
    "title": "WATCH: Trump was 'simply joking' about canceling the election, Leavitt says",
    "description": "Asked about a comment President Donald Trump made earlier this week about canceling U.S. midterm elections, White House press secretary Karoline Leavitt said \"he was speaking facetiously.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-was-simply-joking-about-canceling-the-election-leavitt-says",
    "timestamp": "2026-01-15T23:41:13Z"
  },
  {
    "title": "Hungary Reaffirms Its Global Strategy of National Sovereignty and Alliances Outside the Traditional Liberal Order Amid Internal Tensions and International Criticism",
    "description": "This is a Gateway Hispanic article.\nThe post Hungary Reaffirms Its Global Strategy of National Sovereignty and Alliances Outside the Traditional Liberal Order Amid Internal Tensions and International Criticism appeared first on The Gateway Pundit.",
    "link": "https://gatewayhispanic.com/2026/01/hungary-reaffirms-its-global-strategy-national-sovereignty-alliances/",
    "timestamp": "2026-01-15T23:40:00Z"
  },
  {
    "title": "Trump, Infantino and World Cup 2026",
    "description": "Donald Trump’s visa bans and FIFA’s high ticket prices threaten to overshadow the World Cup 2026, making the beautiful game elitist and exclusionary for fa\n\nRead More: https://punchng.com/trump-infantino-and-world-cup-2026/",
    "link": "https://punchng.com/trump-infantino-and-world-cup-2026/",
    "timestamp": "2026-01-15T23:38:58Z"
  },
  {
    "title": "Trump's Approach to Global Leadership Is Making China Look Like the Safer Bet, Survey Finds",
    "description": "A broad international survey suggests that President Donald Trump's approach to global affairs has coincided with a growing perception that China, rather than the United States, represents the more stable and reliable power in a rapidly shifting world order.",
    "link": "https://www.ibtimes.com/trumps-approach-global-leadership-making-china-look-like-safer-bet-survey-finds-3795490",
    "timestamp": "2026-01-15T23:38:08Z"
  },
  {
    "title": "Donalds Has Commanding Lead in Vital Florida Race, Poll Shows",
    "description": "A new poll on the Florida’s gubernatorial race shows Rep. Byron Donalds, R-Fla., ahead of his primary challengers by 30% or more. The Mason-Dixon poll... Read More\nThe post Donalds Has Commanding Lead in Vital Florida Race, Poll Shows appeared first on The Da…",
    "link": "https://www.dailysignal.com/2026/01/15/donalds-has-commanding-lead-in-vital-florida-race-poll-shows/",
    "timestamp": "2026-01-15T23:37:08Z"
  },
  {
    "title": "Senate ACA funding talks fizzle as higher premiums for millions take effect for 2026",
    "description": "Negotiations to revive Obamacare funds have stalled, with optimism fading as open enrollment ends. Most Republicans want the funds to stay expired.",
    "link": "https://www.nbcnews.com/politics/congress/senate-aca-funding-talks-fizzle-higher-premiums-take-effect-millions-rcna254227",
    "timestamp": "2026-01-15T23:36:52Z"
  },
  {
    "title": "U.S Stock market's one of most consequential IPOs: How shares sell of Fannie Mae, Freddie Mac could reshape America's $12 trillion mortgage market",
    "description": "30-year mortgage rate currently sits at 6.06 per cent, down about a percentage point from where it was a year ago.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-stock-markets-one-of-most-consequential-ipos-how-shares-sell-of-fannie-mae-freddie-mac-could-reshape-americas-12-trillion-mortgage-market/articleshow/126554915.cms",
    "timestamp": "2026-01-15T23:36:39Z"
  },
  {
    "title": "Jamie Dimon says he called Warren Buffett after poaching his protégé",
    "description": "Dimon also said he would \"absolutely, positively, no chance, no way, no how for any reason\" serve as Fed Chair.",
    "link": "https://www.businessinsider.com/jamie-dimon-warren-buffett-todd-combs-fed-independence-2026-1",
    "timestamp": "2026-01-15T23:36:25Z"
  },
  {
    "title": "Threats to Iran spike 'volatility' - UN official",
    "description": "A senior UN official warned that threats of military action against Iran, like those made by US President Donald Trump, increased \"volatility\" in the protest-torn country.",
    "link": "https://www.rte.ie/news/world/2026/0115/1553377-un-iran/",
    "timestamp": "2026-01-15T23:34:12Z"
  },
  {
    "title": "Did David Muir 'snap' on air, warning of martial law and no midterms?",
    "description": "ABC news anchor David Muir snapped on air while discussing U.S. President Donald Trump in January 2026, warning of martial law and no midterms.",
    "link": "https://www.snopes.com//fact-check/david-muir-martial-law-warning/",
    "timestamp": "2026-01-15T23:34:00Z"
  },
  {
    "title": "WATCH: Machado tells reporters why she presented her Nobel Peace Prize to Trump",
    "description": "Venezuelan opposition leader María Corina Machado said she presented the medal to Trump \"as a recognition for his unique commitment with our freedom.\"",
    "link": "https://www.pbs.org/newshour/world/watch-machado-tells-reporters-why-she-presented-her-nobel-peace-prize-to-trump",
    "timestamp": "2026-01-15T23:32:51Z"
  },
  {
    "title": "Trump announces creation of ‘Board of Peace for Gaza,’ member list to follow",
    "description": "US President Donald Trump announced on Thursday night that the Board of Peace for Gaza has been created, adding that the names of the members would be made public at a later date.\"It is my Great Honor to announce that THE BOARD OF PEACE has been formed. The M…",
    "link": "https://www.israelnationalnews.com/flashes/674504",
    "timestamp": "2026-01-15T23:32:00Z"
  },
  {
    "title": "Senate passes more spending bills, but Homeland Security dispute looms",
    "description": "Lawmakers still must negotiate a spending bill for DHS amid soaring tensions on Capitol Hill.",
    "link": "https://www.bostonherald.com/2026/01/15/congress-budget-dhs-dispute/",
    "timestamp": "2026-01-15T23:30:44Z"
  },
  {
    "title": "What is the Insurrection Act?",
    "description": "(WLUK) -- President Donald Trump has threatened to use the Insurrection Act several times during his first and now second stint in the White House.The latest t",
    "link": "https://fox11online.com/news/local/what-is-the-insurrection-act",
    "timestamp": "2026-01-15T23:26:23Z"
  },
  {
    "title": "US and Taiwan sign $250B trade deal, cutting tariffs on Taiwanese goods",
    "description": "The deal aims to establish a strategic economic partnership and boost U.S. industrial infrastructure.",
    "link": "https://www.bostonherald.com/2026/01/15/taiwan-tsmc/",
    "timestamp": "2026-01-15T23:24:36Z"
  },
  {
    "title": "Trump Fears Midterm Defeat While Insisting US 'Shouldn't Even Have An Election' In 2026 Voting Cycle",
    "description": "President Trump claims his administration's success renders the 2026 midterms unnecessary, while admitting fears of a Republican defeat against historical trends and rising Democratic confidence.",
    "link": "https://www.ibtimes.com/trump-fears-midterm-defeat-while-insisting-us-shouldnt-even-have-election-2026-voting-cycle-3795419",
    "timestamp": "2026-01-15T23:24:22Z"
  },
  {
    "title": "John Fetterman Criticizes Dems Who Support The Term 'Abolish ICE': 'Party Must Resist The Destructive Tendencies'",
    "description": "Democratic Sen. John Fetterman criticized members of his party who support the term \"abolish ICE,\" saying the party \"must resist the destructive tendencies to push extreme positions.\"",
    "link": "https://www.ibtimes.com/john-fetterman-criticizes-dems-who-support-term-abolish-ice-party-must-resist-destructive-3795421",
    "timestamp": "2026-01-15T23:24:08Z"
  },
  {
    "title": "Colorado senators’ bid to save NCAR funding fails as U.S. Senate passes spending bills",
    "description": "“In the face of unrelenting political attacks from President Trump, we are standing together to protect institutions like NCAR that are vital to our state and our economy,\" Sen. John Hickenlooper said.",
    "link": "https://www.denverpost.com/2026/01/15/colorado-ncar-funding-john-hickenlooper-michael-bennet-senate/",
    "timestamp": "2026-01-15T23:24:05Z"
  },
  {
    "title": "Ludacris And Nelly Accused Of Chasing Cash Over Credibility With MAGA Festival Move",
    "description": "Ludacris and Nelly face fierce backlash after agreeing to perform at the Rock The Country festival, dubbed the 'MAGA Music Fest,' as fans accuse them of chasing cash over credibility in a polarised cultural moment.",
    "link": "https://www.ibtimes.com/ludacris-nelly-accused-chasing-cash-over-credibility-maga-festival-move-3795423",
    "timestamp": "2026-01-15T23:23:54Z"
  },
  {
    "title": "Venezuelan Opposition Leader Presents Nobel Peace Prize To Donald Trump",
    "description": "Maria Corina Machado gave Trump her Nobel as part of a high-stakes charm offensive.",
    "link": "https://www.huffpost.com/entry/trump-nobel-prize-maria-corina-machado_n_69696264e4b00edae2a418cc",
    "timestamp": "2026-01-15T23:23:50Z"
  },
  {
    "title": "Iran Dismisses Uprising as ‘Israeli Plot,’ Claims Protests Under Control",
    "description": "Iranian Foreign Minister Abbas Araghchi on Wednesday claimed the massive nationwide uprising against the regime he serves was an “Israeli plot” carried out by “ISIS-style terrorist operations,” and the regime has defeated these “terrorists” after three days o…",
    "link": "https://www.breitbart.com/middle-east/2026/01/15/iran-dismisses-uprising-as-israeli-plot-claims-protests-under-control/",
    "timestamp": "2026-01-15T23:23:13Z"
  },
  {
    "title": "Europe Sends Soldiers to Greenland as Trump Reignites Explosive US 'Ownership' Claims",
    "description": "European nations have begun deploying troops to Greenland as diplomatic tensions surge after United States President Donald Trump revived controversial claims that the U.S. must control the territory, drawing firm rejection from Denmark and Greenland and rais…",
    "link": "https://www.ibtimes.com/europe-sends-soldiers-greenland-trump-reignites-explosive-us-ownership-claims-3795426",
    "timestamp": "2026-01-15T23:23:09Z"
  },
  {
    "title": "Trump 'Makes Whole Milk Great Again' by Bringing It Back to Schools — Why It Was Banned to Start With",
    "description": "Trump signs Whole Milk for Healthy Kids Act that allows full-fat milk in schools, reversing 2010 Obama-era limits and promoting parental choice.",
    "link": "https://www.ibtimes.com/trump-makes-whole-milk-great-again-bringing-it-back-schools-why-it-was-banned-start-3795428",
    "timestamp": "2026-01-15T23:22:50Z"
  },
  {
    "title": "Venezuela’s Machado says she ‘presented’ Trump with Nobel medal",
    "description": "Venezuelan opposition leader Maria Corina Machado said Thursday she “presented” her Nobel Peace Prize medal to Donald Trump, in a bid to win over the US president who had sidelined her since overthrowing Nicolas Maduro. Her extraordinary gesture comes after T…",
    "link": "https://www.digitaljournal.com/world/venezuelas-machado-says-she-presented-trump-with-nobel-medal/article",
    "timestamp": "2026-01-15T23:22:20Z"
  },
  {
    "title": "Key Colombia guerrilla group backs pact to fight US, commander tells AFP",
    "description": "The commander of Colombia’s largest guerrilla group on Thursday backed calls for warring leftist militias to unite to repel any US military operations in the country. “If it’s to defend the homeland against foreign aggression, we’ll join the fight,” ELN leade…",
    "link": "https://www.digitaljournal.com/world/key-colombia-guerrilla-group-backs-pact-to-fight-us-commander-tells-afp/article",
    "timestamp": "2026-01-15T23:22:20Z"
  },
  {
    "title": "Venezuela's Machado says she 'presented' her Nobel medal to Trump",
    "description": "Venezuela's Machado says she 'presented' her Nobel medal to Trumptimesofmalta.com",
    "link": "https://timesofmalta.com/article/venezuela-machado-says-presented-nobel-medal-trump.1122566",
    "timestamp": "2026-01-15T23:17:00Z"
  }
]