[
  {
    "title": "‘All Made Up!’ Alan Dershowitz Says There’s ‘No Credible Evidence’ Epstein Accusers Were Sex Trafficked to Powerful Men",
    "description": "Alan Dershowitz, the former lawyer for sex offender Jeffrey Epstein, lashed out at several of Epstein's accusers, claiming their testimony was \"all made up.\"\nThe post ‘All Made Up!’ Alan Dershowitz Says There’s ‘No Credible Evidence’ Epstein Accusers Were Sex…",
    "link": "https://www.mediaite.com/media/tv/all-made-up-alan-dershowitz-says-theres-no-credible-evidence-epstein-accusers-were-sex-trafficked-to-powerful-men/",
    "timestamp": "2025-08-06T12:45:06Z"
  },
  {
    "title": "Donald Trump Suffers Legal Loss Over Billions of FEMA Funds",
    "description": "Court Halts Trump FEMA Cuts, Safeguards $4bn Disaster Prep Projects",
    "link": "https://www.newsweek.com/donald-trump-suffers-legal-loss-over-billions-fema-funds-2109587",
    "timestamp": "2025-08-06T12:45:04Z"
  },
  {
    "title": "Trump Is Sabotaging His Own AI Plan",
    "description": "And setting America back in a race he desperately wants to win.",
    "link": "https://www.theatlantic.com/international/archive/2025/08/trump-ai-china-nvidia/683769/",
    "timestamp": "2025-08-06T12:45:00Z"
  },
  {
    "title": "US sanctions on Russia could boomerang – CNN",
    "description": "Secondary sanctions on Russia’s trade partners could raise oil prices, inflation, and costs for US consumers, analysts have told CNN Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622559-us-sanctions-russia-could-backfire-cnn/",
    "timestamp": "2025-08-06T12:44:59Z"
  },
  {
    "title": "Detroit mayoral race is set: councilmember vs. pastor",
    "description": "Detroit city council president Mary Sheffield and pastor Solomon Kinloch advance to November general election for mayor after primary victory.",
    "link": "https://www.foxnews.com/politics/detroit-mayoral-race-set-councilmember-vs-pastor",
    "timestamp": "2025-08-06T12:44:34Z"
  },
  {
    "title": "What will be Trump's lasting White House legacy? It's not policy or politics.",
    "description": "Executive orders come and go. Laws, too. But a 90,000-square-foot ballroom? That's here to stay.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/06/trump-white-house-renovations-ballroom-legacy/85521497007/",
    "timestamp": "2025-08-06T12:44:13Z"
  },
  {
    "title": "Duchess of York Once Flew 1,500 Miles to Impress Tiger Woods, New Book Claims",
    "description": "In her new book, 'The Rise and Fall of the House of York' Sarah Ferguson reveals she flew 1,500 miles to meet the \"gorgeous\" golf legend Tiger Woods.",
    "link": "https://www.newsweek.com/sports/golf/duchess-york-flew-1500-miles-impress-tiger-woods-new-book-claims-2109480",
    "timestamp": "2025-08-06T12:44:10Z"
  },
  {
    "title": "Spain Drops F-35 Plans, Looks to European Alternatives",
    "description": "Despite the need to modernize, Spain shelves F-35 plans, leaving its Navy without a STOVL replacement. The purchase of F-35 Lightning II aircraft, the fifth-generation American stealth fighter, for the Spanish Armed Forces has been definitively shelved, accor…",
    "link": "https://theaviationist.com/2025/08/06/spain-f-35-plans/",
    "timestamp": "2025-08-06T12:44:09Z"
  },
  {
    "title": "Wednesday, August 6, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-august-6-2025/",
    "timestamp": "2025-08-06T12:43:57Z"
  },
  {
    "title": "Apple likely to announce more investment in America on Wednesday – White House economic adviser Hassett",
    "description": "White House economic adviser Kevin Hassett stated that Apple Inc. is expected to announce an investment on Wednesday, highlighting…\nThe post Apple likely to announce more investment in America on Wednesday – White House economic adviser Hassett appeared first…",
    "link": "https://macdailynews.com/2025/08/06/apple-likely-to-announce-more-investment-in-america-on-wednesday-white-house-economic-adviser-hassett/",
    "timestamp": "2025-08-06T12:40:40Z"
  },
  {
    "title": "Dialogue with US will prevail – Putin aide",
    "description": "Kirill Dmitriev’s comments came after the Russian president held a face-to-face meeting with Trump’s envoy, Steve Witkoff Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622563-dialogue-us-will-prevail/",
    "timestamp": "2025-08-06T12:40:39Z"
  },
  {
    "title": "George Soros, Beto O'Rourke behind funding for Dems fleeing Texas over GOP congressional map",
    "description": "Texas Democrats are get financial support from a Soros-backed group and Beto O'Rourke's organization after leaving state to prevent a redistricting vote.",
    "link": "https://www.foxnews.com/politics/george-soros-beto-orourke-behind-funding-dems-fleeing-texas-over-gop-congressional-map",
    "timestamp": "2025-08-06T12:32:19Z"
  },
  {
    "title": "Sydney Sweeney faces backlash at Americana premiere over controversial American Eagle jeans ad: ‘It’s racist’. Watch",
    "description": "The public discontent over the American Eagle jeans ad has poured onto the streets now, with people expressing their disappointment at Sydney Sweeney upfront, beyond social media.",
    "link": "https://indianexpress.com/article/entertainment/hollywood/sydney-sweeney-faces-backlash-americana-premiere-controversial-american-eagle-jeans-ad-racist-watch-10173123/",
    "timestamp": "2025-08-06T12:32:06Z"
  },
  {
    "title": "Trump says four candidates in running for Fed chair, rules out Bessent",
    "description": "United States President Donald Trump has ruled out Secretary of the Treasury Scott Bessent as his pick to replace Federal Reserve Chair Jerome Powell.\nTrump, who has repeatedly criticised Powell for not moving faster to lower interest rates, said on Tuesday t…",
    "link": "https://biztoc.com/x/98d5f568057ce8e9",
    "timestamp": "2025-08-06T12:31:36Z"
  },
  {
    "title": "Julie Chrisley Hints Todd's Mom Nanny Faye Had Recent Health Scare",
    "description": "Todd Chrisley’s mom, Nanny Faye, had a health scare after he and Julie Chrisley were released from prison. Faye, 81, joined her son and daughter-in-law on the Wednesday, August 6, episode of their “Chrisley Confessions 2.0” podcast. The trio discussed how Tod…",
    "link": "https://www.usmagazine.com/celebrity-news/news/julie-chrisley-hints-todds-mom-nanny-faye-had-recent-health-scare/#article",
    "timestamp": "2025-08-06T12:31:15Z"
  },
  {
    "title": "Apple to pledge $100 billion for US manufacturing, White House official says",
    "description": "WASHINGTON :Apple Inc will announce a domestic manufacturing pledge of $100 billion on Wednesday that will focus on bringing more manufacturing to the United States, a White House official said.The pledge would be a new financial commitment, the official said…",
    "link": "https://www.channelnewsasia.com/business/apple-pledge-100-billion-us-manufacturing-white-house-official-says-5280656",
    "timestamp": "2025-08-06T12:30:03Z"
  },
  {
    "title": "White House official: Apple to announce $100 billion pledge",
    "description": "WASHINGTON :Apple Inc will announce a domestic manufacturing pledge of $100 billion on Wednesday that will focus on bringing more manufacturing to the United States, a White House official said.The pledge would be a new financial commitment on top of what App…",
    "link": "https://www.channelnewsasia.com/business/white-house-official-apple-announce-100-billion-pledge-5280656",
    "timestamp": "2025-08-06T12:30:03Z"
  },
  {
    "title": "White House adviser: Apple likely to make investment commitment",
    "description": "WASHINGTON :White House economic adviser Kevin Hassett said Apple Inc was likely to make an investment announcement on Wednesday, as he discussed the financial pledges made by companies and countries under President Donald Trump.\"They're moving here in droves…",
    "link": "https://www.channelnewsasia.com/business/white-house-adviser-apple-likely-make-investment-commitment-5280656",
    "timestamp": "2025-08-06T12:30:03Z"
  },
  {
    "title": "All major Las Vegas Strip casinos are unionized, defying national trend",
    "description": "The Culinary Union’s success on the Strip is a notable exception in a national landscape where union membership overall is declining.",
    "link": "https://richmond.com/news/nation-world/business/article_b5224d27-344e-5bd7-9d39-bd752b68d458.html",
    "timestamp": "2025-08-06T12:30:00Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Calls BS on Trump After Confronting Him About Ghislaine Maxwell Transfer",
    "description": "Kaitlan Collins called BS on President Donald Trump hours after grilling him about the transfer of Ghislaine Maxwell to a minimum security prison.\nThe post CNN’s Kaitlan Collins Calls BS on Trump After Confronting Him About Ghislaine Maxwell Transfer first ap…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-calls-bs-on-trump-after-confronting-him-about-ghislaine-maxwell-transfer/",
    "timestamp": "2025-08-06T12:28:44Z"
  },
  {
    "title": "\"Coming Up Short\": Robert Reich on His Memoir, Rising U.S. Inequality & Fighting Against Bullies",
    "description": "We speak with former Labor Secretary Robert Reich about his new memoir, Coming Up Short, which tells his life story alongside the growth of inequality in America. Reich was born in 1946 as part of the baby-boom generation that enjoyed unprecedented levels of …",
    "link": "https://www.democracynow.org/2025/8/6/robert_reich_memoir",
    "timestamp": "2025-08-06T12:28:13Z"
  },
  {
    "title": "Eighty years after Hiroshima: how close is nuclear conflict?",
    "description": "Eight decades on from the first atomic bomb 'we have blundered into a new age of nuclear perils'",
    "link": "https://theweek.com/politics/hiroshima-how-close-is-nuclear-conflict",
    "timestamp": "2025-08-06T12:24:56Z"
  },
  {
    "title": "Trump's War on the Truth: Robert Reich on Firing of BLS Head & Push to Replace Fed Chair",
    "description": "We speak to former Labor Secretary Robert Reich about how President Trump’s firing of the head of the Bureau of Labor Statistics, hours after the agency released a weaker-than-expected jobs report, undermines a key agency. Trump claimed, without offering any …",
    "link": "https://www.democracynow.org/2025/8/6/robert_reich_bls",
    "timestamp": "2025-08-06T12:18:10Z"
  },
  {
    "title": "Trump's Texas ploy to boost GOP numbers could 'backfire hard' on Republicans: strategist",
    "description": "As Texas Republicans continue their efforts to redraw the state’s congressional district map in a way to boost GOP numbers in Congress, all at the behest of President Donald Trump, one political strategist suspects the plan may end up blowing up in the party’…",
    "link": "https://www.rawstory.com/midterm-elections-2026-2673862923/",
    "timestamp": "2025-08-06T12:17:01Z"
  },
  {
    "title": "Beto O'Rourke's group helping front costs of bolting Texas House Democrats",
    "description": "Members are racking up bills from travels to remain outside of state boundaries.",
    "link": "https://abcnews.go.com/Politics/beto-orourkes-group-helping-front-costs-bolting-texas/story?id=124397945",
    "timestamp": "2025-08-06T12:16:46Z"
  },
  {
    "title": "Bitcoin Penguins aim to be one of the top meme coins- with a Bitcoin backbone",
    "description": "BPENGU merges Bitcoin power with penguin meme hype for explosive growth potential. 15-stage presale offers up to 75% gains before September 2, 2025 launch. Global Bitcoin adoption adds macro momentum to BPENGU’s meme coin narrative. In a crypto market where m…",
    "link": "https://coinjournal.net/news/bitcoin-penguins-aim-to-be-one-of-the-top-meme-coins-with-a-bitcoin-backbone/",
    "timestamp": "2025-08-06T12:16:20Z"
  },
  {
    "title": "Diddy revisits Trump ties with high-stakes pardon push",
    "description": "As Sean “Diddy” Combs awaits sentencing following his federal conviction, his legal team has taken an unexpected step—reaching out to former President Donald Trump in hopes of securing a pardon. The 55-year-old music mogul, once known for his political critic…",
    "link": "https://rollingout.com/2025/08/06/diddy-trump-pardon-push/",
    "timestamp": "2025-08-06T12:15:33Z"
  },
  {
    "title": "Trump Confirms Tariffs on Chips Are Coming Soon",
    "description": "Trump says new chip tariffs are coming next week to boost US manufacturing. Experts warn this could raise prices on electronics.",
    "link": "https://www.androidheadlines.com/2025/08/trump-confirms-tariffs-on-chips-are-coming-soon.html",
    "timestamp": "2025-08-06T12:11:38Z"
  },
  {
    "title": "Charlamagne Tha God Responds to Trump Calling Him a ‘Racist’… “I Didn’t Mention Race”",
    "description": "After bashing Charlamagne Tha God on social media and labeling him a “racist”, Charlamagne used his ‘Donkey of the Day’ segment to respond to President Donald Trumps’ remarks. “He called me a sleazebag. I looked up the definition of sleazebag, says it’s a dis…",
    "link": "https://mediatakeout.com/charlamagne-tha-god-responds-to-trump-calling-him-a-racist-i-didnt-mention-race/",
    "timestamp": "2025-08-06T12:11:31Z"
  },
  {
    "title": "80 Years After Hiroshima and Nagasaki, Are We on the Verge of Another Nuclear War?",
    "description": "Eighty years ago, the U.S. dropped nuclear bombs on the civilian populations of Hiroshima and Nagasaki. There are now nine nuclear-armed nations, many in military confrontation with one another. It is quite remarkable that there has not been another nuclear w…",
    "link": "https://www.commondreams.org/opinion/another-nuclear-war",
    "timestamp": "2025-08-06T12:09:04Z"
  },
  {
    "title": "New NASA head wants to build a nuclear reactor on the moon – but why?",
    "description": "The acting administrator of NASA, Sean Duffy, announced a directive to build a powerful nuclear reactor on the moon, but it is unclear what it would power – or even if his plan is legal",
    "link": "https://www.newscientist.com/article/2491389-new-nasa-head-wants-to-build-a-nuclear-reactor-on-the-moon-but-why/",
    "timestamp": "2025-08-06T12:08:53Z"
  },
  {
    "title": "Trump suggests Vance 'most likely' Republican pick for 2028",
    "description": "WASHINGTON: United States President Donald Trump suggested on Tuesday (Aug 5) that Vice President JD Vance is \"most likely\" to secure the Republican party nomination for president in 2028. Trump has avoided naming a preferred successor and said in February th…",
    "link": "https://www.channelnewsasia.com/world/donald-trump-jd-vance-republican-party-nomination-president-2028-5280556",
    "timestamp": "2025-08-06T12:07:08Z"
  },
  {
    "title": "President praises ministers’ response to global dynamics",
    "description": "President Prabowo Subianto praised Coordinating Minister for Economic Affairs, Airlangga Hartarto, and other ministers holding economic portfolios in the Red ...",
    "link": "https://en.antaranews.com/news/371529/president-praises-ministers-response-to-global-dynamics",
    "timestamp": "2025-08-06T12:05:34Z"
  },
  {
    "title": "Bosnian Serb separatist leader stripped of electoral mandate after ban",
    "description": "SARAJEVO (Reuters) -Bosnia's election commission on Wednesday revoked the mandate of the separatist Bosnian Serb president after he rejected a court order jailing him for a year and banning him from political office for obstructing implementation of the 1995 …",
    "link": "https://www.thestar.com.my/news/world/2025/08/06/bosnian-serb-separatist-leader-stripped-of-electoral-mandate-after-ban",
    "timestamp": "2025-08-06T12:05:00Z"
  },
  {
    "title": "World's longest suspension bridge to link Sicily to Italy",
    "description": "Italy's government has approved a €13.5-billion-euro project to build the world's longest suspension bridge connecting the island of Sicily to the mainland.",
    "link": "https://www.rte.ie/news/world/2025/0806/1527196-italy-sicily-bridge/",
    "timestamp": "2025-08-06T12:00:21Z"
  },
  {
    "title": "Will Brazil Make Bitcoin History? Hearing Date Revealed",
    "description": "Brazil is gearing up for a major debate on adding Bitcoin to its national coffers. Reports have disclosed that the Chamber of Deputies will hold its first public hearing on August 20, 2025. Related Reading: Crypto Could Be Shielded By Trump’s Planned Executiv…",
    "link": "https://bitcoinist.com/will-brazil-make-bitcoin-history-hearing-date-revealed/",
    "timestamp": "2025-08-06T12:00:10Z"
  },
  {
    "title": "Colbert confronts JB Pritzker with map showing Illinois gerrymandering",
    "description": "Stephen Colbert showed Gov. JB Pritzker a map of Illinois on Tuesday that displayed gerrymandered districts during a discussion about the Texas GOP's efforts.",
    "link": "https://www.foxnews.com/media/colbert-confronts-jb-pritzker-map-showing-illinois-gerrymandering",
    "timestamp": "2025-08-06T12:00:07Z"
  },
  {
    "title": "Tweedledum and Tweedledumber: these two shameless GOP pols betray their state each day",
    "description": "Ohio Republican U.S. Sens. Bernie Moreno and Jon Husted both swore to uphold the Constitution of the United States and “bear true faith and allegiance to the same” before taking their seats. But their promised loyalty to the rule of law was quickly supplanted…",
    "link": "https://www.rawstory.com/ohio-senators/",
    "timestamp": "2025-08-06T12:00:03Z"
  },
  {
    "title": "‘Defending Paradise’: Julia Louis-Dreyfus Takes on Big Oil in California",
    "description": "‘The single largest threat to California’s coast’ may be an Exxon-backed oil company set to restart a pipeline that caused a massive 2015 spill.",
    "link": "http://www.rollingstone.com/politics/politics-features/julia-louis-dreyfus-oil-offshore-drilling-exxon-california-1235400793/",
    "timestamp": "2025-08-06T12:00:00Z"
  },
  {
    "title": "Will GOP Cuts to Public Broadcasting, Foreign Aid Make Liberals Generous Again?",
    "description": "Before politics overwhelmed the word, the primary meaning of “liberal” was “generous.” President Donald Trump and the Republican Congress have given political liberals a chance... Read More\nThe post Will GOP Cuts to Public Broadcasting, Foreign Aid Make Liber…",
    "link": "https://www.dailysignal.com/2025/08/06/will-gop-cuts-public-broadcasting-foreign-aid-make-liberals-generous-again/",
    "timestamp": "2025-08-06T12:00:00Z"
  },
  {
    "title": "Day 1,260 of WW3. Village in Kamchatka that sent half its male population to war in Ukraine is rewarded with a memorial. Orcs continue the atrocity hit parade, this time shooting a civilian near Pokrovsk. This is your Wednesday Ukraine War thread [News]",
    "description": "Day 1,260 of WW3. Village in Kamchatka that sent half its male population to war in Ukraine is rewarded with a memorial. Orcs continue the atrocity hit parade, this time shooting a civilian near Pokrovsk. This is your Wednesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13767620/Day-1260-of-WW3-Village-in-Kamchatka-that-sent-half-its-male-population-to-war-in-Ukraine-is-rewarded-with-a-memorial-Orcs-continue-atrocity-hit-parade-this-time-shooting-a-civilian-near-Pokrovsk-This-is-your-Wednesday-Ukraine-War-thread",
    "timestamp": "2025-08-06T12:00:00Z"
  },
  {
    "title": "Putin, Witkoff end meeting after three hours",
    "description": "Russian President Vladimir Putin finished his meeting with United States Special Envoy Steve Witkoff, Putin's press service said on Wednesday. The service did not reveal details of the meeting, which lasted around three hours. US President Donald Trump sugges…",
    "link": "https://freerepublic.com/focus/f-chat/4332971/posts",
    "timestamp": "2025-08-06T11:59:30Z"
  },
  {
    "title": "The Don reignites threat to take over city...",
    "description": "The Don reignites threat to take over city...\r\n\n \n \n \n (First column, 7th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:POLL: MUSK NOW MOST UNPOPULAR PUBLIC FIGURE IN USA...\r\nNWS hiring back positions cut by DOGE...\r\n'Big Balls' Beaten in DC...",
    "link": "https://www.cnn.com/2025/08/06/politics/trump-federal-take-over-dc-doge-coristine-assault",
    "timestamp": "2025-08-06T11:58:38Z"
  },
  {
    "title": "This ‘Isn’t Priced In’—SEC Reveals Radical ‘Project Crypto,’ A Bitcoin Price Game-Changer",
    "description": "Bitcoin and crypto traders have been warned the U.S. Securities and Exchange Commission’s (SEC) newly unveiled “Project Crypto” isn’t priced in...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/06/this-isnt-priced-in-sec-reveals-radical-project-crypto-a-bitcoin-price-game-changer/",
    "timestamp": "2025-08-06T11:57:11Z"
  },
  {
    "title": "Trump's special envoy meets Putin in Moscow to avert new US sanctions",
    "description": "According to CNN, Witkoff landed in Moscow on Wednesday morning and was greeted at the airport by Russia's investment envoy Kirill Dmitriev",
    "link": "https://www.thehindubusinessline.com/news/world/trumps-special-envoy-meets-putin-in-moscow-to-avert-new-us-sanctions/article69901334.ece",
    "timestamp": "2025-08-06T11:57:03Z"
  },
  {
    "title": "2 juveniles arrested in bloody DC attack on ex-DOGE worker known as ‘Big Balls’",
    "description": "Police in Washington, D.C., arrested two juveniles in connection with an alleged assault on a former DOGE worker during a carjacking attempt early Sunday.",
    "link": "https://www.foxnews.com/us/2-juveniles-arrested-bloody-dc-attack-ex-doge-worker-known-big-balls",
    "timestamp": "2025-08-06T11:52:49Z"
  },
  {
    "title": "Philippines to Solidify Its Web3 Stance at ASEAN 2026 – New Cryptos to Watch Before Global Hype",
    "description": "As the Philippines gears up to host the 44th ASEAN Summit in 2026, the Philippines’ Trade Secretary Cristina Roque and President Marcos Jr. are pushing to showcase the country’s strides in tech and innovation. With its growing reputation as one of Southeast A…",
    "link": "https://bitcoinist.com/new-cryptos-to-buy-before-phillipines-asean-2026/",
    "timestamp": "2025-08-06T11:51:28Z"
  },
  {
    "title": "Rwanda agrees to accept up to 250 migrants from the US",
    "description": "A deal with the administration of President Donald Trump followed a similar agreement with the UK, which was ultimately abandoned.",
    "link": "https://news.sky.com/story/rwanda-agrees-to-accept-up-to-250-migrants-from-the-us-13407743",
    "timestamp": "2025-08-06T11:51:00Z"
  },
  {
    "title": "The Voting Rights Act marks its 60th anniversary as its core provisions are being eroded",
    "description": "The Voting Rights Act was signed into law 60 years ago but has been slowly eroding for more than a decade",
    "link": "https://abcnews.go.com/Politics/wireStory/voting-rights-act-marks-60th-anniversary-core-provisions-124405027",
    "timestamp": "2025-08-06T11:50:29Z"
  },
  {
    "title": "Trump 2.0’s Mass Denaturalizations Will Make the US Less Diverse and Less Free",
    "description": "There are nearly 25 million naturalized citizens in the United States, accounting for 7% of the total population. Each and every one of them should be laser-focused on the Trump administration’s plans to denaturalize and deport as many of them as possible. De…",
    "link": "https://www.truthdig.com/articles/the-next-stage-denaturalize-and-deport/",
    "timestamp": "2025-08-06T11:49:04Z"
  },
  {
    "title": "Forbes Daily: Palantir Rides Hot Streak After A ‘Phenomenal’ Quarter",
    "description": "Today’s Forbes Daily newsletter covers Trump’s Fed chair candidates, Palantir’s rising share price, RFK cancels vaccine funding, GOP pushes for more on Epstein and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/08/06/forbes-daily-palantir-rides-hot-streak-after-a-phenomenal-quarter/",
    "timestamp": "2025-08-06T11:48:01Z"
  },
  {
    "title": "Trump allies still stuck in 'legal limbo' over attempt to steal the 2020 election: report",
    "description": "As Donald Trump goes blithely about in his second term, knowing he will never be prosecuted for attempting to incite an insurrection in 2020 because he lost that election, allies of the president are still facing charges for their part in trying to keep him i…",
    "link": "https://www.rawstory.com/trump-2020-election-theft-limbo/",
    "timestamp": "2025-08-06T11:47:23Z"
  },
  {
    "title": "Wedneday: Hili dialogue",
    "description": "Welcome to a Hump Day (“Andro Hump” in Malagasy): July 5, 2025, and National Root Beer Float Day. (This is also known as a “Black Cow”.)  Here’s one, and here’s an audio version with great electronic piano and trumpet solos: It’s also National Fresh Breath Da…",
    "link": "https://whyevolutionistrue.com/2025/08/06/wedneday-hili-dialogue-4/",
    "timestamp": "2025-08-06T11:45:16Z"
  },
  {
    "title": "Donald Trump wandered around the White House’s roof for no reason",
    "description": "My immortal orange cat is quite senile. He wanders around crying sometimes when he can’t find me (and I’m sitting in plain view). He crawls into weird places, and (I think) he gets lost sometimes inside the house and outside. I bring this up because I think D…",
    "link": "https://www.celebitchy.com/934633/donald_trump_wandered_around_the_white_houses_roof_for_no_reason/",
    "timestamp": "2025-08-06T11:43:52Z"
  },
  {
    "title": "Things to know about the Voting Rights Act and the cases that could unravel it",
    "description": "The Voting Rights Act of 1965 ended the discriminatory practices against Black voters that were prevalent in many states",
    "link": "https://abcnews.go.com/Politics/wireStory/things-voting-rights-act-cases-unravel-124405527",
    "timestamp": "2025-08-06T11:42:28Z"
  },
  {
    "title": "Markets Rebounding as Solid Earnings Outweigh Tariff and Stagflation Fears",
    "description": "Dow, S&P 500, and Nasdaq futures are rising in premarket trading as the stock market braces for another day of earnings and Trump tariff news.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-080625",
    "timestamp": "2025-08-06T11:41:14Z"
  },
  {
    "title": "Brooke Hogan: This is Why I Skipped My Dad’s Funeral…",
    "description": "Reading Time: 3 minutesBrooke Hogan did not attend her famous father's funeral this week. She tries to offer an explanation here.\nBrooke Hogan: This is Why I Skipped My Dad’s Funeral… was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/08/brooke-hogan-this-is-why-i-skipped-my-dads-funeral/",
    "timestamp": "2025-08-06T11:39:54Z"
  },
  {
    "title": "Trump tariffs on key sectors may outlast his presidency, warns JPMorgan's geopolitics arm",
    "description": "JPMorgan Chase's Center for Geopolitics predicts U.S. import tariffs will stabilise near 22%, with duties on strategic sectors remaining. This stance, driven by bipartisan support for enhancing the U.S. industrial base, makes a return to pre-Trump trade polic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-on-key-sectors-may-outlast-his-presidency-warns-jpmorgans-geopolitics-arm/articleshow/123142410.cms",
    "timestamp": "2025-08-06T11:38:54Z"
  },
  {
    "title": "Can Western Nations Be Saved?",
    "description": "Nations that denounce their own cultures, traditions, histories, and religions are not nations for long. A spate of massive anti-illegal-immigration protests has broken out across the United Kingdom. Indeed, one might say that the kingdom is increasingly unit…",
    "link": "https://freerepublic.com/focus/f-chat/4332968/posts",
    "timestamp": "2025-08-06T11:37:20Z"
  },
  {
    "title": "Transgender athlete debate rolls on six months after executive order",
    "description": "Six months after President Trump signed an executive order banning trans women from women's sports, these athletes are still trying to find ways to compete, and battles around their participation continue.",
    "link": "https://www.espn.com/olympics/story/_/id/45878971/six-months-president-trump-executive-order-transgender-athlete-debate-persists",
    "timestamp": "2025-08-06T11:35:36Z"
  },
  {
    "title": "Tesla’s Brand Crisis Goes Deeper Than Its Polarizing Leader",
    "description": "Tesla was a compelling example of how a brand can create meaning beyond its original product: It represented sustainability as an attitude.",
    "link": "https://www.adweek.com/brand-marketing/tesla-elon-musk-brand-crisis-polarizing-leader/",
    "timestamp": "2025-08-06T11:32:33Z"
  },
  {
    "title": "Iran, Iraq, now Russia: Should India keep shifting oil suppliers based on Trump’s logic of friends or foes? NITI member asks",
    "description": "A top Trump aide accuses India of funding Russia's war by buying discounted oil, sparking debate over energy security versus geopolitical alignment. India defends its actions, citing economic growth and the lack of alternatives to Russian oil. The US has resp…",
    "link": "https://economictimes.indiatimes.com/news/india/iran-iraq-now-russia-should-india-keep-shifting-oil-suppliers-based-on-trumps-logic-of-friends-or-foes-niti-member-asks/articleshow/123141215.cms",
    "timestamp": "2025-08-06T11:30:19Z"
  },
  {
    "title": "Burden of any rise in tariffs by US will fall on their low-income households: PM's Economic Advisory Council member",
    "description": "A day after former U.S. President Donald Trump declared plans to \"very substantially\" raise tariffs on India, Shamika Ravi, a member of the Economic Advisory Council to the Prime Minister, said the move would hurt low-income American households. She noted tha…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/burden-of-any-rise-in-tariffs-by-us-will-fall-on-their-low-income-households-pms-economic-advisory-council-member/articleshow/123142117.cms",
    "timestamp": "2025-08-06T11:26:13Z"
  },
  {
    "title": "Joe Scarborough Laughs Out Loud as He Mocks ‘Scared’ Texas GOP for ‘Rigging the Maps’",
    "description": "Scarborough laughing at Texas Republicans, accusing them of “rigging the maps” because they’re “scared” of being “crushed” by the Democrats in the midterms.\nThe post Joe Scarborough Laughs Out Loud as He Mocks ‘Scared’ Texas GOP for ‘Rigging the Maps’ first a…",
    "link": "https://www.mediaite.com/media/tv/joe-scarborough-laughs-out-loud-as-he-mocks-scared-texas-gop-for-rigging-the-maps/",
    "timestamp": "2025-08-06T11:25:26Z"
  },
  {
    "title": "Why Trump is so fixated on ‘debanking’",
    "description": "A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here.\nPresident Donald Trump is doubling down on “debanking” — a once-niche political issue that now appears deeply personal for him.\nWhile Trump’…",
    "link": "https://biztoc.com/x/ada327ba7b6dc480",
    "timestamp": "2025-08-06T11:24:32Z"
  },
  {
    "title": "The high summer of Donald Trump",
    "description": "In all likelihood, it is downhill for the US president from here",
    "link": "https://biztoc.com/x/270c645da0744945",
    "timestamp": "2025-08-06T11:24:24Z"
  },
  {
    "title": "The Voting Rights Act marks its 60th anniversary as its core provisions are being eroded",
    "description": "The Voting Rights Act was signed into law 60 years ago but has been slowly eroding for more than a decade",
    "link": "https://www.wsbradio.com/news/politics/voting-rights-act/DA7ONNGHSNBK5GKMYR7YG2OI6M/",
    "timestamp": "2025-08-06T11:24:19Z"
  },
  {
    "title": "If The Banks Will Not Deliver Digital Identity, Perhaps Crypto Will",
    "description": "With banks doing nothing, perhaps it will be the crypto world that will rise to meet this challenge of digital identiy by using new technology to bring a new approach.",
    "link": "https://www.forbes.com/sites/davidbirch/2025/08/06/if-the-banks-will-not-deliver-digital-identity-perhaps-crypto-will/",
    "timestamp": "2025-08-06T11:23:42Z"
  },
  {
    "title": "Gov. Abbot Asks Texas Supreme Court to Fire Democratic Leader",
    "description": "Republican Gov. Greg Abbott has asked the Texas Supreme Court to remove the state's House Democratic Leader Gene Wu from of office. It comes as President Donald Trump is hinting the FBI may get involved in the effort to return them to their state capitol afte…",
    "link": "https://www.today.com/video/trump-hints-at-fbi-involvement-to-return-absent-texas-democrats-244437061756",
    "timestamp": "2025-08-06T11:23:39Z"
  },
  {
    "title": "ICAN chief at 80th Hiroshima commemoration calls for immediate action to eliminate nuclear weapons",
    "description": "Melissa Parke, the Executive Director of the Nobel Peace Prize-winning International Campaign to Abolish Nuclear Weapons, ICAN, attended the 80th Hiroshima Peace Memorial Commemoration today alongside survivors of the first ever nuclear attack that killed mor…",
    "link": "https://www.commondreams.org/newswire/ican-chief-at-80th-hiroshima-commemoration-calls-for-immediate-action-to-eliminate-nuclear-weapons",
    "timestamp": "2025-08-06T11:23:23Z"
  },
  {
    "title": "FBI Never Investigated Evidence For Obama AG’s Role In Clinton Email Coverup",
    "description": "We now have plausible intelligence suggesting the attorney general may have assured Clinton allies that the FBI investigation into Hillary’s emails would go nowhere.",
    "link": "https://thefederalist.com/2025/08/06/fbi-never-investigated-evidence-for-obama-ags-role-in-clinton-email-coverup/",
    "timestamp": "2025-08-06T11:23:08Z"
  },
  {
    "title": "The case that saved the press — and why Trump wants it gone",
    "description": "President Donald Trump is again attacking the American press — this time not with fiery rally speeches or by calling the media “the enemy of the people,” but through the courts. Since the heat of the November 2024 election, and continuing into July, Trump has…",
    "link": "https://www.niemanlab.org/2025/08/the-case-that-saved-the-press-and-why-trump-wants-it-gone/",
    "timestamp": "2025-08-06T11:15:49Z"
  },
  {
    "title": "Immigrants 'do it naturally' — Trump to let some banned workers return to US farms",
    "description": "In a recent phone interview with CNBC, President Donald Trump acknowledged the critical role immigrant labor plays in sustaining U.S. agriculture. While reiterating that some undocumented farm workers could still face deportation, Trump said his administratio…",
    "link": "https://www.rawstory.com/immigration-2673861878/",
    "timestamp": "2025-08-06T11:15:03Z"
  },
  {
    "title": "Donald Trump Issues FBI Warning to Fleeing Texas Democrats",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said the FBI \"may have to\" get involved to locate Texas Democrats who fled the state to block redrawn U.S. House maps sought by the president.\nTrump made the remarks during a news confer…",
    "link": "https://biztoc.com/x/de0f91dcd48255a4",
    "timestamp": "2025-08-06T11:13:15Z"
  },
  {
    "title": "'Superman' Star Dean Cain Says He Joined ICE: What to Know",
    "description": "The former \"Ripley's Believe It or Not!\" host praised President Donald Trump on social media.",
    "link": "https://www.newsweek.com/superman-dean-cain-joins-ice-2109518",
    "timestamp": "2025-08-06T11:12:55Z"
  },
  {
    "title": "WSJ’s Bawdy Trump-Epstein Exposé Is Record-Smashing Hit, Despite Lawsuit",
    "description": "The WSJ's exclusive report about a lewd birthday letter allegedly sent from Trump to Epstein in 2003 is one of the paper’s most-read articles of all time.\nThe post WSJ’s Bawdy Trump-Epstein Exposé Is Record-Smashing Hit, Despite Lawsuit first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/wsjs-bawdy-trump-epstein-expose-is-record-smashing-hit-despite-lawsuit/",
    "timestamp": "2025-08-06T11:11:07Z"
  },
  {
    "title": "Jimmy Fallon & ‘The Tonight Show’ are safe from cancellation until at least 2028",
    "description": "In mid-July, CBS announced the cancellation of The Late Show with Stephen Colbert. While The Late Show was #1 in the ratings, I believe Samantha Bee’s assessment that late-night shows are “hemorrhaging money” when it comes to advertising. The model is outdate…",
    "link": "https://www.celebitchy.com/934492/jimmy_fallon_the_tonight_show_are_safe_from_cancellation_until_at_least_2028/",
    "timestamp": "2025-08-06T11:10:58Z"
  },
  {
    "title": "Morning Bid: When the chips are down",
    "description": "A mix of disappointing results from some major semiconductor chip names, a service sector hiccup and another slight ebb in hopes for interest rate cut have...",
    "link": "https://finance.yahoo.com/news/morning-bid-chips-down-110942406.html",
    "timestamp": "2025-08-06T11:09:42Z"
  },
  {
    "title": "Russia eyes Ukraine’s ‘fortress belt’ after fall of Chasiv Yar",
    "description": "Ukraine's woes mount with a deadly assault on Kyiv, capture of an eastern city and difficult battle in the north.",
    "link": "https://www.aljazeera.com/news/2025/8/6/russia-eyes-ukraines-fortress-belt-after-fall-of-chasiv-yar",
    "timestamp": "2025-08-06T11:08:52Z"
  },
  {
    "title": "Donald Trump Issues FBI Warning to Fleeing Texas Democrats",
    "description": "Dozens of Texas Democrats have left the state in a bid to block a vote on redrawn U.S. House maps sought by Trump.",
    "link": "https://www.newsweek.com/donald-trump-fbi-warning-texas-democrats-2109485",
    "timestamp": "2025-08-06T11:07:56Z"
  },
  {
    "title": "Chief Actuary Says Trump-GOP Budget Law Will 'Worsen' Social Security's Finances",
    "description": "The Social Security Administration's chief actuary said Tuesday that the budget package President Donald Trump signed into law last month will harm Social Security's finances, bringing forward the date beyond which the program will no longer be able to pay ou…",
    "link": "https://www.commondreams.org/news/social-security-2673862473",
    "timestamp": "2025-08-06T11:06:23Z"
  },
  {
    "title": "Gayle King's ‘CBS Mornings’ struggles with ratings decline ahead of looming ownership change",
    "description": "A longtime network morning show veteran believes \"CBS Mornings\" co-anchor Gayle King \"has lost a lot of her leverage\" with an ownership change looming.",
    "link": "https://www.foxnews.com/media/gayle-kings-cbs-mornings-struggles-with-ratings-decline-ahead-of-looming-ownership-change",
    "timestamp": "2025-08-06T11:05:49Z"
  },
  {
    "title": "The Democratic governors countering Texas redistricting and federal cuts to vaccine research: Morning Rundown",
    "description": "Gavin Newsom and Kathy Hochul to counter GOP redistricting in Texas. Ghislaine Maxwell's prison transfer. RFK Jr. vaccine research cuts. Hiroshima anniversary.",
    "link": "https://www.nbcnews.com/news/us-news/democratic-governors-texas-redistricting-vaccine-cuts-morning-rundown-rcna223303",
    "timestamp": "2025-08-06T11:05:06Z"
  },
  {
    "title": "Trump’s envoy meets Putin ahead of Russia-Ukraine peace deadline, the Kremlin says",
    "description": "Washington has threatened severe tariffs and other penalties if the conflict in Ukraine continues.",
    "link": "https://www.bostonherald.com/2025/08/06/trump-envoy-meets-putin/",
    "timestamp": "2025-08-06T11:04:47Z"
  },
  {
    "title": "Gaza occupation plans fuels criticism, rift in Israel",
    "description": "Backlash grows within Israel over Prime Minister Benjamin Netanyahu’s plan to fully reoccupy Gaza amid the reported tension between the government and the military, as the United Nations has warned that expanding such a operation could trigger “catastrophic c…",
    "link": "https://www.hurriyetdailynews.com/gaza-occupation-plans-fuels-criticism-rift-in-israel-212244",
    "timestamp": "2025-08-06T11:03:20Z"
  },
  {
    "title": "Old Man Wanders Onto Roof, Disappoints A Nation By Not Jumping",
    "description": "When I saw video and photos of Donald Trump on the roof of the White House I was convinced it was AI. WHY would he be ON THE ROOF of the building? Obviously, people on social media were mocking him, hoping he would jump.\nSadly, he did not.\nThe White House is …",
    "link": "https://crooksandliars.com/2025/08/old-man-wanders-roof-disappoints-nation",
    "timestamp": "2025-08-06T11:03:15Z"
  },
  {
    "title": "Spain scraps plans to buy F-35 fighter jets",
    "description": "Spain has shelved plans to purchase F-35 fighter aircraft, Spanish newspaper El País reported today. Preliminary contacts for the purchase of the fifth-generation American stealth fighters have been suspended “indefinitely” and the government will seek Europe…",
    "link": "https://www.politico.eu/article/spain-scraps-plans-on-buying-f-35-fighter-jets-el-pais-reports/",
    "timestamp": "2025-08-06T11:03:15Z"
  },
  {
    "title": "Hotel Sales Decline Amid Economic Headwinds and Uncertainty in H1",
    "description": "The first half of 2025 witnessed a complex interplay of geopolitical shifts, natural disasters, and continuing global challenges that led to significant whiplash in the U.S. stock market and unusual swings in the bond market. The return of Donald J. Trump to …",
    "link": "https://www.hospitalitynet.org/opinion/4128434.html",
    "timestamp": "2025-08-06T11:02:00Z"
  },
  {
    "title": "Ghislaine Maxwell prison upgrade: Silence from those who bought into “Pizzagate” (Letters)",
    "description": "\"Where is their outrage when President Trump is allowing his administration to move Ghislaine Maxwell, an actual convicted pedophile on multiple accounts, with tons of actual evidence to prove her guilt, from one low-security facility to an even lower-securit…",
    "link": "https://www.denverpost.com/2025/08/06/ghislaine-maxwell-moved-where-is-outrage/",
    "timestamp": "2025-08-06T11:01:24Z"
  },
  {
    "title": "How Texas Republicans want to dismantle Democratic districts | CNN Politics",
    "description": "Texas Republicans have proposed a new congressional map for the state, with the goal of flipping five Democratic seats in next year’s midterm elections.",
    "link": "https://www.cnn.com/2025/08/06/politics/texas-republicans-current-proposed-districts-vis",
    "timestamp": "2025-08-06T11:00:41Z"
  },
  {
    "title": "EXCLUSIVE: How Biden Abused The Federal Workforce To Snatch Votes",
    "description": "The Biden administration mobilized the Department of Agriculture to press and register Americans to vote, according to a memo shared with the Daily Caller.",
    "link": "https://dailycaller.com/2025/08/06/biden-administration-agriculture-department-voting-registration-aclu/",
    "timestamp": "2025-08-06T11:00:38Z"
  }
]