[
  {
    "title": "Charles Schwab increases stake in Bitcoin treasury Strategy",
    "description": "Schwab's increased investment in Bitcoin strategies signals growing institutional confidence in cryptocurrency's long-term potential.\nThe post Charles Schwab increases stake in Bitcoin treasury Strategy appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/charles-schwab-increases-stake-bitcoin-treasury-strategy/",
    "timestamp": "2026-02-17T15:28:34Z"
  },
  {
    "title": "Missiles fly as 3rd round of Russia-Ukraine peace talks kick off in Geneva",
    "description": "Ukraine's lead negotiator says Kyiv will work 'constructively' but 'without excessive expectations'.",
    "link": "https://www.aljazeera.com/news/2026/2/17/missiles-fly-as-3rd-round-of-russia-ukraine-peace-talks-kick-off-in-geneva",
    "timestamp": "2026-02-17T15:27:54Z"
  },
  {
    "title": "Politicians, Journalists and Activists Honor Jesse Jackson, as Trump Calls Him ‘A Force of Nature’",
    "description": "\"He was a consequential and transformative leader who changed this nation and the world,\" Rev. Al Sharpton shares\nThe post Politicians, Journalists and Activists Honor Jesse Jackson, as Trump Calls Him ‘A Force of Nature’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/jesse-jackson-dead-tributes/",
    "timestamp": "2026-02-17T15:27:31Z"
  },
  {
    "title": "Trump Uses Jesse Jackson’s Death to Attack Democrats",
    "description": "Donald Trump responded to the death of civil rights icon Jesse Jackson by claiming he isn't racists and attacking Democrats.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-responds-jesse-jackson-death-attacking-democrats-1235517741/",
    "timestamp": "2026-02-17T15:26:18Z"
  },
  {
    "title": "Fox’s Jen Griffin Reports Pete Hegseth Ordered Sudden Firing of Top Army Officer — Adding to Climate of ‘Fear’ Among Military Brass",
    "description": "There is a climate of \"fear, uncertainty, and unwillingness to speak up\" growing among military brass after Secretary of Defense Pete Hegseth forced out a top army officer, according to a report by Fox News chief national security correspondent Jennifer Griff…",
    "link": "https://www.mediaite.com/media/news/foxs-jen-griffin-reports-pete-hegseth-ordered-sudden-firing-of-top-army-officer-adding-to-climate-of-fear-among-military-brass/",
    "timestamp": "2026-02-17T15:25:24Z"
  },
  {
    "title": "Xi Jinping's New Year Message: China Must Embrace 'Vigor, Strength, and Resilience'",
    "description": "Genocidal Chinese dictator Xi Jinping offered an optimistic message to mark the Lunar New Year, which began on Tuesday, welcoming the Year of the Horse and encouraging Chinese people to embrace the \"vigor, strength, and resilience\" that are the hallmarks of t…",
    "link": "https://www.breitbart.com/asia/2026/02/17/xi-jinpings-new-year-message-china-must-embrace-vigor-strength-and-resilience/",
    "timestamp": "2026-02-17T15:24:37Z"
  },
  {
    "title": "Reaction to death of US civil rights leader Jesse Jackson",
    "description": "Feb 17 (Reuters) - U.S. civil rights leader Jesse Jackson, a Baptist minister from the segregated South who became a close associate of Martin Luther King Jr and ran twic… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/17/reaction-to-death-of-us-civil-rights-leader-jesse-jackson",
    "timestamp": "2026-02-17T15:23:54Z"
  },
  {
    "title": "Death of Rev. Jesse Jackson prompts outpouring of tributes and praise",
    "description": "A flood of tributes poured in for Rev. Jesse Jackson after his family announced the death of the civil rights icon on Tuesday.",
    "link": "https://www.nbcnews.com/news/us-news/death-rev-jesse-jackson-prompts-outpouring-tributes-praise-rcna259325",
    "timestamp": "2026-02-17T15:23:00Z"
  },
  {
    "title": "Murdoch’s Defense in Epstein Lawsuit: Trump Is Lewd",
    "description": "A version of the below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a mo…",
    "link": "https://www.motherjones.com/politics/2026/02/donald-trump-jeffrey-epstein-lawsuit-wall-street-journal-lewd-bawdy/",
    "timestamp": "2026-02-17T15:22:55Z"
  },
  {
    "title": "Former Bills player pardoned by President Trump",
    "description": "True story: Ex-Bills player was pardoned by President Donald Trump.",
    "link": "https://www.timestelegram.com/story/news/2026/02/17/buffalo-bills-pardoned-president-donald-trump-travis-henry-nfl/88717531007/",
    "timestamp": "2026-02-17T15:22:07Z"
  },
  {
    "title": "Colbert Blasts CBS for Cowering to Trump, Refusing to Air Interview With Texas Senate Candidate",
    "description": "\"Late Show\" host Stephen Colbert unloaded on higher-ups at CBS late Monday for refusing to air his interview with Texas US Senate candidate James Talarico, allegedly out of fear that the Federal Communications Commission—led by Trump lackey Brendan Carr—would…",
    "link": "https://www.commondreams.org/news/colbert-james-talarico",
    "timestamp": "2026-02-17T15:20:39Z"
  },
  {
    "title": "Stephen Colbert Couldn't Air A Major Interview Over That Equal Time Push By The FCC, And Did Not Stay Quiet",
    "description": "Colbert and CBS aren't playing so nice.",
    "link": "https://www.cinemablend.com/television/stephen-colbert-couldnt-air-major-interview-over-fcc-equal-time-rule",
    "timestamp": "2026-02-17T15:20:08Z"
  },
  {
    "title": "Marjorie Taylor Greene Hits Back at Trump’s Insult With Scathing Epstein Post",
    "description": "Marjorie Taylor Greene has owned the derogatory nickname Donald Trump has branded her with, while eviscerating the president for an Epstein files “cover-up.”...",
    "link": "https://www.thedailybeast.com/marjorie-taylor-greene-hits-back-at-trumps-insult-with-scathing-epstein-post/",
    "timestamp": "2026-02-17T15:19:23Z"
  },
  {
    "title": "Donald Trump Trash-Talks Barack Obama in Tribute to Jesse Jackson",
    "description": "Hours after Reverend Jesse Jackson's death, President Donald Trump memorialized the civil rights pioneer in a way only Trump could ... by making it all about Trump -- and he threw in a jab at former President Barack Obama for good measure. POTUS…\n Permalink",
    "link": "https://www.tmz.com/2026/02/17/trump-insults-obama-while-remembering-jesse-jackson/",
    "timestamp": "2026-02-17T15:17:28Z"
  },
  {
    "title": "Democrat Megadonor Warns Gavin Newsom’s Woke Record Could Torpedo His 2028 Dreams",
    "description": "John Morgan warned on Monday that Democratic California Gov. Gavin Newsom's far-left record could hinder his chances of winning the presidency.",
    "link": "https://dailycaller.com/2026/02/17/democrat-megadonor-warns-gavin-newsoms-woke-record-could-torpedo-his-2028-dreams/",
    "timestamp": "2026-02-17T15:15:48Z"
  },
  {
    "title": "CBS Surrenders to Trump",
    "description": "Chris Lehmann\n\n\n\nThe network tried to bury an interview critical of Trump. Stephen Colbert made it an indictment of the administration’s assaults on the First Amendment.\r\n\n\r\n\n\nThe post CBS Surrenders to Trump appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/cbs-stephen-colbert-equal-time-doctrine-bari-weiss/",
    "timestamp": "2026-02-17T15:15:38Z"
  },
  {
    "title": "Illinois Had Massive Gaps in Mental Health Coverage. We Organized to Fix It.",
    "description": "A grassroots campaign that united patients and providers succeeded in expanding mental health care access. Here’s how.",
    "link": "https://truthout.org/articles/illinois-had-massive-gaps-in-mental-health-coverage-we-organized-to-fix-it/",
    "timestamp": "2026-02-17T15:15:19Z"
  },
  {
    "title": "'Pretty soon': Donald Trump hints at Taiwan weapons call",
    "description": "Despite the Chinese President Xi Jinping warning the US not to send weapons to Taiwan, Donald Trump says he will make a decision soon.",
    "link": "https://www.abc.net.au/news/2026-02-18/donald-trump-make-call-on-taiwan-weapons-deal-soon/106356662",
    "timestamp": "2026-02-17T15:15:10Z"
  },
  {
    "title": "'You've been brainwashed': MTG slams Trump for manipulating MAGA with QAnon lies",
    "description": "Former Rep. Marjorie Taylor Greene (R-GA) accused President Donald Trump's team of sharing \"nods\" to the conspiracy theory group QAnon to \"brainwash\" supporters.In a Tuesday post on X, Greene responded to a commenter who said she had worked on Trump campaigns…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-trump-qanon/",
    "timestamp": "2026-02-17T15:10:44Z"
  },
  {
    "title": "SMBC and Julius Baer plan India tech hubs – report",
    "description": "The moves highlight India’s increasing importance to global finance as a base for GCCs.",
    "link": "https://www.privatebankerinternational.com/news/smbc-julius-baer-india-hubs/",
    "timestamp": "2026-02-17T15:09:41Z"
  },
  {
    "title": "Stephen Colbert Reveals 1 The Late Show Interview CBS Blocked",
    "description": "Stephen Colbert revealed that CBS blocked him from airing an interview on The Late Show. What interview did CBS block on The Late Show with Stephen Colbert? During Monday night’s show, Colbert revealed that Jennifer Garner would be one of his guests. Colbert …",
    "link": "https://www.comingsoon.net/tv/news/2097088-stephen-colbert-late-show-interview-cbs-blocked",
    "timestamp": "2026-02-17T15:09:29Z"
  },
  {
    "title": "Trump Says Jesse Jackson Couldn't Stand Obama",
    "description": "President Donald Trump reflected on his long relationship with Jesse Jackson following Jackson's death on Tuesday, adding that the civil rights activist \"could not stand\" former President Barack Obama.\nThe post Trump Says Jesse Jackson Couldn’t Stand Obama ap…",
    "link": "https://www.breitbart.com/politics/2026/02/17/trump-says-jesse-jackson-couldnt-stand-obama/",
    "timestamp": "2026-02-17T15:08:34Z"
  },
  {
    "title": "President Donald Trump Praises Rev. Jesse Jackson, Jabs At Obama",
    "description": "In his typical fashion, President Donald Trump mixed glowing words for Rev. Jesse Jackson, while taking aim at President Barack Obama.",
    "link": "https://hiphopwired.com/3046055/president-donald-trump-rev-jesse-jackson-praise-obama/",
    "timestamp": "2026-02-17T15:08:29Z"
  },
  {
    "title": "Iran fires live missiles into Strait of Hormuz as Trump envoys arrive for nuclear talks",
    "description": "Iran fired live missiles into the Strait of Hormuz during IRGC naval drills and said it is prepared to shut the key oil transit route if ordered.",
    "link": "https://www.foxnews.com/world/iran-fires-live-missiles-strait-hormuz-trump-envoys-arrive-nuclear-talks",
    "timestamp": "2026-02-17T15:05:46Z"
  },
  {
    "title": "'Sleep tight!' MAGA hopeful taunted as lawmakers order probe into Epstein links",
    "description": "MAGA millionaire and political candidate Don Huffines was taunted Tuesday after the New Mexico Legislature voted unanimously\r\n to establish an investigatory subcommittee into Jeffrey Epstein’s Zorro Ranch, an infamous property recently revealed\r\n to have been…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2675276364/",
    "timestamp": "2026-02-17T15:04:45Z"
  },
  {
    "title": "Big plans, little money: Trump's Board of Peace to meet with Gaza rebuild a distant dream",
    "description": "Funding for Gaza's reconstruction depends on assurances that the war is over, yet Hamas shows no sign of disarming – and any deal would likely require militias that sided with Israel to do the same",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-17/ty-article/.premium/big-plans-little-money-trumps-board-of-peace-to-meet-with-gaza-rebuild-a-distant-dream/0000019c-6b85-d631-a3de-7f8d6f8a0000",
    "timestamp": "2026-02-17T15:04:30Z"
  },
  {
    "title": "‘A Giant Has Gone Home’: Jesse Jackson Remembered As Bridge Builder, Civil Rights Crusader",
    "description": "The ordained minister, activist, and two-time presidential contender, died at the age of 84.",
    "link": "https://www.huffpost.com/entry/jesse-jackson-tributes-civil-rights-death_n_699466e0e4b0330fe92a9726",
    "timestamp": "2026-02-17T15:02:33Z"
  },
  {
    "title": "Iran and U.S. Conclude Second Round of Nuclear Talks",
    "description": "A second round of indirect talks between Iran and the United States over Tehran's nuclear program concluded on February 17, according to Iran's state broadcaster. The outcome remains unclear, as neither side has issued a statement or spoken to the media. Medi…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/US-and-Iran-Resume-Nuclear-Talks-as-Military-Pressure-Mounts.html",
    "timestamp": "2026-02-17T15:00:00Z"
  },
  {
    "title": "CNN Original Series To Debut ‘Standoff: The FBI, Power And Paranoia’",
    "description": "CNN Original Series will examine the often fraught relationship between FBI directors and the presidents they serve in Standoff: The FBI, Power and Paranoia, set to debut next month. Two episodes will premiere at 9 p.m. ET/PT on March 22, and the final two ep…",
    "link": "http://deadline.com/2026/02/fbi-directors-james-comey-trump-cnn-1236726858/",
    "timestamp": "2026-02-17T15:00:00Z"
  },
  {
    "title": "Muslim nations condemn Israel over West Bank land grab",
    "description": "Israel’s decision to designate large swathes of the West Bank as “state property” is a “grave escalation,” a group of Muslim nations says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632679-muslim-nations-condemn-israel/",
    "timestamp": "2026-02-17T14:57:38Z"
  },
  {
    "title": "Nolte: Blacklisting Propagandist Stephen Colbert Claims Democrat James Talarico Interview Blocked By Trump",
    "description": "Stephen Colbert took to the airwaves Monday to crybaby over far-left CBS killing his interview with James Talarico (D-TX).\nThe post Nolte: Blacklisting Propagandist Stephen Colbert Claims Democrat James Talarico Interview Blocked By Trump appeared first on Br…",
    "link": "https://www.breitbart.com/entertainment/2026/02/17/nolte-blacklisting-liar-stephen-colbert-claims-democrat-james-talarico-interview-blocked-by-trump/",
    "timestamp": "2026-02-17T14:56:05Z"
  },
  {
    "title": "Colbert Exposes CBS for Collaborating With the Trump Administration",
    "description": "The Late Show’s Stephen Colbert called out CBS on Monday for blocking his interview with a political candidate—and figured out a sneaky way around the Federal Communications Commission’s new rule targeting late-night talk shows, according to Deadline.Colbert …",
    "link": "https://newrepublic.com/post/206644/colbert-exposes-cbs-collaborating-trump-administration-james-talarico-brendan-carr-fcc",
    "timestamp": "2026-02-17T14:54:28Z"
  },
  {
    "title": "Opposition slams Italy’s plan to attend US Board of Peace as observer",
    "description": "By Angelo AmanteROME, Feb 17 (Reuters) - Italy’s opposition groups criticised a government plan to attend the inaugural meeting of U.S. President Donald Trump’s Board of … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/17/opposition-slams-italy-s-plan-to-attend-us-board-of-peace-as-observer",
    "timestamp": "2026-02-17T14:54:14Z"
  },
  {
    "title": "Iran temporarily closed the Strait of Hormuz as it held latest round of indirect talks with US",
    "description": "Iran conducted live fire military drills in the Strait of Hormuz, temporarily closing the vital waterway. This show of force coincided with indirect talks in Geneva between Iran and the United States concerning Iran's nuclear program. The drills involved miss…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-temporarily-closed-the-strait-of-hormuz-as-it-held-latest-round-of-indirect-talks-with-us/articleshow/128469233.cms",
    "timestamp": "2026-02-17T14:53:58Z"
  },
  {
    "title": "Watch the Colbert Interview He Says CBS Told Him He Couldn’t Air",
    "description": "The \"Late Show\" host says he was told he couldn't air or discuss his interview with Rep. James Talarico\nThe post Watch the Colbert Interview He Says CBS Told Him He Couldn’t Air appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/watch-stephen-colbert-james-talarico-interview-cbs-wouldnt-air/",
    "timestamp": "2026-02-17T14:52:33Z"
  },
  {
    "title": "Woman’s “Strange Behavior” During White House Press Conference Goes Viral",
    "description": "“White House or horror movie audition?” one asked after seeing Susan Dell’s demeanor as she stood few feet away from US President Donald Trump.",
    "link": "https://www.boredpanda.com/susan-dell-strange-behavior-during-white-house-press-conference-goes-viral/",
    "timestamp": "2026-02-17T14:49:50Z"
  },
  {
    "title": "Donald Trump turns tribute to Jesse Jackson into controversial attack on Barack Obama",
    "description": "The commander-in-chief paid homage to the civil rights leader who died on Tuesday before berating Obama",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-jesse-jackson-tribute-truth-social-attacks-barack-obama-574214-20260217",
    "timestamp": "2026-02-17T14:49:21Z"
  },
  {
    "title": "Video: USA Is Using Hunger as a Weapon to Try to Collapse Cuba",
    "description": "The Donald Trump administration has imposed an extreme oil blockade to prevent Cuba from getting fuel from any country. Marco Rubio wants to collapse the economy, causing millions of civilians to starve and suffer in order to overthrow the revolutionary …\nThe…",
    "link": "https://www.globalresearch.ca/video-usa-using-hunger-weapon-try-collapse-cuba/5916119",
    "timestamp": "2026-02-17T14:48:07Z"
  },
  {
    "title": "Is Trump’s Imperial Presidency Here to Stay?",
    "description": "The expansion of executive power is a hallmark of Trump’s second term. That could be a permanent condition, writes columnist Ed Kilgore.",
    "link": "http://nymag.com/intelligencer/article/is-trumps-imperial-presidency-here-to-stay.html",
    "timestamp": "2026-02-17T14:46:32Z"
  },
  {
    "title": "Hillary Clinton using Ukraine to avoid jail – Putin envoy",
    "description": "Putin envoy Kirill Dmitriev has accused Hillary Clinton of using Ukraine to avoid prosecution over the Russiagate hoax Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632678-clinton-ukraine-russiagate-dmitriev/",
    "timestamp": "2026-02-17T14:45:24Z"
  },
  {
    "title": "Trump task force racks up 500 arrests in January as president brands cartels ‘ISIS of the Western Hemisphere’",
    "description": "Trump's Homeland Security Task Force reportedly arrested over 500 people in January surge targeting cartels, gangs, and smuggling rings across the nation.",
    "link": "https://www.foxnews.com/politics/trump-task-force-racks-up-500-arrests-january-president-brands-cartels-isis-western-hemisphere",
    "timestamp": "2026-02-17T14:44:14Z"
  },
  {
    "title": "Cuba Fuel Squeeze to Halt Sherritt’s Nickel-Cobalt Operations",
    "description": "Sherritt International Corp. plans to suspend nickel and cobalt production in Cuba as fuel supply constraints affect the struggling communist-run island. The compan…",
    "link": "https://financialpost.com/pmn/business-pmn/cuba-fuel-squeeze-to-halt-sherritts-nickel-cobalt-operations",
    "timestamp": "2026-02-17T14:40:01Z"
  },
  {
    "title": "CBS Spiked Colbert’s Talarico Interview and Created the Biggest Campaign Ad of 2026",
    "description": "CBS spiked Colbert’s Talarico interview over FCC fears, but the ban only amplified both men in a digital ecosystem where suppression fuels virality.\nThe post CBS Spiked Colbert’s Talarico Interview and Created the Biggest Campaign Ad of 2026 first appeared on…",
    "link": "https://www.mediaite.com/opinion/cbs-spiked-colberts-talarico-interview-and-created-the-biggest-campaign-ad-of-2026/",
    "timestamp": "2026-02-17T14:38:28Z"
  },
  {
    "title": "Republicans Fretting Over Affordability Problems They Caused",
    "description": "With Donald Trump’s poll numbers plummeting and Democrats wildly overperforming in special elections, Republicans suddenly care about Americans’ serious affordability problems.\nAccording to The Hill, “some” Republicans “worry the GOP does not have an ambitiou…",
    "link": "https://crooksandliars.com/2026/02/republicans-fretting-over-affordability",
    "timestamp": "2026-02-17T14:37:35Z"
  },
  {
    "title": "Morning Joe hammers Marco Rubio for 'new low' after 'screwed up' MAGA speech",
    "description": "Secretary of State Marco Rubio’s gushing praise of Viktor Orbán, the authoritarian prime minister of Hungary, on Monday was called out on MS NOW as nothing more than an attempt to stay in the good graces of Donald Trump and the far-right MAGA base.During thei…",
    "link": "https://www.rawstory.com/rubio-trump-2675275198/",
    "timestamp": "2026-02-17T14:37:12Z"
  },
  {
    "title": "Trump Uses Civil Rights Leader Jesse Jackson’s Death to Attack Obama",
    "description": "President Trump used the death of civil right activist Jesse Jackson to take a cheap shot at former President Barack Obama—and to pat himself on the back for not being racist.“The Reverend Jesse Jackson is Dead at 84. I knew him well, long before becoming Pre…",
    "link": "https://newrepublic.com/post/206640/trump-jesse-jackson-death-attack-obama",
    "timestamp": "2026-02-17T14:34:11Z"
  },
  {
    "title": "Watch the Colbert Interview With James Talarico That CBS Kept Off Air",
    "description": "The pre-taped interview, when it appeared online after the broadcast show ended, opened with the pair addressing CBS's decision on the segment.\nThe post Watch the Colbert Interview With James Talarico That CBS Kept Off Air first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/watch-the-colbert-interview-with-james-talarico-that-cbs-kept-off-air/",
    "timestamp": "2026-02-17T14:33:30Z"
  },
  {
    "title": "Louisiana Bets Big on “Blue Ammonia.” Communities Along Cancer Alley Brace for the Cost.",
    "description": "This story is from Floodlight, a nonprofit newsroom that investigates the powers stalling climate action. Sign up for Floodlight’s newsletter here. From her home in Donaldsonville, La., less than three miles from the world’s largest ammonia plant, Ashley Gaig…",
    "link": "https://www.motherjones.com/politics/2026/02/louisiana-bets-big-on-blue-ammonia-communities-along-cancer-alley-brace-for-the-cost/",
    "timestamp": "2026-02-17T14:32:42Z"
  },
  {
    "title": "Trump Tells Reporters He Had ‘Nothing To Do With Jeffrey Epstein’ Amid New Accusations In Epstein Files: ‘Totally Exonerated!’",
    "description": "Trump claimed he \"had nothing to do with Jeffrey Epstein\" and is \"totally exonerated\" despite 38,000 mentions and new accusations in the Epstein Files.\nThe post Trump Tells Reporters He Had ‘Nothing To Do With Jeffrey Epstein’ Amid New Accusations In Epstein …",
    "link": "https://www.mediaite.com/media/news/trump-tells-reporters-he-had-nothing-to-do-with-jeffrey-epstein-amid-new-accusations-in-epstein-files-totally-exonerated/",
    "timestamp": "2026-02-17T14:30:34Z"
  },
  {
    "title": "The World Has Turned and Left Me Here",
    "description": "Plus: Tariffs, tariffs, and even more news about tariffs! And George W. Bush has some interesting thoughts about George Washington.",
    "link": "https://reason.com/2026/02/17/the-world-has-turned-and-left-me-here/",
    "timestamp": "2026-02-17T14:22:29Z"
  },
  {
    "title": "Our Clinton Nightmare Comes to a Franken End - It looks as though time is finally up for Bill and Hill.",
    "description": "What does one do with useful grifters who’ve lost their utility? The Democrats Frankenize them. It’s like ostracizing without the pomp and ceremony. If you’re unfamiliar with the process, you can watch it play out on the Clintons over the next few months. Fra…",
    "link": "https://freerepublic.com/focus/f-chat/4367180/posts",
    "timestamp": "2026-02-17T14:22:22Z"
  },
  {
    "title": "John Fetterman Hits New Low in Quest for Donald Trump’s Approval",
    "description": "Ex-Progressive Senator John Fetterman is bucking his party yet again, but this time the fallout could drastically impact the results of future elections.The Pennsylvania turncoat came out in favor of voter ID legislation, revealing that he would support a cle…",
    "link": "https://newrepublic.com/post/206639/john-fetterman-hits-new-low-quest-donald-trump-approval-voter-id-fraud",
    "timestamp": "2026-02-17T14:18:00Z"
  },
  {
    "title": "Iran foreign minister says progress made in nuclear talks with U.S. in Geneva",
    "description": "GENEVA, Feb 17 (Reuters) - ⁠Iran and the United States reached an understanding on the ⁠main \"guiding principles\" in a second round of nuclear talks in Geneva ‌on Tuesday but work still needs to be done, Iranian Foreign Minister Abbas Araqchi said. Read full …",
    "link": "https://www.thestar.com.my/news/world/2026/02/17/iran-foreign-minister-says-progress-made-in-nuclear-talks-with-us-in-geneva",
    "timestamp": "2026-02-17T14:09:00Z"
  },
  {
    "title": "Beetz Brothers & Mediawan Rights Unveil First Deals For ‘Elon Musk Unveiled – The Tesla Experiment’ Ahead Of German Theatrical Release – EFM",
    "description": "EXCLUSIVE: Beetz Brothers and Mediawan Rights have unveiled details of deals to date for Andreas Pichler’s documentary Elon Musk Unveiled – The Tesla-Experiment. Taking its cue from investigations into the alleged failure of Elon Musk’s Tesla company to addre…",
    "link": "http://deadline.com/2026/02/beetz-brothers-mediawan-deals-for-elon-musk-unveiled-1236726833/",
    "timestamp": "2026-02-17T14:06:18Z"
  },
  {
    "title": "Trump Salutes ‘Good Man’ Jesse Jackson in Laudatory Memorial Post — Claims Civil Rights Icon ‘Could Not Stand’ Obama",
    "description": "President Donald Trump mourned the death of civil rights leader Jesse Jackson in a post claiming Jackson \"could not stand\" former President Barack Obama.\nThe post Trump Salutes ‘Good Man’ Jesse Jackson in Laudatory Memorial Post — Claims Civil Rights Icon ‘Co…",
    "link": "https://www.mediaite.com/politics/trump-salutes-good-man-jesse-jackson-in-laudatory-memorial-post-claims-civil-rights-icon-could-not-stand-obama/",
    "timestamp": "2026-02-17T14:03:38Z"
  },
  {
    "title": "Energy Crisis and Deindustrialisation: EU-US Tensions Lead to Decline in American LNG Natural Gas Purchases",
    "description": "Growing tensions between the European Union and the United States have led to a decline in American liquefied natural gas (LNG) purchases from terminals in Greece. The diversified energy supply that Brussels now advocates remains difficult to implement, and ……",
    "link": "https://www.globalresearch.ca/eu-us-tensions-decline-american-lng-purchases-greek-terminals/5916103",
    "timestamp": "2026-02-17T14:03:03Z"
  },
  {
    "title": "SCOOP: Hegseth orders removal of Army public affairs chief amid broader Pentagon purge",
    "description": "Pentagon chief Pete Hegseth orders removal of Army Col. Dave Butler from public affairs role amid growing concerns over military leadership changes.",
    "link": "https://www.foxnews.com/politics/scoop-hegseth-orders-removal-army-public-affairs-chief-amid-broader-pentagon-purge",
    "timestamp": "2026-02-17T14:01:46Z"
  },
  {
    "title": "It's not students organizing ICE walkouts — here's who's really behind the nationwide protests",
    "description": "Teacher unions orchestrate student walkouts against ICE and Trump administration policies, using public schools as political staging grounds for activism.",
    "link": "https://www.foxnews.com/opinion/its-not-students-organizing-ice-walkouts-heres-whos-really-behind-nationwide-protests",
    "timestamp": "2026-02-17T14:00:57Z"
  },
  {
    "title": "Trump’s “Mission Accomplished” moment gives Democrats an opening",
    "description": "The president falsely claimed he \"fixed\" the affordability crisis. He and the GOP will pay in the November midterms",
    "link": "https://www.salon.com/2026/02/17/trumps-mission-accomplished-moment-gives-democrats-an-opening/",
    "timestamp": "2026-02-17T14:00:39Z"
  },
  {
    "title": "Saudi Oil Sales to China Up",
    "description": "Saudi Arabia's crude sales to top importer China for loading in March rose.",
    "link": "https://www.rigzone.com/news/wire/saudi_oil_sales_to_china_up-17-feb-2026-183001-article/",
    "timestamp": "2026-02-17T14:00:00Z"
  },
  {
    "title": "New Mexico Will Investigate Epstein’s Zorro Ranch",
    "description": "Well, that was fast! The internet lit up over the past 48 hours about Jeffrey Epstein’s Zorro Ranch. News broke that the FBI had scoured Epstein’s properties in Palm Beach, New York, and Little St. James Island, but had not given any attention to Epstein’s sp…",
    "link": "https://dianeravitch.net/2026/02/17/new-mexico-will-investigate-epsteins-zorro-ranch/",
    "timestamp": "2026-02-17T14:00:00Z"
  },
  {
    "title": "CBP Cites Customs Bond Insufficiencies As Importers Struggle Under Weight of Tariffs",
    "description": "More companies than ever aren’t paying enough in customs bonds to guarantee coverage of the Trump administration’s broad and hefty tariffs.",
    "link": "https://sourcingjournal.com/topics/trade/cbp-customs-bond-insufficiencies-importers-tariffs-1234813629/",
    "timestamp": "2026-02-17T14:00:00Z"
  },
  {
    "title": "Democrats Call to Censure Rep. Randy Fine for Saying America Will Choose Pet Dogs over Muslim Supremacy",
    "description": "Rep. Randy Fine posts on social media: \"If they force us to choose, the choice between dogs and Muslims is not a difficult one.\"\nThe post Democrats Call to Censure Rep. Randy Fine for Saying America Will Choose Pet Dogs over Muslim Supremacy appeared first on…",
    "link": "https://www.breitbart.com/immigration/2026/02/17/democrats-trigger-progressives-by-slamming-randys-fines-dog-comments/",
    "timestamp": "2026-02-17T13:51:00Z"
  },
  {
    "title": "Lunar New Year Explosion at Fireworks Shop Kills 8 in China",
    "description": "Chinese state media outlets confirmed Monday eight people died in eastern Jiangsu province on Sunday after “improper” detonations near a fireworks store caused a massive explosion and fire.\nThe post Lunar New Year Explosion at Fireworks Shop Kills 8 in China …",
    "link": "https://www.breitbart.com/asia/2026/02/17/lunar-new-year-explosion-at-fireworks-shop-kills-8-in-china/",
    "timestamp": "2026-02-17T13:49:41Z"
  },
  {
    "title": "Trump Struggles with & Decides Not to Answer 'Toughest Question' About Wife Melania",
    "description": "Donald Trump opted not to answer what he described as the “toughest question” he was asked during a recent interview. The question was about his wife, first lady Melania Trump. While speaking to the press aboard Air Force One on Monday (February 16), the 79-y…",
    "link": "https://www.justjared.com/2026/02/17/trump-decides-not-to-answer-toughest-question-about-wife-melania/",
    "timestamp": "2026-02-17T13:48:00Z"
  },
  {
    "title": "Ceasefire in eastern DR Congo: Chance for peace?",
    "description": "A long-awaited ceasefire in eastern DR Congo is set to begin under the 2025 Washington Accords. Analysts remain skeptical, but US interests in Congolese resources could help push the peace process.",
    "link": "https://www.dw.com/en/ceasefire-in-eastern-dr-congo-chance-for-peace/a-76002969",
    "timestamp": "2026-02-17T13:47:00Z"
  },
  {
    "title": "Ceasefire in eastern DR Congo: A chance for peace?",
    "description": "A long-awaited ceasefire in eastern DR Congo is set to begin under the 2025 Washington Accords. Analysts remain skeptical, but US interests in Congolese resources could help propel the peace process. The increasingly unstable situation in the eastern Democrat…",
    "link": "https://www.dw.com/en/ceasefire-in-eastern-dr-congo-a-chance-for-peace/a-76002969",
    "timestamp": "2026-02-17T13:47:00Z"
  },
  {
    "title": "Trump claims partial credit for Jesse Jackson’s success in self-pitying rant",
    "description": "President Donald Trump took to social media Tuesday to lament the death\r\n of civil rights icon Jesse Jackson, while at the same time claiming partial credit for his success in advancing racial equality.The Truth Social post then attacked the nation's first Bl…",
    "link": "https://www.rawstory.com/trump-2675275860/",
    "timestamp": "2026-02-17T13:46:33Z"
  },
  {
    "title": "Oil prices stable as Iran conducts war games in Strait of Hormuz",
    "description": "The military exercises come as tensions are high between the U.S. and Iran.",
    "link": "https://www.cnbc.com/2026/02/17/oil-prices-stable-as-iran-conducts-war-games-in-strait-of-hormuz.html",
    "timestamp": "2026-02-17T13:46:09Z"
  },
  {
    "title": "Trump remembers Jesse Jackson as 'good man,' 'force of nature'",
    "description": "",
    "link": "https://www.foxnews.com/politics/trump-remembers-jesse-jackson-good-man-force-nature",
    "timestamp": "2026-02-17T13:44:19Z"
  },
  {
    "title": "Steve Bannon Promised to Help Epstein \"Crush the Pedo/Trafficking Narrative\"",
    "description": "Steve Bannon remained close with Epstein, even texting with him about a \"documentary\" project on the very day of Epstein's 2019 arrest.",
    "link": "https://www.jezebel.com/steve-bannon-jeffrey-epstein-documentary-friendship-media-training-files-pedophile-trafficking-accusations",
    "timestamp": "2026-02-17T13:41:02Z"
  },
  {
    "title": "Iran can sink US warship, supreme leader warns after talks",
    "description": "Iran’s supreme leader warns the country has the ability to sink a US warship in the Gulf as fresh talks conclude between the two nations in Switzerland.\n\nRead More: https://punchng.com/iran-can-sink-us-warship-supreme-leader-warns-after-talks/",
    "link": "https://punchng.com/iran-can-sink-us-warship-supreme-leader-warns-after-talks/",
    "timestamp": "2026-02-17T13:36:26Z"
  },
  {
    "title": "In World War II’s dog-eat-dog struggle for resources, a Greenland mine launched a new world order",
    "description": "Strategic resources have been central to the American-led global system for decades, as a historian explains. But US actions toward Greenland today are different.",
    "link": "https://theconversation.com/in-world-war-iis-dog-eat-dog-struggle-for-resources-a-greenland-mine-launched-a-new-world-order-275630",
    "timestamp": "2026-02-17T13:34:25Z"
  },
  {
    "title": "Iran partially closes Strait of Hormuz, a vital oil chokepoint, as U.S. talks get underway",
    "description": "Iranian state media reported the partial closure of the Strait of Hormuz on Tuesday for military drills in the waterway.",
    "link": "https://www.cnbc.com/2026/02/17/iran-us-strait-of-hormuz-oil-nuclear-talks-geneva.html",
    "timestamp": "2026-02-17T13:32:58Z"
  },
  {
    "title": "We Are Sleepwalking Into An Apocalyptic War With Iran",
    "description": "By the time we got to this stage, I always thought that most people would understand what was happening. But of course, that isn’t true at all. Even though we are literally right on the brink of an apocalyptic war with Iran, most of the population doesn’t see…",
    "link": "https://www.shtfplan.com/war/we-are-sleepwalking-into-an-apocalyptic-war-with-iran",
    "timestamp": "2026-02-17T13:30:04Z"
  },
  {
    "title": "EXCLUSIVE: 60 Lawmakers Support Lawsuit to Limit Abortion Pill After Trump Requested Pause",
    "description": "FIRST ON THE DAILY SIGNAL—A coalition of 60 lawmakers filed an amicus brief supporting a lawsuit to limit the abortion pill after the Trump administration... Read More\nThe post EXCLUSIVE: 60 Lawmakers Support Lawsuit to Limit Abortion Pill After Trump Request…",
    "link": "https://www.dailysignal.com/2026/02/17/exclusive-60-lawmakers-support-lawsuit-limit-abortion-pill-trump-requested-pause/",
    "timestamp": "2026-02-17T13:30:00Z"
  },
  {
    "title": "Talarico Interview Pulled From Late Show by CBS Lawyers",
    "description": "It's a safe bet that more people will now see the interview that didn't air on television.",
    "link": "http://www.dallasobserver.com/news/talarico-interview-pulled-from-late-show-by-cbs-lawyers-40645028/",
    "timestamp": "2026-02-17T13:27:22Z"
  },
  {
    "title": "Stephen Colbert Goes Against CBS, Interviews Democrat James Talarico for YouTube Over FCC Fears",
    "description": "Stephen Colbert was set to host Texas state Rep. James Talarico, who is running for U.S. Senate, on The Late Show on Monday night (February 16), however, he was blocked from doing so. He explained what happened to his audience. “You know who is not one of my …",
    "link": "https://www.justjared.com/2026/02/17/stephen-colbert-goes-against-cbs-interviews-democrat-james-talarico-for-youtube-over-fcc-fears/",
    "timestamp": "2026-02-17T13:27:17Z"
  },
  {
    "title": "Can you buy a country?",
    "description": "The debate over Greenland revives a question that shaped America’s rise for more than two centuries Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632664-can-you-buy-country/",
    "timestamp": "2026-02-17T13:26:56Z"
  },
  {
    "title": "Trump FTC Threatens Apple With A Fake Investigation Into Its Nonexistent ‘Liberal News Bias’",
    "description": "Here we go again. The Trump FTC has threatened Apple and CEO Tim Cook with a fake investigation claiming that Apple News doesn’t do a good enough job coddling right wing, Trump-friendly ideology. The announcement and associated letter pretends that Apple is v…",
    "link": "https://www.techdirt.com/2026/02/17/trump-ftc-threatens-apple-with-a-fake-investigation-into-its-nonexistent-liberal-news-bias/",
    "timestamp": "2026-02-17T13:26:55Z"
  },
  {
    "title": "Iran partially closes Strait of Hormuz as it resumes indirect nuclear talks with U.S.",
    "description": "Iran's supreme leader warned on Tuesday that U.S. attempts to depose his government would fail, as Washington and Tehran began indirect talks in Geneva on their long-running nuclear dispute amid a U.S. military buildup in the Middle East.",
    "link": "https://www.cbc.ca/news/world/iran-strait-of-hormuz-nucleur-talks-united-states-9.7093310",
    "timestamp": "2026-02-17T13:24:39Z"
  },
  {
    "title": "The injustice in Chagos continues",
    "description": "Expressions of regret have not translated into enabling return or providing reparations.",
    "link": "https://www.aljazeera.com/opinions/2026/2/17/the-injustice-in-chagos-continues",
    "timestamp": "2026-02-17T13:22:33Z"
  },
  {
    "title": "President’s Week Is A Reminder Of How Lucky We Are To Have Donald Trump At The Helm",
    "description": "It can be easy to take for granted where we are as a nation, under a second Trump presidency.\nThe post President’s Week Is A Reminder Of How Lucky We Are To Have Donald Trump At The Helm appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/presidents-week-is-reminder-how-lucky-we-are/",
    "timestamp": "2026-02-17T13:15:39Z"
  },
  {
    "title": "New details about Nicuşor Dan’s upcoming state visit to the US. What Dan will discuss with Trump",
    "description": "Romanian President Nicuşor Dan has provided details about his upcoming state visit to the US. It will have an economic component, Dan said. The date of the state visit will be set after Nicuşor Dan's participation in the Peace Council in Washington.",
    "link": "https://www.mediafax.ro/english/new-details-about-nicusor-dans-upcoming-state-visit-to-the-us-what-dan-will-discuss-with-trump-23688302",
    "timestamp": "2026-02-17T13:13:57Z"
  },
  {
    "title": "CNN’s Abby Phillip Steps in to Fact-Check Kevin O’Leary: ‘She’s Making a Legitimate Point’",
    "description": "Abby Phillip stepped in to fact-check prominent Trump ally Kevin O’Leary as he and political consultant Tezlyn Figaro got heated about prison reform.\nThe post CNN’s Abby Phillip Steps in to Fact-Check Kevin O’Leary: ‘She’s Making a Legitimate Point’ first app…",
    "link": "https://www.mediaite.com/media/tv/cnns-abby-phillip-steps-in-to-fact-check-kevin-oleary-shes-making-a-legitimate-point/",
    "timestamp": "2026-02-17T13:11:57Z"
  },
  {
    "title": "Jesse Jackson, RIP",
    "description": "Jesse Jackson has died. One of the most important civil rights leaders in the post-King era, Jackson was a complicated man with a complex legacy. He had quite an ability to both promote himself endlessly and shapeshift into the Black politics of the moment, w…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/jesse-jackson-rip",
    "timestamp": "2026-02-17T13:11:55Z"
  },
  {
    "title": "Silver miners fall in premarket trading as silver drops 2%",
    "description": "Silver mining companies including Hecla Mining, Endeavor Silver, and First Majestic Silver were down before the market opened.",
    "link": "https://www.cnbc.com/2026/02/17/silver-prices-hecla-mining-endeavour-silver.html",
    "timestamp": "2026-02-17T13:08:48Z"
  },
  {
    "title": "Russia, Ukraine exchange damaging volleys ahead of trilateral talks with U.S.",
    "description": "Russian forces pounded Ukrainian power infrastructure before a new round of ‌peace talks, killing three energy workers and leaving tens of thousands of people without power and heat, officials said Tuesday. For its part, Ukraine struck a Russian oil facility.",
    "link": "https://www.cbc.ca/news/world/ukraine-russia-attacks-geneva-talks-9.7093295",
    "timestamp": "2026-02-17T13:08:09Z"
  },
  {
    "title": "End of enhanced Obamacare subsidies puts tribal health lifeline at risk",
    "description": "One estimates that 125,000 Native Americans will become uninsured in 2026 due to the higher costs.",
    "link": "https://www.oregonlive.com/nation/2026/02/end-of-enhanced-obamacare-subsidies-puts-tribal-health-lifeline-at-risk.html",
    "timestamp": "2026-02-17T13:06:55Z"
  },
  {
    "title": "Second Round of US-Iran Nuclear Talks Ends in Geneva - Reports",
    "description": "WASHINGTON (Sputnik) - The second round of negotiations between Washington and Tehran on the Iranian nuclear issue ended in Geneva on Tuesday, Axios reported, citing a US official.",
    "link": "https://sputnikglobe.com/20260217/second-round-of-us-iran-nuclear-talks-ends-in-geneva---reports-1123646343.html",
    "timestamp": "2026-02-17T13:06:33Z"
  },
  {
    "title": "Luther Campbell, former 2 Live Crew rapper, is running for Congress",
    "description": "Luther Campbell, former 2 Live Crew rapper, is running for Congresswsbtv.com",
    "link": "https://www.wsbtv.com/news/trending/luther-campbell-former-2-live-crew-rapper-is-running-congress/JXF32IH2JZDWRDC4CWPSV2NA5U/",
    "timestamp": "2026-02-17T13:06:07Z"
  },
  {
    "title": "Trump lashes out at Maryland governor's over Potomac River sewage spill response",
    "description": "President Donald Trump took aim at Maryland Gov. Wes Moore even though a District of Columbia-based water authority and the federal government have jurisdiction over the busted pipe.",
    "link": "https://www.pbs.org/newshour/politics/trump-lashes-out-at-maryland-governors-over-potomac-river-sewage-spill-response",
    "timestamp": "2026-02-17T13:04:25Z"
  },
  {
    "title": "Hillary Clinton, Kevin Spacey at Berlin Cinema for Peace: Kaouther Ben Hania Refuses Award",
    "description": "\"I feel responsibility more than gratitude,\" says 'The Voice of Hind Rajab' filmmaker, denouncing “genocide” and leaving the prize behind at a Berlin Adlon Hotel ceremony hosted by Bob Geldof.",
    "link": "http://www.hollywoodreporter.com/news/general-news/hillary-clinton-cinema-for-peace-berlin-kaouther-ben-hania-1236507493/",
    "timestamp": "2026-02-17T13:03:57Z"
  }
]