[
  {
    "title": "Model organism databases face budget cuts and closures",
    "description": "Beyond the crucial data they contain, these digital archives have provided an important space for academic communities to exchange ideas and resources.",
    "link": "https://www.nature.com/articles/d41586-025-03040-5",
    "timestamp": "2025-10-02T00:00:00Z"
  },
  {
    "title": "Exclusive: ex-CDC director talks about why she was fired",
    "description": "“I would never do that, as a scientist,” Susan Monarez says of being asked to approve changes to vaccine recommendations without knowing the details.",
    "link": "https://www.nature.com/articles/d41586-025-03179-1",
    "timestamp": "2025-10-02T00:00:00Z"
  },
  {
    "title": "Democrat Rep. Shri Thanedar: 'So Be It' if Government Shuts Down to Ensure Americans Get Health Care",
    "description": "Rep. Shri Thanedar (D-MI) said Wednesday that the ongoing federal government shutdown should continue if it means ensuring healthcare access, as the House remains out of session until October 7.\nThe post Democrat Rep. Shri Thanedar: ‘So Be It’ if Government S…",
    "link": "https://www.breitbart.com/politics/2025/10/01/democrat-rep-shri-thanedar-so-be-it-if-government-shuts-down-to-ensure-americans-get-health-care/",
    "timestamp": "2025-10-01T23:56:38Z"
  },
  {
    "title": "Israel removes Greta Thunberg from Gaza aid flotilla - but says she is 'safe and healthy'",
    "description": "The flotilla ignored requests to turn back, and organisers claim Israel's interception is illegal as it happened in \"international waters\" around 80 miles off the coast.",
    "link": "https://news.sky.com/story/israel-removes-greta-thunberg-from-gaza-aid-flotilla-but-says-she-is-safe-and-healthy-13442505",
    "timestamp": "2025-10-01T23:54:00Z"
  },
  {
    "title": "Both parties blame each other on 1st day of government shutdown as tourist sites close",
    "description": "As the finger-pointing persisted, the economic pain became more likely to spread.",
    "link": "https://www.denverpost.com/2025/10/01/government-shutdown-politics-blame/",
    "timestamp": "2025-10-01T23:53:29Z"
  },
  {
    "title": "Both parties blame each other on 1st day of government shutdown as tourist sites close",
    "description": "As the finger-pointing persisted, the economic pain became more likely to spread.",
    "link": "https://www.bostonherald.com/2025/10/01/government-shutdown-politics-blame/",
    "timestamp": "2025-10-01T23:53:29Z"
  },
  {
    "title": "Trump’s solution for high drug prices is a discount portal called TrumpRx - The Verge",
    "description": "Trump’s solution for high drug prices is a discount portal called TrumpRxThe Verge Trump's pharmaceutical tariff threat loses bite after Pfizer deal reassures drugmakersCNBC How TrumpRx Website May Affect Your Drug Costs After Pfizer DealThe New York Times Fa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179620970",
    "timestamp": "2025-10-01T23:52:40Z"
  },
  {
    "title": "Stable NT$ boosts Taiwan exporters in 4Q25",
    "description": "Since US President Donald Trump took office on January 20, 2025, the global trade order and long-established supply chain balances have been disrupted. Taiwan has stood out amid the downturn by leveraging its advanced chip manufacturing and AI server assembly…",
    "link": "https://www.digitimes.com/news/a20251001PD232/taiwan-donald-trump-2025-manufacturing-ai-server.html",
    "timestamp": "2025-10-01T23:51:34Z"
  },
  {
    "title": "Jeffries: Trump AI Sombrero Video 'Was a Xenophobic Stereotype'",
    "description": "Wednesday on CNN's \"The Lead,\" House Minority Leader Hakeem Jeffries (D-NY) said President Donald Trump's AI video depicting the leader in a sombrero \"was a xenophobic stereotype.\"\nThe post Jeffries: Trump AI Sombrero Video ‘Was a Xenophobic Stereotype’ appea…",
    "link": "https://www.breitbart.com/clips/2025/10/01/jeffries-trump-ai-sombrero-video-was-a-xenophobic-stereotype/",
    "timestamp": "2025-10-01T23:46:55Z"
  },
  {
    "title": "Pope Leo XIV says 'inhuman treatment of immigrants' in the U.S. isn't 'pro-life' - NewsBreak",
    "description": "VATICAN CITY — Pope Leo XIV weighed in on U.S. politics, saying that Catholic politicians must be judged on the full range of their policy positions and su",
    "link": "https://www.newsbreak.com/share/4267994023000-pope-leo-xiv-says-inhuman-treatment-of-immigrants-in-the-u-s-isn-t-pro-life?s=a2&amp;share_destination_id=Mjk4NjM0OTY5LTE3NTkzNjIzMTMzODY%3D&amp;pd=0KD2b38g&amp;hl=en_US&amp;send_time=1759362313&amp;actBtn=floatShareButton&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-01T23:45:55Z"
  },
  {
    "title": "Newsom trolls ‘Marie Antoinette’ Trump over decision to protect his ballroom while pushing cuts: ‘No health care for you’",
    "description": "Gavin Newsom has trolled Donald Trump over the news that work will continue on his presidential ballroom through the government shutdown, comparing him to",
    "link": "https://www.newsbreak.com/share/4267975981827-newsom-trolls-marie-antoinette-trump-over-decision-to-protect-his-ballroom-while-pushing-cuts-no-health-care-for-you?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NTkzNjIxNjQ4NDU%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1759362164&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.38.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-01T23:44:59Z"
  },
  {
    "title": "Trump freezes $26 Billion as shutdown battle hits $1.7 trillion budget fight",
    "description": "The U.S. government shutdown has stopped many services and put thousands of workers at risk. President Donald Trump froze billions in funds for Democratic states, while both parties blame each other. The big fight is over the $1.7 trillion budget, and there i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-freezes-26-billion-as-shutdown-battle-hits-1-7-trillion-budget-fight/articleshow/124267478.cms",
    "timestamp": "2025-10-01T23:40:55Z"
  },
  {
    "title": "ICE Will Be On Patrol At Bad Bunny’s ‘Shameful’ Super Bowl Halftime Show, Trump Adviser Says",
    "description": "The NFL received right-wing backlash from its decision to have Bad Bunny headline its Super Bowl halftime show.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/01/ice-will-be-on-patrol-at-bad-bunnys-shameful-super-bowl-halftime-show-trump-adviser-says/",
    "timestamp": "2025-10-01T23:36:09Z"
  },
  {
    "title": "‘It’s Going to Be Painful’: Day One of Government Shutdown Hits the Bay Area",
    "description": "When the government shutdown started at 12:01 a.m., thousands of the region’s federal workers were furloughed and many services ground to a halt.",
    "link": "https://www.kqed.org/news/12058294/its-going-to-be-painful-day-one-of-government-shutdown-hits-the-bay-area",
    "timestamp": "2025-10-01T23:35:18Z"
  },
  {
    "title": "Bondi and Hegseth rally federal agents and troops in Memphis as part of crime task force",
    "description": "U.S. Defense Secretary Pete Hegseth, Attorney General Pam Bondi and White House Deputy Chief of Staff Stephen Miller have converged on Memphis, Tennessee, to meet with federal agents forming a crime fighting task force there",
    "link": "https://abcnews.go.com/US/wireStory/bondi-hegseth-rally-federal-agents-troops-memphis-part-126134191",
    "timestamp": "2025-10-01T23:34:21Z"
  },
  {
    "title": "'Trump 2028' hats seen on Oval Office desk during meeting with lawmakers",
    "description": "Photos shared online in late September 2025 authentically showed \"Trump 2028\" hats on the president's Oval Office desk during a meeting between U.S. President Donald Trump and Congressional leaders.",
    "link": "https://www.snopes.com//fact-check/trump-2028-hats-oval-office/",
    "timestamp": "2025-10-01T23:33:00Z"
  },
  {
    "title": "Even CNN Is Skeptical When Democratic Senator Denies That Party Pressure To Fight Trump Real Reason For Shutdown",
    "description": "Hunt pushed back on Sen. Gallego after he denied that the party's decision to shut down the government wasn't influenced by \"progressive pressure.\"",
    "link": "https://dailycaller.com/2025/10/01/cnn-kasie-hunt-democrat-senator-ruben-gallego-democrats-pressure-government-shut-down-progressives/",
    "timestamp": "2025-10-01T23:30:24Z"
  },
  {
    "title": "ICE Agents To Harass Bad Bunny’s Super Bowl Halftime Show, Ex-Top Trump Aide Promises: “We Will Put You In A Detention Facility, & We Will Deport You”",
    "description": "Never ones to not try to ruin a good time, Donald Trump’s Homeland Security plan to swarm Bad Bunny’s Super Bowl LX Halftime performance, the right-hand man to DHS Secretary Kristi Noem promised today. “I don’t care if it’s a concert for Johnny Smith or Bad B…",
    "link": "http://deadline.com/2025/10/bad-bunny-halftime-show-ice-agents-1236568070/",
    "timestamp": "2025-10-01T23:28:39Z"
  },
  {
    "title": "Secret Service agent fell asleep on the job at U.N. General Assembly, left his rifle unattended",
    "description": "NYPD cops took photo of firearm leaning against chair as overweight black man took bathroom break",
    "link": "https://www.wnd.com/2025/10/secret-service-agent-fell-asleep-job-u-n/",
    "timestamp": "2025-10-01T23:23:04Z"
  },
  {
    "title": "Newly elected Arizona lawmaker has yet to be sworn into office, as House Democrats welcome her",
    "description": "Democrat Adelita Grijalva has yet to take office.",
    "link": "https://www.bostonherald.com/2025/10/01/congress-grijalva/",
    "timestamp": "2025-10-01T23:22:22Z"
  },
  {
    "title": "Supreme Court allows Lisa Cook to stay on at Fed, for now",
    "description": "The high court said it’s deferring action on U.S. President Donald Trump’s bid to remove Cook while the Justice Department appeals a lower court ruling.",
    "link": "https://www.japantimes.co.jp/business/2025/10/02/lisa-cook-supreme-court/",
    "timestamp": "2025-10-01T23:18:00Z"
  },
  {
    "title": "'Family Or Career?': H-1B Workers Face Difficult Choice Amid Trump Crackdown; Call It Tragic",
    "description": "Confusion and fear gripped H-1B visa holders over the weekend as a sudden US policy change forced some to choose between family commitments abroad and their careers in the United States. President Donald Trump’s announcement of a USD 100,000 fee on H-1B visa …",
    "link": "https://freerepublic.com/focus/f-chat/4343802/posts",
    "timestamp": "2025-10-01T23:15:12Z"
  },
  {
    "title": "Trump Quietly Grants Defense Guarantee To Autocracy That Gave Him A Luxury Jet",
    "description": "Maybe Ukraine should have just given him a gold-plated 747.",
    "link": "https://www.huffpost.com/entry/trump-qatar-defense-luxury-jet_n_68dda9fae4b0c450ba64f847",
    "timestamp": "2025-10-01T23:14:26Z"
  },
  {
    "title": "What Jane Goodall Said About Donald Trump",
    "description": "Jane Goodall once compared Donald Trump's behavior to that of \"a male chimpanzee,\" while voicing concern for U.S. \"divisiveness.\"",
    "link": "https://biztoc.com/x/e59d739efab4abf9",
    "timestamp": "2025-10-01T23:12:53Z"
  },
  {
    "title": "A prolonged US government shutdown could impact your travel plans",
    "description": "A U.S. government shutdown has begun, and it could impact travel plans, with potential airport delays and cancellations",
    "link": "https://abcnews.go.com/Business/wireStory/prolonged-us-government-shutdown-impact-travel-plans-126134456",
    "timestamp": "2025-10-01T23:10:19Z"
  },
  {
    "title": "Hamas supporters cry ‘genocide’ but want it to keep going",
    "description": "Funny: The folks who've been loudest in shouting that the Gaza war is a \"genocide\" suddenly . . . don't want it to end, not if it means executing President Donald Trump’s peace plan.",
    "link": "https://nypost.com/2025/10/01/opinion/hamas-supporters-cry-genocide-but-want-it-to-keep-going/",
    "timestamp": "2025-10-01T23:08:27Z"
  },
  {
    "title": "Chicago sees record-breaking hotel stays over summer, generating nearly $1B in revenue",
    "description": "Chicago sees record-breaking hotel stays over summer, generating nearly $1B in revenueabc7chicago.com",
    "link": "https://abc7chicago.com/post/chicago-sees-record-breaking-hotel-stays-summer-generating-1b-revenue-trump-continues-bash-city/17919929/",
    "timestamp": "2025-10-01T23:06:22Z"
  },
  {
    "title": "Trump Admin Uses Agency Websites To Troll Democrats Over Shutdown",
    "description": "Federal departments under the Trump administration posted shutdown notices on their websites Wednesday blaming Democrats following the shutdown.",
    "link": "https://dailycaller.com/2025/10/01/trump-admin-troll-democrats-shutdown-justice-department-housing-urban-development/",
    "timestamp": "2025-10-01T23:04:50Z"
  },
  {
    "title": "NYPD suspends detective who snuck into Ryder Cup pretending to be on Trump's security detail",
    "description": "An NYPD detective was suspended without pay after pretending to be part of President Donald Trump's detail at the 2025 Ryder Cup at Bethpage Black this past weekend.",
    "link": "https://www.foxnews.com/sports/nypd-suspends-detective-who-snuck-ryder-cup-pretending-trumps-security-detail",
    "timestamp": "2025-10-01T23:04:41Z"
  },
  {
    "title": "EXCLUSIVE: Rep Nancy Mace heads to Clemson in wake of Kirk assassination: ‘We won’t be silenced’",
    "description": "Following Charlie Kirk's fatal shooting at Utah Valley University, Rep. Nancy Mace addresses Turning Point USA gathering at Clemson University to honor his legacy.",
    "link": "https://www.foxnews.com/politics/exclusive-rep-nancy-mace-heads-clemson-wake-kirk-assassination-we-wont-silenced",
    "timestamp": "2025-10-01T23:04:21Z"
  },
  {
    "title": "Trump's mass firings decimate city's 'largest employer' in deep-red state",
    "description": "While Arizona has evolved into a swing state and California has long since turned deep blue — even though it was a red state back in the 1970s and 1980s — Utah remains overwhelmingly Republican. Donald Trump won Utah by roughly 22 percent in 2024, and a Democ…",
    "link": "https://www.rawstory.com/trump-utah/",
    "timestamp": "2025-10-01T23:04:02Z"
  },
  {
    "title": "What a government shutdown means for San Diegans",
    "description": "The government has shutdown after Senate Republicans failed to reach an agreement on federal funding.Around 750,000 federal workers are expected to be furloughed. Many offices will be shuttered.In San Diego, tens of thousands of federal workers will be furlou…",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/what-a-government-shutdown-means-for-san-diegans",
    "timestamp": "2025-10-01T23:04:00Z"
  },
  {
    "title": "Trump signs order pledging to defend Qatar against any armed attack",
    "description": "U.S. President Donald Trump has pledged to treat any armed attack on Qatar as a threat to the United States' own security, according to a document published on Wednesday that says U.S. forces could step in to defend the Middle Eastern nation.",
    "link": "https://www.cbc.ca/news/world/trump-pledge-defend-qatar-1.7648735",
    "timestamp": "2025-10-01T23:03:10Z"
  },
  {
    "title": "Surge in Ukrainian attacks on oil refineries sparks Russian fuel shortages",
    "description": "Ukraine has attacked refineries deep inside Russia, with Zelensky vowing to continue the strikes.",
    "link": "https://www.bbc.com/news/articles/czx020k4056o",
    "timestamp": "2025-10-01T23:02:49Z"
  },
  {
    "title": "Both parties blame each other on 1st day of government shutdown as tourist sites close",
    "description": "The government shutdown has sparked intense political battles, with both parties blaming each other even as major job cuts — and major disruptions to iconic sites like the Liberty Bell and Pearl Harbor — have begun taking hold",
    "link": "https://abcnews.go.com/US/wireStory/parties-blame-1st-day-government-shutdown-tourist-sites-126136303",
    "timestamp": "2025-10-01T23:02:21Z"
  },
  {
    "title": "Chuck Schumer Will Be the Biggest Loser of Government Shutdown",
    "description": "The government officially entered a shutdown at 12:01 AM Wednesday after Democrats rejected multiple offers from Republicans to keep the lights on and pass a continuing resolution (CR). While both parties are predictably pointing the finger at one another, al…",
    "link": "https://freerepublic.com/focus/f-news/4343797/posts",
    "timestamp": "2025-10-01T23:00:42Z"
  },
  {
    "title": "NATO allies clash after Russian jets breach airspace, testing alliance resolve",
    "description": "Russian incursions into NATO airspace are fueling divisions among allies, with some warning that repeated Article 4 signals risk weakening deterrence without real action.",
    "link": "https://www.foxnews.com/politics/nato-allies-clash-after-russian-jets-breach-airspace-testing-alliance-resolve",
    "timestamp": "2025-10-01T23:00:39Z"
  },
  {
    "title": "Pope Leo XIV Takes a Thinly Veiled Swipe at Trump While Defending Sen. Dick Durbin: ‘If You’re Against Abortion but Support the Inhuman Treatment of Immigrants — That’s Not Pro-Life’",
    "description": "It just keeps getting worse.\nThe post Pope Leo XIV Takes a Thinly Veiled Swipe at Trump While Defending Sen. Dick Durbin: ‘If You’re Against Abortion but Support the Inhuman Treatment of Immigrants — That’s Not Pro-Life’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/pope-leo-xiv-takes-thinly-veiled-swipe-trump/",
    "timestamp": "2025-10-01T23:00:02Z"
  },
  {
    "title": "JD Vance Taunts Hakeem Jeffries Over Claim That Trump AI Video Is Racist: 'Is He a Mexican-American?'",
    "description": "Vice President JD Vance taunted House Minority Leader Hakeem Jeffries after he called an AI-generated video posted by President Donald Trump that showed him wearing a sombrero racist",
    "link": "https://www.ibtimes.com/jd-vance-taunts-hakeem-jeffries-over-claim-that-trump-ai-video-racist-he-mexican-american-3785160",
    "timestamp": "2025-10-01T22:59:48Z"
  },
  {
    "title": "YouTube Bends the Knee",
    "description": "Welcome to the era of Big-Tech capitulation.",
    "link": "https://www.theatlantic.com/technology/2025/10/youtube-trump-settlement/684431/",
    "timestamp": "2025-10-01T22:58:00Z"
  },
  {
    "title": "\"I think it's funny\": JD Vance defends Trump's AI-generated post about Dem leaders",
    "description": "I think it's funny,” Vice President JD Vance said when asked about President Donald Trump sharing AI-generated memes of ...",
    "link": "https://biztoc.com/x/19e4ac0a14e26a2a",
    "timestamp": "2025-10-01T22:57:14Z"
  },
  {
    "title": "Fired Surface Transportation Board member sues Trump over his dismissal ahead of rail merger review",
    "description": "A former Democratic member of the U.S. Surface Transportation Board has filed a lawsuit challenging his dismissal by President Donald Trump",
    "link": "https://abcnews.go.com/Business/wireStory/fired-surface-transportation-board-member-sues-trump-dismissal-126135218",
    "timestamp": "2025-10-01T22:54:27Z"
  },
  {
    "title": "South Korea foreign minister says rough agreement on security reached with US",
    "description": "SEOUL (Reuters) -South Korean Foreign Minister Cho Hyun said his country and the United States had reached a rough agreement on security in tandem with...",
    "link": "https://www.yahoo.com/news/articles/south-korea-foreign-minister-says-225350928.html",
    "timestamp": "2025-10-01T22:53:50Z"
  },
  {
    "title": "Kaitlan Collins checks Johnson on free health care to ‘illegal aliens’ claim - NewsBreak",
    "description": "Kaitlan Collins fact checks House Speaker Mike Johnson over his claim that Medicaid was being used by “illegal aliens.”",
    "link": "https://www.newsbreak.com/share/4266733386682-kaitlan-collins-checks-johnson-on-free-health-care-to-illegal-aliens-claim?_f=app_share&amp;pd=07O2OEa6&amp;lang=en_US&amp;send_time=1759359085&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.38.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control%2Csc_ios_comment_share_v2-v3&amp;s=i2",
    "timestamp": "2025-10-01T22:52:50Z"
  },
  {
    "title": "Democrats voted for a shutdown and now have to find a way out",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn’t extend or restore health care benefits, choosing instead to force a government shutdown. Now they have to figure out how to get out of it. Just hours after the shutdown beg…",
    "link": "https://apnews.com/article/democrats-republicans-shutdown-negotiations-votes-health-care-29b11579bfc694a52b9e8e272a47bb91",
    "timestamp": "2025-10-01T22:51:24Z"
  },
  {
    "title": "RBI allows banks to fund M&As, lend in rupee to residents of India’s neighbours",
    "description": "To give primary markets a boost, limit on loan against shares raised to Rs 1 crore from Rs 25 lakh.",
    "link": "https://indianexpress.com/article/business/rbi-allows-banks-to-fund-mas-lend-in-rupee-to-residents-of-indias-neighbours-10283012/",
    "timestamp": "2025-10-01T22:50:49Z"
  },
  {
    "title": "Malaysia sends word on Trump visit, Delhi looks at a meeting between PM and him",
    "description": "This has opened a window for Delhi to look at a possible bilateral meeting between Prime Minister Narendra Modi and President Trump on the sidelines of the East Asia summit.",
    "link": "https://indianexpress.com/article/india/malaysia-sends-word-on-trump-visit-delhi-looks-at-a-meeting-between-pm-and-him-10283023/",
    "timestamp": "2025-10-01T22:50:14Z"
  },
  {
    "title": "Horrifying 911 Audio of Iryna Zarutska Stabbing, Witness Saw Ton of Blood",
    "description": "The 911 audio of the Iryna Zarutska fatal stabbing aboard a North Carolina train captures the sheer horror right after the unprovoked attack ... with callers seemingly resigned to the fact she was already dead. TMZ obtained the audio recording of…",
    "link": "https://www.tmz.com/2025/10/01/iryna-zarutska-decarlos-brown-911-audio/",
    "timestamp": "2025-10-01T22:48:24Z"
  },
  {
    "title": "South Korea foreign minister says rough agreement on security reached with US",
    "description": "SEOUL (Reuters) -South Korean Foreign Minister Cho Hyun said his country and the United States had reached a rough agreement on security in tandem with...",
    "link": "https://www.yahoo.com/news/articles/south-korea-foreign-minister-says-224549816.html",
    "timestamp": "2025-10-01T22:45:49Z"
  },
  {
    "title": "Federal lawsuit to limit access to abortion pill moved from Texas to Missouri",
    "description": "A federal case challenging the safety of mifepristone, used to treat miscarriages and to induce abortions early in pregnancy, is being transferred out of...",
    "link": "https://missouriindependent.com/2025/10/01/federal-lawsuit-limit-access-abortion-pill-mifepristone-texas-missouri/",
    "timestamp": "2025-10-01T22:45:39Z"
  },
  {
    "title": "Pro-Trump Rapper Sheff G Sentenced For Attempted Murder",
    "description": "The artist was among the notable names Trump touted as he worked to woo Black voters during his 2024 presidential campaign.",
    "link": "https://www.huffpost.com/entry/pro-trump-rapper-sheff-g-attempted-murder-sentence_n_68dda9fbe4b06c0a3a8c5426",
    "timestamp": "2025-10-01T22:43:55Z"
  },
  {
    "title": "'Something bad is gonna happen': Ex-GOP rep shares grim prediction for Trump's ICE",
    "description": "President Donald Trump's efforts to deport immigrants have created a \"frightening\" possibility, according to a former GOP lawmaker. Adam Kinzinger, a former Republican representative from Illinois, joined CNN's Jake Tapper on \"The Lead\" on Wednesday to discus…",
    "link": "https://www.rawstory.com/adam-kinzinger-2674146030/",
    "timestamp": "2025-10-01T22:42:03Z"
  },
  {
    "title": "White House views Portland protests as opening to pursue Trump’s crime crackdown | CNN Politics",
    "description": "When President Donald Trump announced he was sending troops to “protect war-ravaged” Portland, his administration cited the need to protect Immigration and Customs Enforcement facilities from persistent demonstration.",
    "link": "https://www.cnn.com/2025/10/01/politics/portland-oregon-trump-crime-crackdown",
    "timestamp": "2025-10-01T22:41:45Z"
  },
  {
    "title": "The government shutdown is here. How does it end?",
    "description": "The bill Democrats voted against was a simple extension of funding for 45 days.",
    "link": "https://www.bostonherald.com/2025/10/01/government-shutdown-how-does-it-end/",
    "timestamp": "2025-10-01T22:40:18Z"
  },
  {
    "title": "Jane Fonda Leads Reboot of Father's McCarthy-Era Free Speech Initiative",
    "description": "As the US descends into authoritarianism under President Donald Trump and Republicans, hundreds of celebrities led by actor and progressive activist Jane Fonda on Wednesday revived a free speech initiative originally launched by Hollywood stars including her …",
    "link": "https://www.commondreams.org/news/fonda-first-amendment",
    "timestamp": "2025-10-01T22:39:49Z"
  },
  {
    "title": "REPORT: NYPD Cop Snuck into Ryder Cup in Tactical Gear, Claimed He Was Working Security for Trump",
    "description": "An exclusive report in the New York Post claims that an NYPD detective on sick leave gained entry into the Ryder Cup by wearing full tactical gear and claiming he was working security for President Trump.\nThe post REPORT: NYPD Cop Snuck into Ryder Cup in Tact…",
    "link": "https://www.breitbart.com/sports/2025/10/01/report-nypd-cop-snuck-into-ryder-cup-in-tactical-gear-claimed-he-was-working-security-for-trump/",
    "timestamp": "2025-10-01T22:39:37Z"
  },
  {
    "title": "Senate Confirms Hung Cao to Serve as Under Secretary of the Navy",
    "description": "Retired U.S. Navy captain and former Virginia Republican Senate candidate Hung Cao was confirmed to serve as the Under Secretary of the U.S. Navy in a 52-45 vote by the U.S. Senate on Wednesday.\nThe post Senate Confirms Hung Cao to Serve as Under Secretary of…",
    "link": "https://www.breitbart.com/politics/2025/10/01/senate-confirms-hung-cao-to-serve-as-under-secretary-of-the-navy/",
    "timestamp": "2025-10-01T22:39:19Z"
  },
  {
    "title": "Jim Jordan Identifies The One Person Who Knows When Shutdown Ends",
    "description": "Republican Ohio Rep. Jim Jordan said on CNN Wednesday that Senate Minority Leader Chuck Schumer holds the key to ending the looming government shutdown.",
    "link": "https://dailycaller.com/2025/10/01/jim-jordan-government-shutdown-chuck-schumer/",
    "timestamp": "2025-10-01T22:37:52Z"
  },
  {
    "title": "‘Stop it’: Maxine Waters goes after reporter asks about health care for illegals, Trump chimes in",
    "description": "'You don't have to ask that question' after she confirms that is Democrats' top line item",
    "link": "https://www.wnd.com/2025/10/stop-it-maxine-waters-goes-after-reporter-asks/",
    "timestamp": "2025-10-01T22:34:42Z"
  },
  {
    "title": "Schumer Says Trump Isn't The Biggest Villain In Shutdown Standoff",
    "description": "During a Wednesday appearance on \"Morning Joe,\" the Senate minority leader blamed this Republican for sabotaging negotiations over a bipartisan budget bill.",
    "link": "https://www.huffpost.com/entry/chuck-schumer-mike-johnson-bad-guy-government-shutdown_n_68dd82e7e4b0c450ba64c795",
    "timestamp": "2025-10-01T22:33:07Z"
  },
  {
    "title": "Jane Fonda slammed Democratic leaders as 'not good enough' in fight against Trump",
    "description": "Actress Jane Fonda spoke to CNN’s Dana Bash about relaunching her father’s Committee for the First Amendment in response to President Donald Trump on Wednesday.",
    "link": "https://www.foxnews.com/media/jane-fonda-slammed-democratic-leaders-not-good-enough-fight-against-trump",
    "timestamp": "2025-10-01T22:31:48Z"
  },
  {
    "title": "Johnson accuses Schumer of blocking ‘real discussion’ to keep government open",
    "description": "House Republicans and Senate Democrats remain deadlocked over government funding as Speaker Mike Johnson criticizes Senate Minority Leader Chuck Schumer's political calculations.",
    "link": "https://www.foxnews.com/politics/johnson-accuses-schumer-blocking-real-discussion-keep-government-open",
    "timestamp": "2025-10-01T22:30:21Z"
  },
  {
    "title": "WATCH: Bondi discusses federal law enforcement task force deployment to Memphis",
    "description": "Defense Secretary Pete Hegseth and U.S. Attorney General Pam Bondi met with Tennessee Gov. Bill Lee in Memphis on Wednesday, shortly after a task force of federal law enforcement agencies ordered by President Donald Trump began operating in the city.",
    "link": "https://biztoc.com/x/eea3354219bc7a3c",
    "timestamp": "2025-10-01T22:27:51Z"
  },
  {
    "title": "Never-Trumper Tim Miller Learns Common Sense",
    "description": "A writer challenged the Daily Caller's Dylan Housman in a debate Sept. 26 on mass shootings and transgenderism.",
    "link": "https://dailycaller.com/2025/10/01/never-trumper-tim-miller-daily-caller-trump-interview-white-house/",
    "timestamp": "2025-10-01T22:26:40Z"
  },
  {
    "title": "A new China tech visa has caught India's attention - now locals aren't happy",
    "description": "China's aim to attract global talent comes as the US is making it harder to bring in foreign workers.",
    "link": "https://www.bbc.com/news/articles/cvg4eeerzrwo",
    "timestamp": "2025-10-01T22:24:03Z"
  },
  {
    "title": "Trump admin adds banner attacking ‘Radical Left Democrats’ to government websites",
    "description": "The Trump administration has put up banners across federal websites blaming Democrats for the government shutdown, and in some cases, blatantly campaigning for President Donald Trump. One banner on the US Department of Agriculture’s site says, “The Radical Le…",
    "link": "https://www.theverge.com/news/790280/trump-admin-government-shutdown-banner-democrats",
    "timestamp": "2025-10-01T22:23:19Z"
  },
  {
    "title": "A prolonged US government shutdown could impact your travel plans",
    "description": "Travelers could see longer TSA lines and flight issues if the shutdown continues.",
    "link": "https://www.denverpost.com/2025/10/01/government-shutdown-travel/",
    "timestamp": "2025-10-01T22:22:31Z"
  },
  {
    "title": "A prolonged US government shutdown could impact your travel plans",
    "description": "Travelers could see longer TSA lines and flight issues if the shutdown continues.",
    "link": "https://www.bostonherald.com/2025/10/01/government-shutdown-travel/",
    "timestamp": "2025-10-01T22:22:31Z"
  },
  {
    "title": "Russia remains top uranium fuel supplier to US – Energy Department data",
    "description": "Russia is the biggest supplier of nuclear fuel to the US, the Department of Energy shows Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625725-russia-top-us-nuclear-supplier/",
    "timestamp": "2025-10-01T22:22:12Z"
  },
  {
    "title": "WATCH: Bondi discusses federal law enforcement task force deployment to Memphis",
    "description": "Defense Secretary Pete Hegseth and U.S. Attorney General Pam Bondi met with Tennessee Gov. Bill Lee in Memphis on Wednesday, shortly after a task force of federal law enforcement agencies ordered by President Donald Trump began operating in the city.",
    "link": "https://www.pbs.org/newshour/politics/watch-bondi-discusses-federal-law-enforcement-task-force-deployment-to-memphis",
    "timestamp": "2025-10-01T22:20:44Z"
  },
  {
    "title": "What the West Might Not Understand About Putin’s Psyche",
    "description": "WARSAW, Poland—Maintaining power in Russia was and is a key motivator for Russian President Vladimir Putin in the war against Ukraine, according to the defense... Read More\nThe post What the West Might Not Understand About Putin’s Psyche  appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/10/01/what-west-might-not-understand-about-putins-psyche/",
    "timestamp": "2025-10-01T22:19:56Z"
  },
  {
    "title": "Trump budget boss on shutdown: Mass federal firings will begin in 'a day or two'",
    "description": "OMB Director Russell Vought told House Republicans in a private call on Oct. 1 that mass layoffs of federal workers will begin in \"a day or two.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/01/trump-budget-chief-russell-vought-mass-firings-shutdown/86463306007/",
    "timestamp": "2025-10-01T22:16:57Z"
  },
  {
    "title": "Federal workers' tough year has seen DOGE, government shutdown. Now they face new layoffs.",
    "description": "As of Sept. 23, over 201,000 civil servants have left the workforce and the White House is threatening additional cuts.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/01/looming-layoffs-federal-workers/86456233007/",
    "timestamp": "2025-10-01T22:16:00Z"
  },
  {
    "title": "Trump administration freezes 18-billion in funding to new york city, in Funding to New York City, Citing 'Unconstitutional DEI Principles'",
    "description": "On the first day of a federal government shutdown, New York City is finding out how expensive its commitment to leftist principles of \"diversity, equity, and inclusion\" is going to be under President Donald Trump's administration. Russ Vought, the White House…",
    "link": "https://freerepublic.com/focus/f-news/4343789/posts",
    "timestamp": "2025-10-01T22:14:26Z"
  },
  {
    "title": "‘Could have been an email’: Officials balk at Hegseth's generals meeting (barf alert)",
    "description": "Defense Secretary Pete Hegseth’s speech to top generals was supposed to serve as a rallying cry for military exceptionalism — but it didn’t land that way with many of the people it was targeting. Numerous defense officials — who watched senior brass scramble …",
    "link": "https://freerepublic.com/focus/f-news/4343788/posts",
    "timestamp": "2025-10-01T22:12:10Z"
  },
  {
    "title": "‘They have made me an enemy’: Liberal celebrity lawyer pledges support for Republicans in midterms",
    "description": "Abandoning Democrats because they have 'moved away from American values … from values of decency'",
    "link": "https://www.wnd.com/2025/10/they-have-made-me-enemy-liberal-celebrity-lawyer/",
    "timestamp": "2025-10-01T22:12:03Z"
  },
  {
    "title": "Trump admin will keep Statue of Liberty open during government shutdown",
    "description": "The Trump administration will keep the Statue of Liberty and Ellis Island open during the partial government shutdown.",
    "link": "https://nypost.com/2025/10/01/us-news/trump-admin-will-keep-statue-of-liberty-open-during-government-shutdown/",
    "timestamp": "2025-10-01T22:10:12Z"
  },
  {
    "title": "Pope Leo Breaks Down Why MAGA Is 'Not Really' Pro-Life",
    "description": "Press secretary Karoline Leavitt later responded to the pontiff’s sly criticism of President Donald Trump.",
    "link": "https://www.huffpost.com/entry/pope-leo-breaks-down-why-maga-is-not-really-pro-life_n_68dd802ae4b0c450ba64c434",
    "timestamp": "2025-10-01T22:08:30Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Major U.S. stock indexes closed in the green on Wednesday on hopes that the funding stoppage would be brief and limit any serious effects on the economy.",
    "link": "https://www.cnbc.com/2025/10/01/stock-market-today-live-updates.html",
    "timestamp": "2025-10-01T22:08:28Z"
  },
  {
    "title": "ICE Will Be at Bad Bunny's Super Bowl Halftime Show, Trump Advisor Says",
    "description": "ICE agents will be at Bad Bunny's Super Bowl Halftime Show in 2026, according to one of Donald Trump's advisors.",
    "link": "http://www.billboard.com/music/music-news/ice-bad-bunny-super-bowl-halftime-show-trump-advisor-1236080750/",
    "timestamp": "2025-10-01T22:08:06Z"
  },
  {
    "title": "Investigating claims HUD website's 'radical left' pop-ups violated Hatch Act",
    "description": "A message on the U.S. Department of Housing and Urban Development website blamed the October 2025 federal government shutdown on \"The Radical Left.\"",
    "link": "https://www.snopes.com//news/2025/10/01/hud-hatch-act-website-message/",
    "timestamp": "2025-10-01T22:08:00Z"
  },
  {
    "title": "New Poll Shows Americans Overwhelmingly Oppose Government Restrictions on Speech — Split on Kimmel’s Suspension",
    "description": "A recent poll showed that while Americans are overwhelmingly against government restrictions on free speech, their views on the temporary suspension of late night talk show host Jimmy Kimmel was more varied, with noticeable differences along party lines.\nThe …",
    "link": "https://www.mediaite.com/politics/new-poll-shows-americans-overwhelmingly-oppose-government-restrictions-on-speech-split-on-kimmels-suspension/",
    "timestamp": "2025-10-01T22:07:54Z"
  },
  {
    "title": "This Data Center IPO Shows Wall Street Is Still Hungry for AI Stocks",
    "description": "Shares of Fermi, the developer of one of the world’s largest AI data center campuses, soared on their first day of trading Wednesday in yet another sign of...",
    "link": "https://www.investopedia.com/this-data-center-ipo-shows-wall-street-still-hungry-for-ai-stocks-11822786",
    "timestamp": "2025-10-01T22:06:57Z"
  },
  {
    "title": "'Full-blown dementia': Analyst sounds alarm at Trump's 'depraved and demeaning' speech",
    "description": "A former federal prosecutor is sounding the alarm over President Donald Trump's speech to the military's top brass, which he called \"depraved and demeaning.\"Trump and Secretary of Defense Pete Hegseth spoke on Tuesday at a hastily organized meeting of America…",
    "link": "https://www.rawstory.com/glenn-kirschner-2674145908/",
    "timestamp": "2025-10-01T22:06:03Z"
  },
  {
    "title": "White House freezes funds for Democratic states in shutdown slap",
    "description": "WASHINGTON (Reuters) -President Donald Trump's administration on Wednesday froze $26 billion for Democratic-leaning states, following through on a threat to ...",
    "link": "https://www.yahoo.com/news/articles/white-house-freezes-funds-democratic-220545679.html",
    "timestamp": "2025-10-01T22:05:45Z"
  },
  {
    "title": "What to Expect From Diddy’s Sentencing",
    "description": "Could Diddy speak during his sentencing? Here’s everything we’re expecting to happen in court this Friday.",
    "link": "http://www.vulture.com/article/what-to-expect-from-diddys-sentencing-experts-weigh-in.html",
    "timestamp": "2025-10-01T22:04:41Z"
  },
  {
    "title": "Jane Fonda revives Cold War-era activist group following Jimmy Kimmel suspension",
    "description": "Jane Fonda announced she had launched a 21st century incarnation of the Committee for the First Amendment.",
    "link": "https://nypost.com/2025/10/01/entertainment/jane-fonda-revives-cold-war-era-activist-group-following-jimmy-kimmel-suspension/",
    "timestamp": "2025-10-01T22:03:54Z"
  },
  {
    "title": "Here's what Trump wants to do to reshape the federal government during the shutdown",
    "description": "The government shutdown began Wednesday as Congress failed to pass a funding package, while President Donald Trump sees opportunity to cut federal programs and employees.",
    "link": "https://www.foxnews.com/politics/heres-what-trump-wants-do-reshape-federal-government-during-shutdown",
    "timestamp": "2025-10-01T22:01:18Z"
  },
  {
    "title": "Duckworth says Hegseth's views on women in combat show he's unfit as Defense Secretary",
    "description": "Women veterans are denouncing Defense Secretary Pete Hegseth's speech to senior military leaders, specifically his agenda for military fitness.",
    "link": "https://www.cbsnews.com/chicago/news/tammy-duckworth-pete-hegseth-women-in-military-fitness/",
    "timestamp": "2025-10-01T22:00:46Z"
  },
  {
    "title": "The Return of Economic Statecraft",
    "description": "Economic statecraft is no longer an exception; it is the norm. If the European Union wants to shape events rather than be shaped by them, it must accept that reality.",
    "link": "https://www.rand.org/pubs/commentary/2025/10/the-return-of-economic-statecraft.html",
    "timestamp": "2025-10-01T22:00:00Z"
  },
  {
    "title": "Lawrence O’Donnell Says the ‘Orange Junk’ on Trump’s Face Is Proof the President Has Poor Judgement | Video",
    "description": "\"The man has no capacity to make judgement about anything, including the way he looks, never mind nuclear weapons,\" the \"Last Word\" host says\nThe post Lawrence O’Donnell Says the ‘Orange Junk’ on Trump’s Face Is Proof the President Has Poor Judgement | Video …",
    "link": "https://www.thewrap.com/lawrence-odonnell-trump-military-meeting/",
    "timestamp": "2025-10-01T21:59:57Z"
  },
  {
    "title": "Trump remains open to talks with Kim Jong Un as South Korea warns of North Korean missile reach",
    "description": "The White House said President Trump was open to talks with Kim as South Korea warns North Korea’s missiles could reach the US mainland.",
    "link": "https://www.foxnews.com/world/white-house-trump-remains-open-talks-kim-jong-un-south-korea-warns-north-korean-missile-reach",
    "timestamp": "2025-10-01T21:59:53Z"
  },
  {
    "title": "Elizabeth Warren on why Democrats had to shut down the government",
    "description": "At midnight on Wednesday, the federal government shut down. Democrats made good on their promise to vote against a continuing resolution if Republicans didn’t extend expiring Obamacare tax credits, and funding expired. Now, both sides are digging in to play t…",
    "link": "https://www.vox.com/podcasts/463479/elizabeth-warren-government-shutdown-health-care-trump",
    "timestamp": "2025-10-01T21:56:13Z"
  },
  {
    "title": "'You keep pushing back': Senator gets in fiery exchange with CNN anchor over 'gibberish'",
    "description": "CNN anchor Kasie Hunt engaged in a heated exchange with Sen. Ruben Gallego (D-AZ) on Wednesday, with the frustrated senator complaining, “You keep pushing back,” in response to GOP claims that Democrats and far-left groups are responsible for the ongoing gove…",
    "link": "https://www.rawstory.com/government-shutdown-2674145903/",
    "timestamp": "2025-10-01T21:56:02Z"
  }
]