[
  {
    "title": "The U.S. imposed a blockade on sanctioned oil tankers tied to Venezuela. How is that working out?",
    "description": "Questioned over the weekend about how the U.S. government will take over governing Venezuela, Secretary of State Marco Rubio instead shifted the focus to the U.S. blockade of sanctioned oil tankers. CBC News looks at the origins of the blockade, what it entai…",
    "link": "https://www.cbc.ca/news/world/trump-venezuela-oil-blockade-9.7035168",
    "timestamp": "2026-01-07T09:00:00Z"
  },
  {
    "title": "Canadian tourists voice concerns over Caribbean travel after U.S. strike on Venezuela",
    "description": "Travellers planning trips to the Caribbean are voicing trepidation online after the U.S. strike on Venezuela that captured president Nicolás Maduro, while one Latin America expert says it's not a good time to travel to the region.",
    "link": "https://www.cbc.ca/news/canada/venezuela-caribbean-aruba-curacao-travel-safe-9.7034954",
    "timestamp": "2026-01-07T09:00:00Z"
  },
  {
    "title": "Minerals and influence: inside the great powers' battle for Africa",
    "description": "As Donald Trump reshapes global trade and cuts foreign aid, countries around the world are being forced to adapt fast - and some ...",
    "link": "https://biztoc.com/x/1ffb8bd176494c53",
    "timestamp": "2026-01-07T08:53:39Z"
  },
  {
    "title": "'QAnon Shaman' turns against Donald Trump and says he will run for Arizona governor",
    "description": "The 'QAnon Shaman', who became the face of the US Capitol riots, has turned against US President Donald Trump and said he will run for Arizona governor.",
    "link": "https://news.sky.com/story/qanon-shaman-turns-against-donald-trump-and-says-he-will-run-for-arizona-governor-13491408",
    "timestamp": "2026-01-07T08:53:00Z"
  },
  {
    "title": "White House Says Trump May Consider Military As 'Option' To Acquire Greenland Even As Marco Rubio Reportedly Downplays It",
    "description": "The White House has confirmed that President Donald Trump may consider employing the U.S. military to acquire Greenland, a Danish territory, but Secretary of State Marco Rubio has reportedly downplayed it. \nNational Security Concerns Spur Control Talks\nWhite …",
    "link": "https://biztoc.com/x/dad8a4f8508e0f65",
    "timestamp": "2026-01-07T08:52:29Z"
  },
  {
    "title": "Trumpian imperialism",
    "description": "By Zahid Hussain THE image of a blindfolded and handcuffed Nicolás Maduro being taken to a prison in New York […]\nThe post Trumpian imperialism appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2026/01/07/trumpian-imperialism/",
    "timestamp": "2026-01-07T08:52:00Z"
  },
  {
    "title": "China Slams US ‘Bullying’ Over Pressure on Venezuela to Cut Ties",
    "description": "China criticized the Trump administration’s reported call for Venezuela to sever its alliances with US rivals, labeling the move a “bullying act” as their competition for influence in the region emerges as a new source of friction.",
    "link": "https://financialpost.com/pmn/business-pmn/china-slams-us-bullying-over-pressure-on-venezuela-to-cut-ties",
    "timestamp": "2026-01-07T08:45:30Z"
  },
  {
    "title": "$133 Billion At Risk: The Supreme Court Case Markets Misunderstand",
    "description": "What Happens Friday — And Why This Is Not Just a Court Case\nFriday, the U.S. Supreme Court will begin the process of deciding whether the “emergency” tariffs, which President Donald Trump used the International Emergency Economic Powers\nFriday, the U.S. Supre…",
    "link": "https://biztoc.com/x/79631c391f3a59a3",
    "timestamp": "2026-01-07T08:41:28Z"
  },
  {
    "title": "Jimmy Kimmel Slams White House for ‘Revisionist’ Version of Jan. 6 Insurrection",
    "description": "Jimmy Kimmel criticized Donald Trump and the White House for posting a \"revisionist\" version of the events at the U.S. Capitol on Jan. 6, 2021.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-white-house-jan-6-insurrection-revisionist-1235495238/",
    "timestamp": "2026-01-07T08:37:19Z"
  },
  {
    "title": "New restrictions: Government plans every driver will care about",
    "description": "Three things from Sam Coates and Anne McElvoy to start your political day. What the government is having to deal with: the unpredictability of Donald Trump. Just as Britain signs up to troops in Ukraine if there’s a peace deal, it’s having to use its best dip…",
    "link": "https://www.politico.eu/podcast/politics-at-sam-and-annes/new-restrictions-government-plans-every-driver-will-care-about/",
    "timestamp": "2026-01-07T08:35:56Z"
  },
  {
    "title": "Little Marco Spills Trump’s New Plan for Greenland Takeover",
    "description": "Secretary of State Marco Rubio told lawmakers on Monday that President Donald Trump is planning to buy, rather than invade, Greenland. The New York Times...",
    "link": "https://www.thedailybeast.com/little-marco-rubio-spills-trumps-new-plan-for-greenland-takeover/",
    "timestamp": "2026-01-07T08:33:45Z"
  },
  {
    "title": "Iran. Cel puțin 36 de persoane au fost ucise în timpul protestelor din ultimele zile, conform unui ONG pentru drepturile omului. Manifestațiile au fost declanșate de deprecierea monedei și creșterea costului de trai.",
    "description": "Video from today in Tehran. The fact that the crowds have only grown in size in the protests in #Iran after the regime offered Iranians $7 per month (which is insulting given how much Tehran gives #Hezbollah operatives per month) in a gimmick to placate them …",
    "link": "https://www.biziday.ro/344211-2/",
    "timestamp": "2026-01-07T08:31:16Z"
  },
  {
    "title": "Iran. Cel puțin 36 de persoane au fost ucise în timpul protestelor din ultimele zile, conform unui ONG pentru drepturile omului. Manifestațiile au fost declanșate de deprecierea monedei și creșterea costului de trai.",
    "description": "Video from today in Tehran. The fact that the crowds have only grown in size in the protests in #Iran after the regime offered Iranians $7 per month (which is insulting given how much Tehran gives #Hezbollah operatives per month) in a gimmick to placate them …",
    "link": "https://www.biziday.ro/iran-cel-putin-36-de-persoane-au-fost-ucise-in-timpul-protestelor-din-ultimele-zile-conform-unui-ong-pentru-drepturile-omului-manifestatiile-au-fost-declansate-de-deprecierea-monedei-si-cresterea-c/",
    "timestamp": "2026-01-07T08:31:16Z"
  },
  {
    "title": "Word of the year for 2025: All sorts of picks have been made but here’s one that deserves the crown",
    "description": "Anyone who doesn’t know what ‘AI slop’ or ‘rage bait’ mean may be forgiven—and might have a point. As word-of-the-year selections chase fleeting internet slang instead of capturing the zeitgeist, we should ask what we’re missing. Let's name a global word of t…",
    "link": "https://www.livemint.com/opinion/online-views/word-of-the-year-2025-ai-slop-rage-bait-vibe-coding-tariffs-11767687643109.html",
    "timestamp": "2026-01-07T08:30:55Z"
  },
  {
    "title": "Texas teachers’ union sues state education agency over investigations into social media posts about Charlie Kirk",
    "description": "A Texas teachers' union has sued the state's education agency, alleging free speech violations. The union claims educators were targeted for social media posts after conservative activist Charlie Kirk's assassination. The agency's directive to track \"vile con…",
    "link": "https://timesofindia.indiatimes.com/education/news/texas-teachers-union-sues-state-education-agency-over-investigations-into-social-media-posts-about-charlie-kirk/articleshow/126390437.cms",
    "timestamp": "2026-01-07T08:27:37Z"
  },
  {
    "title": "In post-Maduro Venezuela, US eyes security chief as potential target, sources say",
    "description": "America is pressuring Venezuela's interior minister, Diosdado Cabello. He must help Interim President Delcy Rodriguez maintain order after Nicolas Maduro's fall. Cabello controls security forces accused of human rights abuses. The US wants his cooperation to …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/in-post-maduro-venezuela-us-eyes-security-chief-as-potential-target-sources-say/articleshow/126390384.cms",
    "timestamp": "2026-01-07T08:21:04Z"
  },
  {
    "title": "'Nobody saw that': Stephen Colbert ridicules Trump over woeful Kennedy Center update",
    "description": "Stephen Colbert has ridiculed Donald Trump after viewing figures for the president's Kennedy Center Honors were released.The Late Show host, who has appeared at the Kennedy Center Honors show in the past, jokingly bragged about the viewership of previous awar…",
    "link": "https://www.rawstory.com/trump-kennedy-center-2674854987/",
    "timestamp": "2026-01-07T08:18:47Z"
  },
  {
    "title": "Oil prices fall as analysts forecast an increase in Venezuela’s production",
    "description": "Analysts predict Venezuela’s output could rise by up to 500,000 barrels per day over the next two years\nThe post Oil prices fall as analysts forecast an increase in Venezuela’s production appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/01/07/oil-prices-fall-as-analysts-forecast-an-increase-in-venezuelas-production/",
    "timestamp": "2026-01-07T08:16:50Z"
  },
  {
    "title": "Trump announces 30–50 million barrels of Venezuelan oil to U.S., tensions rise after Maduro capture",
    "description": "WASHINGTON: U.S. President Donald Trump announced Tuesday that Venezuela will supply 30 to 50 million barrels of oil to the United States at market prices, pledging that proceeds from the sale will benefit the people of both countries. The announcement comes …",
    "link": "https://english.khabarhub.com/2026/07/514837/",
    "timestamp": "2026-01-07T08:15:31Z"
  },
  {
    "title": "EU must stop treating US as its main ally – Borrell",
    "description": "The US is no longer the EU’s chief ally, Josep Borrell has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630689-eu-us-no-allies-borrell/",
    "timestamp": "2026-01-07T08:13:54Z"
  },
  {
    "title": "France: working with allies on plan should US make move on Greenland",
    "description": "PARIS, Jan ‌7 (Reuters) - France is working ‌with partners on a ‌plan over how to respond should the United States act ‍on its threat ‍to take over ‌Greenland, Foreign Affairs Minister Jean-Noel ‍Barrot ​said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/07/france-working-with-allies-on-plan-should-us-make-move-on-greenland",
    "timestamp": "2026-01-07T08:08:00Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Support pledges for Ukraine, Venezuelan oil and McEntee meets Troubles families…",
    "link": "https://www.thejournal.ie/headlines-8-at-8-6919950-Jan2026/",
    "timestamp": "2026-01-07T08:06:09Z"
  },
  {
    "title": "Trump wants to ‘buy Greenland’ rather than invade it, says US secretary of state",
    "description": "Marco Rubio says US president has asked aides for updated plan on acquiring the territory",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/06/us/politics/rubio-trump-greenland.html",
    "timestamp": "2026-01-07T08:05:39Z"
  },
  {
    "title": "France ‘working with allies on plan should US make move on Greenland’; Taoiseach says ‘common sense needs to prevail’",
    "description": "France is working with partners on a plan over how to respond should the United States act on its threat to take over Greenland, Foreign Affairs Minister Jean-Noel Barrot said on Wednesday.",
    "link": "https://www.independent.ie/world-news/europe/france-working-with-allies-on-plan-should-us-make-move-on-greenland-taoiseach-says-common-sense-needs-to-prevail/a737377639.html",
    "timestamp": "2026-01-07T08:00:00Z"
  },
  {
    "title": "2025 Brought Chaos for International Students. In 2026, Institutions Hope to Adapt",
    "description": "2025 Brought Chaos for International Students. In 2026, Institutions Hope to Adapt\n\n \n\n\n \nJohanna Alonso\n\nWed, 01/07/2026 - 03:00 AM\n\nVisa appointment delays, threats to OPT, SEVIS revocations and more made 2025 a complicated and ever-changing environment. Co…",
    "link": "https://www.insidehighered.com/news/global/international-students-us/2026/01/07/how-colleges-hope-approach-international-higher-ed",
    "timestamp": "2026-01-07T08:00:00Z"
  },
  {
    "title": "Gobsmacking Fabulists 'R Us",
    "description": "For the anniversary of the Jan. 6 riot that almost toppled democracy (more quickly than now), the hacks and crackpots in power have concocted a deranged revisionist history of such \"evil,\" \"pathological,\" \"Stalin-level propaganda\" it's somehow dragged us even…",
    "link": "https://www.commondreams.org/further/gobsmacking-fabulists-r-us",
    "timestamp": "2026-01-07T07:57:13Z"
  },
  {
    "title": "30-50 million barrels of Venezuelan oil will be sold to benefit US — Trump",
    "description": "Donald Trump announces a Venezuelan oil sale of 30-50 million barrels to the US, causing crude prices to drop. Learn about the impact on global markets.\n\nRead More: https://punchng.com/30-50-million-barrels-of-venezuelan-oil-will-be-sold-to-benefit-us-trump/",
    "link": "https://punchng.com/30-50-million-barrels-of-venezuelan-oil-will-be-sold-to-benefit-us-trump/",
    "timestamp": "2026-01-07T07:51:05Z"
  },
  {
    "title": "Why is Donald Trump renewing calls for takeover of Greenland?",
    "description": "US refuses to rule out military force to take control - a move Denmark says would end the Nato alliance",
    "link": "https://www.irishtimes.com/world/europe/2026/01/07/why-is-donald-trump-renewing-calls-for-takeover-of-greenland/",
    "timestamp": "2026-01-07T07:49:48Z"
  },
  {
    "title": "Trump says US to get 30 to 50 million barrels of oil from Venezuela",
    "description": "Trump posted on Truth Social that the oil “will be taken by storage ships, and brought directly to unloading docks in the United States”.",
    "link": "https://www.thejournal.ie/trump-venezuela-oil-6919956-Jan2026/",
    "timestamp": "2026-01-07T07:39:57Z"
  },
  {
    "title": "Japan condemns China's dual-use export ban; rare earth risks loom",
    "description": "Japan said on Wednesday that China's ban on exports of dual-use items to the country was &quot;absolutely unacceptable and deeply regrettable&quot;, as a diplomatic dispute between Asia's top two economies intensified. Dual-use items are goods, software or te…",
    "link": "https://japantoday.com/category/politics/japan-says-china%27s-dual-use-export-ban-%27unacceptable%27-rare-earths-in-crosshairs",
    "timestamp": "2026-01-07T07:35:47Z"
  },
  {
    "title": "Why Trump wants Greenland — and what makes it so important for national security",
    "description": "U.S. President Donald Trump is fixated on taking control of Greenland, a vast, sparsely populated and mineral-rich island situated between the Arctic Ocean and the North Atlantic Ocean.\n\"It's so strategic,\" Trump told reporters on board Air Force One on Sunda…",
    "link": "https://biztoc.com/x/647d80f323ff1d8a",
    "timestamp": "2026-01-07T07:34:40Z"
  },
  {
    "title": "Trump Mobile's golden phone remains nowhere to be found",
    "description": "Trump Mobile's golden phone remains nowhere to be found\nA golden phone that President Donald Trump's family business promised to release last year remains mysteriously under wraps as the technology industry serves up a glut of new gadgets at CES in Las Vegas …",
    "link": "https://biztoc.com/x/88a6759174bed4a9",
    "timestamp": "2026-01-07T07:34:09Z"
  },
  {
    "title": "Yemen anti-Houthi council expels separatist leader and says he faces treason charges",
    "description": "A council fighting against Yemen’s Houthi rebels says it has expelled the leader of a separatist movement and charged him with treason after he reportedly declined to travel to Saudi Arabia for talks",
    "link": "https://abcnews.go.com/International/wireStory/yemen-anti-houthi-council-expels-separatist-leader-faces-128970987",
    "timestamp": "2026-01-07T07:31:32Z"
  },
  {
    "title": "CNBC Daily Open: Greenland could be next on Trump's list",
    "description": "If Trump gives in to his desire to acquire Greenland, markets could react badly to the symbolic — and possible concrete — fracturing of the NATO partnership.",
    "link": "https://www.cnbc.com/2026/01/07/cnbc-daily-open-greenland-could-be-next-on-trumps-list.html",
    "timestamp": "2026-01-07T07:30:01Z"
  },
  {
    "title": "Why Trump wants Greenland — and what makes it so important for national security",
    "description": "Greenland, a vast and sparsely populated self-governing Danish territory, has been thrust into the geopolitical spotlight once again.",
    "link": "https://www.cnbc.com/2026/01/07/why-trump-wants-greenland-and-what-makes-it-so-important-for-security.html",
    "timestamp": "2026-01-07T07:26:11Z"
  },
  {
    "title": "Trump Admits Melania Hates These 2 Things He Does",
    "description": "The first lady said the president's supporters \"don’t like it, they’re just being nice to you,\" he claimed.",
    "link": "https://www.huffpost.com/entry/melania-trump-hates-donald-trump-doing-this_n_695e01b3e4b05bed6f96fb4f",
    "timestamp": "2026-01-07T07:21:10Z"
  },
  {
    "title": "Trump Mobile's golden phone remains nowhere to be found",
    "description": "A golden phone that President Donald Trump's family business promised to release last year remains mysteriously under wraps as the technology industry serves up a glut of new gadgets at CES in Las Vegas this week.",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5668996/trump-mobile-golden-phone",
    "timestamp": "2026-01-07T07:20:02Z"
  },
  {
    "title": "Colbert Gives Trump A Scathing 'Kennedy Center Honors' Review",
    "description": "The \"Late Show\" host teased the president about the dismal TV ratings for his first time hosting the ceremony.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-kennedy-center-honors_n_695dca0de4b06463f5404faf",
    "timestamp": "2026-01-07T07:19:44Z"
  },
  {
    "title": "Security forces clash with protesters in Iran's main market as death toll rises",
    "description": "The protest at the Grand Bazaar represented the latest signal that the demonstrations are likely to continue. Violence surrounding the protests has killed at least 36 people, activists abroad say.",
    "link": "https://www.npr.org/2026/01/07/g-s1-104862/protesters-iran",
    "timestamp": "2026-01-07T07:18:08Z"
  },
  {
    "title": "Trump says US to get 30 million to 50 million barrels of oil from Venezuela at market price",
    "description": "Trump pledged to use proceeds from the sale of this oil \"to benefit the people\" of both countries.",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5668993/trump-us-30-million-barrels-oil-venezuela",
    "timestamp": "2026-01-07T07:07:45Z"
  },
  {
    "title": "US Capitol riot anniversary exposes a country still divided",
    "description": "WASHINGTON: Washington on Tuesday (Jan 6) marked five years since a mob overran the US Capitol, with rioters pardoned by Donald Trump retracing their steps even as Democrats revived hearings to hold the president accountable.The anniversary highlights a natio…",
    "link": "https://www.channelnewsasia.com/world/us-jan-6-capitol-riots-anniversary-donald-trump-republicans-democrats-5836096",
    "timestamp": "2026-01-07T07:07:20Z"
  },
  {
    "title": "US Capitol riot anniversary exposes a country still divided",
    "description": "WASHINGTON: Washington on Tuesday (Jan 6) marked five years since a mob overran the US Capitol, with rioters pardoned by Donald Trump retracing their steps even as Democrats revived hearings to hold the president accountable.The anniversary highlights a natio…",
    "link": "https://www.channelnewsasia.com/world/us-jan-6-capitol-riots-anniversary-donald-trump-republicans-democrats-5836096",
    "timestamp": "2026-01-07T07:07:20Z"
  },
  {
    "title": "Which kontri Trump dey eye afta Venezuela?",
    "description": "US President Donald Trump second term dey take shape well-well through im foreign policy plans. E don carry out im threat against Venezuela as US forces capture di president and im wife from dia strong security house for Caracas in one dramatic overnight oper…",
    "link": "https://freerepublic.com/focus/f-news/4360811/posts",
    "timestamp": "2026-01-07T07:06:49Z"
  },
  {
    "title": "Denmark attempts to navigate between rhetoric and real threats from the US",
    "description": "Trump administration sends mixed signals and creates doubt about the real intentions behind the desire to acquire Greenland. Denmark tries to navigate between rhetoric and real threats, writes US correspondent Jacob Fuglsang in this analysis",
    "link": "https://politiken.dk/edition/news/art10682225/Denmark-attempts-to-navigate-between-rhetoric-and-real-threats-from-the-US",
    "timestamp": "2026-01-07T07:05:12Z"
  },
  {
    "title": "Who is Alain Prost? How “The Professor” mastered Formula 1 with balanced speed and intelligence",
    "description": "Alain Prost, known as 'The Professor', achieved four world titles through smart driving. He prioritized precision over recklessness, a strategy that proved highly successful. His mechanical sympathy and careful race management set him apart. Prost's approach …",
    "link": "https://timesofindia.indiatimes.com/sports/formula-one/news/who-is-alain-prost-how-the-professor-mastered-formula-1-with-balanced-speed-and-intelligence/articleshow/126389088.cms",
    "timestamp": "2026-01-07T07:01:02Z"
  },
  {
    "title": "Morgan Stanley’s Latest Step Into Crypto: Files For Bitcoin And Solana ETFs",
    "description": "On Tuesday, Morgan Stanley, one of Wall Street’s premier banking institutions, announced that it has submitted preliminary filings for exchange-traded funds (ETFs) focused on Bitcoin (BTC) and Solana (SOL).  These filings are now awaiting approval from the US…",
    "link": "https://bitcoinist.com/morgan-stanley-files-for-bitcoin-and-solana-etfs/",
    "timestamp": "2026-01-07T07:00:54Z"
  },
  {
    "title": "Trump’s Tactics Could Unravel U.S. Strategy in Southeast Asia",
    "description": "The region is no stranger to dealmaking, but Washington’s selfish ends are self-damaging.",
    "link": "http://foreignpolicy.com/2026/01/07/trump-southeast-asia-asean-china-strategy-geopolitics/",
    "timestamp": "2026-01-07T07:00:39Z"
  },
  {
    "title": "CNBC's The China Connection newsletter: What's next after a 10-year 'experiment' with U.S.-China competition",
    "description": "For someone who's witnessed the ups and downs of U.S.-China tensions since the 1990s, AmCham China's new chair is strikingly optimistic about 2026.",
    "link": "https://www.cnbc.com/2026/01/07/cnbcs-the-china-connection-newsletter-turning-point-for-us-china-ties-in-2026.html",
    "timestamp": "2026-01-07T07:00:01Z"
  },
  {
    "title": "Net Zero: Fantasy, Red Herring, or Reality?",
    "description": "Ten years after the 2015 Paris Agreement provided a framework to keep average global temperatures from rising 1.5 °C (2.7 °F) above pre-industrial levels, the world continues to advance towards climate breakdown. Time is running out on a human-induced Anthrop…",
    "link": "https://www.counterpunch.org/2026/01/07/net-zero-fantasy-red-herring-or-reality/",
    "timestamp": "2026-01-07T06:58:07Z"
  },
  {
    "title": "Who is Nelson Piquet? Connection with Max Verstappen and three-time Formula 1 champion’s rise to legend",
    "description": "Formula 1 legend Nelson Piquet, a three-time world champion known for his instinctive driving and strategic brilliance, is now linked to current F1 star Max Verstappen through his daughter, Kelly. This familial connection highlights a legacy of racing prowess…",
    "link": "https://timesofindia.indiatimes.com/sports/formula-one/news/who-is-nelson-piquet-connection-with-max-verstappen-and-three-time-formula-1-champions-rise-to-legend/articleshow/126388915.cms",
    "timestamp": "2026-01-07T06:56:12Z"
  },
  {
    "title": "Homeland Security plans 2,000 immigration officers in Minnesota",
    "description": "Homeland Security said Tuesday that it launched what it described as the largest immigration enforcement operation ever carried out, tied to allegations of fraud involving Somali residents in Minnesota.",
    "link": "https://www.npr.org/2026/01/07/g-s1-104857/homeland-security-immigration-minnesota",
    "timestamp": "2026-01-07T06:55:35Z"
  },
  {
    "title": "GORDON CHANG: After Trump Hits Venezuela, Will China Invade Taiwan?",
    "description": "China has never been more trade-dependent in its history. Xi Jinping's only hope for an economy that is probably contracting is to increase exports.",
    "link": "https://dailycaller.com/2026/01/07/opinion-after-trump-hits-venezuela-will-china-invade-taiwan-gordon-chang/",
    "timestamp": "2026-01-07T06:54:56Z"
  },
  {
    "title": "Seven U.S. troops injured in Venezuela raid that captured Maduro, Pentagon says",
    "description": "Seven U.S. service members were injured during a U.S. military operation in Venezuela that captured President Nicolás Maduro and his wife, a Pentagon official said on Wednesday.",
    "link": "https://www.cnbc.com/2026/01/07/us-venezuela-military-operation-maduro-injuries-casualties.html",
    "timestamp": "2026-01-07T06:51:25Z"
  },
  {
    "title": "Is Starmer’s reluctance to criticise Trump smart tactics – or the sign of a man without a plan? | Rafael Behr",
    "description": "The PM won’t call out Trump over Venezuela, and won’t commit to Europe. His refusal to choose leaves vital choices for Britain to be made by others \n \nFor an inveterate liar, Donald Trump is remarkably honest. The best guide to what he thinks is what he says.…",
    "link": "https://biztoc.com/x/c79bec9ecee127ad",
    "timestamp": "2026-01-07T06:50:06Z"
  },
  {
    "title": "RI monitors Venezuela crisis, prioritizes citizens and energy security",
    "description": "Caracas erupted into chaos on January 3, when US Special Forces abducted Venezuelan President Nicolas Maduro and his wife, Cilia Flores, in a daring operation ...",
    "link": "https://en.antaranews.com/news/398815/ri-monitors-venezuela-crisis-prioritizes-citizens-and-energy-security",
    "timestamp": "2026-01-07T06:45:01Z"
  },
  {
    "title": "Venezuela ‘turning over’ $2bn in oil to US, Trump says, in move that could cut supply to China",
    "description": "Deal indicates Venezuelan government is responding to Trump’s demand that they open up to US oil companies or risk more military intervention\nDonald Trump has said Venezuela will be “turning over” $2bn worth of Venezuelan crude to the United States, a flagshi…",
    "link": "https://biztoc.com/x/24417f5eee4b70b1",
    "timestamp": "2026-01-07T06:39:13Z"
  },
  {
    "title": "Maduro capture shows arrogance of American imperialism: Kerala CM",
    "description": "Pinarayi Vijayan warned that the US targeting of countries not aligned with its interests could extend beyond Venezuela, citing remarks by President Donald Trump on Cuba and Greenland.",
    "link": "https://www.thehindubusinessline.com/news/national/maduro-capture-shows-arrogance-of-american-imperialism-kerala-cm/article70481086.ece",
    "timestamp": "2026-01-07T06:39:06Z"
  },
  {
    "title": "Trump weighs military option to take control of Greenland",
    "description": "The US president has argued that control of Greenland is a \"strategic\" necessity. The Danish government has warned a takeover of Greenland would mean the end of NATO.",
    "link": "https://www.dw.com/en/us-trump-weighs-military-option-to-take-control-of-greenland/a-75414829",
    "timestamp": "2026-01-07T06:38:00Z"
  },
  {
    "title": "Trump weighs military option to take control of Greenland",
    "description": "The US president has argued that control of Greenland is a \"strategic\" necessity. The Danish government has warned a takeover of Greenland would mean the end of NATO. US President Donald Trump is considering options that include military action to take contro…",
    "link": "https://www.dw.com/en/us-trump-weighs-military-option-to-take-control-of-greenland/a-75414829",
    "timestamp": "2026-01-07T06:38:00Z"
  },
  {
    "title": "Not 'realistic' for US to buy Greenland - Taoiseach",
    "description": "Taoiseach Micheál Martin has said that Greenland \"is part of Denmark and the EU is rock-solid behind Denmark\", responding to US President Donald Trump's comments regarding the Arctic territory.",
    "link": "https://www.rte.ie/news/world/2026/0107/1551828-us-greenland/",
    "timestamp": "2026-01-07T06:33:45Z"
  },
  {
    "title": "Not 'realistic' for US to buy Greenland - Taoiseach",
    "description": "Taoiseach Micheál Martin has said that Greenland \"is part of Denmark and the EU is rock-solid behind Denmark,\" responding to US President Donald Trump's earlier comments regarding the Danish territory in the Arctic.",
    "link": "https://www.rte.ie/news/ireland/2026/0107/1551828-us-greenland/",
    "timestamp": "2026-01-07T06:33:45Z"
  },
  {
    "title": "Trump says US to get millions of barrels of oil from Venezuela",
    "description": "Caracas says at least 24 Venezuelan security officers were killed in US military operation to capture Nicolas Maduro",
    "link": "https://www.irishtimes.com/world/us/2026/01/07/trump-says-us-to-get-millions-of-barrels-of-oil-from-venezuela/",
    "timestamp": "2026-01-07T06:30:07Z"
  },
  {
    "title": "CNBC's UK Exchange newsletter: Is Britain back? Five things to watch for the U.K. in 2026",
    "description": "From Chancellor challenges to jobless-rate jitters, here are the key things to watch for the U.K. economy as the new year gets underway.",
    "link": "https://www.cnbc.com/2026/01/07/cnbcs-uk-exchange-newsletter-is-britain-back-five-things-to-watch-for-the-uk-in-2026.html",
    "timestamp": "2026-01-07T06:30:01Z"
  },
  {
    "title": "Trump says he’ll be impeached if Republicans lose midterms",
    "description": "Donald Trump has told House Republicans that if they don’t win the midterm elections that he will “get impeached,” which could derail his agenda for the second half of his term.",
    "link": "https://cointelegraph.com/news/trump-impeached-republicans-lose-midterms",
    "timestamp": "2026-01-07T06:26:32Z"
  },
  {
    "title": "Stephen Colbert Turns Trump’s ‘No Talent, Low-Rated’ Dig Back at Him Over Kennedy Center Honors Ratings | Video",
    "description": "\"I gotta say, I see why he says that. That felt good,\" the late night host adds\nThe post Stephen Colbert Turns Trump’s ‘No Talent, Low-Rated’ Dig Back at Him Over Kennedy Center Honors Ratings | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/tv/stephen-colbert-reacts-trump-kennedy-center-honors-ratings/",
    "timestamp": "2026-01-07T06:26:30Z"
  },
  {
    "title": "Nearly 40 EU Lawmakers Urge Commission to Condemn US for Actions in Venezuela",
    "description": "Thirty-seven members of the European Parliament demanded that European Commission President Ursula von der Leyen and EU foreign policy chief Kaja Kallas condemn US President Donald Trump for his operation in Venezuela, a statement from Danilo Della Valle, a m…",
    "link": "https://sputnikglobe.com/20260107/nearly-40-eu-lawmakers-urge-commission-to-condemn-us-for-actions-in-venezuela-1123434709.html",
    "timestamp": "2026-01-07T06:23:37Z"
  },
  {
    "title": "Maduro's capture in Venezuela sends warning signal to Iran",
    "description": "The capture of Venezuelan leader Nicolas Maduro is being closely watched in Tehran. Iran fears US military action in the Middle East, as nationwide protests continue to pressure the regime. The unprecedented US military attack in Venezuela and the capture of …",
    "link": "https://www.dw.com/en/maduros-capture-in-venezuela-sends-warning-signal-to-iran/a-75406627",
    "timestamp": "2026-01-07T06:17:00Z"
  },
  {
    "title": "European markets head for mixed open as Greenland fears grow",
    "description": "European stocks are expected to open in mixed territory Wednesday as regional market jitters grow over U.S. President Donald Trump's threat to annex Greenland.",
    "link": "https://www.cnbc.com/2026/01/07/european-markets-stoxx-600-ftse-dax-cac-greenland-in-focus.html",
    "timestamp": "2026-01-07T06:13:52Z"
  },
  {
    "title": "Venezuela to transfer up to 30-50 mln barrels of oil to US: Trump",
    "description": "U.S. President Donald Trump said Tuesday that interim authorities in Venezuela had agreed to transfer between 30 and 50 million barrels of sanctioned oil to the U.S. to be sold at market price.",
    "link": "https://www.hurriyetdailynews.com/venezuela-to-transfer-up-to-30-50-mln-barrels-of-oil-to-us-trump-217571",
    "timestamp": "2026-01-07T06:12:30Z"
  },
  {
    "title": "Trump weighs military option to acquire Greenland",
    "description": "U.S. President Donald Trump is discussing options including military action to take control of Greenland, the White House said Tuesday, upping tensions that Denmark warns could destroy the NATO alliance.",
    "link": "https://www.hurriyetdailynews.com/trump-weighs-military-option-to-acquire-greenland-217570",
    "timestamp": "2026-01-07T06:07:07Z"
  },
  {
    "title": "Protest-hit Iran warily watches the US after its raid on Venezuela",
    "description": "As Iran is gripped by new protests, many people there are focused on the U.S. raid in Venezuela and wonder whether the same could occur in Tehran",
    "link": "https://abcnews.go.com/International/wireStory/protest-hit-iran-warily-watches-us-after-raid-128970865",
    "timestamp": "2026-01-07T06:05:30Z"
  },
  {
    "title": "Vincent Durac: Could the Iranian regime be on its last legs?",
    "description": "Protests are shaking the regime but might not directly topple it. But change could soon come regardless",
    "link": "https://www.irishtimes.com/opinion/2026/01/07/could-the-iranian-regime-be-on-its-last-legs/",
    "timestamp": "2026-01-07T06:05:00Z"
  },
  {
    "title": "Why Southeast Asia Spoke Out Against Maduro’s Capture",
    "description": "The region’s rhetorical commitment reflects a wariness of great-power interference.",
    "link": "http://foreignpolicy.com/2026/01/07/southeast-asia-maduro-capture-response/",
    "timestamp": "2026-01-07T06:00:15Z"
  },
  {
    "title": "It’s worth asking again why Sinn Féin sent a delegation to Maduro’s inauguration",
    "description": "Is the ugliness of the Trump regime in Washington mirrored in Sinn Féin’s ambitions for a hard-left Chavista socialist republic in Ireland?",
    "link": "https://www.irishtimes.com/opinion/2026/01/07/its-worth-asking-again-why-sinn-fein-sent-a-delegation-to-maduros-inauguration/",
    "timestamp": "2026-01-07T06:00:01Z"
  },
  {
    "title": "Kathy Sheridan: Same people who worry about an overheating planet brag about using cocaine",
    "description": "Cocaine is so readily available you can order a ‘bump’ from a handy menu over WhatsApp. But hypocrisy is as rampant as the drug",
    "link": "https://www.irishtimes.com/opinion/2026/01/07/same-people-who-worry-about-an-overheating-planet-brag-about-using-cocaine/",
    "timestamp": "2026-01-07T06:00:01Z"
  },
  {
    "title": "Walz rejects calls for his resignation amid Minnesota fraud scandal",
    "description": "Minnesota Gov. Tim Walz refuses to step down despite allegations of an $18 billion fraud scheme involving federal funds tied to Somali-led nonprofits. The scandal centers on Feeding Our Future, a nonprofit accused of embezzling hundreds of millions meant for …",
    "link": "https://www.naturalnews.com/2026-01-07-walz-rejects-resignation-calls-amid-fraud-scandal.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "A constitutional clash erupts over Venezuela; Senate vote to block further military action coming soon",
    "description": "The U.S. Senate is poised to vote on a bipartisan war powers resolution to block further military action against Venezuela. The vote follows the extraordinary U.S. military operation that abducted Venezuelan leader Nicolás Maduro. The resolution faces signifi…",
    "link": "https://www.naturalnews.com/2026-01-07-a-constitutional-clash-erupts-over-venezuela.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "U.S. auto sales face decline as high prices push middle-class buyers out of market",
    "description": "Vehicle costs are climbing, causing middle-class buyers to shy away from new cars and Cox Automotive forecasts U.S. sales could drop to 15.8 million in 2026, the first annual decline since 2022. Households earning $75,000 or less saw new-car purchases fall 30…",
    "link": "https://www.naturalnews.com/2026-01-07-auto-sales-decline-due-to-high-prices.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "Starmer rebukes Trump over Greenland annexation threat, backs Denmark",
    "description": "United Kingdom Prime Minister Keir Starmer rebuked United States President Donald Trump over his threats to annex Greenland, insisting that the island’s future belongs solely to Greenland and the Kingdom of Denmark. Trump argued in The Atlantic that the U.S. …",
    "link": "https://www.naturalnews.com/2026-01-07-starmer-backs-denmark-over-greenland-annexation-threat.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "Colombian President Petro vows to “take up arms” if the U.S. attacks his country",
    "description": "Colombian President Gustavo Petro, a former guerrilla fighter, vowed to take up arms against the U.S. if attacked, citing his wartime experience and loyalty to Colombia despite his 1989 peace pact. Trump accused Petro of enabling record cocaine production, th…",
    "link": "https://www.naturalnews.com/2026-01-07-petro-vows-take-arms-us-attacks-colombia.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "U.K. and France commit troops to Ukraine under post-ceasefire security plan, risking escalation with Russia",
    "description": "British PM Keir Starmer and French President Emmanuel Macron pledged to deploy troops to Ukraine after a potential ceasefire. The plan includes military hubs, airspace protection and rebuilding Ukraine’s armed forces, with U.S. strategic backing. Moscow sees …",
    "link": "https://www.naturalnews.com/2026-01-07-uk-france-commit-troops-to-ukraine-post-ceasefire.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "Israel pounds southern Lebanon, hitting sites in four villages after warning civilians to flee",
    "description": "Israeli strikes hit four Lebanese villages after explicit evacuation orders. The attacks breach the 2024 ceasefire and expand operations deeper into Lebanon. Israel claims it targeted Hamas and Hezbollah infrastructure north of the Litani River. The UN report…",
    "link": "https://www.naturalnews.com/2026-01-07-israel-pounds-southern-lebanon-hitting-villages-civilians.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "U.S. demands Venezuela SEVER ties with four nations in exchange for oil market access",
    "description": "The Trump administration demands Venezuela cut economic ties with Russia, China, Iran and Cuba – or face exclusion from global oil markets. Venezuela must partner exclusively with U.S. firms and prioritize American buyers. President Trump announced plans to t…",
    "link": "https://www.naturalnews.com/2026-01-07-us-demands-venezuela-sever-ties-four-countries.html",
    "timestamp": "2026-01-07T06:00:00Z"
  },
  {
    "title": "Lexi Thompson: The women's golf superstar's net worth, endorsement deals, records and more",
    "description": "Lexi Thompson, a prominent figure in women's golf, turned professional at 15 and has amassed an estimated $4 million net worth by 2025. Her career earnings stem from 11 LPGA Tour wins, significant endorsement deals with brands like Puma and Rolex, and her own…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/lexi-thompson-the-womens-golf-superstars-net-worth-endorsement-deals-records-and-more/articleshow/126387411.cms",
    "timestamp": "2026-01-07T05:58:09Z"
  },
  {
    "title": "Trump leaves Venezuela's opposition sidelined and Maduro's party in power",
    "description": "Opposition supporters have long hoped their leaders could replace Nicolás Maduro as Venezuela's president",
    "link": "https://abcnews.go.com/International/wireStory/trump-leaves-venezuelas-opposition-sidelined-maduros-party-power-128971171",
    "timestamp": "2026-01-07T05:58:04Z"
  },
  {
    "title": "Trump leaves Venezuela's opposition sidelined and Maduro's party in power",
    "description": "Opposition supporters have long hoped their leaders could replace Nicolás Maduro as Venezuela's president",
    "link": "https://abcnews.go.com/US/wireStory/trump-leaves-venezuelas-opposition-sidelined-maduros-party-power-128971170",
    "timestamp": "2026-01-07T05:58:03Z"
  },
  {
    "title": "Wall Street Journal: The Biggest Loser in Maduro's Capture May Be ...",
    "description": "Iran? Russia? China? Senate Dems? The Maduros themselves? (Naah. Too obvious.)Iran certainly qualifies for the medal round here. The loss of their footprint in Venezuela would disrupt one of the regime's last sources of hard currency via its proxy in Hezbolla…",
    "link": "https://freerepublic.com/focus/f-news/4360809/posts",
    "timestamp": "2026-01-07T05:57:35Z"
  },
  {
    "title": "New Venezuela leader says 'no foreign power' running country",
    "description": "Venezuela's interim leader Delcy Rodriguez insisted Tuesday no foreign power was governing her country, even as U.S. President Donald Trump announced Caracas will be swiftly turning over millions of barrels of oil to the United States.",
    "link": "https://www.hurriyetdailynews.com/new-venezuela-leader-says-no-foreign-power-running-country-217568",
    "timestamp": "2026-01-07T05:56:45Z"
  },
  {
    "title": "Inside Venezuela: Armed groups are active. People can’t celebrate the end of the dictatorship",
    "description": "The voices of citizens yearning for change are being muted despite the end of Maduro’s dictatorship",
    "link": "https://www.irishtimes.com/world/americas/2026/01/07/inside-venezuela-armed-groups-are-active-people-cant-celebrate-the-end-of-the-dictatorship/",
    "timestamp": "2026-01-07T05:55:00Z"
  },
  {
    "title": "Starmer and Macron in extraordinary face-off with Trump over Greenland",
    "description": "Europe's leaders boldly confronted Donald Trump on Tuesday night after his administration threatened to use the US military to seize Greenland. A joint statement from leaders including Sir Keir Starmer, French President Emmanuel Macron and Prime Minister Gior…",
    "link": "https://freerepublic.com/focus/f-backroom/4360806/posts",
    "timestamp": "2026-01-07T05:53:30Z"
  },
  {
    "title": "How to sort out your finances after shelling out for Christmas",
    "description": "Christmas and New Year’s Eve are out of the way – now it’s time to pay for it all",
    "link": "https://www.irishtimes.com/your-money/2026/01/07/how-to-sort-out-your-finances-after-shelling-out-for-christmas/",
    "timestamp": "2026-01-07T05:45:00Z"
  },
  {
    "title": "Bill to Eliminate H-1B Visa Program Introduced in Congress",
    "description": "The bill introduced by Marjorie Taylor Greene would amend the Immigration and Nationality Act to eliminate the H-1B visa program.",
    "link": "https://www.newsweek.com/eliminate-h1b-visa-program-congress-bill-marjorie-taylor-greene-11312655",
    "timestamp": "2026-01-07T05:44:54Z"
  },
  {
    "title": "Trump says Venezuela will send U.S. up to 50 million barrels of oil — and he’ll control the proceeds",
    "description": "President Donald Trump late Tuesday said Venezuela will send the U.S. 30 million to 50 million barrels of oil, which will then be sold by the U.S. and the proceeds controlled by him.",
    "link": "https://biztoc.com/x/c029887a32380ae1",
    "timestamp": "2026-01-07T05:43:31Z"
  },
  {
    "title": "Iran: An Uprising Besieged from Within and Without : Three Perspectives",
    "description": "Three perspectives on the uprising that began in Iran on December 29, 2025, and the forces that threaten it from within and without.",
    "link": "https://crimethinc.com/2026/01/07/iran-an-uprising-besieged-from-within-and-without-three-perspectives",
    "timestamp": "2026-01-07T05:33:59Z"
  },
  {
    "title": "US car market expected to moderate in 2026",
    "description": "Auto industry experts expect US car sales to moderate in 2026 after last year’s churn of trade announcements and environmental policy changes spurred increased sales. Analysts attribute some of 2025’s sales gains to President Donald Trump’s announcements earl…",
    "link": "https://www.digitaljournal.com/world/us-car-market-expected-to-moderate-in-2026/article",
    "timestamp": "2026-01-07T05:32:32Z"
  },
  {
    "title": "French and UK ‘military hubs’ on Ukrainian soil are central plank to proposed Paris peace plan",
    "description": "US president Donald Trump’s administration will agree to support Ukraine in the event of a future Russian attack, according to a draft statement being negotiated by Kyiv’s top allies.",
    "link": "https://www.independent.ie/world-news/europe/french-and-uk-military-hubs-on-ukrainian-soil-are-central-plank-to-proposed-paris-peace-plan/a976792078.html",
    "timestamp": "2026-01-07T05:30:00Z"
  },
  {
    "title": "More than two million files related to Jeffrey Epstein have yet to be released",
    "description": "More than two million documents regarding convicted sex offender ­Jeffrey Epstein remain to be released, US Justice Department officials told a federal judge offering the most precise estimate so far of the size of the file still under review.",
    "link": "https://www.independent.ie/world-news/north-america/more-than-two-million-files-related-to-jeffrey-epstein-have-yet-to-be-released/a1601978429.html",
    "timestamp": "2026-01-07T05:30:00Z"
  }
]