[
  {
    "title": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY [Facepalm]",
    "description": "Dear Diary: Today I was let out of prison after three years and charges of seditious conspiracy acts. Now I'm thinking about entering politics. P.S. Donald Trump is so DREAMY",
    "link": "https://www.fark.com/comments/13555650/Dear-Diary-Today-I-was-let-out-of-prison-after-three-years-charges-of-seditious-conspiracy-acts-Now-Im-thinking-about-entering-politics-PS-Donald-Trump-is-so-DREAMY",
    "timestamp": "2025-02-09T12:20:43Z"
  },
  {
    "title": "As the Trump upheaval continues, are there restraints that could slow him down? (Dan Balz/Washington Post)",
    "description": "Dan Balz / Washington Post:\nAs the Trump upheaval continues, are there restraints that could slow him down?  —  Questions remain on what constitutional or other checks can be put on the president and his wide-ranging actions.  —  Rare is the president who doe…",
    "link": "https://www.memeorandum.com/250209/p4",
    "timestamp": "2025-02-09T12:20:00Z"
  },
  {
    "title": "Some US health clinics grapple with federal funding squeeze",
    "description": "President Donald Trump's executive orders have begun to disrupt patient care in the United States, as some providers cannot access essential federal funding, according to interviews with a dozen healthcare providers and policy advocates. Facilities in Virgini…",
    "link": "https://www.channelnewsasia.com/world/us-health-clinics-federal-funding-trump-4926896",
    "timestamp": "2025-02-09T12:19:18Z"
  },
  {
    "title": "Lutnick Says EU ESG Regulations Will Harm U.S. Energy Producers",
    "description": "Commerce Secretary Howard Lutnick promises to use all the tools at his disposal to address concerns about new ESG regulations imposed by the EU on U.S. businesses.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/02/09/lutnick-says-eu-esg-regulations-will-harm-us-energy-producers/",
    "timestamp": "2025-02-09T12:19:06Z"
  },
  {
    "title": "Trump vows to tap America’s ‘liquid gold’ oil reserves and ‘drill baby, drill’—the only problem is, it’s not up to him",
    "description": "Trump vows to tap America’s ‘liquid gold’ oil reserves and ‘drill baby, drill’—the only problem is, it’s not up to him\nDonald Trump wanted to tap America's oil reserves to power the economy in his administration—but it's not his call to make\nBonnie Cash/UPI/B…",
    "link": "https://biztoc.com/x/2d0f61ba2c76e616",
    "timestamp": "2025-02-09T12:15:42Z"
  },
  {
    "title": "How to watch US coverage of Super Bowl in the UK so you can see iconic adverts and film trailers",
    "description": "Here is everything you need to know about watching US coverage of Super Bowl in the UK as the Kansas City Chiefs take on the Philadelphia Eagles.",
    "link": "https://www.ladbible.com/news/sport/super-bowl-2025-how-to-watch-uk-017967-20250209",
    "timestamp": "2025-02-09T12:10:25Z"
  },
  {
    "title": "Trans Lawmaker Sarah McBride Drops Brutal Trump Assessment After GOP Rep's Misgendering",
    "description": "McBride called out the president's administration for its \"cycle of chaos, corruption and cynicism\" as she declined to respond to her Republican colleague.",
    "link": "https://www.huffpost.com/entry/trans-lawmaker-sarah-mcbride-mary-miller-misgendering_n_67a84515e4b03ba5c011cd3f",
    "timestamp": "2025-02-09T12:08:56Z"
  },
  {
    "title": "Democrats Plot Strategy in Shutdown Fight",
    "description": "“Democrats have been powerless as they’ve watched President Donald Trump systematically move to dismantle federal agencies and push the bounds of his office with little concern about the fallout,” CNN reports. “But they do have",
    "link": "https://politicalwire.com/2025/02/09/democrats-plot-strategy-in-shutdown-fight/",
    "timestamp": "2025-02-09T12:08:48Z"
  },
  {
    "title": "Elon Musk outlines 'super obvious' changes DOGE and Treasury have agreed to make",
    "description": "Billionaire Elon Musk says the Treasury Department has agreed to a list of \"super obvious\" changes to allow more audits of government payments.",
    "link": "https://www.foxnews.com/politics/elon-musk-outlines-super-obvious-changes-doge-treasury-have-agreed-make",
    "timestamp": "2025-02-09T12:05:55Z"
  },
  {
    "title": "As Trump steamrolls Washington, courts flex their power to slow him down",
    "description": "President Donald Trump’s “shock and awe” assertion of executive power has hit a wall in the courtroom — at least for now. \nAt least nine federal judges — from Washington, D.C., to Washington state — have halted aspects of Trump’s early-term blitz, from his ef…",
    "link": "https://biztoc.com/x/395dc577e3eb8308",
    "timestamp": "2025-02-09T12:04:58Z"
  },
  {
    "title": "Dalal Street Week Ahead: India & US inflation, Q3 earnings, Powell testimony among 10 key factors to watch",
    "description": "Dalal Street Week Ahead: India & US inflation, Q3 earnings, Powell testimony among 10 key factors to watchmoneycontrol.com",
    "link": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-india-us-inflation-q3-earnings-powell-testimony-among-10-key-factors-to-watch-12934850.html",
    "timestamp": "2025-02-09T12:04:15Z"
  },
  {
    "title": "Russia Claims Another Village in Eastern Ukraine",
    "description": "Moscow said on Friday that its forces had seized a handful of settlements in Donetsk since the start of the month.",
    "link": "https://www.newsweek.com/russia-donetsk-ukraine-chasiv-yar-toretsk-2028402",
    "timestamp": "2025-02-09T12:01:46Z"
  },
  {
    "title": "Trump is making himself inescapable | CNN Business",
    "description": "White House aides have indicated the president’s ubiquity is partly a strategy to impress Republican voters and disorient Democratic opponents.",
    "link": "https://www.cnn.com/2025/02/09/business/trump-super-bowl-media/index.html",
    "timestamp": "2025-02-09T12:00:10Z"
  },
  {
    "title": "Trump Orders NASA to Purge All Mentions of Women in Leadership On Its Websites",
    "description": "[Redacted] As President Donald Trump's anti-DEI agenda comes to bear on NASA, we're getting a revealing look at what his administration apparently considers to be too woke: women. In a directive sent out just days after Trump's inauguration, NASA personnel we…",
    "link": "https://futurism.com/the-byte/trump-nasa-purge-mentions-women",
    "timestamp": "2025-02-09T12:00:08Z"
  },
  {
    "title": "Bitcoin May Reach $200K Despite Trade War Fears. Can the Biggest Presale $WEPE 100x?",
    "description": "Fred Thiel, the CEO of Marathon Digital, a Bitcoin mining giant, is extremely bullish on Bitcoin and predicts it can reach $200K in 2025. BTC is currently trading around the $97,000 mark, which means it can double from current prices as per Fred. The CEO cred…",
    "link": "http://www.newsbtc.com/news/bitcoin-may-reach-200k-despite-trade-war-fears-can-the-biggest-presale-wepe-100x/",
    "timestamp": "2025-02-09T12:00:03Z"
  },
  {
    "title": "Taylor Swift at the Super Bowl 2025: Everything We Know",
    "description": "The pop star is set to make an appearance at Super Bowl LIX in New Orleans. Here's everything we know about her plans.",
    "link": "https://www.newsweek.com/taylor-swift-super-bowl-lix-2025-details-travis-kelce-2027796",
    "timestamp": "2025-02-09T12:00:02Z"
  },
  {
    "title": "A potential U.S. trade war has breathed some life into the fraught idea of shipping oil through Hudson Bay",
    "description": "Canada is suddenly considering its short- and long-term export and transport options for the oil industry, which includes breathing some life into the idea of transporting oil across northern Manitoba and filling tankers at a Hudson Bay port.",
    "link": "https://www.cbc.ca/news/canada/manitoba/port-nelson-hudson-bay-1.7454115",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "Super Bowl LIX, The Floor Premiere, Puppy Bowl and More",
    "description": "To help you anticipate and navigate all that television has to offer across broadcast, cable and streaming, TVLine offers daily, weekly and monthly What to Watch digests, as well as an overview of every new TV show premiering in 2025. On TV this Sunday: The C…",
    "link": "https://tvline.com/what-to-watch/super-bowl-2025-chiefs-eagles-fox/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "Secrets of Donald Trump's 'Plot' to Boot Prince Harry out of U.S. — As Royal Exile's Visa Drugs Scandal Deepens",
    "description": "Donald Trump is hatching an alleged plot to oust Prince Harry as the royal's U.S. visa drugs scandal deepens.",
    "link": "https://radaronline.com/p/trump-plot-oust-prince-from-us-harry-visa-drugs-scandal-grows/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "President Clinton’s Better Vision for Gaza’s Future",
    "description": "\"If history has taught us anything, it is that lasting peace requires engagement, not exclusion.\"",
    "link": "https://time.com/7214120/gaza-future-bill-clinton/",
    "timestamp": "2025-02-09T12:00:00Z"
  },
  {
    "title": "Links 2/9/2025",
    "description": "Our lazy daily links",
    "link": "https://www.nakedcapitalism.com/2025/02/links-2-9-2025.html",
    "timestamp": "2025-02-09T11:58:06Z"
  },
  {
    "title": "The EEOC exists to fight discrimination. Fired official fears a hobbling under Trump - NPR",
    "description": "The EEOC exists to fight discrimination. Fired official fears a hobbling under TrumpNPR US equality chief fired by Trump condemns ‘demonization of the term DEI’The Guardian US Trump fires EEOC commissioners in late-night purgeMSNBC Evidence That the Right's A…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176163461",
    "timestamp": "2025-02-09T11:52:37Z"
  },
  {
    "title": "FO° Talks: US Immigration Policy Under Donald Trump 2.0",
    "description": "Founder, CEO and Editor-in-Chief Atul Singh speaks with Douglas Hauer-Gilad about US immigration policy under a second term for US President Donald Trump. The discussion focuses on Trump’s policy objectives, the feasibility of them and their impact on immigra…",
    "link": "https://www.fairobserver.com/politics/fo-talks-us-immigration-policy-under-donald-trump-2-0/",
    "timestamp": "2025-02-09T11:52:07Z"
  },
  {
    "title": "Consumer Financial Protection Bureau is ordered by Russell Vought to stop fighting financial abuse",
    "description": "Russell Vought, the newly installed acting director of the Consumer Financial Protection Bureau, sent an email Saturday night ordering all employees at the consumer watchdog to stop virtually all work – including fighting financial abuse.",
    "link": "https://www.cnn.com/2025/02/09/business/cfpb-vought-stop-activity/index.html",
    "timestamp": "2025-02-09T11:50:02Z"
  },
  {
    "title": "Secret Service airing Michael Bay recruitment ad...",
    "description": "Secret Service airing Michael Bay recruitment ad...\r\n\n \n \n \n (First column, 14th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Super Fog Could Steal Spotlight in New Orleans...\r\nTONIGHT: CHIEFS CHASE HISTORIC THREE-PEAT...\r\nSuper Bowl simulated -- EAGLES win!\r\nES…",
    "link": "https://www.cnn.com/2025/02/08/politics/secret-service-super-bowl-ad/index.html",
    "timestamp": "2025-02-09T11:46:39Z"
  },
  {
    "title": "Hamas says Israel withdraws from key Gaza road",
    "description": "<p>GAZA CITY (PALESTINIAN TERRITORIES) - A Hamas official said Israeli troops on Sunday completed their withdrawal from a strategic road bisecting the Gaza Strip, part of a fragile truce deal that Israel said it was implementing.</p>",
    "link": "https://www.bangkokpost.com/world/2957430/hamas-says-israel-withdraws-from-key-gaza-road",
    "timestamp": "2025-02-09T11:45:00Z"
  },
  {
    "title": "Trump is making himself inescapable",
    "description": "Last year, President Joe Biden passed up a chance to be interviewed on the highly rated Super Bowl pregame show. This year, not only is President Donald Trump being interviewed, he is coming here for the big game in person.\nBy becoming the first sitting presi…",
    "link": "https://biztoc.com/x/ef63e0c900a8df03",
    "timestamp": "2025-02-09T11:42:53Z"
  },
  {
    "title": "Donald Trump Is Back. The World Is Worried.",
    "description": "President Donald Trump’s return to power has alarmed many countries around the world. It is important to remember that Trump the individual represents two deep and persistent trends in American politics: isolationism and nativism. Remember that after World Wa…",
    "link": "https://www.fairobserver.com/world-news/us-news/donald-trump-is-back-the-world-is-worried/",
    "timestamp": "2025-02-09T11:42:38Z"
  },
  {
    "title": "Israeli soldiers risk possible prosecution abroad from Gaza war",
    "description": "<p>It&rsquo;s a hallowed Israeli tradition: after completing military service, backpack through South America or hitchhike across Asia. But global outrage at the Gaza war, threats of arrest and the ubiquity of social media are causing some soldiers and reserv…",
    "link": "https://www.bangkokpost.com/world/2957421/israeli-soldiers-risk-possible-prosecution-abroad-from-gaza-war",
    "timestamp": "2025-02-09T11:41:00Z"
  },
  {
    "title": "Super Bowl LIX Game Day Picks, Props And Eagles-Chiefs Betting Data",
    "description": "It’s game day for Super Bowl LIX, and nearing the coin toss and kickoff for the Super Bowl rematch between the Philadelphia Eagles and Kansas City Chiefs. Additional betting picks, props, insight and betting data from top online sportsbooks with information y…",
    "link": "https://www.forbes.com/sites/jayginsbach/2025/02/09/super-bowl-lix-game-day-picks-props-and-eagles-chiefs-betting-data/",
    "timestamp": "2025-02-09T11:40:14Z"
  },
  {
    "title": "Japan’s Ishiba Shows How to Work With Trump in First Summit",
    "description": "Japanese Prime Minister Shigeru Ishiba went into his first summit meeting with US President Donald Trump amid concerns in Tokyo that Japan could be next in the firing line of US allies after Canada and others.",
    "link": "https://financialpost.com/pmn/business-pmn/japans-ishiba-shows-how-to-work-with-trump-in-first-summit",
    "timestamp": "2025-02-09T11:31:15Z"
  },
  {
    "title": "10 Sunday Reads",
    "description": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures: • That Giant Sucking Sound? It’s Climate Change Devouring Your Home’s Value. As the compounding impacts of climate-driven disasters take effect, we are seeing home insura…",
    "link": "https://ritholtz.com/2025/02/sunday-reads-405/",
    "timestamp": "2025-02-09T11:30:41Z"
  },
  {
    "title": "Herzog slams BBC for 'false equivalence' of Israeli hostages, Palestinian prisoners",
    "description": "Herzog called for an end to what he described as a “preposterous” narrative that equates Israel’s legal system with Hamas’s brutality.",
    "link": "https://www.jpost.com/israel-news/article-841308",
    "timestamp": "2025-02-09T11:30:23Z"
  },
  {
    "title": "All the presidents ate",
    "description": "The inauguration of Donald Trump as the 47th president of the U.S. has been in the news in many ways. Especially the luncheon he hosted afterward was closely watched over by the press. Who was invited was one of the most talked about aspects, the photo of tec…",
    "link": "https://www.hurriyetdailynews.com/opinion/aylin-oney-tan/an-inauguration-feast-205618",
    "timestamp": "2025-02-09T11:26:35Z"
  },
  {
    "title": "Richard Gere Scolds Trump as a 'Bully' and 'Thug' with America 'In a Very Dark Place'",
    "description": "Actor Richard Gere called President Donald Trump a \"bully\" and a \"thug\" on Saturday, choosing an awards ceremony in Spain to deliver his insults before lamenting the U.S. is now in a \"very dark place.\"\nThe post Richard Gere Scolds Trump as a ‘Bully’ and ‘Thug…",
    "link": "https://www.breitbart.com/entertainment/2025/02/09/richard-gere-scolds-trump-as-a-bully-and-thug-with-america-in-a-very-dark-place/",
    "timestamp": "2025-02-09T11:24:31Z"
  },
  {
    "title": "Top 6 Meme Coins to Buy as SEC Acknowledges First-Ever Solana ETF Application",
    "description": "The US Securities and Exchange Commission (SEC) has finally acknowledged a bid to create an exchange-traded fund (ETF) for Solana. The bid was filed by Grayscale, a crypto asset management firm. This is particularly noteworthy because it reflects a change of …",
    "link": "http://www.newsbtc.com/news/top-6-meme-coins-to-buy-as-sec-acknowledges-first-ever-solana-etf-application/",
    "timestamp": "2025-02-09T11:23:40Z"
  },
  {
    "title": "How Silk Road drug kingpin Ross Ulbricht could reclaim $6.5B worth of Bitcoin after being pardoned by Trump",
    "description": "The founder of online drug marketplace Silk Road could claw back the $6.5billion worth of Bitcoin seized from the platform after being pardoned by Donald Trump and freed from a life sentence behind bars. Ross Ulbricht, who was sentenced in 2015, could mount a…",
    "link": "https://freerepublic.com/focus/f-chat/4296178/posts",
    "timestamp": "2025-02-09T11:17:59Z"
  },
  {
    "title": "Trump’s executive order on trans youth health care fudges facts",
    "description": "How accurate are claims from President Donald Trump's executive order about gender-affirming care? PolitiFact has answers.",
    "link": "https://www.statesman.com/story/news/politics/politifact/2025/02/09/trumps-executive-order-on-trans-youth-health-care-fudges-facts/78331559007/",
    "timestamp": "2025-02-09T11:11:10Z"
  },
  {
    "title": "Trump is making himself inescapable",
    "description": "Last year, President Joe Biden passed up a chance to be interviewed on the highly rated Super Bowl pregame show. This year, not only is President Donald Trump being interviewed, he is coming here for the big game in person.\nBy becoming the first sitting presi…",
    "link": "https://biztoc.com/x/a1408db28126144a",
    "timestamp": "2025-02-09T11:08:56Z"
  },
  {
    "title": "Inside the 'lawfare' plot to sabotage DOGE",
    "description": "Donald Trump's ambitious plan to overhaul the wasteful federal government is rapidly becoming mired in the 'lawfare' that plagued his first administration. Elon Musk's Department of Government Efficiency (DOGE) has been tearing through Washington at warp spee…",
    "link": "https://freerepublic.com/focus/f-news/4296177/posts",
    "timestamp": "2025-02-09T11:08:39Z"
  },
  {
    "title": "From bagels to ‘Canadianos,’ Trump tariff threat inspires symbolic acts of patriotism",
    "description": "U.S. President Donald Trump’s threats to impose across-the-board tariffs on Canada — not to mention his musings about making the country the 51st American state — have unleashed an uncharacteristic wave of patriotism across the country, marked by acts big and…",
    "link": "https://financialpost.com/pmn/from-bagels-to-canadianos-trump-tariff-threat-inspires-symbolic-acts-of-patriotism",
    "timestamp": "2025-02-09T11:02:18Z"
  },
  {
    "title": "What you need to know about the Patriots for Europe summit",
    "description": "Sovereignty is firmly back on the table as Patriots say an 'era' has come to a close.",
    "link": "https://www.euractiv.com/section/politics/news/what-you-need-to-know-about-the-patriots-for-europe-summit/",
    "timestamp": "2025-02-09T11:01:51Z"
  },
  {
    "title": "Trump’s desire for Greenland sets feelings on fire in the Arctic | CNN",
    "description": "CNN’s Donie O’Sullivan went to Nuuk to hear what people were saying about President Trump’s desire for control over Greenland.",
    "link": "https://www.cnn.com/2025/02/09/americas/greenland-views-on-trump/index.html",
    "timestamp": "2025-02-09T11:00:48Z"
  },
  {
    "title": "The Lessons From 2024 Democrats Really Need Right Now",
    "description": "While post-election recriminations won’t do Democrats much good, some lessons from 2024 on issues like inflation, immigration, threats to democracy, and the deep-seated desire for change, can help them deal with Trump in 2025.",
    "link": "http://nymag.com/intelligencer/article/the-lessons-from-2024-that-democrats-need-now-against-trump.html",
    "timestamp": "2025-02-09T11:00:48Z"
  },
  {
    "title": "Days before Trump halted funding, an ex-Israeli hostage was held at UNRWA school in Gaza, she reveals",
    "description": "Former Israeli hostage Emily Damari said she was held in an UNRWA center in Gaza. Damari was recently released as part of the hostages for ceasefire deal between Israel and Hamas.",
    "link": "https://www.foxnews.com/world/days-before-trump-halted-funding-ex-israeli-hostage-reveals-she-held-unrwa-school-gaza",
    "timestamp": "2025-02-09T11:00:29Z"
  },
  {
    "title": "How the Kansas City Chiefs became this Super Bowl’s villains",
    "description": "A recent poll shows that more Americans are rooting against Kansas City, who are playing the Philadelphia Eagles, than for them.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/super-bowl-kansas-city-chiefs-villains-eagles-rcna191262",
    "timestamp": "2025-02-09T11:00:00Z"
  },
  {
    "title": "Nine Guiding Principles For A U.S. Sovereign Wealth Fund",
    "description": "The Treasury and Commerce Departments are drafting a plan detailing how a federal sovereign wealth fund might be structured, funded, and managed.",
    "link": "https://www.forbes.com/sites/jamesbroughel/2025/02/09/nine-guiding-principles-for-a-us-sovereign-wealth-fund/",
    "timestamp": "2025-02-09T11:00:00Z"
  },
  {
    "title": "Trump is bringing back the least useful Obama-era ritual",
    "description": "President Donald Trump’s chat with Fox News’ Bret Baier, airing before the Super Bowl kickoff time will give us little valuable information.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trumps-super-bowl-interview-fox-news-rcna191339",
    "timestamp": "2025-02-09T11:00:00Z"
  },
  {
    "title": "The End of “END RACISM” in the End Zone",
    "description": "In the same week it was revealed that the slogan would be missing from the field at the Super Bowl, the N.F.L. commissioner defended the league’s diversity efforts.",
    "link": "https://www.newyorker.com/sports/sporting-scene/the-end-of-end-racism-in-the-end-zone",
    "timestamp": "2025-02-09T11:00:00Z"
  },
  {
    "title": "How Greenland got caught in a clash of superpowers",
    "description": "Donald Trump wants control of the island to boost US security in the Arctic",
    "link": "https://www.irishtimes.com/world/europe/2025/02/09/how-greenland-got-caught-in-a-clash-of-superpowers/",
    "timestamp": "2025-02-09T11:00:00Z"
  },
  {
    "title": "Will President Trump Confront Social Security's Most Glaring Issue?",
    "description": "President Donald Trump kicked off his second term with a flurry of executive orders aimed at getting his ambitious political agenda off to a fast start. At the top of Trump's list appears to be issues related to immigration, tariffs, taxes, and much more.\nSoc…",
    "link": "https://biztoc.com/x/0f7cf57cc0ecab36",
    "timestamp": "2025-02-09T10:58:20Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide D-Street market action on Monday",
    "description": "The Nifty remained volatile as the RBI Governor announced the monetary policy, said Rupak De, Senior Technical Analyst at LKP Securities. He added that the volatility did not push the index below the 21 EMA on the daily timeframe, signifying a positive short-…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-market-action-on-monday/articleshow/118088828.cms",
    "timestamp": "2025-02-09T10:57:29Z"
  },
  {
    "title": "Hamas Says Israel Withdraws From Key Gaza Road",
    "description": "A Hamas official said Israeli troops on Sunday completed their withdrawal from a strategic road bisecting the Gaza Strip, part of a fragile truce deal that Israel said it was implementing.",
    "link": "https://www.ibtimes.com.au/hamas-says-israel-withdraws-key-gaza-road-1856020",
    "timestamp": "2025-02-09T10:57:28Z"
  },
  {
    "title": "Hamas says Israel withdraws from key Gaza road",
    "description": "A Hamas official said Israeli troops on Sunday completed their withdrawal from a strategic road bisecting the Gaza Strip, part of a fragile truce deal that Israel said it was implementing. “Israeli forces have dismantled their positions and military posts and…",
    "link": "https://www.digitaljournal.com/world/hamas-says-israel-withdraws-from-key-gaza-road/article",
    "timestamp": "2025-02-09T10:57:20Z"
  },
  {
    "title": "Hamas Says Israel Withdraws From Key Gaza Road",
    "description": "A Hamas official said Israeli troops on Sunday completed their withdrawal from a strategic road bisecting the Gaza Strip, part of a fragile truce deal that Israel said it was implementing.",
    "link": "https://www.ibtimes.com/hamas-says-israel-withdraws-key-gaza-road-3763027",
    "timestamp": "2025-02-09T10:57:08Z"
  },
  {
    "title": "US military troops come in active-duty, Guard, and reserve forces. Here's what each one does.",
    "description": "US military forces do a lot at home and abroad, but the different types of troops and the rules for each can be confusing.",
    "link": "https://www.businessinsider.com/difference-between-guard-reserve-and-active-duty-forces-2025-2",
    "timestamp": "2025-02-09T10:50:02Z"
  },
  {
    "title": "'We are the future': European far right makes show of force",
    "description": "Hungarian Prime Minister Viktor Orban and France's Marine Le Pen headlined a rally in Madrid on Feb. 8 by Europe's biggest far-right bloc, buoyed by Donald Trump's return to power and calling for \"a 180-degree pivot.\"",
    "link": "https://www.hurriyetdailynews.com/we-are-the-future-european-far-right-makes-show-of-force-205613",
    "timestamp": "2025-02-09T10:44:14Z"
  },
  {
    "title": "Sen. Schiff urges Trump admin to exclude firefighters from federal hiring freeze",
    "description": "Sen. Adam Schiff, D-Calif., asked that federal seasonal firefighters be exempt from President Donald Trump's executive order implementing a federal hiring freeze.",
    "link": "https://www.foxnews.com/politics/sen-schiff-urges-trump-admin-exclude-firefighters-from-federal-hiring-freeze",
    "timestamp": "2025-02-09T10:44:06Z"
  },
  {
    "title": "Israeli forces begin to withdraw from a key Gaza corridor, part of the ceasefire deal with Hamas",
    "description": "MUGHRAQA, Gaza strip — Israeli forces began withdrawing from a key Gaza corridor on Sunday, Israeli officials said, part of Israel’s commitments under a tenuous ceasefire deal with Hamas that is moving ahead but faces a major test over whether the sides can n…",
    "link": "https://www.nbcnews.com/news/world/israeli-forces-begin-withdraw-key-gaza-corridor-part-ceasefire-deal-ha-rcna191365",
    "timestamp": "2025-02-09T10:42:23Z"
  },
  {
    "title": "Former Tory MP speaks from Ukraine after joining military following end of political career",
    "description": "\"If Ukraine falls… we know what happens next\", former Tory MP Jack Lopresti tells Trevor Phillips from Kyiv.",
    "link": "https://news.sky.com/story/former-tory-mp-speaks-from-ukraine-after-joining-military-following-end-of-political-career-13305958",
    "timestamp": "2025-02-09T10:39:00Z"
  },
  {
    "title": "Gazans’ Relocation: Egypt’s foreign minister heads to US for talks",
    "description": "Egyptian Foreign Minister Badr Abdelatty left for Washington on Sunday to meet top US officials and members of Congress after former President Donald Trump floated a plan to relocate Gazans to Egypt and Jordan. His departure came as Cairo announced it would h…",
    "link": "https://punchng.com/gazans-relocation-egypts-foreign-minister-heads-to-us-for-talks/",
    "timestamp": "2025-02-09T10:38:40Z"
  },
  {
    "title": "The EU’s worst enemies are its own Russophobic leaders",
    "description": "The bloc’s top diplomat Kaja Kallas cheers on the Baltic states’ newfound dependence on the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612404-eu-energy-kallas-russia/",
    "timestamp": "2025-02-09T10:38:35Z"
  },
  {
    "title": "'We've become the joke of the Middle East,' Ben-Gvir says on Gaza policies",
    "description": "“It’s not easy to stand up to the US president, but I would expect the prime minister to stand by our truth,\" he noted.",
    "link": "https://www.jpost.com/israel-news/article-841302",
    "timestamp": "2025-02-09T10:38:07Z"
  },
  {
    "title": "(Vanity) Pardon DOGE, Musk and Treasury Secretary Bessent",
    "description": "SDNY District Judge Paul Engelmayer, on February 8, ruled (outrageously) that the entire DOGE team, Musk, and EVEN TREASURY SECRETARY BESSENT cannot access any Treasury Department records, and must destroy the ones they possess.This ABSOLUTELY INSANE ruling m…",
    "link": "https://freerepublic.com/focus/f-chat/4296176/posts",
    "timestamp": "2025-02-09T10:37:41Z"
  },
  {
    "title": "Israel PM says 'we'll do the job' of executing Trump Gaza plan",
    "description": "WASHINGTON: Israeli Prime Minister Benjamin Netanyahu has hailed United States President Donald Trump's widely criticised plan to move Palestinians out of the war-battered Gaza Strip, saying Israel i",
    "link": "https://www.channelnewsasia.com/world/israel-gaza-trump-move-palestinians-plan-netanyahu-supportive-middle-east-criticism-4926856",
    "timestamp": "2025-02-09T10:36:39Z"
  },
  {
    "title": "Donald Trump Shares Update on Putin Phone Conversation",
    "description": "President Donald Trump has spoken on the phone with Russian counterpart Vladimir Putin to try to find an end to the now nearly three-years long war in Ukraine, he told the New York Post in an interview on Friday.\n\"He wants to see people stop dying,\" Trump sai…",
    "link": "https://biztoc.com/x/8a35135578cd8c81",
    "timestamp": "2025-02-09T10:35:41Z"
  },
  {
    "title": "Judge Blocks Elon Musk, DOGE, Access to Treasury Department Data",
    "description": "A federal judge issued a ruling on Saturday, blocking Elon Musk and the Department of Government Efficiency (DOGE) from having access to Treasury Department data and records.\nThe post Judge Blocks Elon Musk, DOGE, Access to Treasury Department Data appeared f…",
    "link": "https://www.breitbart.com/politics/2025/02/09/judge-blocks-elon-musk-doge-access-to-treasury-department-data/",
    "timestamp": "2025-02-09T10:34:04Z"
  },
  {
    "title": "Donald Trump Shares Update on Putin Phone Conversation",
    "description": "The president told the New York Post that he had talked with Putin, who said he \"does care\" about high casualties in Ukraine.",
    "link": "https://www.newsweek.com/donald-trump-shares-update-putin-phone-conversation-2028384",
    "timestamp": "2025-02-09T10:33:01Z"
  },
  {
    "title": "Trump aware and supportive of AUKUS pact, U.S. defense secretary says",
    "description": "The remarks by U.S. defense chief Pete Hegseth came as he hosted his first foreign counterpart since his confirmation, Australia's Richard Marles.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/asia-pacific/politics/trump-us-uk-australia-aukus/",
    "timestamp": "2025-02-09T10:31:00Z"
  },
  {
    "title": "Manu Joseph: Trump’s Gaza plan may be more pragmatic than it looks",
    "description": "It’s only the second best plan, what Trump wants done with post-war Gaza. But it could offer a better way out from a long-standing West Asian crisis than the two-state solution touted by intellectuals.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-gaza-real-estate-redevelopment-riviera-of-the-middle-east-israel-gaza-war-netanyahu-ceasefire-iran-jordan-11738842696732.html",
    "timestamp": "2025-02-09T10:30:12Z"
  },
  {
    "title": "Schapiro: Singh thee of Virginia's changing face",
    "description": "Del. J.J. Singh, D-Loudoun, is a reminder that this not your grandfather's — or your father's — Virginia.",
    "link": "https://richmond.com/news/state-regional/government-politics/jj-singh-indian-americans-changing-face-virginia-legislature/article_ee7cc3f8-e56a-11ef-a4bf-77362014e573.html",
    "timestamp": "2025-02-09T10:30:00Z"
  },
  {
    "title": "Why Trump’s Data Purge is a Digital Book Burning",
    "description": "How reporters tracked the Trump administration's data purges in real time.",
    "link": "https://slate.com/podcasts/what-next-tbd/2025/02/donald-trump-is-changing-america-down-to-the-code",
    "timestamp": "2025-02-09T10:30:00Z"
  },
  {
    "title": "PM Modi-Donald Trump Summit: Adani Group's IMEC Plan To Counter China",
    "description": "Prime Minister Narendra Modi&#039;s visit to the United States this week for talks with President Donald Trump has global implications.",
    "link": "https://www.ndtv.com/world-news/pm-modi-donald-trump-summit-adani-groups-imec-plan-to-counter-china-7670617",
    "timestamp": "2025-02-09T10:25:24Z"
  },
  {
    "title": "Ishiba: Trump eager to visit Japan this year",
    "description": "Japanese Prime Minister Shigeru Ishiba told Nikkei in an interview on Sunday that United States President Donald Trump is \"eager\" to visit Tokyo this year.Ishiba went on to say that Trump also express...",
    "link": "https://biztoc.com/x/a3e76d105558fd40",
    "timestamp": "2025-02-09T10:24:50Z"
  },
  {
    "title": "Kansas reckons with large tuberculosis outbreak as health officials hamstrung - NewsBreak",
    "description": "Experts fear consequences of Trump’s restrictions on CDC as state sees one of largest outbreaks ever recorded in US",
    "link": "https://www.newsbreak.com/share/3793888295826-kansas-reckons-with-large-tuberculosis-outbreak-as-health-officials-hamstrung?s=a2&amp;share_destination_id=MTkzNDQwMTExLTE3MzkwOTY0Nzg1NTk%3D&amp;pd=0D5ebnLU&amp;hl=en_US&amp;send_time=1739096478&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v3",
    "timestamp": "2025-02-09T10:21:58Z"
  },
  {
    "title": "Kremlin responds to reports of Putin-Trump call",
    "description": "Kremlin spokesman Dmitry Peskov has neither confirmed nor denied a phone call between Vladimir Putin and Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612406-kremlin-responds-trump-putin-call/",
    "timestamp": "2025-02-09T10:17:49Z"
  },
  {
    "title": "Kim Jong Un Accuses US of Prolonging Ukraine War",
    "description": "\"Our army and people will invariably support and encourage the just cause of the Russian army,\" the North Korean leader said.",
    "link": "https://www.newsweek.com/kim-jong-un-north-korea-us-prolong-ukraine-war-russia-2028388",
    "timestamp": "2025-02-09T10:15:21Z"
  },
  {
    "title": "Trump vows to tap America’s ‘liquid gold’ oil reserves and ‘drill baby, drill’—the only problem is, it’s not up to him",
    "description": "Donald Trump used his inauguration speech to pledge America's economy would be boosted by oil reserves. Shareholders in the industry are agnostic to his wishes. Read More",
    "link": "https://biztoc.com/x/e8d8e30a3d0ce7e2",
    "timestamp": "2025-02-09T10:13:17Z"
  },
  {
    "title": "중국, 트럼프發 보복관세 테슬라 주가 영향은?",
    "description": "They speak fluent Mandarin and love China. Shame they are fake https://t.co/HaIdGIQP0w— The Economist (@TheEconomist) February 9, 2025 The global scam industry steals $500bn a year from victims all over the world. Everyone becomes a potential target simply by…",
    "link": "https://ryueyes11.tistory.com/511475",
    "timestamp": "2025-02-09T10:08:14Z"
  },
  {
    "title": "Trump says he has spoken to Putin about ending the Ukraine war",
    "description": "Kremlin spokesman Dmitry Peskov told the TASS state news agency that \"many different communications are emerging.\"",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/world/politics/trump-putin-talks-about-ending-war/",
    "timestamp": "2025-02-09T10:03:00Z"
  },
  {
    "title": "Ecuador's Trump? Daniel Noboa's Rise Could Reshape Latin American Politics",
    "description": "When Ecuadorian President Daniel Noboa attended Donald Trump's inauguration last month, the symbolism wasn't lost on many inside his country. With Ecuador set to hold national elections on Sunday, it was a calculated move—a final push from a politician whose …",
    "link": "https://biztoc.com/x/4cf4e862d86b11d1",
    "timestamp": "2025-02-09T10:02:24Z"
  },
  {
    "title": "Does Donald Trump Want Gaza's Natural Gas Reserves? Expert Weighs In",
    "description": "President Donald Trump's plan to takeover Gaza and build it up into the \"Riviera of the Middle East\" is unlikely to heavily involve the natural gas reserves in the Gaza Marine Field, an expert told Newsweek.\nNewsweek reached out to the White House for comment…",
    "link": "https://biztoc.com/x/e94ecddda10e2acd",
    "timestamp": "2025-02-09T10:02:17Z"
  },
  {
    "title": "Trump froze Biden's marquee climate accomplishment and it's roiling the renewable energy world",
    "description": "President Donald Trump's pause on federal climate funding is delaying renewable energy projects and hiring.",
    "link": "https://www.businessinsider.com/trump-pause-climate-spending-ira-solar-ev-jobs-2025-2",
    "timestamp": "2025-02-09T10:01:02Z"
  },
  {
    "title": "Long covid effect? Conspiracy theories are alive and kicking in America",
    "description": "The US government’s past record of opacity has weakened public confidence in official narratives. Vaccine scepticism during the pandemic has lingered and is hurting public health as some parents refuse to immunize kids against various illnesses.",
    "link": "https://www.livemint.com/opinion/online-views/long-covid-conspiracy-theories-astra-zeneca-anti-vax-vaccine-scepticism-vaccine-side-effects-pandemic-trump-rfk-radical-11738847611717.html",
    "timestamp": "2025-02-09T10:00:11Z"
  },
  {
    "title": "Trump doesn’t plan to deport Prince Harry, saying Meghan Markle is enough of a burden for the royal",
    "description": "President Trump on Friday said he doesn't intend to deport Prince Harry who is the subject of a lawsuit seeking his immigration records after he admitted to past illegal drug use.",
    "link": "https://www.foxnews.com/politics/trump-doesnt-plan-deport-prince-harry-saying-meghan-markle-enough-burden-royal",
    "timestamp": "2025-02-09T10:00:03Z"
  },
  {
    "title": "Does Donald Trump Want Gaza's Natural Gas Reserves? Expert Weighs In",
    "description": "Some critics have suggested that President Donald Trump's plan to take control of Gaza is motivated by ambitions for offshore natural gas reserves.",
    "link": "https://www.newsweek.com/donald-trump-gaza-natural-gas-reserves-expert-2028339",
    "timestamp": "2025-02-09T10:00:02Z"
  },
  {
    "title": "Ecuador's Trump? Daniel Noboa's Rise Could Reshape Latin American Politics",
    "description": "Noboa's blend of populist bravado, aggressive security policies and alignment with Trumpian politics has positioned him, at 37, as a formidable figure in a changing Latin America.",
    "link": "https://www.newsweek.com/ecuadors-trump-daniel-noboas-rise-could-reshape-latin-american-politics-2027621",
    "timestamp": "2025-02-09T10:00:01Z"
  },
  {
    "title": "In Botetourt County and nationwide, libraries remain ideological hotspots",
    "description": "Some citizens in Botetourt County are still concerned that materials within the county's libraries are inappropriate and harmful for children.",
    "link": "https://roanoke.com/news/local/in-botetourt-county-and-nationwide-libraries-remain-ideological-hotspots/article_97ca47b2-ddac-11ef-adea-5304b4911d76.html",
    "timestamp": "2025-02-09T10:00:00Z"
  },
  {
    "title": "'We're figuring it out': Democrats struggle to keep up with Trump's dizzying pace",
    "description": "Actions are coming at so dizzying a pace that it can be tough to track what Trump has done and what he's turned around and undone.",
    "link": "https://www.nbcnews.com/politics/donald-trump/democrats-struggle-trump-dizzying-pace-rcna191009",
    "timestamp": "2025-02-09T10:00:00Z"
  },
  {
    "title": "Trump tariff talk boosts N.S. craft beer business",
    "description": "Nova Scotia craft breweries have seen increased demand for their products since U.S. President Donald Trump threatened to impose tariffs on Canadian goods, but they wonder if the extra support will last.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/trump-tariff-talk-nova-scotia-craft-beer-1.7453830",
    "timestamp": "2025-02-09T10:00:00Z"
  }
]