[
  {
    "title": "What happened at Mar‑a‑Lago and why it matters? #world",
    "description": "Armed breach at Mar‑a‑Lago ends with fatal law enforcement shooting Early on Sunday morning federal agents and local deputies confronted a man who had entered the secure perimeter of Mar‑a‑Lago, the Palm Beach estate tied to President Donald Trump. According …",
    "link": "https://alltoc.com/world/what-happened-at-mar-a-lago-and-why-it-matters",
    "timestamp": "2026-02-22T18:10:54Z"
  },
  {
    "title": "Brandi Carlile Says Trump Voters ‘Got F—ing Scammed’: ‘Get Mad Enough to Change Your Minds’",
    "description": "Minutes after coming offstage in Minneapolis, the songwriter talks to Rolling Stone about ICE's violent immigration approach why she's still hopeful for the U.S.",
    "link": "http://www.rollingstone.com/music/music-features/brandi-carlile-trump-voters-scammed-minneapolis-1235520768/",
    "timestamp": "2026-02-22T18:09:26Z"
  },
  {
    "title": "Greenland rejects Trump’s offer to send US hospital ship to Arctic island",
    "description": "US President Donald Trump says a 'great hospital boat' is going to Greenland as he mocks its healthcare system.",
    "link": "https://www.aljazeera.com/news/2026/2/22/greenland-reiterates-its-public-healthcare-amid-us-hospital-ship-proposal",
    "timestamp": "2026-02-22T18:06:59Z"
  },
  {
    "title": "Greenland Says ‘No Thanks’ To Trump’s Hospital Ship",
    "description": "COPENHAGEN, Feb 22 (Reuters) – Greenland’s Prime Minister Jens-Frederik Nielsen said on Sunday “no thanks” to U.S. President Donald Trump’s idea of sending a hospital ship to Greenland, a territory that Trump has...",
    "link": "https://gcaptain.com/greenland-says-no-thanks-to-trumps-hospital-ship/",
    "timestamp": "2026-02-22T18:05:35Z"
  },
  {
    "title": "Dennis Quaid Thinks Hollywood Has Gone Far Left, Calls Trump ‘Really Genuine’ With ‘A Lot of Energy’",
    "description": "Dennis Quaid thinks that American politics have gone too far to the left in recent years. The actor, who portrayed President Ronald Reagan in the 2024 biopic “Reagan,” was interviewed on Pastor Greg Laurie’s “The Greg Laurie Show” earlier this week. Laurie pr…",
    "link": "https://variety.com/2026/film/news/dennis-quaid-hollywood-far-left-praises-trump-1236669653/",
    "timestamp": "2026-02-22T18:02:45Z"
  },
  {
    "title": "Oman confirms US-Iran talks will take place in Geneva on Thursday",
    "description": "Iran is negotiating 'only nuclear' at present, its foreign minister says, and is confident a deal can be reached.",
    "link": "https://www.aljazeera.com/news/2026/2/22/oman-confirms-us-iran-talks-will-take-place-in-geneva-on-thursday",
    "timestamp": "2026-02-22T18:01:54Z"
  },
  {
    "title": "TRUMP and MELANIA Meme Coins Leave Retail Investors With $4.3 Billion Loss",
    "description": "President Trump-related tokens wiped out over $4.3 billion in retail wealth while early insiders walked away with over $1.2 billion.",
    "link": "https://beincrypto.com/trump-meme-coins-took-4-billion-from-retail-investors/",
    "timestamp": "2026-02-22T18:01:48Z"
  },
  {
    "title": "BREAKING: Secret Service Shoots Armed Intruder at Mar-a-Lago; UPDATE: Identified (Ed Morrissey/HotAir)",
    "description": "Ed Morrissey / HotAir:\nBREAKING: Secret Service Shoots Armed Intruder at Mar-a-Lago; UPDATE: Identified  —  Was this a third assassination attempt in 18 months on Donald Trump?  If so, the man who attempted to breach security at Mar-a-Lago with a shotgun and …",
    "link": "https://www.memeorandum.com/260222/p23",
    "timestamp": "2026-02-22T18:00:25Z"
  },
  {
    "title": "President Donald Trump helps UFC contender with immigration woes",
    "description": "Uros Medic had an important phone call with Donald Trump",
    "link": "https://www.mmafighting.com/ufc/473056/uros-medic-president-donald-trump-solved-immigration-issues-after-ufc-houston-post-fight-plea",
    "timestamp": "2026-02-22T18:00:00Z"
  },
  {
    "title": "The Weekly Dirt: Palantir heads to Miami, but will the real estate impact match Citadel’s?",
    "description": "Palantir Technologies took to X this week to announce its move to Miami.  The publicly traded AI software firm, led by CEO Alex Karp, is leasing space at Industrious, a co-working space in Aventura. Boosters of Miami real estate rejoiced, but will the move, a…",
    "link": "https://therealdeal.com/miami/2026/02/22/sizing-up-palantirs-move-to-miami-billionaire-migration/",
    "timestamp": "2026-02-22T18:00:00Z"
  },
  {
    "title": "EU Says U.S. Must Honor Trade Deal After Supreme Court Tariff Ruling",
    "description": "The European Union's executive arm requested \"full clarity\" from the United States and asked its trade partner to fulfill its commitments after the U.S. Supreme Court struck down some of President Donald Trump's most sweeping tariffs.\nThe post EU Says U.S. Mu…",
    "link": "https://www.breitbart.com/europe/2026/02/22/eu-says-us-must-honor-trade-deal-after-supreme-court-tariff-ruling/",
    "timestamp": "2026-02-22T17:58:15Z"
  },
  {
    "title": "Iran Says Nuclear Talks With Trump’s Envoy to Resume This Week",
    "description": "Iranian Foreign Minister Abbas Araghchi said he’s likely to meet US special envoy Steve Witkoff Thursday in Geneva, seeking a diplomatic resolution for the latest standoff over Tehran’s nuclear program.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-says-nuclear-talks-with-trumps-envoy-to-resume-this-week",
    "timestamp": "2026-02-22T17:56:34Z"
  },
  {
    "title": "In through the out door? Mechanisms may change, but Trump regime's goal to reshape global trade remains same",
    "description": "The US Supreme Court's recent decision to invalidate global tariffs has thrown a wrench in Donald Trump's economic strategy, providing a sigh of relief for some stakeholders. However, the President is undeterred and is actively pursuing other legal avenues to…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/in-through-the-out-door-mechanisms-may-change-but-trump-regimes-goal-to-reshape-global-trade-remains-same/articleshow/128685104.cms",
    "timestamp": "2026-02-22T17:56:33Z"
  },
  {
    "title": "Iran says has right self-defence if US talks fail",
    "description": "Iran's Foreign Minister Abbas Araghchi warned Sunday that his country would respond to any U.S. attack, but held out hope for a diplomatic solution, saying he expected another round of talks in Geneva later in the week.",
    "link": "https://www.hurriyetdailynews.com/iran-says-has-right-self-defence-if-us-talks-fail-219207",
    "timestamp": "2026-02-22T17:55:34Z"
  },
  {
    "title": "University students hold new protests in Iran around memorials for those killed",
    "description": "Iran's state news agency said students protested at five universities in the capital, Tehran, and one in the city of Mashhad on Sunday.",
    "link": "https://www.npr.org/2026/02/22/nx-s1-5722880/university-students-hold-new-protests-in-iran-around-memorials-for-those-killed",
    "timestamp": "2026-02-22T17:54:52Z"
  },
  {
    "title": "Bond market momentum shifts bears’ way as sell signals flash",
    "description": "Meanwhile, jobs data and a higher-than-expected inflation reading suggest the bar is high for further Fed rate cuts in the coming months.  “We are...",
    "link": "https://finance.yahoo.com/news/bond-market-momentum-shifts-bears-175422005.html",
    "timestamp": "2026-02-22T17:54:22Z"
  },
  {
    "title": "'No thanks': ​Greenland leader gives icy reception to Trump's bizarre hospital ship plan",
    "description": "President Donald Trump’s bizarre plan\r\n to deploy a hospital ship to Greenland drew a chilly response Sunday from Greenland Prime Minister Jens-Frederick Nielsen, who politely told the president “no thanks” to his unusual proposition.On Friday, Trump made the…",
    "link": "https://www.rawstory.com/greenland-2675292228/",
    "timestamp": "2026-02-22T17:48:22Z"
  },
  {
    "title": "Nicki Minaj shares photo of ‘meaningful’ bible signed by Trump",
    "description": "The ‘God Bless The U.S.A.’ Bible is sold for $1,000 online",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/nicki-minaj-bible-donald-trump-b2925273.html",
    "timestamp": "2026-02-22T17:47:01Z"
  },
  {
    "title": "Trump says Netflix will face ‘consequences’ if it doesn’t fire board member Susan Rice | TechCrunch",
    "description": "Netflix board member Susan Rice had predicted that corporations that “take a knee” to Trump will be “held accountable” when Democrats return to power.",
    "link": "https://techcrunch.com/2026/02/22/trump-says-netflix-will-face-consequences-if-it-doesnt-fire-board-member-susan-rice/",
    "timestamp": "2026-02-22T17:43:37Z"
  },
  {
    "title": "US says ambassador's comments on Israel and the Middle East were taken out of context",
    "description": "There is fresh outrage over U.S. ambassador to Israel Mike Huckabee's remarks in an interview that Israel could “take it all” when asked about biblical claims to Middle East land",
    "link": "https://abcnews.com/International/wireStory/us-ambassadors-comments-israel-middle-east-context-130386010",
    "timestamp": "2026-02-22T17:41:46Z"
  },
  {
    "title": "Mexican army kills leader of powerful Jalisco New Generation Cartel during operation to capture him",
    "description": "The Mexican army killed the leader of the Jalisco New Generation Cartel, Nemesio Rubén Oseguera Cervantes, “El Mencho, ” on Sunday, decapitating what had become Mexico’s most powerful cartel and giving the government its biggest prize yet to show the Trump ad…",
    "link": "https://www.denverpost.com/2026/02/22/mexican-army-kills-leader-of-powerful-jalisco-new-generation-cartel-during-operation-to-capture-him/",
    "timestamp": "2026-02-22T17:34:20Z"
  },
  {
    "title": "Ghana takes transatlantic slavery case to UN",
    "description": "Ghana's President Mahama has received the African Union's backing in pushing the United Nations to recognize transatlantic slavery as the 'gravest crime against humanity.' But will the motion pass? Ghanaian President John Mahama wants to push the proposal, wh…",
    "link": "https://www.dw.com/en/ghana-takes-transatlantic-slavery-case-to-un/a-76042626",
    "timestamp": "2026-02-22T17:34:00Z"
  },
  {
    "title": "Trump Pledges Hospital Boat for Greenland—Which, Unlike US, Has 'Free and Equal Access to Health for All'",
    "description": "Shortly after the Danish military evacuated a crew member of a US submarine off the Greenlandic coast for urgent medical care on Saturday, President Donald Trump pledged to send a \"hospital boat\" to the self-governing Danish territory—but officials from Green…",
    "link": "https://www.commondreams.org/news/greenland-healthcare",
    "timestamp": "2026-02-22T17:33:04Z"
  },
  {
    "title": "EU 'expects' US to honour trade deal amid tariffs hike",
    "description": "The European Commission has called for Washington to abide by the terms of the trade deal struck last year with the EU, as President Donald Trump announced new global tariff hikes a day after an adverse Supreme Court ruling.",
    "link": "https://www.rte.ie/news/us/2026/0222/1559823-us-eu-tariffs/",
    "timestamp": "2026-02-22T17:32:33Z"
  },
  {
    "title": "Iranian students rally as universities reopen after nationwide protests",
    "description": "Many students remain incarcerated after being taken by security forces during and after the bloody protests in January.",
    "link": "https://www.aljazeera.com/news/2026/2/22/iranian-students-rally-as-universities-reopen-after-nationwide-protests",
    "timestamp": "2026-02-22T17:30:10Z"
  },
  {
    "title": "Has Donald Trump lost his most powerful tariff weapon?",
    "description": "The US Supreme Court decision on tariffs has upended the central plank of President Donald Trump's economic and foreign policy. Will this lead to a change of course, or will Trump double down?",
    "link": "https://www.dw.com/en/has-donald-trump-lost-his-most-powerful-tariff-weapon/a-76077670",
    "timestamp": "2026-02-22T17:30:00Z"
  },
  {
    "title": "Bessent blames left's political 'venom' for violence after deadly Mar-a-Lago incident",
    "description": "Treasury Secretary Bessent blames political \"venom\" after deadly security incident at Trump's Mar-a-Lago estate. Suspect shot, killed by authorities Sunday.",
    "link": "https://www.foxnews.com/media/bessent-blames-lefts-political-venom-violence-after-deadly-mar-a-lago-incident",
    "timestamp": "2026-02-22T17:24:23Z"
  },
  {
    "title": "Trump tariffs: 'A deal is a deal,' EU insists",
    "description": "The EU's executive insisted that \"a deal is a deal\" after US President Donald Trump said he was raising a global 10% tariff to 15% in response to the US Supreme Court blocking many of his emergency tariffs.",
    "link": "https://www.dw.com/en/trump-tariffs-a-deal-is-a-deal-eu-insists/a-76079677",
    "timestamp": "2026-02-22T17:24:00Z"
  },
  {
    "title": "European Commission urges US to honor trade deal",
    "description": "The EU's executive insisted that \"a deal is a deal\" after US President Donald Trump said he was raising a global 10% tariff to 15% in response to the US Supreme Court blocking many of his emergency tariffs.",
    "link": "https://www.dw.com/en/european-commission-urges-us-to-honor-trade-deal/a-76079677",
    "timestamp": "2026-02-22T17:24:00Z"
  },
  {
    "title": "‘A deal is a deal’: EU says US must honor a trade deal after court blocks Trump tariffs",
    "description": "The European Union's executive arm requested \"full clarity\" from the United States and asked its trade partner to fulfill its commitments after the U.S. Supreme Court struck down some of President Donald Trump's most sweeping tariffs.",
    "link": "https://www.bostonherald.com/2026/02/22/a-deal-is-a-deal-eu-says-us-must-honor-a-trade-deal-after-court-blocks-trump-tariffs/",
    "timestamp": "2026-02-22T17:23:18Z"
  },
  {
    "title": "US Ambassador to Israel: “It Would Be Fine” If Israel Took Over Most of the Middle East",
    "description": "On Sunday, more than a dozen Arab and Islamic governments condemned statements made by US Ambassador to Israel Mike Huckabee after he said n an interview with Tucker Carlson that Israel had the biblical right to take over land belonging to other states in the…",
    "link": "https://www.motherjones.com/politics/2026/02/us-ambassador-to-israel-it-would-be-fine-if-israel-took-over-most-of-the-middle-east/",
    "timestamp": "2026-02-22T17:19:38Z"
  },
  {
    "title": "Trump congratulates Team USA after picking up men's hockey gold in Olympic thriller",
    "description": "Team USA's Jack Hughes scored the game-winning goal in the gold medal game of the 2026 Winter Olympics against Canada on Sunday. President Donald Trump weighed in.",
    "link": "https://www.foxnews.com/sports/trump-congratulates-team-usa-after-picking-up-mens-hockey-gold-olympic-thriller",
    "timestamp": "2026-02-22T17:19:26Z"
  },
  {
    "title": "Scott Bessent Lays Out Future Of Trump’s Tariffs, Trade Deals",
    "description": "Treasury Secretary Scott Bessent told Maria Bartiromo on Sunday revenue from tariffs would not drop, despite the Supreme Court's ruling against Trump's tariffs.",
    "link": "https://dailycaller.com/2026/02/22/scott-bessent-explains-future-donald-trump-tariffs-trade-deals-sunday-morning-futures-maria-bartiromo-fox/",
    "timestamp": "2026-02-22T17:15:11Z"
  },
  {
    "title": "Eric Trump Pouring Funding Into “Low Cost-Per-Kill” Drone Corporation",
    "description": "What can you even say at this point?\nThe post Eric Trump Pouring Funding Into “Low Cost-Per-Kill” Drone Corporation appeared first on Futurism.",
    "link": "http://futurism.com/robots-and-machines/drones-eric-trump-xtend",
    "timestamp": "2026-02-22T17:15:00Z"
  },
  {
    "title": "Huckabee's remarks on Israel and Middle East were taken out of context, embassy says",
    "description": "U.S. ambassador to Israel, Mike Huckabee, made his comments during an interview with conservative commentator Tucker Carlson that aired Friday.",
    "link": "https://www.cbsnews.com/news/mike-huckabee-israel-middle-east-arab-muslim-countries-comments/",
    "timestamp": "2026-02-22T17:13:11Z"
  },
  {
    "title": "Netflix Officially Under DOJ Antitrust Scrutiny “To Create A Monopoly” With Warner Bros Merger; Feds Want Details From Producers & Filmmakers On Streamer’s Leverage",
    "description": "After months of jabs and feints, the white gloves may have truly come off in Netflix and Paramount’s multibillion-dollar battle for control of Warner Bros. Discovery. With just 24 hours left to go on the WBD board’s weeklong talks with the David Ellison-owned…",
    "link": "http://deadline.com/2026/02/doj-netflix-wb-deal-antitrust-probe-1236731978/",
    "timestamp": "2026-02-22T17:12:53Z"
  },
  {
    "title": "Bill Maher calls for complete end to State of the Union address ahead of Trump speech",
    "description": "Comedian Bill Maher called for ending State of the Union tradition on \"Real Time,\" criticizing how the annual speech that makes presidents appear \"like a king.\"",
    "link": "https://www.foxnews.com/media/bill-maher-calls-complete-end-state-union-address-ahead-trump-speech",
    "timestamp": "2026-02-22T17:12:43Z"
  },
  {
    "title": "‘Crazy person’: Armed intruder shot dead at Trump’s Florida home now identified as Austin Tucker Martin",
    "description": "'He had been reported missing by his family a few days ago, and investigators believe he headed south and picked up the shotgun along the way'",
    "link": "https://www.wnd.com/2026/02/crazy-person-armed-intruder-shot-dead-trumps-florida/",
    "timestamp": "2026-02-22T17:11:15Z"
  },
  {
    "title": "OK Gov. Stitt: Trump Tariffs Were Bringing Back Manufacturing in Oklahoma",
    "description": "On this week's broadcast of NewsNation’s “The Hill Sunday,\" Gov. Kevin Stitt (R-OK) said President Donald Trump's tariffs were bringing back manufacturing in his state.\nThe post OK Gov. Stitt: Trump Tariffs Were Bringing Back Manufacturing in Oklahoma appeare…",
    "link": "https://www.breitbart.com/clips/2026/02/22/gov-kevin-stitt/",
    "timestamp": "2026-02-22T17:08:45Z"
  },
  {
    "title": "UPDATED: Donald's Latest Bizarre Post On Greenland Gets Hilariously Shut Down",
    "description": "It's unclear why Donald Trump announced on Saturday that the United States would be sending “a great hospital boat” to Greenland for a nonexistent humanitarian mission, where Greenlanders enjoy free health care, including prescription medications. But why let…",
    "link": "https://crooksandliars.com/2026/02/trumps-latest-bizarre-post-greenland-gets",
    "timestamp": "2026-02-22T17:04:00Z"
  },
  {
    "title": "Armed Man Fatally Shot at Mar-a-Lago, Secret Service Says",
    "description": "An armed man was fatally shot on Sunday after driving into the secure perimeter of Donald Trump’s Mar-a-Lago estate as another vehicle was exiting, according to a spokesperson for the US Secret Service. “The individual was observed by the north gate of the Ma…",
    "link": "https://www.motherjones.com/politics/2026/02/armed-man-shot-maralago-trump-secret-service/",
    "timestamp": "2026-02-22T17:01:15Z"
  },
  {
    "title": "These clownish villains may actually bring down Trump",
    "description": "President Donald Trump stumped with promises to rescue the forgotten man, telling his MAGA base he'd bring down the globalist \"left\" by exposing the Epstein empire and destroying the pillars of domestic democracy, one at a time, all in accord with Project 202…",
    "link": "https://www.rawstory.com/raw-investigates/trump-cabinet-2675285824/",
    "timestamp": "2026-02-22T17:00:29Z"
  },
  {
    "title": "Trump’s Push for Greenland",
    "description": "As Donald Trump threatens Greenland with a takeover, Al Jazeera speaks to people there about their concerns.",
    "link": "https://www.aljazeera.com/video/featured-documentaries/2026/2/22/trumps-push-for-greenland",
    "timestamp": "2026-02-22T17:00:00Z"
  },
  {
    "title": "Trump Lauds US Men’s Hockey Team’s Olympic Win: ‘THEY WON THE GOLD. WOW!’",
    "description": "President Donald Trump wasted no time saluting the U.S. men's Olympic hockey team — which won the gold Sunday by defeating Canada 2-1 in an overtime thriller.\nThe post Trump Lauds US Men’s Hockey Team’s Olympic Win: ‘THEY WON THE GOLD. WOW!’ first appeared on…",
    "link": "https://www.mediaite.com/media/sports/trump-lauds-us-mens-hockey-teams-olympic-win-they-won-the-gold-wow/",
    "timestamp": "2026-02-22T16:56:46Z"
  },
  {
    "title": "The uncertainties facing businesses and consumers after Trump's tariff changes",
    "description": "Businesses say questions remain after US President Donald Trump announced he will impose global tariffs of 15%.",
    "link": "https://www.bbc.com/news/articles/c98qjl76eyro",
    "timestamp": "2026-02-22T16:55:58Z"
  },
  {
    "title": "Trump vows 'consequences' if Netflix doesn't fire Susan Rice",
    "description": "The president is pressuring the streaming service as its merger with Warner Bros. Discovery undergoes a federal regulatory review.",
    "link": "https://www.washingtonexaminer.com/news/white-house/4466831/trump-netflix-fire-board-member-susan-rice/",
    "timestamp": "2026-02-22T16:55:38Z"
  },
  {
    "title": "Gavin Newsom reveals what’s standing between him and running for president: ‘I’m busted’",
    "description": "California Governor Gavin Newsom revealed to CNN that the only thing standing between him and a presidential run is how his family feels about it.",
    "link": "https://nypost.com/2026/02/22/us-news/gavin-newsom-reveals-whats-standing-between-him-and-presidential-run/",
    "timestamp": "2026-02-22T16:48:58Z"
  },
  {
    "title": "Secret Service says an armed man was shot and killed after entering Mar-a-Lago's secure perimeter",
    "description": "An armed man drove into the secure perimeter of Mar-a-Lago as another vehicle was exiting before being shot and killed Sunday morning, according to a spokesman for the U.S. Secret Service.",
    "link": "https://www.pbs.org/newshour/nation/secret-service-says-an-armed-man-was-shot-and-killed-after-entering-mar-a-lagos-secure-perimeter",
    "timestamp": "2026-02-22T16:46:05Z"
  },
  {
    "title": "USA stun Canada in overtime to win first Olympic men’s ice hockey gold since 1980",
    "description": "US win third Olympic gold and the first since the Miracle on Ice team",
    "link": "https://www.irishtimes.com/sport/2026/02/22/usa-stun-canada-in-overtime-to-win-first-olympic-mens-ice-hockey-gold-since-1980/",
    "timestamp": "2026-02-22T16:42:48Z"
  },
  {
    "title": "Comment of the Week: 'Trump's Personal Bidet'",
    "description": "Take a guess at which Republican senator this comment is about.",
    "link": "https://www.jezebel.com/comment-of-the-week-trumps-personal-bidet",
    "timestamp": "2026-02-22T16:40:08Z"
  },
  {
    "title": "Is Super Rugby Pacific doing damage to All Blacks’ chances of beating South Africa? – Phil Gifford",
    "description": "OPINION: Strange days indeed in the world of All Blacks coaching.",
    "link": "https://www.nzherald.co.nz/sport/rugby/is-super-rugby-pacific-doing-damage-to-all-blacks-chances-of-beating-south-africa-phil-gifford/premium/XEKTJ2UMVNES7FPCQXUCKS3CRE/",
    "timestamp": "2026-02-22T16:36:29Z"
  },
  {
    "title": "New Round of Iran-US Nuclear Talks May Take Place in Geneva on Thursday - Foreign Minister",
    "description": "MOSCOW (Sputnik) - Iranian Foreign Minister Abbas Araghchi said that a new round of nuclear talks between Iran and the United States could take place in Geneva on Thursday.",
    "link": "https://sputnikglobe.com/20260222/new-round-of-iran-us-nuclear-talks-may-take-place-in-geneva-on-thursday---foreign-minister-1123672020.html",
    "timestamp": "2026-02-22T16:34:54Z"
  },
  {
    "title": "Gunman armed with rifle and gasoline can shot dead by Secret Service at Trump’s Mar-a-Lago Estate",
    "description": "Security forces did not release information about the identity of the 20-year-old, but during the press conference they displayed the rifle in a photograph — Trump was not at Mar-a-Lago\nThe post Gunman armed with rifle and gasoline can shot dead by Secret Ser…",
    "link": "https://en.protothema.gr/2026/02/22/gunman-armed-with-rifle-and-gasoline-can-shot-dead-by-secret-service-at-trumps-mar-a-lago-estate/",
    "timestamp": "2026-02-22T16:34:12Z"
  },
  {
    "title": "Here's exactly what Susan Rice said that caused Trump to call for Netflix to fire her from its board",
    "description": "President Donald Trump demanded that Netflix drop Susan Rice from its board after she was sharply critical of his administration.",
    "link": "https://www.businessinsider.com/donald-trump-susan-rice-netflix-full-comments-2026-2",
    "timestamp": "2026-02-22T16:24:36Z"
  },
  {
    "title": "US envoy Huckabee tries to deny saying he would support Israel expansionism",
    "description": "Rights advocate warns that failure to sack Huckabee 'will be read by the world as an endorsement of his views' by Trump.",
    "link": "https://www.aljazeera.com/news/2026/2/22/us-envoy-huckabee-tries-to-deny-saying-he-would-support-israel-expansionism",
    "timestamp": "2026-02-22T16:23:37Z"
  },
  {
    "title": "Iran's regime may be ready to strike a deal with Trump",
    "description": "Student-led protests have taken place in Iran this weekend, coinciding with the start of the new university term and the 40th day of mourning for many of the thousands of people killed by security forces in early January.",
    "link": "https://news.sky.com/story/as-protests-resume-in-tehran-irans-regime-may-be-ready-to-strike-a-deal-with-trump-13510831",
    "timestamp": "2026-02-22T16:22:00Z"
  },
  {
    "title": "“Still hard to comprehend”: Conan mulls deaths of Rob and Michelle Reiner, Catherine O’Hara",
    "description": "The comedian opened up about the famed director and his wife, who were killed after attending his holiday party",
    "link": "https://www.salon.com/2026/02/22/still-hard-to-comprehend-conan-mulls-deaths-of-rob-and-michelle-reiner-catherine-ohara/",
    "timestamp": "2026-02-22T16:21:54Z"
  },
  {
    "title": "ICE's purchases for big detention centers are marked by secrecy, frustrating towns",
    "description": "At least 20 communities with large warehouses across the U.S. have become stealth targets for Immigration and Customs Enforcement’s $45-billion expansion of detention centers",
    "link": "https://abcnews.com/US/wireStory/ices-purchases-big-detention-centers-marked-secrecy-frustrating-130361435",
    "timestamp": "2026-02-22T16:21:28Z"
  },
  {
    "title": "Transcript: Govs. Laura Kelly of Kansas, Andy Beshear of Kentucky, Mike Braun of Indiana and Mike DeWine of Ohio on \"Face the Nation with Margaret Brennan,\" Feb. 22, 2026",
    "description": "The following is the full transcript of the interview with Govs. Laura Kelly of Kansas, Andy Beshear of Kentucky, Mike Braun of Indiana and Mike DeWine of Ohio that aired on \"Face the Nation with Margaret Brennan\" on Feb. 22, 2026.",
    "link": "https://www.cbsnews.com/news/governors-laura-kelly-andy-beshear-mike-braun-mike-dewine-face-the-nation-transcript-02-22-2026/",
    "timestamp": "2026-02-22T16:18:44Z"
  },
  {
    "title": "'Global power' India to be part of 'hexagon' of alliances in and around the region: Netanyahu",
    "description": "Israeli Prime Minister Benjamin Netanyahu described India as a global power and Prime Minister Narendra Modi as a personal friend. Netanyahu revealed a vision for a \"hexagon\" of alliances in the region that will include India. This strategic grouping aims to …",
    "link": "https://economictimes.indiatimes.com/news/defence/global-power-india-to-be-part-of-hexagon-of-alliances-in-and-around-the-region-netanyahu/articleshow/128681601.cms",
    "timestamp": "2026-02-22T16:17:25Z"
  },
  {
    "title": "Secret Service shoots armed intruder at Trump's Mar-a-Lago after security breach",
    "description": "An armed man was shot and killed by U.S. Secret Service agents after breaching the security perimeter at President Donald Trump&apos;s Mar-a-Lago estate in Palm Beach, Florida, ear",
    "link": "https://www.marca.com/en/lifestyle/us-news/2026/02/22/699b2996ca47410f518b457e.html",
    "timestamp": "2026-02-22T16:15:51Z"
  },
  {
    "title": "Armed man shot dead while entering Trump's Florida estate",
    "description": "Armed man shot dead while entering Trump's Florida estatetimesofmalta.com",
    "link": "https://timesofmalta.com/article/man-shot-dead-entering-trump-florida-estate.1124470",
    "timestamp": "2026-02-22T16:15:30Z"
  },
  {
    "title": "USA win men's Olympic ice hockey gold for first time in 46 years",
    "description": "United States win the men's Olympic ice hockey gold medal for the first time in 46 years by beating neighbours Canada in overtime.",
    "link": "https://www.bbc.com/sport/ice-hockey/articles/cvgv89eq1jjo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2026-02-22T16:14:11Z"
  },
  {
    "title": "Armed Intruder Shot Dead After Breaching Security at Donald Trump's Mar-a-Lago Estate",
    "description": "Armed intruder shot dead after breaching security at Donald Trump's Mar-a-Lago estate, Secret Service confirms.",
    "link": "https://radaronline.com/p/armed-intruder-shot-dead-breaching-security-donald-trump-mar-a-lago/",
    "timestamp": "2026-02-22T16:12:46Z"
  },
  {
    "title": "Will US midterm elections alter balance of power?",
    "description": "The US Supreme Court ruling could be a turning point in the political fortunes of both parties. Most American now blame the tariffs for increase in the cost of living",
    "link": "https://www.thehindubusinessline.com/opinion/will-us-midterm-elections-alter-balance-of-power/article70664252.ece",
    "timestamp": "2026-02-22T16:12:39Z"
  },
  {
    "title": "Transcript: U.S. Trade Representative Jamieson Greer on \"Face the Nation with Margaret Brennan,\" Feb. 22, 2026",
    "description": "The following is the transcript of the interview with U.S. Trade Representative Jamieson Greer that aired on \"Face the Nation with Margaret Brennan\" on Feb. 22, 2026.",
    "link": "https://www.cbsnews.com/news/jamieson-greer-us-trade-representative-face-the-nation-transcript-02-22-2026/",
    "timestamp": "2026-02-22T16:11:30Z"
  },
  {
    "title": "Greenland prime minister says 'no thanks' to Trump's hospital ship (Stine Jacobsen/Reuters)",
    "description": "Stine Jacobsen / Reuters:\nGreenland prime minister says ‘no thanks’ to Trump's hospital ship  —  Greenland's Prime Minister Jens-Frederik Nielsen said on Sunday “no thanks” to U.S. President Donald Trump's idea of sending a hospital ship to Greenland, a terri…",
    "link": "https://www.memeorandum.com/260222/p19",
    "timestamp": "2026-02-22T16:10:01Z"
  },
  {
    "title": "Netflix Chief Ted Sarandos’ Message To Paramount On Eve Of Warner Deadline: “Put A Better Deal On The Table”",
    "description": "Ted Sarandos has flown into London with a message for Paramount as both studios chase the prize of Warner Bros. Discovery (WBD). Speaking to Deadline on the red carpet of the BAFTA Film Awards, the Netflix co-CEO said: “We have a signed deal with Warner Bros.…",
    "link": "http://deadline.com/2026/02/netflix-ted-sarandos-paramount-bafta-film-awards-1236732313/",
    "timestamp": "2026-02-22T16:09:58Z"
  },
  {
    "title": "Why the rush to set up data centres in India",
    "description": "Less than 6 per cent of the world’s data storage is located here, despite the country producing about a fifth of world data",
    "link": "https://www.thehindubusinessline.com/opinion/why-the-rush-to-set-up-data-centres-in-india/article70664257.ece",
    "timestamp": "2026-02-22T16:09:31Z"
  },
  {
    "title": "Gold price, silver rate predictions: What to expect in February last week? Analysts make bold opinions",
    "description": "Gold rate, Silver price predictions: Market participants will closely watch key economic indicators through out the week.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-silver-rate-predictions-what-to-expect-in-february-last-week-analysts-make-bold-opinions/articleshow/128682009.cms",
    "timestamp": "2026-02-22T16:08:50Z"
  },
  {
    "title": "EU demands clarity from US after court strikes down Trump tariffs",
    "description": "The European Commission says the United States needs to honor its tariff deal with the EU after the Supreme court blocked parts of President Donald Trump’s trade agenda. On Sunday, the commission asked Washington for “full clarity” and said “a deal is a deal.…",
    "link": "https://apnews.com/article/eu-us-trump-tariffs-commission-trade-8c5f9fa35d9f0f13afef0ddbaf88b1f6",
    "timestamp": "2026-02-22T16:07:56Z"
  },
  {
    "title": "US Secret Service kills man trying to enter Trump’s Mar-a-Lago estate",
    "description": "An armed man was shot and killed by the U.S. Secret Service after unlawfully entering Donald Trump’s Mar-a-Lago estate in Florida.\n\nRead More: https://punchng.com/us-secret-service-kills-man-trying-to-enter-trumps-mar-a-lago-estate/",
    "link": "https://punchng.com/us-secret-service-kills-man-trying-to-enter-trumps-mar-a-lago-estate/",
    "timestamp": "2026-02-22T16:07:31Z"
  },
  {
    "title": "Security breach: Armed intruder shot dead at Mar-a-Lago",
    "description": "An armed man was killed by Secret Service agents after entering a restricted area of Mar-a-Lago, officials say",
    "link": "https://www.salon.com/2026/02/22/security-breach-armed-intruder-shot-dead-at-mar-a-lago/",
    "timestamp": "2026-02-22T16:07:31Z"
  },
  {
    "title": "Trump demands Netflix fire Susan Rice as DOJ probes Warner deal",
    "description": "Rice argued during a podcast last week that \"it is not going to end well\" for corporations, news organizations, and law firms that \"bent the knee\" to Trump.",
    "link": "https://www.cnbc.com/2026/02/22/trump-demands-netflix-fire-susan-rice-as-doj-probes-warner-deal.html",
    "timestamp": "2026-02-22T16:07:24Z"
  },
  {
    "title": "Shapiro: Trump Is Sending ICE Agents on 'Unconstitutional Missions'",
    "description": "Sunday on ABC's \"This Week,\" Gov. Josh Shapiro (D-PA) accused President Donald Trump of sending Immigration and Customs Enforcement (ICE) agents out on \"unconstitutional missions.\"\nThe post Shapiro: Trump Is Sending ICE Agents on ‘Unconstitutional Missions’ a…",
    "link": "https://www.breitbart.com/clips/2026/02/22/shapiro-trump-is-sending-ice-agents-on-unconstitutional-missions/",
    "timestamp": "2026-02-22T16:04:56Z"
  },
  {
    "title": "Arutz Sheva Exclusive: 'Regime change is an opportunity for the entire Middle East'",
    "description": "U.S. Congressman Andy Ogles spoke about the regional upheaval surrounding Iran and declared that the time was right for a free Iran and making the world safer for Israel and the USA.",
    "link": "https://www.israelnationalnews.com/news/422807",
    "timestamp": "2026-02-22T16:04:00Z"
  },
  {
    "title": "Top EU lawmaker proposes pause on U.S. trade deal ratification, citing ‘pure tariff chaos’ from Trump administration",
    "description": "“No one can make sense of it anymore — only open questions and growing uncertainty for the EU and other U.S. trading partners.”",
    "link": "https://fortune.com/2026/02/22/eu-pause-us-trade-deal-ratification-tariff-chaos-trump-supreme-court/",
    "timestamp": "2026-02-22T16:03:56Z"
  },
  {
    "title": "Shapiro: Trump's Policies Are 'Chaotic, Cruel and Corrupt'",
    "description": "Sunday on ABC's \"This Week,\" Gov. Josh Shapiro (D-PA) said President Donald Trump's policies were \"chaotic, cruel and corrupt.\"\nThe post Shapiro: Trump’s Policies Are ‘Chaotic, Cruel and Corrupt’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/02/22/shapiro-trumps-policies-are-chaotic-cruel-and-corrupt/",
    "timestamp": "2026-02-22T16:03:14Z"
  },
  {
    "title": "Obama Is in No Position to Lecture Us About Decency",
    "description": "In a recent interview with “No Lie” podcaster Brian Tyler Cohen, former President Barack Obama claimed that conservatives do “the mean, angry, exclusive, us/them, divisive... Read More\nThe post Obama Is in No Position to Lecture Us About Decency appeared firs…",
    "link": "https://www.dailysignal.com/2026/02/22/obama-is-in-no-position-to-lecture-us-about-decency/",
    "timestamp": "2026-02-22T16:00:00Z"
  },
  {
    "title": "The young man who entered Trump's house carrying weapons and fuel was killed.",
    "description": "A young man who attempted to illegally enter the 'Mar-a-Lago' resort, owned by American President Donald Trump, was shot and killed by security forces. The incident was reported around 1:30 AM on Sunday, and the young man who was shot died at the scene.The Se…",
    "link": "https://english.gossiplankanews.com/2026/02/the-young-man-who-entered-trumps-house.html",
    "timestamp": "2026-02-22T15:55:26Z"
  },
  {
    "title": "Four years after Russia invaded Ukraine, nearly 2 million soldiers are dead, wounded or missing as drones expand kill zone",
    "description": "The Center for Strategic and International Studies estimated Russian casualties at 1.2 million, including 325,000 killed, and Ukrainian casualties at up to 600,000, including up to 140,000 killed.",
    "link": "https://fortune.com/2026/02/22/russia-invasion-ukraine-war-2-million-military-casualties-drone-warfare-kill-zone/",
    "timestamp": "2026-02-22T15:51:00Z"
  },
  {
    "title": "Bitcoin see-saws around $68,000, DOGE, ETH slide as tariff uncertainty weighs on risk assets",
    "description": "President Donald Trump raised the global tariff rate to 15% despite a Supreme Court ruling against earlier emergency trade measures, keeping pressure on China and other partners.",
    "link": "https://www.coindesk.com/markets/2026/02/22/bitcoin-dips-to-usd67-000-doge-eth-slide-as-tariff-uncertainty-weighs-on-risk-assets",
    "timestamp": "2026-02-22T15:45:23Z"
  },
  {
    "title": "Cities Are Shredding Their AI Surveillance Contracts en Masse",
    "description": "\"We are seeing a lot more momentum.\"\nThe post Cities Are Shredding Their AI Surveillance Contracts en Masse appeared first on Futurism.",
    "link": "http://futurism.com/artificial-intelligence/ai-surveillance-flock-contracts",
    "timestamp": "2026-02-22T15:45:00Z"
  },
  {
    "title": "Trump Without Orange Makeup Is a Different Animal",
    "description": "Trump Without Orange Makeup Is a Different Animalcafemom.com",
    "link": "https://cafemom.com/entertainment/donald-trump-public-without-orange-makeup",
    "timestamp": "2026-02-22T15:44:46Z"
  },
  {
    "title": "'A deal is a deal': EU says it 'expects' US to honour trade deal as Trump hikes tariffs",
    "description": "The European Commission has also requested “full clarity” on the steps the US intends to take.",
    "link": "https://www.thejournal.ie/eu-tariffs-2-6964497-Feb2026/",
    "timestamp": "2026-02-22T15:44:38Z"
  },
  {
    "title": "University students hold new protests in Iran around memorials for those killed",
    "description": "Anti-government protests have erupted again at some universities in Iran, weeks after a deadly crackdown on previous nationwide demonstrations",
    "link": "https://abcnews.com/International/wireStory/university-students-hold-new-protests-iran-memorials-killed-130387301",
    "timestamp": "2026-02-22T15:42:55Z"
  },
  {
    "title": "EU says US must honor a trade deal after court blocks Trump tariffs",
    "description": "The European Commission says the United States needs to honor its tariff deal with the EU after the Supreme court blocked parts of President Donald Trump’s trade agenda",
    "link": "https://abcnews.com/International/wireStory/eu-us-honor-trade-deal-after-court-blocks-130387300",
    "timestamp": "2026-02-22T15:42:55Z"
  },
  {
    "title": "“Political hack”: Trump calls on Netflix to oust Rice or “pay the consequences”",
    "description": "The request from the president comes as Netflix is attempting to acquire Warner Bros.",
    "link": "https://www.salon.com/2026/02/22/political-hack-trump-calls-on-netflix-to-oust-rice-or-pay-the-consequences/",
    "timestamp": "2026-02-22T15:41:42Z"
  },
  {
    "title": "Trump says Netflix will ‘pay the consequences’ if it doesn’t fire Susan Rice",
    "description": "Donald Trump threatened that there would be \"consequences\" for Netflix if it didn't fire board member Susan Rice. Rice served in both the Obama and Biden administrations, and recently appeared on Preet Bharara's podcast, where she said corporations that \"take…",
    "link": "https://www.theverge.com/policy/882881/trump-netflix-consequences-fire-susan-rice",
    "timestamp": "2026-02-22T15:37:41Z"
  },
  {
    "title": "Mar-a-Lago shooting: All about armed man from North Carolina killed after driving into President Donald Trump's resort",
    "description": "Donald Trump has faced threats to his life before, including two assassination attempts during the 2024 campaign.",
    "link": "https://economictimes.indiatimes.com/news/international/us/mar-a-lago-shooting-all-about-armed-man-from-north-carolina-killed-after-driving-into-president-donald-trumps-resort/articleshow/128681060.cms",
    "timestamp": "2026-02-22T15:33:34Z"
  },
  {
    "title": "Trump Invokes Defense Act For Monsanto Chemicals: Bayer, Agribusiness ETFs In Focus On New Critical Mineral Status For Phosphorus",
    "description": "In a major move to solidify the America First industrial strategy, President Donald Trump signed an executive order on Feb. 18, mobilizing the Defense...",
    "link": "https://finance.yahoo.com/news/trump-invokes-defense-act-monsanto-153112468.html",
    "timestamp": "2026-02-22T15:31:12Z"
  },
  {
    "title": "AOC vs. Marco Rubio: First throwdown of 2028?",
    "description": "In Munich, Ocasio-Cortez trips over unanswerable question, while Rubio lulls Europeans with smooth-criminal talk",
    "link": "https://www.salon.com/2026/02/22/aoc-vs-marco-rubio-first-throwdown-of-2028/",
    "timestamp": "2026-02-22T15:30:31Z"
  },
  {
    "title": "If You Like Manifest, You’ll Love This Epic Sci-Fi Thriller By The Show’s Creator",
    "description": "Created by Jeff Rake, Manifest has gone down in history as one of the most enjoyable sci-fi TV shows of the last decade. Originally launching on NBC in 2018, the series ran for three seasons before it was canceled – only for Netflix to take over after a popul…",
    "link": "http://comicbook.com/tv-shows/feature/if-you-like-manifest-youll-love-this-epic-sci-fi-thriller-by-the-shows-creator/",
    "timestamp": "2026-02-22T15:30:00Z"
  },
  {
    "title": "Newsom: Trump Is 'Flailing,' He's a 'Shadow of Himself'",
    "description": "Sunday on CNN's \"State of the Union,\" Gov. Gavin Newsom (D-CA) said President Donald Trump was a \"shadow of himself.\"\nThe post Newsom: Trump Is ‘Flailing,’ He’s a ‘Shadow of Himself’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/02/22/newsom-trump-is-flailing-hes-a-shadow-of-himself/",
    "timestamp": "2026-02-22T15:29:32Z"
  },
  {
    "title": "'No thanks': Greenland, Denmark reject Trump's hospital ship offer",
    "description": "Denmark and Greenland have rejected Donald Trump's offer to send a US naval hospital ship to the Arctic island. Greenland's Prime Minister stated their public health system is free for citizens, and Denmark's Defence Minister confirmed adequate healthcare is …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/no-thanks-greenland-denmark-reject-trumps-hospital-ship-offer/articleshow/128681104.cms",
    "timestamp": "2026-02-22T15:28:49Z"
  }
]