[
  {
    "title": "US funding freeze is 'bombshell' for world aid sector",
    "description": "US President Donald Trump has ordered the suspension of most foreign aid, leading to immediate halts in NGO operations and potential job losses. This directive affects USAID's $42.8 billion budget, with a review underway. Elon Musk supports the initiative, co…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-funding-freeze-is-bombshell-for-world-aid-sector/articleshow/118150378.cms",
    "timestamp": "2025-02-11T14:07:13Z"
  },
  {
    "title": "Elon Musk Issues Major Social Security Warning",
    "description": "The tech magnate said some $1 billion is lost every week due to fraud.",
    "link": "https://www.newsweek.com/elon-musk-major-social-security-warning-fraud-billion-week-lost-2029244",
    "timestamp": "2025-02-11T14:05:50Z"
  },
  {
    "title": "FG to engage US over visa drop box suspension",
    "description": "The Federal Government of Nigeria has pledged to take diplomatic action and engage with relevant authorities to address the suspension of the drop box service for Nigerians renewing their US visas. The Chairman of the House of Representatives Committee on For…",
    "link": "https://punchng.com/fg-to-engage-us-over-visa-drop-box-suspension/",
    "timestamp": "2025-02-11T14:05:27Z"
  },
  {
    "title": "Some Republicans Worried Trump Is Usurping Congress",
    "description": "\"Congressional Republicans are publicly projecting that they’re in lockstep with the way President Donald Trump and Elon Musk are attempting to slash the federal workforce,\" CNN reports. \"But under the surface, some GOP lawmakers are",
    "link": "https://politicalwire.com/2025/02/11/some-republicans-worried-trump-is-usurping-congress/",
    "timestamp": "2025-02-11T14:05:19Z"
  },
  {
    "title": "Nuclear power to be part of energy discussions, says Hardeep Singh Puri",
    "description": "Indian union oil minister Hardeep Singh Puri highlighted nuclear power’s role in energy discussions, citing potential for small modular reactors following India's nuclear treaty with the US. Upcoming amendments to laws aim for 100GW nuclear energy by 2047. In…",
    "link": "https://economictimes.indiatimes.com/industry/energy/power/nuclear-power-to-be-part-of-energy-discussions-says-hardeep-singh-puri/articleshow/118150334.cms",
    "timestamp": "2025-02-11T14:05:12Z"
  },
  {
    "title": "Plane Owned By Mötley Crüe Frontman Crashes On Runway Killing Pilot",
    "description": "America’s deadliest fortnight in aviation in more than 20 years continued this week as a private jet owned by Mötley Crüe lead singer Vince Neil crashed at an Arizona airport. Three people were injured in the incident and the pilot of the plane was killed in …",
    "link": "https://jalopnik.com/plane-owned-by-motley-crue-frontman-crashes-on-runway-k-1851760168",
    "timestamp": "2025-02-11T14:05:00Z"
  },
  {
    "title": "Why Trump's new tariffs are such a strange idea (Eric Levitz/Vox)",
    "description": "Eric Levitz / Vox:\nWhy Trump's new tariffs are such a strange idea  —  ﻿Trump's aluminium and steel tariffs didn't work the first time.  He wants to try them again. … Donald Trump announced Monday that the US will impose a 25 percent tariff on all imports of …",
    "link": "https://www.memeorandum.com/250211/p26",
    "timestamp": "2025-02-11T14:05:00Z"
  },
  {
    "title": "Trump orders immediate end to Biden's crackdown on household appliances, return to 'common sense standards'",
    "description": "President Donald Trump called on the Environmental Protection Agency to \"immediately\" lift Biden-era regulations on household appliances.",
    "link": "https://www.foxnews.com/politics/trump-orders-immediate-end-bidens-crackdown-household-appliances-return-common-sense-standards",
    "timestamp": "2025-02-11T14:04:29Z"
  },
  {
    "title": "Fed’s Hammack Says Rates on Hold Until Inflation Ebbs Further",
    "description": "Federal Reserve Bank of Cleveland President Beth Hammack said it’s appropriate to keep interest rates steady for “some time” while policymakers await further downward progress on inflation and analyze the economic effects of new government policies.",
    "link": "https://financialpost.com/pmn/business-pmn/feds-hammack-says-rates-on-hold-until-inflation-ebbs-further",
    "timestamp": "2025-02-11T14:04:07Z"
  },
  {
    "title": "X suspends Going Underground account",
    "description": "Elon Musk’s X has suspended the account of Going Underground, an independent UAE-based TV production that airs on RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612524-x-suspends-going-underground/",
    "timestamp": "2025-02-11T14:04:02Z"
  },
  {
    "title": "‘Troubled’: Chelsea Clinton breaks silence on claims she received $84 million from USAID",
    "description": "'You know not a single person believes a word you say, right?'",
    "link": "https://www.wnd.com/2025/02/troubled-chelsea-clinton-breaks-silence-on-claims-she-received-84-million-from-usaid/",
    "timestamp": "2025-02-11T14:03:19Z"
  },
  {
    "title": "Trump 'hatchet man' leveled by ex-prosecutor for 'corrupt' order to aid political ally",
    "description": "A former federal prosecutor blasted president Donald Trump's former criminal defense attorney for acting as a \"hatchet man\" at the Department of Justice.Emil Bove, the acting deputy attorney general, accused the FBI's acting director Brian Driscoll of refusin…",
    "link": "https://www.rawstory.com/emil-bove-justice/",
    "timestamp": "2025-02-11T14:03:06Z"
  },
  {
    "title": "Hamas reacts to Trump’s ‘language of threats,’ says cease-fire is ‘only way’ Israel will get hostages back",
    "description": "A Hamas official said on Tuesday Israeli hostages can be brought home from Gaza only if a fragile ceasefire is respected, dismissing the \"language of threats\" after U.S. President Donald Trump said he would \"let hell break out\" if they were not freed.",
    "link": "https://nypost.com/2025/02/11/world-news/hamas-will-not-ceasefire-is-only-way-israel-is-getting-hostages-back-hamas-says/",
    "timestamp": "2025-02-11T14:03:06Z"
  },
  {
    "title": "Fox News' Bret Baier Lets Donald Trump's Latest 2020 Election Lies Go Unchallenged",
    "description": "In a new excerpt of the interview broadcast on Monday night, Trump falsely claimed the 2020 race was \"rigged\" against him.",
    "link": "https://www.huffpost.com/entry/trump-fox-news-interview-election-lies_n_67ab3659e4b0e141ff83aeb4",
    "timestamp": "2025-02-11T14:02:59Z"
  },
  {
    "title": "Donald Trump’s tariffs target European carmakers amid intensifying US-EU trade war",
    "description": "Any tariffs imposed by Donald Trump would primarily impact German carmakers, with the top three manufacturers accounting for 73% of the 820,000 cars exported from the EU to the US last year, according to JATO Dynamics.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-tariffs-target-european-carmakers-amid-intensifying-us-eu-trade-war/articleshow/118150096.cms",
    "timestamp": "2025-02-11T14:02:45Z"
  },
  {
    "title": "Florida Proposes 'Mandatory Death' for Illegal Immigrants' Capital Crimes",
    "description": "Lawmakers will discuss a package of immigration bills, including the highest penalty for those convicted of offenses such as murder.",
    "link": "https://www.newsweek.com/florida-proposes-mandatory-death-penalty-illegal-immigrants-2029285",
    "timestamp": "2025-02-11T14:02:20Z"
  },
  {
    "title": "Victor Davis Hanson: Sorry Liberals. DOGE is 100% Legal. Here’s Why",
    "description": "Is the Left taking the bait? While many in the legacy media continues to berate Elon Musk for his role in defunding bloated federal programs and agencies, Donald Trump remains largely unscathed. Is this part of a larger strategy by President Trump, asks Victo…",
    "link": "https://freerepublic.com/focus/f-news/4296679/posts",
    "timestamp": "2025-02-11T14:01:05Z"
  },
  {
    "title": "Richard Gere: ‘The millionaire clowns surrounding Trump are immature & narcissistic’",
    "description": "Two weeks ago I complained that the new Paramount+ show The Agency had too many plots going on for me, a woman of moderate intelligence, to get a grip on what was actually happening. Now that the series has concluded… I’d still like to know what went on in th…",
    "link": "https://www.celebitchy.com/908736/richard_gere_the_millionaire_clowns_surrounding_trump_are_immature_narcissistic/",
    "timestamp": "2025-02-11T14:00:51Z"
  },
  {
    "title": "Trump: ‘Let Hell Break Out’ if Hamas Doesn’t Free All Hostages by Saturday",
    "description": "President Trump: “Hamas will find out what I mean.”\nThe post Trump: ‘Let Hell Break Out’ if Hamas Doesn’t Free All Hostages by Saturday first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/trump-let-hell-break-out-if-hamas-doesnt-free-all-hostages-by-saturday/",
    "timestamp": "2025-02-11T14:00:27Z"
  },
  {
    "title": "FBI “Just Discovered” 2,400 Undisclosed Records Tied to JFK Assassination Never Provided to Review Board",
    "description": "The FBI's recent unearthing of 2,400 undisclosed records linked to JFK's assassination raises critical questions about transparency and government accountability. This revelation comes on the heels of President Trump's directive for full disclosure.\nThe post …",
    "link": "https://www.thegatewaypundit.com/2025/02/fbi-just-discovered-2400-undisclosed-records-tied-jfk/",
    "timestamp": "2025-02-11T14:00:25Z"
  },
  {
    "title": "Scientists alarmed as Rubin Observatory changes biography of astronomer Vera Rubin amid Trump's push to end DEI efforts",
    "description": "Astronomers are expressing disappointment and alarm as the federally-funded Rubin Observatory altered the biography of renowned astronomer Vera Rubin, for whom the facility is named, on its website.",
    "link": "https://www.space.com/the-universe/earth/scientists-alarmed-as-rubin-observatory-changes-biography-of-astronomer-vera-rubin-amid-trumps-push-to-end-dei-efforts",
    "timestamp": "2025-02-11T14:00:00Z"
  },
  {
    "title": "Melania Trump didn't sue 'The View' for $900M over host Sunny Hostin's comments",
    "description": "The alleged lawsuit was reportedly based on comments co-host Sunny Hostin made about Trump's marriage to President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/sunny-hoston-melania-trump-lawsuit-view/",
    "timestamp": "2025-02-11T14:00:00Z"
  },
  {
    "title": "Is Trump Ready for Bird Flu?",
    "description": "Most of his health picks are uninterested in using most of the tools that can limit the spread of infectious disease.",
    "link": "https://www.theatlantic.com/health/archive/2025/02/trump-bird-flu/681642/",
    "timestamp": "2025-02-11T14:00:00Z"
  },
  {
    "title": "Toyota India head's tax sop pitch: don't make consumers pay more for cleaner vehicles",
    "description": "Lower taxes will boost demand and generate higher investments to develop manufacturing at scale and lower prices, says Vikram Gulati of Toyota Kirloskar Motor.",
    "link": "https://www.livemint.com/companies/toyota-kirloskar-india-lower-tax-gst-evs-hybrid-vehicles-flex-fuel-hydrogen-fuel-cell-11739272829922.html",
    "timestamp": "2025-02-11T13:58:13Z"
  },
  {
    "title": "Democrats Suddenly Embrace 'Extraordinary' Tactics Favored by GOP",
    "description": "Democrats are threatening to use tactics that the party had previously criticized the GOP for employing in order to oppose President Donald Trump's agenda.\nDemocratic senators have suggested they were willing to allow the government to shut down to protest Tr…",
    "link": "https://biztoc.com/x/310af39e6ca0a4f8",
    "timestamp": "2025-02-11T13:57:16Z"
  },
  {
    "title": "Democrats, Angry About DOGE's Spending Audits, Ready to Shut Down Government Spending",
    "description": "Democrats are prepared to shut down the federal government during next month's spending fight after becoming enraged over the Department of Government Efficiency's (DOGE) financial audit of government spending.\nThe post Democrats, Angry About DOGE’s Spending …",
    "link": "https://www.breitbart.com/politics/2025/02/11/democrats-angry-about-doges-spending-audits-ready-to-shut-down-government-spending/",
    "timestamp": "2025-02-11T13:57:07Z"
  },
  {
    "title": "Trudeau says Canada will ‘resist’ US tariffs on steel, as EU hits back",
    "description": "The News\nCanadian Prime Minister Justin Trudeau said Tuesday his country will “resist strongly and firmly if necessary” to US tariffs on steel announced by US President Donald Trump.\nSpeaking at an AI summit in Paris, the Canadian leader also added that the U…",
    "link": "https://biztoc.com/x/5f37d16783b187df",
    "timestamp": "2025-02-11T13:57:02Z"
  },
  {
    "title": "The Influence(r) War",
    "description": "On Trump's foreign policy, a Franco-Algerian crisis, and the mediasphere.",
    "link": "https://www.cjr.org/the_media_today/france_algeria_western_sahara_influencers_press_freedom_trump.php",
    "timestamp": "2025-02-11T13:56:20Z"
  },
  {
    "title": "On House floor, Mace accuses 4 of sexual abuse, including ex-fiancé. He denies it.",
    "description": "South Carolina Rep. Nancy Mace is raising allegations against a former fiancé and his business associates.",
    "link": "https://www.cbsnews.com/news/nancy-mace-accuses-ex-fiance-associates-of-assault-rape-others/",
    "timestamp": "2025-02-11T13:56:14Z"
  },
  {
    "title": "President Trump, President Musk, and the Wedge Issue of Mass Layoffs",
    "description": "As the Trump-Musk administration takes an axe to the federal government’s budget and personnel, the Democrats have an opening to raise an issue that Musk will hate but Trump can’t ignore—private sector mass layoffs.Right now, as Acting President Musk goes aft…",
    "link": "https://www.commondreams.org/opinion/john-deere-mass-layoffs-musk-trump",
    "timestamp": "2025-02-11T13:55:55Z"
  },
  {
    "title": "An Open Letter To The 17 Sane Congressional Republicans",
    "description": "Democrats, you can listen too.",
    "link": "https://www.wonkette.com/p/an-open-letter-to-the-17-sane-congressional",
    "timestamp": "2025-02-11T13:55:40Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Flat-Out Warns Trump Already Has US ‘Dangerously Close’ To Constitutional Crisis In Just Three Weeks",
    "description": "Kaitlan Collins gave a stark warning that Trump is just \"3 weeks into\" his second term — and already \"the U.S. is dangerously close to a constitutional crisis.\"\nThe post CNN’s Kaitlan Collins Flat-Out Warns Trump Already Has US ‘Dangerously Close’ To Constitu…",
    "link": "https://www.mediaite.com/news/cnns-kaitlan-collins-flat-out-warns-trump-already-has-us-dangerously-close-to-constitutional-crisis-in-just-three-weeks/",
    "timestamp": "2025-02-11T13:55:19Z"
  },
  {
    "title": "How will Trump's 'hell to pay' doctrine come to pass?",
    "description": "Will Israel be expected to be the one bringing the “hell” to Hamas, and if so, how will that happen? US officials seem to speak more about Hamas being removed than Israelis do.",
    "link": "https://www.jpost.com/middle-east/article-841680",
    "timestamp": "2025-02-11T13:54:06Z"
  },
  {
    "title": "The Unbalanced Chemistry of the Trump/Musk MAGA Era . Destroying the Values of American Democracy",
    "description": "The new Trump/Musk regime, which has chosen the MAGA (Make America Great Again) doctrine for itself, is focused on radically changing the American regime, which was founded after 1945, changed in the 1970s and entered the Neocon-Zionist structure after 2001. …",
    "link": "https://www.globalresearch.ca/unbalanced-chemistry-trump-musk-maga-era/5879656",
    "timestamp": "2025-02-11T13:54:02Z"
  },
  {
    "title": "1,000-pt Sensex crash: Has Trump spurred the 'quit India' movement?",
    "description": "President Trump's tariffs on steel, aluminum, and potential reciprocal tariffs are impacting global markets, particularly India. FIIs are exiting due to reasons like a strong dollar and high US bond yields. PM Modi's upcoming US visit may address trade issues…",
    "link": "https://economictimes.indiatimes.com/news/economy/finance/1000-pt-sensex-crash-has-trump-spurred-the-quit-india-movement/articleshow/118150073.cms",
    "timestamp": "2025-02-11T13:53:43Z"
  },
  {
    "title": "Trump signs order to buy plastic straws, eliminate paper straws",
    "description": "U.S. President Donald Trump has signed an executive order aimed at encouraging the U.S. government and consumers to buy plastic drinking straws, pushing back efforts by his predecessor to phase out single-use plastics and tackle waste.",
    "link": "https://www.cbc.ca/news/science/trump-plastic-straws-1.7455862",
    "timestamp": "2025-02-11T13:53:08Z"
  },
  {
    "title": "DAVID MARCUS: Elon Musk heads to the backwoods of West Virginia in search of the national debt",
    "description": "Columnist David Marcus travels to Parkersburg, W.V., where the federal government's Central Accounting Reporting System is located. Elon Musk and his DOGE team are headed there, too.",
    "link": "https://www.foxnews.com/opinion/david-marcus-elon-musk-heads-backwoods-west-virginia-search-national-debt",
    "timestamp": "2025-02-11T13:52:12Z"
  },
  {
    "title": "WFP says worker died in detention in Houthi-controlled Yemen",
    "description": "The Yemeni man was one of seven UN staff held by Houthi authorities since late January.",
    "link": "https://www.bbc.com/news/articles/cy7g474px2do",
    "timestamp": "2025-02-11T13:49:53Z"
  },
  {
    "title": "Senior Donald Trump administration officials express frustration at courts, sparking fears that they may ignore judicial decisions in implementing the President's plans",
    "description": "The senior officials from the US President Donald Trump administration are reportedly and recently expressing severe frustrations in court while a severe fear of constitutional crisis now looms over US.",
    "link": "https://economictimes.indiatimes.com/news/international/us/senior-donald-trump-administration-officials-express-frustration-at-courts-sparking-fears-that-they-may-ignore-judicial-decisions-in-implementing-the-presidents-plans/articleshow/118150056.cms",
    "timestamp": "2025-02-11T13:49:37Z"
  },
  {
    "title": "Dem Donor Alleges That Joe Biden Was Doped Up Before Campaign Events",
    "description": "Former Democratic donor-tuned-MAGA supporter Lindy Li dropped more details about Joe Biden and her former party’s shenanigans during the 2024 election. Li has been eager to spill all the things about the delusions that engulfed the Democrats, to the point whe…",
    "link": "https://freerepublic.com/focus/f-news/4296675/posts",
    "timestamp": "2025-02-11T13:48:31Z"
  },
  {
    "title": "Fort Bragg Restored",
    "description": "History matters, because it forms our national identity. That’s why liberals have been erasing it. But with pro-Americans in charge, history is being restored. Mount McKinley is Mount McKinley again, named after US President William McKinley, thanks to an exe…",
    "link": "https://moonbattery.com/fort-bragg-restored/",
    "timestamp": "2025-02-11T13:48:26Z"
  },
  {
    "title": "Democrats Suddenly Embrace 'Extraordinary' Tactics Favored by GOP",
    "description": "Democrats in Congress are threatening a shutdown to oppose the Trump administration's efforts to overhaul the federal government.",
    "link": "https://www.newsweek.com/democrats-government-shutdown-protest-trump-senate-2029225",
    "timestamp": "2025-02-11T13:47:36Z"
  },
  {
    "title": "The impact of Trump's tariffs is already being felt",
    "description": "There are already winners and losers from Trump's tariff announcements, from investors betting on gold to fashion brands pausing marketing campaigns.",
    "link": "https://www.businessinsider.com/economic-impact-trump-trade-war-tariffs-influencers-gold-metals-2025-2",
    "timestamp": "2025-02-11T13:47:17Z"
  },
  {
    "title": "Amid global trump tariff turmoil, India’s steel imports surge even as exports drop sharply",
    "description": "India continued to be a net importer of steel for April-Jan period of the fiscal (10M FY25) with imports exceeding exports by 4.4 million tonnes (mt). In fact, the trade deficit is higher than India’s steel exports, as per a report of Ministry.",
    "link": "https://www.thehindubusinessline.com/economy/amid-global-trump-tariff-turmoil-indias-steel-imports-surge-even-as-exports-drop-sharply/article69206954.ece",
    "timestamp": "2025-02-11T13:47:17Z"
  },
  {
    "title": "Amid global tariff turmoil, India’s steel imports surge even as exports drop sharply",
    "description": "India continued to be a net importer of steel for April-Jan period of the fiscal (10M FY25) with imports exceeding exports by 4.4 million tonnes (mt). In fact, the trade deficit is higher than India’s steel exports, as per a report of Ministry.",
    "link": "https://www.thehindubusinessline.com/economy/amid-global-tariff-turmoil-indias-steel-imports-surge-even-as-exports-drop-sharply/article69206954.ece",
    "timestamp": "2025-02-11T13:47:17Z"
  },
  {
    "title": "The closer one looks at Trump’s Blagojevich pardon, the worse it appears",
    "description": "As Donald Trump’s Rod Blagojevich pardon helps prove, the Republican president appears to have a soft spot for politicians convicted of corruption.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/closer-one-looks-trumps-blagojevich-pardon-worse-appears-rcna191638",
    "timestamp": "2025-02-11T13:47:14Z"
  },
  {
    "title": "How the Curtailing of US Aid Impacts Mongolia’s Development",
    "description": "Since Mongolia’s democratization in the 1990s, USAID has been a major supporter of the country's development. With USAID's future in doubt, Ulaanbaatar is watching closely.",
    "link": "https://thediplomat.com/2025/02/how-the-curtailing-of-us-aid-impacts-mongolias-development/",
    "timestamp": "2025-02-11T13:47:00Z"
  },
  {
    "title": "Israel and Hamas Prepare for Return to War",
    "description": "The ceasefire in Gaza, which has allowed humanitarian aid to flow and hostages to be exchanged, is now at risk of total breakdown.",
    "link": "https://www.newsweek.com/israel-hamas-war-gaza-donald-trump-palestinians-hostages-2029268",
    "timestamp": "2025-02-11T13:46:28Z"
  },
  {
    "title": "Why are migrants dying trying to cross into the US? These are the 3 main risks they face",
    "description": "Drowning, blunt force trauma and exposure to extreme weather are among the risks that migrants face making the dangerous journey across the US-Mexico border.",
    "link": "https://theconversation.com/why-are-migrants-dying-trying-to-cross-into-the-us-these-are-the-3-main-risks-they-face-246108",
    "timestamp": "2025-02-11T13:46:04Z"
  },
  {
    "title": "New steel and aluminum tariff rates take effect Mar 12, executive orders show",
    "description": "The new 25 per cent tariff rates on steel and aluminum imports into the United States are due to take effect on March 12, according to the executive orders signed by President Donald Trump on Monday. A U.S. official earlier had said the new rates would take e…",
    "link": "https://www.channelnewsasia.com/business/new-steel-and-aluminum-tariff-rates-take-effect-mar-12-executive-orders-show-4931081",
    "timestamp": "2025-02-11T13:46:00Z"
  },
  {
    "title": "Trump Says Talk Of Wanting Canada to Be A Part of US Is Serious",
    "description": "Trump Says Talk Of Wanting Canada to Be A Part of US Is Serious\n \nAuthored by Zachary Stieber via The Epoch Times (emphasis ours),\nPresident Donald Trump said in a new interview that he’s serious when he talks of wanting Canada to be a part of the United Stat…",
    "link": "https://biztoc.com/x/9d82bd604750749f",
    "timestamp": "2025-02-11T13:45:44Z"
  },
  {
    "title": "Whether Christians should prioritize care for migrants as much as for fellow citizens has been debated for centuries",
    "description": "A scholar of religion and migration writes about the long-standing tensions among Christians regarding their moral obligations to those more or less closely connected to them.",
    "link": "https://theconversation.com/whether-christians-should-prioritize-care-for-migrants-as-much-as-for-fellow-citizens-has-been-debated-for-centuries-248640",
    "timestamp": "2025-02-11T13:45:37Z"
  },
  {
    "title": "Trump Makes Shocking Statement Ahead of Vance-Zelenskiy Meeting",
    "description": "Donald Trump has struck a new, incredibly dismissive tone on Ukraine and its war against Russia—right before Vice President JD Vance’s meeting with Ukrainian President Volodymyr Zelenskiy. \r\n“They may make a deal, they may not make a deal, they may be Russian…",
    "link": "https://newrepublic.com/post/191381/trump-ukraine-russia-vance-zelenskiy-meeting",
    "timestamp": "2025-02-11T13:45:30Z"
  },
  {
    "title": "Palestinian Writer Mohammed El-Kurd on \"Perfect Victims,\" Trump & Israel's Criminalization of Thought",
    "description": "We speak with the acclaimed Palestinian writer Mohammed El-Kurd on the publication day for his new book, Perfect Victims. It comes at a time of heightened censorship and attacks on Palestinian expression in Israel and the Occupied Palestinian Territories, as …",
    "link": "https://www.democracynow.org/2025/2/11/mohammed_el_kurd_palestine_perfect_victims",
    "timestamp": "2025-02-11T13:44:14Z"
  },
  {
    "title": "Trump’s Plan Comes Into Focus: Make America Corrupt Again",
    "description": "The deal to spring Eric Adams caps a broad effort to functionally legalize bribery and covert foreign influence. We’re all going to pay for it",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-eric-adams-make-america-corrupt-again-1235263142/",
    "timestamp": "2025-02-11T13:44:06Z"
  },
  {
    "title": "'I don't think he's a happy person:' Sam Altman hits back at Elon Musk over OpenAI bid",
    "description": "Sam Altman hit back at Elon Musk's bid for OpenAI, saying he's acting from \"a position of insecurity\" and should focus on \"building better products.\"",
    "link": "https://www.businessinsider.com/sam-altman-elon-musk-openai-bid-insecure-rivalry-2025-2",
    "timestamp": "2025-02-11T13:43:53Z"
  },
  {
    "title": "DOGE Announces it's Slashing $881M from Education Department Contracts: Live Updates",
    "description": "Elon Musk's DOGE has announced it is terminating $881 million worth of Education Department contracts. Stay with Newsweek's live blog for updates.",
    "link": "https://www.newsweek.com/doge-announces-its-slashing-881m-education-department-contracts-live-updates-2029353",
    "timestamp": "2025-02-11T13:43:39Z"
  },
  {
    "title": "Elizabeth Warren has a warning about America's banking system under Trump",
    "description": "Senator Elizabeth Warren is sounding the alarm on cuts to Federal Deposit Insurance Corporation (FDIC), writing in a letter that the hiring freeze and decision to rescind 200 job offers to examiners has the potential to disrupt the “stability of the banking s…",
    "link": "https://qz.com/elizabeth-warren-warning-banking-system-trump-fdic-cfpb-1851760186",
    "timestamp": "2025-02-11T13:43:00Z"
  },
  {
    "title": "Jordan King Set For Tense Trump Talks Over Gaza",
    "description": "Jordan's King Abdullah II faces a tense meeting with Donald Trump at the White House Tuesday as he leads opposition from Arab nations to the US president's controversial Gaza takeover plan.",
    "link": "https://www.ibtimes.com/jordan-king-set-tense-trump-talks-over-gaza-3763244",
    "timestamp": "2025-02-11T13:42:21Z"
  },
  {
    "title": "'Scientific Socialism' Has Come to Pacific Palisades",
    "description": "You can’t rebuild the same. We have to rebuild with science. We have to build with climate reality in mind,\" California Gov. Gavin Newsom told CNN last week in an interview about rebuilding the burned-out Pacific Palisades. ... Whatever happened to Newsom's p…",
    "link": "https://freerepublic.com/focus/f-news/4296673/posts",
    "timestamp": "2025-02-11T13:42:16Z"
  },
  {
    "title": "‘Ridiculous and lame’: South Africans mock Trump proposals",
    "description": "On the streets of Johannesburg’s student district, US President Donald Trump’s offer to accept white Afrikaners as refugees landed as both “ridiculous” and “lame”, among South Africans of all races. On Friday, Trump cut off aid to South Africa and claimed, wi…",
    "link": "https://www.digitaljournal.com/world/ridiculous-and-lame-south-africans-mock-trump-proposals/article",
    "timestamp": "2025-02-11T13:38:19Z"
  },
  {
    "title": "Jordan king set for tense Trump talks over Gaza",
    "description": "Jordan’s King Abdullah II faces a tense meeting with Donald Trump at the White House Tuesday as he leads opposition from Arab nations to the US president’s controversial Gaza takeover plan. The talks come a day after Trump said he could “conceivably” halt bil…",
    "link": "https://www.digitaljournal.com/world/jordan-king-set-for-tense-trump-talks-over-gaza/article",
    "timestamp": "2025-02-11T13:38:19Z"
  },
  {
    "title": "JD Vance’s Wife Usha Wears Favorite Daughter Dress With Pleated Details in Paris to Visit President Emmanuel Macron and First Lady Brigitte",
    "description": "JD Vance's wife Usha joined her Vice President husband at the Action on Artificial Intelligence (AI) Summits in a Favorite Daughter dress.",
    "link": "http://wwd.com/pop-culture/celebrity-news/usha-vance-favorite-daughter-dress-paris-brigitte-macron-1236923147/",
    "timestamp": "2025-02-11T13:37:50Z"
  },
  {
    "title": "Ukraine Is Connected to Mexican Drug Cartels? Tucker Carlson",
    "description": "Have you ever wondered where your hard-earned money winds up after D.C. politicians send it to Ukraine? If you think it’s all spent on stopping Vladimir Putin, we have bad news. Your tax dollars are used to fund Ukrainian bureaucrats’ pensions, stuff defense …",
    "link": "https://www.globalresearch.ca/ukraine-connected-mexican-drug-cartels/5879649",
    "timestamp": "2025-02-11T13:37:42Z"
  },
  {
    "title": "The Gaza Ceasefire Is Being Sabotaged by Israel, by Trump, and by the Media",
    "description": "The Gaza ceasefire (if you can even call it that) is already in grave peril.\nHamas has announced that it will be postponing the release of any more Israeli hostages in response to repeated ceasefire violations from Israel and consistent …\nThe post The Gaza Ce…",
    "link": "https://www.globalresearch.ca/gaza-ceasefire-sabotaged-israel-trump-media/5879659",
    "timestamp": "2025-02-11T13:37:03Z"
  },
  {
    "title": "OpenAI’s Sam Altman Throws Shade On Elon Musk Over $97 Billion Bid: ‘I Don’t Think He’s a Happy Person’",
    "description": "OpenAI CEO and founder Sam Altman threw shade Elon Musk's way after the latter offered to take control of OpenAI, a move Altman theorized is to \"slow us down.\"\nThe post OpenAI’s Sam Altman Throws Shade On Elon Musk Over $97 Billion Bid: ‘I Don’t Think He’s a …",
    "link": "https://www.mediaite.com/news/openais-sam-altman-throws-shade-on-elon-musk-over-97-billion-bid-i-dont-think-hes-a-happy-person/",
    "timestamp": "2025-02-11T13:36:42Z"
  },
  {
    "title": "Trump’s Vision for Palestine: No Palestinians – Towards Greater Israel in Warp Speed",
    "description": "Can you imagine the Peace President Trump, within less than a month in office, has shed his sheep clothing and converted it into his true sartorial, or face – no, not a wolf, that would be an insult for the …\nThe post Trump’s Vision for Palestine: No Palestin…",
    "link": "https://www.globalresearch.ca/trumps-vision-for-palestine-no-palestinians-towards-greater-israel-in-warp-speed/5879636",
    "timestamp": "2025-02-11T13:36:04Z"
  },
  {
    "title": "Steve Hagerty, Head of Firm Karen Bass Chose to Rebuild L.A., Was Disaster as One-Term Mayor of Evanston, Illinois",
    "description": "Steve Hagerty, the founder of Hagerty Consulting, which Los Angeles Mayor Karen Bass chose behind closed doors to lead the city's rebuilding effort, had a disastrous tenure as mayor of the liberal college town of Evanston, Illinois.\nThe post Steve Hagerty, He…",
    "link": "https://www.breitbart.com/politics/2025/02/11/steve-hagerty-head-of-firm-karen-bass-chose-to-rebuild-l-a-was-disaster-as-evanston-illinois-mayor-one-term/",
    "timestamp": "2025-02-11T13:36:01Z"
  },
  {
    "title": "Donald Trump Declines to Endorse JD Vance as 2028 Republican 'Successor' - NewsBreak",
    "description": "In a preview segment of his Super Bowl interview that is set to air tonight, Trump declined to endorse Vance in 2028.",
    "link": "https://www.newsbreak.com/share/3800738732362-donald-trump-declines-to-endorse-jd-vance-as-2028-republican-successor?_f=app_share&amp;pd=01kdNYD5&amp;lang=en_US&amp;send_time=1739280842&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v3%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v5&amp;s=i2",
    "timestamp": "2025-02-11T13:34:47Z"
  },
  {
    "title": "Israel says elderly hostage dead in Gaza",
    "description": "Israeli military announced the death of Shlomo Mansour, an 85-year-old hostage killed by Hamas militants during their October 2023 attack. Despite intelligence confirming his death, his body remains in Gaza. Israel vows to persist in efforts to retrieve all h…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-says-elderly-hostage-dead-in-gaza/articleshow/118149770.cms",
    "timestamp": "2025-02-11T13:33:18Z"
  },
  {
    "title": "Trump Warns Of 'All Hell' If Gaza Captives Not Freed By Saturday",
    "description": "US President Donald Trump set a Saturday deadline for all hostages to be released from Gaza, saying that otherwise \"all hell\" would break out and he would call for the Israel-Hamas ceasefire to be canceled.",
    "link": "https://www.ibtimes.com.au/trump-warns-all-hell-if-gaza-captives-not-freed-saturday-1856091",
    "timestamp": "2025-02-11T13:33:11Z"
  },
  {
    "title": "Google Changes Name Of Gulf Of Mexico To 'Gulf Of America' For US Users",
    "description": "Google on Monday changed the name of the Gulf of Mexico to \"Gulf of America\" for those using its Maps platform inside the United States, complying with an executive order by President Donald Trump.",
    "link": "https://www.ibtimes.com.au/google-changes-name-gulf-mexico-gulf-america-us-users-1856089",
    "timestamp": "2025-02-11T13:33:09Z"
  },
  {
    "title": "Trump's medical research cuts could strip $100M from single red state",
    "description": "Missouri universities and research organizations will need to cut about $100 million from administrative costs for research funded last year by the National Institutes of Health or replace the money from other sources if President Donald Trump’s attempt to re…",
    "link": "https://www.rawstory.com/trump-s-medical-research-cuts-could-mean-100-million-loss-in-missouri/",
    "timestamp": "2025-02-11T13:32:51Z"
  },
  {
    "title": "Global Stocks Mixed As Tariff Uncertainty Looms",
    "description": "European and Asian markets struggled for direction and gold hit a fresh high Tuesday as traders kept a nervous eye on Donald Trump's next tariff moves.",
    "link": "https://www.ibtimes.com.au/global-stocks-mixed-tariff-uncertainty-looms-1856087",
    "timestamp": "2025-02-11T13:32:17Z"
  },
  {
    "title": "Canada Plans To Respond To Trump's 25% Steel Tariffs: 'Entirely Unjustified'",
    "description": "Prime Minister Justin Trudeau says Canada will have a \"firm and clear\" response to the tariffs due to go into effect next month.",
    "link": "https://www.ibtimes.com/canada-response-trump-steel-tariffs-3763241",
    "timestamp": "2025-02-11T13:31:35Z"
  },
  {
    "title": "New Zealand Rethinks Opposition To Deep-sea Mining",
    "description": "New Zealand is considering withdrawing its support for an international ban on deep-sea mining, the country's resources minister told AFP on Tuesday.",
    "link": "https://www.ibtimes.com.au/new-zealand-rethinks-opposition-deep-sea-mining-1856082",
    "timestamp": "2025-02-11T13:31:18Z"
  },
  {
    "title": "EU Leaders Vow 'Firm' Response To US Tariffs",
    "description": "EU chief Ursula von der Leyen vowed on Tuesday to retaliate firmly against US President Donald Trump's decision to impose tariffs on steel and aluminium imports.",
    "link": "https://www.ibtimes.com.au/eu-leaders-vow-firm-response-us-tariffs-1856079",
    "timestamp": "2025-02-11T13:31:16Z"
  },
  {
    "title": "Center for Constitutional Rights Challenges Trump Migrant Flights to Guantánamo, ICC Sanctions & More",
    "description": "We look at a victory for immigrant rights, after a federal judge temporarily blocked the U.S. government from deporting three Venezuelan men to Guantánamo Bay, Cuba, where the Trump administration has started to send thousands of immigrants for detention. Our…",
    "link": "https://www.democracynow.org/2025/2/11/vince_warren_guantanamo_trump_immigration_courts",
    "timestamp": "2025-02-11T13:31:14Z"
  },
  {
    "title": "Fort Liberty renamed to Fort Bragg, but without Confederate ties",
    "description": "President Donald Trump's new Secretary of Defense, Pete Hegseth, signed an order on Monday, changing the name of America's largest military base from Fort Liberty to Fort Bragg. The name change is one of several reversals of policy from the Biden administrati…",
    "link": "https://freerepublic.com/focus/f-news/4296669/posts",
    "timestamp": "2025-02-11T13:30:09Z"
  },
  {
    "title": "Democrat senator accuses Trump and Musk of ‘billionaire takeover’",
    "description": "US President Donald Trump’s push for total control amounts to an “assault on the Constitution,” Senator Chris Murphy has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612512-democrat-trump-musk-seize-power/",
    "timestamp": "2025-02-11T13:29:04Z"
  },
  {
    "title": "Harvard climate historian talks activism in the Trump era, and the sexism of 'drill, baby drill'",
    "description": "Harvard climate hostorian Naomi Oreskes spoke at Haaretz's Israel Climate Change Conference on Tuesday, discussing the importance of fearless activism as the new Trump administration commits to anti-environmental measures. 'we can't let the pressure from deni…",
    "link": "https://www.haaretz.com/israel-news/2025-02-11/ty-article/.premium/harvard-climate-historian-talks-activism-under-trump-and-the-sexism-of-drill-baby-drill/00000194-f482-d542-ad9e-f4d6d79f0000",
    "timestamp": "2025-02-11T13:28:24Z"
  },
  {
    "title": "Democrat lawmaker freezes on House floor after suffering adverse reaction to medication",
    "description": "Rep. John Larson, D-Ct., froze and began slurring his speech while delivering remarks. In response to the incident, his office says that the congressman is \"in good spirits.\"",
    "link": "https://www.foxnews.com/politics/democrat-lawmaker-freezes-house-floor-after-suffering-adverse-reaction-medication",
    "timestamp": "2025-02-11T13:28:13Z"
  },
  {
    "title": "Will the IMF survive Donald Trump’s presidency?",
    "description": "Robert H. Wade examines what American disengagement and growing resentment among emerging market and developing countries mean for the future of the IMF. It is now widely recognised that the world has moved into a more chaotic state than a decade and more ago…",
    "link": "https://blogs.lse.ac.uk/europpblog/2025/02/11/will-the-imf-survive-donald-trumps-presidency/",
    "timestamp": "2025-02-11T13:26:29Z"
  },
  {
    "title": "A Super Bowl performer pulled out a Palestinian-Sudanese flag. What were they protesting?",
    "description": "A performer with Kendrick Lamar's Super Bowl halftime show was banned from NFL events for holding up a Palestinian-Sudanese flag on the field.",
    "link": "https://www.usatoday.com/story/news/world/2025/02/11/super-bowl-halftime-protestor-palestinian-sudanese-flag-kendrick-lamar/78386379007/",
    "timestamp": "2025-02-11T13:26:03Z"
  },
  {
    "title": "Canada, EU vow firm response to Trump's steel tariffs",
    "description": "Canada and the EU have pledged to resist US President Trump's implementation of 25 percent tariffs on steel and aluminum imports, marking a step toward a potential trade war. Both regions vowed to protect their economic interests and workers, with Canada cond…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/canada-eu-vow-firm-response-to-trumps-steel-tariffs/articleshow/118149511.cms",
    "timestamp": "2025-02-11T13:25:15Z"
  },
  {
    "title": "Trump floats Ukraine ‘may be Russian someday’ ahead of Zelensky-Vance meeting, wants US$500b worth in rare earth minerals",
    "description": "KYIV, Feb 11 — US President Donald Trump floated the idea that Ukraine \"may be Russian someday”, as his Vice President JD Vance gears up to meet Ukrainian President Volodymyr Zelensky later this week. Pushing for an end to the nearly three-year war with Russi…",
    "link": "https://freerepublic.com/focus/f-news/4296665/posts",
    "timestamp": "2025-02-11T13:23:56Z"
  },
  {
    "title": "Google Calendar Cuts Pride Month, Black History Month And More Observances—Here Are All The Companies Rolling Back DEI",
    "description": "Following Trump's lead, organizations including Walmart, Lowe’s and Meta have announced they would scale back their commitments to diversity, equity and inclusion programs.",
    "link": "https://www.forbes.com/sites/conormurray/2025/02/11/google-calendar-cuts-pride-month-black-history-month-and-more-observances-here-are-all-the-companies-rolling-back-dei/",
    "timestamp": "2025-02-11T13:23:40Z"
  },
  {
    "title": "Google confirms Gulf of Mexico renamed to appease Trump – but only in the US",
    "description": "So now everyone's happy\nGoogle has changed the name of the Gulf of Mexico on Google Maps to comply with a Donald Trump whim – but only for American users.…",
    "link": "https://biztoc.com/x/117f676832eb9f54",
    "timestamp": "2025-02-11T13:23:23Z"
  },
  {
    "title": "Kremlin Responds As Trump-Linked Private Jet Lands in Moscow: Reports",
    "description": "RIA Novosti said a jet allegedly linked to Donald Trump's U.S. Middle East envoy, Steve Witkoff, landed in Moscow on Tuesday.",
    "link": "https://biztoc.com/x/7d2f6f72ddb84768",
    "timestamp": "2025-02-11T13:23:18Z"
  },
  {
    "title": "Ukraine 'may be Russian someday,' Trump says, as the U.S. ups the pressure on Kyiv and allies",
    "description": "U.S. President Donald Trump suggested that Ukraine could lose its sovereignty to Russia, and said he wanted compensation for the aid that Washington had provided to Ukraine.\n\"[Ukraine] may make a deal. They may not make a deal. They may be Russian someday, or…",
    "link": "https://biztoc.com/x/131b578dac45172a",
    "timestamp": "2025-02-11T13:23:15Z"
  },
  {
    "title": "Kremlin Responds As Trump-Linked Private Jet Lands in Moscow: Reports",
    "description": "RIA Novosti said a jet allegedly linked to Donald Trump's U.S. Middle East envoy, Steve Witkoff, landed in Moscow on Tuesday.",
    "link": "https://www.newsweek.com/kremlin-responds-trump-witkoff-jet-moscow-2029341",
    "timestamp": "2025-02-11T13:22:27Z"
  },
  {
    "title": "Elon Musk wants to buy OpenAI for $97.4 billion",
    "description": "Elon Musk wants to expand his tech empire. The CEO of Tesla, SpaceX, X, adviser to President Donald Trump and the world&apos;s richest man is now targeting Artificial Intelligence.",
    "link": "https://www.marca.com/en/technology/2025/02/11/67ab4d60ca47413a108b456d.html",
    "timestamp": "2025-02-11T13:22:24Z"
  },
  {
    "title": "Honeymoon over? Russia says relations with Donald Trump administration are on the brink of collapse; here's what could happen next",
    "description": "Russia-U.S. relations are at a breaking point, with Moscow warning of a possible diplomatic collapse. Russian Deputy Foreign Minister Sergei Ryabkov stated that ties with Washington are \"balancing on the brink of a breakup,\" citing the Ukraine war as a key is…",
    "link": "https://economictimes.indiatimes.com/news/international/us/honeymoon-over-russia-says-relations-with-donald-trump-administration-are-on-the-brink-of-collapse-heres-what-could-happen-next/articleshow/118149356.cms",
    "timestamp": "2025-02-11T13:21:54Z"
  },
  {
    "title": "Outside the Box: Engaging AI To Find Out How It Thinks It Thinks (Part 2)",
    "description": "After interrogating both ChatGPT and DeepSeek on the question of how to interpret US President Donald Trump’s clearly outrageous plan for solving the Gaza situation, in Part 1, I decided to test them on their ability to use the methods they suggest to move cl…",
    "link": "https://www.fairobserver.com/more/science/outside-the-box-engaging-ai-to-find-out-how-it-thinks-it-thinks-part-2/",
    "timestamp": "2025-02-11T13:21:49Z"
  },
  {
    "title": "Pope rebukes Trump administration over migrant deportations, and appears to take direct aim at Vance",
    "description": "Pope Francis has issued a major rebuke to the Trump administration’s mass deportation of migrants. He warned that the program to forcefully deport people purely because of their illegal status deprives them of their inherent dignity and “will end badly.”…",
    "link": "https://apnews.com/article/pope-trump-migration-09a89091f8e7dc3270099f0947d04e90",
    "timestamp": "2025-02-11T13:21:45Z"
  },
  {
    "title": "Ukraine 'may be Russian someday,' Trump says, as the U.S. ups the pressure on Kyiv and allies",
    "description": "Washington's envoys will push partners to take on more responsibility for Kyiv, when U.S. and European officials meet for Ukraine talks this week.",
    "link": "https://www.cnbc.com/2025/02/11/ukraine-may-be-russian-someday-trump-says-as-the-us-ups-pressure.html",
    "timestamp": "2025-02-11T13:20:19Z"
  },
  {
    "title": "‘Holy Smokes’: CNN Data Reporter Shocked By Trump’s Approval Rating",
    "description": "“We’re living in a different world,” said Harry Enten on “News Central.”",
    "link": "https://www.huffpost.com/entry/harry-enten-trump-approval-rating_n_67ab2036e4b025b52f75eadf",
    "timestamp": "2025-02-11T13:19:46Z"
  },
  {
    "title": "Gold prices hit record peak but expert predicts gold rates may drop after THIS mark",
    "description": "Gold rates have hit the peak of over $2,900 per ounce, but there are chances that the prices may reverse.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-prices-hit-record-peak-but-expert-predicts-gold-rates-may-drop-after-this-mark/articleshow/118149343.cms",
    "timestamp": "2025-02-11T13:18:43Z"
  },
  {
    "title": "John Oliver Crashes The Daily Show to Mock America’s ‘Monarchy Era’ Under Trump: ‘Kings Get Sh*t Done!’",
    "description": "British comedian and Last Week Tonight host John Oliver crashed The Daily Show Monday to roast host Jon Stewart on the US political descent into “monarchy”—mockingly urging the host to “embrace” President Donald Trump’s royal-style rule. During Stewart’s mono…",
    "link": "https://www.mediaite.com/tv/john-oliver-crashes-the-daily-show-to-mock-americas-monarchy-era-under-trump-kings-get-sht-done/",
    "timestamp": "2025-02-11T13:18:23Z"
  }
]