[
  {
    "title": "Socialist critic of NATO and EU poised to win Ireland’s presidency",
    "description": "Independent socialist Catherine Connolly’s  coolness to Brussels and hostility to Donald Trump put her at odds with the Irish government.",
    "link": "https://www.politico.eu/article/catherine-connolly-socialist-critic-nato-eu-poised-win-ireland-presidency/",
    "timestamp": "2025-10-23T15:50:00Z"
  },
  {
    "title": "Why Trump just freed Changpeng Zhao from prison",
    "description": "President Donald Trump has delivered a powerful statement about his administration’s approach to cryptocurrency regulation by granting a presidential pardon to one of the digital currency world’s most controversial figures. The decision to pardon Changpeng Zh…",
    "link": "https://rollingout.com/2025/10/23/why-trump-just-freed-changpeng-zhao-from/",
    "timestamp": "2025-10-23T15:49:48Z"
  },
  {
    "title": "Cuomo Attacked for New Mamdani Ad With ‘Racist’ Imagery of Pimp, Drunk and Wife Beater | Video",
    "description": "Cuomo spokesperson Rich Azzopardi said the since-deleted video was “a draft proposal that was neither finished nor approved\"\nThe post Cuomo Attacked for New Mamdani Ad With ‘Racist’ Imagery of Pimp, Drunk and Wife Beater | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/cuomo-mamdani-ai-generated-racist-attack-ad/",
    "timestamp": "2025-10-23T15:49:44Z"
  },
  {
    "title": "REPORT: ‘Homeless Industrial Complex’ Demonizes the Policies Most Likely to Actually Help the Homeless",
    "description": "Americans spend billions of dollars to combat homelessness, through donations and taxpayer funding, but the “Homeless Industrial Complex” uses this money for political activism that... Read More\nThe post REPORT: ‘Homeless Industrial Complex’ Demonizes the Pol…",
    "link": "https://www.dailysignal.com/2025/10/23/report-homeless-industrial-complex-demonizes-policies-most-likely-actually-help-homeless/",
    "timestamp": "2025-10-23T15:48:35Z"
  },
  {
    "title": "Democrats Launch Investigation Into Trump’s ‘Theft’ Of $230 Million In Taxpayer Money",
    "description": "Two leading Democrats sent a letter to the White House demanding documents detailing the president’s effort to “shake down the American people.”",
    "link": "https://www.huffpost.com/entry/donald-trump-230-million_n_68fa46e8e4b08cdeb45ddaec",
    "timestamp": "2025-10-23T15:47:17Z"
  },
  {
    "title": "White House Staffers Couldn't Care Less About the East Wing Demolition",
    "description": "“Not affecting me at all, to be honest,” a White House aide tells WIRED.",
    "link": "https://www.wired.com/story/white-house-staffers-east-wing-demolition/",
    "timestamp": "2025-10-23T15:47:15Z"
  },
  {
    "title": "NYC mayoral candidates turn on each other in final debate: ‘Zohran, your resume could fit on a cocktail napkin. And, Andrew, your failures could fill a public school library in New York City’",
    "description": "Curtis Sliwa accused both men of “fighting like kids in a school yard,” but he piled on, too.",
    "link": "https://fortune.com/2025/10/23/mamdani-cuomo-sliwa-scorched-earth-debate-elections-mayoral/",
    "timestamp": "2025-10-23T15:46:04Z"
  },
  {
    "title": "NYC mayoral candidates turn on each other in final debate: ‘Zohran, your resume could fit on a cocktail napkin. And, Andrew, your failures could fill a public school library in New York City’",
    "description": "Curtis Sliwa accused Zohran Mamdani and Andrew Cuomo of “fighting like kids in a school yard”—but he piled on, too.",
    "link": "https://fortune.com/2025/10/23/zohran-mamdani-andrew-cuomo-curtis-sliwa-debate-nyc-mayoral-race-election/",
    "timestamp": "2025-10-23T15:46:04Z"
  },
  {
    "title": "Israel to lose US backing if the occupied West Bank is annexed, says Trump",
    "description": "Israeli lawmakers  advanced two bills yesterday paving the way for West Bank annexation",
    "link": "https://www.thejournal.ie/israel-west-bank-annexation-trump-6853380-Oct2025/",
    "timestamp": "2025-10-23T15:46:04Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao",
    "description": "WASHINGTON (AP) — President Donald Trump has pardoned Binance founder Changpeng Zhao, who created the world’s largest cryptocurrency exchange and served prison time after failing to stop criminals from using the platform to move money connected to child sex a…",
    "link": "https://financialpost.com/pmn/trump-pardons-binance-founder-changpeng-zhao",
    "timestamp": "2025-10-23T15:46:02Z"
  },
  {
    "title": "Who is Changpeng Zhao? Donald Trump Pardons Binance CEO",
    "description": "President Donald Trump has pardoned Binance founder Changpeng Zhao, who created the world’s largest cryptocurrency exchange and served prison time for failing to prevent criminals from using the platform to move money tied to child exploitation, drug traffick…",
    "link": "https://biztoc.com/x/4ca7fe2e4fb9a27b",
    "timestamp": "2025-10-23T15:45:57Z"
  },
  {
    "title": "Repeat Criminal Who Savagely Stabbed and Killed Iryna Zarutska on North Carolina Train Indicted by Federal Grand Jury, Now Eligible for Death Penalty",
    "description": "A federal grand jury has indicted 34-year-old career criminal Decarlos Brown Jr.\nThe post Repeat Criminal Who Savagely Stabbed and Killed Iryna Zarutska on North Carolina Train Indicted by Federal Grand Jury, Now Eligible for Death Penalty appeared first on T…",
    "link": "https://www.thegatewaypundit.com/2025/10/repeat-criminal-who-savagely-stabbed-killed-iryna-zarutska/",
    "timestamp": "2025-10-23T15:45:40Z"
  },
  {
    "title": "Gaza Flotilla Organizer: Flimsy 'Peace' Deal Is Not Enough | Opinion",
    "description": "When Donald Trump steps forward to present a “peace deal,\" it is crucial to ask two questions: who is defining \"peace,\" and who profits from it? For Trump, as his public statements and satirical AI videos make clear, the new Gaza ceasefire agreement is less a…",
    "link": "https://biztoc.com/x/bed17bb34e7a3e29",
    "timestamp": "2025-10-23T15:45:37Z"
  },
  {
    "title": "Trump pardons convicted founder of crypto exchange Binance",
    "description": "President Donald Trump signed a pardon on Wednesday for convicted crypto executive Changpeng Zhao, who founded the Binance crypto exchange.",
    "link": "https://biztoc.com/x/f217fb776e88a68d",
    "timestamp": "2025-10-23T15:45:36Z"
  },
  {
    "title": "Putin on Trump’s Statements About Budapest Meeting: Likely Just a Postponement",
    "description": "On October 16, Presidents Vladimir Putin and Donald Trump held one of their longest phone conversations of the year, focusing on the situation in Ukraine and future prospects for US–Russia relations. Following the call, Trump announced plans for a personal me…",
    "link": "https://sputnikglobe.com/20251023/putin-on-trumps-statements-about-budapest-meeting-likely-just-a-postponement-1123005482.html",
    "timestamp": "2025-10-23T15:45:34Z"
  },
  {
    "title": "Trump pardons convicted Binance founder Changpeng Zhao: report",
    "description": "President Donald Trump pardoned Changpeng \"CZ\" Zhao, the convicted founder of Binance, the world’s largest crypto exchange, The Wall Street Journal reported.\nZhao pleaded guilty in 2023 to a single violation of the Bank Secrecy Act, which included failure to …",
    "link": "https://biztoc.com/x/6be6811555ed7f97",
    "timestamp": "2025-10-23T15:45:21Z"
  },
  {
    "title": "White House pardons billionaire crypto exec Changpeng Zhao two years after Binance founder pleaded guilty in landmark DOJ investigation",
    "description": "President Donald Trump has pardoned Changpeng Zhao, the founder of the world’s largest crypto exchange Binance, the White House press secretary Karoline Leavitt confirmed to Fortune on Thursday. “President Trump exercised his constitutional authority by issui…",
    "link": "https://biztoc.com/x/e891ebb0012db447",
    "timestamp": "2025-10-23T15:45:11Z"
  },
  {
    "title": "Black enrollment is waning at many elite colleges after affirmative action ban, AP analysis finds",
    "description": "New enrollment figures provide mounting evidence of a backslide in Black enrollment.",
    "link": "https://www.bostonherald.com/2025/10/23/education-affirmative-action/",
    "timestamp": "2025-10-23T15:44:53Z"
  },
  {
    "title": "Black enrollment is waning at many elite colleges after affirmative action ban, AP analysis finds",
    "description": "New enrollment figures provide mounting evidence of a backslide in Black enrollment.",
    "link": "https://www.denverpost.com/2025/10/23/education-affirmative-action/",
    "timestamp": "2025-10-23T15:44:53Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao",
    "description": "Zhao had asked Trump for a pardon previously.",
    "link": "https://www.bostonherald.com/2025/10/23/trump-pardons-changpeng-zhao/",
    "timestamp": "2025-10-23T15:44:43Z"
  },
  {
    "title": "Oil Jumps as Trump Steps Up Pressure on Russia With Sanctions",
    "description": "The US blacklisted Russian oil giants Rosneft PJSC and Lukoil PJSC in an effort to cut off revenue Russia needs for its war in Ukraine.  Senior refinery...",
    "link": "https://finance.yahoo.com/news/oil-jumps-us-sanctions-russia-222110181.html",
    "timestamp": "2025-10-23T15:43:39Z"
  },
  {
    "title": "Trump pardons convicted Binance founder Changpeng Zhao",
    "description": "Key Points President Donald Trump pardoned Binance founder Changpeng Zhao one week after he commuted the prison sentence of former New York congressman George Santos. Zhao had pleaded guilty in 2023 to enabling money laundering while CEO of the huge cryptocur…",
    "link": "https://freerepublic.com/focus/f-news/4348161/posts",
    "timestamp": "2025-10-23T15:42:45Z"
  },
  {
    "title": "European space firms combine to compete with SpaceX",
    "description": "Europe's top space firms have forged a deal to combine their satellite manufacturing and servicing businesses, creating a new European space group that will compete with global giants like Elon Musk's Starlink.",
    "link": "https://news.sky.com/story/european-space-firms-combine-to-compete-with-spacex-13455931",
    "timestamp": "2025-10-23T15:42:00Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao, declaring the 'war on crypto' over",
    "description": "Changpeng Zhao, also known as CZ, pleaded guilty to money laundering charges and was sentenced to four months in prison before he was released last year.",
    "link": "https://www.businessinsider.com/trump-pardon-binance-founder-changpeng-zhao-war-on-crypto-2025-10",
    "timestamp": "2025-10-23T15:41:38Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao",
    "description": "President Donald Trump has pardoned Binance founder Changpeng Zhao, who created the world’s largest cryptocurrency exchange. Zhao served prison time after failing to stop criminals from using the platform to move money connected to child sex abuse, drug traff…",
    "link": "https://apnews.com/article/trump-pardon-binance-changpeng-zhao-crypto-exchange-e1cb3fe516bc42b4c7ce5c107a280dc7",
    "timestamp": "2025-10-23T15:41:14Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao",
    "description": "President Donald Trump has pardoned Binance founder Changpeng Zhao, who created the world’s largest cryptocurrency exchange and served prison time after...",
    "link": "https://finance.yahoo.com/news/trump-pardons-binance-founder-changpeng-154114317.html",
    "timestamp": "2025-10-23T15:41:14Z"
  },
  {
    "title": "Russia-US summit postponed – Putin",
    "description": "The Russian president noted that the idea of a meeting in Budapest was initially suggested by Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626878-russia-us-summit-postponed-putin/",
    "timestamp": "2025-10-23T15:41:00Z"
  },
  {
    "title": "Brazil’s President Lula announces he will seek a fourth term in 2026",
    "description": "The left-wing leader made the announcement on a trip through Asia, brushing aside concerns about his advanced age.",
    "link": "https://www.aljazeera.com/news/2025/10/23/brazils-president-lula-announces-he-will-seek-a-fourth-term-in-2026",
    "timestamp": "2025-10-23T15:40:51Z"
  },
  {
    "title": "Trump pardons convicted founder of crypto exchange Binance",
    "description": "President Donald Trump signed a pardon on Wednesday for convicted crypto executive Changpeng Zhao, who founded the Binance crypto exchange.",
    "link": "https://www.nbcnews.com/tech/crypto/binance-pardon-trump-changpeng-zhao-crypto-rcna239371",
    "timestamp": "2025-10-23T15:40:08Z"
  },
  {
    "title": "White House trolls Democrats over ballroom meltdown — adds cocaine, Clinton, Obama scandals to timeline",
    "description": "Trump administration responds to ballroom criticism by posting White House timeline that includes cocaine discovery, Muslim Brotherhood visit and Clinton scandal.",
    "link": "https://www.foxnews.com/politics/white-house-trolls-democrats-over-ballroom-meltdown-adds-cocaine-clinton-obama-scandals-timeline",
    "timestamp": "2025-10-23T15:39:16Z"
  },
  {
    "title": "'Unqualified' Noem was handed DHS job as a favor to longtime Trump friend: new book",
    "description": "“This is dangerous. What are you doing?” was one of the responses to Donald Trump after he agreed to nominate former South Dakota Gov. Kristi Noem to be his Department of Homeland Security director.That is according to excerpts from a new book by journalist J…",
    "link": "https://www.rawstory.com/noem-lewandowski-2674226459/",
    "timestamp": "2025-10-23T15:38:50Z"
  },
  {
    "title": "Trump pardons convicted Binance founder Changpeng Zhao",
    "description": null,
    "link": "https://www.cnbc.com/2025/10/23/trump-pardons-binance-founder-cz-zhao.html",
    "timestamp": "2025-10-23T15:37:25Z"
  },
  {
    "title": "Can Prop 50 Pass? Newsom Redistricting Bid Hits Crunch Time.",
    "description": "Can Prop 50 pass? It’s crunch time for Gavin Newsom’s redistricting bid. Early voting data suggests the California ballot measure meant to thwart Trump’s gerrymandering will pass. But a lot of voters are undecided.",
    "link": "http://nymag.com/intelligencer/article/can-prop-50-pass-newsom-redistricting-bid-hits-crunch-time.html",
    "timestamp": "2025-10-23T15:37:24Z"
  },
  {
    "title": "NBA's Billups and Rozier arrested in gambling probe",
    "description": "Chauncey Billups and Terry Rozier are among more than 30 people charged in connection with two separate but related federal gambling investigations that involved the league and organised crime.",
    "link": "https://www.rte.ie/news/world/2025/1023/1540241-nba-gambling-probe/",
    "timestamp": "2025-10-23T15:37:02Z"
  },
  {
    "title": "Don’t Fall for the Supreme Court’s ‘Pro-Weed’ Gun Case",
    "description": "Elie Mystal\n\n\n\nThe case, which proposes expanding gun access to drug users, is not an opportunity, it‘s a trap.\r\n\n\r\n\n\nThe post Don’t Fall for the Supreme Court’s ‘Pro-Weed’ Gun Case appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/supreme-courts-gun-drug-case/",
    "timestamp": "2025-10-23T15:36:34Z"
  },
  {
    "title": "With no agreement on health coverage pending, government shutdown persists",
    "description": "Democrats say they won’t vote to reopen the government until Republicans negotiate an extension of health care subsidies. Republicans say they won’t negotiate until Democrats vote to reopen the government.",
    "link": "https://www.pennlive.com/health/2025/10/with-no-agreement-on-health-coverage-pending-government-shutdown-persists.html",
    "timestamp": "2025-10-23T15:36:00Z"
  },
  {
    "title": "White House pardons billionaire crypto exec Changpeng Zhao two years after Binance founder pleaded guilty in landmark DOJ investigation",
    "description": "The Binance founder pleaded guilty in 2023 to failing to maintain an effective anti-money laundering regime.",
    "link": "https://fortune.com/crypto/2025/10/23/binance-changpeng-zhao-cz-pardon-president-donald-trump/",
    "timestamp": "2025-10-23T15:35:39Z"
  },
  {
    "title": "WATCH LIVE: Senate meets as government shutdown enters 23rd day",
    "description": "Tax credits for people who get health insurance through the law expire at the end of the year. Democrats say they won’t vote to reopen the government until Republicans negotiate an extension of the subsidies.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-meets-as-government-shutdown-enters-23rd-day",
    "timestamp": "2025-10-23T15:35:19Z"
  },
  {
    "title": "Trump's Argentina beef deal angers America's struggling farmers: 'You're selling us out' (Samantha Delouya/CNN)",
    "description": "Samantha Delouya / CNN:\nTrump's Argentina beef deal angers America's struggling farmers: 'You're selling us out'  —  President Donald Trump said this week he “loved” America's cattle ranchers.  But those farmers, who overwhelmingly supported the president in …",
    "link": "https://www.memeorandum.com/251023/p65",
    "timestamp": "2025-10-23T15:35:00Z"
  },
  {
    "title": "Trump pardons Binance founder CZ",
    "description": "United States President Donald Trump has pardoned Changpeng Zhao, the co-founder and former CEO of the cryptocurrency exchange platform Binance, the Wall Street Journal reported on Thursday, citing so...",
    "link": "https://biztoc.com/x/4f7f4fc183e65298",
    "timestamp": "2025-10-23T15:34:26Z"
  },
  {
    "title": "Trump asserts India would bring down Russian oil purchase to `almost nothing’ by year-end",
    "description": "Trump claims India will nearly eliminate Russian oil purchases by year-end amid US sanctions, while the MEA assesses the impact.",
    "link": "https://www.thehindubusinessline.com/economy/trump-asserts-india-would-bring-down-russian-oil-purchase-to-almost-nothing-by-year-end/article70194804.ece",
    "timestamp": "2025-10-23T15:34:14Z"
  },
  {
    "title": "Trump Pardons Billionaire Binance Founder—And His Crypto Ally—Changpeng Zhao",
    "description": "Zhao served a four-month prison sentence after earlier pleading guilty to money laundering charges.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/23/trump-pardons-billionaire-binance-founder-and-his-crypto-ally-changpeng-zhao/",
    "timestamp": "2025-10-23T15:34:09Z"
  },
  {
    "title": "Trump allies, undeterred by setbacks in courts and Congress, push anew for citizenship proof to vote",
    "description": "Voting rights groups say it's a potential tool for voter disenfranchisement.",
    "link": "https://www.bostonherald.com/2025/10/23/trump-elections-citizenship/",
    "timestamp": "2025-10-23T15:33:58Z"
  },
  {
    "title": "Adams to endorse Cuomo in NYC mayor's race today, sources say",
    "description": "New York City Mayor Eric Adams will endorse former Gov. Andrew Cuomo in the race to replace him, sources in both camps tell CBS News New York's Marcia Kramer.",
    "link": "https://www.cbsnews.com/newyork/news/adams-endorses-cuomo-nyc-mayor-election/",
    "timestamp": "2025-10-23T15:33:18Z"
  },
  {
    "title": "Health care compromise appears far off as the government shutdown stalemate persists",
    "description": "The government shutdown has reopened debate on the future of health coverage under the Affordable Care Act.",
    "link": "https://www.news4jax.com/business/2025/10/23/health-care-compromise-appears-far-off-as-the-government-shutdown-stalemate-persists/",
    "timestamp": "2025-10-23T15:31:39Z"
  },
  {
    "title": "Government Shutdown Threatens Food Benefits For Millions",
    "description": "Half of states have already “shut down” Supplemental Nutrition Assistance Program benefits for next month, according to the Trump administration.",
    "link": "https://www.huffpost.com/entry/government-shutdown-snap-benefits-november_n_68fa444ae4b08cdeb45dd7d9",
    "timestamp": "2025-10-23T15:31:19Z"
  },
  {
    "title": "Vance criticizes Israel’s parliament vote on West Bank annexation, says the move was an ‘insult’",
    "description": "Hard-liners in the Israeli parliament had narrowly passed a symbolic preliminary vote in support of annexing the West Bank — an apparent attempt to embarrass Prime Minister Benjamin Netanyahu while Vice President JD Vance was still in the country.",
    "link": "https://www.pbs.org/newshour/world/vance-criticizes-israels-parliament-vote-on-west-bank-annexation-says-the-move-was-an-insult",
    "timestamp": "2025-10-23T15:31:18Z"
  },
  {
    "title": "Trump pardons convicted Binance founder Zhao, White House says",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump has pardoned convicted Binance founder Changpeng Zhao, a White House official said on Thursday.",
    "link": "https://finance.yahoo.com/news/trump-pardons-convicted-binance-founder-153104726.html",
    "timestamp": "2025-10-23T15:31:04Z"
  },
  {
    "title": "Binance's CZ Wins Pardon From U.S. President Donald Trump",
    "description": "U.S. President Donald Trump pardoned Binance founder Changpeng Zhao months after he said he'd asked for a pardon.",
    "link": "https://www.coindesk.com/policy/2025/10/23/binance-s-cz-wins-pardon-from-u-s-president-donald-trump",
    "timestamp": "2025-10-23T15:30:59Z"
  },
  {
    "title": "The Data Brokers Fueling ICE’s Deportation Machine—And the Union Shareholders Fighting Back",
    "description": "\"As investors, we are thinking about this as a risk to our investments, but also as a social and ethical issue.”",
    "link": "https://inthesetimes.com/article/ice-deportation-machine-surveillance-artificial-intelligence-thomson-reuters-clear-trump",
    "timestamp": "2025-10-23T15:30:00Z"
  },
  {
    "title": "Trump mulls asking Israel to free Palestinian leader Barghouti as US looks to Gaza’s post-Hamas rule",
    "description": "He's the most popular and potentially unifying Palestinian leader.",
    "link": "https://www.bostonherald.com/2025/10/23/trump-gaza-barghouti/",
    "timestamp": "2025-10-23T15:29:15Z"
  },
  {
    "title": "U.S. Considers Up to 100% Tariffs on Nicaraguan Imports; Public Comment Sought",
    "description": "The United States is considering new tariffs of up to 100% on imports from Nicaragua, potentially strangling the flow of Nicaraguan green coffee to U.S. traders and roasters.",
    "link": "https://dailycoffeenews.com/2025/10/23/u-s-considers-up-to-100-tariffs-on-nicaraguan-imports-public-comment-sought/",
    "timestamp": "2025-10-23T15:29:04Z"
  },
  {
    "title": "The White House’s plan to rig district maps is advancing — but not everywhere",
    "description": "Thanks to gerrymandering, Republicans have handed themselves seven House victories a year before the 2026 midterm elections. North Carolina is the latest.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-houses-plan-rig-district-maps-advancing-not-everywhere-rcna239360",
    "timestamp": "2025-10-23T15:28:10Z"
  },
  {
    "title": "New poll in key showdown for Virginia governor indicates single-digit race",
    "description": "Former Rep. Abigail Spanberger leads Lt. Gov. Winsome Earle-Sears 52%-43% in Virginia governor race, while lieutenant governor and attorney general contests remain tight.",
    "link": "https://www.foxnews.com/politics/new-poll-key-showdown-virginia-governor-indicates-single-digit-race",
    "timestamp": "2025-10-23T15:27:30Z"
  },
  {
    "title": "Trump Pardons Binance Founder Changpeng Zhao After Biden's 'War on Crypto'",
    "description": "U.S. President Donald Trump has pardoned Binance founder Changpeng \"CZ\" Zhao, the White House confirmed to Decrypt.",
    "link": "https://decrypt.co/345681/trump-pardons-binance-founder-changpeng-zhao",
    "timestamp": "2025-10-23T15:27:17Z"
  },
  {
    "title": "Elizabeth Warren Slams Paramount-WBD Bid: ‘A Trap to Set Higher Prices’",
    "description": "\"We have antitrust laws to put a stop to this kind of concentration. It is time we all sound the alarm bells and enforce the laws,\" the senator says\nThe post Elizabeth Warren Slams Paramount-WBD Bid: ‘A Trap to Set Higher Prices’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elizabeth-warren-slams-paramount-wbd-bid/",
    "timestamp": "2025-10-23T15:27:12Z"
  },
  {
    "title": "Watch live: FBI announces NBA arrests in Mafia-linked gambling, sports rigging probes - NewsBreak",
    "description": "Miami Heat guard Terry Rozier and Portland Trail Blazers coach Chauncey Billups were arrested in Florida as part of a gambling investigation. Former NBA pl",
    "link": "https://www.newsbreak.com/share/4308516205430-watch-live-fbi-announces-nba-arrests-in-mafia-linked-gambling-sports-rigging-probes?_f=app_share&amp;pd=0G8iaRsP&amp;lang=en_US&amp;send_time=1761233175&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.42.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2&amp;s=i2",
    "timestamp": "2025-10-23T15:26:52Z"
  },
  {
    "title": "After waffling between Russia and Ukraine, Trump slaps Kremlin with oil sanctions",
    "description": "President Donald Trump imposed sanctions on Russia's largest oil companies Rosneft and Lukoil while canceling his planned summit with Russian President Vladimir Putin.",
    "link": "https://www.foxnews.com/politics/trumps-shifting-tone-russia-ukraine-conflict-leaves-onlookers-guessing-over-us-strategy",
    "timestamp": "2025-10-23T15:26:41Z"
  },
  {
    "title": "Trump tears down white house east wing to build giant ballroom",
    "description": "Donald Trump is making big changes to the White House, including tearing down the East Wing and building a giant new ballroom. Many Americans do not support this. The project is funded by private donations and will host nearly 1,000 people. Trump wants to lea…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-tears-down-white-house-east-wing-to-build-giant-ballroom/articleshow/124765597.cms",
    "timestamp": "2025-10-23T15:25:03Z"
  },
  {
    "title": "Trump said to pardon Binance founder CZ",
    "description": "United States President Donald Trump has pardoned Changpeng Zhao, the co-founder and former CEO of the cryptocurrency exchange platform Binance, the Wall Street Journal reported on Thursday, citing so...",
    "link": "https://biztoc.com/x/41f542736808dfdb",
    "timestamp": "2025-10-23T15:23:36Z"
  },
  {
    "title": "Trump Now 'Fully On Warpath With Russia' With Oil Sanctions, Medvedev Says",
    "description": "Trump Now 'Fully On Warpath With Russia' With Oil Sanctions, Medvedev Says\n \nFormer Russian president Dmitry Medvedev and close Putin-ally has blasted President Donald Trump's new sanctions against Russia's oil giants as an \"act of war\" which puts the United …",
    "link": "https://biztoc.com/x/eca060f949bd32db",
    "timestamp": "2025-10-23T15:23:20Z"
  },
  {
    "title": "Medvedev: 'Peacemaker' Trump on path to war",
    "description": "Russian Security Council Deputy Chairman Dmitry Medvedev claimed on Thursday that United States President Donald Trump, whom he described as a false peacemaker, has set himself on a \"warpath\" against his country by introducing new sanctions on its oil sector.…",
    "link": "https://freerepublic.com/focus/f-chat/4348157/posts",
    "timestamp": "2025-10-23T15:23:17Z"
  },
  {
    "title": "Trump sanctions Russian oil firms after failed diplomacy",
    "description": "The United States has announced new sanctions targeting Russia’s two largest oil companies in an effort to pressure Moscow to negotiate a peace deal in Ukraine. The announcement came one day after President Donald Trump said a planned meeting with his Russian…",
    "link": "https://rollingout.com/2025/10/23/trump-putin-talks-stall-russia-sanctions/",
    "timestamp": "2025-10-23T15:21:07Z"
  },
  {
    "title": "Illinois governor candidate Darren Bailey's son, daughter-in-law and 2 grandkids killed in helicopter crash",
    "description": "Illinois gubernatorial candidate Darren Bailey's son, daughter-in-law and two grandchildren were killed in a helicopter crash, his campaign said Thursday.",
    "link": "https://www.nbcnews.com/news/us-news/illinois-governor-darren-bailey-helicopter-crash-rcna239339",
    "timestamp": "2025-10-23T15:20:15Z"
  },
  {
    "title": "President Trump pardons Binance founder CZ: Report",
    "description": "US President Donald Trump signed Changpeng “CZ” Zhao’s pardon on Wednesday, according to The Wall Street Journal.",
    "link": "https://cointelegraph.com/news/trump-pardons-binance-founder-cz",
    "timestamp": "2025-10-23T15:19:30Z"
  },
  {
    "title": "Why Is Obama Returning to Campaign in This Virginia Region for First Time in 13 Years?",
    "description": "How close is the race for Virginia’s next governor? We could cite polls (Democrat Abigail Spanberger leads by more than five points in the two... Read More\nThe post Why Is Obama Returning to Campaign in This Virginia Region for First Time in 13 Years? appeare…",
    "link": "https://www.dailysignal.com/2025/10/23/why-is-obama-returning-campaign-virginia-region-first-time-13-years/",
    "timestamp": "2025-10-23T15:19:17Z"
  },
  {
    "title": "ROOKE: Mamdani Pulled Debate-Night Move Straight Out Of Trump’s Playbook",
    "description": "New York City mayoral candidate Zohran Mamdani invited seven guests to the Wednesday debate against opponents Democrat Andrew Cuomo and Republican Curtis Sliwa.",
    "link": "https://dailycaller.com/2025/10/23/rooke-mamdani-cuomo-sliwa-trump-clinton-debate-sexual-assault-allegations-nyc-mayor-charlotte-bennett/",
    "timestamp": "2025-10-23T15:19:02Z"
  },
  {
    "title": "Republicans Warn Of Chaos At US Airports As Shutdown Drags",
    "description": "Republicans sounded the alarm Thursday over potential turmoil at US airports as the government shutdown threatens to drag into November, warning of ruined holiday plans for millions of Americans.",
    "link": "https://www.ibtimes.com/republicans-warn-chaos-us-airports-shutdown-drags-3788177",
    "timestamp": "2025-10-23T15:18:11Z"
  },
  {
    "title": "European Union Agrees on Plan to Phase Out Russian Gas by 2028",
    "description": "European Union ministers approved plans to gradually phase out Russian gas imports by the start of 2028 to reduce reliance on Moscow amid criticism from U.S. President Donald Trump that the bloc has been funding both sides of the war in Ukraine.\nThe post Euro…",
    "link": "https://www.breitbart.com/europe/2025/10/23/european-union-agrees-on-plan-to-phase-out-russian-gas-by-2028/",
    "timestamp": "2025-10-23T15:17:59Z"
  },
  {
    "title": "The decades-old exemption that lets Trump fast-track White House rebuild",
    "description": "The White House and several other buildings are exempt from the National Historic Preservation Act of 1966.",
    "link": "https://www.bbc.com/news/articles/c397jvrrm4mo",
    "timestamp": "2025-10-23T15:17:18Z"
  },
  {
    "title": "The Trump Shutdown Effect Is Here: Obamacare Costs Jump in Red State",
    "description": "Health care in Idaho just got more expensive thanks to the government shutdown.Idaho’s Affordable Care Act portal opened Thursday with new price tags, offering the nation its first glimpse at an Obamacare marketplace without federal tax credits.The federal go…",
    "link": "https://newrepublic.com/post/202170/donald-trump-shutdown-obamacare-costs-idaho",
    "timestamp": "2025-10-23T15:17:10Z"
  },
  {
    "title": "Trump Uses White House Destruction as Chance to Improve a Golf Course",
    "description": "President Trump is reportedly taking the dirt from his demolition of the White House’s East Wing and moving it to the golf course he’s planning on taking over and renovating in Washington, D.C.Martin Austermuhle, a reporter for local news site The 51st, noted…",
    "link": "https://newrepublic.com/post/202174/trump-white-house-destruction-ballroom-golf-course",
    "timestamp": "2025-10-23T15:15:37Z"
  },
  {
    "title": "Read the Full Transcript of Donald Trump's Interview on the Gaza Ceasefire With TIME (Time)",
    "description": "Time:\nRead the Full Transcript of Donald Trump's Interview on the Gaza Ceasefire With TIME  —  President Donald Trump participated in a phone interview with TIME at the White House on Oct. 15.  —  Over the course of the interview, Trump discussed in detail ho…",
    "link": "https://www.memeorandum.com/251023/p58",
    "timestamp": "2025-10-23T15:15:02Z"
  },
  {
    "title": "The Appeal of the Campus Right",
    "description": "It’s not about Donald Trump.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/college-conservatives/684660/",
    "timestamp": "2025-10-23T15:15:00Z"
  },
  {
    "title": "VIDEO: Man Wearing Trump Inflatable Costume Allegedly Attacked at No Kings Rally",
    "description": "A man wearing an inflatable costume of President Donald Trump was allegedly attacked at a No Kings protest over the weekend, video shows.\nThe post VIDEO: Man Wearing Trump Inflatable Costume Allegedly Attacked at No Kings Rally appeared first on Breitbart.",
    "link": "https://www.breitbart.com/pre-viral/2025/10/23/video-man-wearing-trump-inflatable-costume-allegedly-attacked-at-no-kings-rally/",
    "timestamp": "2025-10-23T15:14:51Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao: WSJ",
    "description": "Trump's pardon of Zhao may signal a shift towards more favorable crypto policies, potentially influencing market dynamics and regulatory approaches.\nThe post Trump pardons Binance founder Changpeng Zhao: WSJ appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/trump-pardons-binance-founder-changpeng-zhao-cz/",
    "timestamp": "2025-10-23T15:14:43Z"
  },
  {
    "title": "Drawing new districts is a terrible idea",
    "description": "Lawmakers aren’t responding to new census data or a court order. They are responding to pressure from President Donald Trump.",
    "link": "https://www.ncspin.com/drawing-new-districts-is-a-terrible-idea",
    "timestamp": "2025-10-23T15:14:00Z"
  },
  {
    "title": "Illinois candidate's grandchildren among family killed in helicopter crash",
    "description": "Darren Bailey announced his son, daughter-in-law, and two of their children had died in the Montana crash.",
    "link": "https://www.bbc.com/news/articles/cg43114vzv1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-23T15:13:56Z"
  },
  {
    "title": "‘F**king Unbelievable!’ Jim Acosta Gets On-Scene Reactions to Trump’s White House Demolition",
    "description": "Jim Acosta took a field trip to the White House to get some strong reactions to President Donald Trump's ongoing demolition project at the People's House.\nThe post ‘F**king Unbelievable!’ Jim Acosta Gets On-Scene Reactions to Trump’s White House Demolition fi…",
    "link": "https://www.mediaite.com/media/news/fking-unbelievable-jim-acosta-gets-on-scene-reactions-to-trumps-white-house-demolition/",
    "timestamp": "2025-10-23T15:13:49Z"
  },
  {
    "title": "Trump mulls asking Israel to free Palestinian leader Barghouti as US looks to Gaza's post-Hamas rule",
    "description": "President Donald Trump is suggesting he could call on Israel to release imprisoned Fatah leader Marwan Barghouti, the most popular and potentially unifying...",
    "link": "https://www.yahoo.com/news/articles/trump-eyes-imprisoned-palestinian-leader-151156641.html",
    "timestamp": "2025-10-23T15:11:56Z"
  },
  {
    "title": "As Trump Plans to Steal $230 Million From Taxpayers, You Can Thank John Roberts (Pema Levy/Mother Jones)",
    "description": "Pema Levy / Mother Jones:\nAs Trump Plans to Steal $230 Million From Taxpayers, You Can Thank John Roberts  —  Shall we call it a “Roberts reward”?  —  President Donald Trump is demanding that the Justice Department transfer $230 million in taxpayer dollars in…",
    "link": "https://www.memeorandum.com/251023/p56",
    "timestamp": "2025-10-23T15:10:03Z"
  },
  {
    "title": "The White House Is Being Destroyed Because Corruption Doesn’t Matter Anymore",
    "description": "Chris Lehmann\n\n\n\nThe demolition of the East Wing is a symbol of a system that long ago stopped caring about the kind of blatant graft that Trump loves.\r\n\n\r\n\n\nThe post The White House Is Being Destroyed Because Corruption Doesn’t Matter Anymore appeared first …",
    "link": "https://www.thenation.com/article/politics/white-house-demolition-trump-corruption/",
    "timestamp": "2025-10-23T15:10:00Z"
  },
  {
    "title": "Sanctions on Russia have failed to stop the war so far – will Trump’s latest package be any different?",
    "description": "The good news: at least the US is acting against Russia.",
    "link": "https://theconversation.com/sanctions-on-russia-have-failed-to-stop-the-war-so-far-will-trumps-latest-package-be-any-different-268228",
    "timestamp": "2025-10-23T15:09:30Z"
  },
  {
    "title": "We Have No One to Blame for Public Health Disasters But Ourselves",
    "description": "Gerald Markowitz\n\n\n\nIsn’t it time, in the era of Trump and RFK Jr., not just to focus on viruses and events in nature, but on a social structure in which corporations and institutions make decisions that profoundly affect people’s health?\r\n\n\r\n\n\nThe post We Ha…",
    "link": "https://www.thenation.com/article/society/public-health-environment-trump/",
    "timestamp": "2025-10-23T15:09:04Z"
  },
  {
    "title": "EU targets liquefied natural gas in new sanctions against Russia",
    "description": "Package also targets shadow fleet vessels that Russia uses to evade an oil price cap",
    "link": "https://www.irishtimes.com/world/europe/2025/10/23/eu-targets-liquefied-natural-gas-in-new-sanctions-against-russia/",
    "timestamp": "2025-10-23T15:08:05Z"
  },
  {
    "title": "Trump border czar calls for ‘weapon of mass destruction’ debate on fentanyl crisis",
    "description": "The fentanyl crisis in the US requires serious action from Washington, President Donald Trump’s border czar, Tom Homan, has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626869-us-fentanyl-weapon-mass-destruction/",
    "timestamp": "2025-10-23T15:07:55Z"
  },
  {
    "title": "Wearing a sombrero and mustache for Halloween? It’s racist",
    "description": "My tip to those who want to follow Republican protocol for Halloween and dress up in the sombrero-and-mustache meme popularized by trendsetters like President Donald Trump and Vice President JD Vance: Don’t! Don’t even think about sinking down to their level …",
    "link": "https://freerepublic.com/focus/f-news/4348156/posts",
    "timestamp": "2025-10-23T15:06:55Z"
  },
  {
    "title": "Illinois candidate's grandchildren among family killed in helicopter crash",
    "description": "Darren Bailey announced his son, daughter-in-law, and two of their children had died in the Montana crash.",
    "link": "https://www.bbc.com/news/articles/cg43114vzv1o",
    "timestamp": "2025-10-23T15:06:41Z"
  },
  {
    "title": "Oil prices surge 5% as Trump hits Russian crude with sanctions",
    "description": "Oil prices jumped more than five percent Thursday after US President Donald Trump targeted Russia's key oil industry with new sanctions in a bid to end the war in Ukraine.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-prices-surge-5-as-trump-hits-russian-crude-with-sanctions/articleshow/124765374.cms",
    "timestamp": "2025-10-23T15:06:41Z"
  },
  {
    "title": "Most Americans Think Trump Uses Law Enforcement To Target Enemies, Polls Find",
    "description": "About 55% of all respondents to a recent poll agreed the president was using the federal government to prosecute his foes.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/10/23/most-americans-think-trump-uses-law-enforcement-to-target-enemies-polls-find/",
    "timestamp": "2025-10-23T15:05:43Z"
  },
  {
    "title": "See the list of donors funding Trump's new White House ballroom, including Apple, Meta, and Amazon",
    "description": "Trump said on Wednesday that the project will cost \"about $300 million.\" Among the major donors are several Big Tech companies.",
    "link": "https://www.businessinsider.com/trump-white-house-ballroom-donors-list-apple-meta-amazon-microsoft-2025-10",
    "timestamp": "2025-10-23T15:05:06Z"
  },
  {
    "title": "Does the UN need to be run like a business? IKEA CEO Jesper Brodin may get the chance",
    "description": "The outgoing IKEA chief is Sweden's nominee to lead the UN's High Commissioner for Refugees.",
    "link": "https://fortune.com/2025/10/23/ikea-ceo-jesper-brodin-unhcr-un-business/",
    "timestamp": "2025-10-23T15:04:38Z"
  },
  {
    "title": "Trump says would pull US support if Israel annexes West Bank",
    "description": "WASHINGTON: President Donald Trump said Israel would lose its crucial backing from the United States if it annexes the occupied West Bank, in a Time magazine interview published on Thu",
    "link": "https://www.channelnewsasia.com/world/trump-israel-lose-us-support-annex-west-bank-5421036",
    "timestamp": "2025-10-23T15:04:35Z"
  },
  {
    "title": "Trump Gets Away With Sh*tting On Half The Country Because That's The Whole GOP Platform Anyway",
    "description": "Name one Republican policy that isn't about hurting someone.",
    "link": "https://www.wonkette.com/p/trump-gets-away-with-shtting-on-half",
    "timestamp": "2025-10-23T15:02:37Z"
  },
  {
    "title": "Quebec layoffs at truck manufacturing plant spur union to call for urgent action",
    "description": "A United States-based truck manufacturer is laying off 300 workers at its plant in Sainte-Thérèse, Que., just days before \n \n \n \n \n \n \n \n \n \n U.S. tariffs\n \n \n \n \n \n \n \n \n \n on heavy-duty trucks take effect. \n In October, U.S. President Donald Trump \n \n \n \n \n…",
    "link": "https://biztoc.com/x/ac671f419133dc15",
    "timestamp": "2025-10-23T15:01:27Z"
  },
  {
    "title": "How the Gaza Deal Got Done (Eric Cortellessa/Time)",
    "description": "Eric Cortellessa / Time:\nHow the Gaza Deal Got Done  —  President Donald Trump sits in the Oval Office at the White House, in Washington, DC, on Oct. 21, 2025.Photograph by Stephen Voss for TIME  —  How the Gaza deal got done, a eulogy for the White House's E…",
    "link": "https://www.memeorandum.com/251023/p52",
    "timestamp": "2025-10-23T15:00:29Z"
  },
  {
    "title": "US still interested in meeting with Russia – Rubio",
    "description": "US Secretary of State Marco Rubio says Washington wants to maintain contacts with Moscow after a Trump-Putin summit was postponed Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626873-rubio-us-russia-meeting/",
    "timestamp": "2025-10-23T15:00:10Z"
  }
]