[
  {
    "title": "Homeland Security overhauls asylum phone app — now it's for 'self-deportation'",
    "description": "The Trump administration has overhauled a cellphone app once used to let migrants apply for asylum",
    "link": "https://abcnews.go.com/Technology/wireStory/homeland-security-overhauls-asylum-phone-app-now-deportation-119639454",
    "timestamp": "2025-03-10T18:14:34Z"
  },
  {
    "title": "US LNG exporters seek to renegotiate deals to cover rising costs",
    "description": "Several U.S. LNG producers are trying to renegotiate higher prices with buyers as a result of rising construction, labor and borrowing costs, according to...",
    "link": "https://finance.yahoo.com/news/us-lng-exporters-seek-renegotiate-181413957.html",
    "timestamp": "2025-03-10T18:14:13Z"
  },
  {
    "title": "'Demeaning' Trump official demanded federal employees produce SAT or IQ scores: NYT",
    "description": "The New York Times is reporting that Michael Grimes, a former Morgan Stanley banker who now works as a senior official at the Department of Commerce, has been ruffling feathers with workers at the CHIPS Program Office, which is responsible for overseeing gran…",
    "link": "https://www.rawstory.com/trump-chips-act/",
    "timestamp": "2025-03-10T18:13:50Z"
  },
  {
    "title": "Market sell-off turns ‘ugly’ as US recession fears grow",
    "description": "Turbulence for global stock markets continues as Trump gives mixed signals on tariffs",
    "link": "https://www.irishtimes.com/business/2025/03/10/market-sell-off-turns-ugly-as-us-recession-fears-grow/",
    "timestamp": "2025-03-10T18:13:30Z"
  },
  {
    "title": "Elon Musk says X target of ‘massive cyberattack’",
    "description": "Musk previously blamed a cyberattack for a site crash during a Trump interview.",
    "link": "https://www.nzherald.co.nz/world/elon-musk-says-x-target-of-massive-cyberattack/3QHEBICLXVFAPPH4FDFMHVHSFU/",
    "timestamp": "2025-03-10T18:13:06Z"
  },
  {
    "title": "Why Is X Down? Elon Musk Explains Why the Social Media Site Is Unusable Today",
    "description": "X (formerly known as Twitter) experienced a major mass outage today, and we’ve now gotten an explanation about what happened. Users first started experiencing issues at 5:30 am ET, then again at 9:30 am ET, and then the site was fully non-functional at around…",
    "link": "https://www.justjared.com/2025/03/10/why-is-x-down-elon-musk-explains-why-the-social-media-site-is-unusable-today/",
    "timestamp": "2025-03-10T18:12:57Z"
  },
  {
    "title": "Howard Lutnick Admits Prices Will Go Up Because Of Trump's Tariffs",
    "description": "Trumps Commerce Secretary Howard Lutnick spewed nonsense trying to defend Trump's tariffs on Meet The Press until he finally admitted they will result in higher prices for the country. \nLutnick's monologue was well prepared and rehearsed with the sole purpose…",
    "link": "https://crooksandliars.com/2025/03/howard-lutnick-admits-prices-higher-tariffs",
    "timestamp": "2025-03-10T18:12:50Z"
  },
  {
    "title": "White House: Slowdown Possible as Economy Adjusts",
    "description": "State of the Union: President Trump and Secretary Bessent say the U.S. will be better off in the long term.\nThe post White House: Slowdown Possible as Economy Adjusts appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/white-house-slowdown-possible-as-economy-adjusts/",
    "timestamp": "2025-03-10T18:12:34Z"
  },
  {
    "title": "Texas bill would make identifying as transgender a felony punishable by jail",
    "description": "The bill, while unlikely to pass, highlights the increasing extremism of legislation targeting trans people, especially in Texas, in recent years.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/texas-bill-identify-transgender-state-felony-rcna195642",
    "timestamp": "2025-03-10T18:12:23Z"
  },
  {
    "title": "Relations between Canada and the US have not been this bad since the 19th Century",
    "description": "Carney holds Irish and British citizenship, which he has said he will revoke upon taking office.",
    "link": "https://www.thejournal.ie/incoming-pm-mark-carney-says-canada-can-no-longer-trust-the-us-as-he-vows-to-resist-annexation-6645037-Mar2025/",
    "timestamp": "2025-03-10T18:11:46Z"
  },
  {
    "title": "Do Face Masks Work?",
    "description": "Five years after Donald Trump declared a national COVID emergency, here's what the research says about face masks.",
    "link": "https://reason.com/2025/03/10/do-face-masks-work/",
    "timestamp": "2025-03-10T18:10:43Z"
  },
  {
    "title": "Who is Kristi Noem? All about Trump’s Homeland Security Secretary",
    "description": "Kristi Noem was sworn in as the Secretary of the Department of Homeland Security on January 25, 2025. Her appointment reflects President Trump's focus on robust national security measures, with Noem emphasizing strict immigration policies, border security, an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/kristi-noem-homeland-security-secretary/articleshow/118855814.cms",
    "timestamp": "2025-03-10T18:10:15Z"
  },
  {
    "title": "National Napping Day: Why was it started and its link to Daylight Savings Time",
    "description": "National Napping Day, observed on Monday after Daylight Savings Time begins, highlights the importance of rest as people adjust to losing an hour of sleep. Established in 1999, the day promotes the benefits of short naps, which improve mood, alertness, and pr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/national-napping-day-why-was-it-started-and-its-link-to-daylight-savings-time/articleshow/118856330.cms",
    "timestamp": "2025-03-10T18:09:50Z"
  },
  {
    "title": "Incoming NASA Administrator Brags That He Has No Idea What's Going On",
    "description": "It's been four months since president Donald Trump tapped billionaire tech founder — and SpaceX space tourist — Jared Isaacman as the new head of NASA. Isaacman has reportedly been preparing for his upcoming confirmation hearing in Washington, DC. But given h…",
    "link": "https://futurism.com/incoming-nasa-administrator-jared-isaacman-no-idea",
    "timestamp": "2025-03-10T18:09:47Z"
  },
  {
    "title": "Where Is Mahmoud Khalil?",
    "description": "Around 8:30 p.m. on March 8th, Mahmoud Khalil, a recent graduate of Columbia and a student leader in last year’s protest encampments, was returning to his University-owned apartment after an iftar meal when he was arrested by Department of Homeland Security a…",
    "link": "https://www.motherjones.com/politics/2025/03/mahmoud-khalil-student-protester-palestine-trump-deportation-columbia-shai-davidai/",
    "timestamp": "2025-03-10T18:09:28Z"
  },
  {
    "title": "Ukraine’s Zelenskyy arrives in Saudi Arabia for peace talks",
    "description": "Visit comes ahead of talks with the US this week, as Russia claims advances in Kursk region.",
    "link": "https://www.aljazeera.com/news/2025/3/10/ukraines-zelenskyy-arrives-in-saudi-arabia-for-peace-talks",
    "timestamp": "2025-03-10T18:09:26Z"
  },
  {
    "title": "Trump Targets Student Loan Relief for Workers at Progressive Nonprofits",
    "description": "The move “will have a chilling effect on our public service workforce,” said one civil rights attorney.",
    "link": "https://truthout.org/articles/trump-targets-student-loan-relief-for-workers-at-progressive-nonprofits/",
    "timestamp": "2025-03-10T18:09:26Z"
  },
  {
    "title": "Rubio says Ukraine partial ceasefire plan 'has promise' ahead of talks in Saudi Arabia",
    "description": "Russia has previously rejected a temporary ceasefire, calling it an attempt to buy time.",
    "link": "https://www.bbc.com/news/articles/cly4gldd5ljo",
    "timestamp": "2025-03-10T18:09:06Z"
  },
  {
    "title": "Scandal-scarred former Gov Andrew Cuomo is the frontrunner in NYC mayoral race",
    "description": "Former Gov. Andrew Cuomo, who resigned in 2021 amid multiple scandals, is the frontrunner in the 2025 New York City mayoral race, as incumbent Eric Adams' approval ratings continue to plummet.",
    "link": "https://www.foxnews.com/politics/scandal-scarred-former-governor-andrew-cuomo-front-runner-nyc-mayoral-race",
    "timestamp": "2025-03-10T18:09:01Z"
  },
  {
    "title": "Speaker Johnson Introduces Stopgap Funding Bill to Avoid Government Shutdown",
    "description": "House Speaker Mike Johnson will need every Republican vote he can get to pass his stopgap funding bill to avoid a government shutdown.\nThe post Speaker Johnson Introduces Stopgap Funding Bill to Avoid Government Shutdown appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/10/speaker-johnson-introduces-stopgap-funding-bill-avoid-government-shutdown/",
    "timestamp": "2025-03-10T18:08:53Z"
  },
  {
    "title": "Amazon to stream Trump’s ‘The Apprentice’ reality TV series | CNN Business",
    "description": "“The Apprentice,” the NBC reality show that propelled Donald Trump from real estate mogul to TV personality, is getting the streaming treatment at Amazon’s Prime Video.",
    "link": "https://www.cnn.com/2025/03/10/media/apprentice-trump-amazon-prime/index.html",
    "timestamp": "2025-03-10T18:07:51Z"
  },
  {
    "title": "Pentagon Officials 'Mystified' by Drone Incursions, New Clip Teases",
    "description": "The late-2024 drone sightings remain shrouded in mystery, despite the White House's assertion that these were authorized flights.",
    "link": "https://www.newsweek.com/pentagon-mystified-new-drone-sightings-2042249",
    "timestamp": "2025-03-10T18:06:43Z"
  },
  {
    "title": "Fake video shows Trump singing about Jesus while playing piano at White House",
    "description": "A video authentically showed U.S. President Donald Trump singing a song, titled, \"This Is Who Jesus Is to Me,\" while playing a piano on the North Lawn of the White House.",
    "link": "https://www.snopes.com//fact-check/trump-jesus-white-house-video/",
    "timestamp": "2025-03-10T18:05:00Z"
  },
  {
    "title": "Canada’s aluminum sector braces for long rough patch",
    "description": "Industry leaders now fear the worst: that Trump's tariffs are designed to destabilize the Canadian economy and deter investment here",
    "link": "https://financialpost.com/commodities/energy/canada-aluminum-sector-braces-tariffs",
    "timestamp": "2025-03-10T18:04:52Z"
  },
  {
    "title": "Report: Nicaragua Received $373.5 Million in Remittances from the U.S. in January",
    "description": "Nicaragua received $373.5 million worth of remittances originating from the United States in January 2025, the local newspaper La Prensa reported Monday.\nThe post Report: Nicaragua Received $373.5 Million in Remittances from the U.S. in January appeared first…",
    "link": "https://www.breitbart.com/latin-america/2025/03/10/report-nicaragua-received-373-5-million-in-remittances-from-the-u-s-in-january/",
    "timestamp": "2025-03-10T18:04:18Z"
  },
  {
    "title": "China, Iran, and Russia hold joint drills amid increased security cooperation",
    "description": "The News\nIran, China, and Russia began annual “Security Belt” military exercises in the Gulf of Oman Monday, underscoring the three nations’ security cooperation amid a shifting US foreign policy position under President Donald Trump.\nSince taking office in J…",
    "link": "https://biztoc.com/x/a2abbe36e2067331",
    "timestamp": "2025-03-10T18:04:18Z"
  },
  {
    "title": "Mahmoud Khalil: Trump Says Columbia Protester’s ICE Arrest Is First Of ‘Many To Come’—What We Know",
    "description": "The move comes days after the Trump administration announced it was pulling $400 million in funding from Columbia University.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/10/mahmoud-khalil-trump-says-columbia-protesters-ice-arrest-is-first-of-many-to-come-what-we-know/",
    "timestamp": "2025-03-10T18:03:29Z"
  },
  {
    "title": "Trump reacts to ‘The Apprentice’ seasons 1-7 streaming on Amazon Prime Video: ‘I look forward to watching’",
    "description": "Donald Trump's reality competition series is returning to streaming.",
    "link": "https://nypost.com/2025/03/10/entertainment/trump-reacts-to-the-apprentice-streaming-on-amazon-prime-video/",
    "timestamp": "2025-03-10T18:03:23Z"
  },
  {
    "title": "Watch BlackRock CEO Larry Fink speak live after deal to purchase Panama ports",
    "description": "BlackRock agreed earlier this month to purchase a 90% stake in the Panama Ports Company.",
    "link": "https://www.cnbc.com/2025/03/10/watch-blackrock-ceo-larry-fink-speak-live-after-deal-to-purchase-panama-ports.html",
    "timestamp": "2025-03-10T18:02:11Z"
  },
  {
    "title": "Marco Rubio Confirms Vast Majority Of USAID Programs Will Be Cancelled: 'Thank You To DOGE'",
    "description": "Secretary of State Marco Rubio said over 80% of all USAID programs will be cancelled, leaving some 1,000 standing",
    "link": "https://www.ibtimes.com/marco-rubio-confirms-vast-majority-usaid-programs-will-cancelled-thank-you-doge-3765817",
    "timestamp": "2025-03-10T18:01:26Z"
  },
  {
    "title": "Players Championship 2025: Scottie Scheffler's three-peat quest, Ludvig Åberg's ascension lead storylines",
    "description": "There's a lot to talk about at this week as action gets underway at TPC Sawgrass",
    "link": "https://www.cbssports.com/golf/news/players-championship-2025-scottie-schefflers-three-peat-quest-ludvig-abergs-ascension-lead-storylines/",
    "timestamp": "2025-03-10T18:00:58Z"
  },
  {
    "title": "Democratic senator says party is lacking leadership, strategy following defeat to Trump",
    "description": "Sen. Elissa Slotkin, D-Mich., who delivered her party's response to President Donald Trump's address to Congress last week, said that Democrats are facing internal struggles.",
    "link": "https://www.foxnews.com/media/democratic-senator-says-party-lacking-leadership-strategy-following-defeat-trump",
    "timestamp": "2025-03-10T18:00:54Z"
  },
  {
    "title": "Warren Buffett on Debt and Donald Trump's Money Moves: Trump 'Never Went Right'",
    "description": "Warren Buffett once warned students about the perils of excessive borrowing, citing Donald Trump as a case in point. What Happened: Buffett, during a 1991 Q&...",
    "link": "https://finance.yahoo.com/news/warren-buffett-debt-donald-trumps-180041469.html",
    "timestamp": "2025-03-10T18:00:41Z"
  },
  {
    "title": "Coffee Break: Across the Pond",
    "description": "This week's Europe/UK focused Coffee Break: German and Romanian election chicanery, UK snooping, why Western pols believe Ukraine can win.",
    "link": "https://www.nakedcapitalism.com/2025/03/coffee-break-across-the-pond-2.html",
    "timestamp": "2025-03-10T18:00:34Z"
  },
  {
    "title": "The work from home debate is 'dangerous territory' for politicians",
    "description": "Suddenly, working from home is being debated in Canberra. But who benefits if it becomes an election issue?",
    "link": "https://www.abc.net.au/news/2025-03-11/working-from-home-election-issue/104673182",
    "timestamp": "2025-03-10T18:00:00Z"
  },
  {
    "title": "Nasdaq, S&P 500, and Dow Jones plunge on Trump recession comments. But experts are more worried about inflation",
    "description": "Markets tumbled again on Monday after President Donald Trump said he won’t rule out an upcoming U.S. recession, sending skittish investors into another sell off fueled by whiplash over tariffs, and overall economic uncertainty.\n\n\n\nWhen asked, Trump told Fox N…",
    "link": "https://www.fastcompany.com/91294460/trump-recession-nasdaq-sp-500-dow-jones-plunge-experts-worried-about-inflation",
    "timestamp": "2025-03-10T18:00:00Z"
  },
  {
    "title": "Meet the federal worker who went rogue: ‘I hope that it lights a fire under people’",
    "description": "An email with the subject line, “A Spoon is Better than a Fork” went viral.",
    "link": "https://www.bostonherald.com/2025/03/10/federal-worker-rogue-email/",
    "timestamp": "2025-03-10T17:59:47Z"
  },
  {
    "title": "NASA begins its DOGE restructuring by firing workers and announcing 3 departments will be shut down",
    "description": "NASA told its employees that it will close three departments, including the Office of the Chief Scientist, as part of the agency's reorganization plans.",
    "link": "https://www.businessinsider.com/nasa-reduction-in-force-plans-department-closures-doge-firings-trump-2025-3",
    "timestamp": "2025-03-10T17:59:37Z"
  },
  {
    "title": "The GOP’s Next Target? No-Fault Divorce and Women’s Right to Leave",
    "description": "As the GOP ramps up its culture war, no-fault divorce is emerging as its latest target, with conservative politicians and activists calling for its restriction or elimination. While no-fault divorce has been law in all 50 states since 2010, its repeal would d…",
    "link": "https://msmagazine.com/2025/03/10/gop-no-fault-divorce-ban-womens-rights-trump-mike-johnson/",
    "timestamp": "2025-03-10T17:58:15Z"
  },
  {
    "title": "Dow sinks nearly 800 points, Nasdaq sheds 4% after Trump refuses to rule out recession",
    "description": "The Dow Jones Industrial Average, the Nasdaq Composite and the S&P 500 all posted significant declines on Monday, with tech leading the downturn.",
    "link": "https://nypost.com/2025/03/10/business/dow-sinks-700-points-nasdaq-sheds-4-after-trump-recession-comments/",
    "timestamp": "2025-03-10T17:56:54Z"
  },
  {
    "title": "Bank of Canada expected to cut interest rate on Wednesday as trade uncertainty with U.S. continues",
    "description": "The Bank of Canada is expected to cut its interest rate by 25 basis points on March 12, amid trade uncertainty with the U.S. Find out more.",
    "link": "https://financialpost.com/news/economy/bank-of-canada-cut-interest-rate-march-12",
    "timestamp": "2025-03-10T17:56:50Z"
  },
  {
    "title": "After landslide victory, Mark Carney meets with Trudeau as transition to power begins",
    "description": "Prime minister-designate Mark Carney is meeting with Prime Minister Justin Trudeau Monday as the new Liberal leader takes the reins of power after a landslide victory in Sunday's party election.",
    "link": "https://www.cbc.ca/news/politics/mark-carney-day-1-1.7479519",
    "timestamp": "2025-03-10T17:56:24Z"
  },
  {
    "title": "Elon Musk Calls Sen. Mark Kelly 'A Traitor' After Visiting Ukraine",
    "description": "Kelly, a former U.S. Navy combat pilot and astronaut, urged the U.S. not to abandon Ukraine after his third visit to the country since 2023.",
    "link": "https://www.huffpost.com/entry/elon-musk-mark-kelly-ukraine_n_67cf15f2e4b04dd3a4e58936",
    "timestamp": "2025-03-10T17:55:01Z"
  },
  {
    "title": "Daylight Saving Time: A Metaphor for Government Idiocy",
    "description": "In the wee, small hours of Sunday morning, most of the United States engaged in the semiannual idiocy known as Daylight Saving Time.  “The typical... Read More\nThe post Daylight Saving Time: A Metaphor for Government Idiocy appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/10/daylight-saving-time-metaphor-government-idiocy/",
    "timestamp": "2025-03-10T17:54:35Z"
  },
  {
    "title": "Ontario Premier Doug Ford's power play",
    "description": "Premier Doug Ford has announced the price increase on the electricity the province sends to 1.5 million homes in three U.S. states as one of Ontario's retaliatory measures against tariffs imposed on Canadian goods by President Donald Trump.",
    "link": "https://www.nationalobserver.com/2025/03/10/news/ontario-premier-doug-ford-power-electricity-surchargeplay",
    "timestamp": "2025-03-10T17:54:06Z"
  },
  {
    "title": "This AI tool could give newsrooms “eyes and ears where they don’t have them”",
    "description": "Joe Rogan is, if nothing else, prolific. He’s published 2,286 episodes in the 15-ish years he’s been making his podcast, at an average of a little over two and a half hours each. New episodes drop three or four times a week, which means getting the full Joe R…",
    "link": "https://www.niemanlab.org/2025/03/this-ai-tool-could-give-newsrooms-eyes-and-ears-where-they-dont-have-them/",
    "timestamp": "2025-03-10T17:54:02Z"
  },
  {
    "title": "Trump rejects pleas from business for more clarity on tariffs",
    "description": "President Donald Trump has dismissed the growing chorus of CEOs, investors and policymakers who are pleading with the White House for greater clarity about his sweeping tariff agenda.",
    "link": "https://biztoc.com/x/33608ce5869e1f23",
    "timestamp": "2025-03-10T17:53:23Z"
  },
  {
    "title": "Who are Johnson's remaining GOP holdouts on the spending bill?",
    "description": "Speaker Mike Johnson is trying to muscle through a stopgap spending bill to avert a government shutdown, but he doesn't have the votes locked down yet. \nPresident Donald Trump is pressing the small group of GOP holdouts to fall in line ahead of the Friday shu…",
    "link": "https://biztoc.com/x/7272e159066b32bb",
    "timestamp": "2025-03-10T17:53:20Z"
  },
  {
    "title": "Thanks To Trump, The Land Of The Free Is Now Just An Aspiring Autocracy",
    "description": "Anyone paying attention to the first Trump term (and who wasn’t?) saw the latent threat to democracy buried only slightly beneath the bluster and spray-on tan. Here was a man who spent years building a mythology that presented him as the ultimate deal maker, …",
    "link": "https://www.techdirt.com/2025/03/10/thanks-to-trump-the-land-of-the-free-is-now-just-an-aspiring-autocracy/",
    "timestamp": "2025-03-10T17:52:48Z"
  },
  {
    "title": "Canada's Mark Carney Rips Trump In Blistering Speech, Refuses To 'Kneel' And Be 'Conquered'",
    "description": "Canada's next prime minister said the U.S. is “a country we can no longer trust” and that higher tariffs would continue “until the Americans show us respect.”",
    "link": "https://www.huffpost.com/entry/mark-carney-speech-canada-trump_n_67cf0407e4b04dd3a4e57354",
    "timestamp": "2025-03-10T17:51:50Z"
  },
  {
    "title": "Oil Change Response to Energy Secretary Chris Wright’s Speech at Major Oil and Gas Conference",
    "description": "In response to U.S. Energy Secretary and former fracking CEO Chris Wright’s opening remarks at CERAWeek, the fossil fuel industry’s largest annual conference, Allie Rosenbluth, United States Campaign Manager at Oil Change International, said: “Chris Wright, a…",
    "link": "https://www.commondreams.org/oil-change-response-to-energy-secretary-chris-wrights-speech-at-major-oil-and-gas-conference",
    "timestamp": "2025-03-10T17:51:48Z"
  },
  {
    "title": "Van Jones Attacks Fellow Dems for Defending ‘Broken Status Quo’: ‘We’re Screwed’",
    "description": "CNN commentator Van Jones had some choice words for his fellow Democrats Sunday night when asked for his take on the current state of the party, saying his pals on the left “don’t know what to do.” It all started on CNN Newsroom Sunday when anchor Jessica Dea…",
    "link": "https://www.mediaite.com/tv/van-jones-attacks-fellow-dems-for-defending-broken-status-quo-were-screwed/",
    "timestamp": "2025-03-10T17:49:50Z"
  },
  {
    "title": "The JFK Assassination Plot That Failed",
    "description": "A recent book details a little-known plot to assassinate John F. Kennedy shortly after his 1960 electoral victory.",
    "link": "https://www.newsweek.com/jfk-assassination-plot-that-failed-2042190",
    "timestamp": "2025-03-10T17:49:44Z"
  },
  {
    "title": "'Genocide Alert!' Israel Slammed for Cutting Off Power to Gaza Water Plant",
    "description": "Outrage over the Israeli government's decision to cut off electricity to a water treatment plant in the decimated Gaza Strip mounted on Monday.\n\nAs \nCommon Dreams reported Sunday, Israeli Energy Minister Eli Cohen said that he \"signed an order for the immedia…",
    "link": "https://www.commondreams.org/news/gaza-electricity",
    "timestamp": "2025-03-10T17:46:34Z"
  },
  {
    "title": "US Congress scrambles to avert weekend government shutdown",
    "description": "WASHINGTON: US lawmakers raced Monday (Mar 10)  to avert a weekend government shutdown with a funding deal loudly backed by President Donald Trump as he pushes a polarising plan to drasti",
    "link": "https://www.channelnewsasia.com/world/us-congress-scrambles-avert-weekend-government-shutdown-4991361",
    "timestamp": "2025-03-10T17:46:27Z"
  },
  {
    "title": "Exclusive-Apple, Meta likely to face modest fines over DMA breaches, sources say",
    "description": "BRUSSELS :Apple and Meta Platforms are set to face modest fines for allegedly breaching landmark rules aimed at reining in their power, people with direct knowledge of the matter said on Monday.Both companies have been in the European Commission's crosshairs …",
    "link": "https://www.channelnewsasia.com/business/exclusive-apple-meta-likely-face-modest-fines-over-dma-breaches-sources-say-4991386",
    "timestamp": "2025-03-10T17:46:05Z"
  },
  {
    "title": "Elon Musk’s Net Worth Plummets As Tesla Stock Tanks — Down Nearly $140 Billion Since December",
    "description": "\"$139.4 billion. That’s how much lower Musk’s $324.6 billion net worth is than his record $464 billion set in December, according to our latest calculations\"\nThe post Elon Musk’s Net Worth Plummets As Tesla Stock Tanks — Down Nearly $140 Billion Since Decembe…",
    "link": "https://www.mediaite.com/news/elon-musks-net-worth-plummets-as-tesla-stock-tanks-down-nearly-140-billion-since-december/",
    "timestamp": "2025-03-10T17:45:59Z"
  },
  {
    "title": "Elon Musk’s X hit by waves of outages in what he claims is ‘a massive cyberattack’ | CNN Business",
    "description": "Elon Musk’s X has been hit by three waves of outages since this morning, which the billionaire said was due to a cyberattack.",
    "link": "https://www.cnn.com/2025/03/10/tech/elon-musk-x-outages/index.html",
    "timestamp": "2025-03-10T17:44:26Z"
  },
  {
    "title": "WATCH: DC Crew Begins Dismantling Black Lives Matter Plaza",
    "description": "A Washington, D.C., maintenance crew began dismantling Black Lives Matter Plaza, which will be replaced with a project celebrating America's 250th anniversary that includes artwork by local artists.\nThe post WATCH: DC Crew Begins Dismantling Black Lives Matte…",
    "link": "https://freebeacon.com/politics/watch-dc-crew-begins-dismantling-black-lives-matter-plaza/",
    "timestamp": "2025-03-10T17:44:06Z"
  },
  {
    "title": "You'll Be Surprised at What Crypto Scammer Sam Bankman-Fried Says Being Jailed Next to Diddy is Like",
    "description": "Sam Bankman-Fried, the crypto fraudstercurrently serving 25 years in prison for his crimes, recently opened about being in the same jail as Sean “Diddy” Combs. Both men are being held at Brooklyn’s Metropolitan Detention Center. Read more...",
    "link": "https://www.theroot.com/youll-be-surprised-at-what-crypto-scammer-sam-bankman-f-1851768849",
    "timestamp": "2025-03-10T17:43:58Z"
  },
  {
    "title": "How government and industry can team up to make the technology safer without hindering innovation",
    "description": "Imagine a not-too-distant future where you let an intelligent robot manage your finances. It knows everything about you. It follows your moves, analyzes markets, adapts to your goals and invests faster and smarter than you can. Your investments soar. But then…",
    "link": "https://techxplore.com/news/2025-03-industry-team-technology-safer-hindering.html",
    "timestamp": "2025-03-10T17:43:54Z"
  },
  {
    "title": "Trump rejects pleas from business for more clarity on tariffs: 'They always say that'",
    "description": "President Donald Trump has dismissed the growing chorus of CEOs, investors and policymakers who are pleading with the White House for greater clarity about his sweeping tariff agenda.",
    "link": "https://www.nbcnews.com/business/business-news/trump-rejects-pleas-business-clarity-tariffs-always-say-rcna195661",
    "timestamp": "2025-03-10T17:43:22Z"
  },
  {
    "title": "Secretary Of State Rubio Says Purge Of USAID Complete, Almost All Gone",
    "description": "The abrupt shutdown stranded many staffers and their families overseas, many of them awaiting U.S.-paid back payments and travel expenses back home.",
    "link": "https://www.huffpost.com/entry/usaid-purge-complete-rubio-trump_n_67cf20cde4b04dd3a4e59aa2",
    "timestamp": "2025-03-10T17:43:21Z"
  },
  {
    "title": "Contributor: Democrats, do not ignore Stephen A. Smith",
    "description": "Hear me on this: Stephen A. Smith is no joke. Democrats, do not underestimate him. Do not mock him. Do not take him lightly. Do not ignore him. Do I think the face of ESPN (who, according to multiple sources, just inked a five-year, $100-million contract exte…",
    "link": "https://freerepublic.com/focus/f-news/4303358/posts",
    "timestamp": "2025-03-10T17:41:59Z"
  },
  {
    "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
    "description": "By PAUL WISEMAN, AP Economics Writer\nWASHINGTON (AP) — China retaliated against President Donald Trump’s tariffs with an additional 15% tax on key American farm products, including chicken, pork, soybeans and beef.\nThe escalating trade tensions punished U.S. …",
    "link": "https://biztoc.com/x/0424463d60033dd7",
    "timestamp": "2025-03-10T17:41:56Z"
  },
  {
    "title": "Repurposing of CBP One App Now Lets Illegals Deport Themselves",
    "description": "The Biden administration's controversial CBP One app has been transformed into the new CBP Home app, allowing undocumented immigrants to self-deport. This shift aims to restore integrity to the immigration system.\nThe post Repurposing of CBP One App Now Lets …",
    "link": "https://www.thegatewaypundit.com/2025/03/repurposing-cbp-one-app-now-lets-illegals-deport/",
    "timestamp": "2025-03-10T17:40:03Z"
  },
  {
    "title": "Trump says a transition period for the economy is likely: 'You can't really watch the stock market' (Jeff Cox/CNBC)",
    "description": "Jeff Cox / CNBC:\nTrump says a transition period for the economy is likely: 'You can't really watch the stock market' … WATCH NOW  —  President Donald Trump and other senior White House officials have spent the past several days bracing Americans for a potenti…",
    "link": "https://www.memeorandum.com/250310/p79",
    "timestamp": "2025-03-10T17:40:00Z"
  },
  {
    "title": "Hundreds Protest Outside Tesla Dealership, Storm Building",
    "description": "Hundreds of protestors gathered outside a Tesla dealership in Lower Manhattan on Saturday, remaining there for two hours and effectively shutting down the location, the New York Times reports, with some even storming the building. The demonstration is among t…",
    "link": "https://futurism.com/hundreds-protest-tesla-dealership",
    "timestamp": "2025-03-10T17:38:52Z"
  },
  {
    "title": "Zelenskyy arrives in Saudi Arabia to meet prince ahead of summit with U.S.",
    "description": "Ukrainian President Volodymyr Zelenskyy has arrived in Saudi Arabia to visit the oil-rich kingdom’s crown prince ahead of his team's meeting with America’s top diplomat on Tuesday.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-arrives-in-saudi-arabia-to-meet-prince-ahead-of-summit-with-u-s",
    "timestamp": "2025-03-10T17:38:15Z"
  },
  {
    "title": "Trump Team Repurposes CBP One App into Self-Deportation Tool",
    "description": "The Trump administration has announced that the former CBP One app, used by migrants to enter the United States under the prior Biden regime, will be repurposed into a self-deportation app. Renamed the CBP Home app, it will allow illegals to submit informatio…",
    "link": "https://freerepublic.com/focus/f-news/4303355/posts",
    "timestamp": "2025-03-10T17:37:55Z"
  },
  {
    "title": "The Government-Shutdown Vote Is a GOP Trap for Democrats",
    "description": "Mike Johnson and Republicans have set a trap for Democrats on government funding by counting on their fear to get blamed for a shutdown. But if they surrender, Democrats will have lost the only leverage they have in Trump’s Washington.",
    "link": "http://nymag.com/intelligencer/article/government-shutdown-vote-republican-trap-for-democrats.html",
    "timestamp": "2025-03-10T17:37:47Z"
  },
  {
    "title": "'Hurting people to help themselves': Dem senator disses DOGE's CFPB cuts",
    "description": "Sen. Tim Kaine, D-Va., met with Consumer Financial Protection Bureau (CFPB) employees on Friday who were fired as a result of Elon Musk’s DOGE federal workforce reductions.",
    "link": "https://www.foxnews.com/politics/hurting-people-help-themselves-dem-senator-disses-doges-cfpb-cuts",
    "timestamp": "2025-03-10T17:37:30Z"
  },
  {
    "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
    "description": "The escalating trade tensions pushed stocks lower on Monday.",
    "link": "https://www.bostonherald.com/2025/03/10/china-us-tariffs/",
    "timestamp": "2025-03-10T17:37:27Z"
  },
  {
    "title": "\"First Of Many To Come\": Trump On Arrest Of Pro-Palestinian Columbia Student",
    "description": "US President Donald Trump said on Monday that the arrest of a Palestinian graduate student who has played a prominent role in pro-Palestinian protests at New York&#039;s Columbia University will be followed by others.",
    "link": "https://www.ndtv.com/world-news/first-of-many-to-come-trump-on-arrest-of-pro-palestinian-columbia-student-7894352",
    "timestamp": "2025-03-10T17:37:15Z"
  },
  {
    "title": "Diane Francis: Carney must call an election immediately",
    "description": "The ascension of Mark Carney is an example of the Liberal elite capture that’s robbed Canada of growth and independence. Read more here",
    "link": "https://financialpost.com/diane-francis/diane-francis-carney-must-call-an-election-immediately",
    "timestamp": "2025-03-10T17:36:57Z"
  },
  {
    "title": "US stocks drop sharply as Trump hedges on recession",
    "description": "All three major U.S. stock indexes dropped sharply in Monday morning trading, with investors worried about the uncertainty of tariffs imposed by President Donald Trump on key trading partners and then his refusal to rule out the possibility of a U.S. recessio…",
    "link": "https://www.voanews.com/a/us-stocks-drop-sharply-as-trump-hedges-on-recession-/8005502.html",
    "timestamp": "2025-03-10T17:36:32Z"
  },
  {
    "title": "GOP Rep. Bacon: Trump ‘Playing into the Hands of Putin’– It Will Be ‘Devastating’ for Years to Come",
    "description": "Representative Don Bacon (R-NE) said Monday on CNN’s “The Situation Room” that President Donald Trump was playing into the hands of Russian President Vladimir Putin in the Ukraine conflict. Host Pamela Brown said, “Ukrainian President Zelensky will also be in…",
    "link": "https://freerepublic.com/focus/f-news/4303354/posts",
    "timestamp": "2025-03-10T17:35:28Z"
  },
  {
    "title": "Trump Tariffs to Be Weighed in March Farm Crop Report, USDA Says",
    "description": "A closely watched crop report due Tuesday will take existing trade tariffs into account as part of global forecasts for the world’s corn, soybeans and other farm products.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-to-be-weighed-in-march-farm-crop-report-usda-says",
    "timestamp": "2025-03-10T17:35:23Z"
  },
  {
    "title": "Bitcoin Posts 12% Weekly Loss as Crypto Liquidations Top $700 Million",
    "description": "“Many of the recent liquidations likely stem from inexperienced traders who entered the market during the “extreme greed” phase,\" an analyst said.",
    "link": "https://decrypt.co/309366/bitcoin-weekly-loss-crypto-liquidations-top-700-million",
    "timestamp": "2025-03-10T17:33:38Z"
  },
  {
    "title": "Ontario slaps 25% tax increase on electricity exports to U.S. in response to Trump's trade war",
    "description": "Ontario Premier Doug Ford said that the province will charge 25% more for electricity to 1.5 million Americans in response to President Donald Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/03/10/ontario-slaps-25percent-tax-increase-on-electricity-exports-to-us-in-response-to-trumps-trade-war-.html",
    "timestamp": "2025-03-10T17:33:19Z"
  },
  {
    "title": "Was a CCP Influence Operation Behind RedNote’s US Surge?",
    "description": "The surge in TikTok refugees looks to have been a major success for a new CCP technique: perspective hacking.",
    "link": "https://thediplomat.com/2025/03/was-a-ccp-influence-operation-behind-rednotes-us-surge/",
    "timestamp": "2025-03-10T17:33:00Z"
  },
  {
    "title": "Donald Trump Reacts to ICE Arrest of Columbia Graduate Mahmoud Khalil",
    "description": "President Donald Trump reacted on Monday afternoon the arrest of Mahmoud Khalil, a Palestinian who recently completed his graduate studies at Columbia University and played a leading role in campus protests last year.\nTrump posted on Truth Social, \"Following …",
    "link": "https://biztoc.com/x/489c86cc5da9fe1b",
    "timestamp": "2025-03-10T17:31:41Z"
  },
  {
    "title": "Son Calls Out Donald Trump After Father's ICE Arrest Outside School",
    "description": "The son of a man detained by ICE outside a Michigan school is speaking out, slamming President Donald Trump's immigration policies for ripping his family apart.\n\"President Trump, I'm sorry, but you are the worst president we've ever had. And just from the fir…",
    "link": "https://biztoc.com/x/f09d0e49099497e7",
    "timestamp": "2025-03-10T17:31:34Z"
  },
  {
    "title": "Investors flee equities as Trump-driven uncertainty sparks economic worry",
    "description": "In This Article:\nBy Lewis Krauskopf\nNEW YORK (Reuters) - Fears that uncertainty over trade tariffs will spark an economic downturn are causing investors to flee equities, in a major shift for Wall Street which had been fired-up by the prospect of President Do…",
    "link": "https://biztoc.com/x/aed857cb246c1f1e",
    "timestamp": "2025-03-10T17:31:31Z"
  },
  {
    "title": "If Trump closes the Education Department, what happens to student loans?",
    "description": "President Donald Trump is expected to act soon on his promise to dismantle the federal Department of Education, the agency that supplies a small percentage of funding to public schools, enforces anti-discrimination laws, and administers the Student Aid Progra…",
    "link": "https://biztoc.com/x/725d2463eb4460a3",
    "timestamp": "2025-03-10T17:31:18Z"
  },
  {
    "title": "Trump urged to appoint NI special envoy to support US interests after Kennedy departure",
    "description": "Two congressmen call for envoy to give US companies certainty over investments",
    "link": "https://www.irishtimes.com/politics/2025/03/10/trump-urged-to-appoint-ni-special-envoy-to-support-us-interests-after-kennedy-departure/",
    "timestamp": "2025-03-10T17:31:15Z"
  },
  {
    "title": "Hours Of Spacewalk, Gardening: How Sunita Williams Is Spending Time In Space",
    "description": "Indian-origin NASA astronaut Sunita Williams (Suni), who has been dubbed as the &quot;stranded astronaut&quot; over his stay in space since June last year, has done some &quot;amazing experiments&quot; and indulged in over 900 hours of research.",
    "link": "https://www.ndtv.com/world-news/sunita-williams-news-return-spending-time-in-space-spacewalk-return-to-earth-international-space-station-7894324",
    "timestamp": "2025-03-10T17:30:50Z"
  },
  {
    "title": "Trump Says Tariff Tension With Mexico, Canada Good for World Cup",
    "description": "President Donald Trump said his trade disputes with Mexico and Canada would be good for the 2026 World Cup co-hosted with those two nations as he signed an executive order to create a task force to assist in organizing the tournament.\n“Tension is a good thing…",
    "link": "https://biztoc.com/x/9e617d9579cf98bf",
    "timestamp": "2025-03-10T17:30:44Z"
  },
  {
    "title": "Canada Says It Will “Win” The Trade War With The U.S.",
    "description": "Canada’s incoming liberal Prime Minister, Mark Carney, has vowed to \"win\" the trade war with the United States, warning that retaliatory tariffs will remain in place until “Americans show us respect.” As if anyone could \"win\" an economic war, Carney and U.S. …",
    "link": "https://www.shtfplan.com/headline-news/canada-says-it-will-win-the-trade-war-with-the-u-s",
    "timestamp": "2025-03-10T17:30:07Z"
  },
  {
    "title": "‘First Arrest of Many’: Trump Promises More Arrests of Pro-Palestinian Protestors on College Campuses",
    "description": "Trump boasted about the arrest of a pro-Palestinian protestor, Mahmoud Khalil, whom he described as \"a Radical Foreign Pro-Hamas Student\" at Columbia.\nThe post ‘First Arrest of Many’: Trump Promises More Arrests of Pro-Palestinian Protestors on College Campus…",
    "link": "https://www.mediaite.com/trump/first-arrest-of-many-trump-promises-more-arrests-of-pro-palestinian-protestors-on-college-campuses/",
    "timestamp": "2025-03-10T17:30:03Z"
  },
  {
    "title": "Loblaw to roll out ‘tariff’ symbols on products seeing higher prices due to trade war",
    "description": "As grocers increasingly highlight Canadian products amid a trade war with the U.S., Loblaw is rolling out new symbols alongside prices that include an indication that a product’s price has been affected by retaliatory tariffs. Customers could notice the chang…",
    "link": "https://financialpost.com/pmn/loblaw-to-roll-out-tariff-symbols-on-products-seeing-higher-prices-due-to-trade-war",
    "timestamp": "2025-03-10T17:30:03Z"
  },
  {
    "title": "Open social web browser Surf integrates with Bluesky in latest beta",
    "description": "Surf, the new app from Flipboard for browsing the open social web, is expanding its support for Bluesky’s social network. On Monday, the company announced a new version of its beta software (dubbed “Blue Wave”) which allows users to log into the app using the…",
    "link": "https://techcrunch.com/2025/03/10/open-social-web-browser-surf-integrates-with-bluesky-in-latest-beta/",
    "timestamp": "2025-03-10T17:30:00Z"
  },
  {
    "title": "U.S. SEC's Acting Chair Walking Back Agency Proposal on Crypto Trading Platforms",
    "description": "The securities regulator's long-delayed rule expanding the scope of certain trading platforms shouldn't have tried to include crypto, Mark Uyeda argues.",
    "link": "https://www.coindesk.com/policy/2025/03/10/u-s-sec-s-acting-chair-walking-back-agency-proposal-on-crypto-trading-platforms",
    "timestamp": "2025-03-10T17:30:00Z"
  },
  {
    "title": "U.S. Supreme Court Rules In Favor Of Climate Lawsuits",
    "description": "The U.S. Supreme Court on Monday rejected a bid by Republican-led states to block lawsuits brought by Democratic-led states seeking to hold oil and gas companies accountable for climate change. The court's decision to stay out of the dispute allows California…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Supreme-Court-Rules-In-Favor-Of-Climate-Lawsuits.html",
    "timestamp": "2025-03-10T17:30:00Z"
  }
]