[
  {
    "title": "Trump pauses enforcement, orders review of foreign corruption act",
    "description": "WASHINGTON — President Donald Trump has ordered a pause and review of a law that has defined the activities of U.S. business overseas for nearly five decades, claiming that the strict prohibitions against bribing foreign officials strangle American competitiv…",
    "link": "https://www.voanews.com/a/trump-pauses-enforcement-orders-review-of-foreign-corruption-act-/7971485.html",
    "timestamp": "2025-02-12T01:02:30Z"
  },
  {
    "title": "Trump tariffs may disadvantage Korean TV makers Samsung and LG as Chinese rivals gain subsidized edge",
    "description": "Samsung Electronics and LG Electronics face mounting challenges from former US President Donald Trump's tariff policies. South Korean industry insiders warn that if the US imposes a 25% tariff on products manufactured in Mexico, Samsung and LG—both with produ…",
    "link": "https://www.digitimes.com/news/a20250211PD202/samsung-tv-production-tariff-lg.html",
    "timestamp": "2025-02-12T01:01:57Z"
  },
  {
    "title": "Her parents were injured in a Tesla crash. She ended up having to pay Tesla damages",
    "description": "Zhang Yazhou was sitting in the passenger seat of her Tesla Model 3 when she said she heard her father’s panicked voice: The brakes don’t work!  Stunned...",
    "link": "https://www.yahoo.com/news/her-parents-were-injured-tesla-010111764.html",
    "timestamp": "2025-02-12T01:01:11Z"
  },
  {
    "title": "Hollywood insiders say Trump's return has a chilling effect on film industry",
    "description": "An LA Times writer reported that according to insiders, President Donald Trump's return to power has caused a chilling effect that is impeding liberal projects in Hollywood.",
    "link": "https://www.foxnews.com/media/hollywood-insiders-say-trumps-return-has-chilling-effect-film-industry",
    "timestamp": "2025-02-12T01:00:50Z"
  },
  {
    "title": "Abra CEO Unveils Massive ‘Base Case’ Price Targets for Bitcoin, Ethereum, Solana and Sui",
    "description": "The chief executive of crypto exchange Abra believes Bitcoin (BTC) and other top digital assets may hit massive price targets this cycle for one main reason. Bill Barhydt says that economic policies under US President Donald Trump may inject a huge amount of …",
    "link": "https://dailyhodl.com/2025/02/11/abra-ceo-unveils-massive-base-case-price-targets-for-bitcoin-ethereum-solana-and-sui/",
    "timestamp": "2025-02-12T01:00:45Z"
  },
  {
    "title": "How Trump Plans To Make Enemy FBI Staffers’ ‘Lives a Living Hell’",
    "description": "Trump and his administration have developed plans to punish disloyal FBI staffers, even before Kash Patel is confirmed to lead the bureau.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-fbi-staffers-enemies-kash-patel-1235264331/",
    "timestamp": "2025-02-12T01:00:42Z"
  },
  {
    "title": "Cardano’s Hoskinson Slams USAID For Backing Book Linking Bitcoin To Extremism",
    "description": "The United States Agency for International Development (USAID) is under fire right now as US President Donald Trump and his adviser, Elon Musk, implement their bureaucratic cost-cutting campaign. Related Reading: Bitcoin Treasury Firm Metaplanet Is Japan’s Ho…",
    "link": "https://bitcoinist.com/hoskinson-slams-usaid-for-backing-book-linking-bitcoin-to-extremism/",
    "timestamp": "2025-02-12T01:00:41Z"
  },
  {
    "title": "North Korea condemns Trump's Gaza takeover proposal as 'ludicrous'",
    "description": "North Korean state media on Wednesday denounced US President Donald Trump's proposal to take over Gaza and rel",
    "link": "https://www.jpost.com/breaking-news/article-841741",
    "timestamp": "2025-02-12T01:00:27Z"
  },
  {
    "title": "China To Allow Market Forces To Dictate Clean Energy Prices",
    "description": "China is looking to modernize its renewable energy sector by leaving the prices of clean energy to the whims of the markets rather than being dictated by the government. China’s National Development and Reform Commission (NDRC) and the National Energy Adminis…",
    "link": "https://oilprice.com/Alternative-Energy/Renewable-Energy/China-To-Allow-Market-Forces-To-Dictate-Clean-Energy-Prices.html",
    "timestamp": "2025-02-12T01:00:00Z"
  },
  {
    "title": "With China, Trump can’t be aggressive towards Africa – Ex-Ambassador, Igali",
    "description": "Dr Godknows Igali is a former Nigeria Ambassador to Sweden, Denmark and Norway. He is also the First Vice President of the Academy of International Affairs of Nigeria. In this interview with WALE AKINSELURE, he speaks on the recent exit of Niger, Burkina Faso…",
    "link": "https://punchng.com/with-china-trump-cant-be-aggressive-towards-africa-ex-ambassador-igali/",
    "timestamp": "2025-02-12T00:59:36Z"
  },
  {
    "title": "Trump Orders DOGE to Slash Federal Workforce",
    "description": "Musk: \"Competence and caring are needed to cut the budget deficit in half.\"\nThe post Trump Orders DOGE to Slash Federal Workforce first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/trump-orders-doge-to-slash-federal-workforce/",
    "timestamp": "2025-02-12T00:59:17Z"
  },
  {
    "title": "Conspiracy theory nation",
    "description": "The combination of popular alt-right bro podcasters and alt-right social media moguls bent on amplifying right-wing misinformation to the greatest extent possible is bad indeed: Shawn Ryan built one of the country’s most popular podcasts, interviewed US Presi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/conspiracy-theory-nation",
    "timestamp": "2025-02-12T00:59:16Z"
  },
  {
    "title": "Ronald Rowe, head of the Secret Service’s Washington Field Office, is resigning.",
    "description": "This comes just days after Donald Trump requested all information on previous assassination attempts against him.",
    "link": "https://freerepublic.com/focus/f-news/4296871/posts",
    "timestamp": "2025-02-12T00:58:31Z"
  },
  {
    "title": "AMERICA Prayer Vigil February 12, 2025 ~PRAYER~",
    "description": "Join with fellow FREEPERS across the world to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business, Healthcare, Education, Churches, Technology, Religious Freedom and the Media. \"I urge, then, first of all, that re…",
    "link": "https://freerepublic.com/focus/f-religion/4296870/posts",
    "timestamp": "2025-02-12T00:56:46Z"
  },
  {
    "title": "Board of Supervisors fails to advance proposal supporting federal transgender athlete ban",
    "description": "In a board letter, Supervisor Jim Desmond proposed directing the chief administrative officer to express support for U.S. House Resolution 28, a bill that bans transgender women from competing in female sports.",
    "link": "https://www.kpbs.org/news/racial-justice-social-equity/2025/02/11/board-of-supervisors-fails-to-advance-proposal-supporting-federal-transgender-athlete-ban",
    "timestamp": "2025-02-12T00:55:48Z"
  },
  {
    "title": "Nigeria will survive Trump’s healthcare policy changes – FG",
    "description": "The Coordinating Minister of Health and Social Welfare, Prof Ali Pate, says he believes Nigeria will overcome the new policy changes by the United States President Donald Trump, halting healthcare assistance to developing countries. He expressed optimism on T…",
    "link": "https://punchng.com/nigeria-will-survive-trumps-healthcare-policy-changes-fg/",
    "timestamp": "2025-02-12T00:55:31Z"
  },
  {
    "title": "LSU president says it was his call to suspend professor who criticized Jeff Landry, Donald Trump",
    "description": "LSU President William Tate IV said from the witness stand Tuesday \"it was my decision\" to suspend Ken Levy, the law professor who used vulgar language to criticize Gov. Jeff Landry and President Donald Trump.",
    "link": "https://www.theadvocate.com/baton_rouge/news/education/lsu-president-william-tate-says-he-made-decision-to-suspend-lsu-law-professor45fd6/article_45c338f7-21a5-5106-b0b4-d5398df10d90.html",
    "timestamp": "2025-02-12T00:55:00Z"
  },
  {
    "title": "How do we cover Trump 2.0?",
    "description": "What’s our rule of thumb for covering the new Trump administration? Treat everything the president says as bullshit and then work backwards.\nThe post How do we cover Trump 2.0? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/12/crikey-insider-donald-trump-2-0-coverage/",
    "timestamp": "2025-02-12T00:54:34Z"
  },
  {
    "title": "Boeing Starliner astronauts returning earlier than expected — NASA swaps spacecraft to accelerate SpaceX Crew-10 relief mission to ISS",
    "description": "NASA will return Starliner astronauts to Earth early along with their Crew-9 companions, after deciding to swap Crew-10 spacecraft to launch the SpaceX mission sooner.",
    "link": "https://www.space.com/space-exploration/boeing-starliner-astronauts-returning-earlier-than-expected-nasa-swaps-spacecraft-to-accelerate-spacex-crew-10-relief-mission-to-iss",
    "timestamp": "2025-02-12T00:53:41Z"
  },
  {
    "title": "First US Navy ships sail through Taiwan Strait since Trump inauguration",
    "description": "BEIJING: Two United States Navy ships sailed through the sensitive Taiwan Strait this week in the first such mission since President Donald Trump took office last month, drawing an angry reaction from China, which said the mission increased security risks. Th…",
    "link": "https://www.channelnewsasia.com/world/us-navy-ship-sail-taiwan-strait-china-reaction-4932216",
    "timestamp": "2025-02-12T00:50:47Z"
  },
  {
    "title": "‘Hallelujah, Fantastic News’: Massive Trump Critic Gives Trump A Nod On MSNBC For Diplomatic Success",
    "description": "Michael McFaul, who served under former President Barack Obama's administration, praised President Donald Trump during a Tuesday appearance on MSNBC.",
    "link": "https://dailycaller.com/2025/02/11/michael-mcfaul-trump-mark-fogel-release/",
    "timestamp": "2025-02-12T00:50:01Z"
  },
  {
    "title": "American Teacher Marc Fogel Released From Russian Prison After 3.5 Years",
    "description": "The 63-year-old is meeting with President Donald Trump upon his arrival on U.S. soil.",
    "link": "https://www.huffpost.com/entry/marc-fogel-teacher-released-russian-prison_n_67abd1c5e4b03d52c7ead3f8",
    "timestamp": "2025-02-12T00:48:19Z"
  },
  {
    "title": "Coast Guard intercepts ‘overloaded’ boat filled with migrants, ships them straight back home (Haitians!)",
    "description": "The US Coast Guard cut off an “overloaded” boat packed with 132 Haitian migrants about 50 miles off the Florida coastline — and shipped them back home on Monday, officials said. The Coast Guard Cutter Escanaba intercepted the 30-foot sailboat last week betwee…",
    "link": "https://freerepublic.com/focus/f-news/4296869/posts",
    "timestamp": "2025-02-12T00:47:44Z"
  },
  {
    "title": "MSNBC Cuts Airtime on Elon Musk’s Oval Office Address: ‘Irony Died While He Was Talking’ | Video",
    "description": "Nicolle Wallace and colleagues fact-check the “co-president’s” lengthy comments regarding the role of DOGE\nThe post MSNBC Cuts Airtime on Elon Musk’s Oval Office Address: ‘Irony Died While He Was Talking’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elon-musk-oval-office-doge-speech-nicolle-wallace-fact-check-msnbc/",
    "timestamp": "2025-02-12T00:47:15Z"
  },
  {
    "title": "Trump fires USAID's inspector general after his office released a report critical of the administration",
    "description": "Paul Martin's office had released a report this week detailing the negative impact of the Trump administration’s push for drastic cuts at the agency.",
    "link": "https://www.nbcnews.com/politics/politics-news/usaid-inspector-general-fired-releasing-report-trumps-downsizing-effor-rcna191790",
    "timestamp": "2025-02-12T00:46:54Z"
  },
  {
    "title": "What we can learn from a past tariff tiff",
    "description": "If President Donald Trump goes through with his plan to levy sweeping tariffs on foreign imports, it wouldn’t be the first time the U.S. has done such a thing. Ever heard of the Smoot-Hawley Tariff Act of 1930? Anyone?  \nThose tariffs are widely credited with…",
    "link": "https://www.marketplace.org/shows/make-me-smart/what-we-can-learn-from-a-past-tariff-tiff/",
    "timestamp": "2025-02-12T00:46:33Z"
  },
  {
    "title": "Musk's son 'Lil X' steals spotlight in the Oval Office",
    "description": "The billionaire has brought his four-year-old to numerous Washington events.",
    "link": "https://abcnews.go.com/Politics/musks-son-lil-steals-spotlight-oval-office/story?id=118713138",
    "timestamp": "2025-02-12T00:46:11Z"
  },
  {
    "title": "Ford CEO: IRA tax credit repeals could risk jobs, Trump tariffs are 'cost and chaos'",
    "description": "Farley explains why IRA tax credit repeals could risk jobs, tariffs are 'cost and chaos'\nFord Motor Co. CEO Jim Farley on Tuesday warned that if the federal government under President Donald Trump repeals provisions of the Biden administration's Inflation Red…",
    "link": "https://biztoc.com/x/54d802f9329d2b52",
    "timestamp": "2025-02-12T00:45:31Z"
  },
  {
    "title": "Donald Trump Fires USAID Watchdog Who Issued Oversight Warning",
    "description": "The White House dismissed the inspector general for the U.S. Agency for International Development (USAID) on Tuesday, a U.S. official confirmed to the Associated Press.\nThe firing came just one day after the watchdog's office warned that the President Donald …",
    "link": "https://biztoc.com/x/88d185fbc8c6fa36",
    "timestamp": "2025-02-12T00:45:29Z"
  },
  {
    "title": "Egypt's Sisi Cancels Planned White House Visit After Awkward Trump-King Abdullah Meeting",
    "description": "Egypt's Sisi Cancels Planned White House Visit After Awkward Trump-King Abdullah Meeting\n \nEgyptian President Abdel Fattah el-Sisi has canceled a planned February 18 visit to Washington to meet with President Donald Trump. It is being reported Tuesday as an i…",
    "link": "https://biztoc.com/x/dfb5e4fabcfb4e0a",
    "timestamp": "2025-02-12T00:45:10Z"
  },
  {
    "title": "Judge orders Trump admin to restore removed health agency webpages - NewsBreak",
    "description": "The decision by U.S. District Judge John Bates, a George W. Bush appointee, came after a testy Monday afternoon hearing.",
    "link": "https://www.newsbreak.com/share/3802929371394-judge-orders-trump-admin-to-restore-removed-health-agency-webpages?s=a2&share_destination_id=MjE3Mjc5NjI1LTE3MzkzMjEwNzkxNzA%3D&pd=0EhgM5hY&hl=en_US&send_time=1739321079&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v7%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-control",
    "timestamp": "2025-02-12T00:45:05Z"
  },
  {
    "title": "'Discriminatory!' Republican AG sues Starbucks for becoming ‘more female and less white’",
    "description": "A lawsuit filed by Missouri’s Republican attorney general claims Starbucks is unlawfully using diversity, equity and inclusion hiring practices that ultimately discriminate against its employees.In the lawsuit filed Tuesday in federal court, Missouri Attorney…",
    "link": "https://www.rawstory.com/dei-2671137002/",
    "timestamp": "2025-02-12T00:41:55Z"
  },
  {
    "title": "Donald Trump Fires USAID Watchdog Who Issued Oversight Warning",
    "description": "The firing comes after the watchdog warned that the dismantling of USAID severely hindered oversight of $8.2 billion in aid.",
    "link": "https://www.newsweek.com/donald-trump-fires-usaid-watchdog-who-issued-oversight-warning-2029735",
    "timestamp": "2025-02-12T00:41:30Z"
  },
  {
    "title": "Alina Habba's 'Separation of Powers' Comments Draw Scrutiny",
    "description": "The three branches of government prevent any one branch from becoming too powerful and create a system of checks and balances.",
    "link": "https://www.newsweek.com/alina-habbas-separation-powers-comments-draw-scrutiny-2029728",
    "timestamp": "2025-02-12T00:39:35Z"
  },
  {
    "title": "Judge orders Trump admin to restore removed health agency webpages - NewsBreak",
    "description": "The decision by U.S. District Judge John Bates, a George W. Bush appointee, came after a testy Monday afternoon hearing.",
    "link": "https://www.newsbreak.com/share/3802929371394-judge-orders-trump-admin-to-restore-removed-health-agency-webpages?s=a2&share_destination_id=MjI5MTQ2MzUwLTE3MzkzMjA2MDM5MDI%3D&pd=0FVTQsxU&hl=en_US&send_time=1739320603&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v7",
    "timestamp": "2025-02-12T00:37:39Z"
  },
  {
    "title": "Trump eases off aid threat after Jordan agrees to take ill Gaza children",
    "description": "The king's visit to Washington shows Arab leaders have little choice but to deal with the emboldened U.S. president.",
    "link": "https://www.japantimes.co.jp/news/2025/02/12/world/politics/trump-aid-jordan-gaza-children/",
    "timestamp": "2025-02-12T00:37:00Z"
  },
  {
    "title": "Trump Hopes Russia Hostage Release Will Bring Ukraine Peace Deal",
    "description": "President Donald Trump hailed the release of an American who had been detained in Russia, saying he hoped the move would allow the two nations to work toward ending the war in Ukraine.\nTrump told reporters that Marc Fogel, a school teacher held in Russia sinc…",
    "link": "https://biztoc.com/x/4796e55385fe90af",
    "timestamp": "2025-02-12T00:33:58Z"
  },
  {
    "title": "Media Blackout? Trump's New FEMA Has Handled 80 Percent of Cases in Western NC in Just 5 Days",
    "description": "Homeland Security Secretary Kristi Noem visited North Carolina Saturday to promise recovery efforts will not be like those of Joe Biden.",
    "link": "https://www.westernjournal.com/media-blackout-trumps-new-fema-handled-80-percent-cases-western-nc-just-5-days-biden-116-days/",
    "timestamp": "2025-02-12T00:31:02Z"
  },
  {
    "title": "Exclusive — Sen. Jim Banks: Trump Brought Back Manufacturing to Indiana, 'Saved the American Dream'",
    "description": "Sen. Jim Banks (R-IN), during a speech on Tuesday night at the American Iron and Steel Institute, will highlight how President Donald Trump saved the steel industry and how the Hoosier senator wants to ensure that the American steel industry can \"compete head…",
    "link": "https://www.breitbart.com/politics/2025/02/11/exclusive-sen-jim-banks-trump-brought-back-manufacturing-to-indiana-saved-the-american-dream/",
    "timestamp": "2025-02-12T00:30:52Z"
  },
  {
    "title": "Trump signs executive order to continue downsizing federal workforce",
    "description": "President Donald Trump made a rare appearance Tuesday with Elon Musk in the Oval Office before signing an executive order to continue downsizing the federal workforce.",
    "link": "https://roanoke.com/news/nation-world/government-politics/trump-musk-downsizing-workforce-doge/article_9098850f-9199-5641-b113-c20773800b0d.html",
    "timestamp": "2025-02-12T00:30:00Z"
  },
  {
    "title": "Trump signs executive order to continue downsizing federal workforce",
    "description": "President Donald Trump made a rare appearance Tuesday with Elon Musk in the Oval Office before signing an executive order to continue downsizing the federal workforce.",
    "link": "https://richmond.com/news/nation-world/government-politics/trump-musk-downsizing-workforce-doge/article_d1810c69-60f4-5738-aeae-ef67e74dec9d.html",
    "timestamp": "2025-02-12T00:30:00Z"
  },
  {
    "title": "Trump fires USAID’s inspector general after report critical of funding freeze - NewsBreak",
    "description": "Paul Martin is one of around 20 inspectors general the administration has pushed out despite objections from lawmakers who say the firing methods violate s",
    "link": "https://www.newsbreak.com/share/3804047285211-trump-fires-usaid-s-inspector-general-after-report-critical-of-funding-freeze?_f=app_share&pd=0DVWQmpv&lang=en_US&send_time=1739323531&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v3&s=i2",
    "timestamp": "2025-02-12T00:28:00Z"
  },
  {
    "title": "Key Islamic State planner killed in airstrike, US says",
    "description": "WASHINGTON — The main target in a series of U.S. airstrikes against the Islamic State terror group in Somalia earlier this month is dead, according to the most recent assessment by military officials.\n\n\nU.S. Africa Command (AFRICOM) announced late Tuesday tha…",
    "link": "https://www.voanews.com/a/key-islamic-state-planner-killed-in-airstrike-us-says-/7971509.html",
    "timestamp": "2025-02-12T00:27:05Z"
  },
  {
    "title": "Democrat senator backs Trump's 'common sense move' to fire the penny",
    "description": "Sen. Jacky Rosen came out in support of President Donald Trump's plan to end production of the penny, which she agreed would save money.",
    "link": "https://www.foxnews.com/politics/democrat-senator-backs-trumps-common-sense-move-fire-penny",
    "timestamp": "2025-02-12T00:25:20Z"
  },
  {
    "title": "Key House Democrat rips Musk for usurping presidential powers, says some have discussed impeachment",
    "description": "Rep. Jamie Raskin, D-Md., said Elon Musk was acting as if he were the president of the United States through his DOGE cost-cutting efforts.",
    "link": "https://www.foxnews.com/politics/key-house-dem-rips-musk-usurping-presidential-powers-says-some-have-discussed-impeachment",
    "timestamp": "2025-02-12T00:24:51Z"
  },
  {
    "title": "Israel warns of Gaza offensive resumption if Hamas fails to free hostages by Saturday",
    "description": "This photo taken on Feb. 10, 2025 shows a tent camp for displaced families in Gaza City. (Photo by",
    "link": "http://en.people.cn/n3/2025/0212/c90000-20275474.html",
    "timestamp": "2025-02-12T00:23:29Z"
  },
  {
    "title": "USAID Controversy Live Updates: Inspector General Fired After Critical Report Against Trump Administration",
    "description": "Trump has attacked the aid agency’s leadership, saying they were a “bunch of radical lunatics.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/02/11/usaid-controversy-live-updates-inspector-general-reportedly-fired-after-critical-report-against-trump-administration/",
    "timestamp": "2025-02-12T00:22:57Z"
  },
  {
    "title": "New York doctor says he'll continue providing transition care despite Trump executive order",
    "description": "As legal battles are fought over an executive order restricting transgender care for patients younger than 19, some clinics are continuing to provide the care while others are backing off.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/new-york-doctor-says-continue-providing-transition-care-trump-executiv-rcna191289",
    "timestamp": "2025-02-12T00:21:40Z"
  },
  {
    "title": "Trump signs executive order calling on agencies to work with Elon Musk-led group (Washington Post)",
    "description": "Washington Post:\nTrump signs executive order calling on agencies to work with Elon Musk-led group  —  President Donald Trump on Tuesday signed an executive order that calls on federal agencies to work with the U.S. DOGE Service in a bid to cut their existing …",
    "link": "https://www.memeorandum.com/250211/p146",
    "timestamp": "2025-02-12T00:20:00Z"
  },
  {
    "title": "Border czar Homan fires back at pope over illegal immigration: 'I've got harsh words for the pope'",
    "description": "President Donald Trump's border czar Tom Homan fired back at the pope after the head of the Catholic Church and sovereign of the Vatican City State criticized U.S. policies against illegal immigration. Pope Francis had criticized the more aggressive policies …",
    "link": "https://www.theblaze.com/news/homan-pope-feud-illegal-immigration",
    "timestamp": "2025-02-12T00:20:00Z"
  },
  {
    "title": "US Core Inflation Seen Rising at Firm Pace in January",
    "description": "Inflation likely remained stubborn last month based on economists’ estimates, backing the Federal Reserve’s patient approach to lowering borrowing costs.",
    "link": "https://financialpost.com/pmn/business-pmn/us-core-inflation-seen-rising-at-firm-pace-in-january",
    "timestamp": "2025-02-12T00:19:29Z"
  },
  {
    "title": "FBI uncovers thousands of secret JFK assassination files",
    "description": "The FBI says it has found 2,400 new files related to the assassination of President John F Kennedy.",
    "link": "https://news.sky.com/story/fbi-uncovers-thousands-of-secret-jfk-assassination-files-after-trump-order-13307613",
    "timestamp": "2025-02-12T00:19:00Z"
  },
  {
    "title": "White House bars AP reporter from Oval Office because of AP style policy on ‘Gulf of America’",
    "description": "The White House blocked an Associated Press reporter from an event in the Oval Office on Tuesday after demanding the news agency alter its style on the Gulf of Mexico, which President Donald Trump has ordered renamed the Gulf of America.The reporter tried to …",
    "link": "https://freerepublic.com/focus/f-news/4296861/posts",
    "timestamp": "2025-02-12T00:18:04Z"
  },
  {
    "title": "White House bars AP reporter from Oval Office because of AP style policy on ‘Gulf of America’",
    "description": "The White House blocked an Associated Press reporter from an event in the Oval Office on Tuesday after demanding the news agency alter its style on the Gulf of Mexico, which President Donald Trump has ordered renamed the Gulf of America.The reporter tried to …",
    "link": "https://freerepublic.com/focus/f-chat/4296861/posts",
    "timestamp": "2025-02-12T00:18:04Z"
  },
  {
    "title": "Project 2025 Is Gutting Medical Funding That Helped Russell Vought’s Own Kid",
    "description": "The National Institutes of Health, the federal government’s leading medical research agency, came under attack by Project 2025 well before its architect, Russell Vought, was confirmed to Donald Trump’s second-term cabinet as head of the Office of Management a…",
    "link": "https://www.motherjones.com/politics/2025/02/project-2025-vought-medical-funding/",
    "timestamp": "2025-02-12T00:17:27Z"
  },
  {
    "title": "Watchdog demands defunding of abortion-industry giant",
    "description": "Freedom group insists cutting off taxes could be the 'greatest moment for the administration'",
    "link": "https://www.wnd.com/2025/02/watchdog-demands-defunding-of-abortion-industry-giant/",
    "timestamp": "2025-02-12T00:16:45Z"
  },
  {
    "title": "Trump Fires USAID Watchdog Day After Report Criticized Gutting of the Agency",
    "description": "The inspector general for the U.S. Agency for International Development was terminated Tuesday evening without explanation a day after his office criticized President Donald Trump’s attempts to dismantle the agency. USAID IG Paul Martin was let go after his o…",
    "link": "https://www.mediaite.com/politics/trump-fires-usaid-watchdog-day-after-report-criticized-gutting-of-the-agency/",
    "timestamp": "2025-02-12T00:16:36Z"
  },
  {
    "title": "JUST IN: Appeals Court Denies Trump’s Latest Attempt to Freeze Federal Funding",
    "description": "The First Circuit Court's rejection of Trump's funding freeze marks a significant legal setback, highlighting ongoing tensions between federal authority and state challenges. This ruling could reshape financial assistance dynamics in the coming fiscal year.\nT…",
    "link": "https://www.thegatewaypundit.com/2025/02/just-appeals-court-denies-trumps-latest-attempt-freeze/",
    "timestamp": "2025-02-12T00:15:33Z"
  },
  {
    "title": "'Alarming': AP claps back after being barred from Oval Office for keeping 'Gulf of Mexico'",
    "description": "The Associated Press has raised alarms that President Donald Trump is restricting its access to the Oval Office out of retaliation for not going along with his order to rename the Gulf of Mexico.According to Politico, \"the White House warned the AP — known fo…",
    "link": "https://www.rawstory.com/gulf-of-mexico-2671136879/",
    "timestamp": "2025-02-12T00:15:23Z"
  },
  {
    "title": "Judge Orders Trump Admin to Roll Back Huge Health Data Purge - NewsBreak",
    "description": "The Trump administration faced yet another legal roadblock on Tuesday after a federal judge ordered health agencies to restore public health webpages that",
    "link": "https://www.newsbreak.com/share/3803860393704-judge-orders-trump-admin-to-roll-back-huge-health-data-purge?_f=app_share&pd=0BTCVtjv&lang=en_US&send_time=1739319262&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v6%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v5&s=i2",
    "timestamp": "2025-02-12T00:15:01Z"
  },
  {
    "title": "‘Back to plastic’: Trump signs order for plastic straws as he declares paper ones ‘don’t work’",
    "description": "Washington, Feb 11: President Donald Trump said Monday he is banning federal use of paper straws, saying they “don’t work” and don’t last very long. Instead he wants the government to exclusively move to plastic. “It’s a ridiculous situation. We’re going back…",
    "link": "https://thehillstimes.in/international/back-to-plastic-trump-signs-order-for-plastic-straws-as-he-declares-paper-ones-dont-work",
    "timestamp": "2025-02-12T00:15:00Z"
  },
  {
    "title": "White House Fires USAID Inspector General After Warning About Funding Oversight, Official Says",
    "description": "The White House fired the inspector general for the U.S. Agency for International Development on Tuesday.",
    "link": "https://www.huffpost.com/entry/us-trump-usaid-inspector-general_n_67abe778e4b0b904f1e2bd9c",
    "timestamp": "2025-02-12T00:14:26Z"
  },
  {
    "title": "With Elon Musk watching, Trump says he's giving DOGE even more power",
    "description": "President Donald Trump said Tuesday he was signing an executive order to give tech billionaire Elon Musk more power over the federal workforce, adding to Musk's swift and sweeping consolidation of political influence. With Musk standing to his right in the Ov…",
    "link": "https://freerepublic.com/focus/f-news/4296859/posts",
    "timestamp": "2025-02-12T00:14:23Z"
  },
  {
    "title": "Republican Sues Starbucks Over DEI Policies",
    "description": "The lawsuit alleges that Starbucks enforces race and sex-based hiring practices and illegally segregates employees.",
    "link": "https://www.newsweek.com/republican-sues-starbucks-over-dei-policies-2029690",
    "timestamp": "2025-02-12T00:13:49Z"
  },
  {
    "title": "GOP lawmakers split over reining in Fed",
    "description": "The Scoop\nRepublicans are divided over the Trump administration’s calls to meddle with the Federal Reserve’s leadership, a schism on vivid display this week as Chair Jerome Powell prepares for his second day of congressional testimony.\nMultiple members of Pre…",
    "link": "https://biztoc.com/x/a8e406f6cdc873f8",
    "timestamp": "2025-02-12T00:11:56Z"
  },
  {
    "title": "Trump wants to end penny production; will it affect consumers?",
    "description": "President Donald Trump is seeking to end production of new pennies and recently told Treasury Secretary Scott Bessent to make that happen. \nTrump revealed late Sunday night he had \"instructed my Secretary of the US Treasury to stop producing new pennies,\" arg…",
    "link": "https://biztoc.com/x/903da52ce6c1534d",
    "timestamp": "2025-02-12T00:11:36Z"
  },
  {
    "title": "Immigration's public image crisis is fueled by Trump and right-wing extremists",
    "description": "As a queer, non-binary refugee from Venezuela, I experienced the desperation of seeking asylum. I lived in constant terror, not knowing what tomorrow would bring. I struggled to envision a better future. However, my experience is not unique: It is the reality…",
    "link": "https://www.advocate.com/voices/immigrations-public-image-crisis",
    "timestamp": "2025-02-12T00:10:44Z"
  },
  {
    "title": "Taoiseach, Tánaiste and eight ministers to travel to US for St Patrick's Day this year",
    "description": "More representatives are going stateside in a bid to firm up the Irish-US relationship.",
    "link": "https://www.thejournal.ie/ministers-travelling-to-us-for-st-patricks-day-6620284-Feb2025/",
    "timestamp": "2025-02-12T00:10:04Z"
  },
  {
    "title": "America First is looking like America Only, and that’s bad",
    "description": "LATIKA M BOURKE: The stakes could not be higher for Anthony Albanese to secure Australia an exemption from Donald Trump’s steel and aluminium tariffs. Failure could cost him and the economy dearly.",
    "link": "https://thenightly.com.au/business/tariff-man-america-first-is-looking-like-america-only-and-thats-bad-for-the-alliance-c-17693811",
    "timestamp": "2025-02-12T00:09:44Z"
  },
  {
    "title": "Paris AI Summit: PM, JD Vance Discuss 'Diversifying' India's Energy Sourcing",
    "description": "Vice President JD Vance met with PM Modi on Tuesday, where they discussed topics of mutual interest, including how the United States can assist India in diversifying its energy sourcing through investments in clean, &quot;reliable&quot; US nuclear technology.",
    "link": "https://www.ndtv.com/india-news/pm-modi-vance-discuss-us-support-for-indias-clean-energy-and-nuclear-technology-7690054",
    "timestamp": "2025-02-12T00:08:43Z"
  },
  {
    "title": "Trade, tariffs and visas to dominate Trump-Modi talks",
    "description": "The leaders share a warm relationship, but both will have their own wish list when they meet this week.",
    "link": "https://www.bbc.com/news/articles/cj91d3jkpvlo",
    "timestamp": "2025-02-12T00:08:39Z"
  },
  {
    "title": "‘No Exceptions’: Pentagon Schools Defy Hegseth by Renaming DEI Efforts",
    "description": "In preparation for Donald Trump’s second presidency, the Pentagon’s school system attempted to conceal its diversity, equity, and inclusion efforts under a different name.  The... Read More\nThe post ‘No Exceptions’: Pentagon Schools Defy Hegseth by Renaming D…",
    "link": "https://www.dailysignal.com/2025/02/11/no-exceptions-pentagon-schools-defy-hegseth-renaming-dei-effort/",
    "timestamp": "2025-02-12T00:08:29Z"
  },
  {
    "title": "‘There Is a Lot of Advocacy Underway … We Can’t Retreat’: Demelza Baer on the Legal Fight for Civil Rights",
    "description": "An interview with Demelza Baer, director of public policy at the 62-year-old Lawyers’ Committee for Civil Rights Under Law:\n\"We’re making plans, discussing litigation strategies and doing outreach. A lot is happening behind the scenes. ... I know that this mo…",
    "link": "https://msmagazine.com/2025/02/11/lawyers-committee-for-civil-rights-under-law-trump-civil-rights/",
    "timestamp": "2025-02-12T00:07:05Z"
  },
  {
    "title": "Netanyahu: Hamas Must Return All Hostages by Noon Saturday, or Face 'Final Defeat'",
    "description": "Israeli Prime Minister Netanyahu said Tuesday that if Hamas did not release all 73 of the remaining hostages still in Gaza by noon on Saturday, the Israel Defense Forces (IDF) would resume attacking \"until the final defeat of Hamas.\"\nThe post Netanyahu: Hamas…",
    "link": "https://www.breitbart.com/middle-east/2025/02/11/netanyahu-hamas-must-return-all-hostages-by-noon-saturday-or-face-final-defeat/",
    "timestamp": "2025-02-12T00:06:48Z"
  },
  {
    "title": "Former White House Ethics Czar Slams Musk and Trump: ‘They’re Violating the Law Right and Left!’",
    "description": "\"What arrangements have been made? We haven't seen his financial disclosures. Supposedly, he's signed it. How is he dealing with these conflicts? Does he have waivers?\"\nThe post Former White House Ethics Czar Slams Musk and Trump: ‘They’re Violating the Law R…",
    "link": "https://www.mediaite.com/tv/former-white-house-ethics-czar-slams-musk-and-trump-theyre-violating-the-law-right-and-left/",
    "timestamp": "2025-02-12T00:06:20Z"
  },
  {
    "title": "Zelenskyy offers land swaps as Russia heartens Trump with prisoner release",
    "description": "The Ukrainian president said he was ready to trade land in Russia's Kursk region which Ukraine seized in a surprise offensive last year.",
    "link": "https://www.japantimes.co.jp/news/2025/02/12/world/politics/zelenskyy-land-russia-trump-prisoner/",
    "timestamp": "2025-02-12T00:05:00Z"
  },
  {
    "title": "Republicans once railed against armed IRS agents. Now they want them for immigration enforcement",
    "description": "For years, Republicans, including President Donald Trump, have railed against the IRS and its cadre of armed agents. Now the administration has big plans for them: It wants the agents to assist with immigration enforcement. Homeland Security Secretary Kristi …",
    "link": "https://www.seattlepi.com/news/politics/article/republicans-once-railed-against-armed-irs-agents-20161726.php",
    "timestamp": "2025-02-12T00:04:18Z"
  },
  {
    "title": "AP Whines White House Cut Reporter Out of Oval Office Event Because Outlet Still Uses ‘Gulf of Mexico’ Instead of ‘Gulf of America’",
    "description": "The Associated Press was furious on Tuesday after the White House apparently disallowed the outlet's reporter from joining a gaggle with President Donald Trump in the Oval Office because the news organization refuses to officially and fully recognize Gulf of …",
    "link": "https://www.breitbart.com/politics/2025/02/11/ap-whines-white-house-cut-reporter-out-of-oval-office-event-because-outlet-still-uses-gulf-of-mexico-instead-of-gulf-of-america/",
    "timestamp": "2025-02-12T00:02:36Z"
  },
  {
    "title": "Trump plans to meet Marc Fogel in Washington at 10 p.m. tonight",
    "description": "-snip- \"Since President Trump’s swearing-in, he has successfully secured the release of Americans detained around the world, and President Trump will continue until all Americans being held are returned to the United States,\" the statement concluded. \"By toni…",
    "link": "https://freerepublic.com/focus/f-chat/4296856/posts",
    "timestamp": "2025-02-12T00:01:43Z"
  },
  {
    "title": "Republicans once railed against armed IRS agents. Now they want them for immigration enforcement",
    "description": "For years, Republicans, including President Donald Trump, have railed against the IRS and its cadre of armed agents.",
    "link": "https://www.clickondetroit.com/news/politics/2025/02/11/republicans-once-railed-against-armed-irs-agents-now-they-want-them-for-immigration-enforcement/",
    "timestamp": "2025-02-12T00:01:22Z"
  },
  {
    "title": "Goldman axes diversity rule that has 'served purpose'",
    "description": "The bank ditches a policy that stopped it acting on flotations for firms with an all male, all white board.",
    "link": "https://www.bbc.com/news/articles/c4gwvxn5377o",
    "timestamp": "2025-02-12T00:01:11Z"
  },
  {
    "title": "Goldman Sachs axes diversity rule that has 'served its purpose'",
    "description": "The bank ditches a policy that stopped it acting on flotations for firms with an all male, all white board.",
    "link": "https://www.bbc.co.uk/news/articles/c4gwvxn5377o",
    "timestamp": "2025-02-12T00:01:11Z"
  },
  {
    "title": "Google Calendar users no longer see default entries for events like Pride, Black History Month",
    "description": "Google’s online calendar has removed default references for a handful of holidays and cultural events — with users noticing that mentions of Pride and Black History Month, as well as other observances, no longer appear in their desktop and mobile applications.",
    "link": "https://www.ksat.com/business/2025/02/11/google-calendar-users-no-longer-see-default-entries-for-events-like-pride-black-history-month/",
    "timestamp": "2025-02-12T00:00:41Z"
  },
  {
    "title": "Apple in Process of Adopting ‘Gulf of America’ Name for Apple Maps",
    "description": "Apple is in the process of renaming the Gulf of Mexico to the Gulf of America in the Apple Maps app.Read More...",
    "link": "https://www.mactrast.com/2025/02/apple-in-process-of-adopting-gulf-of-america-name-for-apple-maps/",
    "timestamp": "2025-02-12T00:00:15Z"
  },
  {
    "title": "How Will OPEC Respond To Iran’s Call For Action Against U.S. Sanctions?",
    "description": "Iran called on all members of the OPEC oil cartel last week to take united action against the U.S.’s ramping up of sanctions on the Islamic Republic. The statement from its President Masoud Pezeshkian followed Donald Trump’s instruction to his key cabinet col…",
    "link": "https://oilprice.com/Energy/Crude-Oil/How-Will-OPEC-Respond-To-Irans-Call-For-Action-Against-US-Sanctions.html",
    "timestamp": "2025-02-12T00:00:00Z"
  },
  {
    "title": "Relief to Adani; Trump pauses enforcement of foreign bribery law",
    "description": "Washington, Feb 11: US President Donald Trump signed an executive order directing the Department of Justice to pause enforcing a nearly half-century-old law that was used to launch a bribery investigation against the Adani Group. Trump signed an order to paus…",
    "link": "https://thehillstimes.in/international/relief-to-adani-trump-pauses-enforcement-of-foreign-bribery-law",
    "timestamp": "2025-02-12T00:00:00Z"
  },
  {
    "title": "California Update: A Not-So-Special Session In Sacramento And Reasons For Hope In 2025",
    "description": "Can California “Trump-proof” the Golden State?",
    "link": "https://www.hoover.org/research/california-update-not-so-special-session-sacramento-and-reasons-hope-2025",
    "timestamp": "2025-02-12T00:00:00Z"
  },
  {
    "title": "Trump to Send Treasury Secretary Scott Bessent to Meet with Zelensky",
    "description": "President Donald Trump announced that he will send Treasury Secretary Scott Bessent to Ukraine to meet with Ukrainian President Volodymyr Zelensky, adding that the war between Ukraine and Russia \"must and will end soon.\"\nThe post Trump to Send Treasury Secret…",
    "link": "https://www.breitbart.com/politics/2025/02/11/trump-to-send-treasury-secretary-scott-bessent-to-meet-with-zelensky/",
    "timestamp": "2025-02-11T23:59:55Z"
  },
  {
    "title": "Trump Punishes The Associated Press For Not Calling The Gulf Of Mexico 'The Gulf Of America'",
    "description": "The White House told AP to call the body of water the Gulf of America or they would be banned from an event at the Oval Office.",
    "link": "https://www.huffpost.com/entry/donald-trump-ap-associated-press-gulf-of-america-white-house_n_67abd1f9e4b0b904f1e2b7fc",
    "timestamp": "2025-02-11T23:58:58Z"
  },
  {
    "title": "Watchdog Group Spotlights $776B in Biden Climate Spending for Trump To Target",
    "description": "A government watchdog group identified $776 billion in federal programs introduced or modified during the Biden administration to fight global warming and promote green energy. That group, the Functional Government Initiative, is now calling on the White Hous…",
    "link": "https://freebeacon.com/energy/watchdog-group-uncovers-776b-in-biden-climate-spending-notifies-trumps-omb-director/",
    "timestamp": "2025-02-11T23:57:48Z"
  },
  {
    "title": "Fears for Australian jobs after Donald Trump imposes steel and aluminium tariffs",
    "description": "Fears for Australian jobs after Donald Trump imposes steel and aluminium tariffs7news.com.au",
    "link": "https://7news.com.au/news/down-this-road-before-concern-australian-jobs-at-risk-over-donald-trumps-tariffs-c-17692812",
    "timestamp": "2025-02-11T23:57:01Z"
  },
  {
    "title": "TRUMP & DUMP: Fall season as T-War comes to D-Street",
    "description": "The NSE Nifty tumbled 1.3% or 309.80 points to finish at 23,071.80. The BSE Sensex slumped 1.3% or 1,018.20 points to close at 76,293.60. The slump in the broader market was deeper with the Nifty Midcap 150 index tumbling 2.9% and the Smallcap 250 index 3.4%.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-dump-fall-season-as-t-war-comes-to-d-street/articleshow/118159152.cms",
    "timestamp": "2025-02-11T23:55:09Z"
  },
  {
    "title": "Trump keeps floating the idea of serving a third term",
    "description": "To be clear, Trump cannot run for president in 2028. But there are, in theory, some roundabout ways he could go on to serve a third term.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-third-term-president-constitution-2028-rcna191719",
    "timestamp": "2025-02-11T23:54:50Z"
  },
  {
    "title": "Trump signs executive order to continue downsizing federal workforce",
    "description": "WASHINGTON — President Donald Trump made a rare appearance with Elon Musk, his most powerful adviser, in the Oval Office on Tuesday before signing an executive order to continue downsizing the federal workforce.\n\n\nThe Associated Press reviewed a White House f…",
    "link": "https://www.voanews.com/a/trump-signs-executive-order-to-continue-downsizing-federal-workforce-/7971513.html",
    "timestamp": "2025-02-11T23:54:36Z"
  },
  {
    "title": "'Playing with the courts': Trump admin hit with dozens of suits after years of president condemning 'lawfare'",
    "description": "President Donald Trump's legal battles at the hands of Democrats and activist groups are continuing into his second administration, a bevy of lawsuits show.",
    "link": "https://www.foxnews.com/politics/playing-courts-trump-admin-hit-dozens-suits-after-years-president-condemning-lawfare",
    "timestamp": "2025-02-11T23:54:27Z"
  }
]