[
  {
    "title": "Golden Globes host says Trump jokes were scrapped",
    "description": "Comedian Nikki Glaser says she cut Trump jokes from her Golden Globes monologue, telling Howard Stern political humor wasn’t 'funny' in the current climate.",
    "link": "https://www.foxnews.com/media/golden-globes-host-says-trump-jokes-were-scrapped",
    "timestamp": "2026-01-14T11:30:11Z"
  },
  {
    "title": "Father of Renee Good's late husband does not blame ICE after seeing new perspective of shooting footage",
    "description": "The former father-in-law of Renee Good has revealed he does not blame ICE agent Jonathan Ross for shooting 37-year-old three times in the face.",
    "link": "https://www.ladbible.com/news/us-news/renee-good-ice-trump-family-former-father-law-683700-20260114",
    "timestamp": "2026-01-14T11:29:52Z"
  },
  {
    "title": "Türkiye engages with US, Iran to reduce tension",
    "description": "Ankara has reached out to Iran and the United States to reduce tensions between the two countries after the latter threatened to use force against Tehran should it continue to use disproportionate force and kill Iranian protestors.",
    "link": "https://www.hurriyetdailynews.com/turkiye-engages-with-us-iran-to-reduce-tension-217828",
    "timestamp": "2026-01-14T11:22:06Z"
  },
  {
    "title": "Transcript: Trump Tirades on Shooting Darken as ICE Polls Turn Brutal",
    "description": "The following is a lightly edited transcript of the January 14 episode of The Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. Donald Tr…",
    "link": "https://newrepublic.com/article/205260/transcript-trump-tirades-shooting-darken-ice-polls-turn-brutal",
    "timestamp": "2026-01-14T11:19:58Z"
  },
  {
    "title": "Trump Has A Very Unexpected Texting Buddy: Report",
    "description": "The pair exchanged unpleasantries before swapping numbers.",
    "link": "https://www.huffpost.com/entry/donald-trump-texting-buddy_n_69677177e4b0d5c7db78c0e4",
    "timestamp": "2026-01-14T11:13:46Z"
  },
  {
    "title": "Iran expected to execute 1st protester despite Trump warning of 'strong action'",
    "description": "Iranian authorities were on Wednesday expected to execute the first person in relation to the nationwide unrest that has rocked the country, according to the United States and human rights groups",
    "link": "https://www.nbcnews.com/world/iran/trump-iran-protest-execution-death-toll-crackdown-us-military-rcna253952",
    "timestamp": "2026-01-14T11:10:25Z"
  },
  {
    "title": "Japanese prime minister plans snap general election, party official says",
    "description": "Sanae Takaichi seeking to capitalise on a surge in public support since she came to office in October",
    "link": "https://www.irishtimes.com/world/asia-pacific/2026/01/14/japanese-prime-minister-plans-snap-general-election-party-official-says/",
    "timestamp": "2026-01-14T11:09:49Z"
  },
  {
    "title": "2025 est l'année la plus meurtrière pour les civils ukrainiens depuis le début de la guerre menée par la Russie (Anglais)",
    "description": "The total number of Ukrainian civilians killed or injured in 2025 was 31% higher than in 2024 and 70% higher than in 2023, according to the U.N. Human Rights Monitoring Mission in Ukraine.",
    "link": "https://kyivindependent.com/2025-deadliest-year-for-ukrainian-civilians-since-first-year-of-russias-full-scale-war-un-says/",
    "timestamp": "2026-01-14T11:09:47Z"
  },
  {
    "title": "NATO would be ‘more formidable’ with US control of Greenland, Trump says",
    "description": "Jan 14 (Reuters) - U.S. President Donald Trump said anything less than Greenland “in the hands” of the United States was “unacceptable”, reiterating his demand for contro… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/nato-would-be-more-formidable-with-us-control-of-greenland-trump-says",
    "timestamp": "2026-01-14T11:08:55Z"
  },
  {
    "title": "US ends temporary protected status for Somalis",
    "description": "Homeland Security has said allowing Somalis to remain in the US under Temporary Protected Status goes against national interests Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/630944-us-ends-somalia-temporary-protected-status/",
    "timestamp": "2026-01-14T11:04:34Z"
  },
  {
    "title": "Xi welcomes stream of leaders shaken by Trump’s new world order",
    "description": "Global leaders are flocking to China to rebuild relationships and secure economic deals. This trend follows a period of US-led tariffs. Nations are eager to engage with President Xi Jinping to avoid being sidelined in international politics. Key areas of focu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/xi-welcomes-stream-of-leaders-shaken-by-trumps-new-world-order/articleshow/126525060.cms",
    "timestamp": "2026-01-14T11:04:22Z"
  },
  {
    "title": "Dutch court hears battle over Nexperia",
    "description": "A Dutch court held hearings Wednesday to weigh whether to order an investigation into Nexperia, a Chinese-owned chip company at the centre of a global tug-of-war over critical semiconductor technology. The firm, based in the Netherlands but whose parent compa…",
    "link": "https://www.digitaljournal.com/world/dutch-court-hears-battle-over-nexperia/article",
    "timestamp": "2026-01-14T11:02:32Z"
  },
  {
    "title": "Canada and China: A half-century journey from Pierre Trudeau to Mark Carney",
    "description": "Canada was one of the first Western countries to recognize communist China, establishing ties in 1970 under Prime Minister Pierre Trudeau",
    "link": "https://abcnews.go.com/Business/wireStory/canada-china-half-century-journey-pierre-trudeau-mark-129195023",
    "timestamp": "2026-01-14T11:02:19Z"
  },
  {
    "title": "Trump Is Making ‘Abolish ICE’ a Mainstream Position",
    "description": "Democrats may have gotten burned by “Defund the Police,” but Trump is making ‘Abolish ICE’ a mainstream position.",
    "link": "http://nymag.com/intelligencer/article/trump-is-making-abolish-ice-a-mainstream-position.html",
    "timestamp": "2026-01-14T11:00:53Z"
  },
  {
    "title": "“Felt like I was going to pass out and die”: Immigration agents are using banned chokeholds",
    "description": "There is a federal ban on chokeholds and similar tactics. But there's no sign of punishment for officers use them",
    "link": "https://www.salon.com/2026/01/14/i-felt-like-i-was-going-to-pass-out-and-die-immigration-agents-are-using-banned-chokeholds/",
    "timestamp": "2026-01-14T11:00:46Z"
  },
  {
    "title": "Opinion: Ottawa’s tariffs protect Ontario and slam Western Canada. Again",
    "description": "Sir John A.'s policy protected central Canada's manufacturing at the expense of western farmers. History is repeating itself. Read more.",
    "link": "https://financialpost.com/opinion/ottawa-tariffs-protect-ontario-slam-western-canada",
    "timestamp": "2026-01-14T11:00:34Z"
  },
  {
    "title": "Trump signals long road ahead in Venezuela in his boldest interventionist move yet",
    "description": "President Donald Trump signaled prolonged U.S. oversight of Venezuela after seizing dictator Nicolás Maduro and conducting large-scale strikes in Venezuela.",
    "link": "https://www.foxnews.com/politics/trump-signals-long-road-ahead-venezuela-his-boldest-interventionist-move-yet",
    "timestamp": "2026-01-14T11:00:01Z"
  },
  {
    "title": "Greenland Catholics ‘do not wish to become Americans’ amid U.S. efforts at acquisition",
    "description": "The HDMS Niels Juel (F363) warship, an Iver Huitfeldt-class frigate of the Royal Danish Navy, is moored in Nuuk, Greenland, on June 15, 2025. | Credit: Ludovic MARIN/AFP via Getty Images\n\nJan 14, 2026 / 06:00 am (CNA).\nGreenlandic Catholics are reportedly exp…",
    "link": "https://www.catholicnewsagency.com/news/269069/greenland-catholics-do-not-wish-to-become-americans-amid-u-s-efforts-at-acquisition",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Trump’s Greenland Threats and the Plunder of the Arctic",
    "description": "Not so long ago, the Arctic—a remote and thinly populated\nregion stretching from Alaska to Siberia—seemed immune to the kind of conflicts\nthat beset so many other parts of the world. Scholars even had a phrase for it:\nArctic exceptionalism. Territorial disput…",
    "link": "https://newrepublic.com/article/205166/trump-greenland-threats-plunder-arctic",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "America’s New Era of Violent Populism Is Here",
    "description": "A year ago this month, President Donald Trump granted clemency to nearly 1,600 people responsible for the January 6 insurrection at the US Capitol. When Robert Pape, a University of Chicago political science professor who studies domestic political violence, …",
    "link": "https://www.motherjones.com/politics/2026/01/trump-january-6-pardons-political-violence/",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Trump’s Obsession With Real Estate Is Fueling a Ruinous Foreign Policy",
    "description": "The Trump administration’s aggressive push to acquire Greenland has infuriated America’s European allies, and for good reason. It threatens to destroy the NATO alliance, what’s left of the postwar order, and could even result in the outbreak of war—especially…",
    "link": "https://newrepublic.com/article/205255/trump-real-estate-developer-foreign-policy-ruinous",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Where are the main US military bases in the Middle East?",
    "description": "Jan 14 (Reuters) - Following are the significant military bases in the Middle East. Iran has threatened to strike U.S. bases in the region if attacked by Washington, afte… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/where-are-the-main-us-military-bases-in-the-middle-east",
    "timestamp": "2026-01-14T10:59:58Z"
  },
  {
    "title": "UK Actuaries Sound Alarm on Loss Models Downplaying Climate Risk",
    "description": "The finance industry is relying on climate models that understate the speed at which temperatures are rising, according to a fresh study by Britain’s main association of actuaries. The Institute and Faculty of Actuaries, which conducted its study together wit…",
    "link": "https://www.insurancejournal.com/news/international/2026/01/14/854219.htm",
    "timestamp": "2026-01-14T10:58:01Z"
  },
  {
    "title": "Iran vows fast trials of protesters after Trump threat",
    "description": "Iran plans fast-track trials for protesters after a massive crackdown, facing international outrage and threats of ‘strong action’ from the US.\n\nRead More: https://punchng.com/iran-vows-fast-trials-of-protesters-after-trump-threat/",
    "link": "https://punchng.com/iran-vows-fast-trials-of-protesters-after-trump-threat/",
    "timestamp": "2026-01-14T10:55:31Z"
  },
  {
    "title": "In an interview with CBS Evening News anchor Tony Dokoupil, President Trump criticizes Kamala Harris and says \"You wouldn't have a job right now, if she got in\" (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nIn an interview with CBS Evening News anchor Tony Dokoupil, President Trump criticizes Kamala Harris and says “You wouldn't have a job right now, if she got in”  —  CBS Evening News anchor Tony Dokoupil landed an interview with Donald …",
    "link": "https://mediagazer.com/260114/p5",
    "timestamp": "2026-01-14T10:55:00Z"
  },
  {
    "title": "Marvel's Treatment Of Jean Grey in The Daily LITG, 14th January, 2026",
    "description": "How Marvel Might Have Handled Jean Grey Better was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded seventeen years ago and stee…",
    "link": "https://bleedingcool.com/comics/marvels-treatment-of-jean-grey-in-the-daily-litg-14th-january-2026/",
    "timestamp": "2026-01-14T10:52:07Z"
  },
  {
    "title": "Trump's sweeping proposals for credit cards and student debt could be a big deal for other lenders",
    "description": "With Trump's proposed cap on credit card interest rates and new caps on student loans, more Americans might turn to alternative lenders.",
    "link": "https://www.businessinsider.com/alternatives-to-credit-cards-student-loans-personal-private-lenders-2026-1",
    "timestamp": "2026-01-14T10:51:01Z"
  },
  {
    "title": "Greenland's future on the line at key White House meeting",
    "description": "Hoping the United States will cool its Arctic ambitions, the top diplomats of Denmark and Greenland were set to hold high-stakes talks at the White House on Wednesday",
    "link": "https://www.nbcnews.com/world/greenland/greenland-denmark-trump-foreign-ministers-meet-rubio-vance-europe-rcna253953",
    "timestamp": "2026-01-14T10:50:57Z"
  },
  {
    "title": "Mike Turner file to continue representing 10th congressional district as challengers emerge",
    "description": "Mike Turner file to continue representing 10th congressional district as challengers emergedaytondailynews.com",
    "link": "https://www.daytondailynews.com/local/dems-eye-chance-to-unseat-turner-for-dayton-area-congressional-seat-but-can-they/SLAV6GYYLJAAPJQ5ZYFN2ZAXMQ/",
    "timestamp": "2026-01-14T10:50:12Z"
  },
  {
    "title": "France to launch Greenland consulate in ‘political signal’ to US",
    "description": "Washington's threats to seize the strategic island have sparked a crisis among NATO states.",
    "link": "https://www.aljazeera.com/news/2026/1/14/france-to-launch-greenland-consulate-in-political-signal-to-us",
    "timestamp": "2026-01-14T10:50:07Z"
  },
  {
    "title": "Denmark and Greenland to face Vance in high-stakes White House meeting",
    "description": "The Danish and Greenlandic foreign ministers will meet with U.S. Vice President JD Vance at the White House on Wednesday following weeks of threats by President Donald Trump to take control of Greenland, an autonomous territory of Denmark.",
    "link": "https://www.independent.ie/world-news/north-america/denmark-and-greenland-to-face-vance-in-high-stakes-white-house-meeting/a1723718533.html",
    "timestamp": "2026-01-14T10:48:05Z"
  },
  {
    "title": "‘Two dogsleds won’t do it’ – Trump’s latest Greenland outburst as Vance hosts talks",
    "description": "US president Donald Trump has said that anything less than US control of Greenland is unacceptable, hours before Vice President JD Vance is to host Danish and Greenlandic officials for talks.",
    "link": "https://www.independent.ie/world-news/north-america/two-dogsleds-wont-do-it-trumps-latest-greenland-outburst-as-vance-hosts-talks/a1723718533.html",
    "timestamp": "2026-01-14T10:48:05Z"
  },
  {
    "title": "It’s Responsible for One of the Worst Oil Disasters Ever. It’s Counting On Trump to Let It Do It Again.",
    "description": "Every American adult can summon up searing images from the Deepwater Horizon spill.",
    "link": "https://slate.com/news-and-politics/2026/01/trump-oil-spill-bp-venezuela-deepwater-gulf-drill.html",
    "timestamp": "2026-01-14T10:45:00Z"
  },
  {
    "title": "China, wary of global unrest, is keeping the oil market afloat",
    "description": "China’s purchases for its strategic reserve have kept the market from cratering.",
    "link": "https://www.livemint.com/industry/energy/crude-oil-prices-us-venezuela-news-china-11768387155776.html",
    "timestamp": "2026-01-14T10:43:15Z"
  },
  {
    "title": "Russia’s Lavrov says the U.S. is smashing the world around with its raid on Venezuela and threats to Iran",
    "description": "MOSCOW, Jan 14 (Reuters) - Russian Foreign Minister Sergei Lavrov said on Wednesday that the United States was fragmenting the very international system which Washington … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/russia-s-lavrov-says-the-u-s-is-smashing-the-world-around-with-its-raid-on-venezuela-and-threats-to-iran",
    "timestamp": "2026-01-14T10:43:00Z"
  },
  {
    "title": "Iran’s judiciary to speed up trials of accused in protests crackdown",
    "description": "Prosecutors say they are bringing capital charges of 'waging war against God' against 'rioters and saboteurs'.",
    "link": "https://www.aljazeera.com/news/2026/1/14/irans-judiciary-to-speed-up-trials-of-accused-in-protests-crackdown",
    "timestamp": "2026-01-14T10:40:06Z"
  },
  {
    "title": "How business leaders are responding to Trump's plan to cap credit card interest rates, from JPMorgan to SoFi",
    "description": "While major banks, including JPMorgan Chase and Citi, warned that a 10% credit card cap would reduce access to credit, some CEOs applaud the plan.",
    "link": "https://www.businessinsider.com/business-leaders-respond-trump-plan-cap-credit-card-interest-rate-2026-1",
    "timestamp": "2026-01-14T10:40:01Z"
  },
  {
    "title": "Argentina Logs Lowest Year-End Inflation in Eight Years",
    "description": "Argentina's yearly inflation in 2025 came in at 31.5 percent — the lowest in eight years - the National Institute of Statistics and Census of Argentina (INDEC) announced Tuesday.\nThe post Argentina Logs Lowest Year-End Inflation in Eight Years appeared first …",
    "link": "https://www.breitbart.com/latin-america/2026/01/14/argentina-logs-lowest-year-end-inflation-in-eight-years/",
    "timestamp": "2026-01-14T10:39:57Z"
  },
  {
    "title": "Blistering Metals Rally Sends Gold, Silver and Copper to Records",
    "description": "Commodities have posted eye-watering gains since late 2025 as traders position themselves for a year in which the Federal Reserve is expected to cut...",
    "link": "https://finance.yahoo.com/news/blistering-metals-rally-sends-gold-072908810.html",
    "timestamp": "2026-01-14T10:39:20Z"
  },
  {
    "title": "It's D-Day for Trump tariffs: How America can land in trouble",
    "description": "Trump Tariff SC Ruling: The Supreme Court's ruling on President Trump's global tariffs could significantly alter the balance of power between the White House and Congress. A decision against the tariffs could unravel trade deals, create refund complexities fo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/its-d-day-for-trump-tariffs-at-us-supreme-court-how-america-can-land-in-trouble/articleshow/126524158.cms",
    "timestamp": "2026-01-14T10:38:24Z"
  },
  {
    "title": "Pakistan signs deal to explore WLFI-linked stablecoin for payments",
    "description": "Pakistan signs MoU with World Liberty affiliate to explore stablecoin-based cross-border payments. USD1 stablecoin may integrate with Pakistan’s regulated payments system as digital finance efforts expand. Deal highlights Pakistan’s push to become a key digit…",
    "link": "https://coinjournal.net/news/pakistan-signs-deal-to-explore-wlfi-linked-stablecoin-for-payments/",
    "timestamp": "2026-01-14T10:38:09Z"
  },
  {
    "title": "EU could sanction US if it invades Greenland, MEP says ahead of high stakes White House meeting",
    "description": "Today, Denmark’s defence minister said the country would increase its military presence on the island.",
    "link": "https://www.thejournal.ie/eu-could-sanction-us-if-trump-invades-greenland-6926159-Jan2026/",
    "timestamp": "2026-01-14T10:30:40Z"
  },
  {
    "title": "Leaders are increasingly worried about an economic downturn, inflation, and an asset bubble bust",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2026/01/14/ceo-risks-report-wef-economic-downturn-inflation-bubble-bust/",
    "timestamp": "2026-01-14T10:28:55Z"
  },
  {
    "title": "Iran Has A Warning For U.S. Allies In The Middle East: Report",
    "description": "According to an Israeli assessment, Donald Trump has decided to intervene in Iran but the scope and timing of the action remains unclear, an Israeli official said.",
    "link": "https://www.huffpost.com/entry/iran-delivers-warning-to-us-middle-east-allies_n_69676bbee4b0d5c7db78bd37",
    "timestamp": "2026-01-14T10:25:51Z"
  },
  {
    "title": "Iran judiciary signals fast executions for protesters",
    "description": "The comments from Iran's judiciary chief come as activists warn that protesters detained during demonstrations in Iran could soon be hanged.",
    "link": "https://www.abc.net.au/news/2026-01-14/iran-judiciary-signals-fast-executions-for-protesters/106230222",
    "timestamp": "2026-01-14T10:24:48Z"
  },
  {
    "title": "China vows to protect interests after Trump's tariff threat over Iran trade",
    "description": "China has vowed to safeguard its rights and interests after US President Donald Trump threatened to impose an additional 25 percent tariff on countries doing business with Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-presstv09.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "China Opposes Interference in Other Countries' Internal Affairs - Foreign Ministry",
    "description": "Beijing opposes interference in other countries' internal affairs and threats of the use of force in international relations, Chinese Foreign Ministry spokeswoman Mao Ning said on Tuesday, commenting on the situation in Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/01/china-260113-sputnik01.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "Iran will respond more decisively to any potential act of aggression: Defense minister",
    "description": "The Iranian defense minister has once again warned that the Islamic Republic will respond more decisively to any new act of aggression.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-presstv07.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "Goldberg: 'Nothing Is Off The Table' For Trump's Response In Iran",
    "description": "As Iran's brutal crackdown on mass protests deepens and the news of thousands of protesters killed reaches the world, the global community waits to see how the United States will respond. US President Donald Trump has issued multiple ultimatums via social med…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-rferl04.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "Iran FM calls riots 'Daesh-style crimes,' extension of US-Israeli war",
    "description": "Foreign Minister Abbas Araghchi has described the recent riots targeting Iran as atrocities resembling those committed by the Daesh Takfiri terrorist group, saying they marked a continuation of the US's and the Israeli regime's imposed war against the country…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-presstv05.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "Iran's security chief calls Trump 'top killer of Iranians' after riot threat",
    "description": "The Secretary of Iran's Supreme National Security Council (SNSC) has rejected threats by US President Donald Trump against the nation, describing him as one of the main killers of Iranians.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-presstv06.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "Chinese FM responds to Trump's 25% tariff hike on Iran's trading partners",
    "description": "In response to claims by US President Donald Trump on Monday that any country doing business with Iran would face a 25 percent tariff hike on businesses being done with the US, Chinese Foreign Ministry spokesperson Mao Ning said at Tuesday's press briefing th…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-globaltimes02.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "US Gov't Considering Various Means of Pressuring Iran Beyond Airstrikes - Reports",
    "description": "The administration of US President Donald Trump is considering various measures against Iran beyond traditional airstrikes, including cyberoperations and campaigns to destabilize the government, US media reported, citing defense sources.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-sputnik02.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "UN chief concerned over Trump's anti-Iran rhetoric amid unrest: Spokesman",
    "description": "UN Secretary-General Antonio Guterres has voiced concern over the US interventionist stance and military threats against Tehran amid foreign-backed riots in Iran, according to his spokesman.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-presstv11.htm",
    "timestamp": "2026-01-14T10:20:40Z"
  },
  {
    "title": "US talks pose 'conundrum' for Greenland, Denmark: Analysts",
    "description": "U.S. officials are expected to meet with Danish and Greenlandic counterparts in Washington, D.C. on Wednesday.",
    "link": "https://abcnews.go.com/International/us-talks-pose-conundrum-greenland-denmark-analysts/story?id=129159022",
    "timestamp": "2026-01-14T10:19:39Z"
  },
  {
    "title": "US expected to unveil post-war Gaza leadership, sources say",
    "description": "By Nidal al-MughrabiCAIRO, Jan 14 (Reuters) - U.S. President Donald Trump is expected on Wednesday to push ahead with his phased plan for Gaza’s future by announcing the … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/us-expected-to-unveil-post-war-gaza-leadership-sources-say",
    "timestamp": "2026-01-14T10:19:17Z"
  },
  {
    "title": "Iran warned regional states of strikes on US bases if attacked, official says",
    "description": "DUBAI: Tehran has warned US allies in the Middle East it will strike US bases on their soil if Washington attacks Iran, a senior Iranian official told Reuters on Wednesday (Jan 14), following President Donald Trump's",
    "link": "https://www.channelnewsasia.com/world/iran-warn-strikes-us-bases-if-attacked-regional-states-5858366",
    "timestamp": "2026-01-14T10:16:50Z"
  },
  {
    "title": "US senators target Trump branding of federal institutions",
    "description": "The US legislation aims to prevent sitting presidents from putting their names on public infrastructure and programs Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630942-ban-presidents-naming-buildings/",
    "timestamp": "2026-01-14T10:16:13Z"
  },
  {
    "title": "Trump’s Persecution of Jerome Powell Is Even Crazier Than It Looks",
    "description": "The Trump administration is carrying out a corrupt prosecution of the Federal Reserve chair. But messing with Fed independence might spark inflation, and everyone hates that.\nThe post Trump’s Persecution of Jerome Powell Is Even Crazier Than It Looks appeared…",
    "link": "http://prospect.org/2026/01/14/trump-persecution-jerome-powell-federal-reserve-central-bank/",
    "timestamp": "2026-01-14T10:15:00Z"
  },
  {
    "title": "Trump Tells Iranians 'Help On The Way' As Death Toll In Protests Mounts",
    "description": "US President Donald Trump has told protesters in Iran that \"help is on the way\" as the death toll after more than two weeks of anti-government protests continues to increase, sparking a global outcry.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260113-rferl01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "'Resolving the Taiwan question is China's own matter': State Council Taiwan Affairs Office spokesperson responds to US leader's Taiwan-related remarks during interview with the New York Times",
    "description": "\"Resolving the Taiwan question is China's own matter,\" Zhu Fenglian, spokesperson for the State Council Taiwan Affairs Office said on Wednesday's press conference, noting that there is only one China in the world, Taiwan is part of China, and the Taiwan quest…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2026/taiwan-260114-globaltimes01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "US used warplane disguised as 'civilian aircraft' in deadly Caribbean strike: Report",
    "description": "A US attack on a boat in the Caribbean in September that claimed the lives of 11 people used a military aircraft that was disguised as a civilian one, a report says.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260113-presstv03.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Greenland PM rejects any suggestion it could become US territory, ahead of Greenlandic and Danish FMs meeting with Vance: reports",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen on Tuesday reaffirmed the island's ties with Denmark and rejected any suggestion that it could become a US territory, as Greenlandic and Danish foreign ministers are set to meet US Vice President JD Vance and S…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260114-globaltimes01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Afghanistan to Not Allow Foreign Troops in Country, Including at Bagram Air Base",
    "description": "Afghanistan does not accept the presence of any foreign military contingent on its territory, this also applies to the US requirements for the Bagram air base, Afghan government spokesman Zabihullah Mujahid said in an interview with Sputnik.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260113-sputnik01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "AU reaffirms commitment to multilateralism amid U.S. withdrawal from int'l organizations",
    "description": "African Union (AU) Commission Chairperson Mahmoud Ali Youssouf on Tuesday called for strengthening multilateral systems to address global challenges amid the U.S. decision to withdraw from various international institutions.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260114-pdo02.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Bipartisan U.S. lawmakers move to prevent attack on NATO allies amid Greenland concerns",
    "description": "A number of bipartisan U.S. lawmakers are introducing a bill aimed at preventing President Donald Trump from using the U.S. military to invade a NATO member or territory amid mounting concerns over Trump's remarks demanding Greenland's \"ownership.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260114-pdo03.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Trump says \"all meetings\" with Iranian officials cancelled",
    "description": "U.S. President Donald Trump said Tuesday that he has cancelled \"all meetings\" with Iranian officials.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260114-pdo01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "US designates Muslim Brotherhood branches in Egypt, Lebanon, Jordan as 'terrorist' groups",
    "description": "The United States has formally designated Muslim Brotherhood organizations in Egypt, Lebanon, and Jordan as \"terrorist\" groups, marking a major escalation in Washington's campaign against groups it claims threaten Israeli interests in the West Asia region.",
    "link": "https://www.globalsecurity.org/security/library/news/2026/01/sec-260114-presstv01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "EU Diplomats Do Not Believe US Will Use Military Force to Seize Greenland - Reports",
    "description": "The European Union does not believe the United States will use military force to seize Greenland but thinks that US President Donald Trump will be able to \"get something\" as a result of the pressure he is exerting, media reported, citing unnamed EU diplomats.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260113-sputnik02.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Denmark, Greenland PMs reaffirm unity, rejection of external claims",
    "description": "Danish Prime Minister Mette Frederiksen and Greenland's Prime Minister Jens-Frederik Nielsen held a joint press conference Tuesday afternoon, delivering a firm, unified rejection of external claims over Greenland.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260114-pdo04.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "U.S. ambition on Greenland unprecedented in NATO history: German defense minister",
    "description": "German Defense Minister Boris Pistorius said on Tuesday that the U.S. ambition to control Greenland would constitute \"a real unprecedented situation in the history of NATO and of any defense alliance in the world.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260114-pdo01.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Iranian FM says ready for war but open to dialogue following Trump's threats",
    "description": "Iranian Foreign Minister Abbas Araghchi said his country is ready for war but remains open to dialogue, after U.S. President Donald Trump said the U.S. military is considering \"very strong options\" regarding Iran amid recent unrest.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260114-pdo02.htm",
    "timestamp": "2026-01-14T10:14:43Z"
  },
  {
    "title": "Ford 'not moving backwards on EVs' despite £14.5bn write-down",
    "description": "American car maker last month announced huge EV investment cut in response to slowing consumer demand\n\nFord boss Jim Farley insists that the firm isn’t moving away from electric vehicles, despite making a massive £14.5 billion write-down after scrapping much …",
    "link": "https://www.autocar.co.uk/car-news/new-cars/ford-not-moving-backwards-evs-despite-%C2%A3145bn-write-down",
    "timestamp": "2026-01-14T10:14:27Z"
  },
  {
    "title": "Vance, Rubio set to meet Danish officials amid Trump's threats to 'acquire' Greenland",
    "description": "Vance, Rubio set to meet Danish officials amid Trump's threats to 'acquire' Greenlandgo.com",
    "link": "https://abcnews.go.com/Politics/vance-rubio-set-meet-danish-officials-amid-trumps/story?id=129169613",
    "timestamp": "2026-01-14T10:14:18Z"
  },
  {
    "title": "Russia says talk of a ceasefire, rather than a full peace deal, in Ukraine is simply not serious",
    "description": "MOSCOW, Jan 14 (Reuters) - Russian Foreign Minister Sergei Lavrov said on Wednesday that Russia was open for peace talks on Ukraine but that talk of a ceasefire ahead of … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/russia-says-talk-of-a-ceasefire-rather-than-a-full-peace-deal-in-ukraine-is-simply-not-serious",
    "timestamp": "2026-01-14T10:12:49Z"
  },
  {
    "title": "The death toll from a crackdown on protests in Iran jumps to over 2,500, activists say",
    "description": "The death toll from nationwide protests in Iran has surpassed 2,500, activists said, as Iranians made phone calls abroad for the first time in days Tuesday.",
    "link": "https://www.npr.org/2026/01/14/g-s1-105949/death-toll-crackdown-protests-iran",
    "timestamp": "2026-01-14T10:12:32Z"
  },
  {
    "title": "France to open consulate in Greenland in February amid Trump threats",
    "description": "Foreign Affairs Minister Jean-Noël Barrot says the move is a \"political signal.\"",
    "link": "https://www.politico.eu/article/france-announces-opening-consulate-greenland-amid-donald-trump-threats/",
    "timestamp": "2026-01-14T10:12:20Z"
  },
  {
    "title": "Europe Enters the Slop War",
    "description": "Inundated with manipulative slop that has warped public debate, the European Union has begun to confront the threat that social media platforms pose to democratic life. The fight ahead is not about free speech, as the United States contends, but about whether…",
    "link": "https://www.project-syndicate.org/commentary/europe-fight-against-x-opening-salvo-of-war-for-democratic-debate-by-cori-crider-2026-01",
    "timestamp": "2026-01-14T10:11:47Z"
  },
  {
    "title": "Venezuelan Oil and the Limits of U.S. Refining Capacity",
    "description": "Most economic analysis of Trump's planned Venezuela oil heist has focused on production. Time for a wee look at refining.",
    "link": "https://www.nakedcapitalism.com/2026/01/venezuelan-oil-and-the-limits-of-u-s-refining-capacity.html",
    "timestamp": "2026-01-14T10:11:04Z"
  },
  {
    "title": "Trump may fall for 'repackage' of Greenland deal if EU 'put a big bow on top': analysis",
    "description": "Donald Trump may be convinced to leave Greenland alone should Europe \"repackage\" security measures and \"put a big bow on top\" of a potential deal. The president made it clear he wanted the Kingdom of Denmark's territory for security reasons but has faced resi…",
    "link": "https://www.rawstory.com/trump-greenland-2674890501/",
    "timestamp": "2026-01-14T10:06:59Z"
  },
  {
    "title": "Economic confrontation replaces armed conflict as top risk in WEF survey",
    "description": "LONDON, Jan 14 (Reuters) - Economic confrontation between nations and its consequences topped the World Economic Forum’s (WEF) annual risks perception survey released on … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/economic-confrontation-replaces-armed-conflict-as-top-risk-in-wef-survey",
    "timestamp": "2026-01-14T10:04:12Z"
  },
  {
    "title": "'Punkish Move': Ex-RNC Chair Michael Steele Shreds Trump's Latest 'Bit Of Crap'",
    "description": "The MS NOW host put the president on blast for flipping off a factory worker.",
    "link": "https://www.huffpost.com/entry/michael-steele-trump-factory-worker_n_69675d65e4b0d5c7db78b727",
    "timestamp": "2026-01-14T10:03:15Z"
  },
  {
    "title": "Just one in five Americans support Trump’s efforts to acquire Greenland, Reuters/Ipsos poll finds",
    "description": "WASHINGTON, Jan 14 (Reuters) - Just 17% of Americans approve of President Donald Trump’s efforts to acquire Greenland, and substantial majorities of Democrats and Republi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/just-one-in-five-americans-support-trump-s-efforts-to-acquire-greenland-reuters-ipsos-poll-finds",
    "timestamp": "2026-01-14T10:02:46Z"
  },
  {
    "title": "Germany news: Reservist union head wants troops in Greenland",
    "description": "The president of the German Armed Forces' reservists says European troops should be sent to Greenland to block a US takeover of the territory. Meanwhile, heating bills are set to soar amid a harsh winter. DW has more. The president of the German Armed Forces'…",
    "link": "https://www.dw.com/en/germany-head-of-armed-forces-reservists-association-wants-troops-sent-to-greenland-to-block-us/live-75499952",
    "timestamp": "2026-01-14T10:01:00Z"
  },
  {
    "title": "Venezuelans in U.S. facing immigration limbo feel it's still not safe to return",
    "description": "Multiple Venezuelan migrants and asylum-seekers said that the country is still far too dangerous and unstable for them to return.",
    "link": "https://www.nbcnews.com/news/us-news/maduro-jail-venezuelans-facing-immigration-limbo-feel-s-still-not-safe-rcna252365",
    "timestamp": "2026-01-14T10:00:40Z"
  },
  {
    "title": "Democrats outline 'multiple paths' to a Senate majority — all through red terrain",
    "description": "Democrats believe they now have “multiple paths” to flipping the Senate this year, touting strong recruits in some deep-red states and a message focused on costs and health care.",
    "link": "https://www.nbcnews.com/politics/2026-election/democrats-outline-multiple-paths-senate-majority-red-terrain-rcna253623",
    "timestamp": "2026-01-14T10:00:40Z"
  },
  {
    "title": "Russia watches as ally Iran edges closer to collapse. Here's why it matters for Moscow",
    "description": "The prospect of another ally falling in the Middle East will be a worrying one for Moscow, particularly after it has seen other alliances collapse recently.",
    "link": "https://www.cnbc.com/2026/01/14/russia-iran-unrest-collapse-trump-moscow.html",
    "timestamp": "2026-01-14T10:00:28Z"
  },
  {
    "title": "Democratic Leaders See A Path To A Senate Majority, And An Answer to Their Critics",
    "description": "Chuck Schumer and Kirsten Gillibrand are confident they've recruited top-flight candidates in enough states to flip the Senate in 2026.",
    "link": "https://www.huffpost.com/entry/democratic-leaders-see-a-path-to-a-senate-majority-and-an-answer-to-their-critics_n_69671562e4b09c0a939c46c8",
    "timestamp": "2026-01-14T10:00:17Z"
  },
  {
    "title": "The Takeover of Kirk Country",
    "description": "Charlie Kirk’s death was meant to remake the MAGA youth movement in his image. It’s been overwhelmed by darker forces.",
    "link": "http://nymag.com/intelligencer/article/charlie-kirk-turning-point-usa-new-leader-maga-movement.html",
    "timestamp": "2026-01-14T10:00:05Z"
  },
  {
    "title": "Buying Greenland could cost as much as $700 billion",
    "description": "WASHINGTON — The U.S. could have to pay as much as $700 billion if it were to achieve President Donald Trump’s goal of buying Greenland, according to three people familiar with the cost estimate",
    "link": "https://www.nbcnews.com/politics/white-house/buying-greenland-cost-much-700-billion-rcna253921",
    "timestamp": "2026-01-14T10:00:00Z"
  },
  {
    "title": "How the Supreme Court Could End Super PACs—Without Overturning Citizens United",
    "description": "Harvard law professor Lawrence Lessig explains a promising new strategy to stop the surge of dark money in politics.\nThe post How the Supreme Court Could End Super PACs—Without Overturning Citizens United appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/01/14/how-the-supreme-court-could-end-super-pacs/",
    "timestamp": "2026-01-14T10:00:00Z"
  }
]