[
  {
    "title": "Evidence Contradicts Trump Immigration Officials' Accounts Of Violent Encounters",
    "description": "In response to a Reuters request for comment, DHS pointed to previous statements about the incidents involving their officers.",
    "link": "https://www.huffpost.com/entry/evidence-contradicts-trump-immigration-officials-accounts-violent-encounters_n_697a7fade4b025706e869bf1",
    "timestamp": "2026-01-28T21:53:25Z"
  },
  {
    "title": "Minnesota Live Updates: Federal Agents Involved in Deadly Minneapolis Shooting Now on Leave, DHS Says - The New York Times",
    "description": "Minnesota Live Updates: Federal Agents Involved in Deadly Minneapolis Shooting Now on Leave, DHS SaysThe New York Times Two federal agents involved in Alex Pretti shooting placed on administrative leaveThe Washington Post Two agents who shot Minnesota man on …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680614",
    "timestamp": "2026-01-28T21:53:15Z"
  },
  {
    "title": "NFL World Calling for Hall of Fame Voters to be 'Exposed' After Belichick Snub",
    "description": "Many in the world of pro-football are calling for the names and votes of the members of the media who snubbed Bill Belichick to be exposed.\nThe post NFL World Calling for Hall of Fame Voters to be ‘Exposed’ After Belichick Snub appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/01/28/nfl-world-calling-for-hall-of-fame-voters-to-be-exposed-after-belichick-snub/",
    "timestamp": "2026-01-28T21:53:09Z"
  },
  {
    "title": "Gulf shipping operations grind to halt near Iran, US quietly prepares for possible strike: 'Heightened risk'",
    "description": "Maritime intelligence warns of heightened risks for U.S.-flagged vessels in Persian Gulf as Iran threatens \"immediate, all-out\" response to any American military action.",
    "link": "https://www.foxnews.com/world/global-shipping-grinds-halt-near-iran-us-quietly-prepares-possible-strike-heightened-risk",
    "timestamp": "2026-01-28T21:53:03Z"
  },
  {
    "title": "One Nation surges into second place in two polls, but Labor remains well ahead after preferences",
    "description": "Five federal polls have been released in the past week, painting a rosy picture for Pauline Hanson’s party.",
    "link": "https://theconversation.com/one-nation-surges-into-second-place-in-two-polls-but-labor-remains-well-ahead-after-preferences-274104",
    "timestamp": "2026-01-28T21:52:58Z"
  },
  {
    "title": "Trump PAC Threatens To Have ICE 'Track Down' MAGA Donors Who Don't Answer Survey",
    "description": "“Are you a proud American Citizen or does ICE need to come and track you down?” the email said.",
    "link": "https://www.huffpost.com/entry/trump-pac-maga-donor-ice-track-them-down_n_697a6ff8e4b025706e868e93",
    "timestamp": "2026-01-28T21:52:22Z"
  },
  {
    "title": "A Breakdown of the American Idea",
    "description": "The country’s founding principles will survive only if the public remains willing to fight for them.",
    "link": "https://www.theatlantic.com/ideas/2026/01/minnesota-america-citizenship-lincoln/685791/",
    "timestamp": "2026-01-28T21:52:00Z"
  },
  {
    "title": "Trump admin says San Jose State broke law by allowing transgender volleyball player to compete",
    "description": "The Trump administration has concluded that San Jose State University discriminated against women by letting a transgender athlete play on the women’s volleyball team, the U.S. Education Department said Wednesday.",
    "link": "https://nypost.com/2026/01/28/sports/trump-admin-says-san-jose-state-broke-law-by-allowing-transgender-volleyball-player-to-compete/",
    "timestamp": "2026-01-28T21:51:50Z"
  },
  {
    "title": "Bruce Springsteen's Protest Song: Streets of Minneapolis",
    "description": "Bruce Springsteen releases powerful protest single 'Streets of Minneapolis' condemning ICE violence and honoring victims Renee Good and Alex Pretti.",
    "link": "https://screenrant.com/bruce-springsteen-releases-protest-track-streets-of-minneapolis/",
    "timestamp": "2026-01-28T21:51:35Z"
  },
  {
    "title": "Duckworth Claims Trump Admin Is Torturing and Deporting ‘Innocent People’ in Heated Exchange with Rubio",
    "description": "At a Senate Foreign Relations Committee hearing on Wednesday, Sen. Tammy Duckworth, D-Ill., told Secretary of State Marco Rubio that “innocent people” are being “torture[d]... Read More\nThe post Duckworth Claims Trump Admin Is Torturing and Deporting ‘Innocen…",
    "link": "https://www.dailysignal.com/2026/01/28/duckworth-claims-trump-admin-is-torturing-and-deporting-innocent-people-in-heated-exchange-with-rubio/",
    "timestamp": "2026-01-28T21:50:00Z"
  },
  {
    "title": "China Eggs On Canadian PM Mark Carney Trashing U.S.",
    "description": "China’s state-run Global Times on Wednesday was delighted by the tiff between Canadian Prime Minister Mark Carney and U.S. Treasury Secretary Scott Bessent, urging Carney to prove his mettle by doubling down on the anti-American comments that Bessent claimed …",
    "link": "https://www.breitbart.com/asia/2026/01/28/china-eggs-on-canadian-pm-mark-carney-trashing-u-s/",
    "timestamp": "2026-01-28T21:49:22Z"
  },
  {
    "title": "The Killing of Alex Pretti Is a Reminder That All State Laws Are Backed Up by Violence",
    "description": "All state laws ultimately rest on the threat of violent enforcement. Libertarians have long been making this point.",
    "link": "https://reason.com/2026/01/28/the-killing-of-alex-pretti-is-a-reminder-that-all-state-laws-are-backed-up-by-violence/",
    "timestamp": "2026-01-28T21:47:42Z"
  },
  {
    "title": "2 federal agents involved in Alex Pretti shooting have been on administrative leave since Saturday, DHS says",
    "description": "The announcement came as President Donald Trump seemed to signal a willingness to ease tensions in Minneapolis.",
    "link": "https://www.pbs.org/newshour/politics/2-federal-agents-involved-in-alex-pretti-shooting-have-been-on-administrative-leave-since-saturday-dhs-says",
    "timestamp": "2026-01-28T21:47:36Z"
  },
  {
    "title": "Layoffs are piling up, heightening worker anxiety in U.S.",
    "description": "As layoffs pile up, workers are feeling increasingly anxious about the job market. In the U.S., economists have said that businesses are largely at a “no-hire, no fire” standstill, leading many to limit new work, if not pause openings entirely amid economic u…",
    "link": "https://japantoday.com/category/business/layoffs-are-piling-up-heightening-worker-anxiety.-here-are-some-of-the-biggest-job-cuts-recently",
    "timestamp": "2026-01-28T21:47:19Z"
  },
  {
    "title": "Bruce Springsteen sings out against Trump in 'Streets of Minneapolis'",
    "description": "Bruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing President Donald Trump's ongoing immigration enforcement operations in the city. The lyrics of “Streets of Minneapolis,” released Wednesday, describe how “a city aflame fou…",
    "link": "https://japantoday.com/category/entertainment/bruce-springsteen-takes-aim-at-trump-in-new-song-%27streets-of-minneapolis%27",
    "timestamp": "2026-01-28T21:44:35Z"
  },
  {
    "title": "Bessent warns Carney against picking a fight before US-Canada-Mexico trade talks",
    "description": "Since a high-profile speech in Davos, he's sparred with Trump and Bessent about trade issues.",
    "link": "https://www.bostonherald.com/2026/01/28/united-states-canada-bessent-warning/",
    "timestamp": "2026-01-28T21:44:29Z"
  },
  {
    "title": "Majority of Americans Want ICE Defunded as Confidence in Agency Collapses",
    "description": "In a recent poll, 55 percent of Americans said they have “no confidence” in ICE.",
    "link": "https://truthout.org/articles/majority-of-americans-want-ice-defunded-as-confidence-in-agency-collapses/",
    "timestamp": "2026-01-28T21:43:50Z"
  },
  {
    "title": "The More You Hate Trump, the More Nicki Minaj Loves Him",
    "description": "Nicki Minaj says she’s Donald Trump’s ‘No. 1 fan’ and that the more you hate him, the more she’ll love him. The rapper appeared with Trump and Kevin O’Leary at a Treasury Department event on Wednesday.",
    "link": "http://www.vulture.com/article/nicki-minaj-trump-number-1-fan.html",
    "timestamp": "2026-01-28T21:43:36Z"
  },
  {
    "title": "Trump's Education Dept. claims San José State violated Title IX with trans inclusion in women's sports",
    "description": "The Trump administration claims San José State University in California violated federal law by allowing a transgender woman to play on the women’s volleyball team.",
    "link": "https://www.advocate.com/news/education/sjsu-violated-title-ix-transgender",
    "timestamp": "2026-01-28T21:43:03Z"
  },
  {
    "title": "Bessent rules out U.S. currency intervention to prop up Japanese yen",
    "description": "U.S. Treasury Secretary Scott Bessent on Wednesday ruled out his country intervening in the currency market to prop up the Japanese yen, and said that Washington remains supportive of a &quot;strong dollar policy.&quot; Bessent said in a CNBC interview that t…",
    "link": "https://japantoday.com/category/politics/bessent-rules-out-u.s.-currency-intervention-to-prop-up-japanese-yen",
    "timestamp": "2026-01-28T21:42:22Z"
  },
  {
    "title": "Bruce Springsteen sings out against Trump in 'Streets of Minneapolis'",
    "description": "Bruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing President Donald Trump's ongoing immigration enforcement operations in the city.",
    "link": "https://www.wesh.com/article/bruce-springsteen-streets-of-minneapolis/70177020",
    "timestamp": "2026-01-28T21:42:21Z"
  },
  {
    "title": "Shutdown looms as Dems reveal demands for sweeping ICE overhaul",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) has planted his flag on a series of reforms to Immigration and Customs Enforcement that Senate Democrats are demanding in order to approve the funding bill for the Department of Homeland Security.According to Igor B…",
    "link": "https://www.rawstory.com/chuck-schumer-2675056117/",
    "timestamp": "2026-01-28T21:42:00Z"
  },
  {
    "title": "Trump endorses Republican Rep. Tom Tiffany in Wisconsin's open race for governor",
    "description": "Trump announced the endorsement in a social media post on Tuesday night, saying Tiffany \"has always been at my side.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-endorses-republican-rep-tom-tiffany-in-wisconsins-open-race-for-governor",
    "timestamp": "2026-01-28T21:41:16Z"
  },
  {
    "title": "FBI searches Atlanta election office, chasing Trump 2020 vote fraud claims",
    "description": "The FBI searched an election office in Georgia's Fulton County outside Atlanta on Wednesday, pursuing U.S. President Donald Trump's false claims that his 2020 election defeat was the ‌result of widespread voting fraud. The FBI said in a brief statement that i…",
    "link": "https://japantoday.com/category/world/fbi-searches-atlanta-election-office-chasing-trump-2020-vote-fraud-claims1",
    "timestamp": "2026-01-28T21:41:01Z"
  },
  {
    "title": "Rubio says work under way to resolve 'very difficult' Donetsk issue in Ukraine peace talks",
    "description": "There is active work under way to reconcile the territorial issue of Donetsk at U.S.-mediated talks to end Russia's war in ‌Ukraine, U.S. Secretary of State Marco Rubio said on Wednesday, describing the disagreement as a key remaining issue that is &quot;very…",
    "link": "https://japantoday.com/category/world/rubio-says-work-under-way-to-resolve-%27very-difficult%27-donetsk-issue-in-ukraine-peace-talks",
    "timestamp": "2026-01-28T21:40:46Z"
  },
  {
    "title": "Bessent cautions Carney against picking a fight before U.S.-Canada-Mexico trade talks",
    "description": "U.S. Treasury Secretary Scott Bessent on Wednesday warned Canadian Prime Minister Mark Carney that his recent public comments against U.S. trade policy could backfire going into the formal review of the U.S.-Mexico-Canada Agreement, the trade deal that protec…",
    "link": "https://japantoday.com/category/world/bessent-warns-carney-against-picking-a-fight-before-us-canada-mexico-trade-talks",
    "timestamp": "2026-01-28T21:40:39Z"
  },
  {
    "title": "Trump urges Iran to make nuclear deal or next attack will be 'far worse'",
    "description": "U.S. President Donald Trump urged Iran on Wednesday to come to the table and make a deal on nuclear weapons or the next U.S. attack ‌would be far worse. Tehran responded with a threat to strike back against the United States, Israel and those who support them…",
    "link": "https://japantoday.com/category/world/trump-warns-iran-to-make-nuclear-deal-or-next-attack-will-be-%27far-worse%27",
    "timestamp": "2026-01-28T21:40:23Z"
  },
  {
    "title": "British leader's trip to China is balancing act between trade, national security and Trump",
    "description": "UK Prime Minister Keir Starmer said on Wednesday that his country doesn't have to choose between relations with the United States and China as he started a four-day trip to China aimed at repairing ties and expanding opportunities for British companies in the…",
    "link": "https://japantoday.com/category/world/what-to-know-about-uk-china-relations-as-prime-minister-keir-starmer-visits-beijing",
    "timestamp": "2026-01-28T21:40:07Z"
  },
  {
    "title": "Trump warns Minneapolis mayor over lack of cooperation with immigration agents",
    "description": "U.S. President Donald Trump warned Minneapolis Mayor Jacob Frey on Wednesday he was &quot;playing with fire&quot; after the Democratic leader reiterated that his city would not help federal agents enforce immigration law, a day after the president said his ad…",
    "link": "https://japantoday.com/category/world/trump-warns-minneapolis-mayor-over-lack-of-cooperation-with-immigration-agents",
    "timestamp": "2026-01-28T21:39:54Z"
  },
  {
    "title": "Brandon Johnson Admits He’s Coordinating With Other Democrat Mayors To Thwart ICE",
    "description": "Democratic Mayor Brandon Johnson of Chicago admitted he was “in regular communication” with other mayors in efforts to impede enforcement of immigration laws.",
    "link": "https://dailycaller.com/2026/01/28/brandon-johnson-admits-hes-coordinating-with-other-democrat-mayors-to-thwart-ice/",
    "timestamp": "2026-01-28T21:39:20Z"
  },
  {
    "title": "Guarantees to Kiev Would Mean US Involvement in Potential New Conflict — Rubio",
    "description": "Marco Rubio also criticized the military potential of the US's European NATO allies, namely its erosionWASHINGTON, January 28. /TASS/. Security guarantees to Kiev would mean the direct involvement of the United States and the West as a whole in a new conflict…",
    "link": "https://freerepublic.com/focus/f-news/4364434/posts",
    "timestamp": "2026-01-28T21:37:16Z"
  },
  {
    "title": "Bruce Springsteen sings out against Trump in 'Streets of Minneapolis'",
    "description": "Bruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing President Donald Trump's ongoing immigration enforcement operations in the city.",
    "link": "https://www.wisn.com/article/bruce-springsteen-streets-of-minneapolis/70177020",
    "timestamp": "2026-01-28T21:35:27Z"
  },
  {
    "title": "Police Have Identified the Substance Sprayed on Ilhan Omar",
    "description": "The incident spurred almost immediate speculation that the attack was staged. The finding was unlikely to dampen that.",
    "link": "https://www.westernjournal.com/police-identified-substance-sprayed-ilhan-omar/",
    "timestamp": "2026-01-28T21:33:38Z"
  },
  {
    "title": "Trump's National Guard deployments could cost over $1 billion this year, CBO projects - NPR",
    "description": "Trump's National Guard deployments could cost over $1 billion this year, CBO projectsNPR Trump’s deployment of National Guard costs taxpayers nearly $500 million, CBO saysThe Hill Estimating the Costs of Troop Deployments to U.S. CitiesCongressional Budget Of…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680494",
    "timestamp": "2026-01-28T21:33:17Z"
  },
  {
    "title": "Nunn: Extend enhanced health care tax credits as transition to repealing ACA",
    "description": "U.S. Rep. Zach Nunn told Republicans Wednesday he does not support the Affordable Care Act – but that without an extension of enhanced tax credits that subsidize premiums, more than 126,000 Iowans will be unable to afford health care.",
    "link": "https://www.kcci.com/article/zach-nunn-affordable-care-act-extend-enhanced-health-care-tax-credits-as-transition-to-repeal-aca/70177480",
    "timestamp": "2026-01-28T21:33:13Z"
  },
  {
    "title": "FBI searches Fulton County election hub in connection with Trump's 2020 election loss - NBC News",
    "description": "FBI searches Fulton County election hub in connection with Trump's 2020 election lossNBC News FBI raids Fulton County election officeajc.com FBI searching Fulton County elections office as it investigates alleged voter fraudCNN FBI executes search warrant at …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680490",
    "timestamp": "2026-01-28T21:33:07Z"
  },
  {
    "title": "U.S. Forces Prepare for ‘Readiness Exercise’ in Middle East as Tensions Rise with Iran",
    "description": "U.S. Central Command (CENTCOM) announced on Tuesday that the Ninth Air Force will conduct a “multi-day readiness exercise” in the Middle East to “demonstrate the ability to deploy, disperse, and sustain combat airpower.” One place they could soon be called up…",
    "link": "https://www.breitbart.com/middle-east/2026/01/28/u-s-forces-prepare-for-readiness-exercise-in-middle-east-as-tensions-rise-with-iran/",
    "timestamp": "2026-01-28T21:32:59Z"
  },
  {
    "title": "South Africa Cancels Release of ‘Melania’ Documentary - The New York Times",
    "description": "South Africa Cancels Release of ‘Melania’ DocumentaryThe New York Times ‘Chaos’: Behind the Scenes of Amazon’s Melania Trump DocRolling Stone The ‘Melania’ Movie Isn’t Selling Out Theaters—Despite Trump’s ClaimForbes Melania documentary struggles in UK cinema…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680486",
    "timestamp": "2026-01-28T21:32:57Z"
  },
  {
    "title": "US intelligence agencies disagree with Trump’s opposition to Chagos deal, says Starmer - The Guardian",
    "description": "US intelligence agencies disagree with Trump’s opposition to Chagos deal, says StarmerThe Guardian Starmer defends Trump-enraging Chagos Islands dealpolitico.eu Talks with US over Chagos Islands deal have reopened, confirms Keir StarmerFinancial Times Europea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680482",
    "timestamp": "2026-01-28T21:32:46Z"
  },
  {
    "title": "Dem Won’t Drop Out of Ohio AG Race After Plan to ‘Kill Trump’",
    "description": "Elliot Forhan, a Democrat running for attorney general in Ohio, has told The Daily Signal he’s still “running to be Ohio’s next attorney general,” after... Read More\nThe post Dem Won’t Drop Out of Ohio AG Race After Plan to ‘Kill Trump’ appeared first on The …",
    "link": "https://www.dailysignal.com/2026/01/28/dem-wont-drop-out-of-ohio-ag-race-after-plan-to-kill-trump/",
    "timestamp": "2026-01-28T21:32:45Z"
  },
  {
    "title": "Bruce Springsteen criticizes ICE, Trump in protest song Streets of Minneapolis",
    "description": "Bruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing U.S. President Donald Trump's ongoing immigration enforcement operations in the city.",
    "link": "https://www.cbc.ca/news/entertainment/springsteen-streets-of-minneapolis-9.7065555",
    "timestamp": "2026-01-28T21:32:15Z"
  },
  {
    "title": "Breitbart Business Digest: How Trump Accounts Could Turn Working-Class Kids into Millionaires",
    "description": "What began as Section 530A in last year's One Big Beautiful Bill Act is evolving into something more substantial: a multi-layered wealth-building system combining government seed capital, corporate matching, philanthropic donations, and family savings.\nThe po…",
    "link": "https://www.breitbart.com/economy/2026/01/28/breitbart-business-digest-how-trump-accounts-could-turn-working-class-kids-into-millionaires/",
    "timestamp": "2026-01-28T21:31:01Z"
  },
  {
    "title": "Ghislaine Maxwell Reveals List Of Epstein “Co-Conspirators”",
    "description": "According to reports, a new petition from convicted Jeffrey Esptein accomplice Ghislaine Maxwell has a striking revelation in it, alleging that there were more people involved in the late financier’s abuse who haven’t been charged. The news comes as many ques…",
    "link": "https://hiphopwired.com/3020970/ghislaine-maxwell-reveals-list-of-epstein-co-conspirators/",
    "timestamp": "2026-01-28T21:29:08Z"
  },
  {
    "title": "Minneapolis sees little change on the streets despite Trump suggesting an easing of tensions",
    "description": "Immigration enforcement operations and confrontations with activists continued Wednesday in Minneapolis and St. Paul.",
    "link": "https://www.pbs.org/newshour/politics/minneapolis-sees-little-change-on-the-streets-despite-trump-suggesting-an-easing-of-tensions",
    "timestamp": "2026-01-28T21:27:58Z"
  },
  {
    "title": "Dem Candidate Threatens to Execute Trump",
    "description": "A Democrat candidate in Ohio fantasized on social media about executing President Donald Trump. Ohio attorney general candidate Elliot Forhan appears to think that his authority and right, should he win his election, would be to kill Trump. And yes, he did re…",
    "link": "https://freerepublic.com/focus/f-news/4364433/posts",
    "timestamp": "2026-01-28T21:27:47Z"
  },
  {
    "title": "MAGA Creeps Claim Attack On Rep. Omar Was A False Flag",
    "description": "Real America's Voice co-hosts Terrance Bates, Dr. Gina Loudon, and David Brody opined like jackasses that Rep. Ilhan Omar orchestrated her attack last night at a town hall when a Trump supporting man sprayed her with a liquid from a syringe.\nDonald Trump has …",
    "link": "https://crooksandliars.com/2026/01/maga-creeps-claim-attack-rep-omar-false",
    "timestamp": "2026-01-28T21:27:38Z"
  },
  {
    "title": "Fed stays put on rates",
    "description": "Federal Reserve officials left interest rates unchanged and pointed to improvements in the U.S. economy as they signaled a more cautious approach to potential future adjustments.",
    "link": "https://www.bostonherald.com/2026/01/28/fed-stays-put-on-rates/",
    "timestamp": "2026-01-28T21:27:22Z"
  },
  {
    "title": "Retiring GOP Senator Has Brash Response To Trump Calling Him A 'Loser'",
    "description": "Sen. Thom Tillis (R-N.C.) drew the president's ire after calling for Homeland Security Secretary Kristi Noem to be fired.",
    "link": "https://www.huffpost.com/entry/thom-tillis-donald-trump-kristi-noem-loser_n_697a6baae4b025706e86890c",
    "timestamp": "2026-01-28T21:25:32Z"
  },
  {
    "title": "'We Will Not Bow': No Kings 3 Rallies Scheduled for March 28 With Flagship Event in Minnesota",
    "description": "A third No Kings nationwide protest has been scheduled, US organizers announced on Wednesday.The official No Kings Coalition website revealed that the next day of protest will take place on Saturday, March 28, with a flagship rally set to take place in Minnes…",
    "link": "https://www.commondreams.org/news/no-kings-3-march-28",
    "timestamp": "2026-01-28T21:24:42Z"
  },
  {
    "title": "Bruce Springsteen releases anti-Ice song dedicated to Minneapolis and criticises Trump",
    "description": "Springsteen says the song responds to ‘state terror’ in Minneapolis, with lyrics describing federal agents as ‘King Trump’s private army’",
    "link": "https://www.irishtimes.com/culture/music/2026/01/28/bruce-springsteen-releases-anti-ice-song-dedicated-to-minneapolis-and-criticises-trump/",
    "timestamp": "2026-01-28T21:21:58Z"
  },
  {
    "title": "Fed holds rate steady as recent dollar slide fuels Bitcoin, crypto debate",
    "description": "The FOMC paused rate cuts, but a weakening dollar may be doing the easing instead, reshaping expectations for Bitcoin, crypto markets and US monetary policy.",
    "link": "https://cointelegraph.com/news/fed-holds-rates-weak-dollar-bitcoin-crypto-outlook",
    "timestamp": "2026-01-28T21:18:17Z"
  },
  {
    "title": "Trump return to Iowa likely ahead of high-stakes midterms, GOP gubernatorial candidate says",
    "description": "Former President Donald Trump is expected to return to Iowa as Republicans gear up for high-stakes midterm elections, according to a GOP gubernatorial candidate.",
    "link": "https://www.foxnews.com/politics/trump-return-iowa-likely-ahead-high-stakes-midterms-gop-gubernatorial-candidate-says",
    "timestamp": "2026-01-28T21:18:05Z"
  },
  {
    "title": "France says will support EU designation of Iran’s IRGC as ‘terrorist’ group",
    "description": "Foreign minister announces apparent reversal of France's stance, saying Iran protest crackdown 'cannot go unanswered'.",
    "link": "https://www.aljazeera.com/news/2026/1/28/france-says-will-support-eu-designation-of-irans-irgc-as-terrorist-group",
    "timestamp": "2026-01-28T21:16:38Z"
  },
  {
    "title": "German development policy: Partners in the Global South",
    "description": "The Federal Minister for Economic Cooperation and Development is focusing on solidarity and partnership in turbulent geopolitical times. Alabali Radovan's trip to Sierra Leone in West Africa illustrates what this means.",
    "link": "https://www.dw.com/en/german-development-policy-partners-in-the-global-south/a-75702908",
    "timestamp": "2026-01-28T21:15:00Z"
  },
  {
    "title": "Powell warns Lisa Cook's Supreme Court case could be most consequential legal threat in Fed’s history",
    "description": "Jerome Powell calls Supreme Court case involving Fed governor Lisa Cook \"perhaps the most important legal case in the Fed's 113-year history.\"",
    "link": "https://www.foxnews.com/politics/powell-warns-lisa-cooks-supreme-court-case-could-most-consequential-legal-threat-feds-history",
    "timestamp": "2026-01-28T21:14:47Z"
  },
  {
    "title": "Bruce Springsteen releases anti-ICE protest song ‘Streets of Minneapolis’ - NPR",
    "description": "Bruce Springsteen releases anti-ICE protest song ‘Streets of Minneapolis’NPR Bruce Springsteen releases anti-ICE protest song: ‘Streets of Minneapolis’minnesotareformer.com Bruce Springsteen blasts 'King Trump,' slams Alex Pretti shooting in new songUSA Today…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680412",
    "timestamp": "2026-01-28T21:13:21Z"
  },
  {
    "title": "Patreon creators have to switch to subscription billing by November, thanks to Apple",
    "description": "Patreon creators will need to make some changes soon, thanks to Apple. On Wednesday, Patreon said Apple has renewed its requirement that all Patreon creators must move to subscription billing. The deadline to do so is November 1, 2026. Patreon's blog post ann…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680402",
    "timestamp": "2026-01-28T21:12:29Z"
  },
  {
    "title": "Tesla discontinues Model S and Model X | CNN Business",
    "description": "Tesla CEO Elon Musk, who turned an upstart electric vehicle maker into an industry-changing powerhouse, is pulling the plug on the two models that helped get him there, as he struggles with another quarter of declining profits and car sales.",
    "link": "https://www.cnn.com/2026/01/28/business/tesla-q4-2025-earnings",
    "timestamp": "2026-01-28T21:11:57Z"
  },
  {
    "title": "Syrian president visits Moscow for second time in under four months",
    "description": "The Russian and Syrian presidents discussed strengthening bilateral cooperation during the talks in Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631681-syrian-russian-president-visit-talks/",
    "timestamp": "2026-01-28T21:10:38Z"
  },
  {
    "title": "Tim Walz Brags He’d ‘Beat The Sh*t Out Of’ JD Vance In Debate Rematch",
    "description": "Democratic Governor Tim Walz of Minnesota stated he could \"beat the shit out of\" Vice President JD Vance in a debate on a podcast appearance which aired Monday.",
    "link": "https://dailycaller.com/2026/01/28/tim-walz-jd-vance-debate-rematch/",
    "timestamp": "2026-01-28T21:10:13Z"
  },
  {
    "title": "US, Greenland and Denmark start diplomatic talks to ease Trump tensions",
    "description": "COPENHAGEN, ‌Jan 28 (Reuters) - ‌Talks between the ‌United States, Greenland and Denmark began ‍on Wednesday, ‍the Danish ‌foreign ministry said, ‍as the ​three ⁠parties seek to resolve a ‌diplomatic crisis over ⁠President ‍Donald Trump's threats against ‍the…",
    "link": "https://www.thestar.com.my/news/world/2026/01/29/us-greenland-and-denmark-start-diplomatic-talks-to-ease-trump-tensions",
    "timestamp": "2026-01-28T21:10:00Z"
  },
  {
    "title": "Venezuela Leader Pressed From All Sides Over Oil Industry Plans",
    "description": "Venezuela’s interim leader is playing to three different audiences with her plans for Venezuela’s oil sector: foreign investors, the Donald Trump administration, and her own socialist supporters. None of them is happy with it.",
    "link": "https://financialpost.com/pmn/business-pmn/venezuela-leader-pressed-from-all-sides-over-oil-industry-plans",
    "timestamp": "2026-01-28T21:09:40Z"
  },
  {
    "title": "Trump Iran Threat Pushes Oil Higher",
    "description": "Markets turned more bullish as traders priced in rising volatility and tighter near-term supply.",
    "link": "https://www.rigzone.com/news/wire/trump_iran_threat_pushes_oil_higher-28-jan-2026-182877-article/",
    "timestamp": "2026-01-28T21:09:05Z"
  },
  {
    "title": "U.S. ICE Actions Spark International Concern",
    "description": "Foreign countries appear worried that the United States’ immigration crackdown could have spillover effects.",
    "link": "http://foreignpolicy.com/2026/01/28/ice-shootings-us-minneapolis-immigration-trump-italy-winter-olympics-world-cup-ecuador/",
    "timestamp": "2026-01-28T21:08:51Z"
  },
  {
    "title": "Tesla hits a grim milestone: its second straight year of losses",
    "description": "Tesla just reported its second consecutive year of declining revenue and profits, further complicating Elon Musk's $1 trillion effort to transform his company into a leader in AI and robotics. Meanwhile, the global EV market continues to grow, seemingly in sp…",
    "link": "https://www.theverge.com/transportation/869603/tesla-q4-2025-earnings-revenue-profit-musk-robotaxis",
    "timestamp": "2026-01-28T21:08:42Z"
  },
  {
    "title": "Federal Reserve keeps interest rates unchanged despite Trump pressure",
    "description": "The Federal Reserve has voted to keep interest rates the same - despite pressure from Donald Trump to make a cut.",
    "link": "https://news.sky.com/story/federal-reserve-opts-against-interest-rate-cut-despite-donald-trump-pressure-on-jerome-powell-13500359",
    "timestamp": "2026-01-28T21:08:00Z"
  },
  {
    "title": "Schumer rolls out list of ICE demands as White House says Dems 'blocked' deal-making session",
    "description": "Senate Democrats unveiled their ICE accountability demands, including body cameras, warrant restrictions, coordination with local police after fatal immigration operation shooting.",
    "link": "https://www.foxnews.com/politics/schumer-rolls-out-list-ice-demands-white-house-says-dems-blocked-deal-making-session",
    "timestamp": "2026-01-28T21:07:18Z"
  },
  {
    "title": "Meta boosts annual capex sharply on superintelligence push, shares jump",
    "description": "Jan 28 : Instagram-owner Meta on Wednesday boosted its capital spending plans for the new year by 73 per cent in the pursuit of \"superintelligence,\" an effort to offer deeply personalized artificial intelligence to its large social media user base.Meta shares…",
    "link": "https://www.channelnewsasia.com/business/meta-boosts-annual-capex-sharply-superintelligence-push-shares-jump-5892196",
    "timestamp": "2026-01-28T21:06:43Z"
  },
  {
    "title": "Meta expects annual capital expenditures to rise on superintelligence push",
    "description": "Jan 28 : Meta on Wednesday forecast its annual capital expenditure to increase sharply, as the social media giant builds artificial intelligence infrastructure in the pursuit of superintelligence.Shares of the Facebook and Instagram parent rose nearly 4 per c…",
    "link": "https://www.channelnewsasia.com/business/meta-expects-annual-capital-expenditures-rise-superintelligence-push-5892196",
    "timestamp": "2026-01-28T21:06:43Z"
  },
  {
    "title": "Can Trump really “de-escalate” Minneapolis tensions following ICE shootings?",
    "description": "And the president blames Democrat Ihan Omar after she was attacked",
    "link": "https://www.bbc.co.uk/sounds/play/p0mxqlqr",
    "timestamp": "2026-01-28T21:03:00Z"
  },
  {
    "title": "Jerome Powell says Fed independence isn’t lost… yet. ‘I certainly hope we won’t’ lose it",
    "description": "Powell made clear he believes the Fed can remain independent despite attacks from the Trump administration.",
    "link": "https://fortune.com/2026/01/28/jerome-powell-says-federal-reserve-independence-donald-trump/",
    "timestamp": "2026-01-28T21:02:09Z"
  },
  {
    "title": "Disarming Millions of Americans Simply Because They Use Marijuana Is Unconstitutional, a SCOTUS Brief Says",
    "description": "The Liberty Justice Center is urging the Supreme Court to uphold a 5th Circuit decision rejecting the claim that cannabis consumers have no Second Amendment rights.",
    "link": "https://reason.com/2026/01/28/disarming-millions-of-americans-simply-because-they-use-marijuana-is-unconstitutional-a-scotus-brief-says/",
    "timestamp": "2026-01-28T21:01:11Z"
  },
  {
    "title": "At Last: Lindsey Graham to Introduce Bill to Abolish Sanctuary Cities",
    "description": "“I also made it clear that Minneapolis does not and will not enforce federal immigration laws, and that we will remain focused on keeping our neighbors and streets safe.”\nThe post At Last: Lindsey Graham to Introduce Bill to Abolish Sanctuary Cities first app…",
    "link": "https://legalinsurrection.com/2026/01/at-last-lindsey-graham-to-introduce-bill-to-abolish-sanctuary-cities/",
    "timestamp": "2026-01-28T21:00:54Z"
  },
  {
    "title": "Horowitz: Iran’s Defenses Are Broken, Its Retaliatory Power Isn’t",
    "description": "Iran is bracing for a potential attack as the United States deploys key military assets, including an air carrier and additional bombers, to the Middle East. US President Donald Trump has threatened to strike the Islamic Republic over its bloody crackdown on …",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Horowitz-Irans-Defenses-Are-Broken-Its-Retaliatory-Power-Isnt.html",
    "timestamp": "2026-01-28T21:00:00Z"
  },
  {
    "title": "Oil Options on Longest Bullish Run Since 2024",
    "description": "Oil traders are paying a premium for bullish call options for the longest stretch in about 14 months.",
    "link": "https://www.rigzone.com/news/wire/oil_options_on_longest_bullish_run_since_2024-28-jan-2026-182876-article/",
    "timestamp": "2026-01-28T21:00:00Z"
  },
  {
    "title": "Trump V J.D. Vance? White House Shuts Down Rumors Prez and Veep Are Locked in Nasty Feud as the Don's Administration Crumbles",
    "description": "The White House blasted 'fake news' regarding rumblings of Donald Trump and J.D. Vance feuding behind the scenes.",
    "link": "https://radaronline.com/p/donald-trump-jd-vance-feud-rumors-white-house/",
    "timestamp": "2026-01-28T21:00:00Z"
  },
  {
    "title": "John Fetterman Nukes Kristi Noem With Damning Biden Comparison on Fox News",
    "description": "John Fetterman renewed his call for Kristi Noem to be fired, warning Trump that he could be making the same \"mistake\" as Biden.\nThe post John Fetterman Nukes Kristi Noem With Damning Biden Comparison on Fox News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/john-fetterman-nukes-kristi-noem-with-damning-biden-comparison-on-fox-news/",
    "timestamp": "2026-01-28T20:59:19Z"
  },
  {
    "title": "Exclusive-US handing over seized tanker to Venezuela, officials say",
    "description": "WASHINGTON, Jan 28 (Reuters) - The United States is handing over a tanker to Venezuela that it seized earlier this month, two U.S. officials told Reuters on Wednesday, th… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/28/exclusive-us-handing-over-seized-tanker-to-venezuela-officials-say",
    "timestamp": "2026-01-28T20:58:38Z"
  },
  {
    "title": "'Are you drunk?' Trump lackey stuns with explosion at challenge from right-wing lawyer",
    "description": "President Donald Trump's top civil rights attorney got into a petty back-and-forth on X with a prominent conservative lawyer who stepped in to defend the propriety of a judge who had given money to the immigrants' legal relief.U.S. District Judge Patrick J. S…",
    "link": "https://www.rawstory.com/harmeet-dhillon-2675054796/",
    "timestamp": "2026-01-28T20:58:07Z"
  },
  {
    "title": "New US TikTok Spinoff Will Be Controlled by Trump-Aligned Billionaires",
    "description": "Trump-aligned billionaires are now set to control nearly all major US social media platforms.",
    "link": "https://truthout.org/articles/new-us-tiktok-spinoff-will-be-controlled-by-trump-aligned-billionaires/",
    "timestamp": "2026-01-28T20:55:56Z"
  },
  {
    "title": "Bessent warns Carney against picking a fight before US-Canada-Mexico trade talks",
    "description": "Treasury Secretary Scott Bessent has a warning for Canadian Prime Minister Mark Carney: Your comments against U.S. trade policy could backfire, especially at a time when the U.S.-Mexico-Canada Agreement is facing a formal review",
    "link": "https://abcnews.go.com/Business/wireStory/bessent-warns-carney-picking-fight-us-canada-mexico-129648026",
    "timestamp": "2026-01-28T20:54:01Z"
  },
  {
    "title": "FBI searches Atlanta election office, chasing Trump 2020 vote fraud claims - Reuters",
    "description": "FBI searches Atlanta election office, chasing Trump 2020 vote fraud claimsReuters FBI raids Fulton County election officeajc.com FBI Agents Carry Out Search At Georgia Election FacilityBarron's FBI searching Fulton County elections office as it investigates a…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180680346",
    "timestamp": "2026-01-28T20:53:36Z"
  },
  {
    "title": "Hamas claims it is ready to cede Gaza governance",
    "description": "Hamas has said that it is ready to hand over control of Gaza to a Palestinian committee, as per US President Donald Trump’s peace plan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631679-hamas-claims-ready-cede-gaza/",
    "timestamp": "2026-01-28T20:53:00Z"
  },
  {
    "title": "Former Minnesota governor says state should seek to become part of Canada",
    "description": "Former Minnesota Governor Jesse Ventura says the people of his state should consider leaving the United States. In an interview on the SpinSisters podcast that premiered Saturday, Ventura pitched his plan by saying that it’s clear President Donald Trump doesn…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364428/posts",
    "timestamp": "2026-01-28T20:52:32Z"
  },
  {
    "title": "Bruce Springsteen song 'Streets of Minneapolis' blasts Trump, ICE",
    "description": "After Bruce Springsteen called out Trump's \"thugs\" in Minneapolis, the White House hit back against the \"random\" song and \"irrelevant opinions.\"",
    "link": "https://www.usatoday.com/story/entertainment/music/2026/01/28/bruce-springsteen-streets-of-minneapolis-song-alex-pretti-renee-good/88400305007/",
    "timestamp": "2026-01-28T20:51:53Z"
  },
  {
    "title": "Bruce Springsteen slams ICE, Trump in new song dedicated to the people of Minneapolis",
    "description": "Bruce Springsteen released a fiery protest song Wednesday dedicated to the memory of Renee Good and Alex Pretti, two Minneapolis residents who were fatally shot by federal agents this month.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/bruce-springsteen-slams-ice-trump-new-song-minneapolis-rcna256358",
    "timestamp": "2026-01-28T20:51:38Z"
  },
  {
    "title": "ICE presence threatens small business in Minneapolis and Minnesota, some owners say: 'I can hardly do my normal job'",
    "description": "Some Minneapolis small-business owners say they fear for their personal safety, their community's safety and their businesses' survival amid ICE's presence in the city.",
    "link": "https://www.cnbc.com/2026/01/28/ice-presence-threatens-small-business-in-minneapolis-minnesota-some-owners-say.html",
    "timestamp": "2026-01-28T20:50:00Z"
  },
  {
    "title": "'Melania' film only sold 13% of tickets in Trump's hometown",
    "description": "At the Palm Beach Regal Royal, just 234 of all available seats were purchased of 1770 total for the opening weekend.",
    "link": "https://www.newsweek.com/melania-film-only-sold-13-of-tickets-in-trumps-hometown-11432558",
    "timestamp": "2026-01-28T20:49:15Z"
  },
  {
    "title": "ICE to Invade Ohio Right After Trump Strips Immigrants of Legal Status",
    "description": "Local officials in Springfield, Ohio — the subject of Vice President JD Vance’s racist smears about Haitian immigrants — are bracing for a 30-day ICE surge. In a message obtained by the Springfield News-Sun, Springfield City School District Superintendent Bob…",
    "link": "https://newrepublic.com/post/205838/ice-springfield-ohio-haitians-temporary-protected-status-tps",
    "timestamp": "2026-01-28T20:49:08Z"
  },
  {
    "title": "'Telling voters they're idiots?' Trump baffles with bizarre 'insult everyone' strategy",
    "description": "An analyst warned Wednesday that President Donald Trump's approach to addressing affordability and understanding Americans' economic concerns would backfire on Republicans in the midterms. Tara Setmayer, co-founder and chief executive officer of the Seneca Pr…",
    "link": "https://www.rawstory.com/donald-trump-economy-midterms/",
    "timestamp": "2026-01-28T20:48:40Z"
  },
  {
    "title": "Minnesota: Agents in Pretti shooting placed on leave — media",
    "description": "Two agents involved in the shooting of Alex Pretti have reportedly been placed on leave. Meanwhile, a suspect who targeted Democratic congresswoman Ilhan Omar has a criminal history and made pro-Trump posts, police say. At least two federal immigration agents…",
    "link": "https://www.dw.com/en/minnesota-agents-in-pretti-shooting-placed-on-leave-media/live-75703608",
    "timestamp": "2026-01-28T20:48:00Z"
  },
  {
    "title": "Piers Morgan Suffers Brutal Accident, Wife Beats Him While He’s Down",
    "description": "Piers Morgan’s wife, Celia Walden, aired her annoyances with her husband's recent injury in a Tuesday article for The Telegraph.",
    "link": "https://dailycaller.com/2026/01/28/piers-morgan-celia-walden-hip-femur-break-invalid-hospital-humiliating-op-ed-the-telegraph/",
    "timestamp": "2026-01-28T20:47:38Z"
  },
  {
    "title": "Josh Shapiro knocks Biden record, says Democrats failed to deliver results Americans could ‘see or feel’",
    "description": "Pennsylvania Gov. Josh Shapiro criticizes Biden administration for failing to deliver results, positioning himself as potential 2028 contender.",
    "link": "https://www.foxnews.com/politics/shapiro-slams-biden-harris-broadband-rollout-zero-pennsylvanians-connected",
    "timestamp": "2026-01-28T20:47:14Z"
  },
  {
    "title": "A Seat on Trump’s “Board of Peace” Costs $1 Billion. Guess Who Gets the Money.",
    "description": "The leaders of China, India, and Russia are among those who haven’t yet responded.",
    "link": "https://slate.com/news-and-politics/2026/01/trump-peace-board-gaza-one-billion-dollars.html",
    "timestamp": "2026-01-28T20:46:48Z"
  }
]