[
  {
    "title": "How will Trump’s tariffs on steel and aluminum impact Canada?",
    "description": "United States President Donald Trump signed orders imposing 25 per cent tariffs on all steel and aluminum imports “without exceptions or exemptions” on Monday evening.\n“If we make it in the United States we don’t need it to be made in Canada,” Trump said in t…",
    "link": "https://biztoc.com/x/e9fe7e25530aa548",
    "timestamp": "2025-02-11T18:24:45Z"
  },
  {
    "title": "Trump administration owes US business millions in unpaid bills amid USAID shutdown, lawsuit says",
    "description": "A new lawsuit accuses the Trump administration of stiffing U.S. businesses of hundreds of millions of dollars in unpaid bills for work that has already been done amid its dismantling of the U.S. Agency for International Development.",
    "link": "https://www.clickondetroit.com/news/politics/2025/02/11/trump-administration-owes-us-business-millions-in-unpaid-bills-amid-usaid-shutdown-lawsuit-says/",
    "timestamp": "2025-02-11T18:24:16Z"
  },
  {
    "title": "The list of Trump’s legally dubious firings keeps getting longer",
    "description": "When taking stock of Donald Trump's overt hostility toward the rule of law, don't forget his list of legally dubious firings.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/list-trumps-legally-dubious-firings-keeps-getting-longer-rcna191711",
    "timestamp": "2025-02-11T18:22:40Z"
  },
  {
    "title": "Russia could start a major war in Europe within 5 years, Danish intelligence warns",
    "description": "An updated threat assessment warns of the consequences of a divided NATO and an absent U.S.",
    "link": "https://www.politico.eu/article/russia-war-threat-europe-within-5-years-danish-intelligence-ddis-warns/",
    "timestamp": "2025-02-11T18:22:30Z"
  },
  {
    "title": "'Ridiculous and lame': South Africans mock Trump proposals",
    "description": "JOHANNESBURG: On the streets of Johannesburg's student district, US President Donald Trump's offer to accept white Afrikaners as refugees landed as both \"ridiculous\" and \"lame\", among South Africans of all races. On Friday (Feb 11), Trump cut off aid to South…",
    "link": "https://www.channelnewsasia.com/world/ridiculous-and-lame-south-africans-mock-trump-proposals-4931641",
    "timestamp": "2025-02-11T18:22:19Z"
  },
  {
    "title": "How will Trump’s tariffs on steel and aluminum impact Canada?",
    "description": "Ontario and Quebec could be disproportionately affected by tariffs, as the former is home to six of Canada's 13 steel plants. Read more.",
    "link": "https://financialpost.com/news/economy/trump-tariffs-steel-aluminum-impact-canada",
    "timestamp": "2025-02-11T18:22:12Z"
  },
  {
    "title": "Nancy Mace drops bombshell in House speech: Accuses ex-fiancé and associates of rape, abuse, and cover-up",
    "description": "Nancy Mace accuses ex-fiancé and associates of rape and abuse in a shocking House speech, revealing graphic evidence of crimes against women and underage girls. She named four men, including her former fiancé Patrick Bryant, alleging he secretly filmed her an…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nancy-mace-drops-bombshell-in-house-speech-accuses-ex-fianc-and-associates-of-rape-abuse-and-cover-up/articleshow/118152743.cms",
    "timestamp": "2025-02-11T18:21:53Z"
  },
  {
    "title": "\"Stick To Catholic Church\": Pope Told After Trump Migrant Critique",
    "description": "Pope Francis described Donald Trump&#039;s migrant deportations as a &quot;major crisis&quot; Tuesday, prompting a rebuke from the US president&#039;s border czar, who told the pontiff to &quot;stick to the Catholic Church&quot;.",
    "link": "https://www.ndtv.com/world-news/pope-francis-told-to-stick-to-church-after-donald-trump-deportation-immigrant-critique-7688954",
    "timestamp": "2025-02-11T18:20:59Z"
  },
  {
    "title": "Trump FBI pick Kash Patel accused of directing staff purge while still a nominee",
    "description": "Sen. Dick Durbin alleged that Kash Patel's orders are being carried out by officials including Trump aide Stephen Miller and acting deputy AG Emil Bove.",
    "link": "https://www.cnbc.com/2025/02/11/trump-fbi-kash-patel-perjury-durbin.html",
    "timestamp": "2025-02-11T18:20:54Z"
  },
  {
    "title": "'A lot of people will die': How Trump’s USAID overhaul could lead to famine in Sudan",
    "description": "President Donald Trump’s 90-day freeze on all foreign aid could not have come at a worse time for Sudan, which is facing famine amid it's 2-year civil war.",
    "link": "https://www.nbcnews.com/news/world/trump-usaid-cuts-sudan-famine-civil-war-rcna191389",
    "timestamp": "2025-02-11T18:20:41Z"
  },
  {
    "title": "Trump Goes On Bizarre Rant About Ozempic When Bret Baier Presses Him On Prices For Consumers",
    "description": "Trump went on a rant about Ozempic when Fox News anchor Bret Baier pressed him about the potential effects of his policies on consumer prices.\nThe post Trump Goes On Bizarre Rant About Ozempic When Bret Baier Presses Him On Prices For Consumers first appeared…",
    "link": "https://www.mediaite.com/news/trump-goes-on-bizarre-rant-about-ozempic-when-bret-baier-presses-him-on-prices-for-consumers/",
    "timestamp": "2025-02-11T18:20:17Z"
  },
  {
    "title": "1st lawsuits targeting foreign aid freeze bemoan 'chaos' in Trump order",
    "description": "Several nonprofit groups are accusing the Trump administration of failing to disperse congressionally approved funds by freezing all foreign aid for 90 days.",
    "link": "https://abcnews.go.com/Politics/1st-lawsuits-targeting-foreign-aid-freeze-bemoan-chaos/story?id=118698102",
    "timestamp": "2025-02-11T18:19:39Z"
  },
  {
    "title": "Senate Moves Forward With Tulsi Gabbard's Nomination For Intelligence Chief",
    "description": "With the backing of 52 Senate Republicans, Gabbard is expected to be confirmed as the nation&#039;s top intelligence official soon. Forty-six Democrats opposed her nomination, and two senators were absent during the vote.",
    "link": "https://www.ndtv.com/world-news/us-senate-moves-forward-with-tulsi-gabbards-nomination-for-intelligence-chief-7688923",
    "timestamp": "2025-02-11T18:19:18Z"
  },
  {
    "title": "Mayor Chow pushes to remove Tesla from Zero Emissions Grant program",
    "description": "Toronto Mayor Olivia Chow took aim at Elon Musk’s Tesla, possibly in response to Canada-U.S. tariffs, with plans to remove the electric vehicles (EVs) from the city’s Zero Emissions Grant program. In a budget meeting on Tuesday, Chow said that she’ll move a m…",
    "link": "https://mobilesyrup.com/2025/02/11/mayor-chow-removing-tesla-zero-emissions-grant-program/",
    "timestamp": "2025-02-11T18:18:36Z"
  },
  {
    "title": "'Businesses are worried': Trump ally Peter Navarro confronted on CNN over chaotic policies",
    "description": "CNN's Pamela Brown on Tuesday confronted Trump White House adviser and convicted criminal Peter Navarro over the economic impacts of President Donald Trump's tariffs.During a contentious interview, Brown quoted from studies showing that the tariffs waged duri…",
    "link": "https://www.rawstory.com/peter-navarro-2671134707/",
    "timestamp": "2025-02-11T18:18:33Z"
  },
  {
    "title": "Whistleblowers Allege Kash Patel Is Already Carrying Out ‘Purge’ of FBI Employees — Even Though He Hasn’t Been Confirmed Yet",
    "description": "Sen. Durbin says he is in possession of information from \"multiple\" whistleblowers showing Kash Patel is carrying out a \"purge\" of FBI employees.\nThe post Whistleblowers Allege Kash Patel Is Already Carrying Out ‘Purge’ of FBI Employees — Even Though He Hasn’…",
    "link": "https://www.mediaite.com/news/whistleblowers-allege-kash-patel-is-already-carrying-out-purge-of-fbi-employees-even-though-he-hasnt-been-confirmed-yet/",
    "timestamp": "2025-02-11T18:18:00Z"
  },
  {
    "title": "Trump-Modi Reality Show Could Be Rough On India’s Economy",
    "description": "Narendra Modi’s visit to the White House this week feels suspiciously like a victory lap for an Indian leader whose economy hasn’t had a great deal to celebrate of late.",
    "link": "https://www.forbes.com/sites/williampesek/2025/02/11/trump-modi-reality-show-could-be-rough-on-indias-economy/",
    "timestamp": "2025-02-11T18:17:41Z"
  },
  {
    "title": "Robinhood's Q4 Report Could Help Preview Coinbase Results",
    "description": "Analysts are expecting overall crypto revenue at Robinhood to have soared to $345.5 million from $63.9 million in the previous quarter.",
    "link": "https://www.coindesk.com/markets/2025/02/11/robinhood-s-q4-report-could-help-preview-coinbase-results",
    "timestamp": "2025-02-11T18:17:31Z"
  },
  {
    "title": "For Trump, Google Replaces Pride Month With 'Arnold Palmer's Gigantic Hog' Month",
    "description": "Heavens no, it wasn't politics, it was just, um ... 'not sustainable.' Yeah.",
    "link": "https://www.wonkette.com/p/for-trump-google-replaces-pride-month",
    "timestamp": "2025-02-11T18:15:56Z"
  },
  {
    "title": "Leaked Memo Details How Intrusive Anti-Trans Passport Policy Will Be Implemented",
    "description": "“These rules make it more difficult for transgender people to obtain a passport,” said researcher Allison Chapman.",
    "link": "https://truthout.org/articles/leaked-memo-details-how-intrusive-anti-trans-passport-policy-will-be-implemented/",
    "timestamp": "2025-02-11T18:15:53Z"
  },
  {
    "title": "Record television audience for Super Bowl LIX",
    "description": "The Super Bowl took place on Sunday, and it was watched by a record number of television viewers. According to...\nThe post Record television audience for Super Bowl LIX appeared first on The Sports Daily.",
    "link": "https://thesportsdaily.com/news/record-television-audience-for-super-bowl-lix/",
    "timestamp": "2025-02-11T18:15:36Z"
  },
  {
    "title": "How Tariffs Make CFOs’ Jobs More Complex",
    "description": "Also in the Forbes CFO newsletter: Planned aluminum and steel tariffs rile allies, Vought uses OMB to halt CFPB, tech companies invest in AI infrastructure.",
    "link": "https://www.forbes.com/sites/cfo/2025/02/11/how-tariffs-make-cfos-jobs-more-complex/",
    "timestamp": "2025-02-11T18:15:30Z"
  },
  {
    "title": "Trump Spending Freeze on Rural Electric Co-ops Could Raise Energy Costs",
    "description": "Billions of dollars for rural electric cooperatives are stuck in limbo as the Department of Agriculture continues the Trump administration’s funding freeze, despite federal court orders",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/02/11/trump-spending-freeze-hits-rural-electric-co-ops-00203458",
    "timestamp": "2025-02-11T18:15:00Z"
  },
  {
    "title": "Trump administration owes US business millions in unpaid bills amid USAID shutdown, lawsuit says",
    "description": "A new lawsuit accuses the Trump administration of stiffing U.S. businesses of hundreds of millions of dollars in unpaid bills for work that has already been done amid its dismantling of the U.S. Agency for International Development",
    "link": "https://abcnews.go.com/Business/wireStory/trump-administration-owes-us-business-millions-unpaid-bills-118699540",
    "timestamp": "2025-02-11T18:14:39Z"
  },
  {
    "title": "Judge tells agencies to restore webpages and data removed after Trump's executive order",
    "description": "A federal judge has told government agencies to restore public access to health-related webpages and datasets they removed to comply with an executive order by President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/judge-tells-agencies-restore-webpages-data-removed-after-118698681",
    "timestamp": "2025-02-11T18:14:37Z"
  },
  {
    "title": "Disney Scales Back DEI Program After Trump Executive Order",
    "description": "The entertainment giant is shuttering its \"Reimagine Tomorrow\" program and changing the trigger warning shown before old content like \"Dumbo\" \nThe post Disney Scales Back DEI Program After Trump Executive Order appeared first on TheWrap.",
    "link": "https://www.thewrap.com/disney-changes-dei-program-executive-order/",
    "timestamp": "2025-02-11T18:14:08Z"
  },
  {
    "title": "FEMA spent tens of millions of dollars in Democrat areas, disobeying orders, but left the people of North Carolina high and dry.",
    "description": "It is now under review and investigation. THE BIDEN RUN FEMA HAS BEEN A DISASTER. FEMA SHOULD BE TERMINATED! IT HAS BEEN SLOW AND TOTALLY INEFFECTIVE. INDIVIDUAL STATES SHOULD HANDLE STORMS, ETC., AS THEY COME. BIG SAVINGS, FAR MORE EFFICIENT!!!",
    "link": "https://freerepublic.com/focus/f-news/4296756/posts",
    "timestamp": "2025-02-11T18:14:08Z"
  },
  {
    "title": "Disney Ditches DEI Program After Trump Executive Order",
    "description": "The entertainment giant is shuttering its \"Reimagine Tomorrow\" program and changing the trigger warning shown before old content like \"Dumbo\" \nThe post Disney Ditches DEI Program After Trump Executive Order appeared first on TheWrap.",
    "link": "https://www.thewrap.com/disney-ditches-dei-program-executive-order/",
    "timestamp": "2025-02-11T18:14:08Z"
  },
  {
    "title": "Jordan's King Abdullah Tells Trump He Will Take In 2,000 Gaza Children",
    "description": "Jordan's King Abdullah told President Donald Trump on Tuesday morning that his country will immediately admit 2,000 Palestinian children from the Gaza Strip with cancer and other medical issues.\nTrump has recently escalated pressure on the Arab nation to take…",
    "link": "https://biztoc.com/x/f7725f94b29fc90d",
    "timestamp": "2025-02-11T18:14:05Z"
  },
  {
    "title": "Only One Big Economy Is Aiming for Paris Agreement's 1.5C Goal",
    "description": "Seven of the 10 world's largest economies missed a deadline on Monday to submit updated emissions-cutting plans to the United Nations -- and only one, the UK, outlined a strategy for the next decade that keeps pace with expectations staked out under the Paris…",
    "link": "https://news.slashdot.org/story/25/02/11/1815209/only-one-big-economy-is-aiming-for-paris-agreements-15c-goal",
    "timestamp": "2025-02-11T18:14:00Z"
  },
  {
    "title": "Farmers on TikTok Speak Out About Trump's USDA Funding Freeze",
    "description": "President Donald Trump froze several key U.S. Department of Agriculture (USDA) funding programs upon taking office, and a couple farmers have taken to TikTok to express their anger about being left with financial uncertainty.\nTrump's USDA Funding Freeze\nThe d…",
    "link": "https://biztoc.com/x/ae8523a5814b2241",
    "timestamp": "2025-02-11T18:13:51Z"
  },
  {
    "title": "The Trump classified documents case is officially done against all defendants",
    "description": "This image contained in a court filing by the Department of Justice on Aug. 30, 2022, and partially redacted by the source, shows a photo of documents seized during the Aug. 8, 2022, FBI search of former President Donald Trump's Mar-a-Lago estate.",
    "link": "https://biztoc.com/x/f4fa4d0ca0b0bbc6",
    "timestamp": "2025-02-11T18:13:50Z"
  },
  {
    "title": "Donald Trump Issues New Water Standards for US: What to Know",
    "description": "President Trump announced he is rolling back changes the Biden administration made on water regulations.",
    "link": "https://biztoc.com/x/c4691afcd2222e51",
    "timestamp": "2025-02-11T18:13:22Z"
  },
  {
    "title": "Trump's Tariffs Can't Offset Tax Cuts, Economists Say",
    "description": "\"Tariffs would be one of the worst ways to try to offset the cost of tax cuts,\" says Tax Foundation's Erica York about potential tariff impact on the pending House budget reconciliation bill.\nPresident Donald Trump ordered a 25% tariff on steel and aluminum i…",
    "link": "https://biztoc.com/x/0779e8fb6531517d",
    "timestamp": "2025-02-11T18:13:20Z"
  },
  {
    "title": "Hanna Perekhoda: ‘The fight for freedom in Ukraine is intimately linked to the global struggle against fascist forces’",
    "description": "In this interview, Ukrainian historian and activist Hanna Perekhoda looks back at some of the preconceptions and simplifications that, in Western Europe, shape discussion of the war in Ukraine.",
    "link": "https://voxeurop.eu/en/hanna-perekhoda-ukraine-war/",
    "timestamp": "2025-02-11T18:13:18Z"
  },
  {
    "title": "Saudi Arabia-Israel: Are Trump's Mideast ideas derailing normalization plans?",
    "description": "US plans have rendered diplomatic ties between Israel and Saudi Arabia unlikely for the time being. Yet Riyadh and Washington have their own roadmaps. Meanwhile, Palestinians continue to bear the brunt.",
    "link": "https://www.dw.com/en/saudi-arabia-israel-are-trumps-mideast-ideas-derailing-normalization-plans/a-71574068",
    "timestamp": "2025-02-11T18:13:00Z"
  },
  {
    "title": "Home builders warn of ‘brutal blow’ to housing sector from steel, aluminum tariffs",
    "description": "Some developers say looming US tariffs on Canadian steel and aluminum could be detrimental to the housing sector. Find out more.",
    "link": "https://financialpost.com/real-estate/home-builders-housing-sector-steel-aluminum-tariffs",
    "timestamp": "2025-02-11T18:12:06Z"
  },
  {
    "title": "Iran alerts UN to Trump threat of force, says it will defend itself",
    "description": "Iran's UN Ambassador Amir Saeid Iravani condemned Trump’s 'reckless and inflammatory statements', urging the UN Security Council to take action.",
    "link": "https://www.jpost.com/breaking-news/article-841720",
    "timestamp": "2025-02-11T18:11:33Z"
  },
  {
    "title": "Cardi B Blames President Donald Trump’s Secret Service For Damaging Her $3,000 Christian Louboutins at Super Bowl LIX",
    "description": "Cardi B blames Donald Trump's Secret Service detail for damaging her Christian Louboutin heels at Super Bowl LIX in New Orleans on Feb. 9.",
    "link": "http://footwearnews.com/fashion/celebrity-style/cardi-donald-trump-louboutin-shoes-super-secret-service-1234767964/",
    "timestamp": "2025-02-11T18:10:44Z"
  },
  {
    "title": "Farmers on TikTok Speak Out About Trump's USDA Funding Freeze",
    "description": "Missouri famers are sharing how USDA funding freezes are impacting their business. There has also been online talk that the freeze is tied to Project 2025.",
    "link": "https://www.newsweek.com/trump-usda-funding-freeze-farmers-tiktok-project-2025-2029137",
    "timestamp": "2025-02-11T18:10:20Z"
  },
  {
    "title": "Can You Get Student Loan Forgiveness For Department Of Education Disruptions?",
    "description": "The U.S. Department of Education is experiencing major turmoil as the Trump administration takes steps to undermine and eliminate it.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/02/11/can-you-get-student-loan-forgiveness-for-department-of-education-disruptions/",
    "timestamp": "2025-02-11T18:10:04Z"
  },
  {
    "title": "FEMA official ignores judge's latest order, demands freeze on grant funding (Jonathan Allen/NBC News)",
    "description": "Jonathan Allen / NBC News:\nFEMA official ignores judge's latest order, demands freeze on grant funding  —  Federal workers are being swept into the fight between Donald Trump and federal courts, with four FEMA aides fired Tuesday for being “deep state activis…",
    "link": "https://www.memeorandum.com/250211/p77",
    "timestamp": "2025-02-11T18:10:01Z"
  },
  {
    "title": "Nolte: Leftist Operative Declares It ‘Suicide’ for Democrats to Defend USAID",
    "description": "Democrat operative Ruy Teixeira is warning that it is “suicide” for Democrats to defend USAID.\nThe post Nolte: Leftist Operative Declares It ‘Suicide’ for Democrats to Defend USAID appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/11/nolte-leftist-operative-declares-it-suicide-democrats-defend-usaid/",
    "timestamp": "2025-02-11T18:09:43Z"
  },
  {
    "title": "Why Are We Fighting?",
    "description": "When regulations limit what kind of housing can be built, the result is endless arguments about what people really want.",
    "link": "https://reason.com/2025/02/11/why-are-we-fighting/",
    "timestamp": "2025-02-11T18:09:27Z"
  },
  {
    "title": "Trump Department of Education Axes Biden Admin's 'Misguided' Technical School Move",
    "description": "CTE schools argued the new rule would be massively disruptive, disincentivize innovation, and “reduce data quality.”",
    "link": "https://www.westernjournal.com/trumps-education-department-takes-scythe-misguided-biden-era-technical-school-regs/",
    "timestamp": "2025-02-11T18:08:56Z"
  },
  {
    "title": "Jordan's King Abdullah Tells Trump He Will Take In 2,000 Gaza Children",
    "description": "President Trump has recently escalated pressure on the Arab nation to take in refugees from Gaza.",
    "link": "https://www.newsweek.com/jordans-king-abdullah-tells-trump-he-will-take-2000-gaza-children-2029550",
    "timestamp": "2025-02-11T18:08:29Z"
  },
  {
    "title": "I am sending Secretary of the Treasury Scott Bessent to Ukraine to meet President Zelensky.",
    "description": "This War MUST and WILL END SOON — Too much Death and Destruction. The U.S. has spent BILLIONS of Dollars Globally, with little to show. WHEN AMERICA IS STRONG, THE WORLD IS AT PEACE.",
    "link": "https://freerepublic.com/focus/f-news/4296755/posts",
    "timestamp": "2025-02-11T18:07:54Z"
  },
  {
    "title": "'I'm 100% Certain,' Says Top Dem, That Musk 'Looking for an Excuse to Cut Social Security, Medicare, and Medicaid'",
    "description": "Amid fears that U.S. President Donald Trump's government-gutting billionaire adviser, Elon Musk, will target Social Security, elected officials, advocates, workers, and beneficiaries of the federal program for seniors and people with disabilities held a Monda…",
    "link": "https://www.commondreams.org/news/elon-musk-and-social-security",
    "timestamp": "2025-02-11T18:07:50Z"
  },
  {
    "title": "Trump says Treasury Secretary Bessent is going to Ukraine as U.S. has 'little to show' for aid sent",
    "description": "Trump's post suggested the two leaders could discuss pathways to ending the conflict.",
    "link": "https://www.cnbc.com/2025/02/11/trump-says-treasury-secretary-bessent-is-going-to-ukraine-as-us-has-little-to-show-for-aid-sent.html",
    "timestamp": "2025-02-11T18:07:45Z"
  },
  {
    "title": "Fact Check: FEMA disaster funds not diverted to migrants by Biden administration",
    "description": "The Federal Emergency Management Agency (FEMA) only runs a program to house migrants that is funded by U.S. Customs and Border Protection (CBP), contrary to posts online saying that FEMA disaster relief funds were diverted by the Biden Administration to house…",
    "link": "https://freerepublic.com/focus/f-chat/4296754/posts",
    "timestamp": "2025-02-11T18:07:27Z"
  },
  {
    "title": "Google drops Pride Month, Black History Month from Calendar — Here’s how DEI rollbacks are spreading",
    "description": "Google Calendar has stopped marking Pride Month, Black History Month and Women’s History Month as part of a broader corporate shift away from DEI policies under Donald Trump’s second term.",
    "link": "https://economictimes.indiatimes.com/news/international/us/google-drops-pride-month-black-history-month-from-calendar-heres-how-dei-rollbacks-are-spreading/articleshow/118154211.cms",
    "timestamp": "2025-02-11T18:07:11Z"
  },
  {
    "title": "NSA Ajit Doval likely to visit US along with PM Modi",
    "description": "National security adviser Ajit Doval is set to join the prime minister for the upcoming visit to Washington. Doval's absence in September raised concerns, but the return of Donald Trump to the White House signals a more favorable stance towards India. Doval's…",
    "link": "https://economictimes.indiatimes.com/news/india/nsa-ajit-doval-likely-to-visit-us-along-with-pm-modi/articleshow/118154224.cms",
    "timestamp": "2025-02-11T18:06:45Z"
  },
  {
    "title": "Even as polarization surges, Americans believe they live in a compassionate country",
    "description": "Compassion starts with the individual – self-care and personal wellness. It then radiates out to the wider community in the form of action and engagement.",
    "link": "https://theconversation.com/even-as-polarization-surges-americans-believe-they-live-in-a-compassionate-country-247677",
    "timestamp": "2025-02-11T18:06:21Z"
  },
  {
    "title": "Trump wants states to handle disasters without FEMA. They say they can’t",
    "description": "Cost-cutting efforts could cripple FEMA, even if it’s not officially “abolished.”",
    "link": "https://www.bostonherald.com/2025/02/11/fema-states-disaster-response/",
    "timestamp": "2025-02-11T18:06:00Z"
  },
  {
    "title": "Netanyahu will 'terminate' ceasefire if all hostages aren't back by Saturday",
    "description": "Israel’s Prime Minister Benjamin Netanyahu says the ceasefire in Gaza will end if the Palestinian militant group Hamas does not release all hostages on Saturday.",
    "link": "https://www.abc.net.au/news/2025-02-12/netanyahu-says-ceasefire-will-end-if-hostages-are-not-returned/104925800",
    "timestamp": "2025-02-11T18:05:44Z"
  },
  {
    "title": "Congressman Introduces 'Embarrassing' Bill to Rename Greenland 'Red White & Blueland' as Trump Aims to Purchase Island",
    "description": "A new bill by Rep. Buddy Carter aims to rename Greenland \"Red, White & Blueland\" as Trump revives his push to acquire the island, sparks backlash.",
    "link": "https://www.ibtimes.com/congressman-introduces-embarrassing-bill-rename-greenland-red-white-blueland-trump-aims-3763279",
    "timestamp": "2025-02-11T18:05:39Z"
  },
  {
    "title": "DOGE slashes over $100M in DEI funding at Education Department: 'Win for every student'",
    "description": "The Department of Government Efficiency is slashing $100 million in spending by the Department of Education to diversity, equity, and inclusion trainings.",
    "link": "https://www.foxnews.com/politics/doge-slashes-over-100m-dei-funding-education-department-win-every-student",
    "timestamp": "2025-02-11T18:05:15Z"
  },
  {
    "title": "27 religious groups sue White House over ‘sensitive location’ immigration policy",
    "description": "People walk past a church displaying a “Immigrants & Refugees Welcome” sign in New York on Jan. 24, 2025. / Credit: ANGELA WEISS/AFP via Getty Images\n\nCNA Staff, Feb 11, 2025 / 13:05 pm (CNA).\nA coalition of more than two dozen religious groups is suing the W…",
    "link": "https://www.catholicnewsagency.com/news/262149/27-religious-groups-sue-white-house-over-sensitive-location-immigration-policy",
    "timestamp": "2025-02-11T18:05:00Z"
  },
  {
    "title": "Trump Extends Election Denial To His 2024 Victory In Bonkers Interview",
    "description": "The president couldn't even accept a win without casting doubt in a bizarre exchange with Bret Baier.",
    "link": "https://www.huffpost.com/entry/donald-trump-bret-baier-super-bowl-75-million-votes_n_67ab7681e4b0b904f1e2805f",
    "timestamp": "2025-02-11T18:04:20Z"
  },
  {
    "title": "Trump says US may have less debt than thought because of fraud",
    "description": "U.S. President Donald Trump on Sunday said his administration was examining U.S. Treasury debt payments for possible fraud and suggested that the country's $36 trillion debt load might not be that high. Speaking to reporters aboard Air Force One, Trump said a…",
    "link": "https://freerepublic.com/focus/f-news/4296753/posts",
    "timestamp": "2025-02-11T18:03:43Z"
  },
  {
    "title": "Trump Pushes Confusing and Disastrous Plan for FEMA",
    "description": "Donald Trump is once again threatening to destroy the Federal Emergency Management Agency. \r\nThe president took aim at the agency, which provides essential disaster aid, in a post on Truth Social Tuesday. \r\n“FEMA spent tens of millions of dollars in Democrat …",
    "link": "https://newrepublic.com/post/191408/donald-trump-confusing-disastrous-plan-fema",
    "timestamp": "2025-02-11T18:02:44Z"
  },
  {
    "title": "Donald Trump Issues New Water Standards for US: What to Know",
    "description": "President Trump announced he is rolling back changes the Biden administration made on water regulations.",
    "link": "https://www.newsweek.com/donald-trump-issues-new-water-standards-us-what-know-2029495",
    "timestamp": "2025-02-11T18:02:41Z"
  },
  {
    "title": "Trump administration owes US business millions in unpaid bills amid USAID shutdown, lawsuit says",
    "description": "A new lawsuit accuses the Trump administration of stiffing U.S. businesses of hundreds of millions of dollars in unpaid bills for work that has already been done amid its dismantling of the U.S. Agency for International Development. The lawsuit was filed Tues…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-administration-owes-us-business-millions-in-20160965.php",
    "timestamp": "2025-02-11T18:02:36Z"
  },
  {
    "title": "Judge Orders Health Agencies to Restore Web Pages That Trump Team Removed",
    "description": "A federal judge on Tuesday ordered the Trump administration to restore a slew of health-related datasets and web pages that President Donald Trump ordered taken down.\nWhy It Matters\nThe ruling came in response to a lawsuit filed by Public Citizen Litigation G…",
    "link": "https://biztoc.com/x/74bed2cfbd1fceb2",
    "timestamp": "2025-02-11T18:02:36Z"
  },
  {
    "title": "Trump's Dangerous Vision for Gaza Is a Blueprint for Catastrophe | Opinion",
    "description": "President Donald Trump has been floating a dangerous proposal for my homeland: On a number of recent occasions, he has suggested moving the civilian population out of Gaza, implying the forced relocation or displacement of hundreds of thousands of innocent pe…",
    "link": "https://biztoc.com/x/c2011dcb3190bfb1",
    "timestamp": "2025-02-11T18:02:32Z"
  },
  {
    "title": "Trump Envoy Halts Work on Ukraine Peace Plan to Consult With Europe",
    "description": "President Donald Trump's special envoy to Russia and Ukraine will speak with NATO allies at a security conference in Germany.",
    "link": "https://biztoc.com/x/5114fa96f0ffefa2",
    "timestamp": "2025-02-11T18:02:32Z"
  },
  {
    "title": "Trump: Hamas unlikely to return hostages on Saturday",
    "description": "United States President Donald Trump expressed his doubts that Hamas will make the deadline given to return the hostages it was supposed to hand over on Saturday.Speaking during his meeting with King ...",
    "link": "https://biztoc.com/x/879f92c4a3d65144",
    "timestamp": "2025-02-11T18:02:19Z"
  },
  {
    "title": "‘Bleep This!’ James Carville Says Insiders Tell Him Trump White House ‘Nuttier Than You Even Think!’",
    "description": "James Carville told Jim Acosta that he's hearing from \"reliable people\" who have been inside Trump's White House that it's \"nuttier than even you think!\"\nThe post ‘Bleep This!’ James Carville Says Insiders Tell Him Trump White House ‘Nuttier Than You Even Thi…",
    "link": "https://www.mediaite.com/news/bleep-this-james-carville-says-insiders-tell-him-trump-white-house-nuttier-than-you-even-think/",
    "timestamp": "2025-02-11T18:01:33Z"
  },
  {
    "title": "Ken Griffin says Trump's 'bombastic' trade rhetoric is a mistake that's eroding trust in the U.S.",
    "description": "The billionaire hedge fund founder's comments came after Trump on Monday evening signed an order that would impose 25% tariffs on steel and aluminum imports.",
    "link": "https://www.cnbc.com/2025/02/11/ken-griffin-says-trumps-bombastic-trade-rhetoric-is-a-mistake-thats-eroding-trust-in-the-us.html",
    "timestamp": "2025-02-11T18:01:00Z"
  },
  {
    "title": "Schumer Ripped to Shreds Over Portal to Report Government ‘Corruption’",
    "description": "\"I'd like to report Maxine Waters for inciting violence against political opposition.\"\nThe post Schumer Ripped to Shreds Over Portal to Report Government ‘Corruption’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/schumer-ripped-to-shreds-over-portal-to-report-government-corruption/",
    "timestamp": "2025-02-11T18:00:53Z"
  },
  {
    "title": "Trump's Dangerous Vision for Gaza Is a Blueprint for Catastrophe | Opinion",
    "description": "Although Israel's actions played a significant role in the ongoing crisis, it is imperative to hold Hamas responsible for obstructing any route to peace.",
    "link": "https://www.newsweek.com/trumps-dangerous-vision-gaza-blueprint-catastrophe-opinion-2029544",
    "timestamp": "2025-02-11T18:00:39Z"
  },
  {
    "title": "Hamas's treatment of hostages akin to Holocaust, over half of Israelis say",
    "description": "The poll, carried out by Menachem Lazar and Panel4All, also found that the absolute majority (73%) of all Israelis support fully completing the ceasefire deal with Hamas to return all hostages.",
    "link": "https://www.jpost.com/israel-news/article-841679",
    "timestamp": "2025-02-11T18:00:28Z"
  },
  {
    "title": "Majority of Israelis support Trump's Gaza plan, exclusive 'Post' poll finds",
    "description": "Trump's Gaza plan has large support from Netanyahu, coalition voters • 10% say plan is morally reprehensible, 35% want Jewish state 'from river to sea'",
    "link": "https://www.jpost.com/israel-news/article-841693",
    "timestamp": "2025-02-11T18:00:18Z"
  },
  {
    "title": "Anna Paulina Luna to lead task force on declassification of JFK assassination records, Epstein client list",
    "description": "EXCLUSIVE: Rep. Anna Paulina Luna will lead a task force on declassifying federal secrets – including records related to the assassinations JFK, RFK and Dr. King, Fox News Digital has learned.",
    "link": "https://www.foxnews.com/politics/rep-anna-paulina-luna-lead-congressional-task-force-declassification-jfk-assassination-records-more",
    "timestamp": "2025-02-11T18:00:11Z"
  },
  {
    "title": "There's a new cage fight in town: trade negotiations with our closest allies",
    "description": "Really, it's a wonder the NSW government bothered to spend $16 million bringing UFC to Sydney, when we have a free cage sport: Trade negotiations with our closest allies.",
    "link": "https://www.abc.net.au/news/2025-02-12/trump-albanese-steel-tariffs-trade-negotiations/104924386",
    "timestamp": "2025-02-11T18:00:00Z"
  },
  {
    "title": "The Vibe comes for Academic Publishing",
    "description": "The Academy of Public Health\n\nThe Academy of Public Health is an international association of public health scholars, researchers and practicing professionals in the field of public health and its many specialties. Members are united in their commitment to op…",
    "link": "https://wattsupwiththat.com/2025/02/11/the-vibe-comes-for-academic-publishing/",
    "timestamp": "2025-02-11T18:00:00Z"
  },
  {
    "title": "NYC Mayor Eric Adams thanks Justice Department after prosecutors directed to drop case against him | CNN",
    "description": "New York City Mayor Eric Adams thanked the Justice Department on Tuesday for directing prosecutors to drop the federal case against him, saying he never broke the law or traded power for personal benefit.",
    "link": "https://www.cnn.com/2025/02/11/us/mayor-adams/index.html",
    "timestamp": "2025-02-11T17:59:39Z"
  },
  {
    "title": "Elon Musk's DOGE Gets Polling Boost",
    "description": "The shift in opinion on Musk comes amid concerns about how much power the unelected billionaire has in how the country is run.",
    "link": "https://www.newsweek.com/elon-musk-doge-polling-2029471",
    "timestamp": "2025-02-11T17:59:10Z"
  },
  {
    "title": "Ranking possible opponents for Eagles' 2025 NFL season opener, plus Super Bowl LIX makes television history",
    "description": "Here's everything you need to know about the NFL for Feb. 11",
    "link": "https://www.cbssports.com/nfl/news/ranking-possible-opponents-for-eagles-2025-nfl-season-opener-plus-super-bowl-lix-makes-television-history/",
    "timestamp": "2025-02-11T17:59:06Z"
  },
  {
    "title": "Trump on verge of next Cabinet victory with late-night Tulsi Gabbard Senate vote",
    "description": "Trump is expected to see his 14th Cabinet official confirmed after midnight when Tulsi Gabbard gets a final vote to be director of national intelligence.",
    "link": "https://www.foxnews.com/politics/trump-verge-next-cabinet-victory-late-night-tulsi-gabbard-senate-vote",
    "timestamp": "2025-02-11T17:58:32Z"
  },
  {
    "title": "Why Elon Musk's $97 billion bid for OpenAI could disrupt Sam Altman's plans",
    "description": "The latest chapter in a tech bromance gone sour could up-end Altman's bid for new funding - whether or not OpenAI Inc.'s board accepts Musk's offer.",
    "link": "https://www.zdnet.com/article/why-elon-musks-97-billion-bid-for-openai-could-disrupt-sam-altmans-plans/",
    "timestamp": "2025-02-11T17:57:45Z"
  },
  {
    "title": "US Treasury Secretary to visit Ukraine for talks on rare earth minerals",
    "description": "WASHINGTON (Reuters) - U.S. Treasury Secretary Scott Bessent will travel to Ukraine this week, Donald Trump wrote in a social media post on Tuesday, the latest in a flurry of U.S. officials heading to Europe in the coming days. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/12/us-treasury-secretary-to-visit-ukraine-for-talks-on-rare-earth-minerals",
    "timestamp": "2025-02-11T17:56:00Z"
  },
  {
    "title": "Judge tells agencies to restore public health websites removed under Trump order",
    "description": "A federal judge has told government agencies to restore public access to health-related webpages and datasets they removed to comply with an executive order by President Donald Trump.",
    "link": "https://www.livenowfox.com/news/trump-public-health-websites-ruling",
    "timestamp": "2025-02-11T17:55:28Z"
  },
  {
    "title": "Republican Sucks Up to Trump With Pathetic Attempt to Rename Greenland",
    "description": "Donald Trump has made odd jokes and eyebrow-raising militaristic threats about buying Greenland, but on Tuesday, at least one Republican lawmaker took the idea a step further, pitching an entirely new identity for the Danish territory.\r\nA new bill filed in th…",
    "link": "https://newrepublic.com/post/191406/republican-buddy-carter-donald-trump-greenland",
    "timestamp": "2025-02-11T17:55:13Z"
  },
  {
    "title": "Judge Orders Health Agencies to Restore Web Pages That Trump Team Removed",
    "description": "U.S. District Judge John Bates dealt the latest legal blow to the Trump administration.",
    "link": "https://www.newsweek.com/judge-orders-cdc-fda-hhs-restore-health-data-websites-2029542",
    "timestamp": "2025-02-11T17:55:11Z"
  },
  {
    "title": "Selkirk braces for impact of 'unjustified' U.S. tariffs on steel, city's biggest industry",
    "description": "The U.S. tariffs on steel and aluminum will land hard on the city of Selkirk, where well over 500 people are employed in the industry, Mayor Larry Johannson says.",
    "link": "https://www.cbc.ca/news/canada/manitoba/steel-tariffs-selkirk-manitoba-1.7455884",
    "timestamp": "2025-02-11T17:53:48Z"
  },
  {
    "title": "Steve Bannon pleads guilty to defrauding donors over border wall construction - NewsBreak",
    "description": "Long-time Trump ally Steve Bannon pleaded guilty Tuesday to funneling money donated for the construction of a border wall elsewhere.",
    "link": "https://www.newsbreak.com/share/3802709227733-steve-bannon-pleads-guilty-to-defrauding-donors-over-border-wall-construction?s=a2&amp;share_destination_id=Mjc0MDYyNDIwLTE3MzkyOTYzNzI4MjQ%3D&amp;pd=0IXw9cGU&amp;hl=en_US&amp;send_time=1739296372&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v3",
    "timestamp": "2025-02-11T17:53:24Z"
  },
  {
    "title": "Judge orders Trump admin to restore removed health agency webpages - NewsBreak",
    "description": "The decision by U.S. District Judge John Bates, a George W. Bush appointee, came after a testy Monday afternoon hearing.",
    "link": "https://www.newsbreak.com/share/3802929371394-judge-orders-trump-admin-to-restore-removed-health-agency-webpages?_f=app_share&pd=0IYAiEQ1&lang=en_US&send_time=1739317321&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v7&s=i2",
    "timestamp": "2025-02-11T17:52:29Z"
  },
  {
    "title": "Trump: Deadline for hostage release hasn't changed",
    "description": "US President Donald Trump responds to questions about annexing Judea and Samaria, deadline for hostage release.",
    "link": "https://www.israelnationalnews.com/news/403770",
    "timestamp": "2025-02-11T17:52:20Z"
  },
  {
    "title": "Trump Envoy Halts Work on Ukraine Peace Plan to Consult With Europe",
    "description": "President Donald Trump's special envoy to Russia and Ukraine will speak with NATO allies at a security conference in Germany.",
    "link": "https://www.newsweek.com/trump-envoy-halts-work-ukraine-peace-plan-consult-europe-2029458",
    "timestamp": "2025-02-11T17:52:15Z"
  },
  {
    "title": "USAID contractors join others suing Trump administration over dismantling of agency",
    "description": "Organizations and companies that contract with USAID, including the American Bar Association and international development firm Chemonics, on Tuesday sued President Donald Trump's administration over what they called its unlawful moves to dismantle the U.S. f…",
    "link": "https://biztoc.com/x/116b43086e2e158f",
    "timestamp": "2025-02-11T17:51:30Z"
  },
  {
    "title": "Trump tariffs rattle small business owners already dealing with tight margins",
    "description": "By MAE ANDERSON\nNEW YORK (AP) — President Donald Trump’s continued roll out of a wide array of tariffs is rattling small business owners already dealing with tight profit margins.\nRelated Articles\nBusiness | \n \n \n Powell says Fed ‘well positioned’ for the ‘ri…",
    "link": "https://biztoc.com/x/904b3d2665b004ba",
    "timestamp": "2025-02-11T17:51:24Z"
  },
  {
    "title": "Trump's order to scrap the penny doesn't make 'cents': Expert",
    "description": "Trump's order to scrap the penny doesn't make 'cents': Expert\nThe cost of making a penny has risen to more than twice the coin's face value.\nAs part of his plan to cut alleged federal government waste, President Donald Trump is literally pinching pennies, ord…",
    "link": "https://biztoc.com/x/87fe1cf40f1dea13",
    "timestamp": "2025-02-11T17:51:21Z"
  },
  {
    "title": "Ford CEO says steel and aluminum tariffs would devastate U.S. auto industry and benefit international rivals",
    "description": "The chief executive officer of Ford Motor Co. F-N warns U.S. tariffs on Canadian and Mexican imports would devastate the U.S. automaking industry and give a price advantage to overseas rivals.\nU.S. President Donald Trump has briefly paused his plan to place 2…",
    "link": "https://biztoc.com/x/50d7faddf00f619d",
    "timestamp": "2025-02-11T17:51:08Z"
  },
  {
    "title": "Trump tells Jordanian King that US will 'take Gaza,' Palestinians will live safely elsewhere",
    "description": "He also said that he did not think Hamas would make the Saturday deadline for hostage release, and if they fail to do so, “all bets are off.”",
    "link": "https://www.jpost.com/middle-east/article-841715",
    "timestamp": "2025-02-11T17:51:04Z"
  },
  {
    "title": "Judge says White House defying order to spend funds",
    "description": "What happened\nA federal judge in Rhode Island said Monday that the White House was not complying with his order to release billions in congressionally approved federal grants that President Donald Trump froze in a controversial executive order.\nThe rebuke mar…",
    "link": "https://biztoc.com/x/507f3beef4565147",
    "timestamp": "2025-02-11T17:51:03Z"
  },
  {
    "title": "Trump Envoy Accuses VOA Reporter of ‘Treasonous’ Behavior for Reporting a Quote Critical of the President",
    "description": "In 1994, Congress went passed a law to create an explicit “firewall” between the VOA and the partisan politics of Washington, D.C..\nThe post Trump Envoy Accuses VOA Reporter of ‘Treasonous’ Behavior for Reporting a Quote Critical of the President first appear…",
    "link": "https://www.mediaite.com/news/trump-envoy-accuses-voa-reporter-of-treasonous-behavior-for-reporting-a-quote-critical-of-the-president/",
    "timestamp": "2025-02-11T17:51:00Z"
  }
]