[
  {
    "title": "‘Not losing a single day’: Trump and Zelensky to meet Sunday at Mar-a-Lago",
    "description": "'A lot can be decided before the New Year'",
    "link": "https://www.wnd.com/2025/12/not-losing-single-day-trump-zelensky-meet-sunday/",
    "timestamp": "2025-12-26T17:19:25Z"
  },
  {
    "title": "Donald Trump and the White Man’s Burden in Nigeria",
    "description": "US President Donald Trump has made good on his threat to take military action against Nigeria to save Christians from a “genocide.” Trump has three possible motives: his mercantilist quest for rare-earth minerals, his pandering to evangelical Christians, and …",
    "link": "https://www.project-syndicate.org/commentary/trump-threats-to-invade-nigeria-reflect-colonizers-civilizing-mission-by-adekeye-adebajo-2025-12-1-2025-12",
    "timestamp": "2025-12-26T17:17:32Z"
  },
  {
    "title": "PHOTO -- 'Where's Waldo?': Joe Biden Hides Behind Family in Christmas Photo",
    "description": "Former President Joe Biden (D) appeared to hide behind his relatives in a family photo he posted on Christmas Eve.\nThe post PHOTO — ‘Where’s Waldo?’: Joe Biden Hides Behind Family in Christmas Photo appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/26/photo-wheres-waldo-joe-biden-hides-behind-family-christmas-picture/",
    "timestamp": "2025-12-26T17:17:11Z"
  },
  {
    "title": "Israel FM accuses Palestinian Authority of aiding terror with ‘Pay-for-Slay’ after deadly attack",
    "description": "Two Israelis were killed in terrorist attacks in Israel on Friday, as officials accused the Palestinian Authority of misleading the world about its active terror payment policy.",
    "link": "https://www.foxnews.com/world/israel-fm-accuses-palestinian-authority-aiding-terror-pay-for-slay-after-deadly-attack",
    "timestamp": "2025-12-26T17:16:24Z"
  },
  {
    "title": "‘Bloodthirsty ISIS savages’: Republicans praise Trump’s strike on terrorists in Nigeria",
    "description": "'Decisive strikes will save lives & protected religious freedom'",
    "link": "https://www.wnd.com/2025/12/bloodthirsty-isis-savages-republicans-praise-trumps-strike-terrorists/",
    "timestamp": "2025-12-26T17:11:58Z"
  },
  {
    "title": "Trump Spent Christmas Posting Over a Hundred Times on Truth Social",
    "description": "As the clock struck midnight on Christmas morning at one Mar-a-Lago estate in Palm Beach, Florida, at least one someone was stirring.  Starting in the early hours of December 25 and ending in the evening, President Donald Trump posted over a hundred times on …",
    "link": "https://www.motherjones.com/politics/2025/12/trump-spent-christmas-posting-over-a-hundred-times-on-truth-social/",
    "timestamp": "2025-12-26T17:09:13Z"
  },
  {
    "title": "Epstein Survivor Calls Out Trump as He Spirals Over Epstein",
    "description": "A survivor of Jeffrey Epstein’s abuse torched President Donald Trump’s outrageous message on the alleged sex trafficker.Trump, who reportedly had an intimate friendship with Epstein, posted a special Christmas message Thursday addressed to “the many Sleazebag…",
    "link": "https://newrepublic.com/post/204758/epstein-survivor-trump-every-accusation-confession",
    "timestamp": "2025-12-26T17:08:54Z"
  },
  {
    "title": "The 5 at 5: St Stephen's Day",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-st-stephens-day-6912972-Dec2025/",
    "timestamp": "2025-12-26T17:08:24Z"
  },
  {
    "title": "Jimmy Kimmel Can’t Help Himself, Does Worst Thing You Could Do To America And Trump Supporters",
    "description": "On Christmas Day, Jimmy Kimmel took his irrelevant message to the masses of Britain because no one in America really cares what he has to say.",
    "link": "https://dailycaller.com/2025/12/26/jimmy-kimmel-donald-trump-christmas-day-message-britain-channel-4/",
    "timestamp": "2025-12-26T17:07:40Z"
  },
  {
    "title": "Beaming Trump Really Wants You to See His ‘America 250’ Plane One Day After Scorched Earth Christmas Screed",
    "description": "President Donald Trump took to his social media account to reveal the design for an America 250 plane ahead of the nation's 250th anniversary next year.\nThe post Beaming Trump Really Wants You to See His ‘America 250’ Plane One Day After Scorched Earth Christ…",
    "link": "https://www.mediaite.com/media/news/beaming-trump-really-wants-you-to-see-his-america-250-plane-one-day-after-scorched-earth-christmas-screed/",
    "timestamp": "2025-12-26T17:06:41Z"
  },
  {
    "title": "Zelenskiy Says Will Meet With Trump, Russia Reaches Out To US",
    "description": "Ukrainian President Volodymyr Zelenskiy said he plans to meet his US counterpart Donald Trump “in the coming days,” signaling optimism about reaching a peace deal to end Russia’s almost four-year war. Separately, the Kremlin said its representatives had made …",
    "link": "https://www.ndtvprofit.com/world/zelenskiy-says-will-meet-with-trump-russia-reaches-out-to-us",
    "timestamp": "2025-12-26T17:05:32Z"
  },
  {
    "title": "Health minister says Canada can't rely on U.S. health institutions anymore",
    "description": "Canada needs reliable partners who are looking to science on subjects like vaccines, says Minister Marjorie Michel.",
    "link": "https://www.thestar.com/news/canada/health-minister-says-canada-cant-rely-on-u-s-health-institutions-anymore/article_10f20bde-23ab-53a6-8519-a0a862aea633.html",
    "timestamp": "2025-12-26T17:04:03Z"
  },
  {
    "title": "Jimmy Kimmel Takes Aim at Trump for Channel 4’s Alternative Christmas Message: “We Won, the President Lost”",
    "description": "The talk show host reflected on his tumultuous year, surveyed the current political landscape, and shared some charged words aimed at Donald Trump.\nJimmy Kimmel Takes Aim at Trump for Channel 4’s Alternative Christmas Message: “We Won, the President Lost”\nJon…",
    "link": "https://consequence.net/2025/12/jimmy-kimmel-channel-4-alternative-christmas-message-2025/",
    "timestamp": "2025-12-26T17:03:09Z"
  },
  {
    "title": "Dow Jones Today: Why is Dow down today as the US stock market paused after record highs?",
    "description": "Dow Jones Today: U.S. stock market experienced a slight retreat on Friday, December 26, as the initial euphoria of the \"Santa Claus rally\" met with typical year-end profit-taking. The Dow Jones Industrial Average fell 96.62 points to 48,634.54, down 0.20%. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dow-jones-today-why-is-dow-down-today-as-the-us-stock-market-paused-after-record-highs/articleshow/126193108.cms",
    "timestamp": "2025-12-26T17:01:41Z"
  },
  {
    "title": "Trump Takes Over DOJ Twitter Account",
    "description": "Axios reported that the Trump administration has confiscated the Department of Justices Twitter account, which typifies the complete subservience of the entire structure of law enforcement in this country and turned it over to Demented Donald. \nIs it any wond…",
    "link": "https://crooksandliars.com/2025/12/trump-takes-over-doj-twitter-account",
    "timestamp": "2025-12-26T17:01:22Z"
  },
  {
    "title": "Nineteen States Suing Trump Admin Over Transgender ‘Healthcare’ for Minors",
    "description": "\"The coalition of Democrat-leaning states filed a federal lawsuit this week in Eugene, Oregon\"\nThe post Nineteen States Suing Trump Admin Over Transgender ‘Healthcare’ for Minors first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/nineteen-states-suing-trump-admin-over-transgender-healthcare-for-minors/",
    "timestamp": "2025-12-26T17:00:48Z"
  },
  {
    "title": "Watch: Melania’s 7-word remark to Trump sparks tense moment at Mar-a-Lago Christmas Eve dinner",
    "description": "Donald Trump's Christmas Eve dinner at Mar-a-Lago saw him appear withdrawn as his wife, Melania, and her father conversed. A lip reader claimed Melania cautioned Trump, \"you can't make a fool of yourself.\" Online reactions focused on Trump's demeanor, with so…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/watch-melanias-7-word-remark-to-trump-sparks-tense-moment-at-mar-a-lago-christmas-eve-dinner/articleshow/126193119.cms",
    "timestamp": "2025-12-26T17:00:33Z"
  },
  {
    "title": "Why This Pundit Believes That XRP Holders Will Become Millionaires And Billionaires",
    "description": "A pundit has stirred conversation in the crypto community by suggesting that XRP holders could see unprecedented wealth, potentially reaching millionaire or billionaire status. He cites the evolving crypto regulatory landscape in the United States (US) and XR…",
    "link": "https://bitcoinist.com/xrp-millionaires-and-billionaires/",
    "timestamp": "2025-12-26T17:00:08Z"
  },
  {
    "title": "Trump orders Christmas Day airstrikes against Islamic State in Nigeria with “more to come”",
    "description": "The exact militant group targeted and the effectiveness of the strikes are unknown",
    "link": "https://www.salon.com/2025/12/26/trump-orders-christmas-day-airstrikes-against-islamic-state-in-nigeria-with-more-to-come/",
    "timestamp": "2025-12-26T16:59:18Z"
  },
  {
    "title": "CNN’s Dana Bash Admits Border Is ‘Story Of Accomplishment’ For Donald Trump",
    "description": "CNN host Dana Bash admitted President Donald Trump turned around the situation on the U.S.-Mexico border in his first year since returning to the White House.",
    "link": "https://dailycaller.com/2025/12/26/cnns-dana-bash-border-accomplishment-donald-trump/",
    "timestamp": "2025-12-26T16:57:50Z"
  },
  {
    "title": "Trump's shocking 'avalanche of outrages' detailed in blistering editorial",
    "description": "While he may have managed to score reelection last year with a popular vote lead, Donald Trump's \"avalanche of outrages\" over the course of 2025 have reaffirmed that he is \"unfit for office,\" according to an extensive and scathing breakdown from the editorial…",
    "link": "https://www.rawstory.com/alternet-posts/trump-outrage/",
    "timestamp": "2025-12-26T16:57:02Z"
  },
  {
    "title": "Two late Trump court defeats 'could make a big difference in 2026': analyst",
    "description": "Two significant legal setbacks for Donald Trump's administration are likely to have substantial implications as the president enters 2026.According to former White House correspondent Brian Karem, the Trump administration's winning streak with the conservativ…",
    "link": "https://www.rawstory.com/trump-cpourt-loss/",
    "timestamp": "2025-12-26T16:56:56Z"
  },
  {
    "title": "First Teaser For ‘Madden’ Biopic With Nic Cage And Christian Bale Debuts To Tepid Reaction Due To Cage’s Make-Up",
    "description": "Amazon Prime Video released the first teaser trailer for the upcoming Nicolas Cage-starring Madden biopic during the Thursday Night Football game between the Denver Broncos and Kansas City Chiefs on Christmas Day. Directed by controversial Three Kings and Sil…",
    "link": "https://brobible.com/sports/article/madden-teaser-trailer-reaction/",
    "timestamp": "2025-12-26T16:55:16Z"
  },
  {
    "title": "US military airstrikes didn’t violate Nigeria’s sovereignty – Tuggar",
    "description": "Nigeria’s Foreign Minister confirms the recent US airstrikes in Nigeria were a collaborative effort, authorized by the government to combat terrorism.\n\nRead More: https://punchng.com/us-military-airstrikes-didnt-violate-nigerias-sovereignty-tuggar/",
    "link": "https://punchng.com/us-military-airstrikes-didnt-violate-nigerias-sovereignty-tuggar/",
    "timestamp": "2025-12-26T16:53:44Z"
  },
  {
    "title": "Even Trump-Aligned Economists Warn President Is About to Upend U.S. Health Care - NewsBreak",
    "description": "President Donald Trump has spent months promising a straightforward solution for one of America’s biggest frustrations: prescription drug prices. Last week",
    "link": "https://www.newsbreak.com/share/4413413595231-even-trump-aligned-economists-warn-president-is-about-to-upend-u-s-health-care?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NjY3Njc2MjM5NTU%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1766767624&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-26T16:47:39Z"
  },
  {
    "title": "Trump Posts Every Two Minutes in Crazed Early Morning Spree",
    "description": "President Donald Trump began the day after Christmas with a self-soothing posting spree bragging about everything from firing federal workers to Bill...",
    "link": "https://www.thedailybeast.com/trump-posts-every-two-minutes-in-crazed-early-morning-spree/",
    "timestamp": "2025-12-26T16:41:54Z"
  },
  {
    "title": "Nigerian villagers are rattled by US airstrikes that made their homes shake and the sky glow red",
    "description": "A U.S. airstrike that targeted an alleged Islamic State camp in Nigeria has caused panic in the village of Jabo",
    "link": "https://abcnews.go.com/International/wireStory/nigerian-villagers-rattled-us-airstrikes-made-homes-shake-128705163",
    "timestamp": "2025-12-26T16:37:34Z"
  },
  {
    "title": "Minnesota Senate candidate wears hijab in visit to Somali market as fraud scandal unfolds",
    "description": "Minnesota Lt. Gov. Peggy Flanagan appears in video wearing hijab amid massive Somali fraud scandal that has rocked the state government and officials.",
    "link": "https://www.foxnews.com/politics/minnesota-senate-candidate-wears-hijab-visit-somali-market-fraud-scandal-unfolds",
    "timestamp": "2025-12-26T16:34:05Z"
  },
  {
    "title": "Joe Rogan Seemingly Changes Tune On Trump With Telling Remarks About The President's 'Nutty' Decisions",
    "description": "Joe Rogan has criticized President Donald Trump's recent behavior amid growing concerns about the politician's health.",
    "link": "https://www.yahoo.com/news/articles/joe-rogan-seemingly-changes-tune-163024455.html",
    "timestamp": "2025-12-26T16:30:24Z"
  },
  {
    "title": "ICE's interest in high-tech gear raises new questions: 'What is it for?' (Alfred Ng/Politico)",
    "description": "Alfred Ng / Politico:\nICE's interest in high-tech gear raises new questions: ‘What is it for?’ … The U.S. Immigration and Customs Enforcement is buying millions of dollars' worth of new surveillance tools at the same time President Donald Trump has scaled bac…",
    "link": "https://www.memeorandum.com/251226/p22",
    "timestamp": "2025-12-26T16:30:00Z"
  },
  {
    "title": "The Politics of Plunder — Trump's domestic and foreign policies have one consistent theme. (Will Saletan/The Bulwark)",
    "description": "Will Saletan / The Bulwark:\nThe Politics of Plunder  —  Trump's domestic and foreign policies have one consistent theme.  —  Will Saletan, Cathy Young, Andrew Egger, and 2 others  —  MAGA Christmas was a choose-your-own-adventure affair this year.  Did you wa…",
    "link": "https://www.memeorandum.com/251226/p20",
    "timestamp": "2025-12-26T16:30:00Z"
  },
  {
    "title": "Minnesota Dem Throws on a Hijab to Pander to Somali Migrants Amid Massive Somali Fraud Scandal",
    "description": "Flanagan, who wore a hijab, a head covering worn by some Muslim women, held a microphone during the video posted by Somali TV of Minnesota.",
    "link": "https://www.westernjournal.com/minnesota-dem-throws-hijab-pander-somali-migrants-amid-massive-somali-fraud-scandal/",
    "timestamp": "2025-12-26T16:29:39Z"
  },
  {
    "title": "Jezebel’s Most Nauseating Barf Bags of 2025",
    "description": "Barf Bag: All barfs are bad, but here were the year's worst.",
    "link": "https://www.jezebel.com/jezebels-most-nauseating-barf-bags-of-2025",
    "timestamp": "2025-12-26T16:25:20Z"
  },
  {
    "title": "South Park Writer Saw Trump’s Kennedy Center Name-Change Coming, So He Bought Multiple Web Domains to Troll Him",
    "description": "A writer for the irreverent Comedy Central show South Park correctly predicted that Donald Trump would slap his name on the Kennedy Center.\nThe post South Park Writer Saw Trump’s Kennedy Center Name-Change Coming, So He Bought Multiple Web Domains to Troll Hi…",
    "link": "https://www.mediaite.com/media/entertainment/south-park-writer-saw-trumps-kennedy-center-name-change-coming-so-he-bought-multiple-web-domains-to-troll-him/",
    "timestamp": "2025-12-26T16:22:47Z"
  },
  {
    "title": "A Former South Park Writer Owns the Trump-Kennedy Center Websites",
    "description": "Predicting Tump would add his name to the iconic institution, Comedian and activist Toby Morton bought “trumpkennedycenter.org” and “trumpkennedycenter.com” back in August.\nA Former South Park Writer Owns the Trump-Kennedy Center Websites\nJonah Krueger",
    "link": "https://consequence.net/2025/12/south-park-writer-owns-tump-kennedy-center-websites/",
    "timestamp": "2025-12-26T16:22:16Z"
  },
  {
    "title": "U.S. Bombs Nigeria Amid Dispute Over Claims of Christian Persecution",
    "description": "State of the Union: Trump says the strikes respond to violence against Christians, while Nigerian officials point to widespread attacks on Muslim civilians and deny that religious killings are tolerated by the government.\nThe post U.S. Bombs Nigeria Amid Disp…",
    "link": "https://www.theamericanconservative.com/u-s-bombs-nigeria-amid-dispute-over-claims-of-christian-persecution/",
    "timestamp": "2025-12-26T16:20:00Z"
  },
  {
    "title": "Israel Seals Recognition Deal with Breakaway Somalia Region",
    "description": "Israel became the first country to recognize Somaliland, a breakaway region of Somalia, giving it a new partner on the strategic Red Sea coast.",
    "link": "https://financialpost.com/pmn/business-pmn/israel-seals-recognition-deal-with-breakaway-somalia-region",
    "timestamp": "2025-12-26T16:19:03Z"
  },
  {
    "title": "Jimmy Kimmel Spends His Christmas Bashing Trump’s America to Foreign Viewers",
    "description": "DAILY CALLER NEWS FOUNDATION—ABC late-night host Jimmy Kimmel told British viewers on Thursday that “tyranny is booming” under President Donald Trump’s leadership in the United... Read More\nThe post Jimmy Kimmel Spends His Christmas Bashing Trump’s America to…",
    "link": "https://www.dailysignal.com/2025/12/26/jimmy-kimmel-spends-his-christmas-bashing-trumps-america-to-foreign-viewers/",
    "timestamp": "2025-12-26T16:11:00Z"
  },
  {
    "title": "Wall Street holds on to year-end highs; precious metals keep their lustre",
    "description": "Dec 26 : Major U.S. stock indexes traded near record peaks on Friday in muted post-Christmas trading, while expectations of Federal Reserve interest rate cuts helped propel precious metals prices to all-time highs.Public holidays kept markets closed in Austra…",
    "link": "https://www.channelnewsasia.com/business/wall-street-holds-year-end-highs-precious-metals-keep-their-lustre-5709516",
    "timestamp": "2025-12-26T16:07:51Z"
  },
  {
    "title": "Wall Street closes near record highs; precious metals rise",
    "description": "Dec ‌26 : Major U.S. stock indexes closed near record peaks on Friday, little changed from the start of a muted post-Christmas trading session, while expectations of Federal Reserve interest rate cuts and safe haven appeal pushed precious metals prices to all…",
    "link": "https://www.channelnewsasia.com/business/wall-street-closes-near-record-highs-precious-metals-rise-5709516",
    "timestamp": "2025-12-26T16:07:51Z"
  },
  {
    "title": "Wall Street lingers around record highs; precious metals rise",
    "description": "Dec 26 : Major U.S. stock indexes oscillated around record peaks on Friday in muted post-Christmas trading, while expectations of Federal Reserve interest rate cuts and safe haven appeal pushed precious metals prices to all-time highs.Public holidays kept mar…",
    "link": "https://www.channelnewsasia.com/business/wall-street-lingers-around-record-highs-precious-metals-rise-5709516",
    "timestamp": "2025-12-26T16:07:51Z"
  },
  {
    "title": "‘How Humiliating’: Biden Roasted Over ‘Where’s Waldo’-Style Family Christmas Photo",
    "description": "Critics of former Joe Biden had a field day with his Christmas photo with some dumbfounded that the photo in which you can barely see Biden is actually real.\nThe post ‘How Humiliating’: Biden Roasted Over ‘Where’s Waldo’-Style Family Christmas Photo first app…",
    "link": "https://www.mediaite.com/media/how-humiliating-biden-roasted-over-wheres-waldo-style-family-christmas-photo/",
    "timestamp": "2025-12-26T16:03:39Z"
  },
  {
    "title": "Trump and Netanyahu not aligned on priorities ahead of Florida talks",
    "description": "Israeli prime minister likely to seek further Iran attacks but US president focused on next phase of Gaza ceasefire",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/26/trump-and-netanyahu-not-aligned-on-priorities-ahead-of-florida-talks/",
    "timestamp": "2025-12-26T16:02:17Z"
  },
  {
    "title": "2025 RECAP: IAFF continues delivering real wins for fire fighter health, safety, and retirement  - IAFF",
    "description": "2025 RECAP: IAFF continues delivering real wins for fire fighter health, safety, and retirement  - IAFFiaff.org",
    "link": "https://www.iaff.org/news/2025-recap-iaff-continues-delivering-real-wins-for-fire-fighter-health-safety-and-retirement/",
    "timestamp": "2025-12-26T16:01:37Z"
  },
  {
    "title": "SF Self-Defense Class Helps Transgender Community Build Bonds",
    "description": "It comes in the face of anti-trans policies from the Trump administration.",
    "link": "https://www.kqed.org/news/12068375/sf-self-defense-class-helps-transgender-community-build-bonds",
    "timestamp": "2025-12-26T16:00:06Z"
  },
  {
    "title": "Kennedy Center Honors Ratings Tank Like Never Before Thanks to Trump",
    "description": "The reviews of Donald Trump’s takeover of Kennedy Center Honors are in, and it’s official: The president shouldn’t quit his day job just yet. Trump had asked his fans Tuesday to let him know what they made of his stint as “Master of Ceremonies” for the yearly…",
    "link": "https://newrepublic.com/post/204752/kennedy-center-honors-ratings-tank-trump",
    "timestamp": "2025-12-26T15:59:42Z"
  },
  {
    "title": "'Creepy' Donald Trump Slammed for Making 'Inappropriate' Remarks About an 8-Year-Old Girl's Appearance During Holiday Phone Calls — as Epstein Drama Rages On",
    "description": "Donald Trump was slammed for remarks he made about an 8-year-old girl's appearance during holiday phone calls.",
    "link": "https://radaronline.com/p/donald-trump-holiday-phone-calls-slammed-young-girl-beautiful-remarks/",
    "timestamp": "2025-12-26T15:58:39Z"
  },
  {
    "title": "Minnesota’s Lt. Gov. Takes Pandering To Somalis To The Next Level",
    "description": "Democratic Minnesota Lt. Gov. Peggy Flanagan praised Somali migrants in the state during a visit to a market in a video posted on YouTube Thursday. President Donald Trump announced in November that he would end “Temporary Protected Status” for Somalis in the …",
    "link": "https://freerepublic.com/focus/f-news/4359067/posts",
    "timestamp": "2025-12-26T15:58:29Z"
  },
  {
    "title": "Zelenskyy says he will meet with President Trump in Florida on Sunday for talks on Ukraine security guarantees",
    "description": "Zelenskyy says he will meet with President Trump in Florida on Sunday for talks on Ukraine security guaranteesnews4jax.com",
    "link": "https://www.news4jax.com/news/florida/2025/12/26/zelenskyy-says-he-will-meet-with-president-trump-in-florida-on-sunday-for-talks-on-ukraine-security-guarantees/",
    "timestamp": "2025-12-26T15:56:06Z"
  },
  {
    "title": "Zelenskyy to meet with Trump to talk Ukraine security guarantees",
    "description": "Zelenskyy told journalists that the two leaders will discuss security guarantees for Ukraine during Sunday's talks and that the 20-point plan under discussion “is about 90% ready.”",
    "link": "https://www.ketv.com/article/zelenskyy-trump-florida-sunday-ukraine-security-guarantees/69868313",
    "timestamp": "2025-12-26T15:55:57Z"
  },
  {
    "title": "Yemen separatists accuse Saudi Arabia of launching airstrikes against their forces",
    "description": "Separatist forces in southern Yemen claim Saudi Arabia launched airstrikes against them. This follows the separatists' recent takeover of key governorates. The kingdom had previously warned the separatists to withdraw. These actions escalate tensions in Yemen…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/yemen-separatists-accuse-saudi-arabia-of-launching-airstrikes-against-their-forces/articleshow/126192573.cms",
    "timestamp": "2025-12-26T15:55:18Z"
  },
  {
    "title": "MUST READ: Bernard Goldberg Says a Generational Media Shift Is Underway",
    "description": "My old friend Bill O’Reilly wrote an interesting column recently about the demise of network news — a once noble institution inhabited over the years by my two favorite reporters: Bill … and me.\r\nO’Reilly writes that, “My young adult children never watch netw…",
    "link": "https://www.billoreilly.com/b/MUST-READ:-Bernard-Goldberg-Says-a-Generational-Media-Shift-Is-Underway/-758351185843407389.html",
    "timestamp": "2025-12-26T15:53:07Z"
  },
  {
    "title": "Brussels no longer Belgian – Musk",
    "description": "Elon Musk has pointed to a recent study that found that nearly three in four minors in the Belgian capital are from non-European backgrounds Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630061-musk-brussels-not-belgian/",
    "timestamp": "2025-12-26T15:50:54Z"
  },
  {
    "title": "Joe Rogan tears into Trump over ‘crazy’ Biden plaque installed in White House",
    "description": "“You shouldn’t be allowed to do this.”",
    "link": "https://www.silive.com/politics/2025/12/joe-rogan-tears-into-trump-over-crazy-biden-plaque-installed-in-white-house.html",
    "timestamp": "2025-12-26T15:49:11Z"
  },
  {
    "title": "Times Square to feature patriotic ball drop for New Year's Eve",
    "description": "The New Year's Eve ball drop in New York City will sparkle in red, white, and blue to kick off celebrations for the U.S.'s 250th birthday in 2026",
    "link": "https://abcnews.go.com/US/wireStory/times-square-feature-patriotic-ball-drop-new-years-128702770",
    "timestamp": "2025-12-26T15:48:04Z"
  },
  {
    "title": "Zelenskyy, Trump to meet in Florida on Sunday amid efforts to end Ukraine-Russia war",
    "description": "Ukrainian President Volodymyr Zelenskyy says he'll meet with U.S. President Donald Trump in Florida on Sunday to discuss security guarantees and \"an economic agreement,\" the latest development in a U.S.-led diplomatic push to end the nearly four-year Ukraine-…",
    "link": "https://www.cbc.ca/news/world/zelenskyy-trump-meeting-sunday-florida-9.7028266",
    "timestamp": "2025-12-26T15:47:53Z"
  },
  {
    "title": "Zelenskyy to hold high-stakes talks on land, security with Trump on Sunday",
    "description": "KYIV: Ukrainian President Volodymyr Zelenskyy will discuss territorial issues, the main stumbling block in talks to end the war, with US President Donald Trump in Florida on Sunday (Dec 28), as a 20-point peace framework and a security guarantees deal near co…",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-ukranie-trump-talks-land-security-5723936",
    "timestamp": "2025-12-26T15:47:51Z"
  },
  {
    "title": "Nigeria averts unilateral US action by cooperating on airstrikes (Ben Ezeamalu/Reuters)",
    "description": "Ben Ezeamalu / Reuters:\nNigeria averts unilateral US action by cooperating on airstrikes  —  By publicly cooperating with the United States on Christmas Day airstrikes, Nigeria's government may have averted humiliating unilateral military action threatened a …",
    "link": "https://www.memeorandum.com/251226/p16",
    "timestamp": "2025-12-26T15:45:00Z"
  },
  {
    "title": "Trump’s Lax Approach to Antitrust Helps Spur Banner Year for Corporate Mergers",
    "description": "Global corporate mergers surged to near-record highs in 2025, driven in part by US President Donald Trump's lax approach to antitrust enforcement.The Financial Times reported on Friday that global dealmaking in 2025 topped $4 trillion, including 68 mergers wo…",
    "link": "https://www.commondreams.org/news/trump-corporate-merger-boom",
    "timestamp": "2025-12-26T15:44:05Z"
  },
  {
    "title": "Nigerian villagers are rattled by US airstrikes that made their homes shake and the sky glow red",
    "description": "Villagers, who had never experienced a terror attack, were confused and scared.",
    "link": "https://www.bostonherald.com/2025/12/26/nigeria-military-strikes-reaction/",
    "timestamp": "2025-12-26T15:39:33Z"
  },
  {
    "title": "VIDEO: Liberal Suckers Who Desperately Wanted to Believe FAKE Epstein Letter",
    "description": "VIDEOThe release of the FAKE Epstein letter supposedly sent to imprisoned serial sex offender Larry Nassar was like tossing red meat into a small pond of starving liberal piranhas. They latched onto that FAKE letter and devoured it without the least bit of co…",
    "link": "https://freerepublic.com/focus/f-bloggers/4359064/posts",
    "timestamp": "2025-12-26T15:38:32Z"
  },
  {
    "title": "Bravo's Andy Cohen Has Three Words for the Obamas — and Many People Agree",
    "description": "Cohen didn't hesitate to let Barack and Michelle know how he feels.",
    "link": "https://parade.com/celebrities/andy-cohen-misses-obama",
    "timestamp": "2025-12-26T15:36:57Z"
  },
  {
    "title": "7 People We Want To Deport Home For The Holidays",
    "description": "There's no place like home for the holidays. Here are seven people who deserve one-way tickets back.",
    "link": "https://dailycaller.com/2025/12/26/ilhan-omar-shri-thanedar-wajahat-ali-deport-hates-america-somalia-fraud/",
    "timestamp": "2025-12-26T15:36:05Z"
  },
  {
    "title": "Trump Hires Beauty Salon Owner to Decide Who to Ban From U.S.",
    "description": "President Donald Trump has installed an attorney and part-time beauty salon owner to decide which foreigners are allowed to enter the U.S. The State...",
    "link": "https://www.thedailybeast.com/trump-hires-beauty-salon-owner-mora-namdar-to-decide-who-to-ban-from-us/",
    "timestamp": "2025-12-26T15:31:44Z"
  },
  {
    "title": "'Terrorist scum': Trump announces Christmas Day strikes in Nigeria in response to persecution of Christians",
    "description": "Christians in Nigeria have faced increased persecution recently. President Trump has landed a major surprise blow against those responsible. On Christmas Day, President Donald Trump announced a \"powerful and deadly strike against ISIS Terrorist Scum in Northw…",
    "link": "https://www.theblaze.com/news/terrorist-scum-trump-announces-christmas-day-strikes-in-nigeria-in-response-to-persecution-of-christians",
    "timestamp": "2025-12-26T15:31:04Z"
  },
  {
    "title": "UK Teacher Referred to Anti-Terror Programme for Showing Students Trump Videos: Report",
    "description": "A schoolteacher in England was reportedly referred to the Prevent programme after he showed his students Donald Trump videos.\nThe post UK Teacher Referred to Anti-Terror Programme for Showing Students Trump Videos: Report appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/12/26/uk-teacher-referred-to-anti-terror-programme-for-showing-students-trump-videos/",
    "timestamp": "2025-12-26T15:29:40Z"
  },
  {
    "title": "What To Know About The Militants Targeted By U.S. Airstrikes In Nigeria",
    "description": "Residents and security analysts have said Nigeria’s security crisis affects both Christians and Muslims.",
    "link": "https://www.huffpost.com/entry/militants-targeted-united-states-airstrikes-nigeria_n_694ea2f5e4b0b9ab57f1d7cb",
    "timestamp": "2025-12-26T15:24:03Z"
  },
  {
    "title": "Cancelled US comedian Jimmy Kimmel to deliver Christmas message to UK",
    "description": "The US comedian whose late-night show was briefly cancelled after pressure from Donald Trump’s government is to urge UK audiences to stand up for free speech. In a defiant alternative Christmas message on Channel 4, Jimmy Kimmel will liken the first year of T…",
    "link": "https://freerepublic.com/focus/f-news/4359061/posts",
    "timestamp": "2025-12-26T15:23:33Z"
  },
  {
    "title": "The Lions hit rock bottom, Dan Campbell cracks the whip, and some blame the Donald Trump curse",
    "description": "Dan Campbell will have a lot to consider this year-end. After the 23-10 loss to the Minnesota Vikings, the Detroit Lions head coach offered a thorough self-critique, but fans have",
    "link": "https://www.marca.com/en/nfl/detroit-lions/2025/12/26/694ea654e2704e89368b45b3.html",
    "timestamp": "2025-12-26T15:21:47Z"
  },
  {
    "title": "Minnesota’s Lt. Gov. Takes Pandering To Somalis To The Next Level",
    "description": "Democratic Lt. Gov. Peggy Flanagan of Minnesota praised Somali migrants in the state during a visit to a market in a video posted on YouTube Thursday.",
    "link": "https://dailycaller.com/2025/12/26/minnesota-lt-gov-peggy-flanagan-hijab-somali-migrants/",
    "timestamp": "2025-12-26T15:21:39Z"
  },
  {
    "title": "‘Nothing but corruption’: Trump voter now ‘totally disgusted’ with president",
    "description": "A man who voted for President Donald Trump explained that he had changed his mind because the current administration was \"nothing but corruption.\"During Friday's edition of C-SPAN's Washington Journal, a man named Russel called in to explain why he had flippe…",
    "link": "https://www.rawstory.com/trump-voter-corruption-totally/",
    "timestamp": "2025-12-26T15:21:24Z"
  },
  {
    "title": "'Enjoy What May Be Your Last Merry Christmas!': Trump's Bonkers Holiday Message",
    "description": "Donald Trump launched multiple attacks for his Christmas messages, with a shout-out to the \"radical liberal scum,\" \"losers,\" and \"sleazebags,\" and ended his final rant with a foreboding message, writing, \"Enjoy what may be your last Merry Christmas!\" Trump al…",
    "link": "https://crooksandliars.com/2025/12/enjoy-what-may-be-your-last-merry",
    "timestamp": "2025-12-26T15:18:33Z"
  },
  {
    "title": "Zelenskyy says he will meet with Trump in Florida on Sunday for talks on Ukraine security guarantees, 'territorial issues'",
    "description": "The announced meeting is the latest development in an extensive U.S.-led diplomatic push to end the nearly four-year Russia-Ukraine war.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-says-he-will-meet-with-trump-in-florida-on-sunday-for-talks-on-ukraine-security-guarantees-territorial-issues",
    "timestamp": "2025-12-26T15:17:05Z"
  },
  {
    "title": "Boiling lobsters alive to be banned in animal cruelty crackdown",
    "description": "Government ministers say that “live boiling is not an acceptable killing method” for crustaceans and alternative guidance will soon be published in the Animal Welfare Strategy....... Boiling lobsters while they are alive and conscious will be banned in a bid …",
    "link": "https://freerepublic.com/focus/f-chat/4359059/posts",
    "timestamp": "2025-12-26T15:11:09Z"
  },
  {
    "title": "Report: Netanyahu-Trump meeting scheduled for Monday at 5:00 p.m. EST",
    "description": "Prime Minister Benjamin Netanyahu’s meeting with US President Donald Trump will likely take place this coming Monday at 5:00 p.m. Florida time (midnight Israel time), Ynet reported on Friday.(Arutz Sheva-Israel National News' North American desk is keeping yo…",
    "link": "https://www.israelnationalnews.com/flashes/673179",
    "timestamp": "2025-12-26T15:11:00Z"
  },
  {
    "title": "President Trump and Zelenskyy Meeting Sunday at Mar-a-Lago, Ukraine President Confirms",
    "description": "President Donald Trump will meet with Ukraine President Volodymyr Zelenskyy Sunday at Mar-a-Lago, in a bid to reach agreement on a peace plan to end... Read More\nThe post President Trump and Zelenskyy Meeting Sunday at Mar-a-Lago, Ukraine President Confirms a…",
    "link": "https://www.dailysignal.com/2025/12/26/president-trump-and-zelenskyy-meeting-sunday-at-mar-a-lago-ukraine-president-confirms/",
    "timestamp": "2025-12-26T15:06:39Z"
  },
  {
    "title": "ICE Taps New Surveillance Tech",
    "description": "“The U.S. Immigration and Customs Enforcement is buying millions of dollars’ worth of new surveillance tools at the same time President Donald Trump has scaled back protections for use of civilian data — a combination that could lead to a vast expansion of do…",
    "link": "https://politicalwire.com/2025/12/26/ice-taps-new-surveillance-tech/",
    "timestamp": "2025-12-26T15:06:00Z"
  },
  {
    "title": "Zelenskyy says a meeting with Trump over the war in Ukraine will happen 'in the near future' (Associated Press)",
    "description": "Associated Press:\nZelenskyy says a meeting with Trump over the war in Ukraine will happen ‘in the near future’  —  A meeting with U.S. President Donald Trump will happen “in the near future,” Ukrainian President Volodymyr Zelenskyy said Friday, signaling prog…",
    "link": "https://www.memeorandum.com/251226/p15",
    "timestamp": "2025-12-26T15:05:00Z"
  },
  {
    "title": "Pro-police group asks DOJ to probe Soros-backed Virginia prosecutor using Biden-era law once aimed at cops",
    "description": "Law enforcement group accuses Fairfax prosecutor of leniency towards illegal immigrants a after murder suspect was released and allegedly killed again next day.",
    "link": "https://www.foxnews.com/politics/pro-police-group-asks-doj-probe-soros-backed-virginia-prosecutor-using-biden-era-law-once-aimed-cops",
    "timestamp": "2025-12-26T15:04:20Z"
  },
  {
    "title": "Trump Launches Strikes on ISIS Terrorists in Nigeria",
    "description": "\"I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was.\"\nThe post Trump Launches Strikes on ISIS Terrorists in Nigeria first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/trump-launches-strikes-on-isis-terrorists-in-nigeria/",
    "timestamp": "2025-12-26T15:00:20Z"
  },
  {
    "title": "Nvidia Plans to Begin Shipping Powerful H200 AI Chip to China by Mid-February",
    "description": "Nvidia plans to start shipping its powerful H200 AI chips to China before the Lunar New Year holiday in mid-February, according to sources familiar with the matter.\nThe post Nvidia Plans to Begin Shipping Powerful H200 AI Chip to China by Mid-February appeare…",
    "link": "https://www.breitbart.com/tech/2025/12/26/nvidia-plans-to-begin-shipping-powerful-h200-ai-chip-to-china-by-mid-february/",
    "timestamp": "2025-12-26T15:00:01Z"
  },
  {
    "title": "Trump growing ‘increasingly irrelevant’ to Americans – and he ‘can’t stand it’: analyst",
    "description": "President Donald Trump launched into a social media frenzy Thursday on Christmas Day, but political analyst Jason Easley says Americans are tuning him out – and Trump “can’t stand it.”Trump made well over 100\r\n social media posts Thursday, including one lengt…",
    "link": "https://www.rawstory.com/trump-2674830285/",
    "timestamp": "2025-12-26T14:55:40Z"
  },
  {
    "title": "What to know about the Islamic State militants targeted by U.S. airstrikes in northwest Nigeria",
    "description": "Although officials did not say which group was targeted, security analysts said the target is most likely the Lakurawa group, an IS-affiliated jihadi group.",
    "link": "https://www.pbs.org/newshour/world/what-to-know-about-the-islamic-state-militants-targeted-by-u-s-airstrikes-in-northwest-nigeria",
    "timestamp": "2025-12-26T14:52:59Z"
  },
  {
    "title": "Trump’s strike on ISIS and the narrative of persecuted Christians – Nigeria says it approved the attack",
    "description": "The American strike against Islamists in Nigeria was accompanied by strong religious rhetoric from Donald Trump\nThe post Trump’s strike on ISIS and the narrative of persecuted Christians – Nigeria says it approved the attack appeared first on ProtoThema Engli…",
    "link": "https://en.protothema.gr/2025/12/26/trumps-strike-on-isis-and-the-narrative-of-persecuted-christians-nigeria-says-it-approved-the-attack/",
    "timestamp": "2025-12-26T14:52:49Z"
  },
  {
    "title": "Jimmy Kimmel Spends His Christmas Bashing Trump’s America To Foreign Viewers",
    "description": "ABC late night host Jimmy Kimmel told British viewers on Thursday that \"tyranny is booming\" under President Donald Trump's leadership in the U.S.",
    "link": "https://dailycaller.com/2025/12/26/jimmy-kimmel-christmas-trump-america-britain/",
    "timestamp": "2025-12-26T14:51:46Z"
  },
  {
    "title": "Thailand bombs a village in Cambodia even as both nations hold border talks to end armed clashes",
    "description": "Thailand and Cambodia are still engaged in combat along their border even as talks are ongoing to end clashes that began in early December to break a previous ceasefire. Cambodia's Defense Ministry said Friday that Thailand deployed fighter jets to bomb a vil…",
    "link": "https://apnews.com/article/thailand-cambodia-border-fighting-ceasefire-wildlife-93e7c405baa7d446134b2bfad0410cf4",
    "timestamp": "2025-12-26T14:50:28Z"
  },
  {
    "title": "White House announces new details on Trump’s ballroom plans will be revealed in January",
    "description": "The White House will unveil new details on President Donald Trump’s planned East Wing ballroom during a hearing early next month, according to a federal commission tasked with reviewing the project.\n\n\n\nThe new ballroom, which Trump has said would cost $400 mi…",
    "link": "https://www.reutersconnect.com/detail?id=tag:reuters.com,2025:newsml_KBN3NP0NV:2&amp;share=true",
    "timestamp": "2025-12-26T14:48:31Z"
  },
  {
    "title": "Even Trump-Aligned Economists Warn President Is About to Upend U.S. Health Care - NewsBreak",
    "description": "President Donald Trump has spent months promising a straightforward solution for one of America’s biggest frustrations: prescription drug prices. Last week",
    "link": "https://www.newsbreak.com/share/4413413595231-even-trump-aligned-economists-warn-president-is-about-to-upend-u-s-health-care?s=a2&amp;share_destination_id=NTI0MjYxNDEtMTc2Njc2MDQ4MDI0Mg%3D%3D&amp;pd=03XyQvHt&amp;hl=en_US&amp;send_time=1766760480&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.51.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-26T14:48:23Z"
  },
  {
    "title": "Canadians still aren't crossing the Buffalo Niagara border",
    "description": "Border crossings by Canadians into the region started to drop in February, shortly after President Trump took office, and they continued to be down into the fall, according to data",
    "link": "https://buffalonews.com/news/local/business/article_3d9e85b9-7ea0-4d77-972f-f306e611f9b2.html",
    "timestamp": "2025-12-26T14:47:07Z"
  }
]