[
  {
    "title": "Why Are People Connecting Charlie Kirk's Murder To The Film 'Snake Eyes?' The 1998 Nicolas Cage Movie And The New Conspiracy Theory Explained",
    "description": "Charlie Kirk's assassination has a few similarities to the 1998 film _Snake Eyes_, and it's a strange set of coincidences according to the conspiracy-minded side of the web.",
    "link": "https://knowyourmeme.com/editorials/guides/why-are-people-connecting-charlie-kirks-murder-to-the-film-snake-eyes-the-1998-nicolas-cage-movie-and-the-new-conspiracy-theory-explained",
    "timestamp": "2025-09-25T21:48:28Z"
  },
  {
    "title": "Trump snubs Biden with autopen photo in new White House portrait collection",
    "description": "President Donald Trump has added a Presidential Walk of Fame to the exterior of the White House, featuring portraits of each of the previous commanders-in-chief — except for one.",
    "link": "https://biztoc.com/x/8b2f31be3c69f9c2",
    "timestamp": "2025-09-25T21:45:53Z"
  },
  {
    "title": "Trump signs executive order on TikTok",
    "description": "President Donald Trump signs an executive order about Tiktok in the Oval Office of the White House in Washington, DC, on Sept. 25, 2025.",
    "link": "https://biztoc.com/x/80cb0c652e07523c",
    "timestamp": "2025-09-25T21:45:43Z"
  },
  {
    "title": "PR Roundup: PR Lessons from Kimmel’s Monologue, Pitching Podcasts and Debuting “BrutalGPT”",
    "description": "In this PR Roundup we look at the PR world's reaction to Jimmy Kimmel's critical monologue messaging, encouraging numbers surrounding podcasts and a cheeky campaign surrounding ChatGPT.\nThe post PR Roundup: PR Lessons from Kimmel’s Monologue, Pitching Podcast…",
    "link": "https://www.prnewsonline.com/pr-roundup-pr-lessons-from-kimmels-monologue-pitching-podcasts-and-debuting-brutalgpt/",
    "timestamp": "2025-09-25T21:44:54Z"
  },
  {
    "title": "Kristi Noem Swerves When Asked if Democrats Are An 'Extremist Organization'",
    "description": "Noem was careful with her words while talking about Wednesday's shooting at a Dallas ICE facility during an appearance on CNN.",
    "link": "https://www.huffpost.com/entry/kristi-noem-swerves-democrats-extremist-organization-question_n_68d57babe4b0b2f96b454068",
    "timestamp": "2025-09-25T21:44:17Z"
  },
  {
    "title": "Trump Offered Ilhan Omar Back to President of Somalia: He Said, 'I Don't Want Her'",
    "description": "President Donald Trump says Somali President Hassan Sheikh Mohamud told him he does not want Rep. Ilhan Omar (D-MN) back in Somalia.\nThe post Trump Offered Ilhan Omar Back to President of Somalia: He Said, ‘I Don’t Want Her’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/25/trump-offered-ilhan-omar-back-to-president-of-somalia-he-said-i-dont-want-her/",
    "timestamp": "2025-09-25T21:44:16Z"
  },
  {
    "title": "If You Want To Crack Down On Left-Wing Terror, Here’s Where To Start",
    "description": "Left-wing violence is spreading across the country. Leaders in the Trump administration have vowed to stop these groups and already know where to start.",
    "link": "https://dailycaller.com/2025/09/25/left-wing-antifa-charlie-kirk-donald-trump-jd-vance-terrorism/",
    "timestamp": "2025-09-25T21:43:59Z"
  },
  {
    "title": "Trump Signs Executive Order to Finalize TikTok Deal: What It Means",
    "description": "President Donald Trump has officially signed an executive order that allows TikTok to remain active in the United States under new ownership. The deal will transfer control of roughly 45% of the social media app’s U.S. business to a group of American investor…",
    "link": "https://www.justjared.com/2025/09/25/trump-signs-executive-order-to-finalize-tiktok-deal-what-it-means/",
    "timestamp": "2025-09-25T21:43:37Z"
  },
  {
    "title": "Trump’s Rush to Indict James Comey Is a Vengeful Farce",
    "description": "Even Pam Bondi ﻿has reservations about bringing charges against the former FBI director—and that’s saying something",
    "link": "https://www.esquire.com/news-politics/politics/a68062959/trump-james-comey-seeking-indictment/",
    "timestamp": "2025-09-25T21:43:00Z"
  },
  {
    "title": "Chicago area center in Trump's immigration crackdown sparks complaints of inhumane conditions",
    "description": "A boarded-up building in a small Chicago suburb has become the front line of a federal immigration crackdown in the nation's third-largest city",
    "link": "https://abcnews.go.com/US/wireStory/chicago-area-center-trumps-immigration-crackdown-sparks-complaints-125946286",
    "timestamp": "2025-09-25T21:42:30Z"
  },
  {
    "title": "Trump/Epstein Friendship Statue Destroyed And Removed From Natl Mall",
    "description": "As I previously wrote, a sculpture popped up on the National Mall Tuesday showing Donald Trump holding hands with his former BFF, the sex-trafficking pedophile, Jeffrey Epstein. A plaque said it had been made and placed there, directly across from the Capitol…",
    "link": "https://crooksandliars.com/2025/09/trumpepstein-friendship-statue-destroyed",
    "timestamp": "2025-09-25T21:41:59Z"
  },
  {
    "title": "Springsteen Previews ‘Nebraska’ Box, Rips Trump in New Interview",
    "description": "The first clip of a newly filmed Nebraska concert was released today, just as he tells Time magazine that he has issues with the president and Democrats alike",
    "link": "http://www.rollingstone.com/music/music-news/bruce-springsteen-nebraska-box-preview-trump-1235435512/",
    "timestamp": "2025-09-25T21:41:36Z"
  },
  {
    "title": "Reuters Praises Communist China’s Phony Climate Plans Just to Dig at Trump",
    "description": "Leave it to the lefties at Reuters to act like they’re actually shaming President Donald Trump while behaving like media minions for the communist Chinese government.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/09/25/shanghaied-reuters-praises-commie-chinas-phony-climate",
    "timestamp": "2025-09-25T21:41:18Z"
  },
  {
    "title": "Trump snubs Biden with autopen photo in new White House portrait collection",
    "description": "President Donald Trump has added a Presidential Walk of Fame to the exterior of the White House, featuring portraits of each of the previous commanders-in-chief — except for one.",
    "link": "https://www.pbs.org/newshour/politics/trump-snubs-biden-with-autopen-photo-in-new-white-house-portrait-collection",
    "timestamp": "2025-09-25T21:41:13Z"
  },
  {
    "title": "Trump Says He Will Not Allow Israel to Annex the West Bank",
    "description": "President Donald Trump said he would not allow Israel to annex the West Bank, as Israeli Prime Minister Benjamin Netanyahu faces pressure from some members of his coalition to increase Israeli control over the region.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-he-will-not-allow-israel-to-annex-the-west-bank",
    "timestamp": "2025-09-25T21:40:52Z"
  },
  {
    "title": "Paramount Skydance appoints former antitrust enforcer Delrahim as legal chief",
    "description": "Delrahim, a former assistant attorney general for the Justice Department's Antitrust Division, was part of the legal firm that advised Skydance Media...",
    "link": "https://ca.finance.yahoo.com/news/paramount-skydance-appoints-former-antitrust-214035767.html",
    "timestamp": "2025-09-25T21:40:35Z"
  },
  {
    "title": "Trump Takes His Fossil Fuel Crusade Global",
    "description": "The U.S. leader is pressuring the world to abandon climate action. Will it work?",
    "link": "http://foreignpolicy.com/2025/09/25/trump-energy-fossil-fuel-climate-trade-pressure/",
    "timestamp": "2025-09-25T21:39:26Z"
  },
  {
    "title": "European soccer body UEFA moves toward vote to suspend Israel",
    "description": "European soccer body UEFA is moving toward a vote to suspend its member federation Israel over the war in Gaza, people familiar with the proposal told The Associated Press on Thursday. A majority of UEFA’s 20-member executive committee is expected to support …",
    "link": "https://japantoday.com/category/sports/european-soccer-body-uefa-moves-toward-vote-to-suspend-israel",
    "timestamp": "2025-09-25T21:38:38Z"
  },
  {
    "title": "Suspect in Dallas shooting sought to terrorize ICE agents, officials say",
    "description": "The gunman who opened fire on an Immigration and Customs Enforcement field office in Dallas left behind a collection of notes at his home saying he acted alone in an attack that was intended to terrorize ICE agents and minimize harm to detainees at the facili…",
    "link": "https://japantoday.com/category/world/suspect-in-dallas-shooting-sought-to-terrorize-ice-agents-officials-say",
    "timestamp": "2025-09-25T21:37:57Z"
  },
  {
    "title": "Meeting Erdogan, Trump suggests he may lift sanctions on Turkey and presses on Russian oil",
    "description": "President Donald Trump suggested the U.S. could lift sanctions on Turkey and allow it to buy U.S. F-35 jets as he kicked off talks with Turkish President Tayyip Erdogan on Thursday, but said he wanted Ankara to stop purchases of Russian oil. Erdogan's first v…",
    "link": "https://japantoday.com/category/world/meeting-erdogan-trump-suggests-he-may-lift-sanctions-on-turkey-and-presses-on-russian-oil",
    "timestamp": "2025-09-25T21:37:46Z"
  },
  {
    "title": "Trump Signs Order to Allow TikTok to Continue Operating Under American Company",
    "description": "President Donald Trump signed an executive order Wednesday approving a deal to allow TikTok to continue operating in the United States, as the Chinese app becomes majority-owned by American interests in a new joint-venture company.\nThe post Trump Signs Order …",
    "link": "https://www.breitbart.com/tech/2025/09/25/trump-signs-order-to-allow-tiktok-to-continue-operating-under-american-company/",
    "timestamp": "2025-09-25T21:37:24Z"
  },
  {
    "title": "White House budget office tells agencies to draft mass firing plans ahead of potential shutdown",
    "description": "The White House is telling agencies to prepare large-scale firings of federal workers if the government shuts down next week.  In a memo released Wednesday night, the Office of Management and Budget said agencies should consider a reduction in force for feder…",
    "link": "https://japantoday.com/category/world/white-house-budget-office-tells-agencies-to-draft-mass-firing-plans-ahead-of-potential-shutdown",
    "timestamp": "2025-09-25T21:37:17Z"
  },
  {
    "title": "Lavrov, at U.N. accuses NATO and EU of declaring 'real war' on Russia",
    "description": "Russia's foreign minister accused NATO and the European Union of using Ukraine to wage war against his country in a speech on the sidelines of the United Nations on Thursday that Britain dismissed as &quot;false fantasy world distortions.&quot; He spoke at a …",
    "link": "https://japantoday.com/category/world/lavrov-at-un-accuses-nato-and-eu-of-declaring-%27real-war%27-on-russia",
    "timestamp": "2025-09-25T21:37:09Z"
  },
  {
    "title": "Trump assertion that London could introduce Sharia law is 'nonsense,' says Starmer",
    "description": "British Prime Minister Keir Starmer on Thursday rejected Donald Trump's recent assertion that there was a push to apply Islamic Sharia law in London, calling it &quot;nonsense&quot; and defending London Mayor Sadiq Khan in rare criticism of the U.S. president…",
    "link": "https://japantoday.com/category/world/trump-assertion-that-london-could-introduce-sharia-law-is-%27nonsense-%27-says-starmer",
    "timestamp": "2025-09-25T21:37:02Z"
  },
  {
    "title": "Trump officials rally global leaders for restrictions on asylum seekers",
    "description": "At the UN, a representative from the US State Department has called on other countries to tighten their asylum systems.",
    "link": "https://www.aljazeera.com/news/2025/9/25/trump-officials-rally-global-leaders-for-restrictions-on-asylum-seekers",
    "timestamp": "2025-09-25T21:36:39Z"
  },
  {
    "title": "JUST IN: Trump Approves U.S. Takeover of TikTok, Cuts Chinese Control",
    "description": "Trump has officially approved a U.S.-controlled restructuring of TikTok, allowing the popular social media app to remain available in America.\nThe post JUST IN: Trump Approves U.S. Takeover of TikTok, Cuts Chinese Control first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/just-in-trump-approves-u-s-takeover-of-tiktok-cuts-chinese-control/",
    "timestamp": "2025-09-25T21:36:19Z"
  },
  {
    "title": "Democrats Brush Off Trump's Shutdown Mass Firing Threat",
    "description": "The Trump administration’s plans to fire thousands of federal workers in the event of a government shutdown is akin to “mafia-style blackmail,” Sen. Chris Van Hollen (D-Md.) said.",
    "link": "https://www.huffpost.com/entry/democrats-mass-firings-government-shutdown_n_68d5a51ee4b01e99f72e3fe0",
    "timestamp": "2025-09-25T21:36:11Z"
  },
  {
    "title": "'Wow': Critics outraged as ex-officials face criminal charges 'to make Trump happy'",
    "description": "CNN reported Thursday that sources are claiming President Donald Trump wants the Justice Department to indict his former national security advisor, John Bolton. It comes amid reports that former FBI Director James Comey will be indicted sometime in the next f…",
    "link": "https://www.rawstory.com/john-bolton-2674040827/",
    "timestamp": "2025-09-25T21:36:01Z"
  },
  {
    "title": "Trump signs memo calling for crackdown on alleged 'organized political violence'",
    "description": "Trump signs memo calling for crackdown on alleged 'organized political violence'go.com",
    "link": "https://abcnews.go.com/Politics/trump-signs-memo-calling-crackdown-alleged-organized-political/story?id=125945624",
    "timestamp": "2025-09-25T21:35:24Z"
  },
  {
    "title": "Trump signs order advancing TikTok deal, in boost to corporate allies (Drew Harwell/Washington Post)",
    "description": "Drew Harwell / Washington Post:\nTrump signs order advancing TikTok deal, in boost to corporate allies  —  The deal would create an American version of the popular video app owned by some of the president's wealthiest supporters.  —  Just now  —  President Don…",
    "link": "https://www.memeorandum.com/250925/p124",
    "timestamp": "2025-09-25T21:35:01Z"
  },
  {
    "title": "No autism among the Amish? Lancaster County experts respond to Trump comments",
    "description": "Does autism not exist in Amish populations, as the president alluded earlier this week in a news conference? The answer is no, anecdotally, but more research would need to be done for accurate numbers, experts say.",
    "link": "https://lancasteronline.com/news/local/no-autism-among-the-amish-lancaster-county-experts-respond-to-trump-comments/article_c002c3bc-9ba6-4083-ba07-c73099ac047f.html",
    "timestamp": "2025-09-25T21:34:00Z"
  },
  {
    "title": "Trump signs order saying China will sell TikTok assets, allowing app to keep operating in U.S.",
    "description": "U.S. President Donald Trump signed an executive order on Thursday declaring that his plan to sell TikTok's U.S. operations to U.S. and global investors will meet the requirements in a 2024 law that says the short video app will be banned unless its Chinese ow…",
    "link": "https://www.cbc.ca/news/world/tik-tok-trump-sale-1.7643949",
    "timestamp": "2025-09-25T21:33:25Z"
  },
  {
    "title": "Teen pleads guilty to DOGE staffer beating that sparked DC National Guard deployment",
    "description": "A 15-year-old boy pleaded guilty to the beating of a teenage ex-DOGE staffer earlier that sparked President Donald Trump’s deployment of the National Guard to restore order to the city.",
    "link": "https://www.foxnews.com/politics/teen-pleads-guilty-doge-staffer-beating-sparked-dc-national-guard-deployment",
    "timestamp": "2025-09-25T21:33:10Z"
  },
  {
    "title": "Leading Health Groups Slam Trump and RFK’s Claims Linking Tylenol to Autism: ‘Irresponsible and Misleading’",
    "description": "Doctors and autism researchers stress that acetaminophen remains safe during pregnancy and warn that Trump and Kennedy’s claims risk spreading harmful misinformation.\nAmerican Academy of Pediatrics (AAP): “Today’s White House event on autism was filled with d…",
    "link": "https://msmagazine.com/2025/09/25/doctors-autism-tylenol-acetaminophen-pregnancy/",
    "timestamp": "2025-09-25T21:30:00Z"
  },
  {
    "title": "Democrats hit back at Trump threat of mass firings in government shutdown",
    "description": "Democrats hit back Thursday at President Donald Trump’s threat to fire thousands of federal workers if the government shuts down as soon as next week.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_8afce3eb-1830-59aa-964c-afeebabdbcb0.html",
    "timestamp": "2025-09-25T21:30:00Z"
  },
  {
    "title": "Shale oil execs say Trump policies are hurting investment, 'business is broken'",
    "description": "The executives' anonymous comments were published in a quarterly survey of oil and gas companies by the Federal Reserve Bank of Dallas this week.",
    "link": "https://www.cnbc.com/2025/09/25/shale-oil-execs-say-trump-policies-are-hurting-investment-business-is-broken.html",
    "timestamp": "2025-09-25T21:28:06Z"
  },
  {
    "title": "'Not good enough': Trump inadvertently chides his own official at press conference",
    "description": "President Donald Trump inadvertently chided his FBI Director, Kash Patel, during a news conference in the Oval Office about his efforts to lower crime in Chicago. Trump's remarks came after he signed an executive order making the popular social media platform…",
    "link": "https://www.rawstory.com/kash-patel-2674040863/",
    "timestamp": "2025-09-25T21:27:02Z"
  },
  {
    "title": "Trump says he will not allow Israel to annex the West Bank",
    "description": "WASHINGTON: President Donald Trump said on Thursday (Sep 25) that he will not allow Israel to annex the West Bank, rejecting calls from far-right Israeli politicians who want sovereignty ext",
    "link": "https://www.channelnewsasia.com/world/trump-says-he-will-not-allow-israel-annex-west-bank-5370241",
    "timestamp": "2025-09-25T21:27:00Z"
  },
  {
    "title": "'Time to stop': Trump vows Israel will not annex West Bank",
    "description": "WASHINGTON: United States President Donald Trump said on Thursday (Sep 25) that he will not allow Israel to annex the West Bank, rejecting calls from far-right Israeli politicians who want to extend sovereignty over the area and snuff out hopes for a viable P…",
    "link": "https://www.channelnewsasia.com/world/trump-not-allow-israel-annex-west-bank-5370241",
    "timestamp": "2025-09-25T21:27:00Z"
  },
  {
    "title": "South Park skewers prediction markets in latest episode",
    "description": "Among the bets the characters made in the animated series included whether the fictional baby created by Donald Trump and Satan was a boy or a girl.",
    "link": "https://cointelegraph.com/news/south-park-prediction-markets-episode",
    "timestamp": "2025-09-25T21:25:47Z"
  },
  {
    "title": "Pam Bondi Reportedly Waffling on James Comey Prosecution",
    "description": "Attorney General Pam Bondi is waffling over whether to prosecute former FBI Director James Comey, CNN reported on Thursday\nThe post Pam Bondi Reportedly Waffling on James Comey Prosecution first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-pam-bondi-reportedly-waffling-on-james-comey-prosecution/",
    "timestamp": "2025-09-25T21:25:14Z"
  },
  {
    "title": "Trump signs executive order on TikTok",
    "description": "President Donald Trump signed an executive order on Thursday to secure the future of social media app TikTok in the United States.",
    "link": "https://www.msnbc.com/top-stories/latest/tiktok-trump-executive-order-united-states-rcna233736",
    "timestamp": "2025-09-25T21:24:56Z"
  },
  {
    "title": "Bosch to cut 13,000 jobs to save billions in costs",
    "description": "The engineering giant says increased competition and costs mean it must scale back.",
    "link": "https://www.bbc.com/news/articles/cx275251xzro",
    "timestamp": "2025-09-25T21:24:02Z"
  },
  {
    "title": "“We have to figure out a way to capture these kids”",
    "description": "Health Secretary Robert F. Kennedy Jr. and his staff are working on policy changes that would sweep children with autism spectrum disorder into a federal program that compensates people for alleged vaccine injuries, an adviser said Thursday. Changes to the li…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/we-have-to-figure-out-a-way-to-capture-these-kids",
    "timestamp": "2025-09-25T21:24:01Z"
  },
  {
    "title": "Donald Trump Lays Down Red Line for Israel",
    "description": "Unlike Gaza, where Israel’s war with Hamas continues, the West Bank is governed by the Palestinian Authority.",
    "link": "https://biztoc.com/x/4ecc841fccf0a3d3",
    "timestamp": "2025-09-25T21:23:51Z"
  },
  {
    "title": "Oracle Stock Rises After Trump Signs Executive Order On TikTok",
    "description": "Oracle Corp (NYSE: ORCL) shares are moving higher in extended trading on Thursday after President Donald Trump signed an executive order to approve a deal to keep TikTok available in the U.S.\nWhat To Know: Trump has officially signed an executive order to kee…",
    "link": "https://biztoc.com/x/ac6242bef34e548a",
    "timestamp": "2025-09-25T21:23:45Z"
  },
  {
    "title": "Trump Signs Order Advancing TikTok Deal",
    "description": "“President Donald Trump signed an executive order Thursday to help advance a spin-off of TikTok in the United States to a group of mostly American investors, further pushing the influential app with 170 million U.S.",
    "link": "https://politicalwire.com/2025/09/25/trump-signs-order-advancing-tiktok-deal/",
    "timestamp": "2025-09-25T21:22:42Z"
  },
  {
    "title": "UN to vote on Iran as sanctions loom",
    "description": "The UN Security Council will take up the dispute over Iran’s nuclear program again Friday as China and Russia seek to give more time for diplomacy on the eve of new sanctions against Tehran. European powers, complaining that Iran has not cooperated, have trig…",
    "link": "https://www.digitaljournal.com/world/un-to-vote-on-iran-as-sanctions-loom/article",
    "timestamp": "2025-09-25T21:22:20Z"
  },
  {
    "title": "Shooter intended to target ICE agents, not migrants: FBI",
    "description": "The FBI has searched the home of the man who opened fired on an Immigration and Customs Enforcement facility in Texas, finding notes that say he was acting alone and intended to target agents, not detainees.",
    "link": "https://www.abc.net.au/news/2025-09-26/ice-shooter-wanted-to-target-agents-not-detainees-fbi-says/105819378",
    "timestamp": "2025-09-25T21:21:59Z"
  },
  {
    "title": "Jimmy Kimmel Isn’t Going to Stop Talking About Trump",
    "description": "Jimmy Kimmel’s still having fun making fun of the president after his suspension: “Only Donald Trump would try to prove he wasn’t threatening ABC by threatening ABC.’",
    "link": "http://www.vulture.com/article/jimmy-kimmel-trump-monologue-abc-threats.html",
    "timestamp": "2025-09-25T21:20:41Z"
  },
  {
    "title": "Trump signs executive order approving TikTok deal",
    "description": "President Donald Trump has signed an executive order approving a TikTok deal that will save it from a nationwide ban. (We haven’t actually seen the order yet, only watched Trump sign it — we’ll update once we’ve seen the full text.) The deal values TikTok’s U…",
    "link": "https://www.theverge.com/news/640745/tiktok-deal-trump-us-china-bytedance",
    "timestamp": "2025-09-25T21:20:04Z"
  },
  {
    "title": "Jim Acosta Comes Up With Hilariously Petty Way To Forever Link Trump’s Legacy To Epstein",
    "description": "The former CNN host’s excellent idea for revenge was inspired by Trump’s latest attack on Joe Biden.",
    "link": "https://www.huffpost.com/entry/jim-acosta-comes-up-with-hilariously-petty-way-to-forever-link-trumps-legacy-to-epstein_n_68d57c10e4b01e99f72e1745",
    "timestamp": "2025-09-25T21:19:24Z"
  },
  {
    "title": "Paramount Hires Former Trump DOJ Antitrust Head As Chief Legal Officer",
    "description": "Paramount Skydance said Thursday that it has hired Makan Delrahim, who served as head of the U.S. Department of Justice’s antitrust unit during Donald Trump’s first term as president, to be the new company’s Chief Legal Officer. In the role, Delrahim will ove…",
    "link": "http://deadline.com/2025/09/paramount-makan-delrahim-chief-legal-officer-1236556360/",
    "timestamp": "2025-09-25T21:18:42Z"
  },
  {
    "title": "Federal judge rules against Trump admin, allows resume of massive offshore wind project",
    "description": "Revolution Wind was 80% complete when administration issued stop-work order in August.",
    "link": "https://www.foxbusiness.com/economy/federal-judge-rules-against-trump-admin-allows-offshore-wind-project-resume",
    "timestamp": "2025-09-25T21:18:38Z"
  },
  {
    "title": "Trump Says He Will Not Allow Israel To Annex The West Bank",
    "description": "The president has bragged about his closeness with Israeli Prime Minister Benjamin Netanyahu, but is facing pressure from concerned Arab leaders.",
    "link": "https://www.huffpost.com/entry/trump-will-not-allow-israel-annex-west-bank-palestine_n_68d5aface4b0b2f96b456e43",
    "timestamp": "2025-09-25T21:18:15Z"
  },
  {
    "title": "Hoping Cars Would Get Lighter Again? Too Freaking Bad, Tariffs Are Killing That Dream",
    "description": "High tariff costs and the President's deregulation push might have the effect of causing automakers to de-emphasize weight savings in the name of cost savings",
    "link": "https://www.jalopnik.com/1978871/tariffs-killing-dream-of-lighter-cars/",
    "timestamp": "2025-09-25T21:17:56Z"
  },
  {
    "title": "Colin Firth’s Ex-Wife Rips Up MBE Over Royal Family’s ‘Cowardly’ Visit With Trump",
    "description": "\"As I write this, we see that horrible excuse of a human (called Trump) in full flow at the UN General Assembly, his poisonous rhetoric amplified and legitimized,\" Livia Giuggioli Firth shares\nThe post Colin Firth’s Ex-Wife Rips Up MBE Over Royal Family’s ‘Co…",
    "link": "https://www.thewrap.com/colin-firth-ex-wife-livia-rips-up-mbe-trump-royal-family-visit/",
    "timestamp": "2025-09-25T21:17:25Z"
  },
  {
    "title": "Trump Signs Order to Transfer TikTok to US Ownership",
    "description": "\"This is going to be American-operated all the way,\" Trump says.",
    "link": "https://www.cnet.com/tech/trump-signs-order-to-transfer-tiktok-to-us-ownership/",
    "timestamp": "2025-09-25T21:15:02Z"
  },
  {
    "title": "US Pushes Overhaul of Global Asylum Rules After Trump Speech (Eric Martin/Bloomberg)",
    "description": "Eric Martin / Bloomberg:\nUS Pushes Overhaul of Global Asylum Rules After Trump Speech  —  The US is starting a campaign to revamp international asylum rules that it says are outdated and frequently abused, after President Donald Trump decried “the crisis of u…",
    "link": "https://www.memeorandum.com/250925/p118",
    "timestamp": "2025-09-25T21:15:00Z"
  },
  {
    "title": "Trump Says He’ll Give Tariff Revenues To Farmers Facing Short-Term Pain From Tariffs",
    "description": "President Donald Trump said Thursday he’ll use tariff revenues to send cash aid to farmers who will feel short-term pain before his new duties “kick in.\"",
    "link": "https://dailycaller.com/2025/09/25/donald-trump-brooke-rollins-agriculture-farmers-tariff-revenue/",
    "timestamp": "2025-09-25T21:14:44Z"
  },
  {
    "title": "TikTok’s Chinese Parent Company Owns A Bunch Of Other Apps, Too. Will They Be Saved, Or Banned?",
    "description": "U.S. law requires a ban of CapCut, Gauth, Lemon8, Coze, and many other ByteDance- owned apps, unless they are sold in the TikTok deal that President Trump announced today.",
    "link": "https://www.forbes.com/sites/emilybaker-white/2025/09/25/tiktoks-chinese-parent-company-owns-a-bunch-of-other-apps-too-will-they-be-saved-or-banned/",
    "timestamp": "2025-09-25T21:14:17Z"
  },
  {
    "title": "Trump signs order declaring TikTok sale plan meets US requirements",
    "description": "WASHINGTON: President Donald Trump signed an executive order on Thursday (Sep 25) declaring that his plan to sell TikTok's US operations to American and global investors will meet the req",
    "link": "https://www.channelnewsasia.com/world/trump-signs-order-declaring-tiktok-sale-plan-meets-us-requirements-5370216",
    "timestamp": "2025-09-25T21:13:00Z"
  },
  {
    "title": "Trump signs executive order declaring TikTok sale meets U.S. requirements",
    "description": "President Donald Trump signed an executive order on Thursday declaring that his plan to sell TikTok’s U.S. operations to U.S. and global investors will meet the requirements in a 2024 law that says the short video app will be banned unless its Chinese owners …",
    "link": "https://biztoc.com/x/1551e3d87d8a5df4",
    "timestamp": "2025-09-25T21:12:53Z"
  },
  {
    "title": "President Trump says China’s Xi has approved of proposed deal putting TikTok under US ownership",
    "description": "WASHINGTON — President Donald Trump has signed an executive order that he says will allow TikTok to continue operating in the United States in a way that meets national security concerns laid out by the law.\nPresident Joe Biden signed legislation last year ca…",
    "link": "https://biztoc.com/x/1da86ed834dcebc4",
    "timestamp": "2025-09-25T21:12:35Z"
  },
  {
    "title": "Trump implements death penalty in Washington DC",
    "description": "United States President Donald Trump signed a presidential memorandum implementing the death penalty in Washington, DC.The memorandum orders the United States Attorney General, Pam Bondi, as well as t...",
    "link": "https://biztoc.com/x/7ddb8edcd3c8f7c1",
    "timestamp": "2025-09-25T21:12:28Z"
  },
  {
    "title": "Trump says Xi Jinping approved the TikTok deal, and JD Vance says the transaction values TikTok US at $14B; ByteDance hasn't acknowledged the deal (Jonathan Vanian/CNBC)",
    "description": "Jonathan Vanian / CNBC:\nTrump says Xi Jinping approved the TikTok deal, and JD Vance says the transaction values TikTok US at $14B; ByteDance hasn't acknowledged the deal  —  President Donald Trump on Thursday signed an executive order approving a proposal th…",
    "link": "https://mediagazer.com/250925/p15",
    "timestamp": "2025-09-25T21:12:21Z"
  },
  {
    "title": "DOJ racing to indict top ex-advisor to 'placate' Trump: report",
    "description": "Justice Department officials want prosecutors to rush an indictment of President Donald Trump's former National Security Adviser John Bolton, rather than continue gathering evidence, to keep Trump happy and make him feel like his orders are being followed, CN…",
    "link": "https://www.rawstory.com/bolton-indictment/",
    "timestamp": "2025-09-25T21:10:03Z"
  },
  {
    "title": "Cracks in the Ice: Why Engaging China Can Check Russian Power in the Arctic",
    "description": "The United States and Europe have a card to play by crafting a more functional relationship with China in the Arctic, particularly around the exploitation of natural resources. By accommodating China's comparatively limited ambitions, they would force Russia …",
    "link": "https://www.rand.org/pubs/commentary/2025/09/cracks-in-the-ice-why-engaging-china-can-check-russian.html",
    "timestamp": "2025-09-25T21:10:00Z"
  },
  {
    "title": "CSIS: China Still Dominates Ship Orders Despite U.S. Port Fee Push",
    "description": "Global shipping companies are moving full steam ahead with commercial vessel orders from Chinese shipyards, despite the U.S. targeting those ships with port fees aimed at countering China's maritime dominance, a new report from the Center for Strategic and In…",
    "link": "https://gcaptain.com/csis-china-still-dominates-ship-orders-despite-u-s-port-fee-push/",
    "timestamp": "2025-09-25T21:08:26Z"
  },
  {
    "title": "What Is The Real Reason? Why Have Hundreds Of Generals And Admirals Suddenly Been Summoned For A Mysterious Meeting In Virginia?",
    "description": "An “unprecedented” gathering of generals and admirals will be happening in Virginia next week, and the purpose of the meeting is a huge mystery.  This has sparked a frenzy of speculation on social media, but we still aren’t getting any answers.  Hopefully we …",
    "link": "http://theeconomiccollapseblog.com/what-is-the-real-reason-why-have-hundreds-of-generals-and-admirals-suddenly-been-summoned-for-a-mysterious-meeting-in-virginia/",
    "timestamp": "2025-09-25T21:08:02Z"
  },
  {
    "title": "'They've got to fight back': Democrats press leaders not to cave in a shutdown fight",
    "description": "The White House is threatening to carry out mass firings of federal workers if the government shuts down.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-press-leaders-not-cave-shutdown-fight-rcna233595",
    "timestamp": "2025-09-25T21:08:00Z"
  },
  {
    "title": "Trump says he will not allow Israel to annex the West Bank",
    "description": "The president has faced pressure from Arab leaders.",
    "link": "https://www.bostonherald.com/2025/09/25/trump-west-bank/",
    "timestamp": "2025-09-25T21:05:36Z"
  },
  {
    "title": "Trump Executive Order Will Hand TikTok Over to US Investors",
    "description": "After five deadline extensions and several rounds of negotiations, President Trump signed an executive order to put TikTok’s US operations in the hands of Oracle and other American investors.",
    "link": "https://www.wired.com/story/president-trump-signs-tiktok-deal/",
    "timestamp": "2025-09-25T21:05:29Z"
  },
  {
    "title": "A List of Every House Democrat Calling on Trump to Recognize Palestine",
    "description": "Democratic Representative Ro Khanna has collected almost 50 signatures on a petition of lawmakers urging the Trump administration to acknowledge the State of Palestine. Since the letter was first reported early last month, dozens of House Democrats have signe…",
    "link": "https://newrepublic.com/post/200969/list-house-democrats-letter-trump-recognize-palestine",
    "timestamp": "2025-09-25T21:05:12Z"
  },
  {
    "title": "THE WASHINGTON POST: Tylenol maker Kenvue faces mounting crisis after Trump blast",
    "description": "THE WASHINGTON POST: Trump created a potential existential crisis for the Tylenol maker with just three words - ‘don’t take it’.",
    "link": "https://thenightly.com.au/society/health/the-washington-post-tylenol-maker-kenvue-faces-mounting-crisis-after-trump-blast-c-20142968",
    "timestamp": "2025-09-25T21:04:41Z"
  },
  {
    "title": "Dem Congresswoman Haley Stevens Files Articles of Impeachment Against RFK Jr.",
    "description": "“Secretary Kennedy has violated his oath of office and proven himself unfit to serve the American people,” Stevens said.",
    "link": "https://truthout.org/articles/dem-congresswoman-haley-stevens-files-articles-of-impeachment-against-rfk-jr/",
    "timestamp": "2025-09-25T21:03:49Z"
  },
  {
    "title": "Palestinian leader thanks Australia in UN speech but points to prior failures",
    "description": "Mahmoud Abbas addresses the UN after member states vote to let him deliver a speech via video, because the US would not let him in the country.",
    "link": "https://www.abc.net.au/news/2025-09-26/united-nations-palestinian-authority-mahmoud-abbas-speech/105819446",
    "timestamp": "2025-09-25T21:02:55Z"
  },
  {
    "title": "Russia threatens World War III if NATO attacks its combat jets, Lavrov says 'US-led military alliance and EU declared war on my country'",
    "description": "At a G20 meeting, Sergey Lavrov accused the West of waging war against Russia. He cited NATO and EU support for Ukraine as direct involvement. Alexey Meshkov warned that NATO shooting down Russian jets would mean war. These statements follow Estonia's claim o…",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-threatens-world-war-iii-if-nato-attacks-its-combat-jets-lavrov-says-us-led-military-alliance-and-eu-declared-war-on-my-country/articleshow/124133473.cms",
    "timestamp": "2025-09-25T21:02:31Z"
  },
  {
    "title": "Hegseth abruptly summons top military commanders to a meeting in Virginia next week",
    "description": "WASHINGTON — Defense Secretary Pete Hegseth summoned the military’s top officers — hundreds of generals and admirals — to a base in northern Virginia for a sudden meeting next week, according to three people familiar with the matter.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d80dd299-10c1-578a-b7e3-9907caf1e438.html",
    "timestamp": "2025-09-25T21:02:00Z"
  },
  {
    "title": "Trump signs executive order facilitating TikTok deal",
    "description": "President Donald Trump signed an executive order Thursday paving the way for a TikTok deal that could transfer majority ownership of the app to Americans.",
    "link": "https://biztoc.com/x/36be0331a17144e0",
    "timestamp": "2025-09-25T21:01:31Z"
  },
  {
    "title": "'Extraordinarily Troubling': Legal Experts Sound Off After Trump Threatens To Sue ABC... Again",
    "description": "The president leveled a threat at ABC shortly before Jimmy Kimmel's late night show returned on-air. Law professors share what concerns them the most.",
    "link": "https://www.huffpost.com/entry/donald-trump-abc-rant-legal-experts_n_68d560f9e4b0b2f96b451657",
    "timestamp": "2025-09-25T21:01:25Z"
  },
  {
    "title": "With rural America starting to see huge financial losses from tariff policies, Trump offers vague aid package to farmers in the heartland",
    "description": "President Donald Trump is pledging to use tariff revenue to bail out farmers reeling from the impact of the ongoing trade war. \n“We’re going to take some of that tariff money that we made, we’re going to give it to our farmers, who are, for a little while, go…",
    "link": "https://biztoc.com/x/1e0463f5382af629",
    "timestamp": "2025-09-25T21:01:25Z"
  },
  {
    "title": "Trump: Ukraine has a shot at getting territory back",
    "description": "United States President Donald Trump said on Thursday that Ukraine could potentially regain its original territory. More to come......",
    "link": "https://biztoc.com/x/79497fc44ac18621",
    "timestamp": "2025-09-25T21:01:24Z"
  },
  {
    "title": "Trump says Xi Jinping approved the TikTok deal, and JD Vance says the transaction values TikTok US at $14B; ByteDance hasn't acknowledged the deal (Jonathan Vanian/CNBC)",
    "description": "Jonathan Vanian / CNBC:\nTrump says Xi Jinping approved the TikTok deal, and JD Vance says the transaction values TikTok US at $14B; ByteDance hasn't acknowledged the deal  —  President Donald Trump on Thursday signed an executive order approving a proposed de…",
    "link": "https://www.techmeme.com/250925/p48",
    "timestamp": "2025-09-25T21:01:13Z"
  },
  {
    "title": "Trump signs an EO declaring that a proposed deal allowing TikTok to continue operating in the US will be a qualified sale that meets national security concerns (Associated Press)",
    "description": "Associated Press:\nTrump signs an EO declaring that a proposed deal allowing TikTok to continue operating in the US will be a qualified sale that meets national security concerns  —  President Donald Trump has signed an executive order declaring that a propose…",
    "link": "https://mediagazer.com/250925/p14",
    "timestamp": "2025-09-25T21:00:47Z"
  },
  {
    "title": "Hegseth Orders Generals, Admirals Worldwide to Attend Meeting Next Week",
    "description": "Do we need to stock up on toilet paper?\nThe post Hegseth Orders Generals, Admirals Worldwide to Attend Meeting Next Week first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/hegseth-orders-generals-admirals-worldwide-to-attend-meeting-next-week/",
    "timestamp": "2025-09-25T21:00:11Z"
  },
  {
    "title": "Did Apple Do the Right Thing?",
    "description": "Earlier this week, Apple TV+ delayed a Jessica Chastain–led thriller series ‘The Savant,’ about a woman who hunts white supremacists online. The choice only raises questions.",
    "link": "http://www.vulture.com/article/apple-tv-plus-delaying-the-savant-questions.html",
    "timestamp": "2025-09-25T21:00:04Z"
  },
  {
    "title": "Cocaine Boom Pushes U.S.-Colombia Ties to Breaking Point Under Trump",
    "description": "In a shock development, U.S. President Donald Trump decertified Colombia as a partner in the decades-long drug war for the first time since 1997. This is a monumental blow for the historically close relationship between Colombia and the United States. The Whi…",
    "link": "https://oilprice.com/Geopolitics/South-America/Cocaine-Boom-Pushes-US-Colombia-Ties-to-Breaking-Point-Under-Trump.html",
    "timestamp": "2025-09-25T21:00:00Z"
  },
  {
    "title": "Congressional Black Caucus in discussions with Republicans on amending SCORE Act",
    "description": "The Congressional Black Caucus has reached an agreement with Republicans on amending portions of the SCORE Act — a “good sign” that may accelerate the once-stalled bill.",
    "link": "https://sports.yahoo.com/college-football/article/congressional-black-caucus-in-discussions-with-republicans-on-amending-score-act-205925338.html",
    "timestamp": "2025-09-25T20:59:25Z"
  },
  {
    "title": "McIlroy paired with Tommy Fleetwood as Ryder Cup opening foursome pairings announced",
    "description": "Shane Lowry has been omitted while Jon Rahm is paired with Tyrrell Hatton and Robert MacIntyre will play with Viktor Hovland.",
    "link": "https://www.the42.ie/ryder-cup-pairings-6827355-Sep2025/",
    "timestamp": "2025-09-25T20:58:13Z"
  },
  {
    "title": "Trump order helps TikTok sell US operations to American investors in $14 billion deal",
    "description": "White House officials said earlier this week that TikTok reached a preliminary deal to sell its U.S. operations to an American-based investor group.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/25/donald-trump-tiktok-china-sale-united-states/86353645007/",
    "timestamp": "2025-09-25T20:58:10Z"
  },
  {
    "title": "Trump signs order to facilitate TikTok sale to US buyers",
    "description": "Washington has been pushing to wrest control of the popular platform from Chinese ownership amid security concerns. Trump claims that Chinese leader Xi Jinping has approved the plan, but Beijing has not yet commented.",
    "link": "https://www.dw.com/en/trump-signs-order-to-facilitate-tiktok-sale-to-us-buyers/a-74141337",
    "timestamp": "2025-09-25T20:58:00Z"
  }
]