[
  {
    "title": "China markets' bright mood tested as Trump targets tech, shipping",
    "description": "HONG KONG -- The recent upbeat mood in the Chinese stock markets faces a durability test as U.S. President Donald Trump squeezes pressure points besides tariffs -- including technology investments and shipping.\nHong Kong's benchmark Hang Seng index opened Tue…",
    "link": "https://biztoc.com/x/556a0ec7a8173be9",
    "timestamp": "2025-02-25T05:38:29Z"
  },
  {
    "title": "China Likely To Remove Ban On Korean Dramas, Movies & K-Pop As Early As May",
    "description": "We’ve heard this before, and nothing came to pass, but the signs are looking positive that mainland China is finally removing its unofficial ban on Korean culture and content, possibly as early as this May.  The loosening of restrictions appears to signal Chi…",
    "link": "http://deadline.com/2025/02/china-ban-korean-movies-dramas-k-pop-hybe-studio-dragon-1236300856/",
    "timestamp": "2025-02-25T05:37:32Z"
  },
  {
    "title": "Anti-US sentiment bubbling up in the West Bank bolsters demand for a local Coke-alternative",
    "description": "The caramel brown liquid, red-and-white soda cans and splashy big font bear remarkable resemblance to an iconic American soft drink. But this popular drink is Chat Cola, an upstart Palestinian soda company, which has seen its products explode in popularity ac…",
    "link": "https://www.seattlepi.com/news/world/article/anti-us-sentiment-bubbling-up-in-the-west-bank-20186204.php",
    "timestamp": "2025-02-25T05:35:18Z"
  },
  {
    "title": "Tesla rolls out advanced self-driving functions in China",
    "description": "US electric vehicle giant Tesla has started offering advanced self-driving functions for its cars in China, including autopilot on city streets, the company announced on Tuesday. Tesla said in a statement on its WeChat page on Tuesday that it would gradually …",
    "link": "https://economictimes.indiatimes.com/news/international/business/tesla-rolls-out-advanced-self-driving-functions-in-china/articleshow/118547550.cms",
    "timestamp": "2025-02-25T05:32:20Z"
  },
  {
    "title": "‘Don’t See Any Constitutional Issues’: Dershowitz Defends Presidential Authority Amid Massive Employment Fraud Lawsuit",
    "description": "Attorney Alan Dershowitz said Monday on Newsmax that the president holds the ultimate authority to dictate employment within the federal government.",
    "link": "https://dailycaller.com/2025/02/25/alan-dershowitz-federal-lawsuit-employees/",
    "timestamp": "2025-02-25T05:28:23Z"
  },
  {
    "title": "Tesla rolls out advanced self-driving functions in China",
    "description": "US electric vehicle giant Tesla has started offering advanced self-driving functions for its cars in China, including autopilot on city streets, the company announced on Tuesday. The announcement comes after years of attempts to overcome regulatory hurdles bl…",
    "link": "https://www.digitaljournal.com/world/tesla-rolls-out-advanced-self-driving-functions-in-china/article",
    "timestamp": "2025-02-25T05:27:32Z"
  },
  {
    "title": "Macron and Trump rekindle Le Bromance with a touch of tension",
    "description": "Strains over Trump's sudden pivot to Russia over the Ukraine war bubbled up to the surface, even if Macron softened the blow with yet another physical gesture.",
    "link": "https://www.japantimes.co.jp/news/2025/02/25/world/politics/macron-trump-bromance-tension/",
    "timestamp": "2025-02-25T05:26:00Z"
  },
  {
    "title": "Long Live the real King: Is video of Donald Trump kissing Elon Musk's feet real?",
    "description": "An AI-generated video featuring Donald Trump and Elon Musk in a bizarre display was broadcast on loop across monitors at the US Department of Housing and Urban Development (HUD). The footage, accompanied by the message “Long Live the Real King,” caused confus…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/long-live-the-real-king-is-video-of-donald-trump-kissing-elon-musks-feet-real/articleshow/118546612.cms",
    "timestamp": "2025-02-25T05:25:25Z"
  },
  {
    "title": "Vivek Ramaswamy on track to become third US governor of Indian origin",
    "description": "Vivek Ramaswamy, endorsed by Donald Trump and Elon Musk, enters the Ohio gubernatorial race. Ramaswamy promises voters tax abolishments and critiques American culture's mediocrity. He aims to become the third Indian-origin governor in the US, following predec…",
    "link": "https://timesofindia.indiatimes.com/world/us/vivek-ramaswamy-on-track-to-become-third-us-governor-of-indian-origin/articleshow/118547051.cms",
    "timestamp": "2025-02-25T05:17:58Z"
  },
  {
    "title": "What the U.K. Wants from Apple Will Make Our Phones Less Safe",
    "description": "Once a back door to user data exists, everyone will want in.",
    "link": "https://foreignpolicy.com/2025/02/25/apple-united-kingdom-adp-back-door-less-safe/",
    "timestamp": "2025-02-25T05:17:58Z"
  },
  {
    "title": "What to know about air traffic control towers after a midair collision in Arizona prompts questions",
    "description": "Tens of thousands of planes take off, land and perform touch-and-goes at the Marana Regional Airport in southern Arizona every year. Without an air traffic control tower, it’s a calculated dance that requires communication by pilots. Two small planes collided…",
    "link": "https://financialpost.com/pmn/what-to-know-about-air-traffic-control-towers-after-a-midair-collision-in-arizona-prompts-questions",
    "timestamp": "2025-02-25T05:14:22Z"
  },
  {
    "title": "Palestinians struggle to restart their lives in the ruins of Gaza",
    "description": "Living inside the ruins of their home, Rawya Tamboura’s young sons get afraid of the dark, so she turns on a flashlight and her phone’s light to comfort them...",
    "link": "https://www.yahoo.com/news/palestinians-struggle-restart-lives-ruins-051308145.html",
    "timestamp": "2025-02-25T05:13:08Z"
  },
  {
    "title": "A Palestinian-Israeli Film is an Oscars Favorite – So why is it so Hard to See?",
    "description": "Drew Paul, University of Tennessee (The Conversation) - For many low-budget, independent films, an Oscar nomination is a golden ticket. The publicity can translate into theatrical releases or rereleases, along with more on-demand rentals and sales. However, f…",
    "link": "https://www.juancole.com/2025/02/palestinian-israeli-favorite.html",
    "timestamp": "2025-02-25T05:06:42Z"
  },
  {
    "title": "The Distraction of Mexico’s 10,000 Troops",
    "description": "The Mexican president must disband her country’s network of NGOs that bring millions of illegals to the U.S. border. \nThe post The Distraction of Mexico’s 10,000 Troops appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-distraction-of-mexicos-10000-troops/",
    "timestamp": "2025-02-25T05:05:00Z"
  },
  {
    "title": "A New Approach to DC Statehood",
    "description": "Instead of pursuing the unachievable, why not become Macao?\nThe post A New Approach to DC Statehood appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/a-new-approach-to-dc-statehood/",
    "timestamp": "2025-02-25T05:01:00Z"
  },
  {
    "title": "President Trump Wants To Cut the Pentagon Budget in Half. How?",
    "description": "Reprinted with permission from The Kucinich Report. It is Presidents’ Day, and President Donald Trump has made a bold statement regarding military spending – one that no other president in modern history has made. He claims he could cut the Pentagon budget by…",
    "link": "https://original.antiwar.com/kucinich/2025/02/24/president-trump-wants-to-cut-the-pentagon-budget-in-half-how/",
    "timestamp": "2025-02-25T05:00:49Z"
  },
  {
    "title": "Trump's Cabinet members have already backtracked on some promises made before being confirmed",
    "description": "As they mustered support for their confirmations by the U.S. Senate, some of Donald Trump’s nominees made statements from which they’ve already distanced themselves upon taking office.",
    "link": "https://www.ksat.com/news/politics/2025/02/24/trumps-cabinet-members-have-already-backtracked-on-some-promises-made-before-being-confirmed/",
    "timestamp": "2025-02-25T05:00:48Z"
  },
  {
    "title": "Ageing Brazilian president Lula irritable and isolated, but not easily replaced",
    "description": "With an approval rating of just 24%, the erstwhile trade union boss has never been as unpopular",
    "link": "https://www.irishtimes.com/world/americas/2025/02/25/lula-is-old-irritable-and-isolated-but-not-easily-replaced/",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Musk Says Federal Workers Who Didn’t Respond to Email About Job Will Be Given ‘Another Chance’ Before Being Fired",
    "description": "The request for employees to outline their job accomplishments has been met with pushback from departments and agencies.",
    "link": "https://time.com/7261317/musk-email-federal-workers-job-accomplishments-ultimatum-fired-departments-agencies/",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Panic in Panem",
    "description": "All through the 2024 presidential campaign, some pundits, more on the right than the left, would report what the betting markets were saying. I believe betting markets have gradually been shown to actually be at least as accurate as most polling comp...",
    "link": "https://www.americanthinker.com/blog/2025/02/panic_in_panem.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Susan Rice misleads Americans again",
    "description": "Susan Rice was the UN Ambassador and behind the scenes Democrat/socialist/communist (D/s/c) whisperer who blatantly lied about the Benghazi attack. She claimed the murder of multiple Americans was just a protest over a video that got out of hand. Ric...",
    "link": "https://www.americanthinker.com/blog/2025/02/susan_rice_misleads_americans_again.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Yosemite: the public isn't going to like that Mr. Ranger",
    "description": "Yosemite National Park is roughly in the middle of California near its eastern border, closer to Nevada than it is to San Francisco. It’s one of America’s many natural wonders, lovingly and iconically photographed by Ansel Adams.\r\n\r\nYosem...",
    "link": "https://www.americanthinker.com/blog/2025/02/yosemite_the_public_isn_t_going_to_like_that_mr_ranger.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Hollywood, Donald Trump doesn't make you stink",
    "description": "From what I can see out here in Flyover Country, not many Americans are terribly interested in Hollywood’s latest fare. Tom Cruise’s latest Mission Impossible offering wasn’t up to its preceding chapters. The Star War...",
    "link": "https://www.americanthinker.com/blog/2025/02/hollywood_donald_trump_doesn_t_make_you_stink.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Far-Right Menace: The End of the World as They Know It",
    "description": "With the notorious “far-right” Alternative für Deutschland winning 20.7 percent of the vote in the German elections -- up from 10.4 percent in 2021 -- and becoming the number two party, it is clearly the end of the world as we know i...",
    "link": "https://www.americanthinker.com/articles/2025/02/far_right_menace_the_end_of_the_world_as_they_know_it.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Shepherds of the Church: Why the Double Standard?",
    "description": "Within days of Donald Trump’s November landslide, Bishop Mark Seitz, head of the United States Conference of Catholic Bishops’ migration committee, warned that Their Eminences were preparing to “’raise our voice loudly’&...",
    "link": "https://www.americanthinker.com/articles/2025/02/shepherds_of_the_church_why_the_double_standard.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Trump is sick of government patronage",
    "description": "The Democrat party was deaf to the plight of the Keystone Pipeline cancelation and the estimated elimination of between 16,000 and 59,000 jobs.  But now they are losing their minds over the proposed job cuts that Elon Musk and Cab...",
    "link": "https://www.americanthinker.com/blog/2025/02/trump_is_sick_of_government_patronage.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "A lesson in great power politics",
    "description": "I want to transport the reader back to a different place and time. It’s the early 1960s and the darling of Western intelligentsia, Fidel Castro, has recently taken power in a Marxist revolution in Cuba. Many see him as just another garden varie...",
    "link": "https://www.americanthinker.com/blog/2025/02/a_lesson_in_great_power_politics.html",
    "timestamp": "2025-02-25T05:00:00Z"
  },
  {
    "title": "Americans To Get Part Of DOGE Savings? This Amount May Go Up To...",
    "description": "US President Donald Trump and his billionaire adviser Elon Musk are going all out with their cost-cutting and fraud-finding efforts under the so-called Department of Government Efficiency (DOGE).",
    "link": "https://www.ndtv.com/world-news/americans-to-get-part-of-doge-savings-this-amount-may-go-up-to-7788991",
    "timestamp": "2025-02-25T04:54:16Z"
  },
  {
    "title": "A profile of Dan Bongino, Trump's FBI deputy director pick and an ex-Fox News host who rose from online conspiracy circles to become a top right-wing podcaster (David Gilbert/Wired)",
    "description": "David Gilbert / Wired:\nA profile of Dan Bongino, Trump's FBI deputy director pick and an ex-Fox News host who rose from online conspiracy circles to become a top right-wing podcaster  —  Dan Bongino rose through the ranks of right-wing media thanks to his unf…",
    "link": "https://mediagazer.com/250224/p13",
    "timestamp": "2025-02-25T04:50:00Z"
  },
  {
    "title": "Lawrence: Trump humiliated on the world stage as France's Macron instantly corrects his Ukraine lie",
    "description": "MSNBC’s Lawrence O’Donnell details how French President Macron humiliated Donald Trump after the United States, for the first time in history, “voted with the dictator against freedom” when it stood with Vladimir Putin in opposing a UN resolution condemning R…",
    "link": "https://www.msnbc.com/the-last-word/watch/lawrence-trump-humiliated-on-the-world-stage-as-france-s-macron-instantly-corrects-his-ukraine-lie-232834629536",
    "timestamp": "2025-02-25T04:47:23Z"
  },
  {
    "title": "India Market Buzz: Tesla’s India Entry May Not Dent Local Firms, Analysts Say",
    "description": "Before the trading day starts we bring you a digest of the key news and events that are likely to move markets. Today we look at:",
    "link": "https://financialpost.com/pmn/business-pmn/india-market-buzz-teslas-india-entry-may-not-dent-local-firms-analysts-say",
    "timestamp": "2025-02-25T04:39:22Z"
  },
  {
    "title": "Macron gets platitudes but nothing concrete from Trump",
    "description": "The American didn't call Volodymyr Zelenskyy a \"dictator\" during Macron's lightning visit to Washington on Monday — but he also refused to call Vladimir Putin one.",
    "link": "https://www.politico.eu/article/emmanuel-macron-donald-trump-meeting-ukraine-russia-vladimir-putin-volodymyr-zelenskyy/",
    "timestamp": "2025-02-25T04:36:30Z"
  },
  {
    "title": "Republican Congressman Says He Wants Change to Medicaid",
    "description": "Opinion polls suggest that potential cuts to programs like Medicaid and Medicare are deeply unpopular.",
    "link": "https://www.newsweek.com/republican-congressman-says-he-wants-change-medicaid-2035653",
    "timestamp": "2025-02-25T04:31:56Z"
  },
  {
    "title": "Putin says Europe is needed in Ukraine talks, but hints deal is distant",
    "description": "Russian President Vladimir Putin says that Europe's participation in Ukraine peace talks is needed, but Moscow's priority is building trust with Washington.",
    "link": "https://www.cnbc.com/2025/02/25/putin-says-europe-is-needed-in-ukraine-talks-but-hints-deal-is-distant.html",
    "timestamp": "2025-02-25T04:28:10Z"
  },
  {
    "title": "Trump dominates Liberal leadership debate in Canada",
    "description": "The debate is the first of two in the race to replace Prime Minister Justin Trudeau as Liberal Party leader.",
    "link": "https://www.bbc.com/news/articles/c2kgxk9eqk1o",
    "timestamp": "2025-02-25T04:25:40Z"
  },
  {
    "title": "The gold price has surged to record highs. What’s behind the move?",
    "description": "Gold is considered a safe haven in times of economic turmoil. That’s just one of the reasons it is rallying to new highs.",
    "link": "https://theconversation.com/the-gold-price-has-surged-to-record-highs-whats-behind-the-move-250391",
    "timestamp": "2025-02-25T04:23:58Z"
  },
  {
    "title": "Trump endorses Ramaswamy for Ohio governor",
    "description": "United States President Donald Trump took to Truth Social to offer his \"complete and total\" endorsement of Vivek Ramaswamy as the governor of Ohio, shortly after the former presidential hope...",
    "link": "https://biztoc.com/x/86f9a7414997a3fc",
    "timestamp": "2025-02-25T04:21:18Z"
  },
  {
    "title": "Ukraine marks Russia invasion anniversary amid talk US minerals deal is close",
    "description": "KYIV (Reuters) -Ukraine hosted European leaders on Monday to mark three years of all-out war with Russia since Moscow's invasion, while top U.S. officials stayed away in a clear illustration of President Donald Trump's lurch towards Moscow since returning to …",
    "link": "https://www.thestar.com.my/news/world/2025/02/25/ukraine-marks-russia-invasion-anniversary-amid-talk-us-minerals-deal-is-close",
    "timestamp": "2025-02-25T04:19:00Z"
  },
  {
    "title": "Trump imposes sanctions affecting Iranian trade for 'maximum pressure campaign'",
    "description": "The sanctions were being done to \"stem the flow of revenue the regime uses to fund destabilizing activities.\"",
    "link": "https://www.jpost.com/middle-east/article-843619",
    "timestamp": "2025-02-25T04:18:15Z"
  },
  {
    "title": "Musk renews firing threat after being stymied by federal officials",
    "description": "WASHINGTON (Reuters) - Elon Musk, President Donald Trump's point person to root out what he says is government waste, on Monday renewed his threat to fire federal workers who do not comply with his demand to justify their jobs, even after the Trump administra…",
    "link": "https://www.thestar.com.my/news/world/2025/02/25/musk-renews-firing-threat-after-being-stymied-by-federal-officials",
    "timestamp": "2025-02-25T04:18:00Z"
  },
  {
    "title": "Not H-1B visa issues or Donald Trump or layoff. Why this Indian professional left the US spending 10 years in America",
    "description": "Aniruddha Anjana returned to India after a decade in the U.S. to be with his aging parents, driven by deep personal reasons. His decision, aimed at prioritizing family over professional success, resonated with many and sparked thoughtful reactions online.",
    "link": "https://economictimes.indiatimes.com/magazines/panache/not-h-1b-visa-issues-or-donald-trump-or-layoff-why-this-indian-professional-left-the-us-spending-10-years-in-america/articleshow/118545664.cms",
    "timestamp": "2025-02-25T04:16:36Z"
  },
  {
    "title": "Joy Reid, Who Ridiculed White People’s Tears, Breaks Down Over Show Cancellation",
    "description": "Joy Reid faced an emotional moment after her show was finally canceled following months of disappointing ratings. Despite having previously mocked white people's tears in a viral segment, Reid couldn't contain her own liberal tears as she confronted the end o…",
    "link": "https://freerepublic.com/focus/f-news/4300276/posts",
    "timestamp": "2025-02-25T04:16:21Z"
  },
  {
    "title": "‘Rational’ Trump, ‘toxic’ Zelensky, and ‘shackled’ EU: key points from latest Putin interview",
    "description": "Russian President Vladimir Putin shared his perspective on the policies of his US counterpart, Donald Trump, and the future of Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613259-putin-interview-trump-zelensky/",
    "timestamp": "2025-02-25T04:11:43Z"
  },
  {
    "title": "Sensex gains over 250 points, defying global trends; Nifty back above 22,600",
    "description": "Indian stock indices Sensex and Nifty rose despite negative global cues, supported by gains in ICICI Bank, M&M, and Zomato. Asian markets fell due to concerns about US tariffs on Chinese investments. FIIs continued selling Indian equities, while DIIs kept buy…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-gains-over-150-points-defying-global-trends-nifty-back-above-22550/articleshow/118545201.cms",
    "timestamp": "2025-02-25T04:07:06Z"
  },
  {
    "title": "B.C. Opposition leader wants to hit U.S. with 'carbon tax' on coal shipments",
    "description": "British Columbia Opposition Leader John Rustad has found a carbon tax he likes, proposing such a levy on U.S. thermal coal shipped out of provincial ports as a way to pressure the White House not to impose fresh tariffs on Canadian softwood lumber.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/john-rustad-carbon-tax-coal-shipments-1.7467534",
    "timestamp": "2025-02-25T04:06:16Z"
  },
  {
    "title": "Liberal leadership debate kicks off with questions about threat posed by Trump",
    "description": "MONTREAL — He wasn't on the stage but U.S. President Donald Trump's shadow towered over the Liberal leadership race during Monday night's French-language debate.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_97a912db-bb94-4795-9120-55dc0d65b6a9",
    "timestamp": "2025-02-25T04:03:02Z"
  },
  {
    "title": "You Don’t Actually Need To Pick a Team",
    "description": "You don’t have to pick a team. You don’t have to side with Democrats because Trump is bad. You don’t have to side with Trump because Democrats are bad. You don’t have to give Trump “credit” for anything. You don’t have to give Trump the benefit of the doubt. …",
    "link": "https://www.lewrockwell.com/2025/02/no_author/you-dont-actually-need-to-pick-a-team/",
    "timestamp": "2025-02-25T04:01:00Z"
  },
  {
    "title": "Down the Toobin",
    "description": "Ah, the beauty of language! The English one is as rich as they come, with words such as “osculation,” “verbigeration,” “concupiscence,” “mithridatism,” and “onomatopoeia.” I could go on forever. The latest to be added to an already bulging dictionary is “Toob…",
    "link": "https://www.lewrockwell.com/2025/02/taki-theodoracopulos/down-the-toobin/",
    "timestamp": "2025-02-25T04:01:00Z"
  },
  {
    "title": "The Federal Reserve Killed the Penny. Is MAGA Next?",
    "description": "President Trump recently issued an executive order instructing the US Mint to stop producing pennies. The reason for this is it costs nearly four cents to produce one penny. That’s right: the US government can’t even make pennies without losing money! Preside…",
    "link": "https://www.lewrockwell.com/2025/02/ron-paul/the-federal-reserve-killed-the-penny-is-maga-next/",
    "timestamp": "2025-02-25T04:01:00Z"
  },
  {
    "title": "Elon Musk Threatens To Fire Federal Workers Who Don't Reply To Next Email",
    "description": "Elon Musk said that federal workers will be given a second opportunity to respond to a government-wide email detailing what they did last week, and threatened to fire any employee who doesn&#039;t meet his demands.",
    "link": "https://www.ndtv.com/world-news/elon-musk-threatens-to-fire-federal-workers-who-dont-reply-to-next-email-7788695",
    "timestamp": "2025-02-25T04:00:30Z"
  },
  {
    "title": "Vivek Ramaswamy 'excited to lead the charge' in Ohio as he announces 2026 bid for governor",
    "description": "Former GOP presidential candidate Vivek Ramaswamy shares his vision for Ohio after announcing a gubernatorial bid on 'Hannity.'",
    "link": "https://www.foxnews.com/media/vivek-ramaswamy-excited-lead-charge-ohio-he-announces-2026-bid-governor",
    "timestamp": "2025-02-25T03:59:51Z"
  },
  {
    "title": "Factbox-What Vietnam is considering to avoid US tariffs",
    "description": "U.S. President Donald Trump has announced plans for tariffs that could virtually hit all Vietnam's goods exports to its top market, worth last year more than $142 billion, according to UN data, about 30% of Vietnam's gross domestic product. As the Southeast A…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_84913b66-af10-4184-9b6b-ed684b83bfc3",
    "timestamp": "2025-02-25T03:58:01Z"
  },
  {
    "title": "Trump Endorses Vivek Ramaswamy for Ohio Governor",
    "description": "President Donald Trump endorsed Vivek Ramaswamy in his bid for Ohio governor on Monday, hailing him as a \"truly good person who truly loves our country.\"\nThe post Trump Endorses Vivek Ramaswamy for Ohio Governor appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/24/trump-endorses-vivek-ramaswamy-ohio-governor/",
    "timestamp": "2025-02-25T03:56:27Z"
  },
  {
    "title": "Sam Bankman-Fried Breaks Silence on Twitter, Rants About US Government Layoffs",
    "description": "His Monday evening posts have sparked curiosity among crypto industry insiders who have closely followed him since FTX’s notorious collapse.",
    "link": "https://decrypt.co/307577/sam-bankman-fried-breaks-silence-on-twitter",
    "timestamp": "2025-02-25T03:55:18Z"
  },
  {
    "title": "Trump, Macron strike optimistic tone on Ukraine after talks",
    "description": "Donald Trump and Emmanuel Macron expressed hope that peace could be achieved in Ukraine. But questions remain at what cost, as the French President said that any agreement cannot amount to \"the surrender of Ukraine.\"",
    "link": "https://www.dw.com/en/trump-macron-strike-optimistic-tone-on-ukraine-after-talks/a-71736924",
    "timestamp": "2025-02-25T03:53:00Z"
  },
  {
    "title": "Confusion over Musk demand that federal workers justify their jobs",
    "description": "Employees get conflicting advice over compliance with a Musk-backed order to list their last week's work or face termination.",
    "link": "https://www.bbc.com/news/articles/clyz2xk7d9xo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-25T03:50:56Z"
  },
  {
    "title": "Stupid Musk tricks",
    "description": "One of the enduring right wing myths is that if only the government was run like a business, then everything would be fine. Not just any kind of business but a sole proprietorship where one person has the ability to make all the decisions. They think that if …",
    "link": "https://freethoughtblogs.com/singham/2025/02/24/stupid-musk-tricks/",
    "timestamp": "2025-02-25T03:50:33Z"
  },
  {
    "title": "Metals Decline as Rising China Tensions Spark Risk-Off Sentiment",
    "description": "Metals including aluminum and copper declined as moves by US President Donald Trump to restrict Chinese investments undermined market sentiment, with raw materials losing ground along with local equities.",
    "link": "https://financialpost.com/pmn/business-pmn/metals-decline-as-rising-china-tensions-spark-risk-off-sentiment",
    "timestamp": "2025-02-25T03:48:33Z"
  },
  {
    "title": "John Bolton Says Trump’s Brain Is Cooked: ‘His Mind Is Full of Mush’",
    "description": "John Bolton, a former National Security Advisor in President Donald Trump's first term, said his ex-boss is cognitively damaged.\nThe post John Bolton Says Trump’s Brain Is Cooked: ‘His Mind Is Full of Mush’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/john-bolton-says-trumps-brain-is-cooked-his-mind-is-full-of-mush/",
    "timestamp": "2025-02-25T03:47:21Z"
  },
  {
    "title": "Vladimir Putin says Europe is needed in Ukraine talks, but suggests deal still distant",
    "description": "Russian President Vladimir Putin suggests building trust with the U.S. is crucial before bringing European countries into Ukraine peace talks. While President Trump indicates the conflict might end soon, Putin remains non-committal, emphasizing initial discus…",
    "link": "https://economictimes.indiatimes.com/news/defence/vladimir-putin-says-europe-is-needed-in-ukraine-talks-but-suggests-deal-still-distant/articleshow/118545348.cms",
    "timestamp": "2025-02-25T03:46:58Z"
  },
  {
    "title": "Macron Fact-Checks Trump On Ukraine Aid At Press Conference, He Reacts",
    "description": "During a joint press conference, Emmanuel Macron interrupted Donald Trump when he claimed that Europe was merely loaning Ukraine money and would get it back.",
    "link": "https://www.ndtv.com/world-news/frances-emmanuel-macron-fact-checks-donald-trump-on-ukraine-aid-at-press-conference-he-reacts-7788604",
    "timestamp": "2025-02-25T03:46:55Z"
  },
  {
    "title": "Justin Trudeau trolled by Donald Trump as he and other world leaders show support for Ukraine",
    "description": "OTTAWA—As Prime Minister Justin Trudeau and other world leaders declared solidarity with Ukraine on the third anniversary of Russia’s full-scale invasion, U.S. President Donald Trump doubled down on plans to work with Russia to end the gruelling war and “reco…",
    "link": "https://freerepublic.com/focus/f-news/4300269/posts",
    "timestamp": "2025-02-25T03:43:37Z"
  },
  {
    "title": "‘Your President Is Right’: Macron Says He’ll Boost Defense Spending At Trump’s Request",
    "description": "French President Emmanuel Macron confirmed he plans to increase the country's defense spending as a NATO member, acknowledging that Trump's request was correct.",
    "link": "https://dailycaller.com/2025/02/24/emmanuel-macron-defense-spending-donald-trump-nato/",
    "timestamp": "2025-02-25T03:43:31Z"
  },
  {
    "title": "Crypto trading booms in India's interiors as job growth and incomes disappoint",
    "description": "Thousands of Indians like Ashish Nagose are diving into cryptocurrency trading amid government restrictions on equity derivatives. Their interest has doubled trading volumes on major exchanges to $1.9 billion in Q4 2024. Often driven by a need to supplement t…",
    "link": "https://economictimes.indiatimes.com/news/india/crypto-trading-booms-in-indias-interiors-as-job-growth-and-incomes-disappoint/articleshow/118545275.cms",
    "timestamp": "2025-02-25T03:41:28Z"
  },
  {
    "title": "GOP lawmaker blames town hall outburst on 'outside agitators' who 'wanted to do me harm'",
    "description": "Ever since centibillionaire Elon Musk was tasked by President Donald Trump to identify wasteful spending in federal agencies, the tech entrepreneur and his team have been busy making sweeping cuts throughout multiple federal agencies — including money already…",
    "link": "https://www.rawstory.com/mark-allford/",
    "timestamp": "2025-02-25T03:40:02Z"
  },
  {
    "title": "Carney, Freeland Jockey in Debate Over Who Can Be Toughest Opponent to Trump",
    "description": "Mark Carney, the front-runner in the race to become Canada’s next prime minister, squared off for the first time with his main rival Chrystia Freeland in a French-language TV debate that focused on how to handle President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-freeland-jockey-in-debate-over-who-can-be-toughest-opponent-to-trump",
    "timestamp": "2025-02-25T03:38:23Z"
  },
  {
    "title": "FTT Briefly Spikes After Sam Bankman-Fried Tweets for First Time in 2 Years",
    "description": "Bankman-Fried is currently in the Metropolitan Detention Center, serving a 25-year prison sentence.",
    "link": "https://www.coindesk.com/policy/2025/02/24/ftt-briefly-spikes-after-sam-bankman-fried-tweets-for-first-time-in-2-years",
    "timestamp": "2025-02-25T03:38:05Z"
  },
  {
    "title": "Fmr. Obama ICE Director: Trump 'Created Additional Deterrence', Sent Message 'There's No More Crossing the Border'",
    "description": "On Monday’s broadcast of “NewsNation Now,” John Sandweg, who served as acting ICE Director under President Obama, stated that President Donald Trump’s election “has created additional deterrence at the border and the executive actions he signed sent a message…",
    "link": "https://www.breitbart.com/clips/2025/02/24/fmr-obama-ice-director-trump-created-additional-deterrence-sent-message-theres-no-more-crossing-the-border/",
    "timestamp": "2025-02-25T03:33:44Z"
  },
  {
    "title": "Trump, Musk endorse Vivek Ramaswamy for Ohio governor",
    "description": "President Donald Trump and billionaire Elon Musk on Monday separately endorsed entrepreneur Vivek Ramaswamy in Ohio's 2026 gubernatorial race.",
    "link": "https://www.foxnews.com/politics/trump-musk-endorse-vivek-ramaswamy-ohio-governor",
    "timestamp": "2025-02-25T03:31:06Z"
  },
  {
    "title": "Republican Lawmaker Tells Trump He May Vote Against GOP Budget Bill Over Medicaid Cuts",
    "description": "Rep. Jeff Van Drew said the President “understood” his concerns, which are also shared by a number of other Republicans.",
    "link": "https://time.com/7261307/jeff-van-drew-trump-republican-budget-bill-medicaid-cuts-concerns/",
    "timestamp": "2025-02-25T03:30:00Z"
  },
  {
    "title": "ETMarkets Smart Talk: Gold defies trends by rising alongside dollar: What's driving this anomaly?",
    "description": "Higher interest rates to tame inflation and slowing global economy contributed to some slowdown in our economy. The story of earnings downgrade and hence valuations being expensive were to be followed.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-gold-defies-trends-by-rising-alongside-dollar-whats-driving-this-anomaly/articleshow/118525520.cms",
    "timestamp": "2025-02-25T03:30:00Z"
  },
  {
    "title": "Kentucky flooding and cold weather death toll rises to 22; FEMA to tour damage",
    "description": "Meanwhile, Kentucky, Gov. Andy Beshear said that state officials are still waiting for approval of an expedited major disaster declaration.",
    "link": "https://www.usatoday.com/story/news/nation/2025/02/24/kentucky-flooding-weather-death-toll-fema/80097222007/",
    "timestamp": "2025-02-25T03:29:54Z"
  },
  {
    "title": "DOGE's productivity email deadline for federal workers looms, with differing guidance",
    "description": "\"Subject to the discretion of the President, they will be given another chance,\" Elon Musk said of federal workers who did not send in their emails.",
    "link": "https://www.businessinsider.com/doge-productivity-email-deadline-looms-with-differing-guidance-2025-2",
    "timestamp": "2025-02-25T03:28:09Z"
  },
  {
    "title": "Rudy Giuliani satisfies Fulton County election workers' $148 million defamation case",
    "description": "Former New York City mayor Rudy Giuliani was found liable for defamation in 2023 and ordered to pay two election workers $148 million -- which has now been satisfied.",
    "link": "https://abcnews.go.com/US/rudy-giuliani-pays-148-million-fulton-county-election/story?id=119151328",
    "timestamp": "2025-02-25T03:26:49Z"
  },
  {
    "title": "Trump admin allegedly considering eliminating US Africa Command",
    "description": "United States President Donald Trump's administration is supposedly thinking about eliminating the US Africa Command (AFRICOM) as part of a downsizing of the Pentagon, NBC News reported, citing tw...",
    "link": "https://biztoc.com/x/b27daf5776e5da19",
    "timestamp": "2025-02-25T03:26:31Z"
  },
  {
    "title": "Crypto firm pleads guilty to operating illegally in US",
    "description": "Financial firms, including crypto currency exchanges, that operate in the United States are required to register with federal regulators as a money transmitting business in order to comply with anti-money laundering laws.",
    "link": "https://economictimes.indiatimes.com/tech/technology/crypto-firm-pleads-guilty-to-operating-illegally-in-us/articleshow/118545070.cms",
    "timestamp": "2025-02-25T03:22:00Z"
  },
  {
    "title": "‘Most Atrocious Abuses Of The System’: Democratic Strategist Breaks Down Party’s Failures",
    "description": "Julian Epstein discussed Monday on Fox Business discussed the issues within the Democratic Party, pointing out what he perceives as its systemic failures.",
    "link": "https://dailycaller.com/2025/02/24/julian-epstein-dems-failures/",
    "timestamp": "2025-02-25T03:16:16Z"
  },
  {
    "title": "Scientists find clues on why COVID vaccine causes chronic health problems in some - NewsBreak",
    "description": "Yale researchers have found clues as to why certain people experience adverse health effects after the COVID-19 vaccine, which they have dubbed “post-vacci",
    "link": "https://www.newsbreak.com/share/3827656864106-scientists-find-clues-on-why-covid-vaccine-causes-chronic-health-problems-in-some?_f=app_share&amp;pd=0DzKWhMe&amp;lang=en_US&amp;send_time=1740453186&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v6&amp;s=i2",
    "timestamp": "2025-02-25T03:13:40Z"
  },
  {
    "title": "Trump wants Keystone XL pipeline built 'now'",
    "description": "U.S. President Donald Trump said he wants to revive the Keystone XL oil pipeline, even though its developer has walked away. Read more.",
    "link": "https://financialpost.com/commodities/energy/oil-gas/trump-canada-us-keystone-xl-oil-pipeline-built",
    "timestamp": "2025-02-25T03:12:53Z"
  },
  {
    "title": "Trump Wants Canada-to-US Keystone XL Oil Pipeline Built ‘Now’",
    "description": "US President Donald Trump said Monday he wanted to revive the Keystone XL oil pipeline, even though its developer has already walked away from the project.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-wants-canada-to-us-keystone-xl-oil-pipeline-built-now",
    "timestamp": "2025-02-25T03:12:53Z"
  },
  {
    "title": "Trump calls for company building Keystone XL Pipeline to return to America and ‘get it built’",
    "description": "President Donald Trump is working to restore the Keystone XL Pipeline construction project and asking the company who was initially tasked to build it to come back and resume operations.",
    "link": "https://www.foxnews.com/politics/trump-calls-company-building-keystone-xl-pipeline-return-america-get-built",
    "timestamp": "2025-02-25T03:08:54Z"
  },
  {
    "title": "Judge Denies Associated Press Emergency Motion to Restore White House Access",
    "description": "A federal judge Monday denied an emergency motion from the Associated Press (AP) to restore its access to White House press pool events.\nThe post Judge Denies Associated Press Emergency Motion to Restore White House Access appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/24/judge-denies-associated-press-emergency-motion-restore-white-house-access/",
    "timestamp": "2025-02-25T03:08:22Z"
  },
  {
    "title": "U.S. defense spending demands could transform global security",
    "description": "The level of spending the U.S. is demanding could spark an arms race as adversaries try to match NATO and America's Asian allies.",
    "link": "https://www.japantimes.co.jp/commentary/2025/02/25/japan/defense-spending-demands/",
    "timestamp": "2025-02-25T03:07:00Z"
  },
  {
    "title": "China’s Xi affirms ‘no limits’ partnership with Putin in call on Ukraine war anniversary",
    "description": "Chinese President Xi Jinping affirmed his “no limits” partnership in a phone call with Russian President Vladimir Putin, China’s state media reported, on the third anniversary of Russia’s invasion of Ukraine.",
    "link": "https://www.nbcnews.com/news/world/china-xi-affirms-no-limits-partnership-putin-call-ukraine-rcna193574",
    "timestamp": "2025-02-25T03:05:05Z"
  },
  {
    "title": "Alina Habba Asked on TV What She Got Done Last Week Amid Email Controversy",
    "description": "Alina Habba, counselor to President Donald Trump, was asked on live TV by Fox News host Jesse Watters to share one of her bullet points from last week, a poke at Elon Musk's email request for all federal workers.\nWhy It Matters\nMusk, head of the Department of…",
    "link": "https://biztoc.com/x/b71e3e5b02ee4eca",
    "timestamp": "2025-02-25T03:03:51Z"
  },
  {
    "title": "Alina Habba Asked on TV What She Got Done Last Week Amid Email Controversy",
    "description": "Counselor to President Donald Trump Alina Habba spoke about Elon Musk's email deadline for federal workers.",
    "link": "https://www.newsweek.com/alina-habba-asked-tv-what-she-got-done-last-week-amid-email-controversy-2035650",
    "timestamp": "2025-02-25T03:02:12Z"
  },
  {
    "title": "Sanders Gets Big Crowds On 'Fighting Oligarchy' Midwest Tour",
    "description": "After addressing more than 3,400 Nebraska residents in Omaha Friday evening, U.S. Sen. Bernie Sanders on Saturday made his second stop on his National Tour to Fight Oligarchy—telling Iowa City, Iowa residents that \"Trumpism will not be defeated by politicians…",
    "link": "https://crooksandliars.com/2025/02/sanders-gets-big-crowds-fighting-oligarchy",
    "timestamp": "2025-02-25T03:00:02Z"
  },
  {
    "title": "Trump aid freeze disrupts anti-narcotics program at Mexican ports",
    "description": "U.S. President Donald Trump's sweeping foreign aid freeze has stalled a United Nations program in Mexico aimed at stopping imported fentanyl chemicals from reaching the country's drug cartels, according to eight people familiar with the situation. It’s one of…",
    "link": "https://www.bangkokpost.com/video/world/2967635",
    "timestamp": "2025-02-25T03:00:00Z"
  },
  {
    "title": "Trump Hints At Meeting With Ukraine's Zelensky To Sign Minerals Deal",
    "description": "US President Donald Trump has invited his Ukrainian counterpart Volodymyr Zelensky for a meeting in Washington to sign a deal on critical minerals and suggested that the war between Russia and Ukraine could end &quot;within weeks&quot;.",
    "link": "https://www.ndtv.com/world-news/trump-hints-at-meeting-with-ukraines-zelensky-to-sign-minerals-deal-7788394",
    "timestamp": "2025-02-25T02:59:31Z"
  },
  {
    "title": "Trump's chip tariff threats raise stakes for Taiwan",
    "description": "Taiwan produces more than half of the world's chips and nearly all of the most advanced ones, making the island essential to global supply chains.",
    "link": "https://www.japantimes.co.jp/business/2025/02/25/tech/trump-chip-tariff-taiwan/",
    "timestamp": "2025-02-25T02:59:00Z"
  },
  {
    "title": "Musk offers 'another chance' to respond to productivity email, but warns failure again means termination",
    "description": "Elon Musk said federal employees who fail to respond to his productivity email will be given a another chance, but failure a second time means termination.",
    "link": "https://www.foxnews.com/politics/musk-offers-another-chance-respond-productivity-email-warns-failure-again-means-termination",
    "timestamp": "2025-02-25T02:57:32Z"
  },
  {
    "title": "Asian markets sink as Trump tariffs, China curbs stunt rally",
    "description": "Asian markets sank Tuesday as fears of US President Donald Trump’s trade war returning to the fore and he called for fresh curbs on Chinese investments in strategic sectors including technology. The losses followed a broadly negative day in New York, where mi…",
    "link": "https://www.digitaljournal.com/world/asian-markets-sink-as-trump-tariffs-china-curbs-stunt-rally/article",
    "timestamp": "2025-02-25T02:57:32Z"
  }
]