[
  {
    "title": "In rare criticism of Putin, Trump urges the Russian leader to ‘STOP!’ after a deadly attack on Kyiv",
    "description": "President Donald Trump on Thursday offered rare criticism of Vladimir Putin, urging the Russian leader to “STOP!” after a deadly barrage of attacks on Kyiv, Ukraine’s capital. “I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timin…",
    "link": "https://freerepublic.com/focus/f-news/4312978/posts",
    "timestamp": "2025-04-24T14:15:05Z"
  },
  {
    "title": "The End Of DeFi's Wild West? How 2025 Could Change Everything",
    "description": "2025 marks a turning point for DeFi regulation, yet it’s not the end of decentralized finance—it’s a test of adaptability.",
    "link": "https://www.forbes.com/councils/forbestechcouncil/2025/04/24/the-end-of-defis-wild-west-how-2025-could-change-everything/",
    "timestamp": "2025-04-24T14:15:00Z"
  },
  {
    "title": "CNN Grills Pro-Trump Press Corps: 'Do You Consider Yourself A Journalist?'",
    "description": "Senior correspondent Donie O'Sullivan interviewed members of the so-called \"new media\" about their newfound White House access and fawning coverage.",
    "link": "https://www.huffpost.com/entry/cnn-grills-pro-trump-press-corps-do-you-consider-yourself-a-journalist_n_680a0cc6e4b0c44791370497",
    "timestamp": "2025-04-24T14:13:47Z"
  },
  {
    "title": "Donald Trump's Approval Rating Worse Than First Term: Fox News Poll",
    "description": "The president's approval rating is falling amid fears of a recession.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2063535",
    "timestamp": "2025-04-24T14:13:09Z"
  },
  {
    "title": "\"Vladimir, Stop!\" Trump On Russian Strikes On Kyiv Which Killed 8",
    "description": "President Donald Trump turned his criticism on Russian President Vladimir Putin on Thursday after Russia pounded Kyiv with missiles and drones overnight, saying &quot;Vladimir, STOP!&quot;",
    "link": "https://www.ndtv.com/world-news/vladimir-stop-trump-on-russian-strikes-on-kyiv-which-killed-8-8246889",
    "timestamp": "2025-04-24T14:12:26Z"
  },
  {
    "title": "Fox News Forced to Admit That Everyone Hates Trump",
    "description": "After his first 100 days in office, Donald Trump’s approval rating is officially lower than it was during his first term, according to a humiliating Fox News poll released Wednesday. \r\nTrump’s approval rating sank to 44 percent at the 100-day mark, down five …",
    "link": "https://newrepublic.com/post/194341/donald-trump-100-days-approval-poll-fox-news",
    "timestamp": "2025-04-24T14:12:11Z"
  },
  {
    "title": "Tariffs give Europe an opportunity to assert itself as a superpower, central bank governor says",
    "description": "The uncertainty around trade tariffs is complex but a period of uncertainty also provides Europe with an opportunity to assert itself, the governor of the Bank of Latvia said.",
    "link": "https://www.cnbc.com/2025/04/24/europe-can-assert-itself-as-superpower-amid-tariffs-ecbs-kazks.html",
    "timestamp": "2025-04-24T14:11:30Z"
  },
  {
    "title": "Michelle Wolf Opens the Vault on 2018 White House Correspondents’ Dinner in New Comedy Set",
    "description": "Michelle Wolf will release 'Dinner Time,' a comedy special reflecting on her appearance at the 2018 White House Correspondents’ Dinner.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/michelle-wolf-white-house-correspondents-dinner-comedy-set-1235324013/",
    "timestamp": "2025-04-24T14:11:11Z"
  },
  {
    "title": "Wall Street wobbles: Futures drop after China confirms no talks with U.S., demands total tariff rollback now",
    "description": "US stock futures fall sharply as China unexpectedly shuts down trade talks, demanding a full rollback of tariffs before negotiations can resume. This shocking move reignites fears of a trade war, shaking Wall Street after two days of gains. Dow, S&P 500, and …",
    "link": "https://economictimes.indiatimes.com/news/international/us/wall-street-wobbles-futures-drop-after-china-confirms-no-talks-with-u-s-demands-total-tariff-rollback-now/articleshow/120587094.cms",
    "timestamp": "2025-04-24T14:09:25Z"
  },
  {
    "title": "Is This Constitutional? Here's How Due Process Works",
    "description": "The legal principle that people have the right to challenge the evidence against them is central to the Constitution.",
    "link": "https://reason.com/video/2025/04/24/is-this-constitutional-heres-how-due-process-works/",
    "timestamp": "2025-04-24T14:08:26Z"
  },
  {
    "title": "MAGA host: 'Money-grubbing' welfare recipients don't deserve Trump's $5,000 'baby bonuses'",
    "description": "MAGA TV host Gina Loudon worried that \"money-grubbing\" welfare recipients would benefit from the $5,000 incentives President Donald Trump is reportedly considering for households with new children.During a Thursday discussion about the so-called baby bonuses,…",
    "link": "https://www.rawstory.com/gina-loudon-baby-bonuses/",
    "timestamp": "2025-04-24T14:07:37Z"
  },
  {
    "title": "If America walks away from Ukraine, what will Europe do?",
    "description": "BERLIN &mdash; European allies of the United States have been trying to convince President Donald Trump of the virtues of a shared approach toward ending the war in Ukraine, to enhance leverage on both Russia and Ukraine and to preserve European security.",
    "link": "https://www.bangkokpost.com/world/3010672/if-america-walks-away-from-ukraine-what-will-europe-do-",
    "timestamp": "2025-04-24T14:06:00Z"
  },
  {
    "title": "DEEP STATE TAKES SHAPE: Most DC Bureaucrats Who Voted for Harris Would Disobey a Lawful Trump Order",
    "description": "A surprising number of federal bureaucrats who work in Washington, D.C., plan to oppose President Donald Trump from within the government—a deep state taking shape... Read More\nThe post DEEP STATE TAKES SHAPE: Most DC Bureaucrats Who Voted for Harris Would Di…",
    "link": "https://www.dailysignal.com/2025/04/24/deep-state-takes-shape-most-dc-bureaucrats-who-voted-harris-would-disobey-lawful-trump-order/",
    "timestamp": "2025-04-24T14:05:55Z"
  },
  {
    "title": "Trump Criticizes Putin in Rare Rebuke, Urging Russian Leader to ‘Stop’ After Deadly Attack on Kyiv",
    "description": "“I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, stop!\" Trump said.",
    "link": "https://time.com/7279918/trump-criticizes-putin-public-rebuke-deadly-kyiv-attack/",
    "timestamp": "2025-04-24T14:05:11Z"
  },
  {
    "title": "Moon Jae-in becomes 4th consecutive elected South Korean president to be indicted",
    "description": "South Korean prosecutors indicted former liberal president Moon Jae-in on bribery charges on Thursday, saying that a budget airline gave his son-in-law a lucrative no-show job during Moon's term in office.",
    "link": "https://www.cbc.ca/news/world/south-korea-president-moon-indicted-1.7517244",
    "timestamp": "2025-04-24T14:03:51Z"
  },
  {
    "title": "Reading Tea Leaves: Is the US Signaling Potential Differences With Israel?",
    "description": "A stickler for language, Israeli Prime Minister Benjamin Netanyahu twice this month remained conspicuously silent when senior officials from the Trump administration chose words that signaled potential US policy changes towards Gaza, the Palestinians and Hama…",
    "link": "https://www.fairobserver.com/world-news/middle-east-news/reading-tea-leaves-is-the-us-signaling-potential-differences-with-israel/",
    "timestamp": "2025-04-24T14:03:03Z"
  },
  {
    "title": "RPG books could be excluded from Trump’s tariffs, and you can thank Shadowrun for that",
    "description": "US President Donald Trump’s sweeping 145% tariffs on Chinese-made goods are creating chaos in the tabletop business, but there is one piece of the industry that’s seemingly exempt: role-playing game books. These are books that lay out the rules and world for …",
    "link": "https://www.polygon.com/gaming/563608/rpg-books-tariff-exclusions-shadowrun",
    "timestamp": "2025-04-24T14:03:01Z"
  },
  {
    "title": "Fed-up Trump blasts Putin after Russia’s deadly attack on Ukraine, hampering peace talks: ‘Vladimir, STOP!’",
    "description": "President Trump blasted Vladimir Putin on Thursday and urged the Russian president to “STOP!” after Moscow launched its deadliest attack on Ukraine in almost a year overnight. “I am not happy with the Russian strikes on KYIV,” Trump raged in a Truth Social po…",
    "link": "https://freerepublic.com/focus/f-chat/4312970/posts",
    "timestamp": "2025-04-24T14:02:08Z"
  },
  {
    "title": "Iran proposes talks with European powers as US nuclear negotiations proceed",
    "description": "DUBAI (Reuters) - Iran's Foreign Minister, Abbas Araqchi, said on Thursday he was ready to travel to France, Germany and Britain for talks, as Tehran looked to build on the momentum of nuclear negotiations with the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/24/iran-proposes-talks-with-european-powers-as-us-nuclear-negotiations-proceed",
    "timestamp": "2025-04-24T14:02:00Z"
  },
  {
    "title": "Nolte: ‘60 Minutes’ Chief 'Sobbed’ Like a Girl While Announcing Self-Deportation",
    "description": "A “stunned Anderson Cooper watched as 60 Minutes boss sobbed through shocking a resignation meeting,” according to the Daily Mail.\nThe post Nolte: ‘60 Minutes’ Chief ‘Sobbed’ Like a Girl While Announcing Self-Deportation appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/04/24/nolte-60-minutes-chief-sobbed-like-a-girl-while-announcing-self-deportation/",
    "timestamp": "2025-04-24T14:01:43Z"
  },
  {
    "title": "‘GREED’: Drudge Brutally Torches CBS News Chief Shari Redstone for 60 Minutes Crackdown",
    "description": "The Drudge Report brutally roasted Shari Redstone, the controlling shareholder of CBS News' parent company Paramount, at the top of its homepage.\nThe post ‘GREED’: Drudge Brutally Torches CBS News Chief Shari Redstone for 60 Minutes Crackdown first appeared o…",
    "link": "https://www.mediaite.com/news/greed-drudge-brutally-torches-cbs-news-chief-shari-redstone-for-60-minutes-crackdown/",
    "timestamp": "2025-04-24T14:01:30Z"
  },
  {
    "title": "US spirits exports hit a record high in 2024. Tariffs could destroy that | CNN Business",
    "description": "Exports of American-made spirits hit a record high in 2024, hitting $2.4 billion, however a hangover is about to hit the industry because of tariffs, a top industry group warned.",
    "link": "https://www.cnn.com/2025/04/24/business/spirits-exports-2024-discus-report/index.html",
    "timestamp": "2025-04-24T14:00:37Z"
  },
  {
    "title": "Former DOJ antitrust chief says a Google break up will benefit the internet",
    "description": "Today, we’re talking about the very real possibility that the United States government might break up Google. To figure that all out, I invited Jonathan Kanter, the former assistant attorney general for antitrust under the Biden administration, to join me on …",
    "link": "https://www.theverge.com/decoder-podcast-with-nilay-patel/654243/jonathan-kanter-antitrust-google-ad-tech-monopoly-doj",
    "timestamp": "2025-04-24T14:00:24Z"
  },
  {
    "title": "Could astronauts visit the Hubble Space Telescope again?",
    "description": "Astronauts repaired and upgraded NASA's Hubble Space Telescope over the course of five servicing missions from 1993 to 2009. Could yet another astronaut visit be in the cards?",
    "link": "https://www.space.com/space-exploration/hubble-space-telescope/could-astronauts-visit-the-hubble-space-telescope-again",
    "timestamp": "2025-04-24T14:00:20Z"
  },
  {
    "title": "Trump Admin Accelerates Mining Projects as China Curbs Critical Mineral Exports",
    "description": "The Trump White House is turning to a little-known tool to fast-track federal approvals for a slate of mining projects it says are vital to shoring up domestic energy, technological, and defense supply chains dominated by China.\nThe post Trump Admin Accelerat…",
    "link": "https://freebeacon.com/energy/trump-admin-accelerates-mining-projects-as-china-curbs-critical-mineral-exports/",
    "timestamp": "2025-04-24T14:00:17Z"
  },
  {
    "title": "Matador Plans to Cut Drilling Activity, Drop One Rig by Mid-2025",
    "description": "Texas shale-oil company Matador Resources Co. plans to drop one of its nine drilling rigs by the middle of the year in response to plunging crude prices.",
    "link": "https://www.rigzone.com/news/wire/matador_plans_to_cut_drilling_activity_drop_one_rig_by_mid2025-24-apr-2025-180328-article/",
    "timestamp": "2025-04-24T14:00:01Z"
  },
  {
    "title": "Brain Drain: Scientists Are Fleeing the U.S. as Trump Cuts Funding",
    "description": "American scientists are looking for opportunities overseas as Donald Trump and his administration cut funding and fire scientists.",
    "link": "http://www.rollingstone.com/politics/politics-features/scientists-fleeing-america-trump-cuts-funding-jobs-1235324006/",
    "timestamp": "2025-04-24T14:00:00Z"
  },
  {
    "title": "Gold price prediction today: Will 2025 be a golden year for investors? Here's what experts say",
    "description": "Gold price prediction today is on everyone’s radar as the market reacts to economic shifts, Trump’s tariff surprises, and Fed policy updates. After recently touching a record $3,500 per ounce, gold saw a sudden dip—leaving investors wondering what’s next. Exp…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-today-will-2025-be-a-golden-year-for-investors-heres-what-experts-say/articleshow/120588532.cms",
    "timestamp": "2025-04-24T13:59:50Z"
  },
  {
    "title": "Crimea is a focus of discussions to end Russia's war in Ukraine. Here's why it's so coveted",
    "description": "Russia's illegal seizure of Crimea from Ukraine 11 years ago was quick and bloodless.  U.S. President Donald Trump lashed out at Ukraine’s president...",
    "link": "https://www.yahoo.com/news/crimea-focus-discussions-end-russias-135812313.html",
    "timestamp": "2025-04-24T13:58:12Z"
  },
  {
    "title": "In a Normal World, Harvard’s Lawsuit Against Trump Would Be a Slam Dunk",
    "description": "Elie Mystal\n\n\n\nThe university’s case against the administration is incredibly strong. The question is whether normal rules still apply. \r\n\n\r\n\n\nThe post In a Normal World, Harvard’s Lawsuit Against Trump Would Be a Slam Dunk appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/harvard-lawsuit-against-trump-freeze/",
    "timestamp": "2025-04-24T13:57:36Z"
  },
  {
    "title": "Germany Expects Zero GDP Growth This Year, Blames Trump Tariffs",
    "description": "Germany's economy is expected to post zero growth in 2025, outgoing Economy Minister Robert Habeck said Thursday, blaming US President Donald Trump's trade policy.",
    "link": "https://www.ibtimes.com/germany-expects-zero-gdp-growth-this-year-blames-trump-tariffs-3771246",
    "timestamp": "2025-04-24T13:57:19Z"
  },
  {
    "title": "CNBC Goes On Wartime Footing As Financial Markets Churn",
    "description": "I got an insider’s view from coverage of the ongoing market turmoil with CNBC’s President KC Sullivan and their long-time senior economics reporter Steve Liesman.",
    "link": "https://www.forbes.com/sites/howardhomonoff/2025/04/24/cnbc-goes-on-wartime-footing-as-financial-markets-churn/",
    "timestamp": "2025-04-24T13:56:58Z"
  },
  {
    "title": "Jon Cryer Says Charlie Sheen Would Be Better President Than Donald Trump",
    "description": "Jon Cryer's relationship with Charlie Sheen hasn't always been smooth ... but, if he had to choose him or President Donald Trump to have their finger on the nuclear button, he says he's taking President Sheen every time. The veteran actor stopped…\n Permalink",
    "link": "https://www.tmz.com/2025/04/24/jon-cryer-charlie-sheen-better-president-than-trump/",
    "timestamp": "2025-04-24T13:56:39Z"
  },
  {
    "title": "One of Trump’s billionaire supporters has harsh words for the president about his trade war",
    "description": "Citadel CEO Ken Griffin, a billionaire supporter of President Donald Trump and a megadonor to Republican candidates, had some unusually harsh words for the president about his trade war: It’s hurting America’s standing in the world and eroding the nation’s br…",
    "link": "https://biztoc.com/x/39fdc2162b9839b8",
    "timestamp": "2025-04-24T13:56:29Z"
  },
  {
    "title": "Kremlin explains why Putin respects Trump",
    "description": "The US president is not only “a powerful political leader” but also a “strong man,” spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616216-kremlin-explains-why-putin-respects-trump/",
    "timestamp": "2025-04-24T13:56:15Z"
  },
  {
    "title": "Iran proposes talks with European powers as US nuclear negotiations proceed",
    "description": "Iran's Foreign Minister, Abbas Araqchi, said on Thursday he was ready to travel to France, Germany and Britain for talks, as Tehran looked to build on the...",
    "link": "https://www.yahoo.com/news/iran-proposes-talks-european-powers-135527681.html",
    "timestamp": "2025-04-24T13:55:27Z"
  },
  {
    "title": "Trump Wants World to Subsidise US Empire",
    "description": "A Trump advisor argues, in all seriousness, that other countries should help bear the cost of US empire because it confers so many benefits on them.",
    "link": "https://www.nakedcapitalism.com/2025/04/trump-wants-world-to-subsidise-us-empire.html",
    "timestamp": "2025-04-24T13:55:09Z"
  },
  {
    "title": "Meet the top donors to Trump's $239 million inauguration fund (Washington Post)",
    "description": "Washington Post:\nMeet the top donors to Trump's $239 million inauguration fund  —  The list includes more than a dozen nominees to the administration, a poultry giant and embattled crypto companies  —  President Donald Trump raised a record $239 million for h…",
    "link": "https://www.memeorandum.com/250424/p47",
    "timestamp": "2025-04-24T13:55:00Z"
  },
  {
    "title": "As international tourists steer clear of the U.S., Trump expresses indifference",
    "description": "Asked why fewer people suddenly want to travel to American soil, Donald Trump replied, “It’s not a big deal.” There's reason to believe otherwise.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/international-tourists-steer-clear-us-trump-expresses-indifference-rcna202763",
    "timestamp": "2025-04-24T13:54:02Z"
  },
  {
    "title": "Top union calls cops on itself to orchestrate ‘civil disobedience’ stunt at GOP office: source",
    "description": "Service Employees International Union (SEIU) protesters called the Anaheim Police Department to coordinate a planned arrest during a scheduled protest outside Republican Rep. Young Kim office.",
    "link": "https://www.foxnews.com/politics/top-union-call-cops-itself-orchestrate-civil-disobedience-stunt-gop-office",
    "timestamp": "2025-04-24T13:53:32Z"
  },
  {
    "title": "NHL legend slams Trump as Russia is blamed for deadly missile attack on Kyiv",
    "description": "Legendary NHL goaltender Dominik Hasek ripped President Donald Trump as Russia was blamed for a deadly missile strike on Ukraine on Thursday.",
    "link": "https://www.foxnews.com/sports/nhl-legend-slams-trump-russia-blamed-deadly-missile-attack-kyiv",
    "timestamp": "2025-04-24T13:53:06Z"
  },
  {
    "title": "Auto Industry May Get A Much-Needed Break From Trump's Tariffs",
    "description": "Trump may be considering easing tariffs against the auto industry as well as Tesla's dismal March in Europe plus Nissan's massive fiscal year loss and more.",
    "link": "https://www.jalopnik.com/1842605/trump-may-ease-auto-industry-tariffs/",
    "timestamp": "2025-04-24T13:52:46Z"
  },
  {
    "title": "European Leaders Reject US Proposal of Russian Sovereignty Over Crimea Despite Russia Controlling the Region for the Last 10 Years",
    "description": "More insanity from the globalist Western European elites. According to news reports last week, the Trump Administration suggested it was prepared to recognize Russian control over Crimea. This is part of a broader peace agreement that the US has facilitated b…",
    "link": "https://freerepublic.com/focus/f-news/4312967/posts",
    "timestamp": "2025-04-24T13:51:04Z"
  },
  {
    "title": "Trump tells Putin 'STOP' after deadly Russian strikes on Kyiv",
    "description": "President Donald Trump criticized Russia over its strikes on Kyiv, Ukraine, and urged Russian President Vladimir Putin to make a peace deal with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.foxnews.com/politics/trump-tells-putin-stop-after-deadly-russian-strikes-kyiv",
    "timestamp": "2025-04-24T13:50:09Z"
  },
  {
    "title": "Morgan Stanley to sell final $1.2 billion of X debt, Bloomberg News reports",
    "description": "Musk's close relationship to President Donald Trump and prospects of improving revenue of X have allowed banks to offload almost all of the $13 billion they ...",
    "link": "https://ca.finance.yahoo.com/news/morgan-stanley-sell-final-1-134939905.html",
    "timestamp": "2025-04-24T13:49:39Z"
  },
  {
    "title": "Morgan Stanley to sell final $1.2 billion of X debt, Bloomberg News reports",
    "description": "Musk's close relationship to President Donald Trump and prospects of improving revenue of X have allowed banks to offload almost all of the $13 billion they ...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-sell-final-1-134939274.html",
    "timestamp": "2025-04-24T13:49:39Z"
  },
  {
    "title": "Trump talked about the '51st state' during call with Carney: Radio-Canada sources",
    "description": "During the phone call last month between Donald Trump and Mark Carney, the U.S. president put the idea of making Canada the 51st U.S. state back on the table, contrary to what the prime minister himself publicly stated later, sources told Radio-Canada.",
    "link": "https://www.cbc.ca/news/politics/carney-trump-51st-state-1.7517252",
    "timestamp": "2025-04-24T13:49:27Z"
  },
  {
    "title": "IMF chief urges countries to move ‘swiftly’ to resolve trade tensions that threaten global growth",
    "description": "The IMF leader warned that the economic fallout from trade conflict would fall most heavily on poor countries.",
    "link": "https://www.bostonherald.com/2025/04/24/imf-chief-global-economy/",
    "timestamp": "2025-04-24T13:49:22Z"
  },
  {
    "title": "Today in Presidential Corruption News",
    "description": "Imagine that the political donations that rented the Lincoln Bedroom in the Clinton era were actually personal payments, made directly to the Clintons, and paid immediately, to bypass all the ordinary-political-corruption norms about waiting until someone is …",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/04/today-in-presidential-corruption-news.html",
    "timestamp": "2025-04-24T13:48:23Z"
  },
  {
    "title": "Rubio’s Reforms Address Trump’s Unfinished Business with ‘Bloated’ State Department",
    "description": "If it hasn’t been made clear enough by now, President Donald Trump and his administration have unfinished business from his first term. That feeling is... Read More\nThe post Rubio’s Reforms Address Trump’s Unfinished Business with ‘Bloated’ State Department a…",
    "link": "https://www.dailysignal.com/2025/04/24/rubios-reforms-address-trumps-unfinished-business-bloated-state-department/",
    "timestamp": "2025-04-24T13:47:01Z"
  },
  {
    "title": "Bridgewater hedge fund warns Trump policies could induce a recession",
    "description": "Recent policy changes such as tariffs create \"exceptional risks to US assets,\" Bridgewater said.",
    "link": "https://www.cnbc.com/2025/04/24/bridgewater-hedge-fund-warns-trump-policies-could-induce-a-recession.html",
    "timestamp": "2025-04-24T13:46:27Z"
  },
  {
    "title": "Russia issues nuclear WW3 threat to UK against deploying peacekeeping troops to Ukraine",
    "description": "If the UK sends peacekeeping troops to protect Ukraine then Russia is warning it could use nuclear weapons in response.",
    "link": "https://www.ladbible.com/news/world-news/russia-nuclear-warning-uk-peacekeeping-ukraine-036106-20250424",
    "timestamp": "2025-04-24T13:46:26Z"
  },
  {
    "title": "Gold climbs Rs 200 to Rs 99,400/10 gm amid renewed concerns over US-China standoff",
    "description": "Gold prices climbed Rs 200 to Rs 99,400 per 10 grams in the national capital on Thursday following fresh buying by stockists and jewellers and a weak dollar, according to the All India Sarafa Association.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-climbs-rs-200-to-rs-99400/10-gm-amid-renewed-concerns-over-us-china-standoff/articleshow/120588409.cms",
    "timestamp": "2025-04-24T13:46:02Z"
  },
  {
    "title": "European Central Bank's Holzmann says rate cuts must wait for more tariff certainty",
    "description": "\"Before looking at data in detail, the question is, what kind of political decisions will be taken?\"",
    "link": "https://www.cnbc.com/2025/04/24/ecbs-holzmann-says-rate-cuts-must-wait-for-more-tariff-certainty.html",
    "timestamp": "2025-04-24T13:45:54Z"
  },
  {
    "title": "Over Half of the Imported Shotguns in the U.S. Come from This Country",
    "description": "In his time since taking office, U.S. President Donald Trump has both threatened to implement tariffs against other nations — and followed through with this promise. On “Liberation Day,” Trump announced “reciprocal tariffs on imports from about 90 nations tha…",
    "link": "https://biztoc.com/x/23fabb93fe66a64a",
    "timestamp": "2025-04-24T13:45:20Z"
  },
  {
    "title": "Parental Opt-Outs for Controversial Books",
    "description": "Book battles come to the Supreme Court: Mahmoud v. Taylor is before the Court this week, dealing with the Montgomery County Board of Education, which took",
    "link": "https://reason.com/2025/04/24/parental-opt-outs-for-controversial-books/",
    "timestamp": "2025-04-24T13:43:34Z"
  },
  {
    "title": "Rick Scott, at Harvard: Stop Discriminating and Pay Taxes Like the Rest of Us",
    "description": "Sen. Rick Scott (R-FL) spoke at Harvard on Wednesday and told Harvard, in person, to stop discriminating against Jews and to pay taxes like other Americans.\nThe post Rick Scott, at Harvard: Stop Discriminating and Pay Taxes Like the Rest of Us appeared first …",
    "link": "https://www.breitbart.com/politics/2025/04/24/rick-scott-at-harvard-stop-discriminating-and-pay-taxes-like-the-rest-of-us/",
    "timestamp": "2025-04-24T13:41:55Z"
  },
  {
    "title": "‘Here’s The Problem’: Chris Cuomo Warns Dems It’s Losing Issue To Push For Pete Hegseth ‘Scalp’",
    "description": "Chris Cuomo warned Democrats that demanding Donald Trump fire Defense Secretary Pete Hegseth over new Signal allegations is a politically losing issue.",
    "link": "https://dailycaller.com/2025/04/24/chris-cuomo-warns-dems-losing-issue-pete-hegseth-scalp/",
    "timestamp": "2025-04-24T13:41:39Z"
  },
  {
    "title": "Walmart and Target CEOs warn Trump: Tariffs could mean empty shelves",
    "description": "If supermarket and hardware store shelves are empty in the near future, President Donald Trump can’t say he wasn’t warned.Read more...",
    "link": "https://qz.com/walmart-target-home-depot-ceos-trump-tariffs-1851777650",
    "timestamp": "2025-04-24T13:41:19Z"
  },
  {
    "title": "Trump on Russia strikes on Kyiv: 'Vladimir, STOP!'",
    "description": "\"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing,\" Trump wrote in a social media post.",
    "link": "https://www.jpost.com/international/internationalrussia-ukraine-war/article-851389",
    "timestamp": "2025-04-24T13:41:14Z"
  },
  {
    "title": "India vows to hunt terrorists ‘to the ends of the earth’ as tensions with Pakistan rise after Kashmir attack",
    "description": "India is vowing to hunt down terrorists \"to the ends of the earth\" as tensions are escalating with Pakistan in the wake of a deadly attack in India's Kashmir region.",
    "link": "https://www.foxnews.com/world/india-vows-hunt-terrorists-to-ends-earth-tensions-pakistan-rise-after-kashmir-attack",
    "timestamp": "2025-04-24T13:40:48Z"
  },
  {
    "title": "Trump Admin Indicts Alleged Tren De Aragua Leader On Terrorism Charges For First Time",
    "description": "Federal prosecutors lodged terrorism charges against an alleged high-ranking Tren de Aragua leader, marking the first time the Trump administration has indicted a member of the gang on terrorism-related crimes. Jose Enrique Martinez Flores, a 24-year-old Vene…",
    "link": "https://dailycaller.com/2025/04/24/trump-doj-charges-tren-de-aragua-member-terrorism/",
    "timestamp": "2025-04-24T13:40:24Z"
  },
  {
    "title": "Wiz Khalifa is a flat-earther: ‘I just believe that we live on a flat plane’",
    "description": "A few days ago, Wiz Khalifa appeared on The Joe Budden Podcast, where he discussed his new album (Kush & OJ 2) and bragged about how well he’s doing financially these days. He claims that he still gets paid $250K for a feature and books shows for $2 million. …",
    "link": "https://www.celebitchy.com/919175/wiz_khalifa_is_a_flat-earther_i_just_believe_that_we_live_on_a_flat_plane/",
    "timestamp": "2025-04-24T13:40:11Z"
  },
  {
    "title": "Canada election: Leaders on campaign trail respond after Trump revives ‘51st state’ rhetoric",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/canada-election-leaders-on-campaign-trail-respond-after-trump-revives-51st-state-rhetoric-9.6734073",
    "timestamp": "2025-04-24T13:38:59Z"
  },
  {
    "title": "Kremlin praises Trump’s view on Crimea",
    "description": "he US president’s statement that Ukraine lost the peninsula “years ago” “fully corresponds” with Moscow’s view, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616199-peskov-trump-statement-crimea/",
    "timestamp": "2025-04-24T13:38:38Z"
  },
  {
    "title": "Trump will hold a rally in Michigan next week to mark his first 100 days in office",
    "description": "President Donald Trump will travel to Michigan next week to celebrate his first 100 days in office. Trump's rally in Macomb County will be his first since Inauguration Day earlier this year. Trump has not traveled much since taking office, outside of personal…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-will-hold-a-rally-in-michigan-next-week-to-20291439.php",
    "timestamp": "2025-04-24T13:38:33Z"
  },
  {
    "title": "After a strong start in FY25, Maruti Suzuki may close the year on a tepid note",
    "description": "Analysts expect pressure on the company's margins due to higher marketing expenses and discounts.",
    "link": "https://www.livemint.com/companies/company-results/maruti-suzuki-cng-ev-vehicles-delhi-national-stock-exchange-nifty-auto-us-trump-tariffs-toshihiro-suzuki-evitara-11745487691760.html",
    "timestamp": "2025-04-24T13:37:41Z"
  },
  {
    "title": "'What?' MSNBC hosts pounce on J.D. Vance's latest defense of Putin's 'perspective'",
    "description": "Comments made by Vice President J.D. Vance on Wednesday about negotiations to end Russia's invasion of Ukraine earned him a tongue-lashing on MSNBC early Thursday morning.With Donald Trump's administration flailing in its attempts to end the war Russian Presi…",
    "link": "https://www.rawstory.com/vance-ukraine-putin-what/",
    "timestamp": "2025-04-24T13:37:09Z"
  },
  {
    "title": "Trump to hold rally in Michigan next week to mark his first 100 days in office",
    "description": "President Donald Trump will mark his first 100 days in office next week with a rally in Michigan, his first since returning to the White House earlier this year.",
    "link": "https://www.fox17online.com/news/local-news/michigan/trump-to-hold-rally-in-michigan-next-week-to-mark-his-first-100-days-in-office",
    "timestamp": "2025-04-24T13:35:35Z"
  },
  {
    "title": "Trump Narratives Debunked",
    "description": "President Donald Trump has received a lot of negative press, in which people say he acts like a king and that his popularity is shrinking. However, new polls show most Americans don’t buy the “excessive power” narrative. Even CNN analyst Harry Enten is trying…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312964/posts",
    "timestamp": "2025-04-24T13:35:21Z"
  },
  {
    "title": "Donald Trump begs Putin to 'stop' in desperate plea after nine people killed in airstrike on Ukraine",
    "description": "Trump's criticism of the Russian leader comes after the deadliest attack on the capital city since last summer",
    "link": "https://www.ladbible.com/news/politics/trump-putin-ukraine-airstrike-russia-stop-nine-killed-613059-20250424",
    "timestamp": "2025-04-24T13:35:14Z"
  },
  {
    "title": "Trump hits Fed Chair Jerome Powell again, says he's 'making a mistake' on interest rates",
    "description": "President Donald Trump’s criticism of Federal Reserve Chair Jerome Powell resumed late Wednesday, when Trump said the central bank chief is making a mistake by not lowering interest rates.Read more...",
    "link": "https://qz.com/trump-federal-reserve-jerome-powell-interest-rates-1851777651",
    "timestamp": "2025-04-24T13:35:03Z"
  },
  {
    "title": "Trump Gets Big Laugh in Oval Office Pointing Out Biden-Bashing Sticker on Wheelchair During Photo Op",
    "description": "The Oval Office erupted in laughter when Trump pointed out a guest's adornment bashing former President Biden with a coded message that Biden later co-opted.\nThe post Trump Gets Big Laugh in Oval Office Pointing Out Biden-Bashing Sticker on Wheelchair During …",
    "link": "https://www.mediaite.com/news/trump-gets-big-laugh-in-oval-office-pointing-out-biden-bashing-sticker-on-wheelchair-during-photo-op/",
    "timestamp": "2025-04-24T13:34:56Z"
  },
  {
    "title": "Trump Admin Responds to FTC Firings Lawsuit—'Extraordinary Intrusion'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's administration has rejected calls for the White House to reverse the dismissal of two Democratic commissioners who were recently fired from the Federal Trade Commission (FTC), arguing …",
    "link": "https://biztoc.com/x/8194bfeda21d000c",
    "timestamp": "2025-04-24T13:34:30Z"
  },
  {
    "title": "Trump tells Putin to 'STOP!' Russian strikes on Kyiv",
    "description": "President Donald Trump on Thursday called on Russian President Vladimir Putin to halt missile and drone attacks on the Ukrainian capital Kyiv.\n\"I am not happy with the Russian strikes on KYIV,\" Trump wrote in a Truth Social post, after Russia launched what wa…",
    "link": "https://biztoc.com/x/782fe26342209c7a",
    "timestamp": "2025-04-24T13:34:23Z"
  },
  {
    "title": "Trump Admin Responds to FTC Firings Lawsuit—'Extraordinary Intrusion'",
    "description": "Commission members Rebecca Kelly Slaughter and Alvaro M. Bedoya claim their dismissals were unlawful and should be reversed.",
    "link": "https://www.newsweek.com/trump-admin-responds-ftc-firings-lawsuit-2063541",
    "timestamp": "2025-04-24T13:33:15Z"
  },
  {
    "title": "Chuck Schumer a Likely Casualty of the Democrat Civil War",
    "description": "The party is broken – and once-integral cogs in the machine are slated for replacement. Senate Minority Leader Chuck Schumer (D-NY) has now perhaps become the most high-profile victim of the Democratic Party’s civil war – with less emphasis on the “civil.” A …",
    "link": "https://freerepublic.com/focus/f-bloggers/4312963/posts",
    "timestamp": "2025-04-24T13:31:58Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Thursday",
    "description": "Wall Street was headed for a muted open today after China said trade talks with the U.S. have not started.",
    "link": "https://www.cnbc.com/2025/04/24/jim-cramers-top-10-things-to-watch-in-the-stock-market-thursday.html",
    "timestamp": "2025-04-24T13:31:31Z"
  },
  {
    "title": "Apple, Meta Fined as EU Presses Ahead With Tech Probes",
    "description": "Apple was fined 500 million euros ($570 million) on Wednesday and Meta 200 million euros, as European Union antitrust regulators handed out the first sanctions under landmark legislation aimed at curbing the power of Big Tech. The EU fines could …",
    "link": "https://www.insurancejournal.com/news/international/2025/04/24/821139.htm",
    "timestamp": "2025-04-24T13:30:16Z"
  },
  {
    "title": "Russia ready for talks on new nuclear pact with US, Shoigu says",
    "description": "Russia is prepared to resume talks on nuclear arms control with the US, two years after suspending the last accord limiting their atomic arsenals, a top security official said.",
    "link": "https://www.bangkokpost.com/world/3010667/russia-ready-for-talks-on-new-nuclear-pact-with-us-shoigu-says",
    "timestamp": "2025-04-24T13:30:00Z"
  },
  {
    "title": "Elon Musk’s Luck Runs Out",
    "description": "Why he didn’t see this coming",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/04/elon-musk-tesla-doge/682566/",
    "timestamp": "2025-04-24T13:30:00Z"
  },
  {
    "title": "‘Vladimir, STOP!’ Trump posts rare criticism of Putin after deadly attack on Kyiv",
    "description": "Trump said in a social media post on Thursday that \"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying.\"",
    "link": "https://www.pbs.org/newshour/politics/vladimir-stop-trump-posts-rare-criticism-of-putin-after-deadly-attack-on-kyiv",
    "timestamp": "2025-04-24T13:29:14Z"
  },
  {
    "title": "Morgan Stanley to Sell Final $1.23 Billion of X Buyout Debt",
    "description": "(Bloomberg) -- Morgan Stanley launched a pivotal sale of the last bit of debt tied to Elon Musk’s buyout of social-media platform X Holdings Corp. on...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-sell-final-1-132658151.html",
    "timestamp": "2025-04-24T13:26:58Z"
  },
  {
    "title": "Why Republicans Are Still Sticking with Trump",
    "description": "Despite sinking approval ratings — even on the economy, once considered his strongest issue — Donald Trump still faces almost no criticism from Republican lawmakers. His grip on the party remains remarkably tight. There are",
    "link": "https://politicalwire.com/2025/04/24/why-republicans-are-still-sticking-with-trump/",
    "timestamp": "2025-04-24T13:26:31Z"
  },
  {
    "title": "Poll Delivers Trump Bad News on Economy",
    "description": "Trump won the election in part due to frustration with inflation and his promise to lead the U.S. into a new age of growth.",
    "link": "https://www.newsweek.com/poll-delivers-trump-bad-news-economy-2063591",
    "timestamp": "2025-04-24T13:26:12Z"
  },
  {
    "title": "China’s Investments in Southeast Asia Snarl US Plans on Supply Chains",
    "description": "Chinese investments in Southeast Asian manufacturing are likely much higher than official data shows, underscoring the difficulty of any US attempt to box in Beijing or exclude Chinese-made goods from its supply chains.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-investments-in-southeast-asia-snarl-us-plans-on-supply-chains",
    "timestamp": "2025-04-24T13:25:59Z"
  },
  {
    "title": "Ex-NFL player calls for male athletes to support females amid fight against trans inclusion in women's sports",
    "description": "Former NFL player Frank Murphy called on athletes from the league and the NBA to stand up against trans inclusion in women's sports on Thursday.",
    "link": "https://www.foxnews.com/sports/ex-nfl-player-calls-male-athletes-support-females-amid-fight-against-trans-inclusion-womens-sports",
    "timestamp": "2025-04-24T13:24:23Z"
  },
  {
    "title": "Trump tells Putin to 'STOP!' Russian strikes on Kyiv",
    "description": null,
    "link": "https://www.cnbc.com/2025/04/24/trump-putin-russia-ukraine-kyiv.html",
    "timestamp": "2025-04-24T13:23:03Z"
  },
  {
    "title": "Trump Says Lowering China Tariffs Depends on Them",
    "description": "President Donald Trump said he plans to be “very nice” to China in any trade talks and that tariffs will drop if the two countries can reach a deal, a sign he may be backing down from his tough stance on Beijing amid market volatility. #trump #us #china #tari…",
    "link": "https://biztoc.com/x/b6206b9d93826be0",
    "timestamp": "2025-04-24T13:22:39Z"
  },
  {
    "title": "Shein and Temu set to get expensive in the US from April 25: Here’s how you can still save money",
    "description": "Shein and Temu, both Chinese e-commerce sites, are set to increase prices for US consumers owing to increased tariffs imposed by US President Donald Trump. The ongoing trade war between US and China has hugely impaced such platforms.",
    "link": "https://economictimes.indiatimes.com/news/international/us/shein-and-temu-set-to-get-expensive-in-the-us-from-april-25-heres-how-you-can-still-save-money/articleshow/120587988.cms",
    "timestamp": "2025-04-24T13:22:38Z"
  },
  {
    "title": "It's not just 'leftist' judges. GOP appointees have many sharp words for Trump. (Aaron Blake/Washington Post)",
    "description": "Aaron Blake / Washington Post:\nIt's not just ‘leftist’ judges.  GOP appointees have many sharp words for Trump.  —  Three times in the last 16 days, Republican-nominated judges have pitched the administration's actions as brazen, lawless — and even dangerous.…",
    "link": "https://www.memeorandum.com/250424/p42",
    "timestamp": "2025-04-24T13:20:01Z"
  },
  {
    "title": "Gov. Gen. Mary Simon will represent Canada at Pope Francis's funeral on Saturday",
    "description": "Gov. Gen. Mary Simon will represent Canada at the funeral for Pope Francis at the Vatican on Saturday, says Prime Minister Mark Carney.",
    "link": "https://www.nationalobserver.com/2025/04/24/news/gov-gen-mary-simon-will-represent-canada-pope-franciss-funeral-saturday",
    "timestamp": "2025-04-24T13:17:42Z"
  },
  {
    "title": "1.9 Million People Stuck In Student Loan Forgiveness And Repayment Limbo Get Some Key Updates",
    "description": "Nearly two million federal student loan borrowers pursuing lower payments and loan forgiveness have been stuck in limbo. Now, we have some updates.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/04/24/19-million-people-stuck-in-student-loan-forgiveness-and-repayment-limbo-get-some-key-updates/",
    "timestamp": "2025-04-24T13:17:26Z"
  },
  {
    "title": "AOC’s Brother Denies He’s Linked to $1.2M Fentanyl Ring After Fake News Spreads Like Wildfire",
    "description": "The brother of Rep. Alexandria Ocasio-Cortez (D-NY) denied being involved in drug trafficking after a fake news story about him went viral.\nThe post AOC’s Brother Denies He’s Linked to $1.2M Fentanyl Ring After Fake News Spreads Like Wildfire first appeared o…",
    "link": "https://www.mediaite.com/news/aocs-brother-denies-hes-linked-to-1-2m-fentanyl-ring-after-fake-news-spreads-like-wildfire/",
    "timestamp": "2025-04-24T13:17:21Z"
  },
  {
    "title": "Trump issues rare rebuke for Putin after Kyiv attacks",
    "description": "Donald Trump said deadly Russian attacks on Kyiv were \"not necessary and very bad timimg.\" Ukraine's foreign minister has said the assaults showed Moscow does not want peace. DW has more.",
    "link": "https://www.dw.com/en/trump-issues-rare-rebuke-for-putin-after-kyiv-attacks/live-72328966",
    "timestamp": "2025-04-24T13:17:00Z"
  }
]