[
  {
    "title": "Inside the “Vital” Office for Reproductive Health Gutted By Mass HHS Firings",
    "description": "One of the casualties of Tuesday’s massive purge of workers from the Department of Health and Human Services (HHS) is an office dedicated to promoting healthy pregnancies. Most of the more than 100 employees at the Division of Reproductive Health lost their j…",
    "link": "https://www.motherjones.com/politics/2025/04/hhs-ivf-trump-elon-cuts-reproductive-health-mass-firings-division-of-reproductive-health/",
    "timestamp": "2025-04-04T14:28:39Z"
  },
  {
    "title": "U.S. added 228,000 jobs in strong March buildup to Trump trade wars",
    "description": "U.S. employers added a surprising number of jobs last month, showing that the American labor market was in solid shape as President Donald Trump embarked on a risky trade war with the rest of the world.",
    "link": "https://www.pbs.org/newshour/economy/u-s-added-228000-jobs-in-strong-march-buildup-to-trump-trade-wars",
    "timestamp": "2025-04-04T14:24:46Z"
  },
  {
    "title": "How tariffs will affect Canadian pocketbooks",
    "description": "Inflation in Canada is expected to eclipse the three per cent mark over the summer, according to economists at TD. Find out more",
    "link": "https://financialpost.com/news/economy/how-tariffs-will-affect-canadian-pocketbooks",
    "timestamp": "2025-04-04T14:23:24Z"
  },
  {
    "title": "Trump tariffs rock global commodities market as risk of US-led recession rises",
    "description": "US President Trump's tariffs announcement causes commodities market turmoil, with all sub-asset classes in the red.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/trump-tariffs-rock-global-commodities-market-as-risk-of-us-led-recession-rises/article69413258.ece",
    "timestamp": "2025-04-04T14:23:16Z"
  },
  {
    "title": "Donald Trump Really Is a Lot Dumber Than We Thought. Like, a Lot!",
    "description": "You remember the Brady Bunch movies of the 1990s, whose ingenious conceit was that television’s archetypal late-1960s sitcom family was transported to the ’90s but still lived in their oblivious 1969 bubble of bell bottoms and groovy chicks and Davy Jones fan…",
    "link": "https://newrepublic.com/post/193614/donald-trump-tariffs-dumb-history-income-tax",
    "timestamp": "2025-04-04T14:22:53Z"
  },
  {
    "title": "Donald Trump says China 'panicked' & 'played it wrong' after Beijing hits back with 34% tariffs",
    "description": "China announced 34% tariffs on all US imports following the US's own 34% tariff imposition earlier in April. President Trump claimed China overreacted, further heightening the global trade war. The economic impact on both countries remains uncertain.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-says-china-panicked-played-it-wrong-after-beijing-hits-back-with-34-tariffs/articleshow/119984461.cms",
    "timestamp": "2025-04-04T14:22:51Z"
  },
  {
    "title": "Kamala Harris’s awkward Oscar moment? Book claims ex-VP had to fake surprise as Obamas made her work for what should've been a surefire endorsement",
    "description": "Kamala Harris faced challenges in securing Barack Obama's endorsement for the 2024 Democratic nomination. Despite pressure from top Democrats, Obama hesitated, believing Harris couldn't defeat Donald Trump. His reluctance led to tense negotiations, with Harri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kamala-harriss-awkward-oscar-moment-book-claims-ex-vp-had-to-fake-surprise-as-obamas-made-her-work-for-what-shouldve-been-a-surefire-endorsement/articleshow/119984451.cms",
    "timestamp": "2025-04-04T14:22:48Z"
  },
  {
    "title": "Trump And Musk Back France’s Le Pen After Far-Right Leader’s Embezzlement Conviction",
    "description": "Marine Le Pen, France’s far-right leader, was sentenced to prison and barred from running for office for five years after a court convicted her of embezzlement.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/04/trump-and-musk-back-frances-le-pen-after-far-right-leaders-embezzlement-conviction/",
    "timestamp": "2025-04-04T14:22:29Z"
  },
  {
    "title": "China Hits Back With 34% Tariffs on US Goods; SE Asia Reeling",
    "description": "Asian nations have been shocked, angered and baffled by the tariffs implemented by US President Donald Trump since he took office in mid-January.\nTrump is seen by many as unleashing an unreasonable economic war that will seriously damage global trade and infl…",
    "link": "https://biztoc.com/x/24a67f7ba510b0eb",
    "timestamp": "2025-04-04T14:22:12Z"
  },
  {
    "title": "EU 'prepares to hit Elon Musk with potential $1 BILLION fine for breaking disinformation laws'",
    "description": "European Union regulators are preparing to hit Elon Musk's X platform with a huge fine which could surpass $1billion for breaking disinformation laws, insiders have reportedly revealed. The move would likely to ratchet up tensions between the EU and United St…",
    "link": "https://freerepublic.com/focus/f-news/4308813/posts",
    "timestamp": "2025-04-04T14:20:28Z"
  },
  {
    "title": "4/4/25 National Security and Korean News and Commentary",
    "description": "Access National Security News HERE. Access Korean News HERE. National Security News Content: 1. Fact Sheet: President Donald J. Trump Declares National Emergency to Increase our Competitive Edge, Protect our Sovereignty, and Strengthen our National and Econom…",
    "link": "https://smallwarsjournal.com/2025/04/04/4-4-25-national-security-and-korean-news-and-commentary/",
    "timestamp": "2025-04-04T14:19:23Z"
  },
  {
    "title": "Warren Buffett's been waiting years for a crash like this — but he might not be buying just yet",
    "description": "Berkshire Hathaway has a $321 billion cash pile, but close followers of Warren Buffett's company say it might hold off on buying into the market rout.",
    "link": "https://www.businessinsider.com/warren-buffett-stock-market-crash-trump-tariffs-berkshire-billionaires-hanke-2025-4",
    "timestamp": "2025-04-04T14:18:58Z"
  },
  {
    "title": "Lesotho puzzled by whopping U.S. tariff rate, which could decimate its economy",
    "description": "Lesotho scrambled to put together a delegation on Friday to head to Washington to engage with the United States on tariffs that risk wiping out nearly half of its exports, its trade minister said, in what could be a death blow to its economy.",
    "link": "https://www.cbc.ca/news/world/lesotho-us-tariff-reaction-1.7501901",
    "timestamp": "2025-04-04T14:17:57Z"
  },
  {
    "title": "The Switch 2’s higher prices won’t hurt its chances at success, analysts say",
    "description": "Nintendo Switch 2 and its games are more expensive than expected, but analysts don't think that's disastrous for Nintendo.",
    "link": "https://www.digitaltrends.com/gaming/nintnedo-switch-2-price-analyst-interviews/",
    "timestamp": "2025-04-04T14:17:02Z"
  },
  {
    "title": "Washington state high school forced to allow men to play women's sports after legal threats from Democrat leaders",
    "description": "The WIAA was told by the state’s Attorney General Nick Brown and Superintendent of Public Instruction Chris Reykdal, both Democrats, as well as the state’s Office for Civil Rights, that the proposals would violate state law.. The governing body for high schoo…",
    "link": "https://freerepublic.com/focus/f-news/4308810/posts",
    "timestamp": "2025-04-04T14:16:42Z"
  },
  {
    "title": "Coldware Offers 1,000% ROI Opportunity, Here’s Why COLD Will Be Priced Above EOS",
    "description": "The cryptocurrency market is currently navigating a challenging phase, with major disruptions stemming from global economic factors like trade tariffs. The recent “Liberation Day” tariffs introduced by U.S. President Donald Trump sent shockwaves through both …",
    "link": "https://zycrypto.com/coldware-offers-1000-roi-opportunity-heres-why-cold-will-be-priced-above-eos/",
    "timestamp": "2025-04-04T14:16:39Z"
  },
  {
    "title": "‘Close to Panic’: Fox Business Guest Sounds Alarm on Looming Recession — Seconds Before Stocks Nosedive For Second Straight Day",
    "description": "Mark Mahaney is a senior managing director and heads Evercore ISI’s Internet research team. And seeing as he has covered internet stocks for over 25 years, he was a solid booking by Fox Business on what appears to be day two of a massive market sell-off follo…",
    "link": "https://www.mediaite.com/tv/close-to-panic-fox-business-guest-sounds-alarm-on-looming-recession-seconds-before-stocks-nosedive-for-second-straight-day/",
    "timestamp": "2025-04-04T14:16:24Z"
  },
  {
    "title": "'No winners': China retaliates to Trump 'bullying'",
    "description": "The Chinese government on Friday responded to U.S. President Donald Trump's sweeping new tariffs with 34% import duties on all American goods beginning next week, intensifying global blowback against the White House and accelerating a worldwide financial mark…",
    "link": "https://www.rawstory.com/china-retaliates-against-trump-bullying-with-34-tariffs-on-all-us-goods/",
    "timestamp": "2025-04-04T14:16:15Z"
  },
  {
    "title": "The Switch 2’s $450 price tag is a ‘strategic balancing act’ and Nintendo could be ‘building in a buffer’ in regards to tariffs, analysts say",
    "description": "Analysts have offered multiple theories as to why the Nintendo Switch 2 costs so much in the United States.",
    "link": "https://www.techradar.com/gaming/the-switch-2s-usd450-price-tag-is-a-strategic-balancing-act-and-nintendo-could-be-building-in-a-buffer-in-regards-to-tariffs-analysts-say",
    "timestamp": "2025-04-04T14:15:14Z"
  },
  {
    "title": "The global impact of Donald Trump’s new tariffs and rising recession risks",
    "description": "President Donald Trump’s sweeping new tariffs on imports threaten to disrupt global trade and push the US economy into recession. With rising inflation and potential retaliatory measures from major trading partners like China and the EU, businesses and consum…",
    "link": "https://economictimes.indiatimes.com/news/international/us/the-global-impact-of-donald-trumps-new-tariffs-and-rising-recession-risks/articleshow/119984298.cms",
    "timestamp": "2025-04-04T14:15:06Z"
  },
  {
    "title": "Trump Grants TikTok a Second 75-Day Extension, Pushing Deadline to Mid-June",
    "description": "“The deal requires more work to ensure all necessary approvals are signed,” Trump said.",
    "link": "https://www.adweek.com/media/trump-grants-tiktok-a-second-75-day-extension-pushing-deadline-to-mid-june/",
    "timestamp": "2025-04-04T14:15:05Z"
  },
  {
    "title": "The Magnificent 7 stocks slide again and the Dow drops 1,100 points as China retaliates in trade war",
    "description": "The Magnificent 7 stocks all dropped as the S&P 500, the Nasdaq Composite, and the Dow Jones Industrial Average opened lower after China retaliated against new U.S. tariffs. Shares narrowed pre-market declines after March employment numbers came in better tha…",
    "link": "https://qz.com/mag7-stocks-fall-trade-war-tesla-nvidia-jobs-1851774739",
    "timestamp": "2025-04-04T14:15:00Z"
  },
  {
    "title": "Republican Working to Crack Down on People Threatening ICE Online",
    "description": "Senator Katie Britt told Newsweek that threats against ICE agents \"should be prosecuted to the fullest extent of the law.\"",
    "link": "https://www.newsweek.com/republican-crack-down-threats-ice-online-2055286",
    "timestamp": "2025-04-04T14:14:55Z"
  },
  {
    "title": "The EU could hit Wall Street where it hurts with its tariff response — the tech giants",
    "description": "The European Union has stressed that it is considering all options in its countermeasures — but restrictions on Big Tech would hurt its own consumers.",
    "link": "https://www.cnbc.com/2025/04/04/how-the-eu-could-target-us-big-tech-with-its-tariff-response.html",
    "timestamp": "2025-04-04T14:13:01Z"
  },
  {
    "title": "NSA director fired after Trump’s meeting with right-wing influencer Laura Loomer",
    "description": "General Timothy Haugh, the director of the National Security Agency and US Cyber Command, was fired on Thursday, according to a report from The Washington Post. His removal reportedly occurred just one day after right-wing activist Laura Loomer pushed for his…",
    "link": "https://www.theverge.com/news/643425/nsa-director-timothy-haugh-removal-laura-loomer",
    "timestamp": "2025-04-04T14:12:02Z"
  },
  {
    "title": "Nasdaq set to confirm bear market as Trump tariffs trigger recession fears",
    "description": "In This Article:\n(Reuters) - The tech-heavy Nasdaq Composite index was set to confirm it was in a bear market on Friday, down more than 20% from a recent record high, as investors fled riskier assets on fears that tariffs imposed by President Donald Trump cou…",
    "link": "https://biztoc.com/x/8cdae5c549df21fd",
    "timestamp": "2025-04-04T14:11:57Z"
  },
  {
    "title": "Trump’s tariffs expected to raise new-home costs by $9,200",
    "description": "Homebuilders are responding to President Donald Trump's new \"Liberation Day\" tariffs, and say that although the worst-case scenario was avoided, the new trade policy will inevitably raise the cost to build homes.",
    "link": "https://nypost.com/2025/04/04/real-estate/trumps-tariffs-expected-to-raise-new-home-costs-by-9200/",
    "timestamp": "2025-04-04T14:11:55Z"
  },
  {
    "title": "How Europe Could Circumvent Trump's DEI Crackdown",
    "description": "European leaders may be planning a legal challenge to Trump's anti-diversity, equity and inclusion program.",
    "link": "https://www.newsweek.com/president-donald-trump-dei-diversity-program-european-union-denmark-wto-challenge-2055293",
    "timestamp": "2025-04-04T14:11:45Z"
  },
  {
    "title": "Trump Chimes in on Jobs Report",
    "description": "3 min ago\nTrump Chimes in on Jobs Report\nThe jobs report might be backward-looking, but that’s not stopping President Donald Trump from trying to tie last month's hiring gains to his current policies.\nThe Bureau of Labor Statistics said the U.S. economy added…",
    "link": "https://biztoc.com/x/e8279c6d46afa9d4",
    "timestamp": "2025-04-04T14:11:32Z"
  },
  {
    "title": "Trump’s tariffs are sending ultra-rich investors to Europe and Asia: ‘The world has changed in the last 3 months’",
    "description": "Though President Donald Trump has said his aggressive tariff strategy, unveiled this week, will make the markets \"boom,\" it has so far resulted in a rout, with U.S. equity markets suffering their worst week since March 2020 and more pain likely on the way. An…",
    "link": "https://biztoc.com/x/f868d2d51d3a5b9b",
    "timestamp": "2025-04-04T14:11:18Z"
  },
  {
    "title": "Mark Cuban sounds alarm on how consumers should handle tariffs",
    "description": "President Donald Trump shook the whole nation after he recently enforced a bold new set of tariffs on foreign goods.\nTariffs are taxes companies pay to import goods from overseas, and the extra cost is often passed down to consumers through price increases.\n…",
    "link": "https://biztoc.com/x/fa7a20c532f1a895",
    "timestamp": "2025-04-04T14:11:18Z"
  },
  {
    "title": "Does Trump Have a Plan B If His Tariffs Plunge Us Into Recession?",
    "description": "Treasury Secretary Scott Bessent cautioned last month that Americans will likely experience \"a detox period\" after President Donald Trump implements his wide-ranging tariffs. What are we detoxing from, exactly? From an abundance of affordable goods and the wo…",
    "link": "https://freerepublic.com/focus/f-news/4308807/posts",
    "timestamp": "2025-04-04T14:11:15Z"
  },
  {
    "title": "What To Do If Border Police Ask To Search Your Phone",
    "description": "Border phone searches are in the news a lot lately. Last month, a French scientist was allegedly blocked from coming to a conference in Houston after U.S. Customs and Border Protection (CBP) found statements against President Donald Trump on his phone. A few …",
    "link": "https://biztoc.com/x/43c3bc6123a0a750",
    "timestamp": "2025-04-04T14:11:10Z"
  },
  {
    "title": "Temu Parent PDD Stock Tumbles As Trump's New Tariffs Threaten Chinese E-Commerce",
    "description": "Stocks of U.S.-listed Chinese companies, including Alibaba Group Holding (NYSE:BABA), PDD Holdings Inc (NASDAQ:PDD), Baidu, Inc (NASDAQ:BIDU), and JD.com, Inc (NASDAQ:JD), are trading lower Friday as markets turn jittery after President Donald Trump announces…",
    "link": "https://biztoc.com/x/2d61baf12f9eb6b6",
    "timestamp": "2025-04-04T14:11:03Z"
  },
  {
    "title": "Jim Cramer: Trump tariff numbers ‘do not make any sense’",
    "description": "",
    "link": "https://biztoc.com/x/14bb3463c2582ff2",
    "timestamp": "2025-04-04T14:10:53Z"
  },
  {
    "title": "The deportation of a Maryland father sends fear through Salvadoran communities in the US | CNN",
    "description": "A Maryland mother recently received two calls: One was from her husband, who said he had been pulled over after finishing his construction shift. The other was from Homeland Security, telling her she had just 10 minutes to pick up the couple’s 5-year-old son …",
    "link": "https://www.cnn.com/2025/04/04/us/maryland-father-el-salvador-immigrants/index.html",
    "timestamp": "2025-04-04T14:10:29Z"
  },
  {
    "title": "Texas Education Change Edges Closer",
    "description": "The Texas House Public Education Committee on Thursday voted to advance school voucher legislation to the House floor.",
    "link": "https://www.newsweek.com/texas-education-change-closer-2055295",
    "timestamp": "2025-04-04T14:09:51Z"
  },
  {
    "title": "Hedge funds are scrambling to get tariff data",
    "description": "Country-specific datasets, particularly for nations jousting with Trump, such as Canada, are in high demand.",
    "link": "https://www.businessinsider.com/hedge-funds-demanding-data-that-will-explain-the-tariffs-2025-4",
    "timestamp": "2025-04-04T14:09:00Z"
  },
  {
    "title": "FACT CHECK: Viral Threads Image Does Not Show Authentic X Post From Musk",
    "description": "A viral image shared on Threads purports to show an X post from Elon Musk claiming the Department of Government Efficiency (DOGE) team found “tens of millions of dollars spent on golf by one government official.”   View on Threads   Verdict: False The purport…",
    "link": "https://checkyourfact.com/2025/04/04/fact-check-threads-image-authentic-post-musk/",
    "timestamp": "2025-04-04T14:08:50Z"
  },
  {
    "title": "Obama urges Americans to 'possibly sacrifice' in resisting Trump policies",
    "description": "Former President Barack Obama told a crowd of people on Thursday night that they might need to \"possibly sacrifice\" in resisting President Donald Trump's policies.",
    "link": "https://www.foxnews.com/politics/obama-urges-citizens-possibly-sacrifice-resisting-president-trump-policies",
    "timestamp": "2025-04-04T14:08:50Z"
  },
  {
    "title": "MSNBC hosts burst into laughter at Trump official's inability to answer tariff questions",
    "description": "Donald Trump's treasury secretary's inability to answer questions about the president's sweeping tariffs announcement on Tuesday drew gales of laughter from the hosts on MSNBC's \"Morning Joe\" on Friday morning.The segment began with a Comedy Central \"The Dail…",
    "link": "https://www.rawstory.com/bessent-tariffs/",
    "timestamp": "2025-04-04T14:08:24Z"
  },
  {
    "title": "Sell-off worsens worldwide and Dow drops after China retaliates against Trump' tariffs",
    "description": "Stock markets worldwide are careening even lower after China matched President Trump’s big raise in tariffs in an escalating trade war.",
    "link": "https://www.wtae.com/article/global-stock-markets-fall-us-china-trade-war/64387555",
    "timestamp": "2025-04-04T14:08:19Z"
  },
  {
    "title": "The rise (and fall?) of Marine Le Pen",
    "description": " Listen to Sky News Daily on your podcast app ",
    "link": "https://news.sky.com/story/the-rise-and-fall-of-marine-le-pen-13341817",
    "timestamp": "2025-04-04T14:08:00Z"
  },
  {
    "title": "Vladimir Putin spoke English in rare moment in plea for people to help Russia",
    "description": "A video clip shows Russian President Vladimir Putin speaking English, a language which the leader is rarely seen speaking.",
    "link": "https://www.ladbible.com/news/world-news/vladimir-putin-speaking-english-737689-20250404",
    "timestamp": "2025-04-04T14:07:57Z"
  },
  {
    "title": "Seth Meyers Marvels at ‘Existential Crisis’ Reporters Are Having Over This Trump Tariff Detail | Video",
    "description": "The NBC host worries we're pretty close to seeing Wolf Blitzer broadcasting in his pajamas\nThe post Seth Meyers Marvels at ‘Existential Crisis’ Reporters Are Having Over This Trump Tariff Detail | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-tariffs-explained-seth-meyers-reaction/",
    "timestamp": "2025-04-04T14:07:01Z"
  },
  {
    "title": "What To Do If Border Police Ask To Search Your Phone",
    "description": "Know how much the law does—and doesn’t—protect your privacy rights.",
    "link": "https://reason.com/2025/04/04/what-to-do-if-border-police-ask-to-search-your-phone/",
    "timestamp": "2025-04-04T14:06:30Z"
  },
  {
    "title": "Canadian Union Responds to Trump's Tariffs: 'We're Fighting for Our Lives'",
    "description": "One union president told Newsweek that Trump's tariffs could \"devastate\" the auto industry in Canada and the U.S.",
    "link": "https://www.newsweek.com/canadian-union-responds-trump-tariffs-2055300",
    "timestamp": "2025-04-04T14:06:04Z"
  },
  {
    "title": "Stocks Tumble as Tariff War Overshadows Solid Jobs: Markets Wrap",
    "description": "Stocks tumbled around the world, bonds surged and oil hit a four-year low, with China stepping up its the fight against President Donald Trump’s trade war to intensify concerns about the economy despite signs of a solid jobs market.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-tumble-as-tariff-war-overshadows-solid-jobs-markets-wrap",
    "timestamp": "2025-04-04T14:05:22Z"
  },
  {
    "title": "This Analyst Is Recommending Duke Energy (DUK) Amid Latest Tariff Volatility – Here’s Why",
    "description": "We recently published a list of 10 Stocks Everyone is Talking About After Trump’s New Tariffs. In this article, we are going to take a look at where Duke...",
    "link": "https://finance.yahoo.com/news/analyst-recommending-duke-energy-duk-140445677.html",
    "timestamp": "2025-04-04T14:04:45Z"
  },
  {
    "title": "Analyst Cuts Tesla (TSLA) Price Target Amid ‘Commoditized” FSD Product",
    "description": "We recently published a list of 10 Stocks Everyone is Talking About After Trump’s New Tariffs. In this article, we are going to take a look at where Tesla...",
    "link": "https://finance.yahoo.com/news/analyst-cuts-tesla-tsla-price-140409380.html",
    "timestamp": "2025-04-04T14:04:09Z"
  },
  {
    "title": "Here Come The Layoffs!",
    "description": "Whee!",
    "link": "https://www.wonkette.com/p/here-come-the-layoffs",
    "timestamp": "2025-04-04T14:02:40Z"
  },
  {
    "title": "Why Battalion Oil Corporation (BATL) is Gaining This Week?",
    "description": "We recently compiled a list of the Energy Stocks that are Gaining This Week. In this article, we are going to take a look at where Battalion Oil Corporation ...",
    "link": "https://finance.yahoo.com/news/why-battalion-oil-corporation-batl-140201894.html",
    "timestamp": "2025-04-04T14:02:01Z"
  },
  {
    "title": "Jonathan Majors Is Looking for Redemption. Will He Find It?",
    "description": "The actor wants back in the industry’s good graces, but his new movie, \"Magazine Dreams\"—and the surrounding press tour—isn’t enough.",
    "link": "https://www.theatlantic.com/culture/archive/2025/04/magazine-dreams-review-jonathan-majors/682292/",
    "timestamp": "2025-04-04T14:01:18Z"
  },
  {
    "title": "Sell-off worsens worldwide and Dow drops 1,000 after China retaliates against Trump tariffs",
    "description": "Stock markets worldwide are careening even lower after China matched President Donald Trump’s big raise in tariffs in an escalating trade war.",
    "link": "https://www.ksat.com/business/2025/04/04/asian-stocks-slid-after-wall-street-surrendered-to-a-hit-by-trumps-tariffs/",
    "timestamp": "2025-04-04T14:00:55Z"
  },
  {
    "title": "PHOTOS: Biden’s ‘ambitious climate goals’ go down in literal flames by popular American beach",
    "description": "A major part of a first-of-its-kind green energy project, touted by Biden administration, is now lying in ruins and polluting some of America’s beautiful ocean and seashore in Massachusetts.",
    "link": "https://www.foxnews.com/politics/photos-bidens-ambitious-climate-goals-go-down-literal-flames-popular-american-beach",
    "timestamp": "2025-04-04T14:00:48Z"
  },
  {
    "title": "Gold snaps 5-day winning streak, plunges Rs 1,350 to Rs 93,000 per 10 g",
    "description": "Gold prices plunged by Rs 1,350 to Rs 93,000 per 10 grams, bringing an end to its five-day record rally, in the national capital on Friday amid weak trend in the international markets, according to the All India Sarafa Association. On Thursday, the precious m…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-snaps-5-day-winning-streak-plunges-rs-1350-to-rs-93000-per-10-g/articleshow/119983965.cms",
    "timestamp": "2025-04-04T14:00:14Z"
  },
  {
    "title": "New and used car prices set to rise due to Trump tariffs: experts",
    "description": "Experts say U.S. tariffs on Canadian auto imports will drive prices higher for both new and used cars. Sean Mactavish, CEO of used-car marketplace Autozen, says prices are already rising on some used cars as sellers anticipate buyers looking for a better deal…",
    "link": "https://financialpost.com/pmn/new-and-used-car-prices-set-to-rise-due-to-trump-tariffs-experts",
    "timestamp": "2025-04-04T14:00:07Z"
  },
  {
    "title": "Bitcoin Nears 50% Breakout, But ‘Ichimoku Cloud’ Presents Key Resistance – Details",
    "description": "Bitcoin (BTC) could be mirroring a bullish setup from 2023, when it surged by more than 50% within weeks after an extended period of consolidation. However, the flagship cryptocurrency now faces strong resistance from the Ichimoku Cloud, which could derail it…",
    "link": "https://bitcoinist.com/bitcoin-nears-50-breakout-but-ichimoku-cloud-presents-key-resistance-details/",
    "timestamp": "2025-04-04T14:00:04Z"
  },
  {
    "title": "Why AleAnna, Inc. (ANNA) is Gaining This Week?",
    "description": "We recently compiled a list of the Energy Stocks that are Gaining This Week. In this article, we are going to take a look at where AleAnna, Inc. (NASDAQ:ANNA...",
    "link": "https://finance.yahoo.com/news/why-aleanna-inc-anna-gaining-140002434.html",
    "timestamp": "2025-04-04T14:00:02Z"
  },
  {
    "title": "The journey of an Ontario-grown cucumber into U.S. cities offers a glimpse into delicate supply chain",
    "description": "English cucumbers grown in a greenhouse in Southern Ontario are finally cleared for travel after months of uncertainty.\nOn Wednesday, U.S. President Donald Trump exempted all goods compliant with the United States-Mexico-Canada trade agreement after threateni…",
    "link": "https://biztoc.com/x/52d2beb3dde407a2",
    "timestamp": "2025-04-04T14:00:02Z"
  },
  {
    "title": "European auto stocks plunge amid tariff worries",
    "description": "Shares of European automakers tumbled on Friday as concerns and insecurity in the auto industry rose after United States President Donald Trump slapped 25% tariffs on all non-US-made vehicles.Followin...",
    "link": "https://biztoc.com/x/be0e41b091fd38ad",
    "timestamp": "2025-04-04T14:00:02Z"
  },
  {
    "title": "Donald Trump Predicts A Market Boom With $6-7 Trillion In Inflows After The Selloff; Elon Musk, Mark Zuckerberg, And Jensen Huang Lost $34 Billion In A Single Day; Eric Trump Suggested Buying Bitcoin Below $90,000, But It Hasn't Surged – Top Headlines While the U.S. Slept",
    "description": "US Politics\nTrump’s Administration Backs Biden’s Legacy Project To Secure African Resources\nDonald Trump Says ‘Market Is Going To Boom,’ Claiming ‘$6-7 Trillion’ Worth Of Inflows Will Come After The Worst Selloff Since 2020\nEric Trump Says This Country Will W…",
    "link": "https://biztoc.com/x/2d335679dd0d29bd",
    "timestamp": "2025-04-04T14:00:00Z"
  },
  {
    "title": "Cardinals vs. Red Sox prediction: Walker Buehler will propel Boston",
    "description": "Stitches predicts Walker Buehler will lead the Red Sox past the Cardinals on Friday afternoon at Fenway Park.",
    "link": "https://nypost.com/2025/04/04/betting/cardinals-vs-red-sox-prediction-walker-buehler-will-propel-boston/",
    "timestamp": "2025-04-04T14:00:00Z"
  },
  {
    "title": "Dow Tumbles 1,100 Points; US Economy Adds 228,000 Jobs In March",
    "description": "U.S. stocks traded lower this morning, with the Dow Jones index dipping more than 1,100 points on Friday. China unveiled a retaliatory 34% tariff on U.S. goods—mirroring the rate announced by President Donald Trump on Wednesday—deepening fears of a full-blown…",
    "link": "https://biztoc.com/x/417f207f0dd80c0b",
    "timestamp": "2025-04-04T13:59:59Z"
  },
  {
    "title": "S&P 500 Opens 2.4% Lower After China's Response To Trump Tarrifs",
    "description": "Wall Street stocks opened sharply lower Friday, shrugging off solid US hiring data and extending a rout after China announced hefty tariffs in response to President Donald Trump&#039;s levies.",
    "link": "https://www.ndtv.com/world-news/s-p-500-opens-2-4-lower-after-chinas-response-to-trump-tarrifs-8087759",
    "timestamp": "2025-04-04T13:59:49Z"
  },
  {
    "title": "US Stocks Open Sharply Down as China Hits Trump with Huge Retaliatory Tariffs: Live Updates",
    "description": "Stocks plummeted for a second consecutive day as China announced it would impose a 34% tariff on American goods in response to President Donald Trump's levies on the Asian nation.",
    "link": "https://biztoc.com/x/b4ab7384c40c6552",
    "timestamp": "2025-04-04T13:59:47Z"
  },
  {
    "title": "Why Comstock Resources, Inc. (CRK) is Gaining This Week?",
    "description": "We recently compiled a list of the Energy Stocks that are Gaining This Week. In this article, we are going to take a look at where Comstock Resources, Inc. (...",
    "link": "https://finance.yahoo.com/news/why-comstock-resources-inc-crk-135946533.html",
    "timestamp": "2025-04-04T13:59:46Z"
  },
  {
    "title": "CNN’s Scott Jennings Says Trump ‘Betting His Presidency’ On Tariffs — Refuses To Say They’re ‘A Good Bet’",
    "description": "CNN's Scott Jennings said Trump is \"betting his presidency\" on tariff policy that has fueled a global market selloff — then refused to call it a \"good bet.\"\nThe post CNN’s Scott Jennings Says Trump ‘Betting His Presidency’ On Tariffs — Refuses To Say They’re …",
    "link": "https://www.mediaite.com/news/cnns-scott-jennings-says-trump-betting-his-presidency-on-tariffs-refuses-to-say-theyre-a-good-bet/",
    "timestamp": "2025-04-04T13:59:13Z"
  },
  {
    "title": "Why TechnipFMC plc (FTI) is Gaining This Week?",
    "description": "We recently compiled a list of the Energy Stocks that are Gaining This Week. In this article, we are going to take a look at where TechnipFMC plc (NYSE:FTI) ...",
    "link": "https://finance.yahoo.com/news/why-technipfmc-plc-fti-gaining-135855399.html",
    "timestamp": "2025-04-04T13:58:55Z"
  },
  {
    "title": "\"They Played It Wrong, Panicked\": Trump On China's Tariff Retaliation",
    "description": "President Donald Trump goaded China on Friday, saying the US rival had &quot;panicked&quot; after it announced counter-tariffs in response to his global trade war.",
    "link": "https://www.ndtv.com/world-news/they-played-it-wrong-they-panicked-trump-on-china-imposing-34-tariff-on-us-goods-8087750",
    "timestamp": "2025-04-04T13:58:36Z"
  },
  {
    "title": "High anxiety over softwood lumber despite tone change from U.S.",
    "description": "David Eby is encouraged to see shifting tone in Trump's talk, but concerns remain over how tariffs could devastate softwood lumber. Read on",
    "link": "https://financialpost.com/commodities/agriculture/high-anxiety-over-softwood-lumber",
    "timestamp": "2025-04-04T13:57:23Z"
  },
  {
    "title": "Trump Reacts to China's Huge Retaliatory Tariffs on US",
    "description": "China said it would impose a 34% tariff in response to the U.S.",
    "link": "https://www.newsweek.com/trump-reacts-china-tariffs-2055403",
    "timestamp": "2025-04-04T13:56:24Z"
  },
  {
    "title": "Private Equity Shares Tank Based on Trump Tariffs; Private Equity and and Credit Crises Coming?",
    "description": "How the Trump tariffs will whack private equity, and even more so, investors like CalPERS and other public pension funds.",
    "link": "https://www.nakedcapitalism.com/2025/04/private-equity-shares-tank-based-on-trump-tariffs-private-equity-and-and-credit-crises-coming.html",
    "timestamp": "2025-04-04T13:55:11Z"
  },
  {
    "title": "Sec of State Rubio and Danish Foreign Minister Post VERY Different Takes Following Greenland Meeting",
    "description": "Are you curious about the tenor of Secretary of State Marco Rubio's meeting with the Danish Foreign Minister? Well, it depends on whom you ask.\nThe post Sec of State Rubio and Danish Foreign Minister Post VERY Different Takes Following Greenland Meeting first…",
    "link": "https://www.mediaite.com/politics/sec-of-state-rubio-and-danish-foreign-minister-post-very-different-takes-following-greenland-meeting/",
    "timestamp": "2025-04-04T13:54:35Z"
  },
  {
    "title": "ET Market Watch: Why the stock market fell today: 4 reasons behind Rs 9.5 lakh crore wealth wipeout",
    "description": "Sensex plunging by 930 points, which is about 1.22%, closing at 75,364. The Nifty50 also saw a notable drop, shedding 345 points or 1.49%, to end at 22,904.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/et-market-watch-why-the-stock-market-fell-today-4-reasons-behind-rs-9-5-lakh-crore-wealth-wipeout/podcast/119983754.cms",
    "timestamp": "2025-04-04T13:52:44Z"
  },
  {
    "title": "Thousands of Finns join US boycott group on Facebook",
    "description": "Many people in Europe consider the Trump administration's policies as attacks on cultural institutions and members of minority groups.",
    "link": "https://yle.fi/a/74-20153995",
    "timestamp": "2025-04-04T13:51:41Z"
  },
  {
    "title": "China hits back with 34 percent tariff on U.S. imports as world weighs how to deal with Trump’s hikes",
    "description": "As world markets wallowed in heavy losses Friday, Taiwan's president promised to provide support to industries most vulnerable to the 32% tariffs Trump ordered in his \"Liberation Day\" reciprocal tariffs announcement.",
    "link": "https://www.pbs.org/newshour/politics/china-hits-back-with-34-percent-tariff-on-u-s-imports-as-world-weighs-how-to-deal-with-trumps-hikes",
    "timestamp": "2025-04-04T13:51:38Z"
  },
  {
    "title": "The 1600: Something New is Coming",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics editor Carlo Versano.",
    "link": "https://www.newsweek.com/1600-something-new-coming-2055391",
    "timestamp": "2025-04-04T13:51:21Z"
  },
  {
    "title": "Tariffs and Inflation for the US, Disruption for Indian Supply Chains",
    "description": "India must work at making India great as opposed to bending over backwards to help Trump in Making America Great Again.",
    "link": "https://thediplomat.com/2025/04/tariffs-and-inflation-for-the-us-disruption-for-indian-supply-chains/",
    "timestamp": "2025-04-04T13:51:00Z"
  },
  {
    "title": "'Who is this elusive Hank Tough?' Observers mercilessly mock Trump's now-deleted typo post",
    "description": "President Donald Trump had a \"covfefe\" moment Friday when he posted to Truth Social about the better-than-expected jobs numbers and tried to encourage Americans to keep the faith. That's when his keyboard got him into a bit of trouble.\"GREAT JOBS NUMBERS, FAR…",
    "link": "https://www.rawstory.com/trump-typo-hank-tough/",
    "timestamp": "2025-04-04T13:50:10Z"
  },
  {
    "title": "China hits back hard in global trade war with tariffs on US goods (Reuters)",
    "description": "Reuters:\nChina hits back hard in global trade war with tariffs on US goods  —  China announced additional tariffs of 34% on U.S. goods on Friday, the most serious escalation in a trade war with President Donald Trump that has fed fears of a recession and trig…",
    "link": "https://www.memeorandum.com/250404/p33",
    "timestamp": "2025-04-04T13:50:01Z"
  },
  {
    "title": "Wall Street opens sharply lower and Nasdaq heads toward bear market as China hits back at US with 34pc tariff",
    "description": "US stocks opened sharply lower on Friday, with the Nasdaq Composite heading into a bear market, after China imposed fresh tariffs on all US goods in response to the Trump administration's sweeping levies, escalating a global trade war.",
    "link": "https://www.independent.ie/business/wall-street-opens-sharply-lower-and-nasdaq-heads-toward-bear-market-as-china-hits-back-at-us-with-34pc-tariff/a253126916.html",
    "timestamp": "2025-04-04T13:49:40Z"
  },
  {
    "title": "US Stocks Open Sharply Down as China Hits Trump with Huge Retaliatory Tariffs: Live Updates",
    "description": "Stocks plummeted for a second consecutive day as China announced it would impose a 34% tariff on American goods in response to President Donald Trump's levies on the Asian nation.",
    "link": "https://www.newsweek.com/china-hits-trump-huge-tariffs-us-imports-global-stock-rout-deepens-live-updates-2055387",
    "timestamp": "2025-04-04T13:49:06Z"
  },
  {
    "title": "'A scary place': Jason Stanley on leaving Trump's America",
    "description": "Philosopher Jason Stanley is among several critics of President Donald Trump who have left Yale University, and the US, to work and live in Canada. He equates the new leadership with \"fascism.\"",
    "link": "https://www.dw.com/en/a-scary-place-jason-stanley-on-leaving-trumps-america/a-72139576",
    "timestamp": "2025-04-04T13:49:00Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "U.S. stock futures are declining sharply after indexes plummeted on tariffs announcements from President Donald Trump; China retaliates with a 34% tariff on U.S. imports; job growth is seen having slowed slightly in today's March labor report; Intel (INTC) an…",
    "link": "https://biztoc.com/x/4223914ca051d2df",
    "timestamp": "2025-04-04T13:48:45Z"
  },
  {
    "title": "‘FREE MARINE LE PEN!’: Trump Voices Support For French Right-Wing Politician After Prison Sentence, Ban From Elections",
    "description": "President Donald Trump voiced support for French National Rally figurehead Marine Le Pen after she was banned from running in elections and handed a prison sentence.",
    "link": "https://dailycaller.com/2025/04/04/free-marine-le-pen-trump-voices-support-for-french-right-wing-politician-after-prison-sentence-ban-from-elections/",
    "timestamp": "2025-04-04T13:48:37Z"
  },
  {
    "title": "Sell-Off Worsens For Markets Worldwide After China Retaliates Against Trump's Tariffs",
    "description": "The S&P 500 dropped 2.7% early Friday, coming off its worst day since COVID wrecked the global economy in 2020.",
    "link": "https://www.huffpost.com/entry/sell-off-worsens-markets-worldwide-after-china-retaliates-against-trumps-tariffs_n_67efe088e4b092d8be188adb",
    "timestamp": "2025-04-04T13:48:18Z"
  },
  {
    "title": "President Trump fired the head of U.S. Cyber Command and NSA",
    "description": "President Trump fired Gen. Timothy Haugh as head of U.S. Cyber Command and NSA President Donald Trump this week fired Air Force Gen. Timothy Haugh, who served as the head of U.S. Cyber Command and the National Security Agency. Gen. Haugh’s was fired just over…",
    "link": "https://securityaffairs.com/176196/intelligence/president-trump-fired-the-head-of-u-s-cyber-command-and-nsa.html",
    "timestamp": "2025-04-04T13:48:17Z"
  },
  {
    "title": "Mike Waltz under increasing pressure as Donald Trump fires national security officials",
    "description": "Maga critics circle around hawkish foreign policy adviser who was at centre of ‘Signalgate’ fiasco",
    "link": "https://www.irishtimes.com/world/us/2025/04/04/mike-waltz-under-increasing-pressure-as-donald-trump-fires-national-security-officials/",
    "timestamp": "2025-04-04T13:48:05Z"
  },
  {
    "title": "China files complaint with WTO over new US tariffs",
    "description": "China has lodged a formal complaint with the World Trade Organization in response to new U.S. tariffs, which China asserts violate WTO regulations. This move comes as China introduces additional retaliatory tariffs of 34% on U.S. goods, and imposes export con…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-files-complaint-with-wto-over-new-us-tariffs/articleshow/119983620.cms",
    "timestamp": "2025-04-04T13:47:45Z"
  },
  {
    "title": "Danish leader tells the US ‘you cannot annex another country’ as she visits Greenland",
    "description": "The Danish Prime Minister said that, if the U.S. wants to strengthen security in the Arctic, “let us do so together.”",
    "link": "https://www.bostonherald.com/2025/04/04/danish-leader-greenland-us-warning/",
    "timestamp": "2025-04-04T13:46:50Z"
  },
  {
    "title": "Trump declares his trade policies 'will never change'",
    "description": "President Donald Trump says he won’t back down from his controversial trade policies, even as Wall Street predicts greater economic pain as a result. Read more...",
    "link": "https://qz.com/donald-trump-tariffs-trade-policies-never-change-1851774740",
    "timestamp": "2025-04-04T13:45:00Z"
  },
  {
    "title": "What is Trump Card? $5 million 'gold card' US visa unveiled by President Donald Trump",
    "description": "Donald Trump has unveiled USA's first \"gold card\". Here are important details about the residency permit sold for $5 million each.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-trump-card-5-million-gold-card-us-visa-unveiled-by-president-donald-trump/articleshow/119983428.cms",
    "timestamp": "2025-04-04T13:43:17Z"
  },
  {
    "title": "Europe and Canada say they’ll spend more on defense, but are cool on US demands",
    "description": "BRUSSELS (AP) — European NATO allies and Canada on Friday said they are willing to ramp up defense spending but are cool on American demands for the size of their military budgets, particularly given U.S. President Donald Trump’s readiness to draw closer to R…",
    "link": "https://financialpost.com/pmn/europe-and-canada-say-theyll-spend-more-on-defense-but-are-cool-on-us-demands",
    "timestamp": "2025-04-04T13:42:12Z"
  },
  {
    "title": "Explained: Where Things Stand In US-China Trade War",
    "description": "China has hit back against US President Donald Trump&#039;s &quot;liberation day&quot; tariffs, slapping 34 percent levies on all imports of American goods.",
    "link": "https://www.ndtv.com/world-news/explained-where-things-stand-in-us-china-trade-war-8087629",
    "timestamp": "2025-04-04T13:41:29Z"
  },
  {
    "title": "Trump Already Hit With Lawsuit Over Tariffs—From Unexpected Group",
    "description": "A right-wing group with financial ties to Leonard Leo and the Koch network is aiming to halt Donald Trump’s tariff plan.\r\nThe New Civil Liberties Alliance sued the president Thursday, claiming that Trump’s decision to invoke the International Emergency Econom…",
    "link": "https://newrepublic.com/post/193612/donald-trump-lawsuit-tariffs-far-right-group",
    "timestamp": "2025-04-04T13:40:29Z"
  }
]