[
  {
    "title": "Exclusive: Greenland Business Declines Vance Visit Over 'MAGA Event' Fears",
    "description": "The travel agency manager expanded on why the offer of a visit from U.S. second lady Usha Vance was declined.",
    "link": "https://www.newsweek.com/exclusive-greenland-business-usha-vance-visit-jd-maga-fears-2051339",
    "timestamp": "2025-03-27T13:43:09Z"
  },
  {
    "title": "Flight Bookings From Canada to the US Plummet Over 70%",
    "description": "Amid rising trade tensions, boycotts and travel advisories, Canadians appear to be foregoing trips to the U.S.",
    "link": "https://www.newsweek.com/canada-us-flight-bookings-fall-70-percent-2051327",
    "timestamp": "2025-03-27T13:42:36Z"
  },
  {
    "title": "WSJ Editorial Board's Work to Undermine Donald Trump Has Persisted for a Decade",
    "description": "The Wall Street Journal Editorial Board is continuing its attempts to undermine President Donald Trump and his administration, often through thinly-veiled “advice” and “suggestions” to the president to obscure their contempt for his America First agenda.\nThe …",
    "link": "https://www.breitbart.com/the-media/2025/03/27/wsj-editorial-boards-work-to-undermine-donald-trump-has-persisted-for-a-decade/",
    "timestamp": "2025-03-27T13:42:34Z"
  },
  {
    "title": "Tánaiste warns ‘economic shock’ from US tariffs comes at ‘critical juncture’ for war in Ukraine",
    "description": "Simon Harris cautioned that the ‘economic shock’ will also materialise as Ireland grapples with ‘housing shortages and infrastructure deficits’.",
    "link": "https://www.thejournal.ie/tanaiste-warns-us-tariffs-comes-at-critical-juncture-for-war-in-ukraine-6660890-Mar2025/",
    "timestamp": "2025-03-27T13:41:29Z"
  },
  {
    "title": "US stocks drop slightly in 1st trading since Trump's auto tariffs announced",
    "description": "The tariffs escalate a global trade war, prompting forecasts of higher car prices.",
    "link": "https://abcnews.go.com/Business/us-stocks-drop-slightly-1st-trading-trumps-auto/story?id=120210860",
    "timestamp": "2025-03-27T13:41:28Z"
  },
  {
    "title": "Oil executives bluntly criticize Trump tariffs and 'drill, baby, drill' in anonymous survey",
    "description": "Oil executives are warning that President Donald Trump's tariffs and his \"drill, baby, drill\" message have created uncertainty in energy markets that is already affecting investment.\nThe executives, shielded by anonymity, bluntly criticized Trump in their res…",
    "link": "https://biztoc.com/x/4b9cf3355cc996ab",
    "timestamp": "2025-03-27T13:40:29Z"
  },
  {
    "title": "Tariff Nation",
    "description": "New tariffs imposed: Yesterday, President Donald Trump announced he would impose a 25 percent tariff on all imported cars starting April 3, and car parts starting May 3. \nHalf of cars sold to Americans are imported. Those that aren't imported include imported…",
    "link": "https://biztoc.com/x/2b3ff093717d9f5d",
    "timestamp": "2025-03-27T13:40:28Z"
  },
  {
    "title": "Must a Palestinian Win an Oscar for the World to Care When He’s Attacked?",
    "description": "Sleman Altehe\n\n\n\nThe assault and arrest of Ballal Hamdan is horrendous, but the framing of the incident reproduces the idea that some lives are more worthy of defense than others.\r\n\n\r\n\n\nThe post Must a Palestinian Win an Oscar for the World to Care When He’s …",
    "link": "https://www.thenation.com/article/world/ballal-hamdan-attack-arrest/",
    "timestamp": "2025-03-27T13:40:21Z"
  },
  {
    "title": "RFK Jr. is slashing 10,000 jobs at HHS",
    "description": "With the announcement, roughly 20,000 federal workers will have left the Department of Health and Human Services since Donald Trump took office.",
    "link": "https://www.businessinsider.com/rfk-slashing-10-000-jobs-at-hhs-2025-3",
    "timestamp": "2025-03-27T13:38:47Z"
  },
  {
    "title": "U.S. cities in states won by Donald Trump would suffer most from tariffs, analysis finds",
    "description": "Canadian Chamber of Commerce finds San Antonio, Tex. and Detroit top list of 41 U.S. metro areas most exposed to trade with Canada. Read on.",
    "link": "https://financialpost.com/news/economy/tariffs-hurt-us-cities-trump-voters",
    "timestamp": "2025-03-27T13:38:46Z"
  },
  {
    "title": "The Signal Leak: US Incompetence Meets Europe’s Inconsequence",
    "description": "The most shocking scandal to date of the two-month-old administration of US President Donald Trump broke this week when Jeffrey Goldberg, editor-in-chief of The Atlantic, revealed that he had been invited to participate in a private text thread launched on Si…",
    "link": "https://www.fairobserver.com/politics/the-signal-leak-us-incompetence-meets-europes-inconsequence/",
    "timestamp": "2025-03-27T13:37:40Z"
  },
  {
    "title": "Germany Warns Trump of 'Firm Response' Over Tariffs: 'We Will Not Back Down'",
    "description": "Robert Habeck, Germany's economy minister, warned \"we will not back down\" in the face of Trump's 25% automobile tariffs.",
    "link": "https://www.newsweek.com/germany-warns-trump-firm-response-over-tariffs-we-will-not-back-down-2051397",
    "timestamp": "2025-03-27T13:36:19Z"
  },
  {
    "title": "Yale professor moving to U of T due to 'far-right' Trump administration's pressure on universities",
    "description": "A Yale University professor is leaving the U.S. and taking a position at the University of Toronto (U of T) due to what he says is a “far-right regime” under President Donald Trump.",
    "link": "https://www.cbc.ca/news/canada/toronto/yale-professor-moving-to-university-of-toronto-trump-administration-1.7494704",
    "timestamp": "2025-03-27T13:33:40Z"
  },
  {
    "title": "Yemen Huthis say launched missiles at Israel, US warship",
    "description": "The Iran-backed Huthis said Thursday they targeted an Israeli airport and army site as well as a US warship, soon after Israel reported intercepting missiles launched from Yemen. The Huthis “targeted Ben Gurion airport… with a ballistic missile… and a militar…",
    "link": "https://www.digitaljournal.com/world/yemen-huthis-say-launched-missiles-at-israel-us-warship/article",
    "timestamp": "2025-03-27T13:33:27Z"
  },
  {
    "title": "Pro-XRP Lawyer John Deaton Lost His Bid to Unseat Elizabeth Warren. Now, He's Eyeing Another Senate Run",
    "description": "Deaton has plans to boost his public persona beyond the crypto community as he considers a second run for a Senate seat.",
    "link": "https://decrypt.co/311706/pro-xrp-lawyer-john-deaton-eyeing-senate-run",
    "timestamp": "2025-03-27T13:33:11Z"
  },
  {
    "title": "Trump's auto tariffs will have a 'significant' impact on Tesla, Elon Musk says",
    "description": "President Donald Trump’s new auto tariffs will have a “significant” effect on Tesla (TSLA), CEO Elon Musk says. Read more...",
    "link": "https://qz.com/trump-auto-tariffs-impact-tesla-elon-musk-prices-1851772668",
    "timestamp": "2025-03-27T13:33:00Z"
  },
  {
    "title": "Yemen Huthis Say Launched Missiles At Israel, US Warship",
    "description": "The Iran-backed Huthis said Thursday they targeted an Israeli airport and army site as well as a US warship, soon after Israel reported intercepting missiles launched from Yemen.",
    "link": "https://www.ibtimes.com/yemen-huthis-say-launched-missiles-israel-us-warship-3767879",
    "timestamp": "2025-03-27T13:30:14Z"
  },
  {
    "title": "2025 Environmental and Social Developments",
    "description": "2025 is off to a fast start with several changes in the legal landscape of the environmental and social (E&S) categories of ESG (Environmental, Social, and Governance). This alert highlights key E&S developments thus far in 2025, including executive actions, …",
    "link": "https://corpgov.law.harvard.edu/2025/03/27/2025-environmental-and-social-developments/",
    "timestamp": "2025-03-27T13:30:11Z"
  },
  {
    "title": "‘We Need Something New’: Why a Democrat Is Primarying Nancy Pelosi",
    "description": "The Democratic primary challenger to Pelosi hopes to build a movement of insurgent candidates running on a shared vision of transformational change.",
    "link": "http://www.rollingstone.com/politics/politics-features/saikat-chakrabarti-pelosi-primary-democrat-1235304346/",
    "timestamp": "2025-03-27T13:30:00Z"
  },
  {
    "title": "Child slips through fencing at White House and is intercepted by Secret Service",
    "description": "Such intrusions have happened before. In April 2023, a toddler squeezed through the metal fencing, also on the North Lawn.",
    "link": "https://roanoke.com/news/nation-world/article_72b12bab-6f64-5c1c-9dbe-8250acd8dc39.html",
    "timestamp": "2025-03-27T13:30:00Z"
  },
  {
    "title": "Child slips through fencing at White House and is intercepted by Secret Service",
    "description": "Such intrusions have happened before. In April 2023, a toddler squeezed through the metal fencing, also on the North Lawn.",
    "link": "https://richmond.com/news/nation-world/article_7c8d1556-41e2-5f88-84d7-57c5629c34d3.html",
    "timestamp": "2025-03-27T13:30:00Z"
  },
  {
    "title": "Yale professor fleeing to Canada warns U.S. is teetering on the brink of fascist dictatorship amid political chaos",
    "description": "Jason Stanley, a Yale professor and fascism scholar, is moving to Canada due to concerns about the U.S. political climate and diminishing academic freedom. He draws parallels between current events and his family's escape from Nazi Germany, believing the U.S.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/yale-professor-fleeing-to-canada-warns-u-s-is-teetering-on-the-brink-of-fascist-dictatorship-amid-political-chaos/articleshow/119599849.cms",
    "timestamp": "2025-03-27T13:29:45Z"
  },
  {
    "title": "Trump Orders 25% Tariff on Auto Imports",
    "description": "President Donald Trump signed an order to implement a 25% tariff on auto imports, expanding a trade war designed to bring more manufacturing jobs to the US and setting the stage for an even broader push on levies next week.\n“What we’re going to be doing is a …",
    "link": "https://biztoc.com/x/8e68093f0e5c9071",
    "timestamp": "2025-03-27T13:29:42Z"
  },
  {
    "title": "Americans Worried About Housing Market Under Donald Trump: Poll",
    "description": "Americans are increasingly worried about the direction the U.S. housing market is heading toward this year as Donald Trump's tariffs threaten to cause a rise in construction costs, halting new building projects for much-needed inventory.\nAccording to a new su…",
    "link": "https://biztoc.com/x/74ece2f03834fae4",
    "timestamp": "2025-03-27T13:29:41Z"
  },
  {
    "title": "Big worry for Donald Trump? As tax day approaches, IRS data shows millions of Americans have not filed their Income Tax returns",
    "description": "Millions of Americans have not filed their taxes yet with only three weeks left until the April 15 deadline. The IRS has received 70.4 million returns so far. Some taxpayers affected by disasters have extended deadlines, but most need to file by April 15. Ear…",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-worry-for-donald-trump-as-tax-day-approaches-irs-data-shows-millions-of-americans-have-not-filed-their-income-tax-returns/articleshow/119597208.cms",
    "timestamp": "2025-03-27T13:29:09Z"
  },
  {
    "title": "Kennedy to cut 10,000 jobs in HHS overhaul",
    "description": "Kennedy said he was reorienting the health department to battle chronic illness.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/27/robert-kennedy-cuts-hhs/82687062007/",
    "timestamp": "2025-03-27T13:26:39Z"
  },
  {
    "title": "A 'coalition of the willing' mulls more aid for Ukraine and a possible European armed force",
    "description": "Ukraine’s allies from across Europe have gathered for talks in Paris about how to strengthen Kyiv’s hand and its military as it pushes for a ceasefire with Russia",
    "link": "https://abcnews.go.com/Business/wireStory/coalition-mulls-aid-ukraine-european-armed-force-120213655",
    "timestamp": "2025-03-27T13:26:30Z"
  },
  {
    "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
    "description": "Europe increased its imports of Russian gas last year, says Ember, putting billions into Putin's Ukraine war chest.",
    "link": "https://www.aljazeera.com/news/2025/3/27/europe-imports-more-russian-gas-aiding-wartime-economy-report-finds",
    "timestamp": "2025-03-27T13:25:49Z"
  },
  {
    "title": "Mike Waltz Said He Never Met Jeffrey Goldberg. This Photo Suggests Otherwise.",
    "description": "Goldberg has responded to questions about the photo, telling CBS News, \"If your eyeballs see us together, then I guess your eyeballs are seeing us together.\"",
    "link": "https://www.newsweek.com/mike-waltz-jeffrey-goldberg-photo-2051247",
    "timestamp": "2025-03-27T13:25:34Z"
  },
  {
    "title": "Federal Judge Denies Trump’s Effort to Ban Trannies From Military",
    "description": "(The Epoch Times)—A federal judge on March 26 denied the Trump administration’s motion to dissolve her order that prevents the Pentagon from blocking transgender people from enlisting in the military, which was scheduled to go into effect on Friday. U.S. Dist…",
    "link": "https://freerepublic.com/focus/f-news/4307054/posts",
    "timestamp": "2025-03-27T13:25:16Z"
  },
  {
    "title": "US health department to cut 10,000 jobs as Robert F. Kennedy Jr announces overhaul in latest DOGE push",
    "description": "In latest DOGE push, the US Health and Human Services Secretary Robert F. Kennedy is planning to cut 10,000 jobs at his department. The reductions could affect teams that respond to disease outbreaks, approve drugs and help people with their insurance coverag…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-health-department-to-cut-10000-jobs-as-robert-f-kennedy-jr-announces-overhaul-in-latest-doge-push/articleshow/119599555.cms",
    "timestamp": "2025-03-27T13:25:06Z"
  },
  {
    "title": "IRS Defi Rule Repeal Great For Best Wallet Token And New Cryptos",
    "description": "The IRS’ DeFi rule (which proposed stricter tax reporting for DeFI transactions) is set to be repealed, following a 70-28 motion vote by the US Senate. Now on the desk of President Donald Trump, the resolution is widely expected to be signed. And it’s a move …",
    "link": "https://bitcoinist.com/defi-rule-repealing-great-for-best-wallet-token/",
    "timestamp": "2025-03-27T13:24:13Z"
  },
  {
    "title": "Yemen's Houthis Say Launched Missiles At US Aircraft Carrier, Israeli Airport",
    "description": "Yemen&#039;s Iran-backed Houthis said Thursday they targeted an Israeli airport and army site as well as a US warship, soon after Israel reported intercepting missiles launched from the Gulf country.",
    "link": "https://www.ndtv.com/world-news/uss-harry-s-truman-yemens-houthis-say-launched-missiles-at-us-aircraft-carrier-israeli-airport-8024837",
    "timestamp": "2025-03-27T13:23:36Z"
  },
  {
    "title": "Americans Worried About Housing Market Under Donald Trump: Poll",
    "description": "A growing number of Americans fear that a U.S. housing market crash is in the cards this year.",
    "link": "https://www.newsweek.com/americans-worried-housing-market-donald-trump-poll-2051295",
    "timestamp": "2025-03-27T13:22:47Z"
  },
  {
    "title": "The Daily Money: Car prices rise again",
    "description": "Also: Tariffs and TikTok",
    "link": "https://www.usatoday.com/story/money/2025/03/27/car-prices-rise-again/82686374007/",
    "timestamp": "2025-03-27T13:22:41Z"
  },
  {
    "title": "Tariff Nation",
    "description": "The president announced he would impose a 25 percent tariff on all imported cars starting April 3, and car parts starting May 3.",
    "link": "https://reason.com/2025/03/27/tariff-nation/",
    "timestamp": "2025-03-27T13:22:32Z"
  },
  {
    "title": "What’s Wrong with the Trump Administration’s New Election Rules?",
    "description": "Plenty. They improperly expand presidential power and will make it harder to vote.\nThe post What’s Wrong with the Trump Administration’s New Election Rules? appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/27/whats-wrong-with-the-trump-administrations-new-election-rules/",
    "timestamp": "2025-03-27T13:21:51Z"
  },
  {
    "title": "What Does Trump’s Russian Policy Aim At?",
    "description": "What is behind US President Donald Trump’s bromance with Russian President Vladimir Putin? Is it essentially personal? Is there a strategy involved? Is it ideological? Is it the first step within a great design? Siding with Russia and distancing himself from …",
    "link": "https://www.fairobserver.com/politics/what-does-trumps-russian-policy-aim-at/",
    "timestamp": "2025-03-27T13:20:51Z"
  },
  {
    "title": "Trump's hopeless tariffs confusion, explained by a historian (Public Notice)",
    "description": "Public Notice:\nTrump's hopeless tariffs confusion, explained by a historian  —  “The president seems to believe he can impose prohibitively high tariffs *and* collect revenue, which you can't do.”  —  ∙ Paid …   —  At the White House yesterday, Donald Trump…",
    "link": "https://www.memeorandum.com/250327/p22",
    "timestamp": "2025-03-27T13:15:00Z"
  },
  {
    "title": "US Homeland Secretary issues stark warning to non-Americans as she visits 'worst prison on Earth'",
    "description": "Homeland Security Secretary Kristi Noem warned that 'criminal illegal aliens' in the US will be sent to El Salvador's brutal CECOT prison.",
    "link": "https://www.ladbible.com/news/us-news/us-homeland-security-kristi-noem-cecot-el-salvador-visit-warning-609620-20250327",
    "timestamp": "2025-03-27T13:14:50Z"
  },
  {
    "title": "Oil Holds Gain as US Posts Biggest Drop in Stockpiles This Year",
    "description": "Oil held a gain after US crude inventories fell the most since December, countering demand concerns surrounding a deepening trade war between the US and other nations.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-gain-as-us-posts-biggest-drop-in-stockpiles-this-year",
    "timestamp": "2025-03-27T13:13:39Z"
  },
  {
    "title": "Maxine Waters Pushes for Melania Trump's Deportation Despite Her Legal U.S. Citizenship",
    "description": "In yet another attack on President Donald Trump, some Democrats have targeted his immigration policies by calling for the deportation of his wife, Melania Trump. This outrageous and politically driven statement not only defies common sense but also reveals th…",
    "link": "https://freerepublic.com/focus/f-chat/4307051/posts",
    "timestamp": "2025-03-27T13:12:56Z"
  },
  {
    "title": "Maine Insists on Allowing Men in Women’s Sports. That Could Cost It $250M in Federal Education Funds.",
    "description": "Maine is putting it all on the line in the name of “transgender rights.” The state has gone so far as to risk federal funding... Read More\nThe post Maine Insists on Allowing Men in Women’s Sports. That Could Cost It $250M in Federal Education Funds. appeared …",
    "link": "https://www.dailysignal.com/2025/03/27/maine-insists-allowing-men-womens-sports-could-cost-250m-federal-education-funds/",
    "timestamp": "2025-03-27T13:12:55Z"
  },
  {
    "title": "RFK Jr. May Cut 10,000 Health Jobs",
    "description": "The Trump administration has laid off thousands amid cost-cutting efforts.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/27/rfk-jr-may-cut-10000-health-jobs/",
    "timestamp": "2025-03-27T13:12:44Z"
  },
  {
    "title": "Josh Hawley Looks Like A Dummy As He Places False Blame In War Chat Fiasco",
    "description": "The Republican senator and his Trump administration cronies can't seem to get their stories straight.",
    "link": "https://www.huffpost.com/entry/josh-hawley-mike-waltz-blame-staffer-jesse-watters_n_67e531d3e4b0fb04a517e56c",
    "timestamp": "2025-03-27T13:12:27Z"
  },
  {
    "title": "Bowen: Zelensky buoyant, but Europe far from able to replace US security guarantees",
    "description": "Ukrainian President Volodymyr Zelensky shares this thoughts on Europe's support and his country's resilience.",
    "link": "https://www.bbc.com/news/articles/c7782kgj8r4o",
    "timestamp": "2025-03-27T13:12:22Z"
  },
  {
    "title": "5 Major Updates On Student Loan Payment Plans As Lawsuits Continue",
    "description": "There have been several developments this week that will impact millions of student loan borrowers trying to navigate an array of repayment plans embroiled in turmoil.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/03/27/5-major-updates-on-student-loan-payment-plans-as-lawsuits-continue/",
    "timestamp": "2025-03-27T13:09:12Z"
  },
  {
    "title": "FACT CHECK: Claim That Over 100 USAID Workers Have Been Arrested For Treason Is Satire",
    "description": "A post shared on Facebook claims over 100 United States Agency for International Development (USAID) employees were purportedly arrested by U.S. Marines for treason. Verdict: False The claim is false and originally stems from a March 25 article published on t…",
    "link": "https://checkyourfact.com/2025/03/27/fact-check-claim-usaid-workers-arrested-treason-satire/",
    "timestamp": "2025-03-27T13:09:12Z"
  },
  {
    "title": "US cities located in states won by Trump would be most hurt by Canadian tariffs, an analysis finds",
    "description": "A new analysis finds the U.S. cities most vulnerable to a trade war with Canada turn out to largely be in the states that helped return Donald Trump to the White House.",
    "link": "https://www.news4jax.com/news/politics/2025/03/27/us-cities-located-in-states-won-by-trump-would-be-most-hurt-by-canadian-tariffs-an-analysis-finds/",
    "timestamp": "2025-03-27T13:08:27Z"
  },
  {
    "title": "US fourth quarter GDP revised up but tariff worries linger",
    "description": "The US economy grew 2.4% in the fourth quarter of 2024, slightly higher than earlier estimates. However, Trump's tariffs on trading partners like Canada, Mexico, and China, along with imported vehicle parts, pose growing uncertainties. Despite high interest r…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-fourth-quarter-gdp-revised-up-but-tariff-worries-linger/articleshow/119598902.cms",
    "timestamp": "2025-03-27T13:07:55Z"
  },
  {
    "title": "Iran's Currency Crashes as Trump's Sanctions Bite",
    "description": "Iran's currency has hit a record low as toughened sanctions under U.S. President Donald Trump and the absence of nuclear talks with the United States deepens economic uncertainty.\nThe rial was trading 1,030,000 against the U.S. dollar as of publication time, …",
    "link": "https://biztoc.com/x/ce125edebf7d5fa2",
    "timestamp": "2025-03-27T13:07:39Z"
  },
  {
    "title": "Trump's tariffs push will hit the U.S. harder than Europe in the short term, Santander chair says",
    "description": "\"On a relative basis, in the short term, Europe will be less affected than the U.S.,\" Santander's Ana Botín said regarding President Donald Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/03/27/trumps-tariffs-push-will-hit-the-us-harder-than-europe-santander.html",
    "timestamp": "2025-03-27T13:04:44Z"
  },
  {
    "title": "Jiangxi Copper Warns of Enduring Volatility After Profit Miss",
    "description": "Jiangxi Copper Co., one of China’s largest producers of the metal, reported full-year earnings that narrowly missed estimates and warned of ongoing volatility in the market.",
    "link": "https://financialpost.com/pmn/business-pmn/jiangxi-copper-warns-of-enduring-volatility-after-profit-miss",
    "timestamp": "2025-03-27T13:03:24Z"
  },
  {
    "title": "French FM bats for ‘Franco-Chinese partnership’ during Beijing visit",
    "description": "France urges multilateralism and deepened ties with China amid trade and security tensions with the US.",
    "link": "https://www.aljazeera.com/news/2025/3/27/french-fm-bats-for-franco-chinese-partnership-during-beijing-visit",
    "timestamp": "2025-03-27T13:02:46Z"
  },
  {
    "title": "U.S. economy grew 2.4% in the 4th quarter after upgrade from earlier estimate",
    "description": "The U.S. economy expanded at a healthy annual 2.4% pace the last three months of 2024, supported by a year-end surge in consumer spending",
    "link": "https://abcnews.go.com/Business/wireStory/us-economy-grew-24-4th-quarter-after-upgrade-120212252",
    "timestamp": "2025-03-27T13:02:09Z"
  },
  {
    "title": "Democrats mock efforts to defund PBS: ‘Are Bert and Ernie part of an extreme homosexual agenda?’",
    "description": "Democratic congressman Robert Garcia has mocked Republican efforts to defund the TV channel that airs Sesame Street, sarcastically asking if characters Bert and Ernie were “part of an extreme homosexual agenda”. Garcia’s comments came at a congressional heari…",
    "link": "https://www.thepinknews.com/2025/03/27/fire-elon-save-elmo-pbs-doge-robert-garcia/",
    "timestamp": "2025-03-27T13:02:06Z"
  },
  {
    "title": "San Antonio and Detroit are among the U.S. cities most vulnerable to tariffs: report",
    "description": "OTTAWA — San Antonio, Detroit and Kansas City are the three American cities most vulnerable to a trade war, says new research by the Canadian Chamber of Commerce. The research looked at 41 cities in the U.S. to determine which ones are the most dependent on t…",
    "link": "https://financialpost.com/pmn/san-antonio-and-detroit-are-among-the-u-s-cities-most-vulnerable-to-tariffs-report",
    "timestamp": "2025-03-27T13:02:02Z"
  },
  {
    "title": "Iran's Currency Crashes as Trump's Sanctions Bite",
    "description": "The Iranian economy continues to crumble as the rial falls below the significant level of 1,000,000 against the U.S. dollar.",
    "link": "https://www.newsweek.com/iran-trump-nuclear-war-currency-sanctions-2051299",
    "timestamp": "2025-03-27T13:01:15Z"
  },
  {
    "title": "MS-13 leader arrested in Virginia: Why is MAGA celebrating this major gang crackdown?",
    "description": "MS-13 leader arrested in Virginia in a major law enforcement operation, marking a significant step in dismantling the notorious gang. The 24-year-old, considered one of the top three MS-13 leaders in the U.S., was captured in Woodbridge. Authorities, includin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ms-13-leader-arrested-in-virginia-why-is-maga-celebrating-this-major-gang-crackdown/articleshow/119598044.cms",
    "timestamp": "2025-03-27T13:01:13Z"
  },
  {
    "title": "Market Tracker Expects Brands' Fear Of Musk To Boost X Ad Revenue",
    "description": "Emarketer on Wednesday forecast that ad revenue at X, formerly Twitter, will grow this year as brands fear retaliation by politically connected owner Elon Musk if they stay away.",
    "link": "https://www.ibtimes.com.au/market-tracker-expects-brands-fear-musk-boost-x-ad-revenue-1857305",
    "timestamp": "2025-03-27T13:00:55Z"
  },
  {
    "title": "Letters: “Staggering incompetence” regarding U.S. official’s chat messages",
    "description": "\"We're very fortunate that we're not reading an obituary of a fighter pilot brought down by a surface-to-air missile ...\"",
    "link": "https://www.denverpost.com/2025/03/27/signal-chat-houthi-battle-plans-letters/",
    "timestamp": "2025-03-27T13:00:54Z"
  },
  {
    "title": "Kristi Noem wears $60,000 Rolex to film promo inside notoriously brutal El Salvadorian prison",
    "description": "Secretary of Homeland Security Kristi Noem is facing backlash online for filming a promo inside El Salvador's Terrorism Confinement Center (CECOT).\n\n\nIn the footage, uploaded to X on Wednesday night, Noem warned that those seeking to enter the U.S. without do…",
    "link": "https://www.dailydot.com/debug/kristi-noem-rolex-pr-video-el-salvador-prison/",
    "timestamp": "2025-03-27T13:00:48Z"
  },
  {
    "title": "Twenty-Nine States Have a Not-So-Secret Weapon to Fight for Democracy",
    "description": "As the Trump administration’s attacks on women’s rights, reproductive access and LGBTQ equality continue in force, state executive leaders have emerged as potent frontline responders.\nAmong the tools in states’ arsenals are often underused state-level equal r…",
    "link": "https://msmagazine.com/2025/03/27/state-era-equal-rights-amendment-ting-ting-cheng/",
    "timestamp": "2025-03-27T13:00:37Z"
  },
  {
    "title": "Trump Endorses Pro-Bitcoin Senator Lummis: ‘Make US The Crypto Capital’",
    "description": "US President Donald Trump has thrown his full backing behind pro-Bitcoin Senator Cynthia Lummis (R-Wyo.) in her 2026 reelection race. Declaring her an “America First Warrior” on his Truth Social platform, Trump singled out Lummis’ leadership on crypto policy,…",
    "link": "https://bitcoinist.com/trump-endorses-pro-bitcoin-senator-lummis/",
    "timestamp": "2025-03-27T13:00:25Z"
  },
  {
    "title": "Tariff-hit British Steel Confirms Plan To Shut Blast Furnaces",
    "description": "Chinese-owned British Steel confirmed Thursday plans to shut blast furnaces and other operations in England, saying US President Donald Trump's tariffs on the sector were partly to blame for a decision which could cost up to 2,700 jobs.",
    "link": "https://www.ibtimes.com/tariff-hit-british-steel-confirms-plan-shut-blast-furnaces-3767872",
    "timestamp": "2025-03-27T13:00:20Z"
  },
  {
    "title": "Ripple CEO Issues ‘Massive’ Trillion Dollar Prediction Amid Bitcoin, XRP And Crypto Price Swings",
    "description": "Ripple chief executive Brad Garlinghouse has said the company is poised to “unlock the U.S. market,\" predicting the “opportunity” will be “massive\"...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/03/27/ripple-ceo-issues-massive-trillion-dollar-prediction-amid-bitcoin-xrp-and-crypto-price-swings/",
    "timestamp": "2025-03-27T13:00:07Z"
  },
  {
    "title": "Trump EPA chief to 'confront crisis' of Mexican sewage polluting San Diego area beaches",
    "description": "Lee Zeldin, who heads the EPA, will visit the California-Mexico border \"in the near future\" to inspect toxic sewage flowing into the Pacific Ocean from Tijuana.",
    "link": "https://www.foxnews.com/politics/trump-epa-chief-confront-crisis-mexican-sewage-polluting-san-diego-area-beaches",
    "timestamp": "2025-03-27T13:00:01Z"
  },
  {
    "title": "The Outer Limits of the Manosphere",
    "description": "The Paul brothers’ new reality series looks like a showcase for dude-bro supremacy. But the girlfriends steal the limelight.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/03/outer-limits-manosphere/682183/",
    "timestamp": "2025-03-27T13:00:00Z"
  },
  {
    "title": "Tracking Trump's tariffs",
    "description": "For U.S. President Donald Trump, tariffs aren't just about macroeconomics: They're also about asserting power.",
    "link": "https://www.snopes.com//tracker/tracking-trumps-tariffs/",
    "timestamp": "2025-03-27T13:00:00Z"
  },
  {
    "title": "New regulation on money transfers will likely impact San Diego border region",
    "description": "The Trump administration is lowering the threshold to report money transfers to foreign countries. The Treasury Department says the new rule is needed to combat money laundering from Mexican drug cartels. Critics say it violates privacy and civil liberties.",
    "link": "https://www.kpbs.org/news/politics/2025/03/27/new-regulation-on-money-transfers-will-likely-impact-san-diego-border-region",
    "timestamp": "2025-03-27T13:00:00Z"
  },
  {
    "title": "Make America Great At Energy Storage",
    "description": "Although currently unable to support a wholesale energy transition, battery storage can help reduce electricity costs, compete with rivals technologically, and ensure ...",
    "link": "https://www.forbes.com/sites/arielcohen/2025/03/27/make-america-great-at-energy-storage/",
    "timestamp": "2025-03-27T13:00:00Z"
  },
  {
    "title": "US applications for unemployment benefits hold steady, remain in recent healthy range",
    "description": "U.S. applications for unemployment benefits held steady last week, a sign that the labor market remains healthy as companies continue to retain their employees",
    "link": "https://abcnews.go.com/Business/wireStory/us-applications-unemployment-benefits-hold-steady-remain-recent-120212254",
    "timestamp": "2025-03-27T12:58:43Z"
  },
  {
    "title": "Man, 75, and woman, 66, arrested in probe into vandalism at Trump golf course",
    "description": "Two more people have been arrested in connection with vandalism at a golf course owned by US President Donald Trump.",
    "link": "https://news.sky.com/story/two-more-people-arrested-in-probe-into-vandalism-at-trump-turnberry-golf-resort-in-scotland-13336668",
    "timestamp": "2025-03-27T12:58:00Z"
  },
  {
    "title": "Thursday, March 27, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-march-27-2025/",
    "timestamp": "2025-03-27T12:57:59Z"
  },
  {
    "title": "His brothers’ keeper: Liran Berman calls for urgent action to save his brothers, Gali and Ziv, from Hamas",
    "description": "Gali and Ziv Berman were taken hostage on Oct. 7, 2023, and their brother, Liran, has been fighting for their freedom ever since. He says his brothers were \"the light of every room\" they walked into.",
    "link": "https://www.foxnews.com/world/his-brothers-keeper-liran-berman-calls-urgent-action-save-his-brothers-gali-ziv-from",
    "timestamp": "2025-03-27T12:57:37Z"
  },
  {
    "title": "Here's what Elon Musk, the UAW and industry figures are saying about Trump's auto tariffs",
    "description": "President Donald Trump signed an order to implement a 25% tariff on auto imports.\nPool via AP\nTrump's 25% auto tariff shook markets, hitting stocks and sparking fears of a global trade war.\nUAW backed the move, while Tesla and foreign automakers warned of hig…",
    "link": "https://biztoc.com/x/5bc9d27661caee5a",
    "timestamp": "2025-03-27T12:56:35Z"
  },
  {
    "title": "Honorary Secret Service agent DJ Daniel tours training facility, meets top officials",
    "description": "Trump-honored DJ Daniel, the 13-year-old cancer survivor made honorary Secret Service member, reported for duty at the James J. Rowley Training Center in Beltsville, Maryland, last week.",
    "link": "https://www.foxnews.com/us/honorary-secret-service-agent-dj-daniel-tours-training-facility-meets-top-officials",
    "timestamp": "2025-03-27T12:56:02Z"
  },
  {
    "title": "Trump Immigration Nazis Kidnap Another Victim For Wrongthink",
    "description": "Do not be confused about what is happening here.",
    "link": "https://www.wonkette.com/p/trump-immigration-nazis-kidnap-another",
    "timestamp": "2025-03-27T12:55:49Z"
  },
  {
    "title": "Trump sounds off after 'Highly Conflicted' Obama-nominated judge assigned Signal chat lawsuit: 'Disgraceful' (Alex Nitzberg/Fox News)",
    "description": "Alex Nitzberg / Fox News:\nTrump sounds off after ‘Highly Conflicted’ Obama-nominated judge assigned Signal chat lawsuit: ‘Disgraceful’  —  Trump called for Boasberg to be impeached earlier this month  —  President Donald Trump sounded off on Truth Social earl…",
    "link": "https://www.memeorandum.com/250327/p19",
    "timestamp": "2025-03-27T12:55:00Z"
  },
  {
    "title": "U.S. cities located in states won by Trump would be most hurt by Canadian tariffs, analysis finds",
    "description": "The findings show that the United States’ 25% tariffs on Canada and Canada’s retaliations could inflict meaningful damage in key states for U.S. politics",
    "link": "https://www.theglobeandmail.com/business/international-business/us-business/article-us-cities-located-in-states-won-by-trump-would-be-most-hurt-by/",
    "timestamp": "2025-03-27T12:54:55Z"
  },
  {
    "title": "What To Know About An Anti-Vaccine Advocate Leading A Federal Study On Vaccines And Autism",
    "description": "What To Know About An Anti-Vaccine Advocate Leading A Federal Study On Vaccines And Autismhuffpost.com",
    "link": "https://www.huffpost.com/entry/hhs-study-vaccines-autism-david-geier_l_67e42a1ae4b05205243a5c98",
    "timestamp": "2025-03-27T12:53:36Z"
  },
  {
    "title": "Elon Musk's Tesla to emerge big winner from Donald Trump's auto tariffs? Here's what we know so far",
    "description": "US President Donald Trump has announced new auto tariffs and since then apprehensions have been raised over whether these new duties will benefit Tesla or not.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-tesla-to-emerge-big-winner-from-donald-trumps-auto-tariffs-heres-what-we-know-so-far/articleshow/119598169.cms",
    "timestamp": "2025-03-27T12:53:26Z"
  },
  {
    "title": "The job market is ‘frozen.’ That’s not a good sign for DOGE casualties | CNN Business",
    "description": "The Trump administration’s culling of government programs and agencies has resulted in an unprecedented wave of federal workers joining the ranks of job seekers — and new data shows a spike in job applications from agencies impacted by the Department of Gover…",
    "link": "https://www.cnn.com/2025/03/27/economy/us-jobless-claims-doge-federal-applications/index.html",
    "timestamp": "2025-03-27T12:52:07Z"
  },
  {
    "title": "Here's what Elon Musk, the UAW and industry figures are saying about Trump's auto tariffs",
    "description": "Elon Musk said President Donald Trump's tariffs would have a \"significant\" impact on Tesla, while the UAW said it would help end the \"race to the bottom.\"",
    "link": "https://www.businessinsider.com/auto-tariffs-trump-responses-elon-musk-uaw-industry-figures-2025-3",
    "timestamp": "2025-03-27T12:51:57Z"
  },
  {
    "title": "Team Trump leans into semantics fight to downplay Signal group chat scandal",
    "description": "White House officials have had days to come up with a “Signalgate” defense. They’ve settled on a weird point about the meaning of “war plans.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-leans-semantics-fight-downplay-signal-group-chat-scandal-rcna198330",
    "timestamp": "2025-03-27T12:50:18Z"
  },
  {
    "title": "POTUS Trump Endorses Lindsey Graham",
    "description": "Senator Lindsey Graham is working incredibly hard for the Great People of South Carolina, a State I love and WON BIG in 2016, 2020, and 2024! Lindsey has been a wonderful friend to me, and has always been there when I needed him. As the Chair of the Senate Bu…",
    "link": "https://freerepublic.com/focus/f-chat/4307045/posts",
    "timestamp": "2025-03-27T12:49:45Z"
  },
  {
    "title": "Dear US researchers: Welcome to Germany!",
    "description": "Trump's massive attack on science is driving US researchers away. German research institutions could benefit, but they’re also concerned about Trump’s impact on global science.",
    "link": "https://www.dw.com/en/dear-us-researchers-welcome-to-germany/a-72058292",
    "timestamp": "2025-03-27T12:49:00Z"
  },
  {
    "title": "What you need to know if you're travelling from Canada to the U.S.",
    "description": "Canadians who plan to travel to the U.S. soon may be concerned about crossing the border amid heightened political tensions.\r\nWhile the trade war has dampened many Canucks' interest in travelling down south, there are still cases where people have to go there…",
    "link": "https://dailyhive.com/canada/travel-to-us-canadian-rights",
    "timestamp": "2025-03-27T12:48:40Z"
  },
  {
    "title": "Thai auto sector frets over US tariffs",
    "description": "<p>The US&rsquo;s announcement of a <strong>25% tariff on automobiles</strong> has triggered fresh concerns over the <strong>sluggish Thai automotive industry</strong> as analysts worry about the short-term impact and long-term export uncertainties.</p>",
    "link": "https://www.bangkokpost.com/business/general/2989117/thai-auto-sector-frets-over-us-tariffs",
    "timestamp": "2025-03-27T12:47:00Z"
  },
  {
    "title": "European Council chief: No backing down on Russia sanctions",
    "description": "EU leaders aim to find a collective response to U.S.’s intention to ease sanctions on Moscow as an incentive to stop fighting Ukraine.",
    "link": "https://www.politico.eu/article/eu-chief-no-backing-down-on-russia-sanctions/",
    "timestamp": "2025-03-27T12:46:43Z"
  }
]