[
  {
    "title": "US starts collecting Trump tariffs, smashing global trade norms after stock market sell-off",
    "description": "US customs agents began collecting President Donald Trump's unilateral 10pc tariff on all imports from many countries on Saturday, with higher levies on goods (20pc for Ireland the EU) from 57 larger trading partners due to start next week.",
    "link": "https://www.independent.ie/world-news/us-starts-collecting-trump-tariffs-smashing-global-trade-norms-after-stock-market-sell-off/a743212676.html",
    "timestamp": "2025-04-05T08:35:25Z"
  },
  {
    "title": "7 Things- Trade war declared; gambling is dead; protests banned at homes; and more ...",
    "description": "Commerce Secretary Howard Lutnick asserts there’s no chance Trump will abandon his tariff plan, predicting long-term market gains despite immediate fallout, as Singapore and Switzerland pursue engagement with the Trump administration, France demands a Europea…",
    "link": "https://yellowhammernews.com/7-things-trade-war-declared-gambling-is-dead-protests-banned-at-homes-and-more/",
    "timestamp": "2025-04-05T08:34:20Z"
  },
  {
    "title": "Commerce Secretary Howard Lutnick on the US trying to take chip manufacturing from Taiwan: 'Why can't those be made with robotics in America?'",
    "description": "Commerce Secretary Howard Lutnick said the US is going to bring back chip manufacturing from Taiwan.\n- President Donald Trump's latest round of reciprocal tariffs do not apply to semiconductors.\n- But Lutnick said Trump is \"going to deeply study those\" and br…",
    "link": "https://biztoc.com/x/997bbec4d3712c06",
    "timestamp": "2025-04-05T08:32:42Z"
  },
  {
    "title": "Cathie Wood Weighs In On Trump's 'Tariff Turmoil' And Potential Economic Impact: 'If President Trump Cares About His Legacy…'",
    "description": "Cathie Wood, CEO of Ark Invest, on Friday warned that President Donald Trump’s new tariffs could push the U.S. economy into a recession but remained optimistic that innovation and smart policy could lead to a recovery.\nWhat Happened: During an \"Employment Fri…",
    "link": "https://biztoc.com/x/695dc944f002f3b9",
    "timestamp": "2025-04-05T08:32:40Z"
  },
  {
    "title": "Donald Trump called out after sharing video of US Army 'decimating' people on social media",
    "description": "Donald Trump shared the air strike footage on his social media platform, Truth Social",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-houthis-yemen-video-377838-20250405",
    "timestamp": "2025-04-05T08:32:05Z"
  },
  {
    "title": "Putin thinks time is on his side. Sadly he may be right, says Alexander Gabuev",
    "description": "Efforts are under way to find a negotiated settlement. But, asks the head of Carnegie Russia Eurasia Centre, has the Kremlin got the memo?",
    "link": "https://www.livemint.com/opinion/online-views/putin-thinks-time-is-on-his-side-sadly-he-may-be-right-says-alexander-gabuev-11743824668032.html",
    "timestamp": "2025-04-05T08:30:13Z"
  },
  {
    "title": "While Canada was spared from further tariffs — for now — N.L. plans to hold its ground",
    "description": "Newfoundland and Labrador Premier Andrew Furey vows to keep U.S. alcohol off of liquor store shelves. Meanwhile, seafood entrepreneur Danny Dumaresque says he'll continue to look outside of the U.S. for new markets.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/furey-us-trade-war-1.7500793",
    "timestamp": "2025-04-05T08:30:00Z"
  },
  {
    "title": "America is about to be hit by a 'tsunami' of authentic Chinese restaurants",
    "description": "Dozens of Chinese restaurant chains are opening their doors in America — if they can survive the backlash.",
    "link": "https://www.businessinsider.com/china-restaurants-food-chains-coming-us-geopolitical-trade-war-backlash-2025-4",
    "timestamp": "2025-04-05T08:24:02Z"
  },
  {
    "title": "Nissan considers transferring some domestic production to U.S., report says",
    "description": "The carmaker plans to reduce production at its Fukuoka factory and shift some manufacturing to the U.S. to mitigate the impact of Trump's tariffs.",
    "link": "https://www.japantimes.co.jp/business/2025/04/05/companies/nissan-production-us-shift/",
    "timestamp": "2025-04-05T08:24:00Z"
  },
  {
    "title": "Argentina's Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "Argentina’s Milei doubles down on Trump bromance as the world reels from trade shock\nBUENOS AIRES, Argentina (AP) — Europe vowed retaliation. China plotted tariffs of its own. Mexico scrambled to blunt the blow. But while the world’s leaders were wringing the…",
    "link": "https://biztoc.com/x/dcbc39d9757bce52",
    "timestamp": "2025-04-05T08:22:26Z"
  },
  {
    "title": "Trump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil (Erik Wasson/Bloomberg)",
    "description": "Erik Wasson / Bloomberg:\nTrump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil  —  Senate Republicans took a major step toward enacting President Donald Trump's tax cut agenda and increasing the debt ceiling that could inject a small degree of certainty…",
    "link": "https://www.memeorandum.com/250405/p5",
    "timestamp": "2025-04-05T08:20:00Z"
  },
  {
    "title": "Nissan considers transferring some domestic production to US, Nikkei says",
    "description": "TOKYO : Nissan Motor is considering shifting some domestic production of U.S.-bound vehicles to the U.S., the Nikkei reported on Saturday, as President Donald Trump ramps up trade tariffs on nations worldwide.As early as this summer, Nissan plans to reduce pr…",
    "link": "https://www.channelnewsasia.com/business/nissan-considers-transferring-some-domestic-production-us-nikkei-says-5046576",
    "timestamp": "2025-04-05T08:17:46Z"
  },
  {
    "title": "2 charts show who's getting hired right now",
    "description": "Healthcare has had strong job growth over the last several months.",
    "link": "https://www.businessinsider.com/what-industries-are-hiring-employment-cant-find-job-2025-4",
    "timestamp": "2025-04-05T08:16:01Z"
  },
  {
    "title": "Argentina’s Milei doubles down on Trump bromance as the world reels from trade shock",
    "description": "BUENOS AIRES, Argentina (AP) — Europe vowed retaliation. China plotted tariffs of its own. Mexico scrambled to blunt the blow. But while the world’s leaders were wringing their hands over President Donald Trump’s announcement of sweeping tariffs on U.S. impor…",
    "link": "https://financialpost.com/pmn/argentinas-milei-doubles-down-on-trump-bromance-as-the-world-reels-from-trade-shock",
    "timestamp": "2025-04-05T08:15:56Z"
  },
  {
    "title": "Police expect anti-Trump protests to be peaceful in Portland, plan to help marchers move through streets - OregonLive.com",
    "description": "Police expect anti-Trump protests to be peaceful in Portland, plan to help marchers move through streetsOregonLive.com 'There's a movement bubbling up': Anti-Trump protests planned nationwide SaturdayUSA Today 'Hands Off!': Nationwide protests against Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176932079",
    "timestamp": "2025-04-05T08:12:44Z"
  },
  {
    "title": "The last time the US raised tariffs this much it made the Great Depression way worse",
    "description": "President Donald Trump announced reciprocal tariffs on imported goods from other countries on Wednesday.\nCarlos Barria/REUTERS\nTrump increased tariffs on US imports to the highest levels in nearly a century.\nThe Smoot-Hawley Tariff Act of 1930 raised tariffs …",
    "link": "https://biztoc.com/x/79d51cc29d657f5e",
    "timestamp": "2025-04-05T08:11:01Z"
  },
  {
    "title": "What a Third Donald Trump Term Could Look Like",
    "description": "Experts discuss with Newsweek what it would mean if Trump is still in the White House come 2029.",
    "link": "https://biztoc.com/x/e2acd4103774e937",
    "timestamp": "2025-04-05T08:10:44Z"
  },
  {
    "title": "Trump Tariffs Could Spike iPhone Prices To Almost $2,300 If Apple Decides To Pass On The Costs To Buyers",
    "description": "President Donald Trump has enacted sweeping tariffs that could significantly increase the cost of consumer goods, including Apple Inc. (NASDAQ:AAPL) iPhones. Analysts foresee a potential price surge of 30% to 40% if Apple passes these costs onto consumers.\nWh…",
    "link": "https://biztoc.com/x/b05077c6b54ff615",
    "timestamp": "2025-04-05T08:10:42Z"
  },
  {
    "title": "The last time the US raised tariffs this much it made the Great Depression way worse",
    "description": "Trump's tariff hike mirrors the 1930 Smoot-Hawley Tariff Act, which exacerbated the Great Depression and led to a major shift in US trade policy.",
    "link": "https://www.businessinsider.com/trumps-tariffs-highest-since-the-great-depression-2025-4",
    "timestamp": "2025-04-05T08:07:02Z"
  },
  {
    "title": "Fissure among Conservatives undermining Poilievre's pitch he's a national unifier: experts",
    "description": "Long-simmering tensions within the Conservative movement are bursting out into the federal election, experts say — undercutting Conservative Leader Pierre Poilievre’s efforts to present himself as a unifier who can take on U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/politics/poilievre-manning-smith-fissure-conservative-movement-1.7502543",
    "timestamp": "2025-04-05T08:00:40Z"
  },
  {
    "title": "One State, No Solution: Planning for the Death of Palestinian Independence",
    "description": "'The real discourse is—de facto—not between the one state or two states but rather what kind of one state will it be,' a former Israeli leader tells Newsweek.",
    "link": "https://www.newsweek.com/death-two-state-solution-israel-palestine-2054974",
    "timestamp": "2025-04-05T08:00:03Z"
  },
  {
    "title": "Doctor Suggests Pregnancy Changes To Solve US Birth Rate Panic",
    "description": "There is a \"disconnect between pregnancies and babies,\" Dr. Jonathan Sher told Newsweek.",
    "link": "https://www.newsweek.com/pregnancy-changes-birth-rate-panic-population-fertility-rate-2054902",
    "timestamp": "2025-04-05T08:00:02Z"
  },
  {
    "title": "What a Third Donald Trump Term Could Look Like",
    "description": "Experts discuss with Newsweek what it would mean if Trump is still in the White House come 2029.",
    "link": "https://www.newsweek.com/donald-trump-third-term-2028-election-constitution-2054821",
    "timestamp": "2025-04-05T08:00:01Z"
  },
  {
    "title": "Ontario tourism operators hope for summer staycation boom",
    "description": "Local tourism operators are anticipating more business this summer as Canadians opt out of travel south of the border.",
    "link": "https://www.cbc.ca/news/canada/ottawa/ontario-tourism-boost-canadian-staycationers-1.7500841",
    "timestamp": "2025-04-05T08:00:00Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "US tariffs come into effect, 18 killed in Russian strikes and funeral of Mick O’Dwyer set to take place",
    "link": "https://www.thejournal.ie/9-at-9-saturday-210-6669452-Apr2025/",
    "timestamp": "2025-04-05T08:00:00Z"
  },
  {
    "title": "Senate GOP pushes Trump budget framework through after marathon vote series",
    "description": "The amended framework would raise the debt ceiling by up to $5 trillion within the reconciliation process, taking future leverage away from Senate Democrats.",
    "link": "https://nypost.com/2025/04/05/us-news/senate-republicans-pass-trump-budget-framework-after-marathon-vote-session/",
    "timestamp": "2025-04-05T07:58:33Z"
  },
  {
    "title": "Eggs, Eyelashes, iPhones: What Donald Trump’s trade war could really cost you",
    "description": "US President Donald Trump’s sweeping global tariffs are already rippling through everyday consumer goods, sparking price hikes across groceries, fashion, tech, and health products. From European eyewear and Finnish health rings to Chinese wigs and Swiss coffe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eggs-eyelashes-iphones-what-donald-trumps-trade-war-could-really-cost-you/articleshow/120005604.cms",
    "timestamp": "2025-04-05T07:56:43Z"
  },
  {
    "title": "US deputy Middle East envoy meets Lebanese officials to discuss contentious border issues",
    "description": "Ortagus will demand that Lebanese authorities establish a schedule for Hezbollah’s disarmament, push for talks between Israel and Lebanon.",
    "link": "https://www.jpost.com/middle-east/article-848943",
    "timestamp": "2025-04-05T07:53:24Z"
  },
  {
    "title": "Donald Trump Scores Major Senate Win",
    "description": "The Senate has approved President Donald Trump's tax and spending cut framework in a 51-49 vote.",
    "link": "https://biztoc.com/x/1c7e25727bd99496",
    "timestamp": "2025-04-05T07:48:41Z"
  },
  {
    "title": "Donald Trump Scores Major Senate Win",
    "description": "The Senate has approved President Donald Trump's tax and spending cut framework in a 51-49 vote.",
    "link": "https://www.newsweek.com/donald-trump-scores-senate-win-republican-senators-approve-tax-breaks-spending-cuts-2055766",
    "timestamp": "2025-04-05T07:43:10Z"
  },
  {
    "title": "Foxconn reports record Q1 revenue, says it must closely watch global politics",
    "description": "TAIPEI :Taiwan's Foxconn, the world's largest contract electronics maker, posted its highest first-quarter revenue ever on strong demand for artificial intelligence products but said it would need to closely watch global politics.Revenue for Apple's biggest i…",
    "link": "https://www.channelnewsasia.com/business/foxconn-reports-record-q1-revenue-says-it-must-closely-watch-global-politics-5046551",
    "timestamp": "2025-04-05T07:42:19Z"
  },
  {
    "title": "Sherman: We can boost aviation fuel independence",
    "description": "There is a growing demand that will be met by foreign producers if the government does not do more to promote domestic production.",
    "link": "https://www.bostonherald.com/2025/04/05/sherman-we-can-boost-aviation-fuel-independence/",
    "timestamp": "2025-04-05T07:28:32Z"
  },
  {
    "title": "Donald Trump says 'time to get rich' as Dow Jones crash sparks recession fears",
    "description": "Donald Trump says 'time to get rich' as Dow Jones crash sparks recession fears\nFollowing President Trump's tariffs, US markets plummet, with a $6 trillion loss affecting investments by Americans.\nThe United States markets are reeling from the shock of the rec…",
    "link": "https://biztoc.com/x/a7780cf9f0d7a9f6",
    "timestamp": "2025-04-05T07:27:13Z"
  },
  {
    "title": "Trump Tariffs Push Staunch Critic Austria to Back Mercosur Deal",
    "description": "President Donald Trump’s global tariffs are convincing Austria to ditch its long-time opposition to a trade deal between the European Union and the Mercosur bloc.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-push-staunch-critic-austria-to-back-mercosur-deal",
    "timestamp": "2025-04-05T07:21:50Z"
  },
  {
    "title": "Trump’s 10 percent tariff takes effect, raising fears of global trade war",
    "description": "Initial 'baseline' tariff comes into effect at US seaports, airports and customs warehouses as stock markets plummet.",
    "link": "https://www.aljazeera.com/news/2025/4/5/trumps-10-percent-tariff-takes-effect-raising-fears-of-global-trade-war",
    "timestamp": "2025-04-05T07:19:14Z"
  },
  {
    "title": "Trump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil",
    "description": "Senate Republicans took a major step toward enacting President Donald Trump’s tax cut agenda and increasing the debt ceiling that could inject a small degree of certainty into financial markets roiled by the president’s tariff policies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tax-cut-debt-limit-plan-advances-amid-tariff-turmoil",
    "timestamp": "2025-04-05T07:17:57Z"
  },
  {
    "title": "Trump tariffs are weakening the dollar instead of boosting it—further adding to the price Americans will pay for costlier imports",
    "description": "The US dollar has been falling as President Donald Trump rolls out his tariffs, and it plunged after he unveiled much steeper-than-expected duties on \"Liberation Day.\" That goes against what markets had anticipated before he launched his trade war. The weaker…",
    "link": "https://biztoc.com/x/c8e9972ac6ff92bc",
    "timestamp": "2025-04-05T07:16:09Z"
  },
  {
    "title": "Opinion: Can You Really Trust Trump's 'Magic Potion'?",
    "description": "Trump faces a major short-term political challenge: the tariffs are likely to hurt two key constituencies of the GOP - business leaders and working-class MAGA voters.",
    "link": "https://www.ndtv.com/opinion/can-you-really-trust-trumps-magic-potion-8092399",
    "timestamp": "2025-04-05T07:10:19Z"
  },
  {
    "title": "GE2025: People’s Power Party to contest in Ang Mo Kio GRC, led by party treasurer William Lim",
    "description": "The opposition party says it is running in Ang Mo Kio GRC as its manifesto takes aim at the “mismanagement” of population policies for the past 20 years under Senior Minister Lee Hsien Loong.",
    "link": "https://www.channelnewsasia.com/singapore/ge2025-peoples-power-party-contest-ang-mo-kio-grc-5046491",
    "timestamp": "2025-04-05T07:10:07Z"
  },
  {
    "title": "‘Babus never understood the business...’: X user sparks debate on what really built Indian IT",
    "description": "The exchange comes just as the Indian IT industry stares down renewed pressure, this time from outside its borders.",
    "link": "https://www.businesstoday.in/latest/trends/story/babus-never-understood-the-business-x-user-sparks-debate-on-what-really-built-indian-it-470831-2025-04-05",
    "timestamp": "2025-04-05T07:06:52Z"
  },
  {
    "title": "Trump's administration moves to reduce America's $36 trillion debt, sells federal land",
    "description": "The President Donald Trump administration is considering using proceeds from sold federal land to reduce the nation's $36 trillion debt. However, the move, according to POLITICO, is receiving a stiff opposition from the Democrats at the upper legislative cham…",
    "link": "https://dailypost.ng/2025/04/05/trumps-administration-moves-to-reduce-americas-36-trillion-debt-sells-federal-land/",
    "timestamp": "2025-04-05T07:06:09Z"
  },
  {
    "title": "Chodorow: Trump, Musk, Senate Republicans, And Your Taxes",
    "description": "Slate: Why Withholding Your Taxes in Protest Could Actually Help Trump and Musk, by Adam Chodorow (Arizona State; Google Scholar): It’s tax season, and if you’re upset about how things are going in government right now, you might be tempted to protest by with…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/04/trump-musk-senate-republicans-taxes.html",
    "timestamp": "2025-04-05T07:05:00Z"
  },
  {
    "title": "Ishiba exploring possibility of phone talks and meeting with Trump over tariffs",
    "description": "Prime Minister Shigeru Ishiba is exploring the possibility of a telephone conversation with U.S. President Donald Trump, calling his imposition of reciprocal tariffs a &quot;national crisis&quot; that requires an &quot;unprecedented&quot; response. Ishiba tol…",
    "link": "https://japantoday.com/category/politics/update2-japan-pm-exploring-possibility-of-phone-talks-with-trump-over-tariffs",
    "timestamp": "2025-04-05T07:02:48Z"
  },
  {
    "title": "China has a chance to play elder economic statesman",
    "description": "China is seizing a soft-power opportunity amid President Trump’s sweeping global tariffs, presenting itself as a defender of the global economic order rather than its disruptor. While retaliating with a 34% tariff and targeted curbs on U.S. goods like rare ea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-has-a-chance-to-play-elder-economic-statesman/articleshow/120006326.cms",
    "timestamp": "2025-04-05T07:01:35Z"
  },
  {
    "title": "US starts collecting Trump’s new 10% tariff, smashing global trade norms",
    "description": "Trump’s tariffs impact world markets, causing record $5 trillion loss in S&P 500 value",
    "link": "https://www.irishtimes.com/world/us/2025/04/05/us-starts-collecting-trumps-new-10-tariff-smashing-global-trade-norms/",
    "timestamp": "2025-04-05T07:00:46Z"
  },
  {
    "title": "Arctic Sea Ice Melt Exposes US to New Threat",
    "description": "This summer will see record low Arctic ice and Russia has stolen a march on militarizing the strategic region.",
    "link": "https://www.newsweek.com/arctic-united-states-climate-russia-2054872",
    "timestamp": "2025-04-05T07:00:01Z"
  },
  {
    "title": "About 500 law firms sign brief challenging Trump's executive orders targeting legal community",
    "description": "Over 500 law firms filed a brief opposing President Trump's executive orders that retaliate against elite legal firms. They argue these orders threaten constitutional governance and the rule of law, as they impose restrictions on security clearances, federal …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/about-500-law-firms-sign-brief-challenging-trumps-executive-orders-targeting-legal-community/articleshow/120006334.cms",
    "timestamp": "2025-04-05T06:59:35Z"
  },
  {
    "title": "Myanmar quake death toll passes 3,300: state media",
    "description": "The death toll from a major earthquake in Myanmar has risen above 3,300, state media said Saturday, as the United Nations aid chief made a renewed call for the world to help the disaster-struck nation. The March 28 quake flattened buildings and destroyed infr…",
    "link": "https://www.digitaljournal.com/world/myanmar-quake-death-toll-passes-3300-state-media/article",
    "timestamp": "2025-04-05T06:57:20Z"
  },
  {
    "title": "Myanmar Quake Death Toll Passes 3,300: State Media",
    "description": "The death toll from a major earthquake in Myanmar has risen above 3,300, state media said Saturday, as the United Nations aid chief made a renewed call for the world to help the disaster-struck nation.",
    "link": "https://www.ibtimes.com/myanmar-quake-death-toll-passes-3300-state-media-3768903",
    "timestamp": "2025-04-05T06:57:06Z"
  },
  {
    "title": "Tariffs, Crashing Equities, Recession? - What On Earth Is Going On?",
    "description": "Liberation Day has crashed stocks - is this on purpose and will America and Europe suffer a recession as companies bring a halt to investing",
    "link": "https://www.forbes.com/sites/mikeosullivan/2025/04/05/tariffs-crashing-equities-recessionwhat-on-earth-is-going-on/",
    "timestamp": "2025-04-05T06:56:12Z"
  },
  {
    "title": "Japan must act swiftly, strategically in face of Trump tariffs",
    "description": "U.S. President Donald Trump's shocking new tariff plan may put an end to the era of free trade that has fueled global economic growth since World War II. The world now fears a repeat of the 1930s debacle -- when nations, scrambling to protect domestic industr…",
    "link": "https://biztoc.com/x/ae1a6be909cb8fb5",
    "timestamp": "2025-04-05T06:54:14Z"
  },
  {
    "title": "Senate GOP approves framework for Trump's tax breaks and spending cuts after all-night session",
    "description": "Senate Republicans pushed forward with their tax cut and spending reduction plan despite Democratic opposition and economic concerns, passing a significant framework by a 51-48 vote. The plan includes $4.5 trillion in tax breaks and $2 trillion in budget cuts…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/senate-gop-approves-framework-for-trumps-tax-breaks-and-spending-cuts-after-all-night-session/articleshow/120006033.cms",
    "timestamp": "2025-04-05T06:49:24Z"
  },
  {
    "title": "More tariffs insights from Fstoppers, Norhtrup and TheVerge",
    "description": "In the video above from Fstoppers, you can clearly see the confusion over these tariffs. In fact, prices will go up on every item, including those made in the US, since everyone relies on parts and raw materials made in different countries. And no, the tariff…",
    "link": "https://www.mirrorlessrumors.com/more-tariffs-insights-from-fstoppers-norhtrup-and-theverge/",
    "timestamp": "2025-04-05T06:46:00Z"
  },
  {
    "title": "Senate GOP pushes Trump budget framework through after marathon vote series",
    "description": "An amended version of the House-passed Trump budget was voted on at the end of a marathon vote series in the Senate.",
    "link": "https://www.foxnews.com/politics/senate-gop-pushes-trump-budget-framework-through-after-marathon-vote-series",
    "timestamp": "2025-04-05T06:45:07Z"
  },
  {
    "title": "JP Morgan Predicts US Recession By Year End Amid Donald Trump's Tariffs",
    "description": "Donald Trump announced, on April 2, the imposition of reciprocal tariffs on many countries as a part of his administration&#039;s attempt to rebalance trade relationships with major US trading partners.",
    "link": "https://www.ndtv.com/world-news/jp-morgan-predicts-us-recession-by-year-end-amid-donald-trumps-tariffs-8092248",
    "timestamp": "2025-04-05T06:44:33Z"
  },
  {
    "title": "AI avatar tried to argue a case before New York court — but judges weren’t having it",
    "description": "On the video screen appeared a smiling, youthful-looking man with a sculpted hairdo, button-down shirt and sweater.",
    "link": "https://nypost.com/2025/04/05/us-news/new-york-court-addressed-by-ai-avatar-to-argue-case/",
    "timestamp": "2025-04-05T06:43:49Z"
  },
  {
    "title": "Stock market slide: Akhilesh Yadav says common people losing money, blames Centre",
    "description": "Akhilesh Yadav blames the central government for the economic slump as common people lose their savings due to a market plunge, aggravated by US tariffs on India. He warns that this situation is dangerous for the future capital market and negatively impacts b…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/stock-market-slide-akhilesh-yadav-says-common-people-losing-money-blames-centre/articleshow/120005811.cms",
    "timestamp": "2025-04-05T06:41:39Z"
  },
  {
    "title": "Nissan says it will not take new US orders for Mexican-built Infiniti SUVs",
    "description": "Nissan has halted new U.S. orders for its Mexican-built Infiniti QX50 and QX55 SUVs in response to President Trump’s 25% auto tariffs, significantly scaling back operations at its joint venture plant with Mercedes-Benz. While production will continue for othe…",
    "link": "https://economictimes.indiatimes.com/news/international/business/nissan-says-it-will-not-take-new-us-orders-for-mexican-built-infiniti-suvs/articleshow/120005791.cms",
    "timestamp": "2025-04-05T06:41:13Z"
  },
  {
    "title": "Trump tariffs majorly target emerging economies particularly in South-East Asia: Report",
    "description": "US tariffs to lead to narrowing of growth differential between emerging markets and rest of the world, says Systematix Research report",
    "link": "https://www.thehindubusinessline.com/news/world/trump-tariffs-majorly-target-emerging-economies-particularly-in-south-east-asia-report/article69415627.ece",
    "timestamp": "2025-04-05T06:40:57Z"
  },
  {
    "title": "Donald Trump rolls out $5M ‘Gold Card’ Visa: What’s included and who’s eligible",
    "description": "President Trump introduces the $5 million 'Gold Card' visa program to attract wealthy investors and help address the national debt. This initiative replaces the EB-5 Visa, offering immediate residency and a pathway to citizenship with specific tax incentives,…",
    "link": "https://timesofindia.indiatimes.com/life-style/travel/news/donald-trump-rolls-out-5m-gold-card-visa-whats-included-and-whos-eligible/articleshow/120005411.cms",
    "timestamp": "2025-04-05T06:37:17Z"
  },
  {
    "title": "USA: Additional 10% tariffs on imports from almost all over the world effective today",
    "description": "The bill will be even bigger from 9 April for countries that export more products to the US than they import from it - tariffs on imports from China will reach 54%, from the EU 20%, for Vietnam 46% and for Japan 24%\nThe post USA: Additional 10% tariffs on imp…",
    "link": "https://en.protothema.gr/2025/04/05/usa-additional-10-tariffs-on-imports-from-almost-all-over-the-world-effective-today/",
    "timestamp": "2025-04-05T06:35:34Z"
  },
  {
    "title": "It could set the industry back 50 years: fashion braces for impact of Trump tariffs",
    "description": "From farmers to designers, the entire supply chain will be hit – but it is unclear what duties apply to a finished product\nFirst it was steel producers. Then automobiles. Now the fashion industry has been left reeling from Donald Trump’s announcement on Wedne…",
    "link": "https://biztoc.com/x/e425ed6d7dc38c97",
    "timestamp": "2025-04-05T06:32:21Z"
  },
  {
    "title": "‘It could’ve been much worse’: how UK avoided a bigger blow from Trump tariffs",
    "description": "No 10 has been criticised for ‘sucking up’ to Donald Trump, but believes its defensive strategy has been vindicated\nWhen Jonathan Reynolds gathered with officials around the large television screen in his office to watch Donald Trump unleash his global trade …",
    "link": "https://biztoc.com/x/25eb967943288f36",
    "timestamp": "2025-04-05T06:32:07Z"
  },
  {
    "title": "Botox and Viagra: Are Ireland’s most famous pharma exports safe from the impacts of tariffs?",
    "description": "Other well known drugs exported from Ireland include panadol and insulin.",
    "link": "https://www.thejournal.ie/botox-and-viagra-are-irelands-most-famous-pharma-exports-safe-from-the-impacts-of-tariffs-6668582-Apr2025/",
    "timestamp": "2025-04-05T06:30:45Z"
  },
  {
    "title": "US starts collecting Trump's new 10% tariff, smashing global trade norms",
    "description": "WASHINGTON: US customs agents began collecting President Donald Trump's unilateral 10% tariff on all imports from various countries on Saturday (April 5), with higher levies on goods from 57 larger trading partners set to start next week. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/05/us-starts-collecting-trump039s-new-10-tariff-smashing-global-trade-norms",
    "timestamp": "2025-04-05T06:29:00Z"
  },
  {
    "title": "Trump's global tariff takes effect in dramatic US trade shift",
    "description": "U.S. President Donald Trump's widest-ranging tariffs to date took effect Saturday, in a move which could trigger retaliation and escalating trade tensions that could upset the global economy.",
    "link": "https://www.hurriyetdailynews.com/trumps-global-tariff-takes-effect-in-dramatic-us-trade-shift-207704",
    "timestamp": "2025-04-05T06:26:21Z"
  },
  {
    "title": "US TikTok ban delayed again after China stalls on deal over tariffs",
    "description": "Donald Trump has delayed a potential ban on TikTok for a second time - after China reportedly stalled on a deal to sell its US operations in response to his \"Liberation Day\" tariffs.",
    "link": "https://news.sky.com/story/us-tiktok-ban-delayed-again-after-china-stalls-on-deal-over-tariffs-13342163",
    "timestamp": "2025-04-05T06:23:00Z"
  },
  {
    "title": "Russian strike kills 18 in Zelensky's home city",
    "description": "A Russian ballistic missile strike on Ukrainian President Volodymyr Zelensky's home city of Kryvyi Rig killed 18 people, among them nine children, authorities said.",
    "link": "https://www.hurriyetdailynews.com/russian-strike-kills-18-in-zelenskys-home-city-207703",
    "timestamp": "2025-04-05T06:22:49Z"
  },
  {
    "title": "Think. Over the week",
    "description": "The week was dominated by the news on Trump tariff tremors. The Editorial section also dissected the ramifications of the disarray caused to global trade and economy by US President Donald Trump’s ‘reciprocal tariff’ and its impact for the India economy. The …",
    "link": "https://www.thehindubusinessline.com/newsletter/nl-opinion/think-over-the-week/article69415620.ece",
    "timestamp": "2025-04-05T06:19:39Z"
  },
  {
    "title": "Liberal Author Shreds Billionaire CNBC Guest: 'I Cannot Believe What I'm Listening To'",
    "description": "Derek Thompson tore apart investor Kyle Bass for arguing in favor of Donald Trump's \"thoughtful\" tariffs.",
    "link": "https://www.huffpost.com/entry/derek-thompson-billionaire-investor-cnbc-trump-tariffs_n_67f0af4ce4b0f761e0740218",
    "timestamp": "2025-04-05T06:18:10Z"
  },
  {
    "title": "Will intergovernmental institutions withstand the end of the \"American Empire\"?, by Thierry Meyssan",
    "description": "The upheaval we are witnessing with Trumpism affects the United States, its national relations, and the domestic political life of its allies. It may seem strange that European leaders would criticize the President of the United States for his policies at hom…",
    "link": "https://www.voltairenet.org/article222027.html",
    "timestamp": "2025-04-05T06:15:13Z"
  },
  {
    "title": "Did Warren Buffett really call Trump’s tariff ‘the best economic move in 50 years’?",
    "description": "Warren Buffett has publicly denied claims circulating on social media that he endorsed Donald Trump’s sweeping new tariffs, which triggered a global stock market crash and wiped trillions off valuations. As markets reeled and false quotes flooded X and Truth …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-warren-buffett-really-call-trumps-tariff-move-the-best-economic-move-in-50-years-berkshire-issues-statement/articleshow/120003589.cms",
    "timestamp": "2025-04-05T06:12:19Z"
  },
  {
    "title": "Tariffs stir talks: India, Vietnam and Israel hustle for deals with team Trump",
    "description": "India, Vietnam, and Israel engage in talks with the US after new tariffs are imposed. Vietnam aims to reduce its tariffs on US goods to zero, while Israel anticipates discussions on a 17% tariff. Negotiations signal potential trade policy adjustments under th…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/tariffs-stir-talks-india-vietnam-and-israel-hustle-for-deals-with-team-trump/articleshow/120004149.cms",
    "timestamp": "2025-04-05T06:08:59Z"
  },
  {
    "title": "Ishiba says he plans speak to Trump about tariffs in coming days",
    "description": "Prime Minister Shigeru Ishiba said that these talks could see Japan offer a fresh investment package, though he ruled out a small, piecemeal deal.",
    "link": "https://www.japantimes.co.jp/news/2025/04/05/japan/politics/ishiba-trump-phone-call-tariffs/",
    "timestamp": "2025-04-05T06:08:00Z"
  },
  {
    "title": "North Korea's Kim fires new sniper rifle while visiting troops",
    "description": "North Korean leader Kim Jong Un has test-fired a newly developed sniper rifle, state media said Saturday, as he inspected special forces whose training he said bolstered &quot;actual war capability for guaranteeing victory&quot;. Such units are among the thou…",
    "link": "https://japantoday.com/category/world/north-korea%27s-kim-fires-new-sniper-rifle-while-visiting-troops",
    "timestamp": "2025-04-05T06:05:05Z"
  },
  {
    "title": "Meta to end US fact-checking programme on Monday",
    "description": "Meta will end its US fact-checking programme on Monday, replacing it with Community Notes to provide context to misleading posts. Inspired by X’s approach, Meta aims to reduce censorship. CEO Mark Zuckerberg had cited too many mistakes and excessive censorshi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/meta-to-end-us-fact-checking-programme-on-monday/articleshow/120004467.cms",
    "timestamp": "2025-04-05T06:01:22Z"
  },
  {
    "title": "Oil prices plunge as U.S. crude inventories surge and OPEC surprises with output boost",
    "description": "Oil prices plummeted by 6.6% for West Texas Intermediate (WTI) and 6.4% for Brent, the largest drop since July 2022. U.S. crude inventories increased by 2.62 million barrels last week, surprising analysts. OPEC+ announced a significant increase in production,…",
    "link": "https://www.naturalnews.com/2025-04-05-oil-prices-plunge-us-crude-inventories-surge.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "Deep State bureaucrats defy Trump’s DEI crackdown with secret “rebranding” scheme",
    "description": "Federal employees at NASA and the State Department are circumventing Trump’s ban on DEI programs by renaming them (e.g., calling them “multicultural activities”) while keeping the same objectives. Project Veritas released footage showing employees openly disc…",
    "link": "https://www.naturalnews.com/2025-04-05-bureaucrats-defy-trump-dei-crackdown-secret-rebranding.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "Putin launches largest military call-up since 2011 amid escalating tensions",
    "description": "President Vladimir Putin has initiated Russia’s largest conscription since 2011, drafting 160,000 young men and women (ages 18–30) to expand its military to 2.39 million personnel. The move signals Russia’s long-term military commitment amid the Ukraine confl…",
    "link": "https://www.naturalnews.com/2025-04-05-putin-launches-largest-military-callup-since-2011.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "ChatGPT’s cowardly DOUBLE STANDARD: Bowing before Islam while mocking Christianity",
    "description": "ChatGPT refuses to generate images of the Prophet Muhammad due to fears of violent backlash while freely making jokes about Jesus Christ – revealing inconsistent enforcement of religious sensitivity. OpenAI openly admits its ban on depicting Muhammad is not b…",
    "link": "https://www.naturalnews.com/2025-04-05-chatgpt-double-standard-bowing-islam-mocking-christianity.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "The Trump effect: RECORD LOW in illegal border crossings signals a new era of border security",
    "description": "March 2025 saw a record-low 7,181 illegal border apprehensions – a dramatic drop from previous highs (e.g., 211,181 in 2022) – attributed to President Donald Trump’s policies. The administration’s strict immigration measures, including military deployments an…",
    "link": "https://www.naturalnews.com/2025-04-05-record-low-crossings-new-era-national-security.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "Global markets plunge as China retaliates with 34% tariffs on U.S. goods",
    "description": "China has imposed a 34% tariff on all U.S. imports starting April 10, escalating the ongoing trade war in response to President Trump’s reciprocal tariffs. Global financial markets reacted with panic, with major indices like the S&P 500 and Stoxx Europe 600 e…",
    "link": "https://www.naturalnews.com/2025-04-05-china-retaliates-with-tariffs-on-us-goods.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "Chief Justice Roberts faces scrutiny over ties to anti-Trump legal strategist Norm Eisen",
    "description": "Chief Justice John G. Roberts Jr. is facing scrutiny for his close personal relationship with Norm Eisen, a Democratic legal strategist and former Obama administration official involved in prosecuting President Donald Trump and his allies. The controversy aro…",
    "link": "https://www.naturalnews.com/2025-04-05-chief-justice-faces-scrutiny-ties-norm-eisen.html",
    "timestamp": "2025-04-05T06:00:00Z"
  },
  {
    "title": "Trump Tariff Shock Rips Up Germany’s China Strategy Under Merz",
    "description": "German Chancellor-in-waiting Friedrich Merz faces the prospect of being forced into another pivot before he even takes office.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariff-shock-rips-up-germanys-china-strategy-under-merz",
    "timestamp": "2025-04-05T05:55:37Z"
  },
  {
    "title": "Wall Street’s one-day loss tops the entire crypto market cap",
    "description": "The United States stock market lost more in value over the April 4 trading day than the entire cryptocurrency market is worth, as fears over US President Donald Trump's tariffs continue to ramp up.On April 4, the US stock market lost $3.25 trillion — around $…",
    "link": "https://cointelegraph.com/news/united-states-stock-market-decline-market-cap-crypto-wall-street",
    "timestamp": "2025-04-05T05:54:02Z"
  },
  {
    "title": "Trump’s Anti-Imperial Imperialism",
    "description": "A few years ago, The Nation published an article debunking the myth that Donald Trump was an anti-imperial President. The article highlights the false perception held by a wide number of MAGA supporters and purported or former leftists: that Trump desired to …",
    "link": "https://www.counterpunch.org/2025/04/05/trumps-anti-imperial-imperialism/",
    "timestamp": "2025-04-05T05:53:14Z"
  },
  {
    "title": "US consumers rush to buy big-ticket items before Trump's tariffs kick in",
    "description": "U.S. consumers are rushing to buy big-ticket items before new tariffs take effect, increasing prices on imports from countries like Taiwan and Mexico. John Gutierrez and Rob Blackwell secured purchases of a laptop and car, respectively, to avoid the impact of…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-consumers-rush-to-buy-big-ticket-items-before-trumps-tariffs-kick-in/articleshow/120004178.cms",
    "timestamp": "2025-04-05T05:40:08Z"
  },
  {
    "title": "Voltaire, International Newsletter N°127",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. Voltaire, International Newsletter is…",
    "link": "https://www.voltairenet.org/article222025.html",
    "timestamp": "2025-04-05T05:38:35Z"
  },
  {
    "title": "Bengaluru and Pune property prices are in danger due to Trump tariff fallout, CA warns",
    "description": "The 26% tariff on Indian imports by the Trump administration has raised concerns about a possible US recession impacting Indian IT hubs like Bengaluru and Pune. Analysts warn of a domino effect affecting the real estate market linked to IT growth. While some …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/bengaluru-and-pune-property-prices-are-in-danger-due-to-trump-tariff-fallout-ca-warns/articleshow/120003924.cms",
    "timestamp": "2025-04-05T05:36:43Z"
  },
  {
    "title": "\"He's At Peak Of Not Giving A F***\": US Official On Trump's Trade Chaos",
    "description": "Donald Trump hit the golf course ahead of a candlelight dinner Friday despite global turmoil over his tariff plans -- underscoring his desire to do things his way in an increasingly hardline second term.",
    "link": "https://www.ndtv.com/world-news/donald-trump-brushes-off-trade-chaos-with-defiance-and-golf-8091903",
    "timestamp": "2025-04-05T05:34:59Z"
  },
  {
    "title": "From Ray-Bans to wigs, US buyers may see unexpected price hikes",
    "description": "As the new levies take effect, manufacturers and suppliers of everything from daily supermarket goods to shoes have to figure out how much of this extra cost to pass on to customers",
    "link": "https://www.bloomberg.com/news/articles/2025-04-05/from-ray-bans-to-wigs-us-buyers-may-see-unexpected-price-hikes",
    "timestamp": "2025-04-05T05:33:19Z"
  },
  {
    "title": "Don’t fall for this reductive dichotomy designed to divide",
    "description": "When it comes to examples of binary or dichotomous thinking, we don’t need to look very hard to find one of the most prominent examples on Earth in recent memory — Donald Trump 2.0.",
    "link": "https://thewest.com.au/opinion/lanna-hill-dont-fall-for-this-reductive-dichotomy-designed-to-divide--c-18261348",
    "timestamp": "2025-04-05T05:23:17Z"
  },
  {
    "title": "Fractious Republicans Seek Unity Over Trump Tax Cuts",
    "description": "US senators were set to vote Saturday on unlocking trillions of dollars for sweeping tax cuts promised by President Donald Trump, despite bitter infighting among the majority Republicans over the savings that will be needed to fund them.",
    "link": "https://www.ibtimes.com/fractious-republicans-seek-unity-over-trump-tax-cuts-3768900",
    "timestamp": "2025-04-05T05:21:21Z"
  },
  {
    "title": "Factories under threat, Southeast Asian countries look to court Trump to ease the pain",
    "description": "Southeast Asian nations like Vietnam, Thailand, and Cambodia are opting to negotiate rather than retaliate against President Trump’s new tariffs—ranging from 10% to 50%—to preserve their vital U.S. export access. Vietnam, heavily impacted with a 46% tariff, i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/factories-under-threat-southeast-asian-countries-look-to-court-trump-to-ease-the-pain/articleshow/120003308.cms",
    "timestamp": "2025-04-05T05:20:48Z"
  },
  {
    "title": "Fractious Republicans seek unity over Trump tax cuts",
    "description": "US senators were set to vote Saturday on unlocking trillions of dollars for sweeping tax cuts promised by President Donald Trump, despite bitter infighting among the majority Republicans over the savings that will be needed to fund them. The row comes with Wa…",
    "link": "https://www.digitaljournal.com/world/fractious-republicans-seek-unity-over-trump-tax-cuts/article",
    "timestamp": "2025-04-05T05:17:32Z"
  },
  {
    "title": "America’s passion for tariffs rarely pays off, economists warn",
    "description": "Long before Donald Trump’s “Liberation Day” announcement, the United States had toyed with imposing high tariffs throughout its history, with inconclusive — and sometimes catastrophic — results. “We have a 20th century president in a 21st century economy who …",
    "link": "https://www.digitaljournal.com/world/americas-passion-for-tariffs-rarely-pays-off-economists-warn/article",
    "timestamp": "2025-04-05T05:17:32Z"
  },
  {
    "title": "America's Passion For Tariffs Rarely Pays Off, Economists Warn",
    "description": "Long before Donald Trump's \"Liberation Day\" announcement, the United States had toyed with imposing high tariffs throughout its history, with inconclusive -- and sometimes catastrophic -- results.",
    "link": "https://www.ibtimes.com/americas-passion-tariffs-rarely-pays-off-economists-warn-3768899",
    "timestamp": "2025-04-05T05:15:22Z"
  },
  {
    "title": "The seven steps of Trump’s tariff playbook",
    "description": "BCA Research’s Marko Papic says Trump is following his ‘maxiumum pressure’ negotiating style and will walk back his extreme trade positions",
    "link": "https://www.irishtimes.com/business/2025/04/05/the-seven-steps-of-trumps-tariff-playbook/",
    "timestamp": "2025-04-05T05:15:00Z"
  }
]