[
  {
    "title": "IMF asks for urgent clarification from Pakistan over 2,000MW power allocation to Bitcoin mining",
    "description": "The International Monetary Fund (IMF) wants Pakistan to urgently clarify its plans for allocating power to Bitcoin mining amid the country’s electricity shortages and fiscal problems, according to a local news report. The IMF delegation is expected to hold a …",
    "link": "https://cryptoslate.com/imf-asks-for-urgent-clarification-from-pakistan-over-2000mw-power-allocation-to-bitcoin-mining/",
    "timestamp": "2025-06-01T17:00:49Z"
  },
  {
    "title": "Elon Musk Trying to Figure Out Who’s to Blame for His Massive Unpopularity",
    "description": "After fleeing DC to go watch yet another SpaceX rocket blow up in Texas, Elon Musk is now whining about how everyone hates him and his attempts to make America austere again. In a rare interview, Musk intimated to the Washington Post that he was very surprise…",
    "link": "https://futurism.com/elon-musk-ponders-unpopularity",
    "timestamp": "2025-06-01T17:00:44Z"
  },
  {
    "title": "Ukraine conflict a NATO ‘proxy war’ - Trump envoy",
    "description": "US special envoy Keith Kellogg has echoed Moscow’s characterization of the hostilities Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618457-ukraine-conflict-nato-proxy-war/",
    "timestamp": "2025-06-01T17:00:24Z"
  },
  {
    "title": "Ceasefire At Risk? Israel Admits To Killing New Hamas Chief",
    "description": "Israel has admitted to the killing of the new chief of the terrorist group Hamas. Will this put the ceasefire agreement at risk as tensions escalate?",
    "link": "https://www.shtfplan.com/headline-news/ceasefire-at-risk-israel-admits-to-killing-new-hamas-chief",
    "timestamp": "2025-06-01T17:00:22Z"
  },
  {
    "title": "NYT: U.S. floats Mideast nuclear power coalition amid reports of Iran's uptick in uranium enrichment",
    "description": "U.S. officials told The New York Times that Washington continues to demand Iran halt its uranium enrichment. A Western source told Haaretz the recent increase in enrichment is significant enough to enable Iran to carry out a nuclear test within months",
    "link": "https://www.haaretz.com/israel-news/2025-06-01/ty-article/nyt-u-s-floats-nuclear-power-coalition-amid-reports-of-irans-uranium-enrichment/00000197-2a8e-dd58-add7-2bdfa8970000",
    "timestamp": "2025-06-01T16:59:27Z"
  },
  {
    "title": "Hasset: Trump, Xi may speak next week",
    "description": "United States National Economic Council (NEC) Director Kevin Hassett said on Sunday that he expects President Donald Trump and his Chinese counterpart Xi Jinping \"to have a wonderful conversation\" abo...",
    "link": "https://biztoc.com/x/3db6dd290f9b86d6",
    "timestamp": "2025-06-01T16:58:27Z"
  },
  {
    "title": "‘Reckless and Dangerous:’ Nadler Attacks Trump After DHS Detained His Staffer",
    "description": "Rep. Jerrold Nadler blasted Donald Trump and the Department of Homeland Security after officers detained a staff member at his district office.",
    "link": "http://www.rollingstone.com/politics/politics-news/nadler-dhs-trump-detained-staffer-1235352170/",
    "timestamp": "2025-06-01T16:56:27Z"
  },
  {
    "title": "‘Extreme buffoonery and a mean spirit’: Top Republican strategist singles out ‘toxic brew’ of likely 2028 Dem contender",
    "description": "'You're not for anything that's on the right side of any of the 80-20 issues that are driving this cultural divide in America'",
    "link": "https://www.wnd.com/2025/06/extreme-buffoonery-and-a-mean-spirit-top-republican-strategist-singles-out-toxic-brew-of-likely-2028-dem-contender/",
    "timestamp": "2025-06-01T16:47:14Z"
  },
  {
    "title": "Turmoil, worry swirl over cuts to key federal agencies as hurricane season begins",
    "description": "WASHINGTON (AP) — With predictions for a busy hurricane season beginning Sunday, experts in storms and disasters are worried about something potentially as chaotic as the swirling winds: Massive cuts to the federal system that forecasts, tracks and responds t…",
    "link": "https://freerepublic.com/focus/f-news/4320341/posts",
    "timestamp": "2025-06-01T16:43:37Z"
  },
  {
    "title": "Scott Jennings Roasts Clueless Democrat Congresswoman With a Brutal Statement Regarding Her Party and Reveals Who He Thinks Should Lead the Democrats (VIDEO)",
    "description": "One of the few bright lights on the channel, sometimes referred to as the Clinton News Network, has been a conservative strategist and Trump supporter, Scott Jennings.\nThe post Scott Jennings Roasts Clueless Democrat Congresswoman With a Brutal Statement Rega…",
    "link": "https://www.thegatewaypundit.com/2025/06/scott-jennings-roasts-clueless-democrat-congresswoman-brutal-statement/",
    "timestamp": "2025-06-01T16:40:21Z"
  },
  {
    "title": "Trump issues 5-word statement about Jill Biden being subpoenaed over Biden's mental health - NewsBreak",
    "description": "U.S President Donald Trump has officially broken his silence over whether or not he believed Jill Biden, the wife of former president Joe Biden, should be",
    "link": "https://www.newsbreak.com/share/4031082423530-trump-issues-5-word-statement-about-jill-biden-being-subpoenaed-over-biden-s-mental-health?s=a2&amp;share_destination_id=MjA3NDk1MDQxLTE3NDg3OTU4Nzk0NjU%3D&amp;pd=0E2cwDBz&amp;hl=en_US&amp;send_time=1748795879&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.21.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v6%2Cns_foryou_recall_exp_25q2-v7%2Cns_foryou_blend_exp_25q2-v6",
    "timestamp": "2025-06-01T16:38:23Z"
  },
  {
    "title": "Trump-Musk ties strain as Isaacman ousted, Musk exits DOGE; NYT alleges drug use",
    "description": "US president Donald Trump and tech billionaire Elon Musk appear to be drifting apart after a series of high-profile moves involving their close associates, political roles, and a damaging media report. Trump withdrew his pick of Jared Isaacman to lead NASA, w…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-musk-ties-strain-as-isaacman-ousted-musk-exits-doge-nyt-alleges-drug-use/articleshow/121552412.cms",
    "timestamp": "2025-06-01T16:36:30Z"
  },
  {
    "title": "Donald Trump shares false social media post saying Joe Biden was 'executed in 2020'",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d7d5418b-8a79-458d-bb30-75fccf70b943",
    "timestamp": "2025-06-01T16:30:27Z"
  },
  {
    "title": "Is the US losing its place as the world leader in science?",
    "description": "Will the double whammy of cracking down on immigrants and defunding research weaken the US as a research hub?",
    "link": "https://www.aljazeera.com/program/the-bottom-line/2025/6/1/is-the-us-losing-its-place-as-the-world-leader-in-science",
    "timestamp": "2025-06-01T16:30:00Z"
  },
  {
    "title": "Putin wants a UN Security Council meeting?",
    "description": "@MonitorX99800 Russian President Vladimir Putin calls for an emergency security council meeting. Big russian response, possible nuclear strikes expected in coming hours.",
    "link": "https://freerepublic.com/focus/f-chat/4320338/posts",
    "timestamp": "2025-06-01T16:28:16Z"
  },
  {
    "title": "US says trade row with China could ease after Trump-Xi talks",
    "description": "US officials suggest a potential breakthrough in trade talks with China hinges on an upcoming conversation between Presidents Trump and Xi Jinping. Frustration arose from China's alleged delay in export license approvals for rare earths, despite a previous ag…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-says-trade-row-with-china-could-ease-after-trump-xi-talks/articleshow/121552328.cms",
    "timestamp": "2025-06-01T16:27:31Z"
  },
  {
    "title": "Grupo Firme Cancel US Show After Visa Suspended by Trump Administration",
    "description": "The popular Mexican group had been scheduled to perform at the La Onda Festival this weekend.\nGrupo Firme Cancel US Show After Visa Suspended by Trump Administration\nJaeden Pinder",
    "link": "https://consequence.net/2025/06/grupo-firme-visa-suspend-festival-canceled/",
    "timestamp": "2025-06-01T16:27:06Z"
  },
  {
    "title": "Zelensky Calls Meetings With Putin 'Meaningless' And Asks For More Military Aid",
    "description": "Zelensky Calls Meetings With Putin 'Meaningless' And Asks For More Military Aid\n \nEarlier this week, Ukrainian President Volodymyr Zelensky called for a three-way summit with Donald Trump and Vladimir Putin, likely in response to Russia's accelerated gains on…",
    "link": "https://biztoc.com/x/d02d9ca651b35276",
    "timestamp": "2025-06-01T16:24:53Z"
  },
  {
    "title": "Trump, Xi likely to speak soon on minerals trade dispute, aides say",
    "description": "Donald Trump and Xi Jinping are expected to discuss trade matters soon. This includes a disagreement over crucial minerals. Scott Bessent mentioned that China is restricting products vital for industrial supply chains. Trump believes this violates a previous …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-xi-likely-to-speak-soon-on-minerals-trade-dispute-aides-say/articleshow/121552287.cms",
    "timestamp": "2025-06-01T16:23:55Z"
  },
  {
    "title": "Trump, Xi likely to speak soon on minerals trade dispute, aides say",
    "description": "WASHINGTON: US President Donald Trump and Chinese President Xi Jinping will speak soon to iron out trade issues including a dispute over critical minerals, Treasury Secretary Scott Bessent said on Sunday (Jun 1).",
    "link": "https://www.channelnewsasia.com/world/trump-xi-likely-speak-soon-minerals-trade-dispute-aides-say-5161971",
    "timestamp": "2025-06-01T16:18:00Z"
  },
  {
    "title": "Trump-Pardoned Reality Star Todd Chrisley Advocates for Black Prisoners",
    "description": "“They were denied programming. They were denied access to certain things.”",
    "link": "https://www.complex.com/pop-culture/a/treyalston/trump-pardoned-reality-star-todd-chrisley-advocates-black-prisoners",
    "timestamp": "2025-06-01T16:15:15Z"
  },
  {
    "title": "'Deflection': Fox News host busts Elon Musk for dodging drug use question",
    "description": "Fox News host Howard Kurtz called out billionaire DOGE administrator Elon Musk for deflecting questions about his alleged drug abuse.\n\n\"At the Oval Office Presser, Fox's Peter Ducey started to ask Musk about a detailed report on his allegedly frequent drug us…",
    "link": "https://www.rawstory.com/elon-musk-use-deflection/",
    "timestamp": "2025-06-01T16:09:57Z"
  },
  {
    "title": "Can Trump fix the national debt? Republican senators, many investors and even Elon Musk have doubts",
    "description": "President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package.",
    "link": "https://www.news4jax.com/news/politics/2025/06/01/can-trump-fix-the-national-debt-republican-senators-many-investors-and-even-elon-musk-have-doubts/",
    "timestamp": "2025-06-01T16:08:23Z"
  },
  {
    "title": "Kevin Hassett 'very, very confident' courts will back Trump's tariffs amid legal setback",
    "description": "Amid court challenges, the White House asserts confidence in President Donald Trump's tariff strategy, emphasizing the administration's focus on maintaining fair trade practices.",
    "link": "https://www.foxnews.com/politics/kevin-hassett-very-very-confident-courts-back-trumps-tariffs-amid-legal-setback",
    "timestamp": "2025-06-01T16:06:29Z"
  },
  {
    "title": "Russia and Ukraine step up the war on eve of peace talks",
    "description": "Ukraine attacked Russia's nuclear-capable bombers on Sunday, a security official said.",
    "link": "https://www.euractiv.com/section/politics/news/russia-and-ukraine-step-up-the-war-on-eve-of-peace-talks/",
    "timestamp": "2025-06-01T16:04:09Z"
  },
  {
    "title": "The Dollar’s Dominance Is Unwinding in Asia",
    "description": "As Donald Trump tries to remake global trade, the dollar’s historic dominance in Asia is under pressure. After Taiwan’s currency saw the biggest surge against the dollar in almost 40 years in early May, some money managers are saying the spike signals the acc…",
    "link": "https://biztoc.com/x/aace3342ede1a690",
    "timestamp": "2025-06-01T16:02:39Z"
  },
  {
    "title": "Trump and Xi are likely to talk soon about trade, though no date has been set, Hassett says",
    "description": "National Economic Council director Kevin Hassett suggested on Sunday that President Donald Trump and China's President Xi Jinping could have a conversation about trade as soon as this week.\nHassett said, however, that a specific date for a conversation betwee…",
    "link": "https://biztoc.com/x/256634672032689d",
    "timestamp": "2025-06-01T16:02:27Z"
  },
  {
    "title": "Meet the Press – June 1, 2025",
    "description": "Rep. Mike Johnson (R) Speaker of the House, Sen. Raphael Warnock (D-Ga.), Lanhee Chen, Jeh Johnson, Jonathan Martin, Kelly O'Donnell",
    "link": "https://www.nbcnews.com/meet-the-press/june-1-2025-n1312211",
    "timestamp": "2025-06-01T16:02:00Z"
  },
  {
    "title": "'Money Printing' Will Lift Bitcoin to $250K This Year: Arthur Hayes",
    "description": "Bitcoin’s price will more than double within the next six months, according to BitMEX founder Arthur Hayes. Here's why he expects the surge.",
    "link": "https://decrypt.co/323135/money-printing-lift-bitcoin-250k-this-year-arthur-hayes",
    "timestamp": "2025-06-01T16:01:02Z"
  },
  {
    "title": "New Jersey gubernatorial candidates gear up for competitive primary in early test of Trump's 2nd term",
    "description": "New Jersey voters will choose their Democrat and Republican nominees for governor on June 10, closing out competitive primary contests.",
    "link": "https://www.foxnews.com/politics/new-jersey-gubernatorial-candidates-gear-up-competitive-primary-early-test-trumps-2nd-term",
    "timestamp": "2025-06-01T16:00:58Z"
  },
  {
    "title": "Hamas Says US 'Violates the Integrity and Fairness' in Israel Peace Talks",
    "description": "Hamas has accused the United States of showing \"complete bias\" toward Israel in ongoing ceasefire talks.",
    "link": "https://www.newsweek.com/hamas-says-us-violates-integrity-fairness-israel-peace-talks-2079493",
    "timestamp": "2025-06-01T16:00:40Z"
  },
  {
    "title": "President Trump Sets the Internet On Fire After Sharing a Wild and Provocative Theory About Joe Biden",
    "description": "President Trump has sent the country into an uproar after sharing what his haters are calling a “conspiracy theory” regarding Joe Biden.\nThe post President Trump Sets the Internet On Fire After Sharing a Wild and Provocative Theory About Joe Biden appeared fi…",
    "link": "https://www.thegatewaypundit.com/2025/06/president-trump-sets-internet-fire-after-sharing-wild/",
    "timestamp": "2025-06-01T16:00:33Z"
  },
  {
    "title": "Trump praised by faith leaders for AI leadership as they warn of technology's 'potential peril'",
    "description": "Evangelical leaders praised Trump as the \"AI President,\" and urged responsible AI development to balance economic prosperity with ethical concerns in a new letter.",
    "link": "https://www.foxnews.com/media/evangelical-leaders-urge-trump-use-ai-responsibly-raises-profound-theological-ethical-questions",
    "timestamp": "2025-06-01T16:00:31Z"
  },
  {
    "title": "Is AI Going To Kill All Of Us? One Of The Pioneers In The Field Has Warned That “Everyone Will Die” If AI Is Not Shut Down",
    "description": "AI technology has been developing at an exponential rate, and it appears to be just a matter of time before we create entities that can think millions of times faster than we do and that can do almost everything better than we can.  So what is going to happen…",
    "link": "https://www.activistpost.com/is-ai-going-to-kill-all-of-us-one-of-the-pioneers-in-the-field-has-warned-that-everyone-will-die-if-ai-is-not-shut-down/",
    "timestamp": "2025-06-01T16:00:00Z"
  },
  {
    "title": "NBC’s Kristen Welker Grills Mike Johnson on Massive Budget Bill: Will Trump ‘Own’ the Debt?",
    "description": "House Speaker Mike Johnson defended President Donald Trump’s sweeping budget proposal Sunday in an interview on NBC’s Meet the Press, dismissing projections showing the legislation would add trillions to the national debt. Moderator Kristen Welker repeatedly …",
    "link": "https://www.mediaite.com/media/tv/nbcs-kristen-welker-grills-mike-johnson-on-massive-budget-bill-will-trump-own-the-debt/",
    "timestamp": "2025-06-01T15:59:28Z"
  },
  {
    "title": "Trump and Xi are likely to talk soon about trade, though no date has been set, Hassett says",
    "description": "Kevin Hassett said that a date for a conversation about trade negotiations has not been set, but it is an \"expectation\" that they will soon speak.",
    "link": "https://www.cnbc.com/2025/06/01/trump-xi-trade-china-us-tariffs.html",
    "timestamp": "2025-06-01T15:55:23Z"
  },
  {
    "title": "WATCH: Democrat Rep. Nadler's Aide Handcuffed When DHS Accuses His Office of 'Harboring Rioters'",
    "description": "Federal officials handcuffed an aide of Rep. Jerry Nadler (D-NY) in his Manhattan office on Wednesday, and the incensed congressman is pointing his finger at President Donald Trump.\nThe post WATCH: Democrat Rep. Nadler’s Aide Handcuffed When DHS Accuses His O…",
    "link": "https://www.breitbart.com/politics/2025/06/01/watch-democrat-rep-nadlers-aide-handcuffed-when-dhs-accuses-his-office-of-harboring-rioters/",
    "timestamp": "2025-06-01T15:53:07Z"
  },
  {
    "title": "Ukraine-Russia Peace Talks Scheduled Amid Escalating Drone Strikes",
    "description": "Ukrainian negotiators plan to present a proposed roadmap for a long-term peace settlement during the upcoming talks in Istanbul, according to Reuters.",
    "link": "https://www.newsweek.com/russia-ukraine-peace-talks-drone-strikes-2079485",
    "timestamp": "2025-06-01T15:52:25Z"
  },
  {
    "title": "Elon Musk Says He Doesn't Want To Take Responsibility For Trump Administration’s Actions",
    "description": "Elon Musk formally left his role as a special government employee last week, though he said he’ll continue to be “a friend and adviser” to President Donald Trump.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/06/01/elon-musk-says-he-doesnt-want-to-take-responsibility-for-trump-administrations-actions/",
    "timestamp": "2025-06-01T15:52:10Z"
  },
  {
    "title": "Transcript: Rep. Raja Krishnamoorthi on \"Face the Nation with Margaret Brennan,\" June 1, 2025",
    "description": "The following is the transcript of an interview with Rep. Raja Krishnamoorthi, Democrat of Illinois, that aired on \"Face the Nation with Margaret Brennan\" on June 1, 2025.",
    "link": "https://www.cbsnews.com/news/raja-krishnamoorthi-illinois-democrat-face-the-nation-transcript-06-01-2025/",
    "timestamp": "2025-06-01T15:50:37Z"
  },
  {
    "title": "Hakeem Jeffries Says Dems Will Take Control of House Next Year",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) predicted Sunday on CNN’s “State of the Union” that Democrats would win the majority in the House of Representatives in the 2026 midterm elections. Jeffries said, “Let me make clear that the House is a separate and…",
    "link": "https://freerepublic.com/focus/f-news/4320331/posts",
    "timestamp": "2025-06-01T15:50:31Z"
  },
  {
    "title": "George Stephanopoulos Goes Scorched Earth on Trump for ‘Unprecedented Money-Making By a Sitting President’",
    "description": "George Stephanopoulos, on Sunday, ripped President Donald Trump — calling out his \"unprecedented money-making by a sitting president.\"\nThe post George Stephanopoulos Goes Scorched Earth on Trump for ‘Unprecedented Money-Making By a Sitting President’ first ap…",
    "link": "https://www.mediaite.com/media/news/george-stephanopoulos-goes-scorched-earth-on-trump-for-unprecedented-money-making-by-a-sitting-president/",
    "timestamp": "2025-06-01T15:49:55Z"
  },
  {
    "title": "The silence of the omniscient",
    "description": "Macroeconomics has become the collateral damage of Trump’s tariff war",
    "link": "https://www.thehindubusinessline.com/opinion/the-silence-of-the-omniscient/article69646275.ece",
    "timestamp": "2025-06-01T15:49:38Z"
  },
  {
    "title": "Bill Maher Agrees with Trump as He Slams Harvard as an “A-Hole Factory” (Video)",
    "description": "President Donald Trump has made it clear that the American taxpayer will not continue funding the whiny young communists at Harvard.\nThe post Bill Maher Agrees with Trump as He Slams Harvard as an “A-Hole Factory” (Video) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/bill-maher-agrees-trump-as-he-slams-harvard/",
    "timestamp": "2025-06-01T15:45:14Z"
  },
  {
    "title": "Elon Musk's Reign of Terror Is Only Just Beginning (Alex Shephard/New Republic)",
    "description": "Alex Shephard / New Republic:\nElon Musk's Reign of Terror Is Only Just Beginning … Here's what purports to be the big story out of the White House today: “Elon's really not leaving.  He's gonna be back and forth.”  It's tempting to treat that statement, which…",
    "link": "https://www.memeorandum.com/250601/p39",
    "timestamp": "2025-06-01T15:45:00Z"
  },
  {
    "title": "Tim Walz Likens Taking on Trump to a Playground Showdown",
    "description": "Failed vice presidential candidate and Minnesota Governor Tim Walz over the weekend served up a schoolyard political strategy for his fellow Democrats – be “a little meaner” and stand up to “bully” President Donald Trump.\nThe post Tim Walz Likens Taking on Tr…",
    "link": "https://www.breitbart.com/politics/2025/06/01/30196144tim-walz-likens-taking-on-trump-to-a-playground-showdown/",
    "timestamp": "2025-06-01T15:44:43Z"
  },
  {
    "title": "India general admits jet losses in clash with Pakistan: Here’s what he said",
    "description": "Anil Chauhan, India's chief of defence staff, says India experienced losses in the air but denies six planes downed.",
    "link": "https://www.aljazeera.com/news/2025/6/1/india-general-admits-jet-losses-in-clash-with-pakistan-heres-what-he-said",
    "timestamp": "2025-06-01T15:38:36Z"
  },
  {
    "title": "GOP leader in Israel warns Trump: Iran talks endanger region",
    "description": "Marc Zell urges swift action against Iranian nuclear threat, warns Israel cannot rely on diplomacy alone.",
    "link": "https://www.israelnationalnews.com/news/409318",
    "timestamp": "2025-06-01T15:37:33Z"
  },
  {
    "title": "These families say they're leaving the U.S. because of its anti-transgender climate",
    "description": "Denver parents Brandon and Candace are spending tens of thousands of dollars to move to New Zealand in July. The reason, they said, is to protect their 9-year-old transgender daughter, Chase, from the effects of the Trump administration’s policies and an incr…",
    "link": "https://freerepublic.com/focus/f-news/4320327/posts",
    "timestamp": "2025-06-01T15:37:28Z"
  },
  {
    "title": "Can Trump fix the national debt? Republican senators, many investors and even Elon Musk have doubts (Josh Boak/Associated Press)",
    "description": "Josh Boak / Associated Press:\nCan Trump fix the national debt?  Republican senators, many investors and even Elon Musk have doubts  —  President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk th…",
    "link": "https://www.memeorandum.com/250601/p36",
    "timestamp": "2025-06-01T15:35:00Z"
  },
  {
    "title": "NATO Ally Looks to Buy US Nuclear-Capable Fighter Jets to Counter Russia",
    "description": "The purchase would signal an escalation in the UK's assessment of the threats posed by Russia.",
    "link": "https://www.newsweek.com/nato-ally-buying-nuclear-jets-counter-russia-2079473",
    "timestamp": "2025-06-01T15:29:33Z"
  },
  {
    "title": "The Biden years: When America started to resemble the late-stage USSR",
    "description": "How Washington became a gerontocracy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618454-biden-years-america-gerontocracy/",
    "timestamp": "2025-06-01T15:28:47Z"
  },
  {
    "title": "Lutnick downplays tariff court ruling impact on US-EU talks",
    "description": "US president Donald Trump and Xi Jinping likely to speak soon",
    "link": "https://www.irishtimes.com/business/economy/2025/06/01/lutnick-downplays-tariff-court-ruling-impact-on-us-eu-talks/",
    "timestamp": "2025-06-01T15:28:26Z"
  },
  {
    "title": "Was Biden Secretly Swapped With a Clone/Robot? (And If So, Why Such a Crappy Clone/Robot?)",
    "description": "Sure, as far as conspiracy theories go, it’s no “Paul Is Dead,” but our 2025 timeline is what it is, and we’ve gotta make the best of it. Thus, as of late last night, a brand-new conspiracy theory has bedazzled the nation: Was Joe Biden secretly swapped with …",
    "link": "https://freerepublic.com/focus/f-chat/4320325/posts",
    "timestamp": "2025-06-01T15:26:32Z"
  },
  {
    "title": "California Democrat Calls ICE Agents 'Terrorists'",
    "description": "San Diego City Councilmember Sean Elo-Rivera shared a photo of ICE agents on Instagram with the word \"Terrorists\" scribbled across the image.",
    "link": "https://www.newsweek.com/california-democrats-ice-agents-terrorists-2079475",
    "timestamp": "2025-06-01T15:24:23Z"
  },
  {
    "title": "U.S. communities react to Trump administration's sanctuary list",
    "description": "Communities from red to blue were left perplexed and frustrated by the DHS's list of \"sanctuary\" communities.",
    "link": "https://www.wgal.com/article/us-communities-react-to-trump-administrations-sanctuary-list/64937647",
    "timestamp": "2025-06-01T15:21:27Z"
  },
  {
    "title": "Small businesses struggle under Trump’s tariff whiplash: ‘I’m so angry that my own government has done this to me’",
    "description": "For some small businesses, the last week brought even more twists and turns to the past two months of President Donald Trump’s chaotic tariffs.\nThe situation was already confusing, with stops and starts of tariffs at different levels. Then on Wednesday, a US …",
    "link": "https://biztoc.com/x/a7ad5ad2a1634450",
    "timestamp": "2025-06-01T15:18:08Z"
  },
  {
    "title": "Spike in steel tariffs could imperil Trump promise of lower grocery prices",
    "description": "President Donald Trump’s doubling of tariffs on foreign steel and aluminum could hit Americans in an unexpected place: grocery aisles.\nThe announcement Friday of a staggering 50% levy on those imports stoked fear that big-ticket purchases from cars to washing…",
    "link": "https://biztoc.com/x/c3d68d1fa98e6971",
    "timestamp": "2025-06-01T15:18:03Z"
  },
  {
    "title": "China Urges U.S. to ‘Stop Inciting Conflict’ in Asia-Pacific Region in Blistering Response to Hegseth",
    "description": "China issued a blistering response after U.S. Defense Secretary Pete Hegseth said \"the threat China poses is real.\"",
    "link": "https://time.com/7290272/china-united-states-conflict-taiwan-pete-hegseth-threat-comments/",
    "timestamp": "2025-06-01T15:16:34Z"
  },
  {
    "title": "A turning point for Apple: it leaves iOS 18 behind and will go straight to iOS 26",
    "description": "Apple is on the verge of a major breakthrough in its operating systems. Almost two decades after the launch of the first iPhone in 2007, the versions of iOS have been increasing co",
    "link": "https://www.marca.com/en/technology/2025/06/01/683c6b90e2704ef5998b457f.html",
    "timestamp": "2025-06-01T15:16:08Z"
  },
  {
    "title": "Trump sparks Europe's 'new Enlightenment' (Elena Giordano/Politico)",
    "description": "Elena Giordano / Politico:\nTrump sparks Europe's ‘new Enlightenment’  —  The EU aims to grab a rare chance generated by the White House's repression of U.S. higher education.  —  Donald Trump's war on some of America's most iconic colleges is a major opportun…",
    "link": "https://www.memeorandum.com/250601/p32",
    "timestamp": "2025-06-01T15:15:00Z"
  },
  {
    "title": "Tim Walz claims Trump’s 2024 victory was a ‘primal scream’ from angry voters",
    "description": "\"Some of it is our own doing,\" the failed Democratic vice presidential candidate admitted.",
    "link": "https://nypost.com/2025/06/01/us-news/tim-walz-claims-trumps-2024-victory-was-a-primal-scream-from-angry-voters/",
    "timestamp": "2025-06-01T15:14:02Z"
  },
  {
    "title": "Lutnick downplays impact of tariff court ruling on US, EU talks",
    "description": "WASHINGTON (Reuters) -U.S. Commerce Secretary Howard Lutnick downplayed the impact of legal uncertainty around U.S. tariffs on negotiations with the European...",
    "link": "https://www.yahoo.com/news/lutnick-downplays-impact-tariff-court-151226584.html",
    "timestamp": "2025-06-01T15:12:26Z"
  },
  {
    "title": "Joe Biden 'got lost in his own closet at the White House while staff hid mental decline'",
    "description": "Former President Joe Biden got lost in his own closet at the White House, a Secret Service whistleblower claimed to MAGA Senator Josh Hawley. The Missouri Republican shared the intel with Fox News host Sean Hannity Friday, adding to the ongoing speculation th…",
    "link": "https://freerepublic.com/focus/f-backroom/4320321/posts",
    "timestamp": "2025-06-01T15:12:19Z"
  },
  {
    "title": "Trump shares conspiracy theory about Joe Biden 'dying in 2020' in bizarre social media repost",
    "description": "President Donald Trump shared a bizarre conspiracy theory online suggesting that his predecessor Joe Biden died in 2020 and was replaced by a 'clone'.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-shares-joe-biden-conspiracy-theory-died-2020-474509-20250601",
    "timestamp": "2025-06-01T15:11:41Z"
  },
  {
    "title": "US, China trade row could ease after Trump-Xi talks: Treasury chief",
    "description": "US Treasury Secretary Scott Bessent said Sunday that President Donald Trump could speak with China’s Xi Jinping “very soon,” and that such a call could help break the logjam in the trade talks between the world’s two biggest economies. Trump on Friday accused…",
    "link": "https://www.digitaljournal.com/world/us-china-trade-row-could-ease-after-trump-xi-talks-treasury-chief/article",
    "timestamp": "2025-06-01T15:07:20Z"
  },
  {
    "title": "What Donald Trump and Mike Johnson might be hiding | June 1 editorial cartoons",
    "description": "(Image credit: Mike Luckovich / Copyright 2025 Creators Syndicate)\n(Image credit: Phil Hands / Copyright 2025 Tribune Content Agency)\n(Image credit: Michael de Adder / Copyright 2025 Cagle Cartoons, Inc.)",
    "link": "https://biztoc.com/x/9c595b6b06c6dd56",
    "timestamp": "2025-06-01T15:06:45Z"
  },
  {
    "title": "‘They want to destroy us, and Harvard is allowing that to happen’: Kristi Noem drops truth bomb about China",
    "description": "'It's alarming the danger that our country is in'",
    "link": "https://www.wnd.com/2025/06/they-want-to-destroy-us-and-harvard-is-allowing-that-to-happen-kristi-noem-drops-truth-bomb-about-china/",
    "timestamp": "2025-06-01T15:04:42Z"
  },
  {
    "title": "Memecoin investors ‘should not be looking to the SEC for protection,’ Commissioner Hester Pierce says",
    "description": "Memecoin investors should realize that the U.S. Securities and Exchange Commission (SEC) will not come to their aid if they lose their money, Commissioner Hester Peirce told CNBC on Friday. Peirce, who was appointed by now crypto-friendly President Donald Tru…",
    "link": "https://cryptoslate.com/memecoin-investors-should-not-be-looking-to-the-sec-for-protection-commissioner-hester-pierce-says/",
    "timestamp": "2025-06-01T15:00:48Z"
  },
  {
    "title": "Trump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone (Peter Wade/Rolling Stone)",
    "description": "Peter Wade / Rolling Stone:\nTrump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone  —  “Democrats don't know the difference,” claimed a Truth Social post that the president shared  —  Donald Trump reposted a baseless con…",
    "link": "https://www.memeorandum.com/250601/p29",
    "timestamp": "2025-06-01T15:00:23Z"
  },
  {
    "title": "What Donald Trump and Mike Johnson might be hiding | June 1 editorial cartoons",
    "description": "Sunday's political cartoons include Donald Trump's golden comb-over, brain drain in America, and a new TACO presidential seal.",
    "link": "https://theweek.com/cartoons/intelligence-circles-the-drain-june-1-editorial-cartoons",
    "timestamp": "2025-06-01T15:00:00Z"
  },
  {
    "title": "Key climate target of airline decarbonisation 'in peril': IATA",
    "description": "New Delhi (AFP) – The airline industry's flagship goal of decarbonising by 2050 is now \"in peril\" due to climate-sceptic policies, including those of US President Donald Trump, the leading airline association IATA warned on Sunday. The emergence of leaders fa…",
    "link": "https://freerepublic.com/focus/f-chat/4320319/posts",
    "timestamp": "2025-06-01T14:58:24Z"
  },
  {
    "title": "Teen Dies by Suicide After Being Targeted in AI-Generated 'Sextortion' Scheme",
    "description": "A 16-year-old Kentucky boy reportedly committed suicide shortly after he was blackmailed with AI-generated nude images, an increasingly common scheme known as \"sextortion.\"\nThe post Teen Dies by Suicide After Being Targeted in AI-Generated ‘Sextortion’ Scheme…",
    "link": "https://www.breitbart.com/tech/2025/06/01/teen-dies-by-suicide-after-being-targeted-in-ai-generated-sextortion-scheme/",
    "timestamp": "2025-06-01T14:58:03Z"
  },
  {
    "title": "Trump administration reverses planned closures of 3 dozen US mine safety offices",
    "description": "By John Raby The Trump administration is dropping plans to…\nThe post Trump administration reverses planned closures of 3 dozen US mine safety offices appeared first on OHS Canada Magazine.",
    "link": "https://www.ohscanada.com/trump-administration-reverses-planned-closures-of-3-dozen-us-mine-safety-offices/",
    "timestamp": "2025-06-01T14:51:48Z"
  },
  {
    "title": "India likely to raise concerns on US’ steel tariffs in trade talks this week",
    "description": "India to raise concerns on US tariffs at upcoming trade meeting in New Delhi, seeking exemptions and resolution.",
    "link": "https://www.thehindubusinessline.com/economy/india-likely-to-raise-concerns-on-us-steel-tariffs-in-trade-talks-this-week/article69645961.ece",
    "timestamp": "2025-06-01T14:50:32Z"
  },
  {
    "title": "Key climate target of airline decarbonisation ‘in peril’: IATA",
    "description": "The airline industry’s flagship goal of decarbonising by 2050 is now “in peril” due to climate-sceptic policies, including those of US President Donald Trump, the leading airline association IATA warned on Sunday. The emergence of leaders favouring fossil fue…",
    "link": "https://www.digitaljournal.com/world/key-climate-target-of-airline-decarbonisation-in-peril-iata/article",
    "timestamp": "2025-06-01T14:47:32Z"
  },
  {
    "title": "Suddenly Freed From Prison, Silk Road Founder Stunned by Advancements in World Since 2013",
    "description": "The 12 year campaign to free Ross Ulbricht — the criminal mastermind behind the Silk Road, a dark web mail-order-drug store — finally ended in January, when Donald Trump officially pardoned the bitcoin criminal. Now, Ulbricht is picking up where he left off, …",
    "link": "https://futurism.com/silk-road-ulbricht",
    "timestamp": "2025-06-01T14:45:38Z"
  },
  {
    "title": "Trump says he’s withdrawing the nomination of Musk associate Jared Isaacman to lead NASA",
    "description": "President Donald Trump announced late Saturday that he is withdrawing the nomination of tech billionaire Jared Isaacman, an associate of Trump adviser Elon Musk, to lead NASA, saying he reached the decision after a “thorough review” of Isaacman’s “prior assoc…",
    "link": "https://biztoc.com/x/67b2a1a957cb7df7",
    "timestamp": "2025-06-01T14:44:38Z"
  },
  {
    "title": "Elon Musk CBS Interview Gets Awkward as He Refuses Questions On Trump Policies",
    "description": "An Elon Musk interview on CBS got off to a rocky start Sunday when David Pogue asked the Tesla boss about various policies of President Donald Trump's.\nThe post Elon Musk CBS Interview Gets Awkward as He Refuses Questions On Trump Policies first appeared on M…",
    "link": "https://www.mediaite.com/media/news/elon-musk-cbs-interview-gets-awkward-as-he-refuses-questions-on-trump-policies/",
    "timestamp": "2025-06-01T14:40:10Z"
  },
  {
    "title": "Maureen Dowd: Musk wanted to ‘move fast and break things’ in Washington. The main thing he broke was his reputation",
    "description": "Trump was rewriting reality again on Friday as one of the most flamboyant, destructive bromances in US government history petered out",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/05/31/opinion/elon-musk-doge-trump.html",
    "timestamp": "2025-06-01T14:36:23Z"
  },
  {
    "title": "Everyone has their reasons",
    "description": "In the US, national security has been cited by proponents of protectionism for a wide variety of products, ranging from computer chips to automobiles to shipbuilding.  But when it comes to foreign countries, our protectionists often have a blind spot.  They c…",
    "link": "https://www.econlib.org/everyone-has-their-reasons-2/",
    "timestamp": "2025-06-01T14:35:07Z"
  },
  {
    "title": "Trump Shares Unhinged Conspiracy Theory That Biden Is a Robot Clone (Catherine Bouris/The Daily Beast)",
    "description": "Catherine Bouris / The Daily Beast:\nTrump Shares Unhinged Conspiracy Theory That Biden Is a Robot Clone  —  ROBO-POTUS  —  “There is no Joe Biden,” the post reads, claiming that the former president was actually murdered in 2020.  —  With one repost from Pres…",
    "link": "https://www.memeorandum.com/250601/p28",
    "timestamp": "2025-06-01T14:35:01Z"
  },
  {
    "title": "Trump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone",
    "description": "President Donald Trump shared a post by a user on Truth Social that falsely alleged Joe Biden was executed in 2020 replaced by a robot.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-conspiracy-biden-robot-clone-1235352122/",
    "timestamp": "2025-06-01T14:30:53Z"
  },
  {
    "title": "Tariff Havoc Is Forecasted To Create A Global Supply Chain Collapse",
    "description": "Everstream Analytics is forecasting a global supply chain collapse due to shortages of rare earth materials. Everstream has robust supply chain risk data.",
    "link": "https://www.forbes.com/sites/stevebanker/2025/06/01/tariff-havoc-is-forecasted-to-create-a-global-supply-chain-collapse/",
    "timestamp": "2025-06-01T14:30:50Z"
  },
  {
    "title": "US women’s-only spa barred from excluding transwomen with penises",
    "description": "Such an approach would violate Washington state’s anti-discrimination law, a court has ruled Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618450-us-women-only-spa/",
    "timestamp": "2025-06-01T14:30:02Z"
  },
  {
    "title": "‘Duck Dynasty: The Revival’ Will Bore You to Tears: TV Review",
    "description": "While driving around Louisiana, Willie Robertson has some thoughts to share about the role he plays in his family. “They were basically like chickens, and they need a, you know, a chicken leader,” he says, beginning to trail off. He seems to be boring himself…",
    "link": "https://variety.com/2025/tv/reviews/duck-dynasty-the-revival-robertsons-reboot-boring-1236408103/",
    "timestamp": "2025-06-01T14:30:00Z"
  },
  {
    "title": "Ukraine sets out demands ahead of Russia peace talks",
    "description": "Representatives from both countries are expected to meet in Istanbul on Monday for a second round of talks.",
    "link": "https://www.abc.net.au/news/2025-06-02/ukraine-sets-out-demands-ahead-of-russia-negotiations/105364044",
    "timestamp": "2025-06-01T14:28:14Z"
  },
  {
    "title": "WATCH -- 'Funny How That Works': Leftist Media Blasted for Coverage of Democrat Sen. Booker's 'Gesture' After Musk Was Accused of 'Nazi Salute'",
    "description": "The media appears not to be lambasting Sen. Cory Booker (D-NJ) over a one-handed gesture he gave during a speech in California on Saturday, after tech tycoon Elon Musk was accused of making a similar gesture in February, with many claiming it was a \"Nazi salu…",
    "link": "https://www.breitbart.com/politics/2025/06/01/watch-funny-how-that-works-leftist-media-blasted-for-coverage-of-democrat-sen-cory-bookers-gesture-after-elon-musk-was-accused-of-nazi-salute/",
    "timestamp": "2025-06-01T14:27:50Z"
  },
  {
    "title": "Russia and Ukraine step up the war on eve of peace talks",
    "description": "Amidst escalating conflict, Ukraine and Russia are set to engage in peace talks in Istanbul, following a major prisoner exchange. However, the lead-up to negotiations has been marked by intensified warfare, including drone battles, attacks on Russian territor…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-and-ukraine-step-up-the-war-on-eve-of-peace-talks/articleshow/121550956.cms",
    "timestamp": "2025-06-01T14:25:06Z"
  },
  {
    "title": "Trans athlete wins 2 girls events at California track and field finals",
    "description": "AB Hernandez competed under a new rule change that may be the first of its kind nationally by a high school sports governing body.",
    "link": "https://www.nbcnews.com/news/us-news/trans-athlete-wins-california-track-field-finals-rcna210205",
    "timestamp": "2025-06-01T14:23:27Z"
  },
  {
    "title": "Trump accelerates approval of uranium mine in Utah",
    "description": "In the southeastern Utah desert famous for red rock arches and canyon labyrinths, the long-dormant uranium mining industry is looking to revive under President Donald Trump.",
    "link": "https://biztoc.com/x/130838fd561efaa0",
    "timestamp": "2025-06-01T14:22:35Z"
  },
  {
    "title": "Trump Awards Musk Golden Key for DOGE Work",
    "description": "Elon Musk said he will continue to advise President Donald Trump even after stepping away from the Department of Government Efficiency effort he has spearheaded. The comments indicate that the chief executive officer of Tesla Inc. and SpaceX plans to remain i…",
    "link": "https://biztoc.com/x/25da2c3c220e10e7",
    "timestamp": "2025-06-01T14:22:24Z"
  },
  {
    "title": "Trump, Xi likely to speak soon, Treasury's Bessent says",
    "description": "WASHINGTON (Reuters) - U.S. Treasury Secretary Bessent said he believes President Donald Trump and Chinese President Xi Jinping will speak soon to address trade issues, including rare minerals. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/01/trump-xi-likely-to-speak-soon-treasury039s-bessent-says",
    "timestamp": "2025-06-01T14:17:00Z"
  },
  {
    "title": "How a Radical Ideology Infected the Supreme Court and Poisoned the Country",
    "description": "Originalism, a framework with roots in the segregationist past and funded by right-wing oligarchs, helped lead to Donald Trump’s unconstitutional regime",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-supreme-court-originalism-radical-ideology-1235351837/",
    "timestamp": "2025-06-01T14:14:55Z"
  },
  {
    "title": "Trump accelerates approval of uranium mine in Utah",
    "description": "In the southeastern Utah desert famous for red rock arches and canyon labyrinths, the long-dormant uranium mining industry is looking to revive under President Donald Trump.",
    "link": "https://www.pbs.org/newshour/politics/trump-accelerates-approval-of-uranium-mine-in-utah",
    "timestamp": "2025-06-01T14:13:19Z"
  }
]