[
  {
    "title": "David Tennant’s Donald Trump-Beetlejuice Joke Cut From BBC BAFTAs Broadcast",
    "description": "Some of David Tennant’s Donald Trump jokes during his BAFTAs monologue ended up on the BBC’s cutting room floor. Several of the host’s quips — one of which compared the U.S. president to Tim Burton’s Beetlejuice character — were cut from the BBC’s broadcast o…",
    "link": "https://variety.com/2025/film/awards/david-tennant-trump-beetlejuice-joke-cut-bbc-baftas-broadcast-1236310226/",
    "timestamp": "2025-02-16T20:27:38Z"
  },
  {
    "title": "FG urges US to ensure humane deportation of Nigerians",
    "description": "The Federal Government has called on the United States to ensure a humane deportation process for Nigerians, highlighting concerns over the emotional and financial impact on deportees and their families. The Minister of State for Foreign Affairs, Ambassador B…",
    "link": "https://punchng.com/fg-urges-us-to-ensure-humane-deportation-of-nigerians/",
    "timestamp": "2025-02-16T20:27:03Z"
  },
  {
    "title": "Russian Marines Flying Soviet Flags Paraded Right Into A Ukrainian Minefield In Kursk. Drones Finished Them Off.",
    "description": "Russian efforts to recapture Kursk Oblast are faltering.",
    "link": "https://www.forbes.com/sites/davidaxe/2025/02/16/russian-marines-flying-soviet-flags-paraded-right-into-a-ukrainian-minefield-in-kursk-drones-finished-them-off/",
    "timestamp": "2025-02-16T20:22:04Z"
  },
  {
    "title": "‘Took away my hope.’ Federal workers say Trump mass firings upended their lives - NewsBreak",
    "description": "Fired workers worried about making rent and paying student loans. Many talked about going into government work because they value public service.",
    "link": "https://www.newsbreak.com/share/3815393824167-took-away-my-hope-federal-workers-say-trump-mass-firings-upended-their-lives?s=a2&amp;share_destination_id=MTc1Mzg4MDAzLTE3Mzk3MzcyMTk4NTM%3D&amp;pd=0BruQlss&amp;hl=en_US&amp;send_time=1739737219&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.25.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v6%2Cns_foryou_blend_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_rank_exp_25q1-v3",
    "timestamp": "2025-02-16T20:20:50Z"
  },
  {
    "title": "How Trump’s 1-for-1 tariff plan threatens the global economy",
    "description": "The world economy was already grappling with a perplexing assortment of variables, from geopolitical conflicts and a slowdown in China to the evolving complexities of climate change. Then, President Donald Trump unleashed a plan to uproot decades of trade pol…",
    "link": "https://biztoc.com/x/23f771e94480748a",
    "timestamp": "2025-02-16T20:19:45Z"
  },
  {
    "title": "Trump Investigates U.S. Debt for Fraud, Suggests Treasury Payments 'Might Not Count'",
    "description": "President Donald Trump on Sunday said that his administration is investigating the U.S. national debt, suggesting that certain Treasury payments may be fraudulent and \"might not count.\" Speaking aboard Air Force One, Trump said his administration is reviewing…",
    "link": "https://biztoc.com/x/5eb93403e5d468cd",
    "timestamp": "2025-02-16T20:19:38Z"
  },
  {
    "title": "Europe Tries To Muscle Up As U.S. Plots Mediation To Help End Russia's War In Ukraine",
    "description": "European leaders took steps Sunday to answer assertive U.S. efforts to end Russia's war against Ukraine.",
    "link": "https://www.huffpost.com/entry/europe-munich-security-conference-russia-ukraine-war_n_67b244f9e4b0ad102039932f",
    "timestamp": "2025-02-16T20:19:04Z"
  },
  {
    "title": "Zoetis says its recieved conditional approval for the bird flu vaccine",
    "description": "The US Department of Agriculture last week issued a conditional license for an avian flu vaccine for use in chickens, as an outbreak of a newer variant ravages poultry flocks, contributing to the sky high price of eggs.",
    "link": "https://www.cnn.com/2025/02/16/health/bird-flu-vaccine-zoetis-avian/index.html",
    "timestamp": "2025-02-16T20:19:00Z"
  },
  {
    "title": "Trump attends the Daytona 500 and says the spirit of NASCAR will ‘fuel America’s Golden Age’",
    "description": "WEST PALM BEACH, Fla. — Donald Trump is attending Sunday’s Daytona 500, a race that he said is a unifying event with a spirit that will “fuel America’s Golden Age.”",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-attends-daytona-500-rcna192405",
    "timestamp": "2025-02-16T20:18:56Z"
  },
  {
    "title": "Trump's Ukraine envoy pulls no punches with Europe, says EU might not have place in Russia peace talks",
    "description": "U.S. Special Enjoy for Ukraine and Russia Keith Kellogg hinted that Europe might not have a seat at the table when peace negotiations between Ukraine and Russia begin.",
    "link": "https://www.foxnews.com/politics/trumps-ukraine-envoy-pulls-no-punches-europe-says-eu-might-not-have-place-russia-peace-talks",
    "timestamp": "2025-02-16T20:17:38Z"
  },
  {
    "title": "Trump administration wants SCOTUS to permit firing of whistleblower agency head",
    "description": "The Justice Department's filing asks the conservative-majority court to lift a judge's court order temporarily reinstating Hampton Dellinger as the leader of the Office of Special Counsel.",
    "link": "https://www.cbsnews.com/news/trump-administration-supreme-court-permit-firing-whistleblower-agency-head/",
    "timestamp": "2025-02-16T20:16:36Z"
  },
  {
    "title": "‘Flooded in [bleep]’: ‘Struggling’ James Carville stumped on how to oppose Trump",
    "description": "'It's really tangled now because no one knows where to land. It's all too incomprehensible'",
    "link": "https://www.wnd.com/2025/02/flooded-in-bleep-struggling-james-carville-stumped-on-how-to-oppose-trump/",
    "timestamp": "2025-02-16T20:15:26Z"
  },
  {
    "title": "Boycotting President Elon",
    "description": "Protests. have been gathering around Tesla dealerships: Protesters gathered outside Tesla dealerships across the US on Saturday in response to Elon Musk’s efforts to shred government spending under the president, Donald Trump. Groups of demonstrators up to 10…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/boycotting-president-elon",
    "timestamp": "2025-02-16T20:14:55Z"
  },
  {
    "title": "Julianne Moore slams Trump administration for banning her picture book",
    "description": "Julianne Moore takes aim at the Trump administration for banning her book about self-acceptance in schools run by the Department of Defense.",
    "link": "https://ew.com/julianne-moore-slams-trump-administration-for-banning-her-picture-book-11680768",
    "timestamp": "2025-02-16T20:13:44Z"
  },
  {
    "title": "President’s Day Weekend Firings At Government Agencies Within HHS",
    "description": "The Trump administration has begun purging thousands of employees at Department of Health and Human Service agencies, including the CDC, NIH, FDA and CMS.",
    "link": "https://www.forbes.com/sites/joshuacohen/2025/02/16/presidents-day-weekend-firings-at-government-agencies-within-hhs/",
    "timestamp": "2025-02-16T20:12:46Z"
  },
  {
    "title": "Trump Team Leaves European Alliance in Crisis; Macron Calls for Emergency Summit - The New York Times",
    "description": "Trump Team Leaves European Alliance in Crisis; Macron Calls for Emergency SummitThe New York Times As US recedes, NATO scrambles to find a new leaderPOLITICO Europe Donald Trump’s betrayal of Ukraine has emboldened Vladimir Putin and pulled the rug from under…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176275781",
    "timestamp": "2025-02-16T20:12:29Z"
  },
  {
    "title": "Your avocado toast with eggs may become a breakfast luxury rather than a tasty staple",
    "description": "With forces like tariffs and avian diseases at play, your avocado toast topped with eggs will likely become more expensive.",
    "link": "https://www.businessinsider.com/avocados-eggs-toast-expensive-tariffs-mexico-luxury-flu-2025-2",
    "timestamp": "2025-02-16T20:12:19Z"
  },
  {
    "title": "WATCH: Fans Cheer as Trump's 'Beast' Limo Leads Drivers Around the Track at Daytona 500",
    "description": "President Trump took a tour of the track in his famous \"Beast\" presidential limo leading the ceremonial pace lap to kick off the Daytona 500.\nThe post WATCH: Fans Cheer as Trump’s ‘Beast’ Limo Leads Drivers Around the Track at Daytona 500 appeared first on Br…",
    "link": "https://www.breitbart.com/sports/2025/02/16/watch-fans-cheer-as-trumps-beast-limo-leads-driverrs-around-track-daytona-500/",
    "timestamp": "2025-02-16T20:10:39Z"
  },
  {
    "title": "Trump administration wants the Supreme Court to permit the firing of whistleblower agency head",
    "description": "The Trump administration wants the Supreme Court to permit the firing of the head of the federal agency dedicated to protecting whistleblowers.",
    "link": "https://www.wxii12.com/article/trump-administration-wants-supreme-court-permit-firing-whistleblower-agency-head/63810665",
    "timestamp": "2025-02-16T20:09:03Z"
  },
  {
    "title": "Trump's Auto Tariffs, Tesla's Stock Plunge, Uber's Tesla Partnership, Musk's Dubai Loop And Starbase City",
    "description": "The week was a rollercoaster for the auto industry, with President Donald Trump hinting at potential tariffs on automobiles, and Tesla Inc. TSLA shares taking a hit. Meanwhile, Uber Technologies Inc. UBER CEO Dara Khosrowshahi expressed optimism for a partner…",
    "link": "https://biztoc.com/x/a3e49cfd5a339658",
    "timestamp": "2025-02-16T20:08:40Z"
  },
  {
    "title": "US Approves Texas Gulflink Deepwater Port for Exporting Crude Oil",
    "description": "The approval follows Trump’s Jan. 20 executive order aimed at removing regulatory barriers and utilizing America’s abundant energy resources.",
    "link": "https://www.theepochtimes.com/business/us-approves-texas-gulflink-deepwater-port-for-exporting-crude-oil-5811036",
    "timestamp": "2025-02-16T20:08:40Z"
  },
  {
    "title": "Trump Aide Lays Out 4 Key Tenets to Talks With Putin Over Ukraine",
    "description": "During a Sunday morning appearance on Fox News, President Donald Trump's national security adviser Mike Waltz laid out four key tenets to talks with President Vladimir Putin about ending the Russia-Ukraine war.\nNewsweek reached out to Ukraine's foreign affair…",
    "link": "https://biztoc.com/x/5d995075fa022bff",
    "timestamp": "2025-02-16T20:08:30Z"
  },
  {
    "title": "Ukraine not invited to US-Russia peace talks, source tells BBC",
    "description": "A Ukrainian government source told the BBC Kyiv would not be present at the proposed peace talks.",
    "link": "https://www.bbc.com/news/articles/cm292319gr2o",
    "timestamp": "2025-02-16T20:07:41Z"
  },
  {
    "title": "Dutton surges ahead in latest YouGov modelling",
    "description": "The federal election has been all but officially called, with the latest YouGov poll showing Peter Dutton 'most likely to be next prime minister'. \nThe post Dutton surges ahead in latest YouGov modelling appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/17/2025-federal-election-yougov-poll-peter-dutton-pm/",
    "timestamp": "2025-02-16T20:06:52Z"
  },
  {
    "title": "Trump Aide Lays Out 4 Key Tenets to Talks With Putin Over Ukraine",
    "description": "National security adviser Mike Waltz said a peace deal between Russia and Ukraine needs to be permanent, among other tenets.",
    "link": "https://www.newsweek.com/mike-waltz-donald-trump-vladimir-putin-talks-2031961",
    "timestamp": "2025-02-16T20:06:16Z"
  },
  {
    "title": "Trump administration wants the Supreme Court to permit the firing of whistleblower agency head",
    "description": "The Trump administration wants the Supreme Court to permit the firing of the head of the federal agency dedicated to protecting whistleblowers.",
    "link": "https://www.wcvb.com/article/trump-administration-wants-supreme-court-permit-firing-whistleblower-agency-head/63810665",
    "timestamp": "2025-02-16T20:05:44Z"
  },
  {
    "title": "Trump administration wants the Supreme Court to permit the firing of whistleblower agency head",
    "description": "The Trump administration wants the Supreme Court to permit the firing of the head of the federal agency dedicated to protecting whistleblowers.",
    "link": "https://www.wmur.com/article/trump-administration-wants-supreme-court-permit-firing-whistleblower-agency-head/63810665",
    "timestamp": "2025-02-16T20:04:38Z"
  },
  {
    "title": "At least 10 dead as severe rain, flooding and lows of -42C hit the US",
    "description": "At least 10 people, including a mother and seven-year-old child, have been killed amid harsh weather in the US.",
    "link": "https://news.sky.com/story/us-weather-nine-dead-as-severe-rain-flooding-and-lows-of-35c-hit-multiple-states-13311121",
    "timestamp": "2025-02-16T20:04:00Z"
  },
  {
    "title": "TrumpED 2025: School Choice Corporatization, Social Impact Finance, and the Dismantling of the Department of Education",
    "description": "In alignment with Project 2025, Trump pledges to eliminate the Dpt. of Ed and replace it with “school choice.” Rather than end federal control of education, Project 2025 education policy threatens to expand both government and corporate control of schooling i…",
    "link": "https://www.activistpost.com/project-2025-understanding-trumps-education-agenda/",
    "timestamp": "2025-02-16T20:01:00Z"
  },
  {
    "title": "Trump Investigates U.S. Debt for Fraud, Suggests Treasury Payments 'Might Not Count'",
    "description": "President Donald Trump on Sunday said that his administration is investigating the U.S. national debt, suggesting that certain Treasury payments may be...",
    "link": "https://finance.yahoo.com/news/trump-investigates-u-debt-fraud-200017541.html",
    "timestamp": "2025-02-16T20:00:17Z"
  },
  {
    "title": "Peter Strzok Wipes His X Account Clean as Kash Patel Awaits Confirmation as FBI Director",
    "description": "In a surprising move, former FBI agent Peter Strzok has erased his X account, raising questions about the implications for his ongoing narrative and the broader political landscape.\nThe post Peter Strzok Wipes His X Account Clean as Kash Patel Awaits Confirma…",
    "link": "https://www.thegatewaypundit.com/2025/02/peter-strzok-wipes-his-x-account-clean-as/",
    "timestamp": "2025-02-16T20:00:12Z"
  },
  {
    "title": "Here Are All The Major Lawsuits Against Trump And Musk: Trump Administration Asks Supreme Court To Let It Fire Ethics Official",
    "description": "Judges have blocked some of Trump and Musk's early moves—for now.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/16/here-are-all-the-major-lawsuits-against-trump-and-musk-trump-administration-asks-supreme-court-to-let-it-fire-ethics-official/",
    "timestamp": "2025-02-16T20:00:11Z"
  },
  {
    "title": "National security advisor says Putin, Zelenskyy agree 'only President Trump could get them to the table'",
    "description": "President Donald Trump's national security advisor Michael Waltz says Americans want \"payback\" of billions spent on Ukraine war ahead of US-Russia talks.",
    "link": "https://www.foxnews.com/politics/national-security-advisor-says-putin-zelenskyy-agree-only-president-trump-could-get-them-to-table",
    "timestamp": "2025-02-16T19:59:00Z"
  },
  {
    "title": "Fact-checking Trump and Musk’s claims that they are cutting government ‘fraud and abuse’",
    "description": "Elon Musk and President Donald Trump say they have uncovered massive \"fraud\" in the federal government. But the projects the White House points to are largely ones that the administration disagrees with ideologically, such as about diversity, equity and inclu…",
    "link": "https://biztoc.com/x/88985710441e6798",
    "timestamp": "2025-02-16T19:57:20Z"
  },
  {
    "title": "Netanyahu: Gazans should have an option to leave",
    "description": "Israeli Prime Minister Benjamin Netanyahu said Sunday that US President Donald Trump presented the only viable plan for resolving the Gaza issue. Speaking at a conference in Jerusalem, he said Israel ...",
    "link": "https://biztoc.com/x/b9a6f62beb8d4a66",
    "timestamp": "2025-02-16T19:57:15Z"
  },
  {
    "title": "Daytona 500 stopped by rain after just 11 laps",
    "description": "Rain has stopped the Daytona 500 on Sunday after 11 laps and an appearance by President Donald Trump, with defending champion William Byron leading the pack.",
    "link": "https://www.espn.com/racing/nascar/story/_/id/43876250/daytona-500-stopped-rain-11-laps-trump-appearance",
    "timestamp": "2025-02-16T19:56:03Z"
  },
  {
    "title": "43 million seconds without sunlight: Hostage families relate horrors of captivity from hospital",
    "description": "Troufanov’s girlfriend said that he told her Saturday night that during his captivity, he prayed she would not wait for him because he did not believe he would return alive.",
    "link": "https://www.jpost.com/israel-news/article-842409",
    "timestamp": "2025-02-16T19:52:54Z"
  },
  {
    "title": "US, Ukrainian officials head to Saudi Arabia as talks loom on ending Russia's war",
    "description": "Kyiv, Ukraine — A Ukrainian delegation has arrived in Saudi Arabia for meetings in preparation for a possible visit by President Volodymyr Zelenskyy, a Ukrainian minister said Sunday, at a time of intense speculation over planned U.S.-Russia talks in the king…",
    "link": "https://www.voanews.com/a/us-ukrainian-officials-head-to-saudi-arabia-as-talks-loom-on-ending-russia-s-war/7977072.html",
    "timestamp": "2025-02-16T19:50:07Z"
  },
  {
    "title": "Trump administration wants the Supreme Court to let the firing of whistleblower agency head proceed",
    "description": "The Trump administration wants the Supreme Court to permit the firing of the head of the federal agency dedicated to protecting whistleblowers, according to documents obtained Sunday that would mark the first appeal to the justices since President Donald Trum…",
    "link": "https://www.denverpost.com/2025/02/16/trump-administration-wants-the-supreme-court-to-let-the-firing-of-whistleblower-agency-head-proceed/",
    "timestamp": "2025-02-16T19:49:53Z"
  },
  {
    "title": "Trump attends Daytona 500, drives lap around track in motorcade while delivering message",
    "description": "President Donald Trump is continuing his tour around the sports world.",
    "link": "https://nypost.com/2025/02/16/sports/trump-attends-daytona-500-drives-lap-around-track-in-motorcade/",
    "timestamp": "2025-02-16T19:49:37Z"
  },
  {
    "title": "Trump vowed to champion US workers - the reality has been a relentless assault - NewsBreak",
    "description": "Trump vowed to champion US workers - the reality has been a relentless assault - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3815434227722-trump-vowed-to-champion-us-workers-the-reality-has-been-a-relentless-assault?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3Mzk3MzUyOTA5ODg%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1739735290&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v8",
    "timestamp": "2025-02-16T19:48:36Z"
  },
  {
    "title": "Fact-checking Trump and Musk’s claims that they are cutting government ‘fraud and abuse’",
    "description": "Elon Musk and President Donald Trump say they have uncovered massive \"fraud\" in the federal government. But the projects the White House points to are largely ones that the administration disagrees with ideologically, such as about diversity, equity and inclu…",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trump-and-musks-claims-that-they-are-cutting-government-fraud-and-abuse",
    "timestamp": "2025-02-16T19:46:13Z"
  },
  {
    "title": "Trump: Founding Fathers would oppose US immigration policies",
    "description": "United States President Donald Trump criticized the interpretation of the 14th Amendment in a Truth Social post, arguing that it was meant to grant citizenship to former slaves, not illegal immigrants...",
    "link": "https://biztoc.com/x/17faaa413bf14ee5",
    "timestamp": "2025-02-16T19:46:03Z"
  },
  {
    "title": "Utah governor signs bill banning teachers, firefighters and police from collective bargaining - NewsBreak",
    "description": "Utah Republican Governor Spencer Cox has signed a bill that bans teachers, firefighters, police officers and transit workers from collective bargaining for",
    "link": "https://www.newsbreak.com/share/3814907000463-utah-governor-signs-bill-banning-teachers-firefighters-and-police-from-collective-bargaining?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3Mzk3MzUxMjA5MjU%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1739735120&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_model_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v2",
    "timestamp": "2025-02-16T19:45:58Z"
  },
  {
    "title": "Trump’s aid freeze could cause millions more AIDS deaths – UN",
    "description": "President Donald Trump’s decision to suspend US overseas funding could result in millions more deaths from AIDS, the head of the UN’s programme for the illness warned Sunday. The United States is the world’s largest provider of official development assistance…",
    "link": "https://punchng.com/trumps-aid-freeze-could-cause-millions-more-aids-deaths-un/",
    "timestamp": "2025-02-16T19:44:29Z"
  },
  {
    "title": "Trump Returns to Daytona 500, Hails 'America's Golden Age'",
    "description": "President Trump attends 2025 Daytona 500, his second presidential appearance at NASCAR's premier race, arriving via Air Force One.",
    "link": "https://www.newsweek.com/donald-trump-daytona-500-nascar-american-spirit-2031977",
    "timestamp": "2025-02-16T19:44:22Z"
  },
  {
    "title": "Zelenskyy Declares Peace Deal Without Ukraine's Input Unacceptable",
    "description": "\"I will never accept any decisions between the United States and Russia about Ukraine, never,” he told NBC's \"Meet the Press.\"",
    "link": "https://www.huffpost.com/entry/zelenskyy-us-russia-only-peace-deal_n_67b20ef4e4b0d77e1ea4c052",
    "timestamp": "2025-02-16T19:40:35Z"
  },
  {
    "title": "Palisades Residents Fume as FEMA Refuses to Test Soil After Fire",
    "description": "Residents of the Pacific Palisades are increasingly concerned that the Federal Emergency Management Agency (FEMA) continues to refuse to test soil for contaminants after the removal of debris following the Palisades Fire.\nThe post Palisades Residents Fume as …",
    "link": "https://www.breitbart.com/politics/2025/02/16/palisades-residents-fume-as-fema-refuses-to-test-soil-after-fire/",
    "timestamp": "2025-02-16T19:38:02Z"
  },
  {
    "title": "BBC Cuts Some Donald Trump Jokes From David Tennant’s Opening BAFTA Remarks",
    "description": "The BBC cut some of David Tennant’s opening jokes about Donald Trump from its BAFTA coverage. The BBC show, which started two hours after the awards began at 7 p.m. GMT (11 a.m. PT) and is edited to a two-hour length, did not feature some of the material Tenn…",
    "link": "http://deadline.com/2025/02/bafta-film-awards-bbc-cuts-donald-trump-jokes-david-tennant-opening-speech-1236291973/",
    "timestamp": "2025-02-16T19:37:58Z"
  },
  {
    "title": "Trump Alludes That Laws Don’t Apply To Him If He “Saves” The Country",
    "description": "The president posted a concerning statement often attributed to a French emperor as US legal experts warn of an impending constitutional crisis.",
    "link": "https://www.vanityfair.com/news/story/trump-implies-above-the-law-to-save-the-country",
    "timestamp": "2025-02-16T19:37:31Z"
  },
  {
    "title": "Trump envoy confirms Saudi Arabia talks with Russia",
    "description": "The negotiations to end the Ukraine conflict will start in the coming days, according to Washington Post Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612822-russia-us-saudi-arabia/",
    "timestamp": "2025-02-16T19:36:16Z"
  },
  {
    "title": "BAFTA 2025: David Tennant Tackles The Proclaimers, Takes Dig at Trump",
    "description": "Some advice? Whoever makes the decision about who gets to host the BAFTA Film Awards, you might want to consider locking in David Tennant (Doctor Who, Broadchurch, Jessica Jones, Rivals) to a hosts-every-other-year deal (important to let others get a chance).…",
    "link": "https://bleedingcool.com/tv/bafta-2025-david-tennant-tackles-the-proclaimers-takes-dig-at-trump/",
    "timestamp": "2025-02-16T19:36:07Z"
  },
  {
    "title": "MAGA’s Favorite Canadian Politician Says Country Will ‘Seek Friends Elsewhere’ While Blasting Trump: ‘We Will Never Be The 51st State’",
    "description": "Pierre Poilievre, a far-right candidate to replace Justin Trudeau as Canada’s prime minister who is popular among American conservatives, blasted President Donald Trump on Saturday. Poilievre held a Flag Day rally in Ottawa where he addressed Trump’s tariffs …",
    "link": "https://www.mediaite.com/trump/magas-favorite-canadian-politician-says-country-will-seek-friends-elsewhere-while-blasting-trump-we-will-never-be-the-51st-state/",
    "timestamp": "2025-02-16T19:33:44Z"
  },
  {
    "title": "Bitcoin Price Outlook: Will BTC Rebound Or Drop To $76,000?",
    "description": "The price of Bitcoin (BTC) has shown only sideways movement in the last day resulting in a minor price loss of 0.37%. In the larger timeframe, BTC remains in a strong consolidation range between $95,000-$98,000, putting majority of traders on alert for an imm…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-outlook-will-btc-rebound-or-drop-to-76000/",
    "timestamp": "2025-02-16T19:30:39Z"
  },
  {
    "title": "'Conclave' leads the pack, 'Emilia Perez' faces test at Britain's BAFTA film awards",
    "description": "London — Stars including Cynthia Erivo, Hugh Grant, Ariana Grande, Lupita Nyong’o, Timothee Chalamet and Saoirse Ronan walked the red carpet at London’s Royal Festival Hall for the awards, known as BAFTAs.\n\n\nThe prizes are closely watched for clues about who …",
    "link": "https://www.voanews.com/a/conclave-leads-the-pack-emilia-perez-faces-test-at-britain-s-bafta-film-awards/7977060.html",
    "timestamp": "2025-02-16T19:30:01Z"
  },
  {
    "title": "Ashley St. Clair Welcomes Elon Musk’s 13th Child, Says Billionaire is a Deadbeat Dad",
    "description": "Reading Time: 3 minutesAshley St. Clair made news on a couple of personal fronts this past week. First, the author revealed to the …\nAshley St. Clair Welcomes Elon Musk’s 13th Child, Says Billionaire is a Deadbeat Dad was originally published on The Hollywood…",
    "link": "http://www.thehollywoodgossip.com/2025/02/ashley-st-clair-welcomes-elon-musks-13th-child-says-billionaire-is-a-deadbeat-dad/",
    "timestamp": "2025-02-16T19:28:23Z"
  },
  {
    "title": "Associated Press Refuses to Use 'Gulf of America' Despite Updating Other Geographical, Ethnic Terms",
    "description": "The Associated Press is still refusing to refer to the Gulf of America by its new official name, despite the publication having previously changed its style guide to conform to the renaming of other geographical locations and ethnicities around the world.\nThe…",
    "link": "https://www.breitbart.com/the-media/2025/02/16/associated-press-refuses-to-use-gulf-of-america-despite-updating-other-geographical-ethnic-terms/",
    "timestamp": "2025-02-16T19:27:25Z"
  },
  {
    "title": "How Elon Musk's Daughter Vivian Learned Of His 13th Child",
    "description": "On February 14, influencer Ashley St. Clair claimed she and Elon Musk share a 5-month-old child.",
    "link": "https://littlethings.com/entertainment/elon-musk-daughter-vivian-learned-13th-child-social-media-reddit",
    "timestamp": "2025-02-16T19:25:54Z"
  },
  {
    "title": "‘I’m a Really Big Fan of You People’: Trump Revels as His Limo Takes Laps Around Track Before Daytona 500",
    "description": "President Donald Trump returned to the Daytona 500 Sunday to address the drivers — as his limo took laps around the track.\nThe post ‘I’m a Really Big Fan of You People’: Trump Revels as His Limo Takes Laps Around Track Before Daytona 500 first appeared on Med…",
    "link": "https://www.mediaite.com/sports/im-a-really-big-fan-of-you-people-trump-revels-as-his-limo-takes-laps-around-track-before-daytona-500/",
    "timestamp": "2025-02-16T19:24:30Z"
  },
  {
    "title": "Company says it received conditional approval for bird flu vaccine from US Department of Agriculture",
    "description": "(CNN) — The US Department of Agriculture last week issued a conditional license for an avian flu vaccine for use in chickens, amid an outbreak ravaging poultry flocks, contributing to",
    "link": "https://www.wsiltv.com/news/health/company-says-it-received-conditional-approval-for-bird-flu-vaccine-from-us-department-of-agriculture/article_bbb27d39-bd94-51ee-ab35-aee750a07609.html",
    "timestamp": "2025-02-16T19:21:00Z"
  },
  {
    "title": "Trump applauds 'guts' of NASCAR drivers ahead of Daytona 500, sends them special message",
    "description": "President Donald Trump applauded NASCAR drivers for giving it a go and competing at the Daytona 500 in an interview ahead of the \"Great American Race.\"",
    "link": "https://www.foxnews.com/sports/trump-applauds-guts-nascar-drivers-ahead-daytona-500-sends-them-special-message",
    "timestamp": "2025-02-16T19:20:35Z"
  },
  {
    "title": "TKer: All else is never equal when it comes to markets",
    "description": "History has taught us it’s possible for the economy to flourish and the stock market to rise despite emerging headwinds.",
    "link": "https://finance.yahoo.com/news/tker-all-else-is-never-equal-when-it-comes-to-markets-192007395.html",
    "timestamp": "2025-02-16T19:20:07Z"
  },
  {
    "title": "Trump’s aid freeze could cause millions more AIDS deaths: UN agency",
    "description": "President Donald Trump’s decision to suspend US overseas funding could result in millions more deaths from AIDS, the head of the UN’s programme for the illness warned Sunday. The United States is the world’s largest provider of official development assistance…",
    "link": "https://www.digitaljournal.com/world/trumps-aid-freeze-could-cause-millions-more-aids-deaths-un-agency/article",
    "timestamp": "2025-02-16T19:18:18Z"
  },
  {
    "title": "Federal workers with 'exceptional' reviews fired for 'performance' issues",
    "description": "Dozens of probationary employees at one agency were told one of the reasons they were being fired was for poor performance — even though they had \"exceptional\" reviews.",
    "link": "https://www.nbcnews.com/politics/doge/federal-workers-exceptional-reviews-fired-performance-issues-rcna192347",
    "timestamp": "2025-02-16T19:17:18Z"
  },
  {
    "title": "Kaine: Confused GOP Lawmakers Having 'Hard Time' Agreeing on Budget",
    "description": "Senator Tim Kaine (D-VA) said on this week's broadcast of \"Fox News Sunday\" that House and Senate Republicans were having a \"hard time\" facing \"a lot of confusion\" during the negotiations on the federal budget.\nThe post Kaine: Confused GOP Lawmakers Having ‘H…",
    "link": "https://www.breitbart.com/clips/2025/02/16/kaine-confused-gop-lawmakers-having-hard-time-agreeing-on-budget/",
    "timestamp": "2025-02-16T19:16:41Z"
  },
  {
    "title": "Unemployment spikes in Washington, D.C., as Trump and Musk begin efforts to shrink the government",
    "description": "President Donald Trump’s moves to fire thousands of federal government workers have coincided with a surge in jobless claims in Washington, D.C., that could get worse as the efforts intensify.",
    "link": "https://www.nbcnews.com/news/us-news/unemployment-spikes-washington-dc-trump-musk-rcna192398",
    "timestamp": "2025-02-16T19:15:23Z"
  },
  {
    "title": "MLK Family Reportedly Fears Revival of FBI 'Smears' From Upcoming Report Release: 'Under the Guise of Transparency'",
    "description": "The family of Martin Luther King Jr. fears that newly released government documents will be used to tarnish his legacy \"under the guise of transparency\" on the heels of President Donald Trump canceling MLK Day.",
    "link": "https://www.ibtimes.com/mlk-family-fears-revival-fbi-smears-upcoming-report-release-guise-transparency-3763955",
    "timestamp": "2025-02-16T19:14:41Z"
  },
  {
    "title": "Trump May Meet Putin In February In Stunning Setback For Ukraine, Europe",
    "description": "President Donald Trump last week indicated that discussions had started around a summit to address how to end the Ukraine war.",
    "link": "https://biztoc.com/x/fa94944ba4d71635",
    "timestamp": "2025-02-16T19:12:42Z"
  },
  {
    "title": "Raskin: Trump's 'Attack' on the Department of Justice 'Could Be Impeachable'",
    "description": "Representative Jamie Raskin (D-MD) claimed Sunday on CBS's \"Face the Nation\" that the Trump administration's \"attack on the Department of Justice\" could be \"impeachable.\"\nThe post Raskin: Trump’s ‘Attack’ on the Department of Justice ‘Could Be Impeachable’ ap…",
    "link": "https://www.breitbart.com/clips/2025/02/16/raskin-trumps-attack-on-the-department-of-justice-could-be-impeachable/",
    "timestamp": "2025-02-16T19:12:16Z"
  },
  {
    "title": "Julianne Moore in ‘Great Shock’ After Donald Trump Bans Her Children’s Book ‘Freckleface Strawberry’ From Schools: ‘I Can’t Help But Wonder What Is So Controversial’",
    "description": "The Trump Administration has banned Julianne Moore’s 2007 children’s book “Freckleface Strawberry” from schools operated by the Department of Defense, the “Far from Heaven” star shared on Instagram Sunday morning. “It is a great shock for me to learn that my …",
    "link": "https://variety.com/2025/film/news/julianne-moore-donald-trump-bans-book-freckleface-strawberry-1236310153/",
    "timestamp": "2025-02-16T19:11:43Z"
  },
  {
    "title": "Musk and Trump on the nose in Australia and politicians wise to steer clear of them",
    "description": "New data shows Australians are making it clear they want answers to their economic malaise and that the obsessions of super-rich Americans are not the same as theirs.",
    "link": "https://www.abc.net.au/news/2025-02-17/trump-and-musk-unpopular-in-australia/104942844",
    "timestamp": "2025-02-16T19:11:31Z"
  },
  {
    "title": "Missouri Attorney General Sues Starbucks for DEI Policy, Claims It Raises Prices and Slows Service",
    "description": "The state of Missouri has sued Starbucks due to allegations that the coffeehouse chain's anti-discrimination policies and other policies relating to diversity, equity and inclusion (DEI) have negatively impacted service and slowed down coffee orders",
    "link": "https://www.ibtimes.com/missouri-attorney-general-sues-starbucks-dei-policy-claims-slows-service-raises-prices-3763953",
    "timestamp": "2025-02-16T19:11:28Z"
  },
  {
    "title": "Democratic Senator: 'The Democrats' Brand Is Really Bad'",
    "description": "Virginia Senator Mark Warner harshly criticized his party while speaking at a conference, reflecting on the losses faced by the Democratic Party in the 2024 election cycle.",
    "link": "https://www.ibtimes.com/democratic-senator-democrat-brand-really-bad-3763951",
    "timestamp": "2025-02-16T19:10:06Z"
  },
  {
    "title": "David Tennant duets with Colman Domingo and calls Trump a ‘villain’ in BAFTAs opening speech",
    "description": "Doctor Who legend and this year’s BAFTAs host David Tennant opened the ceremony of the biggest night in British film with a star-studded sing-a-long and gag about “villain” Donald Trump. Tennant began his opening monologue with pre-recorded footage of him rec…",
    "link": "https://www.thepinknews.com/2025/02/16/david-tennant-donald-trump-villain-baftas/",
    "timestamp": "2025-02-16T19:08:51Z"
  },
  {
    "title": "Trump Proves He’s The Greatest President Of All Time With Outright Glorious Move At Daytona 500",
    "description": "For the second time as President of the United States, Donald Trump showed up Sunday to the Daytona 500. And boy oh boy, was it glorious.",
    "link": "https://dailycaller.com/2025/02/16/donald-trump-daytona-500-the-beast-hot-laps/",
    "timestamp": "2025-02-16T19:08:29Z"
  },
  {
    "title": "Zelenskiy says Ukraine has 'low chance' of survival without US backing",
    "description": "WASHINGTON (Reuters) -Ukraine has little chance of surviving Russia's assault without U.S. support, President Volodymyr Zelenskiy said on Friday after phone calls this week by U.S. President Donald Trump with Zelenskiy and Russian President Vladimir Putin.\"Pr…",
    "link": "https://freerepublic.com/focus/f-news/4298058/posts",
    "timestamp": "2025-02-16T19:07:15Z"
  },
  {
    "title": "In Afghanistan, families are forced to sell children to survive. Trump’s USAID cuts will be devastating",
    "description": "The US has donated nearly US$4 billion to Afghanistan since the Taliban came into power. Gutting USAID will have enormous consequences for women and children.",
    "link": "https://theconversation.com/in-afghanistan-families-are-forced-to-sell-children-to-survive-trumps-usaid-cuts-will-be-devastating-249713",
    "timestamp": "2025-02-16T19:06:28Z"
  },
  {
    "title": "The New Cold War race for digital currencies could redefine global power. Should Australia be in it?",
    "description": "What are central bank digital currencies (CBDCs), and why are they crucial to the future of global power? A new book explains – and warns the West needs to act now.",
    "link": "https://theconversation.com/the-new-cold-war-race-for-digital-currencies-could-redefine-global-power-should-australia-be-in-it-247137",
    "timestamp": "2025-02-16T19:06:18Z"
  },
  {
    "title": "2025 Daytona 500: Watch as U.S. President Donald Trump leads field in 'The Beast' during pace laps",
    "description": "Trump took a few ceremonial laps before the start of the Daytona 500 for the second time as president",
    "link": "https://www.cbssports.com/nascar/news/2025-daytona-500-watch-as-u-s-president-donald-trump-leads-field-in-the-beast-during-pace-laps/",
    "timestamp": "2025-02-16T19:05:50Z"
  },
  {
    "title": "'You Think That's Winning?' CBS Host Rips Trump For 'Flattering Brutal Dictator' Putin",
    "description": "CBS host Margaret Brennan grilled Rep. Dan Crenshaw (R-TX) about whether he thought President Donald Trump was \"winning\" when he flattered Russian President Vladimir Putin, who she described as a \"brutal dictator.\"\n\n\n\"Vladimir Putin, it sounds like you would …",
    "link": "https://crooksandliars.com/2025/02/you-think-thats-winning-cbs-host-rips",
    "timestamp": "2025-02-16T19:05:28Z"
  },
  {
    "title": "BAFTAs 2025 Winners: Live Updates",
    "description": "The winners of the night included “Emilia Pérez,” Wicked” and “The Substance.”",
    "link": "http://wwd.com/pop-culture/culture-news/bafta-awards-2025-winners-1236934048/",
    "timestamp": "2025-02-16T19:05:00Z"
  },
  {
    "title": "Trump May Meet Putin In February In Stunning Setback For Ukraine, Europe",
    "description": "President Donald Trump last week indicated that discussions had started around a summit to address how to end the Ukraine war.",
    "link": "https://www.newsweek.com/trump-meet-putin-february-setback-ukraine-europe-2031967",
    "timestamp": "2025-02-16T19:05:00Z"
  },
  {
    "title": "Trump says 14th Amendment is for former slaves, not migrants",
    "description": "On Thursday, a fourth federal judge blocked the executive order issued by the president on his first day in the Oval Office.",
    "link": "https://www.newsnationnow.com/politics/trump-14th-amendment-slaves-not-migrants/",
    "timestamp": "2025-02-16T19:04:08Z"
  },
  {
    "title": "Trump says 14th Amendment is for former slaves, not migrants - NewsBreak",
    "description": "On Thursday, a fourth federal judge blocked the executive order issued by the president on his first day in the Oval Office.",
    "link": "https://www.newsbreak.com/share/3815810679973-trump-says-14th-amendment-is-for-former-slaves-not-migrants?s=a2&share_destination_id=MjA3OTQ4Mzk1LTE3Mzk3NDE5Mjk0NzM%3D&pd=0E4WsNAN&hl=en_US&send_time=1739741929&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v3",
    "timestamp": "2025-02-16T19:04:08Z"
  },
  {
    "title": "Rubio Meets Netanyahu, Says “Hostages Need to Come Home” and Hamas “Must be Eliminated”",
    "description": "Netanyahu: With Trump's backing, Israel \"can finish the job\" against Iran.\nThe post Rubio Meets Netanyahu, Says “Hostages Need to Come Home” and Hamas “Must be Eliminated” first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/rubio-meets-netanyahu-says-hostages-need-to-come-home-and-hamas-must-be-eliminated/",
    "timestamp": "2025-02-16T19:00:57Z"
  },
  {
    "title": "Phase two of Gaza ceasefire looms as Israeli PM vows 'hell' if truce ends",
    "description": "Benjamin Netanyahu made the comments alongside US Secretary of State Marco Rubio, a day after his country received a shipment of American made heavy bombs.",
    "link": "https://www.abc.net.au/news/2025-02-17/rubio-netanyahu-meeting-ceasefire-gaza-phase-two/104943714",
    "timestamp": "2025-02-16T19:00:52Z"
  },
  {
    "title": "Rubio pushes for next stage of Gaza ceasefire and says Hamas must be eliminated",
    "description": "Netanyahu again describes US president as the greatest friend Israel has had in the White House",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/16/rubio-pushes-for-next-stage-of-gaza-ceasefire-and-says-hamas-must-be-eliminated/",
    "timestamp": "2025-02-16T19:00:19Z"
  },
  {
    "title": "‘We will not accept any agreement that is adopted without us’: Ukraine resolute as US and Russia seek to end war without its say",
    "description": "European leaders to hold an emergency summit on Ukraine on Monday in Paris",
    "link": "https://www.irishtimes.com/world/europe/2025/02/16/we-will-not-accept-any-agreement-that-is-adopted-without-us-ukraine-resolute-as-us-and-russia-seek-to-end-war-without-its-say/",
    "timestamp": "2025-02-16T19:00:13Z"
  },
  {
    "title": "Sheryl Crow sells her Tesla to protest Elon Musk, donates the money to NPR",
    "description": "Sheryl Crow announced on Instagram that she had gotten rid of her Tesla over Elon Musk's involvement in President Donald Trump's administration, and that she donated money to NPR.",
    "link": "https://www.foxnews.com/media/sheryl-crow-sells-her-tesla-protest-elon-musk-donates-money-npr",
    "timestamp": "2025-02-16T19:00:08Z"
  },
  {
    "title": "Trump Administration Removes over 400 DHS Employees in Workforce Purge, Half of Those from FEMA",
    "description": "President Donald Trump's administration has reportedly terminated more than 400 U.S. Department of Homeland Security (DHS) employees in an ongoing purge.\nThe post Trump Administration Removes over 400 DHS Employees in Workforce Purge, Half of Those from FEMA …",
    "link": "https://www.breitbart.com/politics/2025/02/16/trump-administration-removes-over-400-dhs-employees-workforce-purge/",
    "timestamp": "2025-02-16T18:57:33Z"
  },
  {
    "title": "Claudia Tenney Introduces Bill To Make Trump's Birthday A National Holiday",
    "description": "One would think these Republican Trump asskissers would eventually pay some sort of political price for this sort of foolishness, but none of them ever seem to, which is why they keep doing it I suppose. In Claudia Tenney's case, she represented NY-22 in 2020…",
    "link": "https://crooksandliars.com/2025/02/claudia-tenney-introduces-bill-make-trumps",
    "timestamp": "2025-02-16T18:56:39Z"
  }
]