[
  {
    "title": "Life is improving for Lakers' LeBron James, Warriors' Stephen Curry; might MLB reinstate Pete Rose?",
    "description": "The Lakers and Warriors have been climbing the ladder since the NBA trade deadline",
    "link": "https://www.cbssports.com/nba/news/life-is-improving-for-lakers-lebron-james-warriors-stephen-curry-might-mlb-reinstate-pete-rose/",
    "timestamp": "2025-03-03T14:09:13Z"
  },
  {
    "title": "This industrial chemical is being added to U.S. fentanyl, not Canadian",
    "description": "The toxic chemical, found when testing fentanyl in Phoenix last June, is now \"very widespread. We&#39ve seized it all over the country.\"",
    "link": "https://vancouversun.com/news/this-powerful-industrial-chemical-is-being-added-to-fentanyl-in-the-u-s-but-not-in-canada",
    "timestamp": "2025-03-03T14:08:56Z"
  },
  {
    "title": "Donald Trump's Approval Rating Soars With Gen Z",
    "description": "A recent survey shows the president recording a double-digit improvement with voters aged 18-29 since returning to office .",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-genz-poll-atlas-2038648",
    "timestamp": "2025-03-03T14:08:16Z"
  },
  {
    "title": "How to watch the first joint address to Congress of Trump’s second term",
    "description": "President Donald Trump will deliver the first joint congressional address of his second term on Tuesday at 9 p.m. Eastern.",
    "link": "https://www.bostonherald.com/2025/03/03/how-to-watch-the-first-joint-address-to-congress-of-trumps-second-term/",
    "timestamp": "2025-03-03T14:08:02Z"
  },
  {
    "title": "Senate will vote on confirming Linda McMahon to lead an education agency Trump has vowed to close",
    "description": "The Senate is voting on whether to confirm former wrestling executive Linda McMahon as the nation’s education chief, a role that would place her atop a department President Donald Trump has vowed to dismantle",
    "link": "https://abcnews.go.com/US/wireStory/senate-vote-confirming-linda-mcmahon-lead-education-agency-119383251",
    "timestamp": "2025-03-03T14:06:48Z"
  },
  {
    "title": "Trudeau stands by Zelenskyy as London summit on European security ends",
    "description": "Prime Minister Justin Trudeau says Moscow can't be trusted in any agreement to end its invasion of Ukraine, as European leaders craft plans to rely less on Washington and protect the continent from more incursions by Russian President Vladimir Putin.",
    "link": "https://www.nationalobserver.com/2025/03/02/news/trudeau-zelenskyy-london-summit-european-security",
    "timestamp": "2025-03-03T14:06:38Z"
  },
  {
    "title": "Ukraine's Zelenskyy says end of war with Russia is 'very, very far away'",
    "description": "Ukrainian President Volodymyr Zelenskyy says a deal to end the war between Ukraine and Russia “is still very, very far away.\"",
    "link": "https://abcnews.go.com/Business/wireStory/ukraines-zelenskyy-end-war-russia-119382845",
    "timestamp": "2025-03-03T14:06:29Z"
  },
  {
    "title": "Treasury ends enforcement of business ownership database meant to stop shell company formation",
    "description": "The U.S. Treasury Department says it will not enforce a Biden-era small business rule intended to curb money laundering and shell company formation",
    "link": "https://abcnews.go.com/US/wireStory/treasury-ends-enforcement-business-ownership-database-meant-stop-119382849",
    "timestamp": "2025-03-03T14:06:29Z"
  },
  {
    "title": "Trump Says Zelenskiy Wants to Fight",
    "description": "The US and Ukraine failed to sign a critical minerals agreement after a Friday meeting between Donald Trump and Volodymyr Zelenskiy devolved into a fiery exchange, fracturing relations between the two countries.\nTrump took umbrage with Zelenskiy’s doubts that…",
    "link": "https://biztoc.com/x/1468e9f512d43910",
    "timestamp": "2025-03-03T14:05:56Z"
  },
  {
    "title": "Subtle strength: How to deal with a bully at work",
    "description": "There’s a lot of complexity in our world, much of which is happening on the political front right now. As I read the news the word ‘bully’ keeps surfacing. As we all try to make sense of what seems nonsensical behaviour from U.S. President Donald Trump, the d…",
    "link": "https://biztoc.com/x/f7c714c0c3f50fee",
    "timestamp": "2025-03-03T14:05:52Z"
  },
  {
    "title": "10 things to watch in the stock market Monday including bitcoin and Tesla",
    "description": "Wall Street is set for a higher open Monday, building off Friday's rally.",
    "link": "https://www.cnbc.com/2025/03/03/10-things-to-watch-in-the-stock-market-monday-including-bitcoin-and-tesla-.html",
    "timestamp": "2025-03-03T14:04:32Z"
  },
  {
    "title": "Apple's $500 billion promise: Been there, done that",
    "description": "A version of this article originally appeared in Quartz’s members-only Weekend Brief newsletter. Quartz members get access to exclusive newsletters and more....",
    "link": "https://finance.yahoo.com/news/truth-apples-500-billion-promise-100000604.html",
    "timestamp": "2025-03-03T14:04:22Z"
  },
  {
    "title": "US suspends cyber operations against Russia – media",
    "description": "The order was reportedly given before last week’s Trump-Zelensky disastrous meeting at the White House Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613611-pentagon-cyber-operations-russia/",
    "timestamp": "2025-03-03T14:03:32Z"
  },
  {
    "title": "Trump tariffs: Can the US be punished for breaking trade laws?",
    "description": "Since Donald Trump took office, he's threatened or imposed higher import duties on trade partners. Experts say the US president is violating existing trade agreements. How is he able to get away with it?",
    "link": "https://www.dw.com/en/trump-tariffs-can-the-us-be-punished-for-breaking-trade-laws/a-71788197",
    "timestamp": "2025-03-03T14:03:00Z"
  },
  {
    "title": "Trump tariffs: Can US be punished for breaking trade laws?",
    "description": "Since Donald Trump took office, he's threatened or imposed higher import duties on trade partners. Experts say the US president violates existing trade agreements. But how can he get away with that? New York University's so-called Litigation Tracker website, …",
    "link": "https://www.dw.com/en/trump-tariffs-can-us-be-punished-for-breaking-trade-laws/a-71788197",
    "timestamp": "2025-03-03T14:03:00Z"
  },
  {
    "title": "How Trump's tariff earthquake could influence the B.C. budget",
    "description": "While the exact magnitude remains uncertain, experts and economists say the impact of U.S. President Donald Trump's threatened tariffs will have Bailey handing down one of the most consequential budgets for the province in recent memory on Tuesday.",
    "link": "https://www.nationalobserver.com/2025/03/03/news/trump-tariff-influence-bc-budget",
    "timestamp": "2025-03-03T14:02:17Z"
  },
  {
    "title": "Musk's embrace of right-wing politics risks turning off car buyers and sinking Tesla's stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world, analysts say, and the hit couldn't come at a worse time.",
    "link": "https://www.clickondetroit.com/news/politics/2025/03/03/musks-embrace-of-right-wing-politics-risks-turning-off-car-buyers-and-sinking-teslas-stock/",
    "timestamp": "2025-03-03T14:00:48Z"
  },
  {
    "title": "XRP skyrockets after Trump’s Crypto Reserve announcement: More rally ahead?",
    "description": "XRP soared past $2.90 after Trump's executive order confirmed its inclusion in a U.S. crypto reserve.",
    "link": "https://ambcrypto.com/xrp-skyrockets-after-trumps-crypto-reserve-announcement-more-rally-ahead/",
    "timestamp": "2025-03-03T14:00:34Z"
  },
  {
    "title": "In Pointed Contrast to Zelensky, Netanyahu Thanks Trump Profusely",
    "description": "Israeli Prime Minister Benjamin Netanyahu released a video Sunday thanking President Donald Trump profusely for his help in what seemed a pointed and deliberate contrast to Ukrainian President Volodymyr Zelensky’s behavior. There were other reasons for the ad…",
    "link": "https://freerepublic.com/focus/f-news/4301706/posts",
    "timestamp": "2025-03-03T14:00:14Z"
  },
  {
    "title": "Tariff chaos threatens economy already flashing lights...",
    "description": "The health of the US economy is looking less and less stable by the day.",
    "link": "https://www.cnn.com/2025/03/03/economy/tariff-choas-threatens-risky-economy/index.html",
    "timestamp": "2025-03-03T14:00:03Z"
  },
  {
    "title": "Walesa blasts Trump over communist-style actions...",
    "description": "WARSAW: Poland’s freedom icon Lech Walesa and dozens of other communist-era dissidents on Monday slammed Donald Trump over his clash with Volodymyr Zelenskyy, comparing the US president’s actions to “communist courtrooms.”",
    "link": "https://www.nst.com.my/world/world/2025/03/1183202/polands-walesa-blasts-trump-over-communist-style-zelenskyy-grilling",
    "timestamp": "2025-03-03T14:00:03Z"
  },
  {
    "title": "Breaking down list alleging companies like McDonald's and Walmart donated to Trump",
    "description": "While FEC records confirm some companies on the list donated to Trump, the list itself isn't trustworthy.",
    "link": "https://www.snopes.com//news/2025/03/03/trump-project-2025-companies/",
    "timestamp": "2025-03-03T14:00:00Z"
  },
  {
    "title": "Federal cuts to Social Security could include North County office",
    "description": "The Social Security administration said it’s going to cut 7,000 jobs to comply with the Trump administration’s orders. Those cuts could include a non-public facing Social Security office in Carlsbad. Plus, San Diego Assemblymember Chris Ward introduced a bill…",
    "link": "https://www.kpbs.org/podcasts/san-diego-news-now/federal-cuts-to-social-security-could-include-north-county-office",
    "timestamp": "2025-03-03T14:00:00Z"
  },
  {
    "title": "Venezuelan Navy Approaches Exxon Mobil Vessel Off Guyana Coast",
    "description": "The U.S. State Department called the threat by Venezuela unacceptable.",
    "link": "https://www.rigzone.com/news/wire/venezuelan_navy_approaches_exxon_mobil_vessel_off_guyana_coast-03-mar-2025-179801-article/",
    "timestamp": "2025-03-03T14:00:00Z"
  },
  {
    "title": "B.C. NDP's election promises face test as party readies to present new budget at legislature",
    "description": "As tariff threat looms, David Eby's NDP faces pressure to deliver on election promises and to dig the province out of $9 billion of debt.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/ndp-election-promises-test-budget-1.7470947",
    "timestamp": "2025-03-03T14:00:00Z"
  },
  {
    "title": "King Charles met with President Zelenskyy at Sandringham over the weekend",
    "description": "Last Friday, Ukraine’s President Zelenskyy sat in the Oval Office with Donald Trump, JD Vance and Marco Rubio. Zelenskyy, who has survived multiple assassination attempts and has kept his country together through three years of Russia’s deadly invasion and wa…",
    "link": "https://www.celebitchy.com/911710/king_charles_met_with_president_zelenskyy_at_sandringham_over_the_weekend/",
    "timestamp": "2025-03-03T13:59:43Z"
  },
  {
    "title": "Greenland’s Future Must Be Decided by Greenland’s People",
    "description": "Support for independence is growing among Greenlanders and will be a key issue in the island’s upcoming election. The next government will most likely seek larger fiscal transfers from Denmark, but it will also have to make the case against joining the United…",
    "link": "https://www.project-syndicate.org/commentary/resistance-to-trump-effort-for-us-control-of-greenland-by-simon-johnson-2025-03",
    "timestamp": "2025-03-03T13:58:30Z"
  },
  {
    "title": "Scotland Should Stay Out of the British Proxy War in Ukraine",
    "description": "Scottish Greens call “Trump not welcome in Scotland”. Well, if so, Zelensky shouldn’t be either. It’s not the Scottish war (neither the Polish one). We also need to see that historically Ukraine’s attitude towards Donbas and Russian-speaking people of Novoros…",
    "link": "https://www.globalresearch.ca/scotland-stay-out-british-proxy-war-ukraine/5881287",
    "timestamp": "2025-03-03T13:57:26Z"
  },
  {
    "title": "Zelensky: Victim of Colosseum Politics",
    "description": "There was a revolting tabloid quality to the Oval Office reception given to Ukrainian President Volodymyr Zelensky on February 28, but then again, President Donald Trump is a tabloid brute, a man incarnated from the nastiest, shallowest precepts of yellow …\nT…",
    "link": "https://www.globalresearch.ca/zelensky-victim-colosseum-politics/5881290",
    "timestamp": "2025-03-03T13:56:38Z"
  },
  {
    "title": "South African Police Open 'Treason' Investigation into Critics of Government",
    "description": "South African police confirmed Monday that they have opened a \"treason\" investigation into four individuals who are believed to be associated with Afriforum, a group that advocates for the rights and interests of Afrikaner farmers.\nThe post South African Poli…",
    "link": "https://www.breitbart.com/politics/2025/03/03/south-african-police-open-treason-investigation-into-critics-of-government/",
    "timestamp": "2025-03-03T13:56:30Z"
  },
  {
    "title": "As US’ crypto push sets global precedent, Indian industry wants similar ‘progressive policies’",
    "description": "US President Trump announces creation of Strategic Crypto Reserve, sparking market rally and global policy discussions.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/as-us-crypto-push-sets-global-precedent-indian-industry-wants-similar-progressive-policies/article69285663.ece",
    "timestamp": "2025-03-03T13:56:14Z"
  },
  {
    "title": "As US’ crypto push sets global precedent, Indian industry wants similar ‘progressive policies’",
    "description": "US President Trump announces creation of Strategic Crypto Reserve, sparking market rally and global policy discussions.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/as-us-crypto-push-sets-global-precedent-indian-industry-wants-similar-progressive-policies/article69285663.ece",
    "timestamp": "2025-03-03T13:56:14Z"
  },
  {
    "title": "Hegseth halts cyber operations against Russia, adding to an ugly pattern",
    "description": "The problem is not just the Pentagon halting offensive cyber operations against Russia. It's also the series of related steps in the same direction.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/hegseth-halts-cyber-operations-russia-adding-ugly-pattern-rcna194474",
    "timestamp": "2025-03-03T13:55:56Z"
  },
  {
    "title": "GOP lawmakers commit to big spending cuts, putting Medicaid under a spotlight – but trimming the low-income health insurance program would be hard",
    "description": "GOP lawmakers commit to big spending cuts, putting Medicaid under a spotlight – but trimming the low-income health insurance program would be hardnewsbreak.com",
    "link": "https://www.newsbreak.com/share/3837897798662-gop-lawmakers-commit-to-big-spending-cuts-putting-medicaid-under-a-spotlight-but-trimming-the-low-income-health-insurance-program-would-be-hard?_f=app_share&amp;pd=0EiOXgpq&amp;lang=en_US&amp;send_time=1741010083&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_blend_exp_25q1-v5%2Cns_local_strategy_25q1_exp-control%2Cns_foryou_recall_exp_25q1-control&amp;s=i2",
    "timestamp": "2025-03-03T13:55:54Z"
  },
  {
    "title": "Monday, March 3, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/monday-march-3-2025/",
    "timestamp": "2025-03-03T13:55:43Z"
  },
  {
    "title": "Ukraine: Stop the Assassination of the Kononovich Brothers!",
    "description": "In a Feb. 25 public statement, the Kononovich brothers wrote: \n“Dear comrades, we officially appeal to the … anti-fascists of Europe and the USA, comrades, come out to the embassies and consulates of Ukraine around the world in our defense! …\nThe post Ukraine…",
    "link": "https://www.globalresearch.ca/ukraine-stop-assassination-kononovich-brothers/5881294",
    "timestamp": "2025-03-03T13:55:27Z"
  },
  {
    "title": "Crypto Braced For Another Trump Earthquake After Bitcoin, XRP, Solana And Cardano Price Boom",
    "description": "03/03 update below. This post was originally published on March 02\nBitcoin and major cryptocurrencies Ripple’s XRP, solana and cardano have rocketed higher after Donald Trump revealed plans to create a U.S.-focused crypto reserve.\nThe bitcoin price shot towar…",
    "link": "https://biztoc.com/x/1c42bbc0e0474dc2",
    "timestamp": "2025-03-03T13:55:25Z"
  },
  {
    "title": "Russia Reacts to Trump-Zelensky Spat: 'Crashing Like House of Cards'",
    "description": "Russian state media has reacted with glee to the White House clash between President Donald Trump and his Ukrainian counterpart Volodymyr Zelensky, one outlet saying it showed the Western system is \"crashing like a house of cards.\"\nThe aftershocks of Friday's…",
    "link": "https://biztoc.com/x/383054d4b1007a52",
    "timestamp": "2025-03-03T13:55:19Z"
  },
  {
    "title": "John Bolton Calls on Marco Rubio to Resign After Zelensky White House Spat",
    "description": "John Bolton, a former national security adviser for President Donald Trump, called on Secretary of State Marco Rubio to resign following Trump's tense meeting with Ukrainian President Volodymyr Zelensky.\nNewsweek contacted the U.S. Department of State for com…",
    "link": "https://biztoc.com/x/c40d3d87864d4ef9",
    "timestamp": "2025-03-03T13:55:11Z"
  },
  {
    "title": "WATCH: Bernie Sanders runs for cover after NBC asks if Dems should ‘have done more’ to cut waste under Biden",
    "description": "'You don't take food away from children, health care away from struggling people to give tax breaks to billionaires'",
    "link": "https://www.wnd.com/2025/03/watch-bernie-sanders-runs-for-cover-after-nbc-asks-if-dems-should-have-done-more-to-cut-waste-under-biden/",
    "timestamp": "2025-03-03T13:55:11Z"
  },
  {
    "title": "The Democrats' young man problem is real (Christian Paz/Vox)",
    "description": "Christian Paz / Vox:\nThe Democrats' young man problem is real  —  On a random Tuesday in February, a conservative provocateur and talk radio host made a bold proclamation about the state of the Democratic Party.  Donald Trump had won over young men, and nearl…",
    "link": "https://www.memeorandum.com/250303/p19",
    "timestamp": "2025-03-03T13:55:00Z"
  },
  {
    "title": "Donald Trump Says US Should Spend Less Time Worrying About Putin",
    "description": "President Donald Trump said the U.S. should \"spend less time worrying about Putin\" in a post on Truth Social after his heated meeting with Ukrainian President Volodymyr Zelensky.\nNewsweek reached out to the Russian and Ukrainian foreign ministries for comment…",
    "link": "https://biztoc.com/x/d7af315440e0ab19",
    "timestamp": "2025-03-03T13:54:58Z"
  },
  {
    "title": "Treasury ends enforcement of business ownership database meant to stop shell company formation",
    "description": "Treasury ends enforcement of business ownership database meant to stop shell company formation",
    "link": "https://www.livemint.com/companies/news/treasury-ends-enforcement-of-business-ownership-database-meant-to-stop-shell-company-formation-11741010060882.html",
    "timestamp": "2025-03-03T13:54:20Z"
  },
  {
    "title": "Britain must 'lead from the front' in Ukraine and 'tough choices to come', says Starmer",
    "description": "There are more tough choices to come on Ukraine and Britain must \"lead from the front\", Sir Keir Starmer has said.",
    "link": "https://news.sky.com/story/britain-must-lead-from-the-front-in-ukraine-and-tough-choices-to-come-says-sir-keir-starmer-13320817",
    "timestamp": "2025-03-03T13:54:00Z"
  },
  {
    "title": "CFPB Upheaval Leaves Hundreds of Millions in Settlements Unclaimed",
    "description": "With the CFPB’s future in limbo, so too are hundreds of millions in consumer settlements. For example, Reuters reported Monday (March 3), there is a $100 million pot of funds intended for borrowers that the Consumer Financial Protection Bureau (CFPB) says wer…",
    "link": "https://www.pymnts.com/news/cfpb/2025/cfpb-upheaval-leaves-hundreds-of-millions-in-settlements-unclaimed/",
    "timestamp": "2025-03-03T13:52:53Z"
  },
  {
    "title": "Norway fuel giant refuses to fill US ships after 'backstabbing' Trump's clash with Zelensky - NewsBreak",
    "description": "A petroleum giant in Norway has announced a ban on fuel sales to all US forces following a heated exchange between Donald Trump and Ukrainian President Vol",
    "link": "https://www.newsbreak.com/share/3837916415796-norway-fuel-giant-refuses-to-fill-us-ships-after-backstabbing-trump-s-clash-with-zelensky?s=a2&share_destination_id=MTY2MjgyNjMxLTE3NDEwMzA2NzE5ODM%3D&pd=0BFhhvIM&hl=en_US&send_time=1741030671&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v2%2Cns_foryou_rank_exp_25q1-v8",
    "timestamp": "2025-03-03T13:52:26Z"
  },
  {
    "title": "Trudeau Says Protecting Independence Is His Priority",
    "description": "\"Canadian Prime Minister Justin Trudeau said his priority in talks with King Charles on Monday will be protecting his country's sovereignty after U.S. President Donald Trump recently suggested making Canada the 51st U.S. state,\" Reuters",
    "link": "https://politicalwire.com/2025/03/03/trudeau-says-protecting-independence-is-his-priority/",
    "timestamp": "2025-03-03T13:52:00Z"
  },
  {
    "title": "Russia Reacts to Trump-Zelensky Spat: 'Crashing Like House of Cards'",
    "description": "The White House dispute between the U.S. and Ukrainian leaders has been welcomed by Kremlin propagandists.",
    "link": "https://www.newsweek.com/trump-zelensky-russia-war-2038604",
    "timestamp": "2025-03-03T13:51:20Z"
  },
  {
    "title": "Taliban Accuses 'Emotional' Trump of 'Misinformation' for Saying China Present at Ex-U.S. Airbase",
    "description": "The Taliban terrorist organization's top spokesman accused President Donald Trump of spreading \"misinformation\" on Sunday in response to his claim that the Chinese government was occupying the Bagram Air Base in Afghanistan, a former American site.\nThe post T…",
    "link": "https://www.breitbart.com/asia/2025/03/03/taliban-accuses-emotional-trump-of-misinformation-for-saying-china-present-at-ex-u-s-airbase/",
    "timestamp": "2025-03-03T13:50:40Z"
  },
  {
    "title": "Musk embrace of right-wing politics risks turning off car buyers, sinking Tesla stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world, analysts say, and the hit couldn't come at a worse time",
    "link": "https://abcnews.go.com/Business/wireStory/musks-embrace-wing-politics-risks-turning-off-car-119380010",
    "timestamp": "2025-03-03T13:49:53Z"
  },
  {
    "title": "Major U.S fuel supplier severs ties with military in fiery statement citing Donald Trump’s explosive Oval Office clash with Zelensky",
    "description": "A US fuel provider, Haltbakk Bunkers, has stopped supplying fuel to American warships in Norway, citing a tense confrontation between US president Donald Trump and  Ukrainian president Volodymyr Zelensky. The company criticized the US' actions towards Ukraine…",
    "link": "https://economictimes.indiatimes.com/news/international/us/major-u-s-fuel-supplier-severs-ties-with-military-in-fiery-statement-citing-donald-trumps-explosive-oval-office-clash-with-zelensky/articleshow/118686244.cms",
    "timestamp": "2025-03-03T13:48:51Z"
  },
  {
    "title": "Iranian Nuclear Dealmaker Quits as U.S. Sanctions Tighten",
    "description": "The resignation of Zarif and impeachment of Iran's Finance Minister are seen as a blow to negations with the Trump administration.",
    "link": "https://www.newsweek.com/iranian-nuclear-dealmaker-quits-us-sanctions-tighten-2038641",
    "timestamp": "2025-03-03T13:48:49Z"
  },
  {
    "title": "US President Donald Trump Unveils Plans for Crypto Strategic Reserve, Sector Responds Positively",
    "description": "US President Donald Trump has announced that Bitcoin, Ether, Ripple, Cardano, and Solana are under consideration for the creation of the nation's strategic crypto reserve. He emphasised that this initiative would be a pivotal step in strengthening the 'critic…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/us-president-donald-trump-insight-crypto-reserve-sector-positive-7838746",
    "timestamp": "2025-03-03T13:48:29Z"
  },
  {
    "title": "John Bolton Calls on Marco Rubio to Resign After Zelensky White House Spat",
    "description": "The former national security adviser called for the secretary of state to resign as his \"reputation might suffer for a long time.\"",
    "link": "https://www.newsweek.com/john-bolton-calls-marco-rubio-resign-zelensky-white-house-spat-2038638",
    "timestamp": "2025-03-03T13:48:12Z"
  },
  {
    "title": "Small-Budget Prostitution Romp ‘Anora’ Triumphs at Oscars, Star Honors 'Sex-Worker Community' from Stage",
    "description": "Independent film “Anora” — the tale of a sex worker whose marriage to the son of a Russian oligarch quickly unravels — was the big winner at the Oscars on Sunday, scooping five awards including best picture.",
    "link": "https://www.breitbart.com/entertainment/2025/03/03/small-budget-prostitution-romp-anora-triumphs-at-oscars-star-honors-sex-worker-community-from-stage/",
    "timestamp": "2025-03-03T13:48:02Z"
  },
  {
    "title": "Amid US Treasury Crypto Reserve Split Opinions, Could It Mean Good News for Best Meme Coins Like Meme Index?",
    "description": "US President Donald Trump announced yesterday that altcoins will be included in the government’s crypto strategic reserve. It’s an interesting move that has been met with mixed reactions. Could we potentially see meme coin indexes being added to the reserve? …",
    "link": "http://www.newsbtc.com/news/are-us-crypto-reserve-additions-good-for-best-meme-coins-like-meme-index/",
    "timestamp": "2025-03-03T13:47:55Z"
  },
  {
    "title": "Eurozone inflation eases slightly in February",
    "description": "Eurozone inflation edged down slightly in February to 2.4 percent, reversing a four-month upward trend thanks to a slowdown in energy price increases, official data showed on Monday. Last month’s rate was down from 2.5 percent in January, but it came in highe…",
    "link": "https://www.digitaljournal.com/world/eurozone-inflation-eases-slightly-in-february/article",
    "timestamp": "2025-03-03T13:47:34Z"
  },
  {
    "title": "Women earn 78 cents for every $1 men paid on average",
    "description": "New data shows Australia's gender pay gap has narrowed, but working women are still more than $28,000 a year worse off than the average man.",
    "link": "https://www.abc.net.au/news/2025-03-04/gender-pay-gap-improves-but-still-78-cents-to-dollar-wgea/104967394",
    "timestamp": "2025-03-03T13:47:19Z"
  },
  {
    "title": "Trudeau set to meet with King Charles before returning to Ottawa after security summit",
    "description": "Trudeau said he would raise matters with the King that are most important to Canadians, adding that Canada's sovereignty and independence seem to be atop the public's mind.",
    "link": "https://www.nationalobserver.com/2025/03/03/news/trudeau-king-charles",
    "timestamp": "2025-03-03T13:46:22Z"
  },
  {
    "title": "Trump Bends Congress to His Will on Spending, Tax Cut Agenda (Bloomberg)",
    "description": "Bloomberg:\nTrump Bends Congress to His Will on Spending, Tax Cut Agenda  — Democrats Gun-shy About Using Shutdown to Stop Musk's DOGE  — Republicans Unite on Tax Cut Vision, Tough Decisions Lie Ahead  —  President Donald Trump is bending Congress to his will,…",
    "link": "https://www.memeorandum.com/250303/p16",
    "timestamp": "2025-03-03T13:45:01Z"
  },
  {
    "title": "Car drives into crowd in German city of Mannheim killing at least one",
    "description": "MANNHEIM, Germany: A car drove into a crowd of people in the western German city of Mannheim on Monday (Mar 3), killing at least one person, injuring several others and overshadowing carnival celebrations in the region where police had been on alert for secur…",
    "link": "https://www.channelnewsasia.com/world/car-drives-crowd-german-city-mannheim-killing-least-one-4973296",
    "timestamp": "2025-03-03T13:45:00Z"
  },
  {
    "title": "Forbes Daily: Hostile Trump-Zelensky Exchange Signals Foreign Policy Shift",
    "description": "Today’s Forbes Daily covers billionaires and Trump’s “gold card” visa, cooling inflation, Oscar award winners, the future of Crumbl, a new crypto reserve and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/03/03/forbes-daily-hostile-trump-zelensky-exchange-signals-foreign-policy-shift/",
    "timestamp": "2025-03-03T13:45:00Z"
  },
  {
    "title": "'Money is being pilfered': Democrats worry Trump and Musk will 'steal' from new budget",
    "description": "Democrats want reassurances from congressional Republican and the White House that Donald Trump's administration will actually spend money allocated as part of any new law preventing a government shutdown.Congress has less than two weeks to agree on an extens…",
    "link": "https://www.rawstory.com/congress-budget-impound/",
    "timestamp": "2025-03-03T13:44:53Z"
  },
  {
    "title": "How 'Kremlin Bots' Responded to Trump's Meeting With Zelensky",
    "description": "Russian bots flocked to comment under posts about Ukrainian President Volodymyr Zelensky's fiery meeting with Donald Trump at the White House on Friday, offering a glimpse into the Kremlin's emerging line of response.\nNewsweek has contacted the Russian Foreig…",
    "link": "https://biztoc.com/x/6284d862e0eb0f1e",
    "timestamp": "2025-03-03T13:44:29Z"
  },
  {
    "title": "US tariffs on Canada and Mexico will happen Tuesday, says commerce chief",
    "description": "US tariffs on Canada and Mexico will happen Tuesday, says commerce chief\nUS tariffs against Canada and Mexico are set to come into effect on Tuesday but their level will be decided by Donald Trump, the US commerce secretary has said.\nThe US president has thre…",
    "link": "https://biztoc.com/x/d327eef6b3e6d4d0",
    "timestamp": "2025-03-03T13:44:21Z"
  },
  {
    "title": "Here's how Canada is expected to respond if tariffs go ahead tomorrow",
    "description": "Tariffs on Canadian and Mexican goods imposed by the U.S. government are expected to take hold tomorrow, marking the start of a North American trade war.",
    "link": "https://www.nationalobserver.com/2025/03/03/news/canad-respond-tariffs",
    "timestamp": "2025-03-03T13:44:20Z"
  },
  {
    "title": "Trump to Discuss Halting US Military Aid to Ukraine - Reports: Live Updates",
    "description": "Donald Trump is expected to discuss halting military aid to Ukraine in a meeting with key advisors on Monday, according to reports. Follow Newsweek's live blog.",
    "link": "https://biztoc.com/x/527cd32dda5bc73a",
    "timestamp": "2025-03-03T13:44:00Z"
  },
  {
    "title": "Canada on tenterhooks over looming north American trade war with steep tariffs",
    "description": "Canada is bracing to see whether U.S. President Donald Trump follows through on his threats of economy-wide tariffs — or whether another last-minute pause materializes, averting a North American trade war.",
    "link": "https://www.nationalobserver.com/2025/03/03/news/canada-north-american-trade-war-steep-tariffs",
    "timestamp": "2025-03-03T13:41:45Z"
  },
  {
    "title": "Trump Brutally Roasted at Oscars With Hilarious Vladimir Putin Jab",
    "description": "Donald Trump was roasted at the 97th Academy Awards ceremony Sunday night for his close ties to Russian President Vladimir Putin. \r\n“Anora is having a good night,” said host Conan O’Brien, referring to Sean Baker’s film, which had already picked up awards for…",
    "link": "https://newrepublic.com/post/192210/donald-trump-oscars-vladimir-putin-volodymyr-zelenskiy",
    "timestamp": "2025-03-03T13:39:51Z"
  },
  {
    "title": "DeSantis wife gamble could lead to saying 'goodbye to any ‘28 presidential run': insider",
    "description": "Rumblings in Florida that Gov. Ron DeSantis (R) is working behind the scenes to get his wife elected as the state's next governor since he is termed out are being viewed as a huge gamble that could impact any political future he may have.According to a report…",
    "link": "https://www.rawstory.com/casey-desantis-2671252402/",
    "timestamp": "2025-03-03T13:39:47Z"
  },
  {
    "title": "Bitcoin Booms, Experts Predict Bull Run Could Last into 2026. Time to Invest Early in Best Wallet Token?",
    "description": "If you checked on the crypto market on Friday, you’ll have witnessed a bloodbath. Bitcoin plummeted, falling to below $80K at some points. But by this morning, everything had changed. US President Donald Trump’s announcement of a strategic crypto reserve to i…",
    "link": "https://bitcoinist.com/bitcoin-booms-invest-early-bull-run-cycle-into-2026/",
    "timestamp": "2025-03-03T13:36:07Z"
  },
  {
    "title": "Incoming German leader says Trump and Zelenskyy clash 'manufactured escalation'",
    "description": "Friedrich Merz, who is likely to be the next German chancellor, has been outspoken in his belief Europe needs to pursue greater independence from the US.",
    "link": "https://www.abc.net.au/news/2025-03-04/friedrich-merz-says-clash-trump-and-zelenskyy-manufactured/105005952",
    "timestamp": "2025-03-03T13:35:46Z"
  },
  {
    "title": "Donald Trump gave blunt response when asked if he kicked Zelenskyy out of the White House",
    "description": "US President Donald Trump clashed with Ukraine President Volodymyr Zelenskyy at the White House on Friday",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-zelenskyy-white-house-159848-20250303",
    "timestamp": "2025-03-03T13:35:22Z"
  },
  {
    "title": "Reddit Co-Founder Alexis Ohanian Joins Frank McCourt’s Bid for TikTok",
    "description": "Alexis Ohanian, the co-founder of Reddit and a venture capitalist, has joined his bid to acquire TikTok's US operations. The former Los Angeles Dodgers owner and his partners submitted a bid for TikTok in early January, as a deadline approached that would req…",
    "link": "https://www.gadgets360.com/internet/news/reddit-co-founder-alexis-ohanian-joins-frank-mccourt-bid-tiktok-7838655",
    "timestamp": "2025-03-03T13:35:01Z"
  },
  {
    "title": "Zelenskyy at the White House: The Rapid Crumbling of US Leadership Creates a Golden Opportunity for China",
    "description": "Amid a near-complete reversal in U.S. foreign policy, more nations may look to China to fill the role that the United States once played – an unthinkable prospect just a few months ago.",
    "link": "https://thediplomat.com/2025/03/zelenskyy-at-the-white-house-the-rapid-crumbling-of-us-leadership-creates-a-golden-opportunity-for-china/",
    "timestamp": "2025-03-03T13:34:00Z"
  },
  {
    "title": "Trump airs fresh frustrations with Zelenskyy, as U.S. officials amplify pressure on Ukrainian leader",
    "description": "U.S. President Donald Trump slammed Ukrainian President Volodymyr Zelenskyy on Monday for suggesting that the end of Russia's war against Ukraine likely \"is still very, very far away.\"",
    "link": "https://www.cbc.ca/news/world/ukraine-war-france-uk-trump-zelenskyy-1.7472895",
    "timestamp": "2025-03-03T13:32:20Z"
  },
  {
    "title": "France proposes 1-month truce in Russia-Ukraine war",
    "description": "France and Britain are proposing a one-month truce between Russia and Ukraine that would cover air, sea and energy infrastructure attacks but not include ground fighting, French President Emmanuel Macron and his foreign minister said.",
    "link": "https://www.cbc.ca/news/world/ukraine-war-france-uk-1.7472895",
    "timestamp": "2025-03-03T13:32:20Z"
  },
  {
    "title": "Zelensky says ceasefire without guarantees 'will be failure'",
    "description": "Ukraine's President Volodymyr Zelensky has told British media that a ceasefire without security guarantees for his country would not bring a lasting end to Russia's invasion after allies called for a truce.",
    "link": "https://www.hurriyetdailynews.com/zelensky-says-ceasefire-without-guarantees-will-be-failure-206473",
    "timestamp": "2025-03-03T13:32:15Z"
  },
  {
    "title": "Donald Trump-Volodymyr Zelenskiy's White House explosive verbal spat was fake? Check this bizarre claim",
    "description": "Donald Trump and Volodymyr Zelenskiy's explosive verbal argument at the White House has sparked debate about President conduct and etiquettes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-volodymyr-zelenskiys-white-house-explosive-verbal-spat-was-fake-check-this-bizarre-claim/articleshow/118686758.cms",
    "timestamp": "2025-03-03T13:32:08Z"
  },
  {
    "title": "U.S.-Europe Rift Widens as Russia Welcomes Trump's Shifting Ukraine Stance Following Zelensky Clash",
    "description": "Kenneth Roth, visiting professor at the Princeton School of Public and International Affairs and former executive director of Human Rights Watch, responds to the shocking Oval Office meeting between Ukrainian President Volodymyr Zelensky, U.S. President Donal…",
    "link": "https://www.democracynow.org/2025/3/3/ukraine_russia_trump_vance_putin",
    "timestamp": "2025-03-03T13:31:40Z"
  },
  {
    "title": "Musk’s embrace of right-wing politics risks turning off car buyers and sinking Tesla’s stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world.",
    "link": "https://www.denverpost.com/2025/03/03/musk-politics-tesla-backlash/",
    "timestamp": "2025-03-03T13:31:03Z"
  },
  {
    "title": "Musk’s embrace of right-wing politics risks turning off car buyers and sinking Tesla’s stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world.",
    "link": "https://www.bostonherald.com/2025/03/03/musk-politics-tesla-backlash/",
    "timestamp": "2025-03-03T13:31:03Z"
  },
  {
    "title": "Long Live the…",
    "description": "Steve Brodner\n\nKING!\nThe post Long Live the… appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/long-live-the/",
    "timestamp": "2025-03-03T13:30:56Z"
  },
  {
    "title": "Sui and XRP buck trend with $20 million ETP inflow amid $3.8 billion crypto slump",
    "description": "Last week, the crypto market witnessed its most significant weekly sell-off, with outflows hitting a record $2.9 billion, according to CoinShares‘ latest weekly report. This marked the third consecutive week of capital exiting digital asset investment product…",
    "link": "https://cryptoslate.com/sui-and-xrp-buck-trend-with-20-million-inflow-amid-3-8-billion-crypto-slump/",
    "timestamp": "2025-03-03T13:30:28Z"
  },
  {
    "title": "Europe Unveils Rival Ukraine Peace Plan Backed By ‘Boots On The Ground & Planes In The Air’",
    "description": "Update(1645ET): Is the UK trying to pull Trump into starting WW3? During Sunday's security summit of European leaders to find an alternate peace plan to Washington's, UK Prime Minister Keir Starmer announced a \"coalition of the willing\" to step up efforts in …",
    "link": "https://www.shtfplan.com/headline-news/europe-unveils-rival-ukraine-peace-plan-backed-by-boots-on-the-ground-planes-in-the-air",
    "timestamp": "2025-03-03T13:30:26Z"
  },
  {
    "title": "Coinbase Chasing Receipts at SEC to Tally Cost of Agency's Crypto Saga",
    "description": "The U.S. digital assets exchange made a public-records request to add up what the regulator spent on crypto cases in recent years, including against Coinbase.",
    "link": "https://www.coindesk.com/policy/2025/02/28/coinbase-chasing-receipts-at-sec-to-tally-cost-of-agency-s-crypto-saga",
    "timestamp": "2025-03-03T13:30:00Z"
  },
  {
    "title": "Trump Bends Congress to His Will",
    "description": "“President Donald Trump is bending Congress to his will, hobbling minority Democrats with an everything-at-once strategy and rallying fractious Republicans behind his politically risky tax cut plan and billionaire Elon Musk’s cost-cutting crusade,” Bloomberg …",
    "link": "https://politicalwire.com/2025/03/03/trump-bends-congress-to-his-will/",
    "timestamp": "2025-03-03T13:30:00Z"
  },
  {
    "title": "$XRP Challenges All-Time High As Ripple CEO Blasts Maximalism Anew",
    "description": "$XRP is now much closer to its all-time high after it surged as high as $2.96 at one point Sunday night following President Trump's big news about a national crypto reserve that will include the $XRP token.",
    "link": "https://www.ibtimes.com.au/xrp-challenges-all-time-high-ripple-ceo-blasts-maximalism-anew-1856586",
    "timestamp": "2025-03-03T13:29:47Z"
  },
  {
    "title": "Stop targeting Russian hackers, Trump administration orders US Cyber Command",
    "description": "For years, the United States has joined with much of the rest of the world, in declaring that Russia poses a significant cyber threat - hosting cybercriminal gangs and state-sponsored hackers who present a danger to national security, critical infrastructure,…",
    "link": "https://www.bitdefender.com/en-us/blog/hotforsecurity/stop-targeting-russian-hackers-trump-administration-orders-us-cyber-command",
    "timestamp": "2025-03-03T13:26:44Z"
  },
  {
    "title": "Europe buys Zelenskiy some time and wrests initiative from Trump and Putin",
    "description": "The big question remains whether Ukraine can survive without American assistance",
    "link": "https://www.irishtimes.com/world/europe/2025/03/03/europe-buys-zelenskiy-some-time-and-wrests-initiative-from-trump-and-putin/",
    "timestamp": "2025-03-03T13:26:43Z"
  },
  {
    "title": "Modern “Public Health” is Based on Utilitarianism and Socialism",
    "description": "“Public Health” relies on top-down, centrally planned interventions and mandates.",
    "link": "https://www.malone.news/p/modern-public-health-is-based-on",
    "timestamp": "2025-03-03T13:26:16Z"
  },
  {
    "title": "Trump is all-in on DOGE. It's a political gamble. (Megan Messerly/Politico)",
    "description": "Megan Messerly / Politico:\nTrump is all-in on DOGE.  It's a political gamble.  —  DOGE is threatening to overshadow the president's popular, and politically crucial, economic and legislative priorities.  —  President Donald Trump has elevated DOGE to the cent…",
    "link": "https://www.memeorandum.com/250303/p12",
    "timestamp": "2025-03-03T13:25:01Z"
  },
  {
    "title": "In Pointed Contrast to Zelensky, Netanyahu Thanks Trump Profusely",
    "description": "Israeli Prime Minister Benjamin Netanyahu released a video Sunday thanking President Donald Trump profusely for his help in what seemed a pointed and deliberate contrast to Ukrainian President Volodymyr Zelensky's behavior.\nThe post In Pointed Contrast to Zel…",
    "link": "https://www.breitbart.com/middle-east/2025/03/03/in-pointed-contrast-to-zelensky-netanyahu-thanks-trump-profusely/",
    "timestamp": "2025-03-03T13:24:33Z"
  },
  {
    "title": "Trump’s row with Zelenskyy recalls Obama, Biden humiliations of Netanyahu",
    "description": "The clash between President Donald Trump and Ukrainian President Volodmyr Zelenskyy has led analysts to recall the treatment meted out by the Obama and Biden administrations against Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.foxnews.com/world/double-standards-trumps-row-zelenskyy-recalls-obama-biden-humiliation-netanyahu",
    "timestamp": "2025-03-03T13:23:43Z"
  },
  {
    "title": "Layoffs hit Ola Electric; Paytm shares dive 4%",
    "description": "Ola Electric has implemented significant job cuts amidst ongoing challenges. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/layoffs-hit-ola-electric-paytm-shares-dive-4/articleshow/118686596.cms",
    "timestamp": "2025-03-03T13:22:39Z"
  },
  {
    "title": "Domino’s Pizza sales are struggling. It’s adding stuffed crust to help",
    "description": "Adding a stuffed crust to a pizza chain’s menu doesn’t seem like a big deal. But for Domino’s Pizza, it’s more than three decades in the making.\nThe option was introduced in 1995 by Pizza Hut — launching with a TV ad starring Donald Trump — and became an imme…",
    "link": "https://biztoc.com/x/3be698d8b3e8e2d4",
    "timestamp": "2025-03-03T13:22:31Z"
  },
  {
    "title": "Dow Jones Futures Rise Ahead Of Big Tariffs; Bitcoin Soars On Trump",
    "description": "The Dow Jones Industrial Average and other major stock futures traded higher Monday as President Donald Trump's tariffs were set to take effect. Meanwhile, bitcoin and other cryptocurrencies soared as Trump expanded on his commitment for a U.S. crypto strateg…",
    "link": "https://biztoc.com/x/c6e4cd64d47ce336",
    "timestamp": "2025-03-03T13:22:31Z"
  }
]