[
  {
    "title": "Trump Voter Goes On CNN To Trash President’s ‘Racist’ and ‘Dehumanizing’ Somali ‘Garbage’ Comment",
    "description": "Somali American Salman Fiqy told CNN that he's withdrawn his support for President the Republican Party over the president's \"garbage\" comment about Somalis.\nThe post Trump Voter Goes On CNN To Trash President’s ‘Racist’ and ‘Dehumanizing’ Somali ‘Garbage’ Co…",
    "link": "https://www.mediaite.com/media/tv/trump-voter-goes-on-cnn-to-trash-presidents-racist-and-dehumanizing-somali-garbage-comment/",
    "timestamp": "2025-12-06T18:54:26Z"
  },
  {
    "title": "Russia unleashes massive drone and missile attack on Ukraine as talks to end war continue",
    "description": "Russia used 653 drones and 51 missiles in the wide-reaching overnight attack on Ukraine, which triggered air raid alerts across the country and came as Ukraine marked Armed Forces Day, the country’s air force said Saturday morning.",
    "link": "https://www.pbs.org/newshour/world/russia-unleashes-massive-drone-and-missile-attack-on-ukraine-as-talks-to-end-war-continue",
    "timestamp": "2025-12-06T18:54:14Z"
  },
  {
    "title": "Milei welcomes Argentina’s first F-16 fighter jets",
    "description": "President Javier Milei on Saturday hailed the arrival of Argentina’s first six F-16 jets purchased from Denmark, describing them as “guardian angels” that will strengthen the South American country’s armed forces. The US-built aircraft are among the 24 used s…",
    "link": "https://www.digitaljournal.com/world/milei-welcomes-argentinas-first-f-16-fighter-jets/article",
    "timestamp": "2025-12-06T18:52:20Z"
  },
  {
    "title": "Come and Get Me",
    "description": "I saw on Robert Reich’s substack this morning (Saturday): On September 25, Donald Trump signed a presidential order called NSPM-7, a sweeping attack on free speech that targets progressive organizations and individuals for prosecution for “domestic terrorism.…",
    "link": "https://freethoughtblogs.com/seymour/2025/12/06/come-and-get-me/",
    "timestamp": "2025-12-06T18:50:04Z"
  },
  {
    "title": "Trump Puts Screws on Indiana Senators to Greenlight a GOP-Friendly Voting Map",
    "description": "The Indiana House voted on Friday to redraw the state’s congressional map with the aim to produce a 9-0 Republican delegation. Lawmakers approved the redistricting proposal 57-41, despite 12 Republicans joining the entire Democratic House caucus in opposition…",
    "link": "https://www.motherjones.com/politics/2025/12/trump-indiana-house-senate-midterms-republican-redistricting-gerrymandered-map/",
    "timestamp": "2025-12-06T18:48:36Z"
  },
  {
    "title": "Europe’s €140M fine on X isn’t censorship, it claims. But it is. Europe is pursuing the same censorship-by-proxy strategy used in the US from 2020 - 22.",
    "description": "The reason is that free speech on X, particularly around mass migration, has exposed Europe’s civilizational suicide. Today, the European Commission fined Elon Musk’s X €140 million for, it says, breaking laws requiring social media transparency. Specifically…",
    "link": "https://freerepublic.com/focus/f-news/4356229/posts",
    "timestamp": "2025-12-06T18:42:08Z"
  },
  {
    "title": "'Sensitive' Donald Trump Is Fuming Over 'Sleepy Joe' Comparisons as He 'Fixates' on Coverage About His Health Decline 'for Several Days'",
    "description": "'Sensitive' Donald Trump Is Fuming Over 'Sleepy Joe' Comparisons as He 'Fixates' on Coverage About His Health Decline 'for Several Days'newsbreak.com",
    "link": "https://www.newsbreak.com/share/4383029954345-sensitive-donald-trump-is-fuming-over-sleepy-joe-comparisons-as-he-fixates-on-coverage-about-his-health-decline-for-several-days?_f=app_share&amp;pd=0GowQHi6&amp;lang=en_US&amp;send_time=1765046488&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-06T18:41:54Z"
  },
  {
    "title": "Trump administration plays up pipe bomb suspect’s arrest. Jan. 6 violence goes unmentioned",
    "description": "WASHINGTON (AP) — After the arrest of a man charged with placing two pipe bombs outside the headquarters of the Republican and Democratic national parties on Jan. 5, 2021, the warning from the Trump administration was clear: If you come to the nation’s capita…",
    "link": "https://freerepublic.com/focus/f-news/4356228/posts",
    "timestamp": "2025-12-06T18:41:50Z"
  },
  {
    "title": "‘Racist Piece of Sh*t!’ Don Lemon Goes Off On Trump Over Stunning Rants",
    "description": "Don Lemon went off on \"racist piece of sh*t\" President Donald Trump and the media for not calling out his rants against Somalis boldly enough.\nThe post ‘Racist Piece of Sh*t!’ Don Lemon Goes Off On Trump Over Stunning Rants first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/racist-piece-of-sht-don-lemon-goes-off-on-trump-over-stunning-rants/",
    "timestamp": "2025-12-06T18:41:34Z"
  },
  {
    "title": "WATCH: Trump praises Italian tenor Andrea Bocelli ahead of private concert at White House",
    "description": "President Donald Trump praised the voice of Italian tenor Andrea Bocelli on Friday, following his performance at a ceremony held to mark the FIFA 2026 World Cup draw at the Kennedy Center.",
    "link": "https://biztoc.com/x/b7cf547794b495f2",
    "timestamp": "2025-12-06T18:40:35Z"
  },
  {
    "title": "WATCH: Trump praises Italian tenor Andrea Bocelli ahead of private concert at White House",
    "description": "President Donald Trump praised the voice of Italian tenor Andrea Bocelli on Friday, following his performance at a ceremony held to mark the FIFA 2026 World Cup draw at the Kennedy Center.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-praises-italian-tenor-andrea-bocelli-ahead-of-private-concert-at-white-house",
    "timestamp": "2025-12-06T18:32:36Z"
  },
  {
    "title": "Trump Viciously Attacks CNN’s Kaitlan Collins – ‘Always Stupid and Nasty’ – and Misspells Her Name",
    "description": "The president also insists his White House ballroom is \"under budget and ahead of schedule\" just like \"my jobs always are\"\nThe post Trump Viciously Attacks CNN’s Kaitlan Collins – ‘Always Stupid and Nasty’ – and Misspells Her Name appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-attack-against-kaitlan-collins-cnn-misspell-name/",
    "timestamp": "2025-12-06T18:31:18Z"
  },
  {
    "title": "'This was a wanted pregnancy': The mothers facing prosecution in Trump's America",
    "description": "Denied pregnancy care and threatened with prosecution: in the wake of widespread abortion bans, across the United States prosecutors have launched more than 400 cases charging people with crimes related to their pregnancy, miscarriage, stillbirth or birth.",
    "link": "https://www.abc.net.au/news/2025-12-07/pregnancy-criminalisation-abortion-fetal-personhood-miscarriage/106097546",
    "timestamp": "2025-12-06T18:30:00Z"
  },
  {
    "title": "White House roadmap says Europe may be 'unrecognizable' in 20 years as migration raises doubts about US allies",
    "description": "White House warns Europe faces demographic crisis from mass immigration that could weaken NATO alliances and leave continent 'unrecognizable in 20 years.'",
    "link": "https://www.foxnews.com/world/white-house-roadmap-europe-unrecognizable-20-years-migration-raises-doubts-us-allies",
    "timestamp": "2025-12-06T18:26:45Z"
  },
  {
    "title": "Chef José Andrés Slams ‘Divisive’ Trump Over FIFA Peace Prize Award: ‘Betrays The Beautiful Game’",
    "description": "Chef José Andrés expressed his dismay that the International Federation of Football Association (FIFA) chose to honor Donald Trump with a \"peace prize.\"\nThe post Chef José Andrés Slams ‘Divisive’ Trump Over FIFA Peace Prize Award: ‘Betrays The Beautiful Game’…",
    "link": "https://www.mediaite.com/media/news/chef-jose-andres-slams-divisive-trump-over-fifa-peace-prize-award-betrays-the-beautiful-game/",
    "timestamp": "2025-12-06T18:26:33Z"
  },
  {
    "title": "Shocking DOJ Indictment: Obama Official from DEA Laundered Money for Mexican Drug Cartel",
    "description": "The Justice Department said that Paul Campo, who served at the DEA, advised CJNG on acquiring drones and firearms.",
    "link": "https://www.westernjournal.com/shocking-doj-indictment-obama-official-dea-laundered-money-mexican-drug-cartel/",
    "timestamp": "2025-12-06T18:18:40Z"
  },
  {
    "title": "French Cinema Boss Addresses WBD-Netflix Deal As Execs At Red Sea Film Festival Take Stock: “You Can’t Have Your Cake & Eat It” - Deadline",
    "description": "French Cinema Boss Addresses WBD-Netflix Deal As Execs At Red Sea Film Festival Take Stock: “You Can’t Have Your Cake & Eat It”Deadline Angst Turns to Anger in Hollywood as Netflix Hooks Warner Bros.The New York Times Netflix Reassures Subscribers After Warne…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180314041",
    "timestamp": "2025-12-06T18:12:25Z"
  },
  {
    "title": "Honduran election still too close to call as vote counting enters seventh day",
    "description": "TEGUCIGALPA, Dec 6 (Reuters) - In Honduras, Nasry Asfura, the conservative presidential candidate backed by U.S. President Donald Trump, maintained a razor-thin lead on Saturday as counting stretched into its seventh day and the race remains too close to call…",
    "link": "https://www.thestar.com.my/news/world/2025/12/07/honduran-election-still-too-close-to-call-as-vote-counting-enters-seventh-day",
    "timestamp": "2025-12-06T18:10:00Z"
  },
  {
    "title": "Exclusive--Greek Foreign Minister at Doha Forum: We ‘Commend’ President Trump for Leading World to a ‘More Peaceful and Prosperous Future'",
    "description": "Greek Foreign Minister Giorgos Gerapetritis commended President Donald Trump for leading the world into a \"more peaceful and prosperous future,\" making the remarks during an interview with Breitbart News Washington Bureau Chief Matthew Boyle at the Doha Forum…",
    "link": "https://www.breitbart.com/politics/2025/12/06/greek-foreign-minister-at-doha-forum-we-commend-president-trump-leading-world-more-peaceful-prosperous-future/",
    "timestamp": "2025-12-06T18:09:45Z"
  },
  {
    "title": "New Trump Rules Could Green-Light TOYOTA HILUX Pickup Sales",
    "description": "Pickup truck enthusiasts rejoiced this week after President Donald Trump moved to roll back auto regulations, paving the way for smaller, cheaper cars and trucks, including the storied Toyota Hilux Champ.“We’re officially terminating Joe Biden’s ridiculously …",
    "link": "https://freerepublic.com/focus/f-news/4356225/posts",
    "timestamp": "2025-12-06T18:05:05Z"
  },
  {
    "title": "Trump Wins Peace Prize! No, Not That One.",
    "description": "It's a very special peace prize for a very special boy.",
    "link": "https://www.wonkette.com/p/trump-wins-peace-prize-no-not-that",
    "timestamp": "2025-12-06T18:00:58Z"
  },
  {
    "title": "Trump Threatened To Attack Colombia",
    "description": "United States ruler Donald Trump has threatened to attack Colombia as fears of a war with Venezuela escalate. Trump announced plans to expand anti-drug operations to include land-based strikes against Colombian cocaine labs, accusing Bogota of harboring drug …",
    "link": "https://www.shtfplan.com/headline-news/trump-threatened-to-attack-colombia",
    "timestamp": "2025-12-06T18:00:29Z"
  },
  {
    "title": "VUSLAT BAYOGLU | Follow the money, not Trump & Co",
    "description": "US companies are betting heavily on South Africa, ignoring the right-wing trolls in both their own country and here",
    "link": "https://www.sundaytimes.timeslive.co.za/business/news/2025-12-06-follow-the-money-not-trump-co/",
    "timestamp": "2025-12-06T18:00:25Z"
  },
  {
    "title": "President Rages After FOX Guest Skewers Him Over Rising Prices...",
    "description": "Donald Trump called the loyalty of Fox News into question after the network invited Peter Schiff into their roster of yes-men, only to offer a blistering...",
    "link": "https://www.thedailybeast.com/trump-rages-after-fox-news-guest-skewers-him-over-rising-prices/",
    "timestamp": "2025-12-06T18:00:15Z"
  },
  {
    "title": "Fox News Host Finds Bonkers ‘Evidence’ of God’s Existence in Trump",
    "description": "Fox News host Jesse Watters believes Donald Trump’s naked thirst for opulence is proof of God’s existence. The 47-year-old divorcé offered a wild theological...",
    "link": "https://www.thedailybeast.com/fox-news-host-finds-bonkers-evidence-of-gods-existence-in-trump/",
    "timestamp": "2025-12-06T17:57:24Z"
  },
  {
    "title": "Trump wants to recreate a white America that never existed (Rebecca Solnit/The Guardian)",
    "description": "Rebecca Solnit / The Guardian:\nTrump wants to recreate a white America that never existed  —  The persecution of brown people and mass deportations will not create the white country of far-right fantasy  —  As Donald Trump deteriorates and his grasp on power …",
    "link": "https://www.memeorandum.com/251206/p39",
    "timestamp": "2025-12-06T17:50:01Z"
  },
  {
    "title": "Sydney Sweeney addresses American Eagle ad, says she's 'against hate'",
    "description": "After months of silence followed by an uncomfortable interview with GQ magazine, actor Sydney Sweeney has finally addressed her controversial American Eagle advertisement head-on",
    "link": "https://www.nbcnews.com/news/us-news/sydney-sweeney-american-eagle-campaign-rcna247738",
    "timestamp": "2025-12-06T17:49:57Z"
  },
  {
    "title": "Mansour Abbas' surprising announcement",
    "description": "Ra'am chief MK Mansour Abbas announces surprising decision which could massively impact Israel's next elections.",
    "link": "https://www.israelnationalnews.com/news/418895",
    "timestamp": "2025-12-06T17:48:26Z"
  },
  {
    "title": "President Trump wins inaugural Fifa Peace Prize (Emma Smith/BBC)",
    "description": "Emma Smith / BBC:\nPresident Trump wins inaugural Fifa Peace Prize  —  United States President Donald Trump received the inaugural Fifa Peace Prize before the draw for the 2026 Fifa World Cup.  —  The award has been introduced this year by Fifa president Giann…",
    "link": "https://www.memeorandum.com/251206/p38",
    "timestamp": "2025-12-06T17:45:00Z"
  },
  {
    "title": "Meet Radha, the dwarf buffalo wonder: The pint-sized 2 feet 8 in Murrah sensation whose tiny stature stunned Guinness World Records",
    "description": "A miniature Murrah buffalo named Radha, standing just 2 feet 8 inches tall, has become a national sensation in Malawadi, Maharashtra. Her exceptionally small stature, far below the breed's typical height, has earned her a Guinness World Record. Radha's unique…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/meet-radha-the-dwarf-buffalo-wonder-the-pint-sized-2-feet-8-in-murrah-sensation-whose-tiny-stature-stunned-guinness-world-records/articleshow/125807261.cms",
    "timestamp": "2025-12-06T17:43:18Z"
  },
  {
    "title": "This vile Trump threat would redefine who gets to be American",
    "description": "You might think that when you are a US citizen, you cannot have that status taken away. You would be wrong, it turns out. And behind that fact is a long and often ugly history.Last Sunday, President Donald Trump said that he would “absolutely” denaturalize Am…",
    "link": "https://www.rawstory.com/denaturalization/",
    "timestamp": "2025-12-06T17:43:09Z"
  },
  {
    "title": "MLK Day, Juneteenth removed from fee-free days at national parks, adds Trump’s birthday",
    "description": "The department also said that beginning Jan. 1, the Annual Pass will cost $80 for U.S. residents and $250 for nonresidents.",
    "link": "https://www.wsbtv.com/news/local/atlanta/mlk-day-juneteenth-removed-fee-free-days-national-parks-adds-trumps-birthday/RQ55M4ZXDRCY7OJTHXVS42M5JA/",
    "timestamp": "2025-12-06T17:42:19Z"
  },
  {
    "title": "US Steel to resume steel production at Illinois plant shut 2 years ago",
    "description": "U.S. Steel said it will resume making steel slabs at its Granite City Works plant in Illinois as demand rebounds.",
    "link": "https://www.fox32chicago.com/news/us-steel-resume-steel-production-illinois-plant-shut-2-years-ago",
    "timestamp": "2025-12-06T17:40:31Z"
  },
  {
    "title": "World Cup 2026 Draw Africa: Morocco face Brazil, Egypt draw Belgium, full group breakdown",
    "description": "LIVEAfrica’s nine qualified teams learn their paths: DR Congo still eye a placeWorld Cup 2026 Draw Africa: Morocco face Brazil, Egypt draw Belgium, full group breakdownThe draw for the 2026 FIFA Wor...",
    "link": "https://foot-africa.com/en/news/world-cup-2026-draw-africa-morocco-face-brazil-egypt-draw-belgium-full-group-breakdown-991268/",
    "timestamp": "2025-12-06T17:40:00Z"
  },
  {
    "title": "Trump administration alters national parks' free-entry days, cutting MLK Day and Juneteenth (Alexandra Marquez/NBC News)",
    "description": "Alexandra Marquez / NBC News:\nTrump administration alters national parks' free-entry days, cutting MLK Day and Juneteenth  —  The change is part of a broader shift in the National Park Service's free-entry day schedule, which includes adding President Donald …",
    "link": "https://www.memeorandum.com/251206/p34",
    "timestamp": "2025-12-06T17:40:00Z"
  },
  {
    "title": "Supreme Court giving 'capricious' Trump a pass they would never give a Democrat: NYT",
    "description": "The New York Times says the Supreme Court is giving their favorite president passes he doesn’t deserve.“The justices … seem friendlier to claims of executive power under [President Donald] Trump than they were under President Joe Biden. They blocked Mr. Biden…",
    "link": "https://www.rawstory.com/alternet-posts/trump-roberts-court/",
    "timestamp": "2025-12-06T17:37:49Z"
  },
  {
    "title": "Trump: Ronaldo thanked me for WH tour",
    "description": "United States President Donald Trump shared on Saturday that soccer player Cristiano Ronaldo called him and thanked him for the tour of the White House and the Oval Office.The football star, whom Trum...",
    "link": "https://biztoc.com/x/8acc751a265bf3e1",
    "timestamp": "2025-12-06T17:34:02Z"
  },
  {
    "title": "Economy Nucleus of Tribulation",
    "description": "One prophetic element stands out in considering the seven-year Tribulation era regarding the Antichrist regime. That is the economic platform prophesied to be at the heart of the Beast system. With so many signals in view that point to the brewing Tribulation…",
    "link": "https://freerepublic.com/focus/f-religion/4356216/posts",
    "timestamp": "2025-12-06T17:32:55Z"
  },
  {
    "title": "The Internet Schools Trump’s Treasury Department on Economics",
    "description": "Social media users are skewering the U.S. Treasury Department for bragging about something eminently non-bragworthy.On Friday, the Treasury Department’s official X account shared a chart reflecting that, in 2025, “U.S. Treasuries are having their best year si…",
    "link": "https://newrepublic.com/post/204067/trump-treasury-bessent-economy-bonds",
    "timestamp": "2025-12-06T17:27:26Z"
  },
  {
    "title": "MS NOW’s Jen Psaki Stunned By Trump’s ‘Bizarre Eye-Popping’ Rant After Getting ‘Made-Up’ Peace Prize",
    "description": "MS NOW host Jen Psaki was stunned by President Donald Trump's \"eye-popping\" comments after receiving a newly-invented “Peace Prize.”\nThe post MS NOW’s Jen Psaki Stunned By Trump’s ‘Bizarre Eye-Popping’ Rant After Getting ‘Made-Up’ Peace Prize first appeared o…",
    "link": "https://www.mediaite.com/media/sports/ms-nows-jen-psaki-stunned-by-trumps-bizarre-eye-popping-rant-after-getting-made-up-peace-prize/",
    "timestamp": "2025-12-06T17:25:15Z"
  },
  {
    "title": "FIFA World Cup 2026: Which teams will play at Gillette Stadium",
    "description": "The groups are set for the 2026 FIFA World Cup, and now its time to learn where and who will play.",
    "link": "https://sports.yahoo.com/articles/fifa-world-cup-2026-teams-172202403.html",
    "timestamp": "2025-12-06T17:23:32Z"
  },
  {
    "title": "Turkey warns blocking Trump’s Gaza plan would be ‘huge failure’ for US, world",
    "description": "Fidan said a credible Palestinian civil administration and a vetted, trained police force needed to be in place to allow Hamas to disarm. Not advancing the...",
    "link": "https://www.jpost.com/middle-east/article-879397",
    "timestamp": "2025-12-06T17:21:31Z"
  },
  {
    "title": "National Guardsman 'slowly healing' after being shot in Washington DC",
    "description": "Andrew Wolfe, 24, is expected to remain in acute care with a head wound for a few more weeks, his family says.",
    "link": "https://www.bbc.com/news/articles/c0q5lejppeno",
    "timestamp": "2025-12-06T17:20:51Z"
  },
  {
    "title": "Hey, Does Anyone Want to Talk About Donald Trump's Infirmities? (Jason Linkins/New Republic)",
    "description": "Jason Linkins / New Republic:\nHey, Does Anyone Want to Talk About Donald Trump's Infirmities?  —  In case you missed it, President Donald Trump fell asleep on television this week.  There he was, in the middle of a meeting with the members of his Cabinet, com…",
    "link": "https://www.memeorandum.com/251206/p30",
    "timestamp": "2025-12-06T17:20:01Z"
  },
  {
    "title": "Trump swayed over ‘round of golf’ to pardon indicted entertainment titan: report",
    "description": "President Donald Trump's decision to pardon\r\n entertainment titan Tim Leiweke this week may have been sparked by a recent “round of golf” with Leiweke’s attorney, who reportedly brought up his client’s case to the president between swings, The Wall Street Jou…",
    "link": "https://www.rawstory.com/trump-pardons-2674375507/",
    "timestamp": "2025-12-06T17:19:05Z"
  },
  {
    "title": "Donald Trump Delivers Christmas Tree Cost Savings For Millions",
    "description": "President Donald Trump’s administration has delivered a Christmas tree cost-saving measure for millions of Americans in a \"holiday affordability effort\" announced by the U.S. Department of the Interior (DOI).\nWhy It Matters\nAmericans up and down the country a…",
    "link": "https://biztoc.com/x/b0dfbb20e3053204",
    "timestamp": "2025-12-06T17:11:42Z"
  },
  {
    "title": "Ashwaubenon Cinnabon employee fired for racist comments caught on video",
    "description": "ASHWAUBENON, Wis. (WLUK) - A woman working at a Cinnabon stand in Bay Park Square has been fired after anonline video showed her calling customers a racial slu",
    "link": "https://fox11online.com/news/local/ashwaubenon-cinnabon-employee-fired-after-deeply-troubling-video-circulates-online",
    "timestamp": "2025-12-06T17:06:07Z"
  },
  {
    "title": "Elon Musk Calls for the European Union to Be 'Abolished' and a Return of National Sovereignty",
    "description": "Tesla chief Elon Musk has called for the abolition of the European Union as a political entity and a return of national sovereignty to the continent in the wake of Brussels announcing a $140 million fine against his X social media platform for supposedly viol…",
    "link": "https://www.breitbart.com/europe/2025/12/06/elon-musk-calls-for-the-european-union-to-be-abolished-return-of-national-sovereignty/",
    "timestamp": "2025-12-06T17:05:05Z"
  },
  {
    "title": "Trump Attacks CNN’s ‘Nasty’ Kaitlan Collins In Yet Another Social Media Rant",
    "description": "Trump's latest remarks about \"Caitlin Collin's of Fake News CNN\" add to his recent attacks against female journalists.",
    "link": "https://www.huffpost.com/entry/donald-trump-kaitlan-collins-stupid-truth-attack_n_6934556de4b0842b72049e5a",
    "timestamp": "2025-12-06T17:05:03Z"
  },
  {
    "title": "Trump touts 2026 World Cup draw success, claims massive viewership",
    "description": "President Donald Trump praised the 2026 World Cup draw in Washington, D.C., on Friday while speaking to Republican lawmakers and members of his Cabinet at a White House event.",
    "link": "https://www.foxnews.com/sports/trump-touts-2026-world-cup-draw-success-claims-massive-viewership",
    "timestamp": "2025-12-06T16:52:31Z"
  },
  {
    "title": "Boat Hit in 'Double-Tap' Strike Was Not Heading to U.S., Admiral Reportedly Tells Lawmakers",
    "description": "Bradley reportedly told lawmakers that the boat was headed towards Suriname, not the U.S., when 11 people were killed in a U.S. strike.",
    "link": "https://time.com/7339154/admiral-bradley-boat-strike-hegseth/",
    "timestamp": "2025-12-06T16:51:20Z"
  },
  {
    "title": "The Supreme Court weighs another step in favor of broad presidential power sought by Trump (Mark Sherman/Associated Press)",
    "description": "Mark Sherman / Associated Press:\nThe Supreme Court weighs another step in favor of broad presidential power sought by Trump  —  Chief Justice John Roberts has led the Supreme Court 's conservative majority on a steady march of increasing the power of the pres…",
    "link": "https://www.memeorandum.com/251206/p28",
    "timestamp": "2025-12-06T16:50:01Z"
  },
  {
    "title": "Trump finally meets Claudia Sheinbaum face to face at the FIFA World Cup draw",
    "description": "President Donald Trump has finally met with his Mexican counterpart, Claudia Sheinbaum.\nTheir long-delayed first face-to-face discussion focused on next year’s World Cup — and included side discussions about trade and tariffs — but immigration was not the top…",
    "link": "https://biztoc.com/x/562162f990ee04c2",
    "timestamp": "2025-12-06T16:49:12Z"
  },
  {
    "title": "Netflix Warner Bros. bid hits major regulatory roadblock",
    "description": "The streaming giant’s $72 billion bid to acquire Warner Bros. and HBO faces mounting skepticism from regulators, unions and political insiders who fear market dominance. When Netflix announced its stunning $72 billion proposal to acquire Warner Bros. and HBO,…",
    "link": "https://rollingout.com/2025/12/06/netflix-warner-bros-bid-hits-roadblock/",
    "timestamp": "2025-12-06T16:49:03Z"
  },
  {
    "title": "From Zohran to Acetaminophen: the top mispronounced words of 2025",
    "description": "The theft of France’s crown jewels from the Louvre in October had many people mispronouncing the name of the world’s most-visited museum",
    "link": "https://www.the-independent.com/life-style/babbel-mispronounced-words-acetaminophen-zohran-mamdani-b2879402.html",
    "timestamp": "2025-12-06T16:47:17Z"
  },
  {
    "title": "NBC's Reilly: 'Conspiracy Theories' Are Why Bomber Case Is The One J6 Case 'That Really Moved Forward' Under Trump Admin.",
    "description": "On Friday’s edition of NBC’s “Meet the Press Now,” NBC News Senior Justice Reporter Ryan Reilly said that “because of the conspiracy theories”, the pipe bomber case is “the one investigation” surrounding January 6 “that really moved forward during the\nThe pos…",
    "link": "https://www.breitbart.com/clips/2025/12/06/nbcs-reilly-conspiracy-theories-are-why-bomber-case-is-the-one-j6-case-that-really-moved-forward-under-trump-admin/",
    "timestamp": "2025-12-06T16:40:11Z"
  },
  {
    "title": "Gaza ceasefire negotiations at 'critical moment', says Qatar PM as seven more killed in Gaza",
    "description": "Negotiations on a lasting ceasefire deal for Gaza are at a \"critical moment\", the prime minister of Qatar, which has played a key role in brokering the deal, has said.",
    "link": "https://news.sky.com/story/gaza-ceasefire-negotiations-at-critical-moment-says-qatar-pm-13480180",
    "timestamp": "2025-12-06T16:38:00Z"
  },
  {
    "title": "EXCLUSIVE: Can California’s Unusual Voting System Actually Allow It To Elect A Republican Governor?",
    "description": "Heavily Democratic California could elect a Republican governor for the first time in two decades due to its primary voting system, recent polling suggests.",
    "link": "https://dailycaller.com/2025/12/06/california-governor-republican-chad-bianco-steve-hilton-top-two-primary-gavin-newsom/",
    "timestamp": "2025-12-06T16:36:17Z"
  },
  {
    "title": "‘You have an entire culture, an entire community that is also having that same crisis’: Colorado coal town looks anxiously to the future",
    "description": "Colorado’s six coal-fired power plants are scheduled to close or convert to natural gas, which emits about half the carbon dioxide as coal, by 2031.",
    "link": "https://fortune.com/2025/12/06/colorado-coal-country-identity-crisis-whats-next/",
    "timestamp": "2025-12-06T16:35:01Z"
  },
  {
    "title": "Herzog on Netanyahu's pardon request: 'Extraordinary'",
    "description": "In Politico interview, Israeli President Isaac Herzog speaks about Prime Minister Benjamin Netanyahu's pardon request, and his opinion of US President Donald Trump.",
    "link": "https://www.israelnationalnews.com/news/418891",
    "timestamp": "2025-12-06T16:33:00Z"
  },
  {
    "title": "Elon Musk’s X fined $140 million by EU for breaching digital regulations",
    "description": "The European Commission issued its decision following an investigation it opened two years ago under the Digital Services Act.",
    "link": "https://fortune.com/2025/12/06/elon-musk-x-fined-140-million-by-eu-for-breaching-digital-regulations/",
    "timestamp": "2025-12-06T16:30:19Z"
  },
  {
    "title": "Inside ‘Little Mogadishu’: Minnesota’s beleaguered Somali community under a cloud of fraud and Trump attacks",
    "description": "Cedar-Riverside in Minneapolis, nicknamed 'Little Mogadishu,' reflects the cultural transformation brought by Minnesota's Somali population.",
    "link": "https://www.foxnews.com/us/inside-little-mogadishu-minnesotas-somali-community-its-push-belonging",
    "timestamp": "2025-12-06T16:30:19Z"
  },
  {
    "title": "'Pajamas While Flying' Is Now An Anti-Trump Protest",
    "description": "Thanks to Sean Duffy, the airport is turning into something of a slumber party.\nAfter the transportation secretary told people to “dress up” at the airport as a way to make air travel better for everyone, the internet had their thoughts. And it can be summed …",
    "link": "https://crooksandliars.com/2025/12/pajamas-while-flying-now-anti-trump",
    "timestamp": "2025-12-06T16:29:25Z"
  },
  {
    "title": "Security expert blasts Trump's 'cabinet of dunces' for posting on Twitter 'like you're 12'",
    "description": "National Security attorney Bradley Moss and international affairs specialist Tom Nichols took turns dumping on what they characterized as the mounting idiocy of officials working under President Donald Trump as the administration closes out its first year in …",
    "link": "https://www.rawstory.com/alternet-posts/trump-cabinet-idiots/",
    "timestamp": "2025-12-06T16:28:24Z"
  },
  {
    "title": "U.S. Steel brings back Illinois plant after two year pause",
    "description": "The Pittsburgh steelmaker plans to reopen a blast furnace at Granite City Works, signaling renewed confidence in domestic steel demand and job growth. A shuttered steel plant in southern Illinois is roaring back to life. U.S. Steel announced plans Thursday to…",
    "link": "https://rollingout.com/2025/12/06/us-steel-reopens-illinois-blast-furnace/",
    "timestamp": "2025-12-06T16:27:13Z"
  },
  {
    "title": "Music, comedy and a whole lot of Trump. And then finally, an actual World Cup draw",
    "description": "",
    "link": "https://biztoc.com/x/264ecc337991ed0a",
    "timestamp": "2025-12-06T16:26:49Z"
  },
  {
    "title": "Trump explains why WH ballroom exceeds budget",
    "description": "United States President Donald Trump said on Saturday that the new White House ballroom will be \"much bigger and more beautiful than originally planned,\" raising the building cost.In a post on his Tru...",
    "link": "https://biztoc.com/x/b9b1ad729408b22e",
    "timestamp": "2025-12-06T16:26:44Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow Over Guantánamo Bay Move",
    "description": "A federal judge on Friday ruled that the Trump administration had overstepped legal limits in its effort to hold and move migrants designated for deportation at the U.S. naval base at Guantánamo Bay, Cuba.\nWhy It Matters\nThe ruling delivers a significant lega…",
    "link": "https://biztoc.com/x/2078b1bc493eec13",
    "timestamp": "2025-12-06T16:26:43Z"
  },
  {
    "title": "Trump administration alters national parks' free-entry days, cutting MLK Day and Juneteenth",
    "description": "The Trump administration has changed which days Americans can visit national parks for free next year, removing Martin Luther King Jr.",
    "link": "https://www.nbcnews.com/politics/trump-administration/national-parks-trump-birthday-free-days-juneteenth-mlk-interior-rcna247734",
    "timestamp": "2025-12-06T16:26:20Z"
  },
  {
    "title": "Epstein grand jury documents from Florida can be released by DOJ, judge rules",
    "description": "The judge said a recently passed federal law ordering the release of records related to Epstein overrode the usual rules about grand jury secrecy.",
    "link": "https://fortune.com/2025/12/06/epstein-grand-jury-investigation-florida-can-be-released/",
    "timestamp": "2025-12-06T16:21:50Z"
  },
  {
    "title": "Trump's Racist Attack On Ilhan Omar Revives A Debunked Conspiracy",
    "description": "Donald Trump went on a racist tirade against Minnesota Democratic Representative Ilhan Omar, and then claimed she married her brother, which is a long-debunked conspiracy.\nSomeone needs his nap time and his binky. \nJD Vance's racism about migrants eating dogs…",
    "link": "https://crooksandliars.com/2025/12/racist-trump-attacks-rep-omar-reviving",
    "timestamp": "2025-12-06T16:10:52Z"
  },
  {
    "title": "Trump’s FIFA ‘Peace Prize’ Ceremony Is the New Touching the Orb Meme",
    "description": "Will we even remember this absurdity in a few days?",
    "link": "https://gizmodo.com/trumps-fifa-peace-prize-ceremony-is-the-new-touching-the-orb-meme-2000696409",
    "timestamp": "2025-12-06T16:10:06Z"
  },
  {
    "title": "Trump replaces MLK Day with his own birthday",
    "description": "Definitely not a cult though: In 2026, Americans will get free admission to national parks on President Donald Trump‘s birthday but no longer on Juneteenth and Martin Luther King Jr. Day, according to the National Park Service website. Previously, the Nationa…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/trump-replaces-mlk-day-with-his-own-birthday",
    "timestamp": "2025-12-06T16:09:34Z"
  },
  {
    "title": "Trump's 'childlike grifter' inner circle is putting the US at risk: military expert",
    "description": "The security of the US grows weaker by the day as some of the highest-profile members of Donald Trump’s cabinet are spending too much time playing to the MAGA crowd for “clicks’ and adulation, and not taking their jobs seriously.Appearing on MS NOW with host …",
    "link": "https://www.rawstory.com/trump-grifters/",
    "timestamp": "2025-12-06T16:08:51Z"
  },
  {
    "title": "Trump Gets Most Brutal Insult From Fox News Guest: ‘Will Get More Unaffordable Under Trump’ Than Biden",
    "description": "Peter Schiff hit Trump with one of the worst insults imaginable, in MAGA terms: that Trump's policies will make life \"more unaffordable\" than under Biden.\nThe post Trump Gets Most Brutal Insult From Fox News Guest: ‘Will Get More Unaffordable Under Trump’ Tha…",
    "link": "https://www.mediaite.com/media/news/trump-gets-most-brutal-insult-from-fox-news-guest-will-get-more-unaffordable-under-trump-than-biden/",
    "timestamp": "2025-12-06T16:08:51Z"
  },
  {
    "title": "Trump says WH ballroom 'under budget and ahead of schedule'",
    "description": "Trump replaced the original lead architect for the ballroom after the two reportedly disagreed over the structure's large size.",
    "link": "https://www.washingtonexaminer.com/news/white-house/3909479/trump-ballroom-construction-under-budget-and-ahead-of-schedule/",
    "timestamp": "2025-12-06T16:07:28Z"
  },
  {
    "title": "Cheryl Hines Embraces MAGA Wifedom",
    "description": "Looking cheerful for the cameras ... while Olivia Nuzzi’s book drops is ... really something. ",
    "link": "https://littlethings.com/entertainment/cheryl-hines-maga-wife",
    "timestamp": "2025-12-06T16:05:41Z"
  },
  {
    "title": "Tyrant Judge Orders Trump To Restore Funding For Libraries, Museums. Americans Hate Those!",
    "description": "Maybe to get the money they'll all have to be renamed after Trump.",
    "link": "https://www.wonkette.com/p/tyrant-judge-orders-trump-to-restore",
    "timestamp": "2025-12-06T16:02:16Z"
  },
  {
    "title": "The wife of the Chiefs' owner praises Trump",
    "description": "The FIFA event for the draw ahead of the World Cup to be held in Mexico, Canada, and the United States next summer in 2026, held at the Kennedy Center, received a visit from the th",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/12/06/69345307ca4741c0288b4588.html",
    "timestamp": "2025-12-06T16:00:24Z"
  },
  {
    "title": "Stakes High for House Republicans With Midterms Approaching",
    "description": "Republicans have come to a critical juncture, with less than a year to go before their control of Congress is at stake, but they say... Read More\nThe post Stakes High for House Republicans With Midterms Approaching appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/12/06/stakes-high-for-house-republicans-with-midterms-approaching/",
    "timestamp": "2025-12-06T16:00:00Z"
  },
  {
    "title": "A Complete History of the R-Word, the MAGA Movement’s Favorite Slur",
    "description": "Donald Trump recently used the pejorative to attack Minnesota Gov. Tim Walz, adding to a chorus of right-wing influencers wielding it against opponents",
    "link": "http://www.rollingstone.com/culture/culture-features/r-word-maga-slur-history-1235476412/",
    "timestamp": "2025-12-06T16:00:00Z"
  },
  {
    "title": "The Alleged Drug Boat Wasn’t Even Heading to the U.S.: Report",
    "description": "A new, disturbing detail in the “drug boat” controversy that has enveloped Defense Secretary Pete Hegseth over the past week calls the purpose of the entire operation into question.According to an exclusive report from CNN, the alleged narco-trafficking boat …",
    "link": "https://newrepublic.com/post/204065/alleged-drug-boat-hegseth-trump",
    "timestamp": "2025-12-06T15:57:42Z"
  },
  {
    "title": "National Parks Service overhauls free admission days to include Trump's birthday",
    "description": "Admission fees have been waived on Martin Luther King Jr. Day for years, including throughout Trump's first administration. Juneteenth was added as an entrance fee-free day in 2024.",
    "link": "https://www.wmur.com/article/national-parks-free-admission-days-trump-birthday/69651188",
    "timestamp": "2025-12-06T15:56:12Z"
  },
  {
    "title": "National Parks Service overhauls free admission days to include Trump's birthday",
    "description": "Admission fees have been waived on Martin Luther King Jr. Day for years, including throughout Trump's first administration. Juneteenth was added as an entrance fee-free day in 2024.",
    "link": "https://www.wgal.com/article/national-parks-free-admission-days-trump-birthday/69651188",
    "timestamp": "2025-12-06T15:55:52Z"
  },
  {
    "title": "Confused by the Trump administration? Think of it as a royal family. (Joshua Keating/Vox)",
    "description": "Joshua Keating / Vox:\nConfused by the Trump administration?  Think of it as a royal family.  —  America's new “neoroyalist” foreign policy. … It was not a particularly subtle gift, but as the recipient himself would probably admit, he's never been a particula…",
    "link": "https://www.memeorandum.com/251206/p23",
    "timestamp": "2025-12-06T15:50:00Z"
  },
  {
    "title": "EU Struggles to Avoid Rift With the US",
    "description": "The European Union is in crisis over US attempts to broker a Ukraine peace deal and a rift within NATO, Bloomberg reports.",
    "link": "https://sputnikglobe.com/20251206/eu-struggles-to-avoid-rift-with-the-us-1123246382.html",
    "timestamp": "2025-12-06T15:50:00Z"
  },
  {
    "title": "FDA in turmoil after exit of veteran cancer researcher (CNN)",
    "description": "CNN:\nFDA in turmoil after exit of veteran cancer researcher  —  Federal agencies Vaccines Donald Trump Prescription drugs  —  Food and Drug Administration Commissioner Marty Makary is under renewed scrutiny by Trump officials amid continued turmoil at the age…",
    "link": "https://www.memeorandum.com/251206/p22",
    "timestamp": "2025-12-06T15:45:01Z"
  },
  {
    "title": "National Parks Service overhauls free admission days to include Trump's birthday",
    "description": "Admission fees have been waived on Martin Luther King Jr. Day for years, including throughout Trump's first administration. Juneteenth was added as an entrance fee-free day in 2024.",
    "link": "https://www.wcvb.com/article/national-parks-free-admission-days-trump-birthday/69651188",
    "timestamp": "2025-12-06T15:44:44Z"
  },
  {
    "title": "CNN Host Claps Back At Trump ‘Cult’ Accusation From Viewer After He Defended Trump",
    "description": "CNN's Michael Smerconish responded to a viewer on Saturday who accused him of being part of President Donald Trump's \"cult.\"\nThe post CNN Host Claps Back At Trump ‘Cult’ Accusation From Viewer After He Defended Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-host-claps-back-at-trump-cult-accusation-from-viewer-after-he-defended-trump/",
    "timestamp": "2025-12-06T15:38:38Z"
  },
  {
    "title": "Why Qatar lives rent-free in the far right’s head",
    "description": "Conservative influencers are playing a central role in a new campaign of weaponising Islamophobia.",
    "link": "https://www.aljazeera.com/opinions/2025/12/6/why-qatar-lives-rent-free-in-the-far-rights-head",
    "timestamp": "2025-12-06T15:36:43Z"
  }
]