[
  {
    "title": "Houthi rebels claim attacks on US aircraft carrier group after air strikes on Yemen",
    "description": "The group’s health ministry said women and children were among the 53 people killed and 98 wounded in US strikes on Saturday.",
    "link": "https://www.thejournal.ie/houthi-rebels-attacks-us-aircraft-carrier-group-strikes-yemen-6651950-Mar2025/",
    "timestamp": "2025-03-17T08:24:11Z"
  },
  {
    "title": "UK and global economic growth forecasts slashed - as Trump tariffs blamed",
    "description": "Global economic growth has been downgraded by the Organisation for Economic Co-operation and Development (OECD) - as the impact of US President Donald Trump's tariffs becomes apparent.",
    "link": "https://news.sky.com/story/tariffs-to-blame-for-slowed-global-economic-growth-oecd-says-13330768",
    "timestamp": "2025-03-17T08:23:00Z"
  },
  {
    "title": "Trump begins mass layoffs at Voice of America",
    "description": "President Donald Trump’s administration on Sunday began mass layoffs at Voice of America and other US-funded media, making clear its intent to gut outlets long seen as critical for US influence. Just a day after all employees were put on leave, staff working …",
    "link": "https://punchng.com/trump-begins-mass-layoffs-at-voice-of-america/",
    "timestamp": "2025-03-17T08:20:10Z"
  },
  {
    "title": "$BTC May Plunge Further As Poll Reveals Most Americans Oppose Trump's Bitcoin Reserve",
    "description": "Polymarket bettors are expecting Bitcoin to plunge further to $75,000 by month-end amid successive poor developments around the world's largest cryptocurrency by market value.",
    "link": "https://www.ibtimes.com/btc-may-plunge-further-poll-reveals-most-americans-oppose-trump-bitcoin-reserve-3766552",
    "timestamp": "2025-03-17T08:15:21Z"
  },
  {
    "title": "US to exit EU-led investigation on Russia – NYT",
    "description": "Washington is scaling back its involvement in efforts to investigate and prosecute Russia over the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614333-us-withdrawal-investigations-russia/",
    "timestamp": "2025-03-17T08:14:00Z"
  },
  {
    "title": "Accused Texas megachurch pastor to surrender in Oklahoma on child sexual abuse charges",
    "description": "A former pastor of a Texas megachurch is expected to turn himself into Oklahoma authorities Monday on child sexual abuse charges.",
    "link": "https://www.nbcnews.com/news/us-news/accused-texas-megachurch-pastor-surrender-oklahoma-child-sexual-abuse-rcna196664",
    "timestamp": "2025-03-17T08:08:29Z"
  },
  {
    "title": "Trump Tariffs Could Slow US Housing Market in 2025",
    "description": "Donald Trump's recently unveiled tariff plans have sparked a stock market meltdown and stoked fears of a looming recession, which experts said would further slow down an already \"comatose\" U.S. housing market.\nOn Monday, the S&P 500 share index fell nearly 3 …",
    "link": "https://biztoc.com/x/ad1149b2e3f0b8ec",
    "timestamp": "2025-03-17T08:03:44Z"
  },
  {
    "title": "Houthis Claim Attacks on U.S. Aircraft Carrier: What We Know",
    "description": "The Houthis, an Iranian-backed Yemeni armed group, claimed to have carried out attacks on the U.S. aircraft carrier USS Harry S. Truman in the Red Sea with ballistic missiles and drones after President Donald Trump launched airstrikes against them.\nThe U.S. m…",
    "link": "https://biztoc.com/x/3713502cf3543bbe",
    "timestamp": "2025-03-17T08:03:28Z"
  },
  {
    "title": "Tulsi Gabbard Was Asked What Does Holi Mean To Her. Her Response",
    "description": "Holi, also known as the festival of colours, was celebrated two days before Tulsi Gabbard, who follows Hindu tradition, arrived in India.",
    "link": "https://www.ndtv.com/world-news/tulsi-gabbard-to-ndtv-on-missing-holi-celebrations-in-india-unfortunate-7941870",
    "timestamp": "2025-03-17T08:01:53Z"
  },
  {
    "title": "Houthis Claim Attacks on U.S. Aircraft Carrier: What We Know",
    "description": "The United States said military operations against the Iranian-backed group would continue after President Donald Trump ordered attacks at the weekend.",
    "link": "https://www.newsweek.com/houthis-trump-truman-iran-israel-aircraft-carrier-2045718",
    "timestamp": "2025-03-17T08:01:12Z"
  },
  {
    "title": "Retirement and investing under Trump 2.0: Financial advisors say 'don't panic'",
    "description": "Recession fears have some worried, but financial advisors and economists said older Americans shouldn't make major changes to retirement accounts.",
    "link": "https://www.businessinsider.com/recession-fears-tariffs-how-invest-save-retirement-plan-trump-2025-3",
    "timestamp": "2025-03-17T08:01:01Z"
  },
  {
    "title": "Sanctuary city lawyers plot to help illegal migrants evade ICE in exposed group email",
    "description": "Leaked emails to and from certain Minneapolis-area lawyers show efforts to actively thwart efforts from ICE to apprehend illegal immigrant defendants in the sanctuary city.",
    "link": "https://www.foxnews.com/us/sanctuary-city-lawyers-plot-help-illegal-migrants-evade-ice-exposed-group-email",
    "timestamp": "2025-03-17T08:00:52Z"
  },
  {
    "title": "Undocumented Irish not forgotten as Harris says immigration is 'sensitive' topic in US right now",
    "description": "Tánaiste says government will continue to engage with the US about finding a path forward.",
    "link": "https://www.thejournal.ie/undocumented-irish-simon-harris-6651919-Mar2025/",
    "timestamp": "2025-03-17T08:00:52Z"
  },
  {
    "title": "CSIS director to attend intelligence chiefs conclave in India amid signs of possible diplomatic thaw",
    "description": "There are signs the Indian government is ready to reset the diplomatic relationship as Canada searches for new trade partners amid a trade war with the U.S.",
    "link": "https://nationalpost.com/news/politics/csis-director-to-attend-intelligence-chiefs-conclave-in-india-amid-signs-of-possible-diplomatic-thaw",
    "timestamp": "2025-03-17T08:00:30Z"
  },
  {
    "title": "Apple AirPods Production to Begin in India at Foxconn Plant in April for Export: Report",
    "description": "Apple supplier Foxconn will reportedly start manufacturing AirPods at its Hyderabad facility soon. The production of wireless earphones is said to be limited to exports. This move is likely to be part of Apple's plans to diversify its manufacturing network be…",
    "link": "https://www.gadgets360.com/wearables/news/apple-airpods-production-foxconn-hyderabad-april-report-7941473",
    "timestamp": "2025-03-17T08:00:30Z"
  },
  {
    "title": "Trump Tariffs Could Slow US Housing Market in 2025",
    "description": "A recession could slow down an already \"comatose\" US housing market, experts said, eroding prospective buyers' confidence.",
    "link": "https://www.newsweek.com/trump-tariffs-could-slow-us-housing-market-2025-2044063",
    "timestamp": "2025-03-17T08:00:01Z"
  },
  {
    "title": "Northwestern Ontario's Ring of Fire central in U.S.-Canada trade war: experts",
    "description": "The Ring of Fire in northwestern Ontario has become a key figure in the battle to control critical minerals, which experts say is the heart of U.S. President Donald Trump's threats to annex Canada. Here's what they shared about how the region's resources come…",
    "link": "https://www.cbc.ca/news/canada/thunder-bay/ring-of-fire-trade-war-1.7484284",
    "timestamp": "2025-03-17T08:00:00Z"
  },
  {
    "title": "WTO: Standing Tall as the Winds Howl",
    "description": "Winds are also changing in trade policy. As they get rougher and more unpredictable, the much-criticised multilateral trade regime of the World Trade Organization (WTO) has so far proved surprisingly resilient. Paradoxically, Donald Trump’s tariff policy coul…",
    "link": "https://www.ipsnews.net/2025/03/wto-standing-tall-winds-howl/",
    "timestamp": "2025-03-17T07:57:13Z"
  },
  {
    "title": "Modi praises Trump while tariff time bomb ticks toward April 2 deadline",
    "description": "As Trump's tariff war nears the April 2 deadline, China and India adopt different strategies. While China boosts domestic consumption, India diversifies its exports and explores digital trade. Modi and Trump continue to negotiate, aiming for a phased trade de…",
    "link": "https://economictimes.indiatimes.com/news/india/modi-praises-trump-while-tariff-time-bomb-ticks-toward-april-2-deadline/articleshow/119107289.cms",
    "timestamp": "2025-03-17T07:57:12Z"
  },
  {
    "title": "Trump says he will speak with Putin on Tuesday about ending the war in Ukraine",
    "description": "Trump sees a \"good chance\" to end the Ukraine war as he plans Tuesday talks with Putin on a ceasefire, while Ukraine backs a 30-day truce and Russia demands neutrality.",
    "link": "https://www.euractiv.com/section/politics/news/trump-says-he-will-speak-with-putin-on-tuesday-about-ending-the-war-in-ukraine/",
    "timestamp": "2025-03-17T07:54:56Z"
  },
  {
    "title": "The Trump effect hits oil. Uncertainty is weighing on prices.",
    "description": "Talk of $50 oil has analysts concerned.",
    "link": "https://www.livemint.com/industry/energy/the-trump-effect-hits-oil-uncertainty-is-weighing-on-prices-11742197713299.html",
    "timestamp": "2025-03-17T07:54:01Z"
  },
  {
    "title": "Yemen’s Houthis and US launch new attacks amid Red Sea shipping threat",
    "description": "US insists it will target Houthis until Yemeni group withdraws threat to Red Sea shipping.",
    "link": "https://www.aljazeera.com/news/2025/3/17/houthis-claim-retaliatory-attack-on-us-ships",
    "timestamp": "2025-03-17T07:53:29Z"
  },
  {
    "title": "What’s happening in Yemen? A breakdown of the Houthi-US violence",
    "description": "The US killed at least 53 people, according to reports. Houthis have responded with attacks on US warships.",
    "link": "https://www.aljazeera.com/news/2025/3/17/houthis-us-in-new-spiral-of-violence-everything-to-know",
    "timestamp": "2025-03-17T07:52:10Z"
  },
  {
    "title": "Houthi-US violence explained",
    "description": "The US killed at least 53 people, according to reports. Houthis have responded with attacks on US warships.",
    "link": "https://www.aljazeera.com/features/2025/3/17/houthis-us-in-new-spiral-of-violence-everything-to-know",
    "timestamp": "2025-03-17T07:52:10Z"
  },
  {
    "title": "Ukraine: Trump says he will discuss ceasefire with Putin",
    "description": "US President Donald Trump said he plans to speak to Russian President Vladimir Putin on Tuesday and discuss ending the war in Ukraine. Meanwhile, EU member states are meeting to talk aid to Ukraine. DW has the latest.",
    "link": "https://www.dw.com/en/ukraine-trump-says-he-will-discuss-ceasefire-with-putin/live-71939138",
    "timestamp": "2025-03-17T07:52:00Z"
  },
  {
    "title": "Trump wins golf championship a day after ordering strikes on Iran-backed Houthis in Yemen",
    "description": "It was a big day on the green for President Donald Trump. Trump announced in a Truth Social post on Sunday that he won a golf tournament at his club in Palm Beach County, Florida – noting that it would likely be his \"last.\" \"I just won the Golf Club Champions…",
    "link": "https://freerepublic.com/focus/f-chat/4304760/posts",
    "timestamp": "2025-03-17T07:51:10Z"
  },
  {
    "title": "Ola Electric, Mobikwik shares fall sharply amid stock market’s bear run",
    "description": "Shares of One MobiKwik Systems, the parent company of digital payments provider MobiKwik, sank as much as 15% in early trade on Monday, hitting a fresh 52-week low of Rs 231.05. Ola Electric Mobility fell 6.69% to a record low of Rs 46.94 on the BSE on Monday.",
    "link": "https://economictimes.indiatimes.com/tech/startups/amid-stock-markets-bear-run-new-age-stocks-mobikwik-ola-electric-fall-sharply/articleshow/119107731.cms",
    "timestamp": "2025-03-17T07:50:40Z"
  },
  {
    "title": "\"Both Leaders Are...\": Tulsi Gabbard On PM Modi-Trump Friendship, Focus",
    "description": "Prime Minister Narendra Modi and President Donald Trump are &quot;very good friends (and are) focused on shared objectives&quot;, which include a firm commitment to defeat Islamic terror, the United States&#039; Director of National Intelligence told NDTV Mon…",
    "link": "https://www.ndtv.com/world-news/trump-and-pm-modi-focused-on-shared-objectives-tulsi-gabbard-to-ndtv-7941747",
    "timestamp": "2025-03-17T07:49:18Z"
  },
  {
    "title": "US President Donald Trump shares PM Modi's podcast on 'Truth Social'",
    "description": "During the interview, PM Modi appreciated US President Donald Trump's unshakeable dedication to his country, particularly in the wake of the assassination attempts last year",
    "link": "https://www.thehindubusinessline.com/news/national/us-president-donald-trump-shares-pm-modis-podcast-on-truth-social/article69339428.ece",
    "timestamp": "2025-03-17T07:47:42Z"
  },
  {
    "title": "The fine print and political favors of the reshuffle, the tie and Voridis’ epic remark, the Vivino minister & the Ides of March of Doxiadis",
    "description": "Why Trump is courting Greek shipowners & the \"icebreaker\"\nThe post The fine print and political favors of the reshuffle, the tie and Voridis’ epic remark, the Vivino minister & the Ides of March of Doxiadis appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/03/17/the-fine-print-and-political-favors-of-the-reshuffle-the-tie-and-voridis-epic-remark-the-vivino-minister-the-ides-of-march-of-doxiadis/",
    "timestamp": "2025-03-17T07:45:19Z"
  },
  {
    "title": "Threatened by US, Canada hugs France and Britain close",
    "description": "<p>MONTREAL - With Canada's economy and even sovereignty under unprecedented threat from its southern neighbour the United States, its new leader has embarked on a trans-Atlantic trip to strengthen ties with traditional friends France and Britain.</p>",
    "link": "https://www.bangkokpost.com/world/2981735/threatened-by-us-canada-hugs-france-and-britain-close",
    "timestamp": "2025-03-17T07:45:00Z"
  },
  {
    "title": "Donald Trump Sends Warning To Enemies As He Says Biden Pardons Void",
    "description": "Donald Trump has said that Joe Biden's pardons of members of Congress who investigated the January 6 insurrection are \"void, vacant and of no further effect.\"",
    "link": "https://biztoc.com/x/2305c48f201c9fa8",
    "timestamp": "2025-03-17T07:41:27Z"
  },
  {
    "title": "Iran says Trump letter mirrors his statements",
    "description": "Iran said on Monday that a letter it received from U.S. President Donald Trump, who has called for striking a nuclear deal with the Islamic republic, echoed his public statements.",
    "link": "https://www.hurriyetdailynews.com/iran-says-trump-letter-mirrors-his-statements-206981",
    "timestamp": "2025-03-17T07:41:00Z"
  },
  {
    "title": "Iran will respond to Trump letter after 'full scrutiny,' ministry spokesperson says",
    "description": "The Iranian spokesperson noted contradictory signals from Washington, which was voicing readiness for talks while also applying new sanctions on Tehran's economy.",
    "link": "https://www.jpost.com/breaking-news/article-846371",
    "timestamp": "2025-03-17T07:37:51Z"
  },
  {
    "title": "Ishiba cabinet approval hits record low: poll",
    "description": "Public support for Japanese Prime Minister Shigeru Ishiba's government dropped to a record low after he handed out gift vouchers to some ruling party lawmakers, a poll conducted by the Asahi newspaper showed on Monday. The approval rating slid 14 percentage p…",
    "link": "https://japantoday.com/category/politics/japan-pm-ishiba%27s-cabinet-approval-hits-record-low-asahi-reports",
    "timestamp": "2025-03-17T07:37:38Z"
  },
  {
    "title": "Trump says he and Putin will discuss 'land and power plants' in Ukraine talks tomorrow",
    "description": "The US President said they are “already talking” about “dividing up certain assets”.",
    "link": "https://www.thejournal.ie/trump-putin-ukraine-talks-land-power-plants-6651940-Mar2025/",
    "timestamp": "2025-03-17T07:37:07Z"
  },
  {
    "title": "What Stockbroker Who Inspired Wolf Of Wall Street Said About Trump Tariffs",
    "description": "Jordan Belfort, the infamous stockbroker known as the &#039;Wolf of Wall Street&#039;, has thrown his weight behind US President Donald Trump&#039;s latest tariff hikes, dismissing criticism as &quot;complete and utter nonsense.&quot;",
    "link": "https://www.ndtv.com/world-news/what-stockbroker-jordan-belfort-who-inspired-wolf-of-wall-street-movie-said-about-doanld-trump-tariffs-7941305",
    "timestamp": "2025-03-17T07:36:22Z"
  },
  {
    "title": "DOGE chain of command revealed in court filing, showing Musk is not the boss",
    "description": "The acting administrator of DOGE detailed that Elon Musk is not an employee of the United States DOGE Service and does not report to the acting DOGE chief, a court filing shedding additional light on the internal workings of the office shows. \"Elon Musk does …",
    "link": "https://freerepublic.com/focus/f-news/4304759/posts",
    "timestamp": "2025-03-17T07:34:47Z"
  },
  {
    "title": "Military chiefs to thrash out Ukraine peacekeeping proposal amid Russia war",
    "description": "A senior military source tells Al Jazeera a multinational force needs a 'maximalist approach' to deter Russia.",
    "link": "https://www.aljazeera.com/news/2025/3/17/military-chiefs-to-thrash-out-ukraine-peacekeeping-proposal-amid-russia-war",
    "timestamp": "2025-03-17T07:33:51Z"
  },
  {
    "title": "Donald Trump Sends Warning To Enemies As He Says Biden Pardons Void",
    "description": "Donald Trump has said that Joe Biden's pardons of members of Congress who investigated the January 6 insurrection are \"void, vacant and of no further effect.\"",
    "link": "https://www.newsweek.com/donald-trump-joe-biden-jan-6-pardons-void-vacant-2045724",
    "timestamp": "2025-03-17T07:31:32Z"
  },
  {
    "title": "First immigrants from America arrive in 'world's worst prison' after Trump 'defies judge's ruling'",
    "description": "The immigrants have been accused of being part of a notorious Venezuelan gang",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-defies-judge-ruling-criminals-el-salvador-854982-20250317",
    "timestamp": "2025-03-17T07:30:58Z"
  },
  {
    "title": "CNBC Daily Open: U.S. consumers are feeling bad and expect inflation to spike",
    "description": "The U.S. consumer hasn’t felt so glum about the economy since November 2022, according to a survey by the University of Michigan.",
    "link": "https://www.cnbc.com/2025/03/17/cnbc-daily-open-us-consumers-expect-inflation-to-jump-in-year-ahead.html",
    "timestamp": "2025-03-17T07:30:01Z"
  },
  {
    "title": "Iran to respond to Trump letter after scrutiny",
    "description": "DUBAI (Reuters) -Iran will respond to U.S. President Donald Trump's invitation to talks after proper scrutiny, the foreign ministry said on Monday, accusing ...",
    "link": "https://www.yahoo.com/news/iran-respond-trump-letter-scrutiny-072957551.html",
    "timestamp": "2025-03-17T07:29:57Z"
  },
  {
    "title": "Trump says some Biden presidential pardons 'void, vacant,' claims they were done by autopen",
    "description": "Trump also accused the previous president of not approving or even knowing about pardons he made.",
    "link": "https://www.jpost.com/american-politics/article-846365",
    "timestamp": "2025-03-17T07:29:55Z"
  },
  {
    "title": "Understanding the flux in crypto prices now - A market overview (Konstantin Rabin)",
    "description": "The cryptocurrency market continues to fascinate investors, analysts, and observers with its dynamic...",
    "link": "https://www.finextra.com/blogposting/28063/understanding-the-flux-in-crypto-prices-now---a-market-overview",
    "timestamp": "2025-03-17T07:29:17Z"
  },
  {
    "title": "Trump orders release of records on JFK, RFK, and Martin Luther King Jr. as FBI uncovers new files",
    "description": "President Donald Trump directed national security agencies to release all government records related to the assassinations of JFK, RFK, and Martin Luther King Jr. The FBI uncovered thousands of previously undisclosed documents linked to JFK’s assassination, i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-orders-release-of-records-on-jfk-rfk-and-martin-luther-king-jr-as-fbi-uncovers-new-files/articleshow/119106614.cms",
    "timestamp": "2025-03-17T07:28:58Z"
  },
  {
    "title": "Gridiron Dinner Appears To Rebuke Donald Trump With Break From 140-Year-Old Tradition",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9c36a9e7-724b-4980-a8bd-cc4ad865a2b7",
    "timestamp": "2025-03-17T07:28:17Z"
  },
  {
    "title": "Gridiron Dinner Appears To Rebuke Trump With Break From 140-Year-Old Tradition",
    "description": "It was a pointed shift.",
    "link": "https://www.huffpost.com/entry/gridiron-dinner-donald-trump-move_n_67d7c5dce4b041fe9a9c977f",
    "timestamp": "2025-03-17T07:28:17Z"
  },
  {
    "title": "U.S. Treasury Secretary Bessent Calls Corrections Normal, Suggesting a Higher Pain Threshold for the 'Trump Put'",
    "description": "Bessent's take suggests that the \"Trump put\" may take longer to manifest or require more significant market declines before any action is taken.",
    "link": "https://www.coindesk.com/markets/2025/03/17/u-s-treasury-secretary-scott-bessent-calls-corrections-normal-suggesting-a-higher-pain-threshold-for-the-trump-put",
    "timestamp": "2025-03-17T07:27:13Z"
  },
  {
    "title": "What is an autopen that former US president Joe Biden allegedly used to sign pardon documents? Here's how it works",
    "description": "Former President Donald Trump declared Joe Biden's pardons invalid, claiming they were signed using an autopen and not personally by Biden. This decision may prompt legal challenges. Autopens are machines that replicate handwritten signatures and are often us…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-is-an-autopen-that-former-us-president-joe-biden-allegedly-used-to-sign-pardon-documents-heres-how-it-works/articleshow/119101585.cms",
    "timestamp": "2025-03-17T07:27:01Z"
  },
  {
    "title": "China's economy improved at the start of 2025, but challenges remain",
    "description": "China's economy showed signs of improvement early this year, despite a weak housing market. Retail sales rose 4% and industrial production increased by 5.9% in the first two months. However, a complicated external environment and a real estate crisis continue…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-economy-improved-at-the-start-of-2025-but-challenges-remain/articleshow/119106690.cms",
    "timestamp": "2025-03-17T07:20:16Z"
  },
  {
    "title": "Pete Evans: Disgraced Australian celebrity chef claims to have met Donald Trump & Robert F. Kennedy Jr",
    "description": "It comes as the former TV chef and host ramps up involvement with Robert F. Kennedy Jr and his Make America Healthy Again plan.",
    "link": "https://www.perthnow.com.au/politics/donald-trump/pete-evans-disgraced-australian-celebrity-chef-claims-to-have-met-donald-trump-robert-f-kennedy-jr-c-18068428",
    "timestamp": "2025-03-17T07:18:52Z"
  },
  {
    "title": "Donald Trump Says He Has \"No Intention\" Of Easing Steel, Aluminum Tariffs",
    "description": "Donald Trump doubled down on a pledge to impose reciprocal levies as soon as April 2 to remedy trade practices Washington deems unfair.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-he-has-no-intention-of-easing-steel-aluminum-tariffs-7941531",
    "timestamp": "2025-03-17T07:16:42Z"
  },
  {
    "title": "Do you want some good news on St Patrick’s Day? Course you don’t",
    "description": "You are in a dysfunctional long-distance relationship with an orange clown. You’re only human. But there is something we can all do",
    "link": "https://www.irishtimes.com/opinion/2025/03/17/do-you-want-some-good-news-on-st-patricks-day-course-you-dont/",
    "timestamp": "2025-03-17T07:07:00Z"
  },
  {
    "title": "Hiring freeze impacts mental health support office at Air Force base in Tokyo",
    "description": "A federal hiring freeze is affecting an office that provides mental health support to airmen and their families at Yokota Air Base.",
    "link": "https://www.stripes.com/branches/air_force/2025-03-17/hiring-freeze-mental-health-support-17170694.html",
    "timestamp": "2025-03-17T07:05:32Z"
  },
  {
    "title": "US flies alleged gang members to El Salvador despite court block",
    "description": "The United States flew over 200 alleged members of a Venezuelan gang to be imprisoned in El Salvador, President Nayib Bukele said Sunday, after US counterpart Donald Trump controversially invoked wartime legislation to expel them.",
    "link": "https://www.hurriyetdailynews.com/us-flies-alleged-gang-members-to-el-salvador-despite-court-block-206977",
    "timestamp": "2025-03-17T07:05:16Z"
  },
  {
    "title": "Alaskan officials to seek investors in Japan as Trump touts LNG",
    "description": "TOKYO : Alaskan state representatives will visit Japan this month to court investors for a natural gas project President Donald Trump says could pump trillions of dollars into the United States, but Japanese energy firms remain wary of its viability. Official…",
    "link": "https://www.channelnewsasia.com/business/alaskan-officials-seek-investors-japan-trump-touts-lng-5005021",
    "timestamp": "2025-03-17T07:03:15Z"
  },
  {
    "title": "Quackery (still) kills: A five-year-old boy dies in a hyperbaric oxygen chamber",
    "description": "Even as quacks and antivaxxers take over our federal government's health apparatus, let's not forget why we need stronger, not laxer, regulation of \"unconventional\" medical practices.\nThe post Quackery (still) kills: A five-year-old boy dies in a hyperbaric o…",
    "link": "https://sciencebasedmedicine.org/quackery-still-kills-a-five-year-old-boy-dies-in-a-hyperbaric-oxygen-chamber/",
    "timestamp": "2025-03-17T07:02:00Z"
  },
  {
    "title": "‘How gratifying’: Cheers in China as Trump dismantles Voice of America | CNN",
    "description": "One nationalist influencer called it “truly gratifying.” Another said he was laughing his head off. And a state-media editorial hailed the demise of what it called the “lie factory.”",
    "link": "https://www.cnn.com/2025/03/17/china/china-cheers-trump-cut-voice-of-america-intl-hnk/index.html",
    "timestamp": "2025-03-17T07:01:44Z"
  },
  {
    "title": "Donald Trump shares PM Modi's podcast with Lex Fridman ahead of April 2 reciprocal tariffs",
    "description": "US President Donald Trump on Monday shared Prime Minister Narendra Modi's podcast with Lex Fridman on his Truth account. The Indian Prime Minister has lavished praise on Trump as a man of courage, underscoring strong personal bonds now being tested by the US …",
    "link": "https://economictimes.indiatimes.com/news/india/donald-trump-shares-pm-modis-podcast-with-lex-fridman-ahead-of-april-2-reciprocal-tariffs/articleshow/119106007.cms",
    "timestamp": "2025-03-17T07:01:04Z"
  },
  {
    "title": "MAHA Three Card Monte? Decision to Axe Advisory Groups Could Spell Trouble for US Food Safety",
    "description": "Concerns that RFK Jr.'s MAHA may set back food safety, particularly with regard to pathogens.",
    "link": "https://www.nakedcapitalism.com/2025/03/maha-three-card-monte-decision-to-axe-advisory-groups-could-spell-trouble-for-us-food-safety.html",
    "timestamp": "2025-03-17T07:00:42Z"
  },
  {
    "title": "Flight of the Trumpugees: The wealthy Americans fleeing the US for Europe",
    "description": "Rosie O'Donnell is not the only American fleeing the Trump administration",
    "link": "https://www.irishtimes.com/opinion/2025/03/17/flight-of-the-trumpugees-the-wealthy-americans-fleeing-the-us-for-europe/",
    "timestamp": "2025-03-17T07:00:00Z"
  },
  {
    "title": "U of Hawai‘i System Raises Money for Grad Students Impacted by Federal Action",
    "description": "U of Hawai‘i System Raises Money for Grad Students Impacted by Federal Action\n\n \n\n\n \nAshley Mowreader\n\nMon, 03/17/2025 - 03:00 AM\n\nThe UH Foundation launched a campaign to support graduate students whose funding has been interrupted due to federal funding fre…",
    "link": "https://www.insidehighered.com/news/student-success/college-experience/2025/03/17/donors-support-grad-students-lacking-federal",
    "timestamp": "2025-03-17T07:00:00Z"
  },
  {
    "title": "Wyoming Governor Signs Anti-DEI Law Restricting Curriculum",
    "description": "Wyoming now has an anti–diversity, equity and inclusion law that bans community colleges and the University of Wyoming, the state’s only public university, from requiring “instruction promoting institutional discrimination.”",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/03/17/wyoming-governor-signs-anti-dei-law-restricting-curriculum",
    "timestamp": "2025-03-17T07:00:00Z"
  },
  {
    "title": "Trump says he will speak with Putin about Ukraine war on Tuesday",
    "description": "Ukraine must be barred from NATO in any peace deal, Russian official says in interview.",
    "link": "https://www.aljazeera.com/news/2025/3/17/trump-says-he-will-speak-with-putin-about-ukraine-war-on-tuesday",
    "timestamp": "2025-03-17T06:59:40Z"
  },
  {
    "title": "Minnesota Republicans to introduce bill defining 'Trump derangement syndrome' as mental illness",
    "description": "A group of Minnesota Republican senators are planning to introduce a bill to include \"Trump derangement syndrome\" in the state's definition of mental illness.",
    "link": "https://www.foxnews.com/politics/minnesota-republicans-introduce-bill-defining-trump-derangement-syndrome-mental-illness",
    "timestamp": "2025-03-17T06:56:03Z"
  },
  {
    "title": "Turmoil in the US is boosting global markets — but the chaos could still spread, Goldman Sachs warns",
    "description": "The macroeconomic outlook for the US remains uncertain as the second Trump administration appears to have a higher tolerance for market turbulence.",
    "link": "https://markets.businessinsider.com/news/stocks/goldman-sachs-europe-china-markets-benefiting-us-rout-decouple-outlook-2025-3",
    "timestamp": "2025-03-17T06:55:27Z"
  },
  {
    "title": "Donald Trump: I’ll talk to Putin on Tuesday, we’ll see if we have something to announce",
    "description": "\"There was a lot of work done over the weekend. We want to see if we can end the war,\" the US president added\nThe post Donald Trump: I’ll talk to Putin on Tuesday, we’ll see if we have something to announce appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/03/17/donald-trump-ill-talk-to-putin-on-tuesday-well-see-if-we-have-something-to-announce/",
    "timestamp": "2025-03-17T06:54:36Z"
  },
  {
    "title": "Data shows patchy Chinese economy in first two months",
    "description": "China's economy charted an uneven trajectory in the first two months of the year, a slew of key indicators showed on Monday, muddying Beijing's drive to boost flagging consumption.",
    "link": "https://www.hurriyetdailynews.com/data-shows-patchy-chinese-economy-in-first-two-months-206974",
    "timestamp": "2025-03-17T06:53:03Z"
  },
  {
    "title": "Trump admin begins mass layoffs at Voice of America",
    "description": "President Donald Trump's administration has begun mass layoffs at Voice of America and other U.S.-funded media, making clear its intent to gut outlets long seen as critical for U.S. influence.",
    "link": "https://www.hurriyetdailynews.com/trump-admin-begins-mass-layoffs-at-voice-of-america-206972",
    "timestamp": "2025-03-17T06:47:10Z"
  },
  {
    "title": "El Salvador Continues Bitcoin Stacking As $BTC Struggles Below $85,000",
    "description": "El Salvador is unfazed by concerns around its Bitcoin reserve following a recent agreement with the IMF to concede some of its policies to secure a loan, but there are questions on the Bukele government's \"contradictory\" actions.",
    "link": "https://www.ibtimes.com/el-salvador-continues-bitcoin-stacking-btc-struggles-below-85000-3766529",
    "timestamp": "2025-03-17T06:43:42Z"
  },
  {
    "title": "Spurred by Trump turnabout, European nations debate conscription",
    "description": "Paris (AFP) Mar 16, 2025\n\n Frightened by the prospect of US security disengagement and three years of Moscow's war against Ukraine, European countries are debating reinstating compulsory military service to boost their defences in the face of Russian aggressi…",
    "link": "https://www.spacewar.com/reports/Spurred_by_Trump_turnabout_European_nations_debate_conscription_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Trump and Putin likely to discuss Ukraine war cease-fire this week",
    "description": "Washington DC (UPI) Mar 16, 2025 \n\n\n President Donald Trump and Russian President Vladimir Putin are expected to meet this week to discuss the terms of a cease-fire in the Russia-Ukraine war, which is now in its third year, a White House envoy said Sunday. \n …",
    "link": "https://www.spacewar.com/reports/Trump_and_Putin_likely_to_discuss_Ukraine_war_cease-fire_this_week_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Thailand says assured of Uyghurs' safety after US visa bans",
    "description": "Bangkok (AFP) Mar 15, 2025\n\n Thailand on Saturday responded to a United States visa ban on officials from the kingdom involved in deporting dozens of Uyghurs back to China, saying it had \"received assurances\" of their safety. \n\nThe Thai government has suffere…",
    "link": "https://www.spacewar.com/reports/Thailand_says_assured_of_Uyghurs_safety_after_US_visa_bans_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Musk says Starship to depart for Mars at end of 2026",
    "description": "Washington (AFP) Mar 15, 2025\n\n\n SpaceX founder Elon Musk said Saturday its massive Starship rocket would leave for Mars at the end of 2026 with Tesla humanoid robot Optimus onboard, adding that human landings could follow \"as soon as 2029.\" \n\n\"Starship depar…",
    "link": "https://www.spacedaily.com/reports/Musk_says_Starship_to_depart_for_Mars_at_end_of_2026_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Amid tensions, Canada says reviewing purchase of US jets",
    "description": "Montreal (AFP) Mar 15, 2025\n\n\n Canada is reviewing a major purchase of US-made F-35 combat planes amid serious tensions with the Trump administration, a spokesperson for the Canadian defense ministry told AFP on Saturday. \n\nThat announcement came two days aft…",
    "link": "https://www.spacewar.com/reports/Amid_tensions_Canada_says_reviewing_purchase_of_US_jets_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Iraq says kills senior Islamic State group leader",
    "description": "Baghdad (AFP) Mar 15, 2025\n\n\n Iraqi security forces have killed a senior Islamic State (IS) group leader responsible for foreign operations, according to the country's prime minister, with US President Donald Trump saying later Friday his \"miserable life was …",
    "link": "https://www.spacewar.com/reports/Iraq_says_kills_senior_Islamic_State_group_leader_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "US kills 'multiple' leaders of Iran-backed rebels in Yemen; Huthis vow 'escalation'",
    "description": "Sanaa (AFP) Mar 16, 2025\n\n\n A White House official on Sunday said a wave of United States air strikes on Yemen killed senior Huthi rebel leaders and sent a message to their Iranian backers. \n\nAttacks on the rebel-held capital Sanaa as well as Saada, Al-Bayda …",
    "link": "https://www.spacewar.com/reports/US_says_multiple_leaders_of_Iran-backed_rebels_dead_in_Yemen_strikes_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Iran Guards vow to retaliate against any attack after Trump warning",
    "description": "Tehran (AFP) Mar 16, 2025\n\n Iran's Revolutionary Guards on Sunday threatened a \"decisive\" response to any attack, after US President Donald Trump ordered a wave of air strikes against Yemen's Huthi rebels and warned Tehran to stop backing the group. \n\nOn Satu…",
    "link": "https://www.spacewar.com/reports/Iran_Guards_vow_to_retaliate_against_any_attack_after_Trump_warning_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "EU urges member states to give Ukraine up to 40bn euros of arms this year",
    "description": "Brussels, Belgium (AFP) Mar 14, 2025\n\n\n The EU is pressing its member states to commit to giving Ukraine up to 40 billion euros of weapons this year, according to a proposal seen Friday, as questions swirl over US support. \n\nPresident Donald Trump rocked Kyiv…",
    "link": "https://www.spacewar.com/reports/EU_urges_member_states_to_give_Ukraine_up_to_40bn_euros_of_arms_this_year_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "US vows 'unrelenting' campaign to halt Huthi ship attacks",
    "description": "Washington (AFP) Mar 16, 2025\n\n US officials on Sunday vowed further strikes in Yemen until the Huthi rebels decide to end their attacks on Red Sea shipping, while also threatening action against the group's backer Iran. \n\nIn a wave of strikes on Saturday, th…",
    "link": "https://www.spacewar.com/reports/US_vows_unrelenting_campaign_to_halt_Huthi_ship_attacks_999.html",
    "timestamp": "2025-03-17T06:43:02Z"
  },
  {
    "title": "Trump to Speak With Putin Tuesday in Ukraine Ceasefire Push",
    "description": "President Donald Trump said he’ll speak with Russian President Vladimir Putin on Tuesday as the US presses for an end to fighting in Ukraine and European nations rush to bolster their support for Kyiv.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-speak-with-putin-tuesday-in-ukraine-ceasefire-push",
    "timestamp": "2025-03-17T06:42:35Z"
  },
  {
    "title": "The astounding net worth of Vanessa Trump, President Donald Trump's former daughter-in-law!",
    "description": "Vanessa Kay Trump, former socialite and mother of five, is reportedly dating golf champion Tiger Woods. They are both residents of the same Palm Beach area and have children attending the same school. Vanessa, previously married to Donald Trump Jr., has had a…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/the-astounding-net-worth-of-vanessa-trump-president-donald-trumps-former-daughter-in-law/articleshow/119104881.cms",
    "timestamp": "2025-03-17T06:42:02Z"
  },
  {
    "title": "Trump isn't just attacking trans people. He's denationalizing them",
    "description": "The rights the Trump administration is taking away from trans people are relatively new. Only in the past few decades, for example, have clear legal procedures existed for changing the gender marker on identity documents, and only in the past few years have f…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-isnt-just-attacking-trans-people-hes-denationalizing-them/articleshow/119105028.cms",
    "timestamp": "2025-03-17T06:36:16Z"
  },
  {
    "title": "Lara Trump And Michael Saylor On Bitcoin – Must-See Insights",
    "description": "In a segment, Fox News contributor Lara Trump —wife of Eric Trump, son of US President Donald Trump—interviewed Michael Saylor on the increasingly pivotal role of Bitcoin in the global financial landscape. Often hailed as a “Bitcoin evangelist,” Saylor recoun…",
    "link": "https://bitcoinist.com/lara-trump-michael-saylor-bitcoin/",
    "timestamp": "2025-03-17T06:30:21Z"
  },
  {
    "title": "Kaushik Basu: America’s capacity for self-harm is breathtaking",
    "description": "US trade policy has taken a dramatic turn for the surreal. Ironically, Trump’s MAGA agenda could end up driving a global shift that makes other countries great again.",
    "link": "https://www.livemint.com/opinion/online-views/kaushik-basu-donald-trump-american-us-trade-balance-trade-deficit-tariffs-tariff-war-maga-us-trade-policy-global-trade-11741933570201.html",
    "timestamp": "2025-03-17T06:30:08Z"
  },
  {
    "title": "Crypto Price Today: Bitcoin Trades Above $83,600, Altcoin Movement Remain Sluggish",
    "description": "The overall crypto market cap slipped down by 0.69 percent in the last 24 hours owing to the prevailing slowdown. Bitcoin and Ether reflected losses on Monday, March 17. Solana, Dogecoin, and Cardano also saw drops in their respective prices. Market analysts …",
    "link": "https://www.gadgets360.com/cryptocurrency/news/bitcoin-price-today-usd-83600-altcoins-dogecoin-shiba-inu-solana-dogecoin-losses-7941196",
    "timestamp": "2025-03-17T06:29:06Z"
  },
  {
    "title": "Trump says 'no intention' to ease steel, aluminum tariffs",
    "description": "US President Donald Trump reaffirmed his stance on maintaining steel and aluminum tariffs amid escalating trade tensions. He announced plans to impose reciprocal levies starting April 2, targeting unfair trade practices, with substantial revenue expected to b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-no-intention-to-ease-steel-aluminum-tariffs/articleshow/119104668.cms",
    "timestamp": "2025-03-17T06:28:40Z"
  },
  {
    "title": "'Dictator S**t': Trump's Middle-Of-The-Night Meltdown Nulling Biden Pardons Is Slammed",
    "description": "The president sent a chilling warning to people pardoned by former President Joe Biden.",
    "link": "https://www.huffpost.com/entry/donald-trump-biden-pardons_n_67d7ba6be4b041fe9a9c90c5",
    "timestamp": "2025-03-17T06:28:04Z"
  },
  {
    "title": "Migrant Smugglers Turn to TikTok as Trump Cracks Down at the Border",
    "description": "As President Donald Trump slashes legal pathways to the U.S., smugglers say TikTok allows them to expand their reach to new customers.",
    "link": "https://time.com/7268812/migrant-smugglers-tiktok-immigration-trump/",
    "timestamp": "2025-03-17T06:27:30Z"
  },
  {
    "title": "Trump says Ukraine peace talks looking at ‘dividing up certain assets’ | CNN Politics",
    "description": "Negotiators working to end the Russia-Ukraine war have already discussed “dividing up certain assets,” US President Donald Trump said Sunday as he announced he planned to speak to Russian President Vladimir Putin on Tuesday.",
    "link": "https://www.cnn.com/2025/03/17/politics/trump-putin-meeting-ukraine-intl-hnk/index.html",
    "timestamp": "2025-03-17T06:23:37Z"
  },
  {
    "title": "Mark Carney, Canadian Prime Minister, travels to Europe to seek alliances as he deals with Trump",
    "description": "New Canadian Prime Minister Mark Carney is heading to Paris and London on Monday to seek alliances as he deals with U.S. President Donald Trump’s attacks on Canada’s sovereignty and economy.",
    "link": "https://www.cnn.com/2025/03/17/europe/canada-mark-carney-europe-trump-intl-hnk/index.html",
    "timestamp": "2025-03-17T06:23:15Z"
  },
  {
    "title": "TikTok becomes a tool of choice in cat-and-mouse game between migrant smugglers and authorities",
    "description": "Social media apps like TikTok have become an essential tool for smugglers and migrants alike",
    "link": "https://abcnews.go.com/Business/wireStory/tiktok-tool-choice-cat-mouse-game-migrant-smugglers-119863236",
    "timestamp": "2025-03-17T06:22:29Z"
  },
  {
    "title": "Accused Texas megachurch pastor to surrender in Oklahoma on child sexual abuse charges",
    "description": "A former pastor of a Texas megachurch is expected to surrender to Oklahoma authorities on child sexual abuse charges",
    "link": "https://abcnews.go.com/US/wireStory/accused-texas-megachurch-pastor-surrender-oklahoma-child-sexual-119862609",
    "timestamp": "2025-03-17T06:22:19Z"
  }
]