[
  {
    "title": "ROOKE: If You’re Looking For Evidence Of The Media Screwing Over America, Look No Further",
    "description": "One of the more prominent symptoms of Trump Derangement Syndrome (TDS) is that it makes the left act completely insane.",
    "link": "https://dailycaller.com/2025/05/01/rooke-media-illegal-immigration-texas-detention-democrats-trump/",
    "timestamp": "2025-05-01T17:16:08Z"
  },
  {
    "title": "‘We are the majority’: May Day marches challenge Trump’s dismantling of democracy",
    "description": "The mass protest marches slated for May 1 across Arizona and nationwide are just the latest show of people power against the seemingly bottomless pit of White House directives aimed at dismantling our democracy.\nOrganizers predict hundreds of thousands of peo…",
    "link": "https://www.rawstory.com/we-are-the-majority-may-day-marches-challenge-trumps-dismantling-of-democracy/",
    "timestamp": "2025-05-01T17:15:18Z"
  },
  {
    "title": "Texas Gun Owners Turn On Cornyn, Petition Trump Not To Endorse His Re-Election",
    "description": "Saying that U.S. Sen. John Cornyn has “betrayed the trust” of Lone Star State gun owners, a Texas gun rights group is asking President Donald Trump not to endorse the longtime senator for re-election. The organization Texas Gun Rights (TGR) last week penned a…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314434/posts",
    "timestamp": "2025-05-01T17:15:10Z"
  },
  {
    "title": "Trump-Appointed Judge Strikes Down Move Crucial to Deportations",
    "description": "A federal judge has barred the Trump administration from deporting immigrants on the basis of the Alien Enemies Act of 1798, ruling Thursday that the use of the World War II-era policy to banish alleged Tren de Aragua gang members from the country without due…",
    "link": "https://newrepublic.com/post/194708/donald-trump-appointed-judge-strikes-down-alien-enemies-deportations",
    "timestamp": "2025-05-01T17:14:26Z"
  },
  {
    "title": "'You're a dictator, but that's OK': Trump reveals what he tells despots in the Oval Office",
    "description": "President Donald Trump revealed that he welcomes autocrats and despots into the Oval Office and tells them they are dictators, \"but that's OK.\"Trump made the remarks at a White House National Day of Prayer event on Thursday.\"As we bow our heads this beautiful…",
    "link": "https://www.rawstory.com/trump-dictators-oval-office/",
    "timestamp": "2025-05-01T17:14:11Z"
  },
  {
    "title": "Given chance to stand up to Trump on tariffs, Senate Republicans take a pass",
    "description": "WASHINGTON — Senate Republicans defended President Donald Trump’s emergency tariffs Wednesday, blocking a largely symbolic measure to terminate the president’s import taxes that have shocked the economy.\nThe resolution failed in a tied 49-49 vote Wednesday ev…",
    "link": "https://www.rawstory.com/given-chance-to-stand-up-to-trump-on-tariffs-senate-republicans-take-a-pass/",
    "timestamp": "2025-05-01T17:13:25Z"
  },
  {
    "title": "Trump Administration Shares Second Abuse Claim by Abrego Garcia's Wife",
    "description": "Jennifer Vasquez Sura said in 2020 that her husband had attacked her, but criminal charges were never filed.",
    "link": "https://www.newsweek.com/abrego-garcia-alleged-abuse-trump-administration-ms13-deportation-2066792",
    "timestamp": "2025-05-01T17:12:29Z"
  },
  {
    "title": "'Health concerns are real': Trump nixed program stopping human waste from going into homes",
    "description": "President Donald Trump cancelled a program that would help residents of Lowndes County, Alabama, stop human waste from building up in front of their homes, according to an NBC report. Human wastewater contaminating homes and yards in these rural parts of cent…",
    "link": "https://www.rawstory.com/dei-climate-change-alabama/",
    "timestamp": "2025-05-01T17:11:02Z"
  },
  {
    "title": "Signs Grow That AI Is Starting to Seriously Bite Into the Job Market",
    "description": "The discrepancy between expectations and reality faced by young college graduates entering the United States workforce has hit an all-time low. Figures published by the US Bureau of Labor Statistics show that newly minted college graduates are struggling to f…",
    "link": "https://futurism.com/signs-ai-bite-job-market",
    "timestamp": "2025-05-01T17:10:28Z"
  },
  {
    "title": "California’s ban on gasoline cars Is overturned by US House vote",
    "description": "By Ari Natter | Bloomberg\nRepublicans moved a step closer Thursday to repealing a federal waiver allowing California to ban gasoline-powered cars by 2035, a policy that had drawn opposition from automakers, fuel producers and President Donald Trump himself.\nT…",
    "link": "https://biztoc.com/x/09acfab2b5f6c74b",
    "timestamp": "2025-05-01T17:10:26Z"
  },
  {
    "title": "US, Ukraine sign joint minerals deal",
    "description": "The Trump administration signed a deal with Ukraine giving the US access to its mineral wealth",
    "link": "https://theweek.com/world-news/ukraine-minerals-deal-trump",
    "timestamp": "2025-05-01T17:10:12Z"
  },
  {
    "title": "GM lowers 2025 guidance, citing up to $5 billion in tariff exposure",
    "description": "DETROIT — General Motors on Thursday lowered its 2025 financial guidance to include an expected $4 billion to $5 billion impact as a result of President Donald Trump’s auto tariffs.",
    "link": "https://www.nbcnews.com/business/autos/gm-lowers-2025-guidance-citing-5-billion-tariff-exposure-rcna204191",
    "timestamp": "2025-05-01T17:10:10Z"
  },
  {
    "title": "Trump-appointed judge says president's use of Alien Enemies Act is unlawful in first-of-its-kind ruling (CNN)",
    "description": "CNN:\nTrump-appointed judge says president's use of Alien Enemies Act is unlawful in first-of-its-kind ruling  —  A Donald Trump-appointed federal judge in Texas ruled that the president unlawfully invoked the Alien Enemies Act and blocked the administration f…",
    "link": "https://www.memeorandum.com/250501/p66",
    "timestamp": "2025-05-01T17:10:01Z"
  },
  {
    "title": "Trump-Appointed Judge Rules Trump's Use of Alien Enemies Act Unlawful (Aaron Parnas/MeidasTouch News)",
    "description": "Aaron Parnas / MeidasTouch News:\nTrump-Appointed Judge Rules Trump's Use of Alien Enemies Act Unlawful  —  Another loss in court for the Administration  —  A federal judge in Texas — appointed by Donald Trump himself — has just ruled that Trump's controversia…",
    "link": "https://www.memeorandum.com/250501/p67",
    "timestamp": "2025-05-01T17:10:01Z"
  },
  {
    "title": "'Health concerns are real': Trump nixed program stopping human waste from going into homes - NewsBreak",
    "description": "President Donald Trump cancelled a program that would help residents of Lowndes County, Alabama, stop human waste from building up in front of their homes,",
    "link": "https://www.newsbreak.com/share/3987955582658-health-concerns-are-real-trump-nixed-program-stopping-human-waste-from-going-into-homes?s=a2&share_destination_id=MjAwMTM5MjgyLTE3NDYxMjkwMzc4ODQ%3D&pd=0DXlMw0G&hl=en_US&send_time=1746129037&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v6%2Cns_local_strategy_25q1_exp-v5%2Cns_foryou_recall_exp_25q2-v7%2Cns_foryou_blend_exp_25q2-v4",
    "timestamp": "2025-05-01T17:09:26Z"
  },
  {
    "title": "Accused MS-13 ringleader one step closer to deportation after judge dismisses charges",
    "description": "Henrry Josue Villatoro Santos, an alleged MS-13 leader, faces removal proceedings after charges against him were dismissed in federal court.",
    "link": "https://www.foxnews.com/us/accused-ms-13-ringleader-one-step-closer-deportation-after-judge-dismisses-charges",
    "timestamp": "2025-05-01T17:09:20Z"
  },
  {
    "title": "The Justice Department ended a decades-old school desegregation order. Others are expected to fall",
    "description": "Dozens of school districts across the South remain under agreements to work toward integration.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-education-desegregation/",
    "timestamp": "2025-05-01T17:09:02Z"
  },
  {
    "title": "The Justice Department ended a decades-old school desegregation order. Others are expected to fall",
    "description": "Dozens of school districts across the South remain under agreements to work toward integration.",
    "link": "https://www.denverpost.com/2025/05/01/trump-education-desegregation/",
    "timestamp": "2025-05-01T17:09:02Z"
  },
  {
    "title": "Trump national security adviser Waltz is out in a major staff shake-up after his Signal chat blunder",
    "description": "White House national security adviser Mike Waltz is leaving the Trump administration just weeks after it was revealed he added a journalist to a Signal chat being used to discuss military plans. That's according to two people familiar with the…",
    "link": "https://apnews.com/article/trump-waltz-national-security-signal-db2443f6fed98e4067edd57f26f23603",
    "timestamp": "2025-05-01T17:09:00Z"
  },
  {
    "title": "Phil Mickelson rips 'traitor' Chuck Schumer over SAVE Act criticisms: 'He is not representing America'",
    "description": "Phil Mickelson took a swing at Senate Minority Leader Chuck Schumer on social media Wednesday over the Democratic leader's criticism of the SAVE Act.",
    "link": "https://www.foxnews.com/sports/phil-mickelson-rips-traitor-chuck-schumer-over-save-act-criticisms-he-not-representing-america",
    "timestamp": "2025-05-01T17:08:50Z"
  },
  {
    "title": "‘We’ve got to take this from Elon Musk’: Tesla to shut down all its car dealerships across this state",
    "description": "A new bill could impact Tesla's waiver to make direct sales in New York, prompting the manufacturer to consider closing all dealerships in the state.\n\n\nSeveral states have laws that prevent electric vehicle manufacturers from selling directly to drivers. Inst…",
    "link": "https://www.dailydot.com/news/tesla-new-york-closures/",
    "timestamp": "2025-05-01T17:08:01Z"
  },
  {
    "title": "300,000 Rally Across France For May 1, Union Says",
    "description": "Rallies across France for International Workers' Day drew more than 300,000 on Thursday, including 100,000 in Paris, the CGT trade union told AFP.\nThe authorities were yet to give a figure for the May Day marches' turnout.",
    "link": "https://www.ibtimes.com/300000-rally-across-france-may-1-union-says-3772177",
    "timestamp": "2025-05-01T17:06:07Z"
  },
  {
    "title": "Is Donald Trump Pardoning Pete Rose? MLB Commissioner Rob Manfred Tight-Lipped on POTUS’s Plan of Action",
    "description": "Even after Pete Rose’s passing, Rob Manfred still finds himself continually talking about the legendary career Rose had and his controversial ban. When Donald Trump was re-elected, many began to realize that the ban could soon come to an end, which could put …",
    "link": "https://freerepublic.com/focus/f-chat/4314433/posts",
    "timestamp": "2025-05-01T17:05:36Z"
  },
  {
    "title": "Social Media Erupts Over Trump's Dismissal Of Mike Waltz",
    "description": "People didn't dance around their feelings about the former national security adviser.",
    "link": "https://www.huffpost.com/entry/trump-dismisses-mike-waltz-social-media_n_6813963be4b0376886638bae",
    "timestamp": "2025-05-01T17:05:24Z"
  },
  {
    "title": "Trump’s health agency urges therapy for transgender youth, not broader gender-affirming healthcare",
    "description": "President Donald Trump’s administration released a lengthy review of transgender health care on Thursday that advocates for a greater reliance on behavioral therapy rather than broad gender-affirming medical care for youths with gender dysphoria.",
    "link": "https://www.wbng.com/2025/05/01/trumps-health-agency-urges-therapy-transgender-youth-not-broader-gender-affirming-healthcare/",
    "timestamp": "2025-05-01T17:04:24Z"
  },
  {
    "title": "Tariff wars by global far-right pose threat to workers, says South African minister",
    "description": "CAPE TOWN, May 1 (Xinhua) -- In a world marked by deepening inequality, tariff wars are among the tactics used by the global far right to undermine workers and threaten jobs, a senior South African official warned on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/02/tariff-wars-by-global-far-right-pose-threat-to-workers-says-south-african-minister",
    "timestamp": "2025-05-01T17:04:00Z"
  },
  {
    "title": "Microsoft drops a law firm that appeased Trump, hires firm that’s fighting Trump",
    "description": "Law firms that struck deals with the White House thought it'd protect their bottom line. But what if their assumptions were wrong and the opposite is true?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/microsoft-drops-law-firm-appeased-trump-hires-firm-s-fighting-trump-rcna204152",
    "timestamp": "2025-05-01T17:02:41Z"
  },
  {
    "title": "Recession Prep 101: Practical Financial Tips for Today's Economy",
    "description": "Economic downturns are a fact of life. Staying prepared is your best protection.",
    "link": "https://www.cnet.com/personal-finance/banking/recession-prep-101-practical-financial-tips-for-todays-economy/",
    "timestamp": "2025-05-01T17:02:00Z"
  },
  {
    "title": "‘That’s Nice’: Trump Recalls How He Responded When Ben Carson Told Him ‘God Is With You’",
    "description": "President Donald Trump told a crowd assembled to celebrate the National Day of Prayer how he responded when Ben Carson told him God was with him.\nThe post ‘That’s Nice’: Trump Recalls How He Responded When Ben Carson Told Him ‘God Is With You’ first appeared …",
    "link": "https://www.mediaite.com/news/thats-nice-trump-recalls-how-he-responded-when-ben-carson-told-him-god-is-with-you/",
    "timestamp": "2025-05-01T17:01:48Z"
  },
  {
    "title": "Pete Buttigieg heading to Iowa for first in-person event since Trump’s return",
    "description": "Pete Buttigieg is heading to Iowa later this month for his first in-person event since President Donald Trump returned to office. CNN has learned Buttigieg will headline a town hall with the group VoteVets Action Fund in Cedar Rapids on May 13.",
    "link": "https://www.cnn.com/2025/05/01/politics/pete-buttigieg-iowa-town-hall",
    "timestamp": "2025-05-01T17:00:50Z"
  },
  {
    "title": "Weekly quiz: Which famous couple spent their wedding anniversary here?",
    "description": "How much attention did you pay to what has been going on in the world over the past seven days?",
    "link": "https://www.bbc.com/news/articles/c75d0l092v5o",
    "timestamp": "2025-05-01T17:00:38Z"
  },
  {
    "title": "Cheap parcels from China will no longer be duty-free. Here’s what it means for buyers and sellers",
    "description": "U.S. companies may feel relief from the competition of cheap Chinese imports.",
    "link": "https://www.bostonherald.com/2025/05/01/china-duty-free-exemption-ends/",
    "timestamp": "2025-05-01T17:00:36Z"
  },
  {
    "title": "Donald Trump Says Americans May 'Give Up Your Religion' if Taxes Go Up",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDuring his National Day of Prayer speech on Thursday, President Donald Trump used the occasion to promise that tax-cut legislation would work its way through Congress.\nThe president seemed to joke that America…",
    "link": "https://biztoc.com/x/68a2faaa130c5bf2",
    "timestamp": "2025-05-01T17:00:15Z"
  },
  {
    "title": "Trump's health agency urges therapy for transgender youth, not broader gender-affirming health care",
    "description": "President Donald Trump’s administration released a lengthy review of transgender health care on Thursday that advocates for a greater reliance on behavioral ...",
    "link": "https://www.yahoo.com/news/trumps-health-agency-urges-therapy-130141004.html",
    "timestamp": "2025-05-01T17:00:06Z"
  },
  {
    "title": "Judge Rules Trump Cannot Use Alien Enemies Act for Deportations",
    "description": "However, the judge said his ruling does not stop the defendants \"to continue removal proceedings or enforcement of any final orders of removal\" under the Immigration and Nationality Act.\nThe post Judge Rules Trump Cannot Use Alien Enemies Act for Deportations…",
    "link": "https://legalinsurrection.com/2025/05/judge-rules-trump-cannot-use-alien-enemies-act-for-deportations/",
    "timestamp": "2025-05-01T17:00:02Z"
  },
  {
    "title": "MAGA Reacts to Mike Waltz's Firing",
    "description": "Laura Loomer celebrated the reported move, having put pressure on President Donald Trump.",
    "link": "https://biztoc.com/x/3d1a543a055eb53c",
    "timestamp": "2025-05-01T16:59:48Z"
  },
  {
    "title": "Why major law firms are taking Trump to court",
    "description": "President Donald Trump has been targeting American law firms with executive orders that threaten to destroy them.\nRead the original article on Business Insider",
    "link": "https://biztoc.com/x/41b9eb4ec3032025",
    "timestamp": "2025-05-01T16:59:48Z"
  },
  {
    "title": "Judge bars deportations of Venezuelans from South Texas under 18th-century Alien Enemies Act",
    "description": "In March, President Donald Trump issued a proclamation claiming that the Venezuelan gang Tren de Aragua was invading the U.S.",
    "link": "https://biztoc.com/x/1755872836a4541f",
    "timestamp": "2025-05-01T16:59:36Z"
  },
  {
    "title": "Europe Needs to Get Over America",
    "description": "Europeans must take charge of their own security.",
    "link": "http://foreignpolicy.com/2025/05/01/trump-europe-security-putin-ukraine-russia-defense-buildup-readiness-2030/",
    "timestamp": "2025-05-01T16:58:36Z"
  },
  {
    "title": "CNN’s Harry Enten Says Americans Still Believe Trump Is Doing A Better Job Than Harris Would",
    "description": "CNN's Harry Enten said Americans still believe President Donald Trump would currently be doing a better job than former Vice President Kamala Harris.",
    "link": "https://dailycaller.com/2025/05/01/cnn-harry-enten-trump-harris-democrats-polls/",
    "timestamp": "2025-05-01T16:58:20Z"
  },
  {
    "title": "Summers Says It’s Wrong to Say Markets Tell Fed It Should Cut",
    "description": "Former Treasury Secretary Lawrence Summers said that bond-market pricing doesn’t amount to a judgment call on what the Federal Reserve ought to do with interest rates, and that it would be a “very serious error” for policymakers to ease next week.",
    "link": "https://financialpost.com/pmn/business-pmn/summers-says-its-wrong-to-say-markets-tell-fed-it-should-cut",
    "timestamp": "2025-05-01T16:57:13Z"
  },
  {
    "title": "Trump: There are fewer than 24 hostages left alive in Gaza",
    "description": "US President Donald Trump said on Thursday that he understands that there are fewer than 24 Israeli hostages a",
    "link": "https://www.jpost.com/breaking-news/article-852286",
    "timestamp": "2025-05-01T16:57:09Z"
  },
  {
    "title": "Fourth round of US-Iran nuclear talks postponed amid continued tensions",
    "description": "The foreign minister of Oman credited the delay to 'logistical reasons', but the postponement comes amid new sanctions.",
    "link": "https://www.aljazeera.com/news/2025/5/1/fourth-round-of-us-iran-nuclear-talks-postponed-amid-continued-tensions",
    "timestamp": "2025-05-01T16:57:03Z"
  },
  {
    "title": "'Draconian' and dangerous: Former Trump nat sec advisor sounds alarm on Biden-era DOJ's plans for Google",
    "description": "Trump's former national security advisor urged the administration to review and alter its proposed remedy to break up Google's monopoly of online search.",
    "link": "https://www.foxnews.com/politics/draconian-dangerous-former-trump-nat-sec-adviser-sounds-alarm-biden-era-dojs-plans-google",
    "timestamp": "2025-05-01T16:56:29Z"
  },
  {
    "title": "Judge bars deportations of Venezuelans from South Texas under 18th-century Alien Enemies Act",
    "description": "In March, President Donald Trump issued a proclamation claiming that the Venezuelan gang Tren de Aragua was invading the U.S.",
    "link": "https://www.pbs.org/newshour/politics/judge-bars-deportations-of-venezuelans-from-south-texas-under-18th-century-alien-enemies-act",
    "timestamp": "2025-05-01T16:56:24Z"
  },
  {
    "title": "Pam Bondi Claims Trump Saved 75% of Americans From a Fentanyl Overdose",
    "description": "\"Are you ready for this, media?\" the attorney general asked, but what followed was a heaping pile of horsecrap about a very serious subject.",
    "link": "https://gizmodo.com/pam-bondi-claims-trump-saved-75-of-americans-from-a-fentanyl-overdose-2000596896",
    "timestamp": "2025-05-01T16:55:54Z"
  },
  {
    "title": "Trump executive order will stand up presidential religious liberty commission",
    "description": "President Donald Trump is poised to sign an executive order establishing a presidential commission on religious liberty.",
    "link": "https://www.foxnews.com/politics/trump-executive-order-stand-up-presidential-religious-liberty-commission",
    "timestamp": "2025-05-01T16:54:44Z"
  },
  {
    "title": "Jamie Raskin, is there any wonder?",
    "description": "* Co-founder of the Institute for Policy Studies * Was associated with the Students for a Democratic Society in the 1960s Marcus Raskin was born April 30, 1934 in Milwaukee, Wisconsin, the second son of Russian Jewish immigrants. At age 16, he left home to st…",
    "link": "https://freerepublic.com/focus/f-chat/4314432/posts",
    "timestamp": "2025-05-01T16:53:48Z"
  },
  {
    "title": "Donald Trump Says Americans May 'Give Up Your Religion' if Taxes Go Up",
    "description": "The president used the National Day of Prayer event to again promise that tax-cut legislation would work its way through Congress.",
    "link": "https://www.newsweek.com/donald-trump-says-americans-may-give-your-religion-if-taxes-go-2066871",
    "timestamp": "2025-05-01T16:53:32Z"
  },
  {
    "title": "Next round of Iran-US nuclear talks postponed",
    "description": "The delay comes after Washington imposed new sanctions targeting Iran on Wednesday.",
    "link": "https://www.bbc.com/news/articles/cze1zpnl1eeo",
    "timestamp": "2025-05-01T16:53:29Z"
  },
  {
    "title": "Top Trump official ousted after chat group scandal: Reports",
    "description": "Donald Trump's national security advisor is to leave his post -- the first major departure of the president's new term -- after being embroiled in a scandal over a chat group leak, US media reported Thursday. Despite intense media speculation that Trump would…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-administration-releases-report-critical-of-youth-gender-care/articleshow/120799467.cms",
    "timestamp": "2025-05-01T16:52:34Z"
  },
  {
    "title": "Why major law firms are taking Trump to court",
    "description": "President Donald Trump has been targeting American law firms with executive orders that threaten to destroy them.",
    "link": "https://www.businessinsider.com/why-major-law-firms-are-taking-trump-to-court-2025-5",
    "timestamp": "2025-05-01T16:51:53Z"
  },
  {
    "title": "The U.S. set the global order after WWII. Trump has other plans",
    "description": "From the ashes of World War II, President Harry Truman helped create global institutions that have defined international order. President Trump is moving aggressively to scale back that U.S. role.",
    "link": "https://www.npr.org/2025/05/01/nx-s1-5369457/truman-trump-foreign-policy",
    "timestamp": "2025-05-01T16:51:25Z"
  },
  {
    "title": "White House issues warning to Dems promoting ‘barbaric’ child sex changes",
    "description": "'This administration is treating that as abuse'",
    "link": "https://www.wnd.com/2025/05/white-house-issues-warning-to-dems-promoting-barbaric-child-sex-changes/",
    "timestamp": "2025-05-01T16:51:20Z"
  },
  {
    "title": "US-Ukraine Minerals Deal: What We Know",
    "description": "Washington and Kyiv have signed a new minerals deal that will see the United States invest in Ukraine's rare earth and other deposits as it seeks to reduce military aid to the war-torn country.",
    "link": "https://www.ibtimes.com/us-ukraine-minerals-deal-what-we-know-3772174",
    "timestamp": "2025-05-01T16:51:20Z"
  },
  {
    "title": "MAGA Reacts to Mike Waltz's Firing",
    "description": "Laura Loomer celebrated the reported move, having put pressure on President Donald Trump.",
    "link": "https://www.newsweek.com/maga-reacts-mike-waltz-firing-national-security-council-2066861",
    "timestamp": "2025-05-01T16:51:18Z"
  },
  {
    "title": "Florida leads as state and local governments sign on for Trump’s mass deportations",
    "description": "The roster of local agencies that have joined the deportation effort has soared to more than 500.",
    "link": "https://www.bostonherald.com/2025/05/01/florida-immigration-arrests/",
    "timestamp": "2025-05-01T16:50:33Z"
  },
  {
    "title": "Trump: Right now China occupies Bagram",
    "description": "United States President Donald Trump lamented the loss of Bagram air base in Afghanistan, stating that China now \"occupies\" the former US base.More to come......",
    "link": "https://biztoc.com/x/ab08a6a0a4d69a1e",
    "timestamp": "2025-05-01T16:48:41Z"
  },
  {
    "title": "White House Accuses Amazon of 'Hostile and Political Action' Over Rumored Tariff Disclaimer",
    "description": "President Donald Trump called Amazon founder and executive chairman Jeff Bezos on Tuesday morning following reports that the company would display tariff charges beside retail prices on its e-commerce website. While Amazon denied these reports, press secretar…",
    "link": "https://biztoc.com/x/dcf2523a73ec8fe5",
    "timestamp": "2025-05-01T16:48:41Z"
  },
  {
    "title": "Nvidia CEO sends Washington 10-word message on AI chip change",
    "description": "One of the most pressing questions posed by artificial intelligence (AI) investors over the past few months may finally be answered soon.\nSince President Donald Trump took office, many people have wondered what AI policy will look like under his administratio…",
    "link": "https://biztoc.com/x/a24ae05233f35abb",
    "timestamp": "2025-05-01T16:48:39Z"
  },
  {
    "title": "Trump blames Biden for tariffs-linked contraction",
    "description": "What happened\nThe U.S. economy shrank 0.3% in the first three months of 2025, its first contraction in three years, the Commerce Department reported Wednesday. President Donald Trump repeatedly blamed his predecessor, Joe Biden, for the disappointing GDP numb…",
    "link": "https://biztoc.com/x/cf2e04f4f8cbdf6d",
    "timestamp": "2025-05-01T16:48:38Z"
  },
  {
    "title": "Judge rules Trump's Venezuela deportations unlawful",
    "description": "A United States district judge ruled on Thursday that deportations under the Alien Enemies Act of 1798, as invoked by the administration of President Donald Trump were unlawful, arguing the government...",
    "link": "https://biztoc.com/x/e4bf94398e34fc31",
    "timestamp": "2025-05-01T16:48:36Z"
  },
  {
    "title": "Conservative writer ​says Republicans are 'headed to a Carter-sized catastrophe'",
    "description": "A conservative columnist is drawing comparisons between President Donald Trump and former President Jimmy Carter, but not in a flattering manner. National Review columnist Dan McLaughlin began by explaining that he thinks Trump's 2024 win was summed up as \"ab…",
    "link": "https://www.rawstory.com/trump-economy-2671878306/",
    "timestamp": "2025-05-01T16:47:48Z"
  },
  {
    "title": "US-Ukraine minerals deal: what we know",
    "description": "Washington and Kyiv have signed a new minerals deal that will see the United States invest in Ukraine’s rare earth and other deposits as it seeks to reduce military aid to the war-torn country. The deal came together after US President Donald Trump demanded c…",
    "link": "https://www.digitaljournal.com/world/us-ukraine-minerals-deal-what-we-know/article",
    "timestamp": "2025-05-01T16:47:20Z"
  },
  {
    "title": "Tariff turmoil prompts cloudy forecasts from General Motors, Harley-Davidson for the year ahead",
    "description": "Uncertainty continues to hang over the latest round of financial results and forecasts for companies both big and small as they try to navigate a global trade system severely shaken by a stark shift in U.S. policy",
    "link": "https://abcnews.go.com/Business/wireStory/tariff-turmoil-prompts-cloudy-forecasts-general-motors-harley-121365761",
    "timestamp": "2025-05-01T16:46:52Z"
  },
  {
    "title": "Bybit-FXStreet report sees gold hitting $4,000 by end-2025",
    "description": "Bybit and FXStreet have released a joint report forecasting that gold could rise to $4,000 per ounce by the end of 2025. The report comes on the heels of gold reaching an all-time high of around $3,500 per ounce. The report also points to silver as a compelli…",
    "link": "https://coinjournal.net/news/bybit-fxstreet-report-sees-gold-hitting-4000-by-end-2025/",
    "timestamp": "2025-05-01T16:46:32Z"
  },
  {
    "title": "Trump blames Biden for tariffs-linked contraction",
    "description": "The US economy shrank 0.3% in the first three months of 2025, the Commerce Department reported",
    "link": "https://theweek.com/politics/gdp-report-trump-tariffs-economy",
    "timestamp": "2025-05-01T16:46:32Z"
  },
  {
    "title": "White House Accuses Amazon of 'Hostile and Political Action' Over Rumored Tariff Disclaimer",
    "description": "There's nothing \"hostile and political\" about informing the public of the negative consequences of poor economic policy.",
    "link": "https://reason.com/2025/05/01/white-house-accuses-amazon-of-hostile-and-political-action-over-rumored-tariff-disclaimer/",
    "timestamp": "2025-05-01T16:45:44Z"
  },
  {
    "title": "How To Fight Trump The New York Times Way: Speak Softly, For F*ck's Sake Put That Stick DOWN!",
    "description": "Times Editorial Board makes David Brooks sound like the SDS.",
    "link": "https://www.wonkette.com/p/how-to-fight-trump-the-new-york-times",
    "timestamp": "2025-05-01T16:45:32Z"
  },
  {
    "title": "Sex-Change Procedures for Minors Cause 'Irreversible' Damage for 'Very Weak Evidence of Benefit': HHS Report",
    "description": "The Department of Health and Human Services on Thursday released a comprehensive review warning that sex-change surgeries and interventions for minors carry \"significant risks\" but have \"very weak evidence of benefit.\"\nThe post Sex-Change Procedures for Minor…",
    "link": "https://freebeacon.com/latest-news/sex-change-procedures-for-minors-cause-irreversible-damage-for-very-weak-evidence-of-benefit-hhs-report/",
    "timestamp": "2025-05-01T16:45:00Z"
  },
  {
    "title": "Microsoft Is Raising The Price of Its Xbox Series Consoles, Games Will Hit $80 This Holiday, Some Gamers Are Falsely Blaming Nintendo",
    "description": "Gamers are blaming Nintendo, instead of the real culprit, Donald Trump, after Microsoft announced it is raising Xbox console prices.",
    "link": "https://hiphopwired.com/playlist/microsoft-raising-xbox-series-consoles-gamers-blame-nintendo/",
    "timestamp": "2025-05-01T16:44:36Z"
  },
  {
    "title": "‘That Is A Scary Number!’ CNN Analyst Rebuts Trump Rant About Dolls With Alarming Data Point",
    "description": "CNN Senior Political Analyst Mark Preston refuted President Donald Trump's messaging to consumers with a \"scary\" data point from a recent CNN poll.\nThe post ‘That Is A Scary Number!’ CNN Analyst Rebuts Trump Rant About Dolls With Alarming Data Point first app…",
    "link": "https://www.mediaite.com/news/that-is-a-scary-number-cnn-analyst-rebuts-trump-rant-about-dolls-with-alarming-data-point/",
    "timestamp": "2025-05-01T16:44:00Z"
  },
  {
    "title": "People with neoliberal views are less likely to support climate-friendly policies, research finds",
    "description": "Donald Trump won the US election on a campaign that included rolling back environmental laws. In the UK, Conservative party leader Kemi Badenoch has called the national net zero target \"impossible.\" And former prime minister Tony Blair has said the current ap…",
    "link": "https://phys.org/news/2025-05-people-neoliberal-views-climate-friendly.html",
    "timestamp": "2025-05-01T16:43:05Z"
  },
  {
    "title": "Trump is shifting cybersecurity to the states, but many aren’t prepared",
    "description": "From health care to courts, states and local communities are facing a rise in cyberthreats.",
    "link": "https://www.denverpost.com/2025/05/01/cybersecurity-to-states/",
    "timestamp": "2025-05-01T16:42:45Z"
  },
  {
    "title": "Trump is shifting cybersecurity to the states, but many aren’t prepared",
    "description": "From health care to courts, states and local communities are facing a rise in cyberthreats.",
    "link": "https://www.bostonherald.com/2025/05/01/cybersecurity-to-states/",
    "timestamp": "2025-05-01T16:42:45Z"
  },
  {
    "title": "Tariff turmoil prompts cloudy forecasts from General Motors, Harley-Davidson for the year ahead",
    "description": "NEW YORK (AP) — Uncertainty continues to hang over the latest round of financial results and forecasts for companies both big and small as they try to navigate a global trade system severely shaken by a shift in U.S. policy. Roughly half of the companies in t…",
    "link": "https://financialpost.com/pmn/tariff-turmoil-prompts-cloudy-forecasts-from-general-motors-harley-davidson-for-the-year-ahead",
    "timestamp": "2025-05-01T16:42:22Z"
  },
  {
    "title": "Jen Psaki Mocks Chuck Schumer’s ‘Very Strong’ Letter to Trump: ‘If That’s Not Going To Make You Shake In Your Boots…’",
    "description": "Jen Psaki joined Stephen Colbert in mocking Senate Minority Leader Chuck Schumer's (D-NY) \"very strong letter\" to President Donald Trump about Harvard.\nThe post Jen Psaki Mocks Chuck Schumer’s ‘Very Strong’ Letter to Trump: ‘If That’s Not Going To Make You Sh…",
    "link": "https://www.mediaite.com/tv/jen-psaki-mocks-chuck-schumers-very-strong-letter-to-trump-if-thats-not-going-to-make-you-shake-in-your-boots/",
    "timestamp": "2025-05-01T16:41:03Z"
  },
  {
    "title": "‘The View’: Whoopi Thinks Trump Is Tanking Economy Because He’s ‘Getting Even’ With Those Who Didn’t Support Him",
    "description": "\"I think he's angry at the country,\" the ABC host says\nThe post ‘The View’: Whoopi Thinks Trump Is Tanking Economy Because He’s ‘Getting Even’ With Those Who Didn’t Support Him appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-trump-economy-tanking-on-purpose/",
    "timestamp": "2025-05-01T16:40:15Z"
  },
  {
    "title": "Spin Master to reduce China production due to tariffs",
    "description": "Canadian toy manufacturer Spin Master Corp. is pleading to &#34save Santa's supply chain&#34 in the wake of Donald Trump's tariffs. Find out more",
    "link": "https://financialpost.com/news/retail-marketing/spin-master-reduce-china-production-tariffs",
    "timestamp": "2025-05-01T16:39:20Z"
  },
  {
    "title": "‘Save Santa’s supply chain’: Spin Master to reduce China production due to tariffs",
    "description": "TORONTO — Canadian toy manufacturer Spin Master Corp. is pleading to “save Santa’s supply chain” in the wake of U.S. President Donald Trump’s tariffs. The company announced Wednesday it was withdrawing its guidance for the remainder of the year due to “meanin…",
    "link": "https://financialpost.com/pmn/save-santas-supply-chain-spin-master-to-reduce-china-production-due-to-tariffs",
    "timestamp": "2025-05-01T16:39:20Z"
  },
  {
    "title": "Trump-appointed judge says president’s use of Alien Enemies Act is unlawful in first-of-its-kind ruling | CNN Politics",
    "description": "A Donald Trump-appointed federal judge in Texas ruled that the president unlawfully invoked the Alien Enemies Act and blocked the administration from quickly deporting some alleged members of a Venezuelan gang.",
    "link": "https://www.cnn.com/2025/05/01/politics/alien-enemies-act-trump-rodriguez-ruling",
    "timestamp": "2025-05-01T16:39:05Z"
  },
  {
    "title": "Shame: Bukele Cares More About Abrego Garcia’s Rights than Trump Does",
    "description": "Turns out\nthat El Salvador President Nayib Bukele, the self-styled “world’s coolest\ndictator,” had some basic lessons in dictatorship to learn at the feet of top\nbanana Donald Trump.\r\nLessons such\nas: always have contempt for anyone you deal with; anyone who …",
    "link": "https://newrepublic.com/article/194702/bukele-abrego-garcia-rights-trump",
    "timestamp": "2025-05-01T16:38:20Z"
  },
  {
    "title": "U.S. Congressman Pitches Crypto ATMs for Federal Government Buildings",
    "description": "A Texas congressman is asking the federal government to consider installing cryptocurrency ATMs in federal buildings as a way to help foster the pro-digital assets stance pushed by President Donald Trump.\nRepresentative Lance Gooden asked the chief of the Gen…",
    "link": "https://biztoc.com/x/ed03fc61ded06c8f",
    "timestamp": "2025-05-01T16:37:59Z"
  },
  {
    "title": "Enterprises need to prepare for DOJ data rule",
    "description": "Organizations must take steps to ensure compliance with emerging rules targeting foreign adversaries' access to U.S. citizens' sensitive personal information.",
    "link": "https://www.techtarget.com/searchcio/news/366623282/Enterprises-need-to-prepare-for-DOJ-data-rule",
    "timestamp": "2025-05-01T16:37:00Z"
  },
  {
    "title": "Asian American, Native Hawaiian and Pacific Islander Heritage Month has only grown in 5 decades",
    "description": "This year, the occasion is happening as President Trump has curtailed DEI initiatives in federal government.",
    "link": "https://www.bostonherald.com/2025/05/01/aapi-heritage-month/",
    "timestamp": "2025-05-01T16:36:41Z"
  },
  {
    "title": "Judge in Texas rules Trump's use of Alien Enemies Act for deportations 'exceeds the scope' of the law",
    "description": "Judge in Texas rules Trump's use of Alien Enemies Act for deportations 'exceeds the scope' of the lawgo.com",
    "link": "https://abcnews.go.com/US/judge-blocks-alien-enemies-act-deport-venezuelans-texas/story?id=121364022",
    "timestamp": "2025-05-01T16:35:47Z"
  },
  {
    "title": "'The View' Books a Big, Coveted Celebrity Interview: Joe & Jill Biden's First Sit Down, Post White House",
    "description": "The View has landed a big interview next week! The 46th president of the United States, Joe Biden, and Dr. Jill Biden, will make a joint appearance on the morning talk show on Thursday (May 8). They will be interviewed by the show’s co-hosts Whoopi Goldberg, …",
    "link": "https://www.justjared.com/2025/05/01/the-view-books-a-big-coveted-celebrity-interview-joe-jill-bidens-first-sit-down-post-white-house/",
    "timestamp": "2025-05-01T16:35:18Z"
  },
  {
    "title": "A Chinese state media post points to a softening in the US-China trade war",
    "description": "The post linked to state-run media said that the US had reached out through multiple channels hoping to discuss its tariff policy with Beijing.",
    "link": "https://www.abc.net.au/news/2025-05-02/us-china-tariff-negotiations-closer-weibo-social-media-post/105241824",
    "timestamp": "2025-05-01T16:35:04Z"
  },
  {
    "title": "‘That’s Part of the Religion’: Trump Goes to Bat For Lowering Taxes In Remarks on National Day of Prayer",
    "description": "'That's part of the religion,” Trump continued joking, adding, 'Because if your taxes go up 68 percent, you might give up your religion.'\nThe post ‘That’s Part of the Religion’: Trump Goes to Bat For Lowering Taxes In Remarks on National Day of Prayer first a…",
    "link": "https://www.mediaite.com/tv/thats-part-of-the-religion-trump-goes-to-bat-for-lowering-taxes-in-remarks-on-national-day-of-prayer/",
    "timestamp": "2025-05-01T16:35:02Z"
  },
  {
    "title": "Trump cannot use Alien Enemies Act to deport Venezuelans, judge rules (Reuters)",
    "description": "Reuters:\nTrump cannot use Alien Enemies Act to deport Venezuelans, judge rules  —  President Donald Trump's administration exceeded the scope of an 18th-century wartime law in using it to deport some Venezuelan migrants, a federal judge in Texas said on Thurs…",
    "link": "https://www.memeorandum.com/250501/p61",
    "timestamp": "2025-05-01T16:35:00Z"
  },
  {
    "title": "All about Mike Waltz, Trump's national security adviser who added journalist to Signal group chat",
    "description": "National Security Adviser Mike Waltz has left his post amid Signal Gate scandal. He is the first major official in the Donald Trump administration to quit White House when the President touted about his achievements in the first 100 days of office. A former U…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-all-about-mike-waltz-trumps-national-security-adviser-who-added-journalist-to-signal-group-chat/articleshow/120799326.cms",
    "timestamp": "2025-05-01T16:33:37Z"
  },
  {
    "title": "'Inviting a recession': Kamala Harris assails Trump over economy, democracy in return to stage - Politico",
    "description": "'Inviting a recession': Kamala Harris assails Trump over economy, democracy in return to stagePolitico Harris Returns to Political Life, Warning of a Constitutional CrisisThe New York Times White House reacts to Kamala Harris' scathing criticism of Trump in f…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177239451",
    "timestamp": "2025-05-01T16:33:28Z"
  }
]