[
  {
    "title": "US lifts sanctions on Belarusian potash, state media cite Trump envoy as saying",
    "description": "Dec 13 (Reuters) - The United States is lifting sanctions on Belarusian potash, Belarusian state media quoted President Donald Trump's envoy John Coale as saying after two days of talks in Minsk with President Alexander Lukashenko. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/us-lifts-sanctions-on-belarusian-potash-state-media-cite-trump-envoy-as-saying",
    "timestamp": "2025-12-13T11:53:00Z"
  },
  {
    "title": "Trump is whitewashing American history",
    "description": "The death of Viola Fletcher, the last survivor of the Tulsa Race Massacre, underscores what Trump is attacking",
    "link": "https://www.salon.com/2025/12/13/trump-is-whitewashing-black-american-history/",
    "timestamp": "2025-12-13T11:45:44Z"
  },
  {
    "title": "With Fed independence in crosshairs, will Supreme Court back Trump again?",
    "description": "Key risks for 2026: What could go wrong (and right) next year?\nBy Jan Wolfe\nWASHINGTON, Dec 13 (Reuters) - The U.S. Supreme Court’s conservative justices appear ready to endorse President Donald Trump’s power to fire a regulatory agency official despite job p…",
    "link": "https://biztoc.com/x/0efae2e5a3f50381",
    "timestamp": "2025-12-13T11:43:12Z"
  },
  {
    "title": "Four Thai soldiers killed as Cambodia conflict escalates",
    "description": "Four Thai soldiers were killed in the escalating Thailand Cambodia conflict as Bangkok denies a US-brokered truce, displacing nearly half a million people.\n\nRead More: https://punchng.com/four-thai-soldiers-killed-as-cambodia-conflict-escalates/",
    "link": "https://punchng.com/four-thai-soldiers-killed-as-cambodia-conflict-escalates/",
    "timestamp": "2025-12-13T11:39:22Z"
  },
  {
    "title": "Amid pressure from U.S., Zelenskyy says he's open to an election that might be impossible",
    "description": "When Volodymyr Zelenskyy last asked Ukrainians to vote for him, he was a political newbie, a former comedian eager to change his country and talk with Russia to end a protracted conflict",
    "link": "https://www.nbcnews.com/world/ukraine/pressure-zelenskyy-trump-election-war-rcna248611",
    "timestamp": "2025-12-13T11:39:22Z"
  },
  {
    "title": "Residents emerge in DR Congo’s tense Uvira after M23 rebel takeover",
    "description": "Al Jazeera gains exclusive access to Uvira where fighting has killed hundreds.",
    "link": "https://www.aljazeera.com/news/2025/12/13/residents-emerge-in-dr-congos-tense-uvira-after-m23-rebel-takeover",
    "timestamp": "2025-12-13T11:39:07Z"
  },
  {
    "title": "Hochul: Letting ACA Subsidies End 'Crippling the Healthcare Industry'",
    "description": "During an interview aired on Friday’s edition of “Power to the People with Darius Pridgen,” New York Gov. Kathy Hochul (D) argued that President Donald Trump is “crippling the healthcare industry” by not extending tax subsidies for Obamacare. Hochul said,\nThe…",
    "link": "https://www.breitbart.com/clips/2025/12/13/hochul-letting-aca-subsidies-end-crippling-the-healthcare-industry/",
    "timestamp": "2025-12-13T11:35:01Z"
  },
  {
    "title": "2 killed in Russia; Ukraine's energy infrastructure is targeted",
    "description": "Ukrainian President Volodymyr Zelenskyy said Russia had sent over 450 drones and 30 missiles into Ukraine overnight.",
    "link": "https://www.cbsnews.com/news/2-killed-in-russia-while-ukraines-energy-infrastructure-is-targeted-and-peace-talks-press-on/",
    "timestamp": "2025-12-13T11:33:26Z"
  },
  {
    "title": "'Peace is not far away' says Erdogan, returning from Putin meeting",
    "description": "ISTANBUL, Dec 13 (Reuters) - Turkish President Tayyip Erdogan, fresh from a meeting with Russia's Vladimir Putin, said he hopes to discuss a Ukraine-Russia peace plan with U.S. President Donald Trump, adding that \"peace is not far away\". Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/039peace-is-not-far-away039-says-erdogan-returning-from-putin-meeting",
    "timestamp": "2025-12-13T11:33:00Z"
  },
  {
    "title": "US, Ukraine to discuss ceasefire in Berlin ahead of European summit",
    "description": "BERLIN, Dec 13 (Reuters) - Germany will host U.S. and Ukrainian delegations over the weekend for talks on a ceasefire in Ukraine, ahead of a summit with European leaders and President Volodymyr Zelenskiy in Berlin on Monday, a German official said on Saturday…",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/us-ukraine-to-discuss-ceasefire-in-berlin-ahead-of-european-summit",
    "timestamp": "2025-12-13T11:31:00Z"
  },
  {
    "title": "Afghanistan’s tragedy: From Reagan’s “nation of heroes” to Trump’s “hellhole on Earth”",
    "description": "In the '80s, Afghans were \"freedom fighters.\" Today, they're despised terrorists. Both stories were made in America",
    "link": "https://www.salon.com/2025/12/13/afghanistans-tragedy-from-reagans-nation-of-heroes-to-trumps-hellhole-on-earth/",
    "timestamp": "2025-12-13T11:30:57Z"
  },
  {
    "title": "10 Weekend Reads",
    "description": "The weekend is here! Pour yourself a mug of Danish Blend coffee, grab a seat outside, and get ready for our longer-form weekend reads: • Once a Gamble in the Desert, Electric Grid Batteries Are Everywhere: An early grid battery was installed in the Atacama De…",
    "link": "https://ritholtz.com/2025/12/10-weekend-reads-70/",
    "timestamp": "2025-12-13T11:30:49Z"
  },
  {
    "title": "This ruthless cover-up leaves Trump’s most alarming ambitions exposed",
    "description": "Donald Trump recently told reporters he’d have “no problem”\r\n releasing video of US strikes off the Venezuelan coast where two survivors clinging to the shipwreck were shown no quarter\r\n — executions that violated federal law\r\n, the US Code on War Crimes\r\n, a…",
    "link": "https://www.rawstory.com/raw-investigates/pete-hegseth-2674394819/",
    "timestamp": "2025-12-13T11:30:01Z"
  },
  {
    "title": "How One Couple Lost Their Life Savings To A Fake Federal Investigation",
    "description": "Larry and Barbara Cook thought they were helping government agents. In the end, they found themselves victims of tax and Medicare gotchas, as well as the scamsters.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/12/13/how-one-couple-lost-their-life-savings-to-a-fake-federal-investigation/",
    "timestamp": "2025-12-13T11:30:00Z"
  },
  {
    "title": "Victor Davis Hanson: Impeach Hegseth? You Should Be Thanking Hegseth",
    "description": "On this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc dissect the effort to impeach Secretary of War... Read More\nThe post Victor Davis Hanson: Impeach Hegseth? You Should Be Thanking Hegseth appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/12/13/victor-davis-hanson-impeach-hegseth-you-should-be-thanking-hegseth/",
    "timestamp": "2025-12-13T11:30:00Z"
  },
  {
    "title": "Many immigrants' final legal step — citizenship — has become harder under Trump",
    "description": "Green card holders are among the most thoroughly vetted individuals in the nation’s immigration system, but citizenship is currently uncertain for many of them.",
    "link": "https://www.nbcnews.com/news/us-news/trump-citizenship-harder-immigrants-green-cards-rcna248917",
    "timestamp": "2025-12-13T11:30:00Z"
  },
  {
    "title": "Donald Trump, Bill Clinton, Prince Andrew Photos From Epstein's Estate Released; White House Reacts",
    "description": "Democratic members of the House Oversight Committee a selection of photographs on Friday from the estate of the late convicted sex offender Jeffrey Epstein, showing current President Donald Trump, former President Bill Clinton, and the former British royal An…",
    "link": "https://www.ndtvprofit.com/world/trump-clinton-andrew-photos-from-epsteins-estate-released-see-pics",
    "timestamp": "2025-12-13T11:23:55Z"
  },
  {
    "title": "Trump dismisses new photos with Epstein as 'no big deal'",
    "description": "US President Donald Trump has dismissed the release of new photos showing him alongside Jeffrey Epstein saying the images were \"no big deal\".",
    "link": "https://www.rte.ie/news/2025/1213/1548867-trump-dismisses-new-photos-with-epstein-as-no-big-deal/",
    "timestamp": "2025-12-13T11:20:27Z"
  },
  {
    "title": "Trump dismisses new photos with Epstein as 'no big deal'",
    "description": "US President Donald Trump has dismissed the release of new photos showing him alongside Jeffrey Epstein saying the images were \"no big deal\".",
    "link": "https://www.rte.ie/news/2025/1213/1548867-trump-epstein-photos/",
    "timestamp": "2025-12-13T11:20:27Z"
  },
  {
    "title": "With Fed independence in crosshairs, will Supreme Court back Trump again?",
    "description": "The US Supreme Court is leaning towards empowering the President to dismiss regulatory agency heads. However, the court shows hesitation regarding similar authority over the Federal Reserve. This distinction stems from the Fed's unique structure and historica…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/with-fed-independence-in-crosshairs-will-supreme-court-back-trump-again/articleshow/125948632.cms",
    "timestamp": "2025-12-13T11:10:42Z"
  },
  {
    "title": "'Miracle on Ice': Trump honours legendary US ice hockey team",
    "description": "United States President Donald Trump has received members of the nation's ice hockey team that famously won the gold medal at the 1980 Winter Olympics in Lake Placid in what is remembered as \"The Miracle on Ice. \" The US team comprising of amateurs and colleg…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:251213-99-914107/",
    "timestamp": "2025-12-13T11:10:39Z"
  },
  {
    "title": "Inside Honduras’ election chaos: Infighting, delays, and broken systems",
    "description": "TEGUCIGALPA, Dec 13 (Reuters) - Weeks before Honduras' November 30 presidential election, a test run exposed deep flaws in the vote-counting system: only 36% of practice ballots were processed, according to electoral council member Marlon Ochoa. That warning …",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/inside-honduras-election-chaos-infighting-delays-and-broken-systems",
    "timestamp": "2025-12-13T11:10:00Z"
  },
  {
    "title": "What you should know about cholesterol and how it really impacts your health",
    "description": "Experts say not all cholesterol is bad; in fact, your body needs it for various functions",
    "link": "https://www.the-independent.com/life-style/health-and-families/high-cholesterol-symptoms-lower-good-level-signs-b2883870.html",
    "timestamp": "2025-12-13T11:09:10Z"
  },
  {
    "title": "Erdoğan warns Black Sea must not become confrontation zone amid Ukraine attacks",
    "description": "President Recep Tayyip Erdoğan warned on Saturday that the Black Sea should not become an \"area of confrontation\" between Russia and Ukraine, following recent strikes that highlight risks to regional navigation.",
    "link": "https://www.hurriyetdailynews.com/erdogan-warns-black-sea-must-not-become-confrontation-zone-amid-ukraine-attacks-216772",
    "timestamp": "2025-12-13T11:01:24Z"
  },
  {
    "title": "Trump is still trying to free Tina Peters. She should stay in a Colorado jail",
    "description": "Tina Peters, the former Mesa County, Colorado, clerk turned Big Lie crusader, is the only person serving a prison sentence — nine years — for crimes tied to President Donald Trump’s false claims of a stolen 2020 election. The MAGA faithful are furious, callin…",
    "link": "https://biztoc.com/x/a2a94e4b13bd57d2",
    "timestamp": "2025-12-13T11:01:13Z"
  },
  {
    "title": "Donald and Melania Trump Have Themselves an Awkward Little Christmas",
    "description": "Trump and Melania have themselves an awkward little Christmas. Melania shared an unflattering video from the Congressional Ball after Donald reminisced about her décor debacles and admitted he’s clueless about her 2026 project.",
    "link": "http://nymag.com/intelligencer/article/trump-melania-awkward-christmas-walker-video.html",
    "timestamp": "2025-12-13T11:00:44Z"
  },
  {
    "title": "The Worst Ways RFK Jr. Has Harmed Public Health This Year",
    "description": "The return of measles, weakening vaccines, and the complete destruction of the CDC are just a few of Kennedy's ignoble accomplishments in 2025.",
    "link": "https://gizmodo.com/the-worst-ways-rfk-jr-has-harmed-public-health-this-year-2000698509",
    "timestamp": "2025-12-13T11:00:22Z"
  },
  {
    "title": "Shakedown: Trump DOJ pressured lawyers to “find” evidence that UCLA illegally tolerated antisemitism",
    "description": "Trump admin demanded $1 billion in fines and changes that had nothing to do with antisemitism.",
    "link": "https://www.salon.com/2025/12/13/shakedown-trump-doj-pressured-lawyers-to-find-evidence-that-ucla-illegally-tolerated-antisemitism-partner/",
    "timestamp": "2025-12-13T11:00:07Z"
  },
  {
    "title": "How Not to Plan for War",
    "description": "The goal of Trump’s Venezuela squeeze is clear, but how to get there isn’t.",
    "link": "https://www.theatlantic.com/national-security/2025/12/trump-venezuela-strategy-war-maduro/685225/",
    "timestamp": "2025-12-13T11:00:00Z"
  },
  {
    "title": "New US border checks could involve scanning your last five years of social media history– here's what you need to know",
    "description": "The US government plans to check visitors’ social media posts and potentially bar them from entry under new proposed rules.",
    "link": "https://www.techradar.com/computing/social-media/new-us-border-checks-could-involve-scanning-your-last-five-years-of-social-media-history-heres-what-you-need-to-know",
    "timestamp": "2025-12-13T11:00:00Z"
  },
  {
    "title": "Why is Donald Trump at the Army-Navy game? President attending rivalry for sixth time",
    "description": "President Donald Trump is in attendance at the Army-Navy football game. Here's a look at why Trump is at the annual rivalry",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_040d8a5b-9fb6-49ef-bc74-88fa229229ea",
    "timestamp": "2025-12-13T10:52:19Z"
  },
  {
    "title": "To Fully Appreciate the Brilliant New Knives Out, It Helps to Understand the Subgenres It’s Riffing On",
    "description": "Rian Johnson pays a hat tip to the locked-room mystery in Wake Up Dead Man.",
    "link": "https://slate.com/culture/2025/12/knives-out-3-wake-up-dead-man-movie-netflix-locked-room-mystery.html",
    "timestamp": "2025-12-13T10:50:00Z"
  },
  {
    "title": "Trump teases land strikes in Venezuela ‘soon’",
    "description": "US President Donald Trump has promised land strikes against alleged Venezuela-linked drug operations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629412-trump-teases-land-strikes-venezuela/",
    "timestamp": "2025-12-13T10:45:54Z"
  },
  {
    "title": "Navy reports to Hegseth on punishment for Mark Kelly over 'illegal orders' video",
    "description": "The U.S. Navy has submitted recommendations on potential punishments, if any, for Sen. Mark Kelly over his participation in a video reminding troops they have a duty to refuse illegal orders.",
    "link": "https://www.ketv.com/article/navy-report-hegseth-mark-kelly-illegal-orders/69702396",
    "timestamp": "2025-12-13T10:45:12Z"
  },
  {
    "title": "US plan to end Russia's war in Ukraine: Where it stands now",
    "description": "There has been a flurry of diplomatic activity between Washington, Kyiv, Moscow and European capitals to discuss a plan to end the war. But US President Donald Trump says he's tired of talking — he wants action.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-plan-to-end-russias-war-in-ukraine-where-it-stands-now/articleshow/125948324.cms",
    "timestamp": "2025-12-13T10:40:51Z"
  },
  {
    "title": "Navy reports to Hegseth on punishment for Mark Kelly over 'illegal orders' video",
    "description": "The U.S. Navy has submitted recommendations on potential punishments, if any, for Sen. Mark Kelly over his participation in a video reminding troops they have a duty to refuse illegal orders.",
    "link": "https://www.wmur.com/article/navy-report-hegseth-mark-kelly-illegal-orders/69702396",
    "timestamp": "2025-12-13T10:35:17Z"
  },
  {
    "title": "Navy reports to Hegseth on punishment for Mark Kelly over 'illegal orders' video",
    "description": "The U.S. Navy has submitted recommendations on potential punishments, if any, for Sen. Mark Kelly over his participation in a video reminding troops they have a duty to refuse illegal orders.",
    "link": "https://www.kcra.com/article/navy-report-hegseth-mark-kelly-illegal-orders/69702396",
    "timestamp": "2025-12-13T10:35:03Z"
  },
  {
    "title": "US envoy to meet Zelensky, Europe leaders in Berlin this weekend",
    "description": "US President Donald Trump’s special envoy will meet with Volodymyr Zelensky and other European leaders in Berlin this weekend, the White House said, as Washington presses for a plan to end Russia’s war with Ukraine.\nTrump has been stepping up pressure on Kyiv…",
    "link": "https://biztoc.com/x/3b3f1367c6067274",
    "timestamp": "2025-12-13T10:30:56Z"
  },
  {
    "title": "US envoy to meet Zelensky, Europe leaders in Berlin this weekend",
    "description": "Meeting with European leaders comes amid US-led push for Ukraine to cede territory",
    "link": "https://www.euractiv.com/news/us-envoy-to-meet-zelensky-europe-leaders-in-berlin-this-weekend/",
    "timestamp": "2025-12-13T10:24:06Z"
  },
  {
    "title": "Thailand says 4 soldiers killed in Cambodia conflict, denies Trump truce claim",
    "description": "Bangkok said Cambodian forces killed four Thai soldiers on Saturday, after the prime minister denied US President Donald Trump's claim that a truce was agreed to end days of deadly fighting. At least 24 people have been killed this week, including four Thai s…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thailand-says-4-soldiers-killed-in-cambodia-conflict-denies-trump-truce-claim/articleshow/125948172.cms",
    "timestamp": "2025-12-13T10:23:05Z"
  },
  {
    "title": "US Will Help with Security Guarantees for Ukraine — Trump",
    "description": "The United States will take part in Saturday's meeting with representatives of Europe and Ukraine if there is a good chance for a peace deal between Russia and Ukraine, US President Donald Trump said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251212-sputnik06.htm",
    "timestamp": "2025-12-13T10:22:02Z"
  },
  {
    "title": "Hegseth, Senior Leaders Attend Spacecom Relocation Ceremony",
    "description": "Secretary of War Pete Hegseth joined numerous members of Congress and a handful of senior military officials today to mark the official relocation of U.S. Space Command from Peterson Space Force Base, Colorado, to Redstone Arsenal, Alabama.",
    "link": "https://www.globalsecurity.org/space/library/news/2025/space-251212-dodnews01.htm",
    "timestamp": "2025-12-13T10:22:02Z"
  },
  {
    "title": "Hungary's Szijjarto Accuses NATO Chief of Undermining Ukraine Peace Talks",
    "description": "NATO Secretary General Mark Rutte is inflaming tensions and undermining peace talks on Ukraine, and Hungary, as a NATO member, rejects his statements about the need to prepare for a war with Russia, Hungarian Foreign Minister Peter Szijjarto said on Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251212-sputnik02.htm",
    "timestamp": "2025-12-13T10:22:02Z"
  },
  {
    "title": "Trump plans ‘C5’ group consisting of  India, China, Russia, Japan and US",
    "description": "Kathmandu, Dec 13: US President Donald Trump is preparing to form a new global forum called Core Five (C5) with […]\nThe post Trump plans ‘C5’ group consisting of  India, China, Russia, Japan and US appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/12/13/trump-plans-c5-group-consisting-of-india-china-russia-japan-and-us/",
    "timestamp": "2025-12-13T10:15:00Z"
  },
  {
    "title": "U.S. No Vote on Anti-Israel UNGA Resolution",
    "description": "\"Today, the United Nations General Assembly yet again passed an unserious and biased resolution, demonstrating the continued prevalence of anti-Israel bias over substantive diplomacy at the organization.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-state01.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Russia Rejects Zelenskyy Donbas Referendum Proposal Ahead Of High Stakes Weekend For Diplomacy",
    "description": "Russia has rejected a proposal to hold a referendum to let Ukrainians decide on giving up territory in the eastern Donbas region, much of which Moscow claims to control, highlighting a key sticking point as negotiators head to Berlin for high stakes talks ami…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251212-rferl02.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "'Act of state piracy': Iran blasts illegal US seizure of Venezuelan oil tanker",
    "description": "Iran has condemned the US Navy's attack on a commercial vessel carrying Venezuelan crude oil off the coast of the South American country as an \"act of state piracy,\" warning about the consequences of such coercive measures.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-presstv05.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "US slaps fresh sanctions on Venezuela amid escalated tensions",
    "description": "The United States has announced new sanctions on Venezuela, mounting more pressure on the energy-rich Latin American nation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-presstv04.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Thailand, Cambodia have agreed to cease all shooting effective Friday evening: Trump",
    "description": "U.S. President Donald Trump said Friday on social media that Thailand and Cambodia have agreed to cease all shooting effective Friday evening.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251213-pdo03.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Israeli airstrikes hit southern Lebanon amid ongoing ceasefire violations",
    "description": "Israeli warplanes have carried out a wave of airstrikes across southern Lebanon in the latest near-daily attacks that have further strained a year-old ceasefire between the occupying regime and the Hezbollah resistance movement.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251213-presstv01.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Ranking Member Shaheen, Colleagues Introduce Legislation to Restore and Safeguard U.S. Support for UNFPA",
    "description": "Today, U.S. Senators Jeanne Shaheen (D-NH), Ranking Member of the Senate Foreign Relations Committee, Tim Kaine (D-VA), Peter Welch (D-VT), John Hickenlooper (D-CO), Jacky Rosen (D-NV), Patty Murray (D-WA), Chris Van Hollen (D-MD), Tammy Duckworth (D-IL), Cor…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-sfrc01.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "ICC With Dutch Support Preparing Measures in Case of New US Sanctions",
    "description": "The International Criminal Court (ICC), with the support of the Dutch government, is developing measures in case of new US sanctions, Dutch Foreign Minister David van Weel said on Friday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-sputnik01.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Venezuelan Parliament Votes to Repeal Law Endorsing ICC's Rome Statute",
    "description": "The Venezuelan parliament said it voted to repeal the law endorsing the Rome Statute of the International Criminal Court (ICC).",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-sputnik02.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Interim Gaza Government Should Link Back to Palestinian Authority - PA Deputy Minister",
    "description": "A technocratic interim government for administering the Gaza Strip should be directly linked to the cabinet of the Palestinian Authority (PA), and the issue is being actively discussed among mediators involved in the Israeli-Palestinian settlement, Palestinia…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251212-sputnik03.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "'Get out, thief. Your mask has fallen': Maduro denounces US for targeting Venezuela's oil",
    "description": "Venezuelan President Nicolas Maduro has denounced the United States for using allegations of drug trafficking as a pretext to seize his country's natural resources, particularly oil.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251213-presstv02.htm",
    "timestamp": "2025-12-13T10:14:11Z"
  },
  {
    "title": "Donald Trump’s Latino Voter Crisis",
    "description": "President Donald Trump appears to be losing the support of Latino voters, polls show.\nAccording to a series of recent polls and election results, the president risks losing voters he won in the 2024 presidential election, a development that could prove costly…",
    "link": "https://biztoc.com/x/ce85f8498ad4b11d",
    "timestamp": "2025-12-13T10:10:21Z"
  },
  {
    "title": "Pinched by higher prices, many Trump voters say: Don't blame the president",
    "description": "By Julia Harte Dec 13 - When Ron Dailey goes out to eat, he is shocked by prices on the menu.",
    "link": "https://www.yahoo.com/news/articles/pinched-higher-prices-many-trump-100226748.html",
    "timestamp": "2025-12-13T10:09:29Z"
  },
  {
    "title": "DOJ sues Hawaii over voter list access | Honolulu Star-Advertiser",
    "description": "The U.S. Justice Department is suing Hawaii and three other states after they refused President Donald Trump’s demands to turn over voter registration lists.",
    "link": "https://www.staradvertiser.com/2025/12/13/hawaii-news/doj-sues-hawaii-over-voter-list-access/",
    "timestamp": "2025-12-13T10:08:12Z"
  },
  {
    "title": "Harris thanks supporters for 'standing up for democracy' at annual DNC meeting",
    "description": "Vice President Kamala Harris thanked supporters for defending democracy at the DNC's winter meeting addressing the affordability crisis and outlining the party's future vision.",
    "link": "https://www.foxnews.com/politics/harris-thanks-supporters-standing-up-democracy-dnc-meeting",
    "timestamp": "2025-12-13T10:06:48Z"
  },
  {
    "title": "China’s love affair with cheap coal power means European industry can’t compete",
    "description": "Europe has realized that renewable energy alone cannot keep its industrial base intact or its voters happy",
    "link": "https://www.theglobeandmail.com/business/commentary/article-china-cheap-coal-power-renewable-energy-europe/",
    "timestamp": "2025-12-13T10:03:04Z"
  },
  {
    "title": "Lucas: President Trump should crash Patriots party",
    "description": "President Donald Trump should go to the New England Patriots big game Sunday.",
    "link": "https://www.bostonherald.com/2025/12/13/lucas-president-trump-should-crash-patriots-party/",
    "timestamp": "2025-12-13T10:02:15Z"
  },
  {
    "title": "Trump Is Angry at Americans for Not Appreciating His Greatness",
    "description": "Trump is angry at Americans for not appreciating his greatness. The president is fuming about his low approval ratings, which he seems to view as ingratitude given all his accomplishments.",
    "link": "http://nymag.com/intelligencer/article/donald-trump-angry-at-americans-opinion-polls-approval.html",
    "timestamp": "2025-12-13T10:00:15Z"
  },
  {
    "title": "Trump attacks on political opponents spur a surge of threats, NBC News review finds",
    "description": "President Donald Trump’s heated rhetoric against his perceived political enemies has resulted in a blizzard of threats against at least 22 officials on both sides of the aisle in recent weeks, according to an NBC News tally",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-attacks-political-opponents-spur-surge-threats-nbc-news-review-f-rcna247201",
    "timestamp": "2025-12-13T10:00:00Z"
  },
  {
    "title": "Lawfare Archive: President-elect Trump's National Security Appointments",
    "description": "From November 16, 2024: Editor-in-Chief Benjamin Wittes sat down with Lawfare Senior Editors Scott Anderson, Alan Rozenshtein, and Quinta Jurecic and Executive Director of the Institute for Constitutional Advocacy and Protection Mary McCord about Donald Trump…",
    "link": "https://shows.acast.com/lawfare/episodes/lawfare-archive-president-elect-trumps-national-security-app",
    "timestamp": "2025-12-13T10:00:00Z"
  },
  {
    "title": "Democrats tout projects funded by a bill they voted against",
    "description": "Democrats voted against federal funding to end the shutdown and then touted the money delivered home to their districts.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-tout-projects-government-shutdown-funding-bill-opposed-rcna248441",
    "timestamp": "2025-12-13T10:00:00Z"
  },
  {
    "title": "DOJ weighs novel federal hate crimes case against Charlie Kirk's alleged killer",
    "description": "The Justice Department is weighing how to bring federal charges against Charlie Kirk's alleged assassin, Tyler Robinson.",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-weighs-novel-federal-hate-crimes-case-charlie-kirks-alleged-killer-rcna248549",
    "timestamp": "2025-12-13T10:00:00Z"
  },
  {
    "title": "House GOP unveils narrow health care package with key deadline looming",
    "description": "House Republicans unveiled a narrow health care package on Friday that does not extend soon-to-expire enhanced Affordable Care Act subsidies — the latest sign that Congress is unlikely to avert",
    "link": "https://www.wpsdlocal6.com/news/house-gop-unveils-narrow-health-care-package-with-key-deadline-looming/article_f284fab3-3d31-5678-8c01-3a64201f5fae.html",
    "timestamp": "2025-12-13T09:56:16Z"
  },
  {
    "title": "U.S. envoy Steve Witkoff to hold talks with Zelenskyy and European leaders in Berlin",
    "description": "United States special envoy Steve Witkoff is on his way to Berlin, Germany, to meet with Ukrainian President Volodymyr Zelenskyy and European leaders for peace negotiations aimed at ending the war in Ukraine, a senior White House official told NBC News",
    "link": "https://www.nbcnews.com/world/ukraine/us-envoy-steve-witkoff-hold-talks-zelenskyy-european-leaders-berlin-rcna248978",
    "timestamp": "2025-12-13T09:51:27Z"
  },
  {
    "title": "2 killed in Russia while Ukraine's energy infrastructure is targeted as peace talks press on",
    "description": "A drone attack in Russia's Saratov region has killed at least two people and damaged a residential building",
    "link": "https://abcnews.go.com/International/wireStory/2-killed-russia-ukraines-energy-infrastructure-targeted-peace-128367782",
    "timestamp": "2025-12-13T09:41:46Z"
  },
  {
    "title": "China narrows AI gap with US 3 years after initial ChatGPT shock",
    "description": "US start-up OpenAI's launch of ChatGPT on November 30 three years ago sent China's technology industry scrambling to get up to speed on the latest artificial...",
    "link": "https://finance.yahoo.com/news/china-narrows-ai-gap-us-093000477.html",
    "timestamp": "2025-12-13T09:30:00Z"
  },
  {
    "title": "Malaysia urges Thailand, Cambodia to cease military action along border",
    "description": "PETALING JAYA: Prime Minister Datuk Seri Anwar Ibrahim urges both Thailand and Cambodia to cease all forms of hostilities, effective Saturday (Dec 13) night. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/12/13/malaysia-urges-thailand-cambodia-to-cease-military-action-along-border",
    "timestamp": "2025-12-13T09:24:00Z"
  },
  {
    "title": "2 killed in Russia while Ukraine's energy infrastructure is targeted as peace talks press on",
    "description": "Drone attacks in Russia's Saratov region killed at least two people and damaged infrastructure, while Ukraine experienced widespread power outages following Russian strikes on energy facilities. These incidents occur amidst ongoing U.S.-led peace talks, which…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/2-killed-in-russia-while-ukraines-energy-infrastructure-is-targeted-as-peace-talks-press-on/articleshow/125947531.cms",
    "timestamp": "2025-12-13T09:19:15Z"
  },
  {
    "title": "Next presidential jet will arrive a bit earlier than projected, Air Force says",
    "description": "Boeing's first VC-25B Air Force One jet is now slated to enter service in mid-2028.",
    "link": "https://www.defenseone.com/business/2025/12/next-presidential-jet-will-arrive-bit-earlier-projected-air-force-says/410152/",
    "timestamp": "2025-12-13T09:14:17Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "Status Yellow warning, Irish Air Corps shortfall, and Irish Euromillions winner. This morning’s top stories.",
    "link": "https://www.thejournal.ie/the-9-at-9-22-6902705-Dec2025/",
    "timestamp": "2025-12-13T09:07:53Z"
  },
  {
    "title": "Today in History: December 13, Thousands protest police killings of Black men",
    "description": "Thousands of protesters marched in New York, Washington and other U.S. cities to call attention to the killing of unarmed Black men by white police officers.",
    "link": "https://www.denverpost.com/2025/12/13/today-in-history-december-13-thousands-protest-police-killings-of-black-men/",
    "timestamp": "2025-12-13T09:00:39Z"
  },
  {
    "title": "Today in History: December 13, Thousands protest police killings of Black men",
    "description": "Thousands of protesters marched in New York, Washington and other U.S. cities to call attention to the killing of unarmed Black men by white police officers.",
    "link": "https://www.bostonherald.com/2025/12/13/today-in-history-december-13-thousands-protest-police-killings-of-black-men/",
    "timestamp": "2025-12-13T09:00:39Z"
  },
  {
    "title": "Historic rains and flooding trigger dramatic rescues in Washington state",
    "description": "When Eddie Wicks and his wife went to bed in their house next to the Snoqualmie River on a Washington state farm known for its sunflower mazes and Christmas trees, they weren’t too worried about the flooding heading their way.",
    "link": "https://nypost.com/2025/12/13/us-news/washington-state-flooding-triggers-dramatic-rescues-after-atmospheric-river/",
    "timestamp": "2025-12-13T08:51:52Z"
  },
  {
    "title": "Deal or no deal? The inside story of the battle for Warner Bros",
    "description": "As Paramount, with close ties to the Trump administration, entered the bidding, experts predict any merger will ‘raise red flags’ among regulators\nOver the first 10 months of his second presidency, Donald Trump has not hidden his desire to control the US medi…",
    "link": "https://biztoc.com/x/b8137cf0d0349396",
    "timestamp": "2025-12-13T08:47:31Z"
  },
  {
    "title": "Kevin O'Leary Flags Tariffs, Food Prices And Housing As Trump Starts Selling His Economic Record For The Midterms: 'I Don't Shill For Politicians'",
    "description": "On Friday, investor Kevin O'Leary weighed on President Donald Trump's economic messaging, arguing the president has begun an unusually early campaign-style push ahead of the 2026 midterm elections.\nO'Leary Says Trump Is Campaigning Early\nIn a post on X sharin…",
    "link": "https://biztoc.com/x/c456e56853f71779",
    "timestamp": "2025-12-13T08:47:28Z"
  },
  {
    "title": "Green Stocks Are Big Winners as Tech Boom Drives Energy Demand",
    "description": "It was supposed to be a glum year for green stocks as President Donald Trump pushed his Big Oil agenda. Instead, the sector is booming as artificial intelligence powers massive demand for all kinds of energy.",
    "link": "https://financialpost.com/pmn/business-pmn/green-stocks-are-big-winners-as-tech-boom-drives-energy-demand",
    "timestamp": "2025-12-13T08:46:45Z"
  },
  {
    "title": "DHS to focus on arresting illegal immigrants with serious offenses amid negative polling on ICE raids: report",
    "description": "DHS is shifting immigration enforcement away from mass raids and focusing its efforts more on arresting convicted criminals amid negative polling concerns,",
    "link": "https://www.foxnews.com/politics/dhs-focus-arresting-illegal-immigrants-serious-offenses-amid-negative-polling-ice-raids-report",
    "timestamp": "2025-12-13T08:43:53Z"
  },
  {
    "title": "US envoy to meet Zelenskyy, Europe leaders in Berlin this weekend",
    "description": "KYIV: US President Donald Trump's special envoy will meet with Volodymyr Zelenskyy and other European leaders in Berlin this weekend, the White House said, as Washington presses for a plan to end Russia's war with Ukraine.Trump has been stepping up pressure o…",
    "link": "https://www.channelnewsasia.com/world/us-envoy-witkoff-meet-zelenskyy-europe-leaders-berlin-5580371",
    "timestamp": "2025-12-13T08:37:00Z"
  },
  {
    "title": "Colombia’s ELN rebels prepare for battle amid Trump ‘intervention’ threat",
    "description": "ELN conducts military drills, orders civilians indoors, as Trump warns drug-producing nations face potential attack.",
    "link": "https://www.aljazeera.com/news/2025/12/13/colombias-eln-rebels-prepare-for-battle-amid-trump-intervention-threat",
    "timestamp": "2025-12-13T08:31:22Z"
  },
  {
    "title": "What’s at Stake in Trump’s Executive Order Aiming to Curb State-Level AI Regulation",
    "description": "Fortunately, an executive order won't stop states from restricting AI. But expect the Administration to try other routes.",
    "link": "https://www.nakedcapitalism.com/2025/12/whats-at-stake-in-trumps-executive-order-aiming-to-curb-state-level-ai-regulation.html",
    "timestamp": "2025-12-13T08:30:02Z"
  },
  {
    "title": "Green stocks are big winners as tech boom drives energy demand",
    "description": "Instead, the sector is booming as artificial intelligence powers massive demand for all kinds of energy.  The S&P Global Clean Energy Transition Index has...",
    "link": "https://finance.yahoo.com/news/green-stocks-big-winners-tech-083000564.html",
    "timestamp": "2025-12-13T08:30:00Z"
  },
  {
    "title": "Late Night Open Thread: … ‘Power without Responsibility, the Prerogative of the Harlot… ‘",
    "description": "Yikes! \"Olivia Nuzzi’s ‘Canto’ Sells Just 1,200 Print Copies In First Week\" Mary Whitfill Roeloffs for @forbes.com [image or embed] — Zach Everson (@zacheverson.com) December 11, 2025 at 10:14 AM For the record (it’s usually abbreviated), the full quote was a…",
    "link": "https://balloon-juice.com/2025/12/13/late-night-open-thread-power-without-responsibility-the-prerogative-of-the-harlot/",
    "timestamp": "2025-12-13T08:22:45Z"
  },
  {
    "title": "US envoy to meet Zelensky and European leaders in Germany to discuss peace plan",
    "description": "Donald Trump has been stepping up pressure on Kyiv to reach an agreement.",
    "link": "https://www.thejournal.ie/us-envoy-meet-ukraine-6902699-Dec2025/",
    "timestamp": "2025-12-13T08:10:45Z"
  },
  {
    "title": "ICYMI: the week's 7 biggest tech stories from testing Android XR glasses to a revolutionary smart ring",
    "description": "The top tech news stories from Disney, Paramount, DC, Android, and more for December 12, 2025.",
    "link": "https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-testing-android-xr-glasses-to-a-revolutionary-smart-ring",
    "timestamp": "2025-12-13T08:00:00Z"
  },
  {
    "title": "Thailand strikes Cambodia despite Trump truce claims",
    "description": "Thailand says it is continuing strikes on its neighbor even though the US president says both sides agreed a ceasefire. The violence comes amid a decades-old territorial conflict.",
    "link": "https://www.dw.com/en/thailand-strikes-cambodia-despite-trump-truce-claims/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Cambodia shuts borders with Thailand as fighting continues",
    "description": "The ongoing violence between Thailand and Cambodia comes despite claims by the US president that the two sides had agreed a ceasefire.",
    "link": "https://www.dw.com/en/cambodia-shuts-borders-with-thailand-as-fighting-continues/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Cambodia shuts borders with Thailand amid ongoing fighting",
    "description": "The violence between Thailand and Cambodia comes despite claims by US President Donald Trump that the two sides had agreed a ceasefire.",
    "link": "https://www.dw.com/en/cambodia-shuts-borders-with-thailand-amid-ongoing-fighting/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
    "description": "Fighting is continuing along the Thailand-Cambodia border despite U.S. President Donald Trump's claim of a ceasefire agreement",
    "link": "https://abcnews.go.com/International/wireStory/fighting-rages-thai-cambodian-border-despite-trumps-ceasefire-128367781",
    "timestamp": "2025-12-13T07:42:41Z"
  },
  {
    "title": "US envoy Witkoff to meet Zelenskiy and European leaders in Berlin for latest Ukraine talks",
    "description": "Witkoff has led negotiations ⁠with Ukraine and Russia regarding ⁠a US peace proposal",
    "link": "https://www.irishtimes.com/world/europe/2025/12/13/us-envoy-witkoff-to-meet-zelenskiy-and-european-leaders-in-berlin-for-latest-ukraine-talks/",
    "timestamp": "2025-12-13T07:41:45Z"
  }
]