[
  {
    "title": "This year was the beginning of the end for American exceptionalism in markets, top strategist says",
    "description": "Investors will start to shift away from the US dollar first in currency hedges before selling US assets, Lazard's Ron Temple said.",
    "link": "https://www.businessinsider.com/market-outlook-american-exceptionalism-us-stocks-treasury-dollar-2025-12",
    "timestamp": "2025-12-16T16:47:13Z"
  },
  {
    "title": "Even Fox News Turns on Trump Over Disgusting Rob Reiner Comments",
    "description": "Fox News is tuning out on Donald Trump.Practically no one, save the president’s most loyal acolytes, have defended his recent comments about legendary filmmaker Rob Reiner. Trump has said—multiple times—that Reiner would not have been murdered if he had suppo…",
    "link": "https://newrepublic.com/post/204487/fox-news-donald-trump-rob-reiner-comments",
    "timestamp": "2025-12-16T16:47:03Z"
  },
  {
    "title": "Trump Chief Of Staff Susie Wiles Slams AG Pam Bondi Over Handling Of Epstein Files: 'Completely Whiffed'",
    "description": "Susie Wiles, President Donald Trump's chief of staff, slammed Attorney General Pam Bondi over her handling of the Epstein Files, saying she \"completely whiffed on appreciating that that was the very targeted group that cared about this.\"",
    "link": "https://www.ibtimes.com/trump-chief-staff-susie-wiles-slams-ag-pam-bondi-over-handling-epstein-files-completely-whiffed-3792837",
    "timestamp": "2025-12-16T16:46:20Z"
  },
  {
    "title": "Trump secures deal with Korea Zinc to build rare earths processing facility in Tennessee — facility expected to have annual output of 540,000 tons of gallium, germanium, indium, and other resources",
    "description": "U.S. President Donald Trump secures an investment from a South Korean firm to build a rare earth refinery in Tennessee.",
    "link": "https://www.tomshardware.com/tech-industry/trump-secures-deal-with-korea-zinc-to-build-rare-earths-processing-facility-in-tennessee-facility-expected-to-have-annual-output-of-540-000-tons-of-gallium-germanium-indium-and-other-resources",
    "timestamp": "2025-12-16T16:45:57Z"
  },
  {
    "title": "BBC declares it will fight the US President but should it?",
    "description": "As President Trump follows through on his threat to sue the BBC, what are the options for the corporation?",
    "link": "https://www.bbc.com/news/articles/cx2przgvdyeo",
    "timestamp": "2025-12-16T16:45:34Z"
  },
  {
    "title": "Ford's EV retreat highlights industry dilemma: Build for the US or the world?",
    "description": "In a significant shake-up, Ford has announced the slashing of thousands of electric vehicle positions, resulting in a staggering $19.5 billion loss on their EV assets. CEO Jim Farley revealed that several unprofitable models are being phased out, highlighting…",
    "link": "https://economictimes.indiatimes.com/news/international/business/fords-ev-retreat-highlights-industry-dilemma-build-for-the-us-or-the-world/articleshow/126012382.cms",
    "timestamp": "2025-12-16T16:45:08Z"
  },
  {
    "title": "What Trump's reclassification of pot and CBD could mean for seniors, research and stocks",
    "description": "Reclassification to a Schedule III drug and possible Medicare coverage for pot could unlock new investment from pharmaceutical companies.",
    "link": "https://www.cnbc.com/2025/12/16/trump-medicare-pot-seniors-marijuana-reclassification.html",
    "timestamp": "2025-12-16T16:45:01Z"
  },
  {
    "title": "Cannabis Rescheduling: Separating Fact from Fiction",
    "description": "The following primer seeks to provide clarity to frequently asked questions surrounding cannabis rescheduling and its policy implications. \nThe post Cannabis Rescheduling: Separating Fact from Fiction appeared first on NORML.",
    "link": "https://norml.org/blog/2025/12/16/cannabis-rescheduling-separating-fact-from-fiction/",
    "timestamp": "2025-12-16T16:44:47Z"
  },
  {
    "title": "Crowd Surrounds ICE Agents During Enforcement Operation In Minneapolis",
    "description": "United States Immigration and Customs Enforcement (ICE) agents carrying out an operation in Minneapolis on Monday found themselves surrounded by anti-ICE rioters, according to video posted by local media. ICE is surging into the Minneapolis area to target ill…",
    "link": "https://freerepublic.com/focus/f-news/4357666/posts",
    "timestamp": "2025-12-16T16:44:18Z"
  },
  {
    "title": "U.N. Human Rights Watchdogs Blast Columbia for Using Immigration Status to Suppress Students’ Pro-Palestine Speech",
    "description": "The U.N. experts wrote blistering letters to five American universities about their crackdowns on Gaza protests.\nThe post U.N. Human Rights Watchdogs Blast Columbia for Using Immigration Status to Suppress Students’ Pro-Palestine Speech appeared first on The …",
    "link": "https://theintercept.com/2025/12/16/un-human-rights-universities-columbia-gaza-protests/",
    "timestamp": "2025-12-16T16:44:01Z"
  },
  {
    "title": "Healthcare Under Trump Branded 'In Crisis' by Record Number of Americans",
    "description": "A new West Health–Gallup survey shows a record share of Americans now describe the US healthcare system as being in crisis, driven by rising costs and growing concern over access and affordability during Donald Trump's presidency.",
    "link": "https://www.ibtimes.com/healthcare-under-trump-branded-crisis-record-number-americans-3792835",
    "timestamp": "2025-12-16T16:43:51Z"
  },
  {
    "title": "\"You disgusting, vile, egomaniac loser.\" Jack White calls out Donald Trump for his bizarre and insensitive take on the killing of Spinal Tap director Rob Reiner and his wife Michele Singer",
    "description": "Shame on you Trump\"",
    "link": "https://www.loudersound.com/bands-artists/jack-white-calls-out-donald-trump-for-rob-reiner-comments",
    "timestamp": "2025-12-16T16:43:01Z"
  },
  {
    "title": "Mick Foley Parts Ways with WWE Over Trump; Rob Reiner Post Final Straw",
    "description": "Professional wrestling icon and WWE Hall of Famer Mick Foley has never been a fan of Donald Trump, and he's been making it known that he hasn't been too happy with the close relationship the WWE has with the POTUS and fellow Hall of Famer. But it seems that T…",
    "link": "https://bleedingcool.com/tv/mick-foley-parts-ways-with-wwe-over-trump-rob-reiner-post-final-straw/",
    "timestamp": "2025-12-16T16:39:09Z"
  },
  {
    "title": "“Twisting the meaning of words”: Trump declares fentanyl a “weapon of mass destruction”",
    "description": "The executive order comes as strikes on alleged drug boats in the continue",
    "link": "https://www.salon.com/2025/12/16/twisting-the-meaning-of-words-trump-declares-fentanyl-a-weapon-of-mass-destruction/",
    "timestamp": "2025-12-16T16:37:39Z"
  },
  {
    "title": "BBC Responds to Trump Lawsuit: \"We Will Be Defending This Case\"",
    "description": "UPDATED: After Donald Trump's legal team filed a lawsuit against the media company over how it edited his words in a 2024 documentary, the BBC responded by making it clear that they will be \"defending\" themselves in the matter. \"As we have made clear previous…",
    "link": "https://bleedingcool.com/tv/bbc-responds-to-trump-lawsuit-we-will-be-defending-this-case/",
    "timestamp": "2025-12-16T16:37:07Z"
  },
  {
    "title": "Trump-backed American Bitcoin edges into top 20 corporate BTC holders as stock slips to new lows",
    "description": "The firm, backed by Eric and Donald Trump Jr., continues to trade at a premium to peers despite a sharp and ongoing share price drawdown.",
    "link": "https://biztoc.com/x/d7bd25ce84962853",
    "timestamp": "2025-12-16T16:37:01Z"
  },
  {
    "title": "Marco Rubio Said Nobody Died Because of USAID Cuts. New Evidence Proves He Lied.",
    "description": "Makes you wonder, what other falsehoods is the Incredible Shrinking Secretary of State hiding?",
    "link": "https://www.esquire.com/news-politics/politics/a69749639/marco-rubio-us-aid-cuts/",
    "timestamp": "2025-12-16T16:37:00Z"
  },
  {
    "title": "Ex-Trump Adviser Spells Out How President’s 'Indefensible' Rob Reiner Post Could Impact Midterms",
    "description": "“It’s a terrible tragedy that they’ve suffered here, and the president’s tweets — his Truth Social post — is indefensible by anybody,\" said David Urban.",
    "link": "https://www.huffpost.com/entry/trump-david-urban-rob-reiner-gop-post_n_694172e6e4b01ca4c38796b7",
    "timestamp": "2025-12-16T16:36:59Z"
  },
  {
    "title": "Why Trump just launched a $10 billion defamation lawsuit against the BBC",
    "description": "President Donald Trump filed a lawsuit Monday seeking $10 billion in damages from the BBC, accusing the British broadcaster of defamation as well as deceptive and unfair trade practices.The 33-page lawsuit accuses the BBC of broadcasting a “false, defamatory,…",
    "link": "https://biztoc.com/x/22cdfc630eb909ab",
    "timestamp": "2025-12-16T16:36:28Z"
  },
  {
    "title": "FBI doubted probable cause for Mar-a-Lago raid but pushed forward amid pressure from Biden DOJ, emails reveal",
    "description": "EXCLUSIVE: The FBI did not believe it had probable cause to raid President Donald Trump’s Mar-a-Lago home in 2022, but moved forward amid pressure from the Biden Justice Department.",
    "link": "https://www.foxnews.com/politics/fbi-doubted-probable-cause-mar-a-lago-raid-pushed-forward-amid-pressure-from-biden-doj-emails-reveal",
    "timestamp": "2025-12-16T16:35:51Z"
  },
  {
    "title": "AI future: Big Tech faces key House vote on reforming permit process",
    "description": "Backers say the SPEED Act is crucial to helping the U.S. beat out China and other global competitors for leadership in AI.",
    "link": "https://www.cnbc.com/2025/12/16/ai-congres-permitting-speed-act.html",
    "timestamp": "2025-12-16T16:34:30Z"
  },
  {
    "title": "Oh Look, The NYT Solved The Mystery Of How Jeffrey Epstein Got His Money!",
    "description": "Short version: scamming and charm.",
    "link": "https://www.wonkette.com/p/oh-look-the-nyt-solved-the-mystery",
    "timestamp": "2025-12-16T16:33:52Z"
  },
  {
    "title": "Ukraine Says Underwater Drones Hit Submarine, but Moscow Denies Damage",
    "description": "Ukraine said on Monday it hit and disabled a Russian missile-carrying submarine docked at a Black Sea naval base using underwater sea drones for the first time, but Moscow denied the strike caused any damage.",
    "link": "https://gcaptain.com/ukraine-says-underwater-drones-hit-submarine-but-moscow-denies-damage/",
    "timestamp": "2025-12-16T16:32:54Z"
  },
  {
    "title": "MAGA Mike Turns Into Olympic Runner When Asked About Trump's Appalling Remarks",
    "description": "House Speaker Mike Johnson gave a pathetic response to Donald Trump’s appalling remarks following the horrific death of legendary Hollywood director Rob Reiner and his wife, Michele. \nCNN’s Manu Raju's question to Johnson should have been an easy one to answe…",
    "link": "https://crooksandliars.com/2025/12/maga-mike-turns-olympic-runner-when-asked",
    "timestamp": "2025-12-16T16:32:34Z"
  },
  {
    "title": "McIlroy and Scheffler lead Golf Channel Games as golf revives the silly season",
    "description": "It turns out there's still a place for what amounts to the “silly season” in golf. The “Golf Channel Games” makes its debut Wednesday night at Trump National in West Palm Beach, Florida, featuring teams led by Scottie Scheffler and Rory McIlroy, the two bigge…",
    "link": "https://sports.yahoo.com/articles/mcilroy-scheffler-lead-golf-channel-163232250.html",
    "timestamp": "2025-12-16T16:32:32Z"
  },
  {
    "title": "White House chief of staff Susie Wiles says Trump 'will go for it' when there's an 'opportunity' for retribution",
    "description": "WASHINGTON — White House chief of staff Susie Wiles said the administration's accusations against New York Attorney General Letitia James \"might\" be \"retribution,\" and \"when there’s an opportunity\" for President Donald Trump to take retribution, \"he will go f…",
    "link": "https://www.nbcnews.com/politics/white-house/trump-susie-wiles-vanity-fair-james-comey-letitia-james-retribution-rcna249466",
    "timestamp": "2025-12-16T16:32:26Z"
  },
  {
    "title": "David Nasaw’s Unsparing Tour of America’s World War II and Its Aftermath",
    "description": "Richard Parker\n\n\n\nA gimlet-eyed and honest accounting of the war’s hidden costs that still affect us today.\r\n\n\r\n\n\nThe post David Nasaw’s Unsparing Tour of America’s World War II and Its Aftermath appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/world-war-fascism-democracy-military/",
    "timestamp": "2025-12-16T16:30:39Z"
  },
  {
    "title": "Former Trump Adviser Eviscerates President's Shocking Response to Rob Reiner Murder (Will Neal/The Daily Beast)",
    "description": "Will Neal / The Daily Beast:\nFormer Trump Adviser Eviscerates President's Shocking Response to Rob Reiner Murder  —  WORD OF ADVICE  —  A strategist who helped the president win the 2016 election offers a warning about his “indefensible” post ahead of midterm…",
    "link": "https://www.memeorandum.com/251216/p54",
    "timestamp": "2025-12-16T16:30:00Z"
  },
  {
    "title": "Congress Aims to Turbocharge the U.S. Development Finance Corporation",
    "description": "The agency will be empowered to issue hundreds of billions of dollars in new loans to foreign countries.",
    "link": "http://foreignpolicy.com/2025/12/16/ndaa-dfc-reauthorization-development-finance-corporation-congress-loans/",
    "timestamp": "2025-12-16T16:29:08Z"
  },
  {
    "title": "Donald Trump’s Remarks on Rob Reiner Are Next-Level Degradation",
    "description": "On a weekend of terrible violent events, you would not expect a President of the United States to make matters even worse. But, of course, he did.",
    "link": "https://www.newyorker.com/news/the-lede/donald-trumps-remarks-on-the-death-of-rob-reiner-are-next-level-degradation",
    "timestamp": "2025-12-16T16:28:21Z"
  },
  {
    "title": "Block this threat to public lands from heading the BLM (Letters)",
    "description": "Democrats and Republicans in the U.S. Senate, who care about our public lands and wildlife, must draw a red line ... that not one piece of legislation will pass the Senate until the nomination of this public lands pillager is reversed! -- Jessica Talbot, Arva…",
    "link": "https://www.denverpost.com/2025/12/16/block-this-threat-to-public-lands-from-heading-the-blm-letters/",
    "timestamp": "2025-12-16T16:27:57Z"
  },
  {
    "title": "Trump Economy 'Stalling Out' as Unemployment Rate Hits Highest Level in 4 Years",
    "description": "Federal data belatedly released Tuesday shows that the US unemployment rate rose to the highest level in four years last month as President Donald Trump's administration continues its assault on the government's workforce and American corporations lay off wor…",
    "link": "https://www.commondreams.org/news/trump-unemployment-rate",
    "timestamp": "2025-12-16T16:27:45Z"
  },
  {
    "title": "Killings of Rob Reiner and his wife stun Hollywood as decision on charges for their son looms",
    "description": "LA police said they would present a case on Tuesday to prosecutors for potential charges.",
    "link": "https://www.bostonherald.com/2025/12/16/rob-reiner-death-investigation/",
    "timestamp": "2025-12-16T16:26:55Z"
  },
  {
    "title": "Killings of Rob Reiner and his wife stun Hollywood as decision on charges for their son looms",
    "description": "LA police said they would present a case on Tuesday to prosecutors for potential charges.",
    "link": "https://www.denverpost.com/2025/12/16/rob-reiner-death-investigation/",
    "timestamp": "2025-12-16T16:26:55Z"
  },
  {
    "title": "Data guru startled as 'ballooning' numbers show GOP 'on track to lose'",
    "description": "Republicans are on the wrong track for holding onto their congressional majorities, according to a new data analysis.CNN's Harry Enten crunched the numbers on a series of new polling that found Americans are concerned about the direction the country is headed…",
    "link": "https://www.rawstory.com/trump-wrong-track-numbers/",
    "timestamp": "2025-12-16T16:26:09Z"
  },
  {
    "title": "Trump signs executive order to classify fentanyl as weapon of mass destruction",
    "description": "President Donald Trump signed an executive order classifying \"illicit fentanyl and its core precursor chemicals\" as weapons of mass destruction",
    "link": "https://www.kcra.com/article/fentanyl-national-security-order/69745097",
    "timestamp": "2025-12-16T16:25:56Z"
  },
  {
    "title": "Analysis-Ford’s EV retreat highlights industry dilemma: Build for the US or the world?",
    "description": "DETROIT, Dec 16 (Reuters) - Ford CEO Jim Farley walked through Ford’s Michigan design studio Monday afternoon, reflecting on how he was about to wipe out...",
    "link": "https://finance.yahoo.com/news/analysis-ford-ev-retreat-highlights-162550325.html",
    "timestamp": "2025-12-16T16:25:50Z"
  },
  {
    "title": "Trump Effect: Christmas Day Gas Prices Expected to Drop to Lowest Level in 5 Years",
    "description": "President Trump's policies are delivering what is expected to be the lowest national average Christmas Day gas price for Americans since 2020.\nThe post Trump Effect: Christmas Day Gas Prices Expected to Drop to Lowest Level in 5 Years appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/12/16/trump-effect-christmas-day-gas-prices-expected-to-drop-lowest-level-5-years/",
    "timestamp": "2025-12-16T16:23:32Z"
  },
  {
    "title": "Activist Jimmy Lai's family in Canada 'not surprised' but saddened by Hong Kong conviction",
    "description": "Judges in a Hong Kong court found pro-democracy media mogul Jimmy Lai guilty of conspiracy to collude with foreign forces to endanger national security and conspiracy to publish seditious material on Monday. His family in Niagara-on-the-Lake, Ont., and the U.…",
    "link": "https://www.cbc.ca/news/canada/hamilton/jimmy-lai-niagara-hotelier-convicted-9.7016698",
    "timestamp": "2025-12-16T16:23:14Z"
  },
  {
    "title": "‘Bombshell’: Biden officials knew Mar-a-Lago raid against Trump was illegal, but did it anyway",
    "description": "FBI's SWAT-style attack on Florida home claimed to be in pursuit of government papers",
    "link": "https://www.wnd.com/2025/12/bombshell-biden-officials-knew-mar-lago-raid-against/",
    "timestamp": "2025-12-16T16:21:18Z"
  },
  {
    "title": "Media Wield Lefty Anti-Trump Group Agitprop, Claim Holiday Gift Prices Are Up 26%",
    "description": "The left-wing dark money behemoth Arabella Advisors may have just dissolved, but that hasn’t stopped outlets from spewing its anti-Trump propaganda whenever they get the chance. Take this headline: \"Tis the Season for Price Hikes: Popular Holiday Gifts Climb …",
    "link": "https://freerepublic.com/focus/f-bloggers/4357661/posts",
    "timestamp": "2025-12-16T16:19:45Z"
  },
  {
    "title": "Jimmy Fallon Spots Donald Trump’s ‘Weird’ Way Of Invoking Jesus For Christmas",
    "description": "The “Tonight Show” host explained how Trump got people thinking of the true meaning of the holiday.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-donald-trump-sweet-baby-jesus_n_69416655e4b06cf6877f0854",
    "timestamp": "2025-12-16T16:17:35Z"
  },
  {
    "title": "What could’ve been Google’s worst year turned into one of its best",
    "description": "2025 could have been a pretty disastrous year for Google. The company came in knowing it had three major legal battles to fight, increasing competition in the burgeoning AI market, and a new US president to adapt to. It looked possible - perhaps likely - that…",
    "link": "https://www.theverge.com/report/840856/google-end-of-year-recap-lawsuits-antitrust-ai-gemini-epic",
    "timestamp": "2025-12-16T16:16:46Z"
  },
  {
    "title": "WATCH LIVE: Vance delivers remarks in Allentown, PA touting Trump’s economic agenda",
    "description": "The unemployment rate rose to 4.6%, highest since 2021. Both the October and November job creation numbers, released Tuesday by the Labor Department, came in late because of the 43-day federal government shutdown.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-vance-delivers-remarks-in-allentown-pa-touting-trumps-economic-agenda",
    "timestamp": "2025-12-16T16:16:26Z"
  },
  {
    "title": "Zelenskyy says U.S.-negotiated proposals to end the war in Ukraine could be presented to Russia within days",
    "description": "Zelenskyy reiterated that Kyiv won't recognize Moscow's control over any part of the Donbas.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-says-u-s-negotiated-proposals-to-end-the-war-in-ukraine-could-be-presented-to-russia-within-days",
    "timestamp": "2025-12-16T16:15:26Z"
  },
  {
    "title": "Trump signs executive order to classify fentanyl as weapon of mass destruction",
    "description": "President Donald Trump signed an executive order classifying \"illicit fentanyl and its core precursor chemicals\" as weapons of mass destruction",
    "link": "https://www.wisn.com/article/fentanyl-national-security-order/69745097",
    "timestamp": "2025-12-16T16:14:51Z"
  },
  {
    "title": "Ford to scale back electric vehicle plans, taking $19.5bn hit",
    "description": "Ford to scale back electric vehicle plans, taking $19.5bn hit\nFord is backing away from plans to manufacture large electric vehicles, the US carmaker said on Monday, citing lacklustre demand and recent regulatory changes under US President Donald Trump.\nThe c…",
    "link": "https://biztoc.com/x/49a7c1137862c253",
    "timestamp": "2025-12-16T16:14:46Z"
  },
  {
    "title": "Top Trump aide suggests boat strikes aim to topple Venezuela’s Maduro",
    "description": "White House's Susie wiles appears to contradict the official narrative portraying the attacks as an antidrug campaign.",
    "link": "https://www.aljazeera.com/news/2025/12/16/top-trump-aide-suggests-boat-strikes-aim-to-topple-venezuelas-maduro",
    "timestamp": "2025-12-16T16:14:10Z"
  },
  {
    "title": "Kennedy urges GOP to restart spending battle amid soaring cost of living, warns against wasting majority",
    "description": "Congressional Republicans have another two shots at budget reconciliation, the tricky, grueling process they used to pass President Donald Trump's \"big, beautiful bill,\" earlier this year.",
    "link": "https://www.foxnews.com/politics/kennedy-urges-gop-restart-spending-battle-amid-soaring-cost-living-warns-against-wasting-majority",
    "timestamp": "2025-12-16T16:12:23Z"
  },
  {
    "title": "Rob Reiner RIP. Here Is What He Believed.",
    "description": "https://www.yahoo.com/entertainment/rob-reiner-says-maga-scum-175908345.html “Now that America has elected a Convicted Felon with Authoritarian proclivities, I fear that Democracy’s return won’t be any time soon\" Rob Reiner calls Trump supporters \"MAGA scum\" …",
    "link": "https://freerepublic.com/focus/f-news/4357659/posts",
    "timestamp": "2025-12-16T16:11:02Z"
  },
  {
    "title": "Trump, 79, Told to Hand Over His Medical Records (Leigh Kimmins/The Daily Beast)",
    "description": "Leigh Kimmins / The Daily Beast:\nTrump, 79, Told to Hand Over His Medical Records  —  BIG REVEAL  —  The president's revenge tour against the “fake news media” is coming back to bite him.  —  President Donald Trump is facing a bombshell demand to turn over hi…",
    "link": "https://www.memeorandum.com/251216/p48",
    "timestamp": "2025-12-16T16:10:01Z"
  },
  {
    "title": "James Woods praises 'patriot' Rob Reiner, slams insults of slain director as 'infuriating'",
    "description": "Actor and noted Hollywood conservative James Woods fought back tears and paid tribute to Rob Reiner on Monday night, calling out the \"infuriating and distasteful\" insults being hurled at the slain director",
    "link": "https://www.nbcnews.com/news/us-news/james-woods-praises-patriot-rob-reiner-slams-insults-slain-director-in-rcna249484",
    "timestamp": "2025-12-16T16:08:03Z"
  },
  {
    "title": "The Obamas Were Supposed to See Rob Reiner and Michele Singer the Day They Were Killed",
    "description": "\"Unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever want to know,\" Michele Obama said on Jimmy Kimmel Live!",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/obamas-see-rob-reiner-michele-singer-day-killing-1235484944/",
    "timestamp": "2025-12-16T16:06:34Z"
  },
  {
    "title": "Obamas planned to see Reiners the night they were killed, says ex-US first lady",
    "description": "Michelle Obama says she and husband Barack Obama were due to see director Rob Reiner and his photographer wife Michele Reiner the night they were killed.",
    "link": "https://news.sky.com/story/obamas-planned-to-see-reiners-the-night-they-were-killed-says-ex-us-first-lady-13484461",
    "timestamp": "2025-12-16T16:05:00Z"
  },
  {
    "title": "The US gained 64,000 jobs in November but lost 105,000 in October; unemployment rate at 4.6%",
    "description": "The unemployment rate rose to its highest since 2021.",
    "link": "https://www.bostonherald.com/2025/12/16/us-jobs-report/",
    "timestamp": "2025-12-16T16:04:54Z"
  },
  {
    "title": "Trump Tower Belgrade: Kushner scraps Serbia hotel plan",
    "description": "An investment firm linked to Jared Kushner has abandoned a planned redevelopment in Belgrade. The decision follows protests, legal action, and growing anger over the removal of heritage status for the former army site.",
    "link": "https://www.dw.com/en/trump-tower-belgrade-kushner-scraps-serbia-hotel-plan/a-75185712",
    "timestamp": "2025-12-16T16:04:00Z"
  },
  {
    "title": "Too eager for the spotlight, FBI’s Patel keeps making the same embarrassing mistake",
    "description": "On Saturday afternoon, as much of the country was learning about the deadly shooting at Brown University, Donald Trump used his social media platform to offer the public an update. The president wrote, “I have been briefed on the shooting that took place at B…",
    "link": "https://biztoc.com/x/71fcb7ea4e6953b7",
    "timestamp": "2025-12-16T16:03:30Z"
  },
  {
    "title": "Class Vs. Crass: Donald Trump’s Repulsive Reaction To Rob And Michele Reiner’s Murder Draws Outrage, Highlights Obamas’ Decency",
    "description": "Trump's callous response to the tragic murder of Rob & Michele Reiner shocks Hollywood & sparks outrage from GOP leaders.\nThe post Class Vs. Crass: Donald Trump’s Repulsive Reaction To Rob And Michele Reiner’s Murder Draws Outrage, Highlights Obamas’ Decency …",
    "link": "https://bossip.com/4189957/donald-trumps-reaction-to-rob-and-michele-reiners-murder/",
    "timestamp": "2025-12-16T16:03:30Z"
  },
  {
    "title": "Nolte: President Trump’s Rob Reiner Statement Made a Valuable Point",
    "description": "President Trump’s Truth Social post about the murder of Rob Reiner has all the usual suspects beside themselves (their favorite position), but there’s a great point in the President’s words that everyone appears to be missing.\nThe post Nolte: President Trump’…",
    "link": "https://www.breitbart.com/politics/2025/12/16/nolte-president-trumps-rob-reiner-statement-made-a-valuable-point/",
    "timestamp": "2025-12-16T16:03:17Z"
  },
  {
    "title": "Susie Wiles’ Vanity Fair Interview Draw Attention For Candid Trump Remarks",
    "description": "White House Chief of Staff Susie Wiles made a series of unusually blunt remarks about President Donald Trump and senior administration figures in interviews published by Vanity Fair.\nIn more than ten interviews conducted over the past year, Wiles described Tr…",
    "link": "https://biztoc.com/x/54cc9a1665eae86d",
    "timestamp": "2025-12-16T16:03:15Z"
  },
  {
    "title": "SNL Season 51: Live From New York, It's Saturday Night…AI?",
    "description": "When you hear that there's buzz rumbling out of a recent edition of NBC's Saturday Night Live, you hope it's for something like the \"Beavis and Butt-Head\" sketch or Melissa McCarthy cleaning the passenger window of a car with her breasts in anger. You don't w…",
    "link": "https://bleedingcool.com/tv/snl-season-51-live-from-new-york-its-saturday-night-ai/",
    "timestamp": "2025-12-16T16:02:07Z"
  },
  {
    "title": "Ukraine peace deal could be presented to Russia within days: Zelenskyy",
    "description": "Marathon talks between the US and Ukraine led to \"not perfect\" but \"very workable\" framework that could bring to an end Russia's near four-year-old invasion, the Ukrainian president says.",
    "link": "https://www.abc.net.au/news/2025-12-17/ukraine-war-wrap-deal-could-be-presented-to-russia-in-days/106151590",
    "timestamp": "2025-12-16T16:02:04Z"
  },
  {
    "title": "U.S. Wargames Maduro’s Fall From Power",
    "description": "The United States has wargamed Venezuela ruler Nicolas Maduro's fall from power, and none of the scenarios are \"good\" for Venezuelan civilians. All of the wargames ended in violence and bloody power struggles.",
    "link": "https://www.shtfplan.com/headline-news/u-s-wargames-maduros-fall-from-power",
    "timestamp": "2025-12-16T16:00:49Z"
  },
  {
    "title": "Republicans Are Splitting Over Israel. Will Democrats Take Advantage?",
    "description": "A new poll shows a growing divide among Republicans, especially under 45, on U.S. support for Israel. Democrats have a chance to pick up their votes.\nThe post Republicans Are Splitting Over Israel. Will Democrats Take Advantage? appeared first on The Intercep…",
    "link": "https://theintercept.com/2025/12/16/aipac-israel-republicans-democrats-midterms-trump/",
    "timestamp": "2025-12-16T16:00:24Z"
  },
  {
    "title": "Trump Says Murder of Reiners Was All about Trump",
    "description": "Trump, being Trump, turns everything into a story about him. When the news first came out that Hollywood icon Rob Reiner and his wife Michelle were murdered in their home in Los Angeles, Trump posted a callous, cruel comment about their deaths. He wrote the f…",
    "link": "https://dianeravitch.net/2025/12/16/188704/",
    "timestamp": "2025-12-16T16:00:00Z"
  },
  {
    "title": "BBC may allow adverts for the first time in plans being considered by British government",
    "description": "Britain's century-old BBC broadcaster could break with tradition to carry some advertising or be available on subscription under proposals being considered by the government to alter the current funding model of a universal licence fee.",
    "link": "https://www.independent.ie/world-news/britain/bbc-may-allow-adverts-for-the-first-time-in-plans-being-considered-by-british-government/a1119214227.html",
    "timestamp": "2025-12-16T15:59:55Z"
  },
  {
    "title": "Trump pardon will free Tina Peters because he 'can interpret' Constitution: Mike Lindell",
    "description": "MyPillow CEO Mike Lindell, a Republican candidate for Minnesota governor, predicted that Colorado election-denier Tina Peters would be freed from prison by arguing that President Donald Trump could pardon state charges.Lindell made the claim during an intervi…",
    "link": "https://www.rawstory.com/trump-mike-lindell-2674403817/",
    "timestamp": "2025-12-16T15:59:00Z"
  },
  {
    "title": "Nick Reiner hotel room blood stains matched with Rob and Michele? Full explainer on hotel findings, arrest and Obama reaction",
    "description": "Nick Reiner hotel room blood stains matched with Rob and Michele is at the center of a homicide investigation. Police examined a Santa Monica hotel room after Rob and Michele Reiner were found dead. Nick Reiner was arrested. Barack and Michelle Obama also rea…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nick-reiner-hotel-room-blood-stains-matched-with-rob-and-michele-full-explainer-on-hotel-findings-arrest-and-obama-reaction-tmz-report-the-pierside-santa-monica-hotel-brentwood-home-conan-obriens-christmas-party-argument-los-angeles-police-department-homicide/articleshow/126009445.cms",
    "timestamp": "2025-12-16T15:58:31Z"
  },
  {
    "title": "Senators grill Trump officials on US alleged drug boat strikes",
    "description": "Donald Trump’s top national security officials faced a grilling from senators Tuesday on US strikes against alleged drug boats in the Caribbean and Pacific — operations that have raised alarms about escalating military force near Venezuela. The classified bri…",
    "link": "https://www.digitaljournal.com/world/senators-grill-trump-officials-on-us-alleged-drug-boat-strikes/article",
    "timestamp": "2025-12-16T15:57:20Z"
  },
  {
    "title": "Donald Trump Jr. Engaged To Bettina Anderson",
    "description": "Donald Trump Jr. announced his engagement December 15, giving the Trump family another reason to celebrate this holiday season.",
    "link": "https://dailycaller.com/2025/12/16/white-house-donald-trump-jr-engaged-bettina-anderson-marriage-wedding/",
    "timestamp": "2025-12-16T15:56:47Z"
  },
  {
    "title": "Barack & Michelle Obama's Relationship With Rob Reiner Before Death",
    "description": "Barack & Michelle Obama's Relationship With Rob Reiner Before Deathstylecaster.com",
    "link": "https://stylecaster.com/entertainment/celebrity-news/1234870653/obama-rob-reiner/",
    "timestamp": "2025-12-16T15:54:18Z"
  },
  {
    "title": "'Weak and pathetic': Trump puts blame on Gov. Polis as Colorado rejects Tina Peters pardon claim",
    "description": "COLORADO SPRINGS, Colo. (KRDO) – President Donald Trump is escalating his fight with Colorado leaders over the fact that former Mesa County Clerk Tina",
    "link": "https://krdo.com/news/2025/12/16/weak-and-pathetic-pres-trump-puts-blame-on-gov-polis-as-colorado-rejects-tina-peters-pardon/",
    "timestamp": "2025-12-16T15:53:34Z"
  },
  {
    "title": "Michelle Obama Rejects Trump Labeling Late Friends Michele and Rob Reiner as ‘Deranged or Crazed’ | Video",
    "description": "\"Unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever want to know,\" the former first lady tells Jimmy Kimmel\nThe post Michelle Obama Rejects Trump Labeling Late Friends Michele and Rob Reiner as ‘Deranged or Craz…",
    "link": "https://www.thewrap.com/michelle-obama-rob-reiner-trump-derangement-jimmy-kimmel/",
    "timestamp": "2025-12-16T15:53:13Z"
  },
  {
    "title": "Oil extends losses, WTI falls 2.7%",
    "description": "Crude oil prices extended their losses on Tuesday, dropping by more than 2.5% to its lowest level since April as traders digested the latest comments by United States President Donald Trump, who said ...",
    "link": "https://biztoc.com/x/cd2b785d915e5d0c",
    "timestamp": "2025-12-16T15:52:40Z"
  },
  {
    "title": "Trump has ‘an alcoholic’s personality, chief of staff says in wide-ranging Vanity Fair interview. She calls it a ‘hit piece’",
    "description": "Susie Wiles, President Donald Trump’s understated but influential chief of staff, criticized Attorney General Pam Bondi’s handling of the Jeffrey Epstein case and broadly defended the president’s aggressive second administration in a series of interviews publ…",
    "link": "https://biztoc.com/x/156ae2375ccead33",
    "timestamp": "2025-12-16T15:52:36Z"
  },
  {
    "title": "U.S. Department of War escalates investigation into Sen. Mark Kelly over ‘misconduct’",
    "description": "Facing 'serious allegations' for telling service members to disobey 'illegal' orders",
    "link": "https://www.wnd.com/2025/12/u-s-department-war-escalates-investigation-sen-mark/",
    "timestamp": "2025-12-16T15:51:44Z"
  },
  {
    "title": "Susie Wiles Savages Trump and His Team in Unbelievable Interview",
    "description": "White House chief of staff Susie Wiles has a lot to say about Donald Trump’s inner circle, and not much of it is flattering, if any. Wiles spoke to author Chris Whipple at different times throughout the first year of Trump’s second term as president, and her …",
    "link": "https://newrepublic.com/post/204481/susie-wiles-criticizes-trump-team",
    "timestamp": "2025-12-16T15:50:46Z"
  },
  {
    "title": "He Made an Epic Journey to the U.S. to Share Evidence of a Genocide. We're Deporting Him Anyway.",
    "description": "Heng Guan risked everything to record evidence of the Uyghur genocide in China, and came to the U.S. to share it. Now he's being deported.",
    "link": "https://www.jezebel.com/heng-guan-deportation-us-china-uyghurs-genocide-video-evidence-camps-uganda-asylum",
    "timestamp": "2025-12-16T15:47:35Z"
  },
  {
    "title": "Trump Loses Nick Fuentes Over ‘Evil’ Rob Reiner Remarks",
    "description": "Hitler-loving Nick Fuentes said President Donald Trump went too far — even by his standards — with his \"despicable\" remarks about Rob Reiner after his murder\nThe post Trump Loses Nick Fuentes Over ‘Evil’ Rob Reiner Remarks first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/trump-loses-nick-fuentes-over-evil-rob-reiner-remarks/",
    "timestamp": "2025-12-16T15:47:15Z"
  },
  {
    "title": "Ford retreats from EVs and takes big financial hit as Trump policies grip industry",
    "description": "It's a visible sign of the auto industry's pullback from a technology carmakers wholeheartedly embraced early this decade. Trump policies reduce federal support for EVs, affecting sales and demand.",
    "link": "https://www.cbc.ca/news/canada/windsor/automaker-ford-retreat-electric-vehicles-trump-tariffs-industry-9.7017570",
    "timestamp": "2025-12-16T15:47:15Z"
  },
  {
    "title": "America was mourning — and our insanely jealous leader's response was disgusting",
    "description": "More incomprehensible tragedy visited the United States of America when we learned that Hollywood legend Rob Reiner and his wife, Michele Singer Reiner, were found dead in their Los Angeles home Sunday.The couple’s son, Nick Reiner, 32, was arrested in connec…",
    "link": "https://www.rawstory.com/raw-investigates/a-patriot-s-and-trump-s-disgusting-response-tell-us-something-urgent-about-ourselves/",
    "timestamp": "2025-12-16T15:44:39Z"
  },
  {
    "title": "Trump has ‘an alcoholic’s personality, chief of staff says in wide-ranging Vanity Fair interview. She calls it a ‘hit piece’",
    "description": "Susie Wiles also told Vanity Fair that she has read the Epstein file and that Trump is “not in the file doing anything awful.”",
    "link": "https://fortune.com/2025/12/16/trump-has-alcoholics-personality-susie-wiles-vanity-fair-epstein-bondi/",
    "timestamp": "2025-12-16T15:44:09Z"
  },
  {
    "title": "The Wiles of Susie Wiles",
    "description": "Trump chief of staff Susie Wiles has been granting access to Vanity Fair reporter Chris Whipple. The magazine published some gob-smacking excerpts of those interviews today. I haven’t read the whole thing yet, but my initial reaction was to wonder if Wiles se…",
    "link": "https://balloon-juice.com/2025/12/16/the-wiles-of-susie-wiles/",
    "timestamp": "2025-12-16T15:43:29Z"
  },
  {
    "title": "Trump’s Vile Rob Reiner Comments Show How Much He Has Debased His Office",
    "description": "Sasha Abramsky\n\n\n\nEvery day, Trump is saying and doing things that would get most elementary school children suspended.\r\n\n\r\n\n\nThe post Trump’s Vile Rob Reiner Comments Show How Much He Has Debased His Office appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-rob-reiner-comments-backlash/",
    "timestamp": "2025-12-16T15:40:58Z"
  },
  {
    "title": "A year on from ‘drill, baby, drill’, why are there fewer oil rigs in the US?",
    "description": "US President Donald Trump promised to ‘drill, baby, drill’. After a year in office, the US oil rig count is steadily declining, but production is on the up.",
    "link": "https://www.offshore-technology.com/features/a-year-on-from-drill-baby-drill-why-are-there-fewer-oil-rigs-in-the-us/",
    "timestamp": "2025-12-16T15:40:53Z"
  },
  {
    "title": "Chelsea injuries up 44% after Club World Cup but report says event has had 'minimal' impact",
    "description": "Chelsea suffered a 44% spike in injuries after competing in the supersized Club World Cup this year, according to findings published on Tuesday. Chelsea went on to win the inaugural competition, receiving the trophy from U.S. President Donald Trump at MetLife…",
    "link": "https://sports.yahoo.com/articles/chelsea-injuries-44-club-world-153933298.html",
    "timestamp": "2025-12-16T15:39:33Z"
  },
  {
    "title": "Howard Stern Confirms 3-Year Extension Deal with SiriusXM (VIDEO)",
    "description": "Despite what Donald Trump had hoped and wished for, radio icon Howard Stern isn't going anywhere – at least for another three years. Earlier today, Stern announced on his show that months of negotiations had resulted in a new deal. During his final show of th…",
    "link": "https://bleedingcool.com/tv/howard-stern-confirms-3-year-extension-deal-with-siriusxm-video/",
    "timestamp": "2025-12-16T15:37:06Z"
  },
  {
    "title": "Government belatedly reveals loss of 105,000 jobs in October as full DOGE cutbacks come into view",
    "description": "Both the October and November job creation numbers, released Tuesday by the Labor Department, came in late because of the 43-day government shutdown.",
    "link": "https://fortune.com/2025/12/16/jobs-report-october-november-delay-doge-federal-worker-resignations/",
    "timestamp": "2025-12-16T15:36:35Z"
  },
  {
    "title": "BBC says it will fight Trump’s $10 billion lawsuit over edited Jan 6 comments",
    "description": "President Trump sued the BBC on Monday for defamation and a violation of Florida’s Deceptive and Unfair Trade Practices Act for $5 billion apiece, as the president is seeking $10 billion total.",
    "link": "https://www.foxnews.com/media/bbc-says-fight-trumps-10-billion-lawsuit-over-edited-jan-6-comments",
    "timestamp": "2025-12-16T15:35:43Z"
  },
  {
    "title": "Trump White House says ballroom construction must continue for national security reasons",
    "description": "The Trump administration said in a court filing Monday that the president’s White House ballroom construction project must continue for unexplained national security reasons and because a preservationists’ organization that wants it stopped has no standing to…",
    "link": "https://newsroom.ap.org/detail/TrumpadministrationsaysWhiteHouseballroomconstructionisamatterofnationalsecurity/de9756118bbfca8f40af9cf89db6af5b/text",
    "timestamp": "2025-12-16T15:35:14Z"
  },
  {
    "title": "‘A Conspiracy Theorist for a Decade’: Trump’s Chief of Staff Gets Stunningly Candid in Blockbuster Vanity Fair Exposé",
    "description": "President Donald Trump’s chief of staff Susie Wiles offered a remarkably candid window into a presidency she described, repeatedly, as driven by impulse and a widening view of executive power, in a blockbuster Vanity Fair portrait built around months of exclu…",
    "link": "https://freerepublic.com/focus/f-chat/4357654/posts",
    "timestamp": "2025-12-16T15:34:33Z"
  },
  {
    "title": "Did White House Chief of Staff Susie Wiles just say Trump has an 'alcoholic’s personality,' and call JD Vance a 'conspiracy theorist'?",
    "description": "White House chief of staff Susie Wiles described President Trump as having an \"alcoholic's personality\" in a new interview, noting his belief that \"there's nothing he can't do.\" Wiles, whose father struggled with alcoholism, drew parallels between her father'…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-white-house-chief-of-staff-susie-wiles-just-say-trump-has-an-alcoholics-personality-and-call-jd-vance-a-conspiracy-theorist/articleshow/126008914.cms",
    "timestamp": "2025-12-16T15:33:15Z"
  }
]