[
  {
    "title": "America has already lost the robot war to China",
    "description": "In January, Donald Trump announced from the White House that he was launching \"the largest AI infrastructure project by far in history, and it's all taking place right here in America.\" Stargate Project, a $500 billion initiative to bolster the development of…",
    "link": "https://biztoc.com/x/562347671062c7cb",
    "timestamp": "2025-04-14T08:19:08Z"
  },
  {
    "title": "Donald Trump Health Update Raises Eyebrows",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's annual physical examination results have raised eyebrows after his physician mentioned his \"frequent victories in golf events.\"\nThe results of his physical, which were released on Apri…",
    "link": "https://biztoc.com/x/d158be50ce817e2d",
    "timestamp": "2025-04-14T08:19:05Z"
  },
  {
    "title": "The 'world's coolest dictator' heads to the White House",
    "description": "El Salvador's President Bukele heads to the White House to discuss further cooperation with the U.S., including the continued use of El Salvador's supermax prison for deported migrants.",
    "link": "https://www.npr.org/2025/04/14/nx-s1-5361119/the-worlds-coolest-dictator-heads-to-the-white-house",
    "timestamp": "2025-04-14T08:18:21Z"
  },
  {
    "title": "Global stock markets up amid Trump tariffs exemptions for electronics",
    "description": "Major stock markets in Asia and Europe rose in Monday trading following the U.S. announcement that key consumer electronics would be temporarily exempted from tariffs.",
    "link": "https://abcnews.go.com/Business/global-stock-markets-amid-trump-tariffs-exemptions-electronics/story?id=120778659",
    "timestamp": "2025-04-14T08:18:00Z"
  },
  {
    "title": "Tariff relief for iPhone and Mac won’t last long",
    "description": "iPhones and other electronics get only a temporary reprieve from tariffs, as the US eyes a special-focus tariff for them.\n(via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "link": "https://www.cultofmac.com/news/tariff-relief-for-iphone-and-mac-wont-last-long",
    "timestamp": "2025-04-14T08:17:36Z"
  },
  {
    "title": "‘We don’t care! China has been here for 5,000 years. Most of the time, there was no U.S., and we survived.,” states Chinese official upon latest escalation of Trump’s tariffs",
    "description": "As China reacts to the latest round of Trump’s tariffs on Friday, announcing a 125% tariff on all American goods, vice president of the Beijing-based Center for China and Globalization, Victor Zhikai Gao, commented: “We don’t care! China has been here for 5,0…",
    "link": "https://freerepublic.com/focus/f-news/4310872/posts",
    "timestamp": "2025-04-14T08:17:08Z"
  },
  {
    "title": "A Green Light for US Earthquake Relief in Myanmar",
    "description": "The U.S. government increases disaster aid but cancels a \"diversity\" scholarship.",
    "link": "https://thediplomat.com/2025/04/a-green-light-for-us-earthquake-relief-in-myanmar/",
    "timestamp": "2025-04-14T08:15:06Z"
  },
  {
    "title": "America has already lost the robot war to China",
    "description": "In the tech arms race with China, Trump's tariffs could spell certain defeat",
    "link": "https://www.businessinsider.com/america-losing-robot-war-china-trump-tariffs-musk-ai-2025-4",
    "timestamp": "2025-04-14T08:11:01Z"
  },
  {
    "title": "Trump’s doctor gives him clean bill of health",
    "description": "The White House physician has concluded that the US president is “fully fit” for the job Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615723-trump-us-health-cognitive/",
    "timestamp": "2025-04-14T08:10:53Z"
  },
  {
    "title": "Donald Trump Health Update Raises Eyebrows",
    "description": "President Donald Trump's annual physical examination results have drawn criticism after his physician mentioned his \"frequent victories in golf events.\"",
    "link": "https://www.newsweek.com/donald-trump-annual-physical-results-raise-eyebrows-frequent-golf-victories-2059313",
    "timestamp": "2025-04-14T08:10:50Z"
  },
  {
    "title": "China Thinks Trump Has Blinked First in Tariff War",
    "description": "Beijing demanded that Washington end its \"erroneous practice.\"",
    "link": "https://www.newsweek.com/china-us-trump-trade-war-tariff-exclusions-2059284",
    "timestamp": "2025-04-14T08:10:49Z"
  },
  {
    "title": "US-China tariff clash escalates; hits semiconductor sector but boosts China's domestic chipmakers",
    "description": "Since President Donald Trump declared April 2 as \"Liberation Day\" and unveiled sweeping reciprocal tariffs, the US-China trade war has sharply intensified. Trump's changing tariff policy on China has now been up to 145%. China's State Council Tariff Commissio…",
    "link": "https://www.digitimes.com/news/a20250414PD223/us-china-trade-war-analog-ic-chipmakers-ti-donald-trump.html",
    "timestamp": "2025-04-14T08:10:47Z"
  },
  {
    "title": "Landmark US Antitrust Trial Could Force Zuckerberg To Sell Instagram",
    "description": "The Meta case is being made by the Federal Trade Commission (FTC), the powerful US consumer protection agency, and could see the owner of Facebook forced to divest Instagram and WhatsApp.",
    "link": "https://www.ndtv.com/world-news/landmark-us-antitrust-trial-could-force-zuckerberg-to-sell-instagram-8160514",
    "timestamp": "2025-04-14T08:10:41Z"
  },
  {
    "title": "Ukraine could axe one-third of parliament – speaker",
    "description": "The population decline makes reducing seats a logical step, Ruslan Stefanchuk has argued Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615722-ukrainian-parliament-reform-stefanchuk/",
    "timestamp": "2025-04-14T08:09:17Z"
  },
  {
    "title": "Hakeem Jeffries Shreds Pete Hegseth With Blistering DEI Burn",
    "description": "Donald Trump's defense secretary was slammed by the House minority leader over a new \"outrageous\" book ban.",
    "link": "https://www.huffpost.com/entry/pete-hegseth-hakeem-jeffries-dei_n_67fca800e4b0afe00ba911fb",
    "timestamp": "2025-04-14T08:08:56Z"
  },
  {
    "title": "Trump and Musk's Brittle, Shared Secret Gets Exposed | Opinion",
    "description": "What President Donald Trump and Elon Musk share more than anything else—and have built their lives on—is one keen insight into American psychology.",
    "link": "https://biztoc.com/x/45a61a8aae091d63",
    "timestamp": "2025-04-14T08:07:59Z"
  },
  {
    "title": "Trump says CBS and 60 Minutes should ‘pay a big price’ for going after him",
    "description": "US President Donald Trump bitterly attacked 60 Minutes shortly after the CBS programme broadcast stories on Ukraine and Greenland.",
    "link": "https://www.independent.ie/world-news/north-america/trump-says-cbs-and-60-minutes-should-pay-a-big-price-for-going-after-him/a1657831908.html",
    "timestamp": "2025-04-14T08:07:29Z"
  },
  {
    "title": "Goldman cuts targets on China stocks for second time this month",
    "description": "(Bloomberg) -- Strategists at Goldman Sachs Group Inc. cut their targets for key Chinese stock indexes for a second time this month, citing heightened trade ...",
    "link": "https://finance.yahoo.com/news/goldman-cuts-targets-china-stocks-080612783.html",
    "timestamp": "2025-04-14T08:06:12Z"
  },
  {
    "title": "Tech Industry’s Exemption From 125 Percent ‘Reciprocal’ Tariff Will Only Last “A Month Or Two” As Products Like The iPhone Will Be Subject To A “Special Focus Type Of Tariff”",
    "description": "In the ongoing battle over tariffs between China and the United States, the tech industry received a bit of a relief, especially for smartphones, laptops, wearables, and more. However, it seems that there is a slight twist, and the tax relief will only be sho…",
    "link": "https://wccftech.com/tech-inductry-tariff-relief-is-only-temporary-with-new-special-focus-type-of-tax/",
    "timestamp": "2025-04-14T08:03:15Z"
  },
  {
    "title": "Canada’s LNG industry set to take flight as interest reignites in Alaska megaproject",
    "description": "CALGARY — Hundreds of kilometres up the Pacific coast from where Canada’s first liquefied natural gas export terminal is set to start up this summer, a monster lays dormant. Alaska has long had ambitions to ship its natural gas to international markets, but t…",
    "link": "https://financialpost.com/pmn/canadas-lng-industry-set-to-take-flight-as-interest-reignites-in-alaska-megaproject",
    "timestamp": "2025-04-14T08:02:17Z"
  },
  {
    "title": "A Four-(and More) Wheeled Reason Russian Can't Win in Ukraine | Opinion",
    "description": "As the war in Ukraine grinds through its fourth year, Russian military might is a shadow of what it was on the eve of the invasion.",
    "link": "https://www.newsweek.com/four-more-wheeled-reason-russian-cant-win-ukraine-opinion-2058805",
    "timestamp": "2025-04-14T08:01:01Z"
  },
  {
    "title": "Elon Musk Could Be Democrats' Secret Weapon in 2026 Midterms",
    "description": "Musk's growing influence in Washington may become a central factor in a Democratic resurgence in the 2026 midterms.",
    "link": "https://www.newsweek.com/elon-musk-approval-rating-democrats-2026-midterms-2057955",
    "timestamp": "2025-04-14T08:00:01Z"
  },
  {
    "title": "I never thought Canada would face the threat my homeland did",
    "description": "Nino Antadze was a student at the University of Waterloo when her homeland, Georgia, was invaded by Russian troops. She never expected to see Canada’s sovereignty threatened by the United States with a playbook that feels eerily familiar.",
    "link": "https://www.cbc.ca/news/canada/prince-edward-island/pei-first-person-nino-antadze-1.7499239",
    "timestamp": "2025-04-14T08:00:00Z"
  },
  {
    "title": "Trump and Musk's Brittle, Shared Secret Gets Exposed | Opinion",
    "description": "What President Donald Trump and Elon Musk share more than anything else—and have built their lives on—is one keen insight into American psychology.",
    "link": "https://www.newsweek.com/trump-musks-brittle-shared-secret-gets-exposed-opinion-2058813",
    "timestamp": "2025-04-14T07:58:01Z"
  },
  {
    "title": "Dollar Falls Amid Confusion Over U.S. Tariffs",
    "description": "55 min ago\nDollar Falls Amid Confusion Over U.S. Tariffs\nThe dollar stayed lower after hitting a three-year low Friday on building concerns over the U.S. economic fallout of President Donald Trump's tariff plans.\nTrump on Sunday said there would be no exempti…",
    "link": "https://biztoc.com/x/b3b923a027519076",
    "timestamp": "2025-04-14T07:56:55Z"
  },
  {
    "title": "Stock Futures Jump Higher After Trump’s Tech Tariff Reprieve",
    "description": "14 min ago\nStock Futures Jump Higher After Trump’s Tech Tariff Reprieve\nU.S. stocks were headed for gains early Monday, as investors reacted to President Donald Trump pausing tariffs on smartphones, PCs, and other technology goods.\nFutures tracking the Dow Jo…",
    "link": "https://biztoc.com/x/3bd414d81e36e6c8",
    "timestamp": "2025-04-14T07:56:41Z"
  },
  {
    "title": "Stock Market Today: Dow, S&P 500, Nasdaq Futures Surge After Trump Tariffs Reprieve on Tech; Nvidia, Palantir, Intel, More Movers; Dollar Falls",
    "description": "LIVE UPDATES\nDow Set to Open Up After Trump Tech Tariffs U-Turn\nThe S&P 500 and Nasdaq 100 are also rising in premarket trading Monday.\nLast Updated:\nApril 14, 2025 at 3:47 AM EDT\nKey Events\nLatest Updates\nU.S. stocks were headed for gains early Monday, as in…",
    "link": "https://biztoc.com/x/5bfef47ee207c401",
    "timestamp": "2025-04-14T07:56:35Z"
  },
  {
    "title": "Why has the government rescued British Steel - and why is there a race to keep furnaces burning?",
    "description": "The future of Britain's last major steelmaking plant is uncertain.",
    "link": "https://news.sky.com/story/why-has-the-government-rescued-british-steel-and-why-is-there-a-race-to-keep-furnaces-burning-13348666",
    "timestamp": "2025-04-14T07:55:00Z"
  },
  {
    "title": "Japan says no plan for big concessions in talks on US tariffs",
    "description": "TOKYO (Reuters) -Japanese Prime Minister Shigeru Ishiba said on Monday his country does not plan to make big concessions and won't rush to reach a deal in upcoming tariff negotiations with U.S. President Donald Trump's administration. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/14/japan-says-no-plan-for-big-concessions-in-talks-on-us-tariffs",
    "timestamp": "2025-04-14T07:54:00Z"
  },
  {
    "title": "Donald Trump admits 'nobody' will be exempt from tariffs in major u-turn",
    "description": "Donald Trump has said that 'nobody' will be exempt from tariffs following the ongoing trade war between the US and China",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-tariffs-us-china-exemption-list-759164-20250414",
    "timestamp": "2025-04-14T07:53:53Z"
  },
  {
    "title": "India preparing to ship 40,000 tonnes of shrimp to US after tariff pause",
    "description": "Indian seafood exporters relieved as US tariff pause allows shipment of 2,000 containers of shrimp, maintaining 10% duty.",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/india-preparing-to-ship-40000-tonnes-of-shrimp-to-us-after-tariff-pause/article69448608.ece",
    "timestamp": "2025-04-14T07:53:07Z"
  },
  {
    "title": "Abu Dhabi's Adnoc Said to Weigh Bid for $9B Aethon Assets",
    "description": "Adnoc has been among the most active dealmakers globally over the past year, buying assets from the US and Europe to Africa.",
    "link": "https://www.rigzone.com/news/wire/abu_dhabis_adnoc_said_to_weigh_bid_for_9b_aethon_assets-14-apr-2025-180226-article/",
    "timestamp": "2025-04-14T07:51:03Z"
  },
  {
    "title": "Japan avoids tariff confrontation ahead of crucial U.S. trade talks",
    "description": "Prime Minister Shigeru Ishiba again ruled out imposing retaliatory measures, arguing that escalation would not serve the country’s national interest.",
    "link": "https://www.japantimes.co.jp/business/2025/04/14/economy/japan-tariffs-ishiba/",
    "timestamp": "2025-04-14T07:51:00Z"
  },
  {
    "title": "Bitcoin Options Play Shows $100K Target Back in Bulls' Crosshair",
    "description": "The $100K call option has become the most favored bet, with a notional open interest of nearly $1.2 billion.",
    "link": "https://www.coindesk.com/markets/2025/04/14/bitcoin-options-play-shows-usd100k-target-back-in-bulls-crosshair",
    "timestamp": "2025-04-14T07:47:43Z"
  },
  {
    "title": "Apple India Produces $22 Billion of iPhones in Shift From China",
    "description": "Apple assembled $22 billion (roughly Rs. 1,89,412 crore) worth of iPhones in India in the 12 months ended March. The Cupertino, California-headquartered company now makes 20 percent, or one in five, of its prized iPhones in the South Asian country, according …",
    "link": "https://www.gadgets360.com/mobiles/news/apple-india-produce-usd-22-billion-iphones-shift-china-8160350",
    "timestamp": "2025-04-14T07:46:15Z"
  },
  {
    "title": "Japan's Nikkei rises as iPhone-related stocks jump",
    "description": "\"The market is still swayed by various headlines,\" said Yugo Tsuboi, chief strategist at Daiwa Securities.",
    "link": "https://www.thehindubusinessline.com/markets/japans-nikkei-rises-as-iphone-related-stocks-jump/article69448585.ece",
    "timestamp": "2025-04-14T07:45:42Z"
  },
  {
    "title": "One Month of US Airstrikes Fail to Stop Houthis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOne month into a sustained U.S. air campaign ordered by President Donald Trump, the Iran-backed Houthi militant group in Yemen is defying Washington's efforts to stop it by continuing to launch missiles agains…",
    "link": "https://biztoc.com/x/9d2871b45d0d35ef",
    "timestamp": "2025-04-14T07:45:38Z"
  },
  {
    "title": "Sony raises PlayStation 5 prices in Europe citing 'challenging' economic environment",
    "description": "Sony said it has made the \"tough decision\" to raise prices against the \"backdrop of a challenging economic environment.\"",
    "link": "https://www.cnbc.com/2025/04/14/sony-raises-playstation-5-prices-in-europe-uk.html",
    "timestamp": "2025-04-14T07:40:01Z"
  },
  {
    "title": "One Month of US Airstrikes Fail to Stop Houthis",
    "description": "The Iranian-backed group continued attacks against the U.S. and Israel in recent weeks in spite of the bombing",
    "link": "https://www.newsweek.com/one-month-us-airstrikes-fail-stop-houthis-2059292",
    "timestamp": "2025-04-14T07:38:33Z"
  },
  {
    "title": "Ishiba says Japan won't compromise in rush to wrap up tariff talks with U.S.",
    "description": "Prime Minister Shigeru Ishiba said Monday Japan will not make compromises for the purpose of quickly concluding upcoming tariff negotiations with the United States, underlining the importance of exploring how the longtime allies can cooperate. In parliament, …",
    "link": "https://japantoday.com/category/politics/update2-japan-not-to-compromise-in-rush-to-wrap-up-tariff-talks-with-u.s.-pm",
    "timestamp": "2025-04-14T07:34:09Z"
  },
  {
    "title": "Japan In No Rush to Compromise Days Ahead of US Tariff Talks",
    "description": "Japan’s prime minister said he won’t rush to compromise in high-stakes trade negotiations with the US this week, which may set the tone for nations around the world that are seeking a reprieve from President Donald Trump’s tariff campaign.",
    "link": "https://financialpost.com/pmn/business-pmn/japan-in-no-rush-to-compromise-days-ahead-of-us-tariff-talks",
    "timestamp": "2025-04-14T07:33:47Z"
  },
  {
    "title": "Stocks Rise On Electronics Tariffs Exemption, Gold Hits New High",
    "description": "Stocks rose on Monday as trade war fears were tempered by Donald Trump's announcement of tariff exemptions for electronics, although the dollar weakened and safe-haven gold hit a fresh record amid fears the relief would be short-lived.",
    "link": "https://www.ibtimes.com.au/stocks-rise-electronics-tariffs-exemption-gold-hits-new-high-1857846",
    "timestamp": "2025-04-14T07:33:16Z"
  },
  {
    "title": "Meta Faces Landmark US Antitrust Trial",
    "description": "Social media juggernaut Meta stands trial on Monday facing serious US government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors.",
    "link": "https://www.ibtimes.com/meta-faces-landmark-us-antitrust-trial-3769970",
    "timestamp": "2025-04-14T07:33:13Z"
  },
  {
    "title": "Chinese exports soared in March ahead of Trump's 'Liberation Day'",
    "description": "Chinese exports soared more than 12 percent last month, according to data Monday, beating expectations as businesses rushed to get ahead of swingeing tariffs imposed by US President Donald Trump on his so-called \"Liberation Day\". - Frontloading - Analysts att…",
    "link": "https://timesofindia.indiatimes.com/world/china/chinese-exports-soared-in-march-ahead-of-trumps-liberation-day/articleshow/120273824.cms",
    "timestamp": "2025-04-14T07:32:57Z"
  },
  {
    "title": "Meta faces landmark US antitrust trial",
    "description": "Social media juggernaut Meta stands trial on Monday facing serious US government allegations that it abused its market power to acquire Instagram and WhatsApp before they could become competitors. By moving forward, the trial in a Washington federal court das…",
    "link": "https://www.digitaljournal.com/world/meta-faces-landmark-us-antitrust-trial/article",
    "timestamp": "2025-04-14T07:30:40Z"
  },
  {
    "title": "Josh Shapiro: What we know about Cody Balmer and the alleged arson at Pennsylvania governor’s residence",
    "description": "Pennsylvania authorities have arrested a Harrisburg man they say broke into Gov. Josh Shapiro’s residence early Sunday and started a fire while Shapiro and his family were sleeping.",
    "link": "https://www.cnn.com/2025/04/14/us/pennsylvania-governor-arson-what-we-know-hnk/index.html",
    "timestamp": "2025-04-14T07:25:59Z"
  },
  {
    "title": "Trump: Iran Decision Coming 'Very Quickly'",
    "description": "U.S. President Donald Trump said that he expected to make a quick decision on Iran, after both countries held positive talks in Oman.",
    "link": "https://biztoc.com/x/63cfd475d5eb3f3e",
    "timestamp": "2025-04-14T07:22:51Z"
  },
  {
    "title": "Trump's Annual Physical Results Are In—Here's What We Know",
    "description": "The nation was on edge awaiting the results of President Donald Trump's first physical of his second term, with the White House releasing the report Sunday, putting to rest rumors and speculations.",
    "link": "https://www.ibtimes.com/trumps-annual-physical-results-are-heres-what-we-know-3769968",
    "timestamp": "2025-04-14T07:22:42Z"
  },
  {
    "title": "Trump: Iran Decision Coming 'Very Quickly'",
    "description": "U.S. President Donald Trump said that he expected to make a quick decision on Iran, after both countries held positive talks in Oman.",
    "link": "https://www.newsweek.com/donald-trump-iran-nuclear-witkoff-2059287",
    "timestamp": "2025-04-14T07:18:37Z"
  },
  {
    "title": "Hungary set to restrict constitutional rights in ‘Easter cleanup’",
    "description": "Hungary’s parliament on Monday is expected to approve constitutional changes further clamping down on rights for LGBTQ people and other groups, part of Prime Minister Viktor Orban’s “Easter cleanup” against his domestic opponents. Since his return to power in…",
    "link": "https://www.digitaljournal.com/world/hungary-set-to-restrict-constitutional-rights-in-easter-cleanup/article",
    "timestamp": "2025-04-14T07:12:20Z"
  },
  {
    "title": "'Seriously': Ex-GOP Lawmaker Sounds Alarm On Trump's 2028 Plans",
    "description": "David Jolly warned that Trump could try to stay in office, even though the Constitution forbids being elected to a third term.",
    "link": "https://www.huffpost.com/entry/david-jolly-trump-2028_n_67fca222e4b0afe00ba90da9",
    "timestamp": "2025-04-14T07:12:00Z"
  },
  {
    "title": "India eyes wrapping key aspects of US trade talks in six weeks",
    "description": "India, US trade deal: India and the US are set to begin sector-specific trade discussions this week, aiming for clarity on potential concessions by the end of May. This follows a 90-day reprieve from reciprocal tariffs imposed by Donald Trump. While India isn…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-eyes-wrapping-key-aspects-of-us-trade-talks-in-six-weeks/articleshow/120273056.cms",
    "timestamp": "2025-04-14T07:07:14Z"
  },
  {
    "title": "War Crimes Trial Of Former Kosovo President Hits Milestone As Prosecution Rests Case",
    "description": "For more than two years, Kosovo war crimes prosecutors have laid out evidence, questioning scores of witnesses, building their case for why former President Hashim Thaci should be convicted for his role in the killing or detention of scores of people during a…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250414-rferl01.htm",
    "timestamp": "2025-04-14T07:04:30Z"
  },
  {
    "title": "South Korea sees Trump starting tariff talks with Seoul, Japan and India, Yonhap says",
    "description": "South Korea's acting President Han Duck-soo said on Monday U.S. President Donald Trump appeared to have directed talks on tariffs to begin immediately with...",
    "link": "https://www.yahoo.com/news/south-korea-sees-trump-starting-070419356.html",
    "timestamp": "2025-04-14T07:04:19Z"
  },
  {
    "title": "Crypto Trader Unveils Massive Bitcoin Price Target Amid Extended BTC Bull Market – Here’s His Outlook",
    "description": "A widely followed crypto strategist believes that Bitcoin (BTC) can take the path of higher for longer this market cycle. Pseudonymous analyst Jack tells his 268,200 followers on the social media platform X that he thinks Bitcoin will not print a new all-time…",
    "link": "https://dailyhodl.com/2025/04/14/crypto-trader-unveils-massive-bitcoin-price-target-amid-extended-btc-bull-market-heres-his-outlook/",
    "timestamp": "2025-04-14T07:04:08Z"
  },
  {
    "title": "Somaliland Offers Trump Red Sea Base in Exchange for Recognition",
    "description": "Somalia's breakaway region of Somaliland wants to be recognized as an independent state by US President Donald Trump in exchange for leasing its Berbera port and airstrip to the US, media reported on Saturday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250413-sputnik01.htm",
    "timestamp": "2025-04-14T07:03:43Z"
  },
  {
    "title": "China and EU resume negotiations on EV duties following Trump tariff hikes",
    "description": "China and the Europe Union have restarted negotiations to establish a price floor on Chinese-made electric vehicle imports instead of the up to 45.3% tariffs imposed by the EU since last October, the Chinese Commerce Ministry and the European Commission confi…",
    "link": "http://technode.com/2025/04/14/china-and-eu-resume-negotiations-on-ev-duties-following-trump-tariff-hikes/",
    "timestamp": "2025-04-14T07:01:14Z"
  },
  {
    "title": "Japan says US tariffs cut company profits 'day by day'",
    "description": "Japan's envoy, Ryosei Akazawa, is heading to Washington for crucial tariff talks, as Japanese companies face dwindling profits due to existing US tariffs. Prime Minister Shigeru Ishiba discussed the tariffs' impact with Singapore's leader, highlighting concer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/japan-says-us-tariffs-cut-company-profits-day-by-day/articleshow/120272911.cms",
    "timestamp": "2025-04-14T07:01:07Z"
  },
  {
    "title": "Countries welcome Iran-U.S. talks",
    "description": "The United States has described its indirect talks with Iran as \"positive and constructive.\" Several other countries have also reacted positively to the Saturday talks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-irna05.htm",
    "timestamp": "2025-04-14T07:00:06Z"
  },
  {
    "title": "China's Xi says there are 'no winners' in a tariff war as he visits Southeast Asia",
    "description": "China's leader Xi Jinping started a week of diplomacy in Southeast Asia with a visit to Vietnam on Monday, signaling China' s commitment to global trade, just after U.S. President Donald Trump upended the global economy with his latest tariffs moves.  Althoug…",
    "link": "https://japantoday.com/category/world/china%27s-xi-says-there-are-%27no-winners%27-in-a-tariff-war-as-he-visits-southeast-asia",
    "timestamp": "2025-04-14T07:00:03Z"
  },
  {
    "title": "Iran, US hold 'constructive' talks in Omen, agree on further negotiations",
    "description": "Iran and the US agreed to hold the second round of negotiations on April 19 after the two sides concluded their \"indirect\" talks on Saturday in the Omani capital of Muscat in a \"constructive\" atmosphere, according to the Iranian Foreign Ministry.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-globaltimes02.htm",
    "timestamp": "2025-04-14T07:00:01Z"
  },
  {
    "title": "Tapping Bonds to Fend Off Trump?",
    "description": "Tapping Bonds to Fend Off Trump?\n\n \n\n\n \nJosh Moody\n\nMon, 04/14/2025 - 03:00 AM\n\nUniversities have been reluctant to tap their endowments to plug research funding holes or finance a lawsuit against Trump’s attacks. Could bonds serve that purpose instead?\n \n By…",
    "link": "https://www.insidehighered.com/news/governance/executive-leadership/2025/04/14/tapping-bonds-fend-trump",
    "timestamp": "2025-04-14T07:00:00Z"
  },
  {
    "title": "‘Draconian’ Layoffs, Grant Terminations Come for the NEH",
    "description": "‘Draconian’ Layoffs, Grant Terminations Come for the NEH\n\n \n\n\n \nkathryn.palmer…\n\nMon, 04/14/2025 - 03:00 AM\n\nCritics say the deep cuts to the National Endowment for the Humanities, which has supported research and learning at colleges since 1965, “will ripple…",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/04/14/draconian-layoffs-grant-terminations-come-neh",
    "timestamp": "2025-04-14T07:00:00Z"
  },
  {
    "title": "China Had Over $100B Trade Surplus in March, Before U.S. Tariff Hikes",
    "description": "China’s exports jumped 12.4% from a year earlier as companies rushed to beat increases in tariffs imposed by U.S. President Trump.",
    "link": "https://time.com/7277506/us-china-trade-balance-surplus-exports-imports-tariffs-trump/",
    "timestamp": "2025-04-14T07:00:00Z"
  },
  {
    "title": "How bad is it? RFK Jr.’s extinction-level threat to science-based federal health policy and public health is here",
    "description": "Five months ago, I called RFK Jr. an \"extinction-level\" threat to US biomedical science and public health. That extinction is under way.\nThe post How bad is it? RFK Jr.’s extinction-level threat to science-based federal health policy and public health is here…",
    "link": "https://sciencebasedmedicine.org/how-bad-is-it-rfk-jr-s-extinction-level-threat-to-science-based-federal-health-policy-and-public-health-is-here/",
    "timestamp": "2025-04-14T07:00:00Z"
  },
  {
    "title": "US-Iran Talks 'Going OK' - Trump Says After Witkoff-Araghchi Meeting",
    "description": "US President Donald Trump said after a meeting between his special envoy Steve Witkoff and Iranian Foreign Minister Abbas Araghchi that the Iran talks were going \"OK,\" Reuters reported.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-sputnik02.htm",
    "timestamp": "2025-04-14T06:59:56Z"
  },
  {
    "title": "Iran Ready to Return to 2015 Nuclear Deal Enrichment Levels - But With Key Conditions for the US",
    "description": "Iran is ready to return to the levels of uranium enrichment envisaged by the 2015 nuclear deal, subject to certain conditions from the United States, the Wall Street Journal reported, citing Iranian and European officials.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-sputnik01.htm",
    "timestamp": "2025-04-14T06:59:55Z"
  },
  {
    "title": "After First Step, Optimism Grows As US, Iran Prepare For Next Meeting",
    "description": "Nuclear talks in Oman marked the first formal engagement between Iran and the United States in years, and though progress may have been slight, it was enough to signal a willingness to temper tensions through diplomacy rather than military action.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250413-rferl02.htm",
    "timestamp": "2025-04-14T06:59:43Z"
  },
  {
    "title": "India preparing to ship 40,000 tonnes of shrimp to US after tariff pause",
    "description": "Indian seafood exporters are preparing to ship shrimp to the United States. This follows a pause in planned tariff increases by the US. The decision provides relief to exporters. Around 2,000 containers of shrimp are being readied for export. The US remains I…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-preparing-to-ship-40000-tonnes-of-shrimp-to-us-after-tariff-pause/articleshow/120272844.cms",
    "timestamp": "2025-04-14T06:59:24Z"
  },
  {
    "title": "US and China Try 'Soft' Approach to Tariff Row, Talking Via Intermediaries",
    "description": "On April 2, Trump signed an executive order introducing \"reciprocal\" tariffs on imports from other countries. The baseline rate was set at 10%, while dozens of countries were hit with higher rates. The duties on most countries were reversed to 10% days later …",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250413-sputnik01.htm",
    "timestamp": "2025-04-14T06:58:11Z"
  },
  {
    "title": "Putin is 'mocking' Trump's goodwill with Ukraine attacks, Poland says",
    "description": "LUXEMBOURG (Reuters) - Polish Foreign Minister Radoslaw Sikorski said on Monday he hoped U.S. President Donald Trump and his administration would see that Vladimir Putin was \"mocking their goodwill\" following Moscow's deadly missile strike on the Ukrainian ci…",
    "link": "https://www.thestar.com.my/news/world/2025/04/14/putin-is-039mocking039-trump039s-goodwill-with-ukraine-attacks-poland-says",
    "timestamp": "2025-04-14T06:58:00Z"
  },
  {
    "title": "Cabinet delays release of NT$88 billion U.S. tariff support package details",
    "description": "The Cabinet has postponed by a week the release of details of a NT$88 billion (US$2.72 billion) support package aimed at mitigating the impact of higher U.S. tariffs on Taiwan's economy, Premier Cho Jung-tai (卓榮泰) said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250413-cna02.htm",
    "timestamp": "2025-04-14T06:57:34Z"
  },
  {
    "title": "Thailand says to discuss tariffs with United States on April 21",
    "description": "BANGKOK : Thailand's finance and commerce ministers will lead a delegation to the United States to meet Trump administration officials and push for relief from planned heavy tariffs, a government spokesperson said on Monday.An advance team led by Finance Mini…",
    "link": "https://www.channelnewsasia.com/business/thailand-says-discuss-tariffs-united-states-april-21-5064386",
    "timestamp": "2025-04-14T06:57:25Z"
  },
  {
    "title": "Thailand says to discuss tariffs with United States on Apr 21",
    "description": "BANGKOK: Thailand's finance and commerce ministers will lead a delegation to the United States to meet Trump administration officials and push for relief from planned heavy tariffs, a government spokesperson said on Monday (Apr 14). An advance team led by Fin…",
    "link": "https://www.channelnewsasia.com/business/thailand-says-discuss-tariffs-united-states-apr-21-5064386",
    "timestamp": "2025-04-14T06:57:00Z"
  },
  {
    "title": "Russian missile strike kills 34 in Ukraine's Sumy, Kyiv says",
    "description": "An alleged Russian missile strike on Sumy, Ukraine, claimed 34 lives and injured 117, marking the deadliest attack this year. President Zelenskiy urged a strong international response, while global leaders condemned the act. Trump acknowledged the strike as \"…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russian-missile-strike-kills-34-in-ukraines-sumy-kyiv-says/articleshow/120272678.cms",
    "timestamp": "2025-04-14T06:54:06Z"
  },
  {
    "title": "First phase of US tariff talks 'smooth', Taiwan president says",
    "description": "President Lai Ching-te announced that Taiwan's initial tariff discussions with the U.S. progressed positively, envisioning a 'Taiwan plus one' trade strategy. He aims to leverage this opportunity to deepen economic ties with the U.S., seeking a zero-tariff ar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/first-phase-of-us-tariff-talks-smooth-taiwan-president-says/articleshow/120272664.cms",
    "timestamp": "2025-04-14T06:53:54Z"
  },
  {
    "title": "President Trump Gives His Reaction To Rory McIlroy’s Classic Victory In Masters",
    "description": "As we all know, Rory McIlroy was victorious Sunday in the 2025 Masters to become a Grand Slam winner, and President Donald Trump gave him his flowers.",
    "link": "https://dailycaller.com/2025/04/14/donald-trump-rory-mcilroy-masters-win/",
    "timestamp": "2025-04-14T06:53:12Z"
  },
  {
    "title": "What to know about Donald Trump's antitrust efforts against tech giants",
    "description": "The Trump administration's antitrust efforts continue, with the FTC suing Meta over its Instagram and WhatsApp acquisitions, and the Justice Department targeting Google’s search monopoly. Despite hopes for deregulation, Trump’s appointees remain committed to …",
    "link": "https://economictimes.indiatimes.com/tech/technology/what-to-know-about-donald-trumps-antitrust-efforts-against-tech-giants/articleshow/120272560.cms",
    "timestamp": "2025-04-14T06:50:29Z"
  },
  {
    "title": "South Korea sees Trump starting tariff talks with Seoul, Japan, India",
    "description": "South Korea's acting President Han Duck-soo announced that U.S. President Donald Trump has indicated a desire to initiate discussions on tariffs with South Korea, Japan, and India without delay. Additionally, Han mentioned that a video conference between U.S.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/south-korea-sees-trump-starting-tariff-talks-with-seoul-japan-india/articleshow/120272557.cms",
    "timestamp": "2025-04-14T06:50:24Z"
  },
  {
    "title": "Trump To Unveil Semiconductor Tariff Plan This Week, Signals Flexibility On Tech Exemptions",
    "description": "President Donald Trump said on Sunday that he would reveal the tariff rate on imported semiconductors in the coming week, suggesting that excluding smartphones and computers from reciprocal tariffs in China might be temporary.\nWhat Happened: Trump, speaking a…",
    "link": "https://biztoc.com/x/723f0020d3d0a392",
    "timestamp": "2025-04-14T06:49:53Z"
  },
  {
    "title": "The impact of tariffs and…Trump’s ties worry the government",
    "description": "Although Greece exports a small percentage of its products to the US, it is exposed to international developments - There are no signs yet of an impact on tourism, the problem in exports is relatively manageable\nThe post The impact of tariffs and…Trump’s ties…",
    "link": "https://en.protothema.gr/2025/04/14/the-impact-of-tariffs-and-trumps-ties-worry-the-government/",
    "timestamp": "2025-04-14T06:46:56Z"
  },
  {
    "title": "Asian markets rally after Wall Street ends higher in the chaotic and historic week",
    "description": "Asian markets have rallied as tensions over trade ease slightly after U.S. President Donald Trump said electronics such as phones and laptops would not be subject to the same high U.S. import duties as some other products.",
    "link": "https://www.clickondetroit.com/business/2025/04/14/asian-markets-rally-after-wall-street-ends-higher-in-the-chaotic-and-historic-week/",
    "timestamp": "2025-04-14T06:45:38Z"
  },
  {
    "title": "Hungary Set To Restrict Constitutional Rights In 'Easter Cleanup'",
    "description": "Hungary's parliament on Monday is expected to approve constitutional changes further clamping down on rights for LGBTQ people and other groups, part of Prime Minister Viktor Orban's \"Easter cleanup\" against his domestic opponents.",
    "link": "https://www.ibtimes.com/hungary-set-restrict-constitutional-rights-easter-cleanup-3769967",
    "timestamp": "2025-04-14T06:45:10Z"
  },
  {
    "title": "What to Know About El Salvador President and Trump Ally Nayib Bukele as He Visits U.S.",
    "description": "Trump is hosting the El Salvador President at the White House as the Central American nation becomes a critical lynchpin of his mass deportation operation.",
    "link": "https://time.com/7277503/el-salvador-nayib-bukele-visit-trump-immigration-prison-venezuelan-deportations/",
    "timestamp": "2025-04-14T06:45:00Z"
  },
  {
    "title": "Authorities Say Teen Killed Parents to Get Money for Assassination",
    "description": "A Wisconsin teenager charged in the February deaths of his parents faces wider allegations that he killed them to \"obtain the financial means\" to assassinate President Trump and cause a governmental collapse, according to a recently unsealed federal warrant. …",
    "link": "https://www.newser.com/story/367078/authorities-say-teen-killed-parents-to-get-money-for-assassination.html",
    "timestamp": "2025-04-14T06:45:00Z"
  },
  {
    "title": "Hungary set to restrict constitutional rights in 'Easter cleanup'",
    "description": "<p>BUDAPEST - Hungary's parliament on Monday is expected to approve constitutional changes further clamping down on rights for LGBTQ people and other groups, part of Prime Minister Viktor Orban's \"Easter cleanup\" against his domestic opponents.</p>",
    "link": "https://www.bangkokpost.com/world/3002909/hungary-set-to-restrict-constitutional-rights-in-easter-cleanup",
    "timestamp": "2025-04-14T06:45:00Z"
  },
  {
    "title": "Trump tariff du jour",
    "description": "Now you don’t see them, now you do: President Donald Trump signaled Sunday that he would pursue new tariffs on the powerful computer chips inside smartphones and other technologies, just two days after his administration excluded a variety of electronics from…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/trump-tariff-du-jour",
    "timestamp": "2025-04-14T06:43:32Z"
  },
  {
    "title": "Global stocks lifted by US reprieve for Trump’s tech tariffs",
    "description": "President suggests need for ‘flexibility’ but insists smartphone carve-out is temporary",
    "link": "https://www.irishtimes.com/business/2025/04/14/global-stocks-lifted-by-us-reprieve-for-trumps-tech-tariffs/",
    "timestamp": "2025-04-14T06:43:01Z"
  },
  {
    "title": "Apple shares lead gainers after tariff exemptions",
    "description": "Other U.S. and European tech stocks listed in Frankfurt were also higher.",
    "link": "https://www.thehindubusinessline.com/markets/apple-shares-lead-gainers-after-tariff-exemptions/article69448444.ece",
    "timestamp": "2025-04-14T06:40:27Z"
  },
  {
    "title": "'I Think It's Going Fine' - Trump on Progress in Resolving Ukraine Conflict",
    "description": "Commenting on the progress in resolving the conflict in Ukraine, US President Donald Trump said that, in his opinion, everything was \"going fine.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250413-sputnik02.htm",
    "timestamp": "2025-04-14T06:40:01Z"
  },
  {
    "title": "Dozens Killed In 'Horrific' Russian Missile Strike, Prompting EU, US Condemnation",
    "description": "Russian forces launched a missile strike on the city of Sumy that local authorities in Ukraine said left at least 34 people dead on April 13, prompting condemnation from Ukrainian leaders, the United States, and the European Union.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250413-rferl01.htm",
    "timestamp": "2025-04-14T06:39:53Z"
  },
  {
    "title": "Housing debate heats up, Liberals drop a diss track and senator has a MAGA moment",
    "description": "The housing debate ramps up, a Coalition senator makes a Trumpian sartorial choice and (most) former prime ministers turn out to help their parties.",
    "link": "https://www.abc.net.au/news/2025-04-14/campaign-launch-malcolm-turnbull-jacinta-price-maga-drake-song/105173206",
    "timestamp": "2025-04-14T06:39:27Z"
  },
  {
    "title": "India preparing to ship 40,000 tonnes of shrimp to US after tariff pause",
    "description": "India preparing to ship 40,000 tonnes of shrimp to US after tariff pause",
    "link": "https://www.livemint.com/companies/news/india-preparing-to-ship-40-000-tonnes-of-shrimp-to-us-after-tariff-pause-11744612739154.html",
    "timestamp": "2025-04-14T06:38:58Z"
  },
  {
    "title": "Donald Trump Reacts To Deadly Russian Missile Strike: 'They Made A Mistake'",
    "description": "Russia's strike on Sumy in Ukraine killed dozens of civilians on Palm Sunday.",
    "link": "https://biztoc.com/x/3ef2e1fe616607c8",
    "timestamp": "2025-04-14T06:38:37Z"
  },
  {
    "title": "China's Xi Jinping warns protectionism 'leads nowhere' as he arrives in Vietnam",
    "description": "Beijing is trying to present itself as a stable alternative amid Donald Trump’s erratic tariff measures.",
    "link": "https://www.thejournal.ie/xi-jinping-tariffs-6677349-Apr2025/",
    "timestamp": "2025-04-14T06:36:43Z"
  },
  {
    "title": "Donald Trump Reacts To Deadly Russian Missile Strike: 'They Made A Mistake'",
    "description": "Russia's strike on Sumy in Ukraine killed dozens of civilians on Palm Sunday.",
    "link": "https://www.newsweek.com/trump-reacts-russia-missile-strike-sumy-mistake-2059290",
    "timestamp": "2025-04-14T06:36:38Z"
  },
  {
    "title": "White House Under Fire For Posting Musk, Son's Photo: 'Does Elon Run The Account?'",
    "description": "Many X users are displeased with the White House after the official White House account on X posted a photo of Elon Musk and one of his sons at a UFC event Saturday.",
    "link": "https://www.ibtimes.com/white-house-under-fire-posting-musk-sons-photo-does-elon-run-account-3769962",
    "timestamp": "2025-04-14T06:36:04Z"
  },
  {
    "title": "Trump tariffs: Xi says 'no winners' in trade war",
    "description": "China's President Xi Jinping arrived in Vietnam to discuss the fallout from Donald Trump's sweeping tariffs. Asian stocks opened higher after news that electronics would be exempted from some levie. DW has more. Chinese President Xi Jinping said \"there are no…",
    "link": "https://www.dw.com/en/trump-tariffs-xi-says-no-winners-in-trade-war/live-72234961",
    "timestamp": "2025-04-14T06:32:00Z"
  }
]