[
  {
    "title": "Obama's orbit loses altitude: From the Politics Desk",
    "description": "Former President Barack Obama's political orbit has lost some of its clout as the Democratic Party searches for a way forward after the 2024 election.",
    "link": "https://www.nbcnews.com/politics/politics-news/obamas-orbit-loses-altitude-politics-desk-rcna209338",
    "timestamp": "2025-05-27T21:30:41Z"
  },
  {
    "title": "Trump Threatens Federal Funding for California",
    "description": "President Donald Trump on Tuesday threatened federal funding for California over its handling of a transgender athlete and said he would speak with its Democratic governor, Gavin Newsom, to “find out which way he wants",
    "link": "https://politicalwire.com/2025/05/27/trump-threatens-federal-funding-for-california/",
    "timestamp": "2025-05-27T21:30:23Z"
  },
  {
    "title": "Trump Threatens To Withhold \"Large Scale\" Federal Funding From California After Trans Athlete Destroys Biological Females",
    "description": "Trump Threatens To Withhold \"Large Scale\" Federal Funding From California After Trans Athlete Destroys Biological Females\n \nPresident Donald Trump is threatening to withhold \"large scale\" federal funding from California after a biologically male trans athlete…",
    "link": "https://biztoc.com/x/e123269dfc52c5a1",
    "timestamp": "2025-05-27T21:30:20Z"
  },
  {
    "title": "Trump's Pardon for Former Virginia Sheriff Who Exchanged Badges for Cash Makes a Mockery of 'Law and Order'",
    "description": "\"We must maintain law and order at the highest level, or we will cease to have a country, 100 percent,\" said Donald Trump, then a candidate for president, at a 2016 rally in Virginia Beach. \"We will cease to have a country. I am the law and order candidate.\" …",
    "link": "https://biztoc.com/x/2db11dbbac76b846",
    "timestamp": "2025-05-27T21:30:19Z"
  },
  {
    "title": "'Absurd!' Judge blasts Trump executive order targeting top law firm",
    "description": "A federal judge on Tuesday angrily tore into President Donald Trump's executive order targeting the top law firm WilmerHale as he struck down the entire order as unconstitutional.\n\"The cornerstone of the American system of justice is an independent judiciary …",
    "link": "https://biztoc.com/x/19d5c625a48756d7",
    "timestamp": "2025-05-27T21:30:01Z"
  },
  {
    "title": "IBIT Attracts $877M Amid Trump's Latest Tariff Threat",
    "description": "- IBIT led ETF inflows despite the market selloff on Friday. - Treasury bond ETFs gained as trade tensions escalated.",
    "link": "http://www.etf.com/sections/daily-etf-flows/ibit-attracts-877m-amid-trumps-latest-tariff-threat?utm_source=yahoo-finance&amp;utm_medium=rss&amp;utm_campaign=yahoo-finance-rss",
    "timestamp": "2025-05-27T21:30:00Z"
  },
  {
    "title": "Donald Trump Pardons Reality Show Couple Todd and Julie Chrisley",
    "description": "The Chrisley's image took a hit when they were indicted on federal charges, including tax evasion, wire fraud and conspiracy.",
    "link": "https://biztoc.com/x/fdf9c1325d4bbfa2",
    "timestamp": "2025-05-27T21:29:45Z"
  },
  {
    "title": "Republican Sen. Tommy Tuberville announces bid for Alabama governor | CNN Politics",
    "description": "Republican Sen. Tommy Tuberville announced Tuesday he is running for governor of Alabama in 2026, as the former college football coach and staunch President Donald Trump ally eyes a new role outside Washington after a single term in office.",
    "link": "https://www.cnn.com/2025/05/27/politics/tommy-tuberville-alabama-governor",
    "timestamp": "2025-05-27T21:29:16Z"
  },
  {
    "title": "Trump Asks Supreme Court to Help Him Deport People Wherever He Wants",
    "description": "Donald Trump is pleading with the Supreme Court to make it easier to deport immigrants to countries they aren’t from, like South Sudan. \r\nThe president on Tuesday filed an emergency application to the Supreme Court, asking them to stay a lower court’s injunct…",
    "link": "https://newrepublic.com/post/195762/trump-supreme-court-help-deport-immigrants-south-sudan",
    "timestamp": "2025-05-27T21:27:44Z"
  },
  {
    "title": "JUST IN: Trump Grants Full Pardon to The Chrisleys, Reality TV Stars Convicted of Shocking Fraud",
    "description": "The couple became famous on reality TV, but were eventually jailed on charges related to some $30 million in fraudulent loans\nThe post JUST IN: Trump Grants Full Pardon to The Chrisleys, Reality TV Stars Convicted of Shocking Fraud first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/just-in-trump-grants-full-pardon-to-the-chrisleys-reality-tv-stars-convicted-of-shocking-fraud/",
    "timestamp": "2025-05-27T21:27:24Z"
  },
  {
    "title": "Todd and Julie Chrisley Officially Pardoned by President Donald Trump in Bank Fraud and Tax Evasion Case",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_aab94e92-1384-40e1-a8ea-3964b135619e",
    "timestamp": "2025-05-27T21:26:45Z"
  },
  {
    "title": "Trump's Pardon for Former Virginia Sheriff Who Exchanged Badges for Cash Makes a Mockery of 'Law and Order'",
    "description": "\"We must maintain law and order at the highest level, or we will cease to have a country, 100 percent,\" said Donald Trump, then a candidate for president,",
    "link": "https://reason.com/2025/05/27/trumps-pardon-for-former-virginia-sheriff-who-exchanged-badges-for-cash-makes-a-mockery-of-law-and-order/",
    "timestamp": "2025-05-27T21:25:50Z"
  },
  {
    "title": "Tesla sales topple in Europe as Musk’s problems mount",
    "description": "Happy Tuesday. Here’s your Tuesday Tech Drop, a roundup of the past week’s top stories at the intersection of technology and politics.",
    "link": "https://www.msnbc.com/top-stories/latest/tesla-sales-europe-elon-musk-doge-rcna209328",
    "timestamp": "2025-05-27T21:25:11Z"
  },
  {
    "title": "Selling Bitcoin is like playing in a 'bad house-rate casino' — Adam Back",
    "description": "Selling Bitcoin is like “playing in a really bad house-rate casino,” according to Adam Back, CEO of Blockstream and one of Bitcoin’s earliest adopters. In a recent interview with Bitcoin financial services firm Unchained, Back said the odds are stacked agains…",
    "link": "https://cointelegraph.com/news/selling-bitcoin-like-playing-bad-house-rate-casino-adam-back",
    "timestamp": "2025-05-27T21:24:53Z"
  },
  {
    "title": "DEI Enthusiasts Allowed the Free Palestine Movement to Get This Far",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post DEI Enthusiasts Allowed the Free Palestine Movement to Get This Far app…",
    "link": "https://www.dailysignal.com/2025/05/27/dei-enthusiasts-allowed-the-free-palestine-movement-to-get-this-far/",
    "timestamp": "2025-05-27T21:24:52Z"
  },
  {
    "title": "Donald Trump Grants Full Pardon To Reality Stars Todd And Julie Chrislely",
    "description": "President Donald Trump granted a full pardon Tuesday  to reality show stars Todd and Julie Chrisley.",
    "link": "https://dailycaller.com/2025/05/27/donald-trump-full-pardon-todd-julie-chrisley-fraud/",
    "timestamp": "2025-05-27T21:24:35Z"
  },
  {
    "title": "Trump admits protecting Putin over Ukraine: ‘He’s playing with fire!’",
    "description": "President Donald Trump admitted Tuesday he’s been protecting Vladimir Putin over the Russian strongman’s refusal to end — or even scale back — the war in...",
    "link": "https://www.nydailynews.com/2025/05/27/trump-admits-protecting-putin-over-ukraine-hes-playing-with-fire/",
    "timestamp": "2025-05-27T21:23:00Z"
  },
  {
    "title": "Judge strikes down Trump executive order targeting law firm, extending his losing streak",
    "description": "“I have concluded that this Order must be struck down in its entirety as unconstitutional,\" a judge ruled, referring to a Trump order against a law firm.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/judge-strikes-trump-executive-order-targeting-law-firm-extending-losin-rcna209344",
    "timestamp": "2025-05-27T21:22:25Z"
  },
  {
    "title": "Donald Trump Pardons Reality Show Couple Todd and Julie Chrisley",
    "description": "The Chrisley's image took a hit when they were indicted on federal charges, including tax evasion, wire fraud and conspiracy.",
    "link": "https://www.newsweek.com/trump-pardons-todd-julie-chrisley-usa-reality-show-2077711",
    "timestamp": "2025-05-27T21:22:01Z"
  },
  {
    "title": "JUST IN: President Trump Signs Proclamation for Border Patrol’s 101st Anniversary: “Biden and the Democrats Refused to Celebrate and Honor Them, and Therefore Would Not Sign a Proclamation”",
    "description": "President Trump signed a proclamation on Tuesday, celebrating and honoring United States Border Patrol Agents on the 101st anniversary of the United States Border Patrol’s creation.\nThe post JUST IN: President Trump Signs Proclamation for Border Patrol’s 101s…",
    "link": "https://www.thegatewaypundit.com/2025/05/just-president-trump-signs-proclamation-border-patrols-101st/",
    "timestamp": "2025-05-27T21:20:56Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court To Allow Third-Party Country Deportations",
    "description": "A Massachusetts federal judge blocked the deportations because they were carried out without meaningful due process.",
    "link": "https://www.huffpost.com/entry/trump-administration-asks-supreme-court-to-allow-south-sudan-deportations_n_68362a30e4b0e8ae8d6cd0ec",
    "timestamp": "2025-05-27T21:19:57Z"
  },
  {
    "title": "Rubio orders U.S. embassies to suspend new student visa appointments as social screening is expanded",
    "description": "Trump plan includes crackdown on anti-Semitism",
    "link": "https://www.wnd.com/2025/05/rubio-orders-u-s-embassies-to-suspend-new-student-visa-appointments-as-social-screening-is-expanded/",
    "timestamp": "2025-05-27T21:19:46Z"
  },
  {
    "title": "Good Shoes, Talking Money, and Listening to ‘The Weave’: Mark Halperin Reveals the Do’s and Don’ts of Meeting With Trump",
    "description": "Veteran reporter Mark Halperin revealed the \"Dos and Don'ts\" for meeting with President Donald Trump on his new MK Media show on Tuesday.\nThe post Good Shoes, Talking Money, and Listening to ‘The Weave’: Mark Halperin Reveals the Do’s and Don’ts of Meeting Wi…",
    "link": "https://www.mediaite.com/media/news/good-shoes-talking-money-and-listening-to-the-weave-mark-halperin-reveals-the-dos-and-donts-of-meeting-with-trump/",
    "timestamp": "2025-05-27T21:19:18Z"
  },
  {
    "title": "Trump Invited Traders With Nazi-Linked Tokens to Private Meme Coin Dinner",
    "description": "Dozens of the roughly 200 cryptocurrency traders who were invited to a private dinner held by President Donald Trump last week hold other crypto assets with symbology linked to far right ideologies, white nationalism and neo-Nazism, a government watchdog says…",
    "link": "https://biztoc.com/x/96a0ef5dec27974d",
    "timestamp": "2025-05-27T21:18:57Z"
  },
  {
    "title": "Paratroopers may deliver gift to Trump at Army’s 250th birthday parade",
    "description": "It will be the U.S. Army’s 250th birthday but President Donald Trump may be the one getting a gift during the massive planned parade that is expected to cost upwards of $45 million.The June 14 event will also take place on President Trump’s 79th birthday, and…",
    "link": "https://www.rawstory.com/paratroopers-may-deliver-gift-to-trump-at-armys-250th-birthday-parade/",
    "timestamp": "2025-05-27T21:18:33Z"
  },
  {
    "title": "Federal judge doubles down on order to return deported Guatemalan migrant",
    "description": "A federal judge doubled down on his decision ordering the return of a Guatemalan migrant to the United States after his deportation was found to have lacked due process.",
    "link": "https://www.nbcnews.com/news/latino/federal-judge-doubles-order-return-deported-guatemalan-migrant-rcna209260",
    "timestamp": "2025-05-27T21:16:43Z"
  },
  {
    "title": "Live updates: NPR and stations file lawsuit against Trump, arguing ending federal funding is illegal (Associated Press)",
    "description": "Associated Press:\nLive updates: NPR and stations file lawsuit against Trump, arguing ending federal funding is illegal  —  National Public Radio and three local stations are suing President Donald Trump, arguing that an executive order aimed at cutting federa…",
    "link": "https://www.memeorandum.com/250527/p123",
    "timestamp": "2025-05-27T21:15:00Z"
  },
  {
    "title": "Trump Admin Pauses Student Visa Interviews Pending Social Media Vetting Increase",
    "description": "Rubio pointed to Trump’s supposed “antisemitism” orders in a cable announcing upcoming guidance.",
    "link": "https://truthout.org/articles/trump-admin-pauses-student-visa-interviews-pending-social-media-vetting-increase/",
    "timestamp": "2025-05-27T21:13:36Z"
  },
  {
    "title": "King Charles's throne speech, deconstructed: 'Not a single word was accidental'",
    "description": "The historic throne speech was tied to the annexations threat from Donald Trump, and many were looking for some defiance from King Charles.",
    "link": "https://nationalpost.com/news/politics/king-charless-throne-speech-deconstructed-not-a-single-word-was-accidental",
    "timestamp": "2025-05-27T21:13:26Z"
  },
  {
    "title": "Fox News Post Asks Should Liberal Outlets ‘Face Consequences’ For Not Covering Biden’s Decline",
    "description": "The Fox post comes amid heightened attacks on the media from President Donald Trump, who is suing CBS News and working to defund NPR and PBS\nThe post Fox News Post Asks Should Liberal Outlets ‘Face Consequences’ For Not Covering Biden’s Decline first appeared…",
    "link": "https://www.mediaite.com/media/fox-news-post-asks-should-liberal-outlets-face-consequences-for-not-covering-bidens-decline/",
    "timestamp": "2025-05-27T21:12:01Z"
  },
  {
    "title": "Trump nominee wanted voting law with 'ugly history' of barring Blacks from polls",
    "description": "A Donald Trump nominee for a lifetime federal judgeship to the U.S. District Court for the Eastern and Western Districts of Missouri has a history of promoting a policy designed to prevent Black people from voting, HuffPost revealed.Attorney Josh Divine has s…",
    "link": "https://www.rawstory.com/trump-nominees-2672215644/",
    "timestamp": "2025-05-27T21:10:16Z"
  },
  {
    "title": "Carney says more movement on tariffs needed before CUSMA talks start",
    "description": "Prime Minister Mark Carney says more progress needs to be made on resolving the tariff issue with the United States before renegotiations of the North American trade deal begin.",
    "link": "https://www.cbc.ca/news/politics/carney-cusma-trade-review-tariffs-1.7545170",
    "timestamp": "2025-05-27T21:09:33Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "U.S. stock futures are pointing sharply higher after President Donald Trump pushes back the deadline on European Union import taxes to July 9; Tesla (TSLA) sales in the EU sink for a fourth straight month; Trump Media & Technology Group (DJT) reportedly is pl…",
    "link": "https://biztoc.com/x/281d8d9b7bb70256",
    "timestamp": "2025-05-27T21:07:56Z"
  },
  {
    "title": "Trump's Approval Rating Inching Near Two-Month High: Polls",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's approval rating has inched its way near a two-month high, polls from The Economist and YouGov show.\nWhy It Matters\nTrump has routinely touted positive approval ratings and polls during…",
    "link": "https://biztoc.com/x/b1ad2bcf3e630c3e",
    "timestamp": "2025-05-27T21:07:47Z"
  },
  {
    "title": "Wall Street rallies on Trump’s EU tariff delay",
    "description": "Wall Street rallied after President Donald Trump delayed a 50% tariff on goods coming from the European Union.",
    "link": "https://www.wmur.com/article/wall-street-rally-trump-eu-tariff-delay/64895533",
    "timestamp": "2025-05-27T21:05:43Z"
  },
  {
    "title": "Nippon Steel Will Finally Get To Buy U.S. Steel. The Deal Likely Ensures More Federal Meddling in the Future.",
    "description": "The Trump administration is finally getting out of the way of Nippon Steel's acquisition of U.S. Steel—but in a way that seems to ensure more federal",
    "link": "https://reason.com/2025/05/27/nippon-steel-will-finally-get-to-buy-u-s-steel-the-deal-likely-ensures-more-federal-meddling-in-the-future/",
    "timestamp": "2025-05-27T21:05:27Z"
  },
  {
    "title": "Poll Suggests Lindsey Graham Is Vulnerable in Primary in Home State of South Carolina",
    "description": "Sen. Lindsey Graham (R-SC) seems to be vulnerable in his home state of South Carolina's primary, a Lynch for Senate poll commissioned with Pulse Opinion Research found.\nThe post Poll Suggests Lindsey Graham Is Vulnerable in Primary in Home State of South Caro…",
    "link": "https://www.breitbart.com/politics/2025/05/27/poll-suggests-lindsey-graham-is-vulnerable-in-primary-in-home-state-of-south-carolina/",
    "timestamp": "2025-05-27T21:05:11Z"
  },
  {
    "title": "US judge temporarily bars Trump admin from ending NYC congestion pricing",
    "description": "The ruling comes as US Secretary of Transportation Sean Duffy is set to pause federal funds to New York state.",
    "link": "https://www.aljazeera.com/economy/2025/5/27/us-judge-temporarily-bars-trump-admin-from-ending-nyc-congestion-pricing",
    "timestamp": "2025-05-27T21:04:41Z"
  },
  {
    "title": "Noem blasts 'weak' European leaders, stumps for conservative candidate in Poland",
    "description": "Kristi Noem pushed for Karol Nawrocki to be president of Poland while speaking at CPAC in Warsaw, decrying his opponent as a \"train wreck.\"",
    "link": "https://abcnews.go.com/Politics/noem-blasts-weak-european-leaders-stumps-conservative-candidate/story?id=122244872",
    "timestamp": "2025-05-27T21:03:05Z"
  },
  {
    "title": "Vegas Vibes and All-Time Highs: Bitcoin Faithful Flock to Sin City",
    "description": "One year after Trump headlined the annual conference, Bitcoin 2025 has landed on the Las Vegas Strip amid a record price push.",
    "link": "https://decrypt.co/322310/vegas-vibes-all-time-high-bitcoin-2025-photos",
    "timestamp": "2025-05-27T21:02:32Z"
  },
  {
    "title": "There’s Nothing Inevitable About a J.D. Vance Presidency",
    "description": "There’s nothing inevitable about a J.D. Vance presidency. The vice-president has no real base of his own, so his political future would collapse if Donald Trump abandoned him.",
    "link": "http://nymag.com/intelligencer/article/theres-nothing-inevitable-about-a-j-d-vance-presidency.html",
    "timestamp": "2025-05-27T21:01:18Z"
  },
  {
    "title": "Trump Asks Justices to Make It Easier to Deport Migrants",
    "description": "\"President Donald Trump asked the Supreme Court on Tuesday to make it easier for his administration to deport people to South Sudan and other countries that are not their homeland, the latest in a series",
    "link": "https://politicalwire.com/2025/05/27/trump-asks-justices-to-make-it-easier-to-deport-migrants/",
    "timestamp": "2025-05-27T21:00:14Z"
  },
  {
    "title": "TRUMP TOUGH TALK: 'REALLY BAD THINGS' WILL HAPPEN",
    "description": "U.S. President Donald Trump issued a fiery warning to Russian President Vladimir Putin Tuesday morning, stating that Putin was 'playing with fire.'",
    "link": "https://www.the-express.com/news/us-news/173029/trumps-warning-putin-russias-invasion",
    "timestamp": "2025-05-27T21:00:03Z"
  },
  {
    "title": "Alabama Sen. Tommy Tuberville Launches Run For Governor",
    "description": "The former college football coach has had a controversial tenure in the U.S. Senate.",
    "link": "https://www.huffpost.com/entry/tommy-tuberville-governor-alabama_n_68361838e4b0ac94727b87cb",
    "timestamp": "2025-05-27T20:59:44Z"
  },
  {
    "title": "No room for Jacinta Price on Sussan Ley’s frontbench?",
    "description": "There are reports Senator Jacinta Nampijinpa Price could miss out on a frontbench position after spectacularly defecting from the Nationals, and Trump continues to criticise Putin — to little effect. \nThe post No room for Jacinta Price on Sussan Ley’s frontbe…",
    "link": "http://www.crikey.com.au/2025/05/28/jacinta-nampijinpa-price-coalition-nationals-trump-putin-ukraine/",
    "timestamp": "2025-05-27T20:58:40Z"
  },
  {
    "title": "The crucial but invisible player in Trump’s Iran nuclear negotiations",
    "description": "Why is the Islamic republic talking to the U.S. when its supreme leader publicly claimed doing so is 'neither rational nor honorable?'",
    "link": "https://www.wnd.com/2025/05/the-crucial-but-invisible-player-in-trumps-iran-nuclear-negotiations/",
    "timestamp": "2025-05-27T20:58:04Z"
  },
  {
    "title": "Trump's War on Harvard",
    "description": "Mike Pesca joins The Reason Roundtable to discuss the Trump administration's escalating campaign against Harvard.",
    "link": "https://reason.com/podcast/2025/05/27/trumps-war-on-harvard/",
    "timestamp": "2025-05-27T20:57:50Z"
  },
  {
    "title": "Trump Media's $2.5B Bitcoin Bet: Will Others Follow?",
    "description": "Companies like TMTG will undoubtedly play a pivotal role in shaping the future of cryptocurrency adoption and regulation.",
    "link": "https://www.forbes.com/sites/christerholloman/2025/05/27/trump-medias-25b-bitcoin-bet-will-others-follow/",
    "timestamp": "2025-05-27T20:57:30Z"
  },
  {
    "title": "Trump's Approval Rating Inching Near Two-Month High: Polls",
    "description": "Trump's approval rating is near a two-month high after weeks falling below 44 percent, polls show.",
    "link": "https://www.newsweek.com/trump-approval-rating-near-two-month-high-polls-2077696",
    "timestamp": "2025-05-27T20:56:59Z"
  },
  {
    "title": "Ticker: Wall Street climbs on EU tariff delay; Consumer confidence rebounds",
    "description": "Wall Street’s roller-coaster ride created by President Donald Trump’s trade policies whipped back upward on Tuesday, this time because of a delay for his tariffs on the European Union.\nThe S&P 500 leaped 2% in its first trading since Trump said Sunday that th…",
    "link": "https://biztoc.com/x/2292ad3cbc84c166",
    "timestamp": "2025-05-27T20:56:29Z"
  },
  {
    "title": "'Absurd!' Judge blasts Trump executive order targeting top law firm",
    "description": "A federal judge angrily tore into President Donald Trump's executive order targeting the top law firm WilmerHale as he struck it down in its entirety.",
    "link": "https://www.cnbc.com/2025/05/27/trump-leon-wilmerhale-mueller.html",
    "timestamp": "2025-05-27T20:56:03Z"
  },
  {
    "title": "US suspends student visa processing as Trump, Rubio ramp up social media vetting",
    "description": "WASHINGTON: US Secretary of State Marco Rubio on Tuesday (May 27) ordered a suspension of student visa processing as President Donald Trump's administration ramps up vetting of their social media, according to an internal cable. It is the latest move that tak…",
    "link": "https://www.channelnewsasia.com/world/us-suspends-student-visa-processing-trump-rubio-ramp-up-social-media-vetting-5156241",
    "timestamp": "2025-05-27T20:55:00Z"
  },
  {
    "title": "Russia Dismisses Trump Calling Putin 'CRAZY' as an 'Emotional Reaction'",
    "description": "Kremlin spokesman Dmitry Peskov on Monday dismissed President Donald Trump’s angry criticism of Russian strongman Vladimir Putin by suggesting Trump was suffering from “emotional overstrain.”\nThe post Russia Dismisses Trump Calling Putin ‘CRAZY’ as an ‘Emotio…",
    "link": "https://www.breitbart.com/europe/2025/05/27/russia-dismisses-trump-calling-putin-crazy-as-an-emotional-reaction/",
    "timestamp": "2025-05-27T20:53:38Z"
  },
  {
    "title": "California changes high school track and field championship rules amid Trump threats over trans athletes",
    "description": "As California continues to face threats from President Donald Trump's administration over state policies allowing trans athletes in girl's sports, the state organization that oversees high school sports announced a change that aims to ensure girls are not dis…",
    "link": "https://freerepublic.com/focus/f-news/4319417/posts",
    "timestamp": "2025-05-27T20:52:29Z"
  },
  {
    "title": "State Dept. Spox Reads Out Trump’s Truth Social Threats of Putin In Hilariously Deadpan Fashion",
    "description": "Members of the press who attended Tuesday's State Department briefing were treated to a deadpan reading of Donald Trump's threats to President Vladimir Putin.\nThe post State Dept. Spox Reads Out Trump’s Truth Social Threats of Putin In Hilariously Deadpan Fas…",
    "link": "https://www.mediaite.com/politics/state-dept-spox-reads-out-trumps-truth-social-threats-of-putin-in-hilariously-deadpan-fashion/",
    "timestamp": "2025-05-27T20:51:06Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration action over congestion pricing",
    "description": "The temporary restraining order bars the Trump administration from withholding \"federal funds, approvals, or authorizations\" from New York over congestion pricing.",
    "link": "https://abcnews.go.com/US/nyc-congestion-pricing-judge-temporarily-blocks-trump-administration-action/story?id=122242788",
    "timestamp": "2025-05-27T20:49:18Z"
  },
  {
    "title": "Ticker: Wall Street climbs on EU tariff delay; Consumer confidence rebounds",
    "description": "Wall Street's roller-coaster ride created by President Donald Trump's trade policies whipped back upward on Tuesday, this time because of a delay for his tariffs on the European Union.",
    "link": "https://www.bostonherald.com/2025/05/27/ticker-wall-street-climbs-on-eu-tariff-delay-consumer-confidence-rebounds/",
    "timestamp": "2025-05-27T20:48:11Z"
  },
  {
    "title": "California changes competition rules for track and field finals amid controversy over trans athlete",
    "description": "The move comes amid a nationwide battle over the rights of transgender youth.",
    "link": "https://www.bostonherald.com/2025/05/27/california-transgender-athletes/",
    "timestamp": "2025-05-27T20:48:10Z"
  },
  {
    "title": "Donald Trump Rips Putin Again: 'He's Playing with Fire!'",
    "description": "President Donald Trump said Russian President Vladimir Putin is \"playing with fire\" and that horrible things would have happened to Russia if not for Trump.\nThe post Donald Trump Rips Putin Again: ‘He’s Playing with Fire!’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/05/27/donald-trump-rips-putin-again-hes-playing-with-fire/",
    "timestamp": "2025-05-27T20:48:06Z"
  },
  {
    "title": "State Department to ramp up screening, social media vetting for student visa applicants as interviews paused",
    "description": "The State Department is poised to increase its social media vetting for those applying for student and exchange visitor visas amid the Trump administration's immigration crackdown.",
    "link": "https://www.foxnews.com/politics/state-department-ramp-up-screening-social-media-vetting-student-visa-applicants-interviews-paused",
    "timestamp": "2025-05-27T20:47:54Z"
  },
  {
    "title": "Trump Brags About Shielding Putin, And It’s Not Going Over Well On Social Media",
    "description": "Former Rep. Adam Kinzinger noted: \"Nothing sadder than a tough guy who needs to remind you he's tough, right after admitting to shielding Russia.\"",
    "link": "https://www.huffpost.com/entry/social-media-reacts-trump-boasts-protecting-putin_n_6835fe7be4b0620c47260639",
    "timestamp": "2025-05-27T20:46:44Z"
  },
  {
    "title": "Trump asks Supreme Court to make it easier to deport migrants to South Sudan and other ‘third’ countries",
    "description": "President Donald Trump asked the Supreme Court on Tuesday to make it easier for his administration to deport people to South Sudan and other countries that are not their homeland, the latest in a series of controversial immigration policies the administration…",
    "link": "https://www.cnn.com/2025/05/27/politics/south-sudan-deportations-trump-supreme-court",
    "timestamp": "2025-05-27T20:45:46Z"
  },
  {
    "title": "Putin Ally Warns Donald Trump of World War III",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDmitry Medvedev, the deputy chairman of Russia's Security Council, hit back at Donald Trump after the United States president warned that Vladimir Putin is \"playing with fire\" by continuing his bombardment of …",
    "link": "https://biztoc.com/x/43a590947c05d183",
    "timestamp": "2025-05-27T20:45:18Z"
  },
  {
    "title": "Crypto investors who paid $148,000,000 to attend Trump's event furious at meal served",
    "description": "The honor of Donald Trump's company for an hour as well as a meal, all for $1.78 million? Who could resist?\nAlas, crypto investors who splashed the cash to attend a POTUS-hosted dinner at Trump National Golf Club near Washington DC on Thursday (May 22) were l…",
    "link": "https://biztoc.com/x/696164a0e7e0e2cb",
    "timestamp": "2025-05-27T20:45:13Z"
  },
  {
    "title": "Inside Trump’s 72-hour EU trade whiplash | CNN Business",
    "description": "President Donald Trump stunned European officials and caught some of his own senior advisers off guard with his snap decision Friday to reignite his market-rattling trade war with the European Union.",
    "link": "https://www.cnn.com/2025/05/27/business/trade-eu-trump",
    "timestamp": "2025-05-27T20:45:10Z"
  },
  {
    "title": "Tariffs Explained: I Have Everything You Need to Know as Trump Delays More Plans",
    "description": "Donald Trump's 50% import tax against the European Union is the latest tariff to get delayed, but the impacts the policies overall are still looming for folks like you.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-i-have-everything-you-need-to-know-as-trump-delays-more-plans/",
    "timestamp": "2025-05-27T20:45:00Z"
  },
  {
    "title": "Thousands of Palestinians Storm Aid Distribution Site in Gaza",
    "description": "International agencies have criticized the Gaza Humanitarian Foundation for politicizing humanitarian assistance.",
    "link": "http://foreignpolicy.com/2025/05/27/gaza-humanitarian-foundation-aid-distribution-famine-israel-hamas/",
    "timestamp": "2025-05-27T20:44:10Z"
  },
  {
    "title": "Carney says Canada is looking to join major European military buildup by July 1",
    "description": "Prime Minister Mark Carney signalled he hopes Canada will be able to sign on to a major European defence rearmament plan by July 1, a step toward reducing the country's dependency on the United States for weapons and munitions.",
    "link": "https://www.cbc.ca/news/politics/rearm-europe-deal-canada-carney-interview-1.7545303",
    "timestamp": "2025-05-27T20:43:19Z"
  },
  {
    "title": "Pediatrician Is Big Mad Trump Admin Not Recommending Healthy Kids Get COVID Jab",
    "description": "Dr. Paul Offit got very upset on Tuesday after President Donald Trump's administration ruled that the COVID-19 vaccine is no longer recommended for children.",
    "link": "https://dailycaller.com/2025/05/27/pediatrician-trump-healthy-kids-covid-jab/",
    "timestamp": "2025-05-27T20:41:59Z"
  },
  {
    "title": "Vance Will Continue The MAGA Legacy In Post-Trump World",
    "description": "In that moment, the MAGA movement gained a successor and a strategist.",
    "link": "https://dailycaller.com/2025/05/27/jd-vance-maga-legacy-post-trump-world/",
    "timestamp": "2025-05-27T20:41:33Z"
  },
  {
    "title": "Putin Ally Warns Donald Trump of World War III",
    "description": "\"I only know of one REALLY BAD thing — WWIII. I hope Trump understands this!\" Dmitry Medvedev wrote on X.",
    "link": "https://www.newsweek.com/putin-ally-warns-donald-trump-world-war-iii-2077695",
    "timestamp": "2025-05-27T20:39:17Z"
  },
  {
    "title": "More Government Intervention Won't Make Concert Tickets Cheaper",
    "description": "The Department of Justice (DOJ) and the Federal Trade Commission (FTC) have requested public comment on \"unfair and anticompetitive practices in live",
    "link": "https://reason.com/2025/05/27/more-government-intervention-wont-make-concert-tickets-cheaper/",
    "timestamp": "2025-05-27T20:39:06Z"
  },
  {
    "title": "Trump Media is the latest firm to buy billions worth of Bitcoin",
    "description": "Trump Media & Technology Group has tapped investors for $2.5 billion to fund a cryptocurrency reserve.Read more...",
    "link": "https://qz.com/trump-media-bitcoin-reserve-25-billion-investors-1851782590",
    "timestamp": "2025-05-27T20:39:00Z"
  },
  {
    "title": "S&P/TSX composite up close to 200 points, U.S. stock markets also climb",
    "description": "TORONTO — Strength in the utility, financial and technology sectors helped Canada’s main stock index gain almost 200 points on Tuesday, while U.S. stock markets also climbed. The S&P/TSX composite index was up 195.87 points at 26,269.00. Tuesday’s gains were …",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-up-close-to-200-points-u-s-stock-markets-also-climb",
    "timestamp": "2025-05-27T20:38:54Z"
  },
  {
    "title": "Trump admin asks SCOTUS to authorize rapid migrant deportations to countries other than their own",
    "description": "The Trump administration is requesting the Supreme Court intervene to block a lower-court ruling blocking its ability to rapidly deport migrants to third-party countries.",
    "link": "https://www.foxnews.com/politics/trump-admin-asks-scotus-authorize-rapid-migrant-deportations-countries-other-than-own",
    "timestamp": "2025-05-27T20:38:38Z"
  },
  {
    "title": "Tesla sales tanking in Europe, Elon will try to conceal his far-right political actions",
    "description": "It turns out that the market for electric cars and the market for fash politics do not have a great deal of overlap: Tesla sales in Europe and the U.K. have fallen by nearly half, according to data released Tuesday by the European Automobile Manufacturers Ass…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/tesla-sales-tanking-in-europe-elon-will-try-to-conceal-his-far-right-political-actions",
    "timestamp": "2025-05-27T20:36:57Z"
  },
  {
    "title": "The U.S.-backed Gaza aid plan has started operating. Why are so many humanitarian groups opposed to it?",
    "description": "Jake Wood, the American heading the effort, said Sunday night he was resigning because it was clear the organization would not be allowed to operate independently.",
    "link": "https://www.pbs.org/newshour/world/the-u-s-backed-gaza-aid-plan-has-started-operating-why-are-so-many-humanitarian-groups-opposed-to-it",
    "timestamp": "2025-05-27T20:36:04Z"
  },
  {
    "title": "US Sen. Tommy Tuberville announces 2026 bid for Alabama governor",
    "description": "Tuberville entered politics after a successful career as a head football coach at Auburn.",
    "link": "https://www.bostonherald.com/2025/05/27/election-2026-alabama-governor/",
    "timestamp": "2025-05-27T20:36:02Z"
  },
  {
    "title": "Putin ‘playing with fire’ – Trump",
    "description": "The US leader has recently made some harsh remarks toward Moscow, which the Kremlin has attributed to “emotional overload” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618230-trump-putin-playing-with-fire/",
    "timestamp": "2025-05-27T20:35:35Z"
  },
  {
    "title": "NPR is suing Trump, saying his executive order to cut funding to its network of 246 stations is based on authority he doesn’t have",
    "description": "National Public Radio and three of its local stations sued President Donald Trump on Tuesday, arguing that his executive order cutting funding to the 246-station network violates their free speech and relies on an authority that he does not have.\nEarlier this…",
    "link": "https://biztoc.com/x/4b2b612ecf9057ae",
    "timestamp": "2025-05-27T20:33:48Z"
  },
  {
    "title": "Upping the ante: Trump eyes another $100M in federal cuts from Harvard",
    "description": "The Trump administration asked federal agencies Tuesday to cancel contracts with Harvard University worth about $100 million, intensifying the president's clash with the nation's oldest and wealthiest university.",
    "link": "https://www.bostonherald.com/2025/05/27/upping-the-ante-trump-eyes-another-100m-in-federal-cuts-from-harvard/",
    "timestamp": "2025-05-27T20:33:10Z"
  },
  {
    "title": "Trump's pardon attorney reviews cases of convicted MAGA militiamen",
    "description": "President Donald Trump's pardon attorney is personally reviewing the cases of militia leaders who were convicted of seditious conspiracy for their roles in the January 6 attack, Politico reported on Tuesday.Attorney Peter Ticktin, who went to school with Trum…",
    "link": "https://www.rawstory.com/trump-s-pardon-attorney-reviews-cases-of-maga-militiamen-convicted-of-conspiracy/",
    "timestamp": "2025-05-27T20:30:30Z"
  },
  {
    "title": "US fiscal state is everyone's issue",
    "description": "As Donald Trump's \"big, beautiful\" tax bill heads to the US Senate, investors everywhere are growing increasingly uneasy. On May 16, the credit-rating agency Moody's downgraded US sovereign debt from its long-held triple-A status to Aa1 -- following similar d…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3036075/us-fiscal-state-is-everyones-issue",
    "timestamp": "2025-05-27T20:30:00Z"
  },
  {
    "title": "How Trump Plans to Avoid a Potential Third Impeachment",
    "description": "Donald Trump has a five-step plan to keep Republican control of the House of Representatives in 2026, as part of a desperate bid to stave off yet another impeachment inquiry, Axios reported Tuesday. \r\nThere is no shortage of potential subjects for an impeachm…",
    "link": "https://newrepublic.com/post/195750/donald-trump-plans-house-republican-control",
    "timestamp": "2025-05-27T20:28:29Z"
  },
  {
    "title": "Russia sends horror WW3 threat to Trump as Putin's henchman explodes at president",
    "description": "Russia’s former President Dmitry Medvedev has issued a sobering warning to Donald Trump after the US leader accused Vladimir Putin of “playing with fire”. US President Mr Trump, writing on his Truth Social platform, said: “What Vladimir Putin doesn’t realize …",
    "link": "https://freerepublic.com/focus/f-chat/4319407/posts",
    "timestamp": "2025-05-27T20:26:55Z"
  },
  {
    "title": "Trump, Tariffs, and the EU’s Dirty Little Secret",
    "description": "An existential crisis in the making.On Sunday (May 25), President Donald Trump granted the European Union a brief lifeline in his quest for reciprocity on tariffs, extending the proposed 50% burden imposition to early July. “Europe is ready to advance talks s…",
    "link": "https://freerepublic.com/focus/f-news/4319405/posts",
    "timestamp": "2025-05-27T20:26:25Z"
  },
  {
    "title": "Trump ally Tuberville announces run for Alabama governor",
    "description": "Republican Sen. Tommy Tuberville, backed by President Donald Trump, enters Alabama governor race for 2026, emphasizing his conservative roots and Auburn legacy.",
    "link": "https://www.foxnews.com/politics/trump-ally-tuberville-announces-run-alabama-governor",
    "timestamp": "2025-05-27T20:26:08Z"
  },
  {
    "title": "S&P 500 rallies 2% as Wall Street responds to Trump delay of 50% EU tariffs",
    "description": "They more than recovered their losses from Friday, when Wall Street's roller coaster dropped after Trump announced the tariffs on the European Union.",
    "link": "https://www.pbs.org/newshour/economy/sp-500-rallies-2-as-wall-street-responds-to-trump-delay-of-50-eu-tariffs",
    "timestamp": "2025-05-27T20:25:06Z"
  },
  {
    "title": "Need A Pardon? Just Have Your Mom Attend A $1 Million Mar-a-Lago Dinner",
    "description": "Donald J. Trump pardoned tax cheat Paul Walczak after his mother, Elizabeth Fago, attended a Mar-a-Lago dinner that cost her $1 million to attend. His mother’s support for Trump, including raising millions of dollars and a connection to a plot to publicize As…",
    "link": "https://crooksandliars.com/2025/05/need-pardon-just-have-your-mom-attend-1",
    "timestamp": "2025-05-27T20:23:11Z"
  },
  {
    "title": "Ron DeSantis Declares Elon Musk’s DOGE a Failure, Torches GOP Congress: ‘The Swamp Has Won’",
    "description": "Ron DeSantis (R) argued that Elon Musk's Department of Government Efficiency (DOGE) \"fought the Swamp, and so far the Swamp has won.\"\nThe post Ron DeSantis Declares Elon Musk’s DOGE a Failure, Torches GOP Congress: ‘The Swamp Has Won’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/ron-desantis-declares-elon-musks-doge-a-failure-torches-gop-congress-the-swamp-has-won/",
    "timestamp": "2025-05-27T20:22:51Z"
  },
  {
    "title": "How major US stock indexes fared Tuesday, 5/27/2025",
    "description": "Wall Street rallied after President Donald Trump delayed a 50% tariff on goods coming from the European Union. The S&P 500 jumped 2% Tuesday. Its gains...",
    "link": "https://finance.yahoo.com/news/major-us-stock-indexes-fared-202222206.html",
    "timestamp": "2025-05-27T20:22:22Z"
  },
  {
    "title": "Tuesday, May 27. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,189.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/05/27/tuesday-may-27-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-05-27T20:21:26Z"
  },
  {
    "title": "Broadway Performer Declares Trump’s Kennedy Center ‘Should Get Blown Up,’ Calls for NY to Secede From the United States",
    "description": "Broadway performer Patti LuPone repeatedly stated that the Kennedy Center under President Donald Trump’s leadership “should get blown up” during a recent interview.\nThe post Broadway Performer Declares Trump’s Kennedy Center ‘Should Get Blown Up,’ Calls for N…",
    "link": "https://www.thegatewaypundit.com/2025/05/broadway-performer-declares-trumps-kennedy-center-should-get/",
    "timestamp": "2025-05-27T20:20:01Z"
  },
  {
    "title": "After struggling in the Senate, Alabama’s Tommy Tuberville launches campaign for governor",
    "description": "Sen. Tommy Tuberville announced that he's ending his congressional career after just one term and running for governor in Alabama.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-governor-alabama-run-senate-republican-rcna209294",
    "timestamp": "2025-05-27T20:19:54Z"
  },
  {
    "title": "King Charles says Canada will stay 'strong and free' in parliament speech amid Trump threats",
    "description": "Canada’s head of state emphasised the country’s “self-determination” after the US President’s repeated talk of annexing it.",
    "link": "https://www.thejournal.ie/king-charles-canada-parliament-speech-trump-annexation-threats-6716670-May2025/",
    "timestamp": "2025-05-27T20:18:10Z"
  }
]