[
  {
    "title": "America’s Biggest Adversary Looks To Scoop Up Scientists Sent Packing Under Trump",
    "description": "China extended an offer for federal scientists recently laid off to work for abroad, according to the New York Times.",
    "link": "https://dailycaller.com/2025/06/03/china-looks-scoop-up-scientists-trump-federal-cuts/",
    "timestamp": "2025-06-03T19:58:35Z"
  },
  {
    "title": "Keith Olbermann Blames Deportations for Boulder Terror Attack: ‘Blood on Trump’s Hands’",
    "description": "President Donald Trump and the MAGA movement are to blame for Sunday’s Boulder, Colorado terror attack, according to leftist pundit Keith Olbermann, who claimed the administration’s immigration crackdown is “merely to satiate the sadism of Trump and Miller an…",
    "link": "https://www.breitbart.com/politics/2025/06/03/keith-olbermann-blames-deportations-for-boulder-terror-attack-blood-on-trumps-hands/",
    "timestamp": "2025-06-03T19:58:16Z"
  },
  {
    "title": "Trump and Netanyahu Were Marching in Lockstep—Until They Weren’t",
    "description": "For the first time in decades, a U.S. president is veering away from Israel.",
    "link": "http://foreignpolicy.com/2025/06/03/trump-netanyahu-moving-apart/",
    "timestamp": "2025-06-03T19:57:45Z"
  },
  {
    "title": "Elon Musk predicts SpaceX revenue to reach more than $15B in 2025 as launch demand booms",
    "description": "While NASA continues to fund deep space exploration and research missions, SpaceX has leaned on growing demand for cost-effective launch services and satellite communications to generate revenue.",
    "link": "https://nypost.com/2025/06/03/business/elon-musk-predicts-spacex-revenue-of-more-than-15b-in-2025/",
    "timestamp": "2025-06-03T19:55:25Z"
  },
  {
    "title": "Donald Trump Jr. Says Family Got Into Crypto After Being Debanked, Realizing Financial System Was ‘Pyramid Scheme’",
    "description": "The son of the President says that the Trump family went all-in on crypto out of necessity, not because it’s an emerging trend. In a new interview with CNBC, Donald J. Trump Jr., son of U.S. President Donald J. Trump, says the family got into crypto after bei…",
    "link": "https://dailyhodl.com/2025/06/03/donald-trump-jr-says-family-got-into-crypto-after-being-debanked-realizing-financial-system-was-pyramid-scheme/",
    "timestamp": "2025-06-03T19:55:14Z"
  },
  {
    "title": "Trump expected to waive Defense Production Act requirements to boost critical minerals, weapons",
    "description": "U.S. President Donald Trump is set to slash some legal requirements, including congressional approval for larger projects, to help boost domestic production ...",
    "link": "https://ca.finance.yahoo.com/news/trump-expected-waive-defense-production-195428898.html",
    "timestamp": "2025-06-03T19:54:28Z"
  },
  {
    "title": "Why a Bitcoin Treasury Strategy Is Risky: Analyst",
    "description": "Roughly half of Bitcoin treasuries established by non-crypto companies will be forced to liquidate if Bitcoin falls below $90,000, the Standard Chartered analyst wrote.",
    "link": "https://decrypt.co/323489/why-a-bitcoin-treasury-strategy-is-risky-analyst",
    "timestamp": "2025-06-03T19:52:20Z"
  },
  {
    "title": "Trump-Branded Crypto Wallet Sparks Controversy, Trump Family Denies Involvement",
    "description": "A cryptocurrency wallet branded with the Trump name is under fire after Donald Trump Jr. and Eric Trump publicly denied any connection to it.\nWhat Happened: Marketed through the website trumpwallet.com and described as \"The First and Only Crypto Wallet for Tr…",
    "link": "https://biztoc.com/x/510ddf1433bc780d",
    "timestamp": "2025-06-03T19:52:17Z"
  },
  {
    "title": "Marjorie Taylor Greene Vows to 'Not Vote' for Spending Bill Without 'Stripping' AI Ban Despite Already Voting for It",
    "description": "Georgia Rep. Majorie Taylor Greene shared that she planned to \"not vote\" for Republicans' massive spending bill she just voted if it returns back to the House.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-vows-not-vote-spending-bill-without-stripping-ai-ban-despite-3775125",
    "timestamp": "2025-06-03T19:52:12Z"
  },
  {
    "title": "Trump’s Tariffs Hit Harder Than Expected as OECD Slashes U.S. Growth Forecast",
    "description": "President Donald Trump’s turbulent tariffs are projected to cause a sharper slowdown in economic growth in the U.S. than previously expected.",
    "link": "https://time.com/7290808/trump-tariffs-oecd-economic-forecast/",
    "timestamp": "2025-06-03T19:50:51Z"
  },
  {
    "title": "The true cost of Trump’s massive military parade seems to keep getting worse",
    "description": "Donald Trump’s plans for a massive, expensive military parade in Washington, D.C., already seemed absurd when juxtaposed against his administration’s mass firings at federal agencies and his plans to institute deep cuts to federal programs many Americans rely…",
    "link": "https://www.msnbc.com/top-stories/latest/trump-military-parade-cost-washington-dc-streets-bowser-rcna210671",
    "timestamp": "2025-06-03T19:50:20Z"
  },
  {
    "title": "\"Disgusting Abomination\": Cold War Between Musk and Trump Explodes Into Public",
    "description": "In a scorching tweet, billionaire Elon Musk took aim at president Donald Trump's so-called \"big, beautiful bill,\" excorciating it as a \"disgusting abomination\" that will massively increase the federal budget deficit. It was a shocking escalation in tone follo…",
    "link": "https://futurism.com/elon-musk-donald-trump-war",
    "timestamp": "2025-06-03T19:49:45Z"
  },
  {
    "title": "Meme fest on 'robotic Joe Biden' begins after Trump's new portrait is out",
    "description": "Donald Trump's official portrait is out. The portrait shows Trump in a dark suit. It has sparked online buzz. Some connect it to a conspiracy theory. The theory involves Joe Biden. It claims Biden was replaced by a robot. The portrait is in the Eisenhower Exe…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/meme-fest-on-robotic-joe-biden-begins-after-trumps-new-portrait-is-out/articleshow/121606664.cms",
    "timestamp": "2025-06-03T19:47:36Z"
  },
  {
    "title": "White House hands Americans 'big beautiful bill' calculator to determine how much they'd save under act",
    "description": "The White House launched a website that can calculate savings from the Trump-backed \"big beautiful bill\" as it works through the Senate, Fox Digital exclusively learned.",
    "link": "https://www.foxnews.com/politics/white-house-hands-americans-big-beautiful-bill-calculator-determine-how-much-theyd-save-under-act",
    "timestamp": "2025-06-03T19:47:08Z"
  },
  {
    "title": "Trump Cut Funds From Wasteful Projects To Spend on Wasteful Statue Garden",
    "description": "President Donald Trump has pledged to cut government waste, but hasn't delivered much on that front so far. Even when his administration has cut from",
    "link": "https://reason.com/2025/06/03/trump-cut-funds-from-wasteful-projects-to-spend-on-wasteful-statue-garden/",
    "timestamp": "2025-06-03T19:46:36Z"
  },
  {
    "title": "White House Says Elon Musk Ripping Trump-Backed Bill as ‘Disgusting Abomination’ Doesn’t Change a Thing",
    "description": "The Tesla boss continues to voice his displeasure with the president's \"Big Beautiful Bill,\" which he calls \"outrageous\" and \"pork-filled\"\nThe post White House Says Elon Musk Ripping Trump-Backed Bill as ‘Disgusting Abomination’ Doesn’t Change a Thing appeare…",
    "link": "https://www.thewrap.com/elon-musk-trump-spending-bill-white-house-response/",
    "timestamp": "2025-06-03T19:46:12Z"
  },
  {
    "title": "Trump budget request would slash Va. housing programs, advocates say",
    "description": "President Donald Trump’s budget request for the next fiscal year would cut $1.9 billion of various housing and community development funds Virginia receives, the Virginia Housing Alliance says.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_dc70cad0-baff-4f79-b5d1-fa6c752da5a7.html",
    "timestamp": "2025-06-03T19:45:00Z"
  },
  {
    "title": "US Firm BCG Pulls Out of US’s Gaza “Humanitarian” Scheme as Casualties Rack Up",
    "description": "Over 600 Palestinians have been killed or injured near the US-backed sites in just a week.",
    "link": "https://truthout.org/articles/us-firm-bcg-pulls-out-of-uss-gaza-humanitarian-scheme-as-casualties-rack-up/",
    "timestamp": "2025-06-03T19:43:33Z"
  },
  {
    "title": "Trump Weighs New Russia Sanctions as Senate Vows to Move Ahead",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere is growing support in the Senate for new sanctions on Russia intended to pressure the country to wind down its war in Ukraine.\nBut it remains unclear if President Donald Trump will back a bipartisan Sena…",
    "link": "https://biztoc.com/x/0ad3aa66cfa6be2e",
    "timestamp": "2025-06-03T19:41:00Z"
  },
  {
    "title": "Stablecoin Bills in House and Senate Still Need to Mesh on Several Points: French Hill",
    "description": "The U.S. crypto bills are similar but must work out matters of acceptable foreign oversight, who regulates in the U.S. and on Big Tech issuers, the top lawmaker said.",
    "link": "https://www.coindesk.com/policy/2025/06/03/stablecoin-bills-in-house-and-senate-still-need-to-mesh-on-several-points-french-hill",
    "timestamp": "2025-06-03T19:40:21Z"
  },
  {
    "title": "Trump's USD1 stablecoin is off to a rocky start, data shows",
    "description": "Donald Trump Jr. framed stablecoins as a tool for reinforcing U.S. dollar dominance, calling them “the savior of dollar hegemony, not a detractor of it.”",
    "link": "https://www.cnbc.com/2025/06/03/trump-usd1-stablecoin.html",
    "timestamp": "2025-06-03T19:39:53Z"
  },
  {
    "title": "‘Elon is Terribly Wrong!’ Speaker Johnson Lashes Out at Musk for Trashing Trump’s Budget Bill",
    "description": "Mike Johnson snapped back at \"friend\" Elon Musk after the billionaire called President Donald Trump's \"Big Beautiful Bill\" an \"abomination.\"\nThe post ‘Elon is Terribly Wrong!’ Speaker Johnson Lashes Out at Musk for Trashing Trump’s Budget Bill first appeared …",
    "link": "https://www.mediaite.com/media/tv/elon-is-terribly-wrong-speaker-johnson-lashes-out-at-musk-for-trashing-trumps-budget-bill/",
    "timestamp": "2025-06-03T19:38:32Z"
  },
  {
    "title": "Family of Boulder attack suspect are being taken into ICE custody",
    "description": "Family of Boulder attack suspect are being taken into ICE custodycpr.org",
    "link": "https://www.cpr.org/2025/06/03/ice-detains-family-of-boulder-attack-suspect/",
    "timestamp": "2025-06-03T19:38:32Z"
  },
  {
    "title": "Eric Trump and Donald Trump Jr. deny involvement in Magic Eden’s ‘Trump Wallet’",
    "description": "Eric Trump and Donald Trump Jr. denied involvement in Magic Eden’s June 3 announcement of a partnership to develop a “Trump Wallet.” On June 3, Magic Eden announced it was developing a new Trump wallet and shared a landing page with a public waitlist. The pag…",
    "link": "https://cryptoslate.com/eric-trump-and-donald-trump-jr-deny-involvement-in-magic-edens-trump-wallet/",
    "timestamp": "2025-06-03T19:38:25Z"
  },
  {
    "title": "White House says Trump will double tariffs on steel, aluminum tomorrow",
    "description": "WASHINGTON — White House press secretary Karoline Leavitt says President Donald Trump will double steel and aluminum tariffs on Wednesday. As Canadian officials were preparing for meetings in Washington on Tuesday, Leavitt said Trump would sign an executive o…",
    "link": "https://financialpost.com/pmn/white-house-says-trump-will-double-tariffs-on-steel-aluminum-tomorrow",
    "timestamp": "2025-06-03T19:37:23Z"
  },
  {
    "title": "Neil Young Invites Trump to Summer Tour “If There Is Not Martial Law by Then”",
    "description": "\"We are proud to be who we are, and must never let our government forget it.\"\nNeil Young Invites Trump to Summer Tour “If There Is Not Martial Law by Then”\nBen Kaye",
    "link": "https://consequence.net/2025/06/neil-young-trump-summer-tour-invite/",
    "timestamp": "2025-06-03T19:36:20Z"
  },
  {
    "title": "Pittsburgh Steelers Send Letter To Fans Upset About Players Attending Trump Rally",
    "description": "The Pittsburgh Steelers sent an email to fans who were upset by the appearances of some of their players at a rally for President Donald Trump on Friday. During the rally, quarterback Mason Rudolph, safety Miles Killebrew and former Steelers running back Rock…",
    "link": "https://brobible.com/sports/article/pittsburgh-steelers-letter-fans-players-trump-rally/",
    "timestamp": "2025-06-03T19:35:54Z"
  },
  {
    "title": "Marjorie Taylor Greene Complains About Key Provision in Trump Budget Bill She Didn’t Read: ‘I am Adamantly OPPOSED’ and ‘Would Have Voted NO’",
    "description": "Rep. Marjorie Taylor Greene (R-GA) voted for the \"One Big Beautiful Bill\" that's backed by President Donald Trump, but admitted on Tuesday that she had not read it.\nThe post Marjorie Taylor Greene Complains About Key Provision in Trump Budget Bill She Didn’t …",
    "link": "https://www.mediaite.com/online/marjorie-taylor-greene-complains-about-key-provision-in-trump-budget-bill-she-didnt-read-i-am-adamantly-opposed-and-would-have-voted-no/",
    "timestamp": "2025-06-03T19:35:53Z"
  },
  {
    "title": "U.S. CISA adds ASUS RT-AX55 devices, Craft CMS, and ConnectWise ScreenConnect flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds ASUS RT-AX55 devices, Craft CMS, and ConnectWise ScreenConnect flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added ASUS …",
    "link": "https://securityaffairs.com/178591/hacking/u-s-cisa-adds-asus-rt-ax55-devices-craft-cms-and-connectwise-screenconnect-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-06-03T19:34:51Z"
  },
  {
    "title": "Unfortunately, the Genius Behind Project 2025 Is Picking up Where Elon Musk Left Off",
    "description": "The Project 2025 architect’s devotion to his fellow citizens can be measured in milliliters.",
    "link": "https://www.esquire.com/news-politics/politics/a64958912/russell-vought-project-2025-doge-elon-musk/",
    "timestamp": "2025-06-03T19:34:00Z"
  },
  {
    "title": "Trump Weighs New Russia Sanctions as Senate Vows to Move Ahead",
    "description": "Pressure is growing in Washington for new sanctions to be placed on Russia in order to push Moscow to wind down the war in Ukraine.",
    "link": "https://www.newsweek.com/trump-weighs-new-russia-sanctions-senate-vows-move-ahead-2080549",
    "timestamp": "2025-06-03T19:32:38Z"
  },
  {
    "title": "GOP-Appointed Judge Blocks Trump Executive Order On Transgender Inmates",
    "description": "A federal judge appointed by Ronald Reagan blocked the enforcement of Trump's executive order targeting \"gender ideology.\"",
    "link": "https://www.newsweek.com/judge-blocks-trump-executive-order-transgender-inmates-2080540",
    "timestamp": "2025-06-03T19:32:29Z"
  },
  {
    "title": "Like a lot of filthy rich, big ass donors, Melonpledged some 200 million to Trumpy's reelection, but like a lot of big ass donors he only actually delivered 1/2. Now President TACO hereby declares that Melon owes him 100 million. Hahahahaha [Amusing]",
    "description": "Like a lot of filthy rich, big ass donors, Melonpledged some 200 million to Trumpy's reelection, but like a lot of big ass donors he only actually delivered 1/2. Now President TACO hereby declares that Melon owes him 100 million. Hahahahaha",
    "link": "https://www.fark.com/comments/13694196/Like-a-lot-of-filthy-rich-big-ass-donors-Melonpledged-some-200-million-to-Trumpys-reelection-but-like-a-lot-of-big-ass-donors-he-only-actually-delivered-12-Now-President-TACO-hereby-declares-that-Melon-owes-him-100-million-Hahahahaha",
    "timestamp": "2025-06-03T19:30:24Z"
  },
  {
    "title": "Ukraine blast Donald Trump with sarcastic message months after White House furore (\"Today Zelensky played the King of Drones\")",
    "description": "\"They (Ukraine) don't have any cards, but they play it tough. But we're not going to let this continue.\" (Trump said this three months ago during the Trump, Zelensky, JDVance, Marco Rubio press conference White House) In a cheeky nod to Trump's card analogy, …",
    "link": "https://freerepublic.com/focus/f-chat/4320783/posts",
    "timestamp": "2025-06-03T19:30:24Z"
  },
  {
    "title": "Elon Musk calls Trump-backed megabill ‘a disgusting abomination’",
    "description": "Elon Musk blasted the Republican spending bill, the signature legislation of President Donald Trump's first year back in office, in a post on X Tuesday.",
    "link": "https://biztoc.com/x/fe762912311a8adf",
    "timestamp": "2025-06-03T19:30:10Z"
  },
  {
    "title": "Trump Wants to Cut Tribal College Funding by Nearly 90%, Putting Them at Risk of Closing",
    "description": "by Matt Krupnick for ProPublica \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nThe Trump administration has proposed cutting funding for triba…",
    "link": "https://www.propublica.org/article/tribal-colleges-universities-trump-cuts-funding",
    "timestamp": "2025-06-03T19:30:00Z"
  },
  {
    "title": "Man accused of trying to get witness deported by writing letters threatening Trump",
    "description": "A Wisconsin man faces charges accusing him of forging a letter threatening President Donald Trump's life to get another man who was a potential witness against him deported.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_81b9c33e-bad3-58df-b9bb-8f02e993ac57.html",
    "timestamp": "2025-06-03T19:30:00Z"
  },
  {
    "title": "Sigma Has Increased its Prices by 10% in the US in Response to Tariffs",
    "description": "Sigma's promised price increases have gone into effect as planned. The price hikes in the United States are all around 10%, reflecting the current tariff rate on most Japanese goods.\n[Read More]",
    "link": "https://petapixel.com/2025/06/03/sigma-has-increased-its-prices-by-10-in-the-us-in-response-to-tariffs/",
    "timestamp": "2025-06-03T19:28:17Z"
  },
  {
    "title": "'Constant lapses and verbal aphasias': Republican advisor drops a bomb on Donald Trump's mental health",
    "description": "Republican strategist Rick Wilson suggests Donald Trump's behavior indicates possible mental decline. Concerns arise from Trump's incoherence and verbal difficulties. A former advisor even speculated about syphilis. Experts suspect early dementia signs, despi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/constant-lapses-and-verbal-aphasias-republican-advisor-drops-a-bomb-on-donald-trumps-mental-health/articleshow/121606226.cms",
    "timestamp": "2025-06-03T19:28:07Z"
  },
  {
    "title": "'Seems like their divorce is happening': Mockery as Musk lets rip on Trump bill",
    "description": "Tech billionaire and supporter of President Donald Trump, Elon Musk, is getting louder after his initial attack on the president's \"big, beautiful bill\" for the 2026 budget. Last month, Musk told CBS last month he's sure the bill could be \"big\" or \"beautiful,…",
    "link": "https://www.rawstory.com/elon-musk-budget/",
    "timestamp": "2025-06-03T19:27:50Z"
  },
  {
    "title": "World Aquatics to ban anyone from Enhanced Games",
    "description": "World Aquatics becomes the first international federation to ban anyone, which includes athletes and coaches, taking part in the controversial Enhanced Games.",
    "link": "https://www.bbc.com/sport/swimming/articles/c39x3ppx18jo",
    "timestamp": "2025-06-03T19:27:47Z"
  },
  {
    "title": "Trump to attend NATO summit in The Hague",
    "description": "US President Donald Trump will attend a NATO summit in The Hague later in June where his demands to ramp up defense spending will dominate the agenda, the White House said Tuesday. Trump has long criticized NATO partners for not paying their fair share and ha…",
    "link": "https://www.digitaljournal.com/world/trump-to-attend-nato-summit-in-the-hague/article",
    "timestamp": "2025-06-03T19:27:20Z"
  },
  {
    "title": "‘Malicious’: New Jersey Mayor Ras Baraka sues US attorney after arrest",
    "description": "Baraka, a candidate for New Jersey's governor race, has condemned members of Trump administration for 'false arrest'.",
    "link": "https://www.aljazeera.com/news/2025/6/3/malicious-new-jersey-mayor-ras-baraka-sues-us-attorney-after-arrest",
    "timestamp": "2025-06-03T19:27:14Z"
  },
  {
    "title": "Outspoken liberal leader Lee elected South Korea's president, closing period of political tumult",
    "description": "Liberal opposition candidate Lee Jae-myung has been elected president of South Korea",
    "link": "https://abcnews.go.com/Business/wireStory/outspoken-liberal-leader-lee-elected-south-koreas-president-122452406",
    "timestamp": "2025-06-03T19:26:38Z"
  },
  {
    "title": "Trump pardons divers who freed 19 sharks off the coast of Florida",
    "description": "South Florida divers pardoned by Trump after freeing sharks from a fishing line",
    "link": "https://www.wyff4.com/article/shark-divers-pardoned-trump-freed-sharks/64958874",
    "timestamp": "2025-06-03T19:26:09Z"
  },
  {
    "title": "Musk blasts Trump mega-bill, days after farewell",
    "description": "WASHINGTON - Elon Musk on Tuesday hammered US President Donald Trump's proposed spending bill as a \"disgusting abomination\" as tensions between the pair burst into the open following the tech billionaire's White House exit.",
    "link": "https://www.bangkokpost.com/world/3041042/musk-blasts-trump-mega-bill-days-after-farewell",
    "timestamp": "2025-06-03T19:26:00Z"
  },
  {
    "title": "State Lawmakers Call on Congress to Ditch 'Ridiculous' Legislation Forbidding Local Regulation of AI",
    "description": "A bipartisan group of state lawmakers told their counterparts in the U.S. Congress Tuesday that they hear frequently from their constituents about concerns regarding the rise of artificial intelligence and demanded that they not leave people across the countr…",
    "link": "https://www.commondreams.org/news/ai-state",
    "timestamp": "2025-06-03T19:23:56Z"
  },
  {
    "title": "Judge says federal prisons must continue paying for trans inmates to get cross-sex hormones, overturning Trump order",
    "description": "Nope, not satire. Just your tax dollars at work. The federal Bureau of Prisons must continue providing hormone therapy and social accommodations to hundreds of transgender inmates following an executive order signed by President Donald Trump that led to a dis…",
    "link": "https://freerepublic.com/focus/f-bloggers/4320781/posts",
    "timestamp": "2025-06-03T19:23:28Z"
  },
  {
    "title": "After Just 4 Months Under Trump, Fed Predicts GDP Spike for Current Quarter",
    "description": "\"Just a few weeks ago the 'experts' were warning of another negative GDP quarter, with a recession looming,\" David Asman of Fox Business said.",
    "link": "https://www.westernjournal.com/just-4-months-trump-fed-predicts-gdp-spike-current-quarter/",
    "timestamp": "2025-06-03T19:21:32Z"
  },
  {
    "title": "BlackRock Escapes Texas Oil-Boycott Blacklist After ESG Retreat",
    "description": "BlackRock Inc. was removed from Texas’ blacklist of companies that boycott fossil fuels, ending a three-year standoff over the environmental policies of the world’s largest asset manager.",
    "link": "https://financialpost.com/pmn/business-pmn/blackrock-escapes-texas-oil-boycott-blacklist-after-esg-retreat",
    "timestamp": "2025-06-03T19:21:03Z"
  },
  {
    "title": "Biggest Supreme Court Cases To Be Decided This Month",
    "description": "Supreme Court is expected to weigh in on issues such as birthright citizenship and gender and sexuality instruction in schools.",
    "link": "https://www.newsweek.com/biggest-supreme-court-cases-decided-this-month-2080513",
    "timestamp": "2025-06-03T19:20:53Z"
  },
  {
    "title": "Tallying Trump’s online posting frenzy: 2,262 ‘truths’ in 132 days",
    "description": "In his current term, the influencer-in-chief has left his own record for social media missives in the dust. He posts day and night.President Donald Trump is posting on the internet with a velocity and ferocity far beyond that of his first term, surprising aid…",
    "link": "https://freerepublic.com/focus/f-news/4320779/posts",
    "timestamp": "2025-06-03T19:19:50Z"
  },
  {
    "title": "In Your heart you always knew it was true: Gen X is in fact the coolest generation. Here comes the science [Cool]",
    "description": "In Your heart you always knew it was true: Gen X is in fact the coolest generation. Here comes the science",
    "link": "https://www.fark.com/comments/13693762/In-Your-heart-you-always-knew-it-was-true-Gen-X-is-in-fact-coolest-generation-Here-comes-science",
    "timestamp": "2025-06-03T19:18:49Z"
  },
  {
    "title": "Trump Blasts Rand Paul as ‘Crazy’ Over Tax Bill Stance",
    "description": "President Donald Trump attacked fiscal conservative Rand Paul as “crazy” Tuesday morning as he pressed reluctant Republican senators to move forward swiftly with his massive tax and spending package.\nThe Kentucky senator earlier said on CNBC that he wouldn’t …",
    "link": "https://biztoc.com/x/7a513b974f989339",
    "timestamp": "2025-06-03T19:18:40Z"
  },
  {
    "title": "Ivanka Trump Promotes Book by Author Who Warned About Donald's Presidency",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIvanka Trump shared a photograph on Instagram promoting a book written by a vocal critic of her father, President Donald Trump.\nNewsweek reached out to the White House for comment via email.\nThe Context\nIvanka…",
    "link": "https://biztoc.com/x/f4dbb459ee7540fd",
    "timestamp": "2025-06-03T19:18:37Z"
  },
  {
    "title": "Ivanka Trump Promotes Book by Author Who Warned About Donald's Presidency",
    "description": "The president's daughter shared an Instagram post of a book by a vocal Trump critic.",
    "link": "https://www.newsweek.com/ivanka-trump-promoted-book-author-criticized-president-2080486",
    "timestamp": "2025-06-03T19:14:44Z"
  },
  {
    "title": "'I lament that': Mike Johnson 'disappointed' in Elon after spending bill spat",
    "description": "House Speaker Mike Johnson reacted with disappointment after former DOGE administrator Elon Musk called President Donald Trump's \"One Big Beautiful Bill\" a \"disgusting abomination.\"Musk unloaded on the spending bill in a Monday post on X.\"I'm sorry, but I jus…",
    "link": "https://www.rawstory.com/johnson-musk-spending-bill/",
    "timestamp": "2025-06-03T19:10:07Z"
  },
  {
    "title": "Document-Wielding Peter Doocy Asks Karoline Leavitt Pressing Question About Biden Autopen Signatures",
    "description": "Fox News' Peter Doocy held up copies of former President Joe Biden's pardons to ask White House press secretary Karoline Leavitt if they are all seen as valid.",
    "link": "https://dailycaller.com/2025/06/03/peter-doocy-biden-pardons-karoline-leavitt-autopen/",
    "timestamp": "2025-06-03T19:09:37Z"
  },
  {
    "title": "Good and hard",
    "description": "Trump voters experience Trump governance, a potentially infinite series: On a blustery Memorial Day weekend, customers trickled into Seven Points Bait & Grocery looking for fingerling trout and nightcrawlers, for scoops of sweet and salty caramel ice cream an…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/good-and-hard-5",
    "timestamp": "2025-06-03T19:09:25Z"
  },
  {
    "title": "Trump administration moves to fast-track firings of federal workers for misconduct",
    "description": "(Reuters) -President Donald Trump's administration moved on Tuesday to make it easier to fire federal employees for misconduct, the latest step in a broader ...",
    "link": "https://ca.news.yahoo.com/trump-administration-moves-fast-track-190839310.html",
    "timestamp": "2025-06-03T19:08:39Z"
  },
  {
    "title": "Trump pushes Senate to pass his big tax bill by July 4",
    "description": "President Donald Trump wants his “big, beautiful” bill of tax breaks and spending cuts on his desk to be signed into law by the Fourth of July, and he’s pushing the slow-rolling Senate to make it happen sooner rather than later.\nTrump met with Senate Majority…",
    "link": "https://biztoc.com/x/6a48cb2e081b32f6",
    "timestamp": "2025-06-03T19:07:47Z"
  },
  {
    "title": "Canadian steel tycoon Barry Zekelman backs Trump, slams Carney in escalating trade war",
    "description": "Canadian billionaire steel tycoon Barry Zekelman is cheering on Donald Trump’s plans to jack up tariffs on Canadian steelmakers, and is blaming Canada for bringing the problem on itself by failing to crack down on foreign dumping into the domestic market.\nMr.…",
    "link": "https://biztoc.com/x/6f556ca1c3959e61",
    "timestamp": "2025-06-03T19:07:46Z"
  },
  {
    "title": "Hegseth Orders Navy to Strip Name of Gay Rights Icon Harvey Milk from Ship",
    "description": "Defense Secretary Pete Hegseth has ordered the Navy to take the rare step of renaming a ship, one that bears the name of a gay rights icon, documents and sources show. Military.com reviewed a memorandum from the Office of the Secretary of the Navy -- the offi…",
    "link": "https://freerepublic.com/focus/f-news/4320774/posts",
    "timestamp": "2025-06-03T19:07:45Z"
  },
  {
    "title": "Trump’s Team ‘Knows Nothing’ About Apparent ‘$TRUMP Wallet’ Launch",
    "description": "A representative for the Trump Organization distanced the group from a new crypto app branded with the former president’s name.",
    "link": "https://www.coindesk.com/business/2025/06/03/trumps-team-knows-nothing-about-apparent-trump-wallet-launch",
    "timestamp": "2025-06-03T19:07:37Z"
  },
  {
    "title": "Biden, Obama Judges Make Up the Bulk of Rulings Against Trump Policies",
    "description": "Of the lower court judges who have blocked President Donald Trump’s executive orders and other administration actions since he returned to office in January, Democrat... Read More\nThe post Biden, Obama Judges Make Up the Bulk of Rulings Against Trump Policies…",
    "link": "https://www.dailysignal.com/2025/06/03/biden-obama-judges-make-bulk-rulings-against-trump-policies/",
    "timestamp": "2025-06-03T19:07:35Z"
  },
  {
    "title": "What’s happening in the Netherlands? Dutch government collapses after far-right party leaves ruling coalition over immigration",
    "description": "Immigration, which has dominated the headlines in the United States since President Donald Trump kicked off his second term in January, is also making headlines in Europe. On Tuesday in the Netherlands, Prime Minister Dick Schoof stepped down after the leader…",
    "link": "https://biztoc.com/x/5b93510ffa63d3f0",
    "timestamp": "2025-06-03T19:07:24Z"
  },
  {
    "title": "Elon Musk calls Trump-backed megabill ‘a disgusting abomination’",
    "description": "Elon Musk blasted the Republican spending bill, the signature legislation of President Donald Trump's first year back in office, in a post on X Tuesday.",
    "link": "https://www.msnbc.com/top-stories/latest/musk-trump-big-bill-x-post-abomination-rcna210691",
    "timestamp": "2025-06-03T19:05:49Z"
  },
  {
    "title": "Musk Slams Republicans Who Voted for Trump's 'Pork-Filled' Budget Bill: 'You Know You Did Wrong'",
    "description": "Elon Musk took to his platform X to slam Republicans who voted for what he called the \"pork-filled\" budget bill supported by President Donald Trump.",
    "link": "https://www.ibtimes.com/musk-slams-republicans-who-voted-trumps-pork-filled-budget-bill-you-know-you-did-wrong-3775121",
    "timestamp": "2025-06-03T19:05:12Z"
  },
  {
    "title": "Joy Reid floats speculation that her race, 'anxiety' surrounding Trump played role in MSNBC firing",
    "description": "Former MSNBC host Joy Reid spoke out about her MSNBC exit on Monday, weighing in on speculation that anxiety over Trump and her race played a role.",
    "link": "https://www.foxnews.com/media/joy-reid-suggests-anxiety-surrounding-trump-her-race-played-role-msnbc-firing",
    "timestamp": "2025-06-03T19:04:39Z"
  },
  {
    "title": "Nick Offerman Eviscerates Mike Flynn’s Son for Homophobic ‘Parks and Recreation’ Tweet: ‘You Dumb F–k’",
    "description": "Ron Swanson is an ally through and through\nThe post Nick Offerman Eviscerates Mike Flynn’s Son for Homophobic ‘Parks and Recreation’ Tweet: ‘You Dumb F–k’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/nick-offerman-parks-and-rec-pride-tweet/",
    "timestamp": "2025-06-03T19:03:11Z"
  },
  {
    "title": "Judge Dismisses California’s Tariff Lawsuit, Teeing up Appeal",
    "description": "A U.S. judge dismissed the state of California’s challenge to President Donald Trump’s tariffs, allowing the state to file an appeal over the court’s ruling that the dispute should have been filed in a specialized U.S. trade court in New …",
    "link": "https://www.insurancejournal.com/news/west/2025/06/03/826186.htm",
    "timestamp": "2025-06-03T19:02:34Z"
  },
  {
    "title": "DAVID BOSSIE: Time For Congress To Pull Back The Curtain On Biden",
    "description": "The wide-ranging cover-up of former President Joe Biden’s cognitive decline must be prioritized and fully investigated by Congress.",
    "link": "https://dailycaller.com/2025/06/03/opinion-time-for-congress-to-pull-back-the-curtain-on-biden-david-bossie/",
    "timestamp": "2025-06-03T19:02:12Z"
  },
  {
    "title": "'I’ll make sure he knows': 50 Cent has warning for Donald Trump on Diddy pardon",
    "description": "50 Cent has publicly cautioned Donald Trump against potentially pardoning Sean \"Diddy\" Combs, who is facing serious federal charges, including racketeering and sex trafficking. This warning follows Trump's statement that he would consider clemency if he belie…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ill-make-sure-he-knows-50-cent-has-warning-for-donald-trump-on-diddy-pardon/articleshow/121605265.cms",
    "timestamp": "2025-06-03T19:00:41Z"
  },
  {
    "title": "Savannah Chrisley stands firm against rumors she slept with someone to get parents pardoned",
    "description": "Savannah Chrisley rejects claims she slept with someone for a pardon, highlighting her fight against injustices in her parents Todd and Julie's case.",
    "link": "https://www.foxnews.com/entertainment/savannah-chrisley-stands-firm-rumors-slept-parents-pardoned",
    "timestamp": "2025-06-03T19:00:34Z"
  },
  {
    "title": "'Remigration': The far right's plan to expel non-white people from Europe",
    "description": "Those on the far-right fringe in Ireland are following the lead of more established anti-immigration parties on the continent.",
    "link": "https://www.thejournal.ie/what-is-remigration-ireland-6692253-Jun2025/",
    "timestamp": "2025-06-03T19:00:25Z"
  },
  {
    "title": "50 Cent Brings Up All The Times Diddy Spoke Out Against Donald Trump",
    "description": "50 Cent is working around the clock to ensure that Diddy does not receive a presidential pardon from Donald Trump if he is found guilty of sex trafficking.",
    "link": "https://hiphopdx.com/news/50-cent-brings-times-diddy-spoke-out-against-donald-trump",
    "timestamp": "2025-06-03T19:00:21Z"
  },
  {
    "title": "Musk Blasts Trump’s Budget and Tax Bill as Bloated",
    "description": "Once upon a time. Elon Musk was Trump’s best friend. No longer. Despite his best effort to slash the government, he failed. Originally, Musk offered to secure a cut of $2 trillion, but came nowhere near that figure, eventually he dropped his goal to only $175…",
    "link": "https://dianeravitch.net/2025/06/03/musk-blasts-trumps-budget-and-tax-bill-as-bloated/",
    "timestamp": "2025-06-03T19:00:00Z"
  },
  {
    "title": "Ex-Homeland Security official Taylor fights back against Trump’s ‘unprecedented’ investigation order",
    "description": "WASHINGTON (AP) — A former Homeland Security official during President Donald Trump’s first administration who authored an anonymous op-ed sharply critical of the president is calling on independent government watchdogs to investigate after Trump ordered the …",
    "link": "https://freerepublic.com/focus/f-news/4320768/posts",
    "timestamp": "2025-06-03T18:59:49Z"
  },
  {
    "title": "Elon Musk Turns on Trump, Calls President’s ‘Big, Beautiful Bill’ a ‘Disgusting Abomination’",
    "description": "Elon Musk criticized President Donald Trump's \"One Big, Beautiful Bill\" and declared it \"a disgusting abomination.\"\nThe post Elon Musk Turns on Trump, Calls President’s ‘Big, Beautiful Bill’ a ‘Disgusting Abomination’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/03/elon-musk-turns-on-trump-calls-presidents-big-beautiful-bill-disgusting-abomination/",
    "timestamp": "2025-06-03T18:57:23Z"
  },
  {
    "title": "Global alarms rise as China's critical mineral export ban takes hold",
    "description": "Summary Global automakers warn of production halts without China's critical minerals Executives and diplomats are scrambling to get meetings in Beijing Trump and Xi expected to talk this week amid trade war June 3 (Reuters) - Alarm over China's stranglehold o…",
    "link": "https://freerepublic.com/focus/f-news/4320765/posts",
    "timestamp": "2025-06-03T18:57:06Z"
  },
  {
    "title": "Inmate forged Trump death threats to get star witness deported: Prosecutors",
    "description": "Threatening letters about President Donald Trump that led to the highly-touted arrest by federal authorities of an undocumented immigrant last month were actually written by a jailed Wisconsin man trying to get him deported, prosecutors said in a new criminal…",
    "link": "https://biztoc.com/x/be311ed25835640a",
    "timestamp": "2025-06-03T18:57:01Z"
  },
  {
    "title": "“Disgusting Abomination”: Elon Musk Slams Donald Trump’s “Big, Beautiful Bill”",
    "description": "Elon Musk again attacked the centerpiece of Donald Trump’s legislative agenda, the Big Beautiful Bill Act, this time calling the tax and spending package as a “disgusting abomination.” Meanwhile, additional criticisms are being directed at the legislation fro…",
    "link": "http://deadline.com/2025/06/elon-musk-trump-one-big-beautiful-bill-1236421987/",
    "timestamp": "2025-06-03T18:56:26Z"
  },
  {
    "title": "New Orleans jail escapee releases videos, prompting search of home where they were made, source says",
    "description": "It led to a police raid that failed to recapture him.",
    "link": "https://www.bostonherald.com/2025/06/03/new-orleans-jailbreak-fugitive/",
    "timestamp": "2025-06-03T18:53:52Z"
  },
  {
    "title": "China hits back against US ‘coercion’",
    "description": "Beijing has rejected Trump’s accusation it violated the Geneva trade deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618610-china-us-trade-tensions/",
    "timestamp": "2025-06-03T18:53:44Z"
  },
  {
    "title": "What next for EU-Poland ties after Nawrocki's election win?",
    "description": "Newly elected Polish President Karol Nawrocki is known as an EU skeptic. How can he sway Poland's EU policy, and how is he viewed in Brussels?",
    "link": "https://www.dw.com/en/what-next-for-eu-poland-ties-after-nawrockis-election-win/a-72778503",
    "timestamp": "2025-06-03T18:53:00Z"
  },
  {
    "title": "'Whiplash!' Nancy Mace confounds onlookers with dramatic Pride Month U-turn",
    "description": "Former intelligence officer Travis Akers couldn't help but notice the 180-degree turn Rep. Nancy Mace (R-SC) has made when it comes to LGBTQ+ rights. He shared examples of past X posts by Mace celebrating Pride Month in 2021. \"The pandemic kept us all from ce…",
    "link": "https://www.rawstory.com/nancy-mace-pride-month-2672256526/",
    "timestamp": "2025-06-03T18:52:12Z"
  },
  {
    "title": "Musk blasts Trump’s agenda bill as a ‘disgusting abomination’",
    "description": "Elon Musk on Tuesday lashed out at President Donald Trump’s agenda bill — which the president is pressuring GOP senators to support — calling it a “disgusting abomination.” “I’m sorry, but I just can’t stand it anymore. This massive, outrageous, pork-filled C…",
    "link": "https://freerepublic.com/focus/f-news/4320762/posts",
    "timestamp": "2025-06-03T18:51:38Z"
  },
  {
    "title": "Musk calls Trump's tax and spending bill an 'abomination'",
    "description": "Musk has repeatedly struck out at the bill, saying it undercuts Doge's work to slash federal spending.",
    "link": "https://www.bbc.com/news/articles/c0j76djzgpvo",
    "timestamp": "2025-06-03T18:50:53Z"
  },
  {
    "title": "India may still cross the ‘miracle economy’ benchmark of 7% GDP growth",
    "description": "India's economic growth is exceeding expectations, with FY24 revised to 9.2% and FY25 projected at 6.5%. Despite global uncertainties and slower manufacturing growth, strong investment, improved net exports, and a promising agricultural outlook contribute to …",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/india-may-still-cross-the-miracle-economy-benchmark-of-7-gdp-growth/articleshow/121605824.cms",
    "timestamp": "2025-06-03T18:49:35Z"
  },
  {
    "title": "Musk Calls Trump’s ‘Beautiful’ Bill a ‘Disgusting Abomination,’ Emboldening GOP Critics in Congress",
    "description": "Musk posted his attack on X as the White House press secretary was defending the bill to reporters.",
    "link": "https://time.com/7290854/musk-calls-trumps-beautiful-bill-a-disgusting-abomination-white-house-disagrees/",
    "timestamp": "2025-06-03T18:49:31Z"
  },
  {
    "title": "Inmate forged Trump death threats to get star witness deported: Prosecutors",
    "description": "A man who was allegedly framed for sending letters threatening to kill President Donald Trump still faces possible removal from the United States.",
    "link": "https://www.cnbc.com/2025/06/03/trump-death-threat-letters-deported.html",
    "timestamp": "2025-06-03T18:49:23Z"
  },
  {
    "title": "SNAP and Medicaid Work Requirements Won’t Do What the GOP Promises",
    "description": "GOP work requirements won’t do what Republicans promise. Trump’s Big Beautiful Bill aims to make federal assistance, such as SNAP and Medicaid, contingent on work. Research shows it’s just a roundabout way to restrict federal benefits.",
    "link": "http://nymag.com/intelligencer/article/gop-work-requirements-snap-medicaid.html",
    "timestamp": "2025-06-03T18:49:09Z"
  },
  {
    "title": "Seth Meyers skips asking George Clooney about Biden's mental decline, not recognizing him at fundraiser",
    "description": "\"Late Night\" host Seth Meyers failed to question George Clooney on Monday about the shocking report that former President Biden didn't recognize the actor at his own fundraiser.",
    "link": "https://www.foxnews.com/media/seth-meyers-skips-asking-george-clooney-about-bidens-mental-decline-not-recognizing-him-fundraiser",
    "timestamp": "2025-06-03T18:49:05Z"
  },
  {
    "title": "Tim Dillon Trashes Cuomo’s Defense of Hunter Biden as a ‘Typical’ Addict: ‘Very Few’ of the Addicts I Know ‘Ended Up in the Ukraine’",
    "description": "Comedian Tim Dillon roasted Chris Cuomo to his face over his defense of Hunter Biden as a \"typically drug-addled person.\"\nThe post Tim Dillon Trashes Cuomo’s Defense of Hunter Biden as a ‘Typical’ Addict: ‘Very Few’ of the Addicts I Know ‘Ended Up in the Ukra…",
    "link": "https://www.mediaite.com/media/podcasts/tim-dillon-trashes-cuomos-defense-of-hunter-biden-as-a-typical-addict-very-few-of-the-addicts-i-know-ended-up-in-the-ukraine/",
    "timestamp": "2025-06-03T18:46:32Z"
  },
  {
    "title": "Trump pushes a July 4th deadline for big tax bill as senators dig in",
    "description": "President Donald Trump wants his “big, beautiful” bill of tax breaks and spending cuts on his desk to be singed into law by Independence Day",
    "link": "https://biztoc.com/x/c7f13970af139e42",
    "timestamp": "2025-06-03T18:45:53Z"
  }
]