[
  {
    "title": "Netanyahu mocks corruption trial as 'Bugs Bunny' farce",
    "description": "Israeli Prime Minister Benjamin Netanyahu denounced the ongoing corruption case against him as a \"Bugs Bunny trial\" and defended his controversial pardon request in a video published on social media. Netanyahu is the first sitting Israeli prime minister to st…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/netanyahu-mocks-corruption-trial-as-bugs-bunny-farce/articleshow/125795173.cms",
    "timestamp": "2025-12-05T19:17:49Z"
  },
  {
    "title": "US sanctions equate us with drug traffickers: ICC dep. prosecutor",
    "description": "The deputy prosecutor of the International Criminal Court on Friday lashed out at US sanctions, arguing they effectively put top court officials on a par with “terrorists and drug traffickers”. In a wide-ranging interview with AFP, Mame Mandiaye Niang also sa…",
    "link": "https://www.digitaljournal.com/world/us-sanctions-equate-us-with-drug-traffickers-icc-dep-prosecutor/article",
    "timestamp": "2025-12-05T19:17:20Z"
  },
  {
    "title": "CNN Anchors Amused at Trump ‘Slip’ About Renaming Kennedy Center — After Himself",
    "description": "CNN anchors Wolf Blitzer and Pamela Brown were visibly amused that Trump \"slipped\" and revealed a desire to rename the Kennedy Center after himself.\nThe post CNN Anchors Amused at Trump ‘Slip’ About Renaming Kennedy Center — After Himself first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/cnn-anchors-amused-at-trump-slip-about-renaming-kennedy-center-after-himself/",
    "timestamp": "2025-12-05T19:17:06Z"
  },
  {
    "title": "Mike Johnson mocked for claiming he’s a 'wartime speaker' under Trump",
    "description": "Fears that Republicans will lose their small majority in the U.S. House of Representatives in the 2026 midterms intensified when Democrats enjoyed a variety of off-year election victories on November 4, from double-digit gubernatorial wins in New Jersey and V…",
    "link": "https://www.rawstory.com/alternet-posts/mike-johnson-stuart-varney/",
    "timestamp": "2025-12-05T19:17:00Z"
  },
  {
    "title": "Supreme Court to hear Trump birthright citizenship order case",
    "description": "The U.S. Constitution's 14th Amendment had been understood to grant citizenship to children born in the country, even if their parents are not citizens.",
    "link": "https://www.cnbc.com/2025/12/05/trump-birthright-citizenship-supreme-court.html",
    "timestamp": "2025-12-05T19:16:58Z"
  },
  {
    "title": "Tim Walz Splutters in Anger Over Being Called a Retard",
    "description": "What makes it fun to call Tim Walz a retard is that he gets so mad: Walz said Thursday that individuals have driven past his residence and shouted insults at him after President Donald Trump used the same term in … Continue reading →\nThe post Tim Walz Splutte…",
    "link": "https://moonbattery.com/tim-walz-splutters-in-anger-over-being-called-a-retard/",
    "timestamp": "2025-12-05T19:16:38Z"
  },
  {
    "title": "Softbank CEO Wants to Build ‘Trump Industrial Parks’ on Federal Land to Boost AI: Report",
    "description": "The idea sounds similar to Trump's \"freedom cities\" first pitched in 2023.",
    "link": "https://gizmodo.com/softbank-ceo-wants-to-build-trump-industrial-parks-on-federal-land-to-boost-ai-report-2000696243",
    "timestamp": "2025-12-05T19:15:24Z"
  },
  {
    "title": "‘Funding woes’: Climate groups falter, Bill Gates recalibrates, but Al Gore soldiers on",
    "description": "'It’s been an interesting few weeks on the hysteria front'",
    "link": "https://www.wnd.com/2025/12/funding-woes-climate-groups-falter-bill-gates-recalibrates/",
    "timestamp": "2025-12-05T19:15:09Z"
  },
  {
    "title": "US Supreme Court agrees to hear case challenging birthright citizenship",
    "description": "Donald Trump's controversial executive order to end birthright citizenship had been rejected by lower courts.",
    "link": "https://www.bbc.co.uk/news/articles/c208j0wrzrvo",
    "timestamp": "2025-12-05T19:14:40Z"
  },
  {
    "title": "2026 World Cup draw: USMNT catches a break with favorable group including Australia and Paraguay",
    "description": "The top seed in Group D, the Americans welcomed Australia and Paraguay — manageable foes that they defeated in home friendlies this fall — and the winner of a March playoff between Türkiye, Romania, Slovakia and Kosovo.",
    "link": "https://sports.yahoo.com/soccer/article/2026-world-cup-draw-usmnt-catches-a-break-with-favorable-group-including-australia-and-paraguay-191355105.html",
    "timestamp": "2025-12-05T19:13:55Z"
  },
  {
    "title": "World Cup 2026 draw has United States playing Australia in first round",
    "description": "The World Cup will be held in more than a dozen cities across the U.S., Mexico and Canada next June - including Hard Rock Stadium in Miami Gardens.",
    "link": "https://www.palmbeachpost.com/story/sports/2025/12/05/world-cup-2026-groups-fifa-donald-trump/87624008007/",
    "timestamp": "2025-12-05T19:13:22Z"
  },
  {
    "title": "The Pentagon’s New ‘Press Corps’ Is an Utter Embarrassment — And It Won’t Help Hegseth",
    "description": "\"We're able to get our message directly to the American people. We don't have to rely on the MSDNC filters anymore,\" said the Pentagon spox\nThe post The Pentagon’s New ‘Press Corps’ Is an Utter Embarrassment — And It Won’t Help Hegseth first appeared on Media…",
    "link": "https://www.mediaite.com/opinion/the-pentagons-new-press-corps-is-an-utter-embarrassment-and-it-wont-help-hegseth/",
    "timestamp": "2025-12-05T19:12:53Z"
  },
  {
    "title": "Supreme Court to hear Trump birthright citizenship order case",
    "description": "The Supreme Court on Friday said it will hear arguments in a case that will determine if President Donald Trump can undo automatic citizenship for people born in the United States. Trump, on his first day back in the White House on Jan. 20, issued an executiv…",
    "link": "https://freerepublic.com/focus/f-news/4356106/posts",
    "timestamp": "2025-12-05T19:11:03Z"
  },
  {
    "title": "Draw for the 2026 World Cup takes place",
    "description": "Find out what lies ahead for United's players who hope to be in Canada, Mexico and USA.",
    "link": "https://www.manutd.com/en/news/detail/draw-for-2026-fifa-world-cup-reveals-fate-of-man-utd-players",
    "timestamp": "2025-12-05T19:10:38Z"
  },
  {
    "title": "Trump Honored with Inaugural FIFA Peace Prize at World Cup Draw",
    "description": "FIFA President Gianni Infantino bestowed the inaugural FIFA Peace Prize on President Donald Trump for his work to settle conflicts around the globe, including his historic Middle East peace deal.\nThe post Trump Honored with Inaugural FIFA Peace Prize at World…",
    "link": "https://www.breitbart.com/politics/2025/12/05/trump-honored-with-inaugural-fifa-peace-prize-at-world-cup-draw/",
    "timestamp": "2025-12-05T19:10:31Z"
  },
  {
    "title": "Europol takes down crypto and laundering network worth 700 million",
    "description": "A two-stage campaign resulted in the arrest of nine and the seizure of cash, crypto, and other valuables.",
    "link": "https://www.techradar.com/pro/security/europol-takes-down-crypto-and-laundering-network-worth-700-million",
    "timestamp": "2025-12-05T19:10:00Z"
  },
  {
    "title": "Trump lays bare his contempt for Europe in blistering new national security plan | CNN",
    "description": "“America Alone” might be the simplest précis of the White House’s new National Security Strategy, an extraordinary document released Friday that starkly lays out the administration’s broad foreign policy priorities.",
    "link": "https://www.cnn.com/2025/12/05/europe/trump-national-security-plan-europe-latam-intl",
    "timestamp": "2025-12-05T19:09:16Z"
  },
  {
    "title": "Virginia man charged with planting pipe bombs on eve of Jan. 6 attack appears in court",
    "description": "A Virginia man on Friday made his first court appearance on charges that he planted a pair of pipe bombs outside the headquarters of the Republican and Democratic national parties in Washington on the eve of a mob’s attack on U.S. Capitol.",
    "link": "https://www.pbs.org/newshour/nation/virginia-man-charged-with-planting-pipe-bombs-on-eve-of-jan-6-attack-appears-in-court",
    "timestamp": "2025-12-05T19:09:11Z"
  },
  {
    "title": "Trump's $100,000 Fee for H-1B Visa Is a 'Rounding Error' says Silicon Valley CEO",
    "description": "President Donald Trump's promised $100,000 fee for importing H-1B workers next year will be a trivial fee for Silicon Valley companies, says the Iran-born CEO of a recruiting company.\nThe post Trump’s $100,000 Fee for H-1B Visa Is a ‘Rounding Error’ says Sili…",
    "link": "https://www.breitbart.com/economy/2025/12/05/trumps-100000-fee-for-h-1b-visa-is-a-rounding-error-says-ceo/",
    "timestamp": "2025-12-05T19:07:39Z"
  },
  {
    "title": "The Supreme Court will decide whether Trump’s birthright citizenship order violates the Constitution",
    "description": "The case will be argued in the spring.",
    "link": "https://www.bostonherald.com/2025/12/05/birthright-citizenship-immigration/",
    "timestamp": "2025-12-05T19:05:44Z"
  },
  {
    "title": "The Supreme Court will decide whether Trump’s birthright citizenship order violates the Constitution",
    "description": "The case will be argued in the spring.",
    "link": "https://www.denverpost.com/2025/12/05/birthright-citizenship-immigration/",
    "timestamp": "2025-12-05T19:05:44Z"
  },
  {
    "title": "FIFA World Cup: Teams, locations to be announced",
    "description": "For the first time in 30 years, the U.S. will be hosting, at least in part, the FIFA World Cup and all eyes were on Washington, D.C. as the teams and venues were announced.",
    "link": "https://www.wsbtv.com/news/trending/fifa-world-cup-teams-locations-announced/LBWK4676TZHJTP2SXUE6AZMGVE/",
    "timestamp": "2025-12-05T19:05:17Z"
  },
  {
    "title": "Trump pledges to reassert Monroe Doctrine to restore American power",
    "description": "The Trump administration unveiled a comprehensive national security blueprint reviving Monroe Doctrine to counter foreign influence in Western Hemisphere.",
    "link": "https://www.foxnews.com/politics/trump-pledges-reassert-monroe-doctrine-restore-american-power",
    "timestamp": "2025-12-05T19:05:10Z"
  },
  {
    "title": "Ex-Director Of Dance At Kennedy Center Says Her Firing Wasn’t A Surprise",
    "description": "Jane Raleigh: “There was definitely an overarching feeling of waiting for the shoe to drop. I was committed to staying until I was removed, (but) I did believe from the beginning that everyone would be fired at some point. … Basically every payday Friday was …",
    "link": "https://forward.com/culture/785713/jane-rabinovitz-raleigh-kennedy-center-dance-director-jewish/",
    "timestamp": "2025-12-05T19:05:00Z"
  },
  {
    "title": "'We just got duped': Fox News attacks Trump's 'rigged' FIFA event",
    "description": "Fox News hosts expressed disappointment after claiming that FIFA had \"rigged\" an event with President Donald Trump and other world leaders.During a Friday ceremony at the Kennedy Center, Trump received FIFA's first annual peace prize before participating in a…",
    "link": "https://www.rawstory.com/trump-fifa-rigged/",
    "timestamp": "2025-12-05T19:04:55Z"
  },
  {
    "title": "Supreme Court agrees to decide if Trump may end birthright citizenship | CNN Politics",
    "description": "The Supreme Court agreed Friday to decide if President Donald Trump’s attempt to end birthright citizenship with an executive order is constitutional, offering the justices an opportunity to revisit what has widely been considered settled law since the 19th C…",
    "link": "https://www.cnn.com/2025/12/05/politics/supreme-court-agrees-to-hear-birthright",
    "timestamp": "2025-12-05T19:03:28Z"
  },
  {
    "title": "Reality wins: Lawsuit settlement means school can keep boys and girls separated on athletic teams",
    "description": "State tried to mandate failing transgender ideologies for everyone",
    "link": "https://www.wnd.com/2025/12/reality-wins-lawsuit-settlement-means-school-can-keep/",
    "timestamp": "2025-12-05T19:03:08Z"
  },
  {
    "title": "The Supreme Court will decide whether Trump's birthright citizenship order violates the Constitution",
    "description": "The Supreme Court agreed on Friday to take up the constitutionality of President Donald Trump's order on birthright citizenship declaring that children born ...",
    "link": "https://www.yahoo.com/news/articles/supreme-court-decide-whether-trumps-190252311.html",
    "timestamp": "2025-12-05T19:02:52Z"
  },
  {
    "title": "Trump’s DHS Posts a Disgusting Parody of Spotify Wrapped",
    "description": "The Department of Homeland Security has innovated a cringey new way to spread its blatantly made-up statistics documenting its ethnic cleansing campaign: introducing DHS Wrapped!In the latest installment of the Trump administration’s weird attempts to appeal …",
    "link": "https://newrepublic.com/post/204040/donald-trump-homeland-security-spotify-wrapped-self-deportation",
    "timestamp": "2025-12-05T19:02:36Z"
  },
  {
    "title": "Kenya and US seal first-ever direct government-to-government health partnership as President Ruto secures $1.6 billion - Radio47",
    "description": "Kenya and the United States have signed a historic Health Cooperation Framework making Kenya the first country to enter a government-to-government",
    "link": "https://www.radio47.fm/news/kenya-and-us-seal-first-ever-direct-government-to-government-health-partnership-as-president-ruto-secures-1-6-billion-14429/",
    "timestamp": "2025-12-05T19:02:27Z"
  },
  {
    "title": "The Supreme Court Will Hear Trump's Bid To End Birthright Citizenship",
    "description": "Will the justices throw out a bedrock legal principle that has defined American citizenship for over a century?",
    "link": "https://www.huffpost.com/entry/supreme-court-says-it-will-hear-trumps-bid-to-end-birthright-citizenship_n_6924661ee4b049cdc6d546ae",
    "timestamp": "2025-12-05T19:02:22Z"
  },
  {
    "title": "Official: Italy learn potential 2026 World Cup opponents",
    "description": "The draw for the 2026 FIFA World Cup in North America is now complete, and Italy have learned that they will be in a group with Canada, Qatar and Switzerland",
    "link": "https://football-italia.net/official-italy-learn-2026-world-cup-opponents/",
    "timestamp": "2025-12-05T19:02:03Z"
  },
  {
    "title": "Here's how we get rid of MAGA",
    "description": "In an unhinged video this summer, Danielle Jurinsky, a former Aurora City Council member, blamed the Democratic Party for the firebomb attack on peaceful demonstrators in Boulder who called for the release of hostages in Gaza. Through tears, she angrily singl…",
    "link": "https://www.rawstory.com/maga-2674370392/",
    "timestamp": "2025-12-05T19:01:09Z"
  },
  {
    "title": "Trump unveils radical foreign policy shift, warns Europe faces decline",
    "description": "President Trump unveiled a new national security strategy prioritizing \"America First\" and regional concerns, notably elevating Latin America. The document signals an end to mass migration and criticizes Europe's trajectory, warning of \"civilizational erasure…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-unveils-radical-foreign-policy-shift-warns-europe-faces-decline/articleshow/125794957.cms",
    "timestamp": "2025-12-05T19:00:51Z"
  },
  {
    "title": "Adam Schiff on How the Trump Administration Targets Its Opponents",
    "description": "The senator, currently being investigated by the Justice Department, notes that the President can’t stop thinking about him: “I live rent-free in that guy’s head.”",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/senator-adam-schiff-on-how-the-trump-administration-targets-its-opponents",
    "timestamp": "2025-12-05T19:00:00Z"
  },
  {
    "title": "Grand jury transcripts from Epstein, Maxwell investigation in Florida ordered to be released",
    "description": "A federal judge in Florida on Friday ordered the release of grand jury transcripts from the federal sex trafficking cases of Jeffrey Epstein and Ghislaine Maxwell.",
    "link": "https://apnews.com/article/jeffrey-epstein-florida-bd036cbe2fa4e98d27aa473fd6daa3bd",
    "timestamp": "2025-12-05T18:58:37Z"
  },
  {
    "title": "Supreme Court to decide if Trump can limit the constitutional right to citizenship at birth",
    "description": "The Supreme Court agreed to decide the lawfulness of President Donald Trump's contentious plan to roll back automatic birthright citizenship.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-decide-trump-can-limit-constitutional-right-citizenship-rcna244701",
    "timestamp": "2025-12-05T18:56:44Z"
  },
  {
    "title": "The Supreme Court Is Doing Everything in Its Power to Save Trump in the Midterms",
    "description": "The Supreme Court reinstated Texas’ new congressional gerrymander on Thursday by a 6–3 vote.",
    "link": "https://slate.com/news-and-politics/2025/12/supreme-court-trump-2026-midterms-texas-disaster.html",
    "timestamp": "2025-12-05T18:56:05Z"
  },
  {
    "title": "How satellites captured New York’s biggest holiday moment: The Rockefeller Centre Christmas Tree seen from space",
    "description": "High-resolution satellites now capture stunning nighttime cityscapes, as seen in recent Rockefeller Plaza Christmas tree lighting images. These advanced sensors reveal urban patterns, crowd movements, and energy use with surprising clarity. This technology, u…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/how-satellites-captured-new-yorks-biggest-holiday-moment-the-rockefeller-centre-christmas-tree-seen-from-space/articleshow/125794833.cms",
    "timestamp": "2025-12-05T18:55:43Z"
  },
  {
    "title": "Kash Patel Yelled at FBI Agent to Drive Girlfriend's Drunk Friend...",
    "description": "Kash Patel Yelled at FBI Agent to Drive Girlfriend's Drunk Friend...\r\n\n \n \n \n (First column, 17th story, link)",
    "link": "https://www.ms.now/news/kash-patel-girlfriend-fbi-detail-wilkins-ride-home",
    "timestamp": "2025-12-05T18:55:37Z"
  },
  {
    "title": "“What Happened to Her Face?” - Netizens Shocked by Susan Dell’s Alleged $60,000 Transformation",
    "description": "Susan Dell’s face is once again at the center of discussion after she appeared in front of the public eye to make a multimillion-dollar announcement. On Tuesday, Susan, along with her husband, Michael Dell, the CEO of Dell Technologies, joined Donald Trump at…",
    "link": "https://biztoc.com/x/11408991b7c3cd46",
    "timestamp": "2025-12-05T18:55:12Z"
  },
  {
    "title": "CNN Partners With a Gambling App That Lets You Wager on Starvation in Gaza",
    "description": "The app company’s two biggest investors are also heavily invested in the Israeli military.",
    "link": "https://therealnews.com/cnn-partners-kalshi-gambling-app-starvation-gaza",
    "timestamp": "2025-12-05T18:53:38Z"
  },
  {
    "title": "Donald Trump: American president named inaugural Fifa Peace Prize winner - BBC",
    "description": "Donald Trump: American president named inaugural Fifa Peace Prize winnerBBC Donald Trump awarded inaugural FIFA Peace Prize by Gianni InfantinoThe New York Times FIFA awards new peace prize to Donald TrumpESPN Live updates: Donald Trump attends 2026 World Cup…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180299405",
    "timestamp": "2025-12-05T18:53:17Z"
  },
  {
    "title": "Indiana House Republicans pass Trump-backed map, setting up high-stakes Senate fight",
    "description": "Republican lawmakers voted 57-41 in favor of the map.",
    "link": "https://www.bostonherald.com/2025/12/05/indiana-house-redistricting/",
    "timestamp": "2025-12-05T18:51:58Z"
  },
  {
    "title": "The 'Threat' That Supposedly Justified Killing 2 Boat Attack Survivors Was Entirely Speculative",
    "description": "The commander who ordered a second missile strike on a suspected drug boat worried that the helpless men he killed might be able to salvage cocaine from the smoldering wreck.",
    "link": "https://reason.com/2025/12/05/the-threat-that-supposedly-justified-killing-2-boat-attack-survivors-was-entirely-speculative/",
    "timestamp": "2025-12-05T18:51:00Z"
  },
  {
    "title": "Axios: Trump will announce by Christmas the new governance structure for Gaza",
    "description": "The second phase involves Israel withdrawing from more Gaza territory, sending an international stabilisation force and implementing new governance led by the Peace Council\nThe post Axios: Trump will announce by Christmas the new governance structure for Gaza…",
    "link": "https://en.protothema.gr/2025/12/05/axios-trump-will-announce-by-christmas-the-new-governance-structure-for-gaza/",
    "timestamp": "2025-12-05T18:51:00Z"
  },
  {
    "title": "Russia encouraged by talks with US, ready to engage further: Kremlin",
    "description": "Russia and the United States are making progress in peace talks concerning Ukraine. President Putin met with U.S. envoys, accepting some elements of a U.S.-drafted peace plan. Moscow is ready to continue negotiations with the current American team. Ukraine se…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-encouraged-by-talks-with-us-ready-to-engage-further-kremlin/articleshow/125794835.cms",
    "timestamp": "2025-12-05T18:50:29Z"
  },
  {
    "title": "Judge orders release of grand jury transcripts from abandoned Epstein investigation in Florida",
    "description": "The Justice Department has requested the unsealing of documents from three Epstein-related separate cases: the 2006-2007 Florida grand jury investigation into Epstein, his 2019 sex trafficking case in New York and Ghislaine Maxwell’s 2021 sex trafficking case…",
    "link": "https://www.pbs.org/newshour/nation/judge-orders-release-of-grand-jury-transcripts-from-abandoned-epstein-investigation-in-florida",
    "timestamp": "2025-12-05T18:49:49Z"
  },
  {
    "title": "Art Of The Deal: Man Negotiates Mechanic Down From $75 Oil Change To $2,000 Full Brakes And Rotors Replacement",
    "description": "BORDENTOWN, NJ — According to reports, a customer at Tricky Auto Repair located on South Egg Harbor Road successfully negotiated his vehicle maintenance down from a routine $75 oil change to a mere $2,000 full brakes and rotor replacement.",
    "link": "https://babylonbee.com/news/art-of-the-deal-man-negotiates-mechanic-down-from-75-oil-change-to-2000-full-brakes-and-rotors-replacement",
    "timestamp": "2025-12-05T18:46:32Z"
  },
  {
    "title": "Healey, other Mass. leaders, condemn CDC's 'dangerous' hepatitis B vaccine decision",
    "description": "Massachusetts leaders, including Gov. Maura Healey, condemned a CDC panel's vote to end the routine newborn hepatitis B shot.",
    "link": "https://www.wcvb.com/article/massachusetts-reacts-cdc-newborn-hep-b-decision/69646037",
    "timestamp": "2025-12-05T18:46:23Z"
  },
  {
    "title": "Photos of the FIFA World Cup draw for the 2026 soccer tournament",
    "description": "The World Cup draw determines where teams will play at next year's soccer tournament between 48 nations that will run from June 11 to July 19. Presidents...",
    "link": "https://sports.yahoo.com/articles/photos-fifa-world-cup-draw-184615490.html",
    "timestamp": "2025-12-05T18:46:15Z"
  },
  {
    "title": "Speaker Johnson under attack from his own as mood darkens in House GOP (CNN)",
    "description": "CNN:\nSpeaker Johnson under attack from his own as mood darkens in House GOP  —  House leadership Congressional news Donald Trump US shutdown  —  Speaker Mike Johnson is a political survivor, weathering crisis after crisis since his unlikely ascent two years a…",
    "link": "https://www.memeorandum.com/251205/p73",
    "timestamp": "2025-12-05T18:45:00Z"
  },
  {
    "title": "World Cup draw begins with Trump, other leaders picking balls of their own nations",
    "description": "The tournament opens June 11 in Mexico City.",
    "link": "https://www.stltoday.com/sports/other/olympics/article_9f45ecb5-3b28-5061-a857-26f82fb847d1.html",
    "timestamp": "2025-12-05T18:45:00Z"
  },
  {
    "title": "Trump's FIFA 'peace prize' parade gets rained on with resurfaced Nobel committee remarks",
    "description": "It did not take long after Donald Trump was awarded a “peace prize” from FIFA, the governing body for international soccer responsible for World Cup events, when the glitter started to come off the gold.On Friday afternoon, the president, who has been lobbyin…",
    "link": "https://www.rawstory.com/trump-fifa/",
    "timestamp": "2025-12-05T18:43:52Z"
  },
  {
    "title": "Majority of Democrats, Independents Want Leaders to Fight GOP Attacks on AI Rules",
    "description": "A poll published Friday revealed that a majority of Democratic and Independent US voters want congressional Democrats to fight GOP efforts to block states from passing laws regulating artificial intelligence—even as the technology evolves at a speed that has …",
    "link": "https://www.commondreams.org/news/artificial-intelligence-regulation",
    "timestamp": "2025-12-05T18:43:27Z"
  },
  {
    "title": "Trump Advisors To Discuss U.S. Film & TV Production Tax Incentives With Industry Stakeholders Who Plan To Urge Against POTUS’ Tariff Proposal",
    "description": "EXCLUSIVE: White House advisors are set to meet Friday with a group of U.S. film and television production stakeholders regarding President Donald Trump’s expressed desire to save Hollywood. Deadline has learned senior leaders from the Coalition for American …",
    "link": "http://deadline.com/2025/12/white-house-meeting-federal-film-production-tax-incentive-1236637457/",
    "timestamp": "2025-12-05T18:43:20Z"
  },
  {
    "title": "Federal judge orders unsealing of Epstein case grand jury records",
    "description": "A judge ordered the unsealing of Jeffrey Epstein grand jury records under a new transparency law, but the DOJ will ultimately decide if they're released.",
    "link": "https://www.foxnews.com/us/federal-judge-orders-unsealing-epstein-case-grand-jury-records",
    "timestamp": "2025-12-05T18:42:21Z"
  },
  {
    "title": "Red state moves forward on Trump-backed push for new congressional map",
    "description": "Republican-controlled Indiana House passes Trump-backed congressional redistricting bill despite strong Democratic opposition, but faces hurdle in state Senate",
    "link": "https://www.foxnews.com/politics/red-state-moves-forward-trump-backed-push-new-congressional-map",
    "timestamp": "2025-12-05T18:41:50Z"
  },
  {
    "title": "Every Question About the Netflix-Warner Bros. Merger, Answered",
    "description": "What does this mean for subscribers? What about the future of DC Studios? What happens to HBO Sunday nights? How should you even feel about this?",
    "link": "https://www.esquire.com/entertainment/tv/a69646379/netflix-warner-bros-discovery-merger/",
    "timestamp": "2025-12-05T18:41:00Z"
  },
  {
    "title": "Climate study warning of $38 trillion-a-year hit to economy yanked for faulty data",
    "description": "British scientific journal Nature retracted a climate study due to data reliability issues, particularly problematic information from Uzbekistan that skewed results.",
    "link": "https://www.foxnews.com/politics/climate-study-warning-38-trillion-a-year-hit-economy-yanked-faulty-data",
    "timestamp": "2025-12-05T18:39:32Z"
  },
  {
    "title": "‘I don't need prizes; I need to save lives’: Trump after receiving first FIFA Peace Prize from Gianni Infantino, just a month after its launch",
    "description": "FIFA peace prize Trump: Donald Trump received the first-ever FIFA Peace Prize on December 5, 2025. FIFA President Gianni Infantino presented the award for promoting peace and unity globally. Trump stated he saved millions of lives by ending wars. The FIFA Pea…",
    "link": "https://economictimes.indiatimes.com/news/international/us/i-dont-need-prizes-i-need-to-save-lives-trump-after-receiving-first-fifa-peace-prize-from-gianni-infantino-just-a-month-after-its-launch/articleshow/125794526.cms",
    "timestamp": "2025-12-05T18:38:59Z"
  },
  {
    "title": "Secretary-General Welcomes Signing of Washington Peace, Prosperity Accords between Democratic Republic of Congo, Rwanda",
    "description": "The following statement was issued today by the Spokesman for UN Secretary-General António Guterres:",
    "link": "https://press.un.org/en/2025/sgsm22940.doc.htm",
    "timestamp": "2025-12-05T18:38:14Z"
  },
  {
    "title": "EU Fines Musk $140 Million for Violations of Online Safety Rules. Vance Calls It “Censorship.”",
    "description": "The European Commission announced Friday that it was fining Elon Musk, the richest person in the world, for the equivalent of $140 million, saying his company X had breached Europe’s Digital Services Act. The act, which took effect around the same time Musk b…",
    "link": "https://www.motherjones.com/politics/2025/12/eu-elon-musk-fine-vance-censorship/",
    "timestamp": "2025-12-05T18:37:38Z"
  },
  {
    "title": "Melania Trump wishes strength during visit with hospitalized children",
    "description": "Melania Trump has continued a decades-old first lady tradition of visiting with hospitalized children for the holidays",
    "link": "https://abcnews.go.com/US/wireStory/melania-trump-wishes-strength-toys-santa-visit-hospitalized-128150699",
    "timestamp": "2025-12-05T18:36:54Z"
  },
  {
    "title": "Minneapolis: ICE Arrests Illegals from Somalia During 'Operation Metro Surge'",
    "description": "Nearly a dozen criminal illegal immigrants have been arrested during a Department of Homeland Security (DHS) crackdown in Minneapolis, Minnesota, and among those are five Somali nationals.\nThe post Minneapolis: ICE Arrests Illegals from Somalia During ‘Operat…",
    "link": "https://www.breitbart.com/immigration/2025/12/05/minneapolis-ice-arrests-illegals-from-somalia-during-operation-metro-surge/",
    "timestamp": "2025-12-05T18:36:17Z"
  },
  {
    "title": "‘Revenge’: Senate to confirm 97 more Trump nominees after Colorado leftist’s blockade fails",
    "description": "Democrats 'and their base' still suffering from Trump Derangement Syndrome",
    "link": "https://www.wnd.com/2025/12/revenge-senate-confirm-97-more-trump-nominees-after/",
    "timestamp": "2025-12-05T18:35:29Z"
  },
  {
    "title": "Melania Trump Trolled With Foul-Mouthed Holiday Decor Rant Audio as First Lady Attends National Christmas Tree Lighting Ceremony at The White House",
    "description": "Melania Trump was trolled with her foul-mouthed holiday decor rant audio after appearing at a White House Christmas event.",
    "link": "https://radaronline.com/p/melania-trump-christmas-rant-viral-white-house/",
    "timestamp": "2025-12-05T18:35:00Z"
  },
  {
    "title": "Minnesota Democrats press GOP to condemn President Trump’s rhetoric toward Somalis",
    "description": "Walz, other Democratic leaders denounced the president’s language at the state’s budget forecast, while Republican leaders were wary of an outright condemnation and steered focus back to fraud.",
    "link": "https://www.inforum.com/news/minnesota/minnesota-democrats-press-gop-to-condemn-president-trumps-rhetoric-toward-somalis",
    "timestamp": "2025-12-05T18:34:58Z"
  },
  {
    "title": "Trump administration National Security Strategy claims Europe facing \"civilizational erasure\" within 20 years - CBS News",
    "description": "Trump administration National Security Strategy claims Europe facing \"civilizational erasure\" within 20 yearsCBS News Trump administration says Europe faces 'civilisational erasure'BBC The US Quietly Made a New National Security Plan Out of WhimsBloomberg.com…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180299281",
    "timestamp": "2025-12-05T18:33:27Z"
  },
  {
    "title": "Donald Trump awarded inaugural FIFA Peace Prize by Gianni Infantino - The New York Times",
    "description": "Donald Trump awarded inaugural FIFA Peace Prize by Gianni InfantinoThe New York Times Trump gets Peace Prize, but not the one he wantedAxios Live updates: Donald Trump attends 2026 World Cup draw; ACIP panel votes on vaccinesThe Hill What is the FIFA Peace Pr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180299279",
    "timestamp": "2025-12-05T18:33:17Z"
  },
  {
    "title": "Fighting Erupts In Congo Hours After Trump Hosts Peace Deal Ceremony",
    "description": "Fresh fighting erupted in eastern Democratic Republic of Congo on Friday, less than 24 hours after President Donald Trump hosted Congolese President Felix Tshisekedi and Rwandan President Paul Kagame in Washington to reaffirm a U.S.-brokered peace deal.\nThe a…",
    "link": "https://biztoc.com/x/1c66e2e587ae8e8a",
    "timestamp": "2025-12-05T18:32:13Z"
  },
  {
    "title": "Jury transcripts from Florida Epstein investigation ordered released",
    "description": "A federal judge has given the Justice Department permission to release transcripts of a grand jury investigation into Jeffrey Epstein's abuse of underage girls in Florida",
    "link": "https://www.wftv.com/news/grand-jury/N2ASXQIXL4YLDHJ7WCGA46EB5I/",
    "timestamp": "2025-12-05T18:32:01Z"
  },
  {
    "title": "Trump says he will talk trade with leaders of Mexico, Canada at World Cup draw",
    "description": "WASHINGTON, Dec 5 (Reuters) - U.S. President Donald Trump said he will meet with the leaders of Mexico and Canada to discuss trade issues on Friday after the leaders gather in Washington for the 2026 World Cup draw.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/06/trump-says-he-will-talk-trade-with-leaders-of-mexico-canada-at-world-cup-draw",
    "timestamp": "2025-12-05T18:31:00Z"
  },
  {
    "title": "Judge Orders Release Of Grand Jury Transcripts From Abandoned Jeffrey Epstein Investigation In Florida",
    "description": "The Justice Department has requested the unsealing of documents from three Epstein-related separate cases.",
    "link": "https://www.huffpost.com/entry/jeffrey-epstein-transcripts-released_n_6933242ee4b06a47b6d3d1ea",
    "timestamp": "2025-12-05T18:30:26Z"
  },
  {
    "title": "Lawmakers File A Resolution In An Attempt To Stop Trump From Starting Another War",
    "description": "Senator Rand Paul, R-Ky., joined Senate Minority Leader Chuck Schumer, D-N.Y., and Senator Tim Kaine, D-Va., and Adam Schiff, D-Calif., in a bid to block President Donald Trump from unilaterally launching any attacks against Venezuela. \"I filed a bipartisan W…",
    "link": "https://www.shtfplan.com/headline-news/lawmakers-file-a-resolution-in-an-attempt-to-stop-trump-from-starting-another-war",
    "timestamp": "2025-12-05T18:30:21Z"
  },
  {
    "title": "European leaders gossip about US amid apparent efforts to torpedo Trump's Russia-Ukraine peace deal: Report",
    "description": "President Donald Trump and members of his administration have worked doggedly over the past year to broker a lasting peace between Russia and Ukraine.While there have been multiple instances when an end to the bloodshed appeared within reach, Presidents Volod…",
    "link": "https://www.theblaze.com/news/european-leaders-express-distrust-for-us-gossip-to-torpedo-trump-peace-deal-report",
    "timestamp": "2025-12-05T18:30:00Z"
  },
  {
    "title": "Indiana House passes new Republican-drawn congressional map",
    "description": "The Indiana House on Friday approved a new congressional map designed to net Republicans two seats, setting up a clash over the redistricting effort pushed by President Donald Trump in the state Senate.",
    "link": "https://www.nbcnews.com/politics/elections/indiana-house-passes-new-republican-drawn-congressional-map-rcna246750",
    "timestamp": "2025-12-05T18:29:58Z"
  },
  {
    "title": "Putin Promises India ‘Uninterrupted’ Oil and Joint Weapons Production",
    "description": "Russian President Vladimir Putin promised an “uninterrupted” supply of cheap oil to India after meeting with Prime Minister Narendra Modi on Friday, defying President Donald Trump’s effort to use tariff pressure to get India to stop funding Putin’s war machin…",
    "link": "https://www.breitbart.com/asia/2025/12/05/putin-promises-india-uninterrupted-oil-and-joint-weapons-production/",
    "timestamp": "2025-12-05T18:28:26Z"
  },
  {
    "title": "Judge Blocks Planned Parenthood Defunding…Again",
    "description": "As part of President Donald Trump’s One Big Beautiful Bill, which was signed on July 4, Medicaid funding previously funneled into Planned Parenthood and its... Read More\nThe post Judge Blocks Planned Parenthood Defunding…Again appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/12/05/judge-blocks-planned-parenthood-defunding-again/",
    "timestamp": "2025-12-05T18:27:57Z"
  },
  {
    "title": "GOP wins: Supreme Court rules on Texas redistricting maps for 2026 midterms",
    "description": "Republicans are responding to 'very aggressive Democratic tricks'",
    "link": "https://www.wnd.com/2025/12/gop-wins-supreme-court-rules-texas-redistricting-maps/",
    "timestamp": "2025-12-05T18:27:15Z"
  },
  {
    "title": "A 19th Century Strategy Can’t Solve 21st Century Problems",
    "description": "The new National Security Strategy focuses on old approaches like the Monroe Doctrine while neglcting to come up with new approaches to our pressing challenges.",
    "link": "https://www.forbes.com/sites/williamhartung/2025/12/05/a-19th-century-strategy-cant-solve-21st-century-problems/",
    "timestamp": "2025-12-05T18:26:00Z"
  },
  {
    "title": "Trump all smiles as he wins FIFA’s new peace prize",
    "description": "US President Donald Trump becomes the first recipient of FIFA’s new peace prize, an award presented by Gianni Infantino that has drawn criticism.\n\nRead More: https://punchng.com/trump-all-smiles-as-he-wins-fifas-new-peace-prize/",
    "link": "https://punchng.com/trump-all-smiles-as-he-wins-fifas-new-peace-prize/",
    "timestamp": "2025-12-05T18:24:03Z"
  },
  {
    "title": "FIFA peace prize awarded to Donald Trump at 2026 World Cup draw",
    "description": "FIFA presented President Donald Trump with a new peace prize during the 2026 World Cup draw.  The award recognizes his efforts to promote peace and unity globally.  FIFA president Gianni Infantino highlighted Trump's leadership qualities.  Trump expressed gra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/fifa-peace-prize-awarded-to-donald-trump-at-2026-world-cup-draw/articleshow/125793765.cms",
    "timestamp": "2025-12-05T18:23:13Z"
  },
  {
    "title": "US Steel to resume production at Illinois plant shut 3 years ago",
    "description": "U.S. Steel says it'll resume making steel slabs at its Granite City Works plant in Illinois amid strengthening demand",
    "link": "https://abcnews.go.com/Business/wireStory/us-steel-resume-steel-production-illinois-plant-shut-128146494",
    "timestamp": "2025-12-05T18:23:03Z"
  },
  {
    "title": "Jan. 6 pipe bomb suspect Brian Cole confessed, said he supports Trump and has anarchist views: MS NOW",
    "description": "Cole is reportedly slated to make his first appearance in Washington, D.C., federal court.",
    "link": "https://www.cnbc.com/2025/12/05/brian-cole-trump-jan-6-pipe-bomb-case.html",
    "timestamp": "2025-12-05T18:21:44Z"
  },
  {
    "title": "Donald Trump Wants To Start Building 'Tiny Cars' In The United States",
    "description": "President Donald Trump announced his approval of \"tiny cars\" to be built in the United States on Truth Social on Friday. POTUS described the vehicles as the \"cars of the very near future\" and wrote car manufacturers had been trying to gain approval…\n Permalink",
    "link": "https://www.tmz.com/2025/12/05/donald-trump-cute-tiny-cars/",
    "timestamp": "2025-12-05T18:21:32Z"
  },
  {
    "title": "Trump tightens restrictions for work visas",
    "description": "The length of work permits for asylum seekers and refugees has been shortened from five years to 18 months",
    "link": "https://theweek.com/politics/trump-work-permits-visas-migrants",
    "timestamp": "2025-12-05T18:21:13Z"
  },
  {
    "title": "When was the FIFA Peace Prize created, and why did Donald Trump win it? All he's missing now is the Nobel",
    "description": "President of the United States of America Donald Trump was awarded with a brand new FIFA Peace Prize on Friday, as the 2026 World Cup draw got underway in Washington DC.\nTrump has",
    "link": "https://www.marca.com/en/football/2025/12/05/693321e1ca47414a788b459a.html",
    "timestamp": "2025-12-05T18:20:55Z"
  },
  {
    "title": "Colby Hall Nukes ‘Total Buffoon’ Pete Hegseth on CNN: ‘How Is He Still In This Role?!’",
    "description": "Mediaite's Colby Hall called out Pete Hegseth on CNN as a \"total buffoon,\" but argued he's doing exactly the job President Donald Trump wants him to do.\nThe post Colby Hall Nukes ‘Total Buffoon’ Pete Hegseth on CNN: ‘How Is He Still In This Role?!’ first appe…",
    "link": "https://www.mediaite.com/media/tv/colby-hall-nukes-total-buffoon-pete-hegseth-on-cnn-how-is-he-still-in-this-role/",
    "timestamp": "2025-12-05T18:20:16Z"
  },
  {
    "title": "\"We can be champions\": Donald Trump gives confidence to the United States in 2026 World Cup",
    "description": "Donald Trump, President of the United States, was the last to arrive at the 2026 World Cup Draw ceremony in Washington DC, very close to the White House.\nDonald Trump shifts respon",
    "link": "https://www.marca.com/en/world-cup/2025/12/05/693321b9ca4741131a8b459a.html",
    "timestamp": "2025-12-05T18:19:32Z"
  },
  {
    "title": "What we know about suspected pipe bomber on eve of 2021 US Capitol riot",
    "description": "He is a \"quiet guy\" and told investigators he thought the 2020 election was \"rigged\", US media reports say.",
    "link": "https://www.bbc.com/news/articles/c0l94knl26go",
    "timestamp": "2025-12-05T18:19:06Z"
  },
  {
    "title": "‘Deceiving users with blue checkmarks’: European Union fines Elon Musk’s X",
    "description": "Rubio: Scheme is 'an attack on all American tech platforms and the American people by foreign governments'",
    "link": "https://www.wnd.com/2025/12/deceiving-users-blue-checkmarks-european-union-fines-elon/",
    "timestamp": "2025-12-05T18:18:21Z"
  },
  {
    "title": "Trump Win: Gaza Peace Deal Keeps Israel in Eurovision Song Contest",
    "description": "The European Broadcasting Union (EBU) announced on Thursday that it would allow Israel to stay in the Eurovision Song Contest.\nThe post Trump Win: Gaza Peace Deal Keeps Israel in Eurovision Song Contest appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/12/05/trump-win-gaza-peace-deal-keeps-israel-eurovision-song-contest/",
    "timestamp": "2025-12-05T18:17:59Z"
  },
  {
    "title": "President Trump wants to rename American football: 'We have to come up with another name for the NFL'",
    "description": "Trump was on-hand at the FIFA 2026 World Cup draw in Washington, D.C. on Friday.",
    "link": "https://sports.yahoo.com/soccer/article/president-trump-wants-to-rename-american-football-we-have-to-come-up-with-another-name-for-the-nfl-181710848.html",
    "timestamp": "2025-12-05T18:17:10Z"
  },
  {
    "title": "FIFA World Cup fever hits D.C. as Apple TV offers free streaming of MLS Cup this Saturday",
    "description": "Amid the electric buzz of the 2026 FIFA World Cup final draw at the Kennedy Center, Apple dropped a game-changer for MLS soccer fans…\nThe post FIFA World Cup fever hits D.C. as Apple TV offers free streaming of MLS Cup this Saturday appeared first on MacDaily…",
    "link": "https://macdailynews.com/2025/12/05/fifa-world-cup-fever-hits-d-c-as-apple-tv-offers-free-streaming-of-mls-cup-this-saturday/",
    "timestamp": "2025-12-05T18:16:24Z"
  }
]