[
  {
    "title": "US DOJ to open grand jury probe into Obama officials, source says",
    "description": "WASHINGTON (Reuters) -U.S. Attorney General Pam Bondi has directed federal prosecutors to launch a grand jury probe into allegations that members of Democratic former President Barack Obama's administration manufactured intelligence on Russia's interference i…",
    "link": "https://www.thestar.com.my/news/world/2025/08/05/us-doj-to-open-grand-jury-probe-into-obama-officials-source-says",
    "timestamp": "2025-08-04T22:52:00Z"
  },
  {
    "title": "Trump’s War on Women’s Health",
    "description": "And what one foundation is doing to combat it",
    "link": "https://steady.substack.com/p/trumps-war-on-womens-health",
    "timestamp": "2025-08-04T22:51:51Z"
  },
  {
    "title": "Report: DOJ Launches Grand Jury Probe Into Alleged Obama-Era Trump-Russia Plot",
    "description": "\"The spokesperson said Bondi believed there is 'clear cause for deep concern' and a need for next steps.\"\nThe post Report: DOJ Launches Grand Jury Probe Into Alleged Obama-Era Trump-Russia Plot first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/report-doj-launches-grand-jury-probe-into-alleged-obama-era-trump-russia-plot/",
    "timestamp": "2025-08-04T22:49:20Z"
  },
  {
    "title": "How to Disagree Without Being Disagreeable",
    "description": "Your boss uses cliches or metaphors to justify problematic decisions. Here are ways to disagree without being confrontational.",
    "link": "https://www.psychologytoday.com/us/blog/platform-for-success/202508/how-to-disagree-without-being-disagreeable",
    "timestamp": "2025-08-04T22:49:05Z"
  },
  {
    "title": "US Democrats block vote on Trump-backed Texas redistricting map",
    "description": "Texas House fails to establish quorum as dozens of Democrats flee state to block redrawn congressional map.",
    "link": "https://www.aljazeera.com/news/2025/8/4/us-democrats-block-vote-on-trump-backed-texas-redistricting-map",
    "timestamp": "2025-08-04T22:47:37Z"
  },
  {
    "title": "'Disgusting': Trump admin under fire after quiet 'betrayal' of veterans",
    "description": "Advocates for veterans, reproductive rights campaigners, and Democrats in Congress on Monday continued to lambaste the Trump administration's quiet move to end abortion care for former U.S. service members and their relatives.\"Since taking office, the Trump a…",
    "link": "https://www.rawstory.com/trump-veterans-2673858719/",
    "timestamp": "2025-08-04T22:47:29Z"
  },
  {
    "title": "FACT FOCUS: Trump says he’s cut drug prices by up to 1,500%. That’s not possible",
    "description": "FACT FOCUS: Trump says he’s cut drug prices by up to 1,500%. That’s not possibletwincities.com",
    "link": "https://www.twincities.com/2025/08/04/trump-drug-prices-fact-check/",
    "timestamp": "2025-08-04T22:46:30Z"
  },
  {
    "title": "Jim Acosta Sinks To New Low With Disturbing Exploitation Of Shooting Victim",
    "description": "Jim Acosta announced Monday that he had conducted an interview with an AI-generated version of Joaquin Oliver, a victim of the 2018 Parkland school shooting.",
    "link": "https://dailycaller.com/2025/08/04/jim-acosta-joaquin-oliver-ai-interview/",
    "timestamp": "2025-08-04T22:44:32Z"
  },
  {
    "title": "Ayotte says she backs effort to revive pipeline project",
    "description": "Gov. Kelly Ayotte said Monday she wants to bring back a much-debated natural gas pipeline project to increase supplies to New Hampshire.",
    "link": "https://www.wmur.com/article/ayotte-constitution-pipeline-zeldin-epa-8425/65596790",
    "timestamp": "2025-08-04T22:44:21Z"
  },
  {
    "title": "White House searches for a new BLS chief with 'credibility' and 'experience'",
    "description": "White House officials began the week scrambling to find a replacement after Trump fired Bureau of Labor Statistics Commissioner Erika McEntarfer on Friday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/white-house-search-new-bls-chief-credibility-experience-rcna222910",
    "timestamp": "2025-08-04T22:43:18Z"
  },
  {
    "title": "Republicans debate Laura Loomer’s influence",
    "description": "The News\nThe social media activist Laura Loomer seems to show up whenever a Trump administration official’s career is nearing its end, and she’s helped end the tenure of several mid-level aides.\nBut as the right-wing provocateur gets closer to President Donal…",
    "link": "https://biztoc.com/x/d2576374f91eb8f8",
    "timestamp": "2025-08-04T22:42:16Z"
  },
  {
    "title": "Texas governor orders arrest of Democrats who fled Texas",
    "description": "Republican Governor Greg Abbott has ordered authorities to arrest the dozens of Texas Democrats who fled the state to successfully block a vote on a Republican plan to redraw the state's congressional districts.",
    "link": "https://www.abc.net.au/news/2025-08-05/democrats-prevent-texas-house-congressional-map/105613424",
    "timestamp": "2025-08-04T22:41:55Z"
  },
  {
    "title": "Map Shows Countries With Highest US Visa Overstay Rates",
    "description": "A map shows countries that would be affected by a State Department plan to require some visitors to pay visa bonds of up to $15,000.",
    "link": "https://www.newsweek.com/map-shows-countries-highest-us-visa-overstay-rates-2108825",
    "timestamp": "2025-08-04T22:38:01Z"
  },
  {
    "title": "A Terrible Five Days for the Truth",
    "description": "Trump’s latest moves represent an assault on reporting, statistics, and the historical record.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/a-terrible-five-days-for-the-truth/683756/",
    "timestamp": "2025-08-04T22:37:21Z"
  },
  {
    "title": "Republican lawmakers slow Trump Treasury picks over wind, solar credits",
    "description": "The senators, Chuck Grassley of Iowa and John Curtis of Utah, hail from states with large renewable energy industries and support federal tax credits that...",
    "link": "https://www.yahoo.com/news/articles/republican-lawmakers-slow-trump-treasury-223708019.html",
    "timestamp": "2025-08-04T22:37:08Z"
  },
  {
    "title": "Ghislaine Maxwell Is in Prison With Elizabeth Holmes Now",
    "description": "She was recently moved to the same minimum-security prison in Texas where Holmes and Jen Shah are serving their sentences.",
    "link": "http://www.thecut.com/article/ghislaine-maxwell-camp-bryan-prison-elizabeth-holmes.html",
    "timestamp": "2025-08-04T22:36:41Z"
  },
  {
    "title": "UN Tax Talks Could Push Polluters and Billionaires to Pay for Harm to Climate and Nature",
    "description": "New global tax rules that could help fund climate action, protect nature, and reduce inequality are being negotiated at the historic UN Framework Convention on International Tax Cooperation (UNFCITC), which kicks off a 2-week round of negotiations in New York…",
    "link": "https://www.commondreams.org/newswire/un-tax-talks-could-push-polluters-and-billionaires-to-pay-for-harm-to-climate-and-nature",
    "timestamp": "2025-08-04T22:33:51Z"
  },
  {
    "title": "Brazil’s Supreme Court orders house arrest for ex-President Jair Bolsonaro | CNN",
    "description": "The Brazilian Supreme Court has ordered the house arrest of former President Jair Bolsonaro, who is on trial over an alleged plot to overturn the results of the 2022 presidential election.",
    "link": "https://www.cnn.com/2025/08/04/americas/brazil-bolsonaro-house-arrest-intl-latam",
    "timestamp": "2025-08-04T22:31:57Z"
  },
  {
    "title": "Hillary Clinton Could Face Life In Prison for TREASON",
    "description": "Hillary Clinton may soon be spending 23 hours a day on lockdown and one hour in the “yard” at the penitentiary for committing treasonous acts not long ago. Newly declassified documents released Thursday reveal a startling picture of political manipulation and…",
    "link": "https://www.shtfplan.com/headline-news/hillary-clinton-could-face-life-in-prison-for-treason",
    "timestamp": "2025-08-04T22:30:03Z"
  },
  {
    "title": "The Men Trying to Live Forever",
    "description": "From the daily newsletter: biohackers are juicing themselves with everything from Ayurvedic herbs to electromagnetic-frequency beds.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-men-trying-to-live-forever",
    "timestamp": "2025-08-04T22:30:00Z"
  },
  {
    "title": "Laura Loomer Files New Supreme Court Petition—'Accountability Is Coming'",
    "description": "\"Everyone involved in what happened to me will pay a price,\" the conservative said on X.",
    "link": "https://www.newsweek.com/laura-loomer-supreme-court-facebook-meta-2108805",
    "timestamp": "2025-08-04T22:29:24Z"
  },
  {
    "title": "Brazil’s Supreme Court orders house arrest for former President Jair Bolsonaro",
    "description": "Last month, Bolsonaro was ordered to wear an electronic ankle monitor and given a curfew.",
    "link": "https://www.bostonherald.com/2025/08/04/brazil-bolsonaro-house-arrest/",
    "timestamp": "2025-08-04T22:29:04Z"
  },
  {
    "title": "Trump tariffs drive shift in Taiwan's PCB strategy as exports from China to US jump",
    "description": "US President Donald Trump's tariff policies have significantly disrupted global supply chain strategies, prompting shifts across Asia's electronics manufacturing landscape. A DIGITIMES analysis of shipment records from Taiwan's printed circuit board (PCB) mak…",
    "link": "https://www.digitimes.com/news/a20250801PD208/exports-taiwan-donald-trump-supply-chain-manufacturing.html",
    "timestamp": "2025-08-04T22:28:26Z"
  },
  {
    "title": "'Unconscionable': Trump Admin Blasted for Plan to Ban Abortions at VA Hospitals",
    "description": "Advocates for veterans, reproductive rights campaigners, and Democrats in Congress on Monday continued to lambaste the Trump administration's quiet move to end abortion care for former U.S. service members and their relatives.\"Since taking office, the Trump a…",
    "link": "https://www.commondreams.org/news/veterans-affairs-abortion",
    "timestamp": "2025-08-04T22:28:07Z"
  },
  {
    "title": "Brazil judge orders house arrest of former president Jair Bolsonaro",
    "description": "Brazil's supreme court issued the order saying Bolsonaro allegedly breached a ban on using social media.",
    "link": "https://www.bbc.com/news/articles/crkzn5l6jxzo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-04T22:27:22Z"
  },
  {
    "title": "This scandal involving a rising MAGA star suggests he’s a real hypocrite",
    "description": "Oklahoma school superintendent Ryan Walters is engulfed in scandal involving images of naked women as the state's public schools rank 50th in the nation.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/ryan-walters-naked-women-oklahoma-schools-rcna221763",
    "timestamp": "2025-08-04T22:27:04Z"
  },
  {
    "title": "Fox’s Larry Kudlow Stuns Harris Faulkner When He Accuses Texas of ‘Racial Gerrymandering’",
    "description": "Fox Business host Larry Kudlow accused Texas Republicans of trying to redistrict the state's congressional map in a way that would disempower racial minorities in the state.  \nThe post Fox’s Larry Kudlow Stuns Harris Faulkner When He Accuses Texas of ‘Racial …",
    "link": "https://www.mediaite.com/media/tv/foxs-larry-kudlow-stuns-harris-faulkner-when-he-accuses-texas-of-racial-gerrymandering/",
    "timestamp": "2025-08-04T22:26:14Z"
  },
  {
    "title": "Gates Foundation commits $2.5 billion for women’s health",
    "description": "The Gates Foundation announcement provides the most detail yet on one area where the foundation plans to use its remaining funds before it shuts down in 2045.",
    "link": "https://www.japantimes.co.jp/business/2025/08/05/gates-foundation-women-health/",
    "timestamp": "2025-08-04T22:22:00Z"
  },
  {
    "title": "DoJ said to open grand jury probe into 'Russiagate'",
    "description": "United States Attorney General Pam Bondi has supposedly ordered a grand jury investigation into the alleged conspiracy to link US President Donald Trump with Russia during the 2016 election, Fox News ...",
    "link": "https://biztoc.com/x/9c87cebe8fe70fb1",
    "timestamp": "2025-08-04T22:19:34Z"
  },
  {
    "title": "Kremlin plays down Trump submarine order, urges caution on nuclear rhetoric",
    "description": "The exchange takes place as Trump threatens new sanctions on Russia and buyers of its oil unless Moscow agrees to end the war in Ukraine by Friday.",
    "link": "https://www.japantimes.co.jp/news/2025/08/05/world/politics/kremlin-trump-submarine-nuclear/",
    "timestamp": "2025-08-04T22:18:00Z"
  },
  {
    "title": "Judge orders Florida, federal officials to produce 'Alligator Alcatraz' agreements",
    "description": "A federal judge has ordered officials to produce agreements showing who has legal authority at “Alligator Alcatraz,” an immigration detention center in the Florida Everglades",
    "link": "https://www.wftv.com/news/national/judge-orders-florida/ZQPHM72E5JAZLPGV6LVHYFMRLE/",
    "timestamp": "2025-08-04T22:16:38Z"
  },
  {
    "title": "‘South Park’ Production To Be Overseen By George Cheeks In Post-Merger Paramount Structure",
    "description": "At the new Paramount following the completion of the Skydance acquisition, the scripted production operations overseen by departing Paramount Global co-CEO Chris McCarthy are being folded into the newly formed Paramount TV Studios, overseen by Dana Goldberg, …",
    "link": "http://deadline.com/2025/08/south-park-production-george-cheeks-paramount-structure-1236478047/",
    "timestamp": "2025-08-04T22:15:13Z"
  },
  {
    "title": "Texas Republicans Threaten to Have Democrats Who Fled State in Redistricting Fight Arrested",
    "description": "The Texas House of Representatives voted Monday to force Democrats who fled the state in an attempt to prevent congressional redistricting to return to the... Read More\nThe post Texas Republicans Threaten to Have Democrats Who Fled State in Redistricting Figh…",
    "link": "https://www.dailysignal.com/2025/08/04/texas-republicans-vote-arrest-democrats-who-fled-state-redistricting-fight/",
    "timestamp": "2025-08-04T22:14:47Z"
  },
  {
    "title": "Republican Senators Holding Up Trump Nominees To Keep Green Gravy Train Rolling",
    "description": "Two Republican senators are slowing the confirmation process for three of Trump's Treasury nominees, citing concerns regarding solar and wind subsidies.",
    "link": "https://dailycaller.com/2025/08/04/gop-senators-trump-nominees-solar-wind-subsidies/",
    "timestamp": "2025-08-04T22:14:42Z"
  },
  {
    "title": "Statue of Confederate General Albert Pike to be reinstalled in Washington",
    "description": "WASHINGTON (Reuters) -A statue of Confederate General Albert Pike, which was overturned in 2020 during the \"Black Lives Matter\" protests after George Floyd's murder, will be reinstalled in Washington, the National Park Service said on Monday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/05/statue-of-confederate-general-albert-pike-to-be-reinstalled-in-washington",
    "timestamp": "2025-08-04T22:14:00Z"
  },
  {
    "title": "Big Apple, meet Golden State: The New York Post is launching a California newspaper",
    "description": "The California Post will be what News Corp’s CEO described as “an antidote to the jaundiced, jaded journalism that has sadly proliferated\" in the region.",
    "link": "https://www.nbcnews.com/business/media/new-york-post-announces-launch-california-newspaper-rcna222974",
    "timestamp": "2025-08-04T22:12:05Z"
  },
  {
    "title": "Nancy Mace Will Drag South Carolina Governor’s Race Into the Sewer",
    "description": "Nancy Mace will drag the South Carolina governor’s race into the sewer. The U.S. representative, known for her transphobia and anti-woke posturing, just announced her gubernatorial run and is is already hurling mud at a fellow candidate.",
    "link": "http://nymag.com/intelligencer/article/mace-will-drag-south-carolina-governors-race-into-the-sewer.html",
    "timestamp": "2025-08-04T22:09:57Z"
  },
  {
    "title": "Sydney Sweeney’s American Eagle Campaign Attracts Trump and Knockoff Cries of 2009 Ads With One of Mick Jagger’s Daughters",
    "description": "American Eagle Outfitters' stock climbed 23.5 percent, closing at $13.28 per share Monday.",
    "link": "http://wwd.com/business-news/business-features/sydney-sweeney-american-eagle-trump-mick-jaggers-daughters-1238027903/",
    "timestamp": "2025-08-04T22:09:21Z"
  },
  {
    "title": "Eric And Donald Trump Jr. To Help Launch New U.S. Manufacturing SPAC",
    "description": "Eric And Donald Trump Jr. To Help Launch New U.S. Manufacturing SPAC\n \nDonald Trump Jr. and Eric Trump are spearheading New America Acquisition I Corp., a special purpose acquisition company (SPAC) targeting a $300 million initial public offering on the New Y…",
    "link": "https://biztoc.com/x/2c229d2013017e7f",
    "timestamp": "2025-08-04T22:08:30Z"
  },
  {
    "title": "Donald Trump Sparks MAGA Backlash With New Warning to States Over Israel",
    "description": "Trump sparked blowback from his base when his administration announced a rule tying FEMA funds to states' Israel stances.",
    "link": "https://biztoc.com/x/743c3372e46b079a",
    "timestamp": "2025-08-04T22:08:25Z"
  },
  {
    "title": "Milei vetoes pension, disability spending increases as Argentina feels cuts",
    "description": "Despite his austerity measures, the president's party is expected to do well in the crucial October mid-term elections.",
    "link": "https://www.aljazeera.com/news/2025/8/4/milei-vetoes-pension-disability-spending-increases-as-argentina-feels-cuts",
    "timestamp": "2025-08-04T22:03:44Z"
  },
  {
    "title": "Elon Musk retains title as the highest-paid CEO in history with $26 billion pay package—and the only thing he has to do is show up for two years",
    "description": "The lack of performance targets in Musk's massive new pay package has some investors crying foul.",
    "link": "https://fortune.com/2025/08/04/elon-musk-pay-package-tesla-compensation/",
    "timestamp": "2025-08-04T22:02:55Z"
  },
  {
    "title": "Trump Takes on L.A. Olympics: Will Lead Task Force on 2028 Games",
    "description": "The president is announcing that he'll lead a task force on the 2028 Summer Games in Los Angeles amid tensions between the city and the White House.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/trump-la-olympics-task-force-2028-games-1236337070/",
    "timestamp": "2025-08-04T22:02:35Z"
  },
  {
    "title": "Senior Netanyahu Official: 'We Are Moving to Occupy' Entire Gaza Strip",
    "description": "In what one peace group described as \"a direct assault on international law,\" Israeli Prime Minister Benjamin Netanyahu has decided to fully occupy the Gaza Strip, at least one senior member of Israel's government told multiple media outlets on Monday.\"We are…",
    "link": "https://www.commondreams.org/news/israel-to-occupy-gaza",
    "timestamp": "2025-08-04T22:02:09Z"
  },
  {
    "title": "Billionaire Ray Dalio Calls for Overhaul of US Government Economic Data Estimates Amid BLS Controversy",
    "description": "Bridgewater Associates founder Ray Dalio says the US government needs to rethink how it comes up with its economic data. Over the weekend, President Donald Trump fired the head of the Bureau of Labor Statistics, Erika McEntarfer, because of a large downward r…",
    "link": "https://dailyhodl.com/2025/08/04/billionaire-ray-dalio-calls-for-overhaul-of-us-government-economic-data-estimates-amid-bls-controversy/",
    "timestamp": "2025-08-04T22:01:44Z"
  },
  {
    "title": "Texas Dems Slammed For Fleeing to One of the ‘Most Corrupt Gerrymandered States’ to Avoid Gerrymandering Vote",
    "description": "“Was there nobody on the PR side who was like maybe we shouldn’t go to one of the most corrupt gerrymandered states in the country?”\nThe post Texas Dems Slammed For Fleeing to One of the ‘Most Corrupt Gerrymandered States’ to Avoid Gerrymandering Vote first a…",
    "link": "https://www.mediaite.com/politics/texas-dems-slammed-for-fleeing-to-one-of-the-most-corrupt-gerrymandered-states-to-avoid-gerrymandering-vote/",
    "timestamp": "2025-08-04T22:01:40Z"
  },
  {
    "title": "FACT FOCUS: Trump says he’s cut drug prices by up to 1,500%. That’s not possible",
    "description": "Trump’s grandiose claim is mathematically impossible.",
    "link": "https://www.bostonherald.com/2025/08/04/trump-drug-prices-fact-check/",
    "timestamp": "2025-08-04T22:00:32Z"
  },
  {
    "title": "FACT FOCUS: Trump says he’s cut drug prices by up to 1,500%. That’s not possible",
    "description": "Trump’s grandiose claim is mathematically impossible.",
    "link": "https://www.denverpost.com/2025/08/04/trump-drug-prices-fact-check/",
    "timestamp": "2025-08-04T22:00:32Z"
  },
  {
    "title": "Charlamagne fires back after Trump's social media attack calls him a 'racist sleazebag'",
    "description": "Radio host Charlamagne tha God doubled down on his criticism of President Trump after the president called him a \"racist sleazebag\" in a Truth Social post.",
    "link": "https://www.foxnews.com/media/charlamagne-fires-back-after-trumps-social-media-attack-calls-him-racist-sleazebag",
    "timestamp": "2025-08-04T22:00:11Z"
  },
  {
    "title": "Take it with a grain of salt",
    "description": "As President Donald Trump puts political pressure on the Bureau of Labor Statistics, experts worry BLS data will become less trustworthy. Economists following China say they know the feeling. In this episode, what we can learn from them. Plus, we peek behind …",
    "link": "https://www.marketplace.org/episode/2025/08/04/take-it-with-a-grain-of-salt",
    "timestamp": "2025-08-04T22:00:00Z"
  },
  {
    "title": "Donald Trump Sparks MAGA Backlash With New Warning to States Over Israel",
    "description": "Trump sparked blowback from his base when his administration announced a rule tying FEMA funds to states' Israel stances.",
    "link": "https://www.newsweek.com/israel-boycotts-donald-trump-maga-response-fema-2108785",
    "timestamp": "2025-08-04T21:59:04Z"
  },
  {
    "title": "ICE is Enticing New Recruits With Student Loan Forgiveness",
    "description": "Trump has weaponized student loan forgiveness to advance his agenda.",
    "link": "https://truthout.org/articles/ice-is-enticing-new-recruits-with-student-loan-forgiveness/",
    "timestamp": "2025-08-04T21:58:56Z"
  },
  {
    "title": "Why return of Brock Lesnar at SummerSlam officially completes 'TKO-ification' of WWE",
    "description": "Bringing Lesnar back to WWE television is the latest in a string of controversial decisions made by the company's leaders",
    "link": "https://www.cbssports.com/wwe/news/why-return-of-brock-lesnar-at-summerslam-officially-completes-tko-ification-of-wwe/",
    "timestamp": "2025-08-04T21:58:28Z"
  },
  {
    "title": "'Mirage': Trump's economy exposed as a sinister 'con' by analysts",
    "description": "There appears to be a more sinister plot behind President Donald Trump's economy, according to two analysts. David Dayen, executive editor of The American Prospect, argued in a recent op-ed that Trump seems to be using bad economic figures to mask his adminis…",
    "link": "https://www.rawstory.com/trump-economy-2673858342/",
    "timestamp": "2025-08-04T21:56:03Z"
  },
  {
    "title": "Jair Bolsonaro: Brazil judge orders house arrest of former president",
    "description": "Brazil's supreme court issued the order saying Bolsonaro allegedly breached a ban on using social media.",
    "link": "https://www.bbc.com/news/articles/crkzn5l6jxzo",
    "timestamp": "2025-08-04T21:55:49Z"
  },
  {
    "title": "Why is the labor market slowing down? Experts explain",
    "description": "Why is the labor market slowing down? Experts explaingo.com",
    "link": "https://abcnews.go.com/Business/labor-market-slowing-experts-explain/story?id=124340835",
    "timestamp": "2025-08-04T21:53:17Z"
  },
  {
    "title": "U.S. stocks close higher as investors buy dip",
    "description": "NEW YORK, Aug. 4 (Xinhua) -- U.S. stocks rebounded Monday as investors looked to recover from sharp losses at the end of last week, which were triggered by growing concerns about the U.S. economy and the impact of new tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/05/us-stocks-close-higher-as-investors-buy-dip",
    "timestamp": "2025-08-04T21:51:00Z"
  },
  {
    "title": "Judge orders Florida, federal officials to produce 'Alligator Alcatraz' agreements",
    "description": "Federal and state officials in Florida must produce agreements showing which government agency or private contractor has legal authority to detain people or perform immigration officer roles at “Alligator Alcatraz,” the immigration detention facility in the E…",
    "link": "https://japantoday.com/category/world/judge-orders-florida-federal-officials-to-produce-%27alligator-alcatraz%27-agreements",
    "timestamp": "2025-08-04T21:49:25Z"
  },
  {
    "title": "China Throws A Fit After US Identifies Key Weakness In Trade Talks",
    "description": "China pushed back strongly against U.S. attempts to restrict their importing of oil from Russia and Iran, exposing a key weakness for Beijing.",
    "link": "https://dailycaller.com/2025/08/04/china-throws-fit-after-us-identifies-weakness-trade-talks-oil-iran-russia-trump/",
    "timestamp": "2025-08-04T21:49:05Z"
  },
  {
    "title": "Trump admin eyes plan to win 'second space race'",
    "description": "Transportation Secretary and former Fox News host Sean Duffy, who has described New York's subway system as a \"hellscape,\" wants to put a nuclear reactor on the moon, according to a new report. The project would be the first major action for Duffy, Politico r…",
    "link": "https://www.rawstory.com/sean-duffy-2673858489/",
    "timestamp": "2025-08-04T21:49:02Z"
  },
  {
    "title": "Americans face price rises for luxury watches after Trump’s Swiss tariffs",
    "description": "<![CDATA[ Manufacturers and dealers are threatened by increased levy in a market worth more than US$5 billion. ]]>",
    "link": "https://cnaluxury.channelnewsasia.com/obsessions/trump-tariffs-swiss-watches-2025-259681",
    "timestamp": "2025-08-04T21:46:54Z"
  },
  {
    "title": "US could require up to $15,000 bonds for some tourist visas under pilot program",
    "description": "WASHINGTON (Reuters) -The U.S. could require bonds of up to $15,000 for some tourist and business visas under a pilot program launching in two weeks, a government notice said on Monday, an effort that aims to crack down on visitors who overstay their visas. R…",
    "link": "https://www.thestar.com.my/news/world/2025/08/05/us-could-require-up-to-15000-bonds-for-some-tourist-visas-under-pilot-program",
    "timestamp": "2025-08-04T21:46:00Z"
  },
  {
    "title": "Texas Dems also skipped town in 2021 to avoid a vote, and several caught COVID-19 in DC",
    "description": "Texas House Democrats flee state to block redistricting vote, claiming Republicans are using an intentionally racist map to undermine Black and Latino voters.",
    "link": "https://www.foxnews.com/politics/texas-dems-also-skipped-town-2021-avoid-vote-several-caught-covid-19-dc",
    "timestamp": "2025-08-04T21:45:26Z"
  },
  {
    "title": "Examining claim Trump was caught cheating at golf 2nd time in a week",
    "description": "The president allegedly broke the rules at the Trump National Bedminster 2025 Men's Senior Club Championship, which the White House says he won.",
    "link": "https://www.snopes.com//news/2025/08/04/trump-golf-cheating/",
    "timestamp": "2025-08-04T21:45:00Z"
  },
  {
    "title": "Radio Host Charlamagne Tells Trump 'I'm Rooting for You' After POTUS Rips 'Low IQ Sleazebag'",
    "description": "Charlamagne tha God told President Donald Trump \"I'm rooting for you, but I need you focused,\" after the president slammed the radio host as \"low IQ.\"\nThe post Radio Host Charlamagne Tells Trump ‘I’m Rooting for You’ After POTUS Rips ‘Low IQ Sleazebag’ appear…",
    "link": "https://www.breitbart.com/entertainment/2025/08/04/radio-host-charlamagne-tells-trump-im-rooting-for-you-after-potus-rips-low-iq-sleazebag/",
    "timestamp": "2025-08-04T21:44:48Z"
  },
  {
    "title": "How Trump decided to fire a little-known statistician, sparking conspiracy theories about government data | CNN Politics",
    "description": "President Donald Trump was fuming about the July jobs report signaling a significant slowdown in the economy when he recalled one of his simmering resentments: the statistician overseeing the tabulation of the monthly figures was appointed by former President…",
    "link": "https://www.cnn.com/2025/08/04/politics/bls-commissioner-trump-firing-decision",
    "timestamp": "2025-08-04T21:44:44Z"
  },
  {
    "title": "U.S. Clean Tech Leadership at Risk Due to Trump Policies, Investors Warn",
    "description": "Veteran clean tech investors say their sector will survive but warn that the U.S. is \"going to lose its leadership position\" on technologies of tomorrow.",
    "link": "https://www.newsweek.com/us-clean-tech-leadership-risk-due-trump-policies-investors-warn-2108811",
    "timestamp": "2025-08-04T21:44:25Z"
  },
  {
    "title": "Matthew Tkachuk and Wayne Gretzky team up with Donald Trump to revive iconic Presidential Fitness Test for youth",
    "description": "Donald Trump's President's Council on Sports, Fitness, and Nutrition includes Wayne Gretzky and Matthew Tkachuk. The Council will focus on fitness in schools. It aims to restore college athletic customs and protect women's sports. Matthew Tkachuk impressed th…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/matthew-tkachuk-and-wayne-gretzky-team-up-with-donald-trump-to-revive-iconic-presidential-fitness-test-for-youth/articleshow/123104387.cms",
    "timestamp": "2025-08-04T21:43:01Z"
  },
  {
    "title": "Trump Threatens to Raise Tariffs on Goods From India Over Russian Oil Purchases",
    "description": "Donald Trump said on Monday he will substantially raise tariffs on goods from India over its Russian oil purchases, while New Delhi said it would take measures to safeguard its interests and called its targeting by the U.S. president \"unjustified.\"",
    "link": "https://gcaptain.com/trump-threatens-to-raise-tariffs-on-goods-from-india-over-russian-oil-purchases/",
    "timestamp": "2025-08-04T21:42:48Z"
  },
  {
    "title": "Justice Department Opens Grand Jury Probe Into ‘Russiagate’",
    "description": "The Department of Justice staff will act on the criminal referral from Director of National Intelligence Tulsi Gabbard related to the reputed conspiracy to tie... Read More\nThe post Justice Department Opens Grand Jury Probe Into ‘Russiagate’ appeared first on…",
    "link": "https://www.dailysignal.com/2025/08/04/justice-department-opens-grand-jury-probe-russiagate/",
    "timestamp": "2025-08-04T21:41:19Z"
  },
  {
    "title": "The jobs numbers aren’t ‘rigged.’ Trump owns this economy.",
    "description": "Ali Velshi fact-checks Trump’s claim that economic numbers are ‘rigged’ against him as his trade war continues to roil the American economy.",
    "link": "https://www.msnbc.com/top-stories/latest/trumps-fires-bureau-labor-statistics-economy-tariffs-rcna222980",
    "timestamp": "2025-08-04T21:41:06Z"
  },
  {
    "title": "Democrat Edges Out Incumbent Florida Republican in New Poll",
    "description": "A new poll showed a House Republican in Florida trailing a potential Democratic rival in a district Trump won by double-digits last year.",
    "link": "https://www.newsweek.com/maria-elvira-salazar-florida-congressional-poll-2108810",
    "timestamp": "2025-08-04T21:39:37Z"
  },
  {
    "title": "Rep. Crockett: Trump Is A \"Piece Of Sh*t,\" He Would Not Be Able To Get Away With This In A Functioning Democracy",
    "description": "Rep. Jasmine Crockett (D-TX) had some strong words for President Donald Trump at MoveOn's \"Won't Back Down\" event in Phoenix on Sunday. Crockett said the judicial branch, particularly the Supreme Court, has \"no ethics guardrails,\" and it is time for Democrats…",
    "link": "https://www.realclearpolitics.com/video/2025/08/04/rep_crockett_trump_is_a_piece_of_sht_he_would_not_be_able_to_get_away_with_this_in_a_functioning_democracy.html",
    "timestamp": "2025-08-04T21:37:34Z"
  },
  {
    "title": "Reducing Merger Uncertainty Could Help The American Economy",
    "description": "The Trump Administration wants to reduce merger uncertainty. To do so, it might tweak  Biden era merger guidelines or give merger speeches to reduce business risk.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/08/04/reducing-merger-uncertainty-could-help-the-american-economy/",
    "timestamp": "2025-08-04T21:36:34Z"
  },
  {
    "title": "Savannah Chrisley slams 'vile' messages she's received since Trump pardoned her parents",
    "description": "Reality TV star Savannah Chrisley posted a hateful Instagram message targeting her following President Donald Trump's pardon of her parents Todd and Julie Chrisley.",
    "link": "https://www.foxnews.com/entertainment/savannah-chrisley-slams-vile-messages-shes-received-since-trump-pardoned-her-parents",
    "timestamp": "2025-08-04T21:36:05Z"
  },
  {
    "title": "Epstein victims attack Trump admin in court: 'I am not some pawn'",
    "description": "Two victims of sex trafficker Jeffrey Epstein attacked President Donald Trump's administration in letters to the court where grand jury testimony in the case remains sealed, according to CNN.The victims, who remained anonymous, both filed letters with the cou…",
    "link": "https://www.rawstory.com/trump-epstein-2673858404/",
    "timestamp": "2025-08-04T21:35:03Z"
  },
  {
    "title": "Trump Says US to Hike India’s Tariffs Over Russian Oil Buys",
    "description": "President Donald Trump said he would be “substantially raising” the tariff on Indian exports to the US over the Asian nation’s purchases of Russian oil, a move New Delhi slammed as unjustified in an escalating fight between the two major economies.\n“India is …",
    "link": "https://biztoc.com/x/5b62d92dabd8c967",
    "timestamp": "2025-08-04T21:34:40Z"
  },
  {
    "title": "Harvard Scientist Says Interstellar Comet May Be Alien Spacecraft",
    "description": "A mysterious object moving through the solar system has caught the attention of Harvard astrophysicist Avi Loeb, who believes it could be more than just a comet—and possibly an alien spacecraft. The interstellar body, designated 3I/ATLAS, was first spotted on…",
    "link": "https://freerepublic.com/focus/f-chat/4332656/posts",
    "timestamp": "2025-08-04T21:34:18Z"
  },
  {
    "title": "Don’t trust the ‘influencers’ — Trump’s base isn’t breaking over Israel",
    "description": "Crucially, Republicans wary of US backing for the war against Hamas don’t see this stance as being anti-Israel — but as being pro-American.",
    "link": "https://nypost.com/2025/08/04/opinion/dont-trust-the-influencers-trumps-base-isnt-breaking-over-israel/",
    "timestamp": "2025-08-04T21:32:48Z"
  },
  {
    "title": "With Derek Dooley entering Senate race, old feud could reignite between Trump, Kemp",
    "description": "“The more bruising the primary is, the more difficult it will be to ultimately win the general election,” a political expert said.",
    "link": "https://www.wsbtv.com/news/local/atlanta/with-derek-dooley-entering-senate-race-old-feud-could-reignite-between-trump-kemp/TYTNHAKWPFFJHJSCFD3U3BSGKI/",
    "timestamp": "2025-08-04T21:31:28Z"
  },
  {
    "title": "Brazil’s Supreme Court orders house arrest for former President Jair Bolsonaro",
    "description": "Brazil’s Supreme Court on Monday ordered the house arrest for the country's former President Jair Bolsonaro, on trial for allegedly masterminding a coup plot...",
    "link": "https://www.yahoo.com/news/articles/brazil-supreme-court-ordered-house-213057881.html",
    "timestamp": "2025-08-04T21:30:57Z"
  },
  {
    "title": "Judge orders Florida, federal officials to produce 'Alligator Alcatraz' agreements",
    "description": "Federal and state officials in Florida must produce agreements showing which government agency or private contractor has legal authority to detain people or ...",
    "link": "https://www.yahoo.com/news/articles/judge-orders-florida-federal-officials-213016262.html",
    "timestamp": "2025-08-04T21:30:16Z"
  },
  {
    "title": "Monument to Confederate General Accused of KKK Affiliation to Be Reinstalled in Washington, D.C.",
    "description": "A statue of a Confederate general toppled and burned in Washington, D.C., in 2020 will be reinstalled.",
    "link": "https://www.artnews.com/art-news/news/confederate-general-monument-reinstalled-trump-1234748889/",
    "timestamp": "2025-08-04T21:30:14Z"
  },
  {
    "title": "Sexy Jeans, Culture Wars and Profits -- The Sydney Sweeney Effect",
    "description": "When American Eagle launched its fall campaign featuring Sydney Sweeney with the cheeky tagline “Sydney Sweeney Has Great Jeans,” the expected outrage frenzy was immediate. In the ad, the 27-year-old actress says, “Genes are passed down from parents to offspr…",
    "link": "https://freerepublic.com/focus/f-news/4332655/posts",
    "timestamp": "2025-08-04T21:29:37Z"
  },
  {
    "title": "Trump’s ‘Queen of Hearts’ moment with the BLS echoes Putin’s purges and Orwell’s omens",
    "description": "The Queen of Hearts would say “off with their heads!” every time she was disappointed. Trump says data he doesn’t like is “faked.”",
    "link": "https://fortune.com/2025/08/04/why-did-donald-trump-fire-mcentarfer-bureau-labor-statistics/",
    "timestamp": "2025-08-04T21:29:15Z"
  },
  {
    "title": "By firing the Bureau of Labor Statistics chief, the Trump administration raises concerns that it may further restrict the flow of essential government information",
    "description": "The government, because it takes the lead in implementing official policies, is in a unique position to collect and store sensitive data collected over long ...",
    "link": "https://www.yahoo.com/news/data-show-government-programs-not-122658052.html",
    "timestamp": "2025-08-04T21:29:13Z"
  },
  {
    "title": "Trump threatens India with 'substantial' tariff hike for buying Russian oil",
    "description": "The US president says India doesn't care \"how many people in Ukraine are being killed\" - but India calls the tariff threat \"unjustified\".",
    "link": "https://www.bbc.com/news/articles/cly647wx9l3o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-04T21:28:53Z"
  },
  {
    "title": "Gov. Abbott Orders Arrest of Texas's 'Delinquent House Democrats'",
    "description": "Texas Governor Greg Abbott ordered the arrest of what he called the \"Delinquent House Democrats\" after the legislators failed to return to the Capitol as ordered on Sunday. The governor ordered Texas Department of Public Safety troopers to \"locate, arrest, an…",
    "link": "https://www.breitbart.com/border/2025/08/04/gov-abbott-orders-arrest-of-texass-delinquent-house-democrats/",
    "timestamp": "2025-08-04T21:28:49Z"
  },
  {
    "title": "What’s Going On With Marjorie Taylor Greene?",
    "description": "The congresswoman from Georgia has split with Donald Trump and the MAGA faithful on a number of issues over the last few months. In a new interview, she said she doesn’t want “anything to do with“ the current Republican Party.",
    "link": "https://www.vanityfair.com/news/story/whats-going-on-with-marjorie-taylor-greene",
    "timestamp": "2025-08-04T21:27:29Z"
  },
  {
    "title": "Trump Is Making Climate Change Denialism Federal Policy",
    "description": "Even as the world reels from record temperatures, the U.S. leader is spreading misinformation.",
    "link": "http://foreignpolicy.com/2025/08/04/trump-climate-change-epa-regulation/",
    "timestamp": "2025-08-04T21:27:13Z"
  },
  {
    "title": "Trump swoons over Sydney Sweeney after Republican reveal",
    "description": "President Donald Trump has weighed in on reports that the 'Euphoria' star registered as a Republican last year: \"She has the hottest ad out there.\" American Eagle's stock rises after President Trump praised the company’s denim ad featuring Sydney Sweeney.[ima…",
    "link": "https://ohnotheydidnt.livejournal.com/130983643.html",
    "timestamp": "2025-08-04T21:26:50Z"
  },
  {
    "title": "Texas Democrats Defy Abbott Deadline—as Republicans Threaten Arrest",
    "description": "Texas House Speaker Dustin Burrows plans to sign warrants to track down and arrest more than 50 Democrats who left the state over the weekend in order to deny Republicans the quorum needed to create a new gerrymandered congressional map at President Trump’s b…",
    "link": "https://newrepublic.com/post/198804/texas-democrats-republicans-arrest-gerrymander-map",
    "timestamp": "2025-08-04T21:26:06Z"
  },
  {
    "title": "Nicolle Wallace thinks Trump's 'desperation is showing': 'Who's going to tell him?'",
    "description": "MSNBC's Nicolle Wallace couldn't help but notice that President Donald Trump and his administration spent the weekend dedicated to the ongoing effort to distract from the Jeffrey Epstein scandal. At the top of her Monday show, Wallace proposed a riddle: \"What…",
    "link": "https://www.rawstory.com/trump-epstein-2673858366/",
    "timestamp": "2025-08-04T21:26:03Z"
  }
]