[
  {
    "title": "Joe Biden Is Back-ish",
    "description": "But an out-of-context video clip squared attention away from Biden’s criticism of Donald Trump and onto the former president himself.",
    "link": "https://www.vanityfair.com/news/story/joe-biden-is-back-ish",
    "timestamp": "2025-04-16T19:46:36Z"
  },
  {
    "title": "Nearly 50 House Democrats say no to unauthorized AI in Trump administration",
    "description": "Members of Congress have called on the Trump administration to cease applying any unauthorized artificial intelligence system toward its effort to slash government spending, according to a letter they sent on Wednesday.Nearly 50 Democrats in the U.S. House of…",
    "link": "https://www.channelnewsasia.com/business/nearly-50-house-democrats-say-no-unauthorized-ai-trump-administration-5070496",
    "timestamp": "2025-04-16T19:45:52Z"
  },
  {
    "title": "Letitia James Pretends She’s on the Phone to Avoid Reporters Asking Questions About Her Growing Mortgage Fraud Scandal",
    "description": "New York Attorney General Letitia James unleashed a fiery tirade in response to the Trump Administration’s criminal referral withdrawal, while facing scrutiny over her own controversies. The unfolding drama reveals tensions at the highest levels of politics.\n…",
    "link": "https://www.thegatewaypundit.com/2025/04/letitia-james-pretends-shes-phone-avoid-reporters-asking/",
    "timestamp": "2025-04-16T19:45:25Z"
  },
  {
    "title": "Michael Rapaport Rips NBA Coach Steve Kerr's 'Bulls**t' Harvard Comments: 'It’s a Jew Hate Anti-Israel Issue'",
    "description": "Actor-comedian Michael Rapaport ripped NBA coach Steve Kerr for his comments praising Harvard University for defying President Trump's rules concerning civil rights and DEI policies.\nThe post Michael Rapaport Rips NBA Coach Steve Kerr’s ‘Bulls**t’ Harvard Com…",
    "link": "https://www.breitbart.com/entertainment/2025/04/16/michael-rapaport-rips-nba-coach-steve-kerrs-bullst-harvard-comments-its-a-jew-hate-anti-israel-issue/",
    "timestamp": "2025-04-16T19:45:06Z"
  },
  {
    "title": "Trump kept his promise to order a ban on transgender female athletes. Court fights have arrived",
    "description": "The Justice Department sued Maine over the issue this week.",
    "link": "https://www.bostonherald.com/2025/04/16/trump-transgender-athletes-explained/",
    "timestamp": "2025-04-16T19:43:23Z"
  },
  {
    "title": "Even by Elon Musk's Own Demonstrably Unreliable Estimation, DOGE Will Fall Far Short of His Target",
    "description": "Shortly before last fall's presidential election, Elon Musk breezily estimated that a second Trump administration could reduce annual federal spending by",
    "link": "https://reason.com/2025/04/16/even-by-elon-musks-own-demonstrably-unreliable-estimation-doge-will-fall-far-short-of-his-target/",
    "timestamp": "2025-04-16T19:43:23Z"
  },
  {
    "title": "Trump’s Trade War Could Turbocharge Deforestation in the Amazon",
    "description": "Massive tariffs on China will drive up soybean production in Brazil at the rainforest’s expense.",
    "link": "https://www.theatlantic.com/science/archive/2025/04/brazil-amazon-rainforest-trump-china-soybean/682483/",
    "timestamp": "2025-04-16T19:43:02Z"
  },
  {
    "title": "FAIR: Failing to Rise to the Constitutional Crisis",
    "description": "Trump’s defiance of the courts is a declaration that the United States will no longer operate as a constitutional republic.",
    "link": "https://fair.org/home/failing-to-rise-to-the-constitutional-crisis/",
    "timestamp": "2025-04-16T19:42:43Z"
  },
  {
    "title": "George Clooney Tells CNN It Was His ‘Civic Duty’ To Pen Scathing Biden Op-Ed: Democrats Were ‘Not Telling the Truth’",
    "description": "George Clooney told CNN it was his \"civic duty\" to pen a scathing op-ed in 2024 calling for then-President Joe Biden to drop his reelection bid.\nThe post George Clooney Tells CNN It Was His ‘Civic Duty’ To Pen Scathing Biden Op-Ed: Democrats Were ‘Not Telling…",
    "link": "https://www.mediaite.com/tv/george-clooney-tells-cnn-it-was-his-civic-duty-to-pen-scathing-biden-op-ed-democrats-were-not-telling-the-truth/",
    "timestamp": "2025-04-16T19:42:20Z"
  },
  {
    "title": "Elon Musk Finds Women On X To Have His Babies For 'Legion' Of Children: Report",
    "description": "MAGA influencer Ashley St. Clair said she was offered money and support to keep quiet about the child she shares with Elon Musk.",
    "link": "https://www.huffpost.com/entry/elon-musk-ashley-st-clair-legion-babies_n_67ffef3ee4b0485a7732a835",
    "timestamp": "2025-04-16T19:41:53Z"
  },
  {
    "title": "The top 41 moments in WWE WrestleMania history",
    "description": "From 1985-2024, here are the standout matches and segments from WWE's annual \"Showcase of the Immortals.\"",
    "link": "https://sports.yahoo.com/wrestling/article/the-top-41-moments-in-wwe-wrestlemania-history-194120356.html",
    "timestamp": "2025-04-16T19:41:20Z"
  },
  {
    "title": "Elon Musk receives huge praise from Vladimir Putin who compares Donald Trump adviser to legendary Soviet space engineer",
    "description": "Russia and the United States are aiming to forge closer ties under President Donald Trump's administration, of which billionaire SpaceX founder Musk is a key figure, as per reports.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-receives-huge-praise-from-vladimir-putin-who-compares-donald-trump-adviser-to-legendary-soviet-space-engineer/articleshow/120356333.cms",
    "timestamp": "2025-04-16T19:38:22Z"
  },
  {
    "title": "Who wants to be a billionaire? Opinion",
    "description": "Opinion: Donald Trump's re-election shining a light on role of billionaires in politics.",
    "link": "https://www.nzherald.co.nz/nz/who-wants-to-be-a-billionaire-opinion/WWPAETORBJH3BO3IPY3INIX22Y/",
    "timestamp": "2025-04-16T19:38:15Z"
  },
  {
    "title": "The Situation at Columbia VIII",
    "description": "There was an Arts and Sciences faculty meeting today here at Columbia, in which the acting president Claire Shipman spoke for a while and then took questions from faculty members. The questions on the whole were challenging her on exactly … Continue reading →",
    "link": "https://www.math.columbia.edu/~woit/wordpress/?p=14578",
    "timestamp": "2025-04-16T19:37:24Z"
  },
  {
    "title": "Judge Calls Trump’s Order a ‘Shocking Abuse of Power’",
    "description": "\"In a blistering ruling, a federal judge blocked a new executive order from President Donald Trump punishing a prominent law firm that successfully sued Fox News for promoting false claims of election fraud,\" NBC News",
    "link": "https://politicalwire.com/2025/04/16/judge-calls-trumps-order-a-shocking-abuse-of-power/",
    "timestamp": "2025-04-16T19:36:52Z"
  },
  {
    "title": "California Sues Trump Administration to Block Tariffs",
    "description": "California on Wednesday filed a lawsuit seeking to block U.S. President Donald Trump's sweeping tariffs on foreign trading partners, accusing him of abusing his powers and inflicting financial harm on the state and nation.",
    "link": "https://gcaptain.com/california-sues-trump-administration-to-block-tariffs/",
    "timestamp": "2025-04-16T19:35:19Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing as judge finds cause to hold Trump administration in contempt",
    "description": "The move by U.S. District Judge Boasberg marks an escalation in a battle between the judicial and executives branches of government over a president’s powers to carry out key White House priorities.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-briefing-as-judge-finds-cause-to-hold-trump-administration-in-contempt",
    "timestamp": "2025-04-16T19:35:14Z"
  },
  {
    "title": "Tesla Stock Hits Dreaded Death Cross",
    "description": "Shares of embattled carmaker Tesla have reached a bearish \"death cross\" this week, indicating heightened volatility and future losses. A \"death cross\" indicates when a company's 50-day moving average crosses below its 200-day average, as Business Insider expl…",
    "link": "https://futurism.com/tesla-stock-hits-dreaded-death-cross",
    "timestamp": "2025-04-16T19:32:46Z"
  },
  {
    "title": "Trump’s Misleading Promotion of ‘Clean’ Coal",
    "description": "While presenting a series of executive orders conceived to increase electricity generation from coal, President Donald Trump misleadingly suggested that environmental regulations were to blame for the industry's decline, wrongly said that coal plants are bein…",
    "link": "https://www.factcheck.org/2025/04/trumps-misleading-promotion-of-clean-coal/",
    "timestamp": "2025-04-16T19:31:44Z"
  },
  {
    "title": "Fed's Powell reasserts support for stablecoin legislation",
    "description": "As digital assets gain mainstream adoption, establishing a legal framework for stablecoins is a “good idea,” said US Federal Reserve Chair Jerome Powell.In an April 16 panel at the Economic Club of Chicago, Powell commented on the evolution of the cryptocurre…",
    "link": "https://cointelegraph.com/news/fed-powell-reasserts-support-stablecoin-legislation",
    "timestamp": "2025-04-16T19:31:43Z"
  },
  {
    "title": "WHO member states agree on treaty to fight future pandemics",
    "description": "The agreement is seen as a win for global health ahead of the US withdrawal from the WHO and amidst foreign aid cuts by the US government.",
    "link": "https://www.pharmaceutical-technology.com/news/who-member-states-agree-on-treaty-to-fight-future-pandemics/",
    "timestamp": "2025-04-16T19:31:40Z"
  },
  {
    "title": "Solana Retests Bearish Breakout Zone – $65 Target Still In Play?",
    "description": "Solana is trading above the $125 level after bulls stepped in and reclaimed key levels, sparking optimism across the market. After enduring weeks of massive selling pressure, this recovery marks the first sign of strength from buyers since early March. Still,…",
    "link": "http://www.newsbtc.com/news/solana/solana-retests-bearish-breakout-zone-65-target-still-in-play/",
    "timestamp": "2025-04-16T19:30:02Z"
  },
  {
    "title": "Manufacturing jobs are never coming back (Dylan Matthews/Vox)",
    "description": "Dylan Matthews / Vox:\nManufacturing jobs are never coming back  —  Putting Americans back to work in factories isn't just hard.  It's impossible. … “Jobs and factories will come roaring back into our country,” President Donald Trump promised on “Liberation Da…",
    "link": "https://www.memeorandum.com/250416/p95",
    "timestamp": "2025-04-16T19:30:01Z"
  },
  {
    "title": "Trump officials could face contempt charges over deportations, says judge",
    "description": "Ruling escalates the confrontation between judicial and executive branches",
    "link": "https://www.irishtimes.com/world/us/2025/04/16/trump-officials-could-face-contempt-charges-over-deportations-says-judge/",
    "timestamp": "2025-04-16T19:29:20Z"
  },
  {
    "title": "Let's talk about Zeno's paradox",
    "description": "Since President Donald Trump took office, his administration has ignored court rulings on a range of issues from press access to deportations. Now, a federal judge might hold him in criminal contempt of court. We’ll unpack the Zeno’s paradox of constitutional…",
    "link": "https://www.marketplace.org/episode/2025/04/16/lets-talk-about-zenos-paradox",
    "timestamp": "2025-04-16T19:29:17Z"
  },
  {
    "title": "A running list of Trump's second-term national security controversies",
    "description": "Several scandals surrounding national security have rocked the Trump administration",
    "link": "https://theweek.com/politics/donald-trump-national-security-controversies",
    "timestamp": "2025-04-16T19:29:05Z"
  },
  {
    "title": "'Wild time': Wall Street strategists warn of uncertain outlook amid Trump's tariffs",
    "description": "Tariffs set off one of the most volatile trading periods in Wall Street history.",
    "link": "https://abcnews.go.com/Business/wild-time-wall-street-strategists-warn-uncertain-outlook/story?id=120820127",
    "timestamp": "2025-04-16T19:28:57Z"
  },
  {
    "title": "Trump Fires Two Democrats from Credit Union Watchdog Board",
    "description": "President Donald Trump has fired two Democratic board members from the National Credit Union Administration (NCUA), escalating his efforts to reshape independent regulatory agencies. Todd Harper and Tanya Otsuka confirmed Wednesday they were removed, leaving …",
    "link": "https://biztoc.com/x/12707376e8932fcf",
    "timestamp": "2025-04-16T19:28:40Z"
  },
  {
    "title": "Dutch company ASML struggles with uncertainty on U.S. tariffs",
    "description": "THE HAGUE, April 16 (Xinhua) -- Dutch chip-making equipment manufacturer ASML issued a warning on Wednesday regarding the growing uncertainty linked to new U.S. tariffs, as it released lower financial results for the first quarter (Q1) of 2025. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/17/dutch-company-asml-struggles-with-uncertainty-on-us-tariffs",
    "timestamp": "2025-04-16T19:28:00Z"
  },
  {
    "title": "Shein, Temu to get pricier as Trump cracks down on cheap imports",
    "description": "Chinese e-marketplace Temu and fast-fashion retailer Shein will raise prices next week as U.S. President Donald Trump's sweeping tariffs and crackdown on low-value imports push up costs for the companies known for their budget offerings.In nearly identical le…",
    "link": "https://www.channelnewsasia.com/business/shein-temu-get-pricier-trump-cracks-down-cheap-imports-5070447",
    "timestamp": "2025-04-16T19:26:14Z"
  },
  {
    "title": "Tariffs will hit US economy and raise prices - Federal Reserve Chair Jerome Powell",
    "description": "Jerome Powell, chair of the Federal Reserve, said Donald Trump's new import taxes were larger than expected.",
    "link": "https://www.bbc.co.uk/news/articles/c77ndzy0m2vo",
    "timestamp": "2025-04-16T19:25:46Z"
  },
  {
    "title": "What Is DHgate? Trump Tariffs Drive Surge in Downloads for Chinese Apps",
    "description": "The fallout from President Donald Trump's sky-high tariffs on China have consumers looking deeper into Chinese shopping platforms, but they still might not be a way around import taxes.",
    "link": "https://www.cnet.com/culture/fashion/what-is-dhgate-trump-tariffs-drive-surge-in-downloads-for-chinese-apps/",
    "timestamp": "2025-04-16T19:25:37Z"
  },
  {
    "title": "Unplug China, plug into India: Centre looks to attract US cos planning to exit China",
    "description": "India is actively pursuing US companies seeking to relocate manufacturing from China, aiming to capitalize on global supply chain shifts in sectors like electronics and pharmaceuticals. The government is also encouraging Indian companies to target the US mark…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/unplug-china-plug-into-india-centre-looks-to-attract-us-cos-planning-to-exit-china/articleshow/120356180.cms",
    "timestamp": "2025-04-16T19:25:28Z"
  },
  {
    "title": "Schweizer: Trump's Pick to Lead IRS Is a 'Breath of Fresh Air,' 'Real Man of the People'",
    "description": "No one likes tax time, but one fresh character might offer at least some entertainment.\nThe post Schweizer: Trump’s Pick to Lead IRS Is a ‘Breath of Fresh Air,’ ‘Real Man of the People’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/16/schweizer-trumps-pick-to-lead-irs-is-a-breath-of-fresh-air-real-man-of-the-people/",
    "timestamp": "2025-04-16T19:23:32Z"
  },
  {
    "title": "Trump and DOGE to end free tax filings through IRS Direct File system: report",
    "description": "President Donald Trump's administration, in consultation with the Department of Government Efficiency (DOGE), will reportedly shut down the free tax filing system known as Direct File.The Associated Press reported on Wednesday that the Trump administration wo…",
    "link": "https://www.rawstory.com/trump-doge-irs-direct-file/",
    "timestamp": "2025-04-16T19:23:10Z"
  },
  {
    "title": "SCOOP: HUD reveals how many staffers have packed their bags and taken resignation offers",
    "description": "The Department of Housing and Urban Development released the numbers on how many staffers took a second resignation offer after the OPM's fork in the road offer.",
    "link": "https://www.foxnews.com/politics/scoop-hud-reveals-how-many-staffers-packed-bags-took-latest-deferred-resignation-offer",
    "timestamp": "2025-04-16T19:23:06Z"
  },
  {
    "title": "Fed Chair Jerome Powell Quotes Ferris Bueller to Warn Trump Tariffs Will Fuel Inflation And Slow Down Growth",
    "description": "Federal Reserve Chair Jerome Powell delivered remarks at the Economic Club of Chicago Wednesday on a variety of topics, including warning that President Donald Trump's proposed tariffs were unprecedented, even bigger than the Smoot-Hawley Tariff Act.\nThe post…",
    "link": "https://www.mediaite.com/news/fed-chair-jerome-powell-quotes-ferris-bueller-to-warn-trump-tariffs-will-fuel-inflation-and-slow-down-growth/",
    "timestamp": "2025-04-16T19:21:34Z"
  },
  {
    "title": "Panic over U.S. import tariffs spurs fastest retail sales growth in two years",
    "description": "Economic data has validated anecdotal reports: Some panicked consumers are hurrying to buy big-ticket items like cars, electronics…\nThe post Panic over U.S. import tariffs spurs fastest retail sales growth in two years appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/04/16/panic-over-u-s-import-tariffs-spurs-fastest-retail-sales-growth-in-two-years/",
    "timestamp": "2025-04-16T19:21:21Z"
  },
  {
    "title": "‘Daily Show’ Calls Stephen Miller the Multiverse’s ‘Most Whiny Lex Luthor’ | Video",
    "description": "\"The Trump administration isn't just enjoying their fun, new constitutional loophole. They're also going on offense,\" host Ronny Chieng says\nThe post ‘Daily Show’ Calls Stephen Miller the Multiverse’s ‘Most Whiny Lex Luthor’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/daily-show-ronny-chieng-stephen-miller-joke-kilmar-garcia-deportation-video/",
    "timestamp": "2025-04-16T19:20:43Z"
  },
  {
    "title": "Tariffs will hit US economy and raise prices, says Fed boss",
    "description": "Jerome Powell, chair of the Federal Reserve, said Donald Trump's new import taxes were larger than expected.",
    "link": "https://www.bbc.com/news/articles/c77ndzy0m2vo",
    "timestamp": "2025-04-16T19:20:26Z"
  },
  {
    "title": "Los Angeles Teachers’ Union Defends Students From Trump’s Anti-Migrant Crackdown",
    "description": "Some unions like United Teachers Los Angeles are including immigrants’ rights protections in their bargaining proposals.",
    "link": "https://truthout.org/articles/los-angeles-teachers-union-defends-students-from-trumps-anti-migrant-crackdown/",
    "timestamp": "2025-04-16T19:19:25Z"
  },
  {
    "title": "US proposes looser interpretation of law that protects threatened species",
    "description": "The public may submit comments on the proposal for 30 days following its publication in the Federal Register, which is expected on Thursday.",
    "link": "https://www.jpost.com/environment-and-climate-change/article-850383",
    "timestamp": "2025-04-16T19:19:22Z"
  },
  {
    "title": "Why Was Kilmar Abrego Garcia Deported to El Salvador?",
    "description": "Abrego Garcia was mistakenly deported to El Salvador despite being a legal U.S. resident for several years. Learn about his case here.",
    "link": "https://hollywoodlife.com/feature/why-was-kilmar-abrego-garcia-deported-5381002/",
    "timestamp": "2025-04-16T19:18:32Z"
  },
  {
    "title": "Trump Ethereum DeFi Project Gets Another Big Investment",
    "description": "Dubai-based DWF Labs has purchased $25 million in WLFI, the native token of the Trump family-backed World Liberty Financial.",
    "link": "https://decrypt.co/315093/trump-ethereum-defi-project-big-investment",
    "timestamp": "2025-04-16T19:18:00Z"
  },
  {
    "title": "Apple's tech tariff exemption had one shocking supporter",
    "description": "Political commentator Bill Maher became a topic of conversation after he reported on his recent trip to the White House to meet with President Donald Trump.\nMaher, who was Kid Rock's plus-one during this visit, has been viciously critical of Trump in the past…",
    "link": "https://biztoc.com/x/57f7fa47ebe1031c",
    "timestamp": "2025-04-16T19:17:39Z"
  },
  {
    "title": "UK officials label trade documents ‘secret’ to shield from US eyes amid Trump tariff war",
    "description": "civil servants beef up security rules for sensitive negotiating papers over fears posed by hostile US trade policy\nUK officials are tightening security when handling sensitive trade documents to prevent them from falling into US hands amid Donald Trump’s tari…",
    "link": "https://biztoc.com/x/a178a4fae2e3b3e7",
    "timestamp": "2025-04-16T19:17:26Z"
  },
  {
    "title": "White House starting new media policy sharply curtailing wire service access",
    "description": "The White House has put forward a new media policy that sharply curtails access to Donald Trump by the news agencies that serve media outlets around the world.",
    "link": "https://biztoc.com/x/2cc5321e52068eae",
    "timestamp": "2025-04-16T19:17:21Z"
  },
  {
    "title": "Temu slashes U.S. ad spending, plummets in App Store rankings after Trump China tariffs",
    "description": "Chinese online retailer Temu, whose “Shop like a billionaire” marketing campaign made its way to last year’s Super Bowl, has dramatically slashed its online ad spending in the U.S. and seen its ranking in Apple’s App Store plunge following President Donald Tr…",
    "link": "https://biztoc.com/x/bbee74d7ce43b6c9",
    "timestamp": "2025-04-16T19:17:16Z"
  },
  {
    "title": "France helped Zelensky write apology letter to Trump – Politico",
    "description": "British, French and German diplomats have reportedly been looking for ways to help Kiev restore relations with the US, the outlet claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615859-france-zelensky-apology-letter-trump/",
    "timestamp": "2025-04-16T19:16:41Z"
  },
  {
    "title": "The Democratic Civil War Is Escalating",
    "description": "David Hogg, the vice chair of the Democratic National Committee, plans to spend $20 million to oust Democratic incumbents.",
    "link": "https://www.newsweek.com/democratic-civil-war-david-hogg-incumbent-primaries-2060649",
    "timestamp": "2025-04-16T19:16:35Z"
  },
  {
    "title": "The tobacco industry could be the beneficiary of health agency cuts",
    "description": "Anti-tobacco initiatives could be up in smoke",
    "link": "https://theweek.com/health/tobacco-industry-health-agency-cuts",
    "timestamp": "2025-04-16T19:15:30Z"
  },
  {
    "title": "Federal Judge Says There Is 'Probable Cause' to Hold Trump Officials in 'Criminal Contempt'",
    "description": "Chief Judge James Boasberg of the U.S. District Court in Washington, D.C. said Wednesday that he has given the Trump administration \"ample opportunity to rectify or explain\" why it violated his order last month to stop planes flying hundreds of Venezuelan mig…",
    "link": "https://www.commondreams.org/news/trump-in-contempt",
    "timestamp": "2025-04-16T19:14:26Z"
  },
  {
    "title": "Fed Chair Issues Grim Warning About Consequences of Trump’s Tariffs",
    "description": "Federal Reserve Chair Jerome Powell warned Wednesday that Donald Trump’s sweeping reciprocal tariff policy would likely raise inflation, despite the president’s many promises to lower prices upon entering office. \r\n“The level of tariff increases announced so …",
    "link": "https://newrepublic.com/post/194072/federal-reserve-jerome-powell-warning-consequences-donald-trump-tariffs",
    "timestamp": "2025-04-16T19:14:22Z"
  },
  {
    "title": "Israeli military anounces seizure of 30% of Gaza as territory compared to 'mass grave'",
    "description": "Today, MSF said Israel’s siege had turned Gaza into “a mass grave of Palestinians”.",
    "link": "https://www.thejournal.ie/israel-military-anounces-seizure-of-30-of-gaza-as-territory-compared-to-mass-grave-6680189-Apr2025/",
    "timestamp": "2025-04-16T19:13:58Z"
  },
  {
    "title": "Trump administration under fire again over repeated court order violations — Here's how it compares to past cases",
    "description": "The Trump administration is under legal fire for repeatedly violating federal court orders, most recently over deportations carried out despite a judicial halt. At least six such clashes have occurred, raising alarm over the balance of power and judicial auth…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-under-fire-again-over-repeated-court-order-violations-heres-how-it-compares-to-past-cases/articleshow/120355971.cms",
    "timestamp": "2025-04-16T19:12:27Z"
  },
  {
    "title": "‘Daily Show’ host mocks MSNBC’s O’Donnell for ‘pretending to be embarrassed’ about going to Harvard",
    "description": "\"The Daily Show\" co-host Ronny Chieng mocked MSNBC host Lawrence O'Donnell after he seemed to be bragging about attending Harvard University.",
    "link": "https://www.foxnews.com/media/daily-show-mocks-msnbcs-odonnell-pretending-embarrassed-going-harvard",
    "timestamp": "2025-04-16T19:11:10Z"
  },
  {
    "title": "Blake Lively Named One of the 100 Most Influential People By Time Magazine",
    "description": "Reading Time: 3 minutesBlake Lively received an unexpected honor today.\nBlake Lively Named One of the 100 Most Influential People By Time Magazine was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/04/blake-lively-named-one-of-the-100-most-influential-people-by-time-magazine/",
    "timestamp": "2025-04-16T19:11:00Z"
  },
  {
    "title": "Marco Rubio's 'utter nonsense' ripped to pieces by right-wing legal analyst",
    "description": "Andrew McCarthy, a legal analyst for the National Review\r\n, is criticizing Secretary of State Marco Rubio for his ‘disingenuous’ explanation for the deportation Kilmar Abrego Garcia. The 29-year-old Maryland man was mistakenly deported to El Salvador last mon…",
    "link": "https://www.rawstory.com/marco-rubio-2671784847/",
    "timestamp": "2025-04-16T19:10:44Z"
  },
  {
    "title": "WATCH: Do Americans regret voting for Trump? Here are the facts",
    "description": "CNN poll-master offers raw data after speculation about ballot-box regret",
    "link": "https://www.wnd.com/2025/04/watch-do-americans-regret-voting-for-trump-here-are-the-facts/",
    "timestamp": "2025-04-16T19:09:29Z"
  },
  {
    "title": "Gold Hits All-Time High At Rs 98,100, Silver Jumps Rs 1,900",
    "description": "Gold prices soared by Rs 1,650 to hit an all-time high of Rs 98,100 per 10 grams in the national capital on Wednesday amid a global rush for the safe-haven asset triggered by an escalated trade war between the US and China.",
    "link": "https://www.ndtv.com/india-news/gold-hits-all-time-high-at-rs-98-100-silver-jumps-rs-1-900-8182431",
    "timestamp": "2025-04-16T19:08:01Z"
  },
  {
    "title": "'Radical Transparency': Trump Administration Provides Drone Updates",
    "description": "Transportation Secretary Sean Duffy provided an update on upcoming drone activity, contrasting the Trump administration's \"radical transparency\" with the lack of it from the previous administration.\nThe post ‘Radical Transparency’: Trump Administration Provid…",
    "link": "https://www.breitbart.com/politics/2025/04/16/radical-transparency-trump-administration-provides-drone-updates/",
    "timestamp": "2025-04-16T19:07:39Z"
  },
  {
    "title": "A judge found probable cause to hold the administration in criminal contempt. A Trump pardon would make it all go away",
    "description": "President Donald Trump announced new tariffs in an executive order.\n/Alex Brandon\nJudge James Boasberg found probable cause for contempt in the administration's deportation actions.\nTrump's pardon powers could spare his officials and lawyers from potential cr…",
    "link": "https://biztoc.com/x/e8b5ec2eeb4213f4",
    "timestamp": "2025-04-16T19:06:33Z"
  },
  {
    "title": "‘It’s going to be the small stuff’: Trump’s tariffs could make cheap tech gadgets not so cheap",
    "description": "Those shopping for a new smartphone or computer may be spared from tariff-induced sticker shock. At least, for now.\nPresident Donald Trump issued a memorandum on April 11 saying certain electronics — including computers, smartphones and some components — won’…",
    "link": "https://biztoc.com/x/7b1fd19d072f16f4",
    "timestamp": "2025-04-16T19:06:29Z"
  },
  {
    "title": "NAACP sues U.S. Education Department over DEI school funding cuts",
    "description": "The NAACP sued the U.S.",
    "link": "https://www.nbcnews.com/news/nbcblk/naacp-sues-us-education-department-dei-school-funding-cuts-rcna201618",
    "timestamp": "2025-04-16T19:05:58Z"
  },
  {
    "title": "‘You Don’t Like Bullshit Barbie?’ Trump Spox Karoline Leavitt Jeered At Jim Acosta Town Hall",
    "description": "Trump spox Karoline Leavitt was jeered by the crowd at a Jim Acosta town hall event, prompting Michael Cohen to crack \"You don't like Bullshit Barbie?\"\nThe post ‘You Don’t Like Bullshit Barbie?’ Trump Spox Karoline Leavitt Jeered At Jim Acosta Town Hall first…",
    "link": "https://www.mediaite.com/news/you-dont-like-bullshit-barbie-trump-spox-karoline-leavitt-jeered-at-jim-acosta-town-hall/",
    "timestamp": "2025-04-16T19:05:50Z"
  },
  {
    "title": "Sam Bankman-Fried's latest California prison once housed Al Capone",
    "description": "Former FTX CEO Sam “SBF” Bankman-Fried has moved from a transit facility to a California prison that once housed infamous gangster Al Capone.According to the Federal Bureau of Prisons website, officials moved Bankman-Fried from the Federal Transfer Center in …",
    "link": "https://cointelegraph.com/news/sam-bankman-fried-california-prison-al-capone",
    "timestamp": "2025-04-16T19:04:52Z"
  },
  {
    "title": "Fed Chair Jerome Powell says tariffs are 'highly likely' to fuel more inflation",
    "description": "Federal Reserve Chair Jerome Powell said Wednesday that he expects President Donald Trump’s tariffs to lead to further inflation.Read more...",
    "link": "https://qz.com/jerome-powell-fed-chair-tariffs-more-inflation-1851776449",
    "timestamp": "2025-04-16T19:04:00Z"
  },
  {
    "title": "The global trade war will badly hurt the US and global economies, WTO says | CNN Business",
    "description": "President Donald Trump’s global trade war will hurt economies around the world this year, including the US, according to a new report by the World Trade Organization.",
    "link": "https://www.cnn.com/2025/04/16/business/tariffs-wto-global-trade-economy-intl/index.html",
    "timestamp": "2025-04-16T19:03:38Z"
  },
  {
    "title": "US issues new sanctions targeting Chinese importers of Iranian oil",
    "description": "WASHINGTON: The United States on Wednesday (Apr 16) issued new sanctions targeting Iran's oil exports, including against a China-based \"teapot\" oil refinery, as President Donald Trump's",
    "link": "https://www.channelnewsasia.com/world/us-issues-new-sanctions-targeting-chinese-importers-iranian-oil-5070196",
    "timestamp": "2025-04-16T19:03:26Z"
  },
  {
    "title": "A judge found probable cause to hold the administration in criminal contempt. A Trump pardon would make it all go away.",
    "description": "Sure, a judge found cause to hold the administration in criminal contempt. But  a Trump pardon would void any real consequences.",
    "link": "https://www.businessinsider.com/trump-pardon-federal-judge-holds-administration-criminal-contempt-el-salvador-2025-4",
    "timestamp": "2025-04-16T19:03:09Z"
  },
  {
    "title": "Temu slashes U.S. ad spending, plummets in App Store rankings after Trump China tariffs",
    "description": "Chinese online retailer Temu, whose “Shop like a billionaire” marketing campaign made its way to last year’s Super Bowl, has dramatically slashed its online ad spending in the U.S. and seen its ranking in Apple’s App Store plunge following President Donald Tr…",
    "link": "https://www.nbcnews.com/business/business-news/temu-slashes-us-ad-spending-plummets-app-store-rankings-trump-china-ta-rcna201616",
    "timestamp": "2025-04-16T19:02:19Z"
  },
  {
    "title": "White House starting new media policy sharply curtailing wire service access",
    "description": "The White House has put forward a new media policy that sharply curtails access to Donald Trump by the news agencies that serve media outlets around the world.",
    "link": "https://www.pbs.org/newshour/politics/white-house-starting-new-media-policy-sharply-curtailing-wire-service-access",
    "timestamp": "2025-04-16T19:02:19Z"
  },
  {
    "title": "DAVID BOSSIE: DOGE Is Ending The ‘Eternal Life’ Of Government",
    "description": "In his 1964 “A Time For Choosing” speech, Ronald Reagan famously said, “a government bureau is the nearest thing to eternal life we’ll ever see on this earth.” And for more than 60 years, President Reagan’s words have proven to be true. However, with the hist…",
    "link": "https://dailycaller.com/2025/04/16/david-bossie-doge-is-ending-the-eternal-life-of-government/",
    "timestamp": "2025-04-16T19:02:18Z"
  },
  {
    "title": "Fed Chair Powell sounds alarm on tariffs, sending stocks lower",
    "description": "Trump's tariffs are \"highly likely\" to cause higher inflation, Powell said.",
    "link": "https://abcnews.go.com/Business/fed-chair-powell-sounds-alarm-tariffs-sending-stocks/story?id=120863770",
    "timestamp": "2025-04-16T19:01:45Z"
  },
  {
    "title": "Biden to Americans: Be Very Afraid … of Cutting Fraud Out of Social Security",
    "description": "Biden: \"They’re taking a hatchet to the Social Security Administration. ... Who in the hell do they think they are?\"\nThe post Biden to Americans: Be Very Afraid … of Cutting Fraud Out of Social Security first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/biden-to-americans-be-very-afraid-of-cutting-fraud-out-of-social-security/",
    "timestamp": "2025-04-16T19:00:58Z"
  },
  {
    "title": "Michigan Dentist Sues Gov Gretchen Whitmer's Administration Over Mandatory 'Implicit Bias Training'",
    "description": "Michigan dentist Kent Wildern has filed a lawsuit against Democratic governor Gretchen Whitmer's administration, challenging the state's mandate requiring health care professionals to complete ideological training to keep their licenses.\nThe post Michigan Den…",
    "link": "https://freebeacon.com/latest-news/michigan-dentist-sues-gov-gretchen-whitmers-administration-over-mandatory-implicit-bias-training/",
    "timestamp": "2025-04-16T19:00:57Z"
  },
  {
    "title": "Iran confirms next round of nuclear talks with US set for Rome on Saturday",
    "description": "The announcement comes as IAEA chief arrives in Tehran for talks that may revolve around accessibility for inspectors.",
    "link": "https://www.aljazeera.com/news/2025/4/16/iran-confirms-next-round-of-nuclear-talks-with-us-set-for-rome-on-saturday",
    "timestamp": "2025-04-16T19:00:38Z"
  },
  {
    "title": "Penniless Ukraine asked to pay $100 billion to Donald Trump in exchange for U.S war aid",
    "description": "Ukraine is facing a demand from the United States to repay the military aid it received during the conflict with Russia. Donald Trump has reduced his demand to $100 billion. This is tied to a potential agreement where the US would gain access to Ukraine's min…",
    "link": "https://economictimes.indiatimes.com/news/international/us/penniless-ukraine-asked-to-pay-100-billion-to-donald-trump-in-exchange-for-u-s-war-aid/articleshow/120354910.cms",
    "timestamp": "2025-04-16T19:00:36Z"
  },
  {
    "title": "Trump’s Tariffs Could Hit You in an Unexpected Place: Your Vinyl Collection",
    "description": "Volatility and anti-American resentment are already hurting the niche vinyl industry, but a little-known law could help it survive.",
    "link": "https://www.wired.com/story/trumps-tariffs-could-hit-you-in-an-unexpected-place-your-vinyl-collection/",
    "timestamp": "2025-04-16T19:00:23Z"
  },
  {
    "title": "US Ally Boosts Military Spending After Pressure From Trump",
    "description": "Japan aims to boost its defense budget to 2 percent of GDP by fiscal year 2027.",
    "link": "https://www.newsweek.com/japan-defense-budget-hike-us-trump-support-2060522",
    "timestamp": "2025-04-16T19:00:19Z"
  },
  {
    "title": "Japanese Man Sentenced for Illegally Modifying 2nd-Hand Nintendo Switch Units",
    "description": "Transport worker Fumihiri Otobe given 3-year suspended sentence, 500,000 yen fine",
    "link": "https://www.animenewsnetwork.com/news/2025-04-16/japanese-man-sentenced-for-illegally-modifying-2nd-hand-nintendo-switch-units/.223571",
    "timestamp": "2025-04-16T19:00:00Z"
  },
  {
    "title": "Trump Admin Halts New York Offshore Wind Project, Orders Review of All Existing Biden-Era Wind Permits",
    "description": "The Trump administration on Wednesday took action to halt construction of a massive offshore wind project being built in federal waters off the coast of New York and ordered a sprawling review of existing offshore wind permits, the Washington Free Beacon has …",
    "link": "https://freebeacon.com/energy/trump-admin-halts-new-york-offshore-wind-project-orders-review-of-all-existing-biden-era-wind-permits/",
    "timestamp": "2025-04-16T18:55:45Z"
  },
  {
    "title": "Texas County Refuses To Sell Excess Water: 'The New Oil'",
    "description": "Killeen City Council decided against selling its excess water.",
    "link": "https://www.newsweek.com/texas-county-excess-water-2060523",
    "timestamp": "2025-04-16T18:55:28Z"
  },
  {
    "title": "The Trump administration’s intensifying feud with Maine arrives in court",
    "description": "A month into Donald Trump’s second term, the president hosted a White House event for the National Governors Association, which quite didn’t go as planned. The Republican picked a fight with Maine’s Democratic governor, Janet Mills, over transgender student a…",
    "link": "https://biztoc.com/x/0623e82dd74567f4",
    "timestamp": "2025-04-16T18:55:16Z"
  },
  {
    "title": "US, China hold different playbooks for trade negotiations",
    "description": "The News\nThe US and China appear to have diverging playbooks for tariff negotiations as their escalating trade war threatens to upend the global economy.\nBeijing indicated it was open to talks with Washington, but wants US President Donald Trump to first show…",
    "link": "https://biztoc.com/x/7d61b461d8e7c6e1",
    "timestamp": "2025-04-16T18:55:15Z"
  },
  {
    "title": "US wants UK to ditch ‘hate speech’ laws to secure trade deal – media",
    "description": "Washington and London are currently negotiating a tariff agreement Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615860-us-uk-free-speech-deal/",
    "timestamp": "2025-04-16T18:54:59Z"
  },
  {
    "title": "Bitcoin Stumbles as Investors Fear Fed Chair Powell Is Slow to React on Rate Cuts",
    "description": "The U.S. central bank has been monitoring the impact of Trump’s trade war on the labor market and consumer prices.",
    "link": "https://decrypt.co/315143/bitcoin-stumbles-investors-fear-powell-slow-on-rate-cuts",
    "timestamp": "2025-04-16T18:54:46Z"
  },
  {
    "title": "CBP says latest tariffs have generated $500 million, well below Trump's estimate",
    "description": "U.S. Customs and Border Protection appears to be contradicting President Donald Trump’s comments on the daily revenue generated by his latest slate of tariffs.",
    "link": "https://www.nbcnews.com/business/economy/cbp-says-latest-tariffs-generated-500-million-well-trumps-estimate-rcna201612",
    "timestamp": "2025-04-16T18:53:46Z"
  },
  {
    "title": "In unprecedented move, DNC official to spend big to take down fellow Democrats",
    "description": "David Hogg, a controversial Democratic National Committee vice chair, is pledging to upend Democratic primaries by funding candidates who will challenge “ineffective, asleep-at-the-wheel” Democrats. The move puts Hogg, the now 25-year-old who first gained nat…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311412/posts",
    "timestamp": "2025-04-16T18:53:09Z"
  },
  {
    "title": "Fed’s Powell: Trump tariffs could raise prices, slow growth",
    "description": "US markets fell, with Nasdaq down 3.4% after Powell's remarks.",
    "link": "https://www.nzherald.co.nz/world/feds-powell-trump-tariffs-could-raise-prices-slow-growth/7C72GZSWHBEKLLPU6NT7YOYRGI/",
    "timestamp": "2025-04-16T18:52:14Z"
  },
  {
    "title": "‘I’m Not Doing Green’: Transportation Secretary Defends Pulling EV Stations Out of Infrastructure Projects After Trump Pushes Tesla Sales",
    "description": "Sean Duffy called the inclusion of EV charging stations \"social justice\" while defending his decision to pull them from infrastructure projects.\nThe post ‘I’m Not Doing Green’: Transportation Secretary Defends Pulling EV Stations Out of Infrastructure Project…",
    "link": "https://www.mediaite.com/tv/im-not-doing-green-transportation-secretary-defends-pulling-ev-stations-out-of-infrastructure-projects-after-trump-pushes-tesla-sales/",
    "timestamp": "2025-04-16T18:50:59Z"
  },
  {
    "title": "Nissan aims to 'max out' U.S. production plant amid Trump's tariffs",
    "description": "Nissan 6-million-square-foot facility in Smyrna, Tennessee, is capable of producing 640,000 vehicles a year on three shifts, Meunier said.",
    "link": "https://www.cnbc.com/2025/04/16/nissan-us-production-plant-trump-tariffs.html",
    "timestamp": "2025-04-16T18:50:00Z"
  },
  {
    "title": "Travelling to the US? Immigration lawyers suggest using a burner phone",
    "description": "Immigration lawyers provide advice on US travel, as border security officials conduct 'enhanced vetting' of travellers with broad powers to refuse any visa holder entry.",
    "link": "https://www.abc.net.au/news/2025-04-17/us-border-security-australian-traveller-tips-detained-deported/105136846",
    "timestamp": "2025-04-16T18:48:35Z"
  },
  {
    "title": "Marco Rubio warns propaganda machines have to be unplugged and taken down",
    "description": "'The American people don't need an obscure agency to 'protect' them from lies'",
    "link": "https://www.wnd.com/2025/04/marco-rubio-warns-propaganda-machines-have-to-be-unplugged-and-taken-down/",
    "timestamp": "2025-04-16T18:47:09Z"
  },
  {
    "title": "California will sue to stop Trump from imposing sweeping tariffs: \"No other state will be more impacted\"",
    "description": "California is filing a lawsuit to challenge President Donald Trump's tariffs, Democratic Gov. Gavin Newsom announced.",
    "link": "https://www.cbsnews.com/sacramento/news/california-gov-gavin-newsom-trump-tariffs-lawsuit/",
    "timestamp": "2025-04-16T18:46:51Z"
  },
  {
    "title": "Trump's Expanded Domestic Military Use Should Worry Us All",
    "description": "There’s growing concern that President Donald Trump might invoke the Insurrection Act to bring National Guard troops under federal control and deploy them within the U.S. This speculation may be partly because one of President Trump’s Inauguration Day executi…",
    "link": "https://www.aclu.org/news/national-security/trumps-expanded-domestic-military-use-should-worry-us-all",
    "timestamp": "2025-04-16T18:46:47Z"
  },
  {
    "title": "GOP Rep. Elise Stefanik is considering a run for governor of New York",
    "description": "Rep. Elise Stefanik, a member of House Republican leadership and onetime nominee for U.S. ambassador to the United Nations, is considering a run for New York governor, according to a person close to her",
    "link": "https://abcnews.go.com/Politics/wireStory/gop-rep-elise-stefanik-run-governor-new-york-120877852",
    "timestamp": "2025-04-16T18:46:30Z"
  }
]