[
  {
    "title": "Judge Says Trump Admin Is Violating Order to Halt Funding Freeze",
    "description": "U.S. District Judge John McConnell Jr. on Monday demanded that the Trump administration comply with his earlier order to halt a freeze on federal funding that's being challenged in multiple court cases.\n\nMcConnell, appointed to the U.S. District Court for the…",
    "link": "https://www.commondreams.org/news/freeze-funds",
    "timestamp": "2025-02-10T23:27:52Z"
  },
  {
    "title": "Kendrick Lamar and the Messy Art of Meta-Performance",
    "description": "Doreen St. Felix on Kendrick Lamar’s Super Bowl LIX halftime show, best described as “existential.”",
    "link": "https://www.newyorker.com/culture/critics-notebook/kendrick-lamar-and-the-messy-art-of-meta-performance",
    "timestamp": "2025-02-10T23:27:18Z"
  },
  {
    "title": "US President Donald Trump signs executive orders on steel, aluminium tariffs",
    "description": "Trump has stepped up a long-promised trade war despite warnings from Europe and China.",
    "link": "https://www.nzherald.co.nz/business/us-president-donald-trump-signs-executive-orders-on-steel-aluminium-tariffs/7BWNJAMZ25F6JH2EKVYPXUT4NY/",
    "timestamp": "2025-02-10T23:27:16Z"
  },
  {
    "title": "What Will DOGE’s Moves on Government Agencies Mean for OSHA?",
    "description": "Eyal Press on the unions trying to keep Elon Musk’s DOGE initiative out of the Labor Department, and what the future of OSHA could look like under Trump",
    "link": "https://www.newyorker.com/news/the-lede/what-will-doges-moves-on-government-agencies-mean-for-osha",
    "timestamp": "2025-02-10T23:26:33Z"
  },
  {
    "title": "2 US deportation flights head to Venezuela, alleged gang members aboard",
    "description": "Two planes carrying Venezuelan migrants deported from the United States — the first since a January deal between the administration of U.S. President Donald Trump and Venezuelan President Nicolas Maduro — are heading to Venezuela, the South American country's…",
    "link": "https://www.voanews.com/a/us-deportation-flights-head-to-venezuela-alleged-gang-members-aboard/7970003.html",
    "timestamp": "2025-02-10T23:26:24Z"
  },
  {
    "title": "HIV infections could jump over 6 times if US support dropped, not replaced: UNAIDS chief",
    "description": "LONDON, Feb 10: The head of the UN AIDS agency said on Monday the number of new HIV infections could jump more than six times by 2029 if American support of the biggest AIDS programme is dropped, warning that millions of people could die and more resistant st…",
    "link": "https://thehillstimes.in/international/hiv-infections-could-jump-over-6-times-if-us-support-dropped-not-replaced-unaids-chief",
    "timestamp": "2025-02-10T23:25:00Z"
  },
  {
    "title": "The Left Thinks Losing Power Is Equivalent to ‘Authoritarianism’",
    "description": "If you listen to the Left’s elite opinion makers, you might think that the Trump administration’s current large-scale attempt to reform and reduce the scope of... Read More\nThe post The Left Thinks Losing Power Is Equivalent to ‘Authoritarianism’ appeared fir…",
    "link": "https://www.dailysignal.com/2025/02/10/left-thinks-losing-power-is-equivalent-authoritarianism/",
    "timestamp": "2025-02-10T23:24:39Z"
  },
  {
    "title": "California joins other 21 other states in suing Trump administration over cuts to key federal research funds",
    "description": "The funds, known as “indirect costs,” help universities maintain expensive labs and other infrastructure. Trump’s administration seeks to cut that funding by roughly half the current amount.",
    "link": "https://www.kpbs.org/news/education/2025/02/10/california-joins-other-21-other-states-in-suing-trump-administration-over-cuts-to-key-federal-research-funds",
    "timestamp": "2025-02-10T23:24:33Z"
  },
  {
    "title": "Judge blocks Trump administration’s cuts to key federal research funds",
    "description": "The funds, known as “indirect costs,” help universities maintain expensive labs and other infrastructure. Trump’s administration seeks to cut that funding by roughly half the current amount.",
    "link": "https://www.kpbs.org/news/education/2025/02/10/judge-blocks-trump-administrations-cuts-to-key-federal-research-funds",
    "timestamp": "2025-02-10T23:24:33Z"
  },
  {
    "title": "A Tech Power Playbook for Donald Trump 2.0",
    "description": "In coming years, the pace of technological innovation and deployment will only quicken. The new administration will need a systematic and sustained approach. On January 20, Donald J. Trump entered office as our nation’s forty-seventh chief executive. With his…",
    "link": "https://nationalinterest.org/blog/techland/a-tech-power-playbook-for-donald-trump-2-0/",
    "timestamp": "2025-02-10T23:23:41Z"
  },
  {
    "title": "Trump moves ahead with 25% tariffs on all steel and aluminum imports, escalating trade tensions",
    "description": "US President Donald Trump is escalating his trade war.\nAnna Moneymaker/Getty Images\nThe White House announced 25% tariffs on all steel and aluminum imports.\nThe US is the world's top steel importer, sourcing mainly from Canada, Mexico, and Brazil.\nHigher tari…",
    "link": "https://biztoc.com/x/82bfdeea4b397d95",
    "timestamp": "2025-02-10T23:22:09Z"
  },
  {
    "title": "Donald Trump signs off on 25% steel and aluminum tariffs",
    "description": "President Donald Trump on Monday removed the exceptions and exemptions from his 2018 tariffs on steel, meaning that all steel imports will be taxed at a minimum of 25%. Trump also hiked his 2018 aluminum tariffs to 25% from 10%.\n“We were being pummeled by bot…",
    "link": "https://biztoc.com/x/f10474a34c58884e",
    "timestamp": "2025-02-10T23:22:04Z"
  },
  {
    "title": "Kanye West Deactivates X Account Following Wild Posting Frenzy, Thanks the Public for 'Participating In This Social Experiment'",
    "description": "Rapper and fashion mogul Kanye West deactivated his X account on Sunday following a three-day long posting spree.\nThe post Kanye West Deactivates X Account Following Wild Posting Frenzy, Thanks the Public for ‘Participating In This Social Experiment’ appeared…",
    "link": "https://www.breitbart.com/entertainment/2025/02/10/kanye-west-deactivates-x-account-following-wild-posting-frenzy-thanks-the-public-for-participating-in-this-social-experiment/",
    "timestamp": "2025-02-10T23:22:00Z"
  },
  {
    "title": "Trump dismisses US ethics chief",
    "description": "United States President Donald Trump has removed David Huitema as director of the US Office of Government Ethics before completing his five-year term but, the agency announced.\nHuitema, nominated by ...",
    "link": "https://biztoc.com/x/69f30bb02746d477",
    "timestamp": "2025-02-10T23:21:59Z"
  },
  {
    "title": "Trump sets 25% tariffs on steel, aluminum, heightening trade war",
    "description": "President Donald Trump ordered a 25% tariff on steel and aluminum imports, escalating his efforts to protect politically important U.S. industries with levies hitting some of the country’s closest allies.\nThe tariffs will apply widely to all U.S. imports of s…",
    "link": "https://biztoc.com/x/2d2ae31226ad1281",
    "timestamp": "2025-02-10T23:21:57Z"
  },
  {
    "title": "Trump warns Hamas ‘all hell is going to break loose’ if hostages aren’t freed by noon Saturday",
    "description": "Hamas announced earlier Monday it was scrapping a scheduled hostage release, arguing that Israel had not lived up to its side of the deal.",
    "link": "https://nypost.com/2025/02/10/us-news/trump-warns-hamas-all-hell-is-going-to-break-loose-if-hostages-arent-freed-by-noon-saturday/",
    "timestamp": "2025-02-10T23:21:50Z"
  },
  {
    "title": "Super Bowl protester calls on Trump to act with compassion and empathy for Palestinians",
    "description": "The man who pulled out a Sudanese and Palestinian flag during Kendrick Lamar's halftime show said he felt compelled to use his moment in the Super Bowl to \"highlight the human suffering.\"",
    "link": "https://www.nbcnews.com/news/us-news/super-bowl-protester-hopes-trump-compassion-empathy-palestinians-rcna191576",
    "timestamp": "2025-02-10T23:20:57Z"
  },
  {
    "title": "Eagles captain Lane Johnson says it will be 'team decision' to go to White House if Trump extends invite",
    "description": "The Philadelphia Eagles have won Super Bowl LIX, which begs the question: Will President Donald Trump extend an invitation to the White House after what happened in 2018?",
    "link": "https://www.foxnews.com/sports/eagles-captain-lane-johnson-says-team-decision-go-white-house-trump-extends-invite",
    "timestamp": "2025-02-10T23:20:56Z"
  },
  {
    "title": "Trump announces 25% tariffs on foreign steel and aluminum - NewsBreak",
    "description": "Modified US duties will be enforced ‘without exceptions’, said president, in controversial bid to boost economy",
    "link": "https://www.newsbreak.com/share/3800873386162-trump-announces-25-tariffs-on-foreign-steel-and-aluminum?_f=app_share&amp;pd=0GCQabjm&amp;lang=en_US&amp;send_time=1739229623&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v7&amp;s=i2",
    "timestamp": "2025-02-10T23:20:48Z"
  },
  {
    "title": "Rod Blagojevich Pardoned on Corruption Conviction by Trump (Skylar Woodhouse/Bloomberg)",
    "description": "Skylar Woodhouse / Bloomberg:\nRod Blagojevich Pardoned on Corruption Conviction by Trump  —  President Donald Trump pardoned Former Illinois Governor Rod Blagojevich for his corruption conviction, five years after commuting his prison sentence.  —  Blagojevic…",
    "link": "https://www.memeorandum.com/250210/p122",
    "timestamp": "2025-02-10T23:20:01Z"
  },
  {
    "title": "Latest to Draw DOGE Scrutiny: Consumer Financial Protection Bureau",
    "description": "In its latest frontal attack on the federal bureaucracy, the Trump administration is moving to drastically downsize the Consumer Financial Protection Bureau. The agency, created... Read More\nThe post Latest to Draw DOGE Scrutiny: Consumer Financial Protection…",
    "link": "https://www.dailysignal.com/2025/02/10/latest-get-doge-scrutiny-consumer-financial-protection-bureau/",
    "timestamp": "2025-02-10T23:19:46Z"
  },
  {
    "title": "Trump sets 25% tariffs on steel, aluminum as trade war grows",
    "description": "The president said the effort would bolster domestic production and return jobs to the U.S., warning that the rate “may go higher.” Read on.",
    "link": "https://financialpost.com/news/trump-sets-25-tariffs-on-steel-aluminum-as-trade-war-grows",
    "timestamp": "2025-02-10T23:19:45Z"
  },
  {
    "title": "Trump Sets 25% Tariffs on Steel, Aluminum as Trade War Grows",
    "description": "President Donald Trump ordered a 25% tariff on steel and aluminum imports, escalating his efforts to protect politically important US industries with levies hitting some of the country’s closest allies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-sets-25-tariffs-on-steel-aluminum-as-trade-war-grows",
    "timestamp": "2025-02-10T23:19:45Z"
  },
  {
    "title": "Trump imposes 25% tariffs on steel and aluminum | CNN Politics",
    "description": "President Donald Trump on Monday imposed a 25% tariff on all steel and aluminum imports into the United States with no exceptions or exemptions.",
    "link": "https://www.cnn.com/2025/02/10/politics/tariffs-steel-aluminum-trump/index.html",
    "timestamp": "2025-02-10T23:19:06Z"
  },
  {
    "title": "Asked If Vance Is His Successor, Trump Says ‘No!’",
    "description": "In an interview with Fox’s Brett Baier, Trump was asked if J.D. Vance is his successor, and he replied ‘No!’ Trump also equivocated, but his immediate rejection of the idea that J.D. is a cinch for 2028 should bother the veep a lot.",
    "link": "http://nymag.com/intelligencer/article/asked-if-vance-is-his-successor-trump-says-no.html",
    "timestamp": "2025-02-10T23:18:21Z"
  },
  {
    "title": "George Stephanopoulos is ‘miserable’ at ‘GMA’ after Trump apology — and speculation heats up over who could fill his anchor chair if he exits",
    "description": "“GMA” host George Stephanopoulos has been “miserable” after being forced to apologize following the President Trump fiasco — and staffers are already speculating about who might replace him, The Post has learned Stephanopoulos has been rumored to be on his wa…",
    "link": "https://freerepublic.com/focus/f-chat/4296550/posts",
    "timestamp": "2025-02-10T23:16:34Z"
  },
  {
    "title": "Trump’s Response When Asked if He Sees JD Vance as His Successor: ‘No’ | Video",
    "description": "\"But he's very capable,\" the president adds\nThe post Trump’s Response When Asked if He Sees JD Vance as His Successor: ‘No’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-jd-vance-no-endorsement/",
    "timestamp": "2025-02-10T23:16:27Z"
  },
  {
    "title": "Trump Raises Tariffs On Steel And Aluminum To 25%",
    "description": "President Donald Trump on Monday removed the exceptions and exemptions from his 2018 tariffs on steel.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-tariffs_n_67aa87ffe4b0ade4a9a38e4a",
    "timestamp": "2025-02-10T23:16:25Z"
  },
  {
    "title": "Deep State’s #1 puppeteer gets his security clearance yanked by President Trump…",
    "description": "one of the biggest schemes we’ve tracked is the Deep State’s shadow operations, orchestrated by one of the most influential puppeteers in the Swamp: Norm Eisen. If there’s a major effort to take down President Trump, Eisen is almost always lurking in the back…",
    "link": "https://freerepublic.com/focus/f-news/4296548/posts",
    "timestamp": "2025-02-10T23:15:57Z"
  },
  {
    "title": "Trump announces steel and aluminium import tariffs",
    "description": "The move threatens have a big impact in Canada, a major source of the metals in the US.",
    "link": "https://www.bbc.com/news/articles/c360dz384n5o",
    "timestamp": "2025-02-10T23:15:38Z"
  },
  {
    "title": "'Back to plastic': Trump pushes for plastic straws as he declares paper ones 'don’t work'",
    "description": "President Donald Trump is moving to reverse a federal push away from plastic straws, declaring that paper straws “don’t work.” Trump signed an executive order Monday. Trump has long railed against paper straws, and his 2019 reelection campaign sold Trump-bran…",
    "link": "https://www.seattlepi.com/business/article/back-to-plastic-trump-pushes-for-plastic-20159426.php",
    "timestamp": "2025-02-10T23:13:38Z"
  },
  {
    "title": "WATCH Tucker Carlson: U.S. colonel on how Donald Trump can end this war ‘killing the United States’",
    "description": "'The Ukrainian military is selling American weapons systems on the black market, including to drug cartels'",
    "link": "https://www.wnd.com/2025/02/watch-tucker-carlson-u-s-colonel-on-how-donald-trump-can-end-this-war-killing-the-united-states/",
    "timestamp": "2025-02-10T23:13:04Z"
  },
  {
    "title": "Super Bowl inspires bipartisan wager as Pennsylvania senators go 'all in for the birds'",
    "description": "Sens. Dave McCormick, R-Pa., and John Fetterman, D-Pa., put party politics aside to support the Philadelphia Eagles at SuperBowl LIX, trading in their partisan feud for a friendly wager with Sen. Roger Marshall, R-Kan.",
    "link": "https://www.foxnews.com/politics/super-bowl-inspires-bipartisan-wager-pennsylvania-senators-go-all-birds",
    "timestamp": "2025-02-10T23:12:40Z"
  },
  {
    "title": "White South Africans Are the Only Refugees Trump Welcomes",
    "description": "At the same time he’s slamming doors on refugees from ‘shithole countries,’ Trump is offering asylum to South Africa’s Afrikaners, a foreign white-identity group in the midst of a political fight over property. They’re not interested.",
    "link": "http://nymag.com/intelligencer/article/white-south-africans-trump.html",
    "timestamp": "2025-02-10T23:12:16Z"
  },
  {
    "title": "Trump moves ahead with 25% tariffs on all steel and aluminum imports, escalating trade tensions",
    "description": "Trump slapped tariffs on steel and aluminum in his first term, but with exemptions. Now, he's escalating and implementing 25% tariffs on all partners.",
    "link": "https://www.businessinsider.com/trump-25-tariffs-steel-aluminum-imports-2025-2",
    "timestamp": "2025-02-10T23:11:56Z"
  },
  {
    "title": "Trump moves to impose 25% tariffs on steel and aluminum imports",
    "description": "WASHINGTON -- U.S. President Donald Trump signed a proclamation on Monday substantially raising tariffs on imports of steel and aluminum, a White House official told Nikkei Asia.\nThe move increases tariffs on both metals to 25%, in the latest escalation of Tr…",
    "link": "https://biztoc.com/x/a7ac40a523f0fe75",
    "timestamp": "2025-02-10T23:11:22Z"
  },
  {
    "title": "Trump signs executive order imposing 25% tariffs on steel and aluminum, with no exemptions",
    "description": "President Donald Trump moved to substantially raise tariffs on steel and aluminum imports on Monday, cancelling exemptions and duty-free quotas for major suppliers Canada, Mexico, Brazil and other countries in a move that could boost the risk of a multi-front…",
    "link": "https://biztoc.com/x/dde89f67b205e704",
    "timestamp": "2025-02-10T23:11:21Z"
  },
  {
    "title": "The Geopolitics of Lithium in 2025",
    "description": "As China and Russia expand their lithium influence, the United States must rethink its policies to remain competitive in 2025. The new U.S. administration must rethink its entire lithium policy vis-a-vis other nations by focusing on the Western Hemisphere. Th…",
    "link": "https://nationalinterest.org/blog/energy-world/the-geopolitics-of-lithium-in-2025/",
    "timestamp": "2025-02-10T23:11:21Z"
  },
  {
    "title": "‘Disgraceful Manipulation’: Fox Accused of Covering Up Loud Boos for Donald Trump at the Super Bowl with Fake Crowd Cheers",
    "description": "In the before times, whenever there was a dispute about an event video was seen as the great arbiter. But as technology has progressed, doctoring",
    "link": "https://atlantablackstar.com/2025/02/10/audio-tracks-reveal-different-takes-on-fan-response-to-president-at-super-bowl-as-fox-accused-of-covering-up-boos/",
    "timestamp": "2025-02-10T23:11:09Z"
  },
  {
    "title": "Arab Countries Reject Trump's Gaza Plan, Egypt Minister Tells Marco Rubio",
    "description": "Egyptian Foreign Minister Badr Abdelatty told U.S. Secretary of State Marco Rubio on Monday that Arab states support Palestinians in rejecting U.S. President Donald Trump&#039;s plan to displace Palestinians in Gaza and take control of the enclave.",
    "link": "https://www.ndtv.com/world-news/arab-countries-reject-donald-trumps-gaza-plan-egypt-minister-tells-marco-rubio-7681945",
    "timestamp": "2025-02-10T23:11:05Z"
  },
  {
    "title": "Trump signs order imposing 25% steel and aluminum tariffs",
    "description": "President Donald Trump signed an order Monday that imposes a 25% tariff on all steel imports to the United States.\n“This is a big deal,\" Trump said while signing the order in the Oval Office. \"The beginning of making America rich again.\"\nThe tariffs come just…",
    "link": "https://biztoc.com/x/cd4a546c6ec23787",
    "timestamp": "2025-02-10T23:11:05Z"
  },
  {
    "title": "Trump: Let all hell break loose if hostages not returned",
    "description": "United States President Donald Trump stated that he would be in favor of canceling the Gaza ceasefire deal if all Israeli hostages held by Hamas were not released by Saturday, 12 pm, as per the origin...",
    "link": "https://biztoc.com/x/ff587e8f2c3dbbad",
    "timestamp": "2025-02-10T23:10:58Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks traded lower on Tuesday as investors digested cautious commentary from Federal Reserve Chairman Jerome Powell on interest rates.",
    "link": "https://www.cnbc.com/2025/02/10/stock-market-today-live-updates.html",
    "timestamp": "2025-02-10T23:10:54Z"
  },
  {
    "title": "Trump expected to order a crackdown on D.C. crime, homeless encampments (Washington Post)",
    "description": "Washington Post:\nTrump expected to order a crackdown on D.C. crime, homeless encampments  —  The president campaigned against D.C. as a ‘nightmare of murder and crime.’ He is considering an order to crack down on petty crime and clear homeless encampments.  —…",
    "link": "https://www.memeorandum.com/250210/p121",
    "timestamp": "2025-02-10T23:10:00Z"
  },
  {
    "title": "House Dem Warns The Guardrails to Protect Judicial Rulings From Trump Have to Come From Inside The GOP",
    "description": "\"Ultimately, if our democracy is going to stand up for and beyond Donald Trump, it is going to have to come from within the Republican Party\"\nThe post House Dem Warns The Guardrails to Protect Judicial Rulings From Trump Have to Come From Inside The GOP first…",
    "link": "https://www.mediaite.com/politics/house-dem-warns-the-guardrails-to-protect-judicial-rulings-from-trump-have-to-come-from-inside-the-gop/",
    "timestamp": "2025-02-10T23:09:45Z"
  },
  {
    "title": "Virginia's research colleges brace for major cuts to federal grants",
    "description": "The Trump administration plans to reduce the indirect funding NIH provides to colleges such as VCU for research. Virginia Tech's president says \"Lives will be lost\" as a result/.",
    "link": "https://richmond.com/news/state-regional/government-politics/vcu-uva-virginia-tech-trump-medical-research/article_44b0c034-e7c9-11ef-bf90-7b83d05dac9b.html",
    "timestamp": "2025-02-10T23:09:00Z"
  },
  {
    "title": "Report: Trump Readies Pause of Enforcement of Foreign Corrupt Practices Act",
    "description": "President Donald Trump will direct Attorney General Pam Bondi to reestablish guidelines for enforcing the Foreign Corrupt Practices Act (FCPA), which bars Americans from bribing foreign officials, according to reports of a forthcoming executive order.\nThe pos…",
    "link": "https://www.breitbart.com/politics/2025/02/10/report-trump-readies-pause-of-enforcement-of-foreign-corrupt-practices-act/",
    "timestamp": "2025-02-10T23:08:49Z"
  },
  {
    "title": "Elon Musk Heads Group Trying To Buy Control Of OpenAI: Report",
    "description": "Elon Musk is leading an investment group offering $97.4 billion for the nonprofit that controls OpenAI, marking a new front in his war with the ChatGPT-maker, the Wall Street Journal reported Monday.",
    "link": "https://www.ibtimes.com/elon-musk-heads-group-trying-buy-control-openai-report-3763181",
    "timestamp": "2025-02-10T23:06:23Z"
  },
  {
    "title": "Missouri House panel approves plan to make transgender restrictions permanent",
    "description": "Lawmakers heard nearly eight hours of testimony by people opposed to restrictions on transgender medical procedures.",
    "link": "https://www.stltoday.com/news/local/government-politics/missouri-house-panel-approves-plan-to-make-transgender-restrictions-permanent/article_6edb8ee2-e7f7-11ef-81e3-5fc3e81b5e8e.html",
    "timestamp": "2025-02-10T23:06:00Z"
  },
  {
    "title": "Dominican Migrant Charged With Brutal Murder of Beloved Sandwich Shop Owner",
    "description": "Eric Dionida German-Pena, 25, entered the U.S. illegally in September 2022, officials said Monday.",
    "link": "https://www.newsweek.com/illegal-immigrant-murder-charge-massachusetts-sandwich-shop-owner-2029133",
    "timestamp": "2025-02-10T23:05:56Z"
  },
  {
    "title": "Trump Announces Fresh Round of Tariffs",
    "description": "“President Donald Trump signed executive orders on Monday imposing 25-percent tariffs on imported steel and aluminum, the latest salvo in his ongoing effort to overhaul the U.S. trading relationship with the rest of the world,”",
    "link": "https://politicalwire.com/2025/02/10/trump-announces-fresh-round-of-tariffs/",
    "timestamp": "2025-02-10T23:05:46Z"
  },
  {
    "title": "Trump’s Department of Homeland Security to deputize IRS agents for immigration enforcement",
    "description": "DHS Secretary Kristi Noem sent a letter to U.S. Treasury secretary Scott Bessent, asking that IRS agents be provided to assist with immigration and enforcement efforts.",
    "link": "https://www.foxnews.com/us/trumps-dhs-deputize-irs-agents-immigration-enforcement",
    "timestamp": "2025-02-10T23:04:08Z"
  },
  {
    "title": "Trump sets 25% tariffs on steel, aluminum, heightening trade war",
    "description": "The move would fulfill what the most extreme trade protectionists have sought for years.",
    "link": "https://www.japantimes.co.jp/business/2025/02/11/markets/trump-tariffs-steel-aluminum/",
    "timestamp": "2025-02-10T23:04:00Z"
  },
  {
    "title": "Dismantling the CFPB would turn the consumer finance world into the 'wild, wild west,' its former director says",
    "description": "Richard Cordray, the first director of the CFPB, told BI that Elon Musk's call to dismantle the agency is a 'direct conflict of interest.'",
    "link": "https://www.businessinsider.com/elon-musk-doge-cfpb-conflict-interest-concerns-x-financial-services-2025-2",
    "timestamp": "2025-02-10T23:03:37Z"
  },
  {
    "title": "Elon Musk heads group trying to buy control of OpenAI: report",
    "description": "Elon Musk is leading an investment group offering $97.4 billion for the nonprofit that controls OpenAI, marking a new front in his war with the ChatGPT-maker, the Wall Street Journal reported Monday. Musk attorney Marc Toberoff said he submitted the bid to Op…",
    "link": "https://www.digitaljournal.com/world/elon-musk-heads-group-trying-to-buy-control-of-openai-report/article",
    "timestamp": "2025-02-10T23:02:34Z"
  },
  {
    "title": "Government Asks Court to Vacate Order Blocking Access to Treasury’s Payment System",
    "description": "The President Donald Trump administration reportedly said in a Sunday (Feb. 9) court filing that a judge’s order blocking the Elon Musk-led Department of Government Efficiency (DOGE) from accessing Treasury Department payment systems also prevents Treasury Se…",
    "link": "https://www.pymnts.com/legal/2025/government-asks-court-vacate-order-blocking-access-treasury-payment-system/",
    "timestamp": "2025-02-10T23:00:46Z"
  },
  {
    "title": "Donald Trump to hit US steel and aluminium imports with 25% tariffs",
    "description": "Administration will grant no exclusions to any products, officials say, raising risk of trade war",
    "link": "https://biztoc.com/x/faae3ec26342baa6",
    "timestamp": "2025-02-10T23:00:22Z"
  },
  {
    "title": "Trump: I'd say cancel Gaza deal if hostages not returned",
    "description": "United States President Donald Trump stated that he would be in favor of canceling the Gaza ceasefire deal if all Israeli hostages held by Hamas were not released by Saturday, 12 pm, as per the origin...",
    "link": "https://biztoc.com/x/21eda861b33c753f",
    "timestamp": "2025-02-10T23:00:16Z"
  },
  {
    "title": "Trump pardons ex-Illinois Governor Blagojevich",
    "description": "United States President Donald Trump pardoned on Monday former Illinois Governor Rod Blagojevich, five years after shortening his 14-year-long sentence for political corruption charges.\nBlagojevich w...",
    "link": "https://biztoc.com/x/4b144c914d533060",
    "timestamp": "2025-02-10T23:00:15Z"
  },
  {
    "title": "'Back to plastic': Trump pushes for plastic straws as he declares paper ones 'don’t work'",
    "description": "President Donald Trump is moving to reverse a federal push away from plastic straws, declaring that paper straws “don’t work.”\nTrump signed an executive order Monday, saying: “It’s a ridiculous situation. We’re going back to plastic straws”\nThe move by Trump …",
    "link": "https://biztoc.com/x/54d424b5a87083f1",
    "timestamp": "2025-02-10T23:00:05Z"
  },
  {
    "title": "Aside from Trump tariffs, steel and aluminum have little in common",
    "description": "Steel and aluminum just seem to belong together, right?\nWe’ve been hearing that phrase — “steel and aluminum” — since 2018, during the first round of tariffs ordered by President Donald Trump. He proposed an updated version of the policy Monday. But the two m…",
    "link": "https://biztoc.com/x/377a9710c4d1bd8b",
    "timestamp": "2025-02-10T23:00:03Z"
  },
  {
    "title": "‘Israel must pay cost of rebuilding Gaza’",
    "description": "PUTRAJAYA: Israel must foot the nearly US$100bil (RM450bil) cost of rebuilding war-torn Gaza instead of trying to displace its people, says Turkish President Recep Tayyip Erdogan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/11/israel-must-pay-cost-of-rebuilding-gaza",
    "timestamp": "2025-02-10T23:00:00Z"
  },
  {
    "title": "EU Braces for Impact as Trump Targets Trade",
    "description": "European companies are trying to prepare for the fallout from President Donald Trump’s tariffs-first approach to trade policy as he finally finds the time to turn his attention to the EU after two quick wins with Canada and Mexico. Trump has threatened to sla…",
    "link": "https://oilprice.com/Energy/Energy-General/EU-Braces-for-Impact-as-Trump-Targets-Trade.html",
    "timestamp": "2025-02-10T23:00:00Z"
  },
  {
    "title": "Trump: If all hostages not released by Saturday, Gaza ceasefire should be canceled",
    "description": "\"If all the Gaza hostages aren't returned by Saturday at 12 p.m., I would say cancel the ceasefire. Let all hell break loose; Israel can override it,\" he said.",
    "link": "https://www.jpost.com/breaking-news/article-841568",
    "timestamp": "2025-02-10T22:59:30Z"
  },
  {
    "title": "Trump signs order imposing 25% steel and aluminum tariffs",
    "description": "The move comes a week after Trump promised to suspend tariffs on Canada and Mexico.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-signs-order-imposing-25-steel-aluminum-tariffs-rcna191573",
    "timestamp": "2025-02-10T22:59:10Z"
  },
  {
    "title": "Kennedy Center Apparently Scrubs Pages For Most Egregious Left-Wing Content After Trump Threatens Takeover",
    "description": "The John F. Kennedy Center for the Performing Arts seems to have deleted left-wing content from their website as Donald Trump accelerates his takeover.",
    "link": "https://dailycaller.com/2025/02/10/kennedy-center-scrubs-left-wing-shows-donald-trump-takeover/",
    "timestamp": "2025-02-10T22:57:18Z"
  },
  {
    "title": "Liberal Magazine: Hitler Knew How to Fund Science, Unlike Trump (David Strom/HotAir)",
    "description": "David Strom / HotAir:\nLiberal Magazine: Hitler Knew How to Fund Science, Unlike Trump  —  Adolf Hitler was really a pretty good guy, according to the American Prospect.  At least he knew that funding universities was a good investment and that scientific rese…",
    "link": "https://www.memeorandum.com/250210/p117",
    "timestamp": "2025-02-10T22:55:00Z"
  },
  {
    "title": "Trump says Ric Grenell will be Kennedy Center’s interim executive director | CNN Politics",
    "description": "President Donald Trump said Monday he is naming Ric Grenell, a longtime confidant already serving in multiple administration positions, to lead the Kennedy Center for the Performing Arts on a temporary basis after declaring himself the institution’s chairman …",
    "link": "https://www.cnn.com/2025/02/10/politics/ric-grenell-kennedy-center-interim-executive-director/index.html",
    "timestamp": "2025-02-10T22:54:57Z"
  },
  {
    "title": "Speaker Johnson Refuses To Say Whether Trump Should Comply With Court Orders",
    "description": "Speaker Mike Johnson declined to say whether President Donald Trump and his administration should comply with court rulings.\nThe post Speaker Johnson Refuses To Say Whether Trump Should Comply With Court Orders first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/speaker-johnson-refuses-to-say-whether-trump-should-comply-with-court-orders/",
    "timestamp": "2025-02-10T22:54:27Z"
  },
  {
    "title": "Trump's Education Department investigates schools for trans inclusion in sports",
    "description": "Donald Trump wants to get rid of the Department of Education, but in the meantime his administration is weaponizing it against schools that have allowed transgender women and girls to play on female sports teams.",
    "link": "https://www.advocate.com/sports/trump-education-department-transgender-sports",
    "timestamp": "2025-02-10T22:53:05Z"
  },
  {
    "title": "‘Back to plastic’: Trump pushes for plastic straws as he declares paper ones ‘don’t work’",
    "description": "WASHINGTON (AP) — President Donald Trump is moving to reverse a federal push away from plastic straws, declaring that paper straws “don’t work.” Trump signed an executive order Monday, saying: “It’s a ridiculous situation. We’re going back to plastic straws” …",
    "link": "https://financialpost.com/pmn/back-to-plastic-trump-pushes-for-plastic-straws-as-he-declares-paper-ones-dont-work",
    "timestamp": "2025-02-10T22:52:51Z"
  },
  {
    "title": "EU to mimic Trump’s approach to foreign aid – Bloomberg",
    "description": "The EU will revamp its multi-billion-euro foreign aid program amid concerns over its budget, Bloomberg has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612481-eu-foreign-aid-strategic-interests/",
    "timestamp": "2025-02-10T22:52:17Z"
  },
  {
    "title": "Critical health and science research is on the chopping block as Trump actions trigger shutdowns and confusion | CNN",
    "description": "Universities that do breakthrough-level studies are scrambling to understand the effects as their funding agencies slash their budgets.",
    "link": "https://www.cnn.com/2025/02/10/climate/trump-threatens-health-science-research/index.html",
    "timestamp": "2025-02-10T22:51:33Z"
  },
  {
    "title": "Google Officially Changes Name Of Gulf of Mexico to ‘Gulf Of America’",
    "description": "Google Maps officially changed the name of The Gulf of Mexico to The Gulf of America on Monday, weeks after the company said it would do so in compliance with an executive order signed by President Donald Trump. Trump proclaimed he would be changing the name …",
    "link": "https://www.mediaite.com/news/google-officially-changes-name-of-gulf-of-mexico-to-gulf-of-america/",
    "timestamp": "2025-02-10T22:50:57Z"
  },
  {
    "title": "'Back to plastic': Trump signs order for plastic straws as he declares paper ones 'don’t work'",
    "description": "President Donald Trump says he is banning federal use of paper straws, saying they “don’t work” and don’t last very long.",
    "link": "https://www.ksat.com/business/2025/02/10/back-to-plastic-trump-pushes-for-plastic-straws-as-he-declares-paper-ones-dont-work/",
    "timestamp": "2025-02-10T22:50:08Z"
  },
  {
    "title": "Transgender Recruits and Gender-Affirming Health Care Restricted by Hegseth Memo",
    "description": "All military services must pause accepting recruits with histories of gender dysphoria and halt some gender-affirming health care for transgender service members, Defense Secretary Pete Hegseth ordered in a memo revealed Monday.",
    "link": "https://www.military.com/daily-news/2025/02/10/transgender-recruits-and-gender-affirming-health-care-restricted-hegseth-memo.html",
    "timestamp": "2025-02-10T22:49:56Z"
  },
  {
    "title": "Open AI Chief Sam Altman Rejects $97.4 Billion Offer From Elon Musk, Ari Emanuel and Other Investors for Control of AI Giant",
    "description": "Open AI CEO Sam Altman and Elon Musk sparred publicly Monday after the Wall Street Journal reported that Musk and other investors have fielded a $97.4 billion offer to take control of the AI giant. The Journal published a story on the deal Monday. By midday, …",
    "link": "https://variety.com/2025/biz/news/open-ai-sam-altman-elon-musk-reject-ai-1236303087/",
    "timestamp": "2025-02-10T22:49:33Z"
  },
  {
    "title": "Trump to consider exemption for Australia on steel tariffs, PM says",
    "description": "U.S. President Donald Trump has agreed to consider an exemption for Australia over steel and aluminium tariffs, Prime Minister Anthony Albanese said on Tuesday.",
    "link": "https://biztoc.com/x/50f89885d392870b",
    "timestamp": "2025-02-10T22:49:30Z"
  },
  {
    "title": "Asian Stocks Set to Gain as US Brushes Off Tariffs: Markets Wrap",
    "description": "Stocks in Asia are set to advance after US traders looked past concerns over tariff threats and toward Federal Reserve comments and inflation data. The dollar strengthened and gold hit a record.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-set-to-gain-as-us-brushes-off-tariffs-markets-wrap",
    "timestamp": "2025-02-10T22:49:10Z"
  },
  {
    "title": "Trump imposes 25% tariff on steel, aluminum",
    "description": "United States President Donald Trump signed an executive order placing a 25% tariff on steel and aluminum, as he had previously announced.Furthermore, Trump ruled out the possibility that there would ...",
    "link": "https://biztoc.com/x/e554f71933b50a7a",
    "timestamp": "2025-02-10T22:48:52Z"
  },
  {
    "title": "A Trump executive order reportedly has ended a racial discrimination probe at Tesla",
    "description": "A recent executive order kneecapped a key Labor Department office responsible for investigating federal contractors — including Elon Musk’s Tesla — that have been accused of workplace discrimination.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/elon-musk-tesla-discrimination-trump-order-eeoc-rcna191545",
    "timestamp": "2025-02-10T22:47:12Z"
  },
  {
    "title": "Chiefs Fans, Swifties Blame Donald Trump For Embarrassing Loss In The Super Bowl: “His Demonic Presence Is Blocking Tay’s Prayers”",
    "description": "You sure it wasn’t the quarterback’s fault? Despite going into the Super Bowl as the favorites to win their third straight Lombardi Trophy, the Kansas Cit",
    "link": "https://www.newsbreak.com/share/3800272383802-chiefs-fans-swifties-blame-donald-trump-for-embarrassing-loss-in-the-super-bowl-his-demonic-presence-is-blocking-tay-s-prayers?s=a2&share_destination_id=NDYyODg5NTEtMTczOTIyNzQwNzQ3OA%3D%3D&pd=038DrzfL&hl=en_US&send_time=1739227407&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v6",
    "timestamp": "2025-02-10T22:45:14Z"
  },
  {
    "title": "Trump reveals whether he sees JD Vance as his successor (Fox News)",
    "description": "Fox News:\nTrump reveals whether he sees JD Vance as his successor  —  President Donald Trump sits down with Fox News anchor Bret Baier for an exclusive interview.",
    "link": "https://www.memeorandum.com/250210/p112",
    "timestamp": "2025-02-10T22:45:01Z"
  },
  {
    "title": "I am pleased to announce that Ric Grenell will serve as the Interim Executive Director of The Kennedy Center.",
    "description": "I am pleased to announce that Ric Grenell will serve as the Interim Executive Director of The Kennedy Center. Ric shares my Vision for a GOLDEN AGE of American Arts and Culture, and will be overseeing the daily operations of the Center. NO MORE DRAG SHOWS, OR…",
    "link": "https://freerepublic.com/focus/f-news/4296545/posts",
    "timestamp": "2025-02-10T22:45:00Z"
  },
  {
    "title": "No, That's Not Patrick Mahomes: Millions View Deepfake Super Bowl Video",
    "description": "'I'm a choker, I'm a trash can. Jalen Hurts absolutely destroyed me tonight,\" the fake Mahomes says.",
    "link": "https://www.cnet.com/tech/no-thats-not-patrick-mahomes-millions-view-deepfake-super-bowl-video/",
    "timestamp": "2025-02-10T22:44:00Z"
  },
  {
    "title": "American Bar Association Rips Trump And Musk In Scathing Statement For Acting ‘Contrary to the Rule of Law’",
    "description": "\"This is chaotic. It may appeal to a few. But it is wrong. And most Americans recognize it is wrong. It is also contrary to the rule of law.\"\nThe post American Bar Association Rips Trump And Musk In Scathing Statement For Acting ‘Contrary to the Rule of Law’ …",
    "link": "https://www.mediaite.com/politics/american-bar-association-rips-trump-and-musk-for-acting-contrary-to-the-rule-of-law/",
    "timestamp": "2025-02-10T22:43:38Z"
  },
  {
    "title": "Trump’s all-out assault on woke is tearing down the left’s cultural sway",
    "description": "Fashionable progressive ideas that have long been ascendant, including DEI and gender ideology, have received hammer blows since Trump’s inauguration, and there’s more to come.",
    "link": "https://nypost.com/2025/02/10/opinion/trumps-war-on-woke-is-tearing-down-the-lefts-cultural-sway/",
    "timestamp": "2025-02-10T22:43:10Z"
  },
  {
    "title": "What's wrong with US shipbuilding? A top Trump advisor called it an 'absolute mess' as Musk's DOGE eyes military waste",
    "description": "The US Navy's shipbuilding problems are widespread and not easily solvable, and many of its top programs are over budget and delayed.",
    "link": "https://www.businessinsider.com/doge-is-eyeing-dod-trump-team-calls-out-shipbuilding-mess-2025-2",
    "timestamp": "2025-02-10T22:42:02Z"
  },
  {
    "title": "PBS Closes DEI Office to Comply With Trump Executive Order",
    "description": "The decision comes three weeks after the President terminated DEI programs in the federal workforce\nThe post PBS Closes DEI Office to Comply With Trump Executive Order appeared first on TheWrap.",
    "link": "https://www.thewrap.com/pbs-closes-dei-offices-after-trump-executive-order/",
    "timestamp": "2025-02-10T22:41:25Z"
  },
  {
    "title": "Apple fixes iPhone and iPad bug exploited in ‘extremely sophisticated attacks’",
    "description": "Apple released iOS and iPadOS updates to address a zero-day likely exploited in extremely sophisticated attacks targeting specific individuals. Apple released emergency security updates to address a zero-day vulnerability, tracked as CVE-2025-24200, that the …",
    "link": "https://securityaffairs.com/174066/hacking/apple-fixes-iphone-and-ipad-bug-exploited-in-extremely-sophisticated-attacks.html",
    "timestamp": "2025-02-10T22:41:22Z"
  },
  {
    "title": "Trump calls for halting penny production, saying it's too expensive",
    "description": "RICHMOND, VIRGINIA — The lowly penny, the forgotten mainstay of coin jars and car cupholders everywhere, may soon be no more.\n\n\nPresident Donald Trump announced Sunday he's ordered his administration to cease production of the 1-cent coin, whose buying power …",
    "link": "https://www.voanews.com/a/trump-calls-for-halting-penny-production-saying-it-s-too-expensive-/7969975.html",
    "timestamp": "2025-02-10T22:39:24Z"
  }
]