[
  {
    "title": "Quote about Trump wrenching every fault line in America wide open is from a real Robert Redford op-ed",
    "description": "Actor Robert Redford once said, \"President Donald Trump didn't create all of our divisions as Americans. But he has found every fault line in America and wrenched them wide open.\"",
    "link": "https://www.snopes.com//fact-check/robert-redford-fault-line-trump/",
    "timestamp": "2025-09-18T22:49:00Z"
  },
  {
    "title": "Friend of former FBI Director James Comey subpoenaed in federal probe: Sources",
    "description": "Daniel Richman, a law professor, met with prosecutors on Tuesday, sources said. A Columbia law professor who is a friend and adviser to former FBI Director James Comey was subpoenaed last week by federal prosecutors in connection with a criminal probe into wh…",
    "link": "https://freerepublic.com/focus/f-news/4341420/posts",
    "timestamp": "2025-09-18T22:48:30Z"
  },
  {
    "title": "Democrats and violence? That’s the norm",
    "description": "'Expressing my inner Trump, Charlie Kirk was One Big Beautiful Force of Nature'",
    "link": "https://www.wnd.com/2025/09/democrats-violence-thats-norm/",
    "timestamp": "2025-09-18T22:47:00Z"
  },
  {
    "title": "After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump",
    "description": "From bagpipe choruses and big ticket tech deals, to disagreeing \"agreeably\", Donald Trump's state visit has put the government back on track after a testing start to the new term, writes Sky's political editor.",
    "link": "https://news.sky.com/story/after-his-hardest-two-weeks-yet-this-isnt-what-i-expected-to-write-about-starmer-and-trump-13433735",
    "timestamp": "2025-09-18T22:43:00Z"
  },
  {
    "title": "Coca-Cola dropped Jimmy Kimmel after 'disgusting' comments about Charlie Kirk?",
    "description": "Coca-Cola dropped talk show host Jimmy Kimmel of ABC's \"Jimmy Kimmel Live!\" after the company believed he made \"disgusting\" comments about the late conservative activist Charlie Kirk.",
    "link": "https://www.snopes.com//fact-check/coca-cola-dropped-kimmel/",
    "timestamp": "2025-09-18T22:42:00Z"
  },
  {
    "title": "FTC lawsuit: Federal Trade Commission sues Live Nation and Ticketmaster, saying they force fans to pay more for concerts, events",
    "description": "The Federal Trade Commission and a bipartisan group of state attorneys general sued Ticketmaster and its parent company Thursday, saying they are forcing consumers to pay more to see live events through a variety of illegal tactics.",
    "link": "https://abc13.com/post/ftc-lawsuit-federal-trade-commission-sues-live-nation-ticketmaster-saying-forces-fans-pay-more-concerts-events/17844152/",
    "timestamp": "2025-09-18T22:40:44Z"
  },
  {
    "title": "1st U.S. CTO Worries Health Care AI Could Become \"Inflationary\"",
    "description": "What industry leaders said at Newsweek's Digital Health Care Forum.",
    "link": "https://www.newsweek.com/us-cto-worries-healthcare-ai-could-become-inflationary-access-health-2132208",
    "timestamp": "2025-09-18T22:40:34Z"
  },
  {
    "title": "Inside the Protest Against Disney for Jimmy Kimmel Suspension",
    "description": "An estimated 200 protestors, many of them industry union members, crowded the main entrance to Walt Disney Studios in Burbank on Thursday. “I cannot believe what is currently happening to free speech,” said one.",
    "link": "http://www.hollywoodreporter.com/business/business-news/inside-protest-against-disney-jimmy-kimmel-suspension-1236375195/",
    "timestamp": "2025-09-18T22:40:29Z"
  },
  {
    "title": "'Does she know these people?' Trump appears to try to implicate Dem in fraud arrests",
    "description": "In a new Truth Social post, President Donald Trump appeared to try to implicate a prominent Democrat in a Medicaid fraud arrest announced on Thursday. The Department of Justice announced that eight individuals in Minnesota were arrested in an approximately $8…",
    "link": "https://www.rawstory.com/ilhan-omar-2674008295/",
    "timestamp": "2025-09-18T22:40:02Z"
  },
  {
    "title": "LISTEN: Trump calls for licenses of TV networks that give him ‘bad publicity’ to be revoked",
    "description": "President Donald Trump told reporters aboard Air Force One on Thursday that “97%” of some network coverage was negative toward him. “They give me only bad publicity or press,” Trump said. “They’re getting a license, I think maybe their license should be taken…",
    "link": "https://biztoc.com/x/552bc0917db6d2a5",
    "timestamp": "2025-09-18T22:39:01Z"
  },
  {
    "title": "Big Relief as Northeast Public Health Collaborative is Officially Formed",
    "description": "The Northeast Public Health Collaborative is official. It's a voluntary coalition to help protect its states from the willful ignorance of the Trump administration’s HHS Department.",
    "link": "https://www.thedailypoliticususa.com/p/big-relief-as-northeast-public-health",
    "timestamp": "2025-09-18T22:38:40Z"
  },
  {
    "title": "FTC lawsuit: Federal Trade Commission sues Live Nation and Ticketmaster, saying they force fans to pay more for concerts, events",
    "description": "The Federal Trade Commission and a bipartisan group of state attorneys general sued Ticketmaster and its parent company Thursday, saying they are forcing consumers to pay more to see live events through a variety of illegal tactics.",
    "link": "https://abc30.com/post/ftc-lawsuit-federal-trade-commission-sues-live-nation-ticketmaster-saying-forces-fans-pay-more-concerts-events/17844152/",
    "timestamp": "2025-09-18T22:34:00Z"
  },
  {
    "title": "UN Security Council votes on reimposing Iran nuclear sanctions",
    "description": "The United Nations Security Council will vote Friday on reimposing deep economic sanctions on Iran over its resurgent nuclear program. Britain, France and Germany — signatories to the Joint Comprehensive Plan of Action intended to stop Tehran obtaining nuclea…",
    "link": "https://www.digitaljournal.com/world/un-security-council-votes-on-reimposing-iran-nuclear-sanctions/article",
    "timestamp": "2025-09-18T22:32:20Z"
  },
  {
    "title": "UN Security Council Votes On Reimposing Iran Nuclear Sanctions",
    "description": "The United Nations Security Council will vote Friday on reimposing deep economic sanctions on Iran over its resurgent\nnuclear program.",
    "link": "https://www.ibtimes.com/un-security-council-votes-reimposing-iran-nuclear-sanctions-3783851",
    "timestamp": "2025-09-18T22:30:21Z"
  },
  {
    "title": "Jon Stewart to host 'The Daily Show' in rare mid-week appearance a day after Kimmel suspension",
    "description": "Jon Stewart plans to host Thursday's episode of “The Daily Show,” one day after ABC suspended Jimmy Kimmel’s late-night show indefinitely following comments he made about the assassination of conservative activist Charlie Kirk. Stewart's featured guest will b…",
    "link": "https://japantoday.com/category/entertainment/jon-stewart-to-host-%27the-daily-show%27-in-rare-mid-week-appearance-a-day-after-kimmel-suspension",
    "timestamp": "2025-09-18T22:29:24Z"
  },
  {
    "title": "Hunter Biden was involved in pardon talks toward end of father's term, source says",
    "description": "Former Biden chief of staff Jeff Zients told investigators Hunter Biden joined pardon discussions toward the end of his father's term, a source said.",
    "link": "https://www.foxnews.com/politics/hunter-biden-involved-pardon-talks-toward-end-fathers-term-source-says",
    "timestamp": "2025-09-18T22:28:46Z"
  },
  {
    "title": "LISTEN: Trump calls for licenses of TV networks that give him ‘bad publicity’ to be revoked",
    "description": "President Donald Trump told reporters aboard Air Force One on Thursday that “97%” of some network coverage was negative toward him. “They give me only bad publicity or press,” Trump said. “They’re getting a license, I think maybe their license should be taken…",
    "link": "https://www.pbs.org/newshour/politics/listen-trump-calls-for-licenses-of-tv-networks-that-give-him-bad-publicity-to-be-revoked",
    "timestamp": "2025-09-18T22:28:02Z"
  },
  {
    "title": "Democrats Hold Candlelight Vigils For Jimmy Kimmel",
    "description": "LOS ANGELES, CA — Democrats gathered together outside the El Capitan Theatre on Hollywood Boulevard, bearing candles and saying silent prayers on behalf of Jimmy Kimmel, whose show, Jimmy Kimmel Live!, was placed on hold indefinitely. \"So this is how Democrac…",
    "link": "https://freerepublic.com/focus/f-chat/4341417/posts",
    "timestamp": "2025-09-18T22:27:54Z"
  },
  {
    "title": "OnlyFans Star Bonnie Blue Reveals Sick Fantasy to 'Marry Donald Trump' — 'I'd Be Good Running U.S.'",
    "description": "The OnlyFans star chose to 'marry' the president in a hypothetical interview game.",
    "link": "https://radaronline.com/p/donald-trump-bonnie-blue-onlyfans-reveals-fantasy-marry-president/",
    "timestamp": "2025-09-18T22:27:37Z"
  },
  {
    "title": "Kamala Harris Lambastes Media For “Capitulating” To Trump In Light Of Jimmy Kimmel Suspension: “Attacking Critics & Using Fear As A Weapon”",
    "description": "Kamala Harris isn’t saying I told you so today, but the presidential candidate who warned Donald Trump would seek “revenge” on his critics and rivals if voted back into the White House is now cautioning that free speech in America may be on thin ice. While ne…",
    "link": "http://deadline.com/2025/09/jimmy-kimmel-kamala-harris-comments-donald-trump-1236548641/",
    "timestamp": "2025-09-18T22:26:10Z"
  },
  {
    "title": "Brendan Carr Dismisses House Democrats’ Effort to Have Him Resign From FCC: ‘I’m Not Going Anywhere’ | Video",
    "description": "\"My team tells me I need to stop responding with so many memes,\" the chairman tells Dana Loesch\nThe post Brendan Carr Dismisses House Democrats’ Effort to Have Him Resign From FCC: ‘I’m Not Going Anywhere’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/brendan-carr-responds-house-democrat-calls-to-resign/",
    "timestamp": "2025-09-18T22:26:10Z"
  },
  {
    "title": "What Is Disney Thinking?",
    "description": "By pulling Jimmy Kimmel off the air, Bob Iger might have tarnished his legacy in Hollywood. Joe Adalian digs into what Disney is thinking — and what happens next.",
    "link": "http://www.vulture.com/article/jimmy-kimmel-abc-disney-bob-iger-decision.html",
    "timestamp": "2025-09-18T22:25:33Z"
  },
  {
    "title": "Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent",
    "description": "BUDAPEST, Hungary (AP) — Since taking office in January, President Donald Trump has waged an aggressive campaign against the media unlike any in modern U.S. history, making moves similar to those of authoritarian leaders that he has often praised. On Wednesda…",
    "link": "https://freerepublic.com/focus/f-news/4341416/posts",
    "timestamp": "2025-09-18T22:25:29Z"
  },
  {
    "title": "Elon Musk Hires Immigrants So He Can Pay Them Less, Lawsuit Allege",
    "description": "Lawsuit Headache Tesla, which has come under repeated fire due to CEO Elon Musk's political antics and its quality control issues, has been now slapped with a lawsuit that alleges that the company prefers hiring visa holders aka immigrants over American citiz…",
    "link": "https://futurism.com/tesla-immigrants-visa-lawsuit",
    "timestamp": "2025-09-18T22:23:42Z"
  },
  {
    "title": "Jimmy Kimmel Issued List of Demands In Order to Get Back On Air",
    "description": "On September 10, 2025, extreme conservative activist Charlie Kirk was shot and killed during an appearance at Utah Valley University as part of his American Comeback Tour. Kirk’s assassination set off a political firestorm, with many Republicans immediately c…",
    "link": "https://insidethemagic.net/2025/09/jimmy-kimmel-issued-list-of-demands-in-order-to-get-back-on-air-ks1/",
    "timestamp": "2025-09-18T22:21:30Z"
  },
  {
    "title": "UK court clears the way for deportation of Eritrean asylum seeker",
    "description": "UK High Court ruled against Eritrean man in case that tested new 'one in, one out' migration scheme.",
    "link": "https://www.aljazeera.com/news/2025/9/18/uk-court-clears-the-way-for-deportation-of-eritrean-asylum-seeker",
    "timestamp": "2025-09-18T22:21:15Z"
  },
  {
    "title": "‘Obstruction ends today’: Senate confirms 48 Trump nominees in a single vote",
    "description": "GOP advances appointments after months of obstinate Democrat stalling",
    "link": "https://www.wnd.com/2025/09/senate-confirms-48-trump-nominees-single-vote/",
    "timestamp": "2025-09-18T22:21:13Z"
  },
  {
    "title": "Ryder Cup 2025: The recipe for what Justin Thomas calls the 'biggest golf event ever'",
    "description": "Take the loudest and rowdiest event in golf. Put it on a public golf course in New York notorious for its proud and raucous crowds. Now fill it with 50,000 flag-waving fans at Bethpage Black.",
    "link": "https://www.nbcsports.com/golf/news/ryder-cup-2025-the-recipe-for-what-justin-thomas-calls-the-biggest-golf-event-ever",
    "timestamp": "2025-09-18T22:21:04Z"
  },
  {
    "title": "Trump Names Afghanistan, India, China, and 20 Other Nations Illegal Drug Threats",
    "description": "President Donald Trump submitted a “Presidential Determination” document to Congress on Monday that identified 23 nations – including Afghanistan, India, China, Venezuela, and Pakistan – as major producers of illegal drugs, or important transit points on the …",
    "link": "https://www.breitbart.com/national-security/2025/09/18/trump-names-afghanistan-india-china-and-20-other-nations-illegal-drug-threats/",
    "timestamp": "2025-09-18T22:20:59Z"
  },
  {
    "title": "Korean Factory to Expand After ICE Raid Nets 317 Illegal Korean Workers",
    "description": "Korean manufacturer Hyundai has confirmed plans to raise its investment in the United States by $2.7 billion, following an ICE raid that sent home 317 Korean employees who were improperly working at a Georgia construction site.\nThe post Korean Factory to Expa…",
    "link": "https://www.breitbart.com/economy/2025/09/18/korean-factory-to-expand-after-ice-raid-nets-317-illegal-korean-workers/",
    "timestamp": "2025-09-18T22:20:33Z"
  },
  {
    "title": "Senate confirms 48 of Trump’s nominees at once after changing the chamber’s rules",
    "description": "The new rules allow Senate Republicans to move multiple nominees with a simple majority vote.",
    "link": "https://www.bostonherald.com/2025/09/18/senate-nominations-new-rules-confirmations/",
    "timestamp": "2025-09-18T22:19:06Z"
  },
  {
    "title": "Senate confirms 48 Trump nominees at once after GOP changed the chamber’s rules",
    "description": "Frustrated by the stalling tactics, Senate Republicans moved last week to make it easier to confirm large groups of lower-level, non-judicial nominations. Democrats had forced multiple votes on almost every one of Trump’s picks, infuriating the president and …",
    "link": "https://www.pbs.org/newshour/politics/senate-confirms-48-trump-nominees-at-once-after-gop-changed-the-chambers-rules",
    "timestamp": "2025-09-18T22:18:20Z"
  },
  {
    "title": "Trump hails UK hospitality as sign of respect",
    "description": "Speaking to reporters aboard Air Force One, United States President Donald Trump called British King Charles III a \"wonderful guy\" and said, \"I knew him before, but now I know him a lot...",
    "link": "https://biztoc.com/x/fa8853cadc31eb19",
    "timestamp": "2025-09-18T22:16:57Z"
  },
  {
    "title": "Shoddy statistics will produce bad policy",
    "description": "The fired head of the Bureau of Labor Statistics was accused of “rigged” job numbers to make Trump and Republicans “look bad.” There is no evidence to affirm that charge.",
    "link": "https://www.ncspin.com/shoddy-statistics-will-produce-bad-policy",
    "timestamp": "2025-09-18T22:16:48Z"
  },
  {
    "title": "Trump Says US Is Close to a TikTok Deal With China",
    "description": "President Donald Trump says the US is close to making a deal for TikTok with China. Trump says it would be done “in conjunction with China” and that the US is getting “a ‘fee plus’ for just making the deal,\" He spoke at a press conference alongside British Pr…",
    "link": "https://biztoc.com/x/e2f985db40db369c",
    "timestamp": "2025-09-18T22:16:45Z"
  },
  {
    "title": "Dana White reveals wild detail about UFC White House fights, 'best thing about being friends' with Trump",
    "description": "Dana White said the UFC event at the White House marking America’s 250th birthday was President Donald Trump’s idea and will feature fighters walking out of the Oval Office.",
    "link": "https://www.foxnews.com/sports/dana-white-reveals-wild-detail-about-ufc-white-house-fights-best-thing-about-being-friends-trump",
    "timestamp": "2025-09-18T22:16:31Z"
  },
  {
    "title": "Jasmine Crockett Claims Committing a Crime 'Doesn't Make' a Person a Criminal",
    "description": "Rep. Jasmine Crockett (D-TX) claimed that just because people commit crimes, it \"doesn't make them a criminal,\" adding that it depends on the person's \"mindset.\"\nThe post Jasmine Crockett Claims Committing a Crime ‘Doesn’t Make’ a Person a Criminal appeared f…",
    "link": "https://www.breitbart.com/politics/2025/09/18/jasmine-crockett-claims-committing-a-crime-doesnt-make-a-person-a-criminal/",
    "timestamp": "2025-09-18T22:13:54Z"
  },
  {
    "title": "‘I am now a registered Republican’: Social media confirms tsunami of voters fleeing Democrat Party",
    "description": "'Charlie Kirk' effect hits leftists when they already are flailing",
    "link": "https://www.wnd.com/2025/09/i-am-now-registered-republican-social-media-confirms/",
    "timestamp": "2025-09-18T22:11:49Z"
  },
  {
    "title": "‘Am I the biggest loser with the Fed rate cut?’ I’m 68, retired and live off IRAs and Social Security",
    "description": "The Federal Reserve cut policy rates by 25 basis points, to a range of 4% to 4.25%, and pencils in two more reductions this year.",
    "link": "https://www.marketwatch.com/story/am-i-the-biggest-loser-with-the-fed-rate-cut-im-68-retired-and-live-off-iras-and-social-security-e21b7f2d",
    "timestamp": "2025-09-18T22:10:00Z"
  },
  {
    "title": "Steve Bannon Urges Trump to 'Go to War' After Charlie Kirk Assassination",
    "description": "Steve Bannon says the administration is looking to expand the scope of the investigation into Charlie Kirk's assassination.",
    "link": "https://www.newsweek.com/steve-bannon-urges-trump-war-charlie-kirk-assassination-2132195",
    "timestamp": "2025-09-18T22:08:47Z"
  },
  {
    "title": "Vance Attacks Obama, Because Of Course",
    "description": "JD Vance went after former President Obama for heaven forbid telling the truth about what their playbook is. As The Guardian reported:\nBarack Obama addressed the recent killing of Charlie Kirk and told a crowd in Pennsylvania on Tuesday the country was “at an…",
    "link": "https://crooksandliars.com/2025/09/vance-attacks-obama-telling-truth-about",
    "timestamp": "2025-09-18T22:08:36Z"
  },
  {
    "title": "Cosco Confident in ‘Stable and Reliable’ Service Ahead of US Port Fees",
    "description": "“We will maintain competitive rates and surcharges, along with related policies that align with market conditions,” the Chinese ocean carrier said.",
    "link": "https://sourcingjournal.com/topics/logistics/cosco-shipping-us-port-docking-fees-stable-reliable-service-china-built-ships-vessels-ocean-carriers-1234780364/",
    "timestamp": "2025-09-18T22:08:01Z"
  },
  {
    "title": "Trump Provides Update on Autopen Scandal: 'It's Just Gotten Worse'",
    "description": "When the Biden-era autopen was used, \"Joe Biden wasn't giving those orders,\" President Donald Trump said Thursday.",
    "link": "https://www.westernjournal.com/trump-provides-update-autopen-scandal-just-gotten-worse/",
    "timestamp": "2025-09-18T22:07:29Z"
  },
  {
    "title": "A TikTok deal may be close. But what's in it for China?",
    "description": "Experts tell the BBC what a final deal might look like, and what Beijing might get in return.",
    "link": "https://www.bbc.com/news/articles/c9dxq0jz2l9o",
    "timestamp": "2025-09-18T22:07:20Z"
  },
  {
    "title": "Jimmy Kimmel’s suspension: Letters to the Editor — Sept. 19, 2025",
    "description": "NY Post readers discuss Jimmy Kimmel’s suspension for ugly, partisan remarks about Charlie Kirk’s assassination.",
    "link": "https://nypost.com/2025/09/18/opinion/jimmy-kimmels-suspension-letters/",
    "timestamp": "2025-09-18T22:06:21Z"
  },
  {
    "title": "Trump Appears To Violate Own Executive Order With Kimmel Suspension",
    "description": "President Donald Trump appears to be violating his own executive order on free speech that he signed at the start of his second administration.\nThe post Trump Appears To Violate Own Executive Order With Kimmel Suspension first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-appears-to-violate-own-executive-order-with-kimmel-ouster/",
    "timestamp": "2025-09-18T22:06:20Z"
  },
  {
    "title": "Eric Swalwell dons 'Jimmy Kimmel Live!' hat in solidarity for CNN interview",
    "description": "Rep. Eric Swalwell, D-Calif., donned a \"Jimmy Kimmel Live!\" hat during an interview with CNN on Thursday, after the late-night host's show was pulled. \"Congressman, I see you are wearing a hat. What does that hat say?\" CNN host John Berman asked the lawmaker,…",
    "link": "https://freerepublic.com/focus/f-chat/4341410/posts",
    "timestamp": "2025-09-18T22:04:38Z"
  },
  {
    "title": "Trump's FCC chairman takes center stage in a renewed free speech debate: From the Politics Desk",
    "description": "The FCC chairman usually doesn’t garner much attention, but in today’s edition, Daniel Arkin examines how that has changed during the Trump administration.",
    "link": "https://www.nbcnews.com/politics/politics-news/trumps-fcc-chairman-free-speech-debate-politics-desk-rcna232324",
    "timestamp": "2025-09-18T22:02:23Z"
  },
  {
    "title": "Trump diverted and forced to swap helicopters on way to Stansted",
    "description": "Marine One was diverted while ferrying Donald Trump from Chequers to Stansted Airport.",
    "link": "https://www.bbc.com/news/articles/c1wg8nq0p3ro",
    "timestamp": "2025-09-18T22:01:00Z"
  },
  {
    "title": "We don't fight crime in this country",
    "description": "Trump Administration officials are exploiting the Kirk assassination to show their base that they're willing to violate free speech rights to avenge their fallen hero.",
    "link": "https://www.ncspin.com/we-dont-fight-crime-in-this-country",
    "timestamp": "2025-09-18T22:00:15Z"
  },
  {
    "title": "Free-speech Republicans reconsider their boundaries...",
    "description": "One Republican said she no longer considers the First Amendment to “be sort of the ultimate right,” as she would “in normal circumstances.”",
    "link": "https://www.semafor.com/article/09/18/2025/kimmels-suspension-prompts-free-speech-republicans-to-reconsider-their-boundaries",
    "timestamp": "2025-09-18T22:00:03Z"
  },
  {
    "title": "“The Summer I Turned Pretty” Will Make You Feel Old",
    "description": "From the daily newsletter: thoughts on the series finale, without having watched a single other minute of the show.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-summer-i-turned-pretty-will-make-you-feel-old",
    "timestamp": "2025-09-18T22:00:00Z"
  },
  {
    "title": "French president and wife to present evidence in court that first lady is a cisgender woman",
    "description": "This will come in a defamation suit Emmanuel and Brigitte Macron filed against right-wing influencer Candace Owens, who claimed Brigitte was born with male sex characteristics and is therefore transgender.",
    "link": "https://www.advocate.com/news/brigitte-macron-evidence-not-transgender",
    "timestamp": "2025-09-18T21:59:47Z"
  },
  {
    "title": "Congressman Raskin urges Democrats to avoid 'trap,' vote for Charlie Kirk honor",
    "description": "WASHINGTON (Reuters) -U.S. Representative Jamie Raskin, a leading liberal voice in Congress, urged his fellow Democrats on Thursday to avoid an \"obvious...",
    "link": "https://www.yahoo.com/news/articles/congressman-raskin-urges-democrats-avoid-215918243.html",
    "timestamp": "2025-09-18T21:59:18Z"
  },
  {
    "title": "Carolina Herrera Spring 2026: Madrid State of Mind",
    "description": "Carolina Herrera spring 2026 ready-to-wear runway, fashion show & collection review. For his first show in Europe, creative director Wes Gordon sent out 77 looks drenched in color, drama and bold floral motifs.",
    "link": "http://wwd.com/runway/spring-2026/new-york/carolina-herrera/review/",
    "timestamp": "2025-09-18T21:58:14Z"
  },
  {
    "title": "Senate Confirms 48 Of Trump's Nominees At Once After Changing The Chamber's Rules",
    "description": "Democrats had forced multiple votes on almost every one of Trump’s picks, infuriating the president and tying up the Senate floor.",
    "link": "https://www.huffpost.com/entry/senate-confirms-48-trumps-nominees-at-once-after-changing-the-chambers-rules_n_68cc7e09e4b0df2833cd9070",
    "timestamp": "2025-09-18T21:57:39Z"
  },
  {
    "title": "'Laughing at him': Foreign official in awe watching King Charles 'humiliate' Trump",
    "description": "A Ukrainian MP said Thursday that President Donald Trump was \"humiliated\" on the world's stage yet again while he visited the United Kingdom's royal family. Kira Rudik, leader of the Ukrainian Holos Party, discussed Trump's U.K. visit in an interview with Tim…",
    "link": "https://www.rawstory.com/web-push-notification/trump-uk-2674008036/",
    "timestamp": "2025-09-18T21:56:03Z"
  },
  {
    "title": "Fox Nation to debut exclusive specials on Charlie Kirk with never-before-seen footage",
    "description": "Fox News Media will air two specials honoring Turning Point USA founder Charlie Kirk, including never-before-seen footage of Kirk hours before his assassination.",
    "link": "https://www.foxnews.com/media/fox-nation-debut-exclusive-specials-charlie-kirk-never-before-seen-footage",
    "timestamp": "2025-09-18T21:56:01Z"
  },
  {
    "title": "“Meaningless vanity project”: Senate Dems want Hegseth to pay for Defense name change",
    "description": "Maryland senators introduced legislation to pull costs of the Defense Department name change from Hegseth's budget",
    "link": "https://www.salon.com/2025/09/18/meaningless-vanity-project-senate-dems-want-hegseth-to-pay-for-defense-name-change/",
    "timestamp": "2025-09-18T21:55:16Z"
  },
  {
    "title": "Donald Trump Calls U.S. 'Hottest Country' During UK State Banquet",
    "description": "Donald Trump Calls U.S. 'Hottest Country' During UK State Banquetlittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-state-banquet-speech-king-charles",
    "timestamp": "2025-09-18T21:54:12Z"
  },
  {
    "title": "Matthew Hoh Featured in New Paramount+ Documentary Bodyguard of Lies",
    "description": "Reprinted with permission from Matt’s Thoughts on War and Peace. Cross-posted by Eisenhower Media Network. Bodyguard of Lies, featuring senior fellow Matthew Hoh, is an unflinching, unvarnished deep dive into the brutality of the Afghanistan War and the doubl…",
    "link": "https://www.antiwar.com/blog/2025/09/18/matthew-hoh-featured-in-new-paramount-documentary-bodyguard-of-lies/",
    "timestamp": "2025-09-18T21:53:56Z"
  },
  {
    "title": "Brendan Carr Targets ‘The View’ As FCC Chairman Continues Regulatory Threats In Aftermath Of Jimmy Kimmel’s Suspension",
    "description": "FCC Chairman Brendan Carr continued to threaten regulatory scrutiny of broadcast networks over their content on Thursday, this time taking on ABC’s The View. In the aftermath of ABC’s decision to suspend Jimmy Kimmel, Carr went on Scott Jennings’ podcast. Jen…",
    "link": "http://deadline.com/2025/09/brendan-carr-the-view-fcc-jimmy-kimmel-1236548571/",
    "timestamp": "2025-09-18T21:52:33Z"
  },
  {
    "title": "Majority of NC Voters Believe America is on the ‘Wrong Track’",
    "description": "When asked who is responsible for the current state of the economy A majority (52%) said President Donald Trump is responsible, 28.9% assigned responsibility to Joe Biden, 10.4% said neither, and 8.6% were unsure.",
    "link": "https://www.ncspin.com/majority-of-nc-voters-believe-america-is-on-the-wrong-track",
    "timestamp": "2025-09-18T21:51:25Z"
  },
  {
    "title": "Danica Patrick responds to Jimmy Kimmel getting pulled off air after Charlie Kirk assassination remarks",
    "description": "Danica Patrick celebrated the recent removal of Jimmy Kimmel from airwaves after his comments about Charlie Kirk's assassination prompted backlash.",
    "link": "https://www.foxnews.com/sports/danica-patrick-responds-jimmy-kimmel-getting-pulled-off-air-after-charlie-kirk-assassination-remarks",
    "timestamp": "2025-09-18T21:50:03Z"
  },
  {
    "title": "David Letterman calls Jimmy Kimmel suspension 'ridiculous'",
    "description": "ABC pulled the \"Jimmy Kimmel Live!\" show off the air indefinitely over comments its host made about the alleged killer of Charlie Kirk.",
    "link": "https://www.cnbc.com/2025/09/18/jimmy-kimmel-kirk-colbert-letterman-trump.html",
    "timestamp": "2025-09-18T21:49:06Z"
  },
  {
    "title": "Senate confirms 48 of Trump's nominees at once after changing the chamber's rules",
    "description": "The Senate has confirmed 48 of President Donald Trump’s nominees at once, voting for the first time under new rules to begin clearing a backlog of executive branch positions that had been delayed by Democrats.  Frustrated by the stalling tactics, Senate Repub…",
    "link": "https://japantoday.com/category/world/senate-confirms-48-of-trump%27s-nominees-at-once-after-changing-the-chamber%27s-rules",
    "timestamp": "2025-09-18T21:46:55Z"
  },
  {
    "title": "Trump defends labeling antifa a 'terrorist organization' as he targets left-wing extremism",
    "description": "President Donald Trump discusses Charlie Kirk’s assassination, the threat of social media to children and more during an interview with Martha MacCallum in the United Kingdom on ‘The Story.’",
    "link": "https://www.foxnews.com/media/trump-defends-labeling-antifa-terrorist-organization-targets-left-wing-extremism",
    "timestamp": "2025-09-18T21:43:09Z"
  },
  {
    "title": "Trump advises Keir Starmer to ‘call out the military’ to deal with U.K. immigration",
    "description": "Britain's Prime Minister Keir Starmer and U.S. President Donald Trump shake hands in Aylesbury, England, on Sept. 18, 2025.",
    "link": "https://biztoc.com/x/1240388a41c4010c",
    "timestamp": "2025-09-18T21:43:08Z"
  },
  {
    "title": "‘The View’ hosts avoid talking about ABC axing Jimmy Kimmel, but an insider says they ‘were not silenced’",
    "description": "An insider told Page Six the ladies were not given direction to avoid discussing the late night talk show host.",
    "link": "https://pagesix.com/2025/09/18/entertainment/the-view-hosts-avoid-talking-about-abc-axing-jimmy-kimmel-but-an-insider-says-they-were-not-silenced/",
    "timestamp": "2025-09-18T21:42:52Z"
  },
  {
    "title": "U.S. jobless aid applications retreat to 231,000 after surging to nearly 4-year high a week earlier",
    "description": "The number of Americans applying for jobless aid last week retreated significantly after surging to a nearly four-year high a week earlier. U.S. filings for unemployment benefits for the week ending Sept 13 fell by 33,000 to 231,000, the Labor Department repo…",
    "link": "https://japantoday.com/category/business/us-jobless-aid-applications-retreat-to-231-000-after-surging-to-nearly-4-year-high-a-week-earlier",
    "timestamp": "2025-09-18T21:42:47Z"
  },
  {
    "title": "Zohran Mamdani Dealt Blow by New York Democratic Chairman",
    "description": "Democrats' decisions to coalesce around Mamdani or remain fragmented could affect turnout, fundraising, and messaging.",
    "link": "https://www.newsweek.com/zohran-mamdani-dealt-blow-new-york-democratic-chairman-2132159",
    "timestamp": "2025-09-18T21:41:54Z"
  },
  {
    "title": "Inside DC's new $3.7 billion field that will replace RFK Stadium...",
    "description": "THE Washington Commanders are officially returning to the nation’s capital. A $3.7 billion plan is set to move forward to redevelop the site of the old RFK Stadium. The deal appeared to be in…",
    "link": "https://www.the-sun.com/sport/15215901/washington-commanders-stadium-historic-site-nations-capital/",
    "timestamp": "2025-09-18T21:40:37Z"
  },
  {
    "title": "Israel expands push into Gaza City center with 3 IDF divisions",
    "description": "Israel expanded operations in Gaza City on September 16, with three Israel Defense Forces (IDF) divisions now operating against Hamas. While visiting Israel on September 15, US Secretary of State Marco Rubio said that “the US prefers the war end quickly via a…",
    "link": "https://www.longwarjournal.org/archives/2025/09/israel-expands-push-into-gaza-city-center-with-3-idf-divisions.php",
    "timestamp": "2025-09-18T21:40:34Z"
  },
  {
    "title": "Mike Pence: Donald Trump Has Not ‘Changed the Republican Party’",
    "description": "The former vice president spoke at The Atlantic Festival about the president he once served.",
    "link": "https://www.theatlantic.com/politics/archive/2025/09/mike-pence-conservatism-free-speech-kimmel/684260/",
    "timestamp": "2025-09-18T21:39:59Z"
  },
  {
    "title": "Revealed: The West’s Most Hostile Leader Toward Israel",
    "description": "Sadly, there are not too many world leaders in the running for the title of most stalwart friend of Israel. U.S. President Donald Trump has to be near the top of that short list for the many pro-Israel actions he's taken while in the Oval Office. He recognize…",
    "link": "https://freerepublic.com/focus/f-news/4341407/posts",
    "timestamp": "2025-09-18T21:39:56Z"
  },
  {
    "title": "JD Vance's Past Remarks on Free Speech Resurface as Kimmel Pulled Off Air",
    "description": "\"Just as the Biden administration seemed desperate to silence people ... the Trump administration will do the opposite,\" Vance said in February.",
    "link": "https://www.newsweek.com/jd-vance-jimmy-kimmel-free-speech-trump-2132161",
    "timestamp": "2025-09-18T21:39:47Z"
  },
  {
    "title": "Senate Confirms 48 Trump Nominees — Including Kimberly Guilfoyle — In Single Vote",
    "description": "The Senate confirmed four dozen of President Donald Trump’s nominees in a single vote on Thursday following Senate Republicans unilaterally changing the upper chamber’s rules last week. Senators voted 51 to 47 along party lines to confirm 48 of the president’…",
    "link": "https://dailycaller.com/2025/09/18/senate-confirms-nominees-kimberly-guilfoyle-callista-gingrich/",
    "timestamp": "2025-09-18T21:39:03Z"
  },
  {
    "title": "Kamala Harris Reveals Biden Awkwardly Confronted Her ‘Minutes’ Before VP’s Debate With Trump: ‘I Just Couldn’t Understand Why’",
    "description": "Former Vice President Kamala Harris revealed that former President Joe Biden phoned her last year at an inopportune time to confront her for allegedly criticizing him behind his back.\nThe post Kamala Harris Reveals Biden Awkwardly Confronted Her ‘Minutes’ Bef…",
    "link": "https://www.mediaite.com/politics/kamala-harris-reveals-biden-awkwardly-confronted-her-minutes-before-vps-debate-with-trump-i-just-couldnt-understand-why/",
    "timestamp": "2025-09-18T21:38:31Z"
  },
  {
    "title": "Ros Atkins on… What Kimmel's suspension means for free speech in the US",
    "description": "The BBC's analysis editor looks at a decision that leading Democrats have called \"an abuse of power\".",
    "link": "https://www.bbc.com/news/videos/crme42nr8exo",
    "timestamp": "2025-09-18T21:38:29Z"
  },
  {
    "title": "With Jimmy Kimmel suspension, Trump's critics see a campaign to silence them",
    "description": "ABC’s decision to pull late-show host Jimmy Kimmel off the air marks what observers see as an escalation in a campaign by U.S. President Donald Trump and his allies to pressure media critics into silence.",
    "link": "https://www.cbc.ca/news/world/jimmy-kimmel-trump-free-speech-censorship-1.7637537",
    "timestamp": "2025-09-18T21:38:17Z"
  },
  {
    "title": "Jimmy Kimmel's suspension fits squarely into the FCC's new pressure playbook",
    "description": "ABC suspended Jimmy Kimmel after FCC chair Brendan Carr criticized his remarks on Charlie Kirk. It's part of a pattern.",
    "link": "https://www.businessinsider.com/fcc-brendan-carr-abc-jimmy-kimmel-nexstar-media-first-amendment-2025-9",
    "timestamp": "2025-09-18T21:37:32Z"
  },
  {
    "title": "Trump asks Supreme Court for emergency order to remove Lisa Cook from the Fed board",
    "description": "The Trump administration on Thursday asked the Supreme Court for an emergency order to remove Lisa Cook from the Federal Reserve’s board of governors. The Republican administration turned to the high court after an appeals court refused to go along with ousti…",
    "link": "https://japantoday.com/category/world/trump-asks-the-supreme-court-for-an-emergency-order-to-remove-lisa-cook-from-the-fed-board",
    "timestamp": "2025-09-18T21:37:11Z"
  },
  {
    "title": "Trump suggests U.S. troops could return to base in Afghanistan, citing its proximity to rival China",
    "description": "President Donald Trump on Thursday suggested that he is working to reestablish a U.S. presence at Bagram Air Base in Afghanistan, four years after America’s chaotic withdrawal from the country left the base in the Taliban’s hands. Trump floated the idea durin…",
    "link": "https://japantoday.com/category/world/trump-suggests-us-troops-could-return-to-base-in-afghanistan-citing-its-proximity-to-rival-china",
    "timestamp": "2025-09-18T21:36:56Z"
  },
  {
    "title": "U.S. would help secure peace after Russia's war in Ukraine, Trump tells Fox News",
    "description": "The United States would help to secure peace after Russia's war in Ukraine is settled, President Donald Trump said in an interview aired on Fox News on Thursday. &quot;After the war is settled, we would help secure the peace. And I think ultimately that'll ha…",
    "link": "https://japantoday.com/category/world/us-would-help-secure-peace-after-russia%27s-war-in-ukraine-trump-tells-fox-news",
    "timestamp": "2025-09-18T21:36:44Z"
  },
  {
    "title": "Trump wraps up UK state visit with gratitude for his hosts while largely sidestepping tough issues",
    "description": "President Donald Trump said Thursday that he was “tremendously thankful” for the pageantry and splendor lavished on him during his second state visit to the United Kingdom as he wrapped up a trip that largely sidestepped major public disagreements over diffic…",
    "link": "https://japantoday.com/category/world/after-the-royal-pomp-trump%27s-state-visit-turns-to-politics-and-a-meeting-with-starmer",
    "timestamp": "2025-09-18T21:36:22Z"
  },
  {
    "title": "Rick Scott Leads Senate to Unanimously Establish October 14 as National Day of Remembrance for Charlie Kirk",
    "description": "The U.S. Senate on Thursday unanimously approved a resolution led by Sen. Rick Scott (R-FL) designating October 14, 2025, as a National Day of Remembrance for Charlie Kirk, honoring the late Turning Point USA founder’s legacy of faith, free speech, and civic …",
    "link": "https://www.breitbart.com/politics/2025/09/18/rick-scott-leads-senate-to-unanimously-establish-october-14-as-national-day-of-remembrance-for-charlie-kirk/",
    "timestamp": "2025-09-18T21:35:14Z"
  },
  {
    "title": "Damon Lindelof Vows Not To Work With Disney Until ‘Jimmy Kimmel Live’ Is Reinstated: “I Can’t In Good Conscience”",
    "description": "Damon Lindelof has drawn a line in the sand with Disney until the company reinstates Jimmy Kimmel Live! after ABC‘s decision to indefinitely pull the late-night show from the air. In a lengthy Instagram post Thursday, the Lost and Leftovers creator promised h…",
    "link": "http://deadline.com/2025/09/damon-lindelof-supports-jimmy-kimmel-boycotts-disney-1236548613/",
    "timestamp": "2025-09-18T21:34:51Z"
  },
  {
    "title": "BREAKING: Utah Sheriff Nate Brooksby failed to cuff even w/ zip ties highly dangerous Tyler Robinson, 22, when he took him into custody",
    "description": "Paul Sperry @paulsperry_ BREAKING: Utah Sheriff Nate Brooksby failed to cuff even w/ zip ties highly dangerous Tyler Robinson, 22, when he took him into custody,instead letting him sit on \"a very comfortable couch with a water bottle, unrestrained\" to appease…",
    "link": "https://freerepublic.com/focus/f-news/4341405/posts",
    "timestamp": "2025-09-18T21:34:22Z"
  },
  {
    "title": "BREAKING: Utah Sheriff Nate Brooksby failed to cuff even w/ zip ties highly dangerous Tyler Robinson, 22, when he took him into custody",
    "description": "Paul Sperry @paulsperry_ BREAKING: Utah Sheriff Nate Brooksby failed to cuff even w/ zip ties highly dangerous Tyler Robinson, 22, when he took him into custody,instead letting him sit on \"a very comfortable couch with a water bottle, unrestrained\" to appease…",
    "link": "https://freerepublic.com/focus/f-bloggers/4341405/posts",
    "timestamp": "2025-09-18T21:34:22Z"
  },
  {
    "title": "Trump, Starmer Dodge Political Hardballs to Seek Common Ground",
    "description": "Day one was filled with royal pageantry. Day two dodged the pitfalls of politics.",
    "link": "http://foreignpolicy.com/2025/09/18/trump-starmer-technology-prosperity-deal-state-visit/",
    "timestamp": "2025-09-18T21:33:33Z"
  },
  {
    "title": "Trump Says Licenses Should ‘Maybe’ Be Pulled From Networks He Claims Are Critical Of Him",
    "description": "Trump’s comment comes after ABC pulled “Jimmy Kimmel Live!” from the air following comments the host made about Charlie Kirk and Trump supporters.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/18/trump-says-licenses-should-maybe-be-pulled-from-networks-he-claims-are-critical-of-him/",
    "timestamp": "2025-09-18T21:33:03Z"
  }
]