[
  {
    "title": "Sticker shock: Chocolate prices are spiking",
    "description": "Chocolate lovers are experiencing sticker shock this Valentine’s Day.",
    "link": "https://www.cnn.com/2026/02/13/business/chocolate-prices-valentines-day",
    "timestamp": "2026-02-13T11:01:54Z"
  },
  {
    "title": "The Georgia Election Raid Was Even Worse Than It Seemed",
    "description": "Newly unsealed documents about last month’s FBI raid of a Fulton County elections office reveal just how far the Justice Department is willing to go to will Trump’s election fraud fantasies into existence.",
    "link": "http://nymag.com/intelligencer/article/doj-fulton-county-georgia-election-office-raid-even-worse.html",
    "timestamp": "2026-02-13T11:00:51Z"
  },
  {
    "title": "House passes elections overhaul bill that could make it harder for married women to vote",
    "description": "The SAVE America Act could make it difficult for people who have changed their names to vote",
    "link": "https://www.salon.com/2026/02/13/house-passes-elections-overhaul-bill-that-could-make-it-harder-for-married-women-to-vote-partner/",
    "timestamp": "2026-02-13T11:00:28Z"
  },
  {
    "title": "DHS shutdown explained: Who works without pay, what happens to airports and disaster response",
    "description": "A Department of Homeland Security shutdown is looming after Senate Democrats rejected Republican funding proposals. Here are the employees who will be affected the most.",
    "link": "https://www.foxnews.com/politics/dhs-shutdown-explained-who-works-without-pay-what-happens-airports-disaster-response",
    "timestamp": "2026-02-13T11:00:20Z"
  },
  {
    "title": "His Arrest During An ICE Raid Went Viral. Now He Wants A General Strike.",
    "description": "Now awaiting trial, David Huerta says he refuses to \"bend the knee\" and stay silent on the president's immigration crackdown.",
    "link": "https://www.huffpost.com/entry/david-huerta-seiu-interview_n_698e4247e4b0d2244f5906bb",
    "timestamp": "2026-02-13T11:00:17Z"
  },
  {
    "title": "A former BLM activist goes all in on mass incarceration",
    "description": "Former BLM activist turned PragerU host Xaviaer DuRousseau advocates for mass incarceration of violent criminals, challenging progressive policies.",
    "link": "https://www.foxnews.com/media/former-blm-activist-goes-all-mass-incarceration",
    "timestamp": "2026-02-13T11:00:10Z"
  },
  {
    "title": "Trump’s $12B rare earth plan targets China as experts warn US is ‘one crisis away’",
    "description": "Trump's $12 billion \"Project Vault\" aims to break Chinese dominance in rare earth elements, creating America's first critical mineral stockpile for national security.",
    "link": "https://www.foxnews.com/politics/trumps-12b-rare-earth-plan-targets-china-experts-warn-us-one-crisis-away",
    "timestamp": "2026-02-13T11:00:08Z"
  },
  {
    "title": "Rubio to meet China’s top diplomat Wang Yi on Friday",
    "description": "MUNICH, Feb 13 (Reuters) - U.S. Secretary of State Marco Rubio will meet with Chinese Foreign Minister Wang Yi on the sidelines of Munich Security Conference, a U.S. offi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/rubio-to-meet-china-s-top-diplomat-wang-yi-on-friday",
    "timestamp": "2026-02-13T11:00:05Z"
  },
  {
    "title": "How the Democrats Can Play Offense on Immigration",
    "description": "If all politics is spectacle in the era of Donald Trump, few episodes illustrate this more vividly than that created by Republican governors who bused asylum-seeking immigrants from their states into Northern cities during Joe Biden’s presidency. Greg Abbott …",
    "link": "https://newrepublic.com/article/205915/democrats-can-play-offense-immigration",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "These Are Not Your Father’s Democrats",
    "description": "Janet Mills, the 78-year-old moderate who has served as Maine’s governor since 2019, is staid and a little boring—which is exactly why, last fall, the Democratic Senatorial Campaign Committee pushed her to run against progressive upstart Graham Platner in the…",
    "link": "https://newrepublic.com/article/205910/democratic-tea-party-twist",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "Attorney for Epstein Survivors Warns That Justice Is Impossible With Bondi as AG",
    "description": "The Trump Justice Department is protecting the powerful at the expense of Epstein’s victims, says an attorney representing nine of his accusers. \nThe post Attorney for Epstein Survivors Warns That Justice Is Impossible With Bondi as AG  appeared first on The …",
    "link": "https://theintercept.com/2026/02/13/epstein-survivors-attorney-justice/",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "Did other countries release unredacted Epstein files? Claim lacks evidence",
    "description": "Posts purporting to show unredacted images of President Donald Trump with girls spread online.",
    "link": "https://www.snopes.com//news/2026/02/13/countries-outside-us-unredacted-epstein-files/",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "Trump calls Connecticut 'an extremely corrupt voting place' on Fox News, takes swipe at Blumenthal",
    "description": "In Connecticut, if a voter doesn't have an accepted form of identification, they can sign an affidavit attesting to their identity.",
    "link": "https://www.ctinsider.com/connecticut/article/ct-trump-blumenthal-kudlow-voter-fraud-fox-21349523.php",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "Instead of Pandering, Democrats Should Try Changing Voters’ Minds",
    "description": "Early last year, polls and media commentary suggested that crime would be the defining issue of the New York City mayoral race. Then, Zohran Mamdani’s campaign started to take off. By the end of the race, the news organizations that conduct exit polls asked v…",
    "link": "https://newrepublic.com/article/205884/democrats-pandering-change-voters-minds",
    "timestamp": "2026-02-13T11:00:00Z"
  },
  {
    "title": "The devastating ripple effects of Trump’s DEI attacks on corporate cuts to Pride in the UK: ‘Young people pay the price’",
    "description": "Corporate brands in the UK are seemingly bowing to the Trump administration’s attacks on diversity, equality and inclusion (DEI), leaving Pride organisations struggling to survive.  Earlier this week, National Student Pride – the UK’s largest LGBTQ+ student e…",
    "link": "https://www.thepinknews.com/2026/02/13/trump-dei-pride-lgbtq-us-uk/",
    "timestamp": "2026-02-13T10:54:55Z"
  },
  {
    "title": "\"We are not Latinos\": Argentina explodes against Bad Bunny and unleashes a cultural divide after the Super Bowl",
    "description": "The biggest sports show of the year in the United States was led by Bad Bunny, who became the protagonist of the most watched show in the history of the NFL. With millions of viewe",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/13/698f012046163f97038b45c3.html",
    "timestamp": "2026-02-13T10:51:44Z"
  },
  {
    "title": "White House Fires Interim U.S. Attorney After Just Five Hours",
    "description": "The same old song and dance from the Trump administration. Trump had put a woefully unqualified schlub in as acting U.S. Attorney and after his interim term expired, a panel of judges put someone qualified in instead. The Trump administration don't want quali…",
    "link": "https://crooksandliars.com/2026/02/white-house-fires-interim-us-attorney",
    "timestamp": "2026-02-13T10:38:00Z"
  },
  {
    "title": "Kremlin says Ukraine talks to take place 'next week'",
    "description": "MOSCOW: Russia said on Friday (Feb 13) that a new round of talks with US and Ukrainian officials seeking to broker an end to the four-year war would take place next week.Two previous rounds of US-brokered talks in Abu Dhabi have failed to lead to a breakthrou…",
    "link": "https://www.channelnewsasia.com/world/kremlin-russia-ukraine-talks-take-place-next-week-5929331",
    "timestamp": "2026-02-13T10:34:22Z"
  },
  {
    "title": "“Not Ready for Prime Time.” A Federal Tool to Check Voter Citizenship Keeps Making Mistakes.",
    "description": "The Department of Homeland Security pushed out the revamped tool while it was still adding data. That led to widespread misidentification, particularly for citizens born outside the U.S.",
    "link": "http://www.propublica.org/article/save-voter-citizenship-tool-mistakes-confusion",
    "timestamp": "2026-02-13T10:30:00Z"
  },
  {
    "title": "Three economists grabbed a beer. A multibillion-dollar industry was born.",
    "description": "The Iowa Electronic Markets paved the way for prediction market companies, like Kalshi and Polymarket, that have ballooned into a multibillion-dollar industry",
    "link": "https://www.nbcnews.com/news/us-news/3-economists-built-model-paved-way-kalshi-polymarket-rcna257094",
    "timestamp": "2026-02-13T10:30:00Z"
  },
  {
    "title": "'Trump needs Netanyahu to not mess things up for him in Iran and Gaza'",
    "description": "Following the Hastily Arranged Three-hour Meeting Between President Donald Trump and Prime Minister Benjamin Netanyahu on Wednesday, It Still Remains Unclear Wh",
    "link": "https://www.haaretz.com/israel-news/podcasts/2026-02-13/ty-article-podcast/trump-needs-netanyahu-to-not-mess-things-up-for-him-in-iran-and-gaza/0000019c-526d-d638-a3fe-77fda5e40000",
    "timestamp": "2026-02-13T10:26:39Z"
  },
  {
    "title": "Rubio Strikes Warmer Tone As Trump's Upheaval Of Atlantic Ties Looms Over Munich Summit",
    "description": "At the same gathering of top security officials last year, Vice President JD Vance had attacked European allies, triggering a series of confrontations.",
    "link": "https://www.huffpost.com/entry/rubio-strikes-warmer-tone-ahead-of-msc_n_698ef9aee4b0e13a41745f20",
    "timestamp": "2026-02-13T10:24:22Z"
  },
  {
    "title": "Indonesia readies up to 8,000 troops in first firm commitment to Gaza peacekeeping force",
    "description": "Indonesia is training troops for a new peacekeeping force in Gaza, backing a key part of President Donald Trump’s postwar plan",
    "link": "https://abcnews.com/International/wireStory/indonesia-readies-8000-troops-firm-commitment-gaza-peacekeeping-130130709",
    "timestamp": "2026-02-13T10:21:49Z"
  },
  {
    "title": "'Less glamour, more content': Berlinale kicks off in German capital",
    "description": "Berlin Film Festival jury president Wim Wenders said this year's 76th edition of the festival would have \"less glamour\" but \"more content\" in its eclectic selection.",
    "link": "https://www.thelocal.de/20260213/less-glamour-more-content-berlinale-kicks-off-in-german-capital",
    "timestamp": "2026-02-13T10:19:13Z"
  },
  {
    "title": "Nobody asked: Trump’s DOJ steps up uninvited recommendations at Supreme Court | CNN Politics",
    "description": "President Donald Trump’s administration is stepping into high-profile appeals at the Supreme Court without invitation at an unprecedented pace, supporting conservative groups in cases dealing with guns, religion and climate change.",
    "link": "https://www.cnn.com/2026/02/13/politics/supreme-court-trump-uninvited-d-john-sauer",
    "timestamp": "2026-02-13T10:18:50Z"
  },
  {
    "title": "Denmark PM to hold Greenland talks with Rubio in Munich",
    "description": "MUNICH: Danish Prime Minister Mette Frederiksen will discuss Greenland with United States officials, including Secretary of State Marco Rubio, on Friday (Feb 13) on the sidelines of the Munich Security Confe",
    "link": "https://www.channelnewsasia.com/world/denmark-greenland-talks-us-marco-rubio-mette-frederiksen-5929276",
    "timestamp": "2026-02-13T10:15:06Z"
  },
  {
    "title": "Reliance wins US licence for Venezuelan oil, sources say",
    "description": "Handing a licence to Reliance could ​speed up Venezuela’s oil exports and ‌reduce crude costs for the operator of the world’s biggest refining complex",
    "link": "https://www.thehindubusinessline.com/companies/reliance-wins-us-licence-for-venezuelan-oil-sources-say/article70627858.ece",
    "timestamp": "2026-02-13T10:15:04Z"
  },
  {
    "title": "Rubio heads to Munich to heap pressure on Europeans",
    "description": "U.S. Secretary of State Marco Rubio departed Thursday for the Munich Security Conference, where his aim will be to keep up pressure on Europe, though the tone is expected to be less confrontational than last year.",
    "link": "https://www.hurriyetdailynews.com/rubio-heads-to-munich-to-heap-pressure-on-europeans-218917",
    "timestamp": "2026-02-13T10:11:02Z"
  },
  {
    "title": "Vaccines are a national security issue, says global health official",
    "description": "LONDON, Feb 13 (Reuters) - Vaccines are a matter of national security, a leading global health figure said this week, warning that rising anti-vaccine sentiment worldwide could undermine efforts to fight future pandemics. Richard Hatchett, who leads ​t...",
    "link": "https://d2698.cms.socastsrm.com/2026/02/12/vaccines-are-a-national-security-issue-says-global-health-official/",
    "timestamp": "2026-02-13T10:09:18Z"
  },
  {
    "title": "What's next after House rebukes Trump's tariffs on Canada?",
    "description": "The anti-tariff House vote will likely prove symbolic, since the measure faces challenging odds in the Senate and a potential veto from Trump, analysts said.",
    "link": "https://abcnews.com/Politics/after-house-rebukes-trumps-tariffs-canada/story?id=130106207",
    "timestamp": "2026-02-13T10:06:27Z"
  },
  {
    "title": "Rubio warns Europe of new era in geopolitics before big Munich speech",
    "description": "The US Secretary of State will address the first major transatlantic meeting since Donald Trump threatened to annex Greenland.",
    "link": "https://www.bbc.com/news/articles/c99jxryd9xko",
    "timestamp": "2026-02-13T10:05:48Z"
  },
  {
    "title": "Ukraine is feeding intel to Patriot interceptor makers as Russia mixes up its missile attacks, lawmaker says",
    "description": "Patriot interceptors, made by the American company Lockheed Martin, are Ukraine's top defense against Russian ballistic missile attacks.",
    "link": "https://www.businessinsider.com/russia-mixes-missile-tactics-ukraine-feeds-intel-to-patriot-makers-2026-2",
    "timestamp": "2026-02-13T10:02:01Z"
  },
  {
    "title": "CAROL ROTH: Trump is right to worry about interest rates — but there’s a price to pay",
    "description": "America faces a mounting fiscal crisis with debt at 120% of GDP as interest expenses now exceed defense spending, creating significant national economic risks.",
    "link": "https://www.foxnews.com/opinion/carol-roth-trump-right-worry-about-interest-rates-theres-price-pay",
    "timestamp": "2026-02-13T10:00:50Z"
  },
  {
    "title": "From the foul line to the fault line: Deni Avdija, Israel and the collapse of online nuance",
    "description": "The danger around the Portland star is that in making crucial debates into arguments about basketball, we lose sight of what is really important",
    "link": "https://sports.yahoo.com/articles/foul-line-fault-line-deni-100041082.html",
    "timestamp": "2026-02-13T10:00:41Z"
  },
  {
    "title": "Crypto leaders join CFTC panel as U.S. pushes ‘pro-innovation’ rules",
    "description": "Will CFTC's new move offer more regulatory clarity for the crypto industry?",
    "link": "https://ambcrypto.com/crypto-leaders-join-cftc-panel-as-u-s-signals-pro-crypto-policy-shift/",
    "timestamp": "2026-02-13T10:00:39Z"
  },
  {
    "title": "MARK HALPERIN: The real reason Trump keeps beating the media at its own game",
    "description": "Donald Trump's deep understanding of news industry vulnerabilities gives him unprecedented political power over media coverage and public perception.",
    "link": "https://www.foxnews.com/opinion/mark-halperin-real-reason-trump-keeps-beating-media-own-game",
    "timestamp": "2026-02-13T10:00:22Z"
  },
  {
    "title": "This crucial state is the latest battleground in redistricting war between Trump and Democrats",
    "description": "Virginia Democrats fast-track new congressional map that could flip four GOP seats, potentially deciding House control in November elections.",
    "link": "https://www.foxnews.com/politics/florida-virginia-latest-battlegrounds-redistricting-war-between-trump-democrats",
    "timestamp": "2026-02-13T10:00:20Z"
  },
  {
    "title": "Inside the outrage over Marc Benioff's ICE jokes at a pivotal time for Salesforce",
    "description": "CEO Marc Benioff's ICE jokes at a Salesforce event stirred employee backlash, adding to company challenges like stock decline.",
    "link": "https://www.businessinsider.com/marc-benioff-ice-jokes-outrage-pivotal-time-salesforce-2026-2",
    "timestamp": "2026-02-13T10:00:02Z"
  },
  {
    "title": "Will Progressives Stop Leading With Their Chins?",
    "description": "It’s great that Democrats are blasting “The Epstein Class” but their House candidate in New Jersey needs to avoid “Israeli genocide” and “Abolish ICE.”\nThe post Will Progressives Stop Leading With Their Chins? appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/13/will-progressives-stop-abolish-ice/",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Doug Burgum, the Regime Toady of Our Time",
    "description": "Dashing the hopes of establishment Democrats, Trump’s interior secretary and ‘energy czar’ has adopted his boss’s excesses as his own.\nThe post Doug Burgum, the Regime Toady of Our Time appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/13/doug-burgum-interior-department-regime-toady-of-our-time/",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "The Antidemocratic Zealots Presiding Over Trump’s Makeover of US History",
    "description": "Toni Aguilar Rosenthal\n\n\n\nThe administration’s sketchily funded Freedom 250 project, which will oversee the celebration of America’s semiquincentennial, is a pageant of right-wing extremism. \r\n\n\r\n\n\nThe post The Antidemocratic Zealots Presiding Over Trump’s Ma…",
    "link": "https://www.thenation.com/?post_type=article&p=587238",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Members of Congress prepare to face angry, dissatisfied primary voters in 2026",
    "description": "Lawmakers in both parties face a reckoning from within their own ranks this year — and the first major primary day of the midterm elections puts all of those pressures on full display",
    "link": "https://www.nbcnews.com/politics/2026-election/members-congress-prepare-face-angry-dissatisfied-primary-voters-2026-rcna253870",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Clinics Sour on CMS After Agency Scraps 10-Year Primary Care Program Only Months In",
    "description": "A planned 10-year federal program called Making Care Primary was supposed to help primary care doctors by easing administrative burdens, allowing them to focus on improving patients’ health. A year after the Trump administration eliminated the program, federa…",
    "link": "https://kffhealthnews.org/news/article/cms-mcp-lead-primary-care-model-canceled-rural-health-north-carolina/",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It.",
    "description": "The president’s targeting of the bridge shows just how drastically U.S.-Canada relations have fallen between his two terms.",
    "link": "http://www.propublica.org/article/trump-michigan-canada-gordie-howe-bridge-reversal",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Trump Is a Weak and Failing President—Finally, Dems Are Acting Like It",
    "description": "Donald Trump’s losses are mounting. His border czar just announced a large drawdown of federal agents in Minnesota after protests turned public opinion. Job creation during Trump’s first year was worse than previously known. The country is losing manufacturin…",
    "link": "https://newrepublic.com/article/206553/trump-weak-failing-president-finally-dems-acting-like",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "What Will It Take for Democrats to Take the Senate?",
    "description": "A state-by-state breakdown of the Senate primaries shows Democrats have largely, but not completely, averted a debilitating ideological civil war in the midterm elections \nThe post What Will It Take for Democrats to Take the Senate?  appeared first on Washing…",
    "link": "http://washingtonmonthly.com/2026/02/13/democrats-take-the-senate-2026-path/",
    "timestamp": "2026-02-13T10:00:00Z"
  },
  {
    "title": "Europe has 'failed' in the face of Trump and Putin's ‘wrecking ball’ politics, top security official says",
    "description": "The head of Europe’s biggest security forum said regional powers were “totally on the sidelines” of major discussions — but that it was their “own fault.”",
    "link": "https://www.cnbc.com/2026/02/13/europe-trump-putin-defense-munich-security-conference.html",
    "timestamp": "2026-02-13T09:58:26Z"
  },
  {
    "title": "US' Marco ​Rubio signals warmer tone on transatlantic ties ahead of Munich Security Conference",
    "description": "Global leaders gather for the Munich Security Conference amidst numerous conflicts. US Secretary of State Marco Rubio highlights a critical juncture for transatlantic relations. Europe is strengthening its position and pursuing more autonomy. The conference a…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-marco-rubio-signals-warmer-tone-on-transatlantic-ties-ahead-of-munich-security-conference/articleshow/128299654.cms",
    "timestamp": "2026-02-13T09:55:51Z"
  },
  {
    "title": "Hungary's Tisza party keeps its lead as number of undecided voters drops, poll shows",
    "description": "BUDAPEST, Feb 13 (Reuters) - Hungary's main ⁠opposition Tisza party kept a 10-point lead over Prime Minister Viktor Orban's governing ⁠nationalist Fidesz party in February, according to a poll published on Friday, ‌ahead of a parliamentary election scheduled …",
    "link": "https://www.thestar.com.my/news/world/2026/02/13/hungary039s-tisza-party-keeps-its-lead-as-number-of-undecided-voters-drops-poll-shows",
    "timestamp": "2026-02-13T09:48:00Z"
  },
  {
    "title": "Trump repeal of climate rules 'catastrophic' - activist",
    "description": "US President Donald Trump's decision to repeal a scientific finding that greenhouse gas emissions endanger human health has been described as \"catastrophic\".",
    "link": "https://www.rte.ie/news/us/2026/0213/1558293-us-climate-ruling/",
    "timestamp": "2026-02-13T09:37:16Z"
  },
  {
    "title": "Children of Hamelin: The end of the story",
    "description": "Cultural totalitarianism turned people into sterile zombies, brainwashed them, perverted the minds of men and women, and subdued intellectuals responsible for the future of their people. The entrane to the cave is closing.",
    "link": "https://www.israelnationalnews.com/news/422375",
    "timestamp": "2026-02-13T09:37:00Z"
  },
  {
    "title": "Swedish fighter jets to patrol Greenland under NATO mission",
    "description": "Sweden said on Thursday that it would send fighter jets to patrol Greenland as part of a newly launched NATO mission in the Arctic aimed at placating US President Donald Trump.",
    "link": "https://www.thelocal.se/20260213/swedish-fighter-jets-to-patrol-greenland-under-nato-mission",
    "timestamp": "2026-02-13T09:36:26Z"
  },
  {
    "title": "Hungary’s Tisza party keeps its lead as number of undecided voters drops, poll shows",
    "description": "BUDAPEST, Feb 13 (Reuters) - Hungary’s main opposition Tisza party kept a 10-point lead over Prime Minister Viktor Orban’s governing nationalist Fidesz party in February,… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/hungary-s-tisza-party-keeps-its-lead-as-number-of-undecided-voters-drops-poll-shows",
    "timestamp": "2026-02-13T09:28:55Z"
  },
  {
    "title": "Reliance Industries wins US licence for Venezuelan oil: Report",
    "description": "A general licence authorises the purchase, exportation, and sale of Venezuelan-origin oil that has already been extracted, including the refining of such oil",
    "link": "https://www.moneycontrol.com/news/business/commodities/reliance-industries-wins-us-licence-for-venezuelan-oil-report-13827476.html",
    "timestamp": "2026-02-13T09:27:54Z"
  },
  {
    "title": "Walz proposes $10M business relief package as Republicans cry 'new avenue for fraud' in Minnesota",
    "description": "Minnesota Gov. Tim Walz faces criticism for proposing $10 million in small business relief after Trump's immigration crackdown amid fraud allegations.",
    "link": "https://www.foxnews.com/politics/walz-proposes-10m-business-relief-package-republicans-cry-new-avenue-fraud-minnesota",
    "timestamp": "2026-02-13T09:24:15Z"
  },
  {
    "title": "Limiting access to global technology could backfire on EU, warns Google",
    "description": "Google warns EU on erecting walls in Tech, Google EU tech warning: Google has warned that Europe's push to reduce reliance on foreign tech could slow innovation and growth, urging the EU to stay open to global digital tools while building its own capabilities",
    "link": "https://www.business-standard.com/world-news/google-warns-european-union-eu-tech-curbs-digital-sovereignty-us-laws-126021300951_1.html",
    "timestamp": "2026-02-13T09:20:16Z"
  },
  {
    "title": "Will the Stock Market Crash Under President Donald Trump in 2026? Wall Street Has a Surprising Answer for Investors.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b7cdc14d-d71e-4563-aa87-f475da1c728e",
    "timestamp": "2026-02-13T09:15:00Z"
  },
  {
    "title": "Second US aircraft carrier heading to Middle East amid Iran tensions",
    "description": "The United States will send the world's largest aircraft carrier to the Middle East to back up another one already there, putting more American firepower behind Donald Trump's efforts to coerce Iran into a deal over its nuclear programme, sources said.",
    "link": "https://www.independent.ie/world-news/middle-east/second-us-aircraft-carrier-heading-to-middle-east-amid-iran-tensions/a1539402091.html",
    "timestamp": "2026-02-13T09:13:18Z"
  },
  {
    "title": "Trump Plans to Ease Some Tariffs on Steel, Aluminum Goods - Reports",
    "description": "MOSCOW (Sputnik) - US President Donald Trump plans to cut certain tariffs on steel and aluminum products as economists warn American consumers are suffering from them, a newspaper reported on Friday, citing sources.",
    "link": "https://sputnikglobe.com/20260213/trump-plans-to-ease-some-tariffs-on-steel-aluminum-goods---reports-1123627837.html",
    "timestamp": "2026-02-13T09:12:21Z"
  },
  {
    "title": "Over Half of Venezuelans Believe National Security Worsened After US Attack - Poll",
    "description": "MOSCOW (Sputnik) - More than half of Venezuelans believe national security has deteriorated following the US operation to capture President Nicolas Maduro, a newspaper reported on Friday, citing a survey by the Gold Glove Consulting company.",
    "link": "https://sputnikglobe.com/20260213/over-half-of-venezuelans-believe-national-security-worsened-after-us-attack---poll-1123627721.html",
    "timestamp": "2026-02-13T09:09:34Z"
  },
  {
    "title": "On Fascists, Mean Girls and Screechy Pedophile Allies",
    "description": "In what one sage deemed \"amateur-hour, clown-fucker, reality-show dictatorship shit,\" this week's House hearings on ICE abuses, Epstein cover-ups and other GOP atrocities showcased a parade of rancid, lying, stonewalling MAGA lickspittles and deplorables - lo…",
    "link": "https://www.commondreams.org/further/on-fascists-mean-girls-and-screechy-pedophile-allies",
    "timestamp": "2026-02-13T09:07:51Z"
  },
  {
    "title": "Russia faces Ukraine casualties, broken communications and total oil ban",
    "description": "Russia unleashes deadly air assaults on civilians as Ukraine's Zelenskyy promises new front-line tactics.",
    "link": "https://www.aljazeera.com/news/2026/2/13/russia-faces-ukraine-casualties-broken-communications-and-total-oil-ban",
    "timestamp": "2026-02-13T09:06:58Z"
  },
  {
    "title": "Reliance Industries likely to get licence from US for Venezuelan oil",
    "description": "A general licence authorises the purchase, exportation, and sale of Venezuelan-origin oil that has already been extracted, including the refining of such oil",
    "link": "https://www.business-standard.com/markets/commodities/reliance-industries-likely-to-get-licence-from-us-for-venezuelan-oil-126021300909_1.html",
    "timestamp": "2026-02-13T09:06:09Z"
  },
  {
    "title": "Legal expert explains why dad who shot Brit daughter over 'Donald Trump row' won't face charges",
    "description": "Kris Harrison did not face any legal consequences in the wake of the deadly shooting of his child Lucy on 10 January last year",
    "link": "https://www.ladbible.com/news/uk-news/lucy-harrison-texas-shooting-why-dad-didnt-face-charges-explained-439507-20260213",
    "timestamp": "2026-02-13T09:00:15Z"
  },
  {
    "title": "Today in History: February 13, Supreme Court Justice Antonin Scalia found dead",
    "description": "Justice Antonin Scalia, the influential conservative member of the U.S. Supreme Court, was found dead at a private residence in the Big Bend area of West Texas; he was 79.",
    "link": "https://www.bostonherald.com/2026/02/13/today-in-history-february-13-supreme-court-justice-antonin-scalia-found-dead/",
    "timestamp": "2026-02-13T09:00:06Z"
  },
  {
    "title": "Today in History: February 13, Supreme Court Justice Antonin Scalia found dead",
    "description": "Justice Antonin Scalia, the influential conservative member of the U.S. Supreme Court, was found dead at a private residence in the Big Bend area of West Texas; he was 79.",
    "link": "https://www.denverpost.com/2026/02/13/today-in-history-february-13-supreme-court-justice-antonin-scalia-found-dead/",
    "timestamp": "2026-02-13T09:00:06Z"
  },
  {
    "title": "Reliance wins US licence for Venezuelan oil, sources say",
    "description": "Reliance Industries can now buy Venezuelan oil directly. The US has issued a special license. This move aims to boost Venezuela's oil exports. It will also lower crude costs for Reliance. This helps replace Russian oil supplies. Reliance previously stopped bu…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/reliance-wins-us-licence-for-venezuelan-oil-sources-say/articleshow/128297459.cms",
    "timestamp": "2026-02-13T08:46:35Z"
  },
  {
    "title": "Exclusive-India's Reliance wins US licence for Venezuelan oil, sources say",
    "description": "By Nidhi Verma and Jarrett Renshaw NEW DELHI/WASHINGTON, Feb 13 (Reuters) - The United States has issued a general licence to India's Reliance Industries Ltd...",
    "link": "https://sg.finance.yahoo.com/news/exclusive-indias-reliance-wins-us-083951862.html",
    "timestamp": "2026-02-13T08:39:51Z"
  },
  {
    "title": "Trump’s demand for the Fed to ease its monetary policy looks harder to justify: What will Kevin Warsh do?",
    "description": "Strong payroll numbers in the US could mean Trump’s pick to head the Federal Reserve, once Powell exits in May, might have a hard time trying to ease credit—as the White House wants. What Warsh does will be closely watched.",
    "link": "https://www.livemint.com/opinion/online-views/trumps-demand-for-the-fed-to-ease-its-monetary-policy-looks-harder-to-justify-what-will-kevin-warsh-do-11770968616752.html",
    "timestamp": "2026-02-13T08:31:05Z"
  },
  {
    "title": "These Four charts show how reliant Europe is on U.S. digital infrastructure",
    "description": "U.S. companies hold 85% of the European cloud market, per data from Synergy Research Group, a market analytics company.",
    "link": "https://www.cnbc.com/2026/02/13/four-charts-europes-reliance-us-digital-infrastructure.html",
    "timestamp": "2026-02-13T08:30:43Z"
  },
  {
    "title": "Trump pardons five former professional football players",
    "description": "President Donald Trump has pardoned five former professional football players convicted on a range of crimes from perjury, drug trafficking and counterfeiting U.S. currency.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_74c23a2f-ca08-4bdf-8880-f548f0617a42",
    "timestamp": "2026-02-13T08:24:30Z"
  },
  {
    "title": "The Parsha and Current Events: Impossibilities",
    "description": "The Iranians are suffering from obsessive, compulsive hatred of the Jews and of Israel and do not hide their intention of using any and every means to eradicate the lives of 8 million Jews in Israel. Is it wise to wait and see?!",
    "link": "https://www.israelnationalnews.com/news/422378",
    "timestamp": "2026-02-13T08:24:29Z"
  },
  {
    "title": "Int’l climate cooperation ‘antidote to chaos,’ say top UN official at Istanbul talks",
    "description": "Climate action can act as a stabilizing force in an increasingly volatile world, the U.N.’s top climate official said on Feb. 11, as Istanbul hosted the first strategic planning meeting ahead of the COP31 summit, which Türkiye will host in the Mediterranean c…",
    "link": "https://www.hurriyetdailynews.com/intl-climate-cooperation-antidote-to-chaos-say-top-un-official-at-istanbul-talks-218909",
    "timestamp": "2026-02-13T08:14:38Z"
  },
  {
    "title": "US aircraft carrier redeployed from Caribbean as Iran tensions rise",
    "description": "The United States will send the USS Gerald R. Ford aircraft carrier to the Middle East amid escalating tensions with Iran, according to US media outlets.",
    "link": "https://www.abc.net.au/news/2026-02-13/us-aircraft-carrier-carribbean-middle-east-iran/106342830",
    "timestamp": "2026-02-13T08:14:31Z"
  },
  {
    "title": "US says it caused dollar shortage to trigger Iran protests: What that means",
    "description": "US official admits engineering dollar shortage to strangle rial, which culminated in the deadliest crackdown in Iran.",
    "link": "https://www.aljazeera.com/economy/2026/2/13/us-says-it-caused-dollar-shortage-to-trigger-iran-protests-what-that-means",
    "timestamp": "2026-02-13T08:14:28Z"
  },
  {
    "title": "As energy costs rise, everyone wants data centers to pick up the tab",
    "description": "Politicians from President Donald Trump to local lawmakers agree that tech companies should cover the power costs of artificial intelligence data centers. But they still fight over what “fair share” means. The debate ties directly to cost-of-living pressure a…",
    "link": "https://apnews.com/article/data-center-artificial-intelligence-electricity-costs-rise-a6cdf9aa09d1cd3dbf82750430c15373",
    "timestamp": "2026-02-13T08:14:10Z"
  },
  {
    "title": "Moore: Dow’s 50,000 hit a supply-side miracle",
    "description": "Trump is predicting the Dow will reach 100,000 by the time he leaves office. That's a bit of a moonshot, for sure, but the last four decades prove supply-side miracles can come true.",
    "link": "https://www.bostonherald.com/2026/02/13/moore-dows-50000-hit-a-supply-side-miracle/",
    "timestamp": "2026-02-13T08:05:10Z"
  },
  {
    "title": "Immigration rule: US restricts truck licences to H-2A, H-2B, E-2 holders",
    "description": "After deadly highway crashes, the Trump administration limits non-domiciled commercial truck licences to select visa holders and tighter checks",
    "link": "https://www.business-standard.com/immigration/immigration-rule-us-restricts-truck-licences-to-h-2a-h-2b-e-2-holders-126021300828_1.html",
    "timestamp": "2026-02-13T08:04:01Z"
  },
  {
    "title": "How Pam Bondi and the Democrats turned a hearing into hysteria, right in front of Jeffrey Epstein’s victims",
    "description": "Congressional hearing on Jeffrey Epstein case devolved into partisan theater as both sides seemed to prioritize viral moments over substantive answers.",
    "link": "https://www.foxnews.com/media/how-pam-bondi-democrats-turned-hearing-hysteria-right-front-jeffrey-epsteins-victims",
    "timestamp": "2026-02-13T08:00:44Z"
  },
  {
    "title": "Trump plans to roll back some tariffs on steel and aluminium goods",
    "description": "President Trump is reportedly planning to reduce some tariffs on steel and aluminum. Officials believe these tariffs are increasing prices for everyday items. This move comes as consumer costs are a major concern for voters ahead of the midterm elections. The…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-plans-to-roll-back-some-tariffs-on-steel-and-aluminium-goods/articleshow/128295578.cms",
    "timestamp": "2026-02-13T07:54:32Z"
  },
  {
    "title": "Trump Trade Team Working to Scale Back Scope of Metals Tariffs",
    "description": "The Trump administration is working to narrow its broad tariffs on steel and aluminum products that companies find difficult to calculate and the European Union wants reined in as part of its pending trade deal with the US, a person familiar with the matter s…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-trade-team-working-to-scale-back-scope-of-metals-tariffs",
    "timestamp": "2026-02-13T07:42:56Z"
  },
  {
    "title": "Judge temporarily blocks Trump officials from rescinding health grants to some Democratic-led states",
    "description": "A federal judge has ruled that President Donald Trump’s administration cannot pull back $600 million in public health grants allocated to four Democratic-led states, for now",
    "link": "https://abcnews.com/Politics/wireStory/judge-temporarily-blocks-trump-officials-rescinding-health-grants-130125040",
    "timestamp": "2026-02-13T07:41:46Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "description": "Those pardoned include ex-NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon.",
    "link": "https://www.npr.org/2026/02/13/nx-s1-5713307/trump-nfl-pardons",
    "timestamp": "2026-02-13T07:41:41Z"
  },
  {
    "title": "Munich Security Conference opens amid transatlantic tension",
    "description": "The MSC brings together security experts, politicians and military leaders from around the world. This year's edition comes amid growing fears for transatlantic security under US President Trump. Follow DW for more. The 2026 Munich Security Conference kicks o…",
    "link": "https://www.dw.com/en/munich-security-conference-msc-opens-amid-transatlantic-tension/live-75938790",
    "timestamp": "2026-02-13T07:38:00Z"
  },
  {
    "title": "Trial date for Trump’s $10bn libel lawsuit against BBC set for February 2027",
    "description": "US president Donald Trump's libel case against the BBC over a Panorama documentary edit will go to trial in February 2027, a US judge has ruled. The decision from Florida judge Roy K Altman came after ...",
    "link": "https://www.c21media.net/news/trial-date-for-trumps-10bn-libel-lawsuit-against-bbc-set-for-february-2027/",
    "timestamp": "2026-02-13T07:37:26Z"
  },
  {
    "title": "'Spread It Around!': Jimmy Kimmel Unveils Plan To Shame Trump's Name Forever",
    "description": "The late night host has a way to give Trump exactly what he wants -- but in the worst possible way.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-epstein-files_n_698eae48e4b09bc097f9bc23",
    "timestamp": "2026-02-13T07:36:43Z"
  },
  {
    "title": "Israelis charged with using Iran war secrets to place bets",
    "description": "The Israeli authorities have arrested two suspects for allegedly using classified info to place bets on Polymarket related to the Iran war Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632400-israel-charges-bets-iran-war/",
    "timestamp": "2026-02-13T07:34:42Z"
  },
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
    "description": "The ruling temporarily blocks the Trump Administration from cutting $600 million in public health grants that had already been allocated to four Democratic-led states.",
    "link": "https://www.npr.org/2026/02/13/nx-s1-5713305/federal-funding-democratic-states-lawsuit",
    "timestamp": "2026-02-13T07:31:12Z"
  },
  {
    "title": "North Korea issues warning over South Korea drones",
    "description": "In a dramatic escalation, North Korea has threatened of terrible response to any future drone activities from South Korea. As Seoul probes a recent drone episode, officials promise to enhance security measures. This intensifying tension may jeopardize vital d…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-warns-warning-terrible-response-looms-over-south-koreas-drones/articleshow/128293798.cms",
    "timestamp": "2026-02-13T07:29:37Z"
  },
  {
    "title": "European stocks head for mixed open after latest AI Wall Street sell-off",
    "description": "AI fears hit stocks on Wall Street on Thursday, with real estate, trucking and software shares among the hardest hit.",
    "link": "https://www.cnbc.com/2026/02/13/europe-markets-stoxx-600-ftse-100-metals-ai-sell-off.html",
    "timestamp": "2026-02-13T07:27:33Z"
  }
]