[
  {
    "title": "Oil Steadies As Traders Look To Risk-On Mood And Ukraine Talks",
    "description": "Oil steadied as investors tracked a risk-on mood in wider financial markets, which countered the impact of progress in peace talks over Ukraine that could pave the way for increased crude supplies.",
    "link": "https://www.ndtvprofit.com/markets/oil-steadies-as-traders-look-to-risk-on-mood-and-ukraine-talks",
    "timestamp": "2025-11-25T02:25:29Z"
  },
  {
    "title": "October 7 victims sue Binance, founder Zhao over terror financing allegations",
    "description": "Victims of Hamas’ October 7, 2023 attack sue Binance and founder Changpeng Zhao, alleging the crypto giant laundered over $1B for Hamas and other terror groups.",
    "link": "https://www.israelnationalnews.com/news/418310",
    "timestamp": "2025-11-25T02:25:26Z"
  },
  {
    "title": "White House delays expected release of proposal to lower health care costs",
    "description": "It was not clear what stance the president was expected to take regarding the expiration of subsidies, but a bipartisan group of House lawmakers proposed extending ACA subsidies for two years and placing an income cap for high earners.",
    "link": "https://justthenews.com/government/white-house/white-house-pushes-expected-unveiling-new-healthcare-cost-proposal-reports",
    "timestamp": "2025-11-25T02:22:32Z"
  },
  {
    "title": "Erika Kirk says Turning Point's support of JD Vance in 2028 is 'in the works'",
    "description": "Erika Kirk says Turning Point's support of JD Vance in 2028 is 'in the works'go.com",
    "link": "https://abcnews.go.com/Politics/erika-kirk-turning-points-support-jd-vance-2028/story?id=127847720",
    "timestamp": "2025-11-25T02:21:43Z"
  },
  {
    "title": "Trump Moves To Designate Muslim Brotherhood Chapters As Terrorist Organizations",
    "description": "Donald Trump on Monday signed an executive order opening the door for several chapters of the Muslim Brotherhood to be designated as terrorist groups.",
    "link": "https://dailycaller.com/2025/11/24/donald-trump-muslim-brotherhood-chapters-executive-order-terror/",
    "timestamp": "2025-11-25T02:18:40Z"
  },
  {
    "title": "India's economy likely grew 7.3% in July-September quarter",
    "description": "India's economy is projected to have grown 7.3 percent in the July-September quarter. Strong rural and government spending supported this growth. Household consumption also improved. However, private investment remained subdued. This indicates uneven economic…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/indias-economy-likely-grew-7-3-in-july-september-quarter/articleshow/125553651.cms",
    "timestamp": "2025-11-25T02:17:21Z"
  },
  {
    "title": "Tyson Foods plans to close a major Nebraska beef plant",
    "description": "Tyson Foods’ decision to close a beef plant in Lexington, Nebraska, could devastate the small city and undermine the profits of ranchers nationwide. The closure of the plant and one of two shifts at a plant in Texas will reduce beef processing capacity nation…",
    "link": "https://apnews.com/article/beef-prices-tyson-plant-closing-a47113754d3a2962970481153657a02f",
    "timestamp": "2025-11-25T02:13:46Z"
  },
  {
    "title": "Thanksgiving prices don't reflect bird flu's recent toll on turkeys",
    "description": "Bird flu and another disease have shrunk the U.S. turkey population to a 40-year low this year",
    "link": "https://www.wokv.com/news/business/stores-keep-prices/EGT5L3IP6QZ2XALEKSOVAA7TO4/",
    "timestamp": "2025-11-25T02:12:12Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "A judge has thrown out cases against former FBI Director James Comey and New York Attorney General Letitia James. The prosecutor who brought the charges was illegally appointed. This ruling halts prosecutions against two political opponents. The decision focu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/judge-dismisses-comey-james-indictments-after-finding-that-prosecutor-was-illegally-appointed/articleshow/125553596.cms",
    "timestamp": "2025-11-25T02:11:46Z"
  },
  {
    "title": "Listen to The Country online: Fonterra’s $9.50 milk price midpoint forecast with CEO Miles Hurrell",
    "description": "Miles Hurrell, Michael Every, Richard Wyeth and Peter Newbold talk to The Country.",
    "link": "https://www.nzherald.co.nz/the-country/news/listen-to-the-country-online-fonterras-950-milk-price-midpoint-forecast-with-ceo-miles-hurrell/MKAWUEFRIBFRHCKCZQZIIJELNU/",
    "timestamp": "2025-11-25T02:11:25Z"
  },
  {
    "title": "Judge throws out case against ‘Russiagate’ ex-FBI chief",
    "description": "A US judge has dismissed the case against ex-FBI chief James Comey and New York Attorney General Letitia James Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628349-james-comey-fbi-case/",
    "timestamp": "2025-11-25T02:05:26Z"
  },
  {
    "title": "Schiff: 2025 Thanksgiving turkey price up ‘whopping 40 percent’",
    "description": "Sen. Adam Schiff (D-Calif.) said Sunday the price of this year’s Thanksgiving turkey is set to rise a “whopping 40 percent.” “So, we’re coming up on...",
    "link": "https://thehill.com/homenews/senate/5621301-schiff-trump-turkey-tariffs/",
    "timestamp": "2025-11-25T02:02:55Z"
  },
  {
    "title": "What to know about Trump's peace plan for Russia and Ukraine",
    "description": "The Trump administration's peace plan for Ukraine has drawn significant criticism. Initially seen as favoring Russia, the proposal has undergone revisions to incorporate Ukraine's concerns. This has made Russia less likely to accept the deal. Despite setbacks…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-to-know-about-trumps-peace-plan-for-russia-and-ukraine/articleshow/125553486.cms",
    "timestamp": "2025-11-25T01:58:56Z"
  },
  {
    "title": "Ruben Gallego warns military 'there will be consequences' going after congressmembers once Trump is gone",
    "description": "Arizona Democratic Senator Ruben Gallego said on CNN Monday that military members could face some consequences if they followed orders persecuting lawmakers.",
    "link": "https://www.foxnews.com/media/ruben-gallego-warns-military-there-consequences-going-after-congressmembers-once-trump-gone",
    "timestamp": "2025-11-25T01:58:38Z"
  },
  {
    "title": "US tags group 'linked' to Maduro terror outfit, to slap sanctions",
    "description": "US News: WASHINGTON: The US on Monday formally designated Cartel de los Soles a foreign terrorist organization, layering additional terrorism-related sanctions.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-tags-group-linked-to-maduro-terror-outfit-to-slap-sanctions/articleshow/125553450.cms",
    "timestamp": "2025-11-25T01:56:53Z"
  },
  {
    "title": "Dollar unfazed even as Fed cut comes back into view",
    "description": "The US dollar holds steady as investors anticipate a Federal Reserve interest rate cut next month. Dovish comments from policymakers have increased the likelihood of a December reduction. Meanwhile, the Japanese yen remains weak and under scrutiny for potenti…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-unfazed-even-as-fed-cut-comes-back-into-view/articleshow/125553455.cms",
    "timestamp": "2025-11-25T01:55:50Z"
  },
  {
    "title": "Canada's top diplomat says Ottawa is working fast to advance India trade deal",
    "description": "Canadian Foreign Minister Anita Anand’s statement follows a meeting between Prime Minister Modi and his Canadian counterpart at the G20 summit in South Africa",
    "link": "https://www.thehindubusinessline.com/news/canadas-top-diplomat-says-ottawa-is-working-fast-to-advance-india-trade-deal/article70320054.ece",
    "timestamp": "2025-11-25T01:53:40Z"
  },
  {
    "title": "Trump Embraces Mamdani Socialism as 'Practical'",
    "description": "This week, editors Peter Suderman, Katherine Mangu-Ward, and Nick Gillespie are joined by Reason senior editor Robby Soave to discuss President Donald Trump's unexpectedly warm White House meeting with New York mayor-elect Zohran Mamdani and why he now descri…",
    "link": "https://biztoc.com/x/a1cf395c0d8d1a1f",
    "timestamp": "2025-11-25T01:51:05Z"
  },
  {
    "title": "Venezuela says US terrorist designation a 'ridiculous lie'",
    "description": "Venezuela on Monday rejected the US terrorist designation of an alleged drug cartel on its territory as a \"ridiculous lie\" aimed at paving the way for an \"illegitimate\" military intervention. Venezuela's foreign ministry on Monday rejected what it called \"the…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/venezuela-says-us-terrorist-designation-a-ridiculous-lie/articleshow/125553402.cms",
    "timestamp": "2025-11-25T01:49:13Z"
  },
  {
    "title": "Bill Maher Left Dumbfounded After Lara Trump Questions If Trump’s ‘Piggy’ Comment Is Real",
    "description": "The comedian argued that the president's inflammatory remarks makes it more challenging for him to convince liberals to interact with conservatives more.",
    "link": "https://www.huffpost.com/entry/lara-trump-defends-donald-trumps-piggy-outburst-bill-maher_n_69249194e4b04a88b45eeb52",
    "timestamp": "2025-11-25T01:48:41Z"
  },
  {
    "title": "Russia Bombards Kyiv Hours After Trump Voices Hope for Ukraine Deal",
    "description": "Russia launched a combined missile and drone attack on Ukraine, concentrated heavily on the capital Kyiv, just hours after President Donald Trump struck a positive tone on prospects for a ceasefire deal.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-bombards-kyiv-hours-after-trump-voices-hope-for-ukraine-deal",
    "timestamp": "2025-11-25T01:47:13Z"
  },
  {
    "title": "Minnesota Democrats Defend Somalis amid Massive Fraud Investigations",
    "description": "Minnesota Democrats have sided with the state's Somali community despite evidence of widespread Somali fraud of taxpayers' healthcare programs.\nThe post Minnesota Democrats Defend Somalis amid Massive Fraud Investigations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/11/24/minnesota-democrats-defend-somalis-massive-fraud-investigations/",
    "timestamp": "2025-11-25T01:47:05Z"
  },
  {
    "title": "'They're using kids as bait': Trump's ICE ships record number of kids to federal shelters",
    "description": "ICE Sent 600 Immigrant Kids to Detention in Federal Shelters This Year. It’s a New Record.It was Friday, June 6, and the rent was due. As soon as she finished an errand, Imelda Carreto planned on joining her family as they gathered scrap metal to earn a littl…",
    "link": "https://www.rawstory.com/ice-raids-2674339073/",
    "timestamp": "2025-11-25T01:42:57Z"
  },
  {
    "title": "Trump Embraces Mamdani Socialism as 'Practical'",
    "description": "This week, The Reason Roundtable discuss President Trump's unexpectedly warm White House meeting with New York mayor-elect Zohran Mamdani.",
    "link": "https://reason.com/podcast/2025/11/24/trump-embraces-mamdani-socialism-as-practical/",
    "timestamp": "2025-11-25T01:40:18Z"
  },
  {
    "title": "Marjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump (Associated Press)",
    "description": "Associated Press:\nMarjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump  —  Rep. Marjorie Taylor Greene built a reputation in Congress as a fighter, first as a defender of President Donald Trump and more recently,…",
    "link": "https://www.memeorandum.com/251124/p113",
    "timestamp": "2025-11-25T01:40:00Z"
  },
  {
    "title": "Majority of Hispanic Republican voters say president’s policies are ‘harmful’ – up double-digits from first term: poll",
    "description": "Among just Hispanic Republicans, 55% said Trump’s policies have been harmful – a 17 percentage point increase from the president’s first term, when only 38% of Hispanic Republicans suggested Trump’s agenda was hurting Latinos.",
    "link": "https://nypost.com/2025/11/24/us-news/majority-of-hispanic-republicans-say-presidents-policies-are-harmful-up-double-digits-from-first-term-poll/",
    "timestamp": "2025-11-25T01:39:34Z"
  },
  {
    "title": "What happens next for Marjorie Taylor Greene after exit from Congress?",
    "description": "The former Trump ally has decided to end her time in Congress early after a public fallout with the president.",
    "link": "https://www.bbc.com/news/articles/cj4qvx08450o",
    "timestamp": "2025-11-25T01:38:33Z"
  },
  {
    "title": "QSR deals cooking; Prosus CEO on India bets",
    "description": "Happy Tuesday! Investors are lining up to invest in the quick service restaurant space. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/qsr-deals-cooking-prosus-ceo-on-india-bets/articleshow/125553150.cms",
    "timestamp": "2025-11-25T01:36:55Z"
  },
  {
    "title": "White House floats Obamacare subsidy plan",
    "description": "The White House is circulating a proposal that would extend subsidies to help consumers pay for coverage under the Affordable Care Act for two more years, as millions of Americans face spiking health care costs when the current tax credits are set to expire a…",
    "link": "https://www.bostonherald.com/2025/11/24/white-house-floats-obamacare-subsidy-plan/",
    "timestamp": "2025-11-25T01:36:49Z"
  },
  {
    "title": "Latinos report growing pessimism under Trump's administration, finds new survey; Major disapproval against US immigration and economic policies",
    "description": "A recent Pew Research Center survey reveals a significant increase in pessimism among Latinos regarding their personal situations and the nation's direction since the 2024 election. Many express strong disapproval of President Donald Trump's performance, part…",
    "link": "https://economictimes.indiatimes.com/news/international/us/latinos-report-growing-pessimism-under-trumps-administration-finds-new-survey-major-disapproval-against-us-immigration-and-economic-policies/articleshow/125553204.cms",
    "timestamp": "2025-11-25T01:28:54Z"
  },
  {
    "title": "Taylor Swift Eras Tour docuseries faces legal roadblock as plaintiff seeks to block Disney+ release",
    "description": "Taylor Swift&apos;s record-breaking &quot;Eras Tour&quot; filled stadiums, shaked ticket platforms, and became as much a cultural force as a sporting event, but its upcoming Disney",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/11/25/69250320268e3e0f2d8b45bc.html",
    "timestamp": "2025-11-25T01:26:51Z"
  },
  {
    "title": "Trump-pardoned CEO's firm accused of 'knowingly' enabling Hamas attacks",
    "description": "A new lawsuit against a cryptocurrency company whose billionaire founder was recently pardoned of federal crimes by President Donald Trump argued that the firm \"knowingly\" helped finance the Oct. 7, 2021, attack on Israel by Hamas, Reuters reported on Monday.…",
    "link": "https://www.rawstory.com/binance-hamas/",
    "timestamp": "2025-11-25T01:26:50Z"
  },
  {
    "title": "Trump begins process of labeling Muslim Brotherhood chapters as terrorist",
    "description": "US President Donald Trump has initiated steps to label certain Muslim Brotherhood groups as terrorist organizations. This move could lead to sanctions against the influential Islamist movement. The administration is reviewing chapters in Lebanon, Egypt, and J…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-begins-process-of-labeling-muslim-brotherhood-chapters-as-terrorist/articleshow/125553253.cms",
    "timestamp": "2025-11-25T01:26:09Z"
  },
  {
    "title": "Monday Night Open Thread",
    "description": "I see that Betty already noted that that DOJ indictments against James and Comey were dismissed, and while I am not up to speed on James I could see plain as day that the Comey shit was going to get tossed. Again, I do not think they actually care about putti…",
    "link": "https://balloon-juice.com/2025/11/24/monday-night-open-thread-117/",
    "timestamp": "2025-11-25T01:25:24Z"
  },
  {
    "title": "Two people killed in Kyiv strikes, three killed in Russia",
    "description": "Russian forces attacked the Ukrainian capital Kyiv early this morning, triggering fires in at least two residential buildings and killing two people, a senior official said.",
    "link": "https://www.rte.ie/news/ukraine/2025/1125/1545678-ukraine-russia/",
    "timestamp": "2025-11-25T01:25:10Z"
  },
  {
    "title": "Fix America’s trade-school crisis — and fill the jobs Trump is bringing home",
    "description": "If President Trump is serious about reindustrializing, we need a massive national effort to train American workers — because no tariff or tax incentive can conjure them out of thin air.",
    "link": "https://nypost.com/2025/11/24/opinion/how-congress-and-industry-can-fill-the-jobs-trump-is-bringing-home/",
    "timestamp": "2025-11-25T01:22:10Z"
  },
  {
    "title": "Jesse Watters Praises Investigation into Democratic Senator: ‘You Have To Make Examples Out of People’",
    "description": "Fox News host Jesse Watters praised the Department of Defense's investigation into Sen. Mark Kelly, declaring, \"You have to make examples out of people.\"\nThe post Jesse Watters Praises Investigation into Democratic Senator: ‘You Have To Make Examples Out of P…",
    "link": "https://www.mediaite.com/media/tv/jesse-watters-praises-investigation-into-democratic-senator-you-have-to-make-examples-out-of-people/",
    "timestamp": "2025-11-25T01:13:58Z"
  },
  {
    "title": "Drugs sneaked into Ohio prison soaked into the pages of JD Vance’s ‘Hillbilly Elegy’",
    "description": "'Hillbilly Elegy' was used to smuggle drugs into an Ohio prison in trafficking scheme.",
    "link": "https://apnews.com/article/hillbilly-elegy-drug-trafficking-ohio-prison-b5acc6e9e44431ca83760fa561942b0d",
    "timestamp": "2025-11-25T01:13:07Z"
  },
  {
    "title": "Talk to Trump: Gov deflects on health care costs",
    "description": "When it comes to preventing a spike in uninsured residents, Gov. Maura Healey is passing the buck back to President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/11/24/talk-to-trump-gov-deflects-on-health-care-costs/",
    "timestamp": "2025-11-25T01:11:55Z"
  },
  {
    "title": "Diddy's Son King Combs Says Family Is Still Hoping for an Early Release",
    "description": "Sean “Diddy” Combs’ son, King Combs, is still hopeful that his dad will get an early release from prison. “He’s gonna be on the way home,” King, 27, told a TMZ cameraman on Monday, November 24, after arriving at LAX. The cameraman asked King if Diddy, 56, cou…",
    "link": "https://www.usmagazine.com/celebrity-news/news/diddys-son-king-combs-says-family-hopes-for-early-release-soon/#article",
    "timestamp": "2025-11-25T01:07:51Z"
  },
  {
    "title": "Japan PM Takaichi to speak with Donald Trump by phone on Tuesday, FNN says",
    "description": "TOKYO (Reuters) -Japan's Prime Minister Sanae Takaichi and U.S. President Donald Trump are preparing to speak on the phone on Tuesday, FNN reported. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/25/japan-pm-takaichi-to-speak-with-donald-trump-by-phone-on-tuesday-fnn-says",
    "timestamp": "2025-11-25T01:07:00Z"
  },
  {
    "title": "US pressed Ukraine to accept deal at Geneva talks, official says",
    "description": "America pushed Ukraine to agree to peace terms with Russia. These proposals reportedly involve Ukraine ceding eastern regions and reducing its army. Ukraine protested these demands. Talks are ongoing in Geneva. Explosions were reported in Kyiv. The White Hous…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-pressed-ukraine-to-accept-deal-at-geneva-talks-official-says/articleshow/125553128.cms",
    "timestamp": "2025-11-25T01:06:39Z"
  },
  {
    "title": "Asian stocks track US gains on Fed rate cut bets",
    "description": "Asian stocks mirrored Wall Street's gains, driven by growing confidence in a potential Federal Reserve interest-rate cut in December and a rebound in technology shares. This optimism follows Fed Governor Christopher Waller's signal of support for a rate reduc…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-track-us-gains-on-fed-rate-cut-bets/articleshow/125553113.cms",
    "timestamp": "2025-11-25T01:03:13Z"
  },
  {
    "title": "'Incompetent kook!' Trump lawyer catches heat for cheering high-profile court losses",
    "description": "President Donald Trump's assistant attorney general for the DOJ's civil rights division caught heat from political observers and analysts on Monday after she appeared to celebrate a pair of high-profile court losses.U.S. District Judge Cameron Currie tossed o…",
    "link": "https://www.rawstory.com/harmeet-dhillon-2674339039/",
    "timestamp": "2025-11-25T01:01:38Z"
  },
  {
    "title": "BBC faces more headaches as its DC news editor exits due to 'management style' complaints",
    "description": "BBC's DC-based executive producer and news editor Adam Levy abruptly exited the outlet after complaints were reportedly made about his \"management style.\"",
    "link": "https://www.foxnews.com/media/bbc-faces-more-headaches-its-dc-news-editor-exits-due-management-style-complaints",
    "timestamp": "2025-11-25T01:00:24Z"
  },
  {
    "title": "Canada's top diplomat says Ottawa is working fast to advance India trade deal",
    "description": "Canada and India will accelerate trade talks. This follows a meeting between Prime Ministers Mark Carney and Narendra Modi. Relations were strained after allegations regarding an assassination. Canada is pursuing a new foreign policy. This aims to diversify t…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/canadas-top-diplomat-says-ottawa-is-working-fast-to-advance-india-trade-deal/articleshow/125553093.cms",
    "timestamp": "2025-11-25T01:00:06Z"
  },
  {
    "title": "Jerry O'Connell & John Stamos End Years-Long Feud Over Rebecca Romijn",
    "description": "The long-standing public feud between Jerry O’Connell and John Stamos is over! The two actors, who have been estranged following the 62-year-old Full House alum’s 2005 divorce from Rebecca Romijn and her subsequent marriage to Jerry, 51, seemingly buried the …",
    "link": "https://www.justjared.com/2025/11/24/jerry-oconnell-john-stamos-end-years-long-feud-over-rebecca-romijn/",
    "timestamp": "2025-11-25T00:54:26Z"
  },
  {
    "title": "'Dangerous': Steve Bannon leads MAGA civil war on Trump's AI policy",
    "description": "President Donald Trump is all-in on pushing a future built on artificial intelligence — but a lot of MAGA loyalists are balking at this, and perhaps few more so than his longtime ally and former strategist Steve Bannon.This comes as Trump unveils his so-calle…",
    "link": "https://www.rawstory.com/steve-bannon-2674338854/",
    "timestamp": "2025-11-25T00:53:49Z"
  },
  {
    "title": "BBC leaders grilled by lawmakers over its standards after Trump threatened to sue",
    "description": "The BBC chairman admitted a slow response to a misleading edit of a Donald Trump speech. This comes amid a crisis at the broadcaster, with senior leaders resigning.  An internal memo highlighted alleged biased reporting on Trump, transgender issues, and Gaza.…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/bbc-leaders-grilled-by-lawmakers-over-its-standards-after-trump-threatened-to-sue/articleshow/125553029.cms",
    "timestamp": "2025-11-25T00:51:44Z"
  },
  {
    "title": "Russia launches 'massive' attack on Ukraine energy sites, conducts drone strike in Kyiv, claim Ukrainian Ministry, Mayor",
    "description": "Russia-Ukraine War: The recent attack took place even as the United States of America pressed Ukraine to accept its proposals to end the war with Russia during talks in Geneva",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-launches-massive-attack-on-ukraine-energy-sites-drone-strike-in-kyiv-claim-ukrainian-ministry-mayor/articleshow/125552983.cms",
    "timestamp": "2025-11-25T00:50:29Z"
  },
  {
    "title": "Tyson’s beef plant closure in Nebraska will impact a reliant town and ranchers nationwide",
    "description": "OMAHA, Neb. (AP) — Tyson Foods’ decision to close a beef plant that employs nearly one third of residents of Lexington, Nebraska, could devastate the small city and undermine the profits of ranchers nationwide. Closing a single slaughterhouse might not seem s…",
    "link": "https://financialpost.com/pmn/tysons-beef-plant-closure-in-nebraska-will-impact-a-reliant-town-and-ranchers-nationwide",
    "timestamp": "2025-11-25T00:49:44Z"
  },
  {
    "title": "Laura Loomer Drops So Many Whoppers in New Interview That Magazine Issues a Disclaimer Warning Readers",
    "description": "A Florida political magazine scored an interview with Laura Loomer, and prefaced it with a disclaimer warning readers that the claims she made \"have not been fact checked or independently verified.\"\nThe post Laura Loomer Drops So Many Whoppers in New Intervie…",
    "link": "https://www.mediaite.com/opinion/laura-loomer-drops-so-many-whoppers-in-new-interview-that-magazine-issues-a-disclaimer-warning-readers/",
    "timestamp": "2025-11-25T00:49:34Z"
  },
  {
    "title": "Top US military adviser visits Caribbean as Trump ramps up pressure on Venezuela",
    "description": "America's top military officer is visiting troops in Puerto Rico and on a warship. The U.S. has deployed a large fleet and is attacking alleged drug boats. This visit occurs as President Trump considers military action against Venezuela. The U.S. has also des…",
    "link": "https://economictimes.indiatimes.com/news/defence/top-us-military-adviser-visits-caribbean-as-trump-ramps-up-pressure-on-venezuela/articleshow/125552990.cms",
    "timestamp": "2025-11-25T00:48:12Z"
  },
  {
    "title": "Brazil: Judges vote to keep Jair Bolsonaro in custody",
    "description": "The former president was jailed over the weekend after tampering with his ankle monitor while on house arrest. The Supreme Court judges who upheld his incarceration fear he might try to escape.",
    "link": "https://www.dw.com/en/brazil-judges-vote-to-keep-jair-bolsonaro-in-custody/a-74874368",
    "timestamp": "2025-11-25T00:47:00Z"
  },
  {
    "title": "Tyson’s beef plant closure in Nebraska will impact a reliant town and ranchers nationwide",
    "description": "By JOSH FUNK OMAHA, Neb. (AP) — Tyson Foods’ decision to close a beef plant that employs nearly one third of residents of Lexington, Nebraska, could devastate the small city and undermine the profits of ranchers nationwide. Closing a single slaughterhouse mig…",
    "link": "https://www.bostonherald.com/2025/11/24/tysons-beef-plant-closure-in-nebraska-will-impact-a-reliant-town-and-ranchers-nationwide/",
    "timestamp": "2025-11-25T00:46:57Z"
  },
  {
    "title": "Kellyanne Conway Explains Why Mamdani ‘Would Have Done Better Saying No’ To Meeting Trump",
    "description": "Kellyanne Conway said Monday on Fox News that she thinks socialist Zohran Mamdani lost some of his credibility during his Friday meeting with Donald Trump.",
    "link": "https://dailycaller.com/2025/11/24/kellyanne-conway-donald-trump-zohran-mamdani-meeting/",
    "timestamp": "2025-11-25T00:46:37Z"
  },
  {
    "title": "Epstein’s Ghost Comes Back to Haunt the Democrats",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Epstein’s Ghost Comes Back to Haunt the Democrats appeared first on The…",
    "link": "https://www.dailysignal.com/2025/11/24/epsteins-ghost-comes-back-to-haunt-the-democrats/",
    "timestamp": "2025-11-25T00:44:54Z"
  },
  {
    "title": "Thousands of arrests by Trump’s crime-fighting task force in Memphis strain crowded jail and courts",
    "description": "More than 2,800 people have been arrested and more than 28,000 traffic citations were issued.",
    "link": "https://www.bostonherald.com/2025/11/24/federal-enforcement-memphis/",
    "timestamp": "2025-11-25T00:42:07Z"
  },
  {
    "title": "What India can do about its low inflation problem",
    "description": "India's economy is grappling with surprisingly low inflation. The Reserve Bank of India, led by Governor Sanjay Malhotra, needs to implement significant interest rate cuts. This policy shift aims to stimulate growth and address the currency's weakness. The up…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/what-india-can-do-about-its-low-inflation-problem/articleshow/125552943.cms",
    "timestamp": "2025-11-25T00:41:39Z"
  },
  {
    "title": "DOJ must fork over records on Epstein handling on an expedited basis: judge",
    "description": "The Department of Justice must produce records related to its handling of the Jeffrey Epstein files to a media organization on an expedited basis, federal Judge Tanya Chutkan of the District of Columbia ordered Monday, according to a new report. Politico's Se…",
    "link": "https://www.rawstory.com/epstein-files-2674339020/",
    "timestamp": "2025-11-25T00:40:33Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump and His MAGA Backers Savaged by World's Greatest Classical Musician in VERY Sweary On-Stage Attack",
    "description": "Famed classical musician Nigel Kennedy destroyed Donald Trump and his MAGA supporters onstage.",
    "link": "https://radaronline.com/p/trump-maga-savaged-by-classical-musician-onstage-nigel-kennedy/",
    "timestamp": "2025-11-25T00:40:00Z"
  },
  {
    "title": "CNN’s Daniel Dale Obliterates Trump’s False Zelensky Claim With 78 Examples That Say Otherwise",
    "description": "CNN senior reporter Daniel Dale dismantled a recent claim by President Donald Trump that Ukrainian President Volodymyr Zelensky had not shown any gratitude to the United States, listing a whopping 78 counterexamples.\nThe post CNN’s Daniel Dale Obliterates Tru…",
    "link": "https://www.mediaite.com/politics/cnns-daniel-dale-obliterates-trumps-false-zelensky-claim-with-78-examples-that-say-otherwise/",
    "timestamp": "2025-11-25T00:36:02Z"
  },
  {
    "title": "Indian pros take to EB-1A visa route as H-1B gets tougher",
    "description": "Volatility drives many to eye pathways not dependent on lottery or sudden policy shifts",
    "link": "https://economictimes.indiatimes.com/tech/technology/indian-pros-take-to-eb-1a-visa-route-as-h-1b-gets-tougher/articleshow/125548957.cms",
    "timestamp": "2025-11-25T00:30:00Z"
  },
  {
    "title": "Tennessee Democrat Congressional Candidate Aftyn Behn Says Men Can Give Birth",
    "description": "Tennessee Democrat U.S. Congressional candidate Aftyn Behn falsely claimed on a podcast episode in 2020 that men can give birth.\nThe post Tennessee Democrat Congressional Candidate Aftyn Behn Says Men Can Give Birth appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/24/tennessee-democrat-congressional-candidate-aftyn-behn-says-men-can-give-birth/",
    "timestamp": "2025-11-25T00:28:26Z"
  },
  {
    "title": "Republicans balk at Trump’s health care proposal before it’s even released | CNN Politics",
    "description": "President Donald Trump hasn’t officially unveiled his new health care plan. But plenty in his party already oppose it.",
    "link": "https://www.cnn.com/2025/11/24/politics/gop-pushback-trump-health-care-proposal",
    "timestamp": "2025-11-25T00:27:12Z"
  },
  {
    "title": "Canada's top diplomat says Ottawa is working fast to advance India trade deal",
    "description": "Canadian Foreign Minister Anita Anand says Canada and India will move quickly to get a trade deal after two years of strained relations",
    "link": "https://abcnews.go.com/Business/wireStory/canadas-top-diplomat-ottawa-working-fast-advance-india-127844807",
    "timestamp": "2025-11-25T00:19:41Z"
  },
  {
    "title": "Trump ‘Only Has Himself to Blame’ for Dismissed James Comey, Letitia James Cases, Nicolle Wallace Says | Video",
    "description": "\"The wheels have come off Donald Trump's retribution campaign,\" the MS NOW host adds\nThe post Trump ‘Only Has Himself to Blame’ for Dismissed James Comey, Letitia James Cases, Nicolle Wallace Says | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/nicolle-wallace-trump-james-comey-dismissed-case-letitia-james/",
    "timestamp": "2025-11-25T00:17:22Z"
  },
  {
    "title": "Judge tosses indictments against Comey, Letitia James over invalid Trump appointment",
    "description": "Federal judge dismisses indictments against James Comey and Letitia James, ruling Trump’s appointment of interim US Attorney Lindsey Halligan invalid.",
    "link": "https://www.israelnationalnews.com/news/418308",
    "timestamp": "2025-11-25T00:17:15Z"
  },
  {
    "title": "Xi-Trump call; PRC-Japan; Getting harder to evade PRC taxes; Sketchy LGFV bond deals",
    "description": "Trump made no mention of Taiwan or the “post-war international order” in his Truth Social post about the call, saying that “we discussed many topics including Ukraine/Russia, Fentanyl, Soybeans and other Farm Products, etc.” He also said Xi invited him to vis…",
    "link": "https://sinocism.com/p/xi-trump-call-prc-japan-getting-harder",
    "timestamp": "2025-11-25T00:14:45Z"
  },
  {
    "title": "Charlamagne says chummy Trump-Mamdani meeting shows all fascist, communist accusations are 'political theater'",
    "description": "The friendly Trump-Mamdani meeting proves fascist and communist accusations are meaningless political theater that divides families, says Charlamagne tha God.",
    "link": "https://www.foxnews.com/media/charlamagne-says-chummy-trump-mamdani-meeting-shows-all-fascist-communist-accusations-political-theater",
    "timestamp": "2025-11-25T00:13:45Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Begins Process to Designate Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designate",
    "description": "Fact Sheet: President Donald J. Trump Begins Process to Designate Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global TerroristsThe White House (.gov) Trump begins process of designating Muslim Brotherhood ch…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180197549",
    "timestamp": "2025-11-25T00:13:24Z"
  },
  {
    "title": "This Melania Trump photo is real, but it wasn't taken on Epstein's plane",
    "description": "A photo authentically shows future U.S. first lady Melania Trump, then Melania Knauss, posing partially nude for modeling pictures on the late sex offender Jeffrey Epstein's airplane.",
    "link": "https://www.snopes.com//fact-check/melania-trump-photo-epstein-plane/",
    "timestamp": "2025-11-25T00:13:00Z"
  },
  {
    "title": "DOJ files motion to unseal Epstein docs in latest step toward release",
    "description": "Justice Department moves to unseal Jeffrey Epstein grand jury materials after President Trump signs transparency act requiring release within 30 days of enactment.",
    "link": "https://www.foxnews.com/politics/doj-files-motion-unseal-epstein-docs-latest-step-toward-release",
    "timestamp": "2025-11-25T00:08:25Z"
  },
  {
    "title": "U.S. Senator Mark Kelly to be prosecuted, warns Pentagon. What will happen to former astronaut, retired Navy captain?",
    "description": "President Donald Trump has also accused Mark Kelly and the other Democrats of sedition, saying in a social media post that the crime was punishable by death.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-senator-mark-kelly-to-be-prosecuted-warns-pentagon-what-will-happen-to-former-astronaut-retired-navy-captain/articleshow/125552720.cms",
    "timestamp": "2025-11-25T00:07:37Z"
  },
  {
    "title": "Zelenskyy visit to Ireland up in the air as Trump's peace deal deadline looms",
    "description": "Planning is continuing, but the government is unsure if the visit can go ahead given recent developments on a peace deal.",
    "link": "https://www.thejournal.ie/zelenskyy-visit-to-ireland-uncertain-6884098-Nov2025/",
    "timestamp": "2025-11-25T00:05:54Z"
  },
  {
    "title": "New survey finds rising pessimism among U.S. Hispanics",
    "description": "Hispanic adults are increasingly unhappy with how the administration is handling the economy and immigration.",
    "link": "https://www.bostonherald.com/2025/11/24/hispanic-rising-pessimism/",
    "timestamp": "2025-11-25T00:05:03Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Begins Process to Designate Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Begins Process to Designate Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists  —  SECURING AMERICA FROM EXTRAORDINARY THREATS: Today, Presid…",
    "link": "https://www.memeorandum.com/251124/p102",
    "timestamp": "2025-11-25T00:05:01Z"
  },
  {
    "title": "Designation of Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nDesignation of Certain Muslim Brotherhood Chapters as Foreign Terrorist Organizations and Specially Designated Global Terrorists  —  By the authority vested in me as President by the Constitution and the laws of th…",
    "link": "https://www.memeorandum.com/251124/p103",
    "timestamp": "2025-11-25T00:05:01Z"
  },
  {
    "title": "What to expect from Quebec’s economic update Tuesday",
    "description": "Quebec Finance Minister Eric Girard is scheduled to present the province’s economic update on Tuesday, along with measures to help citizens and local businesses withstand the rising cost of living.",
    "link": "https://www.cbc.ca/news/canada/montreal/quebec-fall-economic-update-2025-9.6990928",
    "timestamp": "2025-11-25T00:01:00Z"
  },
  {
    "title": "Trump’s ‘Unlawful Orders’ Dispute",
    "description": "President Donald Trump is at the center of yet another bitter constitutional crisis.  His political adversaries have mounted a concerted campaign urging military personnel to disobey any “illegal orders.”  Trump responded to such calls by threatening to prose…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/11/24/trumps-unlawful-orders-dispute/",
    "timestamp": "2025-11-25T00:00:45Z"
  },
  {
    "title": "Trump Is Turning Gaza Into a Brutal Colonial Protection Racket",
    "description": "First published by Middle East Eye The West has spent two years partnering Israel in its campaign of wanton destruction in Gaza. Now the United States – with the permission of a cowed United Nations Security Council – has appointed Donald Trump to preside ove…",
    "link": "https://original.antiwar.com/cook/2025/11/24/trump-is-turning-gaza-into-a-brutal-colonial-protection-racket/",
    "timestamp": "2025-11-25T00:00:26Z"
  },
  {
    "title": "A Call to Congress — Advancing the MAHA Legislative Agenda",
    "description": "On February 13, 2025, President Trump signed Executive Order 14212, establishing the Make America Healthy Again (MAHA) Commission under the U.S. Department of Health and Human Services (HHS) Secretary Robert F. Kennedy Jr. This marked the beginning of a natio…",
    "link": "https://articles.mercola.com/sites/articles/archive/2025/11/25/maha-legislative-agenda-congress-action.aspx",
    "timestamp": "2025-11-25T00:00:00Z"
  },
  {
    "title": "‘Anti-woke’ policies blamed for falling attendance at some US conferences",
    "description": "Scientific meetings that support Black, Latino and Indigenous researchers are grappling with funding cuts and other restrictions.",
    "link": "https://www.nature.com/articles/d41586-025-03869-w",
    "timestamp": "2025-11-25T00:00:00Z"
  },
  {
    "title": "The Real Character Of American Populism: A Response To Richard Epstein",
    "description": "Richard Epstein has offered an interesting contrast between what he calls a “growth industry” of populism as it currently manifests itself on the right, with the MAGA followers of Donald Trump, and the left, with the rise of socialists supporting newly electe…",
    "link": "https://www.hoover.org/research/real-character-american-populism-response-richard-epstein",
    "timestamp": "2025-11-25T00:00:00Z"
  },
  {
    "title": "New Ad Campaign Targets Holiday Price Spike From Trump Tariffs",
    "description": "Tariffs Cost US on Monday announced a holiday campaign highlighting how President Donald Trump's sweeping tariffs are driving up the prices of food, gifts, and more for American families and businesses during the busiest shopping season of the year.\"Tariffs a…",
    "link": "https://www.commondreams.org/news/trump-tariffs-2025",
    "timestamp": "2025-11-24T23:56:32Z"
  },
  {
    "title": "Judge tosses James Comey, Letitia James cases, rules prosecutor was illegally appointed",
    "description": "A federal judge dismissed the indictments against James Comey and Letitia James. In twin rulings, Judge Cameron McGowan Currie found the appointment of Lindsey Halligan as interim U.S. attorney was invalid and unlawful. Halligan was picked by President Trump …",
    "link": "https://www.pbs.org/newshour/show/judge-tosses-james-comey-letitia-james-cases-rules-prosecutor-was-illegally-appointed",
    "timestamp": "2025-11-24T23:55:47Z"
  },
  {
    "title": "JD Vance Shreds Mitch McConnell Over 'Ridiculous Attack on the President's Team'",
    "description": "\"This is a ridiculous attack on the president's team, which has worked tirelessly to clean up the mess in Ukraine ...\"",
    "link": "https://www.westernjournal.com/jd-vance-shreds-mitch-mcconnell-ridiculous-attack-presidents-team/",
    "timestamp": "2025-11-24T23:54:10Z"
  },
  {
    "title": "US pressed Ukraine to accept deal at Geneva talks, official says",
    "description": "The United States pressed Ukraine to accept its proposals to end the war with Russia during talks in Geneva, a senior official told AFP, despite Kyiv’s protests that the plan conceded too much to Moscow. The official, speaking on condition of anonymity, said …",
    "link": "https://www.digitaljournal.com/world/us-pressed-ukraine-to-accept-deal-at-geneva-talks-official-says/article",
    "timestamp": "2025-11-24T23:53:14Z"
  },
  {
    "title": "Turns Out Prosecuting People Purely out of Rage Isn’t a Good Legal Strategy",
    "description": "There’s one big reason the government screwed up the James Comey and Letita James cases, Cristian Farias writes. It turns out prosecuting people purely out of vengeance tends to screw things up.",
    "link": "http://nymag.com/intelligencer/article/trump-halligan-bondi-comey-james-dismissal.html",
    "timestamp": "2025-11-24T23:51:01Z"
  },
  {
    "title": "Trump Phone Is Nowhere to Be Seen 3 Months After Release Date",
    "description": "Three months after its promised release date, President Donald Trump’s “patriotic” T1 smartphone is nowhere to be seen.\nThe project, first announced by the president’s sons Don Jr. and Eric in June at a flashy ceremony in Trump Tower, was intended to commemor…",
    "link": "https://biztoc.com/x/b517764e7dd14424",
    "timestamp": "2025-11-24T23:48:35Z"
  },
  {
    "title": "‘Flatly false’: Kilmar Abrego Garcia’s lawyers call out Trump admin’s ‘shocking’ conduct",
    "description": "A running theme of the Trump administration’s legal efforts is not only pressing aggressive claims, but also resisting, misleading and – as one federal judge put it last week – “outright lying” in service of President Donald Trump’s agenda.\nThe latest instanc…",
    "link": "https://biztoc.com/x/751804a6f69bbc19",
    "timestamp": "2025-11-24T23:48:27Z"
  },
  {
    "title": "White House circulates a plan to extend Obamacare subsidies as Trump pledges health care fix",
    "description": "The White House stresses that no plan is final until President Donald Trump announces it.",
    "link": "https://biztoc.com/x/44b5d309bc39842b",
    "timestamp": "2025-11-24T23:48:19Z"
  },
  {
    "title": "Marjorie Taylor Greene is staying out of the election to replace her",
    "description": "Marjorie Taylor Greene said she won’t make any endorsement in the special election race to replace her in Congress — avoiding a potential clash between her preferred candidate and a candidate aligned with President Donald Trump. \nGreene said in a social media…",
    "link": "https://biztoc.com/x/be4030506798b1d7",
    "timestamp": "2025-11-24T23:48:17Z"
  }
]