[
  {
    "title": "'This Leads Back To Trump': Fox News Pundit Casts Blame For Epstein 'Cover-Up'",
    "description": "Fox News pundit Lucy Caldwell accused President Donald Trump's administration of \"a cover-up of a cover-up\" on Jeffrey Epstein.\n\n\nDuring a Sunday panel discussion, Caldwell explained why she thought Trump's Epstein scandal was a \"turning point\" for the MAGA m…",
    "link": "https://crooksandliars.com/2025/07/leads-back-trump-fox-news-pundit-casts",
    "timestamp": "2025-07-14T10:50:57Z"
  },
  {
    "title": "Bitcoin tops $120,000 for the first time | CNN Business",
    "description": "Bitcoin crossed the $120,000 level for the first time on Monday, marking a milestone for the world’s largest cryptocurrency as investors bet on long-sought policy wins for the industry this week.",
    "link": "https://www.cnn.com/2025/07/14/business/bitcoin-hits-120000-first-time-intl",
    "timestamp": "2025-07-14T10:50:42Z"
  },
  {
    "title": "Chelsea: Cubana Chiefpriest Celebrates Victory Over PSG After Risky Prediction, \"Cash Out na Water\"",
    "description": "Nightlife king, Cubana Chiefpriest, celebrates Chelsea's 3-0 victory over PSG in the Club World Cup final, sharing his excitement and gain on social media.",
    "link": "https://www.legit.ng/entertainment/celebrities/1664219-chelsea-cubana-chiefpriest-celebrates-victory-psg-risky-prediction-cash-na-water/",
    "timestamp": "2025-07-14T10:47:29Z"
  },
  {
    "title": "Trump Envoy Kellogg Arrives in Kyiv as Trump Says EU Funding More Patriot Missiles for Ukraine",
    "description": "Ukraine will receive more Patriot air-defence missiles from the U.S. but the bill is being picked up by Euro taxpayers instead, Trump said. \nThe post Trump Envoy Kellogg Arrives in Kyiv as Trump Says EU Funding More Patriot Missiles for Ukraine appeared first…",
    "link": "https://www.breitbart.com/europe/2025/07/14/trump-envoy-kellogg-arrives-in-kyiv-as-trump-says-eu-funding-more-patriot-missiles-for-ukraine/",
    "timestamp": "2025-07-14T10:45:51Z"
  },
  {
    "title": "Why Kristi Noem hates FEMA",
    "description": "No, Trump has not given up on the conspiracist mania to kill the popular agency",
    "link": "https://www.salon.com/2025/07/14/why-kristi-noem-hates-fema/",
    "timestamp": "2025-07-14T10:45:49Z"
  },
  {
    "title": "EU Threatens Donald Trump With $24.5 Billion Tariff List",
    "description": "Italy's foreign minister warned that, while he hopes for successful negotiations, the EU will respond resolutely to Trump's latest tariff threat.",
    "link": "https://www.newsweek.com/eu-threatens-donald-trump-24-5-billion-tariffs-2098507",
    "timestamp": "2025-07-14T10:45:18Z"
  },
  {
    "title": "Boys and Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "More than 20 states have sued President Donald Trump’s administration over billions of dollars in frozen funding for after-school care, summer programs and more.",
    "link": "https://www.clickondetroit.com/business/2025/07/14/boys-and-girls-club-programs-threatened-by-trump-grant-freeze-serve-thousands-of-families/",
    "timestamp": "2025-07-14T10:44:50Z"
  },
  {
    "title": "Alarm as chasing bizarre theories becomes major White House time suck: report",
    "description": "Six months into his presidency, Donald Trump has turned the federal government into a conspiracy theory factory, deploying taxpayer resources to investigate debunked claims while his administration grinds to a halt chasing internet fantasies, the Washington P…",
    "link": "https://www.rawstory.com/trump-conspiracy-theories-2673151648/",
    "timestamp": "2025-07-14T10:44:50Z"
  },
  {
    "title": "Fed’s Powell Faces New Line of White House Scrutiny",
    "description": "President Donald Trump and his allies are focusing on Jerome Powell's handling of an expensive renovation of the Federal ...",
    "link": "https://biztoc.com/x/931645cfc15baeac",
    "timestamp": "2025-07-14T10:44:34Z"
  },
  {
    "title": "Boys and Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "Programs that provide summer and after-school programming to more than 1 million students are at risk because of a Trump administration freeze on education grants.",
    "link": "https://www.local10.com/business/2025/07/14/boys-and-girls-club-programs-threatened-by-trump-grant-freeze-serve-thousands-of-families/",
    "timestamp": "2025-07-14T10:44:11Z"
  },
  {
    "title": "Linda Yaccarino’s exit from X is a warning shot for any executive eyeing the corner office",
    "description": "The former X CEO is a cautionary tale of why chasing prestige can destroy the reputation that got you there.",
    "link": "https://fortune.com/article/linda-yaccarino-exit-ceo-elon-musk-cautionary-reputation/",
    "timestamp": "2025-07-14T10:44:03Z"
  },
  {
    "title": "India's inflation cools to 2.1% in June, extending slide to more than 6-year lows",
    "description": null,
    "link": "https://www.cnbc.com/2025/07/14/india-cpi-june-offers-rbi-cut-rates.html",
    "timestamp": "2025-07-14T10:43:41Z"
  },
  {
    "title": "Iran and the Logic of Limited Wars",
    "description": "No one wants a long war, and doing nothing was no longer an option.",
    "link": "http://foreignpolicy.com/2025/07/14/iran-israel-us-trump-nuclear-weapons-attack-strike-war/",
    "timestamp": "2025-07-14T10:43:19Z"
  },
  {
    "title": "EU, South Korea seek U.S. trade deals to soften tariff blow",
    "description": "The European Union and South Korea said on Monday they were working on trade deals with U.S. President Donald Trump that would soften the blow from looming tariffs as Washington threatens to impose hefty duties from August 1.\nTrump stepped up his trade war on…",
    "link": "https://biztoc.com/x/c5a5b193d2411935",
    "timestamp": "2025-07-14T10:42:43Z"
  },
  {
    "title": "American manufacturing is in a 3-year rut despite Biden subsidies and Trump protection",
    "description": "Democrats and Republicans don’t agree on much, but they share a conviction that the government should help American manufacturers, one way or another.\nDemocratic President Joe Biden handed out subsidies to chipmakers and electric vehicle manufacturers. Republ…",
    "link": "https://biztoc.com/x/6641be2d95b7872b",
    "timestamp": "2025-07-14T10:42:26Z"
  },
  {
    "title": "US stock futures lower after Trump announces 30% tariff on Mexico, EU",
    "description": "In This Article:\nU.S. stock futures are lower after President Donald Trump further escalated trade tensions.\nOver the weekend, Trump announced a 30% tariff on goods from the European Union and Mexico, starting Aug. 1. Mexico and EU leaders said they would con…",
    "link": "https://biztoc.com/x/0c7593bfaf884f2c",
    "timestamp": "2025-07-14T10:42:24Z"
  },
  {
    "title": "Russia-US talks to continue despite efforts to derail them – Putin envoy",
    "description": "Dialogue based on mutual respect and economic cooperation are essential for global security and peace, Kirill Dmitriev has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621449-dmitriev-russia-us-dialogue/",
    "timestamp": "2025-07-14T10:42:21Z"
  },
  {
    "title": "FIFA President Tries — and Fails — to Usher Trump Off Stage as Chelsea Celebrates World Cup Win",
    "description": "The FIFA president's attempt to usher Trump off stage failed Sunday night for Chelsea's Club World Cup trophy lift.\nThe post FIFA President Tries — and Fails — to Usher Trump Off Stage as Chelsea Celebrates World Cup Win first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fifa-president-tries-and-fails-to-usher-trump-off-stage-as-chelsea-celebrates-world-cup-win/",
    "timestamp": "2025-07-14T10:40:41Z"
  },
  {
    "title": "Kremlin says weapons and ammunition deliveries to Ukraine from U.S. are continuing",
    "description": "MOSCOW (Reuters) -The Kremlin said on Monday that the big picture of U.S. President Donald Trump remarks about supplying Patriot air defence missiles to Ukraine was that U.S. arms and ammunition deliveries to Kyiv have continued and are still continuing. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/07/14/kremlin-says-weapons-and-ammunition-deliveries-to-ukraine-from-us-are-continuing",
    "timestamp": "2025-07-14T10:40:00Z"
  },
  {
    "title": "Rupee Ends Lower Against Dollar As Tariff Jitters Weigh",
    "description": "The Indian Rupee closed weaker against the US Dollar on Monday, ending the session at Rs 85.99—down 19 paise from Friday’s closing rate of Rs 85.80. The local currency faced early morning pressure and continued to struggle throughout the day amid a strengthen…",
    "link": "https://www.ndtvprofit.com/markets/rupee-ends-lower-against-dollar-as-tariff-jitters-weigh",
    "timestamp": "2025-07-14T10:38:37Z"
  },
  {
    "title": "American manufacturing is in a 3-year rut despite Biden subsidies and Trump protection",
    "description": "The Labor Department reports that American factories shed 7,000 jobs in June for the second month in a row. Manufacturing employment is on track to drop for the third straight year.",
    "link": "https://fortune.com/2025/07/14/american-manufacturing-3-year-rut-biden-subsidies-trump-protection/",
    "timestamp": "2025-07-14T10:38:00Z"
  },
  {
    "title": "Rupee falls 22 paise to settle at 86.02 against US dollar",
    "description": "At the interbank foreign exchange, the local unit opened at 85.96 and traded in a narrow range of 85.92-86.05 before settling at 86.02 (provisional), down 22 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-22-paise-to-settle-at-8602-against-us-dollar/article69810459.ece",
    "timestamp": "2025-07-14T10:36:23Z"
  },
  {
    "title": "Trump envoy arrives in Kyiv as US pledges Patriot missiles to Ukraine",
    "description": "US president Donald Trump's special envoy to Ukraine and Russia has arrived in Kyiv, a senior Ukrainian official said, as anticipation grew over possible changes in the Trump administration's policies on the more than three-year war.",
    "link": "https://www.independent.ie/world-news/north-america/trump-envoy-arrives-in-kyiv-as-us-pledges-patriot-missiles-to-ukraine/a1011829767.html",
    "timestamp": "2025-07-14T10:34:10Z"
  },
  {
    "title": "‘One Big Beautiful Lawsuit’ Seeks To Eliminate Gun Control Law",
    "description": "By Fred Lucas, The Daily Signal | July 11, 2025\nSecond Amendment advocates hope what they dubbed the “One Big Beautiful Lawsuit” will strike a final blow to a near century-old gun control law.\nThe “One Big, Beautiful Bill” that President Donald Trump signed o…",
    "link": "https://biztoc.com/x/27c87ba4351fb0b0",
    "timestamp": "2025-07-14T10:31:51Z"
  },
  {
    "title": "Donald Trump to make historic second state visit to the U.K.",
    "description": "No U.S. president has been invited for a second state visit. President Trump's previous UK state visit was in 2019 when he was hosted by the late Queen Elizabeth II.",
    "link": "https://www.wbaltv.com/article/trump-second-state-visit-uk-windsor-castle/65396020",
    "timestamp": "2025-07-14T10:31:35Z"
  },
  {
    "title": "‘High Probability’ Trump Will Meet With China’s Xi This Year, Rubio Says",
    "description": "By Virginia Allen, The Daily Signal | July 11, 2025\nSecretary of State Marco Rubio says it’s “high probability” President Donald Trump will meet with Chinese leader Xi Jinping sometime this year. \nRubio’s comments came Friday, the same day the secretary of st…",
    "link": "https://biztoc.com/x/67eebc8e37ebb359",
    "timestamp": "2025-07-14T10:31:23Z"
  },
  {
    "title": "Dow futures drop 100 points after Trump slaps 30% tariff on Mexico and the EU: Live updates",
    "description": "U.S. equity futures slid early Monday as Wall Street contends with continued tariff risks and second-quarter earnings on deck.\nFutures for the Dow Jones Industrial Average fell 140 points, or 0.3%. S&P 500 futures and Nasdaq 100 futures also dropped 0.3% each…",
    "link": "https://biztoc.com/x/dcc0b1849be3bb33",
    "timestamp": "2025-07-14T10:31:22Z"
  },
  {
    "title": "10 Monday AM Reads",
    "description": "My morning train WFH reads: • How to invest your enormous inheritance: What do you stand to inherit? It still feels like a question from a different age, despite its growing importance today. In 2025 people across the rich world will inherit some $6trn, or ar…",
    "link": "https://ritholtz.com/2025/07/10-monday-am-reads-436/",
    "timestamp": "2025-07-14T10:30:47Z"
  },
  {
    "title": "“Cried every night”: ICE traumatizes a child with leukemia",
    "description": "The Trump administration is going after easy targets, including sick children, to meet its deportation quotas",
    "link": "https://www.salon.com/2025/07/14/cried-every-night-ice-traumatizes-a-child-with-leukemia/",
    "timestamp": "2025-07-14T10:30:26Z"
  },
  {
    "title": "Buffalo Newspaper Guild cancels event after cartoon depicting Trump supporters, Texas floods sparked backlash",
    "description": "The Buffalo Newspaper Guild canceled an event on Thursday after editorial cartoonist Adam Zyglis sparked backlash with a cartoon depicting a Trump supporter in the Texas floods.",
    "link": "https://www.foxnews.com/media/buffalo-newspaper-guild-cancels-event-after-cartoon-depicting-trump-supporters-texas-floods-sparked-backlash",
    "timestamp": "2025-07-14T10:30:12Z"
  },
  {
    "title": "Brics+ could get the globe to work out a better-balanced world order",
    "description": "It’s noisy, disparate and enlargjng. This group may lack geopolitical cohesion, but it can still serve a purpose that its member countries value. It serves India’s ends too. Whatever Trump makes of it, Brics+ is real and relevant.",
    "link": "https://www.livemint.com/opinion/online-views/brics-egypt-saudi-india-xi-jinping-brazil-putin-donald-trump-international-monetary-fund-imf-united-nations-world-bank-11752330114718.html",
    "timestamp": "2025-07-14T10:30:09Z"
  },
  {
    "title": "Kremlin says weapons and ammunition deliveries to Ukraine from U.S. are continuing",
    "description": "MOSCOW (Reuters) -The Kremlin said on Monday that the big picture of U.S. President Donald Trump remarks about supplying Patriot air defence missiles to...",
    "link": "https://www.yahoo.com/news/kremlin-says-weapons-ammunition-deliveries-102817414.html",
    "timestamp": "2025-07-14T10:28:17Z"
  },
  {
    "title": "Rupee falls to over two-week low on corporate dollar bids, outflows",
    "description": "The Indian rupee weakened past the 86 per U.S. dollar mark on Monday to its lowest level in more than two weeks, weighed by corporate dollar demand and equity-related outflows, traders said, amid uncertainty over U.S. trade policies.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-falls-to-over-two-week-low-on-corporate-dollar-bids-outflows/articleshow/122436628.cms",
    "timestamp": "2025-07-14T10:27:05Z"
  },
  {
    "title": "Epstein case fallout continues",
    "description": "A memo on the convicted sex offender has stirred MAGA backlash.",
    "link": "https://www.usatoday.com/story/news/2025/07/14/epstein-trump-fbi-kentucky-shooting-texas-flood-medicaid-chelsea-wimbledon-love-island-princess-kate/85189289007/",
    "timestamp": "2025-07-14T10:26:08Z"
  },
  {
    "title": "Germany Can’t Blame Trump for Slide in Exports, Bundesbank Finds",
    "description": "Germany’s global export position has deteriorated substantially in recent years, according to research by the Bundesbank, which blames structural issues rather than President Donald Trump’s tariff spree.",
    "link": "https://financialpost.com/pmn/business-pmn/germany-cant-blame-trump-for-slide-in-exports-bundesbank-finds",
    "timestamp": "2025-07-14T10:24:54Z"
  },
  {
    "title": "Iran: Tehran ‘will respond to possible reimposition of UN nuclear sanctions’",
    "description": "No date set for meeting with US special envoy, Iranians say\nThe post Iran: Tehran ‘will respond to possible reimposition of UN nuclear sanctions’ appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/07/14/iran-tehran-will-respond-to-possible-reimposition-of-un-nuclear-sanctions/",
    "timestamp": "2025-07-14T10:23:32Z"
  },
  {
    "title": "Sensex down 1,459 points in 4 days, Nifty slides 2%: What's driving the Indian stock market slump? Here are 4 key reasons",
    "description": "Indian stock markets faced a fourth consecutive day of losses. The Sensex fell by 247 points, closing at 82,253.46. Similarly, the Nifty 50 declined by 67.55 points, settling at 25,082.30. However, midcap and smallcap indices showed resilience amidst the broa…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-down-1459-points-in-4-days-nifty-slides-2-whats-driving-the-indian-stock-market-slump-here-are-4-key-reasons/articleshow/122436333.cms",
    "timestamp": "2025-07-14T10:21:52Z"
  },
  {
    "title": "Zelensky talks air defense in 'productive' meeting with US envoy",
    "description": "U.S. envoy Keith Kellogg arrived in Kiev on Monday for defense talks with senior leadership after U.S. President Donald Trump announced new Patriot air defense systems supplies to Ukraine.",
    "link": "https://www.hurriyetdailynews.com/us-envoy-kellogg-arrives-in-ukraine-for-defense-talks-211447",
    "timestamp": "2025-07-14T10:21:00Z"
  },
  {
    "title": "'It's a pigsty': GOP split as Trump threatens D.C. takeover",
    "description": "WASHINGTON — Some Republicans on Capitol Hill are all but daring President Donald Trump to take control of the local government that oversees Washington D.C. Others in the GOP are aghast at the idea, which Trump teased again last week. “We have tremendous pow…",
    "link": "https://www.rawstory.com/raw-investigates/2673092229/",
    "timestamp": "2025-07-14T10:20:48Z"
  },
  {
    "title": "Crypto bills set to advance this week take industry closer to mainstream",
    "description": "The crypto industry will take a step closer to going mainstream this week as a series of industry-friendly bills progress through Congress, paving the way for digital assets to potentially be further integrated into traditional finance. The House of Represent…",
    "link": "https://www.channelnewsasia.com/business/crypto-bills-set-advance-week-take-industry-closer-mainstream-5237246",
    "timestamp": "2025-07-14T10:20:42Z"
  },
  {
    "title": "Mother of slain soldier held by Hamas terrorists for 4K days makes plea to Trump",
    "description": "The family of an Israeli soldier killed by Hamas in 2014 urges President Donald Trump and Saudi leaders to ensure no deal proceeds without the return of all the hostages held in Gaza and her son's remains.",
    "link": "https://www.foxnews.com/world/mother-slain-soldier-held-by-hamas-terrorists-4000-days-makes-plea-trump",
    "timestamp": "2025-07-14T10:19:27Z"
  },
  {
    "title": "DNC Chair Ken Martin lies about lying (support for Mamdani and Global Intifada)",
    "description": "Ken Martin is the Chairman of the Democrat National Committee (DNC). He's the primary fundraiser and spokesman for America’s Democrats. Zohran Mamdani is the Democrat Party’s candidate to be the next Mayor of New York City. Mamdani has been caught cheerleadin…",
    "link": "https://freerepublic.com/focus/f-news/4328571/posts",
    "timestamp": "2025-07-14T10:18:27Z"
  },
  {
    "title": "Eric Trump to headline Bitcoin Asia 2025 conference in Hong Kong",
    "description": "The August event comes as the race for crypto supremacy has intensified, with both Hong Kong and the US moving to legalise stablecoins Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/14/eric-trump-to-headline-bitcoin-asia-2025-conference-in-hong-kong",
    "timestamp": "2025-07-14T10:18:00Z"
  },
  {
    "title": "Trump envoy arrives in Kyiv as president pledges Patriot missiles to Ukraine",
    "description": "U.S. President Donald Trump’s special envoy to Ukraine and Russia, retired Lt.",
    "link": "https://www.nbcnews.com/world/europe/trump-envoy-arrives-kyiv-president-pledges-patriot-missiles-ukraine-rcna218599",
    "timestamp": "2025-07-14T10:17:58Z"
  },
  {
    "title": "Trump admin live updates: Trump, NATO secretary-general to meet at White House",
    "description": "President Donald Trump is scheduled to welcome NATO Secretary-General Mark Rutte to the White House on Monday.",
    "link": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123730069",
    "timestamp": "2025-07-14T10:17:02Z"
  },
  {
    "title": "Wall St futures wobble on fresh tariff threats ahead of data, earnings deluge",
    "description": "Over the weekend, Trump announced plans to slap a 30% tariff on most imports from the EU and Mexico starting August 1, adding similar warnings to other...",
    "link": "https://finance.yahoo.com/news/wall-st-futures-wobble-fresh-101649549.html",
    "timestamp": "2025-07-14T10:16:49Z"
  },
  {
    "title": "Explainer-Why Trump's push for a 1% Fed policy rate could spell trouble for US economy",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump says the Federal Reserve should set its benchmark interest rate at 1% to lower government borrowing costs, ...",
    "link": "https://finance.yahoo.com/news/explainer-why-trumps-push-1-101505091.html",
    "timestamp": "2025-07-14T10:15:05Z"
  },
  {
    "title": "World shares are mixed as investors focus on tariffs and earnings",
    "description": "World shares are mixed as investors focus on tariffs and corporate earnings updates",
    "link": "https://abcnews.go.com/Business/wireStory/world-shares-mixed-investors-focus-tariffs-earnings-123729131",
    "timestamp": "2025-07-14T10:14:31Z"
  },
  {
    "title": "US manufacturers are stuck in a rut despite subsidies and protection from Trump",
    "description": "Democratic President Joe Biden handed out subsidies to chipmakers and electric vehicle manufacturers",
    "link": "https://abcnews.go.com/Business/wireStory/us-manufacturers-stuck-rut-despite-subsidies-biden-protection-123730354",
    "timestamp": "2025-07-14T10:14:29Z"
  },
  {
    "title": "New York creates tariff guide for local businesses",
    "description": "The guide will update business owners on programs available to help manage the impact of tariffs",
    "link": "https://www.mynbc5.com/article/state-makes-tariff-resource-guide-for-new-york-businesses/65395113",
    "timestamp": "2025-07-14T10:12:34Z"
  },
  {
    "title": "Trump administration leaves Congress in dark on spending decisions",
    "description": "Cleveland Heights faces after-school program cuts due to held-up federal funds. Superintendent Elizabeth Kirby expresses concern over the missing $860,000 grant. The Trump administration's spending transparency is under scrutiny. Republican Senator Susan Coll…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-leaves-congress-in-dark-on-spending-decisions/articleshow/122436267.cms",
    "timestamp": "2025-07-14T10:12:27Z"
  },
  {
    "title": "Why Trump's push for a 1% Fed policy rate could spell trouble for US economy",
    "description": "President Trump advocated for a 1% Federal Reserve interest rate to lower government borrowing costs, but experts warn this could backfire. Such a low rate, typically a crisis response, could reignite inflation and erode investor confidence, especially with a…",
    "link": "https://economictimes.indiatimes.com/news/international/business/why-trumps-push-for-a-1-fed-policy-rate-could-spell-trouble-for-us-economy/articleshow/122436266.cms",
    "timestamp": "2025-07-14T10:12:21Z"
  },
  {
    "title": "Unusual meeting: Knesset subcommittee to discuss sovereignty in Judea and Samaria",
    "description": "Representatives from key Israeli ministries to present practical implications of applying sovereignty in Judea and Samaria at special Knesset subcommittee meeting.",
    "link": "https://www.israelnationalnews.com/news/411636",
    "timestamp": "2025-07-14T10:10:52Z"
  },
  {
    "title": "Trade Chief Issues Trump Tariff Warning: 'Almost Impossible'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe European Union's (EU) trade chief Maros Sefcovic warned trading between the 27-member bloc and the U.S. would become \"almost impossible\" if President Donald Trump's 30 percent tariff takes effect on August…",
    "link": "https://biztoc.com/x/9f39a1e54ff8ac17",
    "timestamp": "2025-07-14T10:09:20Z"
  },
  {
    "title": "Trump Accepts King Charles' Invite For Rare Second State Visit To UK—Amid Political Backlash",
    "description": "President Donald Trump has accepted an invitation from King Charles III for a second state visit to the United Kingdom in mid-September.\nWhat Happened: The U.S. President and First Lady, Melania Trump, will be hosted by the British monarch from Sept. 17 to 19…",
    "link": "https://biztoc.com/x/92c917d01d019813",
    "timestamp": "2025-07-14T10:09:17Z"
  },
  {
    "title": "Trump said to contact senators about $9.4B spending cut",
    "description": "United States President Donald Trump is getting more involved with the recessions bill, which would entail a $9.4 billion spending cut in funding for foreign aid and public broadcasting, by talking di...",
    "link": "https://biztoc.com/x/ba08b368e6879765",
    "timestamp": "2025-07-14T10:09:14Z"
  },
  {
    "title": "Trump makes final blitz on rescissions",
    "description": "President Donald Trump is getting directly involved in the $9.4 billion rescissions measure this week and talking to senators directly, people familiar with the matter said.\nSenators are also bracing for him to erupt if the federal cuts fail, and the White Ho…",
    "link": "https://biztoc.com/x/544429b8900350cf",
    "timestamp": "2025-07-14T10:09:11Z"
  },
  {
    "title": "Map and List of Cities Hosting Anti-Trump Protests on July 17",
    "description": "Voice is AI-generated. Inconsistencies may occur.\n\"Good Trouble Lives On\" demonstrations against President Donald Trump and his administration's policies are scheduled to take place across the U.S. on July 17.\nWhy It Matters\nThe upcoming protests follow other…",
    "link": "https://biztoc.com/x/61bbf2b8949294d2",
    "timestamp": "2025-07-14T10:09:06Z"
  },
  {
    "title": "Keohokalole mulling challenging Case for Congress | Honolulu Star-Advertiser",
    "description": "State Sen. Jarrett Keohokalole — the father of three school-age children — may challenge incumbent U.S. Rep. Ed Case to represent urban Honolulu in the 2026 midterm elections, and continues to weigh the need to “right the ship” in Washington, D.C., versus wha…",
    "link": "https://www.staradvertiser.com/2025/07/14/hawaii-news/keohokalole-mulling-challenging-case-for-congress/",
    "timestamp": "2025-07-14T10:08:44Z"
  },
  {
    "title": "Two-thirds of the Department of Justice unit defending Trump's policies in court have quit",
    "description": "The U.S. Justice Department's Federal Programs Branch, tasked with defending Trump administration policies, has experienced a significant staff exodus, losing nearly two-thirds of its lawyers. This mass departure stems from demoralization over defending polic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/two-thirds-of-the-department-of-justice-unit-defending-trumps-policies-in-court-have-quit/articleshow/122436166.cms",
    "timestamp": "2025-07-14T10:08:14Z"
  },
  {
    "title": "Two-thirds of the DOJ unit defending Trump policies in court have quit",
    "description": "The U.S. Justice Department unit charged with defending against legal challenges to signature Trump administration policies - such as restricting birthright ...",
    "link": "https://ca.news.yahoo.com/two-thirds-doj-unit-defending-100732240.html",
    "timestamp": "2025-07-14T10:07:32Z"
  },
  {
    "title": "George Conway Spots 'More Evidence We Have A Ding-A-Ling President' In Trump",
    "description": "The conservative attorney responded to a suggestion from the president.",
    "link": "https://www.huffpost.com/entry/george-conway-donald-trump-floods_n_6874cc3ee4b00af0c5f24581",
    "timestamp": "2025-07-14T10:06:48Z"
  },
  {
    "title": "Is America losing its intelligence?",
    "description": "Under Donald Trump, US intelligence agencies face politicization, with loyalty prioritized over objective assessments. This shift, marked by pressure to align with Trump's narratives and the removal of dissenting voices, risks undermining the integrity and ef…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-america-losing-its-intelligence/articleshow/122436036.cms",
    "timestamp": "2025-07-14T10:06:15Z"
  },
  {
    "title": "Club World Cup serves as 2026 dry run amid heat and pitch concerns",
    "description": "NEW YORK :The inaugural 32-team Club World Cup wrapped up on Sunday with plenty of lessons learned for organisers FIFA, with the tournament in the United States, won by Chelsea, acting as a preview of the 2026 World Cup. A record 48 teams will descend on co-h…",
    "link": "https://www.channelnewsasia.com/sport/club-world-cup-serves-2026-dry-run-amid-heat-and-pitch-concerns-5237221",
    "timestamp": "2025-07-14T10:05:56Z"
  },
  {
    "title": "Ron DeSantis claims ‘zero’ environmental impact by Alligator Alcatraz. That’s false",
    "description": "The name for Florida’s migrant detention center, Alligator Alcatraz, is a nod to the facility’s remote location atop an idle airstrip in the Florida Everglades teeming with alligators and pythons. […]\nThe post Ron DeSantis claims ‘zero’ environmental impact b…",
    "link": "https://www.poynter.org/fact-checking/2025/ron-desantis-claims-zero-environmental-impact-alligator-alcatraz/",
    "timestamp": "2025-07-14T10:05:23Z"
  },
  {
    "title": "Under Trump, the government mobilizes in response to fringe theories (Naftali Bendavid/Washington Post)",
    "description": "Naftali Bendavid / Washington Post:\nUnder Trump, the government mobilizes in response to fringe theories  —  Trump officials have assigned government workers and spent taxpayer dollars to address conspiracy theories and easily-disproven assertions  —  After P…",
    "link": "https://www.memeorandum.com/250714/p5",
    "timestamp": "2025-07-14T10:05:01Z"
  },
  {
    "title": "Tucker Carlson leads MAGA's worried warriors in questioning Trump (Allan Smith/NBC News)",
    "description": "Allan Smith / NBC News:\nTucker Carlson leads MAGA's worried warriors in questioning Trump  —  The former Fox News host and “America First” leader spoke with NBC News as MAGA influencers rebel over amnesty, Iran and the Epstein files.  —  As President Donald T…",
    "link": "https://www.memeorandum.com/250714/p3",
    "timestamp": "2025-07-14T10:05:01Z"
  },
  {
    "title": "Pentagon Scrubs Metallica Track from Hegseth Drone Video After Copyright Warning",
    "description": "The Pentagon was forced to scrub and repost Hegseth’s “drone dominance” video, posted last week, after Metallica successfully demanded the removal of one of their songs.\nThe post Pentagon Scrubs Metallica Track from Hegseth Drone Video After Copyright Warning…",
    "link": "https://www.mediaite.com/media/news/pentagon-scrubs-metallica-track-from-hegseth-drone-video-after-copyright-warning/",
    "timestamp": "2025-07-14T10:03:44Z"
  },
  {
    "title": "Trade Chief Issues Trump Tariff Warning: 'Almost Impossible'",
    "description": "President Donald Trump said a 30 percent tariff was coming for goods imported from the bloc.",
    "link": "https://www.newsweek.com/trump-trade-tariffs-eu-2098535",
    "timestamp": "2025-07-14T10:01:45Z"
  },
  {
    "title": "How Lyndon Johnson Moved the Nation Forward on Immigration",
    "description": "The president beat out nativist arguments to dismantle a national quota system.",
    "link": "http://foreignpolicy.com/2025/07/14/immigrant-heritage-lyndon-johnson-nationality-act/",
    "timestamp": "2025-07-14T10:00:41Z"
  },
  {
    "title": "Zohran Mamdani's 'free' promises are too good to be true, young conservatives warn",
    "description": "Attendees at Turning Point USA's Tampa summit expressed concerns that democratic socialist Zohran Mamdani's policies for New York City could push the country in the wrong direction.",
    "link": "https://www.foxnews.com/media/zohran-mamdanis-free-promises-too-good-true-young-conservatives-warn",
    "timestamp": "2025-07-14T10:00:33Z"
  },
  {
    "title": "Here's how we take America First to the United Nations",
    "description": "Trump's U.N. ambassador nominee Mike Waltz would focus on reforming ineffective peacekeeping missions, dismantling UNRWA and combating antisemitism at the United Nations.",
    "link": "https://www.foxnews.com/opinion/heres-how-we-take-america-first-united-nations",
    "timestamp": "2025-07-14T10:00:32Z"
  },
  {
    "title": "Trump's whirlwind week ahead to include meeting with NATO chief, 'major' announcement on Russia",
    "description": "President Donald Trump is anticipated to meet with NATO chief Mark Rutte, make a \"major\" announcement on Russia, and join an AI and energy summit during his 26th week in office.",
    "link": "https://www.foxnews.com/politics/trumps-whirlwind-week-ahead-include-meeting-nato-chief-major-announcement-russia",
    "timestamp": "2025-07-14T10:00:22Z"
  },
  {
    "title": "The Democratic Revival Starts With a Non-Democrat",
    "description": "The Democratic Party’s revival in 2026 will depend a great deal on Nebraska Senate candidate Dan Osborn, who is running not as a Democrat but as an independent, Ross Barkan writes.",
    "link": "http://nymag.com/intelligencer/article/nebraska-senate-candidate-dan-osborn-could-revive-democrats.html",
    "timestamp": "2025-07-14T10:00:16Z"
  },
  {
    "title": "Targeted by Trump, George Mason president fears “orchestrated” campaign",
    "description": "There are signs a new Trump Education Department probe is part of a coordinated campaign to oust Gregory Washington.",
    "link": "https://www.salon.com/2025/07/14/targeted-by-trump-george-mason-president-fears-orchestrated-campaign/",
    "timestamp": "2025-07-14T10:00:04Z"
  },
  {
    "title": "Map and List of Cities Hosting Anti-Trump Protests on July 17",
    "description": "Hundreds of \"Good Trouble Lives On\" protests are planned to take place on the anniversary of the death of the late civil rights icon and congressman John Lewis.",
    "link": "https://www.newsweek.com/map-list-cities-anti-trump-protests-july-17-2096597",
    "timestamp": "2025-07-14T10:00:01Z"
  },
  {
    "title": "Will the Epstein Story Hurt Trump in MAGA-Land? Wake Up—It Already Has",
    "description": "So, Kash Patel told us over the\nweekend that the Jeffrey Epstein “conspiracy theories just aren’t true” and\n“never have been.” If you’re thinking, “Hey, wait a second; isn’t that the same\nKash Patel who spent years promoting those exact conspiracy theories—an…",
    "link": "https://newrepublic.com/article/197901/epstein-trump-maga-conspiracy-theory",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "How Much More “TACO” Madness Can the U.S. Economy Take?",
    "description": "John Cassidy on how the stock market’s record-setting run suggests Wall Street isn’t taking Donald Trump’s tariffs seriously—but they are already harming the economy.",
    "link": "https://www.newyorker.com/news/the-financial-page/how-much-more-taco-madness-can-the-us-economy-take",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "Posts claim photo shows Trump and Epstein with minor girl. Here's the truth",
    "description": "An image authentically showed Jeffrey Epstein posing with U.S. President Donald Trump and a young girl.",
    "link": "https://www.snopes.com//fact-check/photo-trump-epstein-minor-girl/",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "Federal tax incentives could mean more tech research and innovation",
    "description": "Marketplace’s Meghan McCarty Carino speaks with Rebecca Lester, a professor of accounting at Stanford, about a tax provision within the One Big Beautiful Bill Act that could further tech R&D and innovation.",
    "link": "https://www.marketplace.org/episode/2025/07/14/federal-tax-incentives-could-mean-more-tech-research-and-innovation",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "The Stealth Attack on Women in Trump's Budget Bill",
    "description": "The most obvious aspect of President Donald Trump’s big tax cut and spending package is that it engineers a massive transfer of wealth and resources from the working class to the wealthy, along the way guaranteeing that the country will become both a less saf…",
    "link": "https://newrepublic.com/article/197653/trump-trad-wife-agenda-women",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "My colleagues in Congress are making a mistake advancing these crypto bills",
    "description": "This week, the House will consider crypto bills, including the so-called CLARITY Act and GENIUS Act, which proponents say will benefit consumers and investors.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/colleagues-congress-are-making-mistake-advancing-crypto-bills-rcna218266",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "Americans have had enough of Trump's immigration policy",
    "description": "A new Gallup poll shows Americans support immigration by record numbers in the face of President Donald Trump's increased ICE raids and mass deportation camps",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-mass-deportation-poll-immigration-rcna218321",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "What I Inherited from My Criminal Great-Grandparents",
    "description": "Jessica Winter on researching her family genealogy and learning that her ancestor Selma Winter, and her husband, Anton Winter, created and used counterfeit money.",
    "link": "https://www.newyorker.com/magazine/2025/07/21/what-i-inherited-from-my-criminal-great-grandparents",
    "timestamp": "2025-07-14T10:00:00Z"
  },
  {
    "title": "The challenger who narrowly lost to GOP Rep. Scott Perry wants another chance to beat him in 2026",
    "description": "Democrat Janelle Stelson is challenging Republican U.S. Rep. Scott Perry again after losing to him in 2024 by barely a percentage point in a right-leaning congressional district in Pennsylvania",
    "link": "https://abcnews.go.com/Politics/wireStory/challenger-narrowly-lost-gop-rep-scott-perry-chance-123729779",
    "timestamp": "2025-07-14T09:58:27Z"
  },
  {
    "title": "Trump says he’s ‘giving serious consideration to taking away’ Rosie O’Donnell’s U.S. citizenship",
    "description": "President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government.\n“Because of the f…",
    "link": "https://biztoc.com/x/cb83148b685595b6",
    "timestamp": "2025-07-14T09:57:58Z"
  },
  {
    "title": "Gold and Silver Jump as Investors Chase Havens",
    "description": "8 min ago\nGold and Silver Jump as Investors Chase Havens\nGold and silver prices climbed Monday as investors turned toward haven assets as President Donald Trump ramped up tariff threats on the European Union and Mexico.\nGold futures rose 0.5% to $3,379 per ou…",
    "link": "https://biztoc.com/x/66487ef8665a7c6e",
    "timestamp": "2025-07-14T09:57:53Z"
  },
  {
    "title": "Crypto exchanges rushed to list Trump's coin leaving many losers and some big winners",
    "description": "Coinbase and major crypto exchanges listed Trump’s $TRUMP meme coin unusually fast, despite claiming rigorous vetting. The coin saw massive hype, insider concentration, and sharp price swings, raising investor protection concerns. Exchanges cited overwhelming…",
    "link": "https://economictimes.indiatimes.com/tech/technology/crypto-exchanges-rushed-to-list-trumps-coin-leaving-many-losers-and-some-big-winners/articleshow/122435912.cms",
    "timestamp": "2025-07-14T09:57:11Z"
  },
  {
    "title": "Indian exports to US to become more competitive after hike in tariffs on China, other countries",
    "description": "India has hardened its position on the US demand for duty concessions on agri and dairy products. New Delhi has, so far, not given any duty concessions to any of its trading partners in a free trade agreement in the dairy sector",
    "link": "https://www.thehindubusinessline.com/economy/indian-exports-to-us-to-become-more-competitive-after-hike-in-tariffs-on-china-other-countries/article69810341.ece",
    "timestamp": "2025-07-14T09:55:50Z"
  },
  {
    "title": "Breitbart News Hosting Policy Event with Treasury Secretary Scott Bessent",
    "description": "Breitbart News is hosting a policy event with Treasury Secretary Scott Bessent, shortly after Republicans in Congress rallied to make President Donald Trump's America First agenda a reality with the passage and subsequent signing of the \"big, beautiful bill.\"…",
    "link": "https://www.breitbart.com/politics/2025/07/14/breitbart-news-hosting-policy-event-with-treasury-secretary-scott-bessent/",
    "timestamp": "2025-07-14T09:55:39Z"
  },
  {
    "title": "One state's bold fight against classroom indoctrination targets woke 'welcome' signs",
    "description": "The debate over 'Everyone Is Welcome Here' signs in Idaho schools highlights tensions between parental authority and DEI-related classroom displays",
    "link": "https://www.foxnews.com/opinion/one-states-bold-fight-against-classroom-indoctrination-targets-woke-welcome-signs",
    "timestamp": "2025-07-14T09:55:32Z"
  },
  {
    "title": "Stocks Set to Open Lower as Trump Ratchets Up Tariff Threats, U.S. Inflation Data and Big Bank Earnings Awaited",
    "description": "September S&P 500 E-Mini futures (ESU25) are down -0.29%, and September Nasdaq 100 E-Mini futures (NQU25) are down -0.30% this morning, pointing to a lower...",
    "link": "https://www.barchart.com/story/news/33380911/stocks-set-to-open-lower-as-trump-ratchets-up-tariff-threats-u-s-inflation-data-and-big-bank-earnings-awaited",
    "timestamp": "2025-07-14T09:54:35Z"
  }
]