[
  {
    "title": "Türkiye emerges as possible venue for US-Iran talks: Report",
    "description": "The White House is open to engaging Iran through diplomatic channels in pursuit of a possible agreement to ease tensions, with Türkiye emerging as a potential venue for the talks, U.S. media has reported.",
    "link": "https://www.hurriyetdailynews.com/turkiye-emerges-as-possible-venue-for-us-iran-talks-report-218501",
    "timestamp": "2026-02-02T11:22:56Z"
  },
  {
    "title": "Share Market Highlights Feb 2: Benchmarks surge over 1%; Sensex ends at 81,666, Nifty above 25,000",
    "description": "Sensex, Nifty updates on 02 February 2026: Closing bell: Indian equity benchmarks rebounded on Monday after Sunday’s budget-day slump. The Sensex rose 1.17% to 81,666.46 and Nifty 50 climbed 1.06% to 25,088.4, led by gains in infrastructure stocks and Relianc…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-highlights-february-2-2026/article70580156.ece",
    "timestamp": "2026-02-02T11:20:54Z"
  },
  {
    "title": "No new targeted Russian strikes on Ukrainian energy infrastructure, Zelenskiy says",
    "description": "KYIV, Feb 2 (Reuters) - Russia has not carried out any targeted missile or drone strikes on Ukrainian energy infrastructure in the last 24 hours although energy facilitie… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/no-new-targeted-russian-strikes-on-ukrainian-energy-infrastructure-zelenskiy-says",
    "timestamp": "2026-02-02T11:17:11Z"
  },
  {
    "title": "Iran weighs nuclear diplomacy with US; gaps over missiles remain",
    "description": "Tensions are ⁠running high amid a military buildup by the U.S. Navy near Iran, following a violent crackdown against anti-government demonstrations last month, the deadliest domestic unrest in Iran since its 1979 revolution.",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-weighs-nuclear-diplomacy-with-us-gaps-over-missiles-remain/articleshow/127860669.cms",
    "timestamp": "2026-02-02T11:16:38Z"
  },
  {
    "title": "Iran Edges Toward Nuclear Talks With USA in Bid to Avoid War",
    "description": "Iran said talks with the U.S. over a new nuclear deal could get underway in coming days.",
    "link": "https://www.rigzone.com/news/wire/iran_edges_toward_nuclear_talks_with_usa_in_bid_to_avoid_war-02-feb-2026-182902-article/",
    "timestamp": "2026-02-02T11:16:05Z"
  },
  {
    "title": "Trump Eyes Iran Nuclear Deal",
    "description": "U.S. President Donald Trump said he anticipated talks with Iran over a new nuclear deal in the coming days.",
    "link": "https://www.rigzone.com/news/wire/trump_eyes_iran_nuclear_deal-02-feb-2026-182902-article/",
    "timestamp": "2026-02-02T11:16:05Z"
  },
  {
    "title": "Iran Hopes Diplomacy Push Will Avert War With USA",
    "description": "On Sunday Trump said American naval assets were 'a couple of days' away from Iran.",
    "link": "https://www.rigzone.com/news/wire/iran_hopes_diplomacy_push_will_avert_war_with_usa-02-feb-2026-182902-article/",
    "timestamp": "2026-02-02T11:16:05Z"
  },
  {
    "title": "Japan deep-sea hunt finds rare earths as it seeks to cut reliance on China",
    "description": "Tokyo proclaims Pacific Ocean mission world’s first attempt to tap rare earths at such a depth.",
    "link": "https://www.aljazeera.com/news/2026/2/2/japan-deep-sea-hunt-finds-rare-earths-as-it-seeks-to-cut-reliance-on-china",
    "timestamp": "2026-02-02T11:09:24Z"
  },
  {
    "title": "Donald Trump to shut Kennedy Center for two years of renovations",
    "description": "US president says reconstruction has already been financed in full but did not offer any details",
    "link": "https://www.irishtimes.com/world/us/2026/02/02/donald-trump-to-shut-kennedy-center-for-two-years-of-renovations/",
    "timestamp": "2026-02-02T11:08:44Z"
  },
  {
    "title": "Why are oil prices down by 5% and will it continue to fall or rise again? Oil prices slide, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Why are oil prices down by 5% and will it continue to fall or rise again? Oil prices dropped after comments from US President Donald Trump on Iran talks. Brent and WTI crude fell from recent highs. A stronger US dollar, profit-taking, and OPEC+ decisions also…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-are-oil-prices-down-by-5-and-will-it-continue-to-fall-or-rise-again-oil-prices-slide-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/127859467.cms",
    "timestamp": "2026-02-02T11:06:41Z"
  },
  {
    "title": "MAGA Thoroughly Flips Out Over Anti-Trump Moments At Grammys",
    "description": "One particular protest really got under their skin.",
    "link": "https://www.huffpost.com/entry/maga-grammys_n_698079f0e4b009bf7bdd36ed",
    "timestamp": "2026-02-02T11:02:33Z"
  },
  {
    "title": "Treasury yields fall as investors weigh Fed leadership uncertainty",
    "description": "U.S. Treasury yields were lower Monday as market watchers continued to weigh President Donald Trump naming Kevin Warsh as his pick for the next Fed chair.",
    "link": "https://www.cnbc.com/2026/02/02/treasury-yields-investors-fed-leadership-uncertainty.html",
    "timestamp": "2026-02-02T11:01:20Z"
  },
  {
    "title": "The New Politics of the AI Apocalypse",
    "description": "In a new essay titled ‘The Adolescence of Technology,’ Anthropic CEO Dario Amodei warns about the technology and ideologies of the future. But he seems most distressed about the politics of today.",
    "link": "http://nymag.com/intelligencer/article/dario-amodeis-warnings-about-ai-are-about-politics-too.html",
    "timestamp": "2026-02-02T11:00:40Z"
  },
  {
    "title": "ICE, anticipation and $5,000 tickets: Guardian readers on their World Cup hopes and concerns",
    "description": "With less than six months until kickoff, Guardian readers share their experiences of buying World Cup tickets – or deciding not to",
    "link": "https://sports.yahoo.com/articles/ice-anticipation-5-000-tickets-110012264.html",
    "timestamp": "2026-02-02T11:00:12Z"
  },
  {
    "title": "Trump administration plans to write regulations using AI",
    "description": "“We don’t need the perfect rule,” said top Transportation Department lawyer. “We want good enough.”",
    "link": "https://www.salon.com/2026/02/02/trump-administration-plans-to-write-regulations-using-ai/",
    "timestamp": "2026-02-02T11:00:05Z"
  },
  {
    "title": "Democrats Should Take Control on Immigration",
    "description": "Last week, Senate Democrats made a deal with Senate Republicans to fund the Department of Homeland Security for only two more weeks while they hash out new accountability measures for Immigration and Customs Enforcement and Border Patrol agents, in the wake o…",
    "link": "https://newrepublic.com/article/205987/democrats-immigration-ice-funding",
    "timestamp": "2026-02-02T11:00:00Z"
  },
  {
    "title": "Trump’s Lawsuit Against the IRS Is Even More Outrageous Than It Seems",
    "description": "Last week Donald Trump filed suit against the Internal Revenue Service, demanding $10 billion in compensation for the unauthorized disclosure of his taxes in September 2020. Oftentimes a news story will seem outrageous at first glance but, on closer inspectio…",
    "link": "https://newrepublic.com/article/205998/trump-lawsuit-irs-more-outrageous",
    "timestamp": "2026-02-02T11:00:00Z"
  },
  {
    "title": "Why This Might Be a Grim Week\nfor the Haitians of Springfield, Ohio",
    "description": "You will recall, I’m sure, the\nstory of the Haitian community of Springfield, Ohio that arose during the most\nrecent presidential campaign. It started in July 2024, when JD Vance—just days\nbefore Donald Trump tapped him as his vice-presidential nominee—began …",
    "link": "https://newrepublic.com/article/206000/trump-ice-haitians-springfield-ohio",
    "timestamp": "2026-02-02T11:00:00Z"
  },
  {
    "title": "5 LGBTQ+ moments that defined the 2026 Grammys",
    "description": "From jaw-dropping red carpet looks to major award wins, the 2026 Grammy awards were a sizeable success for queer musicians everywhere. Huge queer stars including Lady Gaga and Lola Young won some of the night’s biggest accolades, while other LGBTQ+ musicians …",
    "link": "https://www.thepinknews.com/2026/02/02/5-lgbtq-moments-that-defined-the-2026-grammys/",
    "timestamp": "2026-02-02T10:58:48Z"
  },
  {
    "title": "The hedge fund strategies investors desire most in 2026 — and the 3 charts that show why",
    "description": "Hedge fund allocators can't get enough of quant and macro trading. Quants accounted for more than 70% of the industry's net inflows last year.",
    "link": "https://www.businessinsider.com/top-hedge-fund-strategies-allocators-love-for-2026-2026-2",
    "timestamp": "2026-02-02T10:54:01Z"
  },
  {
    "title": "Oil Plunges as Iran Risks Ease and Commodities Selloff Deepens",
    "description": "Oil plunged as geopolitical risk premiums faded after US President Donald Trump said Washington is talking with Iran, while a broader commodities selloff exacerbated the slide.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-plunges-as-iran-risks-ease-and-commodities-selloff-deepens",
    "timestamp": "2026-02-02T10:46:34Z"
  },
  {
    "title": "US envoy Witkoff to visit Israel, meet Netanyahu, Israeli officials say",
    "description": "JERUSALEM, Feb 2 (Reuters) - U.S. President Donald Trump’s senior envoy Steve Witkoff is expected to visit Israel for meetings with Prime Minister Benjamin Netanyahu and … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/us-envoy-witkoff-to-visit-israel-meet-netanyahu-israeli-officials-say",
    "timestamp": "2026-02-02T10:45:24Z"
  },
  {
    "title": "NATO Is Doing Military Exercises—Without America. That Does Not Mean Anything Good.",
    "description": "The rupture deepens.",
    "link": "https://slate.com/news-and-politics/2026/02/nato-exercise-without-america-rupture-europe.html",
    "timestamp": "2026-02-02T10:45:00Z"
  },
  {
    "title": "The man who scared off gold and silver bulls",
    "description": "A sudden shift in US Federal Reserve leadership expectations triggered a violent reversal in precious metals. Gold and silver, previously buoyed by dollar pessimism and a desire for loose monetary policy, experienced sharp declines. The nomination of Kevin Wa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/gold-and-silver-prices-kevin-warsh-federal-reserve-the-man-who-scared-off-bulls-metal-prices/articleshow/127858596.cms",
    "timestamp": "2026-02-02T10:35:02Z"
  },
  {
    "title": "UN Nuclear Watchdog Discusses Risks to Ukraine’s Nuclear Safety After Russian Strikes",
    "description": "The U.N. atomic watchdog’s board held a special session Friday to discuss risks to nuclear safety in Ukraine as concerns mount that relentless Russian attacks on its energy infrastructure pose an increasing danger of a nuclear accident. The urgent meeting …",
    "link": "https://www.insurancejournal.com/news/international/2026/02/02/856451.htm",
    "timestamp": "2026-02-02T10:32:20Z"
  },
  {
    "title": "Grammy Awards: Bad Bunny makes history with Album of the Year win as ICE protests take centre stage",
    "description": "Grammy Awards: Bad Bunny makes history with Album of the Year win as ICE protests take centre stage7news.com.au",
    "link": "https://7news.com.au/entertainment/grammy-awards-bad-bunny-makes-history-with-album-of-the-year-win-as-ice-protests-centre-stage-c-21502631",
    "timestamp": "2026-02-02T10:31:49Z"
  },
  {
    "title": "Why the Swedish krona’s rise might be nearing its end",
    "description": "The US dollar has dropped in value while the Swedish krona has risen in recent months, but forecasts from a number of banks predict the krona might have reached a plateau.",
    "link": "https://www.thelocal.se/20260202/why-the-swedish-kronas-rise-might-be-nearing-its-end",
    "timestamp": "2026-02-02T10:26:12Z"
  },
  {
    "title": "Nicki Minaj fires homophobic abuse at Grammys host after Trump comment",
    "description": "Nicki Minaj, Donald Trump’s “number one fan”, has fired homophobic abuse at Grammys host Trevor Noah after he poked fun at her support for the Republican president.  On Sunday (1 February), Noah, who returned to host the Grammys for the sixth year, made a com…",
    "link": "https://www.thepinknews.com/2026/02/02/nicki-minaj-fires-homophobic-abuse-at-grammys-host-after-trump-comment/",
    "timestamp": "2026-02-02T10:26:04Z"
  },
  {
    "title": "Trump threatens legal action over Noah's Grammys gag",
    "description": "US President Donald Trump has threatened legal action against comedian Trevor Noah after a joke the host made about Jeffrey Epstein during the Grammy Awards.",
    "link": "https://www.rte.ie/entertainment/2026/0202/1556348-trump-threatens-legal-action-over-noahs-grammys-gag/",
    "timestamp": "2026-02-02T10:22:37Z"
  },
  {
    "title": "Conservatives push for EU to use mutual defense clause",
    "description": "European People's Party to examine how to implement defense clause as response to actions of Donald Trump.",
    "link": "https://www.politico.eu/article/conservatives-push-eu-use-mutual-defense-clause/",
    "timestamp": "2026-02-02T10:19:23Z"
  },
  {
    "title": "Elon Musk called on corporations to ditch Delaware. They didn't listen.",
    "description": "A handful of billionaires and prominent companies urged corporations to leave Delaware. According to the numbers, the opposite happened.",
    "link": "https://www.businessinsider.com/elon-musk-delaware-dexit-exodus-corporations-law-trends-2026-2",
    "timestamp": "2026-02-02T10:17:01Z"
  },
  {
    "title": "Trump Has Killed American Deterrence",
    "description": "Deterrence fails not only when threats to act or retaliate lack credibility, but when the absence of credibility tempts adversaries into recklessness. A leader like Donald Trump, who cannot commit and is disloyal to even his closest allies, is not merely inef…",
    "link": "https://www.project-syndicate.org/commentary/us-national-defense-strategy-lacks-credible-commitment-by-stephen-holmes-2026-02",
    "timestamp": "2026-02-02T10:09:10Z"
  },
  {
    "title": "How to trade the market spiral as investors dump gold, silver and oil",
    "description": "Analysts flagged U.S. President Donald Trump’s nomination for the next chair of the Federal Reserve as a key trigger to the latest market downturn.",
    "link": "https://www.cnbc.com/2026/02/02/gold-silver-oil-prices-fed-warsh-markets-investors.html",
    "timestamp": "2026-02-02T10:06:46Z"
  },
  {
    "title": "Israeli Ceasefire Breaches in Gaza Jeopardize Peace Settlement - Egyptian Foreign Ministry",
    "description": "Israel's repeated ceasefire violations in the Gaza Strip undermine prospects for a political conflict resolution, the Egyptian Foreign Ministry said.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260201-sputnik01.htm",
    "timestamp": "2026-02-02T10:05:41Z"
  },
  {
    "title": "SAFE: A turning point for the security of Poland and Europe",
    "description": "The European Commission has approved Poland's request for the disbursement of funds from the SAFE programme for defence investments.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260127-govplpm01.htm",
    "timestamp": "2026-02-02T10:03:40Z"
  },
  {
    "title": "Dismissing Trump's interference, Iraq's Shia bloc backs Maliki as prime minister nominee",
    "description": "Iraq's Shia bloc has reiterated its support for Nouri al-Maliki's return to the premiership despite meddlesome remarks by US President Donald Trump on the Arab country's domestic affairs.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iraq/2026/iraq-260201-presstv01.htm",
    "timestamp": "2026-02-02T10:02:46Z"
  },
  {
    "title": "Qatari foreign minister holds talks in Tehran with FM Araghchi, Iran's top security official",
    "description": "The Foreign Ministry has confirmed taking place of a one-day visit by Qatar's foreign minister to Tehran, during which the latter held talks with his Iranian counterpart and the country's top security official.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-presstv07.htm",
    "timestamp": "2026-02-02T10:02:24Z"
  },
  {
    "title": "Iranian missiles pose 'serious threat' to US interests, Persian Gulf allies warn Washington",
    "description": "American allies in the Persian Gulf have warned Washington that Iranian missiles pose \"a serious threat\" to US interests in West Asia, as they intensify their efforts to avert a war with potentially catastrophic consequences for the entire region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-presstv02.htm",
    "timestamp": "2026-02-02T10:02:19Z"
  },
  {
    "title": "Iran FM says US must seize chance for 'fair' deal, warns war would be 'disaster' for all",
    "description": "Iranian Foreign Minister Abbas Araghchi says the United States must seize the chance to reach a fair deal with Tehran, warning that any military aggression would be a \"disaster\" for the entire region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-presstv03.htm",
    "timestamp": "2026-02-02T10:02:08Z"
  },
  {
    "title": "IRGC Navy chief: Iran's unity and resolve a barrier against enemies' conspiracies",
    "description": "The commander of the Islamic Revolution Guards Corps (IRGC) Navy has affirmed the Iranian nation's unwavering resolve in the face of external threats, highlighting the critical role of faith, willpower, and unity in overcoming oppression and tyranny.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-presstv04.htm",
    "timestamp": "2026-02-02T10:02:06Z"
  },
  {
    "title": "Yemen warns war on Iran would transcend borders",
    "description": "Yemen's ruling Ansarullah movement has warned that any act of aggression against Iran would have consequences far beyond the geographical borders of the West Asia region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-presstv01.htm",
    "timestamp": "2026-02-02T10:01:48Z"
  },
  {
    "title": "Any US-initiated war would expand to regional conflict: Iran's Leader",
    "description": "Leader of the Islamic Revolution, Ayatollah Seyyed Ali Khamenei, has warned that if the United States were to initiate a war, it would turn into a regional conflict.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-irna02.htm",
    "timestamp": "2026-02-02T10:01:26Z"
  },
  {
    "title": "Shadow of conflict still shrouds Middle East as U.S., Iran begin dialogue",
    "description": "As the United States and Iran have announced the start of dialogue, there appears to be a glimmer of hope for easing the tensions that have gripped the Middle East for weeks.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260202-pdo01.htm",
    "timestamp": "2026-02-02T10:01:13Z"
  },
  {
    "title": "US responds to Iran's regional war warning, issuing new threats while indicating to seek agreements; tensions high but dialogue door ajar: experts",
    "description": "US President Donald Trump has reportedly responded to Iran's Supreme Leader Ayatollah Ali Khamenei, after the latter warned a US strike on Iran would spark a regional war. While claiming the US has the biggest, most powerful ships in the world over there, Tru…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260202-globaltimes01.htm",
    "timestamp": "2026-02-02T10:01:11Z"
  },
  {
    "title": "Fair Nuclear Deal With US Possible in Short Time - Iranian Foreign Minister",
    "description": "Tehran and Washington can seal a fair nuclear deal soon, with the chance to reach such an agreement should not be missed, Iranian Foreign Minister Abbas Araghchi said on Sunday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260201-sputnik01.htm",
    "timestamp": "2026-02-02T10:01:09Z"
  },
  {
    "title": "Nancy Mace Is Not Okay",
    "description": "Former staffers say that Representative Nancy Mace’s behavior has gotten more erratic in the past year — and that it’s time for her step away from politics.",
    "link": "http://nymag.com/intelligencer/article/nancy-mace-is-not-okay.html",
    "timestamp": "2026-02-02T10:00:39Z"
  },
  {
    "title": "‘Corruption on a Breathtaking Level’: Report Details Massive Foreign Investment in Trump Crypto Firm",
    "description": "“This was a bribe.\"",
    "link": "https://www.nakedcapitalism.com/2026/02/corruption-on-a-breathtaking-level-report-details-massive-foreign-investment-in-trump-crypto-firm.html",
    "timestamp": "2026-02-02T10:00:26Z"
  },
  {
    "title": "SEN BERNIE SANDERS: We need to cap credit card interest rates at 10%, Trump is right",
    "description": "Senator Bernie Sanders calls Wall Street credit card practices 'usury' as major banks profit from 24% average rates while borrowing at 4% from Fed.",
    "link": "https://www.foxnews.com/opinion/sen-bernie-sanders-need-cap-credit-card-interest-rates-10-trump-right",
    "timestamp": "2026-02-02T10:00:19Z"
  },
  {
    "title": "When health insurance costs more than the mortgage",
    "description": "As health care costs skyrocket and federal lawmakers pull back help on ACA insurance premiums, more middle-income families are facing tough choices on health care.",
    "link": "https://www.cbsnews.com/news/health-insurance-costs-aca-premiums-families/",
    "timestamp": "2026-02-02T10:00:06Z"
  },
  {
    "title": "The Future of the Fourth Estate",
    "description": "Adelaide Parker, Fatimah Azeem, Tareq AlSourani, William Liang\n\n\n\nAs major media capitulated to Trump this past year, student journalists held the powerful to account—both on campus and beyond.\r\n\n\r\n\n\nThe post The Future of the Fourth Estate appeared first on …",
    "link": "https://www.thenation.com/article/society/student-journalists-outshine-corporate-media/",
    "timestamp": "2026-02-02T10:00:01Z"
  },
  {
    "title": "Corporate America is threading a needle on how to respond to the killings in Minnesota",
    "description": "In the wake of Alex Pretti’s killing in Minneapolis, a growing number of corporate leaders, employees and Minnesota-based companies are speaking out.",
    "link": "https://www.nbcnews.com/business/consumer/corporate-response-pretti-minnesota-rcna256339",
    "timestamp": "2026-02-02T10:00:00Z"
  },
  {
    "title": "Trump Tirade over Protests Goes Off Rails as Crushing Fox Poll Hits",
    "description": "Donald Trump appears in deep denial about how widely hated his ICE raids have become. He let out a strange, rambling tirade to reporters about how the “silent majority” is still behind what ICE is doing, bizarrely citing approval of the raids among his own Wh…",
    "link": "https://newrepublic.com/article/205997/trump-tirade-protests-goes-off-rails-crushing-fox-poll-hits",
    "timestamp": "2026-02-02T10:00:00Z"
  },
  {
    "title": "Melania at the Multiplex",
    "description": "Elizabeth Spiers\n\n\n\nPackaging a $75 million bribe from Jeff Bezos as a vapid, content-challenged biopic.\r\n\n\r\n\n\nThe post Melania at the Multiplex appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=585480",
    "timestamp": "2026-02-02T10:00:00Z"
  },
  {
    "title": "Report From the Progressive International’s Nuestra Summit",
    "description": "Natasha Hakimi Zapata\n\n\n\nColombia holds its breath as President Gustavo Petro heads to DC.\r\n\n\r\n\n\nThe post Report From the Progressive International’s Nuestra Summit appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=585333",
    "timestamp": "2026-02-02T10:00:00Z"
  },
  {
    "title": "When Health Insurance Costs More Than the Mortgage",
    "description": "As health care costs skyrocket and federal lawmakers pull back help on insurance premiums, more middle-income families are facing tough choices on health care.",
    "link": "https://kffhealthnews.org/news/article/priced-out-health-insurance-costs-kentucky-tennessee-south-carolina/",
    "timestamp": "2026-02-02T10:00:00Z"
  },
  {
    "title": "Trump tells India to stop purchasing Iran oil, buy Venezuelan instead",
    "description": "US President Donald Trump has told India to stop purchasing oil from Iran and instead supply its energy demands by buying crude from Venezuela.",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2026/india-260201-presstv01.htm",
    "timestamp": "2026-02-02T09:58:54Z"
  },
  {
    "title": "Trump claims India will buy Venezuelan oil, welcomes China's investment; Chinese expert notices remarks 'unilateral,' no confirmation from Indian side",
    "description": "US President Donald Trump claimed on Saturday that India will start buying oil from Venezuela \"as opposed to Iran,\" adding that \"China is welcome to come in and will make a great deal on oil,\" according to a Bloomberg report. However, as observed by a Chinese…",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2026/india-260201-globaltimes01.htm",
    "timestamp": "2026-02-02T09:58:51Z"
  },
  {
    "title": "US futures, world shares slip as worries over Trump's Fed chief pick and AI weigh on markets",
    "description": "Concerns over potential shifts in monetary policy under Trump’s Federal Reserve nominee, coupled with fears of an AI investment bubble, have led to significant declines in global markets, particularly in tech-heavy sectors.",
    "link": "https://www.thehindubusinessline.com/markets/us-futures-world-shares-slip-as-worries-over-trumps-fed-chief-pick-and-ai-weigh-on-markets/article70582417.ece",
    "timestamp": "2026-02-02T09:57:03Z"
  },
  {
    "title": "Hungary's Tisza party maintains lead over Orban's ruling Fidesz, poll shows",
    "description": "BUDAPEST, Feb 2 (Reuters) - Hungary's centre-right ‌opposition Tisza party kept an eight-point lead over Prime Minister Viktor Orban's ‌governing nationalist Fidesz party in January, a poll showed on Monday, ahead ‌of a parliamentary election set for April 12…",
    "link": "https://www.thestar.com.my/news/world/2026/02/02/hungary039s-tisza-party-maintains-lead-over-orban039s-ruling-fidesz-poll-shows",
    "timestamp": "2026-02-02T09:57:00Z"
  },
  {
    "title": "Anti-ICE protests held across U.S.",
    "description": "Protesters gathered across the United States on Friday for a nationwide general strike against federal immigration enforcement operations and the recent fatal shootings by immigration agents.",
    "link": "https://www.globalsecurity.org/security/library/news/2026/02/sec-260202-pdo01.htm",
    "timestamp": "2026-02-02T09:54:25Z"
  },
  {
    "title": "Ukraine Awaits New Round Of Trilateral Talks As Deadly Russian Attacks Mount",
    "description": "Ukrainian President Volodymyr Zelenskyy said a new round of trilateral talks with Moscow and Washington is set for February 4-5 in the United Arab Emirates, with the gathering coming after another round of deadly Russian air strikes on civilian sites.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260202-rferl01.htm",
    "timestamp": "2026-02-02T09:50:46Z"
  },
  {
    "title": "Trump Threatens Trevor Noah Over Epstein Joke, Bad Bunny Calls Out ICE In Grammys Speech: Live Updates",
    "description": "Follow along for the latest news on the major headlines of the day.",
    "link": "https://www.huffpost.com/entry/trump-theatens-trevor-noah-grammys-bad-bunny-slams-ice_n_698071c1e4b0926bfc469acd",
    "timestamp": "2026-02-02T09:50:45Z"
  },
  {
    "title": "Bullion bloodbath! Silver prices crumble 41%, gold dips over 25% in 3 days. Time for a turnaround?",
    "description": "Gold and silver prices extended a sharp correction after a speculative, momentum-driven rally, pressured by profit-taking, a stronger dollar, rising US yields and higher global margins. Analysts say the broader trend remains bullish, with current declines see…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/bullion-bloodbath-silver-prices-crumble-41-gold-dips-over-25-in-3-days-time-for-a-turnaround/articleshow/127858716.cms",
    "timestamp": "2026-02-02T09:50:16Z"
  },
  {
    "title": "Kennedy Center to close for 2 years for renovations, Trump says, after performers backlash",
    "description": "U.S. President Donald Trump said Sunday he will move to close Washington's Kennedy Center performing arts venue for two years starting in July for construction.",
    "link": "https://www.cbc.ca/news/world/kenney-center-close-two-years-trump-9.7070289",
    "timestamp": "2026-02-02T09:47:31Z"
  },
  {
    "title": "Iran summons EU ambassadors in protest at Revolutionary Guard terror listing",
    "description": "Tehran says it is considering \"reciprocal action\" in response to the European Union's move against the Islamic Republic's powerful paramilitary organisation.",
    "link": "https://news.sky.com/story/iran-summons-eu-ambassadors-in-protest-at-revolutionary-guard-terror-listing-13502233",
    "timestamp": "2026-02-02T09:41:00Z"
  },
  {
    "title": "MAGA 'Was All A Lie': Marjorie Taylor Greene Torches Trump In Scathing New Interview",
    "description": "The former Trump insider tore into the president for selling out his MAGA supporters.",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-trump-maga-was-a-lie_n_69804dabe4b00b8d44e7de3d",
    "timestamp": "2026-02-02T09:38:16Z"
  },
  {
    "title": "Dollar clings to gains as investors weigh a Warsh-led Fed, commodity-linked currencies soft",
    "description": "LONDON, Feb 2 : The dollar held on to gains on Monday as investors weighed what a Federal Reserve under Kevin Warsh might look like, while falling precious metals and oil prices kept commodity-linked currencies in check.A slide in commodities eased somewhat i…",
    "link": "https://www.channelnewsasia.com/business/dollar-clings-gains-investors-weigh-warsh-led-fed-commodity-linked-currencies-soft-5899866",
    "timestamp": "2026-02-02T09:34:16Z"
  },
  {
    "title": "Turmoil at FEMA adds to the revolt against Kristi Noem",
    "description": "Lawmakers, disaster response experts, and disaster survivors say her policies have slowed emergency response and delayed recovery funding.",
    "link": "https://grist.org/extreme-weather/kristi-noem-fema-dhs-trump-disaster/",
    "timestamp": "2026-02-02T09:30:00Z"
  },
  {
    "title": "Reported Size Of Trump's New ‘Folly’ Draws Backlash Amid Cost-Of-Living Crisis",
    "description": "\"I love how this will make my groceries cheaper,\" wrote one critic.",
    "link": "https://www.huffpost.com/entry/donald-trump-new-folly_n_69805dc0e4b009bf7bdd1a68",
    "timestamp": "2026-02-02T09:25:16Z"
  },
  {
    "title": "New U.S. Envoy Arrives in Venezuela to Reopen Embassy After 7 Years",
    "description": "Ambassador Laura Dogu has arrived in Caracas with diplomatic personnel to reopen the U.S. embassy in the Venezuelan capital after a seven year pause.\nThe post New U.S. Envoy Arrives in Venezuela to Reopen Embassy After 7 Years appeared first on Breitbart.",
    "link": "https://www.breitbart.com/national-security/2026/02/02/new-u-s-envoy-arrives-in-venezuela-to-reopen-embassy-after-7-years/",
    "timestamp": "2026-02-02T09:18:32Z"
  },
  {
    "title": "How the decline of economic data could end up with a lot of unemployed Americans",
    "description": "The quality and availability of economic data is declining. That could end up with a lot of unemployed Americans and increase the chance of recession.",
    "link": "https://www.businessinsider.com/disappearing-economic-data-bad-economy-recession-unemployment-bls-jobs-report-2026-2",
    "timestamp": "2026-02-02T09:14:01Z"
  },
  {
    "title": "S&P 500, Doe Jones crash on Monday as U.S. Stock Market investors worry over Donald Trump's shocking move",
    "description": "U.S. stock market futures today hinted at a tough day for S&P 500 and Dow Jones.",
    "link": "https://economictimes.indiatimes.com/news/international/us/sp-500-doe-jones-crash-on-monday-as-u-s-stock-market-investors-worry-over-donald-trumps-shocking-move/articleshow/127857838.cms",
    "timestamp": "2026-02-02T09:13:35Z"
  },
  {
    "title": "Why is silver price falling by over 13% and will it bounce back or continue to drop? Silver sharp fall, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Why is silver price falling by over 13% and will it bounce back or continue to drop below $72? Silver prices dropped sharply as gold, oil, and base metals declined. The selloff followed Kevin Warshs Fed chair nomination, a stronger dollar, higher CME margins,…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-silver-price-falling-by-over-13-and-will-it-bounce-back-or-continue-to-drop-silver-sharp-fall-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/127857365.cms",
    "timestamp": "2026-02-02T09:09:56Z"
  },
  {
    "title": "Trump threatens legal action against Grammy host over Epstein comment",
    "description": "Donald Trump threatened legal action on Monday against the host of the 68th Grammy Awards over the comedian’s comment on the US president and convicted sex offender Jeffrey Epstein. After congratulating Billie Eilish for winning the Grammy for Song of the Yea…",
    "link": "https://punchng.com/trump-threatens-legal-action-against-grammy-host-over-epstein-comment/",
    "timestamp": "2026-02-02T09:09:06Z"
  },
  {
    "title": "Venezuela in the Prospect of a Democratic Transition. The Light, the Shadow and the Role of the International Community",
    "description": "[Efrén Ismael Sifontes Torres is an Ayudante de Segunda in international law courses and a member of the Observatory of International Humanitarian Law at the University of Buenos Aires School of Law] As a Venezuelan and an international lawyer, it took me som…",
    "link": "http://opiniojuris.org/2026/02/02/venezuela-in-the-prospect-of-a-democratic-transition-the-light-the-shadow-and-the-role-of-the-international-community/",
    "timestamp": "2026-02-02T09:07:21Z"
  },
  {
    "title": "Risks of working with China outweigh the benefits, Michael Kovrig warns",
    "description": "Carney may be reacting from an 'aversion to Trumpian chaos on one side,' and 'affinity for the technocratic order of the Chinese Communist Party on the other'",
    "link": "https://nationalpost.com/news/risks-of-working-with-china-outweigh-the-benefits-michael-kovrig-warns",
    "timestamp": "2026-02-02T09:00:46Z"
  },
  {
    "title": "All the highlights from the 2026 Grammys",
    "description": "The 2026 Grammy Awards were a night to remember, with several stars winning their first trophies and others making music history.",
    "link": "https://www.ecr.co.za/news/entertainment/all-highlights-2026-grammys/",
    "timestamp": "2026-02-02T09:00:39Z"
  },
  {
    "title": "Bad Bunny triumphs at politically charged Grammy Awards",
    "description": "The Grammys handed out their 68th round of awards last night at a ceremony dominated by famous faces, a stunning run by Bad Bunny  — and political proclamations that stood in stark contrast to last month's Golden Globes.",
    "link": "https://www.cbc.ca/news/entertainment/grammys-2026-9.7070320",
    "timestamp": "2026-02-02T09:00:37Z"
  },
  {
    "title": "Bruce Springsteen Won’t Back Down: Performs “Streets of Minneapolis” Live in Minneapolis",
    "description": "When the history books are written, we’ll remember the politicians, law firms, and CEOs who quickly bent the knee to Donald Trump. We’ll also remember the scant few American figures who refused to back down. Bruce Springsteen will be high on that short list. …",
    "link": "https://www.openculture.com/2026/02/bruce-springsteen-wont-back-down-performs-streets-of-minneapolis-live-in-minneapolis.html",
    "timestamp": "2026-02-02T09:00:09Z"
  },
  {
    "title": "Canadian military goes to U.S. for F-35 ceremony despite renewed trade tensions",
    "description": "The Lockheed Martin event in Texas comes as the future of the CF-18 replacement program is under review because of the ongoing trade and political disputes between Canada and the United States, and as the first F-35 is set to be delivered within months.",
    "link": "https://www.cbc.ca/news/politics/canada-f-35-lockheed-martin-first-delivery-ceremony-9.7068543",
    "timestamp": "2026-02-02T09:00:00Z"
  },
  {
    "title": "Bestselling author describes Mette Frederiksen's statement as nothing less than an »iconic moment for Europe«",
    "description": "Politiken traveled along as Mette Frederiksen embarked on a diplomatic mission to Hamburg, Berlin, and Paris. The Prime Minister is trying to handle »the strange and difficult situation« that Donald Trump has placed the Kingdom in - without offending the Amer…",
    "link": "https://politiken.dk/edition/news/art10714045/Bestselling-author-describes-Mette-Frederiksens-statement-as-nothing-less-than-an-%C2%BBiconic-moment-for-Europe%C2%AB",
    "timestamp": "2026-02-02T08:59:29Z"
  },
  {
    "title": "FAA Backs Trump’s Attacks on Canada Over Airplane Certifications",
    "description": "The US Federal Aviation Administration said it expects other countries’ aviation authorities to accept its certifications, as President Donald Trump threatens Canada over certification of Gulfstream jets.",
    "link": "https://financialpost.com/pmn/business-pmn/faa-backs-trumps-attacks-on-canada-over-airplane-certifications",
    "timestamp": "2026-02-02T08:58:41Z"
  },
  {
    "title": "'Sending my lawyers': Trump threatens to sue Grammys host over Jeffrey Epstein joke",
    "description": "Trump branded South African Noah a “total loser” who needs to “get his facts straight.”",
    "link": "https://www.thejournal.ie/trump-threatens-to-sue-trevor-noah-grammys-6944665-Feb2026/",
    "timestamp": "2026-02-02T08:47:42Z"
  },
  {
    "title": "Hungary’s Tisza party maintains lead over Orban’s ruling Fidesz, poll shows",
    "description": "BUDAPEST, Feb 2 (Reuters) - Hungary’s centre-right opposition Tisza party kept an eight-point lead over Prime Minister Viktor Orban’s governing nationalist Fidesz party i… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/02/hungary-s-tisza-party-maintains-lead-over-orban-s-ruling-fidesz-poll-shows",
    "timestamp": "2026-02-02T08:46:21Z"
  },
  {
    "title": "Iran summons ambassadors to protest Revolutionary Guard being listed as terror group",
    "description": "Iran says it has had summoned all of the European Union ambassadors in the Islamic Republic to protest the bloc’s listing of the paramilitary Revolutionary Guard as a terror group",
    "link": "https://abcnews.go.com/International/wireStory/iran-summons-eu-ambassadors-protest-revolutionary-guard-listed-129774076",
    "timestamp": "2026-02-02T08:45:18Z"
  },
  {
    "title": "Cuba denies security threat accusations as US raises pressure",
    "description": "Havana says it is ready for 'constructive engagement' with Washington as White House moves to choke off oil supplies.",
    "link": "https://www.aljazeera.com/news/2026/2/2/cuba-denies-security-threat-accusations-as-us-raises-pressure",
    "timestamp": "2026-02-02T08:38:45Z"
  },
  {
    "title": "'Loser Behavior': Trump Roasted Over His Post-Grammys Freakout",
    "description": "The president launched an ominous threat at \"talentless\" Trevor Noah after the comedian clowned him while hosting the Grammy Awards.",
    "link": "https://www.huffpost.com/entry/trump-trevor-noah-threat-grammys-2026_n_6980387ee4b0361197920240",
    "timestamp": "2026-02-02T08:36:15Z"
  }
]