[
  {
    "title": "Stocks rise as tariff reprieve lifts sentiment",
    "description": "Asian stocks rose on Thursday as investors held out hope that trade tensions could ease after U.S. President Donald Trump exempted automakers from tariffs for a month, while the euro stood tall ahead of the European Central Bank policy meeting.\nJapanese gover…",
    "link": "https://biztoc.com/x/d45ff57b9f3f415c",
    "timestamp": "2025-03-06T03:43:31Z"
  },
  {
    "title": "Asian markets rise on Trump auto tariff reprieve",
    "description": "Asian markets climbed on Thursday after US President Donald Trump announced a one-month tariff delay on auto imports from Mexico and Canada. The White House announced Wednesday an exemption on any autos coming through the North American neighbours’ free trade…",
    "link": "https://www.digitaljournal.com/world/asian-markets-rise-on-trump-auto-tariff-reprieve/article",
    "timestamp": "2025-03-06T03:37:33Z"
  },
  {
    "title": "Debate Over Rates Pause Mounts As ECB Set To Cut Again",
    "description": "Massive German spending pledges and uncertainty caused by US trade policy are fuelling expectations the European Central Bank could on Thursday signal that a pause in interest rate cuts is in sight, analysts said.",
    "link": "https://www.ibtimes.com/debate-over-rates-pause-mounts-ecb-set-cut-again-3765283",
    "timestamp": "2025-03-06T03:36:23Z"
  },
  {
    "title": "Asian Markets Rise On Trump Auto Tariff Reprieve",
    "description": "Asian markets climbed on Thursday after US President Donald Trump announced a one-month tariff delay on auto imports from Mexico and Canada.",
    "link": "https://www.ibtimes.com/asian-markets-rise-trump-auto-tariff-reprieve-3765280",
    "timestamp": "2025-03-06T03:36:21Z"
  },
  {
    "title": "Europe’s defense budget rips through its climate-crisis buffer",
    "description": "Spending cuts here and now mean future climate costs may rise, said the head of a climate nonprofit.",
    "link": "https://www.japantimes.co.jp/environment/2025/03/06/climate-change/europe-defense-budget-climate-crisis/",
    "timestamp": "2025-03-06T03:35:00Z"
  },
  {
    "title": "Debate over rates pause mounts as ECB set to cut again",
    "description": "Massive German spending pledges and uncertainty caused by US trade policy are fuelling expectations the European Central Bank could on Thursday signal that a pause in interest rate cuts is in sight, analysts said. The ECB is widely expected to make its sixth …",
    "link": "https://www.digitaljournal.com/world/debate-over-rates-pause-mounts-as-ecb-set-to-cut-again/article",
    "timestamp": "2025-03-06T03:32:32Z"
  },
  {
    "title": "Trump to welcome crypto elite at White House",
    "description": "US President Donald Trump, who has multiple ties to the crypto industry, will host the sector’s top players at a White House summit on Friday, as the field enjoys renewed momentum following his election. The US crypto community rallied behind Trump’s campaign…",
    "link": "https://www.digitaljournal.com/world/trump-to-welcome-crypto-elite-at-white-house/article",
    "timestamp": "2025-03-06T03:32:32Z"
  },
  {
    "title": "Is the selling in smallcap stocks over? Motilal Oswal’s Sneha Poddar offer insights",
    "description": "The recent underwhelming earnings performance of many small and midcap companies on account of rising costs, weakening demand, and sector-specific headwinds have eroded profitability, leading to earnings downgrades.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/is-the-selling-in-smallcap-stocks-over-motilal-oswals-sneha-poddar-offer-insights/articleshow/118739996.cms",
    "timestamp": "2025-03-06T03:30:00Z"
  },
  {
    "title": "The GOP Says It's Fighting Antisemitism In Colleges. Some Students Call Bullsh*t.",
    "description": "Jewish activists are accusing Trump and his allies of weaponizing their safety fears in order to crush dissent on campuses for issues like Palestinian human rights.",
    "link": "https://www.huffpost.com/entry/gop-fighting-antisemitism-college-students-protest-israel-gaza_n_67c8ef1fe4b0bdda614f79db",
    "timestamp": "2025-03-06T03:29:14Z"
  },
  {
    "title": "AOC Clashes With Eric Adams, Asks If He Thinks He'll 'Incriminate' Himself",
    "description": "Alexandria Ocasio-Cortez repeatedly grilled the New York City mayor on the DOJ's move to drop its bribery case against him.",
    "link": "https://www.newsweek.com/aoc-eric-adams-clash-congress-hearing-watch-video-2040342",
    "timestamp": "2025-03-06T03:26:12Z"
  },
  {
    "title": "Trump to welcome crypto elite at White House",
    "description": "by Thomas URBAINUS President Donald Trump, who has multiple ties to the crypto industry, will host the sector's top players at a White House summit on Friday, as the field enjoys renewed momentum following his election.The US crypto community rallied behind T…",
    "link": "https://www.rawstory.com/donald-trump-crypto-2671277587/",
    "timestamp": "2025-03-06T03:23:09Z"
  },
  {
    "title": "Falling US dollar is signaling a strong quarter for crypto: Raoul Pal",
    "description": "Crypto analyst Raoul Pal says the declining value of the US dollar will be a positive signal for crypto in Q2 2025 and “hopefully” the second half of the year, too.",
    "link": "https://cointelegraph.com/news/us-dollar-falling-signals-positive-crypto-market-q2-2025-crypto-analyst",
    "timestamp": "2025-03-06T03:22:50Z"
  },
  {
    "title": "Draft of Trump order seeks to eliminate Department of Education: report",
    "description": "President Donald Trump is seeking to eliminate the Education Department, according to an executive order reported by the Wall Street Journal.",
    "link": "https://www.foxnews.com/politics/draft-trump-order-seeks-eliminate-department-education-report",
    "timestamp": "2025-03-06T03:22:03Z"
  },
  {
    "title": "Trump issues ‘last warning’ to Hamas",
    "description": "Hamas will be “over” if it doesn’t return the remaining hostages, US President Donald Trump has said. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613786-trump-last-warning-hamas/",
    "timestamp": "2025-03-06T03:21:59Z"
  },
  {
    "title": "Here's how many viewers watched Trump deliver his presidential address to Congress (George Petras/USA Today)",
    "description": "George Petras / USA Today:\nHere's how many viewers watched Trump deliver his presidential address to Congress  —  President Donald Trump broke records for the duration of his address to Congress Tuesday and the number of words used in his speech.  How did he …",
    "link": "https://www.memeorandum.com/250305/p172",
    "timestamp": "2025-03-06T03:20:01Z"
  },
  {
    "title": "New Zealand to sack senior diplomat after Trump jibe",
    "description": "New Zealand will sack its top diplomat in London after he made a \"deeply disappointing\" remark questioning Donald Trump's grasp of history, the foreign minister said Thursday.High Commissioner to the United Kingdom Phil Goff questioned whether the US presiden…",
    "link": "https://www.rawstory.com/new-zealand/",
    "timestamp": "2025-03-06T03:18:50Z"
  },
  {
    "title": "What we know about the US decision to cut intelligence sharing with Ukraine",
    "description": "One expert says the CIA's move to stop sharing intelligence with Ukraine will have an instantaneous impact on the battlefield. Here's what we know.",
    "link": "https://www.abc.net.au/news/2025-03-06/us-stops-sharing-intel-with-ukraine-explained/105016872",
    "timestamp": "2025-03-06T03:17:44Z"
  },
  {
    "title": "'Hamilton' axes run at prominent US cultural center after Trump takeover",
    "description": "The smash hit musical \"Hamilton\" has cancelled a planned run at the Kennedy Center because President Donald Trump has destroyed the political neutrality of the US capital's premier cultural venue since taking over as its chairman, the play's producer said Wed…",
    "link": "https://www.rawstory.com/hamilton/",
    "timestamp": "2025-03-06T03:17:22Z"
  },
  {
    "title": "Former abductee urges Japan to work with U.S. to press North Korea",
    "description": "Kaoru Hasuike said that the abduction issue \"has not been resolved.\"",
    "link": "https://www.japantimes.co.jp/news/2025/03/06/japan/former-abductee-urge/",
    "timestamp": "2025-03-06T03:13:00Z"
  },
  {
    "title": "Bitcoin, Ethereum Rally as Markets Weigh Trade Tensions and China's Stimulus Push",
    "description": "Bitcoin extended gains late Wednesday as the Trump administration grants temporary tariff relief and Beijing ramps up economic support.",
    "link": "https://decrypt.co/308873/bitcoin-ethereum-rally-as-markets-weigh-trade-tensions-and-chinas-stimulus-push",
    "timestamp": "2025-03-06T03:11:36Z"
  },
  {
    "title": "Stocks rise as tariff reprieve lift sentiment",
    "description": "By Ankur Banerjee\nSINGAPORE (Reuters) - Asian stocks rose on Thursday as investors held out hope that trade tensions could ease after U.S. President Donald Trump exempted automakers from tariffs for a month, while the euro stood tall ahead of the European Cen…",
    "link": "https://biztoc.com/x/fe95fc1d456eed9e",
    "timestamp": "2025-03-06T03:10:15Z"
  },
  {
    "title": "Trump’s upcoming crypto summit is in focus. Here are catalysts that could refuel bitcoin’s rally",
    "description": "Distributed Ledger\nTrump’s upcoming crypto summit is in focus. Here are catalysts that could refuel bitcoin’s rally.\nWelcome back to Distributed Ledger. This is Frances Yue, crypto reporter at MarketWatch.\nPresident Donald Trump will host his first White Hous…",
    "link": "https://biztoc.com/x/651b2387b7f45f70",
    "timestamp": "2025-03-06T03:10:11Z"
  },
  {
    "title": "Morehouse College offers prospective students tips on applying and thriving",
    "description": "Morehouse College, a private, historically Black liberal arts college in the U.S. state of Georgia, offers a guide for international students interested in attending the school.\n\n\nAmong the tips to apply and thrive at Morehouse:\n\n\nTake advantage of the school…",
    "link": "https://www.voanews.com/a/morehouse-college-offers-prospective-students-tips-on-applying-and-thriving-/8000692.html",
    "timestamp": "2025-03-06T03:10:00Z"
  },
  {
    "title": "‘It’s Horrible’: Dana Loesch Says There Are Double Standards On Men In Women’s Sports, It Has To Do With Locker Rooms",
    "description": "Dana Loesch appeared on Fox News Wednesday to rip the Democrats for what she perceives as a blatant double standards on women’s rights in sports.",
    "link": "https://dailycaller.com/2025/03/05/dana-loesch-double-standards-trans-womens-sports/",
    "timestamp": "2025-03-06T03:08:53Z"
  },
  {
    "title": "India seeks Rupee’s global reach, but no plan to replace US dollar: EAM S Jaishankar",
    "description": "External Affairs Minister Dr S Jaishankar, speaking in London, clarified that India has no policy to replace the US dollar as the global reserve currency. He emphasised that economic stability is the priority and that BRICS does not have a unified stance on d…",
    "link": "https://economictimes.indiatimes.com/news/india/india-seeks-rupees-global-reach-but-no-plan-to-replace-us-dollar-eam-s-jaishankar/articleshow/118747922.cms",
    "timestamp": "2025-03-06T03:07:54Z"
  },
  {
    "title": "'Bear with me', Trump says as both farmers, consumers brace for tariff effects",
    "description": "New tariffs on Mexico, Canada, and China are expected to significantly impact US farmers and meat producers, potentially hurting their profits and leading to higher consumer prices for some products. President Trump may offer aid payments to offset these loss…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bear-with-me-trump-says-as-both-farmers-consumers-brace-for-tariff-effects/articleshow/118747926.cms",
    "timestamp": "2025-03-06T03:04:18Z"
  },
  {
    "title": "Adrienne Adams joins NYC mayoral race, blasts rival Eric Adams: ‘City Hall is in chaos’",
    "description": "New York City Council Speaker Adrienne Adams is tossing her hat in the race for mayor after weeks of speculation that she’d join the crowded field of candidates looking to unseat Mayor Eric Adams, according to a report. “New Yorkers can’t afford to live here,…",
    "link": "https://nypost.com/2025/03/05/us-news/adrienne-adams-joins-nyc-mayoral-race-blasts-rival-eric-adams/",
    "timestamp": "2025-03-06T03:02:36Z"
  },
  {
    "title": "Macron says France to consider protecting European allies with its nuclear arsenal | CNN",
    "description": "French President Emmanuel Macron said Wednesday that France will consider extending the protection of its nuclear arsenal to its allies and that Europe needed to be ready for the US not to be ‘by our side’ in the Russia-Ukraine war.",
    "link": "https://www.cnn.com/2025/03/05/europe/macron-france-nuclear-arsenal-ukraine-intl-hnk/index.html",
    "timestamp": "2025-03-06T03:00:20Z"
  },
  {
    "title": "Supreme Court won't let Trump block USAID project funds",
    "description": "A divided U.S. Supreme Court declined on Wednesday to let President Donald Trump's administration withhold payment to foreign aid organizations for work they already performed for the government as the Republican president moves to pull the plug on American h…",
    "link": "https://www.bangkokpost.com/video/world/2974265",
    "timestamp": "2025-03-06T03:00:00Z"
  },
  {
    "title": "Privately run immigration detention center to reopen",
    "description": "A private prison company says it will reopen an immigrant detention facility in Texas that previously held families with children for U.S. Immigration and Customs Enforcement CoreCivic announced the contract with ICE and the city of Dilley on Wednesday",
    "link": "https://abcnews.go.com/US/wireStory/privately-run-immigration-detention-center-previously-held-families-119496439",
    "timestamp": "2025-03-06T02:57:52Z"
  },
  {
    "title": "Stocks rise as tariff reprieve lift sentiment",
    "description": "Asian stocks rose on Thursday as investors held out hope that trade tensions could ease after U.S. President Donald Trump exempted automakers from tariffs fo...",
    "link": "https://www.aol.com/news/stocks-rise-tariff-reprieve-lift-025624224.html",
    "timestamp": "2025-03-06T02:56:24Z"
  },
  {
    "title": "Trump pauses new tariffs, grants US automakers one-month exemption on Canadian, Mexican imports",
    "description": "Trump grants one-month exemption on tariffs for U.S. automakers, as trade war fears loom over domestic manufacturing.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-pauses-new-tariffs-grants-us-automakers-one-month-exemption-on-canadian-mexican-imports/article69297008.ece",
    "timestamp": "2025-03-06T02:50:55Z"
  },
  {
    "title": "Republicans cannot meet their own budget target without cutting Medicare or Medicaid, budget office says",
    "description": "The House GOP has ordered the Energy and Commerce Committee, which oversees Medicare and Medicaid funding, to cut $880 billion in a bill to advance Trump's agenda.",
    "link": "https://www.nbcnews.com/politics/congress/republicans-cannot-meet-budget-target-cutting-medicare-medicaid-budget-rcna195042",
    "timestamp": "2025-03-06T02:50:39Z"
  },
  {
    "title": "Trump's Rousing Address Puts Dems' Clowns To Shame",
    "description": "<p>There was plenty of that this week, but an inordinate amount of the focus in Washington was on how Democrats would react to Donald Trump.</p>",
    "link": "https://www.realclearpolitics.com/2025/03/05/trumps_rousing_address_puts_dems_clowns_to_shame_642282.html",
    "timestamp": "2025-03-06T02:50:36Z"
  },
  {
    "title": "Major U.S. retailers warn of price hikes as Trump tariffs take effect",
    "description": "LOS ANGELES, March 4 (Xinhua) -- Major retailers in the United States warn of imminent price hikes,",
    "link": "http://en.people.cn/n3/2025/0306/c90000-20285438.html",
    "timestamp": "2025-03-06T02:50:28Z"
  },
  {
    "title": "Miranda Devine: Disgraceful Dems callously politicized DJ Daniel, Laken Riley – and sunk to a new low in the process",
    "description": "So much for Democrat women being more compassionate than the rest of us. Uh uh. They have hearts of stone.",
    "link": "https://nypost.com/2025/03/05/opinion/disgraceful-dems-sink-lower-after-politicizing-dj-daniel-laken-riley/",
    "timestamp": "2025-03-06T02:50:09Z"
  },
  {
    "title": "Watch: 13-Year-Old Secret Service Agent's \"Big Hug\" For Donald Trump",
    "description": "Secret Service agent DJ Daniel visited President Donald Trump at the Oval Office with a &quot;big hug&quot;.",
    "link": "https://www.ndtv.com/world-news/watch-13-year-old-secret-service-agents-big-hug-for-donald-trump-7858837",
    "timestamp": "2025-03-06T02:49:47Z"
  },
  {
    "title": "Government by chaos, cnt’d",
    "description": "One of the auto moguls Trump talked to managed to get through to him that automobile manufacturing in North America is heavily integrated: President Donald Trump is granting a one-month exemption on his stiff new tariffs on imports from Mexico and Canada for …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/government-by-chaos-cntd",
    "timestamp": "2025-03-06T02:48:23Z"
  },
  {
    "title": "Sony and Suntory build U.S. stockpiles as Japan faces Trump tariff threat",
    "description": "In his latest trade salvo this week, U.S. President Donald Trump hinted that he might target Tokyo next, after imposing tariffs on Mexico and China.",
    "link": "https://biztoc.com/x/9d2c14a7fa4d85c2",
    "timestamp": "2025-03-06T02:47:50Z"
  },
  {
    "title": "Booker: During Address Trump Was Blatantly Lying in a ‘Mocking Tone’",
    "description": "Senator Cory Booker (D-NJ) declared Wednesday on MSNBC’s “All In” that President Donald Trump lied blatantly in a mocking tone during his speech to a joint session of Congress. Host Chris Hayes said, “You were in that room last night if I’m not mistaken. Ther…",
    "link": "https://freerepublic.com/focus/f-news/4302392/posts",
    "timestamp": "2025-03-06T02:45:03Z"
  },
  {
    "title": "Booker: During Address Trump Was Blatantly Lying in a 'Mocking Tone'",
    "description": "Senator Cory Booker (D-NJ) declared Wednesday on MSNBC's \"All In\" that President Donald Trump lied blatantly in a mocking tone during his speech to a joint session of Congress.\nThe post Booker: During Address Trump Was Blatantly Lying in a ‘Mocking Tone’ appe…",
    "link": "https://www.breitbart.com/clips/2025/03/05/booker-during-address-trump-was-blatantly-lying-in-a-mocking-tone/",
    "timestamp": "2025-03-06T02:41:38Z"
  },
  {
    "title": "Trump issues ‘last warning’ to Hamas, demands hostage release",
    "description": "Trump warns Hamas to release hostages, threatens consequences, in unprecedented direct talks with militant group.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-issues-last-warning-to-hamas-demands-hostage-release/article69296992.ece",
    "timestamp": "2025-03-06T02:40:42Z"
  },
  {
    "title": "Trump plans executive order to strengthen US shipbuilding, blunt China domination",
    "description": "The U.S. plans to impose fees on imports from Chinese ships and provide tax incentives to strengthen domestic shipbuilding. This initiative by President Trump aims to counter China's control over the $150 billion global shipping industry. The White House will…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-plans-executive-order-to-strengthen-us-shipbuilding-blunt-china-domination/articleshow/118747230.cms",
    "timestamp": "2025-03-06T02:40:08Z"
  },
  {
    "title": "Elon Musk strategizes $1 trillion spending cuts with House DOGE panel in closed-door meeting",
    "description": "House Republicans huddled with Elon Musk in a pair of meetings on Wednesday night.",
    "link": "https://www.foxnews.com/politics/elon-musk-strategizes-trillion-spending-cuts-house-doge-panel-closed-door-meeting",
    "timestamp": "2025-03-06T02:38:46Z"
  },
  {
    "title": "Tom Homan Says He ‘Sleeps Like A Baby’ As He Takes Pride In Disrupting Dem Mayor’s Peace Over Migrant Policies",
    "description": "Border czar Tom Homan condemned Democratic leaders on Fox News Wednesday for their support of sanctuary city policies, which he claims jeopardize public safety.",
    "link": "https://dailycaller.com/2025/03/05/tom-homan-michelle-wu-migrant-policies/",
    "timestamp": "2025-03-06T02:31:51Z"
  },
  {
    "title": "Trump’s crypto reserve likely to be mostly Bitcoin, bigger than expected: Bitwise",
    "description": "Donald Trump’s planned crypto reserve will likely be mostly Bitcoin in the end, and will be bigger than many people think, says Bitwise investment chief Matt Hougan.",
    "link": "https://cointelegraph.com/news/trump-crypto-reserve-mostly-bitcoin-bigger-than-expected-bitwise",
    "timestamp": "2025-03-06T02:30:03Z"
  },
  {
    "title": "The Irish Independent’s view: Dark clouds from across the Atlantic will cast a shadow over summit between Micheál Martin and Keir Starmer",
    "description": "‘To be Irish is to know that, in the end, the world will break your heart,” the late Irish-American Democratic grandee Daniel Patrick Moynihan once said.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-dark-clouds-from-across-the-atlantic-will-cast-a-shadow-over-summit-between-micheal-martin-and-keir-starmer/a879291254.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Aaron Blake: Seven takeaways from Donald Trump’s State of the Nation address",
    "description": "On Tuesday, US president Donald Trump delivered the first big speech to Congress of his second term this week, amid a series of major subplots.",
    "link": "https://www.independent.ie/world-news/north-america/aaron-blake-seven-takeaways-from-donald-trumps-state-of-the-nation-address/a815279789.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Letters: Denial of homes proposal shows disconnect between local and national politics",
    "description": "We currently face an unprecedented housing crisis, marked by record numbers of individuals in emerg­ency accommodation and tens of thousands of young men and women stranded in their parents’ homes.",
    "link": "https://www.independent.ie/opinion/letters/letters-denial-of-homes-proposal-shows-disconnect-between-local-and-national-politics/a229641817.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Paschal Donohoe stays home to ‘work the phones’ amid urgent research into cost of US tariffs",
    "description": "Finance Minister Paschal Donohoe is staying home from the UK-Irish ministerial summit to “work the phones” on promised US tariffs on EU exports.",
    "link": "https://www.independent.ie/irish-news/paschal-donohoe-stays-home-to-work-the-phones-amid-urgent-research-into-cost-of-us-tariffs/a1272689265.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Fear spreads among America's undocumented Irish, the ‘low-hanging fruit’ in Trump’s immigration blitz",
    "description": "Within a week of starting his second term, Donald Trump made good on his promise to launch an immigration enforcement blitz. Drafting in multiple federal agencies and arresting nearly 1,000 people on its first weekend in power, his administration redoubled it…",
    "link": "https://www.independent.ie/world-news/north-america/fear-spreads-among-americas-undocumented-irish-the-low-hanging-fruit-in-trumps-immigration-blitz/a83936363.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Taoiseach open to sending Irish troops to Ukraine ‘if a ceasefire develops’ – but insists ‘we wouldn’t be part of deterrent force’",
    "description": "The Taoiseach has said he is open to sending Irish troops to Ukraine to keep the peace if a ceasefire deal is struck.",
    "link": "https://www.independent.ie/irish-news/taoiseach-open-to-sending-irish-troops-to-ukraine-if-a-ceasefire-develops-but-insists-we-wouldnt-be-part-of-deterrent-force/a929133997.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Supreme Court won’t let Donald Trump withhold payment to foreign aid groups under USAID moves",
    "description": "A sharply divided US Supreme Court yesterday reinstated a lower-court order for the Trump administration to release frozen foreign aid, but it was not clear how quickly money would start flowing.",
    "link": "https://www.independent.ie/world-news/north-america/supreme-court-wont-let-donald-trump-withhold-payment-to-foreign-aid-groups-under-usaid-moves/a721608514.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Fears spreads among America's undocumented Irish, the ‘low-hanging fruit’ in Trump’s immigration blitz",
    "description": "Within a week of starting his second term, Donald Trump made good on his promise to launch an immigration enforcement blitz. Drafting in multiple federal agencies and arresting nearly 1,000 people on its first weekend in power, his administration redoubled it…",
    "link": "https://www.independent.ie/world-news/north-america/fears-spreads-among-americas-undocumented-irish-the-low-hanging-fruit-in-trumps-immigration-blitz/a83936363.html",
    "timestamp": "2025-03-06T02:30:00Z"
  },
  {
    "title": "Vance visits Mexico border, says US won’t invade Mexico",
    "description": "U.S. Vice President JD Vance led a trio of White House officials on a visit Wednesday to a key crossing point on the Texas-Mexico border, where he echoed President Donald Trump’s hard-line immigration push and assured Americans that U.S. forces don’t plan to …",
    "link": "https://www.voanews.com/a/vance-visits-mexico-border-says-us-won-t-invade-mexico-/8000678.html",
    "timestamp": "2025-03-06T02:26:04Z"
  },
  {
    "title": "Elon Musk and China chase humanoid dreams with echoes of EV buildup",
    "description": "HONG KONG -- Chinese authorities are pushing humanoid robots as the next big thing after electric vehicles. This gives them a common cause with Tesla boss and Donald Trump confidant Elon Musk, with observers foreseeing a potential repeat of the way his compan…",
    "link": "https://biztoc.com/x/cfa91815e6037d14",
    "timestamp": "2025-03-06T02:25:54Z"
  },
  {
    "title": "New Zealand to sack senior diplomat after Trump jibe",
    "description": "New Zealand will sack its top diplomat in London after he made a “deeply disappointing” remark questioning Donald Trump’s grasp of history, the foreign minister said Thursday. High Commissioner to the United Kingdom Phil Goff questioned whether the US preside…",
    "link": "https://www.digitaljournal.com/world/new-zealand-to-sack-senior-diplomat-after-trump-jibe/article",
    "timestamp": "2025-03-06T02:23:26Z"
  },
  {
    "title": "Canada's foreign minister offers blunt explanation for national anthem booing: 'We're insulted'",
    "description": "Canada's Foreign Minister, Mélanie Joly, said fans continue to boo the U.S. national anthem at sporting events because they've \"had enough with this rhetoric.\"",
    "link": "https://www.foxnews.com/sports/canada-foreign-minister-offers-blunt-explanation-national-anthem-booing-were-insulted",
    "timestamp": "2025-03-06T02:21:50Z"
  },
  {
    "title": "Trump’s Executive Order Renaming Wildlife Refuge Brings Mother of Slain Girl to Tears",
    "description": "President Donald Trump brought the mother of a child believed to have been killed by illegal immigrants to tears Tuesday night during his speech to... Read More\nThe post Trump’s Executive Order Renaming Wildlife Refuge Brings Mother of Slain Girl to Tears app…",
    "link": "https://www.dailysignal.com/2025/03/05/trumps-executive-order-renaming-wildlife-refuge-brings-mother-slain-girl-tears/",
    "timestamp": "2025-03-06T02:17:23Z"
  },
  {
    "title": "NZ sacks high commissioner to UK over comments critical of Trump",
    "description": "High Commissioner Phil Goff has lost his job for comments in which he appeared to question US President Donald Trump's grasp of history.",
    "link": "https://www.abc.net.au/news/2025-03-06/nz-sacks-ambassador-to-uk-for-questioning-trump/105017782",
    "timestamp": "2025-03-06T02:15:14Z"
  },
  {
    "title": "Trump wants the US to start cranking out ships. It won't be easy",
    "description": "President Trump announced a new White House office to tackle US shipbuilding problems.\nIt seems to be a priority for his administration.\nBut shipbuilding issues run deep and won't be solved overnight.\nPresident Donald Trump said that he wants to see the US bu…",
    "link": "https://biztoc.com/x/6870364374141b00",
    "timestamp": "2025-03-06T02:14:50Z"
  },
  {
    "title": "Appeals court allows removal of watchdog agency head as legal battle rages over Trump firing",
    "description": "An appeals court has removed the head of a federal watchdog agency in the latest twist in a legal fight over Republican President Donald Trump’s authority to fire the special counsel",
    "link": "https://abcnews.go.com/Politics/wireStory/appeals-court-allows-removal-watchdog-agency-head-legal-119492413",
    "timestamp": "2025-03-06T02:14:32Z"
  },
  {
    "title": "Trump works with House GOP on stopgap funding bill",
    "description": "United States President Donald Trump announced on Truth Social that he is working with House Republicans on a short-term funding measure to avert a government shutdown next week.\nTrump said conservat...",
    "link": "https://biztoc.com/x/e793678fb037bf18",
    "timestamp": "2025-03-06T02:14:30Z"
  },
  {
    "title": "Markets wrestle with Trump's unconventional debt ideas",
    "description": "Investors are considering Donald Trump's unconventional strategies to address the rising U.S. debt, which exceeds $36 trillion. Trump's administration, avoiding cuts to popular benefits, is exploring options like forced debt swaps with foreign governments and…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-wrestle-with-trumps-unconventional-debt-ideas/articleshow/118746926.cms",
    "timestamp": "2025-03-06T02:11:48Z"
  },
  {
    "title": "EXCLUSIVE Trump considers criminal charges for USAID staff after DOGE uncovered wild 'abuse'",
    "description": "Federal workers at USAID could find themselves behind bars for fraud after DOGE uncovered a massive spending scandal at the program, DailyMail.com has learned Pete Marocco, deputy administrator-designate at USAID, provided the House Foreign Affairs Committee …",
    "link": "https://freerepublic.com/focus/f-chat/4302386/posts",
    "timestamp": "2025-03-06T02:09:26Z"
  },
  {
    "title": "Investors spy the dawn of a tectonic shift away from US markets",
    "description": "A significant global trade war and China's emergence as a tech leader are prompting a shift in global investment away from the U.S. While China deployed more stimulus to mitigate the impact of U.S. tariffs, Europe proposes a massive fiscal overhaul. Consequen…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-spy-the-dawn-of-a-tectonic-shift-away-from-us-markets/articleshow/118746883.cms",
    "timestamp": "2025-03-06T02:06:57Z"
  },
  {
    "title": "Trump’s “Genocidal” Threat to Gaza: If Hamas Won’t Release Hostages, “You Are DEAD”",
    "description": "“He’s threatening an entire population with death — what else is that other than genocidal?” one expert told The Intercept.\nThe post Trump’s “Genocidal” Threat to Gaza: If Hamas Won’t Release Hostages, “You Are DEAD” appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/05/trump-gaza-palestinians-hamas-hostages/",
    "timestamp": "2025-03-06T02:05:27Z"
  },
  {
    "title": "Trump’s “Genocidal” Threat to Gaza: If Hamas Won’t Release Hostages, “You Are DEAD”",
    "description": "“He’s threatening an entire population with death – what else is that other than genocidal?” one expert told The Intercept.\nThe post Trump’s “Genocidal” Threat to Gaza: If Hamas Won’t Release Hostages, “You Are DEAD” appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/05/trumps-gaza-palestinians-hamas-you-are-dead-hostages/",
    "timestamp": "2025-03-06T02:05:27Z"
  },
  {
    "title": "Judges face rise in threats as Musk blasts them over rulings",
    "description": "In recent weeks, Musk, congressional Republicans and other top allies of U.S. President Donald Trump have called for the impeachment of some federal judges.",
    "link": "https://www.japantimes.co.jp/news/2025/03/06/world/politics/judges-threats-musk-rulings/",
    "timestamp": "2025-03-06T02:05:00Z"
  },
  {
    "title": "What CCP Fears If US Can Negotiate An End to Russia–Ukraine War: Analysts",
    "description": "What CCP Fears If US Can Negotiate An End to Russia–Ukraine War: Analysts\n \nAuthored by Dorothy Li via The Epoch Times (emphasis ours),\nIf President Donald Trump can negotiate a peace deal between Russia and Ukraine, communist China could become the next targ…",
    "link": "https://biztoc.com/x/81ef8f661a931cfd",
    "timestamp": "2025-03-06T02:03:46Z"
  },
  {
    "title": "Trump Adviser Insists ‘Canada Has Been Taken Over by Mexican Cartels’",
    "description": "White House trade adviser Peter Navarro claimed Canada had \"been taken over by Mexican cartels\" during an appearance on Fox News' Special Report.\nThe post Trump Adviser Insists ‘Canada Has Been Taken Over by Mexican Cartels’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/trump-adviser-insists-canada-has-been-taken-over-by-mexican-cartels/",
    "timestamp": "2025-03-06T02:02:00Z"
  },
  {
    "title": "The Georgia pastor behind the 40-day fast from Target says the company's DEI dismissal was a 'betrayal'",
    "description": "A pastor in the Atlanta area is encouraging his congregation to \"fast\" from Target for 40 days after the company's DEI rollback.",
    "link": "https://www.businessinsider.com/pastor-target-fast-dei-boycott-betrayal-2025-3",
    "timestamp": "2025-03-06T02:01:01Z"
  },
  {
    "title": "Albanese responds to Trump camp 'concern' on Australia's defence spend",
    "description": "President Donald Trump's pick to lead US Pentagon policy expressed concern over Australia's low defence spend. The prime minister insists significant investment has been made and defence spending will continue to rise.",
    "link": "https://www.abc.net.au/news/2025-03-06/albanese-respond-defence-spending-trump-concern-gdp/105017652",
    "timestamp": "2025-03-06T02:00:14Z"
  },
  {
    "title": "Report: Trump expected to announce Bitcoin reserve strategy at White House Crypto Summit",
    "description": "Howard Lutnick said Bitcoin would receive special status under US President Donald Trump’s proposed crypto reserve Lutnick believes that other crypto tokens will be “treated differently—positively, but differently” So far, 12 people within crypto have been in…",
    "link": "https://coinjournal.net/news/report-trump-expected-to-announce-bitcoin-reserve-strategy-at-white-house-crypto-summit/",
    "timestamp": "2025-03-06T02:00:03Z"
  },
  {
    "title": "US firms demand crackdown on tariff-evading Chinese importers",
    "description": "<p>WASHINGTON - The United States needs tougher legislation to enforce trade laws and ensure criminal prosecution of Chinese government-subsidised companies that circumvent US tariffs by shipping goods through third countries, US companies said on Wednesday.<…",
    "link": "https://www.bangkokpost.com/business/general/2974226/us-firms-demand-crackdown-on-tariff-evading-chinese-importers",
    "timestamp": "2025-03-06T02:00:00Z"
  },
  {
    "title": "Lindsey Graham Says He’s ‘Ok’ With Trump Negotiating With Hamas Because ‘I Trust Trump’",
    "description": "Sen. Lindsey Graham said he has no issue with President Donald Trump negotiating with Hamas to try to secure the release of hostages.\nThe post Lindsey Graham Says He’s ‘Ok’ With Trump Negotiating With Hamas Because ‘I Trust Trump’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/lindsey-graham-says-hes-ok-with-trump-negotiating-with-hamas-because-i-trust-trump/",
    "timestamp": "2025-03-06T01:59:01Z"
  },
  {
    "title": "Oil steadies after multi-day plunge but traders wary of tariff, supply impacts",
    "description": "Oil prices stabilized after recent declines due to potential easing of U.S. tariffs on Canadian crude. Investors remain cautious about ongoing tariffs on Mexico and the increased output from major producers. U.S. crude stockpiles rose significantly, while gas…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-steadies-after-multi-day-plunge-but-traders-wary-of-tariff-supply-impacts/articleshow/118746777.cms",
    "timestamp": "2025-03-06T01:57:10Z"
  },
  {
    "title": "Appeals court allows removal of watchdog in legal fight over Trump firing",
    "description": "WASHINGTON — An appeals court in Washington on Wednesday removed the head of a federal watchdog agency in the latest twist in a legal fight over President Donald Trump's authority to fire the special counsel. \n\n\nThe U.S. Court of Appeals for the District of C…",
    "link": "https://www.voanews.com/a/appeals-court-allows-removal-of-watchdog-in-legal-fight-over-trump-firing-/7999665.html",
    "timestamp": "2025-03-06T01:56:47Z"
  },
  {
    "title": "Macron says price of peace 'cannot be the collapse of Ukraine' amid 'real' Russian threat to Europe",
    "description": "The French president also warned that Europe must be prepared for the US “not to be at our side” going forward. FRENCH PRESIDENT EMMANUEL Macron has said that peace “cannot be achieved by abandoning Ukraine” as he warned of the “real threat” to Europe from Ru…",
    "link": "https://freerepublic.com/focus/f-news/4302385/posts",
    "timestamp": "2025-03-06T01:56:05Z"
  },
  {
    "title": "Philippines' LGBTQ+ groups seek options to U.S. aid",
    "description": "Advocacy groups are looking at new financing strategies and calling for greater involvement by local health institutions to protect against foreign aid withdrawals.",
    "link": "https://www.japantimes.co.jp/news/2025/03/06/asia-pacific/politics/philippines-lgbtq-us-aid/",
    "timestamp": "2025-03-06T01:55:00Z"
  },
  {
    "title": "Live updates: Sylvester Turner's apparent cause of death detailed by police - Houston Chronicle",
    "description": "Live updates: Sylvester Turner's apparent cause of death detailed by policeHouston Chronicle Longtime Houston Mayor and Congressman Sylvester Turner dies at age 70Houston Public Media Texas Rep. Sylvester Turner Shared a Final Message for Donald Trump Hours B…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176625767",
    "timestamp": "2025-03-06T01:53:00Z"
  },
  {
    "title": "CNBC Daily Open: Stocks rebound as Trump grants automakers some tariff relief",
    "description": "The reprieve on tariffs for automakers, and a possible concession on some aspect of tariffs, is assuaging markets' fears. But that could be temporary.",
    "link": "https://www.cnbc.com/2025/03/06/cnbc-daily-open-stocks-rebound-as-automakers-get-some-tariff-relief.html",
    "timestamp": "2025-03-06T01:52:41Z"
  },
  {
    "title": "Trump warns that death awaits Hamas leaders and Gazans if hostages aren't immediately released",
    "description": "President Donald Trump, pictured with Israeli Prime Minister Netanyahu, believes talks between the U.S. and Hamas are part of a \"good-faith effort to do what’s right for the American people,\" the White House press secretary said.",
    "link": "https://biztoc.com/x/1c82d2c7e031f515",
    "timestamp": "2025-03-06T01:52:33Z"
  },
  {
    "title": "Donald Trump Approval Rating With Hispanics Is Highest Since Taking Office",
    "description": "Trump has significantly improved his standing with Hispanic Americans over the course of his political career.",
    "link": "https://biztoc.com/x/a4790befd2275a3a",
    "timestamp": "2025-03-06T01:52:25Z"
  },
  {
    "title": "‘The View’ host Sunny Hostin scolds Democrats for not walking out of Trump speech to Congress",
    "description": "\"The View\" co-host Sunny Hostin called out Democratic lawmakers who attended President Donald Trump's address to Congress Tuesday night for not walking out on the president after Rep. Al Green was removed for being disruptive.",
    "link": "https://nypost.com/2025/03/05/media/the-view-host-sunny-hostin-scolds-democrats-for-not-walking-out-of-trump-speech-to-congress/",
    "timestamp": "2025-03-06T01:51:36Z"
  },
  {
    "title": "Wall Street ends higher as markets eye easing of trade tensions",
    "description": "Wall Street indexes rose on Wednesday amid hopes of easing US trade tensions, especially from the postponement of auto tariffs on Canada and Mexico. Early optimism from an ISM services report was tempered by increased input prices and slow private payroll gro…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-as-markets-eye-easing-of-trade-tensions/articleshow/118746729.cms",
    "timestamp": "2025-03-06T01:51:02Z"
  },
  {
    "title": "MSNBC host laments Democrats' 'visuals' at Trump speech: 'Not taking back the House in 2026' (Heather Hunter/Washington Examiner)",
    "description": "Heather Hunter / Washington Examiner:\nMSNBC host laments Democrats' ‘visuals’ at Trump speech: ‘Not taking back the House in 2026’  —  MSNBC host Symone Sanders-Townsend criticized Democrats who protested at President Donald Trump's joint address to Congress …",
    "link": "https://www.memeorandum.com/250305/p168",
    "timestamp": "2025-03-06T01:50:06Z"
  },
  {
    "title": "US Customs has started releasing seized crypto miners: Report",
    "description": "The US Customs and Border Protection department has reportedly started releasing Bitcoin miners from various ports after months of delay.",
    "link": "https://cointelegraph.com/news/us-customs-releasing-seized-crypto-miners-report",
    "timestamp": "2025-03-06T01:48:11Z"
  },
  {
    "title": "Donald Trump Approval Rating With Hispanics Is Highest Since Taking Office",
    "description": "Trump has significantly improved his standing with Hispanic Americans over the course of his political career.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-hispanics-highest-since-taking-office-2040308",
    "timestamp": "2025-03-06T01:47:55Z"
  },
  {
    "title": "Sony and Suntory build U.S. stockpiles as Japan faces Trump tariff threat",
    "description": "In his latest trade salvo this week, U.S. President Donald Trump hinted that he might target Tokyo next, after imposing tariffs on Mexico and China.",
    "link": "https://www.japantimes.co.jp/business/2025/03/06/companies/japan-firms-trump-tariff-guard/",
    "timestamp": "2025-03-06T01:43:00Z"
  },
  {
    "title": "USAID head Peter Marocco tells lawmakers he's eyeing potential criminal charges for foreign aid fraud: report",
    "description": "The head of USAID told lawmakers Wednesday his staff was preparing potential criminal referrals against those who allegedly misused taxpayer dollars.",
    "link": "https://www.foxnews.com/politics/usaid-head-peter-marocco-tells-lawmakers-hes-eyeing-potential-criminal-charges-foreign-aid-fraud-report",
    "timestamp": "2025-03-06T01:42:41Z"
  },
  {
    "title": "CK Hutchison shares jump, extending gains on ports deal",
    "description": "HONG KONG :Shares of CK Hutchison rose 12.4 per cent in Hong Kong on Thursday, extending the previous day's 21.9 per cent gain after the sale of its Panama Canal stake to BlackRock.The stock rose to as much as HK$52.95, the highest since May 11, 2023. That ou…",
    "link": "https://www.channelnewsasia.com/business/ck-hutchison-shares-jump-extending-gains-ports-deal-4980671",
    "timestamp": "2025-03-06T01:42:10Z"
  },
  {
    "title": "'Tariff war, a trade war or any other type of war' — China says it's ready to fight U.S. until the end",
    "description": "China said it was prepared to fight \"any type of war\" with the U.S., as President Donald Trump ratchets up economic and political pressure on the country.\n\"If war is what the U.S. wants, be it a tariff war, a trade war or any other type of war, we're ready to…",
    "link": "https://biztoc.com/x/840e504113df8c6e",
    "timestamp": "2025-03-06T01:41:28Z"
  },
  {
    "title": "Trump administration can remove head of federal watchdog agency, appeals court rules",
    "description": "A U.S. appeals court has sided with the administration in allowing the removal of Hampton Dellinger from the Office of Special Counsel. The office investigates actions like whistleblower retaliation.",
    "link": "https://www.npr.org/2025/03/05/nx-s1-5319326/trump-hampton-dellinger-watchdog-appeals-court",
    "timestamp": "2025-03-06T01:41:22Z"
  },
  {
    "title": "Auto-parts supplier Linamar wants permanent deferment of U.S. tariffs to avoid shutdown",
    "description": "Linamar Corp. LNR-T executive chair Linda Hasenfratz says the North American auto industry needs a permanent reprieve from U.S. tariffs to avoid a shutdown, not the 30-day pause announced by U.S. President Donald Trump on Wednesday.\nMr. Trump imposed 25-per-c…",
    "link": "https://biztoc.com/x/f1cd99cc2a9d9638",
    "timestamp": "2025-03-06T01:40:59Z"
  },
  {
    "title": "US stops sharing air quality data, raising scientists’ concerns",
    "description": "NEW DELHI — The U.S. government will stop sharing air quality data gathered from its embassies and consulates, worrying local scientists and experts who say the effort was vital to monitor global air quality and improve public health.\n\n\nIn response to an inqu…",
    "link": "https://www.voanews.com/a/us-stops-sharing-air-quality-data-raising-scientists-concerns-/7999654.html",
    "timestamp": "2025-03-06T01:38:19Z"
  },
  {
    "title": "Stranded astronaut confirms Biden shot down Musk's offer to bring pair home: 'Absolutely factual'",
    "description": "One of the NASA astronauts trapped on the International Space Station said he believes Elon Musk’s claim that the Biden administration rejected his offer to help bring the team home.",
    "link": "https://nypost.com/2025/03/05/us-news/stranded-astronaut-confirms-biden-shot-down-musks-offer-to-bring-pair-home-absolutely-factual/",
    "timestamp": "2025-03-06T01:37:19Z"
  }
]