[
  {
    "title": "Scott Bessent: Slowed Job Growth Is Due to 2 Million Deportations; Americans Are 'Doing Quite Well' Getting Jobs",
    "description": "Treasury Sec. Scott Bessent said U.S. job growth has slowed down in part due to two million illegals being deported or self-deporting.\nThe post Scott Bessent: Slowed Job Growth Is Due to 2 Million Deportations; Americans Are ‘Doing Quite Well’ Getting Jobs ap…",
    "link": "https://www.breitbart.com/economy/2025/10/15/scott-bessent-slowed-job-growth-due-to-2-million-deportations-americans-doing-quite-well-getting-jobs/",
    "timestamp": "2025-10-15T19:24:46Z"
  },
  {
    "title": "Trump-Allied Erebor Gains Federal Charter for Crypto Bank, Shaking Up Stablecoin Wars",
    "description": "The bank, backed by some of Silicon Valley’s most prominent White House allies, now boasts a key advantage in the race to dominate the emerging U.S. stablecoin market.",
    "link": "https://decrypt.co/344456/trump-allied-erebor-gains-federal-charter-crypto-bank-stablecoin-wars",
    "timestamp": "2025-10-15T19:24:35Z"
  },
  {
    "title": "‘Trump knows this’: Analysts say this Cabinet member is president's 'biggest threat'",
    "description": "Two analysts say that one politician who has \"a cult of his own\" represents the biggest threat to President Donald Trump. Former Republican strategist Rick Wilson and journalist Molly Jong-Fast posited that Trump is afraid of Robert F. Kennedy Jr., his secret…",
    "link": "https://www.rawstory.com/robert-f-kennedy-jr-2674200926/",
    "timestamp": "2025-10-15T19:24:24Z"
  },
  {
    "title": "The only GOP gubernatorial candidates running in 2025 elections lean into Trump's MAGA campaign tactics",
    "description": "New Jersey's Jack Ciattarelli and Virginia Lt. Gov. Winsome Earle-Sears adopt President Donald Trump's campaign strategies ahead of November 4 elections.",
    "link": "https://www.foxnews.com/politics/only-gop-gubernatorial-candidates-running-2025-elections-lean-trumps-maga-campaign-tactics",
    "timestamp": "2025-10-15T19:22:28Z"
  },
  {
    "title": "The Jan. 6 attack gets in the way of Republican Party talking points (again)",
    "description": "There have been jokes about Republicans forgetting who was president in 2020, but the GOP’s habit of forgetting about the Jan. 6 attack is far less funny.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jan-6-attack-gets-way-republican-party-talking-points-rcna237847",
    "timestamp": "2025-10-15T19:20:42Z"
  },
  {
    "title": "House Republican shrugs off farm bankruptcies in his own state: No 'free pass'",
    "description": "U.S. Rep. Dusty Johnson (R-SD) assured CNN anchor John Berman that farmers are enduring the collapse of the U.S. soybean market, despite President Donald Trump disrupting all sales to their biggest international buyer.“I was at the Farm Aid concert in Minneso…",
    "link": "https://www.rawstory.com/dusty-johnson-2674202221/",
    "timestamp": "2025-10-15T19:20:35Z"
  },
  {
    "title": "US War Secretary threatens Russia",
    "description": "Washington will “impose costs” on Moscow if the Ukraine conflict isn’t settled, US War Secretary Pete Hegseth has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626500-us-war-secretary-threatens-russia/",
    "timestamp": "2025-10-15T19:20:03Z"
  },
  {
    "title": "Trump says Israel could resume fighting in Gaza if Hamas fails to uphold ceasefire deal, CNN reports",
    "description": "President Donald Trump stated that Israel would resume military action in Gaza if Hamas violates the ceasefire agreement. He indicated that Israel is prepared to re-enter the streets and confront Hamas if the terms of the deal are not met, particularly regard…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-israel-could-resume-fighting-in-gaza-if-hamas-fails-to-uphold-ceasefire-deal-cnn-reports/articleshow/124589155.cms",
    "timestamp": "2025-10-15T19:18:10Z"
  },
  {
    "title": "Government Shutdown Day 15: White House Warns More Than 10,000 Jobs Could Be Cut As Court Pauses Firings",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/15/government-shutdown-day-15-white-house-warns-more-than-10000-jobs-could-be-cut-as-court-pauses-firings/",
    "timestamp": "2025-10-15T19:17:56Z"
  },
  {
    "title": "Judge dismisses young climate activists’ lawsuit challenging Trump on fossil fuels",
    "description": "A federal judge in Montana has dismissed a lawsuit from young climate activists seeking to block President Donald Trump’s executive orders promoting fossil fuels",
    "link": "https://abcnews.go.com/US/wireStory/judge-dismisses-young-climate-activists-lawsuit-challenging-trump-126558164",
    "timestamp": "2025-10-15T19:17:53Z"
  },
  {
    "title": "Trump threatened to move World Cup games away from Boston, but it’s up to FIFA to pick sites",
    "description": "“We could take them away,” President Donald Trump said of the World Cup games. “I love the people of Boston and I know the games are sold out. But your mayor is not good.”",
    "link": "https://biztoc.com/x/493487186c20f74c",
    "timestamp": "2025-10-15T19:17:53Z"
  },
  {
    "title": "Trump: Israel could return to fighting in Gaza if Hamas violates deal",
    "description": "President Trump tells CNN Israel could return to Gaza 'as soon as I say the word' if Hamas fails to meet ceasefire terms, including full hostage return.",
    "link": "https://www.israelnationalnews.com/news/416308",
    "timestamp": "2025-10-15T19:17:47Z"
  },
  {
    "title": "Navi Mumbai: 2 men arrested for sexually assaulting 3 minor girls in Turbhe and Khandeshwar",
    "description": "Navi Mumbai: Two separate Pocso cases have been registered at Khandeshwar and Turbhe police stations on Sunday wherein two accused men have been arres.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/navi-mumbai-2-men-arrested-for-sexually-assaulting-3-minor-girls-in-turbhe-and-khandeshwar/articleshow/124589090.cms",
    "timestamp": "2025-10-15T19:15:38Z"
  },
  {
    "title": "Secrets of Happiness",
    "description": "So I might be the happiest human being on the planet. How and why? Some honest thoughts: First, I think this is like an insanely huge one, the criticality of this new big thought: trying to get 12 hours of sleep a night. At first I think a lot of people thoug…",
    "link": "https://erickimphotography.com/blog/2025/10/15/secrets-of-happiness-2/",
    "timestamp": "2025-10-15T19:15:33Z"
  },
  {
    "title": "Dhuper, Senapati take Odisha to safety in Ranji Trophy opener against Baroda",
    "description": "Odisha staged a remarkable recovery on day one of their Ranji Trophy opener against Baroda, thanks to a crucial 156-run partnership for the fifth wicket. After a dramatic top-order collapse saw them slump to 49 for four, Subhranshu Senapati (79) and Rajesh Dh…",
    "link": "https://timesofindia.indiatimes.com/city/cuttack/dhuper-senapati-take-odisha-to-safety-in-ranji-trophy-opener-against-baroda/articleshow/124589033.cms",
    "timestamp": "2025-10-15T19:14:56Z"
  },
  {
    "title": "Digital moral science book for Karnataka schools from Nov 1",
    "description": "Bengaluru: The dept of school education and literacy will roll out a digital copy of the moral science book in govt schools on Nov 1.The govt had anno.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/digital-moral-science-book-for-karnataka-schools-from-nov-1/articleshow/124589069.cms",
    "timestamp": "2025-10-15T19:14:18Z"
  },
  {
    "title": "Princeton and MIT bring back SAT/ACT: Why is Columbia still test-optional?",
    "description": "Columbia University has emerged as the last Ivy League school to maintain a fully test-optional admissions policy, even as peers like Princeton and MIT reinstate SAT and ACT requirements. The policy, aimed at promoting equity and holistic evaluation, has spar…",
    "link": "https://timesofindia.indiatimes.com/education/news/princeton-and-mit-bring-back-sat/act-why-is-columbia-still-test-optional/articleshow/124588484.cms",
    "timestamp": "2025-10-15T19:12:59Z"
  },
  {
    "title": "Convent Road in Bengaluru in shambles again with open drain, illegal parking",
    "description": "Bengaluru: One of the oldest schools in Bengaluru is unable to function peacefully, all thanks to poor-quality roads and indiscriminate parking. Conve.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/convent-road-in-bengaluru-in-shambles-again-with-open-drain-illegal-parking/articleshow/124589016.cms",
    "timestamp": "2025-10-15T19:12:31Z"
  },
  {
    "title": "Supreme Court Voting-Rights Ruling Could Blow Up Midterms",
    "description": "Justices seem ready to weaken the Voting Rights Act. The ruling could erase minority districts, locking in GOP House control in 2026 and beyond.",
    "link": "http://nymag.com/intelligencer/article/supreme-court-voting-rights-ruling-could-blow-up-midterms.html",
    "timestamp": "2025-10-15T19:12:00Z"
  },
  {
    "title": "Trump threatened to move World Cup games away from Boston, but it’s up to FIFA to pick sites",
    "description": "“We could take them away,” President Donald Trump said of the World Cup games. “I love the people of Boston and I know the games are sold out. But your mayor is not good.”",
    "link": "https://www.pbs.org/newshour/politics/trump-threatened-to-move-world-cup-games-away-from-boston-but-its-up-to-fifa-to-pick-sites",
    "timestamp": "2025-10-15T19:11:24Z"
  },
  {
    "title": "Alaska process ‘not finished’ – Lavrov",
    "description": "Moscow is still waiting for an American response to its Ukraine conflict peace roadmap, Foreign Minister Sergey Lavrov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626499-alaska-process-not-finished-lavrov/",
    "timestamp": "2025-10-15T19:11:12Z"
  },
  {
    "title": "Calangute liquor shops shut for booze sale after 10pm",
    "description": "Calangute: Several retail and wholesale liquor outlets in Calangute, found selling alcohol after 10pm, were shut down by the excise department on Tues.",
    "link": "https://timesofindia.indiatimes.com/city/goa/calangute-liquor-shops-shut-for-booze-sale-after-10pm/articleshow/124588915.cms",
    "timestamp": "2025-10-15T19:10:35Z"
  },
  {
    "title": "Kiran Mazumdar-Shaw finds support from BJP MP; Lad continues tirade",
    "description": "Bengaluru: Even as brickbats kept streaming in from ministers for a second straight day, Biocon chief Kiran Mazumdar-Shaw Wednesday found an ally in B.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/kiran-mazumdar-shaw-finds-support-from-bjp-mp-lad-continues-tirade/articleshow/124588948.cms",
    "timestamp": "2025-10-15T19:09:48Z"
  },
  {
    "title": "Mumbai Fire Brigade appeals to citizens to celebrate Diwali responsibly by following safety norms",
    "description": "Mumbai: Mumbai Fire Brigade has appealed to citizens to celebrate Diwali responsibly by following safety norms and avoiding activities that cause air .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-fire-brigade-appeals-to-citizens-to-celebrate-diwali-responsibly-by-following-safety-norms/articleshow/124588941.cms",
    "timestamp": "2025-10-15T19:09:44Z"
  },
  {
    "title": "Bihar in driver’s seat against Arunachal Pradesh in Ranji Trophy opener",
    "description": "Sakib Hussain's stellar six-wicket haul and Ayush Loharuka's unbeaten 155 powered Bihar to a commanding position against Arunachal Pradesh on Day 1. Arunachal Pradesh was dismissed for a mere 105. Bihar responded strongly, ending the day at 283/2, securing a …",
    "link": "https://timesofindia.indiatimes.com/city/patna/bihar-in-drivers-seat-against-arunachal-pradesh-in-ranji-trophy-opener/articleshow/124588166.cms",
    "timestamp": "2025-10-15T19:08:42Z"
  },
  {
    "title": "‘Focus is on strengthening position as year-round tourism destination’ - Tourism ministers’ conference",
    "description": "Panaji: At the tourism ministers’ conference that concluded in Udaipur on Wednesday, the tourism department emphasised its commitment to enhancing inf.",
    "link": "https://timesofindia.indiatimes.com/city/goa/focus-is-on-strengthening-position-as-year-round-tourism-destination-tourism-ministers-conference/articleshow/124588883.cms",
    "timestamp": "2025-10-15T19:08:27Z"
  },
  {
    "title": "Judge temporarily blocks the Trump administration from firing workers during the government shutdown",
    "description": "A federal judge has temporarily blocked President Donald Trump’s administration from firing workers during the government shutdown, saying the human cost \"cannot be tolerated.”.",
    "link": "https://www.ksat.com/business/2025/10/15/judge-says-shes-inclined-to-block-the-trump-administration-from-firing-workers-during-the-shutdown/",
    "timestamp": "2025-10-15T19:07:55Z"
  },
  {
    "title": "Navi Mumbai: PAP protest against chemical plant project",
    "description": "Navi Mumbai: People protesting against the Rashtriya Chemicals and Fertilisers (RCF) project lit up vehicle tyres opposite the RCF-Thal unit, Alibag o.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/navi-mumbai-pap-protest-against-chemical-plant-project/articleshow/124588900.cms",
    "timestamp": "2025-10-15T19:07:54Z"
  },
  {
    "title": "Judge dismisses young climate activists’ lawsuit challenging Trump on fossil fuels",
    "description": "The plaintiffs included youths who were victorious in a landmark climate trial against Montana.",
    "link": "https://www.bostonherald.com/2025/10/15/youth-climate-lawsuit-trump-dismissed/",
    "timestamp": "2025-10-15T19:07:34Z"
  },
  {
    "title": "'Dr. Antifa's' Mediterranean move partially financed by fellow Rutgers professors, other American academics",
    "description": "Mark Bray, dubbed 'Dr. Antifa,' flees to Spain with wife after President Donald Trump announces crackdown on Antifa and receives support from fellow academics.",
    "link": "https://www.foxnews.com/us/dr-antifa-mediterranean-move-partially-financed-by-fellow-rutgers-professors-other-american-academics",
    "timestamp": "2025-10-15T19:07:26Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow from Judge Over Shutdown Layoffs",
    "description": "A federal judge in California has temporarily blocked the Trump administration from proceeding with mass layoffs of federal workers during the ongoing partial government shutdown. U.S. District Judge Susan Illston issued the order Wednesday in San Francisco a…",
    "link": "https://biztoc.com/x/6802b65a79e24423",
    "timestamp": "2025-10-15T19:07:07Z"
  },
  {
    "title": "What Donald Trump gets right in the Middle East",
    "description": "What Donald Trump gets right in the Middle East\nIt’s not what you think\nMany american presidents try to ignore the Middle East. Barack Obama wanted to pivot to Asia; Joe Biden told advisers to keep the region off his desk. But it is not so easily ignored. The…",
    "link": "https://biztoc.com/x/0f2265b7d242b808",
    "timestamp": "2025-10-15T19:07:04Z"
  },
  {
    "title": "Ganeshpuri dacoity: B’desh duo remanded in 9-day custody",
    "description": "Mapusa: The Mapusa court on Wednesday remanded two Bangladeshi nationals, arrested in connection with the Ganeshpuri dacoity, to nine days in police c.",
    "link": "https://timesofindia.indiatimes.com/city/goa/ganeshpuri-dacoity-bdesh-duo-remanded-in-9-day-custody/articleshow/124588853.cms",
    "timestamp": "2025-10-15T19:07:03Z"
  },
  {
    "title": "The Abu Dhabi investor that's funding AI while trying to save TikTok — with help from Trump",
    "description": "Abu Dhabi's MGX, launched last year, has emerged as one of the key players funding the AI boom and is now part owner of TikTok's U.S. business.",
    "link": "https://www.cnbc.com/2025/10/15/abu-dhabis-mgx-investments-in-trump-crypto-tiktok-openai-.html",
    "timestamp": "2025-10-15T19:05:25Z"
  },
  {
    "title": "3603 - It's Taco Trump China Version; No Kings Protests w/ Jostein Hauge, Hunter Dunn",
    "description": "It's Hump Day on the Majority Report On today's show: Trump uses the government shutdown as an excuse to slash \"Democrat programs\" even though these cuts have been in motion since before the shutdown began. Michigan Senator Abdul El-Sayed makes an explainer v…",
    "link": "https://majorityfm.libsyn.com/3603-its-taco-trump-china-version-no-kings-protests-w-jostein-hauge-hunter-dunn",
    "timestamp": "2025-10-15T19:05:00Z"
  },
  {
    "title": "JD Vance’s ‘Hitler’ Comment Haunts Him In Heated CNN Panel On Young Republicans’ Racist Texts",
    "description": "The vice president addressed the recent scandal involving highly offensive messages between Young Republican leaders by deflecting to a Democrat.",
    "link": "https://www.huffpost.com/entry/jd-vance-address-young-republican-group-chat-cnn-hitler_n_68efc590e4b04b9d4235b8d2",
    "timestamp": "2025-10-15T19:05:00Z"
  },
  {
    "title": "Judge blocks Trump from firing federal workers during government shutdown for now",
    "description": "The Trump administration warned it would use the shutdown to shed federal jobs. President Trump  said that the cuts were aimed at \"Democrat agencies.\"",
    "link": "https://www.cnbc.com/2025/10/15/judge-trump-jobs-government-shutdown.html",
    "timestamp": "2025-10-15T19:04:28Z"
  },
  {
    "title": "EXCLUSIVE: ICE Agents Still ‘Risking Their Lives’ Despite ‘Working Without Pay’ Amid Shutdown",
    "description": "FIRST ON THE DAILY SIGNAL—U.S. Immigration and Customs Enforcement agents continuing to risk their lives arresting criminal illegal aliens even while not being paid during... Read More\nThe post EXCLUSIVE: ICE Agents Still ‘Risking Their Lives’ Despite ‘Workin…",
    "link": "https://www.dailysignal.com/2025/10/15/exclusive-ice-agents-still-risking-their-lives-despite-working-without-pay-amid-shutdown/",
    "timestamp": "2025-10-15T19:04:02Z"
  },
  {
    "title": "Judge orders Trump administration to pause shutdown layoffs",
    "description": "Last week the Trump administration began the process of laying off about 4,000 workers, saying it was due to the federal shutdown.",
    "link": "https://www.bbc.com/news/articles/c2056ynn2ppo",
    "timestamp": "2025-10-15T19:02:35Z"
  },
  {
    "title": "Democratic Establishment Targets Maine Working-Class Senate Candidate Graham Planter",
    "description": "Shortly after Maine Gov. Janet Mills announced her candidacy for the US Senate on Tuesday, journalists noted her campaign's joint fundraising committee with the Democratic establishment—which swiftly drew strong criticism, given that she has a primary opponen…",
    "link": "https://www.commondreams.org/news/2026-maine-senate-race",
    "timestamp": "2025-10-15T19:02:25Z"
  },
  {
    "title": "“House of Dynamite” Shows That Missile Defense Is a Dangerous Fantasy",
    "description": "The new film \"House of Dynamite\" demonstrates that a leak proof missile shield like the proposed Golden Dome is a dangerous fantasy.",
    "link": "https://www.forbes.com/sites/williamhartung/2025/10/15/house-of-dynamite-shows-that-missile-defense-is-a-dangerous-fantasy/",
    "timestamp": "2025-10-15T19:00:43Z"
  },
  {
    "title": "Judge temporarily blocks Trump’s firing of federal workers during shutdown",
    "description": "A federal judge has temporarily blocked President Donald Trump’s administration from firing workers during the government shutdown.",
    "link": "https://www.pbs.org/newshour/nation/judge-temporarily-blocks-trumps-firing-of-federal-workers-during-shutdown",
    "timestamp": "2025-10-15T19:00:26Z"
  },
  {
    "title": "Crude Oil Could Fall Below $50, BofA Warns",
    "description": "Oil prices extended losses on Wednesday as rising OPEC+ supply and escalating U.S.-China trade tensions deepened concerns over global demand, prompting Bank of America to warn that Brent crude could drop below $50 per barrel in the months ahead. In midday tra…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Crude-Oil-Could-Fall-Below-50-BofA-Warns.html",
    "timestamp": "2025-10-15T19:00:00Z"
  },
  {
    "title": "Hackers Hit Airport PA Systems With Pro-Palestine Messages Denouncing Trump and Benjamin Netanyahu",
    "description": "Flights were briefly delayed by hacks of the public address systems at two North American airports where travelers heard pro-Palestinian messages praising Hamas and denouncing President Donald Trump and Israeli Prime Minister Benjamin Netanyahu.\nThe post Hack…",
    "link": "https://www.breitbart.com/middle-east/2025/10/15/hackers-hit-airport-pa-systems-with-pro-palestine-messages-denouncing-trump-and-benjamin-netanyahu/",
    "timestamp": "2025-10-15T18:57:33Z"
  },
  {
    "title": "Ukraine imposes blackouts in most regions after Russian power grid attacks",
    "description": "This will be the fourth consecutive winter of outages since Russia launched its full-scale invasion in February 2022.",
    "link": "https://www.bbc.com/news/articles/c15p32dvy0vo",
    "timestamp": "2025-10-15T18:57:10Z"
  },
  {
    "title": "Lawrence O’Donnell Slams Trump for Not Firing Aide Tied to Leaked ‘I Love Hitler’ Group Chat | Video",
    "description": "\"Elon Musk and Donald Trump this year have fired thousands of federal workers, but they're keeping this guy?\" the \"Last Word\" host questions\nThe post Lawrence O’Donnell Slams Trump for Not Firing Aide Tied to Leaked ‘I Love Hitler’ Group Chat | Video appeared…",
    "link": "https://www.thewrap.com/lawrence-odonnell-trump-michael-bartels-i-love-hitler-young-republican-group-chat/",
    "timestamp": "2025-10-15T18:56:58Z"
  },
  {
    "title": "Argentina First? Trump Treasury Sec Reveals Bailout Amount Has Doubled",
    "description": "One day after Donald Trump celebrated a multibillion dollar bailout for Argentina, his administration moved to double the ante.Treasury Secretary Scott Bessent told reporters at the Treasury building Wednesday that the U.S. is “working on a $20 billion facili…",
    "link": "https://newrepublic.com/post/201811/donald-trump-treasury-secretary-argentina-bailout-doubled",
    "timestamp": "2025-10-15T18:56:32Z"
  },
  {
    "title": "Austin’s ‘Black Artists Matter’ Mural, Rainbow Crosswalk May Be Removed",
    "description": "The removal is part of a larger federal directive under the Trump administration to get rid of political and artistic road murals across the country.",
    "link": "https://www.artnews.com/art-news/news/austin-black-artists-matter-rainbow-crosswalk-to-be-removed-1234757239/",
    "timestamp": "2025-10-15T18:56:16Z"
  },
  {
    "title": "From Doubters to Leaders-India Emerges as Engine of World Economy: Gaurav",
    "description": "STATE TIMES NEWS JAMMU: BJP Spokesperson for Jammu & Kashmir UT, Gaurav Gupta, has welcomed the recent remarks by IMF Managing Director Kristalina Georgieva, calling them a powerful global endorsement of Prime Minister Narendra Modi’s visionary economic leade…",
    "link": "https://statetimes.in/from-doubters-to-leaders-india-emerges-as-engine-of-world-economy-gaurav/",
    "timestamp": "2025-10-15T18:55:47Z"
  },
  {
    "title": "Canadian trade delegation heads back to Washington, while Ford urges Carney to 'fight back'",
    "description": "Doug Ford says Canada needs to get tougher with the U.S. as two of Prime Minister Mark Carney's top trade negotiators returned to Washington",
    "link": "https://nationalpost.com/news/politics/canadian-trade-delegation-heads-back-to-washington-while-ford-urges-carney-to-fight-back",
    "timestamp": "2025-10-15T18:55:45Z"
  },
  {
    "title": "Trump ties $20B Argentina bailout to Milei votes",
    "description": "What happened\nPresident Donald Trump Tuesday explicitly tied his $20 billion bailout for Argentina to upcoming elections in the South American country. If President Javier Milei’s party loses ground in the Oct. 26 midterms, “we are not going to be generous wi…",
    "link": "https://biztoc.com/x/498e9b164bd4bee4",
    "timestamp": "2025-10-15T18:55:30Z"
  },
  {
    "title": "Trump signs executive order to reform federal hiring practices",
    "description": "Gold has topped $4,200. Here’s why Yardeni thinks the rally could go even higher.\nInvesting.com -- President Donald Trump signed an executive order Wednesday that overhauls federal hiring procedures, requiring agencies to establish Strategic Hiring Committees…",
    "link": "https://biztoc.com/x/c1f314e5b262c188",
    "timestamp": "2025-10-15T18:55:29Z"
  },
  {
    "title": "Trump: Israel ready to strike 'as soon as I say the word'",
    "description": "United States President Donald Trump said on Wednesday he might permit Israeli Prime Minister Benjamin Netanyahu to resume military strikes in Gaza if Hamas fails to meet the terms of the ceasefire. S...",
    "link": "https://biztoc.com/x/eddb8d65fd39189a",
    "timestamp": "2025-10-15T18:55:16Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from firing workers amid government shutdown",
    "description": "The emergency order came after federal agencies started issuing layoff notices Friday aimed at reducing the size of the federal government.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_b5cb34b6-3af9-507f-a443-db619a451463.html",
    "timestamp": "2025-10-15T18:55:00Z"
  },
  {
    "title": "Republicans fume as Democrats block 9th GOP bid to reopen government",
    "description": "Senate Majority Leader John Thune, R-S.D., and Republicans believe Senate Democrats won't end the shutdown until after Saturday's protest, while open enrollment deadline looms.",
    "link": "https://www.foxnews.com/politics/republicans-fume-democrats-block-9th-gop-bid-reopen-government",
    "timestamp": "2025-10-15T18:54:53Z"
  },
  {
    "title": "Hamas claims it returned all deceased hostages in our possession",
    "description": "Hamas claims it no longer holds additional deceased hostages as the Red Cross prepares to receive several bodies, while President Trump warns fighting may resume if the deal is breached.",
    "link": "https://www.israelnationalnews.com/news/416307",
    "timestamp": "2025-10-15T18:53:00Z"
  },
  {
    "title": "Surging CO2 levels a sign Canada must resist climate backsliding: scientist",
    "description": "A leading Canadian climate scientist says a new report showing planet-warming carbon dioxide levels have soared to record amounts in 2024 is the latest sign Canada must resist pressure to backslide on climate action. The World Meteorological Organization’s an…",
    "link": "https://financialpost.com/pmn/surging-co2-levels-a-sign-canada-must-resist-climate-backsliding-scientist",
    "timestamp": "2025-10-15T18:52:32Z"
  },
  {
    "title": "US judge extends block on Trump deploying National Guard in Portland, Oregon",
    "description": "(Reuters) -A federal judge in Oregon on Wednesday extended temporary restraining orders that block President Donald Trump's administration from deploying any...",
    "link": "https://www.yahoo.com/news/articles/us-judge-extends-block-trump-185230819.html",
    "timestamp": "2025-10-15T18:52:30Z"
  },
  {
    "title": "State Data Reveals Just 0.5% of Florida ICE Detainees Are Gang-Affiliated",
    "description": "Amid repeated assertions by administration figures that President Donald Trump's deadly anti-immigrant blitz is \"targeting the worst of the worst\" among \"criminal illegal aliens,\" critics of the crackdown this week pointed to official data belying those claim…",
    "link": "https://www.commondreams.org/news/trump-lies-about-gang-members",
    "timestamp": "2025-10-15T18:51:28Z"
  },
  {
    "title": "Tim Cook's China Power Play: Apple Doubles Down as Trump's Tariff Threat Looms",
    "description": "Apple's CEO bets big on Beijing ties even as Washington pressures the tech giant to shift production abroad.",
    "link": "https://finance.yahoo.com/news/tim-cooks-china-power-play-184929776.html",
    "timestamp": "2025-10-15T18:49:29Z"
  },
  {
    "title": "JUST IN: Federal Judge Blocks Trump From More Layoffs During Shutdown",
    "description": "A federal judge on Wednesday temporarily blocked President Donald Trump’s administration from laying off more government employees, after the administration had already pushed to cut thousands of workers during the U.S. government shutdown. This is a breaking…",
    "link": "https://www.mediaite.com/media/news/just-in-federal-judge-blocks-trump-from-more-layoffs-during-shutdown/",
    "timestamp": "2025-10-15T18:49:03Z"
  },
  {
    "title": "US wants Australia's rare earths but Trump-Albanese meeting 'critical'",
    "description": "As rare earths re-emerge as a central battleground in the US-China trade war, Australian companies are already striking deals to supply America. A policy expert says talks at the White House next week could secure a national agreement.",
    "link": "https://www.abc.net.au/news/2025-10-16/us-is-open-to-make-rare-earth-deals-with-australia/105895128",
    "timestamp": "2025-10-15T18:47:30Z"
  },
  {
    "title": "GOP Blocks Warren Bill to Stop Trump’s “Brazen” $20B Argentina Bailout",
    "description": "“For Trump, the leader of Argentina is more important than American families struggling with rising costs,” said Warren.",
    "link": "https://truthout.org/articles/gop-blocks-warren-bill-to-stop-trumps-brazen-20b-argentina-bailout/",
    "timestamp": "2025-10-15T18:46:25Z"
  },
  {
    "title": "Historic squadron rebooted ahead of Albanese-Trump meeting",
    "description": "The federal government has re-established the Number 12 Squadron in SA at the same time as Australia's anti-submarine capability is expanding with the arrival of new aircraft.",
    "link": "https://www.abc.net.au/news/2025-10-16/poseidon-12-squadron-defence-air-force-australia-us-china/105895342",
    "timestamp": "2025-10-15T18:45:23Z"
  },
  {
    "title": "Trump's Health 'Troubles' Explained?: Former RFK Jr Advisor Goes Off on Prez's 'Brain Fog' as Dementia Rumors Threaten to Sink Don's Career",
    "description": "Donald Trump is believed to be dealing with several medical problems, despite the president claiming he's in the best shape ever.",
    "link": "https://radaronline.com/p/trump-health-problems-explained-rfk-jr-brain-fog-dementia-rumors/",
    "timestamp": "2025-10-15T18:45:00Z"
  },
  {
    "title": "US Air Force Boeing aircraft faces mid-air emergency, Defense Secretary Pete Hegseth likely on-board, claim",
    "description": "NATO Secretary-General Mark Rutte said he expected further pledges, noting that $2 billion already had been committed through the mechanism.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-air-force-boeing-aircraft-faces-mid-air-emergency-defense-secretary-pete-hegseth-likely-on-board-claim/articleshow/124588196.cms",
    "timestamp": "2025-10-15T18:44:58Z"
  },
  {
    "title": "Oklo And Other Nuclear Stocks — Powered By The Department Of Energy",
    "description": "The Department of Energy, under President Donald Trump, has moved aggressively to invigorate the domestic nuclear sector. \nOKLO stock is moving. See the details here. \nThe new Defense Production Act Consortium — an initiative designed to rebuild the entire U.…",
    "link": "https://biztoc.com/x/08fbd790c9d4ba1d",
    "timestamp": "2025-10-15T18:44:26Z"
  },
  {
    "title": "US is working on doubling aid to Argentina to $40 billion by tapping private funding sources",
    "description": "WASHINGTON (AP) — The Trump administration is looking to provide an additional $20 billion in financing for Argentina through a mix of financing from sovereign funds and the private sector. That would come on top of the $20 billion credit swap line that the U…",
    "link": "https://financialpost.com/pmn/us-is-working-on-doubling-aid-to-argentina-to-40-billion-by-tapping-private-funding-sources",
    "timestamp": "2025-10-15T18:44:23Z"
  },
  {
    "title": "Singapore, 'so dependent on external demand', braces for tariff hit",
    "description": "Businesses in Singapore — one of the most trade-exposed economies in the world — have been watching the fallout from Donald Trump's 'Liberation Day' tariffs with apprehension.",
    "link": "https://www.abc.net.au/news/2025-10-16/singapore-economy-business-fallout-donald-trump-tariffs/105893038",
    "timestamp": "2025-10-15T18:43:54Z"
  },
  {
    "title": "Trump’s Latest China #TACO Has $45 Trillion Riding On It",
    "description": "Mutually assured destruction between the world’s two biggest economies, with $45 trillion of annual output, is in no one’s best interest.",
    "link": "https://www.forbes.com/sites/williampesek/2025/10/15/trumps-latest-china-taco-has-45-trillion-riding-on-it/",
    "timestamp": "2025-10-15T18:42:52Z"
  },
  {
    "title": "Trump Administration Must Pause Government Shutdown Firings, Judge Rules",
    "description": "Federal agencies on Friday started issuing layoff notices aimed at reducing the size of the federal government.",
    "link": "https://www.huffpost.com/entry/government-shutdown-layoffs-blocked_n_68efe9f1e4b0ab08d3186428",
    "timestamp": "2025-10-15T18:41:28Z"
  },
  {
    "title": "Judge temporarily blocks the Trump administration from firing workers during the government shutdown",
    "description": "The administration had said it planned to fire more than 4,100 employees across eight agencies.",
    "link": "https://www.denverpost.com/2025/10/15/government-shutdown-layoffs-block/",
    "timestamp": "2025-10-15T18:41:20Z"
  },
  {
    "title": "Judge temporarily blocks the Trump administration from firing workers during the government shutdown",
    "description": "The administration had said it planned to fire more than 4,100 employees across eight agencies.",
    "link": "https://www.bostonherald.com/2025/10/15/government-shutdown-layoffs-block/",
    "timestamp": "2025-10-15T18:41:20Z"
  },
  {
    "title": "Tariffs are pushing prices higher and consumers are feeling the hit, Fed's Beige Book shows",
    "description": "Companies are caught between absorbing the costs or passing them onto customers, according to a Federal Reserve report.",
    "link": "https://www.cnbc.com/2025/10/15/tariffs-are-pushing-prices-higher-and-consumers-are-feeling-the-hit-feds-beige-book-shows.html",
    "timestamp": "2025-10-15T18:40:50Z"
  },
  {
    "title": "US is working on doubling aid to Argentina to $40 billion by tapping private funding sources",
    "description": "The Trump administration is looking to provide an additional $20 billion in financing for Argentina through a mix of financing from sovereign funds and the...",
    "link": "https://finance.yahoo.com/news/us-working-doubling-aid-argentina-184019740.html",
    "timestamp": "2025-10-15T18:40:19Z"
  },
  {
    "title": "Hold up! Judge temporarily blocks Miami land deal for Trump library",
    "description": "A judge temporarily halted the planned transfer of a valuable downtown Miami parcel slated for President Donald Trump’s future presidential library, intervening in a high-profile land deal involving public property. Miami-Dade Circuit Judge Mavel Ruiz issued …",
    "link": "https://therealdeal.com/miami/2025/10/15/judge-temporarily-halts-trump-library-land-deal/",
    "timestamp": "2025-10-15T18:40:05Z"
  },
  {
    "title": "The new age of book banning",
    "description": "How America’s culture wars collided with parents and legislators who want to keep their kids away from ‘dangerous’ ideas",
    "link": "https://theweek.com/politics/new-age-book-banning",
    "timestamp": "2025-10-15T18:38:32Z"
  },
  {
    "title": "Obama Calls Out Hypocrisy In Trump Deploying Troops To Democrat-Heavy Cities",
    "description": "Obama shrewdly imagined how things would play out if the political tables were turned.",
    "link": "https://www.huffpost.com/entry/obama-criticizes-trump-deploying-troops-inside-america_n_68efb8dbe4b0a6936a12ee62",
    "timestamp": "2025-10-15T18:34:50Z"
  },
  {
    "title": "Blue-State Governors Are Attempting to Undermine RFK Jr. by Setting Up a 'Shadow' Health Alliance",
    "description": "Several Democratic governors are forming their own health alliance separate from the federal government, due mainly to policy disagreements.",
    "link": "https://www.westernjournal.com/blue-state-governors-attempting-undermine-rfk-jr-setting-shadow-health-alliance/",
    "timestamp": "2025-10-15T18:33:38Z"
  },
  {
    "title": "Trump says Israeli forces could resume fighting in Gaza if Hamas won’t uphold ceasefire deal",
    "description": "President Donald Trump said Wednesday that he would consider allowing Israeli Prime Minister Benjamin Netanyahu to resume military action in Gaza if Hamas refuses to uphold its end of the ceasefire deal, telling CNN that Israeli forces could return to the str…",
    "link": "https://www.cnn.com/2025/10/15/politics/hamas-warning-trump-israel-gaza",
    "timestamp": "2025-10-15T18:33:14Z"
  },
  {
    "title": "Trump targets China cooking oil trade - but sales were already tanking",
    "description": "Amidst ongoing trade tensions, President Donald Trump is considering the termination of cooking oil trade agreements with China. This potential action appears to stem from a decrease in Chinese demand for American soybeans, prompting a broader reevaluation of…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-targets-china-cooking-oil-trade-but-sales-were-already-tanking/articleshow/124587941.cms",
    "timestamp": "2025-10-15T18:32:30Z"
  },
  {
    "title": "‘New media’ is just right-wing media",
    "description": "Hello and welcome to a post-October Federal Holiday edition of Regulator. Last week, I caught wind that House Speaker Mike Johnson, along with several top House Republican leaders, had held an exclusive press briefing about the government shutdown that was re…",
    "link": "https://www.theverge.com/column/799904/new-media-is-just-right-wing-media",
    "timestamp": "2025-10-15T18:30:36Z"
  },
  {
    "title": "US says ‘European-led’ Nato must deter Russia and aid Ukraine",
    "description": "Pete Hegseth indicated US would ‘impose costs’ on Russia if Ukraine war does not end",
    "link": "https://www.irishtimes.com/world/europe/2025/10/15/us-says-european-led-nato-must-deter-russia-and-aid-ukraine/",
    "timestamp": "2025-10-15T18:29:43Z"
  },
  {
    "title": "Trump Fabricates Story of Hand-to-Hand Combat Between Troops and Child Gangsters in D.C.",
    "description": "Trump’s claim that National Guard members beat child gang members on the streets of Washington was disputed even by the military.\nThe post Trump Fabricates Story of Hand-to-Hand Combat Between Troops and Child Gangsters in D.C. appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/15/trump-lie-national-guard-dc-tren-de-aragua/",
    "timestamp": "2025-10-15T18:29:35Z"
  },
  {
    "title": "Joe Rogan Drops Wild Rant On Protest Goers: They Are All ‘FBI Agents And Losers’",
    "description": "Joe Rogan mocked people who attend protests, saying \"99% are losers\" and the others are federal agents, while also saying George Soros is paying for their signs\nThe post Joe Rogan Drops Wild Rant On Protest Goers: They Are All ‘FBI Agents And Losers’ first ap…",
    "link": "https://www.mediaite.com/media/news/joe-rogan-drops-wild-rant-on-protest-goers-they-are-all-fbi-agents-and-losers/",
    "timestamp": "2025-10-15T18:28:36Z"
  },
  {
    "title": "Hegseth orders that all defense personnel review his speech to top military brass on fitness, standards | CNN Politics",
    "description": "Defense Secretary Pete Hegseth has directed US military leaders to verify that every member of the department watched the speech he delivered at an unusual gathering of senior officers in Quantico, VA last month and review the policy changes he announced in t…",
    "link": "https://www.cnn.com/2025/10/15/politics/hegseth-speech-order-review-defense",
    "timestamp": "2025-10-15T18:27:33Z"
  },
  {
    "title": "Parliament Hill journalists denounce 'unprecedented' lack of invitation for Carney's Egypt trip",
    "description": "The Parliamentary Press Gallery denounced the Liberals’ “unprecedented” exclusion of media from Prime Minister Mark Carney’s trip to Egypt.",
    "link": "https://nationalpost.com/news/politics/parliament-hill-journalists-denounce-unprecedented-lack-of-invitation-for-carneys-egypt-trip",
    "timestamp": "2025-10-15T18:25:45Z"
  },
  {
    "title": "Washington, D.C. Mayor Muriel Bowser says fear of ICE is disrupting business: ‘People aren’t going to work’",
    "description": "D.C.’s mayor says the city is still on edge amid National Guard deployments, immigration sweeps, and a shrinking federal footprint.",
    "link": "https://fortune.com/2025/10/15/washington-dc-mayor-muriel-bowser-ice-national-guard-business-disruption/",
    "timestamp": "2025-10-15T18:25:15Z"
  },
  {
    "title": "Ukrainian officials meet with US weapons manufacturers before Trump-Zelenskyy talks",
    "description": "In a pivotal meeting, Ukraine's government engaged with leading American defense contractors, expressing a strong desire for cutting-edge military technology such as cruise missiles and sophisticated air defense systems. The dialogue also explored potential U…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukrainian-officials-meet-with-us-weapons-manufacturers-before-trump-zelenskyy-talks/articleshow/124587700.cms",
    "timestamp": "2025-10-15T18:24:34Z"
  },
  {
    "title": "Teenagers Who Assaulted 'Big Balls' DOGE Staffer Avoid Jail, Get Probation",
    "description": "Two of the teens who assaulted former DOGE staffer Edward “Big Balls” Coristine have avoided incarceration and been put on probation.\nThe post Teenagers Who Assaulted ‘Big Balls’ DOGE Staffer Avoid Jail, Get Probation appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/10/15/teenagers-who-assaulted-big-balls-doge-staffer-avoid-jail-get-probation/",
    "timestamp": "2025-10-15T18:23:58Z"
  },
  {
    "title": "Kamala Harris Cites Tim Walz To Make New Bizarre Claim About Failed Presidential Run",
    "description": "Kamala Harris claimed in an interview with liberal podcaster Kara Swisher on Oct. 9 that she was the most qualified presidential candidate in U.S. history.",
    "link": "https://dailycaller.com/2025/10/15/kamala-harris-book-tour-kara-swisher-interview-most-qualified-candidate-ever-tim-walz/",
    "timestamp": "2025-10-15T18:18:17Z"
  }
]