[
  {
    "title": "Trump’s use of the National Guard sets up a legal clash testing presidential power",
    "description": "Lawsuits will likely address significant questions of constitutional law, federalism and the separation of powers.",
    "link": "https://www.bostonherald.com/2025/10/06/trump-national-guard/",
    "timestamp": "2025-10-06T19:25:21Z"
  },
  {
    "title": "Manosphere Influencers Who Boosted Trump Are Now Cooling on Him",
    "description": "Prominent influencers including Theo Von, Joe Rogan, and Andrew Schulz are starting to distance themselves from Donald Trump and his policies.",
    "link": "http://www.rollingstone.com/politics/politics-news/theo-von-joe-rogan-manosphere-influencers-trump-1235441563/",
    "timestamp": "2025-10-06T19:24:58Z"
  },
  {
    "title": "Trump says 25% tariff for medium and heavy duty trucks to start Nov. 1",
    "description": "Trump last month had said heavy truck imports would face new duties as soon as October. 1.",
    "link": "https://indianexpress.com/article/world/trump-says-25-tariff-for-medium-and-heavy-duty-trucks-to-start-nov-1-10291857/",
    "timestamp": "2025-10-06T19:24:05Z"
  },
  {
    "title": "CT spends over $100M on health care for immigrants without legal status as shutdown debate rages - NewsBreak",
    "description": "CT spends over $100M on health care for immigrants without legal status as shutdown debate rages - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4276011366863-ct-spends-over-100m-on-health-care-for-immigrants-without-legal-status-as-shutdown-debate-rages?_f=app_share&amp;pd=026byXUZ&amp;lang=en_US&amp;send_time=1759778438&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.40.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2&amp;s=i2",
    "timestamp": "2025-10-06T19:21:33Z"
  },
  {
    "title": "A knife-edge moment in the Middle East as peace talks begin",
    "description": "A knife-edge moment in the Middle East as peace talks begin\nEven if hostages are released will Hamas disarm?\nIF THERE WERE a Nobel prize for trying to will things to become reality, Donald Trump would already be a shoo-in. Since September 29th, when he offere…",
    "link": "https://biztoc.com/x/13c0345e2e3b6960",
    "timestamp": "2025-10-06T19:20:06Z"
  },
  {
    "title": "‘He Should Step Out’: Former Biden Official Meghan Hays Torches Jay Jones Over Disgusting Texts",
    "description": "Former Biden administration official Meghan Hays condemned Democratic Virginia Attorney General candidate Jay Jones on Monday over violent texts he sent.",
    "link": "https://dailycaller.com/2025/10/06/former-biden-official-meghan-hays-torches-jay-jones-over-disgusting-texts/",
    "timestamp": "2025-10-06T19:19:49Z"
  },
  {
    "title": "U.S Government shutdown: Will salaries be paid on October 15?",
    "description": "Republicans and Democrats remained at an impasse and the White House threatened to ramp up pressure by ordering more layoffs of federal workers, after cutting hundreds of thousands of jobs earlier this year.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-government-shutdown-will-salaries-be-paid-on-october-15/articleshow/124347775.cms",
    "timestamp": "2025-10-06T19:19:44Z"
  },
  {
    "title": "White House Warns of ‘A Lot of Pain Inflicted’ On Americans From the Shutdown",
    "description": "“Look, as I said, unfortunately, there's going to be a lot of pain inflicted. There already is on the American public,\" Leavitt said\nThe post White House Warns of ‘A Lot of Pain Inflicted’ On Americans From the Shutdown first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/white-house-warns-of-a-lot-of-pain-inflicted-on-americans-from-the-shutdown/",
    "timestamp": "2025-10-06T19:19:14Z"
  },
  {
    "title": "America is now one big bet on AI",
    "description": "Without all the excitement around AI, the U.S. economy might be stalling out, given the multiple threats it faces. Find out more",
    "link": "https://financialpost.com/financial-times/america-is-now-one-big-bet-on-ai",
    "timestamp": "2025-10-06T19:16:06Z"
  },
  {
    "title": "BREAKING: Senior Prosecutor in the Eastern District of Virginia Refuses to Charge Corrupt NY Attorney General Letitia James",
    "description": "Deep State prosecutors in the Eastern District of Virginia are leaking again – this time they are trying to defend Letitia James. A top prosecutor in the Eastern District of Virginia is refusing to charge corrupt New York Attorney General Letitia James. Accor…",
    "link": "https://freerepublic.com/focus/f-news/4344701/posts",
    "timestamp": "2025-10-06T19:15:21Z"
  },
  {
    "title": "Illinois Sues To Block National Guard Deployment In Chicago",
    "description": "The Democratic-led US state of Illinois filed suit on Monday to block President Donald Trump's deployment of National Guard troops to Chicago.",
    "link": "https://www.ibtimes.com/illinois-sues-block-national-guard-deployment-chicago-3785824",
    "timestamp": "2025-10-06T19:15:16Z"
  },
  {
    "title": "Trump hails 'wisdom and strength' of Japan's incoming prime minister",
    "description": "Media reports have said that Trump is expected to visit its key Asian ally in late October.",
    "link": "https://www.japantimes.co.jp/news/2025/10/07/japan/politics/trump-hails-takaichi-pm/",
    "timestamp": "2025-10-06T19:15:00Z"
  },
  {
    "title": "Leading Dem challenges Trump speaker to a live debate — and gets smacked down",
    "description": "“Why would he?” one House Democrat told Axios.",
    "link": "https://www.nj.com/politics/2025/10/leading-dem-challenges-trump-speaker-to-a-live-debate-and-gets-smacked-down.html",
    "timestamp": "2025-10-06T19:14:23Z"
  },
  {
    "title": "MAGA-Lite: What “Bari Weiss Conservatism” Is, and Why It’s Dangerous",
    "description": "The ascent of Bari Weiss, who Paramount announced on Monday will be editor-in-chief of CBS News, at first glance seems like a media story. But it’s really a story about American politics and the two major parties. There is a new kind of “moderate” Republican,…",
    "link": "https://newrepublic.com/article/201401/bari-weiss-cbs-news-conservatism-maga-lite",
    "timestamp": "2025-10-06T19:12:47Z"
  },
  {
    "title": "Trump's Troops Return to a City That Moved On: Dispatch From Portland",
    "description": "Five years after the city’s fiery 2020 protests, Portland is mostly calm. That hasn’t stopped Trump from reviving old battles, fueled by false memories and made-for-TV outrage.",
    "link": "https://reason.com/2025/10/06/trumps-troops-return-to-a-city-that-moved-on-dispatch-from-portland/",
    "timestamp": "2025-10-06T19:12:30Z"
  },
  {
    "title": "Acting CDC director O'Neill calls on vaccine makers to separate combined MMR shot - Yahoo",
    "description": "Acting CDC director O'Neill calls on vaccine makers to separate combined MMR shotYahoo Acting CDC director calls for MMR vaccine to be broken up into 3 shotsstatnews.com Trump's call to split up the MMR childhood vaccine revives long-settled debateCBS News Me…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179683582",
    "timestamp": "2025-10-06T19:12:09Z"
  },
  {
    "title": "Exclusive-Trump official bypassed ethics rules in criminal referrals of Fed governor and other foes, sources say",
    "description": "WASHINGTON (Reuters) -The Trump appointee accusing the president’s political foes of mortgage fraud skipped over his agency’s inspector general when making...",
    "link": "https://www.yahoo.com/news/articles/exclusive-trump-official-bypassed-ethics-191202141.html",
    "timestamp": "2025-10-06T19:12:02Z"
  },
  {
    "title": "Media Goes Full Damage Control On Jay Jones Scandal That Could Cost Dems Virginia Election",
    "description": "The legacy press is circling the wagons for Virginia attorney general candidate Jay Jones after the release of text messages that could derail his campaign.",
    "link": "https://dailycaller.com/2025/10/06/jay-jones-virginia-attorney-general-violent-text-messages-legacy-media/",
    "timestamp": "2025-10-06T19:11:42Z"
  },
  {
    "title": "Vietnam Footwear Exports Drop 27.3 Percent in September Amid Tariff Turmoil",
    "description": "Vietnam's shoe exports to the U.S. were worth $611 million in September, down 27.3 percent from $840 million in August as tariffs took hold.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/vietnam-shoe-exports-us-september-down-august-tariffs-1238284583/",
    "timestamp": "2025-10-06T19:09:50Z"
  },
  {
    "title": "A Gordian knot threatens the Gaza peace talks",
    "description": "A knife-edge moment in the Middle East as peace talks begin\nEven if hostages are released will Hamas disarm?\nIF THERE WERE a Nobel prize for trying to will things to become reality, Donald Trump would already be a shoo-in. Since September 29th, when he offere…",
    "link": "https://biztoc.com/x/d4a2674dbe2491e3",
    "timestamp": "2025-10-06T19:09:09Z"
  },
  {
    "title": "Trump-District Democrat Jared Golden Facing Primary Challenge: What to Know",
    "description": "Representative Jared Golden, a Maine Democrat who represents a district that backed President Donald Trump by 10 percentage points in last year's presidential election, is facing a primary challenge from state Auditor Matthew Dunlap.\nWhy It Matters\nGolden, fi…",
    "link": "https://biztoc.com/x/ec1212259a33eafe",
    "timestamp": "2025-10-06T19:08:57Z"
  },
  {
    "title": "Trump’s message to ‘the young people of TikTok’ and Gen Z: ‘You owe me big’",
    "description": "President Donald Trump attempted to curry favor with what he called “the young people of TikTok” on Monday, essentially arguing that Gen Z should be thankful that he didn’t ultimately follow through on his own executive order from 2020 to ban their favorite s…",
    "link": "https://biztoc.com/x/b339e7f5b56a71e2",
    "timestamp": "2025-10-06T19:08:32Z"
  },
  {
    "title": "World hits 'crucial turning point' in use of renewables",
    "description": "For the first time in history, renewable energy has produced more of the world's electricity than coal, according to a new analysis of global energy trends.",
    "link": "https://news.sky.com/story/renewable-energy-produces-more-electricity-than-coal-for-the-first-time-experts-say-13446220",
    "timestamp": "2025-10-06T19:07:00Z"
  },
  {
    "title": "White House warns of 'pain' inflicted on Americans if Democrats don't reopen government",
    "description": "The Senate is expected to vote Monday on measures to end the government shutdown as President Donald Trump and Democrats trade blame over funding impasse.",
    "link": "https://www.foxnews.com/politics/white-house-warns-pain-inflicted-americans-democrats-dont-reopen-government",
    "timestamp": "2025-10-06T19:06:47Z"
  },
  {
    "title": "Trump's use of the National Guard sets up a legal clash",
    "description": "President Donald Trump's plan to deploy the military on U.S. soil is sparking conflict with blue state governors that is playing out in the courts",
    "link": "https://www.wsbradio.com/news/politics/trumps-use-national/XZZNW35Z5Y7GRKNAMZEI37EDHE/",
    "timestamp": "2025-10-06T19:05:49Z"
  },
  {
    "title": "Trump imposing new 25% large truck tariff starting Nov. 1",
    "description": "WASHINGTON (Reuters) -President Donald Trump said Monday that all medium- and heavy-duty trucks imported into the United States will face a 25% tariff rate...",
    "link": "https://finance.yahoo.com/news/trump-imposing-25-large-truck-190528890.html",
    "timestamp": "2025-10-06T19:05:28Z"
  },
  {
    "title": "EXCLUSIVE: Red State AGs Urge Big Tech Companies Not To Cave To European Regulations",
    "description": "Republican attorneys general are urging big tech companies not to submit to European mandates that are \"unlawful in America.\"",
    "link": "https://dailycaller.com/2025/10/06/red-state-ags-urge-big-tech-companies-to-ignore-european-union-mandates/",
    "timestamp": "2025-10-06T19:04:38Z"
  },
  {
    "title": "Mayo Sees ‘Unique Window’ for Bank M&A After Comerica Deal",
    "description": "The year’s biggest US bank deal is sparking a wave of speculation about further consolidation among lenders, with an increasingly friendly regulatory climate seen as setting the stage for more tie-ups.",
    "link": "https://www.livemint.com/companies/news/mayo-sees-unique-window-for-bank-m-a-after-comerica-deal-11759777463519.html",
    "timestamp": "2025-10-06T19:04:22Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The International Organization for Migration (IOM) estimates that between 2 and 4 October, some 770 people were displaced from El Fasher, the besieged capital of Sudan’s North Darfur state, due to heightened insecurity. They also reportedly sought shelter in …",
    "link": "https://press.un.org/en/2025/db251006.doc.htm",
    "timestamp": "2025-10-06T19:03:21Z"
  },
  {
    "title": "ЕU's Von der Leyen 'Signed Surrender of Europe to Trump' – National Rally Leader",
    "description": "MOSCOW (Sputnik) - By inking an unfavorable trade deal with US President Donald Trump in July, European Commission President Ursula von der Leyen effectively \"signed surrender of Europe to Trump,\" Jordan Bardella, president of the right-wing National Rally pa…",
    "link": "https://sputnikglobe.com/20251006/eus-von-der-leyen-signed-surrender-of-europe-to-trump--national-rally-leader-1122919516.html",
    "timestamp": "2025-10-06T19:00:08Z"
  },
  {
    "title": "The Irish Times view on the Gaza talks: the possibility of progress",
    "description": "On the second anniversary of the October 7th attacks, the US tries to push Israel and Hamas towards a deal",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/10/06/the-irish-times-view-on-the-gaza-talks-the-possibility-of-progress/",
    "timestamp": "2025-10-06T19:00:00Z"
  },
  {
    "title": "Illinois sues Trump over National Guard deployment (Jon Seidel/Chicago Sun Times)",
    "description": "Jon Seidel / Chicago Sun Times:\nIllinois sues Trump over National Guard deployment  —  The lawsuit comes hours after a federal judge in Oregon barred Trump from deploying federalized members of any National Guard troops under Trump's command to Oregon.  —  Il…",
    "link": "https://www.memeorandum.com/251006/p110",
    "timestamp": "2025-10-06T19:00:00Z"
  },
  {
    "title": "Despite campaign promises, White House eyes new changes to Social Security and Medicare (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nDespite campaign promises, White House eyes new changes to Social Security and Medicare  —  “I will never do anything that will jeopardize or hurt Social Security or Medicare,” Trump vowed in 2024.  I have bad news for voters who believed…",
    "link": "https://www.memeorandum.com/251006/p112",
    "timestamp": "2025-10-06T19:00:00Z"
  },
  {
    "title": "A Trump-appointed judge just demolished right-wing fearmongering about Portland (Matt Gertz/Media Matters for America)",
    "description": "Matt Gertz / Media Matters for America:\nA Trump-appointed judge just demolished right-wing fearmongering about Portland  —  Fox News propagandists cheered last month when President Donald Trump directed Defense Secretary Pete Hegseth to send 200 National Guar…",
    "link": "https://www.memeorandum.com/251006/p111",
    "timestamp": "2025-10-06T19:00:00Z"
  },
  {
    "title": "ICE spends millions on ads to recruit police for mass deportation efforts",
    "description": "U.S. Immigration and Customs Enforcement is spending millions of dollars on TV recruitment ads targeting officers frustrated by local restrictions on immigration enforcement.",
    "link": "https://www.pbs.org/newshour/nation/ice-spends-millions-on-ads-to-recruit-police-for-mass-deportation-efforts",
    "timestamp": "2025-10-06T18:59:24Z"
  },
  {
    "title": "Trump’s message to ‘the young people of TikTok’ and Gen Z: ‘You owe me big’",
    "description": "Trump endorsed the idea of a TikTok ban all the way back in 2020.",
    "link": "https://fortune.com/2025/10/06/trump-message-to-gen-z-you-owe-me-for-saving-tiktok/",
    "timestamp": "2025-10-06T18:57:58Z"
  },
  {
    "title": "Medium-, heavy-duty trucks to face 25% tariff as of Nov. 1, Trump says",
    "description": "All medium- and heavy-duty trucks imported into the United States will face a 25 per cent tariff rate staring Nov. 1, U.S. President Donald Trump said on Monday.",
    "link": "https://biztoc.com/x/6f6b885011d09149",
    "timestamp": "2025-10-06T18:57:37Z"
  },
  {
    "title": "Trump Imposes 25% Tariff On Imported Heavy Trucks Starting November",
    "description": "President Donald Trump announced a 25% tariff on all imported medium and heavy-duty trucks, effective November 1, 2025, via a post on Truth Social. \nThe move comes after months of pushback from Detroit automakers, who warned the new duties could disrupt suppl…",
    "link": "https://biztoc.com/x/a25112302df2daa9",
    "timestamp": "2025-10-06T18:57:23Z"
  },
  {
    "title": "Eli Lilly's $1 Billion India Gamble Signals Pharma's Next Global Power Shift",
    "description": "As Trump's drug tariffs bite, Lilly doubles down on India to secure its manufacturing future",
    "link": "https://finance.yahoo.com/news/eli-lillys-1-billion-india-185718466.html",
    "timestamp": "2025-10-06T18:57:18Z"
  },
  {
    "title": "White House Declines to Comment on Options Trump Considering With Regard to Maduro",
    "description": "WASHINGTON (Sputnik) - White House press secretary Karoline Leavitt on Monday declined to comment on what options US President Donald Trump is considering in relation to the escalation between the United States and Venezuela.",
    "link": "https://sputnikglobe.com/20251006/white-house-declines-to-comment-on-options-trump-considering-with-regard-to-maduro-1122919406.html",
    "timestamp": "2025-10-06T18:57:15Z"
  },
  {
    "title": "Vulnerable House Dem dismisses primary challenger as race heats up: '30-year party crony'",
    "description": "Rep. Jared Golden faces Democratic primary from Matt Dunlap and general election against former Gov. Paul LePage in Trump-won Maine district.",
    "link": "https://www.foxnews.com/politics/vulnerable-house-dem-dismisses-primary-challenger-race-heats-up-30-year-party-crony",
    "timestamp": "2025-10-06T18:53:52Z"
  },
  {
    "title": "She avoided Tylenol during pregnancy — so why were all 3 of her kids diagnosed with Autism?",
    "description": "President Donald Trump's remarks linking Tylenol use in pregnancy to autism have angered mothers like Brittany Slawter.  She states she never took the medication for her three autistic children.  Research on the connection remains divided.  Experts note other…",
    "link": "https://economictimes.indiatimes.com/news/international/us/she-avoided-tylenol-during-pregnancy-so-why-were-all-3-of-her-kids-diagnosed-with-autism/articleshow/124347206.cms",
    "timestamp": "2025-10-06T18:52:11Z"
  },
  {
    "title": "Newsmax freaks over Bad Bunny SNL monologue as guest calls migrants ‘parasites’",
    "description": "Conservative radio host and GOP strategist Andrea Kaye attacked Puerto Rican musician Bad Bunny on Monday during an appearance on Newsmax as “anti-American” over his monologue on Saturday Night Live over the weekend, while also lambasting all undocumented mig…",
    "link": "https://www.rawstory.com/bad-bunny-2674159272/",
    "timestamp": "2025-10-06T18:52:05Z"
  },
  {
    "title": "Medium-, heavy-duty trucks to face 25% tariff as of Nov. 1, Trump says",
    "description": "All medium- and heavy-duty trucks imported into the United States will face a 25 per cent tariff rate staring Nov. 1, U.S. President Donald Trump said on Monday.",
    "link": "https://www.cbc.ca/news/business/medium-heavy-duty-trucks-tariff-trump-1.7652440",
    "timestamp": "2025-10-06T18:50:55Z"
  },
  {
    "title": "Voting underway in California on new maps that could swing House control",
    "description": "The fight for control of the U.S. House is underway in California. Voters are considering whether to drastically reshape congressional districts to add as many as five Democratic seats in advance of the 2026 midterm elections.",
    "link": "https://www.pbs.org/newshour/politics/voting-underway-in-california-on-new-maps-that-could-swing-house-control",
    "timestamp": "2025-10-06T18:50:26Z"
  },
  {
    "title": "WashPost Editorial Board Says Obamacare ‘Was Never Actually Affordable’",
    "description": "Hold on to your britches because you’re not going to believe this one. The Washington Post Editorial Board just admitted that the so-called \"Affordable Care Act,\" one the most notorious pieces of Obama-era legislation foisted upon consumers by legislators and…",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/10/06/15-years-later-washpost-editorial-board-says-obamacare-was",
    "timestamp": "2025-10-06T18:49:50Z"
  },
  {
    "title": "Trump’s new IRS ‘CEO’: The head of Social Security",
    "description": "The Trump administration on Monday found its seventh leader for the Internal Revenue Service since the start of President Donald Trump’s second term: the head of the Social Security Administration.",
    "link": "https://biztoc.com/x/393f86f936635f44",
    "timestamp": "2025-10-06T18:46:24Z"
  },
  {
    "title": "Judge bars Trump’s National Guard moves in Oregon",
    "description": "What happened\nA federal judge Sunday night temporarily barred President Donald Trump from sending any National Guard units to Portland, after the Trump administration moved to work around her block on federalizing the Oregon National Guard. U.S. District Judg…",
    "link": "https://biztoc.com/x/d88528a8bade501a",
    "timestamp": "2025-10-06T18:46:22Z"
  },
  {
    "title": "Donald Trump Rebuked by Federal Prosecutor Over Letitia James Prosecution: Report",
    "description": "Virginia prosecutor rejects Trump-backed case against NY AG Letitia James, citing lack of evidence.",
    "link": "https://biztoc.com/x/a6b2f8774b087af7",
    "timestamp": "2025-10-06T18:46:21Z"
  },
  {
    "title": "Who Holds the High Cards in Sino-American Supply Chain Poker?",
    "description": "Beijing’s control of rare-earth minerals will force Trump to find new leverage.",
    "link": "http://foreignpolicy.com/2025/10/06/trump-china-xi-rare-earth-minerals-tariffs-poker/",
    "timestamp": "2025-10-06T18:45:11Z"
  },
  {
    "title": "The World After Oct. 7",
    "description": "A reckoning of the geopolitical impacts from the last two years of war—and war crimes.",
    "link": "http://foreignpolicy.com/2025/10/06/stephen-walt-world-after-oct-7/",
    "timestamp": "2025-10-06T18:45:03Z"
  },
  {
    "title": "'A rift in the nation': Inside Israel after two years of war",
    "description": "After two years of war, a fractured but defiant Israel is struggling to assert itself at home and abroad.",
    "link": "https://www.abc.net.au/news/2025-10-07/israel-gaza-war-impacts-on-society-after-two-years/105856702",
    "timestamp": "2025-10-06T18:44:40Z"
  },
  {
    "title": "What Will Bari Weiss Do to CBS News?",
    "description": "A change in leadership at the network has been seen as part of an effort to appease Donald Trump. But there may be other motivations.",
    "link": "https://www.newyorker.com/news/the-lede/what-will-bari-weiss-do-to-cbs-news",
    "timestamp": "2025-10-06T18:43:59Z"
  },
  {
    "title": "'If You Can Keep It': Trump’s New Vision For The Military",
    "description": "<p dir=\"ltr\" style=\"line-height:1.7999999999999998;background-color:#ffffff;margin-top:12pt;margin-bottom:0pt;padding:0pt 0pt 12pt 0pt;\">President Donald Trump and Defense Secretary Pete Hegseth outlined some stark changes to the U.S. military’s policies and …",
    "link": "https://www.npr.org/2025/10/06/nx-s1-5563953/if-you-can-keep-it-trumps-new-vision-for-the-military",
    "timestamp": "2025-10-06T18:43:51Z"
  },
  {
    "title": "Ghislaine Maxwell Appeal DECLINED by SCOTUS! Disgraced Trafficker’s Only Hope Now …",
    "description": "Reading Time: 4 minutesGhislaine Maxwell isn’t getting a get-out-of-jail-free card from SCOTUS. The disgraced associate and partner of Jeffrey Epstein is serving a …\nGhislaine Maxwell Appeal DECLINED by SCOTUS! Disgraced Trafficker’s Only Hope Now … was origi…",
    "link": "http://www.thehollywoodgossip.com/2025/10/ghislaine-maxwell-denied-scotus/",
    "timestamp": "2025-10-06T18:42:16Z"
  },
  {
    "title": "Trump: U.S. tariffs on heavy truck imports to begin Nov. 1",
    "description": "U.S. President Donald Trump said 25 per cent duties on medium- and heavy-duty trucks would begin Nov. 1. Read more.",
    "link": "https://financialpost.com/transportation/autos/trump-us-tariffs-heavy-truck-imports-nov-1",
    "timestamp": "2025-10-06T18:40:05Z"
  },
  {
    "title": "America’s heel turn celebrated with its own Loonie",
    "description": "MAGA is rendering unto Caesar, and Caesar is zip-tying toddlers and carting them away in vans.",
    "link": "https://www.patheos.com/blogs/slacktivist/2025/10/06/americas-heel-turn-celebrated-with-its-own-loonie/",
    "timestamp": "2025-10-06T18:39:26Z"
  },
  {
    "title": "Even under Trump, religious objection to flu shot results in service member’s dismissal from military",
    "description": "'I am being separated for the stated reason of not following direct orders and Air Force policy, even though those orders and policy violate the Constitution of the United States and the Alabama state Constitution'",
    "link": "https://www.wnd.com/2025/10/even-under-trump-religious-objection-flu-shot-results/",
    "timestamp": "2025-10-06T18:39:03Z"
  },
  {
    "title": "Left-Wing MSNBC Panel Agrees Virginia AG Candidate Who Fantasized About Shooting Republican Should Drop Out",
    "description": "Even MSNBC pundits agree that Virginia's Democratic AG candidate Jay Jones should drop out of the race following his text message scandal.",
    "link": "https://www.westernjournal.com/left-wing-msnbc-panel-agrees-virginia-ag-candidate-fantasized-shooting-republican-drop/",
    "timestamp": "2025-10-06T18:38:59Z"
  },
  {
    "title": "Illinois sues Trump, Noem, Hegseth over federalized U.S. troops in Chicago",
    "description": "Illinois and Chicago filed a lawsuit to block the Trump administration's federal troop deployment to the state's most populated metropolis as legal action...",
    "link": "https://www.upi.com/Top_News/US/2025/10/06/Illinois-Chicago-Pritzker-lawsuit-federal-national-guard-troop-constitution-law/6881759763316/",
    "timestamp": "2025-10-06T18:36:59Z"
  },
  {
    "title": "'They bought into the lie': Analyst warns Trump 'price of eggs voters' are turning on him",
    "description": "On The New Republic podcast \"The Daily Blast,\" Salon's Amanda Marcotte said Monday that President Donald Trump's base is starting to crack as \"price of egg voters\" who bought into his lies are realizing that they've been duped.Podcast host Greg Sargent asked …",
    "link": "https://www.rawstory.com/they-bought-into-the-lie-analyst-warns-trump-price-of-eggs-voters-are-turning-on-him/",
    "timestamp": "2025-10-06T18:36:04Z"
  },
  {
    "title": "Bill Maher Blasts Kamala Harris for 'Playing Victim' Over Humiliating Election Loss to Trump... And Jokes Memoir Should Have Been Called 'Everyone Sucks but Me'",
    "description": "Bill Maher blasted Kamala Harris for 'playing victim' over her humiliating election loss to Donald Trump.",
    "link": "https://radaronline.com/p/bill-maher-kamala-harris-trump-loss-blasted-playing-victim-memoir/",
    "timestamp": "2025-10-06T18:34:37Z"
  },
  {
    "title": "There's one date if the shutdown drags on where pressure will really start to mount on Trump and Congress",
    "description": "While the sides have dug in their heels regarding the budget, missing a pay period for the military may not be seen as worth the fallout.",
    "link": "https://www.cnbc.com/2025/10/06/theres-one-date-if-the-shutdown-drags-on-where-pressure-will-really-start-to-mount-on-trump-and-congress.html",
    "timestamp": "2025-10-06T18:33:53Z"
  },
  {
    "title": "Trump says the US has secured $17 trillion in new investments. The real number is likely much less",
    "description": "President Trump claims $17 trillion in new investments, but this figure appears exaggerated and speculative. The White House lists $8.8 trillion, including commitments from the Biden administration. Experts suggest actual commitments are in the hundreds of bi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-the-us-has-secured-17-trillion-in-new-investments-the-real-number-is-likely-much-less/articleshow/124347135.cms",
    "timestamp": "2025-10-06T18:33:01Z"
  },
  {
    "title": "Israel-Hamas negotiations to start, spurred by Trump ceasefire plan",
    "description": "President Trump wants Israeli and Hamas negotiators to \"move fast\" in new talks aimed at securing a ceasefire in the Gaza war, spurred by his 20-point plan.",
    "link": "https://www.cbsnews.com/news/israel-hamas-negotiations-trump-ceasefire-deal-gaza-war-egypt-talks/",
    "timestamp": "2025-10-06T18:32:24Z"
  },
  {
    "title": "Indirect talks on ending Gaza war begin in Sharm El-Sheikh: Egypt media",
    "description": "Hamas and Israeli delegations are in Egypt for indirect talks to end the Gaza war. Mediators are working on a deal to exchange hostages for Palestinian prisoners. The negotiations, spurred by a US proposal, aim to establish a temporary truce. Both sides have …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/indirect-talks-on-ending-gaza-war-begin-in-sharm-el-sheikh-egypt-media/articleshow/124347065.cms",
    "timestamp": "2025-10-06T18:29:56Z"
  },
  {
    "title": "Company bids less than a penny per ton in biggest US coal sale in over a decade",
    "description": "A Navajo tribe-owned company has bid $186,000 to lease 167 million tons of coal on federal lands in southeastern Montana",
    "link": "https://abcnews.go.com/Business/wireStory/company-bids-penny-ton-biggest-us-coal-sale-126264299",
    "timestamp": "2025-10-06T18:29:51Z"
  },
  {
    "title": "House of South Carolina Judge Goes Up in Flames 1 Month After She Defied Trump Administration",
    "description": "The cause of the fire is unknown, but Judge Diane Goodstein has been receiving death threats since her September ruling.",
    "link": "https://www.jezebel.com/house-of-south-carolina-judge-goes-up-in-flames-1-month-after-she-defied-trump-administration",
    "timestamp": "2025-10-06T18:29:17Z"
  },
  {
    "title": "Aftershock Day 4: Rob Zombie rocks, Gwar shocks with mock killings of Trump and Musk",
    "description": "Rob Zombie stole the show on Sunday night at the Aftershock music festival in Discovery Park, starting with a dramatic entry on a multistory set and delivering a thunderous horror-themed set of industrial metal.",
    "link": "https://freerepublic.com/focus/f-news/4344693/posts",
    "timestamp": "2025-10-06T18:25:14Z"
  },
  {
    "title": "Karoline Leavitt Rips ‘Shocking’ Texts From Dem Candidate in Virginia: ‘He Was Threatening to Kill His Opponent!’",
    "description": "White House Press Secretary Karoline Leavitt on Monday ripped Virginia Democrat Jay Jones for a series of leaked texts wishing death on a Republican. At the time of writing, Jones was the Democratic Party’s candidate for attorney general in the state. Accordi…",
    "link": "https://www.mediaite.com/politics/karoline-leavitt-rips-shocking-texts-from-dem-candidate-in-virginia-he-was-threatening-to-kill-his-opponent/",
    "timestamp": "2025-10-06T18:25:03Z"
  },
  {
    "title": "John Oliver: Presidential Libraries",
    "description": "John Oliver discusses what presidential libraries are exactly, how presidents use them to fundraise in office, how Donald Trump might make existing problems even worse and – of course – some stuff about one president’s unique inseam.",
    "link": "https://littlegreenfootballs.com/article/54967_John_Oliver-_Presidential_Libr",
    "timestamp": "2025-10-06T18:24:25Z"
  },
  {
    "title": "States Where Trump’s Approval Rating Has Plummeted",
    "description": "So far, President Donald Trump’s second term in the White House has been largely defined by a series of directives that have upended the status quo in Washington D.C. Since taking the oath of office in January, Trump has issued a reported 207 executive orders…",
    "link": "https://biztoc.com/x/339be4885e39298d",
    "timestamp": "2025-10-06T18:24:03Z"
  },
  {
    "title": "Trump will meet leaders from Canada, Finland this week",
    "description": "President Donald Trump is set to meet with Canadian Prime Minister Mark Carney on Tuesday. Later in the week, on Thursday, President Trump will welcome Finnish President Alexander Stubb. The White House has also announced that President Trump will convene a c…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-will-meet-leaders-from-canada-finland-this-week/articleshow/124346923.cms",
    "timestamp": "2025-10-06T18:23:47Z"
  },
  {
    "title": "Democrats’ Favorite Black Hole Of Fundraising Is Back To Lose Another Senate Race",
    "description": "Amy McGrath announced on Monday that she is once again running for Republican Kentucky Sen. Mitch McConnell’s seat. McGrath, a former Marine fighter pilot, said in a post to X announcing her candidacy that “Kentuckians deserve someone battle-tested and ready …",
    "link": "https://freerepublic.com/focus/f-bloggers/4344692/posts",
    "timestamp": "2025-10-06T18:21:21Z"
  },
  {
    "title": "Federal Judge Boldly Blocks Trump’s National Guard Move In Oregon As Illinois Pushes Back On Chicago Deployment—‘Outrageous & Un-American’",
    "description": "A federal judge has temporarily halted President Donald Trump’s plan to deploy the Oregon National Guard to Portland, even as his administration moved to send 300 Guard troops to Chicago. Clashes between the White House and Democratic governors who say the ac…",
    "link": "https://bossip.com/3933864/trump-national-guard-oregon-chicago/",
    "timestamp": "2025-10-06T18:21:17Z"
  },
  {
    "title": "Trump Says US Tariffs On Heavy Truck Imports To Begin Nov. 1",
    "description": "President Donald Trump said 25% duties on medium- and heavy-duty trucks would begin Nov. 1, the latest expansion of his tariff regime aimed at protecting domestic industries.  The proposal has been subject to an intense lobbying campaign by Detroit’s legacy a…",
    "link": "https://www.ndtvprofit.com/world/trump-says-us-tariffs-on-heavy-truck-imports-to-begin-nov-1",
    "timestamp": "2025-10-06T18:21:16Z"
  },
  {
    "title": "Karoline Leavitt Asked If Trump Is Willing to Rule Out a Pardon For Ghislaine Maxwell",
    "description": "Karoline Leavitt on Monday afternoon said President Donald Trump and other administration officials have not \"discussed\" granting Ghislaine Maxwell clemency\nThe post Karoline Leavitt Asked If Trump Is Willing to Rule Out a Pardon For Ghislaine Maxwell first a…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-asked-if-trump-is-willing-to-rule-out-a-pardon-for-ghislaine-maxwell/",
    "timestamp": "2025-10-06T18:20:52Z"
  },
  {
    "title": "Chief Justice John Roberts faces mounting criticism over 'emboldened Trump'",
    "description": "Chief Justice John Roberts' legacy is facing major questions as the U.S. Supreme Court returns from summer recess Monday amid mounting criticism that he's \"emboldened Trump.\"Trump is now eight months into his second presidency, and Roberts, who joined the hig…",
    "link": "https://www.rawstory.com/trump-supreme-court-2674158701/",
    "timestamp": "2025-10-06T18:19:05Z"
  },
  {
    "title": "US: Illinois sues Trump over Chicago troop deployment",
    "description": "The Democratic-led state said the Trump administration's planned troop deployment is unconstitutional. A lawsuit said Americans should not \"live under the threat of military occupation\" for opposing the president.",
    "link": "https://www.dw.com/en/us-illinois-sues-trump-over-chicago-troop-deployment/a-74256036",
    "timestamp": "2025-10-06T18:19:00Z"
  },
  {
    "title": "Japan poised to get first woman prime minister",
    "description": "The ruling Liberal Democratic Party elected former Economic Security Minister Sanae Takaichi",
    "link": "https://theweek.com/world-news/sanae-takaichi-japan-prime-minister",
    "timestamp": "2025-10-06T18:18:41Z"
  },
  {
    "title": "'Sick' texts from Democratic AG candidate could threaten Spanberger chances in Virginia",
    "description": "Democratic attorney general nominee Jay Jones' messages joking about killing a Republican lawmaker might upend the Old Dominion's race for governor.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/06/virginia-jay-jones-democrat-text-governor-race/86546279007/",
    "timestamp": "2025-10-06T18:17:06Z"
  },
  {
    "title": "Trump Urges Homebuilders To Boost Construction and Stop ‘Sitting on Empty Lots’",
    "description": "President Donald Trump has called on homebuilders to boost construction of new homes and bring prices down.",
    "link": "https://finance.yahoo.com/news/trump-urges-homebuilders-boost-construction-181549860.html",
    "timestamp": "2025-10-06T18:15:49Z"
  },
  {
    "title": "Ice Agents Accidentally Tear Gas Chicago Area Police During Protest",
    "description": "ICE's presence in Chicago has been met with measured resistance from organized protests, but it appears the agency lost control during the incident.",
    "link": "https://hiphopwired.com/2860486/ice-agents-accidentally-tear-gas-chicago-broadview-police/",
    "timestamp": "2025-10-06T18:15:27Z"
  },
  {
    "title": "Andrew Cuomo argues Zohran Mamdani would be a 'gift' to Trump on 'The View'",
    "description": "Former New York Gov. Andrew Cuomo told \"The View\" that rival New York City mayoral candidate Zohran Mamdani would be a \"gift\" to President Donald Trump.",
    "link": "https://www.foxnews.com/media/andrew-cuomo-argues-zohran-mamdani-would-gift-trump-the-view",
    "timestamp": "2025-10-06T18:15:02Z"
  },
  {
    "title": "Will Trump pardon Ghislaine Maxwell after Supreme Court rejects her appeal?",
    "description": "The Supreme Court has rejected Ghislaine Maxwell's final appeal. Her 20-year prison sentence for aiding Jeffrey Epstein in sex abuse remains. Maxwell's lawyers argued a past non-prosecution deal protected her. The court did not explain its decision. This clos…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-trump-pardon-ghislaine-maxwell-after-supreme-court-rejects-her-appeal/articleshow/124346056.cms",
    "timestamp": "2025-10-06T18:14:02Z"
  },
  {
    "title": "Company bids less than a penny per ton in biggest US coal sale in over a decade",
    "description": "BILLINGS, Mont. (AP) — A Navajo tribe-owned company bid $186,000 to lease 167 million tons of coal on federal lands in southeastern Montana on Monday in the biggest U.S. coal sale in more than a decade. The offer from the Navajo Transitional Energy Co. (NTEC)…",
    "link": "https://financialpost.com/pmn/company-bids-less-than-a-penny-per-ton-in-biggest-us-coal-sale-in-over-a-decade",
    "timestamp": "2025-10-06T18:13:55Z"
  },
  {
    "title": "50 Cent Trolls Diddy After 50-Month Prison Sentence",
    "description": "50 Cent continues to troll Diddy after the Bad Boy founder was sentenced to more than 4 years in prison.",
    "link": "https://screenrant.com/50-cent-diddy-prison-sentence/",
    "timestamp": "2025-10-06T18:13:37Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent Names Frank Bisignano as First CEO of the IRS",
    "description": "Treasury Secretary Scott Bessent appoints SSA Commissioner Frank Bisignano to dual role leading IRS operations",
    "link": "https://finance.yahoo.com/news/treasury-secretary-scott-bessent-names-181332810.html",
    "timestamp": "2025-10-06T18:13:32Z"
  },
  {
    "title": "Trump and Brazilian President Lula have 'friendly' call",
    "description": "Brazil's government said the two \"reminisced about the good chemistry\" they had at the UN in New York.",
    "link": "https://www.bbc.com/news/articles/c2ej0jpzx3yo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-06T18:13:09Z"
  },
  {
    "title": "Top prosecutor is refusing to charge New York AG despite Trump pressure",
    "description": "A top prosecutor plans to decline to seek charges against New York AG Letitia James, resisting intense pressure from President Donald Trump.",
    "link": "https://biztoc.com/x/89f6daebf98072ec",
    "timestamp": "2025-10-06T18:13:08Z"
  },
  {
    "title": "Trump and Brazilian President Lula have 'friendly' call",
    "description": "Brazil's government said the two \"reminisced about the good chemistry\" they had at the UN in New York.",
    "link": "https://www.bbc.com/news/articles/c2ej0jpzx3yo",
    "timestamp": "2025-10-06T18:13:06Z"
  },
  {
    "title": "Scott Bessent says stay tuned for ‘substantial support for our farmers, especially the soybean farmers’",
    "description": "President Donald Trump is planning a significant aid package to U.S. soybean farmers to help them survive China’s boycott of American beans in response to his trade war even as the president says he is still seeking a soybean deal with Beijing.\nBut farmers ar…",
    "link": "https://biztoc.com/x/8de83a587fb80153",
    "timestamp": "2025-10-06T18:12:50Z"
  },
  {
    "title": "Donald Trump Sets New Tariff on Heavy-Duty Trucks: What to Know",
    "description": "Trump to impose 25% tariff on imported heavy trucks starting Nov. 1, citing national security concerns.",
    "link": "https://biztoc.com/x/54c41275e11a1c6e",
    "timestamp": "2025-10-06T18:12:45Z"
  },
  {
    "title": "Trump says the American dream is on hold because ‘big homebuilders’ are ‘sitting on’ 2 million empty lots",
    "description": "When President Donald Trump compared “Big Homebuilders” to OPEC in a Sunday evening Truth Social post, he gave a voice to a common populist trope: Greedy developers are hoarding supply of houses and thus driving up costs. In many ways, it was classic Trump, s…",
    "link": "https://biztoc.com/x/ee317f3f9866bd7f",
    "timestamp": "2025-10-06T18:12:42Z"
  }
]