[
  {
    "title": "Gold and silver rally set to continue as dollar weakness looms: Peter Schiff",
    "description": "Renowned investor Peter Schiff predicts continued gains for gold and silver, driven by a weakening U.S. dollar and shifting global monetary trends. He cites a loss of confidence in U.S. fiscal policy and central bank independence as key factors, suggesting go…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/gold-and-silver-rally-set-to-continue-as-dollar-weakness-looms-peter-schiff/articleshow/128145086.cms",
    "timestamp": "2026-02-10T06:35:46Z"
  },
  {
    "title": "Unpacking Bad Bunny’s Superbowl show – an alternative joyful vision for America",
    "description": "The performance is a Puerto Rican manifesto of love and resistance in the time of Trump.",
    "link": "https://theconversation.com/unpacking-bad-bunnys-superbowl-show-an-alternative-joyful-vision-for-america-275545",
    "timestamp": "2026-02-10T06:34:51Z"
  },
  {
    "title": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions",
    "description": "Maxwell declined to answer questions from House lawmakers on Monday, but indicated that if President Trump ended her sentence, she was willing to testify that neither he nor former President Clinton had done anything wrong in their connections with Epstein.",
    "link": "https://www.npr.org/2026/02/10/g-s1-109413/maxwell-appeals-for-clemency",
    "timestamp": "2026-02-10T06:30:18Z"
  },
  {
    "title": "'The President Is Insane': Trump Mocked After New Meltdown On An Unexpected Topic",
    "description": "Trump fired off an attack on a country that had long been a key U.S. ally.",
    "link": "https://www.huffpost.com/entry/trump-canada-hockey-meltdown_n_698aae95e4b016e9e7eb8724",
    "timestamp": "2026-02-10T06:23:31Z"
  },
  {
    "title": "Japan says yes to more debt. Global markets will feel the effects.",
    "description": "A new currency crisis could be in the offing, Desmond Lachman writes in a guest commentary.",
    "link": "https://www.livemint.com/opinion/online-views/japan-says-yes-to-more-debt-global-markets-will-feel-the-effects-11770704146109.html",
    "timestamp": "2026-02-10T06:22:30Z"
  },
  {
    "title": "Fed’s Waller says crypto hype ‘fading’ with TradFi tie-ins",
    "description": "The crypto market’s volatility is just “part of the game,” says the Federal Reserve’s Chris Waller, who said traditional finance may have added to the recent market drop.",
    "link": "https://cointelegraph.com/news/fed-waller-crypto-hype-fading-tradfi-tie-ins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "timestamp": "2026-02-10T06:20:37Z"
  },
  {
    "title": "Oil exports have been a cash cow for Russia. But revenues are dwindling, thanks to sanctions",
    "description": "Russia's oil and gas income has dropped sharply. New sanctions from the U.S. and European Union are impacting revenue. President Putin is borrowing from banks and increasing taxes. This is straining Russia's war economy. Economic growth is slowing. Inflation …",
    "link": "https://economictimes.indiatimes.com/news/international/business/oil-exports-have-been-a-cash-cow-for-russia-but-revenues-are-dwindling-thanks-to-sanctions/articleshow/128143221.cms",
    "timestamp": "2026-02-10T06:20:30Z"
  },
  {
    "title": "US: Trump threatens to block opening of bridge with Canada",
    "description": "The US President Donald Trump said Canada should \"fully compensate\" Washington for \"everything we have given them.\" The bridge is fully paid for by the Canadian government.",
    "link": "https://www.dw.com/en/us-trump-threatens-to-block-opening-of-bridge-with-canada/a-75888050",
    "timestamp": "2026-02-10T06:20:00Z"
  },
  {
    "title": "Israel fears a US deal with Iran will be limited to curbing nuclear programme",
    "description": "Netanyahu to press Trump on restricting Iran’s ballistic missile threat",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/10/israel-fears-a-us-deal-with-iran-will-be-limited-to-curbing-nuclear-programme/",
    "timestamp": "2026-02-10T06:20:00Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Kid Rock’s TPUSA Halftime Show as a ‘Lip-Sync Battle With Himself’ After Noticeable Audio Issue | Video",
    "description": "\"[Conservatives] complain about how bad everything is and then they do it worse,\" the late night host adds\nThe post Jimmy Kimmel Roasts Kid Rock’s TPUSA Halftime Show as a ‘Lip-Sync Battle With Himself’ After Noticeable Audio Issue | Video appeared first on T…",
    "link": "https://www.thewrap.com/creative-content/tv-shows/jimmy-kimmel-reacts-kid-rock-turning-point-usa-halftime-show/",
    "timestamp": "2026-02-10T06:16:25Z"
  },
  {
    "title": "Corruption worsening globally, US hits record low score — Report",
    "description": "Transparency International’s 2025 global corruption report reveals a worldwide decline, with the US hitting a record low score amid weakening institutions.\n\nRead More: https://punchng.com/corruption-worsening-globally-us-hits-record-low-score-report/",
    "link": "https://punchng.com/corruption-worsening-globally-us-hits-record-low-score-report/",
    "timestamp": "2026-02-10T06:11:55Z"
  },
  {
    "title": "2025 Corruption Index flags drops in Western nations",
    "description": "Once seen as anti-graft strongholds, the US, UK, Canada and Sweden are slipping into decline due to a lack of political leadership, Transparency International's Corruption Perception Index has revealed.",
    "link": "https://www.dw.com/en/2025-corruption-index-flags-drops-in-western-nations/a-75838368",
    "timestamp": "2026-02-10T06:03:00Z"
  },
  {
    "title": "“Trumphobia” and the Genocide Claim in Nigeria",
    "description": "Abstract The article deploys historical narratives and legal frameworks to constructively engage with the contentious issue of Christian genocide claims in Nigeria. It critically examines challenges posed by the government’s pushback, arguing that to adequate…",
    "link": "https://smallwarsjournal.com/2026/02/10/trumphobia/",
    "timestamp": "2026-02-10T06:00:35Z"
  },
  {
    "title": "‘Who is she protecting?’: Ghislaine Maxwell’s silence draws criticism",
    "description": "Associate of Jeffrey Epstein invoked fifth amendment of US constitution and refused to testify before Congress",
    "link": "https://www.irishtimes.com/world/us/2026/02/10/who-is-she-protecting-ghislaine-maxwells-silence-draws-criticism/",
    "timestamp": "2026-02-10T06:00:01Z"
  },
  {
    "title": "Fintan O'Toole: One indelible image from the Epstein files captures what this is really about",
    "description": "Jeffrey Epstein and his friends were culture warriors – the war they waged was against women",
    "link": "https://www.irishtimes.com/opinion/2026/02/10/fintan-otoole-one-indelible-image-from-the-epstein-files-captures-what-this-is-really-about/",
    "timestamp": "2026-02-10T06:00:01Z"
  },
  {
    "title": "Taoiseach’s White House visit is ‘political pantomime’",
    "description": "Idea that Trump has any interest in listening to the Irish point of view on any issue is delusional",
    "link": "https://www.irishtimes.com/opinion/letters/2026/02/10/taoiseachs-white-house-visit-is-political-pantomime/",
    "timestamp": "2026-02-10T06:00:01Z"
  },
  {
    "title": "Running a newspaper is a tricky business. Jeff Bezos has made a mess of it",
    "description": "Actively alienating subscribers is not an obvious winning strategy",
    "link": "https://www.irishtimes.com/media/2026/02/10/running-a-newspaper-is-a-tricky-business-jeff-bezos-has-made-a-mess-of-it/",
    "timestamp": "2026-02-10T06:00:01Z"
  },
  {
    "title": "Fintan O'Toole: Epstein and his pals were culture warriors. The war they waged was against women",
    "description": "Jeffrey Epstein and his friends were culture warriors – the war they waged was against women",
    "link": "https://www.irishtimes.com/opinion/2026/02/10/fintan-otoole-epstein-and-his-pals-were-culture-warriors-the-war-they-waged-was-against-women/",
    "timestamp": "2026-02-10T06:00:01Z"
  },
  {
    "title": "Russia warns of full-scale military response if provoked as NATO escalates tensions",
    "description": "Lavrov states Russia has no intention of attacking Europe but will retaliate decisively if NATO escalates, using “all available military means,” including nuclear options if necessary. Zelensky himself downplays invasion fears, contradicting NATO’s alarmist c…",
    "link": "https://www.naturalnews.com/2026-02-10-russia-warns-full-scale-military-response-nato.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "US Energy Hegemony: A Coercive Push for Global Control",
    "description": "Introduction: The Accusation of US Dominance In a world increasingly defined by the struggle between centralized control and decentralized sovereignty, a stark accusation has emerged from the heart of geopolitical discourse. Russian Foreign Minister Sergey La…",
    "link": "https://www.naturalnews.com/2026-02-10-us-energy-hegemony-coercive-push-global-control.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "The Trump Effect: How his war on globalism exposed the elites’ endgame",
    "description": "Trump’s 2016 victory marked a grassroots revolt against neoliberal globalism, challenging institutions like the UN, WHO and NATO while exposing deep-state resistance (e.g., Crossfire Hurricane investigation). The book “The Trump Effect: Global Shifts in Power…",
    "link": "https://www.naturalnews.com/2026-02-10-trump-effect-war-globalism-exposed-elites-endgame.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "Nationwide redistricting arms race escalates as states scramble to redraw House maps ahead of 2026 elections",
    "description": "Traditionally, redistricting occurs every 10 years after the census. Now, both Republicans and Democrats are rushing to redraw maps before the 2026 midterms, seeking partisan advantages. Triggered by President Donald Trump’s call for GOP-led states to maximiz…",
    "link": "https://www.naturalnews.com/2026-02-10-states-redraw-house-maps-ahead-of-2026-elections.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "China advises banks to limit U.S. Treasury holdings amid volatility concerns",
    "description": "China directs its major banks to reduce holdings of U.S. Treasury bonds. This formalizes a long-term strategy of diversification away from U.S. debt. China’s Treasury holdings have been nearly halved over the past decade. The move reflects global concerns abo…",
    "link": "https://www.naturalnews.com/2026-02-10-china-banks-limit-us-treasury-holdings-volatility.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "Elon Musk offers to pay legal bills for Epstein victims naming accomplices",
    "description": "Musk pledged to cover legal costs for any Epstein victim naming accomplices, following a Super Bowl ad demanding the release of sealed documents. DOJ-released emails show Epstein invited Musk (with his then-wife) to his island, though Musk claims he declined …",
    "link": "https://www.naturalnews.com/2026-02-10-elon-musk-offers-pay-bills-epstein-victims.html",
    "timestamp": "2026-02-10T06:00:00Z"
  },
  {
    "title": "Adani Enterprises in talks with US Office of Foreign Assets",
    "description": "Adani Enterprises engages with the U.S. Office of Foreign Assets amid share price drop following bribery allegations.",
    "link": "https://www.thehindubusinessline.com/companies/adani-enterprises-in-talks-with-us-office-of-foreign-assets/article70614019.ece",
    "timestamp": "2026-02-10T05:56:56Z"
  },
  {
    "title": "Adani Enterprises in talks with US agency over bribery allegations",
    "description": "Adani Enterprises said it received a Request for Information from the US Office of Foreign Assets on February 4, adding the communication does not cite any findings of irregularities or non-compliance",
    "link": "https://www.business-standard.com/companies/news/adani-enterprises-in-talks-with-us-agency-over-bribery-allegations-126021000355_1.html",
    "timestamp": "2026-02-10T05:51:12Z"
  },
  {
    "title": "Turning Point USA Super Bowl halftime show viewing figures revealed",
    "description": "It was a far cry from the estimated 120 million-plus that watched Bad Bunny’s historic official set",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/turning-point-usa-halftime-show-viewers-bad-bunny-kid-rock-b2917178.html",
    "timestamp": "2026-02-10T05:48:14Z"
  },
  {
    "title": "Netanyahu heads to US this week to push Trump on broader Iran nuclear talks",
    "description": "Israeli Prime Minister Benjamin Netanyahu travels to Washington to meet President Donald Trump. He aims to persuade Trump to expand high-stakes nuclear negotiations with Iran. The talks resume amid a US military buildup. Israel seeks Iran to halt uranium enri…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-us-nuclear-talks-netanyahu-heads-to-us-this-week-to-push-trump-on-broader-iran-nuclear-talks/articleshow/128143237.cms",
    "timestamp": "2026-02-10T05:47:04Z"
  },
  {
    "title": "Adani Enterprises says it is in talks with US Office of Foreign Assets over WSJ allegations",
    "description": "Adani Enterprises is in discussions with the US Office of Foreign Assets following a report alleging Gautam Adani sought to influence the Trump administration regarding bribery charges. The company confirmed receiving a Request for Information but stated it c…",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/adani-enterprises-us-office-of-foreign-assets-wall-street-journal-allegations-bribery-charges-donald-trump/articleshow/128143089.cms",
    "timestamp": "2026-02-10T05:45:41Z"
  },
  {
    "title": "Solar, wind capacity growth slowed last year: Analysis",
    "description": "Planned or under-construction solar and wind projects slowed last year, analysis showed Tuesday, casting doubts on whether countries will hit a goal of tripling renewable capacity by decade-end.",
    "link": "https://www.hurriyetdailynews.com/solar-wind-capacity-growth-slowed-last-year-analysis-218786",
    "timestamp": "2026-02-10T05:41:37Z"
  },
  {
    "title": "Akazawa, Lutnick to Discuss First Project for $550 Billion Fund",
    "description": "Japanese Trade Minister Ryosei Akazawa and US Commerce Secretary Howard Lutnick will meet this week to discuss the first project to be funded via the $550 billion investment vehicle that was a pillar of the two countries’ trade deal last year.",
    "link": "https://financialpost.com/pmn/business-pmn/akazawa-lutnick-to-discuss-first-project-for-550-billion-fund",
    "timestamp": "2026-02-10T05:35:07Z"
  },
  {
    "title": "Senior Chinese official calls for ‘resolutely’ cracking down on ‘Taiwan independence’ separatists",
    "description": "BEIJING, Feb 10 (Reuters) - A senior Chinese official has called for “resolutely” cracking down on “Taiwan independence” separatist forces and opposing interference by ex… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/10/senior-chinese-official-calls-for-resolutely-cracking-down-on-taiwan-independence-separatists",
    "timestamp": "2026-02-10T05:34:35Z"
  },
  {
    "title": "Trump threatens to stop opening of Canada-US bridge",
    "description": "President Donald Trump threatened Monday to stop the opening of a new bridge between the United States and Canada, in a fresh salvo against the country he has suggested should become the 51st U.S. state.",
    "link": "https://www.hurriyetdailynews.com/trump-threatens-to-stop-opening-of-canada-us-bridge-218782",
    "timestamp": "2026-02-10T05:33:56Z"
  },
  {
    "title": "Israel's Netanyahu is meeting with Trump this week to push for a far broader Iran deal",
    "description": "Prime Minister Benjamin Netanyahu is heading to Washington to encourage President Donald Trump to expand the scope of high-stakes nuclear talks with Iran",
    "link": "https://abcnews.go.com/International/wireStory/israels-netanyahu-meeting-trump-week-push-broader-iran-130015415",
    "timestamp": "2026-02-10T05:33:25Z"
  },
  {
    "title": "Iran steps up arrests while remaining positive on US talks",
    "description": "Iran stepped up its crackdown on Monday after recent protests, making more arrests while holding the door open to Washington for further nuclear negotiations.",
    "link": "https://www.hurriyetdailynews.com/iran-steps-up-arrests-while-remaining-positive-on-us-talks-218781",
    "timestamp": "2026-02-10T05:31:25Z"
  },
  {
    "title": "King Charles has ‘profound concern’ over claim Andrew gave trade reports to Jeffrey Epstein",
    "description": "Buckingham Palace said yesterday it was ready to support any police investigation into King Charles’ younger brother after emails suggested Andrew Mountbatten-Windsor might have shared confidential UK trade documents with sex offender Jeffrey Epstein.",
    "link": "https://www.independent.ie/world-news/britain/king-charles-has-profound-concern-over-claim-andrew-gave-trade-reports-to-jeffrey-epstein/a1701536837.html",
    "timestamp": "2026-02-10T05:30:00Z"
  },
  {
    "title": "Arab states criticise Israel as it expands powers in West Bank",
    "description": "Saudi Arabia, Jordan and the United Arab Emirates led regional states yesterday in condemning Israel’s move to ease settlement expansion and widen its powers in the West Bank, a step critics said went in the direction of annexing occupied land.",
    "link": "https://www.independent.ie/world-news/middle-east/arab-states-criticise-israel-as-it-expands-powers-in-west-bank/a1304433876.html",
    "timestamp": "2026-02-10T05:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Keir Starmer’s grip on top job may be loosening as Mandelson episode not over yet",
    "description": "A more prescient Keir Starmer might have anticipated that anointing a man dubbed the ‘Prince of Darkness’ for Britain’s most crucial diplomatic post was destined to cast a long shadow.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-keir-starmers-grip-on-top-job-may-be-loosening-as-mandelson-episode-not-over-yet/a289253455.html",
    "timestamp": "2026-02-10T05:30:00Z"
  },
  {
    "title": "Olympians Speak Out Against Trump's \"Loser\" Remarks",
    "description": "And Other Items of Note from Angry Asian America.",
    "link": "https://blog.angryasianman.com/2026/02/olympians-speak-out-against-trumps.html",
    "timestamp": "2026-02-10T05:30:00Z"
  },
  {
    "title": "Kid Rock has the last word with a snarky comment about Bad Bunny's halftime show",
    "description": "Kid Rock delivered a snarky critique of Bad Bunny&apos;s  Super Bowl halftime performance Monday, saying he &quot;didn&apos;t understand any of it&quot; while weighing in on the he",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/10/698ac0d522601d077c8b45e5.html",
    "timestamp": "2026-02-10T05:29:56Z"
  },
  {
    "title": "JD FOSTER: US Responding To Xi Sacking Generals",
    "description": "Chinese Communist Party Chairman Xi Jinping recently sacked General Zhang Youxia, first vice-chairman of the Central Military Commission (CMC), and General Liu",
    "link": "https://dailycaller.com/2026/02/10/opinion-us-responding-to-xi-sacking-generals-jd-foster/",
    "timestamp": "2026-02-10T05:28:14Z"
  },
  {
    "title": "International outrage grows over Israel's plans for West Bank",
    "description": "International outrage was growing on Monday at Israeli plans to tighten the country's grip over the occupied West Bank, with the United Nations chief saying he was \"gravely concerned\".",
    "link": "https://www.hurriyetdailynews.com/international-outrage-grows-over-israels-plans-for-west-bank-218780",
    "timestamp": "2026-02-10T05:26:20Z"
  },
  {
    "title": "Oil exports have been a cash cow for Russia. But revenues are dwindling, thanks to sanctions",
    "description": "Oil and gas exports have been a pillar of Russia's finances throughout its nearly 4-year-old war in Ukraine",
    "link": "https://abcnews.go.com/Business/wireStory/oil-exports-cash-cow-russia-revenues-dwindling-sanctions-130015189",
    "timestamp": "2026-02-10T05:25:24Z"
  },
  {
    "title": "Oil exports have been a cash cow for Russia. But revenues are dwindling, thanks to sanctions",
    "description": "Oil and gas exports have been a pillar of Russia's finances throughout its nearly 4-year-old war in Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/oil-exports-cash-cow-russia-revenues-dwindling-sanctions-130015188",
    "timestamp": "2026-02-10T05:25:23Z"
  },
  {
    "title": "Putin has weaponized the peace talks. The US can stop him",
    "description": "Trump's peace process has inadvertently empowered Putin by halting US aid to Ukraine and providing political cover for Russia's stalled ground campaign. This has allowed Russia to intensify attacks on Ukraine's energy infrastructure, exacerbating a humanitari…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-has-weaponized-the-peace-talks-heres-how-the-us-can-stop-him/articleshow/128142272.cms",
    "timestamp": "2026-02-10T05:16:12Z"
  },
  {
    "title": "Jimmy Kimmel Slams Trump For Calling Bad Bunny’s Super Bowl Performance ‘An Affront to the Greatness of America’: ‘This Is a Man Who Paid Off a Porn Star Who Spanked Him’",
    "description": "Jimmy Kimmel on Monday went after Donald Trump for his scathing review of Bad Bunny’s Super Bowl Halftime Show. “Bad Bunny got a bad review from our bad president, unfortunately,” Kimmel said during Monday’s broadcast of “Jimmy Kimmel Live!” “He wrote, ‘The S…",
    "link": "https://variety.com/2026/tv/news/jimmy-kimmel-trump-bad-bunny-super-bowl-halftime-show-1236657780/",
    "timestamp": "2026-02-10T05:14:53Z"
  },
  {
    "title": "Poll: Rep. Jasmine Crockett Leads in Texas Democratic Senate Primary",
    "description": "Rep. Jasmine Crockett has emerged as the frontrunner in the race for the Democratic nomination in Texas’s 2026 U.S. Senate primary, according to a recent poll conducted by the University of Houston’s Hobby School of Public Affairs.\nThe post Poll: Rep. Jasmine…",
    "link": "https://www.breitbart.com/politics/2026/02/09/poll-rep-jasmine-crockett-leads-texas-democratic-senate-primary/",
    "timestamp": "2026-02-10T05:14:09Z"
  },
  {
    "title": "Epstein accomplice Maxwell seeks clemency from Trump before testimony",
    "description": "Convicted sex offender Jeffrey Epstein's accomplice Ghislaine Maxwell refused Monday to answer questions from U.S. lawmakers but her attorney said she was prepared to speak if granted clemency by U.S. President Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/epstein-accomplice-maxwell-seeks-clemency-from-trump-before-testimony-218777",
    "timestamp": "2026-02-10T05:13:32Z"
  },
  {
    "title": "Risk-on trade back? Smallcap stocks rally up to 28% in 2026, but market breadth stays weak",
    "description": "Smallcap stocks are showing signs of a comeback after a dull 2025, driven by attractive valuations and improving earnings. The India-US trade deal has boosted sentiment, though tariff threats from Donald Trump remain a concern. Despite negative market breadth…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/risk-on-trade-back-smallcap-stocks-rally-up-to-28-in-2026-but-market-breadth-stays-weak/articleshow/128142310.cms",
    "timestamp": "2026-02-10T05:12:48Z"
  },
  {
    "title": "Epstein files: US Congressman says DoJ redactions hide records contradicting Donald Trump on Jeffrey Epstein",
    "description": "Trump has long claimed he threw Epstein out of Mar-a-Lago in about 2007.",
    "link": "https://www.nzherald.co.nz/entertainment/epstein-files-us-congressman-says-doj-redactions-hide-records-contradicting-donald-trump-on-jeffrey-epstein/6QAYLMV5WRDX5C7D4AW6J5XNUY/",
    "timestamp": "2026-02-10T05:12:13Z"
  },
  {
    "title": "Democrats say White House offer on ICE is 'insufficient' as Homeland Security funding set to expire",
    "description": "Democratic leaders say a proposal from the White House is “incomplete and insufficient” as they are demanding new restrictions on President Donald Trump’s immigration crackdown and threatening a shutdown of the Homeland Security Department",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-white-house-offer-ice-insufficient-homeland-security-130015191",
    "timestamp": "2026-02-10T05:10:12Z"
  },
  {
    "title": "Democrats say White House offer on ICE is 'insufficient' as Homeland Security funding set to expire",
    "description": "Democratic leaders say a proposal from the White House is “incomplete and insufficient” as they are demanding new restrictions on President Donald Trump’s immigration crackdown and threatening a shutdown of the Homeland Security Department",
    "link": "https://abcnews.go.com/US/wireStory/democrats-white-house-offer-ice-insufficient-homeland-security-130015190",
    "timestamp": "2026-02-10T05:10:11Z"
  },
  {
    "title": "US releases fact sheet on trade deal, mentions ‘certain pulses’ among agricultural products to see tariffs cut",
    "description": "This paragraph differs from the one mentioned in the February 6 joint statement, which detailed the “key terms” of the interim agreement between the US and India.",
    "link": "https://indianexpress.com/article/india/us-fact-sheet-trade-deal-certain-pulses-agricultural-products-tariffs-cut-10523778/",
    "timestamp": "2026-02-10T05:08:44Z"
  },
  {
    "title": "Jon Stewart Rips Trump and MAGA as ‘F–king Pathetic’ After Outrage Over Bad Bunny’s Super Bowl Show | Video",
    "description": "\"These people are so triggered by someone singing in Spanish for 20 minutes, they need to create their own safe space,\" the comedian adds\nThe post Jon Stewart Rips Trump and MAGA as ‘F–king Pathetic’ After Outrage Over Bad Bunny’s Super Bowl Show | Video appe…",
    "link": "https://www.thewrap.com/creative-content/tv-shows/jon-stewart-reacts-trump-maga-complaints-bad-bunny-super-bowl-show/",
    "timestamp": "2026-02-10T05:08:42Z"
  },
  {
    "title": "Jon Stewart Mocks MAGA’s Victimhood Over Bad Bunny Halftime Performance",
    "description": "Stewart likened MAGA's current cancel culture crusade to the same mindset they railed against a decade prior.\nJon Stewart Mocks MAGA’s Victimhood Over Bad Bunny Halftime Performance\nAlex Young",
    "link": "https://consequence.net/2026/02/jon-stewart-bad-bunny-maga/",
    "timestamp": "2026-02-10T05:06:25Z"
  },
  {
    "title": "Is Bitcoin's Sell-Off Finally Running Out of Steam?",
    "description": "Bitcoin’s sell-off shows signs of easing as large buyers step in, though analysts say any rebound still depends on institutional demand.",
    "link": "https://decrypt.co/357569/is-bitcoins-sell-off-finally-running-out-of-steam",
    "timestamp": "2026-02-10T05:02:46Z"
  },
  {
    "title": "King dollar risks losing its crown to an Asian mutiny",
    "description": "Asian nations are quietly challenging the dollar's global dominance, moving beyond mere rhetoric. China's digital yuan (e-CNY) now offers interest, making it competitive with bank deposits. Meanwhile, the mBridge platform, a cross-border payment system involv…",
    "link": "https://economictimes.indiatimes.com/news/economy/finance/king-dollar-risks-losing-its-crown-to-an-asian-mutiny/articleshow/128141855.cms",
    "timestamp": "2026-02-10T04:57:27Z"
  },
  {
    "title": "US and India work to finalise interim trade agreement for Bilateral Trade Agreement: White House",
    "description": "Leaders Donald Trump and Narendra Modi reaffirmed their commitment to a mutually beneficial, balanced trade relationship, ensuring benefits for exporters and workers.",
    "link": "https://www.thehindubusinessline.com/economy/us-and-india-work-to-finalise-interim-trade-agreement-for-bilateral-trade-agreement-white-house/article70613869.ece",
    "timestamp": "2026-02-10T04:57:19Z"
  },
  {
    "title": "Radiohead’s Jonny Greenwood asks for music to be removed from Melania documentary",
    "description": "The rock musician, who composed the 2017 drama ‘Phantom Thread’, alleges breach of agreement after score reused in controversial documentary",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jonny-greenwood-radiohead-melania-documentary-music-removed-b2917165.html",
    "timestamp": "2026-02-10T04:56:07Z"
  },
  {
    "title": "Iran’s Khamenei urges unity to defeat enemy amid US military buildup",
    "description": "As the US increases its military presence in the Gulf, Iran's Supreme Leader Ayatollah Khamenei urges his people to unite.",
    "link": "https://www.israelnationalnews.com/news/422194",
    "timestamp": "2026-02-10T04:54:23Z"
  },
  {
    "title": "US vice president visits Armenia, Azerbaijan to 'advance' peace",
    "description": "Armenia and the U.S. signed a joint statement Monday on peaceful nuclear cooperation between the two countries amid a landmark visit by U.S. Vice President JD Vance to Yerevan.",
    "link": "https://www.hurriyetdailynews.com/us-vice-president-visits-armenia-azerbaijan-to-advance-peace-218776",
    "timestamp": "2026-02-10T04:53:08Z"
  },
  {
    "title": "Bad Bunny's Super Bowl halftime show celebrated America – all of it – with a message of unity",
    "description": "Bad Bunny concluded his historic Super Bowl halftime performance with a few English-language words",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bad-bunnys-super-bowl-halftime-show-celebrated-america-130006889",
    "timestamp": "2026-02-10T04:45:25Z"
  },
  {
    "title": "Judge gives Trump administration more time to unfreeze billions in funding for NY tunnel project | CNN Politics",
    "description": "The Trump administration will need to unfreeze more than $16 billion earmarked for a major New York infrastructure project by Thursday unless a federal appeals court allows the government to continue withholding the funds, a federal judge ruled Monday.",
    "link": "https://www.cnn.com/2026/02/09/politics/judge-administrative-stay-unfreeze-ny-infrastructure-funds",
    "timestamp": "2026-02-10T04:40:06Z"
  },
  {
    "title": "Trump Opposes Israeli Annexation of West Bank - Reports",
    "description": "US President Donald Trump opposes Israeli annexation of the West Bank, Axios journalist Barak Ravid reported, citing a White House official.",
    "link": "https://sputnikglobe.com/20260210/trump-opposes-israeli-annexation-of-west-bank---reports-1123614169.html",
    "timestamp": "2026-02-10T04:39:48Z"
  },
  {
    "title": "Trump threatens to block opening of Detroit-Canada bridge",
    "description": "The $4.6bn Gordie Howe International Bridge is expected to open in early 2026.",
    "link": "https://www.aljazeera.com/economy/2026/2/10/trump-threatens-to-block-opening-of-detroit-canada-bridge",
    "timestamp": "2026-02-10T04:38:49Z"
  },
  {
    "title": "Top Iran security official to travel to Oman, site of talks with US, likely with nuclear message",
    "description": "Iranian security official Ali Larijani is traveling to Oman, the country currently mediating talks between Tehran and the United States over Iran's nuclear program",
    "link": "https://abcnews.go.com/Business/wireStory/top-iran-security-official-travel-oman-site-talks-130012807",
    "timestamp": "2026-02-10T04:37:31Z"
  },
  {
    "title": "Jon Stewart Slams Conservative Outrage Over Bad Bunny’s Super Bowl Halftime Show: Trump Thinks ‘Bad Bunny Is the One Guy in the World That’s Fluent in Spanish’",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart covered the conservative outrage over Bad Bunny’s Super Bowl Halftime Show. “Mr. Bunny killed it, despite being trapped in an inescapable sugarcane hedge maze,” Stewart joked. “He had Lady Gaga, Ricky Ma…",
    "link": "https://variety.com/2026/tv/news/jon-stewart-bad-bunnys-super-bowl-halftime-show-trump-1236657770/",
    "timestamp": "2026-02-10T04:34:33Z"
  },
  {
    "title": "EPA to Scrap Landmark US Emissions Policy in Major Rollback",
    "description": "The US Environmental Protection Agency plans this week to repeal a policy that provides the legal foundation for a raft of rules regulating greenhouse gas emissions, marking President Donald Trump’s most consequential retreat from the fight against climate ch…",
    "link": "https://financialpost.com/pmn/business-pmn/epa-to-scrap-landmark-us-emissions-policy-in-major-rollback",
    "timestamp": "2026-02-10T04:33:59Z"
  },
  {
    "title": "'Historic' trade deal will open Indian markets to US goods: White House",
    "description": "The United States and India will significantly increase bilateral trade in technology products and expand joint technology cooperation",
    "link": "https://www.business-standard.com/economy/news/historic-trade-deal-will-open-indian-markets-to-us-goods-white-house-126021000069_1.html",
    "timestamp": "2026-02-10T04:31:00Z"
  },
  {
    "title": "US Stocks Today | Fed’s Miran defends tariffs, downplays inflation and dollar concerns",
    "description": "Federal Reserve Governor Stephen Miran stated that Trump administration tariffs have been less damaging than feared, with foreign companies absorbing much of the cost. He argued that economic impacts have been more limited than initially expected, and the bro…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stocks-today-feds-miran-defends-tariffs-downplays-inflation-and-dollar-concerns/articleshow/128140675.cms",
    "timestamp": "2026-02-10T04:27:52Z"
  },
  {
    "title": "Russia warns Cuba fuel situation critical,as Havana slams ‘cruel’ US tactic",
    "description": "Cuban foreign minister accuses US of trying to break the 'political will' of Cubans, hints at diplomacy with Washington.",
    "link": "https://www.aljazeera.com/news/2026/2/10/russia-warns-cuba-fuel-situation-critical-as-havana-slams-cruel-us-tactic",
    "timestamp": "2026-02-10T04:26:38Z"
  },
  {
    "title": "‘Pure Smut’: GOP Congressman Claims Bad Bunny Halftime Show Had Gay Porn (It Did Not), Calls for Investigation",
    "description": "Rep. Andy Ogles (R-TN) did not enjoy Bad Bunny's Super Bowl halftime show, denouncing it as \"pure smut,\" calling for a congressional inquiry, and accusing it of depicting \"gay pornography.\"\nThe post ‘Pure Smut’: GOP Congressman Claims Bad Bunny Halftime Show …",
    "link": "https://www.mediaite.com/media/news/pure-smut-gop-congressman-claims-bad-bunny-halftime-show-had-gay-porn-it-did-not-calls-for-investigation/",
    "timestamp": "2026-02-10T04:26:34Z"
  },
  {
    "title": "'Picked the wrong judge': Legal expert chides Trump's latest major court loss",
    "description": "A legal expert chided President Donald Trump's administration on Monday after it suffered its latest major court loss. Last week, a federal judge in Oregon issued a blistering order against the Trump administration, declaring in no uncertain terms that the De…",
    "link": "https://www.rawstory.com/trump-2675243717/",
    "timestamp": "2026-02-10T04:23:55Z"
  },
  {
    "title": "Democrats and White House trade offers as shutdown of Homeland Security looms",
    "description": "Democratic leaders say a proposal from the White House is “incomplete and insufficient” as they are demanding new restrictions on President Donald Trump’s immigration crackdown just days before funding for the Department of Homeland Security is set to ...",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-white-house-trade-offers-shutdown-homeland-security-130009178",
    "timestamp": "2026-02-10T04:21:23Z"
  },
  {
    "title": "Cuban bishops warn oil sanctions could deepen hardship and unrest",
    "description": "The message, read in Catholic parishes nationwide, warned that further pressure on fuel access would fall most heavily on vulnerable families already struggling to survive.",
    "link": "https://www.christiantoday.com/news/cuban-bishops-warn-oil-sanctions-could-deepen-hardship-and-unrest",
    "timestamp": "2026-02-10T04:21:00Z"
  },
  {
    "title": "US plans Big Tech carve-out from next chip tariffs",
    "description": "The carve-outs ⁠would be provided by the Commerce Department\nand tied to ‌investment commitments made ‌by the Taiwan\nSemiconductor Manufacturing Company",
    "link": "https://www.thehindubusinessline.com/news/world/us-plans-big-tech-carve-out-from-next-chip-tariffs/article70613754.ece",
    "timestamp": "2026-02-10T04:12:25Z"
  },
  {
    "title": "GOP Senator Changes Tune On Epstein Files Release: ‘Now I See What the Big Deal Is’",
    "description": "\"Well, initially, my reaction to all this was, ‘I don't care. I don't know what the big deal is.’ But now I see what the big deal is\"\nThe post GOP Senator Changes Tune On Epstein Files Release: ‘Now I See What the Big Deal Is’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/gop-senator-changes-tune-on-epstein-files-release-now-i-see-what-the-big-deal-is/",
    "timestamp": "2026-02-10T04:10:05Z"
  },
  {
    "title": "GOP lawmakers both critical and cordial with Charlotte leaders after high-profile crime",
    "description": "Republican lawmakers in North Carolina have pressed Charlotte-area leaders about crime-fighting efforts after recent light-rail stabbings",
    "link": "https://abcnews.go.com/US/wireStory/gop-lawmakers-critical-cordial-charlotte-leaders-after-high-129982909",
    "timestamp": "2026-02-10T04:05:25Z"
  },
  {
    "title": "Rubio to visit Hungary after Trump backs ally Orbán",
    "description": "US Secretary of State Marco Rubio will travel next week to Hungary, the State Department said, after President Donald Trump endorsed its right-wing leader Viktor Orbán, who is trailing in polls ahead of April elections.",
    "link": "https://www.rte.ie/news/2026/0210/1557611-rubio-us-hungary/",
    "timestamp": "2026-02-10T03:57:58Z"
  },
  {
    "title": "Rubio to visit Hungary after Trump backs ally Orbán",
    "description": "US Secretary of State Marco Rubio will travel next week to Hungary, the State Department said, after President Donald Trump endorsed its right-wing Prime Minister Viktor Orbán, who is trailing in polls ahead of April elections.",
    "link": "https://www.rte.ie/news/2026/0210/1557611-us-hungary/",
    "timestamp": "2026-02-10T03:57:58Z"
  },
  {
    "title": "Trump's tariffs cost American households $1,000 last year: Research group (Elizabeth Schulze/Associated Press)",
    "description": "Elizabeth Schulze / Associated Press:\nTrump's tariffs cost American households $1,000 last year: Research group  —  The Tax Foundation said the cost may be even higher in 2026.  —  President Donald Trump walks on the South Lawn upon his arrival to the White H…",
    "link": "https://www.memeorandum.com/260209/p109",
    "timestamp": "2026-02-10T03:55:00Z"
  },
  {
    "title": "National interest is guiding factor: Foreign Secretary Misri on India's oil procurement",
    "description": "The foreign secretary said India's \"foremost priority\" is to safeguard the interests of Indian consumers and to really ensure that they receive adequate energy at the right price and through reliable and secure supplies",
    "link": "https://www.thehindubusinessline.com/news/national-interest-is-guiding-factor-foreign-secretary-misri-on-indias-oil-procurement/article70613736.ece",
    "timestamp": "2026-02-10T03:49:52Z"
  },
  {
    "title": "Ex-police chief says Trump told him 'thank goodness you're stopping' Epstein in 2000s",
    "description": "Former Palm Beach police chief Michael Reiter was a central figure in the first law enforcement probe of Epstein in Florida.",
    "link": "https://abcnews.go.com/US/police-chief-trump-told-goodness-stopping-epstein-2006/story?id=130010254",
    "timestamp": "2026-02-10T03:46:29Z"
  },
  {
    "title": "GOP lawmaker calls out Trump DOJ's inadvertent Epstein files admission on CNN",
    "description": "A GOP lawmaker called out President Donald Trump's Department of Justice on Monday during a live interview on CNN over an inadvertent admission from the Deputy Attorney General about the handling of the Jeffrey Epstein files. Rep. Thomas Massie (R-KY) joined …",
    "link": "https://www.rawstory.com/thomas-massie-2675243078/",
    "timestamp": "2026-02-10T03:45:27Z"
  },
  {
    "title": "Illinois appeal for summer storm disaster relief denied by Trump administration (Tina Sfondeles/Chicago Sun Times)",
    "description": "Tina Sfondeles / Chicago Sun Times:\nIllinois appeal for summer storm disaster relief denied by Trump administration  —  In two letters sent to President Donald Trump last year, Gov. JB Pritzker said the intense rainfall overwhelmed Chicago's sewer system on t…",
    "link": "https://www.memeorandum.com/260209/p107",
    "timestamp": "2026-02-10T03:45:02Z"
  },
  {
    "title": "Ex-police chief says Trump told him 'thank goodness you're stopping' Epstein in 2000s",
    "description": "Ex-police chief says Trump told him 'thank goodness you're stopping' Epstein in 2000sabcnews.com",
    "link": "https://abcnews.com/US/police-chief-trump-told-goodness-stopping-epstein-2006/story?id=130010254",
    "timestamp": "2026-02-10T03:44:00Z"
  },
  {
    "title": "UN is waiting to see how much US intends to pay of the nearly $4 billion it owes",
    "description": "The US owes $2.196 billion to the UN’s regular budget, including $767 million for this year, and $1.8 billion for peacekeeping operations, which is expected to increase",
    "link": "https://www.thehindubusinessline.com/news/world/un-is-waiting-to-see-how-much-us-intends-to-pay-of-the-nearly-4-billion-it-owes/article70613723.ece",
    "timestamp": "2026-02-10T03:43:01Z"
  },
  {
    "title": "27 arrested in Sydney during protests against Herzog’s visit, leaders urge calm",
    "description": "Violence erupts in Sydney during protests against President Herzog’s visit, with 27 arrests and clashes between police and demonstrators. Australian leaders urge peaceful protests.",
    "link": "https://www.israelnationalnews.com/news/422192",
    "timestamp": "2026-02-10T03:42:34Z"
  },
  {
    "title": "Top Iran security official to travel to Oman for nuclear talks with US",
    "description": "A top Iranian security official will travel Tuesday to Oman, the Mideast sultanate now mediating talks between Tehran and the United States over the Islamic Republic' nuclear program aimed at halting a possible American strike.\nAli Larijani, a former Iranian …",
    "link": "https://www.business-standard.com/world-news/top-iran-security-official-to-travel-to-oman-for-nuclear-talks-with-us-126021000109_1.html",
    "timestamp": "2026-02-10T03:40:38Z"
  },
  {
    "title": "Ossoff: 'We May Lose Our Republic' if We Don't Rebuke Trump in Midterms",
    "description": "On Monday on MS NOW's \"The Rachel Maddow Show,\" Sen. Jon Ossoff (D-GA) said that Americans \"may lose our republic\" if voters don't rebuke President Donald Trump's policies in the upcoming midterm election.\nThe post Ossoff: ‘We May Lose Our Republic’ if We Don…",
    "link": "https://www.breitbart.com/clips/2026/02/09/ossoff-we-may-lose-our-republic-if-we-dont-rebuke-trump-in-midterms/",
    "timestamp": "2026-02-10T03:40:35Z"
  },
  {
    "title": "America isn't exceptional – it's the exception",
    "description": "America has self-importance in abundance. What it lacks is the data to back it up.",
    "link": "https://www.not-ship.com/america-isnt-exceptional-its-the-exception/",
    "timestamp": "2026-02-10T03:35:24Z"
  },
  {
    "title": "‘No privacy’ CBDCs will come, warns billionaire Ray Dalio",
    "description": "Hedge fund manager Ray Dalio warns that CBDCs will eliminate financial privacy and enable governments to tax, seize funds, and cut off political opponents.",
    "link": "https://cointelegraph.com/news/zero-privacy-highly-controlled-cbdcs-coming-soon-warns-ray-dalio?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "timestamp": "2026-02-10T03:31:13Z"
  },
  {
    "title": "Trump administration live updates: Members of Congress start viewing unredacted Epstein files at Justice Department (NBC News)",
    "description": "NBC News:\nTrump administration live updates: Members of Congress start viewing unredacted Epstein files at Justice Department  —  Ghislaine Maxwell invoked the Fifth Amendment at a House deposition today.  Her attorney later suggested she would provide a “com…",
    "link": "https://www.memeorandum.com/260209/p104",
    "timestamp": "2026-02-10T03:30:03Z"
  }
]