[
  {
    "title": "FEMA Worker Warns: Disaster Aid Could Be ‘Severed’ Thanks To Mass Firings",
    "description": "“It's almost like a vendetta: ‘I don't like this place, so I'm going to gut it,’\" the whistleblower told HuffPost. \"It's just so infuriating.\"",
    "link": "https://www.huffpost.com/entry/fema-worker-warns-disaster-aid-could-be-severed-under-doge-firings_n_67bf7ef6e4b0c1f0afe352ab",
    "timestamp": "2025-02-27T20:45:33Z"
  },
  {
    "title": "The number Wall Street analysts zeroed in on during Nvidia's earnings call",
    "description": "Nvidia CFO Colette Kress said gross margins are expected to be in the \"low 70s\" as Blackwell production ramps up before improving later in the year.",
    "link": "https://www.businessinsider.com/nvidia-gross-margin-guidance-analysts-questions-2025-2",
    "timestamp": "2025-02-27T20:44:21Z"
  },
  {
    "title": "A dirty week in Parliament",
    "description": "Dirt units are in the spotlight after a big week of mudslinging in Parliament, and UK PM Keir Starmer has met with Donald Trump. \nThe post A dirty week in Parliament appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/28/dirty-week-parliament/",
    "timestamp": "2025-02-27T20:44:04Z"
  },
  {
    "title": "Trump’s biggest power grab just reached the Supreme Court",
    "description": "President Donald Trump gestures to Chief Justice John Roberts after being sworn in at the US Capitol Rotunda on January 20, 2025.﻿ | Julia Demaree Nikhinson/Getty Images\nOn Wednesday night, Chief Justice John Roberts temporarily halted a lower court order, wh…",
    "link": "https://biztoc.com/x/e48cc4b5ad7745b1",
    "timestamp": "2025-02-27T20:43:43Z"
  },
  {
    "title": "Trump: Moving along rapidly to end Ukraine war",
    "description": "United States President Donald Trump insisted on Thursday that the negotiations about ending the conflict in Ukraine are \"moving along rapidly,\" and that reaffirmed his conviction it would end soon as...",
    "link": "https://biztoc.com/x/daf83da64e5efb26",
    "timestamp": "2025-02-27T20:43:33Z"
  },
  {
    "title": "KFF Health News' 'What the Health?': House GOP Plan Targets Medicaid",
    "description": "The House passed a budget plan that likely would result in major cuts to the Medicaid program. But the plan now faces a battle in the Senate, where even Republicans seem reluctant to dramatically reduce a health program that covers roughly 1 in 5 Americans. M…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-386-house-budget-measles-scotus-february-27-2025/",
    "timestamp": "2025-02-27T20:40:00Z"
  },
  {
    "title": "US Judge in San Francisco Will Hear Union Request to Halt Trump Mass Firings",
    "description": "Labor unions will argue at a Thursday hearing that Trump officials lack the authority to order terminations of probationary federal employees and that notices to workers were premised on a lie of poor job performance.",
    "link": "https://www.kqed.org/news/12029015/us-judge-in-san-francisco-will-hear-union-request-to-halt-trump-mass-firings",
    "timestamp": "2025-02-27T20:39:42Z"
  },
  {
    "title": "'Lorne has always been looking for a tribe, and he built it with the people he cast on SNL'",
    "description": "Susan Morrison's new biography on the creator of 'Saturday Night Live,' Lorne Michaels, explores his Jewish roots in Toronto, his huge impact on comedy and what his legacy will be: 'He really influenced what we think is funny'",
    "link": "https://www.haaretz.com/life/books/2025-02-27/ty-article-magazine/.premium/lorne-was-always-looking-for-a-tribe-and-he-built-it-with-the-people-he-cast-on-snl/00000195-3326-d871-a5bf-b327314a0000",
    "timestamp": "2025-02-27T20:35:20Z"
  },
  {
    "title": "House GOP Budget Would Raise Health Care Costs for the Poor to Pay the Rich",
    "description": "The push to slash health care to pay for Trump's tax cuts will come back to haunt Republicans.",
    "link": "https://truthout.org/articles/house-gop-budget-would-raise-health-care-costs-for-the-poor-to-pay-the-rich/",
    "timestamp": "2025-02-27T20:34:40Z"
  },
  {
    "title": "Watch live: Trump holds joint press conference with British Prime Minister Keir Starmer",
    "description": null,
    "link": "https://www.cnbc.com/2025/02/27/trump-britain-keir-starmer-white-house-press-conference.html",
    "timestamp": "2025-02-27T20:31:23Z"
  },
  {
    "title": "Here's what happened today: Thursday",
    "description": "Taoiseach meets with Zelenskyy, Starmer visits the White House and Gene Hackman dies aged 95",
    "link": "https://www.thejournal.ie/news-fix-thursday-75-6635452-Feb2025/",
    "timestamp": "2025-02-27T20:30:51Z"
  },
  {
    "title": "Propaganda Press Upset Trump Could Shut Down CISA’s Election Censorship",
    "description": "The Trump administration has launched a review of every Cybersecurity and Infrastructure Agency (CISA) role related to election security and so-called mis- and disinformation after CISA began censoring speech. CISA, originally established in 2018 to address c…",
    "link": "https://thefederalist.com/2025/02/27/propaganda-press-upset-trump-could-shut-down-cisas-election-censorship/",
    "timestamp": "2025-02-27T20:30:38Z"
  },
  {
    "title": "Dirty Crypto: MELANIA And LIBRA Wallets Tied To Money Laundering?",
    "description": "Crypto investigators have flagged suspicious transactions linked to wallets associated with MELANIA and LIBRA memecoins. Blockchain data shows that these wallets moved large sums of money, raising concerns about potential money laundering. Related Reading: Cr…",
    "link": "https://bitcoinist.com/melania-wallets-allegedly-tied-to-money-laundering/",
    "timestamp": "2025-02-27T20:30:17Z"
  },
  {
    "title": "FBI director Kash Patel wants UFC to lead training; agents call it ‘wacky’",
    "description": "FBI director Kash Patel is considering bringing in trainers from the UFC to beef up agents' martial arts and self-defense skills.",
    "link": "https://mmajunkie.usatoday.com/2025/02/kash-patel-ufc-training-fbi-agents",
    "timestamp": "2025-02-27T20:30:10Z"
  },
  {
    "title": "No, DOGE didn't discover Louisiana man using 34 different names to collect Social Security benefits",
    "description": "The Department of Government Efficiency in the U.S. discovered that a Louisiana man was using 34 different names, addresses, and Social Security numbers to collect more than $1 million annually in Social Security benefits.",
    "link": "https://www.snopes.com//fact-check/doge-louisiana-man-social-security/",
    "timestamp": "2025-02-27T20:30:00Z"
  },
  {
    "title": "Brace for Impact? Economist who predicted one of the biggest crashes in history says immigrant deportations could trigger a faster recession, and Donald Trump will be solely responsible",
    "description": "Economist Harry Dent cautions that president Trump's policies of mass deportation may cause an early recession, with a possible 1% to 1.5% decline in GDP. Dent contends that the deportation of immigrants who are major contributors to the economy is ill-timed …",
    "link": "https://economictimes.indiatimes.com/news/international/us/brace-for-impact-economist-who-predicted-one-of-the-biggest-crashes-in-history-says-immigrant-deportations-could-trigger-a-faster-recession-and-donald-trump-will-be-solely-responsible/articleshow/118611672.cms",
    "timestamp": "2025-02-27T20:29:23Z"
  },
  {
    "title": "Trump Education Department Opens Snitch Line Against Diversity",
    "description": "Donald Trump’s Education Department is encouraging parents to report diversity efforts in public schools.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-education-department-snitch-portal-against-diversity-1235282457/",
    "timestamp": "2025-02-27T20:29:12Z"
  },
  {
    "title": "Trump confident Putin will ‘keep his word’ if there is a deal to end Ukraine war",
    "description": "President Donald Trump said he is confident that Russian leader Vladimir Putin will \"keep his word\" if an agreement is reached to end Moscow's invasion of Ukraine.",
    "link": "https://www.independent.ie/world-news/north-america/trump-confident-putin-will-keep-his-word-if-there-is-a-deal-to-end-ukraine-war/a1420279299.html",
    "timestamp": "2025-02-27T20:27:25Z"
  },
  {
    "title": "WNBA champ Natasha Cloud says 'it's time to break down a system that has only been about White men'",
    "description": "WNBA veteran Natasha Cloud spoke this week in defense of DEI after President Donald Trump ordered the elimination of several government DEI programs.",
    "link": "https://www.foxnews.com/sports/wnba-champ-natasha-cloud-says-its-time-break-down-system-has-only-been-about-white-men",
    "timestamp": "2025-02-27T20:26:45Z"
  },
  {
    "title": "No, Zelenskyy hasn’t blocked access to Truth Social in Ukraine",
    "description": "A spokesperson for Truth Social's parent company said the claim is false. The social media platform has never been available in Ukraine.",
    "link": "https://www.usatoday.com/story/news/factcheck/2025/02/27/truth-social-ukraine-fact-check/80698137007/",
    "timestamp": "2025-02-27T20:26:10Z"
  },
  {
    "title": "Keir Starmer woos Donald Trump with invitation for state visit to Britain",
    "description": "Keir Starmer sought to woo Donald Trump with an invite for an unprecedented state visit to Britain, ahead of crunch talks on Ukraine and the economy.",
    "link": "https://www.independent.ie/world-news/britain/keir-starmer-woos-donald-trump-with-invitation-for-state-visit-to-britain/a537443963.html",
    "timestamp": "2025-02-27T20:26:08Z"
  },
  {
    "title": "Goya Foods: Allegations are flying behind the scenes at the Unanue family business",
    "description": "Earlier this week, the controversial former boss of Goya Foods self-published a mysterious press release about his departure from the company. Robert “Bob” Unanue said that after nearly five decades at the family business, he was suddenly informed that his “e…",
    "link": "https://www.cnn.com/2025/02/27/business/goya-foods-family-run-board-ousts-ceo-it-department/index.html",
    "timestamp": "2025-02-27T20:25:58Z"
  },
  {
    "title": "Trump says Ukraine rare earth minerals deal will lead to 'sustainable' future between US, Ukraine",
    "description": "President Donald Trump said Thursday the rare-earth minerals agreement would benefit both the U.S. and Ukraine and would provide resources that \"we need for our country.\"",
    "link": "https://www.foxnews.com/politics/trump-says-ukraine-rare-earth-minerals-deal-lead-sustainable-future-between-us-ukraine",
    "timestamp": "2025-02-27T20:25:48Z"
  },
  {
    "title": "Republican Congressman Slammed for Pitching Bill to Put Trump's Face on a $250 Bill: 'Sorry for the Loss of Your Self Respect'",
    "description": "Republican Rep. Joe Wilson is being blasted for introducing legislation to create a $250 bill featuring President Trump.",
    "link": "https://www.ibtimes.com/republican-congressman-slammed-pitching-bill-put-trumps-face-250-bill-sorry-loss-your-3764976",
    "timestamp": "2025-02-27T20:25:21Z"
  },
  {
    "title": "Migrant arrests at US-Mexico border near record low in February",
    "description": "WASHINGTON (Reuters) -The number of migrants caught illegally crossing the U.S.-Mexico border in February is on pace to be at or near a record monthly low, a U.S. Department of Homeland Security spokesperson and two other sources told Reuters. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/28/migrant-arrests-at-us-mexico-border-approach-record-low-in-february",
    "timestamp": "2025-02-27T20:25:00Z"
  },
  {
    "title": "Why is Netanyahu pushing into the West Bank now?",
    "description": "Israeli tanks have entered some Palestinian cities for the first time in decades. What's behind this latest assault on the occupied territory, and where could it lead if left unchecked?",
    "link": "https://theweek.com/world-news/israel-west-bank-palestine-gaza-tanks-jenin-netanyahu",
    "timestamp": "2025-02-27T20:21:54Z"
  },
  {
    "title": "Egg Prices Keep on Rising",
    "description": "From Trading Economics today: Figure 1: Gray line is TradingEconomics forecast. Orange line at 1/21/2025. Source: TradingEconomics, accessed 2/27/2025. Egg prices as measured here have risen 22% since 1/21. Interestingly, for at least the past couple of weeks…",
    "link": "https://econbrowser.com/archives/2025/02/egg-prices-keep-on-rising",
    "timestamp": "2025-02-27T20:18:54Z"
  },
  {
    "title": "Canada's fentanyl czar sees 'very positive' reaction in Washington meetings",
    "description": "Canadian fentanyl czar Kevin Brosseau says American officials are showing their approval for his new role as he and several other top officials are in Washington to show Canada's successes at stopping the flow of drugs and migrants.",
    "link": "https://www.cbc.ca/news/politics/fentanyl-czar-washington-1.7470437",
    "timestamp": "2025-02-27T20:17:54Z"
  },
  {
    "title": "Trump Admin Confronts British PM Over Free Speech Violations",
    "description": "Vice President JD Vance said the Trump administration and U.K. Prime Minister Keir Starmer are discussing how free speech violations there affect American citizens, as... Read More\nThe post Trump Admin Confronts British PM Over Free Speech Violations appeared…",
    "link": "https://www.dailysignal.com/2025/02/27/trump-admin-confronts-british-pm-curbs-free-speech/",
    "timestamp": "2025-02-27T20:17:35Z"
  },
  {
    "title": "Global splinters evident at G20 finance ministers meeting",
    "description": "JOHANNESBURG — The Group of 20 major economies has been instrumental in coordinating the response to crises like the COVID pandemic. But top officials from the U.S. and several other member states skipped the G20 finance ministers’ meeting in South Africa thi…",
    "link": "https://www.voanews.com/a/7990649.html",
    "timestamp": "2025-02-27T20:17:31Z"
  },
  {
    "title": "Scott Jennings Says James Carville ‘Having An Emotional Breakdown’ After Getting 2024 ‘So Wrong’",
    "description": "Scott Jennings criticized James Carville over his prediction that President Donald Trump's administration would \"collapse\" within a month.",
    "link": "https://dailycaller.com/2025/02/27/scott-jennings-says-james-carville-having-an-emotional-breakdown-after-getting-2024-so-wrong/",
    "timestamp": "2025-02-27T20:15:12Z"
  },
  {
    "title": "NDP MP joins workers in calling for Amazon boycott after Quebec closures",
    "description": "New Democrat MP Charlie Angus is calling for a countrywide consumer boycott of Amazon to protest the online retail giant's closure of seven of its warehouses in Quebec.",
    "link": "https://www.cbc.ca/news/canada/montreal/unionized-amazon-warehouse-quebec-concern-1.7470487",
    "timestamp": "2025-02-27T20:13:41Z"
  },
  {
    "title": "Elon Musk is in charge. The Trump White House just won't admit it.",
    "description": "Chris Hayes explains why Elon Musk's commanding presence at Trump's Cabinet meeting, despite several costly DOGE mistakes, may reveal who really has the power.",
    "link": "https://www.msnbc.com/top-stories/latest/elon-musk-trump-cabinet-doge-mistakes-rcna194057",
    "timestamp": "2025-02-27T20:13:28Z"
  },
  {
    "title": "FBI Director Kash Patel Considering Having UFC Train Agents",
    "description": "Newly sworn-in FBI Director Kash Patel wants his org to kick some serious ass ... with reports stating he's considering bringing in UFC trainers to work with agents!! According to Reuters, Patel suggested the idea in a video conference with…",
    "link": "https://www.tmz.com/2025/02/27/kash-patel-ufc-fbi-training/",
    "timestamp": "2025-02-27T20:13:17Z"
  },
  {
    "title": "The COVID ‘contrarians’ are in power. We still haven’t hashed out whether they were right",
    "description": "Public health officials face ebbing public trust as well as a disruptive new health administration.",
    "link": "https://www.bostonherald.com/2025/02/27/covid-contrarians/",
    "timestamp": "2025-02-27T20:12:33Z"
  },
  {
    "title": "Trump 'inclined' to back UK's Chagos Islands deal",
    "description": "The UK has offered Trump an effective veto on the deal because of its implications for US security.",
    "link": "https://www.bbc.com/news/articles/c5yxxjr8v2vo",
    "timestamp": "2025-02-27T20:11:54Z"
  },
  {
    "title": "'Telling moment': CNN host shocked as Trump jokes he'd abandon ally if Putin attacked",
    "description": "CNN's Boris Sanchez on Thursday identified a \"telling moment\" during President Donald Trump's joint press event with United Kingdom Prime Minister Keir Starmer.The moment came when Trump was asked if Americans would help the United Kingdom if Russia launched …",
    "link": "https://www.rawstory.com/trump-keir-starmer-2671236190/",
    "timestamp": "2025-02-27T20:11:11Z"
  },
  {
    "title": "Here's how Trump's pick to lead the US Navy wants to fix the submarine shipbuilding problem",
    "description": "John Phelan said the Navy is grappling with \"systemic failures\" that include inadequate maintenance, massive cost overruns, and delayed shipbuilding.",
    "link": "https://www.businessinsider.com/how-trumps-pick-lead-us-navy-wants-fix-shipbuilding-problem-2025-2",
    "timestamp": "2025-02-27T20:09:56Z"
  },
  {
    "title": "John Roberts helps Trump officials by keeping freeze on foreign funds payments for now",
    "description": "Chief Justice John Roberts helped President Donald Trump’s administration avoid paying nearly $2 billion in congressionally appropriated foreign aid funds — for now.",
    "link": "https://biztoc.com/x/58491673584e9dab",
    "timestamp": "2025-02-27T20:09:48Z"
  },
  {
    "title": "Japan copper processor gains toehold in U.S. as Trump eyes tariffs",
    "description": "TOYAMA, Japan -- Japanese nonferrous-metal processor MERF will start making and selling copper alloy bullion in the U.S. through an acquisition there, looking to tap demand related to American companies prodded by President Donald Trump to bring production ho…",
    "link": "https://biztoc.com/x/942b3f9543a56867",
    "timestamp": "2025-02-27T20:09:25Z"
  },
  {
    "title": "New FBI Director Wants To Partner With Dana White’s UFC To Create Super Agents",
    "description": "It’s no secret Dana White has a pretty cozy relationship with Donald Trump, but the UFC founder isn’t involved with the current administration in any governmental capacity. However, that could change now that the newest director of the FBI has proposed a pote…",
    "link": "https://brobible.com/sports/article/fbi-director-kash-patel-ufc-agent-training/",
    "timestamp": "2025-02-27T20:09:22Z"
  },
  {
    "title": "Who Counts as a Hillbilly—And Who Gets to Decide?",
    "description": "Appalachia exists as much in myth as in literal geography.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/02/who-counts-as-a-hillbillyand-who-gets-to-decide/681857/",
    "timestamp": "2025-02-27T20:09:00Z"
  },
  {
    "title": "CFPB lets Capital One off the hook for $2 billion",
    "description": "Consumers who say they were cheated out of $2 billion in interest payments from Capital One (COF) will have to pursue action against the company on their own. That’s because the U.S. Consumer Financial Protection Bureau on Thursday dropped a legal action agai…",
    "link": "https://qz.com/cfpb-dismiss-2-billion-capital-one-fraud-case-1851766872",
    "timestamp": "2025-02-27T20:09:00Z"
  },
  {
    "title": "Trump Called GOP Rep. Who Was ‘Firm No’ on House Budget, ‘Fuming’ and ‘Screaming’ to Change Her Vote: Report",
    "description": "Rep. Virginia Spartz (R-IN) was a \"firm no\" on the House budget resolution until she got a phone call from President Donald Trump in which he was \"fuming\" and \"screaming\" at her, reported Puck's Leigh Ann Caldwell.\nThe post Trump Called GOP Rep. Who Was ‘Firm…",
    "link": "https://www.mediaite.com/politics/trump-called-gop-rep-who-was-firm-no-on-house-budget-fuming-and-screaming-to-change-her-vote-report/",
    "timestamp": "2025-02-27T20:07:33Z"
  },
  {
    "title": "Trump extends Russia sanctions for another year",
    "description": "US President Donald Trump has prolonged existing restrictions on Moscow over the Ukraine conflict, citing national security Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613409-trump-prolongs-russia-sanctions/",
    "timestamp": "2025-02-27T20:06:43Z"
  },
  {
    "title": "Myanmar Knows Xi’s World Order Is a Con",
    "description": "Beijing makes hollow promises of nonintervention as it meddles with its neighbors.",
    "link": "https://foreignpolicy.com/2025/02/27/myanmar-civil-war-china-xi-jinping-bri-intervention/",
    "timestamp": "2025-02-27T20:06:27Z"
  },
  {
    "title": "Department of Education launches 'EndDEI' portal for parents, students, teachers to report discrimination",
    "description": "The U.S. Department of Education launched an online portal allowing parents to report what’s been going on in classrooms, the latest move of the Trump administration's crackdown on DEI.",
    "link": "https://www.foxnews.com/media/department-education-launches-enddei-portal-parents-students-teachers-potential-investigation",
    "timestamp": "2025-02-27T20:06:05Z"
  },
  {
    "title": "Trump receives invite from King Charles for second state visit",
    "description": "US President Donald Trump received an invitation from King Charles for a second state visit.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/2/27/trump-receives-invite-from-king-charles-for-second-state-visit",
    "timestamp": "2025-02-27T20:05:53Z"
  },
  {
    "title": "Hey Elon: You Don’t Just ‘Ooopsie’ The Destruction Of Ebola Prevention",
    "description": "Look, sometimes you make mistakes. Maybe you send an email to the wrong person. Maybe you accidentally buy the wrong kind of pasta sauce at the grocery store. Maybe you accidentally dismantle critical global health infrastructure. These things happen! At leas…",
    "link": "https://www.techdirt.com/2025/02/27/hey-elon-you-dont-just-ooopsie-the-destruction-of-ebola-prevention/",
    "timestamp": "2025-02-27T20:05:06Z"
  },
  {
    "title": "House Dems Introduce Bill to Ban Trump, Congress From Promoting, Launching Meme Coins",
    "description": "The MEME Act would slap any high-ranking government official who makes money from promoting crypto tokens with criminal and civil penalties.",
    "link": "https://decrypt.co/308083/house-dems-introduce-bill-to-ban-trump-congress-from-promoting-launching-meme-coins",
    "timestamp": "2025-02-27T20:05:00Z"
  },
  {
    "title": "What does the King's letter to Trump say?",
    "description": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office.",
    "link": "https://news.sky.com/story/what-does-the-kings-letter-to-trump-say-13318305",
    "timestamp": "2025-02-27T20:05:00Z"
  },
  {
    "title": "Celebrities on the Epstein List: Famous Names Mentioned in the Files",
    "description": "A portion of the Jeffrey Epstein files were unveiled in 2024, and quite a few A-listers' names popped up. However, they were not linked to the deceased sex offender's crimes.",
    "link": "https://hollywoodlife.com/feature/celebrities-epstein-list-5372724/",
    "timestamp": "2025-02-27T20:02:42Z"
  },
  {
    "title": "ROOKE: SCOTUS Is About To Determine The Trajectory Of Entire Trump Term",
    "description": "SCOTUS is deciding the fate of President Donald Trump's second term thanks to a case involving nearly $2 billion in foreign-assistance payments.",
    "link": "https://dailycaller.com/2025/02/27/rooke-scotus-trajectory-trump-term-decision-supreme-court/",
    "timestamp": "2025-02-27T20:02:06Z"
  },
  {
    "title": "What is Mark Cuban's net worth?",
    "description": "Not every Trump-era billionaire has gone full MAGA",
    "link": "https://theweek.com/business/mark-cuban-net-worth-explained",
    "timestamp": "2025-02-27T20:02:03Z"
  },
  {
    "title": "Prosecuted Romanian presidential candidate asks Trump for help",
    "description": "The US president should stop an assault on democracy launched by the Romanian “deep state,” Calin Georgescu has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613414-prosecuted-romanian-politician-trump-help/",
    "timestamp": "2025-02-27T20:01:45Z"
  },
  {
    "title": "Blue city mayor embraces government efficiency in new memo to city employees",
    "description": "San Francisco Mayor Daniel Lurie directed city employees in a memo on Tuesday to return to the office at least four days a week to improve government efficiency.",
    "link": "https://www.foxnews.com/politics/blue-city-mayor-makes-move-toward-government-efficiency",
    "timestamp": "2025-02-27T20:01:27Z"
  },
  {
    "title": "Trump's Energy Policies Face Legal Challenges",
    "description": "As U.S. President Donald Trump rolls back the former government’s renewable energy initiatives in favour of fossil fuels, environmentalists and climate groups are not taking it lying down. Trump said throughout his electoral campaign that he intended to rever…",
    "link": "https://oilprice.com/Energy/Energy-General/Trumps-Energy-Policies-Face-Legal-Challenges.html",
    "timestamp": "2025-02-27T20:00:00Z"
  },
  {
    "title": "XRP Futures Open Interest dives to 2025 low — Are traders abandoning Altcoin bets?",
    "description": "XRP traders seem to be losing confidence, resulting in futures open interest dropping from $7.62 billion to $3.02 billion.",
    "link": "https://ambcrypto.com/xrp-futures-open-interest-dives-to-2025-low-are-traders-abandoning-altcoin-bets/",
    "timestamp": "2025-02-27T20:00:00Z"
  },
  {
    "title": "President Trump Says He Intends To Double Existing Tariffs On China",
    "description": "President Donald Trump signaled his intent to double existing tariffs on China starting Tuesday in a Thursday post on Truth Social.",
    "link": "https://dailycaller.com/2025/02/27/president-donald-trump-double-existing-tariffs-china/",
    "timestamp": "2025-02-27T19:55:52Z"
  },
  {
    "title": "Amid Fragile Ceasefire, Israel Still Illegally Occupies 5 Locations in Lebanon",
    "description": "Reporting from southern Lebanon, journalist Sharif Abdel Kouddous says Hezbollah has entered a new phase.",
    "link": "https://www.democracynow.org/2025/2/27/sharif_abdel_kouddous_lebanon_nasrallah_funeral",
    "timestamp": "2025-02-27T19:54:44Z"
  },
  {
    "title": "The CFPB drops its enforcement lawsuits against Capital One, Rocket Homes and more",
    "description": "The move comes just weeks under new leadership and turmoil at the agency caused by orders from Trump administration.",
    "link": "https://www.denverpost.com/2025/02/27/cfpb-cases-dropped/",
    "timestamp": "2025-02-27T19:54:34Z"
  },
  {
    "title": "Washington Post Opinion Section Lead Editor Bounces After Jeff Bezos Announces Revamp, X Is Tossing Their Subscriptions",
    "description": "Jeff Bezos is feeling the wrath of X users after he announced the revamping of the Washington Post's opinion section.",
    "link": "https://hiphopwired.com/playlist/jeff-bezos-washington-post-opinion-section-revamp-reactions/",
    "timestamp": "2025-02-27T19:54:27Z"
  },
  {
    "title": "Online Posts Misconstrue Data on Social Security Numbers",
    "description": "Elon Musk shared a chart on X purportedly showing more than 398 million eligible numbers in the Social Security database. Online posts misconstrued the figures to wrongly claim they showed how many people are receiving benefits, which would exceed the U.S. po…",
    "link": "https://www.factcheck.org/2025/02/online-posts-misconstrue-data-on-social-security-numbers/",
    "timestamp": "2025-02-27T19:53:58Z"
  },
  {
    "title": "Trump's 'very big' minerals deal may pay off with US Republicans",
    "description": "WASHINGTON (Reuters) - A critical minerals deal Donald Trump has negotiated with Ukraine could ease tensions between Kyiv and the U.S. president and at the same time win back support from his Republicans in Congress for a new round of aid to the war-torn coun…",
    "link": "https://www.thestar.com.my/news/world/2025/02/28/trump039s-039very-big039-minerals-deal-may-pay-off-with-us-republicans",
    "timestamp": "2025-02-27T19:53:00Z"
  },
  {
    "title": "Trump Says He Trusts Putin, As UK PM Pushes Ukraine Guarantees",
    "description": "Donald Trump said he trusted Russia&#039;s Vladimir Putin to stick to any Ukraine ceasefire Thursday, as UK Prime Minister Keir Starmer tried to win security guarantees for Kyiv -- with the help of a royal invitation to visit Britain.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-he-trusts-vladimir-putin-as-uk-pm-pushes-ukraine-guarantees-7811152",
    "timestamp": "2025-02-27T19:52:50Z"
  },
  {
    "title": "Trump says he is likely to accept UK deal on Chagos Islands",
    "description": "President Donald Trump said on Thursday he was inclined to back a deal between Britain and Mauritius over the future of a U.S.-UK military base in the Chagos...",
    "link": "https://ca.news.yahoo.com/trump-says-likely-accept-uk-195123719.html",
    "timestamp": "2025-02-27T19:51:23Z"
  },
  {
    "title": "Jeff Bezos applauded for reining in 'absurd lunacy' of Washington Post opinion pages",
    "description": "'Fox & Friends Weekend' co-host Charlie Hurt said the shift in the 'lunatic outfit' newspaper Washington Post comes as a result of the company 'losing its independence.'",
    "link": "https://www.foxnews.com/media/jeff-bezos-applauded-reining-absurd-lunacy-washington-post-opinion-pages",
    "timestamp": "2025-02-27T19:51:14Z"
  },
  {
    "title": "Donald Trump’s new tariff plan: What it means for US consumers and the economy",
    "description": "The US government is set to impose new tariffs on imports from Canada, Mexico, and China, which could lead to price hikes for American consumers. While aimed at protecting domestic industries, experts warn that these tariffs may contribute to inflation and di…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-new-tariff-plan-what-it-means-for-us-consumers-and-the-economy/articleshow/118611689.cms",
    "timestamp": "2025-02-27T19:50:58Z"
  },
  {
    "title": "How long will Trump's win from John Roberts last?",
    "description": "Chief Justice John Roberts helped President Donald Trump’s administration avoid paying nearly $2 billion in congressionally appropriated foreign aid funds — for now.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/john-roberts-trump-usaid-supreme-court-appeal-rcna193987",
    "timestamp": "2025-02-27T19:50:40Z"
  },
  {
    "title": "CNN Analyst Laughs Out Loud At Trump Cabinet Sucking Up: ‘Look At Them All Just Clapping!’",
    "description": "CNN Senior Political Analyst Mark Preston laughed out loud at members of Trump's cabinet cheering as Trump threatened to eject anyone who disagrees with him.\nThe post CNN Analyst Laughs Out Loud At Trump Cabinet Sucking Up: ‘Look At Them All Just Clapping!’ f…",
    "link": "https://www.mediaite.com/news/cnn-analyst-laughs-out-loud-at-trump-cabinet-sucking-up-look-at-them-all-just-clapping/",
    "timestamp": "2025-02-27T19:50:32Z"
  },
  {
    "title": "Trump accepts second state visit to UK, reveals letter from King Charles (Greg Norman/Fox News)",
    "description": "Greg Norman / Fox News:\nTrump accepts second state visit to UK, reveals letter from King Charles  —  Trump reveals letter from King Charles III  —  President Donald Trump accepted an invitation on Thursday from King Charles III for a second state visit to the…",
    "link": "https://www.memeorandum.com/250227/p101",
    "timestamp": "2025-02-27T19:50:00Z"
  },
  {
    "title": "'Can't believe I said that': Trump backtracks on comment that left world leaders incensed",
    "description": "President Donald Trump appeared to deny he'd made a previous, controversial claim that Ukrainian President Volodymyr Zelensky is a \"dictator\" at a press conference following his White House meeting with British Prime Minister Keir Starmer — a claim that trigg…",
    "link": "https://www.rawstory.com/trump-starmer-ukraine/",
    "timestamp": "2025-02-27T19:47:47Z"
  },
  {
    "title": "Elon Musk says he's sending Starlink tech to FAA while saying, without evidence, that air safety is 'at risk'",
    "description": "Elon Musk said Thursday that he's sending his Starlink satellite internet terminals to the Federal Aviation Administration while saying, without providing evidence, that current technology poses a risk to air travel safety.\nThe billionaire and top advisor to …",
    "link": "https://biztoc.com/x/417da35ce7b6795e",
    "timestamp": "2025-02-27T19:46:55Z"
  },
  {
    "title": "Playbook PM: Trump escalates trade war threat (Eli Okun/Politico)",
    "description": "Eli Okun / Politico:\nPlaybook PM: Trump escalates trade war threat  —  THE CATCH-UP  —  TRADE WARS: President Donald Trump today redoubled his threats to slap fresh tariffs on the country's three biggest trading partners.  —  Canada and Mexico: So much for ye…",
    "link": "https://www.memeorandum.com/250227/p95",
    "timestamp": "2025-02-27T19:45:08Z"
  },
  {
    "title": "Trump is closing 3 St. Louis-area federal offices. One was already slated to shutter.",
    "description": "Each of the local leases listed on DOGE's \"Wall of Receipts\" were for offices less than 5,000 square feet of space.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_1d9bb268-f522-11ef-8040-8b74538d2aab.html",
    "timestamp": "2025-02-27T19:45:00Z"
  },
  {
    "title": "Brutal 20% Ethereum price sell-off is not over, but is there a silver lining for ETH?",
    "description": "Ethereum price has yet to recover from its 20% correction, but investors’ choice to pivot away from memecoins and Solana could be ETH’s saving grace.",
    "link": "https://cointelegraph.com/news/brutal-20-ethereum-price-sell-off-is-not-over-but-is-there-a-silver-lining-for-eth",
    "timestamp": "2025-02-27T19:45:00Z"
  },
  {
    "title": "Trudeau shuts down NDP proposal to bar Trump from G7 summit",
    "description": "Prime Minister Justin Trudeau is rejecting NDP Leader Jagmeet Singh's proposal to bar Donald Trump from attending the G7 summit taking place this spring in Canada.",
    "link": "https://www.cbc.ca/news/politics/trump-trudeau-g7-june-meeting-1.7470393",
    "timestamp": "2025-02-27T19:43:53Z"
  },
  {
    "title": "Elon Musk sends Starlink tech to FAA, says without evidence air safety is 'at risk'",
    "description": "Executives at major airlines told CNBC on Thursday that they do not see the FAA infrastructure as an immediate safety risk.",
    "link": "https://www.cnbc.com/2025/02/27/elon-musk-starlink-faa-safety-claims.html",
    "timestamp": "2025-02-27T19:43:09Z"
  },
  {
    "title": "House Democrats Look To Shoot Down TRUMP Memecoin With Proposed MEME Act: Report",
    "description": "A freshman California Democrat congress member is proposing legislation to prevent lawmakers from profiting off meme assets. According to reports from ABC and AP News, Representative Sam Liccardo (D-CA) is introducing the Modern Emoluments and Malfeasance Enf…",
    "link": "https://dailyhodl.com/2025/02/27/house-democrats-look-to-shoot-down-trump-memecoin-with-proposed-meme-act-report/",
    "timestamp": "2025-02-27T19:41:38Z"
  },
  {
    "title": "BBC Verify: Viral Donald Trump Jr audio highly likely AI fake",
    "description": "A clip of Donald Trump Jr allegedly saying on his podcast that the US should have sent arms to Russia rather than Ukraine was very likely generated with AI, experts say.",
    "link": "https://www.bbc.com/news/videos/c36wwzpj1w7o",
    "timestamp": "2025-02-27T19:41:26Z"
  },
  {
    "title": "EXCLUSIVE: Peter Navarro Reveals The Real Plan Behind Trump’s New Tariffs",
    "description": "Peter Navarro discussed the president's tariff philosophy with the Daily Caller, explaining that with these countries it ultimately comes down to fentanyl.",
    "link": "https://dailycaller.com/2025/02/27/peter-navarro-donald-trump-tariffs-china-canada-mexico/",
    "timestamp": "2025-02-27T19:40:56Z"
  },
  {
    "title": "5 things to watch on the ASX 200 on Friday",
    "description": "Will the market end the month on a positve note? Let's find out.\nThe post 5 things to watch on the ASX 200 on Friday appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/02/28/5-things-to-watch-on-the-asx-200-on-friday-28-february-2025/",
    "timestamp": "2025-02-27T19:40:22Z"
  },
  {
    "title": "Viral Trump Gaza Video Shows How Quickly AI Slop Can Spread",
    "description": "Bizarre AI videos are nothing new, but as AI models become more advanced and easier to use, they show up in new contexts.",
    "link": "https://www.cnet.com/tech/services-and-software/viral-trump-gaza-video-shows-how-quickly-ai-slop-can-spread/",
    "timestamp": "2025-02-27T19:40:18Z"
  },
  {
    "title": "Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’",
    "description": "DAILY CALLER NEWS FOUNDATION—Former vice presidential candidate and Democratic Minnesota Gov. Tim Walz was caught claiming that America is being stolen by “fascists and Nazis,”... Read More\nThe post Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’ a…",
    "link": "https://www.dailysignal.com/2025/02/27/tim-walz-claims-america-was-stolen-by-fascists-and-nazis/",
    "timestamp": "2025-02-27T19:39:59Z"
  },
  {
    "title": "Elon Musk’s ‘I am become meme’ quote, explained—what it means and where it started",
    "description": "'I am become meme' refers to a statement made by Elon Musk at the 2025 Conservative Political Action Conference (CPAC). The phrase, which Musk has used before, is a bizarre twist on J. Robert Oppenheimer’s famous quote about the atomic bomb and quickly became…",
    "link": "https://www.dailydot.com/memes/i-am-become-meme-elon-musk/",
    "timestamp": "2025-02-27T19:39:45Z"
  },
  {
    "title": "Trump Grilled by British Reporter Over Claim the EU Was ‘Constructed to Screw’ the US",
    "description": "Donald Trump pushed back at a press conference after being confronted with his recent claim the European Union was designed to \"screw\" the United States.\nThe post Trump Grilled by British Reporter Over Claim the EU Was ‘Constructed to Screw’ the US first appe…",
    "link": "https://www.mediaite.com/politics/trump-grilled-by-british-reporter-over-claim-the-eu-was-constructed-to-screw-the-us/",
    "timestamp": "2025-02-27T19:39:30Z"
  },
  {
    "title": "Watch: Trump welcomes prime minister to the White House",
    "description": "The highly anticipated meeting between the two leaders began with a question and answer with the press.",
    "link": "https://www.bbc.com/news/videos/c0mwwpwrw14o",
    "timestamp": "2025-02-27T19:39:08Z"
  },
  {
    "title": "\"Did I Say That?\": Trump Downplays Earlier \"Dictator\" Jibe At Zelensky",
    "description": "US President Donald Trump on Thursday downplayed an earlier jibe calling Ukrainian President Volodymyr Zelensky a &quot;dictator.&quot;",
    "link": "https://www.ndtv.com/world-news/donald-trump-downplays-earlier-dictator-jibe-at-ukraines-volodymer-zelensky-7811080",
    "timestamp": "2025-02-27T19:38:03Z"
  },
  {
    "title": "WTI up by almost 2.5% with Trump in spotlight",
    "description": "The prices of oil futures jumped on Thursday amid concerns about and analyses of United States President Donald Trump's introduced and prospective tariffs on various imports from other countries. Mean...",
    "link": "https://biztoc.com/x/893c184fe7ffd756",
    "timestamp": "2025-02-27T19:36:00Z"
  },
  {
    "title": "Higher Ed Needs to Show Its Work on Ending DEI",
    "description": "Students are not the only ones who have homework due this semester. Teachers, college professors, and school administrators have a civil rights assignment to turn... Read More\nThe post Higher Ed Needs to Show Its Work on Ending DEI appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/02/27/higher-ed-needs-to-show-its-work-on-ending-dei/",
    "timestamp": "2025-02-27T19:35:14Z"
  },
  {
    "title": "Nuclear Energy Policy in the Second Trump Administration",
    "description": "As the Trump administration makes key nuclear energy policy appointments, tariffs threaten to undermine U.S. competitiveness in next-generation reactors. In the early days of the second Trump administration, two schools of thought appeared to be emerging rega…",
    "link": "https://nationalinterest.org/blog/energy-world/nuclear-energy-policy-in-the-second-trump-administration/",
    "timestamp": "2025-02-27T19:33:21Z"
  },
  {
    "title": "WWE mogul and Trump's Education chief pick advances to final round",
    "description": "The Senate has advanced the nomination of former World Wrestling Entertainment (WWE) CEO Linda McMahon to serve as secretary of education for a final round of voting.",
    "link": "https://www.foxnews.com/politics/wwe-mogul-trumps-education-chief-pick-advances-final-round",
    "timestamp": "2025-02-27T19:31:32Z"
  },
  {
    "title": "Trump’s Pick To Lead The Navy Signals Commitment To Rebuilding America’s Depleted Maritime Fleet",
    "description": "Rebuilding America's naval fleet will be a priority for the Trump admin, Navy Secretary nominee John Phelan told lawmakers on Thursday.",
    "link": "https://thefederalist.com/2025/02/27/trumps-pick-to-lead-the-navy-signals-commitment-to-rebuilding-americas-depleted-maritime-fleet/",
    "timestamp": "2025-02-27T19:31:00Z"
  },
  {
    "title": "FBI Wants A Piece Of UFC",
    "description": "FBI is setting its sights on UFC for a controversial new plan from newly-appointed director Kash Patel, which may have originated from U.S. President Donald Trump’s friendship with UFC CEO Dana White.",
    "link": "https://www.mmamania.com/2025/2/27/24374380/fbi-targets-ufc-warned-against-takeover-stunning-announcement-controversial-new-director-mma",
    "timestamp": "2025-02-27T19:29:35Z"
  }
]