[
  {
    "title": "Fetterman Might As Well Become A Republican After Latest Poll",
    "description": "Democratic Pennsylvania Sen. John Fetterman, a maverick known for frequently breaking with his own party, is performing better among Pennsylvania Republicans than Democrats, according to a new poll. Fetterman, who was a self-proclaimed “progressive” when he w…",
    "link": "https://dailycaller.com/2025/06/25/fetterman-republican-democrats-pennsylvania-poll/",
    "timestamp": "2025-06-25T19:55:01Z"
  },
  {
    "title": "Can Trump Save Israel from a War of Attrition? Will Trump’s Personalized Top-Down Ceasefire Hold?",
    "description": "On June 24, President Donald Trump announced an end to hostilities, framing the pause in fighting as a victory for his administration’s hardline strategy including controversial US airstrikes on Iranian nuclear facilities.\nAs tensions between Israel and Iran …",
    "link": "https://www.globalresearch.ca/trump-save-israel-war-attrition-iran/5892572",
    "timestamp": "2025-06-25T19:54:51Z"
  },
  {
    "title": "Republicans say tax retaliation proposal could be cut from Trump bill if international deal can be reached",
    "description": "A tax proposal that would enable U.S. President Donald Trump to retaliate against countries that impose taxes that he considers unfair could be removed from a sweeping budget bill, if an international deal can be struck before it passes, top White House and c…",
    "link": "https://biztoc.com/x/86d1efc1079864c7",
    "timestamp": "2025-06-25T19:53:47Z"
  },
  {
    "title": " #BREAKING: Chuck Schumer has been hospitalized in DC, per multiple reports (on X)",
    "description": "Grok @grok · 25m The news of Chuck Schumer's hospitalization on June 25, 2025, is confirmed by credible sources like Newsweek and X posts from reporters. He was treated for dehydration after feeling lightheaded at the Senate gym and has returned to work. Publ…",
    "link": "https://freerepublic.com/focus/f-chat/4325275/posts",
    "timestamp": "2025-06-25T19:53:36Z"
  },
  {
    "title": "Trump Rips Zohran Mamdani After NYC Primary Triumph: 'Communist Lunatic'",
    "description": "President Trump said Mamdani \"looks TERRIBLE\" and referred to the mayoral candidate as a \"Communist Lunatic.\"",
    "link": "https://www.newsweek.com/trump-reacts-zohran-mamdani-nyc-mayor-primary-win-2090781",
    "timestamp": "2025-06-25T19:53:35Z"
  },
  {
    "title": "‘Total Obliteration’: Trump Cites Israeli Intel to Counter Leaked U.S. Military Report On Iranian Nuke Site",
    "description": "\"Israel is doing a report on it now, I understand, and I was told that they said it was total obliteration. I believe it was total obliteration\"\nThe post ‘Total Obliteration’: Trump Cites Israeli Intel to Counter Leaked U.S. Military Report On Iranian Nuke Si…",
    "link": "https://www.mediaite.com/politics/total-obliteration-trump-cites-israeli-intel-to-counter-leaked-u-s-military-report-on-iranian-nuke-site/",
    "timestamp": "2025-06-25T19:53:12Z"
  },
  {
    "title": "HUD to Relocate D.C. Headquarters to NSF Building in Alexandria",
    "description": "The U.S. Department of Housing and Urban Development (HUD) has cemented plans to relocate from what current HUD Secretary Scott Turner described as “the ugliest building in D.C.” HUD on Wednesday unveiled plans to move its headquarters from the Brutalist-styl…",
    "link": "http://commercialobserver.com/2025/06/hud-hq-relocation-nova-dc-trump/",
    "timestamp": "2025-06-25T19:51:57Z"
  },
  {
    "title": "EXCLUSIVE: New Video Showcases Human Impact of Biden’s Border Crisis on Texas Rancher",
    "description": "FIRST ON THE DAILY SIGNAL—When Martin Wall and his wife bought a ranch in Eagle Pass, Texas, in 2021, they had no idea they’d spend... Read More\nThe post EXCLUSIVE: New Video Showcases Human Impact of Biden’s Border Crisis on Texas Rancher appeared first on T…",
    "link": "https://www.dailysignal.com/2025/06/25/exclusive-new-video-showcases-human-impact-of-bidens-border-crisis-on-texas-rancher/",
    "timestamp": "2025-06-25T19:50:56Z"
  },
  {
    "title": "Why the tech trade has more room to run even as the Nasdaq 100 hovers at all-time highs",
    "description": "The use of AI is accelerating, UBS said, which means the tech rally has room to run. \"We believe a peak in overall AI adoption is still a long way off.\"",
    "link": "https://www.businessinsider.com/ai-stocks-nasdaq-100-ndx-tech-trade-nvda-avgo-amd-2025-6",
    "timestamp": "2025-06-25T19:50:37Z"
  },
  {
    "title": "Richard Heinberg: Environmental-Political Collapse Accelerates",
    "description": "Another wise post with great insights and predictions about where we are today from Richard Heinberg, the foremost scholar of Peak oil, overshoot, ecology, and more. Richard Heinberg (December 2024) Environmental-Political Collapse Accelerates. Environmental-…",
    "link": "https://energyskeptic.com/2025/richard-heinberg-environmental-political-collapse-accelerates/",
    "timestamp": "2025-06-25T19:48:42Z"
  },
  {
    "title": "Steve Bannon Says Israel 'Not an Ally' of US",
    "description": "Bannon referred to Fox News host Mark Levin as \"Tel Aviv Levin\" for his views on escalating warfare against Iran.",
    "link": "https://www.newsweek.com/steve-bannon-netanyahu-iran-israel-war-2090699",
    "timestamp": "2025-06-25T19:47:49Z"
  },
  {
    "title": "Jeff Bezos, Lauren Sànchez And Celebrity Guests Arrive In Venice Ahead Of Wedding (Photos)",
    "description": "Wedding guests have already touched down in Venice, including billionaire Barry Diller and Ivanka Trump.",
    "link": "https://www.forbes.com/sites/conormurray/2025/06/25/jeff-bezos-lauren-snchez-and-celebrity-guests-arrive-in-venice-ahead-of-wedding-photos/",
    "timestamp": "2025-06-25T19:46:53Z"
  },
  {
    "title": "MAGA Influencer Turns on Trump, Calling Him a 'Chronic Disappointment': 'I Feel Embarrassed I Told People to Vote for Him'",
    "description": "MAGA influencer Candace Owens blamed the MAGA split on \"Israel-first people,\" citing Trump's recent bombing of Iran in support of Israel.",
    "link": "https://www.ibtimes.com/maga-influencer-turns-trump-calling-him-chronic-disappointment-i-feel-embarrassed-i-told-3776827",
    "timestamp": "2025-06-25T19:46:13Z"
  },
  {
    "title": "Trump voters cheer his move against Iran. MAGA leaders had warned the bombing could backfire",
    "description": "Early polls suggest Republicans are far more supportive of the military action than are Democrats.",
    "link": "https://www.bostonherald.com/2025/06/25/trump-iran-maga-polling/",
    "timestamp": "2025-06-25T19:45:23Z"
  },
  {
    "title": "What is reconciliation − the legislative shortcut Republicans are using to push through their ‘Big Beautiful Bill’?",
    "description": "By using reconciliation, which was originally intended to rein in deficits, Republicans can pass the bill with a simple majority vote. But analysts expect it to lead to larger deficits.",
    "link": "https://theconversation.com/what-is-reconciliation-the-legislative-shortcut-republicans-are-using-to-push-through-their-big-beautiful-bill-255487",
    "timestamp": "2025-06-25T19:45:08Z"
  },
  {
    "title": "Killings in Arizona and Minnesota shine light on the crisis of Christian extremist violence",
    "description": "The death of an Arizona pastor and shootings involving Minnesota lawmakers have occurred in a national environment that has become awfully permissive of Christian extremist violence.",
    "link": "https://www.msnbc.com/top-stories/latest/christian-extremist-violence-arizona-pastor-boelter-minnesota-rcna215061",
    "timestamp": "2025-06-25T19:44:46Z"
  },
  {
    "title": "The Democrat Leader just endorsed the socialist who wants to abolish ICE and release all the prisoners",
    "description": "Stephen Miller : The Democrat Leader just endorsed the socialist who wants to abolish ICE and release all the prisoners. Schmucky : I have known Zohran K Mamdani since we worked together to provide debt relief for thousands of beleaguered taxi drivers & fough…",
    "link": "https://freerepublic.com/focus/f-news/4325272/posts",
    "timestamp": "2025-06-25T19:44:40Z"
  },
  {
    "title": "The Democrat Leader just endorsed the socialist who wants to abolish ICE and release all the prisoners",
    "description": "Stephen Miller : The Democrat Leader just endorsed the socialist who wants to abolish ICE and release all the prisoners. Schmucky : I have known Zohran K Mamdani since we worked together to provide debt relief for thousands of beleaguered taxi drivers & fough…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325272/posts",
    "timestamp": "2025-06-25T19:44:40Z"
  },
  {
    "title": "Is Trump sidelining Congress' war powers?",
    "description": "President Donald Trump's decision to attack Iran has renewed a long-running debate about war powers. The Constitution gives Congress, not the president, the authority to declare war. Presidents routinely wage war anyway, citing their role as commander-in-chie…",
    "link": "https://biztoc.com/x/fd6d50556ffdde42",
    "timestamp": "2025-06-25T19:42:30Z"
  },
  {
    "title": "Trump Admin to Limit Sharing Classified Info to Congress Despite President Calling Iran Leak ‘Fake News’",
    "description": "President Donald Trump's administration will limit sharing classified information to Congress in response to the Iran leak that the president insists is false.\nThe post Trump Admin to Limit Sharing Classified Info to Congress Despite President Calling Iran Le…",
    "link": "https://www.mediaite.com/media/news/trump-admin-to-limit-sharing-classified-info-to-congress-despite-president-calling-iran-leak-fake-news/",
    "timestamp": "2025-06-25T19:42:10Z"
  },
  {
    "title": "NATO Chief Calling Trump ‘Daddy’ Even Stupider in Context",
    "description": "NATO chief calling Trump ‘Daddy’ is even stupider in context. NATO secretary-general Mark Rutte was praising the president for deftly dropping an ‘F-bomb’ on Israel and Iran.",
    "link": "http://nymag.com/intelligencer/article/nato-chief-calling-trump-daddy-even-stupider-in-context.html",
    "timestamp": "2025-06-25T19:41:54Z"
  },
  {
    "title": "New York Times: People Who Ignore Media’s Fake Outrage Give Trump Higher Approval Rating",
    "description": "It was an incredible self-own when the New York Times recently ran the headline, “One Thing Helping Trump’s Approval Rating: Some People Are Not Paying Attention.” An alternate heading could have easily been, “People Who Don’t Read This Paper Infinitely Happi…",
    "link": "https://thefederalist.com/2025/06/25/new-york-times-people-who-ignore-medias-fake-outrage-give-trump-higher-approval-rating/",
    "timestamp": "2025-06-25T19:41:17Z"
  },
  {
    "title": "Tel Aviv Might Be Getting a Trump Tower",
    "description": "A luxury hotel under construction in Tel Aviv will be the tallest hotel in the city—and it could have the Trump name on it. Eric Trump, who runs the Trump Organization, spoke to the owners of the hotel in the trendy Sarona district this spring about a partner…",
    "link": "https://www.newser.com/story/370894/tel-aviv-might-be-getting-a-trump-tower.html",
    "timestamp": "2025-06-25T19:40:00Z"
  },
  {
    "title": "Toronto charity no longer resettling 2SLGBTQ+ refugees in U.S. since Trump took office",
    "description": "On his first day in office, U.S. President Donald Trump suspended immigration pathways used by Rainbow Railroad to find asylum for 2SLGBTQ+ people facing persecution in other countries. The charity already had 70 people pre-approved to resettle in the U.S., w…",
    "link": "https://www.cbc.ca/news/canada/toronto/rainbow-railroad-2slgbtq-refugees-us-canada-1.7569791",
    "timestamp": "2025-06-25T19:39:36Z"
  },
  {
    "title": "Trump says he doesn’t care if US, Iran sign a nuclear agreement",
    "description": "Donald Trump said the US and Iran will hold talks next week but he doesn’t care about signing an agreement.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/25/trump-says-he-doesnt-care-if-us-iran-sign-a-nuclear-agreement",
    "timestamp": "2025-06-25T19:39:16Z"
  },
  {
    "title": "Democrat LaMonica McIver, Facing Over a Decade in Prison, Accuses Trump of Weaponizing DOJ Against Her",
    "description": "Rep. LaMonica McIver (D-NJ), facing over a decade in federal prison, is accusing President Donald Trump of weaponizing the Department of Justice against her.\nThe post Democrat LaMonica McIver, Facing Over a Decade in Prison, Accuses Trump of Weaponizing DOJ A…",
    "link": "https://www.breitbart.com/politics/2025/06/25/democrat-lamonica-mciver-facing-over-decade-prison-accuses-trump-weaponizing-doj-against-her/",
    "timestamp": "2025-06-25T19:38:52Z"
  },
  {
    "title": "Abbas tries to get Trump on board with Palestinian state",
    "description": "Abbas praises President Trump's role in brokering Israel-Iran ceasefire, expresses hope for renewed peace efforts and regional stability.",
    "link": "https://www.israelnationalnews.com/news/410664",
    "timestamp": "2025-06-25T19:37:22Z"
  },
  {
    "title": "Why the Polls Were So Wrong About Zohran Mamdani",
    "description": "Why were the polls so wrong for the 2025 New York mayoral primary? It was an off-year primary in the middle of a heat wave using ranked-choice voting. It’s surprising the polls weren’t even more inaccurate in predicting Mamdani’s win over Cuomo.",
    "link": "http://nymag.com/intelligencer/article/nyc-mayoral-election-polls-wrong-zohran-mamdani.html",
    "timestamp": "2025-06-25T19:36:39Z"
  },
  {
    "title": "Toys have been cheap for so long that it's going to be a huge shock now that prices are finally rising",
    "description": "Toys have been so cheap for so long that, if you're like me, your kids have tons. Now, prices are starting to rise. Maybe we'll stop buying so many.",
    "link": "https://www.businessinsider.com/toy-prices-cheap-going-up-rising-inflation-why-parents-buying-2025-6",
    "timestamp": "2025-06-25T19:36:24Z"
  },
  {
    "title": "Trump: Democrats 'crossed the line' by nominating Zohran Mamdani for NYC mayor",
    "description": "US President reacts to '100% Communist Lunatic' who defended the phrase 'globalize the Intifada' winning the Democratic primary in the New York City mayoral race.",
    "link": "https://www.israelnationalnews.com/news/410663",
    "timestamp": "2025-06-25T19:35:09Z"
  },
  {
    "title": "Trump dynasty goes Euro-resort: Ivanka and Jared transform ex-Soviet arms base into billion-dollar haven",
    "description": "Ivanka Trump and Jared Kushner are venturing into luxury real estate. They plan to convert an Albanian island into a high-end resort. The project involves a $1.4 billion investment in Sazan Island. The Albanian government has given preliminary approval. The i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-dynasty-goes-euro-resort-ivanka-and-jared-transform-ex-soviet-arms-base-into-billion-dollar-haven-trump-real-estate-news-ivanka-jared-real-estate-news/articleshow/122072571.cms",
    "timestamp": "2025-06-25T19:32:43Z"
  },
  {
    "title": "Trump or DOGE effect? Most Americans now don't like Elon Musk",
    "description": "Elon Musk's popularity has significantly declined since 2024, with his net favorability plummeting to -18.1%, according to Silver Bulletin. Polls indicate rising unfavorability across party lines, linked to his endorsement of Donald Trump and involvement with…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-or-doge-effect-most-americans-now-dont-like-elon-musk/articleshow/122076995.cms",
    "timestamp": "2025-06-25T19:32:24Z"
  },
  {
    "title": "'Low IQ candidate': Trump pushes Jasmine Crockett to run for president",
    "description": "President Donald Trump called on Democrats to make Rep. Jasmine Crockett (D-TX) their presidential nominee in 2028.In a Wednesday rant on Truth Social, Trump pushed for Democrats to run Crockett and Rep. Alexandria Ocasio-Cortez (D-NY) on a ticket together. H…",
    "link": "https://www.rawstory.com/donald-trump-jasmine-crockett-president/",
    "timestamp": "2025-06-25T19:31:47Z"
  },
  {
    "title": "Trump slams Mamdani as 'communist lunatic'",
    "description": "United States President Donald Trump blasted the Democrats on Wednesday, stating they \"crossed the line\" after the New York State Assembly member Zohran Mamdani won the party's mayoral primary in New ...",
    "link": "https://biztoc.com/x/6a424ac7170fe9cb",
    "timestamp": "2025-06-25T19:31:18Z"
  },
  {
    "title": "Is Trump sidelining Congress' war powers?",
    "description": "The Iran attack renews a long-running debate",
    "link": "https://theweek.com/politics/trump-sidelining-congress-war-powers",
    "timestamp": "2025-06-25T19:30:53Z"
  },
  {
    "title": "Trump press conference wraps with a question: Does he consider NATO members his children?",
    "description": "President Donald Trump responds to a reporter's question about Secretary General Mark Rutte calling him \"Daddy\" and whether he considers NATO members \"children.\" Laughing, Trump said Rutte \"did it very affectionately.\"",
    "link": "https://freerepublic.com/focus/f-news/4325269/posts",
    "timestamp": "2025-06-25T19:30:49Z"
  },
  {
    "title": "Mexico president threatens to sue over SpaceX rocket debris",
    "description": "Mexican President Claudia Sheinbaum on Wednesday threatened legal action over falling debris and contamination from billionaire Elon Musk's SpaceX rocket launches across the border in the United States.",
    "link": "https://phys.org/news/2025-06-mexico-threatens-sue-spacex-rocket.html",
    "timestamp": "2025-06-25T19:30:01Z"
  },
  {
    "title": "‘He Looks TERRIBLE!’ Trump Breaks Silence on ‘Communist Lunatic’ Zohran Mamdani’s NYC Victory",
    "description": "President Donald Trump is speaking out about the Democratic primary win by Zohran Mamdani in the New York City Mayor's race.\nThe post ‘He Looks TERRIBLE!’ Trump Breaks Silence on ‘Communist Lunatic’ Zohran Mamdani’s NYC Victory first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/he-looks-terrible-trump-breaks-silence-on-communist-lunatic-zohran-mamdanis-nyc-victory/",
    "timestamp": "2025-06-25T19:28:59Z"
  },
  {
    "title": "Trump blasts Zohran Mamdani as a ‘100% Communist Lunatic’ in scathing NYC mayoral rant: ‘Democrats have crossed the line’",
    "description": "President Trump blasted Zohran Mamdani’s politics – and looks – Wednesday after the socialist’s stunning upset in New York’s Democratic mayoral primary.",
    "link": "https://nypost.com/2025/06/25/us-news/trump-blasts-zohran-mamdani-as-a-100-communist-lunatic-in-scathing-nyc-mayoral-rant/",
    "timestamp": "2025-06-25T19:28:32Z"
  },
  {
    "title": "EU and US ‘knee deep’ in talks to avert trade war, says McGrath",
    "description": "Tense talks under way to head off Trump’s 50% tariff threat ahead of July 9th deadline",
    "link": "https://www.irishtimes.com/politics/2025/06/25/eu-and-us-knee-deep-in-talks-to-avert-trade-war-says-mcgrath/",
    "timestamp": "2025-06-25T19:28:01Z"
  },
  {
    "title": "Senate Minority Leader Schumer treated for dehydration at area hospital, his office says",
    "description": "Schumer was absent Wednesday morning from a press conference on the major tax bill that President Donald Trump is pushing Republicans to pass through Congress.",
    "link": "https://www.cnbc.com/2025/06/25/schumer-hospital-dehydration-office-says.html",
    "timestamp": "2025-06-25T19:27:35Z"
  },
  {
    "title": "'Get serious': GOP senator sends party stern message as megabill deadline looms",
    "description": "President Donald Trump’s Fourth of July deadline for Congress to pass his \"One Big Beautiful Bill Act\" hit another roadblock Wednesday after Sen. Ron Johnson (R-WI), who remains among a few Republicans who have not yet pledged to support the budget reconcilia…",
    "link": "https://www.rawstory.com/big-beautiful-bill-2672436126/",
    "timestamp": "2025-06-25T19:27:19Z"
  },
  {
    "title": "CNN: Hiroshima 'Barely Set Back' By Atomic Bomb",
    "description": "U.S. — CNN has obtained a classified briefing revealing that the city of Hiroshima was \"barely affected\" after being hit by an atomic bomb. According to anonymous sources, the briefing states that Hiroshima being hit by a nuke only set back the city \"a couple…",
    "link": "https://freerepublic.com/focus/f-chat/4325268/posts",
    "timestamp": "2025-06-25T19:26:51Z"
  },
  {
    "title": "Trump Has Paranoid Response to Damning Leaked Iran Strikes Report",
    "description": "The White House is planning on getting less transparent under Donald Trump’s watch.\r\nThe Trump administration is planning to limit the amount of classified information it shares with Congress, four sources told Axios Wednesday. That will involve posting less …",
    "link": "https://newrepublic.com/post/197263/donald-trump-congress-response-leaked-iran-strikes-report",
    "timestamp": "2025-06-25T19:25:50Z"
  },
  {
    "title": "Pam Bondi Repeatedly Dodges Questions About Trump's Crypto and Potential Foreign Influence",
    "description": "US Attorney General Pam Bondi refused to answer questions regarding whether or not President Donald Trump's decisions were being influenced by foreign actors in possession of the President's crypto currency.",
    "link": "https://www.ibtimes.com/pam-bondi-repeatedly-dodges-questions-about-trumps-crypto-potential-foreign-influence-3776819",
    "timestamp": "2025-06-25T19:25:14Z"
  },
  {
    "title": "Trump Sets CNN's Kaitlan Collins Straight: Israeli Agents on Ground Confirmed Fordow's 'Total Obliteration'",
    "description": "President Donald Trump countered CNN reporting Wednesday that said Iran's Fordow uranium enrichment site had not been destroyed.",
    "link": "https://www.westernjournal.com/trump-sets-cnns-kaitlan-collins-straight-israeli-agents-ground-confirmed-fordows-total-obliteration/",
    "timestamp": "2025-06-25T19:24:10Z"
  },
  {
    "title": "Venezuela's Nicolas Maduro Tries to Insult Nayib Bukele, Calling Him Latin America's 'Netanyahu'",
    "description": "Socialist dictator of Venezuela Nicolás Maduro called President Nayib Bukele a “lowly monster” and compared him to Israeli Prime Minister Benjamin Netanyahu in response to El Salvador detaining 252 Venezuelan illegal migrants suspected of being members of the…",
    "link": "https://www.breitbart.com/latin-america/2025/06/25/venezuelas-nicolas-maduro-tries-to-insult-nayib-bukele-calling-him-latin-americas-netanyahu/",
    "timestamp": "2025-06-25T19:23:57Z"
  },
  {
    "title": "US Treasuries face stablecoin-driven demand surge as supply looms",
    "description": "BOSTON :The potential for stablecoins to fuel demand for short-term U.S. Treasury securities was a hot topic at a money market fund conference in Boston this week, with investors expecting these digital tokens to absorb a huge supply of government debt later …",
    "link": "https://www.channelnewsasia.com/business/us-treasuries-face-stablecoin-driven-demand-surge-supply-looms-5203616",
    "timestamp": "2025-06-25T19:22:26Z"
  },
  {
    "title": "This Billionaire Couple Is Ruining the World—but I Totally Love Their Love",
    "description": "They’re tacky, weird, and exuberant. I couldn’t ask for anything more.",
    "link": "https://slate.com/life/2025/06/jeff-bezos-lauren-sanchez-wedding-wife-venice.html",
    "timestamp": "2025-06-25T19:21:44Z"
  },
  {
    "title": "What Zohran Mamdani’s Defeat of Andrew Cuomo Means for the Democrats",
    "description": "The victory of the New York City mayoral candidate endorsed by Alexandria Ocasio-Cortez and Bernie Sanders offers a lesson to a party battling Donald Trump, Benjamin Wallace-Wells writes.",
    "link": "https://www.newyorker.com/news/the-lede/what-zohran-mamdanis-defeat-of-andrew-cuomo-means-for-the-democrats",
    "timestamp": "2025-06-25T19:20:16Z"
  },
  {
    "title": "Trump Says He Backs NATO’s Mutual Defense Pledge",
    "description": "NATO leaders have backed a plan to boost defense spending to 5% of GDP at their meeting in The Hague, a win for US President Donald Trump. Trump says we’re with NATO “all the way” and NATO leaders renewed their commitment to mutual defense, calming for now do…",
    "link": "https://biztoc.com/x/7421d06b568fc2a1",
    "timestamp": "2025-06-25T19:20:15Z"
  },
  {
    "title": "How Donald Trump Overshadowed NATO's Big Event",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs world leaders, ministers and observers poured into The Hague for NATO's biggest summit of the year, hardly anyone appeared to be watching.\nInstead, all eyes were on whether U.S. President Donald Trump would…",
    "link": "https://biztoc.com/x/83806c13deb3af1a",
    "timestamp": "2025-06-25T19:19:55Z"
  },
  {
    "title": "JD Vance Flips the Bird at Trump Critics During GOP Dinner Party: ‘That Means We’re No. 1, Right?’ | Video",
    "description": "The vice president's vulgar gesture happened the same day President Donald Trump dropped an F-bomb while discussing the Israel-Iran tussle\nThe post JD Vance Flips the Bird at Trump Critics During GOP Dinner Party: ‘That Means We’re No. 1, Right?’ | Video appe…",
    "link": "https://www.thewrap.com/jd-vance-gives-middle-finger-trump-critics/",
    "timestamp": "2025-06-25T19:17:07Z"
  },
  {
    "title": "Hundreds of data brokers might be breaking state laws, say privacy advocates",
    "description": "The Electronic Frontier Foundation (EFF) and a nonprofit privacy rights group have called on several states to investigate why “hundreds” of data brokers haven’t registered with state consumer protection agencies in accordance with local laws. An analysis don…",
    "link": "https://www.theverge.com/news/693109/eff-privacy-advocates-state-investigate-data-brokers",
    "timestamp": "2025-06-25T19:16:48Z"
  },
  {
    "title": "Transportation Secretary Duffy: We're Not Going To Pay To Rebuild Cities The Left Lets Riots Destroy",
    "description": "Transportation Secretary Sean Duffy said the DOT will not pay to rebuild damage from protests that local leaders actively supported or let happen, during an interview on \"The Benny Johnson Show.\" \"Those cities reach out to us and ask for grant money to fix th…",
    "link": "https://freerepublic.com/focus/f-chat/4325265/posts",
    "timestamp": "2025-06-25T19:13:31Z"
  },
  {
    "title": "US lawmaker denies charges stemming from immigration centre visit",
    "description": "Representative LaMonica McIver has been accused of assault as the Trump administration accuses Democrats of obstruction.",
    "link": "https://www.aljazeera.com/news/2025/6/25/us-lawmaker-denies-charges-stemming-from-immigration-centre-visit",
    "timestamp": "2025-06-25T19:11:46Z"
  },
  {
    "title": "Trump Takes Victory Lap on NATO Spending",
    "description": "President Donald Trump has secured a commitment to increase defense spending from European allies at this week’s NATO summit, held at The Hague in the... Read More\nThe post Trump Takes Victory Lap on NATO Spending appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/25/trump-takes-victory-lap-nato-spending/",
    "timestamp": "2025-06-25T19:10:51Z"
  },
  {
    "title": "Zohran Mamdani: The Muslim former rapper who knows what it means to live on the margins – The new face of the left in Trump’s US is running for mayor of New York",
    "description": "Who is the 34-year-old politician, of Indian and Ugandan descent, who managed to outdo Andrew Cuomo for the Democratic mayoral nomination\nThe post Zohran Mamdani: The Muslim former rapper who knows what it means to live on the margins – The new face of the le…",
    "link": "https://en.protothema.gr/2025/06/25/zohran-mamdani-the-muslim-former-rapper-who-knows-what-it-means-to-live-on-the-margins-the-new-face-of-the-left-in-trumps-us-is-running-for-mayor-of-new-york/",
    "timestamp": "2025-06-25T19:10:47Z"
  },
  {
    "title": "Lauren Sánchez Touches Down in Venice for Star-studded Wedding With Jeff Bezos Wearing Vintage Alexander McQueen",
    "description": "Lauren Sánchez and her fiancé, Amazon founder Jeff Bezos, have arrived in Venice, Italy, on Wednesday, ahead of their three-day wedding event.",
    "link": "http://wwd.com/pop-culture/celebrity-news/lauren-sanchez-mcqueen-dress-wedding-venice-1237948964/",
    "timestamp": "2025-06-25T19:10:35Z"
  },
  {
    "title": "Zohran Mamdani claimed victory over Cuomo. His next obstacle: Eric Adams, the Republicans and more",
    "description": "Zohran Mamdani has claimed victory over a wounded, but still perhaps formidable Andrew Cuomo in New York City’s Democratic mayoral primary",
    "link": "https://abcnews.go.com/Politics/wireStory/zohran-mamdani-claimed-victory-cuomo-obstacle-eric-adams-123205332",
    "timestamp": "2025-06-25T19:10:28Z"
  },
  {
    "title": "How Donald Trump Overshadowed NATO's Big Event",
    "description": "NATO allies on Wednesday rubber-stamped a commitment to spend 5 percent of GPD on defense and related investment by 2035.",
    "link": "https://www.newsweek.com/donald-trump-nato-summit-hague-europe-defense-spending-2089773",
    "timestamp": "2025-06-25T19:09:01Z"
  },
  {
    "title": "Spain on Trump tariff threat: EU has defense tools",
    "description": "Spanish Economy Minister Carlos Cuerpo said on Wednesday that \"Europe has the necessary tools to defend itself\" if no deal is reached with the United States, after US President Donald Trump criticized...",
    "link": "https://biztoc.com/x/d540e3898cd7c560",
    "timestamp": "2025-06-25T19:08:51Z"
  },
  {
    "title": "ICE’s Military-Style Raid Of A Los Angeles Flea Market Netted Only Two Arrests",
    "description": "There are a few thousand military troops in Los Angeles now, thanks to Trump’s Martial Plan. Local law enforcement officials pointed out they had the situation under control, what with most of the violence (what there was of it that isn’t police violence) lim…",
    "link": "https://www.techdirt.com/2025/06/25/ices-military-style-raid-of-a-los-angeles-flea-market-netted-only-two-arrests/",
    "timestamp": "2025-06-25T19:08:00Z"
  },
  {
    "title": "World leaders flock to meet with Trump at NATO Summit",
    "description": "President Donald Trump attended the NATO Summit, where he celebrated the alliance's commitment to increase defense spending while meeting global leaders.",
    "link": "https://www.foxnews.com/politics/world-leaders-flock-meet-trump-nato-summit",
    "timestamp": "2025-06-25T19:04:41Z"
  },
  {
    "title": "Jeff Bezos arrives in Venice for wedding amid protests over inequality",
    "description": "Amazon tycoon set to marry Lauren Sanchez in lavish Venice wedding as activists protest 'growing disparity'.",
    "link": "https://www.aljazeera.com/news/2025/6/25/jeff-bezos-arrives-in-venice-for-wedding-amid-protests-over-inequality",
    "timestamp": "2025-06-25T19:04:30Z"
  },
  {
    "title": "Tariffs Are Keeping Interest Rates High",
    "description": "The Federal Reserve is unwilling to lower interest rates because \"there will be some inflation from tariffs coming,\" Jerome Powell told a Senate committee.",
    "link": "https://reason.com/2025/06/25/tariffs-are-keeping-interest-rates-high/",
    "timestamp": "2025-06-25T19:04:22Z"
  },
  {
    "title": "Seven Israeli soldiers killed in Hamas attack in Gaza",
    "description": "Hamas militants plant bomb on Israeli military vehicle in Khan Younis, causing it to catch fire",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/25/seven-israeli-soldiers-killed-in-hamas-attack-in-gaza/",
    "timestamp": "2025-06-25T19:01:31Z"
  },
  {
    "title": "Trump Reportedly Cuts Funding for Publisher of Prestigious Nature Journals and Scientific American Magazine",
    "description": "Scientific journals are just too woke.",
    "link": "https://gizmodo.com/trump-reportedly-cuts-funding-for-publisher-of-prestigious-nature-journals-and-scientific-american-magazine-2000620234",
    "timestamp": "2025-06-25T19:00:45Z"
  },
  {
    "title": "[Eugene Volokh] \"The Crisis of the Media Environment\"",
    "description": "My essay on the subject, initially presented in late March at a conference at Yale Law School, is now up...",
    "link": "https://reason.com/volokh/2025/06/25/the-crisis-of-the-media-environment/",
    "timestamp": "2025-06-25T19:00:44Z"
  },
  {
    "title": "One of Trump’s Most Deranged Backers Lost His Defamation Trial. He’s Declaring Victory.",
    "description": "Mike Lindell, most famous as “the MyPillow Guy” who made a small fortune marketing his sleep wares to millions of Americans, can’t stop selling.",
    "link": "https://slate.com/news-and-politics/2025/06/mypillow-guy-mike-lindell-loses-defamation-trial.html",
    "timestamp": "2025-06-25T19:00:08Z"
  },
  {
    "title": "The Irish Times view on the EU summit: leaders must focus on blockages to growth",
    "description": "Europe has lagged on growth and innovation and needs to act",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/06/25/the-irish-times-view-on-the-eu-summit-leaders-must-focus-on-blockages-to-growth/",
    "timestamp": "2025-06-25T19:00:00Z"
  },
  {
    "title": "Trump says he has '3 or 4' picks in mind to replace Fed's Powell (Katy O'Donnell/Politico)",
    "description": "Katy O'Donnell / Politico:\nTrump says he has ‘3 or 4’ picks in mind to replace Fed's Powell  —  Trump did not elaborate on potential nominees to replace the central bank chief, whose term as chair ends in May 2026.  —  President Donald Trump on Wednesday said…",
    "link": "https://www.memeorandum.com/250625/p95",
    "timestamp": "2025-06-25T19:00:00Z"
  },
  {
    "title": "Israel-Iran Conflict Was a Boon for Coal",
    "description": "In a world scrambling to wean itself off coal, the black rock might just be staging a comeback—thanks to a war halfway across the globe. Oil and gas prices pulled back sharply on Tuesday after U.S. President Donald Trump called for a ceasefire between Iran an…",
    "link": "https://oilprice.com/Energy/Coal/Israel-Iran-Conflict-Was-a-Boon-for-Coal.html",
    "timestamp": "2025-06-25T19:00:00Z"
  },
  {
    "title": "Stockholm Syndrome in The Hague",
    "description": "NATO professes its love for Trump while held hostage by his demands.",
    "link": "http://foreignpolicy.com/2025/06/25/nato-summit-the-hague-europe-us-trump/",
    "timestamp": "2025-06-25T18:59:52Z"
  },
  {
    "title": "Trump demands CNN reporter be fired and thrown out 'like a dog': 'She lied!'",
    "description": "President Donald Trump continued his tirade against CNN by calling on the network to fire reporter Natasha Bertrand \"like a dog.\"After Bertrand contributed to CNN reporting on a Pentagon analysis that found Iran's nuclear sites were not \"obliterated\" by Trump…",
    "link": "https://www.rawstory.com/donald-trump-natasha-bertrand/",
    "timestamp": "2025-06-25T18:59:05Z"
  },
  {
    "title": "Trump disputes Pentagon view, says Iran atomic sites 'destroyed'",
    "description": "\"The nuclear sites in Iran are completely destroyed,\" Trump said on Truth Social. He said CNN and the New York Times, which first reported the intelligence findings on Tuesday, \"have teamed up in an attempt to demean one of the most successful military strike…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-disputes-pentagon-view-says-iran-atomic-sites-destroyed/articleshow/122076797.cms",
    "timestamp": "2025-06-25T18:58:58Z"
  },
  {
    "title": "Trump’s budget bill and DOGE’s IRS staffing cuts could lead to a nightmare 2026 tax season, watchdog warns",
    "description": "The budget bill championed by President Donald Trump could complicate next year’s tax filing season after the IRS lost one-quarter of its employees through staffing cuts, an independent watchdog reported Wednesday.\nThe IRS workforce has fallen from 102,113 wo…",
    "link": "https://biztoc.com/x/7eb1a564a459e5cb",
    "timestamp": "2025-06-25T18:58:03Z"
  },
  {
    "title": "Spain slams Trump tariff threat, says EU has defense tools",
    "description": "Spanish Economy Minister Carlos Cuerpo said on Wednesday that \"Europe has the necessary tools to defend itself\" if no deal is reached with the United States, after US President Donald Trump criticized...",
    "link": "https://biztoc.com/x/705d2c5630ec9fbe",
    "timestamp": "2025-06-25T18:57:52Z"
  },
  {
    "title": "Colorado among states to score win in fracas over funds for electric vehicle charging",
    "description": "A federal judge in Washington State granted a preliminary injunction to Colorado and other states in a lawsuit over billions of dollars in federal money for electric vehicle charging networks.",
    "link": "https://www.denverpost.com/2025/06/25/colorado-electric-vehicle-charging-funds-lawsuit/",
    "timestamp": "2025-06-25T18:56:44Z"
  },
  {
    "title": "Watch Live: Senate Debates Trump's Proposed Billions in Cuts to USAID",
    "description": "The Senate Appropriations Committee holds a hearing to debate President Donald Trump's proposed billions of dollars of cuts to USAID and other sectors of government on Wednesday, June 25.\nThe post Watch Live: Senate Debates Trump’s Proposed Billions in Cuts t…",
    "link": "https://www.breitbart.com/politics/2025/06/25/watch-live-senate-debates-trumps-proposed-billions-in-cuts-to-usaid/",
    "timestamp": "2025-06-25T18:56:23Z"
  },
  {
    "title": "EXCLUSIVE: Trump FTC Secures Landmark Agreement to End Political Collusion in Advertising Industry",
    "description": "President Donald Trump’s top consumer protection and antitrust official has approved a massive $13.5 billion merger that will reshape the advertising industry, effectively putting the final nail in the coffin of coordination against outlets based on their pol…",
    "link": "https://freerepublic.com/focus/f-news/4325262/posts",
    "timestamp": "2025-06-25T18:55:59Z"
  },
  {
    "title": "Trump considers more Patriots for Ukraine, says Putin \"has to end\" the war",
    "description": "THE HAGUE: US President Donald Trump indicated on Wednesday (Jun 25) he will consider providing more of the Patriot missiles that Ukraine needs to defend against mounting Russian strikes, adding that Russian President Vladimir Putin \"really has to end that wa…",
    "link": "https://www.channelnewsasia.com/world/trump-considers-more-patriots-ukraine-says-putin-has-end-war-5203576",
    "timestamp": "2025-06-25T18:54:50Z"
  },
  {
    "title": "Iran was 'running to the bomb'. Some say it's now in a nuclear sprint",
    "description": "Despite a ceasefire being declared between Israel, the United States and Iran, we're now \"moving into a true danger zone\", some analysts say, because the Islamic Republic is now trying to develop a nuclear weapon faster than ever.",
    "link": "https://www.abc.net.au/news/2025-06-26/iran-running-to-nuclear-bomb-after-ceasefire-analysts-say/105461634",
    "timestamp": "2025-06-25T18:54:49Z"
  },
  {
    "title": "Counterterrorism experts warn Iran could retaliate in the US",
    "description": "With the Fourth of July holiday just days away, law enforcement and federal officials are on guard for retaliation from Iran.",
    "link": "https://abcnews.go.com/US/july-4-days-us-law-enforcement-high-alert/story?id=123112476",
    "timestamp": "2025-06-25T18:54:21Z"
  },
  {
    "title": "Was Trump's strike on Iran good for the Jews?",
    "description": "U.S. President Donald Trump's message when joining Israel's attack on Iran was one many have longed to hear since October 7. But do his actions actually make Jews any safer in America?",
    "link": "https://www.haaretz.com/opinion/2025-06-25/ty-article-opinion/.premium/was-trumps-strike-on-iran-good-for-the-jews/00000197-a851-dd94-addf-ab51fd900000",
    "timestamp": "2025-06-25T18:51:35Z"
  },
  {
    "title": "U.S. Education Department finds California in violation of law for allowing boys in girls sports",
    "description": "'The Trump administration will relentlessly enforce Title IX protections for women and girls, and our findings today make clear that California has failed to adhere to its obligations under federal law. The state must swiftly come into compliance with Title I…",
    "link": "https://www.wnd.com/2025/06/u-s-education-department-finds-california-violation-law/",
    "timestamp": "2025-06-25T18:49:46Z"
  },
  {
    "title": "Russia Plans to Teach China How to Beat US and NATO Weapons: Ukraine Intel",
    "description": "Analysts say Beijing is eager to learn from Moscow's combat experience, even as its military capabilities eclipse its Russian ally's",
    "link": "https://www.newsweek.com/russia-train-china-troops-beat-us-nato-western-weapons-systems-2090569",
    "timestamp": "2025-06-25T18:49:03Z"
  },
  {
    "title": "Bernie Moreno wants Senate to call for Nobel Peace Prize to go to Trump",
    "description": "Sen. Bernie Moreno is introducing a resolution that would declare that the U.S. Senate calls for President Donald Trump to be awarded the Nobel Peace Prize",
    "link": "https://www.foxnews.com/politics/bernie-moreno-wants-senate-call-nobel-peace-prize-go-trump",
    "timestamp": "2025-06-25T18:48:40Z"
  },
  {
    "title": "Venice protesters say Bezos’ star-studded wedding highlights growing inequality",
    "description": "Multi-billionaire Amazon founder Jeff Bezos and Lauren Sanchez have arrived in Venice ahead of their star-studded weekend wedding.",
    "link": "https://www.pbs.org/newshour/world/venice-protesters-say-bezos-star-studded-wedding-highlights-growing-inequality",
    "timestamp": "2025-06-25T18:48:26Z"
  },
  {
    "title": "‘FIRE NATASHA!’ Trump Launches Scathing Attack on CNN Reporter, Demands She Be ‘Thrown Out Like a Dog’",
    "description": "President Donald Trump demanded that CNN fire Natasha Bertrand in a fiery Truth Social post demanding that she be \"thrown out 'like a dog'\" on Wednesday.\nThe post ‘FIRE NATASHA!’ Trump Launches Scathing Attack on CNN Reporter, Demands She Be ‘Thrown Out Like …",
    "link": "https://www.mediaite.com/media/news/fire-natasha-trump-launches-scathing-attack-on-cnn-reporter-demands-she-be-thrown-out-like-a-dog/",
    "timestamp": "2025-06-25T18:47:49Z"
  },
  {
    "title": "What Zohran Mamdani's rise in New York City means for the Democratic Party nationally",
    "description": "Zohran Mamdani’s dramatic, strong showing in New York City’s Democratic mayoral primary, where he forced a concession from former Gov. Andrew Cuomo, amounts to a massive shot in the arm for progressives and other Democrats who have been imploring their party’…",
    "link": "https://www.nbcnews.com/politics/elections/zohran-mamdanis-rise-new-york-city-means-democratic-party-nationally-rcna214909",
    "timestamp": "2025-06-25T18:47:41Z"
  },
  {
    "title": "Trump’s budget bill and DOGE’s IRS staffing cuts could lead to a nightmare 2026 tax season, watchdog warns",
    "description": "The IRS lost one-quarter of its employees through staffing cuts, an independent watchdog reported Wednesday.",
    "link": "https://fortune.com/2025/06/25/trump-budget-bill-irs-staffing-cuts-doge-tax-season-2026/",
    "timestamp": "2025-06-25T18:47:28Z"
  },
  {
    "title": "Spain: Europe has tools to defend if no US trade deal",
    "description": "Spanish Economy Minister Carlos Cuerpo said on Wednesday that \"Europe has the necessary tools to defend itself\" if no deal is reached with the United States, after US President Donald Trump slammed th...",
    "link": "https://biztoc.com/x/f3c2f50c6f3eb96e",
    "timestamp": "2025-06-25T18:46:34Z"
  },
  {
    "title": "Not just stealth bombers: Trump says F-35 and F-22 stealth fighters were part of the Operation Midnight Hammer strikes on Iran",
    "description": "President Donald Trump said F-35s were among the aircraft involved in the operation to bomb Iran's nuclear facilities.\nUS Air Force photo by Senior Airman Keifer Bowes\nUS military F-35s and F-22s participated in the strikes against Iran, Trump said Wednesday.…",
    "link": "https://biztoc.com/x/52f9a87a7924461b",
    "timestamp": "2025-06-25T18:46:29Z"
  },
  {
    "title": "US Senator Adam Schiff Introduces Legislation To Stop President Trump’s ‘Exploitation’ of Digital Assets",
    "description": "US Senator Adam Schiff has introduced a new bill that aims to prevent President Donald Trump and his family members from enriching themselves via crypto. The potential legislation, titled the Curbing Officials’ Income and Nondisclosure (COIN) Act, would prohi…",
    "link": "https://dailyhodl.com/2025/06/25/us-senator-adam-schiff-introduces-legislation-to-stop-president-trumps-exploitation-of-digital-assets/",
    "timestamp": "2025-06-25T18:45:47Z"
  },
  {
    "title": "Benign inflation should shield India from global headwinds: Report",
    "description": "RBI economists caution that upcoming tariff deadlines and geopolitical tensions could negatively impact the global economy. However, India's domestic growth, supported by low inflation, is expected to provide a buffer against these global headwinds. The centr…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/benign-inflation-should-shield-india-from-global-headwinds-report/articleshow/122076607.cms",
    "timestamp": "2025-06-25T18:45:07Z"
  },
  {
    "title": "Benign inflation should shield India from global headwinds: Report",
    "description": "RBI economists caution that upcoming tariff deadlines and geopolitical tensions could negatively impact the global economy. However, India's domestic growth, supported by low inflation, is expected to provide a buffer against these global headwinds. The centr…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/benign-inflation-should-shield-india-from-global-headwinds-report/articleshow/122080051.cms",
    "timestamp": "2025-06-25T18:45:07Z"
  },
  {
    "title": "Records reveal how Democrat AGs collaborated anti-Trump legal strategy before inauguration",
    "description": "'Letitia James of New York, Rob Bonta of California, Keith Ellison of Minnesota, Brian Schwalb of the District of Columbia, and others ... planned other hypothetical lawsuits regarding immigration, environmental regulations, health care, and gun control'",
    "link": "https://www.wnd.com/2025/06/records-reveal-how-democrat-ags-collaborated-anti-trump/",
    "timestamp": "2025-06-25T18:44:05Z"
  }
]