[
  {
    "title": "Trump Says No Pardon for Diddy",
    "description": "Sean “Diddy” Combs will not be getting an early exit from prison anytime soon if President Donald Trump has anything to do with it. Trump told The New York Times that Diddy reached out in writing to seek presidential clemency but said he has no plans to grant…",
    "link": "https://mediatakeout.com/trump-says-no-pardon-for-diddy/",
    "timestamp": "2026-01-09T11:26:00Z"
  },
  {
    "title": "Russia fires Oreshnik hypersonic missile, with attacks on Ukraine killing at least 4",
    "description": "Russia bombarded Ukraine with hundreds of drones and dozens of missiles in a large-scale overnight attack, officials said Friday, killing at least four people. For only the second time, it used a new ballistic missile that it says flies at 10 times the speed …",
    "link": "https://www.cbc.ca/news/world/ukraine-war-russia-missile-9.7039207",
    "timestamp": "2026-01-09T11:25:53Z"
  },
  {
    "title": "U.N. Demands U.S. Fulfill ‘Legal Obligation’ to Fund Globalist Agencies After Trump Withdrawal",
    "description": "Do as you are told, obey your \"legal obligation\" and keep sending U.S. taxpayer dollars. That was the message delivered Thursday to the Trump administration from U.N. headquarters in Manhattan, New York City, in the hours after the White House announced it is…",
    "link": "https://www.breitbart.com/politics/2026/01/09/u-n-demands-u-s-fulfill-legal-obligation-to-fund-globalist-agencies-after-trump-withdrawal/",
    "timestamp": "2026-01-09T11:25:32Z"
  },
  {
    "title": "Before fatal ICE shooting, Minnesota had become Trump target",
    "description": "Jan 9 (Reuters) - Months before a U.S. immigration agent fatally shot a ‌motorist in Minnesota on Wednesday, President Donald Trump had fixated on the state, repeatedly criticizing its Democratic leaders and the large Somali-American community there. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2026/01/09/before-fatal-ice-shooting-minnesota-had-become-trump-target",
    "timestamp": "2026-01-09T11:25:00Z"
  },
  {
    "title": "Trump's Venezuela focus frustrates top aides worried about midterm elections",
    "description": "WASHINGTON, Jan 9 (Reuters) - President Donald Trump's focus on the brazen U.S. capture of ‌Venezuelan leader Nicolas Maduro is frustrating some White House aides and Republican lawmakers, who want him to address economic and healthcare concerns in an electio…",
    "link": "https://www.thestar.com.my/news/world/2026/01/09/trump039s-venezuela-focus-frustrates-top-aides-worried-about-midterm-elections",
    "timestamp": "2026-01-09T11:25:00Z"
  },
  {
    "title": "Affordable energy for 1.4 billion guides India’s oil sourcing: MEA",
    "description": "Reiterating India’s long-standing position, the MEA said energy sourcing decisions are shaped by global market dynamics and energy security requirements.",
    "link": "https://www.thehindubusinessline.com/economy/policy/affordable-energy-for-14-billion-guides-indias-oil-sourcing-mea/article70490500.ece",
    "timestamp": "2026-01-09T11:23:10Z"
  },
  {
    "title": "Bad start to 2026 as Rs 9 lakh crore lost in 5 days. What should stock market investors do?",
    "description": "Indian equities suffered a brutal start to the year as global trade fears, Trump tariff threats and heavy foreign selling dragged Sensex down over 2,000 points, erasing Rs 9 lakh crore and pushing markets into a risk-off, high-volatility phase nationwide.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/bad-start-to-2026-as-rs-9-lakh-crore-lost-in-5-days-what-should-stock-market-investors-do/articleshow/126434430.cms",
    "timestamp": "2026-01-09T11:23:01Z"
  },
  {
    "title": "Kimmel Delivers Bleak Monologue As Trump World Tries To Rewrite A Tragedy",
    "description": "\"There used to be a baseline of decency,\" the late-night host lamented.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-donald-trump-spin-narrative_n_6960e05fe4b08f6102b38a48",
    "timestamp": "2026-01-09T11:19:54Z"
  },
  {
    "title": "LGBTQ+ charities facing ‘incredibly tough environment’ in UK amid Trump’s DEI attacks",
    "description": "LGBTQ+ charities in the UK are facing an increasingly difficult environment to operate in following the ripple effects of the Trump administration’s attacks on diversity, equality and inclusion (DEI) and freeze on foreign aid, increased running costs and decr…",
    "link": "https://www.thepinknews.com/2026/01/09/lgbtq-charity-dei-trump/",
    "timestamp": "2026-01-09T11:18:01Z"
  },
  {
    "title": "Trump Scraps Planned Second Wave of Venezuela Strikes After Prisoner Release",
    "description": "Trump praised the move as one of “cooperation” and touted $100 billion in investment from “BIG OIL” was in the offing to rebuild Venezuela's energy sector.\nThe post Trump Scraps Planned Second Wave of Venezuela Strikes After Prisoner Release first appeared on…",
    "link": "https://www.mediaite.com/media/news/trump-scraps-planned-second-wave-of-venezuela-strikes-after-prisoner-release/",
    "timestamp": "2026-01-09T11:16:38Z"
  },
  {
    "title": "Iran In Digital Darkness As Deadly Protests Surge; Trump Warns Tehran Over Crackdown",
    "description": "Iran's state media echoed the hard-line line, blaming \"terrorist agents\" from the US and Israel for inciting violence and fires, while reporting casualties without giving independent details.",
    "link": "https://www.ibtimes.com/iran-digital-darkness-deadly-protests-surge-trump-warns-tehran-over-crackdown-3794825",
    "timestamp": "2026-01-09T11:16:37Z"
  },
  {
    "title": "Wake up, Canada. The Trump Doctrine is aimed at us",
    "description": "Do not take our country’s existence for granted. We are in the sights. Believe it",
    "link": "https://www.theglobeandmail.com/business/commentary/article-wake-up-canada-the-trump-doctrine-is-aimed-at-us/",
    "timestamp": "2026-01-09T11:15:42Z"
  },
  {
    "title": "‘PM Modi and Trump have spoken eight times in 2025’: India rejects Lutnick’s claim that stalled trade talks were due to lack of outreach",
    "description": "India has firmly countered the statements made by US Commerce Secretary Howard Lutnick regarding stalled trade discussions. Officials affirmed that Prime Minister Modi and President Trump are in regular communication, with the Ministry of External Affairs und…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/pm-modi-donald-trump-spoken-eight-times-2025-india-pushes-back-howard-lutnick-us-trade-talks/articleshow/126433930.cms",
    "timestamp": "2026-01-09T11:10:39Z"
  },
  {
    "title": "Cliff Taylor: Mercosur vote is a classic Irish triumph of hyperbole over common sense",
    "description": "A masterclass by the farming lobby captured both the Government and the Opposition",
    "link": "https://www.irishtimes.com/opinion/2026/01/09/mercosur-vote-a-classic-irish-triumph-of-hyperbole-over-common-sense/",
    "timestamp": "2026-01-09T11:10:00Z"
  },
  {
    "title": "The United States' Claims Against Venezuela",
    "description": "According to Politico, Washington asked [Venezuela's interim leader] Delcy Rodriguez • to crack down on drug flows; • to kick out Iranian, Cuban and other intelligence officials or networks hostile to Washington; • to stop the sale of oil to the United States…",
    "link": "https://www.voltairenet.org/article223476.html",
    "timestamp": "2026-01-09T11:08:42Z"
  },
  {
    "title": "A New DC Comics Trans Supervillain in The Daily LITG 9th January 2026",
    "description": "Lying In The Gutters was the most-read article on Bleeding Cool yesterday. How very meta of it. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded seventeen years ago and steeped…",
    "link": "https://bleedingcool.com/comics/a-new-dc-comics-trans-supervillain-in-the-daily-litg-9th-january-2026/",
    "timestamp": "2026-01-09T11:07:04Z"
  },
  {
    "title": "Germany: Trust in the United States is eroding",
    "description": "In the monthly ARD Deutschlandtrend poll, German voters polled express little confidence that 2026 will be a peaceful and prosperous year. The reputation of the US is at an all-time low.nato",
    "link": "https://www.dw.com/en/germany-trust-in-the-united-states-is-eroding/a-75449308",
    "timestamp": "2026-01-09T11:02:00Z"
  },
  {
    "title": "Indonesia says Trump's Venezuela oil deal has no global energy impact",
    "description": "Indonesia&#39;s Coordinating Minister for Economic Affairs Airlangga Hartarto said US President Donald Trump&rsquo;s claim that the United States would ...",
    "link": "https://en.antaranews.com/news/399165/indonesia-says-trumps-venezuela-oil-deal-has-no-global-energy-impact",
    "timestamp": "2026-01-09T11:01:47Z"
  },
  {
    "title": "Khamanei slams ‘vandals’ as Iran rocked by protests",
    "description": "Iranians staged their biggest protests yet of an almost two-week movement sparked by anger over the rising cost of living, chanting slogans including \"death to the dictator\" and setting fire to official buildings, videos showed on Jan. 9.",
    "link": "https://www.hurriyetdailynews.com/khamanei-slams-vandals-as-iran-rocked-by-protests-217673",
    "timestamp": "2026-01-09T11:01:37Z"
  },
  {
    "title": "Fox News Digital's News Quiz: January 9, 2026",
    "description": "William DeFoor accused of vandalizing Vice President JD Vance's home demanded a specific name, as U.S. forces captured Venezuelan President Nicolás Maduro and his wife.",
    "link": "https://www.foxnews.com/lifestyle/fox-news-digital-news-quiz-january-9-2026",
    "timestamp": "2026-01-09T11:00:56Z"
  },
  {
    "title": "Women and children are being digitally undressed on social media",
    "description": "X users are asking the platform's AI chatbot, Grok, to create sexualized images.",
    "link": "https://www.salon.com/2026/01/09/women-and-children-are-being-digitally-undressed-on-social-media_partner/",
    "timestamp": "2026-01-09T11:00:48Z"
  },
  {
    "title": "France delays G7 to avoid clash with White House cage fighting on Trump’s birthday",
    "description": "French President Emmanuel Macron's office said the new schedule is “the result of our consultations with G7 partners.”",
    "link": "https://www.politico.eu/article/france-delay-g7-white-house-donald-trump-birthday/",
    "timestamp": "2026-01-09T11:00:48Z"
  },
  {
    "title": "Why analysts say Q1 2026 crypto rally is back on the table!",
    "description": "The U.S . liquidity outlook also appeared positive for BTC and risk assets.",
    "link": "https://ambcrypto.com/why-analysts-say-q1-2026-crypto-rally-is-back-on-the-table/",
    "timestamp": "2026-01-09T11:00:29Z"
  },
  {
    "title": "Jack Mintz: No need to panic yet. Alberta will sell its oil for now",
    "description": "Venezuela's reserves are exaggerated and infrastructure degraded. It will make inroads in the U.S. market but probably not quickly. Read on",
    "link": "https://financialpost.com/opinion/jack-mintz-no-need-to-panic-yet-alberta-will-sell-its-oil-for-now",
    "timestamp": "2026-01-09T11:00:24Z"
  },
  {
    "title": "Minnesota Senator ‘Disgusted’ By Kristi Noem Trying To ‘Gaslight’ People About ICE Shooting",
    "description": "In an interview, Tina Smith also ripped top Trump officials for trying to turn a Minneapolis woman’s killing into a political fight: “Where is the humanity here?”",
    "link": "https://www.huffpost.com/entry/tina-smith-minnesota-ice-shooting_n_69605582e4b0120ab25cc37a",
    "timestamp": "2026-01-09T11:00:17Z"
  },
  {
    "title": "What Good Are Prediction Markets If Nobody Can Agree on What Really Happened?",
    "description": "Prediction markets like Polymarket depend on outside sources to confirm results, but bettors don’t always agree on what happened in complicated situations like the U.S. raid to capture Venezuelan president Maduro.",
    "link": "http://nymag.com/intelligencer/article/when-polymarket-cant-agree-on-reality.html",
    "timestamp": "2026-01-09T11:00:06Z"
  },
  {
    "title": "‘I don’t need international law’: Trump lays out a vision of power restrained only by ‘my own morality’",
    "description": "US president makes clear in interview he will be the arbiter of any limits to his authority",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/08/us/politics/trump-interview-power-morality.html",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "The End Goal of Trump’s Cringey, Nonsensical Videos",
    "description": "On Saturday at Mar-a-Lago, as he was supposed to be speaking to the White House press corps about the overnight military raid in Venezuela, Donald Trump was busy doing what he loves most: posting on social media. While the reporters waited for him, he publish…",
    "link": "https://newrepublic.com/article/204981/trump-venezuela-video-cringey-nonsensical",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Bytes: Week in Review – New year, new state AI laws, new showdown with Trump admin.",
    "description": "X, formerly Twitter, is facing a global backlash because users are directing the platform's AI chatbot, Grok, to generate non-consensual intimate imagery. Users have been popping up in the replies of women — and sometimes minors — tagging Grok and asking it t…",
    "link": "https://www.marketplace.org/episode/2026/01/09/antigrok-backlash-on-x-trumps-ai-regulation-ban-and-meta-pauses-global-smart-glasses-rollout",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "2025: The Year the Government Stopped Pretending It Cared About Freedom",
    "description": "Some years chip away at freedom. Others tear the mask off. 2025 was the year the government stopped pretending it was constrained by the Constitution—when executive power expanded openly and unapologetically, surveillance became ambient, dissent became danger…",
    "link": "https://www.activistpost.com/2025-the-year-the-government-stopped-pretending-it-cared-about-freedom/",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Federal Agents Are Violating the Rights of Americans",
    "description": "ICE and the National Guard are acting with impunity.",
    "link": "https://www.theatlantic.com/podcasts/2026/01/autocracy-in-america-ice-and-the-national-guard/685279/",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Trump’s Foreign Policy Madness Will Haunt Us for Generations",
    "description": "I think often these days about how past American leaders thought the Civil War was divine punishment for the nation’s sins. In his second inaugural address in 1864, Abraham Lincoln framed the struggle against slavery in biblical terms—not to suggest that he w…",
    "link": "https://newrepublic.com/article/205076/trump-doctrine-disaster-venezuela-lincoln",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Unpacking claim Kamala Harris said Venezuela 'is a country, but we don't live there, so it's not our country'",
    "description": "The former vice president supposedly added, \"And when we go there, we are in another country.\"",
    "link": "https://www.snopes.com//news/2026/01/09/kamala-harris-venezuela-quote/",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Greg Grandin on Trump’s “Universal Police Warrant”",
    "description": "From Venezuela to Greenland, the Trump administration is redefining and invoking the Monroe Doctrine to seize whatever it wants, whenever it wants.\nThe post Greg Grandin on Trump’s “Universal Police Warrant”  appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/09/trump-venezuela-maduro-greg-grandin/",
    "timestamp": "2026-01-09T11:00:00Z"
  },
  {
    "title": "Rolls-Royce has hit a record high every trading day of 2026. Here's why",
    "description": "While Rolls-Royce stock has been swept up in the defense rally, the London-listed company has much more going for it.",
    "link": "https://www.cnbc.com/2026/01/09/rolls-royce-record-high-defense-stocks-2026-why.html",
    "timestamp": "2026-01-09T10:57:49Z"
  },
  {
    "title": "Yankee Go Home, Again",
    "description": "With his attack on Venezuela, US President Donald Trump channeled the US leaders who sought to “liberate” Spain’s former colonies in 1898. But just as the Spanish-American War produced few real gains in the 20th century, Trump's efforts to revive the Monroe D…",
    "link": "https://www.project-syndicate.org/onpoint/venezuela-attack-augurs-a-new-era-of-us-intervention-in-latin-america-by-jorge-g-castaneda-2026-01",
    "timestamp": "2026-01-09T10:55:31Z"
  },
  {
    "title": "CEOs reveal how they train their bodies and minds for the ‘marathon’ job, from playing chess to ‘energy management’",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2026/01/09/ceos-train-bodies-minds-chess-skiing-energy-management/",
    "timestamp": "2026-01-09T10:53:27Z"
  },
  {
    "title": "Defiant Khamenei insists ‘won’t back down’ in face of Iran protests",
    "description": "Iran’s supreme leader Ayatollah Ali Khamenei on Friday insisted that the Islamic republic would “not back down” in the face of protests after the biggest rallies yet in an almost two week movement sparked by anger over the rising cost of living. Chanting slog…",
    "link": "https://www.digitaljournal.com/world/defiant-khamenei-insists-wont-back-down-in-face-of-iran-protests/article",
    "timestamp": "2026-01-09T10:52:20Z"
  },
  {
    "title": "Oil CEOs are meeting with Trump today. These are their demands | CNN Business",
    "description": "President Donald Trump is set to meet with Big Oil executives Friday as part of a weeklong charm offensive to persuade America’s largest energy companies to return to Venezuela.",
    "link": "https://www.cnn.com/2026/01/09/business/oil-executives-trump-meeting-venezuela",
    "timestamp": "2026-01-09T10:48:26Z"
  },
  {
    "title": "Trump Torched Over ‘Unspeakably Pathetic’ Second-Hand Nobel Prize Admission",
    "description": "The president's remarks about accepting María Corina Machado’s Nobel Peace Prize sparked serious second-hand embarrassment.",
    "link": "https://www.huffpost.com/entry/donald-trump-nobel-peace-prize_n_6960d153e4b088e2524e4564",
    "timestamp": "2026-01-09T10:47:46Z"
  },
  {
    "title": "Two Russian citizens aboard captured oil tanker released by US, Russia claims",
    "description": "American special forces boarded the Marinera ship - originally known as the Bella 1 - between Iceland and Scotland as it headed towards Russia.",
    "link": "https://news.sky.com/story/two-russian-citizens-aboard-captured-oil-tanker-released-by-us-russia-claims-13492373",
    "timestamp": "2026-01-09T10:47:00Z"
  },
  {
    "title": "Anyone With a Kid in Day Care Knows How Inconvenient Illnesses Are. Well, It’s About to Get Worse.",
    "description": "RFK Jr.’s reduction of the vaccine schedule is terrible for parents and kids.",
    "link": "https://slate.com/technology/2026/01/rfk-jr-day-care-illness-working-parents-vaccines.html",
    "timestamp": "2026-01-09T10:45:00Z"
  },
  {
    "title": "Watch: 'I'm afraid' - Greenlanders react to Trump threats",
    "description": "Greenlanders have spoken about being afraid and annoyed by US President Donald Trump's renewed efforts to acquire the territory from Denmark.",
    "link": "https://www.rte.ie/news/world/2026/0109/1552271-trump-greenland/",
    "timestamp": "2026-01-09T10:43:45Z"
  },
  {
    "title": "Trump Cancels Second Attack on Venezuela, Cites Cooperation",
    "description": "US President Donald Trump said a second wave of attacks on Venezuela has been canceled, citing improved cooperation from the country.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-cancels-second-attack-on-venezuela-cites-cooperation",
    "timestamp": "2026-01-09T10:43:26Z"
  },
  {
    "title": "Rio Tinto Said to Be Open to Owning Coal If It Buys Glencore",
    "description": "Rio Tinto Group is open to retaining Glencore Plc’s massive coal business if merger talks between the two companies are successful, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/rio-tinto-said-to-be-open-to-owning-coal-if-it-buys-glencore",
    "timestamp": "2026-01-09T10:43:19Z"
  },
  {
    "title": "Trump cancels second wave of attacks on Venezuela after cooperation",
    "description": "US President Donald Trump said he had cancelled a second wave of attacks on Venezuela following cooperation from the South American nation.The president said on Friday (Jan 9) that Venezuela was releasing a large number of political prisoners as a sign of \"se…",
    "link": "https://www.channelnewsasia.com/world/trump-venezuela-cancels-second-wave-attacks-after-cooperation-united-states-5848416",
    "timestamp": "2026-01-09T10:42:00Z"
  },
  {
    "title": "US to support Cambodian-Thai ceasefire with $45m aid pledge",
    "description": "The aid is earmarked to help support both countries in border stabilisation efforts.",
    "link": "https://www.aljazeera.com/news/2026/1/9/us-to-support-cambodian-thai-ceasefire-with-45m-aid-pledge",
    "timestamp": "2026-01-09T10:39:47Z"
  },
  {
    "title": "US frees two Russian crew detained on seized oil tanker",
    "description": "Russia confirms the US has decided to release two Russian crew members from an oil tanker seized in the North Atlantic in violation of sanctions.\n\nRead More: https://punchng.com/us-frees-two-russian-crew-detained-on-seized-oil-tanker/",
    "link": "https://punchng.com/us-frees-two-russian-crew-detained-on-seized-oil-tanker/",
    "timestamp": "2026-01-09T10:36:55Z"
  },
  {
    "title": "Trump cancels ‘second wave’ of attacks on Venezuela",
    "description": "US President Donald Trump says he has canceled his ‘second wave of attacks’ on Venezuela, citing improved energy cooperation Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630754-trump-cancels-second-wave-of/",
    "timestamp": "2026-01-09T10:36:54Z"
  },
  {
    "title": "Princess Kate says she is ‘deeply grateful’ as she celebrates her 44th birthday",
    "description": "The royals dropped in on NHS workers on a tea break in West London to offer support amid the challenging winter period, which has seen a surge in flu cases",
    "link": "https://www.the-independent.com/news/uk/home-news/kate-middleton-birthday-princess-wales-b2897355.html",
    "timestamp": "2026-01-09T10:33:10Z"
  },
  {
    "title": "Russia fires hypersonic missile near Ukraine's EU border",
    "description": "KYIV, Jan 9 (Reuters) - Russia fired a powerful hypersonic missile ‌at Ukraine near the EU border overnight, in what Kyiv called a new threat to European security that demanded a global response. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/09/russia-fires-hypersonic-missile-near-ukraine039s-eu-border",
    "timestamp": "2026-01-09T10:32:00Z"
  },
  {
    "title": "Iran’s Khamenei lashes out as Tehran struggles to quell protests",
    "description": "Supreme leader warns against foreign enemies and reiterates threat that authorities will crack down on the unrest.",
    "link": "https://www.aljazeera.com/news/2026/1/9/irans-khamenei-lashes-out-as-tehran-struggles-to-quell-protests",
    "timestamp": "2026-01-09T10:31:43Z"
  },
  {
    "title": "Trumpist lies about this ICE outrage demand a fierce response — including murder charges",
    "description": "In Minneapolis, Minnesota, a masked Immigration and Customs Enforcement agent shot and killed another person, the 14\r\nth\r\n ICE shooting under Trump to date\r\n.Flexing Gestapo power in broad daylight, the agent shot a woman at close range\r\n as she was driving a…",
    "link": "https://www.rawstory.com/raw-investigates/ice-shooting-2674862902/",
    "timestamp": "2026-01-09T10:30:01Z"
  },
  {
    "title": "What will the DEI landscape of the tech sector look like in 2026?",
    "description": "Over the past 10 years there has been an ongoing battle to increase representation of women and other underrepresented groups in the tech sector – but progress has been slow. What will 2026 have in store for this endeavour?",
    "link": "https://www.computerweekly.com/news/366636968/What-will-the-DEI-landscape-of-the-tech-sector-look-like-in-2026",
    "timestamp": "2026-01-09T10:30:00Z"
  },
  {
    "title": "Europe Signs Up for More Humiliation by Trump",
    "description": "David Broder\n\n\n\nAs the post–Cold War order cracks up, the fault lines don’t just run through the Atlantic, but Europe itself. \r\n\n\r\n\n\nThe post Europe Signs Up for More Humiliation by Trump appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/trump-venezuela-europe-expansion-war/",
    "timestamp": "2026-01-09T10:30:00Z"
  },
  {
    "title": "'We just want to be left alone': Greenlanders on Trump's takeover threats",
    "description": "The BBC's Europe Editor Katya Adler visits the Arctic island to ask what people think of the US president's plans.",
    "link": "https://www.bbc.co.uk/news/videos/c78veq59823o",
    "timestamp": "2026-01-09T10:29:19Z"
  },
  {
    "title": "Trump calls to ban Wall Street from buying homes, but industry insiders say the business model has already moved on",
    "description": "Industry insiders say Trump's call to ban big investors is out of sync with how those players actually buy homes.",
    "link": "https://www.businessinsider.com/trump-ban-wall-street-buying-homes-industry-response-impact-2026-1",
    "timestamp": "2026-01-09T10:28:01Z"
  },
  {
    "title": "Kennedy Center clowned for new act amid cancellations: ‘Didn’t know he was still alive’",
    "description": "Kennedy Center clowned for new act amid cancellations: ‘Didn’t know he was still alive’pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2026/01/kennedy-center-clowned-for-new-act-amid-cancellations-didnt-know-he-was-still-alive.html",
    "timestamp": "2026-01-09T10:24:10Z"
  },
  {
    "title": "Trump plans for Venezuela's future as oil execs meet and Senate pushes back",
    "description": "President Trump says he's waved off \"the previously expected second Wave of Attacks\" on Venezuela since it's been \"working well together\" with the U.S.",
    "link": "https://www.cbsnews.com/live-updates/venezuela-trump-oil-war-powers-maduro/",
    "timestamp": "2026-01-09T10:22:31Z"
  },
  {
    "title": "Republicans Confirm: We Will Not Back Down on Hyde, No Tax-Funded Abortions",
    "description": "GOP lawmakers and pro-life groups are strongly pushing back against a suggestion by President Donald Trump Tuesday that House Republicans should be “a little flexible” during health care legislation negotiations on the Hyde Amendment, a bipartisan provision p…",
    "link": "https://freerepublic.com/focus/f-chat/4361170/posts",
    "timestamp": "2026-01-09T10:20:06Z"
  },
  {
    "title": "US Releases 2 Russians From Marinera Tanker at Moscow's Request - Foreign Ministry",
    "description": "MOSCOW (Sputnik) - The United States has decided to release two Russians from the Marinera tanker following Russia's request, and Moscow welcomes this decision, Russian Foreign Ministry spokeswoman Maria Zakharova said on Friday.",
    "link": "https://sputnikglobe.com/20260109/us-releases-2-russians-from-marinera-tanker-at-moscows-request---foreign-ministry-1123443566.html",
    "timestamp": "2026-01-09T10:15:04Z"
  },
  {
    "title": "Republicans Reject Trump on Numerous Congressional Votes",
    "description": "In the House and Senate, the Trump position was snubbed. The impact isn’t definitive, but the trend is unmistakable.\nThe post Republicans Reject Trump on Numerous Congressional Votes appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/01/09/republicans-reject-trump-on-numerous-congressional-votes/",
    "timestamp": "2026-01-09T10:15:00Z"
  },
  {
    "title": "Meloni rules out U.S. military move on Greenland, urges strong NATO Arctic presence",
    "description": "ROME, Jan 9 (Reuters) - Italian Prime Minister Giorgia Meloni said on Friday she did not believe the United States would use military force to seize Greenland, warning th… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/09/meloni-rules-out-u-s-military-move-on-greenland-urges-strong-nato-arctic-presence",
    "timestamp": "2026-01-09T10:09:04Z"
  },
  {
    "title": "Semiconductor stocks boosted by Intel after Donald Trump praises company and its CEO",
    "description": "Intel shares rose 2% in extended trading on Thursday after Trump said he had \"a great meeting with the very successful Intel CEO, Lip-Bu Tan.\"",
    "link": "https://www.cnbc.com/2026/01/09/semiconductor-stocks-boosted-by-donald-trumps-intel-praise.html",
    "timestamp": "2026-01-09T10:09:01Z"
  },
  {
    "title": "Trump’s Venezuela focus frustrates top aides worried about midterm elections",
    "description": "By Nandita BoseWASHINGTON, Jan 9 (Reuters) - President Donald Trump’s focus on the brazen U.S. capture of Venezuelan leader Nicolas Maduro is frustrating some White House… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/09/trump-s-venezuela-focus-frustrates-top-aides-worried-about-midterm-elections",
    "timestamp": "2026-01-09T10:06:27Z"
  },
  {
    "title": "Nvidia CEO says the idea of decoupling from China is 'naive' and 'not based on any common sense'",
    "description": "Nvidia CEO Jensen Huang knows China is a lucrative market for the chipmaker.",
    "link": "https://www.businessinsider.com/nvidia-jensen-huang-us-china-decoupling-h200s-2026-1",
    "timestamp": "2026-01-09T10:06:01Z"
  },
  {
    "title": "Iran’s Supreme Leader Khamenei says protesters are ‘ruining their own streets’ to please Trump",
    "description": "Iran's supreme leader Khamenei says protesters are 'ruining their own streets' to please Trump",
    "link": "https://nypost.com/2026/01/09/world-news/irans-supreme-leader-khamenei-says-protesters-are-ruining-their-own-streets-to-please-trump/",
    "timestamp": "2026-01-09T10:05:15Z"
  },
  {
    "title": "Supreme Court set to issue rulings as Trump awaits fate of tariffs",
    "description": "By Andrew ChungWASHINGTON, Jan 9 (Reuters) - The U.S. Supreme Court could issue at least one ruling on Friday as several major cases remain pending including litigation t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/09/supreme-court-set-to-issue-rulings-as-trump-awaits-fate-of-tariffs",
    "timestamp": "2026-01-09T10:03:13Z"
  },
  {
    "title": "Trump wants Greenland for one reason but could open 'theatre of conflict': expert",
    "description": "Donald Trump could be preparing for a new \"theatre of conflict\" with China and Russia in Greenland, a political analyst has suggested. Though the president's administration has made it clear the official line is a takeover of Greenland for security measures, …",
    "link": "https://www.rawstory.com/trump-greenland-2674863655/",
    "timestamp": "2026-01-09T10:02:31Z"
  },
  {
    "title": "President Trump says there won't be a 'second Wave of Attacks' against Venezuela due to their 'cooperation'",
    "description": "Trump said that due to Venezuela's \"cooperation,\" he has \"cancelled the previously expected second Wave of Attacks\" against the foreign country.",
    "link": "https://www.foxnews.com/politics/president-trump-says-wont-second-wave-attacks-against-venezuela-due-cooperation",
    "timestamp": "2026-01-09T10:02:09Z"
  },
  {
    "title": "Before fatal ICE shooting, Minnesota had become Trump target",
    "description": "By Nathan LayneJan 9 (Reuters) - Months before a U.S. immigration agent fatally shot a motorist in Minnesota on Wednesday, President Donald Trump had fixated on the state… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/09/before-fatal-ice-shooting-minnesota-had-become-trump-target",
    "timestamp": "2026-01-09T10:02:05Z"
  },
  {
    "title": "Iran cut off from world as Supreme Leader warns protesters",
    "description": "DUBAI, Jan 9 (Reuters) - Iran was largely cut ‌off from the outside world on Friday after authorities blacked out the internet to curb expanding protests, with phone calls not reaching ‌the country, flights cancelled and online Iranian news sites only intermi…",
    "link": "https://www.thestar.com.my/news/world/2026/01/09/iran-cut-off-from-world-as-supreme-leader-warns-protesters",
    "timestamp": "2026-01-09T10:01:00Z"
  },
  {
    "title": "MAGA country music singer ripped for ICE shooting comments: ‘You really this dumb?’",
    "description": "The 27-year-old singer did have supporters, too.",
    "link": "https://www.pennlive.com/entertainment/2026/01/maga-country-music-singer-ripped-for-ice-shooting-comments-you-really-this-dumb.html",
    "timestamp": "2026-01-09T10:00:55Z"
  },
  {
    "title": "Experts say Trump quitting UN climate convention will hurt America and the world",
    "description": "U.S. President Donald Trump's withdrawal from the United Nations climate framework marks a significant escalation of anti-climate policy",
    "link": "https://www.wsbtv.com/news/business/experts-say-trump/DFALHAMYRUZLTGRDBXCHDSZ4DQ/",
    "timestamp": "2026-01-09T10:00:47Z"
  },
  {
    "title": "EXCLUSIVE: DNC joins Supreme Court voting case, blasts RNC efforts as 'wholly un-American'",
    "description": "The Supreme Court agreed to take up the case in November, a closely watched fight that could determine the fate of millions of mail-in ballots nationwide.",
    "link": "https://www.foxnews.com/politics/exclusive-dnc-joins-supreme-court-voting-case-blasts-rnc-effort-wholly-un-american",
    "timestamp": "2026-01-09T10:00:43Z"
  },
  {
    "title": "RILEY GAINES: Unite now or watch the radical left destroy everything we built",
    "description": "Activist, athlete and podcast host argues that Republicans must abandon destructive infighting and focus on defeating Democrats in the upcoming 2026 midterm elections.",
    "link": "https://www.foxnews.com/opinion/riley-gaines-unite-now-watch-radical-left-destroy-everything-we-built",
    "timestamp": "2026-01-09T10:00:38Z"
  },
  {
    "title": "Experts say Trump quitting UN climate convention will hurt America and the world",
    "description": "U.S. President Donald Trump's withdrawal from the United Nations climate framework marks a significant escalation of anti-climate policy",
    "link": "https://www.whio.com/news/business/experts-say-trump/DFALHAMYRUZLTGRDBXCHDSZ4DQ/",
    "timestamp": "2026-01-09T10:00:37Z"
  },
  {
    "title": "MIKE POMPEO: Trump can win it all in Venezuela and stop a Maduro-like sequel",
    "description": "Venezuela's interim President Rodriguez threatens to undermine his nation's democratic transition and U.S. goals in the region, which raises challenges for White House.",
    "link": "https://www.foxnews.com/opinion/mike-pompeo-trump-can-win-all-venezuela-stop-maduro-like-sequel",
    "timestamp": "2026-01-09T10:00:10Z"
  },
  {
    "title": "AI is intensifying a 'collapse' of trust online, experts say",
    "description": "For years, people could largely trust, at least instinctively, that seeing was believing.",
    "link": "https://www.nbcnews.com/tech/tech-news/experts-warn-collapse-trust-online-ai-deepfakes-venezuela-rcna252472",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "As Washington Falters, California Leads the Way on Scientific Research",
    "description": "Using its economic leverage, the Golden State has been forging its own scientific path for 25 years. Here’s how.  \nThe post As Washington Falters, California Leads the Way on Scientific Research appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/01/09/california-leads-the-way-on-scientific-research/",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "EU should ‘get competitive’ instead of complaining about China, Taoiseach says",
    "description": "Micheál Martin says European Union should take steps to make its own economy more competitive",
    "link": "https://www.irishtimes.com/politics/2026/01/09/eu-should-get-competitive-instead-of-complain-over-chinese-imports-impact-taoiseach-suggests/",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "European Cowardice Is Empowering Trump’s New Imperialism",
    "description": "Jeet Heer\n\n\n\nNATO allies don’t want to confront Trump’s aggression. But they may ultimately not have a choice.\r\n\n\r\n\n\nThe post European Cowardice Is Empowering Trump’s New Imperialism appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=582777",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "Dismantling the Meme Logic Behind Renee Good’s ICE Execution",
    "description": "Jeb Lund\n\n\n\nThe Trump administration is once more invoking upside-down alibis of state to conjure the bogus specter of imminent threat. \r\n\n\r\n\n\nThe post Dismantling the Meme Logic Behind Renee Good’s ICE Execution appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=582801",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "The Media’s Coverage of the Venezuelan Coup Has Been Dreadful",
    "description": "Jack Mirkinson\n\n\n\nWar may be the health of state, but it’s death to honest journalism. \r\n\n\r\n\n\nThe post The Media’s Coverage of the Venezuelan Coup Has Been Dreadful appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=582787",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "On Cora Weiss (1934-2025) and Peace",
    "description": "Katrina vanden Heuvel\n\n\n\nCora Weiss died in December at age 91. She never stopped campaigning to save the world from nuclear destruction.\r\n\n\r\n\n\nThe post On Cora Weiss (1934-2025) and Peace appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=582648",
    "timestamp": "2026-01-09T10:00:00Z"
  },
  {
    "title": "Iran's Supreme Leader Says Protesters Are 'Ruining Their Own Streets' To Please Trump",
    "description": "Iranian authorities have cut off the nation from the internet and international telephone calls amid the protests.",
    "link": "https://www.huffpost.com/entry/iran-protests_n_6960cf0fe4b0120ab25d00e9",
    "timestamp": "2026-01-09T09:59:45Z"
  },
  {
    "title": "What Happens if Russia Wins the War it Started in Ukraine?",
    "description": "If Russia Wins is a deeply researched and chillingly plausible scenario in which Russia attacks a NATO country to see whether the alliance will respond, underscoring the danger of Western military complacency post‑Ukraine. The author, Carlo Masala, a Professo…",
    "link": "https://lithub.com/what-happens-if-russia-wins-the-war-it-started-in-ukraine/",
    "timestamp": "2026-01-09T09:59:21Z"
  },
  {
    "title": "Damian Hardung: Never imagined that acting could transcend borders",
    "description": "German actor Damian Hardung reflects on Maxton Hall's global success, highlighting art's power to bridge divides and unite people through universal themes of love. He notes the show's resonance across continents, emphasizing how shared emotional connections f…",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/damian-hardung-the-actor-bridging-cultures-through-art/articleshow/126432684.cms",
    "timestamp": "2026-01-09T09:58:22Z"
  },
  {
    "title": "US releases Russian crew members of seized tanker – Moscow",
    "description": "The Russian Foreign Ministry has said it welcomes the release of some crew members of a seized oil tanker by US President Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630753-us-tanker-crew-moscow/",
    "timestamp": "2026-01-09T09:58:01Z"
  },
  {
    "title": "Envoy tapped for Trump’s Gaza board meets senior Palestinian official in West Bank",
    "description": "By Ali Sawafta and Rami AyyubRAMALLAH, West Bank, Jan 9 (Reuters) - The former U.N. envoy expected to help lead Donald Trump’s so-called Board of Peace for Gaza met a top… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/09/envoy-tapped-for-trump-s-gaza-board-meets-senior-palestinian-official-in-west-bank",
    "timestamp": "2026-01-09T09:55:38Z"
  },
  {
    "title": "Maniesh Paul's daughter turns 15: Actor hopes he and his kid never get tired of their 'stupid jokes'",
    "description": "Actor and television host Maniesh Paul celebrated his daughter's 15th birthday, sharing a heartfelt message on Instagram. He expressed his love and wished for their continued shared laughter over inside jokes. The post included photos of the father-daughter d…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/maniesh-pauls-daughter-turns-15-actor-hopes-he-and-his-kid-never-get-tired-of-their-stupid-jokes/articleshow/126432394.cms",
    "timestamp": "2026-01-09T09:52:54Z"
  },
  {
    "title": "16 celebrities and reality TV stars who turned to politics from Trump to Katie Price",
    "description": "Trisha Paytas‘ announcement that she intends to run for a seat in the US House of Representatives in her home state, California, has come as a surprise to many. As someone put on X/Twitter on Tuesday (6 January): “Trisha Paytas announcing that she is running …",
    "link": "https://www.thepinknews.com/2026/01/09/16-celebrities-and-reality-tv-stars-who-turned-to-politics-from-trump-to-katie-price/",
    "timestamp": "2026-01-09T09:50:43Z"
  }
]