[
  {
    "title": "Silver futures rise 5% to ₹2.65 lakh per kg amid global tariff tensions",
    "description": "On the Multi Commodity Exchange (MCX), silver futures for March delivery zoomed ₹12,338, or 4.88%, to ₹2,65,282 per kg in 6,024 lots",
    "link": "https://www.thehindubusinessline.com/markets/gold/silver-futures-rise-5-to-265-lakh-per-kg-amid-global-tariff-tensions/article70665969.ece",
    "timestamp": "2026-02-23T07:03:03Z"
  },
  {
    "title": "As antisemitism rises and strife over Israel continues, Josh Shapiro turns toward his Jewish faith",
    "description": "Pennsylvania Gov. Josh Shapiro may be the nation’s most prominent Jewish politician as antisemitism surges across America",
    "link": "https://abcnews.com/Politics/wireStory/antisemitism-rises-strife-israel-continues-josh-shapiro-turns-130400141",
    "timestamp": "2026-02-23T07:02:00Z"
  },
  {
    "title": "Trump Organization Signs Agreement for a 91-storey Trump Tower on the Gold Coast",
    "description": "The Trump Organization and an Australian developer have signed an agreement to build what some reports have called \"Australia's tallest building.\"",
    "link": "https://www.ibtimes.com.au/trump-organization-signs-agreement-91-storey-trump-tower-gold-coast-1861898",
    "timestamp": "2026-02-23T06:55:34Z"
  },
  {
    "title": "Greenland's Prime Minister on Trump Sending Hospital Ship to Island: 'No, Thanks'",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen dismissed US President Donald Trump's idea of sending a hospital ship to the island, calling on the United States to engage in dialogue instead of posting \"random comments\" on social media.",
    "link": "https://sputnikglobe.com/20260223/greenlands-prime-minister-on-trump-sending-hospital-ship-to-island-no-thanks-1123672990.html",
    "timestamp": "2026-02-23T06:54:00Z"
  },
  {
    "title": "Mexico's most wanted drug cartel leader killed",
    "description": "The operation sparked a wave of violence in various parts of the country.",
    "link": "https://www.thejournal.ie/top-mexican-drug-cartel-leader-killed-6964867-Feb2026/",
    "timestamp": "2026-02-23T06:52:13Z"
  },
  {
    "title": "EU diplomats to meet Board of Peace director over Gaza's future",
    "description": "European leaders like French President Emmanuel Macron and European Commission President Ursula von der Leyen turned down invitation to join, as did Pope Leo XIV",
    "link": "https://www.thehindubusinessline.com/news/world/eu-diplomats-to-meet-board-of-peace-director-over-gazas-future/article70665890.ece",
    "timestamp": "2026-02-23T06:46:33Z"
  },
  {
    "title": "Inside the operation to eliminate Mexico's biggest drug lord 'El Mencho'",
    "description": "Nemesio Rubén Oseguera Cervantes died after a gunfight with military personnel. Hours later, vehicles were set alight, roads blocked and shopfronts torched as retaliation in eight states.",
    "link": "https://www.abc.net.au/news/2026-02-23/el-mencho-mexico-drug-cartels-leader-death-sparks-chaos/106376506",
    "timestamp": "2026-02-23T06:44:09Z"
  },
  {
    "title": "With US tariff rates up in the air, the economic fog again thickens",
    "description": "Businesses face fresh tariff volatility as Trump’s new 10–15% global levy adds to uncertainty over import costs",
    "link": "https://www.thehindubusinessline.com/news/world/with-us-tariff-rates-up-in-the-air-the-economic-fog-again-thickens/article70665871.ece",
    "timestamp": "2026-02-23T06:43:44Z"
  },
  {
    "title": "EU diplomats to meet Board of Peace director over Gaza's future",
    "description": "The European Union’s top diplomats are meeting with the director of the Board of Peace in Brussels",
    "link": "https://abcnews.com/International/wireStory/eu-diplomats-meet-board-peace-director-gazas-future-130400869",
    "timestamp": "2026-02-23T06:41:38Z"
  },
  {
    "title": "Critics Give Nicki Minaj Holy Hell After She Reveals 'Most Meaningful' Gift From Trump",
    "description": "The rapper's embrace of MAGA appears to be complete.",
    "link": "https://www.huffpost.com/entry/nicki-minaj-trump-bible_n_699bd57be4b081639ee07bfd",
    "timestamp": "2026-02-23T06:40:35Z"
  },
  {
    "title": "EU 'expects' US to honour trade deal as Trump hikes tariffs",
    "description": "The European Commission called Sunday for Washington to abide by the terms of the trade deal struck last year with the EU, as President Donald Trump announced new global tariff hikes a day after an adverse Supreme Court ruling.",
    "link": "https://www.hurriyetdailynews.com/eu-expects-us-to-honour-trade-deal-as-trump-hikes-tariffs-219222",
    "timestamp": "2026-02-23T06:37:52Z"
  },
  {
    "title": "Trump loses his best lever",
    "description": "Striking down of some tariffs strengthens Xi Jinping’s hand in talks over trade and other elements of China-US relationship",
    "link": "https://www.irishtimes.com/world/2026/02/23/court-ruling-leaves-trump-heading-to-china-without-tariffs-lever/",
    "timestamp": "2026-02-23T06:32:47Z"
  },
  {
    "title": "Mexico fears more violence after army kills leader of powerful Jalisco cartel",
    "description": "School was canceled in several Mexican states and local and foreign governments alike warned their citizens to stay inside following the army's killing of the leader of the Jalisco New Generation Cartel, Nemesio Rubén Oseguera Cervantes, \"El Mencho,\" and the …",
    "link": "https://www.npr.org/2026/02/23/g-s1-111138/mexico-fears-more-violence-after-army-kills-leader-of-powerful-jalisco-cartel",
    "timestamp": "2026-02-23T06:32:40Z"
  },
  {
    "title": "Govt to strike out opposition MPs' originating summons on ART deal with US",
    "description": "KUALA LUMPUR: The government plans to strike out an originating summons filed by five opposition MPs against Prime Minister Datuk Seri Anwar Ibrahim and the government regarding the Malaysia-US Agreement on Reciprocal Trade (ART). Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/23/govt-to-strike-out-opposition-mps039-originating-summons-on-art-deal-with-us",
    "timestamp": "2026-02-23T06:29:00Z"
  },
  {
    "title": "European stocks to start the week lower as markets react to new Trump tariffs",
    "description": "European stocks are expected to start the week in negative territory as global markets react to U.S. President Donald Trump's latest global tariffs policy.",
    "link": "https://www.cnbc.com/2026/02/23/european-markets-stoxx-600-ftse-dax-cac-trump-tariffs-reaction.html",
    "timestamp": "2026-02-23T06:27:15Z"
  },
  {
    "title": "With US tariff rates up in the air, the economic fog again thickens",
    "description": "A recent U.S. Supreme Court decision has overturned key tariff plans, plunging trade policy into fresh uncertainty. Businesses now face difficult decisions regarding pricing and investment. This situation echoes past unpredictability, impacting economic plann…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/with-us-tariff-rates-up-in-the-air-the-economic-fog-again-thickens/articleshow/128701955.cms",
    "timestamp": "2026-02-23T06:24:32Z"
  },
  {
    "title": "Bitcoin slides 5%, slips below $65,000 after Trump’s 15% tariff move",
    "description": "Bitcoin and Ethereum experienced significant drops, trading below $65,000 and $2,000 respectively, following the announcement of a 15% global tariff by President Trump. This led to a risk-off sentiment across markets, with major altcoins also slipping and the…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-slides-5-slips-below-65000-after-trumps-15-tariff-move/articleshow/128701377.cms",
    "timestamp": "2026-02-23T06:23:08Z"
  },
  {
    "title": "JPMorgan concedes it debanked Trump after Capitol attack",
    "description": "JPMorgan admitted to debanking Donald Trump after the Jan. 6 Capitol attack, a move that Eric Trump said gave the family no other choice but to adopt crypto.",
    "link": "https://cointelegraph.com/news/jpmorgan-admits-debanked-trump-after-capitol-attack",
    "timestamp": "2026-02-23T06:22:03Z"
  },
  {
    "title": "Illegal Orders and the Criminals Who Give Them",
    "description": "The president and secretary of defense have failed in their effort to see to the execution of six members of Congress after the lawmakers had the nerve to urge members of the U.S. military to refuse illegal orders, in other words, to obey the law. The six Dem…",
    "link": "https://www.counterpunch.org/2026/02/23/illegal-orders-and-the-criminals-who-give-them-2/",
    "timestamp": "2026-02-23T06:21:18Z"
  },
  {
    "title": "FBI Director Kash Patel parties with USA Olympic hockey team after gold medal win over Canada",
    "description": "Team USA got a congratulatory call from president Donald Trump and got to celebrate and share a beer with FBI Director Kash Patel after their gold medal win.",
    "link": "https://nypost.com/2026/02/23/sports/fbi-director-kash-patel-parties-with-usa-olympic-hockey-team-after-gold-medal-win-over-canada/",
    "timestamp": "2026-02-23T06:20:55Z"
  },
  {
    "title": "US futures, bitcoin fall, Asian markets mixed after Supreme Court nixes Trump's tariffs",
    "description": "Bitcoin tumbled as much as 5% early Monday, dropping below $65,000. The sell-off has been driven by investors pulling out of speculative assets and concerns about future cryptocurrency regulation",
    "link": "https://www.thehindubusinessline.com/markets/us-futures-bitcoin-fall-asian-markets-mixed-after-supreme-court-nixes-trumps-tariffs/article70665853.ece",
    "timestamp": "2026-02-23T06:20:46Z"
  },
  {
    "title": "The seven questions Josh Pate asked Donald Trump on his College Football Show",
    "description": "The pre-recorded interview was done this week.",
    "link": "https://www.sportingnews.com/us/ncaa-football/news/seven-questions-josh-pate-asked-donald-trump-his-college-football-show/ae99e87023402eefcbbd7b62",
    "timestamp": "2026-02-23T06:15:02Z"
  },
  {
    "title": "US to stop collecting tariffs deemed illegal by Supreme Court on Tuesday",
    "description": "The US Customs and Border Protection agency said it will ⁠deactivate all tariff codes associated with President ⁠Donald Trump’s prior IEEPA-related orders on Tuesday",
    "link": "https://www.thehindubusinessline.com/news/world/us-to-stop-collecting-tariffs-deemed-illegal-by-supreme-court-on-tuesday/article70665816.ece",
    "timestamp": "2026-02-23T06:11:21Z"
  },
  {
    "title": "President Trump says he’s sending hospital ship to Greenland",
    "description": "U.S. President Donald Trump on Saturday said he is going to dispatch a hospital ship to Greenland, autonomous Danish territory that Trump has said he wants to acquire. Danish officials responded by saying the health care systems in Denmark and Greenland are m…",
    "link": "https://freerepublic.com/focus/f-news/4367944/posts",
    "timestamp": "2026-02-23T06:02:50Z"
  },
  {
    "title": "Trump-Backed Ohio Gas Plant Could Become Biggest US Power Polluter",
    "description": "President Donald Trump’s proposal for a massive gas-fired power plant in Ohio would likely create one of the nation’s largest sources of carbon dioxide emissions from electricity generation. While details of the potential $33 billion development are scarce so…",
    "link": "https://www.insurancejournal.com/news/midwest/2026/02/23/859055.htm",
    "timestamp": "2026-02-23T06:00:55Z"
  },
  {
    "title": "Top Mexican drug cartel leader killed",
    "description": "The Mexican army announced Sunday that it had killed powerful drug lord Nemesio \"El Mencho\" Oseguera in an operation that sparked a wave of violence in various parts of the country.",
    "link": "https://www.hurriyetdailynews.com/top-mexican-drug-cartel-leader-killed-219220",
    "timestamp": "2026-02-23T06:00:35Z"
  },
  {
    "title": "“Shelter in place” order issued across Mexican tourist zones following killing of “El Mencho”",
    "description": "The killing of a top cartel leader triggered violent reprisals across Mexico. The U.S. Embassy issued an urgent shelter-in-place order for popular tourist areas. Cartel members blocked roads and caused major disruptions to travel and businesses. Tourists were…",
    "link": "https://www.naturalnews.com/2026-02-23-shelter-in-place-order-mexican-tourist-zones.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "$175 Billion in limbo: Supreme Court ruling triggers tariff refund mystery and fresh trade chaos",
    "description": "The U.S. Supreme Court struck down key Trump tariffs, prompting a new 15% global tariff order and creating legal and market chaos. The European Union demands “full clarity” and insists the U.S. honor a 2025 trade deal, warning of severe economic instability. …",
    "link": "https://www.naturalnews.com/2026-02-23-supreme-court-ruling-triggers-tariff-refund-mystery.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "U.S. imports from Taiwan surpass goods from China for the first time in decades",
    "description": "The United States imported more goods from Taiwan than from China for the first time in decades, as tariffs and booming AI demand reshaped trade flows. According to the Department of Commerce (DOC), U.S. imports from China fell nearly 44% year-over-year in De…",
    "link": "https://www.naturalnews.com/2026-02-23-united-states-imports-from-taiwan-surpass-china.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "Why the TV industry keeps falling in love with the Kennedys, America’s answer to the royal family",
    "description": "As Ryan Murphy takes on the story of JFK Jr and Carolyn Bessette, and Netflix plan an all-American successor to ‘The Crown’, Katie Rosseinsky explores the quasi-mythical appeal of the Kennedy family",
    "link": "https://www.the-independent.com/life-style/john-f-kennedy-jr-carolyn-bessette-disney-plus-series-netflix-drama-b2919883.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "Agency reckoning: CIA purges politicized intel from Obama, Biden era in sweeping corrective action",
    "description": "The CIA has retracted or revised 19 intelligence reports from 2015-2023 for failing impartiality standards. The politicized reports covered topics like domestic extremism, LGBT issues and contraception, straying from core national security. This action follow…",
    "link": "https://www.naturalnews.com/2026-02-23-cia-purges-politicized-intel-from-obama-biden-era.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "Trump orders UFO files release as secret Air Force jet spotted near Area 51",
    "description": "President Donald Trump announced plans to declassify government files related to extraterrestrial life, UFOs and UAPs, framing it as a move against Deep State secrecy and institutional corruption. Trump criticized former President Barack Obama for joking abou…",
    "link": "https://www.naturalnews.com/2026-02-23-trump-ufo-files-air-force-jet-area-51.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "Trump imposes new 10% global tariff after Supreme Court strikes down emergency powers",
    "description": "The U.S. Supreme Court ruled 6-3 that President Donald Trump’s use of the 1977 International Emergency Economic Powers Act (IEEPA) to impose tariffs was unconstitutional. The Court declared that only Congress holds tariff authority under Article I, Section 8 …",
    "link": "https://www.naturalnews.com/2026-02-23-trump-global-tariff-scotus-strikes-down-emergency-powers.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "Judges rule 4,400+ times that Trump administration illegally detained immigrants",
    "description": "Federal judges have ruled more than 4,400 times since October that President Donald Trump’s administration unlawfully detained immigrants, according to a review by Reuters. The decisions, issued by over 400 judges, broadly challenge the administration’s shift…",
    "link": "https://www.naturalnews.com/2026-02-23-judges-rule-trump-admin-illegally-detained-immigrants.html",
    "timestamp": "2026-02-23T06:00:00Z"
  },
  {
    "title": "China assessing US Supreme Court tariff ruling",
    "description": "China is making a &quot;full assessment&quot; of the U.S. Supreme Court's tariff ruling and has urged Washington to lift &quot;unilateral tariff measures&quot; on its trading ‌partners, warning that fighting between the two countries is &quot;harmful&quot;. T…",
    "link": "https://japantoday.com/category/world/china-assessing-us-supreme-court-tariff-ruling-says-fighting-is-harmful",
    "timestamp": "2026-02-23T05:59:20Z"
  },
  {
    "title": "Wall St futures and dollar slide as markets open following US tariff tumult",
    "description": "Oil prices choppy, unwinding some of the gains made last week when Trump said the US military could strike specific targets in Iran",
    "link": "https://www.irishtimes.com/business/2026/02/23/wall-st-futures-and-dollar-skid-on-us-tariff-tumult/",
    "timestamp": "2026-02-23T05:59:05Z"
  },
  {
    "title": "China’s leverage rises before high-stakes summit as Supreme Court curbs Trump tariffs",
    "description": "Supreme Court's decision to invalidate Trump's tariffs has strengthened China's hand ahead of the leaders summit in April, at a time when Beijing seeks U.S. concessions on Taiwan.",
    "link": "https://www.cnbc.com/2026/02/23/trumps-tariff-setback-in-supreme-court-ruling-boosts-china-april-summit-leverage-xi.html",
    "timestamp": "2026-02-23T05:52:44Z"
  },
  {
    "title": "Donald Trump Has a Message for Team USA Hockey",
    "description": "Donald Trump responded publicly after Team USA secured a gold medal in men’s hockey at the 2026 Winter Olympics. Following the team’s overtime victory over Canada in Milan, the president shared a message congratulating the players and later spoke with them di…",
    "link": "https://www.realitytea.com/2026/02/22/donald-trump-team-usa-hockey-message-gold-medal/",
    "timestamp": "2026-02-23T05:50:00Z"
  },
  {
    "title": "Analysis-US tariff turmoil leaves Treasury markets dazed",
    "description": "By Laura Matthews and Sinéad Carew NEW YORK/LONDON, Feb 23 (Reuters) - Far from being a source of relief, the Supreme Court's takedown of President Donald...",
    "link": "https://finance.yahoo.com/news/analysis-us-tariff-turmoil-leaves-054912000.html",
    "timestamp": "2026-02-23T05:49:12Z"
  },
  {
    "title": "Trump's latest tariff salvos leave markets unfazed: 'Sit still and do nothing,' analysts say",
    "description": "Global markets took President Trump's latest tariff salvos largely in stride, as investors are once again assessing whether this is another negotiating tactic.",
    "link": "https://www.cnbc.com/2026/02/23/trumps-tariffs-market-reaction-stocks-bitcoin.html",
    "timestamp": "2026-02-23T05:48:48Z"
  },
  {
    "title": "WWII hero Roddie Edmonds to receive Medal of Honor",
    "description": "US soldier who protected Jews in POW camp during WWII to be awarded Medal of Honor.",
    "link": "https://www.israelnationalnews.com/news/422831",
    "timestamp": "2026-02-23T05:41:17Z"
  },
  {
    "title": "Rupee rises 21 paise to 90.73 against the US dollar in early trade",
    "description": "The Indian rupee strengthened significantly against the US dollar on Monday. This rise was driven by a sharp decline in global crude oil prices and a weaker dollar. Positive openings in domestic equity markets and increased forex reserves also supported the r…",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-rises-21-paise-to-90-73-against-the-us-dollar-in-early-trade/articleshow/128700795.cms",
    "timestamp": "2026-02-23T05:39:27Z"
  },
  {
    "title": "Moderna’s vaccine ambitions run into a wall of ‘anti-science’ scepticism",
    "description": "Regulatory inconsistency and the views of US health secretary hampering medical innovation",
    "link": "https://www.irishtimes.com/your-money/2026/02/23/modernas-vaccine-ambitions-run-into-a-wall-of-anti-science-scepticism/",
    "timestamp": "2026-02-23T05:39:00Z"
  },
  {
    "title": "Decoding the AI beliefs of Anthropic and its CEO, Dario Amodei",
    "description": "Here is a guide to Anthropic, Amodei and the company’s AI philosophy.",
    "link": "https://indianexpress.com/article/technology/artificial-intelligence/decoding-the-ai-beliefs-of-anthropic-and-its-ceo-dario-amodei-10546985/",
    "timestamp": "2026-02-23T05:38:44Z"
  },
  {
    "title": "‘A deal is a deal’ – EU set for tariff showdown with Donald Trump as it insists he must honour 2025 agreement",
    "description": "The European Union is set for a showdown with US president Donald Trump over his new global tariff rate after it insisted the United States must honour the terms of a deal brokered last year.",
    "link": "https://www.independent.ie/world-news/europe/a-deal-is-a-deal-eu-set-for-tariff-showdown-with-donald-trump-as-it-insists-he-must-honour-2025-agreement/a655676317.html",
    "timestamp": "2026-02-23T05:30:00Z"
  },
  {
    "title": "India delays US trade talks after Supreme Court rejects Trump tariffs: Source",
    "description": "India has delayed plans to send a trade delegation to Washington this week, chiefly because of uncertainty after the US Supreme Court struck down tariffs imposed by President Donald Trump, a source in its trade ministry said on Sunday (Feb 22). One of the fir…",
    "link": "https://freerepublic.com/focus/f-news/4367940/posts",
    "timestamp": "2026-02-23T05:26:48Z"
  },
  {
    "title": "Kim reelected to top post of North Korea’s ruling party",
    "description": "The report suggests he will double down on accelerating a nuclear arsenal already equipped with missiles capable of threatening Asian U.S. allies and the American mainland.",
    "link": "https://www.kcra.com/article/kim-reelected-top-post-north-koreas-ruling-party/70457236",
    "timestamp": "2026-02-23T05:26:23Z"
  },
  {
    "title": "'Out of Nowhere' Canadians Are Now Poorer Than Alabamians. The Reactions Have Been Pretty Funny",
    "description": "Our northern neighbors are shell-shocked: they are even poorer than Alabamians. This follows a tough week for Canada, which has struggled at the Winter Olympics and has faced constant pressure from Donald Trump. In fact, it's the headline used on social media…",
    "link": "https://freerepublic.com/focus/f-news/4367939/posts",
    "timestamp": "2026-02-23T05:23:52Z"
  },
  {
    "title": "US customs agency to stop collecting tariffs deemed illegal by Supreme Court on Tuesday",
    "description": "The U.S. Customs and Border Protection will stop collecting tariffs imposed under the International Emergency Economic Powers Act from 12:01 a.m. EST Tuesday, following the Supreme Court ruling that declared them illegal.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-customs-agency-to-stop-collecting-tariffs-deemed-illegal-by-supreme-court-on-tuesday/articleshow/128700350.cms",
    "timestamp": "2026-02-23T05:23:47Z"
  },
  {
    "title": "How Modi ‘broke down walls’ between India, Israel – at Palestine’s expense",
    "description": "Under Modi, India, a long supporter of the Palestinian cause, has found a friend in Israel's Netanyahu despite genocide.",
    "link": "https://www.aljazeera.com/features/2026/2/23/how-modi-broke-down-walls-between-india-israel-at-palestines",
    "timestamp": "2026-02-23T05:20:14Z"
  },
  {
    "title": "Developer signs Trump Tower deal for Gold Coast worth $1.5b",
    "description": "Plans are underway for a $1.5 billion Trump Tower on Surfers Paradise, which would be one of Australia's tallest towers if approved.",
    "link": "https://www.abc.net.au/news/2026-02-23/trump-tower-deal-signed-for-gold-coast/106376738",
    "timestamp": "2026-02-23T05:16:10Z"
  },
  {
    "title": "Deal done on $1.5b Trump Tower for Gold Coast, says developer",
    "description": "Plans are afoot for a $1.5 billion, 91-storey Trump Tower in Surfers Paradise, which would be one of Australia's tallest towers if it goes ahead.",
    "link": "https://www.abc.net.au/news/2026-02-23/trump-tower-deal-signed-for-gold-coast-says-developer/106376738",
    "timestamp": "2026-02-23T05:16:10Z"
  },
  {
    "title": "Nifty Prediction Today – February 23, 2026: Nifty 50 Futures: Resistance ahead, go long only on a break above it",
    "description": "Nifty 50 February Futures has resistance in the 25,770-25,800 region.",
    "link": "https://www.thehindubusinessline.com/portfolio/technical-analysis/nifty-prediction-today-february-23-2026-nifty-50-futures-resistance-ahead-go-long-only-on-a-break-above-it/article70665693.ece",
    "timestamp": "2026-02-23T05:11:48Z"
  },
  {
    "title": "Trump Admin DHS Proposal Could Bring Drastic Changes To Asylum Process",
    "description": "The Department of Homeland Security (DHS) is proposing an “overhaul” of the asylum process, according to a Friday announcement.The proposed 220-page rule, which is likely to face legal challenges, aims to reduce the number of immigrants filing fraudulent asyl…",
    "link": "https://freerepublic.com/focus/f-news/4367938/posts",
    "timestamp": "2026-02-23T05:07:23Z"
  },
  {
    "title": "How Trump is Accelerating American (and Planetary) Decline: An Appointment in Samarra",
    "description": "“It was only a start of surprise. I was astonished to see him in Baghdad, for I had an appointment with him tonight in Samarra.”",
    "link": "https://www.juancole.com/2026/02/accelerating-planetary-appointment.html",
    "timestamp": "2026-02-23T05:04:29Z"
  },
  {
    "title": "How Trump will use his State of the Union address to sell skeptical midterm voters on his plans",
    "description": "President Donald Trump 's State of the Union address on Tuesday is likely to be a test run of the message that Republicans will give to voters in November's ...",
    "link": "https://www.yahoo.com/news/articles/trump-state-union-address-sell-050314428.html",
    "timestamp": "2026-02-23T05:03:14Z"
  },
  {
    "title": "Trump’s Midterm Threats Recall a Bleak Chapter in American History",
    "description": "Illiberalism has been part of the national culture since the founding.",
    "link": "http://foreignpolicy.com/2026/02/23/trump-midterm-election-threats-jim-crow-voting/",
    "timestamp": "2026-02-23T05:01:26Z"
  },
  {
    "title": "Singapore, Asia stocks rise amid uncertainty over Trump’s new 15% global tariffs",
    "description": "Singapore and Asia stock markets show resilience despite uncertainty surrounding President Trump's new 15% global tariffs. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/singapore-asia-stocks-rise-amid-uncertainty-over-trumps-new-15-global-tariffs",
    "timestamp": "2026-02-23T05:01:25Z"
  },
  {
    "title": "No surprise: Kim Jong Un re-elected as head of North Korea's Workers' Party",
    "description": "Kim Jong Un has been re-elected as general secretary of North Korea’s Workers’ Party, emphasizing nuclear strength and economic development.",
    "link": "https://www.israelnationalnews.com/news/422830",
    "timestamp": "2026-02-23T04:54:12Z"
  },
  {
    "title": "Watch: Violence erupts across Mexico after cartel leader ‘El Mencho’ killed in army raid",
    "description": "In Guadalajara, residents stayed inside their homes as smoke rose over parts of the city. Schools were cancelled in several states and security forces were placed on alert.",
    "link": "https://indianexpress.com/article/world/us-news/mexico-violence-video-el-mencho-killed-jalisco-cartel-retaliation-10546833/",
    "timestamp": "2026-02-23T04:46:13Z"
  },
  {
    "title": "Crude oil futures decline on hopes of US-Iran talks, US tariff uncertainty",
    "description": "Crude oil futures traded lower  on Monday morning as markets hoped that the proposed third round of talks between the US and Iran on the nuclear programme would lead to a positive outcome later this week.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-on-hopes-of-us-iran-talks-us-tariff-uncertainty/article70665633.ece",
    "timestamp": "2026-02-23T04:43:24Z"
  },
  {
    "title": "Rupee rises 21 paise to 90.73 against the US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened at 90.76 against the US dollar and rose further to 90.73, up 21 paise against its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-rises-21-paise-to-9073-against-the-us-dollar-in-early-trade/article70665637.ece",
    "timestamp": "2026-02-23T04:40:40Z"
  },
  {
    "title": "Tariff ruling lifts Sensex, Nifty; Banking stocks lead rally while IT drags",
    "description": "Among the top Nifty 50 gainers, Adani Ports led with a 2.86% rise to ₹1,554.80, followed by Axis Bank, which was up 2.02% to ₹1,395.90",
    "link": "https://www.thehindubusinessline.com/markets/tariff-ruling-lifts-sensex-nifty-banking-stocks-lead-rally-while-it-drags/article70665601.ece",
    "timestamp": "2026-02-23T04:39:26Z"
  },
  {
    "title": "Bitcoin ETFs’ 5-week bleed, Metaplanet rejects accusations: Hodlers Digest, Feb. 15 – 22",
    "description": "US-based spot Bitcoin ETFs have shed around $2.6 billion already in 2026; Bitcoin developer Matt Corallo shuts down quantum as the reason for the recent sell-off; and other news.",
    "link": "https://cointelegraph.com/news/bitcoin-etf-united-states-metaplanet-btc-treasury-hodlers-digest",
    "timestamp": "2026-02-23T04:35:49Z"
  },
  {
    "title": "Oil slides on Iran nuclear talks, fresh US tariff uncertainty",
    "description": "Brent ‌crude futures slid 75 cents, or 1.05%, ‌to $71.01 ⁠a barrel by 0055 GMT while US West ⁠Texas Intermediate crude futures were at $65.74 a barrel, down 74 cents, or 1.11%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/oil-slides-on-iran-nuclear-talks-fresh-us-tariff-uncertainty/article70665543.ece",
    "timestamp": "2026-02-23T04:34:36Z"
  },
  {
    "title": "US Market | Tariff turmoil clouds Fed outlook; ripple effects felt across US, global and Indian markets",
    "description": "A U.S. Supreme Court ruling striking down Trump-era tariffs has injected fresh policy uncertainty into financial markets. This complicates the Federal Reserve's inflation outlook and interest rate decisions, as the administration signals intent to reimpose si…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-tariff-turmoil-clouds-fed-outlook-ripple-effects-felt-across-us-global-and-indian-markets/articleshow/128698833.cms",
    "timestamp": "2026-02-23T04:24:44Z"
  },
  {
    "title": "Trump Predicted Hockey Would Be \"Terminated\" in Canada. Then Team USA Won Gold. Twice. In the Exact Same Way.",
    "description": "On Feb. 9, Donald Trump claimed China would “terminate” hockey in Canada. Less than two weeks later, Canada lost both Olympic gold medal games to ... Read More",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_82c61690-5630-4cbb-8138-942ca6f740c6",
    "timestamp": "2026-02-23T04:21:18Z"
  },
  {
    "title": "Silver prices jump by Rs 15,200/kg; gold surges Rs 3,700/10 gms as US-Iran tension and tariff uncertainty weigh",
    "description": "Gold and silver prices surged on Monday. This follows US-Iran tensions and new tariffs announced by President Donald Trump. The Supreme Court's decision on tariffs also boosted gold and silver appeal. Bullion prices saw volatility recently. MCX and NSE withdr…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/silver-prices-jump-by-rs-15200/kg-gold-surges-rs-3700/10-gms-as-us-iran-tension-and-tariff-uncertainty-weigh/articleshow/128698068.cms",
    "timestamp": "2026-02-23T04:19:08Z"
  },
  {
    "title": "Oil drops 1% to $71/bbl amid Iran nuclear talks, US tariff uncertainty",
    "description": "Oil prices dipped as U.S.-Iran nuclear talks eased conflict fears, while President Trump's new tariffs introduced global growth uncertainty. Despite this, the looming threat of U.S. strikes on Iran and a naval armada in the Middle East continue to support cru…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-drops-1-to-71/bbl-amid-iran-nuclear-talks-us-tariff-uncertainty/articleshow/128698697.cms",
    "timestamp": "2026-02-23T04:18:50Z"
  },
  {
    "title": "US Supreme Court blocks Trump tariffs: Arnab Das on what it means for global markets",
    "description": "Global markets cheered as the US Supreme Court limited presidential emergency tariff powers. This ruling restores checks and balances in the US trade system. While abrupt tariff shocks may lessen, the US drive to reshape global trade continues. Investors see …",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/us-supreme-court-blocks-trump-tariffs-arnab-das-on-what-it-means-for-global-markets/articleshow/128698466.cms",
    "timestamp": "2026-02-23T04:16:14Z"
  },
  {
    "title": "WATCH: Trump Calls USA Hockey Team, Invites Them to SOTU After Winning Gold",
    "description": "President Donald Trump called the U.S. men’s hockey team, and FBI Director Kash Patel joined them in the locker room to celebrate their win over Canada on Sunday.\nThe post WATCH: Trump Calls USA Hockey Team, Invites Them to SOTU After Winning Gold appeared fi…",
    "link": "https://www.breitbart.com/sports/2026/02/22/watch-trump-calls-usa-hockey-team-invites-sotu-winning-gold/",
    "timestamp": "2026-02-23T04:14:05Z"
  },
  {
    "title": "SoftBank leads US-Japan alliance investing US$33.3B in Trump gas power plant",
    "description": "SoftBank Group (SBG) is spearheading an investment alliance to develop a US-based natural gas-fired power plant project valued at US$33.3 billion, aiming to support infrastructure demands driven by artificial intelligence (AI). This initiative is one of three…",
    "link": "https://www.digitimes.com/news/a20260223PD202/softbank-investment-power-plant-usa.html",
    "timestamp": "2026-02-23T04:11:38Z"
  },
  {
    "title": "More details emerge about Mar-a-Lago shooting",
    "description": "Austin Tucker Martin was seen at the Mar-a-Lago resort's north gate at about 1:30am on Sunday, local time.",
    "link": "https://www.abc.net.au/news/2026-02-23/mar-a-lago-trump-secret-service-shooting/106375912",
    "timestamp": "2026-02-23T04:11:26Z"
  },
  {
    "title": "Sensex surges over 600 pts, Nifty above 25,700; US tariff ruling, other key factors fuel rally",
    "description": "Indian stock markets surged on Monday, with the 30-stock index and Nifty both trading significantly higher. This positive movement was a direct reaction to the US Supreme Court's Friday decision to strike down President Donald Trump's global tariffs. Global m…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-rising-today-sensex-surges-over-600-pts-nifty-above-25700-us-tariff-ruling-other-key-factors-fuel-rally/articleshow/128698058.cms",
    "timestamp": "2026-02-23T04:07:00Z"
  },
  {
    "title": "MAGA figure tells Australian conservatives centre-right politicians 'betrayed' West",
    "description": "Benjamin Harnwell, the \"international editor\" of Steve Bannon's War Room podcast, said centre-right politicians have \"betrayed\" the West by supporting \"mass immigration\".",
    "link": "https://www.abc.net.au/news/2026-02-23/advance-lobby-group-conference-centre-right-mass-immigration/106371720",
    "timestamp": "2026-02-23T03:53:54Z"
  },
  {
    "title": "Donald Trump Sends a Message to Team USA Hockey After Gold Medal Win",
    "description": "Donald Trump responded publicly after Team USA secured a gold medal in men’s hockey at the 2026 Winter Olympics. Following the team’s overtime victory over Canada in Milan, the president shared a message congratulating the players and later spoke with them di…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_879142e9-f3b4-4632-9ce3-676ce24583bb",
    "timestamp": "2026-02-23T03:50:39Z"
  },
  {
    "title": "Trump set to build Australia’s tallest building, 91-storey, luxury hotels and residential towers, here’s everything you need to know about the mega project",
    "description": "The Trump family is set to build Australia's tallest tower in Surfers Paradise. This 91-storey Trump International Hotel Tower will be a landmark development. It will feature a luxury hotel and residences. The project signifies the Trump brand's expansion int…",
    "link": "https://economictimes.indiatimes.com/news/international/australia/trump-set-to-build-australias-tallest-building-91-storey-luxury-hotels-and-residential-towers-heres-everything-you-need-to-know-about-the-mega-project/articleshow/128697817.cms",
    "timestamp": "2026-02-23T03:46:24Z"
  },
  {
    "title": "Indian shares set to open higher after US Supreme Court scraps Trump tariffs",
    "description": "The US Supreme Court on Friday struck down Trump’s tariffs, deemed unconstitutional under a law meant for national emergencies, impacting global trade and the economy",
    "link": "https://www.thehindubusinessline.com/markets/indian-shares-set-to-open-higher-after-us-supreme-court-scraps-trump-tariffs/article70665525.ece",
    "timestamp": "2026-02-23T03:44:42Z"
  },
  {
    "title": "US futures fall while Asian markets are mostly higher after the Supreme Court nixes Trump's tariffs",
    "description": "U.S. futures are lower and Asian markets have climbed after the Supreme Court struck down most of President Donald Trump’s sweeping tariffs",
    "link": "https://abcnews.com/Business/wireStory/us-futures-fall-asian-markets-higher-after-supreme-130398435",
    "timestamp": "2026-02-23T03:42:10Z"
  },
  {
    "title": "US futures fall while Asian markets are mostly higher after the Supreme Court nixes Trump's tariffs",
    "description": "U.S. futures are lower and Asian markets have climbed after the Supreme Court struck down most of President Donald Trump’s sweeping tariffs",
    "link": "https://abcnews.com/US/wireStory/us-futures-fall-asian-markets-higher-after-supreme-130398434",
    "timestamp": "2026-02-23T03:42:09Z"
  },
  {
    "title": "What to know about killing of a powerful cartel leader in Mexico",
    "description": "Mexican forces have eliminated Nemesio Oseguera Cervantes, the leader of the Jalisco New Generation Cartel.  This significant operation triggered a wave of violence across Mexico.  Roads were blocked and people sought safety.  The killing is a major blow to d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-to-know-about-killing-of-a-powerful-cartel-leader-in-mexico/articleshow/128697592.cms",
    "timestamp": "2026-02-23T03:36:14Z"
  },
  {
    "title": "Miranda Devine: Dems will roll out their perfect agent of subterfuge, Abigail Spanberger, in response to SOTU",
    "description": "Abigail Spanberger, the new governor of Virginia who has been tapped to deliver the Democrats’ State of the Union reply Tuesday night, is the perfect avatar for her party’s deception.",
    "link": "https://nypost.com/2026/02/22/opinion/miranda-devine-dems-will-roll-out-their-perfect-agent-of-subterfuge-abigail-spanberger-in-response-to-sotu/",
    "timestamp": "2026-02-23T03:28:41Z"
  },
  {
    "title": "Indonesia joins BoP to free Palestine from Israel's grip: MPR Speaker",
    "description": "Indonesia&rsquo;s decision to join the Board of Peace is a step toward supporting Palestinian independence and ending Israeli control, Parliamentary Speaker ...",
    "link": "https://en.antaranews.com/news/405486/indonesia-joins-bop-to-free-palestine-from-israels-grip-mpr-speaker",
    "timestamp": "2026-02-23T03:27:44Z"
  },
  {
    "title": "Trump's latest 'particularly creepy' move alarms psychologist: 'Aggrandizing himself'",
    "description": "President Donald Trump's latest \"particularly creepy\" move alarmed a psychologist over the weekend. Dr. John Gartner, a psychologist and psychotherapist, discussed the Trump administration's decision to unfurl a massive banner with Trump's face on the Departm…",
    "link": "https://www.rawstory.com/trump-2675292720/",
    "timestamp": "2026-02-23T03:26:09Z"
  },
  {
    "title": "EU demands ‘full clarity’ from Trump on tariffs",
    "description": "The EU has urged US President Donald Trump not to impose new tariffs Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632914-eu-commission-trump-tariffs/",
    "timestamp": "2026-02-23T03:22:49Z"
  },
  {
    "title": "RI Govt denies easing halal rules for US goods",
    "description": "Cabinet Secretary Teddy Indra Wijaya dismissed claims that US products can enter Indonesia without halal certification, saying the reports are false and ...",
    "link": "https://en.antaranews.com/news/405482/ri-govt-denies-easing-halal-rules-for-us-goods",
    "timestamp": "2026-02-23T03:17:02Z"
  },
  {
    "title": "Volodymyr Zelensky to the BBC: “Vladimir Putin has already started World War Three — We will not hand over territory for a ceasefire”",
    "description": "The President of Ukraine rejects territorial concessions in Donetsk, Kherson, and Zaporizhzhia — calls for long-term U.S. security guarantees before elections\nThe post Volodymyr Zelensky to the BBC: “Vladimir Putin has already started World War Three — We wil…",
    "link": "https://en.protothema.gr/2026/02/23/volodymyr-zelensky-to-the-bbc-vladimir-putin-has-already-started-world-war-three-we-will-not-hand-over-territory-for-a-ceasefire/",
    "timestamp": "2026-02-23T03:11:26Z"
  }
]