[
  {
    "title": "A Very Different Constitutional Immunity Amendment",
    "description": "Today, Acting Deputy Attorney General Emil Bove instructed the Acting U.S. Attorney for SDNY to dismiss the indictment against New York City Mayor Eric",
    "link": "https://reason.com/volokh/2025/02/11/a-very-different-constitutional-immunity-amendment/",
    "timestamp": "2025-02-11T05:27:31Z"
  },
  {
    "title": "Why are Ukraine's minerals key to keeping US military aid flowing?",
    "description": "Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry, which could provide a valuable source of the rare earth elements that are essential for many kinds…",
    "link": "https://biztoc.com/x/465cf06d992c598e",
    "timestamp": "2025-02-11T05:27:26Z"
  },
  {
    "title": "Only One Big Economy Is Aiming for Paris Agreement’s 1.5C Goal",
    "description": "The UK is currently an outlier with an increasingly ambitious climate plan after more than 170 countries missed a UN deadline.",
    "link": "https://financialpost.com/pmn/business-pmn/only-one-big-economy-is-aiming-for-paris-agreements-1-5c-goal",
    "timestamp": "2025-02-11T05:25:18Z"
  },
  {
    "title": "Trump warns 'all hell' will break loose if Gaza hostages not returned",
    "description": "U.S. President Donald Trump warned Monday that \"all hell\" would break loose if every Israeli hostage is not released from Gaza within days, after Hamas threatened to postpone further exchanges under a fragile ceasefire deal it said Israel was violating.",
    "link": "https://www.hurriyetdailynews.com/trump-warns-all-hell-will-break-loose-if-gaza-hostages-not-returned-205675",
    "timestamp": "2025-02-11T05:23:52Z"
  },
  {
    "title": "Adam Bandt on par with Hitler? More muck from Murdoch media",
    "description": "Greens leader Adam Bandt is being compared to Hitler in the Murdoch media. Here's why passing off that kind of partisan hackery as 'opinion' is utter rot.",
    "link": "https://independentaustralia.net/business/business-display/adam-bandt-on-par-with-hitler-more-muck-from-murdoch-media,19428",
    "timestamp": "2025-02-11T05:21:31Z"
  },
  {
    "title": "What's behind the unabated rise of US dollar, and will it inflict more pain on Indian markets?",
    "description": "The US dollar has seen significant growth, hitting two-year highs and impacting emerging markets, particularly the Indian rupee, which is reaching record lows. Key factors include aggressive US tariff policies and a robust US economy. As foreign investors see…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/whats-behind-the-unabated-rise-of-us-dollar-and-will-it-inflict-more-pain-on-indian-markets/articleshow/118135197.cms",
    "timestamp": "2025-02-11T05:21:31Z"
  },
  {
    "title": "Why are Ukraine’s minerals key to keeping US military aid flowing?",
    "description": "KYIV, Ukraine (AP) — Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry, which could provide a valuable source of the rare earth elements that are ess…",
    "link": "https://financialpost.com/pmn/why-are-ukraines-minerals-key-to-keeping-us-military-aid-flowing",
    "timestamp": "2025-02-11T05:20:03Z"
  },
  {
    "title": "How Elon Musk's crusade against government could benefit Tesla",
    "description": "Elon Musk has long railed against the U.S. government, saying numerous investigations and safety programs have stymied Tesla, his electric car company, and its efforts to create fleets of robotaxis and other self-driving automobiles",
    "link": "https://abcnews.go.com/Technology/wireStory/elon-musks-crusade-government-benefit-tesla-118679175",
    "timestamp": "2025-02-11T05:18:30Z"
  },
  {
    "title": "Spain urges EU to double budget, brace for Trump",
    "description": "MADRID - The complex global geopolitical context following the return to power of US President Donald Trump calls for “a more ambitious and bolder European budget” of “at least” 2% of annual GDP, Pedro Sánchez's government said in a statement on Monday.\nPedro…",
    "link": "https://biztoc.com/x/9bf7e9e3ccdb4f8d",
    "timestamp": "2025-02-11T05:16:34Z"
  },
  {
    "title": "Google has dropped its promise not to use AI for weapons. It's part of a troubling trend",
    "description": "In an update to its 2018 AI principles, the tech giant removed commitments not to pursue certain actions related to safety and weapons. This update followed the revocation of former President Joe Biden's executive order, aimed at promoting the safe, secure, a…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/google-has-dropped-its-promise-not-to-use-ai-for-weapons-its-part-of-a-troubling-trend/articleshow/118135016.cms",
    "timestamp": "2025-02-11T05:16:08Z"
  },
  {
    "title": "Iran loosens import restrictions on foreign cars and iPhones, trying to mask its economic woes",
    "description": "All architecture student Amirhossein Azizi wanted for his 19th birthday was the latest iPhone — and for Iran's cash-strapped theocracy, it was just the gift ...",
    "link": "https://finance.yahoo.com/news/iran-loosens-import-restrictions-foreign-051341554.html",
    "timestamp": "2025-02-11T05:13:41Z"
  },
  {
    "title": "How Elon Musk’s crusade against government could benefit Tesla",
    "description": "WASHINGTON (AP) — Elon Musk has long railed against the U.S. government, saying a crushing number of federal investigations and safety programs have stymied Tesla, his electric car company, and its efforts to create fleets of robotaxis and other self-driving …",
    "link": "https://financialpost.com/pmn/how-elon-musks-crusade-against-government-could-benefit-tesla",
    "timestamp": "2025-02-11T05:12:21Z"
  },
  {
    "title": "Trump's education chief comes from the boardroom, not the classroom. Backers say that's her strength",
    "description": "Linda McMahon once described herself as an outsider stepping into the world of education, a business leader with an “inquiring mind” who would challenge the status quo and demand more for students",
    "link": "https://abcnews.go.com/US/wireStory/trumps-education-chief-boardroom-classroom-backers-strength-118679176",
    "timestamp": "2025-02-11T05:11:06Z"
  },
  {
    "title": "Trump will host Jordan's King Abdullah II as he escalates pressure on his Gaza resettlement plan",
    "description": "President Donald Trump will host Jordan’s King Abdullah II at the White House as he escalates pressure on the Arab nation to take in refugees from Gaza as part of his audacious plan to remake the Middle East",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-host-jordans-king-abdullah-ii-escalates-pressure-118679172",
    "timestamp": "2025-02-11T05:10:57Z"
  },
  {
    "title": "Crude oil futures rise as Russian output falls in January",
    "description": "At 9.57 am on Tuesday, April Brent oil futures were at $76.14, up by 0.36%, and March crude oil futures on WTI (West Texas Intermediate) were at $72.56, up by 0.33%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-russian-output-falls-in-january/article69205436.ece",
    "timestamp": "2025-02-11T05:08:13Z"
  },
  {
    "title": "Trump’s following his campaign promises, but they’re threatening the rule of law | CNN Politics",
    "description": "Every day, Donald Trump shatters previous understandings of presidency and America’s role in the world.",
    "link": "https://www.cnn.com/2025/02/11/politics/trump-threaten-rule-of-law-analysis/index.html",
    "timestamp": "2025-02-11T05:07:47Z"
  },
  {
    "title": "John Oliver Makes Surprise Appearance on ‘The Daily Show’ to ‘Gloat’ About Trump Ushering in America’s ‘Monarchy Era’: ‘Kings Get S–t Done’",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart’s ex-correspondent, John Oliver, made a surprise appearance to “gloat” about Donald Trump ushering in America’s “monarchy era” with his unprecedented use of executive authority. After failing to identify…",
    "link": "https://variety.com/2025/tv/news/the-daily-show-john-oliver-jon-stewart-donald-trump-monarchy-1236303441/",
    "timestamp": "2025-02-11T05:07:33Z"
  },
  {
    "title": "What to know about proposals to ban abortion pills and punish women who seek abortion",
    "description": "Lawmakers in some states are pushing measures to crack down on abortion pills or penalize women who obtain abortions. Some of the efforts appear to be stalled this year. It's too early to tell whether others will gain momentum. Several states have banned abor…",
    "link": "https://www.seattlepi.com/news/politics/article/what-to-know-about-proposals-to-ban-abortion-20160014.php",
    "timestamp": "2025-02-11T05:07:14Z"
  },
  {
    "title": "In Breaking USAID, the Trump Administration May Have Broken the Law",
    "description": "By Anna Maria Barry-Jester and Brett Murphy | - ( ProPublica ) - It was the week President Donald Trump had signed a sweeping executive order shutting off the funding for foreign aid programs. Inside the U.S. Agency for International Development, his politica…",
    "link": "https://www.juancole.com/2025/02/breaking-administration-broken.html",
    "timestamp": "2025-02-11T05:06:02Z"
  },
  {
    "title": "Trump tariffs are 'punitive,' former U.S. ambassador to Singapore says, warning of U.S. job losses",
    "description": "Tariffs proposed by U.S. President Donald Trump are not simply symbolic, but are punitive and will \"cost jobs\" in the U.S., according to Frank Lavin, former U.S. ambassador to Singapore.\nSpeaking to CNBC's \"Street Signs Asia,\" Lavin said that \"we're in for a …",
    "link": "https://biztoc.com/x/8de3992780352b49",
    "timestamp": "2025-02-11T05:05:28Z"
  },
  {
    "title": "Trump’s Eye-for-Eye Tariff Threat Puts India, Thailand at Risk",
    "description": "Economists at global banks from Morgan Stanley to Nomura Holdings Inc. have identified India and Thailand as among the nations most exposed to risks from President Donald Trump’s vow to impose reciprocal tariffs on trading partners.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-eye-for-eye-tariff-threat-puts-india-thailand-at-risk",
    "timestamp": "2025-02-11T05:05:17Z"
  },
  {
    "title": "Trump Tariffs Spell Fresh Turmoil for Volatile Aluminum Market",
    "description": "The global aluminum market is entering a fresh period of upheaval as traders rush to assess the potential impact of renewed US protectionism under President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-spell-fresh-turmoil-for-volatile-aluminum-market",
    "timestamp": "2025-02-11T05:05:08Z"
  },
  {
    "title": "Trump Ends Paper Straw Rule, Brings Back Plastic Straws",
    "description": "US President Donald Trump has signed an order to stop the government from replacing plastic straws with paper ones.This decision reverses a rule from former President Joe Biden, who wanted to reduce plastic pollution.Trump, who sold plastic straws during his …",
    "link": "https://english.gossiplankanews.com/2025/02/trump-ends-paper-straw-rule-brings-back.html",
    "timestamp": "2025-02-11T05:05:00Z"
  },
  {
    "title": "Spain urges EU to double budget, brace for Trump",
    "description": "Sánchez could soon present his plan to partners in Brussels.",
    "link": "https://www.euractiv.com/section/politics/news/spain-urges-eu-to-double-budget-brace-for-trump/",
    "timestamp": "2025-02-11T05:03:57Z"
  },
  {
    "title": "People from Ontario cancelling U.S. travel plans over political tensions",
    "description": "Even if Donald Trump postponed applying stiff tariffs to all Canadian goods for now, many people in Ontario and across the country are dismayed enough by the U.S. President's show of animosity that they are still vowing to boycott American products and servic…",
    "link": "https://www.blogto.com/travel/2025/02/ontario-cancelling-us-travel-plans-tensions/",
    "timestamp": "2025-02-11T05:03:00Z"
  },
  {
    "title": "Trump says he is considering tariff exemptions on Australian steel and aluminum",
    "description": "U.S. President Donald Trump says he has agreed to consider a tariff exemption on Australian steel and aluminum imports after a telephone conversation with Australia’s prime minister",
    "link": "https://abcnews.go.com/Business/wireStory/trump-tariff-exemptions-australian-steel-aluminum-118673078",
    "timestamp": "2025-02-11T05:02:14Z"
  },
  {
    "title": "Gaza: The Trump family's Middle East business interests",
    "description": "US News: US President Donald Trump's comments on February 4 about Gaza revived an idea previously touted by both him and his son-in-law, Jared Kushner.",
    "link": "https://timesofindia.indiatimes.com/world/us/gaza-the-trump-familys-middle-east-business-interests/articleshow/118133997.cms",
    "timestamp": "2025-02-11T05:01:02Z"
  },
  {
    "title": "The rundown: How Trump’s tariffs could put marketers in a recession frame of mind",
    "description": "Marketers planning around potential tariffs have a tough choice to make: spend less, or spend your way through.",
    "link": "http://digiday.com/marketing/the-rundown-how-trumps-tariffs-could-put-marketers-in-a-recession-frame-of-mind/",
    "timestamp": "2025-02-11T05:01:00Z"
  },
  {
    "title": "How U.K.-based creators took advantage of the U.S. TikTok outage",
    "description": "In the week following the United States’ Jan. 19 TikTok outage — the seven days between Jan. 19 and Jan. 25 — video creators in the U.K. posted 15 percent more content than they did during the seven days leading up to the ban.",
    "link": "http://digiday.com/media/how-u-k-based-creators-took-advantage-of-the-u-s-tiktok-outage/",
    "timestamp": "2025-02-11T05:01:00Z"
  },
  {
    "title": "The Threat Behind Trump’s Praise of McKinley & Roosevelt",
    "description": "The president says he wants to be peacemaker—but his heroes were warmongers. \nThe post The Threat Behind Trump’s Praise of McKinley & Roosevelt appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-threat-behind-trumps-praise-of-mckinley-roosevelt/",
    "timestamp": "2025-02-11T05:01:00Z"
  },
  {
    "title": "Make The Ukraine Truce, Then Cut Europe Loose",
    "description": "Exactly 177 days after being sworn to office, America’s greatest peace president, Dwight D. Eisenhower, announced that the demolition derby on the Korean peninsula would be halted, and that an armistice would prevail henceforth – which armistice remains in pl…",
    "link": "https://original.antiwar.com/david_stockman/2025/02/10/make-the-ukraine-truce-then-cut-europe-loose/",
    "timestamp": "2025-02-11T05:00:51Z"
  },
  {
    "title": "With billions at stake, Trump administration scrubs federal chips contracts for words like ‘diversity’ and ‘immigrant’ | CNN Politics",
    "description": "The Trump White House is demanding that government workers hunt for words like “immigrant” and “diversity” in billions of dollars worth of federal contracts with American companies to boost domestic semiconductor manufacturing, raising concerns among staff th…",
    "link": "https://www.cnn.com/2025/02/11/politics/trump-chips-contracts/index.html",
    "timestamp": "2025-02-11T05:00:47Z"
  },
  {
    "title": "The Gaza ‘War’ Was a Lie, as Is the Ceasefire. Trump Just Told You",
    "description": "Israeli Prime Minister Benjamin Netanyahu’s visit to the White House this week tore the mask off 16 months of gaslighting by western leaders and by the entirety of the western establishment media. United States President Donald Trump finally dropped Washingto…",
    "link": "https://original.antiwar.com/cook/2025/02/10/the-gaza-war-was-a-lie-as-is-the-ceasefire-trump-just-told-you/",
    "timestamp": "2025-02-11T05:00:33Z"
  },
  {
    "title": "France and EU promise to cut red tape on artificial intelligence technology",
    "description": "European lawmakers last year approved the bloc's artificial intelligence law, the world's first comprehensive set of rules governing the technology.",
    "link": "https://www.japantimes.co.jp/business/2025/02/11/tech/ai-france-eu-red-tape-tech/",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "There is no Execulative Branch",
    "description": "A tweet on X announced a new billboard on I-95 that proclaims “There Is No 4th Branch of Government Called ‘Elon Musk!’”\r\n\r\n\r\nWe got the billboard up on i95. Hat tip to @jamie_raskin Please chip in. https://t.co/tLqBQPT6ep pic...",
    "link": "https://www.americanthinker.com/blog/2025/02/there_is_no_execulative_branch.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Trump is just the tip of the iceberg",
    "description": "…as the ship of the Deep State crashes into it and starts to sink. Lurking below the Trump figurehead is the basic essence of American culture: personal freedom. We became a nation so we could avoid being dominated by hereditary tyrants. Now w...",
    "link": "https://www.americanthinker.com/blog/2025/02/trump_is_just_the_tip_of_the_iceberg.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Breathless in America",
    "description": "I am breathless, humbled and excited -- Christmas morning excited. I’ve been around for a long time, and I’ve paid attention to politics ever since Eisenhower, but I’ve never seen anything like Trump’s opening gambit. I h...",
    "link": "https://www.americanthinker.com/articles/2025/02/breathless_in_america.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "The Debt Ceiling: Trump's Next Target?",
    "description": "The biggest impact of Donald Trump’s brief second term has resulted from the DOGE investigations into federal government spending -- particularly the wasteful and unauthorized spending of USAID. The headlines have exploded over social media and...",
    "link": "https://www.americanthinker.com/articles/2025/02/the_debt_ceiling_trump_s_next_target.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Democrat threatens to shut down the government if Elon Musk and DOGE continue to ‘undermine the American people’",
    "description": "Oh this is just too good—Democrats are now threatening to shut down the government and withhold funding if Elon Musk and DOGE continue to operate because as they’ve said time and again, “Nobody voted for Elon Musk.”\r\n\r\nExcept ...",
    "link": "https://www.americanthinker.com/articles/2025/02/democrat_threatens_to_shut_down_the_government_if_elon_musk_and_doge_continue_to_undermine_the_american_people.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Trump FTC Must Stop Biden’s Prescription Drug Madness",
    "description": "Photo Credit:Image via Pixabay.\r\n\n\n \n PixabayPharmacy Benefit Managers improve market efficiency and save consumers money, but in Biden’s world, they’re another politically convenient culprit behind the runaway inflation of the last four years.",
    "link": "https://www.americanthinker.com/articles/2025/02/trump_ftc_must_stop_biden_s_prescription_drug_madness.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "After USAID, America Will Never Be the Same",
    "description": "Did you notice something in the last week? Our liberal friends perked up and found themselves a new enemy. Previously, every card-carrying liberal knew that Donald Trump was the enemy. But that was before the midnight raid on USAID under Commando Bro...",
    "link": "https://www.americanthinker.com/articles/2025/02/after_usaid_america_will_never_be_the_same.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Democrat threatens to shut down the government if Elon Musk and DOGE continue to ‘undermine the American people’",
    "description": "Oh this is just too good—Democrats are now threatening to shut down the government and withhold funding if Elon Musk and DOGE continue to operate because as they’ve said time and again, “Nobody voted for Elon Musk.”\r\n\r\nExcept ...",
    "link": "https://www.americanthinker.com/blog/2025/02/democrat_threatens_to_shut_down_the_government_if_elon_musk_and_doge_continue_to_undermine_the_american_people.html",
    "timestamp": "2025-02-11T05:00:00Z"
  },
  {
    "title": "Trump tariffs are 'punitive,' former U.S. ambassador to Singapore says, warning of U.S. job losses",
    "description": "Lavin said that \"we're in for a bit of bad news in the near term,\" adding that the tariffs will also hurt the auto industry in the U.S.",
    "link": "https://www.cnbc.com/2025/02/11/trump-tariffs-are-punitive-former-us-ambassador-to-singapore-says-warns-of-us-job-losses.html",
    "timestamp": "2025-02-11T04:59:33Z"
  },
  {
    "title": "US Congressman Ro Khanna highlights 'bipartisan' India-US ties, points to 'regional challenges' due to China",
    "description": "Prime Minister Modi will meet President Trump to strengthen US-India relations. The focus will be on military cooperation, challenges from China's regional expansion, and collaboration in scientific research and renewable energy. PM Modi is currently in Franc…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-congressman-ro-khanna-highlights-bipartisan-india-us-ties-points-to-regional-challenges-due-to-china/articleshow/118134549.cms",
    "timestamp": "2025-02-11T04:56:03Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures slide as Trump orders new tariffs",
    "description": "In This Article:\nUS stock futures inched lower as investors digested President Donald Trump's announcement of 25% tariffs on global steel and aluminum imports.\nFutures attached to the S&P 500 (ES=F) slipped 0.2%, while Dow futures (YM=F) fell 0.1%, and Nasdaq…",
    "link": "https://biztoc.com/x/a73212c31990f514",
    "timestamp": "2025-02-11T04:54:13Z"
  },
  {
    "title": "With Firings And Lax Enforcement, Trump Moving To Dismantle Government's Public Integrity Guardrails",
    "description": "Trump has moved with brazen haste to dismantle the federal government’s public integrity guardrails that he frequently tested during his first term.",
    "link": "https://www.huffpost.com/entry/trump-public-integrity-dismantle_n_67aad51de4b038077c88374d",
    "timestamp": "2025-02-11T04:52:25Z"
  },
  {
    "title": "South Korea's top think tank lowers economic growth projection, citing Trump's tariffs",
    "description": "SEOUL: South Korea’s top economic think tank slashed its growth forecast for the country’s economy for the second time in four months on Tuesday (Feb 11), expressing concern about the impact of US President Donald Trump’s expanding tariffs. The Korea Developm…",
    "link": "https://www.channelnewsasia.com/east-asia/south-koreas-top-think-tank-lowers-economic-growth-projection-citing-trumps-tariffs-4930021",
    "timestamp": "2025-02-11T04:52:18Z"
  },
  {
    "title": "Donald Trump suggests Ukraine 'may be Russian someday'",
    "description": "Donald Trump, in a Fox News interview, suggested Ukraine might \"someday be Russian\" and proposed the US trade its aid for Ukraine's natural resources, like rare minerals. He emphasized that the US should get something in return for its financial involvement, …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-suggests-ukraine-may-be-russian-someday-interview/articleshow/118134383.cms",
    "timestamp": "2025-02-11T04:50:43Z"
  },
  {
    "title": "SEAN HANNITY: How certain are you that the ICE raid leaks are coming from the FBI?",
    "description": "TOM HOMAN: The Deputy Attorney General believes the leaks are coming from the FBI and he opened a criminal investigation. HOLY CRAP TREASON",
    "link": "https://freerepublic.com/focus/f-chat/4296629/posts",
    "timestamp": "2025-02-11T04:50:12Z"
  },
  {
    "title": "Stocks Fall, Dollar Strengthens on Trump Tariffs: Markets Wrap",
    "description": "(Bloomberg) -- Asian equities and US stock index futures fell while the dollar and gold rallied in a sign of investor caution after President Donald Trump...",
    "link": "https://finance.yahoo.com/news/asian-stocks-set-gain-us-222249169.html",
    "timestamp": "2025-02-11T04:49:12Z"
  },
  {
    "title": "Pete Hegseth Moves to Restore Fort Bragg's Name, But With Key Difference",
    "description": "Hegseth said \"Fort Bragg is back,\" in a post seemingly implying the name still honors the Confederate general after which it was originally named.",
    "link": "https://www.newsweek.com/pete-hegseth-moves-restore-fort-braggs-name-key-difference-2029188",
    "timestamp": "2025-02-11T04:47:00Z"
  },
  {
    "title": "Venezuela sends 2 planes to US to return migrants, signaling a potential improvement in relations",
    "description": "Two Venezuelan planes have returned home with about 190 Venezuelans deported from the United States",
    "link": "https://abcnews.go.com/US/wireStory/venezuela-sends-2-planes-us-return-migrants-signaling-118669720",
    "timestamp": "2025-02-11T04:46:17Z"
  },
  {
    "title": "North Korea warns of retaliation after US nuclear submarine docks in Busan",
    "description": "Pyongyang warns of 'acute military confrontation' after USS Alexandria submarine docks in South Korean port.",
    "link": "https://www.aljazeera.com/news/2025/2/11/north-korea-warns-of-retaliation-after-us-nuclear-submarine-docks-in-busan",
    "timestamp": "2025-02-11T04:46:12Z"
  },
  {
    "title": "Global gold hits record in volatile session as Trump fans haven demand",
    "description": "<p>Global gold endured a volatile few hours&rsquo; trading &mdash; rallying to a record, then paring gains &mdash; after President Donald Trump imposed tariffs on US steel and aluminum imports, adding to uncertainty in global markets.</p>",
    "link": "https://www.bangkokpost.com/business/general/2958781/global-gold-hits-record-in-volatile-session-as-trump-fans-haven-demand",
    "timestamp": "2025-02-11T04:44:00Z"
  },
  {
    "title": "Trump orders closure of Federal Executive Institute",
    "description": "United States President Donald Trump signed an executive order to eliminate the Federal Executive Institute, a center for training government bureaucrats founded in 1968.Trump stated the institute's e...",
    "link": "https://biztoc.com/x/378c4366d935a0b8",
    "timestamp": "2025-02-11T04:43:10Z"
  },
  {
    "title": "Minister says B.C. aluminum smelter confident it will find non-U.S. aluminum buyers",
    "description": "The operators of the B.C. Works aluminum smelter in the province's north are confident it will find non-U. S. markets for its product, the minister co-ordinating British Columbia's response to tariff threats from the United States said Monday.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/aluminum-smelter-us-tariffs-1.7455814",
    "timestamp": "2025-02-11T04:43:04Z"
  },
  {
    "title": "Dem Rep. John Larson Freezes on House Floor in Medical Emergency Scare",
    "description": "Connecticut Rep. John Larson froze during a speech on the House floor Monday in what his office is calling an “adverse reaction” to a medication. Larson, 76, had been criticizing how Elon Musk and his subordinates in the Department of Government Efficiency (D…",
    "link": "https://freerepublic.com/focus/f-news/4296627/posts",
    "timestamp": "2025-02-11T04:42:45Z"
  },
  {
    "title": "‘They’re Sick People’: Trump Hits Dems’ Major Loss In Confidence, Says New Term ‘Much Different’ Second Time",
    "description": "Trump told Mark Levin Democrats have had a major loss in confidence due to his win, adding that his second term has been \"much different.\"",
    "link": "https://dailycaller.com/2025/02/10/donald-trump-democrats-loss-mark-levin-second-term/",
    "timestamp": "2025-02-11T04:39:59Z"
  },
  {
    "title": "Carney blames U.S. aggression toward Canada on social inequality down south",
    "description": "Federal Liberal leadership candidate Mark Carney blamed U.S. aggression toward Canada on social inequality in our neighbour to the south — and compared Donald Trump's musings about annexation to the villain from the Harry Potter novels.",
    "link": "https://www.cbc.ca/news/canada/manitoba/carney-liberal-winnipeg-rempel-garner-1.7455824",
    "timestamp": "2025-02-11T04:37:05Z"
  },
  {
    "title": "Trump announces 25% tariffs on all steel and aluminium imports",
    "description": "Trump announces 25% tariffs on all steel and aluminium imports\nPresident Donald Trump has ordered a 25% import tax on all steel and aluminium entering the US in a major expansion of existing trade barriers.\nThe tariffs, which will increase the costs of import…",
    "link": "https://biztoc.com/x/2e520901cbaf747b",
    "timestamp": "2025-02-11T04:32:38Z"
  },
  {
    "title": "With the Woodside share price down 21% in a year, should you buy more?",
    "description": "Is the ASX 200 oil and gas stock now trading for a bargain?\nThe post With the Woodside share price down 21% in a year, should you buy more? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/02/11/with-the-woodside-share-price-down-21-in-a-year-should-you-buy-more/",
    "timestamp": "2025-02-11T04:32:30Z"
  },
  {
    "title": "Markets open lower as metal stocks slump on US tariff concerns; Rupee hits record low",
    "description": "The benchmark BSE Sensex was trading at 77,187.89, down 123.91 points or 0.16 per cent in early trade, while the broader NSE Nifty declined 43 points or 0.18 per cent to 23,338.60",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-open-lower-as-metal-stocks-slump-on-us-tariff-concerns-rupee-hits-record-low/article69205413.ece",
    "timestamp": "2025-02-11T04:32:00Z"
  },
  {
    "title": "CONFIRMED: Former DNC Donor/Fundraiser Says Joe Biden’s Presidency ‘Was for Sure Obama’s Third Term’ (VIDEO)",
    "description": "Former DNC donor and fundraiser Lindi Li has been in the news repeatedly since the 2024 election. She is one of the loudest voices calling out the Democrat party and the Kamala Harris campaign for blowing through more than a billion dollars and losing, with n…",
    "link": "https://freerepublic.com/focus/f-bloggers/4296624/posts",
    "timestamp": "2025-02-11T04:26:55Z"
  },
  {
    "title": "Watch: PM Modi Shares Light Moment With JD Vance Ahead Of US Visit",
    "description": "Prime Minister Narendra Modi, who is in Paris to attend the Artificial Intelligence (AI) Summit, met with US Vice President JD Vance during a dinner at the Elysee Palace hosted by French President Emmanuel Macron.",
    "link": "https://www.ndtv.com/world-news/watch-pm-narendra-modi-shares-light-moment-with-jd-vance-in-france-ahead-of-us-visit-7683057",
    "timestamp": "2025-02-11T04:25:04Z"
  },
  {
    "title": "South Korea’s top think tank lowers economic growth projection, citing Trump’s tariffs",
    "description": "SEOUL, South Korea (AP) — South Korea’s top economic think tank slashed its growth forecast for the country’s economy for the second time in four months on Tuesday, expressing concern about the impact of U.S. President Donald Trump’s expanding tariffs. The Ko…",
    "link": "https://financialpost.com/pmn/south-koreas-top-think-tank-lowers-economic-growth-projection-citing-trumps-tariffs",
    "timestamp": "2025-02-11T04:23:07Z"
  },
  {
    "title": "Judge temporarily reinstates fired ethics watchdog",
    "description": "A federal judge Monday granted a temporary reprieve to the head of the Office of Special Counsel who filed a lawsuit claiming he was illegally fired by President Donald Trump.\nHampton Dellinger, the head of the agency, filed the federal lawsuit Monday after r…",
    "link": "https://biztoc.com/x/49b8680ab46aafce",
    "timestamp": "2025-02-11T04:21:03Z"
  },
  {
    "title": "Moscow waits for clarity on Trump’s Gaza plan",
    "description": "Kremlin spokesperson says Russia is awaiting further details regarding US President Donald Trump's proposal to purchase the Gaza Strip.",
    "link": "https://www.israelnationalnews.com/news/403734",
    "timestamp": "2025-02-11T04:18:13Z"
  },
  {
    "title": "Trump threatens to ‘let hell break out’ in Gaza",
    "description": "US President Donald Trump has issued a stern ultimatum to Hamas, demanding the release of all remaining hostages held in Gaza by Saturday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612488-trump-gaza-hell-break-out/",
    "timestamp": "2025-02-11T04:18:00Z"
  },
  {
    "title": "Alan Dershowitz Says Many ‘Improper’ Injunctions Against Trump Executive Orders Will Get Tossed",
    "description": "Alan Dershowitz predicted many of the injunctions blocking actions by President Donald Trump would be thrown out on appeal or by the Supreme Court.",
    "link": "https://dailycaller.com/2025/02/10/alan-dershowitz-says-many-improper-injunctions-against-trump-executive-orders-will-get-tossed/",
    "timestamp": "2025-02-11T04:16:41Z"
  },
  {
    "title": "‘Let Me Explain It a Little Bit More Slowly’: Abby Phillip Gets Fed Up With Scott Jennings for Claiming Trump Can Defy Court Orders",
    "description": "\"You don't have to talk to me like that.\"\nThe post ‘Let Me Explain It a Little Bit More Slowly’: Abby Phillip Gets Fed Up With Scott Jennings for Claiming Trump Can Defy Court Orders first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/let-me-explain-it-a-little-bit-more-slowly-abby-phillip-gets-fed-up-with-scott-jennings-for-claiming-trump-can-defy-court-orders/",
    "timestamp": "2025-02-11T04:16:38Z"
  },
  {
    "title": "Report: Steve Bannon Lawyers in Talks with Prosecutors for Plea Deal in Border Wall Fraud Case",
    "description": "Lawyers for former White House chief strategist Stephen K. Bannon are reportedly in talks with prosecutors regarding a potential plea deal in a case accusing Bannon of defrauding donors in an effort to build a border wall, according to several reports.\nThe po…",
    "link": "https://www.breitbart.com/politics/2025/02/10/report-steve-bannon-lawyers-talks-prosecutors-plea-deal-border-wall-fraud-case/",
    "timestamp": "2025-02-11T04:16:13Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events – day 1,083",
    "description": "Here are the key developments on the 1,083rd day of Russia’s full-scale invasion of Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/2/11/russia-ukraine-war-list-of-key-events-day-one-thousand-eighty-three",
    "timestamp": "2025-02-11T04:15:17Z"
  },
  {
    "title": "Guillermo del Toro Praises DGA Winner & Oscar Nominee ‘Porcelain War’ And Predicts Dark Times Ahead For Artists",
    "description": "EXCLUSIVE: “Ukraine is like Pocelain. Easy to break but impossible to destroy”. That is a line from the Oscar nominated documentary feature, Porcelain War which just won the Documentary Feature award for directors Brendan Bellomo and Slava Leontyev, the latte…",
    "link": "http://deadline.com/2025/02/guillermo-del-toro-praises-dga-winner-amp-oscar-nominee-porcelain-war-predicts-dark-times-ahead-1236285140/",
    "timestamp": "2025-02-11T04:14:20Z"
  },
  {
    "title": "Whether we carve out an exemption or not, Trump’s latest tariffs will still hit Australia",
    "description": "The world economy, and Australians, will be affected by Trump’s latest round of tariffs.",
    "link": "https://theconversation.com/whether-we-carve-out-an-exemption-or-not-trumps-latest-tariffs-will-still-hit-australia-249493",
    "timestamp": "2025-02-11T04:13:36Z"
  },
  {
    "title": "\"Won't Affect A Shark\": Trump Signs Order To Bring Back Plastic Straws In US",
    "description": "US President Donald Trump signed an executive order on Monday pushing for a return to plastic drinking straws, saying their impact on marine life was limited.",
    "link": "https://www.ndtv.com/world-news/wont-affect-a-shark-trump-signs-order-to-bring-back-plastic-straws-in-us-7682989",
    "timestamp": "2025-02-11T04:10:38Z"
  },
  {
    "title": "Donald Trump Eases Enforcement Of US Law Banning Overseas Bribes",
    "description": "President Donald Trump signed an executive order rolling back enforcement of a law that bars US companies from bribing foreign officials, arguing that the restriction puts American firms at a disadvantage.",
    "link": "https://www.ndtv.com/world-news/donald-trump-eases-enforcement-of-us-law-banning-overseas-bribes-7682960",
    "timestamp": "2025-02-11T04:09:28Z"
  },
  {
    "title": "Justice Department orders New York Mayor Eric Adams charges to be withdrawn",
    "description": "NEW YORK: The Justice Department on Monday (Feb 10) directed federal prosecutors in New York to drop corruption charges against New York Mayor Eric Adams, an extraordinary intervention by a political appoint",
    "link": "https://www.channelnewsasia.com/world/justice-department-orders-new-york-mayor-eric-adams-charges-be-withdrawn-4929751",
    "timestamp": "2025-02-11T04:07:00Z"
  },
  {
    "title": "Judge temporarily reinstates fired ethics watchdog",
    "description": "Hampton Dellinger filed a lawsuit claiming President Donald Trump illegally dismissed him last week.",
    "link": "https://www.nbcnews.com/politics/politics-news/judge-temporarily-reinstates-fired-ethics-watchdog-hampton-dellinger-rcna191614",
    "timestamp": "2025-02-11T04:06:33Z"
  },
  {
    "title": "'Back to plastic': Trump signs order for plastic straws as he declares paper ones 'don’t work'",
    "description": "President Donald Trump says he is banning federal use of paper straws, saying they “don’t work” and don’t last very long",
    "link": "https://abcnews.go.com/Technology/wireStory/back-plastic-trump-signs-order-plastic-straws-declares-118669815",
    "timestamp": "2025-02-11T04:06:26Z"
  },
  {
    "title": "Trump names loyalist Ric Grenell interim boss of Kennedy Center (Seb Starcevic/Politico)",
    "description": "Seb Starcevic / Politico:\nTrump names loyalist Ric Grenell interim boss of Kennedy Center  —  Grenell held several posts during Trump's first term, including ambassador to Germany.  —  President Donald Trump named foreign policy adviser and loyalist Richard G…",
    "link": "https://www.memeorandum.com/250210/p166",
    "timestamp": "2025-02-11T04:05:01Z"
  },
  {
    "title": "Seth Meyers: Trump and Musk Lash Out After Judge Blocks DOGE Takeover, Musk Targets CFPB",
    "description": "Seth takes a closer look at “President” Elon Musk calling for a judge to be impeached after blocking Musk’s access to Americans' personal data, while Musk’s second in command, New York businessman Donald Trump, claimed Musk has nothing to gain from dismantlin…",
    "link": "https://littlegreenfootballs.com/article/54384_Seth_Meyers-_Trump_and_Musk_La",
    "timestamp": "2025-02-11T04:04:00Z"
  },
  {
    "title": "'Bragg Is Back!': Defense Secretary Pete Hegseth Renames 'Fort Bragg' After Biden Named It 'Fort Liberty'",
    "description": "Defense Secretary Pete Hegseth on Monday while on a C-17 aircraft en route to Germany signed a memorandum renaming \"Fort Liberty\" back to \"Fort Bragg\" — the original name of the storied military base in North Carolina.\nThe post ‘Bragg Is Back!’: Defense Secre…",
    "link": "https://www.breitbart.com/politics/2025/02/10/pete-hegseth-renames-fort-bragg-biden-named-fort-liberty/",
    "timestamp": "2025-02-11T04:03:15Z"
  },
  {
    "title": "Back to plastic: Trump announces US policy ‘to end the use of paper straws’",
    "description": "President Donald Trump issued an executive order Monday declaring that it is “the policy of the United States to end the use of paper straws.”\n\n\nFormer President Joe Biden’s administration, in an attempt to phase out federal purchases of single-use plastics, …",
    "link": "https://www.voanews.com/a/back-to-plastic-trump-announces-us-policy-to-end-the-use-of-paper-straws-/7970362.html",
    "timestamp": "2025-02-11T04:01:41Z"
  },
  {
    "title": "As the Gaza Agenda Moves Forward, the Imperial Narrative Shifts With It",
    "description": "White House Press Secretary Karoline Leavitt acted shocked and appalled by questions from reporters about Trump’s ethnic cleansing plan for Gaza on Wednesday, saying it was “evil” to suggest that these poor victims of Israel’s destruction should be allowed to…",
    "link": "https://www.lewrockwell.com/2025/02/no_author/as-the-gaza-agenda-moves-forward-the-imperial-narrative-shifts-with-it/",
    "timestamp": "2025-02-11T04:01:00Z"
  },
  {
    "title": "Sensex falls over 200 pts, Nifty below 23,350; bank and auto stocks drag",
    "description": "Indian benchmark equity indices Sensex and Nifty declined for the fifth day in a row due to weak global sentiment, particularly in banking and auto stocks. Both indices have dropped 1.5% over the past four sessions, influenced by US tariff uncertainties and f…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-23350-bank-and-auto-stocks-drag/articleshow/118132851.cms",
    "timestamp": "2025-02-11T04:00:14Z"
  },
  {
    "title": "John Oliver Returns to ‘The Daily Show’ to ‘Gloat’ That Trump Turned America Into Monarchy | Video",
    "description": "The former cast member joins Jon Stewart for a discussion of how corrupt things have become just a month into Trump's second term\nThe post John Oliver Returns to ‘The Daily Show’ to ‘Gloat’ That Trump Turned America Into Monarchy | Video appeared first on The…",
    "link": "https://www.thewrap.com/john-oliver-the-daily-show-jon-stewart-trump-monarchy/",
    "timestamp": "2025-02-11T04:00:05Z"
  },
  {
    "title": "John Oliver Returns To ‘The Daily Show’ To Gloat About America Entering Its “Monarchy Era”",
    "description": "John Oliver is back on The Daily Show, ten years after he left and just as America is entering an era that feels a lot like monarchy. Oliver joined his old friend Jon Stewart on tonight’s show to “gloat” about this fact, and welcome the country into its new p…",
    "link": "http://deadline.com/2025/02/john-oliver-the-daily-show-return-1236285130/",
    "timestamp": "2025-02-11T04:00:00Z"
  },
  {
    "title": "Fox Says Super Bowl LIX Hit Record Viewership",
    "description": "Fox Sports is projecting a Super Bowl record average audience of 126 million U.S. viewers across television and streaming platforms.",
    "link": "https://time.com/7216501/super-bowl-lix-2025-viewership-record-fox-tv-streaming-audience/",
    "timestamp": "2025-02-11T04:00:00Z"
  },
  {
    "title": "Google changes name of Gulf of Mexico to 'Gulf of America' for U.S. users",
    "description": "Google on Monday changed the name of the Gulf of Mexico to &quot;Gulf of America&quot; for those using its Maps platform inside the United States, complying with an executive order by President Donald Trump. The tech giant wrote in a blog post that users outs…",
    "link": "https://japantoday.com/category/world/google-changes-name-of-gulf-of-mexico-to-%27gulf-of-america%27-for-us-users",
    "timestamp": "2025-02-11T03:59:16Z"
  }
]