[
  {
    "title": "Supreme Court blocks Trump from immediately firing Fed Gov. Cook",
    "description": "The US Supreme Court on Wednesday barred Donald Trump from immediately firing Federal Reserve Governor Lisa Cook, as the president mounts multiple challenges that have tested the independence of the central bank. In an order, the court said it had deferred th…",
    "link": "https://www.digitaljournal.com/world/supreme-court-blocks-trump-from-immediately-firing-fed-gov-cook/article",
    "timestamp": "2025-10-01T16:12:34Z"
  },
  {
    "title": "Leasing a Tesla just got more expensive",
    "description": "Tesla's lease pricing increases come after the expiration of the $7,500 electric vehicle tax credit as a result of Trump's One Big Beautiful Bill Act.",
    "link": "https://www.businessinsider.com/tesla-lease-prices-increase-electric-vehicle-tax-credit-expires-2025-10",
    "timestamp": "2025-10-01T16:10:09Z"
  },
  {
    "title": "‘Taking the People’s Government Ransom’: Leading Conservatives Speak Out Against Democrat Shutdown",
    "description": "Major players in the conservative movement are weighing in on the Democrats’ “ransom” demands to end the government shutdown, which is poised to affect millions... Read More\nThe post ‘Taking the People’s Government Ransom’: Leading Conservatives Speak Out Aga…",
    "link": "https://www.dailysignal.com/2025/10/01/taking-peoples-government-ransom-leading-conservatives-speak-out-against-democrat-shutdown/",
    "timestamp": "2025-10-01T16:10:00Z"
  },
  {
    "title": "Collins, Murkowski Didn’t Even Meet With Key Trump Nominee",
    "description": "A key nominee of President Donald Trump's was withdrawn after two Republican senators failed to meet with him, according to sources familiar with the process.",
    "link": "https://dailycaller.com/2025/10/01/susan-collins-lisa-murkowski-ej-antoni-bls-nominee-withdrawn-trump/",
    "timestamp": "2025-10-01T16:09:39Z"
  },
  {
    "title": "Earle-Sears: Spanberger's pre-shutdown 'silence speaks volumes’ after months of DOGE slams",
    "description": "Federal government shutdown sparks political battle between Virginia Lt. Gov. Winsome Earle-Sears and Democratic opponent Abigail Spanberger over DOGE criticism.",
    "link": "https://www.foxnews.com/politics/earle-sears-spanbergers-pre-shutdown-silence-speaks-volumes-after-months-doge-slams",
    "timestamp": "2025-10-01T16:08:32Z"
  },
  {
    "title": "Kshama Sawant’s husband accused of assaulting 22-year-old staffer",
    "description": "Congressional candidate Kshama Sawant’s husband is facing assault charges after allegedly shoving a young staffer for a Washington Congressman in August. Police video obtained by KOMO News showed Sawant’s husband, Calvin Priest, leading a group of protesters …",
    "link": "https://freerepublic.com/focus/f-backroom/4343710/posts",
    "timestamp": "2025-10-01T16:08:21Z"
  },
  {
    "title": "Tariffs may bring a US$50 billion monthly boost to the US government. But ordinary Americans won't feel the benefit",
    "description": "Donald Trump's recent state visit to the UK ended without the removal of steel tariffs, which the host nation had been hoping for. For months, the US president's array of \"liberation day\" tariffs have sparked controversy and caused chaos for America's trading…",
    "link": "https://phys.org/news/2025-10-tariffs-us50-billion-monthly-boost.html",
    "timestamp": "2025-10-01T16:06:05Z"
  },
  {
    "title": "State audit finds drop in armed guards, rising costs for Charlotte transit security",
    "description": "The safety of riders on Charlotte public transportation is back in the spotlight after the North Carolina state audito released a report on Tuesday.",
    "link": "https://www.wsoctv.com/news/local/state-audit-finds-drop-armed-guards-rising-costs-charlotte-transit-security/M7GQVLA7RRAPLLCWPWRUDR2ZPY/",
    "timestamp": "2025-10-01T16:06:01Z"
  },
  {
    "title": "Kamala Harris Memoir Sales: Book Scores Fourth-Best Debut Since 2023",
    "description": "New book \"107 Days\" detailing her run for president sells 350,000 copies in first week, bettering Hillary Clinton's post-election memoir released in 2017.",
    "link": "https://www.forbes.com/sites/tonifitzgerald/2025/10/01/kamala-harris-memoir-sales-book-scores-fourth-best-debut-since-2023/",
    "timestamp": "2025-10-01T16:05:23Z"
  },
  {
    "title": "Bitcoin targets $120k amid US government shutdown",
    "description": "Bitcoin price is targeting a fresh rally to the $120,000 mark. The US government’s partial shutdown has seen BTC price break the key level of $117,000. Flight to safe-haven assets, and market bets on Federal Reserve interest cuts could fuel bulls’ ambitions. …",
    "link": "https://coinjournal.net/news/bitcoin-targets-120k-amid-us-government-shutdown/",
    "timestamp": "2025-10-01T16:05:07Z"
  },
  {
    "title": "Camera Catches Mike Johnson Admitting Trump’s AI Attack ‘Wasn’t My Style’ as Democrat Goes Off on Him",
    "description": "“Not your style? It's disgraceful. It's [inaudible]. It's racist. You should call it out!” Dean insisted as Johnson replied\nThe post Camera Catches Mike Johnson Admitting Trump’s AI Attack ‘Wasn’t My Style’ as Democrat Goes Off on Him first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/camera-catches-mike-johnson-admitting-trumps-ai-attack-wasnt-my-style-as-democrat-goes-off-on-him/",
    "timestamp": "2025-10-01T16:04:25Z"
  },
  {
    "title": "Trump ally Michael Flynn submits ‘extreme’ legal brief brimming with bigotry in trans military case",
    "description": "In a court filing that reads more like a culture war manifesto than a legal argument, disgraced former Trump national security adviser Michael Flynn and conservative allies this week urged a federal appeals court to uphold President Donald Trump’s renewed ban…",
    "link": "https://www.advocate.com/news/talbott-amicus-brief-michael-flynn",
    "timestamp": "2025-10-01T16:03:49Z"
  },
  {
    "title": "Israel orders Palestinians to leave Gaza City, saying those who stay will be considered ‘terror supporters’",
    "description": "Israel’s defense minister is saying it is their “last opportunity” to leave.",
    "link": "https://www.bostonherald.com/2025/10/01/israel-hamas-war-gaza-city-attack/",
    "timestamp": "2025-10-01T16:03:11Z"
  },
  {
    "title": "Israel Issues 'Last' Warning For Gazans To Flee Main City",
    "description": "Israel issued a final warning Wednesday for people to flee Gaza's main city, as Hamas weighed US President Donald Trump's plan to end nearly two years of war in the Palestinian territory.",
    "link": "https://www.ibtimes.com.au/israel-issues-last-warning-gazans-flee-main-city-1860670",
    "timestamp": "2025-10-01T16:03:06Z"
  },
  {
    "title": "ADL Pulls Extremism Database After Kirk Group Row",
    "description": "The Anti-Defamation League pulled its Glossary of Extremism and Hate days after conservatives assailed the antisemitism watchdog for including the late Charlie Kirk's Turning Point USA in the index. Without directly addressing criticism from Elon Musk, Donald…",
    "link": "https://freerepublic.com/focus/f-news/4343707/posts",
    "timestamp": "2025-10-01T16:02:38Z"
  },
  {
    "title": "Legal threats hang over governor's race after report on Sherrill's military records",
    "description": "The National Archives admitted it had erred in releasing a mostly unredacted version of Mikie Sherrill's military records to an ally of her opponent.",
    "link": "https://www.cbsnews.com/news/legal-threats-nj-governors-race-mikie-sherrills-military-records-jack-ciattarelli/",
    "timestamp": "2025-10-01T16:02:32Z"
  },
  {
    "title": "Trump's Ultimatum to HAMAS: Will It Break The Deadlock?",
    "description": "US President Donald Trump gave the Palestinian movement three to four days to accept his plan for a ceasefire with Israel. What’s at play here?",
    "link": "https://sputnikglobe.com/20251001/trumps-ultimatum-to-hamas-will-it-break-the-deadlock-1122895067.html",
    "timestamp": "2025-10-01T16:01:58Z"
  },
  {
    "title": "Ciattarelli campaign rips 'lying' Dem opponent amid new National Archives investigation",
    "description": "A National Archives spokesperson said an employee mistakenly released Rep. Mikie Sherrill's full military records, including Social Security number to her Republican opponent's ally.",
    "link": "https://www.foxnews.com/politics/ciattarelli-campaign-rips-lying-dem-opponent-amid-new-national-archives-investigation",
    "timestamp": "2025-10-01T16:01:16Z"
  },
  {
    "title": "YouTube Shells Out Money To Trump To Settle Lawsuit",
    "description": "YouTube agreed to pay $24.5 million to settle a lawsuit by President Donald Trump on Monday over account suspensions. The bulk of the money will go to Trump.",
    "link": "https://hiphopwired.com/2853953/youtube-shells-out-money-to-trump-to-settle-lawsuit/",
    "timestamp": "2025-10-01T16:00:48Z"
  },
  {
    "title": "Israel Issues 'Last' Warning For Gazans To Flee Main City",
    "description": "Israel issued a final warning Wednesday for people to flee Gaza's main city, as Hamas weighed US President Donald Trump's plan to end nearly two years of war in the Palestinian territory.",
    "link": "https://www.ibtimes.com/israel-issues-last-warning-gazans-flee-main-city-3785066",
    "timestamp": "2025-10-01T16:00:24Z"
  },
  {
    "title": "UPDATE: Trump signing executive orders at historic rate...",
    "description": null,
    "link": "https://www.themirror.com/news/politics/stunning-historic-rate-donald-trump-1421505",
    "timestamp": "2025-10-01T16:00:04Z"
  },
  {
    "title": "Kamala Harris Tells Audience It's 'Time to Rise Up'...",
    "description": "Former Vice President Kamala Harris received a rockstar reception in Los Angeles at a \"conversation\" about her book \"107 Days.\"",
    "link": "https://urbanhollywood411.com/kamala-harris-promotes-book-107-days-los-angeles/",
    "timestamp": "2025-10-01T16:00:04Z"
  },
  {
    "title": "The Rise of Technofascists",
    "description": "Sam Harris on Silicon Valley’s turn toward authoritarian politics and the collapse of the information commons. Plus: Donald Trump’s politicization of prosecutions and Robert Proctor’s The Nazi War on Cancer.",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/10/the-david-frum-show-sam-harris/684424/",
    "timestamp": "2025-10-01T16:00:00Z"
  },
  {
    "title": "Trading on Tom Homan: Inside the Push to Cash in on the Trump Administration’s Deportation Campaign",
    "description": "by Avi Asher-Schapiro, Jeff Ernsthausen and Mica Rosenberg \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nThe first time a Pennsylvania consul…",
    "link": "https://www.propublica.org/article/tom-homan-border-czar-trump-mark-hall-charles-sowell",
    "timestamp": "2025-10-01T16:00:00Z"
  },
  {
    "title": "Why Trump’s Next Move Could Eclipse Even Reagan and FDR",
    "description": "In a recent interview, Jim Rickards argues that something he calls a hidden “national endowment” could become the defining economic achievement of Trump’s presidency In a recent interview, Jim Rickards argues that something he calls a hidden “national endowme…",
    "link": "https://www.globenewswire.com/news-release/2025/10/01/3159790/0/en/Why-Trump-s-Next-Move-Could-Eclipse-Even-Reagan-and-FDR.html",
    "timestamp": "2025-10-01T16:00:00Z"
  },
  {
    "title": "Trump threatens to use government shutdown to enact “irreversible” cuts and mass layoffs",
    "description": "“We can do things during the shutdown that are irreversible, that are bad for them,” the president warned Tuesday.",
    "link": "https://www.salon.com/2025/10/01/trump-threatens-to-use-government-shutdown-to-enact-irreversible-cuts-and-mass-layoffs/",
    "timestamp": "2025-10-01T15:59:04Z"
  },
  {
    "title": "BREAKING: Supreme Court allows Fed's Lisa Cook to stay in office for now, arguments set for January",
    "description": "BREAKING: The Supreme Court has set a January hearing to consider whether President Donald Trump can fire Lisa Cook from ...",
    "link": "https://biztoc.com/x/a6c68b1f039ac0df",
    "timestamp": "2025-10-01T15:59:02Z"
  },
  {
    "title": "Pakistani lawmaker criticises 'salesman' Munir's rare earth display for Trump, calls it a 'joke'",
    "description": "Pakistani senator Aimal Wali Khan criticised Army chief Asim Munir for presenting rare earth minerals to US President Trump, questioning his official capacity and calling it a “mockery” and “dictatorship.” The photo, taken during Munir’s third US visit since …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/pakistani-lawmaker-criticises-salesman-munirs-rare-earth-display-for-trump-calls-it-a-joke/articleshow/124263014.cms",
    "timestamp": "2025-10-01T15:58:48Z"
  },
  {
    "title": "Pritzker claims Trump has dementia",
    "description": "Illinois Gov. JB Pritzker continues to mince no words about President Donald Trump.",
    "link": "https://www.mystateline.com/news/pritzker-claims-trump-has-dementia/",
    "timestamp": "2025-10-01T15:58:14Z"
  },
  {
    "title": "The Battle Over Civil Society",
    "description": "An interview with Dylan J. Riley on Trump and the state of American democracy.",
    "link": "https://www.dissentmagazine.org/online_articles/the-battle-over-civil-society/",
    "timestamp": "2025-10-01T15:58:12Z"
  },
  {
    "title": "‘This team is guided by science’: Kenvue chief hits back at Trump and RFK Jr.’s Tylenol autism claims in memo to 20,000 employees",
    "description": "Kenvue’s interim CEO is defending Tylenol’s safety after President Donald J. Trump and Health Secretary Robert F. Kennedy Jr. linked the pain reliever to autism and crashed the company’s shares. \nIn a memo shared with around 20,000 employees, Kenvue Interim C…",
    "link": "https://biztoc.com/x/8bc456b90736be0e",
    "timestamp": "2025-10-01T15:57:14Z"
  },
  {
    "title": "Gavin Newsom trolls JD Vance with new AI couch and makeup videos",
    "description": "California Governor Gavin Newsom mocked JD Vance with an AI video showing the vice president praising couches and an old photograph of him wearing a blonde wig and makeup when he was a student. Newsom's office's X account has recently leaned into pushing AI c…",
    "link": "https://www.rawstory.com/jd-vance-2674143759/",
    "timestamp": "2025-10-01T15:56:59Z"
  },
  {
    "title": "‘Pelosi Would Have Figured It Out’: Alyssa Farah Griffin Warns Democrats They’re Playing Right Into Trump’s Hands With Shutdown",
    "description": "The View's Alyssa Farah Griffin warned Democrats that they're playing into Trump's hands with the current government shutdown fight.\nThe post ‘Pelosi Would Have Figured It Out’: Alyssa Farah Griffin Warns Democrats They’re Playing Right Into Trump’s Hands Wit…",
    "link": "https://www.mediaite.com/media/tv/pelosi-would-have-figured-it-out-alyssa-farah-griffin-warns-democrats-theyre-playing-right-into-trumps-hands-with-shutdown/",
    "timestamp": "2025-10-01T15:56:29Z"
  },
  {
    "title": "Trump Nominates Acting Chairman Travis Hill to Lead FDIC",
    "description": "Travis Hill has been nominated to serve as chairman of the board of directors of the Federal Deposit Insurance Corp. after serving as acting chairman since Jan. 20. Hill’s nomination by President Donald Trump was received by the Senate on Tuesday (Sept. 30) a…",
    "link": "http://www.pymnts.com/news/regulation/2025/trump-nominates-acting-chairman-travis-hill-lead-fdic/",
    "timestamp": "2025-10-01T15:55:59Z"
  },
  {
    "title": "Factbox-US senators who voted against their party positions on stopgap funding bill",
    "description": "WASHINGTON (Reuters) -Three U.S. Senate Democrats and one Republican crossed the political divide on Tuesday in their votes on a temporary funding bill that ...",
    "link": "https://www.yahoo.com/news/articles/factbox-us-senators-voted-against-155554219.html",
    "timestamp": "2025-10-01T15:55:54Z"
  },
  {
    "title": "GM EV sales more than double, boosting third-quarter totals",
    "description": "GM EV sales more than double, boosting third-quarter totalsdetroitnews.com",
    "link": "https://www.detroitnews.com/story/business/autos/general-motors/2025/10/01/gm-sales-third-quarter-ev-federal-tax-credit/86423293007/",
    "timestamp": "2025-10-01T15:55:52Z"
  },
  {
    "title": "Sen. Rand Paul: Biden’s TSA Targeted Veterans, Lawmakers, Mask Critics and Air Marshal’s Wife",
    "description": "In mid-2024, as she grew increasingly critical of the Biden Administration and increasingly involved with the Trump campaign, Tulsi Gabbard noticed changes as she went... Read More\nThe post Sen. Rand Paul: Biden’s TSA Targeted Veterans, Lawmakers, Mask Critic…",
    "link": "https://www.dailysignal.com/2025/10/01/sen-rand-paul-bidens-tsa-targeted-veterans-lawmakers-mask-critics-air-marshals-wife/",
    "timestamp": "2025-10-01T15:53:55Z"
  },
  {
    "title": "Trump administration puts on hold $18 billion in funding for New York City infrastructure projects",
    "description": "The hold was placed out of the belief the money was based on DEI.",
    "link": "https://www.bostonherald.com/2025/10/01/government-shutdown-nyc-projects/",
    "timestamp": "2025-10-01T15:53:28Z"
  },
  {
    "title": "'Hi Donald': Jimmy Kimmel Trolls Trump With Stephen Colbert and Seth Meyers in New Snap... After Prez Celebrated Late-night Host's Show Being Suspended Over Charlie Kirk Remarks",
    "description": "Jimmy Kimmel has trolled President Donald Trump with Stephen Colbert and Seth Meyers in a new snap after his show returned to ABC following the suspension.",
    "link": "https://radaronline.com/p/jimmy-kimmel-donald-trump-trolled-new-post-stephen-colbert-seth-meyers/",
    "timestamp": "2025-10-01T15:52:04Z"
  },
  {
    "title": "Government Shutdown Begins: Here’s What’s Closed And Open",
    "description": "The government shut down began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/01/government-shutdown-begins-heres-whats-closed-and-open/",
    "timestamp": "2025-10-01T15:50:46Z"
  },
  {
    "title": "Assuring the Security of the State of Qatar (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nAssuring the Security of the State of Qatar  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and in recognition of the enduring alliance between the U…",
    "link": "https://www.memeorandum.com/251001/p63",
    "timestamp": "2025-10-01T15:50:04Z"
  },
  {
    "title": "MAGA Christians Want Wives To Stay At Home — But There's An Ironic Hypocrisy",
    "description": "Influencers like Erika Kirk encourage wifely submission and stay-at-home motherhood while managing bustling careers.",
    "link": "https://www.huffpost.com/entry/erika-kirk-conservative-women-leaders_n_68db0102e4b07ad4cec6c489",
    "timestamp": "2025-10-01T15:49:14Z"
  },
  {
    "title": "Charlie Kirk assassination inspires famed ESPN commentator to run for Senate — as a conservative",
    "description": "ESPN host and analyst Paul Finebaum might run for office because of Charlie Kirk despite never being involved in politics. The SEC Network personality and host of \"The Paul Finebaum Show\" said in a recent interview that he is \"considering\" leaving the Disney-…",
    "link": "https://freerepublic.com/focus/f-news/4343705/posts",
    "timestamp": "2025-10-01T15:48:30Z"
  },
  {
    "title": "‘This team is guided by science’: Kenvue chief hits back at Trump and RFK Jr.’s Tylenol autism claims in memo to 20,000 employees",
    "description": "Promotion of unproven claims from President Trump and RFK Jr. linking acetaminophen (Tylenol) to autism have significantly impacted Kenvue’s business.",
    "link": "https://fortune.com/2025/10/01/kenvue-chief-trump-rfk-tylenol-autism-claims-memo-shares/",
    "timestamp": "2025-10-01T15:48:25Z"
  },
  {
    "title": "Trump Cabinet Chief Reveals Super Creepy Encounter With Jeffrey Epstein Over Massage Table",
    "description": "Howard Lutnick revealed a stomach-turning encounter with deceased sex criminal Jeffrey Epstein that occurred over Epstein's personal massage table.\nThe post Trump Cabinet Chief Reveals Super Creepy Encounter With Jeffrey Epstein Over Massage Table first appea…",
    "link": "https://www.mediaite.com/media/podcasts/trump-cabinet-chief-reveals-super-creepy-encounter-with-jeffrey-epstein-over-massage-table/",
    "timestamp": "2025-10-01T15:48:10Z"
  },
  {
    "title": "Gavin Newsom Goes Really Low To Mock JD Vance In A Sensitive Area",
    "description": "The California governor’s press office savaged the vice president in a post that will likely escalate matters.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-jd-vance-couch-tariffs_n_68dd32d3e4b0f3800bcd9a60",
    "timestamp": "2025-10-01T15:47:55Z"
  },
  {
    "title": "WATCH LIVE: White House holds briefing as first government shutdown in more than 6 years begins",
    "description": "The government’s overnight shutdown stemmed from a deadlock in Congress over Democratic demands over health care — and Republican efforts to kick that can down the road.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-holds-briefing-as-first-government-shutdown-in-more-than-6-years-begins",
    "timestamp": "2025-10-01T15:44:42Z"
  },
  {
    "title": "BREAKING: Supreme Court Allows Federal Reserve Governor Lisa Cook to Keep Her Job… For Now",
    "description": "The US Supreme Court on Wednesday allowed embattled Federal Reserve Governor Lisa Cook to remain in her chair for now. The high court will hear the case in January 2026 and allow Lisa Cook to keep her job in the meantime. This also means Lisa Cook will be abl…",
    "link": "https://freerepublic.com/focus/f-news/4343702/posts",
    "timestamp": "2025-10-01T15:44:16Z"
  },
  {
    "title": "Trump signs an executive order vowing to defend Qatar in the wake of Israel’s strike on Doha",
    "description": "However, the pledge's true scope remains uncertain, as legal agreements typically require Senate approval.",
    "link": "https://www.pbs.org/newshour/world/trump-signs-an-executive-order-vowing-to-defend-qatar-in-the-wake-of-israels-strike-on-doha",
    "timestamp": "2025-10-01T15:43:16Z"
  },
  {
    "title": "Trump’s First Shutdown Funding Freeze Will Hit Democratic Leaders",
    "description": "Donald Trump on Tuesday threatened that he would weaponize a government shutdown against Democrats by having his White House budget director, Russell Vought, slash “things they like.” The shutdown came overnight, and on Wednesday morning, Vought announced pla…",
    "link": "https://newrepublic.com/post/201198/trump-first-shutdown-funding-freeze-democratic-leaders-new-york",
    "timestamp": "2025-10-01T15:42:10Z"
  },
  {
    "title": "The Government Shutdown Is Based on a 16-Year-Old Lie",
    "description": "Chris Lehmann\n\n\n\nIn 2009, Republicans falsely claimed that the Affordable Care Act would benefit undocumented immigrants. They’re still peddling the same bullshit.\r\n\n\r\n\n\nThe post The Government Shutdown Is Based on a 16-Year-Old Lie appeared first on The Nati…",
    "link": "https://www.thenation.com/article/politics/government-shutdown-aca/",
    "timestamp": "2025-10-01T15:41:52Z"
  },
  {
    "title": "Hundreds of migrants mount protest in southern Mexico in bid to legalize status",
    "description": "Hundreds of migrants have embarked on a protest march in southern Mexico in support of an aim to legalize their immigration status and find more work opportunities after a long frustrating wait near the Guatemala border",
    "link": "https://abcnews.go.com/International/wireStory/hundreds-migrants-mount-protest-southern-mexico-bid-legalize-126120363",
    "timestamp": "2025-10-01T15:41:51Z"
  },
  {
    "title": "Starmer is right to be buoyed after conference - but he has a very long road ahead",
    "description": "As we sat down to begin our annual conference interview shortly after the prime minister had delivered his speech to party members, I asked Sir Keir Starmer how he was feeling? \"Good,\" he said, \"it was a speech I needed to give\".",
    "link": "https://news.sky.com/story/starmer-is-right-to-be-buoyed-after-conference-but-he-has-a-very-long-road-ahead-13442273",
    "timestamp": "2025-10-01T15:41:00Z"
  },
  {
    "title": "‘We could come up with a new system’: On the ACA, Trump has an unintentionally funny line",
    "description": "“We could come up with a new system that would be much better” than \"Obamacare,\" Donald Trump said, seemingly unaware of his own record on the issue.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/-come-new-system-aca-trump-unintentionally-funny-line-rcna234929",
    "timestamp": "2025-10-01T15:38:52Z"
  },
  {
    "title": "Thomas Markle ‘Trapped’ After Philippines Earthquake; Samantha Blames Meghan: …",
    "description": "Reading Time: 4 minutesSamantha Markle is blaming her siser for their father's terrifying predicament.\nThomas Markle ‘Trapped’ After Philippines Earthquake; Samantha Blames Meghan: … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/thomas-markle-philippines/",
    "timestamp": "2025-10-01T15:38:36Z"
  },
  {
    "title": "Hundreds of Northwestern Students Refuse To Watch Anti-Semitism Training Video",
    "description": "Hundreds of students at Northwestern University refused to watch an anti-Semitism training video that the school made mandatory amid President Donald Trump's crackdown on campus anti-Semitism. At least 300 of Northwestern's 22,000 students boycotted the train…",
    "link": "https://freerepublic.com/focus/f-news/4343701/posts",
    "timestamp": "2025-10-01T15:38:18Z"
  },
  {
    "title": "Madison Cawthorn Tries To Pull Off Political Comeback In New State",
    "description": "Former North Carolina Republican Rep. Madison Cawthorn officially announced his candidacy for Florida's 19th congressional district on Wednesday.",
    "link": "https://dailycaller.com/2025/10/01/madison-cawthorn-comeback-congress-florida-byron-donalds/",
    "timestamp": "2025-10-01T15:38:10Z"
  },
  {
    "title": "Trump Is Tightening His Grip on State Republicans",
    "description": "Trump is tightening his grip on state Republicans. His political machine is now bullying state lawmakers who won’t get onboard with his midterms-redistricting power grab.",
    "link": "http://nymag.com/intelligencer/article/trump-is-tightening-his-grip-on-state-republicans.html",
    "timestamp": "2025-10-01T15:37:55Z"
  },
  {
    "title": "Trump Does It Again! (Deragatory)",
    "description": "He’s two for two on government shutdowns.",
    "link": "https://www.jezebel.com/trump-does-it-again-deragatory",
    "timestamp": "2025-10-01T15:37:36Z"
  },
  {
    "title": "Utah Loves Trump. It Didn’t Stop Him From Taking a Chainsaw to One of Its Largest Employers.",
    "description": "If you’ve ever lived west of the Mississippi, you’ve probably mailed a tax return to the IRS service center in Ogden, Utah. Inside a sprawling campus near the city’s historic downtown, workers process millions of tax returns a year, plus nonprofit paperwork a…",
    "link": "https://www.motherjones.com/politics/2025/10/utah-loves-trump-it-didnt-stop-him-from-taking-a-chainsaw-to-one-of-its-largest-employers/",
    "timestamp": "2025-10-01T15:37:16Z"
  },
  {
    "title": "US stock market today: Dow, S&P 500, Nasdaq slip as US shutdown collides with ADP’s shock 32,000 job losses; fueling Fed cut expectations",
    "description": "U.S. stock market opened weaker on Wednesday, October 1, 2025, as investors reacted to the first government shutdown in nearly seven years. Major indices were mixed, with the Dow Jones Industrial Average (^DJI) near 46,463, the S&P 500 (^GSPC) down about 0.1%…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-wall-street-wavers-as-us-shutdown-triggers-jobs-shock-dow-sp-500-and-nasdaq-slip-as-adp-reports-surprise-32000-job-losses-in-september-and-fed-rate-cut-bets-rise/articleshow/124262035.cms",
    "timestamp": "2025-10-01T15:37:02Z"
  },
  {
    "title": "‘That Was You Three Times’: CNN’s John Berman Confronts Chuck Schumer For Previously Opposing Government Shutdowns",
    "description": "CNN host John Berman confronted Senator Minority Leader Chuck Schumer on Wednesday for previously having staunchly opposed government shutdowns.",
    "link": "https://dailycaller.com/2025/10/01/cnn-john-berman-confronts-chuck-schumer-shutdowns/",
    "timestamp": "2025-10-01T15:33:36Z"
  },
  {
    "title": "Supreme Court Won’t Let Trump Fire Lisa Cook—For Now",
    "description": "Cook will remain at the Federal Reserve until the Supreme Court hears oral arguments from the Trump administration in January.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/10/01/supreme-court-wont-let-trump-fire-lisa-cook-for-now/",
    "timestamp": "2025-10-01T15:33:06Z"
  },
  {
    "title": "Caravaggio’s Medusa: why we need to look the Gorgon in the eye",
    "description": "The work is about the artist’s power of immortality, his features frozen in time forever.",
    "link": "https://theconversation.com/caravaggios-medusa-why-we-need-to-look-the-gorgon-in-the-eye-255800",
    "timestamp": "2025-10-01T15:31:14Z"
  },
  {
    "title": "Supreme Court Rules on Trump’s Firing of Fed Board Member—for Now",
    "description": "Lisa Cook will keep her post on the Federal Reserve Board of Governors for now at least, as the Supreme Court denied an emergency appeal... Read More\nThe post Supreme Court Rules on Trump’s Firing of Fed Board Member—for Now appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/01/supreme-court-rules-on-trumps-firing-of-fed-board-member-for-now/",
    "timestamp": "2025-10-01T15:30:04Z"
  },
  {
    "title": "JEFFRIES, SCHUMER STATEMENT ON THE TRUMP SHUTDOWN (Democratic Leader Hakeem Jeffries)",
    "description": "Democratic Leader Hakeem Jeffries:\nJEFFRIES, SCHUMER STATEMENT ON THE TRUMP SHUTDOWN  —  Today, House Democratic Leader Hakeem Jeffries and Senate Democratic Leader Chuck Schumer released the following statement:  —  After months of making life harder and mor…",
    "link": "https://www.memeorandum.com/251001/p58",
    "timestamp": "2025-10-01T15:30:01Z"
  },
  {
    "title": "Iran-Aligned Houthis Sanction U.S. Oil Majors",
    "description": "Major U.S. oil companies and their top managers were targeted by sanctions by a Yemeni body affiliated with the Iran-aligned Houthi rebels, for what they say is violating a Houthi embargo. The Humanitarian Operations Coordination Center (HOCC), a Houthi-affil…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Aligned-Houthis-Sanction-US-Oil-Majors.html",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "The D Brief: Reactions to Quantico; Shutdown, in effect; USAF chief nom; GOP govs call out troops; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/10/the-d-brief-october-01-2025/408529/",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "FIFA World Cup 2026 tickets have gone on sale. Here's how to try to get them",
    "description": "Tickets for next year's FIFA World Cup officially go on sale Wednesday.",
    "link": "https://www.stltoday.com/sports/professional/fifa/article_10dcbc00-bc40-55e5-af54-41c77fc070b9.html",
    "timestamp": "2025-10-01T15:30:00Z"
  },
  {
    "title": "Washington Post warns Democrats may have walked into Trump 'trap' over government shutdown",
    "description": "The Washington Post editorial board argued that Congressional Progressive Caucus tactics mirrored failed GOP strategies, leaving Democrats vulnerable during the federal government shutdown.",
    "link": "https://www.foxnews.com/media/washington-post-warns-democrats-may-have-walked-trump-trap-over-government-shutdown",
    "timestamp": "2025-10-01T15:28:34Z"
  },
  {
    "title": "JD Vance Admits Shutdown Will Bring 'Pain,' Uses Misleading Claim To Blame Dems",
    "description": "The vice president said Republicans don’t want to “lay anybody off,” though Speaker Mike Johnson appeared to eye permanent mass job cuts.",
    "link": "https://www.huffpost.com/entry/jd-vance-shutdown-layoffs_n_68dd34ece4b0f3800bcd9ba4",
    "timestamp": "2025-10-01T15:26:05Z"
  },
  {
    "title": "Trump Admin to Put $18 Billion in New York City Infrastructure Projects on Hold Due to Democrat Shutdown",
    "description": "President Donald Trump's administration announced on Wednesday that $18 billion in infrastructure projects in New York City will be put on hold due to Democrats' shutdown of the government.\nThe post Trump Admin to Put $18 Billion in New York City Infrastructu…",
    "link": "https://www.breitbart.com/politics/2025/10/01/trump-admin-to-put-18-billion-in-new-york-city-infrastructure-projects-on-hold-due-to-democrat-shutdown/",
    "timestamp": "2025-10-01T15:24:47Z"
  },
  {
    "title": "Barack Obama's Favorability Compared to Donald Trump's—New Poll",
    "description": "Americans view former President Barack Obama more favorably than President Donald Trump, according to a new poll.\nNewsweek reached out to the White House via email and Obama’s office via his press contact form for comment.\nWhy It Matters\nTrump’s favorability …",
    "link": "https://biztoc.com/x/73e934f86ce7fcb4",
    "timestamp": "2025-10-01T15:24:28Z"
  },
  {
    "title": "Supreme Court Allows Lisa Cook To Stay At Fed Amid Trump's Push To Oust Her",
    "description": "The Supreme Court will allow Lisa Cook to remain as Federal Reserve Governor despite President Donald Trump's attempts to oust her.\nIn a brief, unsigned order, the court said that it would leave Cook in her position until it heard arguments from her and the T…",
    "link": "https://biztoc.com/x/5e51a0cde0e00875",
    "timestamp": "2025-10-01T15:24:17Z"
  },
  {
    "title": "GOP falsely claims Democrats want free health care for those without legal status - NewsBreak",
    "description": "GOP falsely claims Democrats want free health care for those without legal status - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4265965679269-gop-falsely-claims-democrats-want-free-health-care-for-those-without-legal-status?s=a2&amp;share_destination_id=MTI0OTEwNDc2LTE3NTkzMzIxNDE1MzE%3D&amp;pd=08S6v66L&amp;hl=en_US&amp;send_time=1759332141&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-01T15:24:04Z"
  },
  {
    "title": "Young People Are Richer Than Boomers Were",
    "description": "Despite viral claims, a typical 25-year-old Gen Zer has annual household income that's 50 percent above Baby Boomers'.",
    "link": "https://reason.com/2025/10/01/young-people-are-richer-than-boomers-were/",
    "timestamp": "2025-10-01T15:23:54Z"
  },
  {
    "title": "Supreme Court allows Lisa Cook to stay on Fed board for now",
    "description": "President Donald Trump is attempting to assert more control over the historically independent Federal Reserve Board of Governors.",
    "link": "https://biztoc.com/x/322ff7c7defa0000",
    "timestamp": "2025-10-01T15:23:43Z"
  },
  {
    "title": "Japan defends 15% tariffs deal with ‘tough negotiator’ Trump",
    "description": "Japan’s chief trade negotiator has defended a tariffs deal with the U.S., expressing respect for President Donald Trump and calling him a “tough negotiator.”Trade envoy Ryosei Akazawa noted that the pact setting on most Japanese exports to the U.S. at 15% was…",
    "link": "https://biztoc.com/x/d3393a565c0320bf",
    "timestamp": "2025-10-01T15:23:36Z"
  },
  {
    "title": "US Government Shutdown Live Updates: Senate vote opens as shutdown kicks in, Wall Street stocks slide",
    "description": "US Government Shutdown Live Updates: The US is confronting a fresh cycle of uncertainty after President Donald Trump and Congress failed to strike an agreement to keep government programs and services running by Wednesday’s deadline. Disagreement stemmed from…",
    "link": "https://m.economictimes.com/news/international/global-trends/us-government-shutdown-live-news-updates-united-states-services-affected-complete-advisory-white-house-donald-trump-democrats-reaction/liveblog/124262626.cms",
    "timestamp": "2025-10-01T15:23:30Z"
  },
  {
    "title": "BREAKING: Supreme Court Stops Trump From Firing Fed Governor — For Now",
    "description": "Trump's attacks on the Fed have alarmed economists who fear that Trump exercising influence over the Fed could create turmoil in the global economy\nThe post BREAKING: Supreme Court Stops Trump From Firing Fed Governor — For Now first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-supreme-court-stops-trump-from-firing-fed-governor-for-now/",
    "timestamp": "2025-10-01T15:20:09Z"
  },
  {
    "title": "What Hamas Wants Removed From Trump's Gaza Peace Plan Revealed",
    "description": "Hamas leaders are reportedly seeking to amend some clauses of Donald Trump's Gaza peace plan, including those regarding its disarmament and expulsion from the enclave",
    "link": "https://www.ibtimes.com/what-hamas-wants-removed-trumps-gaza-peace-plan-revealed-3785060",
    "timestamp": "2025-10-01T15:18:15Z"
  },
  {
    "title": "RON HART: 107 Dazed — And Confused",
    "description": "Like most lifelong politicians, she has no marketable skills.",
    "link": "https://dailycaller.com/2025/10/01/ron-hart-107-dazed-and-confused-kamala-harris-book-tour/",
    "timestamp": "2025-10-01T15:17:55Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook stay on Fed board",
    "description": "The Supreme Court is allowing Lisa Cook to remain as a Federal Reserve governor for now.",
    "link": "https://www.wlwt.com/article/supreme-court-lisa-cook-federal-reserve-trump-case/68152452",
    "timestamp": "2025-10-01T15:15:27Z"
  },
  {
    "title": "'The worst in quite some time': Trump hit by bad news as latest job numbers shock",
    "description": "Analysts were left shocked Wednesday after ADP released its latest jobs report that showed private employers had shed 32,000 jobs\r\n in September, a stark contrast to the expected gain of around 50,000 jobs.“Very disappointing, it was a weak number; this is pr…",
    "link": "https://www.rawstory.com/jobs-2674143998/",
    "timestamp": "2025-10-01T15:15:10Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now in unsigned order",
    "description": "In a brief unsigned order, the high court said it would hear arguments in January over President Donald Trump's effort to force Cook off the Fed board.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-lets-lisa-cook-remain-as-a-federal-reserve-governor-for-now-in-unsigned-order",
    "timestamp": "2025-10-01T15:13:48Z"
  },
  {
    "title": "Supreme Court allows the Fed's Lisa Cook to stay in office for now as Trump pushes to fire her",
    "description": "The Supreme Court will consider President Donald Trump's attempt to fire Federal Reserve board member Lisa Cook.",
    "link": "https://biztoc.com/x/f942ba0c68a99ac1",
    "timestamp": "2025-10-01T15:12:38Z"
  },
  {
    "title": "Trump bid to remove Fed Governor Lisa Cook put on hold as US Supreme Court delays decision",
    "description": "In a brief unsigned order, the court said it would hear arguments in January over President Donald Trump’s push to force Cook off the Fed board.",
    "link": "https://indianexpress.com/article/world/trump-bid-to-remove-fed-governor-lisa-cook-put-on-hold-as-us-supreme-court-delays-decision-10282533/",
    "timestamp": "2025-10-01T15:11:55Z"
  },
  {
    "title": "“America First” President Gives Foreign Nation Massive Boost in Order",
    "description": "Qatar now has NATO-level security protections, thanks to the Trump administration.In an executive order signed Monday, Donald Trump pledged that the tiny, energy-rich, non-NATO ally would receive the same level of protection from the U.S. as some of America’s…",
    "link": "https://newrepublic.com/post/201191/donald-trump-qatar-security-executive-order",
    "timestamp": "2025-10-01T15:11:51Z"
  },
  {
    "title": "We found him: The alleged smoke bomber — and his shocking links to Antifa inside Canada’s military",
    "description": "Mark Carney’s Liberal government appears to be employing Antifa extremists inside federal institutions — even within our national defence system. At Rebel News, we did what the Montreal police should have done. We launched a reward campaign to identify and tr…",
    "link": "https://freerepublic.com/focus/f-news/4343695/posts",
    "timestamp": "2025-10-01T15:11:06Z"
  },
  {
    "title": "Trump's Military Training Order Violates Constitution",
    "description": "During Donald Trump's crazy speech to military leaders at Quantico, Virginia, he proposed using the US military and National Guard to fight Chicago crime as a training grounds for his new war machine - which is blatantly unconstitutional.\nDemented Donald is l…",
    "link": "https://crooksandliars.com/2025/09/trump-illegally-orders-military-training",
    "timestamp": "2025-10-01T15:10:50Z"
  },
  {
    "title": "Inside 'Alligator Alcatraz': Color-coded uniforms, 5:30 am breakfast and strict rules",
    "description": "Detainees arriving at the immigration detention center in the Florida Everglades are given color-coded uniforms and segregated based on criminal history and flight risk",
    "link": "https://abcnews.go.com/US/wireStory/inside-alligator-alcatraz-color-coded-uniforms-530-breakfast-126118864",
    "timestamp": "2025-10-01T15:10:18Z"
  },
  {
    "title": "Supreme Court lets Lisa Cook remain as a Federal Reserve governor for now",
    "description": "The Supreme Court is declining to act on the Trump administration's effort to immediately remove Lisa Cook from the central bank.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_4f1e9dcb-c558-5ace-b215-afacf0209b4f.html",
    "timestamp": "2025-10-01T15:10:00Z"
  }
]