[
  {
    "title": "Explainer: Separating facts from fiction, in Trump’s Ukraine tirade",
    "description": "President Donald Trump   falsely blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives, causing outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military.",
    "link": "https://www.independent.ie/world-news/europe/explainer-separating-facts-from-fiction-in-trumps-ukraine-tirade/a2091511925.html",
    "timestamp": "2025-02-20T09:30:32Z"
  },
  {
    "title": "Trump's sweeping DOGE-driven cuts are impacting military veterans, who say the firings are causing fear and confusion",
    "description": "Veterans make up roughly a third of the federal workforce, which the Trump administration is targeting with sweeping layoffs.",
    "link": "https://www.businessinsider.com/trump-doge-cuts-hit-military-veterans-causing-fear-confusion-2025-2",
    "timestamp": "2025-02-20T09:30:02Z"
  },
  {
    "title": "U.S. Secretary of State Marco Rubio Snubs G20 Foreign Ministers Meeting in South Africa",
    "description": "Amid diplomatic tensions between host South Africa and the Trump Administration, the U.S. will be represented at a meeting of foreign ministers by the acting ambassador to South Africa.",
    "link": "https://time.com/7259802/g20-south-africa-trump-rubio-snub-bessent-dei/",
    "timestamp": "2025-02-20T09:30:00Z"
  },
  {
    "title": "Democrat donors begin pulling cash as party continues collapse - NewsBreak",
    "description": "Democrat donors begin pulling cash as party continues collapse - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3821318695271-democrat-donors-begin-pulling-cash-as-party-continues-collapse?_f=app_share&pd=0H6YexBU&lang=en_US&send_time=1740101397&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v1&s=i2",
    "timestamp": "2025-02-20T09:30:00Z"
  },
  {
    "title": "Trump wants to know if there's gold in Fort Knox. (There is)",
    "description": "President Donald Trump said Elon Musk would be checking out Fort Knox to make sure the gold is still there",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-gold-fort-knox-118993478",
    "timestamp": "2025-02-20T09:27:23Z"
  },
  {
    "title": "Scotch, whiskey & more: Why the world is raising a toast to Indian tipplers",
    "description": "Top spirit makers, including United Breweries, AB InBev, and Carlsberg, are investing over Rs 3,500 crore in Indian breweries by 2025, driven by a young population, rising incomes, and premiumization. India's reduced import duties on bourbon whiskey and wines…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/liquor/scotch-whiskey-more-why-the-world-is-raising-a-toast-to-indian-tipplers/articleshow/118413737.cms",
    "timestamp": "2025-02-20T09:25:54Z"
  },
  {
    "title": "Trump vs Zelenskyy: What’s behind escalating war of words?",
    "description": "Trump called Zelenskyy a 'dictator' amid a brewing war of words between the two leaders.",
    "link": "https://www.aljazeera.com/news/2025/2/20/trump-vs-zelenskyy-whats-behind-escalating-war-of-words",
    "timestamp": "2025-02-20T09:24:56Z"
  },
  {
    "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts?",
    "description": "President Donald Trump falsely accused Ukraine of starting the war against Russia and criticized President Volodymyr Zelenskyy as a dictator with low voter support. Trump's statements have been refuted by facts, revealing Russia's long-standing aggression and…",
    "link": "https://timesofindia.indiatimes.com/world/europe/trump-says-ukraine-started-the-war-thats-killing-its-citizens-what-are-the-facts/articleshow/118414459.cms",
    "timestamp": "2025-02-20T09:23:05Z"
  },
  {
    "title": "Trump's freeze on foreign aid could give China an opening on the world stage",
    "description": "President Donald Trump’s restrictions on foreign aid and targeting of a key agency funding programs around the world may be offering an opening to China",
    "link": "https://abcnews.go.com/US/wireStory/trumps-freeze-foreign-aid-give-china-opening-world-118994810",
    "timestamp": "2025-02-20T09:19:27Z"
  },
  {
    "title": "Trans runner who defeated 12-year-old girl defends biological men in women’s sports",
    "description": "Nathanielle Morin is a transwoman and Canadian advisor to the Federal Minister of Women.",
    "link": "https://nypost.com/2025/02/20/world-news/trans-runner-nathanielle-morin-who-defeated-12-year-old-girl-defends-biological-men-in-womens-sports/",
    "timestamp": "2025-02-20T09:17:00Z"
  },
  {
    "title": "Trump says trade deal with China 'possible'",
    "description": "WASHINGTON: United States President Donald Trump suggested on Wednesday (Feb 19) that a trade deal was \"possible\" with China - a key target in the US leader's tariffs policy. In 2020, the US had already agreed to \"a great trade deal with China\" and a new deal…",
    "link": "https://www.channelnewsasia.com/world/trump-us-china-trade-deal-tariffs-exemptions-japan-canada-mexico-europe-4949361",
    "timestamp": "2025-02-20T09:14:00Z"
  },
  {
    "title": "Europe risks becoming 'museum' without innovating in AI: Swedish PM",
    "description": "\"I think we really need to step up in Europe,\" Sweden's Prime Minister Ulf Kristersson said Thursday.",
    "link": "https://www.cnbc.com/2025/02/20/europe-risks-becoming-museum-without-innovating-in-ai-swedish-pm.html",
    "timestamp": "2025-02-20T09:12:32Z"
  },
  {
    "title": "Japan's Nikkei ends at over 2-week low on stronger yen, US tariff worries",
    "description": "Japan's Nikkei share average fell over 1% to end at a more-than two-week-low on Thursday, as automakers declined due to a stronger yen, while investors assessed the potential impact of U.S. President Donald Trump's latest tariff threat.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-2-week-low-on-stronger-yen-us-tariff-worries/articleshow/118413852.cms",
    "timestamp": "2025-02-20T09:06:34Z"
  },
  {
    "title": "The stock market's overconfidence is setting it up for a dangerous fall",
    "description": "From Trump tariffs to AI overconfidence, investors are ignoring a lot of worries right now. That could be a dangerous sign for the stock market.",
    "link": "https://www.businessinsider.com/record-investor-confidence-stock-market-wall-street-crash-sell-off-2025-2",
    "timestamp": "2025-02-20T09:03:02Z"
  },
  {
    "title": "How did the world’s most watched hostages disappear from the headlines?",
    "description": "Before the release, the only site to it in the top section of the website was CNN. The BBC, the NYT, the WSJ, Washington Post, The Times, CBS, Sky and The Guardian did not.",
    "link": "https://www.jpost.com/diaspora/article-842956",
    "timestamp": "2025-02-20T09:00:25Z"
  },
  {
    "title": "California sheriff uses 'To Catch A Predator' playbook to squash blue state crime",
    "description": "A veteran California sheriff and governor hopeful is highlighting one of his biggest career wins happening through a partnership with 'To Catch a Predator' in a massive 2006 operation.",
    "link": "https://www.foxnews.com/us/california-sheriff-uses-catch-predator-playbook-squash-blue-state-crime",
    "timestamp": "2025-02-20T09:00:24Z"
  },
  {
    "title": "Is The People’s Liberation Army Ready For a Fight Over Taiwan?",
    "description": "In this show, Melanie, Chris, and Zack discuss Timothy Heath’s recent paper on China’s military capabilities. Heath argues that the People’s Liberation Army mostly focused on preserving the Chinese Communist Party’s rule, and that does not necessarily transla…",
    "link": "https://warontherocks.com/2025/02/is-the-peoples-liberation-army-ready-for-a-fight-over-taiwan/",
    "timestamp": "2025-02-20T09:00:15Z"
  },
  {
    "title": "Big games, bad weather and an ad blitz on the radar for the final week of Ontario election",
    "description": "A surge in campaign advertising, a push to get out the vote and concern over the ferocious winter weather all swirl as Ontario enters the final week of the provincial election.",
    "link": "https://www.cbc.ca/news/canada/toronto/last-week-ontario-election-1.7463171",
    "timestamp": "2025-02-20T09:00:00Z"
  },
  {
    "title": "U.S. hasn't sent essential seasonal flu data to WHO ahead of key vaccine meeting",
    "description": "Seasonal flu vaccines need to be updated each year because the virus changes so frequently. But the U.S. hasn't contributed its information on what's spreading there since January, a World Health Organization official says.",
    "link": "https://www.cbc.ca/news/health/flu-who-trump-1.7463413",
    "timestamp": "2025-02-20T09:00:00Z"
  },
  {
    "title": "Trump's talk about Canada parrots Putin's claims on Ukraine",
    "description": "Donad Trump's threats and claims about Canada may be unprecedented in the history of U.S.-Canada relations. But they have a strong precedent elsewhere in recent history: They closely resemble remarks made by Russia's Vladimir Putin to justify his invasion of …",
    "link": "https://www.cbc.ca/news/politics/trump-canada-putin-ukraine-comments-1.7462337",
    "timestamp": "2025-02-20T09:00:00Z"
  },
  {
    "title": "For 60 years, this Canada-U.S. treaty governed money, power and a river. With Trump's threats, what now?",
    "description": "The Columbia River Treaty governs how Canada and the U.S. use dams for hydropower and flood control on the massive cross-border river. After more than 60 years, provisions have expired, and efforts to finalize a modern treaty before U.S. President Trump’s sec…",
    "link": "https://www.cbc.ca/news/canada/british-columbia/columbia-river-treaty-trump-1.7462660",
    "timestamp": "2025-02-20T09:00:00Z"
  },
  {
    "title": "Report: Illegal Alien Apprehensions Along U.S. Southwest Border Plummet in January",
    "description": "Apprehension of illegal aliens along the U.S. Southwest border plummeted in January by a third, fresh data reveals.\nThe post Report: Illegal Alien Apprehensions Along U.S. Southwest Border Plummet in January appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/20/report-apprehensions-along-u-s-southwest-border-plummet-in-january/",
    "timestamp": "2025-02-20T08:59:48Z"
  },
  {
    "title": "World War Two started when Poland invaded Germany: History according to Donald Trump",
    "description": "NOBODY knows history better than me, the man who founded America. Here are some facts, great facts, that people often get wrong about the past.",
    "link": "https://www.thedailymash.co.uk/politics/world-war-two-started-when-poland-invaded-germany-history-according-to-donald-trump-20250220254956",
    "timestamp": "2025-02-20T08:59:37Z"
  },
  {
    "title": "Grattan on Friday: Dutton doesn’t pull his punches on Trump while Albanese plays it safe",
    "description": "The government finds itself having to speak softly with an administration it hopes to get a concession on tariffs from. While Peter Dutton doesn’t have that problem.",
    "link": "https://theconversation.com/grattan-on-friday-dutton-doesnt-pull-his-punches-on-trump-while-albanese-plays-it-safe-250386",
    "timestamp": "2025-02-20T08:59:01Z"
  },
  {
    "title": "G20 meeting of foreign ministers gets underway in South Africa amid tensions with US",
    "description": "Foreign ministers from G20 countries will meet in Johannesburg on Thursday, but U.S. Secretary of State Marco Rubio will not attend amid diplomatic tensions between South Africa and the U.S. Diplomats including Russian Foreign Minister Sergey Lavrov an...",
    "link": "https://abcnews.go.com/International/wireStory/g20-meeting-foreign-ministers-gets-underway-south-africa-118996250",
    "timestamp": "2025-02-20T08:57:22Z"
  },
  {
    "title": "Too close to China? All about Kash Patel's controversial Shein deal and why it's making waves in Washington",
    "description": "Kash Patel, Donald Trump’s pick for FBI director, has spent years criticising Elon Musk, accusing him of monopolistic control and profiting from taxpayer-funded contracts. Yet, Patel himself stands to gain millions from shares in Shein’s parent company, Elite…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/too-close-to-china-all-about-kash-patels-controversial-shein-deal-and-why-its-making-waves-in-washington/articleshow/118411679.cms",
    "timestamp": "2025-02-20T08:55:14Z"
  },
  {
    "title": "After Google's Willow, Microsoft unveils quantum chip 'Majorana 1'- powered by new state of matter: 10 points",
    "description": "Microsoft unveiled Majorana 1, a quantum chip the company says is powered by a new state of matter. The new chip allows for more stable, scalable, and simplified quantum computing, the tech company said. This development marks a major leap toward practical qu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/microsoft-quantum-breakthrough-after-googles-willow-microsoft-unveils-quantum-chip-majorana-1-satya-nadella-powered-by-new-state-of-matter-10-points/articleshow/118413102.cms",
    "timestamp": "2025-02-20T08:45:45Z"
  },
  {
    "title": "The 9 at 9: Thursday",
    "description": "Ukrainians on US-Russia negotiations, Trump’s war of words with Zelenskyy and Tánaiste attending the G20 summit.",
    "link": "https://www.thejournal.ie/8-at-8-thursday-114-6627778-Feb2025/",
    "timestamp": "2025-02-20T08:45:00Z"
  },
  {
    "title": "Markets Drop, Gold Hits Record On Fed Concern Over Trump Policies",
    "description": "Equity markets turned negative on Thursday and gold hit a record high amid Federal Reserve concerns that US President Donald Trump's tariffs and immigration measures could reignite inflation.",
    "link": "https://www.ibtimes.com.au/markets-drop-gold-hits-record-fed-concern-over-trump-policies-1856380",
    "timestamp": "2025-02-20T08:42:22Z"
  },
  {
    "title": "Ukraine is just a pawn in Trump's Russian reset",
    "description": "Donald Trump's negotiations with Russia focus on resetting US-Russia relations rather than resolving the Ukraine conflict. He has conceded to several of Moscow’s demands, sidelining Ukrainian interests. This approach raises concerns about a deal that benefits…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-is-just-a-pawn-in-trumps-russian-reset/articleshow/118412732.cms",
    "timestamp": "2025-02-20T08:37:42Z"
  },
  {
    "title": "Harsh Pant: Trump’s foreign policy recast poses a challenge that India cannot avoid",
    "description": "Donald Trump has shaken up the world as he junks America’s old foreign policy framework and unsettles Nato allies in Europe to focus on geopolitical rivalry with China. India will have to relook its equations and adapt quickly.",
    "link": "https://www.livemint.com/opinion/online-views/harsh-pant-donald-trump-american-foreign-policy-us-india-relations-china-indo-pacific-europe-narendra-modi-putin-ukraine-11740038295109.html",
    "timestamp": "2025-02-20T08:36:08Z"
  },
  {
    "title": "Trump Says Medicaid Won’t Be ‘Touched.’ House Republicans Want It Cut by Hundreds of Billions. - The New York Times",
    "description": "Trump Says Medicaid Won’t Be ‘Touched.’ House Republicans Want It Cut by Hundreds of Billions.The New York Times Trump blindsides staff, Congress with conflicting Medicaid messagesPOLITICO Trump Backs House GOP Bill Slashing $1 Trillion From Medicaid and Food…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176314457",
    "timestamp": "2025-02-20T08:32:30Z"
  },
  {
    "title": "American conservatives gather to savor Trump’s triumph",
    "description": "Newly-energized American conservative leaders and activists will gather on the outskirts of the capital Washington on Thursday for an annual three-day conference set to celebrate US President Donald Trump’s return to power. With international allies like Arge…",
    "link": "https://www.digitaljournal.com/world/american-conservatives-gather-to-savor-trumps-triumph/article",
    "timestamp": "2025-02-20T08:28:20Z"
  },
  {
    "title": "American Conservatives Gather To Savor Trump's Triumph",
    "description": "Newly-energized American conservative leaders and activists will gather on the outskirts of the capital Washington on Thursday for an annual three-day conference set to celebrate US President Donald Trump's return to power.",
    "link": "https://www.ibtimes.com/american-conservatives-gather-savor-trumps-triumph-3764422",
    "timestamp": "2025-02-20T08:27:19Z"
  },
  {
    "title": "Trump calls for federal control of Washington DC, halts legal aid for migrant children and announces fresh tariffs",
    "description": "President Donald Trump has thrown his support behind congressional efforts for a federal takeover of the US capital, saying he approves putting the District of Columbia back under direct federal control.",
    "link": "https://www.independent.ie/world-news/north-america/trump-calls-for-federal-control-of-washington-dc-halts-legal-aid-for-migrant-children-and-announces-fresh-tariffs/a842531300.html",
    "timestamp": "2025-02-20T08:20:32Z"
  },
  {
    "title": "European leaders criticise Trump’s Zelenskiy diatribe",
    "description": "US president launches online broadside amid already-fraught situation during Ukraine talks",
    "link": "https://www.irishtimes.com/politics/2025/02/20/european-leaders-criticise-trumps-zelenskiy-diatribe/",
    "timestamp": "2025-02-20T08:11:41Z"
  },
  {
    "title": "Trump Says Trade Deal With China 'Possible'",
    "description": "US President Donald Trump suggested on Wednesday that a trade deal was \"possible\" with China -- a key target in the US leader's tariffs policy.",
    "link": "https://www.ibtimes.com/trump-says-trade-deal-china-possible-3764419",
    "timestamp": "2025-02-20T08:06:19Z"
  },
  {
    "title": "Europe needs to 'wake up' following US policy shift, Greek PM says",
    "description": "ATHENS: Europe should wake up and build its own defence policy following a dramatic shift by the United States over Ukraine and geopolitical developments in recent months, Greek Prime Minister Kyriakos Mitsotakis said late on Wednesday (Feb 19). US President …",
    "link": "https://www.channelnewsasia.com/world/europe-needs-wake-up-following-us-policy-shift-greek-pm-says-4949156",
    "timestamp": "2025-02-20T08:06:00Z"
  },
  {
    "title": "Emotional trauma piles up for Ukraine's children three years after invasion",
    "description": "KYIV (Reuters) - As the air raid siren sounded for a ballistic missile threat in Kyiv, dozens of eight-year-old children descended into their primary school's basement with pencils and textbooks to continue class. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/20/emotional-trauma-piles-up-for-ukraine039s-children-three-years-after-invasion",
    "timestamp": "2025-02-20T08:06:00Z"
  },
  {
    "title": "Trump says trade deal with China ‘possible’",
    "description": "US President Donald Trump suggested on Wednesday that a trade deal was “possible” with China — a key target in the US leader’s tariffs policy. In 2020, the United States had already agreed to “a great trade deal with China” and a new deal was “possible,” Trum…",
    "link": "https://www.digitaljournal.com/world/trump-says-trade-deal-with-china-possible/article",
    "timestamp": "2025-02-20T08:02:33Z"
  },
  {
    "title": "World War III was ‘not so far away’ – Trump",
    "description": "US President Donald Trump has said his electoral victory in November prevented World War III Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613042-trump-world-war-ukraine/",
    "timestamp": "2025-02-20T08:02:22Z"
  },
  {
    "title": "‘Zero Day’ TV Review: Robert De Niro’s Netflix Political Thriller Fights To Make America Function Again",
    "description": "“When is the last time the country was able to solve any of its problems?” ambitious Congresswoman Alexandra Mullen (Lizzy Caplin) screams at her father and former POTUS George Mullen (Robert De Niro) in Netflix’s just launched Zero Day. It is a fair question…",
    "link": "http://deadline.com/2025/02/zero-day-review-robert-de-niro-netflix-1236295639/",
    "timestamp": "2025-02-20T08:01:11Z"
  },
  {
    "title": "White House to Celebrate Black History Month Despite Trump’s Anti-DEI Order",
    "description": "The ceremony comes as the Trump administration has pushed to eradicate diversity programs from the government, which some agencies have interpreted to end the observance of identity-based months.",
    "link": "https://time.com/7259780/white-house-black-history-month-trump-dei/",
    "timestamp": "2025-02-20T08:00:00Z"
  },
  {
    "title": "Trump turns against Zelenskyy and towards Russia",
    "description": "WASHINGTON: Donald Trump has not just turned against Volodymyr Zelenskyy by branding the Ukrainian president a \"dictator\" - he has also turned towards Russia's narrative about its invasion, deepening uncertainty about Kyiv's",
    "link": "https://www.channelnewsasia.com/world/trump-turn-against-zelenskyy-ukraine-dictator-russia-4949131",
    "timestamp": "2025-02-20T07:57:00Z"
  },
  {
    "title": "Trump Says Federal Government Should ‘Take Over’ And Run Washington, D.C.",
    "description": "The president criticized D.C.’s local government, saying they were “not doing the job” in dealing with crime and homelessness in the city.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/02/20/trump-says-federal-government-should-take-over-washington-dc/",
    "timestamp": "2025-02-20T07:55:26Z"
  },
  {
    "title": "Donald Trump's US tariffs may impact India’s GDP by 0.1-0.6%: Goldman Sachs",
    "description": "Goldman Sachs also noted that non-tariff barriers, such as import licences and export subsidies, present a complex challenge.",
    "link": "https://www.businesstoday.in/latest/economy/story/donald-trumps-us-tariffs-may-impact-indias-gdp-by-01-06-goldman-sachs-465301-2025-02-20",
    "timestamp": "2025-02-20T07:52:29Z"
  },
  {
    "title": "Trump considering ‘alternatives’ to Boeing for Air Force One contract",
    "description": "The US aerospace giant agreed in 2018 to supply two 747-8 planes by the end of 2024 for $3.9 billion.\nThe post Trump considering ‘alternatives’ to Boeing for Air Force One contract appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/trump-considering-alternatives-to-boeing-for-air-force-one-contract/article",
    "timestamp": "2025-02-20T07:47:22Z"
  },
  {
    "title": "Japan's trade minister arranging U.S. trip to seek tariff exemptions",
    "description": "Japan's trade minister is arranging a visit to the United States in coming weeks to seek exemptions from President Donald Trump's tariffs, local media said Thursday. This month Trump said he was &quot;simplifying our tariffs on steel and aluminum&quot; as he …",
    "link": "https://japantoday.com/category/politics/japan%27s-trade-minister-arranging-us-trip-reports",
    "timestamp": "2025-02-20T07:41:19Z"
  },
  {
    "title": "Taiwan's semiconductor dominance: Strategic asset or economic vulnerability?",
    "description": "As US President Donald Trump continues to make statements about Taiwan's semiconductor industry, concerns are rising that the US might replicate its past tactics of undermining Japan's semiconductor sector—this time targeting Taiwan. Such fears have sparked d…",
    "link": "https://www.digitimes.com/news/a20250220PD201/taiwan-donald-trump-taiwan-semiconductor-industry-electronics-manufacturing.html",
    "timestamp": "2025-02-20T07:36:13Z"
  },
  {
    "title": "Almost 90% of Japanese companies see Trump as bad for business, survey shows",
    "description": "Almost nine out of 10 Japanese companies expect U.S. President Donald Trump's policies to negatively affect business, a Reuters survey showed on Thursday, the clearest sign yet of mounting worry in the United States' top foreign direct investor. The results o…",
    "link": "https://japantoday.com/category/business/Almost-90-of-Japanese-companies-see-Trump-as-bad-for-business-survey-shows",
    "timestamp": "2025-02-20T07:36:09Z"
  },
  {
    "title": "Russia spent years loathing the U.S. as its economy paid a high price for the war — now, it's doing a U-turn",
    "description": "Moscow has denigrated the United States' leadership, economy and culture — but now things are changing amid a \"revival\" of Russia-U.S. relations.",
    "link": "https://www.cnbc.com/2025/02/20/russia-is-doing-a-u-turn-after-spending-the-last-3-years-hating-us.html",
    "timestamp": "2025-02-20T07:34:30Z"
  },
  {
    "title": "CNBC Daily Open: The Fed, concerned over Trump tariffs, might hold rates",
    "description": "The U.S. Federal Reserve held rates steady in January because of worries over tariffs. Stoking concerns, Trump announced more tariffs on Tuesday.",
    "link": "https://www.cnbc.com/2025/02/20/cnbc-daily-open-fed-concerned-over-trump-tariffs-might-hold-rates.html",
    "timestamp": "2025-02-20T07:30:01Z"
  },
  {
    "title": "Trump Wants to Check In on Fort Knox’s Gold. His Treasury Secretary Says It’s All There",
    "description": "“If the gold isn’t there, we’re going to be very upset,” the President said. His Treasury Secretary Scott Bessent has said it’s all “present and accounted for.“",
    "link": "https://time.com/7259777/trump-musk-fort-knox-gold-depository-treasury-bessent/",
    "timestamp": "2025-02-20T07:30:00Z"
  },
  {
    "title": "'Stagflation' fears haunt US markets despite Trump's pro-growth agenda",
    "description": "Stubborn inflation and Trump's trade policies have revived fears of stagflation, a mix of slow growth and persistent inflation. Investors are concerned tariffs may dampen economic growth while spiking inflation. Responses range from revising forecasts for 10-…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/stagflation-fears-haunt-us-markets-despite-trumps-pro-growth-agenda/articleshow/118410821.cms",
    "timestamp": "2025-02-20T07:27:14Z"
  },
  {
    "title": "Stock market today: Asian shares mostly dip despite S&P 500 adding to its record on Wall Street",
    "description": "Asian shares are trading mostly lower after a quiet day on Wall Street, where the S&P 500 added to its record",
    "link": "https://abcnews.go.com/US/wireStory/stock-market-today-asian-shares-dip-despite-sp-118992925",
    "timestamp": "2025-02-20T07:26:23Z"
  },
  {
    "title": "Trump backs idea to send some DOGE savings to American citizens",
    "description": "President Donald Trump says he likes the idea to give some of the savings from Elon Musk’s Department of Government Efficiency back to U.S. citizens as a kind of dividend",
    "link": "https://abcnews.go.com/Business/wireStory/trump-backs-idea-send-doge-savings-american-citizens-118993312",
    "timestamp": "2025-02-20T07:26:15Z"
  },
  {
    "title": "Trump says he's considering buying used planes to serve as Air Force One amid Boeing delays",
    "description": "President Donald Trump says he is considering buying used Boeing aircraft — perhaps from an overseas seller — to use as Air Force One when he’s aboard, as he fumes over the U.S. plane-maker’s delays in producing two specially modified ones for presiden...",
    "link": "https://abcnews.go.com/Business/wireStory/trump-buying-planes-serve-air-force-amid-boeing-118992537",
    "timestamp": "2025-02-20T07:26:15Z"
  },
  {
    "title": "Europe needs to \"wake up\" following US policy shift, Greek PM says",
    "description": "ATHENS (Reuters) - Europe should wake up and build its own defence policy following a dramatic shift by the United States over Ukraine and geopolitical developments in recent months, Greek Prime Minister Kyriakos Mitsotakis said late on Wednesday. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/02/20/europe-needs-to-wake-up-following-us-policy-shift-greek-pm-says",
    "timestamp": "2025-02-20T07:21:00Z"
  },
  {
    "title": "10 Must Watch Stories From The World",
    "description": "This year's Sundance Film Festival was rich with films and the theatres were warm, even as temperatures outside dipped to below freezing point. It snowed only once but the sidewalks remained slippery for a few days.",
    "link": "https://www.rediff.com/movies/special/10-must-watch-stories-from-across-the-world/20250220.htm",
    "timestamp": "2025-02-20T07:19:02Z"
  },
  {
    "title": "Zelensky lied to Trump about Ukraine’s mineral reserves – Bloomberg",
    "description": "Ukraine has “talked up” the potential of the country’s mineral resources to win Trump’s backing, Bloomberg columnist Javier Blas believes Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613041-zelensky-lied-trump-rare-earths/",
    "timestamp": "2025-02-20T07:18:41Z"
  },
  {
    "title": "The government is employing fewer people and they're traveling less. United Airlines could lose millions of dollars.",
    "description": "Government employee travel, which makes up 2% of the company's business, \"has fallen off\" after the inauguration, United Airlines' CEO said Wednesday.",
    "link": "https://www.businessinsider.com/united-airlines-ceo-fewer-government-employees-flying-doge-layoffs-contracts-2025-2",
    "timestamp": "2025-02-20T07:12:44Z"
  },
  {
    "title": "Trump accuses Zelensky of treating US envoy ‘rudely’",
    "description": "US Treasury Secretary Scott Bessent met Zelensky in Ukraine's capital last week to discuss granting Washington access to rare earth minerals.\nThe post Trump accuses Zelensky of treating US envoy ‘rudely’ appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/trump-accuses-zelensky-of-treating-us-envoy-rudely/article",
    "timestamp": "2025-02-20T07:12:21Z"
  },
  {
    "title": "Jasmine Crockett Gets 'Perfectly Honest' With Red States: 'They Are About To Find Out'",
    "description": "The Texas Democrat called out conservatives who \"fail to realize\" how the Trump administration is dragging them to the \"find out phase.\"",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-red-states-recession-find-out-trump-cuts_n_67b6b508e4b0cc5d77998248",
    "timestamp": "2025-02-20T07:11:20Z"
  },
  {
    "title": "Donald Trump Says Trade Deal With China 'Possible' Amid Tariff Tensions",
    "description": "US President Donald Trump suggested on Wednesday that a trade deal was &quot;possible&quot; with China -- a key target in the US leader&#039;s tariffs policy.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-trade-deal-with-china-possible-amid-tariff-tensions-7752457",
    "timestamp": "2025-02-20T07:09:52Z"
  },
  {
    "title": "USAID B’Haram controversy: Nigeria may miss $603m fund, Senate summons service chiefs",
    "description": "Nigeria’s access to a $602.95m grant for 2025 from the United States Agency for International Development is now uncertain, following a 90-day suspension of all agency programmes by President Donald Trump. The fund freeze stems from an executive order signed …",
    "link": "https://punchng.com/usaid-bharam-controversy-nigeria-may-miss-603m-fund-senate-summons-service-chiefs/",
    "timestamp": "2025-02-20T07:05:11Z"
  },
  {
    "title": "Russia says has taken back major chunk of Kursk region from Ukrainian forces",
    "description": "MOSCOW (Reuters) - Russian forces have taken back more than 800 square km (309 square miles) of territory from Ukraine in the Kursk region of western Russia, or about 64% of the total taken by Ukraine since an incursion began last year, a top Russian general …",
    "link": "https://www.thestar.com.my/news/world/2025/02/20/russia-says-has-taken-back-major-chunk-of-kursk-region-from-ukrainian-forces",
    "timestamp": "2025-02-20T07:03:00Z"
  },
  {
    "title": "Here Are All The Major Lawsuits Against Trump And Musk: Appeals Court Rejects Trump’s Bid To Lift Halt On Birthright Citizenship Order",
    "description": "Judges have blocked some of Trump and Musk's early moves—for now.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/20/here-are-all-the-major-lawsuits-against-trump-and-musk-appeals-court-rejects-trumps-bid-to-lift-halt-on-birthright-citizenship-order/",
    "timestamp": "2025-02-20T07:01:23Z"
  },
  {
    "title": "Learning From Trump: How Progressives Can Become The Party Of Change",
    "description": "Politically, this is surely a strange and disturbing time, but one of its oddest, most discouraging features is to watch Donald Trump operate as an agent of systemic change while his panicky opponents try to defend an obsolescent status quo.  Like Franklin D.…",
    "link": "https://www.counterpunch.org/?p=354883",
    "timestamp": "2025-02-20T07:01:15Z"
  },
  {
    "title": "India Responds After Illegal Migrants Deported By US Seek \"Help\" In Panama",
    "description": "India is working closely with the authorities in Panama to ensure the well-being of Indian migrants deported by the United States to the Latin American country.",
    "link": "https://www.ndtv.com/world-news/india-on-migrants-deported-from-us-stuck-at-panama-hotel-they-are-safe-7752406",
    "timestamp": "2025-02-20T07:00:54Z"
  },
  {
    "title": "Trump Promises Tax Cuts for Oil and Gas Producers",
    "description": "President Donald Trump will enlist the help of Republicans in Congress to reduce the debt burden on households and companies, notable oil and gas producers, whom he will allow to expense 100% of capital spending, according to Reuters. “If you buy something th…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Trump-Promises-Tax-Cuts-for-Oil-and-Gas-Producers.html",
    "timestamp": "2025-02-20T07:00:00Z"
  },
  {
    "title": "The New Plutocracy",
    "description": "The United States is not a democracy.  It is a plutocracy.  It is not simply a plutocracy  because  of Donald Trump’s presidency and the likes of Elon Musk and other billionaires who are running the government.  The most recent Forbes listing of the richest A…",
    "link": "https://www.counterpunch.org/2025/02/20/the-new-plutocracy/",
    "timestamp": "2025-02-20T06:59:40Z"
  },
  {
    "title": "Republicans are pursuing separate paths to get Trump's priorities through Congress",
    "description": "Senate Majority Leader John Thune has teed up a vote on a budget plan that sets the stage for a massive boost in defense and border security spending, and leaves a looming tax cut fight for later this year",
    "link": "https://abcnews.go.com/US/wireStory/republicans-pursuing-separate-paths-trumps-priorities-congress-118995445",
    "timestamp": "2025-02-20T06:59:03Z"
  },
  {
    "title": "Trump says Russia 'have the cards' in Ukraine peace negotiations",
    "description": "His comments came just hours after he branded Ukrainian President Volodymyr Zelenskyy a “dictator”.",
    "link": "https://www.thejournal.ie/donald-trump-russia-ukraine-negotiations-6627757-Feb2025/",
    "timestamp": "2025-02-20T06:57:00Z"
  },
  {
    "title": "Stephen Miller & Trump’s Presidency",
    "description": "On January 30, 2025, Pres. Donald Trump issued “Executive Order to Combat Anti-Semitism” in which he “promised” that the U.S. government will “[p]rotect the civil rights of our Jewish citizens”; “prosecute anti-Semitic crimes”; and “Deport Hamas Sympathizers …",
    "link": "https://www.counterpunch.org/2025/02/20/stephen-miller-trumps-presidency/",
    "timestamp": "2025-02-20T06:56:59Z"
  },
  {
    "title": "Trump signs executive order ending use of taxpayer money to 'incentivize or support' illegal immigration",
    "description": "President Donald Trump has signed an executive order ending the use of federal taxpayer money for resources supporting illegal immigration and illegal aliens.",
    "link": "https://www.foxnews.com/politics/trump-signs-executive-order-ending-use-taxpayer-money-incentivize-support-illegal-immigration",
    "timestamp": "2025-02-20T06:56:34Z"
  },
  {
    "title": "Eight Ways Trump Can Tank the Economy",
    "description": "President Biden handed off the best economy to an incoming president since at least the 2001 handoff from Clinton to Bush II. In his last quarter in office, GDP grew at a 2.3 percent annual rate (final demand, which excludes inventory fluctuations, grew at a …",
    "link": "https://www.counterpunch.org/2025/02/20/354884/",
    "timestamp": "2025-02-20T06:53:23Z"
  },
  {
    "title": "Campaigning PM dismisses 'boring' election timing questions",
    "description": "This week the prime minister found a warm reception in South Australia, Peter Dutton gave strong comments on Donald Trump and the Bureau of Meteorology stepped in to make sure a natural disaster didn't become a political one.",
    "link": "https://www.abc.net.au/news/2025-02-20/anthony-albanese-peter-malinauskus-clive-palmer-trumpet/104950508",
    "timestamp": "2025-02-20T06:47:32Z"
  },
  {
    "title": "Eyeing China And US, EU Hopes Clean Tech Boost Will Spark Growth",
    "description": "How do you solve Europe's lagging economic growth and reverse its industrial decline?",
    "link": "https://www.ibtimes.com/eyeing-china-us-eu-hopes-clean-tech-boost-will-spark-growth-3764399",
    "timestamp": "2025-02-20T06:42:28Z"
  },
  {
    "title": "Trump expects visit from Chinese President Xi without giving timeline",
    "description": "ABOARD AIR FORCE ONE/ WASHINGTON — U.S. President Donald Trump said on Wednesday he expected Chinese President Xi Jinping to visit the United States, without giving a timeline for his trip.\n\n\nTrump made the remarks to reporters on Air Force One and said \"it's…",
    "link": "https://www.voanews.com/a/trump-expects-visit-from-chinese-president-xi-without-giving-timeline/7981566.html",
    "timestamp": "2025-02-20T06:42:27Z"
  },
  {
    "title": "Vanguard Pauses Corporate Meetings Over New ESG Guidance",
    "description": "Top mutual fund manager Vanguard has paused meetings with portfolio companies while it reviews the impact of new guidance on investor activism from the U.S. Securities and Exchange Commission, according to people familiar with the matter. In a recent notice, …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/20/812551.htm",
    "timestamp": "2025-02-20T06:40:01Z"
  },
  {
    "title": "Trump claims Russia ‘has the cards’ in Ukraine peace talks",
    "description": "US president says he believes Russia wants peace and has ‘the cards’ because of the Ukrainian territory it has taken",
    "link": "https://www.irishtimes.com/world/europe/2025/02/20/trump-claims-russia-has-the-cards-in-ukraine-peace-talks/",
    "timestamp": "2025-02-20T06:38:27Z"
  },
  {
    "title": "Airbus sees 820 jet deliveries in 2025, unveils new charges",
    "description": "Airbus plans a 7% increase in commercial deliveries to 820 jets by 2025, despite delaying the A350 freighter model to 2027. The company reported lower annual operating earnings, citing supply chain issues. Airbus also faces challenges in its Space business an…",
    "link": "https://economictimes.indiatimes.com/news/international/business/airbus-sees-820-jet-deliveries-in-2025-unveils-new-charges/articleshow/118408921.cms",
    "timestamp": "2025-02-20T06:36:15Z"
  },
  {
    "title": "‘Reacher’ star Alan Ritchson reveals feud with former classmate Matt Gaetz: ‘We are adversaries’",
    "description": "The 42-year-old actor did not hold back his disdain for Gaetz when the politician's name came up during a recent interview.",
    "link": "https://nypost.com/2025/02/20/us-news/reacher-star-alan-ritchson-reveals-feud-with-former-niceville-florida-classmate-matt-gaetz/",
    "timestamp": "2025-02-20T06:35:54Z"
  },
  {
    "title": "Trump expects visit from Chinese President Xi without giving timeline",
    "description": "WASHINGTON: US President Donald Trump said on Wednesday (Feb 19) he expected Chinese President Xi Jinping to visit the United States without giving a timeline for his trip. Trump made the remarks to reporters on Air Force One and said \"it's possible\" for the …",
    "link": "https://www.channelnewsasia.com/world/trump-expects-visit-chinese-president-xi-without-giving-timeline-4948881",
    "timestamp": "2025-02-20T06:35:33Z"
  },
  {
    "title": "Palo Alto Networks warns that CVE-2025-0111 flaw is actively exploited in attacks",
    "description": "Palo Alto Networks warns that the vulnerability CVE-2025-0111 is actively exploited with two other flaws to compromise PAN-OS firewalls. Palo Alto Networks warns that threat actors are chaining the vulnerability CVE-2025-0111 with two other vulnerabilities, t…",
    "link": "https://securityaffairs.com/174409/hacking/palo-alto-networks-cve-2025-0111-actively-exploited.html",
    "timestamp": "2025-02-20T06:32:44Z"
  },
  {
    "title": "Ex-NFL Player Hauled Out Of City Meeting After Railing Against 'Nazi' MAGA Movement",
    "description": "Former punter Chris Kluwe spoke out against a MAGA reference on a city plaque.",
    "link": "https://www.huffpost.com/entry/chris-kluwe-arrested_n_67b69201e4b050f805a0e92b",
    "timestamp": "2025-02-20T06:31:33Z"
  },
  {
    "title": "Trump Orders Agencies to Stop Taxpayers' Funding for Illegal Migrants",
    "description": "President Donald Trump has ordered his agencies to scrub their regulations and spending programs to ensure illegal migrants are not getting taxpayers' funds via hidden channels.\nThe post Trump Orders Agencies to Stop Taxpayers’ Funding for Illegal Migrants ap…",
    "link": "https://www.breitbart.com/economy/2025/02/19/trump-orders-agencies-block-aid-welfare-illegal-migrants/",
    "timestamp": "2025-02-20T06:31:25Z"
  },
  {
    "title": "Appeasement in Europe",
    "description": "Let Europe Do It Munich has again become the symbol of appeasement less than a century after the West sold out Czechoslovakia to Hitler. This time around, it is the Trump administration that has sold out Ukraine, turning that country from victim of aggression…",
    "link": "https://www.counterpunch.org/2025/02/20/appeasement-in-europe/",
    "timestamp": "2025-02-20T06:30:57Z"
  },
  {
    "title": "Denmark to spend $7 bn more on defence in next two years",
    "description": "Copenhagen (AFP) Feb 19, 2025\n\n\n Denmark will allocate an extra 50 billion kroner ($7 billion) for defence spending over the next two years, citing an increasing threat from Russia, the prime minister said Wednesday. \n\nPremier Mette Frederiksen told a press c…",
    "link": "https://www.spacewar.com/reports/Denmark_to_spend_7_bn_more_on_defence_in_next_two_years_999.html",
    "timestamp": "2025-02-20T06:30:37Z"
  },
  {
    "title": "Trump administration takes aim at Pentagon spending",
    "description": "Washington (AFP) Feb 20, 2025\n\n\n US Defense Secretary Pete Hegseth has ordered a review of the department's 2026 budget so as to reallocate $50 billion in funds, the Pentagon said Wednesday, following reports that he had directed deep, multi-year cuts to mili…",
    "link": "https://www.spacewar.com/reports/Trump_administration_takes_aim_at_Pentagon_spending_999.html",
    "timestamp": "2025-02-20T06:30:37Z"
  },
  {
    "title": "Putin, Xi to visit each other for events marking WWII end",
    "description": "Moscow (AFP) Feb 19, 2025\n\n\n The leaders of Russia and China will visit each other to mark events commemorating the end of World War II, Russia's foreign minister said on Wednesday. \n\nVladimir Putin and Xi Jinping have deepened their alliance during Russia's …",
    "link": "https://www.spacewar.com/reports/Putin_Xi_to_visit_each_other_for_events_marking_WWII_end_999.html",
    "timestamp": "2025-02-20T06:30:37Z"
  },
  {
    "title": "Trump nominee for VA's No. 2 job grilled by lawmakers over recent layoffs",
    "description": "Washington DC (UPI) Feb 19, 2025 \n\n\n President Donald Trump's nominee to be the number two official in the U.S. Department of Veterans Affairs was grilled Wednesday by lawmakers on Capitol Hill as the White House cleans out federal agencies, including the VA.…",
    "link": "https://www.spacewar.com/reports/Trump_nominee_for_VAs_No_2_job_grilled_by_lawmakers_over_recent_layoffs_999.html",
    "timestamp": "2025-02-20T06:30:37Z"
  },
  {
    "title": "Simon Harris is meeting diplomats at G20 summit today - but won't be sitting down with Russia",
    "description": "Today’s meeting of G20 countries’ foreign affairs ministers is due to focus on issues of global trade and “current political developments”.",
    "link": "https://www.thejournal.ie/simon-harris-is-meeting-diplomats-at-g20-summit-today-but-wont-be-sitting-down-with-russia-6627460-Feb2025/",
    "timestamp": "2025-02-20T06:30:27Z"
  },
  {
    "title": "Trump signs late-night executive order abolishing handful of federal advisory boards",
    "description": "President Donald Trump signed an executive order late Wednesday, eliminating a handful of federal advisory committees like the Presidio Trust and the Inter-American Foundation.",
    "link": "https://www.foxnews.com/politics/trump-signs-late-night-executive-order-abolishing-handful-federal-advisory-boards",
    "timestamp": "2025-02-20T06:26:22Z"
  },
  {
    "title": "Vehicle price hike looms as US plans 25% tariff",
    "description": "Freight forwarders have said that Nigerian vehicle importers may be spending more following the plans by US President, Donald Trump to impose auto tariffs “in the neighbourhood of 25 per cent” and similar duties on semiconductors and pharmaceutical imports. A…",
    "link": "https://punchng.com/vehicle-price-hike-looms-as-us-plans-25-tariff/",
    "timestamp": "2025-02-20T06:23:03Z"
  }
]