[
  {
    "title": "Trump pauses $2.1B for Chicago infrastructure projects",
    "description": "White House budget director Russ Vought says the Trump administration will withhold $2.1 billion for Chicago infrastructure projects, expanding funding fights that have targeted Democratic areas during the government shutdown. The pause affects a long-awaited…",
    "link": "https://apnews.com/article/government-shutdown-chicago-infrastructure-funding-9ef6c7829fc85553bf8d3dbaa759611e",
    "timestamp": "2025-10-03T11:57:13Z"
  },
  {
    "title": "How Strong Is The Case Against James Comey?",
    "description": "There is minimal information included in James Comey's indictment, but it may not signal a lack of evidence.",
    "link": "https://dailycaller.com/2025/10/03/james-comey-indictment/",
    "timestamp": "2025-10-03T11:56:46Z"
  },
  {
    "title": "Intimate Trump-Epstein Statue Erected Just Days After Cops Took It Down",
    "description": "The statue of Trump and Jeffrey Epstein in an intimate pose was erected once more on the National Mall just days after federal Park Police took it down.\nThe post Intimate Trump-Epstein Statue Erected Just Days After Cops Took It Down first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/weird/intimate-trump-epstein-statue-erected-just-days-after-cops-took-it-down/",
    "timestamp": "2025-10-03T11:56:24Z"
  },
  {
    "title": "Trump Aides Secretly Panicking About His Looming Political Nightmare",
    "description": "Donald Trump’s inner circle fears voters will ultimately blame the GOP if healthcare subsidies expire—a central issue surrounding the government shutdown—and...",
    "link": "https://www.thedailybeast.com/donald-trump-aides-secretly-panicking-about-his-looming-political-nightmare/",
    "timestamp": "2025-10-03T11:51:28Z"
  },
  {
    "title": "What’s Next for Multilateralism?",
    "description": "On the sidelines of the United Nations General Assembly, thousands of leaders from civil society, business, educational institutions, and philanthropies discussed how the world can conduct diplomacy without the US. To that end, middle powers must convene the …",
    "link": "https://www.project-syndicate.org/commentary/middle-powers-must-lead-un-and-build-new-multilateral-order-by-anne-marie-slaughter-2025-10",
    "timestamp": "2025-10-03T11:47:21Z"
  },
  {
    "title": "Transcript: Chris Murphy’s Dark and Unnerving New Warning about Trump",
    "description": "The following is a lightly edited transcript of the October 3 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is the Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. Senator Ch…",
    "link": "https://newrepublic.com/article/201311/transcript-chris-murphy-dark-unnerving-new-warning-trump",
    "timestamp": "2025-10-03T11:47:03Z"
  },
  {
    "title": "Will Trump bunker-bust the Marxist administrative state?",
    "description": "Can anyone dismantle the administrative state? Only one president has had both the desire and opportunity to crush and disable the administrative state, but more importantly, end the Marxist dialectic that has infected and subsumed this nation and post-modern…",
    "link": "https://freerepublic.com/focus/f-chat/4344061/posts",
    "timestamp": "2025-10-03T11:45:57Z"
  },
  {
    "title": "US has handed trade advantage to China, Simon Harris says",
    "description": "Taoiseach and Tánaiste highlight ‘amplificaiton of geopolitical and trade risks’ at Dublin event",
    "link": "https://www.irishtimes.com/ireland/2025/10/03/us-has-handed-trade-advantage-to-china-simon-harris-says/",
    "timestamp": "2025-10-03T11:44:42Z"
  },
  {
    "title": "Newsweek's Great Misfire: How Dev Pragad's Smear Campaign Fell Apart",
    "description": "Federal authorities have cleared Olivet University of human trafficking allegations, raising questions about Newsweek's reporting and CEO Dev Pragad's role in driving the narrative.",
    "link": "https://www.ibtimes.com/newsweeks-great-misfire-how-dev-pragads-smear-campaign-fell-apart-3785450",
    "timestamp": "2025-10-03T11:42:15Z"
  },
  {
    "title": "Tim Walz Had A Blunt (And Funny) Take On Trump’s Escalator Drama",
    "description": "Yeah, we're still here.View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/tim-walz-on-the-broken-escalator",
    "timestamp": "2025-10-03T11:41:33Z"
  },
  {
    "title": "A Government Shutdown, Weaponized (The Atlantic)",
    "description": "The Atlantic:\nA Government Shutdown, Weaponized … Thirty-four days into the previous government shutdown, in 2019, reporters asked President Donald Trump if he had a message for the thousands of federal employees who were about to miss another paycheck.  “I l…",
    "link": "https://www.memeorandum.com/251003/p17",
    "timestamp": "2025-10-03T11:40:00Z"
  },
  {
    "title": "Trump is now embracing Project 2025, using federal shutdown to pursue its goals",
    "description": "President Donald Trump is now openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign.",
    "link": "https://www.mlive.com/news/2025/10/trump-is-now-embracing-project-2025-using-federal-shutdown-to-pursue-its-goals.html",
    "timestamp": "2025-10-03T11:38:37Z"
  },
  {
    "title": "Trump was nominated for the Nobel Peace Prize before. Experts say he's unlikely to win this year",
    "description": "U.S. President Donald Trump’s bid to win the Nobel Peace Prize has drawn added attention to the annual guessing game over who its next laureate will be",
    "link": "https://abcnews.go.com/International/wireStory/trump-nominated-nobel-peace-prize-experts-win-year-126176542",
    "timestamp": "2025-10-03T11:33:48Z"
  },
  {
    "title": "Zohran Mamdani's rise in the New York mayoral race sparks anti-Muslim vitriol",
    "description": "Zohran Mamdani’s rise in New York City’s mayoral race has brought him national prominence and a surge of anti-Muslim vitriol, including from elected officials and prominent conservatives",
    "link": "https://abcnews.go.com/Politics/wireStory/zohran-mamdanis-rise-new-york-mayoral-race-sparks-126175864",
    "timestamp": "2025-10-03T11:33:46Z"
  },
  {
    "title": "'That had to sting': Ex-GOP insider flags response to Trump that may spell the end of MAGA",
    "description": "Donald Trump gave a big speech in front of important people, but the reaction to his presentation could end up hurting MAGA, according to a former GOP strategist.Ex-GOP strategist Rick Wilson, who recently said he might depose Trump in a lawsuit and force the…",
    "link": "https://www.rawstory.com/trump-hegseth-sting-end-maga/",
    "timestamp": "2025-10-03T11:30:22Z"
  },
  {
    "title": "Trust in media at an all-time low according to latest Gallup poll",
    "description": "This comes as no surprise, and yet it remains incredibly disappointing: trust in the media appears to be at an all-time low. In a new Gallup poll, only 28% of […]\nThe post Trust in media at an all-time low according to latest Gallup poll appeared first on Poy…",
    "link": "https://www.poynter.org/commentary/2025/trust-media-all-time-low-gallup/",
    "timestamp": "2025-10-03T11:30:03Z"
  },
  {
    "title": "It May Be Hard to Stop Trump From Privatizing Our Public Lands",
    "description": "This story was originally published by High Country News and is reproduced here as part of the Climate Desk collaboration. In June, a long-standing effort to sell off massive chunks of federal land grew closer to fruition than ever before when a provision man…",
    "link": "https://www.motherjones.com/politics/2025/10/trump-administration-selling-privatizing-public-lands-protest/",
    "timestamp": "2025-10-03T11:30:00Z"
  },
  {
    "title": "Trump asks 9 colleges to commit to political agenda and get better access to federal money",
    "description": "Schools are asked to accept the government's priorities on admissions, women's sports, free speech, student discipline and college affordability, among other topics.",
    "link": "https://roanoke.com/news/nation-world/education/article_45cebd22-e8b2-533e-9781-5715a6785ce1.html",
    "timestamp": "2025-10-03T11:30:00Z"
  },
  {
    "title": "Turkey Says Russian Oil Purchases Up To Firms Amid Trump’s Call",
    "description": "Turkey’s energy minister has said buying Russian oil is a commercial decision made by refiners, signaling reluctance to abide by US President Donald Trump’s calls to cut energy ties with Moscow.",
    "link": "https://financialpost.com/pmn/business-pmn/turkey-says-russian-oil-purchases-up-to-firms-amid-trumps-call",
    "timestamp": "2025-10-03T11:29:49Z"
  },
  {
    "title": "JPMorgan Senior Banker Says Nuclear Exuberance Has Him ‘Worried’",
    "description": "Inside the investment banking division of JPMorgan Chase & Co., there’s concern that enthusiasm for nuclear energy might have gone too far.",
    "link": "https://financialpost.com/pmn/business-pmn/jpmorgan-senior-banker-says-nuclear-exuberance-has-him-worried",
    "timestamp": "2025-10-03T11:29:31Z"
  },
  {
    "title": "Boycott T-Mobile—and All Trump Collaborators",
    "description": "Ever since the Irish Land League organized community members in County Mayo to band together and refuse to serve, work for, trade with, or even deliver mail to the English land agent, Captain Charles Boycott, the boycott has become a staple in activists’ tool…",
    "link": "https://www.commondreams.org/opinion/boycott-t-mobile",
    "timestamp": "2025-10-03T11:29:03Z"
  },
  {
    "title": "Hopes fade for quick end to shutdown as Trump readies layoffs and cuts",
    "description": "The shutdown is now in its third day.",
    "link": "https://www.bostonherald.com/2025/10/03/government-shutdown-third-day/",
    "timestamp": "2025-10-03T11:28:40Z"
  },
  {
    "title": "UN-backed Climate Banking Alliance Ceases Operations",
    "description": "The Net-Zero Banking Alliance, a UN-backed initiative seeking carbon neutral investments by banks, announced Friday its immediate shutdown -- at a time of faltering climate commitments in the United States and Europe.",
    "link": "https://www.ibtimes.com/un-backed-climate-banking-alliance-ceases-operations-3785452",
    "timestamp": "2025-10-03T11:27:16Z"
  },
  {
    "title": "Comey latest target of Trump's weaponized Justice Department",
    "description": "Former FBI Director James Comey faces charges of false statements and obstruction of justice, widely seen as politically motivated revenge by Donald Trump. This follows a pattern of Trump using the Justice Department to target opponents and critics, fulfillin…",
    "link": "https://timesofindia.indiatimes.com/world/us/comey-latest-target-of-trumps-weaponized-justice-department/articleshow/124289897.cms",
    "timestamp": "2025-10-03T11:27:03Z"
  },
  {
    "title": "국민 80%, 트럼프의 외환위기 요구 부당",
    "description": "As Trump threatens to fire thousands of federal workers during the government shutdown, lawsuits are already being filed over what legal experts both inside and outside the administration warn is an illegal plan: Here’s your Evening Briefing https://t.co/ox8s…",
    "link": "https://ryueyes11.tistory.com/511903",
    "timestamp": "2025-10-03T11:23:08Z"
  },
  {
    "title": "How Trump and Netanyahu revived the two-state solution",
    "description": "The Israeli prime minister admitted to the collapse of the right-wing notion of achieving security by ignoring the Palestinian problem or using force alone",
    "link": "https://www.haaretz.com/opinion/2025-10-03/ty-article-opinion/.premium/how-trump-and-netanyahu-have-revived-the-two-state-solution/00000199-9e91-dc12-a5df-9f9b19a20000",
    "timestamp": "2025-10-03T11:18:13Z"
  },
  {
    "title": "Trump's Gaza plan not in line with Muslim countries' proposal, says Pakistan",
    "description": "ISLAMABAD (Reuters) -The 20 points that U.S. President Donald Trump announced this week under his plan to end the war in Gaza were not in line with a draft...",
    "link": "https://www.yahoo.com/news/articles/trumps-gaza-plan-not-line-111738928.html",
    "timestamp": "2025-10-03T11:17:38Z"
  },
  {
    "title": "Hopes fade for quick end to shutdown as Trump readies layoffs and cuts",
    "description": "Hopes fade for quick end to shutdown as Trump readies layoffs and cutsclickondetroit.com",
    "link": "https://www.clickondetroit.com/business/2025/10/03/hopes-fade-for-quick-end-to-shutdown-as-trump-readies-layoffs-and-cuts/",
    "timestamp": "2025-10-03T11:17:05Z"
  },
  {
    "title": "Federal workers share shutdown anxieties and young Trump supporters express frustration: Morning Rundown",
    "description": "Furloughed federal workers were already drained and demoralized by months of layoffs and funding cuts, then came the government shutdown.",
    "link": "https://www.nbcnews.com/news/us-news/federal-workers-share-shutdown-anxieties-young-trump-supporters-expres-rcna235348",
    "timestamp": "2025-10-03T11:10:56Z"
  },
  {
    "title": "Tariffs spur China, India to invest in S. African carmakers",
    "description": "South Africa secured investments from China and India to boost its car manufacturing in a bid to salvage one of the industries hardest hit by Washington’s steep tariffs.\nUS President Donald Trump imposed 30% levies on South African goods over what he claims a…",
    "link": "https://biztoc.com/x/ec1548da23201737",
    "timestamp": "2025-10-03T11:10:53Z"
  },
  {
    "title": "Türkiye rejects US demand to abandon Russian gas",
    "description": "Donald Trump has urged NATO members to scrap Russian energy purchases in exchange for new sanctions on Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625847-turkiye-russian-energy-trump/",
    "timestamp": "2025-10-03T11:10:30Z"
  },
  {
    "title": "Hopes fade for quick end to shutdown as Trump readies layoffs and cuts",
    "description": "WASHINGTON (AP) — Hopes for a quick end to the government shutdown were fading Friday as Republicans and Democrats dug in for a prolonged fight and President Donald Trump readied plans to unleash layoffs and cuts across the federal government. Senators were h…",
    "link": "https://financialpost.com/pmn/hopes-fade-for-quick-end-to-shutdown-as-trump-readies-layoffs-and-cuts",
    "timestamp": "2025-10-03T11:10:10Z"
  },
  {
    "title": "Bay Area universities spend millions on lobbyists in search of favor, funding",
    "description": "Amid increased pressure from President Donald Trump and widespread funding cuts, Bay Area universities have poured millions of dollars into lobbying the federal government this year.\nThe Trump administration has sought major changes to higher education instit…",
    "link": "https://biztoc.com/x/494bd25a15f20075",
    "timestamp": "2025-10-03T11:10:09Z"
  },
  {
    "title": "Will TrumpRx save me money on drugs or not?",
    "description": "President Donald Trump announced a drug pricing deal with Pfizer and a new government website, TrumpRx. | Win McNamee/Getty Images \nPresident Donald Trump announced the latest addition to his personal branding empire this week: TrumpRx, a government website t…",
    "link": "https://biztoc.com/x/558cd4a4af53dad0",
    "timestamp": "2025-10-03T11:09:52Z"
  },
  {
    "title": "Taves: ‘Capitulation wrought by fear,’ top Silicon Valley executives mum to Trump’s extortion",
    "description": "As Donald Trump bulldozes through longtime precedents restraining presidential power over private enterprise, the leaders of Silicon Valley remain quiet.\nJust last month, the president extracted equity from Intel and export taxes from Nvidia and AMD after on-…",
    "link": "https://biztoc.com/x/1ee4591276c9c394",
    "timestamp": "2025-10-03T11:09:44Z"
  },
  {
    "title": "Richard Gere Trashes Trump from Spain: ‘He’s a Dark Presence’ Who’s ‘Almost Destroyed Our Country’ (edited)",
    "description": "Richard Gere has again trashed President Donald Trump, declaring he is \"not only crazy\" but also \"a dark, dark presence\" intent on destroying America.",
    "link": "https://www.breitbart.com/entertainment/2025/10/03/richard-gere-trashes-trump-from-spain-hes-a-dark-presence-whos-almost-destroyed-our-country/",
    "timestamp": "2025-10-03T11:07:42Z"
  },
  {
    "title": "'Signs of psychosis': Trump raises new questions about mental health with 'reaper' video",
    "description": "President Donald Trump posted another bizarre AI-generated video on social media taunting Democrats over the government shutdown, prompting fresh questions about his mental fitness.The animated video is soundtracked by an AI-produced pastiche of Blue Öyster C…",
    "link": "https://www.rawstory.com/trump-truth-social-video-reaper/",
    "timestamp": "2025-10-03T11:06:27Z"
  },
  {
    "title": "Hooray for Brollywood: the UK’s film industry is booming – for now",
    "description": "US production giants are moving operations across the pond, but Trump tariffs threaten to bring British golden era to a sudden end",
    "link": "https://theweek.com/culture-life/film/hooray-for-brollywood-the-uks-film-industry-is-booming-for-now",
    "timestamp": "2025-10-03T11:06:06Z"
  },
  {
    "title": "India can ‘absorb’ shocks amid US tariff pressure- Finance Minister",
    "description": "Stable consumption and steady investment have contributed to growth in the South Asian nation, Nirmala Sitharaman has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625858-india-can-absorb-shocks-amid/",
    "timestamp": "2025-10-03T11:06:04Z"
  },
  {
    "title": "Messenger: St. Louis County man sent a note about Jimmy Kimmel. A TV chairman replied.",
    "description": "When Jerry Goerger wrote to a TV executive about Jimmy Kimmel's TV show, he was surprsied by the response.",
    "link": "https://www.stltoday.com/news/local/column/tony-messenger/article_07269060-4a70-484a-a0e0-c12ed95e4670.html",
    "timestamp": "2025-10-03T11:04:00Z"
  },
  {
    "title": "This agency targets individual Americans and small businesses — it must be reformed",
    "description": "President Trump's IRS hiring freeze protects small businesses from audit expansion as calls grow for tax system reform to level the playing field.",
    "link": "https://www.foxnews.com/opinion/agency-targets-individual-americans-small-businesses-must-reformed",
    "timestamp": "2025-10-03T11:00:54Z"
  },
  {
    "title": "Government shutdown enters 3rd day as Senate stalemate over Obamacare subsidies drags on",
    "description": "Senate Majority Leader John Thune, R-S.D., and Minority Leader Chuck Schumer, D-N.Y., remain deadlocked over government funding as bipartisan talks continue among rank-and-file members.",
    "link": "https://www.foxnews.com/politics/government-shutdown-enters-3rd-day-senate-stalemate-over-obamacare-subsidies-drags",
    "timestamp": "2025-10-03T11:00:13Z"
  },
  {
    "title": "Democrats shut down government over healthcare for illegal immigrants, House GOP whip says",
    "description": "As Democrats attempt to blame the GOP for the government shutdown, House Majority Whip Tom Emmer said the real reason for the shutdown is Sen. Chuck Schumer’s fear of his leftist base.",
    "link": "https://www.foxnews.com/politics/democrats-shut-down-government-over-healthcare-illegal-immigrants-house-gop-whip-says",
    "timestamp": "2025-10-03T11:00:11Z"
  },
  {
    "title": "As Trump's body falters, he’s bringing the health of the Earth down with him",
    "description": "For months now, there have been whispers, rumors ,and online chatter about Donald Trump’s health\r\n, and lately they seem to have grown louder. Although I feel as though the state of his health is rarely given the scrutiny it deserves.",
    "link": "https://www.advocate.com/voices/trump-falters-brings-down-earth",
    "timestamp": "2025-10-03T11:00:04Z"
  },
  {
    "title": "Walmart-backed fintech OnePay is bringing crypto to its banking app, sources say",
    "description": "The move shows that OnePay, founded by Walmart and venture firm Ribbit Capital in 2021, sees crypto as a core offering as it builds out its \"everything app.\"",
    "link": "https://www.cnbc.com/2025/10/03/walmart-onepay-is-rolling-out-crypto-to-mobile-banking-app.html",
    "timestamp": "2025-10-03T11:00:01Z"
  },
  {
    "title": "AI's getting better at faking crowds. Here's why that's cause for concern",
    "description": "Odd fingers and faces in the crowd of a recent Will Smith concert video led to suspicions of AI. But AI is improving fast, and there are serious implications for how \"fake\" crowds might be coopted.",
    "link": "https://www.npr.org/2025/10/03/nx-s1-5528974/will-smith-crowd-ai",
    "timestamp": "2025-10-03T11:00:00Z"
  },
  {
    "title": "The Daily Heller: Satire Reduces Stress",
    "description": "'Spitting Image' is back once again.\nThe post The Daily Heller: Satire Reduces Stress appeared first on PRINT Magazine.",
    "link": "https://www.printmag.com/daily-heller/the-daily-heller-satire-reduces-stress/",
    "timestamp": "2025-10-03T11:00:00Z"
  },
  {
    "title": "US: Informed Health Choices Harder Under Trump",
    "description": "(Washington, DC) – The United States Department of Health and Human Services under the Trump administration appears to be letting politicized and ideological priorities impact the availability of health-related information, Human Rights Watch said today. Resp…",
    "link": "https://www.hrw.org/news/2025/10/03/us-informed-health-choices-harder-under-trump",
    "timestamp": "2025-10-03T11:00:00Z"
  },
  {
    "title": "Links 10/3/2025",
    "description": "Our regal daily links, including farmer bailouts, climate tipping points, rising cognitive impairment, and EU elites lust for war.",
    "link": "https://www.nakedcapitalism.com/2025/10/links-10-3-2025.html",
    "timestamp": "2025-10-03T10:55:19Z"
  },
  {
    "title": "US govt shutdown derails Ukraine support – Telegraph",
    "description": "American officials are unable to deliberate on aid as Kiev is being pressed by Russian troops, the newspaper says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625857-us-shutdown-derails-ukraine-aid/",
    "timestamp": "2025-10-03T10:50:36Z"
  },
  {
    "title": "Altcoins Set to Surge? Trump Weighs $2K Personal Tariff Windfall for Americans",
    "description": "The long-awaited alt season, a bull-market phase characterized by alternative cryptocurrencies (altcoins) outshining bitcoin (BTC), could occur soon, with President Donald Trump considering giving U.S. citizens \"tariff dividends\" in a move that may spark risk…",
    "link": "https://biztoc.com/x/1a2330ae96471611",
    "timestamp": "2025-10-03T10:48:14Z"
  },
  {
    "title": "Shutdown Layoffs Could Hit 'Thousands' of Federal Workers, White House Says",
    "description": "5 min ago\nShutdown Layoffs Could Hit 'Thousands' of Federal Workers, White House Says\nThousands of federal workers could lose their jobs amid the ongoing government shutdown, White House press secretary Karoline Leavitt said Thursday.\nPresident Donald Trump s…",
    "link": "https://biztoc.com/x/dda9b76b86a7d351",
    "timestamp": "2025-10-03T10:47:46Z"
  },
  {
    "title": "Colombia’s Petro Government Once Again Shows Rest of World How to Respond to Israel’s Naked Criminality",
    "description": "Israel, once again, has done what it does best: it has flagrantly broken yet another raft of international laws, this time by “intercepting” the Global Samud Flotilla in international waters and abducting the crews of the flagged vessels that were trying to b…",
    "link": "https://www.nakedcapitalism.com/2025/10/colombias-gustavo-petro-government-once-again-shows-rest-of-world-how-to-respond-to-israels-naked-criminality.html",
    "timestamp": "2025-10-03T10:45:44Z"
  },
  {
    "title": "JD Vance’s shutdown bet: MAGA loves racism more than health care",
    "description": "The vice president's argument assumes it’s better for millions to lose coverage than for one immigrant to gain it",
    "link": "https://www.salon.com/2025/10/03/jd-vances-shutdown-bet-maga-loves-racism-more-than-health-care/",
    "timestamp": "2025-10-03T10:45:04Z"
  },
  {
    "title": "Trump Tries To Give Democrats Hell But Only Shows How Low He Can Go In New Post",
    "description": "The president illuminated his dark side in a devil-may-care take on the Democratic party.",
    "link": "https://www.huffpost.com/entry/donald-trump-democratic-party-evil-satan_n_68df9535e4b061291b14a4ca",
    "timestamp": "2025-10-03T10:44:33Z"
  },
  {
    "title": "Jimmy Fallon floats government shutdown game involving Epstein list: 'Just one name!'",
    "description": "Late night television host Jimmy Fallon floated an idea Thursday for how to make the ongoing government shutdown “fun for the rest of us,” and one involving the Trump administration releasing its trove of files on alleged co-conspirators of Jeffrey Epstein.“T…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674150573/",
    "timestamp": "2025-10-03T10:43:53Z"
  },
  {
    "title": "Prince William says 'change is on my agenda' in candid interview with 'Schitt’s Creek' star",
    "description": "Prince William has said “change is on my agenda” and admitted to being overwhelmed by family stress in an unusually candid interview.",
    "link": "https://www.nbcnews.com/world/europe/prince-william-says-change-agenda-candid-interview-eugene-levy-rcna235354",
    "timestamp": "2025-10-03T10:42:26Z"
  },
  {
    "title": "Putin: US supply of long-range missiles to Kiev will hurt ties",
    "description": "Russian President Vladimir Putin has warned the United States that supplies of long-range missiles to Ukraine will seriously damage relations between Moscow and Washington but will not change the situation on the battlefield, where the Russian army is making …",
    "link": "https://www.hurriyetdailynews.com/putin-us-supply-of-long-range-missiles-to-kiev-will-hurt-ties-214290",
    "timestamp": "2025-10-03T10:42:02Z"
  },
  {
    "title": "CNN Guest Rips ‘Dementia-Addled’ Trump Over His Shutdown Plot",
    "description": "Jack Cocchiarella accused the president of using the shutdown to golf with his buddies.",
    "link": "https://www.thedailybeast.com/cnn-guest-rips-dementia-addled-trump-over-his-shutdown-plot/",
    "timestamp": "2025-10-03T10:41:28Z"
  },
  {
    "title": "The Weak Link in Trump’s Mideast Peace Plan Might Be Trump Himself",
    "description": "Israel and Hamas won’t go willingly.",
    "link": "http://foreignpolicy.com/2025/10/03/trump-gaza-mideast-peace-plan-weak-link/",
    "timestamp": "2025-10-03T10:40:42Z"
  },
  {
    "title": "The Weak Link in Trump’s Mideast Peace Plan Might Be Trump Himself",
    "description": "Israel and Hamas won’t go willingly.",
    "link": "http://foreignpolicy.com/2025/10/03/weak-link-trumps-mideast-peace-plan-trump-himself/",
    "timestamp": "2025-10-03T10:40:42Z"
  },
  {
    "title": "TGIFriday Morning Open Thread: Join the Resistance",
    "description": "Apparently, the charming “Dancing Pedophile Friends” statue is back on the Mall. And, as I said before, \"Remember, Donald Trump did everything that Jeffrey Epstein did. He just did it backwards and in lifts.” [image or embed] — Mrs. Betty Bowers (@mrsbettybow…",
    "link": "https://balloon-juice.com/2025/10/03/tgifriday-morning-open-thread-join-the-resistance/",
    "timestamp": "2025-10-03T10:37:07Z"
  },
  {
    "title": "Mark Cuban says Trump’s new drug platform could succeed if it forces pharma managers to change: ‘If that happens, Trump gets all the credit’",
    "description": "Billionaire venture capitalist Mark Cuban has not shied away from blasting President Donald Trump’s policy decisions, but he said Trump’s latest move just might work.\nThe president announced on Tuesday plans to launch TrumpRx.gov, a federal-government-operate…",
    "link": "https://biztoc.com/x/db45d116fc953b6b",
    "timestamp": "2025-10-03T10:36:36Z"
  },
  {
    "title": "MAGA’s “Voter Fraud” Watchdog Votes in a Swing State. He Doesn’t Live There.",
    "description": "A long paper trail shows that Jack Posobiec casts a ballot in one state and lives in another.",
    "link": "https://slate.com/news-and-politics/2025/10/jack-posobiec-voter-fraud-pizzagate-maga.html",
    "timestamp": "2025-10-03T10:35:11Z"
  },
  {
    "title": "Stephen Colbert Flips JD Vance’s Trump Defense With X-Rated Sombrero-Sofa Meme",
    "description": "Colbert unleashed a pointed X-rated sofa-themed meme after Vance came to the defense of Trump’s stream of sombrero AI “jokes” mocking Democrat leaders.\nThe post Stephen Colbert Flips JD Vance’s Trump Defense With X-Rated Sombrero-Sofa Meme first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-flips-jd-vances-trump-defense-with-x-rated-sombrero-sofa-meme/",
    "timestamp": "2025-10-03T10:33:40Z"
  },
  {
    "title": "'Height of hypocrisy': Dems target Trump for shutdown blame he said presidents should take",
    "description": "WASHINGTON — Heading into the third day of the government shutdown, senators from both parties continue speaking past each other, even as the House of Representatives remains closed for business. Republican leaders continue denying Democrats a seat at the neg…",
    "link": "https://www.rawstory.com/raw-investigates/trump-government-shutdown-2674149454/",
    "timestamp": "2025-10-03T10:33:12Z"
  },
  {
    "title": "South Carolina’s abortion ban could get more extreme",
    "description": "In South Carolina, some Republicans are proposing to eliminate exemptions for rape and incest",
    "link": "https://www.salon.com/2025/10/03/south-carolinas-abortion-ban-could-get-more-extreme/",
    "timestamp": "2025-10-03T10:30:37Z"
  },
  {
    "title": "NIGEL FARAGE MP: Last night [some groups] celebrated the murder of Jews and it was vile",
    "description": "@Nigel_Farage We are a country that allows peaceful protest, but we are not one that allows the celebration of murder. My statement on the Manchester terrorist attack.",
    "link": "https://freerepublic.com/focus/f-chat/4344056/posts",
    "timestamp": "2025-10-03T10:25:42Z"
  },
  {
    "title": "Amelia Earhart mystery could finally be closed after 88 years as expedition launched to investigate 'Taraia object'",
    "description": "Scientists are set to travel to a Pacific Ocean island to investigate the object",
    "link": "https://www.ladbible.com/news/world-news/amelia-earhart-mystery-expedition-planned-taraia-object-274230-20251003",
    "timestamp": "2025-10-03T10:24:27Z"
  },
  {
    "title": "Altcoins Set to Surge? Trump Weighs $2K Personal Tariff Windfall for Americans",
    "description": "The potential rebates could increase investments in alternative cryptocurrencies, according to analysis in a 2023 research paper.",
    "link": "https://www.coindesk.com/markets/2025/10/03/altcoins-set-to-surge-trump-weighs-usd2k-personal-tariff-windfall-for-americans",
    "timestamp": "2025-10-03T10:21:37Z"
  },
  {
    "title": "CNN Guest Lays Into ‘Dementia-Addled Nursing Home Patient’ Trump",
    "description": "Progressive commentator Jack Cocchiarella laid into President Donald Trump, comparing him to a \"dementia-addled nursing home patient.\"\nThe post CNN Guest Lays Into ‘Dementia-Addled Nursing Home Patient’ Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-guest-lays-into-dementia-addled-nursing-home-patient-trump/",
    "timestamp": "2025-10-03T10:20:13Z"
  },
  {
    "title": "Cracker Barrel Cuts Ties With Consulting Firm After Logo Backlash",
    "description": "Cracker Barrel ends partnership with Prophet after customer backlash over logo and store redesign.",
    "link": "https://www.ibtimes.com/cracker-barrel-cuts-ties-consulting-firm-after-logo-backlash-3785445",
    "timestamp": "2025-10-03T10:19:35Z"
  },
  {
    "title": "US Senate to vote on dueling plans to end shutdown, though neither likely to pass",
    "description": "WASHINGTON (Reuters) -The U.S. Senate will vote again on Friday on dueling Democratic and Republican plans to end a government shutdown now entering its third day, though there is no sign that either plan will win passage. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/03/us-senate-to-vote-on-dueling-plans-to-end-shutdown-though-neither-likely-to-pass",
    "timestamp": "2025-10-03T10:17:00Z"
  },
  {
    "title": "Bitcoin Supercycle? Jeff Park Says Gold’s $1 Trillion Gains Could Spark It",
    "description": "In a wide-ranging interview with Anthony Pompliano published on October 2, Jeff Park, partner and Chief Investing Officer at ProCap BTC, argued that gold’s surging price and shifting global ownership patterns are not a threat to Bitcoin—but potentially the ca…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-supercycle-jeff-park-gold-1-trillion/",
    "timestamp": "2025-10-03T10:15:14Z"
  },
  {
    "title": "Notice of insurance rate hikes delayed two weeks in Virginia",
    "description": "Time is running out on expiring federal subsidies for health insurance, but Virginians won't know how much they'll pay in monthly premiums next year until the end of this month.\n\nThe Bureau of Insurance agreed last month to extend the deadline for insurers to…",
    "link": "https://richmond.com/news/state-regional/government-politics/article_d1484805-9cdd-4f2e-8caf-83c8f9b3e4d8.html",
    "timestamp": "2025-10-03T10:15:00Z"
  },
  {
    "title": "Asset Allocation Trends Analysis Report 2025: 23% of HNW Investors Allocate the Largest Component of Their Onshore Wealth to Equities",
    "description": "Amid geopolitical and economic uncertainty, HNW investors are gravitating towards safe-haven assets, with a notable shift to equity funds from 58% in 2016 to 66% in 2024. This trend suggests opportunities in promoting fund products and catering to the evolvin…",
    "link": "https://www.globenewswire.com/news-release/2025/10/03/3160863/28124/en/Asset-Allocation-Trends-Analysis-Report-2025-23-of-HNW-Investors-Allocate-the-Largest-Component-of-Their-Onshore-Wealth-to-Equities.html",
    "timestamp": "2025-10-03T10:14:00Z"
  },
  {
    "title": "Jon Stewart Has Brutally Honest Take On Why Trump Hasn't Attacked Him",
    "description": "The president hasn't gone after \"The Daily Show\" host like he has with Stephen Colbert, Jimmy Kimmel, Seth Meyers and Jimmy Fallon.",
    "link": "https://www.huffpost.com/entry/jon-stewart-cancel-donald-trump_n_68df99b9e4b0dbcd325efd5c",
    "timestamp": "2025-10-03T10:13:45Z"
  },
  {
    "title": "A small Jesuit school in Denver has quietly become a pipeline for powerful Republicans surrounding Trump",
    "description": "A Catholic university nestled in the Rocky Mountains has quietly produced a surprising number of figures who now occupy influential positions within President Donald Trump’s political sphere and the broader conservative movement. \nRegis University, a 148-year…",
    "link": "https://biztoc.com/x/20416f2e308e963e",
    "timestamp": "2025-10-03T10:13:45Z"
  },
  {
    "title": "Japan may be about to make history with its next prime minister",
    "description": "Japan could end up with its first female prime minister or its youngest leader in more than a century after a party leadership election on Saturday.",
    "link": "https://www.nbcnews.com/world/japan/japan-prime-minister-woman-youngest-leader-takaichi-koizumi-rcna235105",
    "timestamp": "2025-10-03T10:13:17Z"
  },
  {
    "title": "Munich airport reopens after drone sightings disrupt flights overnight",
    "description": "Munich Airport was temporarily shut down overnight after several drone sightings in the area, the latest mysterious drone overflights in the airspace of European Union member countries, officials said.",
    "link": "https://www.cbc.ca/news/world/germany-munich-airport-drones-1.7650085",
    "timestamp": "2025-10-03T10:11:47Z"
  },
  {
    "title": "Spain seeks to make abortion a constitutional right, 40 years after legalising it",
    "description": "MADRID (Reuters) -Spain's leftist government plans to enshrine the right to abortion in the constitution amid what it views as a global onslaught on reproductive freedom, Prime Minister Pedro Sanchez said on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/03/spain-seeks-to-make-abortion-a-constitutional-right-40-years-after-legalising-it",
    "timestamp": "2025-10-03T10:09:00Z"
  },
  {
    "title": "'Stopped me cold': Ex-Trump insider reveals 'eyebrow-raising' reason for military meeting",
    "description": "There may be a surprising reason why President Donald Trump and Defense Secretary Pete Hegseth called an in-person meeting of America's top military brass this week, according to a former Trump-world insider. Lev Parnas, who worked as a political operative du…",
    "link": "https://www.rawstory.com/trump-ai-stopped-me-cold/",
    "timestamp": "2025-10-03T10:08:51Z"
  },
  {
    "title": "Fed’s Use of Balance Sheet Wasn’t Unconventional, Says New York Fed’s Williams",
    "description": "Williams, in remarks prepared for an event in Amsterdam on Friday, said monetary policy is commonly understood through “the overly narrow lens” of setting...",
    "link": "https://finance.yahoo.com/news/fed-balance-sheet-wasn-t-100500241.html",
    "timestamp": "2025-10-03T10:05:00Z"
  },
  {
    "title": "Anduril and Palantir battlefield communication system has deep flaws, Army memo says",
    "description": "WASHINGTON :The much-needed modernization of the U.S. Army's battlefield communications network being undertaken by Anduril, Palantir and others is rife with \"fundamental security\" problems and vulnerabilities, and should be treated as a \"very high risk,\" acc…",
    "link": "https://www.channelnewsasia.com/business/anduril-and-palantir-battlefield-communication-system-has-deep-flaws-army-memo-says-5383706",
    "timestamp": "2025-10-03T10:03:26Z"
  },
  {
    "title": "A small Jesuit school in Denver has quietly become a pipeline for powerful Republicans surrounding Trump",
    "description": "Erika Kirk and Lindsey Halligan, two conservative figures who have made headlines recently, both attended Regis University.",
    "link": "https://fortune.com/2025/10/03/regis-university-trump-orbit-erika-kirk-lindsey-halligan-edwin-feulner-conservative-alumni/",
    "timestamp": "2025-10-03T10:03:00Z"
  },
  {
    "title": "Project 2025: Trump uses shutdown to further pursue its goals, no longer distancing himself from it",
    "description": "Since his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce",
    "link": "https://www.thehindubusinessline.com/news/world/project-2025-trump-uses-shutdown-to-further-pursue-its-goals-no-longer-distancing-himself-from-it/article70120764.ece",
    "timestamp": "2025-10-03T10:02:52Z"
  },
  {
    "title": "US soybean farmers, deserted by big buyer China, scramble for other importers",
    "description": "These countries are not typically major customers for soybeans from the U.S. farm belt.  For the first time in more than 20 years, Chinese importers have not...",
    "link": "https://finance.yahoo.com/news/us-soybean-farmers-deserted-big-100207768.html",
    "timestamp": "2025-10-03T10:02:07Z"
  },
  {
    "title": "Terence Corcoran: Indonesia leads Canada & EU to trade deals",
    "description": "Its agreement with Canada may not live up to its billing for Indonesia, but it is better than nothing. Read more from Terence Corcoran",
    "link": "https://financialpost.com/opinion/terence-corcoran-indonesia-leads-canada-eu-to-trade-deals",
    "timestamp": "2025-10-03T10:00:45Z"
  }
]