[
  {
    "title": "No Kings rally: What did it achieve?",
    "description": "The latest ‘No Kings’ march has become the largest protest in U.S. history",
    "link": "https://theweek.com/politics/no-kings-rally-achieve",
    "timestamp": "2025-10-27T21:54:12Z"
  },
  {
    "title": "Argentine markets soar after Javier Milei’s party secures midterm win",
    "description": "Argentine stock, bond and currency markets surged on Monday after President Javier Milei’s party scored a decisive victory in midterm elections over the weekend.",
    "link": "https://www.cnn.com/2025/10/27/business/argentina-stock-market-milei-party-win",
    "timestamp": "2025-10-27T21:53:40Z"
  },
  {
    "title": "Indiana Gov. Mike Braun calls special session to consider new congressional map",
    "description": "It's unclear whether enough Republican lawmakers will support the mid-decade redistricting effort that Trump has urged them to pursue.Indiana Gov. Mike Braun on Monday called a special legislative session to consider redrawing the state's congressional map, t…",
    "link": "https://freerepublic.com/focus/f-news/4348997/posts",
    "timestamp": "2025-10-27T21:52:03Z"
  },
  {
    "title": "California voters have one week left to decide on Prop 50",
    "description": "California voters have until next Tuesday, Nov. 4, to vote on Proposition 50 — which would allow the state to temporarily redraw its congressional maps.With about a week to go before voting is done, we check in on where the race stands and how fundraising is …",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/california-voters-have-one-week-left-to-decide-on-prop-50",
    "timestamp": "2025-10-27T21:51:00Z"
  },
  {
    "title": "Leftist Congressional Hopeful Manny Rutinel Reportedly Aligns with Radical Groups",
    "description": "Manny Rutinel, a leftist running in Colorado's Eight Congressional District, has reportedly aligned himself with radical groups and causes.\nThe post Leftist Congressional Hopeful Manny Rutinel Reportedly Aligns with Radical Groups appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/27/leftist-congressional-hopeful-manny-rutinel-reportedly-aligns-with-radical-groups/",
    "timestamp": "2025-10-27T21:50:37Z"
  },
  {
    "title": "How the Collapse of USAID Set the U.S. Back in Gaza",
    "description": "Humanitarian aid is a key component of Trump’s peace deal. Securing it will depend on American involvement.",
    "link": "https://www.theatlantic.com/health/2025/10/gaza-israel-aid-ceasefire-usaid/684711/",
    "timestamp": "2025-10-27T21:50:27Z"
  },
  {
    "title": "Report: Trump Admin to End UN Role in Refugee Admissions",
    "description": "The Trump administration is reportedly planning on ending the United Nations’ role in refugee admissions. The New York Times reports:Administration officials are not done submitting proposals to the White House. According to a draft of a third report, obtaine…",
    "link": "https://freerepublic.com/focus/f-news/4348994/posts",
    "timestamp": "2025-10-27T21:47:25Z"
  },
  {
    "title": "The Military’s Missile Defense System Cannot Be as Good as It Says",
    "description": "Kathryn Bigelow’s new movie, A House of Dynamite, is more accurate on this point than the Defense Department itself.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/pentagon-house-of-dynamite/684714/",
    "timestamp": "2025-10-27T21:46:26Z"
  },
  {
    "title": "Republican senator warns time is running out to pass US crypto bill: Report",
    "description": "Amid a US government shutdown with no end in sight, a Republican lawmaker said Congress had only until January or February to pass crypto legislation.",
    "link": "https://cointelegraph.com/news/republican-lawmaker-crypto-bills-congress",
    "timestamp": "2025-10-27T21:46:10Z"
  },
  {
    "title": "Brandon Johnson: If You Call Migrants ‘Illegal Aliens’ Then You Must Call Black People ‘Slaves’",
    "description": "Chicago’s self-professed “progressive” Democrat Mayor Brandon Johnson said on Saturday that there are no “illegal aliens” in his city and it is racist to say there are. He went on to say that if we refer to “undocumented individuals” as “illegal aliens,” then…",
    "link": "https://freerepublic.com/focus/f-news/4348992/posts",
    "timestamp": "2025-10-27T21:46:06Z"
  },
  {
    "title": "Toyota 1st-half global sales up 4.7% to record high despite U.S. tariffs",
    "description": "Toyota Motor Corp on Monday reported a 4.7 percent year-on-year increase in its global sales for the April-September period, driven by robust demand for hybrids in North America and China, despite the impact of higher tariffs imposed by U.S. President Donald …",
    "link": "https://japantoday.com/category/business/update1-toyota-1st-half-global-sales-up-4.7-to-record-high-despite-u.s.-tariffs",
    "timestamp": "2025-10-27T21:45:30Z"
  },
  {
    "title": "Trump rejects VP run in 2028, but not ruling out third term",
    "description": "Trump rules out running for VP in 2028, calling it “too cute,” but hints at interest in a third term.",
    "link": "https://www.israelnationalnews.com/news/416916",
    "timestamp": "2025-10-27T21:45:12Z"
  },
  {
    "title": "The Trump Trade Tracker",
    "description": "The latest global picture on Trump’s tariff regime—including who has managed to cut a deal.",
    "link": "http://foreignpolicy.com/2025/10/27/tariffs-trump-trade-deals-talks-us-china-canada-mexico-economy/",
    "timestamp": "2025-10-27T21:44:15Z"
  },
  {
    "title": "Kirk assassination suspect to remain shackled",
    "description": "The 22-year-old Utah man charged with killing Charlie Kirk can appear in court wearing street clothes but must be physically restrained due to security concerns, a judge ruled Monday.",
    "link": "https://www.bostonherald.com/2025/10/27/kirk-assassination-suspect-to-remain-shackled/",
    "timestamp": "2025-10-27T21:43:59Z"
  },
  {
    "title": "Trump visits emperor ahead of meeting with Takaichi",
    "description": "U.S. President Donald Trump landed in Tokyo on Monday evening, beginning the second leg of a three-nation Asia trip to discuss with Japan's new prime minister, Sanae Takaichi, how to steer the future course of the bilateral relationship. Visiting Japan for th…",
    "link": "https://japantoday.com/category/politics/Trump-visits-emperor-ahead-of-meeting-with-Takaichi",
    "timestamp": "2025-10-27T21:43:26Z"
  },
  {
    "title": "Trump says Milei had 'a lot of help' from U.S. for Argentina election win",
    "description": "President Donald Trump said on Monday that Argentina's President Javier Milei had a &quot;lot of help&quot; from the U.S. in his party's midterm election victory, after Trump's administration offered a bailout potentially worth $40 billion to boost Milei ahea…",
    "link": "https://japantoday.com/category/world/trump-says-milei-had-%27a-lot-of-help%27-from-us-for-argentina-election-win1",
    "timestamp": "2025-10-27T21:42:47Z"
  },
  {
    "title": "China's foreign minister speaks with Rubio ahead of Trump-Xi meeting",
    "description": "China hopes the United States can meet it halfway to &quot;prepare for high-level interactions&quot; between the two countries, foreign minister Wang Yi told U.S. Secretary of State Marco Rubio in a phone call on Monday, China's foreign ministry said. Chinese…",
    "link": "https://japantoday.com/category/world/china%27s-foreign-minister-speaks-with-rubio-ahead-of-trump-xi-meeting",
    "timestamp": "2025-10-27T21:42:35Z"
  },
  {
    "title": "Trump wants to cancel more funding during shutdown; courts have hampered his earlier efforts",
    "description": "Congress has the constitutional power of the purse, but President Donald Trump’s robust assertion of executive authority is testing even that basic tenet of U.S. democracy. His administration has already canceled or threatened to cancel billions of dollars of…",
    "link": "https://japantoday.com/category/world/trump-wants-to-cancel-more-funding-during-the-shutdown.-courts-have-hampered-his-earlier-efforts",
    "timestamp": "2025-10-27T21:41:52Z"
  },
  {
    "title": "Kremlin says its test of a nuclear-powered missile reflects security concerns",
    "description": "Russia’s test of a nuclear-powered missile that it claims can’t be stopped by air defenses reflects Moscow’s determination to look out for its security interests, a Kremlin official said Monday, after the United States and European countries increased pressur…",
    "link": "https://japantoday.com/category/world/kremlin-says-its-test-of-a-nuclear-powered-missile-reflects-security-concerns",
    "timestamp": "2025-10-27T21:41:46Z"
  },
  {
    "title": "Trump dismisses 2028 VP run as ‘too cute;’ leaves door open to third term",
    "description": "U.S. President Donald Trump on Monday ruled out running for vice president in the 2028 election but declined to definitively say he would not seek a third term, keeping alive speculation about how he might seek to extend his time in office. Trump has repeated…",
    "link": "https://japantoday.com/category/world/trump-dismisses-2028-vp-run-as-%E2%80%98too-cute-%E2%80%99-leaves-door-open-to-third-term",
    "timestamp": "2025-10-27T21:41:14Z"
  },
  {
    "title": "Barbie, Monopoly toymakers see bright holiday season despite tariff pressure",
    "description": "President Donald Trump’s tariffs are hitting toy giants Mattel and Hasbro as the critical holiday season nears.",
    "link": "https://www.nbcnews.com/business/business-news/hasbro-mattel-toys-trump-tariffs-rcna239429",
    "timestamp": "2025-10-27T21:40:54Z"
  },
  {
    "title": "Trump’s Ballroom Broke the Democrats",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump’s Ballroom Broke the Democrats appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/27/trumps-ballroom-broke-the-democrats/",
    "timestamp": "2025-10-27T21:38:39Z"
  },
  {
    "title": "Weapons Contracting Process Seen as Hurdle to Military Readiness",
    "description": "The warnings aren’t new. For year, think tanks, the government, and the media have all raised concerns over America’s lack of military readiness. Solving the... Read More\nThe post Weapons Contracting Process Seen as Hurdle to Military Readiness   appeared fir…",
    "link": "https://www.dailysignal.com/2025/10/27/weapons-contracting-process-seen-as-hurdle-to-military-readiness/",
    "timestamp": "2025-10-27T21:36:47Z"
  },
  {
    "title": "Farrah Abraham Claims She Was Kicked Out of Grad School For Pro-Charlie Kirk Views",
    "description": "Reading Time: 3 minutesFarrah Abraham is lying about why she got kicked out of college.\nFarrah Abraham Claims She Was Kicked Out of Grad School For Pro-Charlie Kirk Views was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/farrah-abraham-claims-she-was-kicked-out-of-grad-school-for-pro-charlie-kirk-views/",
    "timestamp": "2025-10-27T21:36:26Z"
  },
  {
    "title": "U.S. President Donald Trump has praised Japan's new Prime Minister Sanae Takaichi for being ideologically close to the country's former leader Shinzo Abe. What are your thoughts on that?",
    "description": "",
    "link": "https://japantoday.com/category/have-your-say/u.s.-president-donald-trump-has-praised-japan%27s-new-prime-minister-sanae-takaichi-for-being-ideologically-close-to-the-country%27s-former-leader-shinzo-abe.-what-are-your-thoughts-on-that",
    "timestamp": "2025-10-27T21:36:20Z"
  },
  {
    "title": "New Jerseyans expected to pay nearly 175 percent more for health insurance on exchange",
    "description": "The spike is attributed to the expiration of enhanced federal health insurance subsidies, the key sticking point of the federal government shutdown, the...",
    "link": "https://www.politico.com/news/2025/10/27/new-jerseyans-expected-to-pay-174-percent-more-for-health-insurance-on-exchange-00623995",
    "timestamp": "2025-10-27T21:35:43Z"
  },
  {
    "title": "Moscow remains ready for Putin-Trump talks – presidential aide",
    "description": "Russia is prepared for a Putin-Trump summit, presidential aide Yury Ushakov says Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627037-putin-trump-meeting-ushakov/",
    "timestamp": "2025-10-27T21:35:15Z"
  },
  {
    "title": "A Donor-Funded Army Wouldn’t Just Be Illegal—It Would be Dangerous",
    "description": "You don’t need a political-science degree to understand why wealthy individuals cutting secret checks to the president to pay the military is a bad idea.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/trump-donor-funded-military/684713/",
    "timestamp": "2025-10-27T21:35:00Z"
  },
  {
    "title": "Trump Costumes Are Out in Canada This Halloween",
    "description": "Once a Halloween favorite, Donald Trump costumes are no longer in demand in Canada, with costume shops reporting a sharp drop in interest amid ongoing trade tensions. Shop owners say Trump costumes were all the rage in 2016, when he was first running for pres…",
    "link": "https://www.newser.com/story/377586/trump-costumes-are-out-in-canada-this-halloween.html",
    "timestamp": "2025-10-27T21:34:28Z"
  },
  {
    "title": "The US has exported democracy again. Not with bombs this time, but that doesn’t make it better",
    "description": "Washington has effectively bailed out Argentinian President Javier Milei, allowing him continue his chainsaw rampage against his own country Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627021-us-exported-democracy-argentina/",
    "timestamp": "2025-10-27T21:34:24Z"
  },
  {
    "title": "Federal Immigration Agents Accused of Tear-Gassing Peaceful Protestors, Pointing Gun at Veterans in Chicago",
    "description": "The actions would violate a federal order imposed by U.S. District Court Judge Sara L. Ellis to limit the use of nonlethal weapons and other crowd control tactics.",
    "link": "https://reason.com/2025/10/27/federal-immigration-agents-accused-of-tear-gassing-peaceful-protestors-pointing-gun-at-veterans-in-chicago/",
    "timestamp": "2025-10-27T21:32:48Z"
  },
  {
    "title": "Cigna will end drug rebates in many private health plans",
    "description": "The change will initially apply to about 2 million of Cigna’s fully insured members.",
    "link": "https://www.bostonherald.com/2025/10/27/cigna-pbm-drug-rebates/",
    "timestamp": "2025-10-27T21:32:29Z"
  },
  {
    "title": "Cigna will end drug rebates in many private health plans",
    "description": "The change will initially apply to about 2 million of Cigna’s fully insured members.",
    "link": "https://www.denverpost.com/2025/10/27/cigna-pbm-drug-rebates/",
    "timestamp": "2025-10-27T21:32:29Z"
  },
  {
    "title": "Canada needs to invest in its youth if it wants economy to grow, retiring CIBC CEO says",
    "description": "Despite the current economic hurdles and United States president \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n ’s \n \n \n \n \n \n \n \n \n \n tariff threats\n \n \n \n \n \n \n \n \n \n , Canada “will be OK,” says \n \n \n \n \n \n \n \n \n \n Canadian Imperial Bank of Commerce\n \n…",
    "link": "https://biztoc.com/x/f3ba54f568bc9793",
    "timestamp": "2025-10-27T21:30:57Z"
  },
  {
    "title": "President Trump Describes The Back-to-Back U.S. Navy Aircraft Crashes in The South China Sea As “Very Unusual”",
    "description": "The U.S.\nThe post President Trump Describes The Back-to-Back U.S. Navy Aircraft Crashes in The South China Sea As “Very Unusual” appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/president-trump-describes-back-back-u-s-navy/",
    "timestamp": "2025-10-27T21:30:44Z"
  },
  {
    "title": "AOC Mocks Trump Over Low IQ Claim: 'Did Those Doctors Ask You To Draw a Clock By Any Chance?'",
    "description": "Democratic Rep. Alexandria Ocasio-Cortez mocked President Donald Trump after he claimed she \"is low IQ.\"",
    "link": "https://www.ibtimes.com/aoc-mocks-trump-over-low-iq-claim-did-those-doctors-ask-you-draw-clock-any-chance-3788582",
    "timestamp": "2025-10-27T21:30:26Z"
  },
  {
    "title": "The GOP's move to take Mamdani national: From the Politics Desk",
    "description": "Republicans are increasingly eager to elevate New York City mayoral front-runner Zohran Mamdani ahead of next year's midterm elections.",
    "link": "https://www.nbcnews.com/politics/politics-news/gop-move-take-mamdani-national-politics-desk-rcna240141",
    "timestamp": "2025-10-27T21:30:00Z"
  },
  {
    "title": "Anwar Turns Malaysia Into Stage for Dealmaking With Trump’s Help",
    "description": "From the moment US President Donald Trump stepped off the plane in Kuala Lumpur on Sunday, it was clear that he and his Malaysian counterpart Anwar Ibrahim shared a rapport.",
    "link": "https://financialpost.com/pmn/business-pmn/anwar-turns-malaysia-into-stage-for-dealmaking-with-trumps-help",
    "timestamp": "2025-10-27T21:25:09Z"
  },
  {
    "title": "Canada needs to invest in its youth if it wants economy to grow, retiring CIBC CEO says",
    "description": "Retiring CIBC CEO Victor Dodig said Canada needs to implement policies that can help young people in order for its economy to grow. Read on.",
    "link": "https://financialpost.com/fp-finance/banking/canada-invest-youth-economy-grow-cibc-ceo",
    "timestamp": "2025-10-27T21:25:01Z"
  },
  {
    "title": "Trump administation narrows list of potential Federal Reserve chairs to 5",
    "description": "WASHINGTON (AP) — Treasury Secretary Scott Bessent on Monday confirmed the names of five candidates to replace Jerome Powell as chair of the powerful Federal Reserve next year. On an Air Force One flight to Asia with President Donald Trump, Bessent said he wo…",
    "link": "https://financialpost.com/pmn/trump-administation-narrows-list-of-potential-federal-reserve-chairs-to-5",
    "timestamp": "2025-10-27T21:24:47Z"
  },
  {
    "title": "Push for Ukraine ceasefire collapses",
    "description": "Talks between Donald Trump and Vladimir Putin were called off after the Russian president refused to compromise on his demands",
    "link": "https://theweek.com/politics/ukraine-ceasefire-collapses-trump-putin",
    "timestamp": "2025-10-27T21:24:34Z"
  },
  {
    "title": "White House claims 9th war ended under Trump as GameStop declares end to Console Wars",
    "description": "GameStop responded with an edited image of President Donald Trump shaking hands with Spartan-117 aka \"Master Chief,\" the main character of the Halo franchise. The White House, this week, jokingly added the \"Console Wars\" to the list of conflicts ended under t…",
    "link": "https://freerepublic.com/focus/f-chat/4348987/posts",
    "timestamp": "2025-10-27T21:23:11Z"
  },
  {
    "title": "The annual 'check-in' with ICE: Now a fraught event for migrants",
    "description": "The line forms for immigrants awaiting check-ins with Immigration and Customs Enforcement agents at 26 Federal Plaza, the federal government complex in Lower Manhattan.\n \n\nMore and more immigrants are being arrested when they show up for their appointments, a…",
    "link": "https://gothamist.com/news/the-annual-check-in-with-ice-now-a-fraught-event-for-migrants",
    "timestamp": "2025-10-27T21:23:00Z"
  },
  {
    "title": "Trump will meet Japan’s new prime minister and address US troops in next stop on Asia trip",
    "description": "Trump seeks $550 billion in Japanese investment to reduce U.S. tariffs.",
    "link": "https://www.bostonherald.com/2025/10/27/trump-japan-visit/",
    "timestamp": "2025-10-27T21:22:58Z"
  },
  {
    "title": "Stormy Daniels, Joey Buttafuoco and Steve Martin: Judd Apatow reveals his most hilarious, ridiculous behind-the-scenes moments",
    "description": "The comedy mastermind has a new memoir out.",
    "link": "https://pagesix.com/2025/10/27/entertainment/stormy-daniels-joey-buttafuoco-and-steve-martin-judd-apatow-reveals-his-most-hilarious-ridiculous-behind-the-scenes-moments/",
    "timestamp": "2025-10-27T21:22:42Z"
  },
  {
    "title": "A federal workers' union just ratcheted up the shutdown pressure on Dems",
    "description": "The union of federal workers, AFGE, condemned the government shutdown — but Democrats need to worry more, especially with a food stamps crisis looming.",
    "link": "https://www.msnbc.com/top-stories/latest/government-shutdown-democrats-federal-union-afge-food-stamps-rcna240072",
    "timestamp": "2025-10-27T21:21:51Z"
  },
  {
    "title": "Hunter Biden Goes Scorched-Earth On Trump Cuts: '14 Million People Will Die'",
    "description": "He deemed the current state of the Trump administration his \"nightmare scenario,\" noting: \"We’re not sliding into autocracy. We’re right in the middle of it.\"",
    "link": "https://www.huffpost.com/entry/hunter-biden-trump-usaid-cuts_n_68ffbfa3e4b0ebfddfbb441a",
    "timestamp": "2025-10-27T21:21:14Z"
  },
  {
    "title": "'The View' Warns That Trump's Third-Term Threats Are No Joke (Kelby Vera/HuffPost)",
    "description": "Kelby Vera / HuffPost:\n‘The View’ Warns That Trump's Third-Term Threats Are No Joke  —  “Well, you-know-who told us he was going to be a dictator on day one and, damn, if he isn't a dictator!”  Whoopi Goldberg told audiences on Monday.  —  “The View” just war…",
    "link": "https://www.memeorandum.com/251027/p105",
    "timestamp": "2025-10-27T21:20:01Z"
  },
  {
    "title": "UFC Fighter Who Vowed To Take A Bullet For Trump Has Revelation (David Moye/HuffPost)",
    "description": "David Moye / HuffPost:\nUFC Fighter Who Vowed To Take A Bullet For Trump Has Revelation  —  Bryce Mitchell, who once called Hitler a “good guy,” made a wild claim of biblical proportions about the president.  —  Donald Trump has one less person willing to take…",
    "link": "https://www.memeorandum.com/251027/p104",
    "timestamp": "2025-10-27T21:20:01Z"
  },
  {
    "title": "In next stop on Asia trip, Trump will meet Japan’s new prime minister and address U.S. troops",
    "description": "President Donald Trump begins one of his busiest days of his Asia trip on Tuesday, meeting with the new Japanese prime minister, speaking to U.S. troops aboard an aircraft carrier and mingling with business leaders.",
    "link": "https://biztoc.com/x/b53fa43ae044d839",
    "timestamp": "2025-10-27T21:19:39Z"
  },
  {
    "title": "Trump administation narrows list of potential Federal Reserve chairs to 5",
    "description": "Treasury Secretary Scott Bessent on Monday confirmed the names of five candidates to replace Jerome Powell as chair of the powerful Federal Reserve next year...",
    "link": "https://finance.yahoo.com/news/trump-administation-narrows-list-potential-211823658.html",
    "timestamp": "2025-10-27T21:18:23Z"
  },
  {
    "title": "DHS: Cowardly Chicago Mayor says, “Let’s move on” when asked about an illegal alien who grabbed a woman, bashed her head into a sidewalk, knocked her unconscious, and raped her,",
    "description": "Homeland Security @DHSgov COWARDLY, @ChicagosMayor . When asked about an illegal alien who grabbed a woman, bashed her head into a sidewalk, knocked her unconscious, and raped her, his only response was “Let’s move on.” Brandon Johnson’s sanctuary city polici…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348986/posts",
    "timestamp": "2025-10-27T21:18:01Z"
  },
  {
    "title": "Trump Seemingly Confuses Dementia Test for IQ Test, Brags About His Results",
    "description": "President Donald Trump is seemingly having some confusion about the test he just took. The 79-year-old President of the United States spoke to reporters on Monday (October 27) on Air Force One. During the meeting with press, he seemingly bragged about his res…",
    "link": "https://www.justjared.com/2025/10/27/trump-seemingly-confuses-dementia-test-for-iq-test-brags-about-results/",
    "timestamp": "2025-10-27T21:17:25Z"
  },
  {
    "title": "Trump Seemingly Confuses Dementia Test for IQ Test, Brags About His Results",
    "description": "President Donald Trump is seemingly having some confusion about the test he just took. The 79-year-old President of the United States spoke to reporters on Monday (October 27) on Air Force One. During the meeting with press, he seemingly bragged about his res…",
    "link": "https://www.justjared.com/2025/10/27/trump-seemingly-confuses-dementia-test-for-iq-test-brags-about-his-results/",
    "timestamp": "2025-10-27T21:17:25Z"
  },
  {
    "title": "In next stop on Asia trip, Trump will meet Japan’s new prime minister and address U.S. troops",
    "description": "President Donald Trump begins one of his busiest days of his Asia trip on Tuesday, meeting with the new Japanese prime minister, speaking to U.S. troops aboard an aircraft carrier and mingling with business leaders.",
    "link": "https://www.pbs.org/newshour/world/in-next-stop-on-asia-trip-trump-will-meet-japans-new-prime-minister-and-address-u-s-troops",
    "timestamp": "2025-10-27T21:17:04Z"
  },
  {
    "title": "Wall Street hits new highs on tech earnings, trade optimism | Honolulu Star-Advertiser",
    "description": "Wall Street’s main indexes posted record closing highs for the second day in a row today as investors were hopeful about the prospects for a U.S.-China trade deal and looked forward to a week packed with high-profile technology earnings and a widely expected …",
    "link": "https://www.staradvertiser.com/2025/10/27/breaking-news/wall-street-hits-new-highs-on-tech-earnings-trade-optimism/",
    "timestamp": "2025-10-27T21:17:03Z"
  },
  {
    "title": "JORGE MARTINEZ: When Suffering Becomes A Democratic Campaign Tactic",
    "description": "When a top Democrat says that “families are going to suffer” because it gives their party “leverage,” it should make every American pause.",
    "link": "https://dailycaller.com/2025/10/27/opinion-when-suffering-becomes-a-democratic-campaign-tactic-jorge-martinez/",
    "timestamp": "2025-10-27T21:15:54Z"
  },
  {
    "title": "Gold prices drive S&P/TSX composite lower, U.S. markets rise on China trade rhetoric",
    "description": "TORONTO — Canada’s main stock index finished lower, weighed down by declining gold prices, while U.S. stock markets hit new highs amid positive U.S.-China trade sentiment. Dustin Reid, chief strategist for fixed income at Mackenzie Investments, said falling g…",
    "link": "https://financialpost.com/pmn/gold-prices-drive-sp-tsx-composite-lower-u-s-markets-rise-on-china-trade-rhetoric",
    "timestamp": "2025-10-27T21:11:04Z"
  },
  {
    "title": "Sean 'Diddy' Combs' Prison Release Date Revealed... as Disgraced Rapper Pins Pardon Hopes on Trump While He Rots Behind Bars",
    "description": "Sean 'Diddy' Combs has been given a release date one-month after he was sentenced to 50-months behind bars.",
    "link": "https://radaronline.com/p/sean-diddy-combs-prison-release-date-revealed/",
    "timestamp": "2025-10-27T21:10:00Z"
  },
  {
    "title": "UN Human Rights Office Warns Israeli Settler Violence in West Bank Is “Surging”",
    "description": "The UN Human Rights office for Palestine has warned that Israel is rapidly accelerating its campaign to annex the occupied West Bank, with settlers adding outposts at a pace …",
    "link": "https://truthout.org/articles/un-human-rights-office-warns-israeli-settler-violence-in-west-bank-is-surging/",
    "timestamp": "2025-10-27T21:09:57Z"
  },
  {
    "title": "Photos: Zohran Mamdani's NYC Rally Crowd Size Compared to Donald Trump",
    "description": "Over 10,000 people gathered for Mamdani’s rally on Sunday at Forest Hills Stadium",
    "link": "https://biztoc.com/x/5a1a966d8914a215",
    "timestamp": "2025-10-27T21:08:27Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing can wear street clothes in court amid ‘extraordinary’ attention",
    "description": "The 22-year-old Utah man charged with killing Charlie Kirk can appear in court wearing street clothes but must be physically restrained due to security concerns, a judge ruled Monday.",
    "link": "https://www.pbs.org/newshour/nation/suspect-in-charlie-kirk-killing-can-wear-street-clothes-in-court-amid-extraordinary-attention",
    "timestamp": "2025-10-27T21:07:09Z"
  },
  {
    "title": "12-year-old Honduran girl allegedly tortured by sponsors after entering US as unaccompanied minor",
    "description": "A Honduran child who entered the U.S. alone was beaten, starved, and restrained by her sponsors, according to court documents.",
    "link": "https://www.foxnews.com/us/12-year-old-honduran-girl-allegedly-tortured-sponsors-entering-u-s-unaccompanied-minor",
    "timestamp": "2025-10-27T21:06:58Z"
  },
  {
    "title": "Basel Accord’s expanded banking rules could tank Trump’s economy — unless he acts fast",
    "description": "The Trump team is oddly frozen about extending international banking rules on more US banks — rules that in the past may have led the global economy into repeated disaster.",
    "link": "https://nypost.com/2025/10/27/opinion/basel-accords-expanded-banking-rules-could-tank-trumps-economy/",
    "timestamp": "2025-10-27T21:06:29Z"
  },
  {
    "title": "Diddy’s Release Date and Probation Terms Set by Bureau of Prisons",
    "description": "Sean \"Diddy\" Combs has learned the date he'll be a free man again and the terms of his future release after his conviction in his sex trafficking trial.\nThe post Diddy’s Release Date and Probation Terms Set by Bureau of Prisons first appeared on Mediaite.",
    "link": "https://www.mediaite.com/crime/diddys-release-date-and-probation-terms-set-by-bureau-of-prisons/",
    "timestamp": "2025-10-27T21:03:30Z"
  },
  {
    "title": "National Guard troops stun with rare vow to defy Trump's orders: 'Stand up to the Gestapo'",
    "description": "President Donald Trump might be the commander in chief, but two National Guard soldiers vowed to refuse to follow his orders if they conflict with the law and the Constitution. Two Illinois National Guard members told CBS News that they want no part of deploy…",
    "link": "https://www.rawstory.com/national-guard-chicago/",
    "timestamp": "2025-10-27T21:03:02Z"
  },
  {
    "title": "US-China Summit: What does Trump hope to accomplish?",
    "description": "Mick Mulvaney, budget director in the first Trump administration, said the meeting between Presidents Donald Trump and Xi ...",
    "link": "https://biztoc.com/x/595965172a4b7b73",
    "timestamp": "2025-10-27T21:02:48Z"
  },
  {
    "title": "JB Pritzker Insists He Never ‘Suggested Donald Trump is Hitler’ — MSNBC’s Nicolle Wallace Adds ‘I Don’t Think Any Democrat Has’",
    "description": "Illinois Gov. JB Pritzker (D), a week after comparing the USA to Nazi Germany, claimed he never \"suggested Donald Trump is Hitler\"\nThe post JB Pritzker Insists He Never ‘Suggested Donald Trump is Hitler’ — MSNBC’s Nicolle Wallace Adds ‘I Don’t Think Any Democ…",
    "link": "https://www.mediaite.com/media/jb-pritzker-insists-he-never-suggested-donald-trump-is-hitler-msnbcs-nicolle-wallace-adds-i-dont-think-any-democrat-has/",
    "timestamp": "2025-10-27T21:01:58Z"
  },
  {
    "title": "Most Voters Reject Federal Control Of Education In New Poll",
    "description": "Only 11% of voters believe the federal government should be involved in setting national education standards, a new poll released Sunday reveals.",
    "link": "https://dailycaller.com/2025/10/27/most-voters-reject-federal-control-of-education-in-new-poll/",
    "timestamp": "2025-10-27T21:01:42Z"
  },
  {
    "title": "Scott Bessent rejects NBC host’s narrative that Trump is to blame for ongoing shutdown",
    "description": "U.S. Treasury Secretary Scott Bessent blamed Senate Minority Leader Chuck Schumer for prolonging the government shutdown, saying Democrats need to vote to reopen the government.",
    "link": "https://www.foxnews.com/media/scott-bessent-rejects-meet-press-hosts-narrative-trump-blame-ongoing-shutdown",
    "timestamp": "2025-10-27T21:00:48Z"
  },
  {
    "title": "Trump, Takaichi Seek New Trade, Security Opportunities to Counter China",
    "description": "After signing several trade deals at the ASEAN summit, the U.S. president is turning his attention to Washington’s East Asian partners.",
    "link": "http://foreignpolicy.com/2025/10/27/trump-takaichi-japan-trade-china-asean-apec-xi-jinping/",
    "timestamp": "2025-10-27T21:00:46Z"
  },
  {
    "title": "NEWS: Doctors Raise Questions Over Trump's Health Due to Lack of White House Transparency",
    "description": "Doctors raise questions due to lack of transparency from White House over Trump's health, Hochul announces $30 million to pay for 16 million meals, Air traffic delays grow substantial, and more",
    "link": "https://aaronparnas.substack.com/p/news-doctors-raise-questions-over",
    "timestamp": "2025-10-27T20:59:56Z"
  },
  {
    "title": "Powerful union abandons Dems, urges them to end Schumer shutdown by taking Republican deal",
    "description": "Pressure on party explodes as workers say they are fed up",
    "link": "https://www.wnd.com/2025/10/powerful-union-abandons-dems-urges-them-end-schumer/",
    "timestamp": "2025-10-27T20:59:34Z"
  },
  {
    "title": "AOC Rallies for Mamdani: ‘They Want Us to Think We Are Crazy--We Are Sane’",
    "description": "Rep. Alexandria Ocasio-Cortez (D-NY) joined New York City mayoral nominee Zohran Mamdani (D) at a weekend rally in Queens, evoking the city’s immigrant roots and calling on supporters to reject claims that their movement is “crazy” or “outlandish.” Ocasio-Cor…",
    "link": "https://freerepublic.com/focus/f-news/4348983/posts",
    "timestamp": "2025-10-27T20:59:02Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing can wear street clothes in court amid ‘extraordinary’ attention",
    "description": "Attorneys for Tyler Robinson argued images of him shackled and in jail clothing would spread widely.",
    "link": "https://www.bostonherald.com/2025/10/27/suspect-charlie-kirk-street-clothes/",
    "timestamp": "2025-10-27T20:57:16Z"
  },
  {
    "title": "EXCLUSIVE: Trump on Track to Recoup $10M Improperly Paid to Agency’s Senior Executives Under Biden",
    "description": "FIRST ON THE DAILY SIGNAL—The Biden administration’s Department of Veterans Affairs improperly awarded $10.8 million in bonuses meant for staffers who directly serve veterans to... Read More\nThe post EXCLUSIVE: Trump on Track to Recoup $10M Improperly Paid to…",
    "link": "https://www.dailysignal.com/2025/10/27/exclusive-trump-on-track-to-recoup-10m-improperly-paid-to-agencys-senior-executives-under-biden/",
    "timestamp": "2025-10-27T20:55:52Z"
  },
  {
    "title": "California Reveals Plan to Fight Trump’s “Election Monitors”",
    "description": "California will send election observers to counter the “election monitors” that Trump plans on sending to multiple deep blue districts in the state ahead of next week’s special election.“They’re not going to be allowed to interfere in ways that the law prohib…",
    "link": "https://newrepublic.com/post/202325/california-plan-fight-trump-election-monitors",
    "timestamp": "2025-10-27T20:55:12Z"
  },
  {
    "title": "Business Owner Urges People to Stand Up to Trump With Wild T-Shirt",
    "description": "The Irish have had enough of Donald Trump.McCormack’s Irish Pub in Richmond, Virginia, made waves earlier this month when its owner, William “Mac” McCormack, released some hot merchandise: a load of “Fuck Trump” black T-shirts, retailing for $11 a pop.The shi…",
    "link": "https://newrepublic.com/post/202317/business-owner-stand-up-donald-trump-t-shirt-virginia",
    "timestamp": "2025-10-27T20:54:55Z"
  },
  {
    "title": "Trump dismisses 2028 VP run as ‘too cute,’ leaves door open to third term",
    "description": "ABOARD AIR FORCE ONE: US President Donald Trump on Monday (Oct 27) ruled out running for vice president in the 2028 election but declined to definitively say he would not seek a third term,",
    "link": "https://www.channelnewsasia.com/world/trump-dismisses-2028-vp-run-too-cute-leaves-door-open-third-term-5427531",
    "timestamp": "2025-10-27T20:54:48Z"
  },
  {
    "title": "US government uses Halo images in a call to 'destroy' immigration, Microsoft declines to comment",
    "description": "The social media posts also included an image of US president Donald Trump dressed up as Master Chief.",
    "link": "https://www.pcgamer.com/games/us-government-uses-halo-images-in-a-call-to-destroy-immigration-microsoft-declines-to-comment/",
    "timestamp": "2025-10-27T20:52:51Z"
  },
  {
    "title": "Nine months later, that body of water down south is still the “Gulf of Mexico” to news outlets",
    "description": "Donald Trump didn’t struggle to win the Florida town of Longboat Key in 2024. With a median age of 71.5 — only 6% of its residents are under 50 — it’s the sort of retirement community that built up his margin statewide. Think The Villages, but with better tar…",
    "link": "https://www.niemanlab.org/2025/10/nine-months-later-that-body-of-water-down-south-is-still-the-gulf-of-mexico-to-news-outlets/",
    "timestamp": "2025-10-27T20:50:55Z"
  },
  {
    "title": "AMD’s AI Chips to Power Supercomputers at Energy Department Lab",
    "description": "Advanced Micro Devices Inc. is teaming up with the US Energy Department to develop a pair of supercomputers at the Oak Ridge National Laboratory that will deploy the company’s artificial intelligence chips to seek breakthroughs in energy and scientific resear…",
    "link": "https://financialpost.com/pmn/business-pmn/amds-ai-chips-to-power-supercomputers-at-energy-department-lab",
    "timestamp": "2025-10-27T20:49:18Z"
  },
  {
    "title": "Bad Luck: Trump Says The Missing Epstein Files Were In The East Wing And Have Now Been Destroyed",
    "description": "WASHINGTON, D.C. — The Jeffrey Epstein case is now formally closed following an announcement by President Donald Trump that all the missing Epstein files were in the East Wing of the White House and have now been destroyed.",
    "link": "https://babylonbee.com/news/bad-luck-trump-says-the-missing-epstein-files-were-in-the-east-wing-and-have-now-been-destroyed",
    "timestamp": "2025-10-27T20:48:25Z"
  },
  {
    "title": "What is the Insurrection Act? Here’s what Trump has said about using it",
    "description": "Experts told PBS News that worries about the Insurrection Act arise from legal uncertainty about how it can be applied.",
    "link": "https://www.pbs.org/newshour/politics/what-is-the-insurrection-act-heres-what-trump-has-said-about-using-it",
    "timestamp": "2025-10-27T20:46:32Z"
  },
  {
    "title": "HHS Employees Now Being Measured By Loyalty To Trump's Policies",
    "description": "In annual performance reviews, federal workers will be assessed on whether they “clearly and demonstrably support implementation” of Trump’s agenda.",
    "link": "https://www.huffpost.com/entry/hhs-employees-trump-loyalty-performance-reviews_n_68ffa3b7e4b0ebfddfbaf88c",
    "timestamp": "2025-10-27T20:45:54Z"
  },
  {
    "title": "Local GOP official's social media post draws backlash in Kentucky for its depiction of the Obamas",
    "description": "A local Republican leader in Kentucky has drawn a strong backlash after sharing a social media video depicting former President Barack Obama and his wife as apes",
    "link": "https://abcnews.go.com/Politics/wireStory/local-gop-officials-social-media-post-draws-backlash-126912894",
    "timestamp": "2025-10-27T20:45:46Z"
  },
  {
    "title": "New Lawsuit Seeks to Challenge NYC’s Lone Republican District",
    "description": "In a new lawsuit, a group of Staten Island residents allege the boundaries of the 11th District dilute the voting power of the borough’s Black and Latino voters.",
    "link": "http://nymag.com/intelligencer/article/new-lawsuit-seeks-to-redraw-nyc-cd11-only-republican-district.html",
    "timestamp": "2025-10-27T20:43:12Z"
  },
  {
    "title": "Fox News Politics Newsletter: Hamas to return hostage body amid Trump warning",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-hamas-return-hostage-body-amid-trump-warning",
    "timestamp": "2025-10-27T20:41:36Z"
  },
  {
    "title": "Group Calls on Illinois AG to Open Probe Into 'Unlawful Actions of Federal Agents' in Chicago",
    "description": "A legal advocacy group requested on Monday that the Illinois officials open criminal investigations into the \"unlawful\" conduct of federal agents deployed to Chicago by President Donald Trump.Free Speech For People, a national pro-democracy nonprofit, called …",
    "link": "https://www.commondreams.org/news/group-calls-for-illinois-investigate-feds",
    "timestamp": "2025-10-27T20:41:36Z"
  },
  {
    "title": "Exclusive—Survey: Rep. Mike Collins Leads Georgia GOP Senate Primary Despite Establishment Opposition",
    "description": "Republicans are vying to snag the seat of Democrat Sen. Jon Ossoff (D-GA), who has been dubbed the \"most vulnerable\" Democrat up for reelection.\nThe post Exclusive—Survey: Rep. Mike Collins Leads Georgia GOP Senate Primary Despite Establishment Opposition app…",
    "link": "https://www.breitbart.com/politics/2025/10/27/exclusive-survey-rep-mike-collins-leads-georgia-gop-senate-primary-despite-establishment-opposition/",
    "timestamp": "2025-10-27T20:40:40Z"
  },
  {
    "title": "Shoe Firms Should Get a Break as China Tariff Extension is Likely",
    "description": "China tariffs are expected to stay at a temporary 30 percent rate as the US and China are likely to extend trade talks for the third time.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/china-tariffs-30-percent-extend-trade-talks-shoes-footwear-1238325793/",
    "timestamp": "2025-10-27T20:40:30Z"
  },
  {
    "title": "'FAKE!': Demented Don Demands Ban On Ads Showing His Bad Poll Numbers",
    "description": "After arriving in Japan to meet with Prime Minister Sanae Takaichi, Donald Trump took to Truth Social to unleash a crazy-time post, insisting that his poll numbers are good, and the economy is \"strong.\" He also claimed that energy prices are rapidly falling, …",
    "link": "https://crooksandliars.com/2025/10/trump-demands-ban-ads-showing",
    "timestamp": "2025-10-27T20:39:31Z"
  },
  {
    "title": "EXCLUSIVE: How Donald Trump’s Secret 'Third Term' Plot Could Backfire... and Pave the Way for Barack Obama to Make a Shocking Oval Office Comeback",
    "description": "There have been growing rumors that Trump could be strongly considering another run, including having \"a plan in the works\" to ensure a victory.",
    "link": "https://radaronline.com/p/donald-trump-third-term-backfire-barack-obama-oval-office-comeback/",
    "timestamp": "2025-10-27T20:39:01Z"
  },
  {
    "title": "Republican senator calls Trump’s military airstrikes ‘extrajudicial killings’",
    "description": "The Trump administration’s military airstrikes against boats off Venezuela’s coast that the White House claims were being used for drug trafficking are “extrajudicial killings”, said Rand Paul, the president’s fellow Republican and US senator from Kentucky. P…",
    "link": "https://freerepublic.com/focus/f-news/4348978/posts",
    "timestamp": "2025-10-27T20:39:00Z"
  }
]