[
  {
    "title": "Trump criticizes UN in address, but says US is behind organization '100%'",
    "description": "President Donald Trump delivered a speech at the United Nations General Assembly, criticizing the organization and its policies on migration and green energy.",
    "link": "https://www.wgal.com/article/trump-un-general-assembly-migration-security-threat/68023515",
    "timestamp": "2025-09-23T21:36:05Z"
  },
  {
    "title": "Trump asks what is the UN's purpose? This is the answer",
    "description": "Donald Trump harshly criticized the United Nations this week for being ineffective and even questioned its existence. But it has a clearly-defined purpose.",
    "link": "https://www.cbc.ca/news/world/un-trump-charter-1.7641469",
    "timestamp": "2025-09-23T21:35:50Z"
  },
  {
    "title": "Bondi praises Ryan Routh verdict, says assassination attempt was an 'affront to our very nation itself'",
    "description": "Attorney General Pam Bondi praised the guilty verdict against Ryan Routh, who tried to assassinate Trump at a Florida golf course and faces life imprisonment.",
    "link": "https://www.foxnews.com/politics/bondi-praises-ryan-routh-verdict-assassination-attempt-affront-nation-itself",
    "timestamp": "2025-09-23T21:35:43Z"
  },
  {
    "title": "Trump Chastises World Leaders in Their Push for Palestinian State: Giving in to Hamas' Ransom Demands",
    "description": "President Donald Trump called out the world leaders on Tuesday who are pushing for a Palestinian state following the Oct. 7, 2023, attacks.",
    "link": "https://www.westernjournal.com/trump-chastises-world-leaders-push-palestinian-state-giving-hamas-ransom-demands/",
    "timestamp": "2025-09-23T21:35:42Z"
  },
  {
    "title": "White House seeks probe into Trump's UN escalator glitch",
    "description": "White House Press Secretary Karoline Leavitt called for an investigation after an escalator at the United Nations stopped as United States President Donald Trump and First Lady Melania Trump arrived f...",
    "link": "https://biztoc.com/x/6d28ca0665dffb49",
    "timestamp": "2025-09-23T21:35:37Z"
  },
  {
    "title": "Man who represented himself found guilty of trying to assassinate Trump at Florida golf course",
    "description": "The man who was charged with attempting to assassinate Donald Trump at a Florida golf course last year tried to stab himself in the neck with a pen shortly after being found guilty of all counts on Tuesday. Officers quickly swarmed him and dragged him out of …",
    "link": "https://japantoday.com/category/world/man-who-represented-himself-is-found-guilty-of-trying-to-assassinate-trump-at-florida-golf-course",
    "timestamp": "2025-09-23T21:35:20Z"
  },
  {
    "title": "Trump says he will help Argentina; World Bank to accelerate support",
    "description": "U.S. President Donald Trump said on Tuesday the United States would help Argentina but he did not think a financial bailout was needed as the World Bank said it would accelerate $4 billion in previously planned public-private investments for Argentina. Trump …",
    "link": "https://japantoday.com/category/world/trump-says-he-will-help-argentina-world-bank-to-accelerate-support",
    "timestamp": "2025-09-23T21:35:15Z"
  },
  {
    "title": "Maine health experts push back against Pres. Trump's claims about autism",
    "description": "After a major announcement from the White House, many medical experts and parents are pushing back on President Donald Trump’s claims about the rise of autism.",
    "link": "https://wgme.com/news/local/maine-health-experts-push-back-against-president-donald-trump-claims-about-autism-tylenol-acetaminophen",
    "timestamp": "2025-09-23T21:35:00Z"
  },
  {
    "title": "Iran's supreme leader rejects direct talks with U.S. over his country's nuclear program",
    "description": "Iran's supreme leader on Tuesday rejected direct negotiations with the United States over his country's nuclear program, likely slamming the door shut on a last-ditch effort to halt the reimposition of United Nations sanctions on Tehran. Ayatollah Ali Khamene…",
    "link": "https://japantoday.com/category/world/iran%27s-supreme-leader-rejects-direct-talks-with-us-over-his-country%27s-nuclear-program",
    "timestamp": "2025-09-23T21:34:58Z"
  },
  {
    "title": "Trump cancels White House meeting with Schumer and Jeffries despite risk of a government shutdown",
    "description": "President Donald Trump has abruptly canceled this week's planned meeting with congressional Democratic leaders, refusing to negotiate over their demands to shore up health care funds as part of a deal to prevent a potential looming federal government shutdown…",
    "link": "https://japantoday.com/category/world/trump-cancels-white-house-meeting-with-schumer-and-jeffries-despite-risk-of-a-government-shutdown",
    "timestamp": "2025-09-23T21:34:52Z"
  },
  {
    "title": "US stocks retreat from records as tech giants fall",
    "description": "The Dow Jones Industrial Average finishes down 0.2 per cent at 46,292.78. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/us-stocks-retreat-from-records-as-tech-giants-fall",
    "timestamp": "2025-09-23T21:34:47Z"
  },
  {
    "title": "U.N. chief warns world leaders of 'an age of reckless disruption and relentless human suffering'",
    "description": "With global peace and progress under siege, the United Nations chief challenged world leaders Tuesday to choose a future where the rule of law triumphs over raw power and where nations come together rather than scramble for self-interests. Secretary-General A…",
    "link": "https://japantoday.com/category/world/un-chief-warns-world-leaders-of-%27an-age-of-reckless-disruption-and-relentless-human-suffering%27",
    "timestamp": "2025-09-23T21:34:46Z"
  },
  {
    "title": "As Boeing's stock rises on a new foreign deal, US officials signal China may be next to order planes",
    "description": "Boeing's stock climbed Tuesday after the American aerospace giant announced a significant jetliner order from Uzbekistan and as optimism builds around a...",
    "link": "https://finance.yahoo.com/news/boeings-stock-rises-foreign-deal-213435762.html",
    "timestamp": "2025-09-23T21:34:35Z"
  },
  {
    "title": "U.N. Security Council meeting on Gaza highlights growing isolation of U.S. on Mideast conflict",
    "description": "A day after France led other nations in recognizing Palestinian statehood, the U.N. Security Council once again aired a deep divide between the veto-wielding United States and most of the rest of the world over how to end the war in the Gaza Strip and resolve…",
    "link": "https://japantoday.com/category/world/un-security-council-meeting-on-gaza-highlights-growing-isolation-of-us-on-mideast-conflict",
    "timestamp": "2025-09-23T21:34:33Z"
  },
  {
    "title": "Mass. parents, doctors push back on Trump's Tylenol-autism link claim",
    "description": "Researchers and doctors dispute Trump’s claims linking Tylenol to autism, emphasizing its safety during pregnancy and the need for further scientific study.",
    "link": "https://www.wcvb.com/article/massachusetts-trump-tylenol-autism-claims-researchers-respond/68022983",
    "timestamp": "2025-09-23T21:34:31Z"
  },
  {
    "title": "Trump says Kyiv can win back 'all of Ukraine' in major shift",
    "description": "U.S. President Donald Trump said Tuesday that Ukraine could win back all of its territory from Russia -- and even go further -- in a major pivot after meeting President Volodymyr Zelenskyy. The astonishing turnaround came shortly after Trump also called for N…",
    "link": "https://japantoday.com/category/world/trump-says-kyiv-can-win-back-%27all-of-ukraine%27-in-major-shift",
    "timestamp": "2025-09-23T21:34:26Z"
  },
  {
    "title": "Trump tells world leaders their countries are 'going to hell' in combative U.N. speech",
    "description": "U.S. President Donald Trump argued for lower levels of global migration and urged a turn away from climate change policies on Tuesday in a combative, wide-ranging speech to the U.N. General Assembly that leveled scathing criticism of world leaders. The 56-min…",
    "link": "https://japantoday.com/category/world/trump-tells-world-leaders-their-countries-are-%27going-to-hell%27-in-combative-un-speech1",
    "timestamp": "2025-09-23T21:34:20Z"
  },
  {
    "title": "European leader praises Trump's 'peace through strength' for keeping country safe from conflict",
    "description": "Kosovo President Vjosa Osmani credits Trump's 'peace through strength' approach with preventing escalations and maintaining stability in ongoing tensions with Serbia.",
    "link": "https://www.foxnews.com/media/european-leader-praises-trumps-peace-through-strength-keeping-country-safe-from-conflict",
    "timestamp": "2025-09-23T21:34:07Z"
  },
  {
    "title": "Here is what a physician has to say after Trump suggests Tylenol during pregnancy causes autism",
    "description": "Here is what a physician has to say after Trump suggests Tylenol during pregnancy causes autismlocal10.com",
    "link": "https://www.local10.com//health/2025/09/23/here-is-what-a-physician-has-to-say-after-trump-suggests-tylenol-during-pregnancy-causes-autism/",
    "timestamp": "2025-09-23T21:33:50Z"
  },
  {
    "title": "In major shift, Trump says Ukraine can win back all territory from Russia",
    "description": "Trump previously said both Kyiv and Moscow would have to cede land to end Europe's deadliest war since World War II.",
    "link": "https://www.aljazeera.com/news/2025/9/23/in-major-shift-trump-says-ukraine-can-win-back-all-territory-from-russia",
    "timestamp": "2025-09-23T21:33:12Z"
  },
  {
    "title": "Man Convicted of Trump Assassination Attempt Tries to Stab Himself to Death",
    "description": "Man Convicted of Trump Assassination Attempt Tries to Stab Himself to Deathlittlethings.com",
    "link": "https://littlethings.com/entertainment/man-convicted-of-trump-assassination-attempt-tries-to-stab-himself-to-death-in-court",
    "timestamp": "2025-09-23T21:32:58Z"
  },
  {
    "title": "Trump invites global fans to World Cup and Olympics as US tightens visa policies",
    "description": "NEW YORK (Reuters) -U.S. President Donald Trump told the UN General Assembly on Tuesday that he hopes \"countless people from all over the globe\" will attend ...",
    "link": "https://ca.news.yahoo.com/trump-invites-global-fans-world-213215269.html",
    "timestamp": "2025-09-23T21:32:15Z"
  },
  {
    "title": "Trump administration proposes new H-1B visa process favoring higher-skilled, better-paid workers",
    "description": "The new process, if finalised, would give heavier weight to applications by employers who pay high wages if annual requests for the visas exceed the statutory limit of 85,000, the White House notice said.",
    "link": "https://www.channelnewsasia.com/world/trump-administration-proposes-new-h-1b-visa-process-favoring-higher-skilled-better-paid-workers-5364666",
    "timestamp": "2025-09-23T21:31:42Z"
  },
  {
    "title": "Trump’s Mom-Shaming Around Tylenol",
    "description": "In the absence of conclusive science around what causes autism, Danielle Campoamor argues that the Trump administration is blaming mothers who can’t ‘tough it out.’",
    "link": "http://www.thecut.com/article/trump-mom-shaming-tylenol-autism.html",
    "timestamp": "2025-09-23T21:31:42Z"
  },
  {
    "title": "Trump's Controversial Tariffs Generate Nearly $350 Billion, Becoming 'Very Significant' US Revenue Source, Says Economist",
    "description": "The controversial tariffs imposed by President Donald Trump have turned into a major revenue stream for the U.S. government, amassing approximately $350...",
    "link": "https://finance.yahoo.com/news/trumps-controversial-tariffs-generate-nearly-213107349.html",
    "timestamp": "2025-09-23T21:31:07Z"
  },
  {
    "title": "Trump would-be assassin convicted",
    "description": "The pro-Ukraine activist had set up an ambush at then-presidential candidate’s Florida golf course last September Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625158-trump-wannabe-assassin-convicted/",
    "timestamp": "2025-09-23T21:30:39Z"
  },
  {
    "title": "Chris Mason: Punchy Lib Dems use Reform UK as call to action",
    "description": "The party is taking on Nigel Farage in a way Labour and the Tories either can't or won't, our political editor writes.",
    "link": "https://www.bbc.com/news/articles/cvg97gq8230o",
    "timestamp": "2025-09-23T21:30:31Z"
  },
  {
    "title": "Trump Administration Wants to Hand Out $2.4 billion It Took From California’s High-Speed Railroad",
    "description": "The Trump administration wants to redistribute $2.4 billion it pulled from California’s high-speed rail project to other uses as part of a new $5 billion program to fund rail projects that boost U.S. rail passenger traffic.",
    "link": "https://www.kqed.org/news/12057238/trump-administration-wants-to-hand-out-2-4-billion-it-took-from-californias-high-speed-railroad",
    "timestamp": "2025-09-23T21:30:06Z"
  },
  {
    "title": "The Bob Cesca Podcast: It Can Only Good Happen",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: It Can Only Good Happen -- Disney caves to pressure. Jimmy Kimmel returns tonight! Sinclair will air a news program instead. Donald embarrasses America at the UN. \"Your countries are going to …",
    "link": "https://littlegreenfootballs.com/article/54938_The_Bob_Cesca_Podcast-_It_Can_",
    "timestamp": "2025-09-23T21:29:55Z"
  },
  {
    "title": "Paramount–Warner Bros Discovery merger could give Trump even more influence over what news and culture Americans watch and stream",
    "description": "Following unprecedented threats from Federal Communications Commission Chairman Brendan Carr, major affiliate station owners Nexstar and Sinclair Broadcasting pressured Disney’s ABC to pull Jimmy Kimmel’s show off the air over his comments related to Charlie …",
    "link": "https://japantoday.com/category/features/opinions/a-paramount%E2%80%93warner-bros.-discovery-merger-could-give-trump-even-more-influence-over-us-media-%E2%80%93-shaping-the-news-and-culture-americans-watch-and-stream",
    "timestamp": "2025-09-23T21:29:11Z"
  },
  {
    "title": "Trump forced to ab lib intro to UN speech after escalator and teleprompter fail: ‘Big trouble’",
    "description": "An escalator malfunction and frozen teleprompter disrupted President Trump’s marquee address to the United Nations General Assembly on Tuesday, prompting him to improvise. The escalator carrying Trump en route to deliver his remarks had abruptly stalled short…",
    "link": "https://freerepublic.com/focus/f-news/4342257/posts",
    "timestamp": "2025-09-23T21:28:28Z"
  },
  {
    "title": "'Greatest con job ever': Trump trashes climate science at U.N.",
    "description": "He mocked renewables as a &quot;joke,&quot; praised &quot;clean, beautiful coal&quot; and declared climate change the &quot;greatest con job ever.&quot; U.S. President Donald Trump used his U.N. comeback address Tuesday to champion fossil fuels and deride gre…",
    "link": "https://japantoday.com/category/features/environment/%27greatest-con-job-ever%27-trump-trashes-climate-science-at-un",
    "timestamp": "2025-09-23T21:28:08Z"
  },
  {
    "title": "Fox News Politics Newsletter: Ryan Routh found guilty",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-september-23rd-draft",
    "timestamp": "2025-09-23T21:27:23Z"
  },
  {
    "title": "U.N. escalator stops as Trump, first lady get on; White House demands firing if deliberate",
    "description": "Tensions escalated at the United Nations on Tuesday after President Donald Trump and first lady Melania Trump came to an abrupt halt at the start of an escalator ride, with the White House calling for repercussions if the halt was deliberate.“If someone at th…",
    "link": "https://www.msnbc.com/top-stories/latest/trump-united-nations-escalator-white-house-firing-rcna233297",
    "timestamp": "2025-09-23T21:26:28Z"
  },
  {
    "title": "Trump Denies Climate Change and Twists Facts in UN Speech",
    "description": "The US president said climate change was “a con job” and denounced green energy in his nearly hour-long address.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-denies-climate-change-and-twists-facts-in-un-speech",
    "timestamp": "2025-09-23T21:26:12Z"
  },
  {
    "title": "Trump Blasts UN for Not Solving Wars, Ignores Repeated US Vetoes on Ceasefire",
    "description": "“I'm really good at this stuff. Your countries are going to hell,” Trump said at one point in his speech.",
    "link": "https://truthout.org/articles/trump-blasts-un-for-not-solving-wars-ignores-repeated-us-vetoes-on-ceasefire/",
    "timestamp": "2025-09-23T21:25:40Z"
  },
  {
    "title": "Dr. Oz Completely Walks Back Trump's 'Don't Take Tylenol' Comments (Ahmad Austin Jr/Mediaite)",
    "description": "Ahmad Austin Jr / Mediaite:\nDr. Oz Completely Walks Back Trump's 'Don't Take Tylenol' Comments  —  Less than 24 hours after President Donald Trump explicitly told pregnant women not to take Tylenol, Dr. Mehmet Oz walked back that advice.  —  On Monday, Trump …",
    "link": "https://www.memeorandum.com/250923/p120",
    "timestamp": "2025-09-23T21:25:00Z"
  },
  {
    "title": "Trump's UN Speech in 3 Minutes",
    "description": "President Donald Trump assailed the United Nations and other countries in a grievance-laden speech that accused the world body of offering nothing but “empty words,” labeled climate change a “con job” and warned open borders risked destroying nations.\nSetting…",
    "link": "https://biztoc.com/x/b7315ede2fc74d3e",
    "timestamp": "2025-09-23T21:24:05Z"
  },
  {
    "title": "EXCLUSIVE: ‘DC Guy’ Versus ‘Ohio Guy’ as Husted Draws Contrast With Brown",
    "description": "COLUMBUS, Ohio—”I’m an Ohio guy and he’s a DC guy.” That’s how Sen. Jon Husted, R-Ohio, summarized the contest between himself and his 2026 Democrat... Read More\nThe post EXCLUSIVE: ‘DC Guy’ Versus ‘Ohio Guy’ as Husted Draws Contrast With Brown appeared first…",
    "link": "https://www.dailysignal.com/2025/09/23/exclusive-dc-guy-versus-ohio-guy-as-husted-draws-contrast-with-brown/",
    "timestamp": "2025-09-23T21:23:47Z"
  },
  {
    "title": "Why experts say Trump's 'tough it out' advice to pregnant women poses risks",
    "description": "Why experts say Trump's 'tough it out' advice to pregnant women poses risksgo.com",
    "link": "https://abcnews.go.com/GMA/Wellness/women-continue-taking-tylenol-medically-needed-pregnancy-doctor/story?id=125847779",
    "timestamp": "2025-09-23T21:23:46Z"
  },
  {
    "title": "Trump’s Unproven Claims About Tylenol And Autism Are Reaching Millions On TikTok",
    "description": "Even as medical groups push back on Trump’s unfounded claims about autism, they're going viral on the world's biggest video platform.",
    "link": "https://www.forbes.com/sites/emilybaker-white/2025/09/23/trumps-unproven-claims-about-tylenol-and-autism-are-reaching-millions-on-tiktok/",
    "timestamp": "2025-09-23T21:22:04Z"
  },
  {
    "title": "NASA Moving Out of Entire Buildings as It’s Gutted by Trump",
    "description": "NASA's Goddard Space Flight Center is making drastic changes following severe budget cuts proposed by the Trump administration.",
    "link": "https://futurism.com/space/nasa-moving-out",
    "timestamp": "2025-09-23T21:21:01Z"
  },
  {
    "title": "“Get the F*ck Out of My Face!” Ryan Routh’s Daughter Sprints Out of Courthouse, Lashes Out at Media After Jury Finds Her Father Guilty on All Counts (VIDEO)",
    "description": "Ryan Routh’s daughter sprinted out of the Fort Pierce, Florida, courthouse on Tuesday after her father was found guilting of attempting to assassinate President Trump.\nThe post “Get the F*ck Out of My Face!” Ryan Routh’s Daughter Sprints Out of Courthouse, La…",
    "link": "https://www.thegatewaypundit.com/2025/09/get-fck-my-face-ryan-rouths-daughter-sprints/",
    "timestamp": "2025-09-23T21:20:48Z"
  },
  {
    "title": "Trump says 'tough it out' to expectant moms. Critics push back",
    "description": "President Donald Trump has become the latest in a long line of men to opine on women's pain when he told expectant moms to “tough it out” without Tylenol. Speaking at a news conference Monday, he suggested that expectant mothers should endure discomfort rathe…",
    "link": "https://apnews.com/article/trump-tough-it-out-pregnancy-women-pain-acetaminophen-dc48caddabef2f086a50b48c5b86a3ca",
    "timestamp": "2025-09-23T21:20:39Z"
  },
  {
    "title": "Trump tells world leaders countries are 'going to hell'",
    "description": "US President Donald Trump's combative address to the UN was largely dominated by two of his biggest grievances.",
    "link": "https://7news.com.au/news/donald-trump-tells-world-leaders-countries-are-going-to-hell-c-20122606",
    "timestamp": "2025-09-23T21:20:21Z"
  },
  {
    "title": "Trump Responds to Conviction of His Would-Be Assassin Ryan Routh",
    "description": "President Donald Trump on Tuesday expressed his gratitude that a jury convicted Ryan Wesley Routh, 59, of attempting to assassinate him last September at Trump International Golf Club in West Palm Beach.\nThe post Trump Responds to Conviction of His Would-Be A…",
    "link": "https://www.breitbart.com/politics/2025/09/23/trump-responds-to-conviction-of-his-would-be-assassin-ryan-routh/",
    "timestamp": "2025-09-23T21:20:20Z"
  },
  {
    "title": "Europe Ryder Cup captain Luke Donald asks friend Michael Jordan for some advice",
    "description": "Long before Luke Donald was Europe's captain at the Ryder Cup, he was an amateur golfer at Northwestern University in the late 1990s and early 2000s. Jordan liked to golf, the two became friends and remain so, now living nearby each other in Florida. Donald h…",
    "link": "https://sports.yahoo.com/article/europe-ryder-cup-captain-luke-212001378.html",
    "timestamp": "2025-09-23T21:20:01Z"
  },
  {
    "title": "Man guilty of Donald Trump assassination try attempts to save the taxpayers some money, tries to stab himself in the neck [Followup]",
    "description": "Man guilty of Donald Trump assassination try attempts to save the taxpayers some money, tries to stab himself in the neck",
    "link": "https://www.fark.com/comments/13821428/Man-guilty-of-Donald-Trump-assassination-try-attempts-to-save-taxpayers-some-money-tries-to-stab-himself-in-neck",
    "timestamp": "2025-09-23T21:18:42Z"
  },
  {
    "title": "US Envoy to Israel: \"The end result is somebody wants dominance, which means somebody has to submit. In that part of the world, submit, there's no Arabic word for submit. They can't wrap their head around submit.\" That's news to followers of \"Islam\" [Facepalm]",
    "description": "US Envoy to Israel: \"The end result is somebody wants dominance, which means somebody has to submit. In that part of the world, submit, there's no Arabic word for submit. They can't wrap their head around submit.\" That's news to followers of \"Islam\"",
    "link": "https://www.fark.com/comments/13821434/US-Envoy-to-Israel-The-end-result-is-somebody-wants-dominance-which-means-somebody-has-to-submit-In-that-part-of-world-submit-theres-no-Arabic-word-for-submit-They-cant-wrap-their-head-around-submit-Thats-news-to-followers-of-Islam",
    "timestamp": "2025-09-23T21:18:32Z"
  },
  {
    "title": "Sinclair, Nexstar Will Preempt Jimmy Kimmel Return on Stations They Own",
    "description": "Since Disney announced late-night host Jimmy Kimmel's Tuesday return after yanking him off the air last week, Nexstar Media Group and Sinclair Broadcast Group, which collectively control about a quarter of local ABC affiliates nationwide, have said they will …",
    "link": "https://www.commondreams.org/news/jimmy-kimmel-return",
    "timestamp": "2025-09-23T21:17:17Z"
  },
  {
    "title": "MSNBC's Nicolle Wallace thrashes Trump as a 'lame-duck president' with 'unfilled promises'",
    "description": "MSNBC host Nicolle Wallace began her Tuesday episode of \"Deadline White House\" discussing a blistering critique from former colleague David Frum, the speechwriter for President George W. Bush.Frum, who now writes for The Atlantic, penned a column calling Pres…",
    "link": "https://www.rawstory.com/trump-failures-2674026580/",
    "timestamp": "2025-09-23T21:17:17Z"
  },
  {
    "title": "How Charlie Kirk’s Professor Watchlist reshaped free speech on campus",
    "description": "Experts say Turning Point USA's Professor Watchlist laid the groundwork for subsequent attempts to limit what professors and teachers say in the classroom.",
    "link": "https://www.nbcnews.com/news/us-news/charlie-kirk-professor-watchlist-free-speech-college-campus-rcna231448",
    "timestamp": "2025-09-23T21:16:25Z"
  },
  {
    "title": "Ukraine can win back all territory lost to Russia, Trump says",
    "description": "The US president criticised Russia on the sidelines of the UN General Assembly, saying it had been fighting \"aimlessly\" in a war that a \"real military power\" would have won in less than a week.",
    "link": "https://www.abc.net.au/news/2025-09-24/ukraine-can-win-back-all-territory-lost-to-russia-trump-says/105809578",
    "timestamp": "2025-09-23T21:16:08Z"
  },
  {
    "title": "The Latest Trump-NYT Defamation Suit is to Silence Speech, not Make Journalism Better",
    "description": "The president's assault on a free press continues.\nThe post The Latest Trump-NYT Defamation Suit is to Silence Speech, not Make Journalism Better appeared first on Public Knowledge.",
    "link": "https://publicknowledge.org/trump-defamation-lawsuit-new-york-times/",
    "timestamp": "2025-09-23T21:15:51Z"
  },
  {
    "title": "Kamala Harris' book opens up a new front in the nascent 2028 race: From the Politics Desk",
    "description": "Kamala Harris’ memoir has kick-started a new phase of the race for the 2028 Democratic presidential nomination.",
    "link": "https://www.nbcnews.com/politics/politics-news/kamala-harris-book-opens-new-front-nascent-2028-race-politics-desk-rcna233301",
    "timestamp": "2025-09-23T21:15:41Z"
  },
  {
    "title": "Jimmy Kimmel returns to late-night; Glen Powell, Ethan Hawke, Peyton Manning to appear as guests",
    "description": "Jimmy Kimmel returns to late-night; Glen Powell, Ethan Hawke, Peyton Manning to appear as guestsabc13.com",
    "link": "https://abc13.com/post/jimmy-kimmel-returns-late-night-glen-powell-ethan-hawke-peyton-manning-appear-guests/17872219/",
    "timestamp": "2025-09-23T21:15:05Z"
  },
  {
    "title": "Shaping Our Future: Climate Policy and Economic Impact",
    "description": "The New Republic’s Monday panel with The New School, “Shaping Our Future: Climate Policy and Economic Impact,” was rooted in the conviction that combatting climate change “is both possible and necessary”—as panelist Bhawani Venkataraman, an associate professo…",
    "link": "https://newrepublic.com/article/200819/shaping-future-climate-policy-economic-impact",
    "timestamp": "2025-09-23T21:12:28Z"
  },
  {
    "title": "As Melania Trump tries to enlist other first spouses to her coalition, one urgently seeks her attention",
    "description": "First lady Melania Trump hosted world leaders’ spouses on the sidelines of the United Nations General Assembly on Tuesday, announcing the launch of a new...",
    "link": "https://www.cnn.com/2025/09/23/politics/melania-trump-united-nations-olena-zelenska",
    "timestamp": "2025-09-23T21:11:40Z"
  },
  {
    "title": "Trump Pulls 180 on Ukraine That Putin is Sure to Hate",
    "description": "After spending months making concessions to Russia, Donald Trump has suddenly changed his tune on the foreign power’s invasion of Ukraine, claiming that the non-NATO ally could reclaim all of its occupied territory—and then some.“After getting to know and ful…",
    "link": "https://newrepublic.com/post/200839/donald-trump-180-ukraine-war-territory-russia",
    "timestamp": "2025-09-23T21:11:28Z"
  },
  {
    "title": "Jimmy Kimmel returns to late-night television from six-day suspension",
    "description": "Kimmel, whose show has frequently lampooned President Donald Trump, drew outrage from conservatives for saying that Trump's supporters were desperate to characterise Kirk's accused assassin \"as anything other than one of them\" and for trying to \"score politic…",
    "link": "https://www.channelnewsasia.com/world/jimmy-kimmel-returns-late-night-television-six-day-suspension-5365216",
    "timestamp": "2025-09-23T21:11:06Z"
  },
  {
    "title": "Apple TV Plus has quietly pulled its new show about domestic extremism",
    "description": "The Savant, the upcoming Apple TV Plus show about law enforcement working to prevent domestic terrorism, was slated to premiere this Friday. But the streamer has quietly pulled the series from its release slate and it's not clear if or when it will now debut.…",
    "link": "https://www.theverge.com/entertainment/784185/apple-tv-plus-the-savant-domestic-terrorism",
    "timestamp": "2025-09-23T21:10:24Z"
  },
  {
    "title": "Live: PM says Trump 'entitled' to views on climate change",
    "description": "Anthony Albanese has declined to weigh in on a speech where Donald Trump called climate change a \"con job\", insisting the US president is \"entitled\" to his views. Follow live.",
    "link": "https://www.abc.net.au/news/2025-09-24/federal-politics-live-24-september/105808594",
    "timestamp": "2025-09-23T21:10:18Z"
  },
  {
    "title": "Trump criticises European migration and climate policies in UN speech",
    "description": "President Trump has delivered a blistering speech to the United Nations General Assembly, telling European countries they were “going to hell” if they did not stop mass migration. \n\nWe’ll analyse what the US president said and how it is being received in Euro…",
    "link": "https://www.bbc.co.uk/programmes/w172zss8x4b0cbc",
    "timestamp": "2025-09-23T21:09:00Z"
  },
  {
    "title": "Trump used Mass. research to link Autism and Tylenol. Here’s what it really says",
    "description": "Trump used Mass. research to link Autism and Tylenol. Here’s what it really saysmasslive.com",
    "link": "https://www.masslive.com/news/2025/09/trump-used-mass-research-to-link-autism-and-tylenol-heres-what-it-really-says.html",
    "timestamp": "2025-09-23T21:08:10Z"
  },
  {
    "title": "Breaking down Ryan Routh's guilty verdict in Trump assassination attempt trial",
    "description": "A Florida jury on Tuesday found Ryan Routh guilty on all charges in the attempted assassination of Donald Trump at his Florida golf course last year. CBS News correspondent Cristian Benavides reports.",
    "link": "https://www.cbsnews.com/video/breaking-down-ryan-routh-guilty-verdict-trump-assassination-attempt-trial/",
    "timestamp": "2025-09-23T21:08:00Z"
  },
  {
    "title": "Escalatorgate: White House urges probe into Trump UN malfunctions",
    "description": "President Donald Trump appeared to laugh it off Tuesday when an escalator and a teleprompter both malfunctioned during his United Nations visit — but for US officials it was no laughing matter. The White House called for an investigation into whether the movi…",
    "link": "https://www.digitaljournal.com/world/escalatorgate-white-house-urges-probe-into-trump-un-malfunctions/article",
    "timestamp": "2025-09-23T21:07:20Z"
  },
  {
    "title": "Trump's attempt to cancel Jimmy Kimmel echoes Hugo Chávez",
    "description": "President Donald Trump's threats against Jimmy Kimmel mimicked a similar move against Venezuelan broadcasters by strongman Hugo Chávez.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-jimmy-kimmel-broadcast-license-venezuela-chavez-rcna232943",
    "timestamp": "2025-09-23T21:07:18Z"
  },
  {
    "title": "Trump humiliates Starmer in UN speech as he slams UK's Net Zero push for windmills and solar panels - and says Labour is wasting 'tremendous' North Sea oil",
    "description": "Donald Trump humiliated Keir Starmer today with brutal swipes at Labour's Net Zero drive. The US President used a rambling speech at the UN to brand climate change 'the greatest con job ever'. The UK was singled out for particular criticism, despite Mr Trump …",
    "link": "https://freerepublic.com/focus/f-news/4342255/posts",
    "timestamp": "2025-09-23T21:06:53Z"
  },
  {
    "title": "Trump, in Major Shift, Says Ukraine Can Defeat Russia",
    "description": "State of the Union: The president had earlier in the day met with Ukraine’s President Volodymyr Zelensky.\nThe post Trump, in Major Shift, Says Ukraine Can Defeat Russia appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-in-major-shift-says-ukraine-can-defeat-russia/",
    "timestamp": "2025-09-23T21:06:22Z"
  },
  {
    "title": "Escalatorgate: White House Urges Probe Into Trump UN Malfunctions",
    "description": "President Donald Trump appeared to laugh it off Tuesday when an escalator and a teleprompter both malfunctioned during his United Nations visit -- but for US officials it was no laughing matter.",
    "link": "https://www.ibtimes.com/escalatorgate-white-house-urges-probe-trump-un-malfunctions-3784269",
    "timestamp": "2025-09-23T21:06:09Z"
  },
  {
    "title": "Oil Rises on Russian Supply Risks",
    "description": "WTI surged 1.8%, its biggest gain since early September, as futures markets reflected tightening fears.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_on_russian_supply_risks-23-sep-2025-181885-article/",
    "timestamp": "2025-09-23T21:05:10Z"
  },
  {
    "title": "Autism does exist in the Amish, says expert who works with Lancaster community",
    "description": "Braxton Mitchell, co-director of the Amish Research Clinic in Lancaster, says autism does exist in the Amish, contrary to President Donald J. Trump's remarks Monday.",
    "link": "https://www.inquirer.com/health/amish-autism-rates-research-lancaster-pennsylvania-20250923.html",
    "timestamp": "2025-09-23T21:04:50Z"
  },
  {
    "title": "Nobel Peace Prize for Department of War President?",
    "description": "Trump cites peace deals, but most are false wins.",
    "link": "http://foreignpolicy.com/2025/09/23/nobel-peace-prize-for-department-of-war-president/",
    "timestamp": "2025-09-23T21:03:35Z"
  },
  {
    "title": "Zelensky says China could force Russia to stop Ukraine war",
    "description": "Ukrainian President Volodymyr Zelensky told the UN Security Council Tuesday that China could pressure Russia to end the war in his country, following a US call for Beijing to stop buying Moscow’s oil. China is not a party to the conflict, but Kyiv has long co…",
    "link": "https://www.digitaljournal.com/world/zelensky-says-china-could-force-russia-to-stop-ukraine-war/article",
    "timestamp": "2025-09-23T21:02:20Z"
  },
  {
    "title": "WATCH: Trump says NATO nations should shoot down Russian aircraft that violate airspace",
    "description": "President Donald Trump said during his bilateral meeting with Ukrainian President Volodymyr Zelenskyy that NATO countries should shoot down Russian aircraft if they enter their airspace.",
    "link": "https://abcnews.go.com/International/video/trump-nato-nations-shoot-russian-aircraft-violate-airspace-125868964",
    "timestamp": "2025-09-23T21:01:11Z"
  },
  {
    "title": "DeSantis to propose presidential library site for Trump",
    "description": "Gov. Ron DeSantis says he will propose a site for the Donald J. Trump Presidential Library in Miami-Dade County.",
    "link": "https://www.wftv.com/news/local/desantis-propose-presidential-library-site-trump/S2QLKVEXNRFLPGFIAREAQDBNVQ/",
    "timestamp": "2025-09-23T21:00:51Z"
  },
  {
    "title": "Donald Trump STRUGGLES WITH WORDS – Makes Up Health Policy \"BASED ON WHAT HE FEELS!\"",
    "description": "Donald Trump STRUGGLES WITH WORDS – Makes Up Health Policy \"BASED ON WHAT HE FEELS!\"youtube.com",
    "link": "https://www.youtube.com/supported_browsers?next_url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DbpK45uBpgdI",
    "timestamp": "2025-09-23T21:00:49Z"
  },
  {
    "title": "Harris tells 'The View' she 'didn’t have enough time’ to win 2024 presidential race",
    "description": "Former Vice President Kamala Harris discussed her new book \"107 Days\" on \"The View,\" explaining why she believes she lost the 2024 presidential race.",
    "link": "https://www.foxnews.com/media/harris-tells-the-view-she-didnt-have-enough-time-win-2024-presidential-race",
    "timestamp": "2025-09-23T21:00:44Z"
  },
  {
    "title": "Trump Attempted Assassin Ryan Routh Found Guilty, Courtroom Erupts in Chaos",
    "description": "\"As the verdict was read, it appeared to our producers inside the courtroom that Routh tried to stab himself in the neck with a pen.\" \nThe post Trump Attempted Assassin Ryan Routh Found Guilty, Courtroom Erupts in Chaos first appeared on Le·gal In·sur·rec·tio…",
    "link": "https://legalinsurrection.com/2025/09/trump-attempted-assassin-ryan-routh-found-guilty-courtroom-erupts-in-chaos/",
    "timestamp": "2025-09-23T21:00:20Z"
  },
  {
    "title": "Trump’s Antifa Executive Order Is Dangerously Vague",
    "description": "Trump’s executive order labeling antifa a domestic terrorist organization is unauthorized, targets a nonexistent organization, and authorizes a fishing expedition for allies and donors. It’s an invitation to overreach.",
    "link": "http://nymag.com/intelligencer/article/trumps-antifa-executive-order-is-dangerously-vague.html",
    "timestamp": "2025-09-23T21:00:15Z"
  },
  {
    "title": "OpenAI's first data center in $500B Stargate project is open in Texas, with sites coming in New Mexico and Ohio",
    "description": "OpenAI and Oracle are betting big on America's AI future, bringing online the flagship site of the $500 billion Stargate program in Abilene, Texas.",
    "link": "https://www.cnbc.com/2025/09/23/openai-first-data-center-in-500-billion-stargate-project-up-in-texas.html",
    "timestamp": "2025-09-23T21:00:01Z"
  },
  {
    "title": "OpenAI Teams Up With Oracle and SoftBank to Build 5 New Stargate Data Centers",
    "description": "The new sites will boost Stargate’s planned capacity to nearly 7 gigawatts—about equal to the output of seven large nuclear reactors.",
    "link": "https://www.wired.com/story/openai-oracle-softbank-data-center-stargate-us/",
    "timestamp": "2025-09-23T20:59:50Z"
  },
  {
    "title": "Donald Trump unleashes unhinged rant on the United Nations",
    "description": "The US president has let fly with an absurd and rambling speech at the UN General Assembly, and it looks like Albanese has finally secured that meeting (lucky him).\nThe post Donald Trump unleashes unhinged rant on the United Nations appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/09/24/donald-trump-un-speech-albanese-meeting-andrew-hastie/",
    "timestamp": "2025-09-23T20:59:46Z"
  },
  {
    "title": "Heightened security at Ryder Cup after Charlie Kirk assassination raises fears of political targeting",
    "description": "In the wake of conservative activist Charlie Kirk&apos;s assassination earlier this month, security officials have warned of an elevated threat level surrounding major public event",
    "link": "https://www.marca.com/en/golf/ryder-cup/2025/09/23/68d30a0022601d3d098b45c8.html",
    "timestamp": "2025-09-23T20:59:06Z"
  },
  {
    "title": "Ukraine Could ‘Win’ Back Territory Lost to Russia, Trump Says",
    "description": "President Donald Trump says Ukraine can win back all the territory it has lost to Russia with the help of the European Union.   “After... Read More\nThe post Ukraine Could ‘Win’ Back Territory Lost to Russia, Trump Says appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/23/ukraine-could-win-back-territory-lost-to-russia-trump-says/",
    "timestamp": "2025-09-23T20:58:50Z"
  },
  {
    "title": "Trump's announcement on autism and Tylenol: What parents need to know",
    "description": "Trump's announcement on autism and Tylenol: What parents need to knowgo.com",
    "link": "https://abcnews.go.com/GMA/Wellness/trump-kennedy-announcement-autism-tylenol-acetaminophen-parents/story?id=125812742",
    "timestamp": "2025-09-23T20:56:06Z"
  },
  {
    "title": "Canadian privacy watchdogs call for TikTok to enhance protection for children on platform",
    "description": "Canadian privacy authorities say TikTok’s efforts to keep children off the platform and prevent the collection and use of their sensitive personal information are “inadequate” but the company is taking steps to address concerns",
    "link": "https://abcnews.go.com/Technology/wireStory/canadian-privacy-watchdogs-call-tiktok-enhance-protection-children-125869487",
    "timestamp": "2025-09-23T20:54:27Z"
  },
  {
    "title": "Trump says he now believes Ukraine can win back all territory lost to Russia",
    "description": "The US leader and Ukrainian president Volodymyr Zelensky met on the sidelines of the UN General Assembly in New York.",
    "link": "https://www.thejournal.ie/trump-believes-ukraine-can-win-back-territory-lost-to-russia-6825149-Sep2025/",
    "timestamp": "2025-09-23T20:54:25Z"
  },
  {
    "title": "Trump: NATO countries should shoot down Russian aircraft violating airspace",
    "description": "US President Donald Trump says NATO countries should shoot down Russian aircraft that violate their airspace.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/23/trump-nato-countries-should-shoot-down-russian-aircraft-violating-airspace",
    "timestamp": "2025-09-23T20:54:20Z"
  },
  {
    "title": "‘He Treats Everybody The Same’ — Scottie Scheffler Reveals Dirty Little Secret About Donald Trump",
    "description": "Scottie Scheffler said Tuesday that President Donald Trump will often text or call him after big tournament wins.",
    "link": "https://dailycaller.com/2025/09/23/mr-right-scottie-scheffler-donald-trump-praise-ryder-cup/",
    "timestamp": "2025-09-23T20:54:12Z"
  },
  {
    "title": "Trump now says Ukraine can win back all territory lost to Russia",
    "description": "He had previously said that both Kyiv and Moscow would have to cede land to end the war.",
    "link": "https://www.channelnewsasia.com/world/trump-now-says-ukraine-can-win-back-all-territory-lost-russia-5365141",
    "timestamp": "2025-09-23T20:53:52Z"
  },
  {
    "title": "Trump now says Ukraine can win back all territory lost to Russia",
    "description": "US President Donald Trump previously said that both Kyiv and Moscow would have to cede land to end the war.",
    "link": "https://www.channelnewsasia.com/world/trump-ukraine-win-back-all-territory-russia-un-5365141",
    "timestamp": "2025-09-23T20:53:00Z"
  },
  {
    "title": "What the Pakistan-Saudi Arabia Pact Means for South Asia",
    "description": "The mutual defense agreement could make Islamabad even more risk-tolerant.",
    "link": "http://foreignpolicy.com/2025/09/23/pakistan-saudi-arabia-defense-pact-mutual-security-nuclear/",
    "timestamp": "2025-09-23T20:51:59Z"
  }
]