[
  {
    "title": "Trump Confirms ‘Massive’ Crypto Price Game-Changer As ‘Trillions’ Predicted To Hit Bitcoin Market",
    "description": "Donald Trump has said the Senate passing a key piece of stablecoin legislation will lead to “massive” bitcoin and crypto investment...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/19/trump-confirms-massive-crypto-price-game-changer-as-trillions-predicted-to-hit-bitcoin-market/",
    "timestamp": "2025-06-19T11:15:49Z"
  },
  {
    "title": "Who could replace Fed Chair Powell? These are the top contenders",
    "description": "President Donald Trump, unhappy with the Federal Reserve for not cutting interest rates, has called Chairman Jerome Powell a \"numbskull,\" \"Mr. Too Late\" and referred to him as a \"stupid person\" before policymakers left interest rates unchanged for the fourth …",
    "link": "https://biztoc.com/x/5c89ec21f8122385",
    "timestamp": "2025-06-19T11:15:35Z"
  },
  {
    "title": "Trump approves Iran strike plans: Report",
    "description": "US President Donald Trump has approved US attack plans for Iran, but is withholding giving the final go-ahead to see if Tehran abandons its nuclear ambitions, The Wall Street Journal reported.\nIran’s key Fordo enrichment facility is buried deep underground, w…",
    "link": "https://biztoc.com/x/f585e473b317ba65",
    "timestamp": "2025-06-19T11:15:26Z"
  },
  {
    "title": "The U.S. Has Never Been a Bigger Target for Terrorism. Trump Is Why | Opinion",
    "description": "Abraham Lincoln once warned that a house divided against itself cannot stand. President Donald Trump is daily ripping out the beams.",
    "link": "https://www.newsweek.com/us-has-never-been-bigger-target-terrorism-trump-why-opinion-2087416",
    "timestamp": "2025-06-19T11:15:01Z"
  },
  {
    "title": "Did White House post misleading video of Tulsi Gabbard over Iran's nuclear weapon amid her 'clash' with Trump?",
    "description": "A misleading video of US National Intelligence Director Tulsi Gabbard was posted by the White House. The video suggested Iran was close to developing a nuclear bomb. However, Gabbard told a Senate committee that the US intel community did not believe Iran was…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-white-house-post-misleading-video-of-tulsi-gabbard-over-irans-nuclear-weapon-amid-her-clash-with-trump/articleshow/121953361.cms",
    "timestamp": "2025-06-19T11:14:58Z"
  },
  {
    "title": "E. Jean Carroll says Trump could've won his case against her if he did one thing",
    "description": "E. Jean Carroll beat Donald Trump in court, but she thinks it didn't have to go that way.Carroll appeared on a live video with former federal prosecutor Joyce Vance, who asked Carroll if she thinks things could have gone differently if Trump had testified in …",
    "link": "https://www.rawstory.com/trump-e-jean-carroll-says-win/",
    "timestamp": "2025-06-19T11:14:51Z"
  },
  {
    "title": "Swiss Central Bank Cuts Interest Rates To Zero Percent",
    "description": "The Swiss National Bank cut interest rates to zero percent on Thursday as inflation cools and the franc strengthens, while the economic outlook has deteriorated.",
    "link": "https://www.ibtimes.com/swiss-central-bank-cuts-interest-rates-zero-percent-3776211",
    "timestamp": "2025-06-19T11:12:20Z"
  },
  {
    "title": "Seth Meyers Has Hilarious ‘Roman Emperor’ Moment Over MAGA Meltdown",
    "description": "Seth Meyers Has Hilarious ‘Roman Emperor’ Moment Over MAGA Meltdownhuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-roman-emperor-moment_n_6853daece4b07e1309c5b6d6",
    "timestamp": "2025-06-19T11:11:23Z"
  },
  {
    "title": "A timeline of the US semiconductor market in 2025 | TechCrunch",
    "description": "From leadership changes at legacy semiconductor companies to wishy washy policy around chip exports, a lot has happened already.",
    "link": "https://techcrunch.com/2025/06/19/a-timeline-of-the-u-s-semiconductor-market-in-2025/",
    "timestamp": "2025-06-19T11:07:39Z"
  },
  {
    "title": "Trump considers Israel-Iran conflict and Karen Read found not guilty of murder: Morning Rundown",
    "description": "Donald Trump weighs how to act in the conflict between Israel and Iran but without his national intelligence director.",
    "link": "https://www.nbcnews.com/news/us-news/trump-israel-iran-conflict-karen-read-verdict-morning-rundown-rcna213913",
    "timestamp": "2025-06-19T11:06:38Z"
  },
  {
    "title": "Trump Campaigned on Staying Out of Wars. Now He’s Changing His Tune on Iran",
    "description": "Trump may well commit another generation of troops to the Middle East, once again diverting U.S. efforts to counter China",
    "link": "https://time.com/7295729/trump-middle-east-war-iran-risk/",
    "timestamp": "2025-06-19T11:06:00Z"
  },
  {
    "title": "Trump Calls For Iran And Israel To Make A Deal As Death Toll Rises",
    "description": "By Virginia Allen, The Daily Signal | June 15, 2025\nPresident Donald Trump said Sunday Iran and Israel should come to the negotiating table even as the two nations continued to carry out missile strikes against one another, and both nations report casualties.…",
    "link": "https://biztoc.com/x/5df285a47d1e3160",
    "timestamp": "2025-06-19T11:04:35Z"
  },
  {
    "title": "Trump's Military Crackdown on Los Angeles Was Unconstitutional | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWhat unfolded in Los Angeles this month wasn't about restoring order. It was a calculated power play—testing the outer limits of executive authority and showcasing just how far President Donald Trump is willin…",
    "link": "https://biztoc.com/x/75b26333f9279ecb",
    "timestamp": "2025-06-19T11:04:34Z"
  },
  {
    "title": "Israel attacks Iran's only operating nuclear power plant",
    "description": "Israel has escalated its conflict with Iran by striking the Bushehr nuclear power plant, a move considered a significant escalation due to its proximity to Gulf neighbors and involvement of Russian technicians. This attack follows previous strikes on nuclear …",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-attacks-irans-only-operating-nuclear-power-plant/articleshow/121953202.cms",
    "timestamp": "2025-06-19T11:04:28Z"
  },
  {
    "title": "Top Trump Lawyer Drops Bombshell Announcement About LA Riots",
    "description": "By Mary Rooke, Daily Caller News Foundation | June 12, 2025\nPresident Donald Trump and his administration have made several arrests to help quell the anti-ICE riots that are on their sixth consecutive day of taking over Los Angeles.\nFOX LA was reporting live …",
    "link": "https://biztoc.com/x/d011184610aecbc6",
    "timestamp": "2025-06-19T11:04:19Z"
  },
  {
    "title": "Top Trump Lawyer Drops Bombshell Announcement About LA Riots",
    "description": "By Mary Rooke, Daily Caller News Foundation | June 12, 2025\nPresident Donald Trump and his administration have made several arrests to help quell the anti-ICE riots that are on their sixth consecutive day of taking over Los Angeles.\nFOX LA was reporting live …",
    "link": "https://biztoc.com/x/d011184610aecbc6",
    "timestamp": "2025-06-19T11:04:19Z"
  },
  {
    "title": "How Netanyahu Pushed Trump Toward War",
    "description": "With dramatic appeals amid failed nuclear negotiations, Bibi laid the groundwork for Trump to back a war with Iran",
    "link": "https://time.com/7295726/netanyahu-trump-israel-iran-nuclear-strikes/",
    "timestamp": "2025-06-19T11:04:00Z"
  },
  {
    "title": "Ice’s ‘inhumane’ arrest of well-known vineyard manager shakes Oregon wine industry",
    "description": "Friends and family of Moises Sotelo ‘disappointed and disgusted’ after respected industry fixture detained outside church",
    "link": "https://www.yahoo.com/news/ice-inhumane-arrest-well-known-110234400.html",
    "timestamp": "2025-06-19T11:02:34Z"
  },
  {
    "title": "How Iran Became Isolated in the Middle East",
    "description": "Decades of proxy warfare and regional ambition have left Iran diplomatically alone—just as it faces a new conflict with Israel.",
    "link": "https://time.com/7295480/iran-isolation-middle-east-strategy-failure/",
    "timestamp": "2025-06-19T11:02:00Z"
  },
  {
    "title": "Bill de Blasio on Andrew Cuomo and That Nasty Times Op-Ed",
    "description": "Former mayor Bill de Blasio calls his old foe Andrew Cuomo another Trump and says the New York Times editorial board is out of touch.",
    "link": "http://nymag.com/intelligencer/article/bill-de-blasio-andrew-cuomo-new-york-times-nyc-mayor-race.html",
    "timestamp": "2025-06-19T11:00:48Z"
  },
  {
    "title": "Top Trump ally predicts Senate will blow past 'big, beautiful bill' deadline",
    "description": "Sen. Ron Johnson doubts the GOP's timeline to pass Trump's bill before July 4, citing deficit concerns and the need for more time to properly review the legislation.",
    "link": "https://www.foxnews.com/politics/top-trump-ally-says-senate-blow-past-big-beautiful-bill-deadline",
    "timestamp": "2025-06-19T11:00:32Z"
  },
  {
    "title": "Inside Harvard Law Review's Race-Based Article Selection Process. Plus, Israel Scores More Hits on Iranian Sites.",
    "description": "No melanin, big problem: When we published documents showing the Harvard Law Review uses race to select articles, the prestigious journal insisted they were taken out of context. Now, our Aaron Sibarium is back with 500 more of the review's internal documents…",
    "link": "https://freebeacon.com/newsletters/inside-harvard-law-reviews-race-based-article-selection-process-plus-israel-scores-more-hits-on-iranian-sites/",
    "timestamp": "2025-06-19T11:00:29Z"
  },
  {
    "title": "You Can Blame Trump For This Chaotic Dating Trend",
    "description": "The second Trump term has reignited a fantasy for Americans: finding the Canadian love of their life.",
    "link": "https://www.huffpost.com/entry/trump-americans-canadian-dating_l_6852deeee4b038d013e3473a",
    "timestamp": "2025-06-19T11:00:17Z"
  },
  {
    "title": "Iranian Govt Aircraft Make Mysterious Dash To Oman...",
    "description": "Iran's presidential A340 and two A321s have flown to Oman days after Israel declared air superiority over the country.",
    "link": "https://www.twz.com/news-features/gaggle-of-iranian-government-aircraft-make-mysterious-dash-to-oman",
    "timestamp": "2025-06-19T11:00:03Z"
  },
  {
    "title": "Trump's Military Crackdown on Los Angeles Was Unconstitutional | Opinion",
    "description": "What unfolded in Los Angeles this month wasn't about restoring order. It was a calculated power play.",
    "link": "https://www.newsweek.com/trumps-military-crackdown-los-angeles-was-unconstitutional-opinion-2087010",
    "timestamp": "2025-06-19T11:00:01Z"
  },
  {
    "title": "Bernie Sanders dives into a key House battleground Trump carried in 2024 with a new endorsement",
    "description": "Sen. Bernie Sanders, I-Vt., on Thursday announced his endorsement of Democrat Rebecca Cooke for Congress in Wisconsin’s 3rd District — making a foray into one of a handful of districts that could decide the next House majority, which President Donald Trump ca…",
    "link": "https://www.nbcnews.com/politics/2026-election/bernie-sanders-dives-key-house-battleground-trump-carried-2024-new-end-rcna213874",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "Democrats Need More Hobbies",
    "description": "A party of political junkies will struggle to win.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/democrats-hobbies/683163/",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "How the Glucose Monitor Became a MAHA Fixation",
    "description": "The gadget is emblematic of the movement’s emphasis on self-reliance.",
    "link": "https://www.theatlantic.com/family/archive/2025/06/continuous-glucose-monitor-maha/683224/",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "A New Middle East Is Unfolding Before Our Eyes",
    "description": "Iran has spent most of this century as the region’s rising power, yet other Arab countries have been making common cause with Israel.",
    "link": "https://time.com/7295798/new-middle-east-time-cover/",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "Thailand’s Government Seems on the Verge of Collapse—Again",
    "description": "Whether or not the military intervenes, Thailand’s government seems on the verge of collapse, again.",
    "link": "https://time.com/7295978/thailand-paetongtarn-shinawatra-government-collapse-coup-cambodia-economy-democracy-analysis/",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "The Trojan Horse Will Come for Us Too",
    "description": "The wars in Ukraine and the Middle East offer Americans a glimpse into the battles of the future—and a warning.",
    "link": "https://www.theatlantic.com/international/archive/2025/06/trojan-horse-drones-homeland/683234/",
    "timestamp": "2025-06-19T11:00:00Z"
  },
  {
    "title": "Transcript: MAGA Dope Pete Hegseth Implodes at Hearing, Exposing Trump",
    "description": "The following is a lightly edited transcript of the June 19 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nDefense S…",
    "link": "https://newrepublic.com/article/196992/transcript-maga-dope-pete-hegseth-implodes-hearing-exposing-trump",
    "timestamp": "2025-06-19T10:55:20Z"
  },
  {
    "title": "'Things have gotten worse': Trump policies are creating more illegal immigrants",
    "description": "Donald Trump is determined to deport more immigrants than any other president in history, and his policies are actually creating more undocumented people.More than 1 million people who were granted legal entry to the U.S. under various programs enacted by pre…",
    "link": "https://www.rawstory.com/illegal-immigration-2672400562/",
    "timestamp": "2025-06-19T10:54:26Z"
  },
  {
    "title": "Swiss Exports to US Collapse as Shippers Wait for Tariff Deal (Bastian Benrath-Wright/Bloomberg)",
    "description": "Bastian Benrath-Wright / Bloomberg:\nSwiss Exports to US Collapse as Shippers Wait for Tariff Deal  —  Swiss exports to the US plunged for a second month as cross-border shippers wait for a trade deal to cushion tariffs proposed by President Donald Trump.  —  …",
    "link": "https://www.memeorandum.com/250619/p10",
    "timestamp": "2025-06-19T10:50:02Z"
  },
  {
    "title": "CNBC's Inside India newsletter: Is India's hot IPO market cooling, or is it a blip?",
    "description": "Twelve months ago, India's initial public offering market was booming. This year, however, there has been a pronounced change.",
    "link": "https://www.cnbc.com/2025/06/19/cnbcs-inside-india-newsletter-is-indias-hot-ipo-market-cooling-or-is-it-a-blip.html",
    "timestamp": "2025-06-19T10:49:24Z"
  },
  {
    "title": "Israel-Iran: Trump caution on US involvement linked to doubts about ‘bunker buster’ bomb",
    "description": "US president has suggested it would only make sense to strike Fordow nuclear facility if destruction was guaranteed",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/19/israel-iran-trump-caution-on-us-involvement-linked-to-doubts-about-bunker-buster-bomb/",
    "timestamp": "2025-06-19T10:48:13Z"
  },
  {
    "title": "China learned a valuable lesson in US trade talks: the value of its leverage",
    "description": "US President Donald Trump may have touted the latest trade deal between the US and China as a win for America. But it’s Chinese leaders who have walked away with an extra spring in their step.",
    "link": "https://www.cnn.com/2025/06/19/business/china-negotiating-power-us-trade-talks",
    "timestamp": "2025-06-19T10:46:28Z"
  },
  {
    "title": "Trump is gutting an agency that gave $300 million to Wisconsin mental health initiatives",
    "description": "The funding brought innovative programs to Wisconsin that gave hundreds of rural students access to mental health care in their school buildings, offered free therapy sessions and found kids who would've slipped through the cracks.",
    "link": "https://madison.com/news/local/education/article_5dc329b3-ad15-48f5-b956-b79492562f8c.html",
    "timestamp": "2025-06-19T10:46:00Z"
  },
  {
    "title": "As our kids battle a rise in suicide and self-harm, we’re gutting the funding to fight it",
    "description": "Mental health issues among children are rising, and school officials say it's a crisis. Millions of dollars in federal aid for mental health was cut and state funding is threatened.",
    "link": "https://madison.com/tncms/asset/editorial/2e331c3c-2c65-423f-a0ac-41ac6058ab14/",
    "timestamp": "2025-06-19T10:45:00Z"
  },
  {
    "title": "Mark Levin Hit With Backlash After Telling Trump, ‘NO MORE MEETINGS’ With Iran",
    "description": "Fox News host Mark Levin received backlash from conservatives on Wednesday after he told President Donald Trump to hold \"NO MORE MEETINGS\" with Iran.\nThe post Mark Levin Hit With Backlash After Telling Trump, ‘NO MORE MEETINGS’ With Iran first appeared on Med…",
    "link": "https://www.mediaite.com/politics/mark-levin-hit-with-backlash-after-telling-trump-no-more-meetings-with-iran/",
    "timestamp": "2025-06-19T10:41:56Z"
  },
  {
    "title": "Goldman Sachs says Trump’s spending plan won’t stop the national debt from hitting ‘unsustainable’ highs not seen since World War II",
    "description": "The U.S. will pay $1 trillion in interest on the $36 trillion national debt next year, more than it spends on Medicare and defense. If lawmakers wait too long to address deficits, Goldman economists warn, a historic austerity push could be needed to avert dis…",
    "link": "https://biztoc.com/x/facf624237e3c604",
    "timestamp": "2025-06-19T10:41:54Z"
  },
  {
    "title": "Putin and Xi condemn Israel over its Iran strikes in phone call, Kremlin says",
    "description": "In a phone call, Presidents Putin and Xi condemned Israel's strikes on Iran, citing violations of international law and the UN Charter. Both leaders emphasized the need for de-escalation and a political, diplomatic resolution to the conflict and Iran's nuclea…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-and-xi-condemn-israel-over-its-iran-strikes-in-phone-call-kremlin-says/articleshow/121952560.cms",
    "timestamp": "2025-06-19T10:37:12Z"
  },
  {
    "title": "Trump vs Tulsi Gabbard: Is US President planning to fire US spy chief over provocative anti-war video?",
    "description": "US President Donald Trump was reportedly  'incensed' after his intelligence chief Tulsi Gabbard posted an AI-generated video online of a nuclear attack on the United States. Questions are being raised to their new equation in light of the Israel-Iran war. Rep…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-vs-tulsi-gabbard-is-us-president-planning-to-fire-us-spy-chief-over-provocative-anti-war-video/articleshow/121952484.cms",
    "timestamp": "2025-06-19T10:36:26Z"
  },
  {
    "title": "Israeli nuclear sites to face ‘crushing blows’ – Iranian source to RT",
    "description": "The Iranian security official also warned “another country” against joining the conflict on Israel’s side Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619810-iran-israel-nuclear-sites/",
    "timestamp": "2025-06-19T10:33:32Z"
  },
  {
    "title": "Goldman Sachs says Trump’s spending plan won’t stop the national debt from hitting ‘unsustainable’ highs not seen since World War II",
    "description": "If borrowing costs remain high, future lawmakers could be left in a tough spot.",
    "link": "https://fortune.com/2025/06/19/goldman-sachs-says-trumps-spending-plan-wont-stop-the-national-debt-from-hitting-unsustainable-highs-not-seen-since-world-war-ii/",
    "timestamp": "2025-06-19T10:33:00Z"
  },
  {
    "title": "ICE raids and their uncertainty scare off workers and baffle businesses",
    "description": "Farmers, cattle ranchers and hotel and restaurant managers breathed a sigh of relief last week when President Donald Trump ordered a pause to immigration raids that were disrupting those industries and scaring foreign-born workers off the job.",
    "link": "https://www.ksat.com/news/politics/2025/06/19/ice-raids-and-their-uncertainty-scare-off-workers-and-baffle-businesses/",
    "timestamp": "2025-06-19T10:27:10Z"
  },
  {
    "title": "ICE raids and their uncertainty scare off workers and baffle businesses",
    "description": "Farmers, cattle ranchers and hotel and restaurant managers breathed a sigh of relief last week when President Donald Trump ordered a pause to immigration raids that were disrupting those industries and scaring foreign-born workers off the job.",
    "link": "https://www.local10.com/news/politics/2025/06/19/ice-raids-and-their-uncertainty-scare-off-workers-and-baffle-businesses/",
    "timestamp": "2025-06-19T10:26:03Z"
  },
  {
    "title": "Israel Issues Strongest Direct Threat to Iran's Supreme Leader",
    "description": "Ayatollah Ali Khamenei is a target of the IDF.",
    "link": "https://www.newsweek.com/israel-issues-strongest-direct-threat-irans-supreme-leader-2087845",
    "timestamp": "2025-06-19T10:25:46Z"
  },
  {
    "title": "ICE raids and their uncertainty scare off workers and baffle businesses",
    "description": "Farmers, cattle ranchers and hotel and restaurant managers breathed a sigh of relief last week when President Donald Trump ordered a pause to immigration raids that were disrupting those industries and scaring foreign-born workers off the job.",
    "link": "https://www.click2houston.com/news/politics/2025/06/19/ice-raids-and-their-uncertainty-scare-off-workers-and-baffle-businesses/",
    "timestamp": "2025-06-19T10:25:35Z"
  },
  {
    "title": "Marsha P. Johnson Taught Us How To Defy This Anti-Trans Wave",
    "description": "\"Despite Trump’s attempts to erase trans people, I know he cannot because I know my community’s history,\" writes Raquel Willis.",
    "link": "https://time.com/7295713/how-to-defy-anti-trans-wave/",
    "timestamp": "2025-06-19T10:25:00Z"
  },
  {
    "title": "US intel still has no evidence Iran is building nuclear weapon – top Democrat",
    "description": "Senator Mark Warner says US President Donald Trump is ignoring spy agencies’ data on Iran, which still shows no move toward nuclear weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619802-us-intel-iran-nuclear-weapon-no-proof/",
    "timestamp": "2025-06-19T10:23:58Z"
  },
  {
    "title": "Malicious Minecraft mods distributed by the Stargazers DaaS target Minecraft gamers",
    "description": "Java-based malware targets Minecraft users via fake cheat tools, utilizing the Stargazers Ghost Network distribution-as-a-service (DaaS). Check Point researchers found a multi-stage malware on GitHub targeting Minecraft users via Stargazers DaaS, using Java/.…",
    "link": "https://securityaffairs.com/179127/malware/malicious-minecraft-mods-distributed-by-the-stargazers-daas-target-minecraft-gamers.html",
    "timestamp": "2025-06-19T10:20:54Z"
  },
  {
    "title": "Doctors and nurses at Madison primary care center want a union. It's a sign of health care changes.",
    "description": "Primary care providers face challenges like low profits and a worsening nursing shortage. At Madison-area Group Health Cooperative, those pressures have sparked a unionization campaign by doctors and nurses.",
    "link": "https://www.wpr.org/news/doctors-nurses-madison-primary-care-center-union-health-care-changes",
    "timestamp": "2025-06-19T10:20:53Z"
  },
  {
    "title": "Grattan on Friday: Sussan Ley has her first big outing with the national media next week, so here are some questions for her",
    "description": "Sussan Ley is already breaking from her predecessor and fronting the National Press Club. Here are some questions she’ll need to answer.",
    "link": "https://theconversation.com/grattan-on-friday-sussan-ley-has-her-first-big-outing-with-the-national-media-next-week-so-here-are-some-questions-for-her-258970",
    "timestamp": "2025-06-19T10:20:15Z"
  },
  {
    "title": "Kim Jong Un Quietly Advances North Korea's Nuclear Program",
    "description": "The United Nations-backed atomic watchdog warned a building under construction resembles a long-suspected nuclear enrichment site west of Pyongyang.",
    "link": "https://www.newsweek.com/kim-jong-un-north-korea-nuclear-program-uranium-enrichment-complex-iaea-2087711",
    "timestamp": "2025-06-19T10:19:57Z"
  },
  {
    "title": "ICE raids and their uncertainty scare off workers and baffle businesses",
    "description": "Farmers, cattle ranchers and hotel and restaurant managers breathed a sigh of relief last week when President Donald Trump ordered a pause to immigration raids that were disrupting those industries and scaring foreign-born workers off the job",
    "link": "https://abcnews.go.com/Politics/wireStory/ice-raids-uncertainty-scare-off-workers-baffle-businesses-123002025",
    "timestamp": "2025-06-19T10:18:04Z"
  },
  {
    "title": "Netanyahu declares Israel 'will exact the full price' after Iranian strike hits hospital in Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu declared Israel \"will exact the full price from the tyrants in Tehran\" after the rogue regime struck an Israeli medical facility.",
    "link": "https://www.foxnews.com/world/netanyahu-declares-israel-will-exact-full-price-after-iranian-strike-hits-hospital-israel",
    "timestamp": "2025-06-19T10:18:04Z"
  },
  {
    "title": "CNN Guest Says Trump Acts Like a Guy ‘From the Memory Wing of a Nursing Home’: ‘He’s Slurring’",
    "description": "Podcast host Jennifer Welch expressed concern over President Donald Trump's cognitive health on CNN NewsNight, Wednesday.\nThe post CNN Guest Says Trump Acts Like a Guy ‘From the Memory Wing of a Nursing Home’: ‘He’s Slurring’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-guest-says-trump-acts-like-a-guy-from-the-memory-wing-of-a-nursing-home-hes-slurring/",
    "timestamp": "2025-06-19T10:17:32Z"
  },
  {
    "title": "Exclusive-Democrats want new leaders, focus on pocketbook issues, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -Democrats want new leaders for their party, which many feel isn't focusing enough on economic issues and is over-emphasizing issues like transgender rights and electric vehicles, a Reuters/Ipsos poll found. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/19/exclusive-democrats-want-new-leaders-focus-on-pocketbook-issues-reutersipsos-poll-finds",
    "timestamp": "2025-06-19T10:16:00Z"
  },
  {
    "title": "New U.S. guidelines make social media screening mandatory for student visas",
    "description": "WASHINGTON D.C.: The United States has introduced a new policy requiring international student visa applicants to undergo interviews and disclose their social media details as part of a broader effort to strengthen security screening. Applicants must provide …",
    "link": "https://english.khabarhub.com/2025/19/478579/",
    "timestamp": "2025-06-19T10:15:34Z"
  },
  {
    "title": "Swiss Exports to U.S. Collapse",
    "description": "“Swiss exports to the US plunged for a second month as cross-border shippers wait for a trade deal to cushion tariffs proposed by President Donald Trump,” Bloomberg reports.",
    "link": "https://politicalwire.com/2025/06/19/swiss-exports-to-u-s-collapse/",
    "timestamp": "2025-06-19T10:15:00Z"
  },
  {
    "title": "Rupee hits 3-month low on worries over US role in Middle East conflict",
    "description": "The Indian rupee weakened to its lowest level since mid-March amid heightened risk aversion in financial markets, fueled by concerns over potential U.S. involvement in the Israel-Iran conflict. Rising Brent crude oil prices, nearing $77 per barrel, further pr…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-hits-3-month-low-on-worries-over-us-role-in-middle-east-conflict/articleshow/121952027.cms",
    "timestamp": "2025-06-19T10:14:03Z"
  },
  {
    "title": "Kiev: Russia has been rejecting ceasefire calls for 100 days",
    "description": "Ukraine said on Thursday that Russia has for more than three months been refusing a U.S. and Ukrainian proposal to halt the fighting without any preconditions, while the Russian President said he would only meet his Ukrainian counterpart in “final phase” of p…",
    "link": "https://www.hurriyetdailynews.com/kiev-russia-has-been-rejecting-ceasefire-calls-for-100-days-210492",
    "timestamp": "2025-06-19T10:11:14Z"
  },
  {
    "title": "Zelenskyy calls for more pressure on Russia after deadly Kyiv missile strike",
    "description": "Ukrainian President Volodymyr Zelenskyy is urging greater international pressure on Moscow following a deadly Russian missile strike that hit a Kyiv apartment building this week, killing 23 people",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-calls-pressure-russia-after-deadly-kyiv-missile-123001704",
    "timestamp": "2025-06-19T10:10:44Z"
  },
  {
    "title": "Pope Leo Is Shaping Up To Be Trump's Most Effective Moral Opponent | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn June 14, Donald Trump marked his 79th birthday with a military parade in Washington D.C. At the same time, in a far more humble setting—center field at Chicago's Guaranteed Rate Field—Cardinal Blase Cupich …",
    "link": "https://biztoc.com/x/87fd6a6471430fae",
    "timestamp": "2025-06-19T10:08:54Z"
  },
  {
    "title": "UK's central bank set to keep interest rates on hold amid Middle East uncertainties",
    "description": "The Bank of England is set to keep interest rates on hold as fears grow that the conflict between Israel and Iran will escalate to involve the United States and send oil prices soaring and push U.K. inflation further above target. The bank’s nine-member Monet…",
    "link": "https://www.seattlepi.com/news/world/article/uk-s-central-bank-set-to-keep-interest-rates-on-20384667.php",
    "timestamp": "2025-06-19T10:05:09Z"
  },
  {
    "title": "NBAA Praises US-UK Aerospace Tariff Policy",
    "description": "Return To Net Zero Part Of Economic Prosperity Plan The National Business Aviation Association commended the return to zero-for-zero tariffs on aerospace products from the United Kingdom that was part of an Executive Order (EO) issued by President Donald Trum…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=E0D418B2-2A04-4337-B2CD-16EC222D2F7D",
    "timestamp": "2025-06-19T10:05:00Z"
  },
  {
    "title": "Israel Moves To ‘Intensify Strikes’ After Iranian Missile Damages Hospital (Live Updates)",
    "description": "In a post on his Truth Social platform, Trump had directly threatened the Iranian Supreme Leader, saying he knew \"where the so-called ‘Supreme Leader’ is hiding.\"",
    "link": "https://www.forbes.com/sites/siladityaray/2025/06/19/israel-moves-to-intensify-strikes-after-iranian-missile-damages-hospital-live-updates/",
    "timestamp": "2025-06-19T10:04:36Z"
  },
  {
    "title": "Trump downplays signs of MAGA unrest over possible military strike on Iran",
    "description": "Trump responds to divisions within his MAGA base over possible Iran strikes, stating supporters are \"more in love\" with him while insisting Iran \"can not have a nuclear weapon.\"",
    "link": "https://www.foxnews.com/politics/trump-downplays-signs-maga-unrest-over-possible-military-strike-iran",
    "timestamp": "2025-06-19T10:00:55Z"
  },
  {
    "title": "Dem shredded for calling to put 'every single' illegal immigrant on a quick path to citizenship",
    "description": "Rep. Maxwell Frost faced swift backlash after suggesting the solution to illegal immigration is providing a path to citizenship for all illegal immigrants.",
    "link": "https://www.foxnews.com/media/dem-shredded-calling-put-every-single-illegal-immigrant-quick-path-citizenship",
    "timestamp": "2025-06-19T10:00:36Z"
  },
  {
    "title": "How And Why The Future Of Geopolitics Is Playing Out In Southeast Asia",
    "description": "Malaysia’s ASEAN leadership in 2025 reveals how geopolitics now favors soft power, digital diplomacy, and moral clarity—without the tools to enforce real change.",
    "link": "https://www.forbes.com/sites/benjaminlaker/2025/06/19/how-and-why-the-future-of-geopolitics-is-playing-out-in-southeast-asia/",
    "timestamp": "2025-06-19T10:00:33Z"
  },
  {
    "title": "Pope Leo Is Shaping Up To Be Trump's Most Effective Moral Opponent | Opinion",
    "description": "Is Pope Leo anti-MAGA? No. Is he part of the Resistance? Not really. But will he stand as a moral bulwark against Trump's worst instincts? Absolutely.",
    "link": "https://www.newsweek.com/pope-leo-shaping-trumps-most-effective-moral-opponent-opinion-2086967",
    "timestamp": "2025-06-19T10:00:01Z"
  },
  {
    "title": "Escalating tensions fuel questions about Trump’s endgame in the Middle East",
    "description": "Jen Psaki says that despite Trump's past attempts to paint himself as a \"peacemaker' his escalating rhetoric over the Israel-Iran conflict shows otherwise.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-israel-iran-endgame-rcna213757",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "Juneteenth is at risk of becoming a footnote in America’s classrooms",
    "description": "This Juneteenth arrives after Donald Trump has attacked DEI, fired prominent Black leaders, threatened civil rights and praised Confederate generals.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/juneteenth-freedom-dei-trump-rcna211892",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "Iran Preparing For A Long WAR",
    "description": "The Iranian ruling class has been preparing for a long war against Israel. According to an official in Tehran, it has plans to “shut down Israel’s war machine,” in the process. The official outlined Iran’s extensive list of potential targets within “occupied …",
    "link": "https://www.activistpost.com/iran-preparing-for-a-long-war/",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "The subtext of the Trump's dangerously unserious crypto bill",
    "description": "Eighteen Democrats helped the Senate pass the first major piece of crypto legislation this week, but the bill has serious flaws.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/genius-act-cryptocurrency-stablecoin-trump-congress-rcna213839",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "Trump's megabill is already unpopular. It's only downhill from here.",
    "description": "President Donald Trump's signature piece of legislation is already unpopular. It's only downhill from here.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-megabill-polls-immigration-project-47-rcna213505",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "How the Billionaires Took Over",
    "description": "I.\r\nA Parliament of Billionaires\r\nDonald Trump is America’s first billionaire president. He entered the White House in 2017 with a net worth of $3.7 billion, according to Forbes, and in 2025 with a net worth of $5.2 billion. Trump’s habitat, unlike yours or m…",
    "link": "https://newrepublic.com/article/196176/trump-billionaires-america-wealth-inequality",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "Shining light on Juneteenth's origins and history",
    "description": "The day marks the occasion when Union troops announced the freedom of all slaves in the U.S.",
    "link": "https://www.snopes.com//articles/470345/juneteenth-history-origins/",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "As conflict between Israel and Iran escalates, Canadians with ties to region watch anxiously",
    "description": "Winnipeg's Harlan Abells was supposed to be heading on a trip to Israel on Friday. Instead, he's been checking with friends who live there to make sure they're safe, as he and other Canadians anxiously watch the escalating conflict between Israel and Iran.",
    "link": "https://www.cbc.ca/news/canada/manitoba/iran-israel-conflict-canadians-1.7565176",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "The U.S. Needs a Polite Way to Usher Politicians Out",
    "description": "If parties won’t nudge unfit politicians into retirement, what can?",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/us-needs-polite-way-usher-politicians-out/683230/",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "Texas’ border wall plan appears to be facing a sad, silent death",
    "description": "Texas appears to have quietly axed its plans to construct its own border wall between itself and Mexico, which could mark the end of an embarrassing boondoggle designed to bolster one of Trump’s early campaign slogans.",
    "link": "https://www.msnbc.com/top-stories/latest/texas-border-wall-funding-abbott-trump-rcna213765",
    "timestamp": "2025-06-19T10:00:00Z"
  },
  {
    "title": "UK's central bank set to keep interest rates on hold amid Middle East uncertainties",
    "description": "The Bank of England is set to keep interest rates on hold as fears grow that the conflict between Israel and Iran will escalate to involve the United States and send oil prices soaring and push U.K. inflation further above target",
    "link": "https://abcnews.go.com/Business/wireStory/uks-central-bank-set-interest-rates-hold-amid-123001703",
    "timestamp": "2025-06-19T09:58:41Z"
  },
  {
    "title": "Swiss cut key interest rate by a quarter percentage point, putting its target now at 0%",
    "description": "Switzerland’s central bank says it has cut its target interest rate by a quarter of a percentage point, adding inflationary pressures have eased",
    "link": "https://abcnews.go.com/Business/wireStory/swiss-cut-key-interest-rate-quarter-percentage-point-123001330",
    "timestamp": "2025-06-19T09:58:16Z"
  },
  {
    "title": "IAEA Head Debunks Warmongers' Claim About Iran Nukes",
    "description": "I still can’t wrap my head around the fact that we’re facing Iraq War 2.0, only worse. That’s despite the fact that Americans already voted in Trump 2.0, but obviously worse.\nBut here we are. Donald Trump is playing footsie with Israel’s war against Iran, eve…",
    "link": "https://crooksandliars.com/2025/06/iaea-head-debunks-warmongers-claim-about",
    "timestamp": "2025-06-19T09:52:07Z"
  },
  {
    "title": "Trump embraces Pakistan: ‘Tactical romance’ or a new ‘inner circle’?",
    "description": "Trump hosts Pakistan army chief Asim Munir for an unprecedented White House lunch, as the US and Pakistan reset ties.",
    "link": "https://www.aljazeera.com/news/2025/6/19/trumps-pakistan-embrace-tactical-romance-or-a-new-inner-circle",
    "timestamp": "2025-06-19T09:49:10Z"
  },
  {
    "title": "Gavin Newsom Mocks Trump's 'Made in China' Smartphone",
    "description": "The governor has jumped on the growing doubts that the Trump Organization's latest venture will honor its American-made branding.",
    "link": "https://www.newsweek.com/gavin-newsom-mocks-trump-american-made-smartphone-2087792",
    "timestamp": "2025-06-19T09:47:55Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Blow Within Hours",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has suffered two legal blows to his deportation agenda in the courts within hours of each other.\nOne legal blow came from Judge Stephanie Haines, a Trump appointee in Pennsylvania, who t…",
    "link": "https://biztoc.com/x/e5cfd2dae8bbbe15",
    "timestamp": "2025-06-19T09:46:18Z"
  }
]