[
  {
    "title": "Ex-ICE Chief of Staff: ‘No One’ Believes Trump’s Immigration Raids Improve ‘Public Safety’",
    "description": "Jason Houser said none of the agents he has talked to believe President Trump's crackdown on illegal immigration has been good for \"public safety\"\nThe post Ex-ICE Chief of Staff: ‘No One’ Believes Trump’s Immigration Raids Improve ‘Public Safety’ first appear…",
    "link": "https://www.mediaite.com/media/ex-ice-chief-of-staff-no-one-believes-trumps-immigration-raids-improve-public-safety/",
    "timestamp": "2026-01-20T22:47:09Z"
  },
  {
    "title": "Federal judge says Trump-appointed federal prosecutor in Virginia is ‘masquerading’ in the job",
    "description": "Two judges made clear that they believed it was time for her tenure to end.",
    "link": "https://www.bostonherald.com/2026/01/20/justice-department-halligan-masquerading/",
    "timestamp": "2026-01-20T22:44:51Z"
  },
  {
    "title": "Natural gas prices jump 25% as winter storm approaches",
    "description": "Natural gas prices skyrocketed Tuesday as half of the country braces for a huge winter storm projected to hit this weekend.",
    "link": "https://www.nbcnews.com/business/energy/natural-gas-prices-jump-25-winter-storm-approaches-rcna255054",
    "timestamp": "2026-01-20T22:43:40Z"
  },
  {
    "title": "Furious dog-sledders snub Trump admin from major event in Greenland",
    "description": "A group of angry dog-sledders snubbed the Trump administration from attending a major event in Greenland, according to reports Tuesday. Louisiana Gov. and U.S. envoy to Greenland Jeff Landry was disinvited by Greenlanders to a dogsled race, an annual event wi…",
    "link": "https://www.rawstory.com/trump-greenland-2674914410/",
    "timestamp": "2026-01-20T22:42:02Z"
  },
  {
    "title": "Trump Facing Warning Signs One Year In Amid ‘Growing Economic Pessimism,’ Analysts Say",
    "description": "President Donald Trump is facing warning signs a year into his second term as some recent polls have shown many Americans are now concerned about his economy.",
    "link": "https://dailycaller.com/2026/01/20/trump-economic-warning-signs-economists/",
    "timestamp": "2026-01-20T22:39:47Z"
  },
  {
    "title": "Where Trump stands in the polls one year in: From the Politics Desk",
    "description": "Steve Kornacki compares President Donald Trump's poll numbers to those of his recent predecessors at similar points in their White House tenures.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-stands-polls-one-year-politics-desk-rcna255068",
    "timestamp": "2026-01-20T22:37:18Z"
  },
  {
    "title": "Trump floats ‘Board of Peace’ to replace UN, signals major global power shift",
    "description": "President Donald Trump invited dozens of countries including Russia, China, and Ukraine to join his Board of Peace initiative, with a signing ceremony planned for Davos, Switzerland.",
    "link": "https://www.foxnews.com/world/trump-floats-board-peace-replace-un-signals-major-global-power-shift",
    "timestamp": "2026-01-20T22:36:52Z"
  },
  {
    "title": "Trump 365 Days In: Americans Deliver a C- and Say Why It Hurts",
    "description": "After 365 days back in the White House, Americans give President Trump a C- grade, citing cost-of-living struggles and shifting priorities as key reasons behind public dissatisfaction.",
    "link": "https://www.ibtimes.com/trump-365-days-americans-deliver-c-say-why-it-hurts-3795805",
    "timestamp": "2026-01-20T22:36:51Z"
  },
  {
    "title": "Is Trump Trapped in a Fortress of Paranoia? Inside the Mindset That Refuses To Evolve With Age",
    "description": "Analysis of Trump's push to buy Greenland shows a stubborn worldview, dated strategy, and psychology, sparking diplomatic rifts and global concern.",
    "link": "https://www.ibtimes.com/trump-trapped-fortress-paranoia-inside-mindset-that-refuses-evolve-age-3795808",
    "timestamp": "2026-01-20T22:36:09Z"
  },
  {
    "title": "Newsom warns ‘pathetic’ foreign leaders to grow a backbone in bizarre takedown likening Trump to a T.rex",
    "description": "California Governor Gavin Newsom criticizes European leaders at Davos for allegedly being \"complicit\" with Trump's Greenland threats and tariffs.",
    "link": "https://www.foxnews.com/politics/newsom-warns-pathetic-foreign-leaders-grow-backbone-bizarre-takedown-likening-trump-t-rex",
    "timestamp": "2026-01-20T22:35:50Z"
  },
  {
    "title": "Business Titans Privately Slam Trump's Erratic Trade Tactics As Allies Pretend Loyalty in Public",
    "description": "US business leaders privately slam Trump's erratic trade policies as Supreme Court challenges fuel market and boardroom unease.",
    "link": "https://www.ibtimes.com/business-titans-privately-slam-trumps-erratic-trade-tactics-allies-pretend-loyalty-public-3795816",
    "timestamp": "2026-01-20T22:35:10Z"
  },
  {
    "title": "Trump’s stated reasons for taking Greenland are wrong – but the tactics fit with the plan to limit China’s economic interests",
    "description": "A 1951 defense agreement between the United States and Denmark allows the US to build military installations on Greenland to protect the region.",
    "link": "https://theconversation.com/trumps-stated-reasons-for-taking-greenland-are-wrong-but-the-tactics-fit-with-the-plan-to-limit-chinas-economic-interests-273548",
    "timestamp": "2026-01-20T22:34:16Z"
  },
  {
    "title": "Republican Sen. Says He Would Move Against Trump If He Uses 'Kinetic Action' To Take Over Greenland",
    "description": "Republican Sen. Thom Tillis said he would move to prevent Donald Trump to use military action to take over Greenland if the president authorizes \"kinetic action\" for that purpose.",
    "link": "https://www.ibtimes.com/republican-sen-says-he-would-move-against-trump-if-he-uses-kinetic-action-take-over-greenland-3795822",
    "timestamp": "2026-01-20T22:34:00Z"
  },
  {
    "title": "The one thing vital to countering a GOP bent on vast cruelty has been shunned by Dems",
    "description": "The past year has completely discredited any claim that choosing between the Democratic and Republican parties would be merely a matter of “pick your poison” with the same end result. In countless terrible ways, the last 12 months have shown that Donald Trump…",
    "link": "https://www.rawstory.com/midterm-elections-2674912364/",
    "timestamp": "2026-01-20T22:33:02Z"
  },
  {
    "title": "Syria's Kurdish Revolution Has Been Crushed",
    "description": "Syrian Kurds built an anarchist-inspired revolution in the Middle East. Now it’s being crushed.",
    "link": "https://reason.com/2026/01/20/syrias-kurdish-revolution-has-been-crushed/",
    "timestamp": "2026-01-20T22:32:41Z"
  },
  {
    "title": "Muted anniversary: Trump marks first year back with grievances",
    "description": "\"God is very proud of the work I have done,\" said US President Donald Trump.",
    "link": "https://www.channelnewsasia.com/world/trump-marks-first-year-us-presidency-5872151",
    "timestamp": "2026-01-20T22:32:02Z"
  },
  {
    "title": "Trump Greenland Threats, Tariff Jitters Send Shoe Stocks Tumbling",
    "description": "Stocks tumbled Tuesday amid U.S. President Donald Trump's threat of new tariffs on eight European allies if they fail to accept his Greenland demand.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/shoe-stocks-donald-trump-threat-new-tariffs-greenland-1238465649/",
    "timestamp": "2026-01-20T22:30:34Z"
  },
  {
    "title": "US Forces Seize Seventh Sanctioned Oil Tanker Linked To Venezuela",
    "description": "President Donald Trump's efforts to control oil in the South American country continue.",
    "link": "https://www.huffpost.com/entry/us-forces-seize-seventh-sanctioned-oil-tanker-linked-to-venezuela_n_6970008ce4b06c2b9736ddfe",
    "timestamp": "2026-01-20T22:29:43Z"
  },
  {
    "title": "Giant Display Of Trump's Alleged Birthday Message To Epstein Appears In Washington",
    "description": "Visitors were encouraged to sign the note with their own message for the Trump administration — and many did not hold back.",
    "link": "https://www.huffpost.com/entry/trump-epstein-birthday-message-national-mall-washingto_n_696fd299e4b0559a859154c3",
    "timestamp": "2026-01-20T22:29:01Z"
  },
  {
    "title": "Mexico sends 37 more cartel suspects to US amid rising tensions",
    "description": "MEXICO CITY, Jan 20 (Reuters) - Mexico has sent another 37 alleged members of criminal organizations to the United States, Mexico’s security minister said on Tuesday. The… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/mexico-sends-37-more-cartel-suspects-to-us-amid-rising-tensions",
    "timestamp": "2026-01-20T22:28:56Z"
  },
  {
    "title": "Mugshots, binder clip and Hells Angels feature in Trump’s one-year anniversary remarks",
    "description": "By Tim Reid and Trevor HunnicuttWASHINGTON, Jan 20 (Reuters) - President Donald Trump marked the one‑year anniversary of his return to the White House on Tuesday with a w… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/mugshots-binder-clip-and-hells-angels-feature-in-trump-s-one-year-anniversary-remarks",
    "timestamp": "2026-01-20T22:25:57Z"
  },
  {
    "title": "Trump, 79, Kicks Off Press Conference by Reading Aloud to Himself (Ellie Quinlan Houghtaling/New Republic)",
    "description": "Ellie Quinlan Houghtaling / New Republic:\nTrump, 79, Kicks Off Press Conference by Reading Aloud to Himself … It's been exactly one year since Donald Trump returned to the nation's highest office.  To mark the occasion, the president secured quality time in f…",
    "link": "https://www.memeorandum.com/260120/p109",
    "timestamp": "2026-01-20T22:25:00Z"
  },
  {
    "title": "'You'll find out,' Trump says on Greenland takeover strategy (Garrett Downs/CNBC)",
    "description": "Garrett Downs / CNBC:\n'You'll find out,' Trump says on Greenland takeover strategy … President Donald Trump on Tuesday declined to detail what lengths he will go to in order to achieve his aim of making Greenland part of the United States, one day before he i…",
    "link": "https://www.memeorandum.com/260120/p108",
    "timestamp": "2026-01-20T22:25:00Z"
  },
  {
    "title": "GOP Congressman Says Trump Shouldn’t Have Invited ‘War Criminal’ Putin to Join ‘Board of Peace’",
    "description": "Rep. Mike Lawler (R-NY) criticized President Donald Trump Tuesday, saying that he should not have invited Russia's Vladimir Putin to join his \"Board of Peace\" to manage Gaza, calling the Russian a \"war criminal.\"\nThe post GOP Congressman Says Trump Shouldn’t …",
    "link": "https://www.mediaite.com/media/tv/gop-congressman-says-trump-shouldnt-have-invited-war-criminal-putin-to-join-board-of-peace/",
    "timestamp": "2026-01-20T22:24:14Z"
  },
  {
    "title": "Trump made many statements on US economy. Most are untrue",
    "description": "In address to media on Tuesday, US president made many false claims, including that there was 'no inflation' in the US.",
    "link": "https://www.aljazeera.com/economy/2026/1/20/trump-made-many-statements-on-us-economy-most-are-untrue",
    "timestamp": "2026-01-20T22:23:13Z"
  },
  {
    "title": "Trump expresses frustration, says his team has made 'some mistakes' one year in office",
    "description": "Trump said Tuesday that federal agents \"make mistakes sometimes\" in enforcing his immigration crackdown.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-frustration-team-mistakes-one-year-office-rcna255059",
    "timestamp": "2026-01-20T22:21:51Z"
  },
  {
    "title": "With Trade Deal, Canada Bets on China",
    "description": "For all its risks, Beijing has become a more predictable partner than the United States under Trump.",
    "link": "http://foreignpolicy.com/2026/01/20/china-canada-trade-deal-trump-us-tariffs-agriculture-electric-vehicles/",
    "timestamp": "2026-01-20T22:20:30Z"
  },
  {
    "title": "Gaza Vanishing: Trump’s Board of Peace",
    "description": "Donald Trump’s Board of Peace overseeing the reconstruction of Gaza was always going to raise a host of niggling questions.  From the outset, the US President made it clear he would be the helmsman of what was essentially an outfit …\nThe post Gaza Vanishing: …",
    "link": "https://www.globalresearch.ca/gaza-vanishing-trump-board-peace/5912779",
    "timestamp": "2026-01-20T22:16:55Z"
  },
  {
    "title": "‘GREAT STUPIDITY’: Trump Blasts UK’s Chagos Islands Deal as Proof US Needs Greenland",
    "description": "President Donald Trump excoriated the British government in a Truth Social Post on Monday for agreeing to relinquish sovereignty of the Chagos Islands, a strategic... Read More\nThe post ‘GREAT STUPIDITY’: Trump Blasts UK’s Chagos Islands Deal as Proof US Need…",
    "link": "https://www.dailysignal.com/2026/01/20/great-stupidity-trump-blasts-uks-chagos-islands-deal-as-proof-us-needs-greenland/",
    "timestamp": "2026-01-20T22:15:00Z"
  },
  {
    "title": "Japan court to rule in trial of man charged with killing ex-PM Abe",
    "description": "TOKYO, Jan 21 (Reuters) - A Japanese court will ‌on Wednesday deliver its verdict on a man accused of fatally shooting former Prime Minister Shinzo Abe, three ‌and a half years after the assassination of the country's longest-serving premier stunned the natio…",
    "link": "https://www.thestar.com.my/news/world/2026/01/21/japan-court-to-rule-in-trial-of-man-charged-with-killing-ex-pm-abe",
    "timestamp": "2026-01-20T22:15:00Z"
  },
  {
    "title": "Federal judge says Trump-appointed federal prosecutor in Virginia is 'masquerading' in the job",
    "description": "Two judges in Virginia are rejecting Trump administration arguments that a White House loyalist can continue serving as a top federal prosecutor in the state, with one soliciting applications for a replacement and the other prohibiting Lindsey Halligan...",
    "link": "https://abcnews.go.com/US/wireStory/federal-judge-trump-appointed-federal-prosecutor-virginia-masquerading-129399344",
    "timestamp": "2026-01-20T22:14:23Z"
  },
  {
    "title": "Don Lemon responds to DOJ threats & Nicki Minaj’s homophobic insults over his Minneapolis ICE coverage",
    "description": "After the Department of Justice under President Donald Trump publicly warned that his coverage of an anti-ICE protest inside a Minnesota church could carry legal consequences, independent journalist Don Lemon has forcefully defended his journalism. Free press…",
    "link": "https://www.advocate.com/news/don-lemon-doj-threats-minneapolis",
    "timestamp": "2026-01-20T22:12:51Z"
  },
  {
    "title": "“The bargain no longer works”: Canada’s Prime Minister calls out America’s economic hegemony",
    "description": "Mark Carney called the global order based on rules a “fiction” in a World Economic Forum speech Tuesday",
    "link": "https://www.salon.com/2026/01/20/the-bargain-no-longer-works-canadas-prime-minister-calls-out-americas-economic-hegemony/",
    "timestamp": "2026-01-20T22:11:53Z"
  },
  {
    "title": "Mark Carney Warns “American Hegemony” Is Destroying World Order in Candid Speech",
    "description": "States like Canada have long known the current system of international rules-based order is a “fiction,” Carney said.",
    "link": "https://truthout.org/articles/mark-carney-warns-american-hegemony-is-destroying-world-order-in-candid-speech/",
    "timestamp": "2026-01-20T22:09:46Z"
  },
  {
    "title": "Don Lemon Claps Back At ‘Pick Me’ Rap Diva’s Vulgar Attack Over ICE Church Protest Coverage",
    "description": "“I’m not surprised Nicki Minaj does not understand journalism and is weighing in on matters that are above her capacity,” Don Lemon said.",
    "link": "https://www.huffpost.com/entry/don-lemon-nicki-minaj-ice-protest-pick-me-maga_n_696fde7de4b06c2b9736b507",
    "timestamp": "2026-01-20T22:08:56Z"
  },
  {
    "title": "Why Trump’s Justice Department Is Redefining Dissent as Terrorism",
    "description": "This is how the government turns protected speech into a federal crime.",
    "link": "https://slate.com/news-and-politics/2026/01/donald-trump-minneapolis-walz-frey-ice-terrorism.html",
    "timestamp": "2026-01-20T22:08:30Z"
  },
  {
    "title": "‘These are rough characters’: Trump forces media to look at mugshots of illegal criminals during briefing",
    "description": "President makes surprise visit to presser, presents list of accomplishments during 1st year of 2nd term",
    "link": "https://www.wnd.com/2026/01/these-are-rough-characters-trump-forces-media-look/",
    "timestamp": "2026-01-20T22:07:02Z"
  },
  {
    "title": "Trump Has Made ICE the Largest Law Enforcement Agency in the Country",
    "description": "With Congress-approved funding, ICE detention is expected to triple in size, mirroring the scale of Japanese internment.",
    "link": "https://truthout.org/articles/trump-has-made-ice-the-largest-law-enforcement-agency-in-the-country/",
    "timestamp": "2026-01-20T22:02:50Z"
  },
  {
    "title": "Netflix intensifies bid for Warner Bros making its $72 billion offer all cash",
    "description": "Netflix is now offering to buy Warner Bros. Discovery's studio and streaming business in all cash.",
    "link": "https://abc30.com/post/netflix-intensifies-bid-warner-bros-making-72-billion-offer-cash/18439081/",
    "timestamp": "2026-01-20T22:01:28Z"
  },
  {
    "title": "Whoops: Trump Reveals He's Actually Been Thinking Of Iceland This Whole Time",
    "description": "WASHINGTON, D.C. — While appearing at a White House press briefing on Tuesday, President Donald Trump revealed that he had been mistaken and was actually thinking of Iceland this whole time.",
    "link": "https://babylonbee.com/news/whoops-trump-reveals-hes-actually-been-thinking-of-iceland-this-whole-time",
    "timestamp": "2026-01-20T22:01:01Z"
  },
  {
    "title": "XRP’s Quiet Phase May Be Setting Up A Sudden Breakout: Expert",
    "description": "XRP’s next big rise could come with hardly any warning, traders and analysts warn. Markets are quiet now. That quiet has happened before, and it has sometimes been followed by sharp moves that catch most people off guard. Related Reading: Bitcoin Senses Risk …",
    "link": "http://www.newsbtc.com/altcoin/xrps-quiet-phase-may-be-setting-up-a-sudden-breakout-expert/",
    "timestamp": "2026-01-20T22:00:37Z"
  },
  {
    "title": "'Went on forever': Trump's lengthy 'whining' gets low marks from CNN panel",
    "description": "The panel on CNN's \"The Arena\" with Kasie Hunt gave President Donald Trump poor marks for his speech on Tuesday. Trump spoke at the White House press briefing for about 80 minutes before taking questions from reporters, meandering through topics ranging from …",
    "link": "https://www.rawstory.com/trump-2674914320/",
    "timestamp": "2026-01-20T22:00:36Z"
  },
  {
    "title": "Report: DOJ Subpoenas More Minnesota Dems in Probe Alleging ICE Obstruction",
    "description": "Gov. Tim Walz, Attorney General Keith Ellison, and Minneapolis Mayor Jacob Frey are a few who received the subpoenas.\nThe post Report: DOJ Subpoenas More Minnesota Dems in Probe Alleging ICE Obstruction first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/report-doj-subpoenas-more-minnesota-dems-in-probe-alleging-ice-obstruction/",
    "timestamp": "2026-01-20T22:00:24Z"
  },
  {
    "title": "Trump mocked after posting private texts with world leaders in late-night online spree",
    "description": "President Donald Trump triggered a fresh round of backlash after spending the early hours of Tuesday posting screenshots of private text messages with European leaders, an unusual breach of diplomatic norms that critics said made the presidency look unserious…",
    "link": "https://www.rawstory.com/nato-2674912930/",
    "timestamp": "2026-01-20T22:00:03Z"
  },
  {
    "title": "Commentary: Europe is pushing back harder against Trump over Greenland - here’s why",
    "description": "<![CDATA[ Given Europe’s latest response over Greenland, it seems clear that the strategy of placating US President Donald Trump has reached its use-by date, says international security professor Stefan Wolff. ]]>",
    "link": "https://www.channelnewsasia.com/commentary/european-union-trade-bazooka-donald-trump-greenland-5870551",
    "timestamp": "2026-01-20T22:00:00Z"
  },
  {
    "title": "45 Years Later, President Trump Is Delivering on Reagan’s Promise",
    "description": "One year ago today—Jan. 20, 2025—President Donald Trump was sworn in as the 47th President of the United States inside the U.S. Capitol Rotunda. Freezing... Read More\nThe post 45 Years Later, President Trump Is Delivering on Reagan’s Promise appeared first on…",
    "link": "https://www.dailysignal.com/2026/01/20/45-years-later-president-trump-is-delivering-on-reagans-promise/",
    "timestamp": "2026-01-20T22:00:00Z"
  },
  {
    "title": "Trump Organization-owned home right next to Mar-a-Lago lists for rent — for $1.47M a year",
    "description": "That asking price is less than the cost of Mar-a-Lago's rumored $2 million initiation fee -- and that's if you can get in.",
    "link": "https://nypost.com/2026/01/20/real-estate/trump-organization-owned-home-next-to-mar-a-lago-lists-for-1-47m-a-year/",
    "timestamp": "2026-01-20T22:00:00Z"
  },
  {
    "title": "Second Lady Usha Vance Reveals She’s Expecting Fourth Child, Due July 2026",
    "description": "Second Lady Usha Vance revealed Tuesday that she is expecting the couple’s fourth child, a son, who is due in late July, marking a historic first for the office she holds.\nThe post Second Lady Usha Vance Reveals She’s Expecting Fourth Child, Due July 2026 app…",
    "link": "https://www.breitbart.com/politics/2026/01/20/second-lady-usha-vance-reveals-shes-expecting-fourth-child-due-july-2026/",
    "timestamp": "2026-01-20T22:00:00Z"
  },
  {
    "title": "Trump rips 'crooked' Ilhan Omar as House ramps up investigation into exploding net worth",
    "description": "President Trump blasted Minnesota fraud allegations and then slammed Rep. Ilhan Omar's, D-Minn., as her net worth skyrockets in just a single year while serving in Congress.",
    "link": "https://www.foxnews.com/politics/trump-rips-crooked-ilhan-omar-house-ramps-investigation-exploding-net-worth",
    "timestamp": "2026-01-20T21:59:22Z"
  },
  {
    "title": "Justice Department Subpoenas Walz And Others In Immigration Enforcement Obstruction Investigation",
    "description": "Federal prosecutors have served six grand jury subpoenas to Minnesota officials as part of an investigation into whether they obstructed or impeded federal law enforcement during a sweeping immigration operation in Minneapolis-St. Paul area.",
    "link": "https://www.huffpost.com/entry/ap-us-immigration-enforcement-walz-subpoena-minnesota_n_696ffa06e4b02ee48dde4d23",
    "timestamp": "2026-01-20T21:58:17Z"
  },
  {
    "title": "Atlantic Mag Attempts to Link Fringe Weirdo 'Looksmaxxing' to Trump Supporters",
    "description": "\"There's more to life than being really, really, really ridiculously good looking.\" ---Derek ZoolanderSo how far has the quality of writing at Atlantic magazine declined due to their TDS having become so overwhelming that they will stoop to any low in a pathe…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363170/posts",
    "timestamp": "2026-01-20T21:58:01Z"
  },
  {
    "title": "Trump says criminal illegal aliens ‘make Hells Angels look like the sweetest people on Earth’",
    "description": "Trump claims criminal illegal immigrants 'make Hells Angels look like sweetest people' as he touts reverse migration from enhanced border enforcement operations.",
    "link": "https://www.foxnews.com/politics/trump-criminal-illegal-aliens-make-hells-angels-look-like-sweetest-people-earth",
    "timestamp": "2026-01-20T21:56:15Z"
  },
  {
    "title": "Global tourism hit new record level in 2025 despite weak U.S. results: U.N.",
    "description": "Global tourism hit a new record level in 2025 despite a dip in arrivals in North America due to &quot;weak results&quot; in the United States, U.N. Tourism said Tuesday. The number of international tourist arrivals recorded worldwide hit 1.52 billion in 2025,…",
    "link": "https://japantoday.com/category/features/travel/global-tourism-hit-new-record-level-in-2025-despite-%27weak%27-us-results-un",
    "timestamp": "2026-01-20T21:55:29Z"
  },
  {
    "title": "A Brief History of the Enduring American Embargo against Cuba",
    "description": "In recent years, Cubans have been forced to endure one of their worst shortages of basic necessities, such as food, medical supplies, and fuel. The fuel shortage has been particularly devastating, as it causes regular power outages, which makes it …\nThe post …",
    "link": "https://www.globalresearch.ca/brief-history-enduring-american-embargo-cuba/5912684",
    "timestamp": "2026-01-20T21:54:08Z"
  },
  {
    "title": "Mexico sends 37 cartel members to U.S. in latest offer to Trump administration",
    "description": "Mexico's security minister said Tuesday that it had sent another 37 members of Mexican drug cartels to the United States, as the Trump administration ratchets up pressure on governments to crack down on criminal networks it says are smuggling drugs across the…",
    "link": "https://japantoday.com/category/world/mexico-sends-37-cartel-members-to-us-in-latest-offer-to-trump-administration",
    "timestamp": "2026-01-20T21:52:22Z"
  },
  {
    "title": "Venezuela calls for 'symbolic' social media action after Trump post",
    "description": "Venezuela's government on Tuesday called on citizens to post its official map on social media as a &quot;symbolic action&quot; after U.S. ‌President Donald Trump posted an altered image showing U.S. flags over Venezuela, as well as Canada and Greenland. The i…",
    "link": "https://japantoday.com/category/world/venezuela-calls-for-%27symbolic%27-social-media-action-after-trump-post1",
    "timestamp": "2026-01-20T21:52:16Z"
  },
  {
    "title": "Iran warns Trump not to take action against Khamenei",
    "description": "Iran on Tuesday warned Donald Trump not to take any action against the country’s Supreme Leader Ayatollah Ali Khamenei, days after the U.S. president called for an end to Khamenei’s nearly 40-year reign. “Trump knows that if any hand of aggression is extended…",
    "link": "https://japantoday.com/category/world/spokesman-for-iran%27s-armed-forces-warns-trump-against-taking-action-against-khamenei",
    "timestamp": "2026-01-20T21:52:10Z"
  },
  {
    "title": "Justice Department subpoenas Walz and others in immigration enforcement obstruction investigation",
    "description": "Federal prosecutors served six grand jury subpoenas Tuesday to Minnesota officials as part of an investigation into whether they obstructed or impeded federal law enforcement during a sweeping immigration operation in Minneapolis-St. Paul area, a person famil…",
    "link": "https://japantoday.com/category/world/trump-administration-urges-judge-to-reject-minnesota%27s-attempt-to-stop-its-immigration-crackdown",
    "timestamp": "2026-01-20T21:52:05Z"
  },
  {
    "title": "ICE crackdown creates double-edged campaign issue for Republicans and Democrats",
    "description": "President Donald Trump's immigration crackdown is fast becoming a double-edged campaign issue in November's hotly contested midterm congressional elections because of mounting public unease over aggressive tactics by federal immigration officers. After an ICE…",
    "link": "https://japantoday.com/category/world/ice-crackdown-creates-double-edged-campaign-issue-for-republicans-and-democrats",
    "timestamp": "2026-01-20T21:51:40Z"
  },
  {
    "title": "Trump and Putin envoys say Davos meting on Ukraine was 'very positive' and 'constructive'",
    "description": "Envoys for U.S. President Donald Trump and Russian President Vladimir Putin said on Tuesday that their meeting in Davos on a possible ‌future peace deal to end the Ukraine war had been &quot;very positive&quot; and &quot;constructive&quot;. The United States …",
    "link": "https://japantoday.com/category/world/trump-and-putin-envoys-say-davos-meting-on-ukraine-was-%27very-positive%27-and-%27constructive%27",
    "timestamp": "2026-01-20T21:51:33Z"
  },
  {
    "title": "Russia's top diplomat says NATO faces a deep crisis over Greenland",
    "description": "The bid by U.S. President Donald Trump to take over Greenland heralds a “deep crisis” for NATO and raises questions about the alliance's preservation as a single military-political bloc, Russia's top diplomat said Tuesday.  “It was hard to imagine before that…",
    "link": "https://japantoday.com/category/world/russia%27s-top-diplomat-says-nato-faces-a-deep-crisis-over-greenland",
    "timestamp": "2026-01-20T21:51:22Z"
  },
  {
    "title": "Trump unloads on allies as Davos showdown looms",
    "description": "U.S. President Donald Trump has made an astonishing series of attacks apparently designed to humiliate allies France, Britain and Canada as the row over Greenland threatens to engulf the Davos forum. In a flurry of Truth Social posts and comments to reporters…",
    "link": "https://japantoday.com/category/world/trump-unloads-on-allies-as-davos-showdown-looms",
    "timestamp": "2026-01-20T21:50:59Z"
  },
  {
    "title": "Europe's leaders stand firm in Davos as CEOs warn on emotions",
    "description": "European leaders, rattled by Donald Trump's latest global gambit, are looking to present a united front in Davos, as CEOs warned against an emotional response to the U.S. president's ambition to take over Greenland. French President Emmanuel ‌Macron said the …",
    "link": "https://japantoday.com/category/world/europe%27s-leaders-stand-firm-in-davos-as-ceos-warn-on-emotions1",
    "timestamp": "2026-01-20T21:50:51Z"
  },
  {
    "title": "Trump doubts Greenland threats will spoil trade deal with Europe",
    "description": "Donald Trump expressed confidence that the European Union would continue to invest in the U.S. even if he imposed new tariffs. Read on",
    "link": "https://financialpost.com/news/trump-doubts-greenland-threats-spoil-trade-deal-europe",
    "timestamp": "2026-01-20T21:50:15Z"
  },
  {
    "title": "China meets initial soybean purchase goal, but Trump's shifting trade policy could disrupt deal",
    "description": "China has fulfilled its initial commitment to buy 12 million metric tons of soybeans from the U.S., but it's not clear if the trade agreement announced in October can withstand President Donald Trump's ever-shifting trade policy as American farmers are still …",
    "link": "https://japantoday.com/category/business/china-meets-initial-soybean-purchase-goal-but-trump%27s-shifting-trade-policy-could-disrupt-deal",
    "timestamp": "2026-01-20T21:49:44Z"
  },
  {
    "title": "Hochul’s $260 billion budget proposal includes no new taxes, increased spending on kids",
    "description": "Governor Hochul delivers remarks at the National Action Network Dr. Martin Luther King, Jr. Day Public Policy Forum.\n \n\nA strong year on Wall Street is helping net the state more than $10 billion in unexpected revenue. [ more › ]",
    "link": "https://gothamist.com/news/hochuls-260-billion-budget-proposal-includes-no-new-taxes-increased-spending-on-kids",
    "timestamp": "2026-01-20T21:47:00Z"
  },
  {
    "title": "Unprepared Trump looked 'angry' during speech as world pans his grievances: CNN reporter",
    "description": "President Donald Trump appeared unprepared and angry when he spoke at the White House podium during Tuesday's press briefing, according to one CNN reporter. Trump spoke for about 80 minutes at the briefing before taking questions from the press. His speech me…",
    "link": "https://www.rawstory.com/trump-2674914201/",
    "timestamp": "2026-01-20T21:46:53Z"
  },
  {
    "title": "WATCH: Election Denier Who Trump Tried to Pardon Caught On Camera in Prison Fight",
    "description": "Tina Peters was caught by prison security cameras getting into an altercation with another inmate; she is currently in prison for election tampering\nThe post WATCH: Election Denier Who Trump Tried to Pardon Caught On Camera in Prison Fight first appeared on M…",
    "link": "https://www.mediaite.com/politics/watch-election-denier-who-trump-tried-to-pardon-caught-on-camera-in-prison-fight/",
    "timestamp": "2026-01-20T21:46:26Z"
  },
  {
    "title": "Bitcoin enters Delaware Life’s retirement annuity portfolio",
    "description": "Delaware Life said it added a BlackRock index with Bitcoin exposure, using the iShares Bitcoin Trust ETF, issued by BlackRock, to its fixed indexed annuity lineup.",
    "link": "https://cointelegraph.com/news/bitcoin-delaware-life-retirement-annuity-portfolio",
    "timestamp": "2026-01-20T21:45:56Z"
  },
  {
    "title": "Lehigh County says it's evicting ICE agents from Allentown office",
    "description": "Lehigh County Executive Josh Siegel’s announcement to evict the ICE office came shortly after the county’s financial watchdog said the agency owes more than $115,000 in rent.",
    "link": "https://www.mcall.com/2026/01/20/lehigh-county-josh-siegel-evicting-ice-allentown-office/",
    "timestamp": "2026-01-20T21:45:29Z"
  },
  {
    "title": "The Charter of the Board of Peace",
    "description": "The Times of Israel published the text of the Charter of the Board of Peace. As I suspected, this is…\nThe post The Charter of the Board of Peace appeared first on Reason.com.",
    "link": "https://reason.com/volokh/2026/01/20/the-charter-of-the-board-of-peace/",
    "timestamp": "2026-01-20T21:45:07Z"
  },
  {
    "title": "Danish pension fund to sell $100 million in Treasurys, citing 'poor' U.S. government finances (Alex Harring/CNBC)",
    "description": "Alex Harring / CNBC:\nDanish pension fund to sell $100 million in Treasurys, citing ‘poor’ U.S. government finances … Danish pension operator AkademikerPension said it is exiting U.S. Treasurys because of finance concerns as Denmark spars with President Donald…",
    "link": "https://www.memeorandum.com/260120/p100",
    "timestamp": "2026-01-20T21:45:00Z"
  },
  {
    "title": "Trump Tariff Threat Over Greenland Called 'Crazy' & A 'Mistake'— Here's How They Could Impact You",
    "description": "Over the weekend, President Donald Trump proposed tariffs on eight NATO countries who have backed Greenland amid his push to acquire the territory.",
    "link": "https://www.forbes.com/sites/forbestv/2026/01/20/trump-tariff-threat-over-greenland-called-crazy--a-mistake--heres-how-they-could-impact-you/",
    "timestamp": "2026-01-20T21:44:47Z"
  },
  {
    "title": "Takaichi invited to join Trump's controversial Gaza 'Board of Peace'",
    "description": "Japanese Prime Minister Sanae Takaichi has been invited by U.S. President Donald Trump to join a new international body he has proposed to oversee the reconstruction of Gaza, the Foreign Ministry said Tuesday. Takaichi is considering whether to take part in T…",
    "link": "https://japantoday.com/category/politics/japan-pm-takaichi-invited-to-join-trump%27s-controversial-gaza-peace-panel",
    "timestamp": "2026-01-20T21:44:01Z"
  },
  {
    "title": "US stocks sink as Trump threatens tariffs on 8 NATO members",
    "description": "US stocks sink as Trump threatens tariffs on 8 NATO membersnikkei.com",
    "link": "https://asia.nikkei.com/business/markets/equities/us-stocks-sink-as-trump-threatens-tariffs-on-8-nato-members",
    "timestamp": "2026-01-20T21:42:16Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "The Secretary-General condemns in the strongest terms the Israeli authorities’ actions to demolish the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) Sheikh Jarrah compound, urging them to immediately cease the demoliti…",
    "link": "https://press.un.org/en/2026/db260120.doc.htm",
    "timestamp": "2026-01-20T21:41:31Z"
  },
  {
    "title": "Hope Is Not a Policy for Iran",
    "description": "Washington’s record of failed intervention offers an obvious lesson. Trump should heed it.",
    "link": "http://foreignpolicy.com/2026/01/20/trump-iran-syria-iraq-libya-venezuela-intervention/",
    "timestamp": "2026-01-20T21:40:09Z"
  },
  {
    "title": "Trump shared edited photo featuring map with Venezuela, Canada and Greenland covered by US flag",
    "description": "In January 2026, U.S. President Donald Trump shared a photograph of a map with Venezuela, Canada and Greenland covered with the U.S. flag on his Truth Social account.",
    "link": "https://www.snopes.com//fact-check/trump-venezuela-canada-greenland-map/",
    "timestamp": "2026-01-20T21:40:00Z"
  },
  {
    "title": "‘Very Low Energy’: CNN Anchors Marvel At Trump’s Odd Beginning to Lengthy WH Briefing",
    "description": "\"We noticed it right away—it was very low energy in the beginning, sort of reading, sort of doing a weave,” noted Erica Hill\nThe post ‘Very Low Energy’: CNN Anchors Marvel At Trump’s Odd Beginning to Lengthy WH Briefing first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/very-low-energy-cnn-anchors-marvel-at-trumps-odd-beginning-to-lengthy-wh-briefing/",
    "timestamp": "2026-01-20T21:39:27Z"
  },
  {
    "title": "Trump calls out Supreme Court justices after trans athlete hearing: 'Should lose a lot of credibility'",
    "description": "President Donald Trump said Supreme Court justices supporting transgender athletes in women's sports should 'lose credibility' and calls the issue unfair to women.",
    "link": "https://www.foxnews.com/sports/trump-calls-out-supreme-court-justices-after-trans-athlete-hearing-should-lose-lot-credibility",
    "timestamp": "2026-01-20T21:37:48Z"
  },
  {
    "title": "'You'll find out,' Trump says on Greenland takeover strategy",
    "description": "Trump will be meeting with world leaders at the World Economic Forum in Davos, Switzerland later this week.",
    "link": "https://www.cnbc.com/2026/01/20/trump-greenland-takeover-strategy.html",
    "timestamp": "2026-01-20T21:36:26Z"
  },
  {
    "title": "Trump added $2.25 trillion to the national debt in his first year back in charge, watchdog says",
    "description": "The Peter G. Peterson Foundation, a nonpartisan budget watchdog, ran the numbers exclusively for Fortune.",
    "link": "https://fortune.com/2026/01/20/how-much-national-debt-grew-trump-first-year-back-in-office-president/",
    "timestamp": "2026-01-20T21:36:17Z"
  },
  {
    "title": "WATCH: President Trump on Greenland's self-determination",
    "description": "ABC News' Mary Bruce asked President Donald Trump \"what gives the U.S. the right\" to take away the self-determination of Greenlanders who've said they don't want to be part of the U.S.?",
    "link": "https://abcnews.go.com/US/video/president-trump-greenlands-determination-129396881",
    "timestamp": "2026-01-20T21:35:59Z"
  },
  {
    "title": "What’s behind Trump’s push to control Greenland?",
    "description": "As Trump escalates threats to seize Greenland, Inuit Greenlanders reject being treated as geopolitical pawns.",
    "link": "https://www.aljazeera.com/video/the-take-2/2026/1/20/aje-onl-grl_greenlandtakeover_av_v3-200126",
    "timestamp": "2026-01-20T21:35:20Z"
  },
  {
    "title": "Europe’s 'appeasement' strategy with Trump has failed. So what comes next?",
    "description": "On Tuesday, U.S. President Donald Trump accused British Prime Minister Keir Starmer of an act of “great stupidity” for returning an island to Mauritius that houses an important military base. The episode shows how fast Trump can turn on international partners…",
    "link": "https://www.cbc.ca/news/world/trump-eu-greenland-starmer-9.7053146",
    "timestamp": "2026-01-20T21:33:10Z"
  },
  {
    "title": "“That’s Why His Face Is Droopy”: Trump Tries To Shut Down Health Speculation As Doctor Raises Concerns",
    "description": "“Earlier in 2025, he was garbling words,” the doctor said.",
    "link": "https://www.boredpanda.com/donald-trump-shuts-down-health-speculations-doctor-raise-concerns/",
    "timestamp": "2026-01-20T21:32:39Z"
  },
  {
    "title": "Canada Rags On America At Globalist Meetup After Shaking Hands With China",
    "description": "Canadian Prime Minister Mark declared that the global order is experiencing a “rupture” as President Trump continues to push for U.S. control over Greenland.",
    "link": "https://dailycaller.com/2026/01/20/canada-rags-on-america-at-globalist-meetup-after-shaking-hands-with-china/",
    "timestamp": "2026-01-20T21:32:27Z"
  },
  {
    "title": "Trump says he hopes Renee Good's father is still a 'Trump fan' following Minneapolis 'tragedy'",
    "description": "President Donald Trump says he hopes Renee Good's father remains a supporter after the woman died in an ICE shooting in Minneapolis Jan. 7, calling the incident a tragedy.",
    "link": "https://www.foxnews.com/politics/trump-says-he-hopes-renee-goods-father-still-trump-fan-following-minneapolis-tragedy",
    "timestamp": "2026-01-20T21:32:01Z"
  },
  {
    "title": "Trump refuses to say how far he'll go on Greenland",
    "description": "US President Donald Trump has refused to say how far he will go on Greenland, but suggested that he could make a deal as European leaders voice alarm over his threats to seize the territory from ally Denmark.",
    "link": "https://www.rte.ie/news/us/2026/0120/1554189-trump-one-year/",
    "timestamp": "2026-01-20T21:30:49Z"
  },
  {
    "title": "Thousands protest against Trump immigration policies",
    "description": "By Andrew HayJan 20 (Reuters) - Thousands of U.S. workers and students marched through cities and university campuses on Tuesday in opposition to the immigration policies… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/thousands-protest-against-trump-immigration-policies",
    "timestamp": "2026-01-20T21:30:02Z"
  }
]