[
  {
    "title": "Trump chides Tony Dokoupil during CBS interview, says anchor 'wouldn't have this job' if he lost 2024 election",
    "description": "During an interview on \"CBS Evening News,\" President Donald Trump teased anchor Tony Dokoupil that he \"wouldn't have this job\" if he didn't win the 2024 election.",
    "link": "https://www.foxnews.com/media/trump-chides-tony-dokoupil-during-cbs-interview-says-anchor-wouldnt-have-job-he-lost-2024-election",
    "timestamp": "2026-01-14T12:46:25Z"
  },
  {
    "title": "Trump says US control of Greenland 'vital' for air defense",
    "description": "President Donald Trump said Wednesday that U.S. control of Greenland was \"vital\" for his planned Golden Dome air and missile defense system.",
    "link": "https://www.hurriyetdailynews.com/trump-says-us-control-of-greenland-vital-for-air-defense-217833",
    "timestamp": "2026-01-14T12:45:41Z"
  },
  {
    "title": "Wednesday: Hili dialogue",
    "description": "Welcome to a Hump Day (“Te Rā o te Puku” in Māori), Wednesday, January 14, 2026, and National Hot Pastrami Sandwich Day, celebrating another great contribution of America (and Jews) to world cuisine.  Below is a huge sandwich from Harold’s Deli in Edison, New…",
    "link": "https://whyevolutionistrue.com/2026/01/14/wednesday-hili-dialogue-564/",
    "timestamp": "2026-01-14T12:45:32Z"
  },
  {
    "title": "Trump restates desire to take over Greenland, as poll reveals what Americans think",
    "description": "Donald Trump has again restated his desire to acquire Greenland for the US \"for purpose of national security\", saying anything less is \"unacceptable\", even as a poll found less than a fifth of Americans support the idea.",
    "link": "https://news.sky.com/story/trump-restates-desire-to-take-over-greenland-as-poll-finds-most-americans-are-against-it-13494203",
    "timestamp": "2026-01-14T12:44:00Z"
  },
  {
    "title": "Geoeconomic confrontation world’s top threat, global leaders say",
    "description": "World Economic Forum survey says economic tools used as geopolitical weapons the most pressing risk to global stability.",
    "link": "https://www.aljazeera.com/news/2026/1/14/geoeconomic-confrontation-worlds-top-threat-global-leaders-say",
    "timestamp": "2026-01-14T12:43:17Z"
  },
  {
    "title": "Trump’s comments on Greenland to be taken seriously, French Prime Minister says",
    "description": "PARIS, Jan 14 (Reuters) - U.S President Donald Trump’s comments on Greenland should be taken seriously, French Prime Minister Sebastien Lecornu said on Wednesday in the l… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/trump-s-comments-on-greenland-to-be-taken-seriously-french-prime-minister-says",
    "timestamp": "2026-01-14T12:43:16Z"
  },
  {
    "title": "India needs dialogue with US over Iran sanctions threat – lawmaker",
    "description": "International law doesn’t recognize unilateral sanctions by individual countries, Indian MP Shashi Tharoor has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/india/630951-india-needs-dialogue-with-us/",
    "timestamp": "2026-01-14T12:42:46Z"
  },
  {
    "title": "‘US needs Greenland for purpose of national security’: Trump says anything less than US control ‘unacceptable’",
    "description": "The US president’s remark came just hours ahead of Denmark and Greenland leaders' talks with Vice President JD Vance and Secretary of State Marco Rubio at the White House on Wednesday.",
    "link": "https://indianexpress.com/article/world/trump-says-anything-less-than-us-control-of-greenland-unacceptable-10473513/",
    "timestamp": "2026-01-14T12:42:02Z"
  },
  {
    "title": "Factbox-Who are the Greenland and Denmark foreign ministers meeting Trump’s team?",
    "description": "By Stine Jacobsen and Anna RingstromCOPENHAGEN, Jan 14 (Reuters) - Greenland’s Foreign Minister Vivian Motzfeldt and her Danish counterpart Lars Lokke Rasmussen are meeti… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/factbox-who-are-the-greenland-and-denmark-foreign-ministers-meeting-trump-s-team",
    "timestamp": "2026-01-14T12:41:12Z"
  },
  {
    "title": "What Americans think about Trump’s intervention in Venezuela, according to a new AP-NORC poll",
    "description": "The poll shows Americans also overwhelmingly do not want the U.S. to take “a more active role” in solving the world’s problems.",
    "link": "https://www.bostonherald.com/2026/01/14/americans-poll-trump-venezuela-intervention/",
    "timestamp": "2026-01-14T12:41:01Z"
  },
  {
    "title": "Whether or not US acquires Greenland, the island will be at the centre of a massive military build-up in the Arctic",
    "description": "US wound down its presence in Greenland at the end of the cold war. Now it wants to beef it up again.",
    "link": "https://theconversation.com/whether-or-not-us-acquires-greenland-the-island-will-be-at-the-centre-of-a-massive-military-build-up-in-the-arctic-273301",
    "timestamp": "2026-01-14T12:39:05Z"
  },
  {
    "title": "Donald in the Dark: Trump Sends Out Bizarre Email as He 'Sits Alone in the War Room With One Dying Laptop' Amid Mounting Health Concerns",
    "description": "Donald in the Dark: Trump Sends Out Bizarre Email as He 'Sits Alone in the War Room With One Dying Laptop' Amid Mounting Health Concernsnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4440834054298-donald-in-the-dark-trump-sends-out-bizarre-email-as-he-sits-alone-in-the-war-room-with-one-dying-laptop-amid-mounting-health-concerns?_f=app_share&amp;pd=0EV7oQ8m&amp;lang=en_US&amp;send_time=1768394220&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.1.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-14T12:37:55Z"
  },
  {
    "title": "Trump Touts 'Economic Boom' as Consumer Prices Rise Sharply",
    "description": "Nearly a full year into his second term, President Donald Trump declared a victory when it comes to the U.S. economy saying “the Trump economic boom has officially begun.” It comes as new government data shows inflation rose 2.7% in December compared to a yea…",
    "link": "https://www.today.com/video/trump-claims-inflations-is-defeated-amid-2-7-percent-hike-255934021952",
    "timestamp": "2026-01-14T12:35:51Z"
  },
  {
    "title": "Donald Trump shouted obscenities & flipped off a United Auto Worker in Detroit",
    "description": "Yesterday, Donald Trump traveled to Detroit, Michigan to make yet another unhinged speech. Before his speech, Trump toured the Ford factory. Which is where TJ Sabula, a 40-year-old UAW line worker, shouted “p3dophile protector” at Trump. Trump heard him too, …",
    "link": "https://www.celebitchy.com/957145/donald_trump_shouted_obscenities_flipped_off_a_united_auto_worker_in_detroit/",
    "timestamp": "2026-01-14T12:35:44Z"
  },
  {
    "title": "What are Trump’s military options for an attack on Iran?",
    "description": "Trump told Iranian protesters that 'help is on its way' in a Truth Social post.",
    "link": "https://www.aljazeera.com/news/2026/1/14/what-are-trumps-military-options-for-an-attack-on-iran",
    "timestamp": "2026-01-14T12:35:11Z"
  },
  {
    "title": "Trump says anything less than having Greenland in the United States’ hands is ‘unacceptable’",
    "description": "Trump argues that NATO should support the U.S. in acquiring Greenland to prevent Russian or Chinese influence.",
    "link": "https://www.bostonherald.com/2026/01/14/trump-demands-greenland-nato-support/",
    "timestamp": "2026-01-14T12:30:43Z"
  },
  {
    "title": "Matters To Consider for the 2026 Annual Meeting and Reporting Season: Disclosure Developments",
    "description": "Consider Trends in SEC Filing Reviews The Staff of the Division of Corporation Finance (Staff) of the Securities and Exchange Commission (SEC) continues to review public company disclosures. Based on a recent survey, during the 12-month period ended June 30, …",
    "link": "https://corpgov.law.harvard.edu/2026/01/14/matters-to-consider-for-the-2026-annual-meeting-and-reporting-season-disclosure-developments/",
    "timestamp": "2026-01-14T12:30:34Z"
  },
  {
    "title": "Liberal journalist claims ICE accepted her recruitment application without proper vetting",
    "description": "A liberal journalist says ICE accepted her recruitment application despite being an outspoken critic of the Trump administration and not sending proper paperwork.",
    "link": "https://www.foxnews.com/media/liberal-journalist-claims-ice-accepted-her-recruitment-application-without-proper-vetting",
    "timestamp": "2026-01-14T12:30:03Z"
  },
  {
    "title": "Why Trump's options on Iran are narrowing (Politico)",
    "description": "Politico:\nWhy Trump's options on Iran are narrowing  —  Good Wednesday morning.  This is Jack Blanchard.  Get in touch.  —  FIRST IN PLAYBOOK: “Trump has no plans to endorse in final 3 Senate races,” by POLITICO's Sophia Cai and Alex Gangitano.  “There are th…",
    "link": "https://www.memeorandum.com/260114/p8",
    "timestamp": "2026-01-14T12:30:00Z"
  },
  {
    "title": "The Evangelicals Who Think Iran’s Protests Mean Jesus Is Returning",
    "description": "In Iran, millions of protesters have taken to the streets to protest the repressive religious regime that has ruled the country for more than four decades. The response of the government, led by Ayatollah Ali Khamenei, has been swift and brutal, with thousand…",
    "link": "https://www.motherjones.com/politics/2026/01/the-evangelicals-who-think-irans-protests-mean-jesus-is-returning/",
    "timestamp": "2026-01-14T12:30:00Z"
  },
  {
    "title": "Silver prices could skyrocket to Rs 4 lakh? SAMCO makes bold prediction! Here’s what technicals indicate",
    "description": "SAMCO Securities forecasts silver prices could surge to Rs 3.94 lakh per kg after a 25% rise in 2026, citing technical breakouts, supportive inflation data, easing rate hopes and tight global supply amid a broader commodity supercycle momentum continues stron…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/silver-prices-could-skyrocket-to-rs-4-lakh-samco-makes-bold-prediction-heres-what-technicals-indicate/articleshow/126526895.cms",
    "timestamp": "2026-01-14T12:26:46Z"
  },
  {
    "title": "Kenya wins three-year AGOA extension, securing jobs",
    "description": "US extends African Growth and Opportunity Act (AGOA) for another three years, Trade CS Kinyanjui confirms, says plans underway to expand Kenya’s export basket.",
    "link": "https://www.standardmedia.co.ke/business/business/article/2001538502/kenya-wins-three-year-agoa-extension-securing-jobs",
    "timestamp": "2026-01-14T12:26:08Z"
  },
  {
    "title": "Tenerife airport horror: Elderly man tries to board flight with deceased wife; what really happened?",
    "description": "An unsettling incident at Tenerife South Airport is under investigation after an 80-year-old man was stopped while attempting to board a flight with his deceased wife seated in a wheelchair. Airport staff only raised concerns after security checks were comple…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/tenerife-airport-horror-elderly-man-tries-to-board-flight-with-deceased-wife-what-really-happened/articleshow/126525161.cms",
    "timestamp": "2026-01-14T12:24:18Z"
  },
  {
    "title": "Trump is playing 'mutually assured destruction' in face-off with GOP lawmakers: report",
    "description": "Donald Trump is playing a game of chicken with three Republican senators seeking re-election in November, withholding endorsements while avoiding direct opposition to preserve Senate control, according to new reporting.According to Politico reporters Sophia C…",
    "link": "https://www.rawstory.com/trump-senate-endorsements/",
    "timestamp": "2026-01-14T12:23:13Z"
  },
  {
    "title": "Kamala Harris makes book tour stop, gives shout out to Helena Moreno in New Orleans event",
    "description": "Former Vice President Kamala Harris told stories of growing up with an immigrant mother who taught her to dream big and fight injustice, to a packed house at the Saenger Theater in New Orleans Tuesday night.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/former-vp-kamala-harris-promotes-her-new-book-in-new-orleans/article_0699b360-edce-5573-9acf-8df1998c7740.html",
    "timestamp": "2026-01-14T12:23:00Z"
  },
  {
    "title": "Witkoff and Kushner Seek to Visit Moscow for Putin Meeting",
    "description": "Steve Witkoff and Jared Kushner are seeking to travel to Moscow to meet with Russian President Vladimir Putin in the near future, as Donald Trump’s envoys work to advance a peace agreement to end Russia’s war against Ukraine, according to people familiar with…",
    "link": "https://financialpost.com/pmn/business-pmn/witkoff-and-kushner-seek-to-visit-moscow-for-putin-meeting",
    "timestamp": "2026-01-14T12:19:57Z"
  },
  {
    "title": "I want to be a bridge between the traditionalist and the contemporary: Radhika Shurajit",
    "description": "\\\"I am a dreamer,\\\" says Kalaimamani Radhika Shurajit during an interaction with us. With Margazhi coming to an end, we ask the Bharatanatyam exponent a.",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/music/i-want-to-be-a-bridge-between-the-traditionalist-and-the-contemporary-radhika-shurajit/articleshow/126526423.cms",
    "timestamp": "2026-01-14T12:16:43Z"
  },
  {
    "title": "NATO would be 'more formidable' with US control of Greenland, Trump says",
    "description": "Jan 14 (Reuters) - ‌U.S. President Donald Trump said anything ‌less than Greenland \"in the hands\" ‌of the United States was \"unacceptable\", reiterating his demand for control of the Danish territory just ‍hours ahead of a ‍White House meeting ‌on the issue. R…",
    "link": "https://www.thestar.com.my/news/world/2026/01/14/nato-would-be-039more-formidable039-with-us-control-of-greenland-trump-says",
    "timestamp": "2026-01-14T12:15:00Z"
  },
  {
    "title": "EU assembly weighs freezing US trade deal over Trump’s Greenland threats",
    "description": "By Philip BlenkinsopBRUSSELS, Jan 14 (Reuters) - The European Parliament is considering putting on hold the European Union’s implementation of the trade deal struck with … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/eu-assembly-weighs-freezing-us-trade-deal-over-trump-s-greenland-threats",
    "timestamp": "2026-01-14T12:13:01Z"
  },
  {
    "title": "Trump envoy not welcome at Greenland dog sled race – organizers",
    "description": "Organizers of a Greenland dog sled race are probing who invited US envoy Jeff Landry to the event Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630946-greenland-trump-envoy-dog-sleds/",
    "timestamp": "2026-01-14T12:10:53Z"
  },
  {
    "title": "Executives' favorite explanation for spending big on AI: FOMO",
    "description": "If you're wondering whether JPMorgan's tech spend is paying off, here's Jamie Dimon's answer: \"Trust me.\"",
    "link": "https://www.businessinsider.com/bi-today-newsletter-jamie-dimon-jpmorgan-trump-2026-1",
    "timestamp": "2026-01-14T12:10:52Z"
  },
  {
    "title": "Macron on Greenland: If sovereignty of an ally is affected, knock-on effects would be unprecedented",
    "description": "PARIS, Jan 14 (Reuters) - ‌If the sovereignty of a European country ‌and ally was affected, the knock-on ‌effects would be unprecedented, French President Emmanuel Macron said on Wednesday during a cabinet meeting, referring to the U.S. ‍President Donald Trum…",
    "link": "https://www.thestar.com.my/news/world/2026/01/14/macron-on-greenland-if-sovereignty-of-an-ally-is-affected-knock-on-effects-would-be-unprecedented",
    "timestamp": "2026-01-14T12:07:00Z"
  },
  {
    "title": "Iranians arrive in Turkey through border gate as crackdown persists",
    "description": "By Ismet MikailogullariKAPIKOY, Turkey, Jan 14 (Reuters) - Dozens of Iranians crossed the border into Turkey on Wednesday, as authorities in Iran crack down on one of the… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/iranians-arrive-in-turkey-through-border-gate-as-crackdown-persists",
    "timestamp": "2026-01-14T12:06:14Z"
  },
  {
    "title": "'Anything less is unacceptable': Trump hurls explicit demand for Greenland takeover",
    "description": "President Donald Trump demanded Wednesday that Greenland be put “in the hand of the United States” in a fiery social media post\r\n, declaring the the United States “needs” the arctic island for national security.“The United States needs Greenland for the purpo…",
    "link": "https://www.rawstory.com/greenland-2674891486/",
    "timestamp": "2026-01-14T12:05:49Z"
  },
  {
    "title": "Even RFK Jr. Unsure How Trump Is Still Alive While Enjoying Road Diet of Junk Food and Diet Coke: ‘Pumping Himself Full of Poison’",
    "description": "Robert Kennedy Jr. trashed Trump’s appetite for McDonald’s, candy, and Diet Coke as he boasted the president had the \"constitution of a deity.\"\nThe post Even RFK Jr. Unsure How Trump Is Still Alive While Enjoying Road Diet of Junk Food and Diet Coke: ‘Pumping…",
    "link": "https://www.mediaite.com/media/news/even-rfk-jr-unsure-how-trump-is-still-alive-while-enjoying-road-diet-of-junk-food-and-diet-coke-pumping-himself-full-of-poison/",
    "timestamp": "2026-01-14T12:04:28Z"
  },
  {
    "title": "Greenland's hefty price tag and Israeli officials warn against Iran strikes: Morning Rundown",
    "description": "In today’s newsletter: Trump’s efforts to purchase Greenland could cost as much as $700 billion, experts estimate.",
    "link": "https://www.nbcnews.com/news/us-news/greenlands-hefty-price-tag-israeli-officials-warn-iran-strikes-morning-rcna253947",
    "timestamp": "2026-01-14T12:03:54Z"
  },
  {
    "title": "Supreme Court tariff ruling: It's not just about refunds. Volume of U.S. freight trade could hinge on decision",
    "description": "Logistics experts tell CNBC that freight shipping container trade could see a bump if the Supreme Court rules President Trump's IEEPA tariffs are illegal.",
    "link": "https://www.cnbc.com/2026/01/14/supreme-court-trump-tariffs-decision.html",
    "timestamp": "2026-01-14T12:02:04Z"
  },
  {
    "title": "Polis should keep Tina Peters behind bars and use her as a bargaining chip (Letters)",
    "description": "\"It’s a win-win situation with Trump getting Peters pardoned and Polis getting all federal government funding restored to make Colorado great again.\" -- Michael May, Lakewood",
    "link": "https://www.denverpost.com/2026/01/14/tina-peters-bargaining-chip-polis-trump/",
    "timestamp": "2026-01-14T12:01:59Z"
  },
  {
    "title": "Exclusive: Sarah Huckabee Sanders Is First Sitting Governor to Endorse Byron Donalds for Florida Governor",
    "description": "Arkansas Gov. Sarah Huckabee Sanders has officially endorsed U.S. Rep. Byron Donalds in Florida’s 2026 gubernatorial race, becoming the first sitting governor to back the Naples Republican.\nThe post Exclusive: Sarah Huckabee Sanders Is First Sitting Governor …",
    "link": "https://www.breitbart.com/politics/2026/01/14/exclusive-sarah-huckabee-sanders-endorse-byron-donalds-fl-governor/",
    "timestamp": "2026-01-14T12:00:54Z"
  },
  {
    "title": "Trump’s Big Boast About His Venezuela Policy Misses The Mark",
    "description": "Amid the administration's claims to be solidifying America's influence in its neighborhood, Washington's shock moves may actually cede ground to Beijing.",
    "link": "https://www.huffpost.com/entry/trump-venezuela-china_n_6966f238e4b09c0a939c363d",
    "timestamp": "2026-01-14T12:00:17Z"
  },
  {
    "title": "Mortgage refinance demand surges 40% higher after Trump post briefly tanks interest rates",
    "description": "Mortgage rates dropped markedly at the end of last week, causing a huge jump in demand to refinance and a smaller surge in demand from home buyers.",
    "link": "https://www.cnbc.com/2026/01/14/mortgage-refinance-demand-surges-40percent-higher-.html",
    "timestamp": "2026-01-14T12:00:01Z"
  },
  {
    "title": "Renee Good Endangered Her Life and Yours",
    "description": "Americans who remember how an incident in Minneapolis six years ago plunged the whole country into a summer of rioting—then years of elevated criminal violence—should... Read More\nThe post Renee Good Endangered Her Life and Yours appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2026/01/14/renee-good-endangered-her-life-and-yours/",
    "timestamp": "2026-01-14T12:00:00Z"
  },
  {
    "title": "US Mortgage Rates Slide to One of the Lowest Levels Since 2022",
    "description": "The contract rate on a 30-year mortgage dropped 7 basis points to 6.18% in the week ended Jan. 9, according to Mortgage Bankers Association data released...",
    "link": "https://finance.yahoo.com/news/us-mortgage-rates-slide-one-120000072.html",
    "timestamp": "2026-01-14T12:00:00Z"
  },
  {
    "title": "How AI Companies Got Caught Up in US Military Efforts",
    "description": "Two years ago, companies like Meta and OpenAI were united against military use of their tools. Now all of that has changed.",
    "link": "https://www.wired.com/story/book-excerpt-silicon-empires-nick-srnicek/",
    "timestamp": "2026-01-14T12:00:00Z"
  },
  {
    "title": "Philadelphia sheriff Rochelle Bilal called ICE 'made-up, fake, wannabe law enforcement'",
    "description": "A Philadelphia sheriff called Immigration and Customs Enforcement \"made-up, fake, wannabe law enforcement” and warned agents, “You don’t want this smoke.”",
    "link": "https://www.snopes.com//fact-check/philadelphia-sheriff-ice/",
    "timestamp": "2026-01-14T12:00:00Z"
  },
  {
    "title": "Who are the exiled Iranian groups backing US intervention?",
    "description": "Exiled Iranian opposition groups are encouraging demonstrators to take over state institutions amid protests in Iran.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/14/who-are-the-exiled-iranian-groups-backing-us-intervention",
    "timestamp": "2026-01-14T11:58:11Z"
  },
  {
    "title": "Catching Divyabharathi’s Pongal pulse: A rooted Pongal of little joys",
    "description": "“Pongal, for me, is all about togetherness and gratitude. It’s that time of the year when the family comes together, and we get to celebrate the bless.",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/catching-divyabharathis-pongal-pulse-a-rooted-pongal-of-little-joys/articleshow/126526298.cms",
    "timestamp": "2026-01-14T11:57:40Z"
  },
  {
    "title": "Iran warns neighbours it could strike US bases if Washington intervenes in protests",
    "description": "Three diplomats said some personnel ⁠had been advised to leave the main U.S. air base in the region, although there were no immediate signs of a large-scale evacuation of troops as took place in the hours before an Iranian missile attack last year.",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-warns-neighbours-it-could-strike-us-bases-if-washington-intervenes-in-protests/articleshow/126526299.cms",
    "timestamp": "2026-01-14T11:57:10Z"
  },
  {
    "title": "Nigeria enlists US lobbyists to communicate Christian protection efforts",
    "description": "By MacDonald DzirutweLAGOS, Jan 14 - Nigeria has hired a U.S. lobbying firm to help maintain U.S. support and counter what it has called misinformation by Christian Evang… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/nigeria-enlists-us-lobbyists-to-communicate-christian-protection-efforts",
    "timestamp": "2026-01-14T11:56:10Z"
  },
  {
    "title": "Links 1/14/2026",
    "description": "Our piebald daily links: RIP Scott Adams, GLP-1 suicide warning removal? global warming = iron deficiency for sea mammals, China trade surplus grows, moar Greenland, Trump threatens Iran, US admin Nazi images? metals prices surge, ICE rampage, Sam Altman fadi…",
    "link": "https://www.nakedcapitalism.com/2026/01/links-1-14-2026.html",
    "timestamp": "2026-01-14T11:55:17Z"
  },
  {
    "title": "Greenland envy shows size matters to Trump",
    "description": "Island would be the largest territory ever added to the United States",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2026/01/13/world/europe/greenland-trump-size.html",
    "timestamp": "2026-01-14T11:52:05Z"
  },
  {
    "title": "Chinese customs told to block H200 imports, report claims — directive would effectively ban the Nvidia AI chip from China",
    "description": "Chinese customs officers were allegedly told to disallow the entry of Nvidia H200 chips, effectively banning the entry of these AI processors into the country. The command comes as other sources say that Beijing will only allow the import of these AI GPUs for…",
    "link": "https://www.tomshardware.com/tech-industry/chinese-customs-told-to-block-h200-imports-report-claims-directive-would-effectively-ban-the-nvidia-ai-chip-from-china",
    "timestamp": "2026-01-14T11:48:16Z"
  },
  {
    "title": "Resistance moms will save us",
    "description": "Renee Good's courage shows our single best hope lays with ordinary people",
    "link": "https://www.salon.com/2026/01/14/resistance-moms-will-save-us/",
    "timestamp": "2026-01-14T11:45:56Z"
  },
  {
    "title": "Trump threatens so-called sanctuary communities like Rhode Island and Boston",
    "description": "President Donald Trump said Tuesday that starting Feb. 1 he will deny federal funding to any states that are home to local governments resisting his administrat",
    "link": "https://turnto10.com/news/local/trump-threatens-so-called-sanctuary-communities-like-rhode-island-and-boston-department-of-justice-jan-14-2026",
    "timestamp": "2026-01-14T11:43:50Z"
  },
  {
    "title": "Schumer tells the AP Democrats are preparing for Trump to disrupt and dispute the midterms: Q&A",
    "description": "Senate Minority Leader Chuck Schumer says he expects Republican President Donald Trump to try to interfere with the midterm elections, and he says raids by...",
    "link": "https://www.yahoo.com/news/articles/schumer-tells-ap-democrats-preparing-113912649.html",
    "timestamp": "2026-01-14T11:39:12Z"
  },
  {
    "title": "When They're Not Applying Banned Chokeholds, ICE Agents Are Apparently Stealing and Selling Citizens' Phones",
    "description": "ICE agents seemingly believe they can get away with anything, even stealing and selling the phone of a 16-year-old citizen.",
    "link": "https://www.jezebel.com/ice-immigration-phone-theft-sold-arnoldo-bazan-houston-chokeholds-private-property",
    "timestamp": "2026-01-14T11:38:37Z"
  },
  {
    "title": "Fossil fuel phaseout urgent as 1.5°C target likely to be passed by 2030",
    "description": "A new report by the Copernicus Climate Change Service shows that 2025 was the third hottest year on record, marking the first time that a three-year period has exceeded the 1.5°C limit. Experts warn that based on the current rate of warming, the 1.5°C heating…",
    "link": "https://www.commondreams.org/newswire/fossil-fuel-phaseout-urgent-as-1-50c-target-likely-to-be-passed-by-2030",
    "timestamp": "2026-01-14T11:38:19Z"
  },
  {
    "title": "Trump’s Anti-Moral Morality",
    "description": "Donald Trump now claims that the only thing that will stop him from doing as he pleases on the world stage is his own morality. Whether the world accepts Trump’s reversion to the unbridled dominance of great powers will determine the course of international r…",
    "link": "https://www.project-syndicate.org/commentary/trump-might-makes-right-worldview-rules-out-moral-progress-by-peter-singer-2026-01",
    "timestamp": "2026-01-14T11:33:39Z"
  },
  {
    "title": "Trump Not Endorsing Three Senate GOP Incumbents",
    "description": "“There are three sitting Republican senators President Donald Trump has not endorsed for reelection. He has no imminent plans to change that,” Politico reports. “The strategy behind not endorsing in the three races is that Trump may still need their votes in …",
    "link": "https://politicalwire.com/2026/01/14/trump-not-endorsing-three-senate-gop-incumbents/",
    "timestamp": "2026-01-14T11:33:29Z"
  },
  {
    "title": "Golden Globes host says Trump jokes were scrapped",
    "description": "Comedian Nikki Glaser says she cut Trump jokes from her Golden Globes monologue, telling Howard Stern political humor wasn’t 'funny' in the current climate.",
    "link": "https://www.foxnews.com/media/golden-globes-host-says-trump-jokes-were-scrapped",
    "timestamp": "2026-01-14T11:30:11Z"
  },
  {
    "title": "Father of Renee Good's late husband does not blame ICE after seeing new perspective of shooting footage",
    "description": "The former father-in-law of Renee Good has revealed he does not blame ICE agent Jonathan Ross for shooting 37-year-old three times in the face.",
    "link": "https://www.ladbible.com/news/us-news/renee-good-ice-trump-family-former-father-law-683700-20260114",
    "timestamp": "2026-01-14T11:29:52Z"
  },
  {
    "title": "Türkiye engages with US, Iran to reduce tension",
    "description": "Ankara has reached out to Iran and the United States to reduce tensions between the two countries after the latter threatened to use force against Tehran should it continue to use disproportionate force and kill Iranian protestors.",
    "link": "https://www.hurriyetdailynews.com/turkiye-engages-with-us-iran-to-reduce-tension-217828",
    "timestamp": "2026-01-14T11:22:06Z"
  },
  {
    "title": "Transcript: Trump Tirades on Shooting Darken as ICE Polls Turn Brutal",
    "description": "The following is a lightly edited transcript of the January 14 episode of The Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. Donald Tr…",
    "link": "https://newrepublic.com/article/205260/transcript-trump-tirades-shooting-darken-ice-polls-turn-brutal",
    "timestamp": "2026-01-14T11:19:58Z"
  },
  {
    "title": "Trump Has A Very Unexpected Texting Buddy: Report",
    "description": "The pair exchanged unpleasantries before swapping numbers.",
    "link": "https://www.huffpost.com/entry/donald-trump-texting-buddy_n_69677177e4b0d5c7db78c0e4",
    "timestamp": "2026-01-14T11:13:46Z"
  },
  {
    "title": "Iran expected to execute 1st protester despite Trump warning of 'strong action'",
    "description": "Iranian authorities were on Wednesday expected to execute the first person in relation to the nationwide unrest that has rocked the country, according to the United States and human rights groups",
    "link": "https://www.nbcnews.com/world/iran/trump-iran-protest-execution-death-toll-crackdown-us-military-rcna253952",
    "timestamp": "2026-01-14T11:10:25Z"
  },
  {
    "title": "Japanese prime minister plans snap general election, party official says",
    "description": "Sanae Takaichi seeking to capitalise on a surge in public support since she came to office in October",
    "link": "https://www.irishtimes.com/world/asia-pacific/2026/01/14/japanese-prime-minister-plans-snap-general-election-party-official-says/",
    "timestamp": "2026-01-14T11:09:49Z"
  },
  {
    "title": "2025 est l'année la plus meurtrière pour les civils ukrainiens depuis le début de la guerre menée par la Russie (Anglais)",
    "description": "The total number of Ukrainian civilians killed or injured in 2025 was 31% higher than in 2024 and 70% higher than in 2023, according to the U.N. Human Rights Monitoring Mission in Ukraine.",
    "link": "https://kyivindependent.com/2025-deadliest-year-for-ukrainian-civilians-since-first-year-of-russias-full-scale-war-un-says/",
    "timestamp": "2026-01-14T11:09:47Z"
  },
  {
    "title": "NATO would be ‘more formidable’ with US control of Greenland, Trump says",
    "description": "Jan 14 (Reuters) - U.S. President Donald Trump said anything less than Greenland “in the hands” of the United States was “unacceptable”, reiterating his demand for contro… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/nato-would-be-more-formidable-with-us-control-of-greenland-trump-says",
    "timestamp": "2026-01-14T11:08:55Z"
  },
  {
    "title": "US ends temporary protected status for Somalis",
    "description": "Homeland Security has said allowing Somalis to remain in the US under Temporary Protected Status goes against national interests Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/630944-us-ends-somalia-temporary-protected-status/",
    "timestamp": "2026-01-14T11:04:34Z"
  },
  {
    "title": "Xi welcomes stream of leaders shaken by Trump’s new world order",
    "description": "Global leaders are flocking to China to rebuild relationships and secure economic deals. This trend follows a period of US-led tariffs. Nations are eager to engage with President Xi Jinping to avoid being sidelined in international politics. Key areas of focu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/xi-welcomes-stream-of-leaders-shaken-by-trumps-new-world-order/articleshow/126525060.cms",
    "timestamp": "2026-01-14T11:04:22Z"
  },
  {
    "title": "Dutch court hears battle over Nexperia",
    "description": "A Dutch court held hearings Wednesday to weigh whether to order an investigation into Nexperia, a Chinese-owned chip company at the centre of a global tug-of-war over critical semiconductor technology. The firm, based in the Netherlands but whose parent compa…",
    "link": "https://www.digitaljournal.com/world/dutch-court-hears-battle-over-nexperia/article",
    "timestamp": "2026-01-14T11:02:32Z"
  },
  {
    "title": "Canada and China: A half-century journey from Pierre Trudeau to Mark Carney",
    "description": "Canada was one of the first Western countries to recognize communist China, establishing ties in 1970 under Prime Minister Pierre Trudeau",
    "link": "https://abcnews.go.com/Business/wireStory/canada-china-half-century-journey-pierre-trudeau-mark-129195023",
    "timestamp": "2026-01-14T11:02:19Z"
  },
  {
    "title": "Trump Is Making ‘Abolish ICE’ a Mainstream Position",
    "description": "Democrats may have gotten burned by “Defund the Police,” but Trump is making ‘Abolish ICE’ a mainstream position.",
    "link": "http://nymag.com/intelligencer/article/trump-is-making-abolish-ice-a-mainstream-position.html",
    "timestamp": "2026-01-14T11:00:53Z"
  },
  {
    "title": "“Felt like I was going to pass out and die”: Immigration agents are using banned chokeholds",
    "description": "There is a federal ban on chokeholds and similar tactics. But there's no sign of punishment for officers use them",
    "link": "https://www.salon.com/2026/01/14/i-felt-like-i-was-going-to-pass-out-and-die-immigration-agents-are-using-banned-chokeholds/",
    "timestamp": "2026-01-14T11:00:46Z"
  },
  {
    "title": "Opinion: Ottawa’s tariffs protect Ontario and slam Western Canada. Again",
    "description": "Sir John A.'s policy protected central Canada's manufacturing at the expense of western farmers. History is repeating itself. Read more.",
    "link": "https://financialpost.com/opinion/ottawa-tariffs-protect-ontario-slam-western-canada",
    "timestamp": "2026-01-14T11:00:34Z"
  },
  {
    "title": "Trump signals long road ahead in Venezuela in his boldest interventionist move yet",
    "description": "President Donald Trump signaled prolonged U.S. oversight of Venezuela after seizing dictator Nicolás Maduro and conducting large-scale strikes in Venezuela.",
    "link": "https://www.foxnews.com/politics/trump-signals-long-road-ahead-venezuela-his-boldest-interventionist-move-yet",
    "timestamp": "2026-01-14T11:00:01Z"
  },
  {
    "title": "Trump’s Greenland Threats and the Plunder of the Arctic",
    "description": "Not so long ago, the Arctic—a remote and thinly populated\nregion stretching from Alaska to Siberia—seemed immune to the kind of conflicts\nthat beset so many other parts of the world. Scholars even had a phrase for it:\nArctic exceptionalism. Territorial disput…",
    "link": "https://newrepublic.com/article/205166/trump-greenland-threats-plunder-arctic",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Greenland Catholics ‘do not wish to become Americans’ amid U.S. efforts at acquisition",
    "description": "The HDMS Niels Juel (F363) warship, an Iver Huitfeldt-class frigate of the Royal Danish Navy, is moored in Nuuk, Greenland, on June 15, 2025. | Credit: Ludovic MARIN/AFP via Getty Images\n\nJan 14, 2026 / 06:00 am (CNA).\nGreenlandic Catholics are reportedly exp…",
    "link": "https://www.catholicnewsagency.com/news/269069/greenland-catholics-do-not-wish-to-become-americans-amid-u-s-efforts-at-acquisition",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Trump’s Obsession With Real Estate Is Fueling a Ruinous Foreign Policy",
    "description": "The Trump administration’s aggressive push to acquire Greenland has infuriated America’s European allies, and for good reason. It threatens to destroy the NATO alliance, what’s left of the postwar order, and could even result in the outbreak of war—especially…",
    "link": "https://newrepublic.com/article/205255/trump-real-estate-developer-foreign-policy-ruinous",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "America’s New Era of Violent Populism Is Here",
    "description": "A year ago this month, President Donald Trump granted clemency to nearly 1,600 people responsible for the January 6 insurrection at the US Capitol. When Robert Pape, a University of Chicago political science professor who studies domestic political violence, …",
    "link": "https://www.motherjones.com/politics/2026/01/trump-january-6-pardons-political-violence/",
    "timestamp": "2026-01-14T11:00:00Z"
  },
  {
    "title": "Where are the main US military bases in the Middle East?",
    "description": "Jan 14 (Reuters) - Following are the significant military bases in the Middle East. Iran has threatened to strike U.S. bases in the region if attacked by Washington, afte… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/14/where-are-the-main-us-military-bases-in-the-middle-east",
    "timestamp": "2026-01-14T10:59:58Z"
  },
  {
    "title": "UK Actuaries Sound Alarm on Loss Models Downplaying Climate Risk",
    "description": "The finance industry is relying on climate models that understate the speed at which temperatures are rising, according to a fresh study by Britain’s main association of actuaries. The Institute and Faculty of Actuaries, which conducted its study together wit…",
    "link": "https://www.insurancejournal.com/news/international/2026/01/14/854219.htm",
    "timestamp": "2026-01-14T10:58:01Z"
  },
  {
    "title": "Iran vows fast trials of protesters after Trump threat",
    "description": "Iran plans fast-track trials for protesters after a massive crackdown, facing international outrage and threats of ‘strong action’ from the US.\n\nRead More: https://punchng.com/iran-vows-fast-trials-of-protesters-after-trump-threat/",
    "link": "https://punchng.com/iran-vows-fast-trials-of-protesters-after-trump-threat/",
    "timestamp": "2026-01-14T10:55:31Z"
  },
  {
    "title": "In an interview with CBS Evening News anchor Tony Dokoupil, President Trump criticizes Kamala Harris and says \"You wouldn't have a job right now, if she got in\" (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nIn an interview with CBS Evening News anchor Tony Dokoupil, President Trump criticizes Kamala Harris and says “You wouldn't have a job right now, if she got in”  —  CBS Evening News anchor Tony Dokoupil landed an interview with Donald …",
    "link": "https://mediagazer.com/260114/p5",
    "timestamp": "2026-01-14T10:55:00Z"
  },
  {
    "title": "Marvel's Treatment Of Jean Grey in The Daily LITG, 14th January, 2026",
    "description": "How Marvel Might Have Handled Jean Grey Better was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded seventeen years ago and stee…",
    "link": "https://bleedingcool.com/comics/marvels-treatment-of-jean-grey-in-the-daily-litg-14th-january-2026/",
    "timestamp": "2026-01-14T10:52:07Z"
  },
  {
    "title": "Trump's sweeping proposals for credit cards and student debt could be a big deal for other lenders",
    "description": "With Trump's proposed cap on credit card interest rates and new caps on student loans, more Americans might turn to alternative lenders.",
    "link": "https://www.businessinsider.com/alternatives-to-credit-cards-student-loans-personal-private-lenders-2026-1",
    "timestamp": "2026-01-14T10:51:01Z"
  },
  {
    "title": "Greenland's future on the line at key White House meeting",
    "description": "Hoping the United States will cool its Arctic ambitions, the top diplomats of Denmark and Greenland were set to hold high-stakes talks at the White House on Wednesday",
    "link": "https://www.nbcnews.com/world/greenland/greenland-denmark-trump-foreign-ministers-meet-rubio-vance-europe-rcna253953",
    "timestamp": "2026-01-14T10:50:57Z"
  },
  {
    "title": "Mike Turner file to continue representing 10th congressional district as challengers emerge",
    "description": "Mike Turner file to continue representing 10th congressional district as challengers emergedaytondailynews.com",
    "link": "https://www.daytondailynews.com/local/dems-eye-chance-to-unseat-turner-for-dayton-area-congressional-seat-but-can-they/SLAV6GYYLJAAPJQ5ZYFN2ZAXMQ/",
    "timestamp": "2026-01-14T10:50:12Z"
  },
  {
    "title": "France to launch Greenland consulate in ‘political signal’ to US",
    "description": "Washington's threats to seize the strategic island have sparked a crisis among NATO states.",
    "link": "https://www.aljazeera.com/news/2026/1/14/france-to-launch-greenland-consulate-in-political-signal-to-us",
    "timestamp": "2026-01-14T10:50:07Z"
  }
]