[
  {
    "title": "Israel and Hamas peace plan agreement is monumental but questions remain",
    "description": "The announcement that Israel and Hamas have agreed to phase one of a peace deal in Gaza is significant. But despite the celebrations, the end of the war is still far from certain, writes Matthew Doran.",
    "link": "https://www.abc.net.au/news/2025-10-09/question-marks-on-israel-hamas-peace-agreement-details/105870198",
    "timestamp": "2025-10-09T05:54:54Z"
  },
  {
    "title": "UN gutting peacekeeper force due to lack of US funding – media",
    "description": "Over 10,000 personnel will have to be sent home across nine missions globally, according to Reuters and AP Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626115-un-gutting-peacekeeper-force-us-funding/",
    "timestamp": "2025-10-09T05:54:07Z"
  },
  {
    "title": "Ukraine says Russian strikes kill three",
    "description": "Russian strikes killed three people and wounded two in Ukraine's northeastern Sumy region, its military administration said.",
    "link": "https://www.hurriyetdailynews.com/ukraine-says-russian-strikes-kill-three-214475",
    "timestamp": "2025-10-09T05:51:32Z"
  },
  {
    "title": "The Problem of No Man’s Land",
    "description": "Palestine is a special case of “no man’s land.” For the moment, Palestinians still live there. But, according to the Israeli government and the tourism-inspired dreams of Donald Trump, they should not. Israeli soldiers are actively making their lives hell on …",
    "link": "https://www.counterpunch.org/2025/10/09/the-problem-of-no-mans-land/",
    "timestamp": "2025-10-09T05:50:25Z"
  },
  {
    "title": "Gaza peace deal: Trump says Israel and Hamas have signed-off on first phase",
    "description": "All hostages in Gaza will be released very soon, Donald Trump says",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/gaza-peace-deal-trump-says-israel-and-hamas-have-signed-off-on-first-phase/",
    "timestamp": "2025-10-09T05:50:17Z"
  },
  {
    "title": "Federal court to weigh Trump's deployment of National Guard troops in Chicago area",
    "description": "President Donald Trump’s deployment of National Guard troops to Illinois will face scrutiny at a pivotal court hearing, hours after a small number of Texas Guard members started protecting federal property in the the Chicago area",
    "link": "https://abcnews.go.com/US/wireStory/federal-court-weigh-trumps-deployment-national-guard-troops-126354288",
    "timestamp": "2025-10-09T05:50:13Z"
  },
  {
    "title": "Urgent Next Steps for Palestine at the UN",
    "description": "As U.S. President Donald Trump surely intended, his “20-point Gaza plan” succeeded in upstaging calls by many other world leaders at the UN General Assembly for concrete, coordinated UN-led measures to force Israel to end its criminal genocide in Gaza and the…",
    "link": "https://www.counterpunch.org/2025/10/09/urgent-next-steps-for-palestine-at-the-un/",
    "timestamp": "2025-10-09T05:50:12Z"
  },
  {
    "title": "Will Takaichi's 'Abenomics' weaken the yen and raise the ire of Trump?",
    "description": "Markets have responded to Takaichi's victory with the \"Takaichi trade,\" pushing the Nikkei to record highs and weakening the yen to beyond the 150 mark.",
    "link": "https://www.cnbc.com/2025/10/09/the-takaichi-trade-dilemma-japan-currency-tightrope-with-trump-abenomics.html",
    "timestamp": "2025-10-09T05:49:38Z"
  },
  {
    "title": "Israeli President: 'No Doubt' Trump 'Deserves the Nobel Peace Prize' for Hostage Deal",
    "description": "Israeli President Isaac Herzog said Thursday that President Donald Trump deserves the Nobel Peace Prize for negotiating a hostage deal that will bring an end to the Gaza war.\nThe post Israeli President: ‘No Doubt’ Trump ‘Deserves the Nobel Peace Prize’ for Ho…",
    "link": "https://www.breitbart.com/middle-east/2025/10/08/israeli-president-no-doubt-trump-deserves-the-nobel-peace-prize-for-hostage-deal/",
    "timestamp": "2025-10-09T05:49:06Z"
  },
  {
    "title": "Türkiye's top diplomat to attend Gaza meeting in Paris",
    "description": "Foreign Minister Hakan Fidan will participate in a meeting on Gaza, hosted by France in Paris on Thursday, according to the Turkish Foreign Ministry.",
    "link": "https://www.hurriyetdailynews.com/turkiyes-top-diplomat-to-attend-gaza-meeting-in-paris-214471",
    "timestamp": "2025-10-09T05:47:03Z"
  },
  {
    "title": "Gaza Peace Deal: World Leaders React To Israel-Hamas Ceasefire Deal: 'Fighting Must Stop Once And For All'",
    "description": "In a statement, Donald Trump said all hostages would be released \"very soon\" and promised fair treatment for all sides.",
    "link": "https://www.ndtvprofit.com/world/gaza-peace-deal-world-leaders-react-to-israel-hamas-ceasefire-deal-under-trump-fighting-must-stop-once-and-for-all",
    "timestamp": "2025-10-09T05:46:38Z"
  },
  {
    "title": "China tightens rare earth export controls, targets defence, semiconductor users",
    "description": "BEIJING (Reuters) -China tightened its rare earth export controls on Thursday, expanding restrictions on processing technology and spelling out its intention...",
    "link": "https://finance.yahoo.com/news/china-tightens-rare-earth-export-054554821.html",
    "timestamp": "2025-10-09T05:45:54Z"
  },
  {
    "title": "Hamas, Israel agree hostage release, ceasefire under Trump plan",
    "description": "Israel and Hamas on Thursday agreed a Gaza ceasefire deal that could free the remaining living hostages within days, in a major step toward ending a war that has killed tens of thousands and unleashed a humanitarian crisis.",
    "link": "https://www.hurriyetdailynews.com/hamas-israel-agree-hostage-release-ceasefire-under-trump-plan-214470",
    "timestamp": "2025-10-09T05:44:29Z"
  },
  {
    "title": "Is Gaza peace plan ‘first phase’ breakthrough Trump’s final push before Nobel Peace Prize announcement? 10 key facts you need to know",
    "description": "Trump announced a breakthrough in the Israel-Hamas conflict, with both sides agreeing to a \"first phase\" peace plan involving hostage and prisoner exchanges and troop withdrawal. This development comes just before the Nobel Peace Prize announcement. The US pr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-gaza-peace-plan-first-phase-breakthrough-trumps-final-push-before-nobel-peace-prize-announcement-10-key-facts-you-need-to-know/articleshow/124405898.cms",
    "timestamp": "2025-10-09T05:43:56Z"
  },
  {
    "title": "World leaders express hope after Trump says Israel and Hamas agreed to first phase of peace deal",
    "description": "World leaders have expressed hope for peace after U.S. President Donald Trump announced a breakthrough deal between Israel and Hamas",
    "link": "https://abcnews.go.com/International/wireStory/world-leaders-express-hope-after-trump-israel-hamas-126353825",
    "timestamp": "2025-10-09T05:41:44Z"
  },
  {
    "title": "France in limbo",
    "description": "In today’s edition: Ursula von der Leyen’s Commission faces two censure votes in Parliament, both expected to fail, Friedrich Merz comes under pressure as car industry chiefs arrive in Berlin for a major summit, the new US ambassador to the EU says Brussels a…",
    "link": "https://www.euractiv.com/news/rapporteur-france-in-limbo/",
    "timestamp": "2025-10-09T05:40:53Z"
  },
  {
    "title": "JP Morgan’s Jamie Dimon warns ‘serious stock market correction in US’ on the cards",
    "description": "JP Morgan CEO Jamie Dimon has warned of a potential major U.S. stock market correction within six months to two years, citing geopolitical tensions, heavy fiscal spending, and global uncertainty. While optimistic about AI, he cautioned against overconfidence …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/jp-morgans-jamie-dimon-warns-serious-stock-market-correction-in-us-on-the-cards/articleshow/124405909.cms",
    "timestamp": "2025-10-09T05:39:05Z"
  },
  {
    "title": "What do we know about Trump’s Gaza deal?",
    "description": "Israel and Hamas sign off first phase of the plan to bring release of all hostages, alive and dead, ‘very soon’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/qa-what-do-we-know-about-trumps-gaza-deal/",
    "timestamp": "2025-10-09T05:37:33Z"
  },
  {
    "title": "What we know about the 'first phase' of the Gaza peace deal",
    "description": "Donald Trump says all hostages will be released and Israel will withdraw troops to an \"agreed upon line\", but there is no update to other aspects of his 20-point peace plan.",
    "link": "https://www.bbc.com/news/articles/cvgqx7ygq41o",
    "timestamp": "2025-10-09T05:36:27Z"
  },
  {
    "title": "What we know about the 'first phase' Gaza peace deal",
    "description": "Donald Trump says all hostages will be released and Israel will withdraw troops to an \"agreed upon line\", but there is no update to other aspects of his 20-point peace plan.",
    "link": "https://www.bbc.co.uk/news/articles/cvgqx7ygq41o",
    "timestamp": "2025-10-09T05:36:27Z"
  },
  {
    "title": "'Momentous opportunity': Global reaction to news of Gaza peace deal",
    "description": "Officials from around the world have welcomed the agreement between Israel and Hamas.",
    "link": "https://www.bbc.com/news/articles/c8rvzzjnxe1o",
    "timestamp": "2025-10-09T05:35:09Z"
  },
  {
    "title": "M'sia ready to support any UN peacekeeping effort in Palestine, Dewan Rakyat told",
    "description": "KUALA LUMPUR: Any proposal for a military alliance of Muslim countries should be considered carefully to ensure the objectives of peace are achieved, says Deputy Foreign Minister Datuk Mohamad Alamin. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/09/m039sia-ready-to-support-any-un-peacekeeping-effort-in-palestine-dewan-rakyat-told",
    "timestamp": "2025-10-09T05:33:00Z"
  },
  {
    "title": "Gavin Newsom Slams Trump for ‘Abandoning’ LA Fire Victims by Withholding Aid: ‘Where Is the Accountability?’ | Video",
    "description": "\"It’s disgusting and disqualifying,\" the California governor adds\nThe post Gavin Newsom Slams Trump for ‘Abandoning’ LA Fire Victims by Withholding Aid: ‘Where Is the Accountability?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gavin-newsom-donald-trump-criticism-la-fire-victims-aid/",
    "timestamp": "2025-10-09T05:31:52Z"
  },
  {
    "title": "Donald Trump, 79, Going for ‘Yearly’ Health Check After Just Six Months",
    "description": "The annual checkup is the second time this year as speculation on the president’s health swirls.",
    "link": "https://www.thedailybeast.com/donald-trump-79-going-for-yearly-health-check-after-just-six-months/",
    "timestamp": "2025-10-09T05:30:07Z"
  },
  {
    "title": "Will the SEC’s ‘innovation exemptions’ change U.S. crypto regulations for good?",
    "description": "The SEC is moving fast, but what does the 'innovation exemption' mean for everyday crypto investors?",
    "link": "https://ambcrypto.com/will-secs-innovation-exemptions-change-u-s-crypto-regulations-for-good/",
    "timestamp": "2025-10-09T05:30:00Z"
  },
  {
    "title": "UN Chief Guterres Hails Israel-Hamas Ceasefire Deal",
    "description": "UN Secretary-General Antonio Guterres welcomed the peace agreement between Israel and Palestinian movement Hamas, stating that the global organization is ready to support the deal and increase humanitarian aid.",
    "link": "https://sputnikglobe.com/20251009/un-chief-guterres-hails-israel-hamas-ceasefire-deal-1122929076.html",
    "timestamp": "2025-10-09T05:27:57Z"
  },
  {
    "title": "No to Trump: Why Afghanistan’s neighbours have opposed US Bagram plan",
    "description": "Regional powers gather in Moscow to discuss Afghanistan’s future, signalling a new phase of post-US diplomacy.",
    "link": "https://www.aljazeera.com/news/2025/10/9/no-to-trump-why-afghanistans-neighbours-have-opposed-us-bagram-plan",
    "timestamp": "2025-10-09T05:23:43Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire and return of hostages",
    "description": "Crucial questions remain, including postwar administration and fate of Hamas",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/09/israel-and-hamas-agree-to-gaza-ceasefire-and-return-of-hostages/",
    "timestamp": "2025-10-09T05:21:10Z"
  },
  {
    "title": "Trump Says US Attack on Iran's Nuclear Facilities Brought Israel-Hamas Deal Closer",
    "description": "US President Donald Trump has said that the US Air Force attack on Iran's nuclear facilities was one of the reasons for the agreement between Israel and Hamas.",
    "link": "https://sputnikglobe.com/20251009/trump-says-us-attack-on-irans-nuclear-facilities-brought-israel-hamas-deal-closer-1122928940.html",
    "timestamp": "2025-10-09T05:18:49Z"
  },
  {
    "title": "Trump calls for jailing of Illinois governor and Chicago mayor in immigration standoff",
    "description": "President Donald Trump has called for the jailing of Illinois officials, accusing them of not doing enough to ensure the safety of federal immigration officers who are conducting raids in Chicago. The president wrote in a social media post that Chicago Mayor …",
    "link": "https://thechronicle.com.gh/trump-calls-for-jailing-of-illinois-governor-and-chicago-mayor-in-immigration-standoff/",
    "timestamp": "2025-10-09T05:16:40Z"
  },
  {
    "title": "Israeli hostages, including Bipin Joshi, will be released very soon: US",
    "description": "Kathmandu, Oct 9: The United States said Israeli hostages held by Hamas, including Nepali national Bipin Joshi, are expected to […]\nThe post Israeli hostages, including Bipin Joshi, will be released very soon: US appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/10/09/israeli-hostages-including-bipin-joshi-will-be-released-very-soon-us/",
    "timestamp": "2025-10-09T05:15:00Z"
  },
  {
    "title": "US and regional mediators join talks in push to end Gaza war",
    "description": "Top US envoys and regional figures are taking part in the third day of indirect talks between Israel and Hamas in Egypt on President Donald Trump’s plan to end the war in Gaza. Steve Witkoff and Trump’s son-in-law, Jared Kushner, arrived in Sharm el-Sheikh on…",
    "link": "https://thechronicle.com.gh/us-and-regional-mediators-join-talks-in-push-to-end-gaza-war/",
    "timestamp": "2025-10-09T05:14:55Z"
  },
  {
    "title": "Herzog: President Trump deserves Nobel Prize for Gaza hostage deal",
    "description": "President Isaac Herzog hailed the agreement to free hostages and end the Gaza war, thanking Prime Minister Netanyahu and President Donald Trump, whom he said deserves the Nobel Peace Prize.",
    "link": "https://www.israelnationalnews.com/news/416010",
    "timestamp": "2025-10-09T05:13:00Z"
  },
  {
    "title": "Live updates: Israel, Hamas agree to first phase of Gaza ceasefire plan, Trump says hostages could be released Monday",
    "description": "President Trump says Israel and Hamas have agreed on the first phase of a framework that will allow for the swift release of all hostages. Follow live updates.",
    "link": "https://www.cnn.com/world/live-news/israel-hamas-gaza-ceasefire-agreement-10-09-25",
    "timestamp": "2025-10-09T05:10:01Z"
  },
  {
    "title": "China tightens rare earth export curbs, taking aim at military and chip applications | CNN Business",
    "description": "Beijing imposed new restrictions on rare earth exports on Thursday, targeting critical minerals production technologies and their overseas use, including for military and semiconductor applications.",
    "link": "https://www.cnn.com/2025/10/09/business/china-tightens-rare-earth-export-controls-intl-hnk",
    "timestamp": "2025-10-09T05:08:57Z"
  },
  {
    "title": "US diplomat fired over relationship with woman accused of ties to Chinese Communist Party",
    "description": "The State Department said Wednesday that it has fired a US diplomat over a romantic relationship he admitted having with a Chinese woman alleged to have ties to the Chinese Communist Party.",
    "link": "https://nypost.com/2025/10/09/us-news/us-state-department-diplomat-fired-over-relationship-with-chinese-communist-party-woman/",
    "timestamp": "2025-10-09T05:07:13Z"
  },
  {
    "title": "Trump announces Gaza ceasefire deal: What we know and what’s next",
    "description": "This is the first phase of a 20-point plan announced by Trump last week.",
    "link": "https://www.aljazeera.com/news/2025/10/9/trump-announces-gaza-ceasefire-deal-what-we-know-and-whats-next",
    "timestamp": "2025-10-09T05:05:38Z"
  },
  {
    "title": "Inside the room where Nobel Peace Prize is decided – but will Trump get his wish?",
    "description": "For the first time in its 125-year history, the committee allows an exclusive behind-the-scenes glimpse.",
    "link": "https://www.bbc.com/news/articles/cg5ejm4qrzyo",
    "timestamp": "2025-10-09T05:04:22Z"
  },
  {
    "title": "IDF to significantly withdraw from Khan Yunis in southern Gaza",
    "description": "Amended maps for Gaza deal include significant IDF withdrawal in Khan Yunis and southern Gaza, as per Hamas' request.",
    "link": "https://www.israelnationalnews.com/news/416006",
    "timestamp": "2025-10-09T05:03:41Z"
  },
  {
    "title": "Prosecutors assure judge of fair trial despite posts about assassination of UnitedHealthcare CEO",
    "description": "Federal prosecutors say no harm was done to the prospects for a fair trial when two U.S. Justice Department officials reposted potentially inflammatory comments President Donald Trump made about Luigi Mangione after his arrest in the killing of UnitedHealthca…",
    "link": "https://www.whio.com/news/business/prosecutors-say-no/GQWBH2ROCY54LJXZPN4EBKUDQE/",
    "timestamp": "2025-10-09T05:02:02Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire and return of hostages",
    "description": "Israel and Hamas said they had agreed to a long-awaited ceasefire and hostage deal, the first phase of U.S. President Donald Trump's plan to end a war in Gaza that has killed more than 67,000 people and reshaped the Middle East.",
    "link": "https://www.independent.ie/world-news/middle-east/israel-and-hamas-agree-to-gaza-ceasefire-and-return-of-hostages/a846528435.html",
    "timestamp": "2025-10-09T05:01:52Z"
  },
  {
    "title": "Israel and Hamas agree to Gaza ceasefire as hostages may be released on Saturday",
    "description": "Israeli hostages may be released as early as Saturday under a U.S. plan to end the war in Gaza and the country's military will complete the first part of a partial withdrawal from the enclave within 24 hours of the deal being signed, said a source briefed on …",
    "link": "https://www.independent.ie/world-news/middle-east/israel-and-hamas-agree-to-gaza-ceasefire-as-hostages-may-be-released-on-saturday/a846528435.html",
    "timestamp": "2025-10-09T05:01:52Z"
  },
  {
    "title": "Watch: Scenes of celebration in Gaza after peace deal announcement",
    "description": "Palestinians celebrate on the streets of Khan Younis after the first phase of a Gaza peace deal was agreed.",
    "link": "https://www.bbc.co.uk/news/videos/c5yennkdjyyo",
    "timestamp": "2025-10-09T04:59:54Z"
  },
  {
    "title": "Israel and Hamas agree to ceasefire after 2 years of war – “Hostages will be back on Monday” says Trump",
    "description": "\"Gaza will be rebuilt and the US will participate in peacekeeping,\" said the US president, who aspires to receive the Nobel Peace Prize, in an interview.\nThe post Israel and Hamas agree to ceasefire after 2 years of war – “Hostages will be back on Monday” say…",
    "link": "https://en.protothema.gr/2025/10/09/israel-and-hamas-agree-to-ceasefire-after-2-years-of-war-hostages-will-be-back-on-monday-says-trump/",
    "timestamp": "2025-10-09T04:51:42Z"
  },
  {
    "title": "Trump to have 'routine' medical check on Friday: White House",
    "description": "President Donald Trump is scheduled for a routine medical checkup this Friday at Walter Reed Medical Center. This marks his second annual appointment this year, following a clean bill of health in April. At 79, Trump, who often highlights his fitness, will un…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-have-routine-medical-check-on-friday-white-house/articleshow/124405058.cms",
    "timestamp": "2025-10-09T04:50:07Z"
  },
  {
    "title": "US approves some Nvidia UAE sales, Bloomberg News reports",
    "description": "America has approved billions of dollars in Nvidia chip exports to the United Arab Emirates. This is part of a bilateral artificial intelligence agreement. The deal will help the UAE build data centres for AI model development. The agreement allows for signif…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-approves-some-nvidia-uae-sales-bloomberg-news-reports/articleshow/124405043.cms",
    "timestamp": "2025-10-09T04:49:03Z"
  },
  {
    "title": "Crude oil futures decline as Trump announces Israel-Hamas peace plan",
    "description": "October crude oil futures trade at ₹5,529 on MCX during initial hour of trading on Thursday against previous close of ₹5,576, down by 0.84%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-decline-as-trump-announces-israel-hamas-peace-plan/article70142310.ece",
    "timestamp": "2025-10-09T04:46:00Z"
  },
  {
    "title": "Opportunity where beyond services, India will now create those products: Niranjan Hiranandani on US tariffs",
    "description": "US tariffs present a golden opportunity for India to shift from a services-centric model to indigenous product creation, boosting the Atmanirbhar Bharat vision. Businessman Dr. Niranjan Hiranandani believes this challenge will accelerate India's self-reliance…",
    "link": "https://economictimes.indiatimes.com/news/india/opportunity-where-beyond-services-india-will-now-create-those-products-niranjan-hiranandani-on-us-tariffs/articleshow/124404968.cms",
    "timestamp": "2025-10-09T04:45:46Z"
  },
  {
    "title": "Frustrated lawmakers say lack of trust is making it harder to end the government shutdown",
    "description": "Lawmakers are openly venting their frustration as they try to gain traction to end the government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/frustrated-lawmakers-lack-trust-making-harder-end-government-126352928",
    "timestamp": "2025-10-09T04:45:39Z"
  },
  {
    "title": "Donald Trump's Second 'Yearly' Check-Up in 6 Months Sparks Health Panic - Inquisitr News",
    "description": "Despite claims of Trump being in great shape, the President has a second health checkup coming up, only within six months after the first one.",
    "link": "https://www.inquisitr.com/donald-trumps-second-yearly-check-up-in-6-months-sparks-health-panic",
    "timestamp": "2025-10-09T04:44:53Z"
  },
  {
    "title": "Gold price vs US Dollar: $6,000 to $9,000 - where will gold rate go up? Is Donald Trump responsible for gold rush over slipping USD?",
    "description": "Gold prices rally in the longer term would come from how central banks think about monetary policy and how central banks think about their own reserves, experts said.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-vs-us-dollar-6000-to-9000-where-will-gold-rate-go-is-donald-trump-responsible-for-gold-rush-over-slipping-usd/articleshow/124404865.cms",
    "timestamp": "2025-10-09T04:43:42Z"
  },
  {
    "title": "'We want to go back home, rebuild our lives': Gaza's Palestinians celebrate Israel-Hamas deal",
    "description": "At a hospital in central Gaza, music played and people were seen dancing. Yet alongside the joy, many mourned the toll of the war: 'Now is the time for all of us to weep, to comfort one another and to sleep as if for the first time we are finally allowed to r…",
    "link": "https://www.haaretz.com/israel-news/2025-10-09/ty-article/well-go-back-home-rebuild-our-lives-gazas-palestinians-celebrate-israel-hamas-deal/00000199-c73b-db56-a5db-cf3b83830000",
    "timestamp": "2025-10-09T04:41:49Z"
  },
  {
    "title": "UN peacekeeping forces to be cut 25% due to budget strains: Official",
    "description": "The United Nations faces a 25% reduction in peacekeeping forces due to significant US aid cuts, impacting approximately 13,000-14,000 personnel and civilian staff. This funding shortfall, largely attributed to the US contributing only half of its expected bud…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/un-peacekeeping-forces-to-be-cut-25-due-to-budget-strains-official/articleshow/124404892.cms",
    "timestamp": "2025-10-09T04:41:10Z"
  },
  {
    "title": "Trump Announces Israel-Hamas Deal",
    "description": "Breaking News: Israel and Hamas Sign US-Proposed Gaza Peace Plan! In a stunning turn of events, former US President Donald J. Trump has announced that Israel and Hamas have signed the first phase of a Gaza peace plan, proposed by the United States. This landm…",
    "link": "https://nep123.com/trump-announces-israel-hamas-deal/",
    "timestamp": "2025-10-09T04:40:08Z"
  },
  {
    "title": "Taiwanese firms set to revamp HR deployment as US, Thailand tighten expat rules",
    "description": "The restructuring of global supply chains under the Donald Trump 2.0 era is forcing companies to rethink human resource strategies. At TSMC's wafer fabrication facilities in Arizona, roughly 90% of newly hired technical staff are recruited locally, reflecting…",
    "link": "https://www.digitimes.com/news/a20251009PD223/donald-trump-talent-salary-staff-tsmc.html",
    "timestamp": "2025-10-09T04:33:43Z"
  },
  {
    "title": "Majority of Americans Support Deportation of Illegals, Says ... NYT/Siena Poll?",
    "description": "Democrats won't listen to Harvard. Maybe they'll listen to the New York Times?This entire year, Democrats from Los Angeles to Chicago to Portland to Boston have gone all-in against increased immigration enforcement. They have ginned up violent activists to at…",
    "link": "https://freerepublic.com/focus/f-news/4345190/posts",
    "timestamp": "2025-10-09T04:33:06Z"
  },
  {
    "title": "US approves some Nvidia UAE sales, Bloomberg News reports",
    "description": "The Commerce Department's Bureau of Industry and Security recently issued the Nvidia export licenses under the terms of a bilateral artificial intelligence...",
    "link": "https://finance.yahoo.com/news/us-approves-nvidia-uae-sales-043216841.html",
    "timestamp": "2025-10-09T04:32:16Z"
  },
  {
    "title": "Hostage, prisoner lists swapped as Gaza talks ‘making headway’",
    "description": "Talks to end the war in Gaza were bolstered by the arrival of senior figures from Israel and the United States yesterday after Hamas handed over its lists of hostages and Palestinian prisoners to be freed in a swap.",
    "link": "https://www.independent.ie/world-news/middle-east/hostage-prisoner-lists-swapped-as-gaza-talks-making-headway/a1518593230.html",
    "timestamp": "2025-10-09T04:30:00Z"
  },
  {
    "title": "Leaders react to agreement on first phase of Trump's Gaza deal",
    "description": "\"I welcome the news that a deal has been reached on the first stage of President Trump’s peace plan for Gaza,\" Starmer said in a statement.  \"Canada welcomes...",
    "link": "https://www.yahoo.com/news/articles/leaders-react-agreement-first-phase-042623816.html",
    "timestamp": "2025-10-09T04:26:23Z"
  },
  {
    "title": "PM Modi hails Trump's Gaza peace plan, welcomes first phase of ceasefire agreement",
    "description": "Prime Minister Narendra Modi welcomed the ceasefire deal between Israel and Hamas, announced by US President Donald Trump. He lauded the first phase of the agreement as a reflection of Israeli Prime Minister Benjamin Netanyahu's leadership. Modi expressed hop…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-hails-trumps-gaza-peace-plan-welcomes-first-phase-of-ceasefire-agreement/articleshow/124404593.cms",
    "timestamp": "2025-10-09T04:25:06Z"
  },
  {
    "title": "Watch: Scenes of celebration in Gaza after Trump's announcement",
    "description": "Palestinians celebrate on the streets of Khan Younis after the first phase of a Gaza peace deal was agreed.",
    "link": "https://www.bbc.com/news/videos/c5yennkdjyyo",
    "timestamp": "2025-10-09T04:24:59Z"
  },
  {
    "title": "Watch: Hostage families celebrate after Gaza breakthrough",
    "description": "Relatives of Israeli hostages celebrated in Tel Aviv after the announcement that Israel and Hamas had signed the first phase of a peace deal.",
    "link": "https://www.bbc.com/news/videos/c5y4nnpvqw2o",
    "timestamp": "2025-10-09T04:24:58Z"
  },
  {
    "title": "What have we learned from this war?",
    "description": "We have learned much about the barbarism of our enemies, but we have also learned that contrary to the expectations of our enemies, Israel’s staying power is stronger and longer than theirs. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416005",
    "timestamp": "2025-10-09T04:22:32Z"
  },
  {
    "title": "The Gaza War Isn’t Over Yet. But It Could Be Soon.",
    "description": "Trump may have ended the Gaza hostage crisis. Can he end the Gaza war?",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/trump-hostages-gaza/684498/",
    "timestamp": "2025-10-09T04:21:30Z"
  },
  {
    "title": "Code Red for Virginia Dems: Internal Polling From Jay Jones's Campaign Confirms the Crap Has Hit the Fan",
    "description": "It was clear early on after news of the Jay Jones texting scandal broke last Friday, that both he and his fellow Democrats at the state and national levels were going to handle this very badly.Not only did he not apologize initially, but candidates like Virgi…",
    "link": "https://freerepublic.com/focus/f-news/4345188/posts",
    "timestamp": "2025-10-09T04:19:53Z"
  },
  {
    "title": "Jimmy Kimmel shouts out Disney's Dana Walden over his suspension ordeal",
    "description": "Jimmy Kimmel, after his ABC suspension, praises Disney exec Dana Walden, a potential Bob Iger successor, highlighting her support during his ordeal.",
    "link": "https://www.businessinsider.com/jimmy-kimmel-praises-disney-dana-walden-after-return-abc-2025-10",
    "timestamp": "2025-10-09T04:19:33Z"
  },
  {
    "title": "With Mideast deal, Trump is on the brink of a major diplomatic accomplishment",
    "description": "US President Donald Trump is close to securing a ceasefire between Israel and Hamas, which could end years of conflict and free the remaining hostages. The deal, if sustained, may mark his biggest diplomatic success and strengthen his Nobel Peace Prize prospe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/with-mideast-deal-trump-is-on-the-brink-of-a-major-diplomatic-accomplishment/articleshow/124404530.cms",
    "timestamp": "2025-10-09T04:18:43Z"
  },
  {
    "title": "Kaitlan Collins Adds Context After Jake Tapper Downplays Trump’s Israel-Hamas Deal",
    "description": "CNN anchor Jake Tapper appeared dismissive of President Donald Trump’s newly announced ceasefire deal between Israel and Hamas.",
    "link": "https://dailycaller.com/2025/10/09/kaitlan-collins-corrects-tapper-downplaying-trump-peace-deal/",
    "timestamp": "2025-10-09T04:17:42Z"
  },
  {
    "title": "Gold price prediction: Gold rate falls after hitting historic high. What is halting bullion's dream run?",
    "description": "Gold rate has climbed 54 per cent year-to-date on strong central bank buying, increased demand for gold-backed Exchange-Traded Fund (ETFs), a weaker dollar and safe-haven demand.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-gold-rate-falls-after-hitting-historic-high-what-is-halting-bullions-dream-run/articleshow/124404467.cms",
    "timestamp": "2025-10-09T04:17:10Z"
  },
  {
    "title": "PM Modi hails phase-1 success of Trump peace plan for Gaza",
    "description": "Trump Peace Plan: PM Narendra Modi had earlier hailed Trump twice for floating the peace proposal involving Israel, Palestine, and Hamas.",
    "link": "https://indianexpress.com/article/world/pm-modi-hails-phase-1-success-of-trump-peace-plan-for-gaza-10296334/",
    "timestamp": "2025-10-09T04:16:17Z"
  },
  {
    "title": "Bihar lady teacher caught without ticket in AC train, later returns with father to assault TTE. Watch viral video",
    "description": "A Bihar government school teacher faced widespread criticism after a video showed her traveling in an AC train coach without a ticket and arguing with a TTE. A second video emerged of her confronting the same TTE with her father, escalating public outrage and…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/bihar-lady-teacher-caught-without-ticket-in-ac-train-later-returns-with-father-to-assault-tte-watch-viral-video/articleshow/124404287.cms",
    "timestamp": "2025-10-09T04:15:31Z"
  },
  {
    "title": "India Welcomes Israel-Hamas Agreeing To First Phase Of Gaza Peace Plan, PM Modi Says",
    "description": "India welcomed the agreement between Israel and Palestinian militant group Hamas on the first phase of the Gaza peace plan that allows for release of Israeli hostages and withdrawal of Israeli troops from some parts. Prime Minister Narendra Modi said the coun…",
    "link": "https://www.ndtvprofit.com/nation/india-welcomes-israel-hamas-agreeing-on-first-phase-of-gaza-peace-plan-pm-modi-says",
    "timestamp": "2025-10-09T04:14:34Z"
  },
  {
    "title": "Donald Trump Says Hostages Will Likely Be Released on Monday After Gaza Ceasefire Deal: ‘So Much Is Happening’ | Video",
    "description": "\"This is more than Gaza. This is peace in the Middle East. That's an incredible thing,\" the president adds\nThe post Donald Trump Says Hostages Will Likely Be Released on Monday After Gaza Ceasefire Deal: ‘So Much Is Happening’ | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/donald-trump-hostages-update-gaza-fox-news-appearance/",
    "timestamp": "2025-10-09T04:12:25Z"
  },
  {
    "title": "Urgent Next Steps for Palestine at the UN, Regardless of the Trump Plan",
    "description": "( Codepink ) - As U.S. President Donald Trump surely intended, his “20-point Gaza plan” succeeded in upstaging calls by many other world leaders at the UN General Assembly for concrete, coordinated UN-led measures to force Israel to end its criminal genocide …",
    "link": "https://www.juancole.com/2025/10/urgent-palestine-regardless.html",
    "timestamp": "2025-10-09T04:06:54Z"
  },
  {
    "title": "Greenland's leader hails EU as trusted friend and urges investment in its minerals",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen has thanked the European Union for being a \"trusted friend\" and urged investment in Greenland's resources",
    "link": "https://abcnews.go.com/Business/wireStory/greenlands-leader-hails-eu-trusted-friend-urges-investment-126352718",
    "timestamp": "2025-10-09T04:05:29Z"
  },
  {
    "title": "Urgent Next Steps for Palestine at the UN",
    "description": "Why the UN should not sit back during the current Israel-Palestine negotiations headfake but should take specific steps to support Palestine.",
    "link": "https://www.nakedcapitalism.com/2025/10/urgent-next-steps-for-palestine-at-the-un.html",
    "timestamp": "2025-10-09T04:04:35Z"
  },
  {
    "title": "Publisher apologizes to Melania Trump, recalls book over Epstein claim",
    "description": "Book publisher HarperCollins UK issued an apology Tuesday after a recent book made claims that first lady Melania Trump was introduced to her husband through convicted sex offender Jeffrey Epstein. The publisher worked with Andrew Lownie, author of “Entitled:…",
    "link": "https://freerepublic.com/focus/f-chat/4345186/posts",
    "timestamp": "2025-10-09T04:02:04Z"
  },
  {
    "title": "A Wisconsin Judge Requires Proof of U.S. Citizenship to Vote in State Elections",
    "description": "On Friday, October 3, 2025, Michael P. Maxwell, a state circuit court judge in Waukesha County, Wisconsin, ordered the Wisconsin Elections Commission (WEC) and the Wisconsin Department of Transportation (DOT) to stop registering illegal aliens to vot...",
    "link": "https://www.americanthinker.com/articles/2025/10/a_wisconsin_judge_requires_proof_of_u_s_citizenship_to_vote_in_state_elections.html",
    "timestamp": "2025-10-09T04:00:00Z"
  },
  {
    "title": "Bari Weiss and legacy liberalism",
    "description": "Actor and comedian Groucho Marx famously said “I don’t want to belong to any club that will accept me as a member.” Liberals up in arms that journalist Bari Weiss will be overseeing CBS News are perhaps raging that their exclusive c...",
    "link": "https://www.americanthinker.com/blog/2025/10/bari_weiss_and_legacy_liberalism.html",
    "timestamp": "2025-10-09T04:00:00Z"
  },
  {
    "title": "A deranged Democrat candidate outrageously keeps his endorsements",
    "description": "In 1919, as a bribery scandal to fix the World Series involving baseball player “Shoeless” Joe Jackson of the Black Sox made headlines, an anguished young fan confronted him pleading, “Say it ain’t so, Joe.” Jackson late...",
    "link": "https://www.americanthinker.com/blog/2025/10/a_deranged_democrat_candidate_outrageously_keeps_his_endorsements.html",
    "timestamp": "2025-10-09T04:00:00Z"
  },
  {
    "title": "Weaponizing Truth",
    "description": "Democrat politicians and left-leaning journalists use loaded questions like weapons. Thankfully, conservatives have found a powerful model in President Donald Trump. He has inspired a new generation of fighters to push back against dishonest attacks....",
    "link": "https://www.americanthinker.com/articles/2025/10/weaponizing_truth.html",
    "timestamp": "2025-10-09T04:00:00Z"
  },
  {
    "title": "Pope picks divisive Trump-hating bishop to bring Church 'unity' on illegal immigration",
    "description": "Was El Paso Bishop Mark Seitz the best he could do?",
    "link": "https://www.americanthinker.com/blog/2025/10/ope_picks_divisive_trump_hating_bishop_to_bring_church_unity_on_illegal_immigration.html",
    "timestamp": "2025-10-09T04:00:00Z"
  },
  {
    "title": "Trump calls for Illinois Gov. Pritzker, Chicago Mayor Johnson to be jailed",
    "description": "Trump called for Illinois Gov. JB Pritzker and Chicago Mayor Brandon Johnson to be jailed for \"failing to protect ICE,\" to which Pritzker responded, \"Come...",
    "link": "https://www.upi.com/Top_News/US/2025/10/08/donald-trump-jb-pritzker-come-get-me/1011759952886/",
    "timestamp": "2025-10-09T03:58:39Z"
  },
  {
    "title": "‘I was in pain’: Kamala Harris gets vulnerable during SF book tour stop [libtard-a-rama Goebbels-fest]",
    "description": "Kamala Harris was at the Masonic on Sunday afternoon for a conversation about her new book, “107 days.” So was Doug Emhoff, her husband. Everyone was thrilled to see them. They were in friendly territory. The ovation was deafening. “That election was quite un…",
    "link": "https://freerepublic.com/focus/f-chat/4345185/posts",
    "timestamp": "2025-10-09T03:58:31Z"
  },
  {
    "title": "Israel, Hamas sign off on phase 1 of Gaza plan",
    "description": "Negotiators for Israel and Hamas have agreed to pause fighting in Gaza to release the remaining hostages in exchange for Palestinian prisoners, adopting parts of a plan backed by US President Trump. Follow DW for more. Israel and Hamas have signed off on firs…",
    "link": "https://www.dw.com/en/israel-hamas-sign-off-on-phase-1-of-gaza-plan/live-74285275",
    "timestamp": "2025-10-09T03:55:00Z"
  },
  {
    "title": "Eric Trump goes off on Chris Cuomo over government ‘weaponization’",
    "description": "Eric Trump accused NewsNation anchor Chris Cuomo of trying to “play coy” while debating government weaponization on Tuesday, saying President Donald Trump didn’t try to “bankrupt” his opponents in his first term. Cuomo asked Eric Trump if it was fair to say t…",
    "link": "https://freerepublic.com/focus/f-news/4345184/posts",
    "timestamp": "2025-10-09T03:48:29Z"
  },
  {
    "title": "Donald Trump's approval ratings are falling but U.S Government shutdown impact not visible",
    "description": "Nate Silver’s US national poll aggregate, Donald Trump has a net approval of -9.4, with 52.7 per cent disapproving and 43.3 per cent approving. His net approval dropped two points in late September, but the U.S. Government shutdown hasn’t changed it yet.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-approval-ratings-are-falling-but-u-s-government-shutdown-impact-not-visible/articleshow/124403916.cms",
    "timestamp": "2025-10-09T03:43:38Z"
  },
  {
    "title": "Hakeem Jeffries Outright Accuses House Republicans of Working To ‘Cover Up for the Pedophiles’",
    "description": "Hakeem Jeffries claimed that congressional Republicans are covering up for \"pedophiles\" by continuing to block a measure seeking to force the release of government files relating to Jeffrey Epstein.\nThe post Hakeem Jeffries Outright Accuses House Republicans …",
    "link": "https://www.mediaite.com/media/tv/hakeem-jeffries-outright-accuses-house-republicans-of-working-to-cover-up-for-the-pedophiles/",
    "timestamp": "2025-10-09T03:40:33Z"
  },
  {
    "title": "Greenland’s leader hails EU as trusted friend and urges investment in its minerals",
    "description": "BRUSSELS (AP) — Greenland’s leader on Wednesday thanked the European Union for being “a trusted friend” and urged the 27-nation bloc to invest in his country’s mineral resources, renewable energy, airports and internet services. In a speech to the European Pa…",
    "link": "https://financialpost.com/pmn/greenlands-leader-hails-eu-as-trusted-friend-and-urges-investment-in-its-minerals",
    "timestamp": "2025-10-09T03:39:42Z"
  },
  {
    "title": "The Dems are letting Antifa take over their cities — Trump is right to send federal troops to maintain order",
    "description": "It’s been five years since the nation was terrorized by Antifa militants rioting, attacking cops, throwing Molotov cocktails, setting streets ablaze, breaking shop windows, vandalizing cars, targeting journalists and hurting innocent people.",
    "link": "https://nypost.com/2025/10/08/opinion/the-dems-are-letting-antifa-take-over-their-cities-trump-is-right-to-send-federal-troops-to-maintain-order/",
    "timestamp": "2025-10-09T03:37:03Z"
  },
  {
    "title": "What We Know About The New Gaza Deal",
    "description": "US President Donald Trump announced on Wednesday that Israel and Hamas have agreed to the first phase of a ceasefire in Gaza, after days of indirect talks in Egypt.",
    "link": "https://www.ibtimes.com/what-we-know-about-new-gaza-deal-3786263",
    "timestamp": "2025-10-09T03:36:15Z"
  },
  {
    "title": "Carney on Gaza deal: Peace finally feels attainable",
    "description": "Canadian Prime Minister Mark Carney congratulated United States President Donald Trump, Qatar, Egypt and Turkey for their \"tireless work\" to support the peace talks between Israel and Hamas.\"I am reli...",
    "link": "https://biztoc.com/x/830443e125b308aa",
    "timestamp": "2025-10-09T03:34:55Z"
  },
  {
    "title": "Trump Says Everyone Is ‘Loving Israel Again’ After Peace Deal: ‘They Really Are’",
    "description": "President Donald Trump claimed on Wednesday that everyone is \"loving Israel again\" following the announcement of a peace deal between Israel and Hamas.\nThe post Trump Says Everyone Is ‘Loving Israel Again’ After Peace Deal: ‘They Really Are’ first appeared on…",
    "link": "https://www.mediaite.com/media/tv/trump-says-everyone-is-loving-israel-again-after-peace-deal-they-really-are/",
    "timestamp": "2025-10-09T03:34:31Z"
  },
  {
    "title": "Trump on a coin? When Julius Caesar tried that, the Roman republic crumbled soon after",
    "description": "More than 2,000 years ago, the depiction of living leaders on Roman coins caused similar ructions.  It came at a time when the Roman republic was in trouble.",
    "link": "https://theconversation.com/trump-on-a-coin-when-julius-caesar-tried-that-the-roman-republic-crumbled-soon-after-266887",
    "timestamp": "2025-10-09T03:32:15Z"
  },
  {
    "title": "China Dodges US Export Controls, Buys $38 Billion In Chipmaking Equipment, Congress Report Says",
    "description": "China bought about $38 billion worth of sophisticated chimaking equipment from the U.S. and its allies last year due to gaps in efforts to curb manufacturing...",
    "link": "https://finance.yahoo.com/news/china-dodges-us-export-controls-033104707.html",
    "timestamp": "2025-10-09T03:31:04Z"
  }
]