[
  {
    "title": "'No one silences us!' The View finally hits out after ABC cuts Jimmy Kimmel",
    "description": "The day after Jimmy Kimmel was thrown off TV, accused of offensive remarks about the death of far-right activist Charlie Kirk, \"The View\" was completely mum on the matter. That silence ended on Monday, however, when co-host Whoopi Goldberg promised that the A…",
    "link": "https://www.rawstory.com/jimmy-kimmel-2674016563/",
    "timestamp": "2025-09-22T15:56:54Z"
  },
  {
    "title": "US Sends New Missile Destroyer to Caribbean: Map, Photos and What We Know",
    "description": "The USS Stockdale's transit highlights a U.S. Caribbean buildup targeting Venezuelan-linked drug networks and pressuring Maduro's government.",
    "link": "https://www.newsweek.com/uss-stockdale-panama-canal-venezuela-trump-2133734",
    "timestamp": "2025-09-22T15:56:34Z"
  },
  {
    "title": "How Donald Trump's Gold Card Compares to Green Card: What To Know",
    "description": "Trump's $1 million Gold Card visa provides a fast track for the wealthy—for now. Here's how it compares to a traditional green card.",
    "link": "https://www.newsweek.com/donald-trump-gold-card-green-card-visa-howard-lutnick-2133767",
    "timestamp": "2025-09-22T15:56:20Z"
  },
  {
    "title": "Vladimir Putin Opens Russia's Eurovision Knockoff, 'Intervision,' Declaring Music Has 'No Borders'",
    "description": "Vietnamese performer Duc Phuc won the Moscow-hosted \"Intervision Song Contest\" this weekend, a revival of a Cold War-era alternative to the Eurovision Song Contest that strongman Vladimir Putin hailed as a display of \"respect for traditional values\" and \"dive…",
    "link": "https://www.breitbart.com/entertainment/2025/09/22/vladimir-putin-opens-russias-eurovision-knockoff-intervision-declaring-music-has-no-borders/",
    "timestamp": "2025-09-22T15:53:41Z"
  },
  {
    "title": "Bill Maher Lists Where Dems ‘F*ck Up’ and Trump Wins — Including ‘America-Hating’ Colleges",
    "description": "Bill Maher said he can quickly point to a list of topics the Democrats \"f*up up\" and President Trump nails, like his disdain for \"America-hating\" universities\nThe post Bill Maher Lists Where Dems ‘F*ck Up’ and Trump Wins — Including ‘America-Hating’ Colleges …",
    "link": "https://www.mediaite.com/media/bill-maher-lists-where-dems-fck-up-and-trump-wins-including-america-hating-colleges/",
    "timestamp": "2025-09-22T15:53:27Z"
  },
  {
    "title": "Charlie Kirk desperately wanted Elon Musk and Donald Trump back together. He succeeded - CNN",
    "description": "Charlie Kirk desperately wanted Elon Musk and Donald Trump back together. He succeededCNN Watch: Prayer, tears and a Trump-Musk handshake at Kirk memorialBBC Trump and Musk reunite at Charlie Kirk memorial : Live updatesThe Independent Charlie Kirk inspired T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179462520",
    "timestamp": "2025-09-22T15:53:08Z"
  },
  {
    "title": "West Point is violating the First Amendment with a crackdown on professors, lawsuit says",
    "description": "Tim Bakken filed the lawsuit and says he wants to protect free speech and academic freedom.",
    "link": "https://www.bostonherald.com/2025/09/22/west-point-professor-lawsuit/",
    "timestamp": "2025-09-22T15:51:04Z"
  },
  {
    "title": "WATCH: Tens of thousands attend Charlie Kirk memorial",
    "description": "Tens of thousands of people paid tribute to Charlie Kirk at his memorial on Sunday. Kirk was hailed a \"martyr\" by President Donald Trump and other leading conservative figures.",
    "link": "https://abcnews.go.com/Travel/video/tens-thousands-attend-charlie-kirk-memorial-125818105",
    "timestamp": "2025-09-22T15:49:51Z"
  },
  {
    "title": "US targets Brazilian justice’s wife with sanctions; will revoke more visas",
    "description": "Six officials will see their visas revoked following the sentencing of Trump ally Jair Bolsonaro.",
    "link": "https://www.aljazeera.com/news/2025/9/22/us-targets-brazilian-justices-wife-with-sanctions-will-revoke-more-visas",
    "timestamp": "2025-09-22T15:49:28Z"
  },
  {
    "title": "Trump saber-rattles at two countries, apparently giving up on his Nobel Peace Prize push",
    "description": "Apparently giving up on his Nobel Peace Prize campaign, Donald Trump left open the possible use of U.S. military force in Afghanistan and Venezuela.",
    "link": "https://biztoc.com/x/c16e967649a12399",
    "timestamp": "2025-09-22T15:48:49Z"
  },
  {
    "title": "Trump Admin Vows to 'Defend Every Inch of NATO' After Russian Violations",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nMike Waltz, President Donald Trump's new U.S. ambassador to the United Nations, delivered his first remarks before the Security Council on Monday after months of delays and procedural hurdles held up his confi…",
    "link": "https://biztoc.com/x/05132ab059a3978d",
    "timestamp": "2025-09-22T15:48:37Z"
  },
  {
    "title": "What we know about autism's causes",
    "description": "Brain experts say they already know there is no single cause.",
    "link": "https://www.ocregister.com/2025/09/22/autism-causes-explained/",
    "timestamp": "2025-09-22T15:48:32Z"
  },
  {
    "title": "Good Morning, News: Christian Nationalists Hold Memorial/Pep Rally, Lillard Thrills Fans, and Trump Won't Keep Portland's Name Out of His Mouth",
    "description": "by Wm. Steven Humphrey\n \n \n \n If you’re reading this, you probably know the value of the Mercury’s news reporting, arts and culture coverage, event calendar, and the bevy of events we host throughout the year. The work we do helps our city shine, but we can’t…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/09/22/48035953/good-morning-news-christian-nationalists-hold-memorialpep-rally-lillard-thrills-fans-and-trump-wont-keep-portlands-name-out-of-his-mout",
    "timestamp": "2025-09-22T15:48:00Z"
  },
  {
    "title": "Is Larry Ellison Building a MAGA Media Empire?",
    "description": "The 81-year-old Oracle founder could have influence or ownership control over CBS, CNN, HBO and TikTok if all goes his way.",
    "link": "https://www.newsweek.com/larry-ellison-building-maga-media-empire-2132633",
    "timestamp": "2025-09-22T15:47:46Z"
  },
  {
    "title": "India responds to US visa move ahead of trade talks",
    "description": "Indian Commerce Minister Piyush Goyal is in Washington this week for a new round of trade talks Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625073-india-us-visa-move-response/",
    "timestamp": "2025-09-22T15:47:14Z"
  },
  {
    "title": "What is ‘RaptureTok’? Exploring the hilarious end-of-the-world conspiracy taking over social media",
    "description": "TikTok trends come and go, but according to the latest viral movement, the world will end tomorrow, on Tuesday (23 September), which is very bad news if you were looking forward to Halloween or Wicked part II. So, do you want the tea about the end of times? B…",
    "link": "https://www.thepinknews.com/2025/09/22/rapture-tomorrow-rapturetok-tiktok/",
    "timestamp": "2025-09-22T15:46:12Z"
  },
  {
    "title": "Casino Workers Big Winners, Will Be Allowed To Deduct Tips From Taxes",
    "description": "New IRS guidance confirms casino workers can deduct up to $25,000 in annual tip income, including on chips.",
    "link": "https://www.casinoreports.com/casino-workers-deduct-taxes/",
    "timestamp": "2025-09-22T15:45:57Z"
  },
  {
    "title": "Trump Admin Vows to 'Defend Every Inch of NATO' After Russian Violations",
    "description": "U.N. Ambassador Mike Waltz spoke during an emergency session of the council on Russia's recent incursion into Estonian airspace.",
    "link": "https://www.newsweek.com/nato-russia-airspace-violation-poland-estonian-mike-waltz-2133778",
    "timestamp": "2025-09-22T15:45:37Z"
  },
  {
    "title": "Venezuela Sends Letter Asking for Talks While Training Civilians to Shoot Trump",
    "description": "Socialist dictator of Venezuela Nicolás Maduro sent a letter to President Donald Trump claiming that he wishes to engage in \"direct conversations\" with the U.S. amid rising tensions between both countries, Vice President Delcy Rodríguez revealed on Sunday.\nTh…",
    "link": "https://www.breitbart.com/latin-america/2025/09/22/venezuela-sends-letter-asking-for-talks-while-training-civilians-to-shoot-trump/",
    "timestamp": "2025-09-22T15:45:14Z"
  },
  {
    "title": "GOP's Jack Ciattarelli Edges Out Democrat Mikie Sherrill in New Jersey Poll",
    "description": "A new poll gave the Republican candidate a one-point lead as Election Day approaches.",
    "link": "https://www.newsweek.com/jack-ciattarelli-edges-out-mikie-sherrill-new-jersey-poll-2133715",
    "timestamp": "2025-09-22T15:44:36Z"
  },
  {
    "title": "What is Putin proposing to Trump on nuclear weapons?",
    "description": "Russia has proposed to the United States a one-year extension of the New START treaty, the last remaining nuclear arms agreement between the two nations. This proposal aims to prevent a further strategic arms race and maintain predictability, contingent on U.…",
    "link": "https://economictimes.indiatimes.com/news/defence/what-is-putin-proposing-to-trump-on-nuclear-weapons/articleshow/124052853.cms",
    "timestamp": "2025-09-22T15:44:18Z"
  },
  {
    "title": "What we know about autism’s causes",
    "description": "Brain experts say they already know there is no single cause.",
    "link": "https://www.bostonherald.com/2025/09/22/autism-causes-explained/",
    "timestamp": "2025-09-22T15:43:55Z"
  },
  {
    "title": "Ahead of His U.N. Speech, Remember That Trump Is Learning Geopolitics in Real Time",
    "description": "A guide to pushing the U.S. president more quickly up his learning curve.",
    "link": "http://foreignpolicy.com/2025/09/22/trump-geopolitics-un-russia-gaza-diplomacy-international-relations/",
    "timestamp": "2025-09-22T15:43:30Z"
  },
  {
    "title": "“Time of Whatever”: Trump Has Wild Comment on Charlie Kirk Service",
    "description": "President Donald Trump delivered incoherent remarks as he departed for the memorial of Charlie Kirk, claiming the event would be a “time of whatever.”Trump told reporters outside the White House that he was going to “celebrate the life of a great man today. R…",
    "link": "https://newrepublic.com/post/200745/donald-trump-charlie-kirk-memorial-whatever",
    "timestamp": "2025-09-22T15:43:29Z"
  },
  {
    "title": "Curbing cryptos",
    "description": "Trade in crypto futures and options must be taxed",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/curbing-cryptos/article70076695.ece",
    "timestamp": "2025-09-22T15:43:07Z"
  },
  {
    "title": "Using Boycotts to Defend Free Speech: This Is Larger Than Jimmy Kimmel",
    "description": "How can we effectively push back on the Jimmy Kimmel suspension, and its larger threats to free speech? After Charlie Kirk’s shooting, Kimmel posted\r\n, “Can we just for one day agree that it is horrible and monstrous to shoot another human?” And sent his fami…",
    "link": "https://www.commondreams.org/opinion/boycott-for-jimmy-kimmel",
    "timestamp": "2025-09-22T15:43:03Z"
  },
  {
    "title": "North Korea’s Kim Has ‘Good Memories’ of Trump, Is Ready to Discuss Everything Except Nukes",
    "description": "North Korea's Kim Jong-un says he has “good personal memories” of talks with President Trump, but will not discuss denuclearization.\nThe post North Korea’s Kim Has ‘Good Memories’ of Trump, Is Ready to Discuss Everything Except Nukes appeared first on Breitba…",
    "link": "https://www.breitbart.com/asia/2025/09/22/north-koreas-kim-has-good-memories-trump-ready-discuss-everything-except-nukes/",
    "timestamp": "2025-09-22T15:42:27Z"
  },
  {
    "title": "West Point is violating the First Amendment with a crackdown on professors, lawsuit says",
    "description": "The U.S. Military Academy at West Point is banning opinions by professors in the classroom and some books and courses in a crackdown that violates the First ...",
    "link": "https://www.yahoo.com/news/articles/west-point-violating-first-amendment-154136178.html",
    "timestamp": "2025-09-22T15:41:36Z"
  },
  {
    "title": "Charlie Kirk Memorial: Donald Trump Blasts Jimmy Kimmel ‘I Hate My Opponents’, Renews Bromance With Elon Musk",
    "description": "Charlie Kirk’s life was supposed to be celebrated by conservative sycophants yesterday at State Farm Stadium in Glendale, Arizona but President Donald Trump turned the memorial into the type of spectacle that would make the WWE embarrassed. An intro of firewo…",
    "link": "https://bossip.com/3902596/donald-trump-blasts-jimmy-kimmel-at-charlie-kirk-memorial/",
    "timestamp": "2025-09-22T15:41:22Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
    "description": "Indian markets ended lower as IT stocks slumped after the U.S. raised H-1B visa costs to $100,000. Analysts say the correction is healthy, with Nifty support at 25,050 and consumption-focused sectors expected to drive medium-term gains.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/124052827.cms",
    "timestamp": "2025-09-22T15:41:04Z"
  },
  {
    "title": "When will Trump announce Tylenol-autism link? Can leucovorin decrease its symptoms?",
    "description": "Donald Trump is expected to announce a possible link between Tylenol and autism. The announcement is scheduled after a press briefing by Karoline Leavitt. Federal health officials are expected to warn pregnant women against using Tylenol unless they have a fe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-when-will-trump-announce-tylenol-autism-link-can-leucovorin-decrease-its-symptoms/articleshow/124052743.cms",
    "timestamp": "2025-09-22T15:40:10Z"
  },
  {
    "title": "FBI Director Patel Promises to ‘Pursue Every Lead’ in Kirk Assassination",
    "description": "The FBI will be pursuing every lead to get the bottom of what led to the killing of Turning Point USA co-founder Charlie Kirk by... Read More\nThe post FBI Director Patel Promises to ‘Pursue Every Lead’ in Kirk Assassination appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/22/fbi-director-patel-promises-pursue-every-lead-in-kirk-assassination/",
    "timestamp": "2025-09-22T15:40:00Z"
  },
  {
    "title": "Trump Administration to Announce Two Potential Causes of Autism: Report",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. predicted in April that his agency would have a report on autism by this month.",
    "link": "https://www.westernjournal.com/trump-administration-announce-two-potential-causes-autism-report/",
    "timestamp": "2025-09-22T15:39:31Z"
  },
  {
    "title": "How soon will crypto creep into your 401(k)? New rules being explored now",
    "description": "Investors could get access to cryptocurrency, private equity and other alternative investments in retirement plans, thanks to a Trump executive order.",
    "link": "https://www.usatoday.com/story/money/personalfinance/retirement/2025/09/22/401k-options-including-bitcoin/86291758007/",
    "timestamp": "2025-09-22T15:37:50Z"
  },
  {
    "title": "The Weekend Panic Is Over, But H-1B Workers Aren't Done Worrying",
    "description": "Indian engineers make up the majority of H-1B holders, accounting for more than 70 percent of beneficiaries last year.",
    "link": "https://www.ibtimes.com/weekend-panic-over-h-1b-workers-arent-done-worrying-3784150",
    "timestamp": "2025-09-22T15:36:51Z"
  },
  {
    "title": "Fox News Host Claims God Urged Her To Get Closer To Charlie Kirk Days Before He Died",
    "description": "Fox News host Maria Bartiromo insisted that God urged her to get closer to Charlie Kirk in the days before he died.\n\n\nIn a Sunday interview with Bartiromo, Sen. Ted Cruz (R-TX) argued that \"the Gospel of Jesus Christ will be spread today to a bigger audience …",
    "link": "https://crooksandliars.com/2025/09/fox-news-host-claims-god-urged-her-get",
    "timestamp": "2025-09-22T15:35:49Z"
  },
  {
    "title": "A Scandal Covered in Tahini (The Bulwark)",
    "description": "The Bulwark:\nA Scandal Covered in Tahini  —  Plus: Both hatred and grace at Charlie Kirk's memorial.  —  Donald Trump fires a federal prosecutor for not persecuting his opponents quickly enough, then posts a public message to his attorney general telling her …",
    "link": "https://www.memeorandum.com/250922/p49",
    "timestamp": "2025-09-22T15:35:00Z"
  },
  {
    "title": "Trump team poised to link popular meds with autism risk – WaPo",
    "description": "The White House is expected to highlight a drug as a potential treatment, the outlet has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625049-tylenol-autism-kids/",
    "timestamp": "2025-09-22T15:34:47Z"
  },
  {
    "title": "Tom Hanks & Meryl Streep Among 400+ Signing ACLU Letter Following Jimmy Kimmel Suspension: “This Is The Moment To Defend Free Speech”",
    "description": "Tom Hanks, Meryl Streep, Ben Affleck, Ben Stiller and Lin-Manuel Miranda are among the more than 400 artists to sign on to an ACLU letter calling out “government threats to our freedom of speech” in the aftermath of ABC’s decision to suspend Jimmy Kimmel. “Ef…",
    "link": "http://deadline.com/2025/09/jimmy-kimmel-aclu-letter-tom-hanks-meryl-streep-1236552366/",
    "timestamp": "2025-09-22T15:34:31Z"
  },
  {
    "title": "EU must be ready to fight Russia over Ukraine – Finland",
    "description": "If the West gives Ukraine security guarantees, they must carry weight and deter Russia, Finnish President Alexander Stubb says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625067-stubb-eu-fight-russia/",
    "timestamp": "2025-09-22T15:33:06Z"
  },
  {
    "title": "GOP Senators Criticize FCC's Threats Against ABC And Jimmy Kimmel",
    "description": "Sen. Rand Paul (R-Ky.) called Federal Communications Commission threats against ABC and late-night show host Jimmy Kimmel \"absolutely inappropriate.\"",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-carr-fcc_n_68d15e22e4b03fb4d93333ff",
    "timestamp": "2025-09-22T15:31:34Z"
  },
  {
    "title": "CNN’s Pamela Brown Asks Hakeem Jeffries If He Is ‘Undermining’ Supreme Court After Shaming Conservative Justices",
    "description": "CNN anchor Pamela Brown pressed House Minority Leader Hakeem Jeffries during a Monday segment on whether he was \"undermining faith\" in the Supreme Court.",
    "link": "https://dailycaller.com/2025/09/22/cnn-pamela-brown-hakeem-jeffreis-supreme-court/",
    "timestamp": "2025-09-22T15:30:23Z"
  },
  {
    "title": "One of Silicon Valley’s most prominent Democrats just called Trump’s $100k H1-B visa fee a ‘great solution’",
    "description": "Other tech leaders, like Elon Musk, have said they will ‘go to war’ to defend the program.",
    "link": "https://fortune.com/2025/09/22/reed-hastings-democratic-megadonor-supports-trump-h1b-visa-policy/",
    "timestamp": "2025-09-22T15:30:03Z"
  },
  {
    "title": "Peter Schiff Slams Republicans For Wanting To 'Gift' Tariff Revenue Back To Taxpayers, Calls It 'One Of The Dumbest Ideas'",
    "description": "",
    "link": "https://www.benzinga.com/news/topics/25/09/47787580/peter-schiff-slams-republicans-for-wanting-to-gift-tariff-revenue-back-to-taxpayers-calls-it-one-of-the-dumbest-ideas",
    "timestamp": "2025-09-22T15:29:46Z"
  },
  {
    "title": "After forcing out disobedient prosecutor, Trump’s new nominee makes matters worse",
    "description": "Lindsey Halligan, Karoline Leavitt, Steve Witkoff and President Donald Trump attend the Men's Singles Final on Day 15 of the 2025 US Open Tennis Championships at the USTA Billie Jean King National Tennis Center on September 07, 2025 in Flushing Meadows, Queen…",
    "link": "https://biztoc.com/x/444926ff77899750",
    "timestamp": "2025-09-22T15:26:27Z"
  },
  {
    "title": "The 5 most emotional moments of the Charlie Kirk memorial: From widow’s tearful message to Trump’s impassioned speech",
    "description": "Some 200,000 people gathered in Glendale, Arizona, on Sunday to pay tribute to slain conservative activist Charlie Kirk, who was fatally shot during a Turning Point USA tour event earlier this month.",
    "link": "https://nypost.com/2025/09/22/us-news/the-five-most-emotional-moments-of-the-charlie-kirk-memorial-from-widows-tearful-message-to-trumps-impassioned-speech/",
    "timestamp": "2025-09-22T15:26:06Z"
  },
  {
    "title": "Trump saber-rattles at two countries, apparently giving up on his Nobel Peace Prize push",
    "description": "Apparently giving up on his Nobel Peace Prize campaign, Donald Trump left open the possible use of U.S. military force in Afghanistan and Venezuela.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-saber-rattles-two-countries-apparently-giving-nobel-peace-prize-rcna232935",
    "timestamp": "2025-09-22T15:24:40Z"
  },
  {
    "title": "Oracle will manage TikTok algorithm for US users under Trump deal",
    "description": "A senior official in President Donald Trump’s administration says Oracle will receive a copy of TikTok's algorithm to operate for U.S. users. The decision addresses U.S. national security concerns over the China-based social media platform. The algorithm reco…",
    "link": "https://apnews.com/article/trump-tiktok-china-d5d8a1d56b5185778536874d7fc1ee62",
    "timestamp": "2025-09-22T15:23:53Z"
  },
  {
    "title": "Stocks rise, dollar falls as investors assess mixed Fed messages",
    "description": "NEW YORK/LONDON :MSCI's global stock index rose on Monday with a few U.S. tecnology stocks leading the charge while gold prices rallied sharply and the dollar pulled back, with Federal Reserve officials giving mixed messages about future interest rate cuts.In…",
    "link": "https://www.channelnewsasia.com/business/stocks-rise-dollar-falls-investors-assess-mixed-fed-messages-5361061",
    "timestamp": "2025-09-22T15:23:09Z"
  },
  {
    "title": "Stocks take a breath, dollar falls after Trump visa crackdown and ahead of Fed commentary",
    "description": "NEW YORK/LONDON :MSCI's global stock index was edging higher and the dollar fell along with Treasury yields as investors digested U.S. President Donald Trump's latest visa restrictions and waited for economic data and commentary from Federal Reserve officials…",
    "link": "https://www.channelnewsasia.com/business/stocks-take-breath-dollar-falls-after-trump-visa-crackdown-and-ahead-fed-commentary-5361061",
    "timestamp": "2025-09-22T15:23:09Z"
  },
  {
    "title": "US Banks to Lean on India Hubs After Trump Imposes Visa Fees",
    "description": "Wall Street banks are set to rely more on their Indian business support centers following President Donald Trump’s shock move to impose $100,000 fees on new applications to the widely used H-1B visa program.",
    "link": "https://www.livemint.com/companies/news/us-banks-to-lean-on-india-hubs-after-trump-imposes-visa-fees-11758554580350.html",
    "timestamp": "2025-09-22T15:22:59Z"
  },
  {
    "title": "Trump’s Immigration Overhaul Of H-1B, EB-5 To Spark Legal Firestorm",
    "description": "President Trump's recent immigration decrees dealing with a $ 100,000 fee for new H1B visa applicants and a $ 1 million Gold Card for investors may falter. Here's why.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/09/22/trumps-immigration-overhaul-of-h-1b-eb-5-to-spark-legal-firestorm/",
    "timestamp": "2025-09-22T15:22:04Z"
  },
  {
    "title": "Trump Autism Announcement With RFK Jr.: Updates About Tylenol Findings & More",
    "description": "The president said he and his Health and Human Services Secretary, RFK Jr., will share new findings about autism.",
    "link": "https://hollywoodlife.com/2025/09/22/trump-autism-announcement-updates/",
    "timestamp": "2025-09-22T15:20:15Z"
  },
  {
    "title": "Poland Pledges to Shoot Down Threatening Objects Following Russian Violation of NATO Airspace",
    "description": "In a clear warning to Russia, Poland says it will shoot down objects that violate Polish airspace and pose a threat to the nation. Polish... Read More\nThe post Poland Pledges to Shoot Down Threatening Objects Following Russian Violation of NATO Airspace appea…",
    "link": "https://www.dailysignal.com/2025/09/22/poland-pledges-shoot-down-threatening-objects-following-russian-violation-nato-airspace/",
    "timestamp": "2025-09-22T15:20:00Z"
  },
  {
    "title": "TikTok’s algorithm will be controlled by Oracle in the US after the sale is completed | CNN Business",
    "description": "The White House has answered what had been one of the major outstanding questions regarding its pending deal to transfer TikTok’s US operations to a majority American ownership group: Under the agreement, the app’s algorithm will be operated in the United Sta…",
    "link": "https://www.cnn.com/2025/09/22/tech/tiktok-sale-oracle-algorithm",
    "timestamp": "2025-09-22T15:19:39Z"
  },
  {
    "title": "Trump Gold Card Visa’s ‘Admission Of Failure’: Gets 80% Price Cut",
    "description": "The Trump Gold Card Visa officially launched Friday for $1 million—80% less than the previously touted $5 million price tag—a sign that demand was far lower than the Trump administration previously claimed.",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/09/22/trump-gold-card-visa-failure-price-cut/",
    "timestamp": "2025-09-22T15:18:49Z"
  },
  {
    "title": "How will Israel react to growing recognition of a Palestinian state?",
    "description": "Calls from far-right politicians to annex parts of West Bank would deepen Israel’s diplomatic isolation",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/22/how-will-israel-react-to-growing-recognition-of-a-palestinian-state/",
    "timestamp": "2025-09-22T15:17:49Z"
  },
  {
    "title": "Megyn Kelly Defends Declaring ‘We DO NOT CARE’ About Tom Homan Corruption Allegations",
    "description": "“So no, we don’t care what you say about Tom Homan. We do not trust you. We only care about defeating you,” Kelly fumed online\nThe post Megyn Kelly Defends Declaring ‘We DO NOT CARE’ About Tom Homan Corruption Allegations first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/megyn-kelly-defends-declaring-we-do-not-care-about-tom-homan-corruption-allegations/",
    "timestamp": "2025-09-22T15:16:45Z"
  },
  {
    "title": "Tariffs Business Sentiment Polls, July 2025 Strategic Intelligence Report",
    "description": "Opportunities emerge for businesses as they adapt to Trump's new reciprocal tariff framework, with some optimism seen due to recent trade deals. Despite overall negative sentiment, strategic navigation of tariffs presents potential for growth in disrupted sup…",
    "link": "https://www.globenewswire.com/news-release/2025/09/22/3154102/28124/en/Tariffs-Business-Sentiment-Polls-July-2025-Strategic-Intelligence-Report.html",
    "timestamp": "2025-09-22T15:16:00Z"
  },
  {
    "title": "There's a new, brutal scam in the labor market that's got job seekers down",
    "description": "Scammers are targeting job seekers in an increasingly difficult labor market, costing them thousands and leaving them feeling ashamed.",
    "link": "https://www.businessinsider.com/job-seekers-scam-networking-opportunities-labor-market-2025-9",
    "timestamp": "2025-09-22T15:15:31Z"
  },
  {
    "title": "Jimmy Kimmel’s cousin says there are more ‘bombshells’ to come after shock axing",
    "description": "Kimmel’s cousin Sal Iacono is a longtime collaborator with the embattled late-night host",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-canceled-new-career-b2831363.html",
    "timestamp": "2025-09-22T15:15:23Z"
  },
  {
    "title": "Trump DOJ shut bribery case against ally Homan",
    "description": "What happened\nThe Justice Department suspended and then closed a bribery investigation into President Donald Trump’s border czar, Tom Homan, that was launched after undercover FBI agents recorded him accepting a $50,000 bag of cash while promising future immi…",
    "link": "https://biztoc.com/x/c8d869ecb2a512b0",
    "timestamp": "2025-09-22T15:15:10Z"
  },
  {
    "title": "Trump: Charlie Kirk Was A ‘Giant’ Of His Generation",
    "description": "By Jarrett Stepman, The Daily Signal | September 21, 2025\n“Today, America is a nation in grief, a nation in shock, and a nation in mourning.”\nThat was how President Donald Trump began is remarks at the massive Arizona funeral for Charlie Kirk, which according…",
    "link": "https://biztoc.com/x/feac0ecb7089fe24",
    "timestamp": "2025-09-22T15:15:05Z"
  },
  {
    "title": "Charlie Kirk honored as ‘martyr’ at memorial rally",
    "description": "What happened\nTens of thousands of people gathered at State Farm Stadium in Glendale, Arizona, Sunday for a memorial service for slain conservative activist Charlie Kirk. The speakers included President Donald Trump and many of his administration’s top offici…",
    "link": "https://biztoc.com/x/02dafb7d068e3f71",
    "timestamp": "2025-09-22T15:15:03Z"
  },
  {
    "title": "Trump Has Constitutional Authority To Battle Washington Crime",
    "description": "By Thomas Jipping & Hans von Spakovsky via The Daily Signal | September 22, 2025\nPeople can disagree about whether President Donald Trump had to send the National Guard to help fight crime in the nation’s capital, but it seems to have already reduced crime ra…",
    "link": "https://biztoc.com/x/b7bf64cba985fb5d",
    "timestamp": "2025-09-22T15:14:59Z"
  },
  {
    "title": "Trump to sign order approving terms of TikTok deal, White House official says",
    "description": "U.S. President Donald Trump will sign an executive order later this week that declares that a deal to divest TikTok’s U.S. operations from its Chinese owner ByteDance will meet requirements set out in a 2024 law, a White House official said on Monday.\nThe Uni…",
    "link": "https://biztoc.com/x/27ab4a377d560a01",
    "timestamp": "2025-09-22T15:14:56Z"
  },
  {
    "title": "Internet blames MBA Chai Wala for H-1B fee hike, sparks memes; but why?",
    "description": "The H-1B visa now costs more. Donald Trump introduced a $100,000 annual fee. This affects tech professionals and companies. Prafull Billore, known as MBA Chai Wala, visited the US. His trip coincided with the fee increase. Social media users joked about a con…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/internet-blames-mba-chai-wala-for-h-1b-fee-hike-sparks-memes-but-why/articleshow/124052330.cms",
    "timestamp": "2025-09-22T15:14:26Z"
  },
  {
    "title": "Donald Trump Jr. Delivers Spot-On Impression of Dad During Charlie Kirk Memorial Speech",
    "description": "Donald Trump Jr. lightened the mood at the memorial for slain conservative activist Charlie Kirk by performing an impression of his dad, President Donald Trump.\nThe post Donald Trump Jr. Delivers Spot-On Impression of Dad During Charlie Kirk Memorial Speech f…",
    "link": "https://www.mediaite.com/media/news/donald-trump-jr-delivers-spot-on-impression-of-dad-during-charlie-kirk-memorial-speech/",
    "timestamp": "2025-09-22T15:12:11Z"
  },
  {
    "title": "Donald Trump pushes World Bank to finance more fossil fuel development",
    "description": "Trump is pressuring the World Bank to fund more fossil fuel projects as part of a backlash against efforts to tackle climate change. Read on",
    "link": "https://financialpost.com/financial-times/trump-pushes-world-bank-finance-fossil-fuel",
    "timestamp": "2025-09-22T15:11:49Z"
  },
  {
    "title": "Whoopi Goldberg and ‘The View’ Hosts Finally Slam Jimmy Kimmel’s Suspension: ‘No One Silences Us’ and the ‘Government Cannot Force Someone to Be Silenced’",
    "description": "After two episodes of staying silent on the matter, Whoopi Goldberg and her co-hosts on ABC’s “The View” have finally commented on Jimmy Kimmel’s suspension by the network. Fans had been theorizing amid their silence that the hosts were instructed by their pa…",
    "link": "https://variety.com/2025/tv/news/whoopi-goldberg-the-view-slam-jimmy-kimmel-suspension-1236526008/",
    "timestamp": "2025-09-22T15:11:22Z"
  },
  {
    "title": "US banks to lean on India hubs after Trump imposes visa fees",
    "description": "Donald Trump's new H-1B visa fees may push Wall Street banks to expand in India. Citigroup, JPMorgan, and Goldman Sachs already use Indian centers for various operations. Analysts predict increased investment in Indian tech hubs like Mumbai and Bengaluru. Res…",
    "link": "https://economictimes.indiatimes.com/jobs/hr-policies-trends/us-banks-to-lean-on-india-hubs-after-trump-imposes-visa-fees/articleshow/124052204.cms",
    "timestamp": "2025-09-22T15:11:09Z"
  },
  {
    "title": "Here’s How Much Richer Trump’s Family Has Gotten in Less Than One Year",
    "description": "A new Forbes report reveals that the Trump family has profited enormously from the presidency, doubling its fortune to a total of about $10 billion.For Donald Trump, the year of his White House comeback has also been “the most lucrative year of his life,” wit…",
    "link": "https://newrepublic.com/post/200742/how-much-richer-trump-family-one-year-president",
    "timestamp": "2025-09-22T15:10:51Z"
  },
  {
    "title": "Rural health clinics are closing after Trump’s ‘One Big Beautiful Bill,’ raising the legislation’s political risks",
    "description": "Exactly two months after President Donald Trump signed his policy megabill in a July 4 celebration at the White House, a Virginia health care company blamed the law for the",
    "link": "https://www.wqow.com/news/national/rural-health-clinics-are-closing-after-trump-s-one-big-beautiful-bill-raising-the-legislation/article_ded031fe-fb80-5054-9918-77aab80e279e.html",
    "timestamp": "2025-09-22T15:08:52Z"
  },
  {
    "title": "SpaceX Now Causing NASA to Lose Space Race to China, Experts Say",
    "description": "Is SpaceX squandering America's lead in space?\nThe post SpaceX Now Causing NASA to Lose Space Race to China, Experts Say appeared first on Futurism.",
    "link": "https://futurism.com/space/spacex-nasa-losing-space-race-china",
    "timestamp": "2025-09-22T15:08:28Z"
  },
  {
    "title": "Kamala Harris Confirms Report That Rob Reiner Yelled at Doug Emhoff",
    "description": "Did Rob Reiner yell at Doug Emhoff following Joe Biden's disastrous debate performance? He denies the reporting, but Kamala Harris has weighed in.\nThe post Kamala Harris Confirms Report That Rob Reiner Yelled at Doug Emhoff first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/kamala-harris-confirms-report-that-rob-reiner-yelled-at-doug-emhoff/",
    "timestamp": "2025-09-22T15:07:34Z"
  },
  {
    "title": "Fact check: Who protested outside Charlie Kirk's funeral?",
    "description": "A viral video showing a small protest outside Charlie Kirk's funeral sparked a wave of false claims online about who the demonstrators were.",
    "link": "https://www.dw.com/en/fact-check-who-protested-outside-charlie-kirks-funeral/a-74094609",
    "timestamp": "2025-09-22T15:07:00Z"
  },
  {
    "title": "Howard Stern slams ‘ridiculous’ ABC for suspending Jimmy Kimmel over Charlie Kirk comments: ‘Out of control’",
    "description": "“As you know, ABC threw Jimmy off the air. I don’t know what their plan is, but it looks like they might be firing [him],” the radio host said on “The Howard Stern Show.&#82…",
    "link": "https://pagesix.com/2025/09/22/celebrity-news/howard-stern-slams-abc-for-suspending-jimmy-kimmel-over-charlie-kirk-comments/",
    "timestamp": "2025-09-22T15:06:32Z"
  },
  {
    "title": "Trump And Erika Kirk Both Played Their Roles Perfectly During Memorial",
    "description": "At Charlie Kirk’s memorial Sunday, President Donald Trump and Erika Kirk delivered divergent messages about forgiveness and hatred of enemies.",
    "link": "https://dailycaller.com/2025/09/22/donald-trump-erika-kirk-charlie-forgiveness-hatred-speech-memorial-turning-point/",
    "timestamp": "2025-09-22T15:06:00Z"
  },
  {
    "title": "Cubs Rookie Matt Shaw Misses Sunday's Game To Attend Charlie Kirk Memorial",
    "description": "Chicago Cubs rookie Matt Shaw was M.I.A. from the lineup on Sunday -- a 1-0 loss to the Reds -- the third baseman reportedly attended Charlie Kirk's memorial service in Arizona. Cubs manager Craig Counsell told reporters postgame that Shaw was…\n Permalink",
    "link": "https://www.tmz.com/2025/09/22/cubs-matt-shaw-attends-charlie-kirk-memorial/",
    "timestamp": "2025-09-22T15:05:54Z"
  },
  {
    "title": "John Oliver Slams ABC, Bob Iger Over Jimmy Kimmel Suspension",
    "description": "John Oliver minced no words reacting to the suspension of Jimmy Kimmel's late-night TV show by ABC on \"Last Week Tonight\" ... calling ABC and Disney CEO Bob Iger a bunch of \"cowards.\" Check out the clip from Sunday's show -- he rails at Bob when…\n Permalink",
    "link": "https://www.tmz.com/2025/09/22/john-oliver-reacts-abc-bob-iger-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-22T15:05:31Z"
  },
  {
    "title": "EU and Trump could work together to end Gaza war - Harris",
    "description": "The Tánaiste and Minister for Foreign Affairs has said that the EU and President Trump could both work to put pressure on Israel to end the war in Gaza.",
    "link": "https://www.rte.ie/news/2025/0922/1534736-harris-eu-trump/",
    "timestamp": "2025-09-22T15:05:01Z"
  },
  {
    "title": "TikTok deal won't include 'golden share' or equity for U.S., Trump administration says",
    "description": "President Donald Trump has secured a golden share in U.S. Steel and taken an equity stake in Intel.",
    "link": "https://www.cnbc.com/2025/09/22/tiktok-golden-share-equity-trump.html",
    "timestamp": "2025-09-22T15:04:41Z"
  },
  {
    "title": "Oracle will manage TikTok’s algorithm for US users under Trump administration deal",
    "description": "By CHRIS MEGERIAN, Associated Press\nWASHINGTON (AP) — Tech giant Oracle will receive a copy of TikTok’s algorithm to operate for U.S. users, according to a senior official in President Donald Trump’s administration on Monday.\nDetermining next steps for the al…",
    "link": "https://biztoc.com/x/c02a569df149d7ad",
    "timestamp": "2025-09-22T15:03:52Z"
  },
  {
    "title": "Nvidia Slips With Future In China Market Still Uncertain After Trump-Xi Call. Is Nvidia A Buy Or Sell Now?",
    "description": "slipped early Monday as talks between the U.S. and China were set to continue. On Friday, President Donald Trump and President Xi Jinping of China had a phone conversation and agreed to more talks in October, Barron's reported. Is Nvidia stock a buy or sell n…",
    "link": "https://biztoc.com/x/2a48bfb20a84ab04",
    "timestamp": "2025-09-22T15:03:42Z"
  },
  {
    "title": "TikTok deal won't include 'golden share' or equity for U.S., Trump administration says",
    "description": "President Donald Trump has secured a golden share in U.S. Steel and taken an equity stake in Intel.",
    "link": "https://biztoc.com/x/8cfe23fecf490f84",
    "timestamp": "2025-09-22T15:03:39Z"
  },
  {
    "title": "Brazil's Authoritarian Socialist President Lula Arrives in NYC to Challenge Trump",
    "description": "Socialist President Luiz Inácio Lula da Silva of Brazil arrived in New York to open the U.N. General Assembly's annual \"high-level debate.\"\nThe post Brazil’s Authoritarian Socialist President Lula Arrives in NYC to Challenge Trump appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/09/22/brazils-authoritarian-socialist-president-lula-arrives-nyc-challenge-trump/",
    "timestamp": "2025-09-22T15:02:54Z"
  },
  {
    "title": "Argentina markets soar after US' Bessent pledges support",
    "description": "NEW YORK (Reuters) -Argentine financial assets rallied on Monday, with U.S.-traded stocks up over 10%, international dollar bonds up more than 6 cents and...",
    "link": "https://finance.yahoo.com/news/argentina-markets-soar-us-bessent-150208816.html",
    "timestamp": "2025-09-22T15:02:08Z"
  },
  {
    "title": "Tom Hanks, Jennifer Aniston, Lin-Manuel Miranda Among 400 Artists to Slam Jimmy Kimmel Suspension in ACLU Open Letter",
    "description": "The government threatening the livelihoods of journalists, talk show hosts, artists, creatives, and entertainers \"runs counter to the values our nation was built upon, and our Constitution guarantees,\" the letter states\nThe post Tom Hanks, Jennifer Aniston, L…",
    "link": "https://www.thewrap.com/tom-hanks-jennifer-aniston-jimmy-kimmel-suspension-open-letter-aclu/",
    "timestamp": "2025-09-22T15:01:43Z"
  },
  {
    "title": "Russia and Ukraine trade deadly drone strikes on civilian areas as Zelenskyy anticipates intense diplomacy at UN",
    "description": "European countries have rebuked Russia for provocations including drones landing in Poland.",
    "link": "https://www.pbs.org/newshour/world/russia-and-ukraine-trade-deadly-drone-strikes-on-civilian-areas-as-zelenskyy-anticipates-intense-diplomacy-at-un",
    "timestamp": "2025-09-22T15:01:07Z"
  },
  {
    "title": "Oliver Darcy Status Hires New Reporters Brian Lowry Natalie Korach",
    "description": "The writers join from Vanity Fair and The Wrap, with Darcy also working with Stacey Farish on advertising and sponsorship opportunities.",
    "link": "http://www.hollywoodreporter.com/business/digital/oliver-darcy-status-hires-brian-lowry-natalie-korach-1236375923/",
    "timestamp": "2025-09-22T15:00:52Z"
  },
  {
    "title": "Trump to Award Ben Carson With Presidential Medal of Freedom",
    "description": "Carson deserves this award and so much more.\nThe post Trump to Award Ben Carson With Presidential Medal of Freedom first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/trump-to-award-ben-carson-with-presidential-medal-of-freedom/",
    "timestamp": "2025-09-22T15:00:42Z"
  },
  {
    "title": "Trump Majorly Plays Dumb About Tom Homan Bribery Case",
    "description": "President Donald Trump appeared to feign ignorance over the weekend about shutting down a bribery investigation into White House border czar Tom Homan.Speaking to reporters Saturday, Trump was asked about a MSNBC report that the Department of Justice had drop…",
    "link": "https://newrepublic.com/post/200739/donald-trump-plays-dumb-tom-homan-bribery",
    "timestamp": "2025-09-22T15:00:34Z"
  },
  {
    "title": "Donald Trump Goes on Bizarre Vaccine Rant About Babies and Horses (Cameron Adams/The Daily Beast)",
    "description": "Cameron Adams / The Daily Beast:\nDonald Trump Goes on Bizarre Vaccine Rant About Babies and Horses  —  GIDDY UP  —  The president got medical ahead of his major autism announcement.  —  President Donald Trump unleashed a surreal rant about children being inje…",
    "link": "https://www.memeorandum.com/250922/p43",
    "timestamp": "2025-09-22T15:00:25Z"
  },
  {
    "title": "Turning Point USA Raised $389 Million Under Charlie Kirk—Including $13.1 Million From A Texas Foundation Overlooked Until Now",
    "description": "IRS filings show the Wayne Duddlesten Foundation was Turning Point USA’s largest direct donor, surpassing contributions from foundations linked to billionaires like Bernie Marcus, Charles Johnson and Jimmy John Liautaud.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/09/22/turning-point-usa-charlie-kirk-donors-texas-foundation/",
    "timestamp": "2025-09-22T15:00:21Z"
  }
]