[
  {
    "title": "Former Air Force Secretary: If You Are Not Alarmed by Gen. Timothy Haugh's Removal, You Should Be | Opinion",
    "description": "The move to install leadership loyal to President Donald Trump personally at NSA and CYBERCOM is one more disturbing part of the Trump administration's pattern of abuse of power, coercion, and disregard for the rule of law.",
    "link": "https://www.newsweek.com/former-air-force-secretary-if-you-are-not-alarmed-gen-timothy-haughs-removal-you-should-2058170",
    "timestamp": "2025-04-10T17:46:05Z"
  },
  {
    "title": "Apple has few incentives to start making iPhones in US, despite Trump's trade war with China",
    "description": "Despite Trump's tariffs aiming to push Apple to manufacture iPhones in the U.S., experts say it's unlikely due to high costs, complex supply chains, and labor challenges. Shifting production could triple iPhone prices, hurt sales, and isn’t feasible before at…",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-has-few-incentives-to-start-making-iphones-in-us-despite-trumps-trade-war-with-china/articleshow/120172618.cms",
    "timestamp": "2025-04-10T17:44:16Z"
  },
  {
    "title": "Inside Trump’s decision to pause most tariffs — and turn up heat on China — to lock in better trade deals for US",
    "description": "The idea of scaling back eye-watering \"reciprocal\" tariffs rattled around President Trump's head for several days after the April 2 \"Liberation Day\" announcement.",
    "link": "https://nypost.com/2025/04/10/us-news/how-trump-decided-to-pause-most-tariffs-and-turn-up-heat-on-china/",
    "timestamp": "2025-04-10T17:44:11Z"
  },
  {
    "title": "How To Defend Democracy with Color Revolutions",
    "description": "Translating demoralization agent Norm Eisen's doublespeak in \"Democracy Playbook 2025\" - why did Chief Justice John Roberts spend a week living with him? Comrades: Norm Eisen is orchestrating color revolutions in plain sight. In January, he published \"Democra…",
    "link": "https://freerepublic.com/focus/f-chat/4310209/posts",
    "timestamp": "2025-04-10T17:43:45Z"
  },
  {
    "title": "nCino, Inc. (NCNO): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where nCino...",
    "link": "https://finance.yahoo.com/news/ncino-inc-ncno-among-stocks-174319615.html",
    "timestamp": "2025-04-10T17:43:19Z"
  },
  {
    "title": "House passes bill targeting noncitizen voting - already illegal in federal elections - in Trump-aligned push | CNN Politics",
    "description": "The House passed a Republican-led bill Thursday to require documentary proof of US citizenship to register to vote in federal elections, despite the fact that it is already illegal for noncitizens to vote in federal elections.",
    "link": "https://www.cnn.com/2025/04/10/politics/save-act-noncitizen-voting-bill-house/index.html",
    "timestamp": "2025-04-10T17:42:52Z"
  },
  {
    "title": "'Republicans have put themselves in a bind' with budget plan: MSNBC's Ryan Noble​s",
    "description": "MSNBC's Ryan Nobles on Thursday said that congressional Republicans have made things more difficult for themselves as they move to try to pass President Donald Trump's budget package.After Republicans in the House of Representatives successfully passed a blue…",
    "link": "https://www.rawstory.com/republicans-budget-2671742196/",
    "timestamp": "2025-04-10T17:42:01Z"
  },
  {
    "title": "Mid-America Apartment Communities (MAA): Among Stocks Insiders Sold in April After Trump’s Tariff Rollout",
    "description": "We recently published a list of 10 Stocks Insiders Sold in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Mid...",
    "link": "https://finance.yahoo.com/news/mid-america-apartment-communities-maa-174108372.html",
    "timestamp": "2025-04-10T17:41:08Z"
  },
  {
    "title": "The House passed a requirement to prove US citizenship to vote. This is how it could affect voting",
    "description": "The SAVE Act now heads to the Senate.",
    "link": "https://www.denverpost.com/2025/04/10/congress-elections-save-act/",
    "timestamp": "2025-04-10T17:40:56Z"
  },
  {
    "title": "The House passed a requirement to prove US citizenship to vote. This is how it could affect voting",
    "description": "The SAVE Act now heads to the Senate.",
    "link": "https://www.bostonherald.com/2025/04/10/congress-elections-save-act/",
    "timestamp": "2025-04-10T17:40:56Z"
  },
  {
    "title": "Trump’s tariffs ‘pause’ could help Nintendo ship more Switch 2s",
    "description": "President Donald Trump’s “90-day pause” on high tariffs for many countries could be good news for Nintendo. The shift marks an opportunity for the company to ship more Switch 2 units from Vietnam to the US. And customs data reported on by Bloomberg suggests t…",
    "link": "https://www.theverge.com/news/646693/trump-tariffs-pause-nintendo-switch-2",
    "timestamp": "2025-04-10T17:39:25Z"
  },
  {
    "title": "Billionaires dream of building utopian techno-city in Greenland",
    "description": "The 'freedom city' is the latest effort to create stateless cities with minimal corporate regulation.\nThe post Billionaires dream of building utopian techno-city in Greenland appeared first on Popular Science.",
    "link": "https://www.popsci.com/technology/billionaire-freedom-city-greenland/",
    "timestamp": "2025-04-10T17:38:39Z"
  },
  {
    "title": "Israel fears 'real danger' Trump may strike mediocre nuke deal with Iran",
    "description": "Top Israeli sources warned the Post that Trump may circumscribe the IDF’s current unique opportunity to strike the Islamic Republic's nuclear program.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-849751",
    "timestamp": "2025-04-10T17:37:33Z"
  },
  {
    "title": "Donald Trump Acknowledges 'Transition Problems' As Tariffs Roil Wall Street",
    "description": "As Trump and the cabinet met, U.S. stocks tumbled again Thursday, giving back a significant portion of the historic gains.",
    "link": "https://biztoc.com/x/9426ded72b311bcc",
    "timestamp": "2025-04-10T17:37:02Z"
  },
  {
    "title": "Trump Congratulates House for Passing Budget Resolution, Paving Way for $1.5T in Spending Cuts",
    "description": "President Donald Trump congratulated the House Republicans for passing a budget resolution Thursday, which moves his agenda forward.",
    "link": "https://www.westernjournal.com/trump-congratulates-house-passing-budget-resolution-paving-way-1-5t-spending-cuts/",
    "timestamp": "2025-04-10T17:35:33Z"
  },
  {
    "title": "Trump’s World Liberty Financial Denies Selling Off Ethereum Stash",
    "description": "On-chain data suggested earlier this week that a wallet “closely tied” to the project began selling off millions in ETH at the peak of tariff-related market panic.",
    "link": "https://decrypt.co/314367/trump-world-liberty-financial-denies-selling-ethereum",
    "timestamp": "2025-04-10T17:35:24Z"
  },
  {
    "title": "Florida brings charges against a man jailed on federal counts of trying to assassinate Trump",
    "description": "Florida's attorney general says his office will bring terrorism and attempted murder counts against a man already jailed on federal charges of attempting to assassinate then-presidential candidate Donald Trump while he was golfing last fall",
    "link": "https://www.wftv.com/news/politics/florida-brings/XSFFPP3PLBC7FF3VG3X2H3OBNM/",
    "timestamp": "2025-04-10T17:35:12Z"
  },
  {
    "title": "Pete Hegseth reviews plans for space-based 'Golden Dome' US defense system",
    "description": "President Donald Trump's plans for the space-based \"Golden Dome\" missile defense system to defend the United States has been sent to Defense Secretary Pete Hegseth's desk for review. Trump has previously spoken about making a missile defense system similar to…",
    "link": "https://freerepublic.com/focus/f-news/4310205/posts",
    "timestamp": "2025-04-10T17:35:03Z"
  },
  {
    "title": "The TV Show Host Who's Now In Charge Of Medicare Wants To Replace Doctors With AI",
    "description": "Who among us hasn't indulged in the daytime TV schlock of personalities like Dr. Phil, Jerry Springer, or Judge Judy. Sure it's mildly exploitative, sure it's chock full of scammy product placement, but hey, it's not like these guys are in charge of federal p…",
    "link": "https://futurism.com/dr-oz-medicare-ai",
    "timestamp": "2025-04-10T17:33:23Z"
  },
  {
    "title": "Trump nominee for public lands post withdraws after her criticism of Jan. 6 Capitol attack surfaces",
    "description": "BILLINGS, Mont. (AP) — President Donald Trump’s nominee to oversee an agency that manages a quarter-billion acres of public land has withdrawn her nomination following revelations that she criticized the Republican president in 2021 for inciting the Jan. 6 at…",
    "link": "https://financialpost.com/pmn/trump-nominee-for-public-lands-post-withdraws-after-her-criticism-of-jan-6-capitol-attack-surfaces",
    "timestamp": "2025-04-10T17:32:37Z"
  },
  {
    "title": "Tariffs, trade war inflation impact to be 'pretty ugly' by summer, economists say",
    "description": "Tariffs will take a few months to filter through to consumer prices, economists said.",
    "link": "https://www.cnbc.com/2025/04/10/tariffs-trade-war-inflation-impact-to-be-pretty-ugly-by-summer.html",
    "timestamp": "2025-04-10T17:32:13Z"
  },
  {
    "title": "Amazon CEO Andy Jassy Sees Tariffs Raising Prices For Consumers As Media Stocks, Markets Fall",
    "description": "Amazon chief executive Andrew Jassy says “I’m guessing sellers will pass that cost on” as President Donald Trump raises the price to import good into the U.S. He made the comments on CNBC as media stocks and jittery markets reversed Tuesday’s gains with a big…",
    "link": "http://deadline.com/2025/04/amazon-ceo-andy-jassy-tariffs-raise-prices-consumers-media-stocks-1236365587/",
    "timestamp": "2025-04-10T17:31:16Z"
  },
  {
    "title": "US suspends additional 26 pc tariff on India till July 9: White House",
    "description": "NEW DELHI: The US has announced the suspension of additional tariffs on India for 90 days until July 9 this year, according to the White House executive orders. On April 2, US President Donald Trump slapped universal duties on about 60 countries exporting goo…",
    "link": "https://statetimes.in/us-suspends-additional-26-pc-tariff-on-india-till-july-9-white-house/",
    "timestamp": "2025-04-10T17:31:00Z"
  },
  {
    "title": "Lessons Trump could learn from the last Soviet leader",
    "description": "Trying to salvage and empower an empire in decline, only to end up hastening its demise – we’ve seen that somewhere before Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615548-trump-tariffs-gorbachev-common/",
    "timestamp": "2025-04-10T17:30:58Z"
  },
  {
    "title": "WATCH: Biden Dozed Near Pool During Debate Prep, Author Says",
    "description": "Former president Joe Biden fell asleep poolside during a prep session ahead of his disastrous June debate with Donald Trump, according to the author of a new book on the 2024 election.\nThe post WATCH: Biden Dozed Near Pool During Debate Prep, Author Says appe…",
    "link": "https://freebeacon.com/latest-news/watch-biden-dozed-near-pool-during-debate-prep-author-says/",
    "timestamp": "2025-04-10T17:30:54Z"
  },
  {
    "title": "Trump 'Insider Trading' Scandal: How The Don Is Facing Stock Market Manipulation Accusations After Declaring It Was 'A Great Time to Buy' Following Tariff Trade War U-Turn",
    "description": "Donald Trump is now being accused of manipulating the stock market, after he encouraged people to buy some amid the tariffs increase – before changing his mind.",
    "link": "https://radaronline.com/p/trump-insider-trading-stock-market-manipulation-tariff-trade-war/",
    "timestamp": "2025-04-10T17:30:00Z"
  },
  {
    "title": "Small business angst is rising amid Trump's tariffs and spending cuts (Katherine Hapgood/Politico)",
    "description": "Katherine Hapgood / Politico:\nSmall business angst is rising amid Trump's tariffs and spending cuts  —  Uncertainty is growing on Main Street as tariffs roil the economy and the Trump administration moves to cut small business programs.  —  President Donald T…",
    "link": "https://www.memeorandum.com/250410/p83",
    "timestamp": "2025-04-10T17:30:00Z"
  },
  {
    "title": "Meme after meme: China targets Donald Trump and his advisers with AI war to counter tariffs; here are some causing a sensation",
    "description": "Trump tariffs spark China meme war as Beijing fires back with hilarious, AI-style videos mocking Trump, Elon Musk, and JD Vance over rising tariffs. From factory worker memes to inflated MAGA hat prices, China is using viral content to hit back at America’s t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/meme-after-meme-china-targets-donald-trump-and-his-advisers-with-ai-war-to-counter-tariffs-here-are-some-causing-a-sensation/articleshow/120171743.cms",
    "timestamp": "2025-04-10T17:29:37Z"
  },
  {
    "title": "Biden official's criticism of Trump so strong that it 'led to an additional sell-off': CNN",
    "description": "Former treasury secretary Janet Yellen denounced president Donald Trump's tariffs and identified the reason she believes that he backed down from most of them.The president's sweeping, so-called reciprocal tariffs went into effect Wednesday against global tra…",
    "link": "https://www.rawstory.com/janet-yellen-china-tariffs/",
    "timestamp": "2025-04-10T17:29:18Z"
  },
  {
    "title": "Could Trump strike a nuclear deal with Tehran?",
    "description": "Government officials are growing more concerned that the US president will strike a deal with Iran without considering Israeli interests.",
    "link": "https://www.jpost.com/israel-news/article-849748",
    "timestamp": "2025-04-10T17:28:53Z"
  },
  {
    "title": "How Top Performing Companies Handle Tech Investment",
    "description": "Also in the Forbes CIO newsletter: Introducing the AI 50, tariffs undermine AI infrastructure, Adobe’s AI agents presented to empower creativity.",
    "link": "https://www.forbes.com/sites/cio/2025/04/10/how-top-performing-companies-handle-tech-investment/",
    "timestamp": "2025-04-10T17:28:47Z"
  },
  {
    "title": "Does the ‘Emergency Legislation’ allow Donald Trump to impose tariffs and can US Supreme Court reverse it? Here’s what legal experts say",
    "description": "Amid growing criticism, Trump announced a temporary halt on most tariffs, keeping a 10% baseline rate while proceeding with the 125% tariff on Chinese imports.",
    "link": "https://economictimes.indiatimes.com/news/international/us/does-the-emergency-legislation-allow-donald-trump-to-impose-tariffs-and-can-us-supreme-court-reverse-it-heres-what-legal-experts-say/articleshow/120171855.cms",
    "timestamp": "2025-04-10T17:26:40Z"
  },
  {
    "title": "Florida Business Sues Donald Trump Over Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Florida stationary company is suing president Trump for his China tariffs.\nWhy It Matters\nTrump has imposed 125 percent tariffs on Chinese goods, and on March 10, China retaliated with 84 percent tariffs on …",
    "link": "https://biztoc.com/x/f882f02e796d9cfb",
    "timestamp": "2025-04-10T17:26:39Z"
  },
  {
    "title": "The Brief – Give the world what it so craves, Eurobonds",
    "description": "Now is the time to show the world that Europe can be trusted.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-give-the-world-what-it-so-craves-eurobonds/",
    "timestamp": "2025-04-10T17:26:38Z"
  },
  {
    "title": "Danger in Trump’s Mind",
    "description": "On 7 April, a Mondoweiss headline ran as: “Trump announces surprise Iran talks during Netanyahu meeting.”\nUnited States president Donald Trump had met with Israeli prime minister Benjamin Netanyahu to discuss “Gaza, tariffs, and the alleged nuclear threat of …",
    "link": "https://www.globalresearch.ca/danger-trump-mind/5884105",
    "timestamp": "2025-04-10T17:26:21Z"
  },
  {
    "title": "Donald Trump Acknowledges 'Transition Problems' As Tariffs Roil Wall Street",
    "description": "As Trump and the cabinet met, U.S. stocks tumbled again Thursday, giving back a significant portion of the historic gains.",
    "link": "https://www.newsweek.com/donald-trump-acknowledges-transition-problems-tariffs-roil-wall-street-2058163",
    "timestamp": "2025-04-10T17:26:08Z"
  },
  {
    "title": "BEST WEEK EVER: Trump Frees Hottest US Hostage After Winning Trade War, Making Showers Great Again (PHOTOS)",
    "description": "President Donald Trump is having one of the best weeks of his presidency. The stock market surged on Wednesday after Trump declared victory against unfair trade practices. He also ended the Obama-Biden \"war on water pressure\" and \"make America's showers great…",
    "link": "https://freebeacon.com/politics/best-week-ever-trump-frees-hottest-us-hostage-after-winning-trade-war-making-showers-great-again-photos/",
    "timestamp": "2025-04-10T17:25:52Z"
  },
  {
    "title": "Florida Business Sues Donald Trump Over Tariffs",
    "description": "The company, which makes stylized planners and notebooks, says the Trump tariffs will cost it hundreds of thousands of dollars a year",
    "link": "https://www.newsweek.com/president-donald-trump-china-tariffs-florida-company-lawsuit-imports-2058109",
    "timestamp": "2025-04-10T17:24:33Z"
  },
  {
    "title": "Justice Department restored Mel Gibson's gun rights? Here's what we know",
    "description": "The actor lost his right to own a firearm following a 2011 battery conviction.",
    "link": "https://www.snopes.com//news/2025/04/10/mel-gibson-gun-rights-justice-department/",
    "timestamp": "2025-04-10T17:24:00Z"
  },
  {
    "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
    "description": "Ukrainian prosecutors and U.N. officials say killings of Ukrainian POWs have surged.",
    "link": "https://www.bostonherald.com/2025/04/10/russia-ukraine-pow-killings/",
    "timestamp": "2025-04-10T17:23:27Z"
  },
  {
    "title": "Fact-checking Trump’s previous claim he wasn’t looking at pausing tariffs",
    "description": "For two days, Trump and the White House denied that he was considering changing his tariff plan, before doing just that on April 9.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-previous-claim-he-wasnt-looking-at-pausing-tariffs",
    "timestamp": "2025-04-10T17:22:37Z"
  },
  {
    "title": "Usha Vance Is Apparently Loving Her New Role, Kennedy Center Boos and All",
    "description": "In her first interview since becoming second lady, Vance tells the Free Press that despite life being “lonely” and “very strange,” her political experience has been “almost uniformly positive.”",
    "link": "https://www.vanityfair.com/style/story/usha-vance-second-lady-free-press-interview",
    "timestamp": "2025-04-10T17:22:17Z"
  },
  {
    "title": "1st LD-Writethru: EU, UAE to start free trade talks: EU chief",
    "description": "BRUSSELS, April 10 (Xinhua) -- The European Union (EU) and the United Arab Emirates (UAE) have agreed to kick off free trade negotiations, European Commission President Ursula von der Leyen said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/11/1st-ld-writethru-eu-uae-to-start-free-trade-talks-eu-chief",
    "timestamp": "2025-04-10T17:22:00Z"
  },
  {
    "title": "US efforts to secure release of American-Israeli hostage from Hamas fall short",
    "description": "Officials from the Trump administration met with Hamas representatives, going against the US policy of not engaging directly with the terrorist organization.",
    "link": "https://www.jpost.com/international/article-849706",
    "timestamp": "2025-04-10T17:21:36Z"
  },
  {
    "title": "Ottawa said to plan meeting with U.S. banks after Trump complaints",
    "description": "The Canadian government has invited representatives from United States banks including JPMorgan Chase & Co. for a meeting, according to people with knowledge of the matter, after U.S. President Donald Trump complained that American banks have trouble doing bu…",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-officials-said-to-plan-meeting-with-us-banks-after-trump-complaints",
    "timestamp": "2025-04-10T17:20:37Z"
  },
  {
    "title": "Ottawa said to plan meeting with U.S. banks after Trump complaints",
    "description": "Ottawa has invited representatives from U.S. banks for a meeting after Donald Trump's complaints about doing business in Canada. Read more.",
    "link": "https://financialpost.com/pmn/business-pmn/ottawa-meeting-us-banks-donald-trump-complaints",
    "timestamp": "2025-04-10T17:20:37Z"
  },
  {
    "title": "The Wall Street Journal Twists the Knife After Trump Tariff Retreat: ‘The Biggest Threat to the World Economy’",
    "description": "The Wall Street Journal slammed President Donald Trump's trade policy in a scathing editorial celebrating his partial retreat on Wednesday.\nThe post The Wall Street Journal Twists the Knife After Trump Tariff Retreat: ‘The Biggest Threat to the World Economy’…",
    "link": "https://www.mediaite.com/news/the-wall-street-journal-twists-the-knife-after-trump-tariff-retreat-the-biggest-threat-to-the-world-economy/",
    "timestamp": "2025-04-10T17:19:54Z"
  },
  {
    "title": "Nvidia Stock Could Fall If 125% China Tariff Drives Price Increases",
    "description": "One thing contributing to the drop is the 2024 election which brought Donald Trump back to the Oval Office. Trump's 125% tariff on China could raise Nvidia's prices.",
    "link": "https://www.forbes.com/sites/petercohan/2025/04/10/nvidia-stock-could-fall-if-125-china-tariff-drives-price-increases/",
    "timestamp": "2025-04-10T17:18:29Z"
  },
  {
    "title": "Trump tariff hike brings added China rate for many goods to 145%",
    "description": "WASHINGTON: US President Donald Trump's steep tariff hike targeting Chinese goods, which took effect Thursday (Apr 10), brings Washington's addi",
    "link": "https://www.channelnewsasia.com/world/trump-tariff-hike-brings-added-china-rate-many-goods-145-5057991",
    "timestamp": "2025-04-10T17:18:20Z"
  },
  {
    "title": "Sticker Mule scrubs pro-Trump posts from Instagram",
    "description": "Sticker Mule, an online sticker merchandising firm that blew up in the public eye with a blast email to its entire customer base following an assassination attempt on President Donald Trump, appears to have cleared its Instagram account of any political suppo…",
    "link": "https://www.dailydot.com/debug/sticker-mule-trump-instagram/",
    "timestamp": "2025-04-10T17:18:10Z"
  },
  {
    "title": "European stocks rally closes off highs as selling resumes on Wall Street",
    "description": "Relief sees markets ‘mechanically rebound’ across continent",
    "link": "https://www.irishtimes.com/business/2025/04/10/european-stocks-rally-closes-off-highs-as-selling-resumes-on-wall-street/",
    "timestamp": "2025-04-10T17:17:20Z"
  },
  {
    "title": "Florida brings charges against a man jailed on federal counts of trying to assassinate Trump",
    "description": "Ryan Routh is facing additional state terrorism and attempted murder charges.",
    "link": "https://www.bostonherald.com/2025/04/10/trump-shooting-attempt-florida/",
    "timestamp": "2025-04-10T17:16:44Z"
  },
  {
    "title": "Trump is running the U.S. economy like a mad king",
    "description": "Chris Hayes explains how Trump's erratic tariff policy is undermining faith in the U.S. economy and says he's behaving like a mad king.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-economy-mad-king-bonds-rcna200616",
    "timestamp": "2025-04-10T17:16:42Z"
  },
  {
    "title": "Trump's immigration policy is weighing on beer sales, Constellation Brands CEO says",
    "description": "President Donald Trump’s tariffs aren’t the only presidential policy that is weighing on Constellation Brands.",
    "link": "https://www.nbcnews.com/business/consumer/trumps-immigration-policy-weighing-beer-sales-constellation-brands-ceo-rcna200672",
    "timestamp": "2025-04-10T17:16:28Z"
  },
  {
    "title": "Why House Democrats are sticking with their long-shot anti-tariff strategy",
    "description": "The News\nHouse Democrats are encountering a new obstacle as they try to drive a wedge within the GOP on tariffs: Their potential Republican allies aren’t moving in their direction.\nEven before President Donald Trump paused many of his tariffs on Wednesday, hi…",
    "link": "https://biztoc.com/x/aed4f19559beb1d7",
    "timestamp": "2025-04-10T17:15:26Z"
  },
  {
    "title": "Whatever Donald Trump does next, this chaos will soon be shaping ordinary lives for the worse | Gaby Hinsliff",
    "description": "There is now little prospect of the growth Labour promised. With Reform nipping at his heels, Starmer must offer protection to the British people\nIf it’s brown, lie down. If it’s black, fight back. If it’s white, say goodnight.\nThe rhyme we learned hiking as …",
    "link": "https://biztoc.com/x/2fb7d2d47b05f6eb",
    "timestamp": "2025-04-10T17:15:13Z"
  },
  {
    "title": "Trump Says He Can't Imagine Further Increasing China Tariffs",
    "description": "China has hit back at the US after Donald Trump’s dramatic reversal on tariff threats isolated Beijing as the primary target of his trade offensive, dimming the prospect of immediate de-escalation.\nThe Chinese government on Thursday said it will reduce the nu…",
    "link": "https://biztoc.com/x/891a9a1bb34298a2",
    "timestamp": "2025-04-10T17:15:10Z"
  },
  {
    "title": "China reaches out to others as Trump layers on tariffs",
    "description": "China has refused to seek talks, saying it would “fight to the end.\"",
    "link": "https://www.bostonherald.com/2025/04/10/china-trump-tariffs/",
    "timestamp": "2025-04-10T17:15:06Z"
  },
  {
    "title": "What's at stake in Kilmar Ábrego García's Supreme Court case?",
    "description": "A test of Trump's immigration agenda",
    "link": "https://theweek.com/politics/kilmar-abrego-garcia-supreme-court-case",
    "timestamp": "2025-04-10T17:14:21Z"
  },
  {
    "title": "WH slams Dems' 'partisan games' after Trump-foe Schiff calls for insider trading investigation over tariffs",
    "description": "The White House slammed Democrats for playing \"partisan games\" following Senate Democrats calling for an investigation into market manipulation following the tariff pause.",
    "link": "https://www.foxnews.com/politics/wh-slams-dems-partisan-games-after-trump-foe-schiff-calls-insider-trading-investigation-over-tariffs",
    "timestamp": "2025-04-10T17:14:13Z"
  },
  {
    "title": "US suspends additional 26% tariffs on Indian goods until July 9: White House",
    "description": "This decision comes as a significant relief to Indian exporters, particularly in the semiconductor, pharmaceutical, and energy sectors.",
    "link": "https://www.thehindubusinessline.com/news/us-suspends-additional-26-tariffs-on-indian-goods-until-july-9-white-house/article69436690.ece",
    "timestamp": "2025-04-10T17:14:11Z"
  },
  {
    "title": "The misguided notions behind ‘Liberation Day’",
    "description": "North Carolina farmers exported $3.3 billion worth of agricultural products to foreign trading partners in 2023. With tariffs, those foreign markets will shrink and cause significant harm to farmers in North Carolina.",
    "link": "https://www.ncspin.com/the-misguided-notions-behind-liberation-day",
    "timestamp": "2025-04-10T17:14:03Z"
  },
  {
    "title": "Donald Trump Thinks He Can End The Fentanyl Problem By Hitting Drug Smugglers With Tariffs",
    "description": "What a surprise. The man who clearly doesnt understand tariffs doesnt understand drug trafficking. President Trump has repeatedly claimed the flow of illicit Fentanyl into the United States justifies hitting countries like Mexico, China, and Canada(???) with …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176995219",
    "timestamp": "2025-04-10T17:13:40Z"
  },
  {
    "title": "I read 'The Art of the Deal.' Here are 7 lessons from Trump's book we're seeing play out with tariffs.",
    "description": "Donald Trump's \"The Art of the Deal\" gave me some valuable insights on his tactics, like ignoring \"number-crunchers\" and aiming as high as possible.",
    "link": "https://www.businessinsider.com/art-of-deal-tariffs-trump-lessons-from-book-2025-4",
    "timestamp": "2025-04-10T17:12:58Z"
  },
  {
    "title": "JUST IN: Trump to Face Defamation Lawsuit Over ‘Central Park Five’ Statements, Judge Rules",
    "description": "A federal judge on Thursday ruled that a defamation lawsuit against President Donald Trump from the \"Central Park Five\" can move forward.\nThe post JUST IN: Trump to Face Defamation Lawsuit Over ‘Central Park Five’ Statements, Judge Rules first appeared on Med…",
    "link": "https://www.mediaite.com/news/just-in-trump-to-face-defamation-lawsuit-over-central-park-five-statements-judge-rules/",
    "timestamp": "2025-04-10T17:12:45Z"
  },
  {
    "title": "Lawmakers Traded Up To $1.3 Million In Tesla Stock After Musk Endorsed Trump",
    "description": "At least 10 lawmakers traded Tesla stock after Musk aligned with Trump—underscoring renewed concerns about members of Congress trading individual stocks.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/04/10/tesla-stock-trades-congress-elon-musk-donald-trump/",
    "timestamp": "2025-04-10T17:12:29Z"
  },
  {
    "title": "Is Trump Going To UFC 314?",
    "description": "UFC 314 odds include the moneyline on Donald Trump and whether or not the tariff-challenged U.S. President will be in attendance on April 12 at Kaseya Center in Miami.",
    "link": "https://www.mmamania.com/2025/4/10/24405494/is-donald-trump-going-ufc-314-dana-white-miami",
    "timestamp": "2025-04-10T17:12:25Z"
  },
  {
    "title": "Trump’s Tariffs Buck the Global Neoliberal Order — But Still Serve the 1 Percent",
    "description": "Trump’s tariffs threaten to widen inequality in the US, making the rich richer and impoverishing the working class.",
    "link": "https://truthout.org/articles/trumps-tariffs-buck-the-global-neoliberal-order-but-still-serve-the-1-percent/",
    "timestamp": "2025-04-10T17:11:37Z"
  },
  {
    "title": "Amid market turbulence, money managers keep a cool head",
    "description": "Faced with the extreme market turbulence of the past week, money managers are staying the course and relying on their long-term investment strategies while also looking for opportunities amid the panic. Kevin Burkett, portfolio manager at Burkett Asset Manage…",
    "link": "https://financialpost.com/pmn/amid-market-turbulence-money-managers-keep-a-cool-head",
    "timestamp": "2025-04-10T17:11:11Z"
  },
  {
    "title": "Canadians turn their backs on U.S. travel, as return trips plunge: StatCan",
    "description": "Canadian visits to the United States plummeted last month amid anger over tariffs and annexation threats from its president, on top of growing fears about treatment at the border. In March, the number of Canadians returning home by car from the U.S. fell near…",
    "link": "https://financialpost.com/pmn/canadians-turn-their-backs-on-u-s-travel-as-return-trips-plunge-statcan",
    "timestamp": "2025-04-10T17:10:53Z"
  },
  {
    "title": "Idea to Put Federal Workers in Factory Jobs Created by Tariffs Sparks Fury",
    "description": "A union representing federal workers called Treasury Secretary Scott Bessent's suggestion \"insulting.\"",
    "link": "https://www.newsweek.com/scott-bessent-fired-federal-workers-tariffs-doge-2058087",
    "timestamp": "2025-04-10T17:10:02Z"
  },
  {
    "title": "Trump Warns Of 'Transition Cost' From Tariffs, Says \"In The End...\"",
    "description": "US President Donald Trump on Thursday warned of the &quot;transition cost&quot; from his tariff policies, as Wall Street stocks fell again over the worsening trade war with China.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-warns-of-transition-cost-from-tariffs-says-in-the-end-global-market-8135120",
    "timestamp": "2025-04-10T17:10:01Z"
  },
  {
    "title": "Bitcoin falls as investors slash gains from historic rally on U.S. tariffs pause",
    "description": "Cryptocurrencies pulled back with the broader market as investors gave back more than half of Wednesday's historic rally.",
    "link": "https://www.cnbc.com/2025/04/10/cryptocurencies-fall-as-investors-slash-gains-from-historic-tariff-pause-rally.html",
    "timestamp": "2025-04-10T17:09:20Z"
  },
  {
    "title": "Tom Watson, Jack Nicklaus don't see the PGA Tour and LIV Golf reaching a deal anytime soon",
    "description": "There are 12 LIV Golf members in the field this week at the Masters, which marks one of the rare instances where the golf world is back together.",
    "link": "https://sports.yahoo.com/golf/article/tom-watson-jack-nicklaus-dont-see-the-pga-tour-and-liv-golf-reaching-a-deal-anytime-soon-170855456.html",
    "timestamp": "2025-04-10T17:08:55Z"
  },
  {
    "title": "House passes Republican bill requiring voters provide proof of U.S. citizenship",
    "description": "The issue is one of President Donald Trump's top election-related priorities.",
    "link": "https://www.pbs.org/newshour/politics/house-passes-republican-bill-requiring-voters-provide-proof-of-u-s-citizenship",
    "timestamp": "2025-04-10T17:08:11Z"
  },
  {
    "title": "China to limit number of American films imported from US amid tariff battle",
    "description": "China announced its decision to reduce the number of U.S. films shown in China amid the escalating trade war between the nations.",
    "link": "https://abc13.com/post/china-limit-number-american-films-imported-us-amid-tariff-battle/16153136/",
    "timestamp": "2025-04-10T17:08:07Z"
  },
  {
    "title": "Trump must flip the script at Iran talks and demand concrete actions",
    "description": "Global players want Trump to make a deal with Iran, but he must resist their efforts and push for real outcomes.",
    "link": "https://www.jpost.com/opinion/article-849741",
    "timestamp": "2025-04-10T17:08:05Z"
  },
  {
    "title": "Mumbai attacks suspect arrives in Delhi after US extradition",
    "description": "Tahawwur Hussain Rana is accused of being tied to the Pakistani Lashkhar-e-Taiba group behind the Mumbai attacks. His extradition had been earlier announced by US President Donald Trump.",
    "link": "https://www.dw.com/en/mumbai-attacks-suspect-arrives-in-delhi-after-us-extradition/a-72208206",
    "timestamp": "2025-04-10T17:08:00Z"
  },
  {
    "title": "Paying a heavy cost for going after a tax cheat named Hunter Biden",
    "description": "'Joe Ziegler is not a beaten man – not for his antagonists' lack of trying'",
    "link": "https://www.wnd.com/2025/04/paying-a-heavy-cost-for-going-after-a-tax-cheat-named-hunter-biden/",
    "timestamp": "2025-04-10T17:07:34Z"
  },
  {
    "title": "Oh god…NO, DIRE WOLVES HAVE NOT BEEN BROUGHT BACK FROM EXTINCTION!",
    "description": "Jesus. Look at the cover of Time magazine. They’re not even close. Look! They’ve resurrected unicorns! It’s ridiculous. They made a few genetic tweaks to a grey wolf, almost entirely cosmetic, to make puppies that kind of look like how they imagine a dire wol…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/04/10/oh-godno-dire-wolves-have-not-been-brought-back-from-extinction/",
    "timestamp": "2025-04-10T17:07:21Z"
  },
  {
    "title": "Amid the tariff drama, one thing just went unnoticed: Donald Trump's approval rating takes a dramatic hit, with new polls showing sharp drop in support",
    "description": "Donald Trump's approval ratings are declining amid economic concerns, according to recent polls. Navigator Research indicates a significant drop in approval, with a majority disapproving of his economic policies. Other polls, including Cygnal and Newsweek, re…",
    "link": "https://economictimes.indiatimes.com/news/international/us/amid-the-tariff-drama-one-thing-just-went-unnoticed-donald-trumps-approval-rating-takes-a-dramatic-hit-with-new-polls-showing-sharp-drop-in-support/articleshow/120169060.cms",
    "timestamp": "2025-04-10T17:07:04Z"
  },
  {
    "title": "Trump targets ‘Anonymous’ author and former top cybersecurity official in escalation of retribution",
    "description": "Trump has sought to use the powers of the presidency to retaliate against his adversaries.",
    "link": "https://www.bostonherald.com/2025/04/10/trump-retribution-targets/",
    "timestamp": "2025-04-10T17:06:42Z"
  },
  {
    "title": "Restarting coal plants after Trump's executive orders makes no economic sense, report says",
    "description": "Trump's executive orders could potentially delay the closure of coal-fired power plants and encourage the restart of 102 recently shut coal-fired units...",
    "link": "https://ca.finance.yahoo.com/news/restarting-coal-plants-trumps-executive-170641153.html",
    "timestamp": "2025-04-10T17:06:41Z"
  },
  {
    "title": "Democrats Target 5 Republican-Held Swing Districts in New Town Hall Blitz",
    "description": "The Democrats have held dozens of town halls in 35 states over the past few weeks, intending on expanding that series in the weeks to come.",
    "link": "https://www.newsweek.com/democrats-target-republican-held-swing-districts-town-hall-blitz-2058076",
    "timestamp": "2025-04-10T17:06:24Z"
  },
  {
    "title": "House Dems: Musk Should Go Immediately But Must Exit Trump Post by May 30",
    "description": "Dozens of House Democrats wrote to U.S. President Donald Trump on Wednesday \"to make clear that you must remove Elon Musk from his government position by May 30th and to demand that you stop ignoring federal law and ethics rules to empower an unelected billio…",
    "link": "https://www.commondreams.org/news/elon-musk-trump",
    "timestamp": "2025-04-10T17:06:00Z"
  },
  {
    "title": "How much did Elon Musk's DOGE bender put a dent in Cybertruck sales? Here's an answer",
    "description": "Donald Trump had Elon Musk and a Cybertruck to the White House. Is such a close association affecting sales?\nMandel NGAN / AFP\nElon Musk's focus on DOGE has hurt Tesla's sales.\nBut how much has his DOGE bender affected the Cybertruck?\nQ1 estimates from Cox Au…",
    "link": "https://biztoc.com/x/26cc9e4e5582c647",
    "timestamp": "2025-04-10T17:04:31Z"
  },
  {
    "title": "House passes requirement to prove US citizenship to vote — here’s how it could affect you",
    "description": "ATLANTA — The U.S. House on Thursday approved legislation requiring documentary proof of U.S. citizenship for anyone registering to vote, something voting rights group have warned could disenfranchise millions of Americans. The requirement has been a top elec…",
    "link": "https://nypost.com/2025/04/10/us-news/house-passes-requirement-to-prove-us-citizenship-to-vote-heres-how-it-could-affect-you/",
    "timestamp": "2025-04-10T17:04:26Z"
  },
  {
    "title": "Trump trade war uncertainty threatens U.S. oil production",
    "description": "President Donald Trump’s trade war has thrown the oil market into deep uncertainty, triggering wild swings in crude prices, undermining investor confidence and jeopardizing domestic production.",
    "link": "https://biztoc.com/x/58345cc966866cf2",
    "timestamp": "2025-04-10T17:04:08Z"
  },
  {
    "title": "Trump dodged a disaster from the bond market, but the damage isn’t over yet",
    "description": "The bond market screamed at President Donald Trump this week to change course on his tariff plans before he eventually listened and potentially avoided a catastrophe.\nTrump's stunning pivot Wednesday followed massive tumult in the $140 trillion global bond ma…",
    "link": "https://biztoc.com/x/fc8352b900bd3ba2",
    "timestamp": "2025-04-10T17:04:07Z"
  },
  {
    "title": "Trump on tariffs: There will be a transition cost",
    "description": "United States President Donald Trump defended his administration's sweeping tariff policies on Thursday, warning of an inevitable \"transition cost\" but promising long-term benefits.Speaking from the O...",
    "link": "https://biztoc.com/x/03481210c146913b",
    "timestamp": "2025-04-10T17:04:07Z"
  },
  {
    "title": "Trump’s new energy order puts states’ climate laws in the crosshairs of the Department of Justice",
    "description": "By MARC LEVY\nHARRISBURG, Pa. (AP) — A new executive order from President Donald Trump that’s part of his effort to invigorate energy production raises the possibility that his Department of Justice will go to court against state climate change laws aimed at s…",
    "link": "https://biztoc.com/x/50d4d2f3820b6152",
    "timestamp": "2025-04-10T17:03:54Z"
  },
  {
    "title": "A man accused of plotting 'India's 9/11' has been extradited to New Delhi",
    "description": "Tahawwur Hussain Rana has long denied any involvement in the Mumbai terror attacks which killed more than 160 people in 2008.",
    "link": "https://www.abc.net.au/news/2025-04-11/mumbai-terror-attack-accused-extradited-to-india-from-us/105163522",
    "timestamp": "2025-04-10T17:03:10Z"
  },
  {
    "title": "David Rothenberg talks about his new book ‘Manhattan Mayhem’",
    "description": "David Rothenberg chatted about his new book \"Manhattan Mayhem.\"\nThe post David Rothenberg talks about his new book ‘Manhattan Mayhem’ appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/life/david-rothenberg-talks-about-his-new-book-manhattan-mayhem/article",
    "timestamp": "2025-04-10T17:03:00Z"
  }
]