[
  {
    "title": "Trump 'boasts' about his 'mental health'— but couldn't remember cognitive test details",
    "description": "During Donald Trump's first presidency, one his most famous lines was, \"I am a very stable genius.\" And the line became so famous that Washington Post reporters Philip Rucker and Carol Leonnig used it in the title of their 2020 book \"A Very Stable Genius: Don…",
    "link": "https://www.rawstory.com/trump-boasts-mental-health-memory/",
    "timestamp": "2025-04-13T00:32:25Z"
  },
  {
    "title": "Elon Musk's Brother Kimbal Blasts Trump: 'Celebrating Causing China's Stock Market To Go Down, By Causing Our Own Stock Market To Go Down?'",
    "description": "",
    "link": "https://www.benzinga.com/news/25/04/44778829/elon-musks-brother-kimbal-blasts-trump-celebrating-causing-chinas-stock-market-to-go-down-by-causing-our-own-stock-market-to-go-down",
    "timestamp": "2025-04-13T00:30:41Z"
  },
  {
    "title": "Ethereum Slips Below ‘Mayer Multiple’ Level That Preceded Last Rally To $4,000",
    "description": "The Ethereum token has been under significant bearish pressure over the past few months, losing almost half of its value in the first quarter of 2025. Along with the rest of the altcoin market, ETH bled severely following the announcement of new trade tariffs…",
    "link": "https://bitcoinist.com/ethereum-slips-below-level-preceded-last-rally-4000/",
    "timestamp": "2025-04-13T00:30:08Z"
  },
  {
    "title": "Smartphones & computers officially exempt from Trump's tariffs",
    "description": "The US government has confirmed that tech segments such as smartphones and computers are exempt from Trump's tariffs.",
    "link": "https://www.androidheadlines.com/2025/04/trump-tariffs-exempt-smartphones-computers-tech.html",
    "timestamp": "2025-04-13T00:29:52Z"
  },
  {
    "title": "US-funded Arabic network ends broadcasts after Trump cuts",
    "description": "Alhurra, the Arabic-language network created by the US government after the Iraq invasion, said Saturday it would cease broadcasts and lay off most staff...",
    "link": "https://www.yahoo.com/news/us-funded-arabic-network-ends-002711994.html",
    "timestamp": "2025-04-13T00:27:11Z"
  },
  {
    "title": "Tim Cook’s ass-kissing pays off",
    "description": "And I do mean pays off: President Donald Trump exempted smartphones, computers, and other tech devices and components from his reciprocal tariffs, new guidance from U.S. Customs and Border Protection shows. The guidance, issued late Friday evening, comes afte…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/tim-cooks-ass-kissing-pays-off",
    "timestamp": "2025-04-13T00:26:34Z"
  },
  {
    "title": "Trump team holds 'constructive' face-to-face nuclear talks with Iran, will meet again next weekend",
    "description": "The U.S. and Iran held rare face-to-face nuclear talks in Oman Saturday. The Trump administration is pushing for diplomacy backed by military pressure.",
    "link": "https://www.foxnews.com/world/trump-team-holds-constructive-nuclear-talks-iran-meet-again-next-weekend",
    "timestamp": "2025-04-13T00:25:32Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?s=a2&share_destination_id=MTM3Njk3NDYwLTE3NDQ1MDM4NjAwOTU%3D&pd=09JlOmIr&hl=en_US&send_time=1744503860&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v1%2Cns_push_exp_rt_bucketv12-control%2Cns_local_strategy_25q1_exp-v9%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v9",
    "timestamp": "2025-04-13T00:24:45Z"
  },
  {
    "title": "Israel cuts off Gaza's southern city of Rafah, seizing key corridor",
    "description": "Israeli Defence Minister Israel Katz says military operations will intensify and expand to other areas throughout most of Gaza while Gazans are urged to evacuate from the battlefield.",
    "link": "https://www.abc.net.au/news/2025-04-13/israel-seizes-key-corridor-in-gaza/105170760",
    "timestamp": "2025-04-13T00:20:18Z"
  },
  {
    "title": "Patients evacuated from Gaza hospital after Israeli airstrike",
    "description": "A Gaza Hospital has evacuated patients minutes before an Israeli air strike destroyed intensive care units.",
    "link": "https://www.abc.net.au/news/2025-04-13/patients-evacuated-from-gaza-hospital-after-israeli-airstrike/105170760",
    "timestamp": "2025-04-13T00:20:18Z"
  },
  {
    "title": "UK government takes control of last virgin steel plant after Chinese owners threaten shutdown of essential national security infrastructure",
    "description": "The repercussions would be huge for industries like construction, defense and rail and make the country dependent on foreign sources.",
    "link": "https://nypost.com/2025/04/12/world-news/uk-government-takes-control-of-last-virgin-steel-plant-after-chinese-owners-threaten-shutdown-of-essential-national-security-infrastructure/",
    "timestamp": "2025-04-13T00:17:22Z"
  },
  {
    "title": "Man mistakenly deported to El Salvador 'alive and secure', US says",
    "description": "A judge has called for the Trump administration to facilitate the return of Kilmar Abrego Garcia to the US.",
    "link": "https://www.bbc.com/news/articles/c9qwxwrr74jo",
    "timestamp": "2025-04-13T00:12:16Z"
  },
  {
    "title": "Trump Administration Gives Status Update on Abrego Garcia",
    "description": "A new court filing on Saturday clarified the status of Kilmar Armando Abrego Garcia by the deadline set by U.S. District Judge Paula Xinis.",
    "link": "https://www.newsweek.com/trump-admin-status-kilmar-abrego-garcia-2059081",
    "timestamp": "2025-04-13T00:11:37Z"
  },
  {
    "title": "Donald Trump is now badly wounded. Europe and the UK can seize an advantage (Will Hutton/The Guardian)",
    "description": "Will Hutton / The Guardian:\nDonald Trump is now badly wounded.  Europe and the UK can seize an advantage  —  It's time to fashion a new global trade order without the US  —  The game-changing geopolitical event last week was the near collapse of the immense $…",
    "link": "https://www.memeorandum.com/250412/p68",
    "timestamp": "2025-04-13T00:05:01Z"
  },
  {
    "title": "Trump's China tariff shocks US importers",
    "description": "U.S. importers are bracing for the impact of President Donald Trump's staggering 145% levy on Chinese imports.",
    "link": "https://www.wishtv.com/news/business/trumps-china-tariff-shocks-us-importers-one-ceo-calls-it-end-of-days/",
    "timestamp": "2025-04-13T00:01:28Z"
  },
  {
    "title": "Helium (HNT) Jumps After SEC Dismisses Lawsuit Against Team Behind the Decentralized Wireless Network",
    "description": "A Solana (SOL)-based decentralized wireless network crypto project is skyrocketing after the U.S. Securities and Exchange Commission (SEC) dismissed its lawsuit against the protocol. In a new thread on the social media platform X, the development team behind …",
    "link": "https://dailyhodl.com/2025/04/12/helium-hnt-jumps-after-sec-dismisses-lawsuit-against-team-behind-the-decentralized-wireless-network/",
    "timestamp": "2025-04-13T00:00:57Z"
  },
  {
    "title": "Is Bitcoin Price Returning To $74,000? Analyst Identifies Pattern That Suggests So",
    "description": "The Bitcoin price had a rollercoaster journey over the past week, falling to its lowest level in six months on Wednesday, April 9. The flagship cryptocurrency showed some resilience, recovering above the $80,000 level after United States President Donald Trum…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-return-to-74000-pattern-suggests-so/",
    "timestamp": "2025-04-13T00:00:00Z"
  },
  {
    "title": "Trump exempts smartphones and computers from new tariffs",
    "description": "Trump exempts smartphones and computers from new tariffs\nUS President Donald Trump's administration has exempted smartphones, computers and some other electronic devices from \"reciprocal\" tariffs, including the 125% levies imposed on Chinese imports.\nUS Custo…",
    "link": "https://biztoc.com/x/238e88b2334225be",
    "timestamp": "2025-04-12T23:57:38Z"
  },
  {
    "title": "Keith Olbermann Condemns Bill Maher’s Positive Visit With Trump",
    "description": "The American journalist further called Maher a “shameless opportunist with no real principles,” having known him “since 1978.”",
    "link": "http://www.hollywoodreporter.com/news/general-news/keith-olbermann-condemns-bill-maher-trump-white-house-visit-1236189481/",
    "timestamp": "2025-04-12T23:55:04Z"
  },
  {
    "title": "Mistakenly deported man is alive and detained in El Salvador, Trump admin says",
    "description": "The Trump administration, in a filing posted to the docket several minutes after a 5 p.m. Saturday deadline, said Kilmar Abrego Garcia is alive and remains detained in El Salvador.",
    "link": "https://www.nbcnews.com/politics/immigration/mistakenly-deported-man-alive-detained-el-salvador-trump-admin-says-rcna201018",
    "timestamp": "2025-04-12T23:52:22Z"
  },
  {
    "title": "Bill Maher Praises 'Gracious,' 'Measured' Trump After Wild White House Meeting: 'You Can Hate Me For It, But I'm Not a Liar' (Zachary Leeman/Mediaite)",
    "description": "Zachary Leeman / Mediaite:\nBill Maher Praises ‘Gracious,’ ‘Measured’ Trump After Wild White House Meeting: 'You Can Hate Me For It, But I'm Not a Liar'  —  Bill Maher praised President Donald Trump as “gracious” and “measured” during their recent White House …",
    "link": "https://www.memeorandum.com/250412/p67",
    "timestamp": "2025-04-12T23:50:01Z"
  },
  {
    "title": "Judge Eases Ban on DOGE Accessing Sensitive Treasury Data",
    "description": "Judge Vargas partially lifted restrictions allowing a DOGE member access to Treasury data amid ongoing legal battles over privacy concerns.",
    "link": "https://www.newsweek.com/judge-eases-ban-doge-accessing-sensitive-treasury-data-2059054",
    "timestamp": "2025-04-12T23:49:38Z"
  },
  {
    "title": "Trump 'looking forward to' seeing El Salvador's Bukele",
    "description": "United States President Donald Trump stated that he was \"looking forward to\" meeting with El Salvador President Nayib Bukele on April 14.In a post on Truth Social, Trump wrote that the US and El Salva...",
    "link": "https://biztoc.com/x/f5813b200cecb0aa",
    "timestamp": "2025-04-12T23:46:22Z"
  },
  {
    "title": "'Trump slump' in travel to U.S. could hit hard in San Diego, where tourism looms large",
    "description": "International arrivals are plummeting across the board as tourists angered by Trump's tariffs and rhetoric cancel their U.S. plans.",
    "link": "http://timesofsandiego.com/business/2025/04/12/trump-slump-in-travel-to-u-s-could-hit-hard-in-san-diego-where-tourism-looms-large/",
    "timestamp": "2025-04-12T23:43:48Z"
  },
  {
    "title": "U.S. and Iran hold 'positive' talks in Oman, with more to come this week",
    "description": "The talks were indirect, though Iran's foreign minister said his delegation had a brief encounter with its U.S. counterpart after they exited the talks.",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/world/politics/us-iran-talks-oman/",
    "timestamp": "2025-04-12T23:37:00Z"
  },
  {
    "title": "‘Revolution With Joy’: Bernie and AOC Draw Massive Crowd in Los Angeles",
    "description": "Sanders and Alexandria Ocasio-Cortez drew 36,000 supporters for his “Fighting Oligarchy” rally in Los Angeles on Saturday, according to his team.",
    "link": "http://www.rollingstone.com/politics/politics-news/bernie-sanders-aoc-los-angeles-crowd-fighting-oligarchy-1235316393/",
    "timestamp": "2025-04-12T23:32:29Z"
  },
  {
    "title": "White House replaces Obama portrait with defiant Trump",
    "description": "The White House has installed a striking painting of President Trump in the Grand Foyer, replacing the official portrait of Barack Obama Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615689-trump-obama-portrait-white-house/",
    "timestamp": "2025-04-12T23:24:30Z"
  },
  {
    "title": "Ten days, $5 trillion lost: The cost of a trade war unleashed",
    "description": "As tit-for-tat tariff hikes between the US and China escalated, reaching 145% and 125%, investors scrambled to manage risk amid plummeting stocks, collapsing oil prices, and a historic selloff in US Treasuries.",
    "link": "https://www.thehindubusinessline.com/markets/ten-days-5-trillion-lost-the-cost-of-a-trade-war-unleashed/article69444400.ece",
    "timestamp": "2025-04-12T23:21:43Z"
  },
  {
    "title": "Trump ‘IS Going to Run’ for Third Term and ‘IS’ Going to Win, Bannon Insists to Bill Maher: On January 20, 2029 ‘He’s Gonna Be President’",
    "description": "Bannon was so certain of what he claimed that he suggested Maher autograph a copy of the 22nd Amendment for him-- which prohibits a third run -- after the show.\nThe post Trump ‘IS Going to Run’ for Third Term and ‘IS’ Going to Win, Bannon Insists to Bill Mahe…",
    "link": "https://www.mediaite.com/tv/trump-is-going-to-run-for-third-term-and-is-going-to-win-bannon-insists-to-bill-maher-on-january-20-2029-hes-gonna-be-president/",
    "timestamp": "2025-04-12T23:19:13Z"
  },
  {
    "title": "White House Urges Consumers to 'Trust in Trump' on Prices",
    "description": "The White House is urging Americans concerned by global tariff battles to \"trust\" President Donald Trump as China retaliates.\nAsked at Friday's news briefing about the falling consumer sentiment, White House press secretary Karoline Leavitt said that the publ…",
    "link": "https://biztoc.com/x/9a6a94b6b0cee34e",
    "timestamp": "2025-04-12T23:13:48Z"
  },
  {
    "title": "Trump orders military to take control of federal land at southern border",
    "description": "President Trump in a memorandum Friday ordered the military to take control of a strip of federal land along the Southern border that would be designated \"National Defense Areas.\"",
    "link": "https://www.foxnews.com/politics/trump-orders-military-control-federal-lands-southern-border",
    "timestamp": "2025-04-12T23:10:25Z"
  },
  {
    "title": "Looking forward to seeing President Bukele, of El Salvador, on Monday! Our Nations are working closely together to eradicate terrorist organizations, and build a future of Prosperity.",
    "description": "President Bukele has graciously accepted into his Nation’s custody some of the most violent alien enemies of the World and, in particular, the United States. These barbarians are now in the sole custody of El Salvador, a proud and sovereign Nation, and their …",
    "link": "https://freerepublic.com/focus/f-news/4310679/posts",
    "timestamp": "2025-04-12T23:08:38Z"
  },
  {
    "title": "Bernie Sanders' Crowd Size 'Biggest' Ever at LA Rally With AOC—Staff",
    "description": "\"Their religion is based on greed, greed and more greed,\" the progressive senator said, referring to billionaires.",
    "link": "https://www.newsweek.com/bernie-sanders-crowd-size-biggest-ever-los-angeles-rally-aoc-2059072",
    "timestamp": "2025-04-12T23:06:10Z"
  },
  {
    "title": "'Cruel and Dangerous': Trump Ends Protected Status for Afghans and Cameroonians",
    "description": "The Trump administration announced on Friday that it was revoking the Temporary Protected Status—or TPS—for thousands of immigrants from Cameroon and Afghanistan who are currently living and working in the United States.The move, the latest attempt by the adm…",
    "link": "https://www.commondreams.org/news/trump-ends-tps-afghanistan-cameroon",
    "timestamp": "2025-04-12T23:04:57Z"
  },
  {
    "title": "Chevron’s Venezuelan Oil Cargoes Canceled, Stalled Amid Payment Uncertainty",
    "description": "HOUSTON, April 11 (Reuters) – At least two vessels carrying Venezuelan crude chartered by Chevron CVX.N are stalled due to state oil company PDVSA canceling their export authorizations, according to shipping data and sources, as the...",
    "link": "https://gcaptain.com/chevrons-venezuelan-oil-cargoes-canceled-stalled-amid-payment-uncertainty/",
    "timestamp": "2025-04-12T23:03:36Z"
  },
  {
    "title": "Germany’s Merz says Trump tariffs risk fanning a financial crisis",
    "description": "German Chancellor-in-waiting Friedrich Merz said Donald Trump’s tariff policies increase the risk of a financial crisis and advocated for a US-European free trade agreement, picking up on an idea that has drawn a hostile response from the US president.\n“Yes, …",
    "link": "https://biztoc.com/x/cbf67b64df4f5360",
    "timestamp": "2025-04-12T23:02:38Z"
  },
  {
    "title": "Did Trump engage in insider trading? Experts say he’s unlikely to have legal troubles",
    "description": "A social media post on April 9, followed by a market-moving tariff announcement, led President Donald Trump’s critics to speculate that he might have profited from inside information. Legal and financial experts downplayed the idea that Trump’s message ran af…",
    "link": "https://biztoc.com/x/e0d1cc6beb8ea316",
    "timestamp": "2025-04-12T23:02:35Z"
  },
  {
    "title": "'Thousands of British businesses' hit by Trump's tariffs get £10 billion government...",
    "description": "Rachel Reeves has unveiled a multi-billion pound support package for British businesses that have been affected by the new US tariffs.",
    "link": "https://www.lbc.co.uk/business/business-support-government-trump-tariffs/",
    "timestamp": "2025-04-12T23:02:30Z"
  },
  {
    "title": "Money and grotesque flattery: The art of doing a deal with Trump",
    "description": "Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure.",
    "link": "https://news.sky.com/story/money-and-grotesque-flattery-the-art-of-doing-a-deal-with-donald-trump-is-to-make-sure-there-is-an-upside-for-him-13346421",
    "timestamp": "2025-04-12T23:01:00Z"
  },
  {
    "title": "US-Iran nuclear talks resume after years, next round set for April 19",
    "description": "Iran and the US to hold more nuclear talks next week after \"very positive and constructive\" initial discussions in Oman.",
    "link": "https://www.thehindubusinessline.com/news/world/us-iran-nuclear-talks-resume-after-years-next-round-set-for-april-19/article69444398.ece",
    "timestamp": "2025-04-12T23:00:23Z"
  },
  {
    "title": "Trump is 'going to run for a third term,' Steve Bannon tells Bill Maher",
    "description": "Trump ally Steve Bannon told Bill Maher that President Trump will seek a third term in 2028, sparking a constitutional debate with Maher on 'Real Time' Friday night.",
    "link": "https://www.foxnews.com/media/trump-going-run-third-term-steve-bannon-tells-bill-maher",
    "timestamp": "2025-04-12T23:00:23Z"
  },
  {
    "title": "Anwar: Presenting a united Asean force against US tariffs",
    "description": "BUTTERWORTH: Malaysia will use its strength and good relations with other countries, including neighbouring Asean nations, to deal with the recent tariff announcements, said Prime Minister Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/13/anwar-presenting-a-united-asean-force-against-us-tariffs",
    "timestamp": "2025-04-12T23:00:00Z"
  },
  {
    "title": "Get message across clearly",
    "description": "In these chaotic times, it's not a good idea for the government to issue opaque statements that do little to reassure the people. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/beyond-boundaries/2025/04/13/get-message-across-clearly",
    "timestamp": "2025-04-12T23:00:00Z"
  },
  {
    "title": "Is Pax Americana over?",
    "description": "A trust deficit could be a much bigger problem for America than a trade deficit. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/2025/04/13/is-pax-americana--over",
    "timestamp": "2025-04-12T23:00:00Z"
  },
  {
    "title": "Did Trump engage in insider trading? Experts say he’s unlikely to have legal troubles",
    "description": "A social media post on April 9, followed by a market-moving tariff announcement, led President Donald Trump’s critics to speculate that he might have profited from inside information. Legal and financial experts downplayed the idea that Trump’s message ran af…",
    "link": "https://www.pbs.org/newshour/politics/did-trump-engage-in-insider-trading-experts-say-hes-unlikely-to-have-legal-troubles",
    "timestamp": "2025-04-12T22:54:54Z"
  },
  {
    "title": "Trump DOJ lawyers face contempt charges as they give 'contemptuous response' to judge",
    "description": "Donald Trump's Justice Department lawyers are reportedly facing potential contempt charges, at the same time as they are offering a \"contemptuous response\" to a judge.\n\nThe Supreme Court recently issued a tepid ruling in a case involving a wrongly deported ma…",
    "link": "https://www.rawstory.com/trump-doj-lawyers-contempt/",
    "timestamp": "2025-04-12T22:54:41Z"
  },
  {
    "title": "Iran, US plan talks next week after ‘constructive’ meeting",
    "description": "Iran said the first formal talks with U.S. President Donald Trump’s administration over its nuclear program were “constructive” with both sides agreeing to meet again next week.",
    "link": "https://www.bostonherald.com/2025/04/12/iran-us-plan-talks-next-week-after-constructive-meeting/",
    "timestamp": "2025-04-12T22:42:27Z"
  },
  {
    "title": "Elon Musk's Brother Kimbal Blasts Trump: 'Celebrating Causing China's Stock Market To Go Down, By Causing Our Own Stock Market To Go Down?'",
    "description": "Kimbal Musk, Tesla (NASDAQ:TSLA) board member and brother of CEO Elon Musk, has gone public with sharp criticism of President Donald Trump’s trade policies, calling tariffs a “structural, permanent tax on the American consumer” and accusing Trump of celebrati…",
    "link": "https://biztoc.com/x/4b9ccaece10d8c73",
    "timestamp": "2025-04-12T22:40:34Z"
  },
  {
    "title": "SNL: Bowen Yang REALLY Wants Lorne Michaels to Find a New JD Vance",
    "description": "Playing political figures is a rite of passage in Saturday Night Live, and it's something writer/cast member Bowen Yang is abundantly aware of, playing Vice President J.D. Vance. Maybe it's doubt or wear, but the Wicked star appeared on The Daily Show about w…",
    "link": "https://bleedingcool.com/tv/snl-bowen-yang-really-wants-lorne-michaels-to-find-a-new-jd-vance/",
    "timestamp": "2025-04-12T22:37:06Z"
  },
  {
    "title": "US Citizen Told by Trump Admin to Self-Deport Amid Crackdown",
    "description": "A senior Department of Homeland Security official told Newsweek that emails were sent to those associated with parole cases.",
    "link": "https://www.newsweek.com/us-citizen-told-self-deport-dhs-email-trump-administration-2059069",
    "timestamp": "2025-04-12T22:36:13Z"
  },
  {
    "title": "Trump Admin Says Man They Illegally Deported to El Salvador Is ‘Alive’",
    "description": "Donald Trump illegally deported Abrego Garcia to El Salvador. The administration said he’s alive, but has not said what it’s doing to bring him back.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-kilmar-abrego-garcia-alive-el-salvador-supreme-court-1235316383/",
    "timestamp": "2025-04-12T22:33:36Z"
  },
  {
    "title": "Wisconsin teen allegedly kills parents 'to obtain financial means' to assassinate Trump, linked to 'satanic cult': DOJ",
    "description": "A Wisconsin teenager allegedly killed his parents in order to \"obtain the financial means and autonomy necessary\" so that he could assassinate President Donald Trump and overthrow the government of the United States, according to court documents from the Depa…",
    "link": "https://freerepublic.com/focus/f-news/4310673/posts",
    "timestamp": "2025-04-12T22:32:15Z"
  },
  {
    "title": "Elon Musk's Brother Kimbal Blasts Trump: 'Celebrating Causing China's Stock Market To Go Down, By Causing Our Own Stock Market To Go Down?'",
    "description": "Kimbal Musk, Tesla (NASDAQ:TSLA) board member and brother of CEO Elon Musk, has gone public with sharp criticism of President Donald Trump’s trade policies, ...",
    "link": "https://finance.yahoo.com/news/elon-musks-brother-kimbal-blasts-223041565.html",
    "timestamp": "2025-04-12T22:30:41Z"
  },
  {
    "title": "Larry Summers says DOGE is going to end in a 'disastrous failure'",
    "description": "Former Treasury Secretary Larry Summers said in the latest All-In Podcast that DOGE is wreaking havoc on American institutions such as the IRS.",
    "link": "https://www.businessinsider.com/larry-summers-doge-disastrous-failure-all-in-podcast-trump-administration-2025-4",
    "timestamp": "2025-04-12T22:29:01Z"
  },
  {
    "title": "Exclusive -- 'Ironic How Liberal Media Weaponizes Woke Cancel Culture': RFK Jr. Hammers Fake News Attacks Falsely Claiming He Mocked Handicapped",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. is responding to a baseless onslaught after several publications misquoted him Friday on his use of the word “retarded.”\nThe post Exclusive — ‘Ironic How Liberal Media Weaponizes Woke Cancel Culture’: …",
    "link": "https://www.breitbart.com/live/exclusive-ironic-how-liberal-media-weaponizes-woke-cancel-culture-rfk-jr-hammers-fake-news-attacks-falsely-claiming-he-mocked-handicapped/",
    "timestamp": "2025-04-12T22:26:16Z"
  },
  {
    "title": "A test of US voters even more critical than 2024",
    "description": "On 1 April, polling respondents weren't fooling when they began signaling buckram opposition to Trump's comedy of terrors: world trade on fire; the U.S., its bellows. The following approval ratings (taken from RealClearPolling) were published on Tuesday, 8 Ap…",
    "link": "https://www.pmcarpenter.com/post/a-test-of-us-voters-even-more-critical-than-2024",
    "timestamp": "2025-04-12T22:22:42Z"
  },
  {
    "title": "Bill Maher Praises Trump After Attending Private Dinner Organized by Kid Rock",
    "description": "\"A crazy person doesn't live in the White House. A person who plays a crazy person on TV a lot lives there,\" Maher said of his experience.\nBill Maher Praises Trump After Attending Private Dinner Organized by Kid Rock\nJo Vito",
    "link": "https://consequence.net/2025/04/bill-maher-praises-donald-trump-dinner/",
    "timestamp": "2025-04-12T22:22:26Z"
  },
  {
    "title": "White House Reportedly Directs NIH To Study ‘Detransition,’ Trans ‘Regret’",
    "description": "The Trump administration directed its main biomedical research agency in mid-March to study the physical and psychological effects of child gender transitioning.",
    "link": "https://dailycaller.com/2025/04/12/trump-national-institutes-of-health-detransition-trans-hhs-nih/",
    "timestamp": "2025-04-12T22:16:21Z"
  },
  {
    "title": "Trump to attend UFC 314 fight in Miami",
    "description": "During Trump’s visit to Florida, he is expected to jaunt south to Miami-Dade County to attend UFC 314.",
    "link": "https://www.palmbeachpost.com/story/news/2025/04/12/trump-ufc-fight-miami-yair-rodriguez-patricio-freire-match-time/83059791007/",
    "timestamp": "2025-04-12T22:15:43Z"
  },
  {
    "title": "Trump Administration Faces New Lawsuit From Elite University's Professors",
    "description": "The Trump administration has initiated a review of Harvard University's roughly $9 billion in federal funding due to failing to handle antisemitism on campus.",
    "link": "https://www.newsweek.com/trump-administration-faces-lawsuit-harvard-university-professors-2059061",
    "timestamp": "2025-04-12T22:14:24Z"
  },
  {
    "title": "Trump extends Russia sanctions for 12 months",
    "description": "US President Donald Trump has prolonged by another year anti-Russian sanctions imposed by his predecessor, Joe Biden, suggesting that Moscow continues to pose a serious threat to the country's national security. Washington slapped punitive measures on Russia …",
    "link": "https://freerepublic.com/focus/f-chat/4310670/posts",
    "timestamp": "2025-04-12T22:13:03Z"
  },
  {
    "title": "‘Gun to the Head’: Harvard Professors Sue Trump Admin Over Review of $9 Billion in Funding",
    "description": "Harvard professors sued the Trump administration over its review of $9 billion in federal funding for the university following pro-Palestine protests.",
    "link": "http://www.rollingstone.com/politics/politics-news/harvard-professors-trump-lawsuit-funding-billions-1235316377/",
    "timestamp": "2025-04-12T22:10:49Z"
  },
  {
    "title": "Boycotting Israeli brains: A look at the anti-Israel academic boycott",
    "description": "Israeli brains were subjected to boycott, disguised as pro-human rights. And to a large extent, they still are.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-849543",
    "timestamp": "2025-04-12T22:04:04Z"
  },
  {
    "title": "Comedian reacts to China’s call to unite against Trump ‘tyranny’",
    "description": "Panelists join Roy Wood Jr., Amber Ruffin and Michael Black on “Have I Got News For You,” to discuss China’s reaction to President Donald Trump’s tariffs. The show airs on CNN Saturdays at 9pm ET and is released on Max on Sundays. Watch the full episodes on C…",
    "link": "https://www.cnn.com/2025/04/12/politics/video/roy-wood-jr-amber-ruffin-trump-china-tariffs-hignfy-digvid",
    "timestamp": "2025-04-12T22:03:57Z"
  },
  {
    "title": "Bill Maher Finally Reveals Details of His White House Meeting With President Trump",
    "description": "\"You can hate me for it, but I'm not a liar. Trump was gracious and measured\"\nThe post Bill Maher Finally Reveals Details of His White House Meeting With President Trump first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/bill-maher-finally-reveals-details-of-his-white-house-meeting-with-president-trump/",
    "timestamp": "2025-04-12T22:00:54Z"
  },
  {
    "title": "Trump’s Press Team Won’t Respond to Emails With ‘Preferred Pronouns’ in Signature",
    "description": "Reporters often contact government officials to request statements or quotes on significant events or policies, but President Donald Trump’s press deputies have determined that one... Read More\nThe post Trump’s Press Team Won’t Respond to Emails With ‘Preferr…",
    "link": "https://www.dailysignal.com/2025/04/12/trumps-press-team-wont-respond-emails-with-preferred-pronouns-signature/",
    "timestamp": "2025-04-12T22:00:00Z"
  },
  {
    "title": "Cut the Bureaucracy, Save Social Security",
    "description": "Millions of Americans know the frustration of dealing with the Social Security Administration—endless hold music on the phone, months of waiting for a simple benefit... Read More\nThe post Cut the Bureaucracy, Save Social Security appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/04/12/cut-the-bureaucracy-save-social-security/",
    "timestamp": "2025-04-12T22:00:00Z"
  },
  {
    "title": "US and Iran hold 'positive and productive' talks over Tehran nuclear program",
    "description": "With Donald Trump and Benjamin Netanyahu threatening to bomb Iran if it does not restrain its nuclear ambition, the discussions in Oman come at a crucial time.",
    "link": "https://www.abc.net.au/news/2025-04-13/us-iran-nuclear-talk-in-oman/105170642",
    "timestamp": "2025-04-12T21:59:06Z"
  },
  {
    "title": "Sen. Markey, Rep. Clark attend 'Give Us Liberty' rally at Mass. school",
    "description": "The event comes after what organizers call attacks on civil liberties by President Donald Trump and billionaire Elon Musk.",
    "link": "https://www.wcvb.com/article/markey-clark-attend-give-us-liberty-rally-at-massachusetts-high-school/64465085",
    "timestamp": "2025-04-12T21:58:31Z"
  },
  {
    "title": "The Left discovers Milton Friedman",
    "description": "But on topics other than tariffs, they'd vehemently disagree with famed economist",
    "link": "https://www.wnd.com/2025/04/the-left-discovers-milton-friedman/",
    "timestamp": "2025-04-12T21:52:52Z"
  },
  {
    "title": "GOP Congressman Files Suit for $2.5 Million, Says Capitol Police Retaliated for His Criticisms of Its Jan 6 Response",
    "description": "GOP Congressman Files Suit for $2.5 Million, Says Capitol Police Retaliated for His Criticisms of Its Jan 6 Responsewesternjournal.com",
    "link": "https://www.westernjournal.com/gop-congressman-files-suit-2-5-million-says-capitol-police-retaliated-criticisms-jan-6-response/",
    "timestamp": "2025-04-12T21:52:37Z"
  },
  {
    "title": "Trump’s life’s work culminates in confronting Communist China",
    "description": "There's no one better to crush the CCP than the White House-dwelling class traitor par excellence",
    "link": "https://www.wnd.com/2025/04/trumps-lifes-work-culminates-in-confronting-communist-china/",
    "timestamp": "2025-04-12T21:51:32Z"
  },
  {
    "title": "How Trump can turn tariffs into a grand slam home run",
    "description": "The president 'is willing to gamble his legacy on what he knows is the right thing to do'",
    "link": "https://www.wnd.com/2025/04/how-trump-can-turn-tariffs-into-a-grand-slam-home-run/",
    "timestamp": "2025-04-12T21:49:27Z"
  },
  {
    "title": "City councilors, Harvard faculty, hold rally against Trump admin",
    "description": "The rally comes after hundreds of faculty and staff penned a letter to Harvard asking the university to defend free speech and the right to education.",
    "link": "https://www.wcvb.com/article/cambridge-city-councilors-harvard-faculty-rally-against-trump-administration/64464935",
    "timestamp": "2025-04-12T21:48:28Z"
  },
  {
    "title": "‘Hands Off’ protesters don’t know what they’re protesting",
    "description": "I won't 'honk for democracy.' We are a constitutional republic; I'll honk for that",
    "link": "https://www.wnd.com/2025/04/hands-off-protesters-dont-know-what-theyre-protesting/",
    "timestamp": "2025-04-12T21:48:02Z"
  },
  {
    "title": "U.S. exempts tech imports in tariff step back",
    "description": "President Donald Trump's move offers relief to U.S. tech firms and partially dials down a trade war with China.",
    "link": "https://www.japantimes.co.jp/business/2025/04/13/economy/trump-tariff-exemptions-smartphones-tech/",
    "timestamp": "2025-04-12T21:48:00Z"
  },
  {
    "title": "‘So-Called Secretary of Defense’: Dem Leader Hakeem Jeffries Rips Pete Hegseth as ‘Dumb Effing Individual’ in DEI Book Ban Vid",
    "description": "A purge of books at the U.S. Naval Academy for being \"DEI\" content prompted a furious video from the Democratic leader calling for Hegseth's ouster.\nThe post ‘So-Called Secretary of Defense’: Dem Leader Hakeem Jeffries Rips Pete Hegseth as ‘Dumb Effing Indivi…",
    "link": "https://www.mediaite.com/politics/so-called-secretary-of-defense-dem-leader-hakeem-jeffries-rips-pete-hegseth-as-dumb-effing-individual-in-dei-book-ban-vid/",
    "timestamp": "2025-04-12T21:46:34Z"
  },
  {
    "title": "Trump hates sharing the spotlight with anybody. But Musk is different. (Giselle Ruhiyyih Ewing/Politico)",
    "description": "Giselle Ruhiyyih Ewing / Politico:\nTrump hates sharing the spotlight with anybody.  But Musk is different.  —  The Trump adviser appears uninhibited in sharing his opinions — and that seems to be just fine with the president.  —  President Donald Trump is not…",
    "link": "https://www.memeorandum.com/250412/p61",
    "timestamp": "2025-04-12T21:45:00Z"
  },
  {
    "title": "ICE Arrests Immigrant Charged With Raping a Child in Sanctuary City",
    "description": "ICE arrested Gilberto Avila-Jara, an Ecuadorian living in the U.S. without valid documentation who faced charges related to sex crimes against a minor.",
    "link": "https://www.newsweek.com/ice-arrests-immigrant-charged-raping-child-sanctuary-city-2059065",
    "timestamp": "2025-04-12T21:44:54Z"
  },
  {
    "title": "Smartphones, Computers, Electronic Devices Exempt from Trump Admin's Tariffs on China",
    "description": "The Trump administration announced that various electronic devices, such as smartphones and computers, will be exempt from the tariffs that have been imposed on China.\nThe post Smartphones, Computers, Electronic Devices Exempt from Trump Admin’s Tariffs on Ch…",
    "link": "https://www.breitbart.com/politics/2025/04/12/smartphones-computers-electronic-devices-exempt-from-trump-admins-tariffs-on-china/",
    "timestamp": "2025-04-12T21:44:51Z"
  },
  {
    "title": "White House Aims To Eliminate NOAA Climate Research In Budget Plan",
    "description": "By Valerie Volcovici April 11 (Reuters) – The administration of President Donald Trump aims to eliminate the arm of the National Oceanic and Atmospheric Administration that oversees research on climate change and refocus the U.S....",
    "link": "https://gcaptain.com/white-house-aims-to-eliminate-noaa-climate-research-in-budget-plan/",
    "timestamp": "2025-04-12T21:43:40Z"
  },
  {
    "title": "‘Stamped From The Beginning’s Roger Ross Williams Earns Impact Award From Miami Film Festival",
    "description": "For a documentary filmmaker, there’s no greater compliment than to hear the words, “Your film made an impact.” For that reason, it was particularly significant this week for Oscar-winning director Roger Ross Williams to earn the Impact Award from the Miami Fi…",
    "link": "http://deadline.com/2025/04/roger-ross-williams-impact-award-miami-film-festival-1236367270/",
    "timestamp": "2025-04-12T21:36:54Z"
  },
  {
    "title": "Chuck Todd Says Trump’s ‘Politically Catastrophic’ Tariffs Are ‘Rattling’ His Own Voters | Video",
    "description": "Such voters \"pay attention to if the Social Security office is taking their phone calls,\" he tells Mediaite's 'Press Club' podcast\nThe post Chuck Todd Says Trump’s ‘Politically Catastrophic’ Tariffs Are ‘Rattling’ His Own Voters | Video appeared first on TheW…",
    "link": "https://www.thewrap.com/chuck-todd-trump-political-catastrophic-tariffs-video/",
    "timestamp": "2025-04-12T21:33:47Z"
  },
  {
    "title": "NASCAR at Bristol: Where to watch, lineup, live stream, race preview, pick to win for the Food City 500",
    "description": "Denny Hamlin looks to defend his Food City 500 crown and earn his third win in a row",
    "link": "https://www.cbssports.com/nascar/news/nascar-at-bristol-where-to-watch-lineup-live-stream-race-preview-pick-to-win-for-the-food-city-500/",
    "timestamp": "2025-04-12T21:33:37Z"
  },
  {
    "title": "Bitcoin Price Volatility Far Lower Than During COVID-19 Crash — What This Means",
    "description": "Over the past few weeks, the cryptocurrency market has been overwhelmed by a high degree of uncertainty and volatility triggered by the constantly shifting global macroeconomics. This unsettled market condition saw the Bitcoin price dance between $74,000 and …",
    "link": "https://bitcoinist.com/bitcoin-price-volatility-is-far-lower-than-covid-19/",
    "timestamp": "2025-04-12T21:30:55Z"
  },
  {
    "title": "Netizens react to Japanese video of anime \"Trump Tariff Man\"",
    "description": "Donald Trump's tariffs sparked global reactions. A fake anime, 'Trump Tariff Man,' went viral. It features Trump as a superhero. Other world leaders like Xi Jinping, Vladimir Putin, and Kim Jong Un are also characters. The internet loved the anime's plot and …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/netizens-react-to-japanese-video-of-anime-trump-tariff-man/articleshow/120241985.cms",
    "timestamp": "2025-04-12T21:29:02Z"
  },
  {
    "title": "Trump can pull stocks back from the brink, but bond and currency markets may not be so easily impressed as they rapidly de-dollarize",
    "description": "President Donald Trump introduced even more volatility and uncertainty into his trade war by exempting a range of consumer electronics and critical tech components. While that is expected to boost shares of US technology companies and the overall stock market…",
    "link": "https://biztoc.com/x/6af5ea837aab9729",
    "timestamp": "2025-04-12T21:23:22Z"
  },
  {
    "title": "EU Must Rethink Relationship With China, Spain's PM Says",
    "description": "Spanish Prime Minister Pedro Sanchez called on the European Union to review its relationship with China amid the global turmoil sparked by the US move to set tariffs on most countries.\nWhat US President Donald Trump is doing to global trade must push Europe t…",
    "link": "https://biztoc.com/x/93d4782256343c86",
    "timestamp": "2025-04-12T21:23:11Z"
  },
  {
    "title": "Trump Can't Recall the Details of His Favorite Cognitive Test (Catherine Bouris/The Daily Beast)",
    "description": "Catherine Bouris / The Daily Beast:\nTrump Can't Recall the Details of His Favorite Cognitive Test  —  AN APPLE A DAY  —  Trump told reporters aboard Air Force One, “It's a pretty well known test.  Whatever it is.  I got every one right.”  —  President Donald …",
    "link": "https://www.memeorandum.com/250412/p59",
    "timestamp": "2025-04-12T21:20:01Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?s=a99&share_destination_id=MjgxNjA3NDA1LTE3NDQ1NTA5MjY3NjE%3D&pd=0J3awvyv&hl=en_US&send_time=1744550926&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v13%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v3",
    "timestamp": "2025-04-12T21:18:22Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?_f=app_share&pd=0DQvSwUz&lang=en_US&send_time=1744503764&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.1.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-control%2Cns_foryou_blend_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v16&s=i2",
    "timestamp": "2025-04-12T21:18:22Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?s=a2&share_destination_id=MjUzNDkwMDA1LTE3NDQ1NDUxNDUyODc%3D&pd=0H9cKTOf&hl=en_US&send_time=1744545145&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v1%2Cns_local_strategy_25q1_exp-v17%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q2-v4",
    "timestamp": "2025-04-12T21:18:22Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?s=a2&share_destination_id=MTQ4NDEwNjQzLTE3NDQ1NTQyMzIyMzc%3D&pd=0A2iO3Aa&hl=en_US&send_time=1744554232&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-v5%2Cns_local_strategy_25q1_exp-v11%2Cns_foryou_blend_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v6",
    "timestamp": "2025-04-12T21:18:22Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?_f=app_share&pd=07ZaHgKj&lang=en_US&send_time=1744499035&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.51.0.21%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-control%2Cns_local_strategy_25q1_exp-v15%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v1&s=i2",
    "timestamp": "2025-04-12T21:18:22Z"
  }
]