[
  {
    "title": "Trump signs executive order asking drugmakers to lower prescription drug costs within 30 days",
    "description": "President Donald Trump on Monday signed a sweeping executive order setting a 30-day deadline for drugmakers to electively lower the cost of prescription drugs in the U.S. or face new limits down the road over what the government will pay.\nThe order calls on t…",
    "link": "https://biztoc.com/x/435517bf7b452164",
    "timestamp": "2025-05-12T18:41:22Z"
  },
  {
    "title": "India and Pakistan’s fragile ceasefire holds — for now",
    "description": "Ali Velshi breaks down the long history that led to the most recent conflict between India and Pakistan over Kashmir and explains why a truce may not hold.",
    "link": "https://www.msnbc.com/top-stories/latest/india-pakistan-ceasefire-kashmir-history-rcna206275",
    "timestamp": "2025-05-12T18:40:16Z"
  },
  {
    "title": "As Biden-era ‘junk fee’ rule takes effect, Ticketmaster says it will display fees more clearly",
    "description": "As a Biden administration ban on so-called “junk fees” took effect Monday, Ticketmaster said it will start displaying the full price of a ticket as soon as consumers begin shopping. Ticketmaster, long a subject of complaints about its hidden fees, was among t…",
    "link": "https://financialpost.com/pmn/as-biden-era-junk-fee-rule-takes-effect-ticketmaster-says-it-will-display-fees-more-clearly",
    "timestamp": "2025-05-12T18:39:49Z"
  },
  {
    "title": "‘Kill Tony’ Showers JD Vance With Praise For Defending His Trump Rally Jokes in Bill Maher Interview",
    "description": "Comedian Tony Hinchcliffe praised Vice President JD Vance as a “badass” on Sunday for defending him during media backlash over a controversial joke told at a Trump rally in the final days of the 2024 election. Hinchcliffe, speaking with Bill Maher on the Club…",
    "link": "https://www.mediaite.com/podcasts/kill-tony-showers-jd-vance-with-praise-for-defending-his-trump-rally-jokes-in-bill-maher-interview/",
    "timestamp": "2025-05-12T18:38:40Z"
  },
  {
    "title": "\"Could've Been Bad Nuke War,\" Claims Trump. What PM Modi Said Shortly After",
    "description": "Donald Trump has taken credit for having &quot;stopped a nuclear conflict - a bad one&quot; in the brink of time. Both India and Pakistan have &quot;lots of nuclear weapons&quot;, said the US President, adding that the two nations were going at it &quot;hot a…",
    "link": "https://www.ndtv.com/world-news/couldve-been-a-bad-nuke-war-claims-trump-what-pm-modi-said-shortly-after-8398052",
    "timestamp": "2025-05-12T18:36:15Z"
  },
  {
    "title": "Hamas frees US-Israeli soldier as Gaza faces bombardment, risk of famine",
    "description": "Hamas frees Edan Alexander as Israel presses on with its Gaza assault and 71-day blockade of all aid.",
    "link": "https://www.aljazeera.com/news/2025/5/12/hamas-frees-us-israeli-soldier-as-gaza-faces-bombardment-risk-of-famine",
    "timestamp": "2025-05-12T18:35:45Z"
  },
  {
    "title": "Markets are putting their trust back in Trump, as long as trade deals keep going",
    "description": "The tentative U.S.-China trade deal brought a fresh wave of optimism to Wall Street.",
    "link": "https://www.cnbc.com/2025/05/12/markets-are-putting-their-trust-back-in-trump-as-long-as-trade-deals-keep-going.html",
    "timestamp": "2025-05-12T18:34:19Z"
  },
  {
    "title": "Kai Trump looks a bit shy as she celebrates her 18th birthday in a bizarre video with friends",
    "description": "Kai Trump, the eldest granddaughter of U.S. President Donald Trump, recently celebrated her 18th birthday in New York City. \n\nThe occasion was marked by a lively celebration with f",
    "link": "https://www.marca.com/en/ncaa/2025/05/12/68223e9946163f488b8b459e.html",
    "timestamp": "2025-05-12T18:32:17Z"
  },
  {
    "title": "Expect China to help Trump on fentanyl, TikTok and midterm elections, says Evercore ISI strategist",
    "description": "U.S. President Donald Trump could have the upper hand in subsequent trade talks with China as the nations hammer out further negotiations, according to Neo Wang, lead China economist and strategist at Evercore ISI.",
    "link": "https://biztoc.com/x/39b83ec1953e11a8",
    "timestamp": "2025-05-12T18:30:37Z"
  },
  {
    "title": "Nvidia stock surges after surprising China trade war news",
    "description": "Most tech stocks are surging today after a shocking announcement from China took the market by storm this morning.\nEven after several strong earnings reports over the past two weeks, many prominent companies have struggled as tariffs levied by President Donal…",
    "link": "https://biztoc.com/x/4fe5d54f011b9f5e",
    "timestamp": "2025-05-12T18:30:33Z"
  },
  {
    "title": "Nonprofits filling labor gaps face existential threat amid Trump’s battle against DEI",
    "description": "Recruiting women into construction and manufacturing has for years been a broadly popular effort to address labor shortages. Trump's aim to stamp out DEI programs threatens that goal.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_7fd6a26c-4e92-5642-b69b-25649dc6af38.html",
    "timestamp": "2025-05-12T18:30:00Z"
  },
  {
    "title": "\"Talks On Op Sindoor, No Reference To Trade In US Talks\": Sources",
    "description": "US President Donald Trump&#039;s claim that ceasefire between India and Pakistan was achieved with the promise of trade, has been denied by government sources.",
    "link": "https://www.ndtv.com/india-news/talks-on-op-sindoor-no-reference-to-trade-in-us-talks-sources-8398007",
    "timestamp": "2025-05-12T18:27:20Z"
  },
  {
    "title": "Trump administration moves to garnish wages of defaulted student loan borrowers: What to know",
    "description": "A CNBC story about the Trump administration's move to garnish wages of defaulted student loan borrowers sparked many readers to write in. Here's what we know.",
    "link": "https://www.cnbc.com/2025/05/12/defaulted-student-loan-borrowers-and-wage-garnishment-what-to-know.html",
    "timestamp": "2025-05-12T18:26:42Z"
  },
  {
    "title": "Donald Trump floats ‘possibility’ of joining Zelenskyy-Putin peace talks",
    "description": "The meeting between the Ukrainian and Russian presidents was first proposed by Volodymyr Zelenskyy, but has still not drawn a response from the Kremlin.",
    "link": "https://www.abc.net.au/news/2025-05-13/trump-ukraine-talks-/105284894",
    "timestamp": "2025-05-12T18:26:33Z"
  },
  {
    "title": "Trump EPA Head Says He Is 'Fixing' Auto Start/Stop",
    "description": "Zeldin, as head of the EPA, is looking to hand a big win to the fossil fuels, which has donated millions of dollars to campaigns across his political career.",
    "link": "https://www.jalopnik.com/1857889/trump-epa-fixing-auto-start-cars/",
    "timestamp": "2025-05-12T18:26:25Z"
  },
  {
    "title": "U.S. and China agree to slash most tariffs for 90 days",
    "description": "The U.S. and Chinese governments have agreed to reduce most tariffs for 90 days. The decision came after top officials from both countries met in Geneva, Switzerland over the weekend. As part of those negotiations, the U.S. has agreed to drop tariffs on Chine…",
    "link": "https://mobilesyrup.com/2025/05/12/us-china-slash-most-tariffs-90-days/",
    "timestamp": "2025-05-12T18:25:15Z"
  },
  {
    "title": "Wikipedia Owners Will Require Increased Security After 35,000+ Accounts Compromised",
    "description": "The Foundation that owns Wikipedia is preparing to require two-factor authentication for users with significant privileges starting in late May. It comes after the Foundation announced in March that they had locked 35,893 accounts across all Foundation-owned …",
    "link": "https://www.breitbart.com/tech/2025/05/12/wikipedia-owners-will-require-increased-security-after-35000-accounts-compromised/",
    "timestamp": "2025-05-12T18:25:14Z"
  },
  {
    "title": "Cannes, the global Colosseum of film, readies for 78th edition with new challenges on the horizon",
    "description": "Geopolitics course through Cannes unlike any other festival.",
    "link": "https://www.bostonherald.com/2025/05/12/cannes-preview/",
    "timestamp": "2025-05-12T18:24:50Z"
  },
  {
    "title": "GOP Unveils Sweeping, Brutal Medicaid Cuts",
    "description": "On Sunday, House Energy and Commerce Committee Chair Brett Guthrie (R-Ky.) released budget reconciliation text that outlined extensive cuts to Medicaid planned by the Republican Party—which the nonpartisan Congressional Budget Office promptly estimated “would…",
    "link": "https://www.motherjones.com/politics/2025/05/republican-medicaid-health-cuts-insurance-gop/",
    "timestamp": "2025-05-12T18:24:49Z"
  },
  {
    "title": "US will accept ‘free plane’ from Qatar for Air Force One, says Trump ahead of Middle East visit",
    "description": "The US president said the ‘contribution’ from the Qatari royal family was a ‘very nice gesture’ as Democrats decry acceptance of $400m gift",
    "link": "https://www.irishtimes.com/world/europe/2025/05/12/trump-qatar-plane-gift/",
    "timestamp": "2025-05-12T18:24:34Z"
  },
  {
    "title": "'Anxiety': Poll shows Trump's economy severely kneecaping goal for more babies",
    "description": "President Donald Trump's economy has caused Americans to reconsider whether to buy a home or start a family, despite his administration's focus on boosting birth rates.Six in 10 Americans say economic anxiety and a lack of affordability have led them to put o…",
    "link": "https://www.rawstory.com/donald-trump-economic-fears/",
    "timestamp": "2025-05-12T18:23:56Z"
  },
  {
    "title": "Mexico President Claudia Sheinbaum Slams Trump Admin's Beef Import Ban",
    "description": "The USDA reinstated the ban over the weekend, citing an \"unacceptable northward advancement\" of screwworm into U.S. territory.",
    "link": "https://www.newsweek.com/mexico-president-claudia-sheinbaum-slams-trump-admins-beef-import-ban-2071141",
    "timestamp": "2025-05-12T18:23:28Z"
  },
  {
    "title": "Too Much SALT Could Ruin the ‘One Big, Beautiful Bill’",
    "description": "President Donald Trump’s “one big, beautiful bill” could be in jeopardy over a major SALT disagreement.   Not the kind of salt that you keep in... Read More\nThe post Too Much SALT Could Ruin the ‘One Big, Beautiful Bill’  appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/12/too-much-salt-could-ruin-the-one-big-beautiful-bill/",
    "timestamp": "2025-05-12T18:23:24Z"
  },
  {
    "title": "Expect China to help Trump on fentanyl, TikTok and midterm elections, says Evercore ISI strategist",
    "description": "U.S. President Donald Trump could have the upper hand in subsequent trade talks with China as the nations hammer out further negotiations, according to Neo Wang, lead China economist and strategist at Evercore ISI.",
    "link": "https://www.nbcnews.com/business/business-news/expect-china-help-trump-fentanyl-tiktok-midterm-elections-says-evercor-rcna206313",
    "timestamp": "2025-05-12T18:21:47Z"
  },
  {
    "title": "Trump’s Cuts Force Clean Techs to Look Into Exiting US Market",
    "description": "Clean-tech companies that were eligible for support under former President Joe Biden are now considering leaving the US as the Trump administration pulls the plug on financing, according to the former head of the program that vetted the firms.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-cuts-force-clean-techs-to-look-into-exiting-us-market",
    "timestamp": "2025-05-12T18:21:44Z"
  },
  {
    "title": "US Tariff Revenue Jumped in April, Before China De-Escalation",
    "description": "The US collected a record amount of revenue from tariffs in April, helping to limit a further widening of the budget deficit, though President Donald Trump’s search for trade deals with targeted nations may scale back future amounts collected.",
    "link": "https://financialpost.com/pmn/business-pmn/us-tariff-revenue-jumped-in-april-before-china-de-escalation",
    "timestamp": "2025-05-12T18:21:28Z"
  },
  {
    "title": "Trump signs executive order setting 30-day deadline for drugmakers to lower prescription drug costs",
    "description": "President Donald Trump has signed an executive order setting a 30-day deadline for drugmakers to electively lower the cost of prescription drugs in the U.S. or face new limits down the road over what the government will pay.",
    "link": "https://www.ksat.com/business/2025/05/12/pharmaceutical-industry-criticizes-the-drug-pricing-plan-trump-says-hell-sign/",
    "timestamp": "2025-05-12T18:20:25Z"
  },
  {
    "title": "Trade war truce won’t help Americans dodge price hikes, Fed governor says",
    "description": "The trade war agreement won’t be enough to avoid price hikes, a Federal Reserve governor said Monday.Read more...",
    "link": "https://qz.com/trade-war-agreement-us-china-price-hikes-fed-governor-1851780288",
    "timestamp": "2025-05-12T18:20:00Z"
  },
  {
    "title": "Trump reportedly frustrated by his inability to make good on foreign policy promises",
    "description": "Donald Trump expected to resolve the crises in Ukraine and Gaza quickly after returning to the White House. I’m surprised by the degree to which he's surprised.",
    "link": "https://biztoc.com/x/2e79011dd3383b4e",
    "timestamp": "2025-05-12T18:19:37Z"
  },
  {
    "title": "Trump Tower Damascus? Syria seeks to charm US president for sanctions relief",
    "description": "A detente with Israel and US access to Syria's oil and gas are part of Syrian leader Ahmed al-Sharaa's strategic pitch to try to get face time with U.S. President Donald Trump during the Mideast tour.",
    "link": "https://www.jpost.com/international/article-853719",
    "timestamp": "2025-05-12T18:18:21Z"
  },
  {
    "title": "Zelensky Says Wants Trump to Be Present at Talks in Istanbul",
    "description": "Trump said earlier that he could travel to Istanbul if he felt this would be useful for the Ukraine settlement talksMOSCOW, May 12. /TASS/. Vladimir Zelensky has said he would like US President Donald Trump to be present at the Russia-Ukraine talks in Istanbu…",
    "link": "https://freerepublic.com/focus/f-news/4316544/posts",
    "timestamp": "2025-05-12T18:18:18Z"
  },
  {
    "title": "Mexico says US suspension of beef imports because of screwworm is unfair",
    "description": "The Trump administration suspended imports of Mexican beef cattle for 15 days.",
    "link": "https://www.bostonherald.com/2025/05/12/mexico-beef/",
    "timestamp": "2025-05-12T18:18:00Z"
  },
  {
    "title": "A Big Beautiful Idea to Cut Taxes, Regulation, Inflation, and the Trade Deficit",
    "description": "In recent comments marking the first 100 days of his second term, President Donald Trump stated that his attention will next focus on efforts to reach a “big beautiful new deal” in Congress to enact significant reductions in federal taxes and regulations. The…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316543/posts",
    "timestamp": "2025-05-12T18:17:07Z"
  },
  {
    "title": "Trump administration is welcoming 49 white South Africans as refugees",
    "description": "The decision has raised questions from refugee advocates.",
    "link": "https://www.bostonherald.com/2025/05/12/us-south-africa-refugees/",
    "timestamp": "2025-05-12T18:15:56Z"
  },
  {
    "title": "How US Tariffs on China Have Changed Since Trump's First Term",
    "description": "The trade dispute between the world's two largest economies has its roots in President Trump's first term.",
    "link": "https://www.newsweek.com/timeline-us-china-tariffs-trade-war-2071098",
    "timestamp": "2025-05-12T18:15:50Z"
  },
  {
    "title": "Trump’s China trade breakthrough might be enough to avoid self-inflicted recession | CNN Business",
    "description": "While the White House backed off from its steepest levies on Chinese goods, economists say it’s still too early to declare the US economy is out of danger altogether. Recession risks remain, even if the odds of a downturn have been dialed back a notch.",
    "link": "https://www.cnn.com/2025/05/12/business/trump-recession-trade-war-china",
    "timestamp": "2025-05-12T18:13:40Z"
  },
  {
    "title": "What Does The Tariff Rollback Mean For The Automotive Sector?",
    "description": "While the U.S. has agreed to lower President Trump’s \"reciprocal tariffs\" on China, auto and metals sector tariffs remain. Rare earth imports could increase.",
    "link": "https://www.forbes.com/sites/stevebanker/2025/05/12/what-does-the-tariff-rollback-mean-for-the-automotive-sector/",
    "timestamp": "2025-05-12T18:13:19Z"
  },
  {
    "title": "Trump Accepts Generous Gift Of Imperial-Class Star Destroyer From Emperor Palpatine",
    "description": "WASHINGTON, D.C. — The White House held a star-studded ceremony today to commemorate a historic occasion, as President Donald Trump accepted a generous gift of an Imperial-Class Star Destroyer from Emperor Palpatine.",
    "link": "https://babylonbee.com/news/trump-accepts-generous-gift-of-imperial-class-star-destroyer-from-emperor-palpatine",
    "timestamp": "2025-05-12T18:10:47Z"
  },
  {
    "title": "Markets Celebrate Total Trump Surrender on Signature Policy (Janna Brancolini/The Daily Beast)",
    "description": "Janna Brancolini / The Daily Beast:\nMarkets Celebrate Total Trump Surrender on Signature Policy  —  WHITE FLAG  —  The U.S. agreed to temporarily lower tariffs on Chinese products while the two sides negotiate.  —  Investors welcomed the news on Monday that P…",
    "link": "https://www.memeorandum.com/250512/p82",
    "timestamp": "2025-05-12T18:10:00Z"
  },
  {
    "title": "US budget surplus rises 23% to $258 billion in April, customs revenue surges",
    "description": "Treasury reported that net customs duties in April totaled $16 billion, about a $9 billion increase from the year-earlier period.  The increase occurred...",
    "link": "https://finance.yahoo.com/news/us-budget-surplus-rises-23-180957705.html",
    "timestamp": "2025-05-12T18:09:57Z"
  },
  {
    "title": "Trump lashes out at ‘ABC fake News’ over question about Qatari plane: ‘You should be embarrassed’",
    "description": "ABC News' Rachel Scott questioned whether a $400 million luxury jet donated by Qatar to the Pentagon could be perceived as a personal gift to Trump.",
    "link": "https://nypost.com/2025/05/12/media/trump-lashes-out-at-abc-fake-news-over-question-about-qatari-plane/",
    "timestamp": "2025-05-12T18:09:00Z"
  },
  {
    "title": "Trump Moves To Rescind Appliance Efficiency Standards",
    "description": "Trump Moves To Rescind Appliance Efficiency Standards\n \nPresident Donald Trump on May 9 moved to rescind appliance energy efficiency standards, calling them “unnecessary radical green agenda policies.”\nIn a memo to the secretary of the Department of Energy, T…",
    "link": "https://biztoc.com/x/64f1186ac3eb2391",
    "timestamp": "2025-05-12T18:08:34Z"
  },
  {
    "title": "‘These Guys Fund Terrorist Organizations!’ Charlamagne Sounds Off on Trump Accepting Plane from Qatar",
    "description": "Charlamagne tha God argued that President Donald Trump accepting a gifted plane from Qatar presented serious national security concerns.\nThe post ‘These Guys Fund Terrorist Organizations!’ Charlamagne Sounds Off on Trump Accepting Plane from Qatar first appea…",
    "link": "https://www.mediaite.com/podcasts/these-guys-fund-terrorist-organizations-charlamagne-sounds-off-on-trump-accepting-plane-from-qatar/",
    "timestamp": "2025-05-12T18:07:48Z"
  },
  {
    "title": "Egypt backs Russia’s peace talks offer to Ukraine",
    "description": "Cairo has expressed support for Moscow’s proposal to resume direct peace talks with Kiev without preconditions Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617431-egypt-russia-ukraine-talks-proposal/",
    "timestamp": "2025-05-12T18:07:31Z"
  },
  {
    "title": "Dow jumps 995 and S&P 500 climbs 2.9% following a 90-day truce in the US-China trade war",
    "description": "U.S. stocks are leaping Monday after China and the United States announced a 90-day truce in their trade war. Each of the world's two largest economies agreed to take down temporarily most of its tariffs against the other, which economists had warned could st…",
    "link": "https://www.timesfreepress.com/news/2025/may/12/dow-jumps-995-and-sp-500-climbs-29-following-a-90-day-truce-in-the-us-china-trade-war-tfp/",
    "timestamp": "2025-05-12T18:06:15Z"
  },
  {
    "title": "Dem Rep. Goldman: Trump Accepting Jet 'Brazen Corruption, a Violation of the Constitution'",
    "description": "On Monday's broadcast of CNN's \"News Central,\" Rep. Dan Goldman (D-NY) claimed President Donald Trump accepting a $400 million jet from Qatar's royal family was \"brazen corruption.\"\nThe post Dem Rep. Goldman: Trump Accepting Jet ‘Brazen Corruption, a Violatio…",
    "link": "https://www.breitbart.com/clips/2025/05/12/dem-rep-goldman-trump-accepting-jet-brazen-corruption-a-violation-of-the-constitution/",
    "timestamp": "2025-05-12T18:06:13Z"
  },
  {
    "title": "Healthcare Stock Explodes 719% After Sudden Merger With Bitcoin Firm Owned by President Trump’s Crypto Advisor",
    "description": "An under-the-radar stock has skyrocketed over 700% after the company merged with a Trump-linked Bitcoin firm to start a BTC treasury strategy. In a press release, KindlyMD (KDLY), a provider of integrated healthcare services, says it’s entering into a definit…",
    "link": "https://dailyhodl.com/2025/05/12/healthcare-stock-explodes-719-after-sudden-merger-with-bitcoin-firm-owned-by-president-trumps-crypto-advisor/",
    "timestamp": "2025-05-12T18:05:41Z"
  },
  {
    "title": "CNET's Daily Tariff Price Tracker: Xbox Up $100 and Other Recent Increases",
    "description": "Check out CNET's price tracker for details on how things are shaping up for several popular products, including recent jumps for Xbox Series X and AirPods Pro 2.",
    "link": "https://www.cnet.com/tech/cnets-daily-tariff-price-tracker-xbox-up-100-and-other-recent-increases/",
    "timestamp": "2025-05-12T18:05:00Z"
  },
  {
    "title": "Ana Navarro Shades Donald Trump On ‘The View’ While Praising The First-Ever American Pope: “Not All American Leaders Are The Same”",
    "description": "Navarro said she hopes the new pope will \"denounce the things that are happening here\" under the Trump administration.",
    "link": "https://decider.com/2025/05/12/ana-navarro-shades-donald-trump-view-american-pope-leaders/",
    "timestamp": "2025-05-12T18:04:47Z"
  },
  {
    "title": "Rep. Scott Peters speaks out against Trump's local food chain program cuts",
    "description": "The USDA under President Donald Trump announced it would end funding for the Local Food Purchase Assistance and Local Food for Schools programs, which under President Joe Biden provided millions for local food supply chains across the country.",
    "link": "https://www.kpbs.org/news/economy/2025/05/12/rep-scott-peters-speaks-out-against-trumps-local-food-chain-program-cuts",
    "timestamp": "2025-05-12T18:03:35Z"
  },
  {
    "title": "Trump Smacks Reporter Over The Head With Important Golf Lesson",
    "description": "Donald Trump dished out a timeless, golf-related life lesson Monday after a reporter asked him about accepting a 747-8 jet from the Qatari royal family.",
    "link": "https://dailycaller.com/2025/05/12/donald-trump-qatari-family-jet-golf-putting-sam-snead/",
    "timestamp": "2025-05-12T18:02:58Z"
  },
  {
    "title": "US SEC chair says agency plans to create new rules for crypto tokens",
    "description": "Paul Atkins, the chair of the Securities and Exchange Commission, laid out his vision for overhauling the agency's cryptocurrency policies on Monday, saying he plans to establish guidelines for distributions of crypto tokens that are securities and consider w…",
    "link": "https://www.channelnewsasia.com/business/us-sec-chair-says-agency-plans-create-new-rules-crypto-tokens-5124926",
    "timestamp": "2025-05-12T18:02:23Z"
  },
  {
    "title": "A hidden symbol at a Pakistani air base speaks of its shattered pride",
    "description": "Operation Sindoor, India's response to the Pahalgam attack, showcased a decisive military campaign that neutralized terrorist infrastructure within Pakistan. India's strategic strikes exposed Pakistan's military vulnerabilities, compelling them to seek a ceas…",
    "link": "https://economictimes.indiatimes.com/news/defence/a-hidden-symbol-at-a-pakistani-air-base-speaks-of-its-shattered-pride/articleshow/121112915.cms",
    "timestamp": "2025-05-12T18:02:22Z"
  },
  {
    "title": "US Military Spent Over $21 Million On Deportation Flights This Year",
    "description": "The US military has spent more than $21 million on flights to deport migrants from the United States during President Donald Trump&#039;s second term, according to figures released Monday.",
    "link": "https://www.ndtv.com/world-news/us-military-spent-over-21-million-on-deportation-flights-this-year-8397877",
    "timestamp": "2025-05-12T18:00:58Z"
  },
  {
    "title": "A Big Beautiful Idea to Cut Taxes, Regulation, Inflation, and the Trade Deficit",
    "description": "In recent comments marking the first 100 days of his second term, President Donald Trump stated that his attention will next focus on efforts to... Read More\nThe post A Big Beautiful Idea to Cut Taxes, Regulation, Inflation, and the Trade Deficit appeared fir…",
    "link": "https://www.dailysignal.com/2025/05/12/big-beautiful-idea-cut-taxes-regulation-inflation-trade-deficit/",
    "timestamp": "2025-05-12T18:00:24Z"
  },
  {
    "title": "DOGE Disruptions Are Just Beginning To Impact Budgeting",
    "description": "While legislation to cut taxes is receiving considerable attention in DC right now, other budgetary events are unfolding that could prove to be highly consequential.",
    "link": "https://www.forbes.com/sites/dougcriscitello/2025/05/12/doge-disruptions-are-just-beginning-to-impact-budgeting/",
    "timestamp": "2025-05-12T17:59:14Z"
  },
  {
    "title": "Republicans propose taking away healthcare from millions of people to partially pay for upper-class tax cuts",
    "description": "Meet the new party, same as the old party: House Republicans have unveiled the cost-saving centerpiece of President Donald Trump’s “big, beautiful bill,” at least $880 billion in cuts largely to Medicaid to help cover the cost of $4.5 trillion in tax breaks. …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/republicans-propose-taking-away-healthcare-from-millions-of-people-to-partially-pay-for-upper-class-tax-cuts",
    "timestamp": "2025-05-12T17:58:19Z"
  },
  {
    "title": "Congressman is investigating fintech Ramp’s attempt to win $25M federal contract",
    "description": "Rep. Gerald Connolly, ranking member of the U.S. House Oversight Committee, has initiated an investigation into whether expense management startup Ramp is receiving preferential treatment in its bid for a $25 million government contract. Connolly sent a lette…",
    "link": "https://techcrunch.com/2025/05/12/congressman-is-investigating-fintech-ramps-attempt-to-win-25m-federal-contract/",
    "timestamp": "2025-05-12T17:58:07Z"
  },
  {
    "title": "Republicans Get Ready to Kill Budget Bill for Not Being Cruel Enough",
    "description": "House Republicans are already opposing House Speaker Mike Johnson’s budget proposal stripping health care coverage from millions of Americans—but not for the reason you think. \r\nTexas Representative Chip Roy was outraged Monday by the House Republicans’ new b…",
    "link": "https://newrepublic.com/post/195138/republicans-kill-budget-bill-medicaid-cuts",
    "timestamp": "2025-05-12T17:57:51Z"
  },
  {
    "title": "Qatari royal family to gift $400 million private jet to Donald Trump; here are others who own some of the world's most expensive private jets",
    "description": "The world’s most expensive private jets are flown by some of the richest and most famous people on the planet, from Donald Trump’s $400 million Boeing 747-8 to Kim Kardashian’s $150 million Gulfstream G650ER. These luxury aircraft aren’t just about travel—the…",
    "link": "https://economictimes.indiatimes.com/news/international/us/qatari-royal-family-to-gift-400-million-private-jet-to-donald-trump-here-are-others-who-own-some-of-the-worlds-most-expensive-private-jets/articleshow/121117352.cms",
    "timestamp": "2025-05-12T17:57:18Z"
  },
  {
    "title": "Researchers found one-click RCE in ASUS’s pre-installed software DriverHub",
    "description": "Expert found two flaws in DriverHub, pre-installed on Asus motherboards, which allow remote code execution via crafted HTTP requests. Security researcher ‘MrBruh’ discovered two vulnerabilities, tracked as CVE-2025-3462 (CVSS score of 8.4) and CVE-2025-3463 (…",
    "link": "https://securityaffairs.com/177731/hacking/researchers-found-one-click-rce-in-asus-s-pre-installed-software-driverhub.html",
    "timestamp": "2025-05-12T17:57:11Z"
  },
  {
    "title": "Trump: Republicans need to unify",
    "description": "United States President Donald Trump said on Monday that republicans need to unite ahead of this week's meeting of the Committees on \"THE ONE, BIG, BEAUTIFUL BILL.\"On his Truth Social account, Preside...",
    "link": "https://biztoc.com/x/6bf18c6a8f401bc0",
    "timestamp": "2025-05-12T17:57:09Z"
  },
  {
    "title": "Trump Welcomes Planeload of White South Africans, While Shutting Out Other Refugees",
    "description": "Trump has halted all refugee admissions except white South Africans. Biden took in 100,034 refugees in the 2024 fiscal year",
    "link": "https://time.com/7284895/south-african-refugees-landed-trump/",
    "timestamp": "2025-05-12T17:56:59Z"
  },
  {
    "title": "Trump gives drugmakers 30-day ultimatum: ‘We’re going to pay what Europe pays’",
    "description": "President Donald Trump on Monday signed a sweeping executive order setting a 30-day deadline for drugmakers to electively lower the cost of prescription drugs in the U.S. or face new limits down the road over what the government will pay.\nThe order calls on t…",
    "link": "https://biztoc.com/x/f3e83fa30a1664b7",
    "timestamp": "2025-05-12T17:56:54Z"
  },
  {
    "title": "Report: Hamas Tortured American-Israeli Hostage Edan Alexander; Handcuffed in Cage",
    "description": "Freed American-Israeli hostage Edan Alexander was reportedly tortured by the Palestinian terrorist group Hamas during nearly 600 days in captivity, and was kept handcuffed in a cage along with other hostages.\nThe post Report: Hamas Tortured American-Israeli H…",
    "link": "https://www.breitbart.com/middle-east/2025/05/12/report-hamas-tortured-american-israeli-hostage-edan-alexander-handcuffed-in-cage/",
    "timestamp": "2025-05-12T17:56:41Z"
  },
  {
    "title": "Kai Trump net worth: How rich is Donald Trump’s granddaughter?",
    "description": "Kai Trump, granddaughter of Donald Trump, is making waves as an athlete and influencer, amassing a $21 million net worth by February 2025. Beyond a family trust fund, she earns $2.5 million annually through endorsements, including a Leaf Trading Cards deal. A…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/kai-trump-net-worth-how-rich-is-donald-trumps-granddaughter/articleshow/121118133.cms",
    "timestamp": "2025-05-12T17:55:53Z"
  },
  {
    "title": "Canadian businesses in ‘a bit of a holding pattern’ amid trade war, recession fears: Léger poll",
    "description": "Senior business leaders want the federal government to prioritize trade diversification and reducing interprovincial trade barriers",
    "link": "https://financialpost.com/news/canadian-businesses-holding-pattern-trade-war-recession-leger",
    "timestamp": "2025-05-12T17:55:30Z"
  },
  {
    "title": "Not just MTG: This House Democrat plunged tens of thousands of dollars into the stock market before Trump's tariff pause",
    "description": "Rep. Jared Moskowitz bought tens of thousands of dollars in stock in 20 different companies just two days before Trump announced a tariff pause.",
    "link": "https://www.businessinsider.com/jared-moskowitz-bought-stocks-trump-tariff-dip-pause-2025-5",
    "timestamp": "2025-05-12T17:54:59Z"
  },
  {
    "title": "Democratic Sen. Gallego of Arizona reveals immigration reform and border security plan",
    "description": "Democratic Arizona Sen. Ruben Gallego is putting forward a plan aimed at reforming the U.S. immigration system and beefing up border security.",
    "link": "https://www.pbs.org/newshour/politics/democratic-sen-gallego-of-arizona-reveals-immigration-reform-and-border-security-plan",
    "timestamp": "2025-05-12T17:53:52Z"
  },
  {
    "title": "How Trump managed to get his much-needed China trade victory | CNN Business",
    "description": "President Donald Trump’s shock-and-awe tariff approach threatened to rupture global financial system and drive the US economy into recession. Nervous about the prospect of empty store shelves and reignited inflation, Trump sent in his even-keeled and professi…",
    "link": "https://www.cnn.com/2025/05/12/business/china-trade-deal-trump",
    "timestamp": "2025-05-12T17:53:47Z"
  },
  {
    "title": "White South Africans granted refugee status by Trump administration arrive in US | CNN Politics",
    "description": "A flight carrying a group of 59 White South Africans granted refugee status in the United States by the Trump administration arrived at Washington Dulles airport in Virginia on Monday, a State Department official said.",
    "link": "https://www.cnn.com/2025/05/12/politics/white-south-africans-refugee-status-arrive-us",
    "timestamp": "2025-05-12T17:53:35Z"
  },
  {
    "title": "Trump says would be ‘stupid’ to reject Qatari Air Force One gift",
    "description": "US President Donald Trump on Monday furiously rejected ethics concerns over his plans to receive a jet from Qatar to be used as Air Force One, saying it would be “stupid” not to accept such a gift. “It’s a great gesture,” the 78-year-old billionaire told repo…",
    "link": "https://www.digitaljournal.com/world/trump-says-would-be-stupid-to-reject-qatari-air-force-one-gift/article",
    "timestamp": "2025-05-12T17:53:25Z"
  },
  {
    "title": "Two Men Claiming to Be Trump Appointees Blocked From Entering US Copyright Office",
    "description": "The men appeared at the US Copyright Office days after after the Trump administration fired its leader, who had just published a report about the use of copyrighted materials for AI training.",
    "link": "https://www.wired.com/story/us-copyright-office-trump-takeover/",
    "timestamp": "2025-05-12T17:52:26Z"
  },
  {
    "title": "Trump Says Would Be 'Stupid' To Reject Qatari Air Force One Gift",
    "description": "US President Donald Trump on Monday furiously rejected ethics concerns over his plans to receive a jet from Qatar to be used as Air Force One, saying it would be \"stupid\" not to accept such a gift.",
    "link": "https://www.ibtimes.com/trump-says-would-stupid-reject-qatari-air-force-one-gift-3773281",
    "timestamp": "2025-05-12T17:51:17Z"
  },
  {
    "title": "Trump administration promises Illinois it will pay to keep carp out of the Great Lakes",
    "description": "Illinois is getting set to close on property that officials want to buy to keep invasive carp from reaching the Great Lakes",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-promises-illinois-pay-carp-great-lakes-121722662",
    "timestamp": "2025-05-12T17:50:49Z"
  },
  {
    "title": "Trump Says Only a ‘Stupid Person’ Wouldn’t Take a Free Plane From Qatar",
    "description": "There's no such thing as a free $400 million plane from a foreign government.",
    "link": "https://gizmodo.com/trump-says-only-a-stupid-person-wouldnt-take-a-free-plane-from-qatar-2000600922",
    "timestamp": "2025-05-12T17:50:25Z"
  },
  {
    "title": "Why jihadis will be upset with Pakistan Army over Operation Sindoor",
    "description": "A defence expert dissects the India-Pakistan ceasefire, revealing US mediation, Pakistan’s vulnerabilities, the fallout with jihadis, and the shifting dynamics of aerial combat.",
    "link": "https://timesofindia.indiatimes.com/toi-plus/defence-security/why-jihadis-will-be-upset-with-pakistan-army-over-operation-sindoor/articleshow/121117882.cms",
    "timestamp": "2025-05-12T17:48:33Z"
  },
  {
    "title": "Church Rebukes Trump Administration Over White South African Refugees",
    "description": "The Episcopal Church announcement comes just one day after 49 Afrikaners left their country for resettlement in the United States.",
    "link": "https://www.newsweek.com/episcopal-church-rebukes-trump-afrikaners-south-africa-refugees-2071124",
    "timestamp": "2025-05-12T17:47:38Z"
  },
  {
    "title": "Pope takes swipe at those who attack journalists — as Trump rages about 'fake news'",
    "description": "Pope Leo XIV dropped a political statement in his first conversation with the media on Monday. Among his comments was praise for, and solidarity with, Ukraine's President Volodymyr Zelensky. The pontiff then took a swipe at the lack of free speech in Russia. …",
    "link": "https://www.rawstory.com/pope-leo-xiv/",
    "timestamp": "2025-05-12T17:47:32Z"
  },
  {
    "title": "White South African refugees brought to US due to ‘government-sponsored racial discrimination': State Dept",
    "description": "A President Donald Trump executive order has brought dozens of White South Africans to the U.S. as refugees, amid claims of racial persecution and backlash from the South African government.",
    "link": "https://www.foxnews.com/politics/white-south-african-refugees-brought-us-due-government-sponsored-racial-discrimination-state-dept",
    "timestamp": "2025-05-12T17:46:18Z"
  },
  {
    "title": "Trump talks with Apple’s Cook as iPhone price hikes loom",
    "description": "US President Donald Trump said he spoke with Apple Inc. Chief Executive Officer Tim Cook earlier on Monday, just as the iPhone maker was reported to be considering price increases later this year.\nApple is weighing whether to raise prices for an iPhone lineup…",
    "link": "https://biztoc.com/x/ce9951564649836e",
    "timestamp": "2025-05-12T17:46:08Z"
  },
  {
    "title": "Trump defends move to grant refugee status to Afrikaners (Amanda Friedman/Politico)",
    "description": "Amanda Friedman / Politico:\nTrump defends move to grant refugee status to Afrikaners  —  The Trump administration is welcoming dozens of white South Africans into the U.S. as it terminates most of its non-white refugee admissions.  —  President Donald Trump o…",
    "link": "https://www.memeorandum.com/250512/p81",
    "timestamp": "2025-05-12T17:45:01Z"
  },
  {
    "title": "Russian drones attack Ukraine after Kremlin rejects 30-day ceasefire proposal",
    "description": "Ukraine's air force says Russia launched more than 100 Shahed and decoy drones at Ukraine in nighttime attacks.",
    "link": "https://www.pbs.org/newshour/world/russian-drones-attack-ukraine-after-kremlin-rejects-30-day-ceasefire-proposal",
    "timestamp": "2025-05-12T17:44:28Z"
  },
  {
    "title": "Trump says he spoke to Apple CEO Tim Cook after announcing tariff pause",
    "description": "President Donald Trump said he spoke to Apple (AAPL) CEO Tim Cook on Monday, just after he announced a 90-day pause on new tariffs between the U.S. and China and sharp rollbacks on existing duties.Read more...",
    "link": "https://qz.com/trump-tim-cook-apple-tariffs-conversation-us-china-1851780269",
    "timestamp": "2025-05-12T17:44:00Z"
  },
  {
    "title": "Hamas Releases Israeli-American Hostage Edan Alexander After 584-Day Captivity",
    "description": "IDF: Edan \"is currently being accompanied by IDF special forces on his return to Israeli territory, where he will undergo an initial medical assessment and meet with his family.\" \nThe post Hamas Releases Israeli-American Hostage Edan Alexander After 584-Day C…",
    "link": "https://legalinsurrection.com/2025/05/hamas-releases-israeli-american-hostage-edan-alexander-after-584-day-captivity/",
    "timestamp": "2025-05-12T17:43:35Z"
  },
  {
    "title": "A landscape transformed: As it responds to cuts in federal programs, the arts community reels",
    "description": "For decades, there has been a nationwide artistic and cultural infrastructure receiving bipartisan support.",
    "link": "https://www.bostonherald.com/2025/05/12/the-arts-endangered/",
    "timestamp": "2025-05-12T17:41:21Z"
  },
  {
    "title": "US-China tariff truce will lessen shock but won’t stop prices rising, Fed governor warns",
    "description": "Adriana Kugler says she still expects to see higher prices and slower growth",
    "link": "https://www.irishtimes.com/business/2025/05/12/us-china-tariff-truce-will-lessen-shock-but-wont-stop-prices-rising-fed-governor-warns/",
    "timestamp": "2025-05-12T17:41:07Z"
  },
  {
    "title": "Zelenskyy and Erdogan discuss proposed Ukraine peace talks",
    "description": "Turkish President Recep Tayyip Erdogan offered to host Ukraine-Russia talks in Istanbul. US President Donald Trump offered to join. Follow DW for more US President Donald Trump says he could attend potential Russia-Ukraine talks\nUkrainian President Volodymyr …",
    "link": "https://www.dw.com/en/zelenskyy-and-erdogan-discuss-proposed-ukraine-peace-talks/live-72511628",
    "timestamp": "2025-05-12T17:41:00Z"
  },
  {
    "title": "Ramona Singer Proudly Proclaims Daniel Penny a ‘Hero’ and Everybody’s …",
    "description": "Reading Time: 4 minutesRamona Singer is taking some serious flak for her latest social media post.\nRamona Singer Proudly Proclaims Daniel Penny a ‘Hero’ and Everybody’s … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/05/ramona-singer-backlash-daniel-penny/",
    "timestamp": "2025-05-12T17:40:30Z"
  },
  {
    "title": "After fire, fear: Kashmiri locals remain on edge as shaky ceasefire appears to take hold",
    "description": "Residents living along de facto border between India and Pakistan recall the horror as drones and missiles pierced the skies Read Full Article at RT.com",
    "link": "https://www.rt.com/india/617421-india-pakistan-kahsmir-ceasefire/",
    "timestamp": "2025-05-12T17:39:05Z"
  },
  {
    "title": "Here’s How Much Trump Spent to Deport 32 Immigrants to Guantánamo",
    "description": "The Trump administration’s decision to deport immigrants to the U.S. base on Guantanamo Bay, Cuba, cost taxpayers at least $21 million between January 20 and April 8. \r\nRight now, the base only holds 32 immigrants, making the whole effort look like a massive …",
    "link": "https://newrepublic.com/post/195139/how-much-trump-spent-deport-immigrants-guantanamo",
    "timestamp": "2025-05-12T17:36:39Z"
  },
  {
    "title": "Could Midterm Politics Curb Trump’s Second-Term Rampage?",
    "description": "Some believe Trump is pulling his punches in order to help Mike Johnson hang on to the House for Republicans in the 2026 midterms.  It makes you wonder what he’d do if he didn’t care at all.",
    "link": "http://nymag.com/intelligencer/article/could-midterm-politics-curb-trumps-second-term-rampage.html",
    "timestamp": "2025-05-12T17:36:10Z"
  },
  {
    "title": "Fox News Host Claims Trump Is ‘Losing Money’ as President Despite Nearly $3 Billion Surge in Wealth",
    "description": "Fox News' David Webb claimed that President Donald Trump is \"losing money\" in his capacity as commander-in-chief on Monday.\nThe post Fox News Host Claims Trump Is ‘Losing Money’ as President Despite Nearly $3 Billion Surge in Wealth first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/fox-news-host-claims-trump-is-losing-money-as-president-despite-nearly-3-billion-surge-in-wealth/",
    "timestamp": "2025-05-12T17:35:30Z"
  },
  {
    "title": "Ukraine Open To Trump Joining Russia Talks In Türkiye",
    "description": "Ukrainian President Volodymyr Zelenskyy expressed support for U.S. President Donald Trump’s potential involvement in upcoming peace talks between Ukraine and Russia, set to take place in Turkey on Thursday. “All of us in Ukraine would appreciate it if Preside…",
    "link": "https://biztoc.com/x/95dcc04bf4521b66",
    "timestamp": "2025-05-12T17:34:42Z"
  },
  {
    "title": "Sounds About Pro-White: President Donald Trump Opens Path For White South African Refugees To Enter U.S.",
    "description": "President Donald Trump is opening a pipeline for white South African refugees to come to America, sparking discussions on X.",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-white-south-african-refugees/",
    "timestamp": "2025-05-12T17:34:35Z"
  },
  {
    "title": "Lincoln Project Bashes Trump's Latest Move, Then Finds Out Abraham Lincoln Did the Same Thing",
    "description": "The Lincoln Project complained about a Trump administration official signaling toward a move its own namesake once famously made.",
    "link": "https://www.westernjournal.com/lincoln-project-bashes-trumps-latest-move-finds-abraham-lincoln-thing/",
    "timestamp": "2025-05-12T17:33:04Z"
  },
  {
    "title": "In Pittsburgh, candidates face their future voters, part of a national effort to engage the young",
    "description": "Young people have consistently turned out to vote at lower rates than older Americans.",
    "link": "https://www.bostonherald.com/2025/05/12/democracy-youth-engagement/",
    "timestamp": "2025-05-12T17:32:53Z"
  },
  {
    "title": "Trump Takes Major Action to Reduce Drug Costs for Americans",
    "description": "President Donald Trump signed an executive order on Monday to reduce drug prices in America to rates similar to what those in other nations pay.\nThe post Trump Takes Major Action to Reduce Drug Costs for Americans appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/12/trump-takes-major-action-reduce-drug-costs-americans/",
    "timestamp": "2025-05-12T17:32:27Z"
  }
]