[
  {
    "title": "Waukesha death investigation; Nikita Casap due in court Monday",
    "description": "The Waukesha teen charged in connection with the deaths of his mother and stepfather appeared in court for a status hearing on Monday, Aug. 18.",
    "link": "https://www.fox6now.com/news/waukesha-death-investigation-nikita-casap-due-court-monday",
    "timestamp": "2025-08-18T11:56:21Z"
  },
  {
    "title": "Russia leaks unseen footage from Trump-Putin showdown that 'shows true power dynamic' between the leaders",
    "description": "Backstage footage from the meeting between Donald Trump and Vladimir Putin in Alaska has been leaked by Russia",
    "link": "https://www.ladbible.com/news/world-news/trump-putin-russia-alaska-footage-leaked-555307-20250818",
    "timestamp": "2025-08-18T11:55:42Z"
  },
  {
    "title": "Marco Rubio demolishes core Trump policy in resurfaced legal fight",
    "description": "Marco Rubio once wrote a tightly argued defense of a constitutional right to birthright citizenship that President Donald Trump is now seeking to undo through an executive order.Now secretary of state, Rubio was a senator running for president in 2016 when he…",
    "link": "https://www.rawstory.com/marco-rubio-citizenship/",
    "timestamp": "2025-08-18T11:54:39Z"
  },
  {
    "title": "Trump pushing ‘real’ solution to Ukraine conflict – Putin envoy",
    "description": "Kirill Dmitriev has praised the US president for seeking peace and voiced optimism before White House talks with Vladimir Zelensky Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623172-trump-seeks-real-solution-to-conflict-dmitriev/",
    "timestamp": "2025-08-18T11:53:15Z"
  },
  {
    "title": "India's unemployment rate eases to 5.2% in July",
    "description": "NEW DELHI (Reuters) -India's unemployment rate fell to 5.2% in July from 5.6% in the previous month, the statistics ministry said on Monday, as rural hiring ...",
    "link": "https://sg.finance.yahoo.com/news/indias-unemployment-rate-eases-5-115216355.html",
    "timestamp": "2025-08-18T11:52:16Z"
  },
  {
    "title": "Trump-Zelensky meeting: What’s the schedule, what’s at stake?",
    "description": "European leaders will accompany the Ukrainian president in a united front when they meet Donald Trump.",
    "link": "https://www.aljazeera.com/news/2025/8/18/trump-zelensky-meeting-whats-the-schedule-whats-at-stake-today",
    "timestamp": "2025-08-18T11:50:40Z"
  },
  {
    "title": "Ball Is Now In Zelensky's Court Says Trump as European Leaders Arrive in Washington for White House Talks",
    "description": "Zelensky can immediately end the Russian invasion \"if he wants to\" by accepting the terms being offered to him, President Trump said.\nThe post Ball Is Now In Zelensky’s Court Says Trump as European Leaders Arrive in Washington for White House Talks appeared f…",
    "link": "https://www.breitbart.com/europe/2025/08/18/ball-now-in-zelenskys-court-says-trump-as-euro-leaders-arrive-in-d-c/",
    "timestamp": "2025-08-18T11:50:05Z"
  },
  {
    "title": "Forbes Daily: European Allies Join Zelenskyy And Trump To Talk Ceasefire",
    "description": "Today’s Forbes Daily newsletter covers the real impact from a $250 U.S. visa fee, Elon Musk and Sam Altman’s feud, Warren Buffett buying the UnitedHealth dip and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/08/18/forbes-daily-european-allies-join-zelenskyy-and-trump-to-talk-ceasefire/",
    "timestamp": "2025-08-18T11:45:48Z"
  },
  {
    "title": "Monday: Hili dialogue",
    "description": "Another damn work week is on tap: it’s Monday, August 18, 2025 and also National Bad Poetry Day. For a collection of the absolute worst bad poetry, get this book. It’s hilarious (click for Amazon link): And then read some poems by the very WORST BAD POET IN H…",
    "link": "https://whyevolutionistrue.com/2025/08/18/monday-hili-dialogue-530/",
    "timestamp": "2025-08-18T11:45:18Z"
  },
  {
    "title": "Trump declares war on mail-in ballots in early morning rant about midterms",
    "description": "President Donald Trump vowed to eradicate mail-in ballots and “controversial voting machines” via an executive order ahead of the 2026 midterm elections Monday in an early-morning rant on social media.“I am going to lead a movement to get rid of mail-in ballo…",
    "link": "https://www.rawstory.com/trump-2673896797/",
    "timestamp": "2025-08-18T11:44:54Z"
  },
  {
    "title": "Ministry of Defence shares chilling reason Putin wants Ukraine to hand over unoccupied land",
    "description": "Vladimir Putin's demands for the war in Ukraine have been outlined by the Ministry of Defence",
    "link": "https://www.ladbible.com/news/world-news/vladimir-putin-ukraine-war-demands-ministry-of-defence-096038-20250818",
    "timestamp": "2025-08-18T11:39:20Z"
  },
  {
    "title": "Trump says he will sign order targeting mail-in ballots, voting machines ahead of 2026 elections",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Monday he would sign an executive order ahead of next year's midterm elections, saying he would lead \"a movement\" targeting mail-in balloting and voting machines across the country. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/18/trump-says-he-will-sign-order-targeting-mail-in-ballots-voting-machines-ahead-of-2026-elections",
    "timestamp": "2025-08-18T11:39:00Z"
  },
  {
    "title": "US President Donald Trump tells Ukrainian President Volodymyr Zelenskiy to give up Crimea to Russia and promise not to join NATO",
    "description": "US President Donald Trump tells Ukrainian President Volodymyr Zelenskiy to give up Crimea to Russia and promise not to join NATO7news.com.au",
    "link": "https://7news.com.au/news/us-president-donald-trump-tells-ukrainian-president-volodymyr-zelenskiy-to-give-up-crimea-to-russia-and-promise-not-to-join-nato-c-19724570",
    "timestamp": "2025-08-18T11:37:56Z"
  },
  {
    "title": "Zelenskyy brings Europe’s top leaders with him to meet Trump on ending Russia’s war",
    "description": "Monday’s showing is a sign both of the progress and the possible distress coming out of the Alaska meeting.",
    "link": "https://www.bostonherald.com/2025/08/18/trump-zelenskyy-post-alaska-meeting/",
    "timestamp": "2025-08-18T11:36:40Z"
  },
  {
    "title": "Putin Briefs Tajik President Rakhmon on Alaska Summit Outcome",
    "description": "Putin has held a telephone conversation with Tajik President Emomali Rakhmon, the Kremlin said.",
    "link": "https://sputnikglobe.com/20250818/putin-briefs-tajik-president-rakhmon-on-alaska-summit-outcome-1122643226.html",
    "timestamp": "2025-08-18T11:35:52Z"
  },
  {
    "title": "Trump Issues Update on Future of Mail-in Ballots, Voting Machines for 2026",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said he will issue an executive order to end the use of mail-in ballots and voting machines ahead of the 2026 midterm elections.\nTrump made the announcement in a post on his Truth Social…",
    "link": "https://biztoc.com/x/558816d68b22b15e",
    "timestamp": "2025-08-18T11:35:07Z"
  },
  {
    "title": "Trump to begin efforts to 'get rid' of mail-in ballots",
    "description": "United States President Donald Trump announced on Monday that he will \"lead a movement to get rid of MAIL-IN BALLOTS\" and voting machines, calling the latter \"seriously controversial,\" and \"highly ina...",
    "link": "https://biztoc.com/x/918d6b3e3a0a4b2c",
    "timestamp": "2025-08-18T11:34:41Z"
  },
  {
    "title": "Bitcoin sinks to $115,000 after hitting its newest record, as macro concerns spark liquidation wave",
    "description": "The crypto market tumbled to begin the week as heightened macro concerns triggered more than $500 million in long liquidations.",
    "link": "https://www.cnbc.com/2025/08/18/crypto-market-today.html",
    "timestamp": "2025-08-18T11:33:49Z"
  },
  {
    "title": "Trump Issues Update on Future of Mail-in Ballots, Voting Machines for 2026",
    "description": "President Donald Trump made the announcement on Truth Social.",
    "link": "https://www.newsweek.com/trump-2026-midterms-mail-ballots-voting-machines-2114934",
    "timestamp": "2025-08-18T11:33:33Z"
  },
  {
    "title": "Sydney Sweeney's New Niche Film Flops After American Eagle Ad Controversy",
    "description": "The ad boasted about the \"Euphoria\" star's \"great jeans,\" including a play on words that referenced her genes.",
    "link": "https://www.huffpost.com/entry/sydney-sweeney-new-film-box-office-american-eagle-ad_n_68a2642ce4b0858c7642bcfa",
    "timestamp": "2025-08-18T11:33:21Z"
  },
  {
    "title": "Why Sex And The City Could Never Be A Fairy Tale",
    "description": "Sex and the City feminism sees living like a bad man as the key to empowering women to live the good life.",
    "link": "https://thefederalist.com/2025/08/18/why-sex-and-the-city-could-never-be-a-fairy-tale/",
    "timestamp": "2025-08-18T11:33:20Z"
  },
  {
    "title": "iPhone 17 Rumors: Everything to Know, From Redesigned Cameras to an Upgraded Display",
    "description": "Apple's upcoming phone could be slighter bigger and more powerful -- and potentially pricer.",
    "link": "https://www.cnet.com/tech/mobile/iphone-17-rumors-everything-to-know-from-redesigned-cameras-to-an-upgraded-display/",
    "timestamp": "2025-08-18T11:30:03Z"
  },
  {
    "title": "Conservatives’ Long War on Free Thought",
    "description": "Trump’s escalating attacks on higher education represent a centuries-long drive to kill the Socratic spirit.",
    "link": "https://inthesetimes.com/article/conservatives-censorship-trump-ron-desantis-christopher-rufo-education",
    "timestamp": "2025-08-18T11:30:00Z"
  },
  {
    "title": "Why Zelensky’s main argument against peace is a lie",
    "description": "After suspending Ukraine’s democratic order, he now hides behind the constitution to block negotiations Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623171-zelenskys-main-argument-lie/",
    "timestamp": "2025-08-18T11:28:17Z"
  },
  {
    "title": "Dollar firms heading into busy week of geopolitics and Fed speak",
    "description": "MUMBAI :The dollar gained on Monday ahead of a meeting between U.S. President Donald Trump and his Ukrainian and European counterparts, while focus also turned to the Federal Reserve's Jackson Hole symposium for policy cues.The euro was down 0.2 per cent agai…",
    "link": "https://www.channelnewsasia.com/business/dollar-firms-heading-busy-week-geopolitics-and-fed-speak-5299481",
    "timestamp": "2025-08-18T11:26:26Z"
  },
  {
    "title": "Dollar gains before Ukraine peace talks, Fed policy in focus",
    "description": "NEW YORK :The dollar gained on Monday as U.S. President Donald Trump prepared to host talks on ending Russia's war in Ukraine, and traders pared bets on a September rate cut before a speech on Friday by Federal Reserve Chair Jerome Powell.Trump will meet Ukra…",
    "link": "https://www.channelnewsasia.com/business/dollar-gains-ukraine-peace-talks-fed-policy-in-focus-5299481",
    "timestamp": "2025-08-18T11:26:26Z"
  },
  {
    "title": "Zelenskyy's D.C. meeting and Terence Stamp dies at 87: Morning Rundown",
    "description": "Zelenskyy and Trump will meet, joined by European leaders. Trump administration investigates Democrats. Police search for gunmen in a Brooklyn club shooting.",
    "link": "https://www.nbcnews.com/news/us-news/zelenskyys-dc-meeting-terence-stamp-morning-rundown-rcna225424",
    "timestamp": "2025-08-18T11:23:58Z"
  },
  {
    "title": "Zelenskyy's D.C. meeting and Terence Stamp dies at 87: Morning Rundown",
    "description": "Zelenskyy and Trump will meet, joined by European leaders. Trump administration investigates Democrats. Police search for gunmen in a Brooklyn club shooting.",
    "link": "https://www.nbcnews.com/news/us-news/zelenskyys-dc-meeting-republican-investigate-democrats-morning-rundown-rcna225424",
    "timestamp": "2025-08-18T11:23:58Z"
  },
  {
    "title": "The stakes are high as Zelenskyy and European leaders head to Washington",
    "description": "Months of U.S.-led diplomatic efforts to stop the fighting haven’t made headway.",
    "link": "https://www.bostonherald.com/2025/08/18/zelenskyy-europe-trump-washington-meeting/",
    "timestamp": "2025-08-18T11:23:10Z"
  },
  {
    "title": "These groveling crackpots will be Trump's downfall",
    "description": "Monica Crowley, a former Fox News personality who is now Trump’s chief of protocol, apparently left behind in a public area of an Alaskan hotel documents describing confidential planned movements of Trump and Putin during their Friday meeting in Alaska.That’s…",
    "link": "https://www.rawstory.com/these-groveling-crackpots-are-going-to-crash-and-bring-trump-down-with-them/",
    "timestamp": "2025-08-18T11:22:21Z"
  },
  {
    "title": "Explained: What to expect from Trump–Zelenskyy meeting",
    "description": "European and NATO leaders join Zelenskyy in Washington to present a united front to Trump. Here’s what’s on the agenda and what it could mean for Ukraine and global security.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/trump-zelenskyy-washington-meeting-2025/article69947240.ece",
    "timestamp": "2025-08-18T11:20:11Z"
  },
  {
    "title": "Europe's 'alarm' over Trump and Putin's Alaska meeting | 7.30",
    "description": "Ukrainian President Volodymyr Zelenskyy has just arrived in Washington DC to meet US President Donald Trump. European ...",
    "link": "https://biztoc.com/x/82057e55c2d3baba",
    "timestamp": "2025-08-18T11:19:11Z"
  },
  {
    "title": "Trump, Putin, Zelensky may meet this week in Europe",
    "description": "A summit between United States President Donald Trump, Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky could take place this week in Europe, Sky News reported on Monday. Diplomats from the US allegedly asked their European colleagu…",
    "link": "https://freerepublic.com/focus/f-chat/4335193/posts",
    "timestamp": "2025-08-18T11:18:38Z"
  },
  {
    "title": "Some words look simply great together in the same sentence. \"Free\" and \"ice cream\" or \"Donald Trump\" and \"cardiac insufficiency\" for example. Don't forget, kids: Compression socks are woke [Followup]",
    "description": "Some words look simply great together in the same sentence. \"Free\" and \"ice cream\" or \"Donald Trump\" and \"cardiac insufficiency\" for example. Don't forget, kids: Compression socks are woke",
    "link": "https://www.fark.com/comments/13780968/Some-words-look-simply-great-together-in-same-sentence-Free-ice-cream-Donald-Trump-cardiac-insufficiency-for-example-Dont-forget-kids-Compression-socks-are-woke",
    "timestamp": "2025-08-18T11:18:00Z"
  },
  {
    "title": "Top European Leaders Join Zelenskyy for WH Meeting With Trump",
    "description": "President Donald Trump is set to host Volodymyr Zelenskyy at the White House where the Ukrainian president will be joined by the leaders of France, Germany and the United Kingdom to present a united front in their efforts to end Russia’s war with Ukraine. It …",
    "link": "https://www.today.com/video/trump-tells-zelenskyy-to-cede-crimea-not-join-nato-to-end-war-245188165611",
    "timestamp": "2025-08-18T11:17:33Z"
  },
  {
    "title": "PM highlights Finland's own defence amid talk of security guarantees for Kyiv",
    "description": "In the run-up to White House talks between Trump and Zelensky, Prime Minister Petteri Orpo stressed the importance of guarding Finland's 1,300-km Nato border with Russia.",
    "link": "https://yle.fi/a/74-20178025",
    "timestamp": "2025-08-18T11:13:19Z"
  },
  {
    "title": "Tom Cruise Reportedly Turned Down Kennedy Center Invite From Trump",
    "description": "Tom Cruise reportedly turned down an invitation from the president to be among the 2025 Kennedy Center honorees. According to The Washington Post, the Top Gun: Maverick actor cited “scheduling conflicts” for bowing out. Instead, Trump revealed the latest line…",
    "link": "https://mediatakeout.com/tom-cruise-reportedly-turned-down-kennedy-center-invite-from-trump/",
    "timestamp": "2025-08-18T11:10:57Z"
  },
  {
    "title": "Alaskan man gifted new motorcycle by Putin during Trump summit",
    "description": "(Reuters) -A local man in Anchorage was given a new motorcycle by Russian President Vladimir Putin during last week's summit with U.S. President Donald Trump in the Alaskan city, according to a report published by Russian state television. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/18/alaskan-man-gifted-new-motorcycle-by-putin-during-trump-summit",
    "timestamp": "2025-08-18T11:10:00Z"
  },
  {
    "title": "Former RBI Guv D Subbarao warns of a Make in India trap, outlines the road Indian manufacturing should not take",
    "description": "D Subbarao cautioned that focusing solely on domestic production under 'Make in India' could deter foreign investment and hinder productivity, especially with new US tariffs on Indian exports. He suggested strategic self-sufficiency in key sectors instead of …",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/former-rbi-guv-d-subbarao-warns-of-a-make-in-india-trap-outlines-the-road-indian-manufacturing-should-not-take/articleshow/123363399.cms",
    "timestamp": "2025-08-18T11:07:46Z"
  },
  {
    "title": "Alaskan man gifted new motorcycle by Putin during Trump summit",
    "description": "An employee of the Russian embassy in the United States handed the man, Mark Warren, the keys to his new Ural motorcycle in the parking lot of the Anchorage ...",
    "link": "https://www.yahoo.com/news/articles/alaskan-man-gifted-motorcycle-putin-110546843.html",
    "timestamp": "2025-08-18T11:05:46Z"
  },
  {
    "title": "Thousands of Palestinians leave Gaza City fearing Israeli offensive",
    "description": "CAIRO (Reuters) -Fearing an imminent Israeli ground offensive, thousands of Palestinians have left their homes in eastern areas of Gaza City, now under...",
    "link": "https://www.yahoo.com/news/articles/palestinians-already-leaving-gaza-city-110436814.html",
    "timestamp": "2025-08-18T11:04:36Z"
  },
  {
    "title": "Gavin Newsom's Odds of Beating AOC for 2028 Nomination Widen",
    "description": "New betting odds show the California governor's chances of beating the New York representative are increasing.",
    "link": "https://www.newsweek.com/gavin-newsom-2028-president-emocratic-nomination-aoc-2114845",
    "timestamp": "2025-08-18T11:04:25Z"
  },
  {
    "title": "Love Me Or Leave Me Alone! Tabs, Mon. Aug. 18, 2025",
    "description": "Morning news roundup and things to read!",
    "link": "https://www.wonkette.com/p/love-me-or-leave-me-alone-tabs-mon",
    "timestamp": "2025-08-18T11:02:43Z"
  },
  {
    "title": "Ohio Democrat Sherrod Brown makes it official. He'll vie to unseat Trump-backed Sen. Jon Husted",
    "description": "Ohio Democrat Sherrod Brown officially launched his campaign Monday to return to the U.S. Senate next year, brushing aside his bitter loss to Republican...",
    "link": "https://www.yahoo.com/news/articles/ohio-democrat-sherrod-brown-makes-110219014.html",
    "timestamp": "2025-08-18T11:02:19Z"
  },
  {
    "title": "Former Sen. Sherrod Brown kicks off his bid for Vance's old Senate seat in Ohio",
    "description": "Former Sen. Sherrod Brown, D-Ohio, launched a comeback campaign Monday, setting the stage for a 2026 special election that could decide control of the Senate.",
    "link": "https://www.nbcnews.com/politics/2026-election/sherrod-brown-vance-campaign-launch-senate-seat-ohio-rcna225277",
    "timestamp": "2025-08-18T11:02:00Z"
  },
  {
    "title": "SCOOP: Stacy Garrity launches Republican campaign for Pennsylvania governor",
    "description": "Army veteran and state treasurer Stacy Garrity entered a likely competitive Pennsylvania governor race against popular incumbent Josh Shapiro.",
    "link": "https://www.foxnews.com/politics/scoop-stacy-garrity-launches-republican-campaign-pennsylvania-governor",
    "timestamp": "2025-08-18T11:00:58Z"
  },
  {
    "title": "Swarm of Jellyfish Forces Shutdown of French Nuclear Power Plant",
    "description": "Meanwhile the U.S. is slowly getting away from the China-Syndrome inspired \"Nuclear Winter\" for these power plants, as shuttered facilities are reopening.\nThe post Swarm of Jellyfish Forces Shutdown of French Nuclear Power Plant first appeared on Le·gal In·su…",
    "link": "https://legalinsurrection.com/2025/08/swarm-of-jellyfish-forces-shutdown-of-french-nuclear-power-plant/",
    "timestamp": "2025-08-18T11:00:57Z"
  },
  {
    "title": "Back from Alaska, Trump starts week with crucial foreign policy talks over Ukraine war",
    "description": "Ukrainian President Zelenskyy's White House meeting with Trump could set stage for trilateral summit as Ukraine rejects any peace deal undermining its sovereignty with Russia.",
    "link": "https://www.foxnews.com/politics/back-from-alaska-trump-starts-week-crucial-foreign-policy-talks-over-ukraine-war",
    "timestamp": "2025-08-18T11:00:48Z"
  },
  {
    "title": "Trump's AI plan is a bulwark against the rising threat from China",
    "description": "President Trump launches bold artificial intelligence strategy to counter Chinese technological dominance and secure America's economic future",
    "link": "https://www.foxnews.com/opinion/trumps-ai-plan-bulwark-against-rising-threat-from-china",
    "timestamp": "2025-08-18T11:00:46Z"
  },
  {
    "title": "Trump uses FBI and Justice Department to escalate his long-standing feud with Adam Schiff | CNN Politics",
    "description": "Donald Trump is using the full force of the federal government to try to turn the tables on his longtime nemesis, Adam Schiff.",
    "link": "https://www.cnn.com/2025/08/18/politics/adam-schiff-donald-trump-justice-fbi",
    "timestamp": "2025-08-18T11:00:41Z"
  },
  {
    "title": "Trump's 'De Minimis' Move Will Make Buying These Everyday Household Items More Expensive",
    "description": "Supply chain experts say to expect higher prices in these categories soon.",
    "link": "https://www.huffpost.com/entry/de-minimis-ending-trump_n_689f5fdee4b0fd906c861c59",
    "timestamp": "2025-08-18T11:00:17Z"
  },
  {
    "title": "Conan O'Brien foresees the end of late-night TV, predicts bold prediction on Stephen Colbert's future",
    "description": "Television Academy Hall of Fame honoree Conan O'Brien discusses the future of late night TV and praised Stephen Colbert following CBS Late Show cancellation news",
    "link": "https://www.foxnews.com/media/conan-obrien-foresees-end-late-night-tv-predicts-bold-prediction-stephen-colberts-future",
    "timestamp": "2025-08-18T11:00:05Z"
  },
  {
    "title": "Trump’s Trade Adviser Says India Must Stop Buying Russian Oil",
    "description": "India should halt purchases of Russian crude oil as the trade undermines efforts to isolate Moscow, the White House trade adviser Peter Navarro wrote in an op-ed published in the Financial Times on Monday. The world’s third-largest crude oil importer, India, …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trumps-Trade-Adviser-Says-India-Must-Stop-Buying-Russian-Oil.html",
    "timestamp": "2025-08-18T11:00:00Z"
  },
  {
    "title": "Analysis: Intel Corporation announces Q2 FY2025 financial results",
    "description": "Intel Corporation has announced financial data for the second quarter of FY2025, ending on 28th June 2025.  Revenue was flat for another quarter, when compared year-on-year to FY2024, at $12.9 billion.  Gross margin declined, while expenses pushed the busines…",
    "link": "https://www.architecting.it/blog/intel-q2-fy2025-financials/",
    "timestamp": "2025-08-18T11:00:00Z"
  },
  {
    "title": "Planned Parenthood makes nearly $500 million in pro-life states, including tax funds",
    "description": "The American Life League has found that Planned Parenthood has received nearly half a billion dollars from pro-life states. / Credit: American Life League, Flickr CC BY-NC 2.0\n\nWashington, D.C. Newsroom, Aug 18, 2025 / 07:00 am (CNA).\nPlanned Parenthood affil…",
    "link": "https://www.catholicnewsagency.com/news/265995/planned-parenthood-makes-nearly-500-dollars-million-in-pro-life-states-including-tax-funds",
    "timestamp": "2025-08-18T11:00:00Z"
  },
  {
    "title": "Links 8/18/2025",
    "description": "Our daily links, including US spin on Alaska Summit, toxic wildfires, US blocks medical care for Gaza children, and why did Hollywood stop making comedies?",
    "link": "https://www.nakedcapitalism.com/2025/08/links-8-18-2025.html",
    "timestamp": "2025-08-18T10:55:58Z"
  },
  {
    "title": "Apple rents 2.7 lakh sq ft office space in Bengaluru, to pay Rs 1,000 crore in 10 years",
    "description": "Apple India has leased 2.7 lakh square feet for ten years. The starting monthly rent is Rs 6.3 crore. Apple will pay over Rs 1,000 crore in rent and maintenance. The company has leased nine floors in Embassy Zenith. This investment comes despite criticism fro…",
    "link": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/apple-rents-2-7-lakh-sq-ft-office-space-in-bengaluru-to-pay-rs-1000-crore-in-10-years/articleshow/123363125.cms",
    "timestamp": "2025-08-18T10:55:14Z"
  },
  {
    "title": "Trump rules out Ukraine reclaiming Crimea or joining Nato ahead of Zelensky White House talks (Frank Gardner/BBC)",
    "description": "Frank Gardner / BBC:\nTrump rules out Ukraine reclaiming Crimea or joining Nato ahead of Zelensky White House talks  —  Summary  — Donald Trump rules out Ukraine joining Nato as part of a peace deal to end the Russia-Ukraine war, ahead of meeting Volodymyr Zel…",
    "link": "https://www.memeorandum.com/250818/p7",
    "timestamp": "2025-08-18T10:55:00Z"
  },
  {
    "title": "US stock futures lower as investors focus on Powell remarks",
    "description": "U.S. stock futures are lower after last week's gains on increased expectations for a Federal Reserve rate cut in September.",
    "link": "https://www.usatoday.com/story/money/markets/2025/08/18/stocks-fed-chair-powell-monday/85703103007/",
    "timestamp": "2025-08-18T10:51:40Z"
  },
  {
    "title": "Any Talks About USA Sanctions on Russia 'Now Blowing in the Wind'",
    "description": "Any talks about U.S. sanctions towards Russia are now blowing in the wind, Bjarne Schieldrop, Chief Commodities Analyst at Skandinaviska Enskilda Banken AB, said.",
    "link": "https://www.rigzone.com/news/any_talks_about_usa_sanctions_on_russia_now_blowing_in_the_wind-18-aug-2025-181501-article/",
    "timestamp": "2025-08-18T10:51:16Z"
  },
  {
    "title": "Ukraine: 'Russia must end' war it started, Zelenskyy says",
    "description": "After US President Trump claimed Kyiv could end the war \"almost immediately,\" Ukrainian President Zelenskyy replied it's up to Russia to stop the fighting. Trump will host Zelenskyy along with several European leaders.",
    "link": "https://www.dw.com/en/ukraine-russia-must-end-war-it-started-zelenskyy-says/live-73674493",
    "timestamp": "2025-08-18T10:49:00Z"
  },
  {
    "title": "'Deranged!' White House incensed as Trump's former Russia expert issues grim warning",
    "description": "President Donald Trump’s impending meeting with Ukrainian President Volodmyr Zelenskyy has some geopolitical experts fearing the worst — and the White House exploded Monday at one critic in particular who it called \"deranged.\"Fiona Hill, who served as Trump’s…",
    "link": "https://www.rawstory.com/ukraine-2673896662/",
    "timestamp": "2025-08-18T10:48:45Z"
  },
  {
    "title": "Watch Trump-Melania Impersonators Do Odd Act On Israel's 'Dancing With The Stars'",
    "description": "The performance of faux POTUS and FLOTUS on \"DWTS\" went viral.",
    "link": "https://www.huffpost.com/entry/trump-melania-impersonators-dancing-with-the-stars-israel_n_68a2eb54e4b025a99d810cb9",
    "timestamp": "2025-08-18T10:48:10Z"
  },
  {
    "title": "Transcript: Trump’s Angry “Dictator” Rant Unnerves Experts: “Wake Up!”",
    "description": "The following is a lightly edited transcript of the August 18 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.President Do…",
    "link": "https://newrepublic.com/article/199193/transcript-trump-angry-dictator-rant-unnerves-experts-wake-up",
    "timestamp": "2025-08-18T10:46:46Z"
  },
  {
    "title": "Why Late-Night Comedy Is Dying a Slow, Unfunny Death",
    "description": "One constant that has presented itself during both of President Donald Trump’s two terms is that the left wants to...",
    "link": "https://townhall.com/tipsheet/jeff-charles/2025/08/18/the-left-wants-to-blame-trump-for-late-night-comedy-woes-n2661962",
    "timestamp": "2025-08-18T10:45:51Z"
  },
  {
    "title": "Gold rush could bring open pit mines to Black Hills in South Dakota",
    "description": "Miners want to return to the treasured landscape, promising an economic boost while raising fears of how modern gold extraction could forever change the region.",
    "link": "https://www.cbsnews.com/news/gold-mines-black-hills-south-dakota-controversy/",
    "timestamp": "2025-08-18T10:45:50Z"
  },
  {
    "title": "Why MAGA calls Trump “Daddy”",
    "description": "Yes, it's a weird sex thing. But it also reveals secret insecurities",
    "link": "https://www.salon.com/2025/08/18/why-maga-calls-trump-daddy/",
    "timestamp": "2025-08-18T10:45:21Z"
  },
  {
    "title": "Three things Europe wants as leaders prepare to meet Trump",
    "description": "Seven EU leaders are traveling travel to the United States on Monday looking to bring Washington on the side of Ukraine.",
    "link": "https://www.cnbc.com/2025/08/18/three-things-europe-wants-as-leaders-prepare-to-meet-trump.html",
    "timestamp": "2025-08-18T10:43:35Z"
  },
  {
    "title": "'You stabbed me': Man convicted of murder after argument over Trump turns deadly (pot related)",
    "description": "DESOTO COUNTY, Fla. (WKRC) - A man has been convicted of second-degree murder after a heated argument over Donald Trump led to a fatal stabbing. 38-year-old Donald Henry was found guilty in the death of Shawn Popp, according to the DeSoto County Sheriff's Off…",
    "link": "https://freerepublic.com/focus/f-chat/4335191/posts",
    "timestamp": "2025-08-18T10:40:42Z"
  },
  {
    "title": "Trump blasts 'lightweight' Dem senator who criticized Putin summit in Alaska: 'Stupid'",
    "description": "President Trump blasted Democrat Sen. Chris Murphy, of Connecticut, as a \"lightweight,\" calling the lawmaker \"unattractive\" and \"stupid,\" after he criticized the Trump-Putin summit.",
    "link": "https://www.foxnews.com/politics/trump-blasts-lightweight-dem-senator-who-criticized-putin-summit-alaska-stupid",
    "timestamp": "2025-08-18T10:39:18Z"
  },
  {
    "title": "Why crime is still Trump’s best issue",
    "description": "President Donald Trump shows crime statistics as he delivers remarks during a press conference in the James S. Brady Press Briefing Room of the White House August 11, 2025, in Washington, DC. | Andrew Harnik/Getty Images \nDonald Trump’s federal takeover of Wa…",
    "link": "https://biztoc.com/x/32e153b08f704a07",
    "timestamp": "2025-08-18T10:38:38Z"
  },
  {
    "title": "Trump may finally be forced to admit he’s not the most important person in the Russia-Ukraine story",
    "description": "President Donald Trump, right, walks past Russia's President Vladimir Putin as they arrive for a joint press conference at Joint Base Elmendorf-Richardson, Alaska, on Aug. 15, 2025.",
    "link": "https://biztoc.com/x/07b991f0b70940c0",
    "timestamp": "2025-08-18T10:38:28Z"
  },
  {
    "title": "Fog of Summit and Neocon Backlash: Lindsey Graham Readies Threat of Designating Russia a Terrorist State",
    "description": "Zelensky, EU leaders, and neocons are loaded for bear in their effort to sabotage the Alaska summit. Lindsey Graham still leads that charge.",
    "link": "https://www.nakedcapitalism.com/2025/08/fog-of-summit-and-neocon-backlash-lindsey-graham-readies-threat-of-designating-russia-a-terrorist-state.html",
    "timestamp": "2025-08-18T10:37:01Z"
  },
  {
    "title": "'Flunky': Trump's 'lap dog' prosecutor mocked for big mistake case against Dems",
    "description": "A former federal prosecutor mocked one of President Donald Trump's favorite attorneys on Sunday because of the way he's handled a pair of high-profile cases. Glenn Kirchner, a former Assistant U.S. Attorney, appeared on \"The Legal Breakdown\" with progressive …",
    "link": "https://www.rawstory.com/ed-martin-2673891387/",
    "timestamp": "2025-08-18T10:35:01Z"
  },
  {
    "title": "Ukraine’s future at stake in high-stakes White House meeting",
    "description": "The European political heavy-hitters were left out of President Trump’s summit with Russian President Vladimir Putin last Friday and they are looking to safeguard Ukraine and the continent from any widening aggression from Moscow.",
    "link": "https://www.wlky.com/article/zelenskyy-trump-european-leaders-meeting/65805000",
    "timestamp": "2025-08-18T10:34:49Z"
  },
  {
    "title": "Traders hope the Ukraine war could end soon. Experts say there's no 'quick fix'",
    "description": "Global markets were on tenterhooks Monday as momentum to end the war in Ukraine ramped up. Experts warn there is no \"quick fix,\" and talks could last years.",
    "link": "https://www.cnbc.com/2025/08/18/markets-hope-ukraine-war-could-end-experts-say-theres-no-quick-fix.html",
    "timestamp": "2025-08-18T10:32:27Z"
  },
  {
    "title": "Sinister reason Vladimir Putin walked with one arm by his side when meeting Trump",
    "description": "There's a reason why Vladimir Putin swung one arm less than the other when he walked alongside Donald Trump",
    "link": "https://www.ladbible.com/news/world-news/reason-vladimir-putin-arm-trump-057175-20250818",
    "timestamp": "2025-08-18T10:32:27Z"
  },
  {
    "title": "Wall Street Issues Serious $6.6 Trillion Crypto Warning As Price Crash Fears Hit Bitcoin, Ethereum And XRP",
    "description": "Bitcoin—alongside other major cryptocurrencies ethereum and XRP—have fallen sharply, raising fears of a crypto market crash...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/18/wall-street-issues-serious-66-trillion-crypto-warning-as-price-crash-fears-hit-bitcoin-ethereum-and-xrp/",
    "timestamp": "2025-08-18T10:30:53Z"
  },
  {
    "title": "Trump’s bid to support coal could cost ratepayers billions, report finds",
    "description": "Mandates from President Donald Trump’s administration to retain aging coal plants could cause a massive spike in energy costs, according to an independent...",
    "link": "https://minnesotareformer.com/2025/08/18/trumps-bid-to-support-coal-could-cost-ratepayers-billions-report-finds/",
    "timestamp": "2025-08-18T10:30:25Z"
  },
  {
    "title": "Rupee ends higher alongside local equities; premiums, volatility flat",
    "description": "The Indian rupee rose on Monday, boosted by the rally in local equities on Prime Minister Narendra Modi's planned tax cuts, while forward premiums and volatility expectations barely budged following the Trump-Putin meeting.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-ends-higher-alongside-local-equities-premiums-volatility-flat/articleshow/123362570.cms",
    "timestamp": "2025-08-18T10:30:23Z"
  },
  {
    "title": "Trump Is spitting on the grave of Martin Luther King Jr.",
    "description": "The president and MAGA are misusing King's name — and taking a wrecking ball to civil rights protections",
    "link": "https://www.salon.com/2025/08/18/trump-is-spitting-on-the-grave-of-martin-luther-king-jr/",
    "timestamp": "2025-08-18T10:30:09Z"
  },
  {
    "title": "Oil prices edge higher ahead of Trump-Zelenskiy meeting",
    "description": "NEW YORK :Oil prices edged up on Monday as investors awaited talks between U.S. President Donald Trump and his Ukrainian counterpart after an inconclusive U.S.-Russia summit in Alaska on FridayBrent crude futures rose 34 cents, or 0.52 per cent, to $66.19 a b…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-edge-higher-ahead-trump-zelenskiy-meeting-5299391",
    "timestamp": "2025-08-18T10:27:34Z"
  },
  {
    "title": "Oil prices rise on US adviser comments on India buying Russian crude",
    "description": "LONDON :Oil prices rose on Monday after White House trade adviser Peter Navarro said India's purchases of Russian crude were funding Moscow's war in Ukraine and had to stop.Traders were also watching for clues from a meeting later in the day between U.S. Pres…",
    "link": "https://www.channelnewsasia.com/business/oil-prices-rise-us-adviser-comments-india-buying-russian-crude-5299391",
    "timestamp": "2025-08-18T10:27:34Z"
  },
  {
    "title": "Putin to inform foreign partners of US summit results",
    "description": "Russian President Vladimir Putin will hold a series of calls today with officials from foreign countries to inform them of the results of his meeting with United States President Donald Trump on Frida...",
    "link": "https://biztoc.com/x/a500be0721957f8e",
    "timestamp": "2025-08-18T10:27:21Z"
  },
  {
    "title": "Trump Absolutely Melts Down at Critics of Alaska Summit in Late Night Barrage — Throwing Zelensky a Blunt Signal Hours Before Meeting",
    "description": "Trump unloaded on everyone from Obama to Chris Murphy and the 'Fake News' media, fuming at criticism of his Alaska summit just hours before hosting Zelensky.\nThe post Trump Absolutely Melts Down at Critics of Alaska Summit in Late Night Barrage — Throwing Zel…",
    "link": "https://www.mediaite.com/media/news/trump-absolutely-melts-down-at-critics-of-alaska-summit-in-late-night-barrage-throwing-zelensky-a-blunt-signal-hours-before-meeting/",
    "timestamp": "2025-08-18T10:26:46Z"
  },
  {
    "title": "Why N.J. lawmakers want to strip control of the State Police away from the Attorney General",
    "description": "The bipartisan push comes as police unions clash with the attorney general over racial profiling investigations and more.",
    "link": "https://www.nj.com/politics/2025/08/why-nj-lawmakers-want-to-strip-control-of-the-state-police-away-from-the-attorney-general.html",
    "timestamp": "2025-08-18T10:24:00Z"
  },
  {
    "title": "Fewer fake firs, higher prices: China tariff delay does little to save the holidays",
    "description": "U.S. retailers are reducing orders for artificial Christmas trees and decorations due to tariffs on Chinese imports, leading to fewer choices and higher prices for consumers. A temporary tariff reprieve came too late to significantly impact holiday inventory.…",
    "link": "https://economictimes.indiatimes.com/news/international/business/fewer-fake-firs-higher-prices-china-tariff-delay-does-little-to-save-the-holidays/articleshow/123362352.cms",
    "timestamp": "2025-08-18T10:20:18Z"
  },
  {
    "title": "Kevin O'Leary Issues Housing Market Warning",
    "description": "The \"Shark Tank\" investor believes recent inflation data could \"keep the U.S. housing market in its current state of stagnation.\"",
    "link": "https://www.newsweek.com/kevin-oleary-housing-market-warning-inflation-2114883",
    "timestamp": "2025-08-18T10:20:05Z"
  },
  {
    "title": "Oil awaits Zelenskiy-Trump meeting clues on peace deal",
    "description": "Oil prices held steady today as traders awaited clues from a meeting between US President Donald Trump and Ukrainian President Volodymyr Zelenskiy as they attempt to come to a peace deal to end Europe's deadliest war in 80 years.",
    "link": "https://www.rte.ie/news/business/2025/0818/1528955-world-oil-prices/",
    "timestamp": "2025-08-18T10:19:55Z"
  },
  {
    "title": "Bond Market’s Rate-Cut Bets Hit Decisive Stretch With Powell",
    "description": "Powell’s speech on Friday at the central bank’s annual gathering in Jackson Hole, Wyoming, kicks off a make-or-break stretch for the Treasury market, which...",
    "link": "https://finance.yahoo.com/news/bond-market-rate-cut-bets-001400986.html",
    "timestamp": "2025-08-18T10:16:57Z"
  }
]