[
  {
    "title": "“Obligation”: Reactions as Nawrocki wins Poland’s presidential election",
    "description": "Populists cheer Eurosceptic Karol Nawrocki's narrow victory, while centrists hope for cooperation.",
    "link": "https://www.aljazeera.com/news/2025/6/2/obligation-reactions-as-nawrocki-wins-polands-presidential-election",
    "timestamp": "2025-06-02T13:17:00Z"
  },
  {
    "title": "GOP rift could see more than 50 senators rebel against Trump: report",
    "description": "Republican senators are about to launch into infighting as they struggle to pass President Donald Trump’s “big, beautiful bill,” according to a report from Politico\r\n. Highlighting a faction of the party it calls “Medicaid moderates,” the news outlet noted th…",
    "link": "https://www.rawstory.com/gop-senators-2672247808/",
    "timestamp": "2025-06-02T13:16:00Z"
  },
  {
    "title": "China Responds After Defense Secretary Pete Hegseth Vows U.S. Will NOT Surrender Indo-Pacific to Communist China",
    "description": "Defense Secretary Pete Hegseth delivered a powerful speech Saturday at the prestigious Shangri-La Dialogue in Singapore — signaling a dramatic Trump-era shift in U.S.\nThe post China Responds After Defense Secretary Pete Hegseth Vows U.S. Will NOT Surrender In…",
    "link": "https://www.thegatewaypundit.com/2025/06/china-responds-after-defense-secretary-pete-hegseth-vows/",
    "timestamp": "2025-06-02T13:15:08Z"
  },
  {
    "title": "Are you on the list? Trump’s policy change poised to hit social security payments for 2 million Americans",
    "description": "Trump Social Security policy change is set to affect nearly 2 million Americans, and many don't even know it yet. If you're receiving Social Security benefits, you could soon see a smaller check due to new rules targeting student loan defaulters and people wh…",
    "link": "https://economictimes.indiatimes.com/news/international/us/are-you-on-the-list-trumps-policy-change-poised-to-hit-social-security-payments-for-2-million-americans/articleshow/121573097.cms",
    "timestamp": "2025-06-02T13:12:11Z"
  },
  {
    "title": "Trump threatened to tariff Apple and Mattel. Here’s how he could do it",
    "description": "President Donald Trump is using his love of tariffs to threaten high-profile American companies.\nOver the past month, Trump has said he’d like to target two specific and very different companies – Apple and Mattel – with tariffs aimed at their key products ov…",
    "link": "https://biztoc.com/x/9caada3d8d63542d",
    "timestamp": "2025-06-02T13:09:58Z"
  },
  {
    "title": "Trump Says Xi Call Will Ease US-China Trade Tensions",
    "description": "US President Donald Trump expressed confidence a talk with Chinese President Xi Jinping could ease fresh trade tensions, after White House officials vented anger over Beijing’s pace of issuing promised export licenses. The dust-up threatened to again upend tr…",
    "link": "https://biztoc.com/x/9fa0a886f402a7ac",
    "timestamp": "2025-06-02T13:09:38Z"
  },
  {
    "title": "The Widening Gyre",
    "description": "“The Caliphate looms; it is inevitable, and the road to its gates is paved with the skulls of English children.” —Peachy Keenan",
    "link": "https://www.kunstler.com/p/the-widening-gyre",
    "timestamp": "2025-06-02T13:07:02Z"
  },
  {
    "title": "The 1600: Age of Asymmetry",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-age-asymmetry-2079775",
    "timestamp": "2025-06-02T13:06:08Z"
  },
  {
    "title": "Russia and Ukraine hold peace talks in shadow of Kyiv’s audacious air raid | CNN",
    "description": "Russian and Ukrainian delegates met in Istanbul on Monday for their second set of direct peace talks, a day after Kyiv launched a shock drone attack on Russia’s nuclear-capable bombers, in an operation that President Volodymyr Zelensky said was a year and a h…",
    "link": "https://www.cnn.com/2025/06/02/europe/russia-ukraine-peace-talks-turkey-drone-attack-intl",
    "timestamp": "2025-06-02T13:05:08Z"
  },
  {
    "title": "Russia and Ukraine meet briefly in Istanbul",
    "description": "A second round of talks on a potential ceasefire came as both Ukraine and Russia have stepped up attacks. The talks come after a drone attack yesterday on Russian airbases destroyed strategic aircraft. Russian and Ukrainian officials are meeting for a second …",
    "link": "https://www.dw.com/en/russia-and-ukraine-meet-briefly-in-istanbul/live-72753846",
    "timestamp": "2025-06-02T13:04:00Z"
  },
  {
    "title": "Russia and Ukraine kick off new talks in Istanbul",
    "description": "A second round of talks on a potential ceasefire comes as both Ukraine and Russia have stepped up attacks. The talks come after a drone attack yesterday on Russian airbases destroyed strategic aircraft. Russian and Ukrainian officials are meeting for a second…",
    "link": "https://www.dw.com/en/russia-and-ukraine-kick-off-new-talks-in-istanbul/live-72753846",
    "timestamp": "2025-06-02T13:04:00Z"
  },
  {
    "title": "As Musk exits DOGE, a look back at previous efforts to cut waste, fraud and abuse – and how they fared",
    "description": "LBJ’s pentagon reforms through Trump’s budget focus show decades of federal efforts to streamline and cut costs",
    "link": "https://www.foxnews.com/politics/musk-exits-doge-look-back-previous-efforts-cut-waste-fraud-abuse",
    "timestamp": "2025-06-02T13:00:53Z"
  },
  {
    "title": "Justice for Travis: “Woke Justice” Victim Travis McMichael Still Rots in Solitary Confinement in Georgia",
    "description": "Today, months after President Donald Trump issued pardons to hundreds of individuals who were overcharged and politically targeted in the aftermath of January 6, one unsung victim of politically motivated prosecution remains behind bars.\nThe post Justice for …",
    "link": "https://www.thegatewaypundit.com/2025/06/justice-travis-woke-justice-victim-travis-mcmichael-still/",
    "timestamp": "2025-06-02T13:00:39Z"
  },
  {
    "title": "A desperate Haiti turns to Erik Prince, Trump ally, in fight against gangs",
    "description": "Private military contractors to work on secret taskforce deploying drones against gangs",
    "link": "https://www.irishtimes.com/world/americas/2025/06/02/a-desperate-haiti-turns-to-erik-prince-trump-ally-in-fight-against-gangs/",
    "timestamp": "2025-06-02T13:00:00Z"
  },
  {
    "title": "Secretary of ED McMahon Wants to Destroy US Education with Her Budget!",
    "description": "Secretary of Education Linda McMahon released her budget proposal for next year, and it’s as bad as expected. Carol Burris, executive director of the Network for Public Education, reviewed the budget and concluded that it shows a reckless disregard for the ne…",
    "link": "https://dianeravitch.net/2025/06/02/secretary-of-ed-mcmahon-wants-to-destroy-us-education-with-her-budget/",
    "timestamp": "2025-06-02T13:00:00Z"
  },
  {
    "title": "WE WILL NEVER STOP FIGHTING FOR YOU!!!",
    "description": "You gotta be able to stick up for yourselves, guys, or seem to.\n\r\n[Dana Bash]: Now, I know you previously warned that the administration charging members of Congress was a -- quote -- \"red line.\" What are you doing now that the red line you talked about has a…",
    "link": "https://www.eschatonblog.com/2025/06/we-will-never-stop-fighting-for-you.html",
    "timestamp": "2025-06-02T13:00:00Z"
  },
  {
    "title": "Lisa Murkowski finds herself in new battle against fellow Republicans",
    "description": "Sen. Lisa Murkowski (R-AK) could be one of the biggest obstacles to President Donald Trumps' \"big, beautiful bill\" in its current form as it heads for debate in the Senate, the New York Times reported on Monday morning.In particular, she opposes the $600 bill…",
    "link": "https://www.rawstory.com/lisa-murkowski-2672247756/",
    "timestamp": "2025-06-02T12:59:46Z"
  },
  {
    "title": "King Charles Mocked by Jimmy Kimmel Amid Trump Threat",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKing Charles III was roasted by Jimmy Kimmel for a speech billed as a moment of support for Canada in the face of annexation threats from President Donald Trump.\nThe British monarch, 76, is the king not only o…",
    "link": "https://biztoc.com/x/998e4b4af6b56559",
    "timestamp": "2025-06-02T12:58:45Z"
  },
  {
    "title": "Democrats’ Brilliant New Strategy: Learn To Speak Like An American",
    "description": "This week, we saw a spate of news stories blaming Democrats’ troubles on their vocabulary. They’re just using too many darn multisyllabic, academic-sounding words and turning off numbskull voters, is the basic message. Seriously? The Democrats’ problem isn’t …",
    "link": "https://freerepublic.com/focus/f-chat/4320487/posts",
    "timestamp": "2025-06-02T12:58:42Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Monday",
    "description": "My top 10 things to watch Monday, June 2 1. China accused the U.S. of seriously undermining the preliminary trade deal reached in Switzerland last month, a few days after President Donald Trump made similar claims about Beijing and said he would no longer be …",
    "link": "https://biztoc.com/x/7092f85db18468a1",
    "timestamp": "2025-06-02T12:58:30Z"
  },
  {
    "title": "Port Arthur LNG Phase 2 Marks Resumption of Federal Permitting",
    "description": "'This is the first final LNG export approval under President Trump's leadership and marks another step in restoring regular order to LNG export permitting'.",
    "link": "https://www.rigzone.com/news/port_arthur_lng_phase_2_marks_resumption_of_federal_permitting-02-jun-2025-180711-article/",
    "timestamp": "2025-06-02T12:56:48Z"
  },
  {
    "title": "London Mayor Threatens To Reopen Donald Trump Rift After Swiping At “Inward-Looking” U.S. On Opening Day Of SXSW London",
    "description": "London Mayor Sadiq Khan has used the opening day keynote of the inaugural SXSW London to criticize an “inward-looking mentality,” “uncertainty and political turmoil” in the U.S. As he laid out why London is a “creative hotbed, a gateway to the world and a hub…",
    "link": "http://deadline.com/2025/06/sadiq-khan-on-donald-trump-inward-looking-mentality-sxsw-london-1236420325/",
    "timestamp": "2025-06-02T12:55:41Z"
  },
  {
    "title": "London Mayor Threatens To Reopen Donald Trump Rift After Swiping At “Inward-Looking” U.S. On Opening Day Of SXSW London",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d29e146a-1164-43ed-ad74-0682c338b8e2",
    "timestamp": "2025-06-02T12:55:41Z"
  },
  {
    "title": "Türkiye eyes sustainable peace between Russia, Ukraine",
    "description": "Türkiye has highlighted the importance of achieving sustainable peace between Russia and Ukraine as it hosted the second round of direct talks between the two sides, expressing its commitment to continuing negotiations at the leaders' level, including Turkish…",
    "link": "https://www.hurriyetdailynews.com/turkiye-eyes-sustainable-peace-between-russia-ukraine-209867",
    "timestamp": "2025-06-02T12:55:30Z"
  },
  {
    "title": "US F-35 stealth fighter has a 'kill switch', but it's controlled by China and not America",
    "description": "The F-35 fighter jet's effectiveness is under threat. China's dominance in rare earth elements gives it a potential 'kill switch' over US military technology. This includes the F-35, future F-47 fighters, submarines, destroyers, drones and missiles. The US re…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-f-35-stealth-fighter-has-a-kill-switch-but-its-controlled-by-china-and-not-america/articleshow/121572954.cms",
    "timestamp": "2025-06-02T12:55:04Z"
  },
  {
    "title": "Ukraine and Russia hold talks in Istanbul a day after Kyiv’s stunning drone attacks",
    "description": "Delegations met in Turkey for a second round of direct peace talks in just over two weeks.",
    "link": "https://www.bostonherald.com/2025/06/02/ukraine-russia-hold-talks-istanbul/",
    "timestamp": "2025-06-02T12:55:02Z"
  },
  {
    "title": "King Charles Mocked by Jimmy Kimmel Amid Trump Threat",
    "description": "King Charles III was mocked on \"Jimmy Kimmel Live!\" over his show of support for Canada.",
    "link": "https://www.newsweek.com/king-charles-mocked-jimmy-kimmel-donald-trump-canada-2079709",
    "timestamp": "2025-06-02T12:53:16Z"
  },
  {
    "title": "David Mamet Throws Down With Bill Maher on Whether Trump ‘Inspired People to Riot’ on Jan. 6: ‘You’re Full of Sh*t!’",
    "description": "Bill Maher threw down with playwright David Mamet about whether President Donald Trump \"inspired people to riot\" on Jan. 6 by not conceding the 2020 election.\nThe post David Mamet Throws Down With Bill Maher on Whether Trump ‘Inspired People to Riot’ on Jan. …",
    "link": "https://www.mediaite.com/media/news/youre-full-of-sht-david-mamet-throws-down-with-bill-maher-on-whether-trump-inspired-people-to-riot-on-jan-6/",
    "timestamp": "2025-06-02T12:52:27Z"
  },
  {
    "title": "China says U.S. violated tariff truce as trade war heats up",
    "description": "China's allegations come after President Trump on Friday accused the Chinese of violating a May 12 trade pact.",
    "link": "https://www.cbsnews.com/news/china-trump-tariffs-truce-violation-chips-student-visas/",
    "timestamp": "2025-06-02T12:50:57Z"
  },
  {
    "title": "The tariff truce is teetering as Trump and China trade fresh threats",
    "description": "Weeks after a trade war ceasefire, U.S.-China negotiations are once again frozen, and both Trump and Beijing are threatening retaliation",
    "link": "https://qz.com/nasdaq-s-p-500-dow-gold-vix-us-china-trade-truce-june-2-1851783291",
    "timestamp": "2025-06-02T12:50:00Z"
  },
  {
    "title": "EU readying 'countermeasures' if tariffs deal with US crumbles",
    "description": "The European Union is preparing “countermeasures” against the United States if the two sides cannot reach a deal after surprise U.S. tariffs on steel rattled global markets and complicated the ongoing negotiations between Brussels and Washington",
    "link": "https://abcnews.go.com/Business/wireStory/eu-readying-countermeasures-tariffs-deal-us-crumbles-122411392",
    "timestamp": "2025-06-02T12:49:22Z"
  },
  {
    "title": "Gold up 2% amid trade uncertainty",
    "description": "The price of gold advanced by more than 2% on Monday amid intensifying trade tensions. Last week United States President Donald Trump announced increased tariffs on steel imports, amounting to 50%. Go...",
    "link": "https://biztoc.com/x/8d74bda22e92672e",
    "timestamp": "2025-06-02T12:47:17Z"
  },
  {
    "title": "CNBC Daily Open: It's a dicey matter to play 'chicken' in markets",
    "description": "When threatened, birds puff up their feathers to appear larger than they actually are, and squawk to signal aggression.\nOn Friday, U.S. President Donald Trump suggested he would no longer be \"Mr. NICE GUY\" to China after the country \"totally violated\" its tra…",
    "link": "https://biztoc.com/x/270f0e493afe9708",
    "timestamp": "2025-06-02T12:47:14Z"
  },
  {
    "title": "3 ways the government can silence opinions it disagrees with, without using censorship",
    "description": "The Trump administration isn’t resorting to official censorship. Instead, it’s using less blatant – and more effective – ways to suppress dissent.",
    "link": "https://theconversation.com/3-ways-the-government-can-silence-opinions-it-disagrees-with-without-using-censorship-254249",
    "timestamp": "2025-06-02T12:44:43Z"
  },
  {
    "title": "Why aren’t we having Teslas in India?: Elon Musk's father hints at India potential as Tesla skips manufacturing pitch",
    "description": "Amidst speculation about Tesla's India entry, Elon Musk's father expressed surprise at the company's absence, considering India's potential and the presence of competitors like BYD and Tata. Despite government efforts to attract Tesla for local manufacturing,…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/why-arent-we-having-teslas-in-india-elon-musks-father-hints-at-india-potential-as-tesla-skips-manufacturing-pitch/articleshow/121573304.cms",
    "timestamp": "2025-06-02T12:43:44Z"
  },
  {
    "title": "RFK Jr’s team adds new errors to its ‘MAHA’ report, making the fiasco worse",
    "description": "Just when it seemed Secretary Robert F. Kennedy Jr.'s \"MAHA\" report couldn't become more embarrassing, newly added errors have taken this mess to a new level.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rfk-jrs-team-adds-new-errors-maha-report-making-fiasco-worse-rcna210319",
    "timestamp": "2025-06-02T12:42:57Z"
  },
  {
    "title": "What cases are left on the Supreme Court’s emergency docket? Here’s a look",
    "description": "The justices have issued orders in 11 cases so far, and the Trump administration has won more than it has lost.",
    "link": "https://www.bostonherald.com/2025/06/02/supreme-court-emergency-appeals-docket/",
    "timestamp": "2025-06-02T12:40:00Z"
  },
  {
    "title": "50 Cent Clarifies Remarks About Trump's Possible Diddy Pardon: 'Didn't Say I Would Nuke Anything'",
    "description": "Trump previously said he would \"look at the facts\" in Diddy's federal case.",
    "link": "https://www.complex.com/music/a/tracewilliamcowen/50-cent-clarifies-remarks-trump-diddy-pardon",
    "timestamp": "2025-06-02T12:36:20Z"
  },
  {
    "title": "Emerging Markets -Asian shares fall on Trump's steel tariff threat but currencies steady",
    "description": "Asian equities fell on Monday, dragged by losses in South Korean and Vietnamese steelmakers, after US President Donald Trump threatened to double tariffs on imported steel and aluminium. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/02/emerging-markets--asian-shares-fall-on-trump039s-steel-tariff-threat-but-currencies-steady",
    "timestamp": "2025-06-02T12:36:00Z"
  },
  {
    "title": "Rasmussen Poll on Optimism for the Future Hits All-Time High Under Trump",
    "description": "For the first time in Rasmussen Reports polling history, the majority of respondents believe the country is on the right track.",
    "link": "https://www.westernjournal.com/rasmussen-poll-optimism-future-hits-time-high-trump/",
    "timestamp": "2025-06-02T12:35:11Z"
  },
  {
    "title": "In changing times, young Germans gun for defence sector jobs",
    "description": "Karlsruhe, Germany (AFP) June 1, 2025\n\n\n In a country with strong pacifist traditions due to its dark World War II history, German student Mika Scheid had never considered working in the arms industry - until Russia invaded Ukraine. \n\nThat was a \"personal tur…",
    "link": "https://www.spacewar.com/reports/In_changing_times_young_Germans_gun_for_defence_sector_jobs_999.html",
    "timestamp": "2025-06-02T12:32:26Z"
  },
  {
    "title": "Iran demands US guarantee it will lift sanctions in nuclear talks",
    "description": "Tehran (AFP) June 2, 2025\n\n Iran pressed the United States on Monday for guarantees that it will drop sanctions as a condition for a nuclear deal, after the White House reportedly sent a proposal it deemed \"acceptable\". \n\nWith Iran and the United States engag…",
    "link": "https://www.spacewar.com/reports/Iran_demands_US_guarantee_it_will_lift_sanctions_in_nuclear_talks_999.html",
    "timestamp": "2025-06-02T12:32:26Z"
  },
  {
    "title": "UK to build attack subs as part of major defence review",
    "description": "Glasgow (AFP) June 2, 2025\n\n Britain announced it will build 12 new attack submarines as it launched a major defence review Monday to move the country to \"war-fighting readiness\" in the face of \"Russian aggression\" and the changing nature of conflict. \n\nPrime…",
    "link": "https://www.spacewar.com/reports/UK_to_build_attack_subs_as_part_of_major_defence_review_999.html",
    "timestamp": "2025-06-02T12:32:26Z"
  },
  {
    "title": "Zelensky arrives in Vilnius for Nato eastern flank summit",
    "description": "Vilnius (AFP) June 2, 2025\n\n\n Ukrainian President Volodymyr Zelensky arrived Monday in Vilnius for a summit with the leaders of NATO's eastern and Nordic members, who are some of Kyiv's staunchest backers amid the Russian invasion. \n\nThe military alliance has…",
    "link": "https://www.spacewar.com/reports/Zelensky_arrives_in_Vilnius_for_Nato_eastern_flank_summit_999.html",
    "timestamp": "2025-06-02T12:32:26Z"
  },
  {
    "title": "University Inequality: The New Empire of Credentialed Elites",
    "description": "In a move that ignited global uproar, President Donald J. Trump banned international students from Harvard, citing “national security” and ideological infiltration.\nThe post University Inequality: The New Empire of Credentialed Elites appeared first on Global…",
    "link": "https://www.globalresearch.ca/university-inequality-new-empire-credentialed-elites/5889180",
    "timestamp": "2025-06-02T12:32:19Z"
  },
  {
    "title": "Forbes Daily: Musk's White House Tenure Ends With Questionable Legacy",
    "description": "Today’s Forbes Daily covers Taylor Swift’s big buy, a fast casual restaurant billionaire, how to avoid money-market fees, Michele Kang’s second act and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/06/02/forbes-daily-musks-white-house-tenure-ends-with-questionable-legacy/",
    "timestamp": "2025-06-02T12:28:30Z"
  },
  {
    "title": "Polish conservative Karol Nawrocki wins presidential election to succeed Duda",
    "description": "Trump-backed conservative candidate Karol Nawrocki narrowly won Poland's presidential runoff election over liberal Warsaw Mayor Rafał Trzaskowski.",
    "link": "https://www.foxnews.com/world/polish-conservative-karol-nawrocki-wins-presidential-election-succeed-duda",
    "timestamp": "2025-06-02T12:28:29Z"
  },
  {
    "title": "EU readying ‘countermeasures’ if tariffs deal with US crumbles",
    "description": "BARCELONA (AP) — The European Union on Monday said it is preparing “countermeasures” against the United States after the Trump administration’s surprise tariffs on steel rattled global markets and complicated the ongoing wider tariff negotiations between Brus…",
    "link": "https://financialpost.com/pmn/eu-readying-countermeasures-if-tariffs-deal-with-us-crumbles",
    "timestamp": "2025-06-02T12:28:18Z"
  },
  {
    "title": "Chase Chrisley Says His Parents’ Release Is the \"Best Birthday Gift\"",
    "description": "Chase Chrisley had a happy birthday indeed.\nThe Chrisley Knows Best alum turned 29 on June 1, which marked his first birthday with his parents Todd Chrisley and Julie Chrisley, who returned home...",
    "link": "https://www.eonline.com/news/1418199/chase-chrisley-celebrates-birthday-after-todd-julie-chrisleys-release",
    "timestamp": "2025-06-02T12:27:42Z"
  },
  {
    "title": "The comeback of the conservative-sovereigntist Right in Poland",
    "description": "The 43-year-old historian, director of the Polish National Remembrance Institute (IPN), won the presidential race, despite polls foreseeing his defeat.",
    "link": "https://www.jpost.com/international/article-856273",
    "timestamp": "2025-06-02T12:25:48Z"
  },
  {
    "title": "Is the EU funding Russia more than Ukraine?",
    "description": "\"Europe has sadly spent more money buying Russian oil and gas than they have spent on defending Ukraine,\" Donald Trump told the US Congress in March.\n\"Trump has not been known for his statistical accuracy, but on this occasion, he may be right,\" said Al Jazee…",
    "link": "https://biztoc.com/x/7bfb9d4679b05e7e",
    "timestamp": "2025-06-02T12:25:12Z"
  },
  {
    "title": "UK to Expand Submarine Fleet in Shift to ‘Warfighting Readiness’",
    "description": "Britain will expand its nuclear-powered attack submarine fleet as part of a defense review to be published on Monday that is designed to prepare the country to fight a modern war and counter the threat from Russia.",
    "link": "https://gcaptain.com/uk-to-expand-submarine-fleet-in-shift-to-warfighting-readiness/",
    "timestamp": "2025-06-02T12:25:00Z"
  },
  {
    "title": "Trump Admin Blames 'Administrative Errors' After ICE Deports Wrong Man",
    "description": "A federal appeals court had blocked the deportation of Jordin Melgar-Salmeron while his case was ongoing.",
    "link": "https://www.newsweek.com/trump-admin-blames-administrative-errors-ice-deport-jordin-melgar-salmeron-court-order-2079726",
    "timestamp": "2025-06-02T12:24:52Z"
  },
  {
    "title": "Trump threatened to tariff Apple and Mattel. Here’s how he could do it",
    "description": "President Donald Trump is using his love of tariffs to threaten high-profile American companies.",
    "link": "https://www.cnn.com/2025/06/02/business/trump-tariffs-apple-iphone-mattel-barbie",
    "timestamp": "2025-06-02T12:23:50Z"
  },
  {
    "title": "Number of Registered Democrats in Florida Falls to Record Low",
    "description": "Data from the Florida Division of Elections shows strong signs of a shift in blue and red support.",
    "link": "https://www.newsweek.com/registered-democrats-florida-numbers-2079651",
    "timestamp": "2025-06-02T12:23:38Z"
  },
  {
    "title": "Can Trump fix the national debt? Republican senators, many investors and even Elon Musk have doubts",
    "description": "President Trump faces challenge of convincing even allies that he won’t bury the federal government in debt.",
    "link": "https://www.bostonherald.com/2025/06/02/trump-budget-deficits-national-debt/",
    "timestamp": "2025-06-02T12:23:37Z"
  },
  {
    "title": "What cases are left on the Supreme Court's emergency docket? Here's a look",
    "description": "A little less than once a week on average since President Donald Trump began his second term, his administration’s lawyers have filed emergency appeals with the Supreme Court",
    "link": "https://abcnews.go.com/US/wireStory/cases-left-supreme-courts-emergency-docket-122409316",
    "timestamp": "2025-06-02T12:21:13Z"
  },
  {
    "title": "Russian, Ukrainian sides meet in Turkey for talks in wake of Kyiv's audacious weekend attack",
    "description": "Delegations from Russia and Ukraine arrived in Turkey on Monday for their second round of direct peace talks in just over two weeks, although expectations were low for any progress on ending the three-year war after a string of stunning attacks over the weeke…",
    "link": "https://www.cbc.ca/news/world/turkey-talks-russia-ukraine-1.7549675",
    "timestamp": "2025-06-02T12:19:56Z"
  },
  {
    "title": "How will Ukraine’s attack on Russian bombers affect the war?",
    "description": "An unprecedented assault on the eve of negotiations aimed at ending the conflict weakens Russia's image, observers say.",
    "link": "https://www.aljazeera.com/news/2025/6/2/how-will-ukraines-attack-on-russian-bombers-affect-the-war",
    "timestamp": "2025-06-02T12:16:53Z"
  },
  {
    "title": "Russia's Pearl Harbor: Putin Dealt 'Serious Loss' in Stand Off with NATO",
    "description": "Ukraine's drone strikes on Sunday have had a \"tremendous impact,\" a Ukrainian lawmaker told Newsweek.",
    "link": "https://www.newsweek.com/russia-ukraine-drone-strikes-airfields-jets-nato-2079696",
    "timestamp": "2025-06-02T12:15:13Z"
  },
  {
    "title": "Tariffs, Nvidia and 2 more things that defined the stock market this week",
    "description": "The stock market stumbled into the weekend after President Donald Trump on Friday said China violated the preliminary trade agreement the two sides reached earlier this month. The S & P 500 closed flat Friday after spending most of the session lower. The benc…",
    "link": "https://biztoc.com/x/778bbfc443087efa",
    "timestamp": "2025-06-02T12:14:19Z"
  },
  {
    "title": "White House Says Tariffs Are Here to Stay Amid Legal Battles",
    "description": "With the future of President Donald Trump’s major tariffs in question after back and forth legal battles in the courts, the White House says tariffs will continue no matter what. Meanwhile, Trump announces new plans to double tariffs on steel and aluminum imp…",
    "link": "https://biztoc.com/x/0cba5a26255c6703",
    "timestamp": "2025-06-02T12:14:11Z"
  },
  {
    "title": "'I'm Trying To Save Medicaid,' Says Trump-Appointed CMS Chief Dr. Oz As CBO Estimates 7.6 Million Could Lose Coverage Under GOP's 'Big, Beautiful Bill'",
    "description": "Dr. Mehmet Oz, appointed by President Donald Trump to lead the Centers for Medicare and Medicaid Services (CMS), added to the chorus of Republican voices defending the funding cuts in the House-passed budget bill.\nWhat Happened: Speaking on POLITICO's podcast…",
    "link": "https://biztoc.com/x/76877350f79e2303",
    "timestamp": "2025-06-02T12:14:05Z"
  },
  {
    "title": "‘RHOP’ Alum Katie Rost Calls on Trump to Grant Karen Huger a Presidential Pardon",
    "description": "Katie Rost is calling on President Donald Trump to pardon her former Real Housewives of Potomac castmate, Karen Huger. The Grande Dame was found guilty of DUI, negligent driving, failure to control speed to avoid a collision, and failure to notify of a change…",
    "link": "https://mediatakeout.com/rhop-alum-katie-rost-calls-on-trump-to-grant-karen-huger-a-presidential-pardon/",
    "timestamp": "2025-06-02T12:13:40Z"
  },
  {
    "title": "Who Really Are the Lawless and the Dictatorial?",
    "description": "The left cries “dictatorship” while wielding the courts, agencies, and media to undermine laws, crush dissent, and call it democracy.The left is in its usual sanctimonious but schizophrenic mood.The media claims daily that the Trump administration has usurped…",
    "link": "https://freerepublic.com/focus/f-news/4320477/posts",
    "timestamp": "2025-06-02T12:13:16Z"
  },
  {
    "title": "Is the EU funding Russia more than Ukraine?",
    "description": "EU remains the largest importer of Russian fossil fuels despite sanctions aimed at crippling Kremlin's war effort",
    "link": "https://theweek.com/business/economy/is-the-eu-funding-russia-more-than-ukraine",
    "timestamp": "2025-06-02T12:13:13Z"
  },
  {
    "title": "National Review’s Rich Lowry Tells Fox News Why Trump’s ‘TACO’ Nickname is Sticking: ‘A Real Phenomenon’",
    "description": "Long-time conservative thought leader Rich Lowry explained to Fox's Howard Kurtz why the 'TACO' nickname (Trump always chickens out) is resonating.\nThe post National Review’s Rich Lowry Tells Fox News Why Trump’s ‘TACO’ Nickname is Sticking: ‘A Real Phenomeno…",
    "link": "https://www.mediaite.com/media/tv/national-reviews-rich-lowry-tells-fox-news-why-trumps-taco-nickname-is-sticking-a-real-phenomenon/",
    "timestamp": "2025-06-02T12:12:52Z"
  },
  {
    "title": "House Bill Expands Access to Health Savings Accounts for Americans",
    "description": "The House passed the One Big Beautiful Bill Act last week, expanding Health Savings Account eligibility. This aims to help more Americans manage medical costs with tax-advantaged savings.",
    "link": "https://aarr.org/house-bill-expands-health-savings-account-access/",
    "timestamp": "2025-06-02T12:12:32Z"
  },
  {
    "title": "US-born Ukrainian military trans spokesperson sentenced in Russia",
    "description": "A Russian court has sentenced US trans citizen Sarah Ashton-Cirillo to 20 years for fighting as a mercenary for Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618502-ukrainian-trans-spokesperson-sentenced/",
    "timestamp": "2025-06-02T12:12:13Z"
  },
  {
    "title": "UK put on a war footing with defense overhaul — but is it too little, too late?",
    "description": "British Prime Minister Keir Starmer announced an overhaul of the U.K.'s defense spending on Monday.",
    "link": "https://www.cnbc.com/2025/06/02/uk-launches-defense-overhaul-but-is-it-too-little-too-late.html",
    "timestamp": "2025-06-02T12:12:11Z"
  },
  {
    "title": "Who Really Are the Lawless and the Dictatorial?",
    "description": "The left cries “dictatorship” while wielding the courts, agencies, and media to undermine laws, crush dissent, and call it democracy. The left is in its usual sanctimonious but schizophrenic mood. The media claims daily that the Trump administration has usurp…",
    "link": "https://freerepublic.com/focus/f-news/4320476/posts",
    "timestamp": "2025-06-02T12:11:18Z"
  },
  {
    "title": "Major Companies Abandon Law Firms That Signed Deals with Trump: Report",
    "description": "Law firms that struck deals with the Trump administration are facing corporate consequences according to reports.",
    "link": "https://www.newsweek.com/major-companies-abandon-law-firms-that-signed-deals-trump-report-2079712",
    "timestamp": "2025-06-02T12:11:05Z"
  },
  {
    "title": "I Have A Degree In Critical Race Theory. These Things People Believe About It Are Wild",
    "description": "“Politicians — including Donald Trump — have spent the last decade turning CRT into a boogeyman.”",
    "link": "https://www.huffpost.com/entry/critical-race-theory-crt-truth-misconceptions_n_6837487be4b004530c69943c",
    "timestamp": "2025-06-02T12:10:18Z"
  },
  {
    "title": "RFK Jr. says autism 'destroys' families. Here's what those families want you to know",
    "description": "RFK Jr. says autism 'destroys' families. Here's what those families want you to knownews4jax.com",
    "link": "https://www.news4jax.com/health/2025/06/02/rfk-jr-says-autism-destroys-families-heres-what-those-families-want-you-to-know/",
    "timestamp": "2025-06-02T12:08:57Z"
  },
  {
    "title": "Gautam Adani under new scrutiny from US prosecutors, WSJ reports",
    "description": "U.S. prosecutors are investigating whether companies linked to Indian billionaire Gautam Adani illegally imported Iranian liquefied petroleum gas (LPG) into India via the Mundra port, potentially violating U.S. sanctions. The U.S. Justice Department is report…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/gautam-adani-under-new-scrutiny-from-us-prosecutors-wsj-reports/articleshow/121572695.cms",
    "timestamp": "2025-06-02T12:08:51Z"
  },
  {
    "title": "RFK Jr. says autism 'destroys' families. Here's what those families want you to know",
    "description": "U.S. Health Secretary Robert F",
    "link": "https://abcnews.go.com/Health/wireStory/rfk-jr-autism-destroys-families-families-122408917",
    "timestamp": "2025-06-02T12:06:26Z"
  },
  {
    "title": "John Kennedy, Georgia's top Senate Republican, joins race for lieutenant governor",
    "description": "John Kennedy is joining a growing field of GOP candidates seeking to become the state’s next lieutenant governor in 2026",
    "link": "https://abcnews.go.com/Politics/wireStory/john-kennedy-georgias-top-senate-republican-joins-race-122410149",
    "timestamp": "2025-06-02T12:06:02Z"
  },
  {
    "title": "Sports betting isn't legal in all 50 states ... or is it?",
    "description": "A dispute between gambling regulators and an upstart company is testing what is a sports bet and what is not.",
    "link": "https://www.espn.com/espn/betting/story/_/id/45377686/kalshi-prediction-markets-disrupt-sports-betting",
    "timestamp": "2025-06-02T12:05:58Z"
  },
  {
    "title": "5 Big Student Loan Updates After A Hugely Consequential Month",
    "description": "The impacts of these recent events could touch every aspect of student debt from disbursement to loan repayment and student loan forgiveness.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/06/02/5-big-student-loan-updates-after-a-hugely-consequential-month/",
    "timestamp": "2025-06-02T12:05:22Z"
  },
  {
    "title": "Some Americans are shifting their summer plans to avoid tariff price hikes",
    "description": "Summer looks a little different this year for some Americans who say they are dialing back their leisure activities and shopping sprees due to tariffs.",
    "link": "https://www.nbcnews.com/business/consumer/americans-are-shifting-summer-plans-avoid-tariff-price-hikes-rcna206921",
    "timestamp": "2025-06-02T12:04:00Z"
  },
  {
    "title": "Tom Llamas 'excited' and ready to put his stamp on 'Nightly News' as he takes over",
    "description": "Tom Llamas said he’s \"excited\" to take the helm of Nightly News and will live by his tenants of being \"tough but fair\" while reporting \"without fear or favor.\"",
    "link": "https://www.nbcnews.com/news/us-news/tom-llamas-excited-ready-put-stamp-nightly-news-takes-rcna209935",
    "timestamp": "2025-06-02T12:03:40Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "In This Article:\nU.S. stock futures are pointing lower as investors review comments from China that accused the U.S. of undermining the recent trade agreement between the two countries; President Donald Trump said he would double tariffs on steel imports to 5…",
    "link": "https://biztoc.com/x/3a43e99e0a9849f6",
    "timestamp": "2025-06-02T12:03:09Z"
  },
  {
    "title": "US stock market futures fall: Dow, S&P 500, Nasdaq drop as US-China trade war fears reignite and Russia-Ukraine crisis sparks global selloff",
    "description": "US Stock market future today saw a pullback as Dow, S&P 500, and Nasdaq futures dropped amid rising US-China trade tensions and escalating concerns over the Russia-Ukraine war. China responded to U.S. tariff claims, reviving fears of a prolonged trade conflic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-fall-dow-sp-500-nasdaq-drop-as-us-china-trade-war-fears-reignite-and-russia-ukraine-crisis-sparks-global-selloff/articleshow/121571965.cms",
    "timestamp": "2025-06-02T12:03:07Z"
  },
  {
    "title": "White House Says Tariffs Are Here to Stay Amid Legal Battles",
    "description": "With the future of President Donald Trump’s major tariffs in question after back and forth legal battles in the courts, the White House says tariffs will continue no matter what. Meanwhile, Trump announces new plans to double tariffs on steel and aluminum imp…",
    "link": "https://www.today.com/video/trump-announces-plans-to-double-steel-and-aluminum-tariffs-240693829871",
    "timestamp": "2025-06-02T12:02:30Z"
  },
  {
    "title": "Ukraine-Russia peace talks end after barely an hour, Turkish officials say",
    "description": "Ukrainian officials say there are hundreds of children who were forcibly removed from Ukrainian territory by Russian forces, and it wants them returned as part of a peace deal.",
    "link": "https://www.jpost.com/breaking-news/article-856269",
    "timestamp": "2025-06-02T12:02:18Z"
  },
  {
    "title": "Where are US and China heading after Shangri-La Dialogue?",
    "description": "The cracks between the two superpowers, the US and China, seem to have widened during Asia's premier security forum. But while Washington is warning of the \"threat\" of China, Beijing is playing it close to the chest.",
    "link": "https://www.dw.com/en/where-are-us-and-china-heading-after-shangri-la-dialogue/a-72758831",
    "timestamp": "2025-06-02T12:02:00Z"
  },
  {
    "title": "Republican budget bill would strike blow to clean energy efforts in Colorado",
    "description": "The cuts would repeal or quickly phase out tax credits and loans for things such as home improvements for consumers, electric vehicles, wind and solar.",
    "link": "https://www.denverpost.com/2025/06/02/trump-big-beautiful-bill-clean-energy-tax-credits/",
    "timestamp": "2025-06-02T12:00:41Z"
  },
  {
    "title": "Trump’s ‘big, beautiful’ tax bill risks food assistance for tens of thousands of Coloradans, think tanks estimate",
    "description": "\"This is slashing support for 1 in 10 Coloradans who rely on SNAP. And then it’s shifting billions in costs to the states.\"",
    "link": "https://www.denverpost.com/2025/06/02/colorado-snap-trump-tax-bill/",
    "timestamp": "2025-06-02T12:00:12Z"
  },
  {
    "title": "Shut out of power in Washington, Democrats grapple with how to win over young men and working-class voters",
    "description": "Nearly seven months after Republicans won the White House and both chambers of Congress, Democrats are still coming to terms with the reasons behind their stinging defeats and looking for ways to claw back some power in next year’s midterm elections.",
    "link": "https://www.cnn.com/2025/06/02/politics/democrats-young-men-working-class-voters",
    "timestamp": "2025-06-02T12:00:03Z"
  },
  {
    "title": "The Paradox of Our ‘Secular Age’",
    "description": "Instead of killing off faith, modernity has supercharged some of its most dramatic manifestations.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/american-religion-charismatic-christianity/682991/",
    "timestamp": "2025-06-02T12:00:00Z"
  },
  {
    "title": "Day 1,195 of WW3. Moscow retaliates for losing 1/3 of their strategic bombers by injuring 6 civilians in Kharkiv with ballistic missiles. The Kremlin is really committed to the whole \"war atrocity\" schtick. This is your Monday Ukraine War thread [News]",
    "description": "Day 1,195 of WW3. Moscow retaliates for losing 1/3 of their strategic bombers by injuring 6 civilians in Kharkiv with ballistic missiles. The Kremlin is really committed to the whole \"war atrocity\" schtick. This is your Monday Ukraine War thread",
    "link": "https://www.fark.com/comments/13692324/Day-1195-of-WW3-Moscow-retaliates-for-losing-13-of-their-strategic-bombers-by-injuring-6-civilians-in-Kharkiv-with-ballistic-missiles-The-Kremlin-is-really-committed-to-whole-war-atrocity-schtick-This-is-your-Monday-Ukraine-War-thread",
    "timestamp": "2025-06-02T12:00:00Z"
  },
  {
    "title": "Harvard vs. Trump: All the President Wants Is for the University to Obey the Law",
    "description": "“It’s tough to make predictions, especially about the future,” America’s philosopher laureate Yogi Berra once said. Wise counsel, but it’s difficult to see how Harvard wins... Read More\nThe post Harvard vs. Trump: All the President Wants Is for the University…",
    "link": "https://www.dailysignal.com/2025/06/02/harvard-vs-trump-all-president-wants-university-obey-the-law/",
    "timestamp": "2025-06-02T12:00:00Z"
  },
  {
    "title": "Floyd Brown Blames Satan For His Firing From The Kennedy Center",
    "description": "Last week, anti-LGBTQ Christian nationalist activists Floyd Brown was fired from his position as vice president at the Kennedy Center and he is blaming Satan.",
    "link": "https://www.peoplefor.org/rightwingwatch/floyd-brown-blames-satan-his-firing-kennedy-center",
    "timestamp": "2025-06-02T12:00:00Z"
  },
  {
    "title": "RFK Jr. says autism 'destroys' families. Here's what those families want you to know",
    "description": "RFK Jr. says autism 'destroys' families. Here's what those families want you to knowwsls.com",
    "link": "https://www.wsls.com/health/2025/06/02/rfk-jr-says-autism-destroys-families-heres-what-those-families-want-you-to-know/",
    "timestamp": "2025-06-02T11:59:01Z"
  },
  {
    "title": "After talks with Zelenskyy and Macron, US senators warn: Putin ‘is preparing for more war’",
    "description": "Two U.S. senators are warning that Russian President Vladimir Putin is preparing a fresh military offensive against Ukraine.",
    "link": "https://www.bostonherald.com/2025/06/02/us-senators-putin-warning/",
    "timestamp": "2025-06-02T11:55:13Z"
  }
]