[
  {
    "title": "A landscape transformed: As it responds to cuts in federal programs, the arts community reels",
    "description": "For decades, there has been a nationwide artistic and cultural infrastructure receiving bipartisan support.",
    "link": "https://www.bostonherald.com/2025/05/12/the-arts-endangered/",
    "timestamp": "2025-05-12T17:41:21Z"
  },
  {
    "title": "US-China tariff truce will lessen shock but won’t stop prices rising, Fed governor warns",
    "description": "Adriana Kugler says she still expects to see higher prices and slower growth",
    "link": "https://www.irishtimes.com/business/2025/05/12/us-china-tariff-truce-will-lessen-shock-but-wont-stop-prices-rising-fed-governor-warns/",
    "timestamp": "2025-05-12T17:41:07Z"
  },
  {
    "title": "Zelenskyy and Erdogan discuss proposed Ukraine peace talks",
    "description": "Turkish President Recep Tayyip Erdogan offered to host Ukraine-Russia talks in Istanbul. US President Donald Trump offered to join. Follow DW for more US President Donald Trump says he could attend potential Russia-Ukraine talks\nUkrainian President Volodymyr …",
    "link": "https://www.dw.com/en/zelenskyy-and-erdogan-discuss-proposed-ukraine-peace-talks/live-72511628",
    "timestamp": "2025-05-12T17:41:00Z"
  },
  {
    "title": "Ramona Singer Proudly Proclaims Daniel Penny a ‘Hero’ and Everybody’s …",
    "description": "Reading Time: 4 minutesRamona Singer is taking some serious flak for her latest social media post.\nRamona Singer Proudly Proclaims Daniel Penny a ‘Hero’ and Everybody’s … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/05/ramona-singer-backlash-daniel-penny/",
    "timestamp": "2025-05-12T17:40:30Z"
  },
  {
    "title": "After fire, fear: Kashmiri locals remain on edge as shaky ceasefire appears to take hold",
    "description": "Residents living along de facto border between India and Pakistan recall the horror as drones and missiles pierced the skies Read Full Article at RT.com",
    "link": "https://www.rt.com/india/617421-india-pakistan-kahsmir-ceasefire/",
    "timestamp": "2025-05-12T17:39:05Z"
  },
  {
    "title": "Here’s How Much Trump Spent to Deport 32 Immigrants to Guantánamo",
    "description": "The Trump administration’s decision to deport immigrants to the U.S. base on Guantanamo Bay, Cuba, cost taxpayers at least $21 million between January 20 and April 8. \r\nRight now, the base only holds 32 immigrants, making the whole effort look like a massive …",
    "link": "https://newrepublic.com/post/195139/how-much-trump-spent-deport-immigrants-guantanamo",
    "timestamp": "2025-05-12T17:36:39Z"
  },
  {
    "title": "Could Midterm Politics Curb Trump’s Second-Term Rampage?",
    "description": "Some believe Trump is pulling his punches in order to help Mike Johnson hang on to the House for Republicans in the 2026 midterms.  It makes you wonder what he’d do if he didn’t care at all.",
    "link": "http://nymag.com/intelligencer/article/could-midterm-politics-curb-trumps-second-term-rampage.html",
    "timestamp": "2025-05-12T17:36:10Z"
  },
  {
    "title": "Fox News Host Claims Trump Is ‘Losing Money’ as President Despite Nearly $3 Billion Surge in Wealth",
    "description": "Fox News' David Webb claimed that President Donald Trump is \"losing money\" in his capacity as commander-in-chief on Monday.\nThe post Fox News Host Claims Trump Is ‘Losing Money’ as President Despite Nearly $3 Billion Surge in Wealth first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/fox-news-host-claims-trump-is-losing-money-as-president-despite-nearly-3-billion-surge-in-wealth/",
    "timestamp": "2025-05-12T17:35:30Z"
  },
  {
    "title": "Ukraine Open To Trump Joining Russia Talks In Türkiye",
    "description": "Ukrainian President Volodymyr Zelenskyy expressed support for U.S. President Donald Trump’s potential involvement in upcoming peace talks between Ukraine and Russia, set to take place in Turkey on Thursday. “All of us in Ukraine would appreciate it if Preside…",
    "link": "https://biztoc.com/x/95dcc04bf4521b66",
    "timestamp": "2025-05-12T17:34:42Z"
  },
  {
    "title": "Sounds About Pro-White: President Donald Trump Opens Path For White South African Refugees To Enter U.S.",
    "description": "President Donald Trump is opening a pipeline for white South African refugees to come to America, sparking discussions on X.",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-white-south-african-refugees/",
    "timestamp": "2025-05-12T17:34:35Z"
  },
  {
    "title": "Lincoln Project Bashes Trump's Latest Move, Then Finds Out Abraham Lincoln Did the Same Thing",
    "description": "The Lincoln Project complained about a Trump administration official signaling toward a move its own namesake once famously made.",
    "link": "https://www.westernjournal.com/lincoln-project-bashes-trumps-latest-move-finds-abraham-lincoln-thing/",
    "timestamp": "2025-05-12T17:33:04Z"
  },
  {
    "title": "In Pittsburgh, candidates face their future voters, part of a national effort to engage the young",
    "description": "Young people have consistently turned out to vote at lower rates than older Americans.",
    "link": "https://www.bostonherald.com/2025/05/12/democracy-youth-engagement/",
    "timestamp": "2025-05-12T17:32:53Z"
  },
  {
    "title": "Trump Takes Major Action to Reduce Drug Costs for Americans",
    "description": "President Donald Trump signed an executive order on Monday to reduce drug prices in America to rates similar to what those in other nations pay.\nThe post Trump Takes Major Action to Reduce Drug Costs for Americans appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/12/trump-takes-major-action-reduce-drug-costs-americans/",
    "timestamp": "2025-05-12T17:32:27Z"
  },
  {
    "title": "Trump says China will ‘open up’ to U.S. businesses, suspend trade barriers",
    "description": "Key Points President Donald Trump said China “agreed to open” after the two countries agreed to temporarily slash most of the tariffs on each other’s goods. Trump said that was “maybe the most important thing” to come out of trade talks with Treasury Secretar…",
    "link": "https://freerepublic.com/focus/f-news/4316531/posts",
    "timestamp": "2025-05-12T17:32:05Z"
  },
  {
    "title": "The Fed Is Worried About Stagflation: Here's Why This Analyst Says It Would Be Good For Bitcoin",
    "description": "The Federal Reserve has signaled that the U.S. risks facing stagflation. Stagflation would benefit Bitcoin, according to Grayscale Head of Research Zach...",
    "link": "https://finance.yahoo.com/news/fed-worried-stagflation-heres-why-173147547.html",
    "timestamp": "2025-05-12T17:31:47Z"
  },
  {
    "title": "‘In the name of diversity’: Law firms sanctioned by Trump accused of illegally discriminating against whites",
    "description": "EEOC investigation into federal violations pending",
    "link": "https://www.wnd.com/2025/05/in-the-name-of-diversity-law-firms-sanctioned-by-trump-accused-of-illegally-discriminating-against-whites/",
    "timestamp": "2025-05-12T17:30:42Z"
  },
  {
    "title": "Trump defends Qatar jumbo jet offer, says would be 'stupid' to turn away free plane",
    "description": "During a press briefing in the White House on Monday, before embarking on a four-day trip to the Middle East, Trump called the donation a \"very nice gesture.\"",
    "link": "https://abcnews.go.com/Politics/trump-defends-qatar-jumbo-jet-offer/story?id=121715591",
    "timestamp": "2025-05-12T17:29:37Z"
  },
  {
    "title": "America Could See Surge in Business Closures This Year: Poll",
    "description": "The report found half of surveyed small business owners expect their revenue to decline due to current or future tariffs.",
    "link": "https://www.newsweek.com/america-could-see-surge-business-closures-this-year-poll-2071019",
    "timestamp": "2025-05-12T17:29:31Z"
  },
  {
    "title": "Hamas releases American-Israeli hostage Edan Alexander",
    "description": "An American-Israeli soldier held hostage for more than 19 months in the Gaza Strip was released by Hamas on Monday.",
    "link": "https://www.today.com/news/hamas-releases-american-israeli-hostage-edan-alexander-rcna206317",
    "timestamp": "2025-05-12T17:29:14Z"
  },
  {
    "title": "Jasmine Crockett Says Dems Want ‘the Safest White Boy’ to Run in 2028... Here Are Some Good Options",
    "description": "Photo: Leigh Vogel (Getty Images)\r\nWith President Donald Trump tearing up the White House, Democrats are scrambling to find their presidential pick for the 2028 race. It’s too early to tell who will be at the top of either party’s ticket, but already, Texas R…",
    "link": "https://www.theroot.com/jasmine-crockett-says-dems-want-the-safest-white-boy-1851780260",
    "timestamp": "2025-05-12T17:28:00Z"
  },
  {
    "title": "Latest Trump Executive Order Redirects Drug Pricing Debate",
    "description": "On Sunday, May 11, President Donald Trump announced on Truth Social that he would sign an Executive Order today aimed at lowering prescription drug prices. The order refocuses the drug pricing debate, which often is centered around patents, on “equalizing” pr…",
    "link": "https://ipwatchdog.com/2025/05/12/latest-trump-executive-order-redirects-drug-pricing-debate/id=188806/",
    "timestamp": "2025-05-12T17:26:28Z"
  },
  {
    "title": "The Sky-High Corruption of Donald Trump",
    "description": "Chris Lehmann\n\n\n\nThe Democrats missed their first chance to spotlight Trump’s repeated violations of the Emoluments Clause of the Constitution. They shouldn’t miss their second.\r\n\n\r\n\n\nThe post The Sky-High Corruption of Donald Trump appeared first on The Nati…",
    "link": "https://www.thenation.com/article/politics/donald-trump-qatar-emoluments-clause-constitution/",
    "timestamp": "2025-05-12T17:25:36Z"
  },
  {
    "title": "Trump Says Americans Won't Be Treated Like 'Suckers' by Big Pharma Any Longer as He Signs Executive Order",
    "description": "Trump Says Americans Won't Be Treated Like 'Suckers' by Big Pharma Any Longer as He Signs Executive Orderwesternjournal.com",
    "link": "https://www.westernjournal.com/trump-says-americans-wont-treated-like-suckers-big-pharma-longer-signs-executive-order/",
    "timestamp": "2025-05-12T17:24:46Z"
  },
  {
    "title": "ROOKE: Trump Can Fix Major Manufacturing Issue No One’s Talking About",
    "description": "There is one issue with America becoming a booming manufacturing hub that President Trump is ideally suited to fix, and few people are discussing it",
    "link": "https://dailycaller.com/2025/05/12/rooke-trump-fix-american-manufacturing-trades-tariffs-blue-collar-workers/",
    "timestamp": "2025-05-12T17:23:38Z"
  },
  {
    "title": "Data Security Guardrails Critical Regardless of Open Banking Rule’s Fate",
    "description": "Whether a reworking or an outright rescission of the Consumer Financial Protection Bureau’s open banking rule is on the horizon, some of the most basic tenets of data-sharing underpinning financial innovation will be front and center throughout the next few m…",
    "link": "https://biztoc.com/x/45b1db2c10583698",
    "timestamp": "2025-05-12T17:23:37Z"
  },
  {
    "title": "Crypto miner backed by Trump sons will list on Nasdaq",
    "description": "The move to tap equity investors highlights the sector’s revival under President Donald Trump",
    "link": "https://biztoc.com/x/66a28d750acdcd5a",
    "timestamp": "2025-05-12T17:23:28Z"
  },
  {
    "title": "Trump Signs Order to Slash Drug Prices for Americans",
    "description": "President Donald Trump is attempting to slash drug prices for Americans by more closely aligning their costs to lower prices paid abroad, renewing and expanding upon a failed push from his first term.\nTrump plans to sign an executive order Monday directing th…",
    "link": "https://biztoc.com/x/84a9794045ac568b",
    "timestamp": "2025-05-12T17:23:27Z"
  },
  {
    "title": "Markets buoyed by US-China trade talks",
    "description": "Traders reduce bets on interest rate cuts from European Central Bank after deal",
    "link": "https://www.irishtimes.com/business/2025/05/12/markets-buoyed-by-us-china-trade-talks/",
    "timestamp": "2025-05-12T17:22:59Z"
  },
  {
    "title": "Legal details over accepting Qatari plane to use as Air Force One ‘still being worked out,’ White House says",
    "description": "“Any donation to this government is always done in full compliance with the law,” White House press secretary Karoline Leavitt said Monday.",
    "link": "https://www.cnn.com/2025/05/12/politics/qatar-jet-gift-trump",
    "timestamp": "2025-05-12T17:21:35Z"
  },
  {
    "title": "India’s Modi says fighting ‘only paused’ in wake of conflict with Pakistan",
    "description": "Modi vows India will 'retaliate on its own terms' if there is any future 'terror' attack on the country.",
    "link": "https://www.aljazeera.com/news/2025/5/12/indias-modi-says-fighting-only-paused-in-wake-of-conflict-with-pakistan",
    "timestamp": "2025-05-12T17:21:19Z"
  },
  {
    "title": "Ex-Trump aide was ordered not to take pens from foreign countries — as he takes new plane",
    "description": "Over the weekend, President Donald Trump announced that the nation of Qatar would give him a new luxury Air Force One and that the plane would be donated to his presidential library after his term in office — meaning he can keep using it.Discussing the matter…",
    "link": "https://www.rawstory.com/trump-qatar-plane-2671937235/",
    "timestamp": "2025-05-12T17:21:12Z"
  },
  {
    "title": "Trump rips ABC reporter for asking about accepting jet from Qatar, says she should be 'embarrassed'",
    "description": "President Donald Trump rejected an ABC reporter's question about receiving a jet from Qatar on Monday, saying it would be \"stupid\" not to accept it.",
    "link": "https://www.foxnews.com/media/trump-rips-abc-reporter-asking-about-accepting-jet-from-qatar-says-she-should-embarrassed",
    "timestamp": "2025-05-12T17:19:44Z"
  },
  {
    "title": "Contracts? Buyouts? Study at 1 school, play for another? Ambitious pitches to revamp college sports",
    "description": "With so much change in college athletics, a number of unusual ideas have been proposed in an effort to corral the chaos",
    "link": "https://abcnews.go.com/Politics/wireStory/contracts-buyouts-study-1-school-play-ambitious-pitches-121720479",
    "timestamp": "2025-05-12T17:18:29Z"
  },
  {
    "title": "Politician wanting to take credit: Shashi Tharoor slams Trump for declaring halting of Indo-Pak hostilities",
    "description": "Congress leader Shashi Tharoor has criticized US President Donald Trump's announcement regarding the ceasefire between India and Pakistan. Tharoor disapproves of Trump's attempt to take credit and re-hyphenate the two nations. He objects to the false equivale…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/politician-wanting-to-take-credit-shashi-tharoor-slams-trump-for-declaring-halting-of-indo-pak-hostilities/articleshow/121117634.cms",
    "timestamp": "2025-05-12T17:18:02Z"
  },
  {
    "title": "India, US talked on Pakistan tensions only between May 8-10, not on trade- contrary to Trump's claim",
    "description": "Following Operation Sindoor and heightened India-Pakistan tensions, US leaders engaged in high-level talks with India, but sources deny any trade discussions occurred, contradicting President Trump's claims. While the US announced a ceasefire, India insists i…",
    "link": "https://economictimes.indiatimes.com/news/india/india-us-talked-on-pakistan-tensions-only-not-on-trade-contrary-to-trumps-claim/articleshow/121117189.cms",
    "timestamp": "2025-05-12T17:16:59Z"
  },
  {
    "title": "Something Better To Do? President Donald Trump Has 'Skipped Out On All But 12 Of His Daily Intelligence Briefings' Since Taking Office",
    "description": "Since taking office, Donald Trump has participated in only 12 intelligence briefings – a notably low figure, even compared to his infrequent first-term pace.",
    "link": "https://radaronline.com/p/donald-trump-skip-daily-intelligence-briefings-office-presidency/",
    "timestamp": "2025-05-12T17:16:01Z"
  },
  {
    "title": "Thanks to Trump, OpenAI is reportedly struggling to get its Stargate project off the ground",
    "description": "A new report reveals OpenAI's Stargate project is struggling due to rising costs from tariffs, causing delays and financing challenges. Read more...",
    "link": "https://www.neowin.net/news/thanks-to-trump-openai-is-reportedly-struggling-to-get-its-stargate-project-off-the-ground/",
    "timestamp": "2025-05-12T17:16:01Z"
  },
  {
    "title": "Utah Farmers Face Struggle to Get Mental Health Help",
    "description": "Agriculture workers are 3.5 times more likely to die by suicide than the average American, but funding for therapy has run out for Utah farmers.",
    "link": "https://www.newsweek.com/utah-farmers-face-struggle-get-mental-health-help-2071054",
    "timestamp": "2025-05-12T17:13:06Z"
  },
  {
    "title": "Hamas says it released American-Israeli hostage in goodwill gesture toward Trump administration",
    "description": "Hamas released Israeli-American soldier Edan Alexander after 19 months of captivity, a move seen as a goodwill gesture towards the Trump administration. This release could pave the way for a new ceasefire with Israel, amidst ongoing conflict and humanitarian …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/hamas-says-it-released-american-israeli-hostage-in-goodwill-gesture-toward-trump-administration/articleshow/121117563.cms",
    "timestamp": "2025-05-12T17:13:05Z"
  },
  {
    "title": "Morgan Wallen breaks silence on 'SNL' after abrupt exit sparked controversy",
    "description": "Morgan Wallen's March 29 appearance and abrupt exit on \"Saturday Night Live\" sparked rumors that the country music star had a disagreement with the cast.",
    "link": "https://www.foxnews.com/entertainment/morgan-wallen-breaks-silence-snl-abrupt-exit-sparked-controversy",
    "timestamp": "2025-05-12T17:12:35Z"
  },
  {
    "title": "'In black and white': CNN host delivers basic civics lesson to prove Trump act ignores law",
    "description": "CNN anchor Manu Raju broke out the U.S. Constitution while hosting Inside Politics on Monday morning to slam President Donald Trump’s acceptance of a $400 million plane from Qatar.“We've heard a lot about the emoluments clause back in the first Trump term. Bu…",
    "link": "https://www.rawstory.com/trump-qatar/",
    "timestamp": "2025-05-12T17:11:59Z"
  },
  {
    "title": "What is the Emoluments Clause? And how might it apply to Qatar giving Trump a plane?",
    "description": "President Donald Trump’s readiness to accept a luxury jet as a gift from the ruling family of Qatar for conversion into a presidential aircraft has revived the conversations around emoluments and the notion of a president otherwise allegedly profiting ...",
    "link": "https://abcnews.go.com/US/wireStory/emoluments-clause-apply-qatar-giving-trump-plane-121719952",
    "timestamp": "2025-05-12T17:10:30Z"
  },
  {
    "title": "Fed rate cut bets hammered by U.S.-China tariff truce",
    "description": "Federal Reserve Chairman Jerome Powell said last week he needed 'further clarity on tariffs' before moving on interest rates.",
    "link": "https://www.thestreet.com/economy/fed-rate-cut-bets-hammered-by-u-s-china-tariff-truce",
    "timestamp": "2025-05-12T17:10:28Z"
  },
  {
    "title": "Greenlander Takes Helm of Arctic Council as Tensions Simmer",
    "description": "The body that fosters collaboration and climate science at the top of the world is under geopolitical pressure.",
    "link": "https://financialpost.com/pmn/business-pmn/greenlander-takes-helm-of-arctic-council-as-tensions-simmer",
    "timestamp": "2025-05-12T17:09:56Z"
  },
  {
    "title": "Tariff uncertainty not over",
    "description": "Chinese and US trade representatives agreed to suspend for 90 days 115% of the sky-high tariffs each had imposed on the other. This still leaves tariffs of 30% on Chinese goods to the US and 10% on US goods to China, plus a few other assorted tariffs that had…",
    "link": "https://freethoughtblogs.com/singham/2025/05/12/tariff-uncertainty-not-over/",
    "timestamp": "2025-05-12T17:09:42Z"
  },
  {
    "title": "What is the Emoluments Clause? And how might it apply to Qatar giving Trump a plane?",
    "description": "The constitutional prohibits the president from receiving gifts from foreign entities.",
    "link": "https://www.bostonherald.com/2025/05/12/what-is-emoluments-clause/",
    "timestamp": "2025-05-12T17:08:44Z"
  },
  {
    "title": "Trump reportedly frustrated by his inability to make good on foreign policy promises",
    "description": "Donald Trump expected to resolve the crises in Ukraine and Gaza quickly after returning to the White House. I’m surprised by the degree to which he's surprised.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-reportedly-frustrated-inability-make-good-foreign-policy-promise-rcna206295",
    "timestamp": "2025-05-12T17:07:34Z"
  },
  {
    "title": "What is the Emoluments Clause? And how might it apply to Qatar giving Trump a plane?",
    "description": "President Donald Trump’s readiness to accept a luxury jet as a gift from the ruling family of Qatar for conversion into a presidential aircraft has revived the conversations around emoluments and the notion of a president otherwise allegedly profiting off of …",
    "link": "https://www.seattlepi.com/news/article/what-is-the-emoluments-clause-and-how-might-it-20323105.php",
    "timestamp": "2025-05-12T17:06:24Z"
  },
  {
    "title": "Myanmar Junta Airstrike Kills 22 At School: Witnesses",
    "description": "A Myanmar junta airstrike hit a school Monday killing 22 people, including 20 children, witnesses said, despite a purported humanitarian ceasefire called to help the nation recover from a devastating earthquake.",
    "link": "https://www.ibtimes.com/myanmar-junta-airstrike-kills-22-school-witnesses-3773271",
    "timestamp": "2025-05-12T17:06:13Z"
  },
  {
    "title": "Erdoğan announces milestone as PKK declares dissolution",
    "description": "President Recep Tayyip Erdoğan said Monday that Türkiye had reached a “critical threshold” in its decades-long fight against terrorism, following an announcement that the outlawed PKK has decided to disband and lay down its arms.",
    "link": "https://www.hurriyetdailynews.com/erdogan-announces-milestone-as-pkk-declares-dissolution-209085",
    "timestamp": "2025-05-12T17:05:55Z"
  },
  {
    "title": "In photos: IDF soldier Edan Alexander's return to Israel",
    "description": "The day that Israeli-American hostage Edan Alexander came home to Israel, in photos.",
    "link": "https://www.jpost.com/israel-news/defense-news/article-853712",
    "timestamp": "2025-05-12T17:05:29Z"
  },
  {
    "title": "Contracts? Buyouts? Study at 1 school, play for another? Ambitious pitches to revamp college sports",
    "description": "As the amateur model of college athletics disintegrates, a handful of unusual ideas have been floated as ways to reign in some of the chaos surrounding the explosion in name, image and likeness compensation and a transfer portal that sees thousands of athlete…",
    "link": "https://sports.yahoo.com/article/contracts-buyouts-study-1-school-170450685.html",
    "timestamp": "2025-05-12T17:04:50Z"
  },
  {
    "title": "Trump, pressed on Qatari jet, says only ‘stupid’ people reject gifts",
    "description": "President Donald Trump angrily brushed off ethical concerns about accepting a $400 million luxury jet from Qatar to be used as a new Air Force One, saying only someone “stupid” would turn down such an offer. “I think it’s a great gesture from Qatar. I appreci…",
    "link": "https://www.boston.com/news/world-news/2025/05/12/trump-pressed-on-qatari-jet-says-only-stupid-people-reject-gifts/",
    "timestamp": "2025-05-12T17:04:42Z"
  },
  {
    "title": "Deputy attorney general who defended Trump in hush money trial named acting librarian of Congress",
    "description": "President Donald Trump's onetime defense attorney has been appointed acting librarian of Congress",
    "link": "https://abcnews.go.com/Politics/wireStory/deputy-attorney-general-defended-trump-hush-money-trial-121716828",
    "timestamp": "2025-05-12T17:02:25Z"
  },
  {
    "title": "Grandpa Scrambled Brains Lashes Out At Reporter For Asking About Qatari Plane",
    "description": "Donald didn't take it well when an ABC News reporter asked him about the $400 million plane from Qatar, which hasn't gone through Congress, and is against the Constitution's Emoluments Clause.\n\"Mr. President, what do you say to people who view that luxury jet…",
    "link": "https://crooksandliars.com/2025/05/grandpa-scrambled-brains-lashes-out",
    "timestamp": "2025-05-12T17:02:21Z"
  },
  {
    "title": "Myanmar junta airstrike kills 22 at school: witnesses",
    "description": "A Myanmar junta airstrike hit a school Monday killing 22 people, including 20 children, witnesses said, despite a purported humanitarian ceasefire called to help the nation recover from a devastating earthquake. The strike hit a school in the village of Oe Ht…",
    "link": "https://www.digitaljournal.com/world/myanmar-junta-airstrike-kills-22-at-school-witnesses/article",
    "timestamp": "2025-05-12T17:02:20Z"
  },
  {
    "title": "Edan Alexander to meet Trump in Qatar if he wishes, family tells Ynet",
    "description": "Released Israeli hostage Edan Alexander will meet US President Donald Trump in Qatar if he wishes and his medi",
    "link": "https://www.jpost.com/breaking-news/article-853715",
    "timestamp": "2025-05-12T17:02:16Z"
  },
  {
    "title": "Trump sons' American Bitcoin to go public",
    "description": "American Bitcoin, a new crypto mining operation started by Eric Trump, Donald Trump Jr., and data-centre operator Hut 8, is merging with Gryphon Digital Mining in a stock-for-stock transaction, placing it in a position to go public on the Nasdaq by the third …",
    "link": "https://qz.com/trump-sons-american-bitcoin-go-public-gryphon-merger-1851780255",
    "timestamp": "2025-05-12T17:02:00Z"
  },
  {
    "title": "Why Trump's Middle East trip is going to be very different this time",
    "description": "Donald Trump and US tech elites are expected to visit Saudi Arabia this week.\nDoug Mills-Pool/Getty Images\nDonald Trump is set to visit Saudi Arabia, Qatar, and the UAE this week.\nThe president will likely be seeking big US investments, as he did during his 2…",
    "link": "https://biztoc.com/x/237914b5ac02d91b",
    "timestamp": "2025-05-12T17:01:38Z"
  },
  {
    "title": "Everyone hates Qatar's reported luxury plane gift to Trump — even the MAGA faithful",
    "description": "President Donald Trump has defended a potential jet offer from Qatar.\nAnna Moneymaker/Getty Images\nPresident Trump is poised to accept a jet from Qatar to be used as Air Force One.\nABC News reported that AG Pam Bondi signed off on the potential deal.\nTrump is…",
    "link": "https://biztoc.com/x/6e9bac4727e70828",
    "timestamp": "2025-05-12T17:01:22Z"
  },
  {
    "title": "Texas-Sized Trouble for John Cornyn: Leadership-Aligned Poll Shows Double-Digit Paxton Lead",
    "description": "Sen. John Cornyn (R-TX) might be insurmountably behind Texas Attorney General Ken Paxton (R) in the primary to keep his seat, a poll shows.\nThe post Texas-Sized Trouble for John Cornyn: Leadership-Aligned Poll Shows Double-Digit Paxton Lead appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/05/12/texas-sized-trouble-for-john-cornyn-leadership-aligned-poll-shows-double-digit-paxton-lead/",
    "timestamp": "2025-05-12T17:00:48Z"
  },
  {
    "title": "House Tax Bill Draft Calls for $30,000 SALT Deduction Limit",
    "description": "The House tax committee’s draft bill to renew President Donald Trump’s tax cuts calls for increasing the state and local tax deduction to $30,000 for couples, but limits the write-off to households earning $400,000 or less, according to a person familiar with…",
    "link": "https://financialpost.com/pmn/business-pmn/house-tax-bill-draft-calls-for-30000-salt-deduction-limit",
    "timestamp": "2025-05-12T17:00:13Z"
  },
  {
    "title": "Trump hopeful for Russia-Ukraine talks",
    "description": "US President Donald Trump has reiterated his hopes that Russia-Ukraine talks will actually take place Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617434-trump-russia-ukraine-talks/",
    "timestamp": "2025-05-12T16:59:59Z"
  },
  {
    "title": "Report: China Bought over $1 Billion of Sanctioned Venezuelan Oil Labeled 'Brazilian'",
    "description": "Traders have rebranded more than $1 billion worth of Venezuelan oil shipments to China as Brazilian crude over the past year to circumvent U.S. oil sanctions, Reuters reported on Monday.\nThe post Report: China Bought over $1 Billion of Sanctioned Venezuelan O…",
    "link": "https://www.breitbart.com/latin-america/2025/05/12/report-china-bought-over-1-billion-sanctioned-venezuelan-oil-labeled-brazilian/",
    "timestamp": "2025-05-12T16:59:23Z"
  },
  {
    "title": "Episcopal Church says it won’t help resettle white South Africans granted refugee status in US",
    "description": "The church cited its longstanding commitment to racial justice and reconciliation.",
    "link": "https://www.bostonherald.com/2025/05/12/episcopal-church-south-africa-refugees/",
    "timestamp": "2025-05-12T16:58:53Z"
  },
  {
    "title": "NYC will see a 17 percent drop in international tourists due to POTUS policies",
    "description": "Just when tourism was bouncing back, Trump scared off the globe again",
    "link": "https://www.timeout.com/newyork/news/nyc-will-see-a-17-percent-drop-in-international-tourists-due-to-potus-policies-051225",
    "timestamp": "2025-05-12T16:58:27Z"
  },
  {
    "title": "Trump pulls pick for top D.C. prosecutor, adding to parade of second-term failures",
    "description": "Jen Psaki says the collapse of Ed Martin's nomination for D.C. U.S. Attorney adds to the Trump administration's parade of second-term failures.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-ed-martin-nomination-failure-rcna205890",
    "timestamp": "2025-05-12T16:58:08Z"
  },
  {
    "title": "Why Trump's Middle East trip is going to be very different this time",
    "description": "Trump is heading to the Middle East for his first major overseas trip of his second term. Deals will likely be high on his agenda.",
    "link": "https://www.businessinsider.com/trump-middle-east-trip-saudi-investment-forum-ai-tech-oil-2025-5",
    "timestamp": "2025-05-12T16:55:01Z"
  },
  {
    "title": "Trump Floats Joining Possible Ukraine-Russia Talks in Turkey (Akayla Gardner/Bloomberg)",
    "description": "Akayla Gardner / Bloomberg:\nTrump Floats Joining Possible Ukraine-Russia Talks in Turkey  —  US President Donald Trump raised the possibility of flying to Turkey on Thursday to join potential conversations over the war in Ukraine between Volodymyr Zelenskiy a…",
    "link": "https://www.memeorandum.com/250512/p73",
    "timestamp": "2025-05-12T16:55:01Z"
  },
  {
    "title": "Steve Madden, Foot Locker and More Shoe Stocks Soar on Trump’s Latest 90-day Tariff Deal With China",
    "description": "This comes after an early morning joint statement from the United States and China where they announced a substantially reduction on tariff rates.",
    "link": "http://footwearnews.com/business/business-news/trump-china-tariff-pause-shoe-stocks-rise-1234808950/",
    "timestamp": "2025-05-12T16:53:51Z"
  },
  {
    "title": "Everyone hates Qatar's reported luxury plane gift to Trump — even the MAGA faithful",
    "description": "The US is poised to accept a jet from Qatar. But legal experts previously told BI the reported gift raises both ethical and constitutional concerns.",
    "link": "https://www.businessinsider.com/trump-qatar-luxury-jet-maga-republicans-reaction-pushback-2025-5",
    "timestamp": "2025-05-12T16:53:35Z"
  },
  {
    "title": "White House defends Qatari Air Force One 'donation'",
    "description": "WASHINGTON: The White House insisted Monday (May 12) it would act with \"utmost transparency\" after Qatar offered President Donald Trump a new Air Force One, rejecting suggestions that the oil-rich Gulf state would expect preferential treatment in return. Pres…",
    "link": "https://www.channelnewsasia.com/world/white-house-defends-qatari-air-force-one-donation-5124796",
    "timestamp": "2025-05-12T16:52:00Z"
  },
  {
    "title": "Trump vows to force higher medicine prices in EU as he looks to lower US drugs costs",
    "description": "White House sets out plans for price targets and eliminating ‘middlemen’ in executive order",
    "link": "https://www.irishtimes.com/business/2025/05/12/trump-vows-to-force-higher-medicine-prices-in-eu-as-he-looks-to-lower-us-drugs-prices/",
    "timestamp": "2025-05-12T16:51:24Z"
  },
  {
    "title": "‘I Didn’t Understand It’: Ed Martin Baffled By Reasons Thom Tillis Gave For Opposing His Nomination",
    "description": "Ed Martin said that he was confused why Republican North Carolina Sen. Thom Tillis opposed his nomination to serve as D.C.’s top prosecutor.",
    "link": "https://dailycaller.com/2025/05/12/i-didnt-understand-it-ed-martin-baffled-by-reasons-thom-tillis-gave-for-opposing-his-nomination/",
    "timestamp": "2025-05-12T16:51:09Z"
  },
  {
    "title": "Trump to Thune and Johnson: Tariffs and drug pricing policy would save 'hundreds of millions' of dollars",
    "description": "President Donald Trump said Monday he “just called” Speaker Mike Johnson and Senate Majority Leader John Thune to inform them about the cost savings they could recoup for their party-line megabill — thanks to the president's sprawling tariff regime and his “m…",
    "link": "https://biztoc.com/x/3e3c634ba86e0d1f",
    "timestamp": "2025-05-12T16:50:13Z"
  },
  {
    "title": "Reconciliation text includes $500 million for modernization and AI at Commerce",
    "description": "The text also includes a prohibition on state-level enforcement of AI laws and regulations.",
    "link": "https://www.nextgov.com/artificial-intelligence/2025/05/reconciliation-text-includes-500-million-modernization-and-ai-commerce/405242/",
    "timestamp": "2025-05-12T16:50:00Z"
  },
  {
    "title": "Hong Kong's CK Hutchison assures legal compliance in ports deal",
    "description": "\"This transaction would never be carried out under any illegal or non-compliant circumstances,\" the company said in a statement.  The Hong Kong-based...",
    "link": "https://finance.yahoo.com/news/hong-kongs-ck-hutchison-assures-164902353.html",
    "timestamp": "2025-05-12T16:49:02Z"
  },
  {
    "title": "Slog AM: The 2025 City Elections Begin, Trump Wants a New Jet, and Hegseth Is Still an Idiot",
    "description": "Seattle's only news roundup.\n \n by Hannah Murphy Winter\n \n \n \n Good Morning! We’re looking at the kind of spring weather that out-of-towners don’t believe exists here: Highs in the mid 60s, partly cloudy, small chance of rain. I’m guessing even Charles Mudede…",
    "link": "https://www.thestranger.com/slog-am/2025/05/12/80053638/slog-am-the-2025-city-elections-begin-trump-wants-a-new-jet-and-hegseth-is-still-an-idiot",
    "timestamp": "2025-05-12T16:49:00Z"
  },
  {
    "title": "Trump Signs EO to Slash Drug Prices",
    "description": "State of the Union: Americans will be able to buy drugs at the lowest cost offered worldwide.\nThe post Trump Signs EO to Slash Drug Prices appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-signs-eo-to-slash-drug-prices/",
    "timestamp": "2025-05-12T16:48:54Z"
  },
  {
    "title": "Last American-Israeli Hostage, Edan Alexander, Released from Hamas Captivity",
    "description": "Edan Alexander, 21, the last American-Israeli hostage, was released Monday by Hamas to the Red Cross and is en route to Israel, where he will be met by his family, doctors, and officials from both Israel and the U.S.\nThe post Last American-Israeli Hostage, Ed…",
    "link": "https://www.breitbart.com/middle-east/2025/05/12/last-american-israeli-hostage-edan-alexander-released-from-hamas-captivity/",
    "timestamp": "2025-05-12T16:48:22Z"
  },
  {
    "title": "Trump offers to join potential Russia-Ukraine talks in Turkey",
    "description": "U.S. President Donald Trump offered on Monday to join prospective Ukraine-Russia talks in Turkey later this we",
    "link": "https://www.jpost.com/breaking-news/article-853714",
    "timestamp": "2025-05-12T16:48:08Z"
  },
  {
    "title": "Trump Retreats On His Trade War's Chinese Front, Claims Big Victory",
    "description": "But the remaining 30% import tax on Chinese goods will still cost Americans many billions of dollars per year in higher prices.",
    "link": "https://www.huffpost.com/entry/trump-china-tariffs-retreat_n_68220621e4b0d06d2434b8f8",
    "timestamp": "2025-05-12T16:46:20Z"
  },
  {
    "title": "Qatar Gives Biggest, Bestest Plane To Biggest, Bestest Boy Donald Trump",
    "description": "The Qatari bribe plane is a personal gift, no matter what the White House tells you.",
    "link": "https://www.wonkette.com/p/qatar-gives-biggest-bestest-plane",
    "timestamp": "2025-05-12T16:45:48Z"
  },
  {
    "title": "China Called Trump’s Bluff",
    "description": "Jonathan Chait: \"When President Donald Trump launched his trade war on the world, he issued a stern warning: 'Do not retaliate and you will be rewarded.' China ignored the warning. It was rewarded anyway. This",
    "link": "https://politicalwire.com/2025/05/12/china-called-trumps-bluff/",
    "timestamp": "2025-05-12T16:45:35Z"
  },
  {
    "title": "Amid Trump’s battle against DEI, nonprofits filling critical labor gaps are caught in the crossfire",
    "description": "Many say compliance to Trump orders is impossible.",
    "link": "https://www.bostonherald.com/2025/05/12/dei-nonprofits/",
    "timestamp": "2025-05-12T16:45:23Z"
  },
  {
    "title": "Trump Heads On Major Middle East Tour",
    "description": "US President Donald Trump on Monday left for Saudi Arabia on what he called a \"historic\" tour of the Middle East that will mix urgent diplomacy on Gaza and Iran with huge business deals.",
    "link": "https://www.ibtimes.com/trump-heads-major-middle-east-tour-3773268",
    "timestamp": "2025-05-12T16:45:22Z"
  },
  {
    "title": "Canadian Travel Boycott Has Strengthened—Car Travel To U.S. Plummeted 35% In April, Fourth Consecutive Month Of Year-Over-Year Declines",
    "description": "Canadians’ boycott of the U.S. led to a 35% year-over-year drop in car travel—setting up a potential economic loss of $7.4 billion this year.",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/05/12/canadian-travel-boycott-strengthened-car-travel-plummeted-april-fourth-consecutive-month/",
    "timestamp": "2025-05-12T16:45:06Z"
  },
  {
    "title": "How much damage did the L.A. wildfires cause? After federal cuts, a crucial estimate is missing",
    "description": "Researchers were told not to share data on the January fires or to update a climate disaster database before the Trump administration shut the  program down.",
    "link": "https://www.nbcnews.com/science/environment/much-damage-l-wildfires-cause-trump-admin-cuts-crucial-estimate-missin-rcna205700",
    "timestamp": "2025-05-12T16:43:54Z"
  },
  {
    "title": "‘Peacemaker-in-Chief’ — British Peer Calls for Trump to Be Awarded Nobel Peace Prize for Preventing India-Pakistan War",
    "description": "A member of the House of Lords has called on the British government to nominate U.S. President Donald Trump for a Nobel Peace Prize for his efforts to prevent a war between India and Pakistan. Lord Sarfraz, a Pakistani-heritage businessman and Conservative po…",
    "link": "https://freerepublic.com/focus/f-news/4316520/posts",
    "timestamp": "2025-05-12T16:43:14Z"
  },
  {
    "title": "Deputy attorney general Todd Blanche, who defended Trump in hush money trial, named acting Librarian of Congress",
    "description": "Blanche is a former federal prosecutor who was a key figure on Trump's defense team in his New York hush money trial, which ended in a conviction on 34 felony counts.",
    "link": "https://www.pbs.org/newshour/politics/deputy-attorney-general-todd-blanche-who-defended-trump-in-hush-money-trial-named-acting-librarian-of-congress",
    "timestamp": "2025-05-12T16:42:20Z"
  },
  {
    "title": "Trump heads on major Middle East tour",
    "description": "US President Donald Trump on Monday left for Saudi Arabia on what he called a “historic” tour of the Middle East that will mix urgent diplomacy on Gaza and Iran with huge business deals. Air Force One took off on a journey that will include visits to Qatar an…",
    "link": "https://www.digitaljournal.com/world/trump-heads-on-major-middle-east-tour/article",
    "timestamp": "2025-05-12T16:42:20Z"
  },
  {
    "title": "RFK Jr. Dunks on AOC, Bernie Sanders: Trump Taking on Big Pharma Proves He Stands Up to Oligarchs",
    "description": "\"There has never been a president more willing to stand up to the oligarchs\" than President Donald Trump, Health and Human Services Secretary Robert F. Kennedy Jr. said during a press conference Monday, where Trump signed an executive order to reduce the cost…",
    "link": "https://www.breitbart.com/politics/2025/05/12/rfk-jr-dunks-on-aoc-bernie-sanders-trump-taking-on-big-pharma-proves-he-stands-up-to-oligarchs/",
    "timestamp": "2025-05-12T16:42:06Z"
  },
  {
    "title": "Trump's push for lower drug prices is just asking Big Pharma to make less money",
    "description": "Pharma stocks rebounded and rose into the green Monday afternoon after details of President Donald Trump’s executive order on drug prices became public.Read more...",
    "link": "https://qz.com/trump-executive-order-drug-prices-pharma-eli-lilly-1851780259",
    "timestamp": "2025-05-12T16:42:00Z"
  },
  {
    "title": "Trump Defends Importing White South Africans to US With Absurd Claim They Are Victims of ‘Genocide’",
    "description": "President Donald Trump on Monday claimed the White South Africans his administration has welcomed into the country were fleeing from genocide.\nThe post Trump Defends Importing White South Africans to US With Absurd Claim They Are Victims of ‘Genocide’ first a…",
    "link": "https://www.mediaite.com/politics/trump-defends-importing-white-south-africans-to-us-with-absurd-claim-they-are-victims-of-genocide/",
    "timestamp": "2025-05-12T16:41:29Z"
  },
  {
    "title": "Is the U.S going to face toilet paper shortages due to Donald Trump's tariffs? Here's what the world's largest supplier of pulp is saying",
    "description": "A potential toilet paper shortage looms in the United States. This is due to US tariffs on Brazilian imports. Suzano SA, a major pulp exporter, reports reduced shipments. The tariffs are increasing costs for US consumers. These costs may lead to higher prices…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-the-u-s-going-to-face-toilet-paper-shortages-due-to-donald-trumps-tariffs-heres-what-the-worlds-largest-supplier-of-pulp-is-saying/articleshow/121116600.cms",
    "timestamp": "2025-05-12T16:41:04Z"
  },
  {
    "title": "Why Nuclear Stocks Constellation Energy, Vistra, and Oklo All Popped This Morning",
    "description": "In This Article:\nKey Points\n-\nDonald Trump just declared a truce in the trade war with China, and investors are rejoicing.\n-\nInvestors in nuclear energy have additional reason to smile, as the Trump administration angles to boost nuclear reactor projects.\nSha…",
    "link": "https://biztoc.com/x/bbe8001cb4af8169",
    "timestamp": "2025-05-12T16:39:58Z"
  }
]