[
  {
    "title": "The world leaders set to attend Francis’s funeral",
    "description": "Several world leaders have announced they will travel to Rome for Pope Francis’s funeral on Saturday, which is likely to also draw a huge crowd in the square in front of St Peter’s Basilica at the Vatican. Here is a list of the expected VIP guests. – Americas…",
    "link": "https://www.digitaljournal.com/world/the-world-leaders-set-to-attend-franciss-funeral/article",
    "timestamp": "2025-04-22T15:45:41Z"
  },
  {
    "title": "Minnesota State Employee Who Vandalized 6 Teslas Causing $20,000 in Damages *Will Not* Face Charges",
    "description": "Hennepin County, Minnesota, has decided not to file criminal charges against a 33-year-old state government employee who admitted to causing over $20,000 in damages to six Tesla vehicles in a politically motivated vandalism spree last month.\nThe post Minnesot…",
    "link": "https://www.breitbart.com/tech/2025/04/22/minnesota-state-employee-who-vandalized-6-teslas-causing-20000-in-damages-will-not-face-charges/",
    "timestamp": "2025-04-22T15:45:28Z"
  },
  {
    "title": "The World Leaders Set To Attend Francis's Funeral",
    "description": "Several world leaders have announced they will travel to Rome for Pope Francis's funeral on Saturday, which is likely to also draw a huge crowd in the square in front of St Peter's Basilica at the Vatican.",
    "link": "https://www.ibtimes.com/world-leaders-set-attend-franciss-funeral-3770943",
    "timestamp": "2025-04-22T15:45:12Z"
  },
  {
    "title": "Ron Johnson says he wants to know 'what actually happened on 9/11,’ calls for hearings",
    "description": "Venturing into long-debunked conspiracy theories, Johnson said World Trade Center Building 7 could not have come down “in any other way than a controlled demolition.\"",
    "link": "https://madison.com/news/state-regional/government-politics/article_9d320437-0630-4992-8eee-a85e24f136df.html",
    "timestamp": "2025-04-22T15:45:00Z"
  },
  {
    "title": "Child Asthma Will Worsen with Trump’s Pollution Rollbacks and RFK, Jr.’s CDC Cuts",
    "description": "President Trump has ordered agencies to act “urgently” to curb asthma—a goal at odds with moves to roll back air pollution limits and with RFK, Jr., cutting CDC experts",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/04/22/fired-asthma-experts-slashed-rules-are-double-whammy-for-american-lungs-00294026",
    "timestamp": "2025-04-22T15:45:00Z"
  },
  {
    "title": "Trump stands by Hegseth amid ouster reports",
    "description": "The president dismissed reports that he was on the verge of firing Defense Secretary Pete Hegseth over a second national security breach",
    "link": "https://theweek.com/politics/pete-hegseth-signal-chat-trump",
    "timestamp": "2025-04-22T15:43:46Z"
  },
  {
    "title": "Trump-washing Israel's Kahanist far right: Ben-Gvir's U.S. trip is a radical pivot from the Biden years",
    "description": "The U.S. President is not expected to meet Israel's extremist National Security Minister, but Donald Trump has already reversed Joe Biden's sanctions on  Itamar Ben-Gvir's violent allies. Still, he may soon realize that warming up to Ben-Gvir contrasts with U…",
    "link": "https://www.haaretz.com/us-news/2025-04-22/ty-article/.premium/trump-washing-israels-far-right-ben-gvirs-u-s-trip-is-a-radical-pivot-from-biden-years/00000196-5d7e-d014-a5bf-dffee25d0000",
    "timestamp": "2025-04-22T15:42:25Z"
  },
  {
    "title": "Mahmoud Khalil’s Wife Announces Birth of Their Child",
    "description": "Dr. Noor Abdalla, the wife of Palestinian activist Mahmoud Khalil, gave birth to their first son on Monday while he remained detained more than 1,000 miles away in Louisiana.",
    "link": "http://www.thecut.com/article/mahmoud-khalils-wife-noor-abdalla-gives-birth-to-their-son.html",
    "timestamp": "2025-04-22T15:41:08Z"
  },
  {
    "title": "Steve Forbes: Trump's Attacks On Fed Making Stock Markets Worse",
    "description": "Trump-supporting Steve Forbes told Fox Business Network that Trump's attacks on the Federal Reserve are causing more chaos and uncertainty because the Fed can't rescue inflation from under Trump's tariffs and it's reflected in a crash of today's markets.\nDeme…",
    "link": "https://crooksandliars.com/2025/04/steve-forbes-trumps-attacks-fed-making",
    "timestamp": "2025-04-22T15:41:07Z"
  },
  {
    "title": "George Clooney takes on Donald Trump and Elon Musk after the President called him a 'fake movie actor'; here's what the star said",
    "description": "George Clooney has shrugged off Donald Trump's insult calling him a \"fake movie actor.\" Clooney stated he doesn't care about Trump's remarks, emphasizing his responsibility to speak the truth. This response follows Trump's criticism of Clooney's op-ed in The …",
    "link": "https://economictimes.indiatimes.com/news/international/us/george-clooney-takes-on-donald-trump-and-elon-musk-after-the-president-called-him-a-fake-movie-actor-heres-what-the-star-said/articleshow/120523916.cms",
    "timestamp": "2025-04-22T15:40:49Z"
  },
  {
    "title": "US Flexes Nuclear Weapons Forces",
    "description": "The U.S. has possessed 3,748 warheads in its nuclear arsenal as of September 2023, official data shows.",
    "link": "https://www.newsweek.com/us-military-nuclear-weapons-bombers-icbm-2062539",
    "timestamp": "2025-04-22T15:40:15Z"
  },
  {
    "title": "Pete Hegseth’s Patriotic Duty Is to Resign",
    "description": "His incompetence is putting America’s security at risk.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/hegseth-trump-resign/682536/",
    "timestamp": "2025-04-22T15:39:50Z"
  },
  {
    "title": "DC weighs layoffs and other cuts as House leaves capital city in budget limbo",
    "description": "Washington Mayor Muriel Bowser and the District of Columbia Council are scrambling to address a financial crisis created when the Republican-controlled House of Representatives recessed without voting to fix a hole in the city budget",
    "link": "https://abcnews.go.com/US/wireStory/dc-weighs-layoffs-cuts-house-leaves-capital-city-121051030",
    "timestamp": "2025-04-22T15:37:41Z"
  },
  {
    "title": "Loblaws says groceries are about to get more expensive in Canada again",
    "description": "Shoppers can expect to see grocery prices continue to rise in Canada amid U.S. President Donald Trump's tariffs, according to a new report by Loblaw Companies Limited.The retailer, which owns major grocery chains like Loblaws, No Frills and Real Canadian Supe…",
    "link": "https://dailyhive.com/canada/tariffs-canada-loblaw-higher-grocery-prices#google_vignette",
    "timestamp": "2025-04-22T15:37:38Z"
  },
  {
    "title": "Trump's trade war to hit economic growth, including in Australia, says IMF",
    "description": "The International Monetary Fund says the US will be hardest hit by its own increased tariffs, which the organisation says is the biggest upheaval to global trade in 80 years.",
    "link": "https://www.abc.net.au/news/2025-04-23/imf-downgrades-australia-global-growth-tariffs-to-hit-us/105204020",
    "timestamp": "2025-04-22T15:37:06Z"
  },
  {
    "title": "Rubio Plans to Close Offices in State Department Overhaul",
    "description": "Secretary of State Marco Rubio announced plans to reorganize what he called a “bloated” State Department, vowing Tuesday to cut programs and close offices but stopping short of a proposed executive order that outlined even more drastic changes.",
    "link": "https://financialpost.com/pmn/business-pmn/rubio-plans-to-close-offices-in-state-department-overhaul",
    "timestamp": "2025-04-22T15:37:03Z"
  },
  {
    "title": "Gold soars to a new high as economic uncertainty deepens. Here's what to know",
    "description": "As economic uncertainty deepens worldwide, gold prices have notched more and more record highs.\nThat's because gold sales can rise sharply when anxious investors seek “safe havens” for parking their money. Gold's current rally arrives as U.S. President Donald…",
    "link": "https://biztoc.com/x/c933b2867c08205a",
    "timestamp": "2025-04-22T15:36:26Z"
  },
  {
    "title": "iPhone 17e launch timeframe set for May 2026",
    "description": "A report from Weibo claims the iPhone 17e could see a launch timeframe of May 2026, with the handset nearing trial production.",
    "link": "https://www.androidheadlines.com/2025/04/iphone-17e-launch-timeframe-may-2026.html",
    "timestamp": "2025-04-22T15:36:22Z"
  },
  {
    "title": "GE Aerospace CEO Culp advocates tariff-free regime for aviation industry",
    "description": "By Rajesh Kumar Singh\nCHICAGO (Reuters) -GE Aerospace CEO Larry Culp said on Tuesday he advocated re-establishing a tariff-free regime for the aerospace industry under the 1979 Civil Aircraft Agreement when he met with U.S. President Donald Trump.\nIn an inter…",
    "link": "https://biztoc.com/x/d8065859a27af08e",
    "timestamp": "2025-04-22T15:36:14Z"
  },
  {
    "title": "Trump will revive penalties for student-loan borrowers who are behind on payments. Here's what to expect",
    "description": "President Donald Trump is resuming collections on defaulted student-loan borrowers.\nRobyn Beck/AFP via Getty Images\nTrump is resuming collections on defaulted student loans for the first time in five years.\nIt means borrowers will soon be subject to the conse…",
    "link": "https://biztoc.com/x/71090a592a1b4d6a",
    "timestamp": "2025-04-22T15:35:57Z"
  },
  {
    "title": "US and global economic outlook deteriorates in Trump trade war, IMF says",
    "description": "The International Monetary Fund says the US and global economies will likely slow significantly in the wake of President Donald Trump’s tariffs and the uncertainty they have created.",
    "link": "https://www.clickorlando.com/business/2025/04/22/us-global-economic-outlook-worsens-in-the-face-of-trumps-tariffs-imf-says/",
    "timestamp": "2025-04-22T15:35:47Z"
  },
  {
    "title": "Prince William to attend funeral of Pope Francis",
    "description": "The Prince of Wales will represent the King at the funeral of Pope Francis at the Vatican on Saturday.",
    "link": "https://www.bbc.com/news/articles/cg41ed60gp5o",
    "timestamp": "2025-04-22T15:35:25Z"
  },
  {
    "title": "Take a Wild Guess What State Department Office Marco Rubio Just Killed",
    "description": "Secretary of State Marco Rubio on Tuesday revealed the largest State Department employment overhaul “in decades,” eliminating and restructuring entire offices in the department. Lost in the shake-up: Rubio has killed the Bureau of Conflict and Stabilization O…",
    "link": "https://newrepublic.com/post/194251/marco-rubio-state-department-eliminate-russia-office",
    "timestamp": "2025-04-22T15:35:24Z"
  },
  {
    "title": "Social Security Benefits Could Be Withheld From Millions: What to Know",
    "description": "The resumption of loan payments will impact more than 5 million borrowers who are currently in default.",
    "link": "https://www.newsweek.com/social-security-benefits-withheld-defaulted-student-loans-2062558",
    "timestamp": "2025-04-22T15:34:39Z"
  },
  {
    "title": "US Stock Market Today: Market rallies as Dow jumps 810 points, S&P 500 gains 109 points, Nasdaq surges 2.4% amid Tesla rebound, Trump-Fed tensions, and defense stock losses",
    "description": "US Stock Market Today: Dow rallies 810 points as Wall Street shakes off Monday’s massive sell-off, regaining ground amid Trump’s escalating attacks on Fed Chair Jerome Powell. The stock market rebound was led by strong earnings from 3M, gains in Tesla, Netfli…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-market-rallies-as-dow-jumps-810-points-sp-500-gains-109-points-nasdaq-surges-2-4-amid-tesla-rebound-trump-fed-tensions-and-defense-stock-losses/articleshow/120524245.cms",
    "timestamp": "2025-04-22T15:33:56Z"
  },
  {
    "title": "Tariff Layoff Tracker: Mack Trucks, Volvo Cut Hundreds Of Jobs As Trump’s Levies Pose ‘Market Uncertainty’",
    "description": "Some companies have announced layoffs while citing the market impact from President Donald Trump’s far-reaching tariffs.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/22/tariff-layoff-tracker-mack-trucks-volvo-cut-hundreds-of-jobs-as-trumps-levies-pose-market-uncertainty/",
    "timestamp": "2025-04-22T15:31:31Z"
  },
  {
    "title": "We’re suddenly talking about the Great Depression when discussing Trump’s stock market | CNN Business",
    "description": "Stocks are on the rebound Tuesday, bouncing back from another miserable day on Wall Street. But American financial markets are sounding all sorts of alarm bells that one day in the green can hardly overcome.",
    "link": "https://www.cnn.com/2025/04/22/investing/dow-great-depression-sell-america-trade/index.html",
    "timestamp": "2025-04-22T15:31:07Z"
  },
  {
    "title": "Linda McMahon Slams 'Worthless' College Degrees Amid Student Debt Change",
    "description": "The Trump admin said that starting May 5, the government will move 1.8 million borrowers into repayment and resume collections.",
    "link": "https://www.newsweek.com/linda-mcmahon-slams-worthless-college-degrees-amid-student-debt-change-2062618",
    "timestamp": "2025-04-22T15:30:56Z"
  },
  {
    "title": "The Endgame",
    "description": "People &amp; Power examines whether the forced transfer of Palestinians is Israel’s ultimate goal.",
    "link": "https://www.aljazeera.com/program/people-power/2025/4/22/the-endgame",
    "timestamp": "2025-04-22T15:30:00Z"
  },
  {
    "title": "As controversies pile up, Trump allies increasingly turn on one another",
    "description": "The infighting and backstabbing that plagued President Trump's first term have returned as a threat to his second, with deepening fissures over trade, national security and questions of personal loyalty.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_69499cac-0447-560f-9c3b-67857fdb6fe5.html",
    "timestamp": "2025-04-22T15:30:00Z"
  },
  {
    "title": "As controversies pile up, Trump allies increasingly turn on one another",
    "description": "The infighting and backstabbing that plagued President Trump's first term have returned as a threat to his second, with deepening fissures over trade, national security and questions of personal loyalty.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_9728d659-bfe8-587a-bb50-8d22c3fc00ba.html",
    "timestamp": "2025-04-22T15:30:00Z"
  },
  {
    "title": "'See How This Works?': Trump Drops Cases Against Corporations That Funded His Inauguration",
    "description": "An analysis released Monday in the wake of new Federal Election Commission filings shows that the Trump administration has dropped or paused federal enforcement cases against at least 17 corporations that donated to the president's inaugural fund, an indicati…",
    "link": "https://www.commondreams.org/news/trump-corporations-inauguration",
    "timestamp": "2025-04-22T15:25:56Z"
  },
  {
    "title": "Trump: Me, Netanyahu on same side of every issue",
    "description": "United States President Donald Trump noted after a Tuesday call with Israeli Prime Minister Benjamin Netanyahu that they are \"on the same side of every issue.\"\"I've just spoken to Prime Minister of Is...",
    "link": "https://biztoc.com/x/09ec0011c84944e2",
    "timestamp": "2025-04-22T15:25:07Z"
  },
  {
    "title": "Mahmoud Khalil’s wife gives birth after ICE denies Columbia activist’s plea for temporary release",
    "description": "Dr. Noor Abdalla said she gave birth to a baby boy Monday in New York.",
    "link": "https://www.bostonherald.com/2025/04/22/mahmoud-khalil-wife-gives-birth/",
    "timestamp": "2025-04-22T15:25:00Z"
  },
  {
    "title": "Swiss drugmaker Roche to invest $50bn in US in effort to dodge Trump tariffs",
    "description": "The Swiss drugmaker Roche has said it will put $50bn (£37bn) into manufacturing in the US over the next five years, joining the queue of companies unveiling investments to try to head off potentially punitive Donald Trump tariffs.\nRoche said on Tuesday the in…",
    "link": "https://biztoc.com/x/ab4b7d16c608c42e",
    "timestamp": "2025-04-22T15:24:39Z"
  },
  {
    "title": "Trump will revive penalties for student-loan borrowers who are behind on payments. Here's what to expect.",
    "description": "Trump is restarting collections on defaulted student-loan balances in two weeks. It could impact federal benefits, like Social Security, and wages.",
    "link": "https://www.businessinsider.com/trump-reinstating-penalties-default-student-loan-borrowers-treasury-offset-program-2025-4",
    "timestamp": "2025-04-22T15:24:20Z"
  },
  {
    "title": "Eyes Wide Shut: The Temptation of Blind Loyalty",
    "description": "Personal Perspective: Blind loyalty confers the benefits associated with belonging but carries the risks associated with blindness.",
    "link": "https://www.psychologytoday.com/us/blog/insight-therapy/202504/eyes-wide-shut-the-temptation-of-blind-loyalty",
    "timestamp": "2025-04-22T15:24:16Z"
  },
  {
    "title": "US/Zionism Versus Palestine: Gaza Is Today’s Auschwitz Holocaust Death Camp",
    "description": "Is a moral fissure once again dividing the planet to an extent perhaps not seen since the period leading up to World War II and the war itself? If not, is it safe to say Palestine has become the defining …\nThe post US/Zionism Versus Palestine: Gaza Is Today’s…",
    "link": "https://www.globalresearch.ca/us-zionism-versus-palestine/5885018",
    "timestamp": "2025-04-22T15:23:29Z"
  },
  {
    "title": "Rubio Announces Major State Dept Reorganization",
    "description": "The Trump administration is reorganizing the State Department to eliminate offices it considers redundant and cut some programs it says do not align with U.S. interests, Secretary of State Marco Rubio said Tuesday. \"This approach will empower the Department f…",
    "link": "https://freerepublic.com/focus/f-news/4312562/posts",
    "timestamp": "2025-04-22T15:23:23Z"
  },
  {
    "title": "Donald Trump's granddaughter Kai Trump accidentally reveals a secret during her live vlog",
    "description": "When you&apos;re Donald Trump&apos;s granddaughter and you&apos;re basically glued to your camera 24/7, things are bound to get interesting. But when that camera catches a little m",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/04/22/6807b3fd46163fd7548b4582.html",
    "timestamp": "2025-04-22T15:23:18Z"
  },
  {
    "title": "Trump revises his claims about tariff revenue, but he’s still wrong",
    "description": "How do we know that Donald Trump's claims about tariff revenue are false? Because of the evidence provided by his own administration.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-revises-claims-tariff-revenue-s-still-wrong-rcna202365",
    "timestamp": "2025-04-22T15:22:57Z"
  },
  {
    "title": "Pope Francis dies: What dignitaries will attend pontiff’s funeral",
    "description": "As plans continue to take shape, mourners from the faithful to world leaders are making travel arrangements to pay their respects to Pope Francis.",
    "link": "https://www.wsbtv.com/news/trending/pope-francis-dies-what-dignitaries-will-attend-pontiffs-funeral/C6GVTMA4K5C37N4O7OI4RXFCWY/",
    "timestamp": "2025-04-22T15:22:29Z"
  },
  {
    "title": "Influencer Hanna Cavinder tells Trump’s granddaughter Kai why she broke up with Miami QB Carson Beck",
    "description": "Hanna and her twin sister, Hailey, ran into Kai at a UFC event",
    "link": "https://www.the-independent.com/life-style/hanna-cavinder-twins-age-kai-trump-carson-beck-b2737399.html",
    "timestamp": "2025-04-22T15:22:29Z"
  },
  {
    "title": "Gold soars to a new high as economic uncertainty deepens. Here’s what to know",
    "description": "NEW YORK (AP) — As economic uncertainty deepens worldwide, gold prices have notched more and more record highs. That’s because gold sales can rise sharply when anxious investors seek “safe havens” for parking their money. Gold’s current rally arrives as U.S. …",
    "link": "https://financialpost.com/pmn/gold-soars-to-a-new-high-as-economic-uncertainty-deepens-heres-what-to-know",
    "timestamp": "2025-04-22T15:21:54Z"
  },
  {
    "title": "'American version of Adolf Hitler': Major Jewish newspaper makes stark Trump comparison",
    "description": "A historically Jewish newspaper compared President Donald Trump's tactics to a scheme used by Germany's Adolf Hitler before World War II.In an op-ed for Forward this week, author Terrence Petty likened Trump's demonization of his self-declared enemies to Hitl…",
    "link": "https://www.rawstory.com/donald-trump-dolchstosslegende/",
    "timestamp": "2025-04-22T15:21:50Z"
  },
  {
    "title": "Hegseth lashes out at alleged Pentagon leakers he claims want to 'sabotage' Trump",
    "description": "Defense Secretary Pete Hegseth strongly denied sharing classified information on Signal and lashed out at former aides he claimed want to \"sabotage\" Trump's agenda.",
    "link": "https://abcnews.go.com/Politics/hegseth-lashes-alleged-pentagon-leakers-claims-sabotage-trumps/story?id=121044112",
    "timestamp": "2025-04-22T15:20:01Z"
  },
  {
    "title": "Trump: 'I spoke with Netanyahu, we're on same side of every issue'",
    "description": "US President says he and Israel's PM are in alignment on every issue they discussed in their most recent call, including trade and Iran.",
    "link": "https://www.israelnationalnews.com/news/407226",
    "timestamp": "2025-04-22T15:20:00Z"
  },
  {
    "title": "The Political Activities of Demons. Part 1: Fake News and Fake Science",
    "description": "Demons are at play on this world causing hardship and distress to other souls via lies and deceptions. Orchestrated wars, orchestrated pandemics, and the falsehood that CO2 is killing the planet are part of the demonic script. \nWrong Directions\n…\nThe post The…",
    "link": "https://www.globalresearch.ca/political-activities-demons-part-1-fake-news-fake-science/5885029",
    "timestamp": "2025-04-22T15:19:06Z"
  },
  {
    "title": "Pete Hegseth’s ‘Bawdy’ Top Lieutenant Reportedly Derailed Veterans Group Meeting With Strip Club Story",
    "description": "Jaffe and Cooper also detailed moments of frustration from the White House at Hegseth’s inability to push through Trump's agenda items.\nThe post Pete Hegseth’s ‘Bawdy’ Top Lieutenant Reportedly Derailed Veterans Group Meeting With Strip Club Story first appea…",
    "link": "https://www.mediaite.com/news/pete-hegseths-bawdy-top-lieutenant-reportedly-derailed-veterans-group-meeting-with-strip-club-story/",
    "timestamp": "2025-04-22T15:19:01Z"
  },
  {
    "title": "How Canada’s Trump-Style Candidate Blew a 20-Point Polling Lead",
    "description": "Pierre Poilievre, leader of Canada’s Conservative Party, seemed set to become Canada’s next prime minister at the start of 2025. For more than a year, his party had a 20-point lead in opinion polls over then-Prime Minister Justin Trudeau’s Liberal Party and m…",
    "link": "https://freerepublic.com/focus/f-news/4312560/posts",
    "timestamp": "2025-04-22T15:17:20Z"
  },
  {
    "title": "The EPA cracked down on Tesla and SpaceX. Then Elon Musk and DOGE took over.",
    "description": "Elon Musk runs companies that make electric vehicles and solar panels, things that are supposed to reduce pollution and fight climate change. But over the years, Muskâ\u0080\u0099s companies have faced repeated accusations by regulators including the Environmental Prot…",
    "link": "https://www.theverge.com/environment/652767/elon-musk-trump-tesla-spacex-epa-enforcement",
    "timestamp": "2025-04-22T15:15:57Z"
  },
  {
    "title": "GE Aerospace CEO Culp advocates tariff-free regime for aviation industry",
    "description": "CHICAGO (Reuters) -GE Aerospace CEO Larry Culp said on Tuesday he advocated re-establishing a tariff-free regime for the aerospace industry under the 1979...",
    "link": "https://finance.yahoo.com/news/ge-aerospace-ceo-culp-advocates-151556747.html",
    "timestamp": "2025-04-22T15:15:56Z"
  },
  {
    "title": "Republicans troll Dems' El Salvador visits with offer to foot travel bill – in exchange for one thing",
    "description": "Republican elections groups are seizing on Democrats' recent trips to El Salvador ahead of the 2026 midterms.",
    "link": "https://www.foxnews.com/politics/republicans-troll-dems-el-salvador-visits-offer-foot-travel-bill-exchange-one-thing",
    "timestamp": "2025-04-22T15:15:36Z"
  },
  {
    "title": "More Democratic lawmakers visit El Salvador to see Abrego Garcia, wrongly deported by Trump administration",
    "description": "While administration officials have acknowledged that the decision to deport Abrego Garcia was done in error, they have said they have no power to return him to the country despite a Supreme Court ruling calling on the government to do so.",
    "link": "https://www.pbs.org/newshour/politics/more-democratic-lawmakers-visit-el-salvador-to-see-abrego-garcia-wrongly-deported-by-trump-administration",
    "timestamp": "2025-04-22T15:15:24Z"
  },
  {
    "title": "Rosie O’Donnell Tells CNN It’s ‘Heartbreaking’ Watching Trump ‘Destroy the Country’ From Her New Home of Ireland",
    "description": "Rosie O'Donnell told CNN it's \"heartbreaking\" watching Trump \"destroy the country\" from her new home of Ireland where she fled days before his inauguration.\nThe post Rosie O’Donnell Tells CNN It’s ‘Heartbreaking’ Watching Trump ‘Destroy the Country’ From Her …",
    "link": "https://www.mediaite.com/tv/rosie-odonnell-tells-cnn-its-heartbreaking-watching-trump-destroy-the-country-from-her-new-home-of-ireland/",
    "timestamp": "2025-04-22T15:14:08Z"
  },
  {
    "title": "Pope Francis Funeral: Date, time, place, who are attending?",
    "description": "President Donald Trump along with First Lady Melania Trump will attend the funeral.",
    "link": "https://economictimes.indiatimes.com/news/international/us/pope-francis-funeral-date-time-place-who-are-attending/articleshow/120524031.cms",
    "timestamp": "2025-04-22T15:10:21Z"
  },
  {
    "title": "After Hammering NATO allies, JD Vance Hails India as the Future",
    "description": "Vance said it \"could be a very dark time for all of humanity\" if the U.S. and India don't work together succesfully",
    "link": "https://www.newsweek.com/vance-modi-india-europe-nato-2062574",
    "timestamp": "2025-04-22T15:10:11Z"
  },
  {
    "title": "M&A Activity Remains Quiet Amid Uncertainty About New Administration",
    "description": "The mergers and acquisitions (M&A) market has reportedly remained quiet so far this year as potential dealmakers try to get a sense of the Trump Administration’s stance on antitrust regulation. Year to date, through April 21, the number of deals is down 19%, …",
    "link": "https://www.pymnts.com/antitrust/2025/ma-activity-remains-quiet-amid-uncertainty-about-new-administration/",
    "timestamp": "2025-04-22T15:09:31Z"
  },
  {
    "title": "Trump Ally Byron Donalds Confronted at Town Hall With Story About Racist Trump Fan",
    "description": "Rep. Byron Donalds (R-FL) was confronted at a town hall by a constituent who claimed a racist Trump fan told him he wouldn't vote for Donalds because he's Black\nThe post Trump Ally Byron Donalds Confronted at Town Hall With Story About Racist Trump Fan first …",
    "link": "https://www.mediaite.com/news/trump-ally-byron-donalds-confronted-at-town-hall-with-story-about-racist-trump-fan/",
    "timestamp": "2025-04-22T15:09:23Z"
  },
  {
    "title": "Democrats' identity crisis: Youth revolt rocks party after Trump comeback",
    "description": "We don’t know what the political real estate market will look like in 2026, but Democrats now occupy a remote, unfamiliar province and are trying to map and navigate this alien territory.",
    "link": "https://www.foxnews.com/politics/democrats-identity-crisis-youth-revolt-rocks-party-after-trump-comeback",
    "timestamp": "2025-04-22T15:09:05Z"
  },
  {
    "title": "‘A new era’: IMF slashes global growth forecast",
    "description": "Projected output was cut for Germany, France, Italy, and the overall euro area – but Spain's forecast was revised upwards.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/a-new-era-imf-slashes-global-growth-forecast/",
    "timestamp": "2025-04-22T15:08:35Z"
  },
  {
    "title": "PAUL GOTTFRIED: The Antidiscrimination Regime",
    "description": "“The terms of this debate have now changed. The president has ensured that the civil-rights regime will no longer be a one-way lever.”",
    "link": "https://dailycaller.com/2025/04/22/paul-gottfried-antidiscrimination-regime-dei-trump/",
    "timestamp": "2025-04-22T15:08:14Z"
  },
  {
    "title": "Former Vice US President Al Gore compares Trump administration to Nazi Germany",
    "description": "Former Vice President Al Gore, harshly criticized the Trump administration and compared it to Nazi Germany",
    "link": "https://www.israelnationalnews.com/news/407225",
    "timestamp": "2025-04-22T15:08:13Z"
  },
  {
    "title": "Why, Yes, Megyn Kelly Will Kick a Dead Pope",
    "description": "As you're no doubt aware, Pope Francis decided living kind of sucks, actually, after spending a few moments with JD Vance. And they may sound like a snarky exaggeration, but it's literally what happened. After rebuffing Vance earlier in the...\nRead more...",
    "link": "https://www.pajiba.com/news/why-yes-megyn-kelly-will-kick-a-dead-pope.php",
    "timestamp": "2025-04-22T15:07:35Z"
  },
  {
    "title": "Jeffree Star Seems to Confirm Kanye West Affair In Cryptic Post",
    "description": "Reading Time: 3 minutesInfluencer Jeffree Star has made some interesting comments about his history with Kanye West.\nJeffree Star Seems to Confirm Kanye West Affair In Cryptic Post was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/04/jeffree-star-seems-to-confirm-kanye-west-affair-in-cryptic-post/",
    "timestamp": "2025-04-22T15:06:16Z"
  },
  {
    "title": "Trump tariffs: US forecast to be hit hardest of major economies",
    "description": "The US suffers the biggest downgrade to growth among advanced economies, in the influential International Monetary Fund's latest forecast.",
    "link": "https://www.bbc.co.uk/news/articles/czx415erwkwo",
    "timestamp": "2025-04-22T15:05:57Z"
  },
  {
    "title": "Gold's record run gains further traction; market conquers $3,500/oz",
    "description": "(Reuters) -Gold's remarkable run higher is reaching new heights, with the market touching $3,500 per ounce as confidence in the U.S. economy further erodes...",
    "link": "https://finance.yahoo.com/news/golds-record-run-gains-further-150546510.html",
    "timestamp": "2025-04-22T15:05:46Z"
  },
  {
    "title": "India Follows Vietnam in Imposing Steel Tariffs on China",
    "description": "The Finance Ministry of India announced on Monday that it would be imposing a 12 percent tariff on some steel products — a move apparently intended to prevent China from \"dumping\" large amounts of steel into the Indian market and elbowing domestic companies o…",
    "link": "https://www.breitbart.com/asia/2025/04/22/india-follows-vietnam-in-imposing-steel-tariffs-on-china/",
    "timestamp": "2025-04-22T15:05:29Z"
  },
  {
    "title": "On Misdiagnosing Trump",
    "description": "Sherrilyn Ifill on those who got it wrong about Trump and the Republicans:\n\nIf you have a public platform & spent years calming ev",
    "link": "https://kottke.org/25/04/on-misdiagnosing-trump",
    "timestamp": "2025-04-22T15:02:56Z"
  },
  {
    "title": "Trump admin. to reorganize State Department, cut redundant programs",
    "description": "“This approach will empower the Department from the ground up, from the bureaus to the embassies,” Rubio said.",
    "link": "https://www.jpost.com/international/article-851096",
    "timestamp": "2025-04-22T15:02:50Z"
  },
  {
    "title": "Skeletons are found beneath college campus, plus a man is 'disgusted' by girlfriend's food tastes",
    "description": "The Fox News Lifestyle Newsletter brings you trending stories on family, travel, food, neighbors helping neighbors, pets, autos, military veterans, heroes, faith and American values.",
    "link": "https://www.foxnews.com/lifestyle/skeletons-found-beneath-college-campus-plus-man-disgusted-girlfriends-food-tastes",
    "timestamp": "2025-04-22T15:02:32Z"
  },
  {
    "title": "Kristi Noem's TV Ad Calling to 'Hunt' Down Migrants Faces Ban",
    "description": "Mexico's President Claudia Sheinbaum labeled the ad \"discriminatory\" and promised to propose legislation that would ban it.",
    "link": "https://www.newsweek.com/kristi-noem-tv-ad-hunt-migrants-ban-2062552",
    "timestamp": "2025-04-22T15:02:06Z"
  },
  {
    "title": "EXCLUSIVE: GOP Lawmakers Showcase How Trump ‘Restored Law and Order’ to US Borders",
    "description": "FIRST ON THE DAILY SIGNAL—The House Homeland Security Committee released its latest “Border Brief” Tuesday, highlighting significant changes at the border since President Donald Trump... Read More\nThe post EXCLUSIVE: GOP Lawmakers Showcase How Trump ‘Restored…",
    "link": "https://www.dailysignal.com/2025/04/22/exclusive-gop-lawmakers-showcase-how-trump-restored-law-and-order-to-us-borders/",
    "timestamp": "2025-04-22T15:00:57Z"
  },
  {
    "title": "Tucker Carlson: The Fastest Way To Derail Trump And America Would Be To Start A War With Iran",
    "description": "Tucker Carlson said during his podcast this week: \r\n\r\nTUCKER CARLSON: I'm not involved at all, I'm just watching, but it seems like the fastest way to derail the whole project—the Trump administration and the United States of America—is a war with Iran. \r\n\r\nT…",
    "link": "https://www.realclearpolitics.com/video/2025/04/22/tucker_carlson_the_fastest_way_to_derail_trump_and_america_would_be_to_start_a_war_with_iran.html",
    "timestamp": "2025-04-22T15:00:49Z"
  },
  {
    "title": "Some GOP states are targeting driver’s licenses issued to immigrants illegally in the US",
    "description": "A growing number of Republican-led states are taking aim at driver's licenses issued by other states to people in the U.S. illegally.",
    "link": "https://www.bostonherald.com/2025/04/22/illegal-immigrants-drivers-licenses/",
    "timestamp": "2025-04-22T14:59:40Z"
  },
  {
    "title": "Should Abrego Garcia Be Punished for Someone Else’s Crimes?",
    "description": "Team Trump is playing a phony game of whataboutism in pointing to egregious crimes committed by immigrants to deny due process to Kilmar Abrego Garcia and others and to demonize his defenders like Chris Van Hollen.",
    "link": "http://nymag.com/intelligencer/article/should-abrego-garcia-be-punished-for-someone-elses-crimes.html",
    "timestamp": "2025-04-22T14:58:41Z"
  },
  {
    "title": "Death of Pope Francis latest updates: Ireland’s representatives at funeral are confirmed",
    "description": "Tributes paid to late pontiff who died of a stroke and heart failure",
    "link": "https://www.irishtimes.com/ireland/social-affairs/2025/04/22/death-of-pope-francis-live-updates/",
    "timestamp": "2025-04-22T14:58:11Z"
  },
  {
    "title": "‘Total chaos’? Watch Pete Hegseth respond to former staffer who publicly slammed him",
    "description": "'We did right by him and tried to help, he's spinning it otherwise'",
    "link": "https://www.wnd.com/2025/04/total-chaos-watch-pete-hegseth-respond-to-former-staffer-who-publicly-slammed-him/",
    "timestamp": "2025-04-22T14:57:48Z"
  },
  {
    "title": "EXCLUSIVE: Fox tours ICE detention facility; manager hopes to 'dispel' 'false narratives'",
    "description": "Fox News took an exclusive, rare tour of the Montgomery Processing Center in Conroe, Texas — one of ICE's 134 detention facilities across the country.",
    "link": "https://www.foxnews.com/us/exclusive-fox-tours-ice-detention-facility-manager-hopes-dispel-false-narratives",
    "timestamp": "2025-04-22T14:57:46Z"
  },
  {
    "title": "In Uncertain Times, the Port of Oakland Goes Electric",
    "description": "The Port of Oakland currently handles ships carrying 4,000 containers, but these are fast being superseded by bigger vessels (up to 13,000 containers) that need more power while in port. (Photo by Karl Nielsen / Knee Deep Times)\r\n\n\n \n\n\n\n\n\n\nThis story was orig…",
    "link": "https://nextcity.org/urbanist-news/in-uncertain-times-the-port-of-oakland-goes-electric",
    "timestamp": "2025-04-22T14:57:00Z"
  },
  {
    "title": "Larry David mocks Bill Maher's dinner with Trump in an op-ed for The New York Times",
    "description": "“Curb Your Enthusiasm” star Larry David skewered comedian Bill Maher’s recent meal with President Donald Trump in a satirical essay in The New York Times this week.",
    "link": "https://www.nbcnews.com/news/us-news/larry-david-mocks-bill-mahers-dinner-trump-op-ed-new-york-rcna202332",
    "timestamp": "2025-04-22T14:55:08Z"
  },
  {
    "title": "White House claims entire Pentagon working against secretary of defense",
    "description": "Pete Hegseth has been accused of mishandling classified information tied to the bombing of Yemen Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616103-pentagon-opposes-hegseth-leavitt/",
    "timestamp": "2025-04-22T14:54:09Z"
  },
  {
    "title": "Megyn Kelly Dumps On Pope Francis Shortly After His Death",
    "description": "The right-wing commentator found a way to criticize the pontiff and elevate Trump at the same time.",
    "link": "https://www.huffpost.com/entry/megyn-kelly-pope-francis-immigration_n_68077a7ae4b00edf27f4c02a",
    "timestamp": "2025-04-22T14:53:29Z"
  },
  {
    "title": "Gold passes $3,500 amid Trump turmoil",
    "description": "Gold  extended its record run on Tuesday, breaching $3,500 per ounce, as weakness in the dollar, US President  Donald Trump &rsquo;s attacks on the Federal Reserve and  trade war  fears spurred demand for the safe-haven asset.",
    "link": "https://www.bangkokpost.com/business/general/3008816/gold-passes-3-500-amid-trump-turmoil",
    "timestamp": "2025-04-22T14:53:00Z"
  },
  {
    "title": "Gold passes $3,500 amid Trump turmoil",
    "description": "Gold  extended its record run on Tuesday, breaching $3,500 per ounce, as weakness in the dollar, US President  Donald Trump &rsquo;s attacks on the Federal Reserve and  trade war  fears spurred demand for the safe-haven asset.",
    "link": "https://www.bangkokpost.com/business/investment/3008816/gold-passes-3-500-amid-trump-turmoil",
    "timestamp": "2025-04-22T14:53:00Z"
  },
  {
    "title": "Most Americans Would Fail a Test on Gun Law Knowledge",
    "description": "Since taking office, President Donald Trump has issued a series of executive orders seeking to address numerous perceived issues he feels are important. But many people worry that his executive order issuing will have incredibly harmful effects in relation to…",
    "link": "https://biztoc.com/x/734a7d485e211fa9",
    "timestamp": "2025-04-22T14:51:47Z"
  },
  {
    "title": "European Central Bank’s Lagarde says she hopes Trump doesn't fire Fed's Powell",
    "description": "European Central Bank President Christine Lagarde on Tuesday said she hoped that the prospect of U.S. President Donald Trump firing Federal Reserve Chair Jerome Powell was not on the table.\nAsked by CNBC's Sara Eisen if that scenario was a current material ri…",
    "link": "https://biztoc.com/x/f201d2610adc4ba8",
    "timestamp": "2025-04-22T14:51:31Z"
  },
  {
    "title": "Major changes await as Trump administration plans bold move to restructure State department",
    "description": "The Trump administration is undertaking a reorganization of the State Department. This move aims to eliminate redundant offices and cut programs. Secretary of State Marco Rubio stated that these programs do not align with U.S. interests. Region-specific funct…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/major-changes-await-as-trump-administration-plans-bold-move-to-restructure-state-department/articleshow/120523777.cms",
    "timestamp": "2025-04-22T14:51:30Z"
  },
  {
    "title": "US Envoy To Visit Moscow As US Pushes For Ceasefire",
    "description": "US envoy Steve Witkoff is expected to visit Russia this week, a Kremlin aide said Tuesday, as US President Donald Trump seeks a speedy deal to end the three-year Ukraine conflict.",
    "link": "https://www.ibtimes.com.au/us-envoy-visit-moscow-us-pushes-ceasefire-1858120",
    "timestamp": "2025-04-22T14:51:18Z"
  },
  {
    "title": "‘Highly Structured Terrorist Organization’: Trump Admin Lands Major Blow Against Tren De Aragua",
    "description": "The Trump administration charged and arrested numerous members of Tren de Aragua and a splinter group that has allegedly established its own criminal enterprise within the United States. Federal authorities charged more than two dozen individuals currently or…",
    "link": "https://dailycaller.com/2025/04/22/trump-lands-blow-against-tren-de-aragua/",
    "timestamp": "2025-04-22T14:50:40Z"
  },
  {
    "title": "IBM Earnings On Deck. AI Push, 'Safe-Haven' Status, DOGE Cuts In Focus.",
    "description": "IBM stock was gaining in trades ahead of its Q1 report. Some analysts expect the tech giant's shares will be seen as a \"safe haven.\"",
    "link": "https://www.investors.com/news/technology/ibm-stock-q1-2025-earnings-tariffs-ai-doge/",
    "timestamp": "2025-04-22T14:48:05Z"
  },
  {
    "title": "‘Allow Me To Educate’: Byron Donalds Goes Toe-To-Toe With Anti-DOGE Protesters During Contentious Town Hall",
    "description": "Byron Donalds faced constant interruptions from a raucous crowd in Estero, where a town hall meant to address reforms was derailed by protests over DOGE.",
    "link": "https://dailycaller.com/2025/04/22/byron-donalds-florida-doge-elon-musk-social-security-town-hall-florida/",
    "timestamp": "2025-04-22T14:47:06Z"
  },
  {
    "title": "Trump’s Trade War Should Target China’s Forced Labor",
    "description": "Coerced Uyghur workers are still part of the export chain.",
    "link": "http://foreignpolicy.com/2025/04/22/china-forced-labor-uyghur/",
    "timestamp": "2025-04-22T14:45:22Z"
  }
]