[
  {
    "title": "A ceasefire for now",
    "description": "Row over B-2 bombing of Iranian N-sites",
    "link": "https://www.thehindubusinessline.com/opinion/a-ceasefire-for-now/article69737137.ece",
    "timestamp": "2025-06-25T15:45:35Z"
  },
  {
    "title": "‘Ironheart’ Episode 1 Recap: Suit Yourself",
    "description": "Ironheart has something going for it that other Marvel shows don’t.",
    "link": "https://decider.com/2025/06/25/ironheart-episode-1-recap/",
    "timestamp": "2025-06-25T15:45:00Z"
  },
  {
    "title": "Trump Has Tender Exchange With Ukrainian Reporter During Tense NATO Presser: ‘Say Hello to Your Husband’",
    "description": "President Donald Trump showed his tender side as he fielded a question from a Ukrainian reporter whose husband remains in the war-torn country.\nThe post Trump Has Tender Exchange With Ukrainian Reporter During Tense NATO Presser: ‘Say Hello to Your Husband’ f…",
    "link": "https://www.mediaite.com/media/news/trump-has-tender-exchange-with-ukrainian-reporter-during-tense-nato-presser-say-hello-to-your-husband/",
    "timestamp": "2025-06-25T15:44:48Z"
  },
  {
    "title": "Trump threatens tough trade deal for Spain after it refuses to meet NATO defense spending target",
    "description": "\"We're negotiating with Spain on a trade deal and we're going to make them pay twice as much,\" Trump said after the country refused to meet the spending target.",
    "link": "https://www.cnbc.com/2025/06/25/trump-vows-to-make-spain-pay-for-avoiding-new-nato-spending-target.html",
    "timestamp": "2025-06-25T15:44:34Z"
  },
  {
    "title": "Border czar Tom Homan reveals he's been living apart from his wife due to death threats: NYP",
    "description": "Border Czar Tom Homan said in an interview Wednesday that he's been living apart from his wife due to the \"outrageous\" amount of death threats he and his family have received.",
    "link": "https://www.foxnews.com/media/border-czar-tom-homan-says-hes-been-living-apart-from-his-wife-due-death-threats-nyp",
    "timestamp": "2025-06-25T15:43:44Z"
  },
  {
    "title": "‘Ukraine can win’ – new NATO commander",
    "description": "Alexus Grynkewich has said Kiev is fighting with tenacity the US can barely imagine Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620525-nato-commander-ukraine-victory/",
    "timestamp": "2025-06-25T15:43:39Z"
  },
  {
    "title": "Call him Daddy: NATO chief's comments betray reality of military alliance's take on Trump",
    "description": "Arguably few things better demonstrate NATO bending over backward to please President Donald Trump than this remark by the military alliance's secretary-general, Mark Rutte.",
    "link": "https://www.nbcnews.com/world/europe/trump-nato-europe-rutte-defense-rcna214940",
    "timestamp": "2025-06-25T15:43:34Z"
  },
  {
    "title": "Pushing War Powers Resolution, Khanna Say Democrats Must Become 'Anti-War Party'",
    "description": "Democratic Rep. Ro Khanna of California on Wednesday urged Congress take up the Iran-focused War Powers Resolution that he and a Republican colleague have introduced and said that Democrats should stake out a position as the \"anti-war party.\"Khanna and Rep. T…",
    "link": "https://www.commondreams.org/news/khanna-democrats-anti-war-war-powers-resolution",
    "timestamp": "2025-06-25T15:42:35Z"
  },
  {
    "title": "California found in violation of Title IX in clash with Trump officials over transgender athletes",
    "description": "The Trump administration has found that the California Department of Education and the state’s high school sports federation violated civil rights law by allowing transgender girls to compete on girls sports teams",
    "link": "https://abcnews.go.com/US/wireStory/california-found-violation-title-ix-clash-trump-officials-123197086",
    "timestamp": "2025-06-25T15:42:27Z"
  },
  {
    "title": "Trump judicial nominee Bove faces questions as whistleblower claims he floated ignoring court orders",
    "description": "Bove has been behind some of the DOJ's most contentious actions since January.",
    "link": "https://www.bostonherald.com/2025/06/25/trump-judges-bove/",
    "timestamp": "2025-06-25T15:41:43Z"
  },
  {
    "title": "Trump considers 'three or four' successors to 'stupid' Powell",
    "description": "Donald Trump has revived his criticism of the head of the US central bank, describing Jay Powell as \"terrible\" and \"stupid\", adding that there were up to four candidates to succeed him.",
    "link": "https://news.sky.com/story/trump-considers-three-or-four-successors-to-stupid-powell-13388554",
    "timestamp": "2025-06-25T15:41:00Z"
  },
  {
    "title": "Trump Humiliates CNN’s Kaitlan Collins on Live TV — Shreds “Fake News” Question on Iran Strike",
    "description": "President Donald Trump publicly humiliated CNN’s Kaitlan Collins during a live press event at the NATO summit in The Hague.\nThe post Trump Humiliates CNN’s Kaitlan Collins on Live TV — Shreds “Fake News” Question on Iran Strike appeared first on The Gateway P…",
    "link": "https://www.thegatewaypundit.com/2025/06/trump-humiliates-cnns-kaitlan-collins-live-tv-shreds/",
    "timestamp": "2025-06-25T15:40:59Z"
  },
  {
    "title": "Questions on the Fordo Strike (Wonky)",
    "description": "I have a number of questions about the overhead photos of the bombing at Fordo. I haven’t done a detailed photo analysis like this in a long time – probably back to the photos of what turned out to be a Syrian reactor under construction in 2007. And I’m not u…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/questions-on-the-fordo-strike-wonky",
    "timestamp": "2025-06-25T15:40:45Z"
  },
  {
    "title": "Trump Administration to Meet With Iran Following Successful U.S. Strike",
    "description": "President Donald Trump said he would soon meet with Iran following the United States’ successful strike on the nation’s nuclear enrichment facilities. Because Iran’s nuclear... Read More\nThe post Trump Administration to Meet With Iran Following Successful U.S…",
    "link": "https://www.dailysignal.com/2025/06/25/trump-administration-meet-iran-following-successful-u-s-strike/",
    "timestamp": "2025-06-25T15:40:36Z"
  },
  {
    "title": "NBC Reporter Kelly O’Donnell Calls BS on Trump Live During Global Presser",
    "description": "Kelly O'Donnell called BS on Trump during a global press conference when he accused the press of demeaning the military by reporting on an intelligence leak.\nThe post NBC Reporter Kelly O’Donnell Calls BS on Trump Live During Global Presser first appeared on …",
    "link": "https://www.mediaite.com/media/news/nbc-reporter-kelly-odonnell-calls-bs-on-trump-live-during-global-presser/",
    "timestamp": "2025-06-25T15:40:35Z"
  },
  {
    "title": "Trump fumes over U.S. intelligence report on Iran strikes at NATO presser",
    "description": "Trump ordered U.S. strikes on Iranian nuclear sites as part of its support for Israel, then days later announced a ceasefire agreement between the countries.",
    "link": "https://www.cnbc.com/2025/06/25/trump-iran-intelligence-report-nato.html",
    "timestamp": "2025-06-25T15:40:29Z"
  },
  {
    "title": "Trump's Comparison of Iran Strikes to Hiroshima and Nagasaki Called Out for One Thing: 'Didn't Iran Bomb Israel After?'",
    "description": "President Donald Trump seemingly compared his strikes on Iranian nuclear sites to the nuclear bomb dropped on Hiroshima and Nagasaki during World War II.",
    "link": "https://www.ibtimes.com/trumps-comparison-iran-strikes-hiroshima-nagasaki-called-out-one-thing-didnt-iran-bomb-3776795",
    "timestamp": "2025-06-25T15:40:16Z"
  },
  {
    "title": "4 things Wharton's Jeremy Siegel sees propelling the stock market past record highs",
    "description": "Jeremy Siegel thinks the S&P 500 reaching more all-time-highs is a \"foregone conclusion.\" Stocks have resumed their rally after the Israel-Iran ceasfire.",
    "link": "https://www.businessinsider.com/stock-market-outlook-sp500-record-highs-jeremy-siegel-interest-rates-2025-6",
    "timestamp": "2025-06-25T15:39:49Z"
  },
  {
    "title": "Could 'Alligator Alcatraz' Airport Launch Deportation Flights? What We Know",
    "description": "\"This is an existing airstrip that is already built and paved,\" the office of Florida Governor Ron DeSantis told Newsweek.",
    "link": "https://www.newsweek.com/florida-alligator-alcatraz-mass-deportation-2090598",
    "timestamp": "2025-06-25T15:39:24Z"
  },
  {
    "title": "Trump's arctic ambitions extend beyond Greenland. He's also looking to buy icebreakers.",
    "description": "Trump said during a press conference at the NATO summit in the Netherlands that he is negotiating with Finland to buy 15 icebreaker ships.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/25/donald-trump-greenland-finland-arctic-icebreakers-vance-denmark/84351306007/",
    "timestamp": "2025-06-25T15:39:16Z"
  },
  {
    "title": "NYC mayoral candidate Zahron Mamdani vows to ‘expand and protect’ trans healthcare",
    "description": "The Democratic Party candidate for mayor of New York City has vowed to protect trans healthcare in the Big Apple. Zohran Mamdani sent shockwaves through the establishment when he beat political veteran Andrew Cuomo in the Democratic Party primary on Tuesday n…",
    "link": "https://www.thepinknews.com/2025/06/25/zahron-mamdani-trans-healthcare-election/",
    "timestamp": "2025-06-25T15:39:05Z"
  },
  {
    "title": "US home mortgage regulator considers Bitcoin amid housing crisis",
    "description": "Crypto-collateralized mortgages may soon be possible in the US as the head of the FHFA says that his agency is studying the issue.",
    "link": "https://cointelegraph.com/news/us-home-mortgage-regulator-bitcoin-amid-housing-crisis",
    "timestamp": "2025-06-25T15:38:57Z"
  },
  {
    "title": "Trump says he is considering three or four candidates for next Fed chair",
    "description": "THE HAGUE (Reuters) -President Donald Trump called Federal Reserve Chair Jerome Powell \"terrible\" and said he knows three or four people who are contenders...",
    "link": "https://ca.finance.yahoo.com/news/trump-says-considering-three-four-153853835.html",
    "timestamp": "2025-06-25T15:38:53Z"
  },
  {
    "title": "Lara Trump Launches New Music Business",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nLara Trump has launched a new business, Newsweek can reveal.\nAccording to business registration documents filed in Florida, Lara Trump, who is married to one of Donald Trump's sons, Eric Trump, incorporated LT…",
    "link": "https://biztoc.com/x/9e937e7949f9bc14",
    "timestamp": "2025-06-25T15:37:41Z"
  },
  {
    "title": "HHS faces new accusations of presenting nonexistent research, adding to alarming pattern",
    "description": "Many people here and around the world need to be able to rely on HHS for accurate information. That’s becoming increasingly difficult.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/hhs-faces-new-accusations-presenting-nonexistent-research-adding-alarm-rcna215009",
    "timestamp": "2025-06-25T15:37:28Z"
  },
  {
    "title": "Europe closes lower amid geopolitical events",
    "description": "Major European stock exchanges traded with losses on Wednesday as investors remained on guard regarding the Israel-Iran ceasefire. While United States President Donald Trump expressed belief that the ...",
    "link": "https://biztoc.com/x/b8e7f0ab43c24137",
    "timestamp": "2025-06-25T15:37:27Z"
  },
  {
    "title": "Trump Threatens Tariffs On Spain Over NATO Spending Shortfall",
    "description": "President Donald Trump on Tuesday said he plans to impose increased tariffs on Spain, accusing the country of failing to meet a new 5% defense spending target agreed upon by other NATO allies.\nSpeaking at the NATO summit, Trump called Spain’s position “terrib…",
    "link": "https://biztoc.com/x/1a377499924b76c1",
    "timestamp": "2025-06-25T15:37:11Z"
  },
  {
    "title": "Hours after Netanyahu spoke of a historic victory over Iran, Israel was hit by a painful reminder",
    "description": "Death of seven Israeli soldiers in Khan Younis leads key ally of prime minister to question war in Gaza",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/25/hours-after-netanyahu-spoke-of-a-historic-victory-over-iran-israel-was-hit-by-a-painful-reminder/",
    "timestamp": "2025-06-25T15:37:01Z"
  },
  {
    "title": "Mapping Israel’s expanding battlefronts across the Middle East",
    "description": "Israel has launched nearly 35,000 attacks across five countries over the past 20 months.",
    "link": "https://www.aljazeera.com/news/2025/6/25/mapping-israels-expanding-battlefronts-across-the-middle-east",
    "timestamp": "2025-06-25T15:36:48Z"
  },
  {
    "title": "Kilmar Abrego Garcia is expected to be released from jail only to be taken into immigration custody",
    "description": "The Salvadoran national whose mistaken deportation became a flashpoint in the fight over President Donald Trump's immigration policies has been in jail since he was returned to the U.S. on June 7. He faces two counts of human smuggling in Tennessee.",
    "link": "https://www.pbs.org/newshour/politics/kilmar-abrego-garcia-is-expected-to-be-released-from-jail-only-to-be-taken-into-immigration-custody",
    "timestamp": "2025-06-25T15:36:39Z"
  },
  {
    "title": "Lara Trump Launches New Music Business",
    "description": "Donald Trump's daughter-in-law incorporated a new business in April, business filings show.",
    "link": "https://www.newsweek.com/lara-trump-new-music-business-2090445",
    "timestamp": "2025-06-25T15:36:28Z"
  },
  {
    "title": "7 Israeli troops killed in Gaza bombing as Palestinian officials say Israeli attacks kill 79",
    "description": "Israel says 860 soldiers have been killed throughout the war. The health officials in the strip say the overall Palestinian death toll in Gaza has passed 56,000.",
    "link": "https://www.pbs.org/newshour/world/7-israeli-troops-killed-in-gaza-bombing-as-palestinian-officials-say-israeli-attacks-kill-79",
    "timestamp": "2025-06-25T15:36:03Z"
  },
  {
    "title": "FBI launches criminal probes into 3 children's hospitals over child sex changes: Report",
    "description": "The medical advocacy group Do No Harm has in recent years worked with health care professionals, hospital administrators, patients, and policymakers to combat DEI-branded racism and gender ideology in the field of medicine.In order to better tackle the second…",
    "link": "https://www.theblaze.com/news/fbi-reportedly-launches-criminal-probes-into-3-childrens-hospitals-over-child-sex-changes",
    "timestamp": "2025-06-25T15:35:00Z"
  },
  {
    "title": "Trump: We want to buy icebreakers from Finland",
    "description": "Donald Trump said Finnish president Alexander Stubb is a good golfer, and that the US wants to buy icebreakers from Finland.",
    "link": "https://yle.fi/a/74-20169564",
    "timestamp": "2025-06-25T15:34:51Z"
  },
  {
    "title": "A fragile ceasefire between Iran and Israel gives hope for long-term peace",
    "description": "Iran insisted Wednesday it will not give up its nuclear program. U.S. President Donald Trump helped negotiate the ceasefire and told reporters it was going \"very well.\"",
    "link": "https://www.pbs.org/newshour/world/a-fragile-ceasefire-between-iran-and-israel-gives-hope-for-long-term-peace",
    "timestamp": "2025-06-25T15:34:44Z"
  },
  {
    "title": "Kyle Rittenhouse Steps Away From Public Eye, Deletes Social Media Accounts, Leaves Gun Shop Job",
    "description": "Kyle Rittenhouse quietly shuttered his social media accounts and stepped back from the spotlight at some point during the past few months, an about-face from the slew of public speaking appearances and media interviews he did in the wake of his November 2021 …",
    "link": "https://www.mediaite.com/online/kyle-rittenhouse-steps-away-from-public-eye-deletes-social-media-accounts-leaves-gun-shop-job/",
    "timestamp": "2025-06-25T15:34:43Z"
  },
  {
    "title": "Iran and the Fracturing West",
    "description": "US President Donald Trump’s decision to bomb Iran’s nuclear sites instead of pursuing diplomacy is perhaps the clearest indication yet of his abandonment of the Western alliance. While working with allies is more likely to promote global stability, Trump’s co…",
    "link": "https://www.project-syndicate.org/commentary/iran-marks-end-of-western-unity-by-chris-patten-2025-06",
    "timestamp": "2025-06-25T15:34:21Z"
  },
  {
    "title": "NATO Is Avoiding a Difficult Conversation",
    "description": "Leaders lack public approval to make good on their promises on defense spending.",
    "link": "http://foreignpolicy.com/2025/06/25/nato-summit-defense-spending-public-approval/",
    "timestamp": "2025-06-25T15:34:17Z"
  },
  {
    "title": "Inside Iran's Spy Crisis: Who Helped Israel's Attacks as 700 Arrested?",
    "description": "Iran has escalated its internal crackdown, executing suspected spies and arresting over 700 people in just 12 days amid its conflict with Israel.",
    "link": "https://www.newsweek.com/iran-spy-crisis-israel-mossad-arrests-executions-2089236",
    "timestamp": "2025-06-25T15:34:01Z"
  },
  {
    "title": "Majority of Americans Support Childhood Vaccination Despite RFK Policy Shifts",
    "description": "One expert said new polling shows that more support for vaccines is needed to achieve herd immunity for many diseases.",
    "link": "https://19thnews.org/2025/06/vaccine-support-americans-poll/",
    "timestamp": "2025-06-25T15:33:33Z"
  },
  {
    "title": "Tesla Suffers Fresh Blow in Europe",
    "description": "Sales declined across the Europe in May, despite electric vehicles seeing a surge in popularity across the region.",
    "link": "https://www.newsweek.com/tesla-sales-suffer-elon-musk-blow-europe-2090578",
    "timestamp": "2025-06-25T15:33:14Z"
  },
  {
    "title": "Bulgaria’s ‘hidden pharma tax’ could prompt US tariff reaction",
    "description": "The pharma industry has urged Bulgaria to reform drug pricing and clawbacks, warning current policies threaten patient access and foreign investment.",
    "link": "https://www.euractiv.com/section/health-consumers/news/bulgarias-hidden-pharma-tax-could-prompt-us-tariff-reaction/",
    "timestamp": "2025-06-25T15:32:13Z"
  },
  {
    "title": "Emil Bove, Trump's former lawyer-turned-DOJ official faces confirmation for judgeship",
    "description": "Emil Bove, President Trump's former personal attorney who has been helping lead the DOJ, faces a Senate confirmation hearing to serve as a federal appeals court judge.",
    "link": "https://abcnews.go.com/US/emil-bove-trumps-former-lawyer-turned-doj-official/story?id=123193208",
    "timestamp": "2025-06-25T15:31:47Z"
  },
  {
    "title": "Zohran Mamdani Wins Muslim Communist Primary OF OUR HEARTS!",
    "description": "Nice time, get your nice time!",
    "link": "https://www.wonkette.com/p/zohran-mamdani-wins-muslim-communist",
    "timestamp": "2025-06-25T15:31:35Z"
  },
  {
    "title": "In US, the Iranian diaspora contends with the Israel-Iran war and a fragile ceasefire",
    "description": "Especially for those with relatives in Iran, it has been an intense time.",
    "link": "https://www.bostonherald.com/2025/06/25/mideast-wars-iranian-americans/",
    "timestamp": "2025-06-25T15:30:07Z"
  },
  {
    "title": "CDC director nominee grilled on vaccines, public health in confirmation hearing",
    "description": "President Trump's pick for the director of Centers for Disease Control and Prevention, Dr. Susan Monarez, is set to face questions about her vision for the agency.",
    "link": "https://abcnews.go.com/Politics/cdc-director-nominee-susan-monarez-grilled-vaccines-public/story?id=123193108",
    "timestamp": "2025-06-25T15:30:07Z"
  },
  {
    "title": "‘Blatantly Manipulative!’ CNN Anchor Bites Back at Trump Over Claim Network ‘Demeaned’ Soldiers With Iran Strike Report",
    "description": "CNN's Pamela Brown bit back after Donald Trump accused their network and other media outlets of \"demeaning\" United States military service members.\nThe post ‘Blatantly Manipulative!’ CNN Anchor Bites Back at Trump Over Claim Network ‘Demeaned’ Soldiers With I…",
    "link": "https://www.mediaite.com/media/tv/blatantly-manipulative-cnn-anchor-bites-back-at-trump-over-claim-network-demeaned-soldiers-with-iran-strike-report/",
    "timestamp": "2025-06-25T15:29:13Z"
  },
  {
    "title": "The Israeli-Iranian war is not over—it has just entered a dangerous pause",
    "description": "Israel and Iran still maintain their strategic objectives despite a formal ceasefire, with nuclear ambitions and proxy networks ensuring the conflict has merely shifted forms",
    "link": "https://www.foxnews.com/opinion/israeli-iranian-war-not-over-it-has-just-entered-dangerous-pause",
    "timestamp": "2025-06-25T15:28:14Z"
  },
  {
    "title": "Trump Says US and Iran to Talk Next Week, Mideast War Is ‘Over’",
    "description": "President Donald Trump said the US would hold a meeting with Iran next week but cast doubt on the need for a diplomatic agreement, citing the damage that American bombing had done to its key nuclear sites.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-us-and-iran-to-talk-next-week-mideast-war-is-over",
    "timestamp": "2025-06-25T15:27:33Z"
  },
  {
    "title": "Garcia wins top Democratic spot on Oversight panel",
    "description": "Rep. Robert Garcia of California will take over as the top Democrat on the House Oversight and Government Reform Committee, signaling a shift toward younger leadership among his party. The ranking member position opened earlier this year when Virginia Rep. Ge…",
    "link": "https://freerepublic.com/focus/f-news/4325214/posts",
    "timestamp": "2025-06-25T15:27:15Z"
  },
  {
    "title": "Trump praises ‘brave’ Ukraine after Zelenskyy meeting",
    "description": "US President Donald Trump praised Ukraine as “very brave” following a bilateral meeting with Ukrainian leader Volodymyr Zelenskyy Wednesday at an ongoing NATO summit, in what were some of Trump’s most positive remarks toward Kyiv since his reelection.\n“We had…",
    "link": "https://biztoc.com/x/c610945bd5cd9d98",
    "timestamp": "2025-06-25T15:26:26Z"
  },
  {
    "title": "Trump says Putin is 'difficult' on Ukraine war, calls Russian leader 'misguided'",
    "description": "President Donald Trump met with Ukrainian leader Volodymyr Zelenskyy at a NATO Summit.",
    "link": "https://www.usatoday.com/story/news/world/2025/06/25/putin-difficult-ukraine-war-trump-nato-meet/84350057007/",
    "timestamp": "2025-06-25T15:26:21Z"
  },
  {
    "title": "Orban: NATO policy changes thanks to Trump",
    "description": "Hungarian Prime Minister Viktor Orban said on Wednesday that the policy of the North Atlantic Treaty Organization (NATO) has significantly changed after United States President Donald Trump returned ...",
    "link": "https://biztoc.com/x/409ba15d4c13ba38",
    "timestamp": "2025-06-25T15:26:08Z"
  },
  {
    "title": "Which Democrat Can Beat Republicans to Flip Texas? Poll Shows Voters' Views",
    "description": "Texas Democrats must decide whether they want familiar faces in 2026 election races or put up new blood in a state that favors Republicans.",
    "link": "https://www.newsweek.com/texas-election-polls-democrats-ted-cruz-2090528",
    "timestamp": "2025-06-25T15:25:40Z"
  },
  {
    "title": "NATO's Rutte compares Trump to a 'daddy' after president's profane comments (Reuters)",
    "description": "Reuters:\nNATO's Rutte compares Trump to a ‘daddy’ after president's profane comments  —  THE HAGUE, June 25 (Reuters) - Note: This story contains language some readers may find offensive in paragraph 5  —  NATO Secretary General Mark Rutte on Wednesday likene…",
    "link": "https://www.memeorandum.com/250625/p59",
    "timestamp": "2025-06-25T15:25:00Z"
  },
  {
    "title": "Watch: Jerome Powell Testifies in Senate",
    "description": "Federal Reserve Chairman Jerome Powell testifies before the Senate Banking, Housing, and Urban Affairs Committee on Wednesday, June 25.\nThe post Watch: Jerome Powell Testifies in Senate appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/06/25/watch-jerome-powell-testifies-in-senate/",
    "timestamp": "2025-06-25T15:24:58Z"
  },
  {
    "title": "US to stop financial support of global vaccine alliance Gavi, health secretary says",
    "description": "Robert F. Kennedy Jr. announced that the U.S. will halt funding to Gavi. He cited safety issues with vaccines as the reason. Gavi refuted the claims, emphasizing its commitment to safety and WHO guidelines. The decision was revealed at Gavi's fundraising even…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-to-stop-financial-support-of-global-vaccine-alliance-gavi-health-secretary-says/articleshow/122073975.cms",
    "timestamp": "2025-06-25T15:24:49Z"
  },
  {
    "title": "Tuberville: 'We've Got the Mullahs on the Run'",
    "description": "Tuesday on FBN's \"The Evening Edit,\" Sen. Tommy Tuberville (R-AL) touted the impact of President Donald Trump's ordered U.S. airstrike on Iran.\nThe post Tuberville: ‘We’ve Got the Mullahs on the Run’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/06/25/tuberville-weve-got-the-mullahs-on-the-run/",
    "timestamp": "2025-06-25T15:21:32Z"
  },
  {
    "title": "Hirono slams Trump-backed school voucher plan | Honolulu Star-Advertiser",
    "description": "U.S. Sen. Mazie Hirono on Tuesday condemned a controversial school voucher proposal embedded in President Donald Trump’s sweeping budget reconciliation package, warning it would permanently divert billions of dollars from public schools to benefit private \nin…",
    "link": "https://www.staradvertiser.com/2025/06/25/hawaii-news/hirono-slams-trump-backed-school-voucher-plan/",
    "timestamp": "2025-06-25T15:20:54Z"
  },
  {
    "title": "Mamdani Wins NYC Democrat Primary: What You Need to Know",
    "description": "New York Democrat Assemblyman Zohran Mamdani brought the Cuomo political dynasty to its knees Tuesday night with his victory in the New York City mayoral... Read More\nThe post Mamdani Wins NYC Democrat Primary: What You Need to Know appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/06/25/mamdani-wins-nyc-democrat-primary-what-you-need-to-know/",
    "timestamp": "2025-06-25T15:20:00Z"
  },
  {
    "title": "NATO leader praises Trump for 'decisive action' on Iran (Fox News)",
    "description": "Fox News:\nNATO leader praises Trump for ‘decisive action’ on Iran  —  President Donald Trump was hailed at the 2025 NATO Summit after the U.S. struck Iran's nuclear facilities over the weekend.  NATO Secretary-General Mark Rutte praised Trump as a “man of str…",
    "link": "https://www.memeorandum.com/250625/p57",
    "timestamp": "2025-06-25T15:20:00Z"
  },
  {
    "title": "Why AI Regulation Has Become a ‘States’ Rights’ Issue",
    "description": "Notable Republicans back Trump’s \"Big Beautiful Bill,\" with a provision to block state AI laws—but some in the GOP are pushing back.",
    "link": "https://time.com/7297580/ai-moratorium-senate-big-beautiful-bill/",
    "timestamp": "2025-06-25T15:19:52Z"
  },
  {
    "title": "The D Brief: DIA’s Iran-strike assessment; NATO’s Ukraine forecast; UK plans nuke-capable F-35s; FBI agents, re-redirected; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/06/the-d-brief-june-25-2025/406303/",
    "timestamp": "2025-06-25T15:18:23Z"
  },
  {
    "title": "Whistleblower alleges 3rd Circuit nominee Emil Bove suggested ignoring court orders while at DOJ",
    "description": "A whistleblower lawyer alleges that he was fired after resisting efforts by the Department of Justice and White House leadership to defy court orders in immigration cases “through lack of candor, deliberate delay and disinformation.”",
    "link": "https://www.abajournal.com/news/article/whistleblower-alleges-3rd-circuit-nominee-emil-bove-suggested-ignoring-court-orders-while-at-justice-department",
    "timestamp": "2025-06-25T15:17:00Z"
  },
  {
    "title": "'Are NATO allies like your children?' Trump pressed about being called 'daddy'",
    "description": "President Donald Trump was pressed about being called “Daddy” by Prime Minister of the Netherlands Dick Schoof, during his final NATO\r\n press conference on Wednesday.“The NATO chief, who is your friend, he called you daddy earlier,” Deborah Haynes from Sky Ne…",
    "link": "https://www.rawstory.com/nato-sky-news-children-daddy/",
    "timestamp": "2025-06-25T15:16:43Z"
  },
  {
    "title": "Trump affirms his commitment to NATO's Article 5 pledge for mutual defense",
    "description": "Donald Trump has confirmed his support for NATO's defense pledge. This happened after he initially questioned his commitment. NATO members have agreed to increase defense spending. They aim for 5% of GDP annually by 2035. Spain has expressed reservations abou…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-affirms-his-commitment-to-natos-article-5-pledge-for-mutual-defense/articleshow/122073858.cms",
    "timestamp": "2025-06-25T15:16:05Z"
  },
  {
    "title": "Trump hails 'great progress' in Gaza hostage talks as Israeli, Hamas officials indicate stalemate",
    "description": "The key dispute is Hamas's demand that a cease-fire guarantee an end to the war within two months, which Israel firmly rejects. Israel, in turn, demands that Hamas disarm and its leaders go into exile, a condition Hamas strongly opposes",
    "link": "https://www.haaretz.com/israel-news/2025-06-25/ty-article/.premium/trump-hails-great-progress-in-gaza-talks-as-israeli-hamas-officials-indicate-stalemate/00000197-a6c7-d6b3-abf7-eef7514a0000",
    "timestamp": "2025-06-25T15:15:55Z"
  },
  {
    "title": "The stablecoin time bomb hidden in Trump’s GENIUS act: Prepare for the next financial meltdown – UNHERD, 19 JUNE 2025",
    "description": "Francisco Goya’s etching The Sleep of Reason Produces Monsters was an artist’s stern warning of the hideous forces unleashed in the mind when reason lowers its guard. Today, stablecoins are the gruesome forces being released into the global economy as Preside…",
    "link": "https://www.yanisvaroufakis.eu/2025/06/25/the-stablecoin-time-bomb-hidden-in-trumps-genius-act-prepare-for-the-next-financial-meltdown-unherd-19-june-2025/",
    "timestamp": "2025-06-25T15:15:49Z"
  },
  {
    "title": "Overlapping problems create uncertainty over the future of the Republican megabill",
    "description": "Donald Trump has said the GOP is united behind the inaptly named One Big Beautiful Bill Act. The truth for Republicans on Capitol Hill isn't nearly that simple.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/overlapping-problems-create-uncertainty-future-republican-megabill-rcna214977",
    "timestamp": "2025-06-25T15:15:38Z"
  },
  {
    "title": "US stock market today: Nasdaq jumps, S&P 500 nears record, and Dow climbs — Nvidia surges as Fed cut hopes Middle East truce",
    "description": "US Stock market today saw the Nasdaq leading a tech-powered rally, while the S&P 500 moved closer to record highs, thanks to investor optimism around possible Federal Reserve rate cuts and a Trump-brokered ceasefire between Iran and Israel. Tech stocks like N…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-nasdaq-jumps-sp-500-nears-record-and-dow-climbs-nvidia-surges-as-fed-cut-hopes-middle-east-truce/articleshow/122073670.cms",
    "timestamp": "2025-06-25T15:15:34Z"
  },
  {
    "title": "New Home Sales Plunge in May as High Interest Rates Weigh on Affordability",
    "description": "High interest rates are increasingly a drag on the housing market.\nThe post New Home Sales Plunge in May as High Interest Rates Weigh on Affordability appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/06/25/new-home-sales-plunge-in-may-as-high-interest-rates-weigh-on-affordability/",
    "timestamp": "2025-06-25T15:15:22Z"
  },
  {
    "title": "A look at the major players in the crypto industry and their ties to Trump",
    "description": "By WILL WEISSERT, Associated Press\nWASHINGTON — President Donald Trump took office in January pledging to “make America the crypto capital of the world.” He has since harnessed wide swaths of the federal government to bolster the industry — all while raking i…",
    "link": "https://biztoc.com/x/c9d9b7627684e2e1",
    "timestamp": "2025-06-25T15:15:05Z"
  },
  {
    "title": "Trump to host DRC-Rwanda peace deal — adviser",
    "description": "US President Donald Trump expects to host the heads of state of DR Congo and Rwanda in the “coming weeks” to sign a peace agreement to end a decades-long conflict in eastern Congo, his senior Africa adviser said on Tuesday.\nThe foreign ministers of both count…",
    "link": "https://biztoc.com/x/96a22b04cf913ed1",
    "timestamp": "2025-06-25T15:15:04Z"
  },
  {
    "title": "Zohran Mamdani Reminds Me of Someone. His Name Was Mario Cuomo.",
    "description": "Which candidate, running as an\nunderdog in New York’s Democratic primary election, said the following?\r\n“[O]nce the middle class goes over\nto the right with the rich, they bludgeon the poor. The whole society suffers\nbecause of the social disorientation that …",
    "link": "https://newrepublic.com/article/197226/zohran-mamdani-wins-mayor-primary-mario-cuomo",
    "timestamp": "2025-06-25T15:14:42Z"
  },
  {
    "title": "U.S. strikes on Iran’s nuclear program have unleashed cyberattacks on American banks and the oil industry",
    "description": "Hackers backing Tehran have targeted U.S. banks, defense contractors and oil industry companies following American strikes on Iranian nuclear facilities — but so far have not caused widespread disruptions to critical infrastructure or the economy.But that cou…",
    "link": "https://www.fastcompany.com/91358064/u-s-strikes-irans-nuclear-program-have-unleashed-cyberattacks-american-banks-oil-industry",
    "timestamp": "2025-06-25T15:14:17Z"
  },
  {
    "title": "Trump, Hegseth seethe at 'fake news' media for doubting US strikes obliterated Iranian nuclear sites: 'Scum'",
    "description": "President Donald Trump reads assessment from Israel's Atomic Energy Commission at NATO press conference confirming U.S. military action 'devastated' nuclear facilities.",
    "link": "https://www.foxnews.com/politics/trump-hegseth-seethe-fake-news-media-doubting-us-strikes-obliterated-iranian-nuclear-sites-scum",
    "timestamp": "2025-06-25T15:13:38Z"
  },
  {
    "title": "Ex-MSNBC host Joy Reid clashes with CNN panel as she defends Iran",
    "description": "Former MSNBC host Joy Reid defended Iran during a clash on CNN on Tuesday as the CNN anchor reminded the far-left personality that Iran is a state sponsor of terrorism.",
    "link": "https://www.foxnews.com/media/ex-msnbc-host-joy-reid-clashes-cnn-panel-defends-iran",
    "timestamp": "2025-06-25T15:13:20Z"
  },
  {
    "title": "Report: Intercepted calls reveal Iran misjudged scope of nuclear site destruction",
    "description": "Intercepts suggest Tehran unaware of full impact; Israel calls strike results 'very significant.'",
    "link": "https://www.israelnationalnews.com/news/410648",
    "timestamp": "2025-06-25T15:11:37Z"
  },
  {
    "title": "Trump: NATO Spending Boost is 'Monumental Win For Western Civilisation'",
    "description": "President hailed \"historic... monumental win\" as the NATO alliance agreed to his demand to equalise the burden of common defence.\nThe post Trump: NATO Spending Boost is ‘Monumental Win For Western Civilisation’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/06/25/trump-nato-spending-boost-monumental-win-for-western-civilisation/",
    "timestamp": "2025-06-25T15:10:17Z"
  },
  {
    "title": "McClellan: Empathy (and fear) in a time of war",
    "description": "I was in Vietnam, minding my own business and trying to ignore the culture wars raging in America, when word drifted down that National Guard troops had shot and killed four students during an anti-war protest at Kent State.",
    "link": "https://www.stltoday.com/news/local/column/bill-mcclellan/article_00b0442d-8c3b-4cc1-b362-9db2f356209a.html",
    "timestamp": "2025-06-25T15:10:00Z"
  },
  {
    "title": "Iranian dissident leader outlines vision for regime change, says it's 'inevitable'",
    "description": "NCRI leader Maryam Rajavi explains her organization's platform for Iranian regime change, including separation of religion and state and gender equality.",
    "link": "https://www.foxnews.com/world/iranian-dissident-leader-outlines-vision-regime-change-says-its-inevitable",
    "timestamp": "2025-06-25T15:08:58Z"
  },
  {
    "title": "'Great progress' made in Gaza ceasefire talks, says Trump",
    "description": "Donald Trump has suggested a ceasefire in Gaza may be imminent.",
    "link": "https://news.sky.com/story/great-progress-made-in-gaza-ceasefire-talks-says-donald-trump-13388530",
    "timestamp": "2025-06-25T15:08:00Z"
  },
  {
    "title": "Donald Trump will make UK state visit this year, Buckingham Palace confirms",
    "description": "King Charles signed an invitation sent to the White House by British Embassy representatives in Washington, D.C. last week.",
    "link": "https://www.politico.eu/article/donald-trump-us-uk-state-visit-buckingham-palace-king-charles-keir-starmer-queen-elizabeth-canada/",
    "timestamp": "2025-06-25T15:07:14Z"
  },
  {
    "title": "Israeli-US Strikes on Iran Create ‘New Middle East,’ Former Defense Intelligence Officer Says",
    "description": "The recent Israeli and American strikes on Iranian nuclear facilities have been “extremely successful” in significantly delaying Iran’s nuclear program, according to Robert Greenway, a... Read More\nThe post Israeli-US Strikes on Iran Create ‘New Middle East,’…",
    "link": "https://www.dailysignal.com/2025/06/25/israeli-us-strikes-on-iran-create-new-middle-east-former-defense-intelligence-officer-says/",
    "timestamp": "2025-06-25T15:05:54Z"
  },
  {
    "title": "Teacher Interviewer Not Prepared for Candidate's MAGA Hat and Iran Bombing Talk",
    "description": "The candidate \"was a trip,\" the interviewer told Newsweek.",
    "link": "https://www.newsweek.com/teacher-interviewer-not-prepared-candidates-maga-hat-iran-bombing-talk-2090207",
    "timestamp": "2025-06-25T15:05:01Z"
  },
  {
    "title": "The myth of Iran’s invincibility has been broken, and the fallout could be far-reaching | CNN",
    "description": "For over than three decades, Iran built a web of proxy networks to push its battles far beyond its borders – keeping enemies at bay, as Supreme Leader Ayatollah Ali Khamenei tightened his grip on power. Direct strikes on Iran remained inconceivable.",
    "link": "https://www.cnn.com/2025/06/25/middleeast/myth-of-irans-invincibility-broken-intl",
    "timestamp": "2025-06-25T15:04:12Z"
  },
  {
    "title": "Trump says he will speak to Putin soon about ending Ukraine war",
    "description": "THE HAGUE (Reuters) -U.S. President Donald Trump said on Wednesday after talks with Ukraine President Volodymyr Zelenskiy that he is considering sending more Patriot missile batteries to Ukraine to help Kyiv fend off Russian attacks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/25/trump-says-he-will-speak-to-putin-soon-about-ending-ukraine-war",
    "timestamp": "2025-06-25T15:04:00Z"
  },
  {
    "title": "Donald Trump Reacts to Being Called 'Daddy' by NATO Chief",
    "description": "Mark Rutte called Trump \"daddy\" in a reference to his handling of the Israel-Iran conflict.",
    "link": "https://biztoc.com/x/ea9eca8de81a72b1",
    "timestamp": "2025-06-25T15:03:53Z"
  },
  {
    "title": "U.S. to Hold Talks With Iran Next Week, Trump Says",
    "description": "10 min ago\nU.S. to Hold Talks With Iran Next Week, Trump Says\nPresident Donald Trump said he would hold talks with Iran next week, reiterating that U.S. strikes had \"obliterated\" the country's nuclear sites.\n\"We're going to talk to them next week, with Iran. …",
    "link": "https://biztoc.com/x/88c4a25bbfd29e2c",
    "timestamp": "2025-06-25T15:03:49Z"
  },
  {
    "title": "Trump says US and Iranian officials will talk next week with war over",
    "description": "Following a fragile ceasefire that halted the recent war between Israel and Iran, President Trump announced upcoming talks between U.S. and Iranian officials. Despite Iran's insistence on maintaining its nuclear program and skepticism about diplomacy after U.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-and-iranian-officials-will-talk-next-week-with-war-over/articleshow/122073720.cms",
    "timestamp": "2025-06-25T15:03:28Z"
  },
  {
    "title": "Foxconn to further invest $2.2 billion in India, the US: reports",
    "description": "Foxconn secures $2.2 billion investment plans in India and US, diversifying production amid US-China trade tensions.",
    "link": "https://www.thehindubusinessline.com/companies/foxconn-to-further-invest-22-billion-in-india-the-us-reports/article69736686.ece",
    "timestamp": "2025-06-25T15:03:26Z"
  },
  {
    "title": "Govt, Pertamina to discuss impact of Iran-Israel conflict",
    "description": "Energy and Mineral Resources Minister Bahlil Lahadalia will hold a meeting with state-owned energy company PT Pertamina to discuss the impact of the ...",
    "link": "https://en.antaranews.com/news/361877/govt-pertamina-to-discuss-impact-of-iran-israel-conflict",
    "timestamp": "2025-06-25T15:03:03Z"
  },
  {
    "title": "Trump Issues Insane Warning About Israel and Iran Conflict",
    "description": "In the midst of celebrating a quick resolution to the Iran-Israel conflict, Donald Trump casually mentioned that the fighting could start up again “soon.”\r\n“You just said that you believe the conflict with Israel and Iran is over. What makes you so confident …",
    "link": "https://newrepublic.com/post/197227/donald-trump-warning-israel-iran-conflict",
    "timestamp": "2025-06-25T15:02:19Z"
  },
  {
    "title": "Mark Halperin Hammers Chris Coons Over Not Giving Trump ‘Credit’ For Foreign Policy Wins",
    "description": "Mark Halperin criticized Chris Coons for not crediting Donald Trump for foreign policy wins related to Iran and the North Atlantic Treaty Organization (NATO).",
    "link": "https://dailycaller.com/2025/06/25/mark-halperin-hammers-chris-coons-over-not-giving-trump-foreign-policy-wins/",
    "timestamp": "2025-06-25T15:01:59Z"
  },
  {
    "title": "John Fetterman Gets Good News From Republicans in His Home State",
    "description": "Fetterman is more popular with Republicans than Democrats in Pennsylvania, according to a new poll.",
    "link": "https://www.newsweek.com/john-fetterman-approval-republicans-pennsylvania-poll-2090583",
    "timestamp": "2025-06-25T15:01:41Z"
  }
]