[
  {
    "title": "U.S. says document on trade deal with Japan to be issued in weeks",
    "description": "The U.S. government plans to release official documents on recent trade deals with Japan and South Korea within weeks, Commerce Secretary Howard Lutnick said Tuesday. Lutnick's comment came after the United States failed to properly implement a trade deal it …",
    "link": "https://japantoday.com/category/politics/u.s.-says-document-on-trade-deal-with-japan-to-be-issued-in-weeks",
    "timestamp": "2025-08-20T07:21:24Z"
  },
  {
    "title": "Unjustified, says Russia on US pressure on India for buying Russian crude oil",
    "description": "India turned to purchasing Russian oil sold at a discount after Western countries imposed sanctions on Moscow and shunned its supplies over its invasion of Ukraine in February, 2022",
    "link": "https://www.thehindubusinessline.com/news/world/unjustified-says-russia-on-us-pressure-on-india-for-buying-russian-crude-oil/article69954903.ece",
    "timestamp": "2025-08-20T07:16:26Z"
  },
  {
    "title": "Kim's sister says North Korea will never see the South as a diplomatic partner",
    "description": "The powerful sister of North Korean leader Kim Jong Un said her country will never see South Korea as a partner for diplomacy",
    "link": "https://abcnews.go.com/International/wireStory/kims-sister-north-korea-south-diplomatic-partner-124795911",
    "timestamp": "2025-08-20T07:10:28Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/morning-headlines-118-6794356-Aug2025/",
    "timestamp": "2025-08-20T07:05:11Z"
  },
  {
    "title": "Trump again attacks Fed chair Powell",
    "description": "US President Donald Trump said yesterday that Federal Reserve Chair Jerome Powell is \"hurting\" the housing industry \"very badly\" and repeated his call for a big cut to US interest rates.",
    "link": "https://www.rte.ie/news/business/2025/0820/1529256-trump-again-attacks-fed-chair-powell/",
    "timestamp": "2025-08-20T07:02:45Z"
  },
  {
    "title": "‘South Park’ Takes Aim Trump’s Militarized D.C. in New Episode Teaser Trailer",
    "description": "'South Park' shared a teaser trailer for the show's new episode, which takes aim at Donald Trump's militarization of Washington, D.C.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/south-park-donald-trump-militarized-dc-teaser-trailer-1235411782/",
    "timestamp": "2025-08-20T07:01:29Z"
  },
  {
    "title": "Trump slams mail-in ballots as corrupt, but may not have the power to derail them",
    "description": "Trump, citing Putin, vowed to end mail-in ballots with an executive order, despite both the facts and the Constitution’s limits on his power.",
    "link": "https://www.foxnews.com/politics/trump-slams-mail-ballots-corrupt-may-not-have-power-derail-them",
    "timestamp": "2025-08-20T07:00:44Z"
  },
  {
    "title": "6,000 Student Visas Revoked",
    "description": "The State Department has revoked 6,000 student visas so far this year, Fox News reported along with The Washington Post.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/08/20/6000-student-visas-revoked",
    "timestamp": "2025-08-20T07:00:00Z"
  },
  {
    "title": "Trump tariffs and green energy rollbacks push household electricity bills up 10%",
    "description": "Household electricity bills have increased by 10% since Donald Trump re-entered the White House, a new report has found, with its authors highlighting the impact of the president’s datacenter boosterism and cuts to clean energy projects as part of the cause.\n…",
    "link": "https://biztoc.com/x/ed9feb67682a8960",
    "timestamp": "2025-08-20T06:58:24Z"
  },
  {
    "title": "WSJ: US prepares for air support for European force in Ukraine – What the US Pentagon is considering",
    "description": "After the Alaska summit, the US President instructed the US Air Force Chief of Staff, Dan Kane, to draw up a plan with options for \"NATO-style\" security guarantees.\nThe post WSJ: US prepares for air support for European force in Ukraine – What the US Pentagon…",
    "link": "https://en.protothema.gr/2025/08/20/wsj-us-prepares-for-air-support-for-european-force-in-ukraine-what-the-us-pentagon-is-considering/",
    "timestamp": "2025-08-20T06:58:09Z"
  },
  {
    "title": "HRH the Crown Prince, Russian President Discuss Peace Efforts and Bilateral Cooperation",
    "description": "His Royal Highness Prince Mohammed bin Salman bin Abdulaziz Al Saud, Crown Prince and Prime Minister, spoke by phone today with Russian Federation President Vladimir Putin",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2025/saudi-250819-spa01.htm",
    "timestamp": "2025-08-20T06:57:07Z"
  },
  {
    "title": "Elon Musk’s ‘America Party’ plans have stalled: Report",
    "description": "Elon Musk will reportedly back Vice President JD Vance in the 2028 presidential elections should he choose to run, The Wall Street Journal reports.",
    "link": "https://cointelegraph.com/news/elon-musk-s-plans-for-america-party-have-stalled-report",
    "timestamp": "2025-08-20T06:49:10Z"
  },
  {
    "title": "Trump’s tariffs create ‘urgency to transform India’: billionaire Uday Kotak",
    "description": "The Kotak Mahindra group founder called for “direct fiscal support” from the government to “turbocharge” small businesses in manufacturing, research and technology.",
    "link": "https://indianexpress.com/article/business/trump-tariffs-urgency-india-billionaire-uday-kotak-10200219/",
    "timestamp": "2025-08-20T06:39:17Z"
  },
  {
    "title": "'South Park' Trolls Trump With Return of Beloved Character",
    "description": "The show isn't letting up as it continues to mock the president and his administration.",
    "link": "https://www.huffpost.com/entry/south-park-towelie-trump_n_68a55220e4b021f222362346",
    "timestamp": "2025-08-20T06:37:54Z"
  },
  {
    "title": "White House starts TikTok account as platform in US legal limbo",
    "description": "The White House launched a TikTok account on Tuesday, as President Donald Trump continues to permit the Chinese-owned platform to operate in the United States despite a law requiring its sale.",
    "link": "https://techxplore.com/news/2025-08-white-house-tiktok-account-platform.html",
    "timestamp": "2025-08-20T06:37:32Z"
  },
  {
    "title": "CNBC Daily Open: Trump's expanded tariffs mean putting out home fires could be more expensive",
    "description": "Tariff-related ruction appears to be settling down, but U.S. President Donald Trump is still reshaping global trade and industry — and everyday life.",
    "link": "https://biztoc.com/x/2731f77f868dd34d",
    "timestamp": "2025-08-20T06:36:06Z"
  },
  {
    "title": "Kristi Noem Burned For Agreeing To 'Dumbest' Trump Border Ask",
    "description": "The Homeland Security secretary took heat over a move that critics described as \"straight out of the Wile E. Coyote playbook.\"",
    "link": "https://www.huffpost.com/entry/kristi-noem-trump-southern-border-wall-paint-black_n_68a54f3be4b0a58e15421d05",
    "timestamp": "2025-08-20T06:34:19Z"
  },
  {
    "title": "Kristi Noem Burned For Agreeing To 'Dumbest' Trump Border Ask",
    "description": "The Homeland Security secretary took heat over a move that critics described as \"straight out of the Wile E. Coyote playbook.\"",
    "link": "https://www.huffpost.com/entry/kristi-noem-trump-southern-border-wall-paint-black_n_68a54f3be4b0a58e15421d05?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-20T06:34:19Z"
  },
  {
    "title": "CNBC Daily Open: Trump's expanded tariffs mean putting out home fires could be more expensive",
    "description": "Tariff-related ruction appears to be settling down, but U.S. President Donald Trump is still reshaping global trade and industry — and everyday life.",
    "link": "https://www.cnbc.com/2025/08/20/cnbc-daily-open-expanded-tariffs-mean-extinguishing-fires-could-be-costlier.html",
    "timestamp": "2025-08-20T06:30:01Z"
  },
  {
    "title": "Trump says US troops won't enforce Ukraine-Russia deal on the ground - but might by air",
    "description": "European and US military officers met in Washington D.C. yesterday to discuss how a possible Ukraine peace deal might work.",
    "link": "https://www.thejournal.ie/trump-says-us-troops-wont-enforce-ukraine-russia-deal-on-the-ground-but-might-by-air-6794331-Aug2025/",
    "timestamp": "2025-08-20T06:29:52Z"
  },
  {
    "title": "Russia launches largest attack on Ukraine this month following Trump's meetings with Putin, Zelenskyy",
    "description": "Russia launched its largest attack of the month against Ukraine while Ukrainian President Volodymyr Zelenskyy met with U.S. President Donald Trump and European leaders.",
    "link": "https://www.foxnews.com/world/russia-launches-largest-attack-ukraine-month-following-trumps-meetings-putin-zelenskyy",
    "timestamp": "2025-08-20T06:24:32Z"
  },
  {
    "title": "Trump imposed ‘sanctions’ on India to end Ukraine conflict – White House",
    "description": "The US President has used “tremendous public pressure” to bring the hostilities to a close, Karoline Leavitt has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/623302-trump-sanctions-india-ukraine-conflict/",
    "timestamp": "2025-08-20T06:23:15Z"
  },
  {
    "title": "Security Guarantees? Face Time With Putin? Zelenskyy Gets Warmer Trump Reception But Unclear Results",
    "description": "The last time Volodymyr Zelenskyy was in the Oval Office, the Ukrainian president was berated for being ungrateful, argumentative, and underdressed. Donald Trump suspended US military support, undermining Ukraine's ability to withstand Russia's grinding invas…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250819-rferl03.htm",
    "timestamp": "2025-08-20T06:16:45Z"
  },
  {
    "title": "Russia Responds To Washington Talks With Mass Drone And Missile Strikes On Ukraine",
    "description": "Russia launched 270 drones and 10 missiles against Ukraine on August 19, in a kinetic response to Ukrainian President Volodymyr Zelenskyy's White House talks with US President Donald Trump and key European allies.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250819-rferl02.htm",
    "timestamp": "2025-08-20T06:14:10Z"
  },
  {
    "title": "Why is the US sparing China, but not India, for importing Russian oil?",
    "description": "Unequal treatment reflects a cold combination of political and economic calculations.",
    "link": "https://www.aljazeera.com/news/2025/8/20/why-is-the-us-sparing-china-but-not-india-for-importing-russian-oil",
    "timestamp": "2025-08-20T06:12:07Z"
  },
  {
    "title": "Pumping profits or picking a fight? US goes after Indian refiners",
    "description": "The criticism from US is focused on India039s private refiners particularly Reliance Industries and Nayara Energy which together account for a large share of refined fuel exports to Europe",
    "link": "https://www.indiatoday.in/business/story/us-targets-private-refiners-ril-nayara-ioc-india-import-russia-oil-tariff-2773938-2025-08-20",
    "timestamp": "2025-08-20T06:08:14Z"
  },
  {
    "title": "Oil Steady as Industry Report Points to Shrinking US Stockpiles",
    "description": "Oil steadied after a report signaled a decline in US stockpiles, while investors weighed the outlook for Ukraine-Russia truce talks.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steady-as-industry-report-points-to-shrinking-us-stockpiles",
    "timestamp": "2025-08-20T06:06:52Z"
  },
  {
    "title": "Ukraine’s Suffering Reflected in One Family’s Story",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Tetiana and Petro Litvin.\n © Nataliia Litvin\n \n \n\n\n \nOn August 15, while United States President Donald Trump and Russian President Vladimir Putin were en route to their Alaska meeting, 26-year-old Nataliia Makarenko…",
    "link": "https://www.hrw.org/news/2025/08/20/ukraines-suffering-reflected-in-one-familys-story",
    "timestamp": "2025-08-20T06:00:00Z"
  },
  {
    "title": "Three GOP governors deploy National Guard troops to support Trump’s law-and-order push in Washington, D.C.",
    "description": "Governors of West Virginia, South Carolina and Ohio pledged National Guard support to Washington, D.C., backing President Donald Trump’s law-and-order campaign targeting crime and urban decline. Gov. Patrick Morrisey committed 300 to 400 National Guard member…",
    "link": "https://www.naturalnews.com/2025-08-20-three-gop-governors-deploy-national-guard-troops.html",
    "timestamp": "2025-08-20T06:00:00Z"
  },
  {
    "title": "Health Ranger Report: Brian Mock and the real story of Jan. 6",
    "description": "As a Jan. 6 detainee, Brian Mock endured nearly a year in jail pre-trial, facing inflated charges (e.g., minor “pushes” framed as assault). He represented himself, beating the most serious charge but still receiving a significant sentence before being pardone…",
    "link": "https://www.naturalnews.com/2025-08-20-brian-mock-the-real-story-january-6.html",
    "timestamp": "2025-08-20T06:00:00Z"
  },
  {
    "title": "Trump administration targets illegal alien truck drivers after Florida fatalities, declaring CDL crisis a national security threat",
    "description": "President Donald Trump’s executive order mandates English proficiency for commercial drivers and audits for non-resident CDLs following fatal accidents. A Florida crash caused by an illegal immigrant driver with a California CDL highlights systemic risks. Bid…",
    "link": "https://www.naturalnews.com/2025-08-20-trump-administration-targets-illegal-alien-truck-drivers.html",
    "timestamp": "2025-08-20T06:00:00Z"
  },
  {
    "title": "Trump refuses U.S. troops in Ukraine but hints at air support as peace talks stall",
    "description": "Trump rules out U.S. ground troops in Ukraine but leaves open the possibility of air support despite escalation risks. Russia’s relentless strikes show Putin won’t back down while Zelensky’s refusal to compromise prolongs the war. U.S. taxpayers have already …",
    "link": "https://www.naturalnews.com/2025-08-20-trump-refuses-troops-ukraine-air-support.html",
    "timestamp": "2025-08-20T06:00:00Z"
  },
  {
    "title": "On Seeing the Future Too Clearly",
    "description": "I spent the summer of 1965 arguing about the Vietnam War. I was 13, and my interlocutor was my 18-year-old camp counselor in Vermont. She was headed for U.C. Berkeley in the fall, where she would, as she later described it, “major in history and minor in riot…",
    "link": "https://www.counterpunch.org/2025/08/20/on-seeing-the-future-too-clearly/",
    "timestamp": "2025-08-20T05:57:17Z"
  },
  {
    "title": "Powell likely to play ‘Owl,’ watch data at Jackson Hole: Ed Yardeni",
    "description": "Ed Yardeni anticipates Fed Chair Jerome Powell to adopt a wait-and-see approach at the Jackson Hole Symposium. Upcoming inflation and payroll data will influence the Fed's decision on rate cuts. Yardeni believes inflation is stickier than perceived. He forese…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/powell-likely-to-play-owl-watch-data-at-jackson-hole-ed-yardeni/articleshow/123401719.cms",
    "timestamp": "2025-08-20T05:57:05Z"
  },
  {
    "title": "Conservatives Fear Anxiety-Ridden Youth Could Defect from Trump",
    "description": "Can Donald Trump retain the allegiance of the key voter groups that swung his way in 2024? Perhaps none of those voter shifts were as dramatic and consequential as the defection of youth – long a mainstay of the Democratic base. Gen Z voters, fueled by despai…",
    "link": "https://www.counterpunch.org/2025/08/20/conservatives-fear-anxiety-ridden-youth-could-defect-from-trump/",
    "timestamp": "2025-08-20T05:56:53Z"
  },
  {
    "title": "The haggling over security guarantees in Ukraine brings Turkey back to the negotiating table",
    "description": "Why Ankara's involvement in the conflict termination process is being promoted and how Erdogan intends to exploit this \"opportunity\"\nThe post The haggling over security guarantees in Ukraine brings Turkey back to the negotiating table appeared first on ProtoT…",
    "link": "https://en.protothema.gr/2025/08/20/the-haggling-over-security-guarantees-in-ukraine-brings-turkey-back-to-the-negotiating-table/",
    "timestamp": "2025-08-20T05:55:07Z"
  },
  {
    "title": "US strikes deportation deals with Honduras and Uganda",
    "description": "Uganda and Honduras have agreed to accept migrants of other nationalities who have been deported from the US, CBS reports.",
    "link": "https://www.bbc.com/news/articles/cn02eezlykdo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-20T05:54:54Z"
  },
  {
    "title": "US strikes deportation deals with Honduras and Uganda",
    "description": "Uganda and Honduras have agreed to accept migrants of other nationalities who have been deported from the US, CBS reports.",
    "link": "https://www.bbc.com/news/articles/cn02eezlykdo",
    "timestamp": "2025-08-20T05:53:37Z"
  },
  {
    "title": "Bessent says China tariff status quo ‘working pretty well’",
    "description": "“China is the biggest revenue line in the tariff income—so if it’s not broke, don’t fix it,” Treasury Secretary Scott Bessent said in a Tuesday interview.",
    "link": "https://fortune.com/asia/2025/08/20/bessent-says-china-tariff-working-pretty-well/",
    "timestamp": "2025-08-20T05:51:13Z"
  },
  {
    "title": "US examines equity stake in chip makers for CHIPS Act cash grants",
    "description": "As part of a plan to revive US manufacturing, US Commerce Secretary Howard Lutnic said that the US government wants an equity stake in Intel in exchange for cash grants approved by the administration of former President Joe Biden. Now Lutnick intends to expan…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-examines-equity-stake-in-chip-makers-for-chips-act-cash-grants-sources-say/articleshow/123401613.cms",
    "timestamp": "2025-08-20T05:48:01Z"
  },
  {
    "title": "Australian success story turns out to be another big, dumb company",
    "description": "Australian biotech giant CSL has a reputation for innovation in high-end manufacturing. But it's behaving like the big dumb oligopolists that dominate Australia's sharemarket.\nThe post Australian success story turns out to be another big, dumb company appeare…",
    "link": "http://www.crikey.com.au/2025/08/20/csl-shares-tank-csl-seqirus-vaccines-us-america/",
    "timestamp": "2025-08-20T05:45:34Z"
  },
  {
    "title": "Melania Trump's peace letter to Vladimir Putin was a display of soft power",
    "description": "Throughout history, first ladies have been designated with traditional female roles. But they also have a long tradition of speaking out on key political issues.",
    "link": "https://www.abc.net.au/news/2025-08-20/first-lady-melania-trump-olena-zelenska-peace-letters-soft-power/105676018",
    "timestamp": "2025-08-20T05:43:42Z"
  },
  {
    "title": "Indian Oil, BPCL resume buying Russian oil for September as discounts widen, sources say",
    "description": "Discounts for Russian flagship Urals crude have widened to about $3 per barrel, making the oil attractive for Indian refiners, while China has stepped up purchases",
    "link": "https://www.thehindubusinessline.com/markets/commodities/indian-oil-bpcl-resume-buying-russian-oil-for-september-as-discounts-widen-sources-say/article69954686.ece",
    "timestamp": "2025-08-20T05:40:32Z"
  },
  {
    "title": "Indian Oil, BPCL resume Russian oil purchases following wider discounts amid Trump's tariff blow",
    "description": "INDIA-OIL/IMPORTS-RUSSIA (UPDATE 1):UPDATE 1-Indian Oil, BPCL resume buying Russian oil for September as discounts widen, sources say",
    "link": "https://www.livemint.com/industry/indian-oil-bpcl-resume-russian-oil-purchases-following-wider-discounts-amid-trumps-tariff-blow-11755667627989.html",
    "timestamp": "2025-08-20T05:36:51Z"
  },
  {
    "title": "AI tools to help improve infrastructure",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/08/20/ai-tools-to-help-improve-infrastructure-says-deloitte/",
    "timestamp": "2025-08-20T05:34:02Z"
  },
  {
    "title": "White House Rages at Rocker Who Dissed Trump’s ‘Vulgar’ Oval Office",
    "description": "The Trump administration has clapped back at Grammy-winning musician Jack White’s critical commentary on the president’s new-look Oval Office. White, former ...",
    "link": "https://www.thedailybeast.com/white-house-rages-at-rocker-who-dissed-trumps-vulgar-oval-office/",
    "timestamp": "2025-08-20T05:32:41Z"
  },
  {
    "title": "Top officers hold Ukraine talks after Trump rules out US troops",
    "description": "Top U.S. and European military officers met in Washington Tuesday to discuss the mechanics of a possible Ukraine peace deal, after President Donald Trump ruled out sending American troops to back an agreement but suggested air support instead.",
    "link": "https://www.hurriyetdailynews.com/top-officers-hold-ukraine-talks-after-trump-rules-out-us-troops-212704",
    "timestamp": "2025-08-20T05:30:41Z"
  },
  {
    "title": "Trump’s tariffs replace diplomacy as other US tools of statecraft are discarded",
    "description": "Measures meant to rebalance America’s economy are wielded instead against the likes of Canada, India and Brazil ‘to compel loyalty to the president’\nOn the campaign trail, Donald Trump pledged to use tariffs to revitalise American industry, bringing jobs home…",
    "link": "https://biztoc.com/x/2b00f80fcaac2304",
    "timestamp": "2025-08-20T05:29:15Z"
  },
  {
    "title": "US may provide air support to back Ukraine deal - Trump",
    "description": "US President Donald Trump has said he had ruled out putting US troops on the ground in Ukraine, but said the United States might provide air support as part of a deal to end Russia's war in the country.",
    "link": "https://www.rte.ie/news/ukraine/2025/0820/1529241-ukraine-russia/",
    "timestamp": "2025-08-20T05:28:28Z"
  },
  {
    "title": "Elon Musk, world’s richest man and a Canadian citizen, landed on a secret trip in a small B.C. town; he then went to an even more stealthy area",
    "description": "Elon Musk's recent visit to Bella Bella, British Columbia, accompanied by his son, has stirred curiosity. The trip, confirmed through flight logs and photos, involved a private plane and helicopter transfer, sparking speculation about a visit to James Murdoch…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/elon-musk-worlds-richest-man-and-a-canadian-citizen-landed-on-a-secret-trip-in-a-small-b-c-town-he-then-went-to-an-even-more-stealthy-area/articleshow/123401039.cms",
    "timestamp": "2025-08-20T05:24:03Z"
  },
  {
    "title": "Trump turns up heat on Powell ahead of Jackson hole",
    "description": "Donald Trump has renewed his attack on Federal Reserve Chair Jerome Powell, accusing him of “hurting” the housing industry. Trump repeated his call for a big interest rate cut, arguing that inflation is not a concern and that the economy is signaling the need…",
    "link": "https://m.economictimes.com/markets/stocks/news/trump-turns-up-heat-on-powell-ahead-of-jackson-hole/trump-targets-powell-again/slideshow/123401060.cms",
    "timestamp": "2025-08-20T05:13:19Z"
  },
  {
    "title": "How will Trump’s semiconductor tariffs affect the global chip industry?",
    "description": "The US president has threatened to impose a tariff of up to 300 percent on imports of semiconductors.",
    "link": "https://www.aljazeera.com/news/2025/8/20/how-will-trumps-semiconductor-tariffs-affect-the-global-chip-industry",
    "timestamp": "2025-08-20T05:08:43Z"
  },
  {
    "title": "California Crafting New Auto Pollution Rules After Trump Attacks",
    "description": "California’s clean-air regulator is pressing ahead with work on new rules for auto emissions in the state and possible new tax credits for electric cars to counter the Trump administration’s effort to corral the state’s regulatory heft. The California Air …",
    "link": "https://www.insurancejournal.com/news/west/2025/08/20/836320.htm",
    "timestamp": "2025-08-20T05:00:55Z"
  },
  {
    "title": "Musk’s SpaceX, Others Win Court Challenge to Labor Board’s Structure",
    "description": "A U.S. appeals court on Tuesday agreed with Elon Musk’s SpaceX and two other companies that the U.S. National Labor Relations Board’s structure is likely unlawful and blocked the agency from pursuing cases against them. The ruling by the New …",
    "link": "https://www.insurancejournal.com/news/national/2025/08/20/836317.htm",
    "timestamp": "2025-08-20T05:00:49Z"
  },
  {
    "title": "Congo’s Peace Negotiations Fall Through",
    "description": "As Qatari-brokered talks are suspended, fighting is intensifying in eastern Congo.",
    "link": "http://foreignpolicy.com/2025/08/20/congos-peace-negotiations-fall-through/",
    "timestamp": "2025-08-20T05:00:39Z"
  },
  {
    "title": "Wyoming Becomes First US State To Launch Its Own Stablecoin: Introducing ‘FRNT’",
    "description": "Shortly after President Donald Trump signed the GENIUS Act into law, providing a new regulatory framework for dollar-pegged cryptocurrencies, Wyoming officially introduced the Frontier Stable Token (FRNT), becoming the first US state to issue its own blockcha…",
    "link": "https://bitcoinist.com/wyoming-first-us-state-to-launch-its-own-stablecoin/",
    "timestamp": "2025-08-20T05:00:14Z"
  },
  {
    "title": "Trump-tied crypto firm ALT5 Sigma denies SEC probe rumors",
    "description": "ALT5 Sigma refuted rumors that Jon Isaac is its president and that they’re being probed by the SEC for insider trading tied to its $1.5 billion deal with World Liberty Financial last week.",
    "link": "https://cointelegraph.com/news/alt5-sigma-jon-isaac-deny-sec-probe-amid-wlf-deal",
    "timestamp": "2025-08-20T05:00:06Z"
  },
  {
    "title": "US government investment in Intel looks bad for Leixlip",
    "description": "Irish  plant could, at best, be left to wither on the vine as future investment is focused on the US",
    "link": "https://www.irishtimes.com/business/2025/08/20/us-government-investment-in-intel-looks-bad-for-leixlip/",
    "timestamp": "2025-08-20T05:00:01Z"
  },
  {
    "title": "Michael McDowell: Trump’s deal-making to end the Ukraine war is a sick charade",
    "description": "West must ensure it delivers cast-iron security guarantees for Zelenskiy and his embattled nation",
    "link": "https://www.irishtimes.com/opinion/2025/08/20/trumps-deal-making-to-end-the-ukraine-war-is-a-sick-charade/",
    "timestamp": "2025-08-20T05:00:01Z"
  },
  {
    "title": "‘The uncertainty is terrible’: Ukrainians fear what peace talks may bring",
    "description": "There is endless speculation in Kyiv on what could be gained or lost in the event of a peace settlement with Russia",
    "link": "https://www.irishtimes.com/world/europe/2025/08/20/the-uncertainty-is-terrible-ukrainians-fear-what-peace-talks-may-bring/",
    "timestamp": "2025-08-20T05:00:00Z"
  },
  {
    "title": "“I thought they hated Trump,” the Fox host said after Newsom’s office mocked her for telling him to get serious.",
    "description": "Fox News host Dana Perino got heated over California Gov. Gavin Newsom’s all-caps posts mocking President Donald Trump’s chaotic Truth Social style. Perino’s...",
    "link": "https://www.thedailybeast.com/fox-news-dana-perino-lashes-out-at-gavin-newsoms-social-media-for-second-day/",
    "timestamp": "2025-08-20T04:56:35Z"
  },
  {
    "title": "White House Makes Ironic TikTok Debut As Trump Declares ‘I Am Your Voice,’ Mixing Presidential Authority With Social Media Energy Despite Ongoing Debates Over Banning The App",
    "description": "TikTok has been controversial in the U.S., as the government remains divided on whether to ban the app or divest its operations. Nonetheless, due to the massive user base and the uproar from the community, the platform continues to be and has now taken a majo…",
    "link": "https://wccftech.com/white-house-makes-ironic-tiktok-debut-as-trump-declares-i-am-your-voice-mixing-presidential-authority-with-social-media-energy-despite-ongoing-debates-over-banning-the-app/",
    "timestamp": "2025-08-20T04:54:49Z"
  },
  {
    "title": "Intel's $24 Billion Rally Has A Worrying Side Effect",
    "description": "After months of turbulence, Intel Corp. bulls are finally being rewarded for their patience. But the stock’s sudden rebound comes with a worrying side effect: a valuation so high its most recent precedent is from the dot-com era more than two decades ago.",
    "link": "https://www.ndtvprofit.com/markets/intels-24-billion-rally-has-a-worrying-side-effect",
    "timestamp": "2025-08-20T04:53:46Z"
  },
  {
    "title": "US may provide air support to back a Ukraine peace deal, says Trump",
    "description": "President Trump has ruled out deploying U.S. troops to Ukraine but suggested potential air support as part of a peace deal. Despite this offer and security guarantees, uncertainty remains as Russia launched a major air assault. Trump indicated a possible meet…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-may-provide-air-support-to-back-a-ukraine-peace-deal-says-trump/articleshow/123400589.cms",
    "timestamp": "2025-08-20T04:51:09Z"
  },
  {
    "title": "Billionaire Uday Kotak calls for urgent support to help India withstand US tariff shock",
    "description": "Uday Kotak urges Modi's government to bolster SMEs with fiscal support amidst US tariff concerns, viewing it as an opportunity for economic transformation. He emphasises India's strong macroeconomic fundamentals but warns against complacency, advocating for e…",
    "link": "https://economictimes.indiatimes.com/news/india/billionaire-uday-kotak-calls-for-urgent-support-to-help-india-withstand-us-tariff-shock/articleshow/123400386.cms",
    "timestamp": "2025-08-20T04:46:35Z"
  },
  {
    "title": "Crude oil futures rise as industry data shows US inventory decline",
    "description": "Data from American Petroleum Institute show that crude oil inventories in the US declined by 2.4 million barrels for the week ending August 15",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-industry-data-shows-us-inventory-decline/article69954598.ece",
    "timestamp": "2025-08-20T04:45:24Z"
  },
  {
    "title": "Gold hits near 3-week low on stronger dollar, Fed symposium in focus",
    "description": "Gold prices experienced a slight increase to $3,318.07 per ounce, after hitting a near three-week low, as investors await insights from the Federal Reserve's Jackson Hole symposium. The dollar's strength is impacting gold affordability, while attention is foc…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-hits-near-3-week-low-on-stronger-dollar-fed-symposium-in-focus/articleshow/123400491.cms",
    "timestamp": "2025-08-20T04:45:16Z"
  },
  {
    "title": "US drops probe of gun-sales payment company backed by Donald Trump's son (Financial Times)",
    "description": "Financial Times:\nUS drops probe of gun-sales payment company backed by Donald Trump's son  —  CFPB suggests Biden-era investigation into Credova Financial was politically motivated  —  Donald Trump's administration has dropped a Joe Biden-era probe into a gun…",
    "link": "https://www.memeorandum.com/250820/p3",
    "timestamp": "2025-08-20T04:45:00Z"
  },
  {
    "title": "Trump’s White House takes to TikTok as deadline looms to ban platform",
    "description": "The new account comes as Trump has three times delayed implementing a 'sell or ban' law for the Chinese-owned app.",
    "link": "https://www.aljazeera.com/news/2025/8/20/trumps-white-house-takes-to-tiktok-as-deadline-looms-to-ban-platform",
    "timestamp": "2025-08-20T04:41:09Z"
  },
  {
    "title": "Kid Rock Goes Into Meltdown Mode After Getting Punked By Gavin Newsom's X Account",
    "description": "The musician fired back at the California governor's trolling message.",
    "link": "https://www.huffpost.com/entry/kid-rock-gavin-newsom_n_68a53b45e4b021f2223618b2",
    "timestamp": "2025-08-20T04:40:15Z"
  },
  {
    "title": "Trump plans to PAINT Southern border wall to make it hotter and harder to climb",
    "description": "The border wall separating the United States and Mexico is being painted black to make it too hot for migrants to climb. Secretary of Homeland Security Kristi Noem revealed the project was a specific request from Donald Trump as the president celebrated 'ZERO…",
    "link": "https://freerepublic.com/focus/f-chat/4335582/posts",
    "timestamp": "2025-08-20T04:38:31Z"
  },
  {
    "title": "White House Drama: Trump VS, Zelenskyy and Europe’s Big Players",
    "description": "Washington, D.C. was buzzing like a Hollywood red carpet this week – except instead of actors and pop stars, it was presidents and prime ministers strutting down the Cross Hall of the White House.At the center of it all: Donald Trump, back in the Oval Office …",
    "link": "https://english.gossiplankanews.com/2025/08/white-house-drama-trump-vs-zelenskyy.html",
    "timestamp": "2025-08-20T04:37:00Z"
  },
  {
    "title": "Kilmar Abrego Garcia’s lawyers want ‘preposterous’ human smuggling charges dismissed",
    "description": "Lawyers for Kilmar Abrego Garcia asked a federal judge on Tuesday to dismiss a human smuggling case against him.",
    "link": "https://nypost.com/2025/08/20/us-news/kilmar-abrego-garcias-lawyers-want-human-smuggling-charges-dismissed/",
    "timestamp": "2025-08-20T04:33:28Z"
  },
  {
    "title": "After Putin Call, Trump Rang Orban Over Ukraine EU Membership (Bloomberg)",
    "description": "Bloomberg:\nAfter Putin Call, Trump Rang Orban Over Ukraine EU Membership  —  US President Donald Trump called Viktor Orban on Monday following talks with Ukrainian President Volodymyr Zelenskiy and European leaders to discuss why the Hungarian prime minister …",
    "link": "https://www.memeorandum.com/250820/p1",
    "timestamp": "2025-08-20T04:30:07Z"
  },
  {
    "title": "Marc Champion: Donald Trump thinks Ukraine negotiations are all about him, and it makes him an easy mark for Vladimir Putin",
    "description": "In the 1963 war movie The Great Escape, 76 prisoners make it out of their camp in what begins with hope and elation, but ends with all but a handful killed or recaptured.",
    "link": "https://www.independent.ie/opinion/comment/marc-champion-donald-trump-thinks-ukraine-negotiations-are-all-about-him-and-it-makes-him-an-easy-mark-for-vladimir-putin/a1082520694.html",
    "timestamp": "2025-08-20T04:30:00Z"
  },
  {
    "title": "Nato military chiefs to hold meeting today as Donald Trump rules out putting US troops on ground in Ukraine",
    "description": "Nato military leaders are expected to meet today to discuss Ukraine and the way forward, US and Nato officials said yesterday, as Washington and European capitals work out details of what security guarantees might look like for Kyiv.",
    "link": "https://www.independent.ie/world-news/nato-military-chiefs-to-hold-meeting-today-as-donald-trump-rules-out-putting-us-troops-on-ground-in-ukraine/a689183203.html",
    "timestamp": "2025-08-20T04:30:00Z"
  },
  {
    "title": "Letters: A reminder to Leaving Cert students – results are not the be all and end all",
    "description": "I wish all the Leaving Cert students who are getting their results this week the very best of luck. I appreciate that these exams are extremely important and you have worked very hard and you are really nervous.",
    "link": "https://www.independent.ie/opinion/letters/letters-a-reminder-to-leaving-cert-students-results-are-not-the-be-all-and-end-all/a1455284177.html",
    "timestamp": "2025-08-20T04:30:00Z"
  },
  {
    "title": "Kremlin plays down Zelensky talks as Trump warns Putin may not 'want to make deal'",
    "description": "The US president conceded the war in Ukraine was \"tough to solve\" after several days of high-level talks.",
    "link": "https://www.bbc.com/news/articles/cn92e52rpjxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-20T04:23:28Z"
  },
  {
    "title": "Fox News’ Dana Perino Insists Newsom’s Trump Trolling Is ‘Cringe’ and ‘Just Not Funny’ | Video",
    "description": "The California Governor claps back against \"'DING DONG' PERINO\" with another all caps Trump parody\nThe post Fox News’ Dana Perino Insists Newsom’s Trump Trolling Is ‘Cringe’ and ‘Just Not Funny’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/fox-news-dana-perino-newsom-trump-trolling-cringe-just-not-funny/",
    "timestamp": "2025-08-20T04:22:35Z"
  },
  {
    "title": "Trump's trade adviser Peter Navarro reminds India of America’s exorbitant privilege & diktats",
    "description": "Peter Navarro's op-ed reveals the US expectation that India, to maintain its strategic partnership and trade benefits, must align its economic policies with Washington's interests. This includes purchasing American weapons without technology transfer demands …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-trade-adviser-peter-navarro-reminds-india-of-americas-exorbitant-privilege-diktats/articleshow/123399786.cms",
    "timestamp": "2025-08-20T04:17:16Z"
  },
  {
    "title": "Ukraine boasts it ‘knows how to kill Russians’",
    "description": "Ukraine’s senior diplomat has claimed that Kiev could teach NATO how to “kill Russians” Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623301-ukraine-boasts-killing-russians/",
    "timestamp": "2025-08-20T04:16:09Z"
  },
  {
    "title": "Israel is Deliberately Starving Palestinians of Gaza as Part of a Genocide: Amnesty",
    "description": "Ann Arbor (Informed Comment) - Amnesty International concluded this week that the Israeli government is using starvation as a weapon of war in Gaza, and that denying food to people is part of a genocidal campaign. Like Human Rights Watch and other human right…",
    "link": "https://www.juancole.com/2025/08/deliberately-starving-palestinians.html",
    "timestamp": "2025-08-20T04:15:13Z"
  },
  {
    "title": "Intel’s $24 billion rally sends valuation to dot-com levels",
    "description": "Intel's stock has surged recently due to potential government equity and SoftBank investment, reaching valuation levels not seen since the dot-com era. While optimism surrounds CEO Lip-Bu Tan's turnaround efforts, concerns linger about the company's long-term…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/intels-24-billion-rally-sends-valuation-to-dot-com-levels/articleshow/123399828.cms",
    "timestamp": "2025-08-20T04:15:02Z"
  },
  {
    "title": "Why the Nuclear Taboo Is Stronger Than Ever",
    "description": "Fears of proliferation and the crumbling of an earlier nuclear order could actually be accelerating international norm-building.",
    "link": "http://foreignpolicy.com/2025/08/20/nuclear-taboo-stronger-international-law/",
    "timestamp": "2025-08-20T04:14:33Z"
  },
  {
    "title": "European markets head for negative open as sentiment shifts; UK inflation data ahead",
    "description": "European stocks are expected to open lower on Wednesday as global market sentiment wavered.",
    "link": "https://www.cnbc.com/2025/08/20/european-markets-on-weds-aug-20-stoxx-600-ftse-and-uk-inflation-data.html",
    "timestamp": "2025-08-20T04:13:41Z"
  },
  {
    "title": "US budget deficit forecast $1 trillion higher over next decade, watchdog says",
    "description": "WASHINGTON (Reuters) -U.S. federal budget deficits will be nearly $1 trillion higher over the next decade than projected in January by the Congressional...",
    "link": "https://finance.yahoo.com/news/us-budget-deficit-forecast-1-040813526.html",
    "timestamp": "2025-08-20T04:08:13Z"
  },
  {
    "title": "Trump's White House joins TikTok after ban rant",
    "description": "President Trump's White House launched an official TikTok account, marking a significant shift after his previous attempts to ban the platform. This move follows Trump's personal success in engaging younger voters on TikTok during his reelection campaign.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-white-house-joins-tiktok-after-ban-rant/articleshow/123399727.cms",
    "timestamp": "2025-08-20T04:06:51Z"
  },
  {
    "title": "Four Ways the West can back up Palestine Recognition with Practical Pressure on Israel",
    "description": "By Amin Saikal, The University of Western Australia (The Conversation) - Italian Defence Minister Guido Crosetto said recently the Israeli cabinet has “lost its reason and humanity” in Gaza, reflecting a widespread view around the world. Israeli Prime Ministe…",
    "link": "https://www.juancole.com/2025/08/palestine-recognition-practical.html",
    "timestamp": "2025-08-20T04:06:08Z"
  },
  {
    "title": "Ex-RNC Spokesperson Spots Exactly How Trump Put GOP Lawmakers 'In A Pickle'",
    "description": "The Bulwark's Tim Miller declared that congressional Republicans are \"carrying the biggest political brunt\" of the issue.",
    "link": "https://www.huffpost.com/entry/former-rnc-spokesperson-tim-miller-republicans-trump-epstein-files_n_68a52a79e4b021f222360f71",
    "timestamp": "2025-08-20T04:05:31Z"
  }
]