[
  {
    "title": "Trump Scraps NASA Nomination for SpaceX-Linked Jared Isaacman as Musk Exits DOGE",
    "description": "Just days before his expected Senate confirmation, billionaire tech entrepreneur Jared Isaacman—closely aligned with Elon Musk’s SpaceX—has been withdrawn as President Donald Trump’s nominee for NASA administrator. The announcement came on the same day Musk s…",
    "link": "https://freerepublic.com/focus/f-chat/4321163/posts",
    "timestamp": "2025-06-05T17:11:16Z"
  },
  {
    "title": "Trump: Deadline For Giving Up On Russia-Ukraine Talks Is \"In My Brain\"",
    "description": "President Donald Trump said that he is not hopeful for a peace agreement in the short term after a phone call yesterday wtih his Russian counterpart and that they might have to just \"keep fighting\" until they're unable to go on, like \"young children fighting …",
    "link": "https://www.realclearpolitics.com/video/2025/06/05/trump_deadline_for_giving_up_on_russia-ukraine_talks_is_in_my_brain.html",
    "timestamp": "2025-06-05T17:11:15Z"
  },
  {
    "title": "Donald Trump Reacts to Elon Musk's Criticism, Claims Musk Is Upset About 2 Things",
    "description": "Donald Trump is reacting to Elon Musk‘s comments. Earlier in the week, the 53-year-old richest man in the world criticized the Trump administration’s “Big Beautiful Bill.” “I’m sorry, but I just can’t stand it anymore. This massive, outrageous, pork-filled Co…",
    "link": "https://www.justjared.com/2025/06/05/donald-trump-reacts-to-elon-musks-criticism-claims-musk-is-upset-about-2-things/",
    "timestamp": "2025-06-05T17:10:47Z"
  },
  {
    "title": "Rob Manfred says he 'paid attention' to Donald Trump's support of Pete Rose before reinstating MLB hits leader",
    "description": "The MLB commissioner said Wednesday that he paid attention to the \"advice\"",
    "link": "https://www.cbssports.com/mlb/news/rob-manfred-says-he-paid-attention-to-donald-trumps-support-of-pete-rose-before-reinstating-mlb-hits-leader/",
    "timestamp": "2025-06-05T17:10:44Z"
  },
  {
    "title": "‘I’m Very Disappointed in Elon’: Trump Says ‘Great Relationship’ With Musk May Be Over",
    "description": "Trump on Thursday publicly acknowledged for the first time his deteriorating relationship with Elon Musk. “I’m very disappointed in Elon.\"",
    "link": "https://time.com/7291495/trump-says-great-relationship-with-musk-may-be-over/",
    "timestamp": "2025-06-05T17:10:44Z"
  },
  {
    "title": "Fans get in line, long lines, for highly anticipated launch of the Nintendo Switch 2",
    "description": "The Switch 2 is an upgrade to its eight-year-old predecessor.",
    "link": "https://www.bostonherald.com/2025/06/05/switch-2-launch-day/",
    "timestamp": "2025-06-05T17:10:38Z"
  },
  {
    "title": "Donald Breaks Silence On Elon Musk: 'Trump Derangement Syndrome'",
    "description": "After Elon Musk (allegedly) ended his work as head of the so-called Department of Government Efficiency, he launched attacks on Trump's big, ugly bill, calling it a \"disgusting abomination.\" Then things got worse for Trump as Musk accelerated his attacks on w…",
    "link": "https://crooksandliars.com/2025/06/donald-breaks-silence-elon-musk-trump",
    "timestamp": "2025-06-05T17:09:57Z"
  },
  {
    "title": "Trump Brings Up Germany’s Nazi Past to Chancellor’s Face When Asked About Defense Spending",
    "description": "\"There'll be a point when I'll say, please don't arm anymore if you don't mind. We'll be watching him,\" Trump said of Germany's defense spending\nThe post Trump Brings Up Germany’s Nazi Past to Chancellor’s Face When Asked About Defense Spending first appeared…",
    "link": "https://www.mediaite.com/politics/trump-brings-up-germanys-nazi-past-to-chancellors-face-when-asked-about-defense-spending/",
    "timestamp": "2025-06-05T17:09:36Z"
  },
  {
    "title": "Trump Says He’s ‘Disappointed’ with Elon Musk",
    "description": "Associated Press: \"As President Donald Trump sat in the Oval Office on Thursday with Germany’s leader at his side, he lamented his soured relationship with Elon Musk, his adviser-turned-social media antagonist. Trump said he was",
    "link": "https://politicalwire.com/2025/06/05/trump-says-hes-disappointed-with-elon-musk/",
    "timestamp": "2025-06-05T17:07:31Z"
  },
  {
    "title": "Three Basic Rules of Politics: “Control the military, control the military, and control the military.”",
    "description": "The takeover of the Pentagon by special operations, and black ops is nearly complete.\nThe post Three Basic Rules of Politics: “Control the military, control the military, and control the military.” appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/three-basic-rules-politics-control-military/5889763",
    "timestamp": "2025-06-05T17:07:26Z"
  },
  {
    "title": "Hamas Ally Calls on Group to Accept 'Partial' Ceasefire in Gaza",
    "description": "\"We want an immediate ceasefire,\" a Democratic Front for the Liberation of Palestine official tells Newsweek.",
    "link": "https://www.newsweek.com/hamas-ally-calls-group-accept-partial-ceasefire-gaza-2081505",
    "timestamp": "2025-06-05T17:07:15Z"
  },
  {
    "title": "Experts Warn Of Decade-Long Setback After Trump Cuts HIV Vaccine Research",
    "description": "In 2019, President Donald Trump promised to end AIDS at home and beyond. Last week, the administration terminated several HIV vaccine research grants, a move experts fear will set the movement back ‘a decade.’",
    "link": "https://www.forbes.com/sites/jenniferlotito/2025/06/05/experts-warn-of-decade-long-setback-after-trump-cuts-hiv-vaccine-research/",
    "timestamp": "2025-06-05T17:07:05Z"
  },
  {
    "title": "Inside Ukraine’s remarkable drone attack",
    "description": "You can generally tell when Vladimir Putin appears rattled by an adverse event in his war on Ukraine. He (or one of his proxies) ramps up the bloodcurdling rhetoric. And so it is with Ukraine’s “Spiderweb…",
    "link": "https://theconversation.com/inside-ukraines-remarkable-drone-attack-258326",
    "timestamp": "2025-06-05T17:05:33Z"
  },
  {
    "title": "Trump Takes the Gloves Off and Shreds Elon Musk",
    "description": "Billionaire Elon Musk's bromance with president Donald Trump has officially exploded into an ugly, spite-fuelled, mud-slinging match of epic proportions. The feud, which has been simmering for months now, boiled over this month after Musk excoriated Trump's s…",
    "link": "https://futurism.com/trump-shreds-musk",
    "timestamp": "2025-06-05T17:05:12Z"
  },
  {
    "title": "'Such ingratitude': Elon Musk unloads on Trump with big 2024 election claim",
    "description": "Tech billionaire Elon Musk spent the hour of President Donald Trump's press conference both fact-checking the U.S. leader and attacking him for not being grateful to him. \"Without me, Trump would have lost the election, Dems would control the House and the Re…",
    "link": "https://www.rawstory.com/elon-musk-trump-2672317797/",
    "timestamp": "2025-06-05T17:05:00Z"
  },
  {
    "title": "Russia vows to repair planes damaged by Ukraine in massive drone attack, claims they were 'not destroyed'",
    "description": "Russia is vowing to repair the planes that were seen heavily damaged by Ukraine over the weekend in a massive drone attack across multiple airfields.",
    "link": "https://www.foxnews.com/world/russia-vows-repair-planes-damaged-ukraine-massive-drone-attack-claims-were-not-destroyed",
    "timestamp": "2025-06-05T17:04:58Z"
  },
  {
    "title": "'Without me, Trump would have lost election': Elon Musk launches all-out attack on US President",
    "description": "After Elon Musk criticised US President Donald Trump's sweeping tax and spending bill, calling it a \"disgusting abomination\", he launched another brutal attack on him. Elon Musk said that without his support Trump would have lost 2024 Presidential election. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/without-me-trump-would-have-lost-election-elon-musk-launches-all-out-attack-on-us-president/articleshow/121655412.cms",
    "timestamp": "2025-06-05T17:04:51Z"
  },
  {
    "title": "The Second Barron Trump College “Scandal” Is Even Dumber Than the Last",
    "description": "Donald Trump couldn’t resist getting involved.",
    "link": "https://slate.com/life/2025/06/barron-trump-harvard-college-nyu-donald.html",
    "timestamp": "2025-06-05T17:03:58Z"
  },
  {
    "title": "Trump Reveals Why He Thinks Elon Musk Is Upset With His ‘Big, Beautiful’ Bill",
    "description": "Trump explained why he thinks Elon Musk is upset with him and his bill and hinted at the future of their friendship while in the Oval Office on Thursday.",
    "link": "https://dailycaller.com/2025/06/05/donald-trump-elon-musk-beautiful-bill-electric-vehicle-mandate/",
    "timestamp": "2025-06-05T17:03:33Z"
  },
  {
    "title": "Trump’s New “Supercharged” Travel Ban",
    "description": "On Wednesday, the Trump administration issued a new travel ban on foreigners, primarily targeting people from countries in Africa, the Middle East, and the Caribbean. Under the guise of protecting the United States against “foreign terrorists” and national se…",
    "link": "https://www.motherjones.com/politics/2025/06/trump-new-travel-ban-muslim-ban-supercharged/",
    "timestamp": "2025-06-05T17:02:46Z"
  },
  {
    "title": "Stephen Miller is Escalating His Immigration Crackdown With a New Travel Ban",
    "description": "Nationals from twelve countries are barred from entering the U.S. as the White House deputy chief of staff demands 3,000 deportations a day.",
    "link": "https://www.vanityfair.com/news/story/stephen-miller-is-escalating-his-immigration-crackdown-with-a-new-travel-ban",
    "timestamp": "2025-06-05T17:02:08Z"
  },
  {
    "title": "‘Incredible’ Never-Before-Seen Footage Of A UFO Captured In Greenland",
    "description": "UFO researcher Martin Kleist shared footage of a UFO he captured in Greenland which he says the Danish Defense Command won’t discuss with the United States government. Is this part of the reason why President Donald Trump wants to make Greenland a U.S. territ…",
    "link": "https://brobible.com/culture/article/never-before-seen-footage-ufo-greenland/",
    "timestamp": "2025-06-05T17:01:09Z"
  },
  {
    "title": "Trump Announces China Trade Talks, Tesla Stock Slumps: What's Driving Markets Thursday?",
    "description": "All three major U.S. indices were in the green in Thursday’s midday trading, reversing earlier losses after President Donald Trump said that he held a “very good phone call” with China’s President Xi Jinping and more trade talks with Beijing will take place “…",
    "link": "https://biztoc.com/x/d03a5a7335ba9bbe",
    "timestamp": "2025-06-05T17:01:05Z"
  },
  {
    "title": "Tesla sheds 8% as Trump says 'disappointed' in Musk",
    "description": "Tesla Inc. stock dropped by 8% on Thursday after US President Donald Trump said he was \"very disappointed\" in Tesla CEO Elon Musk over his criticism of the president's \"big, beautiful, bill.\"\"He knew ...",
    "link": "https://biztoc.com/x/251d9e9da7f6b856",
    "timestamp": "2025-06-05T17:00:57Z"
  },
  {
    "title": "Musk: Trump would have lost election without me",
    "description": "The quarrel between United States President Donald Trump and billionaire and entrepreneur Elon Musk continued on Thursday, as the tech mogul said Trump would have lost the election without him.\"Dems w...",
    "link": "https://biztoc.com/x/aeda309ed7985487",
    "timestamp": "2025-06-05T17:00:49Z"
  },
  {
    "title": "Trump may team with a tech company to create a database of Americans",
    "description": "A recent report indicated that Trump is partnering with the tech company Palantir",
    "link": "https://theweek.com/politics/tech-trump-palantir-database",
    "timestamp": "2025-06-05T17:00:45Z"
  },
  {
    "title": "Beatrix Von Storch on German Chancellor’s Visit: “Merz Has to Show his True Colors in Washington”",
    "description": "As President Trump is set to meet with German Chancellor Friedrich Merz today in the Oval Office, Alternative for Germany (AfD) Bundestag vice-chair Beatrix von Storch gave a speech hailing the rise of MAGA and the conservative, Christian “New West”: “Thank G…",
    "link": "https://www.thegatewaypundit.com/2025/06/beatrix-von-storch-german-chancellors-visit-merz-has/",
    "timestamp": "2025-06-05T17:00:42Z"
  },
  {
    "title": "Trump says Putin vowed retaliation for Kyiv strike",
    "description": "What happened\nPresident Donald Trump said he and Russian President Vladimir Putin had a \"good\" 75-minute phone conversation Wednesday, \"but not a conversation that will lead to immediate peace.\" Putin said, \"very strongly, that he will have to respond\" to Ukr…",
    "link": "https://biztoc.com/x/a230b7267564999b",
    "timestamp": "2025-06-05T17:00:32Z"
  },
  {
    "title": "Trump orders a probe into the Biden administration and its alleged autopen use",
    "description": "Trump alleges the Biden administration used a machine to sign key documents, as many presidents do. Biden says he made policy decisions himself: \"Any suggestion that I didn't is ridiculous and false.\"",
    "link": "https://www.npr.org/2025/06/05/nx-s1-5424313/trump-investigation-biden-autopen-cognitive-decline",
    "timestamp": "2025-06-05T17:00:32Z"
  },
  {
    "title": "Musk Pushes Back: EV Cuts Fine, Bill Is The Problem",
    "description": "Elon Musk fired back at President Donald Trump on X after being blamed for souring over cuts to electric vehicle incentives in the administration’s sweeping tax and spending bill. \nWhatever. Keep the EV/solar incentive cuts in the bill, even though no oil & g…",
    "link": "https://biztoc.com/x/3fdc0f03e1e354b2",
    "timestamp": "2025-06-05T17:00:23Z"
  },
  {
    "title": "President suggests Elon Musk is suffering from ‘Trump Derangement Syndrome’",
    "description": "\"[Elon Musk] and I had a great relationship,” Donald Trump said, referring to his former DOGE chief and campaign donor. “I don’t know if we will anymore.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-trump-derangement-syndrome-rcna211232",
    "timestamp": "2025-06-05T17:00:19Z"
  },
  {
    "title": "ELON: 'WHATEVER'...",
    "description": "PRESIDENT Donald Trump has revealed why Elon Musk is so enraged by the ‘big beautiful bill’ currently making its way through Congress. Musk has spent days criticizing the president̵…",
    "link": "https://www.the-sun.com/news/14407319/donald-trump-elon-musk-truth-beautiful-bill-relationship/",
    "timestamp": "2025-06-05T17:00:03Z"
  },
  {
    "title": "Escalation: White House Targets Harvard’s Foreign Student Pipeline",
    "description": "By defending antisemitism under the guise of free expression, pushing DEI ideology that divides more than it unites, and ignoring the siphoning of U.S. research and technology, the university isn’t standing up for American values—it’s actively eroding them.\nT…",
    "link": "https://legalinsurrection.com/2025/06/escalation-white-house-targets-harvards-foreign-student-pipeline/",
    "timestamp": "2025-06-05T17:00:00Z"
  },
  {
    "title": "Trump Proclaims Elon Musk Has 'Trump Derangement Syndrome' Following 'Big, Beautiful Bill' Rant: 'They Become Hostile'",
    "description": "President Donald Trump has alleged that billionaire Elon Musk has \"Trump Derangement Syndrome\" after the Tesla CEO harshly criticized the GOP spending bill.",
    "link": "https://www.ibtimes.com/trump-proclaims-elon-musk-has-trump-derangement-syndrome-following-big-beautiful-bill-rant-3775211",
    "timestamp": "2025-06-05T16:59:11Z"
  },
  {
    "title": "Tesla Stock Plunges 8% As Trump Suggests Musk Has ‘Trump Derangement Syndrome’",
    "description": "Musk has called to “kill” Trump’s policy bill, criticizing the legislation as “massive, outrageous” and “pork-filled.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/06/05/tesla-stock-plunges-8-as-trump-suggests-musk-has-trump-derangement-syndrome/",
    "timestamp": "2025-06-05T16:58:41Z"
  },
  {
    "title": "Joni Ernst introduces DOGE bill that could save taxpayers eye-popping amount",
    "description": "'Billions of dollars in overpayments are sent out the door because Washington is asleep at the wheel'",
    "link": "https://www.wnd.com/2025/06/joni-ernst-introduces-doge-bill-that-could-save-taxpayers-eye-popping-amount/",
    "timestamp": "2025-06-05T16:58:16Z"
  },
  {
    "title": "Trump threatens to impose sanctions on Ukraine",
    "description": "Donald Trump has threatened to impose sanctions on Ukraine as well as Russia if the two sides fail to reach a peace agreement.",
    "link": "https://uk.news.yahoo.com/trump-threatens-impose-sanctions-ukraine-164831342.html",
    "timestamp": "2025-06-05T16:57:30Z"
  },
  {
    "title": "The Lesser of Two Evils: The Burning of Children Instead of Paper",
    "description": "Our apologies, good friends, for the fracture of good order, the burning of paper instead of children, the angering of the orderlies in the front parlor of the charnel house. We could not, so help us God, do otherwise. For we are sick at heart, our hearts giv…",
    "link": "https://www.antiwar.com/blog/2025/06/05/the-lesser-of-two-evils-the-burning-of-children-instead-of-paper/",
    "timestamp": "2025-06-05T16:57:09Z"
  },
  {
    "title": "Trump says he’s ‘disappointed’ with Musk after former backer turns on the Republican tax bill",
    "description": "WASHINGTON (AP) — The breakup between the president of the United States and the world’s richest man is unfurling much like their relationship started — rapidly, intensely and very publicly. As President Donald Trump sat in the Oval Office on Thursday with Ge…",
    "link": "https://financialpost.com/pmn/trump-says-hes-disappointed-with-musk-after-former-backer-turns-on-the-republican-tax-bill",
    "timestamp": "2025-06-05T16:55:41Z"
  },
  {
    "title": "The only ‘Made in America’ smartphone maker has a message for Apple about manufacturing in the Trump tariff era",
    "description": "Purism, which makes the Liberty Phone in Carlsbad, Calif. using American components, is an anomaly in an industry where manufacturing and supply chains are...",
    "link": "https://finance.yahoo.com/news/only-made-america-smartphone-maker-165540350.html",
    "timestamp": "2025-06-05T16:55:40Z"
  },
  {
    "title": "'Very disappointed in Elon': Trump, Musk spar amid continued criticism of 'big beautiful' megabill (Aaron Pellish/Politico)",
    "description": "Aaron Pellish / Politico:\n‘Very disappointed in Elon’: Trump, Musk spar amid continued criticism of ‘big beautiful’ megabill  —  Musk has been on a three-day rampage against Republicans' reconcilliation package.  —  President Donald Trump publicly chastised E…",
    "link": "https://www.memeorandum.com/250605/p74",
    "timestamp": "2025-06-05T16:55:00Z"
  },
  {
    "title": "Trump and Xi hold long-awaited call, 'focused almost entirely on trade'",
    "description": "The US president posted on Truth Social that a phone call with his Chinese counterpart lasted an hour and a half and \"focused almost entirely on trade\".",
    "link": "https://www.abc.net.au/news/2025-06-06/trump-and-xi-hold-phonecall-on-tariffs/105383532",
    "timestamp": "2025-06-05T16:54:35Z"
  },
  {
    "title": "Trump Says Germany Being Liberated From Nazis Was “Not a Great Day”",
    "description": "Does Donald Trump think that German Chancellor Friedrich Merz is a Nazi? \r\nDuring a press conference with Merz Thursday, Trump seemed confused when the foreign leader brought up the anniversary of the D-Day invasion, when U.S. troops landed on the beaches in …",
    "link": "https://newrepublic.com/post/196201/donald-trump-germany-d-day-not-great",
    "timestamp": "2025-06-05T16:54:29Z"
  },
  {
    "title": "GOP Senator Ridiculed for Insisting Americans 'Transitioning From Medicaid' Will Get Insurance From Employers: 'Do Employers Know?'",
    "description": "A Republican Senator is being ridiculed online for stating that the millions of people that will be removed from Medicaid if President Donald Trump's \"one big, beautiful bill\" passes will then transition to employer-provided healthcare.",
    "link": "https://www.ibtimes.com/gop-senator-ridiculed-insisting-americans-transitioning-medicaid-will-get-insurance-employers-3775208",
    "timestamp": "2025-06-05T16:54:12Z"
  },
  {
    "title": "GOP Senator Ridiculed for Insisting Americans 'Transitioning From Medicaid' Will Get Insurance From Employers: 'Do Employers Know?'",
    "description": "A Republican Senator is being ridiculed online for stating that the millions of people that will be removed from Medicaid if President Donald Trump's \"one big, beautiful bill\" passes will then transition to employer-provided healthcare.",
    "link": "https://www.medicaldaily.com/gop-senator-ridiculed-insisting-americans-transitioning-medicaid-will-get-insurance-employers-473593",
    "timestamp": "2025-06-05T16:54:11Z"
  },
  {
    "title": "The free filing IRS software TurboTax wanted to kill is now open source for all Americans - know all details",
    "description": "IRS Direct File software just took a bold step forward—its code is now open source on GitHub, even as the future of the free tax filing tool faces serious threats from TurboTax maker Intuit and Donald Trump’s new budget bill. The program, used by over 300,000…",
    "link": "https://economictimes.indiatimes.com/news/international/us/the-free-filing-irs-software-turbotax-wanted-to-kill-is-now-open-source-for-all-americans-know-all-details/articleshow/121654576.cms",
    "timestamp": "2025-06-05T16:53:07Z"
  },
  {
    "title": "‘Ditch the MOUNTAIN of DISGUSTING PORK’: Elon Musk Fires Back at Trump After Oval Office Diss",
    "description": "The feud between President Donald Trump and Elon Musk is heating up, as the pair fired shots at each other on Thursday afternoon.\nThe post ‘Ditch the MOUNTAIN of DISGUSTING PORK’: Elon Musk Fires Back at Trump After Oval Office Diss first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/ditch-the-mountain-of-disgusting-pork-elon-musk-fires-back-at-trump-after-oval-office-diss/",
    "timestamp": "2025-06-05T16:53:01Z"
  },
  {
    "title": "Trump Says He May Let Russia, Ukraine ‘Fight for a Little While’",
    "description": "US President Donald Trump said it might be necessary to let Ukraine and Russia “fight for a little while” before brokering a peace deal and suggested he might be willing to implement fresh sanctions on both countries if he determined the conflict wasn’t going…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-he-may-let-russia-ukraine-fight-for-a-little-while",
    "timestamp": "2025-06-05T16:52:44Z"
  },
  {
    "title": "Donald Trump Says Elon Musk Has ‘Trump Derangement Syndrome’ as Rift Grows: ‘I Don’t Know If We Will’ Have a ‘Great Relationship’ Anymore",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c6629e5e-bb8d-4c81-a4bc-7216f2cb696f",
    "timestamp": "2025-06-05T16:52:33Z"
  },
  {
    "title": "Donald Trump Says Elon Musk Has ‘Trump Derangement Syndrome’ as Rift Grows: ‘I Don’t Know If We Will’ Have a ‘Great Relationship’ Anymore",
    "description": "The partnership between tech multibillionaire Elon Musk and President Trump appears to have hit a new breaking point. Trump on Thursday commented on Musk and his criticism of the president’s “big beautiful” spending bill after Musk called the “pork-filled Con…",
    "link": "https://variety.com/2025/digital/news/donald-trump-elon-musk-trump-derangement-syndrome-1236418993/",
    "timestamp": "2025-06-05T16:52:33Z"
  },
  {
    "title": "Trump says Putin vowed retaliation for Kyiv strike",
    "description": "The Russian president intends to respond to Ukraine's weekend drone strikes on Moscow's warplanes",
    "link": "https://theweek.com/world-news/trump-putin-retaliation-kyiv-drone-strike-zelenskyy",
    "timestamp": "2025-06-05T16:52:26Z"
  },
  {
    "title": "Trump learns lessons from first ‘Muslim ban’ but raises new questions",
    "description": "In banning most travel to the United States by citizens of 12 countries, President Donald Trump is fine-tuning a playbook popular with his base, even as his singling out of particular nations left many scratching their heads. Trump rose to power vowing a hars…",
    "link": "https://www.digitaljournal.com/world/trump-learns-lessons-from-first-muslim-ban-but-raises-new-questions/article",
    "timestamp": "2025-06-05T16:52:20Z"
  },
  {
    "title": "Trump alleges that, under Biden, ‘whoever used the autopen was the president’",
    "description": "Biden called the accusations \"ridiculous and false.”",
    "link": "https://www.bostonherald.com/2025/06/05/congress-biden-autopen/",
    "timestamp": "2025-06-05T16:51:55Z"
  },
  {
    "title": "Donald Trump Says He's 'Very Disappointed' In Elon Musk As Rift Grows",
    "description": "The president and the world's richest man are growing through a very public breakup.",
    "link": "https://www.huffpost.com/entry/donald-trump-elon-musk-breakup_n_6841c198e4b0daf9137c7772",
    "timestamp": "2025-06-05T16:51:27Z"
  },
  {
    "title": "Republican Lawmaker Insists His Party is 'Stuck' Trying to Pass Trump's 'Big, Beautiful Bill' Despite Being Against Raising the Deficit",
    "description": "Texas Rep. Pete Sessions admitted Republicans feel forced to back Donald Trump's costly reconciliation bill despite concerns about raising the deficit.",
    "link": "https://www.ibtimes.com/republican-lawmaker-insists-his-party-stuck-trying-pass-trumps-big-beautiful-bill-despite-3775206",
    "timestamp": "2025-06-05T16:50:12Z"
  },
  {
    "title": "‘I Don’t Have Any Friends!’ Trump’s Deputy FBI Director Bongino Reveals More About His Personal Life Since Taking the Job",
    "description": "FBI Deputy Director Dan Bongino share more details Wednesday about how his personal life has been affected by the new job.\nThe post ‘I Don’t Have Any Friends!’ Trump’s Deputy FBI Director Bongino Reveals More About His Personal Life Since Taking the Job first…",
    "link": "https://www.mediaite.com/media/tv/i-dont-have-any-friends-trumps-deputy-fbi-director-bongino-reveals-more-about-his-personal-life-since-taking-the-job/",
    "timestamp": "2025-06-05T16:50:09Z"
  },
  {
    "title": "Trump Finally Weighs in on Elon Musk Rift, Says He’s ‘Very Disappointed’ With Billionaire’s Criticism | Video",
    "description": "The president speaks out after the former DOGE boss has been ripping the \"One Big Beautiful Bill\" on X for days\nThe post Trump Finally Weighs in on Elon Musk Rift, Says He’s ‘Very Disappointed’ With Billionaire’s Criticism | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-finally-weighs-in-on-elon-musk-rift-says-hes-very-disappointed-with-billionaires-criticism-video/",
    "timestamp": "2025-06-05T16:50:04Z"
  },
  {
    "title": "Stock Market Today: Market rises on China talks",
    "description": "In This Article:\nStock Market Today: Market rises on China talks originally appeared on TheStreet.\nUpdated: 11:41 a.m. ET.\nStocks reversed early losses after President Donald Trump and Chinese President Xi Jinping spoke for more than 90 minutes Thursday morni…",
    "link": "https://biztoc.com/x/760f31926a102b07",
    "timestamp": "2025-06-05T16:50:01Z"
  },
  {
    "title": "Tariffs prompt record plunge in US imports, cutting trade deficit",
    "description": "Tariffs prompt record plunge in US imports\nGoods brought into the US plunged by 20% in April, recording their largest ever monthly drop in the face of a wave of tariffs unleashed by US President Donald Trump.\nThe retreat reflects the abrupt hit to trade, afte…",
    "link": "https://biztoc.com/x/d55e0184b5a6e855",
    "timestamp": "2025-06-05T16:49:44Z"
  },
  {
    "title": "Elon Musk Uses Donald Trump's Own Words Against Him",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk has been using President Donald Trump's past criticisms of raising the debt ceiling against him, as he continues to attack the \"big, beautiful bill.\"\nThe former Trump ally shared several posts on X f…",
    "link": "https://biztoc.com/x/179b130f3118ccea",
    "timestamp": "2025-06-05T16:49:33Z"
  },
  {
    "title": "Tesla sheds 7% as Trump says 'disappointed' in Musk",
    "description": "Tesla Inc. stock dropped by 7% on Thursday after US President Donald Trump said he was \"very disappointed\" in Tesla CEO Elon Musk over his criticism of the president's \"big, beautiful, bill.\"\"He knew ...",
    "link": "https://biztoc.com/x/2cf6ab56d4f4c2e7",
    "timestamp": "2025-06-05T16:49:27Z"
  },
  {
    "title": "Trump says he is 'very disappointed' in Elon Musk's attacks on the GOP policy bill",
    "description": "WASHINGTON — President Donald Trump on Thursday sharply criticized Elon Musk after the Tesla CEO criticized the House-passed GOP policy bill as an \"abomination.\"",
    "link": "https://biztoc.com/x/b9ea09e1f111d026",
    "timestamp": "2025-06-05T16:49:12Z"
  },
  {
    "title": "‘I’m Disappointed’: Trump Claps Back at Elon for Trashing His Agenda",
    "description": "Donald Trump clapped back at Elon Musk as the world's richest man continues to slam the president's legislative agenda.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-slams-elon-musk-dispute-spending-bill-1235356539/",
    "timestamp": "2025-06-05T16:48:52Z"
  },
  {
    "title": "Why Companies Using AI Should Increase Prices",
    "description": "Also in the Forbes CIO newsletter: How to upgrade tech at Gillette Stadium, Meta deal fuels the nuclear power boom, federal government reshuffles AI research entity.",
    "link": "https://www.forbes.com/sites/cio/2025/06/05/why-companies-using-ai-should-increase-prices/",
    "timestamp": "2025-06-05T16:48:33Z"
  },
  {
    "title": "Trump 'disappointed' with Musk after billionaire turned on his 'big, beautiful bill'",
    "description": "President Donald Trump has said he is \"disappointed\" with Elon Musk after the billionaire publicly criticised his signature tax bill.",
    "link": "https://news.sky.com/story/donald-trump-disappointed-with-elon-musk-after-he-turned-on-his-big-beautiful-bill-13379714",
    "timestamp": "2025-06-05T16:48:00Z"
  },
  {
    "title": "Trump taps senior Air Force commander for European Command",
    "description": "President Donald Trump is tapping an Air Force fighter pilot with extensive experience as a commander in the Middle East to be the next head of U.S. European Command",
    "link": "https://abcnews.go.com/US/wireStory/trump-taps-senior-air-force-commander-european-command-122542896",
    "timestamp": "2025-06-05T16:46:51Z"
  },
  {
    "title": "‘Premeditated genocide’: Brazil’s Lula slams Israel over Gaza war",
    "description": "Lula criticises Israel in Paris, as German FM voices rare criticism of onslaught in Gaza and West Bank settlements.",
    "link": "https://www.aljazeera.com/news/2025/6/5/premeditated-genocide-brazils-lula-slams-israel-over-gaza",
    "timestamp": "2025-06-05T16:46:22Z"
  },
  {
    "title": "Jimmy Kimmel Gushes Over Musk vs. Trump: POTUS 'Now Has 2 Foreigners Who Won’t Sleep With Him'",
    "description": "Disney-ABC late-night host Jimmy Kimmel is overjoyed that Elon Musk has taken swipes at President Donald Trump after the SpaceX chief stepped back from his temporary assignment in the Trump administration.",
    "link": "https://www.breitbart.com/entertainment/2025/06/05/jimmy-kimmel-gushes-over-musk-vs-trump-potus-now-has-2-foreigners-who-wont-sleep-with-him/",
    "timestamp": "2025-06-05T16:46:22Z"
  },
  {
    "title": "MTG Flip-Flops Again on Budget Bill She Didn’t Even Read",
    "description": "DOGE Committee Chair Marjorie Taylor Greene is apparently “proud” to have voted for the “big, beautiful bill” that she trashed just Tuesday.\r\nDuring an exchange with Representative Robert Garcia in Wednesday’s House Subcommittee on Delivering on Government Ef…",
    "link": "https://newrepublic.com/post/196186/marjorie-taylor-greene-flips-again-budget-bill",
    "timestamp": "2025-06-05T16:46:03Z"
  },
  {
    "title": "‘It’s In My Brain’: Trump Pressed By Reporters On Deadline For More Russian Sanctions As Ukraine Fighting Heats Up",
    "description": "President Donald Trump revealed he has a date in his \"brain\" for when he will step in and sanction Russia in an effort to bring its war with Ukraine to an end.\nThe post ‘It’s In My Brain’: Trump Pressed By Reporters On Deadline For More Russian Sanctions As U…",
    "link": "https://www.mediaite.com/media/news/its-in-my-brain-trump-pressed-by-reporters-on-deadline-for-more-russian-sanctions-as-ukraine-fighting-heats-up/",
    "timestamp": "2025-06-05T16:45:59Z"
  },
  {
    "title": "Why Did Yulissa Leave 'Love Island USA' Season 7? Her Exit, Explained",
    "description": "In one of the quickest (and most unexplained) exits in 'Love Island USA' history, Yulissa Escobar disappeared from Season 7 after one episode. Here's why.",
    "link": "https://www.elitedaily.com/entertainment/yulissa-love-island-usa-season-7-why-exit-explained",
    "timestamp": "2025-06-05T16:45:13Z"
  },
  {
    "title": "Trump says 'very disappointed' with Elon Musk after billionaire's ire over President's ‘big beautiful bill’",
    "description": "Donald Trump expressed disappointment in Elon Musk after Musk criticized a tax bill. Trump claimed he had helped Musk. Musk refuted Trump's claim about prior knowledge of the bill. Trump suggested Musk suffers from 'Trump derangement syndrome'. Musk mocked th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-very-disappointed-with-elon-musk-after-billionaires-ire-over-presidents-big-beautiful-bill/articleshow/121655129.cms",
    "timestamp": "2025-06-05T16:44:12Z"
  },
  {
    "title": "WATCH LIVE: Trump holds roundtable discussion with Fraternal Order of Police",
    "description": "Turning to Merz, Trump said, “It’s not your fault.” Of migration under Merz’s predecessor, former Chancellor Angela Merkel, Trump added: “I told her it shouldn’t have happened.”",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-holds-roundtable-discussion-with-fraternal-order-of-police",
    "timestamp": "2025-06-05T16:44:12Z"
  },
  {
    "title": "Elon Musk Uses Donald Trump's Own Words Against Him",
    "description": "Elon Musk has been using President Donald Trump's past criticism of raising the debt ceiling and balancing the deficit against him, as he continues to attack the \"big, beautiful bill.\"",
    "link": "https://www.newsweek.com/elon-musk-uses-donald-trumps-own-words-against-him-2081529",
    "timestamp": "2025-06-05T16:44:11Z"
  },
  {
    "title": "Trump Downplays Musk’s Role in Election Win: I Would Have Won ‘Easily Anyway’",
    "description": "After he bragged about his administration's work to secure the country's southern border, he said he would have won Pennsylvania without Musk's support.\nThe post Trump Downplays Musk’s Role in Election Win: I Would Have Won ‘Easily Anyway’ first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/trump-downplays-musks-role-in-election-win-i-would-have-won-easily-anyway/",
    "timestamp": "2025-06-05T16:43:58Z"
  },
  {
    "title": "Exclusive — White House on Elon Musk’s ‘Kill Bill’ Obsession: He's Focused on What He Can Do for His Company",
    "description": "Elon Musk's criticisms of President Donald Trump's Big Beautiful Bill are rooted in his allegiance to his companies, White House Principal Deputy Press Secretary Harrison Fields told \"The Alex Marlow Show.\"\nThe post Exclusive — White House on Elon Musk’s ‘Kil…",
    "link": "https://www.breitbart.com/politics/2025/06/05/exclusive-white-house-on-elon-musks-kill-bill-obsession-hes-focused-on-what-he-can-do-for-his-company/",
    "timestamp": "2025-06-05T16:43:25Z"
  },
  {
    "title": "Bill Clinton Tells ‘The View’ He “Wanted” To Become First Gentleman When Hillary Clinton Ran For President: “The Only Political Job I Ever Wanted That I Didn’t Get”",
    "description": "The View host Joy Behar told the former president, \"We wanted you to have it.\"",
    "link": "https://decider.com/2025/06/05/bill-clinton-view-become-first-gentleman-hillary-clinton-president/",
    "timestamp": "2025-06-05T16:41:49Z"
  },
  {
    "title": "Pentagon diverting key anti-drone technology from Ukraine to US forces in the Middle East | CNN Politics",
    "description": "The Pentagon notified Congress last week that it will be diverting critical anti-drone technology that had been allocated for Ukraine to US Air Force units in the Middle East, according to correspondence obtained by CNN and people familiar with the matter.",
    "link": "https://www.cnn.com/2025/06/05/politics/pentagon-diverting-anti-drone-technology-ukraine",
    "timestamp": "2025-06-05T16:41:35Z"
  },
  {
    "title": "Trump says it might be better to let Ukraine and Russia 'fight for a while'",
    "description": "WASHINGTON (AP) — President Donald Trump said Thursday that it might be better to let Ukraine and Russia “fight for a while” before pulling them apart and pursuing peace.",
    "link": "https://apnews.com/article/germany-merz-trump-washington-ukraine-trade-89ae8e553a0f8f44f9557f351adbacd0",
    "timestamp": "2025-06-05T16:41:00Z"
  },
  {
    "title": "Executive director of Skadden’s fellowship foundation resigns following firm’s pro bono deal with Trump",
    "description": "The executive director of the Skadden Foundation, a nonprofit entity that manages Skadden, Arps, Slate, Meagher & Flom’s public interest fellowship program, has resigned after the law firm reached a pro bono deal with President Donald Trump that affects its w…",
    "link": "https://www.abajournal.com/news/article/executive-director-of-skaddens-fellowship-foundation-resigns-following-firms-pro-bono-deal-with-trump",
    "timestamp": "2025-06-05T16:41:00Z"
  },
  {
    "title": "Tesla Stock Drops Over 5% As Trump Suggests Musk Has ‘Trump Derangement Syndrome’",
    "description": "Musk has called to “kill” Trump’s policy bill, criticizing the legislation as “massive, outrageous” and “pork-filled.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/06/05/tesla-stock-drops-over-5-as-trump-suggests-musk-has-trump-derangement-syndrome/",
    "timestamp": "2025-06-05T16:40:46Z"
  },
  {
    "title": "Longtime Tesla Supporter Criticizes Elon Musk for Attacking Trump's Big Beautiful Bill",
    "description": "Ross Gerber, a prominent Tesla investor and longtime supporter, recently took to social media to criticize Elon Musk for \"attacking\" Donald Trump after previously helping him win the election. Gerber sarcastically quipped, \"This should work out well for Tesla…",
    "link": "https://www.breitbart.com/tech/2025/06/05/longtime-tesla-supporter-criticizes-elon-musk-for-attacking-trumps-big-beautiful-bill/",
    "timestamp": "2025-06-05T16:40:44Z"
  },
  {
    "title": "Trump Travel Ban Punishes Victims of the U.S. War Machine",
    "description": "Trump’s latest travel ban hits Afghans who aided the U.S. in its failed 20-year war.\nThe post Trump Travel Ban Punishes Victims of the U.S. War Machine appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/05/trump-travel-ban-afghanistan/",
    "timestamp": "2025-06-05T16:40:15Z"
  },
  {
    "title": "Donald Trump's Controversial Pardons Make Some Republicans Squirm",
    "description": "\"You got to be pretty careful,\" one Republican senator said of the president's decisions to grant clemency to white-collar criminals.",
    "link": "https://www.huffpost.com/entry/donald-trump-pardons_n_68418f1fe4b00b2e94c60402",
    "timestamp": "2025-06-05T16:40:12Z"
  },
  {
    "title": "Musk contradicts Trump, says he never saw the bill",
    "description": "Billionaire entrepreneur and SpaceX and Tesla CEO Elon Musk dismissed United States President Donald Trump's remarks he \"knew the inner workings\" of the tax bill as \"false,\" adding the bill was \"never...",
    "link": "https://biztoc.com/x/749d634b49f74943",
    "timestamp": "2025-06-05T16:38:32Z"
  },
  {
    "title": "Governments try to understand Trump’s latest travel ban before it takes effect Monday",
    "description": "The new ban targets Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.",
    "link": "https://www.pbs.org/newshour/politics/governments-try-to-understand-trumps-latest-travel-ban-before-it-takes-effect-monday",
    "timestamp": "2025-06-05T16:38:21Z"
  },
  {
    "title": "Trump On Musk: ‘I Don’t Know If We’ll Still Be Friends’",
    "description": "President Donald Trump addressed his relationship with Elon Musk on Wednesday, suggesting recent policy disagreements and personnel clashes may have soured their previously warm ties. \n“I’ve always liked Elon,” Trump said during a bilateral meeting with Germa…",
    "link": "https://biztoc.com/x/24993233b4b09b44",
    "timestamp": "2025-06-05T16:38:20Z"
  },
  {
    "title": "Trump 'disappointed' with Musk's attacks on budget bill",
    "description": "Musk wrote \"whatever\" in a social media post shortly after the comments.",
    "link": "https://www.bbc.com/news/articles/c5yg98rl717o",
    "timestamp": "2025-06-05T16:38:19Z"
  },
  {
    "title": "‘Destroy the Ring’: Trump’s Palantir deal alarms Hill Republicans",
    "description": "The News\nRepublican privacy advocates in Congress are criticizing the Trump administration’s work with the tech giant Palantir to analyze what could become a massive pool of government data on Americans.\nPresident Donald Trump signed an order in March that di…",
    "link": "https://biztoc.com/x/dd9356d765020bad",
    "timestamp": "2025-06-05T16:38:12Z"
  },
  {
    "title": "FBI Asks Public for Tips on Medical Institutions Providing Gender-Affirming Surgeries on Kids",
    "description": "The Federal Bureau of Investigation (FBI) is asking the public for tips on medical institutions performing gender-affirming care on children.",
    "link": "https://www.medicaldaily.com/fbi-asks-public-tips-medical-institutions-providing-gender-affirming-surgeries-kids-473585",
    "timestamp": "2025-06-05T16:37:26Z"
  },
  {
    "title": "George Clooney claims it's frightening time to be in news business because of Trump",
    "description": "Hollywood star George Clooney expressed his concerns about the Trump administration's \"attack\" on the media during an interview on Wednesday.",
    "link": "https://www.foxnews.com/media/george-clooney-claims-its-frightening-time-news-business-because-trump",
    "timestamp": "2025-06-05T16:36:17Z"
  },
  {
    "title": "Xi Jinping Invites Trump to Visit China",
    "description": "According to the media report, the US president expressed sincere gratitudeBEIJING, June 5. /TASS/. Chinese President Xi Jinping has invited US leader Donald Trump to visit China, China Central Television reports. According to the broadcaster, in a phone call…",
    "link": "https://freerepublic.com/focus/f-news/4321157/posts",
    "timestamp": "2025-06-05T16:35:22Z"
  },
  {
    "title": "‘The View’: James Patterson Takes Less Than a Second to Confirm Trump Cheats at Golf",
    "description": "Meanwhile, Bill Clinton goes silent on the question\nThe post ‘The View’: James Patterson Takes Less Than a Second to Confirm Trump Cheats at Golf appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-cheats-at-golf-james-patterson-bill-clinton-the-view/",
    "timestamp": "2025-06-05T16:34:08Z"
  },
  {
    "title": "Trump-Musk rift widens over electric vehicle tax credit cut",
    "description": "Donald Trump publicly criticised Elon Musk over his opposition to a Republican spending bill that would cut EV tax credits. Tesla shares dipped following the remarks",
    "link": "https://www.thehindubusinessline.com/news/world/trump-musk-rift-widens-over-electric-vehicle-tax-credit-cut/article69662233.ece",
    "timestamp": "2025-06-05T16:34:02Z"
  },
  {
    "title": "‘A Significant Impact’: Trump’s Big, Beautiful Bill To Double Down On Border Security",
    "description": "Trump's \"big, beautiful bill\" will bolster the security apparatus established along the Mexico border, Sen. Roger Marshall and law enforcement officials say.",
    "link": "https://dailycaller.com/2025/06/05/trumps-big-bill-to-boost-border-security/",
    "timestamp": "2025-06-05T16:32:50Z"
  }
]