[
  {
    "title": "The Vatican asked Pope Francis funeral attendees to wear all black. Trump wore a blue suit - Fortune",
    "description": "The Vatican asked Pope Francis funeral attendees to wear all black. Trump wore a blue suitFortune Who Is Kielce Gussie, the American Who Did the First Reading at Pope Francis’ Funeral?The New York Times Biden relegated to back of world leaders section at pope…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177163747",
    "timestamp": "2025-04-27T00:52:41Z"
  },
  {
    "title": "White House Correspondents’ Dinner: ‘We’ve Been Tested, Attacked’ and Put Through ‘the Ringer,’ Eugene Daniels Says",
    "description": "The White House Correspondents’ Dinner “is going to feel a little different this year,” the organization’s president acknowledged Saturday at the outset of the annual gathering of the White House press corps. Eugene Daniels, White House Correspondents Assn. p…",
    "link": "https://variety.com/2025/tv/news/white-house-correspondents-tested-attacked-eugene-daniels-1236379310/",
    "timestamp": "2025-04-27T00:52:08Z"
  },
  {
    "title": "We Remember: A Message from a Proud America First Patriot",
    "description": "I saw something on social media the other day that really hit home. I’m not sure who wrote the original, but it stuck with me, and it inspired me to take that message, build on it, and put into words what I believe so many of us are feeling right now. This is…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313488/posts",
    "timestamp": "2025-04-27T00:51:39Z"
  },
  {
    "title": "USDA Brooke Rollins Ensures Illegal Aliens Do Not Receive Federal Benefits (Food Stamps)",
    "description": "(Washington, D.C., April 24, 2025) – Today, at the direction of U.S. Secretary of Agriculture Brooke L. Rollins, Acting Deputy Under Secretary for Food, Nutrition, and Consumer Services John Walk issued guidance to all State agencies directing them to enhance…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313487/posts",
    "timestamp": "2025-04-27T00:50:33Z"
  },
  {
    "title": "New Poll Shows Voters Are Tired of the Anti-Trump ‘Resistance’ – Even in Blue California",
    "description": "Ever since President Trump has been back in office, Democrats have been working hard to impede his success, not that you can blame them. They realize they have nothing to offer US citizens, and they have concluded that all they can do as a party is delay Trum…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313486/posts",
    "timestamp": "2025-04-27T00:47:52Z"
  },
  {
    "title": "Biden’s all smiles as he poses for selfies with mourners as he, wife Jill arrive for Pope Francis’ funeral",
    "description": "Former President Joe Biden and wife Jill Biden arrived at Saint Peter’s Square in Vatican City Saturday morning for Pope Francis’ funeral. The 82-year-old, who met Pope Francis three times as vice president, held onto his wife and a priest as he cautiously wa…",
    "link": "https://freerepublic.com/focus/f-news/4313485/posts",
    "timestamp": "2025-04-27T00:46:15Z"
  },
  {
    "title": "The Dems’ far-left agenda is just starting — and the worst is yet to come",
    "description": "To most Americans, the big problem with the Democratic Party is that it has moved too far left in recent years. If you’re among those who believe that, brace yourself. The worst is yet to come.",
    "link": "https://nypost.com/2025/04/26/opinion/the-dems-far-left-agenda-is-just-starting-and-the-worst-is-yet-to-come/",
    "timestamp": "2025-04-27T00:45:39Z"
  },
  {
    "title": "Canadian leaders make closing pitches in campaign upended by Trump",
    "description": "A victory for Mark Carney's Liberal Party, which looked like a long shot earlier this year, would mark one of the most dramatic turnarounds in Canadian political history.",
    "link": "https://www.japantimes.co.jp/news/2025/04/27/world/politics/canada-leaders-closing-pitches/",
    "timestamp": "2025-04-27T00:44:00Z"
  },
  {
    "title": "‘Abused her Position’: MSNBC Contributor Says Arrest of Judge Dugan Could Actually ‘Help Republicans’",
    "description": "Buck said that if the charges are accurate, arresting Judge Dugan may help Trump, because she does appear to have obstructing justice.\nThe post ‘Abused her Position’: MSNBC Contributor Says Arrest of Judge Dugan Could Actually ‘Help Republicans’ first appeare…",
    "link": "https://www.mediaite.com/politics/abused-her-position-msnbc-contributor-says-arrest-of-judge-dugan-could-actually-help-republicans/",
    "timestamp": "2025-04-27T00:43:06Z"
  },
  {
    "title": "Family members of North Korea abductees hold Tokyo campaign to seek their return",
    "description": "Meanwhile, in Washington, 17 members of U.S. Congress sent a letter to President Donald Trump urging him to \"prioritize\" the return of the Japanese abductees.",
    "link": "https://www.japantimes.co.jp/news/2025/04/27/japan/japan-north-korea-abduction-family/",
    "timestamp": "2025-04-27T00:43:00Z"
  },
  {
    "title": "Donald Trump Roundly Criticized for Wearing Blue Suit to Pope Francis’ Funeral",
    "description": "Fortune reported the Vatican asked attendees to wear all black\nThe post Donald Trump Roundly Criticized for Wearing Blue Suit to Pope Francis’ Funeral appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-criticized-wearing-blue-suit-pope-francis-funeral/",
    "timestamp": "2025-04-27T00:41:32Z"
  },
  {
    "title": "Trump’s 'Bloodbath' in the DOJ's Civil Rights Division Is Exactly What Voters Demanded",
    "description": "The media meltdown over the Trump administration’s restructuring of the Justice Department’s Civil Rights Division tells you all you need to know: it’s a necessary and overdue correction. NBC News and other outlets are breathlessly reporting that Trump’s team…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313482/posts",
    "timestamp": "2025-04-27T00:41:09Z"
  },
  {
    "title": "Trump’s top memecoin holders’ dinner is an “impeachable offense,” says Sen. Ossoff",
    "description": "Democratic U.S. senator for Georgia Jon Ossoff said President Donald Trump’s invitation to top meme coin holders constitutes an “impeachable offense.” Answering a question from a town hall meeting attendee on Friday, Ossoff said: “He is granting audiences to …",
    "link": "https://cryptoslate.com/trumps-top-memecoin-holders-dinner-is-an-impeachable-offense-says-sen-ossoff/",
    "timestamp": "2025-04-27T00:33:59Z"
  },
  {
    "title": "‘This is a Clown Show!’ Top Dem Aide on MSNBC Slams Bondi and Trump Over Judge’s Arrest: ‘It’s About Intimidation’",
    "description": "The administration is attempting to intimidate and silence judges, said the former aide to Hakeem Jeffries and Barack Obama on MSNBC Saturday.\nThe post ‘This is a Clown Show!’ Top Dem Aide on MSNBC Slams Bondi and Trump Over Judge’s Arrest: ‘It’s About Intimi…",
    "link": "https://www.mediaite.com/politics/this-is-a-clown-show-top-dem-aide-on-msnbc-slams-bondi-and-trump-over-judges-arrest-its-about-intimidation/",
    "timestamp": "2025-04-27T00:31:07Z"
  },
  {
    "title": "'Might be the big one': Trump accused of 'freezing' out future GOP presidential hopefuls",
    "description": "Donald Trump is freezing out future GOP presidential hopefuls as he goes full force in his efforts to be elected to an unconstitutional third term, MSNBC pundits said on Saturday.Former Republican Rep. Carlos Curbelo (FL) appeared on MSNBC over the weekend, a…",
    "link": "https://www.rawstory.com/this-might-be-the-big-one-trump-accused-of-freezing-out/",
    "timestamp": "2025-04-27T00:30:59Z"
  },
  {
    "title": "Trump won these independent voters. Now some are souring on his second term. (Hannah Knowles/Washington Post)",
    "description": "Hannah Knowles / Washington Post:\nTrump won these independent voters.  Now some are souring on his second term.  —  Unaffiliated voters are starting to turn against Trump and his disruptive agenda, demonstrating political risks for the president and his party…",
    "link": "https://www.memeorandum.com/250426/p52",
    "timestamp": "2025-04-27T00:30:02Z"
  },
  {
    "title": "Analysts say it's 'highly unlikely' Xi called Trump over tariffs",
    "description": "As the world watches tariff brinkmanship unfold between the US and China, analysts cast doubt on the US president's claim that the Chinese leader called him.",
    "link": "https://www.abc.net.au/news/2025-04-27/unlikely-china-president-xi-called-us-president-trump/105219448",
    "timestamp": "2025-04-27T00:22:59Z"
  },
  {
    "title": "Trump Says US Is 'Very Close' to Trade Deal With Japan",
    "description": "President Donald Trump suggested another delay to his higher so-called “reciprocal” tariffs was unlikely, raising pressure on nations to negotiate trade deals with his administration.\nTrump told reporters later Friday at the White House that he is “getting al…",
    "link": "https://biztoc.com/x/d9b820055f5d2530",
    "timestamp": "2025-04-27T00:22:11Z"
  },
  {
    "title": "Trump Jr. Tells East Europe to Pick US Over China for Deals",
    "description": "Donald Trump Jr. told a business forum in Budapest that Hungary and the region should pick the US over China as its economic partner, according to the Portfolio news website.",
    "link": "https://www.livemint.com/companies/news/trump-jr-tells-east-europe-to-pick-us-over-china-for-deals-11745713143110.html",
    "timestamp": "2025-04-27T00:19:02Z"
  },
  {
    "title": "Protests, Outrage After FBI Arrests Judge",
    "description": "Protesters are chanting and marching outside the FBI on Saturday after agents arrested a Milwaukee judge accused of helping a man evade immigration authorities.",
    "link": "https://www.huffpost.com/entry/us-immigration-judge-arrested-fbi_n_680d7411e4b03a96c002e3d7",
    "timestamp": "2025-04-27T00:16:10Z"
  },
  {
    "title": "Did international trade really kill American manufacturing?",
    "description": "Did international trade really kill American manufacturing?\nBy Donald Trump’s telling it did. The data suggest otherwise\nPRESIDENT DONALD TRUMP has promised to revitalise American manufacturing. His sweeping tariffs are meant to coax firms into reshoring thei…",
    "link": "https://biztoc.com/x/69715904d819e61b",
    "timestamp": "2025-04-27T00:11:41Z"
  },
  {
    "title": "Trump raises Putin doubts after Zelenskyy talks at pope's funeral",
    "description": "The Ukrainian leader said they had discussed a possible unconditional ceasefire with Russia and that their talks had \"the potential to become historic.\"",
    "link": "https://www.japantimes.co.jp/news/2025/04/27/world/politics/trump-putin-ukraine-doubt/",
    "timestamp": "2025-04-27T00:01:00Z"
  },
  {
    "title": "“We, the People” Versus Lawfare",
    "description": "We must resist the ever-increasing attempts to impose this “brave new world” of unelected rulers and powerless citizenry and keep reminding the self-appointed “masters of the universe”.\nThe post “We, the People” Versus Lawfare first appeared on Le·gal In·sur·…",
    "link": "https://legalinsurrection.com/2025/04/we-the-people-versus-lawfare/",
    "timestamp": "2025-04-27T00:00:51Z"
  },
  {
    "title": "It’s mostly words",
    "description": "Even as foreign governments are humiliated in appealing to lift punishing US tariffs, those tariffs themselves are becoming humiliatingly hollow. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/behind-the-headlines/2025/04/27/its-mostly-words",
    "timestamp": "2025-04-27T00:00:00Z"
  },
  {
    "title": "Poilievre hopes young people are listening as he appeals for record turnout",
    "description": "Conservative Leader Pierre Poilievre is trying to win over young people — men in particular — when he calls for the 'biggest voter turnout in Canadian history' to avoid a Liberal win on Monday, some political experts say.",
    "link": "https://www.cbc.ca/news/politics/pierre-poilievre-record-turnout-play-young-voters-1.7519610",
    "timestamp": "2025-04-26T23:59:05Z"
  },
  {
    "title": "Op-Ed: I asked Grok ‘Does Donald Trump know what he’s talking about’? The answer was ‘No’.",
    "description": "Should AI be writing interviews, yes or no?\nThe post Op-Ed: I asked Grok ‘Does Donald Trump know what he’s talking about’? The answer was ‘No’. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/op-ed-i-asked-grok-does-donald-trump-know-what-hes-talking-about-the-answer-was-no/article",
    "timestamp": "2025-04-26T23:58:48Z"
  },
  {
    "title": "Op-Ed: I asked Grok ‘Does Donald Trump know what he’s talking about’? The answer was ‘No’.",
    "description": "Should AI be writing interviews, yes or no?\nThe post Op-Ed: I asked Grok ‘Does Donald Trump know what he’s talking about’? The answer was ‘No’. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-i-asked-grok-does-donald-trump-know-what-hes-talking-about-the-answer-was-no/article",
    "timestamp": "2025-04-26T23:58:48Z"
  },
  {
    "title": "Americans, including Republicans, losing faith in Trump, new polls reveal (Adam Gabbatt/The Guardian)",
    "description": "Adam Gabbatt / The Guardian:\nAmericans, including Republicans, losing faith in Trump, new polls reveal  —  Trump scores poorly on economy and immigration as some fear he is ‘exceeding powers’ and focussed on wrong issues  —  Americans, including some Republic…",
    "link": "https://www.memeorandum.com/250426/p49",
    "timestamp": "2025-04-26T23:55:00Z"
  },
  {
    "title": "Rosie O’Donnell Reveals How Often She Speaks to Lyle Menendez in Prison",
    "description": "Rosie O’Donnell revealed she frequently speaks to friend Lyle Menendez as he serves a life sentence in prison for the 1989 murders of his parents, Joe and Kitty Menendez. “[We speak] about two or three times a week,” O’Donnell, 63, told Page Six in an intervi…",
    "link": "https://www.usmagazine.com/celebrity-news/news/rosie-odonnell-reveals-how-often-she-speaks-to-lyle-menendez-in-prison/#article",
    "timestamp": "2025-04-26T23:54:55Z"
  },
  {
    "title": "Dems have another rising-star criminal alien",
    "description": "'A drunken driver killed 2 young people'",
    "link": "https://www.wnd.com/2025/04/dems-have-another-rising-star-criminal-alien/",
    "timestamp": "2025-04-26T23:53:52Z"
  },
  {
    "title": "Trump admin demands crackdown on illegal immigrants’ use of taxpayer-funded food stamps",
    "description": "The United States Department of Agriculture is demanding that states ensure illegal immigrants are not using food stamps.",
    "link": "https://nypost.com/2025/04/26/us-news/trump-wh-demands-crackdown-on-illegal-immigrants-use-snap-cut-down-on-billions-of-fraud/",
    "timestamp": "2025-04-26T23:53:38Z"
  },
  {
    "title": "Video of Pete Buttigieg's Explanation on Social Security Takes Off Online",
    "description": "Buttigieg's explanation comes amid controversy surrounding DOGE, which has been conducting what it calls \"a major cleanup\" of Social Security records.",
    "link": "https://www.newsweek.com/video-pete-buttigieg-explanation-social-security-flagrant-viral-2064657",
    "timestamp": "2025-04-26T23:38:43Z"
  },
  {
    "title": "Trump demands free passage via Suez Canal",
    "description": "President Donald Trump has claimed that neither the Panama nor Suez Canal would “exist” without the United States Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616379-trump-suez-panama-canal/",
    "timestamp": "2025-04-26T23:24:13Z"
  },
  {
    "title": "Trump-aligned club for the ultra rich launches in Washington (Dasha Burns/Politico)",
    "description": "Dasha Burns / Politico:\nTrump-aligned club for the ultra rich launches in Washington  —  The launch of “Executive Branch” comes as Trump world looks to remake Washington.  —  A new club is coming to Washington — and you probably can't get in.  —  Donald Trump…",
    "link": "https://www.memeorandum.com/250426/p47",
    "timestamp": "2025-04-26T23:20:00Z"
  },
  {
    "title": "Trump urges 'free' transit for US ships through Panama, Suez canals",
    "description": "WASHINGTON: US President Donald Trump on Saturday (Apr 26) urged free transit for American commercial and military ships through the Panama and Suez canals, tasking his secretary of state with making progress \"immediately.\" Trump has for months been calling f…",
    "link": "https://www.channelnewsasia.com/world/trump-urges-free-transit-us-ships-through-panama-suez-canals-5092211",
    "timestamp": "2025-04-26T23:19:38Z"
  },
  {
    "title": "White House Releases Video Encouraging Illegal Aliens to Self Deport: 'Take Me Home'",
    "description": "The White House released a video that encourages illegal aliens in the United States to self-deport, and it showed several messages from President Donald Trump and Department of Homeland Security (DHS) Secretary Kristi Noem warning them to either self-deport …",
    "link": "https://www.breitbart.com/immigration/2025/04/26/white-house-releases-video-encouraging-illegal-aliens-to-self-deport-take-me-home/",
    "timestamp": "2025-04-26T23:10:46Z"
  },
  {
    "title": "'Kicking butt' or 'going too fast'? Trump voters reflect on 100 days",
    "description": "Five Trump supporters say his first 100 days have met their expectations - with a few surprises and some warning signs.",
    "link": "https://www.bbc.com/news/articles/c807d4n0npeo",
    "timestamp": "2025-04-26T23:10:10Z"
  },
  {
    "title": "Trump says he’s negotiated 200 trade deals",
    "description": "The United States has already struck 200 trade deals, President Donald Trump said in an interview this week — but he refused to say with whom. Trump’s comments come just two weeks after he announced a 90-day pause on most of the sweeping global tariffs he imp…",
    "link": "https://freerepublic.com/focus/f-news/4313471/posts",
    "timestamp": "2025-04-26T23:08:42Z"
  },
  {
    "title": "Trump Says US Ships Need Free Travel Through Panama, Suez Canals",
    "description": "By María Paula Mijares Torres Apr 26, 2025 (Bloomberg) –President Donald Trump called for “free of charge” passage of American ships through the Panama and Suez canals, renewing his focus of...",
    "link": "https://gcaptain.com/trump-says-us-ships-need-free-travel-through-panama-suez-canals/",
    "timestamp": "2025-04-26T23:05:40Z"
  },
  {
    "title": "Trump: 'We know who the criminals are'",
    "description": "United States President Donald Trump stated that the country needed \"courageous justice,\" saying that his administration knew \"who the criminals are\" and expressed a need to \"get them out\" of the US \"...",
    "link": "https://biztoc.com/x/d7519e506103ce01",
    "timestamp": "2025-04-26T23:05:03Z"
  },
  {
    "title": "Continuous dialogue between India and US over bilateral trade agreement: MoS Jitin Prasada",
    "description": "NEW YORK, April 26: India and the US have a continuous dialogue and communication on the bilateral trade deal and the first tranche is set to roll out by fall this year, Minister of State for the Ministry of Commerce & Industry and the Ministry of Electronics…",
    "link": "https://thehillstimes.in/national/continuous-dialogue-between-india-and-us-over-bilateral-trade-agreement-mos-jitin-prasada",
    "timestamp": "2025-04-26T23:05:00Z"
  },
  {
    "title": "Grapevine April 27, 2025: Honors for Hagee and Huckabee",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/opinion/article-851587",
    "timestamp": "2025-04-26T23:04:08Z"
  },
  {
    "title": "Why Trump faces awkward reckoning 100 days into the job",
    "description": "David Axelrod, Barack Obama's chief strategist, tried to downplay interest in the president's first \"100 days\".",
    "link": "https://news.sky.com/story/trump-faces-awkward-reckoning-100-days-into-the-job-notwithstanding-his-dreams-of-being-king-of-america-13355732",
    "timestamp": "2025-04-26T23:01:00Z"
  },
  {
    "title": "Trump won't use 'loopholes' to seek third term in White House",
    "description": "President Donald Trump didn't shut down seeking a third term but also said he didn't believe in using \"loopholes\" to achieve that in a new interview.",
    "link": "https://www.foxnews.com/media/trump-wont-use-loopholes-seek-third-term-white-house",
    "timestamp": "2025-04-26T23:00:19Z"
  },
  {
    "title": "Mighty And Meek Say Farewell To Pope Francis During Vatican Funeral",
    "description": "World leaders and rank-and-file Catholic faithful have said farewell to Pope Francis in a funeral that highlighted his concern for people on the peripheries and reflected his wish to be remembered as a simple pastor.",
    "link": "https://www.huffpost.com/entry/vatican-pope-francis-funeral_n_680d6091e4b03a96c002e397",
    "timestamp": "2025-04-26T22:47:48Z"
  },
  {
    "title": "Investor Jason Calacanis Says, 'These Trump Truth Tantrums Certainly Play With The MAGA Base, But They Destabilize Markets'",
    "description": "Jason Calacanis is openly critical of President Donald Trump‘s impact on the economy. In a series of tweets, the well-known tech investor criticized Trump for creating what he described as “complete market chaos” just 92 days into his new term.\n“I’m basing it…",
    "link": "https://biztoc.com/x/0b348c3df97baef2",
    "timestamp": "2025-04-26T22:42:30Z"
  },
  {
    "title": "About 200 protesters join 'Let Them Eat Cake' demonstration in downtown Fargo",
    "description": "On Saturday afternoon, April 26, around 200 people gathered on a street corner across from the Federal Building in downtown Fargo to speak out against recent and proposed cuts to federal spending.",
    "link": "https://www.inforum.com/news/fargo/about-200-protesters-join-let-them-eat-cake-demonstration-in-downtown-fargo",
    "timestamp": "2025-04-26T22:37:33Z"
  },
  {
    "title": "Trump Refuses to Give Biden Air Force One Ride to Pope's Funeral (Emell Derra Adolphus/The Daily Beast)",
    "description": "Emell Derra Adolphus / The Daily Beast:\nTrump Refuses to Give Biden Air Force One Ride to Pope's Funeral  —  FLYING SOLO  —  The MAGA president broke yet another presidential tradition in attending the late Pontiff's funerary rites.  —  Not even the death of …",
    "link": "https://www.memeorandum.com/250426/p45",
    "timestamp": "2025-04-26T22:35:01Z"
  },
  {
    "title": "From mightiest to humblest, hundreds of thousands gather for Pope Francis’ funeral",
    "description": "From some of the world’s most powerful leaders to those on society’s margins whom Pope Francis always made a point to minister to, hundreds of thousands of people participated at the Vatican Saturday for his funeral rites.",
    "link": "https://www.bostonherald.com/2025/04/26/from-mightiest-to-humblest-hundreds-of-thousands-gather-for-pope-francis-funeral/",
    "timestamp": "2025-04-26T22:30:51Z"
  },
  {
    "title": "Bitcoin Recovers Strongly Above $90,000 as Stocks, Bonds Remain Turbulent",
    "description": "Bitcoin is trading above the $94,000 price level at the time of press, following a bullish 24 hours overall.",
    "link": "https://zycrypto.com/bitcoin-recovers-strongly-above-90000-as-stocks-bonds-remain-turbulent/",
    "timestamp": "2025-04-26T22:25:42Z"
  },
  {
    "title": "Boston celebrates 60th anniversary of MLK Freedom Rally (photos)",
    "description": "As a teenager growing up in Boston, Wayne Lucas vividly remembers joining about 20,000 people to hear the Rev. Martin Luther King Jr. speak out against the city's segregated school system and the entrenched poverty in poor communities.",
    "link": "https://www.bostonherald.com/2025/04/26/boston-celebrates-60th-anniversary-of-mlk-freedom-rally-photos/",
    "timestamp": "2025-04-26T22:16:13Z"
  },
  {
    "title": "Trump Calls for U.S. Ships to Be Allowed to Travel Through Suez, Panama Canals Without Charge",
    "description": "President Donald Trump called for military and commercial ships from the United States to be able to travel through the Suez and Panama Canals without facing a fee, and added that he had directed Secretary of State Marco Rubio to take care of the issue.\nThe p…",
    "link": "https://www.breitbart.com/politics/2025/04/26/trump-calls-for-u-s-ships-to-be-allowed-to-travel-through-suez-panama-canals-without-charge/",
    "timestamp": "2025-04-26T22:10:59Z"
  },
  {
    "title": "Republican Urged to Exit Race After Alleged Links to Pornographic Images",
    "description": "Virginia Governor Glenn Youngkin has asked Republican lieutenant governor nominee John Reid to withdraw from the November race amid a social media scandal.",
    "link": "https://www.newsweek.com/republican-john-reid-urged-exit-race-alleged-pornographic-images-2064649",
    "timestamp": "2025-04-26T22:10:52Z"
  },
  {
    "title": "Trump: Suez, Panama canals 'would not exist' without US",
    "description": "United States President Donald Trump stated that US military and commercial ships \"should be allowed to travel, free of charge, through the Panama and Suez Canals.\"In a post on Truth Social, Trump wro...",
    "link": "https://biztoc.com/x/cdb13c42b8b5114d",
    "timestamp": "2025-04-26T22:09:37Z"
  },
  {
    "title": "Justice Department Removes Protections for Journalists in Leak Investigations",
    "description": "Attorney General Pam Bondi revoked Biden-era rules preventing the Justice Department from seeking records or compelling testimony.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-pam-bondi-journalist-protections-leaks-investigations-1235325906/",
    "timestamp": "2025-04-26T22:09:20Z"
  },
  {
    "title": "Biden relegated to back of world leaders section at pope's funeral: 'No longer part of cool kids club'",
    "description": "Critics of former President Joe Biden took to social media to highlight his behavior at Pope Francis' funeral and where he was seated during the service.",
    "link": "https://www.foxnews.com/world/biden-seated-towards-back-world-leaders-section-popes-funeral-no-longer-part-cool-kids-club",
    "timestamp": "2025-04-26T22:07:25Z"
  },
  {
    "title": "Estonian president reveals what Trump told him about Ukraine",
    "description": "US President Donald Trump said peace between Ukraine and Russia was “quite close,” Estonian President Alar Karis has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616377-trump-ukraine-peace-close/",
    "timestamp": "2025-04-26T22:04:07Z"
  },
  {
    "title": "‘MADNESS!’ Trump Rages at Courts For Lack of ‘Courageous JUSTICE’ on Immigration After Pope’s Funeral",
    "description": "In remarks presumably from Air Force One after the president departed from Rome, he accused judges of working to cement the immigration crisis.\nThe post ‘MADNESS!’ Trump Rages at Courts For Lack of ‘Courageous JUSTICE’ on Immigration After Pope’s Funeral firs…",
    "link": "https://www.mediaite.com/trump/madness-trump-rages-at-courts-for-lack-of-courageous-justice-on-immigration-after-popes-funeral/",
    "timestamp": "2025-04-26T22:03:34Z"
  },
  {
    "title": "Melania Trump’s Whisper To Donald Decoded By Lip Reader At Pope Francis’ Funeral",
    "description": "A lip reader revealed what President Donald Trump and first lady Melania whispered to one another about etiquette.",
    "link": "https://www.boredpanda.com/lip-reader-reveals-what-melania-said-to-trump-at-pope-francis-funeral/",
    "timestamp": "2025-04-26T22:03:18Z"
  },
  {
    "title": "US and Iran make ‘very serious’ progress toward new nuclear deal after Oman talks, eye Europe next",
    "description": "The United States and Iran made “very serious and work-focused” progress toward a new nuclear agreement during marathon negotiations Saturday in Oman.",
    "link": "https://nypost.com/2025/04/26/world-news/us-and-iran-make-very-serious-progress-toward-new-nuclear-deal-after-oman-talks-eye-europe-next/",
    "timestamp": "2025-04-26T22:00:25Z"
  },
  {
    "title": "DOJ Launches ‘Task Force to Eradicate Anti-Christian Bias’",
    "description": "A new task force within the U.S. Department of Justice (DOJ) convened Tuesday to rectify the “anti-Christian bias” perpetrated by the federal government under President Joe Biden.... Read More\nThe post DOJ Launches ‘Task Force to Eradicate Anti-Christian Bias…",
    "link": "https://www.dailysignal.com/2025/04/26/doj-launches-task-force-to-eradicate-anti-christian-bias/",
    "timestamp": "2025-04-26T22:00:00Z"
  },
  {
    "title": "'Dead man walking': Ex-Trump adviser flags 'unprecedented' fall of two key Cabinet members",
    "description": "Despite the fact that Donald \"Trump does not want to be seen giving up to pressure\" this early in his second term, one Cabinet official is on the chopping block and another has been diminished in an unprecedented way, according to a former Trump adviser.\n\nTru…",
    "link": "https://www.rawstory.com/bolton-rubio-hegseth-men/",
    "timestamp": "2025-04-26T21:59:36Z"
  },
  {
    "title": "World leaders and faithful mourners bid solemn farewell to Pope Francis",
    "description": "Pope Francis was laid to rest Saturday after a solemn Requiem Mass outside Saint Peter’s Basilica. On the same day, President Donald Trump and Ukrainian President Volodymr Zelenskyy met at the Vatican to discuss hopes for lasting peace. Special correspondent …",
    "link": "https://biztoc.com/x/aea8e01a60f11f7f",
    "timestamp": "2025-04-26T21:58:35Z"
  },
  {
    "title": "Nearly 800 illegal aliens arrested within days during massive Florida ICE operation",
    "description": "Nearly 800 illegal immigrants were arrested this week as part of a massive Florida roundup led by Immigration and Customs Enforcement and local authorities.",
    "link": "https://www.foxnews.com/us/nearly-800-illegal-aliens-arrested-massive-florida-ice-operation-tidal-wave",
    "timestamp": "2025-04-26T21:55:53Z"
  },
  {
    "title": "Donald Trump sparks outrage over his 'disrespectful behavior' at Pope Francis's funeral: What happened",
    "description": "First, he ruffled feathers with his oddly cheerful remark about looking forward to attending Pope Francis's funeral. Now, US President Donald Trump is once again under fire for his 'disrespectful behavior' at Pope Francis's funeral today on April 26, sparking…",
    "link": "https://freerepublic.com/focus/f-news/4313465/posts",
    "timestamp": "2025-04-26T21:55:24Z"
  },
  {
    "title": "World leaders and faithful mourners bid solemn farewell to Pope Francis",
    "description": "Pope Francis was laid to rest Saturday after a solemn Requiem Mass outside Saint Peter’s Basilica. On the same day, President Donald Trump and Ukrainian President Volodymr Zelenskyy met at the Vatican to discuss hopes for lasting peace. Special correspondent …",
    "link": "https://www.pbs.org/newshour/show/world-leaders-and-faithful-mourners-bid-solemn-farewell-to-pope-francis",
    "timestamp": "2025-04-26T21:50:36Z"
  },
  {
    "title": "MSNBC’s Rachel Maddow Gleefully Roasts ‘Rejected And Hated’ Trump Over Brutal Blizzard Of Polls",
    "description": "Maddow gleefully mocked President Donald Trump over a raft of devastating poll numbers, and suggested his desperation is making him do \"crazy\" things.\nThe post MSNBC’s Rachel Maddow Gleefully Roasts ‘Rejected And Hated’ Trump Over Brutal Blizzard Of Polls fir…",
    "link": "https://www.mediaite.com/news/msnbcs-rachel-maddow-gleefully-roasts-rejected-and-hated-trump-over-brutal-blizzard-of-polls/",
    "timestamp": "2025-04-26T21:40:21Z"
  },
  {
    "title": "Melania Trump's Best Photos for Her 55th Birthday",
    "description": "Melania Trump turned 55 Saturday, and despite years of stressful White House livin', she's still looking as vibrant as ever ... and, we've got some of her best photos for you to peruse. The First Lady's back in the White House after a four-year…\n Permalink",
    "link": "https://www.tmz.com/2025/04/26/melania-trump-best-photos-birthday-hot-shots/",
    "timestamp": "2025-04-26T21:39:29Z"
  },
  {
    "title": "White House Reportedly Considers Exempting Afghan Christians From Deportation Push",
    "description": "The Trump administration is mulling over exempting Afghan Christians living as refugees in the U.S. from deportation after pressure from Christian groups.",
    "link": "https://dailycaller.com/2025/04/26/trump-administration-afghan-christians-deportation-franklin-graham-dhs/",
    "timestamp": "2025-04-26T21:38:45Z"
  },
  {
    "title": "Palestinian President Abbas appoints new vice president in major step to naming a successor",
    "description": "The appointment of Hussein al-Sheikh as vice president of the Palestine Liberation Organization does not guarantee he will be the next Palestinian president. But it makes him the front-runner among longtime politicians in the dominant Fatah party who hope to …",
    "link": "https://www.pbs.org/newshour/world/palestinian-president-abbas-appoints-new-vice-president-in-major-step-to-naming-a-successor",
    "timestamp": "2025-04-26T21:37:39Z"
  },
  {
    "title": "Upside Down World: European Peace Movement Marches in Support of President Trump as “Anti”-Fascists Rally Against Peace",
    "description": "As President Trump meets with President Volodymyr Zelensky and other world leaders in Rome to try and end the senseless war in Ukraine, the European peace movement is falling in line behind Trump’s bold leadership – while Antifa street militias protest and ca…",
    "link": "https://freerepublic.com/focus/f-news/4313463/posts",
    "timestamp": "2025-04-26T21:37:33Z"
  },
  {
    "title": "Pope Francis' 'final miracle' is hailed as Trump and Zelensky meet in the Vatican and US president turns AGAINST Putin for 'stringing him along' over peace plan",
    "description": "Pope Francis has been celebrated for what's being dubbed his 'final miracle' after Donald Trump dramatically turned against tyrant Vladimir Putin today. The US President accused the Russian despot of 'stringing him along' over Ukraine peace talks - as Trump's…",
    "link": "https://freerepublic.com/focus/f-news/4313461/posts",
    "timestamp": "2025-04-26T21:34:37Z"
  },
  {
    "title": "Bill Maher says MAGA voters won’t admit how disappointed they are in Trump’s first 100 days",
    "description": "The HBO host thinks Trump voters realize they have 'plenty to lose' during the recent economic turmoil.",
    "link": "https://nypost.com/2025/04/26/media/bill-maher-says-maga-voters-wont-admit-how-disappointed-they-are-in-trumps-first-100-days/",
    "timestamp": "2025-04-26T21:33:47Z"
  },
  {
    "title": "Trump, Zelensky hold 'good' talks in Vatican basilica at Pope Francis’ funeral two months after White House argument",
    "description": "Trump, Zelensky hold 'good' talks in Vatican basilica at Pope Francis’ funeral two months after White House argument7news.com.au",
    "link": "https://7news.com.au/news/conflict/trump-zelensky-hold-good-talks-in-vatican-basilica-at-pope-francis-funeral-two-months-after-white-house-argument-c-18497479",
    "timestamp": "2025-04-26T21:32:42Z"
  },
  {
    "title": "Hundreds of Americans accept B.C. man's social media invite, attend festival in Nanaimo",
    "description": "Months after a British Columbia man's social media invite to Americans went viral, hundreds showed up in Nanaimo, B.C., over the weekend to show their support for Canada.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/nanaimo-infusion-tod-maffin-1.7519638",
    "timestamp": "2025-04-26T21:31:03Z"
  },
  {
    "title": "Boston celebrates 1965 Freedom Rally led by MLK",
    "description": "King's son said he never thought racism would still be around and on the rise like it is today, as rally-goers urged activism to continue.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_1b153ab0-0ebe-54cb-aae6-b1a52d22d0c1.html",
    "timestamp": "2025-04-26T21:30:00Z"
  },
  {
    "title": "Confused about Trump’s tariff war? There’s a good reason for that | CNN Business",
    "description": "Confused about Trump’s tariff war? There’s a good reason for that | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/04/26/business/everything-you-missed-in-the-economy-this-week/index.html",
    "timestamp": "2025-04-26T21:25:33Z"
  },
  {
    "title": "Judge says US citizen, 2, may have been deported without 'meaningful process'",
    "description": "A federal judge said there was \"strong suspicion\" the Louisiana-born girl had been sent to Honduras with her mother and sister.",
    "link": "https://www.bbc.com/news/articles/c4g278yn4d3o",
    "timestamp": "2025-04-26T21:25:28Z"
  },
  {
    "title": "Tesla is promoting 'pre-tariff' EVs in Canada as prices begin to rise",
    "description": "Tesla urged Canadians on its website to \"Explore pre-tariff priced inventory while supplies last.\"",
    "link": "https://www.businessinsider.com/tesla-canada-price-tariffs-trump-musk-2025-4",
    "timestamp": "2025-04-26T21:21:11Z"
  },
  {
    "title": "Xi says China must 'overcome' AI chip challenges",
    "description": "President Xi Jinping said China must &quot;overcome&quot; the challenges of developing core AI technologies including high-end chips, state media reported Saturday, as Beijing seeks to become a world leader in the rapidly developing industry. China aims to do…",
    "link": "https://japantoday.com/category/tech/xi-says-china-must-%27overcome%27-ai-chip-challenges",
    "timestamp": "2025-04-26T21:20:28Z"
  },
  {
    "title": "Starmer faces left-wing revolt over Trump state visit: More than a dozen MPs sign motion demanding ban on US president addressing Parliament",
    "description": "Keir Starmer is facing a backbench revolt over Donald Trump's planned state visit to the UK later this year. More than a dozen Labour MPs have backed a motion saying the UK president should be barred from addressing parliament when he visits Britain. They arg…",
    "link": "https://freerepublic.com/focus/f-news/4313459/posts",
    "timestamp": "2025-04-26T21:19:15Z"
  },
  {
    "title": "Trump Says US Ships Should Get Free Passage Through Panama, Suez Canals",
    "description": "\"I've asked Secretary of State Marco Rubio to immediately take care of, and memorialize, this situation!\" the president said.",
    "link": "https://www.newsweek.com/donald-trump-panama-suez-canal-free-2064641",
    "timestamp": "2025-04-26T21:19:03Z"
  },
  {
    "title": "Former US Ambassador to Russia on the Trump-Zelenskyy meeting",
    "description": "NPR's Scott Detrow speaks with former US Ambassador to Russia, Michael McFaul, about today's meeting between US President Donald Trump and his Ukrainian counterpart Volodymyr Zelenskyy.",
    "link": "https://www.npr.org/2025/04/26/nx-s1-5376488/former-us-ambassador-to-russia-on-the-trump-zelenskyy-meeting",
    "timestamp": "2025-04-26T21:17:34Z"
  },
  {
    "title": "More Japanese embracing foreign rice, even before it became a tariff topic",
    "description": "When a severe rice shortage sent prices skyrocketing in Japan last year, Tokyo restaurant owner Arata Hirano did what had once seemed unthinkable: he switched to an American variety.   The price of the Californian Calrose rice he buys has doubled since his fi…",
    "link": "https://japantoday.com/category/business/more-japanese-embracing-foreign-rice-even-before-it-became-a-tariff-topic",
    "timestamp": "2025-04-26T21:15:24Z"
  },
  {
    "title": "Donald Trump Says 'Loopholes Have Been Discussed' Hinting at Running for a Third Presidential Term",
    "description": "Donald Trump first hinted at a third term during a phone interview last month, where he claimed 'there are methods' of bypassing the Constitution.",
    "link": "https://radaronline.com/p/donald-trump-loopholes-discussed-hinting-running-third-term/",
    "timestamp": "2025-04-26T21:15:00Z"
  },
  {
    "title": "Trump Administration to Judges: ‘We Will Find You’",
    "description": "The attorney general’s message to the judiciary is clear.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/trump-administration-initimidates-judges/682620/",
    "timestamp": "2025-04-26T21:14:48Z"
  },
  {
    "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
    "description": "An Israeli airstrike flattened a three-story home in Gaza City on Saturday, killing 10 people — half of them children — as Arab mediators scrambled to restart a ceasefire. Israeli strikes killed at least 49 people in the past 24 hours, according to health off…",
    "link": "https://japantoday.com/category/world/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire",
    "timestamp": "2025-04-26T21:13:38Z"
  },
  {
    "title": "Iran 'extremely cautious' on success of nuclear talks with US",
    "description": "Iran and the United States have agreed to continue nuclear talks next week, both sides said on Saturday, though Iranian Foreign Minister Abbas Araqchi voiced &quot;extreme cautious&quot; about the success of the negotiations to resolve a decades-long standoff…",
    "link": "https://japantoday.com/category/world/iran-says-%27extremely-cautious%27-on-success-of-nuclear-talks-with-us",
    "timestamp": "2025-04-26T21:13:29Z"
  },
  {
    "title": "Russia says it retook Kursk from Ukraine with North Korean help",
    "description": "The Russian army has fully liberated the border Kursk region from Ukrainian control with the help of North Korean soldiers, Chief of Staff Valery Gerasimov said on Saturday, admitting their participation in the conflict for the first time. Gerasimov especiall…",
    "link": "https://japantoday.com/category/world/russia-says-retook-kursk-from-ukraine-with-north-korean-help",
    "timestamp": "2025-04-26T21:13:06Z"
  },
  {
    "title": "Trump expresses doubts Putin is willing to end the Ukraine war, a day after saying a deal was close",
    "description": "President Donald Trump said Saturday that he doubts Russia's Vladimir Putin wants to end his war in Ukraine, expressing new skepticism that a peace deal can be reached soon. Only a day earlier, Trump had said Ukraine and Russia were “ very close to a deal.&qu…",
    "link": "https://japantoday.com/category/world/trump-expresses-doubts-putin-is-willing-to-end-the-ukraine-war-a-day-after-saying-a-deal-was-close",
    "timestamp": "2025-04-26T21:12:47Z"
  },
  {
    "title": "No matter what deal I make with respect to Russia/Ukraine, no matter how good it is, even if it’s the greatest deal ever made, The Failing New York Times will speak BADLY of it.",
    "description": "Liddle’ Peter Baker, the very biased and untalented writer for The Times, followed his Editor’s demands and wrote that Ukraine should get back territory, including, I suppose, Crimea, and other ridiculous requests, in order to stop the killing that is worse t…",
    "link": "https://freerepublic.com/focus/f-news/4313457/posts",
    "timestamp": "2025-04-26T21:12:23Z"
  },
  {
    "title": "Several killed by Israeli strikes in Gaza as mediators look to restart ceasefire",
    "description": "Ten killed by Israeli strike on Gaza City home, including five children",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/26/several-killed-by-israeli-strikes-in-gaza-as-mediators-look-to-restart-ceasefire/",
    "timestamp": "2025-04-26T21:11:07Z"
  },
  {
    "title": "World Pride event organizers move events after Trump’s Kennedy Center takeover",
    "description": "Several LGBTQ+ pride events to be held as part of Washington, D.C.’s World Pride celebrations in May and June have been relocated from the John F. Kennedy Center for the Performing Arts.",
    "link": "https://www.nbcnews.com/politics/politics-news/world-pride-event-organizers-move-events-trumps-kennedy-center-rcna203162",
    "timestamp": "2025-04-26T21:08:50Z"
  },
  {
    "title": "Weekly recap: A tumultuous week amid Pope Francis' death",
    "description": "This week, the Vatican announced the death of Pope Francis at 88, prompting an unexpected meeting between Ukrainian President Volodymyr Zelensky and US President Donald Trump minutes before the funera...",
    "link": "https://biztoc.com/x/66d2811690287c85",
    "timestamp": "2025-04-26T21:02:53Z"
  }
]