[
  {
    "title": "A Chinese New Bretton Woods? – Quancha op-ed",
    "description": "Donald Trump has made it impossible for any sensible person to persevere in the delusion that global business can continue as usual. We should all welcome this, even if we are livid with Trump’s shocking behaviour, decisions and narratives. The global economy…",
    "link": "https://www.yanisvaroufakis.eu/2025/06/08/a-chinese-new-bretton-woods-quancha-op-ed/",
    "timestamp": "2025-06-08T07:47:34Z"
  },
  {
    "title": "The 9 at 9: Sunday",
    "description": "Land review shows shift towards dairy farming, Trump deploys National Guard to LA and the OPW’s vacant properties.",
    "link": "https://www.thejournal.ie/9-at-9-sunday-197-6727086-Jun2025/",
    "timestamp": "2025-06-08T07:45:20Z"
  },
  {
    "title": "As Elon Musk's bromance with Trump crumbles, an incident in Mar-a-Lago with Tesla link re-surfaces",
    "description": "A plane was spotted flying in April over President Trump's Mar-a-Lago residence this weekend with the banner 'Save Tesla, Fire Musk'. The incident has re-surfaced at a time when the feud between the two men continues to escalate. It happened when Tesla's shar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-elon-musks-bromance-with-trump-crumbles-an-incident-in-mar-a-lago-with-tesla-link-re-surfaces/articleshow/121704945.cms",
    "timestamp": "2025-06-08T07:40:14Z"
  },
  {
    "title": "New disputes emerge ahead of US-China trade talks in London",
    "description": "U.S.-China trade talks in London this week are expected to take up a series of fresh disputes that have buffeted relations, threatening a fragile truce over ...",
    "link": "https://www.yahoo.com/news/disputes-emerge-ahead-us-china-073633517.html",
    "timestamp": "2025-06-08T07:36:33Z"
  },
  {
    "title": "Watch: Defiance and anger on the streets of LA",
    "description": "The Californian city saw a second day of unrest on Saturday, with tear gas fired in the Paramount district.",
    "link": "https://www.bbc.com/news/videos/clygjlgzll3o",
    "timestamp": "2025-06-08T07:34:23Z"
  },
  {
    "title": "Los Angeles protests live: Donald Trump deploys California National Guard to city after clashes over immigration raids - BBC",
    "description": "Los Angeles protests live: Donald Trump deploys California National Guard to city after clashes over immigration raidsBBC Trump deploys 2,000 National Guard members after Los Angeles immigration protestsABC7 Los Angeles Why riots erupted in LA after immigrati…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177958323",
    "timestamp": "2025-06-08T07:14:44Z"
  },
  {
    "title": "Trump Musk Feud: It's Over! Serious Consequences?",
    "description": "Donald Trump said on Saturday that his relationship with his billionaire donor Elon Musk is over and warned there would be “serious consequences” if Musk",
    "link": "https://punchng.com/its-over-trump-cuts-ties-with-musk-threatens-serious-consequences/",
    "timestamp": "2025-06-08T07:12:58Z"
  },
  {
    "title": "Ukraine’s drone swarm attack was a warning for Russia and the US may be next",
    "description": "Ukraine’s low-cost drone strike on Russia’s bomber fleet has forced the US military to confront an urgent vulnerability: its own exposed aircraft at home and abroad. With US bases largely unhardened and easily accessible, military leaders are now sounding the…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraines-drone-swarm-attack-was-a-warning-for-russia-and-the-us-may-be-next/articleshow/121704400.cms",
    "timestamp": "2025-06-08T07:07:00Z"
  },
  {
    "title": "Elon Musk will face 'serious consequences' if he funds Democratic rivals, Trump warns",
    "description": "When asked during a phone interview if his relationship with the Tesla CEO was over, the US President said: “I would assume so, yeah.”",
    "link": "https://www.thejournal.ie/donald-trump-elon-musk-feud-consequences-funds-democrats-6727079-Jun2025/",
    "timestamp": "2025-06-08T07:04:03Z"
  },
  {
    "title": "In Georgia, Pak man with UAE residency denied entry to US state, says 'was treated like a criminal'. Know the revised rules",
    "description": "A Pakistani national with UAE residency faced detention and denial of entry at Kutaisi International Airport in Georgia, despite possessing valid documents. The traveler recounted a harrowing experience of mistreatment and humiliation, highlighting concerns a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-georgia-pak-man-with-uae-residency-denied-entry-to-us-state-says-was-treated-like-a-criminal-know-the-revised-rules/articleshow/121704677.cms",
    "timestamp": "2025-06-08T06:57:36Z"
  },
  {
    "title": "Labour tiptoed cautiously through its first year - now is the time to escape its own shadow",
    "description": "This week's Spending Review is a one-off opportunity for the UK government to show investors its vision",
    "link": "https://www.bbc.com/news/articles/czdye1963jmo",
    "timestamp": "2025-06-08T06:55:38Z"
  },
  {
    "title": "The art to screw everyone with a ‘deal’",
    "description": "The US-UK trade deal is just a worthless piece of paper, meant to appease the electorate at home",
    "link": "https://timesofmalta.com/article/the-art-screw-everyone-deal.1111002",
    "timestamp": "2025-06-08T06:48:26Z"
  },
  {
    "title": "UFC 316: Merab Dvalishvili beats Sean O'Malley with north-south choke in Round 3",
    "description": "Merab Dvalishvili retained his bantamweight title at UFC 316, submitting Sean O’Malley in the third round and extending his winning streak to 13. Dvalishvili expressed interest in defending his title against Cory Sandhagen. Kayla Harrison also secured a submi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ufc-316-merab-dvalishvili-beats-sean-omalley-with-north-south-choke-in-round-3/articleshow/121704571.cms",
    "timestamp": "2025-06-08T06:40:10Z"
  },
  {
    "title": "Top TikToker Khaby Lame detained by US immigration",
    "description": "US immigration agents detained and later allowed the \"voluntary departure\" of the world's most-followed TikToker, Khaby Lame, after he \"overstayed\" his visa, authorities said Saturday.",
    "link": "https://www.citizen.digital/entertainment/top-tiktoker-khaby-lame-detained-by-us-immigration-n364216",
    "timestamp": "2025-06-08T06:36:04Z"
  },
  {
    "title": "Trump orders 2,000 national guard troops to LA amid protests over immigration crackdown",
    "description": "California governor says mobilisation is ‘purposefully inflammatory’ and will ‘only escalate tensions’",
    "link": "https://www.irishtimes.com/world/us/2025/06/08/trump-orders-2000-national-guard-troops-to-la-amid-protests-over-immigration-crackdown/",
    "timestamp": "2025-06-08T06:34:20Z"
  },
  {
    "title": "Why riots erupted in LA after immigration raids, and what happened next",
    "description": "Immigration and Customs Enforcement raids have sparked riots across Los Angeles, leading to the National Guard being called in. Here's a recap of events.",
    "link": "https://www.abc.net.au/news/2025-06-08/la-riots-ice-raids-explained/105391188",
    "timestamp": "2025-06-08T06:26:39Z"
  },
  {
    "title": "Top Banker Vows Loyalty to DEI at Tokyo Pride Parade as Trump’s Pushback Rages",
    "description": "The head of one of Japan’s largest investment banks used the Tokyo Pride parade to strike a rare public stance on pushing ahead with diversity initiatives, as US President Donald Trump seeks to abolish such policies.",
    "link": "https://www.livemint.com/companies/news/top-banker-vows-loyalty-to-dei-at-tokyo-pride-parade-as-trump-s-pushback-rages-11749363912832.html",
    "timestamp": "2025-06-08T06:25:12Z"
  },
  {
    "title": "What led to the Los Angeles immigration raids protests, and what the National Guard deployment means for California’s migrant communities",
    "description": "Large-scale immigration raids in Los Angeles sparked widespread protests, leading to clashes between residents and federal agents. In response, President Trump deployed National Guard troops, escalating tensions in the city. Demonstrators, including immigrant…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-led-to-the-los-angeles-immigration-raids-protests-and-what-the-national-guard-deployment-means-for-californias-migrant-communities/articleshow/121704384.cms",
    "timestamp": "2025-06-08T06:19:06Z"
  },
  {
    "title": "'Deranged': Newsom Fumes as Trump Federalizes National Guard, Threatens to Deploy Marines to Quell Anti-ICE Riots",
    "description": "California Governor Gavin Newsom (D) took his frustrations to social media on Saturday as President Donald Trump federalized 2,000 California National Guard troops to quell anti-ICE riots in Los Angeles.\nThe post ‘Deranged’: Newsom Fumes as Trump Federalizes …",
    "link": "https://www.breitbart.com/politics/2025/06/07/deranged-newsom-fumes-as-trump-federalizes-national-guard-threatens-to-deploy-marines-to-quell-anti-ice-riots/",
    "timestamp": "2025-06-08T06:13:43Z"
  },
  {
    "title": "Trump deploys 2,000 National Guard troops to LA after clashes over immigration raids",
    "description": "California Governor Gavin Newsom has described the move as “purposefully inflammatory”.",
    "link": "https://www.thejournal.ie/trump-deploys-national-guard-los-angeles-clashes-immigration-raids-6727064-Jun2025/",
    "timestamp": "2025-06-08T06:12:04Z"
  },
  {
    "title": "Trump officials are vowing to end school desegregation orders. Some parents say they're still needed",
    "description": "In Concordia Parish, Louisiana, stark racial disparities persist between schools despite a decades-old desegregation order. The Justice Department's plan to lift these orders faces opposition from civil rights groups who argue they are crucial for addressing …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-officials-are-vowing-to-end-school-desegregation-orders-some-parents-say-theyre-still-needed/articleshow/121704347.cms",
    "timestamp": "2025-06-08T06:07:50Z"
  },
  {
    "title": "Has Ivanka Trump distanced herself from MAGA? Her recent action 'subtly shading' father Donald Trump sparks buzz",
    "description": "Donald Trump's daughter, Ivanka Trump, openly supported an author who criticised her father. The 43-year-old took to Instagram this week to promote Untamed, a 2020 memoir by Glennon Doyle, who supported Kamala Harris during the November election. Ivanka Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/has-ivanka-trump-distanced-herself-from-maga-her-recent-action-subtly-shading-father-donald-trump-sparks-buzz-untamed-glennon-doyle/articleshow/121704331.cms",
    "timestamp": "2025-06-08T06:07:27Z"
  },
  {
    "title": "RFK Jr. and 14 Other Trump Picks Unprepared, Unfit for Their Big Government Jobs",
    "description": "From a former WWE CEO to a right-wing podcaster, the folks President Donald Trump has tapped to lead the country have... questionable backgrounds. \nThe post RFK Jr. and 14 Other Trump Picks Unprepared, Unfit for Their Big Government Jobs appeared first on The…",
    "link": "https://www.theroot.com/rfk-jr-and-14-other-trump-picks-unprepared-unfit-for-2000043810",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "55 Tons of meth ingredient seized at Port of Long Beach in California",
    "description": "On May 30, ICE and CBP seized 55 tons of di-cumyl peroxide, a methamphetamine precursor, shipped from China and believed to be destined for Mexico’s Sinaloa cartel. The bust is part of a broader ICE-led initiative launched in 2019, which has so far intercepte…",
    "link": "https://www.naturalnews.com/2025-06-08-meth-ingredient-seized-port-of-long-beach.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Federal agents raid cartel-linked underground nightclub in South Carolina, arrest 72",
    "description": "HSI and ICE arrested 72 illegal immigrants, including six minors, during a raid on “El Alamo,” an illicit nightclub in Charleston allegedly tied to the violent Northeast Cartel (CDN), formerly Los Zetas. Cash, drugs and firearms were seized. The nightclub’s o…",
    "link": "https://www.naturalnews.com/2025-06-08-federal-agents-raid-cartel-linked-underground-nightclub.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Trump administration rescinds Biden-era EMTALA guidance on emergency abortion care",
    "description": "The Trump administration rescinded a 2022 HHS policy that required hospitals to provide emergency abortions (e.g., for ectopic pregnancies or life-threatening conditions) under EMTALA, even in states with abortion bans. The 1986 law mandates that Medicare-fun…",
    "link": "https://www.naturalnews.com/2025-06-08-trump-admin-rescinds-biden-era-emtala-guidance.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "U.S. Army surpasses 2025 recruiting goal four months ahead of schedule",
    "description": "The Army surpassed its fiscal year 2025 recruiting goal of 61,000 active-duty soldiers four months ahead of schedule. Officials attribute the surge to a mix of patriotic sentiment, relaxed enlistment standards and expanded preparatory programs, while experts …",
    "link": "https://www.naturalnews.com/2025-06-08-us-army-surpasses-its-2025-recruiting-goal.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "U.S. job openings rise more than expected in April",
    "description": "Employers posted nearly 7.4 million job openings in April, up by 191,000 from March and above the 7.1 million forecast, indicating ongoing demand for workers. Hiring increased by 169,000 to 5.6 million, while layoffs rose by 196,000 to 1.79 million, suggestin…",
    "link": "https://www.naturalnews.com/2025-06-08-job-openings-rise-more-than-expected-april.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Homan vows LEGAL ACTION against officials of sanctuary jurisdictions defying federal immigration laws",
    "description": "Border czar Tom Homan warns state and local officials, including Nashville Mayor Freddie O’Connell, that obstructing federal immigration enforcement could lead to DOJ investigations and criminal charges. The Trump administration is escalating efforts to press…",
    "link": "https://www.naturalnews.com/2025-06-08-homan-vows-legal-action-against-sanctuary-officials.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Elon Musk and X: The one Musk business that’s winning from the Donald Trump bust-up",
    "description": "The war of words between the US president and the world’s richest man has been playing out in real time, and there’s one place where people are tuning in to catch the soap opera.",
    "link": "https://www.smh.com.au/business/companies/the-one-musk-business-that-s-winning-from-the-trump-bust-up-20250608-p5m5rh.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Citigroup drops firearms policy, vows political neutrality amid debanking backlash",
    "description": "Citigroup announced it will eliminate its 2018 firearms policy, which had pressured retail clients to adopt stricter gun sales practices (e.g., background checks, age restrictions). The bank framed the original policy as risk management but now calls for neut…",
    "link": "https://www.naturalnews.com/2025-06-08-citigroup-drops-firearms-policy-vows-political-neutrality.html",
    "timestamp": "2025-06-08T06:00:00Z"
  },
  {
    "title": "Dvalishvili, Harrison win bantamweight belts at UFC 316",
    "description": "NEWARK, New Jersey :Georgia's Merab Dvalishvili scored a second-round submission win over Sean O'Malley to retain his bantamweight title at UFC 316 on Saturday, with Kayla Harrison also winning by submission in the co-main event, tapping out Juliana Pena to c…",
    "link": "https://www.channelnewsasia.com/sport/dvalishvili-harrison-win-bantamweight-belts-ufc-316-5170306",
    "timestamp": "2025-06-08T05:51:01Z"
  },
  {
    "title": "Travel ban may shut door for Afghan family to bring niece to US for a better life",
    "description": "Mohammad Sharafoddin, his wife and young son managed to make it out of Afghanistan as refugees nine years ago, at one point walking 36 hours in a row over mountain passes",
    "link": "https://abcnews.go.com/US/wireStory/travel-ban-shut-door-afghan-family-bring-niece-122622522",
    "timestamp": "2025-06-08T05:50:18Z"
  },
  {
    "title": "Trump officials are vowing to end school desegregation orders. Some parents say they're still needed",
    "description": "Six decades after the federal government ordered Concordia Parish to desegregate its schools, the district remains racially divided",
    "link": "https://abcnews.go.com/US/wireStory/trump-officials-vowing-end-school-desegregation-orders-parents-122622161",
    "timestamp": "2025-06-08T05:50:16Z"
  },
  {
    "title": "Bonuses! Holland Earns 10th-Career Post-Fight Award",
    "description": "Official UFC 316 post-fight bonus winners last night (Sat., June 7, 2025) LIVE on ESPN+ PPV from inside Prudential Center in Newark, New Jersey.",
    "link": "https://www.mmamania.com/2025/6/8/24444941/official-bonus-winners-ufc-316-results-espn-ppv-newark-dvalishvili-harrison-holland-yoo",
    "timestamp": "2025-06-08T05:37:17Z"
  },
  {
    "title": "Riots and clashes in Los Angeles: Trump deploys 2,000 National Guard members",
    "description": "Explosive situation after the massive ICE operation to arrest illegal immigrants - Trump - Newsom confrontation intensifies\nThe post Riots and clashes in Los Angeles: Trump deploys 2,000 National Guard members appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/08/riots-and-clashes-in-los-angeles-trump-deploys-2000-national-guard-members/",
    "timestamp": "2025-06-08T05:34:23Z"
  },
  {
    "title": "Around four dozen Nepalis deported from America arriving today",
    "description": "Kathmandu, June 8: Around four dozen Nepalis deported by the US government are arriving in Kathmandu today on a special […]\nThe post Around four dozen Nepalis deported from America arriving today appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/08/around-four-dozen-nepalis-deported-from-america-arriving-today/",
    "timestamp": "2025-06-08T05:33:51Z"
  },
  {
    "title": "Feds use pepper balls, tear gas to disperse crowds in downtown LA",
    "description": "Federal police officers showed out in full force to disperse crowds in downtown Los Angeles Saturday on the second day of unrest.",
    "link": "https://www.nbclosangeles.com/news/local/federal-police-use-pepper-balls-tear-gas-to-disperse-crowds-in-downtown-la-on-second-day-of-unrest/3718152/",
    "timestamp": "2025-06-08T05:25:31Z"
  },
  {
    "title": "Trump threatens Musk with 'serious consequences' in spending bill row",
    "description": "U.S. President Donald Trump threatened his former advisor Elon Musk with \"serious consequences\" Saturday if the tech billionaire seeks to punish Republicans who vote for a controversial spending bill.",
    "link": "https://www.hurriyetdailynews.com/trump-threatens-musk-with-serious-consequences-in-spending-bill-row-210035",
    "timestamp": "2025-06-08T05:25:28Z"
  },
  {
    "title": "'Good Night, and Good Luck' on CNN: How to watch George Clooney's Broadway play for free",
    "description": "The Broadway show \"Good Night, and Good Luck\" has broken box office records since its opening this April — and tonight, June 7, anyone can watch it live on TV. CNN recently announced that it would be televising the Broadway play's penultimate performance live…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/good-night-and-good-luck-on-cnn-how-to-watch-george-clooneys-broadway-play-for-free/articleshow/121703990.cms",
    "timestamp": "2025-06-08T05:24:36Z"
  },
  {
    "title": "Trump deploys National Guard over LA immigration protests",
    "description": "Donald Trump ordered 2,000 National Guard troops to the streets of Los Angeles on Saturday in what the White House said was an effort to quell \"lawlessness,\" after sometimes-violent protests erupted over immigration enforcement raids.",
    "link": "https://www.hurriyetdailynews.com/trump-deploys-national-guard-over-la-immigration-protests-210031",
    "timestamp": "2025-06-08T05:09:15Z"
  },
  {
    "title": "LA protests: Trump officials, protesters, social media clash with LA mayor Karen Bass over ICE immigration crackdown",
    "description": "Los Angeles Immigration Raids Protests: Riots erupted in Los Angeles after ICE arrested over 40 people in immigration raids, triggering a fiery response from local officials and federal leaders. Protesters clashed with federal agents, prompting the Trump admi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/la-protests-trump-officials-protesters-social-media-clash-with-la-mayor-karen-bass-over-immigration-crackdown/articleshow/121703729.cms",
    "timestamp": "2025-06-08T05:08:44Z"
  },
  {
    "title": "Kingspan embraces Donald Trump’s ‘big beautiful bill’",
    "description": "Companies’ views of tax bill will mean little in the shadow of the Trump-Musk feud",
    "link": "https://www.irishtimes.com/business/2025/06/08/kingspan-embraces-donald-trumps-big-beautiful-bill/",
    "timestamp": "2025-06-08T05:00:00Z"
  },
  {
    "title": "Apple’s fall from top of tree reflects cooling growth outlook",
    "description": "Nvidia’s revenue has more than quadrupled in three years, Microsoft’s is up over a third, but Apple’s has barely budged",
    "link": "https://www.irishtimes.com/your-money/2025/06/08/apples-fall-from-top-of-tree-reflects-cooling-growth-outlook/",
    "timestamp": "2025-06-08T05:00:00Z"
  },
  {
    "title": "John Simpson: ‘It’s been great to watch how Ireland went from a pretty backward country to a real powerhouse in Europe’",
    "description": "Veteran journalist and broadcaster, now 80, on the dangers of his profession and his continuing affinity with Ireland",
    "link": "https://www.irishtimes.com/life-style/people/2025/06/08/john-simpson-its-been-great-to-watch-how-ireland-went-from-a-pretty-backward-country-to-a-real-powerhouse-in-europe/",
    "timestamp": "2025-06-08T05:00:00Z"
  },
  {
    "title": "Mark O'Connell: What a surprise to learn this powerful wizard of the Dark Enlightenment is just another needy dork",
    "description": "Curtis Yarvin has, for about a decade and a half now, been a highly influential figure on Silicon Valley’s anti-democratic right",
    "link": "https://www.irishtimes.com/opinion/2025/06/07/mark-oconnell-what-a-surprise-to-learn-this-powerful-wizard-of-the-dark-enlightenment-is-just-another-needy-dork/",
    "timestamp": "2025-06-08T05:00:00Z"
  },
  {
    "title": "California governor pushes back against ‘federal takeover’",
    "description": "Gavin Newsom condemned the federal deployment of the National Guard to Los Angeles, calling it inflammatory and unnecessary Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618792-california-governor-pushes-back-against/",
    "timestamp": "2025-06-08T04:57:05Z"
  },
  {
    "title": "Trump seizes opportunity to deploy federal force in California",
    "description": "The tension on the streets of Los Angeles reflects a widening gulf between California's political leaders and the federal government.",
    "link": "https://news.sky.com/story/trump-seizes-opportunity-to-deploy-federal-force-in-california-13380626",
    "timestamp": "2025-06-08T04:55:00Z"
  },
  {
    "title": "A plague on both their houses",
    "description": "The fight between Trump and Musk is lasting longer than I expected. This article describes the leverage that each has and the harm that each can do to the other. The. problem for Musk is that Trump has all the levers of government (especially the justice depa…",
    "link": "https://freethoughtblogs.com/singham/2025/06/08/a-plague-on-both-their-houses/",
    "timestamp": "2025-06-08T04:54:37Z"
  },
  {
    "title": "What to know about Trump’s deployment of National Guard troops to LA protests",
    "description": "It’s not the first time Trump has activated the National Guard to quell protests.",
    "link": "https://www.bostonherald.com/2025/06/08/immigration-raids-los-angeles-things-to-know/",
    "timestamp": "2025-06-08T04:54:20Z"
  },
  {
    "title": "What to know about Trump's deployment of National Guard troops to LA protests",
    "description": "President Donald Trump says he’s deploying 2,000 California National Guard troops to Los Angeles to respond to immigration protests, over the objections of California Gov. Gavin Newsom",
    "link": "https://abcnews.go.com/US/wireStory/trumps-deployment-national-guard-troops-la-protests-122622792",
    "timestamp": "2025-06-08T04:54:13Z"
  },
  {
    "title": "Will Donald Trump ban X if his nasty feud with Elon Musk escalates? AI Guru's big prediction",
    "description": "The spat between Donald Trump and Elon Musk's bitter verbal duel and social media onslaught became a public spectacle. Amid the growing nasty feud, a former Disney child star turned AI guru has made a big prediction on whether the President will ban Elon Musk…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/will-donald-trump-ban-x-if-his-nasty-feud-with-elon-musk-escalates-ai-gurus-big-prediction/articleshow/121703734.cms",
    "timestamp": "2025-06-08T04:52:55Z"
  },
  {
    "title": "Trump National Golf Club in Bedminster responds after receiving devastating health department grade - NewsBreak",
    "description": "The general manager of the Trump National Golf Club Bedminster claims a bad health inspection was politically motivated. An inspector from the Somerset Cou",
    "link": "https://www.newsbreak.com/share/4042251642604-trump-national-golf-club-in-bedminster-responds-after-receiving-devastating-health-department-grade?s=a2&share_destination_id=MzE0ODIzMDMxLTE3NDkzNTgwNTA2NzM%3D&pd=0LIxqpg2&hl=en_US&send_time=1749358050&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.23.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v1%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v1%2Cns_foryou_model_exp_25q2_v2-v7",
    "timestamp": "2025-06-08T04:48:06Z"
  },
  {
    "title": "Trump Receives Hero’s Welcome at UFC 316 in New Jersey",
    "description": "NEWARK, New Jersey—President Donald Trump sent the Prudential Center into a frenzy with his entrance to UFC 316 Saturday night.\nThe post Trump Receives Hero’s Welcome at UFC 316 in New Jersey appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/07/trump-receives-heros-welcome-at-ufc-316-in-new-jersey/",
    "timestamp": "2025-06-08T04:44:21Z"
  },
  {
    "title": "National Guard troops arrive in Los Angeles on Trump's orders to quell immigration protests",
    "description": "National Guard troops began arriving in Los Angeles early Sunday on orders from U.S. President Donald Trump in response to clashes in recent days between federal immigration authorities and protesters seeking to block them from carrying out deportations.",
    "link": "https://www.cbc.ca/news/world/national-guard-arrives-la-1.7555667",
    "timestamp": "2025-06-08T04:43:45Z"
  },
  {
    "title": "Bowen: Israel is accused of the gravest war crimes - how governments respond could haunt them for years",
    "description": "Distinguished lawyers, senior humanitarians and diplomats tell Jeremy Bowen why they are increasingly concerned about the catastrophe inside Gaza",
    "link": "https://www.bbc.com/news/articles/c0r1xl5wgnko",
    "timestamp": "2025-06-08T04:31:59Z"
  },
  {
    "title": "California unrest: How Los Angeles immigration protests turned ugly after citywide ICE operations",
    "description": "California ICE raids: Los Angeles is facing unrest following ICE raids that led to the arrest of 118 immigrants, sparking protests and clashes between residents and federal agents. In response, President Trump is deploying 2,000 National Guard troops, a move …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/california-unrest-how-los-angeles-immigration-protests-turned-ugly-after-citywide-ice-operations/articleshow/121703580.cms",
    "timestamp": "2025-06-08T04:31:19Z"
  },
  {
    "title": "A World of Enemies: America’s Wars at Home and Abroad",
    "description": "Book Review - Osamah F. Khalil, A World of Enemies: America’s Wars at Home and Abroad from Kennedy to Biden. Cambridge (MA) and London: Harvard University Press, 2024. Munich (Special to Informed Comment; Feature) – “When you say working, are they stopping th…",
    "link": "https://www.juancole.com/2025/06/enemies-americas-abroad.html",
    "timestamp": "2025-06-08T04:15:40Z"
  },
  {
    "title": "California Democrats push to block ICE from Schools, Hospitals and Shelters",
    "description": "By Jeanne Kuang, CalMatters This story was originally published by CalMatters. Sign up for their newsletters. Hospitals. Schools. Shelters. Those are some of the places that California lawmakers want to shield from immigration arrests and raids. They advanced…",
    "link": "https://www.juancole.com/2025/06/california-democrats-hospitals.html",
    "timestamp": "2025-06-08T04:06:47Z"
  },
  {
    "title": "Trump’s Middle East Pivot aims to counter China’s rising Influence",
    "description": "By Maria Papageorgiou, Newcastle University (The Conversation) - The US president, Donald Trump, claimed he was able to secure deals totalling more than US$2 trillion (£1.5 trillion) for the US on his tour of the Gulf states in May. Trump said “there has neve…",
    "link": "https://www.juancole.com/2025/06/trumps-counter-influence.html",
    "timestamp": "2025-06-08T04:04:54Z"
  },
  {
    "title": "Will micro nuclear reactors save military electric vehicles?",
    "description": "Those of us keeping track of electric vehicle (EV) mania, have been relieved and amused as a trend and a historic event coincided. The trend was the triumph of the free market. \r\n\r\nAmericans in increasing numbers came to realize everything they&...",
    "link": "https://www.americanthinker.com/blog/2025/06/will_micro_nuclear_reactors_save_military_electric_vehicles.html",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "ABC’s Terry Moran finally stripped off the fake objectivity mask",
    "description": "Stephen Miller, Donald Trump’s Deputy Chief of Staff for Policy and Homeland Security Advisor, is one of my favorite people in the administration. That’s because he’s got a razor-sharp mind that allows him to expose all the leftist ...",
    "link": "https://www.americanthinker.com/blog/2025/06/abc_s_terry_moran_finally_stripped_off_the_fake_objectivity_mask.html",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "Sigma Lens Prices Climb 10% as Tariffs Come Into Effect",
    "description": "Tariffs have been quite a challenge for many manufacturers around the world. Despite the 90-day pause, many countries have to pay a standard 10% tariff on their goods being sold in the US, with China standing at 30%. This led to the rise of the camera and len…",
    "link": "https://www.thephoblographer.com/2025/06/08/sigma-lens-prices-climb-10-as-tariffs-come-into-effect/",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "How to Live Long and Prosper with Donald Trump",
    "description": "In 1966, when “Star Trek” debuted on NBC, Donald Trump was starting his junior year of college, so it’s unlikely he was spending an hour a week following the Enterprise where no man had gone before. Yet, anyone who did follow that o...",
    "link": "https://www.americanthinker.com/articles/2025/06/how_to_live_long_and_prosper_with_donald_trump.html",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "L.A. burns for the second time in six months, Trump sends troops, and local wokester pols bleat tin-earred responses",
    "description": "Sometimes stupidity can't be fixed.\r\n\r\nWhich brings us to the ridiculous, tin-earred reactions to President Trump's statesmanlike, Reaganesque decision to dispatch the National Guard to restore order to the nation's second-largest city in...",
    "link": "https://www.americanthinker.com/blog/2025/06/l_a_burns_for_the_second_time_in_six_months_trump_sends_troops_and_local_wokester_pols_bleat_tin_earred_responses.html",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "The sheer vacancy and danger of ‘Influencers’",
    "description": "It seems the latest aspiration for (mostly) female teens and young women is to be an “influencer.” For those of you too sane to know what an influencer is, think of it this way: You have a magic box where you, without a staff and fancy eq...",
    "link": "https://www.americanthinker.com/blog/2025/06/the_sheer_vacancy_and_danger_of_influencers.html",
    "timestamp": "2025-06-08T04:00:00Z"
  },
  {
    "title": "US Space Dominance Crippled by Trump-Musk Feud",
    "description": "According to the Washington Post, NASA and the Pentagon are desperately begging SpaceX rivals to accelerate rocket development after Trump’s threats caused Musk to nearly halt all US flights to the ISS.",
    "link": "https://sputnikglobe.com/20250608/us-space-dominance-crippled-by-trump-musk-feud-1122210602.html",
    "timestamp": "2025-06-08T03:59:00Z"
  },
  {
    "title": "The blow-up between Elon Musk and Donald Trump has been entertaining, but how did things go so bad, so fast?",
    "description": "The US president has used and discarded many people in his career. The tech billionaire appears to be the latest.",
    "link": "https://theconversation.com/the-blow-up-between-elon-musk-and-donald-trump-has-been-entertaining-but-how-did-things-go-so-bad-so-fast-258394",
    "timestamp": "2025-06-08T03:55:51Z"
  },
  {
    "title": "Al-Qaeda branch leader threatens Trump, Musk over Gaza war",
    "description": "Saad bin Atef al-Awlaki, leader of Al-Qaeda's Yemen branch (AQAP), issues half-hour video threatening US President Donald Trump and Elon Musk over the Israel-Hamas war in Gaza.",
    "link": "https://www.israelnationalnews.com/news/409601",
    "timestamp": "2025-06-08T03:55:25Z"
  },
  {
    "title": "New questions emerge from the new charges in Kilmar Abrego Garcia case",
    "description": "The sudden return of Kilmar Abrego-Garcia to the United States on Friday to face federal charges of smuggling migrants across the country was a messaging triumph for the Trump administration.",
    "link": "https://www.nbcnews.com/news/us-news/kilmar-abrego-garcia-questions-rcna211601",
    "timestamp": "2025-06-08T03:51:52Z"
  },
  {
    "title": "NASA, ISRO to launch private mission to space with Indian pilot on June 10",
    "description": "NASA and ISRO collaborate on Axiom Mission 4, launching June 10 with Indian astronaut Shubhanshu Shukla as pilot. This mission fulfills a commitment made by US President Donald Trump and Prime Minister Narendra Modi. The crew, including astronauts from Poland…",
    "link": "https://economictimes.indiatimes.com/news/india/nasa-isro-to-launch-private-mission-to-space-with-indian-pilot-on-june-10/articleshow/121703249.cms",
    "timestamp": "2025-06-08T03:39:53Z"
  },
  {
    "title": "Apple under pressure to shine after AI stumble",
    "description": "Industry insiders will be watching to see whether Apple addresses the AI stumble or focuses on less splashy announcements, including a rumored overhaul of its operating systems for its line of devices. \"The bottom line is Apple seemed to underestimate the AI …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/apple-under-pressure-to-shine-after-ai-stumble/articleshow/121703245.cms",
    "timestamp": "2025-06-08T03:38:39Z"
  },
  {
    "title": "FAFO! 'Totally Organic' Riots Break Out in NYC",
    "description": "As Los Angeles police and ICE agents battle Marxists in Los Angeles, the New York Police Department (NYPD) has had its hands full as it battles keffiyeh-clad hoons in the Big Apple. Check out how many rioters are covering their faces: JUST IN: NYPD are goin…",
    "link": "https://freerepublic.com/focus/f-news/4321648/posts",
    "timestamp": "2025-06-08T03:38:19Z"
  },
  {
    "title": "“MAN. MYTH. LEGEND.”: Donald Trump’s UFC walkout in Newark goes viral as crowd cheers and phones flash",
    "description": "US President Donald Trump stole the spotlight at UFC 316 in Newark with a dramatic entrance alongside UFC President Dana White. The event briefly paused his public feud with Elon Musk, as Trump took his cageside seat with family and political allies. Fans che…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/man-myth-legend-donald-trumps-ufc-walkout-in-newark-goes-viral-as-crowd-cheers-and-phones-flash/articleshow/121703174.cms",
    "timestamp": "2025-06-08T03:38:12Z"
  },
  {
    "title": "US Demands UK Veto China Embassy Site",
    "description": "Washington warns London that China’s planned embassy near key data centers poses a major espionage risk, the Times reported.",
    "link": "https://sputnikglobe.com/20250608/us-demands-uk-veto-china-embassy-site-1122210462.html",
    "timestamp": "2025-06-08T03:38:00Z"
  },
  {
    "title": "Trump's Deputies Warn L.A. Rioters of Pending Arrests",
    "description": "President Donald Trump is threatening to end the \"riots & looters, the way it should be solved,\" if California's Democratic leaders do not shut down violent riots by pro-migration rioters.\nThe post Trump’s Deputies Warn L.A. Rioters of Pending Arrests appeare…",
    "link": "https://www.breitbart.com/immigration/2025/06/07/trumps-deputies-warn-l-a-rioters-of-pending-arrests/",
    "timestamp": "2025-06-08T03:36:43Z"
  },
  {
    "title": "CBS News’ Scott Pelley: Settlement With Trump Would be ‘Very Damaging’ to CBS and Paramount",
    "description": "CBS News veteran Scott Pelley sounded the alarm about the possiblity of Paramount Global reaching a settlement in the unprecedented lawsuit filed against the network and “60 Minutes” last year by President Donald Trump. Pelley took part Saturday night in a ro…",
    "link": "https://variety.com/2025/biz/news/scott-pelley-trump-settlement-damaging-cbs-paramount-1236422379/",
    "timestamp": "2025-06-08T03:36:34Z"
  },
  {
    "title": "Noem, Bondi Slam Democrats After Violent Mob Attacks ICE Agents in L.A",
    "description": "Federal officials are sounding the alarm after violent mobs confronted ICE agents in Los Angeles, blaming what they call “reckless and dangerous” rhetoric from Democrat leaders for fueling the chaos. As agents attempted to carry out lawful immigration enforce…",
    "link": "https://freerepublic.com/focus/f-news/4321646/posts",
    "timestamp": "2025-06-08T03:35:47Z"
  },
  {
    "title": "Apple under pressure to shine after AI stumble",
    "description": "Pressure is on Apple to show it hasn’t lost its magic despite broken promises to ramp up iPhones with generative artificial intelligence (GenAI) as rivals race ahead with the technology. Apple will showcase plans for its coveted devices and the software power…",
    "link": "https://www.digitaljournal.com/world/apple-under-pressure-to-shine-after-ai-stumble/article",
    "timestamp": "2025-06-08T03:32:32Z"
  },
  {
    "title": "Trump Holds the Power In Feud with Musk",
    "description": "Dan Balz: “There will be no true winners in the spectacular breakup between President Donald Trump and Elon Musk, two alpha males with enormous egos and a penchant for rhetorical combat — and for excess.",
    "link": "https://politicalwire.com/2025/06/07/trump-holds-the-power-in-feud-with-musk/",
    "timestamp": "2025-06-08T03:31:00Z"
  },
  {
    "title": "Bitcoin Stabilizes At $104,000 Mid-Range As Market Eyes Next Breakout",
    "description": "Bitcoin saw a sharp price dip on Thursday amidst a public fallout between US President Donald Trump and the world’s richest man Elon Musk. The premier cryptocurrency, which had traded steadily within the $104,000–$106,000 range throughout the week, plunged to…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-stabilizes-at-104000-mid-range-as-market-eyes-next-breakout/",
    "timestamp": "2025-06-08T03:30:16Z"
  },
  {
    "title": "Trump Administration Sending National Guard to L.A. to Address Violent Riots",
    "description": "The Trump administration revealed that it is sending the National Guard to Los Angeles to address the ongoing violent riots against U.S. Immigration and Customs Enforcement (ICE) agents.\nThe post Trump Administration Sending National Guard to L.A. to Address …",
    "link": "https://www.breitbart.com/politics/2025/06/07/trump-administration-sending-national-guard-to-l-a-to-address-violent-riots/",
    "timestamp": "2025-06-08T03:25:21Z"
  },
  {
    "title": "LA immigration protests live updates: Trump deploys 2,000 National Guard members",
    "description": "California Gov. Gavin Newsom called the move \"purposefully inflammatory.\"",
    "link": "https://abcnews.go.com/US/live-updates/la-immigration-protests-live-updates-trump-deploys-2000/?id=122621279",
    "timestamp": "2025-06-08T03:23:11Z"
  },
  {
    "title": "Russia Steps Up 'Brutal' Assault On Kharkiv, Raising Death Toll, Injuring Dozens",
    "description": "Russia continued to blast Kharkiv, Ukraine's second-largest city, following up on one of the most powerful attacks since the start of its 2022 full-scale invasion with a new round of air strikes late on June 7.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250607-rferl02.htm",
    "timestamp": "2025-06-08T03:21:44Z"
  },
  {
    "title": "Ukraine Gave Russia Reason to 'Bomb The Hell Out of Them' - Trump",
    "description": "US President Donald Trump said that Kiev gave Russian President Vladimir Putin a reason to \"bomb the hell out of them\" when Ukraine attacked airfields in several Russian regions earlier this month.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250607-sputnik05.htm",
    "timestamp": "2025-06-08T03:21:12Z"
  },
  {
    "title": "Trump attends UFC championship fight in NJ, taking a break from politics, Musk feud",
    "description": "President Donald Trump walked out to a thunderous standing ovation just ahead of the start of the UFC pay-per-view card at the Prudential Center, putting his public feud with tech billionaire Elon Musk on hold to instead watch the fierce battles inside...",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-attends-ufc-championship-fight-new-jersey-taking-122621278",
    "timestamp": "2025-06-08T03:13:10Z"
  },
  {
    "title": "Patel promises FBI coming for anyone assaulting cops as Los Angeles erupts over ICE raids",
    "description": "Violent anti-ICE riots in Los Angeles prompt federal response after protesters attack Border Patrol agents with rocks, leading FBI and DHS officials to promise full prosecution.",
    "link": "https://www.foxnews.com/us/patel-promises-fbi-coming-anyone-assaulting-cops-los-angeles-erupts-over-ice-raids",
    "timestamp": "2025-06-08T03:10:34Z"
  },
  {
    "title": "Taiwan detects Chinese incursions near its territory",
    "description": "Taiwan's defense ministry reported increased Chinese military activity, with multiple aircraft and naval vessels operating around the island. Some aircraft entered Taiwan's ADIZ, prompting monitoring and responses from Taiwanese forces. Meanwhile, Taiwan's fo…",
    "link": "https://economictimes.indiatimes.com/news/defence/taiwan-detects-chinese-incursions-near-its-territory/articleshow/121703097.cms",
    "timestamp": "2025-06-08T03:07:04Z"
  },
  {
    "title": "World leaders head to France for U.N. summit on ocean threats",
    "description": "World leaders descend on the French Riviera on Sunday ahead of a high-level summit to tackle a deepening crisis in the oceans driven by overfishing, climate change and pollution. The United Nations says oceans face an &quot;emergency&quot; and leaders gatheri…",
    "link": "https://japantoday.com/category/world/world-leaders-head-to-france-for-un-summit-on-ocean-threats",
    "timestamp": "2025-06-08T03:05:13Z"
  },
  {
    "title": "Long Island town holds ‘Save the Chiefs’ rally in defiance of state ban on mascot",
    "description": "Massapequa is pulling out all the stops to preserve its Chiefs team name, including holding a festival at the high school's parking lot Saturday to fundraise a legal battle against New York state and its 2023 ban on Native American team names and logos.",
    "link": "https://nypost.com/2025/06/07/us-news/long-island-town-holds-save-the-chiefs-rally-in-defiance-of-state-ban/",
    "timestamp": "2025-06-08T02:59:34Z"
  },
  {
    "title": "Pro-DEI Musk Ally Jared Isaacman Arrested, Sued by Trump Casino Over Fraudulent Checks in 2009",
    "description": "Jared Isaacman, the billionaire astronaut who had his nomination to lead NASA revoked by President Donald Trump over his donations to far-left Democrats, was arrested on fraud charges and sued by Trump's New Jersey casino in 2010 for allegedly writing $1 mill…",
    "link": "https://www.breitbart.com/politics/2025/06/07/pro-dei-musk-ally-jared-isaacman-arrested-sued-by-trump-casino-over-fraudulent-checks-in-2009/",
    "timestamp": "2025-06-08T02:57:27Z"
  },
  {
    "title": "Los Angeles descends into chaos after police chief says officers will not aid ICE agents; Trump sends National Guard troops",
    "description": "The rule of law seems to be collapsing in the city of Los Angeles after protesters against ICE raids turned to violence and vandalism to try to stop immigration enforcement.\n\nVideos on social media have captured numerous incidents of anti-ICE rioters throwing…",
    "link": "https://www.theblaze.com/news/trump-national-guard-ice-riots",
    "timestamp": "2025-06-08T02:57:04Z"
  },
  {
    "title": "Trump's UFC 316 appearance draws massive ovation in New Jersey, fighter celebrates with him after win",
    "description": "President Donald Trump was greeted by a raucous Newark, New Jersey, crowd as he walked into UFC 316 on Saturday night as his social media feud with Elon Musk continues.",
    "link": "https://www.foxnews.com/sports/trumps-ufc-316-appearance-draws-massive-ovation-new-jersey-fighter-celebrates-him-after-win",
    "timestamp": "2025-06-08T02:51:15Z"
  }
]