[
  {
    "title": "Trump says the US has seized an oil tanker off the coast of Venezuela",
    "description": "President Donald Trump says the United States has seized an oil tanker off the coast of Venezuela as tensions mount with the government of President Nicolás Maduro. Using U.S. forces to take control of a merchant ship is incredibly unusual…",
    "link": "https://apnews.com/article/trump-tanker-seized-venezuela-maduro-0a148ba01684fc6ce1a228dd276732c0",
    "timestamp": "2025-12-11T01:05:33Z"
  },
  {
    "title": "'Politically active' travellers most at risk over US proposal to reveal social media history",
    "description": "Australians travelling to the United States could soon face an unprecedented invasion of privacy, an international law expert has warned.",
    "link": "https://www.abc.net.au/news/2025-12-11/us-travel-social-media-privacy-concerns/106128910",
    "timestamp": "2025-12-11T01:04:36Z"
  },
  {
    "title": "Ben Shapiro Warns Republicans a Hardline Obamacare Stance Will ‘Lead to Democrats in Power in 2028’",
    "description": "Ben Shapiro offered Republicans some advice as they are barreling towards an \"ugly\" 2026 midterm — and potentially a Democrat retaking the presidency in 2028\nThe post Ben Shapiro Warns Republicans a Hardline Obamacare Stance Will ‘Lead to Democrats in Power i…",
    "link": "https://www.mediaite.com/politics/ben-shapiro-warns-republicans-a-hardline-obamacare-stance-will-lead-to-democrats-in-power-in-2028/",
    "timestamp": "2025-12-11T01:00:21Z"
  },
  {
    "title": "Trump's 'Clearly Fading': The Don Accused of Having 'Low Energy' During Pennsylvania Rally as Prez Puts 'Mental Weakness' on Full Display",
    "description": "Donald Trump hit the road for a rally to promote his economic plans but got slammed for showing his 'mental weakness' by a former GOP strategist.",
    "link": "https://radaronline.com/p/trump-low-energy-weak-pennsylvania-rally/",
    "timestamp": "2025-12-11T00:55:00Z"
  },
  {
    "title": "US House backs massive defense policy bill, Senate next",
    "description": "The U.S. House of Representatives has approved a massive defense bill. This legislation authorizes a record $901 billion for military spending. It also includes significant military assistance for Ukraine. The bill is now heading to the Senate for approval. T…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-house-backs-massive-defense-policy-bill-senate-next/articleshow/125900514.cms",
    "timestamp": "2025-12-11T00:54:24Z"
  },
  {
    "title": "Divided Fed cuts rates, hints at a pause and just one cut next year as growth rebounds",
    "description": "With incomplete economic data after a lengthy government shutdown, the Fed expects inflation to ease to around 2.4% next year even as growth strengthens.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/divided-fed-cuts-rates-hints-at-a-pause-and-just-one-cut-next-year-as-growth-rebounds/article70382885.ece",
    "timestamp": "2025-12-11T00:53:44Z"
  },
  {
    "title": "MS NOW's Heilemann: No Republican Wants 'Toxic' Trump in Their District",
    "description": "Wednesday on MS NOW's \"Deadline,\" network national affairs analyst John Heilemann claimed no Republican lawmaker will want President Donald Trump to campaign for them because he was \"toxic.\"\nThe post MS NOW’s Heilemann: No Republican Wants ‘Toxic’ Trump in Th…",
    "link": "https://www.breitbart.com/clips/2025/12/10/ms-nows-heilemann-no-republican-in-the-country-wants-toxic-trump-in-their-district/",
    "timestamp": "2025-12-11T00:53:16Z"
  },
  {
    "title": "New York Times, after Trump post, says it won’t be deterred from writing about his health",
    "description": "The New York Times and President Donald Trump are fighting again.",
    "link": "https://www.bostonherald.com/2025/12/10/new-york-times-trump-health/",
    "timestamp": "2025-12-11T00:51:35Z"
  },
  {
    "title": "Newsom, 58, Trolls Trump, 79, Over His Late-Night Health Meltdown",
    "description": "Newsom, 58, Trolls Trump, 79, Over His Late-Night Health Meltdownthedailybeast.com",
    "link": "https://www.thedailybeast.com/gavin-newsom-58-trolls-trump-79-over-his-late-night-health-meltdown/",
    "timestamp": "2025-12-11T00:50:25Z"
  },
  {
    "title": "GOP lawmakers seek Trump aid for agricultural equipment after tariff pressure",
    "description": "Republican lawmakers are appealing to President Donald Trump for more farm relief and aid for agricultural equipment manufacturers amid his tariff blitz, even as the president has made a $12 billion bailout for farmers hurt by his trade policies.\nFarmers have…",
    "link": "https://biztoc.com/x/ec318ed4939457aa",
    "timestamp": "2025-12-11T00:50:14Z"
  },
  {
    "title": "Ford suppliers receive China's new streamlined rare-earth licenses",
    "description": "China has issued new export licenses for rare-earth magnets to suppliers of US automaker Ford Motor. This move aims to boost shipments and reduce shortages of vital components. The general licenses were agreed upon after a meeting between Presidents Xi Jinpin…",
    "link": "https://economictimes.indiatimes.com/news/international/business/ford-suppliers-receive-chinas-new-streamlined-rare-earth-licenses/articleshow/125900503.cms",
    "timestamp": "2025-12-11T00:50:02Z"
  },
  {
    "title": "Elon Musk Says Trump Is 'Naturally Funny' While Recalling The Mamdani Moment — Blames This Innovation For 'Rotting People's Brains'",
    "description": "Earlier this week, during a conversation, Tesla Inc. (NASDAQ:TSLA), SpaceX and xAI CEO Elon Musk named President Donald Trump the funniest person he knows on Earth.\nMusk Calls Trump Effortlessly Funny\nMusk said Trump is one of the funniest people he knows, de…",
    "link": "https://biztoc.com/x/a0d9f235b4dec204",
    "timestamp": "2025-12-11T00:49:44Z"
  },
  {
    "title": "GOP lawmakers seek Trump aid for agricultural equipment after tariff pressure",
    "description": "Top lawmakers signaled that more federal help to farmers could be on the way, which could help tractor sales.",
    "link": "https://www.cnbc.com/2025/12/10/trump-aid-agricultural-equipment-farm-trade.html",
    "timestamp": "2025-12-11T00:47:11Z"
  },
  {
    "title": "200,000 Flee Congo After Trump’s ‘Historic’ Peace Deal",
    "description": "Why the Rwanda-Congo accord misses the point.",
    "link": "http://foreignpolicy.com/2025/12/10/congo-peace-deal-fighting-rwanda-m23-trump-historic-deal/",
    "timestamp": "2025-12-11T00:45:51Z"
  },
  {
    "title": "Malaysians in Cambodia advised to avoid travel to border provinces amid conflict",
    "description": "KUALA LUMPUR: Malaysian citizens in Cambodia are advised to avoid non-essential travel to certain places in the country for safety reasons. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/12/11/malaysians-in-cambodia-advised-to-avoid-travel-to-border-provinces-amid-conflict",
    "timestamp": "2025-12-11T00:43:00Z"
  },
  {
    "title": "Trump's 'gold card' program goes live, offering US visas starting at $1 million per person (Will Weissert/Associated Press)",
    "description": "Will Weissert / Associated Press:\nTrump's ‘gold card’ program goes live, offering US visas starting at $1 million per person  —  President Donald Trump announced Wednesday that his long-promised “ gold card ” was officially going on sale, offering legal statu…",
    "link": "https://www.memeorandum.com/251210/p124",
    "timestamp": "2025-12-11T00:40:01Z"
  },
  {
    "title": "Bondi shares heart-pounding footage of US seizing Venezuelan oil tanker in rare action last seen in 2014",
    "description": "The U.S. military seized an Venezuelan oil tanker in a rare operation targeting sanctions violations. Armed agents rappelled from helicopters in the dramatic takedown.",
    "link": "https://www.foxnews.com/politics/bondi-shares-heart-pounding-footage-us-seizing-venezuelan-oil-tanker-rare-action-last-seen-2014",
    "timestamp": "2025-12-11T00:36:22Z"
  },
  {
    "title": "Tom Cruise didn’t want to ask Donald Trump for a favor to get his outer space movie off ground: source",
    "description": "It's perhaps the latest instance of how Trump can get movies made these days, and how Cruise is allegedly reluctant to court the commander-in-chief.",
    "link": "https://pagesix.com/2025/12/10/entertainment/tom-cruise-didnt-want-to-ask-donald-trump-for-a-favor-to-get-his-outer-space-movie-off-ground-source/",
    "timestamp": "2025-12-11T00:34:58Z"
  },
  {
    "title": "US plans to ask visitors to share 5 years of social media history to enter",
    "description": "Tourists from 42 countries may soon need to also disclose email accounts, extensive family history and biometrics.",
    "link": "https://www.aljazeera.com/news/2025/12/11/us-plans-to-ask-visitors-to-share-5-years-of-social-media-history-to-enter",
    "timestamp": "2025-12-11T00:33:25Z"
  },
  {
    "title": "Radio Host Torches Democrats For ‘Playing Footsie’ With Trump",
    "description": "Charlamagne Tha God also accused left-wing leadership of “normalizing fascism” and making the term “mean absolutely nothing.”",
    "link": "https://www.huffpost.com/entry/charlamagne-tha-god-democrats-playing-footsie-trump-fascism_n_6939a5fee4b028000c59fbcc",
    "timestamp": "2025-12-11T00:33:00Z"
  },
  {
    "title": "Trump’s favored health plan has been tried — and it left millions buried in medical debt - NewsBreak",
    "description": "Sarah Monroe once had a relatively comfortable middle-class life. She and her family lived in a neatly landscaped neighborhood near Cleveland. They had a s",
    "link": "https://www.newsbreak.com/share/4388582789762-trump-s-favored-health-plan-has-been-tried-and-it-left-millions-buried-in-medical-debt?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NjU0MTI5ODQ2MTY%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1765412984&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-11T00:30:22Z"
  },
  {
    "title": "House passes Pentagon bill pressuring Hegseth to release boat strike evidence (Noah Robertson/Washington Post)",
    "description": "Noah Robertson / Washington Post:\nHouse passes Pentagon bill pressuring Hegseth to release boat strike evidence  —  The Senate could approve the measure in coming days, and lawmakers say they are confident President Donald Trump will sign it into law. … The H…",
    "link": "https://www.memeorandum.com/251210/p120",
    "timestamp": "2025-12-11T00:30:00Z"
  },
  {
    "title": "US seizes sanctioned oil tanker near Venezuela, Trump confirms",
    "description": "WASHINGTON DC: US President Donald Trump announced on Wednesday that the United States has intercepted a sanctioned oil tanker off the Venezuelan coast, a development that pushed global oil prices higher and further heightened tensions between Washington and …",
    "link": "https://english.khabarhub.com/2025/11/511042/",
    "timestamp": "2025-12-11T00:29:43Z"
  },
  {
    "title": "Venezuela: US committed 'piracy' with tanker seizure",
    "description": "Venezuela condemned Washington's seizure of an oil tanker off its coast as an act of \"international piracy\" and accused United States President Donald Trump of seeking to \"seize Venezuelan oil without...",
    "link": "https://biztoc.com/x/26cd2ca44d04e6c9",
    "timestamp": "2025-12-11T00:27:47Z"
  },
  {
    "title": "Ukraine presents response to US peace plan as Trump says European leaders want a meeting",
    "description": "Ukraine delivered its response to the latest US-drafted peace proposal aimed at ending the war with Russia to the Trump administration on Wednesday, US and Ukrainian officials told CNN, as the contours of a tenuous potential deal take shape and the US preside…",
    "link": "https://freerepublic.com/focus/f-news/4356845/posts",
    "timestamp": "2025-12-11T00:26:14Z"
  },
  {
    "title": "Speaker Johnson Complains ‘I’m Baited Every Day’ Whenever Reporters Ask Him About Trump’s Wild Comments",
    "description": "Mike Johnson expressed annoyance at the fact that he is asked to respond when President Donald Trump says or does something noteworthy. \nThe post Speaker Johnson Complains ‘I’m Baited Every Day’ Whenever Reporters Ask Him About Trump’s Wild Comments first app…",
    "link": "https://www.mediaite.com/politics/speaker-johnson-complains-im-baited-every-day-whenever-reporters-ask-him-about-trumps-wild-comments/",
    "timestamp": "2025-12-11T00:25:45Z"
  },
  {
    "title": "Alyssa Farah Griffin Says Trump Can’t Comprehend Affordability Crisis While Living in a Gilded White House: ’A Different Universe’ | Video",
    "description": "\"It feels like a slap in the face to voters,\" she adds\nThe post Alyssa Farah Griffin Says Trump Can’t Comprehend Affordability Crisis While Living in a Gilded White House: ’A Different Universe’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/alyssa-farah-griffin-trump-affordability-gilded-white-house/",
    "timestamp": "2025-12-11T00:24:38Z"
  },
  {
    "title": "Trump says CNN should be sold as part of any Warner Bros. deal",
    "description": "The president's comments are notable because the proposed deal with Netflix would not include cable channels owned by Warner Bros. Discovery, such as CNN, TNT.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-cnn-warner-bros-discovery-netflix-paramount-rcna248518",
    "timestamp": "2025-12-11T00:24:31Z"
  },
  {
    "title": "Walz tells Noem to 'respect the Constitution' after ICE agents detain US citizens",
    "description": "Minnesota Gov. Tim Walz sent a letter to Department of Homeland Security (DHS) Secretary Kristi Noem urging a review of Immigration and Customs Enforcement (ICE) operations in Minneapolis after U.S. citizens were detained by federal agents.",
    "link": "https://www.fox9.com/news/gov-walz-dhs-secretary-noem-respect-constitution-dec-10",
    "timestamp": "2025-12-11T00:24:17Z"
  },
  {
    "title": "Mike Johnson Finally Reveals GOP’s Health Care Plan—and It’s Rough - NewsBreak",
    "description": "House Speaker Mike Johnson just unveiled Republicans’ plan to address spiking health care costs—and it’s a disaster. As Affordable Care Act tax credits are",
    "link": "https://www.newsbreak.com/share/4390553468696-mike-johnson-finally-reveals-gop-s-health-care-plan-and-it-s-rough?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NjU0MTI2MzYzMzU%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1765412636&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-11T00:24:11Z"
  },
  {
    "title": "Justice Ketanji Brown Jackson Argues Presidents Should Not Be Able to Fire Government Experts",
    "description": "Supreme Court Justice Ketanji Brown Jackson argued that the president of the United States should not be able to fire government experts such as scientists, doctors, economists, and PhDs, and she claimed it is “not in the best interest” of American citizens. …",
    "link": "https://freerepublic.com/focus/f-backroom/4356844/posts",
    "timestamp": "2025-12-11T00:21:47Z"
  },
  {
    "title": "US Congress advances bill to nix Caesar Act sanctions on Syria",
    "description": "The US has rolled back a series of restrictive economic sanctions put in place during the rule of Bashar al-Assad.",
    "link": "https://www.aljazeera.com/news/2025/12/11/us-congress-advances-bill-to-nix-caesar-act-sanctions-on-syria",
    "timestamp": "2025-12-11T00:20:16Z"
  },
  {
    "title": "Shares in AI giant Oracle fall after revenue miss ramping up bubble fears",
    "description": "The cloud computing giant's revenue miss renews questions about its financial health",
    "link": "https://www.bbc.com/news/articles/c9qe1e374l1o",
    "timestamp": "2025-12-11T00:19:20Z"
  },
  {
    "title": "Venezuela accuses US of 'blatant theft' after tanker seized in Caribbean",
    "description": "CARACAS, Dec 10 - The Venezuelan government has accused the United States of \"blatant theft\" after it seized a sanctioned oil tanker off the coast of Venezuela, it said in a statement. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/venezuela-accuses-us-of-039blatant-theft039-after-tanker-seized-in-caribbean",
    "timestamp": "2025-12-11T00:19:00Z"
  },
  {
    "title": "Danish spy agency calls US a potential risk to global security",
    "description": "“There is uncertainty about the role of the United States as a guarantor of Europe’s security,\" the report said",
    "link": "https://www.salon.com/2025/12/10/danish-spy-agency-calls-us-a-potential-risk-to-global-security/",
    "timestamp": "2025-12-11T00:18:58Z"
  },
  {
    "title": "Muslim Somali Immigrants Pose Risk To Christian Brethren, Pastor Says",
    "description": "Missionary efforts in Minnesota have been curtailed due to fear stemming from Somali culture, leaders in the Lutheran Church said.",
    "link": "https://dailycaller.com/2025/12/10/muslim-somali-immigrants-christian-dinku-bato-lutheran-heritage-foundation/",
    "timestamp": "2025-12-11T00:16:51Z"
  },
  {
    "title": "Donald Trump Reacts to Miami Mayoral Elections Results",
    "description": "President Donald Trump reacted after Eileen Higgins defeated Republican Emilio González in a runoff election to be Miami's next mayor on Tuesday, becoming the first Democrat elected to lead the major Florida city in nearly 30 years.\nTrump was asked Wednesday …",
    "link": "https://biztoc.com/x/8a4541395170464e",
    "timestamp": "2025-12-11T00:16:44Z"
  },
  {
    "title": "Trump Says Fed Should Have Doubled interest Rate Cut",
    "description": "President Donald Trump said he would meet with former Federal Reserve Governor Kevin Warsh as he searches for the next chair of the central bank.\nTrump said he is looking for somebody that will be honest with interest rates and that his view is that the rate …",
    "link": "https://biztoc.com/x/acdfd74704e46b1a",
    "timestamp": "2025-12-11T00:16:36Z"
  },
  {
    "title": "Trump, Citing CNN, Sure Seems To Have Picked A Side In Warner Bros. Fight",
    "description": "“I don’t think they should be entrusted with running CNN any longer,” the president said",
    "link": "https://www.huffpost.com/entry/trump-cnn-warner-bros-netflix-merger_n_6939e77ee4b0cfabad2534f7",
    "timestamp": "2025-12-11T00:15:04Z"
  },
  {
    "title": "How voters really feel about affordability (Amber Phillips/Washington Post)",
    "description": "Amber Phillips / Washington Post:\nHow voters really feel about affordability  —  Trump brushes it off, but the evidence is piling up that Americans are unhappy with their economic situations.  —  Just now … President Donald Trump says he's working on bringing…",
    "link": "https://www.memeorandum.com/251210/p116",
    "timestamp": "2025-12-11T00:15:00Z"
  },
  {
    "title": "Trump finally confirms using vulgar slur about several countries in 2018 (Amy B Wang/Washington Post)",
    "description": "Amy B Wang / Washington Post:\nTrump finally confirms using vulgar slur about several countries in 2018  —  Trump previously denied using the language about Haiti, El Salvador and several African countries — before his nonchalant admission at a rally Tuesday. …",
    "link": "https://www.memeorandum.com/251210/p118",
    "timestamp": "2025-12-11T00:15:00Z"
  },
  {
    "title": "Wikipedia won’t fix its woke bias — so competitors are on the rise",
    "description": "My own Wikipedia page is filled with not just mistakes but smears — and its misinformation spreads into everything online.",
    "link": "https://nypost.com/2025/12/10/opinion/wikipedia-wont-fix-its-woke-bias-so-competitors-are-on-the-rise/",
    "timestamp": "2025-12-11T00:14:42Z"
  },
  {
    "title": "Democrats will strangle AI with woke rules — unless Trump takes action",
    "description": "Joe Biden tried to turn AI into a federal hand puppet serving activists' goals. Now Democrats are looking to blue states to harness AI instead.",
    "link": "https://nypost.com/2025/12/10/opinion/democrats-will-strangle-ai-with-woke-rules-unless-trump-acts-now/",
    "timestamp": "2025-12-11T00:09:13Z"
  },
  {
    "title": "About face: Lawsuit targets plan to put Trump's image on popular national parks pass",
    "description": "About face: Lawsuit targets plan to put Trump's image on popular national parks passgo.com",
    "link": "https://abcnews.go.com/US/face-lawsuit-targets-plan-put-trumps-image-popular/story?id=128292660",
    "timestamp": "2025-12-11T00:07:47Z"
  },
  {
    "title": "Trump rages that New York Times and others are ‘seditious ... even treasonous’ to report that he’s not in great health",
    "description": "President Donald Trump has raged against The New York Times , accusing the publication of “seditious, perhaps even treasonous” behavior after a recent op-e",
    "link": "https://www.newsbreak.com/share/4389626985779-trump-rages-that-new-york-times-and-others-are-seditious-even-treasonous-to-report-that-he-s-not-in-great-health?s=a2&amp;share_destination_id=MzI5MzI0MDczLTE3NjU0MTE1Njg4NDg%3D&amp;pd=0MHoEbfp&amp;hl=en_US&amp;send_time=1765411568&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.49.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-11T00:07:46Z"
  },
  {
    "title": "Scores of government statisticians are gone, leaving data at risk, report says",
    "description": "Some agencies lost up to 95% of their staff, including senior managers and data scientists.",
    "link": "https://www.bostonherald.com/2025/12/10/us-data-at-risk/",
    "timestamp": "2025-12-11T00:07:22Z"
  },
  {
    "title": "Scores of government statisticians are gone, leaving data at risk, report says",
    "description": "Some agencies lost up to 95% of their staff, including senior managers and data scientists.",
    "link": "https://www.denverpost.com/2025/12/10/us-data-at-risk/",
    "timestamp": "2025-12-11T00:07:22Z"
  },
  {
    "title": "UK pharma boss says US is the best country to invest in",
    "description": "In an interview with the BBC, Dame Emma Walmsley says she will not \"shy away\" from GSK's US expansion.",
    "link": "https://www.bbc.com/news/articles/cwywp3y35ryo",
    "timestamp": "2025-12-11T00:06:39Z"
  },
  {
    "title": "Seattle Pride World Cup Match Features Antigay Egypt and Iran",
    "description": "Teams from two antigay countries are playing Seattle's \"Pride Match.\"\n \n by Nathalie Graham\n \n \n \n The World Cup is coming to North America next year—and Seattle’s hosting a handful of games. You know, the ones Donald Trump threatened to take away because he …",
    "link": "https://www.thestranger.com/news/2025/12/10/80367704/seattle-pride-world-cup-match-features-antigay-egypt-and-iran",
    "timestamp": "2025-12-11T00:06:00Z"
  },
  {
    "title": "Trump repeatedly bumped by bathroom door during hilarious AF1 gaggle: 'Come on out!'",
    "description": "President Donald Trump handled an awkward bathroom door mishap with humor during a mid-flight press briefing aboard Air Force One on Tuesday.",
    "link": "https://www.foxnews.com/politics/trump-repeatedly-bumped-bathroom-door-during-hilarious-af1-gaggle-come-out",
    "timestamp": "2025-12-11T00:05:08Z"
  },
  {
    "title": "Marjorie Taylor Greene Sets ‘The View’ Return in January",
    "description": "EP Brian Teta says the Republican congresswoman will interview again on the ABC talk show two days after her last day in Congress\nThe post Marjorie Taylor Greene Sets ‘The View’ Return in January appeared first on TheWrap.",
    "link": "https://www.thewrap.com/marjorie-taylor-greene-the-view-return-january-2026/",
    "timestamp": "2025-12-11T00:04:46Z"
  },
  {
    "title": "Trump admin's 'unthinkable' move gets rare 30,000-foot rebuke from air safety official",
    "description": "President Donald Trump's administration received a rare rebuke on Wednesday from an air safety official over a provision tucked away in the annual defense spending bill. Jennifer Homendy, chairwoman of the National Transportation Safety Board, spoke at a pres…",
    "link": "https://www.rawstory.com/trump-2674389141/",
    "timestamp": "2025-12-11T00:03:02Z"
  },
  {
    "title": "What a Democrat’s victory in the Miami mayoral election may mean for Trump",
    "description": "Higgins secured a decisive win over Trump’s pick, Emilio Gonzalez, on Tuesday.",
    "link": "https://www.bostonherald.com/2025/12/10/us-election-2025-mayor-miami-what-to-know/",
    "timestamp": "2025-12-11T00:01:56Z"
  },
  {
    "title": "Judge orders release of grand jury files in Epstein’s 2019 sex trafficking case",
    "description": "A judge reversed course on releasing grand jury docs from the 2019 sex trafficking case against Epstein.",
    "link": "https://www.salon.com/2025/12/10/judge-orders-release-of-grand-jury-files-in-epsteins-2019-sex-trafficking-case/",
    "timestamp": "2025-12-11T00:01:45Z"
  },
  {
    "title": "House passes annual defense bill to raise troop pay and overhaul weapons purchases",
    "description": "The bill's passage on a 312-112 vote comes at a time of increasing friction between the Republican-controlled Congress and President Donald Trump’s administration over the management of the military.",
    "link": "https://www.pbs.org/newshour/politics/house-passes-annual-defense-bill-to-raise-troop-pay-and-overhaul-weapons-purchases",
    "timestamp": "2025-12-11T00:00:58Z"
  },
  {
    "title": "Mamdani declares he's ready for 'any consequence' for standing against Trump's federal immigration enforcement",
    "description": "NYC mayor-elect Zohran Mamdani says he's prepared for any consequence from defying President Donald Trump's immigration enforcement agenda.",
    "link": "https://www.foxnews.com/media/mamdani-declares-hes-ready-any-consequence-standing-against-trumps-federal-immigration-enforcement",
    "timestamp": "2025-12-11T00:00:52Z"
  },
  {
    "title": "U.S. Captures Oil Tanker Off Venezuela Coast",
    "description": "\"For multiple years, the oil tanker has been sanctioned by the United States due to its involvement in an illicit oil shipping network supporting foreign terrorist organizations.\"\nThe post U.S. Captures Oil Tanker Off Venezuela Coast first appeared on Le·gal …",
    "link": "https://legalinsurrection.com/2025/12/u-s-captures-oil-tanker-off-venezuela-coast/",
    "timestamp": "2025-12-11T00:00:41Z"
  },
  {
    "title": "Mike Johnson Finally Reveals GOP’s Health Care Plan—and It’s Rough - NewsBreak",
    "description": "House Speaker Mike Johnson just unveiled Republicans’ plan to address spiking health care costs—and it’s a disaster. As Affordable Care Act tax credits are",
    "link": "https://www.newsbreak.com/share/4390553468696-mike-johnson-finally-reveals-gop-s-health-care-plan-and-it-s-rough?_f=app_share&amp;pd=03zDexdI&amp;lang=en_US&amp;send_time=1765411186&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.40.2.14%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-11T00:00:20Z"
  },
  {
    "title": "‘Kill Them All’",
    "description": "“Does anyone know where the love of God goes When the waves turn the minutes to hours?” — Gordon Lightfoot (1938-2023) “The Wreck of the Edmund Fitzgerald” As we learn more about the events on Sept. 2, 2025, in international waters 1,500 miles from the United…",
    "link": "https://original.antiwar.com/andrew-p-napolitano/2025/12/10/kill-them-all/",
    "timestamp": "2025-12-11T00:00:03Z"
  },
  {
    "title": "David Zaslav’s Next Act Looks Murky As Netflix & Paramount Face Off Over Warner Bros Acquisition",
    "description": "Just a few weeks ago, David Zaslav was offered a co-CEO gig by David Ellison in a Paramount-owned Warner Bros Discovery. Then Netflix swooped in and sealed a $83B deal for WB’ streaming and studio holdings before Ellison came roaring back with a $108 billion …",
    "link": "http://deadline.com/2025/12/david-zaslav-future-warner-bros-merger-1236644719/",
    "timestamp": "2025-12-10T23:59:12Z"
  },
  {
    "title": "Kyle Rittenhouse, 22, Announces He’s Found a Gun-Toting Wife",
    "description": "MAGA influencer and gun rights activist Kyle Rittenhouse re-emerged from a self-imposed social media exile to announce his marriage to his gun-toting bride. ...",
    "link": "https://www.thedailybeast.com/kyle-rittenhouse-returns-to-social-media-with-gun-toting-new-wife/",
    "timestamp": "2025-12-10T23:58:43Z"
  },
  {
    "title": "Trump’s prescription for America’s affordability ills: Just think positive | CNN Business",
    "description": "President Donald Trump has a few tried-and-true rhetorical strategies. He invokes what “many people are saying” when he needs to make an unsubstantiated claim. He riffs on nicknames for his political enemies. And he repeats a talking point relentlessly, hopin…",
    "link": "https://www.cnn.com/2025/12/10/business/trump-affordability-quits-rate-nightcap",
    "timestamp": "2025-12-10T23:58:35Z"
  },
  {
    "title": "US drops bid to preserve FIFA bribery convictions",
    "description": "The US government has moved to drop its case against a former Fox broadcasting executive involved in the FIFA corruption scandal that plunged the world’s footballing body into crisis. Prosecutors told the Supreme Court on Tuesday they wanted to end their figh…",
    "link": "https://www.digitaljournal.com/world/us-drops-bid-to-preserve-fifa-bribery-convictions/article",
    "timestamp": "2025-12-10T23:57:20Z"
  },
  {
    "title": "House Passes Defense Bill To Raise Troop Pay And Overhaul Weapons Purchases",
    "description": "Tucked into the over-3,000-page bill are several measures that push back against the Department of Defense, including a demand for more information on boat strikes in the Caribbean.",
    "link": "https://www.huffpost.com/entry/us-congress-defense-bill_n_693a07cce4b0cfabad25a1d6",
    "timestamp": "2025-12-10T23:56:54Z"
  },
  {
    "title": "Trump says he wants a new owner for CNN as part of any sale of Warner Bros. Discovery:  ‘A very dishonest group of people’",
    "description": "Insiders say Trump’s comments come as Paramount Skydance’s owners, David Ellison and his father Larry, have been scrambling to do damage control with the White House over an explosive “60 Minutes” interview with Marjorie Taylor Greene.",
    "link": "https://nypost.com/2025/12/10/media/trump-says-he-wants-a-new-owner-for-cnn-as-part-of-any-sale-of-warner-bros-discovery/",
    "timestamp": "2025-12-10T23:56:02Z"
  },
  {
    "title": "New federal report shows tariffs are hurting every state that borders Canada",
    "description": "New federal report shows tariffs are hurting every state that borders Canadawmtw.com",
    "link": "https://www.wmtw.com/article/new-report-shows-tariffs-hurting-every-state-borders-canada/69690364",
    "timestamp": "2025-12-10T23:55:55Z"
  },
  {
    "title": "Trump's 'vocabulary has reduced dramatically' as his mind fades away: DC insider",
    "description": "President Donald Trump's cognitive decline was on full display this week, longtime Beltway reporter John Heilemann told MS NOW's Nicolle Wallace on \"Deadline: White House\" — and it's obvious when you compare his demeanor to a few years ago.\"You know, look, th…",
    "link": "https://www.rawstory.com/trump-decline-2674389017/",
    "timestamp": "2025-12-10T23:51:18Z"
  },
  {
    "title": "CNN Employees Fear 'Bloodbath' as Network's Future Hangs in the Balance: Report",
    "description": "As CNN employees look to the future with uncertainty amid dueling bids for its parent, President Donald Trump has one clear wish.",
    "link": "https://www.westernjournal.com/cnn-employees-fear-bloodbath-networks-future-hangs-balance-report/",
    "timestamp": "2025-12-10T23:49:00Z"
  },
  {
    "title": "Trump says US has seized an oil tanker off the coast of Venezuela, releases video of troops taking over",
    "description": "The oil tanker seizure was conducted under US law enforcement authority and the operation was led by US Coast Guard and supported by the Navy, a US official said.",
    "link": "https://indianexpress.com/article/world/trump-says-us-has-seized-oil-tanker-off-venezuela-coast-releases-video-10414069/",
    "timestamp": "2025-12-10T23:48:30Z"
  },
  {
    "title": "Gavin Newsom Warns 2028 Election May Be 'Rigged' — and Suggests Potential Candidates Trump Could Fiercely Support Are JD Vance, Marco Rubio and Son Barron",
    "description": "California Governor Gavin Newsom, who is contemplating a presidential run of his own, has warned that Donald Trump could try to 'rig' the next election.",
    "link": "https://radaronline.com/p/gavin-newsom-2028-election-rigged-trump-vance-rubio-barron/",
    "timestamp": "2025-12-10T23:45:00Z"
  },
  {
    "title": "The GOP's health care woes: From the Politics Desk",
    "description": "Republicans in Congress can't agree on a health care plan as Affordable Care Act subsidies are set to expire in 2026, ahead of the midterm elections.",
    "link": "https://www.nbcnews.com/politics/elections/gops-health-care-woes-politics-desk-rcna248488",
    "timestamp": "2025-12-10T23:44:42Z"
  },
  {
    "title": "Donald Trump reminds the entire world he has no idea what 6G means",
    "description": "When business leaders spout buzzwords like \"AI,\" \"8K\" and \"5G,\" sometimes in the same sentence, we often get a sneaking suspicion they don't know what they mean! With President Donald Trump, there's no need to wonder: he clearly has no idea. \"What does [6G] d…",
    "link": "https://www.theverge.com/policy/842087/trump-does-not-understand-6g-5g",
    "timestamp": "2025-12-10T23:41:14Z"
  },
  {
    "title": "Don't believe rumor Ireland denied Rosie O'Donnell's citizenship application",
    "description": "In December 2025, Ireland denied comedian Rosie O'Donnell's application for citizenship because her family is from Wales, not Ireland.",
    "link": "https://www.snopes.com//fact-check/rosie-odonnell-citizenship-ireland/",
    "timestamp": "2025-12-10T23:39:00Z"
  },
  {
    "title": "US Congress panels talk tough over Nigeria IDP crisis",
    "description": "US lawmakers visit Nigeria’s IDP camps, witnessing harrowing conditions firsthand. Learn about the US Congress’s calls for action on religious persecution.\n\nRead More: https://punchng.com/us-congress-panels-talk-tough-over-nigeria-idp-crisis/",
    "link": "https://punchng.com/us-congress-panels-talk-tough-over-nigeria-idp-crisis/",
    "timestamp": "2025-12-10T23:36:57Z"
  },
  {
    "title": "Congress Advances Historic Crackdown On American Cash Fueling China",
    "description": "A long-sought crackdown on American investment in Chinese technology is on the verge of becoming law after lawmakers successfully embedded it into the NDAA.",
    "link": "https://dailycaller.com/2025/12/10/congress-advances-historic-crackdown-on-american-cash-fueling-china/",
    "timestamp": "2025-12-10T23:36:45Z"
  },
  {
    "title": "Donald Trump Reacts to Federal Reserve Interest Rate Cuts - Newsweek",
    "description": "Donald Trump Reacts to Federal Reserve Interest Rate CutsNewsweek Trump says Fed could have 'at least doubled' latest interest rate cutcnbc.com Fed Again Cuts Interest Rates By 0.25%Forbes Trump administration live updates: Judge orders Epstein grand jury rec…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180358171",
    "timestamp": "2025-12-10T23:32:31Z"
  },
  {
    "title": "Trump’s Own Mortgages Match His Description of Mortgage Fraud, Records Reveal",
    "description": "This story wasoriginally publishedby ProPublica.Republished under aCC BY-NC-ND 3.0license. For months, the Trump administration has been accusing its political enemies of mortgage fraud for claiming more than one primary residence. President Donald Trumpbrand…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180358167",
    "timestamp": "2025-12-10T23:32:04Z"
  },
  {
    "title": "Trump Threatens to Increase Tariffs on Mexico Over Unpaid Water Debt",
    "description": "President Trump threatens a 5% tariff on Mexican imports unless Mexico releases water owed under a 1944 treaty.",
    "link": "https://www.shtfplan.com/headline-news/trump-threatens-to-increase-tariffs-on-mexico-over-unpaid-water-debt",
    "timestamp": "2025-12-10T23:30:04Z"
  },
  {
    "title": "The Year that Broke Federal Workers",
    "description": "From the daily newsletter: the neurologist was famous for linking healing with storytelling.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-year-that-broke-federal-workers",
    "timestamp": "2025-12-10T23:30:00Z"
  },
  {
    "title": "13 Republicans defy GOP leadership, vote with Dems to advance repeal of Trump order on federal unions",
    "description": "Thirteen House Republicans joined Democrats in a 222-200 vote to advance legislation reversing Trump's executive order restricting federal worker unions.",
    "link": "https://www.foxnews.com/politics/13-republicans-defy-gop-leadership-vote-dems-advance-repeal-trump-order-federal-unions",
    "timestamp": "2025-12-10T23:27:24Z"
  },
  {
    "title": "Trump Says The U.S. Has Seized An Oil Tanker Off The Coast Of Venezuela",
    "description": "President Donald Trump says the United States has seized an oil tanker off the coast of Venezuela as tensions mount with the government of President Nicolás Maduro.",
    "link": "https://www.huffpost.com/entry/us-united-states-venezuela-oil-tanker_n_693a006be4b0cfabad259454",
    "timestamp": "2025-12-10T23:26:30Z"
  },
  {
    "title": "The US is identified as part of the threat picture in Denmark",
    "description": "This is what the newspaper Berlingske writes the day before Denmark's military intelligence service releases its annual threat image report. According to Thomas Ahrenkiel, head of the intelligence service, smaller countries are now facing a world where there …",
    "link": "https://freerepublic.com/focus/f-news/4356836/posts",
    "timestamp": "2025-12-10T23:26:14Z"
  },
  {
    "title": "Mike Johnson Finally Reveals GOP’s Health Care Plan—and It’s Rough - NewsBreak",
    "description": "House Speaker Mike Johnson just unveiled Republicans’ plan to address spiking health care costs—and it’s a disaster. As Affordable Care Act tax credits are",
    "link": "https://www.newsbreak.com/share/4390553468696-mike-johnson-finally-reveals-gop-s-health-care-plan-and-it-s-rough?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NjU0MDkxMTU0OTA%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1765409115&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.49.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-10T23:26:09Z"
  },
  {
    "title": "Helicopter descent, soldiers on deck, and an ominous Trump comment: Everything we know about dramatic ship seizure",
    "description": "Troops dressed in camouflage storming across the deck, armed with large firearms - the Trump administration's dramatic seizure of an oil tanker marks the latest push to mount pressure on Venezuela's government.",
    "link": "https://news.sky.com/story/us-venezuela-crisis-everything-we-know-about-dramatic-ship-seizure-13481995",
    "timestamp": "2025-12-10T23:22:00Z"
  },
  {
    "title": "Hawley skewers his fellow Republicans for failing Trump",
    "description": "The News\nSen. Josh Hawley, R-Mo., delivered a withering critique of his own party on Wednesday, asserting that congressional Republicans are failing to help enact the agenda that President Donald Trump ran on.\n“Congress really has to act,” Hawley told Semafor…",
    "link": "https://biztoc.com/x/67a7254806b496d5",
    "timestamp": "2025-12-10T23:21:20Z"
  },
  {
    "title": "Trump could introduce ‘mandatory’ social media reviews for travelers",
    "description": "The Trump administration could soon require tourists from dozens of nations to hand over their social media handles before entering the country. Under a proposal from US Customs and Border Protection, the agency would make social media history from the past f…",
    "link": "https://www.theverge.com/news/842129/trump-admin-us-cbp-social-media-history-travelers",
    "timestamp": "2025-12-10T23:21:05Z"
  },
  {
    "title": "China encourages AI companies to buy domestic chips",
    "description": "China added homegrown AI chips to its government-approved list of suppliers, the latest move in Beijing’s quest to break reliance on American processors.\nThe list, which influences what the public sector buys, was reportedly circulated before US President Don…",
    "link": "https://biztoc.com/x/5bac363bb1339008",
    "timestamp": "2025-12-10T23:20:59Z"
  },
  {
    "title": "Trump Administration Adds Militarized Zone Along California's Southern Border",
    "description": "The Department of Interior on Wednesday said it would transfer jurisdiction along most of California's international border with Mexico to the Navy to reinforce “the historic role public lands have played in safeguarding national sovereignty.\"",
    "link": "https://www.huffpost.com/entry/trump-administration-adds-militarized-zone-along-california-border_n_6939fde2e4b053d6e8ece7c6",
    "timestamp": "2025-12-10T23:20:56Z"
  },
  {
    "title": "Google stands to make $111 billion if SpaceX goes public at a $1.5 trillion valuation",
    "description": "WASHINGTON, DC - JANUARY 20: Google CEO Sundar Pichai (L) talks with Tesla and SpaceX CEO Elon Musk at the inauguration of President Donald Trump at the U.S. Capitol Rotunda on January 20, 2025 in Washington, DC. Donald Trump takes office for his second term …",
    "link": "https://biztoc.com/x/913f84e9fc4045ca",
    "timestamp": "2025-12-10T23:20:36Z"
  },
  {
    "title": "Henry Cuellar faces opposition as he seeks to regain powerful spending post",
    "description": "Some Democrats are uneasy about a push to restore Rep. Henry Cuellar to a powerful committee role following a pardon from President Donald Trump, potentially complicating his bid to regain influence over federal spending. \nCuellar relinquished his post as the…",
    "link": "https://biztoc.com/x/bd943d64a3618cf0",
    "timestamp": "2025-12-10T23:20:34Z"
  },
  {
    "title": "Trump’s Own Mortgages Match His Description of Mortgage Fraud, Records Reveal",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. For months, the Trump administration has been accusing its political enemies of mortgage fraud for claiming more than one primary residence. President Donald Trump…",
    "link": "https://www.techdirt.com/2025/12/10/trumps-own-mortgages-match-his-description-of-mortgage-fraud-records-reveal/",
    "timestamp": "2025-12-10T23:20:14Z"
  },
  {
    "title": "Trump’s ‘gold card’ program goes live, offering US visas starting at $1 million per person",
    "description": "Individuals can pay $1 million, and corporations can pay $2 million per foreign-born employee.",
    "link": "https://www.denverpost.com/2025/12/10/trump-gold-card/",
    "timestamp": "2025-12-10T23:19:19Z"
  },
  {
    "title": "Trump’s ‘gold card’ program goes live, offering US visas starting at $1 million per person",
    "description": "Individuals can pay $1 million, and corporations can pay $2 million per foreign-born employee.",
    "link": "https://www.bostonherald.com/2025/12/10/trump-gold-card/",
    "timestamp": "2025-12-10T23:19:19Z"
  },
  {
    "title": "Democratic Congressman Hank Johnson Calls America ‘The Great Satan’ in Wild Rant",
    "description": "Rep. Hank Johnson (D-GA) took a page out of the authoritarian, theocratic Iranian regime’s playbook over the weekend, deeming the country he serves “The Great Satan” during a rant on The Dean Obeidallah Show. Johnson offered his evaluation of his country afte…",
    "link": "https://freerepublic.com/focus/f-bloggers/4356835/posts",
    "timestamp": "2025-12-10T23:19:03Z"
  }
]