[
  {
    "title": "Georgia Rep. Buddy Carter Calls for More ICE Operations in Atlanta",
    "description": "Rep. Buddy Carter (R-GA), who is running for a Georgia U.S. Senate seat this year, is calling for a greater Immigration and Customs Enforcement (ICE) presence in Atlanta, as the law enforcement agency continues its crackdown in Minneapolis amid massive unrest…",
    "link": "https://www.breitbart.com/pre-viral/2026/01/27/georgia-rep-buddy-carter-calls-for-more-ice-operations-in-atlanta/",
    "timestamp": "2026-01-27T21:46:18Z"
  },
  {
    "title": "King Charles 'Deeply Uncomfortable and Horrified' Over Prince Harry's Attacks on Trump Over NATO Remarks — 'This is Diplomacy, Not Podcast Politics'",
    "description": "King Charles has been put in an awkward position after his son, Prince Harry, attacked Donald Trump over comments regarding NATO troops.",
    "link": "https://radaronline.com/p/king-charles-uncomfortable-prince-harry-attack-on-trump-nato/",
    "timestamp": "2026-01-27T21:45:00Z"
  },
  {
    "title": "NY Times: Biden's Justice Department Began Investigation into Ilhan Omar's Reported $30 Million Net Worth",
    "description": "Former President Joe Biden's DOJ began an investigation into the finances of Rep. Ilham Omar (D-MN), the New York Times reported.\nThe post NY Times: Biden’s Justice Department Began Investigation into Ilhan Omar’s Reported $30 Million Net Worth appeared first…",
    "link": "https://www.breitbart.com/politics/2026/01/27/ny-times-bidens-justice-department-began-investigation-ilhan-omars-reported-30-million-net-worth/",
    "timestamp": "2026-01-27T21:44:31Z"
  },
  {
    "title": "TikTok Already Getting Shittier Under The Ownership Of Trump’s Billionaire Buddies",
    "description": "You might recall how Republicans (with help from Democrats) suffered a three year embolism over the national security, privacy, and propaganda problems inherent with TikTok — only to turn around and let Trump sell the platform to his technofascist billionaire…",
    "link": "https://www.techdirt.com/2026/01/27/tiktok-already-getting-shittier-under-the-ownership-of-trumps-billionaire-buddies/",
    "timestamp": "2026-01-27T21:44:29Z"
  },
  {
    "title": "Texas Governor Announces H-1B Visa Freeze For State Schools",
    "description": "Republican Texas Gov. Greg Abbott directed state agencies and universities to immediately freeze all H-1B visa petitions in a letter to state agency heads on Tuesday. Abbott wrote that the Texas economy should “work for the benefit of Texas workers and Texas …",
    "link": "https://freerepublic.com/focus/f-bloggers/4364254/posts",
    "timestamp": "2026-01-27T21:44:02Z"
  },
  {
    "title": "TikTok faces app deletions, censorship claims and glitches in days after its ownership change",
    "description": "Censorship claims, technical problems and a report of a surge in app deletions are just some of the challenges TikTok is facing this week as it adjusts to a new ownership structure in the U.S. The company said this week it was experiencing a “major inf...",
    "link": "https://abcnews.go.com/Business/wireStory/tiktok-faces-app-deletions-censorship-claims-glitches-days-129612615",
    "timestamp": "2026-01-27T21:42:33Z"
  },
  {
    "title": "Trump: Noem Not Stepping Down",
    "description": "President Donald Trump said Tuesday he continues to have confidence in Department of Homeland Security Secretary Kristi Noem and does not plan to ask her to step down despite mounting scrutiny following a fatal shooting by federal agents in Minneapolis and a …",
    "link": "https://freerepublic.com/focus/f-bloggers/4364253/posts",
    "timestamp": "2026-01-27T21:42:18Z"
  },
  {
    "title": "Democrat AG Candidate Announces Plan To Execute Trump",
    "description": "Democratic candidate for Ohio attorney general Elliot Forham announced his plan to execute President Donald Trump in a video posted to X on Tuesday.",
    "link": "https://dailycaller.com/2026/01/27/elliot-forhan-democrat-ohio-execute-trump/",
    "timestamp": "2026-01-27T21:40:44Z"
  },
  {
    "title": "Good Morning",
    "description": "Today’s AJ highlights a culture war that has moved from rhetoric to the physical infrastructure of our institutions, where national monuments are being scrubbed of history and the raw materials of knowledge are being shredded for data. The epicenter is Washin…",
    "link": "https://www.artsjournal.com/2026/01/good-morning-75.html",
    "timestamp": "2026-01-27T21:40:27Z"
  },
  {
    "title": "Minnesota Somali Activists Hiring ICE Tracker To Manage ‘Mosque Networks,’ ‘Prevent’ Arrests",
    "description": "A Minnesota-based nonprofit focused on aiding Somalis and other East Africans is hiring someone to follow immigration agents and prevent them from making arrests. The Awood Center, named after the Somali word for “power,” released a job posting on Facebook Ja…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364252/posts",
    "timestamp": "2026-01-27T21:39:08Z"
  },
  {
    "title": "Raskin Says Nationwide General Strike May Be Needed to Stop Trump",
    "description": "“I think the people of Minnesota have shown us…the direction we may need to go,” the Maryland Democrat said.",
    "link": "https://truthout.org/articles/raskin-says-nationwide-general-strike-may-be-needed-to-stop-trump/",
    "timestamp": "2026-01-27T21:38:58Z"
  },
  {
    "title": "Agitators swarm Tim Walz's office in Minnesota Capitol to demand immigration justice",
    "description": "Screaming agitators packed the Minnesota Capitol demanding justice amid federal immigration enforcement tensions. Demonstrators chanted outside Gov. Tim Walz's office.",
    "link": "https://www.foxnews.com/politics/agitators-swarm-tim-walzs-office-minnesota-capitol-demand-immigration-justice",
    "timestamp": "2026-01-27T21:38:52Z"
  },
  {
    "title": "Trump says U.S. won't help Iraq if it picks Maliki as prime minister",
    "description": "U.S. President Donald Trump on Tuesday warned Iraq against picking Nouri al-Maliki as its ‌prime minister, saying the United States would no longer help the Middle Eastern country. &quot;I'm hearing that the Great Country of Iraq might make a ⁠very bad choice…",
    "link": "https://japantoday.com/category/world/trump-says-us-won%27t-help-iraq-if-it-picks-maliki-as-prime-minister",
    "timestamp": "2026-01-27T21:38:21Z"
  },
  {
    "title": "Democrats Escalate Impeachment Push Against Kristi Noem",
    "description": "Top House Democrats said if Noem doesn't go, they'll start building the case for her eventual impeachment, though they'd need Republican support.",
    "link": "https://www.huffpost.com/entry/kristi-noem-impeachment-minnesota_n_697923a4e4b0baacbfb7616e",
    "timestamp": "2026-01-27T21:38:15Z"
  },
  {
    "title": "‘I Shake Up Teams!’ Trump Explains Why He Benched Greg Bovino for Tom Homan",
    "description": "President Donald Trump cavalierly dismissed a question about him switching the officials who are leading his crackdown on illegal immigration in Minnesota\nThe post ‘I Shake Up Teams!’ Trump Explains Why He Benched Greg Bovino for Tom Homan first appeared on M…",
    "link": "https://www.mediaite.com/politics/i-shake-up-teams-trump-explains-why-he-benched-greg-bovino-for-tom-homan/",
    "timestamp": "2026-01-27T21:38:14Z"
  },
  {
    "title": "Ex-FIFA president Sepp Blatter joins those calling for boycott of World Cup in U.S.",
    "description": "Former FIFA president Sepp Blatter is backing a proposed fan boycott of World Cup matches in the United States because of the conduct of President Trump and his administration at home and abroad.",
    "link": "https://www.npr.org/2026/01/27/g-s1-107571/fifa-sepp-blatter-boycott-world-cup",
    "timestamp": "2026-01-27T21:38:13Z"
  },
  {
    "title": "Israel plans large camp for Palestinians in southern Gaza, retired general says",
    "description": "Israel has cleared land in southern Gaza for the construction of a camp for Palestinians potentially equipped with surveillance and facial recognition technology at its entrance, a retired Israeli general who advises the military said on Tuesday. Retired rese…",
    "link": "https://japantoday.com/category/world/israel-plans-large-camp-for-palestinians-in-southern-gaza-retired-general-says",
    "timestamp": "2026-01-27T21:38:05Z"
  },
  {
    "title": "Atomic scientists set 'Doomsday Clock' closer to midnight than ever",
    "description": "Atomic scientists set their &quot;Doomsday Clock&quot; on Tuesday closer than ever to midnight, citing aggressive behavior by nuclear powers Russia, China and the United States, fraying nuclear arms control, conflicts in Ukraine and the Middle East and AI wor…",
    "link": "https://japantoday.com/category/world/atomic-scientists-set-%27doomsday-clock%27-closer-to-midnight-than-ever3",
    "timestamp": "2026-01-27T21:37:58Z"
  },
  {
    "title": "Carney refutes Bessent's comments and says he meant what he said at Davos",
    "description": "Canadian Prime Minister Mark Carney said Tuesday he told U.S. President Donald Trump that he meant what he said in his speech at Davos, and told him Canada plans to diversify away from the United States with a dozen new trade deals. Carney rolled his eyes and…",
    "link": "https://japantoday.com/category/world/carney-rolls-his-eyes-at-us-treasury-secretary-telling-trump-he-meant-what-he-said-at-davos",
    "timestamp": "2026-01-27T21:37:42Z"
  },
  {
    "title": "Trump shakes up Minneapolis immigration operation as White House seeks damage control",
    "description": "Donald Trump's border czar, Tom Homan, was set to take over the president's sweeping immigration operation in Minneapolis on Tuesday, as the White House tries to tamp down national outrage over the second fatal shooting of a U.S. citizen this month by federal…",
    "link": "https://japantoday.com/category/world/trump-shakes-up-minneapolis-immigration-operation-as-white-house-seeks-damage-control1",
    "timestamp": "2026-01-27T21:37:00Z"
  },
  {
    "title": "TikTok Raises U.S. Censorship Fears After Messages About Jeffrey Epstein Are Blocked",
    "description": "After Trump-connected investors took a controlling stake in the U.S. version of the app, users have claimed that it's suppressing political topics",
    "link": "https://www.rollingstone.com/culture/culture-news/tiktok-jeffrey-epstein-censorship-ice-1235505040/",
    "timestamp": "2026-01-27T21:36:12Z"
  },
  {
    "title": "TikTok Raises U.S. Censorship Fears After Messages About Jeffrey Epstein Are Blocked",
    "description": "After Trump-connected investors took a controlling stake in the U.S. version of the app, users have claimed that it's suppressing political topics",
    "link": "http://www.rollingstone.com/culture/culture-news/tiktok-jeffrey-epstein-censorship-ice-1235505040/",
    "timestamp": "2026-01-27T21:36:12Z"
  },
  {
    "title": "Trump Orders Federal Takeover of LA Wildfire Rebuilding Efforts",
    "description": "President Donald Trump signed an executive order that allows the federal government to preempt state and local regulations in the recovery efforts of last year’s Los Angeles wildfires, blaming the destruction and its slow rebuilding on California’s authoritie…",
    "link": "https://www.insurancejournal.com/news/west/2026/01/27/855890.htm",
    "timestamp": "2026-01-27T21:35:02Z"
  },
  {
    "title": "Republican Rep. Backs Leniency For Some Illegal Immigrants",
    "description": "Republican Rep. Mike Lawler is breaking from the Trump administration on its deportation push, calling for leniency for some illegal immigrants in an essay for... Read More\nThe post Republican Rep. Backs Leniency For Some Illegal Immigrants appeared first on …",
    "link": "https://www.dailysignal.com/2026/01/27/republican-rep-backs-leniency-for-some-illegal-immigrants/",
    "timestamp": "2026-01-27T21:35:00Z"
  },
  {
    "title": "TikTok faces slew of censorship claims and glitches days after ownership change",
    "description": "Censorship claims, technical problems and a report of a surge in app deletions are just some of the challenges TikTok is facing this week as it adjusts to a new ownership structure in the U.S. The company said this week it was experiencing a “major infrastruc…",
    "link": "https://apnews.com/article/tiktok-uninstalls-newsom-censorship-f38b265405f734993728c790dcc83bcc",
    "timestamp": "2026-01-27T21:34:31Z"
  },
  {
    "title": "What is gold price next milestone and will it really hit $6,000 by year end? Gold's spectacular rise, bank forecasts explained. Here's what should investors do now",
    "description": "What is gold price next milestone and will it really hit $6,000 by year end? Gold crossed $5,000 per ounce as investors reacted to policy risks, rate expectations, and global uncertainty. Banks now project higher targets as demand remains strong across market…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-gold-price-next-milestone-and-will-it-really-hit-6000-by-year-end-golds-spectacular-rise-bank-forecasts-explained-heres-what-should-investors-do-now/articleshow/127653795.cms",
    "timestamp": "2026-01-27T21:33:44Z"
  },
  {
    "title": "Philip Glass cancels Kennedy Center symphony premiere in protest of Trump’s leadership",
    "description": "Glass, who turns 89 on Saturday, was a Kennedy Center honoree in 2018.",
    "link": "https://www.bostonherald.com/2026/01/27/philip-glass-kennedy-center/",
    "timestamp": "2026-01-27T21:32:55Z"
  },
  {
    "title": "Making the Melania Movie Sounds Like a Nightmare",
    "description": "Making the Melania Trump movie sounds Like a nightmare. Crew members say they did not love the ‘propaganda element,’ but the ‘worst part’ of creating the film was director Brett Ratner’s gross behavior.",
    "link": "http://nymag.com/intelligencer/article/making-the-melania-movie-sounds-like-a-nightmare.html",
    "timestamp": "2026-01-27T21:32:35Z"
  },
  {
    "title": "Popular CBS TV Show Sets End Date After 11 Seasons",
    "description": "One of CBS’ most popular TV shows is officially coming to an end, with an end date set now confirmed for a fan-favorite show. When CBS show is set to end after 11 seasons? Stephen Colbert’s The Late Show with Stephen Colbert is set to come to an end after 11 …",
    "link": "https://www.comingsoon.net/tv/news/2088617-popular-cbs-tv-show-sets-end-date-after-11-seasons",
    "timestamp": "2026-01-27T21:30:22Z"
  },
  {
    "title": "As Trump’s ‘Board of Peace’ presses forward, Palestinians in Gaza fear what lies ahead",
    "description": "Mondoweiss spoke with Gazans after the announcement of the Palestinian technocratic committee that will oversee Gaza under Trump’s ‘Board of Peace’. While some hope for change, many fear the committee will ultimately serve U.S. and Israeli interests.",
    "link": "https://mondoweiss.net/2026/01/as-trumps-board-of-peace-presses-forward-palestinians-in-gaza-fear-what-lies-ahead/",
    "timestamp": "2026-01-27T21:30:00Z"
  },
  {
    "title": "‘Melania’ Doc Marks Brett Ratner's Big Return After He Was Canceled During Me Too",
    "description": "Ratner was once a powerful filmmaker who directed major box office hits, but he hasn’t worked in nearly a decade after sexual assault allegations derailed his career—until he was tapped to direct the “Melania” documentary.",
    "link": "https://www.forbes.com/sites/conormurray/2026/01/27/melania-doc-marks-brett-ratners-big-return-after-he-was-canceled-during-me-too/",
    "timestamp": "2026-01-27T21:26:56Z"
  },
  {
    "title": "Donald Trump Is Unworried about the Dollar’s Value",
    "description": "According to Bloomerg. No doubt the USD is losing in value in nominal terms against a basket of currencies as well gold, since the weekend. Source: TradingEconomics.com, accessed 1/27/2026.   This correlation suggests a diminished confidence in the value of U…",
    "link": "https://econbrowser.com/archives/2026/01/where-are-all-the-folks-who-used-to-talk-about-dollar-debasement",
    "timestamp": "2026-01-27T21:24:39Z"
  },
  {
    "title": "Bitcoin climbs above $89,000 as U.S. dollar tumbles on President Trump's remarks",
    "description": "The president said he isn't concerned about the dollar's recent declines, sending the greenback plunging even lower.",
    "link": "https://www.coindesk.com/markets/2026/01/27/bitcoin-climbs-above-usd89-000-as-u-s-dollar-tumbles-on-president-trump-s-remarks",
    "timestamp": "2026-01-27T21:23:55Z"
  },
  {
    "title": "The US is facing a wrongful-death lawsuit after a lethal strike on a boat it says was smuggling drugs",
    "description": "Two Trinidadian nationals were said to be among six people killed by a US strike. The lawsuit characterized the strike as 'unlawful.'",
    "link": "https://www.businessinsider.com/lawsuit-boat-strike-campaign-two-men-families-unlawful-2026-1",
    "timestamp": "2026-01-27T21:23:19Z"
  },
  {
    "title": "How Is Donald Trump Ruining Every Sporting Event On Earth Today?",
    "description": "He can't go to the Super Bowl because it's too far for his old rotting bones. Meanwhile, there's finally a real conversation about boycotting the World Cup.",
    "link": "https://www.wonkette.com/p/how-is-donald-trump-ruining-every",
    "timestamp": "2026-01-27T21:20:46Z"
  },
  {
    "title": "While Conservatives Call on Congress to Hold The Line, Some Senate Republicans Are Questioning ICE Tactics",
    "description": "Following the ICE-involved fatal shooting of Alex Pretti in Minneapolis on Saturday, some Republicans are questioning the Trump administration’s methods to follow through on President Donald... Read More\nThe post While Conservatives Call on Congress to Hold T…",
    "link": "https://www.dailysignal.com/2026/01/27/republicans-break-ranks-stand-against-ice/",
    "timestamp": "2026-01-27T21:20:00Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "Storm Chandra wreaks havoc, but question marks remain over a lack of warning for Dublin.",
    "link": "https://www.thejournal.ie/the-journal-news-roundup-6940167-Jan2026/",
    "timestamp": "2026-01-27T21:19:15Z"
  },
  {
    "title": "Crypto giant Tether pushes into the U.S. with USAT stablecoin to challenge Circle",
    "description": "The world’s biggest stablecoin issuer now has a digital dollar compliant with U.S. regulation.",
    "link": "https://fortune.com/2026/01/27/crypto-giant-tether-pushes-into-the-u-s-with-usat-stablecoin-to-challenge-circle/",
    "timestamp": "2026-01-27T21:19:09Z"
  },
  {
    "title": "Pressure Works",
    "description": "Donald Trump must fire Kristi Noem immediately. Or Democrats will initiate impeachment proceedings against her in the House. We can do this the easy way or the hard way. [image or embed] — Hakeem Jeffries (@hakeem-jeffries.bsky.social) January 27, 2026 at 11:…",
    "link": "https://balloon-juice.com/2026/01/27/pressure-works/",
    "timestamp": "2026-01-27T21:19:07Z"
  },
  {
    "title": "Who is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?",
    "description": "The US border tsar has long been a ferocious defender of Donald Trump's immigration policies.",
    "link": "https://www.bbc.com/news/articles/cjw1pn4lwjqo",
    "timestamp": "2026-01-27T21:17:35Z"
  },
  {
    "title": "Fyodor Lukyanov: Here’s what’s behind the US shift on EU allies",
    "description": "The age of institutions is ending, the age of force is back Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631621-fyodor-lukyanov-us-shift-eu-allies/",
    "timestamp": "2026-01-27T21:17:21Z"
  },
  {
    "title": "‘As Bad as They Get!’ Trump Unleashes on ABC Reporter for Roaring Crowd",
    "description": "President Donald Trump dismissed a question from a reporter about federal agents shooting and killing a citizen in Minneapolis, instead roasting the reporter.\nThe post ‘As Bad as They Get!’ Trump Unleashes on ABC Reporter for Roaring Crowd first appeared on M…",
    "link": "https://www.mediaite.com/politics/trump/as-bad-as-they-get-trump-unleashes-on-abc-reporter-for-roaring-crowd/",
    "timestamp": "2026-01-27T21:16:04Z"
  },
  {
    "title": "Democrats demand Kristi Noem be fired or warn impeachment will follow",
    "description": "House Democrats threaten impeachment proceedings against DHS Secretary Kristi Noem, demanding her firing over deadly federal agent actions in Minnesota.",
    "link": "https://www.foxnews.com/politics/democrats-demand-kristi-noem-fired-warn-impeachment-follow",
    "timestamp": "2026-01-27T21:15:39Z"
  },
  {
    "title": "‘Ground is clearly shifting’ against Trump as Americans rise up in Minneapolis, Pete Buttigieg says",
    "description": "Former Transportation Secretary Pete Buttigieg on Monday said public pressure is beginning to force accountability inside the Trump administration after the Border Patrol chief overseeing Minnesota immigration operations was pushed out following the killing o…",
    "link": "https://www.advocate.com/politics/pete-buttigieg-resistance-is-working",
    "timestamp": "2026-01-27T21:15:08Z"
  },
  {
    "title": "Censorship claims, investigations, and alternate apps: The U.S. TikTok app is off to a rough start",
    "description": "If you thought all of the U.S. TikTok drama would subside once the federal government officially launched its version of the social video app, you are sorely mistaken. Amid a chaotic political moment in America, some TikTok users have claimed that posts touch…",
    "link": "https://www.tubefilter.com/2026/01/27/us-tiktok-launch-censorship-claims-government-investigation/",
    "timestamp": "2026-01-27T21:13:57Z"
  },
  {
    "title": "Families of 2 Trinidadian nationals killed in strikes sue Trump administration",
    "description": "Families of 2 Trinidadian nationals killed in strikes sue Trump administrationgo.com",
    "link": "https://abcnews.go.com/US/families-2-trinidadian-nationals-killed-strikes-sue-trump/story?id=129608509",
    "timestamp": "2026-01-27T21:12:45Z"
  },
  {
    "title": "Carney working on trip to India and possible trade deal",
    "description": "Canada and India first launched talks on a comprehensive deal in 2010 that would have opened markets by reducing barriers on goods, services and investment",
    "link": "https://nationalpost.com/news/canada/carney-working-on-trip-to-india-and-possible-trade-deal",
    "timestamp": "2026-01-27T21:12:31Z"
  },
  {
    "title": "Trump, Noted 2nd Amendment Champion: ‘You Can’t Have Guns’",
    "description": "Donald Trump appeared to dismiss the Second Amendment in response to ICE killing Alex Pretti, who had been legally carrying a gun, in Minneapolis.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-cant-have-guns-alex-pretti-killing-1235505737/",
    "timestamp": "2026-01-27T21:11:16Z"
  },
  {
    "title": "Trump Urges Americans to Embrace a Suicidal Penguin as ‘Doomsday Clock’ Hits 85 Seconds to Midnight",
    "description": "There aren't any penguins in Greenland.",
    "link": "https://gizmodo.com/trump-urges-americans-to-embrace-a-suicidal-penguin-as-doomsday-clock-hits-85-seconds-to-midnight-2000714599",
    "timestamp": "2026-01-27T21:10:29Z"
  },
  {
    "title": "Carney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos",
    "description": "Canadian Prime Minister Mark Carney said Tuesday he told U.S. President Donald Trump that he meant what he said in his speech at Davos, and told him Canada plans to diversify away from the United States with a dozen new trade deals. Carney rolled his eyes and…",
    "link": "https://freerepublic.com/focus/f-news/4364247/posts",
    "timestamp": "2026-01-27T21:07:30Z"
  },
  {
    "title": "How a Violent, Warrantless ICE Raid Devastated a Memphis Family",
    "description": "A few weeks before Christmas, six siblings huddled around a phone in their mom’s bedroom to talk with their dad and grandpa, who’d just been detained by Immigration and Customs Enforcement in Memphis. Camila, 16, the oldest girl, seemed tense as she sat next …",
    "link": "https://www.motherjones.com/politics/2026/01/warrantless-ice-raid-memo-video-memphis-occupation-home-invasion/",
    "timestamp": "2026-01-27T21:05:24Z"
  },
  {
    "title": "Watchdog Alleges Netflix Coordinated With FBI to Promote Leftwing Narratives",
    "description": "A new report alleges that the streaming giant Netflix has worked closely with federal law enforcement and intelligence agencies in ways that amount to government-assisted... Read More\nThe post Watchdog Alleges Netflix Coordinated With FBI to Promote Leftwing …",
    "link": "https://www.dailysignal.com/2026/01/27/watchdog-alleges-netflix-coordinated-with-fbi-to-promote-leftwing-narratives/",
    "timestamp": "2026-01-27T21:05:00Z"
  },
  {
    "title": "Pritzker Claims Country Under Trump Worse Than COVID Pandemic Where People Died 'in Droves'",
    "description": "Illinois governor doubles down on comparing current moment to Nazi Germany rise during podcast appearanceGov. JB Pritzker, D-Ill., said during a podcast on Tuesday that the current political \"moment\" was \"slightly worse\" than the COVID pandemic, despite the m…",
    "link": "https://freerepublic.com/focus/f-news/4364244/posts",
    "timestamp": "2026-01-27T21:04:48Z"
  },
  {
    "title": "Ecuador Raises Tariffs on Colombian Crude Oil by 900 Percent",
    "description": "The administration of Ecuadorian President Daniel Noboa on Monday announced a 900 percent increase in tariffs on Colombian oil transiting through its pipeline system, the latest move in an escalating trade dispute.\nThe post Ecuador Raises Tariffs on Colombian…",
    "link": "https://www.breitbart.com/latin-america/2026/01/27/ecuador-raises-tariffs-on-colombian-crude-oil-by-900-percent/",
    "timestamp": "2026-01-27T21:04:27Z"
  },
  {
    "title": "Composer Philip Glass withdraws 'Lincoln' symphony from the Kennedy Center",
    "description": "WASHINGTON — Composer Philip Glass announced Tuesday that he is withdrawing his symphony from the Kennedy Center, pointing to the arts center's values and leadership. \"After thoughtful consideration, I have decided to withdraw my Symphony No. 15 'Lincoln' fro…",
    "link": "https://freerepublic.com/focus/f-backroom/4364243/posts",
    "timestamp": "2026-01-27T21:02:53Z"
  },
  {
    "title": "IEEPA Tariffs Update",
    "description": "Two weeks ago, I wrote “It’s Tariff Week! *.” The asterisk added the word “Hopefully…” “This is likely the week the Supreme Court issues a ruling on the IEEPA tariffs in place since April 2025.” I wrote, getting it totally wrong. It turned out to be (mostly) …",
    "link": "https://ritholtz.com/2026/01/ieepa-tariffs-update/",
    "timestamp": "2026-01-27T21:00:56Z"
  },
  {
    "title": "'Patience is at an end': Minnesota judge orders ICE head to face court",
    "description": "A Minnesota judge takes the extraordinary step of ordering the acting director of Immigration and Customs Enforcement (ICE) to appear in person and explain why his agency keeps ignoring court orders.",
    "link": "https://www.abc.net.au/news/2026-01-28/minnesota-judge-orders-ice-head-to-face-court/106276814",
    "timestamp": "2026-01-27T21:00:44Z"
  },
  {
    "title": "Report: DOJ Withdraws Request for Don Lemon Arrest Warrant Over Church Raid",
    "description": "Last week, a federal magistrate judge refused to sign off on the arrest warrants for Lemon and four people.\nThe post Report: DOJ Withdraws Request for Don Lemon Arrest Warrant Over Church Raid first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/report-doj-withdraws-request-for-don-lemon-arrest-warrant-over-church-raid/",
    "timestamp": "2026-01-27T21:00:38Z"
  },
  {
    "title": "Israel seeking major military pact with US – FT",
    "description": "Israel is seeking a major military pact with the US, with talks expected in the coming weeks, a senior official has told FT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631613-israel-us-arms-supplies/",
    "timestamp": "2026-01-27T21:00:30Z"
  },
  {
    "title": "‘Doomsday clock’ moved closer to midnight",
    "description": "An arms race between major powers is pushing humanity towards catastrophe, scientists behind the “doomsday clock” have warned Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631619-doomsday-clock-closer-midnight/",
    "timestamp": "2026-01-27T21:00:30Z"
  },
  {
    "title": "Sanctions Squeeze Iran’s Oil Revenues Despite Higher Output",
    "description": "Iran’s oil industry has been under sanctions since Donald Trump’s first term. Since then, Iran has seen its pool of buyers shrink to leave only China—but China has been a big enough buyer to not only keep Iran’s oil industry afloat, but help it grow, at least…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Sanctions-Squeeze-Irans-Oil-Revenues-Despite-Higher-Output.html",
    "timestamp": "2026-01-27T21:00:00Z"
  },
  {
    "title": "Michael J. Fox and Harrison Ford on Shrinking, Parkinson’s, and Donald Trump",
    "description": "Following his first TV role in five years, Fox hopes to meet with Robert F. Kennedy Jr. about funding research for the incurable brain disease. But as he exclusively tells VF, the current administration “seems that they’re involved in other things that have l…",
    "link": "https://www.vanityfair.com/hollywood/story/harrison-ford-michael-j-fox-shrinking-parkinsons-interview",
    "timestamp": "2026-01-27T21:00:00Z"
  },
  {
    "title": "Bill Maher Warns Democrats They Need to Demand Celebrities ‘Shut the F**k Up’ if They’re Going to Win Elections",
    "description": "Bill Maher warned Democrats that they need to order liberal celebrities \"shut the f**k up\" if they have any hope of winning future elections.\nThe post Bill Maher Warns Democrats They Need to Demand Celebrities ‘Shut the F**k Up’ if They’re Going to Win Electi…",
    "link": "https://www.mediaite.com/media/entertainment/bill-maher-warns-democrats-they-need-to-demand-celebrities-shut-the-fk-up-if-theyre-going-to-win-elections/",
    "timestamp": "2026-01-27T20:58:24Z"
  },
  {
    "title": "Robert F. Kennedy Jr. announces U.S. departure from the World Health Organisation and calls it ‘independence’ - NewsBreak",
    "description": "On Jan. 23, 2026, U.S. Health and Human Services Secretary Robert F. Kennedy Jr. posted a video on X announcing that the U.S. had formally completed its wi",
    "link": "https://www.newsbreak.com/share/4461476588262-robert-f-kennedy-jr-announces-u-s-departure-from-the-world-health-organisation-and-calls-it-independence?_f=app_share&amp;pd=0MZRvt7r&amp;lang=en_US&amp;send_time=1769547439&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.1.11%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-27T20:58:21Z"
  },
  {
    "title": "Rachel Maddow Highlights GOP Backlash To Fatal ICE Raids: 'This Is Called Political Change'",
    "description": "The MS NOW host on Monday ran down an extensive list of Republicans who previously supported the administration's efforts.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-gop-backlash-ice_n_6978e09fe4b00c50e9f4e01e",
    "timestamp": "2026-01-27T20:57:23Z"
  },
  {
    "title": "12 Signposts That Indicate That A Monumental Economic Meltdown Is Now Upon Us",
    "description": "We live at a time when the pace of change is so rapid that it can be overwhelming at times.  More change occurs in a single month than happened during most entire years when I was growing up.  When I pull up the news each day, there is always a fresh serving …",
    "link": "http://theeconomiccollapseblog.com/12-signposts-that-indicate-that-a-monumental-economic-meltdown-is-now-upon-us/",
    "timestamp": "2026-01-27T20:57:14Z"
  },
  {
    "title": "After Alex Pretti's Death, the Administration Signals a Shift on Immigration Enforcement",
    "description": "Wider reform is needed in the way the government enforces its laws.",
    "link": "https://reason.com/2026/01/28/after-alex-prettis-death-the-administration-signals-a-shift-on-immigration-enforcement/",
    "timestamp": "2026-01-27T20:57:13Z"
  },
  {
    "title": "Neil Young gifts Greenland free access to music catalogue",
    "description": "Neil Young announced Tuesday on his blog that he is providing free access to his entire music catalogue to residents of Denmark's semiautonomous territory, whose futures have lately become a point of tension between the U.S. and NATO.",
    "link": "https://www.cbc.ca/news/entertainment/neil-young-catalogue-greenland-9.7063641",
    "timestamp": "2026-01-27T20:56:53Z"
  },
  {
    "title": "Minnesota Somali Activists Hiring ICE Tracker To Manage ‘Mosque Networks,’ ‘Prevent’ Arrests",
    "description": "A Minnesota-based nonprofit focused on aiding Somalis and other East Africans wants to hire someone to follow ICE for the \"protection\" of migrants.",
    "link": "https://dailycaller.com/2026/01/27/minnesota-somali-activists-ice-tracker-mosque-networks-prevent-arrests-rapid-response/",
    "timestamp": "2026-01-27T20:55:44Z"
  },
  {
    "title": "Melania Trump’s Lavish $40 Million Documentary Is Already Drawing Side Eye",
    "description": "Amazon reportedly spent $40 million on \"Melania: Twenty Days to History\" and another $35 million to promote it, raising eyebrows before reviews even arrive.",
    "link": "https://www.huffpost.com/entry/melania-trump-documentary-speculation_n_6978f160e4b051911224d57f",
    "timestamp": "2026-01-27T20:52:31Z"
  },
  {
    "title": "Arizona ICE shooting today under investigation after Border Patrol incident leaves one person in critical condition",
    "description": "Arizona ICE shooting today: A critical shooting involving US Border Patrol in southern Arizona has left an unidentified individual fighting for their life. The incident occurred Tuesday morning near Arivaca Road, prompting an emergency response and a joint in…",
    "link": "https://economictimes.indiatimes.com/news/international/us/arizona-ice-shooting-today-under-investigation-after-border-patrol-incident-leaves-one-person-in-critical-condition/articleshow/127653104.cms",
    "timestamp": "2026-01-27T20:52:01Z"
  },
  {
    "title": "Arizona shooting under investigation after Border Patrol incident leaves one person in critical condition",
    "description": "Arizona shooting: A critical shooting involving US Border Patrol in southern Arizona has left an unidentified individual fighting for their life. The incident occurred Tuesday morning near Arivaca Road, prompting an emergency response and a joint investigatio…",
    "link": "https://economictimes.indiatimes.com/news/international/us/arizona-shooting-under-investigation-after-border-patrol-incident-leaves-one-person-in-critical-condition/articleshow/127653104.cms",
    "timestamp": "2026-01-27T20:52:01Z"
  },
  {
    "title": "Peace in Minneapolis Won’t Come From Stoking the Fire",
    "description": "Minneapolis chaos followed leaders’ inaction on a costly fraud probe, with anti-ICE rhetoric fueling tensions that spiraled into violence, National Guard deployment, and lost lives. To think that everything leading up to this started with indifference over tr…",
    "link": "https://freerepublic.com/focus/f-chat/4364242/posts",
    "timestamp": "2026-01-27T20:47:20Z"
  },
  {
    "title": "ICE on US streets challenges American norms, founding values",
    "description": "The Trump administration has moved ICE's center of activity from the US border with Mexico to the heart of US cities. Federal agents' encounters with the public are challenging the foundational ideas of America.",
    "link": "https://www.dw.com/en/ice-on-us-streets-challenges-american-norms-founding-values/a-75679947",
    "timestamp": "2026-01-27T20:47:00Z"
  },
  {
    "title": "US Trade Spat With South Korea Driven by Tech Rules, Gridlock",
    "description": "The Trump administration is demanding that South Korea take concrete steps to implement its six-month-old trade deal with the US in order to prevent tariffs from rising to 25%, according to US officials.",
    "link": "https://financialpost.com/pmn/business-pmn/us-trade-spat-with-south-korea-driven-by-tech-rules-gridlock",
    "timestamp": "2026-01-27T20:46:55Z"
  },
  {
    "title": "Selective Justice Is Not Rule of Law",
    "description": "The Constitution is more than just parchment; it sets clear guidelines to limit the power of government so that citizens will be treated equally under... Read More\nThe post Selective Justice Is Not Rule of Law appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/27/selective-justice-is-not-rule-of-law/",
    "timestamp": "2026-01-27T20:45:00Z"
  },
  {
    "title": "Trump's own screenshots caught him breaking the law using auto-deleting app: watchdog",
    "description": "A watchdog group is raising concerns that President Donald Trump may have violated federal recordkeeping laws by using an auto-deleting message application to text world leaders.On Tuesday, the group American Oversight sent a letter to White House Counsel Dav…",
    "link": "https://www.rawstory.com/donald-trump-2675048298/",
    "timestamp": "2026-01-27T20:43:35Z"
  },
  {
    "title": "Weaponized Insiders Can Result In Big Consequences",
    "description": "The US Treasury Department recently announced that it is cancelling all of its contracts, reportedly valued at $21 million, with technology provider Booz Allen Hamilton (BAH) due to an insider incident that occurred between 2018 and 2020. The incident resulte…",
    "link": "https://www.forrester.com/blogs/weaponized-insiders-can-result-in-big-consequences/",
    "timestamp": "2026-01-27T20:42:33Z"
  },
  {
    "title": "Trump Jr.: Schweizer’s ‘Invisible Coup’ Exposes the ‘Foreign Infiltration’ Behind Minneapolis ‘Insurrection’",
    "description": "Tuesday on Donald Trump Jr’s podcast \"Triggered,\" Breitbart News senior contributor and author of The Invisible Coup: How American Elites and Foreign Powers Use Immigration as a Weapon Peter Schweizer discussed the current unrest in Minneapolis.\nThe post Trum…",
    "link": "https://www.breitbart.com/clips/2026/01/27/trump-jr-schweizers-invisible-coup-exposes-the-foreign-infiltration-behind-minneapolis-insurrection/",
    "timestamp": "2026-01-27T20:41:54Z"
  },
  {
    "title": "Those Brutal “Melania” Documentary Reviews Have Vanished from Letterboxd",
    "description": "Yesterday I published a story about what was quickly becoming a surprising site of capital R Resistance: the Letterboxd review page for the $75 million documentary film, Melania. Comments were profane, fun, silly, unprintable. I included some of my favorites.…",
    "link": "https://www.motherjones.com/politics/2026/01/melania-documentary-reviews-deleted-letterboxd/",
    "timestamp": "2026-01-27T20:41:14Z"
  },
  {
    "title": "Why Minneapolis has become such a flashpoint amid ICE deployments",
    "description": "The Trump administration has deployed federal troops to several U.S. cities in the past year — mostly Democrat-led, mostly under the guise of unsubstantiated claims that illegal immigrants are terrorizing those cities with crime. But Minneapolis has seen the …",
    "link": "https://www.cbc.ca/news/world/minnesota-minneapolis-ice-how-we-get-here-9.7062336",
    "timestamp": "2026-01-27T20:40:13Z"
  },
  {
    "title": "The Irish Times view on the EU/India trade deal: an important signal",
    "description": "Following on from Mercosur, it is a signal of “ business as usual” in the face of Trump’s threats",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/27/the-irish-times-view-on-the-euindia-trade-deal-an-important-signal/",
    "timestamp": "2026-01-27T20:37:00Z"
  },
  {
    "title": "Schweizer: Gates, Soros-Funded Groups Have Goal of ‘Transforming America’ Through Mass Migration",
    "description": "Tuesday on Donald Trump Jr’s podcast \"Triggered,\" Breitbart News senior contributor and author of The Invisible Coup: How American Elites and Foreign Powers Use Immigration as a Weapon Peter Schweizer talked about the ultimate goals of groups Bill Gates and G…",
    "link": "https://www.breitbart.com/clips/2026/01/27/schweizer-gates-soros-funded-groups-have-goal-of-transforming-america-through-mass-migration/",
    "timestamp": "2026-01-27T20:36:47Z"
  },
  {
    "title": "Crude Gains as Geopolitical Risks Grow",
    "description": "Crude prices rose as US military signals, refinery disruptions, and a weaker dollar supported commodities.",
    "link": "https://www.rigzone.com/news/wire/crude_gains_as_geopolitical_risks_grow-27-jan-2026-182866-article/",
    "timestamp": "2026-01-27T20:36:21Z"
  },
  {
    "title": "Trump hails Rubio as diplomatic mentor as secretary of state's power grows",
    "description": "President Donald Trump credited Secretary of State Marco Rubio with teaching him diplomacy while he shared an anecdote about his relationship with Chinese President Xi Jinping.",
    "link": "https://www.foxnews.com/politics/trump-hails-rubio-diplomatic-mentor-secretary-states-power-grows",
    "timestamp": "2026-01-27T20:33:15Z"
  },
  {
    "title": "Half Of Surveyed Voters Think U.S. Democracy Is 'Weak,' Poll Finds",
    "description": "Voters think more open primary elections would lead to better candidates and a more representative Congress.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2026/01/27/half-of-surveyed-voters-think-us-democracy-is-weak-poll-finds/",
    "timestamp": "2026-01-27T20:32:45Z"
  },
  {
    "title": "Carney’s China EV deal cheered by California’s clean air cop",
    "description": "Mark Carney's deal to cuts tariffs on Chinese EVs and accept 49,000 imports has California's clean-air cop applauding the PM. Read more here",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/carneys-china-ev-deal-cheered-california",
    "timestamp": "2026-01-27T20:31:27Z"
  },
  {
    "title": "Carney’s China EV deal cheered by California’s clean air cop",
    "description": "Mark Carney's deal to cuts tariffs on Chinese EVs and accept 49,000 imports has California's clean-air cop applauding the PM. Read more here",
    "link": "https://financialpost.com/transportation/autos/carneys-china-ev-deal-cheered-california",
    "timestamp": "2026-01-27T20:31:27Z"
  },
  {
    "title": "Carney’s China EV Deal Cheered by California’s Clean Air Cop",
    "description": "Canada’s agreement to allow 49,000 Chinese electric cars into the country bolsters the global effort to phase out gas vehicles, the California Air Resources Board chair said.",
    "link": "https://financialpost.com/pmn/business-pmn/carneys-china-ev-deal-cheered-by-californias-clean-air-cop",
    "timestamp": "2026-01-27T20:31:27Z"
  },
  {
    "title": "“Uncharted water”: Caribbean boat strike victims’ families sue US",
    "description": "The families of several Trinidadian men killed by U.S. airstrikes in the Caribbean filed wrongful death suits.",
    "link": "https://www.salon.com/2026/01/27/uncharted-water-caribbean-boat-strike-victims-families-sue-us/",
    "timestamp": "2026-01-27T20:31:03Z"
  },
  {
    "title": "Republicans Beg Trump to Curb ICE and Avert Shutdown",
    "description": "Republicans are begging Trump to curb ICE and avert government shutdown. Congressional Republicans can’t find a legislative solution, so they need Trump to offer ICE reforms that might appease Democrats.",
    "link": "http://nymag.com/intelligencer/article/republicans-beg-trump-to-curb-ice-and-avert-shutdown.html",
    "timestamp": "2026-01-27T20:30:25Z"
  },
  {
    "title": "Bill Maher Admits He's Terrified About Aliens Meeting 'Narcissistic' Donald Trump — 'It Wouldn't Be a Good Look for Humans'",
    "description": "The HBO star said he feared extraterrestrial life getting the wrong impression about humanity if they first met Donald Trump upon landing.",
    "link": "https://radaronline.com/p/bill-maher-terrified-aliens-meeting-narcissistic-trump/",
    "timestamp": "2026-01-27T20:30:00Z"
  },
  {
    "title": "Geopolitics will cast a long shadow over the 2026 Milan Cortina Winter Olympic Games",
    "description": "Sporting rivalries, national ambitions and global politics are set to intersect in ways rarely seen before in the upcoming Winter Olympics.",
    "link": "https://theconversation.com/geopolitics-will-cast-a-long-shadow-over-the-2026-milan-cortina-winter-olympic-games-273764",
    "timestamp": "2026-01-27T20:29:59Z"
  },
  {
    "title": "Trump Signs Order to Expedite Rebuild of Palisades, Eaton Canyon After California, L.A. Governments’ ‘Failures’",
    "description": "President Donald Trump signed an executive order on Tuesday to expedite rebuilding in the Pacific Palisades and Eaton Canyon after wildfires ravaged the Los Angeles communities in January 2025.\nThe post Trump Signs Order to Expedite Rebuild of Palisades, Eato…",
    "link": "https://www.breitbart.com/politics/2026/01/27/trump-signs-order-to-expedite-rebuild-of-palisades-eaton-canyon-after-california-l-a-governments-failures/",
    "timestamp": "2026-01-27T20:27:50Z"
  },
  {
    "title": "Anderson Cooper Exposes Trump's Second Amendment Double Standard",
    "description": "“Alex Pretti was apparently not his kind of gun owner,” the CNN anchor said after rolling tapes that highlighted the president’s hypocrisy.",
    "link": "https://www.huffpost.com/entry/anderson-cooper-exposes-trumps-second-amendment-double-standard-and-he-has-receipts_n_6978d30ee4b0a848d14f38aa",
    "timestamp": "2026-01-27T20:27:36Z"
  },
  {
    "title": "The Tariffs Now Hitting American Comic Book Stores… More To Come?",
    "description": "The Diamond Comic Distributors business, purchased by Ad Populum/Sparkle Pop, referred to as Diamond II, may not distribute many, if any, comic books right now. But they are still distributing collectable merchandise, principally through companies owned by Ad…",
    "link": "https://bleedingcool.com/collectibles/the-tariffs-now-hitting-american-comic-book-stores-more-to-come/",
    "timestamp": "2026-01-27T20:27:07Z"
  }
]