[
  {
    "title": "Federal Judge Dismisses Donald Trump’s Copyright Lawsuit Against Bob Woodward",
    "description": "The president filed the suit in 2023 alleging he has a copyright interest in recordings used in two of the journalist's books\nThe post Federal Judge Dismisses Donald Trump’s Copyright Lawsuit Against Bob Woodward appeared first on TheWrap.",
    "link": "https://www.thewrap.com/federal-judge-dismisses-donald-trumps-copyright-lawsuit-against-bob-woodward/",
    "timestamp": "2025-07-20T21:28:33Z"
  },
  {
    "title": "Here’s What Jeffrey Epstein Did—The Convictions And Allegations—And The Questions Raised Now",
    "description": "Epstein pleaded guilty to state charges for soliciting prostitution and soliciting prostitution from a minor in 2008, but was hit with additional federal charges in 2019 before his death.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/07/20/heres-what-jeffrey-epstein-did-the-convictions-and-allegations-and-the-questions-raised-now/",
    "timestamp": "2025-07-20T21:26:46Z"
  },
  {
    "title": "'There's more out there': President said to be facing major 'risks' with latest moves",
    "description": "President Donald Trump's efforts to sweep the recent bombshell report from the Wall Street Journal under the rug could completely backfire on him, according to one conservative analyst. Last week, the Wall Street Journal reported on a letter Trump allegedly s…",
    "link": "https://www.rawstory.com/trump-2673532602/",
    "timestamp": "2025-07-20T21:23:56Z"
  },
  {
    "title": "Japan PM's Future In Doubt After Election Debacle",
    "description": "Japanese Prime Minister Shigeru Ishiba's future was unclear Monday after his coalition appeared to have disastrously lost its upper house majority in elections that saw strong gains by a right-wing populist party.",
    "link": "https://www.ibtimes.com/japan-pms-future-doubt-after-election-debacle-3778977",
    "timestamp": "2025-07-20T21:21:07Z"
  },
  {
    "title": "Nightmare polls for Ley’s Coalition as Parliament finally returns",
    "description": "New polling shows things have become even worse for the Coalition since its shellacking at the May election, and the Jeffrey Epstein story continues to dog Donald Trump.\nThe post Nightmare polls for Ley’s Coalition as Parliament finally returns appeared first…",
    "link": "http://www.crikey.com.au/2025/07/21/nightmare-polls-coalition-parliament-donald-trump-jeffrey-epstein/",
    "timestamp": "2025-07-20T21:19:38Z"
  },
  {
    "title": "‘Totally blown up’: Trump pushes changing name of Washington Commanders back to Redskins",
    "description": "'Times are different now than they were three or four years ago. We are a Country of passion and common sense. OWNERS, GET IT DONE!!!'",
    "link": "https://www.wnd.com/2025/07/totally-blown-up-trump-pushes-changing-name-washington/",
    "timestamp": "2025-07-20T21:19:27Z"
  },
  {
    "title": "GENIUS Act Signed — But Not Yet Effective: Let’s Clear the Air (Roberto Garavaglia)",
    "description": "On July 18, 2025, the much-anticipated GENIUSAct (S.1582) was signed into law by President Trump — a...",
    "link": "https://www.finextra.com/blogposting/28930/genius-act-signed--but-not-yet-effective-lets-clear-the-air",
    "timestamp": "2025-07-20T21:14:09Z"
  },
  {
    "title": "Guardians aren't interested in change after President Trump calls for them, Commanders to go back to old offensive nicknames",
    "description": "President Donald Trump went on a long rant on Truth Social on Sunday calling for both the Guardians and Commanders to change their team names.",
    "link": "https://sports.yahoo.com/mlb/article/guardians-arent-interested-in-change-after-president-trump-calls-for-them-commanders-to-go-back-to-old-offensive-nicknames-211208504.html",
    "timestamp": "2025-07-20T21:12:08Z"
  },
  {
    "title": "Guardians aren't interested in change after President Trump calls for them, Commanders to go back to old nicknames",
    "description": "President Donald Trump went on a long rant on Truth Social on Sunday calling for both the Guardians and Commanders to change their team names.",
    "link": "https://sports.yahoo.com/mlb/article/guardians-arent-interested-in-change-after-president-trump-calls-for-them-commanders-to-go-back-to-old-nicknames-211208437.html",
    "timestamp": "2025-07-20T21:12:08Z"
  },
  {
    "title": "Trump could crush Canada's softwood exports. Here's how a new crisis could play out",
    "description": "The softwood lumber industry has seen a unique pattern emerge, where Canadian firms own a large chunk of U.S. production capacity — something President Donald Trump says he wants — and still face aggressive trade measures.",
    "link": "https://nationalpost.com/news/canada/trump-canada-softwood-lumber-crisis",
    "timestamp": "2025-07-20T21:11:42Z"
  },
  {
    "title": "Laurie Cardoza-Moore: 'Woke right' is normalizing antisemitic rhetoric",
    "description": "Laurie Cardoza-Moore, head of PJTN says antisemitism is infiltrating US education and Hispanic and Latino Christians have a biblical responsibility to stand with the Jewish people and the State of Israel.",
    "link": "https://www.israelnationalnews.com/news/411957",
    "timestamp": "2025-07-20T21:07:22Z"
  },
  {
    "title": "Blackstone Backs Off From TikTok Ownership Plans",
    "description": "Private equity group Blackstone has withdrawn from plans to invest in TikTok US. [contact-form-7] That’s according to a report Friday (July 18) by Reuters, citing a source familiar with the matter. The change, as Reuters pointed out, is happening amid mountin…",
    "link": "http://www.pymnts.com/news/social-commerce/2025/blackstone-backs-off-from-tiktok-ownership-plans/",
    "timestamp": "2025-07-20T21:02:38Z"
  },
  {
    "title": "Jon Jones responds to Daniel Cormier threat: ‘Those ass whoopings must’ve left more than bruises’",
    "description": "Jon Jones is going after Daniel Cormier for comments his old rival made on a UFC weigh-in show.",
    "link": "https://www.mmafighting.com/2025/7/20/24470667/jon-jones-responds-to-daniel-cormier-threat-those-ass-whoopings-mustve-left-more-than-bruises",
    "timestamp": "2025-07-20T21:00:00Z"
  },
  {
    "title": "Trump’s ‘America First’ Policies Are Diminishing U.S. Global Influence",
    "description": "As U.S. President Donald Trump has reignited the trade war with China, he is gutting federal government funding for foreign aid agencies and media outlets, in a move touted as an ‘America first’ approach by his Administration and slammed by Democrats and crit…",
    "link": "https://oilprice.com/Geopolitics/International/Trumps-America-First-Policies-Are-Diminishing-US-Global-Influence.html",
    "timestamp": "2025-07-20T21:00:00Z"
  },
  {
    "title": "Dana White Won’t Risk Jon Jones Headlining UFC White House Event",
    "description": "UFC CEO Dana White will not risk using former UFC champion Jon Jones in the main event of the UFC White House event. Jones expresses disappointment in White's decision.",
    "link": "https://www.forbes.com/sites/trentreinsmith/2025/07/20/dana-white-wont-risk-jon-jones-headlining-ufc-white-house-event/",
    "timestamp": "2025-07-20T20:54:28Z"
  },
  {
    "title": "'Japanese First' party emerges as election force with tough immigration talk",
    "description": "The fringe far-right Sanseito party emerged as one of the biggest winners in Japan's upper house election on Sunday, gaining support with warnings of a &quot;silent invasion&quot; of immigrants, and pledges for tax cuts and welfare spending. Birthed on YouTub…",
    "link": "https://japantoday.com/category/politics/%27japanese-first%27-party-emerges-as-election-force-with-tough-immigration-talk",
    "timestamp": "2025-07-20T20:54:22Z"
  },
  {
    "title": "Trump calls for old Commanders, Guardians names",
    "description": "President Donald Trump wants Washington's football franchise and Cleveland's baseball team to revert to their former names.",
    "link": "https://www.espn.com/espn/story/_/id/45783141/trump-calls-commanders-guardians-reverse-name-changes",
    "timestamp": "2025-07-20T20:53:46Z"
  },
  {
    "title": "Trump: Schiff should be prosecuted, echoes Gabbard claims",
    "description": "US President Donald Trump renewed calls for legal action against Congressman Adam Schiff on Sunday, accusing him of wrongdoing and comparing the case to attempts to prosecute him.\n\"Adam Schiff i...",
    "link": "https://biztoc.com/x/4e22c31390c454df",
    "timestamp": "2025-07-20T20:53:04Z"
  },
  {
    "title": "Gold price prediction: Gold rate to go up? Here's what analysts say",
    "description": "Gold price thrives during economic uncertainty, and lower interest rates boost investor demand as it is a non-yielding asset.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-gold-rate-to-go-up-heres-what-analysts-say/articleshow/122801615.cms",
    "timestamp": "2025-07-20T20:52:28Z"
  },
  {
    "title": "Ellen DeGeneres Says She Moved to the U.K. Because of Donald Trump: Life ‘Is Just Better’ Here",
    "description": "Ellen DeGeneres says she decided to make the U.K. her permanent home because of Donald Trump’s re-election as U.S. President. Making her first public appearance since leaving the U.S. last year, the chat show host revealed that she decided to settle in the U.…",
    "link": "https://variety.com/2025/tv/global/ellen-degeneres-moved-to-the-uk-because-donald-trump-1236465541/",
    "timestamp": "2025-07-20T20:52:15Z"
  },
  {
    "title": "Texas Governor Says He'll Introduce Flood Items at Special Session",
    "description": "Governor Greg Abbott will introduce flood preparedness legislation at Monday's special session following deadly July 4th flooding.",
    "link": "https://www.newsweek.com/governor-greg-abbott-introduce-flood-items-special-session-2101463",
    "timestamp": "2025-07-20T20:52:15Z"
  },
  {
    "title": "'That was a confession': Ex-insider claims 'crime happened' with Trump and Epstein",
    "description": "Donald Trump's former \"trusted operative\" on Sunday made the case that the president is indeed hiding something potentially criminal with his connection to Jeffrey Epstein.Trump has categorically denied all allegations of inappropriate behavior as it relates …",
    "link": "https://www.rawstory.com/trump-confession-trump-epstein-allegation/",
    "timestamp": "2025-07-20T20:51:48Z"
  },
  {
    "title": "Stephen Colbert gets solidarity from fellow late-night hosts after cancellation news",
    "description": "Stephen Colbert received messages of support and affection from his fellow late-night hosts after announcing that CBS was canceling his show, \"The Late Show With Stephen Colbert,\" next May.",
    "link": "https://www.wesh.com/article/stephen-colbert-reactions-late-night-hosts/65457555",
    "timestamp": "2025-07-20T20:51:34Z"
  },
  {
    "title": "TRUMP: Biden-Released Illegal Alien 'Monster' Shot Border Patrol Agent in Face During NY Robbery",
    "description": "An illegal alien released by the Biden administration allegedly shot an off-duty Border Patrol agent in the face during an attempted robbery in New York City. Despite being shot twice, the agent managed to return fire, wounding the suspect as he fled on a mop…",
    "link": "https://www.breitbart.com/border/2025/07/20/trump-biden-released-illegal-alien-monster-shot-border-patrol-agent-in-face-during-ny-robbery/",
    "timestamp": "2025-07-20T20:51:33Z"
  },
  {
    "title": "Calm reported in Syria's Sweida; Damascus says truce holding",
    "description": "Residents reported calm in Syria's Sweida on Sunday after the Islamist-led government announced that Bedouin fighters had withdrawn from the predominantly Druze city and a U.S. envoy signalled that a deal to end days of fighting was being implemented. With hu…",
    "link": "https://japantoday.com/category/world/calm-reported-in-syria%27s-sweida-damascus-says-truce-holding2",
    "timestamp": "2025-07-20T20:49:23Z"
  },
  {
    "title": "Trump says he will help Afghans stuck in the UAE",
    "description": "President Donald Trump said on Sunday he would help Afghans detained in the United Arab Emirates for years after fleeing their country when the United States pulled out and the Taliban took power. Trump, a Republican who promised a far-reaching immigration cr…",
    "link": "https://japantoday.com/category/world/trump-says-he-will-help-afghans-stuck-in-the-uae2",
    "timestamp": "2025-07-20T20:49:15Z"
  },
  {
    "title": "Russia insists on achieving Ukraine goals despite Trump's ultimatum",
    "description": "Russia is open to peace with Ukraine but achieving its goals remains a priority, Kremlin spokesman Dmitry Peskov said Sunday, days after U.S. President Donald Trump gave Moscow a 50-day deadline to agree to a ceasefire or face tougher sanctions. Peskov and ot…",
    "link": "https://japantoday.com/category/world/russia-is-open-to-peace-with-ukraine-but-insists-on-achieving-its-goals-kremlin-spokesman-says",
    "timestamp": "2025-07-20T20:49:07Z"
  },
  {
    "title": "Alan Dershowitz Says He Can Help Team Trump Prove WSJ’s Epstein Story Was ‘Malice’",
    "description": "Alan Dershowitz said he could be called as a witness in Donald Trump’s suit against the Wall Street Journal, adding that he can help “prove malice” in the case.",
    "link": "https://dailycaller.com/2025/07/20/alan-dershowitz-donald-trump-wall-street-journal-report-epstein-malice/",
    "timestamp": "2025-07-20T20:44:14Z"
  },
  {
    "title": "Trump Suggests He’ll Block Washington Commanders Stadium Deal If Name Change Isn’t Reversed ‘Immediately’",
    "description": "The president also criticized the Cleveland Guardians for retiring their “Indians” nickname.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/07/20/trump-suggests-hell-block-washington-commanders-stadium-deal-if-name-change-isnt-reversed-immediately/",
    "timestamp": "2025-07-20T20:42:48Z"
  },
  {
    "title": "Trump floats 'restriction' for Commanders if they fail to ditch nickname in favor of Redskins return",
    "description": "President Donald Trump threatened to put a \"restriction\" on the Washington Commanders' plans to build a new stadium in D.C. over refusal to revert back to their old name.",
    "link": "https://www.foxnews.com/sports/trump-floats-restriction-commanders-fail-ditch-nickname-favor-redskins-return",
    "timestamp": "2025-07-20T20:42:33Z"
  },
  {
    "title": "Trump Threatens to ‘Put a Restriction’ On the Washington Commanders if They Don’t Change Their Name Back to Redskins",
    "description": "President Donald Trump is threatening to \"put a restriction\" on the Washington Commanders if they do not restore their nickname to the Redskins.\nThe post Trump Threatens to ‘Put a Restriction’ On the Washington Commanders if They Don’t Change Their Name Back …",
    "link": "https://www.mediaite.com/media/sports/trump-threatens-to-put-a-restriction-on-the-washington-commanders-if-they-dont-change-their-name-back-to-redskins/",
    "timestamp": "2025-07-20T20:41:31Z"
  },
  {
    "title": "“They’re Coming Out of the Woodwork!” Whistleblowers Who Helped Craft Obama-Brennan’s Phony Russia Report Are Turning Over Affidavits to DOJ",
    "description": "The walls are closing in on Obama’s Deep State. Director of National Intelligence Tulsi Gabbard dropped a political nuke Sunday morning on Fox News with Maria Bartiromo. Gabbard confirmed that multiple intelligence whistleblowers—some of whom helped compile t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329785/posts",
    "timestamp": "2025-07-20T20:39:21Z"
  },
  {
    "title": "“They’re Coming Out of the Woodwork!” Whistleblowers Who Helped Craft Obama-Brennan’s Phony Russia Report Are Turning Over Affidavits to DOJ",
    "description": "The walls are closing in on Obama’s Deep State. Director of National Intelligence Tulsi Gabbard dropped a political nuke Sunday morning on Fox News with Maria Bartiromo. Gabbard confirmed that multiple intelligence whistleblowers—some of whom helped compile t…",
    "link": "https://freerepublic.com/focus/f-news/4329785/posts",
    "timestamp": "2025-07-20T20:39:21Z"
  },
  {
    "title": "The stock market is being led by a new group of winners",
    "description": "There's a new group of big winners emerging.",
    "link": "https://www.thestreet.com/investing/stock-market-rally-is-being-led-by-a-new-cast-of-characters",
    "timestamp": "2025-07-20T20:37:00Z"
  },
  {
    "title": "Bernie Moreno on Trump's Call to Change 'Guardians' Back to 'Indians': 'Cleveland Wants This, Let's Go!'",
    "description": "Sen. Bernie Moreno (R-OH) reacted to President Donald Trump's call to change the Guardians back to Indians, declaring, \"Cleveland wants this.\"\nThe post Bernie Moreno on Trump’s Call to Change ‘Guardians’ Back to ‘Indians’: ‘Cleveland Wants This, Let’s Go!’ ap…",
    "link": "https://www.breitbart.com/sports/2025/07/20/sen-bernie-moreno-on-trumps-call-to-change-guardians-back-to-indians-cleveland-wants-this/",
    "timestamp": "2025-07-20T20:32:51Z"
  },
  {
    "title": "Trump's aid cuts boost China's importance in South-East Asia, Lowy finds",
    "description": "China is expected to fill a gap in aid funding to Australia's region as the Trump administration slashes US development programs.",
    "link": "https://www.abc.net.au/news/2025-07-21/lowy-south-east-asia-aid-map-reveals-western-retreat-in-region/105540812",
    "timestamp": "2025-07-20T20:32:13Z"
  },
  {
    "title": "US Bitcoin ETFs Record Second Consecutive $2 Billion Inflow Week — Details",
    "description": "The US-based spot Bitcoin ETFs (exchange-traded funds) have been in scintillating form over the past few weeks, seeing an influx of significant capital during this period. This positive trend should come as no surprise, considering the recent sentiment toward…",
    "link": "https://bitcoinist.com/bitcoin-etfs-second-2-billion-inflow-in-two-weeks/",
    "timestamp": "2025-07-20T20:30:34Z"
  },
  {
    "title": "Scout Motors urges DOJ to fight state dealer franchise laws",
    "description": "The Republican Party may be the party of \"states' rights,\" but Scout Motors hopes the current Republican presidential administration will eliminate the state...",
    "link": "https://www.autoblog.com/electric/this-vw-brand-wants-to-rewrite-how-cars-are-sold-in-america",
    "timestamp": "2025-07-20T20:30:00Z"
  },
  {
    "title": "Howard Lutnick Claims Tariffs Will Spark Up to 1.5 GDP Growth",
    "description": "The commerce secretary said President Donald Trump's sweeping new tariffs would drive as much as 1.5 percent gross domestic product growth.",
    "link": "https://www.newsweek.com/commerce-secretary-howard-lutnick-tariffs-spark-gdp-growth-2101422",
    "timestamp": "2025-07-20T20:29:32Z"
  },
  {
    "title": "Burgeoning Hedge Strategy Amplifies Commercial Technology In Defense",
    "description": "Defense spending emphasizes new capabilities like unmanned systems, AI, and space-based sensors led by commercial companies",
    "link": "https://www.forbes.com/sites/mikebrown/2025/07/20/burgeoning-hedge-strategy-amplifies-commercial-technology-in-defense/",
    "timestamp": "2025-07-20T20:25:50Z"
  },
  {
    "title": "Positive Update: List of Missing People From Texas Floods Shrinks From 97 Down to Three",
    "description": "Kerr County, Texas officials reported Saturday that of the nearly 100 people listed as missing at last count since deadly flash flooding overtook Texas on July... Read More\nThe post Positive Update: List of Missing People From Texas Floods Shrinks From 97 Dow…",
    "link": "https://www.dailysignal.com/2025/07/20/three-people-missing-kerr-county/",
    "timestamp": "2025-07-20T20:24:27Z"
  },
  {
    "title": "No Tax On Tips Explained",
    "description": "“No Tax on Tips” sounds great—until you read the fine print. Who really benefits from this deduction, and who’s left behind? Here’s what you need to know.",
    "link": "https://www.forbes.com/sites/andrewleahey/2025/07/20/no-tax-on-tips-explained/",
    "timestamp": "2025-07-20T20:24:18Z"
  },
  {
    "title": "Trump Boldly Claims The ‘Jeffrey Epstein Hoax’ Has Boosted His Approval Rating ‘Significantly’",
    "description": "The president bragged that his poll numbers have skyrocketed despite ongoing backlash over his handling of Epstein’s files.",
    "link": "https://www.huffpost.com/entry/trump-approval-rating-jeffrey-epstein-files-backlash_n_687d0429e4b06691ec249af0",
    "timestamp": "2025-07-20T20:22:53Z"
  },
  {
    "title": "Judge Dismisses Donald Trump’s Lawsuit Against Bob Woodward, Simon & Schuster And Paramount Global",
    "description": "A federal judge tossed out Donald Trump‘s lawsuit against Bob Woodward, Simon & Schuster and Paramount Global over the legendary investigative journalist’s use of his recordings of interviews with the president for an audiobook. In his 2023 lawsuit, Trump had…",
    "link": "http://deadline.com/2025/07/trump-bob-woodward-lawsuit-dismissed-1236463074/",
    "timestamp": "2025-07-20T20:21:52Z"
  },
  {
    "title": "Trump slams WSJ for 'untruthful' Bessant story",
    "description": "United States President Donald Trump criticized the Wall Street Journal for publishing a \"typically untruthful story\" alleging that US Treasury Secretary Scott Bessent told him that firing Federal Res...",
    "link": "https://biztoc.com/x/d62fb148d4cdd0bb",
    "timestamp": "2025-07-20T20:19:39Z"
  },
  {
    "title": "Six Months In: Trump Celebrates Revival of ‘Hottest’ Country In The World",
    "description": "\"Wow, time flies!\" the president remarked.President Donald Trump struck a victorious tone on Sunday as he marked the first six months of his second term.In a post on Truth Social, Trump alluded to some of his accomplishments on the foreign policy and tariff f…",
    "link": "https://freerepublic.com/focus/f-news/4329782/posts",
    "timestamp": "2025-07-20T20:14:43Z"
  },
  {
    "title": "The progressive Texas congresswoman thinks Republicans’ obeisance to Trump’s whims looks awfully like the unquestioning fealty of Nazi officials to the Führer himself.",
    "description": "Texas Democrat Jasmine Crockett has torn into her Republican counterparts for falling in goosestep with Donald Trump’s every whim. “They want to show they’re...",
    "link": "https://www.thedailybeast.com/democratic-rep-jasmine-crockett-dubs-donald-trump-wannabe-hitler-over-jeffrey-epstein-carnage/",
    "timestamp": "2025-07-20T20:12:51Z"
  },
  {
    "title": "President Trump floats tying D.C. stadium deal to Commanders name change",
    "description": "If Commanders want to build at the RFK Stadium site, they may have to go back to their old name.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/president-trump-floats-tying-d-c-stadium-deal-to-commanders-name-change",
    "timestamp": "2025-07-20T20:11:53Z"
  },
  {
    "title": "‘Typically Untruthful Story!’ Trump Attacks the Wall St. Journal Amid President’s Lawsuit Over Epstein Story",
    "description": "Trump is ramping up his attacks on the WSJ days after suing them over an article in which they reported that Trump wrote a tawdry letter to Epstein in 2003.\nThe post ‘Typically Untruthful Story!’ Trump Attacks the Wall St. Journal Amid President’s Lawsuit Ove…",
    "link": "https://www.mediaite.com/media/news/typically-untruthful-story-trump-attacks-the-wall-st-journal-amid-presidents-lawsuit-over-epstein-story/",
    "timestamp": "2025-07-20T20:10:50Z"
  },
  {
    "title": "Donald Trump demands NFL football team Washington Commanders, Baseball team Cleveland Guardians name change. Owners have other ideas",
    "description": "Washington dropped Redskins after the 2019 season and was known as the Washington Football Team for two years before moving to Commanders. Cleveland announced in December 2020 it would drop Indians. It announced the switch to Guardians in July 2021. In 2018, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-demands-nfl-football-team-washington-commanders-baseball-team-cleveland-guardians-name-change-owners-have-other-ideas/articleshow/122801546.cms",
    "timestamp": "2025-07-20T20:08:51Z"
  },
  {
    "title": "Trump's latest demand: Washington football and Cleveland baseball teams should change names back",
    "description": "President Donald Trump wants Washington's football franchise and Cleveland's baseball team to revert to their former names",
    "link": "https://www.nbcnews.com/politics/donald-trump/trumps-demand-washington-football-cleveland-baseball-name-change-rcna219890",
    "timestamp": "2025-07-20T20:04:38Z"
  },
  {
    "title": "Off-duty CBP officer shot during attempted robbery involving previously-deported illegal immigrant: DHS",
    "description": "An off-duty CBP officer was shot in New York City during an attempted robbery involving Miguel Francisco Mora Nunez, a previously deported illegal immigrant with active warrants, according to the DHS.",
    "link": "https://www.foxnews.com/us/off-duty-cbp-officer-shot-during-attempted-robbery-involving-previously-deported-illegal-immigrant-dhs",
    "timestamp": "2025-07-20T20:04:04Z"
  },
  {
    "title": "White House Insists Trump Fell Out With Epstein ‘For Being a Creep’ — Not Their 2019 Real Estate Dispute",
    "description": "Press secretary Karoline Leavitt says stories of the president's history with Epstein \"are tired and pathetic attempts to distract from all the success of President Trump’s administration” \nThe post White House Insists Trump Fell Out With Epstein ‘For Being a…",
    "link": "https://www.thewrap.com/white-house-trump-epstein-fall-out-real-estate-dispute/",
    "timestamp": "2025-07-20T20:02:30Z"
  },
  {
    "title": "WATCH: U.S. Border Patrol agent shot in face by illegal alien serial criminal with a deportation order",
    "description": "Suspect was nabbed twice just days apart August 2024 for allegedly assaulting a pregnant woman and threatening to kill another migrant with a machete",
    "link": "https://www.wnd.com/2025/07/watch-u-s-border-patrol-agent-shot-face/",
    "timestamp": "2025-07-20T20:00:35Z"
  },
  {
    "title": "Who Counts? Trump Poised to Try to Remove Noncitizens From Census",
    "description": "Following a years-long surge in illegal immigration, the President Donald Trump administration is poised to challenge a longstanding but legally fraught practice: counting illegal aliens... Read More\nThe post Who Counts? Trump Poised to Try to Remove Noncitiz…",
    "link": "https://www.dailysignal.com/2025/07/20/who-counts-trump-poised-to-try-to-remove-noncitizens-from-census/",
    "timestamp": "2025-07-20T20:00:00Z"
  },
  {
    "title": "Exit polls show Japan’s ruling coalition is likely to lose key election",
    "description": "TOKYO, July 20: Exit polls show Prime Minister Shigeru Ishiba’s ruling coalition is likely to lose a majority in the smaller of Japan’s two parliamentary houses in a key election Sunday, worsening the country’s political instability. Voters were deciding half…",
    "link": "https://thehillstimes.in/international/exit-polls-show-japans-ruling-coalition-is-likely-to-lose-key-election",
    "timestamp": "2025-07-20T20:00:00Z"
  },
  {
    "title": "California, other Democratic-led states roll back Medicaid access for people lacking legal status",
    "description": "SACRAMENTO — For nearly 20 years, Maria would call her sister — a nurse in Mexico — for advice on how to manage her asthma and control her husband’s diabetes instead of going to the doctor in California. She didn’t have legal status, so she couldn’t get healt…",
    "link": "https://freerepublic.com/focus/f-news/4329779/posts",
    "timestamp": "2025-07-20T19:57:25Z"
  },
  {
    "title": "Number of missing in deadly Texas floods drops to three",
    "description": "Rescue teams have worked \"tirelessly\" to track down those reported missing after the floods in Kerr County on 4 July.",
    "link": "https://www.bbc.com/news/articles/cdr37re4rgko",
    "timestamp": "2025-07-20T19:56:17Z"
  },
  {
    "title": "Months of Trump’s tariffs are shifting supply chains and diplomatic ties",
    "description": "CEOs and foreign leaders are scrambling to figure out new rules for global commerceMajor U.S. corporations and trading partners are scrambling to adapt to a new global economy, even as President Donald Trump mulls the imposition of historic tariffs in less th…",
    "link": "https://freerepublic.com/focus/f-news/4329777/posts",
    "timestamp": "2025-07-20T19:45:52Z"
  },
  {
    "title": "LA Mayor Bass dodges question on whether all illegal immigrants in city should be allowed to stay",
    "description": "Los Angeles Mayor Karen Bass claimed the city's economy and fire recovery depends on immigrant labor while dodging questions on deporting illegal aliens.",
    "link": "https://www.foxnews.com/us/la-mayor-bass-dodges-question-whether-all-illegal-immigrants-city-should-allowed-stay",
    "timestamp": "2025-07-20T19:45:19Z"
  },
  {
    "title": "Fresh Details Emerge About Trump and Epstein's Friendship as Sicko's Ex-Girlfriend Declares They Were 'Very Close and Up To No Good'",
    "description": "Stacey Williams, a former girlfriend of the late Jeffrey Epstein, has claimed her late ex and Donald Trump were 'very close'.",
    "link": "https://radaronline.com/p/donald-trump-jeffrey-epstein-friendship-ex-girlfriend-very-close/",
    "timestamp": "2025-07-20T19:45:00Z"
  },
  {
    "title": "Epstein accuser asked authorities to look into Trump twice",
    "description": "In a new interview, a former employee of Jeffrey Epstein said she told the FBI to look into Trump twice.",
    "link": "https://www.salon.com/2025/07/20/epstein-accuser-asked-authorities-to-look-into-trump-twice/",
    "timestamp": "2025-07-20T19:43:06Z"
  },
  {
    "title": "PANIC MODE: Dem Rep. Jim Himes Demands DNI Gabbard Halt Release of Obama-Era Deep State Docs — Claims John Brennan’s Life in Danger from ‘MAGA Mouth Breathers’",
    "description": "Democrat panic is reaching a boiling point. Democrat Congressman Jim Himes (D-CT), the top Democrat on the House Intelligence Committee, went into full-blown panic mode, demanding that Director of National Intelligence Tulsi Gabbard stop releasing documents t…",
    "link": "https://freerepublic.com/focus/f-news/4329774/posts",
    "timestamp": "2025-07-20T19:39:02Z"
  },
  {
    "title": "‘THIEF!’ Trump Shares Alleged Adam Schiff Tax Document, Calls for Prosecution of ‘Fraud’",
    "description": "Trump on Sunday shared a document he alleges is evidence of mortgage fraud committed by California Democrat Rep. Adam Schiff, calling for a prosecution.\nThe post ‘THIEF!’ Trump Shares Alleged Adam Schiff Tax Document, Calls for Prosecution of ‘Fraud’ first ap…",
    "link": "https://www.mediaite.com/politics/trump/thief-trump-shares-alleged-adam-schiff-tax-document-calls-for-prosecution-of-fraud/",
    "timestamp": "2025-07-20T19:34:49Z"
  },
  {
    "title": "The Great Noticing Continues",
    "description": "You can run a one day story, put it on page 17, and never mention it again. Or you can have rolling coverage with a new front pager every day.  These are always choices and the people who run the agenda-setting newspaper understand this.Ms. Farmer said that w…",
    "link": "https://www.eschatonblog.com/2025/07/the-great-noticing-continues.html",
    "timestamp": "2025-07-20T19:34:00Z"
  },
  {
    "title": "Author Michael Wolff tells The Daily Beast Podcast about the psychology behind Trump’s look-alike female staffers.",
    "description": "While writing his 2018 bestselling book Fire and Fury, author Michael Wolff spent seven months observing the goings-on at the White House, where he was given...",
    "link": "https://www.thedailybeast.com/they-look-like-melania-exploring-trumps-creepy-female-entourage/",
    "timestamp": "2025-07-20T19:32:38Z"
  },
  {
    "title": "Trump Cleveland Indians",
    "description": "That’s how President Donald Trump ended a strongly-worded social media post Sunday in which he encouraged the MLB’s Cleveland Guardians and the NFL’s Washington Commanders to revert to their organization’s former nicknames.",
    "link": "https://fox8.com/news/trump-urges-guardians-commanders-to-reinstate-former-names/",
    "timestamp": "2025-07-20T19:31:46Z"
  },
  {
    "title": "A new mural in France shows the Statue of Liberty covering her eyes in a swipe at Trump",
    "description": "The artist said, \"freedom feels out of reach\" for migrants and \"those pushed to the margins, silenced, or unseen.\"",
    "link": "https://richmond.com/life-entertainment/nation-world/art-theater/article_9481f15e-a269-57a3-a21e-7121350d60a3.html",
    "timestamp": "2025-07-20T19:30:00Z"
  },
  {
    "title": "A new mural in France shows the Statue of Liberty covering her eyes in a swipe at Trump",
    "description": "The artist said, \"freedom feels out of reach\" for migrants and \"those pushed to the margins, silenced, or unseen.\"",
    "link": "https://roanoke.com/life-entertainment/nation-world/art-theater/article_1f89dccf-f003-5832-9d73-ad8dcd479fc2.html",
    "timestamp": "2025-07-20T19:30:00Z"
  },
  {
    "title": "LOL: Ex-NPR CEO Says Stephen Colbert Spoke Truth to Power In a 'Very Bipartisan Way'!",
    "description": "On Saturday's edition of MSNBC's The Weekend, former NPR president and CEO Vivian Schiller, commenting on the cancellation of Stephen Colbert's show, said: \"Stephen Colbert is unafraid to speak truth to power. He does it in a very bipartisan way over the year…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329773/posts",
    "timestamp": "2025-07-20T19:26:27Z"
  },
  {
    "title": "You Said ‘Yes’ to Being an Organ Donor. What Exactly Does That Mean?",
    "description": "Organ donation saves lives and enjoys widespread public support. But many people are unsure what they agree to when they sign up.If there is a small red heart with the words “organ donor” at the bottom of your driver’s license, that puts you in a group of ove…",
    "link": "https://freerepublic.com/focus/f-news/4329770/posts",
    "timestamp": "2025-07-20T19:24:39Z"
  },
  {
    "title": "Donald Trump Demands Commanders Change Name After Offering To ‘Help Out’ With New Stadium Build",
    "description": "Donald Trump is pushing for the Washington Commanders to change their name once again. He’d prefer the franchise return to its former nickname, the Redskins. That name was removed as it was considered a derogatory term by many around the country. The Presiden…",
    "link": "https://brobible.com/sports/article/donald-trump-washington-commanders-name-change-stadium/",
    "timestamp": "2025-07-20T19:20:42Z"
  },
  {
    "title": "USA-Russia war may happen due to Donald Trump, Vladmir Putin?",
    "description": "Ukraine war has been the bone of contention between Russia and USA. Can Donald Trump and Vladimir Putin ensure peaceful resolution.",
    "link": "https://economictimes.indiatimes.com/news/international/us/usa-russia-war-may-happen-due-to-donald-trump-vladmir-putin/articleshow/122801176.cms",
    "timestamp": "2025-07-20T19:20:30Z"
  },
  {
    "title": "PANIC MODE: Dem Rep. Jim Himes Demands DNI Gabbard Halt Release of Obama-Era Deep State Docs — Claims John Brennan’s Life in Danger from ‘MAGA Mouth Breathers’",
    "description": "Democrat panic is reaching a boiling point.\nThe post PANIC MODE: Dem Rep. Jim Himes Demands DNI Gabbard Halt Release of Obama-Era Deep State Docs — Claims John Brennan’s Life in Danger from ‘MAGA Mouth Breathers’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/panic-mode-dem-rep-jim-himes-demands-dni/",
    "timestamp": "2025-07-20T19:20:07Z"
  },
  {
    "title": "Texas Republicans aim to redraw House districts at Trump’s urging, but there’s a risk",
    "description": "AUSTIN, Texas (AP) — U.S. Rep. Vicente Gonzalez, a Texas Democrat who represents a slice of the Rio Grande Valley along the border with Mexico, won his last congressional election by just over 5,000 votes.That makes him a tempting target for Republicans, who …",
    "link": "https://freerepublic.com/focus/f-news/4329768/posts",
    "timestamp": "2025-07-20T19:18:23Z"
  },
  {
    "title": "Greene warns of “Mark of the Beast,” Gabbard cries “Deep State Coup”",
    "description": "Wild week for right-wing conspiracies: MTG's cashless society is “Mark of the Beast,\" DNI claims \"Deep State\" coup",
    "link": "https://www.salon.com/2025/07/20/greene-warns-of-mark-of-the-beast-gabbard-cries-deep-state-coup/",
    "timestamp": "2025-07-20T19:15:25Z"
  },
  {
    "title": "Trump's latest demand: Washington football and Cleveland baseball teams should change names back",
    "description": "President Donald Trump has called for Washington's football team and Cleveland's baseball team to return to their previous names.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_adcecf3d-9f9c-5cdd-97e9-44adc69da697.html",
    "timestamp": "2025-07-20T19:15:00Z"
  },
  {
    "title": "Trump's latest demand: Washington football and Cleveland baseball teams should change names back",
    "description": "President Donald Trump has called for Washington's football team and Cleveland's baseball team to return to their previous names.",
    "link": "https://www.stltoday.com/news/nation-world/government-politics/article_1979a3a3-1961-5d0a-a781-99000aa03b61.html",
    "timestamp": "2025-07-20T19:15:00Z"
  },
  {
    "title": "The 10 Worst Post-Credits Scenes Of All Time",
    "description": "Marvel made credits scenes more common than they once were, whether they're for sequels or just for fun, and these are the worst post-credits scenes out there.",
    "link": "https://www.slashfilm.com/1905884/worst-post-credits-scenes/",
    "timestamp": "2025-07-20T19:10:00Z"
  },
  {
    "title": "Aug. 1 is 'hard deadline' for Trump's tariffs, Commerce Secretary Lutnick says",
    "description": "President Donald Trump's 'reciprocal\" tariff deadline has shifted since April 2, but White House officials insist that Aug. 1 is a firm deadline.",
    "link": "https://www.cnbc.com/2025/07/20/trump-trade-lutnick-august-1-tariffs.html",
    "timestamp": "2025-07-20T19:07:07Z"
  },
  {
    "title": "Trump Aides Looked Into Killing Contracts With Elon Musk’s SpaceX After Trump-Musk Feud: Report",
    "description": "Trump's aides actively considered ending government contracts with Elon Musk's SpaceX in June — amid the president's feud with his former DOGE chief.\nThe post Trump Aides Looked Into Killing Contracts With Elon Musk’s SpaceX After Trump-Musk Feud: Report firs…",
    "link": "https://www.mediaite.com/media/news/trump-aides-looked-into-killing-contracts-with-elon-musks-spacex-after-trump-musk-feud-report/",
    "timestamp": "2025-07-20T19:07:05Z"
  },
  {
    "title": "Stephen Miller 'coup' claim belittled by Musk's chatbot for exploiting 'paranoia'",
    "description": "White House deputy chief of staff Stephen Miller's attempt to ramp up a conspiracy theory about former President Barack Obama did not pass muster with Elon Musk's AI-powered chatbot on Saturday.In a post on X, Miller linked to a post by DNI Tulsi Gabbard that…",
    "link": "https://www.rawstory.com/stephen-miller-2673532519/",
    "timestamp": "2025-07-20T19:06:21Z"
  },
  {
    "title": "Kevin Feige Stands by Marvel’s Diversity: ‘Marvel Is the World Outside Your Window’",
    "description": "\"I said this before 'woke' and 'DEI' became a thing and I am still saying it after,\" the Marvel Studios president and producer said.\nThe post Kevin Feige Stands by Marvel’s Diversity: ‘Marvel Is the World Outside Your Window’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/kevin-feige-marvel-dei-diversity-ms-marvel/",
    "timestamp": "2025-07-20T19:03:12Z"
  },
  {
    "title": "Netanyahu testing US patience with Syria strikes; Trump advisers blast him as ‘acting like a madman’",
    "description": "Israeli airstrikes in Syria have sparked concerns among US officials. They are reportedly frustrated with Benjamin Netanyahu's military actions. The strikes targeted a Syrian military convoy and areas near Damascus. US officials worry about regional destabili…",
    "link": "https://economictimes.indiatimes.com/news/international/us/netanyahu-testing-us-patience-with-syria-strikes-trump-advisers-blast-him-as-acting-like-a-madman/articleshow/122800857.cms",
    "timestamp": "2025-07-20T19:03:02Z"
  },
  {
    "title": "Donald Trump's Immigration Approval Slips: Poll",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSix months into his second term, President Donald Trump is losing support on one of his cornerstone issues—immigration—according to a new poll published on Sunday.\nWhy It Matters\nTrump's second term, now at th…",
    "link": "https://biztoc.com/x/cf460737be0022ae",
    "timestamp": "2025-07-20T19:01:31Z"
  },
  {
    "title": "Democrat Senator Amy Klobuchar Opens Door to Another White House Bid (VIDEO)",
    "description": "Democrat Senator Amy Klobuchar has opened the door to another run for the White House.\nThe post Democrat Senator Amy Klobuchar Opens Door to Another White House Bid (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/senator-amy-klobuchar-opens-door-another-white-house/",
    "timestamp": "2025-07-20T19:00:47Z"
  },
  {
    "title": "Donald Trump's Immigration Approval Slips: Poll",
    "description": "A new poll published on Sunday shows that support for Trump's immigration policies is declining.",
    "link": "https://www.newsweek.com/donald-trumps-immigration-approval-slips-poll-2101448",
    "timestamp": "2025-07-20T19:00:04Z"
  },
  {
    "title": "GoldenMining Integrates New Compliance Measures After Crypto Bill, Yields Hit $7,700/Day",
    "description": "New York, US, July 20, 2025 (GLOBE NEWSWIRE) -- GoldenMining, a leading global cloud mining platform, has announced the successful implementation of enhanced compliance measures following the recent passage of the GENIUS Act—a landmark U.S. crypto regulation …",
    "link": "https://www.globenewswire.com/news-release/2025/07/20/3118377/0/en/GoldenMining-Integrates-New-Compliance-Measures-After-Crypto-Bill-Yields-Hit-7-700-Day.html",
    "timestamp": "2025-07-20T19:00:00Z"
  },
  {
    "title": "Good Thing Judge Blocked Angel Jenkel’s Deportation",
    "description": "It is almost always bad news when a moonbat judge steps in to prevent an illegal alien from being deported. But in the case of Angel Jenkel, it is a cause to rejoice. From Canada’s state media: When Angel Jenkel first came to Canada from the U.S. three years …",
    "link": "https://moonbattery.com/good-thing-judge-blocked-angel-jenkels-deportation/",
    "timestamp": "2025-07-20T18:56:28Z"
  },
  {
    "title": "Beto O'Rourke Says Democrats Cannot 'Play Dead' When It Comes To Republicans Redistricting",
    "description": "The former presidential candidate went on CNN to advise Democrats to get serious about regaining power.",
    "link": "https://www.huffpost.com/entry/beto-orourke-democrats-cannot-play-dead-republicans-redistricting_n_687d1c2ce4b06691ec24a0ed",
    "timestamp": "2025-07-20T18:56:07Z"
  },
  {
    "title": "Woman who helped repair US relationship is Ukraine's new prime minister",
    "description": "Yulia Svyrydenko says supplying Ukraine's army with what it needs to fight Russia is her top priority, but her new appointment has not pleased everyone.",
    "link": "https://www.abc.net.au/news/2025-07-21/who-is-ukraines-new-prime-minister-yulia-svyrydenko/105540188",
    "timestamp": "2025-07-20T18:51:05Z"
  },
  {
    "title": "Jasmine Crockett Calls Trump 'Wannabe Hitler' Over Epstein Files",
    "description": "The Texas lawmaker blasts her GOP colleagues for loyalty to Trump amid Epstein document controversy.",
    "link": "https://www.newsweek.com/jasmine-crockett-calls-trump-wannabe-hitler-over-epstein-files-2101462",
    "timestamp": "2025-07-20T18:50:50Z"
  }
]