[
  {
    "title": "Analysis-Italians and 'lo spread', an obsession whose time has passed",
    "description": "After the BTP-Bund gap took a rare dip below one percentage point, or 100 basis points (bps), Prime Minister Giorgia Meloni told parliament last week \"this...",
    "link": "https://finance.yahoo.com/news/analysis-italians-lo-spread-obsession-095727510.html",
    "timestamp": "2025-05-21T09:57:27Z"
  },
  {
    "title": "Trump Suggests Biden Diagnosis Could Be Part Of Bigger Conspiracy",
    "description": "By Reagan Reese, Daily Caller News Foundation | May 19, 2025\nPresident Donald Trump suggested on Monday that there may be a larger conspiracy at work following former President Joe Biden’s cancer diagnosis. \nTrump addressed Biden’s stage four prostate cancer …",
    "link": "https://biztoc.com/x/d42a96af2cb5682e",
    "timestamp": "2025-05-21T09:57:04Z"
  },
  {
    "title": "Here’s Why House Conservatives Want To Meet With Trump To Hash Out ‘Big, Beautiful Bill’",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | May 19, 2025\nFiscal conservatives hope to meet with President Donald Trump before Wednesday to continue negotiations on the “big, beautiful bill,” Rep. Ralph Norman, R-S.C., told The Daily Signal.\nReps. Norma…",
    "link": "https://biztoc.com/x/1fcbcb6a798f447c",
    "timestamp": "2025-05-21T09:56:59Z"
  },
  {
    "title": "Ideology-Driven, Inflationary Trump Tax and Tariff Policies Losing War With Bond and Currency Markets",
    "description": "Trump's trade, tariffs and tax schemes are already starting to come apart. And he seems to have no Plan B.",
    "link": "https://www.nakedcapitalism.com/2025/05/ideology-driven-inflationary-trump-tax-and-tariff-policies-losing-war-with-bond-and-currency-markets.html",
    "timestamp": "2025-05-21T09:55:24Z"
  },
  {
    "title": "Google reassures EU cloud users amid concern over Trump threat",
    "description": "Tech giant offers additional data security protections in EU as local customers express concern over reliance on US tech",
    "link": "https://www.irishtimes.com/business/2025/05/21/google-reassures-eu-cloud-users-amid-concern-over-trump-threat/",
    "timestamp": "2025-05-21T09:55:18Z"
  },
  {
    "title": "Trump claims ‘treasonous thugs’ took advantage of Biden’s mental decline to open borders: ‘Wanted to destroy our country’",
    "description": "\"This is TREASON at the Highest Level!\" Trump wrote on Truth Social on Tuesday.",
    "link": "https://nypost.com/2025/05/21/us-news/trump-defends-biden-in-truth-social-post-calling-out-treasonous-thugs-that-took-advantage-of-white-house/",
    "timestamp": "2025-05-21T09:55:15Z"
  },
  {
    "title": "Nvidia CEO hails Trump's plan to rescind some export curbs on AI chips to China",
    "description": "Nvidia CEO Jensen Huang praised President Donald Trump’s move to modify U.S. curbs on the export of artificial intelligence chips to China, saying the Biden-era controls were a “failure.”",
    "link": "https://www.nbcnews.com/world/asia/nvidia-ceo-jensen-huang-hails-trumps-plan-rescind-export-curbs-ai-chip-rcna208153",
    "timestamp": "2025-05-21T09:55:10Z"
  },
  {
    "title": "Putin Reveals to Trump: Ukraine Carried Out Drone Attacks on Moscow Ahead of Victory Day",
    "description": "Russian President Vladimir Putin informed US President Donald Trump during a phone call about Ukraine's attacks on the eve of Victory Day celebrations in Russia and the prevention of the threat of terrorist attacks near the Kremlin on the eve of Victory Day, …",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-sputnik03.htm",
    "timestamp": "2025-05-21T09:54:08Z"
  },
  {
    "title": "Putin 'Not Interested At All' In Ukraine Cease-Fire, Lithuanian Foreign Minister Tells RFE/RL",
    "description": "Is Russian President Vladimir Putin really ready to commit to a cease-fire in the war against Ukraine? Lithuanian Foreign Minister Kestutis Budrys doesn't think so.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-rferl02.htm",
    "timestamp": "2025-05-21T09:53:45Z"
  },
  {
    "title": "Donald, Vladimir, And A 2-Hour Phone Call: Did Putin Get The Better Of Trump?",
    "description": "Last month, US President Donald Trump had stern words for Vladimir Putin suggesting the Russian leader was stalling for time, or \"tapping\" Trump along, amid the White House push to halt Moscow's invasion of Ukraine, which is now in its fourth year.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-rferl01.htm",
    "timestamp": "2025-05-21T09:53:44Z"
  },
  {
    "title": "Italians and lo spread, an obsession whose time has passed",
    "description": "ITALY-DEBT/SPREAD (ANALYSIS, PIX):ANALYSIS-Italians and 'lo spread', an obsession whose time has passed",
    "link": "https://www.livemint.com/opinion/online-views/italians-and-lo-spread-an-obsession-whose-time-has-passed-11747821211553.html",
    "timestamp": "2025-05-21T09:53:31Z"
  },
  {
    "title": "US Wants Peace, Some Europeans Want War - Rubio",
    "description": "During a phone conversation, Russian and US Presidents Vladimir Putin and Donald Trump discussed the topic of continuing direct contacts between Russia and Ukraine, including at the highest level.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-sputnik05.htm",
    "timestamp": "2025-05-21T09:53:11Z"
  },
  {
    "title": "Kremlin Commends 'Effective' US Mediation Efforts",
    "description": "Kremlin spokesman Dmitry Peskov shed light on today's phone call between Russian President Vladimir Putin and his US counterpart Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-sputnik06.htm",
    "timestamp": "2025-05-21T09:53:08Z"
  },
  {
    "title": "China supports direct dialogue and negotiations between Russia, Ukraine: Chinese FM on latest Trump-Putin call",
    "description": "When asked about the phone call between US President Donald Trump and the Russian President Vladimir Putin on Ukraine crisis on Monday, after which Trump said Russia and Ukraine will immediately start negotiations for a ceasefire, while Putin said that Russia…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-globaltimes02.htm",
    "timestamp": "2025-05-21T09:51:43Z"
  },
  {
    "title": "Chinese FM says China supports direct dialogue and negotiation between Russia, Ukraine after Putin-Trump call",
    "description": "US President Donald Trump said after his call on Monday with Russian President Vladimir Putin that Russia and Ukraine will immediately start negotiations for a ceasefire. However, the Kremlin said the process would take time and US president indicated he is n…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250520-globaltimes01.htm",
    "timestamp": "2025-05-21T09:51:41Z"
  },
  {
    "title": "Explainer: What to know about Trump's calls with Putin, Zelensky?",
    "description": "Ceasefire negotiations between Russia and Ukraine \"will begin immediately,\" said U.S. President Donald Trump after his two-hour call with his Russian counterpart, Vladimir Putin, on Monday, noting that \"the tone and spirit of the conversation were excellent.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250521-pdo02.htm",
    "timestamp": "2025-05-21T09:51:12Z"
  },
  {
    "title": "No breakthrough during Trump phone calls about Ukraine peace",
    "description": "US President Donald Trump on Monday suggested Russia and Ukraine make a deal directly with each other and that both countries could get enormous economic benefits from ending the war, which has now dragged on for three years.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250521-pdo01.htm",
    "timestamp": "2025-05-21T09:51:10Z"
  },
  {
    "title": "Qatar ramps up conservative media outreach after Trump victory, DOJ docs show",
    "description": "Analysis of records from the Department of Justice shows an upward trend in Qatari investment in conservative media since Trump's win in November.",
    "link": "https://www.jpost.com/middle-east/article-854832",
    "timestamp": "2025-05-21T09:48:36Z"
  },
  {
    "title": "Congress Pulls Tax Cut All-Nighter With SALT Fight Unresolved",
    "description": "House lawmakers debated the contours of President Donald Trump’s tax cuts throughout the night as they race to meet a self-imposed deadline to approve the legislation by Thursday.",
    "link": "https://financialpost.com/pmn/business-pmn/congress-pulls-tax-cut-all-nighter-with-salt-fight-unresolved",
    "timestamp": "2025-05-21T09:47:55Z"
  },
  {
    "title": "Joe Biden Paid Campaign Adviser So Much, It Outraged Other Staffers: Book",
    "description": "Mike Donilon's salary was \"orders of magnitude higher,\" creating jealousy among Joe Biden's team, according to \"Original Sin.\"",
    "link": "https://www.huffpost.com/entry/mike-donilon-4-million-joe-biden-election-original-sin_n_682d8857e4b0627160e7b67c",
    "timestamp": "2025-05-21T09:46:37Z"
  },
  {
    "title": "Cartels Smuggling Stolen Oil Into Texas, DEA Says",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nMultiple Mexican criminal organizations are smuggling stolen crude oil into Texas as part of a sophisticated black-market operation, according to the Drug Enforcement Administration (DEA).\nWhy It Matters\nPresi…",
    "link": "https://biztoc.com/x/69e9916e9f72f1da",
    "timestamp": "2025-05-21T09:45:46Z"
  },
  {
    "title": "Critical minerals for clean energy concentrated in fewer countries",
    "description": "The world’s supplies of critical minerals are increasingly concentrated in just a few countries - most notably China - and subject to export restrictions that could painfully crimp industry and the shifter to greener ways of making things based on elec...",
    "link": "https://abcnews.go.com/International/wireStory/report-worlds-supply-critical-minerals-clean-energy-concentrated-122020069",
    "timestamp": "2025-05-21T09:45:19Z"
  },
  {
    "title": "The Biggest Sign That Trump May Already Be an Elected Autocrat",
    "description": "Donald Trump’s presidency has been colored in a dozen shades of censorship.",
    "link": "https://slate.com/news-and-politics/2025/05/trump-elected-autocrat-censorship-gaza-protesters.html",
    "timestamp": "2025-05-21T09:45:00Z"
  },
  {
    "title": "Donald Trump Jr hints he might run for president in future",
    "description": "US President Donald Trump's eldest son, Donald Trump Jr, said in Qatar on Wednesday that he could maybe run fo",
    "link": "https://www.jpost.com/breaking-news/article-854863",
    "timestamp": "2025-05-21T09:44:11Z"
  },
  {
    "title": "Embattled NY AG Letitia James touts Trump legal battles — while blasting DOJ probe into alleged real estate fraud",
    "description": "Embattled state Attorney General Letitia James touted her slew of lawsuits targeting the Trump administration to New York bigwigs Tuesday — as she blasted the brewing investigations into her real estate holdings as “nothing more than retribution.” “As of toda…",
    "link": "https://freerepublic.com/focus/f-chat/4318228/posts",
    "timestamp": "2025-05-21T09:42:31Z"
  },
  {
    "title": "Cartels Smuggling Stolen Oil Into Texas, DEA Says",
    "description": "The stolen oil is smuggled across the border into Texas, where it is sold on the black market, sometimes through a trade-based money laundering scheme.",
    "link": "https://www.newsweek.com/cartels-stolen-oil-texas-dea-2075086",
    "timestamp": "2025-05-21T09:42:09Z"
  },
  {
    "title": "Another Attempt at Banning Abortion Pills Is Coming Out of Texas. The Reasoning Is Truly Twisted.",
    "description": "The state has heard what the original ban cost its pregnant population and doubled down in a profoundly baffling way.",
    "link": "https://slate.com/news-and-politics/2025/05/new-texas-abortion-ban-pill-sb-2880.html",
    "timestamp": "2025-05-21T09:40:00Z"
  },
  {
    "title": "US stock futures dip, bond yields climb as Trump's tax bill standoff unfolds",
    "description": "The gate-keeping House Rules Committee has scheduled an unusual 1 a.m. ET hearing - that is expected to run well into daylight hours - where members will...",
    "link": "https://finance.yahoo.com/news/us-stock-futures-dip-bond-093814013.html",
    "timestamp": "2025-05-21T09:38:14Z"
  },
  {
    "title": "King Charles to warn ‘Canada is not for sale’ during Ottawa trip after Trump threats",
    "description": "Canadian high commissioner says Charles will ‘reinforce power and strength’ of his country’s sovereignty",
    "link": "https://www.the-independent.com/news/uk/home-news/king-charles-trump-canada-royal-family-b2755051.html",
    "timestamp": "2025-05-21T09:36:33Z"
  },
  {
    "title": "The Nuclear Bomb is Back!",
    "description": "Preface. If you are not worried about nuclear war anymore, you should be. We have accidentally come close so many times. You may not be nervous about Trump, but you should be. Here is some of what this book had … Continue reading →",
    "link": "https://energyskeptic.com/2025/the-nuclear-bomb-is-back/",
    "timestamp": "2025-05-21T09:36:19Z"
  },
  {
    "title": "Iran Seals Russia Defense Pact as US Nuclear Tensions Rise",
    "description": "Iran's ratification of a 20-year pact with Russia marks a major step in expanding military and economic ties amid tensions with the West",
    "link": "https://www.newsweek.com/iran-russia-defense-pact-us-nuclear-attack-threat-2075102",
    "timestamp": "2025-05-21T09:35:43Z"
  },
  {
    "title": "Trump chooses design for $175 billion ‘Golden Dome’ missile defense program",
    "description": "President Donald Trump has announced the concept he wants for his future Golden Dome missile defense program — a multilayered, $175 billion system that for the first time will put U.S. weapons in space.\nSpeaking Tuesday from the Oval Office, Trump said he exp…",
    "link": "https://biztoc.com/x/a0942a4facaa37be",
    "timestamp": "2025-05-21T09:34:18Z"
  },
  {
    "title": "Report: World’s supply of critical minerals for clean energy is concentrated in fewer countries",
    "description": "FRANKFURT, Germany (AP) — The world’s sources of critical minerals are increasingly concentrated in just a few countries, most notably China, leaving the global economy vulnerable to supply cutoffs that could disrupt economies and hit consumers with higher pr…",
    "link": "https://financialpost.com/pmn/report-worlds-supply-of-critical-minerals-for-clean-energy-is-concentrated-in-fewer-countries",
    "timestamp": "2025-05-21T09:32:31Z"
  },
  {
    "title": "The 10 richest Americans got $365 billion richer in the past year. Now they’re on the verge of a huge tax cut",
    "description": "Despite a brief market scare, the richest 10 Americans got $365 billion richer over the past year, according to a new analysis from Oxfam.",
    "link": "https://www.cnn.com/2025/05/21/business/billionaire-tax-cut-trump",
    "timestamp": "2025-05-21T09:30:52Z"
  },
  {
    "title": "The Case Against Leaving Trump’s America",
    "description": "The star academics who are doing it are making a performative gesture more than a substantive statement.",
    "link": "http://nymag.com/intelligencer/article/the-case-against-leaving-trumps-america.html",
    "timestamp": "2025-05-21T09:30:28Z"
  },
  {
    "title": "4 factors that help explain why Walmart and Home Depot are sending opposite signals on price hikes",
    "description": "Walmart opened the door for retailers to hike prices over tariffs, but Home Depot doesn't plan to. Digging into each business helps explain why.",
    "link": "https://www.businessinsider.com/why-walmart-raising-prices-home-depot-not-2025-5",
    "timestamp": "2025-05-21T09:30:02Z"
  },
  {
    "title": "Cuba Finally Embraces Solar",
    "description": "Marc Frank\n\n\n\nChina to the rescue—as the US imposes more sanctions.\r\n\n\r\n\n\nThe post Cuba Finally Embraces Solar appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/cuba-sanctions-china-solar-power-energy/",
    "timestamp": "2025-05-21T09:30:00Z"
  },
  {
    "title": "Report: Criminal Probe Begins into NYC Mayoral Candidate Andrew Cuomo",
    "description": "Disgraced former New York Gov. Andrew Cuomo's (D) comeback bid for New York City Mayor faces scrutiny after Republicans accused him of lying to Congress about his actions as governor during the coronavirus pandemic.\nThe post Report: Criminal Probe Begins into…",
    "link": "https://www.breitbart.com/politics/2025/05/21/report-criminal-probe-begins-into-nyc-mayoral-candidate-andrew-cuomo/",
    "timestamp": "2025-05-21T09:29:50Z"
  },
  {
    "title": "Elon Musk, once Trump's 'first buddy', is done with political donations after THIS major setback",
    "description": "Elon Musk said he plans to cut back on political spending, saying he has “done enough\". The comments come just a few weeks after he said he would step back from leading the controversial White House effort to slash federal spending, commonly called Doge. Elon…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-once-trumps-first-buddy-is-done-with-political-donations-after-this-major-setback-wisconsin-supreme-court-loss-doge/articleshow/121313227.cms",
    "timestamp": "2025-05-21T09:29:45Z"
  },
  {
    "title": "Canada in Talks With US to Join Golden Dome Missile Defense System",
    "description": "Trump earlier said that his administration is launching the historic \"Golden Dome\" missile defense shield program, aimed at delivering the highest level of protection for US airspace.",
    "link": "https://sputnikglobe.com/20250521/canada-in-talks-with-us-to-join-golden-dome-missile-defense-system-1122100549.html",
    "timestamp": "2025-05-21T09:26:17Z"
  },
  {
    "title": "Russia’s Putin visits Kursk as Ukraine says six killed in missile strike",
    "description": "Putin's visit is the first to the region since Russia claimed its forces had ejected Ukrainian troops in late April.",
    "link": "https://www.aljazeera.com/news/2025/5/21/russias-putin-visits-kursk-as-ukraine-says-six-killed-in-missile-strike",
    "timestamp": "2025-05-21T09:23:13Z"
  },
  {
    "title": "Under attack by Trump, South Africa's Ramaphosa responds with trade deal offer",
    "description": "Rhamposa heads to US on a delicate mission to persuade US President Donald Trump to make deals with his country rather than scold and punish it.",
    "link": "https://www.jpost.com/international/article-854859",
    "timestamp": "2025-05-21T09:22:27Z"
  },
  {
    "title": "Telangana CM Revanth Reddy slams Modi govt over US President Donald Trump’s ceasefire remark",
    "description": "Telangana CM Revanth Reddy criticized the Modi government for allegedly succumbing to US pressure and halting anti-terror operations against Pakistan after the Pahalgam attack. He contrasted this with Indira Gandhi's strong stance in 1971, while claiming Trum…",
    "link": "https://timesofindia.indiatimes.com/city/hyderabad/telangana-cm-revanth-reddy-slams-modi-govt-over-us-president-donald-trumps-ceasefire-remark/articleshow/121311200.cms",
    "timestamp": "2025-05-21T09:18:04Z"
  },
  {
    "title": "US Homebuyers Fear a Recession: Poll",
    "description": "Almost two-thirds of prospective homebuyers think the U.S. will see a recession within a year, but many hope it will lower prices.",
    "link": "https://www.newsweek.com/us-homebuyers-fear-recession-poll-2075061",
    "timestamp": "2025-05-21T09:15:25Z"
  },
  {
    "title": "Donald Trump Jr. Hints at Taking Over From Father in Politics",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump Jr. said he is open to a future for himself in American politics, perhaps even replacing his father in the White House as the standard bearer of the MAGA movement, describing it as a \"calling\".\nAt…",
    "link": "https://biztoc.com/x/48fdf059cfdd47cb",
    "timestamp": "2025-05-21T09:12:48Z"
  },
  {
    "title": "Trump to host South Africa's president amid tensions over US resettlement of white Afrikaners",
    "description": "Trump to host South Africa's president amid tensions over US resettlement of white Afrikanersgo.com",
    "link": "https://abcnews.go.com/Politics/trump-host-south-africas-president-amid-tensions-us/story?id=122002870",
    "timestamp": "2025-05-21T09:12:45Z"
  },
  {
    "title": "Big Beautiful Bill Will 'Explode The Deficit,' And Make The Rich Richer: Congressional Budget Office Estimates 4% Income Fall For Lowest Decile Of Americans By 2033",
    "description": "After the Congressional Budget Office (CBO) released its estimates for the distributional effects of the One Big Beautiful Bill Act, this economist questioned the Donald Trump administration about the inflating deficit and its inclination toward catering to t…",
    "link": "https://biztoc.com/x/c0f8eabf5d726216",
    "timestamp": "2025-05-21T09:12:37Z"
  },
  {
    "title": "Trump Eyes Retirement Overhaul That Could Push Billions From 401(k)s Into High-Stakes Private Equity Funds: Report",
    "description": "President Donald Trump is currently considering a new executive order that would push U.S. agencies to let private equity firms tap into the country's huge 401(k) savings pool, which is worth almost $9 trillion.\nWhat Happened: Trump's team is drafting an orde…",
    "link": "https://biztoc.com/x/73d772ba954bf914",
    "timestamp": "2025-05-21T09:12:33Z"
  },
  {
    "title": "Trump's impact on European politics: Rise of the right and liberals pushing back",
    "description": "If this past weekend in European politics is an indicator of anything, it's that the \"Trump effect\" is real, and its reverberations are unpredictable.",
    "link": "https://abcnews.go.com/US/trumps-impact-european-politics-rise-liberals-pushing-back/story?id=122013814",
    "timestamp": "2025-05-21T09:08:44Z"
  },
  {
    "title": "Trump Loses It On Reporter For Asking A Perfectly Normal Question",
    "description": "The president told a reporter to \"get yourself a real job.\"",
    "link": "https://www.huffpost.com/entry/trump-notus-get-a-real-job_n_682d8bd0e4b09b7e50134eaf",
    "timestamp": "2025-05-21T09:08:18Z"
  },
  {
    "title": "Donald Trump Jr. Hints at Taking Over From Father in Politics",
    "description": "The U.S. president's eldest son is seen as a potential successor as the leader of the MAGA movement.",
    "link": "https://www.newsweek.com/donald-trump-jr-hints-taking-over-father-politics-2075103",
    "timestamp": "2025-05-21T09:06:02Z"
  },
  {
    "title": "Elon Musk says he'll pour less money into elections. That's bad news for the GOP.",
    "description": "Lawmakers on both sides of the aisle said that Musk's move is likely a response to the intense blowback that he's endured over DOGE.",
    "link": "https://www.businessinsider.com/elon-musk-spending-less-politics-impact-republicans-2025-5",
    "timestamp": "2025-05-21T09:03:01Z"
  },
  {
    "title": "Can Trump's Tariffs Help Create a 'Golden Age' of US Manufacturing?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has said he wants to return the United States to a \"golden age\" of manufacturing and is trying to force the issue for many industries by slapping high tariffs on foreign products.\nHoweve…",
    "link": "https://biztoc.com/x/2714812f3ce3cd2f",
    "timestamp": "2025-05-21T09:01:40Z"
  },
  {
    "title": "Trump Jr.: Trump policies don't hurt US economy",
    "description": "United States President Donald Trump's son and Trump Organization Executive Vice President Donald Trump Jr. assured on Wednesday that the new US administration policies, including trade, do not harm t...",
    "link": "https://biztoc.com/x/b47d8eb0531fe42d",
    "timestamp": "2025-05-21T09:01:38Z"
  },
  {
    "title": "Trump’s big crypto dinner this Thursday will host 220 guests, including a Chinese billionaire—while a U.S. Senator plans to join a protest outside",
    "description": "Trump’s big crypto dinner this Thursday will host 220 guests, including a Chinese billionaire—while a U.S. Senator plans to join a protest outside\nPresident Donald Trump is linked to a slew of crypto ventures, including a memecoin, NFT collection, and crypto …",
    "link": "https://biztoc.com/x/a1629af5408445e5",
    "timestamp": "2025-05-21T09:01:34Z"
  },
  {
    "title": "See inside Qatar's lavish Boeing 747 business jet that may become Trump's new Air Force One",
    "description": "A custom Boeing 747-8 for a Middle Eastern businessman shows what the potentially gifted Qatari jet and future Air Force One may look like.",
    "link": "https://www.businessinsider.com/qatar-boeing-747-plane-trump-air-force-one-photos-interior-2025-5",
    "timestamp": "2025-05-21T09:01:01Z"
  },
  {
    "title": "Democrats' major messaging crisis: The party of opposition without solutions",
    "description": "Democrats face internal conflicts and continue to struggle to present a cohesive strategy. They need to shift from negative tactics to proactive solutions on key issues.",
    "link": "https://www.foxnews.com/opinion/democrats-major-messaging-crisis-party-opposition-without-solutions",
    "timestamp": "2025-05-21T09:00:51Z"
  },
  {
    "title": "Cuts to Medicaid and food stamps: Here’s who could be impacted by the House GOP’s bill",
    "description": "House Republicans are pushing to slash at least $1 trillion from two of the nation’s bedrock safety net programs, Medicaid and food stamps, as part of their sweeping package aimed at enacting President Donald Trump’s agenda. If the legislation is approved, mi…",
    "link": "https://www.cnn.com/2025/05/21/politics/medicaid-food-stamps-gop-proposed-cuts",
    "timestamp": "2025-05-21T09:00:50Z"
  },
  {
    "title": "Highly Enriched Uranium Stand-Off May Scuttle New Iran Deal",
    "description": "The latest back-and-forth on a nuclear deal between the United States and Iran hinges on enrichment, and the question may put nails in the coffin of any new agreement. White House envoy Steve Witkoff said Sunday, after weeks of mixed messages, that no future …",
    "link": "https://freebeacon.com/national-security/highly-enriched-uranium-stand-off-may-scuttle-new-iran-deal/",
    "timestamp": "2025-05-21T09:00:43Z"
  },
  {
    "title": "'60 Minutes' producers rail against Trump's 'bulls---' lawsuit, dread prospects of Paramount making settlement",
    "description": "\"60 Minutes\" producers are sounding off against the idea that CBS parent company Paramount Global would settle President Trump's \"bulls---\" lawsuit over the Kamala Harris interview.",
    "link": "https://www.foxnews.com/media/60-minutes-producers-rail-against-trumps-bulls-lawsuit-dread-prospects-paramount-making-settlement",
    "timestamp": "2025-05-21T09:00:29Z"
  },
  {
    "title": "Vulnerable House Democrats Held Intimate Meetings With Biden in the White House. Most Had Nothing To Say About Biden’s Fitness To Serve—Even After His Disastrous Debate.",
    "description": "Several vulnerable House Democrats representing swing districts held intimate meetings with former president Joe Biden at the White House during the same timeframe his senior aides were hard at work concealing his rapidly deteriorating mental acuity from the …",
    "link": "https://freebeacon.com/democrats/vulnerable-house-democrats-held-intimate-meetings-with-biden-in-the-white-house-most-had-nothing-to-say-about-bidens-fitness-to-serve-even-after-his-disastrous-debate/",
    "timestamp": "2025-05-21T09:00:25Z"
  },
  {
    "title": "SENATOR TOMMY TUBERVILLE: Trump and coach Saban have the right game plan to save college sports",
    "description": "Sports fans understand the negative impact of NIL money on college sports. Senator Tuberville and President Trump are trying to preserve collegiate athletics.",
    "link": "https://www.foxnews.com/opinion/senator-tommy-tuberville-trump-coach-saban-have-right-game-plan-save-college-sports",
    "timestamp": "2025-05-21T09:00:16Z"
  },
  {
    "title": "Can Trump's Tariffs Help Create a 'Golden Age' of US Manufacturing?",
    "description": "Donald Trump has vowed to revive U.S. manufacturing, introducing tariffs to meet that goal. Newsweek speaks to experts about the likelihood of the sector returning to a golden age",
    "link": "https://www.newsweek.com/2025/05/30/trump-tariffs-us-manufacturing-2074265.html",
    "timestamp": "2025-05-21T09:00:02Z"
  },
  {
    "title": "The Ugly History of the Law Used to Target Mahmoud Khalil",
    "description": "Richard Kreitner\n\n\n\nFrom the moment the McCarran-Walter Act was passed in 1952, The Nation has sounded the alarm about the danger it posed to politically active immigrants. \r\n\n\r\n\n\nThe post The Ugly History of the Law Used to Target Mahmoud Khalil appeared fir…",
    "link": "https://www.thenation.com/article/society/before-mahmoud-khalil-mccarran-walter/",
    "timestamp": "2025-05-21T09:00:02Z"
  },
  {
    "title": "3 Things to Watch on Mental Health in Trump’s Early Budget Proposals",
    "description": "President Donald Trump’s budget office says he’ll continue to fund the new 988 suicide prevention hotline, but documents sent to Congress offer clues — amid some mixed messages — about the administration’s approach to two pressing public health issues: mental…",
    "link": "https://kffhealthnews.org/news/article/trump-budget-mental-health-suicide-overdose-988-hotline-rfk/",
    "timestamp": "2025-05-21T09:00:00Z"
  },
  {
    "title": "Matt Gaetz flirts with a run for Florida governor, adding a bit of chaos to the race",
    "description": "Former Rep. Matt Gaetz, a close ally Trump ally, is still considering a run for governor of Florida — a twist that complicates a Republican primary.",
    "link": "https://www.nbcnews.com/politics/2026-election/matt-gaetz-flirts-run-florida-governor-2026-rcna207282",
    "timestamp": "2025-05-21T09:00:00Z"
  },
  {
    "title": "The Supreme Court’s Immunity-to-Impunity Pipeline",
    "description": "Grievance dressed as law, history warped into license, today’s Court is not checking Trump’s authoritarianism—it’s codifying it.\nThe post The Supreme Court’s Immunity-to-Impunity Pipeline appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/21/the-supreme-courts-immunity-to-impunity-pipeline/",
    "timestamp": "2025-05-21T09:00:00Z"
  },
  {
    "title": "Republicans want tax cuts to save the economy from Trump's tariffs. Not so fast, experts say",
    "description": "House Republicans are rushing to get a sweeping domestic policy bill over the finish line within days, as uncertainty over President Donald Trump’son-and-off approach to tariffs continues to hang over the economy.Read more...",
    "link": "https://qz.com/gop-tax-cut-bill-trump-tariffs-economy-1851781627",
    "timestamp": "2025-05-21T09:00:00Z"
  },
  {
    "title": "8 countries where Trump has been making new business deals, from Pakistan to Vietnam",
    "description": "Businesses spearheaded by President Donald Trump have struck numerous deals since Trump returned to the White Housein January.Read more...",
    "link": "https://qz.com/trump-organization-deals-countries-real-estate-crypto-1851781604",
    "timestamp": "2025-05-21T09:00:00Z"
  },
  {
    "title": "US confirms South Africa G20 boycott",
    "description": "Secretary of State Marco Rubio has accused Pretoria of going against Washington on “issue after issue after issue” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617950-rubio-g20-south-africa/",
    "timestamp": "2025-05-21T08:57:20Z"
  },
  {
    "title": "Corey O'Connor Ousts Incumbent Pittsburgh Mayor Ed Gainey In Democratic Primary",
    "description": "O’Connor is all but assured of winning November’s general election in a city that hasn’t elected a GOP mayor in nearly a century.",
    "link": "https://www.huffpost.com/entry/pittburgh-mayor-democratic-primary-results_n_682d9240e4b0c95f7335ee78",
    "timestamp": "2025-05-21T08:54:55Z"
  },
  {
    "title": "Donald Trump announces $175 billion golden dome and people think they know his next move",
    "description": "The US President has announced a new missile defence system for the nation",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-golden-dome-missile-defence-175-billion-815693-20250521",
    "timestamp": "2025-05-21T08:53:29Z"
  },
  {
    "title": "Ukraine pitches tougher Russia sanctions plan to EU as US wavers",
    "description": "KYIV: Ukraine will ask the EU next week to consider big new steps to isolate Moscow, including seizing Russian assets and bringing in sanctions for some buyers of Russian oil, as US President Donald Trump has backed off from tightening sanctions. A previously…",
    "link": "https://www.channelnewsasia.com/world/ukraine-pitches-tougher-russia-sanctions-plan-eu-us-wavers-5144056",
    "timestamp": "2025-05-21T08:49:13Z"
  },
  {
    "title": "A critical flaw in OpenPGP.js lets attackers spoof message signatures",
    "description": "A critical flaw in OpenPGP.js, tracked as CVE-2025-47934, lets attackers spoof message signatures; updates have been released to address the flaw. A critical vulnerability, tracked as CVE-2025-47934, in OpenPGP.js allowed spoofing of message signature verific…",
    "link": "https://securityaffairs.com/178131/uncategorized/a-openpgp-js-flaw-lets-attackers-spoof-message-signatures.html",
    "timestamp": "2025-05-21T08:46:15Z"
  },
  {
    "title": "Who will benefit from melting glaciers?",
    "description": "In a remote corner of North America, salmon and mining companies are vying for new territory.",
    "link": "http://grist.org/indigenous/melting-glacier-alaska-canada-bc-mining-salmon-territory/",
    "timestamp": "2025-05-21T08:45:00Z"
  },
  {
    "title": "Trump's One big, Beautiful bill: When will no tax on tips, overtime, Social Security start?",
    "description": "Officially titled the \"One Big, Beautiful Bill Act,\" this megabill fulfills a laundry list of President Donald Trump's campaign promises from taxes to border security. The bill aims to make the 2017 tax cuts permanent and introduce new temporary tax breaks, s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-one-big-beautiful-bill-when-will-no-tax-on-tips-overtime-social-security-start/articleshow/121312217.cms",
    "timestamp": "2025-05-21T08:41:25Z"
  },
  {
    "title": "Taiwan marks highest-ever April exports, driven by rising global demand of AI",
    "description": "Taiwan's export orders surge in April fueled by global demand for AI, electronics, surpassing expectations, with U.S. as top customer.",
    "link": "https://www.thehindubusinessline.com/news/world/taiwan-marks-highest-ever-april-exports-driven-by-rising-global-demand-of-ai/article69600918.ece",
    "timestamp": "2025-05-21T08:41:00Z"
  },
  {
    "title": "US futures down amid earnings, budget talks",
    "description": "Wall Street futures traded lower on Wednesday as Republicans continued tense negotiations on the new budget. United States President Donald Trump claimed the party remains united and insisted there wi...",
    "link": "https://biztoc.com/x/6fa703683fbc4e1f",
    "timestamp": "2025-05-21T08:39:00Z"
  },
  {
    "title": "FBI folds the public corruption squad that aided Jack Smith's Trump investigations",
    "description": "The FBI’s Washington Field Office is folding its federal public corruption squad, the same unit that aided Jack Smith’s special counsel investigation into President Donald Trump, three people familiar with the matter tell NBC News. The field office has three …",
    "link": "https://freerepublic.com/focus/f-backroom/4318227/posts",
    "timestamp": "2025-05-21T08:37:49Z"
  },
  {
    "title": "Local communities vow to fight new Panama Canal reservoir",
    "description": "Panama’s new canal dam plan puts thousands of villagers at risk, prompting protests over mass displacement.",
    "link": "https://www.aljazeera.com/gallery/2025/5/21/local-communities-vow-to-fight-new-panama-canal-reservoir",
    "timestamp": "2025-05-21T08:34:49Z"
  },
  {
    "title": "Japan's Nikkei falls on profit-taking, yen; Mizuho climbs",
    "description": "Japan's Nikkei share average fell on Wednesday as traders locked in recent gains and appreciation in the yen sapped demand for exporters.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-on-profit-taking-yen-mizuho-climbs/articleshow/121312089.cms",
    "timestamp": "2025-05-21T08:33:42Z"
  },
  {
    "title": "The EU Needs a Navy. Can the UK Supply It? | Opinion",
    "description": "Two centuries ago, the Royal Navy utterly dominated the world's oceans. The UK was buoyed by the global empire that its ships were tasked with expanding and defending.",
    "link": "https://www.newsweek.com/eu-needs-navy-can-uk-supply-it-opinion-2073272",
    "timestamp": "2025-05-21T08:33:01Z"
  },
  {
    "title": "Six Ukrainian soldiers killed in Russian strike on training exercise",
    "description": "Ukraine's National Guard said the attack took place while the men were carrying out exercises at a firing range.",
    "link": "https://www.bbc.com/news/articles/cvg770d0gpko",
    "timestamp": "2025-05-21T08:32:57Z"
  },
  {
    "title": "US Supreme Court clears way to end TPS for Venezuelans: What it means?",
    "description": "Court order paves the way for potential deportation of some 348,000 Venezuelans granted TPS status by Biden.",
    "link": "https://www.aljazeera.com/news/2025/5/21/us-supreme-court-clears-way-to-end-tps-for-venezuelans-what-it-means",
    "timestamp": "2025-05-21T08:30:10Z"
  },
  {
    "title": "The US government stole the Black Hills. Now it’s clear-cutting them.",
    "description": "The Trump administration wants to fast-track logging in the Black Hills. What could go wrong? A lot, say tribes, scientists, and conservationists.",
    "link": "http://grist.org/indigenous/the-u-s-government-stole-the-black-hills-now-its-clearcutting-them/",
    "timestamp": "2025-05-21T08:30:00Z"
  },
  {
    "title": "'As it currently stands, I was a no': Republicans divided over Trump's major tax bill",
    "description": "NPR's Steve Inskeep speaks with New York Rep. Mike Lawler about Republicans' divisions that threaten to derail the ongoing budget negotiations.",
    "link": "https://www.npr.org/2025/05/21/nx-s1-5404993/trump-tax-bill-budget-republicans",
    "timestamp": "2025-05-21T08:29:39Z"
  },
  {
    "title": "Tesla on Track to Launch Robotaxi Trial in Texas by June End",
    "description": "Tesla will begin a test of its long-promised robotaxi service on schedule in Austin, Texas, by the end of June. CEO Elon Musk has said he will reduce his work for the Trump administration and focus on his EV company.",
    "link": "https://www.gadgets360.com/auto/news/tesla-launch-robotaxi-trial-austin-texas-june-end-elon-musk-8469398",
    "timestamp": "2025-05-21T08:27:28Z"
  },
  {
    "title": "Israel Preparing Strike on Iran Amid US Tensions: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. intelligence has gathered new indications that Israel may be preparing to strike Iranian nuclear facilities, escalating tensions between Washington and Tehran as President Donald Trump warns that time is …",
    "link": "https://biztoc.com/x/e5ae491b35fe8505",
    "timestamp": "2025-05-21T08:16:36Z"
  },
  {
    "title": "What to Know About Trump’s ‘Golden Dome’ and Concerns About It",
    "description": "The President announced plans to develop a space-based missile-defense system—but concerns abound, including over costs.",
    "link": "https://time.com/7287304/golden-dome-trump-missile-defense-space-costs-concerns-elon-musk/",
    "timestamp": "2025-05-21T08:15:00Z"
  },
  {
    "title": "Marc Champion: Ukraine and Europe are now left all on their own after Trump’s call",
    "description": "It’s reasonable to be disappointed or worried - even disgusted - by the outcome of Donald Trump’s phone call with Vladimir Putin this week but not surprised. The US president didn’t fail to end this war, because he never tried. His focus was from day one to a…",
    "link": "https://www.independent.ie/opinion/comment/marc-champion-ukraine-and-europe-are-now-left-all-on-their-own-after-trumps-call/a822254913.html",
    "timestamp": "2025-05-21T08:14:05Z"
  },
  {
    "title": "Dollar eases as traders eye Trump tax bill, G7 currency talks",
    "description": "TOKYO/LONDON : The dollar fell on Wednesday, extending a two-day slide against a range of currencies, after U.S. President Donald Trump failed to convince Republican holdouts to back his sweeping tax bill.Traders were also wary of U.S. officials potentially a…",
    "link": "https://www.channelnewsasia.com/business/dollar-eases-traders-eye-trump-tax-bill-g7-currency-talks-5143396",
    "timestamp": "2025-05-21T08:13:34Z"
  },
  {
    "title": "Trump's 'Golden Dome' missile defense plan was inspired by Israel's multitiered defenses",
    "description": "U.S. President Donald Trump’s plan for a “Golden Dome” to protect the United States from long-range missiles was at least partly inspired by Israel’s multitiered missile defenses. Israel, with U.S. support, has over decades developed a sophisticated system, o…",
    "link": "https://apnews.com/article/trump-golden-dome-israel-missile-defense-iron-da9f728b6849ebba968b4b456adb26ce",
    "timestamp": "2025-05-21T08:12:57Z"
  },
  {
    "title": "Graduates boo Columbia university head over protester's detention",
    "description": "Students objecting to the detention of a pro-Palestinian protester by ICE chant “Free Mahmoud”.",
    "link": "https://www.bbc.com/news/videos/cn4ggvp4nyro",
    "timestamp": "2025-05-21T08:11:06Z"
  }
]