[
  {
    "title": "Ledisi performs 'Lift Every Voice and Sing' at the Super Bowl and the networks explode against the black national anthem",
    "description": "Controversy was not to be missed at Super Bowl LIX and before the Kansas City Chiefs and the Philadelphia Eagles took to the field at the Superdome in New Orleans, Ledisi performed",
    "link": "https://www.marca.com/en/nfl/super-bowl/2025/02/10/67a95cf222601dce458b4598.html",
    "timestamp": "2025-02-10T02:05:11Z"
  },
  {
    "title": "Donald Trump makes history at Super Bowl - as Taylor Swift booed",
    "description": "Celebrities including Taylor Swift, Jay-Z, Sir Paul McCartney and Bradley Cooper were out in force for arguably America's biggest sporting event of the year - the Super Bowl - as the Philadelphia Eagles beat the Kansas City Chiefs 40-22.",
    "link": "https://news.sky.com/story/super-bowl-2025-donald-trump-makes-history-as-taylor-swift-booed-13306451",
    "timestamp": "2025-02-10T02:05:00Z"
  },
  {
    "title": "Vance and Musk question the authority of the courts as Trump's agenda faces legal pushback",
    "description": "Top Trump administration officials, including Vice President JD Vance and Elon Musk, are questioning the judiciary's authority as a check on executive power. This comes after a federal judge blocked Musk's team from accessing Treasury records, sparking contro…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/vance-and-musk-question-the-authority-of-the-courts-as-trumps-agenda-faces-legal-pushback/articleshow/118102091.cms",
    "timestamp": "2025-02-10T02:04:50Z"
  },
  {
    "title": "Senator says Trump’s EPA will cut $100M solar funding for Illinois",
    "description": "Illinois U.S. Sen. Dick Durbin, D-Springfield, said on social media that President Donald Trump’s administration cutting off funding to the Solar for All program would lock Illinois out of more than $100 million for solar energy projects. State Rep. Chris Mil…",
    "link": "https://freerepublic.com/focus/f-news/4296341/posts",
    "timestamp": "2025-02-10T02:03:13Z"
  },
  {
    "title": "Israel can help boost Saudi Vision 2030 program",
    "description": "A Saudi normalization deal with Israel could have profound implications for Saudi Vision 2030, positively affecting economic growth, regional stability, and technological advancements.",
    "link": "https://www.jpost.com/opinion/article-841365",
    "timestamp": "2025-02-10T02:02:44Z"
  },
  {
    "title": "High approval rating for Trump in first month, CBS poll shows",
    "description": "More than half of U.S. adults say they approve of the job President Donald Trump is doing in his first month in office, according to a CBS News/YouGov poll published Sunday. The poll, conducted Wednesday through Friday of last week, showed Trump had a 53% app…",
    "link": "https://www.bostonherald.com/2025/02/09/high-approval-rating-for-trump-in-first-month-cbs-poll-shows/",
    "timestamp": "2025-02-10T02:01:34Z"
  },
  {
    "title": "Fox Sports Debuts Score Bug For Super Bowl LIX & Divides Viewers",
    "description": "Fox Sports took a minimal approach with their on-air graphics for the Super Bowl LIX and has divided its viewers. The network debuted a new score bug for the championship game between the Kansas City Chiefs and the Philadelphia Eagles, and people have a lot t…",
    "link": "http://deadline.com/2025/02/fox-sports-debuts-score-bug-super-bowl-lix-1236283776/",
    "timestamp": "2025-02-10T02:01:19Z"
  },
  {
    "title": "Coast Guard Academy Rolls DEI Programs Back",
    "description": "The U.S. Coast Guard Academy's decision to dismantle its Office of Culture and Climate marks a significant shift in military policy, reflecting broader trends against diversity initiatives. This development raises critical questions about the future of DEI in…",
    "link": "https://www.thegatewaypundit.com/2025/02/coast-guard-academy-rolls-dei-programs-back/",
    "timestamp": "2025-02-10T02:00:49Z"
  },
  {
    "title": "Dollar gains on Trump tariff threats, euro near 2-year low",
    "description": "The dollar strengthened as President Trump announced plans for new 25% tariffs on steel and aluminum imports, affecting the euro, and the Australian and New Zealand dollars. The move has intensified fears of a global trade war. Market focus is now on U.S. inf…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-gains-on-trump-tariff-threats-euro-near-2-year-low/articleshow/118101999.cms",
    "timestamp": "2025-02-10T01:58:29Z"
  },
  {
    "title": "Who's Sitting with Donald Trump at Super Bowl 2025? Look Inside His Box & See Who Attended With Him",
    "description": "Donald Trump is making history as the first sitting U.S. president to ever attend the Super Bowl and he has several other politician in his suite. The President of the United States walked on the field before the 2025 Super Bowl to wave to the crowd and then …",
    "link": "https://www.justjared.com/2025/02/09/whos-sitting-with-donald-trump-at-super-bowl-2025-look-inside-his-box-see-who-attended-with-him/",
    "timestamp": "2025-02-10T01:58:08Z"
  },
  {
    "title": "Trump says he will announce raft of new trade tariffs",
    "description": "Trump says he will announce raft of new trade tariffs\nPresident Donald Trump has said he will announce a 25% import tax on all steel and aluminium entering the US, a move that will have the biggest impact in Canada.\nTrump also said that there would be an anno…",
    "link": "https://biztoc.com/x/f3ef8be446c3c3c9",
    "timestamp": "2025-02-10T01:57:47Z"
  },
  {
    "title": "Trump says Canada’s and Mexico’s responses to his tariff threats are ‘not good enough’",
    "description": "President Donald Trump said Canada’s and Mexico’s pledges to boost border security to stop illegal drugs were insufficient to keep his tariffs on hold.\nPresident Donald Trump said Sunday that Mexico’s and Canada’s actions to stave off his steep tariffs are no…",
    "link": "https://biztoc.com/x/8f0a6708ccbb1345",
    "timestamp": "2025-02-10T01:57:28Z"
  },
  {
    "title": "Oil ticks higher as investors weigh new US tariffs",
    "description": "Oil prices rose on Monday despite concerns over President Trump's threat of tariffs on steel and aluminium imports which could affect global growth. Brent crude increased to $75.06 a barrel, while West Texas Intermediate crude reached $71.38 a barrel. Trump's…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-ticks-higher-as-investors-weigh-new-us-tariffs/articleshow/118101966.cms",
    "timestamp": "2025-02-10T01:56:17Z"
  },
  {
    "title": "Trump says some white South Africans are oppressed and could be resettled in the US — they say no thanks",
    "description": "The plan was detailed in an executive order Trump signed Friday that stopped all aid and financial assistance to South Africa as punishment for what the Trump administration said were “rights violations” by the government against some of its white citizens.",
    "link": "https://nypost.com/2025/02/09/world-news/trump-says-some-white-south-africans-are-oppressed-and-could-be-resettled-in-the-us-they-say-no-thanks/",
    "timestamp": "2025-02-10T01:56:02Z"
  },
  {
    "title": "US army takes Ukraine drone warfare notes in Bavaria",
    "description": "Deep in a Bavarian forest, a black reconnaissance drone buzzes overhead, piloted by US soldiers hoping to put lessons learnt from the war in Ukraine into practice. Cheaper and more plentiful than in the past, drones are changing the face of modern warfare, pa…",
    "link": "https://www.digitaljournal.com/world/us-army-takes-ukraine-drone-warfare-notes-in-bavaria/article",
    "timestamp": "2025-02-10T01:53:23Z"
  },
  {
    "title": "Trump defends Elon Musk as 'terrific' during Super Bowl interview - NPR",
    "description": "Trump defends Elon Musk as 'terrific' during Super Bowl interviewNPR Trump says he expects Musk to find billions in Pentagon wasteReuters Trump says Musk will help uncover 'hundreds of billions' in U.S. govt fraudThe Hindu Who will be with Donald Trump at the…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176166985",
    "timestamp": "2025-02-10T01:52:51Z"
  },
  {
    "title": "India-US relationship status set for update with Modi visit",
    "description": "India News: PM Narendra Modi will visit the US on February 12-13 at the invitation of President Donald Trump.",
    "link": "https://timesofindia.indiatimes.com/india/india-us-relationship-status-set-for-update-with-modi-visit/articleshow/118101896.cms",
    "timestamp": "2025-02-10T01:52:48Z"
  },
  {
    "title": "Trump wants to end birthright citizenship. Where do other countries stand?",
    "description": "The US has historically given automatic citizenship to anyone born in the country, but this principle is not the norm globally.",
    "link": "https://www.bbc.com/news/articles/c983g6zpz28o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-10T01:51:16Z"
  },
  {
    "title": "Trump wants to end birthright citizenship. Where do other countries stand?",
    "description": "The US has historically given automatic citizenship to anyone born in the country, but this principle is not the norm globally.",
    "link": "https://www.bbc.com/news/articles/c983g6zpz28o",
    "timestamp": "2025-02-10T01:51:11Z"
  },
  {
    "title": "Dollar gains on Trump tariff threats, euro near 2-year low",
    "description": "The dollar firmed on Monday after U.S. President Donald Trump said he was set to impose new 25% tariffs on all steel and aluminium imports, putting pressure on the euro and the commodity-focused Australian and New Zealand dollars. Trump also said he will anno…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0bc40817-8a54-4f05-93da-04ed9ac08ba2",
    "timestamp": "2025-02-10T01:49:57Z"
  },
  {
    "title": "Australia says its steel, aluminium exports create American jobs",
    "description": "Australia's trade minister said its steel and aluminium exports to the U.S. create \"good paying American jobs\" and are key to shared defence interests, as Canberra presses Washington for an exemption to President Donald Trump's planned tariffs. Trump said on …",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e7fbe5ba-2e7e-453b-80d9-4de72cbdf10e",
    "timestamp": "2025-02-10T01:49:14Z"
  },
  {
    "title": "NYC advocates condemn Mayor Adams’ stance on sanctuary policies",
    "description": "Advocates rally on Sunday against President Trump's deportation agenda.\n \n\nOfficials accuse the mayor of supporting Trump's deportation agenda, while Adams asserts that ICE officers have a “responsibility to carry out their job.” [ more › ]",
    "link": "https://gothamist.com/news/nyc-advocates-condemn-mayor-adams-stance-on-sanctuary-policies",
    "timestamp": "2025-02-10T01:49:00Z"
  },
  {
    "title": "Donald Trump arrives at Superdome for historic Super Bowl visit",
    "description": "Donald Trump made history as the first sitting US President to attend the Super Bowl, appearing at the Superdome in New Orleans. He met with first responders and families of victims from a recent attack, and his presence was seen as a gesture to unify a divid…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-arrives-at-superdome-for-historic-super-bowl-visit/articleshow/118101882.cms",
    "timestamp": "2025-02-10T01:48:53Z"
  },
  {
    "title": "Trump says he is serious about Canada becoming 51st state in Super Bowl interview",
    "description": "President Donald Trump stated his desire for Canada to become the 51st state, citing a $200 billion annual trade deficit. Canadian PM Trudeau confirmed Trump's intent, linking it to access to natural resources. Trump also plans to impose tariffs on Canadian a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-is-serious-about-canada-becoming-51st-state-in-super-bowl-interview/articleshow/118101879.cms",
    "timestamp": "2025-02-10T01:48:44Z"
  },
  {
    "title": "PM Modi to meet Trump with planned tariff concessions",
    "description": "Indian Prime Minister Narendra Modi is preparing tariff cuts to boost American exports and avoid a trade war with the U.S. during his upcoming meeting with President Trump. Discussions will focus on sectors like electronics and medical equipment, with the aim…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/pm-modi-to-meet-trump-with-planned-tariff-concessions/articleshow/118101877.cms",
    "timestamp": "2025-02-10T01:48:40Z"
  },
  {
    "title": "India's Modi to meet Trump with planned tariff concessions",
    "description": "Indian Prime Minister Narendra Modi is preparing additional tariff cuts ahead of his meeting with U.S. President Donald Trump that could boost American exports to India and avoid a potential trade war, government officials said. Modi's trip to the U.S. on Wed…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_3d4ce6db-c41f-4d95-9990-ee5dc4cf1f42",
    "timestamp": "2025-02-10T01:48:22Z"
  },
  {
    "title": "Fox News Airs Four Promos During Super Bowl 59",
    "description": "Fox Sports aired four Fox News cross-channel promos during this year's Super Bowl 59. The first promo, which showcased the network's news side versus its opinion programming, aired before the nine-minute mark during the first quarter. With the tagline \"For Al…",
    "link": "https://www.adweek.com/tvnewser/fox-news-airs-four-promos-during-super-bowl-59/",
    "timestamp": "2025-02-10T01:47:11Z"
  },
  {
    "title": "Expert claims there is a one in three chance that Trump dies while in office because of his obesity and age",
    "description": "Scott Galloway, a clinical professor of marketing at the New York University Stern School of Business, recently issued a stark warning about the “real” ...",
    "link": "https://innersplendor.com/blogs/test--2/posts/7526421/expert-claims-there-is-a-one-in-three-chance-that-trump-dies-while-in-office-because-of-his-obesity-a",
    "timestamp": "2025-02-10T01:47:04Z"
  },
  {
    "title": "Steel, aluminum tariffs on the table",
    "description": "WASHINGTON — President Donald Trump said he will announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week.\n“Any steel coming into th…",
    "link": "https://biztoc.com/x/13f4545899b5331a",
    "timestamp": "2025-02-10T01:46:34Z"
  },
  {
    "title": "Kendrick Lamar Goes Full Carpe Diem In Super Bowl Halftime With A Fresh Swipe At Drake, Appearances By Samuel L. Jackson & SZA – Review",
    "description": "Three years ago at the Super Bowl in LA, Kendrick Lamar was the home turf newbie on the halftime show hip-hop dream team of Dr. Dre, Snoop Dogg, Mary J Blige, Eminem and 50 Cent. Today in New Orleans, the top of his game Compton-born Pulitzer Prizer winner di…",
    "link": "http://deadline.com/2025/02/kendrick-lamar-super-bowl-halftime-review-drake-nfl-1236282932/",
    "timestamp": "2025-02-10T01:46:00Z"
  },
  {
    "title": "Steel, aluminum tariffs on the table",
    "description": "President Donald Trump said he will announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week.",
    "link": "https://www.bostonherald.com/2025/02/09/steel-aluminum-tariffs-on-the-table/",
    "timestamp": "2025-02-10T01:45:59Z"
  },
  {
    "title": "Trump's Big Announcement On Tariffs To Hit Steel, Aluminum Imports",
    "description": "In yet another major escalation of his trade policy overhaul, US President Donald Trump announced that on Monday the United States will impose 25 per cent tariffs on all steel and aluminium imports, which would come on top of additional metal duties.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-latest-trade-escalation-us-to-announce-25-tariffs-on-aluminum-and-steel-7674486",
    "timestamp": "2025-02-10T01:45:28Z"
  },
  {
    "title": "WATCH: President Trump Greets KC Defensive Lineman Chris Jones on the Field at Super Bowl",
    "description": "Trump greeted Chris Jones, star defensive lineman for the Kansas City Chiefs, on the field ahead of kickoff on Super Bowl Sunday. \nThe post WATCH: President Trump Greets KC Defensive Lineman Chris Jones on the Field at Super Bowl appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/02/09/watch-president-trump-greets-kc-defensive-lineman-chris-jones-on-the-field-at-super-bowl/",
    "timestamp": "2025-02-10T01:43:53Z"
  },
  {
    "title": "A presidential first: Trump at the Super Bowl, latest chapter in a complicated legacy with football",
    "description": "NEW ORLEANS (AP) — As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a knee during the national anthem as…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_54d8ae17-48fd-4058-adb9-e97a5a5ad221",
    "timestamp": "2025-02-10T01:43:14Z"
  },
  {
    "title": "Oil ticks higher as investors weigh new US tariffs",
    "description": "Oil prices ticked higher on Monday even as investors weighed U.S. President Donald Trump's latest tariff threat, this time on all steel and aluminium imports, which could dampen global economic growth and energy demand. Brent crude futures climbed 40 cents, o…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2796f7db-16c4-468e-9144-8873fc995a8a",
    "timestamp": "2025-02-10T01:41:28Z"
  },
  {
    "title": "Trump says he will announce raft of new trade tariffs",
    "description": "All steel and aluminium entering the US will be targeted with a 25% levy, the president says.",
    "link": "https://www.bbc.com/news/articles/c98yv3e1yyqo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-10T01:40:45Z"
  },
  {
    "title": "Trump says US is making progress with Russia, declines to discuss talks with Putin",
    "description": "U.S. President Donald Trump claimed progress in talks with Russia to end the Ukraine war, hinting at communication with Russian President Vladimir Putin. Trump remains tight-lipped about the details but indicated future conversations. The Kremlin neither conf…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-us-is-making-progress-with-russia-declines-to-discuss-talks-with-putin/articleshow/118101788.cms",
    "timestamp": "2025-02-10T01:40:25Z"
  },
  {
    "title": "Bullish Signs for Silver in Challenging Market Conditions",
    "description": "Silver remains resilient despite US dollar strength and higher yields. With key producers China and Mexico facing trade tensions, silver's bullish potential is on the rise.",
    "link": "https://www.cityindex.com/en-uk/news-and-analysis/bullish-signs-for-silver-in-challenging-market-conditions/",
    "timestamp": "2025-02-10T01:40:00Z"
  },
  {
    "title": "Trump will formally announce steel and aluminum duties Monday, including on Canada",
    "description": "OTTAWA — U.S. President Donald Trump said he will formally announce 25 per cent tariffs on all steel and aluminum imports on Monday, including for Canada and Mexico.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0a5d6090-1fd9-43fd-9520-444e52c80be8",
    "timestamp": "2025-02-10T01:38:22Z"
  },
  {
    "title": "Trump repeats pledge to take control of Gaza even as pressure mounts to renew ceasefire",
    "description": "New details of emaciated hostages are increasing pressure on Israeli Prime Minister Netanyahu to extend the Gaza ceasefire, while U.S. President Trump reiterates his commitment to take control of Gaza. Talks on further phases for hostage release and Israeli w…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-repeats-pledge-to-take-control-of-gaza-even-as-pressure-mounts-to-renew-ceasefire/articleshow/118101752.cms",
    "timestamp": "2025-02-10T01:37:18Z"
  },
  {
    "title": "Asia shares slip, dollar firm as tariffs loom",
    "description": "Asian shares slipped and the dollar edged higher on Monday after U.S. President Donald Trump repeated warnings of imminent tariffs including on steel and aluminium, an inflationary move that could limit the scope for rate cuts.",
    "link": "https://biztoc.com/x/d004da89f8dc85c0",
    "timestamp": "2025-02-10T01:35:29Z"
  },
  {
    "title": "Shares of South Korean steelmakers drop as Trump talks tariffs",
    "description": "Shares of South Korean steelmakers dropped on Monday, after U.S. President Donald Trump said he would introduce new tariffs.",
    "link": "https://biztoc.com/x/a55a794e2ba4cac4",
    "timestamp": "2025-02-10T01:35:27Z"
  },
  {
    "title": "Trump is now flagging tariffs on steel and aluminium. Can Albanese win an exemption for Australia?",
    "description": "Trump says he will slap 25% tariffs on all foreign steel and aluminium imports to the US. The Albanese government says it’s been prepared for such a move.",
    "link": "https://theconversation.com/trump-is-now-flagging-tariffs-on-steel-and-aluminium-can-albanese-win-an-exemption-for-australia-249476",
    "timestamp": "2025-02-10T01:34:39Z"
  },
  {
    "title": "WATCH: Super Bowl crowd erupts when Trump appears on Jumbotron during National Anthem",
    "description": "Makes history as the first sitting president to attend NFL's big event",
    "link": "https://www.wnd.com/2025/02/watch-super-bowl-crowd-erupts-when-trump-appears-on-jumbotron-during-national-anthem/",
    "timestamp": "2025-02-10T01:34:02Z"
  },
  {
    "title": "Donald Trump to announce raft of new trade tariffs including on steel - BBC.com",
    "description": "Donald Trump to announce raft of new trade tariffs including on steelBBC.com Trump says he’ll announce yet another new tariff MondayCNN Australia's BlueScope Steel rises on hopes of Trump tariffs boosting its US opsReuters Trump’s Next Round of Tariffs—25% on…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176166935",
    "timestamp": "2025-02-10T01:33:00Z"
  },
  {
    "title": "Who is Kendrick Lamar? A gay guide to the 2025 Halftime Show headliner",
    "description": "Grammy Award-winning rapper Kendrick Lamar is headlining the 2025 Super Bowl Halftime Show this Sunday, Feb. 9, in New Orleans, Louisiana. Even though pop girlies won't be headlining this year's Halftime Show, there are plenty of reasons why some people in th…",
    "link": "https://www.out.com/media/kendrick-lamar-halftime-show-lgbtq-connections-collabs-feuds",
    "timestamp": "2025-02-10T01:31:46Z"
  },
  {
    "title": "Trump Unveils Plans for 25% Tariffs on Steel, Aluminum Imports",
    "description": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergNice Airport, If You Can Get to It: No...",
    "link": "https://finance.yahoo.com/news/trump-plans-unveil-25-steel-215940934.html",
    "timestamp": "2025-02-10T01:30:03Z"
  },
  {
    "title": "Trump says he will announce 25% steel and aluminum tariffs Monday, and more import duties are coming (Associated Press)",
    "description": "Associated Press:\nTrump says he will announce 25% steel and aluminum tariffs Monday, and more import duties are coming  —  President Donald Trump said he will announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports,…",
    "link": "https://www.memeorandum.com/250209/p64",
    "timestamp": "2025-02-10T01:30:00Z"
  },
  {
    "title": "Trump says he will announce 25% steel and aluminum tariffs Monday, and more import duties are coming",
    "description": "President Donald Trump says he'll announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week.",
    "link": "https://www.ksat.com/business/2025/02/09/trump-says-he-will-announce-25-steel-and-aluminum-tariffs-monday-and-more-import-duties-are-coming/",
    "timestamp": "2025-02-10T01:28:12Z"
  },
  {
    "title": "'Crippling crises': Evangelical leaders turn on Trump over 'damaging and wasteful' order",
    "description": "Some evangelicals on Sunday slammed President Donald Trump’s abrupt decision to dismantle the US Agency for International Development (USAID), with one leader calling the move “damaging and wasteful.”As Business Insider reports, “at a press panel following” t…",
    "link": "https://www.rawstory.com/evangelicals-turn-on-trump-aid/",
    "timestamp": "2025-02-10T01:22:55Z"
  },
  {
    "title": "Donald Trump Gets Loud Cheers At Super Bowl, Hangs Out With Patrick Mahomes’ Family",
    "description": "President Donald Trump got a much better reception than Taylor Swift at the SUper Bowl. On Sunday both Trump and Swift were shown on the jumbotron at the Caesars Superdome but only one of them got cheers. When Swift was shown she got loudly booed by the fans …",
    "link": "https://brobible.com/sports/article/donald-trump-super-bowl-patrick-mahomes/",
    "timestamp": "2025-02-10T01:18:38Z"
  },
  {
    "title": "Top Trump officials head to Europe for security talks",
    "description": "A trio of top Trump administration officials will make separate trips to Europe this week, with security and Washington’s commitment to Ukraine expected to be at the heart of their discussions. President Donald Trump — pushing his “America First” agenda — has…",
    "link": "https://www.digitaljournal.com/world/top-trump-officials-head-to-europe-for-security-talks/article",
    "timestamp": "2025-02-10T01:18:15Z"
  },
  {
    "title": "Top Trump Officials Head To Europe For Security Talks",
    "description": "A trio of top Trump administration officials will make separate trips to Europe this week, with security and Washington's commitment to Ukraine expected to be at the heart of their discussions.",
    "link": "https://www.ibtimes.com/top-trump-officials-head-europe-security-talks-3763073",
    "timestamp": "2025-02-10T01:18:06Z"
  },
  {
    "title": "Taylor Swift’s Reaction To Booing At Super Bowl LIX Goes Viral",
    "description": "Taylor Swift went viral on social media for her reaction to the booing at the Super Bowl LIX. A video on social media platforms is being shared, and comments regarding how Swift reacted are being made. As Swift appeared on the big screen inside the Caesars Su…",
    "link": "http://deadline.com/2025/02/taylor-swifts-reaction-booing-super-bowl-lix-viral-1236283757/",
    "timestamp": "2025-02-10T01:17:55Z"
  },
  {
    "title": "Snoop Dogg and Tom Brady stand up to hate in Super Bowl 2025 ad",
    "description": "Snoop Dogg and Tom Brady have an anti-hate face-off in a new 2025 Super Bowl commercial: 'I hate you because I think you hate me.'",
    "link": "https://ew.com/snoop-dogg-tom-brady-stand-up-to-hate-super-bowl-2025-commercial-8788690",
    "timestamp": "2025-02-10T01:16:20Z"
  },
  {
    "title": "Commentary: Why does U.S. proposal to take over Gaza spark int'l outcry?",
    "description": "BEIJING, Feb. 9 (Xinhua) -- The Gaza Strip, home to more than two million Palestinians, has endured",
    "link": "http://en.people.cn/n3/2025/0210/c90000-20274667.html",
    "timestamp": "2025-02-10T01:14:06Z"
  },
  {
    "title": "Trump to announce 25% steel and aluminum tariffs in latest trade escalation - Reuters",
    "description": "Trump to announce 25% steel and aluminum tariffs in latest trade escalationReuters Trump says he’ll announce yet another new tariff MondayCNN Trump’s Next Round of Tariffs—25% on Steel and Aluminum—Won’t Be So Easily AvertedThe Wall Street Journal Trump Admin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176166869",
    "timestamp": "2025-02-10T01:13:44Z"
  },
  {
    "title": "Taylor Swift Reacts To Boos After She’s Shown on Jumbotron At Super Bowl LIX",
    "description": "Singer Taylor Swift appeared surprised when fans at Super Bowl LIX started booing after she was shown on the jumbotron to the crowd.\nThe post Taylor Swift Reacts To Boos After She’s Shown on Jumbotron At Super Bowl LIX first appeared on Mediaite.",
    "link": "https://www.mediaite.com/sports/taylor-swift-reacts-to-boos-after-shes-shown-on-jumbotron-at-super-bowl-lix/",
    "timestamp": "2025-02-10T01:13:32Z"
  },
  {
    "title": "Trump says will impose 25% tariffs on US steel, aluminum imports",
    "description": "The United States will move to impose 25-percent tariffs on steel and aluminum imports this week, President Donald Trump said Sunday, the latest in a slew of trade levies he has announced. Trump told reporters aboard Air Force One that the tariffs, which he w…",
    "link": "https://www.digitaljournal.com/world/trump-says-will-impose-25-tariffs-on-us-steel-aluminum-imports/article",
    "timestamp": "2025-02-10T01:12:21Z"
  },
  {
    "title": "Trump Says Will Impose 25% Tariffs On US Steel, Aluminum Imports",
    "description": "The United States will move to impose 25-percent tariffs on steel and aluminum imports this week, President Donald Trump said Sunday, the latest in a slew of trade levies he has announced.",
    "link": "https://www.ibtimes.com/trump-says-will-impose-25-tariffs-us-steel-aluminum-imports-3763070",
    "timestamp": "2025-02-10T01:12:20Z"
  },
  {
    "title": "Taylor Swift arrives at the Super Bowl 2025 suite with Ice Spice and the Haim sisters",
    "description": "Taylor Swift is in the building, people! The superstar and partner of Kansas City Chiefs player Travis Kelce has arrived at the Super Bowl 2025 alongside her friends Ice Spice and the Haim Sisters. Swift arrived at her suite at the Caesars Superdome in New Or…",
    "link": "https://www.thepinknews.com/2025/02/10/taylor-swift-super-bowl-2025/",
    "timestamp": "2025-02-10T01:12:02Z"
  },
  {
    "title": "Trump Makes History at the Super Bowl",
    "description": "As a student, Donald Trump played high school football. As a business baron, he owned a team in an upstart rival to the NFL and then sued the established league. As president, he denigrated pros who took a knee during the national anthem as part of a social j…",
    "link": "https://www.newser.com/story/363993/trump-makes-history-at-the-super-bowl.html",
    "timestamp": "2025-02-10T01:11:04Z"
  },
  {
    "title": "Stock Market Highlights 10 February 2025: Sensex settles at 77,311.80; Nifty drops 178.35 points to 23,381.60",
    "description": "Sensex, Nifty, Share Prices Highlights: Stock markets closed with losses for the fourth consecutive day on Monday with the benchmark Sensex declining by 548 points as fresh US tariff threats shook investor confidence and triggered selling in bluechip banking,…",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-10-febuary-2025/article69199046.ece",
    "timestamp": "2025-02-10T01:09:23Z"
  },
  {
    "title": "Japanese investors weigh warm vibes, uncertainty in U.S. relations",
    "description": "The U.S. president's talk of reciprocal tariffs for \"everyone” has provided a reminder of the risks that face America’s trading partners.",
    "link": "https://www.japantimes.co.jp/business/2025/02/10/markets/japanese-investors-reax-trump/",
    "timestamp": "2025-02-10T01:09:00Z"
  },
  {
    "title": "Venezuelan detainees in US file motion over possible Guantanamo transfer",
    "description": "(Reuters) - Three Venezuelan men detained in New Mexico on Sunday asked a federal judge to preemptively block the U.S. government from sending them to a military base in Guantanamo Bay, Cuba, according to a court filing. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/10/venezuelan-detainees-in-us-file-motion-over-possible-guantanamo-transfer",
    "timestamp": "2025-02-10T01:09:00Z"
  },
  {
    "title": "Taylor Swift Visibly Confused By Chorus of Boos at Super Bowl",
    "description": "Taylor Swift was taken aback ... as she was hit with a massive chorus of boos when the Jumbotron zoomed in on her at the Super Bowl.",
    "link": "https://www.tmz.com/2025/02/09/taylor-swift-boo-super-bowl-travis-kelce/",
    "timestamp": "2025-02-10T01:06:14Z"
  },
  {
    "title": "Trump tariffs: US trade war intensifying and Australia may not be immune",
    "description": "Donald Trump is backing up his belief that tariff “is the most beautiful word in the dictionary”.",
    "link": "https://www.smh.com.au/business/the-economy/trump-is-intensifying-his-trade-war-australia-may-not-be-immune-20250210-p5lasf.html",
    "timestamp": "2025-02-10T01:05:02Z"
  },
  {
    "title": "Nippon Steel declines to comment on Trump statement opposing majority stake in U.S. Steel",
    "description": "Japan's Nippon Steel on Monday declined to comment on U.S. President Donald Trump's statement that no one can have a majority stake in U.S. Steel.\nTrump made the statement on Sunday when speaking to reporters on Air Force One.\nOn Friday, Trump said Nippon Ste…",
    "link": "https://biztoc.com/x/90cbad68477398f8",
    "timestamp": "2025-02-10T01:02:12Z"
  },
  {
    "title": "Christian McCaffrey supports wife Olivia Culpo at Super Bowl 2025 after 49ers’ heartache",
    "description": "The star NFL running back posted his admiration to his Instagram story.",
    "link": "https://nypost.com/2025/02/09/sports/christian-mccaffrey-supports-wife-olivia-culpo-at-super-bowl-2025-after-49ers-heartache/",
    "timestamp": "2025-02-10T01:02:01Z"
  },
  {
    "title": "India roundup: India cuts tariffs amid Trump's tariff policy",
    "description": "As US President Donald Trump threatens to impose tariffs on trading partners, India has lowered its basic customs duties in its latest annual budget and is reportedly reducing the agriculture infrastructure and development cess.",
    "link": "https://www.digitimes.com/news/a20250207VL206/donald-trump-budget-electronics-infrastructure-data-center.html",
    "timestamp": "2025-02-10T01:01:57Z"
  },
  {
    "title": "Creatives React: FCAS Super Bowl Ad Casting Distracts From the Point",
    "description": "Robert Kraft's Foundation to Combat Antisemitism (FCAS) returned to the Super Bowl this year to continue spreading its message of ending hate. Two 15-second spots feature close-up shots of Snoop Dogg and Tom Brady in a stark room, where they yell at each othe…",
    "link": "https://www.adweek.com/brand-marketing/creatives-react-fcas-super-bowl-ad-casting-distracts-from-the-point/",
    "timestamp": "2025-02-10T01:00:37Z"
  },
  {
    "title": "Scholz criticizes Trump's Gaza plan as \"scandal\" in TV debate",
    "description": "BERLIN, Feb. 9 (Xinhua) -- German Chancellor Olaf Scholz on Sunday evening criticized U.S. President",
    "link": "http://en.people.cn/n3/2025/0210/c90000-20274632.html",
    "timestamp": "2025-02-10T00:58:29Z"
  },
  {
    "title": "Even before the war: 44% of young Gazans considered emigrating",
    "description": "Gazans who choose to leave must be guaranteed secrecy and protection during the process.",
    "link": "https://www.jpost.com/opinion/article-841362",
    "timestamp": "2025-02-10T00:58:00Z"
  },
  {
    "title": "Taiwan's legacy chip industry contemplates future as China eats into share​",
    "description": "Taiwan's Powerchip Technology faces intense competition from Chinese foundries such as Nexchip in the legacy chip market, driven by Beijing's push for local production and aggressive price cuts. U.S.-China trade tensions and shifting global supply chains may …",
    "link": "https://economictimes.indiatimes.com/news/international/business/taiwans-legacy-chip-industry-contemplates-future-as-china-eats-into-share/articleshow/118101303.cms",
    "timestamp": "2025-02-10T00:55:43Z"
  },
  {
    "title": "Asian shares slip, dollar firm as tariffs loom",
    "description": "Speaking to reporters on Air Force One, Trump said he would announce on Monday 25% tariffs on all steel and aluminium imports into the U.S., and reveal other reciprocal tariffs on Tuesday or Wednesday.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asia-shares-slip-dollar-firm-as-tariffs-loom/articleshow/118101294.cms",
    "timestamp": "2025-02-10T00:54:09Z"
  },
  {
    "title": "Key Trump ally to decide on possible run against leading Republican in 'next couple of months'",
    "description": "With the new administration in place, the 2026 primaries have officially begun. Texas Attorney General Ken Paxton has said he is considering a run to replace moderate Republican John Cornyn in the U.S. Senate.Speaking to Republican Party members in Denton Cou…",
    "link": "https://freerepublic.com/focus/f-news/4296332/posts",
    "timestamp": "2025-02-10T00:53:41Z"
  },
  {
    "title": "David Axelrod Calls Biden Skipping Final Super Bowl Interview ‘Bewildering’ – ‘Trump Is All Over It’",
    "description": "Veteran Democratic strategist David Axelrod criticized former President Joe Biden for missing out on an opportunity to reach millions of people when he skipped last year’s traditional pre-Super Bowl presidential interview. By contrast, Axelrod said on Sunday,…",
    "link": "https://www.mediaite.com/politics/david-axelrod-calls-biden-skipping-final-super-bowl-interview-bewildering-trump-is-all-over-it/",
    "timestamp": "2025-02-10T00:51:34Z"
  },
  {
    "title": "Trump, Musk, & The Deep State: The Battle Over Transparency Begins",
    "description": "Trump, Musk, & The Deep State: The Battle Over Transparency Begins\n \nAuthored by Roger Kimball via American Greatness,\nHere we go again. At the beginning of his first term as president, Donald Trump issued an executive order temporarily banning travel from se…",
    "link": "https://biztoc.com/x/0ab1a973e03ca301",
    "timestamp": "2025-02-10T00:51:11Z"
  },
  {
    "title": "Donald Trump says he will announce tariffs on steel and aluminium",
    "description": "Imports of the metals will be hit with a 25% levy, a move that will have the biggest impact in Canada.",
    "link": "https://www.bbc.co.uk/news/articles/c98yv3e1yyqo",
    "timestamp": "2025-02-10T00:50:59Z"
  },
  {
    "title": "Trump says he will announce raft of new trade tariffs",
    "description": "All steel and aluminium entering the US will be targeted with a 25% levy, the president says.",
    "link": "https://www.bbc.com/news/articles/c98yv3e1yyqo",
    "timestamp": "2025-02-10T00:50:59Z"
  },
  {
    "title": "Trump says US may have less debt than thought because of fraud",
    "description": "By Jeff Mason and Andy Sullivan\n(Reuters) -U.S. President Donald Trump on Sunday said his administration was examining U.S. Treasury debt payments for possible fraud and suggested that the country's $36 trillion debt load might not be that high.\nSpeaking to r…",
    "link": "https://biztoc.com/x/5d5f99cac13d4cab",
    "timestamp": "2025-02-10T00:50:46Z"
  },
  {
    "title": "CBS Poll: Most Americans Approve of Trump",
    "description": "State of the Union: Seventy percent of U.S. adults said the president is doing what he promised in the campaign.\nThe post CBS Poll: Most Americans Approve of Trump appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/cbs-poll-most-americans-approve-of-trump/",
    "timestamp": "2025-02-10T00:49:35Z"
  },
  {
    "title": "Super Bowl’s New Scorebug Savagely Torched By Perplexed Fans: ‘What 6 Year Old Did Fox Hire?’",
    "description": "Fans were unimpressed with an updated scorebug graphic deployed by Fox to keep track of the score and quarter time for the teams during the Super Bowl.\nThe post Super Bowl’s New Scorebug Savagely Torched By Perplexed Fans: ‘What 6 Year Old Did Fox Hire?’ firs…",
    "link": "https://www.mediaite.com/sports/super-bowls-new-scorebug-savagely-torched-by-perplexed-fans-what-6-year-old-did-fox-hire/",
    "timestamp": "2025-02-10T00:49:29Z"
  },
  {
    "title": "CNBC Daily Open: Markets aren’t as enthusiastic over Trump and AI as they used to be",
    "description": "While AI and Trump are still the main characters of the stock market, they are steering markets in direction different from December.",
    "link": "https://www.cnbc.com/2025/02/10/cnbc-daily-open-markets-arent-as-keen-on-trump-and-ai-as-before.html",
    "timestamp": "2025-02-10T00:48:53Z"
  },
  {
    "title": "Progressives demanding NYC fight ICE are at war with reality",
    "description": "City progressives are apoplectic that Mayor Eric Adams refuses to go to war with the feds in defense of violent illegal-migrant criminals.",
    "link": "https://nypost.com/2025/02/09/opinion/progressives-demanding-nyc-fight-ice-are-at-war-with-reality/",
    "timestamp": "2025-02-10T00:46:45Z"
  },
  {
    "title": "Fans 'work out' three-word comment Taylor Swift made as she was filmed being booed at Super Bowl",
    "description": "Taylor Swift was booed at the Super Bowl",
    "link": "https://www.ladbible.com/news/sport/taylor-swift-super-bowl-boo-travis-kelce-061211-20250210",
    "timestamp": "2025-02-10T00:44:55Z"
  },
  {
    "title": "Trump to announce 25% steel and aluminum tariffs in latest trade escalation",
    "description": "President Donald Trump announced plans to impose new 25% tariffs on all steel and aluminum imports and introduce reciprocal tariffs on other goods. The announcements come ahead of a Monday confirmation, with significant implications for U.S. trade relations w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-announce-25-steel-and-aluminum-tariffs-in-latest-trade-escalation/articleshow/118101203.cms",
    "timestamp": "2025-02-10T00:44:47Z"
  },
  {
    "title": "Donald Trump Bring Big Entourage To Super Bowl -- With 1 Key Person Seemingly MIA",
    "description": "Trump’s appearance at the game marks the first time a sitting U.S. president has attended the annual NFL championship.",
    "link": "https://www.huffpost.com/entry/trumps-super-bowl-entourage_n_67a3bb99e4b05654e26a73db",
    "timestamp": "2025-02-10T00:44:20Z"
  },
  {
    "title": "Trump, 1st sitting president to attend Super Bowl, brings members of Congress to the big game",
    "description": "Trump, 1st sitting president to attend Super Bowl, brings members of Congress to the big gamego.com",
    "link": "https://abcnews.go.com/US/trump-1st-sitting-president-attend-super-bowl-new-orleans/story?id=118635084",
    "timestamp": "2025-02-10T00:42:01Z"
  },
  {
    "title": "Donald Trump Is First Sitting President to Attend Super Bowl",
    "description": "President Donald Trump became the first sitting U.S. commander in chief to attend a Super Bowl on Sunday. Trump watched Super Bowl 59 from a luxury viewing suite inside the Caesars Superdome in New Orleans. The president was invited by New Orleans Saints owne…",
    "link": "https://www.adweek.com/convergent-tv/donald-trump-attends-super-bowl-guests/",
    "timestamp": "2025-02-10T00:37:59Z"
  },
  {
    "title": "'Please pay attention': J.D. Vance's statement after big court loss alarms legal experts",
    "description": "Vice President J.D. Vance signaled that President Donald Trump's administration is poised to ignore a judicial ruling, according to experts.\n\nRaw Story reported on Saturday that legal analysts looking at Elon Musk's social media activity predicted that he wou…",
    "link": "https://www.rawstory.com/jd-vance-ignore-court-ruling/",
    "timestamp": "2025-02-10T00:36:29Z"
  },
  {
    "title": "Taylor Swift hears loud boos at Super Bowl LIX after Trump gets raucous cheer",
    "description": "Taylor Swift was met with a loud chorus of boos when she was shown on the jumbotron at Super Bowl LIX, right after that same crowd cheered for President Trump.",
    "link": "https://www.foxnews.com/sports/taylor-swift-hears-loud-boos-super-bowl-lix-after-trump-gets-raucous-cheer",
    "timestamp": "2025-02-10T00:33:26Z"
  },
  {
    "title": "Netanyahu Under Pressure To Extend Gaza Ceasefire As Hamas Releases Emaciated Hostages",
    "description": "The fragile ceasefire's first phase is set to end in three weeks, but Israel and Hamas appear to have made little progress.",
    "link": "https://www.huffpost.com/entry/netanyahu-pressure-extend-gaza-ceasefire-hostages_n_67a942a1e4b0bd527af2a632",
    "timestamp": "2025-02-10T00:33:17Z"
  },
  {
    "title": "Dollar Advances on Trump’s Steel Comment as Trade Jitters Deepen",
    "description": "The dollar rallied against most major currencies after US President Donald Trump said he would announce tariffs on steel and aluminum imports, spurring a renewed rush to the reserve currency.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-advances-on-trumps-steel-comment-as-trade-jitters-deepen",
    "timestamp": "2025-02-10T00:32:54Z"
  },
  {
    "title": "“That’s History In The Building”: Trump Takes Over Super Bowl As First Sitting POTUS To Attend NFL’s Big Game - Deadline",
    "description": "“That’s History In The Building”: Trump Takes Over Super Bowl As First Sitting POTUS To Attend NFL’s Big GameDeadline Trump greets Chiefs star on field at Super Bowl LIX after picking them to win Lombardi TrophyFox News How old is Patrick Mahomes? Chiefs QB g…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176166701",
    "timestamp": "2025-02-10T00:32:19Z"
  },
  {
    "title": "Trump Says U.S. Will Impose 25% Tariffs On Steel And Aluminum Imports",
    "description": "“Any steel coming into the United States is going to have a 25% tariff,” he told reporters on Sunday.",
    "link": "https://www.huffpost.com/entry/trump-steel-aluminum-tariffs_n_67a947d8e4b0d2bb0b1f60ca",
    "timestamp": "2025-02-10T00:30:50Z"
  },
  {
    "title": "Trump administration orders consumer protection agency to stop work, closes building",
    "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal.",
    "link": "https://www.ksat.com/news/politics/2025/02/09/trump-official-orders-consumer-protection-agency-to-stop-work/",
    "timestamp": "2025-02-10T00:30:37Z"
  }
]