[
  {
    "title": "Union Workers Turn on Trump Tariffs: 'Direct Attack on the Working Class'",
    "description": "A union representing West Coast dockworkers has warned that the China-U.S. trade war will affect hundreds of thousands of jobs.",
    "link": "https://www.newsweek.com/union-workers-turn-trump-tariffs-2065456",
    "timestamp": "2025-04-29T10:08:59Z"
  },
  {
    "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
    "description": "Since Donald Trump took office 100 days ago, the president and his administration have faced at least 220 lawsuits challenging nearly every element of his agenda.",
    "link": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
    "timestamp": "2025-04-29T10:06:31Z"
  },
  {
    "title": "The Emperor Has No Instincts | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIt is hard to find thoughtful people who believe President Donald Trump is intellectually deep or curious. It is also hard to find people who know anything about organizational mechanics who think Trump knows …",
    "link": "https://biztoc.com/x/30769127f2da605f",
    "timestamp": "2025-04-29T10:05:53Z"
  },
  {
    "title": "As Musk Nears End of 130-Day DOGE Stint, He's $113 Billion Down",
    "description": "",
    "link": "https://biztoc.com/x/0743bdd7492ec7f7",
    "timestamp": "2025-04-29T10:05:35Z"
  },
  {
    "title": "Trump Administration Is Ending Kendi-ism",
    "description": "By Jarrett Stepman, The Daily Signal | April 28, 2025\nThe Trump administration is waging a necessary, multifront battle to collapse a DEI regime that’s poisoned Western institutions and caused Americans to lose faith in the equal application of standards and …",
    "link": "https://biztoc.com/x/718355bc24f29780",
    "timestamp": "2025-04-29T10:05:31Z"
  },
  {
    "title": "‘You Have No Idea’: Trump Snaps At Reporter Accusing Him Of Not Putting Enough ‘Pressure’ On Russia",
    "description": "By Nicole Silverio, Daily Caller News Foundation | April 24, 2025\nPresident Donald Trump snapped at a reporter Thursday who accused him of not putting enough “pressure” on Russia to end its war against Ukraine. Russia launched its deadliest attack against Kyi…",
    "link": "https://biztoc.com/x/8c917202539f20fc",
    "timestamp": "2025-04-29T10:05:25Z"
  },
  {
    "title": "Peter Schiff Calls Out 'TRUMP' Coin Gala Invite: 'Hunter Biden Is Already Being Outdone'",
    "description": "Economist Peter Schiff took potshots at the private gala dinner invitation to top holders of Official Trump (CRYPTO: TRUMP) meme coin, equating it to corruption charges against Joe Biden’s son, Hunter Biden.\nWhat Happened: In an X post on Monday, Schiff jabbe…",
    "link": "https://biztoc.com/x/e78bacc416e2f299",
    "timestamp": "2025-04-29T10:05:23Z"
  },
  {
    "title": "How Trump lost Canada",
    "description": "Had Donald Trump never uttered the phrase “51st state,” he’d be getting a friend in Ottawa. | Joe Raedle/Getty Images\nLONDON, Canada — Canada’s Liberals just pulled off one of the greatest upsets in modern democratic history: going from a predicted wipeout in…",
    "link": "https://biztoc.com/x/3ea7a64b6eb2837d",
    "timestamp": "2025-04-29T10:05:20Z"
  },
  {
    "title": "Israeli Former Hostage: Thanks Donald Trump, but We Need More Help | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere's something surreal about watching the calendar these days. President Donald Trump has been in the White House for his second first 100 days. That mark happens to coincide with Israel's 77th Independence…",
    "link": "https://biztoc.com/x/e77fb836660b8dd3",
    "timestamp": "2025-04-29T10:04:57Z"
  },
  {
    "title": "Gold Falls on Stronger Dollar as US Offers Auto Tariff Reprieve",
    "description": "(Bloomberg) -- Gold declined on expectations President Donald Trump will ease the impact of his auto tariffs, weighing on haven demand amid hopes of a...",
    "link": "https://finance.yahoo.com/news/gold-falls-stronger-dollar-us-055750218.html",
    "timestamp": "2025-04-29T10:04:14Z"
  },
  {
    "title": "Trump 2.0 Is in Trouble",
    "description": "From the Wall Street Journal editorial board: “Presidential second terms are rarely successful, and on the evidence of his first 100 days Donald Trump’s won’t be different. The President needs a major reset if he",
    "link": "https://politicalwire.com/2025/04/29/trump-2-0-is-in-trouble/",
    "timestamp": "2025-04-29T10:04:00Z"
  },
  {
    "title": "Allies herald democratic values as Liberal Party wins Canadian election",
    "description": "With victory powered by Trump’s tariffs and rhetoric, Mark Carney receives pointed congratulations from around globe.",
    "link": "https://www.aljazeera.com/news/2025/4/29/allies-herald-democratic-values-as-liberal-party-wins-canadian-election",
    "timestamp": "2025-04-29T10:01:42Z"
  },
  {
    "title": "Chokepoint Crazy: The U.S. Bombs Both Sides of Gulf of Aden and Considers Setting Up Shop in Somaliland",
    "description": "Bombs fall on Yemen. Bombs fall on Somalia. The US considers recognizing Somaliland in desperate attempt to dominate Red Sea.",
    "link": "https://www.nakedcapitalism.com/2025/04/chokepoint-crazy-the-u-s-bombs-both-sides-of-gulf-of-aden-and-considers-setting-up-shop-in-somaliland.html",
    "timestamp": "2025-04-29T10:00:57Z"
  },
  {
    "title": "Trump's lawless 100 days",
    "description": "President Donald Trump’s first 100 days in office have shown just how much he likes to act alone.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/first-100-days-second-term-president-trump-newsletter-rcna202405",
    "timestamp": "2025-04-29T10:00:40Z"
  },
  {
    "title": "Mastercard Stock Q1: Will Tariff Risks Dent Outlook?",
    "description": "Consensus estimates indicate that revenues are expected to increase by approximately 12% year-over-year to $7.13 billion, while adjusted earnings are anticipated to...",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/04/29/mastercard-stock-q1-will-tariff-risks-dent-outlook/",
    "timestamp": "2025-04-29T10:00:18Z"
  },
  {
    "title": "Trump steams ahead on these campaign promises as he reaches 100 days in office",
    "description": "Key tenants of President Donald Trump’s first 100 days include imposing harsh tariffs on Chinese imports and cracking down on border security amid a mass deportation initiative.",
    "link": "https://www.foxnews.com/politics/trump-steams-ahead-campaign-promises-he-reaches-100-days-office",
    "timestamp": "2025-04-29T10:00:04Z"
  },
  {
    "title": "The Emperor Has No Instincts | Opinion",
    "description": "Many did not believe that Trump would actually try to implement most of the controversial ideas he championed on the campaign trail.",
    "link": "https://www.newsweek.com/emperor-has-no-instincts-opinion-2065253",
    "timestamp": "2025-04-29T10:00:02Z"
  },
  {
    "title": "Rep. Angie Craig launches Senate run in Minnesota ahead of a competitive Democratic primary",
    "description": "Democratic Rep. Angie Craig announced Tuesday that she's running for the Senate in Minnesota, a long-expected campaign that sets up a crowded primary among Craig, the state's lieutenant governor and a former state legislative leader.",
    "link": "https://www.nbcnews.com/politics/2026-election/rep-angie-craig-launches-senate-run-minnesota-ahead-competitive-democr-rcna203371",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "How “The Great Gatsby” Took Over High School",
    "description": "Alexander Manshel chronicles the history of how “The Great Gatsby” became a staple of high-school English classrooms across the United States.",
    "link": "https://www.newyorker.com/books/page-turner/how-the-great-gatsby-took-over-high-school",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "Trump’s War on Higher Education Isn’t Just About Crushing Dissent",
    "description": "As the GOP escalates its crackdown on student protesters in the wake of the Gaza solidarity movement, a familiar pattern is reasserting itself in American politics. Under the guise of fighting antisemitism, Republicans are resurrecting an old ideological proj…",
    "link": "https://newrepublic.com/article/194527/trump-war-higher-education-isnt-just-crushing-dissent",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "Trump's first 100 days proved Wall Street executives misread him — badly",
    "description": "Wall Street backed President Donald Trump because it was thinking about his first term promises rather than Trump 2.0. Then the tariffs hit the stock market.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/first-100-days-wall-street-trump-newsletter-rcna203413",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "What It’s Like to Be a Trans Federal Employee Under Trump",
    "description": "Dale began his accidental government career at the National Park Service about a decade ago, after signing up as a volunteer. “I didn’t know this was what I wanted to do until I was doing it,” he said. Today, he works for the Bureau of Land Management as an o…",
    "link": "https://newrepublic.com/article/193040/trans-federal-employee-discrimination-trump",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "Trump’s Tariffs Will Widen the Digital Divide",
    "description": "Tariffs will raise prices on essential tech and lead to inflation. Experts say that people who depend on cheap stuff to survive are going to suffer the most.",
    "link": "https://www.wired.com/story/trumps-tariffs-will-widen-the-digital-divide/",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "These 10 Charts Prove Clean Energy Is Winning Despite Donald Trump’s Efforts",
    "description": "This story was originally published by Vox.com and is reproduced here as part of the Climate Desk collaboration. At every light switch, power socket, and on the road, an unstoppable revolution is already underway. Technologies that can power our lives and job…",
    "link": "https://www.motherjones.com/politics/2025/04/charts-united-states-clean-energy-progress-trump/",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "The Bureaucratic Nightmares of Being Trans Under Trump",
    "description": "Grace Byron on President Donald Trump’s anti-trans policies and a recent executive order that declares government-issued I.D.s must reflect one’s sex assigned at conception.",
    "link": "https://www.newyorker.com/news/the-lede/the-bureaucratic-nightmares-of-being-trans-under-trump",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "“It’s About Him”: Renowned White House Photographer Pete Souza on How Trump Is Perverting the Presidential Photo Stream",
    "description": "For decades, official West Wing pictures were meant to chronicle history. Today, says Obama’s and Reagan’s photographer, they’re part of an Oval Office reality show.",
    "link": "https://www.vanityfair.com/news/story/white-house-photography-in-the-age-of-trump",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "The Group Chat Is Where the Tech Elites Drive One Another Mad",
    "description": "Some major figures on the big-tech right have found themselves a new safe space to talk about what it’s like to be masters of the universe.",
    "link": "http://nymag.com/intelligencer/article/the-group-chat-is-where-tech-elites-drive-one-another-mad.html",
    "timestamp": "2025-04-29T10:00:00Z"
  },
  {
    "title": "Tourist unknowingly zip-lined over terrorist attack that killed 26 people in sobering footage",
    "description": "Rishi Bhatt unknowingly recorded a terrorist attack in Pahalgam, India which left 26 dead",
    "link": "https://www.ladbible.com/news/world-news/pahalgam-attack-india-rishi-bhatt-428922-20250429",
    "timestamp": "2025-04-29T09:59:46Z"
  },
  {
    "title": "Canadian opposition leader Poilievre loses parliamentary seat, CBC projects",
    "description": "Canadian Conservative Party leader Pierre Poilievre is projected to have lost his seat in the House of Commons, according to public broadcaster CBC. The report of Poilievre's defeat in an Ottawa-area riding (constituency) came after his party was defeated nat…",
    "link": "https://freerepublic.com/focus/f-news/4313925/posts",
    "timestamp": "2025-04-29T09:59:07Z"
  },
  {
    "title": "Canada Elections: Mark Carney Says ‘Trump Is Trying To Break Us’ After His Liberal Party Wins",
    "description": "The incumbent Liberal Party secured a fourth term in power after a major turnaround in fortunes, aided by President Donald Trump’s trade war and threats to annex Canadian territory.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/04/29/canada-elections-mark-carney-says-trump-is-trying-to-break-us-after-his-liberal-party-wins/",
    "timestamp": "2025-04-29T09:58:47Z"
  },
  {
    "title": "Trump to address rally in Michigan as he marks 100 days in office - live updates",
    "description": "The president's speech comes after he signed an order easing the impact of his tariffs on US car makers.",
    "link": "https://www.bbc.co.uk/news/live/cpvrrre4zlkt",
    "timestamp": "2025-04-29T09:55:53Z"
  },
  {
    "title": "Israeli Former Hostage: Thanks Donald Trump, but We Need More Help | Opinion",
    "description": "There's something surreal about watching the calendar these days. President Donald Trump has been in the White House for his second first 100 days.",
    "link": "https://www.newsweek.com/israeli-former-hostage-thanks-donald-trump-we-need-more-help-opinion-2065326",
    "timestamp": "2025-04-29T09:55:01Z"
  },
  {
    "title": "‘They Came With Their A Game’: Donald Trump, Scott Bessent Reveal Which Country Could Be Close To Making Trade Deal",
    "description": "By Harold Hutchison, Daily Caller News Foundation | April 24, 2025\nPresident Donald Trump and Secretary of the Treasury Scott Bessent said on Thursday that negotiations over a potential trade agreement with South Korea are making progress.\nTrump announced a 9…",
    "link": "https://biztoc.com/x/248f3784cd595f85",
    "timestamp": "2025-04-29T09:54:33Z"
  },
  {
    "title": "Trump Administration Honing In On Major Reform For Scammy Government Contracting Sector",
    "description": "By Floyd Buford, Daily Caller News Foundation | April 24, 2025\nPresident Donald Trump is taking a sledgehammer to one of Washington’s most bloated industries: federal consulting. For decades, politically connected consulting firms have siphoned billions from …",
    "link": "https://biztoc.com/x/de2cdfcb7533b7f6",
    "timestamp": "2025-04-29T09:54:23Z"
  },
  {
    "title": "What Donald Trump's Executive Order Means for Sanctuary Cities",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has signed an executive order directing federal and state officials to compile lists of so-called \"sanctuary\" jurisdictions that are resisting the administration's immigration policies.\n…",
    "link": "https://biztoc.com/x/09d64c46d366a32c",
    "timestamp": "2025-04-29T09:54:07Z"
  },
  {
    "title": "Canadian apparel-maker says the trade war is strengthening his relationships with Europe instead of the US",
    "description": "Paul Long, the founder of Canadian apparel brand Anian, said the Trump trade war has pushed his company to expand into the UK and Europe, not the US.\nAnian\nPresident Donald Trump's trade war is having an effect on small businesses outside the US too.\nPaul Lon…",
    "link": "https://biztoc.com/x/58e24b7e3d326cd0",
    "timestamp": "2025-04-29T09:54:00Z"
  },
  {
    "title": "Trump's new order for US truck drivers has left them worried. Will this create employment barriers?",
    "description": "US President Donald Trump signed an executive order requiring all truck drivers operating within the United States to demonstrate proficiency in the English language. The order aims to enhance road safety and streamline communication within the trucking indus…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-truck-drivers-english-proficiency-trumps-new-order-for-us-truck-drivers-has-left-them-worried-will-this-create-employment-barriers/articleshow/120726339.cms",
    "timestamp": "2025-04-29T09:52:42Z"
  },
  {
    "title": "Video: What’s different about these first 100 days of Trump?",
    "description": "Al Jazeera’s Alan Fisher looks at what’s different this time around US President Trump's return to office.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/4/29/video-whats-different-about-these-first-100-days-of-trump",
    "timestamp": "2025-04-29T09:52:08Z"
  },
  {
    "title": "Elon Musk Limits Responses to Gaming Clip After Debates Over His Skill",
    "description": "Musk has repeatedly flexed his gamer credentials, but frequent criticism of his playing style had led to him blocking the replies to his latest video.",
    "link": "https://www.newsweek.com/elon-musk-limit-gaming-skill-x-twitter-2065431",
    "timestamp": "2025-04-29T09:49:49Z"
  },
  {
    "title": "Poilievre loses his seat after indicating plans to remain party leader, as Liberals win",
    "description": "Conservative Leader Pierre Poilievre has lost his seat in Parliament, complicating earlier plans he announced to stay on as party leader.",
    "link": "https://nationalpost.com/news/politics/federal_election/poilievre-loses-his-seat-after-indicating-plans-to-remain-party-leader-as-liberals-win",
    "timestamp": "2025-04-29T09:47:41Z"
  },
  {
    "title": "Pierre Poilievre loses his seat after indicating plans to remain party leader",
    "description": "Conservative Leader Pierre Poilievre has lost his seat in Parliament, complicating earlier plans he announced to stay on as party leader",
    "link": "https://nationalpost.com/news/politics/federal_election/pierre-poilievre-loses-his-seat-after-indicating-plans-to-remain-party-leader",
    "timestamp": "2025-04-29T09:47:41Z"
  },
  {
    "title": "What Donald Trump's Executive Order Means for Sanctuary Cities",
    "description": "The order directs officials to publish a list of state and local jurisdictions that the Trump administration considers \"sanctuary cities.\"",
    "link": "https://www.newsweek.com/donald-trump-executive-order-sanctuary-cities-2065446",
    "timestamp": "2025-04-29T09:46:14Z"
  },
  {
    "title": "Canadian apparel-maker says the trade war is strengthening his relationships with Europe instead of the US",
    "description": "Paul Long, founder of made-in-Canada apparel brand Anian, says a planned US expansion is on pause, while new EU plans are moving ahead.",
    "link": "https://www.businessinsider.com/apparel-maker-anian-trade-war-strengthening-canadas-ties-europe-2025-4",
    "timestamp": "2025-04-29T09:45:02Z"
  },
  {
    "title": "The Supreme Court Could Soon Force Taxpayers to Fund a Catholic School",
    "description": "A frightening case reveals the weaponization of religious liberty against public education.",
    "link": "https://slate.com/news-and-politics/2025/04/supreme-court-oklahoma-catholic-charter-school.html",
    "timestamp": "2025-04-29T09:45:00Z"
  },
  {
    "title": "Rubio’s State Department Reforms Deliver Massive Blow To Deep State",
    "description": "By Bradley Devlin, The Daily Signal | April 24, 2025\nIf it hasn’t been made clear enough by now, President Donald Trump and his administration have unfinished business from his first term. That feeling is especially acute at the State Department. The first Tr…",
    "link": "https://biztoc.com/x/dafd1b9ea2ebdbbe",
    "timestamp": "2025-04-29T09:43:17Z"
  },
  {
    "title": "CNBC Daily Open: U.S. consumers are starting to feel the pinch of Trump tariffs",
    "description": "Tariffs unleashed — and temporarily, almost capriciously, paused — by U.S. President Donald Trump have given governments across the world a headache as they figure out how to minimize disruptions to their economies. But the U.S. consumer, ironically, could be…",
    "link": "https://biztoc.com/x/ebe958c4fc367c57",
    "timestamp": "2025-04-29T09:43:15Z"
  },
  {
    "title": "New Poll Shines Important Light On The Deep State Rising In The Second Trump Admin",
    "description": "By Tyler O'Neil, The Daily Signal | April 24, 2025\nA surprising number of federal bureaucrats who work in Washington, D.C., plan to oppose President Donald Trump from within the government—a deep state taking shape in his second term.\nD.C.-based bureaucrats a…",
    "link": "https://biztoc.com/x/efb8549a05c5ebd0",
    "timestamp": "2025-04-29T09:43:05Z"
  },
  {
    "title": "Adidas Warns US Tariffs To Push Up Prices",
    "description": "The firm makes a large chunk of its goods in Asian countries that Trump has singled out for running hefty trade surpluses with the United States, including China, which is facing the highest US levies.",
    "link": "https://www.ibtimes.com/adidas-warns-us-tariffs-push-prices-3771772",
    "timestamp": "2025-04-29T09:42:23Z"
  },
  {
    "title": "Pakistan Says It Shot Down Indian Drone Along Kashmir Border",
    "description": "Pakistan's military shot down an Indian drone along the de facto Kashmir border, state radio in Islamabad reported on Tuesday, a week after the deadliest attack on civilians in the contested region in years.",
    "link": "https://www.ibtimes.com/pakistan-says-it-shot-down-indian-drone-along-kashmir-border-3771773",
    "timestamp": "2025-04-29T09:42:23Z"
  },
  {
    "title": "Over 500 rabbis sign letter rejecting Trump’s antisemitism moves",
    "description": "A similar rabbis' letter published last week condemned the administration’s “immoral use of the law”",
    "link": "https://www.jewishnews.co.uk/over-500-rabbis-sign-letter-rejecting-trumps-antisemitism-moves/",
    "timestamp": "2025-04-29T09:41:00Z"
  },
  {
    "title": "Van Jones: Dems Haven't Figured Out Position Beyond Outrage at Trump, Musk",
    "description": "On Monday’s broadcast of CNN’s “Laura Coates Live,” CNN Political Commentator and former Obama Adviser Van Jones said that Democrats have yet to figure out “what’s the proposition? What are Democrats offering besides outrage at Donald Trump and Elon Musk?”\nTh…",
    "link": "https://www.breitbart.com/clips/2025/04/29/van-jones-dems-havent-figured-out-position-beyond-outrage-at-trump-musk/",
    "timestamp": "2025-04-29T09:39:48Z"
  },
  {
    "title": "Social Security Could Collapse Entirely Under Trump, Former Chief Warns",
    "description": "Martin O'Malley said that DOGE cutbacks at the agency could \"cascade into a collapse\" of the entire Social Security system.",
    "link": "https://www.newsweek.com/social-security-collapse-under-trump-former-chief-warns-2065432",
    "timestamp": "2025-04-29T09:38:59Z"
  },
  {
    "title": "Pakistan says it shot down Indian drone along Kashmir border",
    "description": "Pakistan’s military shot down an Indian drone along the de facto Kashmir border, state radio in Islamabad reported on Tuesday, a week after the deadliest attack on civilians in the contested region in years. The Indian army also said that both sides exchanged…",
    "link": "https://www.digitaljournal.com/world/pakistan-says-it-shot-down-indian-drone-along-kashmir-border/article",
    "timestamp": "2025-04-29T09:38:19Z"
  },
  {
    "title": "China is exhibiting ‘end-of-regime conduct,’ expert warns of ‘perplexing’ behavior",
    "description": "Something is \"very, very wrong\" in Beijing right now, according to foreign policy expert Gordon Chang, who is signaling more \"end-of-regime conduct\" coming out of Xi Jinping’s China.",
    "link": "https://nypost.com/2025/04/29/world-news/china-facing-end-of-regime-conduct-as-xi-jinping-faces-trump-tariffs/",
    "timestamp": "2025-04-29T09:38:17Z"
  },
  {
    "title": "Carney Wins Canada's Election; President Trump's First 100 Days",
    "description": "On today's podcast: 1) Canada’s Liberal Party is projected to win a fourth consecutive election, giving a mandate to former central banker Mark Carney after a campaign in which he pledged to boost economic growth and stand up to US President Donald Trump in a…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/carney-wins-canadas-election-president-trumps-first-100-days",
    "timestamp": "2025-04-29T09:37:41Z"
  },
  {
    "title": "Reciprocal tariffs will exacerbate stress for MSMEs: Ind-Ra",
    "description": "India Ratings and Research (Ind-Ra) indicates that reciprocal tariffs will disproportionately affect MSMEs, exacerbating existing financial stress due to tariff war 2.0. While mid-sized corporates possess greater resilience, MSMEs, characterized by limited fi…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/reciprocal-tariffs-will-exacerbate-stress-for-msmes-ind-ra/articleshow/120726284.cms",
    "timestamp": "2025-04-29T09:34:48Z"
  },
  {
    "title": "Kursk Map Timelapse Shows Ukraine's Diminishing Incursion Into Russia",
    "description": "Russia says it has recaptured all its territory in the region, but Kyiv says it is hanging on.",
    "link": "https://www.newsweek.com/kursk-map-russia-incursion-2065416",
    "timestamp": "2025-04-29T09:34:22Z"
  },
  {
    "title": "US updates: Trump marks 100 days in office",
    "description": "It has been 100 days since Donald Trump returned to the White House. Since then, he issued a flurry of executive orders from the Oval Office, upending the United States and its relations with the world. DW has more. US President Donald Trump has had a conside…",
    "link": "https://www.dw.com/en/us-updates-trump-marks-100-days-in-office/live-72383221",
    "timestamp": "2025-04-29T09:34:00Z"
  },
  {
    "title": "US updates: Trump's first 100 days in office",
    "description": "It has been 100 days since Donald Trump returned to the White House. Since then, he issued a flurry of executive orders from the Oval Office, upending the United States and its relations with the world. DW has more. US President Donald Trump has had a conside…",
    "link": "https://www.dw.com/en/us-updates-trumps-first-100-days-in-office/live-72383221",
    "timestamp": "2025-04-29T09:34:00Z"
  },
  {
    "title": "US updates: Trump marks first 100 days in office",
    "description": "It has been 100 days since Donald Trump returned to the White House. Since then, he issued a flurry of executive orders from the Oval Office, upending the United States and its relations with the world. DW has more. US President Donald Trump has had a conside…",
    "link": "https://www.dw.com/en/us-updates-trump-marks-first-100-days-in-office/live-72383221",
    "timestamp": "2025-04-29T09:34:00Z"
  },
  {
    "title": "Inside The Atlantic magazine’s circuitous route to interviews with Trump - AP News",
    "description": "Inside The Atlantic magazine’s circuitous route to interviews with TrumpAP News ‘I Run the Country and the World’The Atlantic If Trump really is running the world, where will he take it?CNN Five key quotes from Trump's interview with The AtlanticAxios Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177204771",
    "timestamp": "2025-04-29T09:32:46Z"
  },
  {
    "title": "Nvidia, Johnson & Johnson, Hyundai, Toyota, SoftBank CEOs To Join Trump At White House As He Touts Investment Surge In First 100 Days: Report",
    "description": "To commemorate his first 100 days back in office, President Donald Trump will host more than two dozen top executives and CEO’s at the White House this week to highlight a range of investments from some of the biggest companies in the world.\nWhat Happened: Le…",
    "link": "https://biztoc.com/x/f48b1749edf21716",
    "timestamp": "2025-04-29T09:32:03Z"
  },
  {
    "title": "Trump’s first 100 days tests both Republican, Democratic parties' futures: ANALYSIS",
    "description": "His low approval ratings could be a liability for vulnerable Republicans.",
    "link": "https://abcnews.go.com/Politics/trumps-100-days-tests-future-republican-democratic-parties/story?id=121253288",
    "timestamp": "2025-04-29T09:31:21Z"
  },
  {
    "title": "Why Democrats Need an Opposition—and a Proposition—Agenda",
    "description": "Rep. Pramila Jayapal\n\n\n\nThe American people can smell a rat. If we want to be trusted partners, we have to show we are worthy of the trust and be willing to do what it takes to engage, explain and bring people to us.\r\n\n\r\n\n\nThe post Why Democrats Need an Oppos…",
    "link": "https://www.thenation.com/article/politics/democrats-opposition-trump-fight-populism/",
    "timestamp": "2025-04-29T09:30:00Z"
  },
  {
    "title": "France warns of sanctions on Iran if nuclear deal not reached",
    "description": "United Nations, United States (AFP) April 29, 2025\n\n\n France, Germany, and the United Kingdom will not hesitate to reimpose sanctions against Tehran if European security is threatened by Iran's nuclear program, the French foreign minister said at the United N…",
    "link": "https://www.spacewar.com/reports/France_warns_of_sanctions_on_Iran_if_nuclear_deal_not_reached_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "Iran accuses Israel's Netanyahu of 'dictating' US policy in nuclear talks",
    "description": "Tehran (AFP) April 28, 2025\n\n\n Iran accused Israeli Prime Minister Benjamin Netanyahu on Monday of trying to dictate US policy in negotiations, after he called for the complete dismantling of Tehran's nuclear programme and for the inclusion of its ballistic m…",
    "link": "https://www.spacewar.com/reports/Iran_accuses_Israels_Netanyahu_of_dictating_US_policy_in_nuclear_talks_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "Confidence in NATO security guarantees plunges in Finland: survey",
    "description": "Helsinki (AFP) April 29, 2025\n\n\n Finns' confidence in the security guarantees of the NATO alliance, which their country joined two years ago, has significantly weakened with return of Donald Trump as US president, a survey showed Tuesday. \n\nFinland, which sha…",
    "link": "https://www.spacewar.com/reports/Confidence_in_NATO_security_guarantees_plunges_in_Finland_survey_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "Russian President Vladimir Putin announces three-day cease-fire in Ukraine war",
    "description": "Washington DC (UPI) Apr 28, 2025 \n\n Russian President Vladimir Putin on Monday announced a three-day cease-fire in its war with Ukraine is set to take place in May, but Ukrainian officials question its timing and validity. \n The Kremlin said the cease-fire wo…",
    "link": "https://www.spacewar.com/reports/Russian_President_Vladimir_Putin_announces_three-day_cease-fire_in_Ukraine_war_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "US lost seven multi-million-dollar drones in Yemen area since March",
    "description": "Washington (AFP) April 29, 2025\n\n\n The United States has lost seven multi-million-dollar MQ-9 Reaper drones in the Yemen area since March 15, a US official said Monday, as the Navy announced a costly warplane fell off an aircraft carrier into the Red Sea. \n\nW…",
    "link": "https://www.spacewar.com/reports/US_lost_seven_multi-million-dollar_drones_in_Yemen_area_since_March_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "Amazon launches first Starlink-rival internet satellites",
    "description": "Cape Canaveral (AFP) April 28, 2025\n\n\n Amazon on Monday launched its first batch of Project Kuiper internet satellites, marking the start of its push to rival Elon Musk's Starlink. \n\nThe mission, called Kuiper Atlas 1, lifted off from Cape Canaveral Space For…",
    "link": "https://www.spacedaily.com/reports/Amazon_launches_first_Starlink-rival_internet_satellites_999.html",
    "timestamp": "2025-04-29T09:27:27Z"
  },
  {
    "title": "Jalen Hurts misses Eagles’ White House celebrations while Trump backs the ‘tush push’",
    "description": "Unlike seven years ago, the Philadelphia Eagles celebrated their Super Bowl victory at the White House with President Donald Trump on Monday – albeit with several notable absences, including star quarterback Jalen Hurts.",
    "link": "https://www.cnn.com/2025/04/29/sport/eagles-white-house-donald-trump-hurts-swift-spt-intl/index.html",
    "timestamp": "2025-04-29T09:26:43Z"
  },
  {
    "title": "Consumer gloom amid Trump's tariffs expected to have worsened in April",
    "description": "Consumer gloom amid Trump's tariffs expected to have worsened in Aprilgo.com",
    "link": "https://abcnews.go.com/Business/consumer-gloom-amid-trumps-tariffs-expected-worsened-april/story?id=121233738",
    "timestamp": "2025-04-29T09:26:25Z"
  },
  {
    "title": "Liberals won the election in Canada. Here's what to know and what comes next",
    "description": "The Liberal Party has won Canada's federal election, capping a stunning turn in fortunes fed by U.S. President Donald Trump's threats of trade war and to make the country the 51st American state",
    "link": "https://abcnews.go.com/International/wireStory/liberals-won-election-canada-121265535",
    "timestamp": "2025-04-29T09:26:15Z"
  },
  {
    "title": "Trump voters stand by their vote, but some have concerns about prices and tariffs",
    "description": "Polling shows most Americans disapprove of Trump on the economy. But his voters largely say they’re still confident in him with a few concerns.",
    "link": "https://abcnews.go.com/Politics/trump-voters-confident-handling-economy-concerns-prices-tariffs/story?id=121125189",
    "timestamp": "2025-04-29T09:23:24Z"
  },
  {
    "title": "The President's First 100 Days Is a Return to American Greatness | Opinion",
    "description": "In just 100 days, we have witnessed one of the most productive presidential administrations in modern history.",
    "link": "https://www.newsweek.com/presidents-first-100-days-return-american-greatness-opinion-2065355",
    "timestamp": "2025-04-29T09:22:01Z"
  },
  {
    "title": "'Unprecedented': How Trump has pushed the limits of presidential power in 100 days",
    "description": "President Donald Trump, in his first 100 days in office, has wielded his pen to radically implement his agenda at a breakneck pace.",
    "link": "https://abcnews.go.com/Politics/unprecedented-trump-pushed-limits-presidential-power-100-days/story?id=121124189",
    "timestamp": "2025-04-29T09:21:47Z"
  },
  {
    "title": "Trump Is Finally Coming Face to Face With Voters After Approval Rating Falls",
    "description": "President Donald Trump is finally getting on the road to promote his agenda, after spending much of his first 100 days in office ensconced in the White House or his private clubs.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-is-finally-coming-face-to-face-with-voters-after-approval-rating-falls",
    "timestamp": "2025-04-29T09:19:20Z"
  },
  {
    "title": "Canadian opposition leader Poilievre loses parliamentary seat, CBC projects",
    "description": "The Conservative is expected to experience a personal defeat, after his party was bettered nationwide by the Liberals.",
    "link": "https://www.bbc.com/news/articles/cwy70jg8ye8o",
    "timestamp": "2025-04-29T09:18:11Z"
  },
  {
    "title": "First-Quarter GDP Preview: What to Expect for Economic Growth",
    "description": "First-Quarter GDP Preview: What to Expect for Economic Growththeepochtimes.com",
    "link": "https://www.theepochtimes.com/business/first-quarter-gdp-preview-what-to-expect-for-economic-growth-5848899",
    "timestamp": "2025-04-29T09:16:42Z"
  },
  {
    "title": "Why did Trump turn his attention to Taylor Swift while celebrating Eagles Super Bowl 2025 win at White House?",
    "description": "While celebrating the Philadelphia Eagles' 2025 Super Bowl win, Donald Trump turned his attention to Taylor Swift and the Kansas City Chiefs. As he talked up the Eagles and their journey to becoming the 2025 champions during his speech at the White House, Tru…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-why-did-trump-turn-his-attention-to-taylor-swift-while-celebrating-eagles-super-bowl-2025-win-at-white-house-kanas-city-chief-travis-kelce/articleshow/120724861.cms",
    "timestamp": "2025-04-29T09:10:38Z"
  },
  {
    "title": "How Americans grade Trump’s first 100 days",
    "description": "As President Donald Trump celebrates his first 100 days in office, a new PBS News/NPR/Marist poll finds that a plurality of Americans give him a failing grade.",
    "link": "https://biztoc.com/x/0a0e4f950575d59a",
    "timestamp": "2025-04-29T09:09:45Z"
  },
  {
    "title": "Is Trump Making America Great Again in First 100 Days? Newsweek Writers' Verdict",
    "description": "Donald Trump's second administration is now 100 days old. Has it been a success or failure so far? Our writers weight in—plus have your say.",
    "link": "https://biztoc.com/x/ef181b5c72ddc6b6",
    "timestamp": "2025-04-29T09:09:44Z"
  },
  {
    "title": "Most Americans disapprove of Musk’s govt role – poll",
    "description": "Some 60% of Americans have opposed Elon Musk’s work for the US presidential administration Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616471-most-americans-disapprove-musk-poll/",
    "timestamp": "2025-04-29T09:09:29Z"
  },
  {
    "title": "Trump rules out third term",
    "description": "The US president has rejected rumors that he will seek a third term Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616477-trump-rules-out-third-term/",
    "timestamp": "2025-04-29T09:09:08Z"
  },
  {
    "title": "Police raided the wrong house, now a family wants the Supreme Court to let them sue",
    "description": "Can victims of police mistakes sue for damages despite immunity? Supreme Court case could clear the way.",
    "link": "https://abcnews.go.com/Politics/supreme-court-hears-case-family-victimized-police-raid/story?id=120881932",
    "timestamp": "2025-04-29T09:08:38Z"
  },
  {
    "title": "Adidas warns US tariffs to push up prices",
    "description": "German sportswear giant Adidas on Tuesday warned that US President Donald Trump’s tariffs will increase prices for its products in the United States, and the hardline trade policies could dent its ongoing recovery. The firm makes a large chunk of its goods in…",
    "link": "https://www.digitaljournal.com/world/adidas-warns-us-tariffs-to-push-up-prices/article",
    "timestamp": "2025-04-29T09:07:33Z"
  },
  {
    "title": "Regulation-Boosting Bills Pending In Both Blue And Red States",
    "description": "DC isn’t the only place where regulatory burden-boosting policy proposals are garnering bipartisan support. The same phenomenon is on display in a few statehouses.",
    "link": "https://www.forbes.com/sites/patrickgleason/2025/04/29/regulation-boosting-bills-pending-in-both-blue-and-red-states/",
    "timestamp": "2025-04-29T09:05:41Z"
  },
  {
    "title": "Pakistan’s airspace block unlikely to rattle India’s cargo routes",
    "description": "India is assessing the impact of Pakistan’s airspace closure on air cargo, though exporters say disruption will be limited as most goods move by sea. Air shipments of garments, gems, perishables and electronics may face pressure before the July 9 tariff deadl…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/pakistans-airspace-block-unlikely-to-rattle-indias-cargo-routes/articleshow/120723645.cms",
    "timestamp": "2025-04-29T09:05:24Z"
  },
  {
    "title": "Election Diary: Albanese will be encouraged by ‘Trump’ effect in helping Canadian Liberals to victory",
    "description": "With Canada’s social progressive Liberals were re-elected in Canada Albanese will be hoping that Australia will soon follow-suit.",
    "link": "https://theconversation.com/election-diary-albanese-will-be-encouraged-by-trump-effect-in-helping-canadian-liberals-to-victory-255387",
    "timestamp": "2025-04-29T09:05:07Z"
  }
]