[
  {
    "title": "Lululemon shares plunge as Trump tariffs bite",
    "description": "The athleisure brand joins a growing list of big firms to warn about the impact of Trump's policies.",
    "link": "https://www.bbc.com/news/articles/c8re86n23j5o",
    "timestamp": "2025-06-06T02:26:16Z"
  },
  {
    "title": "Tech got played by the Musk-Trump bromance, but average Americans will pay the price",
    "description": "I admit I’m disappointed that Saturday Night Live’s season is over and we won’t get a cold open on Elon Musk’s public breakup with President Donald Trump, but I am resisting the urge to be amused. I think the somber truth is that the US tech industry, which g…",
    "link": "https://biztoc.com/x/3270c565a462e21f",
    "timestamp": "2025-06-06T02:25:29Z"
  },
  {
    "title": "Musk says SpaceX will retire Dragon spacecraft amid bitter Trump dispute",
    "description": "Elon Musk, the world’s richest man, on Thursday said his company SpaceX would begin decommissioning its Dragon spacecraft after he engaged in an extraordinary public fallout with Donald Trump who had threatened to cancel government contracts with Musk’s busin…",
    "link": "https://biztoc.com/x/83714b94d4766a00",
    "timestamp": "2025-06-06T02:25:22Z"
  },
  {
    "title": "JD Vance Reacts to Trump and Musk's Public Meltdown",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nVice President JD Vance cracked a joke on social media Thursday about billionaire Elon Musk's bitter feud with President Donald Trump.\nThe Context\nThe war of words between Trump and Musk has intensified GOP fi…",
    "link": "https://biztoc.com/x/e94648d74dbc9b34",
    "timestamp": "2025-06-06T02:25:10Z"
  },
  {
    "title": "Trump-Musk row slams Tesla shares, $150 billion in market value wiped out",
    "description": "Tesla's shares plummeted after a public feud erupted between Elon Musk and Donald Trump, erasing $150 billion in market value. Investors grew concerned about the potential impact on Musk's business empire as the two exchanged criticisms over tax policies and …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-musk-row-slams-tesla-shares-150-billion-in-market-value-wiped-out/articleshow/121662929.cms",
    "timestamp": "2025-06-06T02:25:03Z"
  },
  {
    "title": "Ex-Trump Aide Names The Elon Musk Attack That's 'Going To Stick The Most' With Trump",
    "description": "Alyssa Farah Griffin broke down why the post is so \"damaging\" to the president amid his \"wild\" breakup with the billionaire.",
    "link": "https://www.huffpost.com/entry/cnn-alyssa-farah-griffin-trump-musk-feud_n_68423925e4b004bd5409c08e",
    "timestamp": "2025-06-06T02:23:48Z"
  },
  {
    "title": "Hollywood celebrities join Planned Parenthood to push taxpayer-funded abortion in New York Times ad",
    "description": "About 250 Hollywood stars joined with Planned Parenthood last week in a full-page New York Times ad that called for continued taxpayer funding of the abortion industry giant. “I’m for Planned Parenthood,” proclaims the ad. The celebrities, among them singers …",
    "link": "https://freerepublic.com/focus/f-chat/4321269/posts",
    "timestamp": "2025-06-06T02:23:17Z"
  },
  {
    "title": "Paramount chair Shari Redstone confirms thyroid cancer diagnosis",
    "description": "Paramount Global chair Shari Redstone was diagnosed with thyroid cancer earlier this spring, a spokesperson for Redstone said in a statement to Reuters on Thursday.",
    "link": "https://nypost.com/2025/06/05/business/paramount-chair-shari-redstone-confirms-thyroid-cancer-diagnosis/",
    "timestamp": "2025-06-06T02:23:02Z"
  },
  {
    "title": "IDF says attack in Dahiyeh targeted Hezbollah drone production sites and warehouses",
    "description": "ISRAEL: IDF says missile launched from Yemen was intercepted after sirens sound around Jerusalem ■ LEBANON: IDF strikes Hezbollah facilities in Dahiyeh, Beirut ■ GAZA: Two aid centers opened Thursday, fund says; IDF recovers bodies of Israeli-U.S. hostages Ga…",
    "link": "https://www.haaretz.com/israel-news/2025-06-06/ty-article-live/idf-says-attack-in-dahiyeh-targeted-hezbollah-drone-production-sites-and-warehouses/00000197-4305-d9f1-abb7-7b752c330000",
    "timestamp": "2025-06-06T02:22:40Z"
  },
  {
    "title": "Everyone from Jon Stewart to Alex Jones is weighing in on the Trump/Musk feud",
    "description": "Social media exploded with hot takes from all over the political spectrum Thursday amid the very public and acrimonious split between President Donald Trump ...",
    "link": "https://www.nydailynews.com/2025/06/05/donald-trump-elon-musk-feud-celebrity-reactions/",
    "timestamp": "2025-06-06T02:22:00Z"
  },
  {
    "title": "Investors Dump Tesla On Bet Trump May Lash Out At Musk Through His Car Company",
    "description": "Shares of Elon Musk’s electric vehicle maker fell sharply Thursday as investors fear his dispute with President Donald Trump could end up hurting the company.",
    "link": "https://www.huffpost.com/entry/trump-musk-tesla-stock_n_68424fdbe4b04a6fce05858c",
    "timestamp": "2025-06-06T02:19:51Z"
  },
  {
    "title": "Watch: CNN Commentator Scott Jennings Has Probably the Best Response Yet to the Trump/Elon Feud",
    "description": "CNN senior political commentator Scott Jennings might have had the best response yet Thursday to the very public Trump/Elon feud taking place over on X.During his appearance on \"The Lead with Jake Tapper,\" Tapper spoke with Jennings about what everyone was wi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4321267/posts",
    "timestamp": "2025-06-06T02:15:04Z"
  },
  {
    "title": "JD Vance Reacts to Trump and Musk's Public Meltdown",
    "description": "The vice president poked fun on social media at Musk's public feud with the president.",
    "link": "https://www.newsweek.com/jd-vance-jokes-trump-musk-falling-out-social-media-2081759",
    "timestamp": "2025-06-06T02:14:54Z"
  },
  {
    "title": "Musk says Trump tariffs will cause a recession later this year",
    "description": "Elon Musk and President Donald Trump's friendship fractured on Friday.\nAndrew Harnik/Getty Images\nElon Musk predicted Trump's tariffs will trigger a recession later this year.\nMusk's comment comes amid a growing public fallout with the president.\nWall Street …",
    "link": "https://biztoc.com/x/152aedf5ce135145",
    "timestamp": "2025-06-06T02:14:29Z"
  },
  {
    "title": "Elon Musk Promises He Won’t Take His Rocket Ships and Go Home After Some Rando Tells Him To Chill",
    "description": "Billionaire SpaceX CEO Elon Musk walked back his decision on decommissioning SpaceX's Dragon spacecraft on Thursday after a random social media account with less than 200 followers told him to calm down.\nThe post Elon Musk Promises He Won’t Take His Rocket Sh…",
    "link": "https://www.mediaite.com/politics/elon-musk-promises-he-wont-take-his-rocket-ships-and-go-home-after-some-rando-tells-him-to-chill/",
    "timestamp": "2025-06-06T02:12:47Z"
  },
  {
    "title": "Musk says Trump tariffs will cause a recession later this year",
    "description": "The tech billionaire has suddenly fallen out with Donald Trump, and the two are jousting on social media.",
    "link": "https://www.businessinsider.com/elon-musk-trump-tariffs-cause-recession-2025-6",
    "timestamp": "2025-06-06T02:11:18Z"
  },
  {
    "title": "Trump-Xi phone call signals tentative thaw amid escalating US-China trade tensions",
    "description": "On the evening of June 5, 2025, Chinese state media reported that President Xi Jinping spoke by phone with US President Donald Trump, marking the first direct dialogue between the two leaders since Trump began his second presidential term in January 2025. The…",
    "link": "https://www.digitimes.com/news/a20250606PD201/donald-trump-beijing-2025.html",
    "timestamp": "2025-06-06T02:09:50Z"
  },
  {
    "title": "'Fire, investigate, prosecute': Analyst urges Trump to go after DOGE workers",
    "description": "President Donald Trump has threatened to escalate his feud with tech billionaire Elon Musk into weaponized federal policy, canceling his longtime ally's subsidies and federal contracts as Musk rails against Trump and attacks his signature tax cut bill current…",
    "link": "https://www.rawstory.com/trump-musk-doge-2672319298/",
    "timestamp": "2025-06-06T02:04:03Z"
  },
  {
    "title": "The Donald-Elon fauxmance is over (for now). What happened?",
    "description": "When Elon Musk was Nazi-saluting his way through Donald Trump's second inauguration, we thought their friendship would last forever. What went wrong?\nThe post The Donald-Elon fauxmance is over (for now). What happened? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/06/elon-musk-donald-trump-us-politics-jeffrey-epstein-fauxmance/",
    "timestamp": "2025-06-06T02:03:38Z"
  },
  {
    "title": "Musk and Trump’s fauxmance is over (for now). What happened?",
    "description": "When Elon Musk was Nazi-saluting his way through Donald Trump's second inauguration, we thought their friendship would last forever. What went wrong?\nThe post Musk and Trump’s fauxmance is over (for now). What happened? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/06/elon-musk-donald-trump-us-politics-jeffrey-epstein/",
    "timestamp": "2025-06-06T02:03:38Z"
  },
  {
    "title": "Trump-Musk meltdown gets Europe gloating",
    "description": "\"See, big man, politics is harder than you thought,\" Poland's foreign minister taunts the world's richest man.",
    "link": "https://www.politico.eu/article/donald-trump-elon-musk-radoslaw-sikorski-thierry-breton/",
    "timestamp": "2025-06-06T02:03:28Z"
  },
  {
    "title": "Congressman Says ‘We Had Wagers Going’ on When Trump-Musk Bromance Would Implode",
    "description": "Rep. Vicente Gonzalez said lawmakers \"had wagers going\" on the House floor as to when the relationship between President Donald Trump and Tesla CEO Elon Musk would implode.\nThe post Congressman Says ‘We Had Wagers Going’ on When Trump-Musk Bromance Would Impl…",
    "link": "https://www.mediaite.com/media/tv/congressman-says-we-had-wagers-going-on-when-trump-musk-bromance-would-implode/",
    "timestamp": "2025-06-06T02:03:13Z"
  },
  {
    "title": "US slaps sanctions on four ICC judges over Israel, US cases",
    "description": "The United States has sanctioned four International Criminal Court judges. This includes those involved in the arrest warrant for Israeli Prime Minister Benjamin Netanyahu. Secretary of State Marco Rubio defended the move. He cited the need to protect US and …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-slaps-sanctions-on-four-icc-judges-over-israel-us-cases/articleshow/121662739.cms",
    "timestamp": "2025-06-06T02:02:11Z"
  },
  {
    "title": "Seth Meyers Roasts Elon Musk For Waiting Until Now to Allege ‘That Trump Might Be a Pedophile’: ‘You Already Knew That and It Wasn’t a Dealbreaker’",
    "description": "After Elon Musk alleged in a post on X that Donald Trump’s name appears in documents from Jeffrey Epstein’s child sex trafficking case, Seth Meyers has pointed out one troubling aspect of the spat: It seems that Musk didn’t share the information until much la…",
    "link": "https://variety.com/2025/tv/news/seth-meyers-elon-musk-trump-epstein-1236420855/",
    "timestamp": "2025-06-06T02:02:09Z"
  },
  {
    "title": "Lambda Legal, a nonprofit supporting LGBTQ+ rights, exceeded fundraising goal by $105M",
    "description": "Lambda Legal CEO Kevin Jennings announced the results on Thursday, saying the group exceeded its original fundraising goal by $105 million.  “I think this is...",
    "link": "https://www.yahoo.com/news/lambda-legal-nonprofit-supporting-lgbtq-020143341.html",
    "timestamp": "2025-06-06T02:01:43Z"
  },
  {
    "title": "Can Europe’s Trump counterpunch work? Sanctions, tariffs and a MAGA twist.",
    "description": "Presented by Instagram.",
    "link": "https://www.politico.eu/podcast/eu-confidential/can-europes-trump-counterpunch-work-sanctions-tariffs-and-a-maga-twist/",
    "timestamp": "2025-06-06T02:01:00Z"
  },
  {
    "title": "The implosion of a powerful political alliance: Trump and Musk in their own words",
    "description": "Last Friday, President Donald Trump heaped praise on Elon Musk as the tech billionaire prepared to leave his unorthodox White House job.",
    "link": "https://www.clickondetroit.com/news/politics/2025/06/06/the-implosion-of-a-powerful-political-alliance-trump-and-musk-in-their-own-words/",
    "timestamp": "2025-06-06T02:00:35Z"
  },
  {
    "title": "Dollar mired in US economic weakness and trade limbo",
    "description": "The dollar faced a weekly loss due to signs of U.S. economic fragility and stalled trade negotiations. Markets awaited the U.S. nonfarm payrolls report, crucial after weak economic data highlighted the impact of tariffs.",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-mired-in-us-economic-weakness-and-trade-limbo/articleshow/121662716.cms",
    "timestamp": "2025-06-06T01:59:03Z"
  },
  {
    "title": "Musk and Trump’s undignified divorce rips the mask off modern America, in all its faded glory",
    "description": "The Musk-Trump clash has continued Trump's tradition of happily exposing the once-secret nature of how power operates in the United States.\nThe post Musk and Trump’s undignified divorce rips the mask off modern America, in all its faded glory appeared first o…",
    "link": "http://www.crikey.com.au/2025/06/06/donald-trump-elon-musk-break-up-power-us-president/",
    "timestamp": "2025-06-06T01:58:59Z"
  },
  {
    "title": "Elon Musk-Trump feud sparks $US34 billion loss for Tesla, Space X mogul",
    "description": "Minute by minute, post by post, Elon Musk’s very public, extremely online feud with President Donald Trump sliced into his vaunted status as the world’s richest person.",
    "link": "https://www.smh.com.au/business/companies/elon-musk-loses-52-billion-in-one-day-as-trump-feud-boils-over-20250606-p5m5er.html",
    "timestamp": "2025-06-06T01:56:18Z"
  },
  {
    "title": "Gold heads for weekly gain on weak US economic data, softer dollar",
    "description": "Gold prices saw a rise on Friday, potentially securing weekly gains. Weaker U.S. economic data and a softer dollar boosted demand. Investors are awaiting U.S. payroll data for Federal Reserve insights. Unemployment benefits applications increased. Donald Trum…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-heads-for-weekly-gain-on-weak-us-economic-data-softer-dollar/articleshow/121662689.cms",
    "timestamp": "2025-06-06T01:55:29Z"
  },
  {
    "title": "US stocks end down as Tesla slumps 14% on Trump-Musk feud",
    "description": "Wall Street concluded Thursday's trading session lower, influenced by a significant drop in Tesla shares amid a feud between CEO Elon Musk and President Trump. This offset positive sentiment from potential progress in U.S.-China tariff discussions, as both le…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-stocks-end-down-as-tesla-slumps-14-on-trump-musk-feud/articleshow/121662675.cms",
    "timestamp": "2025-06-06T01:53:41Z"
  },
  {
    "title": "Florida Haitians, Venezuelans brace for impending travel restrictions",
    "description": "President Donald Trump is now imposing travel restrictions for visitors from several countries, including Haiti and Venezuela.",
    "link": "https://www.wftv.com/news/local/florida-haitians-venezuelans-brace-impending-travel-restrictions/OA6TPJQ5YBD7NBUUHQOOFLBHTQ/",
    "timestamp": "2025-06-06T01:53:22Z"
  },
  {
    "title": "Tesla plunges after conflict between Musk and Trump spills into open",
    "description": "Tesla’s shares sank as a simmering feud between company chief Elon Musk and U.S. President Donald Trump devolved into a public war of words between two of the world’s most powerful people.\nTrump on Thursday said he was \"very disappointed” by the Tesla chief e…",
    "link": "https://biztoc.com/x/2e5d380baa2d4f1c",
    "timestamp": "2025-06-06T01:52:14Z"
  },
  {
    "title": "'Trump is in the Epstein files': Elon Musk levels allegations against US Prez, calls for impeachment",
    "description": "Trump vs Elon Musk: In a dramatic twist to an escalating political feud, Elon Musk publicly claimed that Donald Trump is named in the unreleased “Epstein files,” suggesting the White House is hiding damaging information. The accusation follows Trump’s threats…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/musk-vs-trump-war-trump-is-in-the-epstein-files-elon-musk-levels-allegations-against-us-prez-calls-for-impeachment/articleshow/121662399.cms",
    "timestamp": "2025-06-06T01:52:10Z"
  },
  {
    "title": "EXPLAINER-Does escalating spat with Trump pose regulatory threat for Musk businesses?",
    "description": "Automaker Tesla, satellite company SpaceX and brain implant company Neuralink are among Elon Musk’s companies that could face the heat from US regulatory bodies",
    "link": "https://www.thehindubusinessline.com/news/world/explainer-does-escalating-spat-with-trump-pose-regulatory-threat-for-musk-businesses/article69663564.ece",
    "timestamp": "2025-06-06T01:51:33Z"
  },
  {
    "title": "From key adviser to bitter feud: A timeline of Musk and Trump's relationship",
    "description": "Once a key member of President Donald Trump's inner circle, Elon Musk's relationship with the president has deteriorated into a bitter public feud.",
    "link": "https://abcnews.go.com/Politics/key-adviser-bitter-feud-timeline-musk-trumps-relationship/story?id=122558371",
    "timestamp": "2025-06-06T01:51:26Z"
  },
  {
    "title": "Musk-Trump breakup puts billions in SpaceX contracts at risk, jolting US space program",
    "description": "WASHINGTON, June 5 (Reuters) - About $22 billion worth of SpaceX's government contracts is at risk and multiple U.S. space programs could face dramatic changes in the fallout of Elon Musk and President Donald Trump's explosive feud on Thursday. The disagreeme…",
    "link": "https://freerepublic.com/focus/f-news/4321264/posts",
    "timestamp": "2025-06-06T01:51:13Z"
  },
  {
    "title": "'Intense scrutiny': Dems press DOJ on Musk’s claim Trump is in Epstein files",
    "description": "House Democrats are pressing the Justice Department and FBI to confirm whether Elon Musk’s explosive claim that Donald Trump appears in the Jeffrey Epstein files is true, Axios reported Thursday. In a letter first obtained by Axios, Reps. Stephen Lynch (D-MA)…",
    "link": "https://www.rawstory.com/trump-epstein-files/",
    "timestamp": "2025-06-06T01:49:03Z"
  },
  {
    "title": "Payments firms in limbo; CG Power’s Wolfspeed problem",
    "description": "Happy Friday! Payment aggregators are cutting prices to stay competitive, as a crowded market, shrinking margins and limited innovation squeeze the sector. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/payments-firms-in-limbo-cg-powers-wolfspeed-problem/articleshow/121662361.cms",
    "timestamp": "2025-06-06T01:44:07Z"
  },
  {
    "title": "The implosion of a powerful political alliance: Trump and Musk in their own words",
    "description": "Last Friday, President Donald Trump heaped praise on Elon Musk as the tech billionaire prepared to leave his unorthodox White House job",
    "link": "https://abcnews.go.com/Business/wireStory/implosion-powerful-political-alliance-trump-musk-words-122561273",
    "timestamp": "2025-06-06T01:42:28Z"
  },
  {
    "title": "Can a book help the left rebuild the good life? Ezra Klein’s Abundance is the talk of Washington – and Canberra",
    "description": "Jim Chalmers, Andrew Leigh and Gavin Newsom are among the high-ranking politicians reading and sharing Abundance – a book that urges the left to reset its priorities.",
    "link": "https://theconversation.com/can-a-book-help-the-left-rebuild-the-good-life-ezra-kleins-abundance-is-the-talk-of-washington-and-canberra-256898",
    "timestamp": "2025-06-06T01:41:13Z"
  },
  {
    "title": "Tesla plunges after conflict between Musk and Trump spills into open",
    "description": "The electric vehicle maker's shares dropped 14% on Thursday in New York, the stock’s biggest decline since March 10.",
    "link": "https://www.japantimes.co.jp/business/2025/06/06/markets/tesla-shares-plunge/",
    "timestamp": "2025-06-06T01:41:00Z"
  },
  {
    "title": "How the nasty feud between Trump and Musk unfolded minute by minute",
    "description": "Elon Musk and Donald Trump's friendship unraveled publicly over a tax bill dispute.\nKevin Dietsch; David Becker/Getty Images; Alyssa Powell/BI\nElon Musk and Donald Trump's friendship unraveled publicly over a tax bill dispute.\nMusk criticized Trump's tax bill…",
    "link": "https://biztoc.com/x/4a77fb9b66a57627",
    "timestamp": "2025-06-06T01:40:55Z"
  },
  {
    "title": "How the nasty feud between Trump and Musk unfolded minute by minute",
    "description": "Elon Musk and Donald Trump's friendship unraveled publicly over a tax bill dispute.\nKevin Dietsch; David Becker/Getty Images; Alyssa Powell/BI\nElon Musk and Donald Trump's friendship unraveled publicly over a tax bill dispute.\nMusk criticized Trump's tax bill…",
    "link": "https://biztoc.com/x/4a77fb9b66a57627",
    "timestamp": "2025-06-06T01:40:55Z"
  },
  {
    "title": "Elon Musk says Donald Trump is in the Epstein files — here's the background",
    "description": "The bromance between President Donald Trump and billionaire Elon Musk blown up with an unsubstantiated accusation about the Epstein files. Here's what to know.",
    "link": "https://www.abc.net.au/news/2025-06-06/what-are-the-epstein-files-trump-musk-fight/105384646",
    "timestamp": "2025-06-06T01:40:14Z"
  },
  {
    "title": "Harvard challenges Trump administration over visa restrictions for international students",
    "description": "Harvard University has filed a lawsuit against the Trump administration. The suit challenges a proclamation that suspends new international student visas. Harvard argues the proclamation is retaliatory and violates academic freedom. The university claims inte…",
    "link": "https://economictimes.indiatimes.com/news/international/us/harvard-challenges-trump-administration-over-visa-restrictions-for-international-students/articleshow/121662490.cms",
    "timestamp": "2025-06-06T01:35:21Z"
  },
  {
    "title": "Medicare cuts in play as Senate GOP hones budget bill - Roll Call",
    "description": "As Senate Republicans go deep into reconciliation bill-drafting mode, Medicare is increasingly coming up as a potential pay-for.",
    "link": "https://rollcall.com/2025/06/05/medicare-cuts-in-play-as-senate-gop-hones-budget-bill/",
    "timestamp": "2025-06-06T01:34:16Z"
  },
  {
    "title": "Trump’s travel ban, in five charts",
    "description": "President Donald Trump’s proclamation Wednesday restricting entry into the United States for nationals from a patchwork of 19 countries revives one of his most controversial policies from his first term and targets many of the same countries",
    "link": "https://www.nbcnews.com/data-graphics/five-charts-show-many-people-president-trumps-travel-ban-will-affect-rcna211284",
    "timestamp": "2025-06-06T01:33:52Z"
  },
  {
    "title": "Musk threatens to decommission a key space station link for NASA",
    "description": "Elon Musk is threatening to decommission a capsule used to take astronauts and supplies to the International Space Station for NASA.",
    "link": "https://www.clickondetroit.com/tech/2025/06/05/musk-threatens-to-decommission-a-key-space-station-link-for-nasa/",
    "timestamp": "2025-06-06T01:30:38Z"
  },
  {
    "title": "Trump’s new travel ban will block ‘those in need of real refuge,’ American Jewish Committee says",
    "description": "The stance by one of the world’s largest Jewish organizations comes as some Jewish groups have signaled a growing unease with Trump’s policies.",
    "link": "https://www.jpost.com/diaspora/article-856779",
    "timestamp": "2025-06-06T01:30:35Z"
  },
  {
    "title": "Scott Jennings puts head in trash bin to show how Republicans feel about Trump-Musk feud",
    "description": "CNN commentator Scott Jennings gave a visual display of how the Republican Party felt about President Donald Trump feuding with former DOGE chief Elon Musk.",
    "link": "https://www.foxnews.com/media/scott-jennings-puts-head-trash-bin-show-how-republicans-feel-about-trump-musk-feud",
    "timestamp": "2025-06-06T01:30:19Z"
  },
  {
    "title": "Steve Bannon on Elon Musk's Big Breakup: 'Told You' (Rachael Bade/Politico)",
    "description": "Rachael Bade / Politico:\nSteve Bannon on Elon Musk's Big Breakup: ‘Told You’  —  Musk might have the money, the MAGA godfather says.  But Trump has the movement.  —  Steve Bannon saw it coming.  So forgive him for saying I told you so.  —  In a call with me T…",
    "link": "https://www.memeorandum.com/250605/p143",
    "timestamp": "2025-06-06T01:30:01Z"
  },
  {
    "title": "Tesla shares drop as Elon Musk rows with Donald Trump",
    "description": "Tesla shares sank as Elon Musk and US president Donald Trump’s simmering feud devolved into a public war of words between two of the world’s most powerful people.",
    "link": "https://www.independent.ie/business/world/tesla-shares-drop-as-elon-musk-rows-with-donald-trump/a1641851194.html",
    "timestamp": "2025-06-06T01:30:00Z"
  },
  {
    "title": "‘Like children, Ukraine and Russia might have to fight for a while,’ Donald Trump says",
    "description": "US president Donald Trump said it might be better to let Ukraine and Russia “fight for a while” before pulling them apart and pursuing peace.",
    "link": "https://www.independent.ie/world-news/europe/like-children-ukraine-and-russia-might-have-to-fight-for-a-while-donald-trump-says/a1513146407.html",
    "timestamp": "2025-06-06T01:30:00Z"
  },
  {
    "title": "How the nasty feud between Trump and Musk unfolded minute by minute",
    "description": "The two powerful men's friendship has publicly unraveled. Here's how it happened, minute by minute.",
    "link": "https://www.businessinsider.com/a-timeline-of-how-elon-musks-relationship-with-trump-imploded-2025-6",
    "timestamp": "2025-06-06T01:28:27Z"
  },
  {
    "title": "Ukraine under ongoing Russian missile and drone attack that has wounded at least 3",
    "description": "KYIV, Ukraine — Ukraine was under an ongoing Russian ballistic missile and drone attack early Friday that wounded at least three people, officials said",
    "link": "https://www.nbcnews.com/world/ukraine/ukraine-russian-missile-drone-rcna211358",
    "timestamp": "2025-06-06T01:28:24Z"
  },
  {
    "title": "Ukraine under ongoing Russian missile and drone attack that has wounded at least 3",
    "description": "Ukraine was under an ongoing Russian ballistic missile and drone attack early Friday that wounded at least three people, officials said.",
    "link": "https://nypost.com/2025/06/05/world-news/ukraine-under-ongoing-russian-missile-and-drone-attack-that-has-wounded-at-least-3/",
    "timestamp": "2025-06-06T01:28:12Z"
  },
  {
    "title": "The promise and peril of a crewed Mars mission",
    "description": "A crewed mission to Mars would rank among the most complex and costly undertakings in human history — and US President Donald Trump has vowed to make it a national priority. That political momentum, coupled with SpaceX chief Elon Musk’s zeal, has breathed new…",
    "link": "https://www.digitaljournal.com/world/the-promise-and-peril-of-a-crewed-mars-mission/article",
    "timestamp": "2025-06-06T01:27:20Z"
  },
  {
    "title": "Musk-Trump breakup puts billions in SpaceX contracts at risk, jolting US space program",
    "description": "A feud between Elon Musk and Donald Trump jeopardizes approximately $22 billion in SpaceX government contracts, potentially disrupting U.S. space programs. Musk threatened to decommission SpaceX's Dragon spacecraft after Trump threatened to terminate contract…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/musk-trump-breakup-puts-billions-in-spacex-contracts-at-risk-jolting-us-space-program/articleshow/121662481.cms",
    "timestamp": "2025-06-06T01:26:07Z"
  },
  {
    "title": "Van Hollen: ‘Elon Musk Suddenly Got a Big Dose of Truth Serum’",
    "description": "Thursday on CNN’s “The Arena,” Sen. Chris Van Hollen (D-MD) said that Tesla CEO Elon Musk “suddenly got a big dose of truth serum” while commenting on his disagreement with President Donald Trump. Host Kasie Hunt said, “What we are seeing play out right now b…",
    "link": "https://freerepublic.com/focus/f-news/4321257/posts",
    "timestamp": "2025-06-06T01:24:48Z"
  },
  {
    "title": "Lede of the Day",
    "description": "\"Donald Trump and Elon Musk’s alliance took off like one of SpaceX’s rockets. It was supercharged and soared high. And then it blew up.\" -- Associated Press",
    "link": "https://politicalwire.com/2025/06/05/lede-of-the-day/",
    "timestamp": "2025-06-06T01:22:33Z"
  },
  {
    "title": "NASA Missions Could Be The Biggest Casualty Of The Trump/Musk Feud",
    "description": "The space agency relies on Elon Musk’s rockets for crucial missions to the International Space Station. Who will replace them when competitors are still playing catch up?",
    "link": "https://www.forbes.com/sites/alexknapp/2025/06/05/nasa-missions-could-be-the-biggest-casualty-of-the-trumpmusk-feud/",
    "timestamp": "2025-06-06T01:19:18Z"
  },
  {
    "title": "Musk's question about creating new political party piques Stephen A Smith's interest amid CEO's Trump feud",
    "description": "ESPN's Stephen A. Smith agreed with billionaire Tesla and SpaceX CEO Elon Musk on one thing amid the business mogul's feud with President Donald Trump.",
    "link": "https://www.foxnews.com/sports/musks-question-about-creating-new-political-party-piques-stephen-smiths-interest-amid-ceos-trump-feud",
    "timestamp": "2025-06-06T01:19:07Z"
  },
  {
    "title": "CNBC Daily Open: Trump's relationships can send markets roiling",
    "description": "Developments from the White House are growing more exciting and unpredictable than those 1,000-episode Asian drama serials.\nOn Thursday, \"So much for being Mr. NICE GUY\" Donald Trump reverted to being a nice guy and had a \"very good call,\" in his words, with …",
    "link": "https://biztoc.com/x/3c5ae82ace5a0e75",
    "timestamp": "2025-06-06T01:18:56Z"
  },
  {
    "title": "How The Trump Travel Ban Affects Visitors At Next Year’s World Cup",
    "description": "On Wednesday, June 4, President Donald Trump issued a travel ban on 12 countries. How does this affect visitors at the 2026 World Cup?",
    "link": "https://www.forbes.com/sites/michaellewis/2025/06/05/how-the-trump-travel-ban-affects-visitors-at-next-years-world-cup/",
    "timestamp": "2025-06-06T01:18:25Z"
  },
  {
    "title": "Scott Jennings Dunks Head In Trash Can Upon Mention Of Trump-Musk Feud",
    "description": "Scott Jennings dipped his head into a trash can after host Jake Tapper asked who he would side with in billionaire Elon Musk and President Donald Trump's feud.",
    "link": "https://dailycaller.com/2025/06/05/scott-jennings-dunks-head-in-trash-can-upon-mention-of-trump-musk-feud/",
    "timestamp": "2025-06-06T01:14:15Z"
  },
  {
    "title": "Elon Musk’s wild claims about US President Donald Trump and the Epstein files",
    "description": "An escalating feud between the former administration insider and the president is playing out on social media.",
    "link": "https://7news.com.au/sunrise/elon-musks-wild-claims-about-us-president-donald-trump-and-the-epstein-files-amid-public-feud-c-18940635",
    "timestamp": "2025-06-06T01:12:41Z"
  },
  {
    "title": "Trump’s new travel ban differs from his first term",
    "description": "The policy aims to restrict citizens from certain countries from visiting the United States, with some exceptions",
    "link": "https://www.wmur.com/article/trumps-new-travel-ban-differs-from-his-first-term/64984513",
    "timestamp": "2025-06-06T01:12:26Z"
  },
  {
    "title": "CNBC Daily Open: Trump's relationships can send markets roiling",
    "description": "The White House’s relationships with others — a drama equally or more entertaining than television to some — have concrete effects on the economy and markets.",
    "link": "https://www.cnbc.com/2025/06/06/cnbc-daily-open-trumps-relationships-can-send-markets-roiling.html",
    "timestamp": "2025-06-06T01:12:24Z"
  },
  {
    "title": "Newsmax Host Tears Apart Elon Musk's Trump Claim With Just 1 Simple Question",
    "description": "Carl Higbie called the fractured relationship between the billionaire and the president a \"really crappy scenario.\"",
    "link": "https://www.huffpost.com/entry/newsmax-host-carl-higbie-trump-epstein-files-elon-musk_n_68421f83e4b0fa3ec9de9c12",
    "timestamp": "2025-06-06T01:11:49Z"
  },
  {
    "title": "Jake Tapper Breaks Down Timeline of Elon Musk and Donald Trump’s ‘Friendship Graveyard’ | Video",
    "description": "\"President Trump gave Musk the key to The White House, the ceremonial golden key. Mr. Trump may now be changing the locks,\" the CNN host says\nThe post Jake Tapper Breaks Down Timeline of Elon Musk and Donald Trump’s ‘Friendship Graveyard’ | Video appeared fir…",
    "link": "https://www.thewrap.com/jake-tapper-elon-musk-donald-trump-friendship-graveyard-fight/",
    "timestamp": "2025-06-06T01:11:10Z"
  },
  {
    "title": "The Musk-Trump Divorce Is as Messy as You Thought It Would Be (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nThe Musk-Trump Divorce Is as Messy as You Thought It Would Be  —  The world's richest man and its most powerful leader channel their inner middle schooler in a breakup for the ages.  —  Shamelessness, defined as brazen disregard…",
    "link": "https://www.memeorandum.com/250605/p140",
    "timestamp": "2025-06-06T01:10:03Z"
  },
  {
    "title": "Steve Bannon UNLOADS on Elon Musk: “President Trump empowered him more than anyone’s ever been empowered, and people like me said you’re making a mistake—This is a bad guy—He’s going to turn on us” [VIDEO]",
    "description": "When it comes to sharing his opinions on pretty much any topic, Steve Bannon has never been shy, and today, in defense of his good friend, Donald J. Trump, Bannon eviscerated the world’s wealthiest man, calling him ‘incompetent,” and suggesting Musk had no bu…",
    "link": "https://freerepublic.com/focus/f-bloggers/4321255/posts",
    "timestamp": "2025-06-06T01:09:25Z"
  },
  {
    "title": "Elon Musk lost $34 billion of his net worth in a day from his Trump spat: report",
    "description": "Tech billionaire Elon Musk's flagship businesses took a severe hit amid his public fight with President Donald Trump, as Tesla's stock slid over 14 points, and SpaceX fell almost 5 points. But it's even worse than that, Bloomberg reported, as all of this had …",
    "link": "https://www.rawstory.com/elon-musk-lost-34-billion-of-his-net-worth-in-a-day-from-his-trump-spat-report/",
    "timestamp": "2025-06-06T01:09:21Z"
  },
  {
    "title": "A black eye and online barbs: How the Musk-Trump relationship turned ugly",
    "description": "A relationship that started when one man was shot on live TV ends with a black eye and online insults  — here's how the Trump-Musk partnership reached its ugliest turn.",
    "link": "https://www.abc.net.au/news/2025-06-06/trump-musk-relationship-timeline/105381026",
    "timestamp": "2025-06-06T01:07:18Z"
  },
  {
    "title": "Tesla loses $152 billion in market cap after Musk-Trump spat, biggest hit ever (CNBC)",
    "description": "CNBC:\nTesla loses $152 billion in market cap after Musk-Trump spat, biggest hit ever … Shares of Tesla fell 14% on Thursday as President Donald Trump threatened to pull government contracts for CEO Elon Musk's companies, escalating a war of words over the spe…",
    "link": "https://www.memeorandum.com/250605/p139",
    "timestamp": "2025-06-06T01:05:00Z"
  },
  {
    "title": "Are We Witnessing the Implosion of the World’s Richest Man?",
    "description": "\"Musk may think he has leverage over Trump, but the reality is he has little. Trump doesn’t need his money.\"",
    "link": "https://time.com/7291599/elon-musk-implosion-richest-man/",
    "timestamp": "2025-06-06T01:03:29Z"
  },
  {
    "title": "Tesla shares fall amid public feud between Musk, Trump",
    "description": "WASHINGTON DC: Shares in Tesla plummeted as Tesla CEO Elon Musk and US President Donald Trump fired salvos at each other amid fallout, The Hill reported. Tesla closed with a 14.6 per cent loss as the market closed on Thursday. Trump expressed disappointment o…",
    "link": "https://english.khabarhub.com/2025/06/474269/",
    "timestamp": "2025-06-06T01:02:21Z"
  },
  {
    "title": "Trump administration imposes sanctions on four ICC judges in unprecedented move",
    "description": "The ICC slammed the move, saying it was an attempt to undermine the independence of an international judicial institution.",
    "link": "https://www.japantimes.co.jp/news/2025/06/06/world/crime-legal/trump-icc-judges-sanctions/",
    "timestamp": "2025-06-06T01:02:00Z"
  },
  {
    "title": "At least one Trump supporter will still be getting paid",
    "description": "If you’re a Steelers fan, and you liked Russell Wilson’s production in 2025 would would have liked it better if he spent a lot more time bashing teammates in between conspiracy theories on national podcasts, I have great news for you: After weeks of waiting a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/at-least-one-trump-supporter-will-still-be-getting-paid",
    "timestamp": "2025-06-06T01:00:41Z"
  },
  {
    "title": "Asian shares have tepid start before US jobs data",
    "description": "Asian equities are trading cautiously as investors await US jobs data for clues on Federal Reserve interest rate decisions. Tesla shares plummeted after Elon Musk's spat with Donald Trump, overshadowing optimism from renewed US-China trade talks. Despite Trum…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-have-tepid-start-before-us-jobs-data/articleshow/121662309.cms",
    "timestamp": "2025-06-06T00:59:55Z"
  },
  {
    "title": "Trump weighs 'very harsh' Russia sanctions bill as German chancellor seeks more pressure on Putin",
    "description": "German Chancellor Friedrich Merz discusses his meeting with President Donald Trump and why he asked to increase the pressure on Russia to end its war against Ukraine.",
    "link": "https://www.foxnews.com/media/trump-weighs-very-harsh-russia-sanctions-bill-german-chancellor-seeks-more-pressure-putin",
    "timestamp": "2025-06-06T00:58:18Z"
  },
  {
    "title": "The Trump-Musk meltdown gets messy",
    "description": "Elon Musk and Donald Trump’s relationship spectacularly imploded in a chaotic, very public feud. Once close allies, they traded barbs across rival platforms, with Musk accusing Trump of ingratitude and hinting at links to Epstein. The fallout raises questions…",
    "link": "https://economictimes.indiatimes.com/tech/technology/the-trump-musk-meltdown-gets-messy/articleshow/121662303.cms",
    "timestamp": "2025-06-06T00:58:13Z"
  },
  {
    "title": "Musk threatens to paralyze US space program",
    "description": "SpaceX CEO Elon Musk has claimed that his company “will begin decommissioning its Dragon spacecraft immediately” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618718-musk-spacex-dragon-decommissioning/",
    "timestamp": "2025-06-06T00:57:36Z"
  },
  {
    "title": "Trump-Musk feud escalates: What happened? And what comes next?",
    "description": "Elon Musk suggests Donald Trump should be impeached, as US president says the former DOGE adviser 'went CRAZY'.",
    "link": "https://www.aljazeera.com/news/2025/6/6/trump-musk-feud-escalates-what-happened-and-what-comes-next",
    "timestamp": "2025-06-06T00:57:34Z"
  },
  {
    "title": "Trump-Musk Blowup Could Be Good News For Boeing",
    "description": "From space exploration to defense, the end of the billionaire bromance could pay dividends for America’s largest aerospace company.",
    "link": "https://www.forbes.com/sites/jeremybogaisky/2025/06/05/trump-musk-blowup-could-be-good-news-for-boeing/",
    "timestamp": "2025-06-06T00:57:26Z"
  },
  {
    "title": "‘Cuckoo crew’: NYT columnist roasts Trumpworld’s descent into ‘weirdness’",
    "description": "Longtime New York Times columnist Frank Bruni blasted what he called Trumpworld’s “pageantry of peculiarity” in a blistering opinion piece ripping top administration officials. In the new op-ed out Thursday, Bruni zeroed in on former Secret Service agent turn…",
    "link": "https://www.rawstory.com/trump-administration-2672319178/",
    "timestamp": "2025-06-06T00:57:15Z"
  },
  {
    "title": "Australia is in the firing line of Trump’s looming ‘revenge tax’. It’s a fight we’re unlikely to win",
    "description": "Australian super funds, businesses and even the federal government could face higher costs, with the US on the brink of declaring a new tax war on much of the world.",
    "link": "https://theconversation.com/australia-is-in-the-firing-line-of-trumps-looming-revenge-tax-its-a-fight-were-unlikely-to-win-257961",
    "timestamp": "2025-06-06T00:55:18Z"
  },
  {
    "title": "Our economy is in a coma thanks to climate, Trump and the election. Expect more of the same",
    "description": "The March quarter national accounts were a study in how external events can affect an economy. And when it comes to climate impacts, get used to it.\nThe post Our economy is in a coma thanks to climate, Trump and the election. Expect more of the same appeared …",
    "link": "http://www.crikey.com.au/2025/06/06/economy-growth-donald-trump-cyclone-alfred-election-interest-rates/",
    "timestamp": "2025-06-06T00:54:23Z"
  },
  {
    "title": "Harvard challenges Trump ban on entry of international students",
    "description": "BOSTON: Harvard University said on Thursday (Jun 5) that US President Donald Trump's move to bar foreign nationals seeking to study at the Ivy League school from entering the United States is illegal, and asked a judge to block it immediately pending further …",
    "link": "https://www.channelnewsasia.com/world/harvard-challenges-trump-proclamation-ban-international-students-entry-5168361",
    "timestamp": "2025-06-06T00:53:13Z"
  },
  {
    "title": "Suspect in Boulder attack on pro-Israel rally faces 118 charges",
    "description": "Mohamed Sabry Soliman faces 118 charges, including 28 for attempted murder, following a Molotov cocktail attack on a pro-Israel protest in Boulder, Colorado which injured 15.",
    "link": "https://www.israelnationalnews.com/news/409534",
    "timestamp": "2025-06-06T00:51:08Z"
  },
  {
    "title": "After Putin call, Trump suggests Ukraine, Russia should ‘fight for a while’",
    "description": "The comments, in an Oval Office meeting with German Chancellor Friedrich Merz, were Trump’s clearest indication to date that he was unsure he would be able to quell Russia’s 2022 full-scale invasion of Ukraine.Ukraine and Russia may need to keep fighting, Pre…",
    "link": "https://freerepublic.com/focus/f-news/4321251/posts",
    "timestamp": "2025-06-06T00:49:23Z"
  },
  {
    "title": "Oil Holds Gains After Trump-Xi Call Signals Easing Trade Tension",
    "description": "Oil was steady after advancing Thursday on optimism around easing trade tensions between the US and China following a call between the leaders of the two countries.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-gains-after-trump-xi-call-signals-easing-trade-tension",
    "timestamp": "2025-06-06T00:48:31Z"
  },
  {
    "title": "Trump travel ban shuts out former US allies in Afghanistan",
    "description": "One advocate says more than 200,000 Afghans who helped the U.S. during its occupation remain in the country waiting to relocate.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/06/05/trump-travel-ban-shuts-out-former-us-allies-in-afghanistan",
    "timestamp": "2025-06-06T00:47:59Z"
  },
  {
    "title": "Nervous Republicans Flee Trump-Musk Blast Radius",
    "description": "“The bromance may be dead, but Republicans worry that an escalating feud between President Donald Trump and billionaire Elon Musk could live on, leaving collateral damage in its wake for weeks, months or even years,”",
    "link": "https://politicalwire.com/2025/06/05/nervous-republicans-flee-trump-musk-blast-radius/",
    "timestamp": "2025-06-06T00:46:13Z"
  },
  {
    "title": "Elon Musk just had one of his biggest single-day net worth losses",
    "description": "Elon Musk's net worth has seen a historic loss during his online feud with President Donald Trump.\nKevin Lamarque/POOL/AFP via Getty Images\nElon Musk's latest feud with Trump began with an X post, criticizing the GOP's spending bill.\nTesla shares were down 14…",
    "link": "https://biztoc.com/x/c93f3a5d2d874027",
    "timestamp": "2025-06-06T00:46:03Z"
  }
]