[
  {
    "title": "Biden's decision to run in 2024 'erases virtually everything' he did as president, ABC anchor says",
    "description": "ABC News host Jonathan Karl said that former President Biden's decision to run again virtually erased his presidency, and lamented that no formal meeting occurred to discuss the choice.",
    "link": "https://www.foxnews.com/media/bidens-decision-run-2024-erases-virtually-everything-he-did-president-abc-anchor-says",
    "timestamp": "2025-11-19T16:55:14Z"
  },
  {
    "title": "Donald Trump & Greg Abbott’s Racially Gerrymandered Congressional Maps Struck Down In Texas Federal Court",
    "description": "A three-judge panel, which features a judge he appointed, said nah to those maps, calling them an illegal racial gerrymander, delivering a massive blow to the GOP's cheating plans.",
    "link": "https://hiphopwired.com/2914437/donald-trump-greg-abbott-racially-gerrymandered-maps-federal-judge-reactions/",
    "timestamp": "2025-11-19T16:55:11Z"
  },
  {
    "title": "'Backfire': Analysts highlight 'threat' that could force DOJ to comply with Epstein vote",
    "description": "Congress overwhelmingly passed a measure to compel the Department of Justice to release its investigation files on Jeffrey Epstein, but lawmakers have few tools to enforce their legislation.The House and Senate passed a bill Tuesday calling on Attorney Genera…",
    "link": "https://www.rawstory.com/epstein-files-subpoena-pam-bondi/",
    "timestamp": "2025-11-19T16:55:06Z"
  },
  {
    "title": "House And Senate Clear Epstein Files Bill; Trump Expected To Sign",
    "description": "Congress has cleared the final hurdle to force the release of long-sealed Jeffrey Epstein files, sending the bipartisan bill to President Donald Trump’s desk after unanimous Senate approval. \nEpstein bill heading to Trump's desk after clearing final hurdle in…",
    "link": "https://biztoc.com/x/75aac132c65bda02",
    "timestamp": "2025-11-19T16:54:30Z"
  },
  {
    "title": "Watch live: Trump speaks at U.S.-Saudi Investment Forum",
    "description": "Trump's appearance at the Kennedy Center comes a day after he hosted Crown Prince Mohammed bin Salman of Saudi Arabia at the White House.",
    "link": "https://www.cnbc.com/2025/11/19/watch-live-trump-us-saudi-investment-forum-mbs.html",
    "timestamp": "2025-11-19T16:53:24Z"
  },
  {
    "title": "‘The View’s Sunny Hostin Doubts Trump Will Release Epstein Files Without Redactions: “It’s A Corrupt Presidency”",
    "description": "\"It’s really just a monarchy.\"",
    "link": "https://decider.com/2025/11/19/the-view-sunny-hostin-trump-epstein-files-redactions-corrupt/",
    "timestamp": "2025-11-19T16:52:44Z"
  },
  {
    "title": "White House settles GOAT debate with message after Ronaldo visit",
    "description": "Cristiano Ronaldo’s visit to the White House on Tuesday reignited one of football’s most familiar debates, after an official post from the White House’s X account referred to the Portuguese star and Donald Trump as \"Two GOATs.\"",
    "link": "https://www.101greatgoals.com/football/white-house-settles-goat-debate-ronaldo-visit/",
    "timestamp": "2025-11-19T16:51:27Z"
  },
  {
    "title": "The Education Department is dismantling. Here’s what that means",
    "description": "Trump says the department has been overrun by liberal thinking.",
    "link": "https://www.bostonherald.com/2025/11/19/education-department-dismantling/",
    "timestamp": "2025-11-19T16:51:21Z"
  },
  {
    "title": "Kamala Harris returns to campaign trail in Trump country to back ‘AOC of Tennessee’",
    "description": "Former Vice President Kamala Harris returned to the campaign trail for first time since her 2024 election loss, supporting Tennessee congressional candidate Aftyn Behn in a red district.",
    "link": "https://www.foxnews.com/politics/kamala-harris-returns-campaign-trail-trump-country-back-aoc-tennessee",
    "timestamp": "2025-11-19T16:50:17Z"
  },
  {
    "title": "House Advances Rep. Gill Legislation to Expedite Deportations",
    "description": "The House is one step closer to considering Rep. Brandon Gill’s, R-Texas, major legislative overhaul of how illegal aliens are deported from the United States.... Read More\nThe post House Advances Rep. Gill Legislation to Expedite Deportations appeared first …",
    "link": "https://www.dailysignal.com/2025/11/19/house-advances-rep-gill-legislation-to-expedite-deportations/",
    "timestamp": "2025-11-19T16:50:00Z"
  },
  {
    "title": "Trump Migrant Crackdown Spurs New Wrongful Deportation Claims (Zoe Tillman/Bloomberg)",
    "description": "Zoe Tillman / Bloomberg:\nTrump Migrant Crackdown Spurs New Wrongful Deportation Claims  —  President Donald Trump's administration continues to face claims that US officials are wrongfully deporting migrants in violation of court orders and other legal protec…",
    "link": "https://www.memeorandum.com/251119/p67",
    "timestamp": "2025-11-19T16:50:00Z"
  },
  {
    "title": "Democrat Taunts ‘Nepo’ MAGA Colleague With Brutal 6-Word Jab",
    "description": "Rep. Eric Swalwell (D-Calif.) followed his dig at Rep. Brandon Gill (R-Texas) with a warning for two Trump officials.",
    "link": "https://www.huffpost.com/entry/eric-swalwell-brandon-gill-immigration-nepo-ice_n_691ddd6fe4b073def3ef407c",
    "timestamp": "2025-11-19T16:49:55Z"
  },
  {
    "title": "Billionaire MAGA donor Bill Ackman roasted online after offering dating advice to LGBTQ+ people",
    "description": "Billionaire MAGA donor Bill Ackman has been mocked after offering dating advice to LGBTQ+ people.  The hedge fund manager, who endorsed Donald Trump in the 2024 presidential election, took to X/Twitter on Saturday (15 November) to share his words of wisdom, a…",
    "link": "https://www.thepinknews.com/2025/11/19/billionaire-maga-donor-bill-ackman-roasted-online-after-offering-dating-advice-to-lgbtq-people/",
    "timestamp": "2025-11-19T16:49:14Z"
  },
  {
    "title": "Comey’s lawyers say prosecution pushed by Trump is vindictive and case should be tossed",
    "description": "In trying to have the case dismissed, Comey's lawyers are seeking to convince a judge that the prosecution is vindictive and rooted in Trump's hatred of Comey.",
    "link": "https://www.pbs.org/newshour/politics/comeys-lawyers-say-prosecution-pushed-by-trump-is-vindictive-and-case-should-be-tossed",
    "timestamp": "2025-11-19T16:48:00Z"
  },
  {
    "title": "Trump welcomes Saudi crown prince’s diplomatic comeback",
    "description": "Saudi Crown Prince Mohammed bin Salman told US President Donald Trump that he wants Riyadh to join the Abraham Accords, the framework for the normalisation of ties between Israel and several Muslim states, but also wants to secure a “clear path” to Palestinia…",
    "link": "https://www.bbc.co.uk/programmes/w172zssfmm9xyy6",
    "timestamp": "2025-11-19T16:47:00Z"
  },
  {
    "title": "'People are furious': Experts flag evidence the GOP is 'losing faith' in Trump",
    "description": "Experts are warning that Republicans are \"losing faith\" in President Donald Trump as his approval rating drops to its lowest during his second term. Trump's handling of the economy and affordability, combined with his response to the Epstein file release, has…",
    "link": "https://www.rawstory.com/donald-trump-gop-2674309586/",
    "timestamp": "2025-11-19T16:46:59Z"
  },
  {
    "title": "Judge pushes for resolution in lawsuit over legal access at 'Alligator Alcatraz'",
    "description": "A federal judge in Florida is pushing for a resolution in a lawsuit over detainees' access to attorneys at an immigration detention center in the Everglades",
    "link": "https://abcnews.go.com/US/wireStory/judge-pushes-resolution-lawsuit-legal-access-alligator-alcatraz-127673192",
    "timestamp": "2025-11-19T16:45:55Z"
  },
  {
    "title": "I’m a Celeb salary ‘leak’ reveals how much the stars are getting paid",
    "description": "What this year’s campmates will be taking home following ITV jungle appearance",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/im-a-celeb-2025-salaries-paid-how-much-b2868431.html",
    "timestamp": "2025-11-19T16:45:42Z"
  },
  {
    "title": "Ex-Clinton Cabinet Member Larry Summers Resigns From OpenAI Board Over Epstein Scandal",
    "description": "Former Clinton-era Treasury Secretary Larry Summers resigned from the OpenAI board after emails showed his association with sex offender Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/11/19/larry-summers-resigns-openai-board-epstein-files/",
    "timestamp": "2025-11-19T16:44:23Z"
  },
  {
    "title": "Are the Abraham Accords Still a Thing? | Opinion",
    "description": "Saudi Arabian Crown Prince Mohammed bin Salman was in Washington, D.C. yesterday for a high-profile White House visit. President Donald Trump rolled out the red carpet for \"MBS,\" as he is commonly known, much as MBS himself did for Trump when the commander-in…",
    "link": "https://biztoc.com/x/09b8e0d1aa1ca138",
    "timestamp": "2025-11-19T16:43:54Z"
  },
  {
    "title": "Beware of these political land mines, President Trump",
    "description": "'Why would we want to increase the Chinese student population from the current near 300,000 to 600,000?'",
    "link": "https://www.wnd.com/2025/11/beware-these-political-land-mines-president-trump/",
    "timestamp": "2025-11-19T16:42:34Z"
  },
  {
    "title": "Trump nominates new CFPB director, but White House says agency is still closing",
    "description": "President Trump has nominated Stuart Levenbach as the next director of the Consumer Financial Protection Bureau",
    "link": "https://www.wsbtv.com/news/business/trump-nominates/P3GUGDULNE7CBKBVO6YLO4HYFA/",
    "timestamp": "2025-11-19T16:42:11Z"
  },
  {
    "title": "‘Up Like a Rocket!’ CNN Data Guru Finds Trump’s Foreign Policy Rating Leaves Obama and Bush in the Dust",
    "description": "Bush stood at 36% and Obama scored 37% at this stage of their second terms, leaving Trump “the pack” leader among 21st-century two-term presidents.\nThe post ‘Up Like a Rocket!’ CNN Data Guru Finds Trump’s Foreign Policy Rating Leaves Obama and Bush in the Dus…",
    "link": "https://www.mediaite.com/media/tv/up-like-a-rocket-cnn-data-guru-finds-trumps-foreign-policy-rating-leaves-obama-and-bush-in-the-dust/",
    "timestamp": "2025-11-19T16:41:38Z"
  },
  {
    "title": "Larry Summers Announces He Is Resigning From Board As Epstein Fallout Continues",
    "description": "The documents released by lawmakers revealed the former U.S. Treasury secretary regularly exchanged emails with the late sexual predator.",
    "link": "https://www.huffpost.com/entry/larry-summers-resigns-from-openai-board_n_691ddc33e4b0b763ab8cfaf5",
    "timestamp": "2025-11-19T16:41:36Z"
  },
  {
    "title": "New FIFA rankings set top-seed teams in World Cup tournament draw with Germany edging out Croatia",
    "description": "The top-seeded teams for the Dec. 5 World Cup tournament draw, including Germany but not Croatia, were set Wednesday when FIFA published new rankings the day after four continents completed qualifying. Co-hosts the United States, Canada and Mexico will be joi…",
    "link": "https://sports.yahoo.com/article/fifa-rankings-set-top-seed-163918976.html",
    "timestamp": "2025-11-19T16:39:18Z"
  },
  {
    "title": "Justice Department says full grand jury in Comey case didn’t review copy of final indictment",
    "description": "Comey's lawyers said that lapse was grounds for dismissal of the case.",
    "link": "https://www.bostonherald.com/2025/11/19/justice-department-comey-arguments/",
    "timestamp": "2025-11-19T16:39:03Z"
  },
  {
    "title": "Epstein Effect Comes for Trump as His Approval Rating Hits Record Low",
    "description": "Donald Trump’s approval rating is at an all-time low for his second term, and the president has his old pal Jeffrey Epstein to thank—and those pesky grocery prices. Only 38 percent of Americans approve of Trump’s performance in office, according to a Reuters/…",
    "link": "https://newrepublic.com/post/203387/donald-trump-poll-approval-epstein-economy",
    "timestamp": "2025-11-19T16:38:24Z"
  },
  {
    "title": "Sydney Sweeney’s Transformation Into a Right-Wing Meme Was Not a ‘Total Aesthetic Victory’",
    "description": "X users have made her the face of bigotry on the platform.",
    "link": "https://gizmodo.com/sydney-sweeneys-transformation-into-a-right-wing-meme-was-not-a-total-aesthetic-victory-2000685483",
    "timestamp": "2025-11-19T16:35:42Z"
  },
  {
    "title": "GOP Rep. Burchett: 'Democrats in Congress Will Have to Find Another Shiny Object Down the Road to Kick' After Epstein",
    "description": "During Tuesday's broadcast of Fox News Channel's \"The Ingraham Angle,\" Rep. Tim Burchett (R-TN) blasted the media and expressed his skepticism that the legislation passed by Congress earlier in the day on Jeffrey Epstein would have a meaningful impact on Pres…",
    "link": "https://www.breitbart.com/clips/2025/11/19/gop-rep-burchett-democrats-in-congress-will-have-to-find-another-shiny-object-down-the-road-to-kick-after-epstein/",
    "timestamp": "2025-11-19T16:32:22Z"
  },
  {
    "title": "\"What Has Become Of Us\": Rosie O'Donnell May Have Just Handed Trump A Golden Defamation Lawsuit",
    "description": "\"What Has Become Of Us\": Rosie O'Donnell May Have Just Handed Trump A Golden Defamation Lawsuit\n \nAuthored by Jonthan Turley,\nI have previously expressed skepticism over some defamation cases against the media brought by President Donald Trump under existing …",
    "link": "https://biztoc.com/x/3df3077dfaad2ee0",
    "timestamp": "2025-11-19T16:32:02Z"
  },
  {
    "title": "Jensen Huang is the talk of the town — Trump posts three quotes from the Nvidia CEO just before earnings",
    "description": "President Trump highlighted Nvidia founder Jensen Huang's statements crediting his policies for the US-based manufacturing of advanced AI chips. As Nvidia's earnings approach, investors anticipate answers regarding the substantial AI spending and its funding.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jensen-huang-is-the-talk-of-the-town-trump-posts-three-quotes-from-the-nvidia-ceo-just-before-earnings/articleshow/125441736.cms",
    "timestamp": "2025-11-19T16:30:38Z"
  },
  {
    "title": "US Holding Off On Bitcoin Reserve—Waiting For The World To Move First, Crypto Expert Says",
    "description": "According to industry voices, the US is likely to hold off buying Bitcoin until others move first. That view came from crypto entrepreneur Mike Alfred, who said the government will step in only “when there is enough pressure externally.” Related Reading: Bitc…",
    "link": "https://bitcoinist.com/us-holding-off-on-bitcoin-reserve-waiting-for-the-world-to-move-first-crypto-expert-says/",
    "timestamp": "2025-11-19T16:30:35Z"
  },
  {
    "title": "FACT FOCUS: There’s no proof each strike on alleged drug boats saves 25,000 lives, as Trump claims",
    "description": "The numbers to support Trump’s claim don’t add up, and sometimes don’t exist.",
    "link": "https://www.bostonherald.com/2025/11/19/trump-boat-strikes-fact-check/",
    "timestamp": "2025-11-19T16:29:36Z"
  },
  {
    "title": "The UN Embraces Colonialism: Unpacking the Security Council’s mandate for the U.S. colonial administration of Gaza",
    "description": "The Security Council's backing of the Trump plan for Gaza ignores international law, punishes the Palestinians, and rewards those responsible for genocide.",
    "link": "https://mondoweiss.net/2025/11/the-un-embraces-colonialism-unpacking-the-security-councils-mandate-for-the-u-s-colonial-administration-of-gaza/",
    "timestamp": "2025-11-19T16:27:31Z"
  },
  {
    "title": "Nigeria’s democracy not under threat, Wike replies Turaki",
    "description": "FCT Minister Nyesom Wike refutes claims that Nigeria’s democracy is under threat, blaming the PDP’s internal crisis for calls for US intervention.\n\nRead More: https://punchng.com/nigerias-democracy-not-under-threat-wike-replies-turaki/",
    "link": "https://punchng.com/nigerias-democracy-not-under-threat-wike-replies-turaki/",
    "timestamp": "2025-11-19T16:25:52Z"
  },
  {
    "title": "“Golden Opportunity for a Defamation Action”: Rosie O’Donnell’s Anti-Trump Rant “May Have Crossed the Line”",
    "description": "Onetime popular entertainer Rosie O’Donnell has become a one-person attack machine against President Donald Trump these days. She “seems to spend much of her days in a constant rave about Trump, Republicans, and the demise of the United States from her new ho…",
    "link": "https://freerepublic.com/focus/f-bloggers/4353389/posts",
    "timestamp": "2025-11-19T16:25:50Z"
  },
  {
    "title": "AMD, Cisco and Saudi's Humain launch AI joint venture, land first major customer",
    "description": "The yet-to-be-named joint venture will kick off with a 100-megawatt data center project in Saudi Arabia - the computing capacity of which Humain has contracted to supply generative video startup Luma AI, according to Humain CEO Tareq Amin. The size of the pro…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/amd-cisco-and-saudis-humain-launch-ai-joint-venture-land-first-major-customer/articleshow/125441849.cms",
    "timestamp": "2025-11-19T16:25:36Z"
  },
  {
    "title": "Epstein files bill officially passes in Senate, sending it to Trump",
    "description": "The Epstein files bill got overwhelming support in the House and Senate, with only one lawmaker, Republican Rep. Clay Higgins of Louisiana, voting against it.",
    "link": "https://www.cnbc.com/2025/11/19/epstein-files-trump-bill-congress.html",
    "timestamp": "2025-11-19T16:23:15Z"
  },
  {
    "title": "Trump tariff hikes hit US August imports, delayed data shows",
    "description": "President Donald Trump’s tariff hikes on dozens of trading partners hit US imports in August, according to a Wednesday report delayed by a record government shutdown that ended last week. The 43-day stoppage had paused publications of federal economic data ra…",
    "link": "https://www.digitaljournal.com/world/trump-tariff-hikes-hit-us-august-imports-delayed-data-shows/article",
    "timestamp": "2025-11-19T16:22:32Z"
  },
  {
    "title": "Federal Judges Rule Texas Can't Use New Map In Midterm Elections",
    "description": "This is a really big deal, since it means Texas may not benefit from their lopsided map -- and California's new map will remain. The judges issued a blistering opinion that attacked the incompetence of the plaintiffs lawyers. What was really interesting about…",
    "link": "https://crooksandliars.com/2025/11/federal-judges-rule-texas-cant-use-new-map",
    "timestamp": "2025-11-19T16:22:31Z"
  },
  {
    "title": "WH Response To Trump's 'Quiet, Piggy' Remark Somehow Makes It Worse",
    "description": "The White House responded to reports that Donald J. Trump pointed a finger at Bloomberg reporter Catherine Lucey and said, \"Quiet. Quiet, piggy\" on Air Force One on his way to his gaudy Mar-a-Lago resort in Florida. The reporter asked about the Epstein Files,…",
    "link": "https://crooksandliars.com/2025/11/wh-responds-trumps-piggy-remark-reporter",
    "timestamp": "2025-11-19T16:22:31Z"
  },
  {
    "title": "Exclusive-AMD, Cisco and Saudi's Humain launch AI joint venture, land first major customer",
    "description": "SAN FRANCISCO (Reuters) -Advanced Micro Devices, Cisco Systems and Saudi Arabian artificial intelligence startup Humain are forming a joint venture to build ...",
    "link": "https://finance.yahoo.com/news/exclusive-amd-cisco-saudis-humain-162146934.html",
    "timestamp": "2025-11-19T16:21:46Z"
  },
  {
    "title": "Exclusive-AMD, Cisco and Saudi's Humain launch AI joint venture, land first major customer",
    "description": "SAN FRANCISCO :Advanced Micro Devices, Cisco Systems and Saudi Arabian artificial intelligence startup Humain are forming a joint venture to build data centers in the Middle East and have landed their first customer, CEOs at the three companies told Reuters i…",
    "link": "https://www.channelnewsasia.com/business/exclusive-amd-cisco-and-saudis-humain-launch-ai-joint-venture-land-first-major-customer-5477836",
    "timestamp": "2025-11-19T16:21:46Z"
  },
  {
    "title": "Left-Wing Pollster’s Race Card Trap Against Scott Jennings Fails In Dramatic Fashion",
    "description": "Salem Radio Network host Scott Jennings shut down a left-wing pollster's attempt to play the race card during a panel discussion on CNN Tuesday night.",
    "link": "https://dailycaller.com/2025/11/19/left-wing-pollsters-race-card-trap-against-scott-jennings-fails/",
    "timestamp": "2025-11-19T16:21:07Z"
  },
  {
    "title": "Donald Trump's White House Ballroom Targeted in New Bill",
    "description": "Private donations like those funding Donald Trump's $300 million White House ballroom—and potentially the so-called Arc de Trump—would be restricted for the first time under newly proposed legislation from Democrats.\n\"Stop Ballroom Bribery Act,\" unveiled on T…",
    "link": "https://biztoc.com/x/876e1e82243d34d4",
    "timestamp": "2025-11-19T16:20:51Z"
  },
  {
    "title": "Chris Cillizza Nukes Democrats For Hypocritically Undermining Democracy",
    "description": "Chris Cillizza raged against the Democratic Party for their hypocrisy in claiming they are pro-democracy, while acting undemocratically.",
    "link": "https://dailycaller.com/2025/11/19/chris-cillizza-eviscerates-democrats-hypocritically-undermining-democracy/",
    "timestamp": "2025-11-19T16:20:51Z"
  },
  {
    "title": "What to know about expanded work requirements about to kick in for SNAP",
    "description": "It comes as Trump is portraying SNAP as rife with fraud.",
    "link": "https://www.bostonherald.com/2025/11/19/snap-work-requirements/",
    "timestamp": "2025-11-19T16:20:36Z"
  },
  {
    "title": "What to know about expanded work requirements about to kick in for SNAP",
    "description": "It comes as Trump is portraying SNAP as rife with fraud.",
    "link": "https://www.denverpost.com/2025/11/19/snap-work-requirements/",
    "timestamp": "2025-11-19T16:20:36Z"
  },
  {
    "title": "Pardoned Jan. 6 rioter arrested on child molestation charges, adding to pattern",
    "description": "At a White House event last month, a reporter asked Donald Trump for his reaction to the arrest of a pardoned Jan. 6 rioter after he allegedly threatened to assassinate a congressional leader. “You have thousands of people that we’re dealing with and, you kno…",
    "link": "https://biztoc.com/x/6aa6a4ff85351722",
    "timestamp": "2025-11-19T16:20:31Z"
  },
  {
    "title": "The EU's been accused of caving to big tech on AI regulation. Here's why",
    "description": "Artificial intelligence could be trained using the sensitive health data of European citizens under proposed changes to the EU's rules on the sector.",
    "link": "https://www.abc.net.au/news/2025-11-20/eu-ai-big-tech-proposals/106030486",
    "timestamp": "2025-11-19T16:19:11Z"
  },
  {
    "title": "6 Democrats Tell Military Members to ‘Refuse Illegal Orders’",
    "description": "Republicans are firing back after a group of six Democrat lawmakers created a video telling U.S. military members and the intelligence community they do not need to follow “illegal orders.”   “Like us,... Read More\nThe post 6 Democrats Tell Military Members t…",
    "link": "https://www.dailysignal.com/2025/11/19/6-democrats-tell-military-members-to-refuse-illegal-orders/",
    "timestamp": "2025-11-19T16:16:46Z"
  },
  {
    "title": "The GOP’s Affordability Agenda: Promise to Give People Cash",
    "description": "The GOP’s affordability agenda: Promise to give people cash. There’s talk of another reconciliation bill that could include “tariff dividends,” health-account payments, and other goodies. It may be bad policy but good midterms messaging.",
    "link": "http://nymag.com/intelligencer/article/the-gops-affordability-agenda-promise-to-give-people-cash.html",
    "timestamp": "2025-11-19T16:15:34Z"
  },
  {
    "title": "'Mamdani hates Jewish people, hates Indian population': Trump's son",
    "description": "Eric Trump has made headlines with his scathing remarks towards Zohran Mamdani, the freshly elected Mayor of New York City. Claiming that Mamdani bears ill feelings towards Indian and Jewish citizens, Trump implores the new mayor to concentrate on pressing ci…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/mamdani-hates-jewish-people-hates-indian-population-trumps-son/articleshow/125441722.cms",
    "timestamp": "2025-11-19T16:15:28Z"
  },
  {
    "title": "The White House Intervened On Behalf Of Accused Sex Trafficker Andrew Tate During Federal Investigation",
    "description": "The official who delivered the message, Paul Ingrassia, previously represented the Tate brothers before joining the White House.",
    "link": "https://www.huffpost.com/entry/white-house-andrew-tate-investigation_n_691de277e4b073def3ef455d",
    "timestamp": "2025-11-19T16:13:07Z"
  },
  {
    "title": "Larry Summers’s Epstein Fallout Is Getting Worse",
    "description": "Larry Summers’s newly revealed correspondence with Jeffrey Epstein has forced him to quit OpenAI’s board and lose a few other jobs, and Harvard is launching an investigation, too.",
    "link": "http://nymag.com/intelligencer/article/larry-summers-epstein-fallout-getting-worse-openai-harvard.html",
    "timestamp": "2025-11-19T16:12:34Z"
  },
  {
    "title": "'He sounds exhausted': Trump's mental health reportedly so bad 'MAGA diehards' speaking up",
    "description": "President Donald Trump's MRI and rumors about his health are what pushed the Epstein vote in Congress, an analyst reports Wednesday. After blocking the release of the Epstein files for months, Trump suddenly reversed course Sunday — despite his attempts to tr…",
    "link": "https://www.rawstory.com/donald-trump-health-2674309465/",
    "timestamp": "2025-11-19T16:11:39Z"
  },
  {
    "title": "ICE Raided My Son’s Daycare to Abduct a Teacher. This Kind of Trauma Lasts.",
    "description": "Children in Illinois have suffered months of systematic abuse by federal agents enacting Trump's immigration raids.",
    "link": "https://truthout.org/articles/ice-raided-my-sons-daycare-to-abduct-a-teacher-this-kind-of-trauma-lasts/",
    "timestamp": "2025-11-19T16:10:52Z"
  },
  {
    "title": "Kimberly Guilfoyle’s first message: Greece is a reliable ally and vital partner – Thank you for the warm welcome, I am here to work hard",
    "description": "She identifies as major challenges “the expansion of our energy cooperation, the strengthening of regional security, the deepening of trade and investment ties, and the opening of new paths for innovation”\nThe post Kimberly Guilfoyle’s first message: Greece i…",
    "link": "https://en.protothema.gr/2025/11/19/kimberly-guilfoyles-first-message-greece-is-a-reliable-ally-and-vital-partner-thank-you-for-the-warm-welcome-i-am-here-to-work-hard/",
    "timestamp": "2025-11-19T16:10:00Z"
  },
  {
    "title": "Trump Says He Thought Epstein Was a 'Sick Pervert'",
    "description": "Donald Trump’s firm control of Washington showed signs of weakening Tuesday as Congress voted to compel the Justice Department to release its files on sex trafficker Jeffrey Epstein, whose earlier ties to the president have been the subject of intense scrutin…",
    "link": "https://biztoc.com/x/d021a63f584c12a4",
    "timestamp": "2025-11-19T16:09:14Z"
  },
  {
    "title": "Rubio orders restitution for hundreds of staffers denied promotions under Biden DEI rule",
    "description": "State Department provides restitution to 295 employees denied promotions under Biden's DEI standards, offering pay increases and commendations under Rubio.",
    "link": "https://www.foxnews.com/politics/rubio-orders-restitution-hundreds-staffers-denied-promotions-under-biden-dei-rule",
    "timestamp": "2025-11-19T16:08:37Z"
  },
  {
    "title": "Putin’s Unlikely Envoy to Washington",
    "description": "Kirill Dmitriev is a prominent purveyor of the Kremlin’s line—but real power may lie elsewhere.",
    "link": "http://foreignpolicy.com/2025/11/19/kirill-dmitriev-russia-envoy-putin-ukraine-witkoff/",
    "timestamp": "2025-11-19T16:05:27Z"
  },
  {
    "title": "White House Responds to Donald Trump's 'Quiet, Piggy' Statement, Reporter Seemingly Identified as Her Publication Also Releases Statement",
    "description": "The White House is responding to Donald Trump‘s “Quiet, Piggy” statement, and the reporter in question has seemingly been identified. If you don’t know, the 79-year-old POTUS was answering questions from reporters on a flight. It seems from the video that two…",
    "link": "https://www.justjared.com/2025/11/19/white-house-responds-to-donald-trumps-quiet-piggy-statement-reporter-seemingly-identified-as-her-publication-also-releases-statement/",
    "timestamp": "2025-11-19T16:05:05Z"
  },
  {
    "title": "U.S. trade deficit drops 24% in August as Trump's tariffs reduce imports",
    "description": "The U.S. trade deficit fell by nearly 24% in August as President Donald Trump’s sweeping global tariffs pushed imports lower",
    "link": "https://abcnews.go.com/US/wireStory/us-trade-deficit-drops-24-august-trumps-tariffs-127670770",
    "timestamp": "2025-11-19T16:04:51Z"
  },
  {
    "title": "Axios: US Drafting Secret Plan to End Ukraine War",
    "description": "The U.S. is secretly working with Russia on a new plan to end the war in Ukraine, according to an Axios report Tuesday, which says the Trump administration has been quietly negotiating a 28-point proposal behind the scenes. The initiative — described by U.S. …",
    "link": "https://freerepublic.com/focus/f-bloggers/4353384/posts",
    "timestamp": "2025-11-19T16:04:27Z"
  },
  {
    "title": "'Kiss of death': Professor says Trump is giving Democrats a big blessing for midterms",
    "description": "An endorsement from Donald Trump could be a \"kiss of death\" for Republican candidates in the midterms next year. Stanford professor David Brady believes the seal of approval from the president could make no difference or even impede candidates from securing t…",
    "link": "https://www.rawstory.com/donald-trump-2026-midterms-kiss/",
    "timestamp": "2025-11-19T16:02:20Z"
  },
  {
    "title": "Tiny kingdom becomes first African nation to receive breakthrough HIV shot offering near-total protection",
    "description": "Eswatini is the country with the highest incidence of HIV in the world.",
    "link": "https://fortune.com/2025/11/19/eswatini-african-nation-hiv-aids-shot-vaccine/",
    "timestamp": "2025-11-19T16:01:09Z"
  },
  {
    "title": "Is The Washington Post Becoming Libertarian?",
    "description": "The Washington Post opinion editor Adam O’Neal outlines his vision for a more classically liberal editorial voice, examines how both parties turned against free speech and free markets, and explains why the paper is ending political endorsements.",
    "link": "https://reason.com/podcast/2025/11/19/is-the-washington-post-becoming-libertarian/",
    "timestamp": "2025-11-19T16:00:49Z"
  },
  {
    "title": "Sedition? Six Congressional Democrats Urge US Troops to Defy Orders From Trump",
    "description": "\"Democrat lawmakers are now openly calling for insurrection.\"\nThe post Sedition? Six Congressional Democrats Urge US Troops to Defy Orders From Trump first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/sedition-six-congressional-democrats-urge-us-troops-to-defy-orders-from-trump/",
    "timestamp": "2025-11-19T16:00:40Z"
  },
  {
    "title": "This Is the Best Late Night Joke About Trump Losing the Epstein Files Battle",
    "description": "The Epstein files are being released and one show captured the national excitement",
    "link": "https://www.cracked.com/article_49198_this-is-the-best-late-night-joke-about-trump-losing-the-epstein-files-battle.html",
    "timestamp": "2025-11-19T16:00:00Z"
  },
  {
    "title": "Washington Post Exposes Secret Cabal That Plans to Make MAGA Permanent",
    "description": "Would you be surprised to learn that a small group of plutocrats has plotted to perpetuate MAGA, subvert democracy, and maintain their control over our nation? I was not. I expected that this was happening, that Trump was the dummy manipulated by right-wing e…",
    "link": "https://dianeravitch.net/2025/11/19/washington-post-exposes-secret-cabal-that-plans-to-make-maga-permanent/",
    "timestamp": "2025-11-19T16:00:00Z"
  },
  {
    "title": "Border Patrol leaders leave Chicago—for now",
    "description": "GTFO, Bovino After weeks of smashing car windows, grabbing people from street corners based on “how they look,” and tear-gassing families on residential streets, Border Patrol commander Greg Bovino and his gang of masked brutes have packed their bags and head…",
    "link": "http://chicagoreader.com/news/make-it-make-sense/border-patrol-homeless-shelter-broadview/",
    "timestamp": "2025-11-19T16:00:00Z"
  },
  {
    "title": "How Donald Trump Lost Control of the Epstein Spin Cycle",
    "description": "Donald Trump has spent years benefiting from the QAnon's Jeffrey Epstein obsession. That’s all changing.",
    "link": "https://www.wired.com/story/how-donald-trump-lost-control-of-the-epstein-spin-cycle/",
    "timestamp": "2025-11-19T16:00:00Z"
  },
  {
    "title": "Gunmen attack church in Nigeria, killing two and kidnapping others",
    "description": "Gunmen attack church in Nigeria, killing two and kidnapping pastor and worshippers in the latest incident of escalating violence against Christians.",
    "link": "https://www.foxnews.com/world/gunmen-attack-church-nigeria-killing-two-kidnapping-others",
    "timestamp": "2025-11-19T15:59:23Z"
  },
  {
    "title": "Gunmen attack church in Nigeria, killing two and kidnapping others",
    "description": "Incident comes days after 25 girls were kidnapped from a boarding school in country’s northwest",
    "link": "https://www.irishtimes.com/world/africa/2025/11/19/gunmen-attack-church-in-nigeria-killing-two-and-kidnapping-others/",
    "timestamp": "2025-11-19T15:59:21Z"
  },
  {
    "title": "Confronted with Epstein question, Trump takes aim at ABC’s broadcast license",
    "description": "By any fair measure, Donald Trump’s Oval Office event with Crown Prince Mohammed bin Salman, Saudi Arabia’s de facto ruler, was a disaster. Over the course of roughly 40 minutes, the American president celebrated Saudi Arabia’s horrific human rights record, e…",
    "link": "https://biztoc.com/x/1ee7875361a2719c",
    "timestamp": "2025-11-19T15:58:08Z"
  },
  {
    "title": "Watch: Elon Musk, Jensen Huang talk AI at U.S.-Saudi Investment Forum",
    "description": "The event comes a day after President Donald Trump met with Saudi Crown Prince Mohammed bin Salman at the White House.",
    "link": "https://biztoc.com/x/331ae55cc6222c6c",
    "timestamp": "2025-11-19T15:57:52Z"
  },
  {
    "title": "LIV Golf Looks Ahead To 2026 With New Signings And Major Format Changes",
    "description": "LIV Golf makes two large signings in player Victor Perez and reporter Henni Zuel along with changes to the schedule and the format.",
    "link": "https://www.forbes.com/sites/break80/2025/11/19/liv-golf-looks-ahead-to-2026-with-new-signings-and-major-format-changes/",
    "timestamp": "2025-11-19T15:57:05Z"
  },
  {
    "title": "Watch: Elon Musk, Jensen Huang talk AI at U.S.-Saudi Investment Forum",
    "description": "The event comes a day after President Donald Trump met with Saudi Crown Prince Mohammed bin Salman at the White House.",
    "link": "https://www.cnbc.com/2025/11/19/watch-elon-musk-jensen-huang-talk-ai-at-us-saudi-investment-forum.html",
    "timestamp": "2025-11-19T15:56:15Z"
  },
  {
    "title": "MAGA’s conspiracy theory fails to distract from Epstein",
    "description": "A conspiracy theory centering on Trump's attempted assassin fails to distract from the Epstein files",
    "link": "https://www.salon.com/2025/11/19/maga-concocts-a-conspiracy-theory-to-distract-from-epstein/",
    "timestamp": "2025-11-19T15:55:51Z"
  },
  {
    "title": "Pardoned Jan. 6 Rioter Punched in the Face During Racist March",
    "description": "A January 6 rioter decided to lead a hate march Tuesday in Dearborn, Michigan, a city with a sizable Muslim and Arab American populace, and got punched in the face. Jake Lang, who was pardoned by Donald Trump while facing 11 charges related to his actions at …",
    "link": "https://newrepublic.com/post/203383/pardoned-january-6-rioter-punched-face-racist-march-dearborn",
    "timestamp": "2025-11-19T15:55:17Z"
  },
  {
    "title": "Dismissal of Trump’s CNN Lawsuit Affirmed by Appeals Court: Using ‘Big Lie’ Not Defamatory",
    "description": "A federal appeals court upheld the dismissal of President Donald Trump's defamation lawsuit against CNN, specifically noting that the network's use of the phrase \"Big Lie\" to describe Trump was not a false statement of fact.\nThe post Dismissal of Trump’s CNN …",
    "link": "https://www.mediaite.com/lawcrime/dismissal-of-trumps-cnn-lawsuit-affirmed-by-appeals-court-using-big-lie-not-defamatory/",
    "timestamp": "2025-11-19T15:54:38Z"
  },
  {
    "title": "BBC Boss Tim Davie Apologizes To Staff For “Unsettling” Period Amid Trump Chaos",
    "description": "EXCLUSIVE: Tim Davie has apologized to BBC staff after a chaotic period at the UK national broadcaster. In an email to staff seen by Deadline, the director general said he recognized that it had been a time of upheaval following his resignation, which came af…",
    "link": "http://deadline.com/2025/11/bbc-tim-davie-apology-staff-trump-chaos-1236623441/",
    "timestamp": "2025-11-19T15:54:12Z"
  },
  {
    "title": "Trump’s Rage at Reporters Echoes a Stressed TV Dad Who Can’t Pay the Bills",
    "description": "Trump’s outbursts at reporters aren’t strength—they’re strain. After years in a friendly media bubble, he’s become deconditioned and unable to handle real questions.\nThe post Trump’s Rage at Reporters Echoes a Stressed TV Dad Who Can’t Pay the Bills first app…",
    "link": "https://www.mediaite.com/opinion/trumps-rage-at-reporters-echoes-a-stressed-tv-dad-who-cant-pay-the-bills/",
    "timestamp": "2025-11-19T15:53:53Z"
  },
  {
    "title": "WATCH: U.S. House fails to censure Stacey Plaskett over texting Jeffrey Epstein in hearing",
    "description": "Democrat claims taking advice in real time from convicted sex offender involved 'due diligence'",
    "link": "https://www.wnd.com/2025/11/watch-u-s-house-fails-censure-stacey-plaskett/",
    "timestamp": "2025-11-19T15:52:46Z"
  },
  {
    "title": "TRUMP HUMILIATION",
    "description": "No one would have believed as recently as this past weekend that a bill requiring the Justice Department to release files related to the convicted sex offender would race through the GOP Congress with only one vote against it by Tuesday evening.",
    "link": "https://www.cnn.com/2025/11/19/politics/trump-epstein-files-release-house-senate-analysis",
    "timestamp": "2025-11-19T15:49:37Z"
  },
  {
    "title": "Democratic Senators Demand DOJ Lead ‘Non-Biased’ Review of Potential WBD Deal Over Fears of Trump’s Political Favoritism",
    "description": "Sens. Elizabeth Warren, Bernie Sanders and Richard Blumenthal also warn that any deal for Warner Bros. Discovery could raise consumers’ television costs\nThe post Democratic Senators Demand DOJ Lead ‘Non-Biased’ Review of Potential WBD Deal Over Fears of Trump…",
    "link": "https://www.thewrap.com/senators-letter-doj-wbd-deal-trump-favoritism-paramount/",
    "timestamp": "2025-11-19T15:47:32Z"
  },
  {
    "title": "U.S. trade deficit drops 24% in August as Trump’s tariffs reduce imports",
    "description": "Imports fell in August from July when U.S. companies were stocking up on foreign products before Trump finalized tariffs.",
    "link": "https://www.bostonherald.com/2025/11/19/us-economy-trade-deficit-trump/",
    "timestamp": "2025-11-19T15:47:29Z"
  },
  {
    "title": "Texas Republicans in some counties are pushing to count ballots by hand in next year's primary",
    "description": "Critics warn the move, which requires more time, money and staffers, could lead to confusion, errors and delayed results in key contests in Texas in March.",
    "link": "https://www.nbcnews.com/politics/elections/texas-republicans-counties-are-pushing-count-ballots-hand-years-primar-rcna239342",
    "timestamp": "2025-11-19T15:45:36Z"
  },
  {
    "title": "Trump Narrows His Support for H-1B White-Collar Outsourcing",
    "description": "President Donald Trump and his administration are narrowing their defense of the huge H-1B corporate outsourcing program, which is used by many corporate executives to hire many foreign graduates for a wide range of jobs.\nThe post Trump Narrows His Support fo…",
    "link": "https://www.breitbart.com/economy/2025/11/19/trump-narrows-his-support-for-h-1b-white-collar-outsourcing/",
    "timestamp": "2025-11-19T15:43:52Z"
  },
  {
    "title": "They thought they were in court for a routine immigration hearing, but walked into a deportation trap",
    "description": "In a court system with a backlog of about 3.8 million asylum cases, families have been torn apart and lives upended. Due process seemingly is an afterthought.",
    "link": "https://www.pbs.org/newshour/nation/they-thought-they-were-in-court-for-a-routine-immigration-hearing-but-walked-into-a-deportation-trap",
    "timestamp": "2025-11-19T15:42:58Z"
  },
  {
    "title": "Makeup Icon Jeffree Star Faces Severe Backlash For Comments On Pro-Trans Parents",
    "description": "\"Cisgender people have absolutely no place talking about transgender issues.\"",
    "link": "https://www.boredpanda.com/jeffree-star-faces-backlash-for-comments-on-pro-trans-parents/",
    "timestamp": "2025-11-19T15:41:42Z"
  },
  {
    "title": "Trump’s History With Jeffrey Epstein: Here’s The Full Timeline",
    "description": "Congress voted Tuesday to force the Justice Department to release its investigatory files related to Jeffrey Epstein.",
    "link": "https://www.forbes.com/sites/saradorn/2025/11/19/trumps-history-with-jeffrey-epstein-heres-the-full-timeline/",
    "timestamp": "2025-11-19T15:41:27Z"
  },
  {
    "title": "So We Have A President Who Called A Female Journalist \"Piggy\"",
    "description": "So We Have A President Who Called A Female Journalist \"Piggy\"scarymommy.com",
    "link": "https://www.scarymommy.com/lifestyle/president-called-female-journalist-piggy",
    "timestamp": "2025-11-19T15:39:58Z"
  },
  {
    "title": "Pope Leo, Catholic bishops come out against 'vilification' of immigrants in U.S.",
    "description": "Pope Leo has come out in support of a rare special message released by the U.S. Conference of Catholic Bishops in recent days that lamented a \"climate of fear and anxiety around questions of profiling and immigration enforcement.\"",
    "link": "https://www.cbc.ca/news/world/pope-leo-us-catholic-bishops-migrants-9.6984223",
    "timestamp": "2025-11-19T15:39:10Z"
  },
  {
    "title": "‘Golden opportunity for a defamation action’: Rosie O’Donnell’s anti-Trump rant ‘may have crossed the line,’ says Turley",
    "description": "'She states as a fact that the president is an 'adjudicated rapist' and settled child abuse cases'",
    "link": "https://www.wnd.com/2025/11/golden-opportunity-defamation-action-rosie-odonnells-anti-trump/",
    "timestamp": "2025-11-19T15:39:08Z"
  }
]