[
  {
    "title": "Trump-Musk Feud Fuels Record Truth Social Traffic, X User Spike",
    "description": "Truth Social's traffic surged more than 256% on June 5 amid Elon Musk accusing President Donald Trump of being named in the Epstein files\nThe post Trump-Musk Feud Fuels Record Truth Social Traffic, X User Spike appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-elon-musk-feud-record-truth-social-x-traffic/",
    "timestamp": "2025-06-09T15:11:06Z"
  },
  {
    "title": "Democrats are drawing closer to the crypto industry despite Trump divisions",
    "description": "The crypto industry is seeing growing support from the Democratic Party, though it's far from unanimous",
    "link": "https://abcnews.go.com/Business/wireStory/democrats-drawing-closer-crypto-industry-despite-trump-divisions-122646180",
    "timestamp": "2025-06-09T15:10:20Z"
  },
  {
    "title": "The D Brief: POTUS turns Guard on LA protestors; Russia’s record-breaking strike; Fiber-drone photos; NATO-summit preview; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/06/the-d-brief-june-09-2025/405914/",
    "timestamp": "2025-06-09T15:10:04Z"
  },
  {
    "title": "Map Shows Locations Where Anti-ICE Protests Are Planned Amid LA Riots",
    "description": "Protestors in over a dozen cities are set to demonstrate their solidarity with those arrested by federal agents in California over the weekend.",
    "link": "https://www.newsweek.com/map-anti-ice-protests-la-riots-trump-administration-2082871",
    "timestamp": "2025-06-09T15:09:30Z"
  },
  {
    "title": "Elon Musk Back to Hailing Trump, Just Days After Accusing Him of Being in Epstein Files",
    "description": "Elon Musk appeared to reverse course over the weekend, sharing support for President Donald Trump after accusing him days earlier of covering up alleged ties to Jeffrey Epstein’s sex trafficking schemes.\nThe post Elon Musk Back to Hailing Trump, Just Days Aft…",
    "link": "https://www.mediaite.com/politics/trump/elon-musk-back-to-hailing-trump-just-days-after-accusing-him-of-being-in-epstein-files/",
    "timestamp": "2025-06-09T15:08:41Z"
  },
  {
    "title": "Rioters smash windows at LAPD headquarters as anti-ICE agitators clash with authorities",
    "description": "Anti-immigration protests in Los Angeles turn violent with property damage as Gov. Gavin Newsom criticizes President Donald Trump's National Guard deployment while Republicans defend law enforcement actions.",
    "link": "https://www.foxnews.com/us/rioters-smash-windows-lapd-headquarters-anti-ice-agitators-clash-authorities",
    "timestamp": "2025-06-09T15:07:58Z"
  },
  {
    "title": "There's a record $700 billion of homes for sale in the US. Here's why the market is still frozen.",
    "description": "Blame stubbornly high mortgage rates and lingering economic anxieties over Trump policies for US housing-market gridlock.",
    "link": "https://www.businessinsider.com/us-housing-market-buying-purchase-activity-trends-mortgage-rates-inventory-2025-6",
    "timestamp": "2025-06-09T15:07:35Z"
  },
  {
    "title": "Legacy Media Deems LA ICE Riots Are Merely ‘Protests’ As Rioters Take Torch To City",
    "description": "Legacy media outlets framed violent unrest in Los Angeles over Immigration and Customs Enforcement raids as mere \"protests.\"",
    "link": "https://dailycaller.com/2025/06/09/legacy-media-deems-la-ice-riots-protests-rioters-torch-city/",
    "timestamp": "2025-06-09T15:07:18Z"
  },
  {
    "title": "Elon Musk vs. Donald Trump | June 9 editorial cartoons",
    "description": "(Image credit: Clay Jones / Copyright 2025 Claytoonz)\n(Image credit: Bill Bramhall / Copyright 2025 Tribune Content Agency)\n(Image credit: R.J. Matson / Copyright 2025 Cagle Cartoons, Inc.)\n(Image credit: Dave Whamond / Copyright 2025 Cagle Cartoons, Inc.)\n(I…",
    "link": "https://biztoc.com/x/f06baaba7a78dbcb",
    "timestamp": "2025-06-09T15:06:10Z"
  },
  {
    "title": "Inflation fears receded in May as Trump eased some tariff threats, New York Fed survey shows",
    "description": "Americans grew less fearful about inflation in May as President Donald Trump backed off the most severe of his tariff proposals, according to a New York Federal Reserve survey Monday.\nThe central bank's Survey of Consumer Expectations showed that the one-year…",
    "link": "https://biztoc.com/x/94edeea3c0da80aa",
    "timestamp": "2025-06-09T15:06:04Z"
  },
  {
    "title": "California Republicans React to Donald Trump Deploying National Guard",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCalifornia Republican lawmakers are largely backing President Donald Trump's decision to send the National Guard into Los Angeles amid immigration protests, with Representative Kevin Kiley telling Newsweek tha…",
    "link": "https://biztoc.com/x/226924c679faa4b4",
    "timestamp": "2025-06-09T15:06:04Z"
  },
  {
    "title": "With Tanks Heading to DC, Call by 'Dictator' Trump to 'Bring in the Troops' Spurs Fear of Wider Repression",
    "description": "U.S. President Donald Trump's call late Sunday to \"bring in the troops\" to crush protests in Los Angeles—along with the release of video footage showing the arrival of tanks in the nation's capital ahead of a dictatorial military parade—intensified fears that…",
    "link": "https://www.commondreams.org/news/trump-national-guard-los-angeles",
    "timestamp": "2025-06-09T15:04:56Z"
  },
  {
    "title": "Maxine Waters taunts armed agents after feds slam door on her during LA riots: 'You better shoot straight'",
    "description": "86-year-old congresswoman tells armed National Guard \"if you shoot me, you better shoot straight\" during confrontation.",
    "link": "https://www.foxnews.com/politics/maxine-waters-taunts-armed-agents-after-feds-slam-door-her-face",
    "timestamp": "2025-06-09T15:04:34Z"
  },
  {
    "title": "Trump huddles with military brass at Camp David amid violent immigration protests in Los Angeles",
    "description": "President Donald Trump, his top Cabinet officials and military leaders huddled at Camp David amid the Los Angeles riots over ICE raids, Iran negotiations and China trade talks.",
    "link": "https://www.foxnews.com/politics/trump-huddles-military-brass-camp-david-amid-violent-immigration-protests-los-angeles",
    "timestamp": "2025-06-09T15:04:30Z"
  },
  {
    "title": "‘If there was a vote for friendliest country, Ireland would win,’ says Rosie O’Donnell as she announces new stand-up show in Dublin",
    "description": "Hollywood actress Rosie O’Donnell, who moved from the United States to Ireland earlier this year due to the election of president Donald Trump, has said Late Late Show host Patrick Kielty gave her the green card to a happy life here.",
    "link": "https://www.independent.ie/style/celebrity/if-there-was-a-vote-for-friendliest-country-ireland-would-win-says-rosie-odonnell-as-she-announces-new-stand-up-show-in-dublin/a282856337.html",
    "timestamp": "2025-06-09T15:03:41Z"
  },
  {
    "title": "Trump Charts New Territory in Deploying Troops",
    "description": "“President Donald Trump’s order to deploy 2,000 California National Guard troops to Los Angeles appears unprecedented, relying on an unorthodox use of a law aimed at quelling serious domestic unrest or an attack on the",
    "link": "https://politicalwire.com/2025/06/09/trump-charts-new-territory-in-deploying-troops/",
    "timestamp": "2025-06-09T15:02:59Z"
  },
  {
    "title": "Protest in Los Angeles today against Donald Trump latest updates: Tension escalates, ban on travel to USA takes effect",
    "description": "Protests in Los Angeles, a sprawling city of 4 million people, were centered in several blocks of downtown.",
    "link": "https://economictimes.indiatimes.com/news/international/us/protest-in-los-angeles-today-against-donald-trump-latest-updates-tension-escalates-ban-on-travel-to-usa-takes-effect/articleshow/121732114.cms",
    "timestamp": "2025-06-09T15:02:28Z"
  },
  {
    "title": "Verified X account calls for criminal sabotage against ICE — panics when all hell breaks loose…",
    "description": "For years, the popular “LA Scanner” account on X presented itself as a simple, neutral feed with just scanner updates, crime alerts, and public safety notices. But now, the left-wing mask has finally slipped. And what do we see underneath? A raging left-wing …",
    "link": "https://freerepublic.com/focus/f-bloggers/4321881/posts",
    "timestamp": "2025-06-09T15:01:41Z"
  },
  {
    "title": "NIH scientists publish declaration criticizing Trump's deep cuts in public health research",
    "description": "President Donald Trump’s National Institutes of Health director says some employees’ critical letter to him has “fundamental misconceptions about the policy directions the NIH has taken.”.",
    "link": "https://www.news4jax.com/news/politics/2025/06/09/nih-scientists-go-public-to-criticize-trumps-deep-cuts-in-public-health-research/",
    "timestamp": "2025-06-09T15:00:32Z"
  },
  {
    "title": "Inflation fears receded in May as Trump eased some tariff threats, New York Fed survey shows",
    "description": "The one-year inflation outlook took a substantial dip, down to 3.2% — a 0.4 percentage point decrease from April.",
    "link": "https://www.cnbc.com/2025/06/09/inflation-fears-receded-in-may-as-trump-eased-some-tariff-threats-new-york-fed-survey-shows.html",
    "timestamp": "2025-06-09T15:00:31Z"
  },
  {
    "title": "Elon Musk Suggests New Political Party Amid Break-up With Trump",
    "description": "Elon Musk, the billionaire CEO of Tesla and SpaceX, has proposed creating a new political party called the “America Party,” marking a sharp shift in strategy amid his breakup with current ruler, Donald Trump.  The tech entrepreneur’s political shift comes as …",
    "link": "https://www.shtfplan.com/member-exclusive/elon-musk-suggests-new-political-party-amid-break-up-with-trump",
    "timestamp": "2025-06-09T15:00:09Z"
  },
  {
    "title": "Finneas Says He Was Tear-Gassed at Los Angeles ICE Protest...",
    "description": "\"Tear-gassed almost immediately at the very peaceful protest downtown — they’re inciting this,” the musician and producer wrote on his Instagram story Sunday.",
    "link": "http://www.hollywoodreporter.com/news/music-news/finneas-tear-gassed-los-angeles-ice-protest-1236259854/",
    "timestamp": "2025-06-09T15:00:03Z"
  },
  {
    "title": "DARES HOMAN TO ARREST HIM...",
    "description": "The National Guard was deployed to Los Angeles County as anti-ICE protests escalated over the weekend. The unrest is centered in the city of Paramount, California, where rioters clashed with federal authorities, including Immigration and Customs Enforcement (…",
    "link": "https://www.foxnews.com/live-news/anti-ice-protest-declared-unlawful-assembly-newsom-dares-homan-to-arrest-him",
    "timestamp": "2025-06-09T15:00:03Z"
  },
  {
    "title": "‘Unfathomable’: Seth Rogen Torches Lawmakers Threatening Cuts to Medicaid",
    "description": "Seth Rogen and his wife, Lauren Miller Rogen, are raising alarms about health care cuts in Donald Trump's \"Big Beautiful Bill.\"",
    "link": "http://www.rollingstone.com/politics/politics-features/seth-rogen-medicaid-cuts-alzheimers-1235358869/",
    "timestamp": "2025-06-09T15:00:00Z"
  },
  {
    "title": "Supplier Astemo Seeks To Deal With Automotive Industry’s Future",
    "description": "Japan's Astemo auto supplier and its U.S. unit, Astemo Americas, are working to deal with continuing industry changes, including tariffs.",
    "link": "https://www.forbes.com/sites/billkoenig/2025/06/09/supplier-astemo-seeks-to-deal-with-automotive-industrys-future/",
    "timestamp": "2025-06-09T15:00:00Z"
  },
  {
    "title": "U.S. and China Officials Meet in London for Trade Talks",
    "description": "U.S. and Chinese delegations have arrived in the U.K. for talks aimed at patching up a fraying truce in an ongoing trade war between the world's two biggest economies. The US team leby The U.S. team led by Treasury Secretary Scott Bessent, Commerce Secretary …",
    "link": "https://oilprice.com/Geopolitics/International/US-and-China-Officials-Meet-in-London-for-Trade-Talks.html",
    "timestamp": "2025-06-09T15:00:00Z"
  },
  {
    "title": "Elon Musk vs. Donald Trump | June 9 editorial cartoons",
    "description": "Monday's political cartoons include DOGE cuts stopping science, MAGA fleeing monsters, and more Elon Musk vs. Donald Trump.",
    "link": "https://theweek.com/cartoons/science-cut-short-june-9-editorial-cartoons",
    "timestamp": "2025-06-09T15:00:00Z"
  },
  {
    "title": "California Lt. Governor says Los Angeles riots are 'generated by Donald Trump'",
    "description": "California Lieutenant Gov. Eleni Kounalakis suggested President Donald Trump was responsible for escalating the anti-ICE riots in Los Angeles over the weekend.",
    "link": "https://www.foxnews.com/media/california-lt-governor-says-los-angeles-riots-generated-donald-trump",
    "timestamp": "2025-06-09T14:57:56Z"
  },
  {
    "title": "What is the high seas treaty?",
    "description": "The high seas treaty could be law by the end of the year, affording protection to marine life in the vast swathes of ocean that belong to no one. The treaty was adopted by UN member states in June 2023. It has been ratified by 31 nations plus the European Uni…",
    "link": "https://www.digitaljournal.com/world/what-is-the-high-seas-treaty/article",
    "timestamp": "2025-06-09T14:57:20Z"
  },
  {
    "title": "Report: Gaza Papers Show Qatar Fundraising Millions for Hamas, Scheming Against Trump Peace Plan",
    "description": "Reports in Israeli media on Sunday revealed that documents uncovered in Gaza by the Israel Defense Forces (IDF) indicated a close, years-long relationship between the government of Qatar and the genocidal terrorist organization Hamas, including the emir of th…",
    "link": "https://www.breitbart.com/middle-east/2025/06/09/report-gaza-papers-show-qatar-fundraising-millions-hamas-scheming-against-trump-peace-plan/",
    "timestamp": "2025-06-09T14:56:46Z"
  },
  {
    "title": "Idaho Governor Announces Joint Operations with ICE",
    "description": "Idaho's Republican Governor Brad Little has announced a new agreement with federal immigration authorities to support President Donald Trump's deportation agenda.\nThe post Idaho Governor Announces Joint Operations with ICE appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/06/09/idaho-gov-announces-joint-operations-with-immigration-enforcement-operations/",
    "timestamp": "2025-06-09T14:56:32Z"
  },
  {
    "title": "ABC's Terry Moran is suspended following his social media post calling Trump and Miller haters",
    "description": "ABC News has suspended veteran correspondent Terry Moran for a since-deleted social media post calling Trump administration deputy chief of staff Stephen Miller a “world class hater.”.",
    "link": "https://www.wsls.com/entertainment/2025/06/09/abcs-terry-moran-is-suspended-following-his-social-media-post-calling-trump-and-miller-haters/",
    "timestamp": "2025-06-09T14:56:23Z"
  },
  {
    "title": "You’ll Never Guess Who Wall Street’s Backing In NYC’s Mayoral Race",
    "description": "A host of Wall Street giants are backing former Democratic New York Gov. Andrew Cuomo's New York City mayoral bid, the Financial Times reported on Monday.",
    "link": "https://dailycaller.com/2025/06/09/wall-street-andrew-cuomo-new-york-city-mayor/",
    "timestamp": "2025-06-09T14:56:11Z"
  },
  {
    "title": "FTC Pivots From Competition to Children",
    "description": "The result is the same: attacks on tech companies and attempts to violate Americans' rights.",
    "link": "https://reason.com/2025/06/09/ftc-pivots-from-competition-to-children/",
    "timestamp": "2025-06-09T14:55:43Z"
  },
  {
    "title": "Netanyahu said to hold security meeting after call with Trump",
    "description": "Israeli Prime Minister Benjamin Netanyahu will hold a meeting of the country's security cabinet later today after his phone call with United States President Donald Trump, Israel's Channel 12 reported...",
    "link": "https://biztoc.com/x/d57e2313b6ff61f1",
    "timestamp": "2025-06-09T14:55:16Z"
  },
  {
    "title": "Travel Ban Reinstated By Trump With Mostly Muslim Countries",
    "description": "The travel ban reinstated by President Trump may be upheld by the Supreme Court, but it undermines America's commitment to values of openness, equality, and due process.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/06/09/travel-ban-reinstated-by-trump-with-mostly-muslim-countries/",
    "timestamp": "2025-06-09T14:55:15Z"
  },
  {
    "title": "Republicans shrug off alarms over nation’s ballooning debt, forward Trump’s tax agenda",
    "description": "U.S. President Donald Trump and his Republican allies in Congress are determined to enact his tax-cut agenda in a political push that has largely abandoned longtime party claims of fiscal discipline, by simply denying warnings that the measure will balloon th…",
    "link": "https://biztoc.com/x/e913d9980e0f943f",
    "timestamp": "2025-06-09T14:55:00Z"
  },
  {
    "title": "California Republicans React to Donald Trump Deploying National Guard",
    "description": "\"The President has chosen to protect federal officers and LA citizens because Governor Newsom has refused to do so,\" Representative Kevin Kiley told Newsweek.",
    "link": "https://www.newsweek.com/california-republicans-react-donald-trump-deploying-national-guard-2082863",
    "timestamp": "2025-06-09T14:54:47Z"
  },
  {
    "title": "Donald Trump Military Parade on June 14: Event schedule, free tickets, and how to watch live",
    "description": "President Trump is expected to observe the military parade from a specially designated viewing stand on Constitution Avenue, close to the White House. The event will showcase a display of American military strength, featuring troops dressed in both historical…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-military-parade-on-june-14-event-schedule-free-tickets-and-how-to-watch-live/articleshow/121731897.cms",
    "timestamp": "2025-06-09T14:53:53Z"
  },
  {
    "title": "Musk Tries to Make Up With Trump After New Threat on L.A. Protests",
    "description": "Just days after publicly flaming Donald Trump for allegedly being named in the Epstein Files, tech billionaire Elon Musk is cozying back up to the president.\r\nThe dynamic DOGE duo’s relationship burst into flames Thursday as Musk attempted to kill the preside…",
    "link": "https://newrepublic.com/post/196289/elon-musk-trump-la-california-protests",
    "timestamp": "2025-06-09T14:53:51Z"
  },
  {
    "title": "Cuatro razones que hacen subir los rendimientos de los bonos del Tesoro norteamericano",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/rising-treasury-yields-reflect-loss-of-confidence-in-us-economic-policy-by-dambisa-moyo-2025-06/spanish",
    "timestamp": "2025-06-09T14:52:11Z"
  },
  {
    "title": "YouTube has loosened its content moderation policies",
    "description": "YouTube has relaxed its moderation policies and is now instructing reviewers not to remove content that might violate its rules if they’re in the “public interest,” according to a report from The New York Times. The platform reportedly adjusted its policies i…",
    "link": "https://www.theverge.com/news/682784/youtube-loosens-moderation-policies-videos-public-interest",
    "timestamp": "2025-06-09T14:51:28Z"
  },
  {
    "title": "Video of Man Calling US a Dictatorship Viewed Over 25 Million Times",
    "description": "The nearly seven-minute long video sees the creator @longlivejudah make a series of points and arguments about American politics.",
    "link": "https://www.newsweek.com/man-calling-us-dictatorship-video-tiktok-millions-views-2082828",
    "timestamp": "2025-06-09T14:51:07Z"
  },
  {
    "title": "Dem Sen. Padilla: Trump Administration Has an 'Obsession of Being Cruel and Aggressive'",
    "description": "Senator Alex Padilla (D-CA) said Monday on MSNBC's \"Morning Joe\" that President Donald Trump's administration has an \"obsession of being cruel and aggressive.\"\nThe post Dem Sen. Padilla: Trump Administration Has an ‘Obsession of Being Cruel and Aggressive’ ap…",
    "link": "https://www.breitbart.com/clips/2025/06/09/dem-sen-padilla-trump-administration-has-an-obsession-of-being-cruel-and-aggressive/",
    "timestamp": "2025-06-09T14:50:55Z"
  },
  {
    "title": "Immigration Protests Threaten to Boil Over in Los Angeles",
    "description": "Over the weekend, Donald Trump’s deportation agenda met its fiercest resistance yet as federal officials conducted worksite raids and clashed with residents.",
    "link": "https://www.newyorker.com/news/the-lede/immigration-protests-threaten-to-boil-over-in-los-angeles",
    "timestamp": "2025-06-09T14:49:44Z"
  },
  {
    "title": "WATCH: LA Protester Ran Over, Kicked by Police Horses as Riots Against ICE Continue",
    "description": "A video has gone viral after a protestor appeared to be stomped on and kicked by LAPD police horses during immigration protests in Los Angeles.",
    "link": "https://www.ibtimes.com/watch-la-protester-ran-over-kicked-police-horses-riots-against-ice-continue-3775281",
    "timestamp": "2025-06-09T14:46:11Z"
  },
  {
    "title": "Will Trump and Musk Bring the Whole MAGA Coalition Down With Them?",
    "description": "Laura Jedeed\n\n\nThe rift between the former first buddies goes well beyond both men, intensifying fractures that have long lurked beneath MAGA’s surface.\r\n\n\r\n\n\nThe post Will Trump and Musk Bring the Whole MAGA Coalition Down With Them? appeared first on The Na…",
    "link": "https://www.thenation.com/article/politics/maga-break-up-trump-musk/",
    "timestamp": "2025-06-09T14:45:49Z"
  },
  {
    "title": "Protests In Los Angeles Intensify After Trump Deploys National Guard",
    "description": "Tensions flared in Los Angeles on Sunday as protests over President Donald Trump’s immigration crackdown entered their third and most violent day. \nThousands rallied downtown after Trump deployed 300 National Guard troops without Gov. Gavin Newsom’s approval,…",
    "link": "https://biztoc.com/x/0a58e9726e3c58ae",
    "timestamp": "2025-06-09T14:44:01Z"
  },
  {
    "title": "Elon Musk backs up Trump amid LA protests",
    "description": "The supportive reposts from Musk came days after his feud with Trump reached a dramatic apex.",
    "link": "https://www.businessinsider.com/elon-musk-backs-up-trump-amid-la-protests-2025-6",
    "timestamp": "2025-06-09T14:41:06Z"
  },
  {
    "title": "Meet the criminal illegal aliens that Los Angeles is rioting about",
    "description": "Convictions include murder, willful cruelty to a child, sexual battery",
    "link": "https://www.wnd.com/2025/06/meet-the-criminal-illegal-aliens-that-los-angeles-is-rioting-about/",
    "timestamp": "2025-06-09T14:40:52Z"
  },
  {
    "title": "‘Arrest Me’: Newsom Dares Trump to Send National Guard to California",
    "description": "After President Donald Trump deployed the National Guard to the Los Angeles area in response to violent protests against Immigration and Customs Enforcement raids, Gov. Gavin... Read More\nThe post ‘Arrest Me’: Newsom Dares Trump to Send National Guard to Cali…",
    "link": "https://www.dailysignal.com/2025/06/09/arrest-me-newsom-dares-trump-to-send-national-guard-to-california/",
    "timestamp": "2025-06-09T14:40:09Z"
  },
  {
    "title": "‘Gold cards’: How Trump wants to eliminate national debt",
    "description": "'I expect there will be a website up called trumpcard.gov in about a week'",
    "link": "https://www.wnd.com/2025/06/gold-cards-how-trump-wants-to-eliminate-national-debt/",
    "timestamp": "2025-06-09T14:40:02Z"
  },
  {
    "title": "Donald Trump vs. California (and everywhere else) (Philip Bump/Washington Post)",
    "description": "Philip Bump / Washington Post:\nDonald Trump vs. California (and everywhere else)  —  What happened in California this weekend was another facet of the president's effort to quash critics.  —  What's important to remember about the fracture that emerged in Los…",
    "link": "https://www.memeorandum.com/250609/p47",
    "timestamp": "2025-06-09T14:40:00Z"
  },
  {
    "title": "'Don't Shoot!' Maxine Waters Begs National Guard Not To Use Guns At Protest",
    "description": "Rep. Maxine Waters (D-CA) pleaded with National Guard troops not to use their weapons against protesters.\n\n\nThe California lawmaker showed up at an anti-ICE demonstration near Los Angeles on Sunday after President Donald Trump ordered the National Guard to be…",
    "link": "https://crooksandliars.com/2025/06/dont-shoot-maxine-waters-begs-national",
    "timestamp": "2025-06-09T14:39:10Z"
  },
  {
    "title": "ABC's Terry Moran is suspended following his social media post calling Trump and Miller haters",
    "description": "ABC News has suspended veteran correspondent Terry Moran for a since-deleted social media post calling Trump administration deputy chief of staff Stephen Miller a “world class hater.”.",
    "link": "https://www.clickondetroit.com/entertainment/2025/06/09/abcs-terry-moran-is-suspended-following-his-social-media-post-calling-trump-and-miller-haters/",
    "timestamp": "2025-06-09T14:37:33Z"
  },
  {
    "title": "Tom Homan Accuses NBC News Of Publishing ‘Dishonest’ Report About Him Threatening To Arrest Gavin Newsom",
    "description": "Border czar Tom Homan accused NBC News on Monday of writing a \"dishonest\" report that he threatened to arrest Democrat California Gov. Gavin Newsom.",
    "link": "https://dailycaller.com/2025/06/09/tom-homan-nbc-news-gavin-newsom-morning-joe/",
    "timestamp": "2025-06-09T14:37:28Z"
  },
  {
    "title": "MTG attack gets furious rebuttal from targeted non-profit chiefs",
    "description": "President Donald Trump's attacks on nonprofit organizations are a massive threat to society and the world as a whole, wrote a pair of NGO directors in a dire analysis published in Newsweek on Monday.\"Representative Marjorie Taylor Greene (R-GA) hosted a congr…",
    "link": "https://www.rawstory.com/trump-ngos/",
    "timestamp": "2025-06-09T14:37:11Z"
  },
  {
    "title": "‘Love Island USA’ Disgraced Contestant Yulissa Escobar Offers Weak Apology For Her Use Of The N-Word",
    "description": "Escobar was removed from the villa just minutes into Season 7, Episode 2.",
    "link": "https://decider.com/2025/06/09/love-island-usa-yulissa-escobar-weak-apology/",
    "timestamp": "2025-06-09T14:37:00Z"
  },
  {
    "title": "Cathie Wood on what Trump and Elon Musk's feud reveals",
    "description": "Tesla's market volatility may be less about politics and more about how deeply embedded Musk's businesses are in the U.S. government",
    "link": "https://not-qz.com/cathie-wood-elon-musk-donald-trump-feud-tesla-spacex-1851784065",
    "timestamp": "2025-06-09T14:36:35Z"
  },
  {
    "title": "Waymo Suspends Service In L.A. After Protesters Started Ordering Cars Just To Light Them On Fire",
    "description": "Some wild scenes unfolded in Los Angeles over the weekend due to protests stemming from immigration raids in the city. A number of Waymo cars got caught in the crossfire, and the company ultimately opted to suspend services after realizing people were request…",
    "link": "https://brobible.com/culture/article/waymo-suspends-service-los-angeles-protest-fires/",
    "timestamp": "2025-06-09T14:35:47Z"
  },
  {
    "title": "Now That He’s Turned on Trump, Should Democrats Align With Elon Musk?",
    "description": "Jeet Heer\n\n\n\nNo! Hell no! Never! The enemy of your enemy is still a corrupt plutocrat who wants to destroy democracy.\r\n\n\r\n\n\nThe post Now That He’s Turned on Trump, Should Democrats Align With Elon Musk? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-musk-feud-democrats/",
    "timestamp": "2025-06-09T14:35:35Z"
  },
  {
    "title": "‘FFS!’ Musk Forced to Shut Down Wild Claim From His Own AI Bot About Affair With Stephen Miller’s Wife",
    "description": "Musk was forced to publicly shut down a claim by his own AI chatbot Grok after it falsely suggested he'd joked that he'd “taken” Stephen Miller's wife.\nThe post ‘FFS!’ Musk Forced to Shut Down Wild Claim From His Own AI Bot About Affair With Stephen Miller’s …",
    "link": "https://www.mediaite.com/media/news/ffs-musk-forced-to-shut-down-wild-claim-from-his-own-ai-bot-about-affair-with-stephen-millers-wife/",
    "timestamp": "2025-06-09T14:34:10Z"
  },
  {
    "title": "Ukraine’s Narrow Path to Victory Without Trump",
    "description": "How Kyiv and Europe can defeat Russia on their own.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraine-victory-intelligence-diplomacy-europe-defense-trump/",
    "timestamp": "2025-06-09T14:33:22Z"
  },
  {
    "title": "Ukraine’s Narrow Path to Victory Without Trump",
    "description": "How Kyiv and Europe can defeat Russia on their own.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraines-narrow-path-to-victory-without-trump/",
    "timestamp": "2025-06-09T14:33:22Z"
  },
  {
    "title": "Trump Continues Inflaming L.A. Protests: ‘BRING IN THE TROOPS!!!’",
    "description": "President Donald Trump called for the military to be deployed against anti-ICE protests in Los Angeles, California, in a Truth Social post.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-calls-military-crush-la-ice-protests-1235359118/",
    "timestamp": "2025-06-09T14:33:11Z"
  },
  {
    "title": "Cathie Wood on what Trump and Elon Musk's feud reveals",
    "description": "The clash between Elon Musk and President Donald Trump isn’t just political theater; it’s a look into how deeply Musk’s empire depends upon the U.S. government, according to a top investor. Ark Invest CEO Cathie Wood says investors are waking up to the extent…",
    "link": "https://qz.com/cathie-wood-elon-musk-donald-trump-feud-tesla-spacex-1851784065",
    "timestamp": "2025-06-09T14:31:24Z"
  },
  {
    "title": "US-China trade talks in London hang over markets",
    "description": "LONDON: United States-China trade talks in London held markets' attention on Monday (Jun 9), with Asian stocks rising, Wall Street mixed and Europe dipping. The London negotiations, following on",
    "link": "https://www.channelnewsasia.com/business/us-china-trade-talks-london-markets-shares-5171551",
    "timestamp": "2025-06-09T14:31:10Z"
  },
  {
    "title": "California to sue Trump administration for deploying National Guard to L.A.",
    "description": "California Gov. Gavin Newson posted on social media that \" Commandeering a state's National Guard without consulting the Governor of that state is illegal and immoral.\"",
    "link": "https://www.cbsnews.com/news/trump-national-guard-california-lawsuit-gavin-newsom/",
    "timestamp": "2025-06-09T14:30:41Z"
  },
  {
    "title": "Trump opened the door to the LGBTQ+ community. Now activists say he's their top threat",
    "description": "The threat from the White House contrasts with World Pride celebrations taking place this month in Washington.",
    "link": "https://richmond.com/news/nation-world/article_d08206a5-d0db-52cc-babb-6bc76a29bbc8.html",
    "timestamp": "2025-06-09T14:30:00Z"
  },
  {
    "title": "Trump opened the door to the LGBTQ+ community. Now activists say he's their top threat",
    "description": "The threat from the White House contrasts with World Pride celebrations taking place this month in Washington.",
    "link": "https://roanoke.com/news/nation-world/article_de7a3823-bebf-57fb-b994-9a79a7fd5c20.html",
    "timestamp": "2025-06-09T14:30:00Z"
  },
  {
    "title": "Trump Tariffs Crash European Business Travel to U.S.",
    "description": "Europeans are scaling back business trips to the United States amid the Trump administration’s intensifying hostilities toward trade partners and immigrant visitors. European business travel bookings to the U.S. in April dropped 26 percent compared to the sam…",
    "link": "https://www.hospitalitynet.org/external/4127583.html",
    "timestamp": "2025-06-09T14:29:29Z"
  },
  {
    "title": "Ken Moelis to depart as CEO of $4.6 billion investment bank",
    "description": "He will take on the role of executive chairman later this year and continue advising clients.",
    "link": "https://nypost.com/2025/06/09/business/ken-moelis-to-depart-as-ceo-of-4-6-billion-investment-bank/",
    "timestamp": "2025-06-09T14:29:10Z"
  },
  {
    "title": "California City Terminates “Divisive” ICE Contract Amid L.A. Protests",
    "description": "Glendale, California, which is located just minutes from Los Angeles where anti-ICE protests erupted this weekend, has decided to end a contract with Immigration and Customs Enforcement to hold detainees in its jail. \r\nIn a press release Sunday, city official…",
    "link": "https://newrepublic.com/post/196282/glendale-ends-ice-contract-la-california-protests",
    "timestamp": "2025-06-09T14:28:41Z"
  },
  {
    "title": "ABC’s Terry Moran is suspended following his social media post calling Trump and Miller haters",
    "description": "ABC News has suspended Terry Moran for a social media post calling Stephen Miller a “world class hater.”",
    "link": "https://www.bostonherald.com/2025/06/09/abc-terry-moran-stephen-miller/",
    "timestamp": "2025-06-09T14:27:51Z"
  },
  {
    "title": "LAFC Fans Protest ICE During Match, Unfurl Banners, Chant 'F*** ICE'",
    "description": "Protests over immigration raids spilled into an MLS stadium on Sunday ... with LAFC fans making their anti-ICE stances known loud and clear during the middle of the Los Angeles club's game against Kansas City. Multiple people hit BMO Stadium near…\n Permalink",
    "link": "https://www.tmz.com/2025/06/09/lafc-fans-protest-ice-during-match-unfurl-banners-chant/",
    "timestamp": "2025-06-09T14:25:51Z"
  },
  {
    "title": "The LA riots could destroy Donald Trump’s presidency",
    "description": "We’re only a few days into the anti-riot crackdowns in Los Angeles by various armed government enforcers and already there are lives at stake. No, not the lives of the hundreds of protesters out on the streets across America’s second-largest city, but the pol…",
    "link": "https://freerepublic.com/focus/f-chat/4321873/posts",
    "timestamp": "2025-06-09T14:24:40Z"
  },
  {
    "title": "Tennis legend Martina Navratilova puts politics aside in fight for fairness in women's sports",
    "description": "Tennis legend Martina Navratilova once again stood strong when faced with questions about her stance on transgender athletes in women's sports.",
    "link": "https://www.foxnews.com/sports/tennis-legend-martina-navratilova-puts-politics-aside-fight-fairness-womens-sports",
    "timestamp": "2025-06-09T14:23:54Z"
  },
  {
    "title": "Murphy: ‘This Is a Moment Where We Have to Be on the Streets All Over the Country’",
    "description": "Monday on MSNBC’s “Morning Joe,” while insisting to “keep it peaceful,” Sen. Chris Murphy (D-CT) called for more protests around the country as rioting is underway in Los Angeles tied to the Trump administration’s deportation effort. The Connecticut Democrat …",
    "link": "https://freerepublic.com/focus/f-news/4321872/posts",
    "timestamp": "2025-06-09T14:23:16Z"
  },
  {
    "title": "LA Protests: Kamala Harris Calls Trump ICE Raids ‘Cruel’, Defends ‘Overwhelmingly Peaceful’ Public Objections",
    "description": "Trump border czar Tom Homan threatens to arrest Mayor Karen Bass and Governor Gavin Newsom if they interfere in ICE deportation raids\nThe post LA Protests: Kamala Harris Calls Trump ICE Raids ‘Cruel’, Defends ‘Overwhelmingly Peaceful’ Public Objections appear…",
    "link": "http://bossip.com/3098529/trump-border-czar-threatens-to-arrest-mayor-bass-and-governor-newsom/",
    "timestamp": "2025-06-09T14:22:53Z"
  },
  {
    "title": "UN treaty aims to protect international waters and their inhabitants",
    "description": "UN Secretary-General Antonio Guterres on Monday is urging world leaders to ratify a treaty that would allow nations to establish protected marine areas in international waters, warning that human activity was destroying ocean ecosystems.",
    "link": "https://www.cbc.ca/news/science/oceans-treaty-1.7555981",
    "timestamp": "2025-06-09T14:22:52Z"
  },
  {
    "title": "US-China trade, inflation, Apple's big event: Here's what the stock market is watching this week",
    "description": "In addition to inflation and US-China trade, a key bond auction is on investors' radar. A $22 billion sale of 30-year bonds is scheduled for Thursday.",
    "link": "https://www.businessinsider.com/stock-market-this-week-us-china-inflation-apple-bond-yields-2025-6",
    "timestamp": "2025-06-09T14:22:35Z"
  },
  {
    "title": "Trump Warns Musk Not to Back Democrats",
    "description": "President Donald Trump said Elon Musk will pay “very serious consequences” if the billionaire tech mogul funds Democratic candidates that challenge lawmakers who backed Republicans’ tax-and-spending bill.\nTrump, in a phone interview with NBC News’ Kristen Wel…",
    "link": "https://biztoc.com/x/48d07e022f1332be",
    "timestamp": "2025-06-09T14:21:59Z"
  },
  {
    "title": "'Like a parasite': Cost-slashing backfires as workers paid $21M to do nothing",
    "description": "The U.S. Department of Education is paying millions to employees forced to go on leave by the Trump administration, according to a union analysis.The American Federation of Government Employees Local 252, which represents DOE workers, found the endangered age…",
    "link": "https://www.rawstory.com/trump-department-of-education-2672334810/",
    "timestamp": "2025-06-09T14:21:28Z"
  },
  {
    "title": "Trump Clears U.S. For Supersonic Flights Ending +50 Year Ban",
    "description": "President Trump has issued an executive order “leading the world in supersonic flight” which requires the FAA to remove supersonic flight restrictions in U.S. airspace.",
    "link": "https://www.forbes.com/sites/marisagarcia/2025/06/09/trump-clears-us-for-supersonic-flights-ending-50-year-ban/",
    "timestamp": "2025-06-09T14:17:41Z"
  },
  {
    "title": "YouTube Makes Adjustments to Its Moderation Guidelines",
    "description": "The changes allow controversial content to remain on YouTube as long as it is considered to be in the public’s interest.",
    "link": "https://www.adweek.com/media/youtube-makes-adjustments-to-its-moderation-guidelines/",
    "timestamp": "2025-06-09T14:16:42Z"
  },
  {
    "title": "Iran to present counterproposal for nuclear deal to US via Oman",
    "description": "Tehran indicates it will not accept the US proposal made during the fifth round of talks last month.",
    "link": "https://www.aljazeera.com/news/2025/6/9/iran-to-present-nuclear-counter-proposal-to-us-via-mediator-oman",
    "timestamp": "2025-06-09T14:16:17Z"
  },
  {
    "title": "Trump’s Diplomacy of the Absurd",
    "description": "South African President Cyril Ramaphosa’s visit to the White House last month was supposed to reset relations with America. Instead, Ramaphosa and his multiracial delegation were mere props in US President Donald Trump’s absurdist spectacle, which was designe…",
    "link": "https://www.project-syndicate.org/commentary/donald-trump-cyril-ramaphosa-oval-office-meeting-absurdist-theater-by-adekeye-adebajo-2025-06",
    "timestamp": "2025-06-09T14:16:15Z"
  },
  {
    "title": "John Oliver Brushes Off the Idea That Trump Being in the Epstein Files Is a ‘Bombshell’",
    "description": "The HBO host also explains why Bravo's Andy Cohen really should be allowed to host a reunion between the men\nThe post John Oliver Brushes Off the Idea That Trump Being in the Epstein Files Is a ‘Bombshell’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elon-musk-trump-fighting-epstein-files-john-oliver-reaction/",
    "timestamp": "2025-06-09T14:16:10Z"
  },
  {
    "title": "As Musk exits, DOGE employees are being booted from offices; many fired staff now being rehired",
    "description": "Following Elon Musk's departure from the Trump administration, his Department of Government Efficiency (DOGE) is collapsing, leading to the removal of his allies and the reinstatement of previously fired government employees. This reversal is fueled by Musk- …",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-musk-exits-doge-employees-are-being-booted-from-offices-many-fired-staff-now-being-rehired/articleshow/121730883.cms",
    "timestamp": "2025-06-09T14:14:50Z"
  },
  {
    "title": "Newsom Confirms He’s Suing Trump: ‘Illegally Acted to Federalize the National Guard’",
    "description": "Newsom has never read the Insurrection Act.\nThe post Newsom Confirms He’s Suing Trump: ‘Illegally Acted to Federalize the National Guard’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/newsom-confirms-hes-suing-trump-illegally-acted-to-federalize-the-national-guard/",
    "timestamp": "2025-06-09T14:10:39Z"
  },
  {
    "title": "Trump directs a new threat at Elon Musk, with an eye toward the 2026 midterm elections (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTrump directs a new threat at Elon Musk, with an eye toward the 2026 midterm elections  —  The president warned his top campaign donor he'll face “very serious consequences” if Musk dares to support candidates Trump doesn't like.  —  As D…",
    "link": "https://www.memeorandum.com/250609/p44",
    "timestamp": "2025-06-09T14:10:01Z"
  },
  {
    "title": "Japan and South Korea agree to deal with geopolitical crises under three-way cooperation with the US",
    "description": "South Korean President Lee Jae-myung and Japanese Prime Minister Shigeru Ishiba agreed to address geopolitical crises under the framework of trilateral cooperation with the United States. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/09/japan-and-south-korea-agree-to-deal-with-geopolitical-crises-under-three-way-cooperation-with-the-us",
    "timestamp": "2025-06-09T14:10:00Z"
  },
  {
    "title": "Billie Eilish’s brother Finneas tear-gassed at Los Angeles immigration protests, accuses National Guard of ‘inciting’ violence",
    "description": "Older brother of pop star was among thousands protesting against immigration raids",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/finneas-la-protests-ice-billie-eilish-b2766482.html",
    "timestamp": "2025-06-09T14:09:52Z"
  },
  {
    "title": "Shein seen boosting Indian manufacturing as U.S.-China trade war shakes up supply chains",
    "description": "Fast fashion giant Shein is reportedly set to begin boosting its manufacturing in India with a view to bolstering its international supply chains amid the ongoing U.S.-China trade war.",
    "link": "https://www.cnbc.com/2025/06/09/shein-seen-boosting-indian-manufacturing-amid-us-china-trade-war-.html",
    "timestamp": "2025-06-09T14:09:01Z"
  }
]