[
  {
    "title": "Trump Says Musk Will Help Uncover 'Hundreds Of Billions' In US Govt Fraud",
    "description": "US President Donald Trump said in remarks aired Sunday that Elon Musk, who is presiding over a purge of government jobs, will help find \"hundreds of billions of dollars of fraud\" in federal agencies.",
    "link": "https://www.ibtimes.com.au/trump-says-musk-will-help-uncover-hundreds-billions-us-govt-fraud-1856028",
    "timestamp": "2025-02-09T21:27:16Z"
  },
  {
    "title": "Israel's Netanyahu says Trump plan for Gaza 'revolutionary'",
    "description": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu on Sunday (Feb 9) praised a proposal from President Donald Trump for US control of Gaza and the displacement of its population",
    "link": "https://www.channelnewsasia.com/world/israels-netanyahu-says-trump-plan-gaza-revolutionary-4927286",
    "timestamp": "2025-02-09T21:26:14Z"
  },
  {
    "title": "Richard Gere calls Trump 'bully' and 'thug' at Spain's top film awards",
    "description": "American actor Richard Gere called President Donald Trump a &quot;bully&quot; and a &quot;thug&quot; on Saturday during an awards ceremony in Spain, and said the United States was in a &quot;very dark place&quot;. The 75-year-old, who received an Internationa…",
    "link": "https://japantoday.com/category/entertainment/richard-gere-calls-trump-a-%27bully%27-at-spain%27s-top-film-awards",
    "timestamp": "2025-02-09T21:25:58Z"
  },
  {
    "title": "Trump National Security Advisor Doesn't Think Trump Has 'Any Plans to Invade Canada'",
    "description": "In an NBC News \"Meet the Press\" interview, president Donald Trump's national security adviser Michael \"Mike\" Waltz dismissed reports that the president planned to invade or annex Canada.",
    "link": "https://www.ibtimes.com/trump-national-security-advisor-doesnt-think-trump-plans-invade-canada-3763061",
    "timestamp": "2025-02-09T21:25:52Z"
  },
  {
    "title": "The Latest: Chiefs try for Super Bowl three-peat vs Eagles",
    "description": "Super Bowl 59 kicks off as the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row.",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-chiefs-try-for-super-bowl-three-peat-vs-eagles/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Chiefs, Eagles and entertainers prepare for Super Bowl",
    "description": "By The Associated Press Super Bowl 59 kicks off in just a few hours, when the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row. Here’s the latest: ___ Fans pay their respe…",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-chiefs-eagles-and-entertainers-prepare-for-super-bowl/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Eagles soar to early Super Bowl lead over Chiefs",
    "description": "Super Bowl 59 kicks off as the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row.",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-eagles-soar-to-early-super-bowl-lead-over-chiefs/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Eagles spoil Chiefs’ three-peat bid, win Super Bowl 40-22",
    "description": "By The Associated Press NEW ORLEANS (AP) — Super Bowl 59 is underway, with the Kansas City Chiefs facing a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row. Here’s the latest: ___ SCORE UPDATE: Eagles 4…",
    "link": "https://www.bostonherald.com/2025/02/09/the-latest-eagles-spoil-chiefs-three-peat-bid-win-super-bowl-40-22/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Eagles soaring over Chiefs at Super Bowl",
    "description": "Super Bowl 59 kicks off as the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row.",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-eagles-soaring-over-chiefs-at-super-bowl/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Eagles spoil Chiefs’ three-peat bid, win Super Bowl 40-22",
    "description": "Super Bowl 59 kicks off as the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row.",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-eagles-spoil-chiefs-three-peat-bid-win-super-bowl-40-22/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "The Latest: Chiefs, Eagles and entertainers prepare for Super Bowl",
    "description": "Super Bowl 59 kicks off as the Kansas City Chiefs will face a familiar foe, the Philadelphia Eagles, hoping to win the Lombardi Trophy for a record third year in a row.",
    "link": "https://www.denverpost.com/2025/02/09/the-latest-chiefs-win-super-bowl-coin-toss-and-were-underway/",
    "timestamp": "2025-02-09T21:24:51Z"
  },
  {
    "title": "Ishiba proposes Nippon Steel invest in U.S. Steel rather than acquire it",
    "description": "Prime Minister Shigeru Ishiba proposed modifying a plan for Nippon Steel Corp to acquire United States Steel Corp into an investment during his summit with U.S. President Donald Trump in Washington, a government source said Sunday. The revised plan, which had…",
    "link": "https://japantoday.com/category/politics/update1-u.s.-steel-to-stay-american-regardless-of-nippon-steel-plans-ishiba",
    "timestamp": "2025-02-09T21:24:36Z"
  },
  {
    "title": "WATCH: Trump says his wish for Canada to be America’s 51st state is a ‘real thing’",
    "description": "President also admits: 'I have to dance because it's just got something special about it'",
    "link": "https://www.wnd.com/2025/02/watch-trump-says-his-wish-for-canada-to-be-americas-51st-state-is-a-real-thing/",
    "timestamp": "2025-02-09T21:22:03Z"
  },
  {
    "title": "The stark divide that South Africa's land act seeks to bridge",
    "description": "The township of Fateng Tse Ntsho houses some 7,000 Black South Africans, its huddle of corrugated metal roofs surrounded on all sides by vast tracts of mostly empty grassland owned by prosperous white farmers. The contrast illustrates the gaping land inequali…",
    "link": "https://japantoday.com/category/world/the-stark-divide-that-south-africa%27s-land-act-seeks-to-bridge1",
    "timestamp": "2025-02-09T21:21:31Z"
  },
  {
    "title": "Trump official orders consumer protection agency to stop work",
    "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down an agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal. Russell…",
    "link": "https://japantoday.com/category/world/trump-official-orders-consumer-protection-agency-to-stop-work",
    "timestamp": "2025-02-09T21:21:20Z"
  },
  {
    "title": "China lashes out at US ‘coercion’ on canal",
    "description": "China lashed out at what it called U.S. \"coercion\" after Panama declined to renew a key infrastructure agreement with Beijing following Washington's threat to take back the Panama Canal.",
    "link": "https://www.bostonherald.com/2025/02/09/china-lashes-out-at-us-coercion-on-canal/",
    "timestamp": "2025-02-09T21:21:17Z"
  },
  {
    "title": "Trump plan to end Ukraine war must prevent new Russian aggression, Zelenskyy says",
    "description": "U.S. President Donald Trump's plan for a quick settlement in Ukraine must not only stop the war but also ensure that there can no longer be any more Russian aggression, President Volodymyr Zelenskyy said in an interview broadcast on Sunday. Zelenskyy said Ukr…",
    "link": "https://japantoday.com/category/world/trump-plan-to-end-ukraine-war-must-prevent-new-russian-aggression-zelenskiy-says",
    "timestamp": "2025-02-09T21:20:24Z"
  },
  {
    "title": "Disney World Could Be Ruled by Another DeSantis After 2026",
    "description": "After years of being at each other’s throats, there has been a long-simmering period between Florida Governor Ron DeSantis and The Walt Disney Company. After DeSantis’ presidential hopes were dashed in early 2024, he returned to Florida, and the two sides wer…",
    "link": "https://insidethemagic.net/2025/02/casey-desantis-considering-run-for-florida-governor-rl1/",
    "timestamp": "2025-02-09T21:20:22Z"
  },
  {
    "title": "Vance and Musk question authority of the courts as Trump's agenda faces legal pushback",
    "description": "Top Trump administration officials are openly questioning the judiciary's authority to serve as a check on executive power as the new president's sweeping agenda faces growing pushback from the courts. Over the past 24 hours, officials ranging from billionair…",
    "link": "https://japantoday.com/category/world/vance-and-musk-question-the-authority-of-the-courts-as-trump%27s-agenda-faces-legal-pushback",
    "timestamp": "2025-02-09T21:20:15Z"
  },
  {
    "title": "Israeli forces begin to withdraw from key Gaza corridor, part of the ceasefire deal with Hamas",
    "description": "Israeli forces began withdrawing from a key Gaza corridor on Sunday, Israeli officials said, part of Israel's commitments under a tenuous ceasefire deal with Hamas that is moving ahead but faces a major test over whether the sides can negotiate its planned ex…",
    "link": "https://japantoday.com/category/world/israeli-forces-begin-to-withdraw-from-a-key-gaza-corridor-part-of-the-ceasefire-deal-with-hamas",
    "timestamp": "2025-02-09T21:20:05Z"
  },
  {
    "title": "WATCH: Secret Service Drops a Super Bowl Ad Directed By Michael Bay — Complete With Photo of Assassination Attempt on Trump",
    "description": "The US Secret Service dropped a Super Bowl hiring ad — just hours before kickoff Sunday — that featured an image of President Donald Trump bloodied after surviving an attempted assassination in Pennsylvania last summer. The 60-second spot, which features imag…",
    "link": "https://www.mediaite.com/tv/watch-secret-service-drops-a-super-bowl-ad-directed-by-michael-bay-complete-with-photo-of-assassination-attempt-on-trump/",
    "timestamp": "2025-02-09T21:20:05Z"
  },
  {
    "title": "Map wars in the Middle East: How cartographers charted and helped shape a regional conflict",
    "description": "Maps are ubiquitous—on phones, in-flight and car displays, and in textbooks the world over. While some maps delineate and name territories and boundaries, others show different voting blocs in elections, and GPS devices help drivers navigate to their destinat…",
    "link": "https://phys.org/news/2025-02-wars-middle-east-cartographers-regional.html",
    "timestamp": "2025-02-09T21:20:01Z"
  },
  {
    "title": "Senator Warns of Trump’s Assault on Democracy",
    "description": "Sen. Chris Murphy (D-CT) warned of an \"assault on the Constitution\" under President Donald Trump, ABC News reports. Said Murphy: “I think this is the most serious constitutional crisis the country has faced, certainly since",
    "link": "https://politicalwire.com/2025/02/09/senator-warns-of-trumps-assault-on-democracy/",
    "timestamp": "2025-02-09T21:19:58Z"
  },
  {
    "title": "Richard Gere Says America Is In “A Very Dark Place” With “Bully And Thug” Donald Trump As President – Goya Awards",
    "description": "Accepting a lifetime achievement honor at Spain’s Goya Awards this weekend, Richard Gere had some choice words about the state of things in the U.S. amid Donald Trump’s second term in office. “We’re in a very dark place in America where we have a bully and a …",
    "link": "http://deadline.com/2025/02/richard-gere-donald-trump-goya-awards-speech-1236283411/",
    "timestamp": "2025-02-09T21:19:31Z"
  },
  {
    "title": "Trump administration orders consumer protection agency to stop work, closes building",
    "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal",
    "link": "https://abcnews.go.com/Business/wireStory/trump-administration-orders-consumer-protection-agency-stop-work-118623868",
    "timestamp": "2025-02-09T21:18:17Z"
  },
  {
    "title": "Trump Raves About Patrick Mahomes and His ‘Phenomenal Wife’ While Picking Chiefs to Win Super Bowl: ‘She’s a Trump Fan! She’s a MAGA Fan!’",
    "description": "President Donald Trump predicted that the Kansas City Chief will defeat the Philadelphia Eagles at the upcoming Super Bowl LIX. \nThe post Trump Raves About Patrick Mahomes and His ‘Phenomenal Wife’ While Picking Chiefs to Win Super Bowl: ‘She’s a Trump Fan! S…",
    "link": "https://www.mediaite.com/trump/trump-raves-about-patrick-mahomes-and-his-phenomenal-wife-while-picking-chiefs-to-win-super-bowl-shes-a-trump-fan-shes-a-maga-fan/",
    "timestamp": "2025-02-09T21:18:00Z"
  },
  {
    "title": "Pressure to extend ceasefire in Gaza mounts as Israeli troops withdraw from key corridor",
    "description": "Talks on the second phase, meant to see more hostages released and a complete Israeli withdrawal from Gaza, were due to start Feb. 3. But Israel and Hamas appear to have made little progress, even as Israeli forces withdrew Sunday from a Gaza corridor in the …",
    "link": "https://www.pbs.org/newshour/world/pressure-to-extend-ceasefire-in-gaza-mounts-as-israeli-troops-withdraw-from-key-corridor",
    "timestamp": "2025-02-09T21:14:55Z"
  },
  {
    "title": "Senate Democrat Claims Trump-Musk DOGE ‘Takeover’ is ‘The Most Serious Constitutional Crisis’ Since Watergate",
    "description": "Senator Chris Murphy (D-CT) slammed the DOGE attempts to upend the federal government as \"the most serious constitutional crisis\" since Watergate. \nThe post Senate Democrat Claims Trump-Musk DOGE ‘Takeover’ is ‘The Most Serious Constitutional Crisis’ Since Wa…",
    "link": "https://www.mediaite.com/tv/senate-democrat-claims-trump-musk-doge-takeover-is-the-most-serious-constitutional-crisis-since-watergate/",
    "timestamp": "2025-02-09T21:13:56Z"
  },
  {
    "title": "Super Bowl 2025: President Donald Trump predicts Chiefs, Patrick Mahomes will defeat Eagles, Saquon Barkley",
    "description": "Trump is expected to attend Super Bowl 59 in New Orleans",
    "link": "https://www.cbssports.com/nfl/news/super-bowl-2025-president-donald-trump-predicts-chiefs-patrick-mahomes-will-defeat-eagles-saquon-barkley/",
    "timestamp": "2025-02-09T21:13:51Z"
  },
  {
    "title": "Trump’s New Budget Chief Orders Federal Financial Watchdog To Halt Operations",
    "description": "The Project 2025 architect has effectively frozen the Consumer Financial Protection Bureau, now allowing big banks and giant corporations to prey on consumers.",
    "link": "https://www.huffpost.com/entry/trump-budget-chief-cfpb-halt-operations_n_67a90ca4e4b062d0a97c0e8c",
    "timestamp": "2025-02-09T21:13:49Z"
  },
  {
    "title": "Invictus Games for wounded veterans kicks off in Vancouver with star-studded ceremony",
    "description": "Entertainers and dignitaries led by Prince Harry kicked off the 2025 Invictus Games in British Columbia on Saturday in a star-studded opening ceremony.",
    "link": "https://www.cnbc.com/2025/02/09/invictus-games-for-wounded-veterans-kicks-off-in-vancouver-with-star-studded-ceremony-.html",
    "timestamp": "2025-02-09T21:11:49Z"
  },
  {
    "title": "JD Vance Suggests Judges 'Aren't Allowed' To Control Trump After Courts Block His Policies (Alison Durkee/Forbes)",
    "description": "Alison Durkee / Forbes:\nJD Vance Suggests Judges 'Aren't Allowed' To Control Trump After Courts Block His Policies  —  Vice President JD Vance suggested Sunday courts “aren't allowed” to overrule President Donald Trump and his executive orders after judges ac…",
    "link": "https://www.memeorandum.com/250209/p44",
    "timestamp": "2025-02-09T21:10:01Z"
  },
  {
    "title": "Scholz: EU can respond in an 'hour' if tariffs imposed",
    "description": "German Chancellor Olaf Scholz stated that Europe is prepared to respond within \"an hour\" if United States President Donald Trump goes along with his plan to impose tariffs on the European Union. More ...",
    "link": "https://biztoc.com/x/ae08ef8885c006f9",
    "timestamp": "2025-02-09T21:09:54Z"
  },
  {
    "title": "Market pros tell us why they're not worried about tariff whiplash — and why stocks are poised to keep rallying",
    "description": "Markets were buffeted by tariff fears last week, with more uncertainty looming.\n-\nYet, market sources tell BI they're not worried, and see trade jitters creating opportunity.\n-\n\"If you've got a longer-term view, some of these dips taking place are buying oppo…",
    "link": "https://biztoc.com/x/36f5ae427d5cf43d",
    "timestamp": "2025-02-09T21:09:47Z"
  },
  {
    "title": "Trump's agenda increasingly slowed by mounting legal challenges",
    "description": "The News\nScores of lawsuits from US states, unions, and nonprofits are slowing down President Donald Trump and his allies’ efforts to reshape federal policy and governance. \nJudges have paused attempts to freeze government spending and end birthright citizens…",
    "link": "https://biztoc.com/x/0d24eeb31339ff1d",
    "timestamp": "2025-02-09T21:09:33Z"
  },
  {
    "title": "Israeli delegation in Qatar for Gaza ceasefire talks",
    "description": "An Israel delegation arrived in Qatar on Sunday for more Gaza truce talks, Prime Minister Benjamin Netanyahu’s spokesperson said, as its military withdrew from an important crossing point in the enclave, as agreed under the truce with Hamas.",
    "link": "https://www.nbcnews.com/news/world/israeli-delegation-qatar-gaza-ceasefire-talks-rcna191393",
    "timestamp": "2025-02-09T21:08:40Z"
  },
  {
    "title": "Trump Tells Massive Super Bowl TV Audience That His Plans to Annex Canada Are Real: They’d Be ‘Much Better Off’ as ’51st State’",
    "description": "Trump told the largest American television audience of the year that he plans to pursue the annexation of Canada as the nation's 51st state.\nThe post Trump Tells Massive Super Bowl TV Audience That His Plans to Annex Canada Are Real: They’d Be ‘Much Better Of…",
    "link": "https://www.mediaite.com/news/trump-tells-massive-super-bowl-tv-audience-that-his-plans-to-annex-canada-are-real-theyd-be-much-better-off-as-51st-state/",
    "timestamp": "2025-02-09T21:08:27Z"
  },
  {
    "title": "Trump official tells consumer protection agency to stop work",
    "description": "The Consumer Financial Protection Bureau was a target of conservatives since its creation after the 2007-2008 financial crisis.",
    "link": "https://oanow.com/news/nation-world/business/washington-politics-vought-obama-warren/article_1238d0da-eeec-5d25-91ce-a5dd57da7af8.html",
    "timestamp": "2025-02-09T21:01:41Z"
  },
  {
    "title": "SPD's Scholz and CDU's Merz spar on migration, economy, AfD",
    "description": "German Chancellor Olaf Scholz from the left-leaning SPD and his main rival Friedrich Merz from the conservative CSU/CDU bloc have presented competing visions for the country's future.",
    "link": "https://www.dw.com/en/spds-scholz-and-cdus-merz-spar-on-migration-economy-afd/live-71530340",
    "timestamp": "2025-02-09T21:01:00Z"
  },
  {
    "title": "Democrat Incitement Continues With Calls to ‘Fight’ Accusations of a Musk ‘Coup’",
    "description": "\"So at some point, we've got to wake up beyond party lines for all Americans to see what's going on here in this rapidly expanding and accelerating coup.\"\nThe post Democrat Incitement Continues With Calls to ‘Fight’ Accusations of a Musk ‘Coup’ first appeared…",
    "link": "https://legalinsurrection.com/2025/02/democrat-incitement-continues-with-calls-to-fight-accusations-of-a-musk-coup/",
    "timestamp": "2025-02-09T21:00:40Z"
  },
  {
    "title": "Super Bowl 2025 live updates: Chiefs vs. Eagles news, highlights, halftime show",
    "description": "Ready for the rematch? Super Bowl 2025 between the Eagles and Chiefs kicks off at 6:30 p.m. ET from Caesars Superdome in New Orleans.",
    "link": "https://nypost.com/2025/02/09/sports/super-bowl-2025-live-updates-chiefs-vs-eagles-news-highlights-halftime-show/",
    "timestamp": "2025-02-09T21:00:03Z"
  },
  {
    "title": "How Trump Is Uprooting Radical ’60s Foundations of Poisonous DEI and CRT Programs",
    "description": "President Donald Trump has certainly undertaken a systematic demolition of former President Joe Biden’s diversity, equity, and inclusion regime since returning to the Oval Office. But Trump... Read More\nThe post How Trump Is Uprooting Radical ’60s Foundations…",
    "link": "https://www.dailysignal.com/2025/02/09/how-trump-is-uprooting-radical-60s-foundations-poisonous-dei-crt-programs-civil-rights-movement/",
    "timestamp": "2025-02-09T21:00:00Z"
  },
  {
    "title": "Did Jan. 6 threaten ‘our democracy’? Or prove the republic still works?",
    "description": "Like Dec. 7, 1941, Jan. 6, 2021, has taken on a mythic stature that surpasses the actual events of that day. Trump’s opponents view it as an “insurrection” — a deliberate attack on the Constitution, carried out by his supporters at his command to illegally ov…",
    "link": "https://www.theblaze.com/columns/opinion/did-jan-6-threaten-our-democracy-or-prove-the-republic-still-works",
    "timestamp": "2025-02-09T21:00:00Z"
  },
  {
    "title": "As Trump targets the Pentagon, Elon Musk is a ‘great master’ at this rare talent that could transform defense, former Navy secretary says",
    "description": "President Donald Trump has signaled he is about to unleash Elon Musk and his DOGE team on the Pentagon. Former Navy Secretary Richard Danzig says the Defense Department needs a transformation.\nAfter targeting federal agencies like USAID and the General Servic…",
    "link": "https://biztoc.com/x/1f7c5845eb423fdc",
    "timestamp": "2025-02-09T20:58:39Z"
  },
  {
    "title": "Trump: Canada as 51 US state 'real thing'",
    "description": "United States President Donald Trump told Fox News' Bret Baier that his idea of Canada joining the US as a 51st state is a \"real thing.\"In a part of the interview with Baier aired before the Super Bow...",
    "link": "https://biztoc.com/x/a10e9d8038892cbc",
    "timestamp": "2025-02-09T20:58:36Z"
  },
  {
    "title": "Musk calls for closure of US state media",
    "description": "Elon Musk has supported shutting down US-funded media outlets, citing taxpayer costs and perceived bias Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612419-musk-rfe-voa-shut/",
    "timestamp": "2025-02-09T20:58:06Z"
  },
  {
    "title": "CFPB HQ Shuts Down as New Boss Freezes Enforcement",
    "description": "The Consumer Financial Protection Bureau’s (CFPB) new boss has put a hold on consumer protections. Workers at the financial regulator will work from home this week while their headquarters are closed down, CNBC reported Sunday (Feb. 9).  That shutdown lasts t…",
    "link": "https://www.pymnts.com/news/cfpb/2025/cfpb-hq-shuts-down-as-new-boss-freezes-enforcement/",
    "timestamp": "2025-02-09T20:55:27Z"
  },
  {
    "title": "President Trump predicts Kansas City Chiefs will win Super Bowl 2025— and calls out a famous WAG",
    "description": "“I hate to do it,” Trump, 78, bemoaned when pressed by Fox News’ Bret Baier during a pregame interview.",
    "link": "https://nypost.com/2025/02/09/us-news/president-trump-picks-kansas-city-chiefs-to-win-super-bowl-lix/",
    "timestamp": "2025-02-09T20:54:08Z"
  },
  {
    "title": "Trump's acting Consumer Financial Protection Bureau chief shutters headquarters, halts supervision",
    "description": "WASHINGTON: The US Consumer Financial Protection Bureau's Washington headquarters will be closed for the coming week, according to a Sunday (Feb 9) internal email seen by Reuters, the latest escalation in the Trump administration's efforts to neutralise the g…",
    "link": "https://www.channelnewsasia.com/world/trumps-acting-consumer-financial-protection-bureau-chief-shutters-headquarters-halts-supervision-4927276",
    "timestamp": "2025-02-09T20:51:54Z"
  },
  {
    "title": "Europe can act \"within an hour\" if US levies tariffs - Germany's Scholz",
    "description": "Europe is prepared to respond \"within an hour\" if the United States levies tariffs against the European Union, German Chancellor Olaf Scholz said in a pre...",
    "link": "https://www.yahoo.com/news/europe-act-within-hour-us-205104860.html",
    "timestamp": "2025-02-09T20:51:04Z"
  },
  {
    "title": "Erdogan: Trump's Gaza plans not worth discussing",
    "description": "Turkish President Recep Tayyip Erdogan told reporters that plans for resettling Gazans to other countries put forward by United States President Donald Trump \"have nothing worth discussing.\" Erdogan s...",
    "link": "https://biztoc.com/x/bdfe0a32d38b1276",
    "timestamp": "2025-02-09T20:47:44Z"
  },
  {
    "title": "Trump: Canada as 51st US state 'real thing'",
    "description": "United States President Donald Trump told Fox News' Bret Baier that his idea of Canada joining the US as a 51st state is a \"real thing.\"More to come......",
    "link": "https://biztoc.com/x/19efd6fdbac62ad9",
    "timestamp": "2025-02-09T20:47:32Z"
  },
  {
    "title": "‘Terrified That The FBI Might Have The Internet?’: Jennings Dismantles CNN Guest’s Fear About Musk",
    "description": "CNN's Scott Jennings halted a network guest after she stated she was worried about Musk allegedly wanting to provide the FBI with his Starlink.",
    "link": "https://dailycaller.com/2025/02/09/scott-jennings-elon-musk-aid-us-government/",
    "timestamp": "2025-02-09T20:45:10Z"
  },
  {
    "title": "Kanye West Doubles Down on Support for Jailed 'Sex Beast' Pal Sean 'Diddy' Combs With Vile New Rant MOCKING Cassie Ventura's Assault by Vicious Rapper",
    "description": "Kanye West previously asked President Donald Trump to release Sean 'Diddy' Combs from prison.",
    "link": "https://radaronline.com/p/kanye-west-doubles-down-support-jailed-sean-diddy-combs-mocking-cassie/",
    "timestamp": "2025-02-09T20:45:00Z"
  },
  {
    "title": "Trump Picks Chiefs To Win Super Bowl—And He’s Clashed With The Eagles In The Past",
    "description": "Trump canceled a planned visit for the Philadelphia Eagles to attend the White House after their 2018 Super Bowl victory after most players declined to come.",
    "link": "https://www.forbes.com/sites/conormurray/2025/02/09/trump-picks-chiefs-to-win-super-bowl-and-hes-clashed-with-the-eagles-in-the-past/",
    "timestamp": "2025-02-09T20:45:00Z"
  },
  {
    "title": "Homeland Security Secretary Noem says DOGE team has access to agency data",
    "description": "(CNN) — Homeland Security Secretary Kristi Noem on Sunday acknowledged that Elon Musk’s government efficiency team, which has been tasked with slashing federal spending, has access to her agency’s data, including that of federal disaster aid recipients’ perso…",
    "link": "https://richmond.com/news/nation-world/government-politics/homeland-security-secretary-noem-says-doge-team-has-access-to-agency-data/article_87d7c732-d1c4-5dd7-a5e6-fcd5eaa9a780.html",
    "timestamp": "2025-02-09T20:43:06Z"
  },
  {
    "title": "DHS secretary says Musk-led DOGE team has access to data | CNN Politics",
    "description": "The head of the Department of Homeland Security on Sunday acknowledged that Elon Musk’s government efficiency team, which has been tasked with slashing federal spending, has access to her agency’s data, including that of federal disaster aid recipients’ perso…",
    "link": "https://www.cnn.com/2025/02/09/politics/noem-homeland-security-doge-musk-cnntv/index.html",
    "timestamp": "2025-02-09T20:43:06Z"
  },
  {
    "title": "Macron Beats French Investment Drum Ahead Of AI Summit",
    "description": "French President Emmanuel Macron trumpeted the benefits of artificial intelligence Sunday, ahead of a two-day Paris summit on the technology and its potential benefits and pitfalls.",
    "link": "https://www.ibtimes.com/macron-beats-french-investment-drum-ahead-ai-summit-3763057",
    "timestamp": "2025-02-09T20:42:16Z"
  },
  {
    "title": "Violence-hit Ecuador Chooses Next President",
    "description": "Some 14 million Ecuadorans began voting under tight security Sunday, choosing who will lead their violence-wracked Andean nation through its worst crisis in half a century.",
    "link": "https://www.ibtimes.com.au/violence-hit-ecuador-chooses-next-president-1856025",
    "timestamp": "2025-02-09T20:42:11Z"
  },
  {
    "title": "Musk calls to impeach judge whose order blocks DOGE from Treasury systems access",
    "description": "Musk wants to impeach a federal judge after an order temporarily restricts his team from accessing the Treasury Department's payment systems and sensitive data.",
    "link": "https://www.cnbc.com/2025/02/09/musk-calls-to-impeach-judge-whose-order-blocks-doge-from-treasury-systems-access.html",
    "timestamp": "2025-02-09T20:42:10Z"
  },
  {
    "title": "Judge's 'hopelessly ambiguous' order barring DOGE from Treasury sparks concern Bessent may also be locked out",
    "description": "Federal Judge Paul Engelmayer's ruling baring DOGE from accessing Treasury data may also bar Secretary Bessent, according to legal experts and conservative critics.",
    "link": "https://www.foxnews.com/politics/judges-hopelessly-ambiguous-order-barring-doge-from-treasury-sparks-concern-bessent-may-also-locked-out",
    "timestamp": "2025-02-09T20:41:54Z"
  },
  {
    "title": "Election of the Day II: Kosovo",
    "description": "I got excited about Ecuador and forgot about Kosovo, where elections also took place today, but where due to time zones today is actually mostly yesterday, so results are starting to come in. So no full writeup, but for some context I recommend this Guardian …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/election-of-the-day-ii-kosovo",
    "timestamp": "2025-02-09T20:40:56Z"
  },
  {
    "title": "Consumer Financial Protection Bureau ordered to stop work: What to know about the agency - NewsBreak",
    "description": "Russell Vought, director of the Office of Management and Budget and the acting director of CFPB, ordered the federal watchdog to stop work.",
    "link": "https://www.newsbreak.com/share/3798483481269-consumer-financial-protection-bureau-ordered-to-stop-work-what-to-know-about-the-agency?s=a2&amp;share_destination_id=MjU3MjUxNTYxLTE3MzkxMzM0NTY2OTY%3D&amp;pd=0HPOsjYC&amp;hl=en_US&amp;send_time=1739133456&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v6%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v9",
    "timestamp": "2025-02-09T20:40:45Z"
  },
  {
    "title": "On Super Bowl Sunday, Remember Billions of Taxpayer Dollars Subsidize the NFL",
    "description": "NFL owners opened up 20 new stadiums with the help of $4.7 billion in taxpayer funds between 1997 and 2015.",
    "link": "https://inequality.org/article/the-super-bowl-and-the-super-rich-partners-in-slime/",
    "timestamp": "2025-02-09T20:34:24Z"
  },
  {
    "title": "Turkish president says no point to talk about Trump plan on Gaza",
    "description": "Turkish President Tayyip Erdogan said on Sunday that there is no point in discussing what US President Donald Trump has said about a plan to take over the Gaza Strip.\"From our perspective, there is nothing worth talking about the proposals brought up by the n…",
    "link": "https://www.jpost.com/breaking-news/article-841390",
    "timestamp": "2025-02-09T20:34:17Z"
  },
  {
    "title": "Why Trump blinked before imposing his ‘beautiful’ tariffs on Canada and Mexico - The Guardian US",
    "description": "Why Trump blinked before imposing his ‘beautiful’ tariffs on Canada and MexicoThe Guardian US Trump’s Tariffs Could Squeeze the Supreme CourtPOLITICO Why Donald Trump’s protectionist zeal has only grownThe Economist Opinion | Trump’s tariff tactics are an unp…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176165725",
    "timestamp": "2025-02-09T20:33:25Z"
  },
  {
    "title": "J.D. Vance Says Trump Can Ignore Judges",
    "description": "Vice President J.D. Vance claimed, \"Judges aren't allowed to control the executive's legitimate power,\" sparking outrage and criticism.",
    "link": "http://www.rollingstone.com/politics/politics-news/jd-vance-trump-can-ignore-judges-1235261430/",
    "timestamp": "2025-02-09T20:31:53Z"
  },
  {
    "title": "Is Donald Trump Going to the Super Bowl 2025? Find Out",
    "description": "As we approach football's biggest event of the year, many are wondering if the president will attend the game and which team he's rooting for.",
    "link": "https://hollywoodlife.com/2025/02/09/is-trump-going-to-super-bowl-2025/",
    "timestamp": "2025-02-09T20:30:52Z"
  },
  {
    "title": "Live: ASX set to drop after Wall Street retreats on trade fears",
    "description": "Trade war fears have sparked more selling on Wall Street, and the ASX is priced to fall about 0.8 per cent on opening. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-02-10/asx-markets-business-news-live-updates-feb-10/104916360",
    "timestamp": "2025-02-09T20:29:13Z"
  },
  {
    "title": "‘A mood against Labor’ in Victorian by-elections",
    "description": "Victorian Premier Jacinta Allan conceded the weekend's state by-elections were 'tough' for Labor, and the federal government is rushing to finalise bills in what could be the final sitting week of this term.\nThe post ‘A mood against Labor’ in Victorian by-ele…",
    "link": "https://www.crikey.com.au/2025/02/10/victoria-by-elections-labor-2025-federal-election/",
    "timestamp": "2025-02-09T20:27:15Z"
  },
  {
    "title": "Karen Bass’ L.A. ‘Recovery’ Czar Steve Soboroff Once Trashed Trump Supporters as Too White",
    "description": "Los Angeles Chief Recovery Officer Steve Soboroff once mocked Trump supporters as \"all white\" in a post on Twitter (now X) during the 2016 election, when he was on the Los Angeles Board of Police Commissioners. The post was then deleted.\nThe post Karen Bass’ …",
    "link": "https://www.breitbart.com/politics/2025/02/09/karen-bass-l-a-recovery-czar-steve-soboroff-once-trashed-trump-supporters-as-too-white/",
    "timestamp": "2025-02-09T20:25:29Z"
  },
  {
    "title": "Donald Trump and Tiger Woods Golf Together Before Trump Attends Super Bowl",
    "description": "President Donald Trump and Tiger Woods met up for a round of gold before Trump heads to New Orleans to attend the Super Bowl. The 47th President, Tiger and his son, Charlie played a round of golf at Trump International Golf Club in Palm Beach on…\n Permalink",
    "link": "https://www.tmz.com/2025/02/09/donald-trump-golfing-with-tiger-woods-before-super-bowl/",
    "timestamp": "2025-02-09T20:22:08Z"
  },
  {
    "title": "Trump gets high marks with Americans for keeping promises: poll",
    "description": "President Donald Trump earned high marks for following through on promises and for his handling of the border and overseas conflicts, according to a new CBS/YouGov poll.",
    "link": "https://www.foxnews.com/politics/new-poll-shows-americans-think-trumps-performance-second-term",
    "timestamp": "2025-02-09T20:22:02Z"
  },
  {
    "title": "Super Bowl Commercials Expected to Shy Away From Politics",
    "description": "A professor of marketing at Northwestern University's Kellogg School of Management said most ads were in development during the 2024 election.",
    "link": "https://www.newsweek.com/super-bowl-commercials-expected-shy-away-politics-2028484",
    "timestamp": "2025-02-09T20:21:39Z"
  },
  {
    "title": "The CFPB says it's shutting down its DC headquarters and has instructed employees to work remotely",
    "description": "DC employees at the Consumer Financial Protection Bureau received an email from the agency on Sunday telling them to work remotely next week.",
    "link": "https://www.businessinsider.com/cfpb-shutting-down-dc-offices-russ-vought-trump-elon-musk-2025-2",
    "timestamp": "2025-02-09T20:16:17Z"
  },
  {
    "title": "This Red State Senator Seems Concerned About Trump's NIH Cut",
    "description": "A $4 billion reduction in medical research funding will hit Republican districts and states hard. At least one of their lawmakers seems to have noticed.",
    "link": "https://www.huffpost.com/entry/trump-nih-medical-research-cut_n_67a8f3afe4b03ba5c011e427",
    "timestamp": "2025-02-09T20:16:09Z"
  },
  {
    "title": "Trump To Unleash Musk, DOGE On Military: Expects To Find 'Fraud And Abuse'",
    "description": "In a pre-tape interview set to air before the Super Bowl, President Donald Trump announced that he would direct Elon Musk and his Department of Government Efficiency (DOGE) to review military spending and the Department of Education.\nWhy It Matters\nMusk and h…",
    "link": "https://biztoc.com/x/7a0e91bfd9f61708",
    "timestamp": "2025-02-09T20:13:56Z"
  },
  {
    "title": "How Hillary Clinton’s health care missteps shaped her cautious future",
    "description": "Hillary Clinton and Sen. Edward Kennedy discuss health care reform on Capitol Hill on May 4, 1993, with members of the Senate Labor Committee",
    "link": "https://freerepublic.com/focus/f-chat/4296283/posts",
    "timestamp": "2025-02-09T20:10:52Z"
  },
  {
    "title": "Trump to Unleash Musk, DOGE on Military: Expects to Find 'Fraud and Abuse'",
    "description": "President Donald Trump sat down with Fox News political anchor Bret Baier ahead of the Super Bowl.",
    "link": "https://www.newsweek.com/trump-unleash-musk-doge-military-expects-find-fraud-abuse-2028497",
    "timestamp": "2025-02-09T20:10:46Z"
  },
  {
    "title": "Trump Unleashes Chaos At NOAA, US Weather And Climate Agency",
    "description": "By Lauren Rosenthal and Brian K Sullivan Feb 8, 2025 (Bloomberg) –The email arrived in US government workers’ inboxes just after 1 a.m. East Coast time on Friday, with the subject...",
    "link": "https://gcaptain.com/trump-unleashes-chaos-at-noaa-us-weather-and-climate-agency/",
    "timestamp": "2025-02-09T20:06:25Z"
  },
  {
    "title": "Here's What RFK Jr. Can and Can't Do if Confirmed as HHS Chief",
    "description": "This is a MedPage Today story.\n\nPresident Trump said he would take health agencies in a new direction on the campaign trail and has chosen some controversial nominees to help him achieve his goal, including Robert F. Kennedy Jr., Trump's pick for HHS secretar…",
    "link": "https://abcnews.go.com/Health/wireStory/rfk-jr-confirmed-hhs-chief-118192010",
    "timestamp": "2025-02-09T20:05:53Z"
  },
  {
    "title": "Who Are the Acting Heads of Federal Health Agencies?",
    "description": "This is a MedPage Today story.\n\nAs President Donald Trump's picks to lead federal health agencies await confirmation hearings, there are now acting directors in place at HHS and its key sub-agencies.\n\nHere is what is known about who is currently running the s…",
    "link": "https://abcnews.go.com/Health/wireStory/acting-heads-federal-health-agencies-118235545",
    "timestamp": "2025-02-09T20:05:53Z"
  },
  {
    "title": "HHS Employees Sort Out Return-to-Office Mandate",
    "description": "This is a MedPage Today story.\n\nEmployees at HHS and its various sub-agencies are struggling to figure out how to implement President Donald Trump's executive order requiring them to report in-person to their work sites full-time, and how the changes will aff…",
    "link": "https://abcnews.go.com/Health/wireStory/hhs-employees-sort-return-office-mandate-118451884",
    "timestamp": "2025-02-09T20:05:45Z"
  },
  {
    "title": "‘No thanks’: White South Africans turn down Trump’s US immigration offer",
    "description": "US president's executive order provides resettlement for Afrikaners 'who are victims of unjust racial discrimination'.",
    "link": "https://www.aljazeera.com/news/2025/2/9/no-thanks-white-south-africans-turn-down-trumps-us-immigration-offer",
    "timestamp": "2025-02-09T20:03:47Z"
  },
  {
    "title": "Netanyahu says Trump 'very determined' to implement Gaza 'take-over' plan",
    "description": "Many other country’s, including allies of the United States, denounced Trump’s proposal.",
    "link": "https://www.thejournal.ie/netanyahu-says-trump-very-determined-to-implement-gaza-take-over-by-united-states-6618357-Feb2025/",
    "timestamp": "2025-02-09T20:03:04Z"
  },
  {
    "title": "'Hungry, barefoot, constant fear': Ex-hostage families describe captivity horrors, praise Trump",
    "description": "The families of Ohad Ben Ami, Eli Sharabi, and Or Levy held press conferences at their respective hospitals, describing their relatives's experiences.",
    "link": "https://www.jpost.com/israel-news/article-841379",
    "timestamp": "2025-02-09T20:02:30Z"
  },
  {
    "title": "Musk will help uncover ‘hundreds of billions’ in US govt fraud – Trump",
    "description": "President Donald Trump said in remarks airing Sunday that Elon Musk, who is presiding over a purge of US government jobs, will help find “hundreds of billions of dollars of fraud” in federal agencies. Speaking in a Fox News interview set to air before the Sup…",
    "link": "https://punchng.com/musk-will-help-uncover-hundreds-of-billions-in-us-govt-fraud-trump/",
    "timestamp": "2025-02-09T20:01:13Z"
  },
  {
    "title": "Ask yourself this question, \"If 5 White teens surrounded a lone AA girl and started attacking her like a pack of feral Hyenas, mocking her looks, racially profiling her...",
    "description": "... and beating her up while uploading it to your TikTock channel, how many White people's lives would be destroyed/ended/raped?\"",
    "link": "https://freerepublic.com/focus/f-chat/4296279/posts",
    "timestamp": "2025-02-09T20:00:54Z"
  },
  {
    "title": "Trump’s team to hold Ukraine talks this week",
    "description": "US officials to visit Europe to discuss strategies for ending the Russia-Ukraine conflict, National Security Adviser Mike Waltz has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612416-trumps-team-to-hold-ukraine-talks-in-europe/",
    "timestamp": "2025-02-09T20:00:15Z"
  },
  {
    "title": "An Apolitical Win: Solar Power on Habitat Houses",
    "description": "By DR. MICHAEL SHANK With newly elected President Donald Trump declaring a national energy emergency last month to boost fossil fuels, while planning to gut environmental policies of the previous administration, there is one clean energy that’ll stay in the m…",
    "link": "https://energycentral.com/c/ec/apolitical-win-solar-power-habitat-houses",
    "timestamp": "2025-02-09T19:58:22Z"
  },
  {
    "title": "Two of President Trump's sons dined at a New Orleans institution before the Super Bowl",
    "description": "Donald Trump Jr. and President Donald Trump's youngest son, Barron, ate at Antoine's in New Orleans Sunday afternoon prior to Super Bowl LIX, The Times-Picayune has learned.",
    "link": "https://www.theadvocate.com/baton_rouge/sports/president-trump-new-orleans-antoines/article_4ccebe3d-a6e0-56b4-bacb-5de712acc199.html",
    "timestamp": "2025-02-09T19:58:00Z"
  },
  {
    "title": "CBS News Finds Trump With RECORD Approval Rating – 70 Percent Say President Is ‘Doing What He Promised’",
    "description": "President Donald Trump enjoyed the highest approval rating of either of his terms in office this past week with Americans still divided against him, polling from CBS News found. CBS News/YouGov poll released a poll Sunday, conducted from Feb. 5 to Feb. 7, tha…",
    "link": "https://www.mediaite.com/tv/cbs-news-finds-trump-with-record-approval-rating-70-percent-say-president-is-doing-what-he-promised/",
    "timestamp": "2025-02-09T19:57:41Z"
  },
  {
    "title": "Trump releases statement ahead of Super Bowl LIX",
    "description": "President Donald Trump released a statement ahead of Super Bowl LIX on Sunday. He's expected to be at the Caesars Superdome in New Orleans.",
    "link": "https://www.foxnews.com/sports/trump-releases-statement-ahead-super-bowl-lix",
    "timestamp": "2025-02-09T19:56:37Z"
  },
  {
    "title": "White House defends efforts to shut down foreign aid agency",
    "description": "White House national security adviser Michael Waltz on Sunday defended President Donald Trump’s plan to shut down the country’s chief foreign aid agency, contending that “all too often” it was not aligned with U.S. strategic interests and wastes money.\n\n\nWalt…",
    "link": "https://www.voanews.com/a/white-house-defends-efforts-to-shut-down-foreign-aid-agency/7968670.html",
    "timestamp": "2025-02-09T19:51:57Z"
  },
  {
    "title": "“JESUS vs DONALD” #JvsD",
    "description": "Trumpism is no political system, it’s a cult: the cult of brute force, the cult of “If you’re not like me, i.e. a Straight White Rich Guy, go fuck yourself!”.\nYou don’t fight a cult with arguments, you fight it with a better cult: the cult of generosity, of o…",
    "link": "https://www.pauljorion.com/blog_en/2025/02/09/jesus-vs-donald-jvsd/",
    "timestamp": "2025-02-09T19:46:42Z"
  },
  {
    "title": "Secret Service Taps 'Transformers' Director For $2 Million Recruitment Ad to Air During Super Bowl: Report",
    "description": "The Secret Service has enlisted Hollywood director Michael Bay to produce a $2 million recruitment ad slated for debut during the Super Bowl pregame in New Orleans.",
    "link": "https://www.ibtimes.com/secret-service-taps-transformers-director-2-million-recruitment-ad-air-super-bowl-3763051",
    "timestamp": "2025-02-09T19:43:49Z"
  },
  {
    "title": "Trump Asks Secret Service for 'Every Bit of Information' Regarding Assassination Attempts, Says Agency Has 'Held It Back Long Enough'",
    "description": "President Donald Trump has demanded that the Secret Service provide \"every bit of information\" on two assassination attempts, insisting they \"held it back long enough.\"",
    "link": "https://www.ibtimes.com/trump-asks-secret-service-information-assassination-attempts-held-back-long-enough-3763050",
    "timestamp": "2025-02-09T19:42:27Z"
  }
]