[
  {
    "title": "'Interesting': Trump takes brazen shot at victim of political violence",
    "description": "Donald Trump on Saturday once again lashed out against a victim of political violence.Trump over the weekend took to his own social media site, Truth Social, to target the first woman elected U.S. House speaker, Rep. Nancy Pelosi. The president also took a sh…",
    "link": "https://www.rawstory.com/trump-takes-shot-victim-violence/",
    "timestamp": "2025-08-09T23:12:39Z"
  },
  {
    "title": "CDC shooter believed COVID vaccine made him suicidal, his father tells police",
    "description": "The 30-year-old shooter also tried to get into the CDC’s headquarters in Atlanta but was stopped by guards before driving to a pharmacy across the street and opening fire.",
    "link": "https://www.wpxi.com/news/local/cdc-shooter-believed-covid-vaccine-made-him-suicidal-his-father-tells-police/WHECNTX3BBBNDHDRD7TSFSQWEU/",
    "timestamp": "2025-08-09T23:11:11Z"
  },
  {
    "title": "Vance and Lammy host Ukraine talks ahead of US-Russia summit",
    "description": "Ukraine's Volodymyr Zelensky rules out giving up land, as European security officials meet in the UK.",
    "link": "https://www.bbc.com/news/articles/c3dp119lk5xo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-09T23:10:33Z"
  },
  {
    "title": "It shocked the market but has China's DeepSeek changed AI?",
    "description": "Some six months after DeepSeek shook Silicon Valley, is the Chinese AI chatbot still relevant?",
    "link": "https://www.bbc.com/news/articles/c4gez754mn6o",
    "timestamp": "2025-08-09T23:06:23Z"
  },
  {
    "title": "Underwood: Health insurance costs for Illinoisans expected to rise ‘in most if not every way’ by 2026",
    "description": "Illinois residents could pay hundreds more for their marketplace insurance plans in 2026, said U.S. Rep. Lauren Underwood, D-Naperville, to dozens of constituents Saturday.",
    "link": "https://www.shawlocal.com/news/2025/08/09/underwood-health-insurance-costs-for-illinoisans-expected-to-rise-in-most-if-not-every-way-by-2026/",
    "timestamp": "2025-08-09T23:03:29Z"
  },
  {
    "title": "Oscar-winning actress reveals Donald Trump asked her out on a date on the day she got divorced",
    "description": "Thompson divorced her ex-husband in 1995 after he had reportedly engaged in an affair with Helena Bonham Carter.",
    "link": "https://pagesix.com/2025/08/09/celebrity-news/oscar-winning-actress-reveals-donald-trump-asked-her-out-on-a-date-on-the-day-she-got-divorced/",
    "timestamp": "2025-08-09T23:01:24Z"
  },
  {
    "title": "‘The Pitt’ season two will depict Trump’s Medicaid cuts, immigrant healthcare in new storyline",
    "description": "Executive producers of \"The Pitt\" plan to feature President Trump's \"Big, Beautiful Bill\" and Medicaid changes in the Pittsburgh hospital drama's upcoming second season.",
    "link": "https://www.foxnews.com/media/the-pitt-season-two-depict-trumps-medicaid-cuts-immigrant-healthcare-new-storyline",
    "timestamp": "2025-08-09T23:00:56Z"
  },
  {
    "title": "Can Bitcoin Reclaim Its All-Time High? Analyst Points To Key Level For A Comeback",
    "description": "The Bitcoin price has been enjoying some form of resurgence over the past week, returning above the significant $115,000 level again. The premier cryptocurrency briefly crossed the $117,000 mark on Friday, August 8, capitalizing on recent bullish developments…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-reclaim-all-time-high/",
    "timestamp": "2025-08-09T23:00:21Z"
  },
  {
    "title": "Unraveling claim Pete Buttigieg's DOT spent $80B on 'DEI' initiatives while delaying air traffic control upgrades",
    "description": "A New York Post article spreading the rumor did not provide a clear definition of what it considered a diversity, equity and inclusion initiative.",
    "link": "https://www.snopes.com//news/2025/08/09/air-traffic-control-dei-buttigieg/",
    "timestamp": "2025-08-09T23:00:00Z"
  },
  {
    "title": "WH said to be considering inviting Zelensky to Alaska meeting",
    "description": "The administration of United States President Donald Trump is reportedly considering inviting Ukrainian President Volodymyr Zelensky to the scheduled meeting between Trump and Russian President Vladim...",
    "link": "https://biztoc.com/x/e6e5e85a11a3d17e",
    "timestamp": "2025-08-09T22:59:47Z"
  },
  {
    "title": "Trump Says Upcoming Press Conference 'Will, Essentially, Stop Violent Crime' In DC",
    "description": "The president has notably supported congressional efforts for a federal takeover of the city several times over the past six months.",
    "link": "https://www.huffpost.com/entry/trump-press-conference-will-stop-violent-crime-washington-dc_n_68978b7ce4b05bc4a489eb05",
    "timestamp": "2025-08-09T22:58:51Z"
  },
  {
    "title": "Trump nominates Tammy Bruce as US deputy representative to UN",
    "description": "President Trump announced he is nominating State Department spokesperson Tammy Bruce to be the next U.S. deputy representative to the United Nations.",
    "link": "https://nypost.com/2025/08/09/us-news/trump-nominates-tammy-bruce-as-us-deputy-representative-to-un/",
    "timestamp": "2025-08-09T22:57:34Z"
  },
  {
    "title": "Sliwa urges Trump to stay out of NYC mayoral race (Brady Knox/Washington Examiner)",
    "description": "Brady Knox / Washington Examiner:\nSliwa urges Trump to stay out of NYC mayoral race  —  New York City Republican mayoral candidate Curtis Sliwa publicly asked President Donald Trump not to intervene in the city's mayoral race.  —  Trump has taken a personal i…",
    "link": "https://www.memeorandum.com/250809/p53",
    "timestamp": "2025-08-09T22:55:01Z"
  },
  {
    "title": "White House is considering inviting Zelenskyy to Alaska - NBC News",
    "description": "White House is considering inviting Zelenskyy to AlaskaNBC News Trump-Putin summit in Alaska resembles a slow defeat for UkraineCNN White House considering inviting Zelenskyy to Trump-Putin meeting in Alaska - reportsnews.sky.com Instead of sanctions, Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178628474",
    "timestamp": "2025-08-09T22:53:02Z"
  },
  {
    "title": "2016 intel report was tasked to probe Chinese election meddling, but instead focused just on Russia",
    "description": "Russia! Russia! Russia! Obama's now-obliterated intel assessment on foreign influence in the 2016 election was supposed to also research China's history of hacking U.S. presidential campaigns. Despite that task, the assessment never mentioned Beijing at all, …",
    "link": "https://freerepublic.com/focus/f-news/4333662/posts",
    "timestamp": "2025-08-09T22:50:16Z"
  },
  {
    "title": "Howard Stern psyched up as rumors swirl around show closure, ‘bring it on’: sources",
    "description": "An inside source speculated Howard Stern might move to Netflix or HBO Max.",
    "link": "https://nypost.com/2025/08/09/us-news/stern-insider-says-howard-in-his-element-as-fate-of-future-looms/",
    "timestamp": "2025-08-09T22:49:30Z"
  },
  {
    "title": "Fox Analyst Warns Trump Over Redistricting Texas: Not A ‘Declaration of Strength and Confidence’",
    "description": "Former Representative Harold Ford Jr. (D-TN) warned President Donald Trump — and his Fox co-hosts — against redistricting Texas on Friday’s episode of The Five, saying the move is not “a declaration of strength and confidence” ahead of the midterms. “If we al…",
    "link": "https://www.mediaite.com/media/tv/fox-analyst-warns-trump-over-redistricting-texas-not-a-declaration-of-strength-and-confidence/",
    "timestamp": "2025-08-09T22:47:57Z"
  },
  {
    "title": "Yankees legend Mariano Rivera injures Achilles at team's Old-Timers' Day game: report",
    "description": "Yankees Hall of Fame pitcher Mariano Rivera injured an Achilles during Saturday's Old-Timers' Day game and required hospitalization, according to sources.",
    "link": "https://www.foxnews.com/sports/yankees-legend-mariano-rivera-suffers-achilles-injury-teams-old-timers-day-game-report",
    "timestamp": "2025-08-09T22:40:52Z"
  },
  {
    "title": "Thousands rally in Tel Aviv against Netanyahu’s new Gaza plan",
    "description": "Protesters demanded an immediate end to the Gaza campaign and call for the release of the hostages.",
    "link": "https://www.abc.net.au/news/2025-08-10/thousands-protest-in-tel-aviv-against-gaza-plan/105633588",
    "timestamp": "2025-08-09T22:37:15Z"
  },
  {
    "title": "Laura Loomer knocks Medal of Honor recipient in new attack on Army (Washington Post)",
    "description": "Washington Post:\nLaura Loomer knocks Medal of Honor recipient in new attack on Army  —  The unofficial adviser to President Donald Trump chastised Army Secretary Dan Driscoll over a social media post recognizing Florent Groberg, a decorated soldier who backed…",
    "link": "https://www.memeorandum.com/250809/p52",
    "timestamp": "2025-08-09T22:35:01Z"
  },
  {
    "title": "Jon Jones officially returns to UFC drug testing pool after announcing his retirement less than two months ago",
    "description": "Jones follows Conor McGregor in hopes of booking a fight for the card expected to take place at the White House",
    "link": "https://www.cbssports.com/mma/news/jon-jones-officially-returns-to-ufc-drug-testing-pool-after-announcing-his-retirement-less-than-two-months-ago/",
    "timestamp": "2025-08-09T22:31:36Z"
  },
  {
    "title": "Hundreds cheer Arizona Sen. Ruben Gallego as Democrats take offensive against Trump's tax bill",
    "description": "Hundreds of Democrats cheered Sen. Ruben Gallego in eastern Iowa as the Arizona Democrat criticized President Donald Trump's tax bill at a town hall meeting in Davenport",
    "link": "https://abcnews.go.com/Politics/wireStory/hundreds-cheer-arizona-sen-ruben-gallego-democrats-offensive-124514397",
    "timestamp": "2025-08-09T22:30:30Z"
  },
  {
    "title": "Callous and manipulative: Study says 'malevolent personality traits' dominate Trump voters",
    "description": "PsyPost reports a new psychological study has found that people who claim favorable views of President Donald Trump also tend to score higher on measures of callousness, manipulation, and other malevolent traits—and lower on empathy and compassion.“Our findin…",
    "link": "https://www.rawstory.com/trump-voters-malevolent-personality-study/",
    "timestamp": "2025-08-09T22:29:14Z"
  },
  {
    "title": "Russians Warn ‘Titanic Efforts’ Are Underway to Disrupt the Trump-Putin Meeting in Alaska",
    "description": "As a result of the eleventh-hour trip from US Special Envoy Steve Witkoff to Moscow, a meeting between Donald J. Trump and Russian President Vladimir Putin became a reality – and what’s more, both sides now firmly believe that there’s an acceptable plan being…",
    "link": "https://freerepublic.com/focus/f-news/4333661/posts",
    "timestamp": "2025-08-09T22:28:49Z"
  },
  {
    "title": "Crypto may be coming to 401(k) plans, but it’ll be a while before it’s easily accessible",
    "description": "The crypto market this week cheered as President Donald Trump signed an executive order meant to open retirement plans to alternative assets including cryptocurrencies. The move from the White House has the potential to be a game changer for the adoption of d…",
    "link": "https://biztoc.com/x/6afe4caa2309700d",
    "timestamp": "2025-08-09T22:26:01Z"
  },
  {
    "title": "Trump nominates State Department spokeswoman Tammy Bruce as UN deputy representative",
    "description": "Tammy Bruce, a U.S. State Department spokesperson, has been nominated by President Donald Trump to become the next U.N. deputy representative.",
    "link": "https://www.foxnews.com/politics/trump-nominates-state-department-spokeswoman-tammy-bruce-un-deputy-representative",
    "timestamp": "2025-08-09T22:20:39Z"
  },
  {
    "title": "Vance in UK for high-stakes diplomacy day after Trump announces Putin meeting",
    "description": "Vice President JD Vance met with EU allies and Ukrainian officials -- less than a week President Donald Trump and Russian President Vladimir Putin are set to meet.",
    "link": "https://abcnews.go.com/International/vance-uk-high-stakes-diplomacy-day-after-trump/story?id=124514600",
    "timestamp": "2025-08-09T22:19:22Z"
  },
  {
    "title": "Report: White House considering inviting Zelensky to Alaska summit",
    "description": "Trump earlier announced a Aug. 15 meeting with Russian President Putin",
    "link": "https://www.wnd.com/2025/08/report-white-house-considering-inviting-zelensky-alaska-summit/",
    "timestamp": "2025-08-09T22:19:01Z"
  },
  {
    "title": "Qatar-Donated 747-8 Spotted In Texas Ahead Of ‘Air Force One’ Refit",
    "description": "The VIP-configured B747-8, which will be converted into Air Force One, was photographed departing Alliance Fort Worth en route to Waco. On Aug. 8, the Boeing 747-8 N7478D, donated by Qatar to U.S. President Donald Trump, was photographed at Alliance Fort Wort…",
    "link": "https://theaviationist.com/2025/08/10/qatar-donated-747-8-spotted/",
    "timestamp": "2025-08-09T22:17:38Z"
  },
  {
    "title": "DOJ targets New York attorney general. Here's what to know",
    "description": "President Donald Trump's Justice Department is zeroing in on New York Attorney General Letitia James.",
    "link": "https://www.wbaltv.com/article/justice-department-probes-letitia-james-trump-judgement/65644134",
    "timestamp": "2025-08-09T22:08:39Z"
  },
  {
    "title": "DOJ targets New York attorney general. Here's what to know",
    "description": "President Donald Trump's Justice Department is zeroing in on New York Attorney General Letitia James.",
    "link": "https://www.wcvb.com/article/justice-department-probes-letitia-james-trump-judgement/65644134",
    "timestamp": "2025-08-09T22:08:27Z"
  },
  {
    "title": "DOJ targets New York attorney general. Here's what to know",
    "description": "President Donald Trump's Justice Department is zeroing in on New York Attorney General Letitia James.",
    "link": "https://www.wmur.com/article/justice-department-probes-letitia-james-trump-judgement/65644134",
    "timestamp": "2025-08-09T22:08:18Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump orderlocal10.com",
    "link": "https://www.local10.com//business/2025/08/09/commercial-fishing-in-a-vast-pacific-nature-area-is-halted-after-a-judge-blocks-a-trump-order/",
    "timestamp": "2025-08-09T22:07:32Z"
  },
  {
    "title": "Emma Thompson Jokes She Could Have ‘Changed the Course of American History’ by Accepting Trump’s Date Offer",
    "description": "\"Well, that’s very sweet. Thank you so much. I’ll get back to you,\" the \"Primary Colors\" actress recalls telling the now-president in 1998\nThe post Emma Thompson Jokes She Could Have ‘Changed the Course of American History’ by Accepting Trump’s Date Offer app…",
    "link": "https://www.thewrap.com/emma-thompson-donald-trump-date-locarno-film-festival/",
    "timestamp": "2025-08-09T22:03:47Z"
  },
  {
    "title": "Trump names spokesperson Bruce for deputy UN rep",
    "description": "United States President Donald Trump announced that he was nominating the State Department spokesperson, Tammy Bruce, for the position of Deputy Representative of the United States to the United Natio...",
    "link": "https://biztoc.com/x/bc827acdc6eccd51",
    "timestamp": "2025-08-09T22:03:37Z"
  },
  {
    "title": "White House considering inviting Zelenskyy to Trump-Putin meeting in Alaska - reports",
    "description": "The White House is considering inviting Volodymyr Zelenskyy to a meeting between Donald Trump and Vladimir Putin in Alaska, according to reports in the US.",
    "link": "https://news.sky.com/story/white-house-considering-inviting-zelenskyy-to-trump-putin-meeting-in-alaska-reports-13409490",
    "timestamp": "2025-08-09T22:03:00Z"
  },
  {
    "title": "White House is considering inviting Zelenskyy to Alaska",
    "description": "WASHINGTON — The White House is considering inviting Ukrainian President Volodymyr Zelenskyy to Alaska, where President Donald Trump is scheduled to meet with Russian President Vladimir Putin next week, according to a senior U.S. official and three people bri…",
    "link": "https://biztoc.com/x/863160edb43e9992",
    "timestamp": "2025-08-09T21:52:34Z"
  },
  {
    "title": "Fishing in vast Pacific nature area halted after judge blocks Trump order",
    "description": "Environmentalists challenged Trump's rollback of federal ocean protections.",
    "link": "https://abcnews.go.com/Business/wireStory/commercial-fishing-vast-pacific-nature-area-halted-after-124513767",
    "timestamp": "2025-08-09T21:47:35Z"
  },
  {
    "title": "Fed Gov. Bowman wants three interest rate cuts in 2025",
    "description": "The Federal Reserve has not approved an interest rate cut since before the Nov. 5 election, but one of its governors said she wants three rate cuts this year...",
    "link": "https://www.upi.com/Top_News/US/2025/08/09/federal-reserve-rate-bowman/1681754774717/",
    "timestamp": "2025-08-09T21:43:05Z"
  },
  {
    "title": "Ousted vaccine regulator Vinay Prasad to return to FDA",
    "description": "Laura Loomer, an ally of Donald Trump, had said Prasad was not aligned with the president’s agenda and has aggressively lobbied against his return.",
    "link": "https://fortune.com/2025/08/09/vinay-prasad-fda-return-vaccine-regulator-laura-loomer/",
    "timestamp": "2025-08-09T21:42:54Z"
  },
  {
    "title": "America's New Woke Goddess Sydney Sweeney Set to Rake in $10Millon as Face of Bud Light After Brand’s Trans Scandal",
    "description": "Experts estimate Sweeney could earn a pay day of up to $10 million from Bud Light’s parent company, Anheuser-Busch.",
    "link": "https://radaronline.com/p/america-sydney-sweeney-10millon-bud-light-brands-trans-scandal/",
    "timestamp": "2025-08-09T21:40:00Z"
  },
  {
    "title": "Love Actually: Emma Thompson says she could’ve ‘changed the course of American history’ by accepting date with Trump",
    "description": "The ‘Nanny McPhee’ star said Trump got her phone number by ‘stalking’",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/emma-thompson-donald-trump-date-b2804917.html",
    "timestamp": "2025-08-09T21:39:44Z"
  },
  {
    "title": "Trump eyes reclassifying marijuana as less dangerous drug: report",
    "description": "President Donald Trump is reportedly eyeing reclassifying marijuana as a less dangerous drug.",
    "link": "https://nypost.com/2025/08/09/us-news/trump-eyes-reclassifying-marijuana-as-less-dangerous-drug-report/",
    "timestamp": "2025-08-09T21:36:51Z"
  },
  {
    "title": "Hundreds cheer Arizona Sen. Ruben Gallego as Democrats take offensive against Trump's tax bill",
    "description": "Hundreds of people cheered Sen. Ruben Gallego at a town hall meeting in eastern Iowa Saturday as the first-term Arizona Democrat assailed the massive...",
    "link": "https://www.yahoo.com/news/articles/hundreds-cheer-arizona-sen-ruben-213650016.html",
    "timestamp": "2025-08-09T21:36:50Z"
  },
  {
    "title": "John Leguizamo Slams “Loser” Dean Cain For Joining ICE: “Your Pronouns Are Has/Been”",
    "description": "John Leguizamo is not mincing words in addressing Dean Cain’s recent decision to join ICE. The Bob Trevino Likes It star, who has been a vocal critic of ICE’s increasingly militant behavior toward immigrants, took to his Instagram Friday to share his thoughts…",
    "link": "http://deadline.com/2025/08/john-leguizamo-slams-dean-cain-joining-ice-1236483026/",
    "timestamp": "2025-08-09T21:30:47Z"
  },
  {
    "title": "Goldberg: Trump Was Making The International Sign For \"I'm Building A Dome\" When He Was On The White House Roof",
    "description": "WASHINGTON WEEK: President Trump will slap tariffs on any country, at any time, for any reason. It’s a dramatic and destabilizing way to manage America’s economy and our relationships with other countries. Join moderator Jeffrey Goldberg, Jonathan Karl of ABC…",
    "link": "https://www.realclearpolitics.com/video/2025/08/09/goldberg_trump_was_making_the_international_sign_for_im_building_a_dome_when_he_was_on_the_white_house_roof.html",
    "timestamp": "2025-08-09T21:29:02Z"
  },
  {
    "title": "White House is considering inviting Zelenskyy to Alaska",
    "description": "WASHINGTON — The White House is considering inviting Ukrainian President Volodymyr Zelenskyy to Alaska, where President Donald Trump is scheduled to meet with Russian President Vladimir Putin next week, according to a senior U.S. official and three people bri…",
    "link": "https://www.nbcnews.com/politics/trump-administration/white-house-considering-inviting-zelenskyy-alaska-rcna224070",
    "timestamp": "2025-08-09T21:27:03Z"
  },
  {
    "title": "Why the Democrats are in such a terrible state",
    "description": "'As often happens, they abused power: manipulating the electoral process, weaponizing the justice system'",
    "link": "https://www.wnd.com/2025/08/why-democrats-are-such-terrible-state/",
    "timestamp": "2025-08-09T21:26:45Z"
  },
  {
    "title": "‘Raging Psychopath!’ Mark Levin Trades Brutal Insults With ‘Disgusting Antisemite’ and ‘Clown’ Marjorie Taylor Greene",
    "description": "Mark Levin and Marjorie Taylor Greene went scorched earth in dueling social media posts on Saturday, trading brutal barbs and insults.\nThe post ‘Raging Psychopath!’ Mark Levin Trades Brutal Insults With ‘Disgusting Antisemite’ and ‘Clown’ Marjorie Taylor Gree…",
    "link": "https://www.mediaite.com/media/news/raging-psychopath-mark-levin-trades-brutal-insults-with-disgusting-antisemite-and-clown-marjorie-taylor-greene/",
    "timestamp": "2025-08-09T21:26:20Z"
  },
  {
    "title": "Zelensky rejects land swap idea floated by Trump",
    "description": "Vladimir Zelensky has rebuked the suggestion made by US President Donald Trump a potential peace deal with Russia could involve a land swap Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622713-zelensky-trump-land-swap/",
    "timestamp": "2025-08-09T21:22:27Z"
  },
  {
    "title": "Pennsylvania bill would let illegal immigrants pay same tuition as in-state residents",
    "description": "Americans from out of state still would have to pay higher tuition price Anyone who has lived in Pennsylvania for at least 12 months “regardless of immigration status” would be eligible for in-state tuition under a new bill. Introduced by state Rep. Greg Scot…",
    "link": "https://freerepublic.com/focus/f-news/4333651/posts",
    "timestamp": "2025-08-09T21:17:18Z"
  },
  {
    "title": "Fed Governor Bowman says weak jobs report backs her view for 3 rate cuts this year",
    "description": "Bowman said she is getting more confident that Trump's tariffs “will not present a persistent shock to inflation” and sees it moving closer to 2%.",
    "link": "https://fortune.com/2025/08/09/fed-rate-cuts-outlook-michelle-bowman-jobs-report-inflation-tariffs/",
    "timestamp": "2025-08-09T21:16:25Z"
  },
  {
    "title": "Vinay Prasad Returns To Role As Top Vaccine Regulator At FDA Days After Leaving U.S. Agency",
    "description": "Prasad, an oncologist who was a fierce critic of U.S. COVID-19 vaccine and mask mandates, was named the center's director in May.",
    "link": "https://www.huffpost.com/entry/vinay-prasad-vaccine-regulator-fda_n_6897b873e4b041ecaf505cb3",
    "timestamp": "2025-08-09T21:13:33Z"
  },
  {
    "title": "Trump nominates ex-Fox News host Tammy Bruce as deputy UN ambassador",
    "description": "Bruce, who is currently spokeswoman for the state department, has done \"brilliantly\" according to Trump.",
    "link": "https://www.bbc.com/news/articles/cj9wv49xr0xo",
    "timestamp": "2025-08-09T21:07:54Z"
  },
  {
    "title": "Why young Americans dread turning 26: Health insurance chaos",
    "description": "Amid the challenges of adulthood, there is one rite of passage unique to the US: the need to find your own health insurance by the time you turn 26.",
    "link": "https://www.bostonglobe.com/2025/08/09/nation/why-young-americans-dread-turning-26-health-insurance-chaos/",
    "timestamp": "2025-08-09T21:07:37Z"
  },
  {
    "title": "Four astronauts home from space station after splashdown",
    "description": "WASHINGTON: An international crew of four astronauts is back home on Earth Saturday (Aug 9) after nearly five months aboard the International Space Station, returning safely in a SpaceX capsule. The spacecraft carrying US astronauts Anne McClain and Nichole A…",
    "link": "https://www.channelnewsasia.com/world/astronauts-spacex-nasa-return-outerspace-5286966",
    "timestamp": "2025-08-09T21:06:35Z"
  },
  {
    "title": "Trump Pal And MAGA Influencer Attacks Rep. Jasmine Crockett With Racist Term",
    "description": "The far-right activist quoted a post on X that referenced Crockett’s alleged treatment of her staff.",
    "link": "https://www.huffpost.com/entry/laura-loomer-jasmine-crockett-racially-charged-term_n_6897a03ae4b0e3a604531f55",
    "timestamp": "2025-08-09T21:00:47Z"
  },
  {
    "title": "Emma Thompson Says Donald Trump Was Basically 'Stalking' Her Right After Divorce",
    "description": "Emma Thompson says Donald Trump tried to see if there was any \"Love Actually\" between them ... though he did it in a way that sorta weirded her out. The actress was dishing about a few different topics at the Locarno Film Festival in Switzerland…\n Permalink",
    "link": "https://www.tmz.com/2025/08/09/emma-thompson-donald-trump-stalk-ask-out-date-after-divorce/",
    "timestamp": "2025-08-09T20:59:57Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "HONOLULU (AP) — Commercial fishing that recently resumed in a vast protected area of the Pacific Ocean must halt once again, after a judge in Hawaii sided this week with environmentalists challenging a Trump administration rollback of federal ocean protection…",
    "link": "https://financialpost.com/pmn/commercial-fishing-in-a-vast-pacific-nature-area-is-halted-after-a-judge-blocks-a-trump-order",
    "timestamp": "2025-08-09T20:59:09Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "Commercial fishing that recently resumed in a vast protected area of the Pacific Ocean must halt once again, after a judge in Hawaii sided this week with...",
    "link": "https://www.yahoo.com/news/articles/commercial-fishing-vast-pacific-nature-205554082.html",
    "timestamp": "2025-08-09T20:55:54Z"
  },
  {
    "title": "A new bull market has begun and is still in the early stages, so buy the dips, top Wall Street analyst says",
    "description": "Wilson's view is part of an increased sense of optimism on Wall Street as fears over tariffs ease with the signing of several trade deals.",
    "link": "https://fortune.com/2025/08/09/new-bull-market-buy-the-dips-stock-outlook-sp500/",
    "timestamp": "2025-08-09T20:55:03Z"
  },
  {
    "title": "Zelenskyy calls for 'lasting peace', not 'pause in the killings', after officials meet in UK",
    "description": "Ukrainian President Volodymyr Zelenskyy says a meeting with European and US officials to discuss the ongoing war with Russia was constructive.",
    "link": "https://www.abc.net.au/news/2025-08-10/ukraine-officials-meet-european-us-leaders/105633512",
    "timestamp": "2025-08-09T20:53:44Z"
  },
  {
    "title": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace deal - Reuters",
    "description": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters President Trump Brokers Another Historic Peace DealThe White House (.gov) Iran rejects planned transit corridor outlined in Armenia-Azerbaijan pactAl Jazeera Donald Trump …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178627668",
    "timestamp": "2025-08-09T20:52:28Z"
  },
  {
    "title": "'The Pitt' Season 2 Will Deal with Trump Administration's Medicaid Cuts, Noah Wyle Says",
    "description": "Noah Wyle is sharing how reality will be reflected in season 2 of The Pitt. HBO Max‘s medical drama didn’t shy away from the reality of an hour in the emergency room during the first season. According to the 54-year-old star and producer of the series, they p…",
    "link": "https://www.justjared.com/2025/08/09/the-pitt-season-2-will-deal-with-trump-administrations-medicaid-cuts-noah-wyle-says/",
    "timestamp": "2025-08-09T20:51:20Z"
  },
  {
    "title": "'Unprecedented': Ex-GOP insider flags 'evidence' Trump 'thinks his supporters are garbage'",
    "description": "Donald Trump on Saturday was accused of committing \"unprecedented treachery\" as he displays \"disdain\" for his own supporters.According to Steve Schmidt, an independent political strategist who worked on former President George W. Bush's campaign, Trump recent…",
    "link": "https://www.rawstory.com/trump-supporters-garbage-steve-schmidt/",
    "timestamp": "2025-08-09T20:48:30Z"
  },
  {
    "title": "Gold plaque, Olympic medals and a jet: Here are the gifts Trump has accepted (Josephine Walker/Axios)",
    "description": "Josephine Walker / Axios:\nGold plaque, Olympic medals and a jet: Here are the gifts Trump has accepted  —  Donald Trump received a glass disc with a 24-karat gold base from Apple CEO Tim Cook on Wednesday, as the tech titan announced a $100 billion investment…",
    "link": "https://www.memeorandum.com/250809/p37",
    "timestamp": "2025-08-09T20:45:01Z"
  },
  {
    "title": "Europe and Ukraine press US ahead of Trump-Putin talks",
    "description": "KYIV/LONDON: European officials were reported to have presented their own Ukraine peace proposals to the United States on Saturday (Aug 9) as President Donald Trump prepared for talks with Russian President Vladimir Putin on ending the war.",
    "link": "https://www.channelnewsasia.com/world/europe-and-ukraine-press-us-ahead-trump-putin-talks-5286951",
    "timestamp": "2025-08-09T20:44:00Z"
  },
  {
    "title": "Trump–Newsom feud could end the governor’s career as White House bid looms",
    "description": "The escalating conflict between California Governor Gavin Newsom and former President Donald Trump takes stage on immigration raids and political disagreements. With the protests, lawsuits, and criticisms, their rivalry will impact the 2028 presidential elect…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumpnewsom-feud-could-end-the-governors-career-as-white-house-bid-looms/articleshow/123210825.cms",
    "timestamp": "2025-08-09T20:40:43Z"
  },
  {
    "title": "GOP Congressman on Trump Tariffs: ‘Steel Prices Are Up’ but It’s ‘For the Good of the Country’",
    "description": "Rep. Ralph Norman (R-SC) acknowledged that prices were up as a result of President Donald Trump’s tariffs, yet emphasized that it’s “for the good of the country” in a Saturday appearance on Fox Report With Jon Scott. Host Jon Scott asked the congressman, who …",
    "link": "https://www.mediaite.com/media/tv/gop-congressman-on-trump-tariffs-steel-prices-are-up-but-its-for-the-good-of-the-country/",
    "timestamp": "2025-08-09T20:39:54Z"
  },
  {
    "title": "Ukraine’s backers make counter-offer ahead of Alaska talks – WSJ",
    "description": "Kiev and several of its backers have reportedly told US officials that only a “reciprocal” territory swap with Moscow is possible Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622711-wsj-europeans-ukraine-prepare-counterproposal-us/",
    "timestamp": "2025-08-09T20:39:26Z"
  },
  {
    "title": "Trump Nominates State Department Spokeswoman Tammy Bruce as Deputy U.S. Representative to the United Nations",
    "description": "President Donald Trump announced Saturday he will nominate Tammy Bruce, currently the State Department’s spokeswoman, to serve as Deputy U.S. Representative to the United Nations with the rank of ambassador.\nThe post Trump Nominates State Department Spokeswom…",
    "link": "https://www.breitbart.com/politics/2025/08/09/trump-nominates-state-department-spokeswoman-tammy-bruce-as-deputy-u-s-representative-to-the-united-nations/",
    "timestamp": "2025-08-09T20:36:56Z"
  },
  {
    "title": "New Zealand and Australia seek closer military ties following Chinese live-fire naval exercise",
    "description": "The leaders of New Zealand and Australia on Saturday discussed closer cooperation between they their expanding militaries against the backdrop of a recent extraordinary Chinese live-fire exercise near their shores. New Zealand Prime Minister Christopher Luxon…",
    "link": "https://japantoday.com/category/world/new-zealand-and-australia-seek-closer-military-ties-following-chinese-live-fire-naval-exercise",
    "timestamp": "2025-08-09T20:36:11Z"
  },
  {
    "title": "Four astronauts return home from space station after splashdown",
    "description": "An international crew of four astronauts is back home on Earth Saturday after nearly five months aboard the International Space Station, returning safely in a SpaceX capsule. The spacecraft carrying U.S. astronauts Anne McClain and Nichole Ayers, Japan's Taku…",
    "link": "https://japantoday.com/category/world/four-astronauts-home-from-space-station-after-splashdown",
    "timestamp": "2025-08-09T20:35:34Z"
  },
  {
    "title": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace deal",
    "description": "Iran threatened on Saturday to block a corridor planned in the Caucasus under a regional deal sponsored by U.S. President Donald Trump, Iranian media reported, raising a new question mark over a peace plan hailed as a strategically important shift. A top Azer…",
    "link": "https://japantoday.com/category/world/iran-threatens-planned-trump-corridor-envisaged-by-azerbaijan-armenia-peace-deal",
    "timestamp": "2025-08-09T20:34:50Z"
  },
  {
    "title": "Whitmer tells Trump in private that Michigan auto jobs depend on a tariff change of course",
    "description": "Michigan Gov. Gretchen Whitmer met privately in the Oval Office with President Donald Trump to make a case he did not want to hear: the automotive industry he said he wants to save were being hurt by his tariffs. The Democrat came with a slide deck to make he…",
    "link": "https://japantoday.com/category/world/whitmer-told-trump-in-private-that-michigan-auto-jobs-depend-on-a-tariff-change-of-course",
    "timestamp": "2025-08-09T20:34:27Z"
  },
  {
    "title": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations",
    "description": "Ukrainian President Volodymyr Zelenskyy on Saturday rejected the idea that his country would give up land to end the war with Russia after U.S. President Donald Trump suggested a peace deal could include “some swapping of territories.” Zelenskyy said Ukraine …",
    "link": "https://japantoday.com/category/world/zelenskyy-rejects-formally-ceding-ukrainian-territory-says-kyiv-must-be-part-of-any-negotiations",
    "timestamp": "2025-08-09T20:34:08Z"
  },
  {
    "title": "ICE arrests Guatemalan workers heading to work harvesting berries, advocate group says",
    "description": "The four arrests mark the first publicly known detainment of fieldworkers by ICE agents in Oregon since President Donald Trump took office for his second term.",
    "link": "https://www.oregonlive.com/news/2025/08/ice-arrests-guatemalan-workers-heading-to-work-harvesting-berries-advocate-group-says.html",
    "timestamp": "2025-08-09T20:32:30Z"
  },
  {
    "title": "Emma Thompson reveals Donald Trump asked her out on a date on the day she got divorced - Daily Mail",
    "description": "Emma Thompson reveals Donald Trump asked her out on a date on the day she got divorcedDaily Mail Emma Thompson On Donald Trump Stalking Her On ‘Primary Colors’ SetDeadline Emma Thompson Talks About Donald Trump's 1990s Dinner Invite, Evoking Sliding Doors Pos…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178627534",
    "timestamp": "2025-08-09T20:32:14Z"
  },
  {
    "title": "Old footage of the president defending convicted rapist Mike Tyson has resurfaced as speculation mounts that the president may pardon Ghislaine Maxwell.",
    "description": "President Donald Trump’s shocking defense of a champion boxer who raped a teenage girl has resurfaced as the president faces intense scrutiny of his...",
    "link": "https://www.thedailybeast.com/president-donald-trumps-vile-take-on-teenagers-rape-goes-viral-as-his-jeffrey-epstein-woes-deepen/",
    "timestamp": "2025-08-09T20:27:14Z"
  },
  {
    "title": "Trump accepts plaque with 24k gold base amid surge of lavish gifts",
    "description": "Donald Trump received a glass disc with a 24-karat gold base from Apple CEO Tim Cook on Wednesday, as the tech titan announced a $100 billion investment in U.S. manufacturing facilities.\nWhy it matters: The gold bauble is the latest lavish gift presented to T…",
    "link": "https://biztoc.com/x/2617cabc4cfa486b",
    "timestamp": "2025-08-09T20:23:11Z"
  },
  {
    "title": "Trump nominates Bruce as US deputy representative to UN",
    "description": "US President Donald Trump said he was nominating State Department spokesperson Tammy Bruce as the next US deputy representative to the United Nations.",
    "link": "https://www.rte.ie/news/world/2025/0809/1527711-trump-bruce-un/",
    "timestamp": "2025-08-09T20:23:05Z"
  },
  {
    "title": "Trump nominates Bruce as US deputy representative to UN",
    "description": "US President Donald Trump said he was nominating State Department spokesperson Tammy Bruce as the next US deputy representative to the United Nations.",
    "link": "https://www.rte.ie/news/us/2025/0809/1527711-trump-bruce-un/",
    "timestamp": "2025-08-09T20:23:05Z"
  },
  {
    "title": "IRS Chief Forced Out After Immigrant Tax Data Pushback—Report",
    "description": "The IRS previously agreed to a data-sharing scheme with the Department of Homeland Security to use some sensitive information to identify illegal immigrants.",
    "link": "https://www.newsweek.com/irs-chief-forced-immigrant-tax-data-pushback-report-2111292",
    "timestamp": "2025-08-09T20:22:58Z"
  },
  {
    "title": "Tyrant Trump's Worst Crimes, Dangers, and Destructions Are Yet to Come",
    "description": "The worst crimes of Donald Trump and dangers to America from the unstable, monomaniacal, lying outlaw in the White House have yet to come. He is not satisfied with tearing apart our country’s social safety net for tens of millions of Americans (e.g., Medicaid…",
    "link": "https://www.commondreams.org/opinion/trump-attacks-on-democracy-institutions",
    "timestamp": "2025-08-09T20:14:52Z"
  },
  {
    "title": "Armenians and Azerbaijanis greet US-brokered peace deal with hope but also caution",
    "description": "Residents and politicians in Armenia and Azerbaijan are responding with cautious hope after their leaders signed a U.S.-brokered agreement aimed at ending decades of hostilities",
    "link": "https://abcnews.go.com/International/wireStory/armenians-azerbaijanis-greet-us-brokered-peace-deal-hope-124513324",
    "timestamp": "2025-08-09T20:14:27Z"
  },
  {
    "title": "Zelenskyy says no to territorial concessions: ‘Ukrainians will not give their land to the occupier’",
    "description": "Ukraine won't surrender land to Russia to buy peace, President Volodymyr Zelenskyy warned Saturday, after Washington and Moscow agreed to hold a summit in a bid to end the war.\nPresidents Vladimir Putin and Donald Trump will meet in the US state of Alaska nex…",
    "link": "https://biztoc.com/x/1691c8aa9dc198f3",
    "timestamp": "2025-08-09T20:12:03Z"
  },
  {
    "title": "Trump Nominates Admin Spokesperson, Former TV Host to UN Role",
    "description": "The former Fox host and contributor is one of many to be moved to roles within the Trump administration.",
    "link": "https://www.newsweek.com/trump-nominates-admin-spokesperson-former-tv-host-un-role-2111294",
    "timestamp": "2025-08-09T20:08:37Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.news4jax.com/news/politics/2025/08/09/a-top-federal-reserve-official-says-dour-jobs-data-backs-the-case-for-3-rate-cuts/",
    "timestamp": "2025-08-09T20:05:20Z"
  },
  {
    "title": "Armenians and Azerbaijanis greet US-brokered peace deal with hope but also caution",
    "description": "By LILIT MKHITARYAN YEREVAN, Armenia (AP) — Residents and politicians in Armenia and Azerbaijan responded Saturday with cautious hope — and skepticism in some cases — after their leaders signed a U.S.-brokered agreement at the White House aimed at ending deca…",
    "link": "https://www.denverpost.com/2025/08/09/armenians-and-azerbaijanis-greet-us-brokered-peace-deal-with-hope-but-also-caution/",
    "timestamp": "2025-08-09T20:05:17Z"
  },
  {
    "title": "Exclusive -- Former Sen. Scott Brown: 'I Saw the Unfairness of Trade' Firsthand",
    "description": "\"I saw the unfairness of trade\" firsthand, former Sen. Scott Brown, running for retiring Democrat Sen. Jeanne Shaheen’s seat in New Hampshire, said during an appearance on Breitbart News Saturday, harkening to his time as ambassador to New Zealand during Pres…",
    "link": "https://www.breitbart.com/politics/2025/08/09/exclusive-former-sen-scott-brown-i-saw-the-unfairness-of-trade-firsthand/",
    "timestamp": "2025-08-09T20:03:06Z"
  },
  {
    "title": "Zelenskyy says no to territorial concessions: ‘Ukrainians will not give their land to the occupier’",
    "description": "\"Any decisions against us, any decisions without Ukraine, are also decisions against peace,\" he said",
    "link": "https://www.euractiv.com/section/politics/news/zelenskyy-says-no-to-territorial-concessions-ukrainians-will-not-give-their-land-to-the-occupier/",
    "timestamp": "2025-08-09T20:01:36Z"
  },
  {
    "title": "Trump-Putin summit in Alaska resembles a slow defeat for Ukraine",
    "description": "Location matters, former real estate mogul US President Donald Trump said. Moments later he announced Alaska, a place sold by Russia to the United States 158 years ago for $7.2 million, would be where Russian President Vladimir Putin tries to sell his land de…",
    "link": "https://freerepublic.com/focus/f-news/4333645/posts",
    "timestamp": "2025-08-09T20:00:30Z"
  },
  {
    "title": "Trump is letting Putin manipulate him, again (Max Boot/Washington Post)",
    "description": "Max Boot / Washington Post:\nTrump is letting Putin manipulate him, again  —  The president's desperation to end the Ukraine war might lead to another Munich moment with Russia.  —  Just now  —  President Donald Trump's unhealthy obsession with winning the Nob…",
    "link": "https://www.memeorandum.com/250809/p34",
    "timestamp": "2025-08-09T19:55:01Z"
  },
  {
    "title": "Diddy Lawyer Thinks Rapper Could Align With Trump If Pardoned: ‘It Would Not Surprise Me’ | Video",
    "description": "The two reality television vets share an \"affinity\" after experiencing the legal system, Mark Geragos says\nThe post Diddy Lawyer Thinks Rapper Could Align With Trump If Pardoned: ‘It Would Not Surprise Me’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/diddy-trial-attorney-trump-pardon-alliance/",
    "timestamp": "2025-08-09T19:54:40Z"
  }
]