[
  {
    "title": "Vance Tries to Convince Americans That Trump Wants ‘Full Transparency’ in Epstein Case",
    "description": "The vice president pointed a finger at Democratic billionaires and politicians in an attempt to distract from the president's close relationship with the deceased sex trafficker",
    "link": "http://www.rollingstone.com/politics/politics-news/vance-democrat-politicians-billionaires-epstein-trump-1235404710/",
    "timestamp": "2025-08-10T19:52:08Z"
  },
  {
    "title": "EU, NATO chiefs back Ukraine ahead of Trump-Putin summit",
    "description": "European foreign ministers will hold a video call on Monday to discuss how to best support Ukraine ahead of a summit between the US and Russia. European leaders continued on Sunday to push to have Ukraine involved in the negotiations between the United States…",
    "link": "https://www.dw.com/en/eu-nato-chiefs-back-ukraine-ahead-of-trump-putin-summit/a-73593501",
    "timestamp": "2025-08-10T19:50:00Z"
  },
  {
    "title": "EU, NATO chief back Ukraine ahead of Trump-Putin summit",
    "description": "European foreign ministers will hold a video call on Monday to discuss how to best support Ukraine ahead of a summit betwen the US and Russia. European leaders continue to push to have Ukraine involved in the negotiations between the United States and Russia,…",
    "link": "https://www.dw.com/en/eu-nato-chief-back-ukraine-ahead-of-trump-putin-summit/a-73593501",
    "timestamp": "2025-08-10T19:50:00Z"
  },
  {
    "title": "Binance Founder Zhao Seeks Pardon From Trump For Money-Laundering Violations",
    "description": "Changpeng Zhao, the founder of the cryptocurrency exchange Binance, is seeking a pardon from President Donald Trump for money-laundering violations.\nWhat Happened: Zhao has been out of prison for two years and is now pushing for a pardon, backed by a sophisti…",
    "link": "https://biztoc.com/x/7805d46a1908a6b2",
    "timestamp": "2025-08-10T19:47:49Z"
  },
  {
    "title": "Nvidia claps back against Chinese accusations its H20 chips pose a security risk",
    "description": "Nvidia pushed back Sunday in response to allegations from Chinese state media that its H20 artificial intelligence chips are a national security risk for China.",
    "link": "https://www.cnbc.com/2025/08/10/nvidia-china-h20-chips.html",
    "timestamp": "2025-08-10T19:47:28Z"
  },
  {
    "title": "Trump on Pelosi's Investments: 'INSIDE INFORMATION,' 'Is Anybody Looking Into This?'",
    "description": "President Donald Trump has leveled allegations against Rep. Nancy Pelosi (D-Calif.) and her husband Paul Pelosi, accusing them of leveraging insider information for stock market profits.\nWhat Happened: Trump took to his Truth Social platform on Saturday to vo…",
    "link": "https://biztoc.com/x/1077b59f78aeaa87",
    "timestamp": "2025-08-10T19:47:19Z"
  },
  {
    "title": " The Saudi Al-Hadath news channel reports: \nIran to Hezbollah last night: it will start channeling additional funds to the organization",
    "description": "The Saudi Al-Hadath news channel reports: \"Iran sent messages to Hezbollah last night, stating that it will start channeling additional funds to the organization through various countries around the world, as well as transferring weapons and means of warfare …",
    "link": "https://freerepublic.com/focus/f-news/4333811/posts",
    "timestamp": "2025-08-10T19:47:09Z"
  },
  {
    "title": " The Saudi Al-Hadath news channel reports: Iran to Hezbollah last night: it will start channeling additional funds to the organization",
    "description": "The Saudi Al-Hadath news channel reports: \"Iran sent messages to Hezbollah last night, stating that it will start channeling additional funds to the organization through various countries around the world, as well as transferring weapons and means of warfare …",
    "link": "https://freerepublic.com/focus/f-chat/4333811/posts",
    "timestamp": "2025-08-10T19:47:09Z"
  },
  {
    "title": "Joy Behar Net Worth 2025: How Much Money Does ‘The View’ Host Make?",
    "description": "The veteran co-host has entertained 'The View' audiences for years. Find out how much she’s earned on the show and what her net worth is here.",
    "link": "https://hollywoodlife.com/feature/joy-behar-net-worth-2025-view-host-5433835/",
    "timestamp": "2025-08-10T19:45:19Z"
  },
  {
    "title": "Trump is rushing to build his ballroom. A review process could take years. (Jonathan Edwards/Washington Post)",
    "description": "Jonathan Edwards / Washington Post:\nTrump is rushing to build his ballroom.  A review process could take years.  —  The National Capital Planning Commission, which has yet to consider the massive project, has taken years to approve much smaller changes at the…",
    "link": "https://www.memeorandum.com/250810/p47",
    "timestamp": "2025-08-10T19:45:01Z"
  },
  {
    "title": "‘You’re Using The Same Tactics’: JB Pritzker Ducks Question When Pressed On Illinois Gerrymandering Hypocrisy",
    "description": "Democratic Gov. J.B. Pritzker ducked questions from Kristen Welker about Illinois’ congressional map while claiming Republicans were trying to “steal seats.”",
    "link": "https://dailycaller.com/2025/08/10/youre-using-the-same-tactics-jb-pritzker-ducks-question-when-pressed-on-illinois-gerrymandering-hypocrisy/",
    "timestamp": "2025-08-10T19:42:13Z"
  },
  {
    "title": "My Tom L post inspired a mathematical definition of Rabbithole",
    "description": "NICK: I read and enjoyed your blog post on Tom L (see  here ). I then spend 40 minutes down a rabbithole listening to his music on YouTube. ...",
    "link": "https://blog.computationalcomplexity.org/2025/08/my-tom-l-post-inspired-mathematical.html",
    "timestamp": "2025-08-10T19:41:00Z"
  },
  {
    "title": "WATCH: JD Vance Says ‘You’re Going To See a Lot of Indictments’ Over Democrats Attempts to Manipulate 2016 Election",
    "description": "Vice President JD Vance told Maria Bartiromo on Sunday Morning Futures that Americans are going to “see a lot of indictments” over the Democrats plot to manipulate the 2016 election.\nThe post WATCH: JD Vance Says ‘You’re Going To See a Lot of Indictments’ Ove…",
    "link": "https://www.thegatewaypundit.com/2025/08/watch-jd-vance-says-youre-going-see-lot/",
    "timestamp": "2025-08-10T19:40:24Z"
  },
  {
    "title": "WEEKLY PREVIEW: Trump-Putin meeting in focus",
    "description": "Next week's political news cycle will be dominated by the upcoming meeting between United States President Donald Trump and Russian President Vladimir Putin, scheduled for August 15 in Alaska. Ukraini...",
    "link": "https://biztoc.com/x/a5407b519253320f",
    "timestamp": "2025-08-10T19:36:32Z"
  },
  {
    "title": "Trump on Pelosi's Investments: 'INSIDE INFORMATION,' 'Is Anybody Looking Into This?'",
    "description": "President Donald Trump has leveled allegations against Rep. Nancy Pelosi (D-Calif.) and her husband Paul Pelosi, accusing them of leveraging insider...",
    "link": "https://finance.yahoo.com/news/trump-pelosis-investments-inside-information-193603696.html",
    "timestamp": "2025-08-10T19:36:03Z"
  },
  {
    "title": "Marlow: Trump Is 'Robustly' Going After Democrats 'Who Are Clearly Breaking the Law'",
    "description": "On this week's broadcast of Newsmax TV's \"Sunday Report,\" Breitbart Editor-in-Chief Alex Marlow said it is a significant development that President Donald Trump was robustly going after Democrats who are breaking the law.\nThe post Marlow: Trump Is ‘Robustly’ …",
    "link": "https://www.breitbart.com/clips/2025/08/10/marlow-trump-is-robustly-going-after-democrats-who-are-clearly-breaking-the-law/",
    "timestamp": "2025-08-10T19:34:22Z"
  },
  {
    "title": "JD Vance Cites Democrats Own Ties To Jeffrey Epstein In Latest Defense",
    "description": "Vance had a distraction tactic ready to go while appearing on Fox News this weekend.",
    "link": "https://www.huffpost.com/entry/jd-vance-democrats-epstein_n_6898b40ce4b07a70fa08a786",
    "timestamp": "2025-08-10T19:32:31Z"
  },
  {
    "title": "The Irish Times view on the Trump/Putin meeting: Ukraine must be at the table",
    "description": "Calls  from EU countries for Volodymyr Zelenskiy to be present should be heeded.",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/08/10/the-irish-times-view-on-the-trumpputin-meeting-ukraine-must-be-at-the-table/",
    "timestamp": "2025-08-10T19:31:00Z"
  },
  {
    "title": "Ukraine Must Be Included in Trump-Putin Peace Talks, Says Sanders",
    "description": "Echoing the concerns of Ukrainian President Volodymyr Zelenskyy and European leaders about an upcoming summit between U.S. President Donald Trump and Russian President Vladimir Putin, Sen. Bernie Sanders on Sunday said the interests of Ukrainians must be repr…",
    "link": "https://www.commondreams.org/news/trump-putin-talks",
    "timestamp": "2025-08-10T19:23:08Z"
  },
  {
    "title": "Donald Trump says homeless people must leave Washington DC and government will house them 'far from the capital'",
    "description": "President Donald Trump pledged on Sunday to evict homeless people from the nation's capital and jail criminals, despite Washington's mayor arguing there is no current spike in crime.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-homeless-people-must-leave-washington-dc-and-government-will-house-them-far-from-the-capital/a1912588497.html",
    "timestamp": "2025-08-10T19:17:09Z"
  },
  {
    "title": "Trump isn't coming to save Palestinians, hostages or Israel from itself in Gaza",
    "description": "Trump has done nothing with his presidential podium to ease Gaza's starvation crisis or halt Israel's latest plan to seize Gaza City. Really, he's an opportunist who will take credit for a win and pass the buck when it evades him",
    "link": "https://www.haaretz.com/israel-news/haaretz-today/2025-08-10/ty-article/.highlight/trump-isnt-coming-to-save-palestinians-hostages-or-israel-from-itself-in-gaza/00000198-93f1-d0f9-afbe-dbfd7d740000",
    "timestamp": "2025-08-10T19:15:56Z"
  },
  {
    "title": "European leaders urge for Ukraine to be included in Trump-Putin Alaska peace talks",
    "description": "Some European leaders say that Ukraine must be included in any talks with Russia over ending the war.",
    "link": "https://www.npr.org/2025/08/10/nx-s1-5497742/europe-trump-putin-alaska-ukraine-talks",
    "timestamp": "2025-08-10T19:15:39Z"
  },
  {
    "title": "‘I watched it… he’s some player’ – Donald Trump FaceTimes Scotland’s Grant Forrest following Nexo Championship victory on home soil",
    "description": "Grant Forrest eased to victory on home soil for the second time in his career with a four-shot success at the Nexo Championship – and then received a video call from United States president Donald Trump.",
    "link": "https://www.independent.ie/sport/golf/i-watched-it-hes-some-player-donald-trump-facetimes-scotlands-grant-forrest-following-nexo-championship-victory-on-home-soil/a1819404524.html",
    "timestamp": "2025-08-10T19:12:53Z"
  },
  {
    "title": "Netanyahu and Trump discuss plans to seize the remaining Hamas strongholds in Gaza",
    "description": "Two leaders discussed Israel's plans to seize the remaining Hamas strongholds in Gaza to end the war through the release of hostages and the defeat of Hamas.",
    "link": "https://www.israelnationalnews.com/news/413056",
    "timestamp": "2025-08-10T19:11:00Z"
  },
  {
    "title": "Carville: The Only Way to Save Democracy Is to Rig the System So Much that Republicans Always Lose",
    "description": "Nothing says \"saving democracy\" and \"preserving norms\" like totally rigging the system. It's like calling sterilizing and mutilating children \"care.\" A complete inversion of reality wrapped up in comforting words. Since at least 2016, the Democrats have focus…",
    "link": "https://freerepublic.com/focus/f-news/4333803/posts",
    "timestamp": "2025-08-10T19:02:27Z"
  },
  {
    "title": "On US soil, Pakistan’s Asim Munir threatens to nuke and take half the world down",
    "description": "Pakistan’s Army Chief, Field Marshal Asim Munir, warned of a nuclear response if Pakistan faced an existential threat from India. Speaking at a Tampa event, Munir also criticised India over water disputes, military losses and strategic policies, according to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/pakistan-army-chief-threatens-to-nuke-and-take-half-the-world-down-field-marshal-asim-munir-warned-of-a-nuclear-response-against-india-on-us-soil-indus-waters-treaty-private-dinner-in-tampa-florida/articleshow/123222893.cms",
    "timestamp": "2025-08-10T19:02:22Z"
  },
  {
    "title": "What is the American Worker Rebate Act of 2025? Status update on Trump stimulus check",
    "description": "Wondering if we are getting stimulus checks or an economic relief package 2025? See status update on Trump tariff rebate check amounts, qualifications",
    "link": "https://www.app.com/story/money/2025/08/10/are-we-getting-a-stimulus-check-2025-economic-relief-package-irs-wheres-my-refund-tariff-rebate-tax/85601713007/",
    "timestamp": "2025-08-10T19:01:32Z"
  },
  {
    "title": "US-Russian ballerina reflects on release from Russian penal colony after year-long ordeal",
    "description": "Dual citizen Ksenia Karelina freed in prisoner swap after Russia detained her for Ukraine donation, later met with President Trump in Oval Office.",
    "link": "https://www.foxnews.com/media/us-russian-ballerina-reflects-release-from-russian-penal-colony-after-year-long-ordeal",
    "timestamp": "2025-08-10T19:01:01Z"
  },
  {
    "title": "North Carolina GOP Exposes Governor Roy Cooper’s Hidden Record of Extremism and Failed Leadership as He Launches Senate Bid",
    "description": "A video from the North Carolina Republican Party is shedding light on the troubling tenure of outgoing Governor Roy Cooper, who recently announced his candidacy for the U.S.\nThe post North Carolina GOP Exposes Governor Roy Cooper’s Hidden Record of Extremism …",
    "link": "https://www.thegatewaypundit.com/2025/08/north-carolina-gop-exposes-governor-roy-coopers-hidden/",
    "timestamp": "2025-08-10T19:00:47Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "‘Shocking’ attack on priest in a church, man arrested on suspicion of murder after man found dead, and Israel under pressure.",
    "link": "https://www.thejournal.ie/news-fix-10-08-25-6787231-Aug2025/",
    "timestamp": "2025-08-10T19:00:02Z"
  },
  {
    "title": "As Dollar Plummets, Is Now a Good Time To Invest in Gold?",
    "description": "With the dollar falling, gold is gaining attention—learn if now’s the right time to invest and how it could protect your portfolio.",
    "link": "https://finance.yahoo.com/news/dollar-plummets-now-good-time-185909993.html",
    "timestamp": "2025-08-10T18:59:09Z"
  },
  {
    "title": "Russian strikes kill six and wound dozens in Ukraine",
    "description": "A new round of Moscow's shelling and drone attacks killed six people and wounded dozens in Ukraine, authorities said, while Kyiv hit two oil refineries deep inside Russia.",
    "link": "https://www.rte.ie/news/world/2025/0810/1527805-russia-ukraine-strikes/",
    "timestamp": "2025-08-10T18:58:09Z"
  },
  {
    "title": "Netanyahu and Trump discuss Israel’s plans to seize the remaining Hamas strongholds in Gaza",
    "description": "The Prime Minister's Office announced that Prime Minister Benjamin Netanyahu spoke today with US President Donald Trump. The two discussed Israel’s plans to seize the remaining Hamas strongholds in Gaza to end the war through the release of hostages and the d…",
    "link": "https://www.israelnationalnews.com/flashes/664017",
    "timestamp": "2025-08-10T18:58:00Z"
  },
  {
    "title": "FBI's Kash Patel Shares Agency's Huge Wins During First 200 Days of President Trump's Administration",
    "description": "The Federal Bureau of Investigation (FBI) has been hard at work in the first 200 days of President Donald Trump's administration, and those efforts include rescuing children, stopping human traffickers, and drug seizures, FBI Director Kash Patel highlighted o…",
    "link": "https://www.breitbart.com/crime/2025/08/10/fbis-kash-patel-shares-agencys-huge-wins-during-first-200-days-of-president-trumps-administration/",
    "timestamp": "2025-08-10T18:57:58Z"
  },
  {
    "title": "NATO chief says upcoming Trump-Putin meeting will be about 'testing' Russian leader",
    "description": "President Donald Trump and Russian President Vladimir Putin will discuss territory, security guarantees and the need for Ukraine to decide its own future, NATO chief Mark Rutte said.",
    "link": "https://www.foxnews.com/politics/nato-chief-says-upcoming-trump-putin-meeting-about-testing-russian-leader",
    "timestamp": "2025-08-10T18:57:43Z"
  },
  {
    "title": "Trump, Putin peace talks in Alaska spark EU fears of a ‘one-sided’ land swap",
    "description": "“The Russian position is framed as a territorial swap”, says one official",
    "link": "https://www.euractiv.com/section/politics/news/trump-putin-peace-talks-in-alaska-spark-eu-fears-of-a-one-sided-land-swap/",
    "timestamp": "2025-08-10T18:57:08Z"
  },
  {
    "title": "Russia and US ‘very far from detente’ – Moscow",
    "description": "Russia recently ditched self-imposed restrictions on intermediate-range missiles to “cool NATO hotheads,” Deputy FM Sergey Ryabkov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622734-russian-deputy-fm-no-detente-us/",
    "timestamp": "2025-08-10T18:55:58Z"
  },
  {
    "title": "Trump Facetimes Forrest after Nexo Championship",
    "description": "Scotland's Grant Forrest is Facetimed by Donald Trump after triumphing at the Nexo Championship, played over the US President's golf course in Aberdeenshire.",
    "link": "https://www.bbc.com/sport/golf/articles/c9399nlxwnno",
    "timestamp": "2025-08-10T18:54:55Z"
  },
  {
    "title": "What Vladimir Putin wants from Donald Trump at Alaska summit",
    "description": "Russian president secures first official invitation to US in almost two decades ahead of sanctions deadline Alaska, the venue set for Vladimir Putin and Donald Trump’s meeting on Friday, could hardly be more symbolic of the Kremlin’s view of the world. Unlike…",
    "link": "https://freerepublic.com/focus/f-news/4333799/posts",
    "timestamp": "2025-08-10T18:54:13Z"
  },
  {
    "title": "Amid Trump's tariffs, Chalmers must repeat what Keating did in the 80s",
    "description": "Treasurer Jim Chalmers must find a way to repeat what Paul Keating did in the 1980s and 90s, and lift productivity. Good luck with that.",
    "link": "https://www.abc.net.au/news/2025-08-11/us-tariffs-keating-chalmers-productivity/105581020",
    "timestamp": "2025-08-10T18:51:26Z"
  },
  {
    "title": "Analyst expects gold to fall off the 'Wall of Worry'",
    "description": "Precious metals won't glitter so much at half the price.",
    "link": "https://www.thestreet.com/investing/analyst-expects-gold-to-fall-off-the-wall-of-worry",
    "timestamp": "2025-08-10T18:47:00Z"
  },
  {
    "title": "Vance Says Trump Wants US to End Financing of Conflict in Ukraine",
    "description": "WASHINGTON, (Sputnik) - US President Donald Trump wants the United States to halt the financing of the conflict in Ukraine, with US citizens tired of spending their taxes on it, US Vice President JD Vance said on Sunday.",
    "link": "https://sputnikglobe.com/20250810/vance-says-trump-wants-us-to-end-financing-of-conflict-in-ukraine-1122590311.html",
    "timestamp": "2025-08-10T18:45:43Z"
  },
  {
    "title": "‘We are at war – bring it on’: Democrats ready to fight dirty to stop Trump",
    "description": "Republican push for gerrymandered congressional maps triggers down-and-dirty from new generation – will it work?It was a stirring speech that brought Democrats to tears. “When someone is cruel or acts like a bully, you don’t stoop to their level,” Michelle Ob…",
    "link": "https://freerepublic.com/focus/f-news/4333797/posts",
    "timestamp": "2025-08-10T18:45:37Z"
  },
  {
    "title": "By day, she's in her art gallery. But nights are spent in a car park",
    "description": "Russia's relentless drone and missile attacks on Ukraine mean the arrival of long-awaited US-made patriot air defence systems cannot come soon enough.",
    "link": "https://www.abc.net.au/news/2025-08-11/kyiv-residents-welcome-new-partiot-air-defence-systems/105626508",
    "timestamp": "2025-08-10T18:44:39Z"
  },
  {
    "title": "'War of technology' given boost as Patriot air defences head to Ukraine",
    "description": "Russia's relentless drone and missile attacks on Ukraine mean the arrival of long-awaited US-made patriot air defence systems cannot come soon enough.",
    "link": "https://www.abc.net.au/news/2025-08-11/kyiv-residents-welcome-new-patriot-air-defence-systems/105626508",
    "timestamp": "2025-08-10T18:44:39Z"
  },
  {
    "title": "India world’s most ‘dashing and dynamic’ economy, some people not liking it: Rajnath",
    "description": "STATE TIMES NEWS RAISEN: Defence Minister Rajnath Singh on Sunday described India’s economy as the world’s most “dashing and dynamic” and said some people who have the attitude of “we are everyone’s boss” are not liking it.Singh’s comments come amid high tari…",
    "link": "https://statetimes.in/india-worlds-most-dashing-and-dynamic-economy-some-people-not-liking-it-rajnath/",
    "timestamp": "2025-08-10T18:44:02Z"
  },
  {
    "title": "The quiet technocrat who enacts Putin's ruthless agenda",
    "description": "Sergei Kiriyenko, a key figure in Putin's government, implements the President's policies. He manages political affairs related to the Ukraine war and domestic issues. Kiriyenko's influence has grown, taking on responsibilities from other aides. He oversees p…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-quiet-technocrat-who-enacts-putins-ruthless-agenda/articleshow/123222664.cms",
    "timestamp": "2025-08-10T18:41:59Z"
  },
  {
    "title": "White House Mulls Inviting Zelensky To Trump-Putin Talks In Alaska",
    "description": "White House Mulls Inviting Zelensky To Trump-Putin Talks In Alaska\n \nThe White House is weighing the possibility of inviting Ukrainian President Volodymyr Zelensky to Alaska for Friday's summit between Presidents Donald Trump and Vladimir Putin, several sourc…",
    "link": "https://biztoc.com/x/719368637ca2f323",
    "timestamp": "2025-08-10T18:40:58Z"
  },
  {
    "title": "Epstein Files Controversy Follows Trump, Even at Disney World",
    "description": "Unless you’ve been living under a rock, you’ve heard about the controversy surrounding the release of the Epstein Files. In short, President Donald Trump campaigned on releasing the files and exposing the wealthy and influential people behind the notorious se…",
    "link": "https://insidethemagic.net/2025/08/woman-yells-at-trump-animatronic-about-epstein-files-at-disney-world-rl1/",
    "timestamp": "2025-08-10T18:40:39Z"
  },
  {
    "title": "Pritzker: Trump Is ‘Cheating Americans Out of Their Votes’ With Gerrymandering Plans",
    "description": "Illinois Gov. J.B. Pritzker said attempts to gerrymander Texas by redrawing districts before the next Census will deny Americans their rights.",
    "link": "http://www.rollingstone.com/politics/politics-news/pritzker-trump-abbott-cheating-texas-gerrymandering-1235404675/",
    "timestamp": "2025-08-10T18:38:57Z"
  },
  {
    "title": "Summertime and the living is uneasy on Capitol Hill",
    "description": "Members of the House and Senate are on their August recess following marathon sessions and ongoing pressure to confirm President Trump's nominees.",
    "link": "https://www.foxnews.com/politics/summertime-living-uneasy-capitol-hill",
    "timestamp": "2025-08-10T18:37:40Z"
  },
  {
    "title": "What’s the fallout from a peace deal between Azerbaijan and Armenia?",
    "description": "The US brokered the agreement, giving it leverage and business opportunities.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/8/10/whats-the-fallout-from-a-peace-deal-between-azerbaijan-and-armenia",
    "timestamp": "2025-08-10T18:37:33Z"
  },
  {
    "title": "Vance Makes ‘Very Simple’ Prediction For Trump-Putin Meeting",
    "description": "Vice President JD Vance gave a preview of his expectations for President Donald Trump’s planned meeting with Russian President Vladimir Putin to discuss ending the war in Ukraine.“Look, it’s actually very simple,” Vance said during a Fox News interview with “…",
    "link": "https://freerepublic.com/focus/f-news/4333794/posts",
    "timestamp": "2025-08-10T18:30:32Z"
  },
  {
    "title": "Zelenskiy wins EU, NATO backing as he seeks place at Trump-Putin talks",
    "description": "Amidst fears of a U.S.-Russia deal sidelining Kyiv, Ukrainian President Zelenskiy secured European and NATO support before the Trump-Putin summit. Concerns arise over potential territorial concessions, with Trump hinting at a land swap. European leaders insis…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskiy-wins-eu-nato-backing-as-he-seeks-place-at-trump-putin-talks/articleshow/123222261.cms",
    "timestamp": "2025-08-10T18:29:54Z"
  },
  {
    "title": "Meidas: Trump Has Nightmare Sunday as Worldwide Protests Break Out",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump’s disastrous Sunday as protests spread around the world and he gets hit with more awful news as his cover ups backfire.",
    "link": "https://littlegreenfootballs.com/article/54824_Meidas-_Trump_Has_Nightmare_Su",
    "timestamp": "2025-08-10T18:26:45Z"
  },
  {
    "title": "Pete Hegseth Reposts Video of Pastor's Comments About a Woman's Right To Vote",
    "description": "Doug Wilson, a self-described Christian nationalist, doesn’t believe women should vote, serve in military combat, or be in church leadership.",
    "link": "https://www.vanityfair.com/news/story/pete-hegseth-reposts-controversial-pastor-comments-about-women-and-voting",
    "timestamp": "2025-08-10T18:24:49Z"
  },
  {
    "title": "UN warns of ‘calamity’ as Netanyahu pushes for Israel to seize Gaza City",
    "description": "The Israeli prime minister is pushing to take control of Gaza's largest urban hub despite a wave of global criticism.",
    "link": "https://www.aljazeera.com/news/2025/8/10/un-warns-of-calamity-as-netanyahu-pushes-for-israel-to-seize-gaza-city",
    "timestamp": "2025-08-10T18:21:21Z"
  },
  {
    "title": "Trumputin talks! India pins hopes on Alaska assembly",
    "description": "A meeting between Donald Trump and Vladimir Putin in Alaska has sparked optimism in New Delhi. India anticipates a potential agreement leading to reduced tensions and the removal of sanctions on Moscow. This could ease transactions between India and Russia. I…",
    "link": "https://economictimes.indiatimes.com/news/india/trumputin-talks-india-pins-hopes-on-alaska-assembly/articleshow/123222043.cms",
    "timestamp": "2025-08-10T18:21:17Z"
  },
  {
    "title": "Trumputin talks! India pins hopes on Alaska assembly",
    "description": "A meeting between Donald Trump and Vladimir Putin in Alaska has sparked optimism in New Delhi. India anticipates a potential agreement leading to reduced tensions and the removal of sanctions on Moscow. This could ease transactions between India and Russia. I…",
    "link": "https://economictimes.indiatimes.com/news/india/trumputin-talks-india-pins-hopes-on-alaska-assembly/articleshow/123222159.cms",
    "timestamp": "2025-08-10T18:21:17Z"
  },
  {
    "title": "Marlow: Buying Our Democracy — Meet the Billionaire Leftists Behind the Lawfare Chaos",
    "description": "A central premise \"Breaking the Law,\" my just-released exposé on the weaponization of the legal system against President Trump and his supporters, is that an objective of lawfare is to buy our democracy.\nThe post Marlow: Buying Our Democracy — Meet the Billio…",
    "link": "https://www.breitbart.com/politics/2025/08/10/marlow-buying-our-democracy-meet-the-billionaire-leftists-behind-the-lawfare-chaos/",
    "timestamp": "2025-08-10T18:20:08Z"
  },
  {
    "title": "Trump's Orders DC Homeless to 'Move Out IMMEDIATELY' (Will Neal/The Daily Beast)",
    "description": "Will Neal / The Daily Beast:\nTrump's Orders DC Homeless to ‘Move Out IMMEDIATELY’  —  ‘NO MR. NICE GUY’  —  Around 5,000 people in the nation's capital are unhoused on a given night.  —  President Donald Trump wants homeless people to evacuate the nation's ca…",
    "link": "https://www.memeorandum.com/250810/p42",
    "timestamp": "2025-08-10T18:15:00Z"
  },
  {
    "title": "Moscow Strikes Kill Six In Ukraine; Refineries Hit In Russia",
    "description": "A new round of Moscow's shelling and drone attacks killed six people and wounded dozens in Ukraine Sunday, authorities said, while Kyiv hit two oil refineries deep inside Russia.",
    "link": "https://www.ibtimes.com/moscow-strikes-kill-six-ukraine-refineries-hit-russia-3780621",
    "timestamp": "2025-08-10T18:12:16Z"
  },
  {
    "title": "Moscow strikes kill six in Ukraine; refineries hit in Russia",
    "description": "A new round of Moscow's shelling and drone attacks killed six people and wounded dozens in Ukraine Sunday, authorities said, while Kyiv hit two oil...",
    "link": "https://www.yahoo.com/news/articles/moscow-strikes-kill-six-ukraine-180628646.html",
    "timestamp": "2025-08-10T18:06:28Z"
  },
  {
    "title": "MSNBC host asks Jen Psaki if she's 'scared' of Trump administration",
    "description": "MSNBC's Ali Velshi and Jen Psaki discussed concerns about the Trump administration coming after them on Friday at the start of the former press secretary's show.",
    "link": "https://www.foxnews.com/media/msnbc-host-asks-jen-psaki-shes-scared-trump-administration",
    "timestamp": "2025-08-10T18:00:08Z"
  },
  {
    "title": "Congressman Calls for Probe of NC Group ‘Teaching Illegal Aliens How to Evade ICE’",
    "description": "A North Carolina congressman is calling attention to an anti-immigration enforcement organization that gets its donations through the Democrat fundraising platform ActBlue.   “By teaching illegal... Read More\nThe post Congressman Calls for Probe of NC Group ‘…",
    "link": "https://www.dailysignal.com/2025/08/10/congressman-calls-probe-of-nc-group-teaching-illegal-aliens-how-evade-ice/",
    "timestamp": "2025-08-10T18:00:00Z"
  },
  {
    "title": "Trump Declares War on Unhoused D.C. Residents: 'No MR. NICE GUY' (Peter Wade/Rolling Stone)",
    "description": "Peter Wade / Rolling Stone:\nTrump Declares War on Unhoused D.C. Residents: ‘No MR. NICE GUY’  —  The president said he will forcefully relocate them “FAR from the Capital”  —  Donald Trump demanded that unhoused Washington, D.C., residents “have to move out […",
    "link": "https://www.memeorandum.com/250810/p40",
    "timestamp": "2025-08-10T18:00:00Z"
  },
  {
    "title": "Trump tariffs a 'slow burn' for Wall Street, likely to hit US economy hard.",
    "description": "The reciprocal tariffs imposed by US President Donald Trump are a \"slow burn\" for Wall Street, as they rarely trigger an immediate crisis - but over time, they warp markets, squeeze consumers, and invite retaliation, according to a new report.\nInvestors and p…",
    "link": "https://biztoc.com/x/6f34f0d098032ae1",
    "timestamp": "2025-08-10T17:56:09Z"
  },
  {
    "title": "Trump says homeless people must leave Washington, DC, immediately — ‘We will give you places to stay, but FAR from the Capital’",
    "description": "President Donald Trump said Sunday that homeless people must be moved “far” from Washington, after days of musing about taking federal control of the US capital where he has falsely suggested crime is rising.\nThe Republican billionaire has announced a press c…",
    "link": "https://biztoc.com/x/37b95ed6daf6c0da",
    "timestamp": "2025-08-10T17:55:55Z"
  },
  {
    "title": "What Vladimir Putin wants from Donald Trump at Alaska summit - Financial Times",
    "description": "What Vladimir Putin wants from Donald Trump at Alaska summitFinancial Times White House hasn’t ruled out Zelensky being in Alaska during Trump-Putin meeting on FridayCNN NATO secretary general says Trump will be \"testing Putin\" in Friday meetingCBS News Putin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178635134",
    "timestamp": "2025-08-10T17:55:00Z"
  },
  {
    "title": "Trump says homeless people must leave Washington, DC, immediately — ‘We will give you places to stay, but FAR from the Capital’",
    "description": "\"I'm going to make our Capital safer and more beautiful than it ever was before,\" the president posted on his Truth Social platform Sunday.",
    "link": "https://fortune.com/2025/08/10/trump-homeless-people-washington-dc-federal-control-local-rule/",
    "timestamp": "2025-08-10T17:49:20Z"
  },
  {
    "title": "How Trump’s judicial picks could reshape abortion rights for decades - National | Globalnews.ca",
    "description": "Legal experts and abortion rights advocates warn of a methodical remaking of the federal courts in a way that could pose enduring threats to abortion access nationwide.",
    "link": "http://globalnews.ca/news/11329047/trump-federal-court-abortion-rights/",
    "timestamp": "2025-08-10T17:47:41Z"
  },
  {
    "title": "Nvidia Just Dodged an $8 Billion Bullet, Thanks to Donald Trump",
    "description": "It’s a major victory for the world’s most valuable company in the ongoing tech war. The Trump administration has reportedly granted Nvidia a license to resume selling its specialized AI chips to the lucrative Chinese market, a decision that follows months of …",
    "link": "https://biztoc.com/x/6f5f0f993eb838ff",
    "timestamp": "2025-08-10T17:45:06Z"
  },
  {
    "title": "Trump Suggests Plans to Privatize Fannie Mae and Freddie Mac, Unleashing $30 Billion Market Shake-Up",
    "description": "President Donald Trump and his team are reportedly preparing to sell shares of Fannie Mae and Freddie Mac, which are government-backed companies that support the housing market by making home loans more stable and affordable. This sale would be a significant …",
    "link": "https://freerepublic.com/focus/f-news/4333777/posts",
    "timestamp": "2025-08-10T17:43:07Z"
  },
  {
    "title": "Trump Says Homeless Need to Move Out of DC IMMEDIATELY, but Criminals Don’t Have to Because ‘We’re Going to Put You in Jail Where You Belong’",
    "description": "President Donald Trump has announced that the homeless people need to move out of DC, but criminals can stay because “we’re going to put you in jail.” The announcement, posted to Truth Social, comes one day after Trump vowed to make DC “one of the safest citi…",
    "link": "https://www.thegatewaypundit.com/2025/08/trump-says-homeless-need-move-dc-immediately-criminals/",
    "timestamp": "2025-08-10T17:40:32Z"
  },
  {
    "title": "Does Paramount Have A South Park Problem? What The New CEO Says",
    "description": "South Park's new episodes have been heavily discussed.",
    "link": "https://www.cinemablend.com/television/paramount-ceo-pleased-with-south-park-no-problem",
    "timestamp": "2025-08-10T17:39:14Z"
  },
  {
    "title": "JD Vance’s Latest Epstein Claims Lead to New Calls For Trump to Release All the Files",
    "description": "Vance sat down with Maria Bartiromo on Sunday and tried to flip the script on the ongoing fallout surrounding the Trump administration’s handling of the Jeffrey Epstein case\nThe post JD Vance’s Latest Epstein Claims Lead to New Calls For Trump to Release All …",
    "link": "https://www.mediaite.com/politics/jd-vances-latest-epstein-claims-lead-to-new-calls-for-trump-to-release-all-the-files/",
    "timestamp": "2025-08-10T17:35:47Z"
  },
  {
    "title": "‘They Broke The Law’: JD Vance Says ‘A Lot Of People’ Will Be Indicted For Russia Hoax",
    "description": "Vice President JD Vance said “aggressive violations of the law” took place during the Russiagate scandal and those involved needed to face “consequences.”",
    "link": "https://dailycaller.com/2025/08/10/they-broke-the-law-jd-vance-says-a-lot-of-people-will-be-indicted-for-russia-hoax/",
    "timestamp": "2025-08-10T17:31:42Z"
  },
  {
    "title": "Trump says that homeless people need to be moved 'far' from Washington 'immediately'",
    "description": "Trump has threatened to federalise the city and give the White House the final say in how it is run.",
    "link": "https://www.thejournal.ie/trump-says-homeless-people-need-to-be-moved-far-from-washington-6787171-Aug2025/",
    "timestamp": "2025-08-10T17:31:28Z"
  },
  {
    "title": "$600 stimulus payment for adult and dependent child in US soon? What you should know",
    "description": "Senator Josh Hawley introduced the \"American Worker Rebate Act of 2025,\" proposing rebate checks for working Americans funded by Trump's tariffs. The plan suggests a minimum of $600 per adult and child, phasing out for higher-income couples. However, the bill…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-600-stimulus-payment-for-adult-and-dependent-child-in-us-soon-what-you-should-know/articleshow/123221031.cms",
    "timestamp": "2025-08-10T17:31:24Z"
  },
  {
    "title": "‘The courts are helpless’: Inside the Trump administration’s steady erosion of judicial power | CNN Politics",
    "description": "Six months into Donald Trump’s second term, his administration is at war with the federal judiciary, evading court orders blocking its agenda, suing judges for alleged misconduct, and veering toward what multiple current and former federal judges say could be…",
    "link": "https://www.cnn.com/2025/08/10/politics/trump-administration-judicial-power",
    "timestamp": "2025-08-10T17:30:22Z"
  },
  {
    "title": "Homeless must be moved 'far' from Washington - Trump",
    "description": "US President Donald Trump has said that homeless people must be moved \"far\" from Washington, after days of musing about taking federal control of the US capital where he has falsely suggested crime is rising.",
    "link": "https://www.rte.ie/news/2025/0810/1527798-trump-homeless-washington/",
    "timestamp": "2025-08-10T17:30:01Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker blasts Texas Gov. Greg Abbott and Trump over GOP redistricting efforts",
    "description": "Illinois Gov. JB . ...Pritzker slammed President Donald Trump as a \"cheater\" and Texas Gov. Greg Abbott as a \"joke\" days after welcoming Texas Democrats who fled their state in protest of GOP-led redistricting efforts.... .",
    "link": "https://freerepublic.com/focus/f-news/4333776/posts",
    "timestamp": "2025-08-10T17:28:23Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Aug. 10, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Ukrainian Ambassador Oksana Markarova and Democratic Sen. Mark Kelly join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-08-10-2025/",
    "timestamp": "2025-08-10T17:25:51Z"
  },
  {
    "title": "Ivy League School Waives Tuition for Low-Income Students in Aid Expansion",
    "description": "Princeton University is expanding its financial aid program, waiving tuition and other costs for many low-income families.",
    "link": "https://www.newsweek.com/ivy-league-school-waives-tuition-low-income-students-aid-expansion-2111437",
    "timestamp": "2025-08-10T17:21:49Z"
  },
  {
    "title": "White House is open to bringing Ukraine, Russia together for peace talks",
    "description": "Vice President JD Vance said Sunday that it would be up to President Donald Trump to bring Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky together to broker a peace deal to end the war in Ukraine. White House officials have sugges…",
    "link": "https://freerepublic.com/focus/f-news/4333774/posts",
    "timestamp": "2025-08-10T17:20:39Z"
  },
  {
    "title": "Trump Declares War on Unhoused D.C. Residents: ‘No MR. NICE GUY’",
    "description": "The president threatened to relocate homeless people outside of Washington, D.C., and crack down on crime in the nation's capital.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-relocate-dc-homeless-1235404640/",
    "timestamp": "2025-08-10T17:18:29Z"
  },
  {
    "title": "VP Vance: America Done Funding the Ukraine War",
    "description": "State of the Union: The vice president hinted at the contours of a likely settlement to the conflict.\nThe post VP Vance: America Done Funding the Ukraine War appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/vp-vance-america-done-funding-the-ukraine-war/",
    "timestamp": "2025-08-10T17:18:27Z"
  },
  {
    "title": "Trump border wall materials sold by Biden may soon find their way back to the feds, auctioneer claims",
    "description": "FIRST ON FOX: The global government-surplus auction house that listed unused components of President Donald Trump’s border wall under the Biden administration told Fox News Digital on Friday that it plans to coordinate with the Trump administration to return …",
    "link": "https://freerepublic.com/focus/f-chat/4333771/posts",
    "timestamp": "2025-08-10T17:16:06Z"
  },
  {
    "title": "US aiming for Ukraine settlement based on current front line Vance",
    "description": "The path to ending the Ukraine conflict should be based on the existing battle lines, US Vice President J.D. Vance has said. He described it as a realistic if imperfect foundation for a negotiated peace. Speaking to Fox News, Vance credited President Donald T…",
    "link": "https://freerepublic.com/focus/f-chat/4333769/posts",
    "timestamp": "2025-08-10T17:10:34Z"
  },
  {
    "title": "Trump wants to evict homeless from Washington and send them 'far from the capital'",
    "description": "WASHINGTON (Reuters) -President Donald Trump pledged on Sunday to evict homeless people from the nation's capital and jail criminals, despite Washington's...",
    "link": "https://www.yahoo.com/news/articles/trump-wants-evict-homeless-washington-170946970.html",
    "timestamp": "2025-08-10T17:09:46Z"
  },
  {
    "title": "Dem Sen. Kelly: Trump Has Gone Too Far with Immigration Raids, Americans Don't Want This",
    "description": "Senator Mark Kelly (D-AZ) said Sunday on CBS's \"Face the Nation\" that President Donald Trump has gone too far with mass immigration raids.\"\nThe post Dem Sen. Kelly: Trump Has Gone Too Far with Immigration Raids, Americans Don’t Want This appeared first on Bre…",
    "link": "https://www.breitbart.com/clips/2025/08/10/dem-sen-kelly-trump-has-gone-too-far-with-immigration-raids-americans-dont-want-this/",
    "timestamp": "2025-08-10T17:06:55Z"
  },
  {
    "title": "After Busy First 100 Days, Germany's Merz Faces Discord At Home",
    "description": "German Chancellor Friedrich Merz has driven sweeping changes in security, economic and migration policy during his first 100 days in office, but faces widening cracks in his uneasy coalition.",
    "link": "https://www.ibtimes.com.au/after-busy-first-100-days-germanys-merz-faces-discord-home-1860053",
    "timestamp": "2025-08-10T17:06:21Z"
  },
  {
    "title": "After Busy First 100 Days, Germany's Merz Faces Discord At Home",
    "description": "German Chancellor Friedrich Merz has driven sweeping changes in security, economic and migration policy during his first 100 days in office, but faces widening cracks in his uneasy coalition.",
    "link": "https://www.ibtimes.com/after-busy-first-100-days-germanys-merz-faces-discord-home-3780609",
    "timestamp": "2025-08-10T17:06:10Z"
  },
  {
    "title": "Trump vows to make DC 'safer' and 'beautiful' as capital battles crime and homelessness",
    "description": "President Donald Trump schedules Monday press conference to detail new crackdowns on crime and homelessness in Washington D.C. following recent string of violent incidents",
    "link": "https://www.foxnews.com/politics/trump-vows-make-dc-safer-beautiful-capital-battles-crime-homelessness",
    "timestamp": "2025-08-10T17:04:29Z"
  }
]