[
  {
    "title": "TRUMP: ‘It’s the Donroe Doctrine Now’ — Monroe Doctrine Frames the U.S. Arrest of Venezuela’s Maduro",
    "description": "The arrest of Venezuelan dictator Nicolás Maduro wasn’t just a takedown — it was the most forceful revival of the Monroe Doctrine in a generation, a blunt reminder that hostile regimes and cartel‑run states in the Western Hemisphere will face consequences. An…",
    "link": "https://www.breitbart.com/border/2026/01/03/trump-its-the-donroe-doctrine-now-monroe-doctrine-frames-the-u-s-arrest-of-venezuelas-maduro/",
    "timestamp": "2026-01-03T18:26:43Z"
  },
  {
    "title": "Ukraine updates: Trump says Putin 'killing too many people'",
    "description": "US President Trump has said he is \"not thrilled with Putin\" during a press conference. Meanwhile, European security advisers are in Kyiv to discuss a 20-point peace plan put forward by Zelenskyy. DW has more. President Trump has said he's not happy with Putin…",
    "link": "https://www.dw.com/en/ukraine-updates-trump-says-putin-killing-too-many-people/live-75373512",
    "timestamp": "2026-01-03T18:26:00Z"
  },
  {
    "title": "How Trump went from boat strikes to regime change in Venezuela",
    "description": "President Donald Trump called for the US to “run” Venezuela on Saturday, shortly after the arrest of Venezuelan President Nicolás Maduro amid US strikes on the country’s capital of Caracas. The attack is a major escalation in Trump’s months-long pressure camp…",
    "link": "https://www.vox.com/politics/473935/trump-venezuela-attack-maduro-arrest-criminal-charges-what-to-know",
    "timestamp": "2026-01-03T18:24:34Z"
  },
  {
    "title": "US pretence of respecting Latin American sovereignty over",
    "description": "",
    "link": "https://www.rte.ie/news/analysis-and-comment/2026/0103/1551350-venezuela-us/",
    "timestamp": "2026-01-03T18:24:11Z"
  },
  {
    "title": "Trump Shares Maduro Capture Photos as Marco Rubio Insists Congress Could Not Have Been Notified Ahead of Time",
    "description": "Donald Trump shared several photos of the capture of Venezuela president Nicolás Maduro from what appears to be some type of situation room with military officials including Secretary of War Pete Hegseth present, moments after Marco Rubio insisted Congress wa…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-shares-maduro-capture-photos-as-marco-rubio-insists-congress-could-not-have-been-notified-ahead-of-time/",
    "timestamp": "2026-01-03T18:23:47Z"
  },
  {
    "title": "Trump: US will “run” Venezuela after Maduro capture",
    "description": "Trump outlines temporary governance, oil involvement and military readiness. Global reactions are sharply divided",
    "link": "https://www.salon.com/2026/01/03/trump-us-will-run-venezuela-after-maduro-capture/",
    "timestamp": "2026-01-03T18:22:26Z"
  },
  {
    "title": "Brewers provide update on status of Jackson Chourio, other players in Venezuela",
    "description": "Jackson Chourio has been dominating the Venezuelan winter league, though it's unclear for how much longer after U.S. military strikes.",
    "link": "https://www.jsonline.com/story/sports/mlb/brewers/2026/01/03/jackson-chourio-other-brewers-in-venezuela-amid-uncertainty/88006878007/",
    "timestamp": "2026-01-03T18:21:04Z"
  },
  {
    "title": "Trump says ‘we’re going to run’ Venezuela and is not afraid to put U.S. troops on the ground after Maduro’s capture",
    "description": "\"We're not afraid of boots on the ground. We're not afraid of it. We're we don't mind saying it, and we're gonna make sure that that country is run properly.\"",
    "link": "https://fortune.com/2026/01/03/trump-us-control-maduro-rubio-venezuela-us-troops-boots-on-the-ground/",
    "timestamp": "2026-01-03T18:21:03Z"
  },
  {
    "title": "600 drivers undergo eye and health checkup in Bokaro as part of road safety month",
    "description": "In a proactive move towards safer roads, more than 600 commercial vehicle drivers in Bokaro benefited from complimentary eye and health check-ups during a dedicated event for the 36th National Road Safety Month. This initiative prioritized the identification …",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/600-drivers-undergo-eye-and-health-checkup-in-bokaro-as-part-of-road-safety-month/articleshow/126326511.cms",
    "timestamp": "2026-01-03T18:20:48Z"
  },
  {
    "title": "Meitei group flags threat to India’s sovereignty in memo to PM Modi",
    "description": "The Meitei Heritage Society has reached out to Prime Minister Modi, raising concerns over the Chin-Kuki-Zo group’s purported international engagement, including discussions with UN organizations regarding a contentious road construction project. They warn tha…",
    "link": "https://timesofindia.indiatimes.com/city/guwahati/meitei-group-flags-threat-to-indias-sovereignty-in-memo-to-pm-modi/articleshow/126326527.cms",
    "timestamp": "2026-01-03T18:20:15Z"
  },
  {
    "title": "Trump Says US Companies Will Rebuild Venezuelan Oil Infrastructure",
    "description": "President Donald Trump said American oil companies will “spend billions of dollars” to fix oil infrastructure in Venezuela following ...",
    "link": "https://biztoc.com/x/bee50ac25df2ebfd",
    "timestamp": "2026-01-03T18:20:14Z"
  },
  {
    "title": "Ouster of Maduro government sparks celebrations among Venezuelans in South Florida",
    "description": "People gathered for a rally in Doral, Florida, as word spread that Venezuela’s president was captured and flown out of the country.",
    "link": "https://www.bostonherald.com/2026/01/03/maduro-military-capture-us-reaction/",
    "timestamp": "2026-01-03T18:19:02Z"
  },
  {
    "title": "Trump brushes off concerns about legality of US operations in Venezuela — as AOC, Hochul decry admin’s arrest of Nicolás Maduro",
    "description": "In an interview with Fox News Saturday morning, Trump brushed off concerns about the legality of the US operating in Venezuela, calling Democrats \"weak, stupid people\" after receiving criticism from Rep. Jim Himes, a top Democrat on the House Intelligence Com…",
    "link": "https://nypost.com/2026/01/03/world-news/trump-brushes-off-concerns-about-legality-of-us-operations-in-venezuela-as-aoc-hochul-decry-admins-arrest-of-nicolas-maduro/",
    "timestamp": "2026-01-03T18:17:46Z"
  },
  {
    "title": "In Venezuela Takeover, Trump Makes It All About The Oil",
    "description": "The president, who claimed to oppose involvement in “nation building,” also said the U.S. would “run” Venezuela for an indefinite period.",
    "link": "https://www.huffpost.com/entry/trump-venezuela-oil_n_69594f09e4b0993009673280",
    "timestamp": "2026-01-03T18:17:32Z"
  },
  {
    "title": "Disinformation Floods Social Media After Nicolás Maduro's Capture",
    "description": "From seemingly AI-generated videos to the recirculation of old footage, TikTok, Instagram, and X did little to stop the onslaught of misleading posts in the wake of the US invasion of Venezuela.",
    "link": "https://www.wired.com/story/disinformation-floods-social-media-after-nicolas-maduros-capture/",
    "timestamp": "2026-01-03T18:14:47Z"
  },
  {
    "title": "Trump Says US Is Going to Run Venezuela After Capturing Its Socialist Dictator",
    "description": "President Donald Trump said that the United States would seek to repair the infrastructure of Venezuela’s oil industry.",
    "link": "https://www.westernjournal.com/trump-says-us-going-run-venezuela-capturing-socialist-dictator/",
    "timestamp": "2026-01-03T18:14:41Z"
  },
  {
    "title": "Trump says U.S. is going to run Venezuela after nabbing Maduro",
    "description": "Would seek to repair nation's oil industry infrastructure",
    "link": "https://www.wnd.com/2026/01/trump-says-u-s-is-going-run-venezuela/",
    "timestamp": "2026-01-03T18:14:28Z"
  },
  {
    "title": "CJI lays foundation for seven Patna HC infrastructure projects, stresses need for tech in judicial processes",
    "description": "Patna: Chief Justice of India (CJI) Justice Surya Kant on Saturday said capacity building in judicial infrastructure was essential to meet the demands.",
    "link": "https://timesofindia.indiatimes.com/city/patna/cji-lays-foundation-for-seven-patna-hc-infrastructure-projects-stresses-need-for-tech-in-judicial-processes/articleshow/126326306.cms",
    "timestamp": "2026-01-03T18:14:28Z"
  },
  {
    "title": "Over 300,000 Californians will need to replace REAL IDs due to DMV software error",
    "description": "Due to a software error, over 300,000 Californians will need to replace their REAL IDs, the California Department of Motor Vehicles said this week. According to the department, a review of its data systems identified that some legal immigrants were issued REA…",
    "link": "https://freerepublic.com/focus/f-news/4360223/posts",
    "timestamp": "2026-01-03T18:10:30Z"
  },
  {
    "title": "AIFF likely to ease pressure on clubs, pave way for start of ISL",
    "description": "Panaji: A three-member co-ordination committee has asked the All India Football Federation (AIFF) to immediately declare commencement date for the Ind.",
    "link": "https://timesofindia.indiatimes.com/city/goa/aiff-likely-to-ease-pressure-on-clubs-pave-way-for-start-of-isl/articleshow/126326310.cms",
    "timestamp": "2026-01-03T18:09:18Z"
  },
  {
    "title": "U.S. Will Run Venezuela For Now, Second Military Wave Stands Ready",
    "description": "The United States will run the country of Venezuela until a replacement for dictator Nicolás Maduro can be found and sworn in, President Donald Trump announced at a press conference today. The Trump administration plans to send American oil companies down to …",
    "link": "https://freerepublic.com/focus/f-news/4360222/posts",
    "timestamp": "2026-01-03T18:08:48Z"
  },
  {
    "title": "‘Team’ from US to run Venezuela after ‘capture’ of Maduro",
    "description": "US President Donald Trump says a ‘team’ from the US will be running Venezuela.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/3/team-from-us-to-run-venezuela-after-capture-of-maduro",
    "timestamp": "2026-01-03T18:08:06Z"
  },
  {
    "title": "BJP to hold stir in Bokaro over municipal polls",
    "description": "On January 7, the BJP faction in Bokaro plans to stage a protest, calling for swift municipal elections throughout Jharkhand. Leading the charge, former MLAs Amar Kumar Bauri and Biranchi Narayan will spearhead the one-day rally in front of the Chas Municipal…",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/bjp-to-hold-stir-in-bokaro-over-municipal-polls/articleshow/126326251.cms",
    "timestamp": "2026-01-03T18:06:51Z"
  },
  {
    "title": "Kaun Banega Crorepati: When host Amitabh Bachchan spoke about his make-up artist reporting to work despite the demise of his brother",
    "description": "An old video of Amitabh Bachchan praising his make-up artist Deepak Sawant for 50 years of unwavering dedication has resurfaced. Bachchan highlighted Sawant's commitment, even attending work after his brother's death. The KBC 17 finale saw Bachchan get emotio…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/kaun-banega-crorepati-when-host-amitabh-bachchan-spoke-about-his-make-up-artist-reporting-to-work-despite-the-demise-of-his-brother/articleshow/126326204.cms",
    "timestamp": "2026-01-03T18:06:41Z"
  },
  {
    "title": "Trump’s Venezuelan Regime Change: Why Do People Keep Getting Him Wrong on Foreign Policy?",
    "description": "A number of thoughtful observers argued President Donald Trump would not pursue regime change in Venezuela. I was never convinced. On our podcast and in private conversations with experts and political leaders alike, I have been predicting that he would go fo…",
    "link": "https://warontherocks.com/2026/01/trumps-venezuelan-regime-change-why-do-people-keep-getting-him-wrong-on-foreign-policy/",
    "timestamp": "2026-01-03T18:06:13Z"
  },
  {
    "title": "BJP files plaint against woman for stealing party AB form",
    "description": "Mumbai: Dinesh Jagtap, office secretary of BJP, Mumbai, lodged a complaint against one Shilpa Keluskar for allegedly stealing an AB form and submittin.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/bjp-files-plaint-against-woman-for-stealing-party-ab-form/articleshow/126325806.cms",
    "timestamp": "2026-01-03T18:06:00Z"
  },
  {
    "title": "Girl’s body found in Dhubri mustard field, suspect held",
    "description": "On Saturday, tragedy struck when the lifeless body of a young college girl was found in a mustard field in Dhubri. A man named Lalchand Ali, who purportedly had romantic feelings for her, is now in custody. Her family claims she was assaulted and strangled be…",
    "link": "https://timesofindia.indiatimes.com/city/guwahati/girls-body-found-in-dhubri-mustard-field-suspect-held/articleshow/126326257.cms",
    "timestamp": "2026-01-03T18:05:41Z"
  },
  {
    "title": "Travel alert: Delta cancels Caribbean flights amid strikes in Venezuela",
    "description": "Delta Air Lines has begun canceling flights to several Caribbean destinations as it continues to monitor an evolving situation in the region tied to FAA airspace closures.",
    "link": "https://www.wsbtv.com/news/local/atlanta/travel-alert-delta-cancels-caribbean-flights-amid-strikes-venezuela/DTASPM5HCFGSHKK3WNZKDOINFE/",
    "timestamp": "2026-01-03T18:05:11Z"
  },
  {
    "title": "Marjorie Taylor Greene Rips Trump’s Strike on Venezuela: ‘MAGA Thought They Voted to End’ This — ‘Boy Were We Wrong’",
    "description": "Rep. Marjorie Taylor Greene (R-GA) — serving out her final days before stepping down from Congress — ripped President Trump's decision to strike Venezuela.\nThe post Marjorie Taylor Greene Rips Trump’s Strike on Venezuela: ‘MAGA Thought They Voted to End’ This…",
    "link": "https://www.mediaite.com/media/news/marjorie-taylor-greene-rips-trumps-strike-on-venezuela-maga-thought-they-voted-to-end-this-boy-were-we-wrong/",
    "timestamp": "2026-01-03T18:03:49Z"
  },
  {
    "title": "US allies, foes alarmed by capture of Venezuela’s Maduro",
    "description": "The US military operation that led to the capture of Venezuelan President Nicolas Madruo on Saturday sparked alarm across the international community, with allies and foes of Washington and Caracas expressing disquiet. US President Donald Trump said Nicolas M…",
    "link": "https://www.digitaljournal.com/world/us-allies-foes-alarmed-by-capture-of-venezuelas-maduro/article",
    "timestamp": "2026-01-03T18:02:20Z"
  },
  {
    "title": "Although the UN criticized Trump for harassing Venezuela, there is still no action.",
    "description": "The military intervention carried out under the orders of US President Donald Trump to arrest Venezuelan President Nicolas Maduro has been severely criticized by the United Nations. The United Nations, calling this action a \"dangerous precedent,\" has expresse…",
    "link": "https://english.gossiplankanews.com/2026/01/although-un-criticized-trump-for.html",
    "timestamp": "2026-01-03T18:00:23Z"
  },
  {
    "title": "Trump has big plans for America's 250th birthday — but not everyone is invited",
    "description": "It is entirely fitting that the US is so splintered on its semiquincentennial. Division, for the lion's share of its history, has been its default.",
    "link": "https://www.abc.net.au/news/2026-01-04/on-its-250th-birthday-america-is-being-america/106193418",
    "timestamp": "2026-01-03T18:00:00Z"
  },
  {
    "title": "2025 in Review: How Trump Reshaped America and the World",
    "description": "The president curbed illegal immigration, boosted the economy, enacted tax reform, targeted gender ideology, and resolved international conflicts.WASHINGTON—Since returning to the White House in January, President Donald Trump has rapidly reshaped America’s d…",
    "link": "https://freerepublic.com/focus/f-news/4360219/posts",
    "timestamp": "2026-01-03T17:58:49Z"
  },
  {
    "title": "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow",
    "description": "President Donald Trump on Saturday said U.S. oil companies will invest billions of dollars in Venezuela's energy sector after the overthrow of President Nicolas Maduro.\n\"We're going to have our very large United States oil companies — the biggest anywhere in …",
    "link": "https://biztoc.com/x/bb090bbec2afad68",
    "timestamp": "2026-01-03T17:57:40Z"
  },
  {
    "title": "Trump says U.S. will 'run' Venezuela until 'transition' to new president",
    "description": "U.S. President Donald Trump delivers a press conference after the capture of Venezuela President Nicolás Maduro, Washington, D.C., Saturday, Jan. 3, 2026. Credit: JIM WATSON / Getty Images\n\nJan 3, 2026 / 12:56 pm (CNA).\nU.S. President Donald Trump on Jan. 3 s…",
    "link": "https://www.catholicnewsagency.com/news/268843/trump-says-u-s-will-run-venezuela-until-transition-can-be-arranged",
    "timestamp": "2026-01-03T17:56:00Z"
  },
  {
    "title": "A timeline of the US military’s buildup and strikes against Venezuela leading to Maduro’s capture",
    "description": "A timeline of the US military’s buildup and strikes against Venezuela leading to Maduro’s capturewpxi.com",
    "link": "https://www.wpxi.com/news/local/timeline-us-militarys-buildup-strikes-against-venezuela-leading-maduros-capture/JQP2LTBFAREUZKQ34CQOVP54OI/",
    "timestamp": "2026-01-03T17:54:02Z"
  },
  {
    "title": "Trump Says 'We're Going To Run The Country' After Venezuela Military Operation",
    "description": "\"We're gonna run it, essentially,\" President Donald Trump said during a news conference about the capture of Venezuelan President Nicolas Maduro.",
    "link": "https://www.huffpost.com/entry/trump-says-were-going-to-run-the-country-after-venezuela-military-operation_n_69594c0ce4b048f68c303351",
    "timestamp": "2026-01-03T17:53:05Z"
  },
  {
    "title": "Trump signals US may expand focus to Cuba amid Venezuela operation",
    "description": "PALM ‌BEACH, Florida, ‌Jan 3 (Reuters) - ‌U.S. President Donald Trump on ‍Saturday indicated ‍that Cuba ‌could become a ‍topic ​of ⁠discussion as part of ‌broader U.S. policy ⁠in ‍the region, highlighting ‍the potential ‌for Washington to expand its focus bey…",
    "link": "https://www.thestar.com.my/news/world/2026/01/04/trump-signals-us-may-expand-focus-to-cuba-amid-venezuela-operation",
    "timestamp": "2026-01-03T17:51:00Z"
  },
  {
    "title": "Venezuelan dictator appears blindfolded, handcuffed in first picture aboard USS Iwo Jima, flown to NYC to face justice",
    "description": "The first photo of deposed Venezuelan dictator Nicolas Maduro was released by President Donald Trump.",
    "link": "https://nypost.com/2026/01/03/world-news/venezuelan-dictator-seen-in-first-picture-aboard-uss-iwo-jima-flown-to-nyc-to-face-justice/",
    "timestamp": "2026-01-03T17:50:54Z"
  },
  {
    "title": "Stimulus payment January 2026, IRS direct deposit relief payment & tariff dividend fact check",
    "description": "Rumors about new stimulus checks, IRS direct deposits, relief payments and tariff dividends swirled throughout 2025, and they’re continuing to circulate as we head into 2026. But is there any truth to them?",
    "link": "https://www.fox5atlanta.com/news/stimulus-payment-january-2026-irs-direct-deposit-relief-payment-tariff-dividend-fact-check",
    "timestamp": "2026-01-03T17:50:33Z"
  },
  {
    "title": "WATCH: Trump says U.S. is 'going to run' Venezuela until transition of power after capturing Maduro",
    "description": "Trump addressed the nation after the United States captured Venezuelan President Nicolás Maduro and flew him out of the country in a military operation early in the day that plucked a sitting leader from office.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-says-u-s-is-going-to-run-venezuela-until-transition-of-power-after-capturing-maduro",
    "timestamp": "2026-01-03T17:49:57Z"
  },
  {
    "title": "Poll of the Day: Do you support the military operation in Venezuela?",
    "description": "President Donald Trump said the U.S. plans to remain in Venezuela until a transition of power can take place.",
    "link": "https://www.klkntv.com/poll-of-the-day-do-you-support-the-military-operation-in-venezuela/",
    "timestamp": "2026-01-03T17:48:30Z"
  },
  {
    "title": "Mock house, CIA source and Special Forces: The US operation to capture Maduro",
    "description": "WASHINGTON, Jan 3 (Reuters) - At ‌4:21 on Saturday morning, President Donald Trump sent a message on his Truth Social platform: the United States had carried out a daring mission to capture Venezuelan President Nicolas Maduro and his ‌wife. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/04/mock-house-cia-source-and-special-forces-the-us-operation-to-capture-maduro",
    "timestamp": "2026-01-03T17:48:00Z"
  },
  {
    "title": "'The Actions of a Rogue State': US Lawmakers Demand Emergency Vote to Stop Trump War on Venezuela",
    "description": "Members of the US Congress on Saturday demanded emergency legislative action to prevent the Trump administration from taking further military action in Venezuela after the president threatened a \"second wave\" of attacks and said the US will control the South …",
    "link": "https://www.commondreams.org/news/war-powers-trump-venezuela",
    "timestamp": "2026-01-03T17:47:26Z"
  },
  {
    "title": "Will oil, gold, silver and copper prices rise after US attack on Venezuela? Market impact explained",
    "description": "Will oil, gold, silver and copper prices rise after US attack on Venezuela? Markets are tracking the US military action, capture of President Nicolas Maduro and oil policy signals. Experts expect short-term price reactions in commodities.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-oil-gold-silver-and-copper-prices-rise-after-us-attack-on-venezuela-market-impact-explained-nicolas-maduro-capture-trump-us-to-control-country-and-oil/articleshow/126325811.cms",
    "timestamp": "2026-01-03T17:47:21Z"
  },
  {
    "title": "Marco Rubio: Nicolas Maduro Capture Sends a Message to the World, Trump 'Is Not a Game-Player'",
    "description": "Secretary of State Marco Rubio described the operation to apprehend deposed Venezuelan dictator Nicolás Maduro late on Friday as a message to America's enemies around the world to choose cooperation over acting \"like a wild man,\" as President Donald Trump \"is…",
    "link": "https://www.breitbart.com/latin-america/2026/01/03/marco-rubio-nicolas-maduro-capture-sends-a-message-to-the-world-trump-is-not-a-game-player/",
    "timestamp": "2026-01-03T17:46:49Z"
  },
  {
    "title": "U.S. will look to tap Venezuelan oil reserves, Trump says",
    "description": "President Donald Trump said Saturday that the removal of Venezuela President Nicolás Maduro from power will open the door to the country's vast oil reserves, a move that has the potential to reshape the global energy market.“We’re going to have our very large…",
    "link": "https://biztoc.com/x/fbaa5066b7709bdb",
    "timestamp": "2026-01-03T17:46:34Z"
  },
  {
    "title": "Trump says US will occupy Venezuela and take back “our” oil",
    "description": "I second Shakezula’s recommendation that you go to the Guardian’s website for non-euphemistic coverage of Trump’s post-kidnapping/invasion press conference: The US president has claimed at the press conference now under way in Florida that the United States i…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/trump-says-us-will-occupy-venezuela-and-take-back-our-oil",
    "timestamp": "2026-01-03T17:46:25Z"
  },
  {
    "title": "The US strikes and raid that captured Venezuela's leader raise some big questions. Here's what we know.",
    "description": "Trump said the US would run Venezuela until a \"safe, proper\" election could occur, and that US oil companies would be entering Venezuela's industry.",
    "link": "https://www.businessinsider.com/what-we-know-us-assault-raid-on-venezuela-capture-maduro-2026-1",
    "timestamp": "2026-01-03T17:45:23Z"
  },
  {
    "title": "‘A Major Victory’: The Washington Post Gushes Over Trump’s Arrest of Maduro",
    "description": "The Washington Post's editorial board gushed over the operation President Donald Trump authorized to capture erstwhile Venezuelan dictator Nicolás Maduro.\nThe post ‘A Major Victory’: The Washington Post Gushes Over Trump’s Arrest of Maduro first appeared on M…",
    "link": "https://www.mediaite.com/media/news/a-major-victory-the-washington-post-gushes-over-trumps-arrest-of-maduro/",
    "timestamp": "2026-01-03T17:45:17Z"
  },
  {
    "title": "Update: Venezuela under the United States until another ruler is appointed",
    "description": "After the arrest of Venezuelan President Nicolas Maduro, US President Donald Trump, holding a special press conference, stated that the United States would govern Venezuela until a safe and orderly transfer of power took place in the country. The President em…",
    "link": "https://english.gossiplankanews.com/2026/01/update-venezuela-under-united-states.html",
    "timestamp": "2026-01-03T17:45:17Z"
  },
  {
    "title": "Trump: U.S. Will 'Run' Venezuela Until 'Proper Transition Can Take Place'",
    "description": "President Donald Trump announced the United States will \"run\" Venezuela until the time allows for a \"proper transition\" hours after American forces captured the country's now-former dictator, Nicolas Maduro, in operation \"Absolute Resolve.\"\nThe post Trump: U.…",
    "link": "https://www.breitbart.com/politics/2026/01/03/trump-u-s-will-run-venezuela-until-proper-transition-can-take-place/",
    "timestamp": "2026-01-03T17:43:35Z"
  },
  {
    "title": "Congressional Democrats rage at Trump’s Venezuela operation",
    "description": "Argue president lacked legal authority, move was counter to American interests",
    "link": "https://www.wnd.com/2026/01/congressional-democrats-rage-trumps-venezuela-operation/",
    "timestamp": "2026-01-03T17:43:09Z"
  },
  {
    "title": "Maduro's presumed successor, Venezuelan Vice President Delcy Rodriguez, is possibly in Russia: report",
    "description": "Venezuelan Vice President Delcy Rodriguez, the presumed successor to captured Venezuelan President Nicolás Maduro, is in Russia, according to a report.",
    "link": "https://www.foxnews.com/world/maduros-presumed-successor-venezuelan-vice-president-delcy-rodriguez-possibly-in-russia-report",
    "timestamp": "2026-01-03T17:43:02Z"
  },
  {
    "title": "‘We’re Not Afraid of Boots on the Ground’: Trump Suggests US Troops May Be Deployed to Ensure Venezuela is ‘Run Properly’",
    "description": "President Donald Trump did not discount the idea of keeping U.S. troops on the ground in Venezuela as the U.S. ushers in regime change.\nThe post ‘We’re Not Afraid of Boots on the Ground’: Trump Suggests US Troops May Be Deployed to Ensure Venezuela is ‘Run Pr…",
    "link": "https://www.mediaite.com/media/news/were-not-afraid-of-boots-on-the-ground-trump-suggests-us-troops-may-be-deployed-to-ensure-venezuela-is-run-properly/",
    "timestamp": "2026-01-03T17:38:49Z"
  },
  {
    "title": "Trump Says US to ‘Run Venezuela’ in Interim After Maduro",
    "description": "President Donald Trump said the US would run Venezuela until a transition could be organized, hours after a US operation captured leader Nicolás Maduro, ousting the strongman from power after months of mounting military and economic pressure on his regime.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-us-to-run-venezuela-in-interim-after-maduro",
    "timestamp": "2026-01-03T17:38:32Z"
  },
  {
    "title": "Maduro-backed TdA gang’s expansion into US cities emerges as key focus of sweeping DOJ indictment",
    "description": "Nicolas Maduro faces narco-terrorism and cocaine conspiracy charges in unsealed U.S. indictment after military operation captures Venezuelan president and wife.",
    "link": "https://www.foxnews.com/politics/maduro-backed-tda-gangs-expansion-us-cities-emerges-key-focus-sweeping-doj-indictment",
    "timestamp": "2026-01-03T17:38:26Z"
  },
  {
    "title": "President Trump: 'Brilliant' U.S. Military Operation Captured Maduro",
    "description": "President Trump called the U.S. military operation that captured Venezuelan dictator Nicolas Maduro “brilliant” in a brief phone interview with The New York Times.\nThe post President Trump: ‘Brilliant’ U.S. Military Operation Captured Maduro appeared first on…",
    "link": "https://www.breitbart.com/politics/2026/01/03/president-trump-brilliant-u-s-military-operation-captured-maduro/",
    "timestamp": "2026-01-03T17:37:06Z"
  },
  {
    "title": "Trump says he partially deserves $50M reward for capture of Venezuelan president",
    "description": "Following the unprecedented U.S. attack Saturday morning on Venezuela and subsequent capture of its president, President Donald Trump joked that he and other administration officials deserved the $50 million reward\r\n that his own Justice Department offered fo…",
    "link": "https://www.rawstory.com/trump-2674845295/",
    "timestamp": "2026-01-03T17:35:40Z"
  },
  {
    "title": "Trump vows US will 'run' Venezuela until 'safe' transition of power",
    "description": "President Donald Trump announces U.S. will 'run the country' in Venezuela temporarily after special forces captured dictator Nicolas Maduro, promising transition.",
    "link": "https://www.foxnews.com/politics/trump-vows-us-run-venezuela-until-safe-transition-power",
    "timestamp": "2026-01-03T17:35:33Z"
  },
  {
    "title": "Trump: Machado doesn't have support to run Venezuela",
    "description": "United States President Donald Trump said on Saturday that Venezuelan opposition leader Maria Corina Machado does not have the \"respect\" and \"support\" necessary to run the country following the captur...",
    "link": "https://biztoc.com/x/2d06dccf6f7f1eaa",
    "timestamp": "2026-01-03T17:35:27Z"
  },
  {
    "title": "Trump: US to sell large volumes of oil to other countries",
    "description": "United States President Donald Trump said Saturday the US will begin selling large amounts of oil internationally following the military operation in Venezuela.\n\"We are going to take tremendous ...",
    "link": "https://biztoc.com/x/4d8672616b5686e5",
    "timestamp": "2026-01-03T17:35:23Z"
  },
  {
    "title": "Trump Says US Captured Venezuela’s President and Plans to “Run the Country”",
    "description": "In a steep escalation in the United States’ ongoing military offensive in the region, President Donald Trump said early Saturday that the US had captured Venezuelan President Nicolas Maduro and his wife Cilia Flores.  Trump did not seek congressional approval…",
    "link": "https://www.motherjones.com/politics/2026/01/trump-says-us-captured-venezuelas-president-and-plans-to-run-the-country/",
    "timestamp": "2026-01-03T17:34:55Z"
  },
  {
    "title": "Trump Rebrands Monroe Doctrine the ‘Don-roe Doctrine’ Following Venezuelan Regime Change",
    "description": "Trump unveiled the Don-roe Doctrine after Venezuela’s regime change, accusing Maduro of hosting foreign adversaries and using weapons that threatened the U.S.\nThe post Trump Rebrands Monroe Doctrine the ‘Don-roe Doctrine’ Following Venezuelan Regime Change fi…",
    "link": "https://www.mediaite.com/politics/trump/trump-rebrands-monroe-doctrine-the-don-roe-doctrine-following-venezuelan-regime-change/",
    "timestamp": "2026-01-03T17:34:18Z"
  },
  {
    "title": "U.S. will look to tap Venezuelan oil reserves, Trump says",
    "description": "President Donald Trump said Saturday that the removal of Venezuela President Nicolás Maduro from power will open the door to the country's vast oil reserves, a move that has the potential to reshape the global energy market.“We’re going to have our very large…",
    "link": "https://www.nbcnews.com/business/energy/us-will-look-tap-venezuelan-oil-reserves-trump-says-rcna252054",
    "timestamp": "2026-01-03T17:33:19Z"
  },
  {
    "title": "Trump Shares Photo of Nicolás Maduro in Custody After Venezuela Strikes, Calls Military Operation ‘An Assault Like People Had Not Seen Since World War II’",
    "description": "Donald Trump took to Truth Social early Saturday to share a photo of Venezuelan President Nicolás Maduro in custody after the United States conducted air strikes against Caracas, Venezuela’s capital, late Friday and into Saturday. Trump confirmed the strikes …",
    "link": "https://variety.com/2026/global/news/trump-photo-nicolas-maduro-venezuela-strikes-1236622866/",
    "timestamp": "2026-01-03T17:30:48Z"
  },
  {
    "title": "Baffled Reporter Shouts Out After Rambling Trump Weave On Blockbuster Strike: ‘Can You Explain…’",
    "description": "A baffled reporter shouted out after Trump spent 20 minutes rambling at a press conference on his strike and capture of Maduro, asking him to \"explain\" himself.\nThe post Baffled Reporter Shouts Out After Rambling Trump Weave On Blockbuster Strike: ‘Can You Ex…",
    "link": "https://www.mediaite.com/media/news/baffled-reporter-shouts-out-after-rambling-trump-weave-on-blockbuster-strike-can-you-explain/",
    "timestamp": "2026-01-03T17:30:46Z"
  },
  {
    "title": "Donald Trump Posts Shocking Photo of Captured Venezuelan President Blindfolded and In Handcuffs Aboard U.S. Warship After Maduro and His Wife Were Taken By the US",
    "description": "Donald Trump posted a photo showing what he said was captured Venezuelan President Nicolás Maduro aboard the USS Iwo Jima.",
    "link": "https://radaronline.com/p/donald-trump-shocking-photo-captured-venezuelan-president-handcuffs/",
    "timestamp": "2026-01-03T17:30:06Z"
  },
  {
    "title": "Trump Says U.S. Has Captured Venezuelan President Nicolás Maduro (Jasmine Wright/NOTUS)",
    "description": "Jasmine Wright / NOTUS:\nTrump Says U.S. Has Captured Venezuelan President Nicolás Maduro  —  In an early morning social media post, Trump said Maduro and his wife were flown out of the country.  — Copy  —  President Donald Trump announced early Saturday morni…",
    "link": "https://www.memeorandum.com/260103/p52",
    "timestamp": "2026-01-03T17:30:01Z"
  },
  {
    "title": "Elected leaders, Richmonders with ties to Venezuela react to U.S. capturing Maduro",
    "description": "Early Saturday morning, the United States carried out military strikes on Venezuela and captured Venezuelan President Nicolas Maduro and First Lady Cilia Flores.",
    "link": "https://richmond.com/news/local/article_bb31fb67-d68b-4193-9f15-36ac455cacd0.html",
    "timestamp": "2026-01-03T17:30:00Z"
  },
  {
    "title": "When people do stuff other than what they're supposed to be good at",
    "description": "A cricketer lecturing on mushrooms, a footballer feted and paraded around by VIPs, CEOs doing motivational YouTube videos - whatever happened to folks sticking to their fields of expertise?",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/when-people-do-stuff-other-than-what-theyre-supposed-to-be-good-at/articleshow/126324937.cms",
    "timestamp": "2026-01-03T17:30:00Z"
  },
  {
    "title": "Senior Democrat, Bucking Party’s Knee-Jerking Reaction, Praises Trump’s Capture Of ‘Illegitimate’ Maduro",
    "description": "Rep. Debbie Wasserman Schultz, a South Florida Democrat with a sizable Venezuelan population in her district, bucked her party Saturday to praise President Donald Trump’s capture of socialist dictator Nicolás Maduro. Wasserman Schultz said the U.S. military o…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360211/posts",
    "timestamp": "2026-01-03T17:29:52Z"
  },
  {
    "title": "The U.S. Captured Venezuelan President Nicolás Maduro. Here’s What We Know",
    "description": "President Donald Trump announced that U.S. forces captured Venezuelan President Nicolás Maduro, who has since been charged with narco-terrorism.",
    "link": "http://www.rollingstone.com/politics/politics-news/venezuela-president-maduro-captured-indicted-trump-1235493831/",
    "timestamp": "2026-01-03T17:28:25Z"
  },
  {
    "title": "Maduro gave car interview about possible Trump olive branch days before he was captured by US",
    "description": "Venezuelan leader Nicolás Maduro was captured by U.S. forces days after he discussed possible drug trafficking deal negotiations with President Donald Trump.",
    "link": "https://www.foxnews.com/world/maduro-gave-car-interview-about-possible-trump-olive-branch-days-before-he-captured-us",
    "timestamp": "2026-01-03T17:27:52Z"
  },
  {
    "title": "Court Rules California 'Open Carry' Ban Unconstitutional",
    "description": "A federal appeals court ruled Friday that California's ban on openly carrying guns in most parts of the state is unconstitutional. A panel of the San Francisco-based 9th U.S. Circuit Court of Appeals sided 2-1 with a gun owner in ruling ‍that the state's proh…",
    "link": "https://freerepublic.com/focus/f-news/4360210/posts",
    "timestamp": "2026-01-03T17:27:42Z"
  },
  {
    "title": "Mock house, CIA source and Special Forces: The US operation to capture Maduro",
    "description": "Planning for one of the most complex US operations in recent memory had been in the works for some time and included detailed rehearsals, according to sources familiar with the matter.",
    "link": "https://www.channelnewsasia.com/world/us-venezuela-operation-capture-maduro-mock-house-cia-special-forces-5788111",
    "timestamp": "2026-01-03T17:27:37Z"
  },
  {
    "title": "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow",
    "description": "U.S. oil companies will invest billions of dollars in Venezuela's energy sector after the overthrow of Nicolas Maduro, President Donald Trump said.",
    "link": "https://www.cnbc.com/2026/01/03/trump-venezuela-oil.html",
    "timestamp": "2026-01-03T17:27:21Z"
  },
  {
    "title": "'We're going to run it': Trump reveals Venezuela's fate following Maduro's capture",
    "description": "President Donald Trump announced that the United States will be running Venezuela following the capture of President Nicolas Maduro. American military forces conducted a \"large scale strike\" in Venezuela where Maduro and his wife were captured and transported…",
    "link": "https://www.theblaze.com/news/we-re-going-to-run-it-trump-reveals-venezuela-s-fate-following-maduro-s-capture",
    "timestamp": "2026-01-03T17:25:31Z"
  },
  {
    "title": "US to run Venezuela until power transition, says Trump after Maduro capture",
    "description": "Donald Trump said the US will run Venezuela until a safe transition of power after US forces captured President Nicolas Maduro in a dramatic operation.",
    "link": "https://www.thehindubusinessline.com/news/world/us-to-run-venezuela-until-power-transition-says-trump-after-maduro-capture/article70468771.ece",
    "timestamp": "2026-01-03T17:25:25Z"
  },
  {
    "title": "'Wicked' Composer Stephen Schwart Boycotts Kennedy Center After Name Change, Calling It 'Political'",
    "description": "Stephen Schwartz, composer of the Broadway musical, \"Wicked,\" says he will not appear at the Kennedy Center after its board voted to change the name of the venue, calling the performing arts center \"political.\"",
    "link": "https://www.breitbart.com/entertainment/2026/01/03/wicked-composer-stephen-schwart-boycotts-kennedy-center-after-name-change-calling-it-political/",
    "timestamp": "2026-01-03T17:24:37Z"
  },
  {
    "title": "US attacked Venezuela for oil or Nicolas Maduro? Explainer on Trump statement, capture, oil control, charges and future rule",
    "description": "US attacked Venezuela for oil or Nicolas Maduro? This explainer details the US military operation, capture of Nicolas Maduro, criminal charges, oil policy, sanctions, oil prices, PDVSA output, and statements from President Donald Trump on control, transition,…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-attacked-venezuela-for-oil-or-nicolas-maduro-explainer-on-trump-statement-capture-oil-control-charges-and-future-rule/articleshow/126325543.cms",
    "timestamp": "2026-01-03T17:24:33Z"
  },
  {
    "title": "Trump says US will be ‘very strongly involved’ in Venezuela’s oil industry after military attack",
    "description": "US president made comments after US military special forces captured Venezuelan president and wife\nDonald Trump has said the US will be “very strongly involved” in Venezuela’s oil industry after launching a military attack that swept the country’s authoritari…",
    "link": "https://biztoc.com/x/cc687fd2a87d1e57",
    "timestamp": "2026-01-03T17:24:32Z"
  },
  {
    "title": "Who Is Cilia Flores? Maduro's Wife Captured From Venezuela",
    "description": "Venezuela's President Nicolás Maduro and his wife, Cilla Flores, have been formally indicted in the Southern District of New York, U.S. Attorney General Pam Bondi has announced, after President Donald Trump said the U.S. captured them during a \"large-scale st…",
    "link": "https://biztoc.com/x/a27fe8536de8fc13",
    "timestamp": "2026-01-03T17:24:27Z"
  },
  {
    "title": "Trump: Venezuelan VP willing to work with US",
    "description": "United States President Donald Trump said on Saturday that his administration believes that Venezuelan Vice President Delcy Rodriguez is \"willing to do what is necessary\" to make the South American co...",
    "link": "https://biztoc.com/x/a7529bb1e73f746e",
    "timestamp": "2026-01-03T17:24:23Z"
  },
  {
    "title": "Trump: We aren't afraid of boots on ground",
    "description": "US President Donald Trump said Saturday that the United States is not afraid to put boots on the ground in Venezuela following the operation that removed Nicolas Maduro from power.Speaking from Mar-a-...",
    "link": "https://biztoc.com/x/79efe0622a0a91ab",
    "timestamp": "2026-01-03T17:24:18Z"
  },
  {
    "title": "Maria Corina Machado on Maduro's Capture: 'The Time Has Come for Sovereignty'",
    "description": "Venezuelan opposition leader and Nobel Peace Prize Laureate María Corina Machado said on a Saturday morning statement that “the time has come for sovereignty” following the capture of socialist dictator Nicolás Maduro by U.S. forces.\nThe post María Corina Mac…",
    "link": "https://www.breitbart.com/latin-america/2026/01/03/maria-corina-machado-on-maduros-capture-the-time-has-come-for-sovereignty/",
    "timestamp": "2026-01-03T17:24:06Z"
  },
  {
    "title": "Trump Says US Is Going To Run Venezuela After Nabbing Maduro",
    "description": "President Donald Trump said during a Saturday press conference that the United States would “run” Venezuela until a “judicious” transition could take place in the country. Trump announced in a Saturday morning post to Truth Social that U.S. military forces ca…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360209/posts",
    "timestamp": "2026-01-03T17:22:56Z"
  },
  {
    "title": "Trump Calls Operation to Capture Venezuela's Maduro Dark and Deadly",
    "description": "President Donald Trump talks about the operation to capture Venezuelan President Nicolás Maduro in Caracas. Trump says that ...",
    "link": "https://biztoc.com/x/517813d90aece3ca",
    "timestamp": "2026-01-03T17:22:29Z"
  },
  {
    "title": "Trump on Venezuela: 'We are going to run the country'",
    "description": "President Donald Trump announced that the US will run Venezuela until a 'proper transition can take place.'",
    "link": "https://www.bbc.com/news/videos/c368px35ly8o",
    "timestamp": "2026-01-03T17:20:46Z"
  },
  {
    "title": "Sen. Mullin reacts to Maduro capture after US strike in Venezuela",
    "description": "President Donald Trump addressed the nation on Saturday, saying the U.S. will now \"run\" Venezuela until a new leader can be established.",
    "link": "https://www.koco.com/article/venezuela-strike-trump-oklahoma-reactions-president-maduro-captured-us-strike/69908146",
    "timestamp": "2026-01-03T17:20:39Z"
  },
  {
    "title": "President Trump’s Warning to Iranian Regime Means Much More After Maduro’s Capture and Arrest",
    "description": "President Trump told Iran, one day before removing Terrorist Maduro from Venezuela, what he would do if they shot and killed protesters.\nThe post President Trump’s Warning to Iranian Regime Means Much More After Maduro’s Capture and Arrest appeared first on T…",
    "link": "https://joehoft.com/breaking-president-trump-tells-the-iran-regime-what-the-us-will-do-if-they-shoot-and-kill-protesters/",
    "timestamp": "2026-01-03T17:20:26Z"
  },
  {
    "title": "Trump: U.S. Will Run Venezuela to Secure Order and Transition",
    "description": "\"We're going to run the country until such time as we can do a safe, proper, and judicious transition. So we don't want to be involved with having somebody else get in.\"\nThe post Trump: U.S. Will Run Venezuela to Secure Order and Transition first appeared on …",
    "link": "https://legalinsurrection.com/2026/01/trump-u-s-will-run-venezuela-to-secure-order-and-transition/",
    "timestamp": "2026-01-03T17:20:04Z"
  },
  {
    "title": "Bernie Moreno Praises Trump for Acting Against Nicolas Maduro, Unlike ‘Inept and Incompetent’ Biden",
    "description": "Sen. Bernie Moreno (R-OH) said on Saturday morning that President Donald Trump “changed the course of Latin America for a generation” by arresting Venezuelan dictator and alleged narco-terrorist gang leader Nicolás Maduro in a daring overnight operation.\nThe …",
    "link": "https://www.breitbart.com/national-security/2026/01/03/bernie-moreno-praises-trump-for-acting-against-nicolas-maduro-unlike-inept-and-incompetent-biden/",
    "timestamp": "2026-01-03T17:19:46Z"
  },
  {
    "title": "Trump’s Spectacles of Violence Can’t Hold Back the Growing Tide of Discontent",
    "description": "Even Trump’s base is starting to recognize the harm done by his economic policies and the historic government shutdown.",
    "link": "https://truthout.org/articles/trumps-spectacles-of-violence-cant-hold-back-the-growing-tide-of-discontent/",
    "timestamp": "2026-01-03T17:19:00Z"
  },
  {
    "title": "Inside Delta Force: The ultra-secret US kill team linked to Nicolas Maduro's shocking capture",
    "description": "Delta Force Venezuela Operation: The United States launched a significant military strike in Venezuela, spotting President Nicolás Maduro and his wife, Cilia Flores. Explosions were reported in Caracas and surrounding regions, as Delta Force executed the high…",
    "link": "https://economictimes.indiatimes.com/news/international/us/inside-delta-force-the-ultra-secret-us-kill-team-linked-to-nicolas-maduros-shocking-capture/articleshow/126324983.cms",
    "timestamp": "2026-01-03T17:18:09Z"
  },
  {
    "title": "Trump: US ‘captures’ Maduro in ‘dead of night’",
    "description": "US President Donald Trump said the US will run Venezuela until there is a “safe and judicious” transition of power.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/3/trump-us-captures-maduro-in-dead-of",
    "timestamp": "2026-01-03T17:17:54Z"
  },
  {
    "title": "Delta Force, 160th SOAR carried out raid to capture Maduro",
    "description": "President Donald Trump said no personnel were killed in the attack on Venezuela, dubbed “Operation Absolute Resolve.”",
    "link": "http://taskandpurpose.com/news/venezuela-maduro-delta-force-absolute-resolve/",
    "timestamp": "2026-01-03T17:17:34Z"
  }
]