[
  {
    "title": "Trump Calls Stephen Colbert a 'Dead Man Walking' and Urges CBS to 'Put Him to Sleep'",
    "description": "Donald Trump has launched a fresh attack on Stephen Colbert, calling the late-night host a 'dead man walking' and urging CBS to 'put him to sleep'. The comments come as Trump renews threats against major US networks over what he claims is consistently negativ…",
    "link": "https://www.ibtimes.com/trump-calls-stephen-colbert-dead-man-walking-urges-cbs-put-him-sleep-3793672",
    "timestamp": "2025-12-24T17:42:44Z"
  },
  {
    "title": "Obama’s former top economic advisor says he feels ‘a tiny bit bad’ for Trump because gas prices are low, but consumer confidence is still plummeting",
    "description": "“Consumers are just in this, whatever the highest price is, is the price they're going to focus on,” Harvard professor Jason Furman said.",
    "link": "https://fortune.com/2025/12/24/obama-former-top-economic-advisor-jason-furman-trump-affordabilty-gas-prices/",
    "timestamp": "2025-12-24T17:39:04Z"
  },
  {
    "title": "Obama’s former top economic advisor says he feels ‘a tiny bit bad’ for Trump because gas prices are low, but consumer confidence is still plummeting",
    "description": "“Consumers are just in this, whatever the highest price is, is the price they're going to focus on,” Harvard professor Jason Furman said.",
    "link": "https://finance.yahoo.com/news/obama-former-top-economic-advisor-173904661.html",
    "timestamp": "2025-12-24T17:39:04Z"
  },
  {
    "title": "Newly released Epstein file links Trump to murdered newborn baby dumped in Lake Michigan",
    "description": "Donald Trump's name appears on a newly released Epstein file in which a purported victim makes allegations about a newborn baby being murdered and dumped in Lake Michigan.The Justice Department released this file ahead of Christmas Eve in which an unnamed ind…",
    "link": "https://www.rawstory.com/trump-epstein-files-2674827578/",
    "timestamp": "2025-12-24T17:38:15Z"
  },
  {
    "title": "US uses visa bans to aid tech companies",
    "description": "It has long been the case, probably since the end World War II which saw the emergence of the US as the dominant world power largely unscathed by the destruction that had been wrought in Europe, that the US saw itself as the one true power and that other nati…",
    "link": "https://freethoughtblogs.com/singham/2025/12/24/us-uses-visa-bans-to-aid-tech-companies/",
    "timestamp": "2025-12-24T17:37:11Z"
  },
  {
    "title": "MAGA Legislators Want To Add Mercenaries To Trump’s Perverse Take On The ‘War On Drugs’",
    "description": "Yeah, the economy sucks and trade-war tariff agendas are only making things worse. But as Trump promised/threatened during a recent national address from the White House, things are turning around, even if you (MAGA voters especially) are too stupid to see it…",
    "link": "https://www.techdirt.com/2025/12/24/maga-legislators-want-to-add-mercenaries-to-trumps-perverse-take-on-the-war-on-drugs/",
    "timestamp": "2025-12-24T17:36:44Z"
  },
  {
    "title": "Suspect in national guard shooting faces new federal charges that allow death penalty discussions",
    "description": "A man accused of shooting two National Guard troops near the White House has been charged in a complaint with federal firearms charges in connection with the ambush on November 26 that fatally wounded one of the West Virginia National Guard members and seriou…",
    "link": "https://www.pbs.org/newshour/nation/suspect-in-national-guard-shooting-faces-new-federal-charges-that-allow-death-penalty-discussions",
    "timestamp": "2025-12-24T17:36:00Z"
  },
  {
    "title": "Diddy Destroys Judge for 'Draconian' Sentence in New Appeal After Disgraced Rapper Is Sent to Rot Behind Bars for 4 Years",
    "description": "Sean 'Diddy' Combs' legal team filed a new appeal, this time attacking the judge for a 'draconian' sentence.",
    "link": "https://radaronline.com/p/sean-diddy-combs-new-appeal-attacks-judge/",
    "timestamp": "2025-12-24T17:33:42Z"
  },
  {
    "title": "Judge upholds N.Y.'s Green Light Law, rejecting a Trump administration challenge",
    "description": "A federal judge gave a green light Tuesday to New York's so-called Green Light Law, rejecting the Trump administration's bid to stop the state from giving people driver's licenses without having them prove they are in the country legally. U.S. District Judge …",
    "link": "https://freerepublic.com/focus/f-news/4358860/posts",
    "timestamp": "2025-12-24T17:32:49Z"
  },
  {
    "title": "Trump Revamps Controversial H-1B Outsourcing Program",
    "description": "President Donald Trump's revamp of the H-1B white-collar outsourcing program has prompted cautious approval from advocates for American professionals and college graduates.\nThe post Trump Revamps Controversial H-1B Outsourcing Program appeared first on Breitb…",
    "link": "https://www.breitbart.com/economy/2025/12/24/trump-revamps-controversial-h-1b-outsourcing-program/",
    "timestamp": "2025-12-24T17:29:07Z"
  },
  {
    "title": "Gas prices crash below $2 in 9 states — Trump says it beats a tax cut. Is yours one of them?",
    "description": "US gas prices today: President Trump is celebrating falling gas prices in some parts of the country, a prediction he made earlier this year. While some stations have dipped below $2 per gallon, national averages remain closer to $3. Analysts attribute the pri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gas-prices-crash-below-2-in-9-states-trump-says-it-beats-a-tax-cut-is-yours-one-of-them/articleshow/126162778.cms",
    "timestamp": "2025-12-24T17:26:29Z"
  },
  {
    "title": "It's 'been a battle' for Canada's hemp industry, Alberta processor says",
    "description": "Industrial hemp has been commercially cultivated in Canada since 1998 — two decades before the legalization of recreational cannabis use — but data suggests recent years haven't been too kind to the industry. That includes hemp processing in Alberta, where mo…",
    "link": "https://www.cbc.ca/news/canada/calgary/canada-industrial-hemp-cannabis-9.7015067",
    "timestamp": "2025-12-24T17:25:59Z"
  },
  {
    "title": "‘They Have Just Whiffed’: CNN Reports Team Trump Is Frustrated by DOJ’s Handling of the Epstein Files",
    "description": "CNN's Kevin Liptak reported on Wednesday that the Trump White House has been frustrated by the Department of Justice's handling of the Epstein files.\nThe post ‘They Have Just Whiffed’: CNN Reports Team Trump Is Frustrated by DOJ’s Handling of the Epstein File…",
    "link": "https://www.mediaite.com/media/tv/they-have-just-whiffed-cnn-reports-team-trump-is-frustrated-by-dojs-handling-of-the-epstein-files/",
    "timestamp": "2025-12-24T17:25:15Z"
  },
  {
    "title": "Trump says “Humbug” to Colbert, threatens broadcast licenses",
    "description": "The president threatened broadcast licenses in an early Christmas Eve post.",
    "link": "https://www.salon.com/2025/12/24/trump-says-humbug-to-colbert-threatens-broadcast-licenses/",
    "timestamp": "2025-12-24T17:24:51Z"
  },
  {
    "title": "Trump order halts offshore wind projects for at least 90 days",
    "description": "The Trump administration has directed five large-scale wind projects under construction off the East Coast to suspend their activities.",
    "link": "https://www.boston.com/news/local-news/2025/12/24/trump-order-halts-offshore-wind-projects-for-at-least-90-days/",
    "timestamp": "2025-12-24T17:13:18Z"
  },
  {
    "title": "Zelenskyy says he's open to withdrawing troops and creating a free economic zone in Ukraine's east",
    "description": "The proposal marks the clearest indication yet of the compromises the Ukrainian leader would be willing to make on the Donbas region, control of which is a major sticking point in peace negotiations.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-says-hes-open-to-withdrawing-troops-and-creating-a-free-economic-zone-in-ukraines-east",
    "timestamp": "2025-12-24T17:13:16Z"
  },
  {
    "title": "SEC to Investigate Role of Alleged Activist Insiders in Corporate Voting",
    "description": "The left-wing environmental, social, and governance movement, which only a few years ago was deeply embedded in corporate America, is now facing an assault on... Read More\nThe post SEC to Investigate Role of Alleged Activist Insiders in Corporate Voting appea…",
    "link": "https://www.dailysignal.com/2025/12/24/sec-to-investigate-role-alleged-activist-insiders-in-corporate-voting/",
    "timestamp": "2025-12-24T17:10:00Z"
  },
  {
    "title": "EU, France, Germany slam US visa bans as 'censorship' dispute deepens",
    "description": "The European Union, France, and Germany have strongly condemned U.S. visa bans targeting European citizens. These individuals are involved in combating online hate and disinformation. The U.S. administration accuses them of censoring free speech and unfairly …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-france-germany-slam-us-visa-bans-as-censorship-dispute-deepens/articleshow/126163743.cms",
    "timestamp": "2025-12-24T17:09:23Z"
  },
  {
    "title": "EU Faces Renewed US Ire After ESG Cutbacks Fail to Calm Tensions",
    "description": "The European Union’s ESG framework — a shadow of its former self after a year of deep cuts — is drawing renewed threats from the US. At issue is the so-called extraterritoriality of the Corporate Sustainability Reporting Directive and the …",
    "link": "https://www.insurancejournal.com/news/international/2025/12/24/852292.htm",
    "timestamp": "2025-12-24T17:06:19Z"
  },
  {
    "title": "Trump Is Suddenly Looking a Lot Smaller (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nTrump Is Suddenly Looking a Lot Smaller  —  The president is no longer dominating his party or the country in the way he once did.  —  Hey, remember april?  —  When President Donald Trump marked his 100th day in office at the e…",
    "link": "https://www.memeorandum.com/251224/p43",
    "timestamp": "2025-12-24T17:05:01Z"
  },
  {
    "title": "Gazans are taking matters into their own hands by launching community reconstruction efforts",
    "description": "With limited resources, Palestinians in Gaza and in exile are funding community reconstruction efforts amid the absence of international aid. “We have to keep trying to help Gaza rise again,” an organizer with the Sameer Project tells Mondoweiss.",
    "link": "https://mondoweiss.net/2025/12/gazans-are-taking-matters-into-their-own-hands-by-launching-community-reconstruction-efforts/",
    "timestamp": "2025-12-24T17:05:00Z"
  },
  {
    "title": "Trump’s $100,000 H-1B visa application fee upheld by judge",
    "description": "A federal judge said the Trump administration can move ahead with a $100,000 fee on new H-1B visa applications, providing a setback for US technology companies that rely on hiring skilled foreign w…",
    "link": "https://www.mercurynews.com/2025/12/24/trumps-100000-h-1b-visa-application-fee-upheld-by-judge/",
    "timestamp": "2025-12-24T17:02:12Z"
  },
  {
    "title": "Judge blocks Trump effort to strip security clearance from attorney who represented whistleblowers",
    "description": "A federal judge is halting the enforcement of a March presidential memorandum that revoked the security clearance of a prominent Washington attorney",
    "link": "https://abcnews.go.com/US/wireStory/judge-blocks-trump-effort-strip-security-clearance-attorney-128680628",
    "timestamp": "2025-12-24T17:01:46Z"
  },
  {
    "title": "Religious scholar explains how Christian nationalists use and abuse the Bible",
    "description": "Like Islam, Christianity is incredibly diverse, ranging from severe fundamentalists to people who are devout but have a more nuanced and complex view of their faith. President Donald Trump is not a Christian fundamentalist; he was raised Presbyterian in Queen…",
    "link": "https://www.rawstory.com/alternet-posts/dan-mcclellan-christian-nationalism/",
    "timestamp": "2025-12-24T17:00:10Z"
  },
  {
    "title": "South Asia’s Difficult Year",
    "description": "The stories that shaped the region in 2025, from India-Pakistan conflict to a deepening Afghan refugee crisis.",
    "link": "http://foreignpolicy.com/2025/12/24/south-asia-year-review-india-pakistan-conflict-nepal-afghanistan/",
    "timestamp": "2025-12-24T17:00:07Z"
  },
  {
    "title": "Intersectionality is all the Rage – Just Ask “Turtle Island Liberation Front”",
    "description": "Our Op-Ed in the NY Post: “Intersectionality” is the mother’s milk of the anti-American, anti-capitalist and anti-Western ideologues who have been ramping up their violence this year. But few Americans are focusing on this threat.\nThe post Intersectionality i…",
    "link": "https://legalinsurrection.com/2025/12/intersectionality-is-all-the-rage-just-ask-turtle-island-liberation-front/",
    "timestamp": "2025-12-24T17:00:02Z"
  },
  {
    "title": "How Should We Approach A.I. in 2026?",
    "description": "On The Political Scene Podcast: The rapid normalization of artificial intelligence is forcing a reckoning with how much of the future is being shaped by hype rather than utility.",
    "link": "https://www.newyorker.com/podcast/political-scene/how-should-we-approach-ai-in-2026",
    "timestamp": "2025-12-24T17:00:00Z"
  },
  {
    "title": "'Obnoxious': Kamala Harris Brutally Ridiculed for Giving Dating Advice — Despite Husband Doug Emhoff Famously Cheating on His First Wife With Children's Teacher",
    "description": "Kamala Harris was ridiculed and slammed as 'obnoxious' for giving dating advice during a recent podcast appearance.",
    "link": "https://radaronline.com/p/kamala-harris-dating-advice-doug-emhoff/",
    "timestamp": "2025-12-24T17:00:00Z"
  },
  {
    "title": "Israel says it will ‘respond’ to Hamas ‘violation’ of Gaza truce in escalation of tensions",
    "description": "Israeli Prime Minister Benjamin Netanyahu accused Hamas on Wednesday of violating the Gaza ceasefire by refusing to disarm, and said Israel would retaliate after a military officer was wounded by what the military described as a bomb.",
    "link": "https://www.independent.ie/world-news/israel-says-it-will-respond-to-hamas-violation-of-gaza-truce-in-escalation-of-tensions/a1330094573.html",
    "timestamp": "2025-12-24T16:59:08Z"
  },
  {
    "title": "Donald Trump Says Stephen Colbert Should Be “Put To Sleep” In Pre-Christmas Late-Night Tirade & Another Call For Broadcast License Terminations",
    "description": "The broadcast late-night shows are dark this week for the holiday but they were on President Donald Trump’s mind as he railed against the hosts again on Truth social Tuesday night before wishing everyone Merry Christmas. Stephen Colbert, host of CBS’ The Late…",
    "link": "http://deadline.com/2025/12/donald-trump-stephen-colbert-late-night-tirade-1236656464/",
    "timestamp": "2025-12-24T16:58:04Z"
  },
  {
    "title": "‘I Want to Follow Jesus Still, but I Want to Slap Somebody’: John Kennedy Seeks Grace and Gratitude in Hard Left DC",
    "description": "DAILY CALLER NEWS FOUNDATION—Republican Louisiana Sen. John Kennedy said Tuesday that navigating Washington’s hard-left culture requires a constant search for grace. The Trump administration has... Read More\nThe post ‘I Want to Follow Jesus Still, but I Want …",
    "link": "https://www.dailysignal.com/2025/12/24/i-want-to-follow-jesus-still-but-i-want-to-slap-somebody-john-kennedy-seeks-grace-and-gratitude-in-hard-left-dc/",
    "timestamp": "2025-12-24T16:53:01Z"
  },
  {
    "title": "Trump bans two Brits from entry...",
    "description": "Five Europeans have been accused by Marco Rubio of leading \"organized efforts to coerce American platforms to censor, demonetize, and suppress American viewpoints they oppose\"",
    "link": "https://www.themirror.com/news/us-news/breaking-trump-bans-two-brits-1579452",
    "timestamp": "2025-12-24T16:49:39Z"
  },
  {
    "title": "Judge blocks Trump effort to strip security clearance from attorney who represented whistleblowers",
    "description": "A federal judge is halting the enforcement of a March presidential memorandum that revoked the security clearance of a prominent Washington attorney.",
    "link": "https://www.bostonherald.com/2025/12/24/trump-security-clearances-judge-block/",
    "timestamp": "2025-12-24T16:49:29Z"
  },
  {
    "title": "Trump order halts offshore wind projects for at least 90 days",
    "description": "Letters from the Interior Department obtained Tuesday by The Associated Press provide new details on the government's move to pause the offshore ventures.",
    "link": "https://www.pbs.org/newshour/nation/trump-order-halts-offshore-wind-projects-for-at-least-90-days",
    "timestamp": "2025-12-24T16:48:29Z"
  },
  {
    "title": "Homicides Drop at Record Rate in Trump’s First Year Back in Office",
    "description": "President Donald Trump got an early Christmas gift this year — data showing the U.S. is set to close 2025 with a record decline in murders.\nThe post Homicides Drop at Record Rate in Trump’s First Year Back in Office first appeared on Mediaite.",
    "link": "https://www.mediaite.com/crime/homicides-drop-at-record-rate-in-trumps-first-year-back-in-office/",
    "timestamp": "2025-12-24T16:45:16Z"
  },
  {
    "title": "Trump lashes out at Stephen Colbert, urges CBS to 'put him to sleep'",
    "description": "President Donald Trump called \"Late Show\" host Stephen Colbert a \"dead man walking\" and urged CBS to \"put him to sleep\" in a Wednesday Truth Social post attacking the late-night host.",
    "link": "https://www.foxnews.com/media/trump-snaps-dead-man-walking-stephen-colbert-urges-cbs-put-him-sleep",
    "timestamp": "2025-12-24T16:42:18Z"
  },
  {
    "title": "U.S. senator admits: ‘I want to follow Jesus still, but I want to slap somebody’",
    "description": "'This year has been frustrating in the sense that nothing that the Trump administration does, no matter what it is, even if it's something very, very, very positive, he's not given credit for it by many members of the media'",
    "link": "https://www.wnd.com/2025/12/u-s-senator-admits-i-want-follow-jesus/",
    "timestamp": "2025-12-24T16:36:38Z"
  },
  {
    "title": "EU Threatens Retaliation Against U.S. After Ex-Censorship Tsar Breton Sanctioned",
    "description": "The EU expressed indignation and vowed retaliation on Wednesday over U.S. sanctions on the bloc's former censorship chief Thierry Breton.\nThe post EU Threatens Retaliation Against U.S. After Ex-Censorship Tsar Breton Sanctioned appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/12/24/eu-threatens-retaliation-against-u-s-after-ex-censorship-tsar-breton-sanctioned/",
    "timestamp": "2025-12-24T16:35:45Z"
  },
  {
    "title": "Judge blocks Trump effort to strip security clearance from attorney who represented whistleblowers",
    "description": "A federal judge has blocked the Trump administration from enforcing a March presidential memorandum to revoke the security clearance of prominent Washington ...",
    "link": "https://www.yahoo.com/news/articles/judge-blocks-trump-effort-strip-163513449.html",
    "timestamp": "2025-12-24T16:35:13Z"
  },
  {
    "title": "‘This Is Sabotage’: Laura Loomer Slams ‘Woke Right’ for Trying to Block Vivek Ramaswamy’s Gubernatorial Bid",
    "description": "Laura Loomer slammed far right figures she accused of trying to sabotage Vivek Ramaswamy's gubernatorial campaign in Ohio.\nThe post ‘This Is Sabotage’: Laura Loomer Slams ‘Woke Right’ for Trying to Block Vivek Ramaswamy’s Gubernatorial Bid first appeared on M…",
    "link": "https://www.mediaite.com/media/news/this-is-sabotage-laura-loomer-slams-woke-right-for-trying-to-block-vivek-ramaswamys-gubernatorial-bid/",
    "timestamp": "2025-12-24T16:30:37Z"
  },
  {
    "title": "Racial Harassment of Students Ignored by Trump’s Department of Education",
    "description": "Records filed in court cases show that most complaints filed by families have been dismissed without investigation.",
    "link": "https://www.propublica.org/article/trump-education-department-civil-rights-racial-harassment",
    "timestamp": "2025-12-24T16:28:02Z"
  },
  {
    "title": "When SNAP payments stopped, a fast-moving nonprofit program rushed in with $12 million—and kept families fed",
    "description": "“It’s not a lot. But at the same time, it is a lot,” mother-of-three Jade Grant said. “Because $50 can do a lot when you don’t have anything.”",
    "link": "https://fortune.com/2025/12/24/government-shutdown-snap-payments-givedirectly-nonprofit-food-stamps/",
    "timestamp": "2025-12-24T16:27:49Z"
  },
  {
    "title": "Trump’s $100,000 H-1B visa application fee upheld by judge",
    "description": "US District Judge Beryl Howell said in a ruling Tuesday that President Donald Trump’s effort to radically increase the cost of the popular visa is lawful.",
    "link": "https://fortune.com/2025/12/24/trumps-100000-h-1b-visa-application-fee-upheld-by-judge/",
    "timestamp": "2025-12-24T16:22:33Z"
  },
  {
    "title": "A Christmas gift to the world? Wars and conflicts Trump says he ended in 2025",
    "description": "President's administration 'has demonstrated a propensity for peace-making'",
    "link": "https://www.wnd.com/2025/12/christmas-gift-world-wars-conflicts-trump-says-he/",
    "timestamp": "2025-12-24T16:21:51Z"
  },
  {
    "title": "How a fast-moving $50 cash relief program buoyed needy families when SNAP payments were paused",
    "description": "The “man-made disaster” of the government shutdown required something different.",
    "link": "https://www.bostonherald.com/2025/12/24/snap-gap/",
    "timestamp": "2025-12-24T16:21:13Z"
  },
  {
    "title": "EXCLUSIVE: 17,500 illegal immigrants arrested under Laken Riley Act in Trump’s second term",
    "description": "DHS arrests over 17,500 illegal immigrants in 2025 under new Laken Riley Act, targeting criminals for mandatory detention and deportation processing.",
    "link": "https://www.foxnews.com/politics/exclusive-17500-illegal-immigrants-arrested-under-laken-riley-act-trumps-second-term",
    "timestamp": "2025-12-24T16:19:15Z"
  },
  {
    "title": "Eurocrats Melt Down Over Trump Barring Censorship Police From US",
    "description": "European officials erupted after the Trump administration barred prominent European figures accused of promoting online censorship from entering the U.S.",
    "link": "https://dailycaller.com/2025/12/24/eurocrats-liberals-fume-over-trump-bar-censorship-police/",
    "timestamp": "2025-12-24T16:15:33Z"
  },
  {
    "title": "Here’s how the Cabinet Secretaries and their families celebrate the holidays",
    "description": "From White House parties to Pentagon worship, Cabinet members mark the holidays with official events in Washington as well as family traditions.",
    "link": "https://www.foxnews.com/politics/heres-how-cabinet-secretaries-families-celebrate-holidays",
    "timestamp": "2025-12-24T16:12:14Z"
  },
  {
    "title": "India expresses concern over demolition of Hindu deity's statue in Thailand-Cambodia conflict",
    "description": "India has voiced concern over the demolition of a Hindu deity statue in the ongoing Thai-Cambodia border conflict. New Delhi stated such disrespectful acts hurt global followers' sentiments. India is urging both Thailand and Cambodia to resolve their border d…",
    "link": "https://economictimes.indiatimes.com/news/india/india-expresses-concern-over-demolition-of-hindu-deitys-statue-in-thailand-cambodia-conflict/articleshow/126163057.cms",
    "timestamp": "2025-12-24T16:12:10Z"
  },
  {
    "title": "Trump’s DOJ Lashes Out at ‘Dope’ Reporter Over Epstein Files Complaint",
    "description": "The Justice Department ripped a \"dope\" reporter who asked why it would publish a \"FAKE\" letter from Jeffrey Epstein to fellow sex criminal Larry Nassar\nThe post Trump’s DOJ Lashes Out at ‘Dope’ Reporter Over Epstein Files Complaint first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trumps-doj-lashes-out-at-dope-reporter-over-epstein-files-complaint/",
    "timestamp": "2025-12-24T16:10:51Z"
  },
  {
    "title": "Judge Rejects Business Group’s Challenge to Trump’s $100,000 H-1B Visa Fee",
    "description": "A federal judge on Tuesday rejected a challenge by the largest U.S. business lobby group to President Donald Trump’s $100,000 fee on new H-1B visas for highly skilled foreign workers, saying it fell under his broad powers to regulate immigration. …",
    "link": "https://www.insurancejournal.com/news/national/2025/12/24/852253.htm",
    "timestamp": "2025-12-24T16:10:03Z"
  },
  {
    "title": "Approximately 50 Planned Parenthood clinics closed in 2025, report says",
    "description": "Approximately 50 Planned Parenthood clinics closed in 2025 as the group lost its ability to bill Medicaid, according to a report by the nation's largest abortion provider. On Dec. 12, a three-judge panel of the U.S. Court of Appeals for the 1st Circuit ruled …",
    "link": "https://freerepublic.com/focus/f-chat/4358844/posts",
    "timestamp": "2025-12-24T16:09:48Z"
  },
  {
    "title": "Pentagon Report: China Loads over 100 ICBMs into Missile Silos near Mongolian Border",
    "description": "Reuters claimed on Monday to have viewed a draft report from the Pentagon that said China “is likely to have loaded more than 100 intercontinental ballistic missiles (ICBMs) across its latest three silo fields” which are located near the Mongolian border.\nThe…",
    "link": "https://www.breitbart.com/asia/2025/12/24/pentagon-report-china-loads-over-100-icbms-into-missile-silos-near-mongolian-border/",
    "timestamp": "2025-12-24T16:07:06Z"
  },
  {
    "title": "Disappointing photos show how crowded New York City's iconic attractions can be during the holidays",
    "description": "Manhattan's most popular tourist attractions during the holidays include Rockefeller Center, Macy's, and Bryant Park.",
    "link": "https://www.businessinsider.com/disappointing-photos-nyc-holiday-attractions-crowds-2022-12",
    "timestamp": "2025-12-24T16:00:08Z"
  },
  {
    "title": "New York Republicans Fracture Over Bruce Blakeman",
    "description": "Rachel Bade: “When Rep. Elise Stefanik last week notified President Donald Trump of her decision to drop out of the New York gubernatorial race, the commander-in-chief and his team made a soft, 11th-hour appeal to change her mind. After Nassau County Executiv…",
    "link": "https://politicalwire.com/2025/12/24/new-york-republicans-fracture-over-bruce-blakeman/",
    "timestamp": "2025-12-24T15:53:57Z"
  },
  {
    "title": "Trump’s awkward descent on Air Force One stairs raises health concerns",
    "description": "Trump’s awkward descent on Air Force One stairs raises health concernsmasslive.com",
    "link": "https://www.masslive.com/politics/2025/12/trumps-awkward-descent-on-air-force-one-stairs-raises-health-concerns.html",
    "timestamp": "2025-12-24T15:53:21Z"
  },
  {
    "title": "Missouri Faces Legal Battle with China Over Pandemic Compensation",
    "description": "Missouri’s top prosecutor said China is suing after the state pressed federal officials for help collecting on a roughly $25 billion court judgment related to the COVID-19 pandemic. Attorney General Catherine Hanaway said in a news release that China is …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/12/24/852244.htm",
    "timestamp": "2025-12-24T15:48:08Z"
  },
  {
    "title": "Zombie Ship Shows US Targeting Darkest Corner of Oil Fleet",
    "description": "A 27-year-old crude tanker that was supposedly scrapped in 2021 is due to reach Venezuela late this week, according to ship-tracking data, in the latest example of how the South American country keeps its embattled oil industry alive. The tanker …",
    "link": "https://www.insurancejournal.com/news/international/2025/12/24/852234.htm",
    "timestamp": "2025-12-24T15:44:54Z"
  },
  {
    "title": "‘What Is Denmark Doin’ in Our Backyard?’ Fox News’ Brian Kilmeade Says the Vikings Are Gone So It’s Time for Trump to Grab Greenland",
    "description": "Brian Kilmeade loves President Trump's plan to acquire Greenland, saying it is necessary for national security purposes against China and Russia\nThe post ‘What Is Denmark Doin’ in Our Backyard?’ Fox News’ Brian Kilmeade Says the Vikings Are Gone So It’s Time …",
    "link": "https://www.mediaite.com/politics/what-is-denmark-doin-in-our-backyard-fox-news-brian-kilmeade-says-the-vikings-are-gone-so-its-time-for-trump-to-grab-greenland/",
    "timestamp": "2025-12-24T15:43:00Z"
  },
  {
    "title": "The Good Trump",
    "description": "Donald Trump's niece, Mary L. Trump, explains why her uncle is the real Grinch.",
    "link": "https://ffrf.libsyn.com/the-good-trump",
    "timestamp": "2025-12-24T15:41:00Z"
  },
  {
    "title": "UN experts condemn US naval blockade of Venezuela as illegal aggression",
    "description": "UN experts criticise US blockade for endangering human rights and call for an investigation into alleged violations.",
    "link": "https://www.aljazeera.com/news/2025/12/24/un-experts-condemn-us-naval-blockade-of-venezuela-as-illegal-aggression",
    "timestamp": "2025-12-24T15:39:05Z"
  },
  {
    "title": "Trump Threatens Colbert, TV Networks in Creepy, Concerning Post Rant",
    "description": "Is it surprising that Trump would rage-post over an episode of CBS's The Late Show with Stephen Colbert that aired on Tuesday night but actually aired on December 8th? No. In fact, it seems only fitting. But what he rage-posted should raise some alarms, espec…",
    "link": "https://bleedingcool.com/tv/trump-threatens-colbert-tv-networks-in-creepy-concerning-post-rant/",
    "timestamp": "2025-12-24T15:38:04Z"
  },
  {
    "title": "Federal Health Programs Will Cover Up To $500 Worth Of CBD For Certain Patients By April, Trump Official Dr. Oz Says",
    "description": "A top Trump administration health official said last week that his agency will soon launch a novel program to have Medicare cover the costs of CBD for certain patients. But while the administration has not yet released specific details about the initiative’s …",
    "link": "https://www.marijuanamoment.net/federal-health-programs-will-cover-up-to-500-worth-of-cbd-for-certain-patients-by-april-trump-official-dr-oz-says/",
    "timestamp": "2025-12-24T15:37:56Z"
  },
  {
    "title": "Washington deploys more troops to Caribbean – WSJ",
    "description": "Washington has reportedly moved additional forces to the Caribbean for possible military action against Venezuela Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629981-us-venezuela-more-troops/",
    "timestamp": "2025-12-24T15:37:32Z"
  },
  {
    "title": "‘Intimidation and Coercion’: Emmanuel Macron Slams Trump’s EU Visa Sanctions",
    "description": "Emmanuel Macron sharply criticized the sanctions put in place by President Donald Trump against several former British and European officials.\nThe post ‘Intimidation and Coercion’: Emmanuel Macron Slams Trump’s EU Visa Sanctions first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/intimidation-and-coercion-emmanuel-macron-slams-trumps-eu-visa-sanctions/",
    "timestamp": "2025-12-24T15:37:22Z"
  },
  {
    "title": "Democrats Urge Trump To Reverse Recall Of Nearly 30 Ambassadors",
    "description": "A senior department official on Monday described the mass recall as \"a standard process in any administration.\"",
    "link": "https://www.huffpost.com/entry/democrats-urge-trump-to-reverse-recall-of-nearly-30-ambassadors_n_694c05cde4b00ac998b386cd",
    "timestamp": "2025-12-24T15:35:47Z"
  },
  {
    "title": "Surprise! Obama judge hands Trump victory in battle against H-1B pipeline",
    "description": "'Rests on a straightforward reading of congressional statutes giving the president broad authority to regulate entry into the United States for immigrants and nonimmigrants alike'",
    "link": "https://www.wnd.com/2025/12/surprise-obama-judge-hands-trump-victory-battle-against/",
    "timestamp": "2025-12-24T15:32:23Z"
  },
  {
    "title": "Trump suggests pulling licenses if networks are \"almost 100% Negative\" about him",
    "description": "President Trump said TV broadcast licenses should be revoked if newscasts and late-night shows are almost entirely negative about him and the GOP.",
    "link": "https://www.cbsnews.com/news/trump-broadcast-licenses-terminated-100-negative/",
    "timestamp": "2025-12-24T15:31:58Z"
  },
  {
    "title": "Trump’s Chip Embargo Against China Is Backfiring Spectacularly",
    "description": "Donald Trump's trade restrictions on AI chips have given Chinese tech firms the environment they need to court global investors.",
    "link": "http://futurism.com/future-society/trump-china-ai-chip-investors",
    "timestamp": "2025-12-24T15:30:47Z"
  },
  {
    "title": "Five Europeans denied US visas for combating hate speech online, accused of censoring ‘American viewpoints’",
    "description": "The State Department announced Tuesday it was barring five Europeans it accused of leading efforts to pressure US tech firms to censor or suppress American viewpoints. The Europeans, described by Secretary of State Marco Rubio as “radical” activists and “weap…",
    "link": "https://freerepublic.com/focus/f-news/4358838/posts",
    "timestamp": "2025-12-24T15:30:20Z"
  },
  {
    "title": "'What Is Denmark Doin' In Our Backyard?' Fox News' Brian Kilmeade Says The Vikings Are Gone So It's Time for Trump to Grab Greenland",
    "description": "Brian Kilmeade is fully onboard with President Donald Trump's desire to acquire Greenland, with the Fox News veteran on Wednesday saying the Vikings are dead...",
    "link": "https://www.yahoo.com/news/videos/denmark-doin-backyard-fox-news-152940519.html",
    "timestamp": "2025-12-24T15:29:40Z"
  },
  {
    "title": "The K-shaped economy is carrying a ticking time bomb into 2026",
    "description": "\"I've never seen anything like it,\" KPMG's chief economist Diane Swonk told Fortune.",
    "link": "https://fortune.com/2025/12/24/k-shaped-economy-2026-stagflation-diane-swonk/",
    "timestamp": "2025-12-24T15:29:07Z"
  },
  {
    "title": "U.S. bars five Europeans it says pressured tech firms to censor American viewpoints online",
    "description": "Secretary of State Marco Rubio characterized them as \"radical\" activists and \"weaponized\" nongovernmental organizations.",
    "link": "https://www.pbs.org/newshour/politics/u-s-bars-five-europeans-it-says-pressured-tech-firms-to-censor-american-viewpoints-online",
    "timestamp": "2025-12-24T15:28:48Z"
  },
  {
    "title": "'60 Minutes' segment on Trump immigration policy accidentally airs online",
    "description": "The segment featured interviews with migrants sent to a notorious Salvadoran prison under President Donald Trump's immigration crackdown. The segment was removed from Canada's Global Television Network but still appeared on its app.",
    "link": "https://www.pbs.org/newshour/politics/60-minutes-segment-on-trump-immigration-policy-accidentally-airs-online",
    "timestamp": "2025-12-24T15:17:28Z"
  },
  {
    "title": "Donald Trump Demands CBS Cancel Stephen Colbert… RIGHT NOW!",
    "description": "Reading Time: 3 minutesDonald Trump has once again GONE OFF on Stephen Colbert. This is totally normal Presidential behavior.\nDonald Trump Demands CBS Cancel Stephen Colbert… RIGHT NOW! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/12/donald-trump-demands-cbs-cancel-stephen-colbert-right-now/",
    "timestamp": "2025-12-24T15:13:27Z"
  },
  {
    "title": "White House Takes Over DOJ Social Media Account Amid Bungled Epstein Files Release",
    "description": "President Donald Trump's White House has taken the astonishing step of commandeering the Department of Justice's X account.\nThe post White House Takes Over DOJ Social Media Account Amid Bungled Epstein Files Release first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/white-house-takes-over-doj-social-media-account-amid-bungled-epstein-files-release/",
    "timestamp": "2025-12-24T15:13:09Z"
  },
  {
    "title": "Trump Admin Lawsuit Aims To Flood DC With AR-15 Rifles For 'Common Use'",
    "description": "President Donald Trump's Department of Justice has sued the District of Columbia to end a ban on assault-style weapons, including the AR-15.\n\n\nIn a nine-page lawsuit filed on Monday, the DOJ's Civil Rights Division noted that \"the District denies law-abiding …",
    "link": "https://crooksandliars.com/2025/12/trump-admin-lawsuit-aims-flood-dc-ar-15",
    "timestamp": "2025-12-24T15:09:56Z"
  },
  {
    "title": "How a fast-moving $50 cash relief program buoyed needy families when SNAP payments were paused",
    "description": "GiveDirectly got $50 gift cards out to SNAP recipients during last month’s shutdown through a new approach to cash assistance",
    "link": "https://abcnews.go.com/US/wireStory/fast-moving-50-cash-relief-program-buoyed-needy-128675398",
    "timestamp": "2025-12-24T15:07:37Z"
  },
  {
    "title": "Venezuela Slows Down Loading of Oil Tankers as U.S. Cracks Down on Illegal Shipments",
    "description": "Maritime tracking data released on Monday showed that international oil tankers have dramatically scaled back loading activity at Venezuelan ports, fearful of a crackdown by the Trump administration on illegal sanctions-busting oil shipments.\nThe post Venezue…",
    "link": "https://www.breitbart.com/latin-america/2025/12/24/oil-loading-in-venezuela-slows-as-u-s-cracks-down-on-illegal-tankers/",
    "timestamp": "2025-12-24T15:07:34Z"
  },
  {
    "title": "Stephen Miller calls for firing of CBS producers over shelved Trump deportation story segment",
    "description": "White House deputy chief of staff Stephen Miller calls for \"60 Minutes\" producers to be fired over shelved Trump deportation segment, calling it a \"pathetic hatchet job.\"",
    "link": "https://www.foxnews.com/media/stephen-miller-calls-fire-cbs-producers-over-shelved-trump-deportation-story-segment",
    "timestamp": "2025-12-24T15:04:47Z"
  },
  {
    "title": "FBI says letter written by Epstein and sent to Larry Nassar is fake",
    "description": "The letter was discovered as part of documents released Tuesday by the Department of Justice related to the Epstein files.",
    "link": "https://www.mlive.com/news/2025/12/fbi-says-letter-written-by-epstein-and-sent-to-larry-nassar-is-fake.html",
    "timestamp": "2025-12-24T15:03:36Z"
  },
  {
    "title": "A Christmas Gift to the World? Wars and Conflicts Trump Says He Ended in 2025",
    "description": "On Jan. 20, 2025, the American people knew President Donald Trump’s agenda included securing the southern border, removing criminal illegal aliens from the country, ending woke policies within the federal government,... Read More\nThe post A Christmas Gift to …",
    "link": "https://www.dailysignal.com/2025/12/24/a-christmas-gift-to-the-world-wars-and-conflicts-trump-says-he-ended-in-2025/",
    "timestamp": "2025-12-24T15:00:00Z"
  },
  {
    "title": "A year before Alaska’s U.S. House election, two candidates are emerging as frontrunners",
    "description": "One of Rep. Nick Begich III’s uncles is endorsing his main Democratic opponent, Matt Schultz, in next year’s election. Tom Begich’s name was atop a list released to the Alaska Beacon by Schultz’s campaign this month.",
    "link": "https://www.newsminer.com/news/local_news/a-year-before-alaska-s-u-s-house-election-two-candidates-are-emerging-as-frontrunners/article_51461cd1-aa82-4cfe-93bf-9ee1ba7ca96d.html",
    "timestamp": "2025-12-24T15:00:00Z"
  },
  {
    "title": "Defense Business Brief: Firefly’s moonshot; ‘Battleships’ and drone boats; Army logistics collab",
    "description": "",
    "link": "https://www.defenseone.com/business/2025/12/defense-business-brief-fireflys-moonshot-battleships-and-drone-boats-army-logistics-collab/410385/",
    "timestamp": "2025-12-24T15:00:00Z"
  },
  {
    "title": "‘Dead man walking!’ Trump urges network to put late-night host ‘to sleep NOW’ as ‘humanitarian thing to do’",
    "description": "'Shouldn't their very valuable Broadcast Licenses be terminated?'",
    "link": "https://www.wnd.com/2025/12/dead-man-walking-trump-urges-network-put-late/",
    "timestamp": "2025-12-24T14:59:06Z"
  },
  {
    "title": "Biden Judge Refuses To Let Trump Decide Who Should Have A Security Clearance",
    "description": "A federal judge reversed President Donald Trump's decision on Tuesday to strip an attorney's security clearance.",
    "link": "https://dailycaller.com/2025/12/24/biden-judge-refuses-to-let-trump-decide-who-should-have-a-security-clearance/",
    "timestamp": "2025-12-24T14:58:44Z"
  },
  {
    "title": "Stephen Miller's wife quietly retracts second attack on the Pope — just before Christmas",
    "description": "Katie Miller, the wife of President Donald Trump's chief strategist and speechwriter Stephen Miller, has for the second time in the runup to Christmas posted an attack on Pope Leo XIV and the Catholic Church, then quietly deleted it.Her first remark came last…",
    "link": "https://www.rawstory.com/katie-miller-pope-wife-stephen/",
    "timestamp": "2025-12-24T14:58:44Z"
  },
  {
    "title": "How investment giant Vanguard’s CIO is placing big tech bets today to create the AI digital advisor of tomorrow",
    "description": "Vanguard CIO Nitin Tandon says AI can be used to hyper-personalize guidance for customers.",
    "link": "https://fortune.com/2025/12/24/vanguards-cio-niti-tandon-ai-digital-advisor/",
    "timestamp": "2025-12-24T14:57:36Z"
  },
  {
    "title": "A World Without Doctor Doom Ends In Armageddon (Will Of Doom Spoilers)",
    "description": "Today's The Will Of Doom #1 by Chip Zdarsky and CAFU follws the events of One World Under Doom into the upcoming Armageddon for next year. Following the death of Doom and the instructions in the wake of his death, as he leaves everything he owns to daughter o…",
    "link": "https://bleedingcool.com/comics/a-world-without-doctor-doom-ends-in-armageddon-will-of-doom-spoilers/",
    "timestamp": "2025-12-24T14:57:05Z"
  },
  {
    "title": "Joe Rogan Agrees Trump Is ‘Losing It’ And Offers His Solution",
    "description": "The podcaster didn't hold back on the \"nuttiest\" antics of the president.",
    "link": "https://www.huffpost.com/entry/joe-rogan-losing-it_n_694bd6eee4b080674cec0d53",
    "timestamp": "2025-12-24T14:55:34Z"
  },
  {
    "title": "Good Climate News to End the Year",
    "description": "This year brought major setbacks on climate action, but there were wins, too.",
    "link": "https://financialpost.com/pmn/business-pmn/good-climate-news-to-end-the-year",
    "timestamp": "2025-12-24T14:54:33Z"
  },
  {
    "title": "Canada needs to stand firm as trade talks approach, says Unifor president",
    "description": "As Canada approaches a review of its key free trade deal with the United States next year, Unifor national president Lana Payne says it's important to stand firm for a good deal.",
    "link": "https://www.cbc.ca/news/politics/canada-trade-talks-approach-payne-9.7027409",
    "timestamp": "2025-12-24T14:53:17Z"
  },
  {
    "title": "Trump Admin to Begin Garnishing Wages for Defaulted Student Loans in January",
    "description": "Wages could be garnished as early as 30 days after borrowers receive notice.",
    "link": "https://www.newsfromthestates.com/article/trump-administration-garnish-wages-defaulted-student-loans",
    "timestamp": "2025-12-24T14:50:43Z"
  }
]