[
  {
    "title": "‘The beginning of a long saga’ – Experts share their views and concerns on Trump's tariffs",
    "description": "With US President Donald Trump’s 20pc trade tariffs set to be imposed on Ireland, a number of leading experts have provided their perspectives and voiced some concerns.",
    "link": "https://www.independent.ie/irish-news/the-beginning-of-a-long-saga-experts-share-their-views-and-concerns-on-trumps-tariffs/a2011238883.html",
    "timestamp": "2025-04-03T15:11:30Z"
  },
  {
    "title": "Trump Proclaims America ‘IS HEALING’ as Markets Craters Post-Tariffs",
    "description": "The president and his allies are doing everything they can to spin his economic bombshell as a win for consumers, despite all of the evidence to the contrary",
    "link": "http://www.rollingstone.com/politics/politics-news/markets-crater-tariffs-trump-1235309947/",
    "timestamp": "2025-04-03T15:11:17Z"
  },
  {
    "title": "US seems content to cosy up to Russia instead of imposing tariffs",
    "description": "Russia is the glaring omission from Donald Trump's tariffs list. Along with Cuba, Belarus and North Korea, it has been spared the sweeping measures, with America's foes apparently treated better than many of its friends.",
    "link": "https://news.sky.com/story/us-seems-content-to-cosy-up-to-russia-instead-of-coerce-it-with-tariffs-13341300",
    "timestamp": "2025-04-03T15:11:00Z"
  },
  {
    "title": "Trump will ‘buckle under pressure’ if Europe bands together over tariffs, German economy minister says",
    "description": "Key Points “That is what I see, that Donald Trump will buckle under pressure, that he corrects his announcements under pressure,” German economy minister Robert Habeck said Thursday. Elsewhere, outgoing German Chancellor Olaf Scholz said he believed the lates…",
    "link": "https://freerepublic.com/focus/f-bloggers/4308586/posts",
    "timestamp": "2025-04-03T15:10:14Z"
  },
  {
    "title": "Some countries targeted by Trump tariffs seek negotiations, China says 'no winners in trade wars'",
    "description": "World leaders across the globe are reacting to President Donald Trump’s \"Liberation Day\" tariff announcements, with some expressing disappointment and others making threats. On Wednesday, the president announced a baseline tariff of 10% on imports, in additio…",
    "link": "https://freerepublic.com/focus/f-news/4308585/posts",
    "timestamp": "2025-04-03T15:09:44Z"
  },
  {
    "title": "Fitch cuts China credit rating on debt risks amid trade tensions",
    "description": "Fitch downgraded China's sovereign credit rating, citing rapidly rising government debt and fiscal risks as China faces economic challenges. The downgrade came amid President Trump's tariffs on Chinese imports, with Fitch expecting continued fiscal strain and…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fitch-cuts-china-credit-rating-on-debt-risks-amid-trade-tensions/articleshow/119949630.cms",
    "timestamp": "2025-04-03T15:09:06Z"
  },
  {
    "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer | CNN Politics",
    "description": "The White House has fired at least three National Security Council staffers, three sources familiar with the move told CNN.",
    "link": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
    "timestamp": "2025-04-03T15:08:54Z"
  },
  {
    "title": "'The markets are not healing': CNBC host snaps at Trump comment as Wall Street reels",
    "description": "CNBC \"Squawk Box\" host Andrew Ross Sorkin fired back at Donald Trump in real time on MSNBC Thursday after the president crowed about the success of his \"Liberation Day\" on Truth Social.Appearing on \"Morning Joe\" to discuss the president's decision to impose t…",
    "link": "https://www.rawstory.com/trump-tariff-chaos/",
    "timestamp": "2025-04-03T15:08:51Z"
  },
  {
    "title": "Aerospace walks tightrope as Airbus-led body calls for tariff response",
    "description": "France's aerospace industry has written to the European Commission calling for \"proportionate and assertive\" countermeasures if U.S. tariffs cause...",
    "link": "https://finance.yahoo.com/news/aerospace-walks-tightrope-airbus-led-150813705.html",
    "timestamp": "2025-04-03T15:08:13Z"
  },
  {
    "title": "There were no winners from Trump's tariff gameshow",
    "description": "Donald Trump flourished his list of tariffs like a gameshow host in the White House Rose Garden on Wednesday – but there were no winners from the president's made-for-TV show of economic strength.",
    "link": "https://news.sky.com/story/there-were-no-winners-from-trumps-tariff-gameshow-13341299",
    "timestamp": "2025-04-03T15:08:00Z"
  },
  {
    "title": "Is Trump slapping taxes on penguins too? Netizens react as tariff list includes islands with no humans",
    "description": "President Donald Trump's latest wave of import tariffs includes remote and uninhabited places like Heard and McDonald Islands. These islands, home to seabirds, penguins, and seals, were hit with a 10% tariff. The tariffs, introduced on April 2, imposed higher…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/is-donald-trump-slapping-taxes-on-penguins-too-netizens-react-as-tariff-list-includes-islands-with-no-humans/articleshow/119949049.cms",
    "timestamp": "2025-04-03T15:07:44Z"
  },
  {
    "title": "Édaein O’Connell: Donald Trump made his tariff announcement like a bingo caller in Benidorm or a GAA commentator in Monaghan",
    "description": "We are living in a time of great upheaval, yet it often feels like we’re existing in a real-life episode of The Office. The economic challenges we face may rival those of the 2008 crash, yet our reality plays out like a comedy sketch.",
    "link": "https://www.independent.ie/opinion/comment/edaein-oconnell-donald-trump-made-his-tariff-announcement-like-a-bingo-caller-in-benidorm-or-a-gaa-commentator-in-monaghan/a1553038719.html",
    "timestamp": "2025-04-03T15:07:26Z"
  },
  {
    "title": "Édaein O’Connell: Donald Trump announced his tariffs as if he were reeling off the specials to a table of tourists in a Temple Bar restaurant",
    "description": "We are living in a time of great upheaval, yet it often feels like we’re existing in a real-life episode of The Office. The economic challenges we face may rival those of the 2008 crash, yet our reality plays out like a comedy sketch.",
    "link": "https://www.independent.ie/opinion/comment/edaein-oconnell-donald-trump-announced-his-tariffs-as-if-he-were-reeling-off-the-specials-to-a-table-of-tourists-in-a-temple-bar-restaurant/a1553038719.html",
    "timestamp": "2025-04-03T15:07:26Z"
  },
  {
    "title": "Donald Trump announced his tariffs as if he were reeling off the specials to a table of tourists in a Temple Bar restaurant",
    "description": "We are living in a time of great upheaval, yet it often feels like we’re existing in a real-life episode of The Office. The economic challenges we face may rival those of the 2008 crash, yet our reality plays out like a comedy sketch.",
    "link": "https://www.independent.ie/opinion/comment/donald-trump-announced-his-tariffs-as-if-he-were-reeling-off-the-specials-to-a-table-of-tourists-in-a-temple-bar-restaurant/a1553038719.html",
    "timestamp": "2025-04-03T15:07:25Z"
  },
  {
    "title": "US Services Index Falters as Employment Shrinks Most Since 2023",
    "description": "US service providers expanded in March at the slowest pace in nine months as orders growth cooled and a measure of employment tumbled to the lowest since 2023.",
    "link": "https://financialpost.com/pmn/business-pmn/us-services-index-falters-as-employment-shrinks-most-since-2023",
    "timestamp": "2025-04-03T15:06:53Z"
  },
  {
    "title": "Trump’s new tariff math looks a lot like ChatGPT’s",
    "description": "When President Donald Trump began yesterday’s announcement of the White House’s latest trade policy brandishing a novelty-sized cardboard sign labeled “Reciprocal Tariffs,” the immediate and nearly unanimous response was bafflement. Trump slapped a 10 percent…",
    "link": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok",
    "timestamp": "2025-04-03T15:06:30Z"
  },
  {
    "title": "U.S. Stock Markets Plunge, Registering Shock At Trump Tariffs",
    "description": "U.S. stock markets plummeted after the opening bell Thursday, as investors registered shock at President Donald Trump’s sweeping retaliatory tariffs. The Dow Jones Industrial Average fell as many as 1,570 points, though in percentage terms the decline was a s…",
    "link": "http://deadline.com/2025/04/stock-markets-plunge-trump-tariffs-shock-wall-street-1236358207/",
    "timestamp": "2025-04-03T15:06:18Z"
  },
  {
    "title": "Apple gets a hard hit from \"Liberation Day\" tariffs",
    "description": "United States President Donald Trump announced \"Liberation Day\" tariffs for basically every country in the world. This decision will be extraordinarily expensive for Apple, as the American phone manufacturer imports its iPhones, which are currently assembled …",
    "link": "https://www.gsmarena.com/apple_gets_a_hard_hit_from_liberation_day_tariffs-news-67228.php",
    "timestamp": "2025-04-03T15:06:02Z"
  },
  {
    "title": "India on Tariffs: Era 'When a Few Powers Underwrote the International System' Is Over",
    "description": "The external affairs minister of India, S. Jaishankar, told attendees at an economic summit on Thursday that \"the world is moving to an era of self-help\" featuring \"shortly supply chains and immediate neighbors,\" responding to the imposition of sweeping globa…",
    "link": "https://www.breitbart.com/asia/2025/04/03/india-on-tariffs-era-when-a-few-powers-underwrote-the-international-system-is-over/",
    "timestamp": "2025-04-03T15:05:31Z"
  },
  {
    "title": "US to host Military World Games for the first time ever",
    "description": "The U.S. will host the Military World Games for the first time in 2027, when it comes to Charlotte, North Carolina, bringing soldiers from across the world.",
    "link": "https://www.foxnews.com/sports/us-host-world-military-games-first-time-ever-after-pete-hegseths-historic-approval",
    "timestamp": "2025-04-03T15:05:10Z"
  },
  {
    "title": "Trump’s Tariffs Are Designed to Backfire",
    "description": "Instead of leading to reduced trade barriers, the new global tariff plan is all but guaranteed to raise them.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/trump-tariff-theory-reality/682279/",
    "timestamp": "2025-04-03T15:05:00Z"
  },
  {
    "title": "Stocks Are Sliding as Trump Tariffs Raise Fears of Recession",
    "description": "Updated 52 min ago\nStocks Are Sliding as Trump Tariffs Raise Fears of Recession\nStocks tumbled to start the day on Thursday as markets reacted to President Donald Trump’s plans for steep global tariffs.\nThe Dow Jones Industrial Average sank 1,510 points, or 3…",
    "link": "https://biztoc.com/x/2349bd8e87ba7679",
    "timestamp": "2025-04-03T15:04:59Z"
  },
  {
    "title": "Why iShares Russell 2000 ETF (IWM) Is Down 6% Today",
    "description": "The iShares Russell 2000 ETF (NASDAQ:IWM), which tracks small-cap stocks, plunged 6.5% on Thursday as President Donald Trump's sweeping reciprocal tariffs roiled financial markets and heightened concerns about an economic downturn.\nTrump on Wednesday declared…",
    "link": "https://biztoc.com/x/9c8c0a18002e87ed",
    "timestamp": "2025-04-03T15:04:34Z"
  },
  {
    "title": "China threatens retaliation after Trump hits it with highest U.S. tariff on any country",
    "description": "China said Thursday it would take all “necessary measures” to protect its legitimate interests after it was hit particularly hard by President Donald Trump’s sweeping tariffs on U.S. trading partners around the world.",
    "link": "https://biztoc.com/x/baa3529da8759ba2",
    "timestamp": "2025-04-03T15:04:20Z"
  },
  {
    "title": "Donald Trump NOAA Cuts Raise Concerns About Home Insurance Rising",
    "description": "U.S. Representative Jared Moskowitz, a Democrat from Florida, is urging President Donald Trump's administration to reconsider recent staff cuts to the National Oceanic and Atmospheric Administration (NOAA) out of myriad concerns, including the safety of Ameri…",
    "link": "https://biztoc.com/x/fbf046e8e3b9b865",
    "timestamp": "2025-04-03T15:04:17Z"
  },
  {
    "title": "How the UK and Europe could respond to Trump’s ‘Liberation Day’ tariffs",
    "description": "One bizarre consequence of Trump’s tariff wars could be the chance to watch Netflix for free.",
    "link": "https://theconversation.com/how-the-uk-and-europe-could-respond-to-trumps-liberation-day-tariffs-253650",
    "timestamp": "2025-04-03T15:03:45Z"
  },
  {
    "title": "Why Putin Is Stalling Trump on Ukraine",
    "description": "The Russian leader cannot afford to end the war he started.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-putin-russia-ukraine-ceasefire-peace-negotiations-economy/",
    "timestamp": "2025-04-03T15:03:20Z"
  },
  {
    "title": "Why is Israel expanding its offensive in Gaza and what does it mean for the Middle East? Expert Q&A",
    "description": "A Middle East expert explains why Israel is expanding its military offensive in Gaza.",
    "link": "https://theconversation.com/why-is-israel-expanding-its-offensive-in-gaza-and-what-does-it-mean-for-the-middle-east-expert-qanda-253667",
    "timestamp": "2025-04-03T15:03:10Z"
  },
  {
    "title": "‘Doom loops’ are accelerating climate change – but we can break them",
    "description": "Extreme heat caused a resurgence in coal use in 2024 to power air conditioners. But there is an alternative.",
    "link": "https://theconversation.com/doom-loops-are-accelerating-climate-change-but-we-can-break-them-253457",
    "timestamp": "2025-04-03T15:03:07Z"
  },
  {
    "title": "4/3/25 National Security and Korean News and Commentary",
    "description": "Access National Security News HERE. Access Korean News HERE. National Security News Content: 1. We tried ‘fighting China’ with lower budgets. It didn’t go well. 2. Trump’s Tariffs Aim to Create a New World Economic Order 3. Trump’s Tariffs Were Supposed to Bo…",
    "link": "https://smallwarsjournal.com/2025/04/03/4-3-25-national-security-and-korean-news-and-commentary/",
    "timestamp": "2025-04-03T15:02:18Z"
  },
  {
    "title": "Trump Tariffs Mean Your Next Phone Just Got A Lot More Expensive",
    "description": "Even if you don't care about politics, governmental choices can have an effect on the things you love.",
    "link": "https://www.talkandroid.com/504107-trump-tariff-phone-price/",
    "timestamp": "2025-04-03T15:01:04Z"
  },
  {
    "title": "Tariffs jolt B2B ecommerce and manufacturing",
    "description": "Sweeping new tariffs imposed by President Donald Trump are shaking the foundation of B2B ecommerce and manufacturing distribution in the U.S., forcing companies to reevaluate sourcing strategies, pricing models, and inventory planning in real time. The admini…",
    "link": "https://www.digitalcommerce360.com/2025/04/03/tariffs-jolt-b2b-ecommerce-and-manufacturing/",
    "timestamp": "2025-04-03T15:00:54Z"
  },
  {
    "title": "Laura Loomer Met With Trump in the Oval Office — And Called for Heads to Roll",
    "description": "Laura Loomer called for heads to roll in an Oval Office meeting with President Donald Trump on Wednesday -- and Trump is sympathetic to her arguments.\nThe post Laura Loomer Met With Trump in the Oval Office — And Called for Heads to Roll first appeared on Med…",
    "link": "https://www.mediaite.com/news/laura-loomer-met-with-trump-in-the-oval-office-and-called-for-heads-to-roll/",
    "timestamp": "2025-04-03T15:00:45Z"
  },
  {
    "title": "Furious fans hijack Nintendo Treehouse: Live stream with demands to 'drop the price'",
    "description": "The Nintendo Switch 2's controversial price has fans divided, and they're now taking their frustrations directly to the source.",
    "link": "https://www.techradar.com/gaming/furious-fans-hijack-nintendo-treehouse-live-stream-with-demands-to-drop-the-price",
    "timestamp": "2025-04-03T15:00:24Z"
  },
  {
    "title": "Donald Trump NOAA Cuts Raise Concerns About Home Insurance Rising",
    "description": "Twenty-five Democrats voiced their concerns about NOAA job cuts endangering lives and raising insurance premiums.",
    "link": "https://www.newsweek.com/donald-trump-noaa-job-cuts-home-insurance-crisis-2054473",
    "timestamp": "2025-04-03T15:00:01Z"
  },
  {
    "title": "The India-US Trade Dilemma: Tariffs, Tensions, and the Road Ahead",
    "description": "New Delhi faces a difficult choice between attempting to ease tariffs through diplomatic channels or imposing counter-tariffs on U.S. goods.",
    "link": "https://thediplomat.com/2025/04/the-india-us-trade-dilemma-tariffs-tensions-and-the-road-ahead/",
    "timestamp": "2025-04-03T15:00:00Z"
  },
  {
    "title": "Who’s winning the race for the Arctic’s resources?",
    "description": "Russia says it is open to economic cooperation with the West in the Arctic.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/4/3/whos-winning-the-race-for-the-arctics-resources",
    "timestamp": "2025-04-03T15:00:00Z"
  },
  {
    "title": "ABC News Daily: Will Trump's 'liberation day' lead to global recession?",
    "description": "The US president says America has been looted and plundered for decades.  \n\nGlobal trade is his enemy and his response? Big tariffs, or taxes, charged on goods imported to the United States, from another 34 percent on Chinese imports to 10 percent on everythi…",
    "link": "https://www.abc.net.au/listen/programs/abc-news-daily/will-trumps-liberation-day-lead-to-global-recession/105134488",
    "timestamp": "2025-04-03T15:00:00Z"
  },
  {
    "title": "Analysis-Emerging economies brace for Trump tariff 'turning point'",
    "description": "SINGAPORE/LONDON (Reuters) -Emerging economies worldwide are bracing for sliding currencies and a possible deterioration of their sovereign credit after U.S....",
    "link": "https://finance.yahoo.com/news/analysis-emerging-economies-brace-trump-145942612.html",
    "timestamp": "2025-04-03T14:59:42Z"
  },
  {
    "title": "Trump Hands China a Big Opening",
    "description": "\"Donald Trump’s decision to boost tariffs on almost every country will deal a blow to China’s economy. But it’s also handing Xi Jinping a rare opening to deepen relationships across the board, including with key",
    "link": "https://politicalwire.com/2025/04/03/trump-hands-china-a-big-opening/",
    "timestamp": "2025-04-03T14:59:35Z"
  },
  {
    "title": "7 Takeaways From Trump’s Reciprocal Tariff Roll Out",
    "description": "The president launched a new chapter in U.S. trade, imposing a 10 percent universal tariff on trading partners and higher reciprocal levies on some.. WASHINGTON—Just 72 days after taking office, President Donald Trump announced on April 2 sweeping trade polic…",
    "link": "https://freerepublic.com/focus/f-news/4308582/posts",
    "timestamp": "2025-04-03T14:59:31Z"
  },
  {
    "title": "TRUMP EFFECT CONTINUES: March Border Apprehensions Fall to Historic Low Level -- Down 95 Percent from Last Year",
    "description": "Trump officials state that operational control of the U.S.-Mexico border is becoming a reality. The statement follows another month of declining apprehensions of illegal border crossers entering the U.S. from Mexico. The apprehensions fell by more than 1,1oo …",
    "link": "https://www.breitbart.com/border/2025/04/03/trump-effect-continues-march-border-apprehensions-fall-to-historic-low-level-down-95-percent-from-last-year/",
    "timestamp": "2025-04-03T14:59:23Z"
  },
  {
    "title": "US 10-year treasury yield drops to 6-month low after Donald Trump’s sweeping tariff plan",
    "description": "The yield on the US 10-year Treasury bond has fallen to its lowest level since October; President Donald Trump announced plans for tariffs across a host of goods. Fears of a global tariff war sent markets down and investors to safe assets. Stock markets, incl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-10-year-treasury-yield-drops-to-6-month-low-after-donald-trumps-sweeping-tariff-plan/articleshow/119949294.cms",
    "timestamp": "2025-04-03T14:58:01Z"
  },
  {
    "title": "NRF expects ‘slower trajectory for consumer spending’ in 2025 as tariffs fuel uncertainty, inflation fears",
    "description": "Retail sales could grow 3.7% at best — or well under 3% — as many consumers reach the limits of their spending power, according to the trade group.",
    "link": "https://www.retaildive.com/news/nrf-slower-consumer-spending-tariffs-uncertainty-inflation/744288/",
    "timestamp": "2025-04-03T14:58:00Z"
  },
  {
    "title": "The operation is over! The patient lived and is healing: Donald Trump after announcing reciprocal tariffs",
    "description": "President Trump announced that the US economy will become stronger following the implementation of new tariffs on imports. The tariffs include a 10% tax on all imports and higher rates on specific countries. The move is expected to end unfair trade practices …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-operation-is-over-the-patient-lived-and-is-healing-donald-trump-after-announcing-reciprocal-tariffs/articleshow/119948947.cms",
    "timestamp": "2025-04-03T14:57:49Z"
  },
  {
    "title": "US tariffs 'more damaging than many expected', says Swedish PM",
    "description": "Sweden's government has warned of lower growth and rising prices as a result of the tariffs the US announced on Wednesday in what US President Donald Trump called his \"liberation day\".",
    "link": "https://www.thelocal.se/20250403/us-tariffs-more-damaging-than-many-expected-says-swedish-pm",
    "timestamp": "2025-04-03T14:57:25Z"
  },
  {
    "title": "Why Trump's tariffs aren't really reciprocal",
    "description": "BBC Verify's Ben Chu takes a look at the wide range of different tariffs being imposed on countries.",
    "link": "https://www.bbc.com/news/videos/c14xldg3mjvo",
    "timestamp": "2025-04-03T14:55:43Z"
  },
  {
    "title": "Stellantis Lays Off Hundreds of Workers in US over Trump Tariffs: Reports",
    "description": "The maker of Ram trucks and Jeeps has also halted production at plants in Mexico and Canada, according to reports.",
    "link": "https://www.newsweek.com/stellantis-lays-off-hundreds-workers-us-over-trump-tariffs-reports-2054895",
    "timestamp": "2025-04-03T14:54:50Z"
  },
  {
    "title": "'Bright side': Ex-GOP lawmaker says Trump's tariffs could be 'large awakening' to his base",
    "description": "Former Rep. Adam Kinzinger (R-IL) released an \"Emergency Video\" to his Substack readers Thursday about President Donald Trump's wide-ranging tariffs that he claimed could finally wake up even Trump's most ardent supporters.\"This will show the American people …",
    "link": "https://www.rawstory.com/kinzinger-slams-trump/",
    "timestamp": "2025-04-03T14:54:15Z"
  },
  {
    "title": "Mexico praises ‘preferential’ US tariffs treatment | CNN",
    "description": "Mexico’s economic minister Marcelo Ebrard praised the “preferential treatment” received by Mexico after US President Donald Trump unveiled sweeping new global tariffs.",
    "link": "https://www.cnn.com/2025/04/03/americas/mexico-praises-preferential-us-tariffs-treatment-latam-intl/index.html",
    "timestamp": "2025-04-03T14:53:58Z"
  },
  {
    "title": "Trump issues ‘prognosis’ for US after tariffs in medical metaphor",
    "description": "President Donald Trump gave a \"prognosis\" for the U.S. after reciprocal tariffs, making a medical metaphor in saying \"the patient lived, and is healing.\"",
    "link": "https://www.foxnews.com/politics/trump-issues-prognosis-us-after-tariffs-medical-metaphor",
    "timestamp": "2025-04-03T14:53:49Z"
  },
  {
    "title": "Trump sparks health fears as he 'forgets' to sign executive order and has to be 'guided' back to his seat",
    "description": "President Trump announced a new round of tariffs on nearly all U.S. trading partners in a bid to boost domestic manufacturing while risking inflation and t",
    "link": "https://www.newsbreak.com/share/3947643590770-trump-sparks-health-fears-as-he-forgets-to-sign-executive-order-and-has-to-be-guided-back-to-his-seat?_f=app_share&amp;pd=0I7QmeKt&amp;lang=en_US&amp;send_time=1743691945&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.13.2.5%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v6%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v6%2Cns_push_exp_rt_bucketv12-v8&amp;s=i2",
    "timestamp": "2025-04-03T14:53:39Z"
  },
  {
    "title": "Crypto execs ask Congress to let stablecoins pay interest as bill set to advance",
    "description": "Some influential cryptocurrency executives are making a last-minute pitch to Congress to allow interest to be paid on U.S. dollar-pegged tokens as part of popular legislation establishing a regulatory framework for stablecoins.That lobbying effort has been me…",
    "link": "https://www.channelnewsasia.com/business/crypto-execs-ask-congress-let-stablecoins-pay-interest-bill-set-advance-5042886",
    "timestamp": "2025-04-03T14:53:33Z"
  },
  {
    "title": "Oil Prices Crash 7% on Trump Tariffs, OPEC Ramp-Up",
    "description": "The price of WTI crude oil dropped more than 7% on Thursday as President Donald Trump’s Liberation Day tariffs blitzed markets and OPEC+ threw an unexpected production curveball. At 10:38 a.m. in New York, Brent crude was trading at $70.21—a 6.32% slide—while…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Crash-7-on-Trump-Tariffs-OPEC-Ramp-Up.html",
    "timestamp": "2025-04-03T14:53:22Z"
  },
  {
    "title": "Oil dips 7% as trade war escalates",
    "description": "Crude oil prices continued to drop on Thursday after United States President Donald Trump slapped tariffs on imports from all over the world, raising concerns about the future of global trade and econ...",
    "link": "https://biztoc.com/x/19ee33c82e9d16c8",
    "timestamp": "2025-04-03T14:53:10Z"
  },
  {
    "title": "‘The Daily Show’ Laments Trump’s Liberation Day Tariffs: ‘In His Defense, He Was Lying’ | Video",
    "description": "“What am I even being liberated from? The ability to afford goods and services?” Comedy Central host Michael Kosta asks\nThe post ‘The Daily Show’ Laments Trump’s Liberation Day Tariffs: ‘In His Defense, He Was Lying’ | Video  appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-daily-show-trump-liberation-day-tariffs-michael-kosta/",
    "timestamp": "2025-04-03T14:51:17Z"
  },
  {
    "title": "VW and Mercedes Answer Trump With Price Hikes, Output Shifts",
    "description": "Europe’s automakers are raising prices and preparing to shift car production to the US to try to protect themselves from President Donald Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/vw-and-mercedes-answer-trump-with-price-hikes-output-shifts",
    "timestamp": "2025-04-03T14:51:17Z"
  },
  {
    "title": "5 places Trump has targeted for tariffs even though they have few or no exports",
    "description": "The Trump administration’s sweeping tariffs have touched rocky outcrops home to polar bears in the Arctic, tiny tropical islands and a former British penal colony whose leader is befuddled that it was targeted.",
    "link": "https://www.pbs.org/newshour/world/5-places-trump-has-targeted-for-tariffs-even-though-they-have-few-or-no-exports",
    "timestamp": "2025-04-03T14:50:04Z"
  },
  {
    "title": "Donald Trump's shares worth $2 billion in Trump media are up for sale. Details here",
    "description": "Donald Trump is the largest single shareholder in Trump Media, controlling roughly 53 per cent of its shares.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-shares-worth-2-billion-in-trump-media-are-up-for-sale-details-here/articleshow/119949017.cms",
    "timestamp": "2025-04-03T14:49:42Z"
  },
  {
    "title": "Late Night Takes on Trump Tariffs and Elon Musk Loss",
    "description": "Stephen Colbert, Seth Meyers, and Jimmy Fallon all went in on either Donald Trump’s tariffs or Elon Musk’s Wisconsin loss this week.",
    "link": "http://www.vulture.com/article/late-night-donald-trump-tariffs.html",
    "timestamp": "2025-04-03T14:49:16Z"
  },
  {
    "title": "'Population Zero': The Stable Genius Places Tariffs On Uninhabited Islands",
    "description": "The painfully stupid self-described Stable Genius® imposed \"reciprocal\" tariffs on Wednesday, which he deemed Liberation Day, and the stock market plummeted soon after his announcement. Before his speech, Donald wrote on Truth Social, \"IT’S LIBERATION DAY IN …",
    "link": "https://crooksandliars.com/2025/04/zero-population-stable-genius-places",
    "timestamp": "2025-04-03T14:48:59Z"
  },
  {
    "title": "US stock market tanks at open after rollout of Trump's new tariffs",
    "description": "Stocks took a nosedive Thursday morning after President Donald Trump rolled out sweeping tariffs on countries all over the world on Wednesday, raising the risk of a wider trade war. NBC's Christine Romans joins TODAY to break down the impact on Wall Street an…",
    "link": "https://www.today.com/video/us-stock-market-tanks-at-open-after-rollout-of-trump-s-new-tariffs-236361797566",
    "timestamp": "2025-04-03T14:48:36Z"
  },
  {
    "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
    "description": "A surge in federal government job cuts contributed to a near record-setting pace for announced layoffs in March, exceeded only by when the country shut down in 2020 for the Covid pandemic, according to a report Thursday from job placement firm Challenger, Gra…",
    "link": "https://www.nbcnews.com/business/economy/layoff-announcements-surge-pandemic-musks-doge-slices-federal-labor-fo-rcna199508",
    "timestamp": "2025-04-03T14:47:29Z"
  },
  {
    "title": "Will Ireland get caught in the crossfire of the EU's response to Trump's tariffs?",
    "description": "The EU is weighing up moves against the US tech sector – a move that would undoubtedly have an impact on Ireland.",
    "link": "https://www.thejournal.ie/ireland-tariffs-6667010-Apr2025/",
    "timestamp": "2025-04-03T14:47:22Z"
  },
  {
    "title": "Trump installs 10% baseline tariff, country-specific duties",
    "description": "The president said he will levy import taxes on China, Japan and others equal to half of what they charge the U.S. based on White House calculations.",
    "link": "https://www.supplychaindive.com/news/trump-reciprocal-tariffs-china-japan-eu-vietnam/744301/",
    "timestamp": "2025-04-03T14:47:00Z"
  },
  {
    "title": "The Most Controversial Artworks of the 21st Century So Far",
    "description": "These envelope-pushing works seemed designed to create scandal—and that was sometimes the point.",
    "link": "https://www.artnews.com/list/art-news/artists/controversial-artworks-21st-century-1234736563/",
    "timestamp": "2025-04-03T14:46:45Z"
  },
  {
    "title": "Jasmine Crockett Not Intimidated By Pam Bondi’s Tesla Fascism",
    "description": "It’s bad enough that Attorney General Pam Bondi is labeling Tesla vandals as “terrorists,” especially after Donald Trump pardoned the violent Jan. 6 insurrectionists, but it’s even worse that she threatened U.S. Congresswoman Jasmine Crockett, on Fox News, fo…",
    "link": "https://crooksandliars.com/2025/04/jasmine-crockett-not-intimidated-pam-bondi",
    "timestamp": "2025-04-03T14:45:23Z"
  },
  {
    "title": "Hakeem Jeffries: It's Trump Recession Day",
    "description": "House Minority Leader Hakeem Jeffries shot down the idiotic idea of April 2nd being called Liberation Day by MAGAts and smacked Trump upside the head with its true moniker to Anderson Cooper on CNN.\nAny market analyst, being honest, will tell you Trump is des…",
    "link": "https://crooksandliars.com/2025/04/corey-booker-its-trump-recession-day",
    "timestamp": "2025-04-03T14:45:02Z"
  },
  {
    "title": "Eric Adams Won't Be Running for Reelection as a Democrat",
    "description": "Fresh off the dismissal of federal corruption charges , New York City Mayor Eric Adams is moving ahead with his reelection campaign. News 12 reports that Adams will be running as an independent in the Big Apple's mayoral race, as announced in an early Thursda…",
    "link": "https://www.newser.com/story/366626/eric-adams-im-going-indie-for-mayoral-race.html",
    "timestamp": "2025-04-03T14:45:00Z"
  },
  {
    "title": "Dow Jones Drops 1,400 Points a Day After Trump Tariff Announcement",
    "description": "Dow Jones Drops 1,400 Points a Day After Trump Tariff Announcementtheepochtimes.com",
    "link": "https://www.theepochtimes.com/business/dow-jones-drops-1400-points-a-day-after-trump-tariff-announcement-5836170",
    "timestamp": "2025-04-03T14:44:55Z"
  },
  {
    "title": "The Blunt Force Trauma of the Trump Tariffs",
    "description": "Elon Musk and DOGE have taken a blowtorch to federal agencies. But the tariffs are a helpful reminder that it's Donald Trump who's fiddling while it all burns.",
    "link": "https://www.wired.com/story/trump-tariffs-penguins/",
    "timestamp": "2025-04-03T14:44:32Z"
  },
  {
    "title": "Kremlin official says he's meeting Trump admin in first Russian visit to US since Ukraine war",
    "description": "Russia's special envoy on international economic and investment, Kirill Dmitriev, says he's in Washington meeting with the Trump administration.",
    "link": "https://www.foxnews.com/politics/kremlin-official-says-hes-meeting-trump-admin-first-russian-visit-us-since-ukraine-war",
    "timestamp": "2025-04-03T14:44:07Z"
  },
  {
    "title": "Trump tariffs live updates: Stellantis to temporarily layoff 900 US employees",
    "description": "Fallout continues after President Donald Trump's unveiling of severe tariffs against virtually all U.S. trading partners.",
    "link": "https://abcnews.go.com/Politics/live-updates/trump-tariffs-live-updates-stellantis-temporarily-layoff-900/?id=120449471",
    "timestamp": "2025-04-03T14:43:32Z"
  },
  {
    "title": "JD Vance Says Admin Will Not ‘Ask Permission From Far-Left Democrats’ To Deport Criminals",
    "description": "Vice President J.D. Vance said that the administration will refuse to \"ask permission from far-left Democrats\" before they deport criminals.",
    "link": "https://dailycaller.com/2025/04/03/jd-vance-far-left-deport-criminals/",
    "timestamp": "2025-04-03T14:42:46Z"
  },
  {
    "title": "Serena William's husband still pining for TikTok USA and puts a condition on the new owner",
    "description": "With the clock ticking toward an April 5 deadline, Amazon has reportedly submitted a last-minute bid to purchase TikTok&apos;s U.S. operations, throwing its hat into an already con",
    "link": "https://www.marca.com/en/tennis/2025/04/03/67ee8ee8ca47412b228b45a4.html",
    "timestamp": "2025-04-03T14:42:20Z"
  },
  {
    "title": "Here's How Tariffs Could Affect This Industry Giant. Should Investors Be Worried?",
    "description": "In This Article:\nAfter a few months of speculation, President Donald Trump finally announced his full tariff plan on April 2, which included updated tariffs on more than 180 countries. Some tariffs were on the low end at 10%, while others skyrocketed to over …",
    "link": "https://biztoc.com/x/c281f3e49ff613c8",
    "timestamp": "2025-04-03T14:42:19Z"
  },
  {
    "title": "Nike Stock Is Tumbling Thursday: Here's Why",
    "description": "Nike Inc (NYSE:NKE) shares are tumbling Thursday after U.S. President Donald Trump announced sweeping reciprocal tariffs on several countries around the world.\nWhat To Know: Nike shares are falling sharply Thursday morning as Trump administration tariffs thre…",
    "link": "https://biztoc.com/x/82327fde2074bd94",
    "timestamp": "2025-04-03T14:42:06Z"
  },
  {
    "title": "Macron: Tariffs will have massive effect on Europe",
    "description": "French President Emmanuel Macron warned Thursday that the consequences of counter-duties previously imposed by United States President Donald Trump will have a \"massive effect on the European economy....",
    "link": "https://biztoc.com/x/775eada9d867043b",
    "timestamp": "2025-04-03T14:42:05Z"
  },
  {
    "title": "‘We’re Done Using That Word!’ Jim Cramer and CNBC Colleagues Bash Trump Claim That Tariffs Are ‘Reciprocal’",
    "description": "Jim Cramer and his CNBC colleagues aren't buying President Donald Trump's claim that the tariffs announced yesterday are \"reciprocal.\"\nThe post ‘We’re Done Using That Word!’ Jim Cramer and CNBC Colleagues Bash Trump Claim That Tariffs Are ‘Reciprocal’ first a…",
    "link": "https://www.mediaite.com/tv/were-done-using-that-word-jim-cramer-and-cnbc-colleagues-bash-trump-claim-that-tariffs-are-reciprocal/",
    "timestamp": "2025-04-03T14:41:42Z"
  },
  {
    "title": "Trump Tariffs Show Signs of Being Written by AI",
    "description": "President Donald Trump has announced what he claims to be a \"reciprocal\" ten percent tariff plan on most goods being imported into the US, affecting over 100 countries. A smaller list of what he referred to as \"worst offenders\" got even higher rates. It's a b…",
    "link": "https://futurism.com/trump-tariffs-signs-ai",
    "timestamp": "2025-04-03T14:41:08Z"
  },
  {
    "title": "Hungary says it will withdraw from ICC as Netanyahu arrives on its soil despite arrest warrant",
    "description": "Hungary will withdraw itself from the International Criminal Court (ICC), an official said, as Israel's Benjamin Netanyahu visited the country in spite of a warrant for his arrest.",
    "link": "https://news.sky.com/story/hungary-says-it-will-withdraw-from-international-criminal-court-as-benjamin-netanyahu-arrives-on-its-soil-despite-arrest-warrant-13341288",
    "timestamp": "2025-04-03T14:41:00Z"
  },
  {
    "title": "Democratic performance is improving in a slew of special elections, as a weary party looks for signs of hope",
    "description": "Democrats have spent the first months of Donald Trump’s second administration wandering the political wilderness — facing record-low popularity while competing factions battle over how exactly to take on the president.",
    "link": "https://www.nbcnews.com/politics/elections/democratic-performance-improving-slew-special-elections-weary-party-lo-rcna198984",
    "timestamp": "2025-04-03T14:40:11Z"
  },
  {
    "title": "Mumbai-Based IT Training Firm Jetking to Raise Over Rs. 6 Crore to Fund Bitcoin Acquisition",
    "description": "Jetking CFO Siddharth Bharwani said the company would raise Rs. 6.6 crore by selling 4,28,622 equity shares in compliance with SEBI regulations. Some portion of the collection will also be utilised to initiate Bitcoin-related educational, training, and skill …",
    "link": "https://www.gadgets360.com/cryptocurrency/news/jetking-raise-6-crore-fund-bitcoin-acquisition-india-8079673",
    "timestamp": "2025-04-03T14:40:00Z"
  },
  {
    "title": "US stock market today crashes: Dow Jones, S&P 500, Nasdaq tank. Nvidia, Nike, United Airlines share prices are worse hit",
    "description": "Wall street has felt heat of President Donald Trump's tariffs announcement as US Stock market's major indices -- S&P 500, Dow Jones, and Nasdaq -- sank on Thursday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-crashes-dow-jones-sp-500-nasdaq-tank-nvidia-nike-united-airlines-share-prices-are-worse-hit/articleshow/119948732.cms",
    "timestamp": "2025-04-03T14:39:58Z"
  },
  {
    "title": "'She excoriated them': Controversial Trump ally met \n​ president to push for major firings",
    "description": "Far-right influencer Laura Loomer met with president Donald Trump at the White House and urged him to shake up his national security staff.Loomer sat across the Resolute Desk from the president in the Oval Office on Wednesday and pressed him to fire National …",
    "link": "https://www.rawstory.com/laura-loomer-white-house/",
    "timestamp": "2025-04-03T14:39:27Z"
  },
  {
    "title": "Trump gets rare Democrat support for new tariffs: 'This is a good start'",
    "description": "At least one House Democrat is showing some optimism for President Donald Trump's plan on tariffs.",
    "link": "https://www.foxnews.com/politics/trump-gets-rare-democrat-support-new-tariffs-this-good-start",
    "timestamp": "2025-04-03T14:39:11Z"
  },
  {
    "title": "Trump 10% blanket tariff gets rare backing from House Democrat: 'Pleased'",
    "description": "At least one House Democrat is showing some optimism for President Donald Trump's plan on tariffs.",
    "link": "https://www.foxnews.com/politics/democrat-rep-vows-work-trump-key-part-tariff-plan-hoping-i-can-help",
    "timestamp": "2025-04-03T14:39:11Z"
  },
  {
    "title": "Apple has its biggest stock drop in five years because of Trump’s tariffs",
    "description": "Shares of Apple, Amazon, and other tech stocks are getting walloped on Thursday as the markets digest the impact of President Donald Trump’s new round of tariffs announced on Wednesday evening. Shares of Apple were down about 9 percent on Thursday morning, wh…",
    "link": "https://www.theverge.com/news/642598/apple-stock-trump-tariffs",
    "timestamp": "2025-04-03T14:38:12Z"
  },
  {
    "title": "Trump’s Tariffs Send Shockwaves Across Global Economy",
    "description": "President Donald Trump imposed the steepest American tariffs in a century as he steps up his campaign to reshape the global economy, sparking threats of retaliation and a selloff in markets around the world. Trump announced Wednesday he will apply …",
    "link": "https://www.insurancejournal.com/news/national/2025/04/03/818244.htm",
    "timestamp": "2025-04-03T14:37:26Z"
  },
  {
    "title": "What Rebalancing the US Economy Really Requires",
    "description": "US Treasury Secretary Scott Bessent’s defense of President Donald Trump’s trade tariffs as a step toward “rebalancing” the US economy misses the point. While some economies, like China and Germany, need to increase domestic spending, the US needs to increase …",
    "link": "https://www.project-syndicate.org/commentary/economic-rebalancing-according-to-trump-treasury-secretary-bessent-by-glenn-hubbard-2025-04",
    "timestamp": "2025-04-03T14:37:20Z"
  },
  {
    "title": "Lo que realmente exige el reequilibrio de la economía estadounidense",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/economic-rebalancing-according-to-trump-treasury-secretary-bessent-by-glenn-hubbard-2025-04/spanish",
    "timestamp": "2025-04-03T14:37:20Z"
  },
  {
    "title": "Gaza: Palestinians bear the brunt of Israel's clampdown",
    "description": "New military corridors, airstrikes, evacuation and a blockade of humanitarian aid exacerbate the humanitarian situation in Gaza. Is Israel's objective to pave the way for Trump's \"Gaza Riviera\" plans?",
    "link": "https://www.dw.com/en/gaza-palestinians-bear-the-brunt-of-israels-clampdown/a-72127982",
    "timestamp": "2025-04-03T14:37:00Z"
  },
  {
    "title": "Trump Administration Backs African Lobito Rail Plan, Envoy Says",
    "description": "The US said it remains committed to the Lobito Corridor project that links critical minerals deposits in central Africa to an Atlantic port, signaling a bright spot in trade with the continent facing painful tariff increases.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-administration-backs-african-lobito-rail-plan-envoy-says",
    "timestamp": "2025-04-03T14:35:59Z"
  }
]