[
  {
    "title": "Former Paramount Leader Shari Redstone Says CBS Settled With Trump Because He Might Have Caught Them Red-Handed",
    "description": "Shari Redstone said Paramount agreed to settle with President Donald Trump because of worries about what his legal team may find in discovery.",
    "link": "https://dailycaller.com/2025/08/19/former-cbs-head-says-network-settled-with-trump-because-he-might-have-caught-them-red-handed/",
    "timestamp": "2025-08-19T17:56:08Z"
  },
  {
    "title": "Karoline Leavitt Attacks Journalist at Briefing: ‘Only a Reporter From The New York Times Would Ask a Question Like That’",
    "description": "Karoline Leavitt took a shot at New York Times reporter Shawn McCreesh after the journalist pressed her on Trump avoiding \"disrespecting\" Putin.\nThe post Karoline Leavitt Attacks Journalist at Briefing: ‘Only a Reporter From The New York Times Would Ask a Que…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-attacks-journalist-at-briefing-only-a-reporter-from-the-new-york-times-would-ask-a-question-like-that/",
    "timestamp": "2025-08-19T17:56:02Z"
  },
  {
    "title": "US export concerns no bar, Nvidia developing new, advanced AI chip for China",
    "description": "The new processor, tentatively named the B30A, is based on Nvidia’s latest Blackwell architecture and will feature a single-die design",
    "link": "https://www.firstpost.com/tech/us-export-concerns-no-bar-nvidia-developing-new-advanced-ai-chip-for-china-13926283.html",
    "timestamp": "2025-08-19T17:55:43Z"
  },
  {
    "title": "California Redistricting Plan May Swing on This Sonoma County Shakeup",
    "description": "A district anchored in Santa Rosa could help Democrats flip the House — and provide a \"tailor-made\" landing spot for State Senate President pro tem Mike McGuire.",
    "link": "https://www.kqed.org/news/12052702/california-redistricting-plan-may-swing-on-this-sonoma-county-shakeup",
    "timestamp": "2025-08-19T17:55:29Z"
  },
  {
    "title": "Trump offers 'assurance' U.S. won't send ground troops to Ukraine (Patrick Svitek/Washington Post)",
    "description": "Patrick Svitek / Washington Post:\nTrump offers ‘assurance’ U.S. won't send ground troops to Ukraine  —  The president suggested European nations would have troops on the ground in Ukraine, while the United States would support them in other ways.  —  Presiden…",
    "link": "https://www.memeorandum.com/250819/p71",
    "timestamp": "2025-08-19T17:55:00Z"
  },
  {
    "title": "Americans’ views of global threats differ by party, age",
    "description": "Seven-in-ten Americans view the spread of false information online as a major threat facing the nation in 2025.\nThe post Americans’ views of global threats differ by party, age appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/08/19/americans-views-of-global-threats-differ-by-party-age/",
    "timestamp": "2025-08-19T17:54:57Z"
  },
  {
    "title": "Kiev’s backers fail to sway Trump on Russia – analyst",
    "description": "The Western Europeans have “come up empty” at the recent summit in Washington, Sergey Poletaev has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623285-europe-failed-sway-trump-analyst/",
    "timestamp": "2025-08-19T17:52:37Z"
  },
  {
    "title": "White House Reacts to Potential Location of Putin-Zelensky Talks",
    "description": "The Kremlin hasn't ruled out summits but has said they could only meet in the very final stages of clinching a peace agreement.",
    "link": "https://www.newsweek.com/russia-ukraine-war-trump-zelensky-putin-budapest-meet-2115858",
    "timestamp": "2025-08-19T17:51:58Z"
  },
  {
    "title": "Why Ukraine won’t just give up its territory",
    "description": "President Donald Trump greets Ukrainian President Volodymyr Zelensky at the White House on August 18, 2025. | Tasos Katopodis/Getty Images \nUkrainian forces still control 2,550 square miles of the eastern Ukrainian region known as the Donbas, an area roughly …",
    "link": "https://biztoc.com/x/1a89510b2665845a",
    "timestamp": "2025-08-19T17:51:31Z"
  },
  {
    "title": "Trump Rules Out U.S. Ground Troops in Ukraine",
    "description": "President Donald Trump has ruled out sending U.S. troops to Ukraine as part of any potential peace deal with Russia, reassuring his America First base that no ground forces will be deployed. In a Fox News interview, Trump said, “You have my assurance, and I’m…",
    "link": "https://biztoc.com/x/fc1bf027f5bdb29d",
    "timestamp": "2025-08-19T17:51:22Z"
  },
  {
    "title": "Student Loan Update: Lawmakers Issue Warning Over Change Impacting Millions",
    "description": "This is a move the senators said would harm borrowers who had been in repayment for two decades or more.",
    "link": "https://www.newsweek.com/student-loan-update-lawmakers-issue-warning-over-change-impacting-millions-2115779",
    "timestamp": "2025-08-19T17:51:01Z"
  },
  {
    "title": "‘Completely false’: Nicolle Wallace fact-checks Trump’s attacks on mail-in voting",
    "description": "Nicolle Wallace fact-checks Trump's attacks on mail-in voting and points out a major hole in the president's plan to end the practice.",
    "link": "https://www.msnbc.com/top-stories/latest/fact-check-trump-mail-in-voting-fraud-rcna225850",
    "timestamp": "2025-08-19T17:50:32Z"
  },
  {
    "title": "Mark Hamill’s Wife Talked Him Out of Leaving US After Donald Trump’s Election",
    "description": "As Hamill tells it, his longtime wife Marilou York pulled a kind of Jedi mind trick.\nMark Hamill’s Wife Talked Him Out of Leaving US After Donald Trump’s Election\nWren Graves",
    "link": "https://consequence.net/2025/08/mark-hamill-us-wife-donald-trump/",
    "timestamp": "2025-08-19T17:50:22Z"
  },
  {
    "title": "Top California Dem Lawmaker Reportedly Had House Seat Gerrymandered for Him in Exchange for Support",
    "description": "DAILY CALLER NEWS FOUNDATION—A top California Democrat who is expected to help steer the Golden State’s mid-decade redistricting plan through the state legislature was reportedly... Read More\nThe post Top California Dem Lawmaker Reportedly Had House Seat Gerr…",
    "link": "https://www.dailysignal.com/2025/08/19/top-california-dem-lawmaker-reportedly-had-house-seat-gerrymandered-for-him-in-exchange-for-support-redistricting/",
    "timestamp": "2025-08-19T17:50:06Z"
  },
  {
    "title": "Bessent says US tariff revenues to rise 'substantially,' focus on reducing debt",
    "description": "WASHINGTON (Reuters) -U.S. Treasury Secretary Scott Bessent said he expects a big jump in revenues from sweeping tariffs imposed by President Donald Trump...",
    "link": "https://finance.yahoo.com/news/bessent-says-us-tariff-revenues-174752674.html",
    "timestamp": "2025-08-19T17:47:52Z"
  },
  {
    "title": "Trump in Command: President Leads Free World from White House Summit with European Leaders",
    "description": "European leaders praised President Donald Trump on Monday for his push to end the Ukraine-Russia war, which has culminated in plans for a peace meeting between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin.\nThe post Trump in Comm…",
    "link": "https://www.breitbart.com/politics/2025/08/19/trump-command-president-leads-free-world-white-house-summit-european-leaders/",
    "timestamp": "2025-08-19T17:46:52Z"
  },
  {
    "title": "Powell's Jackson Hole speech could setup a policy tweak that lasts well beyond his tenure",
    "description": "At Jackson Hole, Jerome Powell could lay out more overarching changes to the central bank’s dual mandate that will last long after his tenure is up next May ...",
    "link": "https://finance.yahoo.com/news/powells-jackson-hole-speech-could-setup-a-policy-tweak-that-lasts-well-beyond-his-tenure-174606260.html",
    "timestamp": "2025-08-19T17:46:06Z"
  },
  {
    "title": "Oklahoma to require ideology test for teachers from New York and California",
    "description": "Oklahoma will require applicants for teaching jobs from California and New York to pass an exam that the state’s top education official says is designed to safeguard against “radical leftist ideology.”",
    "link": "https://www.pbs.org/newshour/politics/oklahoma-to-require-ideology-test-for-teachers-from-new-york-and-california",
    "timestamp": "2025-08-19T17:43:07Z"
  },
  {
    "title": "Trump administration confirms it’s seeking a stake in Intel",
    "description": "Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick confirmed on Tuesday that the U.S. government is considering an extraordinary investment in struggling chipmaker Intel.",
    "link": "https://www.abc12.com/news/business/trump-administration-confirms-it-s-seeking-a-stake-in-intel/article_ce3016d1-4231-5a66-aee7-ae9bc00043f7.html",
    "timestamp": "2025-08-19T17:41:25Z"
  },
  {
    "title": "Eight steps for exporters, especially MSMEs, to take to cope against Trump tariffs",
    "description": "India faces challenges from US tariffs and Chinese export curbs. To counter this, the article suggests strengthening India's industrial base. It also suggests reforming government procedures. Lowering import duties and supporting nascent tech sectors are impo…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/eight-steps-for-exporters-especially-msmes-to-take-to-cope-against-trump-tariffs/articleshow/123392754.cms",
    "timestamp": "2025-08-19T17:41:22Z"
  },
  {
    "title": "Tap Into the Truth",
    "description": "Rolling Stone and Variety presented the Truth Seekers Award to Jake Tapper, who had choice words for the state of journalism, during the fifth annual Truth Seekers Summit presented by Paramount+",
    "link": "http://www.rollingstone.com/culture/culture-news/fifth-truth-seekers-jake-tapper-1235410862/",
    "timestamp": "2025-08-19T17:41:21Z"
  },
  {
    "title": "This conversation is being recorded: Trump’s hot mic moment is the latest in a long global list",
    "description": "Hot mics have historically caught leaders off guard, revealing their true thoughts.",
    "link": "https://www.bostonherald.com/2025/08/19/trump-hot-mic-moments/",
    "timestamp": "2025-08-19T17:40:33Z"
  },
  {
    "title": "Howard Lutnick Calls CHIPS Act a ‘Giveaway to Rich Companies’ Like Intel",
    "description": "The U.S. government is in talks to get a 10% equity stake in Intel.",
    "link": "https://gizmodo.com/howard-lutnick-calls-chips-act-a-giveaway-to-rich-companies-like-intel-2000645034",
    "timestamp": "2025-08-19T17:40:15Z"
  },
  {
    "title": "Trump's Plans for Intel Take a Page From Bernie Sanders' Playbook",
    "description": "President Donald Trump is not the first prominent American politician to demand that the federal government take partial control of Intel and other manufacturers of advanced computer chips.\nBut it might surprise you to learn whose idea he has embraced.\nDuring…",
    "link": "https://biztoc.com/x/86b70d97864cc71b",
    "timestamp": "2025-08-19T17:40:10Z"
  },
  {
    "title": "'His health can't be right': Trump sparks new concern with 'heaven' talk",
    "description": "Donald Trump had the afterlife on his mind when speaking to Fox News over the phone Tuesday.Trump confessed to the hosts of \"Fox and Friends\" that the reason he's trying to end the war between Russia and Ukraine is to get into heaven. \"I just want to end it. …",
    "link": "https://www.rawstory.com/trump-health-2673901017/",
    "timestamp": "2025-08-19T17:39:48Z"
  },
  {
    "title": "Why Ukraine won’t just give up its territory",
    "description": "Ukrainian forces still control 2,550 square miles of the eastern Ukrainian region known as the Donbas, an area roughly the size of Delaware. For many, including President Donald Trump, who met with Ukrainian leader Volodymyr Zelenskyy on Monday at the White H…",
    "link": "https://www.vox.com/world-politics/458531/ukraine-land-swap-territory",
    "timestamp": "2025-08-19T17:37:09Z"
  },
  {
    "title": "Ukrainian diplomat involved in 90s nuclear deal with Russia warns Trump about 'very big mistake'",
    "description": "In 1994, Ukraine signed the Budapest Memorandum, agreeing to give up its nuclear arsenal, inherited from the Soviet Union, in return for security assurances from Russia and other powers. The man who led Kyiv's team back then is worried its allies are about to…",
    "link": "https://news.sky.com/story/ukrainian-diplomat-involved-in-90s-nuclear-deal-with-russia-warns-trump-about-very-big-mistake-with-putin-13414788",
    "timestamp": "2025-08-19T17:37:00Z"
  },
  {
    "title": "California's long ballot count may be Trump's next target in the war over voting",
    "description": "The latest salvo in President Donald Trump’s campaign against mail-in voting arrived Monday, as he announced he wants to “lead a movement” against mail ballots and advocate instead for in-person and paper ballots, which he says are “faster, and leaves NO DOUB…",
    "link": "https://www.nbcnews.com/politics/elections/californias-long-ballot-count-may-trumps-target-war-voting-rcna225732",
    "timestamp": "2025-08-19T17:35:39Z"
  },
  {
    "title": "David Allvin, top Air Force general, to retire early",
    "description": "Air Force chief of staff Gen. David Allvin announced he will retire in November, just two years into what is usually a four-year term as Air Force Chief of Staff.",
    "link": "https://www.cbsnews.com/news/top-air-force-general-david-allvin-to-retire-early/",
    "timestamp": "2025-08-19T17:35:01Z"
  },
  {
    "title": "Trump HUD Dismisses Biden Case That Targeted Recycling Company over 'Equity'",
    "description": "President Donald Trump's Department of Housing and Urban Development (HUD) in early August dismissed a case against a recycling company that Sen. Jim Banks (R-IN) said was targeted by the Biden administration and local officials in the name of \"equity\" and \"e…",
    "link": "https://www.breitbart.com/politics/2025/08/19/trump-hud-dismisses-biden-case-that-targeted-recycling-company-over-equity/",
    "timestamp": "2025-08-19T17:34:19Z"
  },
  {
    "title": "Executive Power and the Common Good, From Four Perspectives",
    "description": "In a recent discussion that brought influential thinkers of the right together for an unprecedented public debate, Curtis Yarvin, Christopher Caldwell, Patrick Deneen, and Chris... Read More\nThe post Executive Power and the Common Good, From Four Perspectives…",
    "link": "https://www.dailysignal.com/2025/08/19/executive-power-common-good-from-four-perspectives/",
    "timestamp": "2025-08-19T17:31:35Z"
  },
  {
    "title": "Ukraine ‘offers Trump $100bn arms deal’ for security guarantees | Ukraine: The Latest",
    "description": "Day 1273. Today, as we get more clarity on what the Europeans proposed to Donald Trump in the historic White House summit ...",
    "link": "https://biztoc.com/x/aae03f46aa39565d",
    "timestamp": "2025-08-19T17:31:21Z"
  },
  {
    "title": "Bitcoin Treasury KindlyMD Stock Dives Following $679 Million BTC Buy",
    "description": "Healthcare company KindlyMD said Tuesday that it spent $679 million buying Bitcoin, and its stock is down over 13% since.",
    "link": "https://decrypt.co/335795/bitcoin-treasury-kindlymd-stock-dives-679-million-btc-buy",
    "timestamp": "2025-08-19T17:30:43Z"
  },
  {
    "title": "Jack White Slams Donald Trump’s ‘Disgusting’ Oval Office Redesign: ‘What an Embarrassment’",
    "description": "The musician shared an image from the president's meeting with Ukraine president Volodymyr Zelensky, comparing the harsh gold color in the White House to a \"professional wrestler's dressing room\"",
    "link": "http://www.rollingstone.com/music/music-news/jack-white-donald-trump-tacky-gold-oval-office-1235411222/",
    "timestamp": "2025-08-19T17:29:56Z"
  },
  {
    "title": "20 states and D.C. sue DOJ to stop immigration conditions on funds for crime victims",
    "description": "A coalition of attorneys general is asking a federal judge to stop the Department of Justice from withholding federal funds earmarked for crime victims if states don't cooperate with immigration enforcement efforts.",
    "link": "https://www.pbs.org/newshour/politics/20-states-and-d-c-sue-doj-to-stop-immigration-conditions-on-funds-for-crime-victims",
    "timestamp": "2025-08-19T17:29:01Z"
  },
  {
    "title": "White House Says UK Abandons Effort to Access Apple User Data",
    "description": "The United States said the United Kingdom will end its effort to access U.S. Apple users’ encrypted data. [contact-form-7] Tulsi Gabbard, U.S. director of national intelligence, said in a post on social platform X Monday (Aug. 18) that she, President Donald T…",
    "link": "http://www.pymnts.com/data/2025/white-house-says-united-kingdom-abandons-effort-access-apple-user-data/",
    "timestamp": "2025-08-19T17:27:15Z"
  },
  {
    "title": "Great moments in gerontocracy",
    "description": "Eleanor Holmes Norton, Washington D.C.’s non-voting congressional representative, is pretty much MIA as Donald Trump engages in a little not so light fascism against the city she is supposed to be representing: Washington’s locally elected government is under…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/great-moments-in-gerontocracy",
    "timestamp": "2025-08-19T17:27:02Z"
  },
  {
    "title": "Transgender lawmaker says Democratic Party doesn't know how to respond to anti-trans attacks",
    "description": "Rep. Sarah McBride, D-Del., a transgender lawmaker, said the Democratic Party didn't know how to respond or engage on transgender issues during an interview with Jaime Harrison.",
    "link": "https://www.foxnews.com/media/transgender-lawmaker-says-democratic-party-doesnt-know-how-respond-anti-trans-attacks",
    "timestamp": "2025-08-19T17:26:48Z"
  },
  {
    "title": "Finance industry bodies call for changes to crypto rules for banks",
    "description": "A group of finance industry bodies is calling for a rethink on looming regulatory standards that they say will make it difficult for banks to participate in crypto markets.The Basel Committee on Banking Supervision, which comprises regulators and central bank…",
    "link": "https://www.channelnewsasia.com/business/finance-industry-bodies-call-changes-crypto-rules-banks-5303111",
    "timestamp": "2025-08-19T17:24:22Z"
  },
  {
    "title": "Trump's Reset With Zelensky Triggers Warning From MAGA",
    "description": "The president's sudden openness to offering NATO-style security guarantees to Ukraine has drawn a sharp rebuke from his hardcore allies.",
    "link": "https://www.newsweek.com/trumps-reset-zelensky-triggers-warning-maga-2115822",
    "timestamp": "2025-08-19T17:24:07Z"
  },
  {
    "title": "Trump Fans on CNN Draw Smiles With Pro-Trump Spin on Hot Mic Moment",
    "description": "Trump defenders drew smiles on CNN with their pro-Trump takes on Trump's hot mic moment during a White House event with world leaders.\nThe post Trump Fans on CNN Draw Smiles With Pro-Trump Spin on Hot Mic Moment first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-fans-on-cnn-draw-smiles-with-pro-trump-spin-on-hot-mic-moment/",
    "timestamp": "2025-08-19T17:23:49Z"
  },
  {
    "title": "Zelensky Thanks Melania Trump for Supporting Abducted Ukrainian Children",
    "description": "Ukrainian President Volodymyr Zelensky on Tuesday thanked First Lady Melania Trump for “her attention to one of the most painful and difficult issues of this war — the abduction of Ukrainian children by Russia.”\nThe post Zelensky Thanks Melania Trump for Supp…",
    "link": "https://www.breitbart.com/politics/2025/08/19/zelensky-thanks-melania-trump-for-supporting-abducted-ukrainian-children/",
    "timestamp": "2025-08-19T17:23:36Z"
  },
  {
    "title": "Republicans Keep Falling For Gavin Newsom’s Trump Trap",
    "description": "The reaction to the California governor's pitch-perfect parody of Trump is shining a light on the absurd behavior of the president of the United States.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-trump_n_68a4a033e4b0c2c76f851c00",
    "timestamp": "2025-08-19T17:23:32Z"
  },
  {
    "title": "Laken Riley's mother and stepfather strongly endorse House Republican vying for US Senate seat",
    "description": "Laken Riley's mother and stepfather endorsed Rep. Mike Collins as the House Republican runs for a U.S. Senate seat in the state of Georgia",
    "link": "https://www.foxnews.com/politics/laken-rileys-mother-stepfather-strongly-endorse-house-republican-vying-u-s-senate-seat",
    "timestamp": "2025-08-19T17:23:10Z"
  },
  {
    "title": "Finance industry bodies call for changes to crypto rules for banks",
    "description": "(Reuters) -A group of finance industry bodies is calling for a rethink on looming regulatory standards that they say will make it difficult for banks to...",
    "link": "https://finance.yahoo.com/news/finance-industry-bodies-call-changes-172305480.html",
    "timestamp": "2025-08-19T17:23:05Z"
  },
  {
    "title": "Former US Attorney Catherine Hanaway appointed as Missouri’s next attorney general",
    "description": "Hanaway has deep roots in Missouri politics and extensive ties as a private practice attorney to corporate clients that will cause her to recuse from some cases as attorney general.",
    "link": "https://indianexpress.com/article/world/former-us-attorney-catherine-hanaway-appointed-as-missouris-next-attorney-general-10199386/",
    "timestamp": "2025-08-19T17:23:01Z"
  },
  {
    "title": "Gavin Newsom’s Social Feed Shows a Democrat Can Troll Like Trump — And Expose Double Standards",
    "description": "Gavin Newsom’s caps-lock social posts parody Trump, exposing a decade-long double standard while flipping the narrative war in Democrats’ favor.\nThe post Gavin Newsom’s Social Feed Shows a Democrat Can Troll Like Trump — And Expose Double Standards first appe…",
    "link": "https://www.mediaite.com/opinion/gavin-newsoms-social-feed-shows-a-democrat-can-troll-like-trump-and-expose-double-standards/",
    "timestamp": "2025-08-19T17:21:43Z"
  },
  {
    "title": "Air Force’s top uniformed officer is retiring early in latest Trump military shake-up",
    "description": "WASHINGTON (AP) — The Air Force’s top uniformed officer is set to retire early in the most recent shake-up of military leadership during President Donald Trump’s second term.Gen. David Allvin will continue serving as the service’s chief of staff until a repla…",
    "link": "https://freerepublic.com/focus/f-chat/4335470/posts",
    "timestamp": "2025-08-19T17:21:42Z"
  },
  {
    "title": "ED Clamps Down on Student Voting Work",
    "description": "The Department of Education released guidance Tuesday discouraging colleges from using Federal Work-Study funds to pay students to work on voter registration efforts and other activities it deems political.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/08/19/ed-clamps-down-student-voting-work",
    "timestamp": "2025-08-19T17:21:27Z"
  },
  {
    "title": "Judges: Threatened for ruling against Trump",
    "description": "Threats against federal judges across the U.S. have surged since Donald Trump took office",
    "link": "https://theweek.com/politics/judges-threatened-ruling-against-trump",
    "timestamp": "2025-08-19T17:20:51Z"
  },
  {
    "title": "The census: Why Trump wants a new one",
    "description": "Donald Trump is pushing for a 'Trumpified census' that excludes undocumented immigrants",
    "link": "https://theweek.com/politics/census-trump-wants-new-one",
    "timestamp": "2025-08-19T17:19:13Z"
  },
  {
    "title": "A Fox News and a Pro-MAGA Reporter Dominated Trump-Zelensky Presser, Taking Up 62% of the Event",
    "description": "Fox News’s Peter Doocy and Real America’s Voice’s Brian Glenn, Rep. Marjorie Taylor Greene’s (R-GA) boyfriend, dominated the other reporters in the Oval Office.\nThe post A Fox News and a Pro-MAGA Reporter Dominated Trump-Zelensky Presser, Taking Up 62% of the…",
    "link": "https://www.mediaite.com/analysis/a-fox-news-and-a-pro-maga-reporter-dominated-trump-zelensky-presser-taking-up-62-of-the-event/",
    "timestamp": "2025-08-19T17:18:54Z"
  },
  {
    "title": "Voting Rights Act: Dying a slow death",
    "description": "60 years after it was signed into law, the Voting Rights Act is being gutted by Republicans and the Supreme Court",
    "link": "https://theweek.com/politics/voting-rights-act-dying-supreme-court",
    "timestamp": "2025-08-19T17:18:03Z"
  },
  {
    "title": "Former US Attorney Catherine Hanaway appointed as Missouri's next attorney general",
    "description": "Former U.S. Attorney Catherine Hanaway has been appointed as Missouri's next attorney general",
    "link": "https://abcnews.go.com/Business/wireStory/former-us-attorney-catherine-hanaway-appointed-missouris-attorney-124783809",
    "timestamp": "2025-08-19T17:17:54Z"
  },
  {
    "title": "NATO Secretary General Says Trump ‘Was Right’ To Criticize Alliance",
    "description": "By Hailey Gomez, Daily Caller News Foundation | August 18, 2025\nNATO Secretary General Mark Rutte said Monday on Fox News’ “The Ingraham Angle” that President Donald Trump’s initial criticism of the intergovernmental organization “was right.”\nTrump on Monday …",
    "link": "https://biztoc.com/x/7702172ee8978558",
    "timestamp": "2025-08-19T17:17:23Z"
  },
  {
    "title": "Trump's Plans for Intel Take a Page From Bernie Sanders' Playbook",
    "description": "President Trump is not the first politician to demand the federal government take partial control of advanced computer chip manufacturers.",
    "link": "https://reason.com/2025/08/19/trumps-plans-for-intel-take-a-page-from-bernie-sanders-playbook/",
    "timestamp": "2025-08-19T17:16:25Z"
  },
  {
    "title": "Will Crypto Get Its Long-Awaited Market Structure Bill? Tim Scott Says Vote Could Be Close",
    "description": "Elizabeth Warren’s protests against the bill could lead to fewer Democrats supporting it than the GENIUS Act, Senate Banking Chair Tim Scott said.",
    "link": "https://decrypt.co/335833/will-crypto-get-long-awaited-market-structure-bill-tim-scott-says-vote-close",
    "timestamp": "2025-08-19T17:16:22Z"
  },
  {
    "title": "Trump says Putin may not want to make a deal on Ukraine",
    "description": "Summary Trump: will gauge Putin's actions over next two weeks Trump: Putin faces 'rough situation' if no deal on Ukraine Zelenskiy hails summit with Trump as a step towards peace Russia launches largest attack this month amid peace talks Uncertainty over U.S.…",
    "link": "https://freerepublic.com/focus/f-news/4335469/posts",
    "timestamp": "2025-08-19T17:16:16Z"
  },
  {
    "title": "Justice Department investigating D.C. police over alleged fake crime data (Washington Post)",
    "description": "Washington Post:\nJustice Department investigating D.C. police over alleged fake crime data  —  President Donald Trump confirmed the existence of the probe on social media, saying the city is “under serious investigation.”  —  The Justice Department is investi…",
    "link": "https://www.memeorandum.com/250819/p64",
    "timestamp": "2025-08-19T17:15:00Z"
  },
  {
    "title": "Watch Live: Karoline Leavitt Holds White House Press Briefing",
    "description": "Trump Press Secretary Karoline Leavitt speaks to reporters at the White House on Tuesday, August 19.\nThe post Watch Live: Karoline Leavitt Holds White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/19/watch-live-karoline-leavitt-holds-white-house-press-briefing-26/",
    "timestamp": "2025-08-19T17:14:48Z"
  },
  {
    "title": "Washington on notice by for \"sanctuary polices,\" Gov. Ferguson to respond",
    "description": "Washington state is on notice by the federal government for being a so-called sanctuary jurisdiction and Gov. Bob Ferguson is expected to give a detailed respon",
    "link": "https://komonews.com/news/local/washington-on-notice-by-for-sanctuary-polices-gov-ferguson-to-respond-ag-bondi",
    "timestamp": "2025-08-19T17:14:42Z"
  },
  {
    "title": "Trump’s Ed Dept Puts A Stop To Federally Funded Political Activism At Universities",
    "description": "The Department of Education (ED) announced on Tuesday that it is ending the taxpayer funding of political activism jobs on college campuses. The department is rescinding the Biden-era guidance that allowed the Federal Work Study (FWS) program, which provides …",
    "link": "https://freerepublic.com/focus/f-bloggers/4335468/posts",
    "timestamp": "2025-08-19T17:13:29Z"
  },
  {
    "title": "Exiled Russian Journalist Tells Fox News’ Will Cain That Trump Is ‘Speaking in Putin’s Narratives’",
    "description": "An exiled Russian journalist said he believes Donald Trump is \"speaking\" in Putin's \"narratives\" when he discusses a peace deal between Russia and Ukraine.\nThe post Exiled Russian Journalist Tells Fox News’ Will Cain That Trump Is ‘Speaking in Putin’s Narrati…",
    "link": "https://www.mediaite.com/media/tv/exiled-russian-journalist-tells-fox-news-will-cain-that-trump-is-speaking-in-putins-narratives/",
    "timestamp": "2025-08-19T17:10:57Z"
  },
  {
    "title": "Ukraine's Zelensky Gifts Trump a Golf Putter from Ukrainian Soldier Amputee",
    "description": "Volodymyr Zelensky gifted President Donald Trump with a golf putter from a Ukrainian soldier who lost his right leg in battle.\nThe post Ukraine’s Zelensky Gifts Trump a Golf Putter from Ukrainian Soldier Amputee appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/08/19/ukraines-zelensky-gifts-trump-a-golf-putter-from-ukrainian-soldier-amputee/",
    "timestamp": "2025-08-19T17:10:57Z"
  },
  {
    "title": "Shocking: The Trump Administration Grabs the Third Rail With Both Hands",
    "description": "June Hopkins, Henry Scott Wallace, James Roosevelt Jr.\n\n\n\nOur grandparents would urge us all to defend and strengthen Social Security.\r\n\n\r\n\n\nThe post Shocking: The Trump Administration Grabs the Third Rail With Both Hands appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/social-security-trump-new-deal/",
    "timestamp": "2025-08-19T17:10:02Z"
  },
  {
    "title": "How a Ukrainian designer helped Zelenskiy dress for Trump diplomacy",
    "description": "KYIV (Reuters) -When Ukrainian designer Viktor Anisimov showed Volodymyr Zelenskiy a new black suit last Friday, it included a small detail. A back vent on the back inched it closer to a civilian suit, compared to the military outfits the president has favour…",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/how-a-ukrainian-designer-helped-zelenskiy-dress-for-trump-diplomacy",
    "timestamp": "2025-08-19T17:09:00Z"
  },
  {
    "title": "India, China to back each other’s BRICS Summits in 2026 and 2027 even as Trump targets bloc with impending tariffs",
    "description": "India and China have agreed to support one another in hosting the BRICS Summits of 2026 and 2027, signalling a thaw in ties strained since the 2020 Galwan clashes. The announcement followed Chinese Foreign Minister Wang Yi’s two-day visit to New Delhi, where …",
    "link": "https://economictimes.indiatimes.com/news/india/india-china-to-back-each-others-brics-summits-in-2026-and-2027-even-as-trump-targets-bloc-with-impending-tariffs/articleshow/123392028.cms",
    "timestamp": "2025-08-19T17:08:31Z"
  },
  {
    "title": "Explainer-Does Trump have the power to ban mail-in ballots in U.S. elections?",
    "description": "(Reuters) -U.S. President Donald Trump wants to ban mail-in ballots in federal elections, a form of voting popular with many Americans. About three in 10 ballots were cast through the mail in the 2024 general election, according to the U.S. Election Assistanc…",
    "link": "https://www.thestar.com.my/news/world/2025/08/20/explainer-does-trump-have-the-power-to-ban-mail-in-ballots-in-us-elections",
    "timestamp": "2025-08-19T17:08:00Z"
  },
  {
    "title": "Why Oval Office map has played crucial role in Trump's view of Ukraine war",
    "description": "Ukraine's leader has taken issue with the American map, because of the amount of control it gives Russia.",
    "link": "https://www.bbc.com/news/articles/cjeynw8jppdo",
    "timestamp": "2025-08-19T17:06:59Z"
  },
  {
    "title": "The red state push to join the DC occupation",
    "description": "President Donald Trump has made it clear that he hopes to export his unprecedented military occupation of Washington, D.C., to other Democrat-led cities across the country. But even as the administration prepares to expand its D.C.-incubated federal takeover …",
    "link": "https://biztoc.com/x/561af48b3ad31ff5",
    "timestamp": "2025-08-19T17:06:23Z"
  },
  {
    "title": "Gavin Newsom wants an election in a hurry on his gerrymander. Here’s what has to happen",
    "description": "California voting officials are scrambling behind the scenes to prepare for the special election Gov. Gavin Newsom wants this November on his proposal to redraw the state’s congressional districts.",
    "link": "https://www.ktvu.com/news/gavin-newsom-wants-election-hurry-his-gerrymander-heres-what-has-happen",
    "timestamp": "2025-08-19T17:06:01Z"
  },
  {
    "title": "U.S. Treasury Chief Bessent Accuses India of Profiteering on Russian Oil Purchases",
    "description": "WASHINGTON, Aug 19 (Reuters) – U.S. Treasury Secretary Scott Bessent on Tuesday accused India of profiteering from its sharply increased purchases of Russian oil during the war in Ukraine, saying Washington viewed the situation as unacceptable. Bessent told...",
    "link": "https://gcaptain.com/u-s-treasury-chief-bessent-accuses-india-of-profiteering-on-russian-oil-purchases/",
    "timestamp": "2025-08-19T17:05:58Z"
  },
  {
    "title": "Fewer will qualify for student loan forgiveness under proposed new guidelines; will sanctuary jurisdictions be disqualified?",
    "description": "Proposed changes to the Public Service Loan Forgiveness program published Monday would revoke eligibility for borrowers working for nonprofit and government organizations deemed to have a “substantial illegal purpose,” a term with a broad definition.",
    "link": "https://www.abajournal.com/news/article/fewer-will-qualify-for-student-loan-forgiveness-under-proposed-new-guidelines-will-sanctuary-jurisdictions-be-punished",
    "timestamp": "2025-08-19T17:05:00Z"
  },
  {
    "title": "U.S. Deploys Warships Near Venezuela to Combat Drug Threats",
    "description": "Three U.S. Aegis guided-missile destroyers will arrive off the coast of Venezuela in the next 36 hours as part of an effort to address threats from Latin American drug cartels, two sources briefed on the matter said on Monday.",
    "link": "https://gcaptain.com/u-s-deploys-warships-near-venezuela-to-combat-drug-threats/",
    "timestamp": "2025-08-19T17:04:49Z"
  },
  {
    "title": "'We’re going to get blamed': Jittery Trump official tries to pass buck in fear of pushback",
    "description": "Chris Wright, a former oil tycoon who serves as President Donald Trump’s energy secretary, admitted to what he characterized as a major electoral liability for Republicans — but pointed the finger at “Obama-Biden policies” anyway.That liability, Wright said, …",
    "link": "https://www.rawstory.com/trump-2673901020/",
    "timestamp": "2025-08-19T17:04:22Z"
  },
  {
    "title": "Uh-Oh! Are The Trump Tariffs Canceling Boobs?",
    "description": "A whole lot of American women can only wear European bras, and the tariffs are going to make them pretty expensive and hard to come by.",
    "link": "https://www.wonkette.com/p/uh-oh-are-the-trump-tariffs-canceling",
    "timestamp": "2025-08-19T17:03:21Z"
  },
  {
    "title": "'President of peace': Trump tapped for Nobel Prize amid talks to end Russia-Ukraine war",
    "description": "House GOP representatives nominate Donald Trump for Nobel Peace Prize, citing his efforts to end the Russia-Ukraine war and other diplomatic achievements.",
    "link": "https://www.foxnews.com/politics/president-peace-trump-tapped-nobel-prize-amid-talks-end-russia-ukraine-war",
    "timestamp": "2025-08-19T17:00:59Z"
  },
  {
    "title": "The red state push to join the DC occupation",
    "description": "Republican governors are increasingly eager to volunteer their state's National Guard troops for Trump's ostensibly anti-crime siege of the nation's capital",
    "link": "https://theweek.com/politics/red-state-governors-dc-national-guard-trump",
    "timestamp": "2025-08-19T17:00:18Z"
  },
  {
    "title": "“Law and Order” President Trump Just Forced a Cop to Self-Deport",
    "description": "The Department of Homeland Security blamed local officials in Maine for using the department’s federal database to determine the employment eligibility of a police officer who was arrested by Immigration and Customs Enforcement last month, according to NBC Ne…",
    "link": "https://newrepublic.com/post/199267/donald-trump-maine-police-officer-self-deport",
    "timestamp": "2025-08-19T17:00:04Z"
  },
  {
    "title": "Report: Israel Rejects Hamas’ Partial Hostage Deal, Wants Release of All Captives",
    "description": "\"Israel remains consistent in its policy and demands the release of all 50 hostages.\"\nThe post Report: Israel Rejects Hamas’ Partial Hostage Deal, Wants Release of All Captives first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/report-israel-rejects-hamas-partial-hostage-deal-wants-release-of-all-captives/",
    "timestamp": "2025-08-19T17:00:01Z"
  },
  {
    "title": "'There is a High Likelihood She Could Be Killed': Fears Erupt Ghislaine Maxwell is a DEAD WOMAN WALKING Inside Texas 'Club Fed' — After Two Alleged Attempted Break-ins Aimed at Epstein's Convicted Madam",
    "description": "The convicted sex offender was transferred to the minimum-security prison camp after meeting with the deputy attorney general over two days.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-bryan-prison-camp-fears-life-attempted-break-in-gang-related-shooting/",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Trump Seeks Nobel Peace Prize With Two Diplomatic Deals",
    "description": "Barack Obama has one. So do Theodore Roosevelt, Woodrow Wilson, and Jimmy Carter. And it seems abundantly clear that Donald Trump is bucking for one too – a Nobel Peace Prize awarded to a sitting US president. Trump has gone on a peace-making offensive over t…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Seeks-Nobel-Peace-Prize-With-Two-Diplomatic-Deals.html",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Gaza and the Government: How to ‘grow a spine’ – Simon Wilson",
    "description": "OPINION: Even the horrors of war haven't stopped the Act tail wagging the Government dog.",
    "link": "https://www.nzherald.co.nz/nz/gaza-and-the-government-how-to-grow-a-spine-simon-wilson/F52X7FYXK5CELC7LWZPHDPO7RU/",
    "timestamp": "2025-08-19T17:00:00Z"
  },
  {
    "title": "Rock Star Gives Brutal, Unexpected Take On Trump-Zelenskyy Meeting",
    "description": "The Rock and Roll Hall of Fame-bound singer just put the president on blast.",
    "link": "https://www.huffpost.com/entry/jack-white-trump-zelenskyy-meeting_n_68a48786e4b00feff7d12b4b",
    "timestamp": "2025-08-19T16:58:59Z"
  },
  {
    "title": "World leader softens up Trump with a gift he’s sure to love",
    "description": "Could this butter up the president?",
    "link": "https://www.nj.com/politics/2025/08/world-leader-softens-up-trump-with-a-gift-hes-sure-to-love.html",
    "timestamp": "2025-08-19T16:56:25Z"
  },
  {
    "title": "Map Shows States Where Mail-in Voting Is Most—and Least—Popular",
    "description": "Donald Trump on Monday announced that lawyers are preparing an executive order aimed at eliminating mail-in voting.",
    "link": "https://biztoc.com/x/d80ceacbaac221c4",
    "timestamp": "2025-08-19T16:55:02Z"
  },
  {
    "title": "As GOP governors deploy National Guard to D.C., they have the underlying policy backwards",
    "description": "At Donald Trump's behest, six Republican governors are sending Guard troops to Washington, D.C., though crime rates are actually higher in their own states.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/national-guard-troops-dc-states-rcna225859",
    "timestamp": "2025-08-19T16:55:01Z"
  },
  {
    "title": "Head of DOJ anti weaponization group calls on NY AG Letitia James to resign",
    "description": "Head of DOJ anti weaponization group calls on NY AG Letitia James to resigngo.com",
    "link": "https://abcnews.go.com/US/head-doj-anti-weaponization-group-calls-ny-ag/story?id=124780652",
    "timestamp": "2025-08-19T16:53:46Z"
  },
  {
    "title": "The first openly gay men's tennis player wants to make the sport more welcoming to queer athletes",
    "description": "As this year’s U.S. Open kicks off, USTA President Brian Vahaly, a former top-100 player, opens up about his coming-out journey and his approach to being an LGBTQ leader in sports.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/brian-vahaly-tennis-us-open-first-openly-gay-mens-player-safe-space-rcna225592",
    "timestamp": "2025-08-19T16:52:52Z"
  },
  {
    "title": "James Talarico's Chances of Beating Colin Allred in Texas Primary—Poll",
    "description": "A new poll showed that Allred could face a competitive primary if other Democrats jump into the Senate race.",
    "link": "https://www.newsweek.com/james-talarico-colin-allred-texas-primary-poll-2115792",
    "timestamp": "2025-08-19T16:47:56Z"
  },
  {
    "title": "Justice Department to begin giving Congress files from Jeffrey Epstein investigation, Comer says",
    "description": "It was not clear exactly which or how many documents might be produced or whether the FBI's cooperation with Congress reflected a broader change in posture.",
    "link": "https://www.pbs.org/newshour/politics/justice-department-to-begin-giving-congress-files-from-jeffrey-epstein-investigation-comer-says",
    "timestamp": "2025-08-19T16:47:19Z"
  },
  {
    "title": "Map Shows States Where Mail-in Voting Is Most—and Least—Popular",
    "description": "Donald Trump on Monday announced that lawyers are preparing an executive order aimed at eliminating mail-in voting.",
    "link": "https://www.newsweek.com/mail-ballots-state-map-trump-2115729",
    "timestamp": "2025-08-19T16:46:31Z"
  }
]