[
  {
    "title": "Greenspan, Bernanke and Yellen urge Supreme Court to let Lisa Cook keep her job as a Fed governor",
    "description": "Alan Greenspan, Ben Bernanke, Janet Yellen and other former top economic officials appointed by presidents of both parties are urging the Supreme Court to preserve the Federal Reserve’s political independence and allow Lisa Cook to remain as a central ...",
    "link": "https://abcnews.go.com/Business/wireStory/greenspan-bernanke-yellen-urge-supreme-court-lisa-cook-125935031",
    "timestamp": "2025-09-25T16:22:58Z"
  },
  {
    "title": "Dave Portnoy Still Doesn't Get It",
    "description": "It took a few days, but after the Jimmy Kimmel suspension, not only did several prominent Republicans like Ted Cruz and Ben Shapiro take Kimmel's side (with obvious reservations about his politics), but even most of the manosphere sided against...\nRead more...",
    "link": "https://www.pajiba.com/news/barstool-host-blast-his-own-boss-dave-portnoy-over-kimmel-situation.php",
    "timestamp": "2025-09-25T16:22:48Z"
  },
  {
    "title": "Bipartisan group of top officials urges Court to reject Trump's effort to fire Fed governor",
    "description": "A bipartisan group of former Federal Reserve chairs, Treasury secretaries, and top White House economists urged the Supreme Court Thursday to reject an attempt by President Donald Trump to fire Federal Reserve governor Lisa Cook",
    "link": "https://abcnews.go.com/Business/wireStory/bipartisan-group-top-officials-urges-court-reject-trumps-125935027",
    "timestamp": "2025-09-25T16:22:46Z"
  },
  {
    "title": "Jimmy Fallon Gleefully Rides Donald Trump Over Escalator Snafu",
    "description": "Jimmy Fallon Gleefully Rides Donald Trump Over Escalator Snafuhuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-donald-trump-escalator_n_68d55917e4b01e99f72de081",
    "timestamp": "2025-09-25T16:22:45Z"
  },
  {
    "title": "US Intel Leads To Capture Of Cartel-Linked Baby Trafficking, Organ Harvesting Ringleader",
    "description": "U.S. intelligence helped bring an alleged female ringleader of a cartel-linked baby trafficking and organ harvesting network, officials announced Wednesday.",
    "link": "https://dailycaller.com/2025/09/25/us-intel-leads-to-capture-of-cartel-linked-baby-trafficking-organ-harvesting-ringleader/",
    "timestamp": "2025-09-25T16:22:33Z"
  },
  {
    "title": "US to block FIFA’s ban of Israel from 2026 World Cup",
    "description": "The United States government will try to prevent any attempt to ban Israel from competing at the 2026 World Cup.",
    "link": "https://www.101greatgoals.com/football/internationals/us-block-fifa-ban-israel-2026-world-cup/",
    "timestamp": "2025-09-25T16:21:48Z"
  },
  {
    "title": "MAGA Official Behind Trump Bibles in Schools Quits to Join Bigger War",
    "description": "Ryan Walters, responsible for a years-long campaign to suffuse Oklahoma public schools with Christian nationalist and right-wing messages, is out as the state’s education superintendent and headed for the private sector.Speaking on Fox News late Wednesday, Wa…",
    "link": "https://newrepublic.com/post/200933/maga-official-trump-bibles-schools-quits-teachers-unions",
    "timestamp": "2025-09-25T16:21:20Z"
  },
  {
    "title": "Trump didn't tell the UN that 'it burns when I pee'",
    "description": "During an address to the United Nations General Assembly, U.S. President Donald Trump said, \"It burns when I pee.\"",
    "link": "https://www.snopes.com//fact-check/trump-it-burns-when-i-pee/",
    "timestamp": "2025-09-25T16:20:00Z"
  },
  {
    "title": "Poll Shows Rising White-Collar Opposition to Huge H-1B Foreign Worker Program",
    "description": "A poll of white-collar professionals shows that 56 percent of U.S. citizens say the huge H-1B visa-worker program is skewing the labor market and transferring their jobs to foreign migrants.\nThe post Poll Shows Rising White-Collar Opposition to Huge H-1B Fore…",
    "link": "https://www.breitbart.com/immigration/2025/09/25/poll-shows-rising-white-collar-opposition-to-huge-h-1b-foreign-worker-program/",
    "timestamp": "2025-09-25T16:18:08Z"
  },
  {
    "title": "Ryan Walters resigns as Oklahoma’s top public schools official to lead conservative educators’ group",
    "description": "Walters has been involved in several controversial initiatives, including promoting religion in classrooms and requiring teachers to pass ideology exams.",
    "link": "https://www.pbs.org/newshour/politics/ryan-walters-resigns-as-oklahomas-top-public-schools-official-to-lead-conservative-educators-group",
    "timestamp": "2025-09-25T16:17:07Z"
  },
  {
    "title": "Viktor Hovland’s great pursuits: A perfect golf swing and the truth about UFOs",
    "description": "Practicing on the driving range two days before the Ryder Cup begins Friday, the 28-year-old Norwegian said he suddenly felt freed up. “Obviously this is a golf course that you have to drive it really well, and I've been kind of struggling with the driver,” H…",
    "link": "https://sports.yahoo.com/article/viktor-hovland-great-pursuits-perfect-161655863.html",
    "timestamp": "2025-09-25T16:16:55Z"
  },
  {
    "title": "Deadly Shooting at Dallas ICE Hub Was ‘Targeted,’ FBI Say",
    "description": "A shooting at an Immigration and Customs Enforcement center in Dallas left one detainee dead and two others critically injured in what federal officials described as a “targeted attack” against the agency. Federal Bureau of Investigation Director Kash Patel t…",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/09/25/840604.htm",
    "timestamp": "2025-09-25T16:16:17Z"
  },
  {
    "title": "Palestinian president says ready to work with Trump for two-state peace plan",
    "description": "In a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.",
    "link": "https://www.bbc.com/news/articles/czdjgdnjnlgo",
    "timestamp": "2025-09-25T16:15:14Z"
  },
  {
    "title": "Democrat Senator Says His Party Should Not Tone Down Rhetoric Against ICE Agents After Shooting",
    "description": "Democratic Connecticut Sen. Chris Murphy said on Thursday that his party should continue condemning ICE even after the shooting at a facility in Dallas, Texas.",
    "link": "https://dailycaller.com/2025/09/25/chris-murphy-rhetoric-ice-shooting/",
    "timestamp": "2025-09-25T16:15:05Z"
  },
  {
    "title": "Ukraine Pitches First Energy Projects Under US Resources Pact",
    "description": "Ukraine’s biggest oil and gas company is pitching several projects that could be among the first under a resource deal with the US to shore up its wartime economy and help secure support from President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-pitches-first-energy-projects-under-us-resources-pact",
    "timestamp": "2025-09-25T16:15:00Z"
  },
  {
    "title": "Stephen Miller Claims Simply Calling Trump Authoritarian 'Incites Violence and Terrorism'",
    "description": "Stephen Miller, the White House's deputy chief of staff, signaled how far he is willing to go to criminalize dissent against President Donald Trump in a social media post on Wednesday in which he implied that merely describing the president's actions as \"auth…",
    "link": "https://www.commondreams.org/news/miller-says-criticism-of-trump-is-violence",
    "timestamp": "2025-09-25T16:14:49Z"
  },
  {
    "title": "Fox News Host Says Trump Made Jimmy Kimmel ‘Unfireable’ Even If ‘Three People Are Watching’",
    "description": "Fox News host Jessica Tarlov argued President Donald Trump has essentially made Jimmy Kimmel \"unfireable\" following the late night comedian's suspension.\nThe post Fox News Host Says Trump Made Jimmy Kimmel ‘Unfireable’ Even If ‘Three People Are Watching’ firs…",
    "link": "https://www.mediaite.com/media/tv/fox-news-host-says-trump-made-jimmy-kimmel-unfireable-even-if-three-people-are-watching/",
    "timestamp": "2025-09-25T16:14:29Z"
  },
  {
    "title": "Disney shareholders demand company turn over documents related to Jimmy Kimmel suspension: report",
    "description": "American Federation of Teachers, Reporters Without Borders and other groups pressed Disney to release board records surrounding Kimmel’s suspension.",
    "link": "https://nypost.com/2025/09/25/business/disney-shareholders-demand-company-documents-on-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-25T16:13:20Z"
  },
  {
    "title": "DeChambeau yearns to face McIlroy, sees Trump as Cup force",
    "description": "Bryson DeChambeau sees President Donald Trump as a motivational force for United States golfers in the 45th Ryder Cup at Bethpage Black, where he longs to face Europe's Rory McIlroy.There has been verbal sparring between DeChambeau and McIlroy since the Maste…",
    "link": "https://sports.yahoo.com/article/dechambeau-yearns-face-mcilroy-sees-161245251.html",
    "timestamp": "2025-09-25T16:12:45Z"
  },
  {
    "title": "Trump: I am very disappointed in Putin",
    "description": "United States President Donald Trump expressed on Thursday his disappointment with Russian President Vladimir Putin, regarding the lack of progress toward resolving the war in Ukraine.\"With all of the...",
    "link": "https://biztoc.com/x/40edb011351d6c7f",
    "timestamp": "2025-09-25T16:11:53Z"
  },
  {
    "title": "Trump teases 'major announcement' on Syria today",
    "description": "United States President Donald Trump revealed that there would be a \"major announcement\" regarding Syria today, during his meeting with Turkish President Recep Tayyip Erdogan at the White House on Thu...",
    "link": "https://biztoc.com/x/ba6c52616e41fb83",
    "timestamp": "2025-09-25T16:11:52Z"
  },
  {
    "title": "Trump blames 'radical left' for ICE facility shooting",
    "description": "United States President Donald Trump said on Thursday that the \"radical left\" was to blame for the recent deadly shooting at the Dallas Immigration and Customs Enforcement (ICE) field office and simil...",
    "link": "https://biztoc.com/x/9f7b967ff2f746a7",
    "timestamp": "2025-09-25T16:11:45Z"
  },
  {
    "title": "DNC holds onto decades-old Jeffrey Epstein donations after other Dems returned theirs",
    "description": "The Democratic National Committee retained decades-old donations totaling $32,000 from Jeffrey Epstein, unlike other Democratic people and entities who chose to return them.",
    "link": "https://www.foxnews.com/politics/hold-dnc-holds-onto-decades-old-jeffrey-epstein-donations-after-other-democrats-returned-theirs",
    "timestamp": "2025-09-25T16:11:42Z"
  },
  {
    "title": "Trump Welcomes Turkey's Erdogan to White House",
    "description": "Turkish President Recep Tayyip Erdogan is set to visit the White House for the first time in six years, bringing a slate of deals aimed at repairing the fractious ties between the two members of the North Atlantic Treaty Organization.\nThursday’s meeting with …",
    "link": "https://biztoc.com/x/e6ed469430a72af5",
    "timestamp": "2025-09-25T16:11:29Z"
  },
  {
    "title": "Former Fed chairs warn that removing Lisa Cook could lead to inflation boom",
    "description": "A group of the country's top economic leaders, including every living former Federal Reserve chair, filed an amicus brief with the Supreme Court on Thursday in support of Fed governor Lisa Cook, who President Donald Trump is seeking to remove",
    "link": "https://biztoc.com/x/413d798beb3d96cb",
    "timestamp": "2025-09-25T16:11:29Z"
  },
  {
    "title": "Jeffrey Goldberg Wins 2025 John Chancellor Award from Columbia Journalism School",
    "description": "The Chancellor Award is presented to a journalist for their cumulative accomplishments",
    "link": "https://www.theatlantic.com/press-releases/archive/2025/09/jeffrey-goldberg-wins-2025-john-chancellor-award/684364/",
    "timestamp": "2025-09-25T16:10:44Z"
  },
  {
    "title": "White House dares Democrats with nuclear response to looming shutdown",
    "description": "While Democrats continue to dig their heels in ahead of the looming deadline to avert a government shutdown, the White House has made clear that the administration is willing to go nuclear. The Office of Management and Budget, headed by Director Russell Vough…",
    "link": "https://www.theblaze.com/news/white-house-dares-democrats-with-nuclear-response-to-looming-shutdown",
    "timestamp": "2025-09-25T16:10:00Z"
  },
  {
    "title": "MAGA superintendent flees Fox interview as he's grilled on resignation",
    "description": "Oklahoma Superintendent of Public Instruction Ryan Walters fled Fox studios as a reporter tried to question him about his decision to resign.Anchor Wendy Suares said KOKH allowed Walters to use its studios to do an interview with Fox News on Thursday. In the …",
    "link": "https://www.rawstory.com/ryan-walters-2674039663/",
    "timestamp": "2025-09-25T16:09:32Z"
  },
  {
    "title": "Transcript: Kimmel Showed the Rest of the Media How to Fight Trump",
    "description": "The following is a lightly edited transcript of the September 24 episode ofRight Now With Perry Bacon. You can watch this interview here.Perry Bacon: Good morning, everybody. I’m Perry Bacon. I’m the host of the New Republic Show Right Now. I’m really excited…",
    "link": "https://newrepublic.com/article/200902/transcript-kimmel-showed-rest-media-fight-trump",
    "timestamp": "2025-09-25T16:07:28Z"
  },
  {
    "title": "Barack Obama to be conferred with freedom of Dublin at ceremony on Thursday",
    "description": "Proposal to grant honour to former US president and his wife Michelle was passed by council in 2017",
    "link": "https://www.irishtimes.com/ireland/dublin/2025/09/25/barack-obama-to-be-conferred-with-freedom-of-dublin-at-ceremony-on-thursday/",
    "timestamp": "2025-09-25T16:07:20Z"
  },
  {
    "title": "What we know about how a government shutdown would unfold",
    "description": "Prospects for a last-minute compromise look rather bleak.",
    "link": "https://www.bostonherald.com/2025/09/25/congress-shutdown-explained/",
    "timestamp": "2025-09-25T16:06:46Z"
  },
  {
    "title": "What we know about how a government shutdown would unfold",
    "description": "Prospects for a last-minute compromise look rather bleak.",
    "link": "https://www.denverpost.com/2025/09/25/congress-shutdown-explained/",
    "timestamp": "2025-09-25T16:06:46Z"
  },
  {
    "title": "Dr. Ben Carson Joins Trump Administration in Department of Agriculture Advisory Role",
    "description": "Dr. Ben Carson joined the second Trump administration on Wednesday in an advisory role at the Department of Agriculture.\nThe post Dr. Ben Carson Joins Trump Administration in Department of Agriculture Advisory Role appeared first on Breitbart.",
    "link": "https://www.breitbart.com/health/2025/09/25/dr-ben-carson-joins-trump-administration-department-agriculture-advisory-role/",
    "timestamp": "2025-09-25T16:05:32Z"
  },
  {
    "title": "FIFA, UEFA Under Pressure as Calls Grow to Exclude Israel From Global Soccer",
    "description": "UEFA is moving toward a vote on suspending Israel’s soccer federation, a decision that could block its national and club teams from international competitions.",
    "link": "https://www.israelnationalnews.com/news/415414",
    "timestamp": "2025-09-25T16:05:22Z"
  },
  {
    "title": "FBI: ICE Shooting Suspect Searched ‘Charlie Kirk Shot Video’",
    "description": "The initial investigation into Wednesday’s shooting at the immigration detention facility in Dallas reveals “a high degree of pre-attack planning,” according to FBI director Kash Patel.... Read More\nThe post FBI: ICE Shooting Suspect Searched ‘Charlie Kirk Sh…",
    "link": "https://www.dailysignal.com/2025/09/25/fbi-ice-shooting-suspect-searched-charlie-kirk-shot-video/",
    "timestamp": "2025-09-25T16:04:30Z"
  },
  {
    "title": "Prosecutors' memo to new US attorney advised against plans to charge Comey: Sources",
    "description": "In a memo this week, prosecutors in Virginia recommended against potential plans by the new U.S. attorney there to charge ex-FBI Director James Comey, sources say.",
    "link": "https://abcnews.go.com/US/prosecutors-memo-new-us-attorney-recommended-plans-charge/story?id=125925246",
    "timestamp": "2025-09-25T16:03:42Z"
  },
  {
    "title": "Democrats Submit Bill Aimed at Limiting GOP’s Mid-Census Gerrymandering Scheme",
    "description": "Several GOP-led states are hoping to mitigate midterm losses by redistricting their maps before the next census.",
    "link": "https://truthout.org/articles/democrats-submit-bill-aimed-at-limiting-gops-mid-census-gerrymandering-scheme/",
    "timestamp": "2025-09-25T16:03:15Z"
  },
  {
    "title": "Democrats double down on health care demands with government shutdown days away",
    "description": "Democratic leaders insist that any funding legislation must extend the ACA's enhanced tax credits, which are due to expire at the end of the year.",
    "link": "https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html",
    "timestamp": "2025-09-25T16:01:44Z"
  },
  {
    "title": "The 5 at 5: Thursday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-thursday-2509-6827158-Sep2025/",
    "timestamp": "2025-09-25T16:00:47Z"
  },
  {
    "title": "The View’s Joy Behar Says She ‘Agrees with Trump’ on Going After Comey",
    "description": "The View's Joy Behar said Thursday that she agrees with Donald Trump's decision to go after former FBI Director James Comey because she didn't like \"what he did to Hillary.\"\nThe post The View’s Joy Behar Says She ‘Agrees with Trump’ on Going After Comey first…",
    "link": "https://www.mediaite.com/media/news/the-views-joy-behar-says-she-agrees-with-trump-on-going-after-comey/",
    "timestamp": "2025-09-25T16:00:35Z"
  },
  {
    "title": "Amazon to pay $2.5bn to settle Prime allegations",
    "description": "Amazon.com will pay $2.5 billion in fines and payments to Prime subscribers to settle a Federal Trade Commission case alleging the retail juggernaut signed users up for the subscription without their consent, the FTC said today.",
    "link": "https://www.rte.ie/news/business/2025/0925/1535346-amazon-to-pay-2-5bn-to-settle-prime-allegations/",
    "timestamp": "2025-09-25T16:00:32Z"
  },
  {
    "title": "Trump: We're close to some kind of Gaza deal",
    "description": "United States President Donald Trump said on Thursday that he believes \"some kind of deal\" on the situation in Gaza is \"close.\"Trump expressed the optimistic stance following yesterday's meeting with ...",
    "link": "https://biztoc.com/x/a01b8f37148e5093",
    "timestamp": "2025-09-25T16:00:30Z"
  },
  {
    "title": "“After the Hunt” is a slippery study of our desire to wield power",
    "description": "In Luca Guadagnino’s timely drama, Julia Roberts is out for millennial blood at a steep cost.",
    "link": "https://www.salon.com/2025/09/25/after-the-hunt-is-a-slippery-study-of-our-desire-to-wield-power/",
    "timestamp": "2025-09-25T16:00:18Z"
  },
  {
    "title": "Trump: Could lift Turkey sanctions 'immediately'",
    "description": "United States President Donald Trump announced on Thursday that he could lift sanctions on Turkey \"almost immediately.\"More to come......",
    "link": "https://biztoc.com/x/79ff606bc8f93157",
    "timestamp": "2025-09-25T16:00:15Z"
  },
  {
    "title": "Number of Americans visiting Canada overtakes Canadians visiting USA!",
    "description": "Canadians taking trips to the US has dropped by around a third in reaction to heightened border checks, anti-tariff patriotism and the economic situation in Canada",
    "link": "https://www.themirror.com/news/us-news/canada-usa-trump-tourism-numbers-1407999",
    "timestamp": "2025-09-25T16:00:03Z"
  },
  {
    "title": "Citi shifts 1000 tech jobs to India",
    "description": "Citi has moved about 1000 technology jobs to support centres in India after slashing its workforce in China, according to Bloomberg.",
    "link": "https://www.finextra.com/newsarticle/46663/citi-shifts-1000-tech-jobs-to-india",
    "timestamp": "2025-09-25T16:00:00Z"
  },
  {
    "title": "Malaysia raises US tariff concerns",
    "description": "KUALA LUMPUR: Malaysia has raised concerns with the United States over sectoral tariffs imposed on critical industries, such as semiconductors, says Investment, Trade and Industry Minister Tengku Datuk Seri Zafrul Abdul Aziz. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/26/malaysia-raises-us-tariff-concerns",
    "timestamp": "2025-09-25T16:00:00Z"
  },
  {
    "title": "Trump praises Anwar for role in ceasefire",
    "description": "KUALA LUMPUR: The United States has recognised Malaysia's success in facilitating the ceasefire between Cambodia and Thailand, calling it a major achievement that underscored Malaysia's credibility and Asean's strength, said Prime Minister Datuk Seri Anwar Ib…",
    "link": "https://www.thestar.com.my/news/nation/2025/09/26/trump-praises-anwar-for-role-in-ceasefire",
    "timestamp": "2025-09-25T16:00:00Z"
  },
  {
    "title": "‘South Park’ Introduces Prediction Markets To Mainstream America",
    "description": "Stuffed in an episode with Satan, Jesus, Donald Trump, cat-borne disease, the war in Gaza and more, prediction markets get explained.",
    "link": "https://www.ingame.com/south-park-prediction-markets/",
    "timestamp": "2025-09-25T15:59:54Z"
  },
  {
    "title": "Ryan Walters resigns as Oklahoma’s top public schools official to lead conservative educators’ group",
    "description": "Walters praised Donald Trump and opposed \"wokeness\" in schools.",
    "link": "https://www.bostonherald.com/2025/09/25/ryan-walters-resigns/",
    "timestamp": "2025-09-25T15:59:03Z"
  },
  {
    "title": "ICE Shooting Exposes Left’s Distrust of Trump Government Getting Worse",
    "description": "Joshua Jahn’s attack and the “ANTI ICE” bullet reveal a new reality: the left now mirrors right-wing deep-state mistrust, signaling bipartisan erosion of trust.\nThe post ICE Shooting Exposes Left’s Distrust of Trump Government Getting Worse first appeared on …",
    "link": "https://www.mediaite.com/opinion/ice-shooting-exposes-lefts-distrust-of-trump-government-getting-worse/",
    "timestamp": "2025-09-25T15:58:58Z"
  },
  {
    "title": "What we know about how a government shutdown would unfold",
    "description": "The threat of a government shutdown has become a recurring event in Washington",
    "link": "https://abcnews.go.com/Politics/wireStory/government-shutdown-unfold-125933128",
    "timestamp": "2025-09-25T15:58:46Z"
  },
  {
    "title": "Trump Dumbass Lindsey Halligan Ain't Need No 'Evidence' Or 'Probable Cause' To Indict James Comey!",
    "description": "She does actually need those things.",
    "link": "https://www.wonkette.com/p/trump-dumbass-lindsey-halligan-aint",
    "timestamp": "2025-09-25T15:57:30Z"
  },
  {
    "title": "Federal judge warns Trump DOJ of sanctions, contempt for rule violations in Mangione case",
    "description": "The judge overseeing the federal case against Luigi Mangione warned officials with Trump's DOJ that rule violations that could prejudice the defendant's right to a fair trial could result in sanctions or other penalties.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/luigi-mangione-doj-contempt-sanctions-rcna233639",
    "timestamp": "2025-09-25T15:57:15Z"
  },
  {
    "title": "Trump during meeting with Erdogan: We want the war in Gaza to end, we are close to a deal",
    "description": "During a meeting with Turkish President Tayyip Erdogan, President Donald Trump remarked: \"I had a great meeting with [Middle East] leaders... at UNGA — and I think we're close to getting some kind of a deal done. We want to get the hostages back. I have to ge…",
    "link": "https://www.israelnationalnews.com/flashes/667141",
    "timestamp": "2025-09-25T15:57:00Z"
  },
  {
    "title": "Spotlight On Energy Storage For New York Climate Week",
    "description": "Against the high profile backdrop of New York Climate Week, the global energy storage field is heating up with new joint ventures, new alliances, new technologies, and new momentum to support wind and solar power.\nThe post Spotlight On Energy Storage For New …",
    "link": "https://cleantechnica.com/2025/09/25/spotlight-on-energy-storage-for-new-york-climate-week/",
    "timestamp": "2025-09-25T15:56:30Z"
  },
  {
    "title": "Ryan Walters to resign, ending scandal-plagued tenure as Oklahoma schools’ chief",
    "description": "Ryan Walters’ tenure in Oklahoma was “a stream of never-ending scandal and political drama,” which is now ending: He's finally resigning.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ryan-walters-resign-ending-scandal-plagued-tenure-oklahoma-schools-chi-rcna233700",
    "timestamp": "2025-09-25T15:54:54Z"
  },
  {
    "title": "Jimmy Kimmel Responds to Trump’s Threats: ‘an Old-Fashioned ‘80s Movie-Style Bully’ - Rolling Stone",
    "description": "Jimmy Kimmel Responds to Trump’s Threats: ‘an Old-Fashioned ‘80s Movie-Style Bully’Rolling Stone Kimmel nods to big ratings, heckles Trump as an ‘80s-movie-style bully’ in second post-suspension showCNN Jimmy Kimmel: ‘Only Donald Trump would try to prove he w…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179531184",
    "timestamp": "2025-09-25T15:52:59Z"
  },
  {
    "title": "Former Fed chairs warn that removing Lisa Cook could lead to inflation boom",
    "description": "A group of the country's top economic leaders, including every living former Federal Reserve chair, filed an amicus brief with the Supreme Court on Thursday in support of Fed governor Lisa Cook, who President Donald Trump is seeking to remove",
    "link": "https://www.nbcnews.com/business/business-news/former-fed-chairs-warn-removing-lisa-cook-lead-inflation-boom-rcna233674",
    "timestamp": "2025-09-25T15:52:06Z"
  },
  {
    "title": "The 1970s inflation crisis shaped modern central bank independence. Now it’s under populist threat – podcast",
    "description": "Political economist Cristina Bodea talks to The Conversation Weekly podcast about how central bank independence became the global norm for economic governance.",
    "link": "https://theconversation.com/the-1970s-inflation-crisis-shaped-modern-central-bank-independence-now-its-under-populist-threat-podcast-265998",
    "timestamp": "2025-09-25T15:51:27Z"
  },
  {
    "title": "Mayors Of Big Cities Agree Juvenile Crime Is A ‘Serious’ Problem, Poll Shows",
    "description": "Many mayors of major cities in the U.S. think that juvenile crime is a \"serious\" problem, according to a survey released Thursday.",
    "link": "https://dailycaller.com/2025/09/25/big-city-mayors-juvenile-crime-poll/",
    "timestamp": "2025-09-25T15:50:23Z"
  },
  {
    "title": "Department of Education Allocates $500M for Charter School Programs",
    "description": "The U.S. Department of Education (ED) on Wednesday released $500 million for charter school programs, calling the move the \"largest investment in the program ever.\" \nThe post Department of Education Allocates $500M for Charter School Programs appeared first o…",
    "link": "https://www.breitbart.com/education/2025/09/25/department-of-education-allocates-500m-for-charter-school-programs/",
    "timestamp": "2025-09-25T15:50:05Z"
  },
  {
    "title": "‘South Park’ lays into FCC chair over freedom of speech in new episode",
    "description": "After a week in which American free speech appeared in peril, the minds behind “South Park” took an opportunity to reiterate they will not be censored.",
    "link": "https://www.denverpost.com/2025/09/25/south-park-brendan-carr-fcc-freedom-speech/",
    "timestamp": "2025-09-25T15:49:54Z"
  },
  {
    "title": "Former Fed, Treasury chiefs urge Supreme Court to block Trump firing Lisa Cook",
    "description": "Every living former chair of the Federal Reserve, as well as a slew of ex-Treasury secretaries and former White House economic advisors, urged the Supreme Court on Thursday to block President Donald Trump from firing Fed Governor Lisa Cook as her lawsuit chal…",
    "link": "https://biztoc.com/x/9d1c4d48d959361c",
    "timestamp": "2025-09-25T15:49:19Z"
  },
  {
    "title": "Who profited off 7 October?",
    "description": "Suspicious short selling, a prime minister unwilling to form an independent commission, and revelations from the military suggests Israel’s story on 7 October is not the full picture.",
    "link": "https://electronicintifada.net/content/who-profited-7-october/50963",
    "timestamp": "2025-09-25T15:49:02Z"
  },
  {
    "title": "Jimmy Kimmel Miraculously Comes To Jesus When He’s Feuding With Republicans",
    "description": "Jimmy Kimmel usually invokes his Christian faith when he's using it as a cudgel against Republicans",
    "link": "https://dailycaller.com/2025/09/25/catholic-altar-boy-jimmy-kimmel-erika-charlie-kirk-teachings-of-jesus-roy-moore/",
    "timestamp": "2025-09-25T15:48:41Z"
  },
  {
    "title": "A Wisconsin Republican candidate for governor followed sex-positive accounts for nonbinary adult star, others",
    "description": "Bill Berrien, a deeply conservative, anti-transgender candidate for Wisconsin governor, has been following nonbinary adult entertainer and author Jiz Lee “and several other authors of sexually explicit essays” on the online platform Medium, the Milwaukee Jour…",
    "link": "https://www.advocate.com/politics/anti-transgender-wisconsin-candidate-hypocrisy",
    "timestamp": "2025-09-25T15:48:09Z"
  },
  {
    "title": "Putin is poking NATO with drones and jets. The military alliance is still sorting out its response",
    "description": "The Kremlin denies it is behind a series of drone incursions at airports in Denmark and across northern Europe this week, but NATO leaders believe otherwise. Security experts say Russian President Vladimir Putin may slowly be expanding his war battlefield bey…",
    "link": "https://www.cbc.ca/news/world/russian-drone-jets-nato-response-1.7643188",
    "timestamp": "2025-09-25T15:47:04Z"
  },
  {
    "title": "Trump holds talks with Pakistan's prime minister in the latest sign of warming relations",
    "description": "President Donald Trump hosted Pakistan's prime minister, Shehbaz Sharif, for talks Thursday at the White House in the latest sign of warming relations...",
    "link": "https://www.yahoo.com/news/articles/trump-hold-talks-pakistans-prime-154620688.html",
    "timestamp": "2025-09-25T15:46:20Z"
  },
  {
    "title": "Everyone Was Waiting for the First South Park Episode Post–Charlie Kirk. Well …",
    "description": "The latest South Park episode talks around current events, rather than satirizing them head-on.",
    "link": "https://slate.com/culture/2025/09/south-park-season-27-episode-5-trump-jr-charlie-kirk-brendan-carr-paramount.html",
    "timestamp": "2025-09-25T15:45:41Z"
  },
  {
    "title": "Tucker Carlson made a chilling choice in his eulogy for Charlie Kirk",
    "description": "Conservative commentator Tucker Carlson, long accused of splashing around in antisemitism, dipped back into those waters in his eulogy for Charlie Kirk on Sunday.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/tucker-carlson-charlie-kirk-eulogy-antisemitism-maga-rcna233067",
    "timestamp": "2025-09-25T15:45:19Z"
  },
  {
    "title": "Ex-Fed, Treasury Officials Back Fed's Cook in Trump Fight (Bloomberg)",
    "description": "Bloomberg:\nEx-Fed, Treasury Officials Back Fed's Cook in Trump Fight  —  A bipartisan group of former Treasury secretaries, Federal Reserve chairs and other experts urged the US Supreme Court not to let President Donald Trump fire Fed Governor Lisa Cook, argu…",
    "link": "https://www.memeorandum.com/250925/p55",
    "timestamp": "2025-09-25T15:45:00Z"
  },
  {
    "title": "UNGA: Palestinian leader denounces Israel, Hamas in address",
    "description": "Mahmoud Abbas said Palestinians would rise from under the rubble to rebuild Gaza. He delivered his speech via video link after the US denied him a visa to attend the UN General Assembly. DW has more. Palestinian President Mahmoud Abbas delivered a wide-rangin…",
    "link": "https://www.dw.com/en/unga-palestinian-leader-denounces-israel-hamas-in-address/live-74097199",
    "timestamp": "2025-09-25T15:43:00Z"
  },
  {
    "title": "Diddy's Family and Defense Team Show Support at Hearing Seeking Acquittal",
    "description": "Diddy's lawyers showed up looking confident at his acquittal hearing Thursday ... while his family appeared hopeful as they made their way into the courtroom. The music mogul's legal team -- led by Marc Agnifilo and Alexandra Shapiro -- arrived in…\n Permalink",
    "link": "https://www.tmz.com/2025/09/25/diddy-defense-team-arrives-court-nyc/",
    "timestamp": "2025-09-25T15:42:39Z"
  },
  {
    "title": "Kamala Does Speaking Tour To Remind Nation Why Trump Is President",
    "description": "U.S. — With President Donald Trump's approval ratings showing signs of decline, former Vice President Kamala Harris dutifully stepped forward to launch a speaking tour to remind the nation why Trump was elected president. Harris embarked on a media tour this …",
    "link": "https://freerepublic.com/focus/f-chat/4342594/posts",
    "timestamp": "2025-09-25T15:41:52Z"
  },
  {
    "title": "Trump’s $100,000 H-1B Visa Fee Is A Gift To European AI Startups",
    "description": "Hiring foreign workers just got more expensive for American tech companies. But that’s opened up new recruiting opportunities for non-U.S. AI startups.",
    "link": "https://www.forbes.com/sites/richardnieva/2025/09/25/trump-h1b-visa-fee-european-ai-startups/",
    "timestamp": "2025-09-25T15:39:57Z"
  },
  {
    "title": "Fed's Bowman says regulators to unveil Basel capital rule redo by early 2026",
    "description": "WASHINGTON (Reuters) -The Federal Reserve's top regulatory official said Thursday that bank agencies are poised to unveil a more industry-friendly version of...",
    "link": "https://finance.yahoo.com/news/feds-bowman-says-regulators-unveil-153855386.html",
    "timestamp": "2025-09-25T15:38:55Z"
  },
  {
    "title": "Trump Administration Cozies Back Up to Elon Musk With New AI Tech Deal",
    "description": "The xAI government partnership comes after President Donald Trump and Musk sat with each other at Charlie Kirk’s memorial\nThe post Trump Administration Cozies Back Up to Elon Musk With New AI Tech Deal appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-elon-musk-ai-deal/",
    "timestamp": "2025-09-25T15:38:38Z"
  },
  {
    "title": "Nolte: Trump Credibly Accuses the United Nations of ‘Triple Sabotage’",
    "description": "After a triumphant speech to the United Nations this week, President Trump released a statement on his Truth Social account accusing the U.N. of a “sinister” act of “triple sabotage.”\nThe post Nolte: Trump Credibly Accuses the United Nations of ‘Triple Sabota…",
    "link": "https://www.breitbart.com/politics/2025/09/25/nolte-trump-credibly-accuses-the-united-nations-of-triple-sabotage/",
    "timestamp": "2025-09-25T15:38:27Z"
  },
  {
    "title": "Trump welcomes Erdogan at White House",
    "description": "United States President Donald Trump welcomed his Turkish counterpart Recep Tayyip Erdogan at the White House on Thursday. More to come......",
    "link": "https://biztoc.com/x/b75678a256836fea",
    "timestamp": "2025-09-25T15:38:13Z"
  },
  {
    "title": "Questions raised about billions of missing tax dollars as Trump kills programs: report",
    "description": "Members of Congress on both sides of the aisle are asking questions about what Donald Trump's administration is doing with tax dollars that are being withheld or diverted from programs he doesn't like.As part of the president's remaking of the government sinc…",
    "link": "https://www.rawstory.com/trump-tax-dollars/",
    "timestamp": "2025-09-25T15:37:22Z"
  },
  {
    "title": "Trump, Vance direct blame at Democrats for Dallas ICE shooting",
    "description": "House Democratic leaders condemned the violence in a joint statement.",
    "link": "https://abcnews.go.com/Politics/trump-vance-direct-blame-democrats-dallas-ice-shooting/story?id=125904546",
    "timestamp": "2025-09-25T15:36:17Z"
  },
  {
    "title": "DOJ Appears to Have Violated Luigi Mangione’s Right to a Fair Trial, Judge Says",
    "description": "The judge warned the Department of Justice that future violations may result in sanctions.",
    "link": "https://truthout.org/articles/doj-appears-to-have-violated-luigi-mangiones-right-to-a-fair-trial-judge-says/",
    "timestamp": "2025-09-25T15:35:58Z"
  },
  {
    "title": "Treasury Yields Set Three-Week High as Data Clouds Rate-Cut Path",
    "description": "Short-maturity rates, which track expectations for Fed policy most closely, led the move after weekly jobless claims came in below estimates while separate...",
    "link": "https://finance.yahoo.com/news/treasury-yields-climb-three-week-112321166.html",
    "timestamp": "2025-09-25T15:35:41Z"
  },
  {
    "title": "\"Former Fed, Treasury chiefs urge Supreme Court to block Trump firing Lisa Cook\" (vanity: Anti-Trumpers write a letter)",
    "description": "Every living former chair of the Federal Reserve, as well as a slew of ex-Treasury secretaries and former White House economic advisors, urged the Supreme Court not to allow President Donald Trump to fire Fed Governor Lisa Cook as her lawsuit challenging her …",
    "link": "https://freerepublic.com/focus/f-news/4342593/posts",
    "timestamp": "2025-09-25T15:34:32Z"
  },
  {
    "title": "Israel is guilty of war crimes, Palestine’s Abbas tells UNGA",
    "description": "While the Palestinian Authority president spoke via videolink, world leaders met without him to discuss the war in Gaza.",
    "link": "https://www.aljazeera.com/news/2025/9/25/israel-is-guilty-of-war-crimes-palestines-abbas-tells-unga",
    "timestamp": "2025-09-25T15:34:11Z"
  },
  {
    "title": "As Wisconsin Planned Parenthood pauses abortions amid Medicaid funding cuts, Illinois braces for more patients",
    "description": "Illinois is bracing for even more women from neighboring states to travel for healthcare after Planned Parenthood of Wisconsin announced it is pausing abortions services starting next week.",
    "link": "https://www.cbsnews.com/chicago/news/planned-parenthood-wisconsin-abortion-medicaid-illinois/",
    "timestamp": "2025-09-25T15:30:35Z"
  },
  {
    "title": "Renderings of Trump’s White House Ballroom Show Just How Insane It Is",
    "description": "President Trump’s upcoming ballroom will be bigger than the White House.Recent renderings obtained by CBS News show that the ballroom—which Trump has been obsessing over for some time now—shows a gaudy, gold-tinged, 90,000-square foot building that looks like…",
    "link": "https://newrepublic.com/post/200922/architecture-renderings-trump-white-house-ballroom",
    "timestamp": "2025-09-25T15:30:13Z"
  },
  {
    "title": "White House budget office tells agencies to draft mass firing plans ahead of potential shutdown",
    "description": "It would be a much more aggressive step than in previous shutdowns.",
    "link": "https://www.bostonherald.com/2025/09/25/trump-shutdown-mass-firings/",
    "timestamp": "2025-09-25T15:29:59Z"
  },
  {
    "title": "White House budget office tells agencies to draft mass firing plans ahead of potential shutdown",
    "description": "It would be a much more aggressive step than in previous shutdowns.",
    "link": "https://www.denverpost.com/2025/09/25/trump-shutdown-mass-firings/",
    "timestamp": "2025-09-25T15:29:59Z"
  }
]