[
  {
    "title": "‘Morning Joe’ Panelist Says Trump Could Be ‘Proved Right’ On Birthright Citizenship Issue",
    "description": "Former U.S. attorney Chuck Rosenberg said that President Donald Trump could be \"proved right\" on birthright citizenship by the Supreme Court.",
    "link": "https://dailycaller.com/2025/05/15/morning-joe-chuck-rosenberg-trump-birthright-citizenship/",
    "timestamp": "2025-05-15T14:19:35Z"
  },
  {
    "title": "US President Donald Trump Asks Apple to Stop Moving iPhone Production to India",
    "description": "US President Donald Trump has asked Apple CEO Tim Cook to stop building plants in India to make iPhones for the US. Trump’s comments threaten to throw a wrench into Apple’s plan to import most of the iPhones it sells in the US from India by the end of next ye…",
    "link": "https://www.gadgets360.com/mobiles/news/donald-trump-apple-tim-cook-stop-iphone-production-india-8422935",
    "timestamp": "2025-05-15T14:19:32Z"
  },
  {
    "title": "The Ben Shapiro ‘Honesty’ Hustle",
    "description": "How could a God-fearing winger with a healthy respect for our founders and the Constitution still support a guy who has now said he’s not sure if it’s his duty to uphold the Constitution?\nThe post The Ben Shapiro ‘Honesty’ Hustle first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/the-ben-shapiro-honesty-hustle/",
    "timestamp": "2025-05-15T14:19:30Z"
  },
  {
    "title": "Potential US semiconductor manufacturing boom complicated by Trump's economic policies",
    "description": "Before ‘America First’ became the Trump administration’s mandate for foreign policy and trade, one sector was already working to bring business back to the United States: the semiconductor industry",
    "link": "https://abcnews.go.com/US/wireStory/potential-us-semiconductor-manufacturing-boom-complicated-trumps-economic-121836208",
    "timestamp": "2025-05-15T14:19:14Z"
  },
  {
    "title": "Russia uncertain whether Ukraine's delegation plans to attend Istanbul talks",
    "description": "A Russian delegation arrived in Istanbul and is waiting for their Ukrainian counterparts to come, Kremlin spokesman Dmitry Peskov said Thursday.",
    "link": "https://www.hurriyetdailynews.com/russia-uncertain-whether-ukraines-delegation-plans-to-attend-istanbul-talks-209230",
    "timestamp": "2025-05-15T14:18:55Z"
  },
  {
    "title": "Trump wants Apple to stop making more iPhones in India",
    "description": "President Donald Trump told Apple CEO Tim Cook that he doesn’t want the company to move iPhone production to India. “I had a little problem with Tim Cook yesterday,” Trump said during his visit to Qatar. “You’re coming in with $500 billion, but now I hear you…",
    "link": "https://www.theverge.com/news/667649/donald-trump-apple-stop-producing-iphones-india",
    "timestamp": "2025-05-15T14:18:30Z"
  },
  {
    "title": "Fox News ‘Antisemitism Exposed’ Newsletter: American hostage held by Hamas freed after 584 days",
    "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
    "link": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-american-hostage-held-hamas-freed-after-584-days",
    "timestamp": "2025-05-15T14:18:25Z"
  },
  {
    "title": "NATO on track to strike spending deal to please Trump",
    "description": "NATO appears headed for a compromise deal at a summit next month to satisfy US President Donald Trump’s demand to spend five percent of GDP on defence, as heavyweights Germany and France got on board Thursday. To make the volatile US leader happy, NATO chief …",
    "link": "https://www.digitaljournal.com/world/nato-on-track-to-strike-spending-deal-to-please-trump/article",
    "timestamp": "2025-05-15T14:17:20Z"
  },
  {
    "title": "Slovenia probes disappearance of latest Melania Trump statue",
    "description": "The first Melania Trump statue in her native Slovenia was destroyed by fire and now its bronze replacement has gone missing, prompting a police investigation. The life-sized bronze of the US first lady was unveiled near her hometown of Sevnica in 2020, toweri…",
    "link": "https://www.digitaljournal.com/world/slovenia-probes-disappearance-of-latest-melania-trump-statue/article",
    "timestamp": "2025-05-15T14:17:20Z"
  },
  {
    "title": "Trump Calls U.S. “STUPID” in Wild Anti-Birthright Citizenship Rant",
    "description": "Donald Trump went off the rails in a hateful rant Thursday as the Supreme Court prepared to hear arguments over his blatantly unconstitutional executive order ending birthright citizenship. \r\n“Birthright Citizenship was not meant for people taking vacations t…",
    "link": "https://newrepublic.com/post/195292/donald-trump-rant-birthright-citizenship-supreme-court",
    "timestamp": "2025-05-15T14:16:14Z"
  },
  {
    "title": "Bridgewater’s billionaire founder Ray Dalio to open office in Saudi Arabia: sources",
    "description": "The top firm will open up a base later this year in the Gulf kingdom, senior sources close to the Saudi government said.",
    "link": "https://nypost.com/2025/05/15/business/bridgewater-founder-ray-dalio-to-open-office-in-saudi-arabia-sources/",
    "timestamp": "2025-05-15T14:16:00Z"
  },
  {
    "title": "Another one of Elon Musk's companies is coming to the Gulf",
    "description": "Elon Musk's brain-chip company Neuralink is starting its first international clinical trial in the UAE.",
    "link": "https://www.businessinsider.com/elon-musk-companies-neuralink-uae-starlink-saudi-arabia-2025-5",
    "timestamp": "2025-05-15T14:15:44Z"
  },
  {
    "title": "Judicial Coup Exposed: New Bill Proposed to Answer Courts’ War on Trump and America",
    "description": "A bold legislative proposal, the “Restoring Constitutional Mandate for Congress to Set Rules for the Federal Courts Act,” seeks to rein in what its author warns is an existential crisis – a  “judicial coup” targeting President Donald Trump and the American pe…",
    "link": "https://www.thegatewaypundit.com/2025/05/judicial-coup-exposed-new-bill-proposed-answer-courts/",
    "timestamp": "2025-05-15T14:15:33Z"
  },
  {
    "title": "NATO On Track To Strike Spending Deal To Please Trump",
    "description": "NATO appears headed for a compromise deal at a summit next month to satisfy US President Donald Trump's demand to spend five percent of GDP on defence, as heavyweights Germany and France got on board Thursday.",
    "link": "https://www.ibtimes.com/nato-track-strike-spending-deal-please-trump-3773661",
    "timestamp": "2025-05-15T14:15:23Z"
  },
  {
    "title": "Wintermute opens New York office, citing improved US crypto rules",
    "description": "Wintermute, a London-based algorithmic crypto trading and market-making firm, has opened an office in New York as part of its expansion into the US.Wintermute announced the opening of its New York office on May 15, citing improved regulatory conditions in the…",
    "link": "https://cointelegraph.com/news/wintermute-new-york-office-improved-us-crypto-regulations",
    "timestamp": "2025-05-15T14:15:16Z"
  },
  {
    "title": "Trump admin pressured African nations to win contracts for Elon Musk",
    "description": "In early February, Sharon Cromer, U.S. ambassador to Gambia, went to visit one of the country’s Cabinet ministers at his agency’s headquarters, above a partially abandoned strip mall off a dirt road. It had been two weeks since President Donald Trump took off…",
    "link": "https://www.rawstory.com/trump-musk-starlink/",
    "timestamp": "2025-05-15T14:12:57Z"
  },
  {
    "title": "Walmart Warns It May Have to Raise Prices Starting This Month as Tariffs Are ‘Still Too High’",
    "description": "The news comes as U.S. consumers are already dealing with concerns over the cost of groceries.",
    "link": "https://time.com/7285637/walmart-raising-prices-us-tariffs-consumer-impact/",
    "timestamp": "2025-05-15T14:12:54Z"
  },
  {
    "title": "Bruce Springsteen says Trump is ‘unfit’ and ‘incompetent’ in remarks during UK show | CNN",
    "description": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader “unfit” for office.",
    "link": "https://www.cnn.com/2025/05/15/entertainment/bruce-springsteen-trump-criticism-scli-intl",
    "timestamp": "2025-05-15T14:12:32Z"
  },
  {
    "title": "US issues sanctions targeting Iran-backed Hezbollah, Treasury website shows",
    "description": "Treasury said overseas donations make up a significant portion of the group's budget.",
    "link": "https://www.jpost.com/breaking-news/article-854142",
    "timestamp": "2025-05-15T14:12:23Z"
  },
  {
    "title": "Not every US president gets a free private jet, but the Gulf states have boosted US economic dominance for decades",
    "description": "Oil money from the Middle East often goes straight to the US.",
    "link": "https://theconversation.com/not-every-us-president-gets-a-free-private-jet-but-the-gulf-states-have-boosted-us-economic-dominance-for-decades-256655",
    "timestamp": "2025-05-15T14:11:48Z"
  },
  {
    "title": "Israeli military strikes kill dozens in Gaza as Trump visits region",
    "description": "Most of the victims, including women and children,  killed in Khan Younis in air strikes that hit homes and tents, say medics",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/15/israeli-military-strikes-kill-dozens-in-gaza-as-trump-visits-region/",
    "timestamp": "2025-05-15T14:10:48Z"
  },
  {
    "title": "Potential US semiconductor manufacturing boom complicated by Trump's economic policies",
    "description": "Before ‘America First’ became the Trump administration’s mandate for foreign policy and trade, one sector was already working to bring business back to the United States: the semiconductor industry. Aided by government incentives, American and foreign tech co…",
    "link": "https://www.seattlepi.com/news/politics/article/potential-us-semiconductor-manufacturing-boom-20328917.php",
    "timestamp": "2025-05-15T14:10:04Z"
  },
  {
    "title": "Don Jr.'s Axel to Grind (Oliver Darcy/Status)",
    "description": "Oliver Darcy / Status:\nDon Jr.'s Axel to Grind  —  An unflattering story about Donald Trump Jr. triggered a White House assault on Business Insider and parent company Axel Springer—and signaled just how far Trumpworld is willing to go to silence critical cove…",
    "link": "https://www.memeorandum.com/250515/p41",
    "timestamp": "2025-05-15T14:10:01Z"
  },
  {
    "title": "Trump’s Critics and Supporters Unite Against Plane Deal",
    "description": "\"In his eagerness to accept a plane from Qatar, Donald Trump has achieved a remarkable feat, uniting many partisans across America's bitter political divide. The problem for the White House is that unity is happening",
    "link": "https://politicalwire.com/2025/05/15/trumps-critics-and-supporters-unite-against-plane-deal/",
    "timestamp": "2025-05-15T14:09:54Z"
  },
  {
    "title": "Russian State TV Launches Patriotic Kids Show Featuring Toddler Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKremlin propagandist Vladimir Solovyov is launching a children's show featuring animated toddler versions of world leaders—including President Donald Trump and North Korean leader Kim Jong Un—which he claims w…",
    "link": "https://biztoc.com/x/11986ee2e9c6b5f0",
    "timestamp": "2025-05-15T14:09:45Z"
  },
  {
    "title": "Walmart says it will raise prices due to tariff costs after posting solid first quarter sales",
    "description": "Walmart, which became the nation’s largest retailer by making low prices a priority, has found itself in a place it’s rarely been: Warning customers that prices will rise for goods ranging from bananas to car seats.",
    "link": "https://www.news4jax.com/business/2025/05/15/walmart-says-it-will-raise-prices-due-to-tariff-costs-after-posting-solid-first-quarter-sales/",
    "timestamp": "2025-05-15T14:08:19Z"
  },
  {
    "title": "US Stocks Slump as Big Tech, Walmart Slide After Torrid Rally",
    "description": "US stocks were on pace to snap a three-day winning streak Thursday, driven by declines in technology, energy and retailers as traders assessed a slew of mixed economic figures.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-slump-as-big-tech-walmart-slide-after-torrid-rally",
    "timestamp": "2025-05-15T14:07:46Z"
  },
  {
    "title": "Rutte says NATO allies ready for big jump in defence spending commitments",
    "description": "At a gathering in Turkey, NATO Secretary General Mark Rutte said there's support to dramatically increase military spending across the alliance.",
    "link": "https://www.euractiv.com/section/defence/news/rutte-says-nato-allies-ready-for-big-jump-in-defence-spending-commitments/",
    "timestamp": "2025-05-15T14:06:44Z"
  },
  {
    "title": "Trump says the 'beautiful' F-22 Raptor is getting a big upgrade, saying 'we're going to be doing an F-22 Super'",
    "description": "President Trump also accused China of copying the F-22 stealth fighter jet but said it can't copy the engines.",
    "link": "https://www.businessinsider.com/trump-says-f-22-raptor-is-getting-a-super-upgrade-2025-5",
    "timestamp": "2025-05-15T14:06:03Z"
  },
  {
    "title": "Trump Gushes Praise at Hannity on Fox News Over Election: ‘You Were Wonderful to Me!’",
    "description": "Trump gushed praise at Fox News host Sean Hannity for being \"wonderful to me\" and \"an amazing professional\" during the 2024 presidential campaign.\nThe post Trump Gushes Praise at Hannity on Fox News Over Election: ‘You Were Wonderful to Me!’ first appeared on…",
    "link": "https://www.mediaite.com/news/trump-gushes-praise-at-hannity-on-fox-news-over-election-you-were-wonderful-to-me/",
    "timestamp": "2025-05-15T14:05:46Z"
  },
  {
    "title": "Trump says US close to a nuclear deal with Iran",
    "description": "President Donald Trump said on Thursday that the United States was getting very close to securing a nuclear deal with Iran, and Tehran had “sort of” agreed to the terms. “We’re in very serious negotiations with Iran for long-term peace,” Trump said on a tour …",
    "link": "https://freerepublic.com/focus/f-news/4317137/posts",
    "timestamp": "2025-05-15T14:03:29Z"
  },
  {
    "title": "Russian State TV Launches Patriotic Kids Show Featuring Toddler Trump",
    "description": "It features toddler versions of world leaders, including Putin, Trump, Kim, French President Emmanuel Macron and Turkish leader Recep Tayyip Erdogan.",
    "link": "https://www.newsweek.com/russian-state-tv-kids-show-solvyov-trump-2072685",
    "timestamp": "2025-05-15T14:03:03Z"
  },
  {
    "title": "Green-Card Holder Detained for Two Months Details 'Horrendous' Conditions",
    "description": "\"It was degrading, it's dehumanizing. It is horrendous,\" Fabian Schmidt told GBH News.",
    "link": "https://www.newsweek.com/green-card-fabian-schmidt-holder-detained-ice-immigratioon-2072698",
    "timestamp": "2025-05-15T14:02:15Z"
  },
  {
    "title": "Espionage, constitutional concerns abound from Trump detractors, allies over Qatari jet offer",
    "description": "Trump's plan to accept a $400M jet from Qatar sparks debate over constitutional legality and espionage risks, with mixed reactions from both political parties.",
    "link": "https://www.foxnews.com/politics/espionage-constitutional-concerns-abound-from-trump-detractors-allies-over-qatari-jet-offer",
    "timestamp": "2025-05-15T14:01:35Z"
  },
  {
    "title": "Satellite Images Show Desert Ski Resort Emerge at World's Biggest Construction Site",
    "description": "An outdoor ski resort in Saudi Arabia signals the scale of the ambition on the flagship Neom project",
    "link": "https://www.newsweek.com/satellite-images-show-desert-ski-resort-emerge-worlds-biggest-construction-site-2072561",
    "timestamp": "2025-05-15T14:01:14Z"
  },
  {
    "title": "Putin's no-show in Turkey throws Ukraine talks into disarray...",
    "description": null,
    "link": "https://apnews.com/article/trump-qatar-syria-aludeid-air-base-9c868799582685b3a115c6f0c243d606",
    "timestamp": "2025-05-15T14:00:06Z"
  },
  {
    "title": "Going Around. . . Coming Back Around",
    "description": "“I hope Ed Martin’s 1st assignment at DOJ is to investigate Thom Tillis’ corruption.” — Rogan O’Handley (aka’ DC Draino’ on X) The funny part is that this swarm of Jacobin botflies from Norm Eisen to Sen. Thom Tillis thought (and acted) as if Ed Martin was th…",
    "link": "https://www.activistpost.com/going-around-coming-back-around/",
    "timestamp": "2025-05-15T14:00:00Z"
  },
  {
    "title": "Michael Hiltzik: Trump’s Tariff War is Nonsensical",
    "description": "Michael Hiltzik is a Pulitzer-Prize winning columnist for the Los Angeles Times, who write about business and whatever else he wants. In this column, he tries to make sense of Trump’s tariff war. It’s hard to do because it doesn’t make sense. Trump claims to …",
    "link": "https://dianeravitch.net/2025/05/15/michael-hiltzik-trumps-tariff-war-is-nonsensical/",
    "timestamp": "2025-05-15T14:00:00Z"
  },
  {
    "title": "US manufacturing output falls in April on weak auto production",
    "description": "U.S. manufacturing production fell more than expected in April amid a sharp decline in motor vehicle output, and the sector could struggle to regain its...",
    "link": "https://finance.yahoo.com/news/us-manufacturing-output-falls-april-135825544.html",
    "timestamp": "2025-05-15T13:58:25Z"
  },
  {
    "title": "New US ambassador, former senator and business executive David Perdue, arrives in China",
    "description": "The new U.S. ambassador to China, former senator and business executive David Perdue, has arrived in Beijing just days after China and the U.S. agreed to a temporary break in their damaging tariff war",
    "link": "https://abcnews.go.com/US/wireStory/new-us-ambassador-former-senator-business-executive-david-121826180",
    "timestamp": "2025-05-15T13:58:18Z"
  },
  {
    "title": "Walmart prepares price rises due to tariffs",
    "description": "Walmart prepares price rises due to tariffs\nWalmart is preparing to raise prices in the US as soon as this month, as its own costs increase as a result of the new tariffs on imports imposed by President Donald Trump.\nThe plans by the world's largest retailer …",
    "link": "https://biztoc.com/x/4b3c73ee5ea95d9b",
    "timestamp": "2025-05-15T13:58:05Z"
  },
  {
    "title": "Speed is a Choice",
    "description": "The authors of Abundance talk with Michael Pollan about the pace of governance, the environmental questions of our age, and the federal policies that drive scientific progress.",
    "link": "https://longnow.org/ideas/speed-is-a-choice-ezra-klein-derek-thompson-abundance/",
    "timestamp": "2025-05-15T13:57:35Z"
  },
  {
    "title": "What you need to know about 'forever chemicals' in drinking water",
    "description": "Environmental Protection Agency announced plans to weaken limits on some harmful chemicals roughly a year after the Biden administration set national standards.",
    "link": "https://www.nbcnews.com/science/environment/need-know-forever-chemicals-drinking-water-rcna207004",
    "timestamp": "2025-05-15T13:56:37Z"
  },
  {
    "title": "Seth Meyers Predicts Ted Cruz Will Walk Back Criticism of Trump Taking Qatari Jet if He Gets Invited On | Video",
    "description": "For now, the Texas senator thinks \"the plane poses significant espionage and surveillance problems\"\nThe post Seth Meyers Predicts Ted Cruz Will Walk Back Criticism of Trump Taking Qatari Jet if He Gets Invited On | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-qatar-jet-ted-cruz-criticism-seth-meyers/",
    "timestamp": "2025-05-15T13:55:29Z"
  },
  {
    "title": "Big Law Deals With Trump Are Backfiring on Top Firms",
    "description": "Major law firms in a storng position to fight Trump diktats about backing conservative interests are paying a price for selling out.",
    "link": "https://www.nakedcapitalism.com/2025/05/big-law-deals-with-trump-are-backfiring-on-top-firms.html",
    "timestamp": "2025-05-15T13:55:26Z"
  },
  {
    "title": "Birkenstock Raises 2025 Guidance Due To Strong Demand; Price Increases Expected",
    "description": "Birkenstock posted second quarter double-digit revenue growth across operating regions; pricing integrity suggests price increases due to tariffs.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/birkenstock-birk-q2-2025-earnings-1237715570/",
    "timestamp": "2025-05-15T13:54:11Z"
  },
  {
    "title": "Trump says he has a ‘little problem’ with Tim Cook | CNN Business",
    "description": "President Donald Trump isn’t pleased with Apple CEO Tim Cook’s plan to manufacture iPhones bound for the United States at newly built plants in India.",
    "link": "https://www.cnn.com/2025/05/15/tech/tim-cook-donald-trump-india-problem",
    "timestamp": "2025-05-15T13:54:06Z"
  },
  {
    "title": "Can President Trump legally accept a $400m plane for free?",
    "description": "Trump's plane acceptance potentially breaches emoluments clause as lawsuits face procedural hurdles, say experts.",
    "link": "https://www.aljazeera.com/news/2025/5/15/can-president-trump-legally-accept-a-400m-plane-for-free",
    "timestamp": "2025-05-15T13:53:19Z"
  },
  {
    "title": "Jamie Dimon continues to warn of recession, despite pullback in China tariffs | CNN Business",
    "description": "While many economists are saying the risk of an imminent recession has diminished since China and the United States agreed to lower tariffs earlier this week, JPMorgan Chase’s CEO, Jamie Dimon, is still penciling one in.",
    "link": "https://www.cnn.com/2025/05/15/economy/dimon-recession-tariffs",
    "timestamp": "2025-05-15T13:53:09Z"
  },
  {
    "title": "WATCH LIVE: VA Secretary Collins testifies on 2026 White House budget request",
    "description": "President Donald Trump’s 2026 budget request so far includes a 4 percent increase for Department of Veterans Affairs programs.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-va-secretary-collins-testifies-on-2026-white-house-budget-request",
    "timestamp": "2025-05-15T13:51:20Z"
  },
  {
    "title": "This Trump trick should have damned the GOP long ago",
    "description": "Trump is an illegitimate president, but he’s not the first. The last Republican who was elected president without fraud or naked treason was Dwight D. Eisenhower. And it’s damn well past time that Democrats started telling the story.But let’s start with Trump…",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-lies-gop/",
    "timestamp": "2025-05-15T13:50:37Z"
  },
  {
    "title": "Bruce Springsteen says Trump is ‘unfit’ and ‘incompetent’ in remarks during UK show",
    "description": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader “unfit” for office. “The mighty E Street Band is here tonight to call upon the righteous …",
    "link": "https://freerepublic.com/focus/f-chat/4317135/posts",
    "timestamp": "2025-05-15T13:50:14Z"
  },
  {
    "title": "Apple's iPhone sales in China took a major hit in early 2025",
    "description": "Apple's iPhone sales in China have dropped considerably, with shipments of non-Chinese smartphone brands down almost 50% year-on-year in March.Chinese iPhone sales are an important revenue source for Apple - Image Credit: AppleChina is an important market for…",
    "link": "https://appleinsider.com/articles/25/05/15/apples-iphone-sales-in-china-took-a-major-hit-in-early-2025",
    "timestamp": "2025-05-15T13:49:15Z"
  },
  {
    "title": "Walmart prepares price rises due to tariffs",
    "description": "The retailer said it isn't able to absorb all the pressure from tariffs, even at the reduced levels announced.",
    "link": "https://www.bbc.com/news/articles/cd62427ypw6o",
    "timestamp": "2025-05-15T13:48:01Z"
  },
  {
    "title": "Millions face student loan debt collection in US: Know how to avoid garnished wages",
    "description": "Experts suggest the US Department of Education can garnish up to 15% of the student loan borrower's disposable pay to repay the defaulted loans. As debt collection on defaulted federal student loans is set to begin this summer, here's how to avoid garnished w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/millions-face-student-loan-debt-collection-in-us-know-how-to-avoid-garnished-wages/articleshow/121191343.cms",
    "timestamp": "2025-05-15T13:47:46Z"
  },
  {
    "title": "What Is The 'Worst Person You Know Made a Great Point' Meme? The Viral Reaction Image Explained",
    "description": "It took a few years for García to realize a U.S. satirical website had used his photo to illustrate an article titled \"The Worst Person You Know.\" Here's why!",
    "link": "https://knowyourmeme.com/editorials/guides/what-is-the-worst-person-you-know-made-a-great-point-meme-the-viral-reaction-image-explained",
    "timestamp": "2025-05-15T13:47:31Z"
  },
  {
    "title": "Trump says he has a ‘little problem’ with Tim Cook over Apple’s India production",
    "description": "President rebukes tech firm after reports it will switch assembly of iPhones for US market from China to India\nDonald Trump has admonished Apple and its chief executive over the tech firm’s reported plans to source production of US-bound iPhones from India.\nT…",
    "link": "https://biztoc.com/x/42a6974dc2e59ca6",
    "timestamp": "2025-05-15T13:47:15Z"
  },
  {
    "title": "Trump's $142 billion arms deal may not get the Saudis the F-35 stealth fighter",
    "description": "The Saudis have sought the F-35, a top fighter jet that would put their armed forces on par with Israel. It could be a dealbreaker.",
    "link": "https://www.businessinsider.com/trump-saudi-arms-deal-f35-fighter-jet-2025-5",
    "timestamp": "2025-05-15T13:47:14Z"
  },
  {
    "title": "What does the Constitution say about the $400 million airplane that Qatar wants to gift Trump?",
    "description": "U.S. President Donald Trump’s plan to accept a $400 million airplane from Qatar raises a raft of questions about the scope of laws that relate to gifts from foreign governments and are intended to thwart corruption and improper influence, legal experts said.\n…",
    "link": "https://biztoc.com/x/6b7f22656a6d7ebb",
    "timestamp": "2025-05-15T13:46:58Z"
  },
  {
    "title": "Apple's India iPhone Shift Irks Donald Trump",
    "description": "In addition to China, Apple is making its iPhones in India, but apparently Trump isn’t too thrilled by that either.",
    "link": "https://www.androidheadlines.com/2025/05/trump-not-thrilled-apple-making-iphones-in-india.html",
    "timestamp": "2025-05-15T13:45:23Z"
  },
  {
    "title": "Developing: Iran Caves, Trump Gets Nuclear Deal Hours After Threatening to Crush Them Into Oblivion",
    "description": "After President Donald Trump offered Iran the choice between peace and oblivion, an Iranian official says a deal is possible.",
    "link": "https://www.westernjournal.com/developing-iran-caves-trump-gets-nuclear-deal-hours-threatening-crush-oblivion/",
    "timestamp": "2025-05-15T13:44:44Z"
  },
  {
    "title": "Trump says India has offered 'no tariffs' on US goods in trade negotiations",
    "description": "The US President made the claim while also criticising tech giant Apple's decision to invest in India, following the implementation of his tariff regime.",
    "link": "https://www.abc.net.au/news/2025-05-15/india-offered-zero-tariffs-on-us-imports-donald-trump-says/105298726",
    "timestamp": "2025-05-15T13:44:31Z"
  },
  {
    "title": "Voters Back Legal Status for Undocumented Immigrants: Why Aren’t the Dems Pushing it?",
    "description": "In a recently conducted YouGov survey, designed by the Center for Working Class Politics and the Labor Institute, 63% of 2024 voters in Pennsylvania, Ohio, Michigan, and Wisconsin said they supported “granting legal status to all illegal immigrants who have h…",
    "link": "https://www.commondreams.org/opinion/voters-legal-undocumented",
    "timestamp": "2025-05-15T13:44:04Z"
  },
  {
    "title": "South Africa does not plan to replace US HIV funds yet, minister says",
    "description": "PRETORIA (Reuters) -South Africa's Health Minister Aaron Motsoaledi said on Thursday that the government had not secured any new funding yet for HIV after the U.S. cut aid, and denied reports that its HIV programme was badly affected.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/15/south-africa-does-not-plan-to-replace-us-hiv-funds-yet-minister-says",
    "timestamp": "2025-05-15T13:44:00Z"
  },
  {
    "title": "'Wow! Wow!' CNN anchor rendered speechless by example of threats posed by Trump's gift jet",
    "description": "CNN's Kate Bolduan was moved to a double-wow reaction to a veteran national security official's explanation of the risks posed by President Donald Trump accepting a luxury jet from a foreign nation.\n\nThe president is facing bipartisan backlash for accepting a…",
    "link": "https://www.rawstory.com/wow-wow-cnn-anchor-rendered-speechless-by-example-of-threats-posed-by-trump-s-gift-jet/",
    "timestamp": "2025-05-15T13:43:59Z"
  },
  {
    "title": "Oil drops 2% on expectations for US-Iran nuclear deal",
    "description": "Oil prices fell on Thursday on expectations for a U.S.-Iran nuclear deal that could result in sanctions being eased, while a surprise build in U.S. crude oil inventories last week heightened investor concerns about oversupply.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-drops-2-on-expectations-for-us-iran-nuclear-deal/articleshow/121191285.cms",
    "timestamp": "2025-05-15T13:43:48Z"
  },
  {
    "title": "Trump suggests 'nothing' likely to come from Ukraine peace talks after Putin no-show",
    "description": "The US president has cast doubt over the meeting between officials from Kyiv and Moscow producing any significant progress on ending the three-year conflict.",
    "link": "https://www.abc.net.au/news/2025-05-15/donald-trump-says-nothing-likely-from-ukraine-russia-peace-talks/105298730",
    "timestamp": "2025-05-15T13:43:19Z"
  },
  {
    "title": "Inside Trump’s Fixation on Diplomatic Nominees",
    "description": "\"President Donald Trump has been taking an unusually active role in the Senate Foreign Relations Committee’s consideration of his nominees to top diplomatic posts, fueling a record confirmation pace on the Senate floor,\" Punchbowl News",
    "link": "https://politicalwire.com/2025/05/15/inside-trumps-fixation-on-diplomatic-nominees/",
    "timestamp": "2025-05-15T13:42:15Z"
  },
  {
    "title": "Shocking poll reveals 71% of Democrats want Elon Musk behind bars, billionaire faces unprecedented political backlash for his DOGE role",
    "description": "Elon Musk imprisonment poll results have taken the internet by storm as 71% of Democrats reportedly support a law that would send Musk to prison for leading Trump’s new government efficiency project, DOGE. This shocking political twist is stirring intense nat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shocking-poll-reveals-71-of-democrats-want-elon-musk-behind-bars-billionaire-faces-unprecedented-political-backlash-for-his-doge-role/articleshow/121189455.cms",
    "timestamp": "2025-05-15T13:40:55Z"
  },
  {
    "title": "Arrested Wisconsin Judge Throws Trump’s Legal Win Back in His Face",
    "description": "A Wisconsin judge who was indicted for allegedly helping an immigrant evade authorities is using the Supreme Court ruling granting Donald Trump presidential immunity to argue that she also shouldn’t be subject to prosecution. \r\n“The problems with this prosecu…",
    "link": "https://newrepublic.com/post/195285/arrested-wisconsin-judge-donald-trump-immunity-win",
    "timestamp": "2025-05-15T13:40:39Z"
  },
  {
    "title": "Trump says US close to nuclear deal with Iran, but key gaps remain",
    "description": "On a regional visit to Gulf countries, the US president signals progress on nuclear talks with Tehran.",
    "link": "https://www.aljazeera.com/news/2025/5/15/trump-says-us-close-to-nuclear-deal-with-iran-but-key-gaps-remain",
    "timestamp": "2025-05-15T13:40:07Z"
  },
  {
    "title": "The white rural reckoning (Public Notice)",
    "description": "Public Notice:\nThe white rural reckoning  —  Trump is betraying the very voters who put him back in power. … After our book, “White Rural Rage: The Threat to American Democracy,” hit shelves in February of last year, we made a wager: Tom bet that Donald Trump…",
    "link": "https://www.memeorandum.com/250515/p33",
    "timestamp": "2025-05-15T13:40:02Z"
  },
  {
    "title": "Trade war against China backfired? Trump admin scraps tough China tariffs when told they’d mostly hurt his own people, White House quickly pulls back",
    "description": "President Trump's administration scaled back high tariffs on China after advisors, including Susie Wiles and Scott Bessent, cautioned that the economic burden disproportionately affected his core supporters. This intervention led to US-China talks in Geneva, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trade-war-against-china-backfired-trump-admin-scraps-tough-china-tariffs-when-told-theyd-mostly-hurt-his-own-people-white-house-quickly-pulls-back/articleshow/121190487.cms",
    "timestamp": "2025-05-15T13:37:20Z"
  },
  {
    "title": "AG Pam Bondi faces an awkward question about her approval of the Qatari jet ‘gift’",
    "description": "When it comes to Attorney General Pam Bondi and luxury jet from Qatar, Democratic Sen. Dick Durbin is asking all the right questions, but will he get answers?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-qatar-jet-pam-bondi-conflict-rcna206997",
    "timestamp": "2025-05-15T13:36:48Z"
  },
  {
    "title": "Oil Extends Drop as Trump Says US Is Closer to Deal With Iran",
    "description": "In This Article:\n(Bloomberg) -- Oil fell for a second day after President Donald Trump said the US and Iran are getting closer to a deal regarding Tehran’s nuclear program.\nMost Read from Bloomberg\nBrent was trading around $64 a barrel after losing as much as…",
    "link": "https://biztoc.com/x/2329a2cd3108fc98",
    "timestamp": "2025-05-15T13:36:25Z"
  },
  {
    "title": "Elliott: Tariffs can cause enormous damage",
    "description": "Elliott Investment Management L.P. warned investors that tariffs imposed by United States President Donald Trump and the wider trade uncertainty could cause \"enormous damage\" worldwide, the Financial ...",
    "link": "https://biztoc.com/x/03e78eeea26d89f6",
    "timestamp": "2025-05-15T13:36:16Z"
  },
  {
    "title": "Israel intensifies Gaza war during Trump visit",
    "description": "As Donald Trump tours the Middle East without visiting Israel, Israeli forces intensified their bombardment of Gaza.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/5/15/israel-intensifies-gaza-war-during-trump-visit",
    "timestamp": "2025-05-15T13:35:37Z"
  },
  {
    "title": "Republicans’ Health Care Plan: Dr. AI Will See You Now",
    "description": "RFK Jr., Trump, and Republicans want AI to fill the gaps as they move to throw millions off Medicaid, gut funding for hospitals, and slash research.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-rfk-jr-republicans-ai-health-care-medicaid-medicare-1235340051/",
    "timestamp": "2025-05-15T13:35:36Z"
  },
  {
    "title": "Trump's Syria announcement surprised his own sanctions officials (Reuters)",
    "description": "Reuters:\nTrump's Syria announcement surprised his own sanctions officials  —  When President Donald Trump announced in Saudi Arabia on Tuesday that he would lift all sanctions on Syria, the decision, which will boost a country devastated by 13 years of war, t…",
    "link": "https://www.memeorandum.com/250515/p30",
    "timestamp": "2025-05-15T13:35:00Z"
  },
  {
    "title": "Trump wants Apple to stop building iPhones in India — just as production ramps up",
    "description": "President Donald Trump is pressuring Apple (AAPL) to pull back from India and move production to the U.S., telling CEO Tim Cook he doesn’t want iPhones “built in India.”Read more...",
    "link": "https://qz.com/apple-aapl-iphone-production-india-china-trump-tariffs-1851780779",
    "timestamp": "2025-05-15T13:35:00Z"
  },
  {
    "title": "\"Thank Trump\": What White House Official Claims Kashmiri Man Told Her",
    "description": "White House Press Secretary Karoline Leavitt claimed a Kashmiri waiter asked her to thank US President Donald Trump for the India-Pakistan ceasefire.",
    "link": "https://www.ndtv.com/world-news/thank-trump-what-white-house-karoline-leavitt-official-claims-kashmiri-man-told-her-after-india-pakistan-ceasefire-8422538",
    "timestamp": "2025-05-15T13:33:51Z"
  },
  {
    "title": "China Pauses Sanctions on US Companies in Trade War Climbdown",
    "description": "China has also suspended an export ban on critical dual-use minerals.",
    "link": "https://www.newsweek.com/china-suspends-sanctions-export-restrictions-us-companies-trump-trade-talks-2072559",
    "timestamp": "2025-05-15T13:33:40Z"
  },
  {
    "title": "US stocks open lower as trade truce rally fades, UnitedHealth falls",
    "description": "U.S. stocks are declining amid mixed economic reports, reflecting uncertainty surrounding President Trump's trade war. Retail sales fell short of expectations, while wholesale inflation showed improvement. Manufacturing appears to be contracting, but unemploy…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-as-trade-truce-rally-fades-unitedhealth-falls/articleshow/121191120.cms",
    "timestamp": "2025-05-15T13:33:20Z"
  },
  {
    "title": "Walmart Says It’s Raising Prices Because of Trump’s Tariffs",
    "description": "Walmart announced on Thursday that it is raising prices because of President Donald Trump's tariffs on China and other nations.",
    "link": "http://www.rollingstone.com/politics/politics-news/walmart-raising-prices-trump-tariffs-1235340056/",
    "timestamp": "2025-05-15T13:33:14Z"
  },
  {
    "title": "Supreme Court Will Consider Trump’s Birthright Citizenship Ban Today—And Whether His Policies Can Be Blocked Nationwide",
    "description": "The case, while about birthright citizenship, has significant implications for how Trump’s policies can be challenged in court.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/05/15/supreme-court-will-consider-trumps-birthright-citizenship-ban-today-and-whether-his-policies-can-be-blocked-nationwide/",
    "timestamp": "2025-05-15T13:32:27Z"
  },
  {
    "title": "‘Corrupt, incompetent and treasonous’: Springsteen eviscerates Trump and Musk - politico.eu",
    "description": "‘Corrupt, incompetent and treasonous’: Springsteen eviscerates Trump and Muskpolitico.eu Bruce Springsteen says Trump is running ‘rogue government’ and ‘siding with dictators’The Guardian Bruce Springsteen 'batters' Donald Trump in front of Manchester crowd a…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177524749",
    "timestamp": "2025-05-15T13:32:27Z"
  },
  {
    "title": "Ukraine Explores Bitcoin Reserve Strategy In Parliamentary Push",
    "description": "Ukraine is preparing legislation that would allow the state to accumulate and manage a strategic reserve of Bitcoin, according to Member of Parliament Yaroslav Zhelezniak, first deputy chair of the Verkhovna Rada Committee on Finance, Tax and Customs Policy. …",
    "link": "https://bitcoinist.com/ukraine-bitcoin-reserve-parliamentary-push/",
    "timestamp": "2025-05-15T13:30:39Z"
  },
  {
    "title": "Tariffs Explained: Price Hikes Loom as Trump Attempts Trade Deals",
    "description": "As tariff price hikes come closer to reality, the Trump administration has begun touting new trade deals as a way out of economic turmoil.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-price-hikes-loom-as-trump-attempts-trade-deals/",
    "timestamp": "2025-05-15T13:30:00Z"
  },
  {
    "title": "'It does nothing': Trump's 'surreal parallel universe' plan burned down on MSNBC",
    "description": "According to financial analyst Steve Rattner, Donald Trump's executive order demanding prescription drug prices must go down was a nothing-burger that is not worth the paper it was written on.Appearing on MSNBC's \"Morning Joe,\" Rattner pointed to the signing …",
    "link": "https://www.rawstory.com/trump-2672024033/",
    "timestamp": "2025-05-15T13:29:39Z"
  },
  {
    "title": "Trump presses Supreme Court on birthright citizenship ahead of oral arguments",
    "description": "Three federal district court judges have issued injunctions blocking Trump's executive order, which would end a right to birthright citizenship in many cases.",
    "link": "https://www.cnbc.com/2025/05/15/trump-supreme-court-birthright-citizenship-hearing.html",
    "timestamp": "2025-05-15T13:29:31Z"
  },
  {
    "title": "The South Stole Your Job",
    "description": "What if the whole Rust Belt decline narrative is wrong? \"There's a popular story that politicians in both parties like to tell us: The Rust Belt was a",
    "link": "https://reason.com/2025/05/15/the-south-stole-your-job/",
    "timestamp": "2025-05-15T13:28:56Z"
  },
  {
    "title": "‘Paradigm shift’: Germany says to meet Trump’s NATO spending target",
    "description": "Germany under new Chancellor Friedrich Merz surprised NATO allies on Thursday by signalling plans to massively boost defence spending to five percent of GDP as demanded by US President Donald Trump. The pledge, made by the foreign minister at NATO talks in Tu…",
    "link": "https://www.digitaljournal.com/world/paradigm-shift-germany-says-to-meet-trumps-nato-spending-target/article",
    "timestamp": "2025-05-15T13:27:33Z"
  },
  {
    "title": "Walmart warns of higher prices due to tariffs",
    "description": "Walmart on Thursday reported another solid quarter behind sales gains in the United States, but warned of higher prices and continued uncertainty over President Donald Trump’s tariffs. “We will do our best to keep our prices as low as possible but given the m…",
    "link": "https://www.digitaljournal.com/world/walmart-warns-of-higher-prices-due-to-tariffs/article",
    "timestamp": "2025-05-15T13:27:32Z"
  },
  {
    "title": "Trump bites Apple’s India plans; Infy’s Q4 bonus disappoints",
    "description": "Singapores sovereign wealth fund GIC has approached the Competition Commission of India (CCI) for approval to acquire a stake in Groww. This and more in todays ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/trump-bites-apples-india-plans-infys-q4-bonus-disappoints/articleshow/121190580.cms",
    "timestamp": "2025-05-15T13:27:32Z"
  }
]