[
  {
    "title": "U.S. Congress Proposes Funding Cuts to Colombia over President's Alleged Drug Use",
    "description": "The U.S. House Appropriations Committee expressed concerns about reports of drug abuse \"at the highest levels\" of the government of Colombia.\nThe post U.S. Congress Proposes Funding Cuts to Colombia over President’s Alleged Drug Use appeared first on Breitbar…",
    "link": "https://www.breitbart.com/latin-america/2025/07/24/u-s-congress-proposes-funding-cuts-colombia-presidents-alleged-drug-use/",
    "timestamp": "2025-07-24T17:52:02Z"
  },
  {
    "title": "Russiagate was America’s other Pearl Harbor – US senator",
    "description": "Former President Barack Obama lied to the American people and tried to sabotage Trump’s win, Senator Ted Cruz has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621957-russiagate-pearl-harbor-ted-cruz/",
    "timestamp": "2025-07-24T17:51:04Z"
  },
  {
    "title": "Countries will face tariffs ranging from 15% to 50%: Donald Trump",
    "description": "Trump's comment declaring that the tariffs would begin at 15% represented the latest twist in his effort to impose duties on nearly every US trading partner, and the latest indication that Trump was looking to more aggressively impose the levies on exports fr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/countries-will-face-tariffs-ranging-from-15-to-50-donald-trump/articleshow/122888419.cms",
    "timestamp": "2025-07-24T17:50:27Z"
  },
  {
    "title": "With his suit against Murdoch, Trump signals: No one is safe",
    "description": "Throughout President Donald Trump’s political career, Rupert Murdoch has played the role of a scold and a cheerleader. He has been a target, and frequent beneficiary, of Trump’s whims. But Trump’s recent lawsuit against the Murdoch-owned Wall Street Journal t…",
    "link": "https://freerepublic.com/focus/f-news/4330546/posts",
    "timestamp": "2025-07-24T17:50:27Z"
  },
  {
    "title": "GOP Lawmaker Insists Americans Have 'Been Over' the Epstein Case as Calls to Release Files Continue: 'We Need to Move On'",
    "description": "A Republican lawmaker insisted Americans have \"been over\" the Jeffrey Epstein case amid backlash against the Trump administration for not releasing the files.",
    "link": "https://www.ibtimes.com/gop-lawmaker-insists-americans-have-been-over-epstein-case-calls-release-files-continue-we-3779361",
    "timestamp": "2025-07-24T17:49:14Z"
  },
  {
    "title": "Appeals Court Rules Trump Attempt to End Birthright Citizenship Unconstitutional",
    "description": "Trump's executive action ignored the “ordinary meaning” of the 14th amendment, the court found.",
    "link": "https://truthout.org/articles/appeals-court-rules-trump-attempt-to-end-birthright-citizenship-unconstitutional/",
    "timestamp": "2025-07-24T17:47:37Z"
  },
  {
    "title": "It seemed that the multiracial coalition that elected Barack Obama would secure a Democratic future for this country for decades.",
    "description": "But instead, as America grows more diverse, it has become more conservative. Why?When I met Joey Gibson in the spring of 2018, I was sure he was an oddity. He was a Japanese American leader of a right-wing group in the Pacific Northwest that rallied for Donal…",
    "link": "https://freerepublic.com/focus/f-news/4330544/posts",
    "timestamp": "2025-07-24T17:46:57Z"
  },
  {
    "title": "BREAKING: CPB Gave Tax Dollars to George Soros-Backed Censorship Giant",
    "description": "It’s bad enough that the Corporation for Public Broadcasting had been funneling millions in tax dollars to leftist propaganda mills NPR and PBS over the decades. But what if we were to tell you that the CPB funded one of America's \"fact-checking\" giants backe…",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/07/24/breaking-corporation-public-broadcasting-gave-tax-soros",
    "timestamp": "2025-07-24T17:46:46Z"
  },
  {
    "title": "Portable Flaunts His Cars Amid Online Spat With Verydarkman, Declares Self New Sango Donald Trump",
    "description": "Nigerian singer Portable caught the attention of many on the internet after he shared a picture of himself posing with his two automobiles amid fight with VDM.",
    "link": "https://www.legit.ng/entertainment/celebrities/1665902-portable-flaunts-cars-online-spat-verydarkman-declares-sango-donald-trump/",
    "timestamp": "2025-07-24T17:44:53Z"
  },
  {
    "title": "Sports world reacts to Hulk Hogan’s death at 71: ‘No one will ever compare’",
    "description": "The wrestling world lost an icon Thursday.",
    "link": "https://nypost.com/2025/07/24/sports/sports-world-reacts-to-hulk-hogans-death-at-71-no-one-will-ever-compare/",
    "timestamp": "2025-07-24T17:43:16Z"
  },
  {
    "title": "Weill Cornell Moves Forward at York Ave. Site Despite Federal Cuts",
    "description": "Plans for a new research facility at Sotheby’s former HQ move forward, even as Weill Cornell navigates a billion-dollar grant freeze and tighter budgets.",
    "link": "https://www.artnews.com/art-news/news/weill-cornells-future-at-sothebys-former-headquarters-1234748185/",
    "timestamp": "2025-07-24T17:42:15Z"
  },
  {
    "title": "Exclusive: Nancy Mace Introduces Bill to Defund Painful NIH Dog and Cat Testing Following More Revelations from White Coat Waste Project",
    "description": "Rep. Nancy Mace (R-NC) on Thursday introduced a bill to defund painful National Institutes of Health (NIH) testing on dogs and cats following more revelations from taxpayer watchdog White Coat Waste Project (WCW), Breitbart News has learned.\nThe post Exclusiv…",
    "link": "https://www.breitbart.com/politics/2025/07/24/exclusive-nancy-mace-introduces-bill-to-defund-painful-nih-dog-and-cat-testing-following-more-revelations-from-white-coat-waste-project/",
    "timestamp": "2025-07-24T17:40:55Z"
  },
  {
    "title": "Yes, ‘South Park’ Went There — And It’s Glorious",
    "description": "In a moment where Hollywood and the media are gripped by fear, Trey Parker and Matt Stone stepped to the mic and dropped a balls-out critique of President Trump and Paramount",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/south-park-donald-trump-ai-penis-1235393024/",
    "timestamp": "2025-07-24T17:40:49Z"
  },
  {
    "title": "Student suspended for saying 'illegal aliens' in class gets cash, apology from school",
    "description": "A final legal settlement requires a North Carolina school district to acknowledge their inappropriate response after a student was suspended for using the term 'illegal aliens' in class.",
    "link": "https://www.foxnews.com/politics/student-suspended-saying-illegal-aliens-class-gets-cash-apology-from-school",
    "timestamp": "2025-07-24T17:39:21Z"
  },
  {
    "title": "Celebs React to Hulk Hogan's Death",
    "description": "Hollywood and the sports world are mourning the sudden death of Hulk Hogan, who passed away Thursday after going into cardiac arrest at his Florida home. Leading the tributes pouring in across social media is the WWE, which says they're \"saddened\"…\n Permalink",
    "link": "https://www.tmz.com/2025/07/24/hulk-hogan-celebrities-react-death/",
    "timestamp": "2025-07-24T17:39:18Z"
  },
  {
    "title": "Reactions Pour In After Death of Pro Wrestling Legend Hulk Hogan: ‘One of the First People I Ever Truly Admired’",
    "description": "Social media was awash with tributes to pro wrestling legend Hulk Hogan on Thursday shortly after reports of his death at 71.\nThe post Reactions Pour In After Death of Pro Wrestling Legend Hulk Hogan: ‘One of the First People I Ever Truly Admired’ first appea…",
    "link": "https://www.mediaite.com/media/entertainment/reactions-pour-in-after-death-of-pro-wrestling-legend-hulk-hogan-one-of-the-first-people-i-ever-truly-admired/",
    "timestamp": "2025-07-24T17:37:01Z"
  },
  {
    "title": "Why are data nerds racing to save US government statistics?",
    "description": "The data nerds are fighting back.",
    "link": "https://www.bostonherald.com/2025/07/24/data-nerds-fight-back/",
    "timestamp": "2025-07-24T17:35:38Z"
  },
  {
    "title": "America’s changing stages of capitalism impacted the world — Donald Trump now wants to disrupt the old economic order: Jonathan Levy",
    "description": "Professor Jonathan Levy discusses the evolution of American capitalism. He identifies distinct ages, from commerce to chaos. Donald Trump is seen as a disruptive force, potentially dismantling the existing economic order. The US questions its global economic …",
    "link": "https://economictimes.indiatimes.com/news/et-evoke/americas-changing-stages-of-capitalism-impacted-the-world-donald-trump-now-wants-to-disrupt-the-old-economic-order-jonathan-levy/articleshow/122887648.cms",
    "timestamp": "2025-07-24T17:34:05Z"
  },
  {
    "title": "US Allows Chevron to Restart Pumping Oil in Venezuela",
    "description": "The Trump administration has restored Chevron Corp.’s ability to pump oil in Venezuela, according to a person familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/us-allows-chevron-to-restart-pumping-oil-in-venezuela",
    "timestamp": "2025-07-24T17:33:51Z"
  },
  {
    "title": "Elon Musk announces plans to bring back Vine with one major difference",
    "description": "Tesla owner Elon Musk has announced his plans to bring back Vine but there's set to be one major difference",
    "link": "https://www.ladbible.com/news/technology/elon-musk-vine-ai-technology-304920-20250724",
    "timestamp": "2025-07-24T17:33:35Z"
  },
  {
    "title": "‘Scared Shitless!’ Ex-MSNBC Analyst Glenn Kirschner Says Trump Epstein Freakout Shows ‘Guilt’",
    "description": "Former federal prosecutor, ex-MSNBC legal analyst, and current video podcaster Glenn Kirschner told SiriusXM radio host Dean Obeidallah that President Donald Trump is “scared shitless” of the so-called “Epstein Files,” which shows “consciousness of guilt” on …",
    "link": "https://www.mediaite.com/media/news/scared-shitless-ex-msnbc-analyst-glenn-kirschner-says-trump-epstein-freakout-shows-guilt/",
    "timestamp": "2025-07-24T17:33:10Z"
  },
  {
    "title": "JFK's grandson Jack Schlossberg slammed GOP attempt to rename Kennedy Center after Melania Trump",
    "description": "Jack Schlossberg, grandson of John F. Kennedy, criticized efforts by U.S. House Republicans in July 2025 to rename the John F. Kennedy Center for the Performing Arts after first lady Melania Trump.",
    "link": "https://www.snopes.com//fact-check/jfk-grandson-melania-trump-opera-house-kennedy-center/",
    "timestamp": "2025-07-24T17:33:00Z"
  },
  {
    "title": "Powell's Plunge: New Home Sales Down 6.6% From A Year Ago",
    "description": "Sales of newly built single-family homes in the United States rose slightly in June but remained well below expectations, as elevated mortgage rates and affordability concerns continued to weigh on demand. The U.S. Census Bureau and the Department of Housing\n…",
    "link": "https://www.breitbart.com/economy/2025/07/24/powells-plunge-new-home-sales-down-6-6-from-a-year-ago/",
    "timestamp": "2025-07-24T17:32:44Z"
  },
  {
    "title": "Trump backs Musk as Tesla stock slides 9%: ‘I want Elon, and all businesses within our Country, to THRIVE’",
    "description": "President Donald Trump took to social media Thursday morning to support Elon Musk’s car company, a startling development given their bitter public feud.\n”I want Elon, and all businesses within our Country, to THRIVE,” Trump wrote on Truth Social.\nThe post was…",
    "link": "https://biztoc.com/x/e2aaf84603342938",
    "timestamp": "2025-07-24T17:31:57Z"
  },
  {
    "title": "James Carville Hits Back After Hunter Biden’s Profane Tirade: ‘I Ain’t Mad at You, Son’",
    "description": "James Carville offered a response to Hunter Biden after being name-dropped in a profane tirade against him, George Clooney, and other Democrats.\nThe post James Carville Hits Back After Hunter Biden’s Profane Tirade: ‘I Ain’t Mad at You, Son’ first appeared on…",
    "link": "https://www.mediaite.com/media/podcasts/james-carville-hits-back-after-hunter-bidens-profane-tirade-i-aint-mad-at-you-son/",
    "timestamp": "2025-07-24T17:30:41Z"
  },
  {
    "title": "White House Melts Down After South Park Torched Trump in Premiere Episode: 'Desperate Attempt for Attention'",
    "description": "The White House erupted after 'South Park' mocked Donald Trump in its season premiere, slamming the show as irrelevant.",
    "link": "https://www.ibtimes.com/white-house-melts-down-after-south-park-torched-trump-premiere-episode-desperate-attempt-3779360",
    "timestamp": "2025-07-24T17:30:23Z"
  },
  {
    "title": "How “The Osbournes” derailed reality",
    "description": "By giving us a living room peek into an aging rock star's life, MTV gave birth to a new age of celebrity worship.",
    "link": "https://www.salon.com/2025/07/24/how-the-osbournes-derailed-reality/",
    "timestamp": "2025-07-24T17:30:23Z"
  },
  {
    "title": "Trump: Biden Gave Away $350 Billion Worth of Equipment or Cash”",
    "description": "United States ruler Donald Trump has accused his predecessor, Joe Biden, of allowing corruption in Ukraine. Trump said that \"Biden gave away $350 billion worth of equipment or cash\" to Ukraine, and the U.S. didn't get anything in return.",
    "link": "https://www.shtfplan.com/war/trump-biden-gave-away-350-billion-worth-of-equipment-or-cash",
    "timestamp": "2025-07-24T17:30:16Z"
  },
  {
    "title": "Fed working with White House to accommodate Trump's visit",
    "description": "President Trump's visit to the Federal Reserve amid tensions over interest rates and accusations of mismanagement. The White House has criticized the Fed's building renovations, while Trump has repeatedly called for rate cuts, raising concerns about the centr…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fed-working-with-white-house-to-accommodate-trumps-visit/articleshow/122887956.cms",
    "timestamp": "2025-07-24T17:29:42Z"
  },
  {
    "title": "White House Claps Back at 'South Park' for Mocking Donald Trump in Premiere",
    "description": "The White House is firing back at \"South Park\" ... after the popular animated TV show brutally roasted Donald Trump to kick off its 27th season last night. ICYMI ... in the season premiere, Trump is shown in bed with Satan -- hinting he’s down…\n Permalink",
    "link": "https://www.tmz.com/2025/07/24/white-house-slams-south-park-donald-trump-mocked/",
    "timestamp": "2025-07-24T17:29:02Z"
  },
  {
    "title": "Experts See Echoes of the 1930s Amid Trump’s Tariff Tantrums",
    "description": "If a US-European tariff war really does kick off in earnest, the consequences could be hugely damaging.",
    "link": "https://truthout.org/articles/experts-see-echoes-of-the-1930s-amid-trumps-tariff-tantrums/",
    "timestamp": "2025-07-24T17:28:59Z"
  },
  {
    "title": "CNN's Abby Phillip Asks GOP Panelist Point-Blank Why Trump Won't 'Own Up To' Epstein Files",
    "description": "Pro-Trump commentator Scott Jennings was not picking up what Phillip was laying down.",
    "link": "https://www.huffpost.com/entry/cnn-abby-phillip-trump-epstein-files_n_68824b96e4b01be72b3e2b02",
    "timestamp": "2025-07-24T17:28:29Z"
  },
  {
    "title": "Has media freedom in the US collapsed?",
    "description": "What a merger, a settlement and a cancellation says about the future of the media under President Trump.",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/7/24/aje-onl-usa_mediacontrol_av_v33-240725",
    "timestamp": "2025-07-24T17:28:14Z"
  },
  {
    "title": "The Supreme Court Is Now Asking Judges to Do the Impossible",
    "description": "The justices expanded Donald Trump’s power yet again on Wednesday.",
    "link": "https://slate.com/news-and-politics/2025/07/supreme-court-precedent-judges-must-rule-for-trump.html",
    "timestamp": "2025-07-24T17:28:13Z"
  },
  {
    "title": "Hulk Hogan, giant of professional wrestling, dies of cardiac arrest at 71",
    "description": "Maybe the biggest star in WWE's long history, \"Hulkamania\" led to the similarly named Wrestlemania, before becoming a player in the \"Monday Night Wars.\"",
    "link": "https://fortune.com/2025/07/24/obituary-hulk-hogan-dead-cardiac-arrest-71-professional-wrestling/",
    "timestamp": "2025-07-24T17:27:51Z"
  },
  {
    "title": "Elon Admits That Tesla Is in for a World of Hurt",
    "description": "The ordeal isn't over yet for Tesla or its investors, according to CEO Elon Musk, as it misses heaps of Wall Street targets in its latest earnings report. \"We probably could have a few rough quarters,\" Musk said in a conference call on Wednesday. In the secon…",
    "link": "https://futurism.com/elon-admits-tesla-hurt",
    "timestamp": "2025-07-24T17:27:35Z"
  },
  {
    "title": "Democratic Gov. Tony Evers says he won't seek third term in battleground Wisconsin",
    "description": "Democratic Gov. Tony Evers of Wisconsin will not seek a third term in 2026, creating the first open race for governor in the battleground state in 16 years",
    "link": "https://abcnews.go.com/Politics/wireStory/democratic-gov-tony-evers-seek-term-battleground-wisconsin-124041755",
    "timestamp": "2025-07-24T17:26:48Z"
  },
  {
    "title": "Boom fades for US clean energy as Trump guts subsidies",
    "description": "Summary Policy shift risks $373 billion in clean energy investments New tax credit rules could make even fewer projects eligible for incentives Solar manufacturers concerned about demand for U.S.-made products once credits expire July 24 (Reuters) - Singapore…",
    "link": "https://freerepublic.com/focus/f-news/4330536/posts",
    "timestamp": "2025-07-24T17:26:40Z"
  },
  {
    "title": "Republican Senators Call for Special Counsel to Investigate Barack Obama",
    "description": "Senators Lindsey Graham and John Cornyn are calling for a special counsel to be appointed to investigate incendiary allegations against Barack Obama.\nThe post Republican Senators Call for Special Counsel to Investigate Barack Obama first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/republican-senators-call-for-special-counsel-to-investigate-barack-obama/",
    "timestamp": "2025-07-24T17:26:08Z"
  },
  {
    "title": "'Get out of here!' DeSantis hurls man who calls him 'pedophile' from media event",
    "description": "Things got heated during a press conference\r\n led by Florida Gov. Ron DeSantis Thursday after the event was disrupted by an individual asking about the state’s new migrant prison Alligator Alcatraz, while also labeling the governor as a “pedophile” for suppor…",
    "link": "https://www.rawstory.com/ron-desantis-2673753882/",
    "timestamp": "2025-07-24T17:25:50Z"
  },
  {
    "title": "Epstein files divide House Republicans in growing 'summer of discontent'",
    "description": "House Republicans face a growing divide over the Epstein files, creating a \"summer of discontent\" as the chamber adjourns early amid pressure from MAGA-aligned members.",
    "link": "https://www.foxnews.com/politics/epstein-files-divide-house-republicans-growing-summer-discontent",
    "timestamp": "2025-07-24T17:25:38Z"
  },
  {
    "title": "Hulk Hogan Has Died at 71",
    "description": "Hulk Hogan as died at 71, according to TMZ. The pro wrestler reportedly suffered cardiac arrest at his home in Florida.",
    "link": "http://www.thecut.com/article/hulk-hogan-died-71.html",
    "timestamp": "2025-07-24T17:24:11Z"
  },
  {
    "title": "How CISOs Can Break Through Communication Barriers",
    "description": "Also in the Forbes CIO newsletter: The problems with recognition and unclear responsibility, Trump unveils his AI policy, Alphabet beats earnings expectations.",
    "link": "https://www.forbes.com/sites/cio/2025/07/24/how-cisos-can-break-through-communication-barriers/",
    "timestamp": "2025-07-24T17:23:43Z"
  },
  {
    "title": "Tulsi Gabbard’s original mistake: She’s pushing the wrong answer to the wrong question",
    "description": "As Tulsi Gabbard's claims about Barack Obama and Donald Trump's Russia scandal fall apart, she would've been better off sticking to the \"no collusion\" line.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tulsi-gabbards-russia-hoax-mistake-s-pushing-wrong-answer-wrong-questi-rcna220828",
    "timestamp": "2025-07-24T17:23:37Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "After weeks of talks in Qatar, there have been small signs of progress.",
    "link": "https://www.bostonherald.com/2025/07/24/witkoff-cutting-short-gaza-ceasefire-talks/",
    "timestamp": "2025-07-24T17:22:25Z"
  },
  {
    "title": "White House sends mixed signals in Russia 'hoax' blame game",
    "description": "DNI Tulsi Gabbard releases documents suggesting Obama administration manufactured intelligence about Russian election interference despite evidence it didn't impact 2016 results.",
    "link": "https://www.foxnews.com/politics/white-house-sends-mixed-signals-russia-hoax-blame-game",
    "timestamp": "2025-07-24T17:22:07Z"
  },
  {
    "title": "2026 … Already?",
    "description": "With Virginia’s 45-day-long early voting window, the commonwealth is just slightly less than a month away from the beginning of the 2025 statewide election for... Read More\nThe post 2026 … Already? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/24/2026-already/",
    "timestamp": "2025-07-24T17:21:33Z"
  },
  {
    "title": "Oliver Darcy Rips CNN Execs Hurting Network With ‘Softer’ Trump Coverage",
    "description": "Darcy hit out at CNN’s leadership for hurting the network by overseeing a sluggish transition to digital and \"softer\" coverage of Trump.\nThe post Oliver Darcy Rips CNN Execs Hurting Network With ‘Softer’ Trump Coverage first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/oliver-darcy-rips-cnn-execs-hurting-network-with-softer-trump-coverage/",
    "timestamp": "2025-07-24T17:20:57Z"
  },
  {
    "title": "Trump Administration Pulls U.S. out of UNESCO -- Again -- Reversing Biden",
    "description": "The Trump administration officially withdrew from the United Nations Educational, Scientific and Cultural Organization (UNESCO) on Tuesday, reversing another policy of President Joe Biden's administration.\nThe post Trump Administration Pulls U.S. out of UNESC…",
    "link": "https://www.breitbart.com/national-security/2025/07/24/trump-administration-pulls-u-s-out-of-unesco-again-reversing-biden/",
    "timestamp": "2025-07-24T17:20:47Z"
  },
  {
    "title": "Butthurt Stephen Colbert Lashes Out After Show’s Cancellation — Starts Mocking Trump’s ‘Micropenis’ (VIDEO)",
    "description": "Late Show host Stephen Colbert is clearly taking his show’s cancellation to heart.\nThe post Butthurt Stephen Colbert Lashes Out After Show’s Cancellation — Starts Mocking Trump’s ‘Micropenis’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/butthurt-stephen-colbert-lashes-after-shows-cancellation-starts/",
    "timestamp": "2025-07-24T17:20:16Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "President Donald Trump’s special envoy Steve Witkoff says the U_S_ is cutting short Gaza ceasefire talks and bringing home its negotiating team from Qatar for consultations after the latest response from Hamas “shows a lack of desire to reach a ceasefi...",
    "link": "https://abcnews.go.com/US/wireStory/trump-envoy-witkoff-us-cutting-short-gaza-ceasefire-124042445",
    "timestamp": "2025-07-24T17:18:53Z"
  },
  {
    "title": "Hulk Hogan: The controversial wrestling legend who helped launch a global industry",
    "description": "The charismatic strongman who helped form WWE into the multibillion-dollar juggernaut it is today, and whose later life was marred by controversy, has passed away at 71, writes Ryan Coogan",
    "link": "https://www.the-independent.com/arts-entertainment/hulk-hogan-death-wwe-wrestling-obituary-b2586383.html",
    "timestamp": "2025-07-24T17:18:36Z"
  },
  {
    "title": "Elon Musk’s Net Worth Drops $17 Billion As Tesla Shares Plunge",
    "description": "Musk said his automaker “probably could have a few rough quarters” ahead as federal electric vehicle credits expire soon.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/24/elon-musks-net-worth-drops-17-billion-as-tesla-shares-plunge/",
    "timestamp": "2025-07-24T17:18:26Z"
  },
  {
    "title": "Trump backs Musk as Tesla stock slides 9%: ‘I want Elon, and all businesses within our Country, to THRIVE’",
    "description": "The day before, Tesla said revenue fell 12% and profit dropped 16% in the April-June quarter.",
    "link": "https://fortune.com/2025/07/24/trump-wants-elon-musk-to-thrive-earnings-tesla/",
    "timestamp": "2025-07-24T17:18:00Z"
  },
  {
    "title": "‘The View’s Joy Behar Declares The “Tide Is Turning” On Trump As His Supporters Question His Handling Of The Jeffrey Epstein Case",
    "description": "\"I want to see how this plays out,\" she said, adding that she's feeling \"optimistic.\"",
    "link": "https://decider.com/2025/07/24/views-joy-behar-tide-turning-trump-supporters-question-jeffrey-epstein-case/",
    "timestamp": "2025-07-24T17:17:28Z"
  },
  {
    "title": "Democratic Gov. Tony Evers Says He Won't Seek Third Term In Wisconsin",
    "description": "The battleground state hasn’t seen an open race for governor in 16 years.",
    "link": "https://www.huffpost.com/entry/tony-evers-wisconsin-governor-election-2026_n_688268b9e4b01be72b3e5a10",
    "timestamp": "2025-07-24T17:16:14Z"
  },
  {
    "title": "Hulk Hogan, wrestling superstar who helped reshape American media law, dies at 71",
    "description": "Hogan's lawsuit—and $140 million jury verdict—against Gawker Media sent shockwaves through American culture.",
    "link": "https://fortune.com/2025/07/24/hulk-hogan-obituary-wrestling-dead-71-peter-thiel-donald-trump/",
    "timestamp": "2025-07-24T17:15:45Z"
  },
  {
    "title": "How Hulk Hogan came to endorse Trump in 2024",
    "description": "Trump paid tribute to Hogan, writing he \"was MAGA all the way.\"",
    "link": "https://abcnews.go.com/Politics/hulk-hogan-endorse-trump-2024/story?id=124039602",
    "timestamp": "2025-07-24T17:15:09Z"
  },
  {
    "title": "US Justice Department to discuss Epstein with Ghislaine Maxwell",
    "description": "Talks with imprisoned ex-girlfriend of sex offender Jeffrey Epstein come as pressure mounts on Trump administration.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-justice-department-to-discuss-epstein-with-ghislaine-maxwell",
    "timestamp": "2025-07-24T17:14:56Z"
  },
  {
    "title": "Iran says it’s ready for nuclear talks with Washington but only if the U.S. rebuilds trust",
    "description": "The comments Thursday by Deputy Foreign Minister Kazem Gharibabadi come a day before talks are to be held between Tehran and European nations.",
    "link": "https://www.pbs.org/newshour/world/iran-says-its-ready-for-nuclear-talks-with-washington-but-only-if-the-u-s-rebuilds-trust",
    "timestamp": "2025-07-24T17:14:51Z"
  },
  {
    "title": "Hulk Hogan wasn’t just an American icon, he was America",
    "description": "You may not have liked Hulk Hogan, either inside the ring or out, but you can’t deny he was an American original.",
    "link": "https://sports.yahoo.com/wrestling/article/hulk-hogan-wasnt-just-an-american-icon-he-was-america-171422611.html",
    "timestamp": "2025-07-24T17:14:22Z"
  },
  {
    "title": "Hulk Hogan dies: World reacts",
    "description": "Wrestling fans are mourning the death of icon Hulk Hogan, who died on July 24 at the age of 71.",
    "link": "https://www.wftv.com/news/trending/hulk-hogan-dies-world-reacts/BRQNYNZIVZHDFJX3RE4XJKWZGE/",
    "timestamp": "2025-07-24T17:14:21Z"
  },
  {
    "title": "Senator Grassley Urges Trump to Protect Federal Employee Whistleblowers",
    "description": "Senator Charles Grassley (R-IA) issued a letter today to President Donald Trump requesting that federal employee whistleblowers be fully protected under the laws\nThe post Senator Grassley Urges Trump to Protect Federal Employee Whistleblowers appeared first o…",
    "link": "https://whistleblowersblog.org/exclusives/senator-grassley-urges-trump-to-protect-federal-employee-whistleblower/",
    "timestamp": "2025-07-24T17:14:02Z"
  },
  {
    "title": "Bevan: Progressives Won't Fold For A Centrist Without Trump Looming, No Coronation For Rahm In 2028",
    "description": "RCP co-founder Tom Bevan spoke with Emily Jashinsky on \"Afterparty\" about former Chicago Mayor Rahm Emanuel's presidential aspirations and why Democrats shouldn't count on the progressive wing of the party folding and rallying around a centrist like Rahm, as …",
    "link": "https://www.realclearpolitics.com/video/2025/07/24/tom_bevan_2028_primary_will_be_a_dogfight_progressives_wont_fold_for_a_centrist_like_they_did_in_2020.html",
    "timestamp": "2025-07-24T17:13:39Z"
  },
  {
    "title": "South Park Declares War On Donald Trump With Its Shocking Season 27 Premiere",
    "description": "South Park went full scorched earth in its season 27 premiere with a storyline that took several direct shots at Donald Trump, Paramount, and more.",
    "link": "https://www.slashfilm.com/1921066/south-park-season-27-premiere-donald-trump-war/",
    "timestamp": "2025-07-24T17:12:31Z"
  },
  {
    "title": "Trump's AI plans will strip AI of intelligence and humanity – and nobody wants this",
    "description": "President Donald Trump's latest series of Executive Orders makes it clear that his administration will do all it can to prevent future AI models from taking into consideration any form of diversity, equity, and inclusion.",
    "link": "https://www.techradar.com/ai-platforms-assistants/trumps-ai-plans-will-strip-ai-of-intelligence-and-humanity-and-nobody-wants-this",
    "timestamp": "2025-07-24T17:12:15Z"
  },
  {
    "title": "Trump envoy Witkoff says US cutting short Gaza ceasefire talks, bringing home negotiating team",
    "description": "President Donald Trump’s special envoy Steve Witkoff said Thursday the U.S. is cutting short Gaza ceasefire talks and bringing home its negotiating team from...",
    "link": "https://www.yahoo.com/news/articles/trump-envoy-witkoff-says-us-171140868.html",
    "timestamp": "2025-07-24T17:11:40Z"
  },
  {
    "title": "US mulls limited authorizations for oil firms in Venezuela, sources say",
    "description": "HOUSTON/WASHINGTON (Reuters) -U.S. President Donald Trump's administration is preparing to grant new authorizations to key partners of Venezuela's state-run ...",
    "link": "https://finance.yahoo.com/news/us-mulls-limited-authorizations-oil-171112412.html",
    "timestamp": "2025-07-24T17:11:12Z"
  },
  {
    "title": "Britain and India sign free trade pact during Modi visit",
    "description": "LONDON: Britain and India signed a free trade agreement on Thursday (Jul 24) during Indian Prime Minister Narendra Modi’s visit, marking the UK’s biggest post-Brexit trade deal and Ind",
    "link": "https://www.channelnewsasia.com/world/britain-and-india-sign-free-trade-pact-during-modi-visit-5257026",
    "timestamp": "2025-07-24T17:11:00Z"
  },
  {
    "title": "NEW POLL: Trump Hits Second-Term Low in Latest Gallup Poll, Nears All-Time Worst",
    "description": "Trump — who has falsely claimed that his approval rating is currently at its highest level ever — is actually approaching an all-time low, according to Gallup.\nThe post NEW POLL: Trump Hits Second-Term Low in Latest Gallup Poll, Nears All-Time Worst first app…",
    "link": "https://www.mediaite.com/media/news/new-poll-trump-hits-second-term-low-in-latest-gallup-poll-nears-all-time-worst/",
    "timestamp": "2025-07-24T17:10:28Z"
  },
  {
    "title": "Gaza and Ukraine are both waiting for action",
    "description": "Israel’s allies need to take concrete steps to increase pressure on the Netanyahu government.",
    "link": "https://theconversation.com/gaza-and-ukraine-are-both-waiting-for-action-261894",
    "timestamp": "2025-07-24T17:10:06Z"
  },
  {
    "title": "Trump's fossil-fueled AI Action Plan pushes deregulation",
    "description": "The Trump administration's AI Action Plan and executive orders include deregulation that would fast-track data center and chip buildouts while boosting the power grid.",
    "link": "https://www.techtarget.com/searchdatacenter/news/366628044/Trumps-fossil-fueled-AI-Action-Plan-pushes-deregulation",
    "timestamp": "2025-07-24T17:10:00Z"
  },
  {
    "title": "Governor Evers won’t seek third term in battleground Wisconsin",
    "description": "Wisconsin’s Democratic governor, Tony Evers, announced Thursday that he will not seek a third term in 2026, creating the first open race for governor in the battleground state in 16 years.",
    "link": "https://www.fox6now.com/news/governor-evers-wont-seek-third-term-wisconsin",
    "timestamp": "2025-07-24T17:08:34Z"
  },
  {
    "title": "Trump Has Lost The QAnon Shaman",
    "description": "Donald Trump is losing some of his biggest supporters - and it is unknown if they will come back or if the tide really is turning. Jacob Chansley (also known as the QAnon shaman) is apparently furious at Donald Trump - replying to a post of Trump’s 2023 mugsh…",
    "link": "https://crooksandliars.com/2025/07/trump-has-lost-qanon-shaman",
    "timestamp": "2025-07-24T17:07:12Z"
  },
  {
    "title": "Linda McMahon Is An Idiot, Part Infinity",
    "description": "Education Secretary Linda McMahon took a victory lap over Columbia University, who paid a bribe\r\n reached a deal with the Trump administration to pay more than $220 million to the federal government so Trump would restore federal research money that was cance…",
    "link": "https://crooksandliars.com/2025/07/linda-mcmahon-left-big-part-out-about",
    "timestamp": "2025-07-24T17:07:11Z"
  },
  {
    "title": "Trump threatens to escalate trade war with new round of tariffs up to 50%",
    "description": "Speaking at an AI summit in Washington, Trump laid out his latest tariff plans, describing them as “reciprocal” duties ahead of an Aug. 1 deadline.",
    "link": "https://nypost.com/2025/07/24/business/trump-threatens-to-escalate-trade-war-with-new-round-of-tariffs-up-to-50/",
    "timestamp": "2025-07-24T17:07:10Z"
  },
  {
    "title": "Could climate anxiety be a form of pre-traumatic stress disorder? A psychologist explains the research",
    "description": "Climate anxiety is not yet officially recognised as a mental disorder, but it’s a natural fear response.",
    "link": "https://theconversation.com/could-climate-anxiety-be-a-form-of-pre-traumatic-stress-disorder-a-psychologist-explains-the-research-260849",
    "timestamp": "2025-07-24T17:06:32Z"
  },
  {
    "title": "Wrestling superstar Hulk Hogan dies age 71",
    "description": "WWE: 'One of pop culture’s most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s'",
    "link": "https://www.wnd.com/2025/07/wrestling-superstar-hulk-hogan-dies-age-71/",
    "timestamp": "2025-07-24T17:05:51Z"
  },
  {
    "title": "Wisconsin Gov. Tony Evers won't run for re-election in 2026",
    "description": "Wisconsin Democratic Gov. Tony Evers' decision not to seek a third term will set off a wide open race to replace him in the closely divided battleground state.",
    "link": "https://www.nbcnews.com/politics/2026-election/wisconsin-gov-tony-evers-wont-run-re-election-rcna220797",
    "timestamp": "2025-07-24T17:05:25Z"
  },
  {
    "title": "Pro-Trump Tech Billionaire Palmer Luckey Considers Offering Laptops Made in the USA",
    "description": "Palmer Luckey, the founder of military tech firm Anduril Industries and a VR innovator once fired by Mark Zuckerberg for supporting Donald Trump, is considering entering the laptop market with a fully American-made product.\nThe post Pro-Trump Tech Billionaire…",
    "link": "https://www.breitbart.com/tech/2025/07/24/pro-trump-tech-billionaire-palmer-luckey-considers-offering-laptops-made-in-the-usa/",
    "timestamp": "2025-07-24T17:01:36Z"
  },
  {
    "title": "UK and India sign free trade agreement during Modi visit",
    "description": "The two countries hope the accord will boost trade between them by 25.5 billion pounds.",
    "link": "https://www.aljazeera.com/news/2025/7/24/uk-and-india-sign-free-trade-agreement-during-modi-visit",
    "timestamp": "2025-07-24T17:01:16Z"
  },
  {
    "title": "Trump, Epstein and a Doodle: The birthday letter that set off a political firestorm - that is burning MAGA",
    "description": "A 2003 birthday scrapbook for Jeffrey Epstein, featuring a nude sketch and a cryptic note allegedly signed by Donald Trump, has ignited a political firestorm. The Wall Street Journal's publication of the note led to a $20 billion lawsuit from Trump, who denie…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-epstein-and-a-doodle-the-birthday-letter-that-set-off-a-political-firestorm-that-is-burning-maga/articleshow/122886274.cms",
    "timestamp": "2025-07-24T17:00:48Z"
  },
  {
    "title": "Anchorage Digital announces stablecoin issuance platform on GENIUS' heels",
    "description": "Digital asset service company Anchorage Digital has launched a stablecoin issuance platform after the GENIUS stablecoin bill became law in the United States.",
    "link": "https://cointelegraph.com/news/anchorage-digital-stablecoin-platform-genius-signing",
    "timestamp": "2025-07-24T17:00:48Z"
  },
  {
    "title": "U.S. Senate has ‘different ideas’ about crypto bill – Why it’s delaying progress",
    "description": "Will the Congress beat the September deadline and pass a crypto market structure bill?",
    "link": "https://ambcrypto.com/senate-has-different-ideas-about-crypto-bill-why-its-delaying-progress/",
    "timestamp": "2025-07-24T17:00:40Z"
  },
  {
    "title": "Hulk Hogan dies aged 71",
    "description": "Hulk Hogan, the WWE wrestler and ally of President Donald Trump, has died at the age of 71. Hogan suffered a cardiac arrest and emergency responders were called to his home in Clearwater, Florida where they were unable to revive him, according to TMZ. The for…",
    "link": "https://freerepublic.com/focus/f-news/4330530/posts",
    "timestamp": "2025-07-24T16:59:08Z"
  },
  {
    "title": "WH may have allowed Chevron to pump oil in Venezuela",
    "description": "The administration of United States President Donald Trump has supposedly given a license to Chevron Corporation to resume pumping oil in Venezuela after revoking it earlier this year, the Wall Street...",
    "link": "https://biztoc.com/x/8b5557d987c21193",
    "timestamp": "2025-07-24T16:58:36Z"
  },
  {
    "title": "Trump offers support to Tesla in surprising post after results send stock lower",
    "description": "U.S. President Donald Trump took to social media Thursday morning to support Elon Musk’s car company, a startling development given their bitter public feud.\n“I want Elon, and all businesses within our Country, to THRIVE,” Trump wrote on Truth Social.",
    "link": "https://biztoc.com/x/fd088c38682974f7",
    "timestamp": "2025-07-24T16:58:24Z"
  },
  {
    "title": "Trump Dredges Up the Russian Oil Fight",
    "description": "Familiar partners face familiar grievances—with more threats and unpredictability.",
    "link": "http://foreignpolicy.com/2025/07/24/trump-rutte-graham-russian-oil-india-brazil-china/",
    "timestamp": "2025-07-24T16:58:21Z"
  },
  {
    "title": "This Satan Scene In \"South Park's\" New Trump Episode Is Being Called \"Pure Magic\"",
    "description": "\"High art.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/south-park-trump-episode",
    "timestamp": "2025-07-24T16:58:18Z"
  },
  {
    "title": "‘Fourth-Rate Show’: Trump White House Rages at ‘South Park’ Over Searing Satire",
    "description": "Parker and Stone also explicitly roasted Paramount for settling a recent lawsuit with Trump and for cancelling late-night host Stephen Colbert\nThe post ‘Fourth-Rate Show’: Trump White House Rages at ‘South Park’ Over Searing Satire first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fourth-rate-show-trump-white-house-rages-at-south-park-over-searing-satire/",
    "timestamp": "2025-07-24T16:57:11Z"
  },
  {
    "title": "Slog AM: City Council Ghosts the Renters Commission, the State GOP Is Trying to Suppress the Vote, Trump's in the Epstein Files",
    "description": "The Stranger's Morning News Roundup.\n \n by Marcus Harrison Green\n \n \n \n Today's weather is mostly sunny with a high near 78, which means half our fair city will pretend it’s a heatwave while the other half will refuse to give up their Patagonia fleece.\nTrump …",
    "link": "https://www.thestranger.com/slog-am/2025/07/24/80163610/slog-am-city-council-ghosts-the-renters-commission-the-state-gop-is-trying-to-suppress-the-vote-trumps-in-the-epstein-files",
    "timestamp": "2025-07-24T16:57:00Z"
  },
  {
    "title": "Trump overheard in vulgar Oval Office panic over Epstein",
    "description": "President Donald Trump is reportedly in full panic mode, using profanity during a heated Oval Office moment as pressure mounts over his ties to Jeffrey Epstein, according to an inside source who spoke with Politico\r\n.“They’re going to accuse me of some funny …",
    "link": "https://www.rawstory.com/trump-2673753778/",
    "timestamp": "2025-07-24T16:56:23Z"
  },
  {
    "title": "Wallets Linked to Trump-Affiliated World Liberty Financial (WLFI) Add $36,767,736 Worth of Ethereum: Report",
    "description": "The Trump-affiliated decentralized finance (DeFi) project World Liberty Financial (WLFI) has been on an Ethereum-buying spree. On-chain analyst Ai tells their 102,900 followers on the social media platform X that three WLFI addresses accumulated 10,013.54 Eth…",
    "link": "https://dailyhodl.com/2025/07/24/wallets-linked-to-trump-affiliated-world-liberty-financial-wlfi-add-36767736-worth-of-ethereum-report/",
    "timestamp": "2025-07-24T16:55:15Z"
  },
  {
    "title": "US wrestling icon Hulk Hogan dies at 71",
    "description": "Hogan helped elevate US wrestling to a global phenomenon during the 1980s with his flair and bravado.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-wrestling-icon-hulk-hogan-dies-at-71",
    "timestamp": "2025-07-24T16:54:42Z"
  },
  {
    "title": "Fed prepares for Trump visit as tensions with White House escalate",
    "description": "WASHINGTON: The US Federal Reserve said on Thursday (Jul 24) it is working with the White House to accommodate President Donald Trump's visit to the central bank’s Washington headquarters, a",
    "link": "https://www.channelnewsasia.com/world/fed-prepares-trump-visit-tensions-white-house-escalate-5257001",
    "timestamp": "2025-07-24T16:54:00Z"
  },
  {
    "title": "US fertility rate drops to a new low, CDC data finds",
    "description": "The US birth rate has fluctuated over the years and can be influenced by factors such as economic stability.",
    "link": "https://www.aljazeera.com/news/2025/7/24/us-fertility-rate-drops-to-a-new-low-cdc-data-finds",
    "timestamp": "2025-07-24T16:53:15Z"
  },
  {
    "title": "Trump’s White House Throws Hissy Fit In Response To ‘South Park’ Portrayal Of Him And His ‘Teeny-Tiny Manhood’",
    "description": "President Trump’s White House has issued a statement in response to how he was portrayed on the iconic animated series South Park. The season 27 premiere of the long-running Comedy Central series portrayed Trump as having a “teeny-tiny” manhood and literally …",
    "link": "https://brobible.com/culture/article/trump-white-house-responds-to-south-park/",
    "timestamp": "2025-07-24T16:53:04Z"
  }
]