[
  {
    "title": "Trump tariffs jolt Asian automakers — Toyota likely set for most pain",
    "description": "Newly announced U.S. tariffs on auto imports have rattled Asian automakers, pressuring companies ahead of the implementation of the duties later in the week.\nU.S. President Donald Trump last Wednesday announced sweeping 25% tariffs on cars \"not made in the U.…",
    "link": "https://biztoc.com/x/687719e55d08cc41",
    "timestamp": "2025-04-01T01:06:50Z"
  },
  {
    "title": "Trump’s attempt to revamp elections with proof of citizenship requirement challenged in court | CNN Politics",
    "description": "Democratic groups and non-partisan organizations sued Monday over an executive order targeting election procedures signed last week by President Donald Trump, kicking off two separate court fights over Trump’s attempt to unilaterally revamp how elections are …",
    "link": "https://www.cnn.com/2025/03/31/politics/elections-proof-of-citizenship-order-challenged-lawsuits/index.html",
    "timestamp": "2025-04-01T01:05:40Z"
  },
  {
    "title": "Trump has dubbed April 2 'Liberation Day' for his tariffs. Here's what to expect",
    "description": "As the trade wars launched by U.S. President Donald Trump continue to escalate, all eyes are on Wednesday.",
    "link": "https://www.ksat.com/news/politics/2025/03/31/trump-has-dubbed-april-2-liberation-day-for-tariffs-heres-what-to-expect/",
    "timestamp": "2025-04-01T01:00:39Z"
  },
  {
    "title": "First Oil And Gas Lease Sales On Public Lands Yield Nearly $40,000,000 In Early Win For Trump Administration",
    "description": "The Bureau of Land Management (BLM) leased 34 parcels, amounting to 25,038 acres, for a total of $39,007,609 in the first quarter of 2025, the press release stated. The bonus bids and rentals from the leases are set to be distributed between the states and fe…",
    "link": "https://wattsupwiththat.com/2025/03/31/first-oil-and-gas-lease-sales-on-public-lands-yield-nearly-40000000-in-early-win-for-trump-administration/",
    "timestamp": "2025-04-01T01:00:00Z"
  },
  {
    "title": "Oil Holds Hefty Advance With Trump Sanctions, Tariffs in Focus",
    "description": "Oil steadied after jumping on Monday as President Donald Trump suggested that the US may work to curtail crude shipments from Russia, the world’s third-largest producer and a major exporter.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-hefty-advance-with-trump-sanctions-tariffs-in-focus",
    "timestamp": "2025-04-01T00:59:49Z"
  },
  {
    "title": "Trump tariffs jolt Asian automakers — Toyota likely set for most pain",
    "description": "U.S. President Donald Trump last Wednesday announced sweeping 25% tariffs on cars \"not made in the U.S.,\" sending shockwaves through global automakers.",
    "link": "https://www.cnbc.com/2025/04/01/trump-tariffs-jolt-asian-automakers-shares-extend-slide.html",
    "timestamp": "2025-04-01T00:59:43Z"
  },
  {
    "title": "How did the CBA share price hold up during the March market turmoil?",
    "description": "Did you catch what happened with the CBA share price in March?\nThe post How did the CBA share price hold up during the March market turmoil? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/01/how-did-the-cba-share-price-hold-up-during-the-march-market-turmoil/",
    "timestamp": "2025-04-01T00:59:41Z"
  },
  {
    "title": "Democrat Talking As Long as He's 'Physically Able' to Protest Trump",
    "description": "Senator Cory Booker has taken to the Senate floor Monday night to protest both Trump and Elon Musk.",
    "link": "https://www.newsweek.com/democrat-talking-long-hes-physically-able-protest-trump-2053378",
    "timestamp": "2025-04-01T00:59:27Z"
  },
  {
    "title": "DHS Secretary Kristi Noem confident her agency is only removing 'criminals' from the US",
    "description": "DHS Secretary Kristi Noem discusses her visit to El Salvador and Mexico and the Trump administration's deportation efforts on 'Special Report.'",
    "link": "https://www.foxnews.com/media/dhs-secretary-kristi-noem-confident-her-agency-only-removing-criminals-from-us",
    "timestamp": "2025-04-01T00:59:05Z"
  },
  {
    "title": "Elon Musk Says He’s Paid Ashley St. Clair Millions, Even Though He …",
    "description": "Reading Time: 3 minutesElon Musk has been clashing with the mother of his 13th child.\nElon Musk Says He’s Paid Ashley St. Clair Millions, Even Though He … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/03/elon-musk-says-hes-paid-ashley-st-clair-millions-even-though-he-doesnt-know-if-hes-the-father-of-her-child/",
    "timestamp": "2025-04-01T00:57:09Z"
  },
  {
    "title": "Sen. Moreno Introduces Bill Allowing Taxpayers to Write Off Interest on U.S.-Made Car Loans",
    "description": "Sen. Bernie Moreno (R-OH) is introducing legislation that would fulfill President Donald Trump's promise to allow people to write off interest on vehicles that are manufactured in the United States.\nThe post Sen. Moreno Introduces Bill Allowing Taxpayers to W…",
    "link": "https://www.breitbart.com/politics/2025/03/31/moreno-senate-bill-taxpayers-writeoff-interest-u-s-car-loans/",
    "timestamp": "2025-04-01T00:55:48Z"
  },
  {
    "title": "Trump reveals what caused Don Jr.'s divorce from Vanessa and how Tiger Woods broke news of romance",
    "description": "President Donald Trump blamed Donald Jr.'s Russia meeting for the breakdown of his marriage to ex-wife Vanessa, even as he gave his blessing for his former daughter-in-law's relationship with Tiger Woods. Earlier this month, DailyMail.com exclusively broke th…",
    "link": "https://freerepublic.com/focus/f-chat/4308021/posts",
    "timestamp": "2025-04-01T00:54:18Z"
  },
  {
    "title": "Trump ‘would love’ facing Obama in third-term showdown",
    "description": "President Donald Trump said he “would love” to run against former President Barack Obama for a third term. On Monday, while signing executive orders, Trump was asked by a reporter if “there was a thought” the Democratic Party could run Obama against him if he…",
    "link": "https://freerepublic.com/focus/f-bloggers/4308020/posts",
    "timestamp": "2025-04-01T00:53:20Z"
  },
  {
    "title": "Trump's War on the Press",
    "description": "The president is arguing in court that journalism he doesn't like is \"election interference\" that constitutes consumer fraud.",
    "link": "https://reason.com/2025/04/01/trumps-war-on-the-press/",
    "timestamp": "2025-04-01T00:51:40Z"
  },
  {
    "title": "Why Donald Trump cannot run for US presidency again in 2028",
    "description": "US News: US President Trump has mused more than once that he might like to extend his stay at the White House.",
    "link": "https://timesofindia.indiatimes.com/world/us/why-donald-trump-cannot-run-for-us-presidency-again-in-2028/articleshow/119835093.cms",
    "timestamp": "2025-04-01T00:49:37Z"
  },
  {
    "title": "US automakers lobby to exclude low-cost parts from tariffs",
    "description": "Trump's levies will tax auto parts made abroad, on top of 25 per cent tariffs on fully built vehicles.  Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/us-automakers-lobby-to-exclude-low-cost-parts-from-tariffs",
    "timestamp": "2025-04-01T00:48:41Z"
  },
  {
    "title": "‘It’s Silly And It’s Stupid And It Doesn’t Work’: Reagan Economist Blasts Proposed Tax Hikes",
    "description": "Former Reagan economist Art Laffer said on Fox Business Monday that the proposed tax hike is both ineffectual and politically misguided.",
    "link": "https://dailycaller.com/2025/03/31/art-laffer-proposed-tax-hike/",
    "timestamp": "2025-04-01T00:46:22Z"
  },
  {
    "title": "President Trump Reacts To Tiger Woods And Vanessa Trump Dating",
    "description": "In some spicy developments, legendary golfer Tiger Woods is now dating Vanessa Trump, and President Donald Trump has reacted to the news.",
    "link": "https://dailycaller.com/2025/03/31/donald-trump-tiger-woods-vanessa-trump-dating-relationship/",
    "timestamp": "2025-04-01T00:45:33Z"
  },
  {
    "title": "Albanese won't budge on key US grievances, as Trump's 'liberation day' looms",
    "description": "An updated list of grievances published by the United States trade office has set its sights on Australia's pharmaceutical sector, biosecurity protections and laws requiring the social media giants to pay for news.",
    "link": "https://www.abc.net.au/news/2025-04-01/election-2025-albanese-tariff-trump-biosecurity-exemption/105121156",
    "timestamp": "2025-04-01T00:42:21Z"
  },
  {
    "title": "Trump Administration Probes Harvard Antisemitism: $9 Billion in Federal Funds at Risk",
    "description": "The Trump administration announced Monday that it is probing Harvard University over its chronic problems with antisemitism, placing nearly $9 billion in federal grants at risk at the nation's most elite academic institution.\nThe post Trump Administration Pro…",
    "link": "https://www.breitbart.com/education/2025/03/31/trump-administration-probes-harvard-antisemitism-9-billion-in-federal-funds-at-risk/",
    "timestamp": "2025-04-01T00:39:07Z"
  },
  {
    "title": "Trump administration to freeze family-planning funds for Planned Parenthood",
    "description": "Planned Parenthood said that nine of its affiliates received notice that funding would be withheld under a program known as Title X, which has supported...",
    "link": "https://ca.news.yahoo.com/trump-administration-freeze-family-planning-003659625.html",
    "timestamp": "2025-04-01T00:36:59Z"
  },
  {
    "title": "Federal judge postpones DHS’s attempt to end Temporary Protected Status for Venezuelans",
    "description": "A federal judge ordered to postpone DHS Secretary Kristi Noem's order to terminate the temporary protected status of hundreds of thousands of Venezuelan migrants.",
    "link": "https://www.foxnews.com/politics/federal-judge-postpones-dhss-attempt-end-temporary-protected-status-venezuelans",
    "timestamp": "2025-04-01T00:35:39Z"
  },
  {
    "title": "Cory Booker launches marathon Senate speech (Jordain Carney/Politico)",
    "description": "Jordain Carney / Politico:\nCory Booker launches marathon Senate speech  —  Sen. Cory Booker is planning to hold the Senate floor for as long as he can in an effort to protest actions by President Donald Trump and congressional Republicans.  The New Jersey Dem…",
    "link": "https://www.memeorandum.com/250331/p136",
    "timestamp": "2025-04-01T00:35:01Z"
  },
  {
    "title": "NEW! Federal Judge Blocks Trump Admin From Firing Intel Agency Officials Who Worked on DEI Programs",
    "description": "A federal judge on Monday blocked the Trump Administration from firing intel agency officials who worked on DEI programs. US District Judge Anthony Trenga, a George W. Bush appointee, said the fired officials are entitled to appeal the firings and seek reassi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4308015/posts",
    "timestamp": "2025-04-01T00:34:40Z"
  },
  {
    "title": "U.S. aid response in Myanmar faces hurdles after staff cuts",
    "description": "Response hobbled by the huge fund cuts, contractor terminations and plans to fire nearly all USAID staff, source says.",
    "link": "https://www.japantimes.co.jp/news/2025/04/01/asia-pacific/politics/us-aid-myanmar-staff-cuts/",
    "timestamp": "2025-04-01T00:34:00Z"
  },
  {
    "title": "Lindsey Graham Dodges Third Term Question After Trump Makes It Amply Clear He's Not Joking About It",
    "description": "Sen. Lindsey Graham (R-S.C.) avoided answering a question on Monday about whether President Donald Trump could pursue a third term in office. \nWhat Happened: When asked by a reporter if Trump could run again, Graham replied, \"Ask me in '27,\" before leaving th…",
    "link": "https://biztoc.com/x/125ecc1c73d046f4",
    "timestamp": "2025-04-01T00:33:54Z"
  },
  {
    "title": "S Korea factory activity shrinks as output falls, but export orders jump, PMI shows",
    "description": "SEOUL : South Korea's factory activity shrank for a second straight month in March as output fell on weak domestic demand even as export orders jumped at the fastest pace in 14 months, a private survey showed on Tuesday.The Purchasing Managers Index (PMI) for…",
    "link": "https://www.channelnewsasia.com/business/s-korea-factory-activity-shrinks-output-falls-export-orders-jump-pmi-shows-5036281",
    "timestamp": "2025-04-01T00:33:26Z"
  },
  {
    "title": "Trump has dubbed April 2 'Liberation Day' for his tariffs. Here's what to expect",
    "description": "As the trade wars launched by U.S. President Donald Trump continue to escalate, all eyes are on Wednesday.",
    "link": "https://www.clickorlando.com/news/politics/2025/03/31/trump-has-dubbed-april-2-liberation-day-for-tariffs-heres-what-to-expect/",
    "timestamp": "2025-04-01T00:33:25Z"
  },
  {
    "title": "Introducing the Crikey Eggheads: Our panel of undecided voters from across the country",
    "description": "Undecided Crikey voters tell us what's on their mind — and what might sway their vote.\nThe post Introducing the Crikey Eggheads: Our panel of undecided voters from across the country appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/04/01/federal-election-undecided-voters-australia-crikey-eggheads/",
    "timestamp": "2025-04-01T00:33:24Z"
  },
  {
    "title": "Safely back on Earth, once-stranded US astronauts ready to fly again",
    "description": "After spending more than nine months stranded in space, two American astronauts confirmed Monday that they’re ready to blast off again aboard a Boeing Starliner, the very spacecraft that could not return them to Earth. In their first NASA press conference sin…",
    "link": "https://www.digitaljournal.com/world/safely-back-on-earth-once-stranded-us-astronauts-ready-to-fly-again/article",
    "timestamp": "2025-04-01T00:33:18Z"
  },
  {
    "title": "The Makeup Artist Donald Trump Deported Under the Alien Enemies Act",
    "description": "Donald Trump has invoked the Alien Enemies Act to send Venezuelans to prison without due process. Among them is a thirty-one-year-old makeup artist whose only crime is having the wrong tattoos. Jonathan Blitzer reports.",
    "link": "https://www.newyorker.com/news/annals-of-immigration/the-makeup-artist-donald-trump-deported-under-the-alien-enemies-act",
    "timestamp": "2025-04-01T00:32:18Z"
  },
  {
    "title": "Trump administration reviewing alleged antisemitism at Harvard University",
    "description": "The Department of Education and other agencies are reviewing Harvard University for fostering antisemitism on its campus, Secretary Linda McMahon said Monday.",
    "link": "https://abcnews.go.com/Politics/trump-administration-reviewing-alleged-antisemitism-harvard-university/story?id=120348597",
    "timestamp": "2025-04-01T00:30:35Z"
  },
  {
    "title": "CNBC Daily Open: Stocks were trounced in the first quarter amid Trump tariff chaos",
    "description": "U.S. stocks took a heavy beating during the first quarter of the year. But the second could be much more treacherous.",
    "link": "https://www.cnbc.com/2025/04/01/cnbc-daily-open-stocks-slumped-in-first-quarter-amid-trump-tariffs-.html",
    "timestamp": "2025-04-01T00:28:47Z"
  },
  {
    "title": "Fix the Subways in Hours?",
    "description": "Donald Trump famously said he could end the war in Ukraine in 24 hours, yet the war is still raging more than two months after he took office. In the same way, Transportation Secretary Sean Duffy recently said that New York City could solve all of the problem…",
    "link": "http://www.newgeography.com/content/008488-fix-subways-hours",
    "timestamp": "2025-04-01T00:28:39Z"
  },
  {
    "title": "US, Japan ‘Stand Firmly Together’ in the Face of Aggressive Chinese Actions",
    "description": "U.S. Defense Secretary Pete Hegseth said this week that Japan would be \"on the front lines of any contingency we might face in the western Pacific.\"",
    "link": "https://thediplomat.com/2025/04/us-japan-stand-firmly-together-in-the-face-of-aggressive-chinese-actions/",
    "timestamp": "2025-04-01T00:27:42Z"
  },
  {
    "title": "South Korea March exports rise for second month, misses expectations",
    "description": "SEOUL : South Korea's March exports grew for a second month but missed market expectations, as a global trade war triggered by U.S. President Donald Trump's tariffs raises uncertainty for manufacturers, government data showed on Tuesday.Outbound shipments fro…",
    "link": "https://www.channelnewsasia.com/business/south-korea-march-exports-rise-second-month-misses-expectations-5036276",
    "timestamp": "2025-04-01T00:27:17Z"
  },
  {
    "title": "Jeffrey Goldberg: Allies Will Keep Valuable Intelligence from 'Reckless' Trump",
    "description": "Monday, on CNN's \"The Lead,\" Jeffrey Goldberg, editor-in-chief of The Atlantic, claimed European allies would hold back intelligence sharing because of the Trump administration's \"reckless\" Signal chat among senior national security officials.\nThe post Jeffre…",
    "link": "https://www.breitbart.com/clips/2025/03/31/jeffrey-goldberg-allies-will-keep-valuable-intelligence-from-reckless-trump/",
    "timestamp": "2025-04-01T00:26:26Z"
  },
  {
    "title": "Fox’s Turley Says Trump’s Talk About a ‘Third Term’ Makes JD Vance Look Like ‘Mini-Me’",
    "description": "Fox News legal analyst Jonathan Turley pumped the brakes on President Donald Trump's talk about running for a third term, which is constitutionally prohibited.\nThe post Fox’s Turley Says Trump’s Talk About a ‘Third Term’ Makes JD Vance Look Like ‘Mini-Me’ fir…",
    "link": "https://www.mediaite.com/tv/foxs-turley-says-trumps-talk-about-a-third-term-makes-jd-vance-look-like-mini-me/",
    "timestamp": "2025-04-01T00:24:26Z"
  },
  {
    "title": "Vance Demands Denmark Bolster Greenland Security",
    "description": "Vice President JD Vance said that Denmark “hasn’t done a good job at keeping Greenland safe” as he toured a military facility in Greenland on Friday afternoon, as President Donald Trump reiterated his desire for the US to take control of the remote and resour…",
    "link": "https://biztoc.com/x/6720137642b121e8",
    "timestamp": "2025-04-01T00:22:33Z"
  },
  {
    "title": "Why British bosses still love DEI",
    "description": "It will take more than Trump's war on woke to dislodge identity politics from the workplace.",
    "link": "https://www.spiked-online.com/2025/04/01/why-british-bosses-still-love-dei/",
    "timestamp": "2025-04-01T00:20:14Z"
  },
  {
    "title": "Trump threatens $9 bn in Harvard funding over 'anti-Semitism'",
    "description": "The US government will review $9 billion of funding for Harvard University over alleged anti-Semitism on campus, authorities said Monday, after it cut millions from Columbia University, which has also seen fierce pro-Palestinian student protests.President Don…",
    "link": "https://www.rawstory.com/trump-harvard/",
    "timestamp": "2025-04-01T00:18:06Z"
  },
  {
    "title": "Supernatural, The Boys Star Shares \"Trans Day of Visibility\" Message",
    "description": "It was a little more than a month ago when Supernatural fans got the word that Jared Padalecki and Misha Collins would be reuniting with their SPN family member Jensen Ackles (Soldier Boy) in the cast of the fifth and final season of Prime Video and Showrunne…",
    "link": "https://bleedingcool.com/tv/supernatural-the-boys-star-shares-trans-day-of-visibility-message/",
    "timestamp": "2025-04-01T00:17:08Z"
  },
  {
    "title": "Americans are spending less as they brace for new tariffs",
    "description": "Americans are tapping the brakes on spending - pulling back on dining out, hotel stays and other expenses - ahead of new tariffs and continued economic...",
    "link": "https://washingtonpost.com/business/2025/03/31/tariffs-affect-consumer-spending/",
    "timestamp": "2025-04-01T00:16:35Z"
  },
  {
    "title": "Japan business mood slumps to 1-year low on Trump tariff uncertainty",
    "description": "TOKYO :Big Japanese manufacturers' business sentiment worsened to a one-year low in the three months to March, a central bank survey showed on Tuesday, a sign escalating trade tensions were already taking a toll on the export-reliant economy.The gloom contras…",
    "link": "https://www.channelnewsasia.com/business/japan-business-mood-slumps-1-year-low-trump-tariff-uncertainty-5036261",
    "timestamp": "2025-04-01T00:15:54Z"
  },
  {
    "title": "Japan business mood worsens as Trump tariff uncertainty lingers",
    "description": "TOKYO : Business sentiment among big Japanese manufacturers worsened in the three months to March, a central bank survey showed on Tuesday, a sign escalating trade tensions were already taking a toll on the export-reliant economy.The survey, compiled before U…",
    "link": "https://www.channelnewsasia.com/business/japan-business-mood-worsens-trump-tariff-uncertainty-lingers-5036261",
    "timestamp": "2025-04-01T00:15:54Z"
  },
  {
    "title": "Japan business mood worsens as Trump tariff uncertainty lingers",
    "description": "Business sentiment among big Japanese manufacturers worsened in the three months to March, a central bank survey showed on Tuesday, a sign escalating trade...",
    "link": "https://finance.yahoo.com/news/japan-business-mood-worsens-trump-001554985.html",
    "timestamp": "2025-04-01T00:15:54Z"
  },
  {
    "title": "Appeals court won't delay block on US military's transgender ban",
    "description": "A U.S. appeals court on Monday denied a request by the Trump administration to pause a lower court's decision blocking President Donald Trump's ban on...",
    "link": "https://www.yahoo.com/news/appeals-court-wont-delay-block-001550846.html",
    "timestamp": "2025-04-01T00:15:50Z"
  },
  {
    "title": "Trump says will be 'kind' with tariffs as deadline looms",
    "description": "WASHINGTON: US President Donald Trump said Monday (Mar 31) he would be \"very kind\" to trading partners when he unveils further tariffs this week, risking global turmoil to address what he says are unfair trade imbalances. Trump - who has been making unprecede…",
    "link": "https://www.channelnewsasia.com/world/us-president-donald-trump-says-kind-tariffs-deadline-5036226",
    "timestamp": "2025-04-01T00:13:26Z"
  },
  {
    "title": "Trump 'happy' that Tiger Woods is dating former daughter-in-law",
    "description": "Donald Trump said Monday he hopes Tiger Woods and his former daughter-in-law will be happy together in their relationship, describing the golf superstar as \"a fantastic guy.\"Woods -- renowned for guarding his private life over the years -- last week confirmed…",
    "link": "https://www.rawstory.com/tiger-woods-trump/",
    "timestamp": "2025-04-01T00:12:21Z"
  },
  {
    "title": "The flaws in Musk’s Mars mission",
    "description": "In his speech to Congress last month, President Donald Trump promised to “lead humanity into space and plant the American flag on the planet Mars and even far beyond”. His claim is not serious, as Trump is far too busy wrecking the global liberal order to ach…",
    "link": "https://biztoc.com/x/db167c94463ae46a",
    "timestamp": "2025-04-01T00:12:03Z"
  },
  {
    "title": "Trump's tariffs could cause a recession, experts say. Here's how",
    "description": "Trump's tariffs could cause a recession, experts say. Here's how.\nTrump is set to unveil tariffs on April 2, which he has dubbed \"liberation day.\"\nU.S. stocks seesawed between gains and losses on Monday in the lead up to a promised fresh round of President Do…",
    "link": "https://biztoc.com/x/ec8c40a3d63e5efe",
    "timestamp": "2025-04-01T00:12:00Z"
  },
  {
    "title": "EXCLUSIVE: GOP Sens Seek Answers For Taxpayers Who Picked Up Tab For Biden’s DEI Initiatives",
    "description": "'The taxpayer deserves to know'",
    "link": "https://dailycaller.com/2025/03/31/exclusive-gop-sens-seek-answers-for-taxpayers-who-picked-up-tab-for-bidens-dei-initiatives/",
    "timestamp": "2025-04-01T00:08:28Z"
  },
  {
    "title": "'Revenge': Inside Trump's 'unnerving' plan for 'curtailing freedom of the press'",
    "description": "After The Atlantic published editor Jeffrey Goldberg's bombshell \"Signalgate\" article on March 24, many national security experts described Goldberg's revelation as a wake-up call. Goldberg revealed that National Security Director Michael Waltz had wrongly in…",
    "link": "https://www.rawstory.com/donald-trump-2671645602/",
    "timestamp": "2025-04-01T00:08:22Z"
  },
  {
    "title": "Man suspected of setting fire to Tesla vehicles in Las Vegas will remain jailed until trial",
    "description": "Paul Hyon Kim, 36, faces federal charges of arson and possessing an explosive device.",
    "link": "https://www.bostonherald.com/2025/03/31/tesla-vandalism-las-vegas/",
    "timestamp": "2025-04-01T00:07:47Z"
  },
  {
    "title": "Trump grants clemency to 2 of Hunter Biden's ex-associates",
    "description": "President Trump has granted clemency to two former business partners of Hunter Biden, both of whom accused Hunter Biden of improperly leveraging his father's name.",
    "link": "https://abcnews.go.com/US/trump-grants-clemency-2-hunter-bidens-associates/story?id=120349469",
    "timestamp": "2025-04-01T00:07:26Z"
  },
  {
    "title": "Poll Shows Split as Trump Slams Judges for Pro-Migration Rulings",
    "description": "Forty-five percent of Americans say federal judges are trying to block President Donald Trump's election mandate, according to a poll of 1,115 likely voters by Rasmussen Reports.\nThe post Poll Shows Split as Trump Slams Judges for Pro-Migration Rulings appear…",
    "link": "https://www.breitbart.com/immigration/2025/03/31/poll-shows-split-as-trump-pressures-judges-on-migration/",
    "timestamp": "2025-04-01T00:06:47Z"
  },
  {
    "title": "Trump says he gave Tiger Woods blessing to date Vanessa Trump: 'Let them both be happy'",
    "description": "Amid Tiger Woods and Vanessa Trump's relationship, President Donald Trump says he gave the golfer his approval to be with his ex-daughter-in-law.",
    "link": "https://www.foxnews.com/sports/trump-suggests-russia-collusion-investigation-led-tiger-woods-vanessa-trump-romance",
    "timestamp": "2025-04-01T00:06:40Z"
  },
  {
    "title": "American Energy Dominance Doesn’t Necessarily Mean Producing More",
    "description": "Increasing production to drive prices lower may be good for inflation data, but oil and gas companies must operate above their breakeven price to maintain profitability.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/03/31/american-energy-dominance-doesnt-necessarily-mean-producing-more/",
    "timestamp": "2025-04-01T00:06:32Z"
  },
  {
    "title": "DOGE Is Trying to Gift Itself a $500 Million Building, Court Filings Show",
    "description": "The documents reveal a DOGE affiliate is attempting to transfer the headquarters of an independent think tank, the United States Institute of Peace, to the government at no cost.",
    "link": "https://www.wired.com/story/doge-takes-control-usip-office-building/",
    "timestamp": "2025-04-01T00:06:27Z"
  },
  {
    "title": "Trump commutes sentence of convicted fraudster who aided GOP effort to impeach Biden (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nTrump commutes sentence of convicted fraudster who aided GOP effort to impeach Biden  —  Jason Galanis was sentenced to more than 14 years in prison for a scheme that defrauded a Native American tribe.  —  President Donald Trum…",
    "link": "https://www.memeorandum.com/250331/p129",
    "timestamp": "2025-04-01T00:05:00Z"
  },
  {
    "title": "Elon Musk Doles Out $2M Before Wisconsin Election",
    "description": "Elon Musk gave $2 million to two individuals at a town hall in Wisconsin, days before a critical election to appoint a judge to the state Supreme Court.",
    "link": "https://hiphopwired.com/2664556/elon-musk-doles-out-2m-before-wisconsin-election/",
    "timestamp": "2025-04-01T00:04:20Z"
  },
  {
    "title": "Almost two dozen Democrats in Congress support Transgender Day of Visibility march on National Mall",
    "description": "Almost two dozen Democrats in Congress showed up in support of the Transgender Day of Visibility march on the National Mall in Washington, D.C.  Transgender Day of Visibility on Monday (31 March) saw the trans and non-binary community and allies protesting ag…",
    "link": "https://www.thepinknews.com/2025/04/01/democrats-congress-support-transgender-day-of-visibility-march/",
    "timestamp": "2025-04-01T00:03:51Z"
  },
  {
    "title": "OpenAI bags $40B in funding, increasing its post-money valuation to $300B",
    "description": "OpenAI has closed on one of the largest-ever funding rounds for a private company, raising $40 billion at a $300 billion post-money valuation. The bumper funding round was led by SoftBank Group Corp. and saw participation from existing backers of OpenAI, incl…",
    "link": "https://siliconangle.com/2025/03/31/openai-bags-40b-funding-increasing-post-money-valuation-300b/",
    "timestamp": "2025-04-01T00:03:05Z"
  },
  {
    "title": "Cory Booker launches marathon Senate speech",
    "description": "Sen. Cory Booker is planning to hold the Senate floor for as long as he can in an effort to protest actions by President Donald Trump and congressional Republicans. \nThe New Jersey Democrat took to the Senate floor on Monday evening, wearing a black suit and …",
    "link": "https://biztoc.com/x/71a634044182d2cc",
    "timestamp": "2025-04-01T00:00:59Z"
  },
  {
    "title": "Thune suggests Trump was joking about 3rd term",
    "description": "United States Senate Majority Leader John Thune said on Monday that President Donald Trump can't serve another term \"without a change in the Constitution\" and that the US president was m...",
    "link": "https://biztoc.com/x/690f5ceac8488ab3",
    "timestamp": "2025-04-01T00:00:46Z"
  },
  {
    "title": "Tennessee Valley Authority, the nation's largest public utility, appoints a new CEO",
    "description": "The Tennessee Valley Authority has promoted one of its top executives to CEO as President Donald Trump has begun turning his attention back to the nation's largest public utility",
    "link": "https://biztoc.com/x/62e74fa04bdc0214",
    "timestamp": "2025-04-01T00:00:41Z"
  },
  {
    "title": "Kid Rock joins President Trump as he signs order to end ticket-price gouging",
    "description": "President Trump signs executive order to end ticket-price gouging for live entertainment, directing the Federal Trade Commission to enforce competition laws in the industry.",
    "link": "https://www.wishtv.com/news/politics/trump-executive-order-ticket-price-gouging/",
    "timestamp": "2025-04-01T00:00:41Z"
  },
  {
    "title": "Coinbase Stocks Slide Over 30% This Quarter, Matching Post-FTX Collapse Lows",
    "description": "Shares of Coinbase (COIN), the largest crypto exchange in the US, have faced significant declines during the first quarter (Q1) of the year, primarily due to escalating concerns about the US economy and its impact on digital assets.  Coinbase And Others Face …",
    "link": "http://www.newsbtc.com/news/coinbase-stocks-slide-over-30-this-quarter-matching-post-ftx-collapse-lows/",
    "timestamp": "2025-04-01T00:00:40Z"
  },
  {
    "title": "Democrats Sue to Block Trump Bid to Control Elections (Jacob Knutson/Democracy Docket)",
    "description": "Jacob Knutson / Democracy Docket:\nDemocrats Sue to Block Trump Bid to Control Elections  —  The Democratic Party is suing President Donald Trump over his sweeping executive order last week that attempted to wrest control of elections from the states.  —  File…",
    "link": "https://www.memeorandum.com/250331/p128",
    "timestamp": "2025-04-01T00:00:29Z"
  },
  {
    "title": "The World's Richest Man Wants Wisconsin to Give Up on Democracy",
    "description": "Politics\n \n \n / \n April 1, 2025\n \r\n\n \nThe World’s Richest Man Wants Wisconsin to Give Up on Democracy\r\n\n\n\nElon Musk is spending tens of millions of dollars to block free and fair elections in the battleground state.\r\n\n\n\r\n\n \n \n John Nichols \r\n\n \n \n Share\n \n \n …",
    "link": "https://www.thenation.com/article/archive/wisconsin-supreme-court-election-elon-musk/",
    "timestamp": "2025-04-01T00:00:00Z"
  },
  {
    "title": "Pressure on rupee likely to ease in first half of FY26",
    "description": "Although some experts expect the rupee to be in the 87.50/$1 to 85.75/$1 range by December 2025, most economists are hesitant to put out a level due to tariff-related uncertainties.",
    "link": "https://economictimes.indiatimes.com/markets/forex/pressure-on-rupee-likely-to-ease-in-first-half-of-fy26/articleshow/119833458.cms",
    "timestamp": "2025-03-31T23:59:28Z"
  },
  {
    "title": "Pro-Voter Coalition Sues Over Trump Trying to 'Declare Election Rules by Executive Fiat'",
    "description": "A pro-voter coalition on Monday \nsued to block U.S. President Donald Trump's recent executive order that critics warn would make it harder for tens of millions of eligible citizens to cast their ballots in state and federal elections.\n\nThe Campaign Legal Cent…",
    "link": "https://www.commondreams.org/news/trump-voting-rights",
    "timestamp": "2025-03-31T23:56:34Z"
  },
  {
    "title": "Tennessee Valley Authority, the nation's largest public utility, appoints a new CEO",
    "description": "The Tennessee Valley Authority has promoted one of its top executives to CEO as President Donald Trump has begun turning his attention back to the nation's largest public utility",
    "link": "https://abcnews.go.com/Technology/wireStory/tennessee-valley-authority-nations-largest-public-utility-appoints-120351729",
    "timestamp": "2025-03-31T23:55:16Z"
  },
  {
    "title": "Canada Slaps Tariffs on Flamethrowers, Manatee Meat, Fake Beards, and Live Monkeys in Response to Trump",
    "description": "Canada slapped 25 percent tariffs on about 1,800 American products in March, and will implement 4,400 more on April 2, the day President Donald Trump plans to announce higher tariffs against every country that taxes U.S. imports. Many of Canada’s tariffs are …",
    "link": "https://freerepublic.com/focus/f-news/4308006/posts",
    "timestamp": "2025-03-31T23:53:57Z"
  },
  {
    "title": "Stop defending Hamas supporters: Deporting Mahmoud Khalil defends nt'l security",
    "description": "Democrats claim this policy is an attempt to stifle political debate, but that argument misses the mark. The goal is to prevent the spread of dangerous ideologies that threaten American lives.",
    "link": "https://www.jpost.com/opinion/article-848301",
    "timestamp": "2025-03-31T23:52:03Z"
  },
  {
    "title": "Trump Plans To Visit Saudi Arabia, UAE, Qatar In First Foreign Trip",
    "description": "US President Donald Trump may visit Saudi Arabia as soon as next month, he told reporters at the White House on Monday, in what could be his first overseas trip since his return to power.",
    "link": "https://www.ndtv.com/world-news/trump-to-visit-saudi-arabia-uae-qatar-in-first-foreign-trip-8057431",
    "timestamp": "2025-03-31T23:51:18Z"
  },
  {
    "title": "Booker bids for a marathon anti-Trump speech",
    "description": "The News\nSen. Cory Booker began a marathon speech on the Senate floor on Monday evening, vowing to speak as long as he’s “physically able” to protest President Donald Trump’s agenda.\n“In just 71 days, the president has inflicted harm after harm on Americans’ …",
    "link": "https://biztoc.com/x/4490b55639014b88",
    "timestamp": "2025-03-31T23:49:33Z"
  },
  {
    "title": "Donald Trump Gives DOGE Update as Elon Musk Says He'll Step Down in May",
    "description": "Musk is a special government employee, a category for temporary federal workers who are only supposed to work 130 days out of 365.",
    "link": "https://biztoc.com/x/feff048df24cf34c",
    "timestamp": "2025-03-31T23:49:25Z"
  },
  {
    "title": "The ‘religion’ of anti-religionists, good moms vs. suspicious schools and other commentary",
    "description": "“I resigned” from the Freedom From Religion Foundation, explains Jerry A. Coyne at The Wall Street Journal, because it had “abandoned science.”",
    "link": "https://nypost.com/2025/03/31/opinion/religion-of-anti-religionists-good-moms-vs-suspicious-schools-and-other-commentary/",
    "timestamp": "2025-03-31T23:47:34Z"
  },
  {
    "title": "Trump Tariffs Trigger Copper Buying Frenzy As Global Supply Tightens",
    "description": "While gold captures the spotlight, copper is quietly stealing the show.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/03/31/trump-tariffs-trigger-copper-buying-frenzy-as-global-supply-tightens/",
    "timestamp": "2025-03-31T23:46:35Z"
  },
  {
    "title": "Trump joined by Kid Rock as he signs ticket scalping executive order",
    "description": "Donald Trump signed the directive in the Oval Office, with singer Kid Rock standing next to him in an American flag-themed outfit.",
    "link": "https://www.abc.net.au/news/2025-04-01/trump-signs-ticket-scalpers-executive-order-with-kid-rock/105120594",
    "timestamp": "2025-03-31T23:45:56Z"
  },
  {
    "title": "Trump says he's 'not joking' about serving a third term",
    "description": "President Donald Trump has expressed interest in serving a third term despite the constitutional two-term limit.",
    "link": "https://www.wcvb.com/article/trump-says-hes-not-joking-about-serving-third-term/64344297",
    "timestamp": "2025-03-31T23:44:25Z"
  },
  {
    "title": "Trump signs executive order targeting ticket price-gouging | CNN Business",
    "description": "President Donald Trump signed an executive order on Monday aimed at ending price gouging for ticket resales in the live entertainment industry.",
    "link": "https://www.cnn.com/2025/03/31/business/trump-ticket-price-executive-order/index.html",
    "timestamp": "2025-03-31T23:43:42Z"
  },
  {
    "title": "Carrie Coon Says 1 Eye-Opening Detail From ‘White Lotus’ Was Cut Thanks To Trump",
    "description": "“For me, it did make the question of whether Kate voted for Trump so much more provocative,” Coon said of the cut.",
    "link": "https://www.huffpost.com/entry/carrie-coon-white-lotus-cut-scene-thanks-to-trump_n_67eb03a3e4b0d17863f2f8c8",
    "timestamp": "2025-03-31T23:43:24Z"
  },
  {
    "title": "Trump: ‘We'll never stop looking' for American journalist kidnapped in Syria, Austin Tice",
    "description": "President Donald Trump said that although there has been “virtually no sign\" of Tice, his administration would continue to secure Tice’s release.",
    "link": "https://www.foxnews.com/politics/trump-well-never-stop-looking-american-journalist-kidnapped-syria-austin-tice",
    "timestamp": "2025-03-31T23:42:46Z"
  },
  {
    "title": "Tennessee Valley Authority, the nation's largest public utility, appoints a new CEO",
    "description": "The Tennessee Valley Authority has promoted one of its top executives to CEO as President Donald Trump has begun turning his attention back to the nation's largest public utility",
    "link": "https://abcnews.go.com/Business/wireStory/tennessee-valley-authority-nations-largest-public-utility-appoints-120351722",
    "timestamp": "2025-03-31T23:42:44Z"
  },
  {
    "title": "Donald Trump Gives DOGE Update as Elon Musk Says He'll Step Down in May",
    "description": "Musk is a special government employee, a category for temporary federal workers who are only supposed to work 130 days out of 365.",
    "link": "https://www.newsweek.com/donald-trump-gives-doge-update-elon-musk-says-hell-step-down-may-2053368",
    "timestamp": "2025-03-31T23:41:35Z"
  },
  {
    "title": "Trump's New Drug Czar: Cannabis Is 'Fantastic' For People With Serious Illnesses",
    "description": "President Donald Trump appointed journalist Sara Carter as the next director of the Office of National Drug Control Policy (ONDCP), or the “drug czar,” reported Fox News, quoting the president's comments on social media.\n\"It is my great honor to announce Sara…",
    "link": "https://biztoc.com/x/8bead4eb47f52587",
    "timestamp": "2025-03-31T23:38:18Z"
  },
  {
    "title": "Government braces for Trump tariffs as Cabinet warned 20% to be applied to all of EU",
    "description": "Tánaiste Simon Harris will inform Cabinet this morning that a large amount of uncertainty remains on whether country-specific tariffs will be applied.",
    "link": "https://www.thejournal.ie/government-us-tariffs-cabinet-irish-exports-trump-simon-harris-6664410-Apr2025/",
    "timestamp": "2025-03-31T23:30:30Z"
  },
  {
    "title": "Breitbart Business Digest: U.S. Auto Stocks Slide and Prove That Tariff Critics Are Wrong",
    "description": "So, when critics say tariffs are just crony capitalism for incumbent firms, point them to the stock market. It’s not cheering. It’s panicking. Because this time, the rules really are changing.\nThe post Breitbart Business Digest: U.S. Auto Stocks Slide and Pro…",
    "link": "https://www.breitbart.com/economy/2025/03/31/breitbart-business-digest-u-s-auto-stocks-slide-and-prove-that-tariff-critics-are-wrong/",
    "timestamp": "2025-03-31T23:30:10Z"
  },
  {
    "title": "India befriends Big Tech as Trump tariffs knock on door, aided by a string of biz-friendly moves",
    "description": "Policymakers are looking to wait and analyze the impact of the upcoming Digital Personal Data Protection Act, 2023 for tech firms, before choosing to regulate further. This could take at least three years—a phase during which Big Tech will find India a friend…",
    "link": "https://www.livemint.com/industry/infotech/india-big-tech-trump-tariffs-regulation-eu-us-google-meta-11743421052309.html",
    "timestamp": "2025-03-31T23:30:05Z"
  },
  {
    "title": "Democratic base's anger puts some party leaders on shaky ground",
    "description": "The Democratic base is angry. Not just at President Donald Trump, Elon Musk; Democrats are mad at their own leaders and increasingly agitating to replace them.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_f17fbc41-0878-5460-9cd3-5a9c5f2d2681.html",
    "timestamp": "2025-03-31T23:30:00Z"
  },
  {
    "title": "Aston Martin To Raise Over $162 Million Through F1 Team Stake Sale And Stroll’s Increased Investment",
    "description": "Aston Martin will raise over $162 million through the sale of its stake in the F1 team and funding from its chairman, Lawrence Stroll, to counter losses and President Donald Trump's tariffs.",
    "link": "https://www.forbes.com/sites/yaraelshebiny/2025/03/31/aston-martin-to-raise-over-162-million-through-f1-team-stake-sale-and-strolls-increased-investment/",
    "timestamp": "2025-03-31T23:29:49Z"
  },
  {
    "title": "Trump signs executive order targeting ticket price-gouging",
    "description": "President Donald Trump signed an executive order Monday aimed at ending ticket-price gouging for live entertainment.",
    "link": "https://www.abc12.com/news/entertainment/trump-signs-executive-order-targeting-ticket-price-gouging/article_bcec067a-778e-5a93-a458-1cfb591271f1.html",
    "timestamp": "2025-03-31T23:29:00Z"
  },
  {
    "title": "Jim Cramer says Trump's behavior has overshadowed U.S. economic strength",
    "description": "CNBC's Jim Cramer said he believes investor sentiment has gotten too negative and could improve if President Donald Trump clarifies his tariff policies.",
    "link": "https://biztoc.com/x/5de32c418373d61d",
    "timestamp": "2025-03-31T23:27:14Z"
  }
]