[
  {
    "title": "Trump Administration Arrests Georgetown University Postdoctoral Fellow",
    "description": "A lawyer for Badar Khan Suri said his client has not been charged with any crime.",
    "link": "https://www.huffpost.com/entry/trump-administration-arrests-georgetown-fellow_n_67dbec42e4b038b4d0a63720",
    "timestamp": "2025-03-20T13:35:52Z"
  },
  {
    "title": "How Russia-US Talks on Ukraine Shake Taiwanese Confidence in America’s Commitment",
    "description": "Survey findings reveal a clear pattern: Taiwanese perceptions of U.S. credibility are closely tied to how Washington handles its global commitments.",
    "link": "https://thediplomat.com/2025/03/how-russia-us-talks-on-ukraine-shake-taiwanese-confidence-in-americas-commitment/",
    "timestamp": "2025-03-20T13:34:16Z"
  },
  {
    "title": "Elon Musk needs to do these two things to get Tesla back on track, analyst says",
    "description": "CEO Elon Musk needs to step up and do these two things to resolve Tesla’s (TSLA) “crisis” over his leadership of the Department of Government Efficiency, according to Wedbush Securities analyst Dan Ives.Read more...",
    "link": "https://qz.com/elon-musk-tesla-doge-brand-damage-trump-analyst-stock-1851771204",
    "timestamp": "2025-03-20T13:34:00Z"
  },
  {
    "title": "Hollywood exodus: the celebrities leaving the US over Trump 2.0 - The Guardian",
    "description": "Hollywood exodus: the celebrities leaving the US over Trump 2.0The Guardian “It’s Frightening Now”: Celebrities Moving Abroad Amid Donald Trump 2.0Vanity Fair President Trump slams Rosie O'Donnell after she flees US: 'You're better off not knowing' herFox New…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176777925",
    "timestamp": "2025-03-20T13:32:54Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Thursday",
    "description": "Wall Street was heading for a lower open today after Wednesday's Fed-driven rally.",
    "link": "https://www.cnbc.com/2025/03/20/jim-cramers-top-10-things-to-watch-in-the-stock-market-thursday.html",
    "timestamp": "2025-03-20T13:29:41Z"
  },
  {
    "title": "Energy Secretary Chris Wright says Trump push to produce more oil is driving down prices",
    "description": "The Trump administration has promised to increase leases on federal lands and waters and expedite the permitting process.",
    "link": "https://www.cnbc.com/2025/03/20/energy-secretary-chris-wright-says-trump-push-to-produce-more-oil-is-driving-down-prices-.html",
    "timestamp": "2025-03-20T13:28:47Z"
  },
  {
    "title": "We Must Burst Our Algorithmic Bubbles and Build Together Across Difference",
    "description": "“We need each other, and interdependence is key to survival for human beings,” says organizer Mariame Kaba.",
    "link": "https://truthout.org/audio/we-must-burst-our-algorithmic-bubbles-and-build-together-across-difference/",
    "timestamp": "2025-03-20T13:28:44Z"
  },
  {
    "title": "Who was the French scientist not allowed to enter US—And what did he say about Trump?",
    "description": "A French scientist was denied entry to the United States after immigration officials found text messages on his phone criticising Donald Trump’s policies on scientific research. Stopped at a Texas airport en route to a conference, the researcher’s devices wer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-was-the-french-scientist-not-allowed-to-enter-usand-what-did-he-say-about-trump/articleshow/119260072.cms",
    "timestamp": "2025-03-20T13:28:16Z"
  },
  {
    "title": "Mercedes-Benz boss talks Tesla’s vulnerability",
    "description": "Mercedes-Benz has produced its most advanced vehicle just as Tesla's fall gave the company an opening to woo disgruntled buyers. Read on",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/mercedes-benz-boss-talks-teslas-vulnerability",
    "timestamp": "2025-03-20T13:27:31Z"
  },
  {
    "title": "‘Ultimate Grifter’: Christopher Steele Subjected To Beatdown By Conservative For His Debunked Trump Dossier",
    "description": "“War Room” White House Correspondent Natalie Winters delivered a takedown of the author of a discredited dossier accusing Donald Trump of colluding with Russia.",
    "link": "https://dailycaller.com/2025/03/20/christopher-steele-subjected-beatdown-debunked-trump-dossier/",
    "timestamp": "2025-03-20T13:27:30Z"
  },
  {
    "title": "Trump Dodges Key Recession Question With Bizarre, Rambling Answer",
    "description": "Federal Reserve Chair Jerome Powell told the country Wednesday that Donald Trump’s tariffs are partially to blame for rising prices, and that the likelihood that the country will enter a recession has grown, but the president doesn’t seem ready or willing to …",
    "link": "https://newrepublic.com/post/192956/donald-trump-dodges-recession-question",
    "timestamp": "2025-03-20T13:27:04Z"
  },
  {
    "title": "White House Asks Supreme Court to 'Rein In' Judges Defying Trump",
    "description": "White House Press Secretary Karoline Leavitt has accused some federal judges of trying to \"slow-walk\" Trump's political agenda.",
    "link": "https://www.newsweek.com/white-house-asks-supreme-court-rein-judges-defying-trump-2047771",
    "timestamp": "2025-03-20T13:26:31Z"
  },
  {
    "title": "Trump says the Fed should cut rates to ease the economy’s transition to his tariffs",
    "description": "After largely staying out of the Federal Reserve's business during his first two months in office, President Donald Trump is pushing the central bank to cut interest rates as a backstop for his tariff plans.\nIn a post Wednesday night on Truth Social, Trump en…",
    "link": "https://biztoc.com/x/65a874fe0893c480",
    "timestamp": "2025-03-20T13:26:16Z"
  },
  {
    "title": "FACT CHECK: No, Trump Has Not Ordered The Federal Reserve To Begin Minting Quarters Without Ridges",
    "description": "A viral post shared on X claims President Donald Trump has purportedly ordered the Federal Reserve to begin minting quarters without ridges. BREAKING Donald Trump orders federal reserve to begin minting quarters w/o ridges This change comes as a result of…",
    "link": "https://checkyourfact.com/2025/03/20/fact-check-no-trump-has-not-ordered-the-federal-reserve-to-begin-minting-quarters-without-ridges/",
    "timestamp": "2025-03-20T13:26:03Z"
  },
  {
    "title": "Trump's Tariffs Souring Canadians' Love of Tim Hortons",
    "description": "Trump has imposed a 25 percent tariff on Canadian imports, alongside a 10 percent tariff on Canadian energy imports.",
    "link": "https://www.newsweek.com/donald-trump-canada-tariffs-tim-hortons-2047733",
    "timestamp": "2025-03-20T13:25:17Z"
  },
  {
    "title": "Zelensky contradicts Trump on call details",
    "description": "Vladimir Zelensky has denied discussing the potential US ownership of Ukrainian nuclear power plants with Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614532-zelensky-trump-ukraine-energy/",
    "timestamp": "2025-03-20T13:23:10Z"
  },
  {
    "title": "Elon Musk’s X Is Once Again Valued at $44 Billion",
    "description": "\"Social media site X’s valuation has soared back to $44 billion, underscoring the sharp turnaround in the company’s fortunes since its owner Elon Musk assumed the role of staunch ally to President Donald Trump,\" the",
    "link": "https://politicalwire.com/2025/03/20/elon-musks-x-is-once-again-valued-at-44-billion/",
    "timestamp": "2025-03-20T13:21:30Z"
  },
  {
    "title": "The Democrats Who Want a Bully",
    "description": "Andrew Cuomo is resurgent, and Rahm Emanuel is considering a presidential run. Are these the tough guys Democrats need?",
    "link": "https://www.theatlantic.com/culture/archive/2025/03/democrats-want-bully/682101/",
    "timestamp": "2025-03-20T13:21:00Z"
  },
  {
    "title": "How the Tesla brand turned so toxic",
    "description": "Today we’re talking about the protests against Tesla, which have been branded on social media under the hashtag Tesla Takedown. The protests are, of course, a reaction to Elon Musk, who has managed to install himself as basically a not-so-shadow president who…",
    "link": "https://www.theverge.com/decoder-podcast-with-nilay-patel/633200/tesla-takedown-protest-elon-musk-toxic",
    "timestamp": "2025-03-20T13:19:47Z"
  },
  {
    "title": "Trump to sign executive order abolishing Department of Education | Fox News Video",
    "description": "Reagan-era Education Secretary and Fox News contributor Bill Bennett joins 'Fox & Friends' to argue President Donald Trump's plan is good for America.",
    "link": "https://www.foxnews.com/video/6370268085112",
    "timestamp": "2025-03-20T13:19:45Z"
  },
  {
    "title": "JB Pritzker Reveals The Stunt Trump Wanted In Exchange For COVID Equipment",
    "description": "The Illinois governor said Wednesday that the president agreed to send his state lifesaving equipment under one condition.",
    "link": "https://www.huffpost.com/entry/jb-pritzker-donald-trump-covid-19-equipment_n_67dbe785e4b07481408d6bea",
    "timestamp": "2025-03-20T13:19:29Z"
  },
  {
    "title": "UnitedHealth To Overhaul Payment Model To Support Independent Pharmacies",
    "description": "On Thursday, UnitedHealth Group Inc‘s (NYSE:UNH) Optum Rx will align payment models more closely to the costs pharmacies may face due to manufacturer pricing actions.\nThe company plans a full implementation by January 2028.\nIn February, President Donald Trump…",
    "link": "https://biztoc.com/x/4c389168907b3272",
    "timestamp": "2025-03-20T13:15:13Z"
  },
  {
    "title": "Zelenskiy Says Putin's Words Are 'At Odds With Reality'",
    "description": "Ukrainian President Volodymyr Zelenskyy said that he plans to speak with U.S. President Donald Trump on Wednesday to hear more about his call with Russian leader Vladimir Putin.\nZelenskyy said that Putin’s agreement to stop striking energy infrastructure were…",
    "link": "https://biztoc.com/x/61c992315e34fff0",
    "timestamp": "2025-03-20T13:15:01Z"
  },
  {
    "title": "Trump’s Self-Inflicted Economic Wounds",
    "description": "Trump inherited a strong economy. Now, economists say he has already started to tank it—and warn that a recession may be on the horizon.",
    "link": "https://time.com/7269516/trumps-self-inflicted-economic-wounds/",
    "timestamp": "2025-03-20T13:15:00Z"
  },
  {
    "title": "Trump set to sign executive order shuttering the Education Department",
    "description": "President Donald Trump is expected to sign an executive order Thursday to close the Education Department, fulfilling a yearslong pledge to dismantle the federal agency, the White House confirmed. Trump will hold an event at the White House to sign the order d…",
    "link": "https://freerepublic.com/focus/f-news/4305544/posts",
    "timestamp": "2025-03-20T13:14:20Z"
  },
  {
    "title": "With US trade deficit at a record, could Trump strive to weaken the dollar?",
    "description": "The US dollar is the world's most important reserve currency. But Donald Trump sees the greenback's current strength as a cause behind trade deficits and a big hindrance to his manufacturing revolution.",
    "link": "https://www.dw.com/en/mar-a-lago-accord-is-donald-trump-deliberately-tryomg-tp-weaken-us-dollar/a-71972325",
    "timestamp": "2025-03-20T13:12:00Z"
  },
  {
    "title": "Trump will order a plan to shut down the US Education Department",
    "description": "WASHINGTON (AP) — President Donald Trump plans to sign an executive order Thursday calling for the shutdown of the U.S. Education Department, according to a White House official, advancing a campaign promise to eliminate an agency that's been a longtime…",
    "link": "https://www.thesunchronicle.com/news/nation_world/trump-will-order-a-plan-to-shut-down-the-us-education-department/article_c1cde774-3f93-4a51-a933-f3c36645b560.html",
    "timestamp": "2025-03-20T13:11:00Z"
  },
  {
    "title": "With outlook uncertain, the Bank of England joins the US Fed in putting interest rates on hold",
    "description": "The Bank of England has kept its main U.K. interest rate unchanged at 4.50% even though the economy is barely growing and the nation faces more uncertainty in light of the tariff policies being enacted by the Trump administration in the U.S. The decisi...",
    "link": "https://abcnews.go.com/Business/wireStory/outlook-uncertain-bank-england-joins-us-fed-putting-119975729",
    "timestamp": "2025-03-20T13:10:22Z"
  },
  {
    "title": "Trump Lawyer Livid as JFK Files Leak His Social Security Number: 'Absolutely Outrageous' (Tom Sanders/The Daily Beast)",
    "description": "Tom Sanders / The Daily Beast:\nTrump Lawyer Livid as JFK Files Leak His Social Security Number: 'Absolutely Outrageous' -- Donald Trump's former campaign lawyer is furious after his personal information and social security number were made public as part of t…",
    "link": "https://www.memeorandum.com/250320/p23",
    "timestamp": "2025-03-20T13:10:00Z"
  },
  {
    "title": "Janan Ganesh: Europe is only half-awake from its long sleep",
    "description": "Talk of Donald Trump bringing the continent together is absurdly premature",
    "link": "https://www.irishtimes.com/world/europe/2025/03/20/janan-ganesh-europe-is-only-half-awake-from-its-long-sleep/",
    "timestamp": "2025-03-20T13:07:36Z"
  },
  {
    "title": "Turkey faces investor flight and political freefall after opposition leader's arrest",
    "description": "Concern over stability and economic security in Turkey could damage financial inflows at a time when investor confidence in the country is already shaky.",
    "link": "https://www.cnbc.com/2025/03/20/turkey-faces-protests-investor-flight-after-opposition-leaders-arrest.html",
    "timestamp": "2025-03-20T13:07:03Z"
  },
  {
    "title": "Thursday, March 20, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-march-20-2025/",
    "timestamp": "2025-03-20T13:05:24Z"
  },
  {
    "title": "Russian TV Says Putin Just Humoring Trump",
    "description": "Kremlin propagandists have suggested that Vladimir Putin has President Donald Trump where he wants him following the leaders' phone call on Tuesday.\nPundits on the Russia 1 channel said the conversation about Putin's full-scale invasion of Ukraine went perfec…",
    "link": "https://biztoc.com/x/3cffa1b5d95bf62b",
    "timestamp": "2025-03-20T13:04:08Z"
  },
  {
    "title": "My Old Friend Is Helping Elon Musk Destroy America",
    "description": "For Steve Davis, Musk’s right-hand man at DOGE, life has always been a game — but Musk’s game increases inefficiency and makes people’s lives worse.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-elon-musk-doge-steve-davis-friend-1235300013/",
    "timestamp": "2025-03-20T13:02:28Z"
  },
  {
    "title": "Tether’s US treasury holdings surpass Canada, Taiwan, ranks 7th globally",
    "description": "Tether, the $143 billion stablecoin giant, was the world’s seventh-largest buyer of United States Treasurys, surpassing some of the world’s largest countries.Tether, the issuer of USDt (USDT), the world’s largest stablecoin, was the world’s seventh-largest US…",
    "link": "https://cointelegraph.com/news/tether-becomes-7th-largest-us-treasury-holder-stablecoin-growth",
    "timestamp": "2025-03-20T13:02:09Z"
  },
  {
    "title": "Another Indian conglomerate enters the race for copper",
    "description": "Copper prices have surged to over $10,000 a ton amid US President Trump's tariff plans and India's increasing efforts to boost its domestic copper industry. Indian conglomerates like JSW Group and Adani Group are making substantial investments to counter the …",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/another-indian-conglomerate-enters-the-race-for-copper/articleshow/119259692.cms",
    "timestamp": "2025-03-20T13:02:03Z"
  },
  {
    "title": "‘Wow!’ See Fox News Host React as Trump Drops Stolen Election Claim in Middle of Interview",
    "description": "Trump dropped a stolen election claim on Laura Ingraham right in the middle of an interview, along with a revelation that made Ingraham exclaim \"Wow!\"\nThe post ‘Wow!’ See Fox News Host React as Trump Drops Stolen Election Claim in Middle of Interview first ap…",
    "link": "https://www.mediaite.com/news/wow-see-fox-news-host-react-as-trump-drops-stolen-election-claim-in-middle-of-interview/",
    "timestamp": "2025-03-20T13:01:59Z"
  },
  {
    "title": "Prince William arrives in Estonia to visit British troops on frontline of Russian aggression",
    "description": "Prince William to meet Estonia’s president Alar Karis before travelling to visit UK’s largest permanent overseas deployment of troops at Tapa Army Base",
    "link": "https://www.the-independent.com/news/uk/home-news/prince-william-estonia-visit-russia-b2718687.html",
    "timestamp": "2025-03-20T13:01:55Z"
  },
  {
    "title": "Debate over H-1B visas shines spotlight on US tech worker shortages",
    "description": "A reliance on foreign students for academic research has allowed the US to ignore flaws in its domestic tech worker pipeline, a scholar argues.",
    "link": "https://theconversation.com/debate-over-h-1b-visas-shines-spotlight-on-us-tech-worker-shortages-248711",
    "timestamp": "2025-03-20T13:01:47Z"
  },
  {
    "title": "Third term for Donald Trump in 2028? Steve Bannon admits MAGA operatives are working for an unprecedented reform of the U.S constitution",
    "description": "Steve Bannon claims MAGA allies are pushing for Trump’s 2028 run. Explore his CPAC controversies, legal battles, and why term limits might not stop Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/third-term-for-donald-trump-in-2028-steve-bannon-admits-maga-operatives-are-working-for-an-unprecedented-reform-of-the-u-s-constitution/articleshow/119259912.cms",
    "timestamp": "2025-03-20T13:01:25Z"
  },
  {
    "title": "Mortgage Fraud Alert: Did Letitia James Marry Her Father?",
    "description": "Recent findings raise serious questions about New York Attorney General Letitia James's mortgage practices, including a troubling loan obtained with her father. Delve into the details and implications of these allegations.\nThe post Mortgage Fraud Alert: Did L…",
    "link": "https://www.thegatewaypundit.com/2025/03/mortgage-fraud-alert-did-letitia-james-marry-her/",
    "timestamp": "2025-03-20T13:00:45Z"
  },
  {
    "title": "Musk Links Social Security Cuts to Immigration, Voter Fraud",
    "description": "The tech billionaire has made several comments in recent weeks regarding fraud in benefits and entitlements administered by the federal government.",
    "link": "https://www.newsweek.com/elon-musk-social-security-cuts-immigration-voter-fraud-ssa-2047699",
    "timestamp": "2025-03-20T13:00:42Z"
  },
  {
    "title": "UC Berkeley Faculty Rally to Defend Free Speech and Protest Cuts",
    "description": "Hundreds of UC Berkeley professors and students rallied in defense of academic freedom as President Donald Trump threatened to pull funding and “punish” higher education.",
    "link": "https://www.kqed.org/news/12032030/uc-berkeley-faculty-rally-to-defend-free-speech-and-protest-cuts",
    "timestamp": "2025-03-20T13:00:05Z"
  },
  {
    "title": "CBS Paints Trump as Worse Than Venezuelan Gangs",
    "description": "In the moral battle between President Donald Trump and the violent Venezuelan gang Tren de Aragua, the media have chosen a side. The foreign gangsters... Read More\nThe post CBS Paints Trump as Worse Than Venezuelan Gangs appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/20/cbs-paints-trump-worse-venezuelan-gangs/",
    "timestamp": "2025-03-20T13:00:00Z"
  },
  {
    "title": "Exclusive: GOP Chairman Demands Info From 14 Agencies On Biden’s Taxpayer-Funded GOTV Efforts To Boost Dems",
    "description": "Rep. Bryan Steil sent letters to 14 Trump administration agencies seeking information on the Bidenbucks get-out-the-vote scheme.",
    "link": "https://thefederalist.com/2025/03/20/exclusive-gop-chairman-demands-info-from-14-agencies-on-bidens-taxpayer-funded-gotv-efforts-to-boost-dems/",
    "timestamp": "2025-03-20T13:00:00Z"
  },
  {
    "title": "Taxes on Tips: What You Need to Know and Whether or Not They'll Go Away",
    "description": "Are tips a major part of the income you collect? Here's what you need to know as tax season rolls on.",
    "link": "https://www.cnet.com/personal-finance/taxes/taxes-on-tips-what-you-need-to-know-and-whether-or-not-theyll-go-away/",
    "timestamp": "2025-03-20T13:00:00Z"
  },
  {
    "title": "Applications for jobless benefits inch up, but layoffs remain low",
    "description": "Slightly more Americans applied for unemployment benefits last week, but layoffs remain historically low",
    "link": "https://abcnews.go.com/Business/wireStory/applications-jobless-benefits-inch-layoffs-remain-low-labor-119981639",
    "timestamp": "2025-03-20T12:59:21Z"
  },
  {
    "title": "Russian TV Says Putin Just Humoring Trump",
    "description": "Pundits on the Russia 1 channel welcomed the outcome of the call between Vladimir Putin and Donald Trump.",
    "link": "https://www.newsweek.com/russia-kremlin-putin-trump-humoring-2047707",
    "timestamp": "2025-03-20T12:58:57Z"
  },
  {
    "title": "Comedy Central Audience Repeatedly Applauds Tesla Terrorism, as Host Jordan Klepper Justifies Left-Wing Violence",
    "description": "Comedy Central's \"The Daily Show\" host Jordan Klepper laughed while his audience repeatedly cheered at fiery footage of Tesla dealerships, Teslas, and charging stations being bombed and vandalized by left-wing radicals lashing out in response to Elon Musk's m…",
    "link": "https://www.breitbart.com/entertainment/2025/03/20/comedy-central-audience-repeatedly-applauds-tesla-terrorism-as-host-jordan-klepper-justifies-left-wing-violence/",
    "timestamp": "2025-03-20T12:58:15Z"
  },
  {
    "title": "Russia says will hold talks with US in Riyadh Monday: Kremlin",
    "description": "Russian and U.S. officials will hold talks on Ukraine in Saudi Arabia on Monday, President Vladimir Putin's aide Yuri Ushakov said.",
    "link": "https://www.hurriyetdailynews.com/russia-says-will-hold-talks-with-us-in-riyadh-monday-kremlin-207143",
    "timestamp": "2025-03-20T12:58:00Z"
  },
  {
    "title": "Tu vuò fà l’americano?",
    "description": "Full disclosure here: I love old, sappy American movies. And whether I was in Canada, the Netherlands, Portugal or India, I drank in popular American culture through them. Through them, I formed my image of the American abroad. But now, that image is changing…",
    "link": "https://www.fairobserver.com/culture/tu-vuo-fa-lamericano/",
    "timestamp": "2025-03-20T12:57:43Z"
  },
  {
    "title": "EU Delays US Tariffs",
    "description": "The tariffs were due to come in early April.",
    "link": "https://www.newsweek.com/eu-delays-us-tariffs-2047827",
    "timestamp": "2025-03-20T12:57:04Z"
  },
  {
    "title": "Why Canada should not cancel – for now – the American-made F35 warplanes",
    "description": "Mark Carney should not tip his hand while fighting a trade war with Trump.",
    "link": "https://www.aljazeera.com/opinions/2025/3/20/why-canada-should-not-cancel-for-now-the-american-made-f35-warplanes",
    "timestamp": "2025-03-20T12:56:35Z"
  },
  {
    "title": "Trump Reveals the One Thing He Admires About ‘Sleepy Joe’ Biden",
    "description": "President Donald Trump revealed that the one thing he admired about former President Joe Biden was his ability to nap and relax during trips to the beach – admitting he could never do that himself and functions best on “little sleep.” While “Sleepy Joe” has l…",
    "link": "https://www.mediaite.com/tv/trump-reveals-the-one-thing-he-admires-about-sleepy-joe-biden/",
    "timestamp": "2025-03-20T12:56:22Z"
  },
  {
    "title": "'American Pie' Actress's Story Of ICE Detention Will Send Chills Up Your Spine",
    "description": "My God, what the hell have we become?",
    "link": "https://www.wonkette.com/p/american-pie-actresss-story-of-ice",
    "timestamp": "2025-03-20T12:55:39Z"
  },
  {
    "title": "A New Military-Industrial Complex Arises: The Secret War Within the Pentagon",
    "description": "Last April, in a move generating scant media attention, the Air Force announced that it had chosen two little-known drone manufacturers — Anduril Industries of Costa Mesa, California, and General Atomics of San Diego — to build prototype versions of its propo…",
    "link": "https://www.fairobserver.com/business/technology/a-new-military-industrial-complex-arises-the-secret-war-within-the-pentagon/",
    "timestamp": "2025-03-20T12:55:35Z"
  },
  {
    "title": "Married couple in U.S. for 35 years deported to Colombia",
    "description": "An Orange County couple who came to the U.S. without authorization some 35 years ago, raised three daughters and now have a new grandson were deported to Colombia earlier this week, according to media reports. Nelson Gonzalez, 59, and his wife Gladys Gonzalez…",
    "link": "https://freerepublic.com/focus/f-news/4305540/posts",
    "timestamp": "2025-03-20T12:54:49Z"
  },
  {
    "title": "MeitY Reveals FICCI, PCI and CII’s Membership In MIB Blocking Committee",
    "description": "The MoS for Electronics and IT, Jitin Prasada revealed in the Lok Sabha that FICCI, PCI and CII are members of the MIB Blocking Committee.\nThe post MeitY Reveals FICCI, PCI and CII’s Membership In MIB Blocking Committee appeared first on MEDIANAMA.",
    "link": "https://www.medianama.com/2025/03/223-meity-reveals-ficci-pci-cii-membership-in-mib-blocking-committee/",
    "timestamp": "2025-03-20T12:53:41Z"
  },
  {
    "title": "What is an autopen? The signing device at the heart of Trump's attacks on Biden pardons",
    "description": "An autopen is a device that physically holds a pen and is programmed to replicate a person’s signature. It is not a stamp or a digitized print of someone’s signature.",
    "link": "https://www.foxnews.com/politics/what-autopen-signing-device-heart-trumps-attacks-biden-pardons",
    "timestamp": "2025-03-20T12:52:27Z"
  },
  {
    "title": "Trump to sign executive order to abolish the Department of Education",
    "description": "President Donald Trump is moving forward with plans to abolish the Department of Education. Trump is expected to sign an executive order following through on a campaign promise to disband the department, claiming on the campaign trail that the department was …",
    "link": "https://freerepublic.com/focus/f-news/4305537/posts",
    "timestamp": "2025-03-20T12:52:23Z"
  },
  {
    "title": "Donald Trump Reportedly Making 'Big Announcement' For 'Next Steps In Crypto Policy' At Digital Asset Summit On Thursday",
    "description": "President Donald Trump is set to address the Digital Asset Summit (DAS) in New York City later today and is expected to make key announcements related to crypto policies in the United States.\nThis marks the first time a sitting U.S. president will speak at a …",
    "link": "https://biztoc.com/x/ecdef17e94640d07",
    "timestamp": "2025-03-20T12:52:17Z"
  },
  {
    "title": "Trump open to extending Chevron's license to produce oil in Venezuela, WSJ reports",
    "description": "President Donald Trump is considering extending Chevron's license to pump oil in Venezuela, people familiar with the matter told The Wall Street Journal.\nTrump said in late February that he would reverse a Biden administration decision that allowed Chevron to…",
    "link": "https://biztoc.com/x/d8b78a2bc186e490",
    "timestamp": "2025-03-20T12:52:14Z"
  },
  {
    "title": "Inside The Now-Shuttered Federal Agency Where Employees Lived ‘Like Reigning Kings’",
    "description": "One of the seven small federal agencies that President Donald Trump ordered downsized or eliminated on Friday was rife with corruption, with its employees hiring friends and relatives, commissioning paintings of themselves, and using government credit cards t…",
    "link": "https://freerepublic.com/focus/f-news/4305536/posts",
    "timestamp": "2025-03-20T12:51:24Z"
  },
  {
    "title": "Ukraine war: how Zelensky rebuilt his relationship with Trump to turn the tables on Putin",
    "description": "Through careful telephone diplomacy, the Ukrainian president is exposing Putin’s disinterest in stopping hostilities.",
    "link": "https://theconversation.com/ukraine-war-how-zelensky-rebuilt-his-relationship-with-trump-to-turn-the-tables-on-putin-252693",
    "timestamp": "2025-03-20T12:48:26Z"
  },
  {
    "title": "Tyrannical leader? Why comparisons between Trump and King George III miss the mark on 18th-century British monarchy",
    "description": "Britain’s George III has gotten a bad rap. He was not the all-powerful monarch that President Trump allegedly aspires to be.",
    "link": "https://theconversation.com/tyrannical-leader-why-comparisons-between-trump-and-king-george-iii-miss-the-mark-on-18th-century-british-monarchy-251869",
    "timestamp": "2025-03-20T12:48:10Z"
  },
  {
    "title": "Trump’s 200% tariff threat would be ‘a real disaster’ for Europe’s wine industry",
    "description": "Europe's wine industry is the latest to find itself in the crosshairs of a possible trade spat with the U.S.",
    "link": "https://www.denverpost.com/2025/03/20/trump-europe-wine-tariffs/",
    "timestamp": "2025-03-20T12:47:50Z"
  },
  {
    "title": "Trump’s 200% tariff threat would be ‘a real disaster’ for Europe’s wine industry",
    "description": "Europe's wine industry is the latest to find itself in the crosshairs of a possible trade spat with the U.S.",
    "link": "https://www.bostonherald.com/2025/03/20/trump-europe-wine-tariffs/",
    "timestamp": "2025-03-20T12:47:50Z"
  },
  {
    "title": "Central banks turn more cautious on rate cuts",
    "description": "Big developed market central banks are turning cautious after a series of interest rate cuts and as uncertainty in global economics and politics grows.  Of...",
    "link": "https://finance.yahoo.com/news/central-banks-turn-more-cautious-124521193.html",
    "timestamp": "2025-03-20T12:45:21Z"
  },
  {
    "title": "Central banks turn more cautious on rate cuts",
    "description": "Big developed market central banks are turning cautious after a series of interest rate cuts and as uncertainty in global economics and politics grows. Of five central banks that met this week, only Switzerland's cut rates, though traders see further easing i…",
    "link": "https://www.channelnewsasia.com/business/central-banks-turn-more-cautious-rate-cuts-5013566",
    "timestamp": "2025-03-20T12:45:21Z"
  },
  {
    "title": "As Elon Musk rewards judicial impeachment advocates, Jim Jordan eyes hearings",
    "description": "The bookends are striking: As Elon Musk donates to Republicans who support judicial impeachments, Jim Jordan has scheduled hearings into the issue.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-rewards-judicial-impeachment-advocates-jim-jordan-eyes-heari-rcna197229",
    "timestamp": "2025-03-20T12:45:14Z"
  },
  {
    "title": "Military and Defense Drone Industry Witnessing Exponential Growth as Improved Technology and Products Hit the Market",
    "description": "PALM BEACH, Fla., March 20, 2025 (GLOBE NEWSWIRE) -- FN Media Group News Commentary - A recent report from Straits Research said that the global military drone market size was valued at USD $21.81 billion in 2024 and is expected to grow from USD $24.25 billio…",
    "link": "https://www.globenewswire.com/news-release/2025/03/20/3046245/0/en/Military-and-Defense-Drone-Industry-Witnessing-Exponential-Growth-as-Improved-Technology-and-Products-Hit-the-Market.html",
    "timestamp": "2025-03-20T12:45:00Z"
  },
  {
    "title": "Trump open to extending Chevron's license to produce oil in Venezuela, WSJ reports",
    "description": "The Trump administration had given Chevron until April 3 to wind down its operations.",
    "link": "https://www.cnbc.com/2025/03/20/trump-open-to-extending-chevrons-license-to-produce-oil-in-venezuela-wsj-reports.html",
    "timestamp": "2025-03-20T12:44:52Z"
  },
  {
    "title": "Ex-IRS employee who leaked Trump tax returns summoned by House committee",
    "description": "A Republican lawmaker is demanding that the man responsible for leaking President Donald Trump’s tax returns in 2019 testify before the House Judiciary Committee. Responsible for one of the largest data breaks in the Internal Revenue Service’s history, the ex…",
    "link": "https://freerepublic.com/focus/f-bloggers/4305533/posts",
    "timestamp": "2025-03-20T12:44:08Z"
  },
  {
    "title": "GOP Lawmaker Chuckles and Claps as She’s Hit With Boos at Town Hall Over Musk Support",
    "description": "A Republican congresswoman turned to laughing and clapping as a response to a fiery town hall crowd booing her and her support of Elon Musk.\nThe post GOP Lawmaker Chuckles and Claps as She’s Hit With Boos at Town Hall Over Musk Support first appeared on Media…",
    "link": "https://www.mediaite.com/news/gop-lawmaker-chuckles-and-claps-as-shes-hit-with-boos-at-town-hall-over-musk-support/",
    "timestamp": "2025-03-20T12:43:29Z"
  },
  {
    "title": "European Union delays first tariffs against U.S. to mid-April",
    "description": "The European Union has postponed its first set of counter-measures against U.S. tariffs on metals until mid-April to reconsider targeted U.S. goods and allow more time for negotiations. Discussions with the U.S. yielded limited progress. The delay may adjust …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/european-union-delays-first-tariffs-against-u-s-to-mid-april/articleshow/119259178.cms",
    "timestamp": "2025-03-20T12:41:41Z"
  },
  {
    "title": "Bad News, Democrats. Your Party Has Never Been More Unpopular",
    "description": "Democratic voters want the party to take a firmer line in Congress, even if it leads to gridlock, according to a new poll.",
    "link": "https://www.newsweek.com/bad-news-democrats-your-party-has-never-been-more-unpopular-2047720",
    "timestamp": "2025-03-20T12:41:06Z"
  },
  {
    "title": "Who is David Stever? Was Ben & Jerry’s CEO fired for criticizing Donald Trump or is there more to the story?",
    "description": "Ben & Jerry’s is suing parent company Unilever, alleging CEO David Stever was fired due to his political activism, including criticism of Donald Trump. Tensions have risen as Unilever allegedly pressured the brand to avoid commenting on sensitive issues, supp…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/who-is-david-stever-was-ben-jerrys-ceo-fired-for-criticizing-donald-trump-or-is-there-more-to-the-story/articleshow/119258838.cms",
    "timestamp": "2025-03-20T12:40:02Z"
  },
  {
    "title": "'It is shocking to me': MSNBC host accuses Pam Bondi of lying about judges' powers",
    "description": "Attorney General Pam Bondi's claim that judges have no business interfering with anything Donald Trump chooses to do got a thorough beat-down on MSNBC on Thursday morning.During an appearance on Fox News Wednesday night, the Trump appointee expressed outrage …",
    "link": "https://www.rawstory.com/bondi-lying-judges/",
    "timestamp": "2025-03-20T12:39:56Z"
  },
  {
    "title": "French Tourist Denied US Entry For Text Messages Critical Of Trump",
    "description": "A French scientist traveling as a tourist to the USA to attend a scientific convention in Texas was denied entry and sent back to France after US border agents found messages critical of Donald Trump on his mobile phone. French Tourist Denied Entry To USA Whe…",
    "link": "https://liveandletsfly.com/french-tourist-denied-usa-entry/",
    "timestamp": "2025-03-20T12:39:05Z"
  },
  {
    "title": "'They weren’t selected because they were physically fit...': Neil deGrasse Tyson on why Sunita Williams doesn’t need sympathy",
    "description": "NASA astronauts Sunita Williams and Butch Wilmore returned to Earth after nine months at the ISS, undergoing a rehabilitation program. Astrophysicist Neil deGrasse Tyson believes they will recover swiftly within a week, adjusting to Earth's gravity. Their pro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/they-werent-selected-because-they-were-physically-fit-neil-degrasse-tyson-on-why-sunita-williams-doesnt-need-sympathy/articleshow/119258320.cms",
    "timestamp": "2025-03-20T12:38:55Z"
  },
  {
    "title": "US detains pro-Palestinian university student from India",
    "description": "The postdoctoral teacher and researcher has a valid student visa for the United States. Homeland security alleges he is \"actively spreading Hamas propaganda\" and \"promoting antisemitism.\" President Donald Trump's administration has detained an Indian citizen …",
    "link": "https://www.dw.com/en/us-detains-pro-palestinian-university-student-from-india/a-71983081",
    "timestamp": "2025-03-20T12:38:00Z"
  },
  {
    "title": "Most Markets Track Wall St Gains As Fed Soothes Tariff Fears",
    "description": "Markets have been seized by volatility recently as US President Donald Trump embarks on his hardball trade policy that has seen him impose painful duties on imports from major partners, stoking recession fears.",
    "link": "https://www.ibtimes.com/most-markets-track-wall-st-gains-fed-soothes-tariff-fears-3767065",
    "timestamp": "2025-03-20T12:38:00Z"
  },
  {
    "title": "Trump Lawyer Livid at Leak of Social Security Number",
    "description": "\"Donald Trump’s former campaign lawyer is furious after his personal information and social security number were made public as part of this week’s release of unredacted JFK assassination files,\" the Daily Beast reports. Said Joseph",
    "link": "https://politicalwire.com/2025/03/20/trump-lawyer-livid-at-leak-of-social-security-number/",
    "timestamp": "2025-03-20T12:37:50Z"
  },
  {
    "title": "Bank of England Votes to Hold Rates as Doves Turn Cautious",
    "description": "Three of the Bank of England’s more dovish members decided against another immediate interest-rate cut, as the panel held policy steady in the face of a turbulent global backdrop.",
    "link": "https://financialpost.com/pmn/business-pmn/bank-of-england-votes-to-hold-rates-as-doves-turn-cautious",
    "timestamp": "2025-03-20T12:37:36Z"
  },
  {
    "title": "Trump annexation taunts prompted defence talks with Europe, Joly says",
    "description": "Foreign Affairs Minister Mélanie Joly says Canada is in the \"advanced\" stages of negotiations with Europe on joining its new defence partnership — prompted in large part by growing concern about Russia's war in Ukraine and U.S. President Donald Trump's ongoin…",
    "link": "https://www.nationalobserver.com/2025/03/20/news/trump-annexation-taunts-defence-talks-europe-joly",
    "timestamp": "2025-03-20T12:37:13Z"
  },
  {
    "title": "Failed GOP Candidate Convicted Over Drive-By Shootings At Dem Officials' Homes",
    "description": "A jury convicted Solomon Peña on numerous federal charges in connection with a series of shootings in Albuquerque, New Mexico.",
    "link": "https://www.huffpost.com/entry/solomon-peña-convicted_n_67dc07b1e4b04be40e52e52c",
    "timestamp": "2025-03-20T12:37:04Z"
  },
  {
    "title": "Photo allegedly showing 1963 JFK letter about arresting Hillary Clinton is fake",
    "description": "A photo authentically shows a 1963 letter signed by former U.S. President John F. Kennedy, in which he wrote, \"I have information that will lead to the arrest of Hillary Clinton.\"",
    "link": "https://www.snopes.com//fact-check/jfk-letter-hillary-clinton-1963/",
    "timestamp": "2025-03-20T12:37:00Z"
  },
  {
    "title": "How Jeff Bezos Made Peace with Donald Trump",
    "description": "Financial Times: \"According to six people who have worked closely with him across Amazon, Blue Origin and The Washington Post, the decisions are part of a marked shift in Bezos’s strategy towards Trump. These people",
    "link": "https://politicalwire.com/2025/03/20/how-jeff-bezos-made-peace-with-donald-trump/",
    "timestamp": "2025-03-20T12:35:33Z"
  },
  {
    "title": "Netanyahu Gives John Fetterman Silver-Plated Pager as Ghoulish Gift",
    "description": "The Israeli prime minister previously gave Donald Trump one too.",
    "link": "https://gizmodo.com/netanyahu-gives-john-fetterman-silver-plated-pager-as-ghoulish-gift-2000578432",
    "timestamp": "2025-03-20T12:35:12Z"
  },
  {
    "title": "Hawley skeptical of Trump pick Oz: 'I hope he's changed his views'",
    "description": "Sen. Josh Hawley, R-Mo., demanded Trump CMS administrator nominee Dr. Mehmet Oz clarify past comments on abortion and transgender surgeries of minors.",
    "link": "https://www.foxnews.com/politics/hawley-skeptical-trump-pick-oz-i-hope-hes-changed-his-views",
    "timestamp": "2025-03-20T12:35:04Z"
  },
  {
    "title": "Russia, Ukraine ramp up drone attacks overnight despite truce talks",
    "description": "Kyiv strikes a strategic bomber base in Engels while Russia launches a series of drone strikes in eastern Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/3/20/russia-ukraine-ramp-up-drone-attacks-overnight-despite-truce-talks",
    "timestamp": "2025-03-20T12:34:34Z"
  },
  {
    "title": "US Judge blocks Trump’s military transgender ban",
    "description": "The US president’s policy is discriminatory and “soaked in animus,” Ana Reyes has ruled Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614533-trump-transgender-ilitary-ban/",
    "timestamp": "2025-03-20T12:33:41Z"
  },
  {
    "title": "B.C. Greens demand answers on emergency powers legislation proposed by NDP",
    "description": "British Columbia's Green Party says the NDP government needs to \"explain why\" its proposal for broad-reaching emergency cabinet powers is needed before its two members support the legislation.",
    "link": "https://www.nationalobserver.com/2025/03/20/news/bc-greens-emergency-powers-legislation-ndp",
    "timestamp": "2025-03-20T12:31:55Z"
  },
  {
    "title": "Trump Plans To Sign Executive Order Today Dismantling Education Department",
    "description": "The president has called for the Education Department to be “closed immediately.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/03/20/trump-plans-to-sign-executive-order-today-dismantling-education-department/",
    "timestamp": "2025-03-20T12:31:30Z"
  }
]