[
  {
    "title": "US stocks end lower as investors wait for Fed rate decision",
    "description": "Indian markets mirrored global trends as Wall Street closed lower, with investors anxiously awaiting the Federal Reserve's policy update. Hopes for a December rate cut persist, but uncertainty surrounds future moves. Treasury yields climbed, impacting equitie…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-lower-as-investors-wait-for-fed-rate-decision/articleshow/125856736.cms",
    "timestamp": "2025-12-09T01:51:48Z"
  },
  {
    "title": "David Spade slams mall tree-lighting ceremony for avoiding word Christmas",
    "description": "David Spade criticizes mall for avoiding \"Christmas\" at tree-lighting on \"Fly on the Wall\" podcast, sparking debate about holiday terminology and cultural sensitivities.",
    "link": "https://www.foxnews.com/entertainment/david-spade-slams-mall-tree-lighting-ceremony-avoiding-word-christmas",
    "timestamp": "2025-12-09T01:49:24Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,384",
    "description": "These are the key developments from day 1,384 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/9/russia-ukraine-war-list-of-key-events-day-1384",
    "timestamp": "2025-12-09T01:49:09Z"
  },
  {
    "title": "Top GOP senator says Crockett announcement exposes how 'radical' Dems are nationwide",
    "description": "Republican Sen. Tim Scott calls Democrat Jasmine Crockett's Texas Senate bid a sign of party's leftward shift in an exclusive interview about the 2026 race.",
    "link": "https://www.foxnews.com/politics/top-gop-senator-says-crockett-announcement-exposes-how-radical-dems-are-nationwide",
    "timestamp": "2025-12-09T01:45:15Z"
  },
  {
    "title": "‘Ice Maiden’ Susie Wiles Complains Traveling With Donald Trump Is a ‘Killer’",
    "description": "White House Chief of Staff Susie Wiles revealed insights into the president’s workday in a rare sit-down.",
    "link": "https://www.thedailybeast.com/ice-maiden-susie-wiles-complains-traveling-with-donald-trump-is-a-killer/",
    "timestamp": "2025-12-09T01:44:32Z"
  },
  {
    "title": "Trump approves sale of more advanced Nvidia computer chips used in AI to China",
    "description": "President Donald Trump says he will allow Nvidia to sell its H200 computer chip used in the development of artificial intelligence to “approved customers” in China",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-approves-sale-advanced-nvidia-computer-chips-ai-128224505",
    "timestamp": "2025-12-09T01:41:55Z"
  },
  {
    "title": "Trump threatens Mexico with 5% tariff over water dispute",
    "description": "US President Donald Trump on Monday threatened Mexico with tariffs, claiming in a Truth Social post that Mexico is violating its water treaty with the United States.“As of now, Mexico is not responding, and it is very unfair to our US Farmers who deserve this…",
    "link": "https://www.israelnationalnews.com/flashes/672007",
    "timestamp": "2025-12-09T01:41:20Z"
  },
  {
    "title": "Trump says U.S. will allow sale of Nvidia AI chips to China",
    "description": "President Donald Trump said Monday he had reached an agreement with President Xi Jinping to allow US chip giant Nvidia to export advanced artificial intelligence chips to China. The announcement marked a significant shift in U.S. export policy for advanced AI…",
    "link": "https://japantoday.com/category/tech/trump-says-us-will-allow-sale-of-nvidia-ai-chips-to-china",
    "timestamp": "2025-12-09T01:38:28Z"
  },
  {
    "title": "Trump slaps Mexico with 5 percent tariff over violations of water treaty",
    "description": "Leaders on both sides of the border have faced pressure from farmers and ranchers to secure more water for their farms.",
    "link": "https://www.aljazeera.com/news/2025/12/9/trump-slaps-mexico-with-5-percent-tariff-over-violations-of-water-treaty",
    "timestamp": "2025-12-09T01:37:56Z"
  },
  {
    "title": "DeSantis Drops the Hammer on Muslim Brotherhood, CAIR: 'EFFECTIVE IMMEDIATELY'",
    "description": "\"Florida agencies are hereby directed to undertake all lawful measures to prevent unlawful activities by these organizations, including...\"",
    "link": "https://www.westernjournal.com/desantis-drops-hammer-muslim-brotherhood-cair-effective-immediately/",
    "timestamp": "2025-12-09T01:37:52Z"
  },
  {
    "title": "Trump ban on wind power projects overturned by federal judge - NewsBreak",
    "description": "President Donald Trump halted permits for onshore and offshore wind projects on his first day in office. Judge Patti Saris of the U.S. District Court for t",
    "link": "https://www.newsbreak.com/share/4387569963837-trump-ban-on-wind-power-projects-overturned-by-federal-judge?_f=app_share&amp;pd=0DwEFBhy&amp;lang=en_US&amp;send_time=1765244108&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.33.1.14%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-09T01:36:29Z"
  },
  {
    "title": "'Hang onto to this clip': Trump official roundly mocked over 'golden age' proclamation",
    "description": "A cabinet official in the Trump administration stunned political analysts and observers on Monday when she claimed during a television interview that a \"golden age is right around the corner.\" Secretary of Agriculture Brooke Rollins was interviewed on Fox Bus…",
    "link": "https://www.rawstory.com/brooke-rollins-2674380809/",
    "timestamp": "2025-12-09T01:35:52Z"
  },
  {
    "title": "President Trump agrees to let Nvidia sell more powerful H200 GPUs to Chinese companies",
    "description": "U.S. President Donald Trump said today on social media that he will allow Nvidia Corp. to sell its H200 graphics processing units to “approved customers in China”, reversing a policy that had previously prohibited the product from being shipped to the country…",
    "link": "https://siliconangle.com/2025/12/08/president-trump-agrees-let-nvidia-sell-powerful-h200-gpus-chinese-companies/",
    "timestamp": "2025-12-09T01:35:33Z"
  },
  {
    "title": "MTG Responds To Trump Attack By Saying She Received Zero AIPAC Donations",
    "description": "Rep. Marjorie Taylor Greene fired back at President Donald Trump on Monday by pointing to what she said was proof of her \"America First\" credentials.",
    "link": "https://dailycaller.com/2025/12/08/mtg-responds-trump-attack-aipac/",
    "timestamp": "2025-12-09T01:32:10Z"
  },
  {
    "title": "Everything to Know About Michael Wolff: The Controversial Author Who Sued Melania Trump... and Exchanged Emails With Pedo Epstein and the Prez",
    "description": "Two of the three Jeffrey Epstein emails released by House Democrats were exchanges with author and journalist Michael Wolff.",
    "link": "https://okmagazine.com/p/who-is-michael-wolff-meet-the-journalist-center-jeffrey-epstein-emails/",
    "timestamp": "2025-12-09T01:30:00Z"
  },
  {
    "title": "CNBC Daily Open: Investors are loving the Paramount-Warner Bros-Netflix drama",
    "description": "Even as Paramount and Warner Brothers shares soared, the broader market declined as investors awaited the Fed's rate-setting meeting on Wednesday.",
    "link": "https://www.cnbc.com/2025/12/09/cnbc-daily-open-investors-are-loving-the-paramount-warner-bros-netflix-drama.html",
    "timestamp": "2025-12-09T01:29:29Z"
  },
  {
    "title": "Trump says US will allow sale of Nvidia AI chips to China",
    "description": "President Donald Trump said Monday he had reached an agreement with President Xi Jinping to allow US chip giant Nvidia to export advanced artificial intelligence chips to China. The announcement marked a significant shift in US export policy for advanced AI c…",
    "link": "https://www.digitaljournal.com/world/trump-says-us-will-allow-sale-of-nvidia-ai-chips-to-china/article",
    "timestamp": "2025-12-09T01:27:33Z"
  },
  {
    "title": "Rising living costs dim holiday sparkle for US households",
    "description": "At a Christmas market outside the US capital, festive cheer alone hasn’t been enough to drive affordability worries out of shoppers’ minds — as American households contend with creeping inflation this holiday season. “Prices are terrible. It makes it difficul…",
    "link": "https://www.digitaljournal.com/world/rising-living-costs-dim-holiday-sparkle-for-us-households/article",
    "timestamp": "2025-12-09T01:27:33Z"
  },
  {
    "title": "Former Colorado clerk will remain in prison after judge rejects bid for freedom",
    "description": "A judge rejected a bid by a former Colorado county clerk to be released from prison while she appeals her state conviction for orchestrating a scheme driven by false claims about voting machine fraud.",
    "link": "https://www.koaa.com/news/politics/former-colorado-clerk-will-remain-in-state-prison-after-a-federal-judge-rejects-her-bid-for-freedom",
    "timestamp": "2025-12-09T01:23:48Z"
  },
  {
    "title": "Europe Is 'Moving in Some Bad Directions' — Trump",
    "description": "Donald Trump voiced concern about the current political track taken by EU countriesWASHINGTON, December 9. /TASS/. US President Donald Trump criticized the fine imposed by the European Commission on X and warned that Europe is \"moving in some bad directions.\"…",
    "link": "https://freerepublic.com/focus/f-news/4356571/posts",
    "timestamp": "2025-12-09T01:23:16Z"
  },
  {
    "title": "Trump is giving farmers $12 billion in aid. They've been hit hard by his trade war with China",
    "description": "President Donald Trump unveiled a 12 billion dollar farm aid package. This support aims to assist farmers facing increased costs and trade war challenges. The White House stated the money will provide one-time payments to row-crop farmers. An additional 1 bil…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-is-giving-farmers-12b-in-aid-theyve-been-hit-hard-by-his-trade-war-with-china/articleshow/125855979.cms",
    "timestamp": "2025-12-09T01:22:47Z"
  },
  {
    "title": "Trump ban on wind power projects overturned by federal judge",
    "description": "A federal judge on Monday overturned President Donald Trump's sweeping ban on new wind power projects in the U.S., a major victory for an industry that has been singled out by the White House since the administration's first day.\nJudge Patti Saris of the U.S.…",
    "link": "https://biztoc.com/x/f5321683c3ff7997",
    "timestamp": "2025-12-09T01:22:29Z"
  },
  {
    "title": "Is Mamdani’s idealism already fading?",
    "description": "No one who has noticed the obsequiousness crouching behind Mayor-Elect Zohran Mamdani’s ideological fixity should have been surprised by the way he was played by Donald Trump when they met recently in the Oval Office. Mamdani, who seems to have sprung straigh…",
    "link": "https://biztoc.com/x/37ad9a6514b371c9",
    "timestamp": "2025-12-09T01:22:06Z"
  },
  {
    "title": "Putin won’t accept ANY peace deal until the cost of fighting on grows too great",
    "description": "It's plainly time for President Trump to up the economic pressure on Russia to get Vladimir Putin to the negotiating table.",
    "link": "https://nypost.com/2025/12/08/opinion/putin-wont-accept-any-peace-deal-until-the-cost-of-fighting-on-grows-too-great/",
    "timestamp": "2025-12-09T01:21:32Z"
  },
  {
    "title": "Newsmax GOP Strategists Turn On Trump Over Sexism",
    "description": "Two Republican pundits told Newsmax that President Donald Trump was making a mistake by launching seemingly sexist attacks on MAGA Rep. Marjorie Taylor Greene (R-GA) and female journalists.\n\n\nDuring a Monday panel, Republican strategist Melik Abdul said he wi…",
    "link": "https://crooksandliars.com/2025/12/middle-school-optics-newsmax-gop",
    "timestamp": "2025-12-09T01:20:23Z"
  },
  {
    "title": "Killings: US delegation hold talks with Benue clerics, monarchs",
    "description": "A US delegation on a fact-finding mission met with Benue clerics and monarchs to discuss the ongoing killings and alleged Christian persecution in Nigeria.\n\nRead More: https://punchng.com/killings-us-delegation-hold-talks-with-benue-clerics-monarchs/",
    "link": "https://punchng.com/killings-us-delegation-hold-talks-with-benue-clerics-monarchs/",
    "timestamp": "2025-12-09T01:18:35Z"
  },
  {
    "title": "Trump ban on wind power projects overturned by federal judge",
    "description": "Seventeen states led by New York Attorney General Letitia James sued Trump in May to overturn the president's ban.",
    "link": "https://www.cnbc.com/2025/12/08/trump-ban-on-wind-power-projects-overturned-by-federal-judge.html",
    "timestamp": "2025-12-09T01:18:16Z"
  },
  {
    "title": "Jimmy Kimmel Signs 1-Year ABC Extension: Will It Be His Final Run?",
    "description": "Just when Donald Trump, FCC Chair Brendan Carr, Nexstar, and Sinclair thought they had seen the last of late-night host Jimmy Kimmel over comments regarding the individual who killed conservative activist and advisor Charlie Kirk, Disney-owned ABC finally saw…",
    "link": "https://bleedingcool.com/tv/jimmy-kimmel-signs-1-year-abc-extension-will-it-be-his-final-run/",
    "timestamp": "2025-12-09T01:17:04Z"
  },
  {
    "title": "Drowsy Trump caught jerking awake during another Cabinet meeting",
    "description": "A sleepy President Donald Trump again appeared to nod off, this time during a White House Cabinet roundtable on Monday afternoon. The 79-year-old president, who could barely keep his eyes open during a Cabinet meeting last week, again struggled to stay awake …",
    "link": "https://www.rawstory.com/trump-cabinet-meeting-2674380767/",
    "timestamp": "2025-12-09T01:15:47Z"
  },
  {
    "title": "Listen to the people, President Trump — they really DO feel economic pain",
    "description": "President Donald Trump is stepping out of his White House bubble to address economic gloom; we expect he'll make time to listen as well as speechify.",
    "link": "https://nypost.com/2025/12/08/opinion/listen-to-the-people-president-trump-they-really-do-feel-economic-pain/",
    "timestamp": "2025-12-09T01:15:25Z"
  },
  {
    "title": "Trump Announces Bridge Payments for American Farmers",
    "description": "During a Monday round table with cabinet members, farmers and lawmakers, President Donald Trump announced the U.S. Department of Agriculture (USDA) will make $12 billion available in one-time bridge payments to American farmers in response to temporary trade …",
    "link": "https://agwired.com/2025/12/08/trump-announces-bridge-payments-for-american-farmers/",
    "timestamp": "2025-12-09T01:13:32Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy",
    "description": "A federal judge on Monday struck down President Donald Trump’s executive order blocking wind energy projects, saying the effort to halt virtually all leasing of wind farms on federal lands and waters was “arbitrary and capricious” and violates U.S. law. Judge…",
    "link": "https://japantoday.com/category/world/federal-judge-throws-out-trump-order-blocking-development-of-wind-energy1",
    "timestamp": "2025-12-09T01:12:50Z"
  },
  {
    "title": "Trump reverses US chip curbs in deal with Xi, allows Nvidia exports to China despite security fears",
    "description": "President Trump announced an agreement with China allowing Nvidia to export advanced H200 AI chips to approved customers, a reversal of Biden-era restrictions. Trump stated the deal will benefit American jobs and taxpayers, with a 25% payment to the US, while…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-reverses-us-chip-curbs-in-deal-with-xi-allows-nvidia-exports-to-china-despite-security-fears/articleshow/125855678.cms",
    "timestamp": "2025-12-09T01:11:49Z"
  },
  {
    "title": "Trump reverses US chip curbs in deal with Xi, allows Nvidia exports to China despite security fears",
    "description": "President Trump announced an agreement with China allowing Nvidia to export advanced H200 AI chips to approved customers, a reversal of Biden-era restrictions. Trump stated the deal will benefit American jobs and taxpayers, with a 25% payment to the US, while…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-reverses-us-chip-curbs-in-deal-with-xi-allows-nvidia-exports-to-china-despite-security-fears/articleshow/125855678.cms",
    "timestamp": "2025-12-09T01:11:49Z"
  },
  {
    "title": "Nicolle Wallace Lays Into Trump Over ‘Verbal Violence’ Against Female Reporters: ‘This Is Sick S–t’ | Video",
    "description": "\"We're either going to normalize this and usher in an era of unprecedented misogyny or that press corps is going to act as one and say, 'No more,'\" the MS NOW host adds\nThe post Nicolle Wallace Lays Into Trump Over ‘Verbal Violence’ Against Female Reporters: …",
    "link": "https://www.thewrap.com/nicolle-wallace-reacts-trump-rachel-scott-insult/",
    "timestamp": "2025-12-09T01:11:43Z"
  },
  {
    "title": "'They Cannot Do That': Donald Trump Warns India May Have To Pay Rice Export Tariffs",
    "description": "In a latest pushback against India, United States President Donald Trump has warned that he is ready to consider rice export tariffs on agricultural exports, including Indian rice. Trump's pushback was a direct response to farmers in the US drafting complaint…",
    "link": "https://www.ndtvprofit.com/business/they-cannot-do-that-donald-trump-warns-india-may-have-to-pay-rice-export-tariffs",
    "timestamp": "2025-12-09T01:10:53Z"
  },
  {
    "title": "Former Colorado clerk will remain in state prison after a federal judge rejects her bid for freedom",
    "description": "A federal magistrate judge has rejected a bid by a former Colorado county clerk to be released from prison while she appeals her state conviction for orchestrating a data breach scheme driven by false claims about voting machine fraud in the 2020 presi...",
    "link": "https://abcnews.go.com/Politics/wireStory/former-colorado-clerk-remain-state-prison-after-federal-128225587",
    "timestamp": "2025-12-09T01:09:57Z"
  },
  {
    "title": "Stocks in Asia edge lower as Fed anxiety builds",
    "description": "Asian shares dipped Tuesday as traders grew anxious about the Federal Reserve's future easing pace following an anticipated rate cut. US stock futures edged higher, while gold, silver, copper, and oil remained steady after Monday's declines. Beijing prioritiz…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-asia-edge-lower-as-fed-anxiety-builds/articleshow/125855410.cms",
    "timestamp": "2025-12-09T01:02:20Z"
  },
  {
    "title": "Honduras is still waiting for the final presidential election count, over a week after the vote",
    "description": "Honduras is still waiting for final election results, more than a week after voting for a new president",
    "link": "https://abcnews.go.com/International/wireStory/honduras-waiting-final-presidential-election-count-week-after-128227176",
    "timestamp": "2025-12-09T01:01:39Z"
  },
  {
    "title": "ABC extends Jimmy Kimmel contract despite outrage over Charlie Kirk comments",
    "description": "Jimmy Kimmel's late-night show has been extended for one more year, according to a statement from the ABC television network.The show was taken off the air in September after Kimmel implied that the suspect in the assassination of Charlie Kirk had been a memb…",
    "link": "https://www.theblaze.com/news/kimmel-contract-extend-kirk-comments",
    "timestamp": "2025-12-09T01:01:04Z"
  },
  {
    "title": "'Fix this now!' Raging Trump hits Mexico with new threat",
    "description": "President Donald Trump took to his Truth Social platform on Monday to demand that Mexico release vast amounts of water to the United States — or face yet another round of tariffs.\"Mexico continues to violate our comprehensive Water Treaty, and this violation …",
    "link": "https://www.rawstory.com/trump-tariffs-2674380755/",
    "timestamp": "2025-12-09T01:00:37Z"
  },
  {
    "title": "Trump’s worries mount",
    "description": "Venezuela strikes, Hegseth leaks irk Republicans",
    "link": "https://www.thehindubusinessline.com/opinion/trumps-worries-mount/article70373234.ece",
    "timestamp": "2025-12-09T01:00:00Z"
  },
  {
    "title": "Will 2025 be the year that MAGA broke apart?",
    "description": "What if President Donald Trump’s “America First” agenda was merely a smokescreen for him to obtain power, wealth, recognition, and fame? What if he leveraged conservative political platforms and their talking points to his advantage, but he never truly believ…",
    "link": "https://www.activistpost.com/will-2025-be-the-year-that-maga-broke-apart/",
    "timestamp": "2025-12-09T01:00:00Z"
  },
  {
    "title": "Why Elizabeth Warren and Donald Trump Hate the Netflix Deal",
    "description": "This week, editors Peter Suderman, Katherine Mangu-Ward, and Matt Welch are joined by associate editor Liz Wolfe to sort through the political free-for-all surrounding the Warner Bros. and Netflix merger. They look at why Sen. Elizabeth Warren (D–Mass.) is ur…",
    "link": "https://biztoc.com/x/24add0b6f23691c4",
    "timestamp": "2025-12-09T00:59:47Z"
  },
  {
    "title": "Jasmine Crockett Posts Bizarre Video of Herself Smiling While Trump Insults Her Half a Dozen Times",
    "description": "Rep. Jasmine Crockett launched her Texas Senate bid with a bizarre video, showing the congresswoman staring and smiling as audio of Trump insulting her played.\nThe post Jasmine Crockett Posts Bizarre Video of Herself Smiling While Trump Insults Her Half a Doz…",
    "link": "https://www.mediaite.com/politics/jasmine-crockett-posts-bizarre-video-of-herself-smiling-while-trump-insults-her-half-a-dozen-times/",
    "timestamp": "2025-12-09T00:59:44Z"
  },
  {
    "title": "Sylvester Stallone's wife praises Florida as a family ‘rebirth’ after fleeing Hollywood lifestyle",
    "description": "Sylvester Stallone and wife Jennifer Flavin are thriving after leaving Hollywood for Florida, calling the move a \"rebirth\" for their entire family.",
    "link": "https://www.foxnews.com/entertainment/sylvester-stallones-wife-praises-florida-family-rebirth-after-fleeing-hollywood-lifestyle",
    "timestamp": "2025-12-09T00:58:55Z"
  },
  {
    "title": "Clinton-Appointed Judge Rules Trump Cannot Block New Wind Farms",
    "description": "Judge Patti Saris ruled Monday to overturn President Donald Trump's order directing agencies to pause issuing new or renewed wind project permits.",
    "link": "https://dailycaller.com/2025/12/08/clinton-appointed-judge-rules-trump-cannot-block-new-wind-farms/",
    "timestamp": "2025-12-09T00:57:49Z"
  },
  {
    "title": "Dan Bongino Admits to Lying During His Pundit Days",
    "description": "Before he joined the FBI, Bongino spread bogus claims about the January 6 pipe bomber—and now says he did it because he was getting paid.",
    "link": "https://www.theatlantic.com/newsletters/2025/12/dan-bongino-january-6-pipe-bomber/685188/",
    "timestamp": "2025-12-09T00:57:00Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy (Associated Press)",
    "description": "Associated Press:\nFederal judge throws out Trump order blocking development of wind energy  —  A federal judge on Monday struck down President Donald Trump's executive order blocking wind energy projects, saying the effort to halt virtually all leasing of win…",
    "link": "https://www.memeorandum.com/251208/p138",
    "timestamp": "2025-12-09T00:55:01Z"
  },
  {
    "title": "Honduras Still Has No President-Elect Week After Vote",
    "description": "Honduras on Sunday marked a week without definitive vote results from the Honduran National Electoral Council (CNE) indicating who won the November 30 presidential election.\nThe post Honduras Still Has No President-Elect Week After Vote appeared first on Brei…",
    "link": "https://www.breitbart.com/latin-america/2025/12/08/honduras-still-has-no-president-elect-week-after-vote/",
    "timestamp": "2025-12-09T00:54:11Z"
  },
  {
    "title": "Reporter told Trump 'I ask questions, not permission'?",
    "description": "In December 2025, CNBC reporter Megan Cassella said to U.S. President Donald Trump: \"Sir, you are the president, not God,\" and \"Mr. President, I ask questions, not permission.\"",
    "link": "https://www.snopes.com//fact-check/reporter-trump-questions-permission/",
    "timestamp": "2025-12-09T00:54:00Z"
  },
  {
    "title": "Fox’s Brit Hume Says Trump’s Tariffs Are ‘Hurting’ Farmers: ‘No Getting Around It’",
    "description": "Fox News Chief Political Analyst Brit Hume noted that President Donald Trump's tariffs have been brutal for U.S. farmers.\nThe post Fox’s Brit Hume Says Trump’s Tariffs Are ‘Hurting’ Farmers: ‘No Getting Around It’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-brit-hume-says-trumps-tariffs-are-hurting-farmers-no-getting-around-it/",
    "timestamp": "2025-12-09T00:53:04Z"
  },
  {
    "title": "'Amazing!' CNN anchor taken aback as Hegseth caught bashing 'armchair tough guy' Trump",
    "description": "A CNN anchor was taken aback on Monday night after an investigation revealed more clips of Defense Secretary Pete Hegseth bashing President Donald Trump before he joined the administration. On Monday, CNN's KFile revealed new video of Hegseth questioning whet…",
    "link": "https://www.rawstory.com/erin-burnett-2674380751/",
    "timestamp": "2025-12-09T00:52:11Z"
  },
  {
    "title": "Ukraine to receive $800M in US support for 2026-2027",
    "description": "On Sunday, December 7, US lawmakers unveiled the final text of the defense policy bill, which includes record funding for national security as well as aid for Ukraine, according to Reuters, Fox News, and AOL.Media reports state that the bill allocates $901 bi…",
    "link": "https://freerepublic.com/focus/f-news/4356564/posts",
    "timestamp": "2025-12-09T00:50:12Z"
  },
  {
    "title": "Indiana state senators advance GOP-drawn congressional map, setting up a final vote",
    "description": "A committee of Indiana state lawmakers on Monday advanced a Republican-drawn congressional map, sending it to the floor of the state Senate where its outcome remains uncertain",
    "link": "https://www.nbcnews.com/politics/elections/indiana-state-senators-advance-gop-drawn-congressional-map-rcna247996",
    "timestamp": "2025-12-09T00:48:52Z"
  },
  {
    "title": "Nvidia wins Trump’s approval to sell H200 AI chips in China",
    "description": "U.S. President Donald Trump has granted Nvidia permission to ship its H200 artificial intelligence chip to China in exchange for a 25% surcharge, a move that lets the world’s most valuable company potentially regain billions of dollars in lost business from a…",
    "link": "https://biztoc.com/x/d49292f286f55fd6",
    "timestamp": "2025-12-09T00:48:39Z"
  },
  {
    "title": "The NY Times suddenly discovers the Biden border crisis — long after it matters",
    "description": "The New York Times has invented a new genre of reporting — covering big stories showing Democrats in a bad light years after the events that matter.",
    "link": "https://nypost.com/2025/12/08/opinion/the-ny-times-suddenly-discovers-the-biden-border-crisis-long-after-it-matters/",
    "timestamp": "2025-12-09T00:48:37Z"
  },
  {
    "title": "Finland Says ‘Trump’s Peace’ in Ukraine Must Be Just and Lasting",
    "description": "President Donald Trump should make sure any deal with Russia to end its war in Ukraine leads to a lasting peace, said Finnish Foreign Minister Elina Valtonen.\n“I’m a little bit worried now, to be honest, what the next days and weeks will bring,” Valtonen said…",
    "link": "https://biztoc.com/x/973660f67ad90fdb",
    "timestamp": "2025-12-09T00:48:24Z"
  },
  {
    "title": "Trump to permit Nvidia to ship H200 artificial intelligence chips to China",
    "description": "US President Donald Trump on Monday said Nvidia will be allowed to ship its H200 artificial intelligence chips to “approved customers” in China and elsewhere, on the condition that the US gets a 25% cut.In a post on Truth Social, Trump wrote that Chinese Pres…",
    "link": "https://www.israelnationalnews.com/flashes/672005",
    "timestamp": "2025-12-09T00:47:57Z"
  },
  {
    "title": "MS NOW's McCaskill: U.S. Supreme Court Is Making Trump a King",
    "description": "MS NOW contributor Claire McCaskill said Monday on \"Deadline\" that the Supreme Court was making President Donald Trump a king.\nThe post MS NOW’s McCaskill: U.S. Supreme Court Is Making Trump a King appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/12/08/ms-nows-mccaskill-u-s-supreme-court-is-making-trump-a-king/",
    "timestamp": "2025-12-09T00:46:19Z"
  },
  {
    "title": "Why Elizabeth Warren and Donald Trump Hate the Netflix Deal",
    "description": "Plus: Trump’s economy shows new signs of strain, Congress pushes a $900 billion defense package, and Kalshi stirs backlash over “financializing everything”",
    "link": "https://reason.com/podcast/2025/12/08/why-elizabeth-warren-and-donald-trump-hate-the-netflix-deal/",
    "timestamp": "2025-12-09T00:40:34Z"
  },
  {
    "title": "Trump threatens Mexico with even higher tariffs | CNN Business",
    "description": "President Donald Trump on Monday said Mexico was treating America’s farmers unfairly, and he threatened the country with his favorite weapon in his economic war chest: Higher tariffs.",
    "link": "https://www.cnn.com/2025/12/08/business/trump-threatens-mexico-with-even-higher-tariffs",
    "timestamp": "2025-12-09T00:38:28Z"
  },
  {
    "title": "Tracking the retirement announcements of members of Congress",
    "description": "Midterm elections are historically tough on the party of the sitting president",
    "link": "https://abcnews.go.com/Politics/wireStory/tracking-retirement-announcements-members-congress-128212302",
    "timestamp": "2025-12-09T00:37:34Z"
  },
  {
    "title": "Tracking the retirement announcements of members of Congress",
    "description": "Midterm elections are historically tough on the party of the sitting president",
    "link": "https://abcnews.go.com/US/wireStory/tracking-retirement-announcements-members-congress-128226741",
    "timestamp": "2025-12-09T00:37:32Z"
  },
  {
    "title": "Jimmy Kimmel Inks 1-Year ‘Jimmy Kimmel Live! ' Extension After Controversy",
    "description": "Jimmy Kimmel will return to host his late night show for at least another year despite months of controversy and attacks from the sitting president. On Monday, December 8, ABC re-signed the television host to a one-year contract extension. His previous multiy…",
    "link": "https://www.usmagazine.com/celebrity-news/news/jimmy-kimmel-signs-1-year-jimmy-kimmel-live-extension-after-suspension/#article",
    "timestamp": "2025-12-09T00:37:26Z"
  },
  {
    "title": "Dem Rep. Crow: I Won't Sit for FBI Interview, 'I'm Not Going to Be Threatened'",
    "description": "Monday on CNN's \"The Arena,\" Rep. Jason Crow (D-CO) said he would not cooperate with the FBI investigation into a video he made about military orders.\nThe post Dem Rep. Crow: I Won’t Sit for FBI Interview, ‘I’m Not Going to Be Threatened’ appeared first on Br…",
    "link": "https://www.breitbart.com/clips/2025/12/08/dem-rep-crow-i-wont-sit-for-fbi-interview-im-not-going-to-be-threatened/",
    "timestamp": "2025-12-09T00:37:13Z"
  },
  {
    "title": "US judge rejects Trump administration's halt of wind energy permits",
    "description": "A federal judge has ruled against President Trump's administration. The administration had paused all federal approvals for wind energy projects. The judge found the agencies did not explain this indefinite halt. This ruling is a victory for states fighting c…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-judge-rejects-trump-administrations-halt-of-wind-energy-permits/articleshow/125854700.cms",
    "timestamp": "2025-12-09T00:34:28Z"
  },
  {
    "title": "U.S. Department of Justice launches investigation into Colorado prisons, youth detention centers",
    "description": "The Department of Justice, in a letter to Gov. Jared Polis, says it will determine whether the constitutional rights of prisoners and detainees are being violated.",
    "link": "https://www.denverpost.com/2025/12/08/department-of-justice-investigation-colorado-prisons/",
    "timestamp": "2025-12-09T00:33:25Z"
  },
  {
    "title": "Supreme Court win for Trump in FTC case would restore the Founders’ design",
    "description": "The Supreme Court will now decide whether the people we elect to govern us get to do so — or whether appointed commissioners and their staff can run the country on autopilot.",
    "link": "https://nypost.com/2025/12/08/opinion/supreme-court-win-for-trump-in-ftc-case-would-restore-the-founders-design/",
    "timestamp": "2025-12-09T00:33:18Z"
  },
  {
    "title": "Minnesota's ag commissioner calls $12 billion farm bailout 'needed and welcome'",
    "description": "Thom Petersen said the federal relief will hit much of Minnesota's ag industry, as farmer lender mediation notices are up, along with bankruptcies and overall stress.",
    "link": "https://www.inforum.com/business/minnesotas-ag-commissioner-calls-12-billion-farm-bailout-needed-and-welcome",
    "timestamp": "2025-12-09T00:30:37Z"
  },
  {
    "title": "Trump Farmer Bailout Primarily Benefits Commodity Farms",
    "description": "December 8, 2025 – The Trump administration announced Monday it will provide $12 billion in economic aid for farmers, with the bulk of the funds reserved for commodity crop farmers. Following months of pronouncements from the administration that the president…",
    "link": "https://civileats.com/2025/12/08/trump-farmer-bailout-primarily-benefits-commodity-farms/",
    "timestamp": "2025-12-09T00:30:17Z"
  },
  {
    "title": "Trump gives green light to Nvidia to ship powerful AI chips to China despite national security fears",
    "description": "Allowing the shipments could signal a friendlier approach to China, after Trump and Xi brokered a truce in the two countries' trade and tech war in late October.",
    "link": "https://nypost.com/2025/12/08/business/trump-gives-green-light-to-nvidia-to-ship-powerful-ai-chips-to-china/",
    "timestamp": "2025-12-09T00:29:40Z"
  },
  {
    "title": "Trump proposes $12 billion bailout package for farmers affected by his tariffs",
    "description": "The president floated a plan to help farmers struggling under his tariff regime.",
    "link": "https://www.salon.com/2025/12/08/trump-proposes-12-billion-bailout-package-for-farmers-affected-by-his-tariffs/",
    "timestamp": "2025-12-09T00:28:33Z"
  },
  {
    "title": "Trump signals possible new tariffs on Indian rice amid farm pressure",
    "description": "President Trump indicated potential new tariffs on Indian rice, citing \"dumping\" concerns and aiming to support US farmers. This move, alongside possible tariffs on Canadian fertilizer, signals ongoing trade tensions with key partners as the US administration…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-signals-possible-new-tariffs-on-indian-rice-amid-farm-pressure/articleshow/125854542.cms",
    "timestamp": "2025-12-09T00:28:21Z"
  },
  {
    "title": "Megyn Kelly Attacks Jimmy Kimmel’s Wife With Callback to Trump’s Menstruation Jab: ‘Bleeding Out of Our Wherevers’ | Video",
    "description": "\"If it's all about your period and you're on the Left, it's great,\" the host adds\nThe post Megyn Kelly Attacks Jimmy Kimmel’s Wife With Callback to Trump’s Menstruation Jab: ‘Bleeding Out of Our Wherevers’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/megyn-kelly-trump-menstruation-attack-jimmy-kimmel-wife/",
    "timestamp": "2025-12-09T00:26:04Z"
  },
  {
    "title": "Jimmy Kimmel signs ABC extension through 2027",
    "description": "President Donald Trump won’t be getting his wish. ABC said Monday it has signed late-night comic Jimmy Kimmel to a one-year contract extension.\nKimmel’s previous, multiyear contract had been set to expire next May, so the extension will keep him on the air un…",
    "link": "https://biztoc.com/x/e2cf5d291e281340",
    "timestamp": "2025-12-09T00:26:03Z"
  },
  {
    "title": "Trump says he’ll allow Nvidia to sell advanced chips to ‘approved customers’ in China",
    "description": "President Donald Trump said Monday that he would allow Nvidia to sell an advanced type of computer chip used in the development of artificial intelligence to “approved customers” in China.\nThere have been concerns about allowing advanced computer chips to be …",
    "link": "https://biztoc.com/x/5c8ceb8b5f704b31",
    "timestamp": "2025-12-09T00:25:58Z"
  },
  {
    "title": "Trump says he’ll allow Nvidia to sell advanced chips to ‘approved customers’ in China",
    "description": "President Donald Trump said Monday that he would allow Nvidia to sell an advanced type of computer chip used in the development of artificial intelligence to “approved customers” in China.\nThere have been concerns about allowing advanced computer chips to be …",
    "link": "https://biztoc.com/x/5c8ceb8b5f704b31",
    "timestamp": "2025-12-09T00:25:58Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy",
    "description": "WASHINGTON (AP) — A federal judge on Monday struck down President Donald Trump’s executive order blocking wind energy projects, saying the effort to halt virtually all leasing of wind farms on federal lands and waters was “arbitrary and capricious” and violat…",
    "link": "https://financialpost.com/pmn/federal-judge-throws-out-trump-order-blocking-development-of-wind-energy",
    "timestamp": "2025-12-09T00:25:31Z"
  },
  {
    "title": "Journal of Free Speech Law: \"Incitement, Enthusiasm, and the Dangers of Negligent Protest,\" by John Inazu",
    "description": "From the \"Gitlow v. New York at 100\" symposium, held this year at the Arizona State University Sandra Day O'Connor College of Law.",
    "link": "https://reason.com/volokh/2025/12/09/journal-of-free-speech-law-incitement-enthusiasm-and-the-dangers-of-negligent-protest-by-john-inazu/",
    "timestamp": "2025-12-09T00:21:14Z"
  },
  {
    "title": "Sydney Sweeney Addresses Plastic Surgery Rumors After ‘MAGA’ Makeover Controversy",
    "description": "The actor made the confession after being asked to \"debunk\" a \"beauty rumor\" about herself.",
    "link": "https://www.huffpost.com/entry/sydney-sweeney-plastic-surgery-rumors_n_69370437e4b0020dff814b27",
    "timestamp": "2025-12-09T00:20:27Z"
  },
  {
    "title": "Trump says he’ll allow Nvidia to sell advanced chips to ‘approved customers’ in China",
    "description": "Trump said on social media that he had informed China's leader Xi Jinping about his decision and “President Xi responded positively!”",
    "link": "https://fortune.com/2025/12/08/trump-nvidia-china-chip-sales-approved-customers-xi-jinping-jensen-huang/",
    "timestamp": "2025-12-09T00:15:03Z"
  },
  {
    "title": "US tariffs ruin education dreams for children in India’s diamond hub",
    "description": "For decades, India's diamond industry offered workers a way to a better income and life for their families. Not anymore.",
    "link": "https://www.aljazeera.com/economy/2025/12/9/us-tariffs-ruin-education-dreams-for-children-in-indias-diamond-hub",
    "timestamp": "2025-12-09T00:13:25Z"
  },
  {
    "title": "20 Signs There's An Affordability Crisis In America",
    "description": "Retail, dining and debt data all point to growing strain on household budgets as voter unease over rising costs intensifies.",
    "link": "https://www.forbes.com/sites/martinacastellanos/2025/12/08/20-signs-theres-an-affordability-crisis-in-america/",
    "timestamp": "2025-12-09T00:13:24Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy",
    "description": "The judge ruled in favor of a coalition of state attorneys general from 17 states and Washington, D.C.",
    "link": "https://www.bostonherald.com/2025/12/08/trump-wind-energy-lawsuit-block/",
    "timestamp": "2025-12-09T00:12:54Z"
  },
  {
    "title": "Trump to offer bailout to a small minority of the people damaged by his tariffs",
    "description": "There’s a club and the overwhelming likelihood is that you’re not in it: President Donald Trump announced a $12 billion farm aid package Monday — a boost to farmers who have struggled to sell their crops while getting hit by rising costs after the president r…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/trump-to-offer-bailout-to-a-small-minority-of-the-people-damaged-by-his-tariffs",
    "timestamp": "2025-12-09T00:12:26Z"
  },
  {
    "title": "Trump approves sale of more advanced Nvidia computer chips used in AI to China",
    "description": "President Donald Trump says he will allow Nvidia to sell its H200 computer chip used in the development of artificial intelligence to “approved customers” in China",
    "link": "https://www.wsbtv.com/news/business/trump-approves-sale/NO5BC6EY3I24DM6I6QHMHPXJSQ/",
    "timestamp": "2025-12-09T00:12:20Z"
  },
  {
    "title": "Federal judge throws out Trump order blocking development of wind energy",
    "description": "A federal judge has struck down President Donald Trump’s executive order blocking wind energy projects, saying the effort to halt virtually all leasing of wind farms on federal lands and waters was “arbitrary and capricious” and violates U.S. law. Judge Patti…",
    "link": "https://apnews.com/article/trump-wind-power-offshore-attorney-general-a8c2f1201ac6b0607e8c4a1c36e651ba",
    "timestamp": "2025-12-09T00:10:56Z"
  },
  {
    "title": "Jimmy Kimmel Live! renewed through 2027: Contract extension secured for ABC late-night show",
    "description": "Jimmy Kimmel Live! has been renewed through 2027, extending the host's contract with ABC. This comes after a period of criticism from Donald Trump and a brief suspension for offensive remarks. Despite past hints of retirement, Kimmel will continue his late-ni…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jimmy-kimmel-live-renewed-through-2027-contract-extension-secured-for-abc-late-night-show/articleshow/125852894.cms",
    "timestamp": "2025-12-09T00:10:18Z"
  },
  {
    "title": "Trump Can't Stop Insulting Female Reporters",
    "description": "\"You are the most obnoxious reporter in the whole place,\" the president railed at one.",
    "link": "https://www.huffpost.com/entry/trump-attacks-female-reporters_n_69373cb6e4b013f1f7d29998",
    "timestamp": "2025-12-09T00:06:43Z"
  },
  {
    "title": "Trump is giving farmers $12B in aid. They've been hit hard by his trade war with China",
    "description": "President Donald Trump is giving farmers some $12 billion in aid to help as they struggle to sell their crops while getting hit by rising costs",
    "link": "https://abcnews.go.com/Business/wireStory/trump-giving-farmers-12b-aid-hit-hard-trade-128208154",
    "timestamp": "2025-12-09T00:05:34Z"
  },
  {
    "title": "Majority of Justices Seem Prepared to Hold that the President Can Control the Executive Branch",
    "description": "Who controls the executive branch of government? For more than two hours on Monday, the Supreme Court listened to U.S. Solicitor General John Sauer and... Read More\nThe post Majority of Justices Seem Prepared to Hold that the President Can Control the Executi…",
    "link": "https://www.dailysignal.com/2025/12/08/majority-of-justices-seem-prepared-to-hold-that-the-president-can-control-the-executive-branch/",
    "timestamp": "2025-12-09T00:04:30Z"
  },
  {
    "title": "Report Tracks Trump 'War on Free Speech' and Urges Systemic Resistance",
    "description": "The US advocacy group Free Press on Monday released a report examining how President Donald Trump and \"his political enablers have worked to undermine and chill the most basic freedoms protected under the First Amendment\" since the Republican returned to the …",
    "link": "https://www.commondreams.org/news/trump-first-amendment",
    "timestamp": "2025-12-09T00:04:09Z"
  },
  {
    "title": "Trump gives Nvidia green light to sell advanced AI chips to China",
    "description": "Trump gives Nvidia green light to sell advanced AI chips to China\nUS President Donald Trump has announced that he will allow AI chip maker Nvidia to sell its advanced H200 chips to \"approved customers\" in China.\n\"We will protect National Security, create Amer…",
    "link": "https://biztoc.com/x/0532b117959aef1a",
    "timestamp": "2025-12-09T00:03:24Z"
  },
  {
    "title": "'Donald Trump is in hell': President's 'greatest triumph' soured by 'very weird' ceremony",
    "description": "President Donald Trump hosted the first Kennedy Center Honors ceremony of his second term last weekend, and one reporter in attendance described the night as \"very weird.\"In a Monday article in The Atlantic, writer Alexandra Petri noted that she had always be…",
    "link": "https://www.rawstory.com/alternet-posts/trump-kennedy-center-honors/",
    "timestamp": "2025-12-09T00:02:35Z"
  },
  {
    "title": "Hollywood star reveals what he thinks of potential Newsom presidency with two-word response",
    "description": "Hollywood action star Lorenzo Lamas recoiled at the thought of California Democratic Gov. Gavin Newsom leading the United States in the country’s highest elected office.",
    "link": "https://www.foxnews.com/politics/hollywood-star-reveals-what-he-thinks-potential-newsom-presidency-two-word-response",
    "timestamp": "2025-12-09T00:02:30Z"
  },
  {
    "title": "US Supreme Court likely to back Trump to fire independent agency board members",
    "description": "The apex court was hearing the argument revolving around the legality of President Trump’s firing of a Federal Trade Commission (FTC) member.",
    "link": "https://indianexpress.com/article/world/us-supreme-court-likely-to-back-trump-to-fire-independent-agency-board-members-10410085/",
    "timestamp": "2025-12-09T00:02:16Z"
  }
]