[
  {
    "title": "‘Real Time’s Bill Maher Takes Swipe At Taylor Swift & Makes Her The Punchline Of Donald Trump Joke",
    "description": "Bill Maher seems unafraid of the Swifties coming after him after swiping at Taylor Swift during his opening monologue of Real Time. The host and comedian opened his show talking about Donald Trump and his chaotic second run as president, attacking allies like…",
    "link": "http://deadline.com/2025/03/real-time-bill-maher-swipe-taylor-swift-punchline-donald-trump-joke-1236314773/",
    "timestamp": "2025-03-08T03:33:16Z"
  },
  {
    "title": "Is Trump reining in Musk after a cabinet showdown with secretaries?",
    "description": "The president intervenes in a cost-cutting row after a reported showdown between his billionaire adviser and two top officials at the White House.",
    "link": "https://www.bbc.com/news/articles/cpwd1722yr2o",
    "timestamp": "2025-03-08T03:31:04Z"
  },
  {
    "title": "'You numskulls!' MSNBC's Rachel Maddow unloads over Trump's 'transgender mice' claim",
    "description": "MSNBC’s Rachel Maddow let the insults spew Friday night as she sounded off on President Donald Trump and his Republican allies in Congress over the wild – and false – claim that the government supposedly spent millions to make “mice transgender.” The network …",
    "link": "https://www.rawstory.com/trump-speech-2671289766/",
    "timestamp": "2025-03-08T03:30:02Z"
  },
  {
    "title": "Trump signs executive action targeting public service loan program",
    "description": "The program forgives the loans of borrowers who work in public service. The executive action would exclude those who work for certain organizations.",
    "link": "https://www.npr.org/2025/03/07/nx-s1-5321313/trump-executive-action-public-service-loan-program",
    "timestamp": "2025-03-08T03:27:08Z"
  },
  {
    "title": "Trump signs executive action targeting public service loan program",
    "description": "The program forgives the loans of borrowers who work in public service. The executive action would exclude those who work for certain organizations.",
    "link": "https://www.kpbs.org/news/education/2025/03/07/trump-signs-executive-action-targeting-public-service-loan-program",
    "timestamp": "2025-03-08T03:27:08Z"
  },
  {
    "title": "Trump Appoints Former Aide Indicted in Classified Documents Case to U.S. Naval Academy Board",
    "description": "President Donald Trump announced on Friday night that he named a former indicted co-conspirator of his to the U.S. Naval Academy Board of Visitors.\nThe post Trump Appoints Former Aide Indicted in Classified Documents Case to U.S. Naval Academy Board first app…",
    "link": "https://www.mediaite.com/trump/trump-appoints-former-aide-indicted-in-classified-documents-case-to-u-s-naval-academy-board/",
    "timestamp": "2025-03-08T03:26:12Z"
  },
  {
    "title": "Trump critic Rosie O’Donnell hints that she moved abroad following the election: ‘New adventures’",
    "description": "Rosie was tooling \"around the countryside on the wrong side of the road.\"",
    "link": "https://nypost.com/2025/03/07/entertainment/trump-critic-rosie-odonnell-hints-that-she-moved-abroad-after-election/",
    "timestamp": "2025-03-08T03:23:04Z"
  },
  {
    "title": "Trump to Iran: Let's Make a Deal?",
    "description": "Is this another Godfather-esque play to make Ali Khamenei an offer he can't refuse? Is it a reversal on Barack Obama's JCPOA? Or is it a way to de-escalate with both Russia and China and dial down tensions by restoring commerce as the main medium of internati…",
    "link": "https://freerepublic.com/focus/f-news/4302892/posts",
    "timestamp": "2025-03-08T03:19:56Z"
  },
  {
    "title": "US Labor Department reinstates more than 100 workers targeted in Trump job cuts, union says",
    "description": "The U.S. Department of Labor has reinstated about 120 employees who were facing termination as part of the Trump administration's mass firings of recently hired workers, a union said on Friday.",
    "link": "https://nypost.com/2025/03/07/business/us-labor-department-reinstates-workers-targeted-in-trump-job-cuts-union-says/",
    "timestamp": "2025-03-08T03:17:12Z"
  },
  {
    "title": "Sam Bankman-Fried's jailhouse chat with Tucker Carlson lands him in solitary confinement",
    "description": "Sam Bankman-Fried, founder of the now-defunct cryptocurrency exchange FTX who's serving prison time for fraud, was tossed into solitary confinement after a jailhouse interview aired between him and former Fox News host Tucker Carlson.Bankman-Fried is serving …",
    "link": "https://www.rawstory.com/sam-bankman-fried-2671290101/",
    "timestamp": "2025-03-08T03:13:39Z"
  },
  {
    "title": "Trump’s Ukraine envoy on intelligence support pause: ‘They brought it on themselves’ - The Hill",
    "description": "Trump’s Ukraine envoy on intelligence support pause: ‘They brought it on themselves’The Hill Ukrainian studying at Iowa State reacts to recent Trump administration actionsKCCI Des Moines Donald Trump’s chokehold on UkraineThe Economist Can the U.S.-Ukrainian …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176647699",
    "timestamp": "2025-03-08T03:12:54Z"
  },
  {
    "title": "Donald Trump Appoints Fox News’ Maria Bartiromo And Laura Ingraham To Kennedy Center Board",
    "description": "Donald Trump said Friday that he has appointed Fox News’ Laura Ingraham and Maria Bartiromo to the board of the Kennedy Center, filling out the board with more of his supporters. Trump wrote on Truth Social, “I am thrilled to announce that Laura Ingraham and …",
    "link": "http://deadline.com/2025/03/trump-kennedy-center-laura-ingraham-maria-bartiromo-1236314762/",
    "timestamp": "2025-03-08T03:12:28Z"
  },
  {
    "title": "The Mayor....Rus Thompson....Has Passed Away",
    "description": "Just saw this post on his Facebook page, written by his wife and guardian angel, Mrs Mayor. I’m broken..... We all are. >>>>>He fought the good fight, and he fought the good fight of faith. Rest in peace Rus Thompson, together forever with our Lord.",
    "link": "https://freerepublic.com/focus/f-news/4302888/posts",
    "timestamp": "2025-03-08T03:07:50Z"
  },
  {
    "title": "CANCELLED: $600,000 grant to study “menstrual cycles in transgender men”",
    "description": "CANCELLED: $600,000 grant to study “menstrual cycles in transgender men”",
    "link": "https://freerepublic.com/focus/f-news/4302887/posts",
    "timestamp": "2025-03-08T03:07:23Z"
  },
  {
    "title": "Donald Trump Responds to Reported 'Clash' Between Elon Musk, Marco Rubio",
    "description": "President Trump on Friday told reporters that there was no \"clash\" between Musk and Rubio during a Thursday meeting.",
    "link": "https://biztoc.com/x/a14ccfa9c9688b9a",
    "timestamp": "2025-03-08T03:06:40Z"
  },
  {
    "title": "Manitoba PC leadership candidates condemn Trump tariffs, hold fire against president himself",
    "description": "The candidates to lead Manitoba's Progressive Conservative Party condemned Donald Trump's tariffs on Canadian goods on Friday but were more circumspect about their opinions of the U.S. president himself.",
    "link": "https://www.cbc.ca/news/canada/manitoba/pc-leadership-candidates-trump-1.7478428",
    "timestamp": "2025-03-08T03:05:53Z"
  },
  {
    "title": "Donald Trump Responds to Reported 'Clash' Between Elon Musk, Marco Rubio",
    "description": "President Trump on Friday told reporters that there was no \"clash\" between Musk and Rubio during a Thursday meeting.",
    "link": "https://www.newsweek.com/donald-trump-responds-reported-clash-between-elon-musk-marco-rubio-2041575",
    "timestamp": "2025-03-08T03:05:09Z"
  },
  {
    "title": "Independence in focus in Greenland vote, with Donald Trump as backdrop",
    "description": "Greenland's legislative elections focus on independence from Denmark, influenced by recent US interest. Most parties support sovereignty but differ on timelines. Current government sees economic self-sufficiency as a prerequisite, while social issues like edu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/independence-in-focus-in-greenland-vote-with-donald-trump-as-backdrop/articleshow/118797288.cms",
    "timestamp": "2025-03-08T03:04:44Z"
  },
  {
    "title": "Black conservatives are the ‘tragic mulattos’ of American politics",
    "description": "Ben Shapiro’s recent video arguing President Trump should pardon Derek Chauvin elicited passionate responses on social media. Some conservative commentators thought it was a bad idea that would cost the president precious political capital. Others believed Tr…",
    "link": "https://www.theblaze.com/columns/opinion/black-conservatives-are-the-tragic-mulattos-of-american-politics",
    "timestamp": "2025-03-08T03:00:00Z"
  },
  {
    "title": "Trump has a new European leader coming to his doorstep",
    "description": "Mark Carney, Canada’s likely next prime minister, continues to be held in high regard across the Atlantic, where he spent the better part of the last decade.",
    "link": "https://www.politico.eu/article/us-donald-trump-new-european-leader-canada-mark-carney/",
    "timestamp": "2025-03-08T03:00:00Z"
  },
  {
    "title": "Georgia lawmakers pass bill that could let Trump, others recover costs of election meddling case",
    "description": "ATLANTA (AP) — Georgia’s Senate passed a bill that could allow President Donald Trump and more than a dozen people to seek compensation for legal bills stemming from an attempt to overturn his 2020 election loss in the state. The bill passed unanimously by st…",
    "link": "https://freerepublic.com/focus/f-news/4302885/posts",
    "timestamp": "2025-03-08T02:59:19Z"
  },
  {
    "title": "Elon Musk vs Marco Rubio: What Happened At Explosive Trump Cabinet Showdown",
    "description": "US President Donald Trump watched a volley of attacks exchanged between billionaire advisor Elon Musk and Secretary of State Marco Rubio.",
    "link": "https://www.ndtv.com/world-news/fire-more-fire-faster-donald-trump-referees-elon-musk-vs-marco-rubio-white-house-showdown-7874906",
    "timestamp": "2025-03-08T02:58:43Z"
  },
  {
    "title": "US drops antitrust case against Google over AI, not Chrome",
    "description": "The U.S. Department of Justice dropped a proposal Friday to force Alphabet's Google to sell its investments in artificial intelligence companies, including OpenAI competitor Anthropic, to boost competition in online search.\n\n\nThe DOJ and a coalition of 38 sta…",
    "link": "https://www.voanews.com/a/us-drops-antitrust-case-against-google-over-ai-not-chrome/8003388.html",
    "timestamp": "2025-03-08T02:57:47Z"
  },
  {
    "title": "Carville scolds Democrats for 'foolishness' at Trump's address while US faces 'greatest peril' in 80 years",
    "description": "Veteran Democratic strategist James Carville criticized Democrats for their reactions to President Donald Trump's joint address to Congress on Tuesday, describing their behavior as \"foolishness\" on Wednesday. Carville expressed his disappointment with Democra…",
    "link": "https://freerepublic.com/focus/f-chat/4302884/posts",
    "timestamp": "2025-03-08T02:55:37Z"
  },
  {
    "title": "Trump considers pulling troops out of Germany (Connor Stringer/Telegraph)",
    "description": "Connor Stringer / Telegraph:\nTrump considers pulling troops out of Germany  —  It is understood that the president is considering redeploying personnel to Hungary, which has maintained a close relationship with Russia  —  Donald Trump is considering pulling U…",
    "link": "https://www.memeorandum.com/250307/p136",
    "timestamp": "2025-03-08T02:55:00Z"
  },
  {
    "title": "This Trump Voter Is Having Second Thoughts After ICE Agents Detained Him at Gunpoint",
    "description": "A naturalized U.S. citizen said Friday that he's questioning his vote for President Donald Trump after he was wrongfully swept up in the Republican president's immigration crackdown.\n\nJensy Machado \ntold Telemundo 44's Rosbelis Quinoñez that he was driving to…",
    "link": "https://www.commondreams.org/news/wrongfully-detained-by-ice",
    "timestamp": "2025-03-08T02:49:22Z"
  },
  {
    "title": "'Canada is cheating!' Trump defends latest huge tariff threat with Truth Social manifesto",
    "description": "President Donald Trump defended his latest controversial round of tariffs in an evening post to his Truth Social platform on Friday.The new tariffs in question, which hit Canada with new duties on lumber and dairy that could reach up to 250 percent, have alre…",
    "link": "https://www.rawstory.com/trump-canada-cheating/",
    "timestamp": "2025-03-08T02:45:10Z"
  },
  {
    "title": "Elon Musk’s Starlink has a growing footprint in the federal government",
    "description": "The use of Starlink has been adopted by at least one additional federal agency since Donald Trump began his second presidential term.",
    "link": "https://biztoc.com/x/b28b0fe6fce945c3",
    "timestamp": "2025-03-08T02:44:23Z"
  },
  {
    "title": "US drops bid to make Google sell AI investments in antitrust case",
    "description": "The DOJ still seeks a court order requiring Google to sell off its Chrome browser and take other measures aimed at addressing what a judge said was Google's illegal search monopoly, according to court papers filed in Washington.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-drops-bid-to-make-google-sell-ai-investments-in-antitrust-case/articleshow/118797134.cms",
    "timestamp": "2025-03-08T02:44:11Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?s=a2&amp;share_destination_id=MTM1ODcyNzIyLTE3NDE0MDE4MTc0MDE%3D&amp;pd=09C6hWpd&amp;hl=en_US&amp;send_time=1741401817&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-control%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v1%2Cns_foryou_recall_exp_25q1-control",
    "timestamp": "2025-03-08T02:44:02Z"
  },
  {
    "title": "Wall Street ends higher after Fed chief's comments, but posts big weekly loss",
    "description": "The benchmark S&P 500 finished with its biggest weekly loss since September. The S&P 500 and the Nasdaq also registered their third straight week of declines, the longest losing streak since mid-July and early August last year.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-after-fed-chiefs-comments-but-posts-big-weekly-loss/articleshow/118797109.cms",
    "timestamp": "2025-03-08T02:40:44Z"
  },
  {
    "title": "PRAYER REQUESTS - 3/8/2025 [PRAYER]",
    "description": "Welcome to the PRAYER REQUESTS thread. This daily thread is a listing of prayer requests that have been posted by Freepers to the main forum who wish to have continued prayer. Hopefully this thread will remind us to continually pray for our fellow Freepers’ c…",
    "link": "https://freerepublic.com/focus/f-religion/4302882/posts",
    "timestamp": "2025-03-08T02:38:35Z"
  },
  {
    "title": "A single day of Trump and Musk's cost-cutting campaign remakes huge sections of government",
    "description": "President Donald Trump and Elon Musk's campaign of disruption is engulfing the federal government",
    "link": "https://abcnews.go.com/US/wireStory/single-day-trump-musks-cost-cutting-campaign-remakes-119573686",
    "timestamp": "2025-03-08T02:38:28Z"
  },
  {
    "title": "Trump names anchors Laura Ingraham, Maria Bartiromo to Kennedy Center board after seizing control",
    "description": "President Donald Trump said on Friday he is appointing Fox News host Laura Ingraham and Fox Business anchor Maria Bartiromo to the board of the John F. Kennedy Center for the Performing Arts.",
    "link": "https://nypost.com/2025/03/07/us-news/trump-names-anchors-laura-ingraham-maria-bartiromo-to-kennedy-center-board-after-seizing-control/",
    "timestamp": "2025-03-08T02:35:34Z"
  },
  {
    "title": "Ryan Routh's attorneys want to test fire weapon allegedly intended to assassinate Donald Trump (Dave Bohman/WPTV News Channel 5 West Palm)",
    "description": "Dave Bohman / WPTV News Channel 5 West Palm:\nRyan Routh's attorneys want to test fire weapon allegedly intended to assassinate Donald Trump  —  Defense lawyers want to test rifle for ‘operability, accuracy and range’  —  FORT PIERCE, Fla. — Attorneys for a ma…",
    "link": "https://www.memeorandum.com/250307/p135",
    "timestamp": "2025-03-08T02:35:00Z"
  },
  {
    "title": "US carries out first firing squad execution since 2010",
    "description": "A South Carolina man convicted of murdering his ex-girlfriend’s parents with a baseball bat was put to death by firing squad on Friday in the first such execution in the United States in 15 years. Brad Sigmon, 67, was executed by a three-person firing squad a…",
    "link": "https://punchng.com/us-carries-out-first-firing-squad-execution-since-2010/",
    "timestamp": "2025-03-08T02:34:36Z"
  },
  {
    "title": "Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol",
    "description": "Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitolnews4jax.com",
    "link": "https://www.news4jax.com/news/politics/2025/03/08/trump-organization-sues-capital-one-for-closing-bank-accounts-after-jan-6-attack-on-us-capitol/",
    "timestamp": "2025-03-08T02:30:38Z"
  },
  {
    "title": "‘You’re not supposed to be asking that’: Trump refuses to answer questions about Musk",
    "description": "President Donald Trump lashed out at an NBC News reporter during a Friday afternoon Q&A in the Oval Office, refusing to answer questions about Elon Musk, who serves as a Senior Advisor to the President. Musk has been widely regarded as leading the controversi…",
    "link": "https://www.rawstory.com/elon-musk-trump-2671289900/",
    "timestamp": "2025-03-08T02:30:03Z"
  },
  {
    "title": "'I Hate Her!': Everything Donald Trump Has Said About Taylor Swift Including Comments on Her Appearance and Relationship With Travis Kelce",
    "description": "Donald Trump has made numerous remarks about Taylor Swift, often commenting on both her career and political views over the years.",
    "link": "https://okmagazine.com/p/donald-trump-said-taylor-swift/",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Trump threatens Russia with new sanctions in push for peace talks",
    "description": "US president Donald Trump raised the prospect of imposing large-scale sanctions on Russia yesterday, days after pausing aid and intelligence sharing to Ukraine, and called on both countries to get on with negotiating a peace deal.",
    "link": "https://www.independent.ie/world-news/trump-threatens-russia-with-new-sanctions-in-push-for-peace-talks/a1535753985.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "‘Don’t screw it up’: how Micheál Martin can avoid a Trump-lashing at the White House",
    "description": "Having spent months at the heart of Donald Trump’s first administration, Sean Spicer is ready to offer advice to Micheál Martin as he prepares to meet the US president in the Oval Office next week.",
    "link": "https://www.independent.ie/news/dont-screw-it-up-how-micheal-martin-can-avoid-a-trump-lashing-at-the-white-house/a1858334414.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Donald Trump’s USAid cuts fuel new crisis for humanitarian groups working in Gaza",
    "description": "The Trump administration’s cuts to USAid have frozen hundreds of millions of dollars in contractual payments to aid groups, leaving them paying out of pocket to preserve a fragile ceasefire, according to officials from the humanitarian agency.",
    "link": "https://www.independent.ie/world-news/middle-east/donald-trumps-usaid-cuts-fuel-new-crisis-for-humanitarian-groups-working-in-gaza/a225773959.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Donald Trump says he wants to do nuclear deal with Iran",
    "description": "US president Donald Trump has said he wants to negotiate a nuclear deal with Iran and sent a letter to its leadership this week suggesting talks with the Islamic Republic, which the West fears is rapidly nearing the capability to make atomic weapons.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-he-wants-to-do-nuclear-deal-with-iran/a1854848958.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Taoiseach represents EU interests on St Patrick’s visit to the White House",
    "description": "Warm welcomes in the Oval Office were once as dependable as green beer and shamrocks are on St ­Patrick’s Day in the United States.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-taoiseach-represents-eu-interests-on-st-patricks-visit-to-the-white-house/a1831352976.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Tánaiste was only EU counterpart that US secretary of state addressed ‘trade imbalance’ with, according to readouts",
    "description": "The phone call between Tánaiste Simon Harris and US secretary of state Marco Rubio was the only time the US said the so-called “trade imbalance” was addressed by Mr Rubio with an EU counterpart.",
    "link": "https://www.independent.ie/irish-news/tanaiste-was-only-eu-counterpart-that-us-secretary-of-state-addressed-trade-imbalance-with-according-to-readouts/a650462347.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Letters: Trump’s blatant lies on EU prove Ireland no longer has a friend in Uncle Sam",
    "description": "In light of the extraordinary turn of events in the US over the last few weeks, it is so difficult to listen to the blatant lies and untruths coming out of the mouth of the US president.",
    "link": "https://www.independent.ie/opinion/letters/letters-trumps-blatant-lies-on-eu-prove-ireland-no-longer-has-a-friend-in-uncle-sam/a1412473630.html",
    "timestamp": "2025-03-08T02:30:00Z"
  },
  {
    "title": "Trump administration cancels $400M in grants and contracts with Columbia University",
    "description": "The Trump administration is pulling $400 million from Columbia University due to the institution's perceived failure to address antisemitism. Columbia has initiated measures to investigate students critical of Israel, but these actions were deemed insufficien…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-cancels-400m-in-grants-and-contracts-with-columbia-university/articleshow/118797026.cms",
    "timestamp": "2025-03-08T02:29:55Z"
  },
  {
    "title": "Trump says considering large-scale sanctions on Russia until Ukraine deal reached",
    "description": "WASHINGTON, March 7 (Xinhua) -- U.S. President Donald Trump said on Friday that he is",
    "link": "http://en.people.cn/n3/2025/0308/c90000-20286738.html",
    "timestamp": "2025-03-08T02:29:37Z"
  },
  {
    "title": "Why are probationary federal workers being fired?",
    "description": "California and 19 other states are suing multiple federal agencies, contending President Donald Trump’s administration has illegally fired thousands of…",
    "link": "https://www.nbcbayarea.com/news/local/states-sue-trump-doge-federal-workers-fired/3812322/",
    "timestamp": "2025-03-08T02:27:01Z"
  },
  {
    "title": "Donald Trump order denies student loan relief to nonprofit workers engaged in 'improper' activity",
    "description": "President Trump has signed an executive order to modify the Public Service Loan Forgiveness program, excluding loan forgiveness for workers involved in illegal immigration, terrorism, or other illegal activities. This decision is likely to face legal challeng…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-order-denies-student-loan-relief-to-nonprofit-workers-engaged-in-improper-activity/articleshow/118796991.cms",
    "timestamp": "2025-03-08T02:25:23Z"
  },
  {
    "title": "China to impose new tariffs on Canadian farm, food products",
    "description": "China said Saturday it would slap tariffs on Canadian products, including rapeseed oil and pork, after a Beijing probe into levies imposed by Ottawa on Chinese goods last year. Beijing’s commerce ministry said it would hit imported rapeseed oil, oil cakes, an…",
    "link": "https://punchng.com/china-to-impose-new-tariffs-on-canadian-farm-food-products/",
    "timestamp": "2025-03-08T02:24:01Z"
  },
  {
    "title": "Protesters rally against Trump's proposed cuts to research funding, DEI",
    "description": "Organizers said they were encouraged by the high turnout Friday and hopeful that the rally could be a jumping-off point for continued advocacy for scientific research in the area.",
    "link": "https://www.inquirer.com/health/trump-research-dei-cuts-protest-city-hall-20250307.html",
    "timestamp": "2025-03-08T02:23:55Z"
  },
  {
    "title": "'Believe it when I see it': Federal workers have 'zero optimism' Trump will rein in Musk",
    "description": "According to New York Times reporters Jonathan Swan and Maggie Haberman, Tesla and SpaceX CEO Elon Musk had a heated argument with Secretary of State Marco Rubio during a Thursday, March 6 meeting in the White House that President Donald Trump attended. Musk,…",
    "link": "https://www.rawstory.com/donald-trump-elon-musk-2671289974/",
    "timestamp": "2025-03-08T02:22:25Z"
  },
  {
    "title": "Trump’s Crypto Summit Heavy on Victory Laps, Light on Regulation",
    "description": ", the crypto industry came to Washington D.C. Specifically, they came to the White House’s State Dining Room, where the nation’s first ever “Crypto Summit” was held.\nPresident Donald Trump, flanked by Treasury Secretary Scott Bessent, Commerce Secretary Howar…",
    "link": "https://biztoc.com/x/4df0250e80567e71",
    "timestamp": "2025-03-08T02:22:07Z"
  },
  {
    "title": "DOGE job cuts bring pain to Trump heartland",
    "description": "Jennifer Piggott, a former Trump supporter, regrets her choice after being fired from her job at the Treasury Department’s Bureau of Fiscal Service. Following significant cuts led by the Trump administration and Elon Musk's cost-cutting efforts, hundreds of f…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/doge-job-cuts-bring-pain-to-trump-heartland/articleshow/118796957.cms",
    "timestamp": "2025-03-08T02:20:02Z"
  },
  {
    "title": "\"Can't Sell Anything In India\": Trump Repeats \"Massive Tariffs\" Remark",
    "description": "Donald Trump, who took office on January 20, has continuously criticised India for high tariffs imposed by India and other countries.",
    "link": "https://www.ndtv.com/world-news/donald-trump-on-indias-massive-tariffs-you-cant-sell-anything-7874759",
    "timestamp": "2025-03-08T02:19:15Z"
  },
  {
    "title": "Trump Gives D.C. Mayor Ultimatum On City’s Widespread Homeless Encampments",
    "description": "America’s major cities are crumbling under Democrat leadership. From San Francisco to Chicago, urban centers have become showcases of dysfunction rather than beacons of prosperity. The pattern repeats itself with disturbing predictability. Beautiful, historic…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302879/posts",
    "timestamp": "2025-03-08T02:18:59Z"
  },
  {
    "title": "Trump wrote to Iran's leader about that country's nuclear program and expects results 'very soon'",
    "description": "President Trump seeks a new nuclear deal with Iran, sending a letter to Supreme Leader Ali Khamenei. Trump emphasizes diplomacy but hints at potential military action if negotiations fail, amid heightened tensions over Iran’s advancing uranium enrichment near…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-wrote-to-irans-leader-about-that-countrys-nuclear-program-and-expects-results-very-soon/articleshow/118796949.cms",
    "timestamp": "2025-03-08T02:18:53Z"
  },
  {
    "title": "‘Incompetence Mixed With Idiocy’: Gregg Jarrett Slams Secret Service Failures In DOJ’s ‘Strongest’ Case Against Routh",
    "description": "Jarrett called out Secret Service over their failures to prevent Trump's second attacker, as the DOJ has the \"strongest\" case against the attempted assassin.",
    "link": "https://dailycaller.com/2025/03/07/gregg-jarrett-secret-service-doj-ryan-wesley-routh/",
    "timestamp": "2025-03-08T02:17:01Z"
  },
  {
    "title": "Trump Appoints Laura Ingraham, Maria Bartiromo to Join Kennedy Center Board",
    "description": "President Donald Trump announced that Fox News's Laura Ingraham and Maria Bartiromo will be joining the board at the John F. Kennedy Center for the Performing Arts, adding that he looks \"forward to restoring the Center to Greatness.\"\nThe post Trump Appoints L…",
    "link": "https://www.breitbart.com/politics/2025/03/07/trump-appoints-laura-ingraham-maria-bartiromo-to-join-kennedy-center-board/",
    "timestamp": "2025-03-08T02:16:35Z"
  },
  {
    "title": "Trump announces US ambassador nominations that include mayor of Michigan city",
    "description": "President Donald Trump Friday night announced a number of U.S. ambassador appointments, including to Kuwait, Lebanon, Morocco and the Food and Agriculture Organization of the U.N.",
    "link": "https://www.foxnews.com/politics/trump-announces-slew-us-ambassador-nominations-includes-mayor-michigan-city",
    "timestamp": "2025-03-08T02:12:41Z"
  },
  {
    "title": "Trump Appoints Fox News Hosts to Kennedy Center Board",
    "description": "President Donald Trump announced on Friday night that he had added Fox News hosts Maria Bartiromo and Laura Ingraham to the board of trustees at the John F. Kennedy Center for the Performing Arts. The announcement came weeks after Trump fired much of the venu…",
    "link": "https://www.mediaite.com/trump/trump-appoints-two-fox-news-hosts-to-kennedy-center-board/",
    "timestamp": "2025-03-08T02:10:20Z"
  },
  {
    "title": "Free Republic on the Last Day of 2016, 29 Stories",
    "description": "Happy New Year 2017 - Mar a LagoBiggest Snowflake Meltdowns on College Campuses in 2016Senator McCain says U.S. stands with Ukraine against Russia (When did he become president?)Geraldine Ferraro's son pardoned for 1988 cocaine convictionTexas judge halts fed…",
    "link": "https://freerepublic.com/focus/f-chat/4302875/posts",
    "timestamp": "2025-03-08T02:09:07Z"
  },
  {
    "title": "Why Ireland's politicians say St Patrick's Washington trip makes a difference",
    "description": "Politicians from the island of Ireland are visiting Washington DC this week - but it's not without controversy.",
    "link": "https://www.bbc.com/news/articles/c17qnxrq1y7o",
    "timestamp": "2025-03-08T02:08:51Z"
  },
  {
    "title": "Vladimir Putin Ready For Ukraine Truce Talks. But There Are Conditions",
    "description": "Russian officials conveyed their willingness to consider a short-term truce, provided there was progress toward a final peace settlement.",
    "link": "https://www.ndtv.com/world-news/vladimir-putin-ready-for-ukraine-truce-talks-but-there-are-conditions-7874727",
    "timestamp": "2025-03-08T02:07:24Z"
  },
  {
    "title": "Will US Abolish Daylight Saving Time? Elon Musk Conducts Poll",
    "description": "Both Elon Musk and US President Donald Trump have repeatedly talked about doing away with Daylight Saving Time (DST).",
    "link": "https://www.ndtv.com/world-news/will-us-abolish-daylight-saving-time-elon-musk-conducts-poll-7874726",
    "timestamp": "2025-03-08T02:07:20Z"
  },
  {
    "title": "US Bitcoin reserve prompts $370 million in ETF outflows: Farside",
    "description": "Bitcoin ETF outflows indicate institutional investors are wary of “digital gold” after Trump’s March 6 executive order disappointed traders.",
    "link": "https://cointelegraph.com/news/bitcoin-etf-flows-rise-us-reserve-aids-institutional-uptake",
    "timestamp": "2025-03-08T02:06:12Z"
  },
  {
    "title": "US President Donald Trump 'strongly considering' new sanctions on Russia",
    "description": "US President Donald Trump has described Russia as easier to deal with compared to Ukraine as he considers fresh sanctions on Moscow.",
    "link": "https://www.abc.net.au/news/2025-03-08/us-president-trump-strongly-considering-sanctions-on-russia/105026642",
    "timestamp": "2025-03-08T02:04:58Z"
  },
  {
    "title": "'Pissed off': Canadians drop their politeness in the wake of Trump's tariffs",
    "description": "President Donald Trump’s tariffs on Canadian goods are eroding the inherent politeness of Americans’ northern neighbors and rallying them around their own flag.",
    "link": "https://www.nbcnews.com/politics/trump-administration/pissed-canadians-drop-politeness-trumps-tariffs-rcna195420",
    "timestamp": "2025-03-08T02:00:45Z"
  },
  {
    "title": "Scientists Rally In US Cities To Protest Trump Cuts",
    "description": "Scientists rallied in cities across the United States on Friday to denounce efforts by the administration of US President Donald Trump to eliminate key staff across multiple agencies and curb life-saving research.",
    "link": "https://www.ibtimes.com/scientists-rally-us-cities-protest-trump-cuts-3765597",
    "timestamp": "2025-03-08T02:00:27Z"
  },
  {
    "title": "Climate Change Weekly # 536 — Budget-Busting Climate Provisions in the Inflation Reduction Act Must Go",
    "description": "Budget-Busting Climate Provisions in the Inflation Reduction Act Must Go\n\nAtlantic Circulation Not Waning in Response to Climate Change\n\nCrops Doing Fine, Increase in Social Cost of Carbon Calculation Was Unwarranted",
    "link": "https://wattsupwiththat.com/2025/03/07/climate-change-weekly-536-budget-busting-climate-provisions-in-the-inflation-reduction-act-must-go/",
    "timestamp": "2025-03-08T02:00:00Z"
  },
  {
    "title": "US Steel CEOs Urge Trump to Resist Metal Tariff Exemptions",
    "description": "The CEOs of the three largest American steelmakers are urging US President Donald Trump to resist giving any tariff exemptions on imports of the alloy.",
    "link": "https://www.livemint.com/companies/news/us-steel-ceos-urge-trump-to-resist-metal-tariff-exemptions-11741399176408.html",
    "timestamp": "2025-03-08T01:59:35Z"
  },
  {
    "title": "Elon Musk’s Starlink has a growing footprint in the federal government",
    "description": "The use of Starlink has been adopted by at least one additional federal agency since Donald Trump began his second presidential term.",
    "link": "https://www.nbcnews.com/tech/elon-musk/elon-musk-starlink-growing-footprint-federal-government-rcna195400",
    "timestamp": "2025-03-08T01:56:36Z"
  },
  {
    "title": "It’s as if petulant Zelensky has two dads . . . and they just don’t understand him at all",
    "description": "Before any deal ending the war can be possible, either Donald Trump or Volodymyr Zelensky is going to have to act as if he’s changed his mind — and we know it won’t be Trump.",
    "link": "https://nypost.com/2025/03/07/opinion/its-as-if-zelensky-has-two-dads-who-just-dont-understand-him/",
    "timestamp": "2025-03-08T01:55:21Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?_f=app_share&amp;pd=0FX3gPwK&amp;lang=en_US&amp;send_time=1741398855&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v18&amp;s=i2",
    "timestamp": "2025-03-08T01:54:54Z"
  },
  {
    "title": "Finally, a week of relief: D-Street takes biggest leap of the year",
    "description": "The NSE Nifty ended 0.03% or 7.8 points higher to close at 22,552.50. The BSE Sensex declined 0.01% or 7.51 points to close at 74,332.58. Both indices rose 1.9% this week, the first advance after three weeks.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/finally-a-week-of-relief-d-street-takes-biggest-leap-of-the-year/articleshow/118796802.cms",
    "timestamp": "2025-03-08T01:53:24Z"
  },
  {
    "title": "Top oil executives reckon with downturn even as Trump cheers them on",
    "description": "CERAWEEK-ENERGY/PREVIEW (PIX):CERAWEEK-Top oil executives reckon with downturn even as Trump cheers them on",
    "link": "https://www.livemint.com/companies/news/top-oil-executives-reckon-with-downturn-even-as-trump-cheers-them-on-11741398612494.html",
    "timestamp": "2025-03-08T01:50:12Z"
  },
  {
    "title": "At crypto summit, Donald Trump says US will be 'the Bitcoin superpower'",
    "description": "Trump was holding a first-of-its-kind \"crypto summit,\" meeting face-to-face with the leaders of virtually all of the top crypto companies in the United States. Only a small portion of the gathering, which was scheduled to last four hours, was broadcast to the…",
    "link": "https://economictimes.indiatimes.com/tech/technology/at-crypto-summit-donald-trump-says-us-will-be-the-bitcoin-superpower/articleshow/118796788.cms",
    "timestamp": "2025-03-08T01:48:58Z"
  },
  {
    "title": "Japanese stocks expected to remain on downward trend amid tariff turmoil",
    "description": "Uncertainties over U.S. President Donald Trump's tariffs this week pushed the Nikkei 225 index below 37,000 for the first time in six months.",
    "link": "https://www.japantimes.co.jp/business/2025/03/08/markets/japanese-stocks-downward-trend/",
    "timestamp": "2025-03-08T01:48:00Z"
  },
  {
    "title": "Mitch Landrieu: 'Donald Trump Is a Traitor to This Country'",
    "description": "Former New Orleans Mayor Mitch Landrieu said Friday on MSNBC's \"Deadline\" that President Donald Trump is a \"traitor to this country.\"\nThe post Mitch Landrieu: ‘Donald Trump Is a Traitor to This Country’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/03/07/mitch-landrieu-donald-trump-is-a-traitor-to-this-country/",
    "timestamp": "2025-03-08T01:47:42Z"
  },
  {
    "title": "San Jose Lawyer Who Allegedly Fled From Atherton Home Over Visa Fraud Is Extradited From Kyrgyz Republic",
    "description": "Trump administration says ‘gold card’ will replace EB-5 visa programA 60-year-old former Atherton resident who had a San Jose law practice has been extradited from the Kyrgyz Republic in central Asia to face fraud charges in federal court in San Jose related …",
    "link": "https://freerepublic.com/focus/f-news/4302870/posts",
    "timestamp": "2025-03-08T01:47:05Z"
  },
  {
    "title": "Trump says Ukraine 'more difficult' to deal with than Russia",
    "description": "It may be 'easier dealing with' Moscow than Kyiv, the US president told reporters in the White House.",
    "link": "https://www.bbc.com/news/articles/crknjxj3n4zo",
    "timestamp": "2025-03-08T01:46:48Z"
  },
  {
    "title": "Crypto leaders meet at Donald Trump's summit with strategic reserve in focus",
    "description": "U.S. President Donald Trump hosted a cryptocurrency summit at the White House, focusing on plans for a government-owned reserve of digital assets. The initiative includes an executive order to develop budget-neutral strategies for acquiring bitcoin, utilizing…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/crypto-leaders-meet-at-donald-trumps-summit-with-strategic-reserve-in-focus/articleshow/118796763.cms",
    "timestamp": "2025-03-08T01:43:25Z"
  },
  {
    "title": "The Joe Biden ‘Now They Tell Us’ Phenomenon",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Joe Biden ‘Now They Tell Us’ Phenomenon appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/03/07/the-joe-biden-now-they-tell-us-phenomenon/",
    "timestamp": "2025-03-08T01:42:13Z"
  },
  {
    "title": "Chris Hayes Credits Fox’s Maria Bartiromo for Trump Pushback: ‘I’ve Been a Critic – But When You’re Right, You’re Right’",
    "description": "MSNBC's Chris Hayes gave a compliment to Fox host Maria Bartiromo for telling President Donald Trump his whirlwind trade policies are causing economic uncertainty. \nThe post Chris Hayes Credits Fox’s Maria Bartiromo for Trump Pushback: ‘I’ve Been a Critic – B…",
    "link": "https://www.mediaite.com/tv/chris-hayes-credits-foxs-maria-bartiromo-for-trump-pushback-ive-been-a-critic-but-when-youre-right-youre-right/",
    "timestamp": "2025-03-08T01:40:56Z"
  },
  {
    "title": "Alan Dershowitz Says No Legal Ground For Schools To Sue Trump As Taxpayer Money Must Not Fund Political Programs",
    "description": "Alan Dershowitz said on Newsmax Friday that there is no legal basis for universities to use taxpayer funds to support political programs.",
    "link": "https://dailycaller.com/2025/03/07/alan-dershowitz-columbia-sue-trump/",
    "timestamp": "2025-03-08T01:35:10Z"
  },
  {
    "title": "Justice Dept. says ending Louisiana petrochemical case helps 'dismantle radical DEI programs'",
    "description": "The Justice Department is celebrating its decision to drop a federal lawsuit against a Louisiana petrochemical plant accused of worsening cancer risks for residents in a majority-Black community",
    "link": "https://abcnews.go.com/US/wireStory/justice-dept-ending-louisiana-petrochemical-case-helps-dismantle-119576469",
    "timestamp": "2025-03-08T01:34:28Z"
  },
  {
    "title": "Tokyo responds to President Trump remarks on 'interesting' Japan-U.S. security pact",
    "description": "U.S. President Donald Trump complained Thursday that his country's bilateral security arrangement with Japan, signed in 1960, was one-sided. In response, Japan pointed out the cooperative nature of the agreement. “I love Japan. We have a great relationship wi…",
    "link": "https://freerepublic.com/focus/f-news/4302867/posts",
    "timestamp": "2025-03-08T01:33:04Z"
  },
  {
    "title": "Donald Trump claims India has agreed to slash its tariffs after ‘being exposed’",
    "description": "US President Donald Trump has asserted that India has agreed to lower tariffs on American imports, stating that his administration is exposing unfair trade practices. The claim comes as India and the US discuss a Bilateral Trade Agreement (BTA) aimed at reduc…",
    "link": "https://economictimes.indiatimes.com/news/india/donald-trump-claims-india-has-agreed-to-slash-its-tariffs-after-being-exposed/articleshow/118796720.cms",
    "timestamp": "2025-03-08T01:33:04Z"
  },
  {
    "title": "Fold Holdings Acquires 475 Bitcoin To Strengthen Corporate Treasury – Details",
    "description": "Fold Holdings, a US-based Bitcoin (BTC) financial services firm, announced today the addition of 475 BTC to its corporate treasury. This acquisition positions Fold Holdings among the top 10 US public companies with the largest Bitcoin reserves. Fold Holdings …",
    "link": "https://bitcoinist.com/fold-holdings-acquires-475-bitcoin-to-strengthen-corporate-treasury-details/",
    "timestamp": "2025-03-08T01:30:31Z"
  },
  {
    "title": "ServiceNow to Grow in Florida, Will Keep HQ in California",
    "description": "Software firm ServiceNow Inc is planning a major expansion in West Palm Beach and has explored relocating its headquarters there from Silicon Valley, according to two people familiar with the idea, boosting the South Florida city’s status as a nexus of money …",
    "link": "https://www.livemint.com/companies/news/servicenow-to-grow-in-florida-will-keep-hq-in-california-11741397409687.html",
    "timestamp": "2025-03-08T01:30:09Z"
  },
  {
    "title": "'The View' hosts get into fiery clash over Dems 'not meeting the moment' during an 'existential crisis'",
    "description": "\"The View\" panelists argued over the fallout from Rep. Al Green, D-Texas being censured for his outburst during President Trump’s address to a joint session of Congress on Tuesday.",
    "link": "https://www.foxnews.com/media/the-view-hosts-get-fiery-clash-over-dems-not-meeting-moment-during-existential-crisis",
    "timestamp": "2025-03-08T01:30:06Z"
  },
  {
    "title": "Georgetown law dean condemns top DC prosecutor’s threat to not hire students over DEI | CNN Politics",
    "description": "The dean of Georgetown University Law Center on Thursday rebuked a threat from the acting US attorney in Washington, DC, that he would not hire the law school’s students if it does not remove diversity, equity and inclusion from its curriculum.",
    "link": "https://www.cnn.com/2025/03/07/politics/georgetown-law-dean-dei-ed-martin/index.html",
    "timestamp": "2025-03-08T01:28:53Z"
  },
  {
    "title": "The Democrats' Coming Civil War",
    "description": "At a time when the world press is obsessed with US president Donald Trump and his often imbecilic machinations, perhaps a more consequential struggle is taking place on the other side of the aisle. Trump and his minions may completely control the GOP, but the…",
    "link": "http://www.newgeography.com/content/008469-the-democrats-coming-civil-war",
    "timestamp": "2025-03-08T01:28:38Z"
  },
  {
    "title": "Trump appoints ambassador to Lebanon",
    "description": "US President Donald Trump announced that he appointed Michel Issa as the US ambassador to Lebanon in a Friday",
    "link": "https://www.jpost.com/breaking-news/article-845177",
    "timestamp": "2025-03-08T01:27:43Z"
  },
  {
    "title": "\"They Get Along Fantastically Well\": Trump Denies Elon Musk-Marco Rubio Clash",
    "description": "According to The New York Times, Elon Musk clashed with US Secretary of State Marco Rubio during a White House meeting.",
    "link": "https://www.ndtv.com/world-news/donald-trump-on-elon-musk-marco-rubio-clash-they-get-along-fantastically-well-7874596",
    "timestamp": "2025-03-08T01:26:45Z"
  },
  {
    "title": "Union leaders in Maine condemn canceled TSA officers contract",
    "description": "'Everything we've worked for is in the wind,' said a union representative for 140 federal airport security officers in Maine.",
    "link": "https://www.pressherald.com/2025/03/07/homeland-security-ends-collective-bargaining-agreement-with-tsa-staffers/",
    "timestamp": "2025-03-08T01:26:40Z"
  },
  {
    "title": "Trump Rejects UN's 2030 Sustainability Goals",
    "description": "In a speech before the United Nation’s General Assembly, a representative of President Donald Trump ’s administration rejected the U.N.’s 2030 Agenda for Sustainable Development.Edward Heartney, a minister-counselor at the U.S. Mission to the United Nations, …",
    "link": "https://freerepublic.com/focus/f-news/4302865/posts",
    "timestamp": "2025-03-08T01:25:56Z"
  },
  {
    "title": "Why Dems can’t break out of ‘Trump denial’ (and why lefty loser Tim Walz thinks he has a ‘28 shot)",
    "description": "Denial ain't just a river in Egypt! In fact, it's the new normal for what sure seems like the entire Democratic Party.",
    "link": "https://nypost.com/2025/03/07/opinion/why-dems-cant-break-out-of-trump-denial-and-why-lefty-loser-tim-walz-thinks-he-has-a-28-shot/",
    "timestamp": "2025-03-08T01:25:48Z"
  }
]