[
  {
    "title": "Key Republican Almost Annoyed Enough at RFK Jr. to Act",
    "description": "Senator Bill Cassidy, who played a key role in RFK Jr.’s Senate confirmation, issued a vague call for oversight following the abrupt firing of the CDC director.",
    "link": "http://nymag.com/intelligencer/article/bill-cassidy-almost-annoyed-enough-at-rfk-jr-to-act.html",
    "timestamp": "2025-08-28T20:54:25Z"
  },
  {
    "title": "Trump’s White House Is ‘Bothsidesing' Putin’s Bloody Attacks On Ukraine",
    "description": "The White House press secretary essentially equated Russia’s slaughter of civilians, including children, with Ukraine’s strikes against oil refineries.",
    "link": "https://www.huffpost.com/entry/trump-ukraine-russia-both-sides_n_68b0abd5e4b0bbcc3f8eac88",
    "timestamp": "2025-08-28T20:54:22Z"
  },
  {
    "title": "Mom Of Minneapolis Shooting Victim Was Working In ICU When Daughter Was Wounded",
    "description": "The mother of a 12-year-old girl was working in the intensive care unit before realizing her daughter was shot in the Minneapolis school shooting Wednesday.",
    "link": "https://dailycaller.com/2025/08/28/sophia-forchas-minneapolis-annunciation-catholic-school-shooting-mom-icu-nurse/",
    "timestamp": "2025-08-28T20:54:15Z"
  },
  {
    "title": "Eminem's Early And Brutal Take On MAGA Has Gone Viral Because It's Still So Relevant",
    "description": "Eminem's Early And Brutal Take On MAGA Has Gone Viral Because It's Still So Relevanthuffpost.com",
    "link": "https://www.huffpost.com/entry/eminem-maga-trump-resurfaced-video-goes-viral_n_68b06ceae4b0d635adb4391d",
    "timestamp": "2025-08-28T20:54:06Z"
  },
  {
    "title": "Minneapolis Police Chief to Newsmax: Officer Didn't Hesitate or Wait for Help",
    "description": "In stark contrast to allegations leveled against the delayed first response to past school mass shooters in Parkland, Florida, and Uvalde, Texas – and the first assassination attempt of President Donald Trump – the first Minneapolis officer to go into the chu…",
    "link": "https://freerepublic.com/focus/f-news/4337317/posts",
    "timestamp": "2025-08-28T20:53:42Z"
  },
  {
    "title": "Australia: One eye and four blindfolds",
    "description": "Australia’s sudden realism concerning a malign Iran cannot repair the harm it is doing to Israel and the West. Opinion.",
    "link": "https://www.israelnationalnews.com/news/414047",
    "timestamp": "2025-08-28T20:53:10Z"
  },
  {
    "title": "EXCLUSIVE: NIH Schemes To Keep Risky Viral Research Alive Despite Trump Crackdown",
    "description": "The National Institutes of Health (NIH) plans to continue creating novel pandemic viruses in apparent defiance of an executive order signed by President Donald Trump.",
    "link": "https://dailycaller.com/2025/08/28/exclusive-national-institutes-of-health-gain-of-function-turmp-crackdown/",
    "timestamp": "2025-08-28T20:53:05Z"
  },
  {
    "title": "Emergency services and councils in outback Queensland turn to Starlink",
    "description": "Emergency services in the Queensland outback increasingly turn to low earth orbit satellites rather than Telstra towers for reliable internet connection.",
    "link": "https://www.abc.net.au/news/2025-08-29/emergency-services-in-outback-queensland-turn-to-starlink/105677234",
    "timestamp": "2025-08-28T20:52:44Z"
  },
  {
    "title": "What We Know About Trump’s Plans For Chicago—As Administration Reportedly Plans Immigration Operation",
    "description": "The city’s leadership has received no word on whether the president will try to deploy National Guard troops to the city, as he did in Washington, D.C.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/08/28/what-we-know-about-trumps-plans-for-chicago-as-administration-reportedly-plans-immigration-operation/",
    "timestamp": "2025-08-28T20:52:29Z"
  },
  {
    "title": "Bill Clinton Deported More Mexicans than Trump, Says Mexican President",
    "description": "Despite the criticism levied against U.S. President Donald J. Trump for his hard stance on immigration, former President Bill Clinton was the one who deported the most Mexican migrants in history, said Mexican President Claudia Sheinbaum.\nThe post Bill Clinto…",
    "link": "https://www.breitbart.com/border/2025/08/28/bill-clinton-deported-more-mexicans-than-trump-says-mexican-president/",
    "timestamp": "2025-08-28T20:50:08Z"
  },
  {
    "title": "Lisa Cook, the Federal Reserve governor battling Donald Trump",
    "description": "Economist’s legal showdown with the president will have sweeping implications for the US central bank",
    "link": "https://biztoc.com/x/d079d8193c465827",
    "timestamp": "2025-08-28T20:49:24Z"
  },
  {
    "title": "Travis Kelce calls for Shedeur Sanders to start for Browns amid controversy: 'Give the people what they want'",
    "description": "The Kelce brothers debated Shedeur Sanders' role with the Cleveland Browns amid growing criticism of the team's handling of the fifth-round draft pick.",
    "link": "https://www.foxnews.com/sports/travis-kelce-weighs-browns-shedeur-sanders-controversy-give-people-what-want",
    "timestamp": "2025-08-28T20:48:54Z"
  },
  {
    "title": "There will ‘obviously’ be no Putin-Zelensky summit – Merz",
    "description": "US President Donald Trump has pushed for the meeting as the next step toward settling the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623648-obviously-no-putin-zelensky-summit-merz/",
    "timestamp": "2025-08-28T20:47:17Z"
  },
  {
    "title": "Leftist Vermont Rep Tanya Vyhovsky Toured Ukraine. Here’s What She Learned.",
    "description": "A Ukrainian American DSA politician shares eyewitness thoughts on efforts to build solidarity with the Ukrainian left.",
    "link": "https://truthout.org/articles/leftist-vermont-rep-tanya-vyhovsky-toured-ukraine-heres-what-she-learned/",
    "timestamp": "2025-08-28T20:46:42Z"
  },
  {
    "title": "US regulator opens pathway for Americans to trade on offshore crypto exchanges",
    "description": "The change is part of the Commodity Futures Trading Commission's “crypto sprint,” an initiative to overhaul regulations in response to proposals from the Trump administration.",
    "link": "https://cointelegraph.com/news/cftc-pathway-americans-trade-offshore-crypto-exchanges",
    "timestamp": "2025-08-28T20:46:03Z"
  },
  {
    "title": "Obama and the Russiagate conspiracy: What he knew and when",
    "description": "Declassified documents reveal insider's look at how scheme was launched and operated",
    "link": "https://www.wnd.com/2025/08/obama-russiagate-conspiracy-what-he-knew-when/",
    "timestamp": "2025-08-28T20:44:52Z"
  },
  {
    "title": "Minneapolis mass shooter had intention to 'terrorise those innocent children', police say",
    "description": "Robin Westman once attended the Annunciation Catholic School.",
    "link": "https://www.thejournal.ie/minneapolis-mass-shooter-had-intention-to-terrorise-those-innocent-children-6802267-Aug2025/",
    "timestamp": "2025-08-28T20:44:44Z"
  },
  {
    "title": "The Global War on Terror Comes Home to D.C.",
    "description": "Soldiers are a poor tool for remaking societies.",
    "link": "http://foreignpolicy.com/2025/08/28/troops-national-guard-soldiers-washington-dc-crime/",
    "timestamp": "2025-08-28T20:42:11Z"
  },
  {
    "title": "Who Wants to Work for ICE? They Do.",
    "description": "At a busy hiring expo in Texas, new recruits answer Trump’s call.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/ice-recruiting-texas-immigration-trump/684039/?utm_source=yahoo-news",
    "timestamp": "2025-08-28T20:41:00Z"
  },
  {
    "title": "Who Wants to Work for ICE? They Do.",
    "description": "At a busy hiring expo in Texas, new recruits answer Trump’s call.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/ice-recruiting-texas-immigration-trump/684039/",
    "timestamp": "2025-08-28T20:41:00Z"
  },
  {
    "title": "Fast Money traders analyze Trump’s growing influence on the Federal Reserve and corporations",
    "description": "President Donald Trump’s growing influence over the Federal Reserve and major corporations has sparked widespread debate among investors and policymakers. The “Fast Money” traders recently discussed the implications of this tightening grip for the economy and…",
    "link": "https://techpinions.com/fast-money-traders-analyze-trumps-growing-influence-on-the-federal-reserve-and-corporations/",
    "timestamp": "2025-08-28T20:40:00Z"
  },
  {
    "title": "The Real Threat to Fed Independence Isn't Trump. It's Congress' Debt Addiction",
    "description": "Concerns about the Federal Reserve's independence have grown following repeated attacks by President Donald Trump, including this week's decision to fire Fed Governor Lisa Cook based on questionable allegations. But this debate is too narrowly focused on the …",
    "link": "https://biztoc.com/x/3876804d00cc1131",
    "timestamp": "2025-08-28T20:38:40Z"
  },
  {
    "title": "Federal judge blocks Trump administration from removing Voice of America director",
    "description": "A federal judge has blocked the Trump administration from removing Michael Abramowitz as director of Voice of America",
    "link": "https://abcnews.go.com/US/wireStory/federal-judge-blocks-trump-administration-removing-voice-america-125075858",
    "timestamp": "2025-08-28T20:38:29Z"
  },
  {
    "title": "Rwanda confirms it received seven immigrants deported under Donald Trump",
    "description": "The Trump administration has struck deals with third-party countries, including four in Africa, to accept US deportees.",
    "link": "https://www.aljazeera.com/news/2025/8/28/rwanda-confirms-it-received-seven-immigrants-deported-under-donald-trump",
    "timestamp": "2025-08-28T20:37:51Z"
  },
  {
    "title": "Rubio to visit Mexico, Ecuador next week to discuss migration, China: US",
    "description": "Marco Rubio next week will pay his first visit to Mexico as the top US diplomat, as President Donald Trump presses for cooperation against migration and cartels, the State Department said Thursday. The US secretary of state will also travel to Ecuador to see …",
    "link": "https://www.digitaljournal.com/world/rubio-to-visit-mexico-ecuador-next-week-to-discuss-migration-china-us/article",
    "timestamp": "2025-08-28T20:37:20Z"
  },
  {
    "title": "Challenger primed to face GOP's longtime Senate dissenter as Trump brings new focus to Alaska",
    "description": "Alaska's Mike Dunleavy prepares Senate bid against Lisa Murkowski, with Native voters and Trump relationships likely to shape the competitive 2028 race.",
    "link": "https://www.foxnews.com/politics/challenger-primed-face-gops-longtime-senate-dissenter-trump-brings-new-focus-alaska",
    "timestamp": "2025-08-28T20:35:50Z"
  },
  {
    "title": "DHS asks military base near Chicago for immigration enforcement support",
    "description": "The Trump administration asked a military base outside of Chicago for support on immigration operations this week, offering a clue of what an expanded law enforcement crackdown might look like in the nation's third-largest city.",
    "link": "https://www.pbs.org/newshour/politics/dhs-asks-military-base-near-chicago-for-immigration-enforcement-support",
    "timestamp": "2025-08-28T20:35:25Z"
  },
  {
    "title": "James Carville Fumes Over DNC Land Acknowledgment: 'Try To Win F**king Elections'",
    "description": "The longtime Democratic strategist slammed the Democratic National Committee on his podcast for purportedly giving Republicans what they want.",
    "link": "https://www.huffpost.com/entry/james-carville-fuming-dnc-land-acknowledgment_n_68b098d9e4b0d087ed3f39de",
    "timestamp": "2025-08-28T20:34:37Z"
  },
  {
    "title": "Cracker Barrel quietly removes DEI and Pride pages from its website after logo upheaval | CNN Business",
    "description": "After backing away from a controversial logo rebrand loudly opposed by many right-wing influencers, Cracker Barrel also quietly made changes to its website this week.",
    "link": "https://www.cnn.com/2025/08/28/business/cracker-barrel-removed-dei-and-pride-website",
    "timestamp": "2025-08-28T20:34:32Z"
  },
  {
    "title": "'Shame!' GOP rep flees through back door after town hall devolves into booing and heckling",
    "description": "Rep. Barry Moore (R-Ala.) encountered a contentious audience during a town hall in Daphne, Alabama, on Wednesday evening, where he was met with boos and chants as constituents grilled him over President Donald Trump's tax and tariff agenda.When he failed to a…",
    "link": "https://www.rawstory.com/barry-moore/",
    "timestamp": "2025-08-28T20:33:18Z"
  },
  {
    "title": "Quote about Trump attributed to Justice John Roberts doesn't check out",
    "description": "Chief Justice of the United States John Roberts said, \"I'm worried that President Trump is stretching the rubber band of democracy in ways it simply has never been stretched before.\"",
    "link": "https://www.snopes.com//fact-check/john-roberts-trump-democracy/",
    "timestamp": "2025-08-28T20:33:00Z"
  },
  {
    "title": "20 years after Katrina, New Orleans is back where it started",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. It has been 20 years since New Orleans’ faulty levee system failed during Hurricane Katrina, causing a flood that claimed almost 1,400 lives and inf…",
    "link": "https://www.vox.com/climate/459718/hurricane-katrina-new-orleans-levees-twenty-years-disaster",
    "timestamp": "2025-08-28T20:32:45Z"
  },
  {
    "title": "Putin Bombards British, EU Diplomatic Buildings Despite Trump’s Peace Overtures",
    "description": "Russia launched an airstrike into Kiev, Ukraine, early Thursday that hit buildings housing European diplomats, Politico reported Thursday.",
    "link": "https://dailycaller.com/2025/08/28/putin-bombards-british-eu-diplomatic-buildings-despite-trumps-peace-overtures/",
    "timestamp": "2025-08-28T20:31:57Z"
  },
  {
    "title": "Judge throws out campaign finance lawsuit between Republican rivals in Georgia governor's race",
    "description": "A federal judge has thrown out Georgia Attorney General Chris Carr's campaign finance lawsuit against Lt. Gov. Burt Jones",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-throws-campaign-finance-lawsuit-republican-rivals-georgia-125073239",
    "timestamp": "2025-08-28T20:30:27Z"
  },
  {
    "title": "CDC officials escorted from headquarters as chaos engulfs public health agency",
    "description": "The nation's top public health agency was left reeling and leaderless as the White House worked to expel its handpicked director from the Centers for Disease Control and Prevention.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_8c895284-407f-58f7-814d-7c7f0936f273.html",
    "timestamp": "2025-08-28T20:30:00Z"
  },
  {
    "title": "Sitting European President Flat-Out Calls Trump a ‘Russian Asset’",
    "description": "Former Australian Prime Minister Malcolm Turnbull has also spoken out publicly about Trump’s relationship with Putin.\nThe post Sitting European President Flat-Out Calls Trump a ‘Russian Asset’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/sitting-european-president-flat-out-calls-trump-a-russian-asset/",
    "timestamp": "2025-08-28T20:29:37Z"
  },
  {
    "title": "Residents In One Of DC’s Roughest Wards Say Trump’s Crime Crackdown Needed",
    "description": "Local police could use Trump's assistance in making some of Washington, D.C.'s roughest streets safer if he executes it properly, residents told the DCNF.",
    "link": "https://dailycaller.com/2025/08/28/residents-in-one-of-dcs-roughest-wards-say-trumps-crime-crackdown-needed/",
    "timestamp": "2025-08-28T20:28:27Z"
  },
  {
    "title": "White House Fires CDC Director, Who Refuses To Step Down",
    "description": "CDC Director Susan Monarez is refusing to step down after the White House announced she was fired on Wednesday. The move comes after her conflict with Robert F. Kennedy Jr.",
    "link": "https://hiphopwired.com/2819976/white-house-fires-cdc-director-who-refuses-to-step-down/",
    "timestamp": "2025-08-28T20:28:17Z"
  },
  {
    "title": "Gloria Gaynor Donated Thousands to MAGA Republicans, According to FEC Records",
    "description": "Singer Gloria Gaynor‘s recent financial support for Republican politicians seemingly made her the perfect candidate for the upcoming Kennedy Center Honors hosted by President Donald Trump. According to Federal Election Commission records, the Grammy winner kn…",
    "link": "https://freerepublic.com/focus/f-news/4337304/posts",
    "timestamp": "2025-08-28T20:26:45Z"
  },
  {
    "title": "Trump’s DC police takeover has unsettling implications for 2028",
    "description": "The two and a half weeks since President Donald Trump’s takeover of the Washington, DC, police department have mixed the disturbing and the comical. Combined with the spectacle of the National Guard picking up trash, there’s been a lot of law enforcement acti…",
    "link": "https://www.vox.com/politics/459754/trump-dc-police-takeover-national-police-force-maga",
    "timestamp": "2025-08-28T20:24:54Z"
  },
  {
    "title": "Federal judge blocks Trump administration from removing Voice of America director",
    "description": "The White House has targeted the government-run news outlet for deep staffing cuts.",
    "link": "https://www.bostonherald.com/2025/08/28/voice-of-america-trump/",
    "timestamp": "2025-08-28T20:24:33Z"
  },
  {
    "title": "Trump Pulls In Navy for His Next Takeover of Blue City",
    "description": "President Donald Trump’s administration is asking the naval base outside of Chicago, Illinois for help carrying out the president’s massive deportation campaign, apparently as part of his planned federal takeover of the Windy City.Navy Captain Stephen Yargosz…",
    "link": "https://newrepublic.com/post/199809/trump-navy-dhs-kristi-noem-deportations-takeover-chicago",
    "timestamp": "2025-08-28T20:20:35Z"
  },
  {
    "title": "F*ck Gloria Gaynor And F*ck Snoop Dogg",
    "description": "Now we know.",
    "link": "https://www.wonkette.com/p/fck-gloria-gaynor-and-fck-snoop-dogg",
    "timestamp": "2025-08-28T20:20:28Z"
  },
  {
    "title": "Teen Detained by ICE Forced to Reschedule Pending Green Card Interview",
    "description": "ICE has detained a 19-year-old Afghan whose family helped the U.S. military in Afghanistan.",
    "link": "https://www.newsweek.com/teen-detained-ice-forced-reschedule-green-card-interview-2121152",
    "timestamp": "2025-08-28T20:18:42Z"
  },
  {
    "title": "Republican-Appointed Judge Deals Legal Blow To Trump Administration",
    "description": "A Republican appointee rebuked the Trump administration's efforts to remove the director of Voice of America.",
    "link": "https://www.newsweek.com/republican-appointed-judge-blocks-trump-administration-move-2121162",
    "timestamp": "2025-08-28T20:17:34Z"
  },
  {
    "title": "Mayor Muriel Bowser: 'We Greatly Appreciate' Trump's D.C. Crime Crackdown",
    "description": "Washington, DC, Mayor Muriel Bowser (D) admitted on Wednesday that President Donald Trump's \"surge\" of law enforcement in the city has dramatically reduced crime and made \"neighborhoods feel safer.\"\nThe post Mayor Muriel Bowser: ‘We Greatly Appreciate’ Trump’…",
    "link": "https://www.breitbart.com/crime/2025/08/28/mayor-muriel-bowser-we-greatly-appreciate-trumps-d-c-crime-crackdown/",
    "timestamp": "2025-08-28T20:17:28Z"
  },
  {
    "title": "These are the military funeral honors Ashli Babbitt will receive",
    "description": "The Air Force will extend military funeral honors to Ashli Babbitt, a veteran killed during the Jan. 6, 2021, riot at the U.S. Capitol.",
    "link": "https://taskandpurpose.com/news/ashli-babbitt-funeral-honors/",
    "timestamp": "2025-08-28T20:16:42Z"
  },
  {
    "title": "Illinois Gov. J.B. Pritzker Threatens 'Response' If Trump Sends National Guard to Crime-Ridden Chicago",
    "description": "Gov. J.B. Pritzker (D-IL) is threatening President Donald Trump over possibly sending the National Guard to Chicago as crime grips the city. \nThe post Illinois Gov. J.B. Pritzker Threatens ‘Response’ If Trump Sends National Guard to Crime-Ridden Chicago appea…",
    "link": "https://www.breitbart.com/crime/2025/08/28/illinois-gov-j-b-pritzker-threatens-response-if-trump-sends-national-guard-to-crime-ridden-chicago/",
    "timestamp": "2025-08-28T20:16:36Z"
  },
  {
    "title": "The Real Threat to Fed Independence Isn't Trump. It's Congress' Debt Addiction.",
    "description": "The question is not whether Powell will resist Trump's demands. It's whether Congress will behave in a way that allows the Fed to do its job.",
    "link": "https://reason.com/2025/08/28/the-real-threat-to-fed-independence-isnt-trump-its-congress-debt-addiction/",
    "timestamp": "2025-08-28T20:16:33Z"
  },
  {
    "title": "Donald Trump approval ratings: New poll finds sharp change from past month",
    "description": "The president's political standing has changed over the past month. Here's what a recent poll found.",
    "link": "https://www.masslive.com/news/2025/08/donald-trump-approval-ratings-new-poll-finds-sharp-change-from-past-month.html",
    "timestamp": "2025-08-28T20:16:22Z"
  },
  {
    "title": "E3 Nations Begin Process to Reimpose Snapback Sanctions on Iran",
    "description": "European foreign ministers hope the threat of sanctions will force Tehran back to the nuclear negotiating table.",
    "link": "http://foreignpolicy.com/2025/08/28/iran-snapback-sanctions-nuclear-program-e3-iaea/",
    "timestamp": "2025-08-28T20:15:51Z"
  },
  {
    "title": "ICE will ‘ramp up’ immigration raids in Los Angeles, other ‘sanctuary cities,’ border czar says",
    "description": "Tom Homan said there would be increased operations in New York, Portland, Seattle and more.",
    "link": "https://www.bostonherald.com/2025/08/28/immigration-raids-sanctuary-cities/",
    "timestamp": "2025-08-28T20:14:18Z"
  },
  {
    "title": "Mexico's president asks U.S. to share convicted cartel leader's $15 billion with her country's poorest people",
    "description": "Mexican President Claudia Sheinbaum said Wednesday said she would ask the United States to share the $15 billion it expects to extract from convicted Mexican drug lord Ismael \"El Mayo\" Zambada with her country's poor. Sinaloa drug cartel co-founder Zambada pl…",
    "link": "https://freerepublic.com/focus/f-news/4337298/posts",
    "timestamp": "2025-08-28T20:14:01Z"
  },
  {
    "title": "Know When And How To Rebrand",
    "description": "Ok. I’m going to hold my hands up and admit something. Until about a week ago, I had no idea who or what Cracker Barrel was. Now, I know that may come as some surprise to my friends over in America, but the Cracker Barrel brand really wasn’t a thing over here…",
    "link": "https://brandingstrategyinsider.com/know-when-and-how-to-rebrand/",
    "timestamp": "2025-08-28T20:12:24Z"
  },
  {
    "title": "The 10th Circuit Agrees That Prosecuting Cannabis Consumers for Gun Possession May Be Unconstitutional",
    "description": "The appeals court rejected most of the arguments in favor of that policy, saying \"the government must show non-intoxicated marijuana users pose a risk of future danger.\"",
    "link": "https://reason.com/2025/08/28/the-10th-circuit-agrees-that-prosecuting-cannabis-consumers-for-gun-possession-may-be-unconstitutional/",
    "timestamp": "2025-08-28T20:11:10Z"
  },
  {
    "title": "Trump Took Over The D.C. Police. Now These People Face Years In Federal Prison.",
    "description": "Defendants are looking at felony charges and years in prison for what attorneys say could have been minor disorderly conduct cases in city court.",
    "link": "https://www.huffpost.com/entry/trump-dc-police-takeover_n_68b08bece4b0d087ed3f2b3c",
    "timestamp": "2025-08-28T20:10:45Z"
  },
  {
    "title": "Facing Emergency Surgery After Minneapolis School Shooting, 13-Year-Old Asked His Surgeon for Just One Thing",
    "description": "Robin Westman, 23, opened fire during mass at Minneapolis' Annunciation Catholic Church on Aug. 27, killing two children and injuring 18 others",
    "link": "https://people.com/minneapolis-school-shooting-injured-victim-asked-surgeon-pray-with-me-11799928",
    "timestamp": "2025-08-28T20:10:19Z"
  },
  {
    "title": "Cracker Barrel quietly removes DEI and Pride pages from its website after logo upheaval",
    "description": "(CNN) — After backing away from a controversial logo rebrand loudly opposed by many right-wing influencers, Cracker Barrel also quietly made changes to its website this week.",
    "link": "https://www.kitv.com/news/business/cracker-barrel-quietly-removes-dei-and-pride-pages-from-its-website-after-logo-upheaval/article_3f6c8526-e885-54c0-bcee-a1460b8c6ee8.html",
    "timestamp": "2025-08-28T20:10:00Z"
  },
  {
    "title": "Far Right Exploits Children’s Deaths in Minneapolis to Target Trans People",
    "description": "Minneapolis Mayor Jacob Frey has decried those using the tragedy “as an opportunity to villainize our trans community.”…",
    "link": "https://truthout.org/articles/far-right-exploits-childrens-deaths-in-minneapolis-to-target-trans-people/",
    "timestamp": "2025-08-28T20:08:10Z"
  },
  {
    "title": "George Santos Complains Prison Conditions Are 'Neglect of Human Dignity'",
    "description": "\"I thought I'd seen government dysfunction before, but never at this level,\" the expelled congressman wrote in an op-ed on Thursday.",
    "link": "https://www.newsweek.com/george-santos-prison-criminal-pardon-mtg-2121135",
    "timestamp": "2025-08-28T20:08:02Z"
  },
  {
    "title": "Investigators look for a motive in a deadly mass shooting at Minneapolis church",
    "description": "Authorities said the shooter had been a student and member of the church.",
    "link": "https://www.bostonherald.com/2025/08/28/minneapolis-school-church-shooting/",
    "timestamp": "2025-08-28T20:05:22Z"
  },
  {
    "title": "The \"Mini-Trump\" Attacking Lisa Cook Had Paperwork Problems of His Own (Mother Jones)",
    "description": "Mother Jones:\nThe “Mini-Trump” Attacking Lisa Cook Had Paperwork Problems of His Own  —  Bill Pulte has weaponized his office to attack Trump's political enemies.  —  Donald Trump is attempting to seize control of the historically independent Federal Reserve …",
    "link": "https://www.memeorandum.com/250828/p90",
    "timestamp": "2025-08-28T20:05:00Z"
  },
  {
    "title": "The governor of California is in a high-stakes battle with Donald Trump. It’s not yet clear who will win",
    "description": "Gavin Newsom has energised fellow Democrats with his ‘fight fire with fire’ approach to the president – if he wins, he may be a strong candidate for the White House.",
    "link": "https://theconversation.com/the-governor-of-california-is-in-a-high-stakes-battle-with-donald-trump-its-not-yet-clear-who-will-win-263803",
    "timestamp": "2025-08-28T20:04:41Z"
  },
  {
    "title": "Trump talks about having GOP convention before the MIDTERMS",
    "description": "'We won every aspect of the Presidential Election and, based on the great success we are having, are poised to WIN BIG IN THE MIDTERMS'",
    "link": "https://www.wnd.com/2025/08/trump-talks-about-having-gop-convention-before-midterms/",
    "timestamp": "2025-08-28T20:02:19Z"
  },
  {
    "title": "US To Publish Economic Data On Blockchain, Commerce Chief Says",
    "description": "U.S. Commerce Secretary Howard Lutnick announced that the Department of Commerce will begin publishing GDP statistics on the blockchain, touting it as part of President Trump's push to make America a \"crypto government.\" CoinTelegraph reports: Lutnick made th…",
    "link": "https://yro.slashdot.org/story/25/08/28/182244/us-to-publish-economic-data-on-blockchain-commerce-chief-says",
    "timestamp": "2025-08-28T20:02:00Z"
  },
  {
    "title": "ICE Continues to Detain Award-Winning Journalist Who Filmed Immigration Raids",
    "description": "At a court hearing on Wednesday, the judge didn’t rule on Mario Guevara’s petition to be released.",
    "link": "https://truthout.org/articles/ice-continues-to-detain-award-winning-journalist-who-filmed-immigration-raids/",
    "timestamp": "2025-08-28T20:00:46Z"
  },
  {
    "title": "Trump Calls For Prosecution Of Soros",
    "description": "United States President Donald Trump has accused \"radical leftist\" and billionaire George Soros of trying to “rip apart” America by supporting violent protests, deserving of prosecution. Soros, who is a Hungarian-American investor, has long supported various …",
    "link": "https://www.shtfplan.com/headline-news/trump-calls-for-prosecution-of-soros",
    "timestamp": "2025-08-28T20:00:23Z"
  },
  {
    "title": "CDC Leadership Chaos Could Disrupt Pandemic Preparedness, National Biosecurity",
    "description": "Public health experts warn that the Centers for Disease Control and Prevention’s leadership crisis—sparked by the White House’s efforts to oust CDC director Susan Monarez—could jeopardize national biosecurity, pandemic preparedness and disease outbreak survei…",
    "link": "https://www.scientificamerican.com/article/cdc-leadership-chaos-could-disrupt-pandemic-preparedness-national/",
    "timestamp": "2025-08-28T20:00:00Z"
  },
  {
    "title": "The Irish Times view on AI: is this a stock market bubble which could burst?",
    "description": "Investors  has a seemingly insatiable demand for stock with exposure to artificial intelligence",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/08/28/the-irish-times-view-on-ai-is-this-a-bubble-which-could-burst/",
    "timestamp": "2025-08-28T20:00:00Z"
  },
  {
    "title": "First Look: Watch out for Eve Hewson in George Clooney’s cameo-stuffed new satire on stardom",
    "description": "Venice International Film Festival 2025: With Jay Kelly, a satire on stardom, Noah Baumbach just about gets back on track",
    "link": "https://www.irishtimes.com/culture/film/review/2025/08/28/first-look-watch-out-for-eve-hewson-in-george-clooneys-cameo-stuffed-new-satire-on-stardom/",
    "timestamp": "2025-08-28T20:00:00Z"
  },
  {
    "title": "Major Russian attack includes rare strikes on the center of Kyiv, killing at least 21",
    "description": "Decoy drones, cruise missiles and ballistic missiles and struck at least 20 locations.",
    "link": "https://www.bostonherald.com/2025/08/28/russia-ukraine-war-kyiv-strikes/",
    "timestamp": "2025-08-28T19:59:59Z"
  },
  {
    "title": "JD Vance Takes Time Out Of Speech To Pray For Children Killed In Shooting As Left Snipes At Christians",
    "description": "Vice President J.D. Vance dedicated time out of his speech on Thursday to pray for the two children who tragically died at the hands of a transgender shooter.",
    "link": "https://dailycaller.com/2025/08/28/jd-vance-prayer-children-killed-minneapolis/",
    "timestamp": "2025-08-28T19:59:07Z"
  },
  {
    "title": "Trump floats Republican convention ahead of 2026 elections",
    "description": "President Donald Trump said Thursday that Republicans may take the unusual step of holding a convention ahead of the 2026 elections as both parties fight for control of Congress. “We won every aspect of the Presidential Election and, based on the great succes…",
    "link": "https://freerepublic.com/focus/f-news/4337291/posts",
    "timestamp": "2025-08-28T19:58:08Z"
  },
  {
    "title": "Russia blames Trump for Iran nuclear crisis, says E3 has turned to 'diplomacy at the barrel of the gun'",
    "description": "Russia and China propose extending Iran nuclear deal timeline as tensions rise over Tehran's uranium enrichment violations and international sanctions.",
    "link": "https://www.foxnews.com/world/russia-blames-trump-iran-nuclear-crisis-says-e3-has-turned-diplomacy-barrel-gun",
    "timestamp": "2025-08-28T19:57:36Z"
  },
  {
    "title": "Russia blames Trump for Iran nuclear crisis, says Europe has turned to 'diplomacy at the barrel of the gun'",
    "description": "Russia and China propose extending Iran nuclear deal timeline as tensions rise over Tehran's uranium enrichment violations and international sanctions.",
    "link": "https://www.foxnews.com/world/russia-blames-trump-iran-nuclear-crisis-says-europe-has-turned-diplomacy-barrel-gun",
    "timestamp": "2025-08-28T19:57:36Z"
  },
  {
    "title": "UN sets 2027 exit for Lebanon peacekeepers after Israeli strikes",
    "description": "The Security Council voted Thursday for UN peacekeepers to leave Lebanon in 2027, allowing only one final extension after pressure from Israel and its US ally to end the nearly 50-year-old force. Israel hailed the upcoming termination of the United Nations In…",
    "link": "https://www.digitaljournal.com/world/un-sets-2027-exit-for-lebanon-peacekeepers-after-israeli-strikes/article",
    "timestamp": "2025-08-28T19:57:22Z"
  },
  {
    "title": "‘To Be Sold:’ Artwork And Conversation Putting A Face And Name On Slavery",
    "description": "The African American Research Library & Cultural Center in Fort Lauderdale presents “To Be Sold: Enslaved Labor and Slave Trading in the Antebellum South.\"",
    "link": "https://www.forbes.com/sites/chaddscott/2025/08/28/to-be-sold-artwork-and-conversation-putting-a-face-and-name-on-slavery/",
    "timestamp": "2025-08-28T19:56:18Z"
  },
  {
    "title": "Gavin Newsom’s Bizarro-Trump Schtick Gets Even Weirder With a Memecoin",
    "description": "\"Donald Trump, we'll see how well your coin does versus our coin,\" said the California governor.",
    "link": "https://gizmodo.com/gavin-newsoms-bizarro-trump-schtick-gets-even-weirder-with-a-memecoin-2000649951",
    "timestamp": "2025-08-28T19:55:11Z"
  },
  {
    "title": "FTC chair alleges partisan filtering by Gmail; Google says spam filters not ideological",
    "description": "WASHINGTON :U.S. Federal Trade Commission Chairman Andrew Ferguson alleged that Gmail uses what the FTC calls partisan filtering and raised the issue in a letter to Sundar Pichai, the CEO of Google parent company Alphabet, the regulator said on Thursday.\"My u…",
    "link": "https://www.channelnewsasia.com/business/ftc-chair-alleges-partisan-filtering-gmail-google-says-spam-filters-not-ideological-5321051",
    "timestamp": "2025-08-28T19:55:07Z"
  },
  {
    "title": "GOP Sen. Bill Cassidy Publicly Undermines RFK Jr.’s Vaccine Committee Plans",
    "description": "Sen. Bill Cassidy publicly undermined the vaccine committee selected by Robert F. Kennedy Jr., urging that physicians ignore its recommendations Thursday.",
    "link": "https://dailycaller.com/2025/08/28/bill-cassidy-undermines-rfk-jr-acip-committee-vaccines/",
    "timestamp": "2025-08-28T19:54:52Z"
  },
  {
    "title": "What does a Trump takeover of the Fed look like?",
    "description": "What does a Trump takeover of the Fed look like?\nWith Governor Cook being dismissed and talk of pressuring the 2026 nominations of regional presidents, markets are beginning to price in a risk premium\nDonald Trump | Joey Sussman/Shutterstock modified by Block…",
    "link": "https://biztoc.com/x/ece8984ec14543c1",
    "timestamp": "2025-08-28T19:53:57Z"
  },
  {
    "title": "Ellen DeGeneres slammed with fresh accusations of hostility toward men by former talk show staff",
    "description": "Former cameraman and staff members accuse Ellen DeGeneres of creating a terrifying work atmosphere on her daytime talk show with alleged discrimination against male employees.",
    "link": "https://www.foxnews.com/entertainment/ellen-degeneres-slammed-fresh-accusations-hostility-toward-men-former-talk-show-staff",
    "timestamp": "2025-08-28T19:53:49Z"
  },
  {
    "title": "Steve Bannon Celebrates Poll Showing Majority of GOP Wants Trump Third Term: ‘Told You This Day Was Coming’",
    "description": "In March, Bannon predicted that Trump would not only run again, but that he would win a third term.\nThe post Steve Bannon Celebrates Poll Showing Majority of GOP Wants Trump Third Term: ‘Told You This Day Was Coming’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/steve-bannon-celebrates-poll-showing-majority-of-gop-wants-trump-third-term-told-you-this-day-was-coming/",
    "timestamp": "2025-08-28T19:52:57Z"
  },
  {
    "title": "Sean Hannity Fires Back at Gavin Newsom For Questioning His Trump Support: ‘Do Nothing Part-Time Governor!’",
    "description": "Sean Hannity fired back at Gavin Newsom who claimed that the Fox News host was blindly accepting of Donald Trump's actions to  nationalize American businesses.\nThe post Sean Hannity Fires Back at Gavin Newsom For Questioning His Trump Support: ‘Do Nothing Par…",
    "link": "https://www.mediaite.com/media/news/sean-hannity-fires-back-at-gavin-newsom-for-questioning-his-trump-support-do-nothing-part-time-governor/",
    "timestamp": "2025-08-28T19:52:10Z"
  },
  {
    "title": "Departing CDC officials say Monarez’s firing was the final straw and political meddling is a problem",
    "description": "Monarez's lawyers contend her termination was illegal.",
    "link": "https://www.bostonherald.com/2025/08/28/cdc-director-meddling/",
    "timestamp": "2025-08-28T19:51:02Z"
  },
  {
    "title": "Departing CDC officials say Monarez’s firing was the final straw and political meddling is a problem",
    "description": "Monarez's lawyers contend her termination was illegal.",
    "link": "https://www.denverpost.com/2025/08/28/cdc-director-meddling/",
    "timestamp": "2025-08-28T19:51:02Z"
  },
  {
    "title": "Trump eases rules for hiring temporary immigration judges",
    "description": "he Justice Department can now hire attorneys without immigration law experience to help reduce case backlogs; critics cite concerns over inexperience and possible \"political bias.\"",
    "link": "https://www.nbcnews.com/news/latino/trump-eases-rules-hiring-temporary-immigration-judges-rcna227711",
    "timestamp": "2025-08-28T19:49:20Z"
  },
  {
    "title": "Border patrol arrests two firefighters while they were fighting Washington’s biggest wildfire | CNN",
    "description": "Border Patrol agents conducted an operation at the site of Washington state’s biggest wildfire this week﻿, and a Washington congresswoman’s office confirmed two firefighters were arrested at the site where first responders are working to contain the blaze tha…",
    "link": "https://www.cnn.com/2025/08/28/us/washington-firefighters-arrest-fighting-wildfire",
    "timestamp": "2025-08-28T19:46:55Z"
  },
  {
    "title": "Trump Responds to 'Failing Memory' Troll After He Claimed Governor Branded Him 'Greatest President' — as Rumors The Don is Suffering From Dementia Spread",
    "description": "Donald Trump is fighting it out with Wes Moore, as the young governor seemed to get under the president's skin with a joke about his memory.",
    "link": "https://radaronline.com/p/trump-dementia-failing-memory-troll-greatest-president-wes-moore/",
    "timestamp": "2025-08-28T19:45:00Z"
  },
  {
    "title": "Fintech Rain Raises $58 Million to Fuel Stablecoin Push on Visa Network",
    "description": "American fintech Rain, which issues cards backed by stablecoins, has raised a total of $88.5 million.",
    "link": "https://decrypt.co/337238/fintech-rain-raises-58-million-to-fuel-stablecoin-push-on-visa-network",
    "timestamp": "2025-08-28T19:44:33Z"
  },
  {
    "title": "Trump administration seeks Chicago military base support for immigration operations",
    "description": "Community groups said they expect a greater focus on arrests of undocumented migrants, patrols of public spaces and attention on homeless encampments.",
    "link": "https://indianexpress.com/article/world/trump-seeks-chicago-military-base-for-immigration-operations-10217322/",
    "timestamp": "2025-08-28T19:43:50Z"
  }
]