[
  {
    "title": "Mamdani Accuses Trump of Violating International Law As Maduro is Transported to NYC",
    "description": "Zohran Mamdani (D) condemned Donald Trump's invasion of Venezuela and arrest of Nicolás Maduro on Saturday, calling it a \"violation\" international law.\nThe post Mamdani Accuses Trump of Violating International Law As Maduro is Transported to NYC first appeare…",
    "link": "https://www.mediaite.com/media/news/mamdani-accuses-trump-of-violating-international-law-as-maduro-is-transported-to-nyc/",
    "timestamp": "2026-01-03T19:14:29Z"
  },
  {
    "title": "‘Actions of a rogue state’: Lawmakers demand emergency vote to stop Trump war on Venezuela",
    "description": "Members of the US Congress on Saturday demanded emergency legislative action to prevent the Trump administration from taking further military action in Venezuela after the president threatened a “second wave” of attacks and said the US will control the South …",
    "link": "https://www.rawstory.com/trump-2674845411/",
    "timestamp": "2026-01-03T19:11:53Z"
  },
  {
    "title": "Who is next as Nicolas Maduro is captured by US forces? Rubio says Cuba should be concerned",
    "description": "After Nicolas Maduro was captured, US leaders sent a strong warning to Cuba. Secretary of State Marco Rubio said Havana should be concerned after losing its closest ally in Venezuela. US pressure on the region is growing, and some officials believe Maduro’s f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-next-as-nicolas-maduro-is-captured-by-us-forces-rubio-says-cuba-should-be-concerned/articleshow/126327325.cms",
    "timestamp": "2026-01-03T19:11:33Z"
  },
  {
    "title": "Trump Says Nobel Laureate Machado Lacks 'Support Or Respect' To Lead Venezuela",
    "description": "US President Donald Trump on Saturday dismissed Nobel Peace Prize-winning opposition leader María Corina Machado as a potential leader of Venezuela, saying she does not have the “support or respect\" within the country. Speaking at a news conference, Trump sai…",
    "link": "https://freerepublic.com/focus/f-news/4360235/posts",
    "timestamp": "2026-01-03T19:10:22Z"
  },
  {
    "title": "Key Trump quotes about US operation in Venezuela",
    "description": "In a wide-ranging press conference on Saturday, US President Donald Trump on Saturday explained the operation to extract Venezuelan leader Nicolas Maduro from Caracas, said Washington would temporarily “run” the country, and warned neighboring Colombia to be …",
    "link": "https://www.digitaljournal.com/world/key-trump-quotes-about-us-operation-in-venezuela/article",
    "timestamp": "2026-01-03T19:07:20Z"
  },
  {
    "title": "A predawn op in Latin America? The US has been here before, but the seizure of Venezuela’s Maduro is still unprecedented",
    "description": "The operation in Venezuela has echoes of Panama in 1989. But in ordering President Maduro’s capture, Trump has broken with long-standing US policy in Latin America.",
    "link": "https://theconversation.com/a-predawn-op-in-latin-america-the-us-has-been-here-before-but-the-seizure-of-venezuelas-maduro-is-still-unprecedented-272664",
    "timestamp": "2026-01-03T19:05:44Z"
  },
  {
    "title": "Hollywood Celebrities Rush to Call for Trump's Impeachment After U.S. Apprehends Nicolás Maduro: 'America Is a Terror State'",
    "description": "Left-wing Hollywood celebrities wasted no time demanding the impeachment of President Donald Trump after he ordered the military operation the lead to the capture of Venezuela’s socialist dictator Nicolás Maduro and his wife Cilia Flores, on what U.S. Attorne…",
    "link": "https://www.breitbart.com/entertainment/2026/01/03/hollywood-celebrities-rush-to-call-for-trumps-impeachment-for-capturing-venezuelas-socialist-dictator-nicolas-maduro/",
    "timestamp": "2026-01-03T19:05:03Z"
  },
  {
    "title": "Numerous House Democrats Praise Trump’s Capture of Maduro: ‘Venezuelans Deserve the Promise of Democracy’",
    "description": "Several Democratic politicians celebrated the Trump Administration's capture of Venezuelan dictator Nicolás Maduro on Saturday\nThe post Numerous House Democrats Praise Trump’s Capture of Maduro: ‘Venezuelans Deserve the Promise of Democracy’ first appeared on…",
    "link": "https://www.mediaite.com/politics/numerous-house-democrats-praise-trumps-capture-of-maduro-venezuelans-deserve-the-promise-of-democracy/",
    "timestamp": "2026-01-03T19:04:57Z"
  },
  {
    "title": "Inside Operation Absolute Resolve: How US forces captured Venezuela’s Maduro — after months of secret planning",
    "description": "The US military unleashed a stunning overnight show of force to capture Venezuelan strongman Nicolás Maduro, deploying more than 150 aircrafts, elite ground troops and overwhelming airpower -- a mission months in the making.",
    "link": "https://nypost.com/2026/01/03/world-news/how-us-forces-captured-venezuelas-maduro-in-extraordinary-raid/",
    "timestamp": "2026-01-03T19:04:15Z"
  },
  {
    "title": "Ouster of Maduro government sparks celebrations among Venezuelans in South Florida",
    "description": "\"There’s fears. There’s excitement. There’s so many years that we’ve been waiting for this. Something had to happen in Venezuela. We all need the freedom.”",
    "link": "https://fortune.com/2026/01/03/ouster-maduro-government-celebrations-venezuelans-south-florida/",
    "timestamp": "2026-01-03T19:03:09Z"
  },
  {
    "title": "ICE Document Reveals Plan To Recruit At UFC Fights, Gun Shows, Dumpster Behind Joe Rogan's House",
    "description": "To arms, you broom-armed incels!",
    "link": "https://www.wonkette.com/p/ice-document-reveals-plan-to-recruit",
    "timestamp": "2026-01-03T19:00:46Z"
  },
  {
    "title": "7 Left-Wing Groups to Watch in 2026",
    "description": "Next year doesn’t just mark the 250th anniversary of the United States—it also means another year of President Donald Trump’s second term and impending midterm... Read More\nThe post 7 Left-Wing Groups to Watch in 2026 appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/03/7-left-wing-groups-watch-2026/",
    "timestamp": "2026-01-03T19:00:00Z"
  },
  {
    "title": "Trump: US will 'run' Venezuela after military mission to nab Maduro - Roll Call",
    "description": "President Trump made clear access to vast Venezuelan oil reserves were a big part of his order to arrest and oust Nicolas Maduro.",
    "link": "https://rollcall.com/2026/01/03/trump-maduro-venezuela-military-mission/",
    "timestamp": "2026-01-03T18:59:23Z"
  },
  {
    "title": "Democrat Lawmakers: Trump 'Overstepped' Authority with Venezuela Raid to Arrest Nicolas Maduro",
    "description": "Congressional Democrats predictably blasted President Donald Trump for ordering strikes on military targets in Caracas and the capture of Venezuelan President Nicolás Maduro and his wife Cilia Flores.\nThe post Democrat Lawmakers: Trump ‘Overstepped’ Authority…",
    "link": "https://www.breitbart.com/national-security/2026/01/03/democrat-lawmakers-trump-overstepped-authority-with-venezuela-raid-to-arrest-nicolas-maduro/",
    "timestamp": "2026-01-03T18:59:17Z"
  },
  {
    "title": "What is Don-roe Doctrine? Trump rebrands the Monroe Doctrine after Nicolás Maduro is captured",
    "description": "Don-roe Doctrine: Donald Trump launched the “Don-roe Doctrine” during a Mar-a-Lago press conference after the capture of Venezuelan President Nicolás Maduro. He framed Venezuela’s political turmoil as a national security challenge, accusing the former governm…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-don-roe-doctrine-trump-rebrands-the-monroe-doctrine-after-nicols-maduro-is-captured/articleshow/126326588.cms",
    "timestamp": "2026-01-03T18:58:10Z"
  },
  {
    "title": "Iran's Khamenei says 'rioters should be put in their place'",
    "description": "The first comments by 86-year-old Ayatollah Ali Khamenei come as violence surrounding the demonstrations sparked by Iran's ailing economy has killed at least 10 people.",
    "link": "https://www.cbc.ca/news/world/iran-khamenei-protesters-9.7032737",
    "timestamp": "2026-01-03T18:57:27Z"
  },
  {
    "title": "Bo Nix net worth in 2025: How much the Broncos star QB earns, NFL contracts and current status",
    "description": "Denver Broncos quarterback Bo Nix's net worth is projected to be around three to four million dollars in 2025. This figure stems from his lucrative rookie contract with the Broncos. His deal includes a substantial signing bonus and guaranteed salary. Nix's pe…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/bo-nix-net-worth-in-2025-how-much-the-broncos-star-qb-earns-nfl-contracts-and-current-status/articleshow/126327187.cms",
    "timestamp": "2026-01-03T18:56:14Z"
  },
  {
    "title": "U.S. strike on Venezuela: Pa. leaders issue statements after Maduro, wife capture",
    "description": "Pennsylvania officials are sharing their reactions after President Trump announced the capture of Venezuelan President Nicolás Maduro and his wife by U.S. forces.",
    "link": "https://www.wtae.com/article/us-strike-venezuela-pa-leader-statements-maduro-wife-capture/69908264",
    "timestamp": "2026-01-03T18:55:40Z"
  },
  {
    "title": "Chinese Diplomats Arrived in Venezuela for Talks with Maduro Hours Before US Strikes — And Are Still There: Report",
    "description": "Hours before Venezuelan President Nicolás Maduro was captured during a U.S. military operation, he met with Chinese diplomats, who are reportedly still in Caracas.\nThe post Chinese Diplomats Arrived in Venezuela for Talks with Maduro Hours Before US Strikes —…",
    "link": "https://www.mediaite.com/media/news/chinese-diplomats-arrived-in-venezuela-for-talks-with-maduro-hours-before-us-strikes-and-are-still-there-report/",
    "timestamp": "2026-01-03T18:55:29Z"
  },
  {
    "title": "A timeline of U.S. military escalation against Venezuela leading to Maduro's capture",
    "description": "On Saturday, the U.S. conducted a \"large-scale strike\" against Venezuela. Before the escalation, there had been 35 known strikes against alleged drug smuggling boats in South American waters since early September that killed at least 115 people, according to …",
    "link": "https://www.pbs.org/newshour/world/a-timeline-of-u-s-military-escalation-against-venezuela-leading-to-maduros-capture",
    "timestamp": "2026-01-03T18:54:16Z"
  },
  {
    "title": "Peace Action Statement on illegal US attack on Venezuela",
    "description": "Kevin Martin, President of Peace Action and Peace Action Education Fund, issued the following statement today:“The United States’ military special forces attack on Venezuela and abduction of its president, Nicolas Maduro, and his wife, Cilia Flores, is illega…",
    "link": "https://www.commondreams.org/newswire/peace-action-statement-on-illegal-us-attack-on-venezuela",
    "timestamp": "2026-01-03T18:53:18Z"
  },
  {
    "title": "Washington Post praises Trump's Venezuela operation as 'unquestionable tactical success'",
    "description": "Trump's alleged military operation in Venezuela captures Maduro in bold move that divides major editorial boards and raises legal questions.",
    "link": "https://www.foxnews.com/media/washington-post-praises-trumps-venezuela-operation-unquestionable-tactical-success",
    "timestamp": "2026-01-03T18:53:02Z"
  },
  {
    "title": "New Details Emerge about Operation Absolute Resolve, the U.S. Raid in Venezuela",
    "description": "U.S. officials detail Operation Absolute Resolve, revealing the scale, planning, and aftermath of the joint operation that captured Venezuela’s president. Following the U.S. special operation in Venezuela in the night of Jan. 3, 2026, a press conference was h…",
    "link": "https://theaviationist.com/2026/01/03/operation-absolute-resolve-venezuela/",
    "timestamp": "2026-01-03T18:52:53Z"
  },
  {
    "title": "Airlines cancel dozens of Caribbean flights after U.S. attacks on Venezuela",
    "description": "Airlines canceled flights throughout the Caribbean on Saturday following U.S. strikes on Venezuela after the Federal Aviation Administration ordered commercial aircraft to avoid airspace in parts of the region.\nPresident Donald Trump said Saturday the U.S. st…",
    "link": "https://biztoc.com/x/b977081bfc3c09d3",
    "timestamp": "2026-01-03T18:52:45Z"
  },
  {
    "title": "Trump Torpedoes Nobel Winner At Presser — Says She ‘Doesn’t Have Respect’ To Run Her Country After She Gushed About Him",
    "description": "Trump torpedoed the idea that María Corina Machado could assume leadership in Venezuela, saying she \"doesn't have respect\" in her country.\nThe post Trump Torpedoes Nobel Winner At Presser — Says She ‘Doesn’t Have Respect’ To Run Her Country After She Gushed A…",
    "link": "https://www.mediaite.com/media/news/trump-torpedoes-nobel-winner-at-presser-says-she-doesnt-have-respect-to-run-her-country-after-she-gushed-about-him/",
    "timestamp": "2026-01-03T18:51:16Z"
  },
  {
    "title": "Trump says US oil companies will spend billions in Venezuela",
    "description": "PALM ‌BEACH, Florida, Jan 3 (Reuters) - President Donald Trump said that American oil companies were prepared to enter ‌Venezuela and invest to restore production in the South American country, an announcement that ‌came  just hours after Nicolás Maduro was c…",
    "link": "https://www.thestar.com.my/news/world/2026/01/04/trump-says-us-oil-companies-will-spend-billions-in-venezuela",
    "timestamp": "2026-01-03T18:51:00Z"
  },
  {
    "title": "What the top US general revealed about how the surprise 'Absolute Resolve' raid to capture Maduro unfolded in Venezuela",
    "description": "The operation involved more than 150 military aircraft, including fighter jets, helicopters, drones, and bomber planes.",
    "link": "https://www.businessinsider.com/top-general-details-us-military-raid-that-captured-venezuelas-maduro-2026-1",
    "timestamp": "2026-01-03T18:50:35Z"
  },
  {
    "title": "URGENT — Iranian women are removing their veils right in the heart of Tehran, rebelling against the Islamic moral police.",
    "description": "We are witnessing in Iran perhaps the greatest women's revolution of the 21st century and not a single media outlet is covering this. This is astonishing. --Lara Logan",
    "link": "https://freerepublic.com/focus/f-news/4360231/posts",
    "timestamp": "2026-01-03T18:50:21Z"
  },
  {
    "title": "Trump Hints Which Dictator Could Be Next After Toppling Maduro",
    "description": "President Donald Trump warned brutal world leaders during a Saturday press conference that what happened to Venezuela's Nicolás Maduro could happen to them.",
    "link": "https://dailycaller.com/2026/01/03/donald-trump-hints-next-dictator-target-after-toppling-venezuela-nicolas-maduro/",
    "timestamp": "2026-01-03T18:49:28Z"
  },
  {
    "title": "Australian brands still dealing with 'the wild west' of Trump's tariffs",
    "description": "From de minimis to beef tariffs, Aussie exporters are preparing for another \"wild\" year.",
    "link": "https://www.abc.net.au/news/2026-01-04/australian-brands-still-dealing-with-trump-tariffs-more-in-2026/106194486",
    "timestamp": "2026-01-03T18:49:02Z"
  },
  {
    "title": "Joe Rogan Says Drug Overdose Deaths Have 'Dropped off a Cliff' Due to Trump Admin's Boat Strikes",
    "description": "Podcaster Joe Rogan says drug overdose deaths in the United States have \"dropped off a cliff\" due to the Trump administration destroying drug smugglers' boats. | Entertainment",
    "link": "https://www.breitbart.com/entertainment/2026/01/03/joe-rogan-says-drug-overdose-deaths-have-dropped-off-a-cliff-due-to-trump-admins-boat-strikes/",
    "timestamp": "2026-01-03T18:46:10Z"
  },
  {
    "title": "James Stavridis Says Trump Admin Pulled Off ‘Extraordinary Military Operation’",
    "description": "James Stavridis praised the Trump administration's Saturday operation that led to the capture and removal of Nicolás Maduro.",
    "link": "https://dailycaller.com/2026/01/03/james-stavridis-trump-administration-nicolas-maduro-venezuela-operation/",
    "timestamp": "2026-01-03T18:45:02Z"
  },
  {
    "title": "Trump teases Mexico as next potential target for military intervention",
    "description": "Comes after capture of Venezuelan dictator",
    "link": "https://www.wnd.com/2026/01/trump-teases-mexico-as-next-potential-target-military/",
    "timestamp": "2026-01-03T18:44:03Z"
  },
  {
    "title": "Furniture Retailer Stocks Skyrocket Following Trump's Tariff Pause Announcement",
    "description": "Furniture retailer stocks experienced a significant surge on Friday. This comes in the wake of President Donald Trump‘s announcement of a one-year halt on increased tariffs on certain goods.\nWhat Happened: Shares of home furnishing retailers soared after Pres…",
    "link": "https://biztoc.com/x/9961a77c308483c2",
    "timestamp": "2026-01-03T18:41:54Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene re: Maduro capture in Venezuela",
    "description": "I’ve served on the Homeland Security Committee for the past three years. I’m 100% for strong safe secure borders and stopping narco terrorists and cartels from trafficking deadly drugs and human trafficking into America. Fentanyl is responsible for over 70% o…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360228/posts",
    "timestamp": "2026-01-03T18:41:45Z"
  },
  {
    "title": "Donald Trump Says the U.S. Will 'Run' Venezuela After Maduro's Ouster",
    "description": "The U.S. military captured the Venezuelan dictator Nicolás Maduro and his wife, Cilia Flores, during an operation carried out early this morning in the capital city of Caracas. At 1 a.m., residents of the city reported hearing explosions and aircraft. Accordi…",
    "link": "https://biztoc.com/x/d3ab8325c59aaec6",
    "timestamp": "2026-01-03T18:41:35Z"
  },
  {
    "title": "Trump: No U.S. Servicemembers Killed or Equipment Lost in Nicolas Maduro Capture",
    "description": "President Donald Trump announced Saturday that no United States servicemembers were killed and no equipment was lost in the capture of the now-former Venezuelan dictator Nicolás Maduro.\nThe post Trump: No U.S. Servicemembers Killed or Equipment Lost in Nicolá…",
    "link": "https://www.breitbart.com/politics/2026/01/03/trump-no-u-s-servicemembers-killed-or-equipment-lost-in-nicolas-maduro-capture/",
    "timestamp": "2026-01-03T18:40:07Z"
  },
  {
    "title": "US Attack on Venezuela Is Rank Imperialism",
    "description": "Editor's Note:The following statement by Sen. Bernie Sanders (I-Vt.) was issued Saturday, Jan. 3, 2026 following a press conference in which President Donald Trump confirmed Venezuelan President Nicolas Maduro, along with his wife, had been kidnapped by US fo…",
    "link": "https://www.commondreams.org/opinion/bernie-sanders-venezuela-attack",
    "timestamp": "2026-01-03T18:38:27Z"
  },
  {
    "title": "Judge convicted of obstructing immigrant arrest resigns as GOP threatens impeachment",
    "description": "She was convicted of obstruction for helping an immigrant evade federal agents.",
    "link": "https://abcnews.go.com/US/wireStory/wisconsin-judge-convicted-obstructing-arrest-immigrant-resigns-gop-128868549",
    "timestamp": "2026-01-03T18:37:07Z"
  },
  {
    "title": "US to ‘run’ Venezuela after toppling Maduro in military attack – Trump",
    "description": "President Trump announces the US will ‘run’ Venezuela and control its oil reserves after a military attack successfully toppled and captured Nicolas Maduro\n\nRead More: https://punchng.com/us-to-run-venezuela-after-toppling-maduro-in-military-attack-trump/",
    "link": "https://punchng.com/us-to-run-venezuela-after-toppling-maduro-in-military-attack-trump/",
    "timestamp": "2026-01-03T18:35:07Z"
  },
  {
    "title": "Trump: US will 'run' Venezuela, sell its oil after capturing Maduro",
    "description": "The U.S. has captured Venezuelan President Nicolás Maduro following months of escalating Trump administration pressure on the oil-rich South American nation.",
    "link": "https://www.boston.com/news/world-news/2026/01/03/trump-us-will-run-venezuela-sell-its-oil-after-capturing-maduro/",
    "timestamp": "2026-01-03T18:34:58Z"
  },
  {
    "title": "Venezuelans pour into streets to celebrate Maduro's fall",
    "description": "The U.S., Venezuela opposition leader María Corina Machado, and other international allies have long considered Maduro to have stolen the 2024 election in his country.",
    "link": "https://www.washingtonexaminer.com/news/world/4400728/venezuelans-pour-into-streets-to-celebrate-maduro-fall/",
    "timestamp": "2026-01-03T18:34:50Z"
  },
  {
    "title": "Trump ‘Not Thrilled’ With Putin, Says Too Many People Dying",
    "description": "President Donald Trump expressed fresh frustration with Russian President Vladimir Putin, bristling at the Kremlin’s ongoing military operations even as the US leader seeks to bring an end to the war in Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-not-thrilled-with-putin-says-too-many-people-dying",
    "timestamp": "2026-01-03T18:34:31Z"
  },
  {
    "title": "House Democrat Claims Marco Rubio Told Congress They’d Need Approval for Strikes That Happened Anyway",
    "description": "Rep. Pramila Jayapal (D-WA) accused Marco Rubio of lying to Congress following massive strikes against Venezuela and the capture of Nicolás Maduro.\nThe post House Democrat Claims Marco Rubio Told Congress They’d Need Approval for Strikes That Happened Anyway …",
    "link": "https://www.mediaite.com/media/tv/house-democrat-claims-marco-rubio-told-congress-theyd-need-approval-for-strikes-that-happened-anyway/",
    "timestamp": "2026-01-03T18:34:29Z"
  },
  {
    "title": "Photos: What Is the National Guard Doing in D.C.?",
    "description": "Uniformed and armed men and women can be seen all over the city wielding leaf blowers, hoses, and brooms as they do municipal chores.",
    "link": "https://reason.com/2026/01/03/photos-what-is-the-national-guard-doing-in-d-c/",
    "timestamp": "2026-01-03T18:34:23Z"
  },
  {
    "title": "Power vacuum...",
    "description": "Power vacuum...\r\n\n \n \n \n (Second column, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Shocked Venezuelans hunker down, unsure of what comes next...",
    "link": "https://www.newsweek.com/who-could-replace-nicolas-maduro-venezuela-president-edmundo-gonzalez-maria-corina-machado-11301587",
    "timestamp": "2026-01-03T18:31:38Z"
  },
  {
    "title": "Donald Trump Says the U.S. Will 'Run' Venezuela After Maduro's Ouster",
    "description": "When asked who would be in charge, Trump said: “We’re designating those people.”",
    "link": "https://reason.com/2026/01/03/donald-trump-says-the-u-s-will-run-venezuela-after-maduros-ouster/",
    "timestamp": "2026-01-03T18:30:50Z"
  },
  {
    "title": "How Trump went from boat strikes to regime change in Venezuela",
    "description": "The Venezuelan capital, Caracas, is seen at night after a series of explosions early in the morning on January 3, 2026. | Federico Parra/AFP via Getty Images \nPresident Donald Trump called for the US to “run” Venezuela on Saturday, shortly after the arrest of…",
    "link": "https://biztoc.com/x/628b1e2319fe9607",
    "timestamp": "2026-01-03T18:30:34Z"
  },
  {
    "title": "Maduro Indicted on Narco-Terrorism and Weapons Charges in U.S. District Court",
    "description": "Attorney General Pam Bondi on Saturday morning posted the unsealed grand jury indictment against Venezuelan dictator Nicolás Maduro.\nThe post Maduro Indicted on Narco-Terrorism and Weapons Charges in U.S. District Court appeared first on Breitbart.",
    "link": "https://www.breitbart.com/national-security/2026/01/03/maduro-indicted-narco-terrorism-weapons-charges-u-s-district-court/",
    "timestamp": "2026-01-03T18:30:03Z"
  },
  {
    "title": "NYT Editorial Scathes Trump’s ‘Warmongering’ After Capture Of Venezuelan President",
    "description": "President Donald Trump is \"pushing our country toward an international crisis without valid reasons,\" The New York Times editorial board wrote.",
    "link": "https://www.huffpost.com/entry/new-york-times-editorial-venezeula_n_6959470ae4b0edc730d1e4cd",
    "timestamp": "2026-01-03T18:29:56Z"
  },
  {
    "title": "I wrote a book on the politics of war powers, and Trump’s attack on Venezuela reflects Congress surrendering its decision-making powers",
    "description": "Congress has a legal, constitutional and even moral responsibility to assert itself as a branch when it comes to military actions by the US, says an expert on war powers.",
    "link": "https://theconversation.com/i-wrote-a-book-on-the-politics-of-war-powers-and-trumps-attack-on-venezuela-reflects-congress-surrendering-its-decision-making-powers-272668",
    "timestamp": "2026-01-03T18:29:53Z"
  },
  {
    "title": "The US Invaded Venezuela and Captured Nicolás Maduro. ChatGPT Disagrees",
    "description": "US president Donald Trump posted on his Truth Social platform that Venezuelan president Nicolás Maduro and his wife had been “captured and flown out of the Country.” WIRED asked leading chatbots ChatGPT, Claude, and Gemini the same question a little before 9 …",
    "link": "https://slashdot.org/submission/17343747/the-us-invaded-venezuela-and-captured-nicols-maduro-chatgpt-disagrees",
    "timestamp": "2026-01-03T18:29:08Z"
  },
  {
    "title": "‘Just Remarkable!’ CNN Analyst Gobsmacked By Trump Declaring US Will ‘Run’ Venezuela",
    "description": "Alayna Treene called it \"remarkable\" that President Donald Trump declared the U.S. will run the country of Venezuela until he finds a suitable replacement.\nThe post ‘Just Remarkable!’ CNN Analyst Gobsmacked By Trump Declaring US Will ‘Run’ Venezuela first app…",
    "link": "https://www.mediaite.com/media/news/just-remarkable-cnn-analyst-gobsmacked-by-trump-declaring-us-will-run-venezuela/",
    "timestamp": "2026-01-03T18:27:41Z"
  },
  {
    "title": "Bluesky is not the good place",
    "description": "The social media site that many sought as an alternative to X fosters groupthink and pointless activism.",
    "link": "https://www.ms.now/opinion/bluesky-elon-musk-twitter-replacement",
    "timestamp": "2026-01-03T18:27:29Z"
  },
  {
    "title": "TRUMP: ‘It’s the Donroe Doctrine Now’ — Monroe Doctrine Frames the U.S. Arrest of Venezuela’s Maduro",
    "description": "The arrest of Venezuelan dictator Nicolás Maduro wasn’t just a takedown — it was the most forceful revival of the Monroe Doctrine in a generation, a blunt reminder that hostile regimes and cartel‑run states in the Western Hemisphere will face consequences. An…",
    "link": "https://www.breitbart.com/border/2026/01/03/trump-its-the-donroe-doctrine-now-monroe-doctrine-frames-the-u-s-arrest-of-venezuelas-maduro/",
    "timestamp": "2026-01-03T18:26:43Z"
  },
  {
    "title": "Ukraine updates: Trump says Putin 'killing too many people'",
    "description": "US President Trump has said he is \"not thrilled with Putin\" during a press conference. Meanwhile, European security advisers are in Kyiv to discuss a 20-point peace plan put forward by Zelenskyy. DW has more. President Trump has said he's not happy with Putin…",
    "link": "https://www.dw.com/en/ukraine-updates-trump-says-putin-killing-too-many-people/live-75373512",
    "timestamp": "2026-01-03T18:26:00Z"
  },
  {
    "title": "How Trump went from boat strikes to regime change in Venezuela",
    "description": "President Donald Trump called for the US to “run” Venezuela on Saturday, shortly after the arrest of Venezuelan President Nicolás Maduro amid US strikes on the country’s capital of Caracas. The attack is a major escalation in Trump’s months-long pressure camp…",
    "link": "https://www.vox.com/politics/473935/trump-venezuela-attack-maduro-arrest-criminal-charges-what-to-know",
    "timestamp": "2026-01-03T18:24:34Z"
  },
  {
    "title": "US pretence of respecting Latin American sovereignty over",
    "description": "",
    "link": "https://www.rte.ie/news/analysis-and-comment/2026/0103/1551350-venezuela-us/",
    "timestamp": "2026-01-03T18:24:11Z"
  },
  {
    "title": "Trump Shares Maduro Capture Photos as Marco Rubio Insists Congress Could Not Have Been Notified Ahead of Time",
    "description": "Donald Trump shared several photos of the capture of Venezuela president Nicolás Maduro from what appears to be some type of situation room with military officials including Secretary of War Pete Hegseth present, moments after Marco Rubio insisted Congress wa…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-shares-maduro-capture-photos-as-marco-rubio-insists-congress-could-not-have-been-notified-ahead-of-time/",
    "timestamp": "2026-01-03T18:23:47Z"
  },
  {
    "title": "Trump: US will “run” Venezuela after Maduro capture",
    "description": "Trump outlines temporary governance, oil involvement and military readiness. Global reactions are sharply divided",
    "link": "https://www.salon.com/2026/01/03/trump-us-will-run-venezuela-after-maduro-capture/",
    "timestamp": "2026-01-03T18:22:26Z"
  },
  {
    "title": "Brewers provide update on status of Jackson Chourio, other players in Venezuela",
    "description": "Jackson Chourio has been dominating the Venezuelan winter league, though it's unclear for how much longer after U.S. military strikes.",
    "link": "https://www.jsonline.com/story/sports/mlb/brewers/2026/01/03/jackson-chourio-other-brewers-in-venezuela-amid-uncertainty/88006878007/",
    "timestamp": "2026-01-03T18:21:04Z"
  },
  {
    "title": "Trump says ‘we’re going to run’ Venezuela and is not afraid to put U.S. troops on the ground after Maduro’s capture",
    "description": "\"We're not afraid of boots on the ground. We're not afraid of it. We're we don't mind saying it, and we're gonna make sure that that country is run properly.\"",
    "link": "https://fortune.com/2026/01/03/trump-us-control-maduro-rubio-venezuela-us-troops-boots-on-the-ground/",
    "timestamp": "2026-01-03T18:21:03Z"
  },
  {
    "title": "600 drivers undergo eye and health checkup in Bokaro as part of road safety month",
    "description": "In a proactive move towards safer roads, more than 600 commercial vehicle drivers in Bokaro benefited from complimentary eye and health check-ups during a dedicated event for the 36th National Road Safety Month. This initiative prioritized the identification …",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/600-drivers-undergo-eye-and-health-checkup-in-bokaro-as-part-of-road-safety-month/articleshow/126326511.cms",
    "timestamp": "2026-01-03T18:20:48Z"
  },
  {
    "title": "Meitei group flags threat to India’s sovereignty in memo to PM Modi",
    "description": "The Meitei Heritage Society has reached out to Prime Minister Modi, raising concerns over the Chin-Kuki-Zo group’s purported international engagement, including discussions with UN organizations regarding a contentious road construction project. They warn tha…",
    "link": "https://timesofindia.indiatimes.com/city/guwahati/meitei-group-flags-threat-to-indias-sovereignty-in-memo-to-pm-modi/articleshow/126326527.cms",
    "timestamp": "2026-01-03T18:20:15Z"
  },
  {
    "title": "Trump Says US Companies Will Rebuild Venezuelan Oil Infrastructure",
    "description": "President Donald Trump said American oil companies will “spend billions of dollars” to fix oil infrastructure in Venezuela following ...",
    "link": "https://biztoc.com/x/bee50ac25df2ebfd",
    "timestamp": "2026-01-03T18:20:14Z"
  },
  {
    "title": "Ouster of Maduro government sparks celebrations among Venezuelans in South Florida",
    "description": "People gathered for a rally in Doral, Florida, as word spread that Venezuela’s president was captured and flown out of the country.",
    "link": "https://www.bostonherald.com/2026/01/03/maduro-military-capture-us-reaction/",
    "timestamp": "2026-01-03T18:19:02Z"
  },
  {
    "title": "Trump brushes off concerns about legality of US operations in Venezuela — as AOC, Hochul decry admin’s arrest of Nicolás Maduro",
    "description": "In an interview with Fox News Saturday morning, Trump brushed off concerns about the legality of the US operating in Venezuela, calling Democrats \"weak, stupid people\" after receiving criticism from Rep. Jim Himes, a top Democrat on the House Intelligence Com…",
    "link": "https://nypost.com/2026/01/03/world-news/trump-brushes-off-concerns-about-legality-of-us-operations-in-venezuela-as-aoc-hochul-decry-admins-arrest-of-nicolas-maduro/",
    "timestamp": "2026-01-03T18:17:46Z"
  },
  {
    "title": "In Venezuela Takeover, Trump Makes It All About The Oil",
    "description": "The president, who claimed to oppose involvement in “nation building,” also said the U.S. would “run” Venezuela for an indefinite period.",
    "link": "https://www.huffpost.com/entry/trump-venezuela-oil_n_69594f09e4b0993009673280",
    "timestamp": "2026-01-03T18:17:32Z"
  },
  {
    "title": "Disinformation Floods Social Media After Nicolás Maduro's Capture",
    "description": "From seemingly AI-generated videos to the recirculation of old footage, TikTok, Instagram, and X did little to stop the onslaught of misleading posts in the wake of the US invasion of Venezuela.",
    "link": "https://www.wired.com/story/disinformation-floods-social-media-after-nicolas-maduros-capture/",
    "timestamp": "2026-01-03T18:14:47Z"
  },
  {
    "title": "Trump Says US Is Going to Run Venezuela After Capturing Its Socialist Dictator",
    "description": "President Donald Trump said that the United States would seek to repair the infrastructure of Venezuela’s oil industry.",
    "link": "https://www.westernjournal.com/trump-says-us-going-run-venezuela-capturing-socialist-dictator/",
    "timestamp": "2026-01-03T18:14:41Z"
  },
  {
    "title": "Trump says U.S. is going to run Venezuela after nabbing Maduro",
    "description": "Would seek to repair nation's oil industry infrastructure",
    "link": "https://www.wnd.com/2026/01/trump-says-u-s-is-going-run-venezuela/",
    "timestamp": "2026-01-03T18:14:28Z"
  },
  {
    "title": "CJI lays foundation for seven Patna HC infrastructure projects, stresses need for tech in judicial processes",
    "description": "Patna: Chief Justice of India (CJI) Justice Surya Kant on Saturday said capacity building in judicial infrastructure was essential to meet the demands.",
    "link": "https://timesofindia.indiatimes.com/city/patna/cji-lays-foundation-for-seven-patna-hc-infrastructure-projects-stresses-need-for-tech-in-judicial-processes/articleshow/126326306.cms",
    "timestamp": "2026-01-03T18:14:28Z"
  },
  {
    "title": "Over 300,000 Californians will need to replace REAL IDs due to DMV software error",
    "description": "Due to a software error, over 300,000 Californians will need to replace their REAL IDs, the California Department of Motor Vehicles said this week. According to the department, a review of its data systems identified that some legal immigrants were issued REA…",
    "link": "https://freerepublic.com/focus/f-news/4360223/posts",
    "timestamp": "2026-01-03T18:10:30Z"
  },
  {
    "title": "AIFF likely to ease pressure on clubs, pave way for start of ISL",
    "description": "Panaji: A three-member co-ordination committee has asked the All India Football Federation (AIFF) to immediately declare commencement date for the Ind.",
    "link": "https://timesofindia.indiatimes.com/city/goa/aiff-likely-to-ease-pressure-on-clubs-pave-way-for-start-of-isl/articleshow/126326310.cms",
    "timestamp": "2026-01-03T18:09:18Z"
  },
  {
    "title": "U.S. Will Run Venezuela For Now, Second Military Wave Stands Ready",
    "description": "The United States will run the country of Venezuela until a replacement for dictator Nicolás Maduro can be found and sworn in, President Donald Trump announced at a press conference today. The Trump administration plans to send American oil companies down to …",
    "link": "https://freerepublic.com/focus/f-news/4360222/posts",
    "timestamp": "2026-01-03T18:08:48Z"
  },
  {
    "title": "‘Team’ from US to run Venezuela after ‘capture’ of Maduro",
    "description": "US President Donald Trump says a ‘team’ from the US will be running Venezuela.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/3/team-from-us-to-run-venezuela-after-capture-of-maduro",
    "timestamp": "2026-01-03T18:08:06Z"
  },
  {
    "title": "BJP to hold stir in Bokaro over municipal polls",
    "description": "On January 7, the BJP faction in Bokaro plans to stage a protest, calling for swift municipal elections throughout Jharkhand. Leading the charge, former MLAs Amar Kumar Bauri and Biranchi Narayan will spearhead the one-day rally in front of the Chas Municipal…",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/bjp-to-hold-stir-in-bokaro-over-municipal-polls/articleshow/126326251.cms",
    "timestamp": "2026-01-03T18:06:51Z"
  },
  {
    "title": "Kaun Banega Crorepati: When host Amitabh Bachchan spoke about his make-up artist reporting to work despite the demise of his brother",
    "description": "An old video of Amitabh Bachchan praising his make-up artist Deepak Sawant for 50 years of unwavering dedication has resurfaced. Bachchan highlighted Sawant's commitment, even attending work after his brother's death. The KBC 17 finale saw Bachchan get emotio…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/kaun-banega-crorepati-when-host-amitabh-bachchan-spoke-about-his-make-up-artist-reporting-to-work-despite-the-demise-of-his-brother/articleshow/126326204.cms",
    "timestamp": "2026-01-03T18:06:41Z"
  },
  {
    "title": "Trump’s Venezuelan Regime Change: Why Do People Keep Getting Him Wrong on Foreign Policy?",
    "description": "A number of thoughtful observers argued President Donald Trump would not pursue regime change in Venezuela. I was never convinced. On our podcast and in private conversations with experts and political leaders alike, I have been predicting that he would go fo…",
    "link": "https://warontherocks.com/2026/01/trumps-venezuelan-regime-change-why-do-people-keep-getting-him-wrong-on-foreign-policy/",
    "timestamp": "2026-01-03T18:06:13Z"
  },
  {
    "title": "BJP files plaint against woman for stealing party AB form",
    "description": "Mumbai: Dinesh Jagtap, office secretary of BJP, Mumbai, lodged a complaint against one Shilpa Keluskar for allegedly stealing an AB form and submittin.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/bjp-files-plaint-against-woman-for-stealing-party-ab-form/articleshow/126325806.cms",
    "timestamp": "2026-01-03T18:06:00Z"
  },
  {
    "title": "Girl’s body found in Dhubri mustard field, suspect held",
    "description": "On Saturday, tragedy struck when the lifeless body of a young college girl was found in a mustard field in Dhubri. A man named Lalchand Ali, who purportedly had romantic feelings for her, is now in custody. Her family claims she was assaulted and strangled be…",
    "link": "https://timesofindia.indiatimes.com/city/guwahati/girls-body-found-in-dhubri-mustard-field-suspect-held/articleshow/126326257.cms",
    "timestamp": "2026-01-03T18:05:41Z"
  },
  {
    "title": "Travel alert: Delta cancels Caribbean flights amid strikes in Venezuela",
    "description": "Delta Air Lines has begun canceling flights to several Caribbean destinations as it continues to monitor an evolving situation in the region tied to FAA airspace closures.",
    "link": "https://www.wsbtv.com/news/local/atlanta/travel-alert-delta-cancels-caribbean-flights-amid-strikes-venezuela/DTASPM5HCFGSHKK3WNZKDOINFE/",
    "timestamp": "2026-01-03T18:05:11Z"
  },
  {
    "title": "Marjorie Taylor Greene Rips Trump’s Strike on Venezuela: ‘MAGA Thought They Voted to End’ This — ‘Boy Were We Wrong’",
    "description": "Rep. Marjorie Taylor Greene (R-GA) — serving out her final days before stepping down from Congress — ripped President Trump's decision to strike Venezuela.\nThe post Marjorie Taylor Greene Rips Trump’s Strike on Venezuela: ‘MAGA Thought They Voted to End’ This…",
    "link": "https://www.mediaite.com/media/news/marjorie-taylor-greene-rips-trumps-strike-on-venezuela-maga-thought-they-voted-to-end-this-boy-were-we-wrong/",
    "timestamp": "2026-01-03T18:03:49Z"
  },
  {
    "title": "US allies, foes alarmed by capture of Venezuela’s Maduro",
    "description": "The US military operation that led to the capture of Venezuelan President Nicolas Madruo on Saturday sparked alarm across the international community, with allies and foes of Washington and Caracas expressing disquiet. US President Donald Trump said Nicolas M…",
    "link": "https://www.digitaljournal.com/world/us-allies-foes-alarmed-by-capture-of-venezuelas-maduro/article",
    "timestamp": "2026-01-03T18:02:20Z"
  },
  {
    "title": "Although the UN criticized Trump for harassing Venezuela, there is still no action.",
    "description": "The military intervention carried out under the orders of US President Donald Trump to arrest Venezuelan President Nicolas Maduro has been severely criticized by the United Nations. The United Nations, calling this action a \"dangerous precedent,\" has expresse…",
    "link": "https://english.gossiplankanews.com/2026/01/although-un-criticized-trump-for.html",
    "timestamp": "2026-01-03T18:00:23Z"
  },
  {
    "title": "Trump has big plans for America's 250th birthday — but not everyone is invited",
    "description": "It is entirely fitting that the US is so splintered on its semiquincentennial. Division, for the lion's share of its history, has been its default.",
    "link": "https://www.abc.net.au/news/2026-01-04/on-its-250th-birthday-america-is-being-america/106193418",
    "timestamp": "2026-01-03T18:00:00Z"
  },
  {
    "title": "2025 in Review: How Trump Reshaped America and the World",
    "description": "The president curbed illegal immigration, boosted the economy, enacted tax reform, targeted gender ideology, and resolved international conflicts.WASHINGTON—Since returning to the White House in January, President Donald Trump has rapidly reshaped America’s d…",
    "link": "https://freerepublic.com/focus/f-news/4360219/posts",
    "timestamp": "2026-01-03T17:58:49Z"
  },
  {
    "title": "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow",
    "description": "President Donald Trump on Saturday said U.S. oil companies will invest billions of dollars in Venezuela's energy sector after the overthrow of President Nicolas Maduro.\n\"We're going to have our very large United States oil companies — the biggest anywhere in …",
    "link": "https://biztoc.com/x/bb090bbec2afad68",
    "timestamp": "2026-01-03T17:57:40Z"
  },
  {
    "title": "Trump says U.S. will 'run' Venezuela until 'transition' to new president",
    "description": "U.S. President Donald Trump delivers a press conference after the capture of Venezuela President Nicolás Maduro, Washington, D.C., Saturday, Jan. 3, 2026. Credit: JIM WATSON / Getty Images\n\nJan 3, 2026 / 12:56 pm (CNA).\nU.S. President Donald Trump on Jan. 3 s…",
    "link": "https://www.catholicnewsagency.com/news/268843/trump-says-u-s-will-run-venezuela-until-transition-can-be-arranged",
    "timestamp": "2026-01-03T17:56:00Z"
  },
  {
    "title": "A timeline of the US military’s buildup and strikes against Venezuela leading to Maduro’s capture",
    "description": "A timeline of the US military’s buildup and strikes against Venezuela leading to Maduro’s capturewpxi.com",
    "link": "https://www.wpxi.com/news/local/timeline-us-militarys-buildup-strikes-against-venezuela-leading-maduros-capture/JQP2LTBFAREUZKQ34CQOVP54OI/",
    "timestamp": "2026-01-03T17:54:02Z"
  },
  {
    "title": "Trump Says 'We're Going To Run The Country' After Venezuela Military Operation",
    "description": "\"We're gonna run it, essentially,\" President Donald Trump said during a news conference about the capture of Venezuelan President Nicolas Maduro.",
    "link": "https://www.huffpost.com/entry/trump-says-were-going-to-run-the-country-after-venezuela-military-operation_n_69594c0ce4b048f68c303351",
    "timestamp": "2026-01-03T17:53:05Z"
  },
  {
    "title": "Trump signals US may expand focus to Cuba amid Venezuela operation",
    "description": "PALM ‌BEACH, Florida, ‌Jan 3 (Reuters) - ‌U.S. President Donald Trump on ‍Saturday indicated ‍that Cuba ‌could become a ‍topic ​of ⁠discussion as part of ‌broader U.S. policy ⁠in ‍the region, highlighting ‍the potential ‌for Washington to expand its focus bey…",
    "link": "https://www.thestar.com.my/news/world/2026/01/04/trump-signals-us-may-expand-focus-to-cuba-amid-venezuela-operation",
    "timestamp": "2026-01-03T17:51:00Z"
  },
  {
    "title": "Venezuelan dictator appears blindfolded, handcuffed in first picture aboard USS Iwo Jima, flown to NYC to face justice",
    "description": "The first photo of deposed Venezuelan dictator Nicolas Maduro was released by President Donald Trump.",
    "link": "https://nypost.com/2026/01/03/world-news/venezuelan-dictator-seen-in-first-picture-aboard-uss-iwo-jima-flown-to-nyc-to-face-justice/",
    "timestamp": "2026-01-03T17:50:54Z"
  },
  {
    "title": "Stimulus payment January 2026, IRS direct deposit relief payment & tariff dividend fact check",
    "description": "Rumors about new stimulus checks, IRS direct deposits, relief payments and tariff dividends swirled throughout 2025, and they’re continuing to circulate as we head into 2026. But is there any truth to them?",
    "link": "https://www.fox5atlanta.com/news/stimulus-payment-january-2026-irs-direct-deposit-relief-payment-tariff-dividend-fact-check",
    "timestamp": "2026-01-03T17:50:33Z"
  },
  {
    "title": "WATCH: Trump says U.S. is 'going to run' Venezuela until transition of power after capturing Maduro",
    "description": "Trump addressed the nation after the United States captured Venezuelan President Nicolás Maduro and flew him out of the country in a military operation early in the day that plucked a sitting leader from office.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-says-u-s-is-going-to-run-venezuela-until-transition-of-power-after-capturing-maduro",
    "timestamp": "2026-01-03T17:49:57Z"
  },
  {
    "title": "Poll of the Day: Do you support the military operation in Venezuela?",
    "description": "President Donald Trump said the U.S. plans to remain in Venezuela until a transition of power can take place.",
    "link": "https://www.klkntv.com/poll-of-the-day-do-you-support-the-military-operation-in-venezuela/",
    "timestamp": "2026-01-03T17:48:30Z"
  }
]