[
  {
    "title": "Trump administration considers suspending habeas corpus",
    "description": "The White House is \"actively looking at\" suspending the legal right to challenge detention.",
    "link": "https://www.bbc.com/news/articles/c0qgz18glljo",
    "timestamp": "2025-05-10T08:50:44Z"
  },
  {
    "title": "European leaders arrive in Kyiv in show of joint 'solidarity' with Ukraine",
    "description": "It comes a day after Russia held extravagant celebrations on its annual Victory Day.",
    "link": "https://www.thejournal.ie/european-leaders-arrive-in-kyiv-in-show-of-joint-solidarity-with-ukraine-6701428-May2025/",
    "timestamp": "2025-05-10T08:43:28Z"
  },
  {
    "title": "Denmark PM says 'you cannot spy against an ally' following reports of US spying on Greenland",
    "description": "Denmark Prime Minister Mette Frederiksen said \"you cannot spy against an ally\" after reports that the U.S. was gathering intelligence on Greenland.",
    "link": "https://www.foxnews.com/world/denmark-pm-says-you-cannot-spy-against-ally-following-reports-us-spying-greenland",
    "timestamp": "2025-05-10T08:41:36Z"
  },
  {
    "title": "Judge orders temporary halt to Trump administration’s government overhaul",
    "description": "US District Judge Susan Illston in San Francisco sided with a group of unions, non-profits and local governments, and blocked large-scale mass layoffs known as \"reductions in force\" for 14 days.",
    "link": "https://nypost.com/2025/05/10/us-news/federal-judge-susan-illston-pauses-trump-admin-mass-layoffs/",
    "timestamp": "2025-05-10T08:39:45Z"
  },
  {
    "title": "Producer Plans $100M Donald Trump Biopic",
    "description": "“Ferrari” producer Andrea Iervolino is reportedly spearheading a big-budget biopic about current U.S. President Donald J. Trump. Unlike Ali Abassi’s recent indie film “The Apprentice” which focused on a specific period in Trump’s life, this would span the ent…",
    "link": "https://www.darkhorizons.com/producer-plans-100m-donald-trump-biopic/",
    "timestamp": "2025-05-10T08:38:14Z"
  },
  {
    "title": "The WH says Trump is considering suspending habeas corpus. What would that mean?",
    "description": "White House deputy chief of staff Stephen Miller said Friday that the Trump administration is \"actively looking at\" suspending habeas corpus, the right of a person to challenge their detention in court. If carried out by President Donald Trump, the suspension…",
    "link": "https://freerepublic.com/focus/f-news/4316104/posts",
    "timestamp": "2025-05-10T08:36:02Z"
  },
  {
    "title": "Ukraine and European allies call for 30-day truce with Russia starting Monday | CNN",
    "description": "The leaders of Germany, France, the United Kingdom and Poland have told Russian leader Vladimir Putin to agree to a 30-day ceasefire starting on Monday or face possible “massive” sanctions, according to French President Emmanuel Macron, on a highly symbolic v…",
    "link": "https://www.cnn.com/2025/05/10/europe/european-leaders-kyiv-ukraine-visit-intl",
    "timestamp": "2025-05-10T08:34:37Z"
  },
  {
    "title": "What working at SpaceX taught this founder about starting his own company",
    "description": "Justin Lopas spent years working at SpaceX, and even directly with Musk. He told BI how the lessons he learned are shaping his own startup.",
    "link": "https://www.businessinsider.com/former-spacex-employee-founder-shares-management-lessons-2025-5",
    "timestamp": "2025-05-10T08:34:01Z"
  },
  {
    "title": "Mike Johnson says he's open to banning stock trading in Congress. Here's where things stand.",
    "description": "Despite the broad popularity of the issue, the task of actually passing a stock trading ban has never been straightforward.",
    "link": "https://www.businessinsider.com/mike-johnson-open-stock-trading-ban-2025-5",
    "timestamp": "2025-05-10T08:21:01Z"
  },
  {
    "title": "These boomers rely on housing vouchers to stay out of homelessness. Trump is proposing big cuts",
    "description": "Getty Images; Chelsea Jia Feng/BI\nPresident Donald Trump's proposed budget includes cuts to federal housing aid, including vouchers.\nThe vouchers are used by more than 2 million low-income households, but millions more qualify.\nSeniors reliant on Social Secur…",
    "link": "https://biztoc.com/x/632000195c7d8225",
    "timestamp": "2025-05-10T08:19:44Z"
  },
  {
    "title": "William Shatner doubles down on the US joining Canada following Trump’s ‘insulting’ comments",
    "description": "‘Doesn’t feel good; does it?’ wrote the actor after joking that the US should join Canada",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/william-shatner-trump-canada-us-b2748409.html",
    "timestamp": "2025-05-10T08:18:56Z"
  },
  {
    "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
    "description": "On Friday morning, West Coast port officials told CNN about a startling sight: Not a single cargo vessel had left China with goods for the two major West Coast ports in the past 12 hours. That hasn’t happened since the pandemic.",
    "link": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
    "timestamp": "2025-05-10T08:13:57Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,171",
    "description": "These are the key events on day 1,171 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/10/russia-ukraine-war-list-of-key-events-day-1171",
    "timestamp": "2025-05-10T08:13:43Z"
  },
  {
    "title": "Ukraine and its allies push for a 30-day ceasefire starting Monday",
    "description": "Ukraine and its allies are ready for a “full, unconditional ceasefire” with Russia for at least 30 days starting Monday, Ukrainian Foreign Minister Andrii Sybiha said Saturday.",
    "link": "https://www.independent.ie/world-news/europe/ukraine-and-its-allies-push-for-a-30-day-ceasefire-starting-monday/a1523877495.html",
    "timestamp": "2025-05-10T08:13:20Z"
  },
  {
    "title": "Trump Faces Mideast Tensions On Return To His 'Happy Place'",
    "description": "US President Donald Trump heads for Saudi Arabia, Qatar and the United Arab Emirates on Monday, eyeing big business deals even as accords on the Middle East's hotspots will be harder to seal.",
    "link": "https://www.ibtimes.com/trump-faces-mideast-tensions-return-his-happy-place-3773121",
    "timestamp": "2025-05-10T08:12:06Z"
  },
  {
    "title": "Trump faces Mideast tensions on return to his ‘happy place’",
    "description": "US President Donald Trump heads for Saudi Arabia, Qatar and the United Arab Emirates on Monday, eyeing big business deals even as accords on the Middle East’s hotspots will be harder to seal. While Israel’s war in Gaza and Iran’s nuclear program will loom lar…",
    "link": "https://www.digitaljournal.com/world/trump-faces-mideast-tensions-on-return-to-his-happy-place/article",
    "timestamp": "2025-05-10T08:07:20Z"
  },
  {
    "title": "Swords, orbs and fist-bumps: US presidents in Saudi",
    "description": "In the first foreign tour of his second term, US President Donald Trump will arrive in Saudi Arabia on Tuesday before visiting Qatar and the United Arab Emirates. Trump is just the latest US president to visit oil-rich Saudi Arabia. Here are some of the most …",
    "link": "https://www.digitaljournal.com/world/swords-orbs-and-fist-bumps-us-presidents-in-saudi/article",
    "timestamp": "2025-05-10T08:07:20Z"
  },
  {
    "title": "These boomers rely on housing vouchers to stay out of homelessness. Trump is proposing big cuts.",
    "description": "More than 2.3 million US households that rely on federal housing vouchers. Many of them are seniors on fixed incomes.",
    "link": "https://www.businessinsider.com/boomers-retirement-subsidized-housing-vouchers-social-security-vulnerable-trump-cuts-2025-4",
    "timestamp": "2025-05-10T08:07:01Z"
  },
  {
    "title": "Swords, Orbs And Fist-bumps: US Presidents In Saudi",
    "description": "In the first foreign tour of his second term, US President Donald Trump will arrive in Saudi Arabia on Tuesday before visiting Qatar and the United Arab Emirates.",
    "link": "https://www.ibtimes.com/swords-orbs-fist-bumps-us-presidents-saudi-3773120",
    "timestamp": "2025-05-10T08:06:22Z"
  },
  {
    "title": "Making big life decisions during a time of massive change",
    "description": "Timing big decisions like buying a house or switching jobs is tough in the Trump era. BI's series is here to help you with these life choices.",
    "link": "https://www.businessinsider.com/how-to-make-time-big-life-decisions-economic-uncertainty-2025-5",
    "timestamp": "2025-05-10T08:05:01Z"
  },
  {
    "title": "Make me look less American: Brands are changing up their ads amid Trump's trade war",
    "description": "Brands like Kraft Heinz and McDonald's are scrambling to avoid anti-American sentiment abroad and skirt tariff-induced boycotts.",
    "link": "https://www.businessinsider.com/brands-try-looking-less-american-global-ads-trump-trade-war-2025-5",
    "timestamp": "2025-05-10T08:03:01Z"
  },
  {
    "title": "European leaders in Ukraine’s Kyiv to press Russia for 30-day ceasefire",
    "description": "Trip marks the first joint visit to Ukraine by leaders of France, Germany, the UK and Poland.",
    "link": "https://www.aljazeera.com/news/2025/5/10/european-leaders-in-ukraines-kyiv-to-press-russia-for-30-day-ceasefire",
    "timestamp": "2025-05-10T08:02:39Z"
  },
  {
    "title": "The 9 at 9: Saturday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/morning-headlines-106-6701407-May2025/",
    "timestamp": "2025-05-10T08:02:28Z"
  },
  {
    "title": "Uncle Sam’s Devil’s Island: From Al Capone to ‘Machine Gun’ Kelly, meet Alcatraz’s most infamous inmates",
    "description": "Take a look a the most infamous inmates at Alcatraz as President Donald Trump is looking to reopen the prison off the coast of San Francisco, California.",
    "link": "https://www.foxnews.com/us/uncle-sams-devils-island-from-al-capone-machine-gun-kelly-meet-alcatraz-most-infamous-inmates",
    "timestamp": "2025-05-10T08:00:40Z"
  },
  {
    "title": "WATCH: Senators answer questions about 'due process' as Trump cracks down on illegal immigration",
    "description": "Fox News Digital asked lawmakers on Capitol Hill to respond to President Donald Trump's argument that illegal immigrants are not entitled to due process.",
    "link": "https://www.foxnews.com/politics/watch-senators-answer-questions-about-due-process-trump-cracks-down-illegal-immigration",
    "timestamp": "2025-05-10T08:00:39Z"
  },
  {
    "title": "Upstate N.Y. tourism operators offering discounts to win back Canadians",
    "description": "More than retaliatory counter tariffs, an informal Canadian visitor boycott is hurting American border communities whose economies rely in part on Canadian visitors and cross-border supply chains. Tourism operators in Upstate New York are hoping special disco…",
    "link": "https://www.cbc.ca/news/canada/ottawa/upstate-n-y-tourism-operators-offering-discounts-to-win-back-canadians-1.7527622",
    "timestamp": "2025-05-10T08:00:00Z"
  },
  {
    "title": "Foreigners have flocked to 'welcoming' Portugal. Why is it expelling migrants now?",
    "description": "With its warm climate, comparatively affordable living and rich culture, Portugal has long appealed to visitors, whether it's for a vacation or a more permanent move. So the government's plans to expel some 18,000 foreigners living in the country without auth…",
    "link": "https://www.cbc.ca/news/world/portugal-immigration-1.7527596",
    "timestamp": "2025-05-10T08:00:00Z"
  },
  {
    "title": "Judge temporarily blocks Trump and Musk’s administration overhaul",
    "description": "‘The President may broadly restructure federal agencies only when authorised by Congress’",
    "link": "https://7news.com.au/news/judge-temporarily-blocks-trump-and-musks-administration-overhaul-c-18647933",
    "timestamp": "2025-05-10T07:48:14Z"
  },
  {
    "title": "President Donald Trump Just Called for a Drastic Social Security Change -- but It Comes With Unintended Consequences",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_627fe0ed-7f8b-44fa-a86a-5ceab8117341",
    "timestamp": "2025-05-10T07:44:00Z"
  },
  {
    "title": "Russia wants end to arms supplies for Ukraine as ceasefire condition",
    "description": "Russia wants the United States and the European Union to cease their arms supplies to Kiev as a precondition for a 30-day ceasefire in the Ukraine war, the...",
    "link": "https://www.yahoo.com/news/russia-wants-end-arms-supplies-073920396.html",
    "timestamp": "2025-05-10T07:39:20Z"
  },
  {
    "title": "Ex-Trump admin official Camryn Kinsey ‘doing well’ after fainting during live television interview",
    "description": "The former Division I cheerleader sat still for a few seconds before her eyes shut and she fell off her chair, landing on the stage below.",
    "link": "https://nypost.com/2025/05/10/media/ex-trump-admin-official-camryn-kinsey-gives-update-after-collapse-on-fox-news-appearance/",
    "timestamp": "2025-05-10T07:39:17Z"
  },
  {
    "title": "European leaders arrive in Kyiv to show support after Putin’s parade",
    "description": "Leaders of Britain, France, Germany, Poland in Ukraine.",
    "link": "https://www.euractiv.com/section/politics/news/european-leaders-arrive-in-kyiv-to-show-support-after-putins-parade/",
    "timestamp": "2025-05-10T07:28:41Z"
  },
  {
    "title": "Gulf diplomatic source claims Trump will announce US recognition of Palestinian state",
    "description": "Saudi Arabia will host a Gulf-US summit in mid-May, part of US President Donald Trump's first visit to Saudi Arabia during his second term. This follows the summit held on May 21, 2017, during Trump's first term.The summit, hosted by Saudi Arabia in its capit…",
    "link": "https://freerepublic.com/focus/f-news/4316102/posts",
    "timestamp": "2025-05-10T07:27:52Z"
  },
  {
    "title": "European leaders arrive in Kyiv amid push for 30-day ceasefire",
    "description": "The leaders of four European countries have arrived in Kyiv as calls intensify for Russia to agree to a monthlong ceasefire in the war",
    "link": "https://abcnews.go.com/International/wireStory/european-leaders-arrive-kyiv-amid-push-30-day-121664248",
    "timestamp": "2025-05-10T07:27:44Z"
  },
  {
    "title": "European leaders arrive in Kyiv to show support after Putin's parade",
    "description": "KYIV (Reuters) -The leaders of Britain, France, Germany and Poland arrived in Kyiv on Saturday for talks with Ukrainian President Volodymyr Zelenskiy in a show of unity a day after Russia's Vladimir Putin hosted his allies in a Victory Day parade on Red Squar…",
    "link": "https://www.thestar.com.my/news/world/2025/05/10/european-leaders-arrive-in-kyiv-to-show-support-after-putin039s-parade",
    "timestamp": "2025-05-10T07:27:00Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene says she won’t run for Senate while blasting Dems and fellow Republicans",
    "description": "\"Someone once said, ‘The Senate is where good ideas go to die.’ They were right. That’s why I’m not running,\" Greene wrote as she announced her decision.",
    "link": "https://nypost.com/2025/05/10/us-news/georgia-rep-marjorie-taylor-greene-says-she-wont-run-for-senate-while-blasting-dems-and-fellow-republicans/",
    "timestamp": "2025-05-10T07:26:06Z"
  },
  {
    "title": "US judge temporarily blocks Trump's plans for mass layoffs of public workers",
    "description": "In an executive order in February, Trump called for a “critical transformation of the Federal bureaucracy” and directed agencies to cull workers who are not deemed essential.",
    "link": "https://www.thejournal.ie/us-judge-temporarily-blocks-trumps-plans-for-mass-layoffs-of-public-workers-6701395-May2025/",
    "timestamp": "2025-05-10T07:24:15Z"
  },
  {
    "title": "China's Consumption Slide Deepens As Tariff War Bites",
    "description": "China said Saturday that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington.",
    "link": "https://www.ibtimes.com/chinas-consumption-slide-deepens-tariff-war-bites-3773118",
    "timestamp": "2025-05-10T07:21:16Z"
  },
  {
    "title": "China’s consumption slide deepens as tariff war bites",
    "description": "China said Saturday that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington. The world’s second-largest ec…",
    "link": "https://www.digitaljournal.com/world/chinas-consumption-slide-deepens-as-tariff-war-bites/article",
    "timestamp": "2025-05-10T07:17:32Z"
  },
  {
    "title": "Putin ‘doing whatever possible’ for Ukraine peace – Kremlin",
    "description": "The Kremlin hopes US President Donald Trump will help bring more “wisdom” in discussions with Ukraine, spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617272-putin-doing-whatever-possible-ukraine-peace/",
    "timestamp": "2025-05-10T07:07:12Z"
  },
  {
    "title": "As US, China begin trade talks in Geneva, Trump's tariff hammer looks less mighty than he claims",
    "description": "Amidst a tense trade war, the U.S. and China are set to engage in preliminary talks in Geneva, though prospects for a swift resolution remain uncertain. Despite Trump's confidence in tariffs, China has retaliated, showing a willingness to withstand economic p…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/as-us-china-begin-trade-talks-in-geneva-trumps-tariff-hammer-looks-less-mighty-than-he-claims/articleshow/121051997.cms",
    "timestamp": "2025-05-10T07:01:30Z"
  },
  {
    "title": "Arab countries hope for big US business amid unresolved Gaza war",
    "description": "US President Trump visits Saudi Arabia, Qatar and the United Arab Emirates from May 13-16. Much is at stake for the US and regional leaders seeking to boost ties while walking a tightrope over Gaza, Israel and Iran.",
    "link": "https://www.dw.com/en/arab-countries-hope-for-big-us-business-amid-unresolved-gaza-war/a-72489255",
    "timestamp": "2025-05-10T06:53:00Z"
  },
  {
    "title": "Arab countries hope for big US business amid Gaza war",
    "description": "US President Trump visits Saudi Arabia, Qatar and the United Arab Emirates from May 13-16. Much is at stake for the US and regional leaders seeking to boost ties while walking a tightrope over Gaza, Israel and Iran.",
    "link": "https://www.dw.com/en/arab-countries-hope-for-big-us-business-amid-gaza-war/a-72489255",
    "timestamp": "2025-05-10T06:53:00Z"
  },
  {
    "title": "Yle investigation into TikTok data centre raises security concerns",
    "description": "Over the past year, the Finnish project quietly became a joint venture between Chinese investors and a Dubai billionaire.",
    "link": "https://yle.fi/a/74-20160971",
    "timestamp": "2025-05-10T06:52:03Z"
  },
  {
    "title": "China expresses concern, offers help to resolve India-Pakistan conflict",
    "description": "BEIJING: China expressed \"deep concern\" on Saturday (May 10) over the escalating situation between India and Pakistan and offered to play a constructive role in resolving the matter, according to a statem",
    "link": "https://www.channelnewsasia.com/asia/china-expresses-concern-offers-help-resolve-india-pakistan-conflict-5121441",
    "timestamp": "2025-05-10T06:46:32Z"
  },
  {
    "title": "Mexico sues Google for changing ‘Gulf of Mexico’ to ‘Gulf of America’ after Trump’s order",
    "description": "Trump signed an order on his first day back in the White House in January to rename the northern part of the gulf to the Gulf of America.",
    "link": "https://nypost.com/2025/05/10/us-news/mexico-sues-google-for-changing-gulf-of-mexico-to-gulf-of-america-after-trump-executive-order/",
    "timestamp": "2025-05-10T06:46:04Z"
  },
  {
    "title": "Donald Trump's surprising message sends stocks surging",
    "description": "",
    "link": "https://biztoc.com/x/2061ebdbb138fb81",
    "timestamp": "2025-05-10T06:40:05Z"
  },
  {
    "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
    "description": "The Trump administration must halt much of its dramatic downsizing of the federal workforce, a California judge ordered Friday. Judge Susan Illston in San Francisco issued the emergency order in a lawsuit filed last week by labor unions and cities, one of mul…",
    "link": "https://japantoday.com/category/world/judge-pauses-much-of-trump-administration%27s-massive-downsizing-of-federal-agencies",
    "timestamp": "2025-05-10T06:33:05Z"
  },
  {
    "title": "US judge temporarily blocks Trump plans for mass layoffs",
    "description": "A U.S. judge has temporarily blocked federal agencies from proceeding with mass layoffs of government workers ordered by President Trump, citing the need for Congressional approval. Judge Susan Illston issued a two-week pause, stating the administration's wor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-judge-temporarily-blocks-trump-plans-for-mass-layoffs/articleshow/121051326.cms",
    "timestamp": "2025-05-10T06:29:43Z"
  },
  {
    "title": "Whiplash reversals mean Trump’s erratic trade policy is as clear as mud",
    "description": "The specifics of the administration’s economic masterplan – from strollers to movies to China – change by the day\nDecades of economic orthodoxy failed millions of Americans, according to Donald Trump, who marched back into the White House promising to shred t…",
    "link": "https://biztoc.com/x/8f075275913cba78",
    "timestamp": "2025-05-10T06:17:41Z"
  },
  {
    "title": "Swedish cardinal hails Pope Leo, takes dig at Trump",
    "description": "Swedish Cardinal Anders Arborelius, who took part in the conclave to elect the Catholic Church's new pope, hailed Leo XIV on Friday as \"gentle and humble\" -- and very \"unlike\" US President Donald Trump.",
    "link": "https://www.thelocal.se/20250510/swedish-cardinal-hails-pope-leo-takes-dig-at-trump",
    "timestamp": "2025-05-10T06:09:49Z"
  },
  {
    "title": "How US-China tariffs reached sky-high levels in 3 months",
    "description": "US and China are set to meet in Switzerland for trade talks. This follows months of increasing tariffs between the two nations. These tariffs have negatively impacted exporters and economies. The US has tariffs of 145% on Chinese goods. China's tariffs on US …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-us-china-tariffs-reached-sky-high-levels-in-3-months/articleshow/121050851.cms",
    "timestamp": "2025-05-10T06:05:11Z"
  },
  {
    "title": "\"India's Approach Always Responsible, Remains So\", S Jaishankar Tells US",
    "description": "A senior US official and a close aide of President Donald Trump has highlighted the need for de-escalating the situation between India and Pakistan.",
    "link": "https://www.ndtv.com/india-news/us-tells-s-jaishankar-india-pak-should-identify-methods-to-de-escalate-8377956",
    "timestamp": "2025-05-10T06:02:19Z"
  },
  {
    "title": "European leaders arrive in Kyiv in show of solidarity against Russia",
    "description": "The leaders of France, Britain and Germany arrived in Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire the day after a lavish military parade in Moscow.",
    "link": "https://www.thelocal.com/20250510/european-leaders-arrive-in-kyiv-in-show-of-solidarity-against-russia",
    "timestamp": "2025-05-10T06:00:41Z"
  },
  {
    "title": "Nicole Shanahan exposes RFK Jr.â\u0080\u0099s â\u0080\u0098Broken Promiseâ\u0080\u0099 â\u0080\u0093 Claims Surgeon General Pick Casey Means is a â\u0080\u0098Manchurian Assetâ\u0080\u0099 in shocking allegation",
    "description": "The health freedom movement is in turmoil as Shanahan accuses Kennedy of deception and shadowy control — while Dr. Robert Malone defends Kennedy’s Surgeon General nominee – Casey Means – amid vaccine silence controversy. In fact, Nicole Shanahan had some toug…",
    "link": "https://www.naturalnews.com/2025-05-10-nicole-shanahan-exposes-rfkjr-broken-promise.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Virologist who endorsed HCQ for COVID-19 appointed to top pandemic post at HHS",
    "description": "Steven J. Hatfill, a former White House COVID-19 advisor under Trump and advocate for hydroxychloroquine (HCQ) as an early COVID-19 treatment, has been appointed as a special adviser to the HHS’ Administration for Strategic Preparedness and Response (ASPR). H…",
    "link": "https://www.naturalnews.com/2025-05-10-virologist-hcq-covid-appointed-top-pandemic-post.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Kentucky Rep. Comer warns: Epstein files may have been DESTROYED amid delays with DOJ release of documents",
    "description": "Rep. James Comer (R-KY) warns that critical Epstein files may have been destroyed by the DOJ or FBI, suggesting a deliberate coverup to conceal ties between Epstein’s network and powerful figures, including potential government involvement. Despite orders to …",
    "link": "https://www.naturalnews.com/2025-05-10-comer-epstein-files-possibly-destroyed-doj-delays.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "EU goes on offense to retain firms and counter Trump’s tariffs",
    "description": "(Bloomberg) -- he European Union is planning to counter President Donald Trump’s efforts to lure companies to the US by easing the bloc’s regulatory burden...",
    "link": "https://finance.yahoo.com/news/eu-goes-offense-retain-firms-060000243.html",
    "timestamp": "2025-05-10T06:00:00Z"
  },
  {
    "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
    "description": "A California judge has ordered the Trump administration to halt much of its massive downsizing of the federal workforce",
    "link": "https://abcnews.go.com/US/wireStory/judge-pauses-trump-administrations-massive-downsizing-federal-agencies-121660969",
    "timestamp": "2025-05-10T05:58:24Z"
  },
  {
    "title": "Grapevine: Big deal",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-853176",
    "timestamp": "2025-05-10T05:56:05Z"
  },
  {
    "title": "Ukraine: Merz, Macron, Starmer and Tusk in Kyiv",
    "description": "The leaders of Germany, France, the UK and Poland are in Kyiv to meet President Volodymyr Zelenskzy. DW has the latest. The leaders of Britain, France, Germany arrived in Kyiv on a visit showing solidarity with Ukraine \nGerman Chancellor Friedrich Merz France…",
    "link": "https://www.dw.com/en/ukraine-merz-macron-starmer-and-tusk-in-kyiv/live-72497759",
    "timestamp": "2025-05-10T05:53:00Z"
  },
  {
    "title": "Elon Musk reignites feud with Sam Altman over past Trump remarks",
    "description": "Elon Musk, a cofounder-turned-critic of OpenAI, sued the company last year, alleging it had strayed from its mission of serving the public interest. On May 4, OpenAI reaffirmed that it would stay under nonprofit control, shelving earlier plans to convert into…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/elon-musk-reignites-feud-with-sam-altman-over-past-trump-remarks/articleshow/121050422.cms",
    "timestamp": "2025-05-10T05:43:13Z"
  },
  {
    "title": "Macron, Merz, Starmers and Tusk in Kiev for a teleconference of the coalition of the willing – Mitsotakis will also participate",
    "description": "The US Embassy in Ukraine warns of a strike on Kiev in the coming days\nThe post Macron, Merz, Starmers and Tusk in Kiev for a teleconference of the coalition of the willing – Mitsotakis will also participate appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/05/10/macron-merz-starmers-and-tusk-in-kiev-for-a-teleconference-of-the-coalition-of-the-willing-mitsotakis-will-also-participate/",
    "timestamp": "2025-05-10T05:40:28Z"
  },
  {
    "title": "Former ambassador Herzog: Biden backed Israel during war, but key officials were ‘hostile’",
    "description": "Herzog also discussed Gaza's day after, the Iran nuclear issue, and the hostages still held by Hamas.",
    "link": "https://www.jpost.com/israel-news/article-853399",
    "timestamp": "2025-05-10T05:37:34Z"
  },
  {
    "title": "Qataris search for bodies of Americans killed by Islamic State in Syria ahead of Trump visit",
    "description": "While the sources did tell Reuters whose remains the Qataris were searching for, it is believed that the bodies of two journalists and one aid worker are being recovered.",
    "link": "https://www.jpost.com/middle-east/article-853398",
    "timestamp": "2025-05-10T05:24:31Z"
  },
  {
    "title": "Mexico sues Google for changing 'Gulf of Mexico' to 'Gulf of America' after Trump's order",
    "description": "Mexico has sued Google after it changed the label for the Gulf of Mexico to the Gulf of America on its maps platform to match U.S. President Donald Trump's executive order.",
    "link": "https://www.foxnews.com/politics/mexico-sues-google-changing-gulf-mexico-gulf-america-after-trumps-order",
    "timestamp": "2025-05-10T05:18:40Z"
  },
  {
    "title": "Hegseth Warns Migrants Crossing into Pentagon's Border Zone: 'You Will Be Charged'",
    "description": "Secretary of Defense Pete Hegseth issued a warning to illegal aliens thinking of crossing into the United States through land controlled by the U.S. military, telling them they \"will be charged.\"\nThe post Hegseth Warns Migrants Crossing into Pentagon’s Border…",
    "link": "https://www.breitbart.com/immigration/2025/05/09/hegseth-warns-migrants-crossing-pentagon-border-zone-charged/",
    "timestamp": "2025-05-10T05:13:29Z"
  },
  {
    "title": "US, Chinese officials to meet in Geneva to discuss tariffs, as the world looks for signs of hope",
    "description": "Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng",
    "link": "https://www.thehindubusinessline.com/news/world/us-chinese-officials-to-meet-in-geneva-to-discuss-tariffs-as-the-world-looks-for-signs-of-hope/article69560067.ece",
    "timestamp": "2025-05-10T05:08:05Z"
  },
  {
    "title": "India, Pakistan move closer to full war",
    "description": "ISLAMABAD &mdash; Pakistan's army said it struck several Indian military sites early Saturday in retaliation for missile strikes on airbases, a significant escalation that moves the two nuclear-armed neighbours closer to all-out war.",
    "link": "https://www.bangkokpost.com/world/3022257/india-and-pakistan-move-closer-to-full-war-after-bases-targeted",
    "timestamp": "2025-05-10T05:08:00Z"
  },
  {
    "title": "Irish-founded Tullow Oil faces $1.4bn refinancing headache amid falling crude prices",
    "description": "Shares in the exploration firm have slumped and are being sold off at rates not seen in five years",
    "link": "https://www.irishtimes.com/business/2025/05/10/tullow-oil-gas-falling-prices/",
    "timestamp": "2025-05-10T05:00:01Z"
  },
  {
    "title": "Never mind the new pope, who’s going to replace Liveline’s spiritual leader, Joe Duffy?",
    "description": "Michael McDowell coy at book launch, Bertie gives state-of-the-world address and Mark Daly feels the heat",
    "link": "https://www.irishtimes.com/politics/2025/05/10/miriam-lords-week-never-mind-the-new-pope-whos-going-to-replace-livelines-spiritual-leader-joe-duffy/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "What does the latest round of EU retaliatory tariffs mean for Ireland?",
    "description": "Getting caught in US-EU trade dispute would ‘definitely curtail our expansion plans’ says Irish seafood firm",
    "link": "https://www.irishtimes.com/politics/2025/05/10/what-does-the-latest-round-of-eu-retaliatory-tariffs-mean-for-ireland/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "‘Be prepared’: Home Depot worker issues warning about new changes to the car industry",
    "description": "Earlier this year, President Donald Trump announced a sweeping array of tariffs on every country on Earth. While many of these tariffs have since been halted, there is still a baseline 10% tariff on every country, with goods from China receiving a significant…",
    "link": "https://www.dailydot.com/news/home-depot-worker-car-industry/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/Business/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646128",
    "timestamp": "2025-05-10T04:54:23Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/US/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646126",
    "timestamp": "2025-05-10T04:54:22Z"
  },
  {
    "title": "How US-China tariffs reached sky-high levels in 3 months",
    "description": "Talks planned this weekend between U.S. and Chinese officials in Switzerland are a culmination of more than three months of dizzying rounds of retaliatory tariffs between the two countries that have crippled each other’s exporters and dragged on their economi…",
    "link": "https://www.seattlepi.com/news/world/article/how-us-china-tariffs-reached-sky-high-levels-in-3-20320396.php",
    "timestamp": "2025-05-10T04:53:25Z"
  },
  {
    "title": "Trade deal platform for going further - Mandelson",
    "description": "The UK ambassador to the US spoke to BBC Newsnight in his first broadcast interview since appointment.",
    "link": "https://www.bbc.com/news/articles/cn5yzw24v9ro",
    "timestamp": "2025-05-10T04:49:17Z"
  },
  {
    "title": "Mayor of Newark, New Jersey, released after arrest at immigration detention center",
    "description": "The mayor of Newark, New Jersey, has been released from custody after being arrested at a federal immigration detention center where he has been protesting its opening this week",
    "link": "https://abcnews.go.com/US/wireStory/mayor-newark-new-jersey-released-after-arrest-immigration-121663382",
    "timestamp": "2025-05-10T04:46:29Z"
  },
  {
    "title": "US and Chinese officials meet in Geneva to discuss tariffs",
    "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the g...",
    "link": "https://abcnews.go.com/International/wireStory/us-chinese-officials-meet-geneva-discuss-tariffs-world-121663197",
    "timestamp": "2025-05-10T04:43:19Z"
  },
  {
    "title": "Lea Michele explains why internet theory about her reading skills is so ‘frustrating’",
    "description": "The actor’s ability to read and write has been a source of internet humour since 2017",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/lea-michele-interview-cant-read-internet-theory-b2748384.html",
    "timestamp": "2025-05-10T04:41:55Z"
  },
  {
    "title": "Trump involved in discussions over suspending habeas corpus, sources say (CNN)",
    "description": "CNN:\nTrump involved in discussions over suspending habeas corpus, sources say  —  President Donald Trump has been personally involved in discussions inside the administration over potentially suspending habeas corpus, a legal procedure that allows people to c…",
    "link": "https://www.memeorandum.com/250510/p2",
    "timestamp": "2025-05-10T04:40:01Z"
  },
  {
    "title": "De minimis changes: 'I freaked out and spent $400 online'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/0090198c1871b2bf",
    "timestamp": "2025-05-10T04:38:31Z"
  },
  {
    "title": "US-China trade talk optimism drives oil prices to weekly gains",
    "description": "Oil prices surged nearly 2% on Friday, marking their first weekly gain since mid-April, fueled by optimism surrounding a U.S.-UK trade agreement and upcoming U.S.-China talks. Brent crude settled at $63.91 a barrel, while WTI reached $61.02, both benchmarks u…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/us-china-trade-talk-optimism-drives-oil-prices-to-weekly-gains/articleshow/121048611.cms",
    "timestamp": "2025-05-10T04:36:45Z"
  },
  {
    "title": "US dollar makes weekly gains on renewed trade deal optimism",
    "description": "The dollar is poised for a weekly gain against major currencies amid optimism surrounding potential U.S.-China trade talks, fueled by a recent U.S.-UK trade agreement. While the Federal Reserve held rates steady, the Bank of England cut them. Bitcoin's resurg…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-makes-weekly-gains-on-renewed-trade-deal-optimism/articleshow/121048496.cms",
    "timestamp": "2025-05-10T04:32:46Z"
  },
  {
    "title": "China's consumption slide deepens as tariff war bites",
    "description": "BEIJING: China said on Saturday (May 10) that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington. The worl…",
    "link": "https://www.channelnewsasia.com/east-asia/chinas-consumption-slide-deepens-tariff-war-bites-5121326",
    "timestamp": "2025-05-10T04:30:57Z"
  },
  {
    "title": "Gold edges higher on softer dollar ahead of key US-China trade talks",
    "description": "Gold prices surged over 1% on Friday, buoyed by a weaker dollar and market anticipation surrounding U.S.-China trade talks. Spot gold reached $3,340.29 an ounce, marking a 3.1% weekly gain and a 27% rise year-to-date. Trump's tariff comments and geopolitical …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-on-softer-dollar-ahead-of-key-us-china-trade-talks/articleshow/121048418.cms",
    "timestamp": "2025-05-10T04:29:19Z"
  },
  {
    "title": "Europe leaders head to Kiev on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire.",
    "link": "https://www.hurriyetdailynews.com/europe-leaders-head-to-kiev-on-unprecedented-visit-209014",
    "timestamp": "2025-05-10T04:29:00Z"
  },
  {
    "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/1f7d933dd6524d56",
    "timestamp": "2025-05-10T04:26:59Z"
  },
  {
    "title": "Europe's Stoxx up marginally, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-up-marginally-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Europe's Stoxx jumps 600 points, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-jumps-600-points-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Live updates: Pakistan and India agree to ceasefire; Trump makes the surprise announcement",
    "description": "US President Donald Trump made a surprise announcement that Pakistan and India have agreed to a ceasefire after their conflict escalated further overnight. Top Pakistani and Indian officials have confirmed the halt in fighting. Follow for live updates.",
    "link": "https://www.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-10-25",
    "timestamp": "2025-05-10T04:26:23Z"
  },
  {
    "title": "New US envoy to Türkiye says he is 'eager' to 'building bridges'",
    "description": "New U.S. Ambassador to Türkiye Tom Barrack said Friday that he is “eager to get to work building bridges” with the Turkish people.",
    "link": "https://www.hurriyetdailynews.com/new-us-envoy-to-turkiye-says-he-is-eager-to-building-bridges-209013",
    "timestamp": "2025-05-10T04:25:01Z"
  },
  {
    "title": "Global stocks, Bitcoin rally on renewed trade deal hopes",
    "description": "Global stocks showed strength, nearing six-week highs. This followed a US-UK trade agreement, boosting hopes for tariff talks. India offered tariff cuts to the US, seeking exemptions. Germany's Dax hit a record high. The US-UK deal is seen as a positive sign …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-bitcoin-rally-on-renewed-trade-deal-hopes/articleshow/121048110.cms",
    "timestamp": "2025-05-10T04:19:16Z"
  },
  {
    "title": "When Politics Leaves Reality Behind",
    "description": "Sacramento (Special to Informed Comment; Feature) - The traditional left–right political spectrum no longer captures the forces driving division in America today. That model works when we’re dealing with competing ideologies and when ideological disagreement …",
    "link": "https://www.juancole.com/2025/05/politics-leaves-reality.html",
    "timestamp": "2025-05-10T04:15:18Z"
  },
  {
    "title": "Paschal Donohoe on How Feminist Economics Can Change Our World; Making Sense of Chaos; and Why We’re Getting Poorer",
    "description": "These authors seek to understand the behaviour of economies and the influence they have on our societies",
    "link": "https://www.irishtimes.com/culture/books/review/2025/05/10/books-in-brief-paschal-donohoe-on-how-feminist-economics-can-change-our-world-making-sense-of-chaos-and-why-were-getting-poorer/",
    "timestamp": "2025-05-10T04:15:00Z"
  }
]