[
  {
    "title": "Beware: Government Using Image Manipulation For Propaganda",
    "description": "U.S. Homeland Security Secretary Kristi Noem last week posted a photo of the arrest of Nekima Levy Armstrong, one of three activists who had entered a St. Paul, Minn. church to confront a pastor who also serves as acting field director of the St. Paul Immigra…",
    "link": "https://www.techdirt.com/2026/02/02/beware-government-using-image-manipulation-for-propaganda/",
    "timestamp": "2026-02-02T23:41:36Z"
  },
  {
    "title": "Donald Trump Says Kennedy Center Will Not Be Torn Down, But Major Work Will Be Done",
    "description": "A day after announcing the closure of the Kennedy Center for two years for renovations, Donald Trump told reporters that the plans would not be for “ripping it out.” But he signaled major changes to the complex, as he said. “I’ll be using the steel. So we’re …",
    "link": "http://deadline.com/2026/02/trump-kennedy-center-closure-1236706611/",
    "timestamp": "2026-02-02T23:38:24Z"
  },
  {
    "title": "Dan Bongino Walks Back Through the FBI-Podcaster Revolving Door",
    "description": "The bombastic right-wing media personality, who recently stepped down as deputy director of the federal agency, returned to his regular perch on Monday, offering his account of his role in the Epstein debacle before Donald Trump called in.",
    "link": "https://www.vanityfair.com/news/story/dan-bongino-podcasting-return",
    "timestamp": "2026-02-02T23:37:29Z"
  },
  {
    "title": "Simon Property Group Reports Q4 Gains Amid Continued Tariff Uncertainty",
    "description": "Mall giant Simon Property Group closed 2025 with fourth quarter growth, but continued to sound alarms about the potential negative effects of President Donald Trump’s tariff policy on the retail sector.  The Indianapolis-based real estate investment trust (RE…",
    "link": "http://commercialobserver.com/2026/02/simon-property-group-earnings-tariffs-trump/",
    "timestamp": "2026-02-02T23:37:26Z"
  },
  {
    "title": "Iran Protesters Include Mossad and MEK",
    "description": "Donald Trump has promoted the idea – amplified by much of the international media – that protesters inside Iran are calling for U.S. military intervention and the overthrow of their government. At the same time, Trump is threatening Iran with major military a…",
    "link": "https://original.antiwar.com/chris_ernesto/2026/02/02/iran-protesters-include-mossad-and-mek/",
    "timestamp": "2026-02-02T23:35:16Z"
  },
  {
    "title": "US judge halts Trump plan to end protections for 350,000 Haitians",
    "description": "By Nate RaymondFeb 2 (Reuters) - A federal judge on Monday blocked the Trump administration from revoking legal protections for more than 350,000 Haitians, preventing the… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/03/us-judge-halts-trump-plan-to-end-protections-for-350-000-haitians",
    "timestamp": "2026-02-02T23:34:14Z"
  },
  {
    "title": "Geoff Duncan broke with Trump. The former Republican wants Democrats to make him Georgia's governor",
    "description": "Georgia's Geoff Duncan was once a conservative Republican",
    "link": "https://abcnews.go.com/Politics/wireStory/geoff-duncan-broke-trump-former-republican-democrats-make-129788546",
    "timestamp": "2026-02-02T23:33:30Z"
  },
  {
    "title": "Who is Bad Bunny and how did he become a Grammy winner and Super Bowl headliner?",
    "description": "Yesterday, he made Grammys history, now he's heading to the Super Bowl. So who is he?",
    "link": "https://www.nzherald.co.nz/entertainment/who-is-bad-bunny-and-how-did-he-become-a-grammy-winner-and-super-bowl-headliner/V36FRKRXV5ETXCES2RPB4T4KY4/",
    "timestamp": "2026-02-02T23:32:15Z"
  },
  {
    "title": "New Study: Mental Health of Young People Took a Disturbing Turn After Trump Was Elected in 2016 - NewsBreak",
    "description": "For years, America’s college students were struggling. Then 2016 happened and everything got worse. A massive new peer-reviewed study tracking depression s",
    "link": "https://www.newsbreak.com/share/4473684043808-new-study-mental-health-of-young-people-took-a-disturbing-turn-after-trump-was-elected-in-2016?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NzAxMjkxNDIzOTM%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1770129142&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.4.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-02T23:30:28Z"
  },
  {
    "title": "Insider says Trump still wants Greenland and has a plan to claim it by 2029",
    "description": "Despite toning down his public rhetoric, President Donald Trump has not abandoned his long-standing fixation on absorbing Greenland into U.S. territory, according to an administration insider speaking to Zeteo. The official told reporter Asawin Suebsaeng that…",
    "link": "https://www.rawstory.com/greenland-2675069894/",
    "timestamp": "2026-02-02T23:30:01Z"
  },
  {
    "title": "Congressman Lloyd Smucker sues LNP | LancasterOnline claiming editorial defamed him",
    "description": "U.S. Rep. Lloyd Smucker has filed a defamation lawsuit against LNP Media Group, the publisher of LNP | LancasterOnline, claiming an editorial printed on Oct. 8 damaged his reputation; he is seeking more than $250,000 in damages.",
    "link": "https://lancasteronline.com/news/local/congressman-lloyd-smucker-sues-lnp-lancasteronline-claiming-editorial-defamed-him/article_61f74924-9c3a-4701-9151-96d8e3fc4301.html",
    "timestamp": "2026-02-02T23:30:00Z"
  },
  {
    "title": "“Trash kingpin,” Trump appointee Anthony Lomangino drops $77M on Palm Beach trophy estate",
    "description": "“Trash kingpin” and Trump appointee Anthony Lomangino bought a historic Palm Beach estate known as Villa Flora for $76.7 million in an off-market deal. Records show the seller is Sequel Capital’s Harvey Kinzelberg and his wife Mary Ann Kinzelberg. Lomangino a…",
    "link": "https://therealdeal.com/miami/2026/02/02/trash-kingpin-buys-77-million-palm-beach-trophy-estate/",
    "timestamp": "2026-02-02T23:30:00Z"
  },
  {
    "title": "Texas bruising sends Republicans a message they’d better take to heart",
    "description": "With or without Trump on the ballot, the GOP’s survival now depends on the coalition he pioneered.",
    "link": "https://nypost.com/2026/02/02/opinion/texas-bruising-sends-republicans-an-urgent-message/",
    "timestamp": "2026-02-02T23:27:59Z"
  },
  {
    "title": "Trump says DOJ should continue Fed Chair Powell probe 'to the end'",
    "description": "Sen. Thom Tillis said he would oppose any new Fed nominees until the Powell probe is resolved, the same day Trump announced Kevin Warsh as his Fed chair pick.",
    "link": "https://www.cnbc.com/2026/02/02/trump-powell-pirro-warsh-fed-tillis.html",
    "timestamp": "2026-02-02T23:24:20Z"
  },
  {
    "title": "Good Morning",
    "description": "Today’s AJ highlights: Having announced the shutdown of the Kennedy Center, Donald Trump fixates on his proposed 250-foot-tall triumphal arch overlooking the Potomac River, a scale that has alarmed architectural experts who originally expected a much smaller …",
    "link": "https://www.artsjournal.com/2026/02/good-morning-81.html",
    "timestamp": "2026-02-02T23:24:11Z"
  },
  {
    "title": "Body cameras being immediately issued to ICE agents in Minneapolis",
    "description": "Every U.S. Homeland Security officer on the ground in Minneapolis, including Immigration and Customs Enforcement officers, will be immediately issued body-worn cameras, Secretary Kristi Noem said Monday.",
    "link": "https://www.cbc.ca/news/world/minneapolis-agents-ice-body-worn-cameras-9.7071372",
    "timestamp": "2026-02-02T23:23:39Z"
  },
  {
    "title": "Mockery ignites as Trump 'attack dog' gets demoted at DOJ",
    "description": "President Donald Trump's \"attack dog\" in the Department of Justice was demoted on Monday, a move that attracted mockery online. Ed Martin, a lawyer who attended Trump's \"Stop the Steal\" protests before joining the administration, was demoted to pardon attorne…",
    "link": "https://www.rawstory.com/trump-doj-2675070604/",
    "timestamp": "2026-02-02T23:21:55Z"
  },
  {
    "title": "Fulton County expected to make new court filing challenging legality of FBI’s seizure of 2020 election records",
    "description": "An official in Fulton County, Georgia, has announced the county will challenge the legality of the FBI’s search and seizure of 2020 election records. Commissioner Marvin Arrington Jr. said the effort will seek to “force the government to return the ballots ta…",
    "link": "https://freerepublic.com/focus/f-news/4365184/posts",
    "timestamp": "2026-02-02T23:20:55Z"
  },
  {
    "title": "Trump slams Grammys on social media, calls it ‘unwatchable’ amid joke controversy",
    "description": "Trump slams Grammys on social media, calls it ‘unwatchable’ amid joke controversy7news.com.au",
    "link": "https://7news.com.au/news/trump-slams-grammys-on-social-media-calls-it-unwatchable-amid-joke-controversy-c-21509640",
    "timestamp": "2026-02-02T23:20:31Z"
  },
  {
    "title": "Report: Education Department’s “Efficiency” Layoffs Cost At Least $28 Million",
    "description": "The Education Department spent an estimated $28 to $38 million last year on attempted staff cuts last year at its Office of Civil Rights, according to a report from the US Government Accountability Office released Monday.  The department initiated a reduction…",
    "link": "https://www.motherjones.com/politics/2026/02/education-department-ocr-layoffs-doge-report/",
    "timestamp": "2026-02-02T23:16:39Z"
  },
  {
    "title": "Trump Claims He Wasn’t ‘Friendly With Jeffrey Epstein’ – But Once Said ‘He’s a Lot of Fun To Be With’",
    "description": "President Donald Trump said on Monday that he was never \"friendly with Jeffrey Epstein,\" despite previously saying the deceased sex trafficker was \"a lot of fun to be with.\"\nThe post Trump Claims He Wasn’t ‘Friendly With Jeffrey Epstein’ – But Once Said ‘He’s…",
    "link": "https://www.mediaite.com/politics/trump/trump-claims-he-wasnt-friendly-with-jeffrey-epstein-but-once-said-hes-a-lot-of-fun-to-be-with/",
    "timestamp": "2026-02-02T23:16:30Z"
  },
  {
    "title": "Democrats Who Condemned Lemon’s Arrest Silent on the Invasion of Cities Church",
    "description": "Democrats loudly condemned the arrest of former CNN host Don Lemon on Friday, but they have not condemned the invasion of a Minnesota church in... Read More\nThe post Democrats Who Condemned Lemon’s Arrest Silent on the Invasion of Cities Church appeared first…",
    "link": "https://www.dailysignal.com/2026/02/02/democrats-who-condemned-lemons-arrest-silent-invasion-cities-church/",
    "timestamp": "2026-02-02T23:15:00Z"
  },
  {
    "title": "At 90, Dalai Lama gets Grammy for audiobook ‘Meditations’",
    "description": "The Central Tibetan Administration (CTA), which is headquartered at McLeod Ganj in Dharamshala, said the award is a profound honour for Tibetan society. Although the Grammy spread cheer in this hill town, celebrations are on hold as the Dalai Lama is in Karna…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/at-90-dalai-lama-gets-grammy-for-audiobook-meditations/articleshow/127873326.cms",
    "timestamp": "2026-02-02T23:14:28Z"
  },
  {
    "title": "U.S. Applauds Ruling Against China Contracts at Panama Canal",
    "description": "U.S. Ambassador to Panama Kevin Cabrera over the weekend emphasized in an official statement that the recent ruling from Panama's Supreme Court nullifying two Canal port contracts awarded to a China-linked company strongly affirms the rule of law.\nThe post U.…",
    "link": "https://www.breitbart.com/latin-america/2026/02/02/u-s-applauds-ruling-against-china-contracts-at-panama-canal/",
    "timestamp": "2026-02-02T23:14:05Z"
  },
  {
    "title": "Cedric The Entertainer Drags Trump, Says He Dishes It Out But Can't Take It",
    "description": "Cedric the Entertainer isn’t staying quiet over Donald Trump’s freakout about Trevor Noah’s Epstein Island joke at last night's Grammys ... he's calling out the president for dishing out insults, but not being able to take them! TMZ caught up…\n Permalink",
    "link": "https://www.tmz.com/2026/02/02/cedric-the-entertainer-donald-trump-trevor-noah-grammys/",
    "timestamp": "2026-02-02T23:13:59Z"
  },
  {
    "title": "Trump says he won’t tear down the Kennedy Center arts venue but it needs to be closed for repairs",
    "description": "The Republican president said the work would cost about $200 million.",
    "link": "https://www.bostonherald.com/2026/02/02/trump-kennedy-center-no-teardown/",
    "timestamp": "2026-02-02T23:13:24Z"
  },
  {
    "title": "Factbox-Jeffrey Epstein’s ties to politicians, business titans and other figures",
    "description": "Feb 2 (Reuters) - The U.S. Justice Department’s release of millions of internal documents related to Jeffrey Epstein has revealed the late financier and sex offender’s ti… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/03/factbox-jeffrey-epstein-s-ties-to-politicians-business-titans-and-other-figures",
    "timestamp": "2026-02-02T23:12:54Z"
  },
  {
    "title": "Some Epstein survivors' identities appear unredacted in files released by DOJ",
    "description": "The Justice Department vowed to protect the identities of women who were preyed on by the late sex offender Jeffrey Epstein, but survivors said the latest release of Epstein files has left many of them exposed and their lives turned “upside down.”The DOJ did …",
    "link": "https://www.nbcnews.com/news/us-news/epstein-survivors-identities-appear-unredacted-files-released-doj-rcna257057",
    "timestamp": "2026-02-02T23:12:28Z"
  },
  {
    "title": "Popular left-wing podcast hosts push conspiracy theory that Trump staged assassination attempt on himself",
    "description": "Left-wing podcasters Jennifer Welch and Angie Sullivan said they believe Trump's assassination attempt was staged, with Welch quipping she was embracing \"BlueAnon\" conspiracies.",
    "link": "https://www.foxnews.com/media/popular-left-wing-podcast-hosts-push-conspiracy-theory-trump-staged-assassination-attempt-himself",
    "timestamp": "2026-02-02T23:11:48Z"
  },
  {
    "title": "House eyes Tuesday vote to reopen the government and end brief shutdown",
    "description": "The House plans to vote to end the government shutdown on Tuesday.",
    "link": "https://www.nbcnews.com/politics/congress/house-tuesday-vote-end-government-shutdown-reopen-trump-rcna256782",
    "timestamp": "2026-02-02T23:11:42Z"
  },
  {
    "title": "Democrats' diverging shutdown approaches: From the Politics Desk",
    "description": "Sahil Kapur explores the differing approaches to the government funding bill from the top two Democrats in Congress.",
    "link": "https://www.nbcnews.com/politics/politics-news/democrats-diverging-shutdown-approaches-politics-desk-rcna257128",
    "timestamp": "2026-02-02T23:10:31Z"
  },
  {
    "title": "Tennessee QB Joey Aguilar files lawsuit against NCAA seeking extra year of eligibility",
    "description": "Vols passer seeks a return to Knoxville this year.",
    "link": "https://www.sportingnews.com/us/ncaa-football/tennessee/news/tennessee-qb-joey-aguilar-files-lawsuit-against-ncaa-seeking-extra-year-eligibility/1c90407112d849148529b5dc",
    "timestamp": "2026-02-02T23:10:20Z"
  },
  {
    "title": "As Trump Doubles Down on Fossil Fuels, Courts Let Offshore Wind Projects Resume Construction",
    "description": "While President Donald Trump's administration on Monday again made its commitment to planet-wrecking fossil fuels clear, a Republican-appointed judge in Washington, DC dealt yet another blow to the Department of the Interior's attacks on offshore wind power.U…",
    "link": "https://www.commondreams.org/news/trump-wind",
    "timestamp": "2026-02-02T23:08:14Z"
  },
  {
    "title": "Takeaways from the many mentions of Trump in the Epstein files",
    "description": "Donald Trump's name appears many times in the Epstein files — including on an FBI list of men who are named as subjects of \"salacious information\". So what have we learned about the US president?",
    "link": "https://www.abc.net.au/news/2026-02-03/donald-trump-mentioned-in-epstein-files-thousands-of-times/106297878",
    "timestamp": "2026-02-02T23:07:30Z"
  },
  {
    "title": "House GOP Majority Barely Hanging On By Thread Following Democrat’s Swearing-In",
    "description": "House Speaker Mike Johnson’s razor-thin Republican majority is set to slim further following Democratic Texas Rep. Christian Menefee’s swearing-in Monday night, days after he won a Saturday special election. Menefee, a former Harris County Attorney, will repr…",
    "link": "https://dailycaller.com/2026/02/02/christian-menefee-swearing-in-texas-mike-johnson-democrats-republicans-majority/",
    "timestamp": "2026-02-02T23:01:49Z"
  },
  {
    "title": "Every Homeland Security officer in Minneapolis is getting a body-worn camera, Noem says",
    "description": "\"We will rapidly acquire and deploy body cameras to DHS law enforcement across the country,\" Secretary Kristi Noem said in a social media post.",
    "link": "https://www.pbs.org/newshour/politics/every-homeland-security-officer-in-minneapolis-is-getting-a-body-worn-camera-noem-says",
    "timestamp": "2026-02-02T23:01:02Z"
  },
  {
    "title": "Trump Thrashes ‘Lightweight’ Trevor Noah and Democrats ‘Pushing’ Epstein Claims in Oval Office Rant",
    "description": "President Trump doubled down on his plan to sue Trevor Noah after the comic joked about the president hanging out with Jeffrey Epstein while hosting the Grammys\nThe post Trump Thrashes ‘Lightweight’ Trevor Noah and Democrats ‘Pushing’ Epstein Claims in Oval O…",
    "link": "https://www.mediaite.com/politics/trump-thrashes-lightweight-trevor-noah-and-democrats-pushing-epstein-claims-in-oval-office-rant/",
    "timestamp": "2026-02-02T22:59:48Z"
  },
  {
    "title": "U.S. judge grants asylum to Chinese whistleblower who got scooped up in ICE raid",
    "description": "A Chinese whistleblower fled to the U.S. with footage of detention camps and requested asylum, only to be arrested by ICE agents and face deportation to Uganda. Now, five years after his saga began, his asylum claim has been granted.",
    "link": "https://www.cbc.ca/radio/asithappens/china-whistleblower-asylum-9.7071354",
    "timestamp": "2026-02-02T22:57:52Z"
  },
  {
    "title": "Erika Kirk and Turning Point USA Reveal Super Bowl Halftime Show Lineup; Kid Rock to …",
    "description": "Reading Time: 3 minutesWe now know who will headline Erika Kirk's All-American Halftime Show.\nErika Kirk and Turning Point USA Reveal Super Bowl Halftime Show Lineup; Kid Rock to … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/erika-kirk-and-turning-point-usa-reveal-super-bowl-halftime-show-lineup-kid-rock-to-headline/",
    "timestamp": "2026-02-02T22:56:16Z"
  },
  {
    "title": "Trump says Mexico will stop sending oil to energy-starved Cuba",
    "description": "Feb 2 (Reuters) - U.S. President Donald Trump ‌said on Monday that Mexico would stop sending oil to Cuba as he ramped ‌up a pressure campaign on the Caribbean nation. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/03/trump-says-mexico-will-stop-sending-oil-to-energy-starved-cuba",
    "timestamp": "2026-02-02T22:56:00Z"
  },
  {
    "title": "Country singer, Munhall native Gabby Barrett to perform at Turning Point USA's Super Bowl show",
    "description": "Country singer, Munhall native Gabby Barrett to perform at Turning Point USA's Super Bowl showwtae.com",
    "link": "https://www.wtae.com/article/munhall-native-gabby-barrett-turning-point-super-bowl-show/70227117",
    "timestamp": "2026-02-02T22:55:53Z"
  },
  {
    "title": "DHS Deploying Body Cameras To Minneapolis Federal Immigration Agents, Kristi Noem Says",
    "description": "Homeland Security (DHS) Secretary Kristi Noem announced Feb. 2 that all DHS officers in Minneapolis, Minnesota would be equipped with body cameras immediately.",
    "link": "https://dailycaller.com/2026/02/02/dhs-body-cameras-minneapolis-minnesota-illegal-immigration-alex-pretti/",
    "timestamp": "2026-02-02T22:54:44Z"
  },
  {
    "title": "Trump's 'mad man' threat sparks warnings of new 'five alarm fire': 'Saying the quiet part'",
    "description": "President Donald Trump stunned political analysts on Monday after he made a wild claim about the upcoming election during a podcast interview with his former FBI deputy director. Trump appeared Monday on \"The Dan Bongino Show,\" where he called on Republicans …",
    "link": "https://www.rawstory.com/trump-election-2675070515/",
    "timestamp": "2026-02-02T22:53:16Z"
  },
  {
    "title": "Kristi Noem orders immediate body camera deployment for Minneapolis federal officers after deadly shootings",
    "description": "DHS Secretary Kristi Noem announced immediate body camera deployment for all federal Minneapolis officers, with nationwide expansion planned as funding allows.",
    "link": "https://www.foxnews.com/politics/kristi-noem-orders-immediate-body-camera-deployment-minneapolis-federal-officers-after-deadly-shootings",
    "timestamp": "2026-02-02T22:52:08Z"
  },
  {
    "title": "Fox Host Sounds the Alarm On Trump ‘Telling Us That They’re Going to Meddle With the Election’",
    "description": "“He’s a mad man and is just straight up telling us that they’re going to meddle with the election.”\nThe post Fox Host Sounds the Alarm On Trump ‘Telling Us That They’re Going to Meddle With the Election’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fox-host-sounds-the-alarm-on-trump-telling-us-that-theyre-going-to-meddle-with-the-election/",
    "timestamp": "2026-02-02T22:49:55Z"
  },
  {
    "title": "Amid national backlash, Colorado lawmakers pledge more oversight, accountability for ICE agents",
    "description": "Senate Bill 5 would allow Coloradans to file lawsuits against federal authorities who violate a person’s constitutional rights during civil immigration enforcement activities.",
    "link": "https://www.denverpost.com/2026/02/02/colorado-lawmakers-immigration-ice/",
    "timestamp": "2026-02-02T22:49:19Z"
  },
  {
    "title": "Dan Bongino returns to podcasting with a defense of the FBI's handling of the Epstein files",
    "description": "Former FBI co-deputy director Dan Bongino made a fiery return to podcasting Monday, defending the agency's review of the Jeffrey Epstein case, attacking his critics and conducting an interview with President Donald Trump.\"It's been a crazy year,\" Bongino said…",
    "link": "https://www.nbcnews.com/politics/justice-department/dan-bongino-returns-podcasting-defense-fbi-handling-epstein-files-rcna257042",
    "timestamp": "2026-02-02T22:48:37Z"
  },
  {
    "title": "The Horrifying Truth Behind Liam Ramos’ Abduction",
    "description": "Liam’s family came here to seek asylum. They filed their asylum application as they were supposed to. They have gone to court.",
    "link": "https://slate.com/news-and-politics/2026/02/ice-news-liam-ramos-abduction-update.html",
    "timestamp": "2026-02-02T22:48:30Z"
  },
  {
    "title": "Pam Bondi's Epstein Meltdown: Attorney General Goes Off After She's Questioned for Redacting Trump's Name From Pedo's Files",
    "description": "Pam Bondi lost it when asked about redacting Donald Trump's name in the Epstein files, refusing to discuss it.",
    "link": "https://radaronline.com/p/pam-bondi-epstein-files-meltdown-over-donald-trump/",
    "timestamp": "2026-02-02T22:45:00Z"
  },
  {
    "title": "Victor Davis Hanson: Slouching Toward Fort Sumter?",
    "description": "In the months before the April 12, 1861, firing on Fort Sumter, there were lots of sharp divisions in the North about the proper reaction... Read More\nThe post Victor Davis Hanson: Slouching Toward Fort Sumter? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/02/02/victor-davis-hanson-slouching-toward-fort-sumter/",
    "timestamp": "2026-02-02T22:45:00Z"
  },
  {
    "title": "Democratic victory in deep-red Texas district casts a pall over GOP plans to keep the House",
    "description": "DALLAS — Democrat Taylor Rehmet may never get the chance to cast a vote from his new seat in the Texas state Senate.",
    "link": "https://www.nbcnews.com/politics/2026-election/democratic-victory-deep-red-texas-district-casts-pall-gop-plans-keep-h-rcna257060",
    "timestamp": "2026-02-02T22:39:45Z"
  },
  {
    "title": "Trump Dodges When Asked About Bombshell WSJ Report on ‘Secret’ Foreign Investment",
    "description": "“Well, I don't know about it. I know that crypto is a big thing and they like it. A lot of people like it, the people behind me like it.\"\nThe post Trump Dodges When Asked About Bombshell WSJ Report on ‘Secret’ Foreign Investment first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-dodges-when-asked-about-bombshell-wsj-report-on-secret-foreign-investment/",
    "timestamp": "2026-02-02T22:39:38Z"
  },
  {
    "title": "GOP Leaders Try to Put Down Rebellion to End Shutdown",
    "description": "“The three most powerful Republicans in Washington are trying to tamp down a GOP rebellion in the House in order to end the government shutdown that began Friday night,” Punchbowl News reports. “President Donald Trump, Speaker Mike Johnson and Senate Majority…",
    "link": "https://politicalwire.com/2026/02/02/gop-leaders-try-to-put-down-rebellion-to-end-shutdown/",
    "timestamp": "2026-02-02T22:39:15Z"
  },
  {
    "title": "An uneasy détente: Trump and Colombia's Petro to meet at White House",
    "description": "Donald Trump and Gustavo Petro share little in common — except a talent for confrontation. Their meeting at the White House on Tuesday could reshape U.S.–Colombia relations.",
    "link": "https://www.npr.org/2026/02/02/nx-s1-5693039/petro-trump-colombia-white-house",
    "timestamp": "2026-02-02T22:38:52Z"
  },
  {
    "title": "Israel demands Hamas disarmament, but no international force is in Gaza to enforce it",
    "description": "As representatives of 28 countries oversee Israel's actions in Gaza, IDF officials fear Israel's security has become secondary to Trump's cease-fire plan, and Israeli defense officials fear Hamas will fool the world into only partially disarming",
    "link": "https://www.haaretz.com/israel-news/israel-security/2026-02-03/ty-article/.premium/israel-demands-hamas-disarmament-but-no-international-force-is-in-gaza-to-enforce-it/0000019c-1fa4-d6ed-affe-dfb4e55a0000",
    "timestamp": "2026-02-02T22:38:23Z"
  },
  {
    "title": "Why has the price of bitcoin plummeted? Experts explain",
    "description": "Why has the price of bitcoin plummeted? Experts explaingo.com",
    "link": "https://abcnews.go.com/Business/price-bitcoin-plummeted-experts-explain/story?id=129778940",
    "timestamp": "2026-02-02T22:37:00Z"
  },
  {
    "title": "Trump: India Agrees to Stop Buying Russian Oil, Enter Trade Deal with U.S.",
    "description": "President Donald Trump announced Monday that the United States and India have reached a trade agreement and that India has committed to stop buying Russian oil. \nThe post Trump: India Agrees to Stop Buying Russian Oil, Enter Trade Deal with U.S. appeared firs…",
    "link": "https://www.breitbart.com/politics/2026/02/02/trump-india-agrees-to-stop-buying-russian-oil-enter-trade-deal-with-u-s/",
    "timestamp": "2026-02-02T22:36:11Z"
  },
  {
    "title": "Maria Shriver Believes Kennedy Center Closure Tied to Artist Cancellations",
    "description": "Donald Trump says the venue is closing for two years for renovations.\nMaria Shriver Believes Kennedy Center Closure Tied to Artist Cancellations\nAlex Young",
    "link": "https://consequence.net/2026/02/maria-shiver-kennedy-center-closure-artist-cancellations/",
    "timestamp": "2026-02-02T22:34:39Z"
  },
  {
    "title": "Turning Point USA Announces Lineup for Rival Super Bowl Halftime Show",
    "description": "DAILY CALLER NEWS FOUNDATION—Turning Point USA (TPUSA) announced the lineup for their “All American Halftime Show” on Monday to rival Puerto Rican rapper Bad Bunny’s... Read More\nThe post Turning Point USA Announces Lineup for Rival Super Bowl Halftime Show a…",
    "link": "https://www.dailysignal.com/2026/02/02/turning-point-usa-announces-lineup-for-rival-super-bowl-halftime-show/",
    "timestamp": "2026-02-02T22:30:00Z"
  },
  {
    "title": "Pro-Trump influencer who praised immigration crackdown detained by federal agents",
    "description": "A right-wing Brazilian influencer who publicly applauded President Donald Trump’s immigration crackdown has now found himself caught up in it. Júnior Pena, a social media personality with hundreds of thousands of followers, recently praised Trump and falsely …",
    "link": "https://www.rawstory.com/influencer/",
    "timestamp": "2026-02-02T22:29:02Z"
  },
  {
    "title": "Trump's 'flamethrower' attack on House Republican's new wife backfires after flub",
    "description": "President Donald Trump attempted to hurl an attack on a rebel Republican foe on Monday, but his accusation was actually incorrect.Trump was complaining about Rep. Thomas Massie (R-KY), a vocal critic of Trump, and his new wife in an accusation and was called …",
    "link": "https://www.rawstory.com/donald-trump-thomas-massie-2675070487/",
    "timestamp": "2026-02-02T22:28:34Z"
  },
  {
    "title": "Is a new US-Russia arms race about to begin?",
    "description": "Barring a major unforeseen announcement from Washington or Moscow, the last remaining nuclear arms control treaty between the United States and Russia will expire on Wednesday. It’s been a long, slow death for the New Strategic Arms Reduction Treaty (New STAR…",
    "link": "https://www.vox.com/politics/477637/is-a-new-us-russia-arms-race-about-to-begin",
    "timestamp": "2026-02-02T22:23:50Z"
  },
  {
    "title": "Trump Dodges When Asked About Bombshell WSJ Report on 'Secret' Foreign Investment",
    "description": "President Donald Trump was asked on Monday in the Oval Office to react to a recent report from the Wall Street Journal that a crypto company owned by him and...",
    "link": "https://www.yahoo.com/news/videos/trump-dodges-asked-bombshell-wsj-222207972.html",
    "timestamp": "2026-02-02T22:22:07Z"
  },
  {
    "title": "DHS Sec Noem Announces Body Cams Will Be Deployed ‘Immediately’ to All Agents in Minneapolis — Rolling Out Nationwide Soon",
    "description": "Department of Homeland Security Kristi Noem announced Monday that body cameras would be deployed to all federal agents under her agency who were in Minneapolis.\nThe post DHS Sec Noem Announces Body Cams Will Be Deployed ‘Immediately’ to All Agents in Minneapo…",
    "link": "https://www.mediaite.com/media/news/dhs-sec-noem-announces-body-cams-will-be-deployed-immediately-to-all-agents-in-minneapolis-rolling-out-nationwide-soon/",
    "timestamp": "2026-02-02T22:19:05Z"
  },
  {
    "title": "Trump Quizzed On His Plans to Shutter the Kennedy Center for 2 Years — Says ‘I’m Not Ripping it Out’",
    "description": "Donald Trump teased some details Monday on his plans for The Kennedy Center renovations that he says will require him to shutter the it for two years.\nThe post Trump Quizzed On His Plans to Shutter the Kennedy Center for 2 Years — Says ‘I’m Not Ripping it Out…",
    "link": "https://www.mediaite.com/media/news/trump-quizzed-on-his-plans-to-shutter-the-kennedy-center-for-2-years-says-im-not-ripping-it-out/",
    "timestamp": "2026-02-02T22:18:46Z"
  },
  {
    "title": "3 million new Epstein files, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: We have a new tranche of documents from the Epstein fi…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/477518/epstein-files-new-release-trump-bannon-lutnick-musk-emails-explained",
    "timestamp": "2026-02-02T22:18:35Z"
  },
  {
    "title": "List of Bravo stars named in Epstein files",
    "description": "Some Bravo stars appeared to have a social relationship with Epstein and one was on a “wish list“ sent to Ghislaine Maxwell.",
    "link": "https://www.newsweek.com/entertainment/celebrity-news/bravo-stars-jeffrey-epstein-caroline-stanbury-whitney-sudler-smith-carole-radziwill-11452379",
    "timestamp": "2026-02-02T22:15:34Z"
  },
  {
    "title": "DOJ removes Ed Martin from Trump admin's Weaponization Working Group amid increased activity",
    "description": "Ed Martin was removed from the Justice Department's Weaponization Working Group despite the panel meeting more frequently. He will continue as a pardon attorney for President Trump.",
    "link": "https://www.foxnews.com/politics/doj-removes-ed-martin-from-trump-admins-weaponization-working-group-amid-increased-activity",
    "timestamp": "2026-02-02T22:15:13Z"
  },
  {
    "title": "Alex Pretti: Judge wipes away order requiring feds to preserve evidence gathered from shooting scene | CNN Politics",
    "description": "A Minnesota judge has wiped away an order he issued last month that required federal investigators to preserve evidence gathered at the scene of Alex Pretti’s fatal shooting by immigration officers.",
    "link": "https://www.cnn.com/2026/02/02/politics/alex-pretti-evidence-order",
    "timestamp": "2026-02-02T22:14:40Z"
  },
  {
    "title": "The Death of the Doomsday Clock",
    "description": "For the last few years, the rollout of the clock on the Bulletin of the Atomic Scientists has been a flop. This year was the worst. People on my Bluesky timeline didn’t know what it meant, or worse, mocked it. What does a change of 4 seconds mean on a base of…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/the-death-of-the-doomsday-clock",
    "timestamp": "2026-02-02T22:12:41Z"
  },
  {
    "title": "2 days left to comment on DOT’s plan to hike US fuel costs by $23B",
    "description": "In December, the US Department of Transportation proposed a plan to make cars less efficient when Americans are already paying record-high energy bills during an affordability crisis fueled by tariff-driven inflation. That plan is still up for public comment,…",
    "link": "http://electrek.co/2026/02/02/2-days-left-to-comment-on-dots-plan-to-hike-us-fuel-costs-by-23b/",
    "timestamp": "2026-02-02T22:10:06Z"
  },
  {
    "title": "Every Homeland Security officer in Minneapolis now being issued body-worn camera, Noem says",
    "description": "Every Homeland Security officer on the ground, including Immigration and Customs Enforcement officers, will be immediately issued body-worn cameras, Secretary Kristi Noem said Monday. Noem made the announcement on the social media platform X. She said the bod…",
    "link": "https://japantoday.com/category/world/every-homeland-security-officer-in-minneapolis-is-now-being-issued-a-body-worn-camera-noem-says",
    "timestamp": "2026-02-02T22:08:30Z"
  },
  {
    "title": "Three issues that could sink Trump",
    "description": "This story appeared in Today, Explained, a daily newsletter that helps you understand the most compelling news and stories of the day. Subscribe here. Over the weekend, the Justice Department released yet another tranche of files from its investigation of Jef…",
    "link": "https://www.vox.com/today-explained-newsletter/477622/immigration-epstein-affordability-trump-polling",
    "timestamp": "2026-02-02T22:05:34Z"
  },
  {
    "title": "NBC’s Savannah Guthrie to skip 2026 Winter Olympics with mom missing",
    "description": "The 2026 Winter Olympics are set to kick off on Friday, February 6, with the Opening Ceremony for the Milano Cortina Games in Italy, but there will be a noticeable absence. NBC's Savannah Guthrie, who hosts TODAY, has reportedly pulled out of the broadcast as…",
    "link": "https://www.thebiglead.com/nbc-savannah-guthrie-skip-2026-winter-olympics-with-mom-missing/",
    "timestamp": "2026-02-02T22:04:47Z"
  },
  {
    "title": "Trump Unveils $12 Billion Mineral Reserve With Record Ex-Im Loan",
    "description": "President Donald Trump formally announced plans to launch a $12 billion critical minerals stockpile, in his latest effort to aid manufacturers while minimizing reliance on Chinese rare earths.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-unveils-12-billion-mineral-reserve-with-record-ex-im-loan",
    "timestamp": "2026-02-02T22:04:26Z"
  },
  {
    "title": "Trump, Modi Reach Long-Awaited U.S.-India Trade Deal",
    "description": "New Delhi has vowed to stop purchasing Russian oil in exchange for reduced U.S. tariffs.",
    "link": "http://foreignpolicy.com/2026/02/02/us-india-trade-deal-trump-modi-tariffs-russia-oil-european-union/",
    "timestamp": "2026-02-02T22:04:17Z"
  },
  {
    "title": "Trump: We have big ships heading there, we have talks going with them",
    "description": "Trump reiterates that major US forces are heading toward Iran as Washington continues talks, warning that while a deal is possible, failure could lead to “bad things.\"",
    "link": "https://www.israelnationalnews.com/news/421867",
    "timestamp": "2026-02-02T22:04:11Z"
  },
  {
    "title": "Trump says talks with Iran ongoing",
    "description": "Feb ‌2 (Reuters) - U.S. ‌President Donald Trump ‌said Monday that talks with ‍Iran were ‍ongoing amid ‌high tensions. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/03/trump-says-talks-with-iran-ongoing",
    "timestamp": "2026-02-02T22:03:00Z"
  },
  {
    "title": "What We Know About the India-U.S. Trade Deal",
    "description": "Trump announced the deal in a social media post on Monday.",
    "link": "http://foreignpolicy.com/2026/02/02/us-india-trade-deal-trump-modi-oil-russia-venezuela/",
    "timestamp": "2026-02-02T22:02:35Z"
  },
  {
    "title": "Elon Musk Not Doing Well After Epstein Files Reveal",
    "description": "Elon Musk is lashing out on X about the latest Epstein files, accusing the media of lying and making increasingly desperate sounding defenses.",
    "link": "http://futurism.com/future-society/elon-musk-crashing-out-epstein",
    "timestamp": "2026-02-02T22:02:20Z"
  },
  {
    "title": "Texas Special Election Shocker Signals Big Trouble for GOP",
    "description": "A Democrat trounced a Republican in a deep-red state legislative district, raising hopes for a blue midterms wave.",
    "link": "http://nymag.com/intelligencer/article/texas-special-election-shocker-signals-big-trouble-for-gop.html",
    "timestamp": "2026-02-02T22:02:14Z"
  },
  {
    "title": "Trump Attacks GOP Congressman And His New Wife Ahead of Key House Vote: ‘Blessed be Their Marriage’",
    "description": "The House GOP's majority will soon only be by one vote, after the newly elected Democrat in Texas is sworn in.\nThe post Trump Attacks GOP Congressman And His New Wife Ahead of Key House Vote: ‘Blessed be Their Marriage’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-attacks-gop-congressman-and-his-new-wife-ahead-of-key-house-vote-blessed-be-their-marriage/",
    "timestamp": "2026-02-02T22:02:11Z"
  },
  {
    "title": "Trump cuts Indian tariffs after Modi agrees to stop buying Russian oil",
    "description": "US president indicated that the agreement would help end the Ukraine war",
    "link": "https://www.irishtimes.com/world/us/2026/02/02/trump-cuts-indian-tariffs-to-18-after-modi-agrees-to-stop-buying-russian-oil/",
    "timestamp": "2026-02-02T22:02:00Z"
  },
  {
    "title": "Authoritarianism expert warns Trump is repeating the same mistakes that doomed dictators",
    "description": "A leading scholar of authoritarianism is warning that Donald Trump is already falling into the same self-destructive traps that doomed history’s most notorious strongmen. Writing in The New York Times, NYU professor Ruth Ben-Ghiat argues Trump’s growing fixat…",
    "link": "https://www.rawstory.com/trump-2675069520/",
    "timestamp": "2026-02-02T22:00:03Z"
  },
  {
    "title": "Last Month This Month",
    "description": "The Stranger's monthly news roundup.\n \n by The Stranger's Slog AM™️ Specialists\n \n \n \n Last Month This Month is a recap of all the previous month's news, featuring headlines from Slog AM. Find it in every issue of The Stranger! Subscribe to our daily Slog AM …",
    "link": "https://www.thestranger.com/last-month-this-month/2026/02/02/80453103/last-month-this-month",
    "timestamp": "2026-02-02T22:00:00Z"
  },
  {
    "title": "Immigration Enforcement Makes America More Affordable",
    "description": "Closing the border is not only about security. Immigration sanity also returns the American Dream to its rightful owners … the citizens of the United... Read More\nThe post Immigration Enforcement Makes America More Affordable appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2026/02/02/immigration-enforcement-makes-america-more-affordable/",
    "timestamp": "2026-02-02T22:00:00Z"
  },
  {
    "title": "Trump says Republicans should 'nationalize' voting in at least 15 places (Reuters)",
    "description": "Reuters:\nTrump says Republicans should ‘nationalize’ voting in at least 15 places  —  President Donald Trump said on Monday that Republicans should “nationalize” and “take over” voting in at least 15 unspecified places, reiterating his false claims that U.S. …",
    "link": "https://www.memeorandum.com/260202/p105",
    "timestamp": "2026-02-02T22:00:00Z"
  },
  {
    "title": "Everything we know about Turning Point USA’s rival halftime show",
    "description": "Right-wing organization created ‘The All-American Halftime Show’ in protest of Puerto Rican superstar Bad Bunny taking the Super Bowl stage",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/turning-point-usa-halftime-show-super-bowl-b2909690.html",
    "timestamp": "2026-02-02T21:59:49Z"
  },
  {
    "title": "DOJ Arrests 2 More People Who Allegedly Stormed Minnesota Church",
    "description": "The DOJ announced Monday two more individuals have been arrested in connection to the disruption of a church service in St. Paul, Minnesota.",
    "link": "https://dailycaller.com/2026/02/02/doj-two-people-cities-church-st-paul-minnesota-don-lemon-ice/",
    "timestamp": "2026-02-02T21:58:28Z"
  },
  {
    "title": "S&P 500 flirts with record high; chipmakers and small caps jump",
    "description": "The S&P 500 climbed 0.54 per cent to end the session at 6,976 points, just short of its record high close of 6,979 on Jan 27. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/sp-500-flirts-with-record-high-chipmakers-and-small-caps-jump",
    "timestamp": "2026-02-02T21:56:55Z"
  },
  {
    "title": "Every Homeland Security officer in Minneapolis is now being issued a body-worn camera, Noem says",
    "description": "She said the body-worn camera program is being expanded nationwide as funding becomes available.",
    "link": "https://www.bostonherald.com/2026/02/02/immigration-officers-body-cameras/",
    "timestamp": "2026-02-02T21:56:40Z"
  },
  {
    "title": "Every Homeland Security officer in Minneapolis is now being issued a body-worn camera, Noem says",
    "description": "She said the body-worn camera program is being expanded nationwide as funding becomes available.",
    "link": "https://www.denverpost.com/2026/02/02/immigration-officers-body-cameras/",
    "timestamp": "2026-02-02T21:56:40Z"
  },
  {
    "title": "As protests spread, Trump’s GOP treats lost lives as cursory (Letters)",
    "description": "heir focus seems less on the human toll and more on the political cost. Rather than directly addressing the violence or the federal policies that have contributed to it, they worry that their messaging isn’t resonating with the public.",
    "link": "https://www.denverpost.com/2026/02/02/ice-protests-colorado-trump-republicans/",
    "timestamp": "2026-02-02T21:56:25Z"
  },
  {
    "title": "Was Don Lemon's arrest driven by bias? 'The View' hosts weigh in",
    "description": "\"The View\" co-hosts condemned former CNN host Don Lemon's arrest as an attack on journalism, saying he was politically targeted by the Trump administration.",
    "link": "https://www.foxnews.com/media/don-lemons-arrest-driven-bias-the-view-hosts-weigh",
    "timestamp": "2026-02-02T21:55:49Z"
  }
]