[
  {
    "title": "The U.S. Economy Is Now Trump Enterprises",
    "description": "The administration’s new investment policy upends any notion of long-term national interest.",
    "link": "http://foreignpolicy.com/2025/05/22/trump-investment-deals-gulf-china-russia-afip-america-first/",
    "timestamp": "2025-05-22T15:49:19Z"
  },
  {
    "title": "Charlamagne Claims With Straight Face That Letitia James Investigation Is ‘Just Retaliation’ By Trump",
    "description": "Charlamagne Tha God claimed the federal investigation into Letitia James over mortgage fraud allegations was merely revenge by President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/22/charlamagne-claims-with-straight-face-that-letitia-james-investigation-is-just-retaliation-by-trump/",
    "timestamp": "2025-05-22T15:47:06Z"
  },
  {
    "title": "Treasury Dept. winding down penny production",
    "description": "The U.S. Department of Treasury said Thursday that it made its final order of blank pennies this month as its moves to end production of the one-cent coin.",
    "link": "https://www.nbcnews.com/business/consumer/treasury-dept-winding-penny-production-rcna208522",
    "timestamp": "2025-05-22T15:46:37Z"
  },
  {
    "title": "World leaders have a huge new problem: Trump’s Oval Office smackdowns",
    "description": "t’s the new Hunger Games of world politics — the televised Oval Office take-down by President Donald Trump. South African President Cyril Ramaphosa was the latest leader to become a MAGA prop Wednesday, as Trump lectured him on false claims that White South A…",
    "link": "https://freerepublic.com/focus/f-news/4318488/posts",
    "timestamp": "2025-05-22T15:46:03Z"
  },
  {
    "title": "Clair Obscur: Expedition 33 Gets New Version, But There’s a Catch",
    "description": "Clair Obscur: Expedition 33 has proven enormously popular since launching last month. The game’s success seems to have even taken its developers by surprise; by Sandfall Interactive’s own admission, the collector’s edition sold out way earlier than anticipate…",
    "link": "http://comicbook.com/gaming/news/clair-obscur-expedition-33-new-version-monolith-set-theres-a-catch/",
    "timestamp": "2025-05-22T15:45:50Z"
  },
  {
    "title": "US Mint moves forward with plans to kill the penny",
    "description": "The U.S. Mint has made its final order of penny blanks and plans to stop producing the coin when those run out.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_aeacb9cb-9032-5ac7-8c1a-06e30802e444.html",
    "timestamp": "2025-05-22T15:45:00Z"
  },
  {
    "title": "Busy hurricane season expected as forecasters fear Trump cuts",
    "description": "The warning comes as cuts to American research raise fears over the ability to track and prepare for them.",
    "link": "https://www.bbc.com/news/articles/cp855prygj1o",
    "timestamp": "2025-05-22T15:43:54Z"
  },
  {
    "title": "US Mint moves forward with plans to kill the penny",
    "description": "Stopping penny production could save $56 million in reduced costs.",
    "link": "https://www.bostonherald.com/2025/05/22/death-of-the-penny/",
    "timestamp": "2025-05-22T15:43:46Z"
  },
  {
    "title": "US Mint moves forward with plans to kill the penny",
    "description": "Stopping penny production could save $56 million in reduced costs.",
    "link": "https://www.denverpost.com/2025/05/22/death-of-the-penny/",
    "timestamp": "2025-05-22T15:43:46Z"
  },
  {
    "title": "Members of the House Freedom Caucus evolve into lapdogs in the Trump era",
    "description": "In recent months, far-right House Freedom Caucus members have talked a good game, right before caving under pressure Donald Trump.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/members-house-freedom-caucus-evolve-lapdogs-trump-era-rcna208517",
    "timestamp": "2025-05-22T15:43:16Z"
  },
  {
    "title": "Congressman Details How Trump Strong-Arms Votes In House, And It Sounds Spot-On",
    "description": "Rep. Brendan Boyle said he's seen the president's strategy \"time and time again.\"",
    "link": "https://www.huffpost.com/entry/brendan-boyle-donald-trump-yelling-republicans-bill-vote_n_682f21fbe4b09130a58573f3",
    "timestamp": "2025-05-22T15:42:04Z"
  },
  {
    "title": "Now PBS Is Censoring a Film About Free Speech",
    "description": "A worrying pattern has taken hold in public television.",
    "link": "https://www.theatlantic.com/culture/archive/2025/05/pbs-art-spiegelman-documentary/682874/",
    "timestamp": "2025-05-22T15:42:00Z"
  },
  {
    "title": "Letters to Editor",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters/letters-to-editor/article69607395.ece",
    "timestamp": "2025-05-22T15:41:48Z"
  },
  {
    "title": "Cap And Trade Debate Includes Controversial Proposals",
    "description": "Governor Newsom is proposing an extension of the state's landmark climate program.",
    "link": "https://www.kqed.org/news/12041217/cap-and-trade-debate-includes-controversial-proposals",
    "timestamp": "2025-05-22T15:41:26Z"
  },
  {
    "title": "Judge blocks Trump administration’s mass layoffs at the Education Department",
    "description": "A federal judge on Thursday blocked President Donald Trump’s executive order to shut down the Education Department and ordered the agency to reinstate employees who were fired in mass layoffs.",
    "link": "https://www.wpxi.com/news/local/judge-blocks-trump-administrations-mass-layoffs-education-department/HXQ754JQHRAPDLJVYDVMD3FAJY/",
    "timestamp": "2025-05-22T15:41:03Z"
  },
  {
    "title": "Netanyahu’s Very Bad Bet on Trump",
    "description": "The Israeli prime minister gambled big on his pull with a president who has snubbed him.",
    "link": "https://www.theatlantic.com/international/archive/2025/05/netanyahu-trump-israel-gaza/682904/",
    "timestamp": "2025-05-22T15:39:31Z"
  },
  {
    "title": "90% Of US Companies Plan To Reshore Amid Tariffs, Allianz Survey Finds",
    "description": "Nine out of 10 U.S. companies say they expect to bring some or all of their production or sourcing back home in response to new tariffs imposed under President Donald Trump’s trade policy, according to the latest Allianz Trade Global Survey.The survey, publis…",
    "link": "https://freerepublic.com/focus/f-news/4318484/posts",
    "timestamp": "2025-05-22T15:39:09Z"
  },
  {
    "title": "House Passes Trump Tax Bill After Marathon Session, Now It Moves To The Senate",
    "description": "It turns out that all of those \"no\" votes in committee didn’t amount to much once the tax bill hit the House floor on Thursday morning.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/05/22/house-passes-trump-tax-bill-after-marathon-session-now-it-moves-to-the-senate/",
    "timestamp": "2025-05-22T15:38:08Z"
  },
  {
    "title": "Federal judge blocks Trump admin moves to dismantle Dept of Education",
    "description": "Judge Myong Joun halted President Donald Trump's mass firing at the Department of Education on Thursday, ordering the reinstatement of all employees.",
    "link": "https://www.foxnews.com/politics/federal-judge-blocks-trump-admin-from-dismantling-dept-education",
    "timestamp": "2025-05-22T15:36:28Z"
  },
  {
    "title": "Trump Showed South Africa's President Video of a 'Burial Site' as Proof of 'Genocide.' It Was From a Protest Years Ago",
    "description": "Donald Trump confronted South Africa's president with misleading video from protest footage from 2020 as evidence on ongoing \"genocide,\" despite debunked claims.",
    "link": "https://www.ibtimes.com/trump-showed-south-africas-president-video-burial-site-proof-genocide-it-was-protest-3774251",
    "timestamp": "2025-05-22T15:35:07Z"
  },
  {
    "title": "4 ways Trump's 'big beautiful' tax bill could impact your wallet",
    "description": "From an increase in the child tax credit to repealing student-loan forgiveness, here's how Trump's \"big beautiful bill\" could affect you.",
    "link": "https://www.businessinsider.com/big-beautiful-bill-affects-taxes-student-loans-maga-accounts-2025",
    "timestamp": "2025-05-22T15:35:06Z"
  },
  {
    "title": "EDF Begins Review of Renewable Projects After Facing Construction Setbacks",
    "description": "Electricite de France SA may adopt a more cautious approach to renewable-energy projects after encountering construction snags and cost overruns for wind-farm developments.",
    "link": "https://financialpost.com/pmn/business-pmn/edf-begins-review-of-renewable-projects-after-facing-construction-setbacks",
    "timestamp": "2025-05-22T15:35:05Z"
  },
  {
    "title": "MAGA V. MEGA, MAD V. Lunacy, Putin V. Trump. John Helmer. Ray McGovern",
    "description": "The war in the Ukraine is a sideshow for President Donald Trump because he is escalating his preparations for war against Russia on other fronts \nThe post MAGA V. MEGA, MAD V. Lunacy, Putin V. Trump. John Helmer. Ray McGovern appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/maga-mega-mad-lunacy-putin-trump/5888024",
    "timestamp": "2025-05-22T15:34:21Z"
  },
  {
    "title": "'Shameful': MAGA observers melt down over Supreme Court's new ruling",
    "description": "MAGA advocates staged a meltdown on social media after news broke that the U.S. Supreme Court failed to reach a decision in favor of allowing taxpayers to pay for a religious charter school in Oklahoma.The court tied 4-4 Thursday, with one conservative justic…",
    "link": "https://www.rawstory.com/amy-coney-barrett-2672188640/",
    "timestamp": "2025-05-22T15:34:06Z"
  },
  {
    "title": "Bitcoin rally takes largest cryptocurrency past US$111,000 for first time",
    "description": "Traders increasingly bullish on the token's prospects amid mounting demand and support from Donald Trump’s administration. Find out more",
    "link": "https://financialpost.com/investing/bitcoin-rally-takes-largest-cryptocurrency-past-us111000",
    "timestamp": "2025-05-22T15:33:46Z"
  },
  {
    "title": "Fox’s Jacqui Heinrich Calls Out Trump White Genocide Video as ‘Political Propaganda’",
    "description": "Fox News Senior White House correspondent Jacqui Heinrich called out Trump's \"White Genocide\"-supporting video presentation as \"political propaganda.\"\nThe post Fox’s Jacqui Heinrich Calls Out Trump White Genocide Video as ‘Political Propaganda’ first appeared…",
    "link": "https://www.mediaite.com/media/news/foxs-jacqui-heinrich-calls-out-trump-white-genocide-video-as-political-propaganda/",
    "timestamp": "2025-05-22T15:33:29Z"
  },
  {
    "title": "Kraken opening digital tokens of Apple, Tesla and Nvidia to people outside the U.S.",
    "description": "Kraken, once targeted by the SEC, is now capitalizing on friendlier conditions under Trump-era crypto policy rollbacks.",
    "link": "https://www.cnbc.com/2025/05/22/kraken-opening-digital-tokens-of-apple-tesla-and-nvidia-outside-us.html",
    "timestamp": "2025-05-22T15:32:46Z"
  },
  {
    "title": "Amazon CEO shares surprising info on a new customer trend",
    "description": "Ever since President Donald Trump announced news of his tariffs on April 2, a day the administration calls \"Liberation Day,\" a wave of fear has swept across the country as both consumers and business owners have grappled with what the new levies mean for them…",
    "link": "https://biztoc.com/x/03f398b825ca583a",
    "timestamp": "2025-05-22T15:31:25Z"
  },
  {
    "title": "Binance lists USD1 stablecoin with trading restrictions in EU and US",
    "description": "Binance, the largest crypto exchange by trading volume, revealed plans to list the USD1 stablecoin issued by the Donald Trump family-affiliated DeFi venture World Liberty Financial (WLFI). According to a May 22 statement, the exchange said it would open tradi…",
    "link": "https://cryptoslate.com/binance-lists-usd1-stablecoin-with-trading-restrictions-in-eu-and-us/",
    "timestamp": "2025-05-22T15:31:10Z"
  },
  {
    "title": "Bond investors are spooked by the 'big, beautiful' bill. Here's why that matters",
    "description": "President Donald Trump has called his signature tax legislation a “big, beautiful bill.”\nBond investors would beg to differ.\nThe $28 trillion market for U.S. Treasurys has had an uneasy several days as the tax bill made its way through Congress. The 30-year b…",
    "link": "https://biztoc.com/x/4c81f03aaf46e8d4",
    "timestamp": "2025-05-22T15:30:59Z"
  },
  {
    "title": "Universal leans into theme parks with multibillion dollar Epic Universe, even as economic uncertainty looms",
    "description": "Universal Studios opened its new theme park Epic Universe and it hopes the five new worlds will help it take on rival Disney and bring in millions of visitors.",
    "link": "https://www.cnbc.com/2025/05/22/epic-universe-opens-universal-orlando-florida.html",
    "timestamp": "2025-05-22T15:30:01Z"
  },
  {
    "title": "Student loans have been confusing lately. Here's a guide to know where you stand",
    "description": "Between collections resuming, courts blocking student loan programs and layoffs at the Education Department, borrowers might be confused about the status of their student loans.",
    "link": "https://richmond.com/news/nation-world/business/personal-finance/article_d0f719fb-ed14-51c8-a237-c597edd5c108.html",
    "timestamp": "2025-05-22T15:30:00Z"
  },
  {
    "title": "How ‘Call of Duty’ Is Getting More Veterans Jobs Than the U.S. Government",
    "description": "As Memorial Day approaches and National Military Appreciation Month comes to a close, here’s a timely fact: the largest private funder of veteran employment in the United States is a video game. Tied to Activision’s long-running military game franchise “Call …",
    "link": "https://variety.com/2025/gaming/news/call-of-duty-vets-jobs-endowment-1236404763/",
    "timestamp": "2025-05-22T15:30:00Z"
  },
  {
    "title": "‘I Dare Them to Sue Me!’ Mark Levin Rages at ‘Islamists’ Ilhan Omar and Rashida Tlaib on Fox News",
    "description": "\"Just as Reagan destroyed the Soviet Union without firing a shot, they intend to destroy the United States without firing a shot.\"\nThe post ‘I Dare Them to Sue Me!’ Mark Levin Rages at ‘Islamists’ Ilhan Omar and Rashida Tlaib on Fox News first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/i-dare-them-to-sue-me-mark-levin-rages-at-islamists-ilhan-omar-and-rashida-tlaib-on-fox-news/",
    "timestamp": "2025-05-22T15:29:36Z"
  },
  {
    "title": "Netanyahu’s promise of Israel’s ‘total victory’ over Hamas is likely to remain elusive dream",
    "description": "Only Trump appears capable at this stage of forcing the Israeli prime minister into a ceasefire",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/22/netanyahus-promise-of-israels-total-victory-over-hamas-is-likely-to-remain-elusive-dream/",
    "timestamp": "2025-05-22T15:25:53Z"
  },
  {
    "title": "Can You Be a Trump-Supporter and Still be a Good Christian?",
    "description": "I was asked this week how I can be a Christian and support Donald Trump throwing out thousands of illegal aliens. But one of the toughest things about being a Christian is trying to be a citizen. No — scratch that. I mean trying to be a good citizen. Saint Pa…",
    "link": "https://freerepublic.com/focus/f-religion/4318479/posts",
    "timestamp": "2025-05-22T15:24:58Z"
  },
  {
    "title": "Senate votes to block California’s rule banning the sale of new gas-powered cars by 2035",
    "description": "The sweeping move blunts the state’s anti-pollution efforts.",
    "link": "https://www.bostonherald.com/2025/05/22/congress-blocks-emission-rules/",
    "timestamp": "2025-05-22T15:23:41Z"
  },
  {
    "title": "Tucker Carlson, one of Donald Trump's biggest allies, says the president's deal to build a hotel in the Middle East seems like corruption",
    "description": "Tucker Carlson, who usually supports Donald Trump, now says Trump’s new hotel deals in the Middle East look suspicious. He and a guest on his show questioned if the deals were linked to political talks, and called it something that \"seems like corruption.\"",
    "link": "https://economictimes.indiatimes.com/news/international/us/tucker-carlson-one-of-donald-trumps-biggest-allies-says-the-presidents-deal-to-build-a-hotel-in-the-middle-east-seems-like-corruption/articleshow/121344055.cms",
    "timestamp": "2025-05-22T15:23:24Z"
  },
  {
    "title": "Judge blocks Trump’s executive order to dismantle Education Department",
    "description": "A federal judge on Thursday blocked President Donald Trump’s executive order to shut down the Education Department and ordered the agency to reinstate employees who were fired in mass layoffs.",
    "link": "https://www.pbs.org/newshour/politics/judge-blocks-trumps-executive-order-to-dismantle-education-department",
    "timestamp": "2025-05-22T15:23:11Z"
  },
  {
    "title": "Musk Blames 'Legacy Media Propaganda' for Americans Turning on Him: 'I've Never Harmed a Single Person'",
    "description": "Billionaire Elon Musk stated that \"legacy media propaganda\" has misrepresented many of his political views in order to earn him public backlash.",
    "link": "https://www.ibtimes.com/musk-blames-legacy-media-propaganda-americans-turning-him-ive-never-harmed-single-person-3774250",
    "timestamp": "2025-05-22T15:23:07Z"
  },
  {
    "title": "US Supreme Court bans religious charter school. What does this mean for 8,000 academic institutions in country?",
    "description": "Oklahoma Supreme Court ruled last year that the public funding mechanism for the proposed Catholic charter school in the central state was unconstitutional.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-supreme-court-bans-religious-charter-school-what-does-this-mean-for-8000-academic-institutions-in-country/articleshow/121343998.cms",
    "timestamp": "2025-05-22T15:21:29Z"
  },
  {
    "title": "5 Things the Middle Class Should Do To Prepare for Trump’s Income Tax Plan",
    "description": "President Donald Trump has floated a dramatic change to the U.S. tax system: eliminating federal income taxes and relying more heavily on tariffs.\nLearn More: Trump Wants To Replace Income Taxes With Tariffs: 2 Impacts on the Middle Class\nTry This: The New Re…",
    "link": "https://biztoc.com/x/ecc1edc8c01aeeb7",
    "timestamp": "2025-05-22T15:19:24Z"
  },
  {
    "title": "Supreme Court: Children of Illegal Aliens or Tourists are not U.S. Citizens; Revisiting old but still-controlling Supreme Court decisions on birthright citizenship",
    "description": "On the very day Donald Trump became president again, he signed an executive order prospectively eliminating birthright citizenship for children born to aliens unlawfully present in the United States. Immediately, lawsuits were filed in a half-dozen jurisdicti…",
    "link": "https://freerepublic.com/focus/f-news/4318477/posts",
    "timestamp": "2025-05-22T15:19:22Z"
  },
  {
    "title": "Analysis-Walmart vs Target: tariffs highlight growing divide in fortunes",
    "description": "NEW YORK (Reuters) -President Donald Trump's tariffs are widening the gap between market-leader Walmart and Target, the companies' latest quarterly reports...",
    "link": "https://finance.yahoo.com/news/analysis-walmart-vs-target-tariffs-151912356.html",
    "timestamp": "2025-05-22T15:19:12Z"
  },
  {
    "title": "New Ukraine talks 'yet to be agreed', Kremlin says",
    "description": "MOSCOW: New peace talks with Ukraine had \"yet to be agreed\", the Kremlin said on Thursday (May 22), disputing reports the two nations would soon hold negotiations at the Vatican. Diplomatic efforts to end the conflict have stepped up a gear in recent weeks, w…",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-peace-talks-yet-be-agreed-kremlin-5147481",
    "timestamp": "2025-05-22T15:17:40Z"
  },
  {
    "title": "Democrats Considering New Strategy Of Complaining Loudly Every Day About Trump",
    "description": "WASHINGTON, D.C. — Embattled after a difficult first several months of 2025, Democrats were reported to be considering a brilliant new strategy of complaining loudly every day about President Donald Trump.",
    "link": "https://babylonbee.com/news/democrats-considering-new-strategy-of-complaining-loudly-every-day-about-trump",
    "timestamp": "2025-05-22T15:17:05Z"
  },
  {
    "title": "US House passes tax and spending bill by single vote",
    "description": "The bill, which includes cuts to Medicaid and SNAP, now heads to Senate for debate.",
    "link": "https://www.aljazeera.com/news/2025/5/22/us-house-passes-tax-and-spending-bill-by-single-vote",
    "timestamp": "2025-05-22T15:16:55Z"
  },
  {
    "title": "Judge orders Trump administration to reinstate Education Department employees",
    "description": "A federal judge ordered the Trump administration on Thursday to reinstate more than 1,300 U.S. Department of Education employees.",
    "link": "https://www.cnbc.com/2025/05/22/education-department-employees-must-be-reinstated-by-trump-judge.html",
    "timestamp": "2025-05-22T15:16:51Z"
  },
  {
    "title": "Federal Judge Halts Trump's Education Department Shutdown",
    "description": "The federal ruling represents a setback to one of President Doanld Trump's key campaign pledges.",
    "link": "https://www.newsweek.com/federal-judge-halts-education-trump-mcmahon-shutdown-2075872",
    "timestamp": "2025-05-22T15:15:10Z"
  },
  {
    "title": "Trump and Johnson’s Big Ugly Lie",
    "description": "Chris Lehmann\n\n\n\nLast night, the president’s destructive spending bill passed the House by a single vote.\r\n\n\r\n\n\nThe post Trump and Johnson’s Big Ugly Lie appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/big-beautiful-bill/",
    "timestamp": "2025-05-22T15:14:09Z"
  },
  {
    "title": "After Donald Trump, Nvidia CEO Jensen Huang now blames Joe Biden for the US chip crackdown, says it has backfired as China has accelerated chip development",
    "description": "Nvidia's CEO Jensen Huang warns that US export controls on AI chips are backfiring, spurring China's domestic AI chip industry growth. Nvidia's market share in China has significantly decreased, leading to a $5.5 billion loss due to the cancelled China-tailor…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-donald-trump-nvidia-ceo-jensen-huang-now-blames-joe-biden-for-the-us-chip-crackdown-says-it-has-backfired-as-china-has-accelerated-chip-development/articleshow/121343242.cms",
    "timestamp": "2025-05-22T15:13:21Z"
  },
  {
    "title": "Ruble strengthens to two-year high against US dollar",
    "description": "The Russian currency’s rally has been in part driven by geopolitical optimism over a possible peace deal in the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618002-ruble-dollar-ukraine-conflict/",
    "timestamp": "2025-05-22T15:12:16Z"
  },
  {
    "title": "Treasury Department pledges to end all penny production by early 2026",
    "description": "The Treasury Department is phasing out penny production by early next year after President Donald Trump ordered the government to halt the “wasteful” minting of the coins. The Treasury will stop making pennies by early 2026, which will require businesses to s…",
    "link": "https://freerepublic.com/focus/f-chat/4318475/posts",
    "timestamp": "2025-05-22T15:10:55Z"
  },
  {
    "title": "Progressives Need to Stand Up for LaMonica McIver",
    "description": "Elie Mystal\n\n\n\nThe charges against McIver are a form of political intimidation—one directed with particular force against Black politicians—but that intimidation will only work if the people don’t have McIver’s back. \r\n\n\r\n\n\nThe post Progressives Need to Stand…",
    "link": "https://www.thenation.com/article/politics/progressives-must-support-lamonica-mciver/",
    "timestamp": "2025-05-22T15:10:26Z"
  },
  {
    "title": "Bitcoin hit a record high. Here's why.",
    "description": "The price of bitcoin surged past $110,000 for the first time.",
    "link": "https://abcnews.go.com/Business/bitcoin-hits-record-high/story?id=122068331",
    "timestamp": "2025-05-22T15:10:00Z"
  },
  {
    "title": "Judge blocks Trump administration’s mass layoffs at the Education Department",
    "description": "It marks a setback to one of Trump's campaign promises.",
    "link": "https://www.bostonherald.com/2025/05/22/trump-education-layoffs-2/",
    "timestamp": "2025-05-22T15:08:39Z"
  },
  {
    "title": "Judge blocks Trump administration’s mass layoffs at the Education Department",
    "description": "It marks a setback to one of Trump's campaign promises.",
    "link": "https://www.denverpost.com/2025/05/22/trump-education-layoffs/",
    "timestamp": "2025-05-22T15:08:39Z"
  },
  {
    "title": "South African President Cyril Ramaphosa Shoots Down Trump’s White Genocide Claims",
    "description": "Cyril Ramaphosa, the president of South Africa, met with President Donald Trump this week and shot down the white genocide claims.",
    "link": "https://hiphopwired.com/2716202/president-cyril-ramaphosa-trump-white-genocide/",
    "timestamp": "2025-05-22T15:08:14Z"
  },
  {
    "title": "Sun Pharma to seek commercialisation partner for one of its specialty products",
    "description": "Sun Pharma seeks partner for MMII pain drug, plans Phase II for GLOO34, reports 19% dip in Q4 profit.",
    "link": "https://www.thehindubusinessline.com/companies/sun-pharma-to-seek-commercialisation-partner-for-one-of-its-specialty-products/article69607111.ece",
    "timestamp": "2025-05-22T15:06:51Z"
  },
  {
    "title": "From Cortés to Netanyahu: The Conquest Never Ends",
    "description": "Consider the Spanish conquest of the Americas alongside Israel’s assault on Gaza. In many ways, the two events, separated by half a millennium, are incomparable. The first was continental in scale, a fight for a New World that was then home to, by some estima…",
    "link": "https://www.counterpunch.org/2025/05/22/from-cortes-to-netanyahu-the-conquest-never-ends/",
    "timestamp": "2025-05-22T15:06:29Z"
  },
  {
    "title": "Trump Rams His Big, Dangerous Bill Through House",
    "description": "Trump bludgeoned House Republicans into passing his ‘big, beautiful’ (but also dangerous) budget bill. The bill redistributes wealth in an upward direction while adding debt, which Democrats will howl about as the bill slogs through the Senate.",
    "link": "http://nymag.com/intelligencer/article/trump-big-beautiful-bill-house.html",
    "timestamp": "2025-05-22T15:04:58Z"
  },
  {
    "title": "Bombshell report reveals Trump's new position on Russia-Ukraine war days after his high-stake call with Putin",
    "description": "President Trump has shifted his stance on the Russia-Ukraine war, suggesting that the two nations must independently negotiate peace. Despite earlier promises to broker a quick resolution and threats of sanctions, Trump now appears hesitant to pressure Putin,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-bombshell-report-reveals-trumps-new-position-on-russia-ukraine-war-days-after-his-high-stake-call-with-putin-european-leaders/articleshow/121343764.cms",
    "timestamp": "2025-05-22T15:04:22Z"
  },
  {
    "title": "Healey condemns ‘hate-fueled’ murders outside Jewish museum",
    "description": "Gov. Maura Healey condemned the “hate-fueled” murders of two staffers of the Israeli embassy outside a charity event in Washington D.C., Wednesday night.",
    "link": "https://www.bostonherald.com/2025/05/22/healey-condemns-hate-fueled-murders-outside-jewish-museum/",
    "timestamp": "2025-05-22T15:04:14Z"
  },
  {
    "title": "Bernie Sanders criticised for saying ‘identity politics’ prevents debate on important issues",
    "description": "Bernie Sanders has claimed that some Democrats are using “identity politics” to block discussion of issues such as “class politics”, in a series of comments that have drawn criticism from some quarters. The veteran Vermont senator accused the “liberal elite” …",
    "link": "https://www.thepinknews.com/2025/05/22/bernie-sanders-podcast-identity-politics/",
    "timestamp": "2025-05-22T15:02:34Z"
  },
  {
    "title": "Mahmoud Khalil permitted to hold newborn son for the first time despite objections from government",
    "description": "Detained Palestinian activist Mahmoud Khalil was allowed to hold his one-month-old son for the first time Thursday after a federal judge blocked the Trump...",
    "link": "https://www.yahoo.com/news/mahmoud-khalil-permitted-hold-newborn-150202499.html",
    "timestamp": "2025-05-22T15:02:02Z"
  },
  {
    "title": "Trump has a huge mortgage payment due within the next 40 days, but I'm sure inviting rich investors to a pitch meeting is just a coincidence [Asinine]",
    "description": "Trump has a huge mortgage payment due within the next 40 days, but I'm sure inviting rich investors to a pitch meeting is just a coincidence",
    "link": "https://www.fark.com/comments/13680246/Trump-has-a-huge-mortgage-payment-due-within-next-40-days-but-Im-sure-inviting-rich-investors-to-a-pitch-meeting-is-just-a-coincidence",
    "timestamp": "2025-05-22T15:01:51Z"
  },
  {
    "title": "WBD’s Jori Arancio Joins TikTok As Head Of Global Consumer & B2B Communications",
    "description": "EXCLUSIVE: Warner Bros. Discovery communications executive Jori Arancio has left to join TikTok. She will lead Global Consumer & B2B Communications for the company behind the popular short video app. She will report to Karen Hobson, head of Global Media Relat…",
    "link": "http://deadline.com/2025/05/jori-arancio-tiktok-consumer-b2b-communications-1236408106/",
    "timestamp": "2025-05-22T15:00:48Z"
  },
  {
    "title": "Charlie and the Ambassadorship Factory",
    "description": "Elizabeth Spiers\n\n\n\nCharlie Kushner, the newly confirmed US ambassador to France, is a vindictive, felonious, and score-settling real estate mogul, not unlike a certain US president.\r\n\n\r\n\n\nThe post Charlie and the Ambassadorship Factory appeared first on The …",
    "link": "https://www.thenation.com/article/politics/charlie-kushner-trump-ambassador-france/",
    "timestamp": "2025-05-22T15:00:16Z"
  },
  {
    "title": "Drama Shadows Recent MAHA Wins",
    "description": "The past couple of weeks has seen a lot of drama within the Make America Healthy Again movement. Much of the commotion surrounds President Donald... Read More\nThe post Drama Shadows Recent MAHA Wins appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/22/drama-shadows-recent-maha-wins/",
    "timestamp": "2025-05-22T15:00:00Z"
  },
  {
    "title": "Trump Leaves Disaster-Struck States Waiting Weeks for Sign-Off on FEMA Aid",
    "description": "States and cities struck by deadly tornadoes and floods are begging the Trump administration for disaster aid",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/05/22/trump-who-called-fema-very-slow-has-failed-to-act-on-17-disaster-requests-00364007",
    "timestamp": "2025-05-22T15:00:00Z"
  },
  {
    "title": "Rubio: U.S. Oil License for Venezuela Expires on May 27",
    "description": "The U.S. license allowing companies to operate in Venezuela’s oil industry will expire as planned on May 27, U.S. Secretary of State Marco Rubio said amid reports that the U.S. could extend the license to U.S. supermajor Chevron. “The pro-Maduro Biden oil lic…",
    "link": "https://oilprice.com/Energy/Energy-General/Rubio-US-Oil-License-for-Venezuela-Expires-on-May-27.html",
    "timestamp": "2025-05-22T15:00:00Z"
  },
  {
    "title": "Inside the Fight to Pass the Laken Riley Act",
    "description": "In February 2024, Rep. Mike Collins, R-Ga., received a devastating phone call from a sheriff in his home district while attending a Trump rally in... Read More\nThe post Inside the Fight to Pass the Laken Riley Act appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/22/inside-fight-pass-laken-riley-act-mike-collins/",
    "timestamp": "2025-05-22T14:59:42Z"
  },
  {
    "title": "In making his case against South Africa, Trump relied on ‘evidence’ that wasn’t real",
    "description": "“These are burial sites,\" Donald Trump said, pointing to his video of South Africa. \"Over a thousand of white farmers.” His evidence, however, wasn't real.",
    "link": "https://biztoc.com/x/4938861d0f908f7b",
    "timestamp": "2025-05-22T14:58:51Z"
  },
  {
    "title": "Donald Trump's 'Big, Beautiful Bill' Passes House: What Happens Next",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's sweeping budget package will move to the Senate after narrowly passing in the House early Thursday morning.\nThe package, which Trump dubbed his \"big, beautiful bill\" contains a range o…",
    "link": "https://biztoc.com/x/295e15a88d3f625c",
    "timestamp": "2025-05-22T14:58:49Z"
  },
  {
    "title": "Donald Trump's 'Big, Beautiful Bill' Passes House: What Happens Next",
    "description": "The package contains a range of measures, including increased spending for the U.S. military and border security and tax cuts.",
    "link": "https://www.newsweek.com/donald-trump-big-beautiful-bill-latest-2075699",
    "timestamp": "2025-05-22T14:58:18Z"
  },
  {
    "title": "What is US' Stablecoin-Focussed GENIUS Act: Everything to Know",
    "description": "The US stablecoin bill has advanced to the House of Senate for the final approval. Dubbed the Guiding and Establishing National Innovation for US Stablecoins (GENIUS) Act, this legislation aims to set clear rules around the issuing and management of stablecoi…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/us-genius-stablecoin-act-explained-8481731",
    "timestamp": "2025-05-22T14:55:29Z"
  },
  {
    "title": "If You Think Multinational Mining Interests Want to Save the Environment, I’ve Got a Bridge to Sell You",
    "description": "Joshua Frank\n\n\n\nA sacred site for Native Americans is on the verge of being destroyed for profit, and profit alone—just one more colonial conquest of lands in the American West.\r\n\n\r\n\n\nThe post If You Think Multinational Mining Interests Want to Save the Envir…",
    "link": "https://www.thenation.com/article/environment/oak-flat-apache-mineral-mining/",
    "timestamp": "2025-05-22T14:55:05Z"
  },
  {
    "title": "‘The Senate Should Rip It to Pieces’: Conservatives Torch Trump’s Big, Beautiful Bill",
    "description": "While much of the GOP celebrated the passage of Trump's \"Big, Beautiful Bill\" on Thursday, some conservative dissenters have made their displeasure known.\nThe post ‘The Senate Should Rip It to Pieces’: Conservatives Torch Trump’s Big, Beautiful Bill first app…",
    "link": "https://www.mediaite.com/media/news/the-senate-should-rip-it-to-pieces-conservatives-torch-trumps-big-beautiful-bill/",
    "timestamp": "2025-05-22T14:53:00Z"
  },
  {
    "title": "Israel embassy couple, soon to be engaged, gunned down at Jewish museum in D.C.",
    "description": "Shooting suspect screaming 'Free Palestine' as he was arrested",
    "link": "https://www.wnd.com/2025/05/israel-embassy-couple-soon-to-be-engaged-gunned-down-at-jewish-museum-in-d-c/",
    "timestamp": "2025-05-22T14:52:24Z"
  },
  {
    "title": "Jamie Dimon says the US is still at risk of a fate worse than recession",
    "description": "Jamie Dimon said he was preparing for a full range of scenarios, including stagflation. The JPMorgan boss has voiced other downbeat views in recent weeks.",
    "link": "https://www.businessinsider.com/jamie-dimon-staglfation-warning-economy-outlook-inflation-gdp-jpmorgan-2025-5",
    "timestamp": "2025-05-22T14:51:25Z"
  },
  {
    "title": "Pope's Call To Tame AI Sets Tone For Christian Leaders",
    "description": "Pope Leo XIV singled out the challenges of artificial intelligence as he took office this month, underscoring religious leaders' hopes to influence a technology freighted with both vast hopes and apocalyptic fears.",
    "link": "https://www.ibtimes.com/popes-call-tame-ai-sets-tone-christian-leaders-3774241",
    "timestamp": "2025-05-22T14:51:21Z"
  },
  {
    "title": "Attorney Says Mother of Newborn Taken by ICE, Infant Left with Relative",
    "description": "Nera Shefer told Newsweek, \"Among those detained was a young mother, believed to have a two-month-old infant in a stroller.\"",
    "link": "https://www.newsweek.com/attorney-mother-newborn-ice-arizona-2075676",
    "timestamp": "2025-05-22T14:50:51Z"
  },
  {
    "title": "‘The View’ Hosts Were Asked To “Tone Down” Their Anti-Trump Rhetoric By ABC Execs, Disney CEO Bob Iger – But They Refused: Report",
    "description": "The hosts were reportedly asked to \"broaden\" their show beyond politics.",
    "link": "https://decider.com/2025/05/22/the-view-tone-down-anti-trump-rhetoric/",
    "timestamp": "2025-05-22T14:50:04Z"
  },
  {
    "title": "'Death, death, death': How Trump embraced South Africa's 'white genocide' conspiracy theory",
    "description": "The claim made international headlines after it was raised in the Oval Office yesterday.",
    "link": "https://www.thejournal.ie/factcheck-donald-trump-white-genocide-south-africa-oval-office-6711535-May2025/",
    "timestamp": "2025-05-22T14:48:44Z"
  },
  {
    "title": "Sheinbaum: We are still negotiating with US",
    "description": "Mexican President Claudia Sheinbaum reported having a telephone conversation with US President Donald Trump earlier where they discussed trade-related matters.\"We moved the conference because we had a...",
    "link": "https://biztoc.com/x/407b5c65ea669242",
    "timestamp": "2025-05-22T14:47:50Z"
  },
  {
    "title": "Trump-Backed World Liberty Financial Buys BUILDon Token, Sending the Price Up 1,340%",
    "description": "World Liberty Financial, the crypto project backed by U.S. President Donald Trump's family, announced Wednesday that it bought BUILDon (B), sparking a 1,340% move in the BNB Chain token.\nThe purchase came after BUILDon announced it would be using WLFI's USD1 …",
    "link": "https://biztoc.com/x/e85db7f1bcf521c0",
    "timestamp": "2025-05-22T14:47:40Z"
  },
  {
    "title": "The Treasury unveils its plan to kill the penny | CNN Business",
    "description": "The US Treasury is phasing out production of the penny and will soon stop putting new one-cent coins into circulation, the department said in a statement Thursday.",
    "link": "https://www.cnn.com/2025/05/22/business/us-discontinue-penny",
    "timestamp": "2025-05-22T14:47:05Z"
  },
  {
    "title": "Pakistan used hotline to request ceasefire; no international mediation: Jaishankar",
    "description": "India-Pakistan hotline used for ceasefire, no international mediation, bilateral arrangement, US President Trump falsely claims involvement.",
    "link": "https://www.thehindubusinessline.com/news/national/pakistan-used-hotline-to-request-ceasefire-no-international-mediation-jaishankar/article69606772.ece",
    "timestamp": "2025-05-22T14:46:57Z"
  },
  {
    "title": "US House passes Trump's 'big, beautiful' tax and spending bill",
    "description": "The bill's passage is a victory for the White House, which warned that failure would be a 'betrayal'.",
    "link": "https://www.bbc.com/news/articles/c5yg0kgg2njo",
    "timestamp": "2025-05-22T14:46:24Z"
  },
  {
    "title": "Home sales are stuck — and prices are still rising",
    "description": "A tight market is becoming a full-blown affordability crisis as existing home sales stall, prices climb, and mortgage rates top 7%",
    "link": "https://qz.com/us-housing-market-april-data-rising-prices-rising-rates-1851781903",
    "timestamp": "2025-05-22T14:43:33Z"
  },
  {
    "title": "'Hidden' Provision in Trump's Big Bill Could Disarm US Supreme Court",
    "description": "The provision would bar courts from enforcing contempt citations for violations of injunctions or temporary restraining orders unless a bond has been paid.",
    "link": "https://www.newsweek.com/hidden-provision-trump-bill-court-2075769",
    "timestamp": "2025-05-22T14:42:09Z"
  },
  {
    "title": "Tesla Loses Key Status Marker as Elon Musk Backlash Ramps Up",
    "description": "Elon Musk’s electric carmaker Tesla has been outsold in Europe by a rival company for the first time. \r\nThe continent’s longtime electric favorite was overtaken by Chinese company BYD in April, which sold 7,231 fully electric cars compared to Tesla’s 1,165, a…",
    "link": "https://newrepublic.com/post/195614/tesla-loses-status-marker-elon-musk-backlash",
    "timestamp": "2025-05-22T14:41:53Z"
  },
  {
    "title": "In making his case against South Africa, Trump relied on ‘evidence’ that wasn’t real",
    "description": "“These are burial sites,\" Donald Trump said, pointing to his video of South Africa. \"Over a thousand of white farmers.” His evidence, however, wasn't real.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/making-case-south-africa-trump-relied-evidence-wasnt-real-rcna208493",
    "timestamp": "2025-05-22T14:41:28Z"
  }
]