[
  {
    "title": "'Can't believe I said that': Trump backtracks on comment that left world leaders incensed",
    "description": "President Donald Trump appeared to deny he'd made a previous, controversial claim that Ukrainian President Volodymyr Zelensky is a \"dictator\" at a press conference following his White House meeting with British Prime Minister Keir Starmer — a claim that trigg…",
    "link": "https://www.rawstory.com/trump-starmer-ukraine/",
    "timestamp": "2025-02-27T19:47:47Z"
  },
  {
    "title": "Elon Musk says he's sending Starlink tech to FAA while saying, without evidence, that air safety is 'at risk'",
    "description": "Elon Musk said Thursday that he's sending his Starlink satellite internet terminals to the Federal Aviation Administration while saying, without providing evidence, that current technology poses a risk to air travel safety.\nThe billionaire and top advisor to …",
    "link": "https://biztoc.com/x/417da35ce7b6795e",
    "timestamp": "2025-02-27T19:46:55Z"
  },
  {
    "title": "Playbook PM: Trump escalates trade war threat (Eli Okun/Politico)",
    "description": "Eli Okun / Politico:\nPlaybook PM: Trump escalates trade war threat  —  THE CATCH-UP  —  TRADE WARS: President Donald Trump today redoubled his threats to slap fresh tariffs on the country's three biggest trading partners.  —  Canada and Mexico: So much for ye…",
    "link": "https://www.memeorandum.com/250227/p95",
    "timestamp": "2025-02-27T19:45:08Z"
  },
  {
    "title": "Trump is closing 3 St. Louis-area federal offices. One was already slated to shutter.",
    "description": "Each of the local leases listed on DOGE's \"Wall of Receipts\" were for offices less than 5,000 square feet of space.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_1d9bb268-f522-11ef-8040-8b74538d2aab.html",
    "timestamp": "2025-02-27T19:45:00Z"
  },
  {
    "title": "Brutal 20% Ethereum price sell-off is not over, but is there a silver lining for ETH?",
    "description": "Ethereum price has yet to recover from its 20% correction, but investors’ choice to pivot away from memecoins and Solana could be ETH’s saving grace.",
    "link": "https://cointelegraph.com/news/brutal-20-ethereum-price-sell-off-is-not-over-but-is-there-a-silver-lining-for-eth",
    "timestamp": "2025-02-27T19:45:00Z"
  },
  {
    "title": "Trudeau shuts down NDP proposal to bar Trump from G7 summit",
    "description": "Prime Minister Justin Trudeau is rejecting NDP Leader Jagmeet Singh's proposal to bar Donald Trump from attending the G7 summit taking place this spring in Canada.",
    "link": "https://www.cbc.ca/news/politics/trump-trudeau-g7-june-meeting-1.7470393",
    "timestamp": "2025-02-27T19:43:53Z"
  },
  {
    "title": "Elon Musk sends Starlink tech to FAA, says without evidence air safety is 'at risk'",
    "description": "Executives at major airlines told CNBC on Thursday that they do not see the FAA infrastructure as an immediate safety risk.",
    "link": "https://www.cnbc.com/2025/02/27/elon-musk-starlink-faa-safety-claims.html",
    "timestamp": "2025-02-27T19:43:09Z"
  },
  {
    "title": "House Democrats Look To Shoot Down TRUMP Memecoin With Proposed MEME Act: Report",
    "description": "A freshman California Democrat congress member is proposing legislation to prevent lawmakers from profiting off meme assets. According to reports from ABC and AP News, Representative Sam Liccardo (D-CA) is introducing the Modern Emoluments and Malfeasance Enf…",
    "link": "https://dailyhodl.com/2025/02/27/house-democrats-look-to-shoot-down-trump-memecoin-with-proposed-meme-act-report/",
    "timestamp": "2025-02-27T19:41:38Z"
  },
  {
    "title": "BBC Verify: Viral Donald Trump Jr audio highly likely AI fake",
    "description": "A clip of Donald Trump Jr allegedly saying on his podcast that the US should have sent arms to Russia rather than Ukraine was very likely generated with AI, experts say.",
    "link": "https://www.bbc.com/news/videos/c36wwzpj1w7o",
    "timestamp": "2025-02-27T19:41:26Z"
  },
  {
    "title": "EXCLUSIVE: Peter Navarro Reveals The Real Plan Behind Trump’s New Tariffs",
    "description": "Peter Navarro discussed the president's tariff philosophy with the Daily Caller, explaining that with these countries it ultimately comes down to fentanyl.",
    "link": "https://dailycaller.com/2025/02/27/peter-navarro-donald-trump-tariffs-china-canada-mexico/",
    "timestamp": "2025-02-27T19:40:56Z"
  },
  {
    "title": "5 things to watch on the ASX 200 on Friday",
    "description": "Will the market end the month on a positve note? Let's find out.\nThe post 5 things to watch on the ASX 200 on Friday appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/02/28/5-things-to-watch-on-the-asx-200-on-friday-28-february-2025/",
    "timestamp": "2025-02-27T19:40:22Z"
  },
  {
    "title": "Viral Trump Gaza Video Shows How Quickly AI Slop Can Spread",
    "description": "Bizarre AI videos are nothing new, but as AI models become more advanced and easier to use, they show up in new contexts.",
    "link": "https://www.cnet.com/tech/services-and-software/viral-trump-gaza-video-shows-how-quickly-ai-slop-can-spread/",
    "timestamp": "2025-02-27T19:40:18Z"
  },
  {
    "title": "Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’",
    "description": "DAILY CALLER NEWS FOUNDATION—Former vice presidential candidate and Democratic Minnesota Gov. Tim Walz was caught claiming that America is being stolen by “fascists and Nazis,”... Read More\nThe post Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’ a…",
    "link": "https://www.dailysignal.com/2025/02/27/tim-walz-claims-america-was-stolen-by-fascists-and-nazis/",
    "timestamp": "2025-02-27T19:39:59Z"
  },
  {
    "title": "Elon Musk’s ‘I am become meme’ quote, explained—what it means and where it started",
    "description": "'I am become meme' refers to a statement made by Elon Musk at the 2025 Conservative Political Action Conference (CPAC). The phrase, which Musk has used before, is a bizarre twist on J. Robert Oppenheimer’s famous quote about the atomic bomb and quickly became…",
    "link": "https://www.dailydot.com/memes/i-am-become-meme-elon-musk/",
    "timestamp": "2025-02-27T19:39:45Z"
  },
  {
    "title": "Trump Grilled by British Reporter Over Claim the EU Was ‘Constructed to Screw’ the US",
    "description": "Donald Trump pushed back at a press conference after being confronted with his recent claim the European Union was designed to \"screw\" the United States.\nThe post Trump Grilled by British Reporter Over Claim the EU Was ‘Constructed to Screw’ the US first appe…",
    "link": "https://www.mediaite.com/politics/trump-grilled-by-british-reporter-over-claim-the-eu-was-constructed-to-screw-the-us/",
    "timestamp": "2025-02-27T19:39:30Z"
  },
  {
    "title": "Watch: Trump welcomes prime minister to the White House",
    "description": "The highly anticipated meeting between the two leaders began with a question and answer with the press.",
    "link": "https://www.bbc.com/news/videos/c0mwwpwrw14o",
    "timestamp": "2025-02-27T19:39:08Z"
  },
  {
    "title": "\"Did I Say That?\": Trump Downplays Earlier \"Dictator\" Jibe At Zelensky",
    "description": "US President Donald Trump on Thursday downplayed an earlier jibe calling Ukrainian President Volodymyr Zelensky a &quot;dictator.&quot;",
    "link": "https://www.ndtv.com/world-news/donald-trump-downplays-earlier-dictator-jibe-at-ukraines-volodymer-zelensky-7811080",
    "timestamp": "2025-02-27T19:38:03Z"
  },
  {
    "title": "WTI up by almost 2.5% with Trump in spotlight",
    "description": "The prices of oil futures jumped on Thursday amid concerns about and analyses of United States President Donald Trump's introduced and prospective tariffs on various imports from other countries. Mean...",
    "link": "https://biztoc.com/x/893c184fe7ffd756",
    "timestamp": "2025-02-27T19:36:00Z"
  },
  {
    "title": "Higher Ed Needs to Show Its Work on Ending DEI",
    "description": "Students are not the only ones who have homework due this semester. Teachers, college professors, and school administrators have a civil rights assignment to turn... Read More\nThe post Higher Ed Needs to Show Its Work on Ending DEI appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/02/27/higher-ed-needs-to-show-its-work-on-ending-dei/",
    "timestamp": "2025-02-27T19:35:14Z"
  },
  {
    "title": "Nuclear Energy Policy in the Second Trump Administration",
    "description": "As the Trump administration makes key nuclear energy policy appointments, tariffs threaten to undermine U.S. competitiveness in next-generation reactors. In the early days of the second Trump administration, two schools of thought appeared to be emerging rega…",
    "link": "https://nationalinterest.org/blog/energy-world/nuclear-energy-policy-in-the-second-trump-administration/",
    "timestamp": "2025-02-27T19:33:21Z"
  },
  {
    "title": "WWE mogul and Trump's Education chief pick advances to final round",
    "description": "The Senate has advanced the nomination of former World Wrestling Entertainment (WWE) CEO Linda McMahon to serve as secretary of education for a final round of voting.",
    "link": "https://www.foxnews.com/politics/wwe-mogul-trumps-education-chief-pick-advances-final-round",
    "timestamp": "2025-02-27T19:31:32Z"
  },
  {
    "title": "Trump’s Pick To Lead The Navy Signals Commitment To Rebuilding America’s Depleted Maritime Fleet",
    "description": "Rebuilding America's naval fleet will be a priority for the Trump admin, Navy Secretary nominee John Phelan told lawmakers on Thursday.",
    "link": "https://thefederalist.com/2025/02/27/trumps-pick-to-lead-the-navy-signals-commitment-to-rebuilding-americas-depleted-maritime-fleet/",
    "timestamp": "2025-02-27T19:31:00Z"
  },
  {
    "title": "FBI Wants A Piece Of UFC",
    "description": "FBI is setting its sights on UFC for a controversial new plan from newly-appointed director Kash Patel, which may have originated from U.S. President Donald Trump’s friendship with UFC CEO Dana White.",
    "link": "https://www.mmamania.com/2025/2/27/24374380/fbi-targets-ufc-warned-against-takeover-stunning-announcement-controversial-new-director-mma",
    "timestamp": "2025-02-27T19:29:35Z"
  },
  {
    "title": "Chiefs star gets in White House visit before the Eagles: President Trump meets with Harrison Butker",
    "description": "The Eagles haven't visited the White House yet, but one Chiefs player has",
    "link": "https://www.cbssports.com/nfl/news/chiefs-star-gets-in-white-house-visit-before-the-eagles-president-trump-meets-with-harrison-butker/",
    "timestamp": "2025-02-27T19:27:36Z"
  },
  {
    "title": "Ron DeSantis Says Andrew Tate, Brother Tristan Aren't Welcome In Florida",
    "description": "The Trump administration may have pressured Romania into letting the alleged sex traffickers leave the country.",
    "link": "https://www.huffpost.com/entry/andrew-tate-florida-not-welcome-desantis_n_67c0960ce4b08e33534cda6a",
    "timestamp": "2025-02-27T19:27:26Z"
  },
  {
    "title": "Sebastian Stan’s net worth: How the Marvel star built his fortune",
    "description": "Sebastian Stan has built his fortune through blockbuster roles in the MCU, TV performances and real estate investments. Unlike many Hollywood stars, he has avoided major endorsements or side businesses, focusing solely on his craft. With an Oscar nomination a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sebastian-stans-net-worth-how-the-marvel-star-built-his-fortune/articleshow/118611502.cms",
    "timestamp": "2025-02-27T19:27:26Z"
  },
  {
    "title": "Former Kamala Comms Director Thinks Andrew Cuomo Would Be a Good Presidential Candidate in 2028",
    "description": "Jamal Simmons, who served as communications director for former vice president Kamala Harris, is now pitching disgraced ex-New York governor Andrew Cuomo as a top Democratic contender for the White House in 2028.\nThe post Former Kamala Comms Director Thinks A…",
    "link": "https://freebeacon.com/latest-news/former-kamala-comms-director-thinks-andrew-cuomo-would-be-a-good-presidential-candidate-in-2028/",
    "timestamp": "2025-02-27T19:25:43Z"
  },
  {
    "title": "Conservatism Saved As Muslim Sex Trafficker Brought Back To U.S.",
    "description": "U.S. — Patriotic Americans coast to coast raised a collective cheer today after hearing news that conservatism itself had been saved as a Muslim sex trafficker had been safely and triumphantly brought back to the U.S.",
    "link": "https://babylonbee.com/news/conservatism-saved-as-muslim-sex-trafficker-brought-back-to-us",
    "timestamp": "2025-02-27T19:25:00Z"
  },
  {
    "title": "Paramount ends DEI policies, cites Trump executive order",
    "description": "Paramount Global told its employees this week that it's ending numerous diversity, equity and inclusion policies, according to a memo obtained by CNBC.\nIn the memo sent to employees Wednesday, Paramount said it would comply with President Donald Trump's execu…",
    "link": "https://biztoc.com/x/27bd22b798bb5a96",
    "timestamp": "2025-02-27T19:24:47Z"
  },
  {
    "title": "'Completely insane': MAGA fan mocked for flipping out as NYT identifies DOGE staffers",
    "description": "The New York Times has identified 45 individuals working in the so-called Department of Government Efficiency formed by Elon Musk with Donald Trump's blessing.The quasi-government advisory board has recommended sweeping cuts to federal agencies and tossed tho…",
    "link": "https://www.rawstory.com/who-works-for-doge/",
    "timestamp": "2025-02-27T19:24:38Z"
  },
  {
    "title": "The Influencer Yelling at Moms to Try Harder",
    "description": "Kylie Perkins has racked up 2 million TikTok followers, and a slew of conservative supporters, with her housecleaning content.",
    "link": "http://www.thecut.com/article/who-is-tiktok-cleaning-influencer-kylie-perkins.html",
    "timestamp": "2025-02-27T19:24:33Z"
  },
  {
    "title": "Government data torpedoes Swalwell's viral claim about plane crashes on Trump's watch: 'Habitual liar'",
    "description": "Democratic Rep. Eric Swalwell's claim about more plane crashes under President Trump than any other president is contradicted by official data from the Department of Transportation.",
    "link": "https://www.foxnews.com/politics/government-data-torpedoes-swalwells-viral-claim-plane-crashes-trumps-watch-habitual-liar",
    "timestamp": "2025-02-27T19:24:29Z"
  },
  {
    "title": "Trump Says He Doesn’t Remember Calling Zelenskyy a Dictator When Confronted in Oval Office: ‘Did I Say That?’",
    "description": "President Donald Trump on Thursday acted as though he had no recollection of calling Ukrainian President Volodymyr Zelenskyy a \"dictator.\"\nThe post Trump Says He Doesn’t Remember Calling Zelenskyy a Dictator When Confronted in Oval Office: ‘Did I Say That?’ f…",
    "link": "https://www.mediaite.com/news/trump-says-he-doesnt-remember-calling-zelensky-a-dictator-when-confronted-in-oval-office-did-i-say-that/",
    "timestamp": "2025-02-27T19:23:34Z"
  },
  {
    "title": "Finance secy Tuhin Kanta Pandey to be new Sebi chief",
    "description": "The government has appointed Tuhin Kanta Pandey as the new chairperson of Sebi, succeeding Madhabi Puri Buch. Pandey, an IAS officer with extensive public policy experience, will serve an initial term of three years. Buch faced allegations of conflict of inte…",
    "link": "https://economictimes.indiatimes.com/news/india/finance-secy-tuhin-kanta-pandey-to-be-new-sebi-chief/articleshow/118611459.cms",
    "timestamp": "2025-02-27T19:23:04Z"
  },
  {
    "title": "Finance secy Tuhin Kanta Pandey to be new Sebi chief",
    "description": "The government has appointed Tuhin Kanta Pandey as the new chairperson of Sebi, succeeding Madhabi Puri Buch. Pandey, an IAS officer with extensive public policy experience, will serve an initial term of three years. Buch faced allegations of conflict of inte…",
    "link": "https://economictimes.indiatimes.com/news/india/finance-secy-tuhin-kanta-pandey-to-be-new-sebi-chief/articleshow/118614592.cms",
    "timestamp": "2025-02-27T19:23:04Z"
  },
  {
    "title": "Democrats’ New Spokesman Might Be The Biggest Gift They Could Give Trump",
    "description": "The New York Times has officially crowned a fresh Resistance leader to fight back against the fascist Trump/Musk administration.",
    "link": "https://dailycaller.com/2025/02/27/chris-murphy-democratic-party-donald-trump-doge-elon-musk/",
    "timestamp": "2025-02-27T19:23:03Z"
  },
  {
    "title": "King Charles Invites Trump For Unprecedented 2nd UK State Visit",
    "description": "Donald Trump accepted an invitation from King Charles on Thursday to visit Britain, making the U.S. President the first elected political leader in modern times to be hosted for two state visits by a British monarch.",
    "link": "https://www.ndtv.com/world-news/king-charles-invites-donald-trump-for-unprecedented-2nd-uk-state-visit-7811042",
    "timestamp": "2025-02-27T19:22:22Z"
  },
  {
    "title": "House Democrat Introduces Bill To Reinstate Veterans Trump Fired",
    "description": "Nearly 6,000 veterans have been fired across the federal government, according to data from Democrats on the House Appropriations Committee.",
    "link": "https://www.huffpost.com/entry/house-democrat-introduces-bill-to-reinstate-veterans-trump-fired-from-government_n_67c0b9e7e4b0702663294b67",
    "timestamp": "2025-02-27T19:22:00Z"
  },
  {
    "title": "Trump tariffs of 25% on Canada, Mexico set to kick in March 4",
    "description": "Trump said drugs, especially fentanyl, continued to pour into the US at 'very high' levels, justifying the tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/2/27/trump-tariffs-of-25-on-canada-mexico-set-to-kick-in-march-4",
    "timestamp": "2025-02-27T19:21:43Z"
  },
  {
    "title": "EXCLUSIVE: Blackburn Bill Would Make Trump’s World Health Organization Exit Permanent",
    "description": "Senator Marsha Blackburn (TN) introduced a bill on Thursday that would make President Donald Trump’s withdrawal from the World Health Organization permanent, barring massing reform.  The bill would block taxpayer dollars from either funding WHO programs or Am…",
    "link": "https://www.dailywire.com/news/exclusive-blackburn-bill-would-make-trumps-world-health-organization-exit-permanent",
    "timestamp": "2025-02-27T19:20:53Z"
  },
  {
    "title": "'We Have to Reclaim Race and Racism'",
    "description": "“What matters to me, as a former teacher and current litigator, is that students see themselves in what they learn and feel empowered to make change,” says Leah Watson, a senior staff attorney with the ACLU's Racial Justice Program. “It’s unacceptable to forc…",
    "link": "https://www.aclu.org/news/racial-justice/we-have-to-reclaim-race-and-racism",
    "timestamp": "2025-02-27T19:19:38Z"
  },
  {
    "title": "Trump says talks on Ukraine advanced, Russia 'acting well'",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Thursday that talks with Russia and Ukraine on a peace deal are \"very well advanced\" and credited Russia for its actions in the talks, as he met with British Prime Minister Keir Starmer at the White H…",
    "link": "https://www.thestar.com.my/news/world/2025/02/28/trump-says-talks-on-ukraine-advanced-russia-039acting-well039",
    "timestamp": "2025-02-27T19:19:00Z"
  },
  {
    "title": "The Party of Rural America: Life Expectancy in West Virginia is way too high",
    "description": "Krugman observes that the Republican war on Medicaid will be particularly devastating to the rural states that overwhelmingly support Trump: West Virginia is a very red state; Donald Trump received more than two thirds of its votes last year. It’s also a poor…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/the-party-of-rural-america-life-expectancy-in-west-virginia-is-way-too-high",
    "timestamp": "2025-02-27T19:17:35Z"
  },
  {
    "title": "Rise of the super-billionaires: How the world’s wealthiest are reshaping global economy",
    "description": "A new class of financial elites, the super-billionaires, has emerged, controlling 16% of billionaire wealth. With a combined net worth of $3.3 trillion, figures like Elon Musk and Bernard Arnault are driving innovation and market influence. Let’s find out the…",
    "link": "https://economictimes.indiatimes.com/news/international/us/rise-of-the-super-billionaires-how-the-worlds-wealthiest-are-reshaping-global-economy/articleshow/118611234.cms",
    "timestamp": "2025-02-27T19:17:13Z"
  },
  {
    "title": "‘CFPB Has Gotten in the Way of Its Own Mission,’ McKernan Claims at Confirmation Hearing",
    "description": "Jonathan McKernan, appearing before the Senate Banking Committee during a hearing on his nomination to lead the Consumer Financial Protection Bureau, told lawmakers Thursday (Feb 26), “All too often, … the CFPB has gotten in the way of its own mission.” “It h…",
    "link": "https://www.pymnts.com/news/cfpb/2025/cfpb-blocking-its-own-mission-jonathan-mckernan-claims-confirmation-hearing/",
    "timestamp": "2025-02-27T19:15:49Z"
  },
  {
    "title": "Andrew Tate Arrives in Florida and Florida Already Wants Him Gone",
    "description": "Tate and his brother were able to leave Romania thanks to pressure from the Trump administration.",
    "link": "https://gizmodo.com/andrew-tate-arrives-in-florida-and-florida-already-wants-him-gone-2000569375",
    "timestamp": "2025-02-27T19:15:13Z"
  },
  {
    "title": "North Korea appears to have sent more troops to Russia to back its war against Ukraine, Seoul says",
    "description": "South Korea’s spy agency says North Korea appears to have sent additional troops to Russia to help with Ukraine war.",
    "link": "https://www.bostonherald.com/2025/02/27/north-korea-more-troops-russia/",
    "timestamp": "2025-02-27T19:15:00Z"
  },
  {
    "title": "Should Denver call city workers back to downtown offices full time? For now, mayor holds firm on hybrid policy.",
    "description": "While Denver Mayor Mike Johnston suggested during his campaign that he would consider requiring full-time, in-person work, the city doesn’t have any plans to do so.",
    "link": "https://www.denverpost.com/2025/02/27/denver-city-employees-remote-work-downtown-revitalization-mike-johnston/",
    "timestamp": "2025-02-27T19:14:34Z"
  },
  {
    "title": "Please don’t leave: Metsola visits US to sing transatlantic praises",
    "description": "European Parliament President Roberta Metsola today praised EU-US relations and retorted JD Vance’s controversial Munich speech.\nHer speech came a day after US President Donald Trump told reporters that the EU allegedly was formed to “screw” the United States…",
    "link": "https://biztoc.com/x/9e71e4fa9f234216",
    "timestamp": "2025-02-27T19:13:41Z"
  },
  {
    "title": "Saskatchewan’s Moe says relations with U.S. ‘more intense’ after meetings in Washington",
    "description": "Saskatchewan Premier Scott Moe says relations with the United States have been “a little more intense,” as he continues to push against the threat of tariffs.\nMoe says even with heightened rhetoric from U.S. President Donald Trump, he’s committed to making th…",
    "link": "https://biztoc.com/x/979fbcf840548576",
    "timestamp": "2025-02-27T19:13:34Z"
  },
  {
    "title": "Texas Lawmaker’s Bill Would Require DHS to Report to Congress Crimes Illegal Aliens Commit",
    "description": "New legislation would require the Department of Homeland Security to notify Congress of crimes committed by illegal aliens that the Biden administration paroled in the... Read More\nThe post Texas Lawmaker’s Bill Would Require DHS to Report to Congress Crimes …",
    "link": "https://www.dailysignal.com/2025/02/27/texas-lawmakers-bill-would-require-dhs-to-report-to-congress-crimes-illegal-aliens-commit/",
    "timestamp": "2025-02-27T19:13:11Z"
  },
  {
    "title": "King invites Trump to Scotland for state visit",
    "description": "Keir Starmer hands the US president an invitation letter as the pair meet at the White House.",
    "link": "https://www.bbc.com/news/articles/c5yxxpxe5qko",
    "timestamp": "2025-02-27T19:12:56Z"
  },
  {
    "title": "Zelenskyy could be signing half of Ukraine's resources to US. How much does it have to give?",
    "description": "Donald Trump wants to \"recoup\" US aid money sent to help Ukraine defend itself against Russian invaders, while Volodymyr Zelenskyy wants security assurances for his country.",
    "link": "https://www.abc.net.au/news/2025-02-28/donald-trump-volodymyr-zelenskyy-ukraine-white-house-meeting/104988824",
    "timestamp": "2025-02-27T19:09:13Z"
  },
  {
    "title": "Trump’s DOJ Could Release Jeffrey Epstein Files Today—What To Know As ‘Phase 1’ Binders Spotted",
    "description": "Attorney General Pam Bondi has suggested she’ll release “a lot of names” connected to the late financier.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/27/trumps-doj-could-release-jeffrey-epstein-files-today-what-to-know-as-phase-1-binders-spotted/",
    "timestamp": "2025-02-27T19:08:48Z"
  },
  {
    "title": "Pakistan considers ‘National Crypto Council’ to adopt digital currencies",
    "description": "The Finance Ministry of Pakistan is reportedly considering forming a National Crypto Council to explore the legalization of cryptocurrencies in the country.",
    "link": "https://cointelegraph.com/news/pakistan-crypto-council-adopt-digital-currencies",
    "timestamp": "2025-02-27T19:08:19Z"
  },
  {
    "title": "Starwood Property Trust Reports Robust Earnings, Criticizes Trump’s Tariff Policy",
    "description": "Starwood Property Trust ended 2024 with increased income and distributed earnings compared to 2023, as the firm leaned into a diversified investment strategy that Chairman Barry Sterlicht hopes will eventually help the firm defy the bounds of being a traditio…",
    "link": "http://commercialobserver.com/2025/02/starwood-property-trust-reports-strong-earnings-trumps-tariff-policy/",
    "timestamp": "2025-02-27T19:08:07Z"
  },
  {
    "title": "Computer Science Under Trump",
    "description": "Buckle up, because what’s coming next is unlikely to look like what came before.",
    "link": "http://cacm.acm.org/news/computer-science-under-trump/",
    "timestamp": "2025-02-27T19:06:41Z"
  },
  {
    "title": "Musk and Trump’s Fort Knox Trip Is About Bitcoin",
    "description": "More than a stunt, the Fort Knox visit might be a chance for the President to change the price of gold and dump the price hike into cryptocurrency.",
    "link": "https://gizmodo.com/musk-and-trumps-fort-knox-trip-is-about-bitcoin-2000569420",
    "timestamp": "2025-02-27T19:05:24Z"
  },
  {
    "title": "Florida Gov. DeSantis says Andrew Tate and brother Tristan are not welcome in the state",
    "description": "Florida Gov. Ron DeSantis said Thursday that Andrew and Tristan Tate, the influencer brothers who face charges in Romania of human trafficking and sexual intercourse with a minor, were not welcome in the state.",
    "link": "https://www.nbcnews.com/news/us-news/florida-gov-desantis-says-andrew-tate-brother-tristan-are-not-welcome-rcna194055",
    "timestamp": "2025-02-27T19:04:42Z"
  },
  {
    "title": "Please don’t leave: Metsola visits US to sing transatlantic praises",
    "description": "EU Parliament's chief makes the case that isolation is not so great",
    "link": "https://www.euractiv.com/section/politics/news/please-dont-leave-metsola-visits-us-to-sing-transatlantic-praises/",
    "timestamp": "2025-02-27T19:04:13Z"
  },
  {
    "title": "Generic brand groceries are winning big as inflation makes a comeback",
    "description": "Inflation is hitting consumers hard, and both grocery shoppers and restaurants are feeling the squeeze.Read more...",
    "link": "https://qz.com/inflation-groceries-generic-brands-walmart-restaurants-1851766829",
    "timestamp": "2025-02-27T19:04:00Z"
  },
  {
    "title": "FBI Director Kash Patel wants to bring the UFC to the FBI, sources say",
    "description": "Newly-installed FBI Director Kash Patel has proposed enhancing the FBI with help from the Ultimate Fighting Championship, say sources who were told of the proposal.",
    "link": "https://abcnews.go.com/US/fbi-director-kash-patel-bring-ufc-fbi-sources/story?id=119255318",
    "timestamp": "2025-02-27T19:03:27Z"
  },
  {
    "title": "Trump’s war on climate science is pushing us into a dystopian future",
    "description": "Withdrawing support for research and scrubbing climate data from US government websites has repercussions for Australia and the world. But there are ways around it.",
    "link": "https://theconversation.com/trumps-war-on-climate-science-is-pushing-us-into-a-dystopian-future-250891",
    "timestamp": "2025-02-27T19:02:57Z"
  },
  {
    "title": "Israel sends negotiators to Cairo to extend 1st phase of Gaza ceasefire",
    "description": "Israel announced on Thursday it was sending negotiators to Cairo for talks, seeking to extend a first phase of a ceasefire due to expire in two days, in the apparent aim of securing the release of more hostages while delaying any final deal on Gaza's future.",
    "link": "https://www.cbc.ca/news/world/israel-gaza-ceasefire-1.7470054",
    "timestamp": "2025-02-27T19:02:55Z"
  },
  {
    "title": "Donald Trump Reacts to News of Andrew Tate Returning to US",
    "description": "On Thursday, U.S. President Donald Trump responded to questions about Andrew and Tristan Tate's arrival in Florida.\nThe Tate brothers were being held in Romania, awaiting trial for their charges for human trafficking and forming a criminal gang to sexually ex…",
    "link": "https://biztoc.com/x/95a989fc7cd5e142",
    "timestamp": "2025-02-27T19:02:53Z"
  },
  {
    "title": "US lawmaker proposes $250 Trump bill",
    "description": "The proposal aims to commemorate the president’s economic policies with new currency denomination Read Full Article at RT.com",
    "link": "https://www.rt.com/business/613408-trump-featured-dollar-bill/",
    "timestamp": "2025-02-27T19:02:50Z"
  },
  {
    "title": "British PM Starmer at White House for Trump Meeting to Discuss Ukraine, Tariffs: Live updates",
    "description": "British Prime Minister Keir Starmer is visiting the White House to meet with President Donald Trump on Thursday.\nTheir meeting comes amid escalating tensions between the U.S. and Europe over Ukraine and Trump's tariffs.\nStarmer will be hoping to leverage the …",
    "link": "https://biztoc.com/x/680c4feb60a3f1ec",
    "timestamp": "2025-02-27T19:02:42Z"
  },
  {
    "title": "Trump is turning the United States into a Russian ally",
    "description": "At the United Nations on Monday, the United States' siding with Russia over Ukraine showed Trump's agenda to realign the global order.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/russia-trump-ukraine-united-nations-war-rcna193810",
    "timestamp": "2025-02-27T19:01:53Z"
  },
  {
    "title": "2:00PM Water Cooler 2/27/2025",
    "description": "~ Today's Water Cooler: Politics, Syndemics; <li>Executive Order details DOGE's Bolshevik-style structure and operation; DOGE as class war; Cuomo floats Presidential trial balloon; Employment figures warn of a souring economy ~</li>",
    "link": "https://www.nakedcapitalism.com/2025/02/200pm-water-cooler-2-27-2025.html",
    "timestamp": "2025-02-27T19:00:34Z"
  },
  {
    "title": "Business leaders turning on president -- fast...",
    "description": "Biden-era regulations are still standing, and new ideologically driven crackdowns and market-roiling policies are being piled on. The MAGA vibes are fading.",
    "link": "https://www.semafor.com/article/02/27/2025/american-business-leaders-are-turning-on-trump-fast",
    "timestamp": "2025-02-27T19:00:02Z"
  },
  {
    "title": "‘Defending our bodies and land’: Why the fight to protect the environment is a matter of life and death in Honduras",
    "description": "Increasing violence and US aid freeze leaves indigenous communities in Honduras vulnerable",
    "link": "https://www.irishtimes.com/world/americas/2025/02/27/defending-our-bodies-and-land-why-the-fight-to-protect-the-environment-is-a-matter-of-life-and-death-in-honduras/",
    "timestamp": "2025-02-27T19:00:01Z"
  },
  {
    "title": "Texas says doctor illegally treated trans youth. He says he followed the law",
    "description": "Texas is suing three doctors over claims that they violated the state’s ban on gender-affirming care for minors.",
    "link": "https://www.bostonherald.com/2025/02/27/texas-transgender-health-care-doctors/",
    "timestamp": "2025-02-27T18:59:42Z"
  },
  {
    "title": "A Backup Plan If Trump Ends Congestion Pricing? Um…",
    "description": "The Metropolitan Transportation Authority doesn’t have a whole lot of alternatives to make up the revenue from congestion pricing if President Donald Trump wins his battle against the Manhattan tolling program. The state agency has its largest capital plan in…",
    "link": "http://commercialobserver.com/2025/02/congestion-pricing-contingency-mta-trump/",
    "timestamp": "2025-02-27T18:59:13Z"
  },
  {
    "title": "Mexican president hopes to talk with Trump to avoid tariffs",
    "description": "Mexican President Claudia Sheinbaum said Thursday that she hoped to talk to her US counterpart Donald Trump as part of efforts to avoid being hit with his threatened tariffs. She spoke shortly after Trump wrote on social media that he would move ahead with im…",
    "link": "https://www.digitaljournal.com/world/mexican-president-hopes-to-talk-with-trump-to-avoid-tariffs/article",
    "timestamp": "2025-02-27T18:57:32Z"
  },
  {
    "title": "FBI: North Korea-linked TraderTraitor is responsible for $1.5 Billion Bybit hack",
    "description": "The FBI confirmed that North Korea is responsible for the record-breaking cyber heist at the crypto exchange Bybit. FBI links the recent Bybit hack to North Korea-linked group TraderTraitor as details of the $1.5B cyber heist emerge. Last week, the crypto exc…",
    "link": "https://securityaffairs.com/174735/cyber-crime/fbi-north-korea-responsible-bybit-hack.html",
    "timestamp": "2025-02-27T18:57:11Z"
  },
  {
    "title": "India-EU trade talks likely to focus on G7 diamond traceability, CBAM",
    "description": "India and the EU are focusing on trade talks addressing tariffs and regulatory issues, including diamond traceability and data security. The aim is to resolve differences in their free trade agreement negotiations. India's priorities include concessions on di…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-eu-trade-talks-likely-to-focus-on-g7-diamond-traceability-cbam/articleshow/118611097.cms",
    "timestamp": "2025-02-27T18:57:04Z"
  },
  {
    "title": "As bird flu spreads, feds might undercut states by firing scientists, removing data",
    "description": "The avian influenza virus has killed millions of wild birds and led to emergency culling of commercial flocks.",
    "link": "https://www.bostonherald.com/2025/02/27/bird-flu-scientists-data/",
    "timestamp": "2025-02-27T18:56:55Z"
  },
  {
    "title": "Taylor Swift is shaken and Travis Kelce has to step up to protect her amid recent controversies",
    "description": "After a period of reflection, Travis Kelce is set to return to the Kansas City Chiefs for his 13th NFL season -- but that is hardly the only tough decision he has to make this offs",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/02/27/67c09267e2704ea2998b45b1.html",
    "timestamp": "2025-02-27T18:54:26Z"
  },
  {
    "title": "Starmer Extends Invitation From King Charles For 'Unprecedented' Second State Visit to Britain",
    "description": "President hailed \"wonderful\" UK as he received invite for unprecedented second state visit, the first leader to ever be extended courtesy.\nThe post Starmer Extends Invitation From King Charles For ‘Unprecedented’ Second State Visit to Britain appeared first o…",
    "link": "https://www.breitbart.com/europe/2025/02/27/starmer-extends-invitation-from-king-charles-for-unprecedented-second-state-visit-to-britain/",
    "timestamp": "2025-02-27T18:54:16Z"
  },
  {
    "title": "Nvidia and Salesforce leave bulls wanting as AI trade stalls",
    "description": "Investors hoping that Nvidia Corp.’s earnings would rejuvenate the AI trade didn’t exactly get the report they wanted. Find out more.",
    "link": "https://financialpost.com/investing/nvidia-salesforce-bulls-wanting-ai-trade-stalls",
    "timestamp": "2025-02-27T18:54:13Z"
  },
  {
    "title": "Canada coach very tough on Trump: \"Enough with the ridiculous 51st state rhetoric\"",
    "description": "The United States, Mexico and Canada will jointly host the 2026 World Cup in the midst of diplomatic tensions between the three countries over the foreign and trade policies of Don",
    "link": "https://www.marca.com/en/football/2025/02/27/67c0988a22601d4e208b457d.html",
    "timestamp": "2025-02-27T18:53:50Z"
  },
  {
    "title": "Trump Signs Order to Implement DOGE 'Cost Efficiency Initiative'",
    "description": "President Donald Trump signed an executive order Wednesday to implement a cost-efficiency initiative within the Department of Government Efficiency.\nThe post Trump Signs Order to Implement DOGE ‘Cost Efficiency Initiative’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/27/donald-trump-signs-order-implement-doge-cost-efficiency-initiative/",
    "timestamp": "2025-02-27T18:53:50Z"
  },
  {
    "title": "Texas Strategic Bitcoin reserve bill advances to Senate floor",
    "description": "The recently re-flied Bitcoin strategic reserve bill in Texas has passed a committee vote and now advances to the Senate floor for a subsequent vote.",
    "link": "https://cointelegraph.com/news/texas-strategic-bitcoin-reserve-bill-advances-senate-floor",
    "timestamp": "2025-02-27T18:53:29Z"
  },
  {
    "title": "Donald Trump is 'unwell' as former staffer issues 'something is wrong' warning. Buried lede: Scaramucci [Obvious]",
    "description": "Donald Trump is 'unwell' as former staffer issues 'something is wrong' warning. Buried lede: Scaramucci",
    "link": "https://www.fark.com/comments/13578778/Donald-Trump-is-unwell-as-former-staffer-issues-something-is-wrong-warning-Buried-lede-Scaramucci",
    "timestamp": "2025-02-27T18:52:06Z"
  },
  {
    "title": "What to know about the economic blackout that boycotters are planning for Feb. 28 to protest corporate corruption",
    "description": "Protesters are planning an \"economic blackout\" for Feb. 28, and are calling for consumers to boycott major retailers for one day.",
    "link": "https://www.businessinsider.com/economic-blackout-boycott-protest-feb-28-2025-2",
    "timestamp": "2025-02-27T18:51:31Z"
  },
  {
    "title": "Thinking of not filing your tax return amid IRS cutbacks? Penalties can be costly, experts say",
    "description": "As the IRS faces cutbacks, some taxpayers are weighing whether to file returns this season.",
    "link": "https://www.nbcnews.com/business/personal-finance/thinking-not-filing-tax-return-irs-cutbacks-penalties-can-costly-rcna194084",
    "timestamp": "2025-02-27T18:51:26Z"
  },
  {
    "title": "Mexico Extradites Los Zetas Cartel Supreme Leaders Ahead of Meeting with U.S. Diplomats",
    "description": "Mexican authorities extradited the two supreme leaders of Los Zetas just hours before that country’s security cabinet was set to meet with U.S. Secretary of State Marco Rubio and his staff.\nThe post Mexico Extradites Los Zetas Cartel Supreme Leaders Ahead of …",
    "link": "https://www.breitbart.com/border/2025/02/27/mexico-extradites-los-zetas-supreme-leaders-ahead-of-meeting-between-top-diplomats/",
    "timestamp": "2025-02-27T18:50:47Z"
  },
  {
    "title": "Did Donald Trump's administration tell Elon Musk that he has stepped over the line? Here's what reports are saying",
    "description": "Elon Musk's team at DOGE demanded federal workers to submit weekly summaries, leading to White House pushback. Trump appeared to support Musk's stance, emphasizing accountability for federal employees. Musk expressed frustration but agreed to give workers ano…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-donald-trumps-administration-tell-elon-musk-that-he-has-stepped-over-the-line-heres-what-reports-are-saying/articleshow/118609590.cms",
    "timestamp": "2025-02-27T18:50:44Z"
  },
  {
    "title": "Elon Musk says 'Canada is not a real country' but used to work as a lumberjack here",
    "description": "Hundreds of thousands of Canadians have signed a petition to revoke the citizenship of Elon Musk, who holds dual citizenship in the U.S. and Canada. And, he appears to be a little upset about the idea.\r\n\"Canada is not a real country,\" the senior advisor to U.…",
    "link": "https://dailyhive.com/canada/elon-musk-canada-citizenship-lumberjack",
    "timestamp": "2025-02-27T18:50:44Z"
  },
  {
    "title": "JD Vance Could Doom the Post-Trump Right",
    "description": "The Republican Party must decide if it truly wishes to be led next by a man so deficient in character and capacity come 2028.\nThe post JD Vance Could Doom the Post-Trump Right first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/jd-vance-could-doom-the-post-trump-right/",
    "timestamp": "2025-02-27T18:50:34Z"
  },
  {
    "title": "Trump administration cutting USAID contracts by 90% – AP",
    "description": "The White House reportedly plans to halt $60 billion in foreign assistance Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613411-trump-cutting-most-usaid-grants/",
    "timestamp": "2025-02-27T18:50:31Z"
  },
  {
    "title": "Trump Distances Himself from Andrew Tate Extradition to US: ‘I Know Nothing’",
    "description": "Trump distanced himself from Andrew and Christian Tate, who are charged with human trafficking in Romania, after they arrived in Florida.\nThe post Trump Distances Himself from Andrew Tate Extradition to US: ‘I Know Nothing’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/trump-distances-himself-from-andrew-tate-extradition-to-us-i-know-nothing/",
    "timestamp": "2025-02-27T18:49:24Z"
  }
]