[
  {
    "title": "Asian markets bounce from selloff as US jobs beat forecasts",
    "description": "Asian markets rose Thursday to claw back some of the previous day’s hefty losses as investors tracked a bounce on Wall Street sparked by jobs data that soothed worries about the US economy. Signs that a majority of the US Supreme Court was sceptical about the…",
    "link": "https://www.digitaljournal.com/world/asian-markets-bounce-from-selloff-as-us-jobs-beat-forecasts/article",
    "timestamp": "2025-11-06T02:47:33Z"
  },
  {
    "title": "Erika Kirk Tells Fox News She Never Has and ‘Never Will’ Watch Footage of Husband Being Shot",
    "description": "Erika Kirk told Fox News she never has and \"never will\" watch the viral video of her husband, conservative activist Charlie Kirk, being shot and killed.\nThe post Erika Kirk Tells Fox News She Never Has and ‘Never Will’ Watch Footage of Husband Being Shot firs…",
    "link": "https://www.mediaite.com/media/erika-kirk-tells-fox-news-she-never-has-and-never-will-watch-footage-of-husband-being-shot/",
    "timestamp": "2025-11-06T02:43:07Z"
  },
  {
    "title": "Putin says Russia to take ‘reciprocal measures’ if US resumes nuclear tests",
    "description": "Putin tells ministers to offer 'proposals' on Russian nuclear weapons tests, days after Trump said US would test again.",
    "link": "https://www.aljazeera.com/news/2025/11/6/putin-says-russia-to-take-reciprocal-measures-if-us-resumes-nuclear-tests",
    "timestamp": "2025-11-06T02:41:52Z"
  },
  {
    "title": "Nvidia's Jensen Huang: 'China is going to win the AI race,' FT reports",
    "description": "Nvidia CEO Jensen Huang warned that China could overtake the US in the AI race, calling the nations “nanoseconds apart.” He urged America to lead by expanding its global developer base but cautioned that excluding China could harm long-term progress. Huang st…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/nvidias-jensen-huang-china-is-going-to-win-the-ai-race-ft-reports/articleshow/125121311.cms",
    "timestamp": "2025-11-06T02:41:40Z"
  },
  {
    "title": "'Not going to put up with it': Dems rush to seize momentum in Georgia after election wins",
    "description": "Decisive Democratic victories in Georgia and across the country on Tuesday have given the Democratic Party momentum ahead of the 2026 midterms, while Republicans are left grappling with how to quickly recenter voters’ affordability concerns.Democrats Alicia J…",
    "link": "https://www.rawstory.com/georgia-election-2674269851/",
    "timestamp": "2025-11-06T02:41:30Z"
  },
  {
    "title": "Michael Goodwin: Graceless sore winner Zohran Mamdani immediately drops his mask and declares war on NYC",
    "description": "Having fallen in love with the sound of his own voice and apparently convinced he is heaven-sent, a besotted Zohran Mamdani missed the warning that you never get a second chance to make a first impression.",
    "link": "https://nypost.com/2025/11/05/opinion/graceless-sore-winner-zohran-mamdani-immediately-drops-his-mask-and-declares-war-on-nyc/",
    "timestamp": "2025-11-06T02:35:59Z"
  },
  {
    "title": "Illegal Alien Trucker Was Facing 17 Years for Killing 3 in Freeway Crash; Now It’s Down to 10 Thanks to California Laws",
    "description": "The Biden administration’s border policies are still haunting us.An Indian illegal immigrant faces three counts of vehicular manslaughter with gross negligence and reckless driving for allegedly causing a collision last month on the westbound 10 Freeway in Sa…",
    "link": "https://freerepublic.com/focus/f-news/4350968/posts",
    "timestamp": "2025-11-06T02:35:50Z"
  },
  {
    "title": "Wall Street girds for life under Mamdani, worries about New York City's competitiveness",
    "description": "New York City's financial sector braces for a new era with Mayor Zohran Mamdani's election. Business leaders express apprehension about potential impacts on the city's competitiveness and appeal. While some hope for moderation, others worry about proposed tax…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-girds-for-life-under-mamdani-worries-about-new-york-citys-competitiveness/articleshow/125121093.cms",
    "timestamp": "2025-11-06T02:31:15Z"
  },
  {
    "title": "North Korea says antagonised by US sanctions, will respond",
    "description": "North Korea has strongly condemned new United States sanctions, calling them antagonistic. Pyongyang has vowed to retaliate against the measures imposed by the Donald Trump administration. Meanwhile, South Korea's intelligence agency indicates a strong possib…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/north-korea-says-antagonised-by-us-sanctions-will-respond/articleshow/125121049.cms",
    "timestamp": "2025-11-06T02:27:36Z"
  },
  {
    "title": "MTG Rips ‘Jealous’ AOC For Claiming She’s on ‘Revenge Tour’ Against Trump: ‘I Don’t Respect Her Very Much’",
    "description": "Rep. Marjorie Taylor Greene accused Rep. Alexandria Ocasio-Cortez of being \"jealous\" after Ocasio-Cortez claimed Greene was on a \"revenge tour\" against Trump.\nThe post MTG Rips ‘Jealous’ AOC For Claiming She’s on ‘Revenge Tour’ Against Trump: ‘I Don’t Respect…",
    "link": "https://www.mediaite.com/media/tv/mtg-rips-jealous-aoc-for-claiming-shes-on-revenge-tour-against-trump-i-dont-respect-her-very-much/",
    "timestamp": "2025-11-06T02:26:22Z"
  },
  {
    "title": "‘Don’t You Understand That?’ Trump Demands Senate GOP Leader End Filibuster So They ‘Can Screw the Democrats’",
    "description": "President Donald Trump demanded that Senate Republicans end the filibuster amid the ongoing government shutdown.\nThe post ‘Don’t You Understand That?’ Trump Demands Senate GOP Leader End Filibuster So They ‘Can Screw the Democrats’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/dont-you-understand-that-trump-demands-senate-gop-leader-end-filibuster-so-they-can-screw-the-democrats/",
    "timestamp": "2025-11-06T02:22:54Z"
  },
  {
    "title": "Can Trump deport Zohran Mamdani? MAGA world fumes after Democratic socialist’s stunning New York victory",
    "description": "Zohran Mamdani's historic win as New York's first Muslim mayor has ignited a fierce backlash from MAGA supporters online, who are accusing him of a \"left-wing takeover.\" Despite facing xenophobic and anti-Muslim attacks, Mamdani, a democratic socialist, is se…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-can-trump-deport-zohran-mamdani-maga-world-fumes-after-democratic-socialists-stunning-new-york-victory/articleshow/125120965.cms",
    "timestamp": "2025-11-06T02:19:44Z"
  },
  {
    "title": "New York's Zohran Mamdani ready to discuss cost of living with Trump",
    "description": "New York's mayor-elect Zohran Mamdani is ready to talk with President Donald Trump about the high cost of living. Mamdani, a Democratic socialist, won the election on promises to address inflation and grocery prices. He believes the president needs to deliver…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/new-yorks-zohran-mamdani-ready-to-discuss-cost-of-living-with-trump/articleshow/125120995.cms",
    "timestamp": "2025-11-06T02:18:55Z"
  },
  {
    "title": "3 Astronauts Delay Return to Earth Over Fears of Damaged Spaceship",
    "description": "A group of Chinese astronauts will have to wait a little longer for their return home from space.\nThe mission to bring Chen Dong, Chen Zhongrui and Wang Jie back to Earth from China's Tiangong...",
    "link": "https://www.eonline.com/news/1424703/astronauts-return-to-earth-delayed-over-spaceship-damage-concerns",
    "timestamp": "2025-11-06T02:16:28Z"
  },
  {
    "title": "US President Donald Trump, in Miami, brags about the economy despite an election-night rebuke",
    "description": "President Trump highlighted economic successes at the America Business Forum. He spoke of lower prices and a strong economy. This occurred after Republican election setbacks. Voters expressed worries about their finances. Trump emphasized the need to communic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/president-donald-trump-in-miami-brags-about-the-economy-despite-an-election-night-rebuke/articleshow/125120934.cms",
    "timestamp": "2025-11-06T02:12:03Z"
  },
  {
    "title": "The Means of Fashion: Zohran Mamdani Gets Garb From Stylist-to-the-Stars",
    "description": "Democratic socialist Zohran Mamdani and his wife have been working with a fashion stylist during his successful campaign to be New York City's next mayor\nThe post The Means of Fashion: Zohran Mamdani Gets Garb From Stylist-to-the-Stars first appeared on Media…",
    "link": "https://www.mediaite.com/politics/the-means-of-fashion-zohran-mamdani-gets-garb-from-stylist-to-the-stars/",
    "timestamp": "2025-11-06T02:06:13Z"
  },
  {
    "title": "Blue States Sue Education Dept. over Public Service Loan Forgiveness Excluding Support of Terrorism, Illegal Alien Aid",
    "description": "Nearly two dozen Democrat-led states and Washington, DC, filed a lawsuit against the Department of Education (DOE) on Monday over a recent rule change to the Public Service Loan Forgiveness (PSLF) student loan debt relief program.\nThe post Blue States Sue Edu…",
    "link": "https://www.breitbart.com/politics/2025/11/05/blue-states-sue-education-dept-change-public-service-loan-forgiveness/",
    "timestamp": "2025-11-06T02:05:41Z"
  },
  {
    "title": "Gov. Shapiro: Voters Sent Clear Message Rejecting Trump's 'Chaos'",
    "description": "On Wednesday on CNN's \"The Lead,\" Gov. Josh Shapiro (D-PA) said in Tuesday's election, voters sent a \"very clear message\" to Donald Trump, rejecting his \"chaos.\"\nThe post Gov. Shapiro: Voters Sent Clear Message Rejecting Trump’s ‘Chaos’ appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2025/11/05/gov-shapiro-voters-sent-clear-message-rejecting-trumps-chaos/",
    "timestamp": "2025-11-06T02:03:00Z"
  },
  {
    "title": "Leftward shift: Can Zohran Mamdani's welfare agenda soften hard-nosed US capitalism?",
    "description": "An openly socialist candidate was elected New York’s mayor in a deeply capitalist country. If his welfare agenda turns out to be fiscally sound, and doesn’t fleece the rich, it could plausibly change the politics of his party—and maybe America too.",
    "link": "https://www.livemint.com/opinion/online-views/zohran-mamdani-mayor-nyc-democratic-socialist-politics-us-new-york-trump-11762354154192.html",
    "timestamp": "2025-11-06T02:00:10Z"
  },
  {
    "title": "Mamdani Wants More Money Less Than 24 Hours After Getting Elected",
    "description": "Democratic New York City Mayor-elect Zohran Mamdani wasted no time turning his historic victory into another fundraising push Wednesday.",
    "link": "https://dailycaller.com/2025/11/05/zohran-mamdani-asking-donations-transition/",
    "timestamp": "2025-11-06T01:58:41Z"
  },
  {
    "title": "Trump warns of ‘communism in New York’ after Zohran Mamdani’s win, says US faces choice between ‘communism and common sense’",
    "description": "US President Donald Trump stated the United States lost sovereignty following Zohran Mamdani's election as New York's mayor. Trump predicted New York would become communist and declared Miami a refuge for those fleeing communism. He contrasted communism with …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-warns-of-communism-in-new-york-after-zohran-mamdanis-win-says-us-faces-choice-between-communism-and-common-sense/articleshow/125120805.cms",
    "timestamp": "2025-11-06T01:57:56Z"
  },
  {
    "title": "Trump’s Gerrymandering War Has Stalled",
    "description": "“None of this is good for Republicans,” one strategist said.",
    "link": "https://www.theatlantic.com/politics/2025/11/trumps-gerrymandering-war-stalled/684833/",
    "timestamp": "2025-11-06T01:55:03Z"
  },
  {
    "title": "Trump Says Biden Was 'Vicious On Crypto' But He's Ended The 'War' On The Industry: 'It Was Terrible'",
    "description": "President Donald Trump reiterated his support for the cryptocurrency industry on Wednesday, adding that the asset class takes significant pressure off the dollar.\nCrypto Does A Lot Of Good Things, Says Trump\nAt the America Business Forum in Miami, Trump state…",
    "link": "https://biztoc.com/x/fa4ec9dcda09d9de",
    "timestamp": "2025-11-06T01:53:19Z"
  },
  {
    "title": "Trump looms over COP, even after pulling US out of Paris Pact",
    "description": "The next UNFCCC COP will be held in Belem, Brazil, from November 10 to 25. Times couldn’t be tougher for the negotiations — even in 1992, when the UNFCCC was adopted in Rio de Janeiro, there was no questioning climate change. The negotiations were about commi…",
    "link": "https://indianexpress.com/article/opinion/columns/trump-looms-cop-pulling-us-paris-pact-10348573/",
    "timestamp": "2025-11-06T01:50:15Z"
  },
  {
    "title": "In New York, Zohran Mamdani crafted a campaign that went beyond identity — that’s how he won",
    "description": "The political establishment will scramble to understand a victory that is being termed improbable and remarkable.  What’s clear is this: Mamdani ran an impeccable campaign, rooted in consistency, creativity and commitment.",
    "link": "https://indianexpress.com/article/opinion/columns/new-york-zohran-mamdani-campaign-identity-won-10348572/",
    "timestamp": "2025-11-06T01:50:14Z"
  },
  {
    "title": "Jeffrey Epstein's Cellmate Claims The Late Financier Said He Was Offered Freedom If He Would Implicate Trump",
    "description": "Jeffrey Epstein's cellmate has shared details of their interaction behind bars, revealing shocking things the financier allegedly told him.",
    "link": "https://www.yahoo.com/news/articles/jeffrey-epsteins-cellmate-claims-financier-014545187.html",
    "timestamp": "2025-11-06T01:45:45Z"
  },
  {
    "title": "U.S. government shutdown to force air traffic reductions starting Friday",
    "description": "The U.S. Federal Aviation Administration said Wednesday that it was taking the extraordinary step of reducing air traffic by 10 per cent across 40 \"high-volume\" U.S. markets beginning Friday morning to maintain travel safety as air traffic controllers exhibit…",
    "link": "https://www.cbc.ca/news/world/government-shutdown-airports-air-trtaffic-reduced-9.6968702",
    "timestamp": "2025-11-06T01:42:37Z"
  },
  {
    "title": "It's the Economy, Not the East Wing, Stupid",
    "description": "The Democratic Party has reason to celebrate for the first time since President Donald Trump defiantly won reelection to a nonconsecutive term last year. Since then, the opposition party has been perpetually back-footed. But now, with major victories in the N…",
    "link": "https://biztoc.com/x/b90594ee990c231f",
    "timestamp": "2025-11-06T01:42:33Z"
  },
  {
    "title": "New York elites flock to Florida after Mamdani victory",
    "description": "New York millionaires are plotting their exit from the city after the election of Zohran Mamdani, the socialist who plans to increase the taxes of the rich. Mr Mamdani defeated Andrew Cuomo, the former governor, on Tuesday after mounting an eye-catching campa…",
    "link": "https://freerepublic.com/focus/f-news/4350962/posts",
    "timestamp": "2025-11-06T01:42:22Z"
  },
  {
    "title": "Trump ally Infantino to award first Fifa Peace Prize at World Cup draw in DC (Bryan Armen Graham/The Guardian)",
    "description": "Bryan Armen Graham / The Guardian:\nTrump ally Infantino to award first Fifa Peace Prize at World Cup draw in DC  — New Fifa Peace Prize announced on Wednesday - Infantino to present first award on 5 December - Ceremony set for World Cup draw in Washington  — …",
    "link": "https://www.memeorandum.com/251105/p161",
    "timestamp": "2025-11-06T01:40:03Z"
  },
  {
    "title": "It's the Economy, Not the East Wing, Stupid",
    "description": "According to polls, the economy remains the top issue for voters, who have increasingly soured on Trump's handling of it.",
    "link": "https://reason.com/2025/11/05/its-the-economy-not-the-east-wing-stupid/",
    "timestamp": "2025-11-06T01:39:11Z"
  },
  {
    "title": "Trump reiterates nuclear test announcement (VIDEO)",
    "description": "The US president has again promised to restart nuclear testing “immediately,” following President Vladimir Putin’s moratorium warning Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627396-trump-nuclear-tests-immediately/",
    "timestamp": "2025-11-06T01:38:54Z"
  },
  {
    "title": "Supreme Court justices appear skeptical of Trump's tariffs, but some may give leeway",
    "description": "The Supreme Court on Wednesday appeared skeptical of the president’s claim of unbounded tariff authority.",
    "link": "https://abcnews.go.com/US/supreme-court-justices-skeptical-trumps-tariffs-give-leeway/story?id=127239361",
    "timestamp": "2025-11-06T01:37:07Z"
  },
  {
    "title": "Trump calls out Mamdani's 'very angry' acceptance speech, warns communism 'never worked anywhere'",
    "description": "Trump reacts to November election results on Fox News, expressing disappointment with New Jersey outcomes while discussing government shutdown negotiations.",
    "link": "https://www.foxnews.com/media/trump-calls-out-nyc-mayors-very-angry-acceptance-speech-after-recent-election-victory",
    "timestamp": "2025-11-06T01:37:06Z"
  },
  {
    "title": "Sonoma County moves towards formalizing 'ICE-free zones' on county property",
    "description": "Following a nationwide trend taking hold in the Bay Area, Sonoma County is shaping rules to explicitly ban immigration agents from accessing county-owned properties during operations",
    "link": "https://www.pressdemocrat.com/2025/11/05/sonoma-county-considers-ban-on-ice-operations-at-county-buildings-and-land/",
    "timestamp": "2025-11-06T01:33:14Z"
  },
  {
    "title": "Expensive, noisy and delayed - but is the Army's new fighting vehicle any good?",
    "description": "Billed by the UK as a \"next generation\" fighting machine, the nearly £10m Ajax left 17 soldiers requiring treatment for hearing loss. A minister tells Sky News that the army \"have put those (issues) to bed\".",
    "link": "https://news.sky.com/story/expensive-noisy-and-delayed-but-is-the-armys-new-fighting-vehicle-any-good-13464710",
    "timestamp": "2025-11-06T01:33:00Z"
  },
  {
    "title": "Trump responds to Mamdani: 'He's off to a bad start'",
    "description": "Trump slammed New York City's incoming mayor on Wednesday.\nBRENDAN SMIALOWSKI/AFP via Getty Images\nPresident Donald Trump said New York City's incoming mayor, Zohran Mamdani, is \"off to a bad start.\"\nTrump had threatened to withhold federal funding if Mamdani…",
    "link": "https://biztoc.com/x/57badf525b676863",
    "timestamp": "2025-11-06T01:31:14Z"
  },
  {
    "title": "US Supreme Court casts doubt on legality of Trump's global tariffs",
    "description": "The U.S. Supreme Court is hearing arguments on President Donald Trump's tariffs. Justices are questioning the legality of using an emergency law for these tariffs. The Constitution grants Congress the power to issue tariffs. The court's decision could impact …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-casts-doubt-on-legality-of-trumps-global-tariffs/articleshow/125120596.cms",
    "timestamp": "2025-11-06T01:28:17Z"
  },
  {
    "title": "Jeffrey Epstein claimed prosecutors offered his freedom if he agreed to implicate Donald Trump: cellmate (Andy Tillett/New York Post)",
    "description": "Andy Tillett / New York Post:\nJeffrey Epstein claimed prosecutors offered his freedom if he agreed to implicate Donald Trump: cellmate  —  Jeffrey Epstein claimed New York federal prosecutors told him he could walk free if he agreed to implicate Donald Trump,…",
    "link": "https://www.memeorandum.com/251105/p159",
    "timestamp": "2025-11-06T01:25:00Z"
  },
  {
    "title": "How deep-sea mining could threaten a vital ocean food source",
    "description": "The race to mine battery minerals from the ocean floor would create a new stream of waste that could rob sea life of a critical food source, according to new research published today in the journal Nature Communications. That could have far-reaching effects a…",
    "link": "https://www.theverge.com/news/814694/deep-sea-mining-waste-battery-metals-research-trump",
    "timestamp": "2025-11-06T01:22:59Z"
  },
  {
    "title": "'Shut The F Up Forever': Charlamagne Tha God Shreds Van Jones Over 'Divisive' Mamdani Talk",
    "description": "The radio host knocked the CNN commentator for claiming that Mamdani \"missed an opportunity\" in his election victory speech.",
    "link": "https://www.huffpost.com/entry/charlamagne-tha-god-van-jones_n_690bdeafe4b0fbe8fbbd4634",
    "timestamp": "2025-11-06T01:22:36Z"
  },
  {
    "title": "Trump responds to Mamdani: 'He's off to a bad start'",
    "description": "Trump told Fox News that Mamdani gave \"a very angry speech\" on Tuesday night. The mayor-elect directly addressed Trump.",
    "link": "https://www.businessinsider.com/trump-mamdani-off-to-a-bad-start-nyc-mayor-election-2025-11",
    "timestamp": "2025-11-06T01:18:32Z"
  },
  {
    "title": "‘AI president’: Trump deepfakes glorify himself, trash rivals",
    "description": "In a parallel reality, Donald Trump reigns as king, fighter pilot, and Superman, and his political opponents are cast as criminals and laughingstocks — an unprecedented weaponization of AI imagery by a sitting American president. Trump has ramped up his use o…",
    "link": "https://www.digitaljournal.com/world/ai-president-trump-deepfakes-glorify-himself-trash-rivals/article",
    "timestamp": "2025-11-06T01:17:49Z"
  },
  {
    "title": "‘AI president’: Trump deepfakes glorify himself, trash rivals",
    "description": "Trump has used the content in his breathless social media commentary to glorify himself and skewer his critics.\nThe post ‘AI president’: Trump deepfakes glorify himself, trash rivals appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/ai-president-trump-deepfakes-glorify-himself-trash-rivals/article",
    "timestamp": "2025-11-06T01:17:49Z"
  },
  {
    "title": "Wall Street Journal editors warn election shows GOP 'heading for bigger problems in 2026'",
    "description": "President Donald Trump lost no time in deflecting blame for the GOP's shellacking at the ballot box around the country this week, claiming Republicans lost because of the shutdown and it wasn't his fault because he \"wasn't on the ballot.\"But that's really not…",
    "link": "https://www.rawstory.com/trump-2674269616/",
    "timestamp": "2025-11-06T01:14:25Z"
  },
  {
    "title": "Trump Pretends He’s ‘Delivering An Economic Miracle’",
    "description": "Apparently, Donald Trump thinks Tuesday’s Democratic tsunami is good news for him going forward.\n\"After last night's results the decision facing all Americans could not be more clear,” Trump droned. “Our opponents are offering an economic nightmare. We’re del…",
    "link": "https://crooksandliars.com/2025/11/trump-pretends-he-s-delivering-economic",
    "timestamp": "2025-11-06T01:13:49Z"
  },
  {
    "title": "Scott Jennings Mocked By CNN Panel After Declaring A Bad Night For Democrats",
    "description": "Loathsome CNN Trump supporter Scott Jennings tried to throw cold water on the Democratic tsunami Tuesday evening by whining it was actually a bad night for Democrats, causing the CNN panel to laugh in his face.\nI was flipping through Newsmax, to NBC Now to MS…",
    "link": "https://crooksandliars.com/2025/11/scott-jennings-laughed-cnn-panel-after",
    "timestamp": "2025-11-06T01:13:48Z"
  },
  {
    "title": "Climate-Friendly Mayors Find Hope in Trump’s Election Setback",
    "description": "The big wins by Democrats in Tuesday’s elections across the US turned into a rallying cry at an environmental conference in Rio de Janeiro.",
    "link": "https://financialpost.com/pmn/business-pmn/climate-friendly-mayors-find-hope-in-trumps-election-setback",
    "timestamp": "2025-11-06T01:12:33Z"
  },
  {
    "title": "World leaders to rally climate fight ahead of Amazon summit",
    "description": "World leaders meet Thursday in the Brazilian Amazon in an effort to show that climate change remains a top global priority despite broken promises and the United States shunning the gathering.   About 50 heads of state and government are expected in the rainf…",
    "link": "https://www.digitaljournal.com/world/world-leaders-to-rally-climate-fight-ahead-of-amazon-summit/article",
    "timestamp": "2025-11-06T01:12:20Z"
  },
  {
    "title": "Democrats won big on election night. Now they're wondering if they can win the shutdown.",
    "description": "A day after Democrats swept a series of off-year elections on Tuesday, Democratic senators have a complicated choice on the shutdown.",
    "link": "https://www.msnbc.com/msnbc/news/democrats-won-big-election-night-shutdown-rcna242224",
    "timestamp": "2025-11-06T01:11:58Z"
  },
  {
    "title": "Democrat election wins send an unmistakable warning to Republicans",
    "description": "Not only did Zohran Mamdani win in New York, but Democrats posted significant wins in Virginia and New Jersey, too.",
    "link": "https://www.japantimes.co.jp/commentary/2025/11/06/us-elections-send-republican-message/",
    "timestamp": "2025-11-06T01:09:00Z"
  },
  {
    "title": "Trump administration has revoked 80,000 non-immigrant visas, U.S. official says",
    "description": "President Donald Trump's administration has revoked around 80,000 non-immigrant visas since its inauguration on January 20 for offenses ranging from driving under the influence to assault and theft, a senior State Department official said on Wednesday. The ex…",
    "link": "https://japantoday.com/category/world/trump-administration-has-revoked-80-000-non-immigrant-visas-us-official-says1",
    "timestamp": "2025-11-06T01:08:54Z"
  },
  {
    "title": "'Made a compelling case': Trump gets key GOP Senator to flip-flop on 'nuking' filibuster",
    "description": "WASHINGTON — Some Republicans are ready to nuke the filibuster after their party's leader put pressure on them. President Donald Trump has tried to redraw congressional lines in red states to hold onto the narrow GOP majority in the House. Political analysts …",
    "link": "https://www.rawstory.com/raw-investigates/filibuster/",
    "timestamp": "2025-11-06T01:08:48Z"
  },
  {
    "title": "He tried to come back from exile. Now Andrew Cuomo’s career is over for good.",
    "description": "NEW YORK — Andrew Cuomo’s political career is ending where it began — with a failed mayoral race. Nearly 50 years ago, Cuomo served as an informal adviser to his father’s unsuccessful City Hall bid. Decades later, he is once again on the losing side. While 19…",
    "link": "https://freerepublic.com/focus/f-news/4350958/posts",
    "timestamp": "2025-11-06T01:05:54Z"
  },
  {
    "title": "Kansas mayor hit with criminal charges for allegedly voting as noncitizen in several elections",
    "description": "Kansas Attorney General Kris Kobach and Secretary of State Scott Schwab filed charges against Mayor Joe Ceballos for allegedly voting as a non-U.S. citizen.",
    "link": "https://www.foxnews.com/politics/kansas-mayor-hit-criminal-charges-allegedly-voting-noncitizen-several-elections",
    "timestamp": "2025-11-06T01:05:12Z"
  },
  {
    "title": "Trump’s report card is in a year after winning the election",
    "description": "A year after being elected, Donald Trump is running out of time to deliver on his biggest promise to voters.",
    "link": "https://www.smh.com.au/business/the-economy/a-report-card-on-the-trump-presidency-20251106-p5n851.html",
    "timestamp": "2025-11-06T01:00:34Z"
  },
  {
    "title": "CNN anchor pushes back on liberal critics: 'My job is not to take down Trump'",
    "description": "CNN anchor Kaitlan Collins defended her controversial 2023 town hall with President Donald Trump, stating that her job isn't to \"take down\" the president.",
    "link": "https://www.foxnews.com/media/cnn-anchor-pushes-back-liberal-critics-my-job-not-take-down-trump",
    "timestamp": "2025-11-06T01:00:25Z"
  },
  {
    "title": "Pennsylvania governor: 'Folks are tired of the chaos'...",
    "description": "In Pennsylvania, Democrats swept not only three state Supreme Court races, but every county seat in presidential swing counties like Bucks and Erie Counties, including sheriffs.",
    "link": "https://6abc.com/post/folks-are-tired-chaos-pa-gov-shapiro-reacts-democrats-big-election-night-wins/18118236/",
    "timestamp": "2025-11-06T01:00:17Z"
  },
  {
    "title": "MAGA Blame Game Erupts After Republicans Suffer Nationwide Losses...",
    "description": "President Donald Trump’s base is at each other’s throats after the GOP suffered crushing defeats in contests across the country on Tuesday. In the wake of...",
    "link": "https://www.thedailybeast.com/maga-blame-game-erupts-after-republicans-suffer-nationwide-losses/",
    "timestamp": "2025-11-06T01:00:17Z"
  },
  {
    "title": "Trump: I Think We Have Inflation 'Lower than a Normal Number,' 'Biggest Problem' Is GOP Doesn't Talk About It, Dems Lie",
    "description": "During an interview aired on Wednesday’s broadcast of the Fox News Channel’s “Special Report,” President Donald Trump said that while beef prices have to be lowered, we have inflation “down to a normal number right now, lower than a normal\nThe post Trump: I T…",
    "link": "https://www.breitbart.com/clips/2025/11/05/trump-i-think-we-have-inflation-lower-than-a-normal-number-biggest-problem-is-gop-doesnt-talk-about-it-dems-lie/",
    "timestamp": "2025-11-06T00:59:13Z"
  },
  {
    "title": "Hakeem Jeffries Dodges Fox News Question on Pelosi Calling Trump a ‘Vile Creature’",
    "description": "Hakeem Jeffries dodged multiple questions on Fox News about his predecessor Rep. Nancy Pelosi (D-CA) branding President Donald Trump a \"vile creature\"\nThe post Hakeem Jeffries Dodges Fox News Question on Pelosi Calling Trump a ‘Vile Creature’ first appeared o…",
    "link": "https://www.mediaite.com/media/hakeem-jeffries-dodges-fox-news-question-on-pelosi-calling-trump-a-vile-creature/",
    "timestamp": "2025-11-06T00:58:51Z"
  },
  {
    "title": "Trump's Voter ID Argument Has Us Convinced He's Never Done This Basic Thing",
    "description": "This is far from the first time he's made everyday errands sound like a foreign concept.",
    "link": "https://www.huffpost.com/entry/trump-groceries-voter-id_n_690bd45ce4b0fbe8fbbd4070",
    "timestamp": "2025-11-06T00:56:48Z"
  },
  {
    "title": "After Democrat Wins, Trump Tells Americans To Choose: COMMUNISM OR COMMON SENSE",
    "description": "\"Their party installed a communist as the mayor of the largest city in the nation,\" President Donald Trump said Wednesday.MIAMI, Florida — President Donald Trump warned Americans that they face two options after Tuesday night’s election losses to Democrats: c…",
    "link": "https://freerepublic.com/focus/f-news/4350954/posts",
    "timestamp": "2025-11-06T00:55:37Z"
  },
  {
    "title": "Supreme Court tariff case heats up — justices question Trump’s sweeping import duties, potential billions in refunds, and limits of presidential power",
    "description": "Supreme Court tariff case sparks debate over Trump’s sweeping import duties. Tariffs hit hundreds of goods and could cost billions. Lower courts said they might be illegal under IEEPA. Justices question if the president overstepped power. A ruling against cou…",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-tariff-case-heats-up-justices-question-trumps-sweeping-import-duties-potential-billions-in-refunds-and-limits-of-presidential-power/articleshow/125117382.cms",
    "timestamp": "2025-11-06T00:55:05Z"
  },
  {
    "title": "Top takeaways from the GOP election night shellacking",
    "description": "After getting creamed in elections across multiple states on Tuesday night, Republicans need to take a long, hard look at why Democrats' message is winning — while voters sour on the GOP.",
    "link": "https://nypost.com/2025/11/05/opinion/if-the-gop-wants-to-win-it-needs-to-make-its-tent-big-again/",
    "timestamp": "2025-11-06T00:53:20Z"
  },
  {
    "title": "US airports to cut 10% flights amid record government shutdown",
    "description": "Staff shortages among 13,000 air traffic controllers and 50,000 TSA agents have caused widespread delays, extended security lines, and operational strain",
    "link": "https://www.thehindubusinessline.com/economy/logistics/us-airports-to-cut-10-flights-amid-record-government-shutdown/article70246793.ece",
    "timestamp": "2025-11-06T00:52:08Z"
  },
  {
    "title": "From gas to groceries, has Trump kept his promise to tackle rising prices?",
    "description": "President Trump promised to bring down inflation. One year on from his victory, BBC Verify revisits some of his claims.",
    "link": "https://www.bbc.com/news/articles/ckgkl25734go",
    "timestamp": "2025-11-06T00:51:45Z"
  },
  {
    "title": "CNN Should Zip It on Trump Inflation Lectures After Bidenomics Blunder",
    "description": "Here’s a serious question: Who on God’s green earth made CNN believe it has the credibility to finger-wag at President Donald Trump over inflation after salivating over Bidenomics for four years?",
    "link": "https://newsbusters.org/blogs/business/joseph-vazquez/2025/11/05/cnn-should-zip-it-lecturing-trump-over-inflation-after",
    "timestamp": "2025-11-06T00:47:31Z"
  },
  {
    "title": "Trump Highlights Economic Bright Spots in American Business Forum Speech",
    "description": "President Donald Trump touted economic bright spots–including rising wages, lowering costs of goods, and falling interest rates–during his speech at the American Business Forum in Miami, Florida, on Wednesday.\nThe post Trump Highlights Economic Bright Spots i…",
    "link": "https://www.breitbart.com/politics/2025/11/05/trump-highlights-economic-bright-spots-in-american-business-forum-speech/",
    "timestamp": "2025-11-06T00:45:22Z"
  },
  {
    "title": "Inter Miami's Lionel Messi tells business conference that he's not focused on legacy yet",
    "description": "Lionel Messi already is considered the greatest soccer player ever. The Inter Miami star told a business conference on Wednesday that there will be a time to reflect on what he's done in his soccer life. “It’s not something I’ve thought about or worried about…",
    "link": "https://sports.yahoo.com/article/inter-miamis-lionel-messi-tells-004507074.html",
    "timestamp": "2025-11-06T00:45:07Z"
  },
  {
    "title": "Win for Democrats, with messages to both parties",
    "description": "Trump may not have been on the ballot, but the outcome is seen as a repudiation of his policies and rhetoric",
    "link": "https://www.thehindubusinessline.com/opinion/win-for-democrats-with-messages-to-both-parties/article70245341.ece",
    "timestamp": "2025-11-06T00:45:00Z"
  },
  {
    "title": "The Supreme Court's Tariffs Arguments Were a Bloodbath for Trump (Mark Joseph Stern/Slate)",
    "description": "Mark Joseph Stern / Slate:\nThe Supreme Court's Tariffs Arguments Were a Bloodbath for Trump … Going into Supreme Court arguments over President Donald Trump's tariffs on Wednesday, it was genuinely difficult to guess how the justices would rule.  Within minut…",
    "link": "https://www.memeorandum.com/251105/p156",
    "timestamp": "2025-11-06T00:45:00Z"
  },
  {
    "title": "Trump's bright view of the economy doesn't match what voters are seeing",
    "description": "Ahead of Tuesday’s elections, Donald Trump assured Americans that prices are coming down, the economy is picking up and the nation is flourishing.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trumps-bright-view-economy-doesnt-match-voters-say-seeing-rcna242093",
    "timestamp": "2025-11-06T00:43:36Z"
  },
  {
    "title": "'A devastating blow!' Supreme Court's tough questions for Trump lawyer shock CNN reporter",
    "description": "CNN reporter Erin Burnett appeared to be shocked by the Supreme Court's tough questions for President Donald Trump's lawyers on Wednesday during oral arguments in a case that could decide the fate of the president's signature economic policy. The court heard …",
    "link": "https://www.rawstory.com/erin-burnett-2674269669/",
    "timestamp": "2025-11-06T00:43:03Z"
  },
  {
    "title": "US Supreme Court justices appear sceptical of Trump’s sweeping unilateral tariffs",
    "description": "Both conservative and liberal justices questioned whether the 1977 International Emergency Economic Powers Act allows a president to levy duties traditionally reserved for Congress.",
    "link": "https://www.thehindubusinessline.com/news/world/conservative-us-supreme-court-justices-appear-sceptical-of-trumps-sweeping-unilateral-tariffs/article70246789.ece",
    "timestamp": "2025-11-06T00:41:16Z"
  },
  {
    "title": "‘Very angry speech’: Trump reacts to Mamdani’s victory speech, says NYC Mayor-elect must work with Washington",
    "description": "However, softening his stance toward Mamdani, Trump also said that he wants Mamdani “to do well” as he loves New York.",
    "link": "https://indianexpress.com/article/world/trump-on-mamdani-victory-speech-nyc-mayor-elect-must-work-with-washington-10348680/",
    "timestamp": "2025-11-06T00:36:53Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,351",
    "description": "Here are the key events from day 1,351 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/6/russia-ukraine-war-list-of-key-events-day-1351",
    "timestamp": "2025-11-06T00:36:03Z"
  },
  {
    "title": "Hakeem Jeffries dodges question on whether Mamdani is future of Democratic Party",
    "description": "House Minority Leader Hakeem Jeffries dodged a question on whether the self-proclaimed Democratic Socialist Zohran Mamdani is the future of the Democratic Party.",
    "link": "https://www.foxnews.com/politics/hakeem-jeffries-dodges-question-whether-mamdani-future-democratic-party",
    "timestamp": "2025-11-06T00:34:49Z"
  },
  {
    "title": "Last socialist mayor: Lagaurdia...",
    "description": "Last socialist mayor: Lagaurdia...\r\n\n \n \n \n (Top headline, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:THE NEW NEW YORK...\r\nWill Mamdani really have free buses?\r\nPRO-TRUMP BILLIONAIRE OFFERS OLIVE BRANCH...\r\nUPDATE: BIG WIN PROPELS NEWSOM...\r\nBANNON RIPS MA…",
    "link": "https://www.cityandstateny.com/opinion/2025/07/opinion-zohran-mamdani-socialist-menace/406916/",
    "timestamp": "2025-11-06T00:34:46Z"
  },
  {
    "title": "Are Christians being persecuted in Nigeria as Trump claims?",
    "description": "Donald Trump says thousands of Christians are being killed in Nigeria - where has he got the numbers from?",
    "link": "https://www.bbc.com/news/articles/cgqlzkdeeqjo",
    "timestamp": "2025-11-06T00:32:08Z"
  },
  {
    "title": "Trump Under Pressure to Ditch Nuclear Plans as Putin Preps for Possible Tests",
    "description": "More than a dozen US senators on Wednesday urged President Donald Trump to abort plans for a resumption of nuclear weapons testing, a call that came as Russian President Vladimir Putin directed his senior officials to draft proposals for possible new nuke tes…",
    "link": "https://www.rawstory.com/trump-nuclear-2674269713/",
    "timestamp": "2025-11-06T00:31:49Z"
  },
  {
    "title": "ATF’s New Form 1 Change Proposal Would Benefit Law-Abiding Firearms Purchasers",
    "description": "The Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) recently published proposed changes to what is commonly called ATF Form 1, the application to make or register a firearm regulated under the National Firearms Act (NFA). And unlike under the Biden …",
    "link": "https://www.thetruthaboutguns.com/atf-form-1-nfa-changes-2025/",
    "timestamp": "2025-11-06T00:30:00Z"
  },
  {
    "title": "Democrats’ big election wins showed they don’t need to hide their support for trans rights",
    "description": "Republicans repeated Trump's anti-trans strategy from 2024 and lost big. This should be instructive for Democrats.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/democrats-election-winners-trans-rights-rcna242214",
    "timestamp": "2025-11-06T00:27:36Z"
  },
  {
    "title": "Hegseth and Rubio share classified details on boat strikes with congressional leaders",
    "description": "Senators are expected to vote on a resolution that would require congressional approval for any strikes.",
    "link": "https://www.bostonherald.com/2025/11/05/trump-cartels-congress/",
    "timestamp": "2025-11-06T00:25:28Z"
  },
  {
    "title": "Trump: Losing tariffs would be 'devastating' for US",
    "description": "United States President Donald Trump said it would be \"devastating\" for the US if the Supreme Court decided to go against his tariffs.\"I heard the court case went well today, but I just heard that a l...",
    "link": "https://biztoc.com/x/74599722363ac2ef",
    "timestamp": "2025-11-06T00:24:51Z"
  },
  {
    "title": "Conservative justices sharply question Trump tariffs in high-stakes hearing",
    "description": "President Donald Trump's use of sweeping tariffs faced sharp questioning at the Supreme Court on Wednesday, in a case with major implications for the president's agenda and the global economy. A majority of justices, including several conservatives, expressed…",
    "link": "https://freerepublic.com/focus/f-news/4350950/posts",
    "timestamp": "2025-11-06T00:24:14Z"
  },
  {
    "title": "The Ongoing Fight For Justice Of Jeffrey Epstein Survivors",
    "description": "<a href=\"https://www.penguinrandomhouse.com/books/712958/nobodys-girl-by-virginia-roberts-giuffre/\"target=\"_blank\"   >Virginia Giuffre’s memoir, “Nobody’s Girl,”</a> is again shining a light on justice for the survivors of Jeffrey Epstein and Ghislaine Maxwel…",
    "link": "https://www.npr.org/2025/11/05/nx-s1-5600129/the-ongoing-fight-for-justice-of-jeffrey-epstein-survivors",
    "timestamp": "2025-11-06T00:22:12Z"
  },
  {
    "title": "Wednesday Night Open Thread",
    "description": "So last night was rather electrifying, and it kept me up until 3 am. Simply could not sleep. Even tried playing civ 7 and nothing worked. Finally nodded off and before I knew it too very mouthy jerks were all up in my face (actually standing on my head and ch…",
    "link": "https://balloon-juice.com/2025/11/05/wednesday-night-open-thread-86/",
    "timestamp": "2025-11-06T00:14:51Z"
  },
  {
    "title": "GOP Sen. Kennedy to Introduce Bills to Withhold Pay from Lawmakers During Government Shutdown",
    "description": "Sen. John Kennedy (R-LA) announced that he would be introducing two bills that would withhold paychecks from Congressional lawmakers during government shutdowns.\nThe post GOP Sen. Kennedy to Introduce Bills to Withhold Pay from Lawmakers During Government Shu…",
    "link": "https://www.breitbart.com/politics/2025/11/05/gop-sen-kennedy-to-introduce-bills-to-withhold-pay-from-lawmakers-during-government-shutdown/",
    "timestamp": "2025-11-06T00:14:37Z"
  },
  {
    "title": "Trump: Nigerians Drag Pastor Jerry Eze, Nathaniel Bassey Over Killing of Christians: “Charlatans”",
    "description": "Pastor Jerry Eze and Nathaniel Bassey face criticism from Nigerians for not using their platforms to speak out against the killings of Christians.",
    "link": "https://www.legit.ng/entertainment/celebrities/1681914-trump-nigerians-drag-pastor-jerry-eze-nathaniel-bassey-killing-christians-charlatans/",
    "timestamp": "2025-11-06T00:12:36Z"
  },
  {
    "title": "Trump Under Pressure to Ditch Nuclear Plans as Putin Preps for Possible Tests",
    "description": "More than a dozen US senators on Wednesday urged President Donald Trump to abort plans for a resumption of nuclear weapons testing, a call that came as Russian President Vladimir Putin directed his senior officials to draft proposals for possible new nuke tes…",
    "link": "https://www.commondreams.org/news/trump-nuclear-testing",
    "timestamp": "2025-11-06T00:11:32Z"
  },
  {
    "title": "Disney World Bows to Trump Government Order, Makes Park-Wide Change",
    "description": "This week, Walt Disney World Resort implemented a park-wide update in response to an order from United States President Donald Trump. Several guests reported noticing the change at Magic Kingdom Park, EPCOT, Disney’s Hollywood Studios, and Disney’s Animal Kin…",
    "link": "https://insidethemagic.net/2025/11/disney-world-bows-to-trump-government-order-makes-park-wide-change-jc1/",
    "timestamp": "2025-11-06T00:11:29Z"
  },
  {
    "title": "The resistance is ascendant — Donald Trump may still have a firm grip on the three branches ... (Dan Froomkin/Heads Up News)",
    "description": "Dan Froomkin / Heads Up News:\nThe resistance is ascendant  —  Donald Trump may still have a firm grip on the three branches of government, but he has lost the support of the American people.  —  The resistance is ascendant.  —  You can see it both in the elec…",
    "link": "https://www.memeorandum.com/251105/p154",
    "timestamp": "2025-11-06T00:10:00Z"
  },
  {
    "title": "Trump administration orders 10% of flights cut at major US airports due to shutdown",
    "description": "WASHINGTON/CHICAGO (Reuters) -U.S. Transportation Secretary Sean Duffy said on Wednesday that he would order 10% of flights at 40 major U.S. airports to be cut starting Friday unless a deal to end the federal government shutdown is reached. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/06/trump-administration-orders-10-of-flights-cut-at-major-us-airports-due-to-shutdown",
    "timestamp": "2025-11-06T00:10:00Z"
  },
  {
    "title": "After Skeptical Justices Grill Trump Administration Lawyer, President Declares, ‘I Heard the Court Case Went Well’",
    "description": "President Donald Trump suggested that the sweeping tariffs he has unilaterally imposed have a good chance of being upheld by the Supreme Court.\nThe post After Skeptical Justices Grill Trump Administration Lawyer, President Declares, ‘I Heard the Court Case We…",
    "link": "https://www.mediaite.com/media/tv/after-skeptical-justices-grill-trump-administration-lawyer-president-declares-i-heard-the-court-case-went-well/",
    "timestamp": "2025-11-06T00:09:48Z"
  },
  {
    "title": "Watch: Stephen Colbert Claims He's 'More Conservative' Than People Think",
    "description": "Left-wing NBC TV host Stephen Colbert is claiming that he's \"more conservative\" than people think despite a decade of trashing the right.\nThe post Watch: Stephen Colbert Claims He’s ‘More Conservative’ Than People Think appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/11/05/watch-stephen-colbert-claims-hes-more-conservative-than-people-think/",
    "timestamp": "2025-11-06T00:07:44Z"
  },
  {
    "title": "Kevin Kiley shares plans following Prop 50 passing",
    "description": "Republican Kevin Kiley plans to still run for office in Congress, but where is the bigger question after California voters approved new districts that split him from his constituency.",
    "link": "https://www.kcra.com/article/kevin-kiley-california-prop-50-whats-next/69267930",
    "timestamp": "2025-11-06T00:07:42Z"
  },
  {
    "title": "Arsenal fan Mamdani can't expect any easy wins - even the home games",
    "description": "Like his beloved Arsenal, Zohran Mamdani is on a winning streak. But he will have to fight hard for future victories, including within his own party.",
    "link": "https://news.sky.com/story/arsenal-fan-mamdani-cant-expect-any-easy-wins-even-the-home-games-13464708",
    "timestamp": "2025-11-06T00:06:00Z"
  },
  {
    "title": "Trump Rips Zohran Mamdani’s ‘Dangerous’ Victory Speech: ‘He Should Be Nice to Me’",
    "description": "President Donald Trump was not thrilled with Zohran Mamdani's victory speech, saying the next NYC mayor gave a \"dangerous\" and \"angry\" address to his fans.\nThe post Trump Rips Zohran Mamdani’s ‘Dangerous’ Victory Speech: ‘He Should Be Nice to Me’ first appear…",
    "link": "https://www.mediaite.com/politics/trump-rips-zohran-mamdanis-dangerous-victory-speech-he-should-be-nice-to-me/",
    "timestamp": "2025-11-06T00:05:14Z"
  }
]