[
  {
    "title": "Trump set to watch US Open final",
    "description": "US President Donald Trump plans to watch the men's final of the US Open tennis tournament in person in New York on Sunday, organizers have confirmed. Trump will attend as the guest of a client at the Arthur Ashe Stadium and will watch from their suite as Spai…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:250906-99-939484/",
    "timestamp": "2025-09-06T07:44:32Z"
  },
  {
    "title": "Uber and Uber Eats earn $402m revenue in NZ, pay less than $1m tax",
    "description": "Both operations make hefty payments to their US parent company.",
    "link": "https://www.nzherald.co.nz/business/uber-and-uber-eats-earn-402m-revenue-in-nz-pay-less-than-1m-tax/Y6Y44NTFCNBNXEUUYCABKHBX6Y/",
    "timestamp": "2025-09-06T07:43:41Z"
  },
  {
    "title": "US yet to approve any help following Afghanistan earthquake, sources say",
    "description": "WASHINGTON (Reuters) -Nearly a week after an earthquake killed more than 2,200 people in Afghanistan and left tens of thousands homeless, the United States has not taken the first step to authorize emergency aid, and it was unclear if it plans to help at all,…",
    "link": "https://www.thestar.com.my/news/world/2025/09/06/us-yet-to-approve-any-help-following-afghanistan-earthquake-sources-say",
    "timestamp": "2025-09-06T07:42:00Z"
  },
  {
    "title": "VUCA World Reality: Growth intact, but valuations look stretched",
    "description": "Investors must navigate the volatile market carefully. US tariffs will marginally impact India's GDP. India focuses on reforms to boost growth. GST rationalization can significantly boost demand. Growth is likely to pick up from Q2 FY26. Moderate returns are …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/vuca-world-reality-growth-intact-but-valuations-look-stretched/articleshow/123732185.cms",
    "timestamp": "2025-09-06T07:36:13Z"
  },
  {
    "title": "Trump Family-Linked WLFI Falls Flat At Launch —Here's How It Fares Against Memecoins Themed After President And First Lady Melania",
    "description": "The trading debut of the World Liberty Financial (WLFI) token has stirred headlines, redirecting focus toward other Trump family-affiliated cryptocurrencies that launched earlier in the year.\nThe Initial Frenzy\nPresident Donald Trump and First Lady Melania Tr…",
    "link": "https://biztoc.com/x/fd23781fc9c371bc",
    "timestamp": "2025-09-06T07:26:08Z"
  },
  {
    "title": "Joe Kennedy III blasts RFK Jr. after fiery Senate hearing, fueling Kennedy family infighting: ‘He must resign’",
    "description": "Joe Kennedy III HHS Secretary RFK Jr. was \"a threat to the health and well-being of every American.\"",
    "link": "https://www.foxnews.com/politics/joe-kennedy-iii-blasts-rfk-jr-after-fiery-senate-hearing-fueling-kennedy-family-infighting-he-must-resign?intcmp=tw_fnc&#038;taid=68bbbfdf2182d90001d70f34&#038;utm_campaign=trueanthem&#038;utm_medium=social&#038;utm_source=twitter",
    "timestamp": "2025-09-06T07:23:56Z"
  },
  {
    "title": "Editorial: Trump triumphs as crime plummets in DC",
    "description": "Over the first 20 days of the federal surge, carjackings fell by 87%. Robberies dropped 62%. The city even went 12 days without a homicide, which unfortunately didn’t happen often before this intervention.",
    "link": "https://www.bostonherald.com/2025/09/06/editorial-trump-triumphs-as-crime-plummets-in-dc/",
    "timestamp": "2025-09-06T07:18:58Z"
  },
  {
    "title": "Trump offers peace pipe. Modi responds. What next?",
    "description": "After a period of heightened tensions marked by sharp rhetoric, a sudden shift in tone has occurred between US President Donald Trump and India's Prime Minister Narendra Modi. Despite earlier criticisms and concerns over India's foreign policy, both leaders a…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-offers-peace-pipe-modi-responds-what-next/articleshow/123731928.cms",
    "timestamp": "2025-09-06T07:16:25Z"
  },
  {
    "title": "Once these recruits couldn't make the cut. Now they make up a quarter of Army troops.",
    "description": "Three years ago, the Army faced a recruitment crisis. Behind its recovery is a program for would-be soldiers who don't make the cut.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/06/how-army-troops-pumped-up-recruiting/85817160007/",
    "timestamp": "2025-09-06T07:01:06Z"
  },
  {
    "title": "US plans restrictions on imports of Chinese drones and heavy-duty vehicles",
    "description": "The US Commerce Department on Friday said it plans to issue rules as soon as this month to address national security risks involving information and communications technology that is integral to drones and their supply chain, as well as vehicles weighing more…",
    "link": "https://www.thehindubusinessline.com/news/world/us-plans-restrictions-on-imports-of-chinese-drones-and-heavy-duty-vehicles/article70018576.ece",
    "timestamp": "2025-09-06T06:57:31Z"
  },
  {
    "title": "U.S.-Ukraine Reconstruction Investment Fund Board Meeting",
    "description": "On September 3, U.S. Secretary of the Treasury Scott Bessent hosted the inaugural board meeting of the United States-Ukraine Reconstruction Investment Fund (\"the Fund\"). The Board approved key items to operationalize the Fund, including nominating the Chair o…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/09/ukraine-250905-treasury01.htm",
    "timestamp": "2025-09-06T06:57:06Z"
  },
  {
    "title": "Netanyahu prevents French president from visiting Tel Aviv over Palestinian state recognition dispute",
    "description": "Israeli prime minister Benjamin Netanyahu has rejected a request from French President Emmanuel Macron to visit the occupied Palestinian territories, insisting that Paris must first drop its planned recognition of a Palestinian state later this month at the U…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/09/mil-250904-presstv04.htm",
    "timestamp": "2025-09-06T06:56:39Z"
  },
  {
    "title": "US imposes sanctions on Palestinian groups seeking war crimes investigation against Israel",
    "description": "The United States has announced sanctions against three Palestinian human rights organizations that requested the International Criminal Court (ICC) to investigate Israel for genocide in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/09/mil-250905-presstv08.htm",
    "timestamp": "2025-09-06T06:56:31Z"
  },
  {
    "title": "US threatens Lebanon with 'new Israeli war' if Hezbollah stays armed: Report",
    "description": "US pressure is growing on Lebanon after the administration of President Donald Trump issued a warning to Beirut regarding the potential for a renewed Israeli military campaign should the Lebanese government fail to promptly disarm the Hezbollah resistance mov…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/09/mil-250905-presstv05.htm",
    "timestamp": "2025-09-06T06:56:31Z"
  },
  {
    "title": "North Korean leader vows to 'fully support' Russia as Putin hails 'special' ties",
    "description": "North Korea's leader Kim Jong-un has expressed readiness to \"fully support\" Russia, while Russian President Vladimir Putin called ties between the two countries \"special\".",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2025/dprk-250904-presstv01.htm",
    "timestamp": "2025-09-06T06:56:31Z"
  },
  {
    "title": "Decoding Trump’s diplomacy: A puzzle that is worth solving sooner rather than later",
    "description": "Targeting India over its energy trade with Russia has damaged Washington’s hard-won trust with New Delhi Read Full Article at RT.com",
    "link": "https://www.rt.com/india/624202-decoding-trumps-diplomacy-puzzle-that/",
    "timestamp": "2025-09-06T06:55:44Z"
  },
  {
    "title": "PM Modi attaches enormous importance to our partnership with the US: EAM Jaishankar",
    "description": "External Affairs Minister S Jaishankar addressed Prime Minister Narendra Modi's response to Donald Trump's comments. Modi affirmed the strong India-US partnership. Trump acknowledged the special relationship but expressed displeasure with Modi's recent action…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-attaches-enormous-importance-to-our-partnership-with-the-us-eam-jaishankar/articleshow/123731572.cms",
    "timestamp": "2025-09-06T06:45:18Z"
  },
  {
    "title": "Jaishankar to represent India at BRICS virtual summit on Monday",
    "description": "BRICS summit aims to address Trump administration's tariffs, with Brazil chairing the 10-member group including India, China, and Russia.",
    "link": "https://www.thehindubusinessline.com/news/world/jaishankar-to-represent-india-at-brics-virtual-summit-on-monday/article70018562.ece",
    "timestamp": "2025-09-06T06:36:08Z"
  },
  {
    "title": "Seriously guys, the the DOJ has already released everything relevant on the Epstein files [Fake]",
    "description": "Seriously guys, the the DOJ has already released everything relevant on the Epstein files",
    "link": "https://www.fark.com/comments/13801718/Seriously-guys-the-DOJ-has-already-released-everything-relevant-on-Epstein-files",
    "timestamp": "2025-09-06T06:35:00Z"
  },
  {
    "title": "Trump to host G20 at his Miami golf resort and renames Department of Defence as Department of War",
    "description": "Trump said the new name for the Department is ‘more appropriate’ and claimed that the previous name was ‘woke’.",
    "link": "https://www.thejournal.ie/trump-to-host-g20-at-his-miami-golf-resort-6809230-Sep2025/",
    "timestamp": "2025-09-06T06:19:31Z"
  },
  {
    "title": "Trump Tariffs: Gold, Tungsten And Uranium Exempted In New Order",
    "description": "President Donald Trump moved Friday to exempt graphite, tungsten, uranium, gold bullion and other metals from his country-based tariffs, while subjecting silicone products to the levies.\n\nThe changes are set to take effect on Monday under an executive order i…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariffs-gold-tungsten-and-uranium-exempted-in-new-order",
    "timestamp": "2025-09-06T06:13:07Z"
  },
  {
    "title": "PM Modi will not address General Debate at high-level UNGA session",
    "description": "Prime Minister Narendra Modi will not address the General Debate at the annual high-level session of the United Nations General Assembly later this month, according to a revised provisional list of speakers issued here.",
    "link": "https://www.thehindubusinessline.com/news/pm-modi-will-not-address-general-debate-at-high-level-unga-session/article70018645.ece",
    "timestamp": "2025-09-06T06:03:49Z"
  },
  {
    "title": "Trump Threatens Trade Actions After EU Fines Google Over Ads",
    "description": "Trump made his warning in a social media post Friday after the EU announced it was fining Google almost €3 billion ($3.5 billion) and as it ordered the...",
    "link": "https://finance.yahoo.com/news/trump-threatens-trade-actions-eu-194232715.html",
    "timestamp": "2025-09-06T06:01:10Z"
  },
  {
    "title": "Macron says 26 countries pledge troops as part of “reassurance force” to Ukraine, fueling tensions with Russia",
    "description": "France’s President Macron announced that 26 nations have pledged troops for a post-peace “reassurance force” in Ukraine, though details remain vague. Poland, Germany and Italy are among the participants, but Warsaw has already ruled out infantry deployment. M…",
    "link": "https://www.naturalnews.com/2025-09-06-macron-26-countries-pledge-deploy-troops-ukraine.html",
    "timestamp": "2025-09-06T06:00:00Z"
  },
  {
    "title": "Gustavo Petro condemns U.S. military strike on Venezuelan vessel as “murder”",
    "description": "Colombian President Gustavo Petro condemned a U.S. military strike that killed 11 people on a drug-laden vessel from Venezuela, calling it “murder” and a violation of proportional force. Petro argued that drug couriers are often poor youth exploited by cartel…",
    "link": "https://www.naturalnews.com/2025-09-06-petro-condemns-military-strike-on-venezuelan-vessel.html",
    "timestamp": "2025-09-06T06:00:00Z"
  },
  {
    "title": "Netanyahu rejects Hamas ceasefire proposal, threatens to level Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu has once again dismissed Hamas’ latest ceasefire proposal, which includes the phased release of all hostages held in the Gaza Strip, calling it “more spin by Hamas” and reiterating Israel’s demands for an immediate an…",
    "link": "https://www.naturalnews.com/2025-09-06-netanyahu-rejects-hamas-ceasefire-proposal-threatens-gaza.html",
    "timestamp": "2025-09-06T06:00:00Z"
  },
  {
    "title": "Putin extends invitation to Zelensky for Moscow talks as Ukraine rejects offer, pushing for neutral venue",
    "description": "Russian President Vladimir Putin publicly invited Ukrainian President Volodymyr Zelensky to Moscow for direct peace negotiations, citing optimism from his recent discussions with U.S. President Donald Trump. Putin credited Trump’s administration for pushing n…",
    "link": "https://www.naturalnews.com/2025-09-06-putin-invites-zelensky-moscow-talks-ukraine-rejects.html",
    "timestamp": "2025-09-06T06:00:00Z"
  },
  {
    "title": "Trump Says Hassett, Warsh And Waller Are Finalists For Fed Chair",
    "description": "President Donald Trump said he saw White House economic adviser Kevin Hassett, Federal Reserve Governor Christopher Waller and former Fed Governor Kevin Warsh as the finalists to replace the central bank’s chair, Jerome Powell.\n\n“You could say those are the t…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-says-hassett-warsh-and-waller-are-finalists-for-fed-chair",
    "timestamp": "2025-09-06T05:58:06Z"
  },
  {
    "title": "JOSH HAMMER: Trump’s National Guard Deployment And The Art Of The 80-20 Issue",
    "description": "Trump's proposal to deploy the National Guard isn't the flight of fancy of a would-be strongman. It's federalism functioning as the Founders intended.",
    "link": "https://dailycaller.com/2025/09/06/opinion-trumps-national-guard-deployment-and-the-art-of-the-80-20-issue-josh-hammer/",
    "timestamp": "2025-09-06T05:57:43Z"
  },
  {
    "title": "'We are the troops': Inside Chicago's split communities as Trump vows to deploy National Guard",
    "description": "Some locals are working to prevent youngsters from sliding into gangs, but others ask the troops to come sooner.",
    "link": "https://www.bbc.com/news/articles/c4gj489q6e0o",
    "timestamp": "2025-09-06T05:56:59Z"
  },
  {
    "title": "Trump extends hand of reconciliation towards India, Modi accepts",
    "description": "The US President said the two countries have a special relationship and there was nothing to worry about though he didn’t like what India was doing right now",
    "link": "https://www.thehindubusinessline.com/news/trump-extends-hand-of-reconciliation-towards-india-modi-accepts/article70018662.ece",
    "timestamp": "2025-09-06T05:56:55Z"
  },
  {
    "title": "Avi Shlaim: Trump has failed to grasp something fundamental about Netanyahu",
    "description": "Notoriously stingy Trump seems content to continue to bankroll Israel’s monstrous war machine, even as it is ethnically cleansing the West Bank and perpetrating genocide in Gaza",
    "link": "https://www.irishtimes.com/opinion/2025/09/06/avi-shlaim-trump-has-failed-to-grasp-something-fundamental-about-netanyahu/",
    "timestamp": "2025-09-06T05:54:00Z"
  },
  {
    "title": "Trump appears to mistake American flag for blanket during Oval Office ceremony",
    "description": "President Trump appeared confused when Tennessee Representative John Rose presented him with an American flag during Friday's, September 5, Oval Office signing ceremony. Trump initially responded as if the flag were a blanket before Rose clarified the gift's …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-appears-to-mistake-american-flag-for-blanket-during-oval-office-ceremony/articleshow/123730873.cms",
    "timestamp": "2025-09-06T05:52:17Z"
  },
  {
    "title": "Mike Jay · Priest of the Devil: On Shamanism",
    "description": "‘Shamanism’, as a concept, is of course a Western invention, and from the earliest cross-cultural encounters it was...",
    "link": "https://www.lrb.co.uk/the-paper/v47/n16/mike-jay/priest-of-the-devil",
    "timestamp": "2025-09-06T05:47:02Z"
  },
  {
    "title": "Elizabeth Warren Says Trump 'Turned Out To Be A Big Liar' As President's Family Reportedly Scores $5 Billion Crypto Windfall",
    "description": "On Friday, Sen. Elizabeth Warren (D-Mass.) once again attacked President Donald Trump, blasting him for broken promises on lowering costs while his family's crypto venture has reportedly swelled their fortune by billions.\nWarren Says Trump Raised Costs Instea…",
    "link": "https://biztoc.com/x/0975c5c1d08fe733",
    "timestamp": "2025-09-06T05:46:00Z"
  },
  {
    "title": "Trump says 2026 G20 summit will be held at his Miami-area golf club",
    "description": "After skipping this year’s G20 in South Africa, the US President says says his golf club is best spot for gathering",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-2026-g20-summit-will-be-held-at-his-miami-area-golf-club/article70018602.ece",
    "timestamp": "2025-09-06T05:39:40Z"
  },
  {
    "title": "What to know about Elon Musk's $US1 trillion payment package",
    "description": "Tesla's board has proposed a $US1 trillion ($1.52 trillion) compensation plan for CEO Elon Musk in what would be the largest corporate pay package in history.",
    "link": "https://www.abc.net.au/news/2025-09-06/elon-musk-1-trillion-tesla-payment-package-explained/105743354",
    "timestamp": "2025-09-06T05:36:48Z"
  },
  {
    "title": "Donald Trump orders return to the US 'War Department'",
    "description": "The US president’s latest effort to rebrand the military means the nation’s ‘Department of Defence’ will soon be the ‘Department of War’.",
    "link": "https://7news.com.au/news/world/donald-trump-orders-return-to-the-us-war-department-c-19927825",
    "timestamp": "2025-09-06T05:30:27Z"
  },
  {
    "title": "Another war in the making: Trump orders shoot-down of Venezuelan jets as F-35s deployed to Caribbean",
    "description": "President Trump deploys F-35 fighter jets to Puerto Rico and threatens to shoot down Venezuelan aircraft amid escalating Caribbean military standoff. Maduro mobilizes forces as US launches anti-drug operations targeting Venezuelan cartels",
    "link": "https://economictimes.indiatimes.com/news/international/us/another-war-in-the-making-trump-orders-shoot-down-of-venezuelan-jets-as-f-35s-deployed-to-caribbean/articleshow/123730587.cms",
    "timestamp": "2025-09-06T05:19:57Z"
  },
  {
    "title": "Second round of Putin-Trump talks possible in near future: Kremlin",
    "description": "The second round of talks between Russian President Vladimir Putin and U.S. President Donald Trump may take place in the near future, Kremlin Spokesman Dmitry Peskov said on Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/09/russia-250906-pdo01.htm",
    "timestamp": "2025-09-06T05:16:51Z"
  },
  {
    "title": "Alcaraz beats Djokovic at the U.S. Open and will meet Sinner for Grand Slam final",
    "description": "Sinner is trying to become the first repeat men's champion in New York since Roger Federer won the tournament five years in a row. Alcaraz hasn't dropped a set as he pursues his second U.S. Open title.",
    "link": "https://www.npr.org/2025/09/06/g-s1-87443/alcaraz-beats-djokovic-u-s-open",
    "timestamp": "2025-09-06T05:16:32Z"
  },
  {
    "title": "Trump’s Makeup-Slathered Hand Makes Appearance at Rose Garden Dinner",
    "description": "Trump’s Makeup-Slathered Hand Makes Appearance at Rose Garden Dinnerthedailybeast.com",
    "link": "https://www.thedailybeast.com/donald-trumps-makeup-slathered-hand-makes-appearance-at-rose-garden-dinner/",
    "timestamp": "2025-09-06T05:15:17Z"
  },
  {
    "title": "RFK Jr. sister calls on him to resign telling health secretary 'enough is enough' - NewsBreak",
    "description": "In a statement posted to her social media pages, Kerry Kennedy lambasted her brother for causing the ongoing turmoil within the CDC and. his attempts to re",
    "link": "https://www.newsbreak.com/share/4217162695911-rfk-jr-sister-calls-on-him-to-resign-telling-health-secretary-enough-is-enough?_f=app_share&amp;pd=0JFwDliV&amp;lang=en_US&amp;send_time=1757135224&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.35.0.34%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v1&amp;s=i2",
    "timestamp": "2025-09-06T05:09:19Z"
  },
  {
    "title": "Trump Signs Order To Designate Nations That Hold Americans As Sponsors Of Wrongful Detention",
    "description": "President Donald Trump on Friday signed an executive order that would let the US designate nations as state sponsors of wrongful detention, using the threat of associated sanctions to deter Americans from being detained abroad or taken hostage.",
    "link": "https://www.ndtvprofit.com/world/trump-signs-order-to-designate-nations-that-hold-americans-as-sponsors-of-wrongful-detention",
    "timestamp": "2025-09-06T05:06:59Z"
  },
  {
    "title": "U.S. yet to approve any help following Afghanistan earthquake, sources say",
    "description": "The lack of response underscores how President Donald Trump has forfeited decades of U.S. leadership of global disaster relief.",
    "link": "https://www.japantimes.co.jp/news/2025/09/06/world/us-no-afghanistan-aid/",
    "timestamp": "2025-09-06T05:04:00Z"
  },
  {
    "title": "Modi reciprocates Trump's assessment of India, US ties",
    "description": "Indian Prime Minister Narendra Modi responded to comments made by United States President Donald Trump about the \"special\" relationship between their two countries, saying that he reciprocated his pos...",
    "link": "https://biztoc.com/x/8b98ca90df2126d8",
    "timestamp": "2025-09-06T05:01:53Z"
  },
  {
    "title": "Will Trump have to run from the economy?",
    "description": "President Trump faces economic headwinds as lackluster job numbers and rising inflation threaten his political standing ahead of the midterm elections. A recent poll indicates a significant drop in his economic approval rating, with voters prioritizing inflat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/will-trump-have-to-run-from-the-economy/articleshow/123730345.cms",
    "timestamp": "2025-09-06T05:01:11Z"
  },
  {
    "title": "Volvo XC60: The whole hog",
    "description": "On its eighth year and second facelift, this hybrid SUV still has a lot going for it – great for long hauls with comfortable seats – but it’s those ingrained Volvo values that set it apart, writes Sean O’Grady",
    "link": "https://www.the-independent.com/life-style/motoring/volvo-xc60-hybrid-suv-2025-b2820866.html",
    "timestamp": "2025-09-06T05:01:00Z"
  },
  {
    "title": "Expert Predicts WLFI Going To $0 Without Sun’s Support, Panic Selling Looms",
    "description": "The launch of the World Liberty Financial platform’s native token, WLFI, was anticipated as a significant event in the cryptocurrency market, especially with backing from the Trump family.  However, just a day after its debut, the token’s price plummeted, spa…",
    "link": "http://www.newsbtc.com/news/expert-predicts-wlfi-going-to-0-without-suns-support-panic-selling-looms/",
    "timestamp": "2025-09-06T05:00:48Z"
  },
  {
    "title": "Nvidia says GAIN AI Act would restrict competition, likens it to AI Diffusion Rule",
    "description": "The AI Diffusion Rule and AI GAIN Act are attempts by Washington to prioritize American needs, ensuring domestic firms gain access to advanced chips while limiting China's ability to obtain high-end tech amid fears that the country would use AI capabilities t…",
    "link": "https://indianexpress.com/article/technology/nvidia-says-gain-ai-act-would-restrict-competition-likens-it-to-ai-diffusion-rule-10233352/",
    "timestamp": "2025-09-06T05:00:34Z"
  },
  {
    "title": "Pope ‘encouraged’ priest known for LGBT outreach to ‘continue ministry’ during private meeting",
    "description": "The private audience was officially announced by the Vatican, a signal that Pope Leo wanted the meeting to be made public.",
    "link": "https://www.thejournal.ie/pope-leo-has-private-audience-with-priest-known-for-lgbt-outreach-6807293-Sep2025/",
    "timestamp": "2025-09-06T05:00:03Z"
  },
  {
    "title": "The psychology of CEO loyalty to Trump",
    "description": "C-suites are conspicuously silent in the face of the president’s policy surprises",
    "link": "https://www.irishtimes.com/business/2025/09/06/the-psychology-of-ceo-loyalty-to-trump/",
    "timestamp": "2025-09-06T05:00:01Z"
  },
  {
    "title": "India, US have special ties, nothing to worry about: Trump",
    "description": "US President Donald Trump said India and the United States have a “special relationship” and there’s nothing to worry about as the two countries “just have moments on occasion”, amid current tensions between Washington and Delhi over tariffs and purchases of …",
    "link": "https://www.thehindubusinessline.com/news/india-us-have-special-ties-nothing-to-worry-about-trump/article70018554.ece",
    "timestamp": "2025-09-06T04:45:15Z"
  },
  {
    "title": "Thrust into the line of fire, Iranians worry about what comes next",
    "description": "A recent war between Israel and Iran left Tehran reeling. Israeli strikes targeted military and nuclear sites. Civilian casualties were high. Iran retaliated with missile strikes. A fragile ceasefire is in place. The conflict signals a dangerous escalation. M…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thrust-into-the-line-of-fire-iranians-worry-about-what-comes-next/articleshow/123730090.cms",
    "timestamp": "2025-09-06T04:42:18Z"
  },
  {
    "title": "Chicago's Mexican Independence Day celebrations shadowed by Trump’s threats for the city",
    "description": "President Donald Trump’s plan to dispatch National Guard troops and immigration agents into Chicago has put many Latino residents on edge",
    "link": "https://abcnews.go.com/US/wireStory/chicagos-mexican-independence-day-celebrations-shadowed-trumps-threats-125314687",
    "timestamp": "2025-09-06T04:38:12Z"
  },
  {
    "title": "Trump admits failure to end Russia-Ukraine war, calls it his ‘most difficult’ conflict",
    "description": "Donald Trump acknowledged his inability to resolve the Russia-Ukraine conflict, despite his initial optimism and relationship with Vladimir Putin. He admitted it was the \"most difficult\" conflict he faced, contrasting it with other global conflicts he claims …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-admits-failure-to-end-russia-ukraine-war-calls-it-his-most-difficult-conflict/articleshow/123730005.cms",
    "timestamp": "2025-09-06T04:36:39Z"
  },
  {
    "title": "Donald Trump orders ‘defence’ name change to ‘Department of War’",
    "description": "US president Donald Trump was expected to rebrand the Defence Department to the Department of War through an executive order late yesterday, a move that the administration has said more accurately reflects the mission of the men and women serving in uniform t…",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-orders-defence-name-change-to-department-of-war/a1957054295.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "RFK clashes with Republicans over vaccines in raucous hearing",
    "description": "Democrats and Republicans pushed US Health Secretary Robert F Kennedy Jr on his recent vaccine policies and their stark contrast to President Donald Trump’s successful first-term pandemic initiative to speed vaccine development during a combative Senate heari…",
    "link": "https://www.independent.ie/world-news/north-america/rfk-clashes-with-republicans-over-vaccines-in-raucous-hearing/a1350819456.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "Any Western soldiers in Ukraine would be ‘legitimate target’, warns Putin",
    "description": "Ukrainian president Volodymyr Zelensky said yesterday that thousands of foreign troops could be deployed to his country under post-war security guarantees, but Russian leader Vladimir Putin said Moscow would regard them as legitimate targets to attack.",
    "link": "https://www.independent.ie/world-news/europe/any-western-soldiers-in-ukraine-would-be-legitimate-target-warns-putin/a649172360.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "Mary Robinson condemns Gaza ‘genocide’ but steers clear of presidential comment as she is honoured in Dublin",
    "description": "Mary Robinson yesterday stayed firmly on the sidelines of the latest presidential election race as she received another prestigious honour, choosing to use her platform to speak out on what she condemned as the “unfolding genocide” in Gaza instead.",
    "link": "https://www.independent.ie/irish-news/mary-robinson-condemns-gaza-genocide-but-steers-clear-of-presidential-comment-as-she-is-honoured-in-dublin/a88331333.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "Mary Robinson condemns ‘unfolding genocide’ in Gaza, but steers clear of presidential comment as she is honoured in Dublin",
    "description": "Mary Robinson yesterday stayed firmly on the sidelines of the latest presidential election race as she received another prestigious honour, choosing to use her platform to speak out on what she condemned as the “unfolding genocide” in Gaza instead.",
    "link": "https://www.independent.ie/irish-news/mary-robinson-condemns-unfolding-genocide-in-gaza-but-steers-clear-of-presidential-comment-as-she-is-honoured-in-dublin/a88331333.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "Richard Curran: Trump’s America First policies will force Ireland to pivot from Boston to Berlin for our future growth",
    "description": "China’s president Xi Jinping glad-handing Kim Jong Un and Vladimir Putin on our screens during the week had more than a hint of a movie about it. Not so much a gathering of Bond villains as a scene from Austin Powers or The Naked Gun.",
    "link": "https://www.independent.ie/opinion/comment/richard-curran-trumps-america-first-policies-will-force-ireland-to-pivot-from-boston-to-berlin-for-our-future-growth/a1444407443.html",
    "timestamp": "2025-09-06T04:30:00Z"
  },
  {
    "title": "Deeply appreciate Trump's sentiments, says PM Modi after US President's 'good friends' comment",
    "description": "Prime Minister Narendra Modi affirmed the strong, forward-looking Comprehensive and Global Strategic Partnership between India and the United States, reciprocating President Trump's positive sentiments. Trump acknowledged a special relationship with India, de…",
    "link": "https://economictimes.indiatimes.com/news/india/india-us-have-a-positive-and-forward-looking-partnership-pm-modi-reciprocates-trumps-sentiments/articleshow/123729861.cms",
    "timestamp": "2025-09-06T04:26:42Z"
  },
  {
    "title": "Trump signs order offering some tariff exemptions to countries with US trade deals",
    "description": "President Trump signed an executive order to offer tariff exemptions to trading partners who secure deals on industrial exports like nickel, gold, pharmaceuticals, and chemicals. This move aims to reorder the global trading system and extract concessions thro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-order-offering-some-tariff-exemptions-to-countries-with-us-trade-deals/articleshow/123729860.cms",
    "timestamp": "2025-09-06T04:22:21Z"
  },
  {
    "title": "Did PM Modi's Nobel snub push Trump to put tariffs on India? US academic Terril Jones thinks so",
    "description": "Terril Jones analyzes India-US relations under Trump 2.0, highlighting Trump's negotiating tactics and desire for a Nobel Peace Prize related to India-Pakistan relations, which Prime Minister Modi denied. Jones notes Trump's use of tariffs in response. He als…",
    "link": "https://economictimes.indiatimes.com/news/india/did-pm-modis-nobel-snub-push-trump-to-put-tariffs-on-india-us-academic-terril-jones-thinks-so/articleshow/123729791.cms",
    "timestamp": "2025-09-06T04:15:31Z"
  },
  {
    "title": "CBS News Changes 'Face The Nation' Interview Policy Following Kristi Noem Complaints",
    "description": "Like the “60 Minutes” settlement, the policy change opens CBS News to charges that it is capitulating to Trump.",
    "link": "https://www.huffpost.com/entry/cbs-news-face-the-nation-interview-policy-kristi-noem_n_68bbb264e4b0a78951968b51",
    "timestamp": "2025-09-06T04:15:18Z"
  },
  {
    "title": "Trump Accuses Harry Truman of Going ‘Woke’ for Renaming Department of War",
    "description": "President Donald Trump accused those responsible for renaming the Department of War of going \"woke.\"\nThe post Trump Accuses Harry Truman of Going ‘Woke’ for Renaming Department of War first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-accuses-harry-truman-of-going-woke-for-renaming-department-of-war/",
    "timestamp": "2025-09-06T04:11:11Z"
  },
  {
    "title": "Wall Street’s wealth engine powers through job-market anxiety",
    "description": "Recent economic data reveals a concerning trend: job growth is slowing in America, impacting workers' financial security. However, investors anticipate the Federal Reserve will intervene to protect their assets. Despite a slight market dip, bonds have rallied…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-streets-wealth-engine-powers-through-job-market-anxiety/articleshow/123729738.cms",
    "timestamp": "2025-09-06T04:10:02Z"
  },
  {
    "title": "President Trump muddies water on Florida’s vaccine plan, ‘You have vaccines that work’",
    "description": "President Donald Trump said vaccines that work “should be used,” when asked to weigh in on a plan by Florida Gov. Ron DeSantis to end vaccine mandates in the state Friday.",
    "link": "https://www.clickorlando.com/news/politics/2025/09/06/president-trump-muddies-water-on-floridas-vaccine-plan-you-have-vaccines-that-work/",
    "timestamp": "2025-09-06T04:08:58Z"
  },
  {
    "title": "Trump's job market promises fall flat as hiring collapses and inflation ticks up",
    "description": "The U.S. job market has gone from healthy to lethargic during President Donald Trump’s first seven months back in the White House",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-job-market-promises-fall-flat-hiring-collapses-125314266",
    "timestamp": "2025-09-06T04:07:22Z"
  },
  {
    "title": "Trump Fired An Official Over A Weak Jobs Report. Another Brutal One Just Came Out",
    "description": "U.S. employers added just 22,000 jobs last month as the labor market continued to cool due to uncertainty over President Donald Trump’s economic policies.\nHiring decelerated from 79,000 in July, the Labor Department said Friday, and came in below the roughly …",
    "link": "https://biztoc.com/x/120844224bc4f21b",
    "timestamp": "2025-09-06T04:06:46Z"
  },
  {
    "title": "Trump Says ‘Nothing to Worry About’ With US-India Relationship",
    "description": "US President Donald Trump said there was “nothing to worry about” in his relationship with India, even as the US has pushed forward with a 50% tariff on many goods from the country to punish New Delhi for purchases of Russian energy.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-nothing-to-worry-about-with-us-india-relationship",
    "timestamp": "2025-09-06T04:06:27Z"
  },
  {
    "title": "European countries near Russia puzzled by US plans to cut defense funding",
    "description": "The Trump administration's plans to potentially halt security assistance funding to European countries bordering Russia have sparked confusion and concern. Baltic defense leaders claim they haven't received official notification of the cuts, which could impac…",
    "link": "https://economictimes.indiatimes.com/news/defence/european-countries-near-russia-puzzled-by-us-plans-to-cut-defense-funding/articleshow/123729696.cms",
    "timestamp": "2025-09-06T04:05:32Z"
  },
  {
    "title": "Trump administration seeks to break U.S. dependence on China and India for generic pharmaceuticals",
    "description": "Last month, President Donald Trump signed an executive order to restock the Strategic Active Pharmaceutical Ingredients Reserve (SAPIR) with critical drug components in order to ensure a secure domestic supply chain for critical medications.",
    "link": "https://justthenews.com/politics-policy/health/trump-administration-seeks-ways-have-pharmaceuticals-us-made-not-dependent",
    "timestamp": "2025-09-06T04:03:15Z"
  },
  {
    "title": "Trump's job market promises fall flat as hiring collapses and inflation ticks up",
    "description": "The U.S. job market has gone from healthy to lethargic during President Donald Trump’s first seven months back in the White House, as hiring has collapsed...",
    "link": "https://www.yahoo.com/news/articles/trumps-job-market-promises-fall-040156937.html",
    "timestamp": "2025-09-06T04:01:56Z"
  },
  {
    "title": "The Zionist Experiment Is Over",
    "description": "Contrary to the assertions of Scofield-duped Christian Zionist evangelicals, God gave NO everlasting unconditional promise of national perpetuity to the Old Covenant nation of Israel. God’s promises of blessings to Old Covenant Israel were conditional to Isra…",
    "link": "https://www.lewrockwell.com/2025/09/chuck-baldwin/the-zionist-experiment-is-over/",
    "timestamp": "2025-09-06T04:01:00Z"
  },
  {
    "title": "Making Palestinians Go Away",
    "description": "Donald Trump, recently sporting his red ballcap modestly featuring the words “Trump Was Right About Everything,” is apparently in regular contact with Israel’s genocidal Prime Minister Benjamin Netanyahu. Per Netanyahu, the most recent telephonic exchange had…",
    "link": "https://www.lewrockwell.com/2025/09/phil-giraldi/making-palestinians-go-away/",
    "timestamp": "2025-09-06T04:01:00Z"
  },
  {
    "title": "Only When We Know What Propaganda Is, And How It Works, Will We Be Free to Live Our Lives and Rule Ourselves",
    "description": "This article was first posted in 2022 but recently updated. For those of us who study propaganda critically, and seek to do this all-important work as public intellectuals, these last two years have been uniquely challenging, and even dangerous, forcing us in…",
    "link": "https://www.lewrockwell.com/2025/09/no_author/only-when-we-know-what-propaganda-is-and-how-it-works-will-we-be-free-to-live-our-lives-and-rule-ourselves/",
    "timestamp": "2025-09-06T04:01:00Z"
  },
  {
    "title": "Only When We Know What Propaganda Is, And How It Works, Will We Be Free to Live Our Lives and Rule Ourselves",
    "description": "This article was first posted in 2022 but recently updated. For those of us who study propaganda critically, and seek to do this all-important work as public intellectuals, these last two years have been uniquely challenging, and even dangerous, forcing us in…",
    "link": "https://www.lewrockwell.com/2025/09/no_author/only-when-we-know-what-propaganda-is-and-how-it-works-will-we-be-free-to-live-our-lives-and-rule-ourselves-2/",
    "timestamp": "2025-09-06T04:01:00Z"
  },
  {
    "title": "Trump can force China to choose peace",
    "description": "Two wars — Ukraine and Gaza — are killing civilians, destabilizing allies, and draining American power.  At their core stand Russia and Iran, two regimes that cannot survive without Beijing’s support.  If America...",
    "link": "https://www.americanthinker.com/blog/2025/09/trump_can_force_china_to_choose_peace.html",
    "timestamp": "2025-09-06T04:00:00Z"
  },
  {
    "title": "The ‘fortress belt’ Ukrainian cities in Putin’s crosshairs",
    "description": "A 50km defensive line shields a vast swathe of vulnerable Ukrainian territory and several big cities from Russia’s invasion force",
    "link": "https://www.irishtimes.com/world/europe/2025/09/06/the-fortress-belt-ukrainian-cities-in-putins-crosshairs/",
    "timestamp": "2025-09-06T04:00:00Z"
  },
  {
    "title": "Trump can’t be imitated. That’s why Dems hate him.",
    "description": "Does linoleum have anything to do with Donald Trump?  Yes, it does.  A lot.  \r\n\r\nI recently came upon an article about the effects the introduction of linoleum had on British society.  People were fascinated by...",
    "link": "https://www.americanthinker.com/blog/2025/09/trump_can_t_be_imitated_that_s_why_dems_hate_him.html",
    "timestamp": "2025-09-06T04:00:00Z"
  },
  {
    "title": "Who Defends Democracy?",
    "description": "For a long time now, Democrats have claimed that they are “defending democracy.”  Most recently, Barack Obama appeared at the Democratic National Committee summer meeting and ended his spiel with a plea to his audience to &ldquo...",
    "link": "https://www.americanthinker.com/articles/2025/09/who_defends_democracy.html",
    "timestamp": "2025-09-06T04:00:00Z"
  },
  {
    "title": "FAFO: Venezuela's Maduro about to learn the hard way about messing with Trump",
    "description": "Move over, Monroe Doctrine.\r\n\r\nThis is the age of eff around and find out (FAFO) for the Western Hemisphere with President Trump.\r\n\r\nWitness the festering boil on the South American continent, Venezuela, a self-colonized socialist hellhole effec...",
    "link": "https://www.americanthinker.com/blog/2025/09/fafo_venezuela_s_maduro_about_to_learn_the_hard_way_about_messing_with_trump.html",
    "timestamp": "2025-09-06T04:00:00Z"
  },
  {
    "title": "Nvidia says GAIN AI Act would restrict competition, likens it to AI Diffusion Rule",
    "description": "Short for Guaranteeing Access and Innovation for National Artificial Intelligence Act, the GAIN AI Act was introduced as part of the National Defense Authorization Act and stipulates that AI chipmakers prioritize domestic orders for advanced processors before…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-says-gain-ai-act-would-restrict-competition-likens-it-to-ai-diffusion-rule/articleshow/123729643.cms",
    "timestamp": "2025-09-06T03:59:23Z"
  },
  {
    "title": "Upcoming HHS report will link autism to common pain reliever, folate deficiency in pregnancy, Wall Street Journal reports",
    "description": "The report is said to highlight the pain reliever Tylenol, when taken during pregnancy, along with low levels of folate, a vitamin that is important for proper development of a",
    "link": "https://www.wpsdlocal6.com/health/upcoming-hhs-report-will-link-autism-to-common-pain-reliever-folate-deficiency-in-pregnancy-wall/article_8617e8ff-e7e1-4f28-b19f-b6b6455faf7c.html",
    "timestamp": "2025-09-06T03:56:32Z"
  },
  {
    "title": "'India-US Have Special Relationship': Trump Reaffirms Ties With Modi Despite Tariff Tensions",
    "description": "As trade tensions simmer between India and the United States amid an escalating tariff war, US President Donald Trump has struck a conciliatory tone regarding the broader relationship between the two nations. Responding to a question from ANI about the possib…",
    "link": "https://www.ndtvprofit.com/world/india-us-have-special-relationship-trump-reaffirms-ties-with-modi-despite-tariff-tensions",
    "timestamp": "2025-09-06T03:54:42Z"
  },
  {
    "title": "Mandelson: Trump is maverick 'risk taker' - and Brexit gave UK 'freedom'",
    "description": "Britain's ambassador to the United States will use a keynote speech today to underline the UK-US special relationship - while also attempting to 'Reform-proof' his own struggling government.",
    "link": "https://news.sky.com/story/mandelson-to-praise-trump-as-maverick-risk-taker-and-paint-brexit-as-liberating-force-13425899",
    "timestamp": "2025-09-06T03:53:00Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets brace for a week of pivotal economic data from the U.S., China, and Japan, alongside key central bank meetings. Investors are keenly awaiting the U.S. inflation report, influencing potential Federal Reserve rate cuts. Political uncertainties in…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/123729522.cms",
    "timestamp": "2025-09-06T03:46:54Z"
  },
  {
    "title": "Wall Street Week Ahead-Inflation data looms for markets as stocks hover at records",
    "description": "U.S. stock investors are bracing for a week filled with crucial inflation data amid tariff uncertainties and fluctuating government bond yields. Despite a strong year, the S&P 500 faces headwinds as valuations appear stretched and September historically poses…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-inflation-data-looms-for-markets-as-stocks-hover-at-records/articleshow/123729511.cms",
    "timestamp": "2025-09-06T03:44:39Z"
  },
  {
    "title": "Alcaraz beats Djokovic in straight sets; to meet Sinner for a blockbuster US Open final",
    "description": "Carlos Alcaraz defeated Novak Djokovic in straight sets, setting up a US Open final against Jannik Sinner. Sinner overcame Felix Auger-Aliassime to secure his spot. The final is a rematch of their rivalry, with the winner claiming the world number one ranking…",
    "link": "https://economictimes.indiatimes.com/news/sports/alcaraz-beats-djokovic-to-meet-sinner-for-a-blockbuster-us-open-final/articleshow/123729507.cms",
    "timestamp": "2025-09-06T03:43:48Z"
  },
  {
    "title": "US special forces killed North Korean civilians in botched 2019 mission: Report",
    "description": "A New York Times report alleged that U.S. Navy SEALs killed North Korean civilians during a covert mission in 2019, approved by then-President Trump, to plant a listening device. The incident occurred during sensitive diplomatic negotiations with Kim Jong Un,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-special-forces-killed-north-korean-civilians-in-botched-2019-mission-report/articleshow/123729506.cms",
    "timestamp": "2025-09-06T03:43:37Z"
  },
  {
    "title": "Trump's short list for Fed: Hassett, Warsh and Waller",
    "description": "President Trump is considering Kevin Hassett, Kevin Warsh, and Christopher Waller to succeed Jerome Powell as Federal Reserve chair, seeking leadership aligned with his interest-rate cut demands. Trump has criticized Powell's cautious approach, citing concern…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-short-list-for-fed-hassett-warsh-and-waller/articleshow/123729470.cms",
    "timestamp": "2025-09-06T03:41:07Z"
  },
  {
    "title": "Trump to blacklist countries for imprisoning Americans",
    "description": "Donald Trump, the US President, initiated a blacklist targeting nations that allegedly detain Americans unjustly. This move aims to impose harsh penalties, including travel bans. China, Iran, and Afghanistan are under scrutiny for potential inclusion. Sanctio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-blacklist-countries-for-imprisoning-americans/articleshow/123729462.cms",
    "timestamp": "2025-09-06T03:39:34Z"
  },
  {
    "title": "US Treasury Secretary Bessent calls for big changes at Fed",
    "description": "U.S. Treasury Secretary Scott Bessent has urged a thorough review of the Federal Reserve, questioning its interest rate authority. He criticized the Fed's policies for allegedly fueling inflation and benefiting the wealthy, advocating for a shift in focus tow…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-treasury-secretary-bessent-calls-for-big-changes-at-fed/articleshow/123729451.cms",
    "timestamp": "2025-09-06T03:38:31Z"
  },
  {
    "title": "Venezuela Starts Preparing for ‘Armed Struggle,’ In Case of Attack - Maduro",
    "description": "Venezuelan President Nicolas Maduro has warned that if his country is attacked, it will move into a phase of active military preparedness to defend its national integrity and sovereignty.",
    "link": "https://sputnikglobe.com/20250906/venezuela-starts-preparing-for-armed-struggle-in-case-of-attack---maduro-1122737594.html",
    "timestamp": "2025-09-06T03:38:00Z"
  }
]