[
  {
    "title": "US ready for possible Iran strikes as Trump weighs options, reports say",
    "description": "Donald Trump has yet to make a final decision on whether to carry out an attack, according to US news outlets",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/19/us-ready-for-possible-iran-strikes-as-trump-weighs-options-reports-say/",
    "timestamp": "2026-02-19T07:37:23Z"
  },
  {
    "title": "Nationality at the Olympics: Does it matter?",
    "description": "When athletes born in one place compete for another, a conversation around nationality and identity soon follows. But what does it mean? After winning gold in Italy, becoming the first South American to win a Winter Olympic medal, Lucas Pinheiro Braathen said…",
    "link": "https://www.dw.com/en/nationality-at-the-olympics-does-it-matter/a-75990565",
    "timestamp": "2026-02-19T07:37:00Z"
  },
  {
    "title": "Trump announces $33 billion power plant for Portsmouth, Ohio",
    "description": "Portsmouth, Ohio, has been selected as the site of a new natural-gas fired power plant that will be the largest of its kind in the world, according to the President Donald Trump and the U.S. Department of Commerce.",
    "link": "https://www.herald-dispatch.com/business/trump-announces-33-billion-power-plant-for-portsmouth-ohio/article_1ffd3ecf-078e-4104-81b9-4be65c68f5b2.html",
    "timestamp": "2026-02-19T07:35:50Z"
  },
  {
    "title": "Trump kicks off his 'Board of Peace' with eye on Gaza",
    "description": "US President Donald Trump is gathering allies to inaugurate the 'Board of Peace', his new institution focused on progress on Gaza but whose ambitions reach much further.",
    "link": "https://www.rte.ie/news/world/2026/0219/1559262-board-peace-us/",
    "timestamp": "2026-02-19T07:30:40Z"
  },
  {
    "title": "Donald Trump sends fighter jets to Middle East amid ‘90% chance of war’ with Iran",
    "description": "The president is said to be getting 'fed up'",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-iran-war-fighter-jets-military-285475-20260219",
    "timestamp": "2026-02-19T07:30:22Z"
  },
  {
    "title": "Israeli sources: US ready for attack, waiting for Trump",
    "description": "US forces 'locked and ready' for widescale strike on Iran, sources say.",
    "link": "https://www.israelnationalnews.com/news/422647",
    "timestamp": "2026-02-19T07:29:02Z"
  },
  {
    "title": "Greenland row reopens after US senator calls Danish PM 'little lady' [Lindsey Graham]",
    "description": "A senior US senator clashed with Danish and Greenlandic leaders on the margins of the Munich Security Conference last week, refueling fears that the US appetite for the Arctic island has not faded. Tensions in US-Danish relations had calmed after Donald Trump…",
    "link": "https://freerepublic.com/focus/f-backroom/4367435/posts",
    "timestamp": "2026-02-19T07:24:54Z"
  },
  {
    "title": "Newsmax Guest Cooks Up Absolutely Wild Plan To Test U.S. Olympians ‘Patriotism’",
    "description": "Evita Duffy-Alfonso, the daughter of Trump Transportation Secretary Sean Duffy and Fox News’ Rachel Campos-Duffy, drew condemnation online.",
    "link": "https://www.huffpost.com/entry/newsmax-olympics-patriotism_n_6996b215e4b0cc086c6f9f5c",
    "timestamp": "2026-02-19T07:21:39Z"
  },
  {
    "title": "Asian shares advance, tracking a Wall St rally led by Nvidia",
    "description": "Asian shares are mostly higher after U.S. stocks advanced, led by computer chip giant Nvidia",
    "link": "https://abcnews.com/Business/wireStory/asian-shares-advance-tracking-wall-st-rally-led-130288867",
    "timestamp": "2026-02-19T07:17:38Z"
  },
  {
    "title": "Exclusive-Top European spies sceptical US will clinch Ukraine peace deal this year",
    "description": "MUNICH, Feb 19 (Reuters) - European intelligence chiefs are pessimistic about the chances of ⁠an agreement being reached this year to end Russia's war in Ukraine, despite Donald Trump's assertions that U.S.-brokered talks have brought the prospect of a deal \"…",
    "link": "https://www.thestar.com.my/news/world/2026/02/19/exclusive-top-european-spies-sceptical-us-will-clinch-ukraine-peace-deal-this-year",
    "timestamp": "2026-02-19T07:14:00Z"
  },
  {
    "title": "Trump tells Starmer Chagos handover is ‘big mistake’ day after US backed deal",
    "description": "British prime minister Keir Starmer faces another round of US diplomacy after Donald Trump attacked the UK’s Chagos Islands deal a day after his administration said he supported it.",
    "link": "https://www.independent.ie/world-news/north-america/trump-tells-starmer-chagos-handover-is-big-mistake-day-after-us-backed-deal/a1626638211.html",
    "timestamp": "2026-02-19T07:06:02Z"
  },
  {
    "title": "Trump Has Prepared Speech On Extraterrestrial Life",
    "description": "According to Lara Trump, Donald Trump has prepared but not yet delivered a speech about extraterrestrial life, though the White House says such a speech would be \"news to me.\" White House Spokesperson Karoline Leavitt continued: \"I'll have to check in with ou…",
    "link": "https://entertainment.slashdot.org/story/26/02/19/016247/trump-has-prepared-speech-on-extraterrestrial-life",
    "timestamp": "2026-02-19T07:00:00Z"
  },
  {
    "title": "Trump kicks off his Board of Peace, with eye on Gaza and beyond",
    "description": "Around two dozen world leaders or other senior officials have headed to Washington for the meeting, but virtually none of the European democrats that traditionally sign on to US initiatives has made the trip.",
    "link": "https://www.channelnewsasia.com/world/board-peace-meeting-donald-trump-kicks-gaza-israel-5939801",
    "timestamp": "2026-02-19T06:58:55Z"
  },
  {
    "title": "Grandmother tells Trump critics to 'get off the man's back' during White House Black History Month event",
    "description": "A woman who lost her grandson to gun violence defended President Trump at this year's White House Black History Month event, telling critics to \"get off the man's back.\"",
    "link": "https://www.foxnews.com/politics/grandmother-tells-trump-critics-get-off-mans-back-during-white-house-black-history-month-event",
    "timestamp": "2026-02-19T06:47:57Z"
  },
  {
    "title": "Hamas tightens grip in Gaza as Trump pushes peace plan",
    "description": "Hamas is consolidating its power in Gaza. The group is placing loyalists in key government positions and collecting taxes. This move is raising doubts about U.S. President Donald Trump's peace plan. The plan requires Hamas to disarm. An Israeli military asses…",
    "link": "https://economictimes.indiatimes.com/news/defence/hamas-tightens-grip-in-gaza-as-trump-pushes-peace-plan/articleshow/128543723.cms",
    "timestamp": "2026-02-19T06:47:39Z"
  },
  {
    "title": "Rs 3 lakh crore selloff! Sensex tanks 700 pts, Nifty below 25,650. Key reasons behind the plunge",
    "description": "Indian markets slumped on Thursday as Nifty and Sensex reversed early gains, dragged down by heavy selling across banking, metal, auto and FMCG stocks. Investor wealth fell by ₹2.73 lakh crore. A hawkish US Fed outlook and a sharp rise in crude prices further…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-down-today-rs-3-lakh-crore-selloff-sensex-tanks-700-pts-nifty-below-25650-4-factors-behind-the-plunge/articleshow/128543605.cms",
    "timestamp": "2026-02-19T06:47:31Z"
  },
  {
    "title": "U.S. to Redirect Venezuelan Oil Royalties Into a Treasury-Controlled Fund",
    "description": "Energy companies that want to produce crude oil in Venezuela will be paying local taxes and fees to the Venezuelan government, but royalty payments and federal taxes will go into a fund managed by the United States, the Treasury Department has said. Citing a …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-to-Redirect-Venezuelan-Oil-Royalties-Into-a-Treasury-Controlled-Fund.html",
    "timestamp": "2026-02-19T06:45:00Z"
  },
  {
    "title": "Trump kicks off his 'Board of Peace', with eye on Gaza and beyond",
    "description": "Around two dozen world leaders or other senior officials have come to Washington for the meeting, including several of Trump’s authoritarian-leaning friends.",
    "link": "https://www.thejournal.ie/trump-kicks-off-his-board-of-peace-with-eye-on-gaza-and-beyond-6961179-Feb2026/",
    "timestamp": "2026-02-19T06:39:24Z"
  },
  {
    "title": "US tells Iran to do deal as Trump hints at strikes",
    "description": "The White House has warned that Iran would be \"wise\" to do a deal with the United States as President Donald Trump once again hinted at military action.",
    "link": "https://www.rte.ie/news/middle-east/2026/0219/1559257-iran-us-talks/",
    "timestamp": "2026-02-19T06:35:13Z"
  },
  {
    "title": "Starmer’s Chagos Islands headache",
    "description": "If the US president wishes to use the Diego Garcia base for his next attack, he will need Keir Starmer’s approval",
    "link": "https://www.irishtimes.com/world/2026/02/19/will-donald-trump-use-the-chagos-islands-to-bomb-iran/",
    "timestamp": "2026-02-19T06:35:03Z"
  },
  {
    "title": "Trump gathers members of Board of Peace for first meeting, with some U.S. allies wary",
    "description": "President Donald Trump will gather Thursday with representatives from more than two dozen countries that have joined his Board of Peace, for a meeting that will focus on the reconstruction of Gaza.",
    "link": "https://www.npr.org/2026/02/19/nx-s1-5719053/trump-gathers-members-board-of-peace-first-meeting",
    "timestamp": "2026-02-19T06:30:21Z"
  },
  {
    "title": "Trump family courts TradFi giants at Mar-a-Lago crypto mixer",
    "description": "Crypto and finance executives mingled with regulators and lawmakers at a crypto event hosted by the Trump family, which announced another deal expanding its crypto empire.",
    "link": "https://cointelegraph.com/news/crypto-tradfi-execs-mingle-trump-crypto-event",
    "timestamp": "2026-02-19T06:20:31Z"
  },
  {
    "title": "America’s Byzantine turn",
    "description": "The real choice Europe faces is not between America and autonomy, or integration and sovereignty – nor between more Europe and less. It is between institutions that constrain conflict and forces that produce it, writes Ranier Fsadni",
    "link": "https://timesofmalta.com/article/america-byzantine-turn.1124255",
    "timestamp": "2026-02-19T06:18:19Z"
  },
  {
    "title": "European stocks set to open mixed with earnings due from Nestle, Airbus",
    "description": "European stocks are expected to open in mixed territory on Thursday as investors await further earnings reports.",
    "link": "https://www.cnbc.com/2026/02/19/european-markets-stoxx-600-ftse-dax-cac-nestle-earnings.html",
    "timestamp": "2026-02-19T06:09:33Z"
  },
  {
    "title": "Not Forgetting the Victims: Club Epstein and Crimes Against Humanity",
    "description": "With a sex trafficking, flesh peddling empire of favours, logistics and the good time to be had by the powerful, the gigantic scale of Jeffrey Epstein’s criminal network continues to disturb. The least savoury digital library on the planet, …\nThe post Not For…",
    "link": "https://www.globalresearch.ca/club-epstein-crimes-against-humanity/5916445",
    "timestamp": "2026-02-19T06:06:59Z"
  },
  {
    "title": "Donald Trump vil opkalde lufthavn efter sig selv",
    "description": "Præsidenten vil have Palm Beach International Airport i Florida omdøbt til 'President Donald J. Trump International Airport'.",
    "link": "https://www.bt.dk/udland/donald-trump-vil-opkalde-lufthavn-efter-sig-selv",
    "timestamp": "2026-02-19T06:03:35Z"
  },
  {
    "title": "‘Proof of concept’? What Trump can achieve in first Board of Peace meeting",
    "description": "Analysts say Trump will seek to show Gaza progress at controversial board meet, but pressure on Israel needed for gains.",
    "link": "https://www.aljazeera.com/news/2026/2/19/proof-of-concept-what-trump-can-achieve-in-first-board-of-peace-meeting",
    "timestamp": "2026-02-19T06:00:16Z"
  },
  {
    "title": "No legislation being prepared to ban social media access for under-16s, says Government",
    "description": "Coalition plans to consult EU and ‘like-minded countries’ to promote Europe-wide measures that could keep children off social media",
    "link": "https://www.irishtimes.com/politics/2026/02/19/no-legislation-being-prepared-to-ban-social-media-access-for-under-16s-says-government/",
    "timestamp": "2026-02-19T06:00:01Z"
  },
  {
    "title": "Former Israeli PM calls Tucker Carlson a â\u0080\u009cphonyâ\u0080\u009d over airport detention claims",
    "description": "Tucker Carlson claims Israeli security detained and questioned him after an interview. Israeli authorities and the U.S. Embassy deny any detention occurred. Former Israeli PM Naftali Bennett called Carlson a liar in a scathing personal attack. The incident hi…",
    "link": "https://www.naturalnews.com/2026-02-19-israeli-pm-tucker-carlson-airport-detention.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Top CDC vaccine official resigns amid growing scrutiny of agency’s flawed science",
    "description": "CDC Acting Director Jim O’Neill resigns amid sweeping changes to vaccine policy under Health Secretary Robert F. Kennedy Jr. Kennedy’s administration removes COVID-19 vaccines from recommended schedules for healthy children and pregnant women, bypassing tradi…",
    "link": "https://www.naturalnews.com/2026-02-19-oneill-resigns-amid-agencys-flawed-science-growing-scrutiny.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Zelensky slams peace talks: “We don’t have time for this”",
    "description": "Ukrainian President Vladimir Zelensky sharply criticized ongoing peace negotiations with Russia during the Feb. 17 to 18 talks in Geneva, saying progress has been insufficient. The U.S.-mediated meetings addressed military and diplomatic issues, but Zelensky …",
    "link": "https://www.naturalnews.com/2026-02-19-zelensky-slams-peace-talks-with-russia.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "U.S. announces withdrawal of ALL remaining troops from Syria amid rising tensions with Iran",
    "description": "The U.S. has begun withdrawing its remaining 1,000 troops from Syria in a phased two-month process, handing over key bases (Al Tanf Garrison and Al-Shaddadi) to the Syrian government, now controlled by Hayat Tahrir al-Sham (HTS), an al-Qaeda offshoot. The wit…",
    "link": "https://www.naturalnews.com/2026-02-19-us-announces-withdrawal-all-remaining-troops-syria.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "DHS spokeswoman Tricia McLaughlin announces departure from agency amid mounting public backlash",
    "description": "Tricia McLaughlin, DHS assistant secretary for public affairs, announced her departure following public criticism of the Trump administration’s aggressive deportation and ICE enforcement tactics. Her exit signals potential shifts in the administration’s appro…",
    "link": "https://www.naturalnews.com/2026-02-19-dhs-spokeswoman-mclaughlin-announces-departure-from-agency.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "DNA match eludes investigators in Nancy Guthrie case, sheriff confirms",
    "description": "The Pima County Sheriff’s Department confirmed that DNA from gloves found near Nancy Guthrie’s residence did not match any profiles in the Combined DNA Index System (CODIS). Despite the negative DNA match, law enforcement and the Guthrie family remain committ…",
    "link": "https://www.naturalnews.com/2026-02-19-dna-match-eludes-investigators-nancy-guthrie-case.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Bannon-Epstein texts reveal alleged plot to invoke 25th Amendment against Trump",
    "description": "DOJ documents reveal Steve Bannon and Jeffrey Epstein privately discussed invoking the 25th Amendment to remove President Trump, with texts showing Bannon calling Trump “beyond borderline” and pushing for an “intervention” amid Democratic midterm gains in 201…",
    "link": "https://www.naturalnews.com/2026-02-19-bannon-epstein-texts-25th-amendment-against-trump.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Trump Becomes the Glyphosate President: Declares Deadly Weed Killer a National Defense Resource",
    "description": "An Executive Order for Poison: Trump’s Declaration of Chemical Warfare on America On February 18, 2026, President Donald J. Trump signed an executive order that marks a dark turning point in American history, one that weaponizes the nation’s food supply again…",
    "link": "https://www.naturalnews.com/2026-02-19-trump-becomes-the-glyphosate-president.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "A new political dynasty taking shape?",
    "description": "On Wednesday Lara Trump suggested multiple Trump family members are considering future political campaigns. She cites President Donald Trump’s influence as a primary inspiration for the family. Lara Trump has personally considered Senate runs in North Carolin…",
    "link": "https://www.naturalnews.com/2026-02-19-a-new-political-dynasty-taking-shape.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "U.S. military poised for Iran strike as nuclear talks stall, Russian drills begin",
    "description": "Diplomatic talks between the U.S. and Iran have stalled, with no agreement on nuclear demands. The U.S. is mobilizing a major naval force near Iran, including two aircraft carriers. American military sources indicate preparedness for a large-scale strike as e…",
    "link": "https://www.naturalnews.com/2026-02-19-military-iran-strike-nuclear-talks-drills.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Monsanto Trump declares chemical warfare on America, invokes national defense to expand production of cancer-linked GLYPHOSATE",
    "description": "In the spirit of Operation Warp Speed, President Donald Trump is again marshaling the widespread destruction of human health under the guise of a national emergency. Trump signed an executive order declaring the toxic herbicide glyphosate a matter of “nationa…",
    "link": "https://www.naturalnews.com/2026-02-19-trump-declares-chemical-warfare-on-america-glyphosate.html",
    "timestamp": "2026-02-19T06:00:00Z"
  },
  {
    "title": "Visual clues show the US could be getting closer to attacking Iran",
    "description": "The steady flow of military assets moving towards Europe and the Middle East appears to be a warning that the US could be ready to attack Iran.",
    "link": "https://www.abc.net.au/news/2026-02-19/tracking-us-military-build-up-ahead-of-possible-iran-attack/106363224",
    "timestamp": "2026-02-19T05:57:14Z"
  },
  {
    "title": "Bitcoin is about to log its longest losing streak since 2022 as geopolitical nerves hit risk trades",
    "description": "Geopolitical tensions lift the U.S. dollar and crude prices, adding pressure to an already fragile crypto market.",
    "link": "https://www.coindesk.com/markets/2026/02/19/bitcoin-on-track-for-fifth-weekly-decline-first-since-2022-as-geopolitical-risks-mount",
    "timestamp": "2026-02-19T05:44:03Z"
  },
  {
    "title": "Hanson plays into meme status, Taylor goes on tour",
    "description": "This week the new opposition leader revealed his shadow cabinet while Pauline Hanson spun through a cycle she knows well.",
    "link": "https://www.abc.net.au/news/2026-02-19/pauline-hanson-barnaby-joyce-angus-taylor-anthony-albanese/106349216",
    "timestamp": "2026-02-19T05:37:55Z"
  },
  {
    "title": "Juggling two wars at the same time is a tall order for Donald Trump’s two-man negotiating team",
    "description": "Even for a US president long fixated on deal-making, Donald Trump’s assignment of his favourite envoys to juggle two sets of negotiations – the Iranian nuclear stand-off and Russia’s war in Ukraine – in a single day in Geneva has left many in the foreign poli…",
    "link": "https://www.independent.ie/opinion/analysis/juggling-two-wars-at-the-same-time-is-a-tall-order-for-donald-trumps-two-man-negotiating-team/a366100490.html",
    "timestamp": "2026-02-19T05:30:00Z"
  },
  {
    "title": "Planned Parenthood Calls Men “People Who Carry Sperm”",
    "description": "Planned Parenthood has a new term for men. And as the abortion giant has done with women and unborn children, it’s totally de-humanizing. “People who carry sperm.” Sorry men, that’s all you are. You have no value or worth to the Planned Parenthood abortion bu…",
    "link": "https://freerepublic.com/focus/f-chat/4367428/posts",
    "timestamp": "2026-02-19T05:30:00Z"
  },
  {
    "title": "Iranian mourning ceremonies prompt new crackdowns in echo of 1979 revolution",
    "description": "Iranians have returned to the streets this week to mourn those killed by security forces during last month’s anti-government demonstrations, sparking some new crackdowns in an echo of the 1979 Islamic Revolution that brought down the US-backed Shah.",
    "link": "https://www.independent.ie/world-news/middle-east/iranian-mourning-ceremonies-prompt-new-crackdowns-in-echo-of-1979-revolution/a71737883.html",
    "timestamp": "2026-02-19T05:30:00Z"
  },
  {
    "title": "DC mayor declares emergency, asks President Trump for help on sewage spill on the Potomac",
    "description": "The local declaration is asking the president to issue a Presidential Emergency Disaster Declaration. It seeks full reimbursement for the money the city and local utility DC Water are spending on repairs.",
    "link": "https://nypost.com/2026/02/19/us-news/dc-mayor-bowser-declares-emergency-calls-for-trump-help-with-sewage-leak-into-potomac-river/",
    "timestamp": "2026-02-19T05:28:30Z"
  },
  {
    "title": "Auckland Airport gains, SkyCity slumps as NZX rallies on OCR decision – Market close",
    "description": "The S&P/NZX 50 jumped 1.49% as 41.07m shares worth $153.5 million were traded.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/auckland-airport-gains-skycity-slumps-as-nzx-rallies-on-ocr-decision-market-close/premium/XO5ZWQM43BGRDKJQOQXZRV3XDM/",
    "timestamp": "2026-02-19T05:24:38Z"
  },
  {
    "title": "White House tells Iran to do deal as Trump hints at US strikes",
    "description": "The White House warned on Wednesday that Iran would be \"wise\" to do a deal with the United States as President Donald Trump once again hinted at military action.",
    "link": "https://www.hurriyetdailynews.com/white-house-tells-iran-to-do-deal-as-trump-hints-at-us-strikes-219097",
    "timestamp": "2026-02-19T05:18:45Z"
  },
  {
    "title": "Governors arrive in Washington eager to push past Trump's partisan grip",
    "description": "Governors are arriving in Washington for an annual gathering that has traditionally been a show of bipartisanship",
    "link": "https://abcnews.com/Politics/wireStory/governors-arrive-washington-eager-push-past-trumps-partisan-130290395",
    "timestamp": "2026-02-19T05:18:21Z"
  },
  {
    "title": "Trump heads to Georgia, a target of his election falsehoods, as Republicans look for midterm boost",
    "description": "President Donald Trump is weighing military action against Iran, leading an immigration crackdown, and teasing a federal takeover of state elections",
    "link": "https://abcnews.com/US/wireStory/trump-heads-georgia-target-election-falsehoods-republicans-midterm-130290040",
    "timestamp": "2026-02-19T05:17:28Z"
  },
  {
    "title": "Is Trump getting US Troops out of Syria, another nail in the Coffin of Bush’s “War on Terror?”",
    "description": "Trump now has a similar choice, of whether he wants to spend trillions of dollars on a Napoleonic gamble in Iran.",
    "link": "https://www.juancole.com/2026/02/getting-troops-another.html",
    "timestamp": "2026-02-19T05:15:00Z"
  },
  {
    "title": "Trump to host Board of Peace meeting on Thursday, White House says",
    "description": "White House press ⁠secretary Karoline Leavitt told ‌reporters that member states had committed to provide thousands ‌of personnel for ​an international stabilisation force ⁠for Gaza",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-host-board-of-peace-meeting-on-thursday-white-house-says/article70650352.ece",
    "timestamp": "2026-02-19T05:10:55Z"
  },
  {
    "title": "US allies gather as Trump kicks off Board of Peace",
    "description": "President Trump inaugurates the ‘Board of Peace’ with global allies, focusing on progress in Gaza, disarmament of Hamas, and reconstruction efforts.\n\nRead More: https://punchng.com/us-allies-gather-as-trump-kicks-off-board-of-peace/",
    "link": "https://punchng.com/us-allies-gather-as-trump-kicks-off-board-of-peace/",
    "timestamp": "2026-02-19T05:09:53Z"
  },
  {
    "title": "Karoline Leavitt Just Totally Undermined Trump's 'I Didn't Do It' Claim",
    "description": "The White House press secretary's latest comment appears to conflict with what the president said about a racist video he shared.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-trump-racist-video_n_69968502e4b0cc086c6e9aaf",
    "timestamp": "2026-02-19T05:09:51Z"
  },
  {
    "title": "Jesse Jackson, Complicated Man",
    "description": "The late preacher-cum-politician hailed from stranger times than our own.\nThe post Jesse Jackson, Complicated Man appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/jesse-jackson-complicated-man/",
    "timestamp": "2026-02-19T05:03:00Z"
  },
  {
    "title": "Trump’s £37 billion electric car U-turn is an open goal for China",
    "description": "Decision to halt EV purchase incentives and kill planned emissions rules has negated billions in investment\n\nIn the past few months, car makers with exposure to the US market have written off the equivalent of £37 billion, or roughly what the UK has spent so …",
    "link": "https://www.autocar.co.uk/car-news/business-corporate/trump%E2%80%99s-%C2%A337-billion-electric-car-u-turn-open-goal-china",
    "timestamp": "2026-02-19T05:00:00Z"
  },
  {
    "title": "Trump's war on EVs costs car makers £37 billion",
    "description": "Decision to halt EV purchase incentives and kill planned emissions rules has negated billions in investment\n\nIn the past few months, car makers with exposure to the US market have written off the equivalent of £37 billion, or roughly what the UK has spent so …",
    "link": "https://www.autocar.co.uk/car-news/business-corporate/trumps-war-evs-costs-car-makers-%C2%A337-billion",
    "timestamp": "2026-02-19T05:00:00Z"
  },
  {
    "title": "N Korea’s Kim unveils 50 rocket launchers ahead of key congress",
    "description": "Kim hails nuclear-capable weapons as 'wonderful' and 'attractive' as N Korea gears up for a once-in-five-year congress.",
    "link": "https://www.aljazeera.com/news/2026/2/19/n-koreas-kim-unveils-50-rocket-launchers-ahead-of-key-congress",
    "timestamp": "2026-02-19T04:56:27Z"
  },
  {
    "title": "Ex-diplomats defend UN’s Albanese, urge France to retract calls for resignation",
    "description": "More than 150 former diplomats urge France to retract calls for UN’s Francesca Albanese to resign over her remarks against Israel.",
    "link": "https://www.israelnationalnews.com/news/422641",
    "timestamp": "2026-02-19T04:52:18Z"
  },
  {
    "title": "US CLARITY Act to pass 'hopefully by April': Senator Bernie Moreno",
    "description": "Odds of the US CLARITY Act passing in 2026 briefly spike to 90% on Polymarket on Wednesday amid optimistic comments from US Senator Bernie Moreno.",
    "link": "https://cointelegraph.com/news/crypto-us-clarity-act-coinbase-brian-armstrong-bernie-moreno",
    "timestamp": "2026-02-19T04:43:35Z"
  },
  {
    "title": "Crude oil futures rise on fears of imminent US-Iran clash",
    "description": "At 9.59 am on Thursday, February crude oil futures were trading at ₹5956 on MCX during the initial hour of trading on Thursday against the previous close of ₹5903, up by 0.90%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-on-fears-of-imminent-us-iran-clash/article70650390.ece",
    "timestamp": "2026-02-19T04:42:53Z"
  },
  {
    "title": "D.C. Mayor Muriel Bowser Requests Federal Support in Potomac Sewage Crisis",
    "description": "Washington, D.C. Mayor Muriel Bowser (D) declared a public emergency and requested support from the federal government regarding the ongoing Potomac River sewage crisis.\nThe post D.C. Mayor Muriel Bowser Requests Federal Support in Potomac Sewage Crisis appea…",
    "link": "https://www.breitbart.com/politics/2026/02/18/d-c-mayor-muriel-bowser-requests-federal-support-in-potomac-sewage-crisis/",
    "timestamp": "2026-02-19T04:40:37Z"
  },
  {
    "title": "Has Marco Rubio Found the Secret to a Free Cuba?",
    "description": "On Monday night, while talking to reporters aboard Air Force One, someone asked President Donald Trump about Cuba. \"They'll make a deal,\" he said. \"Cuba is right now a failed nation, and they don't even have jet fuel for airplanes to take off. They're cloggin…",
    "link": "https://freerepublic.com/focus/f-news/4367424/posts",
    "timestamp": "2026-02-19T04:37:03Z"
  },
  {
    "title": "GOP strategist short-circuits after CNN host throws his words back in his face",
    "description": "A GOP strategist melted down on Wednesday after a CNN host threw his own words back in his face. Shermichael Singleton, a GOP strategist, was a panelist on CNN's \"NewsNight\" with Abby Phillip, where the panel got into a heated debate about President Donald Tr…",
    "link": "https://www.rawstory.com/gop-2675282705/",
    "timestamp": "2026-02-19T04:25:58Z"
  },
  {
    "title": "US futures retreat after Nvidia-led rally, oil prices rise",
    "description": "US futures retreat after Nvidia-led rally, oil prices risewhio.com",
    "link": "https://www.whio.com/news/business/asian-shares-advance/TD6BGX43ZM4AZJND3MUQHELXOQ/",
    "timestamp": "2026-02-19T04:24:13Z"
  },
  {
    "title": "‘Reckless’: Trump Is Now Talking Nuclear Weapons amid Mounting Concern over Capacity",
    "description": "Americans have been concerned about US president Donald Trump for some time now – not just in terms of policy such as the use of the National Guard and ICE raids, but around his capacity and fitness to serve in the top job per the 25th amendment.Mental health…",
    "link": "https://www.indy100.com/politics/trump/trump-nuclear-weapons-tests-pentagon",
    "timestamp": "2026-02-19T04:24:11Z"
  },
  {
    "title": "After brutal crackdown: US imposes new visa restrictions on Iranian officials",
    "description": "Trump administration imposes new visa restrictions on 18 Iranian officials and telecom leaders following last month’s brutal crackdown on anti-regime protesters.",
    "link": "https://www.israelnationalnews.com/news/422639",
    "timestamp": "2026-02-19T04:23:24Z"
  },
  {
    "title": "U.S. military pushes more weaponry into the Middle East for possible strikes on Iran",
    "description": "WASHINGTON — The Pentagon is sending a slew of additional weaponry to the Middle East, including more warships, air defenses and submarines, in preparation for a possible military strike on Iran if President Donald Trump makes that decision, according to U.S.…",
    "link": "https://www.nbcnews.com/world/iran/us-military-pushes-weaponry-middle-east-possible-strikes-iran-rcna259632",
    "timestamp": "2026-02-19T04:21:43Z"
  },
  {
    "title": "Rubio plans to update Netanyahu on US-Iran talks in Israel next week, officials say",
    "description": "Secretary of State Marco Rubio plans to travel to Israel next week to update Israeli Prime Minister Benjamin Netanyahu on the U.S.-Iran nuclear talks",
    "link": "https://abcnews.com/US/wireStory/rubio-plans-update-netanyahu-us-iran-talks-israel-130285644",
    "timestamp": "2026-02-19T04:21:30Z"
  },
  {
    "title": "Microsoft says it does not think US ICE uses firm's tech for mass surveillance of civilians",
    "description": "The statement from the ‌technology company came ⁠in ⁠response to a report by The Guardian that said ICE deepened its reliance on Microsoft's cloud technology last year as the ​agency ramped up arrest and deportation operations. The newspaper cited leaked docu…",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-says-it-does-not-think-us-ice-uses-firms-tech-for-mass-surveillance-of-civilians/articleshow/128538596.cms",
    "timestamp": "2026-02-19T04:21:24Z"
  },
  {
    "title": "Microsoft says it does not think US ICE uses firm's tech for mass surveillance of civilians",
    "description": "WASHINGTON, Feb 18 : Microsoft said on Wednesday it did not think the U.S. Immigration and Customs Enforcement agency was using its technology for mass surveillance of civilians but added that it provided cloud-based productivity and collaboration tools to IC…",
    "link": "https://www.channelnewsasia.com/business/microsoft-says-it-does-not-think-us-ice-uses-firms-tech-mass-surveillance-civilians-5939551",
    "timestamp": "2026-02-19T04:21:12Z"
  },
  {
    "title": "Trump weighs plan to kill Iranian leaders – WSJ",
    "description": "US President Donald Trump is weighing options for a military attack on Iran, the Wall Street Journal said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632755-trump-briefed-iran-strikes/",
    "timestamp": "2026-02-19T04:13:22Z"
  },
  {
    "title": "Bitcoin shakes off U.S. session losses as Trump says U.S. trade deficit cut by 78%",
    "description": "Investors are focused less on the accuracy of Trump’s trade figures and more on how renewed tariff talk could mean higher-for-longer interest rates.",
    "link": "https://www.coindesk.com/markets/2026/02/19/bitcoin-shakes-off-u-s-session-losses-as-trump-says-u-s-trade-deficit-cut-by-78",
    "timestamp": "2026-02-19T04:11:55Z"
  },
  {
    "title": "New Mexico probes allegation of bodies buried near Epstein ranch",
    "description": "Feb 18 (Reuters) - New Mexico's Department of Justice ⁠said on Wednesday the state was investigating an allegation, which emerged from documents released by the U.S. Department of Justice, that the late ⁠sex offender Jeffrey Epstein ordered the bodies of two …",
    "link": "https://www.thestar.com.my/news/world/2026/02/19/new-mexico-probes-allegation-of-bodies-buried-near-epstein-ranch",
    "timestamp": "2026-02-19T04:06:00Z"
  },
  {
    "title": "GOP analysts pan Trump's 'divisive' attack on Black history: 'A bit concerning'",
    "description": "Two conservative analysts on Wednesday panned President Donald Trump's latest attack on Black history during an interview on CNN. This week, a federal judge ordered the Trump administration to return a long-standing slavery exhibit to a museum in Pennsylvania…",
    "link": "https://www.rawstory.com/gop-2675282672/",
    "timestamp": "2026-02-19T04:05:20Z"
  },
  {
    "title": "Activist group Extinction Rebellion says it is under FBI investigation",
    "description": "Environmental group says FBI is visiting activists' homes as Trump administration rolls back pollution protections.",
    "link": "https://www.aljazeera.com/news/2026/2/19/activist-group-extinction-rebellion-says-it-is-under-fbi-investigation",
    "timestamp": "2026-02-19T04:04:45Z"
  },
  {
    "title": "DHS shutdown leaves local emergency responders on their own amid extreme weather, expert warns",
    "description": "A public safety expert warned that the DHS shutdown could devastate local disaster response, with grant funding impacted as extreme weather threatens communities.",
    "link": "https://www.foxnews.com/politics/dhs-shutdown-leaves-local-emergency-responders-own-amid-extreme-weather-expert-warns",
    "timestamp": "2026-02-19T04:03:10Z"
  },
  {
    "title": "‘India being singled out’: US Congressman slams Donald Trump over tariffs policy",
    "description": "A senior US lawmaker has criticized President Trump's decision to impose tariffs on India for buying Russian oil. Congressman Brad Sherman stated that Trump is seeking excuses for these tariffs. He pointed out that other countries like Hungary and China impor…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-tariffs-india-being-singled-out-us-congressman-slams-donald-trump/articleshow/128537735.cms",
    "timestamp": "2026-02-19T04:00:13Z"
  },
  {
    "title": "Trump grasping for excuses to slap ‘outrageous’ tariffs on India: US Congressman",
    "description": "Sherman, a senior member of the House Foreign Affairs and Financial Services Committees, said Trump claims tariffs on India relate to importing Russian oil",
    "link": "https://www.thehindubusinessline.com/news/world/trump-grasping-for-excuses-to-slap-outrageous-tariffs-on-india-us-congressman/article70650295.ece",
    "timestamp": "2026-02-19T03:59:57Z"
  },
  {
    "title": "US SOUTHCOM Chief Visited Venezuela",
    "description": "Gen. Francis Donovan, head of US Southern Command, visited Venezuela alongside diplomatic envoy Laura Dogu and Pentagon official Joseph Humire for direct talks with interim authorities.",
    "link": "https://sputnikglobe.com/20260219/us-southcom-chief-visited-venezuela-1123655909.html",
    "timestamp": "2026-02-19T03:57:00Z"
  },
  {
    "title": "Republican Gov Hits Back At Trump Official Trying to Limit State’s Rights: I’ll ‘Beat You In Court’",
    "description": "“Let me be clear, I will use every resource within my disposal as governor of the sovereign state of Utah, and under the Constitution of the United States to beat you in court”\nThe post Republican Gov Hits Back At Trump Official Trying to Limit State’s Rights…",
    "link": "https://www.mediaite.com/media/news/republican-gov-hits-back-at-trump-official-trying-to-limit-states-rights-ill-beat-you-in-court/",
    "timestamp": "2026-02-19T03:54:15Z"
  },
  {
    "title": "Sierra Club, Partners Sue EPA Over Illegal Repeal of Climate Protections",
    "description": "Washington, DC — A broad coalition of health and environmental groups sued the Environmental Protection Agency today over its illegal determination that it is not responsible for protecting us from climate pollution and its elimination of rules to cut the tai…",
    "link": "https://cleantechnica.com/2026/02/18/sierra-club-partners-sue-epa-over-illegal-repeal-of-climate-protections/",
    "timestamp": "2026-02-19T03:50:08Z"
  },
  {
    "title": "Here’s the Proof Trump Knows He’s Doomed: Rothkopf",
    "description": "Donald Trump is trying to chip away at the integrity of the voting process ahead of the November midterms because he knows Republicans will not fare well...",
    "link": "https://www.thedailybeast.com/heres-the-proof-trump-knows-hes-doomed-rothkopf/",
    "timestamp": "2026-02-19T03:42:57Z"
  },
  {
    "title": "Where the US is building up military force near Iran",
    "description": "The U.S. military has significantly bolstered its forces near Iran, deploying two aircraft carrier strike groups and numerous warships. This buildup, including advanced fighter jets and drones, raises questions about President Trump's potential military objec…",
    "link": "https://economictimes.indiatimes.com/news/defence/where-the-us-is-building-up-military-force-near-iran/articleshow/128537447.cms",
    "timestamp": "2026-02-19T03:39:32Z"
  },
  {
    "title": "Expert reveals the Trump FCC crusader's airtime battles could backfire spectacularly",
    "description": "A media expert revealed on Wednesday that President Donald Trump's leader at the Federal Communications Commission may have created a situation that will backfire spectacularly. Throughout the second Trump administration, FCC Commissioner Brendan Carr has sou…",
    "link": "https://www.rawstory.com/brendan-carr-2675282650/",
    "timestamp": "2026-02-19T03:36:37Z"
  },
  {
    "title": "Ron DeSantis shrugs off Andy Beshear’s late-night jab: ‘I wear it as a badge of honor.’",
    "description": "During an interview on “The Daily Show,” host Jon Stewart asked Beshear which governor he believed was the worst. “Who’s the one where, like, you guys are at the governor’s conference and the elevator opens, and he’s about to walk in, and you just go – or she…",
    "link": "https://freerepublic.com/focus/f-news/4367416/posts",
    "timestamp": "2026-02-19T03:36:00Z"
  },
  {
    "title": "Gov. Beshear announces release of book 'Go and Do Likewise'",
    "description": "LEXINGTON, Ky. (WKYT) - Gov. Andy Beshear announced the release of his book, “Go and Do Likewise” on Wednesday, Feb. 18. The book is set to go on sale September 22, with pre-orders currently available. In his book, Beshear will share how his faith has informe…",
    "link": "https://freerepublic.com/focus/f-news/4367413/posts",
    "timestamp": "2026-02-19T03:22:53Z"
  },
  {
    "title": "Van Hollen: 'Suppressing the Vote', Which Trump Is Trying to Do, Motivates People to Vote",
    "description": "On Wednesday’s broadcast of MS NOW’s “All In,” Sen. Chris Van Hollen (D-MD) stated that “one thing that definitely motivates people to go out and vote is when they know that people like Donald Trump are trying to stop them\nThe post Van Hollen: ‘Suppressing th…",
    "link": "https://www.breitbart.com/clips/2026/02/18/van-hollen-suppressing-the-vote-which-trump-is-trying-to-do-motivates-people-to-vote/",
    "timestamp": "2026-02-19T03:22:02Z"
  },
  {
    "title": "Newsmax Guest Wants to ‘Start Vetting’ Olympians For Their Political Views",
    "description": "Newsmax host Carl Higbie spoke to Evita Duffy-Alfonso on Wednesday night in a segment ridiculing Olympic figure skater Amber Glenn for speaking out against President Donald Trump and then failing to medal at the Olympics. “Figure skater named Amber Glenn, nev…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b7c05195-838f-46bb-9c68-d26ee4ba31eb",
    "timestamp": "2026-02-19T03:20:08Z"
  },
  {
    "title": "Newsmax Guest Wants to ‘Start Vetting’ Olympians For Their Political Views",
    "description": "Newsmax host Carl Higbie spoke to Evita Duffy-Alfonso on Wednesday night in a segment ridiculing Olympic figure skater Amber Glenn for speaking out against President Donald Trump and then failing to medal at the Olympics. “Figure skater named Amber Glenn, nev…",
    "link": "https://www.mediaite.com/media/tv/newsmax-guest-wants-to-start-vetting-olympians-for-their-political-views/",
    "timestamp": "2026-02-19T03:20:08Z"
  }
]