[
  {
    "title": "Jeff Daniels Copes With a ‘Crazy World’ on New Song Inspired by Anti-Trump Protests",
    "description": "Jeff Daniels performed an original song, 'Crazy World,' on MSNBC, saying it was inspired by the recent 'No Kings' protests against Donald Trump.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jeff-daniels-anti-trump-protests-song-crazy-world-1235452404/",
    "timestamp": "2025-10-22T19:57:50Z"
  },
  {
    "title": "NFL is not reconsidering Bad Bunny’s Super Bowl halftime show, Goodell says",
    "description": "The NFL is not considering dropping Bad Bunny as its Super Bowl halftime headline performer, Commissioner Roger Goodell said Wednesday, reaffirming a decision to put the Grammy-winning Puerto Rican artist on the league's biggest stage that led to criticism fr…",
    "link": "https://www.pbs.org/newshour/nation/nfl-is-not-reconsidering-bad-bunnys-super-bowl-halftime-show-goodell-says",
    "timestamp": "2025-10-22T19:55:25Z"
  },
  {
    "title": "Trump's Vile New $230 Million Shakedown of DOJ Just Got Even Worse (Greg Sargent/New Republic)",
    "description": "Greg Sargent / New Republic:\nTrump's Vile New $230 Million Shakedown of DOJ Just Got Even Worse  —  Donald Trump is rapidly transforming the presidency into a massive Bribe Delivery System.  For convenience's sake, let's refer to this going forward as Trump's…",
    "link": "https://www.memeorandum.com/251022/p112",
    "timestamp": "2025-10-22T19:55:01Z"
  },
  {
    "title": "Tear down the Trump Taj Mahal wing of the White House",
    "description": "Some free advice the aspirants to the 2028 Democratic nomination should definitely take: I know we talked about this yesterday. And Mona has a very fine piece on it today. But I’m obsessed with Donald Trump’s demolition of the East Wing of the White House. Ha…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/tear-down-the-trump-taj-mahal-wing-of-the-white-house",
    "timestamp": "2025-10-22T19:51:05Z"
  },
  {
    "title": "Did Trump greenlight $2,000 checks? Here’s what happened to the tariff rebate",
    "description": "Stimulus check October 2025: Rumors of a $2,000 stimulus check in October have been debunked by the IRS, which warns of phishing scams. While Donald Trump revisited the idea of payments between $1,000 and $2,000, no official plan has been introduced. The last…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-trump-greenlight-2000-checks-heres-what-happened-to-the-tariff-rebate/articleshow/124746990.cms",
    "timestamp": "2025-10-22T19:51:03Z"
  },
  {
    "title": "Michael Wolff sues Melania Trump in a NY court to try to stop her from suing him over his claims about Melania and Donald Trump's ties to Jeffrey Epstein (Josh Russell/Courthouse News Service)",
    "description": "Josh Russell / Courthouse News Service:\nMichael Wolff sues Melania Trump in a NY court to try to stop her from suing him over his claims about Melania and Donald Trump's ties to Jeffrey Epstein  —  The “Fire and Fury” author says he looks forward to subpoenai…",
    "link": "https://mediagazer.com/251022/p14",
    "timestamp": "2025-10-22T19:50:02Z"
  },
  {
    "title": "U.S. strikes 8th alleged drug-carrying boat, this time in the Pacific, Hegseth says",
    "description": "The attack Tuesday night was a departure from the seven previous U.S. strikes that had targeted vessels in the Caribbean. Defense Secretary Pete Hegseth said on social media that the latest strike killed two people, bringing the death toll to at least 34 from…",
    "link": "https://www.pbs.org/newshour/nation/u-s-strikes-8th-alleged-drug-carrying-boat-this-time-in-the-pacific-hegseth-says",
    "timestamp": "2025-10-22T19:49:25Z"
  },
  {
    "title": "White House hasn't submitted plans for Trump's fancy ballroom despite shocking demolition",
    "description": "No permits or plans have been submitted for the reconstruction of the new gold ballroom at the White House, a project initiated by President Donald Trump during the government shutdown, and a stop-work order has been issued.Designer Sarah Boardman has spent t…",
    "link": "https://www.rawstory.com/white-house-ballroom-2674223704/",
    "timestamp": "2025-10-22T19:49:03Z"
  },
  {
    "title": "Will California’s Proposition 50 kill gerrymandering reform?",
    "description": "Or is opposing Trump the greater priority for voters?",
    "link": "https://theweek.com/politics/california-proposition-50-kill-gerrymandering-reform",
    "timestamp": "2025-10-22T19:48:51Z"
  },
  {
    "title": "Gross: Trump’s Obsession In Getting Project 2025 Co-Author Laid",
    "description": "A new report showing President Donald Trump’s drive to get the co-author of Project 2025\u2028“p——“ has shocked social media observers.",
    "link": "https://hiphopwired.com/2879252/gross-trumps-obsession-in-getting-project-2025-head-laid/",
    "timestamp": "2025-10-22T19:46:54Z"
  },
  {
    "title": "Trump Says Cattle Ranchers ‘Don’t Understand’ His Policies After They Criticize Argentina Beef Import Plan",
    "description": "President Donald Trump rebuked cattle ranchers after they criticized his idea to import Argentinian beef, writing on Truth Social on Wednesday they “don’t understand” his policies—as the proposal has prompted criticism from Republican lawmakers in farm states…",
    "link": "https://freerepublic.com/focus/f-news/4348001/posts",
    "timestamp": "2025-10-22T19:46:47Z"
  },
  {
    "title": "Democratic Sen. Merkley of Oregon stages marathon speech to protest Trump amid shutdown",
    "description": "Merkley started speaking Tuesday and was still going more than 21 hours later.",
    "link": "https://www.bostonherald.com/2025/10/22/merkley-speech/",
    "timestamp": "2025-10-22T19:46:37Z"
  },
  {
    "title": "JB Pritzker Compares Trump’s ICE Raids to Nazi Germany: ‘This Is How Authoritarian Regimes Do It’",
    "description": "JB Pritzker compared President Trump using ICE agents to crackdown on illegal immigration to Adolf Hitler rounding up Jews in Nazi Germany\nThe post JB Pritzker Compares Trump’s ICE Raids to Nazi Germany: ‘This Is How Authoritarian Regimes Do It’ first appeare…",
    "link": "https://www.mediaite.com/politics/jb-pritzker-compares-trumps-ice-raids-to-nazi-germany-this-is-how-authoritarian-regimes-do-it/",
    "timestamp": "2025-10-22T19:46:34Z"
  },
  {
    "title": "Oil Closes Higher as Oversold Signals Ease",
    "description": "WTI and Brent gained as U.S. petroleum stockpiles dropped by 4.2 million barrels.",
    "link": "https://www.rigzone.com/news/wire/oil_closes_higher_as_oversold_signals_ease-22-oct-2025-182145-article/",
    "timestamp": "2025-10-22T19:46:04Z"
  },
  {
    "title": "Trump dined with Rupert Murdoch despite suing him for $10B over Epstein letter: Report",
    "description": "President Donald Trump denies sending a risque birthday letter to then-friend Jeffrey Epstein, who killed himself in 2019 amid child sex trafficking charges.",
    "link": "https://www.cnbc.com/2025/10/22/trump-murdoch-epstein-white-house-dinner.html",
    "timestamp": "2025-10-22T19:45:52Z"
  },
  {
    "title": "Ongoing government shutdown threatens holiday travel as pilots rally for lawmakers to reach an agreement",
    "description": "Government shutdown strains air traffic controllers and causes delays at major airports as pilots' associations demand lawmakers end the political standoff.",
    "link": "https://www.foxnews.com/politics/ongoing-government-shutdown-threatens-holiday-travel-pilots-rally-lawmakers-reach-agreement",
    "timestamp": "2025-10-22T19:45:33Z"
  },
  {
    "title": "Jeff Daniels Nailed Why That Trump Poop Video Is Actually A Big Deal",
    "description": "Another day, another talking point about that video.View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/jeff-daniels-trump-ai-response",
    "timestamp": "2025-10-22T19:43:08Z"
  },
  {
    "title": "Trump expands military strikes against civilian boats, this time in the Pacific Ocean",
    "description": "As the White House launches its eighth operation against alleged drug smugglers in international waters, there's still no evidence to support its claims.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-expands-military-strikes-civilian-boats-time-pacific-ocean-rcna239212",
    "timestamp": "2025-10-22T19:39:32Z"
  },
  {
    "title": "Hegseth Issues New Restrictions on Pentagon Communications With Congress",
    "description": "Hegseth’s new rules were issued the same day that the Pentagon’s dedicated press corps was effectively kicked out.",
    "link": "https://truthout.org/articles/hegseth-issues-new-restrictions-on-pentagon-communications-with-congress/",
    "timestamp": "2025-10-22T19:38:21Z"
  },
  {
    "title": "YouTube's settlement with Trump is helping pay for the White House demolition",
    "description": "Alphabet is helping pay for President Donald Trump's plan to build a White House ballroom.\nJESSICA KOSCIELNIAK/REUTERS\nAlphabet contributed $22 million to Trump's White House ballroom project.\nThe contribution is part of a legal settlement after Trump's YouTu…",
    "link": "https://biztoc.com/x/95586559274591f5",
    "timestamp": "2025-10-22T19:37:19Z"
  },
  {
    "title": "YouTube's settlement with Trump is helping pay for the White House demolition and ballroom",
    "description": "Alphabet, which owns YouTube, is contributing $22 million toward Trump's White House construction plans as part of a legal settlement.",
    "link": "https://www.businessinsider.com/youtube-settlement-is-helping-fund-trumps-white-house-demolition-ballroom-2025-10",
    "timestamp": "2025-10-22T19:36:29Z"
  },
  {
    "title": "US Obliterates Another Alleged Narco Skiff In First Pacific Ocean Strike",
    "description": "The U.S. military carried out a strike against an alleged narco-terrorist vessel in the Pacific Ocean, Secretary of War Pete Hegseth announced Wednesday.",
    "link": "https://dailycaller.com/2025/10/22/us-obliterates-drug-vessel-in-pacific/",
    "timestamp": "2025-10-22T19:35:22Z"
  },
  {
    "title": "Bad Bunny Out, George Strait In? NFL Breaks Silence On Halftime Shake-Up.",
    "description": "NFL Commissioner Roger Goodell acknowledged the conservative pushback the choice of Bad Bunny has received.",
    "link": "https://www.huffpost.com/entry/bad-bunny-george-strait-super-bowl-petition_n_68f901efe4b01e35ba16ca79",
    "timestamp": "2025-10-22T19:32:42Z"
  },
  {
    "title": "The EU and Egypt’s first-ever summit will focus on economic ties, migration and Gaza",
    "description": "Egypt and the European Union will hold their first summit on Wednesday in Brussels where leaders will discuss security, trade and migration as well as stability in Gaza.",
    "link": "https://www.pbs.org/newshour/world/the-eu-and-egypts-first-ever-summit-will-focus-on-economic-ties-migration-and-gaza",
    "timestamp": "2025-10-22T19:32:39Z"
  },
  {
    "title": "'Entirety' of East Wing to be 'modernized' to build Trump ballroom: White House official - ABC News - Breaking News, Latest News and Videos",
    "description": "'Entirety' of East Wing to be 'modernized' to build Trump ballroom: White House officialABC News - Breaking News, Latest News and Videos Who is paying for Donald Trump's new White House ballroom?BBC In pictures: Trump’s East Wing demolitionCNN Trump’s East Wi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179852264",
    "timestamp": "2025-10-22T19:32:26Z"
  },
  {
    "title": "Christian Musician Who Sang at Trump Rally Arrested on Child Pornography Charges",
    "description": "Jon Sheptock, a former Texas worship minister, was arrested on charges of possession and production of child pornography.\nChristian Musician Who Sang at Trump Rally Arrested on Child Pornography Charges\nEddie Fu",
    "link": "https://consequence.net/2025/10/christian-musician-trump-rally-arrested-child-pornography/",
    "timestamp": "2025-10-22T19:31:32Z"
  },
  {
    "title": "No discussion on Pakistan in Modi-Trump phone call, says government; PM may address Asean virtually",
    "description": "India News: Despite the recent show of bonhomie between PM Narendra Modi and President Donald Trump, India and the US again seemed at odds over talks between the .",
    "link": "https://timesofindia.indiatimes.com/india/no-discussion-on-pakistan-in-modi-trump-phone-call-says-government-pm-may-address-asean-virtually/articleshow/124747878.cms",
    "timestamp": "2025-10-22T19:30:31Z"
  },
  {
    "title": "Government shutdown becomes 2nd longest in U.S. history (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nGovernment shutdown becomes 2nd longest in U.S. history … The U.S. government shutdown on Wednesday entered its 22nd day, becoming the second-longest federal funding lapse ever, with no end in sight.  —  The milestone means that the t…",
    "link": "https://www.memeorandum.com/251022/p106",
    "timestamp": "2025-10-22T19:30:01Z"
  },
  {
    "title": "U.S. strikes two alleged drug-smuggling boats in first attacks in eastern Pacific",
    "description": "Defense Secretary Pete Hegseth said Wednesday night that the military launched a second lethal strike against what he said were vessels involved in drug trafficking operations in the eastern Pacific.",
    "link": "https://www.nbcnews.com/politics/national-security/us-strikes-eighth-alleged-drug-carrying-boat-time-pacific-ocean-rcna239218",
    "timestamp": "2025-10-22T19:29:46Z"
  },
  {
    "title": "Two killed after US strikes alleged drug boat in Pacific",
    "description": "A new US strike on an alleged drug-smuggling boat killed two people, Defence Secretary Pete Hegseth has said, announcing Washington's first such attack on a vessel in the Pacific Ocean.",
    "link": "https://www.rte.ie/news/world/2025/1022/1540067-us-pacific-drugs/",
    "timestamp": "2025-10-22T19:29:46Z"
  },
  {
    "title": "Pentagon Announces “Next Generation” Press Corps: Trump Supporting Media Signs Up While Major Outlets Shun New Policy",
    "description": "The Pentagon said that more than 60 correspondents signed on to its new restrictions, with major news outlets as well as conservative sources like Newsmax and The Washington Times shunning the new policy. Sean Parnell, the chief Pentagon spokesman, wrote in a…",
    "link": "http://deadline.com/2025/10/pentagon-press-corps-trump-restrictions-1236594336/",
    "timestamp": "2025-10-22T19:29:24Z"
  },
  {
    "title": "'Hard to fathom how bad this is': Analyst stunned by detail in Trump's $230M DOJ demand",
    "description": "An analyst stunned by a new detail in President Donald Trump's $230 million Department of Justice demand said Wednesday it is \"hard to fathom how bad this is.\" Greg Sargent, staff writer and podcast host at The New Republic, argues that Trump is turning the p…",
    "link": "https://www.rawstory.com/donald-trump-doj-2674223616/",
    "timestamp": "2025-10-22T19:29:03Z"
  },
  {
    "title": "Exclusive-US considering curbs on exports to China made with US software, sources say",
    "description": "(Reuters) -The Trump administration is considering a plan to curb a dizzying array of software-powered exports to China, from laptops to jet engines, to...",
    "link": "https://finance.yahoo.com/news/exclusive-us-considering-curbs-exports-192758562.html",
    "timestamp": "2025-10-22T19:27:58Z"
  },
  {
    "title": "MAGA star joins Ciattarelli on campaign trail in New Jersey as Republicans aim to flip governor's office",
    "description": "Jack Ciattarelli campaigns with Rep. Byron Donalds while Rep. Mikie Sherrill prepares for a rally with former President Barack Obama in New Jersey's tight governor race.",
    "link": "https://www.foxnews.com/politics/maga-star-joins-ciattarelli-campaign-trail-new-jersey-republicans-aim-flip-governors-office",
    "timestamp": "2025-10-22T19:27:53Z"
  },
  {
    "title": "DAVID BOSSIE: GOP Shouldn’t Give An Inch To Democrats In Shutdown Fight",
    "description": "Democrats are at their weakest point in recent memory; it’s time to break the back of those who exist to defend the failed status quo.",
    "link": "https://dailycaller.com/2025/10/22/opinion-republicans-cant-give-an-inch-to-democrats-in-shutdown-fight-david-bossie/",
    "timestamp": "2025-10-22T19:27:31Z"
  },
  {
    "title": "US Says Two Dead In Strike On Alleged Drug-smuggling Boat In Pacific",
    "description": "A new US strike on an alleged drug-smuggling boat killed two people, Defense Secretary Pete Hegseth said Wednesday, announcing Washington's first such attack on a vessel in the Pacific Ocean.",
    "link": "https://www.ibtimes.com/us-says-two-dead-strike-alleged-drug-smuggling-boat-pacific-3788069",
    "timestamp": "2025-10-22T19:27:16Z"
  },
  {
    "title": "The weather disaster database that Trump killed has a new home",
    "description": "The national database on billion-dollar weather and climate disasters has found a new home after the Trump administration decided to ax it earlier this year. Thanks to researchers continuing the work despite a lack of federal support, we can keep the tally go…",
    "link": "https://www.theverge.com/news/804714/data-billion-dollar-weather-disaster-revived",
    "timestamp": "2025-10-22T19:26:49Z"
  },
  {
    "title": "Vance, Netanyahu Meet in Israel Amid Fragile Gaza Ceasefire",
    "description": "US Vice President JD Vance visited the base of a multinational monitoring force near Gaza as one of his first stops on a three-day trip to Israel, seeking to bolster faith in a peace plan that’s got off to an uncertain start.\nVance landed in Tel Aviv just ove…",
    "link": "https://biztoc.com/x/4950f5be5adde760",
    "timestamp": "2025-10-22T19:26:29Z"
  },
  {
    "title": "Is A 'Critical Software' Ban On China Next? Trump Weighs New Sanctions",
    "description": "In a potential escalation of his trade conflict with China, President Donald Trump is exploring sanctions on a vast array of software-powered exports to Beijing. \nAccording to Reuters, the proposed plan would block global shipments of nearly any product conta…",
    "link": "https://biztoc.com/x/a0f8bf0fa6b904d4",
    "timestamp": "2025-10-22T19:26:26Z"
  },
  {
    "title": "NASA Reopens Artemis III Lunar Lander Contract",
    "description": "SpaceX Delays Prompt Move, Musk Reacts NASA is intent on returning astronauts to the Moon as soon as possible, and because of delaysin SpaceX’s Starship Super Heavy and its Starship Lunar Landing System, the agency announced in a surprise shift it is reopenin…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=16C5739E-D7D9-4026-96C2-4D447D02D055",
    "timestamp": "2025-10-22T19:26:15Z"
  },
  {
    "title": "‘It’s Not a Bad Idea!’ Tim Dillon Cracks Up Bernie Sanders by Pushing for AOC-Marjorie Taylor Greene ‘Unity Ticket’",
    "description": "Tim Dillon cracked up Bernie Sanders by suggesting a wild \"unity ticket\" for the 2028 election: Alexandria Ocasio-Cortez and Marjorie Taylor Greene.\nThe post ‘It’s Not a Bad Idea!’ Tim Dillon Cracks Up Bernie Sanders by Pushing for AOC-Marjorie Taylor Greene …",
    "link": "https://www.mediaite.com/media/news/its-not-a-bad-idea-tim-dillon-cracks-up-bernie-sanders-by-pushing-for-aoc-marjorie-taylor-greene-unity-ticket/",
    "timestamp": "2025-10-22T19:26:07Z"
  },
  {
    "title": "Herzog presents Presidential award to Miriam Adelson and pro-Israel German media mogul",
    "description": "Israel's President Isaac Herzog awarded the Medal of Honor to Matthias Döpfner, CEO of a German media giant known for its staunchly pro-Israel editorial stance and the 'Bibileaks' scandal involving Bild, and to megadonor Miriam Adelson, who is said to have sp…",
    "link": "https://www.haaretz.com/israel-news/2025-10-22/ty-article/herzog-presents-presidential-award-to-miriam-adelson-and-pro-israel-german-media-mogul/0000019a-0d34-d77b-a3ff-2ff523820000",
    "timestamp": "2025-10-22T19:24:39Z"
  },
  {
    "title": "Roger Goodell stands by Bad Bunny Super Bowl halftime decision after Trump called it ‘absolutely ridiculous’",
    "description": "Bad Bunny was announced as the Super Bowl LX halftime performer in September.",
    "link": "https://nypost.com/2025/10/22/sports/roger-goodell-stands-by-bad-bunny-super-bowl-halftime-decision/",
    "timestamp": "2025-10-22T19:24:38Z"
  },
  {
    "title": "No charges over images of Trump and Epstein projected on to Windsor Castle during president's visit",
    "description": "Four men arrested over an image of Donald Trump and Jeffrey Epstein projected on to Windsor Castle during the president's visit to the UK have been released without charge.",
    "link": "https://news.sky.com/story/no-charges-over-images-of-trump-and-epstein-projected-onto-windsor-castle-during-presidents-visit-13455405",
    "timestamp": "2025-10-22T19:24:00Z"
  },
  {
    "title": "Karoline Leavitt Suggests Dems Are Just 'Jealous' After White House Demolition Sparks Outrage",
    "description": "“I believe there’s a lot of fake outrage right now,” the press secretary said of the president tearing down a part of the White House to build a ballroom.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-suggests-dems-are-just-jealous-after-white-house-demolition-sparks-outrage_n_68f8fc38e4b077b8da4368f7",
    "timestamp": "2025-10-22T19:22:34Z"
  },
  {
    "title": "Arthur Hayes Expects Bitcoin’s Mega Explosion To $1 Million As New Japan PM Prepares Massive Economic Stimulus",
    "description": "Japan’s new Prime Minister has ordered a fresh round of bold economic measures aimed at easing the burden of inflation on households and firms.",
    "link": "https://zycrypto.com/arthur-hayes-expects-bitcoins-mega-explosion-to-1-million-as-new-japan-pm-prepares-massive-economic-stimulus/",
    "timestamp": "2025-10-22T19:21:03Z"
  },
  {
    "title": "'Biggest threat since Civil War': Senator's marathon anti-Trump speech passes 16-hour mark",
    "description": "Sen. Jeff Merkley on Tuesday night began a marathon speech on the floor of the Senate, which he said was intended to “ring the alarm bells” against President Donald Trump’s authoritarian ambitions.The speech, which began at approximately 6:30 pm ET on Tuesday…",
    "link": "https://www.rawstory.com/jeff-merkeley/",
    "timestamp": "2025-10-22T19:19:03Z"
  },
  {
    "title": "Don't fall for rumor George Soros filed for bankruptcy after funding 'No Kings' protests",
    "description": "The satirical claim poked fun at conservatives who alleged the billionaire was responsible for massive protests in October 2025.",
    "link": "https://www.snopes.com//fact-check/george-soros-bankruptcy-no-kings/",
    "timestamp": "2025-10-22T19:19:00Z"
  },
  {
    "title": "US military destroys boat allegedly moving drugs in Pacific for first time",
    "description": "Previous attacks on vessels in Caribbean have killed at least 32 people",
    "link": "https://www.irishtimes.com/world/us/2025/10/22/us-military-destroys-boat-allegedly-moving-drugs-in-pacific-for-first-time/",
    "timestamp": "2025-10-22T19:18:39Z"
  },
  {
    "title": "Karoline Leavitt unloads on 'bitter' Jean-Pierre after ‘deplorable’ jab, accuses her of lying to Americans",
    "description": "White House press secretary Karoline Leavitt fires back at predecessor Karine Jean-Pierre after being called 'deplorable' in heated political exchange.",
    "link": "https://www.foxnews.com/media/karoline-leavitt-unloads-bitter-jean-pierre-after-deplorable-jab-accuses-her-lying-americans",
    "timestamp": "2025-10-22T19:17:32Z"
  },
  {
    "title": "James Carville Literally Claims Antifa ‘Doesn’t Exist’ In Unhinged Rant",
    "description": "Democratic strategist James Carville literally claimed on \"Politics War Room\" Wednesday that Antifa is non-existent during an inflammatory rant.",
    "link": "https://dailycaller.com/2025/10/22/james-carville-claims-antifa-doesnt-exist/",
    "timestamp": "2025-10-22T19:16:37Z"
  },
  {
    "title": "Galaxy CEO Mike Novogratz Says Bitcoin Is One Trump Move Away From Exploding Past $125,000",
    "description": "Galaxy Digital Inc (NASDAQ:GLXY) CEO Mike Novogratz said the world's largest cryptocurrency could \"take out the topside\" and break above $125,000 if President Donald Trump moves on the Federal Reserve and the pending market structure bill becomes law.\nNovogra…",
    "link": "https://biztoc.com/x/84963a60b392a0d7",
    "timestamp": "2025-10-22T19:15:51Z"
  },
  {
    "title": "DAVID MARCUS: 5 things New York Republicans need to hear from Andrew Cuomo",
    "description": "Andrew Cuomo must win over Republican voters in his mayoral campaign after losing the Democratic primary to far-left candidate Zohran Mamdani.",
    "link": "https://www.foxnews.com/opinion/david-marcus-5-things-new-york-republicans-need-hear-from-andrew-cuomo",
    "timestamp": "2025-10-22T19:14:20Z"
  },
  {
    "title": "NYC rabbis warn Democratic socialist mayoral candidate 'poses a danger' to Jewish New Yorkers",
    "description": "With two weeks until Election Day, a prominent New York City rabbi is urging his congregants not to vote for Democratic socialist Zohran Mamdani for mayor of New York City. Mamdani is the presumed frontrunner in the race for Gracie Mansion with a substantial …",
    "link": "https://freerepublic.com/focus/f-news/4347996/posts",
    "timestamp": "2025-10-22T19:14:08Z"
  },
  {
    "title": "Czech foreign minister blasts election winner Babiš as Orbán’s ‘puppet’",
    "description": "Jan Lipavský told POLITICO he's worried Czechia will be diminished on the world stage under likely incoming PM Andrej Babiš.",
    "link": "https://www.politico.eu/article/czech-foreign-minister-andrej-babis-viktor-orban-politics-eu/",
    "timestamp": "2025-10-22T19:12:32Z"
  },
  {
    "title": "Japan Elects Conservative Politician With Interesting History And Road Ahead",
    "description": "The Japanese parliament elected \"ultraconservative\" Sanae Takaichi on Tuesday as the country's prime minister. She has drawn comparisons to Margaret Thatcher.",
    "link": "https://dailycaller.com/2025/10/22/sanae-takaichi-japan-first-female-prime-minister-conservative-liberal-democratic-party-iron-maiden-drums/",
    "timestamp": "2025-10-22T19:11:33Z"
  },
  {
    "title": "'RIP free and fair elections': Critics aghast as another red state OKs election-rigging",
    "description": "Republicans in North Carolina have passed a new congressional map that eliminates the one genuinely competitive district in the state and makes it likely the GOP will gain an extra seat in next year’s midterm elections.As reported by local news station WRAL, …",
    "link": "https://www.rawstory.com/north-carolina-redistricting-2674223665/",
    "timestamp": "2025-10-22T19:10:05Z"
  },
  {
    "title": "The trends in New Jersey and Virginia (Michael Barone/Washington Examiner)",
    "description": "Michael Barone / Washington Examiner:\nThe trends in New Jersey and Virginia  —  No two states voted more alike and closer to the national average in last year's presidential election than the two states that have gubernatorial elections in this odd-numbered y…",
    "link": "https://www.memeorandum.com/251022/p104",
    "timestamp": "2025-10-22T19:10:00Z"
  },
  {
    "title": "NFL Commissioner Backs Bad Bunny’s Super Bowl Show as Conservatives Keep Melting Down",
    "description": "\"I think it’s going to be an exciting and united moment,\" Roger Goodell told reporters, while also dismissing the possibility of replacing the Puerto Rican superstar",
    "link": "http://www.rollingstone.com/music/music-news/bad-bunny-super-bowl-halftime-show-backed-nfl-roger-goodell-1235452340/",
    "timestamp": "2025-10-22T19:09:56Z"
  },
  {
    "title": "Cuba captures Chinese fentanyl kingpin wanted by Mexico, US",
    "description": "MEXICO CITY: Cuba has arrested a Chinese fentanyl kingpin who escaped custody in Mexico in July and is also wanted by the United States, Mexican security sources told AFP on Wedn",
    "link": "https://www.channelnewsasia.com/world/cuba-captures-chinese-fentanyl-kingpin-wanted-mexico-us-5418796",
    "timestamp": "2025-10-22T19:09:00Z"
  },
  {
    "title": "Daily Signal Is Obtaining Pentagon Press Credentials",
    "description": "There is no greater duty for American journalists than to truthfully inform the public about their government, most especially efforts to keep the homeland safe... Read More\nThe post Daily Signal Is Obtaining Pentagon Press Credentials appeared first on The D…",
    "link": "https://www.dailysignal.com/2025/10/22/daily-signal-is-obtaining-pentagon-press-credentials/",
    "timestamp": "2025-10-22T19:07:44Z"
  },
  {
    "title": "Super Bowl LX Halftime: Bad Bunny Not Going Anywhere: Goodell",
    "description": "It looks like Donald Trump, Kristi Noem, Corey Lewandowski, Mike Johnson, and a whole lot of other Trumpers will be crying a whole lot of MAGA tears come February 2026. That's because NFL Commissioner Roger Goodell made it clear earlier today that Bad Bunny i…",
    "link": "https://bleedingcool.com/tv/super-bowl-lx-halftime-bad-bunny-not-going-anywhere-goodell/",
    "timestamp": "2025-10-22T19:07:06Z"
  },
  {
    "title": "CA redistricting Prop 50 support motivated by national focus, opposing Trump",
    "description": "A majority of California voters oppose Trump's deportation program — many say it weakens their local economy.",
    "link": "https://www.cbsnews.com/news/cbs-news-poll-california-prop-50-redistricting-trump/",
    "timestamp": "2025-10-22T19:06:27Z"
  },
  {
    "title": "Trump Calls Cattle Ranchers Dumb for Being Angry About His Beef Plan",
    "description": "President Donald Trump claimed Wednesday that he knows better than American cattle ranchers as he prepares to gut their business. Writing on Truth Social, the president tried to douse the fire sparked by his offer to buy Argentine beef, claiming that outraged…",
    "link": "https://newrepublic.com/post/202135/donald-trump-cattle-ranchers-ungrateful-beef-argentina",
    "timestamp": "2025-10-22T19:05:45Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In the Central African Republic, the UN Mission there continues to support the country’s peace process, including through the disarmament, demobilization and reintegration process. From 16 to 20 October, it facilitated the disarmament and demobilization of ex…",
    "link": "https://press.un.org/en/2025/db251022.doc.htm",
    "timestamp": "2025-10-22T19:04:42Z"
  },
  {
    "title": "Trump-backed North Carolina House map approved by lawmakers as Republicans aim to pick up seat",
    "description": "Republican lawmakers in North Carolina approve new congressional map designed to boost GOP House control and potentially unseat Democratic Rep. Don Davis.",
    "link": "https://www.foxnews.com/politics/trump-backed-north-carolina-house-map-approved-lawmakers-republicans-aim-pick-up-seat",
    "timestamp": "2025-10-22T19:04:04Z"
  },
  {
    "title": "The Triumphs and Tragedies of the American Revolution",
    "description": "Ken Burns joins David Frum to discuss how his new documentary captures both the triumphs and tragedies of the nation’s founding. Plus: Donald Trump’s TikTok giveaway and Benjamin Nathans’s To the Success of Our Hopeless Cause.",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/10/the-david-frum-show-ken-burns-american-revolution/684656/",
    "timestamp": "2025-10-22T19:03:44Z"
  },
  {
    "title": "‘ZERO tolerance’: Pam Bondi warns Dems threatening federal agents with ‘ICE tracker’",
    "description": "'Now, @RepRobertGarcia and @SenBlumenthal are trying to put agents at risk'",
    "link": "https://www.wnd.com/2025/10/zero-tolerance-pam-bondi-warns-dems-threatening-federal/",
    "timestamp": "2025-10-22T19:02:59Z"
  },
  {
    "title": "‘Two sets of rules’: Ari Melber says LaMonica McIver case highlights DOJ’s double standard",
    "description": "Ari Melber accuses Trump of \"shaking down the government,\" citing a New York Times report and lays out the double standard of his Justice Department.",
    "link": "https://www.msnbc.com/top-stories/latest/two-sets-rules-ari-melber-says-lamonica-mciver-case-highlights-dojs-do-rcna239182",
    "timestamp": "2025-10-22T19:02:19Z"
  },
  {
    "title": "U.S. Military Blows Up Another Boat on Camera, 2 Alleged Traffickers Killed",
    "description": "The Department of War has ordered the destruction of another boat allegedly carrying \"narco-terrorists\" ... and Defense Secretary Pete Hegseth released video of the fatal strike on social media. Hegseth posted the clip Wednesday morning ...…\n Permalink",
    "link": "https://www.tmz.com/2025/10/22/us-military-strike-blows-up-boat-pacific-new-video/",
    "timestamp": "2025-10-22T19:01:24Z"
  },
  {
    "title": "U.S. Attorney for Southern District of New York Jay Clayton Pushes Back on CNBC’s ‘Squawk Box’ Lawfare Claims",
    "description": "U.S.\nThe post U.S. Attorney for Southern District of New York Jay Clayton Pushes Back on CNBC’s ‘Squawk Box’ Lawfare Claims appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/u-s-attorney-southern-district-new-york-jay/",
    "timestamp": "2025-10-22T19:00:49Z"
  },
  {
    "title": "Colombia Overturns Conviction Against Conservative Ex-President Alvaro Uribe",
    "description": "A Colombian appeals court on Tuesday overturned the controversial conviction of conservative former President Álvaro Uribe Vélez on bribery and witness tampering charges.\nThe post Colombia Overturns Conviction Against Conservative Ex-President Álvaro Uribe ap…",
    "link": "https://www.breitbart.com/latin-america/2025/10/22/colombia-overturns-conviction-conservative-ex-president-alvaro-uribe/",
    "timestamp": "2025-10-22T19:00:49Z"
  },
  {
    "title": "'RIP to Free and Fair Elections,' Say North Carolina Dems After GOP Approves New Voting Map",
    "description": "Republicans in North Carolina have passed a new congressional map that eliminates the one genuinely competitive district in the state and makes it likely the GOP will gain an extra seat in next year's midterm elections.As reported by local news station WRAL, …",
    "link": "https://www.commondreams.org/news/north-carolina-congressional-map",
    "timestamp": "2025-10-22T19:00:48Z"
  },
  {
    "title": "NATO ally to pay staff hit by US govt shutdown",
    "description": "Germany will cover wages for thousands of employees at local American bases affected by the Congressional budget impasse Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626827-germany-military-bases-us-shutdown/",
    "timestamp": "2025-10-22T19:00:17Z"
  },
  {
    "title": "Trump Claims DOJ Owes Him $230 Million for Past Investigations of Him",
    "description": "Trump said the final decision on whether or not he is compensated “would have to go across my desk.”…",
    "link": "https://truthout.org/articles/trump-claims-doj-owes-him-230-million-for-past-investigations-of-him/",
    "timestamp": "2025-10-22T18:58:43Z"
  },
  {
    "title": "Majority of Canadians would pay more for groceries from Canada, even if U.S. products cost less: poll",
    "description": "A new poll shows 76 per cent of Canadians are willing to pay more for Canadian-grown food, highlighting national pride amid U.S. trade tensions.",
    "link": "https://nationalpost.com/news/buy-canadian-committment-poll",
    "timestamp": "2025-10-22T18:58:33Z"
  },
  {
    "title": "Republicans Give Themselves Another House Seat Come 2026",
    "description": "North Carolina’s Republican legislature has officially redrawn the state’s legislative map to give the GOP an additional seat in Congress. On Wednesday, the state House approved the new map with a 66-48 vote, which makes the move official after the state Sena…",
    "link": "https://newrepublic.com/post/202139/north-carolina-republicans-maps-house-seat-gerrymandering-2026",
    "timestamp": "2025-10-22T18:58:28Z"
  },
  {
    "title": "SCOOP: Trump's Memphis crime crackdown locates dozens of missing kids, removes 109 gangbangers from streets",
    "description": "The Trump administration's Memphis, Tennessee, crime operation has resulted in 1,309 arrests since August, including gang members and recovery of dozens of missing children.",
    "link": "https://www.foxnews.com/politics/scoop-trumps-memphis-crime-crackdown-locates-dozens-missing-kids-removes-109-gangbangers-from-streets",
    "timestamp": "2025-10-22T18:58:23Z"
  },
  {
    "title": "Latest Trump approval rating: A surprising shift amid shutdown backlash",
    "description": "A recent poll shows a surprising split in public opinion amid the ongoing government shutdown.",
    "link": "https://www.masslive.com/news/2025/10/latest-trump-approval-rating-a-surprising-shift-amid-shutdown-backlash.html",
    "timestamp": "2025-10-22T18:58:06Z"
  },
  {
    "title": "Curtis Sliwa has a point: Voters want conviction — and it’s shaping every race across the country",
    "description": "Pressure is building on Republican mayoral nominee Curtis Sliwa to drop his long-shot quest for Gracie Mansion... But the Guardian Angels founder stubbornly insists he has no intention of doing so. And although he’s terribly, even disastrously wrong about the…",
    "link": "https://freerepublic.com/focus/f-news/4347993/posts",
    "timestamp": "2025-10-22T18:57:23Z"
  },
  {
    "title": "Trump Biographer Sues Melania for Trying to Silence Him on Epstein",
    "description": "Famed Donald Trump biographer Michael Wolff is suing the first lady for defamation.Wolff’s work includes four books on the sitting president as well as extensive interviews with Jeffrey Epstein prior to the pedophilic sex trafficker’s jailhouse suicide. But W…",
    "link": "https://newrepublic.com/post/202142/donald-trump-biographer-sues-melania-epstein",
    "timestamp": "2025-10-22T18:54:42Z"
  },
  {
    "title": "Putin directs Russian nuclear forces drills as summit with Trump is on hold",
    "description": "Russian President Vladimir Putin has directed drills of the country’s strategic nuclear forces that featured practice missile launches.",
    "link": "https://www.pbs.org/newshour/world/putin-directs-russian-nuclear-forces-drills-as-summit-with-trump-is-on-hold",
    "timestamp": "2025-10-22T18:53:09Z"
  },
  {
    "title": "Worried about superintelligence? So are these AI leaders - here's why",
    "description": "Leaders including Geoffrey Hinton and Yoshua Bengio signed a petition arguing that the next phase of AI poses an existential risk to humanity.",
    "link": "https://www.zdnet.com/article/worried-about-superintelligence-so-are-these-ai-leaders-heres-why/",
    "timestamp": "2025-10-22T18:52:50Z"
  },
  {
    "title": "Trump just 'laid bare' the 'absurdity' of John Roberts' catastrophic decision: analysis",
    "description": "President Donald Trump just \"laid bare\" the \"absurdity\" of Chief Justice John Roberts' catastrophic Supreme Court decision, according to new analysis published Wednesday. A new Mother Jones report from reporter Pema Levy describes how Trump can make the decis…",
    "link": "https://www.rawstory.com/john-roberts-2674223534/",
    "timestamp": "2025-10-22T18:51:44Z"
  },
  {
    "title": "Video: Jeff Daniels Sings Trump Protest Song About a 'World Full of Hate' Live on MSNBC",
    "description": "Actor Jeff Daniels sang a protest song during a live interview on MSNBC, lambasting President Donald Trump for creating a \"world of hate.\" The \"Dumb and Dumber\" star also pushed a Democrat talking point about the cost of living.\nThe post Video: Jeff Daniels S…",
    "link": "https://www.breitbart.com/entertainment/2025/10/22/video-jeff-daniels-sings-trump-protest-song-about-a-world-full-of-hate-live-on-msnbc/",
    "timestamp": "2025-10-22T18:51:16Z"
  },
  {
    "title": "NC Passes Trump-Backed Redistricting Map In Latest Red State Effort That Could Cement GOP Edge",
    "description": "Republican legislators in North Carolina approved a new congressional map that could give the GOP  an additional House seat in the 2026 midterm elections.",
    "link": "https://dailycaller.com/2025/10/22/nc-passes-trump-backed-redistricting-map-in-latest-red-state-effort-that-could-cement-gop-edge/",
    "timestamp": "2025-10-22T18:50:52Z"
  },
  {
    "title": "Tucker Carlson schools Turning Point USA event questioner who suggests Trump poop joke threatens free speech",
    "description": "'What I'm defending is the sacred, God-given right of every person to say what he believes'",
    "link": "https://www.wnd.com/2025/10/tucker-carlson-schools-turning-point-usa-event-questioner/",
    "timestamp": "2025-10-22T18:50:34Z"
  },
  {
    "title": "Jasmine Crockett Teases Senate Bid",
    "description": "The firebrand House member would face long odds in the Lone Star State.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-senate-house-redistricting_n_68f9112ee4b01e35ba16dae2",
    "timestamp": "2025-10-22T18:50:30Z"
  },
  {
    "title": "Trump And Obama Spearhead Two Massive Construction Projects And They Couldn’t Be Any More Different",
    "description": "President Donald Trump broke ground on his White House Ballroom on Monday. His vision is drastically different than the building spearheaded by Barack Obama.",
    "link": "https://dailycaller.com/2025/10/22/donald-trump-white-house-renovations-costs-architecture-construction-barack-obama-presidential-center/",
    "timestamp": "2025-10-22T18:47:56Z"
  },
  {
    "title": "Trump eyes fresh tariff probe focused on foreign drug prices",
    "description": "President Trump is initiating a new investigation into drug prices, aiming to compel foreign nations to pay the same as Americans for their medicines. This probe, under Section 301 of the Trade Act, could lead to tariffs or other trade actions against countri…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-eyes-fresh-tariff-probe-focused-on-foreign-drug-prices/articleshow/124746934.cms",
    "timestamp": "2025-10-22T18:47:19Z"
  },
  {
    "title": "Trump eyes fresh tariff probe focused on foreign drug prices",
    "description": "President Trump is initiating a new investigation into drug prices, aiming to compel foreign nations to pay the same as Americans for their medicines. This probe, under Section 301 of the Trade Act, could lead to tariffs or other trade actions against countri…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-eyes-fresh-tariff-probe-focused-on-foreign-drug-prices/articleshow/124746996.cms",
    "timestamp": "2025-10-22T18:47:19Z"
  },
  {
    "title": "Trump says he has final say on paying himself $230m for past investigations (Joseph Gedeon/The Guardian)",
    "description": "Joseph Gedeon / The Guardian:\nTrump says he has final say on paying himself $230m for past investigations  —  President says government owes him ‘a lot of money’ for federal investigations during and after first term  —  Donald Trump declared himself the arbi…",
    "link": "https://www.memeorandum.com/251022/p100",
    "timestamp": "2025-10-22T18:45:00Z"
  },
  {
    "title": "Dallas mayor condemns police chief's 'unilateral' decision to reject $25M ICE grant",
    "description": "Dallas Police Chief Daniel Comeaux rejected a $25 million ICE grant, drawing sharp criticism from Mayor Eric Johnson who called the decision \"unilateral.\"",
    "link": "https://www.foxnews.com/us/dallas-mayor-condemns-police-chiefs-unilateral-decision-reject-25m-ice-grant",
    "timestamp": "2025-10-22T18:44:50Z"
  },
  {
    "title": "Mike Johnson Tries To Act Like Trump's $230M DOJ Demand Is A Normal Thing",
    "description": "\"I know he believes he's owed that reimbursement,\" the House speaker said on Wednesday.",
    "link": "https://www.huffpost.com/entry/mike-johnson-trump-millions-doj_n_68f90708e4b0d0ec549c70da",
    "timestamp": "2025-10-22T18:44:40Z"
  },
  {
    "title": "Understanding Central Bank Digital Currencies (CBDCs): A Guide to the Core Concerns (Stanley Epstein)",
    "description": "1. Introduction: What is a CBDC? A Central Bank Digital Currency (CBDC) is a digital currency issued...",
    "link": "https://www.finextra.com/blogposting/29646/understanding-central-bank-digital-currencies-cbdcs-a-guide-to-the-core-concerns",
    "timestamp": "2025-10-22T18:44:30Z"
  }
]