[
  {
    "title": "Giorgia Meloni's diplomatic tightrope: Can she navigate Italy's role between Trump and EU?",
    "description": "Italian Prime Minister Giorgia Meloni is balancing her nationalist instincts aligned with Trump and Italy's strategic ties with the EU. Facing criticism at home for potentially isolating Italy, Meloni emphasizes the importance of Europe and the U.S. united in…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/giorgia-melonis-diplomatic-tightrope-can-she-navigate-italys-role-between-trump-and-eu/articleshow/119299880.cms",
    "timestamp": "2025-03-21T10:44:02Z"
  },
  {
    "title": "Trump Lashes Out at Judges in Rant Against Blizzard of Injunctions: ‘The Danger Is Unparalleled!’",
    "description": "Trump raged at the blizzard of injunctions and rulings his administration has faced in a social media rant warning, \"The danger is unparalleled!!!\"\nThe post Trump Lashes Out at Judges in Rant Against Blizzard of Injunctions: ‘The Danger Is Unparalleled!’ firs…",
    "link": "https://www.mediaite.com/news/trump-lashes-out-at-judges-in-rant-against-blizzard-of-injunctions-the-danger-is-unparalleled/",
    "timestamp": "2025-03-21T10:42:17Z"
  },
  {
    "title": "Maine Inn Owner Reveals Damning Impact Of Trump’s Canada Rhetoric On His Business",
    "description": "Canadian anger is \"incredibly justified,\" said Sterling Morse, whose business is just 150 miles from the border and relies on Canadian tourists.",
    "link": "https://www.huffpost.com/entry/maine-hotel-owner-trump-canada_n_67dd3955e4b0727e46b7a3b2",
    "timestamp": "2025-03-21T10:41:17Z"
  },
  {
    "title": "Puck this: Could a Cold War relic help revitalize US-Russia relations?",
    "description": "Hockey diplomacy: Can Putin and Trump revive a Cold War tradition? Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614571-cold-war-russia-us-relations/",
    "timestamp": "2025-03-21T10:39:34Z"
  },
  {
    "title": "Republican Just Laughs As Crowd Boos Her Unmercifully",
    "description": "Even though Wyoming is one of the reddest states in the nation, there are still some Democrats there, and it would seem that damn near all of them came out to lustily boo the waste product that is Rep. Harriet Hageman. She soaked up all their boos and jeers, …",
    "link": "https://crooksandliars.com/2025/03/republican-just-laughs-crowd-boos-her",
    "timestamp": "2025-03-21T10:38:00Z"
  },
  {
    "title": "Russia Claims Ukraine Strike on Sudzha Gas Pipe Breaks Trump Ceasefire Deal",
    "description": "The Ukrainians have also accused Russia of striking the key Russian gas infrastructure.",
    "link": "https://www.newsweek.com/russia-claims-ukraine-strike-sudzha-gas-pipe-breaks-trump-ceasefire-deal-2048451",
    "timestamp": "2025-03-21T10:37:27Z"
  },
  {
    "title": "Democrats' new internet strategy tops trending charts but also draws mockery from allies and foes",
    "description": "Democratic lawmakers are courting online content creators, podcasters and celebrities in a bid to find new ways to boost their message to voters. The effort is spearheaded by Democratic leaders on Capitol Hill determined to show their party is responding to t…",
    "link": "https://www.seattlepi.com/news/politics/article/democrats-new-internet-strategy-tops-trending-20233566.php",
    "timestamp": "2025-03-21T10:37:18Z"
  },
  {
    "title": "Kremlin says Putin order not to hit Ukraine energy targets still 'in force'",
    "description": "The Kremlin said on Friday that Russian President Vladimir Putin's order not to strike energy targets in Ukraine was still in force, despite Kyiv accusing Moscow of breaking it several times. Putin ordered a limited, 30-day pause on strikes targeting Ukrainia…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/kremlin-says-putin-order-not-to-hit-ukraine-energy-targets-still-in-force/articleshow/119299109.cms",
    "timestamp": "2025-03-21T10:35:54Z"
  },
  {
    "title": "Trump signs order seeking to dismantle Department of Education. What happens to student loans?",
    "description": "US President Donald Trump kicked off the process of dismantling the Department of Education by signing an executive order on Thursday. The move aims to fulfill a longstanding campaign promise and shift more power over education to the states. The department s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-signs-order-seeking-to-dismantle-department-of-education-what-happens-to-student-loans/articleshow/119299291.cms",
    "timestamp": "2025-03-21T10:35:51Z"
  },
  {
    "title": "Elon Musk, world's richest man, is offering $200 dollar for signing this petition",
    "description": "Elon Musk promoted a cash giveaway for Wisconsin voters to sign a petition opposing 'activist judges,' aligning with Trump's agenda. America PAC offers $100 to signers and their referrals, while the Justice Department flags possible legal violations. Musk don…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-worlds-richest-man-is-offering-200-dollar-for-signing-this-petition/articleshow/119299345.cms",
    "timestamp": "2025-03-21T10:32:36Z"
  },
  {
    "title": "Trump sends blunt warning for Tesla vandals: ‘WE ARE LOOKING FOR YOU!’",
    "description": "President Donald Trump threatened imprisonment in a stern warning to the Tesla saboteurs that are setting the electric vehicles ablaze in defiance of CEO Elon Musk.",
    "link": "https://nypost.com/2025/03/21/us-news/trump-warns-tesla-arsonists-with-jailtime-after-bondi-announces-charges-against-domestic-terrorists/",
    "timestamp": "2025-03-21T10:32:05Z"
  },
  {
    "title": "Massie tests Trump’s appetite for a primary fight",
    "description": "The News\nPresident Donald Trump has threatened to take down Rep. Thomas Massie before. Now he’s trying again, at the peak of his power in the GOP — and might even succeed this time.\nIt all depends on how much effort Trump and his allies want to put into findi…",
    "link": "https://biztoc.com/x/ae13b6d799955deb",
    "timestamp": "2025-03-21T10:31:33Z"
  },
  {
    "title": "Is Europe Willing To Trade a U.S. Nuclear Guarantee for a French One? | Opinion",
    "description": "French President Emmanuel Macron is certainly open to it.",
    "link": "https://www.newsweek.com/europe-willing-trade-us-nuclear-guarantee-french-one-opinion-2048119",
    "timestamp": "2025-03-21T10:30:01Z"
  },
  {
    "title": "How Black Americans Can Fight Trump’s Plot to Capture a Generation of Minds",
    "description": "Only two months into his return to power, President Donald Trump has moved with astonishing speed to achieve his goal of ridding American classrooms of so-called “radical indoctrination,” MAGA-speak for educational efforts that prioritize diversity, equity, a…",
    "link": "https://www.motherjones.com/media/2025/03/karida-l-brown-battle-for-the-black-mind-donald-trump/",
    "timestamp": "2025-03-21T10:30:00Z"
  },
  {
    "title": "How to Avoid US-Based Digital Services—and Why You Might Want To",
    "description": "Amid growing concerns over Big Tech firms aligning with Trump administration policies, people are starting to move their digital lives to services based overseas. Here's what you need to know.",
    "link": "https://www.wired.com/story/trump-era-digital-expat/",
    "timestamp": "2025-03-21T10:30:00Z"
  },
  {
    "title": "EU capital flight tops $300 billion – European Council president",
    "description": "Investors are pulling their money out of the bloc amid soaring energy prices and excessive red tape, according to Antonio Costa  Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614579-eu-capital-outflow-costa/",
    "timestamp": "2025-03-21T10:29:21Z"
  },
  {
    "title": "Be Warned: Khamenei Vows 'Hard Slap' Response to U.S. If It Dares Challenge Iran",
    "description": "Iran's supreme leader Ayatollah Ali Khamenei warned Friday the U.S. should prepare for a \"hard slap\" if it dares challenge Tehran, after President Donald Trump warned of possible military action against the Islamic republic.\nThe post Be Warned: Khamenei Vows …",
    "link": "https://www.breitbart.com/europe/2025/03/21/be-warned-khamenei-vows-hard-slap-response-to-u-s-if-it-dares-challenge-iran/",
    "timestamp": "2025-03-21T10:26:07Z"
  },
  {
    "title": "Putin's Order Not To Strike Ukraine Energy Targets 'In Force': Kremlin",
    "description": "The Kremlin said Friday that President Vladimir Putin&#039;s order not to strike energy targets in Ukraine was still in force, despite Kyiv accusing Moscow of breaking the truce several times.",
    "link": "https://www.ndtv.com/world-news/russia-vladimir-putin-order-not-to-strike-ukraine-energy-targets-still-in-force-kremlin-on-war-7976060",
    "timestamp": "2025-03-21T10:24:19Z"
  },
  {
    "title": "19 years of Twitter: From ‘Larry the bird’ to an X, a timeline of how the platform has evolved",
    "description": "Twitter, now rebranded as X, has evolved from a simple messaging platform to a global communications powerhouse. Key milestones include its role in social activism, the introduction of trending topics and ads, its public listing, and Elon Musk’s acquisition i…",
    "link": "https://economictimes.indiatimes.com/tech/technology/19-years-of-twitter-from-larry-the-bird-to-an-x-a-timeline-of-how-the-platform-has-evolved/articleshow/119298594.cms",
    "timestamp": "2025-03-21T10:24:06Z"
  },
  {
    "title": "Germany’s Landmark Spending Bill Wins Final Lawmaker Approval",
    "description": "Germany’s move to unlock hundreds of billions of euros in debt-financed defense and infrastructure spending passed its final legislative hurdle on Friday when lawmakers in the upper house of parliament in Berlin approved the measures.",
    "link": "https://financialpost.com/pmn/business-pmn/germanys-landmark-spending-bill-wins-final-lawmaker-approval",
    "timestamp": "2025-03-21T10:23:53Z"
  },
  {
    "title": "Germany: Upper house signs off on landmark debt reform plan",
    "description": "Approval from Germany's 16 federal states was the final hurdle in passing a historic change to the country's debt borrowing rules into law. Germany's second chamber of parliament, the Bundesrat, on Friday, voted in favor of a massive spending package that is …",
    "link": "https://www.dw.com/en/germany-upper-house-signs-off-on-landmark-debt-reform-plan/a-71992709",
    "timestamp": "2025-03-21T10:21:00Z"
  },
  {
    "title": "Hiltzik: Why Tesla's bumpy ride may not be over",
    "description": "Why Tesla’s bumpy ride may not be over\nIt wasn’t that long ago — Dec. 17, in fact — that Tesla seemed to be riding high.\nOn that date its shares hit an all-time high of $484.79. Its market capitalization exceeded $1.5 trillion. The election of Donald Trump se…",
    "link": "https://biztoc.com/x/59572ab511158043",
    "timestamp": "2025-03-21T10:20:44Z"
  },
  {
    "title": "Flee Canada? Companies considering a U.S. move quickly learn it’s costly and complicated – and can even backfire",
    "description": "Canadian companies must pay a departure tax worth roughly 25 per cent of their net assets on their way out and any perceived U.S. tax benefits usually aren’t that great",
    "link": "https://www.theglobeandmail.com/business/article-flee-canada-companies-considering-a-us-move-quickly-learn-its-costly/",
    "timestamp": "2025-03-21T10:20:35Z"
  },
  {
    "title": "Prominent Law Firm Escapes Trump's Ire After Folding To His Demands",
    "description": "Paul, Weiss, Rifkind, Garrison & Wharton pledged to provide tens of millions of dollars in free legal services to support certain White House initiatives.",
    "link": "https://www.huffpost.com/entry/trump-rescinds-executive-order-against-law-firm_n_67dd3af8e4b0727e46b7a43f",
    "timestamp": "2025-03-21T10:20:29Z"
  },
  {
    "title": "Is Trump eyeing control over Ukraine’s gas infrastructure?",
    "description": "The U.S. administration proposed assisting in managing Ukraine's power infrastructure amid its conflict with Russia. Concurrently, Ukraine began importing U.S. LNG to fulfill domestic needs and offers its extensive storage for European gas, potentially enhanc…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-trump-eyeing-control-over-ukraines-gas-infrastructure/articleshow/119298803.cms",
    "timestamp": "2025-03-21T10:19:53Z"
  },
  {
    "title": "Rosie O’Donnell says she’s ‘healthier’ and ‘sleeping better’ after leaving the United States",
    "description": "‘It's not easy to move to another country, and we really felt as a family this was the safest and best thing for us to do,’ she said",
    "link": "https://www.the-independent.com/life-style/rosie-odonnell-ireland-us-trump-b2719287.html",
    "timestamp": "2025-03-21T10:18:32Z"
  },
  {
    "title": "‘You’re insane!’: Ex-DNC spokesperson takes heat from two Republicans over Musk report",
    "description": "Former DNC Communications Director Xochitl Hinojosa found herself in the middle of a double onslaught of Republican attacks during a fiery CNN panel as she blasted billionaire Trump ally Elon Musk’s reported Pentagon briefing on Friday.The briefing, which a N…",
    "link": "https://www.rawstory.com/elon-musk-2671374308/",
    "timestamp": "2025-03-21T10:16:33Z"
  },
  {
    "title": "As the US dismantles its soft power tools, Russia still spends billions on propaganda",
    "description": "Donald Trump's peace diplomacy, for which the US president hopes to win a Nobel Peace Prize, has not produced the desired results: the war in Ukraine did not end in 24 hours. Meanwhile, Voice of America and Radio Free Europe/Radio Liberty are being shut down,…",
    "link": "https://voxeurop.eu/en/trump-radio-free-europe-putin-propaganda/",
    "timestamp": "2025-03-21T10:13:20Z"
  },
  {
    "title": "Analysis-Italy's Meloni torn between Trump and European allegiance",
    "description": "ROME (Reuters) - Italian Prime Minister Giorgia Meloni finds herself playing a political balancing act as Europe moves to bolster its defences.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/21/analysis-italy039s-meloni-torn-between-trump-and-european-allegiance",
    "timestamp": "2025-03-21T10:12:00Z"
  },
  {
    "title": "Can Donald Trump and Elon Musk help Conor McGregor become Ireland’s President?",
    "description": "UFC fighter Conor McGregor has entered Ireland’s presidential race, vowing to combat migration. His association with Donald Trump and Elon Musk, however, may hinder his chances, with analysts deeming it unlikely he will secure necessary nominations or signifi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/can-donald-trump-and-elon-musk-help-conor-mcgregor-become-irelands-president/articleshow/119298322.cms",
    "timestamp": "2025-03-21T10:09:06Z"
  },
  {
    "title": "Boeing Beats Out Lockheed For USAF Contract",
    "description": "Sixth-Generation Air Dominance Fighter To Replace F-22 Raptor President Donald Trump and Secretary of Defense Pete Hegseth announced that Boeing has been awarded a $20 billion contract to develop and manufacture the U.S. Air Force’s Next Generation Air Domina…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=68A3639E-FA34-44E6-9692-E178F125C514",
    "timestamp": "2025-03-21T10:05:00Z"
  },
  {
    "title": "DOGE Addresses 'Confusion' Over Closures of Social Security Sites",
    "description": "DOGE has listed 47 SSA field office leases set to end across the country.",
    "link": "https://www.newsweek.com/doge-confusion-social-security-office-closures-2048362",
    "timestamp": "2025-03-21T10:04:24Z"
  },
  {
    "title": "Meet the Educational Entrepreneurs Who Want to Teach a New Generation of Elon Musks",
    "description": "In February, Elon Musk tweeted a warning shot. “When not wasting money on bureaucracy,” he wrote, “The Department of Education has been funding anti-Americanism, gender nonsense and anti-meritocratic racism.” By the end of the month, the department had been s…",
    "link": "https://www.motherjones.com/politics/2025/03/elon-musk-schools/",
    "timestamp": "2025-03-21T10:01:00Z"
  },
  {
    "title": "Families of Venezuelan migrants deported to El Salvador on a desperate hunt for answers",
    "description": "Yurliana Andreina Chacin Gómez gripped her cellphone, her three-year old daughter clinging on, as the voice of a federal official boomed through the phone.",
    "link": "https://www.cnn.com/2025/03/21/politics/deported-migrants-families/index.html",
    "timestamp": "2025-03-21T10:00:52Z"
  },
  {
    "title": "Crypto Sleuth Claims Mysterious $20M ‘Hyperliquid Whale’ Is Tied To Illicit Activity",
    "description": "Crypto detective ZachXBT alleged that the mysterious “Hyperliquid whale” that’s been making headlines across the crypto community is suspected to be a convicted criminal from the UK. The trader has made around $20 million in profit from leveraged trading, rai…",
    "link": "http://www.newsbtc.com/news/crypto-sleuth-claims-mysterious-20m-hyperliquid-whale-is-tied-to-illicit-activity/",
    "timestamp": "2025-03-21T10:00:49Z"
  },
  {
    "title": "Boston mayor defends sanctuary city status from 'bullies,' 'presidents who think they are kings'",
    "description": "Boston Mayor Michelle Wu used her recent State of the City address to blast President Donald Trump and Republicans' efforts to enforce federal immigration laws.",
    "link": "https://www.foxnews.com/media/boston-mayor-defends-sanctuary-city-status-from-bullies-presidents-who-think-kings",
    "timestamp": "2025-03-21T10:00:39Z"
  },
  {
    "title": "Maggie Haberman Explains How Trump's 'Very Risky Game' With Judges May Backfire",
    "description": "The New York Times reporter also pointed out a key omission from the president's latest rant about Judge James Boasberg.",
    "link": "https://www.huffpost.com/entry/maggie-haberman-donald-trump-risky-game_n_67dd2b1fe4b057e79d079961",
    "timestamp": "2025-03-21T10:00:29Z"
  },
  {
    "title": "Quiz of The Week: 15 - 21 March",
    "description": "Have you been paying attention to The Week's news?",
    "link": "https://theweek.com/puzzles/quiz-of-the-week-15-21-march",
    "timestamp": "2025-03-21T10:00:09Z"
  },
  {
    "title": "John Roberts Is Responsible for the High Court's Self-Delegitimization | Opinion",
    "description": "It seems Judge Boasberg and Chief Justice Roberts need a remedial legal lesson or two.",
    "link": "https://www.newsweek.com/john-roberts-responsible-high-courts-self-delegitimization-opinion-2048333",
    "timestamp": "2025-03-21T10:00:02Z"
  },
  {
    "title": "Trump Wants to Revive the Timber Industry—but Shot Himself in the Foot",
    "description": "Days before new tariffs on Canada, Mexico, and China took effect earlier this month, President Trump issued two executive orders. One bemoaned America’s status as a net importer of lumber, ordering the secretary of commerce to investigate the “national securi…",
    "link": "https://newrepublic.com/post/192972/trump-timber-logging-federal-lands-forest-service",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Elon Musk Is the One Who Set Tesla on Fire",
    "description": "Last week, Donald Trump hosted an impromptu infomercial at the White House for Elon Musk’s embattled car company, Tesla. This week, Tesla recalled every Cybertruck the company has made since November 2023 because of an exterior steel panel that can separate f…",
    "link": "https://newrepublic.com/article/192995/elon-musk-tesla-fire-cybertruck",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Beyond Congress: How the Blue States Can Lead the Trump Resistance",
    "description": "Democrats across the country are desperate for our party to take a more aggressive and coherent fighting stance against Donald Trump. That is why there is so much anger about the decision by Senate Democrats not to filibuster President Trump’s bill to keep th…",
    "link": "https://newrepublic.com/article/192962/blue-states-lead-trump-resistance-beyond-congress",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Heading into a tariff year, Manitoba banks on growth while forecasting decline",
    "description": "Manitoba's 2025-26 budget is a mix of optimism and caution, with big spending increases and revenue-growth projections sharing space with contingencies for economic disaster.",
    "link": "https://www.cbc.ca/news/canada/manitoba/manitoba-budget-2025-2026-analysis-1.7489455",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Leftist Nonprofit Tries To Smear Election Integrity Efforts With ‘Hocus-Pocus’ Study",
    "description": "The CEO of a leftist group claims conservatives funded 'election deniers and anti-voting rights organizations,' citing a questionable study.",
    "link": "https://thefederalist.com/2025/03/21/leftist-nonprofit-tries-to-smear-election-integrity-efforts-with-hocus-pocus-study/",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Inside Trump and Musk’s Takeover of NASA",
    "description": "So far, *NASA*{: .small} has been spared the sweeping cuts that *DOGE*{: .small} has unleashed on other federal agencies. Is that about to change?",
    "link": "https://www.newyorker.com/news/the-lede/inside-trump-and-musks-takeover-of-nasa",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Dear Chuck Schumer, the 'old' Republican Party is never coming back",
    "description": "Sen. Chuck Schumer became the latest Democrat to say that he thinks the old Republican Party will come back one day.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/chuck-schumer-republican-party-future-trump-rcna197092",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "The Tesla Secret That Exposes Elon Musk’s Whole Game",
    "description": "Two egos like Elon Musk’s and Donald Trump’s could never share the spotlight if it weren’t for the unifying force of grifter solidarity—two oligarchs teaming up to further tip the scales against everyone else. Just as Trump’s P.R. campaign as a canny dealmake…",
    "link": "https://newrepublic.com/article/192993/tesla-elon-musk-credits-money",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Greenpeace Verdict Stems From “Weaponization of the Legal System,” Advocates Say",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. The verdict against the environmental group Greenpeace finding it liable for huge damages to a pipeline company over protests has been descri…",
    "link": "https://www.motherjones.com/politics/2025/03/greenpeace-verdict-standing-rock-dakota-access-pipeline-energy-transfer-kelcy-warren-reaction-environmental-groups/",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Donald Trump’s America Echoes Our Puritan Past",
    "description": "Us-versus-them thinking. High-control habits. An obsession with punishment. Some aspects of the MAGA movement are a lot older than you might think.",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-america-echoes-our-puritan-past",
    "timestamp": "2025-03-21T10:00:00Z"
  },
  {
    "title": "Trump Rejects Report Elon Musk Will Be Briefed on War With China: ‘Fake News Is at It Again’",
    "description": "President Donald Trump denied a New York Times report which claimed Elon Musk would be briefed on a potential war with China, Thursday.\nThe post Trump Rejects Report Elon Musk Will Be Briefed on War With China: ‘Fake News Is at It Again’ first appeared on Med…",
    "link": "https://www.mediaite.com/news/trump-rejects-report-elon-musk-will-be-briefed-on-war-with-china-fake-news-is-at-it-again/",
    "timestamp": "2025-03-21T09:59:20Z"
  },
  {
    "title": "It’s not just impeachments. Republicans are eyeing other ways to rein in federal judges.",
    "description": "House Republicans don’t have the votes to impeach any federal judges. But a growing number of hard-liners is discussing several other legislative options as GOP leaders search for a release valve for the MAGA fury building over recent court rulings checking P…",
    "link": "https://freerepublic.com/focus/f-chat/4305768/posts",
    "timestamp": "2025-03-21T09:58:34Z"
  },
  {
    "title": "Tulsi Gabbard's India visit highlights strong US-India relationship",
    "description": "US Director of National Intelligence Tulsi Gabbard's visit to India underscores the long-standing US-India relationship, enhanced by the partnership between Prime Minister Modi and President Trump. Gabbard's visit focused on intelligence-sharing, defense, cou…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tulsi-gabbards-india-visit-highlights-strong-us-india-relationship/articleshow/119297778.cms",
    "timestamp": "2025-03-21T09:57:25Z"
  },
  {
    "title": "From Tesla to Twitter and SpaceX, meet Elon Musk's go-to man who now oversees DOGE: Key points",
    "description": "Steve Davis has been appointed by US President Donald Trump's close aide Elon Musk as the head of the Department of Government Efficiency to streamline US government operations. A longtime collaborator and Musk's go-to-man, Davis now oversees DOGE and 'hates …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-steve-davis-from-tesla-to-twitter-and-spacex-meet-elon-musks-go-to-man-who-now-oversees-doge-key-points/articleshow/119297209.cms",
    "timestamp": "2025-03-21T09:50:18Z"
  },
  {
    "title": "The Alleged Hamas Link That Landed Indian Researcher In Trouble In US",
    "description": "An Indian researcher's arrest in the US over his alleged ties to Hamas has put the focus on his in-laws, a Palestine-origin family with alleged links to the Palestinian group fighting a year-long war with Israel.",
    "link": "https://www.ndtv.com/world-news/badar-khan-suri-the-alleged-hamas-link-that-landed-indian-researcher-in-trouble-in-us-7974432",
    "timestamp": "2025-03-21T09:50:06Z"
  },
  {
    "title": "World's glacier mass shrank again in 2024, says UN",
    "description": "All 19 of the world's glacier regions experienced a net loss of mass in 2024 for the third consecutive year, the United Nations said on Friday, warning that saving the planet's glaciers was now a matter of \"survival.\"",
    "link": "https://phys.org/news/2025-03-world-glacier-mass-shrank.html",
    "timestamp": "2025-03-21T09:50:02Z"
  },
  {
    "title": "Trump warns of jail time for Tesla vandals, anyone funding the attacks: 'WE ARE LOOKING FOR YOU!!!'",
    "description": "President Donald Trump said anyone committing or funding attacks on Tesla vehicles and properties across the country will likely go to jail for up to 20 years",
    "link": "https://www.foxnews.com/us/trump-warns-jail-time-tesla-vandals-anyone-funding-attacks-we-looking-you",
    "timestamp": "2025-03-21T09:49:46Z"
  },
  {
    "title": "Iran's Khamenei says US threats 'will get them nowhere'",
    "description": "Iran's supreme leader said on Friday that U.S. threats against his country \"will get them nowhere\", after President Donald Trump warned of possible military action against the Islamic republic.",
    "link": "https://www.hurriyetdailynews.com/irans-khamenei-says-us-threats-will-get-them-nowhere-207179",
    "timestamp": "2025-03-21T09:48:05Z"
  },
  {
    "title": "Global supply disruption to push up premium on domestic gold prices",
    "description": "RBI moved 102 tonnes of gold from the Bank of England’s vaults to India; many central banks have moved their gold reserves stored in London to their own country in anticipation of geo-political issues",
    "link": "https://www.thehindubusinessline.com/markets/gold/global-supply-disruption-to-push-up-premium-on-domestic-gold-prices/article69357034.ece",
    "timestamp": "2025-03-21T09:45:38Z"
  },
  {
    "title": "Trump floats US takeover of Ukraine nuclear plants",
    "description": "Washington (AFP) Mar 20, 2025\n\n\n Donald Trump has told Volodymyr Zelensky that the United States could own and run Ukraine's nuclear power plants as part of his latest bid to secure a ceasefire in Russia's invasion of its neighbor. \n\nThe offer comes as some 3…",
    "link": "https://www.nuclearpowerdaily.com/reports/Trump_floats_US_takeover_of_Ukraine_nuclear_plants_999.html",
    "timestamp": "2025-03-21T09:38:02Z"
  },
  {
    "title": "Trump's call for AI deregulation gets strong backing from Big Tech",
    "description": "Washington (AFP) Mar 21, 2025\n\n\n Major tech firms are pushing the administration of President Donald Trump to loosen rules on building artificial intelligence, arguing it is the only way to maintain a US edge and compete with China. \n\nSpooked by generative AI…",
    "link": "https://www.spacedaily.com/reports/Trumps_call_for_AI_deregulation_gets_strong_backing_from_Big_Tech_999.html",
    "timestamp": "2025-03-21T09:38:02Z"
  },
  {
    "title": "US Airstrikes Aren't Stopping Houthi Attacks",
    "description": "The Houthi rebels have launched attacks in the Red Sea and against Israel despite the airstrikes ordered by President Donald Trump",
    "link": "https://biztoc.com/x/ed12c37d7197dccc",
    "timestamp": "2025-03-21T09:35:11Z"
  },
  {
    "title": "If Trump Defies the Courts, Here’s What a Judge Can Do",
    "description": "Amid the growing battle between President Donald Trump and the courts, a once-unthinkable question is harder to shrug off: Will the administration deliberately defy federal judges if it doesn’t get what it wants? The issue has come into sharp relief in the ch…",
    "link": "https://freerepublic.com/focus/f-chat/4305767/posts",
    "timestamp": "2025-03-21T09:32:59Z"
  },
  {
    "title": "Eric Trump joins Bitcoin firm Metaplanet’s advisory board, stock surges 17%",
    "description": "Tokyo-listed Bitcoin treasury firm Metaplanet has appointed Eric Trump, the son of US President Donald Trump, to its newly formed Strategic Board of Advisors. Metaplanet announced Trump’s appointment on March 21, confirming that he will join as the first offi…",
    "link": "https://cryptoslate.com/eric-trump-joins-bitcoin-firm-metaplanets-advisory-board-stock-surges-17/",
    "timestamp": "2025-03-21T09:32:59Z"
  },
  {
    "title": "China's Western Hemisphere Expansion Threatens America, US Says",
    "description": "China said there were \"no geopolitical calculations\" in its cooperation with countries in Latin America.",
    "link": "https://www.newsweek.com/china-western-hemisphere-expansion-threat-us-latin-america-caribbean-2048398",
    "timestamp": "2025-03-21T09:30:24Z"
  },
  {
    "title": "US Airstrikes Aren't Stopping Houthi Attacks",
    "description": "The Houthi rebels have launched attacks in the Red Sea and against Israel despite the airstrikes ordered by President Donald Trump",
    "link": "https://www.newsweek.com/us-airstrikes-arent-stopping-houthi-attacks-2048400",
    "timestamp": "2025-03-21T09:30:09Z"
  },
  {
    "title": "Why America’s tech industry relies so heavily on foreign workers",
    "description": "A heated debate has recently erupted between two groups of supporters of President Donald Trump. The dispute concerns the H-1B visa system, the program that allows U.S. employers to hire skilled foreign workers in specialty occupations—mostly in the tech indu…",
    "link": "https://www.fastcompany.com/91303246/why-americas-tech-industry-relies-so-heavily-on-foreign-workers",
    "timestamp": "2025-03-21T09:30:00Z"
  },
  {
    "title": "Italian paper prints fully-AI edition, but not to 'kill' journalism",
    "description": "In a world first, an Italian newspaper is printing a fully AI-generated edition for a month in what its director said Thursday was an experiment to \"revitalize journalism, not to kill it.\"",
    "link": "https://techxplore.com/news/2025-03-italian-paper-fully-ai-journalism.html",
    "timestamp": "2025-03-21T09:28:55Z"
  },
  {
    "title": "President Trump worse than every president in modern history in key area, new polling shows",
    "description": "President Trump worse than every president in modern history in key area, new polling showspennlive.com",
    "link": "https://www.pennlive.com/news/2025/03/donald-trump-is-worse-than-every-president-in-modern-history-in-key-area-new-polling-shows.html",
    "timestamp": "2025-03-21T09:27:11Z"
  },
  {
    "title": "Cisco Smart Licensing Utility flaws actively exploited in the wild",
    "description": "Experts warn of the active exploitation of two recently patched security vulnerabilities affecting Cisco Smart Licensing Utility. Cisco disclosed two vulnerabilities in its Smart Licensing Utility: CVE-2024-20439, a static credential backdoor, and CVE-2024-20…",
    "link": "https://securityaffairs.com/175692/security/cisco-smart-licensing-utility-flaws-actively-exploited-in-the-wild.html",
    "timestamp": "2025-03-21T09:26:27Z"
  },
  {
    "title": "Trump targeted 20 of the biggest law firms over their diversity programs. A GOP favorite is missing from the list.",
    "description": "Donald Trump has lavished his loyal lawyers with rewards while targeting those he believes wronged him.",
    "link": "https://www.businessinsider.com/trumps-law-firm-diversity-programs-jones-day-2025-3",
    "timestamp": "2025-03-21T09:25:01Z"
  },
  {
    "title": "US Targets China's 'Teapot' Oil Refiners to Choke Iran",
    "description": "Washington has issued new Iran-related sanctions, including a Chinese \"teapot,\" or independent refiner, and vessels that supply oil.",
    "link": "https://www.newsweek.com/china-us-oil-iran-trump-2048368",
    "timestamp": "2025-03-21T09:20:27Z"
  },
  {
    "title": "Is the Trump conflict with judges a constitutional crisis? What to know",
    "description": "Legal experts warn that the country is sliding toward a constitutional crisis as President Donald Trump openly defies the federal courts.",
    "link": "https://abcnews.go.com/Politics/trump-administrations-conflict-judges-constitutional-crisis/story?id=119981540",
    "timestamp": "2025-03-21T09:20:12Z"
  },
  {
    "title": "Foreign adversaries may swoop in to recruit fired federal workers, experts say",
    "description": "Thousands of fired federal workers offer appealing experience and skills -- to the private sector and foreign adversaries alike, experts tell ABC News.",
    "link": "https://abcnews.go.com/Politics/foreign-adversaries-private-sector-state-governments-swoop-recruit/story?id=119923215",
    "timestamp": "2025-03-21T09:17:40Z"
  },
  {
    "title": "Crypto price today: Bitcoin falls below $84k as geopolitical tensions rise",
    "description": "Bitcoin and major cryptos fell amid geopolitical tensions and US tariff concerns. Central banks held rates steady. Trump reiterated pro-crypto stance, but sentiment remained cautious. Altcoins also declined as investors sought safe-haven assets.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/crypto-price-today-bitcoin-falls-below-84k-as-geopolitical-tensions-rise/articleshow/119296042.cms",
    "timestamp": "2025-03-21T09:17:38Z"
  },
  {
    "title": "EU sidesteps Hungary veto, but more Ukraine showdowns loom",
    "description": "Budapest is quite content being the odd one out on Ukraine. The rest of the EU is also increasingly happy to bypass Hungarian vetoes — at least when it can.",
    "link": "https://www.dw.com/en/eu-sidesteps-hungary-veto-but-more-ukraine-showdowns-loom/a-71991130",
    "timestamp": "2025-03-21T09:17:00Z"
  },
  {
    "title": "The End of USAID Is an Opportunity for Africa",
    "description": "Reducing foreign aid can help end dependency and promote African agency.",
    "link": "http://foreignpolicy.com/2025/03/21/usaid-africa-foreign-aid-development/",
    "timestamp": "2025-03-21T09:16:32Z"
  },
  {
    "title": "Trump denies Musk to be briefed on top-secret plan for potential war with China",
    "description": "The New York Times reported that the briefing would include 20 to 30 slides outlining how the United States would fight in a conflict with China.",
    "link": "https://nypost.com/2025/03/21/us-news/trump-denies-musk-to-be-briefed-on-top-secret-plan-for-potential-war-with-china/",
    "timestamp": "2025-03-21T09:16:31Z"
  },
  {
    "title": "'We are looking for you': Trump has a warning for people vandalising Teslas, says they will be thrown in jails for 20 years",
    "description": "US President Donald Trump announced that individuals caught sabotaging Tesla cars could face up to twenty years in jail. This comes after violent attacks on Tesla properties. US Attorney General Pam Bondi termed these attacks as domestic terrorism. Tesla’s CE…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-are-looking-for-you-trump-has-a-warning-for-people-vandalising-teslas-says-they-will-be-thrown-in-jails-for-20-years/articleshow/119296090.cms",
    "timestamp": "2025-03-21T09:16:17Z"
  },
  {
    "title": "Explained: Inside Donald Trump's Dismantling Of US Education Department",
    "description": "US President Donald Trump is close to fulfilling a long-standing conservative ambition: the complete dismantling of Department of Education.",
    "link": "https://www.ndtv.com/world-news/donald-trump-explained-inside-donald-trumps-dismantling-of-us-education-department-7975487",
    "timestamp": "2025-03-21T09:15:52Z"
  },
  {
    "title": "Naheed Nenshi needs to get his elbows up",
    "description": "Naheed Nenshi has never failed at politics before. But if he keeps going the way he has over the last nine months, he's about to find out what that feels like.",
    "link": "https://www.nationalobserver.com/2025/03/20/opinion/naheed-nenshi-alberta-ndp",
    "timestamp": "2025-03-21T09:09:08Z"
  },
  {
    "title": "No journalists, no questions. An election campaign just the way Poilievre likes it",
    "description": "Poilievre has a decidedly testy, if not combative, relationship with journalists. He is quick to anger when faced with questions he doesn’t like, and he has used his skill as a bare-knuckled Parliamentary debater to belittle reporters who annoy him.",
    "link": "https://www.nationalobserver.com/2025/03/20/opinion/poilievre-campaign-election-journalists-questions-carney",
    "timestamp": "2025-03-21T09:09:07Z"
  },
  {
    "title": "The personal price of politics in the Trump era",
    "description": "While neither Andrew Furey nor Dennis King said it was the main reason for their resignations as premiers from Newfoundland and Labrador and P.E.I, respectively, both alluded to the changed political dynamics with Donald Trump back in the White House.",
    "link": "https://www.nationalobserver.com/2025/03/19/opinion/premiers-resignations-politics-trump",
    "timestamp": "2025-03-21T09:09:05Z"
  },
  {
    "title": "Trump has weakened Ukraine's hand against Russia. It fits with a pattern of Western behavior that has shaped the war.",
    "description": "Ukraine is in a tough spot again following the actions of a partner nation. This has been a recurring issue throughout the war.",
    "link": "https://www.businessinsider.com/us-weakening-ukraine-position-negoatiations-part-of-a-pattern-2025-3",
    "timestamp": "2025-03-21T09:09:01Z"
  },
  {
    "title": "Fired federal worker 'whiplash': How mass layoffs are causing mental, physical crises",
    "description": "President Donald Trump signed an executive order Thursday afternoon gutting the Department of Education, which is the latest on his pledge to reduce the federal",
    "link": "https://wjla.com/news/health/fired-federal-worker-whiplash-mass-layoffs-support-psychiatrist-arlington-employees-mental-physical-health-crises-benefits-support",
    "timestamp": "2025-03-21T09:08:26Z"
  },
  {
    "title": "Howard Lutnick says Elon Musk vowed onstage that DOGE would cut $2 trillion in spending when he was supposed to say $1 trillion",
    "description": "Lutnick said he and Musk were supposed to say they save and earn $1 trillion collectively, but Musk ended up saying he would cut $2 trillion.",
    "link": "https://www.businessinsider.com/howard-lutnick-elon-musk-supposed-doge-cut-1-trillion-2025-3",
    "timestamp": "2025-03-21T09:03:54Z"
  },
  {
    "title": "Minnesota state senator resigns after he was charged with soliciting a minor for prostitution",
    "description": "A Republican Minnesota state senator who was caught in a sting operation resigned under fire Thursday after he was charged with soliciting a minor for prostitution, stepping down before the Senate could vote on whether to expel him.",
    "link": "https://nypost.com/2025/03/21/us-news/minnesota-state-senator-resigns-after-he-was-charged-with-soliciting-a-minor-for-prostitution/",
    "timestamp": "2025-03-21T09:03:02Z"
  },
  {
    "title": "How Donald Trump's climate cuts will cost US taxpayers",
    "description": "On his return to the White House, Donald Trump signed orders rolling back climate policies, targeting wind energy, and cutting clean power funding. Despite economic growth in the renewable sector, the EPA revoked $20 billion in green grants, citing alleged fr…",
    "link": "https://timesofindia.indiatimes.com/world/us/how-donald-trumps-climate-cuts-will-cost-us-taxpayers/articleshow/119295434.cms",
    "timestamp": "2025-03-21T09:02:56Z"
  }
]