[
  {
    "title": "Trump Drops Hammer On Streets Of DC After Savage Assault Of Former DOGE Staffer",
    "description": "Trump increased the presence of federal law enforcement in response to crime in D.C. just days after a former DOGE staffer was brutally beaten.",
    "link": "https://dailycaller.com/2025/08/08/trump-dc-crime-doge-staffer-assault-federal-law-enforcement/",
    "timestamp": "2025-08-08T17:26:21Z"
  },
  {
    "title": "Trump Gained ‘10 Times More Income’ for Average Families Than Biden, Says Economist",
    "description": "Trump Gained ‘10 Times More Income’ for Average Families Than Biden, Says Economisttheepochtimes.com",
    "link": "https://www.theepochtimes.com/business/trump-gained-10-times-more-income-for-average-families-than-biden-says-economist-5898648",
    "timestamp": "2025-08-08T17:25:55Z"
  },
  {
    "title": "3 reasons Republicans’ redistricting power grab might backfire",
    "description": "The attempt by Texas Republicans to gerrymander more GOP legislative districts could backfire and deliver the party dummymandered districts. A political scientist explains the stakes.",
    "link": "https://theconversation.com/3-reasons-republicans-redistricting-power-grab-might-backfire-262553",
    "timestamp": "2025-08-08T17:25:45Z"
  },
  {
    "title": "Trump warns of ‘Great Depression’ if courts halt tariffs",
    "description": "The US President said 'our country deserves greatness', calls import taxes levied by his administration a 'huge positive'",
    "link": "https://indianexpress.com/article/world/us-president-said-our-country-deserves-greatness-10178432/",
    "timestamp": "2025-08-08T17:25:30Z"
  },
  {
    "title": "Donald Trump Jr. mocked for posting photoshopped image of president tossing sex toy onto WNBA court: ‘Funny how?’",
    "description": "Some were quick to bash Trump Jr.’s post as the comedic equivalent of an air ball.",
    "link": "https://nypost.com/2025/08/08/us-news/trump-jr-posts-pic-of-president-tossing-sex-toy-onto-wnba-court/",
    "timestamp": "2025-08-08T17:25:18Z"
  },
  {
    "title": "Bed Bath & Beyond Makes Comeback",
    "description": "\"This isn't just a store, it's a fresh start for a brand that means something special to so many families,\" read the recent announcement.",
    "link": "https://www.newsweek.com/bed-bath-beyond-makes-comeback-2110943",
    "timestamp": "2025-08-08T17:24:49Z"
  },
  {
    "title": "Intel CEO responds after Trump calls for his resignation",
    "description": "Intel CEO responds after Trump calls for his resignation\nIntel CEO Lip-Bu Tan says he’s “always operated within the highest legal and ethical standards” after coming under pressure following President Donald Trump’s call for him to resign\nIntel CEO Lip-Bu Tan…",
    "link": "https://biztoc.com/x/1fa4ccb6e3564130",
    "timestamp": "2025-08-08T17:23:32Z"
  },
  {
    "title": "Trump’s demand for a new census is unconstitutional — and logistically impossible",
    "description": "On Thursday, President Donald Trump announced on Truth Social that he is ordering the Commerce Department to work on a new census that would exclude “persons who are illegally in our Country illegally.”",
    "link": "https://biztoc.com/x/eaa4f979033f19d8",
    "timestamp": "2025-08-08T17:23:29Z"
  },
  {
    "title": "The day after Trump called Intel’s chief ‘conflicted,’ former directors call for a new company, a new board and a new CEO",
    "description": "Four former Intel board members are backing President Donald Trump’s surprise attack on the company’s CEO, but they’re pushing for a shake-up that is both more dramatic and wholly in line with their vocal criticism of late.\nIn a rare collective statement prov…",
    "link": "https://biztoc.com/x/c34c1f81f21da08a",
    "timestamp": "2025-08-08T17:23:11Z"
  },
  {
    "title": "Appeals Court Tosses Judge Boasberg’s Contempt Ruling Against Trump Over El Salvador Deportations",
    "description": "An appeals court has dropped a contempt ruling levied against President Donald Trump and White House officials over the deportation flights out of the United States\nThe post Appeals Court Tosses Judge Boasberg’s Contempt Ruling Against Trump Over El Salvador …",
    "link": "https://www.mediaite.com/media/news/appeals-court-tosses-judge-boasbergs-contempt-ruling-against-trump-over-el-salvador-deportations/",
    "timestamp": "2025-08-08T17:22:20Z"
  },
  {
    "title": "President Trump Responds to News of Vocal Never-Trumper Flipping to Democrat Party- “Total Loser”",
    "description": "Former Georgia Lt.\nThe post President Trump Responds to News of Vocal Never-Trumper Flipping to Democrat Party- “Total Loser” appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/president-trump-responds-news-vocal-never-trumper-flipping/",
    "timestamp": "2025-08-08T17:20:17Z"
  },
  {
    "title": "Republicans can run from their voters, but they can’t hide",
    "description": "By avoiding town halls, Claire McCaskill says GOP lawmakers are underestimating just how dissatisfied voters are with the Trump agenda, especially on tariffs.",
    "link": "https://www.msnbc.com/top-stories/latest/republican-angry-town-halls-mistake-trump-tariffs-rcna223867",
    "timestamp": "2025-08-08T17:20:07Z"
  },
  {
    "title": "Kristi Noem Says Her Melting-Face ‘South Park’ Parody Was ‘Petty’ and ‘Lazy’",
    "description": "Ironically, Noem didn’t watch her ‘South Park’ parody",
    "link": "https://www.cracked.com/article_47789_kristi-noem-says-her-melting-face-south-park-parody-was-petty-and-lazy.html",
    "timestamp": "2025-08-08T17:20:00Z"
  },
  {
    "title": "Trump's Tariffs May Soon Make Car Insurance More Expensive",
    "description": "Tariffs on auto parts, meant to \"protect America’s automobile industry,\" make repairs more expensive and drive up the cost of insurance.",
    "link": "https://reason.com/2025/08/08/trumps-tariffs-may-soon-make-car-insurance-more-expensive/",
    "timestamp": "2025-08-08T17:19:27Z"
  },
  {
    "title": "New York AG James subpoenaed as Justice Department investigates whether she violated Trump’s rights",
    "description": "The subpoenas mark an escalation of the Trump administration’s ongoing efforts to scrutinize perceived adversaries of the president, including those like James who had investigated him before his election win last November.",
    "link": "https://www.pbs.org/newshour/politics/new-york-ag-james-subpoenaed-as-justice-department-investigates-whether-she-violated-trumps-rights",
    "timestamp": "2025-08-08T17:13:04Z"
  },
  {
    "title": "‘Did You See Him!?’ Mark Halperin Hammers WaPo Alum Glenn Kessler Over the Soft Coverage of Biden’s Decline",
    "description": "Mark Halperin refused to let former Washington Post fact checker Glenn Kessler off the hook during a conversation about coverage of Joe Biden.\nThe post ‘Did You See Him!?’ Mark Halperin Hammers WaPo Alum Glenn Kessler Over the Soft Coverage of Biden’s Decline…",
    "link": "https://www.mediaite.com/media/news/did-you-see-him-mark-halperin-hammers-wapo-alum-glenn-kessler-over-the-soft-coverage-of-bidens-decline/",
    "timestamp": "2025-08-08T17:12:49Z"
  },
  {
    "title": "Mexico vows \"no invasion\" after reports of Trump targeting cartels",
    "description": "In February, the Trump administration designated eight drug trafficking groups as terrorist organizations, including six in Mexico.",
    "link": "https://www.cbsnews.com/news/mexico-president-no-invasion-trump-targeting-cartels-military-force/",
    "timestamp": "2025-08-08T17:12:31Z"
  },
  {
    "title": "The USMCA agreement may be circling the drain. Time to fill the trade sink elsewhere",
    "description": "By now, dozens of countries know they cannot outplay U.S. President Donald Trump in the tariff game. Switzerland learned so the hard way this week, when President Karin Keller-Sutter came back empty-handed after an emergency visit to the White House, where sh…",
    "link": "https://biztoc.com/x/10748f7f1f5d5c2b",
    "timestamp": "2025-08-08T17:11:56Z"
  },
  {
    "title": "Federal Appeals Court Overturns Judge Boasberg in Massive Immigration Win for Trump",
    "description": "Judge James Boasberg's vendetta against the Trump administration “exceeds the court’s authority and amounts to a clear abuse of discretion.\"",
    "link": "https://www.westernjournal.com/federal-appeals-court-overturns-judge-boasberg-massive-immigration-win-trump/",
    "timestamp": "2025-08-08T17:11:49Z"
  },
  {
    "title": "Appeals court tosses judge's contempt finding against Trump administration in prison deportations",
    "description": "A split appeals court panel is tossing out a judge’s contempt finding against President Donald Trump’s administration in a case over deportations to an El Salvador prison",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-tosses-judges-contempt-finding-trump-administration-124484009",
    "timestamp": "2025-08-08T17:10:28Z"
  },
  {
    "title": "JLR's tariff blues, weak India demand hurt Tata Motors profit",
    "description": "JLR took a hit from Donald Trump's tariffs on automobile imports from the UK. However, following the US-UK trade pact, the impact will come down, Tata Motors said.",
    "link": "https://www.livemint.com/companies/jlr-tariff-india-demand-tata-motors-profit-uk-us-trade-pact-trump-mahindra-and-mahindra-nclat-maruti-suzuki-11754662002861.html",
    "timestamp": "2025-08-08T17:09:18Z"
  },
  {
    "title": "House Judiciary, Oversight Dems Want Answers on Potential Misuse of FBI",
    "description": "Democrats on key panels in the U.S. House of Representatives wrote to top Trump administration officials on Friday to demand answers about the potential misuse of the Federal Bureau of Investigation in Texas legislators' gerrymandering battle.U.S. Sen. John C…",
    "link": "https://www.commondreams.org/news/fbi-texas",
    "timestamp": "2025-08-08T17:08:11Z"
  },
  {
    "title": "Trump-Putin summit tentatively set for next week, White House official says",
    "description": "A meeting between Trump and Putin is tentatively scheduled for the end of next week, a senior White House official told NBC News.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-putin-summit-tentatively-set-white-house-ukraine-ceasefire-rcna223897",
    "timestamp": "2025-08-08T17:06:51Z"
  },
  {
    "title": "The day after Trump called Intel’s chief ‘conflicted,’ former directors call for a new company, a new board and a new CEO",
    "description": "Embattled Intel CEO Lip-Bu Tan wrote an open letter to staff, claiming there has been \"misinformation\" about his career and his past leadership roles.",
    "link": "https://fortune.com/2025/08/08/intel-former-directors-call-for-new-ceo-board-manufacturing-spinoff/",
    "timestamp": "2025-08-08T17:06:50Z"
  },
  {
    "title": "Trump tariffs defy trade deficit 101",
    "description": "Donald Trump's trade policies deviate from established economic principles like comparative advantage, potentially harming the US economy. Imposing tariffs to reduce trade deficits, driven by overspending rather than overproduction by other countries, ultimat…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/trump-tariffs-defy-trade-deficit-101/articleshow/123192863.cms",
    "timestamp": "2025-08-08T17:06:10Z"
  },
  {
    "title": "Longtime Belarus leader Lukashenko signals he may not seek another term",
    "description": "Putin ally Lukashenko has ruled Belarus with an iron fist for more than than three decades and is now on seventh term.",
    "link": "https://www.aljazeera.com/news/2025/8/8/longtime-belarus-leader-lukashenko-hints-this-may-be-his-final-term",
    "timestamp": "2025-08-08T17:05:36Z"
  },
  {
    "title": "Jon Ossoff's GOP Opponents In Striking Distance of Defeating Him",
    "description": "According to new polling, Ossoff, a Democrat, will face pressure from GOP rivals in the 2026 Georgia Senate race.",
    "link": "https://www.newsweek.com/jon-ossoff-georgia-senate-race-election-poll-2110760",
    "timestamp": "2025-08-08T17:05:00Z"
  },
  {
    "title": "European Gas Extends Slide on News of US-Russia Truce Plan",
    "description": "European natural gas extended its slide after Bloomberg reported that US and Russia are drafting a deal to halt the war in Ukraine, easing worries about the threat of further sanctions on Moscow and its energy trade.",
    "link": "https://financialpost.com/pmn/business-pmn/european-gas-extends-slide-on-news-of-us-russia-truce-plan",
    "timestamp": "2025-08-08T17:03:33Z"
  },
  {
    "title": "'Not sure they can come back': No end in sight after 'bizarre' Trump move exiled Democrats",
    "description": "Texas Democrats intend to remain in exile until at least Aug. 19, the end of a special legislative session called by Gov. Greg Abbott to pass a gerrymandered congressional map, but the end of the political saga is far from over.President Donald Trump asked fo…",
    "link": "https://www.rawstory.com/democrats-texas-redistricting-dovere/",
    "timestamp": "2025-08-08T17:02:12Z"
  },
  {
    "title": "After strong week, here’s how Apple stock can keep its momentum",
    "description": "Apple shareholders anticipated a strong close to the summer, and their expectations are being met. The company’s third-quarter earnings and…\nThe post After strong week, here’s how Apple stock can keep its momentum appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/08/after-strong-week-heres-how-apple-stock-can-keep-its-momentum/",
    "timestamp": "2025-08-08T17:01:41Z"
  },
  {
    "title": "Three Years Later, the American People Deserve the Truth About MAL Raid",
    "description": "No photo other than his mugshot is more representative of the unprecedented lawfare against Donald Trump than the photo of alleged classified documents discovered during the nine-hour armed raid of Mar-a-Lago on August 8, 2022. On one hand, Democrats, the new…",
    "link": "https://freerepublic.com/focus/f-news/4333451/posts",
    "timestamp": "2025-08-08T17:01:14Z"
  },
  {
    "title": "“Right now the worst thing you can be is a racist”: Marc Maron fires back at Howie Mandel’s comments using Donald Trump as an example",
    "description": "Comedian Marc Maron claps back at host Howie Mandel on a recent episode of his podcast when the pair discusses whether President Donald Trump is racist.\n\n\nWhat did Howie Mandel and Marc Maron say about Trump?\n\n\nIn an Aug. 5 episode of the Howie Mandel Does St…",
    "link": "https://www.dailydot.com/viral-politics/marc-maron-howel-mandel-podcast-is-trump-racist/",
    "timestamp": "2025-08-08T17:00:44Z"
  },
  {
    "title": "Trump’s DOJ opens investigation into state AG’s office that brought case against Trump",
    "description": "After Donald Trump targeted New York Attorney General Letitia James, his Justice Department open an investigation into her office. What a coincidence.",
    "link": "https://biztoc.com/x/1154842edf438394",
    "timestamp": "2025-08-08T17:00:28Z"
  },
  {
    "title": "MAGA EATING THEIR OWN: Trump-themed burger joint owner arrested...",
    "description": "He entered the country legally in 2019 but was supposed to leave in 2024, the agency said.",
    "link": "https://www.al.com/politics/2025/08/trump-themed-burger-joints-owner-detained-by-ice-might-be-deported-regardless-of-political-beliefs.html",
    "timestamp": "2025-08-08T17:00:03Z"
  },
  {
    "title": "It’s Raining Dildos on WNBA Courts. You’ll Never Believe Who’s to Blame.",
    "description": "The WNBA needs to get tough on spectators behaving badly.",
    "link": "https://slate.com/culture/2025/08/wnba-green-dildo-sex-toy-polymarket-crypto.html",
    "timestamp": "2025-08-08T16:58:56Z"
  },
  {
    "title": "Texas Is the Dry Run for the GOP’s Dismantling of Electoral Democracy",
    "description": "As Texas Democrats fled the state to protest a redistricting map drawn at Donald Trump’s request—a map designed to all but shut Democrats out of congressional power—I spent the day at a public hearing where the only people left to debate the map were the Repu…",
    "link": "https://newrepublic.com/article/198936/texas-maps-gop-end-democracy",
    "timestamp": "2025-08-08T16:58:46Z"
  },
  {
    "title": "Mary Peltola's Chances of Defeating Dan Sullivan in Alaska Senate Race—Poll",
    "description": "A new poll pointed to a competitive race in the traditionally conservative race.",
    "link": "https://www.newsweek.com/mary-peltola-chances-defefating-dan-sullivan-alaska-2110886",
    "timestamp": "2025-08-08T16:56:01Z"
  },
  {
    "title": "Trump administration eyes military action against some cartels",
    "description": "(Reuters) -President Donald Trump's administration can use the military to go after drug cartels that have been designated as global terrorist organizations and has directed the Pentagon to prepare options, U.S. officials said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/09/trump-administration-eyes-military-action-against-some-cartels",
    "timestamp": "2025-08-08T16:56:00Z"
  },
  {
    "title": "Stephen Colbert Puts on JD Vance Mask and Says ‘Netflix, Call Me’ After CBS Cancels ‘The Late Show’: ‘I’m Available in June’",
    "description": "Stephen Colbert isn’t shying away from making jokes about CBS’ recent cancellation of “The Late Show” — in fact, he’s looking for offers from other networks on air. On Thursday, during his final “Late Show” taping before a summer hiatus, Colbert referenced a …",
    "link": "https://variety.com/2025/tv/news/stephen-colbert-netflix-cbs-cancellation-1236482562/",
    "timestamp": "2025-08-08T16:55:32Z"
  },
  {
    "title": "Report: DOJ Opens Grand Jury Probe Into NY AG Letitia James’ Get-Trump Lawfare",
    "description": "The Department of Justice has opened a grand jury investigation into New York Attorney General Letitia James over her office’s handling of lawfare against then-candidate Donald Trump leading up to the 2024 election, several outlets reported Friday. According …",
    "link": "https://thefederalist.com/2025/08/08/report-doj-opens-grand-jury-probe-into-ny-ag-letitia-james-get-trump-lawfare/",
    "timestamp": "2025-08-08T16:49:50Z"
  },
  {
    "title": "Apple’s $600 Billion Commitment to Boost U.S. Manufacturing",
    "description": "Yesterday, President Donald J. Trump joined Apple CEO Tim Cook to announce the company will increase its U.S. investment to $600 billion over the next four years as it brings additional components of its supply chain and advanced manufacturing back home. Appl…",
    "link": "https://biztoc.com/x/7e05270a1ec86ea5",
    "timestamp": "2025-08-08T16:49:31Z"
  },
  {
    "title": "America’s F-35 is stealthy in combat but lights up the radar in Trump’s trade war",
    "description": "Swiss lawmakers are calling for the government to cancel a $9.1 billion order for Lockheed Martin’s F-35 stealth fighter, after President Donald Trump hit Switzerland with a 39% tariff. Earlier this week, Spain’s government ruled out buying the F-35 in favor …",
    "link": "https://biztoc.com/x/68cd4b52cc23afa1",
    "timestamp": "2025-08-08T16:49:26Z"
  },
  {
    "title": "With Zelenskyy sidelined from peace talks, Trump appears to hand Putin a diplomatic win",
    "description": "From left, then-President Donald Trump chats with Russia's President Vladimir Putin as they attend the APEC Economic Leaders' Meeting, part of the Asia-Pacific Economic Cooperation (APEC) leaders' summit in the central Vietnamese city of Danang on Nov. 11, 20…",
    "link": "https://biztoc.com/x/38fec616f2110c69",
    "timestamp": "2025-08-08T16:49:15Z"
  },
  {
    "title": "Trade Desk tanks almost 40% on CFO departure, tariff concerns and competition from Amazon",
    "description": "The Trade Desk beat on earnings and revenue, but the stock was headed for its worst day on record as investors worried about rising competition from Amazon.",
    "link": "https://www.cnbc.com/2025/08/08/trade-desk-tanks-cfo-departure-q2-results-amazon-competition.html",
    "timestamp": "2025-08-08T16:48:40Z"
  },
  {
    "title": "Justice Dept Reportedly Probing Tish James for Violating Trump’s Civil Rights",
    "description": "An investigation has been launched into Letitita James over potential violations of civil rights in her case against Trump, according to multiple reports.",
    "link": "https://dailycaller.com/2025/08/08/justice-dept-reportedly-probing-letitia-james-over-civil-fraud-case-against-trump/",
    "timestamp": "2025-08-08T16:47:15Z"
  },
  {
    "title": "There’s More to the Story on JD Vance’s Kayaking Trip",
    "description": "Vice President JD Vance’s 41st birthday trip to kayak with his family on the Little Miami is drawing considerable attention. While U.S. Secret Service raised... Read More\nThe post There’s More to the Story on JD Vance’s Kayaking Trip appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/08/08/theres-more-to-the-story-on-jd-vances-kayaking-trip/",
    "timestamp": "2025-08-08T16:46:59Z"
  },
  {
    "title": "America’s F-35 is stealthy in combat but lights up the radar in Trump’s trade war",
    "description": "The latest blowback came after Trump's 39% tariff on Switzerland went into effect, prompting lawmakers there to demand the government scrap its F-35 order.",
    "link": "https://fortune.com/2025/08/08/f35-stealth-fighter-trump-trade-war-switzerland-tariff-lockheed-spain-nato/",
    "timestamp": "2025-08-08T16:46:16Z"
  },
  {
    "title": "Sydney Sweeney spotted on 'Devil Wears Prada 2' filming set",
    "description": "Sydney Sweeney is still dealing with the fallout from her controversial American Eagle advertisement that was embraced by the right, including President Donald Trump. Not too soon after the backlash, it was revealed that Sweeney had been registered as a Repub…",
    "link": "https://www.out.com/gay-tv-shows/sydney-sweeney-devil-wears-prada-sequel-spotted",
    "timestamp": "2025-08-08T16:43:28Z"
  },
  {
    "title": "Trump Tariffs on Russia’s Oil Buyers Bring Economic, Political Risks",
    "description": "From punishing Brazil to trying to curb imports of fentanyl, U.S. President Donald Trump has wielded the threat of tariffs as an all-purpose foreign policy weapon.",
    "link": "https://gcaptain.com/trump-tariffs-on-russias-oil-buyers-bring-economic-political-risks/",
    "timestamp": "2025-08-08T16:43:13Z"
  },
  {
    "title": "Trump Says Court Halt Of Tariffs Would Cause 'Great Depression'",
    "description": "US President Donald Trump warned Friday of cataclysmic consequences on the US economy if a court rules that his imposition of sweeping tariffs constitutes an illegal power grab.",
    "link": "https://www.ibtimes.com/trump-says-court-halt-tariffs-would-cause-great-depression-3780539",
    "timestamp": "2025-08-08T16:42:17Z"
  },
  {
    "title": "California rushes to plan a still unscheduled election in US House seats standoff with Texas",
    "description": "Texas and California are leading a back-and-forth push to remake the balance of power.",
    "link": "https://www.bostonherald.com/2025/08/08/us-election-2026-redistricting-california/",
    "timestamp": "2025-08-08T16:39:52Z"
  },
  {
    "title": "“It’s Not Just a Texas Problem. It’s an American Problem.”",
    "description": "A lot of people want to get a hold of James Talarico these days. The 36-year-old Texas state representative and seminary student is a rising Democratic star. You—like 5.6 million others—may have seen him in your social-media feed, calling a proposal to place …",
    "link": "https://www.motherjones.com/politics/2025/08/james-talarico-texas-redistricting-gerrymandering-cornyn/",
    "timestamp": "2025-08-08T16:39:37Z"
  },
  {
    "title": "America Is Making Billions From Catching 'Tariff Cheaters'",
    "description": "Commerce Secretary Howard Lutnick said he believes customs authorities could soon be raking in around $50 billion per month thanks to recent tariff hikes.",
    "link": "https://www.newsweek.com/america-making-billions-catching-tariff-cheaters-2110862",
    "timestamp": "2025-08-08T16:38:56Z"
  },
  {
    "title": "Trump’s DOJ opens investigation into state AG’s office that brought case against Trump",
    "description": "After Donald Trump targeted New York Attorney General Letitia James, his Justice Department open an investigation into her office. What a coincidence.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-doj-opens-investigation-state-ags-office-brought-case-trump-rcna223881",
    "timestamp": "2025-08-08T16:38:47Z"
  },
  {
    "title": "US-India trade war throws spotlight on Mukesh Ambani’s Russian oil windfall",
    "description": "Reliance group chaired by Asia’s richest man has benefited from cheap crude imports now targeted by Donald Trump",
    "link": "https://biztoc.com/x/fb20e86293575b30",
    "timestamp": "2025-08-08T16:38:26Z"
  },
  {
    "title": "Ken Paxton Took Victory Lap Suing Woke ‘Cartel’ He Quietly Invests Fortune In",
    "description": "Ken Paxton spearheaded a multi-state lawsuit while quietly sitting upon thousands of shares of mutual funds managed by one of the targets of his complaint.",
    "link": "https://dailycaller.com/2025/08/08/ken-paxton-vanguard-lawsuit-invest/",
    "timestamp": "2025-08-08T16:37:26Z"
  },
  {
    "title": "Intel CEO's potential China links a warning for U.S. companies",
    "description": "President Donald Trump called for Intel CEO Lip-Bu Tan to resign, another signal of the administration's heightened focus on competition and support for domestic manufacturing.",
    "link": "https://www.techtarget.com/searchcio/news/366628781/Intel-CEOs-potential-China-links-a-warning-for-US-companies",
    "timestamp": "2025-08-08T16:37:00Z"
  },
  {
    "title": "Kristi Noem Slams South Park’s ‘Petty’ Portrayal of Her: ‘It’s So Lazy to Make Fun of Women for How They Look’",
    "description": "No surprise here: Kristi Noem isn’t thrilled with her unflattering portrayal on the most recent episode of South Park. The United States Secretary of Homeland Security called in to Glenn Beck’s radio show on Thursday to share her thoughts on the Aug. 6 episod…",
    "link": "https://tvline.com/news/south-park-kristi-noem-episode-response-statement-1235486563/",
    "timestamp": "2025-08-08T16:36:14Z"
  },
  {
    "title": "Trump administration seeking $1 billion settlement from UCLA | CNN Politics",
    "description": "The Trump administration is seeking a $1 billion settlement from the University of California, Los Angeles, CNN has exclusively learned, marking the latest effort by the White House to shape higher education and extract significant concessions from universiti…",
    "link": "https://www.cnn.com/2025/08/08/politics/ucla-trump-administration-settlement",
    "timestamp": "2025-08-08T16:36:06Z"
  },
  {
    "title": "Top Modi adviser holds talks with Russian deputy PM",
    "description": "Ajit Doval and Denis Manturov have discussed military cooperation and joint projects in strategic sectors Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622675-top-modi-adviser-holds-talks/",
    "timestamp": "2025-08-08T16:35:50Z"
  },
  {
    "title": "The Flaw in the Texas Democrats’ Plan",
    "description": "Eventually, they’ll have to go home.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/texas-democrats-quorum-break-plan/683800/",
    "timestamp": "2025-08-08T16:35:12Z"
  },
  {
    "title": "Justice Department opens investigation into New York attorney general who won civil fraud case against Trump (CNN)",
    "description": "CNN:\nJustice Department opens investigation into New York attorney general who won civil fraud case against Trump  —  The Justice Department has subpoenaed New York Attorney General Letitia James' office as part of a criminal investigation into President Dona…",
    "link": "https://www.memeorandum.com/250808/p66",
    "timestamp": "2025-08-08T16:35:02Z"
  },
  {
    "title": "The FBI Has No Business Tracking Down Texas Democrats",
    "description": "Using the FBI to track down AWOL Texas Democrats is an unnecessary expansion of federal law enforcement authority.",
    "link": "https://reason.com/2025/08/08/the-fbi-has-no-business-tracking-down-texas-democrats/",
    "timestamp": "2025-08-08T16:34:39Z"
  },
  {
    "title": "Steve Bannon Torches Netanyahu’s Gaza Occupation Plan as Potential Killer of MAGA",
    "description": "Steve Bannon warned that full support of Benjamin Netanyahu's plan to occupy Gaza would potentially be a final nail in the coffin of MAGA.\nThe post Steve Bannon Torches Netanyahu’s Gaza Occupation Plan as Potential Killer of MAGA first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/steve-bannon-torches-netanyahus-gaza-occupation-plan-as-potential-killer-of-maga/",
    "timestamp": "2025-08-08T16:33:43Z"
  },
  {
    "title": "Appeals court tosses contempt finding against Trump administration over prison deportations",
    "description": "The decision from a divided three-judge panel based in the nation’s capital vacates a finding from U.S District Judge James E. Boasberg.",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-tosses-contempt-finding-against-trump-administration-over-prison-deportations",
    "timestamp": "2025-08-08T16:33:04Z"
  },
  {
    "title": "Trump administration seeks Supreme Court’s help on latest immigration enforcement efforts",
    "description": "The Trump administration says lower courts put its  immigration enforcement in California a “straitjacket.” Or was it the Constitution?",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-supreme-court-los-angeles-immigration-enforcement-rcna223828",
    "timestamp": "2025-08-08T16:32:37Z"
  },
  {
    "title": "JUST IN: DOJ Launches Grand Jury Investigation Into Letitia James",
    "description": "The Justice Department has launched a grand jury investigation into New York Attorney General Letitia James. According to Fox News, Letitia James has been subpoenaed in an investigation focused on “possible deprivation of rights allegations” related to her ci…",
    "link": "https://freerepublic.com/focus/f-news/4333447/posts",
    "timestamp": "2025-08-08T16:32:18Z"
  },
  {
    "title": "DOGE’s “Efficiency” Theater: Wasted $21.7 Billion While Destroying Life-Saving Programs Based On Conspiracy Theories",
    "description": "We’ve talked plenty about how Elon Musk’s “Department of Government Efficiency” (DOGE) was always more about performative cruelty than actual efficiency. But a new Senate report reveals just how spectacularly DOGE failed at its supposed core mission while cau…",
    "link": "https://www.techdirt.com/2025/08/08/doges-efficiency-theater-wasted-21-7-billion-while-destroying-life-saving-programs-based-on-conspiracy-theories/",
    "timestamp": "2025-08-08T16:32:00Z"
  },
  {
    "title": "CBS TV chief breaks public silence on 'The Late Show with Stephen Colbert' cancellation",
    "description": "CBS executive George Cheeks said Stephen Colbert's \"Late Show\" cancellation was due to economic challenges and declining late-night advertising revenue.",
    "link": "https://www.foxnews.com/media/cbs-tv-chief-breaks-public-silence-the-late-show-with-stephen-colbert-cancellation",
    "timestamp": "2025-08-08T16:30:36Z"
  },
  {
    "title": "Deep staff cuts at a little-known federal agency pose trouble for droves of local health programs",
    "description": "HRSA has been hit hard by Trump staffing purges.",
    "link": "https://www.bostonherald.com/2025/08/08/deep-staff-cuts-at-a-little-known-federal-agency-pose-trouble-for-droves-of-local-health-programs/",
    "timestamp": "2025-08-08T16:30:14Z"
  },
  {
    "title": "What to know about past meetings between Putin and his American counterparts",
    "description": "The war in Ukraine effectively halted such meetings.",
    "link": "https://www.bostonherald.com/2025/08/08/eu-russia-us-past-meetings/",
    "timestamp": "2025-08-08T16:29:39Z"
  },
  {
    "title": "US F-35 fighter faces another setback as Spain scraps plan to buy world's most advanced plane indefinitely",
    "description": "Spain has formally ruled out buying US-made F-35 fighter jets, opting instead to expand its fleet of Eurofighter Typhoons and invest in the Franco-German Future Combat Air System (FCAS). The move reflects both strategic and political divergence from Washingto…",
    "link": "https://freerepublic.com/focus/f-news/4333445/posts",
    "timestamp": "2025-08-08T16:27:45Z"
  },
  {
    "title": "Trump's nominee for the Fed wants to overhaul it",
    "description": "Having railed against the \"revolving door\" between the executive branch and the US Federal Reserve, Council of Economic Advisers Chair Stephen Miran may now be walking through it after President Donald Trump nominated him to the Board of Governors of an insti…",
    "link": "https://www.rte.ie/news/business/2025/0808/1527576-trumps-nominee-for-the-fed-wants-to-overhaul-it/",
    "timestamp": "2025-08-08T16:27:21Z"
  },
  {
    "title": "Map Shows How DC Crime Rates Compare to US States",
    "description": "The data shows that over 14 million criminal offenses occurred across the country in 2024, but that various offenses decreased compared to previous years.",
    "link": "https://www.newsweek.com/map-dc-crime-rates-compared-us-states-2110665",
    "timestamp": "2025-08-08T16:27:10Z"
  },
  {
    "title": "Trump Orders Surge Of Law Enforcement In Washington To Combat Crime",
    "description": "Trump Orders Surge Of Law Enforcement In Washington To Combat Crime\n \nAuthored by Aldgra Fredly via The Epoch Times (emphasis ours),\nPresident Donald Trump had ordered the federal government to increase law enforcement presence in Washington to combat violent…",
    "link": "https://biztoc.com/x/5b8375aab546fe9c",
    "timestamp": "2025-08-08T16:26:48Z"
  },
  {
    "title": "Trump warns courts against knocking down tariffs, says duties are 'huge positive' for stock market (Alex Harring/CNBC)",
    "description": "Alex Harring / CNBC:\nTrump warns courts against knocking down tariffs, says duties are ‘huge positive’ for stock market … President Donald Trump on Friday warned U.S. courts against blocking his tariff policy, citing its “positive impact” on the stock market …",
    "link": "https://www.memeorandum.com/250808/p64",
    "timestamp": "2025-08-08T16:25:01Z"
  },
  {
    "title": "Air Force Plans To Buy Cybertrucks For Target Practice As Tesla Sales Plummet",
    "description": "The Air Force is aiming to buy Tesla's widely maligned Cybertrucks for target practice. \nAccording to a request submitted by the Air Force Test Center, the military is seeking to purchase two Cybertr…",
    "link": "https://dailyvoice.com/virginia/arlington/air-force-plans-to-buy-cybertrucks-for-target-practice-as-tesla-sales-plummet/",
    "timestamp": "2025-08-08T16:22:28Z"
  },
  {
    "title": "Trump’s demand for a new census is unconstitutional — and logistically impossible",
    "description": "On Thursday, President Donald Trump announced on Truth Social that he is ordering the Commerce Department to work on a new census that would exclude “persons who are illegally in our Country illegally.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trumps-demand-new-census-unconstitutional-impossible-rcna223771",
    "timestamp": "2025-08-08T16:21:56Z"
  },
  {
    "title": "Diddy’s Lawyer Says Disgraced Icon Wants To Return To Madison Square Garden",
    "description": "Earlier this month, Diddy was surprisingly found not guilty of the most serious charges of his sex trafficking trial and though he still faces up to 10 years in prison for some of the lesser charges of “transportation to engage in prostitution,” he seems to f…",
    "link": "https://hiphopwired.com/2799170/diddys-wants-to-return-to-madison-square-garden-after-getting-out/",
    "timestamp": "2025-08-08T16:19:25Z"
  },
  {
    "title": "New Head of Paramount Defends South Park Amid Criticism from Trump Administration",
    "description": "David Ellison praised Matt Stone and Trey Parker as \"equal opportunity offenders\" in an interview with CNN.\nNew Head of Paramount Defends South Park Amid Criticism from Trump Administration\nScoop Harrison",
    "link": "https://consequence.net/2025/08/new-head-of-paramount-defends-south-park-amid-criticism-from-trump-administration/",
    "timestamp": "2025-08-08T16:17:58Z"
  },
  {
    "title": "Marjorie Taylor Greene Hits Back After 'IQ of a Snail' Jibe",
    "description": "The GOP congresswoman said Fox News host Mark Levin is \"Israel first\" rather than \"America first.\"",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-hits-back-after-iq-snail-jibe-2110786",
    "timestamp": "2025-08-08T16:17:02Z"
  },
  {
    "title": "Former Georgia Lt. Gov. Geoff Duncan Considers Run for Office After Party Switch",
    "description": "The former lieutenant governor of Georgia says he is considering a run for higher office as a Democrat after leaving the Republican Party.\nThe post Former Georgia Lt. Gov. Geoff Duncan Considers Run for Office After Party Switch appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/08/former-georgia-lt-gov-geoff-duncan-considers-run-office-after-party-switch/",
    "timestamp": "2025-08-08T16:16:16Z"
  },
  {
    "title": "Sheinbaum: US military won't invade Mexico",
    "description": "Mexican President Claudia Sheinbaum said on Friday that the United States military will not invade her country's territory after US media reported that President Donald Trump secretly signed an order ...",
    "link": "https://biztoc.com/x/aca3fd3ebf125c61",
    "timestamp": "2025-08-08T16:15:53Z"
  },
  {
    "title": "JD Vance Warns UK Not To Go Down ‘Dark Path’ Of Censorship That Occurred Under Biden",
    "description": "Vice President J.D. Vance warned the United Kingdom to avoid going down the same \"dark path\" of censorship.",
    "link": "https://dailycaller.com/2025/08/08/jd-vance-uk-free-speech-censorship-biden/",
    "timestamp": "2025-08-08T16:15:46Z"
  },
  {
    "title": "Apple CEO Tim Cook Has Learned the Rules for Getting Ahead in Trump's America",
    "description": "If you want to understand the silly little scene that played out between Apple CEO Tim Cook and President Donald Trump at the White House on Wednesday, you might start by remembering something that Vice President J.D. Vance said two years ago.\nWhile attending…",
    "link": "https://biztoc.com/x/81e8ec1524420871",
    "timestamp": "2025-08-08T16:15:39Z"
  },
  {
    "title": "NY AG Leticia James Subpoenaed By DOJ In Trump Civil Rights Violation Probe",
    "description": "The Department of Justice has issued multiple subpoenas to New York Attorney General Letitia James as part of an investigation into whether James violated President Donald Trump's civil rights, the Associated Press reports.",
    "link": "https://biztoc.com/x/db2a7e876c8da6cb",
    "timestamp": "2025-08-08T16:15:36Z"
  },
  {
    "title": "Things Aren't Going Donald Trump's Way (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nThings Aren't Going Donald Trump's Way  —  He hasn't ended the wars in Ukraine and Gaza.  His economy looks shaky.  And then there's Jeffrey Epstein.  —  Donald trump has almost certainly complained more about journalists than …",
    "link": "https://www.memeorandum.com/250808/p61",
    "timestamp": "2025-08-08T16:15:02Z"
  },
  {
    "title": "Crypto rally: Ethereum breaks $4000 while Ripple, Chainlink lead the charge",
    "description": "ETH price today: Ethereum crossed $4,000 amidst an altcoin rally. Ripple plans to acquire Rail for stablecoin payments. Chainlink is launching a reserve to strengthen its LINK token. Donald Trump signed an order promoting alternative investments in retirement…",
    "link": "https://economictimes.indiatimes.com/news/international/us/eth-price-today-crypto-rally-ethereum-breaks-4000-while-ripple-chainlink-lead-the-charge/articleshow/123191726.cms",
    "timestamp": "2025-08-08T16:14:31Z"
  },
  {
    "title": "REPORT: Trump Signs Order to Use Military Force Against Certain Drug Cartels",
    "description": "A report in the New York Times states that President Donald Trump secretly signed an order authorizing the use of military force against “certain Latin American drug cartels.” These cartels were previously designated by President Trump and the U.S. Department…",
    "link": "https://www.breitbart.com/border/2025/08/08/report-trump-signs-order-to-use-military-force-against-certain-drug-cartels/",
    "timestamp": "2025-08-08T16:13:37Z"
  },
  {
    "title": "With Zelenskyy sidelined from Ukraine war talks, Trump appears to hand Putin a diplomatic win",
    "description": "Just when Ukraine and its European allies thought Donald Trump was coming round to their view of the war, he appeared to give a win to Russia's  Vladimir Putin.",
    "link": "https://www.nbcnews.com/world/russia/trump-putin-meeting-ukraine-war-ceasefire-zelenskyy-rcna223589",
    "timestamp": "2025-08-08T16:12:14Z"
  },
  {
    "title": "Veterans face dire new health care crisis thanks to Trump (Daily Kos)",
    "description": "President Donald Trump’s policies are causing doctors to turn down job offers in Veterans Affairs hospitals, a new report has revealed. Simultaneously, the a...",
    "link": "https://www.smartnews.com/en-us/article/4844635328838904575",
    "timestamp": "2025-08-08T16:11:09Z"
  },
  {
    "title": "College endowment tax is leading to hiring freezes and could mean cuts in financial aid",
    "description": "The tax was signed into law by President Donald Trump and takes effect in 2026.",
    "link": "https://www.denverpost.com/2025/08/08/us-education-endowment-tax/",
    "timestamp": "2025-08-08T16:11:07Z"
  },
  {
    "title": "College endowment tax is leading to hiring freezes and could mean cuts in financial aid",
    "description": "The tax was signed into law by President Donald Trump and takes effect in 2026.",
    "link": "https://www.bostonherald.com/2025/08/08/us-education-endowment-tax/",
    "timestamp": "2025-08-08T16:11:07Z"
  },
  {
    "title": "‘Morning Joe’ Tells Trump ‘You Can’t Lie to the American People’ Over Jobs Report | Video",
    "description": "Joe Scarborough and CNBC's Dominic Chu unpack the Wall Street implications of the president's Heritage Foundation numbers\nThe post ‘Morning Joe’ Tells Trump ‘You Can’t Lie to the American People’ Over Jobs Report | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-trump-cant-lie-to-the-american-people-jobs/",
    "timestamp": "2025-08-08T16:11:06Z"
  },
  {
    "title": "Conservative campaign manager Jenni Byrne says she won't run the next campaign",
    "description": "Byrne has been the target of criticism since April 28, with some Conservatives calling for her to be fired after the party's fourth straight election loss to the Liberals.",
    "link": "https://www.nationalobserver.com/2025/08/08/news/conservative-campaign-manager-jenni-byrne-says-she-wont-run-next-campaign",
    "timestamp": "2025-08-08T16:10:48Z"
  },
  {
    "title": "How Far Will Steve Bannon Go to Take Down JD Vance?",
    "description": "On Thursday, the Daily Mail reported that Steve Bannon, the brains behind the MAGA movement, was strongly considering a 2028 presidential run—news that would surely aggravate the current internal rift between Trump’s radical base and the more traditional neoc…",
    "link": "https://newrepublic.com/post/198942/steve-bannon-jd-vance-maga-trump",
    "timestamp": "2025-08-08T16:09:56Z"
  }
]