[
  {
    "title": "Unprecedented and chaotic scenes in the Dáil",
    "description": "Speaking rights row once again leads to the adjournment of proceedings for the day",
    "link": "https://www.irishtimes.com/politics/2025/03/26/unprecedented-and-chaotic-scenes-in-the-dail/",
    "timestamp": "2025-03-26T07:49:25Z"
  },
  {
    "title": "Google fixed the first actively exploited Chrome zero-day since the start of the year",
    "description": "Google fixed a flaw in the Chrome browser for Windows that was actively exploited in attacks targeting organizations in Russia. Google has released out-of-band fixes to address a high-severity security vulnerability, tracked as CVE-2025-2783, in Chrome browse…",
    "link": "https://securityaffairs.com/175862/hacking/google-fixed-first-chrome-zero-day-in-2025.html",
    "timestamp": "2025-03-26T07:46:27Z"
  },
  {
    "title": "The March Massacres Show That Syria Urgently Needs Solutions, Not Sanctions",
    "description": "Early March 2025 was when Syria’s post-Assad transition turned sour. In scenes that resembled the worst moments of Syria’s civil war, hundreds of Alawite civilians were killed, probably by a combination of pro-government forces and extra-judicial Sunni death …",
    "link": "https://warontherocks.com/2025/03/the-march-massacres-show-that-syria-urgently-needs-solutions-not-sanctions/",
    "timestamp": "2025-03-26T07:45:49Z"
  },
  {
    "title": "Trump moves to overhaul US elections, fueling fears voting will become more difficult",
    "description": "Trump wants to set down a requirement for documentary proof of citizenship to register to vote.",
    "link": "https://www.thejournal.ie/trump-voting-6659297-Mar2025/",
    "timestamp": "2025-03-26T07:41:38Z"
  },
  {
    "title": "Melania Trump's Iconic Wedding Gown Up for Auction- But It Looks Different",
    "description": "An eBay seller named Svjabc1 has listed the gown with a starting bid of $45,000, claiming she purchased it for $70,000 to wear at her wedding in 2010.",
    "link": "https://www.ndtv.com/world-news/melania-trumps-christian-dior-wedding-gown-up-for-auction-but-it-looks-different-8013962",
    "timestamp": "2025-03-26T07:41:02Z"
  },
  {
    "title": "Supacell producer voices ‘huge concern’ for diverse storytelling in US under Trump",
    "description": "SERIES MANIA: Supacell producer Sheila Nortley says she has “huge concerns” for the future of representation in US content as a result of Donald Trump's anti-diversity, equity and inclusion (DEI) p...",
    "link": "https://www.c21media.net/news/supacell-producer-voices-huge-concern-for-diverse-storytelling-in-us-under-trump/",
    "timestamp": "2025-03-26T07:40:36Z"
  },
  {
    "title": "Trump Signs Executive Order Mandating Proof Of Citizenship In Major Election Overhaul",
    "description": "\"This country is so sick because of the elections, the fake elections and the bad elections, we're going to straighten that out one way or the other,\" Trump stated as he signed the order.",
    "link": "https://www.ibtimes.com/trump-signs-executive-order-mandating-proof-citizenship-major-election-overhaul-3767622",
    "timestamp": "2025-03-26T07:37:47Z"
  },
  {
    "title": "US Vice President JD Vance to join his wife in Greenland on Friday",
    "description": "U.S. Vice President JD Vance says he’s joining his wife on a Friday trip to Greenland, suggesting in an online video that global security is at stake",
    "link": "https://abcnews.go.com/Politics/wireStory/us-vice-president-jd-vance-join-wife-greenland-120149604",
    "timestamp": "2025-03-26T07:34:16Z"
  },
  {
    "title": "Interview: U.S. tariff policies to hit own economy, warns German economist",
    "description": "KIEL, Germany, March 26 (Xinhua) -- Washington's trade policies will heighten uncertainty and weigh",
    "link": "http://en.people.cn/n3/2025/0326/c90000-20294365.html",
    "timestamp": "2025-03-26T07:33:26Z"
  },
  {
    "title": "Lula urges Mercosur-Japan deal to counter Trump protectionism",
    "description": "Brazil’s President Luiz Inacio Lula da Silva called Wednesday for a trade deal between South America’s Mercosur bloc and Japan to counter growing US protectionism. “I am certain that we need to move forward in signing an Economic Partnership Agreement between…",
    "link": "https://www.digitaljournal.com/world/lula-urges-mercosur-japan-deal-to-counter-trump-protectionism/article",
    "timestamp": "2025-03-26T07:32:33Z"
  },
  {
    "title": "EU Could Slap Meta With €1 Billion Fine, Trump Vows To Retaliate",
    "description": "EU Could Slap Meta With €1 Billion Fine, Trump Vows To Retaliate\n \nVia Remix News,\nThe European Union could fine Mark Zuckerberg’s Meta (Facebook, Instagram) €1 billion or more for violating antitrust rules, in response to President Donald Trump’s sanctions a…",
    "link": "https://biztoc.com/x/ca01629125c03ffd",
    "timestamp": "2025-03-26T07:31:24Z"
  },
  {
    "title": "Lula Urges Mercosur-Japan Deal To Counter Trump Protectionism",
    "description": "Brazil's President Luiz Inacio Lula da Silva called Wednesday for a trade deal between South America's Mercosur bloc and Japan to counter growing US protectionism.",
    "link": "https://www.ibtimes.com/lula-urges-mercosur-japan-deal-counter-trump-protectionism-3767625",
    "timestamp": "2025-03-26T07:30:18Z"
  },
  {
    "title": "CNBC Daily Open: Consumers and CFOs alike are expecting a recession in the U.S.",
    "description": "Companies like SAP and BYD, despite enjoying a good run so far this year, may be unable to escape the turmoil if the U.S. does fall into recession.",
    "link": "https://www.cnbc.com/2025/03/26/cnbc-daily-open-consumers-and-cfos-expect-a-recession-in-the-us.html",
    "timestamp": "2025-03-26T07:30:01Z"
  },
  {
    "title": "Vietnam to cut duties on US imports, approve Starlink as Trump tariff decision looms",
    "description": "HANOI: Vietnam will cut its tariffs on several US products including LNG and cars, and moved to approve Starlink services, as the country tries to avoid being hit with U.S. tariffs because of its",
    "link": "https://www.channelnewsasia.com/asia/vietnam-cut-duties-us-imports-approve-starlink-trump-tariff-decision-looms-5024101",
    "timestamp": "2025-03-26T07:28:00Z"
  },
  {
    "title": "Vietnam approves Elon Musk’s Starlink ahead of Trump tariff decision | CNN Business",
    "description": "Vietnam will cut its tariffs on several US products including liquified natural gas (LNG) and cars, and moved to approve Starlink services, as the country tries to avoid being hit with US tariffs because of its large bilateral trade surplus.",
    "link": "https://www.cnn.com/2025/03/26/business/vietnam-approves-starlink-us-tariffs-intl-hnk/index.html",
    "timestamp": "2025-03-26T07:27:49Z"
  },
  {
    "title": "Portland schools face civil rights probe over transgender athlete",
    "description": "The U.S. Department of Education said on Tuesday its civil rights office is investigating the Portland, Oregon, school system for allowing a transgender high school runner to compete in female sports and use girls' locker rooms.The department's Office for Civ…",
    "link": "https://www.channelnewsasia.com/sport/portland-schools-face-civil-rights-probe-over-transgender-athlete-5024836",
    "timestamp": "2025-03-26T07:20:59Z"
  },
  {
    "title": "CNN Data Chief Offers Sobering 'Reality Check' On Just How Popular Trump Is Right Now",
    "description": "“All we talk about is how unpopular Donald Trump is but in reality...,\" said Harry Enten.",
    "link": "https://www.huffpost.com/entry/harry-enten-donald-trump-popularity_n_67e3a56ce4b076c73b1e6a4b",
    "timestamp": "2025-03-26T07:20:31Z"
  },
  {
    "title": "Mike Waltz admits 'full responsibility' for leaked war plans after journalist accidentally added to group chat",
    "description": "National Security Advisor Mike Waltz claims not to have seen the 'loser' journalist in the top-secret group chat",
    "link": "https://www.ladbible.com/news/us-news/mike-waltz-journalist-group-chat-response-us-leak-301825-20250326",
    "timestamp": "2025-03-26T07:20:15Z"
  },
  {
    "title": "US Vice President JD Vance to visit Greenland this week",
    "description": "Vance will join a high-profile US delegation to the territory, which US President Donald Trump has suggested Washington should acquire.",
    "link": "https://www.euractiv.com/section/politics/news/us-vice-president-jd-vance-to-visit-greenland-this-week/",
    "timestamp": "2025-03-26T07:16:00Z"
  },
  {
    "title": "US-brokered Black Sea truce in doubt as Russia demands sanctions relief",
    "description": "Ukraine claims Kremlin is lying about terms of deal, while EU says invasion must end before it can ease sanctions",
    "link": "https://www.irishtimes.com/world/2025/03/26/us-brokered-black-sea-truce-in-doubt-as-russia-demands-sanctions-relief/",
    "timestamp": "2025-03-26T07:12:54Z"
  },
  {
    "title": "Authentication bypass CVE-2025-22230 impacts VMware Windows Tools",
    "description": "Broadcom addressed a high-severity authentication bypass vulnerability, tracked as CVE-2025-22230, in VMware Tools for Windows. Broadcom released security updates to address a high-severity authentication bypass vulnerability, tracked as CVE-2025-22230 (CVSS …",
    "link": "https://securityaffairs.com/175858/security/authentication-bypass-cve-2025-22230-in-vmware-tools-for-windows.html",
    "timestamp": "2025-03-26T07:07:02Z"
  },
  {
    "title": "XBT.com Surpasses $3M at Lloyds Auctions, Poised to Be the Largest Crypto Domain Sale Since 2021",
    "description": "The premium crypto domain XBT.com has surpassed $3 million USD in its ongoing auction at Lloyds, positioning it as one of the most valuable digital asset domain sales in recent history and potentially the largest crypto domain sale since 2021 The premium cryp…",
    "link": "https://www.globenewswire.com/news-release/2025/03/26/3049354/0/en/XBT-com-Surpasses-3M-at-Lloyds-Auctions-Poised-to-Be-the-Largest-Crypto-Domain-Sale-Since-2021.html",
    "timestamp": "2025-03-26T07:05:00Z"
  },
  {
    "title": "Trump Family's World Liberty Financial Crypto Venture to Launch Stablecoin",
    "description": "Donald Trump's World Liberty Financial will launch a dollar-pegged USD1 stablecoin. USD1 will be launched on the Ethereum and Binance Smart Chain blockchains - digital ledgers that underpin the movement of crypto coins.",
    "link": "https://www.gadgets360.com/cryptocurrency/news/donald-trump-stablecoin-world-liberty-financial-8013680",
    "timestamp": "2025-03-26T07:01:41Z"
  },
  {
    "title": "Ripple Labs says it settles with US SEC, will pay reduced $50 million fine",
    "description": "Ripple Labs has settled a lawsuit with the U.S. SEC over the sale of unregistered securities, agreeing to pay $50 million of a $125 million fine. The settlement, while pending approval, resolves one of the SEC's high-profile cases against the cryptocurrency i…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/ripple-labs-says-it-settles-with-us-sec-will-pay-reduced-50-million-fine/articleshow/119523804.cms",
    "timestamp": "2025-03-26T07:00:43Z"
  },
  {
    "title": "Ceann Comhairle under pressure as Opposition considers vote of no confidence over speaking rights row",
    "description": "Opposition leaders are to meet on Wednesday after new speaking rights for Government-supporting Independent TDs were rammed through by the Government in a vote late on Tuesday.",
    "link": "https://www.independent.ie/irish-news/politics/ceann-comhairle-under-pressure-as-opposition-considers-vote-of-no-confidence-over-speaking-rights-row/a776829398.html",
    "timestamp": "2025-03-26T07:00:00Z"
  },
  {
    "title": "Dáil speaking row: Opposition ‘gave two fingers to democracy’, claims minister as Verona Murphy could face confidence vote",
    "description": "Opposition leaders are to meet on Wednesday after new speaking rights for Government-supporting Independent TDs were rammed through by the Government in a vote late on Tuesday.",
    "link": "https://www.independent.ie/irish-news/politics/dail-speaking-row-opposition-gave-two-fingers-to-democracy-claims-minister-as-verona-murphy-could-face-confidence-vote/a776829398.html",
    "timestamp": "2025-03-26T07:00:00Z"
  },
  {
    "title": "‘HAHAHAHA!’: Marjorie Taylor Greene Accidentally Defies Trump With Hilarious Self-Own",
    "description": "The Georgia Republican edited her social media post but the gaffe lived on.",
    "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-gaffe-mocked_n_67e397fee4b076c73b1e6449",
    "timestamp": "2025-03-26T06:55:45Z"
  },
  {
    "title": "US vice-president JD Vance to join his wife on Greenland trip",
    "description": "Danish prime minister has accused US of putting ‘unacceptable pressure’ on Greenland",
    "link": "https://www.irishtimes.com/world/us/2025/03/26/us-vice-president-jd-vance-to-join-his-wife-on-greenland-trip/",
    "timestamp": "2025-03-26T06:53:38Z"
  },
  {
    "title": "Anduril says AI startup sees good 'vibes' from new Trump Pentagon",
    "description": "Anduril President Christian Brose praised the Trump administration's willingness to shake up defence and support new approaches, particularly in autonomous systems. Anduril is collaborating with OpenAI on AI solutions for national security, with plans for glo…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/anduril-says-ai-startup-sees-good-vibes-from-new-trump-pentagon/articleshow/119523086.cms",
    "timestamp": "2025-03-26T06:49:07Z"
  },
  {
    "title": "GameStop is getting into bitcoin — and investors are thrilled",
    "description": "Videogame seller GameStop said it will now include bitcoin in its financial investments, and investors are piling in.",
    "link": "https://www.businessinsider.com/gamestop-stock-jumps-after-bitcoin-investment-announcement-2025-3",
    "timestamp": "2025-03-26T06:49:04Z"
  },
  {
    "title": "ECB pushes back against calls for looser eurozone bank rules",
    "description": "The European Central Bank has pushed back against calls to loosen rules for eurozone banks despite fears they could fall behind U.S. rivals if President Donald Trump implements major deregulation.",
    "link": "https://www.hurriyetdailynews.com/ecb-pushes-back-against-calls-for-looser-eurozone-bank-rules-207341",
    "timestamp": "2025-03-26T06:44:20Z"
  },
  {
    "title": "Bolsonaro accused of heading 'criminal organisation' to retain power after losing elections in Brazil",
    "description": "The court heard that Bolsonaro was one of the “leaders” of a plot to keep him in office after he lost in the 2022 elections.",
    "link": "https://www.thejournal.ie/bolsonaro-coup-detat-brazil-elections-court-6659290-Mar2025/",
    "timestamp": "2025-03-26T06:43:31Z"
  },
  {
    "title": "US intelligence officials to appear at House hearing after Senate grilling over leaked military plan",
    "description": "President Donald Trump's top intelligence officials will brief House lawmakers on global threats facing the US. They are expected to be questioned about their use of a group text to discuss plans for military strikes in Yemen. Key topics include the security …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-intelligence-officials-to-appear-at-house-hearing-after-senate-grilling-over-leaked-military-plan/articleshow/119522249.cms",
    "timestamp": "2025-03-26T06:35:32Z"
  },
  {
    "title": "\"Uniting For Ukraine\" Program Suspended, Ukrainians Now Fret Under Trump",
    "description": "Trump administration has suspended &quot;Uniting for Ukraine&quot;, which allowed more than 200,000 Ukrainians to legally reside in the US.",
    "link": "https://www.ndtv.com/world-news/uniting-for-ukraine-program-suspended-ukrainians-now-fret-under-donald-trump-8013484",
    "timestamp": "2025-03-26T06:33:09Z"
  },
  {
    "title": "Devina Mehra: Trump stocks? They’re mythical at best in this new era of uncertainty",
    "description": "The US president’s actions have threatened the world order in ways that all but consign predictability to history. This is why the fabled ‘Trump trade’ did not work for investors.",
    "link": "https://www.livemint.com/opinion/online-views/trump-trade-multilateral-trade-stock-market-tesla-s-p-500-nasdaq-trump-stocks-bilateral-negotiations-high-net-worth-11742915994734.html",
    "timestamp": "2025-03-26T06:30:13Z"
  },
  {
    "title": "Russia already trying to ‘distort’ ?Black Sea truce, Zelensky says as each side reports drone attacks",
    "description": "Ukrainian president Volodymyr Zelensky said a truce with Russia covering the Black Sea and energy strikes was effective immediately yesterday, but warned that Moscow was already manipulating and distorting the accords.",
    "link": "https://www.independent.ie/world-news/europe/russia-already-trying-to-distort-black-sea-truce-zelensky-says-as-each-side-reports-drone-attacks/a332438640.html",
    "timestamp": "2025-03-26T06:30:00Z"
  },
  {
    "title": "Court in Japan orders the dissolution of the Unification Church",
    "description": "The Unification Church in Japan was ordered dissolved after a government request spurred by the investigation into the 2022 assassination of former Prime Minister Shinzo Abe.",
    "link": "https://www.nbcnews.com/news/world/court-japan-orders-dissolution-unification-church-rcna198121",
    "timestamp": "2025-03-26T06:25:59Z"
  },
  {
    "title": "Rep. Lauren Boebert suggests GOP could rename DC ‘District of America’: ‘Keep the jokes at bay’",
    "description": "President Trump changed the name of the Gulf of Mexico to the Gulf of America days after taking office.",
    "link": "https://nypost.com/2025/03/26/us-news/colorado-rep-lauren-boebert-suggests-gop-could-rename-dc-district-of-america/",
    "timestamp": "2025-03-26T06:23:30Z"
  },
  {
    "title": "How bad might things get for Tesla?",
    "description": "Irish sales of the controversial electric car brand are holding up and will probably increase overall this year",
    "link": "https://www.irishtimes.com/motors/2025/03/26/how-bad-might-things-get-for-tesla/",
    "timestamp": "2025-03-26T06:18:00Z"
  },
  {
    "title": "François Bayrou: 100 days at the helm, but trouble looms",
    "description": "In today’s edition of The Capitals, read about the Czech PM’s aide calling Ukraine’s control of 80% of its land a major win, Greece postponing a meeting with Turkey over Imamoğlu’s arrest, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-francois-bayrou-100-days-at-the-helm-but-trouble-looms/",
    "timestamp": "2025-03-26T06:17:36Z"
  },
  {
    "title": "Letter from the American Hellenic Institute to Trump on Turkey’s non-reintegration into the F-35 program",
    "description": "The AHI explains in detail Turkey's anti-alliance and destabilising behaviour which, it claims, damages US interests\nThe post Letter from the American Hellenic Institute to Trump on Turkey’s non-reintegration into the F-35 program appeared first on ProtoThema…",
    "link": "https://en.protothema.gr/2025/03/26/letter-from-the-american-hellenic-institute-to-trump-on-turkeys-non-reintegration-into-the-f-35-program/",
    "timestamp": "2025-03-26T06:16:38Z"
  },
  {
    "title": "JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'",
    "description": "US vice president JD Vance will fly to Greenland this week, after accusing American and Danish leaders of ignoring the island \"for far too long\".",
    "link": "https://news.sky.com/story/jd-vance-announces-trip-to-greenland-and-accuses-denmark-of-ignoring-island-for-far-too-long-13335925",
    "timestamp": "2025-03-26T06:15:00Z"
  },
  {
    "title": "Trump feels ‘very comfortable’ after being briefed on Houthi attack text scandal, blames ‘lower level’ Waltz staffer for mishap",
    "description": "“There was no classified information. There was no problem. And the attack was a tremendous success,” Trump said during an interview with Newsmax host Greg Kelly.",
    "link": "https://nypost.com/2025/03/26/us-news/trump-feels-very-comfortable-after-being-briefed-on-houthi-attack-group-text-scandal-blames-lower-level-waltz-staffer-for-including-atlantic-editor-on-the-thread/",
    "timestamp": "2025-03-26T06:10:58Z"
  },
  {
    "title": "Gunman who killed 23 in Texas Walmart attack can avoid death penalty with plea deal",
    "description": "El Paso County District Attorney James Montoya said that his decision in the prosecution of Patrick Crusius was driven by a majority of victims' relatives who wanted the case behind them.",
    "link": "https://www.npr.org/2025/03/26/g-s1-55939/gunman-texas-walmart-attack-death-penalty-plea-deal",
    "timestamp": "2025-03-26T06:10:26Z"
  },
  {
    "title": "'Toxic brand': Irish Tesla drivers want you to know they don't all support Trump and Elon Musk",
    "description": "Some Irish Tesla drivers are now feelingmore than a hint of buyer’s remorse.",
    "link": "https://www.thejournal.ie/irish-tesla-drivers-want-you-to-know-they-dont-all-support-elon-musk-6658510-Mar2025/",
    "timestamp": "2025-03-26T06:00:38Z"
  },
  {
    "title": "Europe must avoid tariff row and ‘verbal escalation’ with US, Italian minister tells Dublin conference",
    "description": "Valentino Valentini says Italy and Ireland should forge greater trading ties to counter the impact of tariffs",
    "link": "https://www.irishtimes.com/business/2025/03/26/europe-must-avoid-tariff-row-and-verbal-escalation-with-us-italian-minister-tells-dublin-conference/",
    "timestamp": "2025-03-26T06:00:01Z"
  },
  {
    "title": "A batty planning process: the weaponisation of nocturnal creatures is a symbol of Ireland’s housing mire",
    "description": "After a decade of tinkering around the edges, it must surely be time for more drastic measures to be considered, including emergency powers for government",
    "link": "https://www.irishtimes.com/business/2025/03/26/time-to-do-a-trump-and-grant-emergency-powers-to-override-the-planning-system-and-get-new-housing-built/",
    "timestamp": "2025-03-26T06:00:01Z"
  },
  {
    "title": "Trump downplays unprecedented self-inflicted US security breach as ‘the only glitch in two months’",
    "description": "Washington political circles struggle to absorb staggering blunder by senior cabinet members",
    "link": "https://www.irishtimes.com/world/us/2025/03/26/trump-downplays-unprecedented-self-inflicted-us-security-breach-as-the-only-glitch-in-two-months/",
    "timestamp": "2025-03-26T06:00:01Z"
  },
  {
    "title": "President Putin: 25 Years of Resisting the US Deep State and European Globalists",
    "description": "Since winning on March 26, 2000, Putin has fought to protect Russia’s sovereignty—standing up to George Soros, the Rothschilds, and Western elites. Read more to see how he did it.",
    "link": "https://sputnikglobe.com/20250326/president-putin-25-years-of-resisting-the-us-deep-state-and-european-globalists--1121687870.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Ukraine President Zelensky tells Time magazine that 'Russia managed to influence some in the White House with Putin's words,' surprisingly doesn't name Trump and his entire cabinet [Obvious]",
    "description": "Ukraine President Zelensky tells Time magazine that 'Russia managed to influence some in the White House with Putin's words,' surprisingly doesn't name Trump and his entire cabinet",
    "link": "https://www.fark.com/comments/13609570/Ukraine-President-Zelensky-tells-Time-magazine-that-Russia-managed-to-influence-some-in-White-House-with-Putins-words-surprisingly-doesnt-name-Trump-his-entire-cabinet",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s greatest betrayal so far: Accelerating Middle East wars, silencing dissent, and serving Zionist masters",
    "description": "Donald Trump, supposedly the “peace president,” was elected on promises of ending “stupid wars.” However, he has instead escalated U.S. military aggression in the Middle East – turning his back on his campaign promise. Trump’s administration is actively suppr…",
    "link": "https://www.naturalnews.com/2025-03-26-trump-greatest-betrayal-accelerating-middle-east-wars.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Trump Media and Crypto.com forge ETF partnership: A political and financial gamble",
    "description": "Trump Media & Technology Group (TMTG) signed a nonbinding agreement with Crypto.com to launch “America First” ETFs, blending digital assets and U.S.-focused traditional securities. TMTG’s stock surged 9% after the news. President Donald Trump, once skeptical …",
    "link": "https://www.naturalnews.com/2025-03-26-trump-media-and-crypto-com-forge-etf-partnership.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Tesla moves a step closer toward its goal of operating a fleet of autonomous robotaxis in California",
    "description": "Tesla has secured its first regulatory approval from the California Public Utilities Commission (CPUC) for a transportation charter-party carrier permit (TCP), allowing it to operate a fleet of vehicles for pre-arranged employee transportation. However, this …",
    "link": "https://www.naturalnews.com/2025-03-26-tesla-moves-closer-operating-autonomous-robotaxis-california.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Homan defends Trump admin’s immigration stance that has yielded 40,000 ARRESTS since January",
    "description": "Since President Donald Trump’s return to office in January, his administration has prioritized immigration enforcement – resulting in approximately 40,000 arrests of illegal immigrants in just over six months, with a focus on public safety and national securi…",
    "link": "https://www.naturalnews.com/2025-03-26-homan-defends-trump-admin-aggressive-immigration-stance.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Political tensions rise as European nations issue warnings over U.S. travel policies",
    "description": "Several European nations issued warnings this month about stricter U.S. immigration enforcement, citing risks of detention or deportation for non-compliance with entry rules. The advisories highlight cases like a British cartoonist detained for visa issues, w…",
    "link": "https://www.naturalnews.com/2025-03-26-european-nations-issue-warnings-over-us-travel-policies.html",
    "timestamp": "2025-03-26T06:00:00Z"
  },
  {
    "title": "Huthis say US warplanes carried out 17 strikes in Yemen",
    "description": "Huthi media in Yemen reported Wednesday at least 17 strikes in Saada and Amran, blaming the United States for the attacks. The rebels’ Ansarollah website said US warplanes carried out “aggressive air raids… causing material damage to citizens’ property”, but …",
    "link": "https://www.digitaljournal.com/world/huthis-say-us-warplanes-carried-out-17-strikes-in-yemen/article",
    "timestamp": "2025-03-26T05:57:21Z"
  },
  {
    "title": "The War on Terror Comes Home in the Trump Era",
    "description": "Four years ago, I published Subtle Tools, a book on the erosion of American democratic norms in the face of what came to be known as the Global War on Terror. Both what had been done in the name of “national security” in response to the 9/11 attacks and how i…",
    "link": "https://www.counterpunch.org/2025/03/26/the-war-on-terror-comes-home-in-the-trump-era/",
    "timestamp": "2025-03-26T05:56:57Z"
  },
  {
    "title": "U.S. National Security Advisor Waltz claims responsibility for leaked chat of Yemen military plan",
    "description": "U.S. National Security Advisor Mike Waltz has assumed \"full responsibility\" for a leaked group chat discussing an upcoming strike in Yemen.",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250326-pdo01.htm",
    "timestamp": "2025-03-26T05:53:59Z"
  },
  {
    "title": "Trump administration 'accidentally' texted me its war plans for Yemen: American journalist",
    "description": "Senior officials within the administration of US President Donald Trump are reported to have inadvertently included Jeffrey Goldberg, editor-in-chief of the American magazine The Atlantic, in a confidential group chat discussing imminent military aggression a…",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250325-presstv01.htm",
    "timestamp": "2025-03-26T05:53:59Z"
  },
  {
    "title": "Trump stands by national security adviser Mike Waltz despite war plan leak in group chat",
    "description": "U.S. President Donald Trump on Tuesday stood by his national security adviser, Mike Waltz, after The Atlantic's editor-in-chief was accidentally added to Signal group chat where high-level national security officials were discussing military plans in Yemen.",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250326-pdo02.htm",
    "timestamp": "2025-03-26T05:53:59Z"
  },
  {
    "title": "U.S. journalist accidentally added to group chat discussing confidential Yemen attack plan",
    "description": "Senior U.S. national security officials added a prominent journalist to a Signal group chat discussing a military strike on the Houthis in Yemen, making him aware of the airstrike plan two hours before the U.S. operation.",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250325-pdo01.htm",
    "timestamp": "2025-03-26T05:53:59Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Wednesday",
    "description": "Verdi kicks off two-day public transport strike in Berlin, business morale perks up in March, expected minister pulls out after protest on family farm and more news from around Germany on Wednesday.",
    "link": "https://www.thelocal.de/20250326/today-in-germany-a-roundup-of-the-latest-news-on-wednesday-64",
    "timestamp": "2025-03-26T05:45:55Z"
  },
  {
    "title": "Rubio to look at new path on Haiti on Caribbean trip",
    "description": "US Secretary of State Marco Rubio heads Wednesday to the Caribbean looking for ways forward on violence-torn Haiti and to show support for oil-rich Guyana in its dispute with Venezuela. Donald Trump’s top diplomat will fly Wednesday to Jamaica for a summit of…",
    "link": "https://www.digitaljournal.com/world/rubio-to-look-at-new-path-on-haiti-on-caribbean-trip/article",
    "timestamp": "2025-03-26T05:45:27Z"
  },
  {
    "title": "Brazil’s Bolsonaro awaits ruling over alleged coup bid",
    "description": "Brazilian ex-president Jair Bolsonaro will learn on Wednesday whether he faces trial on charges of backing a coup bid after being voted out of office in 2022. Brazil’s Supreme Court on Tuesday heard arguments for and against putting the country’s 2019-2022 le…",
    "link": "https://www.digitaljournal.com/world/brazils-bolsonaro-awaits-ruling-over-alleged-coup-bid/article",
    "timestamp": "2025-03-26T05:45:27Z"
  },
  {
    "title": "Rubio To Look At New Path On Haiti On Caribbean Trip",
    "description": "US Secretary of State Marco Rubio heads Wednesday to the Caribbean looking for ways forward on violence-torn Haiti and to show support for oil-rich Guyana in its dispute with Venezuela.",
    "link": "https://www.ibtimes.com/rubio-look-new-path-haiti-caribbean-trip-3767618",
    "timestamp": "2025-03-26T05:45:18Z"
  },
  {
    "title": "Brazil's Bolsonaro Awaits Ruling Over Alleged Coup Bid",
    "description": "Brazilian ex-president Jair Bolsonaro will learn on Wednesday whether he faces trial on charges of backing a coup bid after being voted out of office in 2022.",
    "link": "https://www.ibtimes.com/brazils-bolsonaro-awaits-ruling-over-alleged-coup-bid-3767615",
    "timestamp": "2025-03-26T05:45:17Z"
  },
  {
    "title": "North Carolina bills would add crypto to state’s retirement system",
    "description": "North Carolina lawmakers have introduced bills in the House and Senate that could see the state’s treasurer allocate up to 5% of various state retirement funds into cryptocurrencies such as Bitcoin.The Investment Modernization Act (House Bill 506), introduced…",
    "link": "https://cointelegraph.com/news/north-carolina-twin-bills-crypto-state-retirement-funds",
    "timestamp": "2025-03-26T05:43:51Z"
  },
  {
    "title": "Mixed Signal: The Other Side of the “Unitary Executive” Coin",
    "description": "“As I heard it, the president was clear,” someone thought to be deputy White House chief of staff Steven Miller allegedly texted to a Signal chat involving several cabinet members and inadvertently including Jeffrey Goldberg, editor in chief of The Atlantic. …",
    "link": "https://www.counterpunch.org/2025/03/26/mixed-signal-the-other-side-of-the-unitary-executive-coin/",
    "timestamp": "2025-03-26T05:42:12Z"
  },
  {
    "title": "Trump downplays firestorm over leaked Yemen air strike chat",
    "description": "U.S. President Donald Trump downplayed a growing scandal Tuesday after a journalist was accidentally added to a group chat about air strikes on Yemen, denying any classified information was shared and defending a top aide over the breach.",
    "link": "https://www.hurriyetdailynews.com/trump-downplays-firestorm-over-leaked-yemen-air-strike-chat-207337",
    "timestamp": "2025-03-26T05:38:14Z"
  },
  {
    "title": "Russia, Ukraine agree to halt Black Sea clashes with Türkiye as potential observer",
    "description": "Russia and Ukraine agreed Tuesday to halt military strikes in the Black Sea and on energy sites during talks brokered by the United States, which offered to ease pressure on agricultural exports as a first concrete incentive to Moscow, as Ukrainian President …",
    "link": "https://www.hurriyetdailynews.com/russia-ukraine-agree-to-halt-black-sea-clashes-with-turkiye-as-potential-observer-207336",
    "timestamp": "2025-03-26T05:35:16Z"
  },
  {
    "title": "Anduril says AI start-up sees good 'vibes' from new Trump Pentagon",
    "description": "AVALON : Anduril president Christian Bose said the AI-powered defence start-up, whose founder left Facebook over his early support of Donald Trump, has good \"vibes\" about the Trump administration's shakeup of defence and willingness to do things differently.B…",
    "link": "https://www.channelnewsasia.com/business/anduril-says-ai-start-up-sees-good-vibes-new-trump-pentagon-5024656",
    "timestamp": "2025-03-26T05:15:31Z"
  },
  {
    "title": "Trump's new executive order could upend voting",
    "description": "The order tests the power of Trump's authority and would require voters using a federal form to show proof of citizenship to register to vote in federal elections. It's sure to be tested in court.",
    "link": "https://www.npr.org/2025/03/26/g-s1-55927/trump-voting-citizenship-executive-order",
    "timestamp": "2025-03-26T05:09:10Z"
  },
  {
    "title": "U.S. blacklists over 50 Chinese companies in bid to curb Beijing's AI, chip capabilities",
    "description": "The U.S. on Tuesday added dozens of Chinese tech companies to its export blacklist in its first such effort under the Donald Trump administration, as it doubles down on curtailing Beijing's artificial intelligence and advanced computing capabilities.\nThe U.S.…",
    "link": "https://biztoc.com/x/5d86691bb7a065db",
    "timestamp": "2025-03-26T05:08:15Z"
  },
  {
    "title": "Trump-backed crypto project announces stablecoin",
    "description": "In a market that already feels stuffed to the brim with virtual tokens, World Liberty Financial, a crypto project backed by President Donald Trump and his family, has announced the release of a new stablecoin tied to the US dollar called USD1.\nWhat is a stabl…",
    "link": "https://biztoc.com/x/e78b37b8fe0b1ea5",
    "timestamp": "2025-03-26T05:08:05Z"
  },
  {
    "title": "Trump signs executive order overhauling US elections, mentions India example",
    "description": "Voters will now be required to show proof of citizenship during federal elections, US President Donald Trump states, citing examples of India and some other nations",
    "link": "https://www.thehindubusinessline.com/news/world/trump-signs-executive-order-overhauling-us-elections-mentions-india-example/article69375963.ece",
    "timestamp": "2025-03-26T05:06:16Z"
  },
  {
    "title": "Politico parent quietly bids ‘Auf Wiedersehen’ to board member amid Gaza spat",
    "description": "A spokesman confirmed Martín Varsavsky’s departure, but denied any correlation with last week's public squabble",
    "link": "https://www.euractiv.com/section/politics/news/politico-parent-quietly-bids-auf-wiedersehen-to-board-member-amid-gaza-spat/",
    "timestamp": "2025-03-26T05:05:57Z"
  },
  {
    "title": "Fidan, Rubio signal defense breakthrough in Washington talks",
    "description": "Foreign Minister Hakan Fidan and U.S. Secretary of State Marco Rubio underscored their commitment to removing obstacles to defense industry cooperation during a meeting in Washington on Tuesday, according to Turkish Foreign Ministry sources.",
    "link": "https://www.hurriyetdailynews.com/fidan-rubio-signal-defense-breakthrough-in-washington-talks-207332",
    "timestamp": "2025-03-26T05:04:53Z"
  },
  {
    "title": "Woman's son claims Las Vegas Trump hotel's revolving door caused her to fall and later die",
    "description": "A California woman's son is suing Trump International Hotels for alleged negligence, claiming a Trump Hotel Las Vegas door caused her to fall and later die.",
    "link": "https://www.nbcnews.com/news/us-news/womans-son-claims-las-vegas-trump-hotels-revolving-door-caused-fall-la-rcna198108",
    "timestamp": "2025-03-26T05:04:07Z"
  },
  {
    "title": "Rupee falls 6 paise to 85.78 against US dollar in early trade",
    "description": "The rupee weakened by 6 paise to 85.78 against the US dollar due to a negative trend in domestic equities and the recovery of the American currency. Liquidity constraints and concerns over reciprocal tariffs also pressured the rupee, despite support from fore…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-falls-6-paise-to-85-78-against-us-dollar-in-early-trade/articleshow/119517008.cms",
    "timestamp": "2025-03-26T05:03:34Z"
  },
  {
    "title": "U.S. blacklists over 50 Chinese companies in bid to curb Beijing's AI, chip capabilities",
    "description": "The export restrictions come at a time when tensions between Washington and Beijing have been rising with the Trump administration ratcheting up tariffs against China.",
    "link": "https://www.cnbc.com/2025/03/26/us-blacklists-50-chinese-companies-in-bid-to-curb-beijings-ai-chip-capabilities.html",
    "timestamp": "2025-03-26T05:02:55Z"
  },
  {
    "title": "Researchers in limbo as Columbia bows to Trump's demands in bid to restore $400M federal funding cut",
    "description": "President Trump's cancellation of $400 million in funding to Columbia University over its handling of student protests forced the university to change its policies to restore funding. The cuts impacted critical research, including cancer studies and pandemic-…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/researchers-in-limbo-as-columbia-bows-to-trumps-demands-in-bid-to-restore-400m-federal-funding-cut/articleshow/119516898.cms",
    "timestamp": "2025-03-26T05:01:28Z"
  },
  {
    "title": "Rupee falls 6 paise to 85.78 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened at 85.71 against the greenback, then lost ground and touched 85.78, down 6 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-6-paise-to-8578-against-us-dollar-in-early-trade/article69375980.ece",
    "timestamp": "2025-03-26T05:00:01Z"
  },
  {
    "title": "Crypto group backed by Donald Trump to launch stablecoin",
    "description": "Crypto group backed by Donald Trump to launch stablecoin\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and executive or…",
    "link": "https://biztoc.com/x/c7b11f572bf6481b",
    "timestamp": "2025-03-26T04:57:09Z"
  },
  {
    "title": "Panic in Africa as Donald Trump decision will ‘cause millions to die’ - Express",
    "description": "Panic in Africa as Donald Trump decision will ‘cause millions to die’Express ‘People will die based on these decisions’: Trump administration cuts funding for dozens of HIV studiesCNN US cuts to HIV aid will cost millions of lives - UNAids chiefBBC.com UN age…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176826129",
    "timestamp": "2025-03-26T04:52:37Z"
  },
  {
    "title": "Vietnam proposes to cut tariffs on LNG, cars, agricultural goods",
    "description": "<p>HANOI &mdash; Vietnam&rsquo;s finance ministry has put forward a proposal to cut preferential import tariffs on a range of products including liquefied natural gas (LNG), cars, wood and agricultural products, as the nation seeks to avoid the imminent threa…",
    "link": "https://www.bangkokpost.com/business/general/2987945/vietnam-proposes-to-cut-tariffs-on-lng-cars-agricultural-goods",
    "timestamp": "2025-03-26T04:52:00Z"
  },
  {
    "title": "Judge Halts US Bid To Detain Columbia University Student For Deportation",
    "description": "US authorities are seeking to deport a university student who has resided in the country since she was seven years old, her lawsuit fighting the action says, as Donald Trump presses his campaign against learners linked to pro-Palestinian protests.",
    "link": "https://www.ndtv.com/world-news/yunseo-chung-judge-halts-us-bid-to-detain-columbia-university-student-for-deportation-8012865",
    "timestamp": "2025-03-26T04:51:37Z"
  },
  {
    "title": "US vice president’s visit to Greenland ‘unacceptable pressure’: Danish PM",
    "description": "JD Vance's visit to Greenland with senior officials comes as US President Trump says he wants to take the territory.",
    "link": "https://www.aljazeera.com/news/2025/3/26/us-vice-presidents-visit-to-greenland-unacceptable-pressure-danish-pm",
    "timestamp": "2025-03-26T04:49:04Z"
  },
  {
    "title": "Secretive Chinese network tries to lure fired U.S. federal workers, research shows",
    "description": "A network of companies operated by a secretive Chinese tech firm has been trying to recruit recently laid-off U.S. government workers, according to job ads and a researcher who uncovered the campaign. Max Lesser, a senior analyst on emerging threats with the …",
    "link": "https://japantoday.com/category/world/exclusive-secretive-chinese-network-tries-to-lure-fired-federal-workers-research-shows1",
    "timestamp": "2025-03-26T04:45:05Z"
  },
  {
    "title": "'Can't Be Trusted': Sen. Adam Schiff Demands Resignations Of Trump Scandal Figures",
    "description": "The California Democrat named the administration officials who should quit or be fired after accidentally revealing highly classified information to a journalist.",
    "link": "https://www.huffpost.com/entry/adam-schiff-hegseth-resign_n_67e36ac1e4b06578159a6c05",
    "timestamp": "2025-03-26T04:43:13Z"
  },
  {
    "title": "Melania Trump’s wedding dress is ‘up for auction’ 20 years later — but it doesn’t look the same",
    "description": "The First Lady of the United States wore the dress designed by John Galliano to marry Donald Trump in Palm Beach, Florida",
    "link": "https://www.the-independent.com/life-style/melania-trump-wedding-dress-auction-ebay-cost-b2721642.html",
    "timestamp": "2025-03-26T04:41:55Z"
  },
  {
    "title": "‘A Great Honor’: Dodgers Accept White House Invite, Will Make Trip In April",
    "description": "The Los Angeles Dodgers have announced that they have accepted a White House invite from President Donald Trump.",
    "link": "https://dailycaller.com/2025/03/26/los-angeles-dodgers-white-house-invite-mlb/",
    "timestamp": "2025-03-26T04:38:12Z"
  },
  {
    "title": "\"He's Not Even American\": Fake Clip Of JD Vance Slamming Elon Musk Viral",
    "description": "The clip went viral days after JD Vance acknowledged that Elon Musk has made &quot;mistakes&quot; while executing mass firings of federal employees.",
    "link": "https://www.ndtv.com/world-news/jd-vances-fake-clip-criticising-elon-musk-goes-viral-us-veep-responds-8012750",
    "timestamp": "2025-03-26T04:38:08Z"
  }
]