[
  {
    "title": "Donald Trump’s UK state visit set for September — when MPs are away - politico.eu",
    "description": "Donald Trump’s UK state visit set for September — when MPs are awaypolitico.eu Trump news at a glance: King Charles schedules state visit as president booed at Club World Cup finalThe Guardian King Charles III to host Trump in September for second U.K. state …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178372452",
    "timestamp": "2025-07-14T05:52:46Z"
  },
  {
    "title": "EU ministers weigh response to latest Trump tariff threat",
    "description": "EU ministers on Monday will debate the bloc's approach to trade talks with the United States, as Brussels scrambles to head off 30-percent tariffs threatened by President Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/eu-ministers-weigh-response-to-latest-trump-tariff-threat-211429",
    "timestamp": "2025-07-14T05:52:21Z"
  },
  {
    "title": "EU ready to hit US with 21-billion-euro tariff list, Italy foreign minister says",
    "description": "MILAN (Reuters) -The European Union has already prepared a list of tariffs worth 21 billion euros ($24.52 billion) on U.S. goods if the two countries fail to...",
    "link": "https://finance.yahoo.com/news/eu-ready-hit-us-21-055054171.html",
    "timestamp": "2025-07-14T05:50:54Z"
  },
  {
    "title": "Israeli strikes kill 43, including children awaiting water in Gaza",
    "description": "Gaza's civil defense agency said Israeli air strikes on Sunday killed more than 40 Palestinians, including children at a water distribution point, as talks for a ceasefire between Israel and Hamas stalled.",
    "link": "https://www.hurriyetdailynews.com/israeli-strikes-kill-43-including-children-awaiting-water-in-gaza-211428",
    "timestamp": "2025-07-14T05:48:33Z"
  },
  {
    "title": "Trump set to unveil 'aggressive' Ukraine arms plan",
    "description": "United States President Donald Trump will supposedly reveal a new plan to arm Ukraine that will most likely include offensive weapons such as long-range missiles capable of striking deep into Russian ...",
    "link": "https://biztoc.com/x/03d7bf1eecae6185",
    "timestamp": "2025-07-14T05:42:30Z"
  },
  {
    "title": "'All Jews should die': Elmo’s X account hacked, posting antisemitic content",
    "description": "Elmo's X account hacked, posting violent antisemitic messages calling for the extermination of Jews; Sesame Workshop confirms account was compromised, quickly removing the posts.",
    "link": "https://www.israelnationalnews.com/news/411626",
    "timestamp": "2025-07-14T05:39:00Z"
  },
  {
    "title": "EU is ready to hit US with €21bn tariff list, Italy foreign minister says",
    "description": "The European Union has already prepared a list of tariffs worth 21 billion euros ($24.52 billion) on U.S. goods if the two countries fail to reach a trade deal, Italy's Foreign Minister Antonio Tajani said in a newspaper interview on Monday.",
    "link": "https://www.independent.ie/world-news/europe/eu-is-ready-to-hit-us-with-21bn-tariff-list-italy-foreign-minister-says/a789662673.html",
    "timestamp": "2025-07-14T05:37:24Z"
  },
  {
    "title": "President Trump's Global Tariff Hike Poised to Drive Up GCC Contruction Costs by as Much as 7%",
    "description": "Stonehaven Report Reveals UAE & KSA Could See 7% Spike In 2025 Stonehaven Report Reveals UAE & KSA Could See 7% Spike In 2025",
    "link": "https://www.globenewswire.com/news-release/2025/07/14/3114481/0/en/President-Trump-s-Global-Tariff-Hike-Poised-to-Drive-Up-GCC-Contruction-Costs-by-as-Much-as-7.html",
    "timestamp": "2025-07-14T05:33:00Z"
  },
  {
    "title": "What binds nations together at the Island Games?",
    "description": "Islanders arrived in Orkney  to compete athletically, but the bonds behind the event run much deeper.",
    "link": "https://www.bbc.com/news/articles/cp824r11g0ko",
    "timestamp": "2025-07-14T05:32:58Z"
  },
  {
    "title": "Chelsea's Cole Palmer surprised to share Club World Cup podium spotlight with Donald Trump - AP News",
    "description": "Chelsea's Cole Palmer surprised to share Club World Cup podium spotlight with Donald TrumpAP News Trump gets mixed reception at soccer final, a test run for the World CupThe Washington Post Trump awards Chelsea the Club World Cup trophy amid boos, that one aw…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178372384",
    "timestamp": "2025-07-14T05:32:05Z"
  },
  {
    "title": "Trump Economy Defies Doomsday Predictions",
    "description": "Many so-called experts predicted that President Donald Trump’s economic agenda would usher in an inflationary Armageddon. This projection was so often repeated in the media that many Americans, especially Democrats, believed a depression was imminent. Yet the…",
    "link": "https://biztoc.com/x/01ba0f5b45fdf612",
    "timestamp": "2025-07-14T05:31:23Z"
  },
  {
    "title": "Macron Projects $75Bln Defense Budget for France by 2027",
    "description": "MOSCOW (Sputnik) - France’s military budget will rise to 64 billion euros ($74.8 billion) by 2027—double the level in 2017—French President Emmanuel Macron announced on Sunday.",
    "link": "https://sputnikglobe.com/20250714/macron-projects-75bln-defense-budget-for-france-by-2027-1122435129.html",
    "timestamp": "2025-07-14T05:31:01Z"
  },
  {
    "title": "Trump says he wants to send Patriot batteries to Ukraine. One country might be down to pay for them.",
    "description": "Trump said he wanted to send more Patriot batteries to Ukraine, but under a program where NATO would \"pay us 100%\" for weapons.",
    "link": "https://www.businessinsider.com/trump-patriot-ukraine-other-pay-germany-willing-sponsor-2025-7",
    "timestamp": "2025-07-14T05:27:22Z"
  },
  {
    "title": "Biden defends controversial autopen use for mass clemency decisions in NYT interview: ‘A whole lot of people’",
    "description": "Biden said he 'made every decision' on pardons despite autopen controversy.",
    "link": "https://nypost.com/2025/07/14/us-news/biden-defends-controversial-autopen-use-for-mass-clemency-decisions-in-nyt-interview/",
    "timestamp": "2025-07-14T05:26:09Z"
  },
  {
    "title": "Bitcoin tops US$120,000 for the first time",
    "description": "SINGAPORE: Bitcoin crossed the US$120,000 level for the first time on Monday (Jul 14), marking a major milestone for the world's largest cryptocurrency as investors bet on long-sought policy wins for the industry this week. Bitcoin scaled a record high of US$…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-hits-record-high-120000-crypto-5236671",
    "timestamp": "2025-07-14T05:22:00Z"
  },
  {
    "title": "German Export Sector Faces US Tariff Pressure — Merz",
    "description": "MOSCOW (Sputnik) - If the United States imposes 30% tariffs, they will strike at the most vulnerable part of Germany’s export sector, German Chancellor Friedrich Merz said on Sunday.",
    "link": "https://sputnikglobe.com/20250714/german-export-sector-faces-us-tariff-pressure--merz-1122434980.html",
    "timestamp": "2025-07-14T05:20:40Z"
  },
  {
    "title": "Sesame Street’s Elmo X account overrun with offensive messages, hacker claims West Australian connection",
    "description": "The official X account for childhood hero Elmo was hacked early Monday morning, with a post by the hacker indicating a Perth local may be connected.",
    "link": "https://www.perthnow.com.au/wa/sesame-streets-elmo-x-account-overrun-with-offensive-messages-hacker-claims-west-australian-connection-c-19350964",
    "timestamp": "2025-07-14T05:17:43Z"
  },
  {
    "title": "EU official says bloc to explore Asia pacts as US tariffs loom",
    "description": "The EU is preparing to step up its engagement with other countries hit by US President Donald Trump’s tariffs following a slew of new threats to the bloc and other US trading partners",
    "link": "https://www.bloomberg.com/news/articles/2025-07-14/eu-official-says-bloc-to-explore-asia-pacts-as-us-tariffs-loom",
    "timestamp": "2025-07-14T05:16:40Z"
  },
  {
    "title": "A military exercise drawing together 19 nations and 35,000 forces begins in Australia",
    "description": "The largest-ever war fighting drills in Australia is underway and expected to attract China's attention. Talisman Sabre began in 2005 as a joint exercise between the U.S. and Australia.",
    "link": "https://www.npr.org/2025/07/14/g-s1-77431/military-exercise-19-nations-australia",
    "timestamp": "2025-07-14T05:15:24Z"
  },
  {
    "title": "Mark O'Connell: Tony Blair’s staff knew about barbarous ‘Gaza riviera’ plan. That’s a fact too gross for satire",
    "description": "Blair’s staff participated in calls about plans to build a Dubai-style dynamic trading and tourism hub out of the ruins of Gaza",
    "link": "https://www.irishtimes.com/opinion/2025/07/14/mark-oconnell-tony-blairs-staff-knew-about-barbarous-gaza-riviera-plan-thats-a-fact-too-gross-for-satire/",
    "timestamp": "2025-07-14T05:15:00Z"
  },
  {
    "title": "GOP Lawmakers Press Trump to Speed Review of Chinese-Made Drones",
    "description": "Key House lawmakers are pressing the Trump administration to accelerate a congressionally mandated review of Chinese-made drones ahead of a potential US ban of the technologies later this year. Three House Republicans influential on national security matters …",
    "link": "https://www.insurancejournal.com/news/national/2025/07/14/831393.htm",
    "timestamp": "2025-07-14T05:12:56Z"
  },
  {
    "title": "Trump Set to Unveil New Arms Package for Ukraine",
    "description": "MOSCOW (Sputnik) - US President Donald Trump is set to unveil a new arms delivery plan for Kiev on Monday, which may include offensive weaponry, according to sources familiar with the matter.",
    "link": "https://sputnikglobe.com/20250714/trump-set-to-unveil-new-arms-package-for-ukraine-on-monday-1122434635.html",
    "timestamp": "2025-07-14T05:10:32Z"
  },
  {
    "title": "Summer Reading to Spark Civic Action",
    "description": "A Genocide Foretold: Reporting on Survival and Resistance in Occupied Palestine by Chris Hedges (Seven Stories, 2025). With brilliant narratives, both historical and contemporary—Pulitzer Prize winner Chris Hedges provides the framework that explains how the …",
    "link": "https://www.counterpunch.org/2025/07/14/summer-reading-to-spark-civic-action/",
    "timestamp": "2025-07-14T05:10:16Z"
  },
  {
    "title": "Trump marks anniversary of assassination attempt at the FIFA Club World Cup final",
    "description": "The president joined the players on the field after the match to present PSG players with their runner-up medals and hand Chelsea their championship trophy.",
    "link": "https://www.npr.org/2025/07/14/nx-s1-5467059/club-world-cup-chelsea-psg-trump-assassination-attempt",
    "timestamp": "2025-07-14T05:09:26Z"
  },
  {
    "title": "Exclusive: Iranian Opposition Leader — ‘Regime Change Within Reach,’ Collapse ‘Closer Than Ever’",
    "description": "Iranian opposition leader Maryam Rajavi declared that regime change in the Islamic Republic is “realistic,” “within reach,” and “long overdue,\" laying out her exiled movement's strategy to topple the clerical regime and usher in a democratic future.\nThe post …",
    "link": "https://www.breitbart.com/middle-east/2025/07/13/exclusive-iranian-opposition-leader-regime-change-within-reach-collapse-near/",
    "timestamp": "2025-07-14T05:08:43Z"
  },
  {
    "title": "France walks a budget tightrope as Bayrou prepares 2026 austerity plan",
    "description": "France's Prime Minister will try to reduce the deficit from 5.4% of GDP this year to 4.6% next year. But without significant tax hikes, the move will necessarily entail a reduction in public spending.",
    "link": "https://www.euractiv.com/section/politics/news/france-walks-a-budget-tightrope-as-bayrou-prepares-2026-austerity-plan/",
    "timestamp": "2025-07-14T05:08:40Z"
  },
  {
    "title": "German minister to press Hegseth on arms supplies, missile deployment",
    "description": "BERLIN (Reuters) -German Defence Minister Boris Pistorius heads to Washington on Monday to meet U.S. Secretary of Defense Pete Hegseth, to seek clarity on American arms supplies to Ukraine, missile deployment plans and the future of U.S. troop levels in Europ…",
    "link": "https://www.thestar.com.my/news/world/2025/07/14/german-minister-to-press-hegseth-on-arms-supplies-missile-deployment",
    "timestamp": "2025-07-14T05:08:00Z"
  },
  {
    "title": "'Disturbing' failures let would-be Trump shooter evade Secret Service",
    "description": "Communication breakdowns, obscured sniper views and inexperienced Secret Service agents are blamed as a Homeland Security committee hands down its final report on the attempted assassination of Donald Trump one year ago.",
    "link": "https://www.abc.net.au/news/2025-07-14/trump-butler-attack-final-report-first-anniversary/105528676",
    "timestamp": "2025-07-14T05:07:09Z"
  },
  {
    "title": "Sell gold, buy silver? Why poor man's gold is quietly becoming the real treasure",
    "description": "Investors are increasingly favoring silver over gold, driven by factors like a stretched gold-to-silver ratio and anticipated price convergence. Silver ETFs have significantly outperformed gold ETFs recently, fueled by safe-haven demand and a persistent globa…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/sell-gold-buy-silver-why-poor-mans-gold-is-quietly-becoming-the-real-treasure/articleshow/122429385.cms",
    "timestamp": "2025-07-14T05:06:06Z"
  },
  {
    "title": "Military exercise drawing together 19 nations and 35,000 forces begins in Australia",
    "description": "The largest-ever war fighting drills in Australia, Exercise Talisman Sabre, is underway and expected to attract the attention of Chinese spy ships. Talisman Sabre began in 2005 as a biennial joint exercise between the United States and Australia. This year, m…",
    "link": "https://japantoday.com/category/world/largest-ever-warfighting-drills-in-australia-exercise-talisman-sabre-is-underway",
    "timestamp": "2025-07-14T05:04:29Z"
  },
  {
    "title": "Cabinet to hear of efforts to convince US diplomats not to end Lebanon peace force support",
    "description": "The Irish Defence Forces currently has approximately 340 personnel deployed to posts across South Lebanon.",
    "link": "https://www.thejournal.ie/cabinet-to-hear-of-efforts-to-convince-us-diplomats-not-to-end-lebanon-peace-force-support-unifil-irish-defence-forces-6761881-Jul2025/",
    "timestamp": "2025-07-14T05:00:40Z"
  },
  {
    "title": "Irish government urges against EU escalating tariff row with US",
    "description": "Fresh Trump threats of 30 per cent tariffs a ‘negotiating tactic’, Simon Harris says",
    "link": "https://www.irishtimes.com/world/europe/2025/07/14/government-to-urge-against-eu-tariff-row-escalation/",
    "timestamp": "2025-07-14T05:00:01Z"
  },
  {
    "title": "Trump’s 30% EU tariff threat is a ‘negotiating position’, says Simon Harris",
    "description": "Tánaiste says US president ‘recognises need for a deal’ and deadline for trade agreement between EU and US remains August 1st",
    "link": "https://www.irishtimes.com/politics/2025/07/14/trumps-30-eu-tariff-threat-is-a-negotiating-position-says-simon-harris/",
    "timestamp": "2025-07-14T05:00:01Z"
  },
  {
    "title": "Trump tariffs could cause further threat to Irish pubs, with warning of 1,000 further closures in next decade",
    "description": "Around 1,000 pubs could close over the coming decade, with fears Donald Trump’s trade tariffs could worsen the landscape, a new report has warned.",
    "link": "https://www.independent.ie/irish-news/trump-tariffs-could-cause-further-threat-to-irish-pubs-with-warning-of-1000-further-closures-in-next-decade/a895733653.html",
    "timestamp": "2025-07-14T05:00:00Z"
  },
  {
    "title": "Bitcoin achieves $120k milestone on Trump policy support",
    "description": "Bitcoin has surged past the $120,000 (£89,000) level for the first time, with its new record value being attributed to progress in cryptocurrency regulation under Donald Trump.",
    "link": "https://news.sky.com/story/bitcoin-achieves-120k-milestone-on-trump-policy-support-13396339",
    "timestamp": "2025-07-14T04:58:00Z"
  },
  {
    "title": "Elmo’s X account goes rogue as antisemitic hacker slams Epstein files, calls for people to ‘kill all Jews’",
    "description": "The profane slew of posts shared Sunday evening featured the Sesame Street star's account going on a bizarre series of rants.",
    "link": "https://nypost.com/2025/07/14/us-news/elmos-x-account-goes-rogue-as-hacker-slams-epstein-files-calls-for-people-to-kill-all-jews/",
    "timestamp": "2025-07-14T04:55:54Z"
  },
  {
    "title": "Nvidia CEO downplays U.S. fears that China's military will use his firm's chips",
    "description": "\"They don't need Nvidia's chips ... to build their military,\" Jensen Huang said in a CNN interview aired Sunday, days ahead of another trip to China.",
    "link": "https://www.cnbc.com/2025/07/14/nvidias-jensen-huang-downplays-us-china-concerns-ahead-of-trip.html",
    "timestamp": "2025-07-14T04:54:21Z"
  },
  {
    "title": "Trump confirms plans to send Patriot missiles to Ukraine",
    "description": "US President Donald Trump has promised to supply Ukraine with more anti-air Patriot missiles Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621436-trump-ukraine-patriot-missiles/",
    "timestamp": "2025-07-14T04:54:15Z"
  },
  {
    "title": "Thailand Mulls Zero Duty for More US Goods to Win Tariff Deal",
    "description": "Thailand is weighing allowing zero-duty market access for more US goods to help persuade the Trump administration to lower a threatened 36% tariff on its exports.",
    "link": "https://financialpost.com/pmn/business-pmn/thailand-mulls-zero-duty-for-more-us-goods-to-win-tariff-deal",
    "timestamp": "2025-07-14T04:54:02Z"
  },
  {
    "title": "Chelsea wins Club World Cup 2025: Why football fans are accusing Donald Trump of doing a 'John Terry'",
    "description": "In a bizarre turn of events, Donald Trump joined Chelsea FC's Club World Cup celebration in 2025, drawing comparisons to John Terry's infamous Champions League appearance. Trump's presence at the match, framed as a test run for the 2026 World Cup, sparked mix…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/chelsea-wins-club-world-cup-2025-why-football-fans-are-accusing-donald-trump-of-doing-a-john-terry/articleshow/122428538.cms",
    "timestamp": "2025-07-14T04:54:00Z"
  },
  {
    "title": "South Korea says framework US trade deal possible by August, farm market access on table",
    "description": "SEOUL: South Korea's top trade envoy said on Monday (Jul 14) it may be possible to strike an \"in-principle\" trade deal with the United States by an Aug 1 deadline and signalled Seoul may be open to allowing greater access to its agricultural markets, local me…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-us-tariffs-trade-deal-farm-exports-5236761",
    "timestamp": "2025-07-14T04:51:25Z"
  },
  {
    "title": "India's exports still have room to grow even if Trump walks the talk for 10% additional tariff",
    "description": "Despite potential trade deal uncertainties with the US and looming tariffs, an SBI Research report suggests India can significantly boost exports by capitalising on global tariff realignments. India is well-positioned to increase its market share in sectors l…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indias-exports-still-have-room-to-grow-even-if-trump-walks-the-talk-for-10-additional-tariff/articleshow/122428545.cms",
    "timestamp": "2025-07-14T04:48:30Z"
  },
  {
    "title": "Harvard replaces diversity offices in ‘DEI purge’ after funding stripped",
    "description": "Harvard University has reportedly replaced its diversity offices in what has been described as a ‘DEI purge’ after its federal funding was frozen by President Donald Trump. According to Harvard’s student newspaper, The Harvard Crimson, a “DEI purge” took plac…",
    "link": "https://www.thepinknews.com/2025/07/14/harvard-replaces-diversity-offices-after-funding-stripped/",
    "timestamp": "2025-07-14T04:48:04Z"
  },
  {
    "title": "A military exercise drawing together 19 nations and 35,000 forces begins in Australia",
    "description": "The largest-ever war fighting drills in Australia, Exercise Talisman Sabre, is underway and expected to attract the attention of Chinese spy ships",
    "link": "https://abcnews.go.com/US/wireStory/military-exercise-drawing-19-nations-35000-forces-begins-123727832",
    "timestamp": "2025-07-14T04:46:57Z"
  },
  {
    "title": "European markets on Mon July 14: EU tariff reaction, Stoxx 600, FTSE",
    "description": "European markets on Mon July 14: EU tariff reaction, Stoxx 600, FTSEcnbc.com",
    "link": "https://www.cnbc.com/2025/07/14/european-markets-on-mon-july-14-eu-tariff-reaction-stoxx-600-ftse-.html",
    "timestamp": "2025-07-14T04:44:56Z"
  },
  {
    "title": "Crude oil futures rise as markets await Trump’s announcement on Russia",
    "description": "September Brent oil futures were at $70.51, up by 0.21%, and August crude oil futures on WTI (West Texas Intermediate) were at $68.60, up by 0.22%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-markets-await-trumps-announcement-on-russia/article69809557.ece",
    "timestamp": "2025-07-14T04:43:54Z"
  },
  {
    "title": "Donald Trump says US will send Patriot missiles to Ukraine",
    "description": "The announcement comes amid a diplomatic flurry set for later on Monday, with the US special envoy starting his latest trip to Ukraine and the president due to meet with NATO Secretary General Mark Rutte.",
    "link": "https://www.abc.net.au/news/2025-07-14/donald-trump-says-us-will-send-patriot-missiles-to-ukraine/105529146",
    "timestamp": "2025-07-14T04:32:02Z"
  },
  {
    "title": "China's exports jump 5.8% in June as tariffs reprieve prompts a rush of orders",
    "description": "China’s exports accelerated in June as a reprieve on U.S. tariffs prompted a rush of orders by companies and consumers.  Exports climbed 5.8% from a year...",
    "link": "https://finance.yahoo.com/news/chinas-exports-jump-5-8-043045970.html",
    "timestamp": "2025-07-14T04:30:45Z"
  },
  {
    "title": "Letters: Changes to apartment standards will just drag us back to our tenement past",
    "description": "The recent decision by Fianna Fáil and Fine Gael to introduce new design standards aimed at reducing the size of apartments represents a troubling development.",
    "link": "https://www.independent.ie/opinion/letters/letters-changes-to-apartment-standards-will-just-drag-us-back-to-our-tenement-past/a251869565.html",
    "timestamp": "2025-07-14T04:30:00Z"
  },
  {
    "title": "Report finds ‘cascade of security failures’ by Secret Service during Donald Trump assassination bid",
    "description": "The US Secret Service failed to prevent the assassination attempt against Donald Trump last year at his Pennsylvania campaign rally, according to a Senate committee report, which accuses the agency of a botched operation marked by a series of blunders.",
    "link": "https://www.independent.ie/world-news/north-america/report-finds-cascade-of-security-failures-by-secret-service-during-donald-trump-assassination-bid/a1739092886.html",
    "timestamp": "2025-07-14T04:30:00Z"
  },
  {
    "title": "Larry Tye: MAGA backlash against ‘woke’ Superman is nothing new",
    "description": "In the new Superman movie, our extraterrestrial hero confronts perhaps the most formidable foe of his lifetime: US president Donald Trump.",
    "link": "https://www.independent.ie/opinion/comment/larry-tye-maga-backlash-against-woke-superman-is-nothing-new/a772072161.html",
    "timestamp": "2025-07-14T04:30:00Z"
  },
  {
    "title": "China’s Steel Exports Defy Protectionist Wave to Hit Record",
    "description": "China racked up record steel exports in the second quarter, as flows from the world’s top producer defied expectations for volumes to fade under a barrage of trade measures from Asia to Europe.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-steel-exports-defy-protectionist-wave-to-hit-record",
    "timestamp": "2025-07-14T04:28:36Z"
  },
  {
    "title": "Rupee declines 17 paise to 85.97 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the local unit opened 85.96 against the US dollar before slipping to 85.97, down 17 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-declines-17-paise-to-8597-against-us-dollar-in-early-trade/article69809519.ece",
    "timestamp": "2025-07-14T04:23:15Z"
  },
  {
    "title": "Rupee declines 17 paise to 85.97 against US dollar in early trade",
    "description": "The rupee weakened to 85.97 against the US dollar due to a stronger greenback and continuous foreign fund outflows. Uncertainties surrounding potential US trade tariffs added pressure. Forex reserves declined, and domestic equity markets also experienced a do…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-declines-17-paise-to-85-97-against-us-dollar-in-early-trade/articleshow/122428508.cms",
    "timestamp": "2025-07-14T04:20:25Z"
  },
  {
    "title": "Trump Wins Member-Member Championship at Bedminster",
    "description": "President Donald Trump won the member-member championship at his Bedminster golf course this weekend, which he hailed as a \"great honor.\"\nThe post Trump Wins Member-Member Championship at Bedminster appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/07/13/trump-wins-member-member-championship-bedminster/",
    "timestamp": "2025-07-14T04:16:19Z"
  },
  {
    "title": "Trump's Brazen New Golf Boast Goes Up In Flames On Social Media",
    "description": "The president said he won yet another championship, but his critics aren't buying it.",
    "link": "https://www.huffpost.com/entry/trump-golf-claim_n_68746d46e4b00af0c5f21e7f",
    "timestamp": "2025-07-14T04:14:50Z"
  },
  {
    "title": "Europe’s ‘Washington Syndrome’ just got a lot worse",
    "description": "Europe’s leaders have done everything but genuflect in front of the White House of late to placate US President Donald Trump and avert a looming trade war. It hasn't worked. Trump’s latest threat to slap 30% tariffs on EU goods, now slated...",
    "link": "https://biztoc.com/x/8acc6812fe9453db",
    "timestamp": "2025-07-14T04:13:37Z"
  },
  {
    "title": "EU delays retaliatory tariffs against US amid hopes for trade deal",
    "description": "Ursula von der Leyen says bloc hopes to see negotiated solution to trade tensions.",
    "link": "https://www.aljazeera.com/economy/2025/7/14/eu-delays-retaliatory-tariffs-against-us-amid-hopes-for-trade-deal",
    "timestamp": "2025-07-14T04:13:16Z"
  },
  {
    "title": "Why has Trump threatened to revoke US-born Rosie O'Donnell's citizenship?",
    "description": "The actor, talk show host and comedian has publicly criticised US president on social media in the past week, but it's not the first time she's been vocal against him.",
    "link": "https://www.abc.net.au/news/2025-07-14/rosie-odonnell-donald-trump-fued-us-citizenship-threat/105527962",
    "timestamp": "2025-07-14T04:11:15Z"
  },
  {
    "title": "Bitcoin Suddenly Smashes Through $120,000 Price As Crypto Braces For A ‘Massive’ Earthquake",
    "description": "The bitcoin price and crypto market is heading into what could be one of its biggest weeks ever...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/14/bitcoin-suddenly-smashes-through-120000-price-as-crypto-braces-for-a-massive-earthquake/",
    "timestamp": "2025-07-14T04:10:45Z"
  },
  {
    "title": "Bitcoin hits record high above $120K; US June inflation data awaited",
    "description": "Bitcoin (BTC) surged past $120,000 for the first time, hitting a new all-time high and up 28% year-to-date. The rally follows a 48-hour choppy period that reset short-term overbought indicators. Market focus now shifts to US June inflation data (CPI), expecte…",
    "link": "https://coinjournal.net/news/bitcoin-hits-record-high-above-120k-us-june-inflation-data-awaited/",
    "timestamp": "2025-07-14T04:04:58Z"
  },
  {
    "title": "Trump Brings back Torture, Big Time",
    "description": "( Tomdispatch.com ) - I didn’t want to write this article. In fact, I had something relatively uplifting planned: an Independence Day piece about the rich implications for the present moment to be found in the Declaration of Independence. But other excellent …",
    "link": "https://www.juancole.com/2025/07/trump-brings-torture.html",
    "timestamp": "2025-07-14T04:04:22Z"
  },
  {
    "title": "What Trump’s Ukraine Aid Pause Says About America’s Broken Foreign Policy",
    "description": "There aren’t infinite assets.\nThe post What Trump’s Ukraine Aid Pause Says About America’s Broken Foreign Policy appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/what-trumps-ukraine-aid-pause-says-about-americas-broken-foreign-policy/",
    "timestamp": "2025-07-14T04:03:00Z"
  },
  {
    "title": "If Trump Is Neither Hawk nor Dove, What Is He?",
    "description": "The president’s recent moves don’t fit the usual binary of U.S. foreign policy—but there is a historical precedent.",
    "link": "http://foreignpolicy.com/2025/07/14/trump-andrew-jackson-jacksonianism-hawk-dove/",
    "timestamp": "2025-07-14T04:01:16Z"
  },
  {
    "title": "Oleksandr Usyk Readies for Daniel Dubois Fight With Aid From Ukrainian Designer",
    "description": "Elvira Gasanova, whose clothes have been worn by Ukraine's president Volodymyr Zelensky, has been working with the heavyweight boxer for four years.",
    "link": "http://wwd.com/business-news/business-features/oleksandr-usyk-daniel-dubois-zelensky-1237978683/",
    "timestamp": "2025-07-14T04:01:00Z"
  },
  {
    "title": "Both Liberals and Conservatives Lie, Hide the Truth.",
    "description": "They both blame ‘the other side’, when, actually, EACH of the ‘two sides’ (which together constitute the entire public) is being controlled by the mere thousand-or-so super-wealthy few individuals who — because of their control over the ‘news’-media, politici…",
    "link": "https://www.lewrockwell.com/2025/07/no_author/both-liberals-and-conservatives-lie-hide-the-truth/",
    "timestamp": "2025-07-14T04:01:00Z"
  },
  {
    "title": "GOP infighting over Trump’s DOGE cuts to take center stage as deadline looms | CNN Politics",
    "description": "Congressional Republicans are launching into their next big legislative fight – this time over DOGE spending cuts for foreign aid and public broadcasting – that risks the wrath of President Donald Trump if they fail.",
    "link": "https://www.cnn.com/2025/07/14/politics/trump-doge-cuts-rescissions-congress-deadline",
    "timestamp": "2025-07-14T04:00:24Z"
  },
  {
    "title": "Europe’s ‘Washington Syndrome’ just got a lot worse",
    "description": "Europe’s leaders have done everything but genuflect in front of the White House of late to placate US President Donald Trump and avert a looming trade war. It hasn't worked.  Trump’s latest threat to slap 30% tariffs on EU goods, now slated...",
    "link": "https://www.euractiv.com/section/politics/news/europes-washington-syndrome-just-got-a-lot-worse/",
    "timestamp": "2025-07-14T04:00:19Z"
  },
  {
    "title": "Europe’s ‘Washington Syndrome’ just got a lot worse",
    "description": "Europe’s leaders have done everything but genuflect in front of the White House of late to placate US President Donald Trump and avert a looming trade war.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/europes-washington-syndrome-just-got-a-lot-worse/",
    "timestamp": "2025-07-14T04:00:19Z"
  },
  {
    "title": "MAGA Faces Diversions from Existential Matters",
    "description": "Certain MAGA supporters exhibit cluelessness regarding foreign policy, as illustrated by Marjorie Taylor Greene.  She’s hardly alone.  MTG speaks for those unable to grasp three elementary foreign policy concepts, a) allies, b) deterr...",
    "link": "https://www.americanthinker.com/articles/2025/07/maga_faces_diversions_from_existential_matters.html",
    "timestamp": "2025-07-14T04:00:00Z"
  },
  {
    "title": "Ireland can lead Europe in the next generation of inclusive capitalism",
    "description": "A universal €1,000 investment account for every newborn, funded by government, would erode rising social and economic inequality",
    "link": "https://www.irishtimes.com/business/2025/07/14/ireland-can-lead-europe-in-the-next-generation-of-inclusive-capitalism/",
    "timestamp": "2025-07-14T04:00:00Z"
  },
  {
    "title": "US Economy in a 'Goldilocks-Like Equilibrium' as Bitcoin Blasts Past $121K",
    "description": "Bitcoin’s record-breaking rally is being fueled by tariff-driven trade flows, high Treasury payouts, and a broader shift toward risk assets.",
    "link": "https://decrypt.co/329969/us-economy-goldilocks-equilibrium-bitcoin-blasts-past-121k",
    "timestamp": "2025-07-14T03:58:26Z"
  },
  {
    "title": "Sensex falls over 200 pts, Nifty below 25,100 on weakness in IT and financial stocks",
    "description": "Indian stock markets began the week on a negative note, with both Sensex and Nifty indices opening lower. The decline was primarily driven by losses in financial and IT sectors. Investor caution prevailed due to ongoing global trade uncertainties and weak qua…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-25100-on-weakness-in-it-and-financial-stocks/articleshow/122428175.cms",
    "timestamp": "2025-07-14T03:57:06Z"
  },
  {
    "title": "King Charles to host Trump for historic second state visit",
    "description": "King Charles will host US President Donald Trump for an unprecedented second state visit to Britain, September 17-19, at Windsor Castle.",
    "link": "https://www.israelnationalnews.com/news/411616",
    "timestamp": "2025-07-14T03:56:14Z"
  },
  {
    "title": "‘Donald Trump’s tariffs real unless deals improve’",
    "description": "White House economic advisor Kevin Hassett stated that President Trump believes current trade deal offers are insufficient and is prepared to implement threatened tariffs on Mexico, the EU, and other nations if improved agreements are not reached. Hassett ind…",
    "link": "https://timesofindia.indiatimes.com/world/us/donald-trumps-tariffs-real-unless-deals-improve/articleshow/122428083.cms",
    "timestamp": "2025-07-14T03:51:25Z"
  },
  {
    "title": "Search ends for those missing after Yemen's Houthi rebels sink ship in Red Sea",
    "description": "The search for those missing after Yemen’s Houthi rebels sank a ship in the Red Sea has ended as at least four people are presumed dead and 11 others remain unaccounted for",
    "link": "https://abcnews.go.com/Business/wireStory/search-ends-missing-after-yemens-houthi-rebels-sink-123727739",
    "timestamp": "2025-07-14T03:50:25Z"
  },
  {
    "title": "Trump says US will send Patriot missiles to Ukraine",
    "description": "US President Donald Trump said he will send Patriot air defence missiles to Ukraine, saying they are necessary to defend the country.",
    "link": "https://www.rte.ie/news/us/2025/0714/1523343-trump-ukraine/",
    "timestamp": "2025-07-14T03:48:28Z"
  },
  {
    "title": "King Charles schedules Trump state visit for when UK parliament is in recess",
    "description": "King Charles has invited Donald Trump for an unprecedented second state visit in September, scheduling the trip for three days when parliament is not sitting and removing the possibility of the US president addressing parliament. Buckingham Palace announced o…",
    "link": "https://freerepublic.com/focus/f-news/4328559/posts",
    "timestamp": "2025-07-14T03:34:02Z"
  },
  {
    "title": "India should avoid hasty trade deal under US pressure, as it may not survive next US political shift: GTRI",
    "description": "These demands are part of what GTRI described as MASALA deals, Mutually Agreed Settlements Achieved through Leveraged Arm-twisting",
    "link": "https://www.thehindubusinessline.com/economy/india-should-avoid-hasty-trade-deal-under-us-pressure-as-it-may-not-survive-next-us-political-shift-gtri/article69809433.ece",
    "timestamp": "2025-07-14T03:26:43Z"
  },
  {
    "title": "China's exports, imports pick up as Trump tariff deadline looms",
    "description": "BEIJING (Reuters) -China's exports regained some momentum in June while imports rebounded, as exporters rushed out shipments to capitalise on a fragile...",
    "link": "https://finance.yahoo.com/news/chinas-exports-imports-pick-trump-032622514.html",
    "timestamp": "2025-07-14T03:26:22Z"
  },
  {
    "title": "Under Attack by Trump’s Tariffs, Asian Countries Seek Out Better Friends",
    "description": "...South Korea’s new president, Lee Jae Myung, sent special envoys to Australia and Germany to discuss defense and trade issues, and plans on dispatching delegations to several others. Brazil and India announced plans to increase their bilateral trade by 70 p…",
    "link": "https://freerepublic.com/focus/f-news/4328558/posts",
    "timestamp": "2025-07-14T03:24:40Z"
  },
  {
    "title": "Trump says FBI's Dan Bongino is 'in good shape' amid Jeffrey Epstein probe fallout",
    "description": "The former Secret Service agent and conservative media personality is said to be weighing his resignation from the FBI.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/13/donald-trump-dan-bongino-fbi-jeffrey-epstein-files/85164367007/",
    "timestamp": "2025-07-14T03:19:55Z"
  },
  {
    "title": "‘I Made Every Single’ Decision: Biden Fires Back at Trump Over Clemency Autopen Use",
    "description": "Former President Joe Biden defended his staff's clemency autopen use and fired back at Trump and his allies, calling them 'liars' in a new interview.",
    "link": "http://www.rollingstone.com/politics/politics-news/biden-defends-clemency-autopen-use-slams-trump-1235384667/",
    "timestamp": "2025-07-14T03:17:56Z"
  },
  {
    "title": "France and Israel Effectively Confirm that Trump’s “Midnight Hammer” Attack on Iran Was a Failure",
    "description": "The topic of the American attack on Iranian nuclear facilities (aka Operation \"Midnight Hammer\") has become rather \"touchy\", as the Trump administration doesn't take criticism very well.\nThe post France and Israel Effectively Confirm that Trump’s “Midnight Ha…",
    "link": "https://www.globalresearch.ca/france-israel-confirm-trump-attack-iran-failed/5894904",
    "timestamp": "2025-07-14T03:11:32Z"
  },
  {
    "title": "China's exports beat expectations in June, while imports rebound for the first time this year",
    "description": null,
    "link": "https://www.cnbc.com/2025/07/14/china-exports-imports-trade-data-june.html",
    "timestamp": "2025-07-14T03:09:43Z"
  },
  {
    "title": "Rupee set to decline at open, Trump keeps tariff headlines rolling",
    "description": "MUMBAI (Reuters) -The Indian rupee is likely to open weaker on Monday after fresh tariff threats from U.S. President Donald Trump intensified concerns over...",
    "link": "https://sg.finance.yahoo.com/news/rupee-set-decline-open-trump-030905415.html",
    "timestamp": "2025-07-14T03:09:05Z"
  },
  {
    "title": "07/13/25",
    "description": "Hi there,",
    "link": "https://www.advocate.com/newsletter/07-13-25",
    "timestamp": "2025-07-14T03:04:21Z"
  },
  {
    "title": "EU Official Says Bloc to Explore Asia Pacts as US Tariffs Loom",
    "description": "(Bloomberg) -- The European Union is looking to deepen trade agreements with India and other countries in the Asia-Pacific region as the bloc braces for US...",
    "link": "https://finance.yahoo.com/news/eu-official-says-bloc-explore-030209566.html",
    "timestamp": "2025-07-14T03:02:09Z"
  },
  {
    "title": "Boos and cheers greet US President Trump at Club World Cup final",
    "description": "Donald Trump's appearance at the FIFA Club World Cup final in New Jersey drew a mixed reaction, with both cheers and boos echoing through MetLife Stadium. Despite the divided response, Trump joined Chelsea's celebrations, presenting the trophy and medals. He …",
    "link": "https://economictimes.indiatimes.com/news/international/us/boos-and-cheers-greet-us-president-trump-at-club-world-cup-final/articleshow/122427384.cms",
    "timestamp": "2025-07-14T02:57:51Z"
  },
  {
    "title": "A Month After the Minnesota Shootings, We’re Normalizing Political Violence",
    "description": "It’s been a month since the assassinations, yet hardly anyone seems to remember they occurred.\nThe post A Month After the Minnesota Shootings, We’re Normalizing Political Violence appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/13/normalizing-political-violence/",
    "timestamp": "2025-07-14T02:57:29Z"
  }
]