[
  {
    "title": "Pentagon Issues New Sweeping Order Amid Trump Admin Crackdown on DEI",
    "description": "Pete Hegseth ordered military leaders to review and pull all library books related to diversity, anti-racism and gender issues.",
    "link": "https://www.newsweek.com/hegseth-pentagon-dei-books-us-military-libraries-2070469",
    "timestamp": "2025-05-09T22:16:43Z"
  },
  {
    "title": "House Committee Leader to Investigate Agency for Preferential Treatment of Politically Connected Startup",
    "description": "by Christopher Bing and Avi Asher-Schapiro \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nThe ranking member of the House Oversight Committee …",
    "link": "https://www.propublica.org/article/investigation-ramp-gsa-smartpay-trump-peter-thiel-gerald-connolly",
    "timestamp": "2025-05-09T22:15:00Z"
  },
  {
    "title": "Report: Utah exports topped $18B last year, supported 70K jobs",
    "description": "While a new Kem C. Gardner Policy Institute report export shows revenues were down marginally last year, international trade remains an economic driver in...",
    "link": "https://www.deseret.com/business/2025/05/09/donald-trump-trade-tariffs-utah-import-revenues-gdp-growth-international-trade/",
    "timestamp": "2025-05-09T22:13:16Z"
  },
  {
    "title": "“She Was Tearful About It”: The Nuances of Casey Means’s Medical Exit and Antiestablishment Origins",
    "description": "Donald Trump’s new nominee to be the next surgeon general has said she walked away from a promising career in the medical establishment. Some fellow residents and a former department chairman say the situation was more complicated.",
    "link": "https://www.vanityfair.com/news/story/the-nuances-of-casey-means-medical-exit",
    "timestamp": "2025-05-09T22:12:03Z"
  },
  {
    "title": "Gavin Newsom Is Normalizing Trump’s Constitutional Violations",
    "description": "Gavin Newsom’s rightward shift represents not just a strategic miscalculation but a profound moral abdication based on a fundamental misunderstanding of both democratic principles and political reality. Newsom appears to have convinced himself that the path t…",
    "link": "https://www.techdirt.com/2025/05/09/gavin-newsom-is-normalizing-trumps-constitutional-violations/",
    "timestamp": "2025-05-09T22:10:16Z"
  },
  {
    "title": "Nancy Pelosi wants newly elected American Pope Leo to speak out against mass deportations",
    "description": "Former Speaker of the House Nancy Pelosi, D-Calif., said Friday that she hopes the newly elected Pope Leo XIV will be vocal about opposing mass deportation.",
    "link": "https://www.foxnews.com/media/nancy-pelosi-wants-newly-elected-american-pope-leo-speak-out-against-mass-deportations",
    "timestamp": "2025-05-09T22:08:23Z"
  },
  {
    "title": "Trump Media seeking M&A activity in diversification bid",
    "description": "The company continues to \"hunt for top quality assets,\" CEO Devin Nunes said in a letter to shareholders.  Trump Media, which runs the Truth Social streaming...",
    "link": "https://finance.yahoo.com/news/trump-media-seeking-m-activity-220757757.html",
    "timestamp": "2025-05-09T22:07:57Z"
  },
  {
    "title": "Trump Media seeking M&A activity in diversification bid",
    "description": "Trump Media & Technology Group is planning to pursue potential mergers and acquisitions, U.S. President Donald Trump's social media firm said on Friday, as it looks to diversify into sectors such as financial services. The company continues to \"hunt for top q…",
    "link": "https://www.channelnewsasia.com/business/trump-media-seeking-ma-activity-diversification-bid-5120911",
    "timestamp": "2025-05-09T22:07:57Z"
  },
  {
    "title": "New U.S. Trade Agreements Could Grow The Economy",
    "description": "An initial U.S.-UK trade pact could be a harbinger of additional \"win-win\" American trade deals with the UK and other countries.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/05/09/new-us-trade-agreements-could-grow-the-economy/",
    "timestamp": "2025-05-09T22:07:25Z"
  },
  {
    "title": "Congress needs to address debt ceiling before its August recess to prevent default, Treasury secretary says | CNN Politics",
    "description": "Lawmakers have until August to address the debt ceiling or the US could default on its obligations for the first time ever, Treasury Secretary Scott Bessent wrote to congressional leaders Friday, urging them to act even sooner, “to protect the full faith and …",
    "link": "https://www.cnn.com/2025/05/09/politics/treasury-debt-ceiling-x-date",
    "timestamp": "2025-05-09T22:06:23Z"
  },
  {
    "title": "Three U.S. Consumer Product Safety Commissioners have been fired by Trump. What to know. (Betty Lin-Fisher/USA Today)",
    "description": "Betty Lin-Fisher / USA Today:\nThree U.S. Consumer Product Safety Commissioners have been fired by Trump.  What to know.  —  President Donald Trump has fired three of five commissioners - the Democrats - appointed to the bipartisan, independent U.S. Consumer P…",
    "link": "https://www.memeorandum.com/250509/p125",
    "timestamp": "2025-05-09T22:05:01Z"
  },
  {
    "title": "Trump signs 4 bills overturning Biden appliance regulations",
    "description": "Rules applied to household water heaters, walk in freezers and commercial refrigerators",
    "link": "https://www.wnd.com/2025/05/trump-signs-4-bills-overturning-biden-appliance-regulations/",
    "timestamp": "2025-05-09T22:05:00Z"
  },
  {
    "title": "Inside the salacious scandal that derailed Jeanine Pirro's political career",
    "description": "Jeanine Pirro is the first U.S. attorney nominee known to have come under a federal probe after being caught on tape scheming to catch a cheating spouse in the act.",
    "link": "https://www.nbcnews.com/politics/justice-department/salacious-scandal-derailed-jeanine-pirros-political-career-rcna205801",
    "timestamp": "2025-05-09T22:04:04Z"
  },
  {
    "title": "'Dead Outlaw' cancels Library of Congress appearance to protest Carla Hayden's firing",
    "description": "Broadway musical 'Dead Outlaw' announced its decision to cancel a planned Library of Congress performance after President Donald Trump fired Dr. Carla Hayden, the Librarian of Congress hired by Barack Obama in 2016.",
    "link": "https://ew.com/broadway-dead-outlaw-cancels-library-of-congress-appearance-protest-dr-carla-hayden-firing-11732448",
    "timestamp": "2025-05-09T22:03:55Z"
  },
  {
    "title": "‘It’s terrific’: Chicago hails hometown hero Pope Leo XIV",
    "description": "Paula Hambrick never imagined that in her lifetime the Catholic Church would be led by a pope from the United States, never mind her hometown of Chicago. But at a mass on Friday in her Midwestern city in honor of the newly elected Pope Leo XIV, a native son o…",
    "link": "https://www.digitaljournal.com/world/its-terrific-chicago-hails-hometown-hero-pope-leo-xiv/article",
    "timestamp": "2025-05-09T22:02:20Z"
  },
  {
    "title": "Aide reveals Trump considering scrapping cornerstone of US Constitution: ‘It’s an option’",
    "description": "Donald Trump senior advisor Stephen Miller said Friday that the White House is “actively looking at” suspending the ability of migrants to challenge their detention in court, according to Bloomberg.“The Constitution is clear,” Miller said, citing the clause a…",
    "link": "https://www.rawstory.com/stephen-miller-immigration/",
    "timestamp": "2025-05-09T22:02:09Z"
  },
  {
    "title": "Trump to Tap McKernan for Domestic Finance Role at Treasury (Daniel Flatley/Bloomberg)",
    "description": "Daniel Flatley / Bloomberg:\nTrump to Tap McKernan for Domestic Finance Role at Treasury  —  President Donald Trump intends to nominate attorney Jonathan McKernan as the Treasury Department's head of domestic finance, a surprise move given he was previously ta…",
    "link": "https://www.memeorandum.com/250509/p123",
    "timestamp": "2025-05-09T22:00:38Z"
  },
  {
    "title": "'It's Terrific': Chicago Hails Hometown Hero Pope Leo XIV",
    "description": "Paula Hambrick never imagined that in her lifetime the Catholic Church would be led by a pope from the United States, never mind her hometown of Chicago.",
    "link": "https://www.ibtimes.com/its-terrific-chicago-hails-hometown-hero-pope-leo-xiv-3773111",
    "timestamp": "2025-05-09T22:00:19Z"
  },
  {
    "title": "Trump's film tariff threat should inspire us to strengthen Australian cinema",
    "description": "If the newly re-elected Albanese government is serious about Australian culture and production, then Donald Trump could be inadvertently showing the way to ensuring it.",
    "link": "https://www.abc.net.au/news/2025-05-10/donald-trump-tariffs-australian-film-industry/105263744",
    "timestamp": "2025-05-09T22:00:00Z"
  },
  {
    "title": "Donald Trump, Secret Minimalist?",
    "description": "The President, whose whole deal has long been flashy opulence, is now trying to sell a more restrained aesthetic as the economy seems to sour.",
    "link": "https://www.newyorker.com/newsletter/the-daily/donald-trump-secret-minimalist",
    "timestamp": "2025-05-09T22:00:00Z"
  },
  {
    "title": "Trump to bring white Afrikaners to US as refugees from South Africa, in wake of expropriation legislation",
    "description": "White Afrikaners from South Africa will be allowed into the U.S. under refugee status, with the Trump administration saying they're suffering from racial discrimination in the country.",
    "link": "https://www.foxnews.com/politics/trump-bring-white-afrikaners-us-refugees-south-africa-wake-expropriation-legislation",
    "timestamp": "2025-05-09T21:59:08Z"
  },
  {
    "title": "Do These Libertarians Regret Voting for Donald Trump?",
    "description": "During the 2024 presidential election, a contingent of libertarians cast strategic, often reluctant votes for Donald Trump, arguing he was the lesser of two evils. Among them: Reason's own Liz Wolfe and J.D. Tuccille, alongside comedian and Part of the Proble…",
    "link": "https://biztoc.com/x/afc8ec8c023adf5f",
    "timestamp": "2025-05-09T21:57:43Z"
  },
  {
    "title": "Europe Leaders Head To Kyiv On Unprecedented Visit",
    "description": "The leaders of France, Britain, Germany and Poland will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire.",
    "link": "https://www.ibtimes.com/europe-leaders-head-kyiv-unprecedented-visit-3773108",
    "timestamp": "2025-05-09T21:57:21Z"
  },
  {
    "title": "Trump Administration Eyes New Agreement With Greenland: What To Know",
    "description": "President Donald Trump has not ruled out using military force to take Greenland but appears to be exploring every other option available.",
    "link": "https://www.newsweek.com/trump-administration-eyes-agreement-greenland-know-2070466",
    "timestamp": "2025-05-09T21:57:21Z"
  },
  {
    "title": "New Jersey mayor arrested for protesting at migrant centre",
    "description": "Newark Mayor Ras Baraka was part of a group of Democratic officials seeking to enter the facility housing detained migrants.",
    "link": "https://www.bbc.com/news/articles/cy904elvxj3o",
    "timestamp": "2025-05-09T21:57:19Z"
  },
  {
    "title": "Europe Leaders Head To Kyiv On Unprecedented Visit",
    "description": "The leaders of France, Britain, Germany and Poland will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire.",
    "link": "https://www.ibtimes.com.au/europe-leaders-head-kyiv-unprecedented-visit-1858704",
    "timestamp": "2025-05-09T21:57:07Z"
  },
  {
    "title": "Exclusive — Steve Witkoff Ahead of Round 4 of Talks: Iran Has Agreed ‘They Don’t Want’ Nuclear Weapon",
    "description": "WASHINGTON — Senior adviser and assistant to the president Steve Witkoff told Breitbart News exclusively that the government of Iran has told him that the Iranians have agreed they do not want a nuclear weapon. Witkoff, who made the explosive revelation in an…",
    "link": "https://freerepublic.com/focus/f-news/4316033/posts",
    "timestamp": "2025-05-09T21:56:08Z"
  },
  {
    "title": "Stephen Miller Has a Dangerous New Idea About Habeas Corpus",
    "description": "The White House is “actively looking” at ending habeas corpus as it continues its massive deportation crusade, according to deputy chief of staff Stephen Miller.\r\nHabeas corpus requires authorities to justify an individual’s confinement.\r\n“Well, the Constitut…",
    "link": "https://newrepublic.com/post/195100/stephen-miller-donald-trump-habeas-corpus",
    "timestamp": "2025-05-09T21:54:46Z"
  },
  {
    "title": "Newark Mayor Ras Baraka arrested outside ICE detention center",
    "description": "Newark Mayor Ras Baraka was arrested on Friday outside an immigration detention center he's been protesting this week. He allegedly trespassed and ignored warnings to stand down.",
    "link": "https://www.bostonherald.com/2025/05/09/newark-mayor-ras-baraka-arrest-ice-trespass/",
    "timestamp": "2025-05-09T21:52:52Z"
  },
  {
    "title": "“I Don’t Know.” Trump’s Preferred Response to All Kinds of Questions",
    "description": "Three times in the last week, President Trump expressed ignorance when responding to questions about his signature policies.\nThe post “I Don’t Know.” Trump’s Preferred Response to All Kinds of Questions appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/09/i-dont-know-president-donald-trump-response-to-questions/",
    "timestamp": "2025-05-09T21:52:36Z"
  },
  {
    "title": "Europe leaders head to Kyiv on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland  will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire. The trip by French President Em…",
    "link": "https://www.digitaljournal.com/world/europe-leaders-head-to-kyiv-on-unprecedented-visit/article",
    "timestamp": "2025-05-09T21:52:20Z"
  },
  {
    "title": "China’s exports to U.S. sink, offset by trade with other economies, as Trump’s tariffs hit global trade",
    "description": "China’s exports to the United States tumbled in April while its trade with other economies surged, suggesting that President Donald Trump's tariffs offensive is hastening a shakeup in global supply chains.",
    "link": "https://www.pbs.org/newshour/economy/chinas-exports-to-u-s-sink-offset-by-trade-with-other-economies-as-trumps-tariffs-hit-global-trade",
    "timestamp": "2025-05-09T21:51:38Z"
  },
  {
    "title": "Can Donald Trump really put a tariff on films?",
    "description": "After slamming everything from clothing to avocados with tariffs, now President Donald Trump has taken aim at films. \"The Movie Industry in America is DYING a very fast death,\" Trump proclaimed on Truth Social last week, while floating a 100 percent tariff on…",
    "link": "https://www.theverge.com/politics/664396/trump-tariffs-hollywood-foreign-films-excise-tax",
    "timestamp": "2025-05-09T21:51:32Z"
  },
  {
    "title": "Carney's new cabinet will be announced Tuesday",
    "description": "Prime Minister Mark Carney is set to unveil his new cabinet at Rideau Hall on Tuesday — and it's expected to be a slimmed-down front bench meant to signal a more business-minded approach to government. Rideau Hall confirmed the timing of the swearing-in cerem…",
    "link": "https://www.nationalobserver.com/2025/05/09/news/carney-cabinet-federal-government",
    "timestamp": "2025-05-09T21:50:58Z"
  },
  {
    "title": "'No idea what her job was': Karoline Leavitt hammered for remarks on fired 'American hero'",
    "description": "Responding to a reporter's question about President Donald Trump\r\n firing Librarian of Congress Carla Hayden, White House Press Secretary Karoline Leavitt accused her of \"putting inappropriate books in the library for children.\"\"She was doing concerning thing…",
    "link": "https://www.rawstory.com/library-of-congress/",
    "timestamp": "2025-05-09T21:50:35Z"
  },
  {
    "title": "Starmer joins world leaders in Ukraine to call for ceasefire",
    "description": "The prime minister will join world leaders as they vow to \"ratchet up pressure on Russia's war machine\".",
    "link": "https://www.bbc.com/news/articles/cqj7ln2v15yo",
    "timestamp": "2025-05-09T21:50:21Z"
  },
  {
    "title": "Trump to build national center for homeless veterans with funds previously spent on housing for illegal aliens (Brooke Singman/Fox News)",
    "description": "Brooke Singman / Fox News:\nTrump to build national center for homeless veterans with funds previously spent on housing for illegal aliens  —  Trump signed an executive order to establish the National Center for Warrior Independence on the Veterans Affairs cam…",
    "link": "https://www.memeorandum.com/250509/p120",
    "timestamp": "2025-05-09T21:50:00Z"
  },
  {
    "title": "Government agency quietly advances controversial plan that could endanger millions of lives: 'This will increase health risks' - NewsBreak",
    "description": "\"It also allows the market for toxic chemicals to continue.\" Government agency quietly advances controversial plan that could endanger millions of lives:",
    "link": "https://www.newsbreak.com/share/3998599736135-government-agency-quietly-advances-controversial-plan-that-could-endanger-millions-of-lives-this-will-increase-health-risks?_f=app_share&pd=0I1TeYH4&lang=en_US&send_time=1746827356&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.18.0.43%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v1%2Cns_foryou_blend_exp_25q2-v3%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v5%2Cns_local_strategy_25q1_exp-v16&s=i2",
    "timestamp": "2025-05-09T21:49:49Z"
  },
  {
    "title": "Trump and Ukraine diplomacy efforts",
    "description": "Recently, Donald Trump and his advisers have criticized Russia and sounded more engaged with the government in Ukraine. But what does it mean when it comes to U.S. policy?",
    "link": "https://www.npr.org/2025/05/09/nx-s1-5391940/trump-and-ukraine-diplomacy-efforts",
    "timestamp": "2025-05-09T21:45:41Z"
  },
  {
    "title": "Truth Social Parent Trump Media Posts Q1 Net Loss of $31.7 Million on Net Sales of $821,000, Ends Quarter With $759 Million of Cash and Investments",
    "description": "Trump Media & Technology Group, the company majority-owned by President Donald Trump that operates the Truth Social social-media platform, reported earnings for the first quarter of 2025. The company reported $821,200 in net sales for Q1, up 6.6% year over ye…",
    "link": "https://variety.com/2025/digital/news/truth-social-trump-media-q1-2025-earnings-results-1236392667/",
    "timestamp": "2025-05-09T21:42:35Z"
  },
  {
    "title": "'Political life or death': Analyst warns GOP at risk as Trump flip flops on core principle",
    "description": "Punchbowl News reporter Jake Sherman is hearing from members of Congress that President Donald Trump's willingness to raise taxes on the super wealthy is causing a stink on Capitol Hill. Speaking to MSNBC's Katie Tur on Friday, Sherman mentioned a Trump post …",
    "link": "https://www.rawstory.com/republican-tax-plan-2025/",
    "timestamp": "2025-05-09T21:39:19Z"
  },
  {
    "title": "Tyre Nichols and the End of Police Reform",
    "description": "If a savage beating, captured on camera, cannot produce a murder conviction, the chances of fixing the police-brutality problem are very bleak.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/05/tyre-nichols-court-conviction/682772/",
    "timestamp": "2025-05-09T21:39:00Z"
  },
  {
    "title": "How the military is dealing with Hegseth’s order to remove transgender troops",
    "description": "As many as 1,000 service members have identified themselves as transgender.",
    "link": "https://www.bostonherald.com/2025/05/09/transgender-military-ban/",
    "timestamp": "2025-05-09T21:38:42Z"
  },
  {
    "title": "Do These Libertarians Regret Voting for Donald Trump?",
    "description": "Three libertarians—Dave Smith, J.D. Tuccille, and Liz Wolfe—revisit their reluctant votes for Trump, weighing the promises, chaos, and consequences of his second term so far.",
    "link": "https://reason.com/podcast/2025/05/09/do-these-libertarians-regret-voting-for-donald-trump/",
    "timestamp": "2025-05-09T21:36:19Z"
  },
  {
    "title": "Gavin Newsom removes ad after being knocked for using Ukraine footage while bragging about California",
    "description": "California’s progressive Democratic Gov. Gavin Newsom posted an ad bragging about California’s economy and knocking President Donald Trump’s tariffs, but then quickly deleted it after an X user pointed out that the video used footage from Ukraine and Estonia …",
    "link": "https://freerepublic.com/focus/f-news/4316029/posts",
    "timestamp": "2025-05-09T21:35:49Z"
  },
  {
    "title": "Lawmakers did not seek Hayden’s firing as Librarian of Congress",
    "description": "President Donald Trump did not act at the behest of lawmakers overseeing the Library of Congress when he fired its chief, Carla Hayden, three people close to those overseers said. \nMembers on key congressional committees with jurisdiction over the massive lib…",
    "link": "https://biztoc.com/x/a65114a4b51b6001",
    "timestamp": "2025-05-09T21:35:26Z"
  },
  {
    "title": "Livestream: US throws Israel under the bus in Yemen deal",
    "description": "We speak to Donya Abu Sitta about trying to survive famine, David Sheen about Israel’s 7 October lies, the activist who climbed Big Ben and we discuss plans to send US mercenaries to Gaza.",
    "link": "https://electronicintifada.net/blogs/ali-abunimah/livestream-us-throws-israel-under-bus-yemen-deal",
    "timestamp": "2025-05-09T21:35:11Z"
  },
  {
    "title": "Trump says there will 'always' be a tariff baseline",
    "description": "United States President Donald Trump said he plans to keep a minimum 10% tariff on goods from trade partners, even after signing trade deals.\nSpeaking to reporters, he stressed, \"You are always ...",
    "link": "https://biztoc.com/x/fffc02bb9295a4a1",
    "timestamp": "2025-05-09T21:35:02Z"
  },
  {
    "title": "European leaders set to travel to Kyiv as the US, France, Germany, Poland and the UK call for 30-day ceasefire",
    "description": "The leaders of France, Germany, Poland and the UK will be in Kyiv tomorrow as calls intensify for Russia to agree a ceasefire and come to the negotiating table.",
    "link": "https://www.gov.uk/government/news/european-leaders-set-to-travel-to-kyiv-as-the-us-france-germany-poland-and-the-uk-call-for-30-day-ceasefire",
    "timestamp": "2025-05-09T21:33:14Z"
  },
  {
    "title": "Trump: ‘We’ll Be Looking at’ Immigration Reform Regularizing Some in the Country",
    "description": "On Wednesday’s broadcast of the “Hugh Hewitt Show,” President Donald Trump said that his administration will be “looking at” immigration reform that would regularize some of those who are in the country. Host Hugh Hewitt said, “Oh, the most impressive thing, …",
    "link": "https://freerepublic.com/focus/f-news/4316028/posts",
    "timestamp": "2025-05-09T21:32:16Z"
  },
  {
    "title": "Israel to intensify attacks on Houthis amid ongoing missile threats",
    "description": "Israel plans to escalate its attacks on the Iranian-backed Houthis in Yemen. Israeli defense sources emphasize no restrictions on retaliation, with strikes expected to target Houthi infrastructure and Iranian assets.",
    "link": "https://www.israelnationalnews.com/news/408118",
    "timestamp": "2025-05-09T21:32:11Z"
  },
  {
    "title": "Report: India Offers Major Tariff Cut to Complete Trade Deal with Trump",
    "description": "Indian officials have offered a dramatic reduction in tariffs across the board in exchange for relief from President Donald Trump’s tariffs, a report says.\nThe post Report: India Offers Major Tariff Cut to Complete Trade Deal with Trump appeared first on Brei…",
    "link": "https://www.breitbart.com/asia/2025/05/09/report-india-offers-major-tariff-cut-complete-trade-deal-with-trump/",
    "timestamp": "2025-05-09T21:31:29Z"
  },
  {
    "title": "Western leaders head to Kyiv to demand Putin agrees ceasefire",
    "description": "Starmer, Macron, Tusk and Merz join Donald Trump's call for a 30-day Ukraine war truce.",
    "link": "https://www.politico.eu/article/embargo-2230-uk-time-2330cest-western-leaders-head-to-kyiv-to-demand-putin-agrees-ceasefire/",
    "timestamp": "2025-05-09T21:30:00Z"
  },
  {
    "title": "ICYMI: Farmers Back President Trump’s Tariffs",
    "description": "American farmers are behind President Donald J. Trump and his relentless push to restore fairness in global trade and secure new markets for homegrown producers.According to the latest Purdue University-CME Group Ag Economy Barometer:70% of farmers expect the…",
    "link": "https://freerepublic.com/focus/f-news/4316026/posts",
    "timestamp": "2025-05-09T21:28:19Z"
  },
  {
    "title": "Leavitt ‘obliterates’ reporter for suggesting Trump making profit in White House",
    "description": "'I don't remember the same types of questions' about profit-taking Biden clan",
    "link": "https://www.wnd.com/2025/05/leavitt-obliterates-reporter-for-suggesting-trump-making-profit-in-white-house/",
    "timestamp": "2025-05-09T21:28:18Z"
  },
  {
    "title": "Electric air taxi firm Joby Aviation eyes White House landing,  but has deep ties to anti-Trump billionaire Reid Hoffman",
    "description": "Joby Aviation has scored federal approvals and contracts and hopes to begin taking passengers by early 2026.",
    "link": "https://nypost.com/2025/05/09/us-news/electric-air-taxi-firm-joby-aviation-eyes-white-house-landing-but-has-deep-ties-to-anti-trump-billionaire-reid-hoffman/",
    "timestamp": "2025-05-09T21:27:15Z"
  },
  {
    "title": "Here's what we know about Pope Leo XIV voting in US elections",
    "description": "Pope Leo XIV is registered to vote in the United States and has previously voted in some Republican primaries, but he is not registered as a member of a political party.",
    "link": "https://abcnews.go.com/Politics/pope-leo-xiv-voting-us-elections/story?id=121648673",
    "timestamp": "2025-05-09T21:26:47Z"
  },
  {
    "title": "An offshore wind project for New York may be abandoned over Trump administration delays",
    "description": "The Norwegian company Equinor says it will be forced to terminate an offshore wind project for New York within days unless the Trump administration lets construction resume",
    "link": "https://abcnews.go.com/Business/wireStory/offshore-wind-project-new-york-abandoned-trump-administration-121655206",
    "timestamp": "2025-05-09T21:26:32Z"
  },
  {
    "title": "GREAT DEAL FOR AMERICA: President Trump’s “Breakthrough” Trade Deal",
    "description": "In February, President Donald J. Trump promised “a great trade agreement” with the United Kingdom — and today he delivered with a “breakthrough” trade deal that expands market access, curbs non-tariff barriers, and levels the playing field for American export…",
    "link": "https://freerepublic.com/focus/f-news/4316023/posts",
    "timestamp": "2025-05-09T21:25:03Z"
  },
  {
    "title": "Nepo baby whose mom and uncle are both A-List stars 'is arrested at latest Columbia anti-Israel protests'",
    "description": "Maggie Gyllenhaal's daughter Ramona was arrested during violent anti-Israel protests at Columbia University this week, reports say. The star's daughter, who she shares with actor Peter Sarsgaard, is a student at the New York college, which has been hit with a…",
    "link": "https://freerepublic.com/focus/f-news/4316024/posts",
    "timestamp": "2025-05-09T21:25:03Z"
  },
  {
    "title": "Combat vet Paul Rieckhoff warns trans military purge is ‘tip of the spear’ in Trump’s war on all Americans",
    "description": "Paul Rieckhoff, a combat veteran of the Iraq War and a nationally recognized military veterans advocate, issued a blunt warning Friday: The Trump administration’s purge of transgender service members is only the beginning, and the rest of America should take …",
    "link": "https://www.advocate.com/news/transgender-military-purge-warning",
    "timestamp": "2025-05-09T21:25:00Z"
  },
  {
    "title": "Seattle Businesses Take Canadian Cash at Par to Lure Sports Fans",
    "description": "For years, the arrival of the Toronto Blue Jays in Seattle brought a familiar sight: tens of thousands of exuberant Canadians pouring into the city to cheer on their baseball team.",
    "link": "https://financialpost.com/pmn/business-pmn/seattle-businesses-take-canadian-cash-at-par-to-lure-sports-fans",
    "timestamp": "2025-05-09T21:24:37Z"
  },
  {
    "title": "Trump says 'get this stupid war finished' to Russia, Ukraine",
    "description": "United States President Donald Trump told reporters in the Oval Office that his message to both Russian President Vladimir Putin and Ukrainian President Volodimir Zelensky was to \"get this war ended.\"...",
    "link": "https://biztoc.com/x/a6a929ddffe5d1de",
    "timestamp": "2025-05-09T21:23:58Z"
  },
  {
    "title": "Trump says he expects fair deal with China",
    "description": "United States President Donald Trump said that he wants a fair trade deal with China as talks continue this weekend.\nWhen asked what instructions he gave negotiator Treasury Secretary Scott Bassett, ...",
    "link": "https://biztoc.com/x/271bfc84a4711733",
    "timestamp": "2025-05-09T21:23:47Z"
  },
  {
    "title": "Abigail Spanberger Says She Can Take on Trump Without Bashing Him",
    "description": "The no-nonsense Democrat, who is running for Virginia governor, tells VF that her party should “just take a second and listen to people” before committing to a strategy for reclaiming the White House.",
    "link": "https://www.vanityfair.com/news/story/abigail-spanberger-says-she-can-take-on-trump-without-bashing-him",
    "timestamp": "2025-05-09T21:23:11Z"
  },
  {
    "title": "Green Card Holder From Germany 'Free' After Two Months of ICE Detention",
    "description": "Fabian Schmidt, who came to the U.S. in 2007, was released from ICE detention on Thursday, according to his partner Bhavani Hodgkins.",
    "link": "https://www.newsweek.com/green-card-holder-germany-free-after-two-months-ice-detention-2070446",
    "timestamp": "2025-05-09T21:22:40Z"
  },
  {
    "title": "Canada Missed Out on a Huge Opportunity",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Canada Missed Out on a Huge Opportunity appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/05/09/canada-missed-out-on-a-huge-opportunity/",
    "timestamp": "2025-05-09T21:20:38Z"
  },
  {
    "title": "'League of its own': Nicolle Wallace pinpoints Trump comment showing he's way out of touch",
    "description": "MSNBC host Nicolle Wallace began her Friday episode of \"Deadline White House\" discussing President Donald Trump's latest tease on tariffs from China. \"There are twists and turns today in the melodrama that is Donald Trump's handling of the U.S. economy,\" she …",
    "link": "https://www.rawstory.com/trump-economy-tariff-2671925544/",
    "timestamp": "2025-05-09T21:19:02Z"
  },
  {
    "title": "Trump says US will maintain 10% tariffs even after trade deals",
    "description": "President Donald Trump said on Friday that the U.S. will maintain a baseline 10% tariff on imports even after trade deals are struck, adding there could be...",
    "link": "https://finance.yahoo.com/news/trump-says-us-maintain-10-211801807.html",
    "timestamp": "2025-05-09T21:18:01Z"
  },
  {
    "title": "‘Balkan beauty’ hedge funder known for steamy bikini selfies banned from US over immigration ‘lies’: sources",
    "description": "The glamorous banker admitted she had been illicitly working in her $13,000-a-month job for her Miami Beach-based firm.",
    "link": "https://nypost.com/2025/05/09/business/balkan-beauty-hedge-funder-banned-from-us-over-immigration-lies/",
    "timestamp": "2025-05-09T21:15:36Z"
  },
  {
    "title": "Vice President JD Vance to Headline Bitcoin Conference, Following Trump's Lead",
    "description": "Vice President JD Vance will speak at Bitcoin 2025 in Las Vegas later this month, one year after President Trump headlined in Nashville.",
    "link": "https://decrypt.co/318873/vp-jd-vance-headline-bitcoin-conference-trump",
    "timestamp": "2025-05-09T21:15:16Z"
  },
  {
    "title": "US VP Vance to speak at Bitcoin conference amid Trump crypto controversies",
    "description": "US Vice President JD Vance will speak at the Bitcoin 2025 conference in Las Vegas, roughly a year after then-presidential candidate Donald Trump spoke at the same event.According to a May 9 notice from the event’s organizers, Vance will address conference att…",
    "link": "https://cointelegraph.com/news/us-vice-president-crypto-conference",
    "timestamp": "2025-05-09T21:15:00Z"
  },
  {
    "title": "How 'No More Souters' led to today's extreme politics",
    "description": "The late Supreme Court Justice David Souter inadvertently sparked the push toward extremism that is defining our current politics.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/david-souter-supreme-court-trump-newsletter-rcna205951",
    "timestamp": "2025-05-09T21:12:09Z"
  },
  {
    "title": "Latino Voters Lean Right on Taxes, Energy, and Border, Poll Finds",
    "description": "Latinos broadly support low taxes, energy production, and a stable border situation, a new poll from the advocacy group Libre found. Libre, a Latino organization... Read More\nThe post Latino Voters Lean Right on Taxes, Energy, and Border, Poll Finds appeared …",
    "link": "https://www.dailysignal.com/2025/05/09/poll-latino-voters-conservative-many-issues/",
    "timestamp": "2025-05-09T21:11:57Z"
  },
  {
    "title": "Trump taps CFPB director nominee Jonathan McKernan for Treasury post",
    "description": "McKernan previously served on the FDIC and held senior roles at the Federal Housing Finance Agency, the Senate, and the Treasury Department.",
    "link": "https://www.cnbc.com/2025/05/09/trump-cpfb-tresury-mckernan.html",
    "timestamp": "2025-05-09T21:11:35Z"
  },
  {
    "title": "Mexico Finance Chief Says USMCA-Protected Exports Bolster Growth",
    "description": "Mexico’s finance chief Edgar Amador said the North American free trade agreement should continue to bolster the economy despite the threat that the US could push for major changes to it.",
    "link": "https://financialpost.com/pmn/business-pmn/mexico-finance-chief-says-usmca-protected-exports-bolster-growth",
    "timestamp": "2025-05-09T21:09:19Z"
  },
  {
    "title": "Inside Trump’s negotiating strategy with China | CNN Business",
    "description": "A few hours after President Donald Trump’s trade negotiating team boarded a flight for the most important economic meetings in the world, their boss took to social media to publicly throw a curveball into the negotiations.",
    "link": "https://www.cnn.com/2025/05/09/business/china-trade-negotiations",
    "timestamp": "2025-05-09T21:05:29Z"
  },
  {
    "title": "US reports second air traffic control outage at New Jersey airport",
    "description": "The Trump administration is facing pressure to modernise air traffic control systems and hire more staff.",
    "link": "https://www.aljazeera.com/news/2025/5/9/us-reports-second-air-traffic-control-outage-at-new-jersey-airport",
    "timestamp": "2025-05-09T21:05:15Z"
  },
  {
    "title": "Mexico sues Google for labeling Gulf of Mexico as 'Gulf of America'",
    "description": "Mexico has sued tech giant Google over its labelling of the Gulf of Mexico as the Gulf of America, a change made by U.S. President Donald Trump via executive order, Mexico President Claudia Sheinbaum said Friday. Sheinbaum did not provide details of the lawsu…",
    "link": "https://japantoday.com/category/world/mexico-sues-google-for-labeling-gulf-of-mexico-as-%27gulf-of-america%27",
    "timestamp": "2025-05-09T21:05:11Z"
  },
  {
    "title": "Trump abruptly fires Librarian of Congress Carla Hayden (Justin Papp/Roll Call)",
    "description": "Justin Papp / Roll Call:\nTrump abruptly fires Librarian of Congress Carla Hayden  —  Democrats lash out at ‘unjust’ decision to terminate Hayden, the library's head since 2016  —  President Donald Trump has fired Carla Hayden, the longtime head of the Library…",
    "link": "https://www.memeorandum.com/250509/p112",
    "timestamp": "2025-05-09T21:05:01Z"
  },
  {
    "title": "Blasts rock Indian Kashmir, Amritsar as Pakistan conflict escalates",
    "description": "Blasts rang out across Indian Kashmir and the Sikh holy city of Amritsar in neighbouring Punjab state late on Friday, with the Indian military saying it was shooting down drones in the worst fighting with Pakistan in nearly three decades. The explosions in Am…",
    "link": "https://japantoday.com/category/world/blasts-rock-indian-kashmir-amritsar-as-pakistan-conflict-escalates1",
    "timestamp": "2025-05-09T21:04:40Z"
  },
  {
    "title": "US to accept white South African refugees while other programs remain paused",
    "description": "The Trump administration will welcome more than two dozen white South Africans to the United States as refugees next week, an unusual move because it has suspended most refugee resettlement operations, officials and documents said Friday. The first Afrikaner …",
    "link": "https://japantoday.com/category/world/us-to-accept-white-south-african-refugees-while-other-programs-remain-paused",
    "timestamp": "2025-05-09T21:04:29Z"
  },
  {
    "title": "Jamie Dimon Blasts Dems For Stonewalling California Wildfire Rebuilding Efforts With ‘Red Tape’",
    "description": "JPMorgan Chase CEO Jamie Dimon called out Democrats for appearing to push “more regulations” as CA residents continue efforts to rebuild after wildfires.",
    "link": "https://dailycaller.com/2025/05/09/jamie-dimon-los-angeles-county-fires-democrat-leadership/",
    "timestamp": "2025-05-09T21:03:58Z"
  },
  {
    "title": "Ahead of China-U.S. talks, Trump says 80% tariff 'seems right'",
    "description": "U.S. President Donald Trump said on Friday an 80% tariff on Chinese goods &quot;seems right,&quot; for the first time suggesting a specific alternative to the 145% levies he has imposed on Chinese imports ahead of closely watched weekend talks. U.S. Treasury …",
    "link": "https://japantoday.com/category/world/ahead-of-china-us-talks-trump-says-80-tariff-%27seems-right%271",
    "timestamp": "2025-05-09T21:03:52Z"
  },
  {
    "title": "An offshore wind project for New York may be abandoned over Trump administration delays",
    "description": "The Norwegian energy company Equinor said Friday it will be forced to terminate an offshore wind project for New York within days unless President Donald...",
    "link": "https://www.yahoo.com/news/offshore-wind-project-york-may-210350660.html",
    "timestamp": "2025-05-09T21:03:50Z"
  },
  {
    "title": "Victory Day parade in Russia celebrates 80th anniversary of defeat of Nazi Germany",
    "description": "Russia on Friday celebrated the 80th anniversary of the defeat of Nazi Germany in World War II, as President Vladimir Putin presided over a massive parade of tanks, missiles and troops through Red Square and welcomed over two dozen world leaders — the most si…",
    "link": "https://japantoday.com/category/world/russia%E2%80%99s-victory-day-parade-begins-marking-the-80th-anniversary-of-the-defeat-of-nazi-germany",
    "timestamp": "2025-05-09T21:03:23Z"
  },
  {
    "title": "The Trump Administration's Biggest Wins And Biggest Fails So Far",
    "description": "The Trump Administration's Biggest Wins And Biggest Fails So Far\n \nAuthored by Brandon Smith via Alt-Market.us,\nBack in 2016 I predicted a resounding win for Donald Trump in his election campaign against Hillary Clinton despite a chorus of voices telling me I…",
    "link": "https://biztoc.com/x/8ff16c36992d0fa7",
    "timestamp": "2025-05-09T21:02:04Z"
  },
  {
    "title": "White House is actively looking at suspending due process for migrants, top adviser says",
    "description": "Top Trump adviser Stephen Miller told reporters Friday that the administration is \"looking at\" ways to end due process protections for unauthorized immigrants who are in the country.",
    "link": "https://www.nbcnews.com/politics/immigration/top-white-house-adviser-stephen-miller-says-actively-looking-suspendin-rcna205942",
    "timestamp": "2025-05-09T21:01:43Z"
  },
  {
    "title": "NYC Predicts Steep Drop in Tourism Numbers Amid Trump Policies",
    "description": "It looks like tourism is about to take a hit in New York City, and it’s not a coincidence that it’s coming after President Donald Trump announced new tariffs and immigration policies earlier this year. The estimated number of tourists likely to visit the city…",
    "link": "http://commercialobserver.com/2025/05/nyc-drop-tourism-trump-policies/",
    "timestamp": "2025-05-09T21:01:08Z"
  },
  {
    "title": "Biden Banned This Opponent of George Soros From Entering the US. Now, He Can.",
    "description": "An outspoken opponent of Hungarian American megadonor George Soros can finally visit the United States after the Biden administration banned him in 2021, accusing him... Read More\nThe post Biden Banned This Opponent of George Soros From Entering the US. Now, …",
    "link": "https://www.dailysignal.com/2025/05/09/biden-banned-opponent-george-soros-entering-us-now-he-can/",
    "timestamp": "2025-05-09T21:00:49Z"
  },
  {
    "title": "US auto industry criticizes Donald Trump's UK trade deal",
    "description": "America’s “big three” automakers ripped President Trump on Friday over his newly announced trade deal with the United Kingdom. The Thursday agreement is the first bilateral trade pact the administration reached since it rolled out and then paused a “reciproca…",
    "link": "https://thehill.com/business/5292037-auto-industry-critics-trump-uk-deal/",
    "timestamp": "2025-05-09T20:59:52Z"
  },
  {
    "title": "Trade talks in two acts: Canada-U.S. poised to negotiate in stages",
    "description": "The process is still taking shape. But the two-step idea is emerging in comments following this week's meeting between Prime Minister Mark Carney and U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/world/two-phase-canada-us-talks-1.7531494",
    "timestamp": "2025-05-09T20:59:50Z"
  },
  {
    "title": "A Georgia college student's plight makes a mockery of Trump's immigration claims",
    "description": "Ximena Arias-Cristobal was an honors student in high school and has lived in the U.S. since she was four. Now she faces deportation.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/georgia-college-student-deportation-traffic-arias-cristobal-rcna205841",
    "timestamp": "2025-05-09T20:59:24Z"
  }
]