[
  {
    "title": "Trump Official Bummed That Reporter Didn't Publish Every Insulting Thing He Said",
    "description": "Bill Pulte wasn't happy that Punchbowl News only used the part of his quote and left out the “racial commentary.”",
    "link": "https://www.huffpost.com/entry/trump-official-criticizes-reporter-over-missing-racist-talk_n_68ffd134e4b0ebfddfbb5d49",
    "timestamp": "2025-10-27T22:41:15Z"
  },
  {
    "title": "Trump’s bailout threat may have been key to Milei’s electoral triumph in Argentina",
    "description": "“The dollar always talks in the end,” Donald Trump wrote in his 1987 bestseller The Art of the Deal. Javier Milei’s surprise triumph in Argentina’s midterm elections – after Trump bailed him out with 40bn of them – suggests there may be some truth to that ass…",
    "link": "https://freerepublic.com/focus/f-news/4349009/posts",
    "timestamp": "2025-10-27T22:41:06Z"
  },
  {
    "title": "Trump to talk trade, security with Japan's new leader Takaichi",
    "description": "Sanae Takaichi is expected to offer a package of US investments in a US$550-billion deal agreed this year, according to sources.",
    "link": "https://www.channelnewsasia.com/world/us-trump-japan-takaichi-trade-security-5428521",
    "timestamp": "2025-10-27T22:37:28Z"
  },
  {
    "title": "Push for Ukraine ceasefire collapses",
    "description": "What happened\nA planned meeting between Donald Trump and Vladimir Putin to discuss a halt to the war in Ukraine was shelved last week, after Russian officials said Putin would not bend on any of his demands. “A ceasefire now would mean only one thing,” said R…",
    "link": "https://biztoc.com/x/87a50847ccb13523",
    "timestamp": "2025-10-27T22:37:24Z"
  },
  {
    "title": "Commentary: Taiwan remains the dealbreaker as Trump and Xi eye fragile thaw at APEC",
    "description": "As the APEC summit in late October approaches, US President Donald Trump aims to broker a historic China-US trade deal and push for a Russia-Ukraine ceasefire. However, stalled negotiations have raised concerns that Taiwan could become a bargaining chip betwe…",
    "link": "https://www.digitimes.com/news/a20251027PD234/apec-donald-trump-xi-jingping-supply-chain-taiwan.html",
    "timestamp": "2025-10-27T22:35:22Z"
  },
  {
    "title": "Trump’s pettiest tariff, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump’s wide-ranging tariff campaign …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/466281/donald-trump-tariffs-canada-ontario-ad-reagan",
    "timestamp": "2025-10-27T22:33:18Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing can wear street clothes in court amid ‘extraordinary’ attention",
    "description": "SALT LAKE CITY (AP) — The 22-year-old Utah man charged with killing Charlie Kirk can appear in court wearing street clothes but must be physically restrained due to security concerns, a judge ruled Monday.Attorneys for Tyler Robinson argued images of him shac…",
    "link": "https://freerepublic.com/focus/f-news/4349006/posts",
    "timestamp": "2025-10-27T22:32:37Z"
  },
  {
    "title": "'Can't Spend That Money': Newsmax Analyst Says Trump Lying About 130M Donation To Troops",
    "description": "Newsmax legal analyst Andrew Napolitano suggested President Donald Trump was not telling the truth when he claimed that a billionaire's $130 million donation could be used to pay military troops during the government shutdown.\n\n\nSpeaking on Monday, Napolitano…",
    "link": "https://crooksandliars.com/2025/10/cant-spend-money-newsmax-analyst-says",
    "timestamp": "2025-10-27T22:31:40Z"
  },
  {
    "title": "Jennifer Lawrence Grows Up",
    "description": "From the daily newsletter: a profile of the actress Jennifer Lawrence, as her roles turn darker.",
    "link": "https://www.newyorker.com/newsletter/the-daily/jennifer-lawrence-grows-up",
    "timestamp": "2025-10-27T22:30:00Z"
  },
  {
    "title": "Trump administration says TikTok deal is set to be finalized Thursday",
    "description": "The Trump administration says a TikTok deal with China is set to be finalized on Thursday when President Trump meets with his Chinese counterpart. (Scripps News) Treasury Secretary Scott Bessent says a deal to keep TikTok operating in the U.S is set to be fin…",
    "link": "https://freerepublic.com/focus/f-news/4349005/posts",
    "timestamp": "2025-10-27T22:28:31Z"
  },
  {
    "title": "Has Trump actually ended any wars?",
    "description": "In Malaysia on Sunday, on the sidelines of a summit of Southeast Asian leaders, President Donald Trump presided over a ceremony for the signing of a ceasefire agreement between Thailand and Cambodia. The two countries had already agreed to a ceasefire back in…",
    "link": "https://www.vox.com/politics/466269/trump-peace-deals-ended-wars",
    "timestamp": "2025-10-27T22:26:38Z"
  },
  {
    "title": "Here's What People Are Saying About Gavin Newsom's Brutal 3-Word Name For Donald Trump",
    "description": "Gavin's at it again.View Entire Post ›",
    "link": "https://www.buzzfeed.com/morgansloss1/gavin-newsom-trump-an-invasive-species",
    "timestamp": "2025-10-27T22:13:39Z"
  },
  {
    "title": "Retired colonel makes explosive claim feds covered up killing of American journalist",
    "description": "Retired US Col. Steve Gabavics went public Monday with an account he had previously only spoken about anonymously—the story of his investigation into an Israeli soldier’s killing of Palestinian-American journalist Shireen Abu Akleh in 2022 and the unsuccessfu…",
    "link": "https://www.rawstory.com/shireen-abu-akleh/",
    "timestamp": "2025-10-27T22:10:21Z"
  },
  {
    "title": "WTO director-general says calling the trade wars the greatest disruption since the 1930s is ‘the understatement of the century’—but it’s not a repeat",
    "description": "\"I think that a lot of the criticisms made by the U.S. of the system are valid,\" Dr.  Ngozi Okonjo-Iweala said at the Fortune Global Forum.",
    "link": "https://fortune.com/2025/10/27/wto-director-general-says-us-criticisms-of-trade-valid-not-1930s/",
    "timestamp": "2025-10-27T22:09:59Z"
  },
  {
    "title": "I'm a U.S. senator. 'House of Dynamite' exposes a brutal truth.",
    "description": "The new Netflix movie dramatizes, in real time, the terrifying 30-minute window between the launch of a nuclear missile bound for the U.S. and its impact.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/netflix-movie-house-of-dynamite-markey-rcna240080",
    "timestamp": "2025-10-27T22:09:22Z"
  },
  {
    "title": "US judge asks for assurance Abrego Garcia won’t be deported to Liberia",
    "description": "Trump administration is seeking to deport Abrego Garcia to West African country, in move decried by lawyers.",
    "link": "https://www.aljazeera.com/news/2025/10/27/us-judge-asks-for-assurance-abrego-garcia-wont-be-deported-to-liberia",
    "timestamp": "2025-10-27T22:09:03Z"
  },
  {
    "title": "'If You Can Keep It': Trump, Hate Speech, And Free Speech",
    "description": "A <a href=\"https://www.politico.com/news/2025/10/14/private-chat-among-young-gop-club-members-00592146\"target=\"_blank\"   >Hitler-praising group chat</a><a href=\"https://www.politico.com/news/2025/10/14/private-chat-among-young-gop-club-members-00592146\"target…",
    "link": "https://www.npr.org/2025/10/27/nx-s1-5587879/if-you-can-keep-it-trump-hate-speech-and-free-speech",
    "timestamp": "2025-10-27T22:08:31Z"
  },
  {
    "title": "White House Hides Truth on Trump’s Health After MRI Bombshell",
    "description": "The White House is refusing to say when Donald Trump had his most recent cognitive test after the results of his latest medical examination did not mention...",
    "link": "https://www.thedailybeast.com/trump-79-mystery-over-brain-test-and-secret-mri-scan/",
    "timestamp": "2025-10-27T22:07:59Z"
  },
  {
    "title": "Charles Munger Jr.: Meet the megadonor opposing Prop 50",
    "description": "One megadonor in particular has made up the overwhelming majority of funding opposing the ballot measure — physicist Charles Munger Jr., who also supported efforts to create the independent redistricting commission more than a decade ago.",
    "link": "https://www.kpbs.org/news/politics/2025/10/27/charles-munger-jr-meet-the-megadonor-opposing-prop-50",
    "timestamp": "2025-10-27T22:06:25Z"
  },
  {
    "title": "Did Bernie Sanders praise Trump's border policies?",
    "description": "Sen. Bernie Sanders, I-Vt., said, referring to U.S. President Donald Trump's border policies, \"Trump did a better job. I don't like Trump, you know, but we should have a secure border and it ain't that hard to do.\"",
    "link": "https://www.snopes.com//fact-check/bernie-sanders-trump-border/",
    "timestamp": "2025-10-27T22:04:00Z"
  },
  {
    "title": "Wall St scales fresh highs on tech earnings, US-China trade optimism",
    "description": "Earnings from five of the \"Magnificent Seven\" megacap companies, Microsoft, Apple, Alphabet, Amazon and Meta, later this week will test the market rally's endurance, which has largely depended on optimism around growth and capital expenditures related to arti…",
    "link": "https://www.channelnewsasia.com/business/wall-st-scales-fresh-highs-tech-earnings-us-china-trade-optimism-5426741",
    "timestamp": "2025-10-27T22:02:20Z"
  },
  {
    "title": "Trump to talk trade, security with Japan's new leader Takaichi",
    "description": "President Donald Trump will meet Japan's new Prime Minister Sanae Takaichi in Tokyo on Tuesday for talks on trade and security, a week after the hardline...",
    "link": "https://www.yahoo.com/news/articles/trump-talk-trade-security-japans-220159350.html",
    "timestamp": "2025-10-27T22:01:59Z"
  },
  {
    "title": "Bitcoin Price Could See A New All-Time High Above $126,000 If It Breaks This Critical Level",
    "description": "The Bitcoin price is positioning for a potentially explosive move that could take it well beyond its previous all-time highs. Analysts are closely watching a critical resistance level near $116,000, which may serve as the final hurdle before BTC catapults int…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-to-a-new-all-time-high/",
    "timestamp": "2025-10-27T22:00:50Z"
  },
  {
    "title": "Air Force B-1s Fly Near Again in Latest Bomber Show of Force...",
    "description": "Air Force B-1 Lancer bombers flew near Venezuela Oct. 27 in the latest show of force by the Pentagon aimed at Caracas and drug cartels.",
    "link": "https://www.airandspaceforces.com/air-force-b-1s-fly-venezuela-again-show-of-force/",
    "timestamp": "2025-10-27T22:00:04Z"
  },
  {
    "title": "Voter turnout surges in NYC mayor race, with Boomers and Gen X leading charge...",
    "description": "The data so far is good news for independent candidate Andrew Cuomo, a political scientist said.",
    "link": "https://gothamist.com/news/voter-turnout-surges-in-nyc-mayors-race-with-boomers-and-gen-x-leading-the-charge",
    "timestamp": "2025-10-27T22:00:04Z"
  },
  {
    "title": "Will the Virginia Democrats’ Special Session on Redistricting Backfire at the Ballot Box?",
    "description": "In the final stretch before Election Day, Virginia Democrats called a special session of the Legislature to focus on redistricting—a session that may take the... Read More\nThe post Will the Virginia Democrats’ Special Session on Redistricting Backfire at the …",
    "link": "https://www.dailysignal.com/2025/10/27/will-virginia-democrats-special-session-redistricting-backfire-ballot-box/",
    "timestamp": "2025-10-27T22:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Jackie Siegel Defends Kristin Chenoweth After Actress Mourned Charlie Kirk Following His Death",
    "description": "Jackie Siegel defended Kristin Chenoweth after pushback the star received for comments on Charlie Kirk.",
    "link": "https://radaronline.com/p/jackie-siegel-kristin-chenoweth-charlie-kirk-mourning-defended/",
    "timestamp": "2025-10-27T22:00:00Z"
  },
  {
    "title": "Federal food benefits and preschool aid to run dry starting Saturday if shutdown continues",
    "description": "Barring a resolution to the shutdown, the U.S. safety net will have a gaping hole.",
    "link": "https://www.denverpost.com/2025/10/27/government-shutdown-food-aid-what-to-know/",
    "timestamp": "2025-10-27T21:59:58Z"
  },
  {
    "title": "Federal food benefits and preschool aid to run dry starting Saturday if shutdown continues",
    "description": "Barring a resolution to the shutdown, the U.S. safety net will have a gaping hole.",
    "link": "https://www.bostonherald.com/2025/10/27/government-shutdown-food-aid-what-to-know/",
    "timestamp": "2025-10-27T21:59:58Z"
  },
  {
    "title": "Johnson backs Trump’s plans not to tap contingency dollars for food aid ahead of funding cliff",
    "description": "The White House is warning 42 million low-income Americans will start to miss SNAP benefits Saturday if Democrats don’t vote for the funding stopgap this week.Speaker Mike Johnson is siding with the Trump administration’s decision not to tap emergency funds t…",
    "link": "https://freerepublic.com/focus/f-news/4349000/posts",
    "timestamp": "2025-10-27T21:59:43Z"
  },
  {
    "title": "‘I’m Not Sure What You’re Saying’: Interviewer Baffled by Karine Jean-Pierre’s Defense of Biden",
    "description": "Ex-White House Press Secretary Karine Jean-Pierre offered a muddled defense of former President Joe Biden in a response that left her interviewer perplexed.\nThe post ‘I’m Not Sure What You’re Saying’: Interviewer Baffled by Karine Jean-Pierre’s Defense of Bid…",
    "link": "https://www.mediaite.com/politics/im-not-sure-what-youre-saying-interviewer-baffled-by-karine-jean-pierres-defense-of-biden/",
    "timestamp": "2025-10-27T21:59:05Z"
  },
  {
    "title": "Three trump cards that explain Milei’s election success in Argentina",
    "description": "A rejection of Peronism 'counted for more' than the Argentine President's political woes.",
    "link": "https://www.nzherald.co.nz/world/three-trump-cards-that-explain-mileis-election-success-in-argentina/3WUCIMRETRELPN3QG22XHVD3MQ/",
    "timestamp": "2025-10-27T21:58:43Z"
  },
  {
    "title": "Biden Applauds Kimmel, Laments ‘Dark Days’ Under Trump in First Speech After Cancer Treatment | Video",
    "description": "“The late night hosts continue to shine a light on free speech knowing their careers are on the line,” the former president says\nThe post Biden Applauds Kimmel, Laments ‘Dark Days’ Under Trump in First Speech After Cancer Treatment | Video appeared first on T…",
    "link": "https://www.thewrap.com/biden-applauds-kimmel-late-night-trump-dark-days/",
    "timestamp": "2025-10-27T21:58:15Z"
  },
  {
    "title": "Livestream: \"We're unable to trust that it has really ended\"",
    "description": "Gaza City is determined to rebuild, but promises of aid and equipment are already being broken, says Asem Alnabih.",
    "link": "https://electronicintifada.net/blogs/eli-gerzon/livestream-were-unable-trust-it-has-really-ended",
    "timestamp": "2025-10-27T21:57:54Z"
  },
  {
    "title": "No Kings rally: What did it achieve?",
    "description": "The latest ‘No Kings’ march has become the largest protest in U.S. history",
    "link": "https://theweek.com/politics/no-kings-rally-achieve",
    "timestamp": "2025-10-27T21:54:12Z"
  },
  {
    "title": "Argentine markets soar after Javier Milei’s party secures midterm win",
    "description": "Argentine stock, bond and currency markets surged on Monday after President Javier Milei’s party scored a decisive victory in midterm elections over the weekend.",
    "link": "https://www.cnn.com/2025/10/27/business/argentina-stock-market-milei-party-win",
    "timestamp": "2025-10-27T21:53:40Z"
  },
  {
    "title": "Indiana Gov. Mike Braun calls special session to consider new congressional map",
    "description": "It's unclear whether enough Republican lawmakers will support the mid-decade redistricting effort that Trump has urged them to pursue.Indiana Gov. Mike Braun on Monday called a special legislative session to consider redrawing the state's congressional map, t…",
    "link": "https://freerepublic.com/focus/f-news/4348997/posts",
    "timestamp": "2025-10-27T21:52:03Z"
  },
  {
    "title": "California voters have one week left to decide on Prop 50",
    "description": "California voters have until next Tuesday, Nov. 4, to vote on Proposition 50 — which would allow the state to temporarily redraw its congressional maps.With about a week to go before voting is done, we check in on where the race stands and how fundraising is …",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/california-voters-have-one-week-left-to-decide-on-prop-50",
    "timestamp": "2025-10-27T21:51:00Z"
  },
  {
    "title": "Leftist Congressional Hopeful Manny Rutinel Reportedly Aligns with Radical Groups",
    "description": "Manny Rutinel, a leftist running in Colorado's Eight Congressional District, has reportedly aligned himself with radical groups and causes.\nThe post Leftist Congressional Hopeful Manny Rutinel Reportedly Aligns with Radical Groups appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/27/leftist-congressional-hopeful-manny-rutinel-reportedly-aligns-with-radical-groups/",
    "timestamp": "2025-10-27T21:50:37Z"
  },
  {
    "title": "How the Collapse of USAID Set the U.S. Back in Gaza",
    "description": "Humanitarian aid is a key component of Trump’s peace deal. Securing it will depend on American involvement.",
    "link": "https://www.theatlantic.com/health/2025/10/gaza-israel-aid-ceasefire-usaid/684711/",
    "timestamp": "2025-10-27T21:50:27Z"
  },
  {
    "title": "Report: Trump Admin to End UN Role in Refugee Admissions",
    "description": "The Trump administration is reportedly planning on ending the United Nations’ role in refugee admissions. The New York Times reports:Administration officials are not done submitting proposals to the White House. According to a draft of a third report, obtaine…",
    "link": "https://freerepublic.com/focus/f-news/4348994/posts",
    "timestamp": "2025-10-27T21:47:25Z"
  },
  {
    "title": "The Military’s Missile Defense System Cannot Be as Good as It Says",
    "description": "Kathryn Bigelow’s new movie, A House of Dynamite, is more accurate on this point than the Defense Department itself.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/pentagon-house-of-dynamite/684714/",
    "timestamp": "2025-10-27T21:46:26Z"
  },
  {
    "title": "Republican senator warns time is running out to pass US crypto bill: Report",
    "description": "Amid a US government shutdown with no end in sight, a Republican lawmaker said Congress had only until January or February to pass crypto legislation.",
    "link": "https://cointelegraph.com/news/republican-lawmaker-crypto-bills-congress",
    "timestamp": "2025-10-27T21:46:10Z"
  },
  {
    "title": "Brandon Johnson: If You Call Migrants ‘Illegal Aliens’ Then You Must Call Black People ‘Slaves’",
    "description": "Chicago’s self-professed “progressive” Democrat Mayor Brandon Johnson said on Saturday that there are no “illegal aliens” in his city and it is racist to say there are. He went on to say that if we refer to “undocumented individuals” as “illegal aliens,” then…",
    "link": "https://freerepublic.com/focus/f-news/4348992/posts",
    "timestamp": "2025-10-27T21:46:06Z"
  },
  {
    "title": "Toyota 1st-half global sales up 4.7% to record high despite U.S. tariffs",
    "description": "Toyota Motor Corp on Monday reported a 4.7 percent year-on-year increase in its global sales for the April-September period, driven by robust demand for hybrids in North America and China, despite the impact of higher tariffs imposed by U.S. President Donald …",
    "link": "https://japantoday.com/category/business/update1-toyota-1st-half-global-sales-up-4.7-to-record-high-despite-u.s.-tariffs",
    "timestamp": "2025-10-27T21:45:30Z"
  },
  {
    "title": "Trump rejects VP run in 2028, but not ruling out third term",
    "description": "Trump rules out running for VP in 2028, calling it “too cute,” but hints at interest in a third term.",
    "link": "https://www.israelnationalnews.com/news/416916",
    "timestamp": "2025-10-27T21:45:12Z"
  },
  {
    "title": "The Trump Trade Tracker",
    "description": "The latest global picture on Trump’s tariff regime—including who has managed to cut a deal.",
    "link": "http://foreignpolicy.com/2025/10/27/tariffs-trump-trade-deals-talks-us-china-canada-mexico-economy/",
    "timestamp": "2025-10-27T21:44:15Z"
  },
  {
    "title": "Kirk assassination suspect to remain shackled",
    "description": "The 22-year-old Utah man charged with killing Charlie Kirk can appear in court wearing street clothes but must be physically restrained due to security concerns, a judge ruled Monday.",
    "link": "https://www.bostonherald.com/2025/10/27/kirk-assassination-suspect-to-remain-shackled/",
    "timestamp": "2025-10-27T21:43:59Z"
  },
  {
    "title": "Trump visits emperor ahead of meeting with Takaichi",
    "description": "U.S. President Donald Trump landed in Tokyo on Monday evening, beginning the second leg of a three-nation Asia trip to discuss with Japan's new prime minister, Sanae Takaichi, how to steer the future course of the bilateral relationship. Visiting Japan for th…",
    "link": "https://japantoday.com/category/politics/Trump-visits-emperor-ahead-of-meeting-with-Takaichi",
    "timestamp": "2025-10-27T21:43:26Z"
  },
  {
    "title": "Trump says Milei had 'a lot of help' from U.S. for Argentina election win",
    "description": "President Donald Trump said on Monday that Argentina's President Javier Milei had a &quot;lot of help&quot; from the U.S. in his party's midterm election victory, after Trump's administration offered a bailout potentially worth $40 billion to boost Milei ahea…",
    "link": "https://japantoday.com/category/world/trump-says-milei-had-%27a-lot-of-help%27-from-us-for-argentina-election-win1",
    "timestamp": "2025-10-27T21:42:47Z"
  },
  {
    "title": "China's foreign minister speaks with Rubio ahead of Trump-Xi meeting",
    "description": "China hopes the United States can meet it halfway to &quot;prepare for high-level interactions&quot; between the two countries, foreign minister Wang Yi told U.S. Secretary of State Marco Rubio in a phone call on Monday, China's foreign ministry said. Chinese…",
    "link": "https://japantoday.com/category/world/china%27s-foreign-minister-speaks-with-rubio-ahead-of-trump-xi-meeting",
    "timestamp": "2025-10-27T21:42:35Z"
  },
  {
    "title": "Trump wants to cancel more funding during shutdown; courts have hampered his earlier efforts",
    "description": "Congress has the constitutional power of the purse, but President Donald Trump’s robust assertion of executive authority is testing even that basic tenet of U.S. democracy. His administration has already canceled or threatened to cancel billions of dollars of…",
    "link": "https://japantoday.com/category/world/trump-wants-to-cancel-more-funding-during-the-shutdown.-courts-have-hampered-his-earlier-efforts",
    "timestamp": "2025-10-27T21:41:52Z"
  },
  {
    "title": "Kremlin says its test of a nuclear-powered missile reflects security concerns",
    "description": "Russia’s test of a nuclear-powered missile that it claims can’t be stopped by air defenses reflects Moscow’s determination to look out for its security interests, a Kremlin official said Monday, after the United States and European countries increased pressur…",
    "link": "https://japantoday.com/category/world/kremlin-says-its-test-of-a-nuclear-powered-missile-reflects-security-concerns",
    "timestamp": "2025-10-27T21:41:46Z"
  },
  {
    "title": "Trump dismisses 2028 VP run as ‘too cute;’ leaves door open to third term",
    "description": "U.S. President Donald Trump on Monday ruled out running for vice president in the 2028 election but declined to definitively say he would not seek a third term, keeping alive speculation about how he might seek to extend his time in office. Trump has repeated…",
    "link": "https://japantoday.com/category/world/trump-dismisses-2028-vp-run-as-%E2%80%98too-cute-%E2%80%99-leaves-door-open-to-third-term",
    "timestamp": "2025-10-27T21:41:14Z"
  },
  {
    "title": "Barbie, Monopoly toymakers see bright holiday season despite tariff pressure",
    "description": "President Donald Trump’s tariffs are hitting toy giants Mattel and Hasbro as the critical holiday season nears.",
    "link": "https://www.nbcnews.com/business/business-news/hasbro-mattel-toys-trump-tariffs-rcna239429",
    "timestamp": "2025-10-27T21:40:54Z"
  },
  {
    "title": "Trump’s Ballroom Broke the Democrats",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump’s Ballroom Broke the Democrats appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/27/trumps-ballroom-broke-the-democrats/",
    "timestamp": "2025-10-27T21:38:39Z"
  },
  {
    "title": "Weapons Contracting Process Seen as Hurdle to Military Readiness",
    "description": "The warnings aren’t new. For year, think tanks, the government, and the media have all raised concerns over America’s lack of military readiness. Solving the... Read More\nThe post Weapons Contracting Process Seen as Hurdle to Military Readiness   appeared fir…",
    "link": "https://www.dailysignal.com/2025/10/27/weapons-contracting-process-seen-as-hurdle-to-military-readiness/",
    "timestamp": "2025-10-27T21:36:47Z"
  },
  {
    "title": "Farrah Abraham Claims She Was Kicked Out of Grad School For Pro-Charlie Kirk Views",
    "description": "Reading Time: 3 minutesFarrah Abraham is lying about why she got kicked out of college.\nFarrah Abraham Claims She Was Kicked Out of Grad School For Pro-Charlie Kirk Views was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/farrah-abraham-claims-she-was-kicked-out-of-grad-school-for-pro-charlie-kirk-views/",
    "timestamp": "2025-10-27T21:36:26Z"
  },
  {
    "title": "U.S. President Donald Trump has praised Japan's new Prime Minister Sanae Takaichi for being ideologically close to the country's former leader Shinzo Abe. What are your thoughts on that?",
    "description": "",
    "link": "https://japantoday.com/category/have-your-say/u.s.-president-donald-trump-has-praised-japan%27s-new-prime-minister-sanae-takaichi-for-being-ideologically-close-to-the-country%27s-former-leader-shinzo-abe.-what-are-your-thoughts-on-that",
    "timestamp": "2025-10-27T21:36:20Z"
  },
  {
    "title": "New Jerseyans expected to pay nearly 175 percent more for health insurance on exchange",
    "description": "The spike is attributed to the expiration of enhanced federal health insurance subsidies, the key sticking point of the federal government shutdown, the...",
    "link": "https://www.politico.com/news/2025/10/27/new-jerseyans-expected-to-pay-174-percent-more-for-health-insurance-on-exchange-00623995",
    "timestamp": "2025-10-27T21:35:43Z"
  },
  {
    "title": "Moscow remains ready for Putin-Trump talks – presidential aide",
    "description": "Russia is prepared for a Putin-Trump summit, presidential aide Yury Ushakov says Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627037-putin-trump-meeting-ushakov/",
    "timestamp": "2025-10-27T21:35:15Z"
  },
  {
    "title": "A Donor-Funded Army Wouldn’t Just Be Illegal—It Would be Dangerous",
    "description": "You don’t need a political-science degree to understand why wealthy individuals cutting secret checks to the president to pay the military is a bad idea.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/trump-donor-funded-military/684713/",
    "timestamp": "2025-10-27T21:35:00Z"
  },
  {
    "title": "Trump Costumes Are Out in Canada This Halloween",
    "description": "Once a Halloween favorite, Donald Trump costumes are no longer in demand in Canada, with costume shops reporting a sharp drop in interest amid ongoing trade tensions. Shop owners say Trump costumes were all the rage in 2016, when he was first running for pres…",
    "link": "https://www.newser.com/story/377586/trump-costumes-are-out-in-canada-this-halloween.html",
    "timestamp": "2025-10-27T21:34:28Z"
  },
  {
    "title": "The US has exported democracy again. Not with bombs this time, but that doesn’t make it better",
    "description": "Washington has effectively bailed out Argentinian President Javier Milei, allowing him continue his chainsaw rampage against his own country Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627021-us-exported-democracy-argentina/",
    "timestamp": "2025-10-27T21:34:24Z"
  },
  {
    "title": "Federal Immigration Agents Accused of Tear-Gassing Peaceful Protestors, Pointing Gun at Veterans in Chicago",
    "description": "The actions would violate a federal order imposed by U.S. District Court Judge Sara L. Ellis to limit the use of nonlethal weapons and other crowd control tactics.",
    "link": "https://reason.com/2025/10/27/federal-immigration-agents-accused-of-tear-gassing-peaceful-protestors-pointing-gun-at-veterans-in-chicago/",
    "timestamp": "2025-10-27T21:32:48Z"
  },
  {
    "title": "Cigna will end drug rebates in many private health plans",
    "description": "The change will initially apply to about 2 million of Cigna’s fully insured members.",
    "link": "https://www.bostonherald.com/2025/10/27/cigna-pbm-drug-rebates/",
    "timestamp": "2025-10-27T21:32:29Z"
  },
  {
    "title": "Cigna will end drug rebates in many private health plans",
    "description": "The change will initially apply to about 2 million of Cigna’s fully insured members.",
    "link": "https://www.denverpost.com/2025/10/27/cigna-pbm-drug-rebates/",
    "timestamp": "2025-10-27T21:32:29Z"
  },
  {
    "title": "Canada needs to invest in its youth if it wants economy to grow, retiring CIBC CEO says",
    "description": "Despite the current economic hurdles and United States president \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n ’s \n \n \n \n \n \n \n \n \n \n tariff threats\n \n \n \n \n \n \n \n \n \n , Canada “will be OK,” says \n \n \n \n \n \n \n \n \n \n Canadian Imperial Bank of Commerce\n \n…",
    "link": "https://biztoc.com/x/f3ba54f568bc9793",
    "timestamp": "2025-10-27T21:30:57Z"
  },
  {
    "title": "President Trump Describes The Back-to-Back U.S. Navy Aircraft Crashes in The South China Sea As “Very Unusual”",
    "description": "The U.S.\nThe post President Trump Describes The Back-to-Back U.S. Navy Aircraft Crashes in The South China Sea As “Very Unusual” appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/president-trump-describes-back-back-u-s-navy/",
    "timestamp": "2025-10-27T21:30:44Z"
  },
  {
    "title": "AOC Mocks Trump Over Low IQ Claim: 'Did Those Doctors Ask You To Draw a Clock By Any Chance?'",
    "description": "Democratic Rep. Alexandria Ocasio-Cortez mocked President Donald Trump after he claimed she \"is low IQ.\"",
    "link": "https://www.ibtimes.com/aoc-mocks-trump-over-low-iq-claim-did-those-doctors-ask-you-draw-clock-any-chance-3788582",
    "timestamp": "2025-10-27T21:30:26Z"
  },
  {
    "title": "The GOP's move to take Mamdani national: From the Politics Desk",
    "description": "Republicans are increasingly eager to elevate New York City mayoral front-runner Zohran Mamdani ahead of next year's midterm elections.",
    "link": "https://www.nbcnews.com/politics/politics-news/gop-move-take-mamdani-national-politics-desk-rcna240141",
    "timestamp": "2025-10-27T21:30:00Z"
  },
  {
    "title": "Anwar Turns Malaysia Into Stage for Dealmaking With Trump’s Help",
    "description": "From the moment US President Donald Trump stepped off the plane in Kuala Lumpur on Sunday, it was clear that he and his Malaysian counterpart Anwar Ibrahim shared a rapport.",
    "link": "https://financialpost.com/pmn/business-pmn/anwar-turns-malaysia-into-stage-for-dealmaking-with-trumps-help",
    "timestamp": "2025-10-27T21:25:09Z"
  },
  {
    "title": "Canada needs to invest in its youth if it wants economy to grow, retiring CIBC CEO says",
    "description": "Retiring CIBC CEO Victor Dodig said Canada needs to implement policies that can help young people in order for its economy to grow. Read on.",
    "link": "https://financialpost.com/fp-finance/banking/canada-invest-youth-economy-grow-cibc-ceo",
    "timestamp": "2025-10-27T21:25:01Z"
  },
  {
    "title": "Trump administation narrows list of potential Federal Reserve chairs to 5",
    "description": "WASHINGTON (AP) — Treasury Secretary Scott Bessent on Monday confirmed the names of five candidates to replace Jerome Powell as chair of the powerful Federal Reserve next year. On an Air Force One flight to Asia with President Donald Trump, Bessent said he wo…",
    "link": "https://financialpost.com/pmn/trump-administation-narrows-list-of-potential-federal-reserve-chairs-to-5",
    "timestamp": "2025-10-27T21:24:47Z"
  },
  {
    "title": "Push for Ukraine ceasefire collapses",
    "description": "Talks between Donald Trump and Vladimir Putin were called off after the Russian president refused to compromise on his demands",
    "link": "https://theweek.com/politics/ukraine-ceasefire-collapses-trump-putin",
    "timestamp": "2025-10-27T21:24:34Z"
  },
  {
    "title": "White House claims 9th war ended under Trump as GameStop declares end to Console Wars",
    "description": "GameStop responded with an edited image of President Donald Trump shaking hands with Spartan-117 aka \"Master Chief,\" the main character of the Halo franchise. The White House, this week, jokingly added the \"Console Wars\" to the list of conflicts ended under t…",
    "link": "https://freerepublic.com/focus/f-chat/4348987/posts",
    "timestamp": "2025-10-27T21:23:11Z"
  },
  {
    "title": "The annual 'check-in' with ICE: Now a fraught event for migrants",
    "description": "The line forms for immigrants awaiting check-ins with Immigration and Customs Enforcement agents at 26 Federal Plaza, the federal government complex in Lower Manhattan.\n \n\nMore and more immigrants are being arrested when they show up for their appointments, a…",
    "link": "https://gothamist.com/news/the-annual-check-in-with-ice-now-a-fraught-event-for-migrants",
    "timestamp": "2025-10-27T21:23:00Z"
  },
  {
    "title": "Trump will meet Japan’s new prime minister and address US troops in next stop on Asia trip",
    "description": "Trump seeks $550 billion in Japanese investment to reduce U.S. tariffs.",
    "link": "https://www.bostonherald.com/2025/10/27/trump-japan-visit/",
    "timestamp": "2025-10-27T21:22:58Z"
  },
  {
    "title": "Stormy Daniels, Joey Buttafuoco and Steve Martin: Judd Apatow reveals his most hilarious, ridiculous behind-the-scenes moments",
    "description": "The comedy mastermind has a new memoir out.",
    "link": "https://pagesix.com/2025/10/27/entertainment/stormy-daniels-joey-buttafuoco-and-steve-martin-judd-apatow-reveals-his-most-hilarious-ridiculous-behind-the-scenes-moments/",
    "timestamp": "2025-10-27T21:22:42Z"
  },
  {
    "title": "A federal workers' union just ratcheted up the shutdown pressure on Dems",
    "description": "The union of federal workers, AFGE, condemned the government shutdown — but Democrats need to worry more, especially with a food stamps crisis looming.",
    "link": "https://www.msnbc.com/top-stories/latest/government-shutdown-democrats-federal-union-afge-food-stamps-rcna240072",
    "timestamp": "2025-10-27T21:21:51Z"
  },
  {
    "title": "Hunter Biden Goes Scorched-Earth On Trump Cuts: '14 Million People Will Die'",
    "description": "He deemed the current state of the Trump administration his \"nightmare scenario,\" noting: \"We’re not sliding into autocracy. We’re right in the middle of it.\"",
    "link": "https://www.huffpost.com/entry/hunter-biden-trump-usaid-cuts_n_68ffbfa3e4b0ebfddfbb441a",
    "timestamp": "2025-10-27T21:21:14Z"
  },
  {
    "title": "'The View' Warns That Trump's Third-Term Threats Are No Joke (Kelby Vera/HuffPost)",
    "description": "Kelby Vera / HuffPost:\n‘The View’ Warns That Trump's Third-Term Threats Are No Joke  —  “Well, you-know-who told us he was going to be a dictator on day one and, damn, if he isn't a dictator!”  Whoopi Goldberg told audiences on Monday.  —  “The View” just war…",
    "link": "https://www.memeorandum.com/251027/p105",
    "timestamp": "2025-10-27T21:20:01Z"
  },
  {
    "title": "UFC Fighter Who Vowed To Take A Bullet For Trump Has Revelation (David Moye/HuffPost)",
    "description": "David Moye / HuffPost:\nUFC Fighter Who Vowed To Take A Bullet For Trump Has Revelation  —  Bryce Mitchell, who once called Hitler a “good guy,” made a wild claim of biblical proportions about the president.  —  Donald Trump has one less person willing to take…",
    "link": "https://www.memeorandum.com/251027/p104",
    "timestamp": "2025-10-27T21:20:01Z"
  },
  {
    "title": "In next stop on Asia trip, Trump will meet Japan’s new prime minister and address U.S. troops",
    "description": "President Donald Trump begins one of his busiest days of his Asia trip on Tuesday, meeting with the new Japanese prime minister, speaking to U.S. troops aboard an aircraft carrier and mingling with business leaders.",
    "link": "https://biztoc.com/x/b53fa43ae044d839",
    "timestamp": "2025-10-27T21:19:39Z"
  },
  {
    "title": "Trump administation narrows list of potential Federal Reserve chairs to 5",
    "description": "Treasury Secretary Scott Bessent on Monday confirmed the names of five candidates to replace Jerome Powell as chair of the powerful Federal Reserve next year...",
    "link": "https://finance.yahoo.com/news/trump-administation-narrows-list-potential-211823658.html",
    "timestamp": "2025-10-27T21:18:23Z"
  },
  {
    "title": "DHS: Cowardly Chicago Mayor says, “Let’s move on” when asked about an illegal alien who grabbed a woman, bashed her head into a sidewalk, knocked her unconscious, and raped her,",
    "description": "Homeland Security @DHSgov COWARDLY, @ChicagosMayor . When asked about an illegal alien who grabbed a woman, bashed her head into a sidewalk, knocked her unconscious, and raped her, his only response was “Let’s move on.” Brandon Johnson’s sanctuary city polici…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348986/posts",
    "timestamp": "2025-10-27T21:18:01Z"
  },
  {
    "title": "Trump Seemingly Confuses Dementia Test for IQ Test, Brags About His Results",
    "description": "President Donald Trump is seemingly having some confusion about the test he just took. The 79-year-old President of the United States spoke to reporters on Monday (October 27) on Air Force One. During the meeting with press, he seemingly bragged about his res…",
    "link": "https://www.justjared.com/2025/10/27/trump-seemingly-confuses-dementia-test-for-iq-test-brags-about-results/",
    "timestamp": "2025-10-27T21:17:25Z"
  },
  {
    "title": "Trump Seemingly Confuses Dementia Test for IQ Test, Brags About His Results",
    "description": "President Donald Trump is seemingly having some confusion about the test he just took. The 79-year-old President of the United States spoke to reporters on Monday (October 27) on Air Force One. During the meeting with press, he seemingly bragged about his res…",
    "link": "https://www.justjared.com/2025/10/27/trump-seemingly-confuses-dementia-test-for-iq-test-brags-about-his-results/",
    "timestamp": "2025-10-27T21:17:25Z"
  },
  {
    "title": "In next stop on Asia trip, Trump will meet Japan’s new prime minister and address U.S. troops",
    "description": "President Donald Trump begins one of his busiest days of his Asia trip on Tuesday, meeting with the new Japanese prime minister, speaking to U.S. troops aboard an aircraft carrier and mingling with business leaders.",
    "link": "https://www.pbs.org/newshour/world/in-next-stop-on-asia-trip-trump-will-meet-japans-new-prime-minister-and-address-u-s-troops",
    "timestamp": "2025-10-27T21:17:04Z"
  },
  {
    "title": "Wall Street hits new highs on tech earnings, trade optimism | Honolulu Star-Advertiser",
    "description": "Wall Street’s main indexes posted record closing highs for the second day in a row today as investors were hopeful about the prospects for a U.S.-China trade deal and looked forward to a week packed with high-profile technology earnings and a widely expected …",
    "link": "https://www.staradvertiser.com/2025/10/27/breaking-news/wall-street-hits-new-highs-on-tech-earnings-trade-optimism/",
    "timestamp": "2025-10-27T21:17:03Z"
  },
  {
    "title": "JORGE MARTINEZ: When Suffering Becomes A Democratic Campaign Tactic",
    "description": "When a top Democrat says that “families are going to suffer” because it gives their party “leverage,” it should make every American pause.",
    "link": "https://dailycaller.com/2025/10/27/opinion-when-suffering-becomes-a-democratic-campaign-tactic-jorge-martinez/",
    "timestamp": "2025-10-27T21:15:54Z"
  },
  {
    "title": "Gold prices drive S&P/TSX composite lower, U.S. markets rise on China trade rhetoric",
    "description": "TORONTO — Canada’s main stock index finished lower, weighed down by declining gold prices, while U.S. stock markets hit new highs amid positive U.S.-China trade sentiment. Dustin Reid, chief strategist for fixed income at Mackenzie Investments, said falling g…",
    "link": "https://financialpost.com/pmn/gold-prices-drive-sp-tsx-composite-lower-u-s-markets-rise-on-china-trade-rhetoric",
    "timestamp": "2025-10-27T21:11:04Z"
  },
  {
    "title": "Sean 'Diddy' Combs' Prison Release Date Revealed... as Disgraced Rapper Pins Pardon Hopes on Trump While He Rots Behind Bars",
    "description": "Sean 'Diddy' Combs has been given a release date one-month after he was sentenced to 50-months behind bars.",
    "link": "https://radaronline.com/p/sean-diddy-combs-prison-release-date-revealed/",
    "timestamp": "2025-10-27T21:10:00Z"
  }
]