[
  {
    "title": "'60 Minutes' holds off on airing critical piece on Trump deportation policy",
    "description": "'60 Minutes' holds off on airing critical piece on Trump deportation policylocal10.com",
    "link": "https://www.local10.com//business/2025/12/22/60-minutes-holds-off-on-airing-critical-piece-on-trump-deportation-policy/",
    "timestamp": "2025-12-22T15:38:28Z"
  },
  {
    "title": "Illegal settlement expansion: How Israel is redrawing occupied West Bank",
    "description": "Israel's approval of 19 new settlements stands to redraw occupied West Bank, undermining prospect of two-state solution.",
    "link": "https://www.aljazeera.com/news/2025/12/22/illegal-settlement-expansion-how-israel-is-redrawing-occupied-west-bank",
    "timestamp": "2025-12-22T15:37:18Z"
  },
  {
    "title": "Left-Wing Group Tries Turning Military Officials Against Trump’s Cartel Bombing Campaign",
    "description": "A left-wing group advising military members who disagree with Trump's orders says officials are seeking its help over boat strikes targeting drug traffickers.",
    "link": "https://dailycaller.com/2025/12/22/trump-venezuela-boat-strikes-fentanyl-leftist-military/",
    "timestamp": "2025-12-22T15:36:37Z"
  },
  {
    "title": "US offers undocumented migrants $3,000 for voluntary deportation",
    "description": "The US offers undocumented migrants a $3,000 incentive for voluntary deportation through the CBP Home app, available until the end of the year.\n\nRead More: https://punchng.com/us-offers-undocumented-migrants-3000-for-voluntary-deportation/",
    "link": "https://punchng.com/us-offers-undocumented-migrants-3000-for-voluntary-deportation/",
    "timestamp": "2025-12-22T15:35:48Z"
  },
  {
    "title": "Shein Can't Sell Sex Toys Unless It Checks IDs, French Court Says",
    "description": "Laws requiring porn platforms to age-check visitors are becoming \"a Swiss army knife for the government.\"",
    "link": "https://reason.com/2025/12/22/shein-cant-sell-sex-toys-unless-it-checks-ids-french-court-says/",
    "timestamp": "2025-12-22T15:34:19Z"
  },
  {
    "title": "Trump administration pauses 5 offshore wind projects on the East Coast",
    "description": "The pause is effective immediately and will give the Interior Department time to work with the Defense Department and other agencies to assess the possible ways to mitigate any security risks posed by the projects,",
    "link": "https://www.bostonherald.com/2025/12/22/trump-offshore-wind-projects-security/",
    "timestamp": "2025-12-22T15:33:15Z"
  },
  {
    "title": "J.D. Vance Responds to Nicki Minaj Accidentally Calling Him 'The Assassin'",
    "description": "J.D. Vance is breaking his silence after Nicki Minaj let out a major verbal slip at the TPUSA summit this weekend -- accidentally referring to him as \"the assassin\" -- but instead of clapping back, the VP is actually taking the high road. Vance…\n Permalink",
    "link": "https://www.tmz.com/2025/12/22/jd-vance-responds-nicki-minaj-assassin/",
    "timestamp": "2025-12-22T15:32:14Z"
  },
  {
    "title": "Larry Ellison puts $40 billion behind Paramount's Warner Bros. bid",
    "description": "Paramount wants to buy all of Warner Bros. Discovery, taking a hostile offer directly to shareholders after the board rejected it in favor of a bid by...",
    "link": "https://qz.com/larry-ellison-paramount-warner-bros-discovery-netflix",
    "timestamp": "2025-12-22T15:30:43Z"
  },
  {
    "title": "Trump Pauses Project Believed to Cause ‘National Security Risks’",
    "description": "President Donald Trump’s Department of the Interior is pausing offshore wind project construction due to “national security risks.” “Due to national security concerns identified by... Read More\nThe post Trump Pauses Project Believed to Cause ‘National Securit…",
    "link": "https://www.dailysignal.com/2025/12/22/trump-pauses-project-believed-cause-national-security-risks/",
    "timestamp": "2025-12-22T15:29:00Z"
  },
  {
    "title": "What’s up with… 6G in the US, Telecom Italia, MásOrange",
    "description": "Trump aims to clear 7GHz band for 6G in USTelecom Italia confirms €1bn licence fee refundMásOrange deploys Future Connections rApp",
    "link": "https://www.telecomtv.com/content/6g/what-s-up-with-6g-in-the-us-telecom-italia-m-sorange-54573/",
    "timestamp": "2025-12-22T15:28:42Z"
  },
  {
    "title": "Trump administration pauses 5 offshore wind projects on the East Coast",
    "description": "The Trump administration is suspending leases for five large-scale offshore wind projects under construction on the East Coast due to what it said were national security risks identified by the Pentagon",
    "link": "https://www.boston25news.com/news/business/trump-administration/MAUQTPRLAI6DHNFZTAILBBQCIM/",
    "timestamp": "2025-12-22T15:27:26Z"
  },
  {
    "title": "Trump administration pauses 5 offshore wind projects on the East Coast",
    "description": "The Trump administration is suspending leases for five large-scale offshore wind projects under construction on the East Coast due to what it said were national security risks identified by the Pentagon.",
    "link": "https://www.clickondetroit.com/business/2025/12/22/trump-administration-pauses-5-offshore-wind-projects-on-the-east-coast/",
    "timestamp": "2025-12-22T15:26:33Z"
  },
  {
    "title": "Trump administration pauses 5 offshore wind projects on the East Coast",
    "description": "WASHINGTON (AP) — The Trump administration said Monday it is pausing leases for five large-scale offshore wind projects under construction in the East Coast due to unspecified national security risks identified by the Pentagon. The pause is effective immediat…",
    "link": "https://financialpost.com/pmn/trump-administration-pauses-5-offshore-wind-projects-on-the-east-coast",
    "timestamp": "2025-12-22T15:26:01Z"
  },
  {
    "title": "'The bell of stupidity': Conservative's Christmas video lampoons Trump's latest speech",
    "description": "President Donald Trump was supposed to prioritize the economy at a MAGA rally last week — but instead rambled about former Secretary of State Hillary Clinton, Rep. Ilhan Omar (D-MN) and other familiar foes.In a Christmas-themed video, The Lincoln Project's Ri…",
    "link": "https://www.rawstory.com/alternet-posts/rick-wilson-trump-economy/",
    "timestamp": "2025-12-22T15:26:00Z"
  },
  {
    "title": "Addiction-stricken community struggles to keep a syringe program going after Trump's order",
    "description": "Decades of research show syringe programs are extremely effective at preventing infectious disease among intravenous drug users and referring them to treatment",
    "link": "https://abcnews.go.com/Health/wireStory/addiction-stricken-community-struggles-syringe-program-after-trumps-128617553",
    "timestamp": "2025-12-22T15:25:50Z"
  },
  {
    "title": "‘This just got real’: Trump appoints American governor as special envoy to Greenland, sparking global backlash",
    "description": "'This isn't a joke anymore. It's phase one'",
    "link": "https://www.wnd.com/2025/12/this-just-got-real-trump-appoints-american-governor/",
    "timestamp": "2025-12-22T15:24:30Z"
  },
  {
    "title": "US war hawk senator calls for seizure of Russian oil tankers",
    "description": "US Senator Lindsey Graham has urged Washington to ramp up sanctions against Russia if current Ukraine peace efforts fail Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629884-lindsey-graham-sanctions-russia/",
    "timestamp": "2025-12-22T15:23:49Z"
  },
  {
    "title": "Nicki Minaj Makes Surprise Appearance at Turning Point USA Event",
    "description": "It's times like these we wish we hadn't already used the headline Nicki Minaj Had Quite the Weekend. The rapper, who's been spiralling down",
    "link": "https://exclaim.ca/music/article/nicki-minaj-makes-surprise-appearance-at-turning-point-usa-event",
    "timestamp": "2025-12-22T15:21:58Z"
  },
  {
    "title": "Trump administration pauses 5 offshore wind projects on the East Coast",
    "description": "The Trump administration is pausing leases for five large-scale offshore wind projects under construction in the East Coast due to unspecified national security risks identified by the Pentagon. The pause is effective immediately and will give the Interior De…",
    "link": "https://apnews.com/article/trump-offshore-wind-energy-climate-c0ac1e447c93126327f1922327921aa0",
    "timestamp": "2025-12-22T15:20:14Z"
  },
  {
    "title": "Cross-Ideological Coalition to Congress: Rein in Trump’s National Guard Deployments",
    "description": "Last Thursday, five organizations from across the ideological spectrum sent a letter asking Congress to rein in the president’s domestic deployments of the National Guard. The letter follows yet another court ruling regarding the legality of the deployments. …",
    "link": "https://www.commondreams.org/newswire/cross-ideological-coalition-to-congress-rein-in-trumps-national-guard-deployments",
    "timestamp": "2025-12-22T15:19:11Z"
  },
  {
    "title": "Trump Supreme Court battle could be dismantled by Congress members' own history",
    "description": "New evidence is emerging that could deal a major blow to President Donald Trump's case for stripping birthright citizenship to the children of immigrants.The president has asked the U.S. Supreme Court to restore “the original meaning” of the 14th Amendment, w…",
    "link": "https://www.rawstory.com/trump-birthright-citizenship-2674821409/",
    "timestamp": "2025-12-22T15:17:13Z"
  },
  {
    "title": "“Conspiracy Theorists” Right Again on 2020 Georgia Election Irregularities",
    "description": "Five years after the fact, Georgia election officials have admitted that 315,000 votes in the 2020 presidential election lacked the necessary signature from poll workers and should not have been counted. President Donald Trump was unjustly indicted for allegi…",
    "link": "https://freerepublic.com/focus/f-chat/4358535/posts",
    "timestamp": "2025-12-22T15:14:31Z"
  },
  {
    "title": "Expect Turbulent Asset Markets in 2026",
    "description": "After three years of extraordinary returns, investors should start worrying about the inevitable crash that follows periods of sustained euphoria. But while the odds of a major market correction in the next few years appear uncomfortably high, heading for the…",
    "link": "https://www.project-syndicate.org/commentary/powerful-headwinds-facing-global-economy-in-2026-by-kenneth-rogoff-2025-12",
    "timestamp": "2025-12-22T15:13:49Z"
  },
  {
    "title": "Heritage Foundation Undergoes Mass Staff Exodus as Cracks Open on the New Right",
    "description": "The divisions are no longer just between pro-Trump and anti-Trump conservatives.",
    "link": "https://reason.com/2025/12/22/heritage-foundation-undergoes-mass-staff-exodus-as-cracks-open-on-the-new-right/",
    "timestamp": "2025-12-22T15:11:47Z"
  },
  {
    "title": "Justice Department Ends Clinton Rule Giving Welfare to Migrants",
    "description": "The Department of Justice is closing a Democrat-created bureaucratic loophole that has allowed legal and illegal migrants to get welfare since 1997, despite a 1996 law limiting aid to citizens.\nThe post Justice Department Ends Clinton Rule Giving Welfare to M…",
    "link": "https://www.breitbart.com/economy/2025/12/22/justice-department-ends-clinton-rule-giving-welfare-to-migrants/",
    "timestamp": "2025-12-22T15:11:20Z"
  },
  {
    "title": "The Trump Administration’s Guide to Christmas Giving",
    "description": "A piece of East Wing Rubble? An MRI for no reason? The options are endless!",
    "link": "https://www.theatlantic.com/newsletters/2025/12/trump-administration-christmas-gift-guide/685379/",
    "timestamp": "2025-12-22T15:10:00Z"
  },
  {
    "title": "Denmark, Greenland vow that US won't take over Greenland",
    "description": "The leaders of Denmark and Greenland insisted Monday that the U.S. will not take over Greenland and demanded respect for their territorial integrity.",
    "link": "https://www.wcvb.com/article/denmark-greenland-us-take-over-greenland-trump-envoy/69837554",
    "timestamp": "2025-12-22T15:08:07Z"
  },
  {
    "title": "Nicki Minaj Reveals Why She Spoke Out for Nigerian Christians Amid Troubling Reports",
    "description": "American rapper Nicki Minaj has revealed her personal ties to Nigeria and why she decided to speak out about reported attacks on Christian worshippers",
    "link": "https://www.legit.ng/entertainment/celebrities/1689293-nicki-minaj-reveals-spoke-nigerian-christians/",
    "timestamp": "2025-12-22T15:07:53Z"
  },
  {
    "title": "The Epstein files: Who appears in the documents and when will more be released?",
    "description": "Thousands of documents were released by the US Department of Justice on Friday.",
    "link": "https://www.thejournal.ie/epstein-files-us-justice-department-trump-clinton-6910810-Dec2025/",
    "timestamp": "2025-12-22T15:03:58Z"
  },
  {
    "title": "Watch: JD Vance Gets Fiery Response from AmFest Crowd After Declaring the U.S. 'a Christian Nation'",
    "description": "Watch: JD Vance Gets Fiery Response from AmFest Crowd After Declaring the U.S. 'a Christian Nation'westernjournal.com",
    "link": "https://www.westernjournal.com/watch-jd-vance-gets-fiery-response-amfest-crowd-declaring-u-s-christian-nation/",
    "timestamp": "2025-12-22T15:02:03Z"
  },
  {
    "title": "Will Solana Flip Ethereum? Revenue Numbers Show Disturbing Trend",
    "description": "Solana is set to flip Ethereum in revenue numbers for the first time ever. Solana co-founder Anatoly Yakovenko commented on this development, highlighting the gap between both networks while also questioning how they could sustain this trend.  Solana On Cours…",
    "link": "https://bitcoinist.com/will-solana-flip-ethereum-revenue/",
    "timestamp": "2025-12-22T15:00:23Z"
  },
  {
    "title": "The Bay Area’s Year in Photos: Protests, Political Upheaval and Joyous Resistance",
    "description": "KQED photographers spent the year capturing the biggest stories affecting the Bay Area and California. Here’s a collection of some of the highlights.",
    "link": "https://www.kqed.org/news/12067662/the-bay-areas-year-in-photos-protests-political-upheaval-and-joyous-resistance",
    "timestamp": "2025-12-22T15:00:03Z"
  },
  {
    "title": "The Old Oil Case Behind Trump's Venezuela Threats",
    "description": "Last Tuesday evening, President Donald Trump posted a striking message on Truth Social calling for a “total and complete blockade” of all sanctioned oil tankers entering or leaving Venezuela. In the post, Trump cited asset theft, terrorism, and human traffick…",
    "link": "https://oilprice.com/Energy/Energy-General/The-Old-Oil-Case-Behind-Trumps-Venezuela-Threats.html",
    "timestamp": "2025-12-22T15:00:00Z"
  },
  {
    "title": "The Democrats Had One Huge Shutdown Win. Trump Tried to Thwart It. He Just Failed.",
    "description": "Congress struck back in a little-noticed move that shifted power away from the Trump administration.",
    "link": "https://slate.com/news-and-politics/2025/12/democrats-shutdown-win-trump-firings-blocked.html",
    "timestamp": "2025-12-22T15:00:00Z"
  },
  {
    "title": "JPMorgan exploring crypto trading to institutional clients, Bloomberg News reports",
    "description": "JPMorgan Chase ‍is considering offering cryptocurrency ​trading to its institutional clients, Bloomberg News reported ⁠on Monday, underscoring Wall Street banks' growing participation in the digital assets sector.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/jpmorgan-exploring-crypto-trading-to-institutional-clients-bloomberg-news-reports/articleshow/126124169.cms",
    "timestamp": "2025-12-22T14:58:46Z"
  },
  {
    "title": "Imperialism and Continuity: US Foreign Policy in Latin America and the Caribbean",
    "description": "The argument that the criminal US government is now focusing its attention on Latin America and the Caribbean after having forgotten about it for many years does not correspond to the reality. \nThe post Imperialism and Continuity: US Foreign Policy in Latin A…",
    "link": "https://www.globalresearch.ca/imperialism-continuity-us-foreign-policy-latin-america-caribbean/5909807",
    "timestamp": "2025-12-22T14:57:14Z"
  },
  {
    "title": "Europe Salvages Credibility? EU Failed to Agree to Loan Russian Frozen Assets to Ukraine",
    "description": "“Had we left Brussels divided today, Europe would have walked away from geopolitical relevance,” Belgian Prime Minister Bart De Wever told reporters. “It would have been a total disaster.”\nEuropean governments agreed to provide a €90 billion loan facility …\nT…",
    "link": "https://www.globalresearch.ca/europe-salvages-credibility-eu-failed-agree-loan-russian-frozen-assets-ukraine/5909894",
    "timestamp": "2025-12-22T14:53:51Z"
  },
  {
    "title": "India at advanced stage of discussions on trade pact with US: Goyal",
    "description": "“We are already at an advanced stage in our discussions with the US,” Goyal said replying to a question on the status of the India-US trade talks at a briefing on the conclusion of the India-New Zealand FTA on Monday.",
    "link": "https://www.thehindubusinessline.com/economy/india-at-advanced-stage-of-discussions-on-trade-pact-with-us-goyal/article70426687.ece",
    "timestamp": "2025-12-22T14:53:06Z"
  },
  {
    "title": "Oracle's Larry Ellison offers $40.4 billion guarantee to beef up Paramount's Warner Bros bid",
    "description": "Oracle co-founder Larry Ellison has stepped ⁠in to personally guarantee $40.4 billion in Paramount Skydance's latest effort to pry Warner Bros Discovery away from selling its prized Hollywood assets to streaming giant Netflix.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/oracles-larry-ellison-offers-40-4-billion-guarantee-to-beef-up-paramounts-warner-bros-bid/articleshow/126124095.cms",
    "timestamp": "2025-12-22T14:52:08Z"
  },
  {
    "title": "The Battle for the Past: How Power Rewrites History to Secure the Present",
    "description": "History is never a neutral record of events, nor is it a simple accumulation of facts arranged in chronological order. It is a contested space where memory, identity, and legitimacy collide, shaped as much by power as by evidence. The …\nThe post The Battle fo…",
    "link": "https://www.globalresearch.ca/power-rewrites-history-secure-present/5909891",
    "timestamp": "2025-12-22T14:51:15Z"
  },
  {
    "title": "Epstein's alleged victims accuse DOJ of legal violations over state of files released",
    "description": "The DOJ faced a Friday deadline imposed by Congress to release a massive cache of records gathered during government investigations into the sex offender.",
    "link": "https://abcnews.go.com/US/epsteins-alleged-victims-accuse-doj-legal-violations-state/story?id=128612219",
    "timestamp": "2025-12-22T14:49:58Z"
  },
  {
    "title": "Jimmy Kimmel to make Christmas Day address on UK TV saying 2025 a ‘really great year’ for fascism",
    "description": "Kimmel has been tapped to host Channel 4’s \"Alternative Christmas Message,\" a long-running UK broadcast that airs on Christmas Day.",
    "link": "https://nypost.com/2025/12/22/media/jimmy-kimmel-to-make-christmas-address-on-uk-tv-saying-2025-great-year-for-fascism/",
    "timestamp": "2025-12-22T14:49:17Z"
  },
  {
    "title": "Big boost for Cryptocurrency as largest U.S. bank mulls offering crypto trading to clients, claims report",
    "description": "JPMorgan Chase's efforts are in early stages and concrete ‍plans will depend on whether there is ‍enough ⁠demand ⁠for any specific product, the report said.",
    "link": "https://economictimes.indiatimes.com/news/international/us/cryptocurrency-trading-jpmorgan-chase-crypto-latest-news/articleshow/126123966.cms",
    "timestamp": "2025-12-22T14:48:39Z"
  },
  {
    "title": "How America’s Government Won Back Control Over Its Bolivian Colony and Tries Now to Do the Same Thing Against Its Former Venezuelan Colony",
    "description": "When the White-supremacist South African and then American centibillionaire Elon Musk blurted out online during the evening of 24 July 2020 “We will coup whoever we want! Deal with it.”\nThe post How America’s Government Won Back Control Over Its Bolivian Colo…",
    "link": "https://www.globalresearch.ca/america-won-back-control-bolivian-colony/5909923",
    "timestamp": "2025-12-22T14:47:12Z"
  },
  {
    "title": "The Blockade of Venezuela and the Collapse of the Global Maritime Order",
    "description": "On December 16, 2025, the United States blockaded Venezuela from the sea without declaring war and without authorization from the United Nations Security Council. This action is not a military intervention in the classical sense. It is a sign of …\nThe post Th…",
    "link": "https://www.globalresearch.ca/blockade-venezuela-collapse-the-global-maritime-order/5909940",
    "timestamp": "2025-12-22T14:45:23Z"
  },
  {
    "title": "Stacey Abrams Led Climate Group Caught Pocketing $5 Million of $2 billion Biden Grant before Trump Axed It",
    "description": "A series of tax documents have revealed that Rewiring America, a climate group that Democratic activist Stacey Abrams served as senior counsel for, banked over $5 million in federal climate funding just before President Donald Trump slashed the grant, which c…",
    "link": "https://freerepublic.com/focus/f-bloggers/4358531/posts",
    "timestamp": "2025-12-22T14:39:05Z"
  },
  {
    "title": "’60 Minutes’ holds off on airing critical piece on Trump deportation policy",
    "description": "The move is sure to increase scrutiny on CBS and “60 Minutes,” which Trump sued last fall over an interview with Kamala Harris and has recently complained about stories critical of him.",
    "link": "https://www.bostonherald.com/2025/12/22/60-minutes-cecot-piece-weiss/",
    "timestamp": "2025-12-22T14:38:05Z"
  },
  {
    "title": "The Three-Step Guide to Fixing Affordability",
    "description": "First, stop making things worse.",
    "link": "https://www.theatlantic.com/ideas/2025/12/affordability-housing-healthcare-prices/685377/",
    "timestamp": "2025-12-22T14:37:05Z"
  },
  {
    "title": "Crockett fires back at JD Vance's 'street girl' comments, says it's a racist trope",
    "description": "Rep. Jasmine Crockett fired back at Vice President JD Vance after he mocked her \"street-girl persona,\" calling herself authentic and arguing, \"they should be scared.\"",
    "link": "https://www.foxnews.com/media/crockett-fires-back-jd-vances-street-girl-comments-says-its-racist-trope",
    "timestamp": "2025-12-22T14:34:31Z"
  },
  {
    "title": "'A living hell': Morning Mika rips apart CBS' excuse for spiking '60 Minutes' Trump story",
    "description": "A last-minute decision by CBS News chief Bari Weiss to ”spike” a “60 Minutes” segment that was expected to be critical of the Donald Trump administration was hammered on MS NOW on Monday morning, with the entire ‘Morning Joe” panel expressing a mixture of dis…",
    "link": "https://www.rawstory.com/bari-weiss-60-minutes/",
    "timestamp": "2025-12-22T14:30:59Z"
  },
  {
    "title": "Trump admin pausing all off shore wind project construction due to national security concerns (Fox News)",
    "description": "Fox News:\nTrump admin pausing all off shore wind project construction due to national security concerns  —  The move was made after classified reports concluded potential national security risks  —  FIRST ON FOX: President Donald Trump's Department of Interio…",
    "link": "https://www.memeorandum.com/251222/p36",
    "timestamp": "2025-12-22T14:30:00Z"
  },
  {
    "title": "\"60 Minutes\" holds off on airing critical piece on Trump deportation policy",
    "description": "Hours before airtime on Sunday, CBS News' “60 Minutes” held a planned story on President Donald Trump's deportation policy at the order of the network's new editor-in-chief, Bari Weiss. Weiss, the founder of the Free Press website, had sought to get Trump adm…",
    "link": "https://apnews.com/article/60-minutes-trump-weiss-cecot-56c68d45c3d6bc7183f23aa285a70719",
    "timestamp": "2025-12-22T14:26:07Z"
  },
  {
    "title": "Oil Tanker Seized",
    "description": "Plus: What's up with consumer spending, that CECOT segment, and more...",
    "link": "https://reason.com/2025/12/22/oil-tanker-seized/",
    "timestamp": "2025-12-22T14:24:59Z"
  },
  {
    "title": "India's nuclear expansion draws global interest",
    "description": "Landmark nuclear reform opens India's nuclear sector to foreign firms, aiming for massive growth, but critics highlight safety, oversight and supply chain gaps.",
    "link": "https://www.dw.com/en/indias-nuclear-expansion-draws-global-interest/a-75267587",
    "timestamp": "2025-12-22T14:24:00Z"
  },
  {
    "title": "India's nuclear sector to expand, draw foreign capital",
    "description": "Nuclear reform opens India's nuclear sector to foreign firms, but critics highlight safety and supply chain gaps.",
    "link": "https://www.dw.com/en/india-nuclear-sector-to-expand-attract-foreign-capital/a-75267587",
    "timestamp": "2025-12-22T14:24:00Z"
  },
  {
    "title": "Three Shocks that Shook the World in 2025",
    "description": "A new, harder, colder world order was erected on the grave of European ambition in 2025. The year’s enduring lesson is that in an age of existential contests, strategic dependency is the prelude to irrelevance.",
    "link": "https://www.project-syndicate.org/commentary/three-shocks-in-2025-leave-europe-shaken-by-yanis-varoufakis-2025-12",
    "timestamp": "2025-12-22T14:22:32Z"
  },
  {
    "title": "Critics Blast CBS’ Bari Weiss for Pulling ‘60 Minutes’ Report on Trump Deportations: ‘Government-Controlled TV’",
    "description": "Weiss’ decision follows Donald Trump claiming last week that the newsmagazine was treating him “far worse” under new management\nThe post Critics Blast CBS’ Bari Weiss for Pulling ‘60 Minutes’ Report on Trump Deportations: ‘Government-Controlled TV’ appeared f…",
    "link": "https://www.thewrap.com/media-platforms/journalism/bari-weiss-60-minutes-cbs-news-reaction/",
    "timestamp": "2025-12-22T14:22:12Z"
  },
  {
    "title": "China economy grew below 3% in 2025, half of official target, think tank estimates",
    "description": "China's economic growth in 2025 is estimated at a mere 2.5% to 3%. This is far below official targets. A think tank points to a sharp decline in investment. This could impact Beijing's policy decisions. The nation faces challenges in global trade talks.",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-economy-grew-below-3-in-2025-half-of-official-target-think-tank-estimates/articleshow/126123763.cms",
    "timestamp": "2025-12-22T14:21:12Z"
  },
  {
    "title": "2026 Will Probably Be Rough For Car Sales",
    "description": "New car sales are likely to take a dive in 2026 because everything is falling apart, Elon Musk becomes the first person worth $700 billion, and more.",
    "link": "https://www.jalopnik.com/2057969/2026-car-sales-rough/",
    "timestamp": "2025-12-22T14:20:51Z"
  },
  {
    "title": "Trump’s World Liberty Financial token ends 2025 down over 40%",
    "description": "The Trump family’s crypto project, World Liberty Financial, has seen its fair share of controversy, and its token is ending the year significantly down.",
    "link": "https://cointelegraph.com/news/trump-world-liberty-financial-token-ends-2025-down",
    "timestamp": "2025-12-22T14:20:42Z"
  },
  {
    "title": "Are Most European Leaders Deepfakes?",
    "description": "Most readers will not take seriously my proclaimed identity as the Devil’s Advocate. They correctly understand that I may be using it quite simply as a literary ruse. In my columns, I leave clues to establish that identity as nothing more than a prolonged met…",
    "link": "https://www.fairobserver.com/politics/are-most-european-leaders-deepfakes/",
    "timestamp": "2025-12-22T14:20:41Z"
  },
  {
    "title": "60 Minutes Staff in Uproar After Bari Weiss’s Pro-Trump Censorship",
    "description": "It’s already happening: CBS News editor-in-chief Bari Weiss just killed a story on 60 Minutes that would have humiliated President Donald Trump. In a leaked email Sunday evening, CBS News correspondent Sharyn Alfonsi notified her colleagues that Weiss had “sp…",
    "link": "https://newrepublic.com/post/204702/60-minutes-staff-uproar-bari-weiss-pro-trump-censorship-cbs",
    "timestamp": "2025-12-22T14:19:56Z"
  },
  {
    "title": "New US envoy will seek concessions from South Africa – expert",
    "description": "New US envoy to South Africa likely to stir ideological clash between Washington and Pretoria, political analyst Ofentse Donald Davhie said Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629775-new-us-envoy-seek-concessions-south-africa/",
    "timestamp": "2025-12-22T14:19:50Z"
  },
  {
    "title": "After pouring $450 million into Florida real estate, Larry Ellison plans to lure the ultrarich to an exclusive town just minutes from Mar-a-Lago",
    "description": "Ellison bought the aging but glamorous Eau Palm Beach Resort & Spa in August and plans to renovate.",
    "link": "https://finance.yahoo.com/news/pouring-450-million-florida-real-141920418.html",
    "timestamp": "2025-12-22T14:19:20Z"
  },
  {
    "title": "After pouring $450 million into Florida real estate, Larry Ellison plans to lure the ultra-rich to an exclusive town just minutes from Mar-a-Lago",
    "description": "Ellison bought the aging but glamorous Eau Palm Beach Resort & Spa in the 400-resident town of Manalapan, Fla.",
    "link": "https://fortune.com/article/larry-ellison-florida-real-estate-450-million-mar-a-lago/",
    "timestamp": "2025-12-22T14:19:20Z"
  },
  {
    "title": "Iran holds missile drills in various cities: Report",
    "description": "DUBAI: Iran held missile drills in various cities on Monday (Dec 22), state media reported, citing unnamed sources and witnesses, in what was the second such reported exercise in a month.NBC News reported on Saturday that US President Donald Trump was to be",
    "link": "https://www.channelnewsasia.com/world/iran-holds-missile-drills-5673036",
    "timestamp": "2025-12-22T14:18:21Z"
  },
  {
    "title": "Is Trump deliberately redacting Epstein files to shield himself?",
    "description": "Removal of image from publicly released documents prompts accusations of political interference by justice department",
    "link": "https://theweek.com/politics/trump-epstein-files-redactions",
    "timestamp": "2025-12-22T14:18:05Z"
  },
  {
    "title": "CBS postpones ‘60 Minutes’ story on Trump deportees at the last minute",
    "description": "CBS News pulled a “60 Minutes” report about the Trump administration sending detainees to a maximum security “mega prison” in El Salvador just hours before its scheduled broadcast",
    "link": "https://www.nbcnews.com/news/us-news/cbs-60-minutes-story-trump-deportees-el-salvador-bari-weiss-rcna250441",
    "timestamp": "2025-12-22T14:16:22Z"
  },
  {
    "title": "Mike Pence Poaching Heritage Foundation Staff Amid Backlash Over Anti-Semitism",
    "description": "Former Vice President Mike Pence is poaching top officials from conservative think tank the Heritage Foundation, as staff flee amid rising concerns about the organization’s recent controversies surrounding anti-semitism. The former second in command to Presid…",
    "link": "https://www.mediaite.com/media/news/mike-pence-poaching-heritage-foundation-staff-amid-backlash-over-anti-semitism/",
    "timestamp": "2025-12-22T14:15:34Z"
  },
  {
    "title": "Turkey's top officials visit Syria as deadline for Kurdish integration looms",
    "description": "Turkey’s top diplomat and military and intelligence chiefs visited Syria on Monday as a deadline to implement a deal between authorities in Damascus and...",
    "link": "https://www.yahoo.com/news/articles/turkeys-top-officials-visit-syria-141513568.html",
    "timestamp": "2025-12-22T14:15:13Z"
  },
  {
    "title": "Trump's favorite excuse in 2025: \"I don't know\" (Amanda Marcotte/Salon)",
    "description": "Amanda Marcotte / Salon:\nTrump's favorite excuse in 2025: “I don't know”  —  From Epstein to MRIs, the president fakes ignorance  —  Donald Trump is too slow to pick up on important information and too lazy to learn.  —  No, this is not the assessment of some…",
    "link": "https://www.memeorandum.com/251222/p33",
    "timestamp": "2025-12-22T14:15:03Z"
  },
  {
    "title": "US Suspends Offshore Wind Leases, Citing National Security",
    "description": "The Trump administration is suspending leases to five wind farms under construction off the US East coast over national security concerns, the latest move in the government’s broad assault on renewable energy.",
    "link": "https://financialpost.com/pmn/business-pmn/us-suspends-offshore-wind-leases-citing-national-security",
    "timestamp": "2025-12-22T14:13:11Z"
  },
  {
    "title": "Amb. Huckabee: 'Iran didn't get the message'",
    "description": "In an INSS interview, Ambassador Mike Huckabee addresses Iran, antisemitism, Gaza, and US-Israel security ties under President Trump.",
    "link": "https://www.israelnationalnews.com/news/419737",
    "timestamp": "2025-12-22T14:12:07Z"
  },
  {
    "title": "Could Maduro Playing to Trump’s Ego Avoid War?",
    "description": "Much ink has been spilled over the seemingly imminent invasion of Venezuela by the United States. Tensions have escalated to the point where it seems nothing may prevent this war. That hasn’t kept the Venezuelan dictator from trying. President Nicolás Maduro …",
    "link": "https://www.fairobserver.com/politics/could-maduro-playing-to-trumps-ego-avoid-war/",
    "timestamp": "2025-12-22T14:11:57Z"
  },
  {
    "title": "USA Pursuit of 3rd Oil Tanker Intensifies Venezuela Blockade",
    "description": "U.S. forces chased the U.S.-sanctioned Bella 1 on Sunday as it was en route to Venezuela.",
    "link": "https://www.rigzone.com/news/wire/usa_pursuit_of_3rd_oil_tanker_intensifies_venezuela_blockade-22-dec-2025-182590-article/",
    "timestamp": "2025-12-22T14:10:29Z"
  },
  {
    "title": "Photos Are Being Deleted From the Epstein Files",
    "description": "At least 16 photos have mysteriously disappeared from the Epstein files, including an image that showed president Donald Trump.",
    "link": "http://futurism.com/future-society/photos-deleted-epstein-files",
    "timestamp": "2025-12-22T14:10:13Z"
  },
  {
    "title": "Europe Blows Gasket As Trump Appoints Governor Vowing To Make Greenland Part Of US",
    "description": "European countries are railing against President Donald Trump's decision to tap Republican Louisiana Gov. Jeff Landry as special envoy to Greenland.",
    "link": "https://dailycaller.com/2025/12/22/trump-jeff-landry-greenland-envoy-denmark/",
    "timestamp": "2025-12-22T14:09:10Z"
  },
  {
    "title": "Pope Leo's new US bishops are critics of Trump's migrant crackdown",
    "description": "VATICAN CITY, Dec 22 (Reuters) - Most of Pope Leo's appointments ‌for Catholic bishops in the U.S. have called for better treatment of immigrants in the country, in a trend that may shape how the national Church ‌responds to the Trump administration's divisiv…",
    "link": "https://www.thestar.com.my/news/world/2025/12/22/pope-leo039s-new-us-bishops-are-critics-of-trump039s-migrant-crackdown",
    "timestamp": "2025-12-22T14:09:00Z"
  },
  {
    "title": "Selected Articles: The Roundup Deception: How Monsanto Helped Write the ‘Science’ That Claimed its Weedkiller Was Safe",
    "description": "The Roundup Deception: How Monsanto Helped Write the ‘Science’ That Claimed its Weedkiller Was Safe\nBy Paul Anthony Taylor, December 19, 2025\nFor more than two decades, one scientific paper has been used to reassure regulators, farmers, gardeners, and …\nThe p…",
    "link": "https://www.globalresearch.ca/selected-articles-roundup-deception-monsanto-helped-write-weedkiller-safe/5909945",
    "timestamp": "2025-12-22T14:08:56Z"
  },
  {
    "title": "In year 2025, India learnt to play Chinese checkers",
    "description": "In 2025, India skillfully managed its relationship with China amidst global trade disruptions and geopolitical tensions. New Delhi pursued a balanced approach, engaging Beijing cautiously while safeguarding its strategic autonomy. This careful diplomacy invol…",
    "link": "https://economictimes.indiatimes.com/news/india/in-year-2025-india-learnt-to-play-chinese-checkers/articleshow/126123566.cms",
    "timestamp": "2025-12-22T14:08:43Z"
  },
  {
    "title": "The Pam Bondi Trump/Epstein Files Coverup Enters A New Phase!",
    "description": "All the transparency we've come to expect from Pammy Jo.",
    "link": "https://www.wonkette.com/p/the-pam-bondi-trumpepstein-files",
    "timestamp": "2025-12-22T14:07:59Z"
  },
  {
    "title": "Iran holds missile drills in various cities, state media say",
    "description": "NBC ‌News reported on Saturday that U.S. President Donald Trump was to be briefed ‌by Israeli Prime Minister Benjamin Netanyahu that any expansion of Iran's ballistic missile programme poses a threat that could necessitate swift action.",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-holds-missile-drills-in-various-cities-state-media-say/articleshow/126123588.cms",
    "timestamp": "2025-12-22T14:06:49Z"
  },
  {
    "title": "Pope Leo's new US bishops are critics of Trump's migrant crackdown",
    "description": "VATICAN CITY, Dec 22 (Reuters) - Most of Pope Leo's appointments for Catholic bishops in the U. have called for better treatment of immigrants in the country...",
    "link": "https://uk.news.yahoo.com/pope-leos-us-bishops-critics-140243897.html",
    "timestamp": "2025-12-22T14:06:36Z"
  },
  {
    "title": "Why gold and tech stocks are rallying at the same time",
    "description": "Precious metals are ripping on fear and anxiety just as growth stocks rocket on liquidity and optimism. Can this uncanny market trend actually last?",
    "link": "https://qz.com/gold-silver-tech-stocks-markets",
    "timestamp": "2025-12-22T14:01:46Z"
  },
  {
    "title": "US pursuit of third oil tanker intensifies Venezuela blockade",
    "description": "The Trump administration’s military deployment in the Caribbean is the largest in the region in decades.",
    "link": "https://www.bostonherald.com/2025/12/22/us-intensifies-venezuela-blockade/",
    "timestamp": "2025-12-22T14:01:16Z"
  },
  {
    "title": "The Year in Bitcoin 2025: Breaking Records as Governments, Wall Street Take Interest",
    "description": "From Wall Street to Washington, Bitcoin reached new heights in 2025, despite tensions flaring over changes to the network's codebase.",
    "link": "https://decrypt.co/351200/year-bitcoin-2025-breaking-records-governments-wall-street-take-interest",
    "timestamp": "2025-12-22T14:01:03Z"
  },
  {
    "title": "Indiana community fights to keep needle exchange going after Trump order",
    "description": "Decades of research show syringe programs are extremely effective at preventing infectious disease among intravenous drug users and referring them to treatment. But a July executed order from President Donald Trump’ says federal substance abuse grants can't p…",
    "link": "https://apnews.com/article/needle-exchanges-iv-drugs-trump-indiana-fabf7c91f26547c7de3c8d3fdc3bfc87",
    "timestamp": "2025-12-22T14:01:01Z"
  },
  {
    "title": "Addiction-stricken community struggles to keep a syringe program going after Trump's order",
    "description": "Inside a storage room at the Clark County Health Department are boxes with taped-on signs reading, “DO NOT USE.”  The supplies, which came from the state and...",
    "link": "https://www.yahoo.com/news/articles/addiction-stricken-community-struggles-keep-140100502.html",
    "timestamp": "2025-12-22T14:01:00Z"
  },
  {
    "title": "Hero of 2025: Principled Grand Juries",
    "description": "The staff of Mother Jones is, once again, rounding up the heroes and monsters of the past year. This is a non-exhaustive and totally subjective list, giving our reporters a chance to write about something that brought joy, discontent, or curiosity. Happy holi…",
    "link": "https://www.motherjones.com/politics/2025/12/hero-of-2025-principled-grand-juries/",
    "timestamp": "2025-12-22T14:00:00Z"
  },
  {
    "title": "Senate Democrats raise concerns about IRS readiness for tax filing season",
    "description": "Senate Democrats raise concerns about IRS readiness for tax filing seasongo.com",
    "link": "https://abcnews.go.com/Politics/senate-democrats-raise-concerns-irs-readiness-tax-filing/story?id=128599611",
    "timestamp": "2025-12-22T13:58:54Z"
  }
]