[
  {
    "title": "Putin says United Arab Emirates possible site for his meeting with Trump",
    "description": "Vladimir Putin has indicated that the United Arab Emirates could be a potential location for a meeting with US President Donald Trump. This announcement followed Putin's discussions with Sheikh Mohammed bin Zayed Al Nahyan, the UAE's president, in the Kremlin.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/putin-says-united-arab-emirates-possible-site-for-his-meeting-with-trump/articleshow/123168688.cms",
    "timestamp": "2025-08-07T14:10:21Z"
  },
  {
    "title": "‘South Park’ mocks Kristi Noem and the Trump administration in its latest episode | CNN",
    "description": "“South Park” creators Trey Parker and Matt Stone are clearly not done with the Trump administration.",
    "link": "https://www.cnn.com/2025/08/07/entertainment/south-park-kristi-noem-trump-administration",
    "timestamp": "2025-08-07T14:10:00Z"
  },
  {
    "title": "This Group ‘WILL NOT BE COUNTED’ in Census, Trump Says",
    "description": "President Donald Trump ordered the Department of Commerce to start work on a new census in which illegal immigrants will not be counted. “I have... Read More\nThe post This Group ‘WILL NOT BE COUNTED’ in Census, Trump Says appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/07/this-group-will-not-be-counted-in-census-trump-says/",
    "timestamp": "2025-08-07T14:10:00Z"
  },
  {
    "title": "Trump Fired the BLS Chief. He Was Right–But for All the Wrong Reasons",
    "description": "President Donald Trump fired the Commissioner of the Bureau of Labor Statistics, Dr. Erika McEntarfer, stating, without evidence, that she falsified job numbers to assist\nThe post Trump Fired the BLS Chief. He Was Right–But for All the Wrong Reasons appeared …",
    "link": "https://www.evilhrlady.org/2025/08/trump-fired-the-bls-chief-he-was-right-but-for-all-the-wrong-reasons.html",
    "timestamp": "2025-08-07T14:09:38Z"
  },
  {
    "title": "'Liberation Day' tariffs: How they could impact prices",
    "description": "President Donald Trump's so-called \"Liberation Day\" tariffs take effect Thursday, raising economists' concerns of the potential financial burden on businesses and consumers.",
    "link": "https://www.wpbf.com/article/liberation-day-tariffs-impacts/65624067",
    "timestamp": "2025-08-07T14:09:33Z"
  },
  {
    "title": "Stock Market Highlights: Nifty, Sensex Shrug Off Trump Tariff Jitters As Bulls Charge Back In Last Hour",
    "description": "Stock Market Highlights: The Indian equity benchmark indices closed in the green, recovering sharply during the last hour of trade snapping its two day decline. Hero MotoCorp, Tech Mahindra, JSW Steel, Wipro and Eternal marked notable gains for the index. The…",
    "link": "https://www.ndtvprofit.com/markets/stock-market-highlights-nifty-sensex-shrug-off-trump-tariff-hike-sharp-recovery-in-the-last-hour-of-trade",
    "timestamp": "2025-08-07T14:09:26Z"
  },
  {
    "title": "Seth Meyers Stunned to See Trump Do the Impossible: He’s Gotten ‘Democrats Off Their Asses’ | Video",
    "description": "\"Seriously, this might be Trump's only actual accomplishment,\" the NBC host says\nThe post Seth Meyers Stunned to See Trump Do the Impossible: He’s Gotten ‘Democrats Off Their Asses’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-trump-accomplishment-motivating-democrats/",
    "timestamp": "2025-08-07T14:09:03Z"
  },
  {
    "title": "Trump Outlandishly Demands Intel CEO Tan's Resignation Over Chinese Ties",
    "description": "Many pundits celebrated the hiring of Lip-Bu Tan to replace Intel's ousted chief executive officer (CEO) earlier this year, but if U.S. President Donald Trump has his way, Tan's tenure as the man in charge of one of the biggest semiconductor firms on the plan…",
    "link": "https://hothardware.com/news/trump-demands-intel-ceo-tans-resignation-chinese-ties",
    "timestamp": "2025-08-07T14:08:00Z"
  },
  {
    "title": "GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts to Vaccine Funding",
    "description": "Sen. Bill Cassidy criticized HHS Secretary Robert F. Kennedy's decision to cut vaccine funding months after being a key vote to have him confirmed.\nThe post GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts t…",
    "link": "https://www.mediaite.com/media/news/gop-senator-bill-cassidy-who-was-key-vote-to-confirm-rfk-jr-blasts-health-honcho-for-massive-cuts-to-vaccine-funding/",
    "timestamp": "2025-08-07T14:07:39Z"
  },
  {
    "title": "Trump's Tariff Formula Confound Economists On Faulty Assumptions, Nil Economic Rationale-Here's Why",
    "description": "US President Donald Trump imposed additional 25% tariffs on import of Indian goods, over India's continued purchase of Russian crude oil. The total tariff on India has now doubled to 50%. Trump's...",
    "link": "https://www.ndtvprofit.com/economy-finance/india-us-trade-deal-trumps-tariff-formula-dead-economy-claims-for-india-are-baseless-heres-why",
    "timestamp": "2025-08-07T14:07:10Z"
  },
  {
    "title": "Trump Says Jimmy Kimmel, Jimmy Fallon Could Lose Late-Night Shows: 'They're Next'",
    "description": "President Donald Trump suggested that late-night hosts Jimmy Fallon and Jimmy Kimmel could face the same cancelation as Stephen Colbert.\nThe post Trump Says Jimmy Kimmel, Jimmy Fallon Could Lose Late-Night Shows: ‘They’re Next’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/07/trump-cryptically-suggests-jimmy-kimmel-and-jimmy-fallon-could-lose-late-night-shows/",
    "timestamp": "2025-08-07T14:06:14Z"
  },
  {
    "title": "Is Intel collapsing under CEO Lip-Bu Tan? What went wrong with one of Silicon Valley's most iconic companies",
    "description": "Intel, once a shining tech giant of Silicon Valley, is slowly losing the AI-chip battle against Taiwanese rival TSMC and Nvidia. Now, President Donald Trump's ultimatum to Intel CEO Lip-Bu Tan over China connections may perhaps deal a body blow.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-intel-collapsing-under-ceo-lip-bu-tan-what-went-wrong-with-one-of-silicon-valleys-most-iconic-companies/articleshow/123168584.cms",
    "timestamp": "2025-08-07T14:05:44Z"
  },
  {
    "title": "VA terminates major union contracts and it will impact over 400,000 federal workers. What's at stake for you?",
    "description": "The Veterans Affairs Department ended collective bargaining agreements with unions. This impacts around 360,000 healthcare workers. The move follows a Trump executive order. It also coincides with plans to reduce the VA workforce. The agency claims this will …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-va-terminates-major-union-contracts-and-it-will-impact-over-400000-federal-workers-whats-at-stake/articleshow/123168576.cms",
    "timestamp": "2025-08-07T14:05:28Z"
  },
  {
    "title": "Truth Social’s new AI search engine basically just pushes Fox News",
    "description": "Donald Trump’s Truth Social has launched a new AI search feature that consistently pushes conservative media sources. The feature, Truth Search AI, is powered by the AI startup Perlexity and is now available on the web version of Trump’s social media platform…",
    "link": "https://www.theverge.com/news/753863/trump-truth-social-ai-search-perplexity-conservative-bias",
    "timestamp": "2025-08-07T14:04:06Z"
  },
  {
    "title": "Can Rupert Murdoch Conquer LA?",
    "description": "Ben Schwartz\n\n\n\nThe tabloid baron will launch a West Coast version of the New York Post next year.\r\n\n\r\n\n\nThe post Can Rupert Murdoch Conquer LA? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/california-post-rupert-murdoch-tabloid-journalism/",
    "timestamp": "2025-08-07T14:03:25Z"
  },
  {
    "title": "Trump calls for Intel CEO's head over alleged China links",
    "description": "Chipzilla boss accused of huge conflict of interest US President Donald Trump has called for the immediate resignation of Intel's recently installed chief exec, following concerns raised by a Republican Senator over his links with China.…",
    "link": "https://www.theregister.com/2025/08/07/republican_senator_queries_intel_over/",
    "timestamp": "2025-08-07T14:03:19Z"
  },
  {
    "title": "Trump To Settle On New Fed Governor By End Of Week",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 05, 2025\nPresident Donald Trump said he would select a new Federal Reserve governor before the end of the week. At a White House event Tuesday in which Trump signed an executive order about preparation…",
    "link": "https://biztoc.com/x/d3b9541b4b665ecd",
    "timestamp": "2025-08-07T14:03:03Z"
  },
  {
    "title": "Trump Tariffs: Did Swiss gold refiners fuel the crisis?",
    "description": "Many were baffled when Donald Trump slapped a steep 39% tariff on imports from Switzerland. The Swiss aren't known for flooding the US with cheap goods, but their outsized role in gold refining is distorting trade data. Why did Switzerland get hit with a 39% …",
    "link": "https://www.dw.com/en/trump-tariffs-did-swiss-gold-refiners-fuel-the-crisis/a-73554953",
    "timestamp": "2025-08-07T14:03:00Z"
  },
  {
    "title": "Zelenskyy tells Putin to 'be brave' and finally agree to trilateral meeting with Trump",
    "description": "Russian President Vladimir Putin remains hesitant about trilateral meeting with President Donald Trump and Ukrainian President Volodymyr Zelenskyy as Russia says conditions for Ukraine peace negotiations not yet created.",
    "link": "https://www.foxnews.com/world/zelenskyy-tells-putin-be-brave-finally-agree-trilateral-meeting-trump",
    "timestamp": "2025-08-07T14:02:49Z"
  },
  {
    "title": "Former Superman actor says he’s joining ICE, backs Trump’s immigration crackdown | CNN",
    "description": "Former Superman actor Dean Cain has revealed that he’s joining the ranks of the US Immigration and Customs Enforcement (ICE) agency, showing his support for US President Donald Trump’s immigration crackdown.",
    "link": "https://www.cnn.com/2025/08/07/entertainment/superman-dean-cain-ice-immigration-intl-scli",
    "timestamp": "2025-08-07T14:02:31Z"
  },
  {
    "title": "New Paramount CEO David Ellison Acknowledges “Challenging Period” For CBS News, Praises Its “Long Tradition Of Impactful Reporting”",
    "description": "David Ellison, the new CEO of Paramount, referred to what he called a “challenging period” for CBS News, while praising the division’s “long tradition of impactful reporting,” including the legacy of 60 Minutes. As Ellison’s Skydance finally completed its mer…",
    "link": "http://deadline.com/2025/08/cbs-news-skydance-paramount-merger-1236480802/",
    "timestamp": "2025-08-07T14:02:05Z"
  },
  {
    "title": "World leader refuses to 'humiliate' himself with Trump trade negotiations",
    "description": "Brazil's President Luiz Inácio Lula da Silva is not backing down from his criticism of President Donald Trump, even as his country faces a staggering 50% tariff.",
    "link": "https://www.foxnews.com/world/world-leader-refuses-humiliate-himself-trump-trade-negotiations",
    "timestamp": "2025-08-07T14:01:52Z"
  },
  {
    "title": "Trump demands Intel CEO resign over $200M China scandal",
    "description": "President Donald Trump launched a blistering attack on Intel’s leadership Thursday, demanding the immediate resignation of CEO Lip-Bu Tan over what he described as serious conflicts of interest involving Chinese business relationships. The explosive president…",
    "link": "https://rollingout.com/2025/08/07/trump-demands-intel-ceo-resign-over-200m/",
    "timestamp": "2025-08-07T14:00:57Z"
  },
  {
    "title": "Alvarez & Marsal downplays Trump tariffs, bets big on India's infra boom",
    "description": "The global consultancy is planning to triple its headcount to about 60 people in the country for its infrastructure services practice over the next six months, Marcos Ganut, managing director and global head of infrastructure and capital projects at the firm,…",
    "link": "https://www.livemint.com/companies/alvarez-marsal-india-infrastructure-boom-consulting-market-marcos-ganut-himanshu-bajaj-gcc-us-tariffs-11754565783091.html",
    "timestamp": "2025-08-07T14:00:42Z"
  },
  {
    "title": "6 soldiers heralded as heroes for stopping Ft. Stewart shooter, saving victims",
    "description": "6 soldiers heralded as heroes for stopping Ft. Stewart shooter, saving victimswsbtv.com",
    "link": "https://www.wsbtv.com/news/local/6-soldiers-heralded-heroes-stopping-ft-stewart-shooter-saving-victims/2XOG72DFXVESRDUJFIGKC2XD5Q/",
    "timestamp": "2025-08-07T14:00:33Z"
  },
  {
    "title": "'SOUTH PARK' PORTRAYS NOEM AS PUPPY-SHOOTING, FACE-MELTING ICE VILLAIN...",
    "description": "The latest episode brutally spoofed the Homeland Security boss.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/south-park-portrays-kristi-noem-ice-villain-1236339124/",
    "timestamp": "2025-08-07T14:00:03Z"
  },
  {
    "title": "Trump's Escalating Tariff War With India Threatens Russia's Oil Economy",
    "description": "President Donald Trump has imposed an additional 25 per cent tariff on India after the country’s government imported Russian Federation Oil. In an executive order signed on Wednesday, the White House said it would slap Indian imports with the fresh levy takin…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Trumps-Escalating-Tariff-War-With-India-Threatens-Russias-Oil-Economy.html",
    "timestamp": "2025-08-07T14:00:00Z"
  },
  {
    "title": "Russian oil exports have decreased modestly since 2022, shifting toward Asia",
    "description": "From 2020 to 2024, crude oil and condensate exports from Russia averaged 5.0 million barrels per day (b/d). Exports from Russia in the first half of 2025 (1H25) were 4.3 million b/d (compared with 4.8 million b/d in 2024). Even as crude oil export volumes fro…",
    "link": "https://www.eia.gov/todayinenergy/detail.php?id=65885",
    "timestamp": "2025-08-07T14:00:00Z"
  },
  {
    "title": "Govt may focus on extending support measures to sectors hit hard by US tariffs",
    "description": "The government may extend export support to sectors like textiles and chemicals hit by new US tariffs, under a ₹2,250 crore export promotion mission. Commerce ministry held consultations with exporters, who sought fiscal incentives and trade facilitation. Wit…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/govt-may-focus-on-extending-support-measures-to-sectors-hit-hard-by-us-tariffs/articleshow/123168540.cms",
    "timestamp": "2025-08-07T13:59:48Z"
  },
  {
    "title": "Russia's Putin meets with UAE leader, countries pledge to double trade amid Trump pressure",
    "description": "Russian business in the UAE has ballooned since Moscow's invasion of Ukraine in 2022, as its citizens fled sanctions and mandatory conscription.",
    "link": "https://www.cnbc.com/2025/08/07/russias-putin-meets-with-uae-leader-countries-pledge-to-double-trade-amid-trump-pressure.html",
    "timestamp": "2025-08-07T13:58:41Z"
  },
  {
    "title": "Tougher transshipment penalties not expected immediately as Trump tariffs kick in, sources say",
    "description": "Despite U.S. tariffs on goods, Southeast Asian nations aren't immediately facing tougher penalties for transshipment, easing concerns about goods rerouted from China. Existing U.S. customs rules allow goods with 'substantial transformation' to be labeled as m…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tougher-transshipment-penalties-not-expected-immediately-as-trump-tariffs-kick-in-sources-say/articleshow/123168520.cms",
    "timestamp": "2025-08-07T13:58:15Z"
  },
  {
    "title": "Donald Trump calls for Intel CEO to resign over suspected CCP ties",
    "description": "Intel's new CEO is catching heat as the company faces questions about alleged CCP ties, and now Trump wants him out over a possible conflict of interest. Read more...",
    "link": "https://www.neowin.net/news/donald-trump-calls-for-intel-ceo-to-resign-over-suspected-ccp-ties/",
    "timestamp": "2025-08-07T13:58:02Z"
  },
  {
    "title": "Apple CEO Tim Cook Gives Trump a Custom 24-Karat Pure Gold Gift",
    "description": "Apple CEO Tim Cook visited the White House on Wednesday to announce that his company will be investing an additional $100 billion in the U.S....",
    "link": "https://www.macrumors.com/2025/08/07/tim-cook-gift-to-trump/",
    "timestamp": "2025-08-07T13:57:15Z"
  },
  {
    "title": "Rebel Dem leader's fate to be decided by court packed with TX Gov Greg Abbott's appointees",
    "description": "\"Abbott’s bid to expel the House Democratic leader goes to a court filled with his appointees\" was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, g…",
    "link": "https://www.rawstory.com/rebel-dem-leader-s-fate-to-be-decided-by-court-packed-with-tx-gov-greg-abbott-s-appointees/",
    "timestamp": "2025-08-07T13:57:01Z"
  },
  {
    "title": "Olmert supports Ehud Barak's call for civil disobedience",
    "description": "Former PM expresses support for fellow former PM's call for civil disobenience to bring down the government in interview with foreign media, claims Ben-Gvir and Smotrich run the government.",
    "link": "https://www.israelnationalnews.com/news/412912",
    "timestamp": "2025-08-07T13:55:50Z"
  },
  {
    "title": "Microsoft layoffs mount as it cuts 40 jobs - 3,160 fired in Washington since May, employees call it a cultural crisis",
    "description": "Microsoft layoffs Washington 2025: Microsoft continues job cuts in Washington state. This brings the total layoffs to 3,160 this year. These cuts are separate from previous major layoffs. The company is investing heavily in AI. This is putting pressure to red…",
    "link": "https://economictimes.indiatimes.com/news/international/us/microsoft-layoffs-washington-2025-microsoft-layoffs-mount-as-it-cuts-40-jobs-3160-fired-in-washington-since-may-employees-call-it-a-cultural-crisis/articleshow/123166137.cms",
    "timestamp": "2025-08-07T13:54:53Z"
  },
  {
    "title": "‘It’s Horrifying’: Dan Turrentine Tells Sean Hannity Dem Party Has ‘Two Big Problems’",
    "description": "Former Democratic strategist Dan Turrentine told Fox News host Sean Hannity on Wednesday that his party is plagued by weak leadership and a lack of an \"agenda.\"",
    "link": "https://dailycaller.com/2025/08/07/its-horrifying-dan-turrentine-tells-sean-hannity-dem-party-has-two-big-problems/",
    "timestamp": "2025-08-07T13:54:27Z"
  },
  {
    "title": "Indonesia seeks further tariff cuts in ongoing talks with US",
    "description": "Indonesia is continuing trade negotiations with the United States despite having secured a 19-percent import tariff on Indonesian products.\r\n\r\n&quot;We ...",
    "link": "https://en.antaranews.com/news/371889/indonesia-seeks-further-tariff-cuts-in-ongoing-talks-with-us",
    "timestamp": "2025-08-07T13:53:59Z"
  },
  {
    "title": "Make America Scary Again: The Challenging Path to Reviving US Deterrence",
    "description": "What America wouldn’t give to turn back the clock to February 23, 2022, and make a bold, controversial and possibly unpopular military decision that could have stopped the Russian invasion of Ukraine before it began. To act pre-emptively, decisively, even pro…",
    "link": "https://www.fairobserver.com/politics/make-america-scary-again-the-challenging-path-to-reviving-us-deterrence/",
    "timestamp": "2025-08-07T13:53:37Z"
  },
  {
    "title": "Diddy’s Lead Attorney Calls Cassie Relationship a ‘Modern Love Story’ in First Network Interview Since Trial | Video",
    "description": "\"The rape we vehemently deny. I respect that she said that, I don’t think the jury concluded that that happened,\" Marc Agnifilo tells CBS Mornings\nThe post Diddy’s Lead Attorney Calls Cassie Relationship a ‘Modern Love Story’ in First Network Interview Since …",
    "link": "https://www.thewrap.com/diddy-trial-lawyer-pardon-sentencing-cassie-relationship/",
    "timestamp": "2025-08-07T13:53:23Z"
  },
  {
    "title": "Trump’s new religious policies energize conservative Christians",
    "description": "Critics say Trump is eroding the separation of church and state and privileging certain expressions of Christianity over other religious views.",
    "link": "https://www.mlive.com/news/2025/08/trumps-new-religious-policies-energize-conservative-christians.html",
    "timestamp": "2025-08-07T13:52:32Z"
  },
  {
    "title": "Putin Reveals Where Trump Meeting Could Take Place",
    "description": "Vladimir Putin has said the United Arab Emirates would be \"one of the more suitable locations\" for talks with President Donald Trump regarding the Ukraine war.",
    "link": "https://biztoc.com/x/231f44d8485c97fc",
    "timestamp": "2025-08-07T13:52:03Z"
  },
  {
    "title": "Trump Says ‘Very Good Chance’ He Meets Putin and Zelenskiy",
    "description": "President Donald Trump said there was a “very good chance” he would meet with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskiy soon in another bid to broker peace between the two countries.\n“That road was long, and continues to be …",
    "link": "https://biztoc.com/x/fd9bb9745b317966",
    "timestamp": "2025-08-07T13:51:59Z"
  },
  {
    "title": "Trump To Sign Order Penalizing Politically Motivated ‘Debanking’",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 05, 2025\nPresident Donald Trump plans to sign an executive order cracking down on “debanking,” a term used to describe financial institutions that selectively close customer accounts or deny services b…",
    "link": "https://biztoc.com/x/3d91173645ed5ca4",
    "timestamp": "2025-08-07T13:51:45Z"
  },
  {
    "title": "US Tariffs Threaten to Derail India’s Economic Ascent, Take Out 0.3 Percentage Point of GDP: Goldman Sachs",
    "description": "US imposes 25% tariff on Indian goods, threatening economic growth with potential 0.3% GDP impact, according to Goldman Sachs.",
    "link": "https://www.thehindubusinessline.com/companies/us-tariffs-threaten-to-derail-indias-economic-ascent-take-out-03-percentage-point-of-gdp-goldman-sachs/article69905684.ece",
    "timestamp": "2025-08-07T13:50:08Z"
  },
  {
    "title": "Why don’t Republicans want to talk to the prosecutor who made Epstein’s ‘sweetheart deal’?",
    "description": "Common sense suggests the congressional investigation into the Jeffrey Epstein scandal should include a subpoena for Alex Acosta, Trump's former labor secretary",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/dont-republicans-want-talk-prosecutor-made-epsteins-sweetheart-deal-rcna223597",
    "timestamp": "2025-08-07T13:49:48Z"
  },
  {
    "title": "Scott Bessent cornered on MSNBC after making admission about 'who pays' tariffs",
    "description": "Toward the end of an extensive interview with Treasury Secretary Scott Bessent, MSNBC's Eugene Robinson was afforded an opportunity to question the Donald Trump official and put him on the spot over the tariffs that went into effect at midnight.After making a…",
    "link": "https://www.rawstory.com/bessnt-tariffs-msnbc-cornered/",
    "timestamp": "2025-08-07T13:48:35Z"
  },
  {
    "title": "Wall Street rises as stock markets worldwide take Trump’s new tariffs in stride",
    "description": "Stocks are rising on Wall Street, even as President Donald Trump’s latest tariffs kicked into effect on dozens of countries.",
    "link": "https://www.bostonherald.com/2025/08/07/wall-street-trump-tariffs-impact/",
    "timestamp": "2025-08-07T13:47:50Z"
  },
  {
    "title": "Donald Trump and Vladimir Putin to meet in coming days, says Kremlin (Financial Times)",
    "description": "Financial Times:\nDonald Trump and Vladimir Putin to meet in coming days, says Kremlin  —  Russian leader points to UAE as ‘perfectly suitable’ to host in-person meeting with US president  —  Anastasia Stognei in Berlin and Fabrice Deprez in Kyiv  —  Russian l…",
    "link": "https://www.memeorandum.com/250807/p39",
    "timestamp": "2025-08-07T13:45:00Z"
  },
  {
    "title": "The Emperor's New Trade Deal (Paul Krugman)",
    "description": "Paul Krugman:\nThe Emperor's New Trade Deal  —  Tariffs are bad.  A deluded president is worse.  —  On Tuesday Donald Trump went on CNBC to explain why the European Union is facing a tariff of “only” 15 percent.  But what he said was simply delusional — and th…",
    "link": "https://www.memeorandum.com/250807/p38",
    "timestamp": "2025-08-07T13:45:00Z"
  },
  {
    "title": "No logic behind Trump's 50% tariff; talks continue with US: Official",
    "description": "A senior Indian diplomat criticised the US's unilateral decision to impose 50% tariffs on Indian exports, deeming it illogical. Despite this setback, negotiations between the two nations are ongoing, with India expressing confidence in finding mutually benefi…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/no-logic-behind-trumps-50-tariff-talks-continue-with-us-official/articleshow/123168304.cms",
    "timestamp": "2025-08-07T13:44:08Z"
  },
  {
    "title": "Putin Reveals Where Trump Meeting Could Take Place",
    "description": "Vladimir Putin has said the United Arab Emirates would be \"one of the more suitable locations\" for talks with President Donald Trump regarding the Ukraine war.",
    "link": "https://www.newsweek.com/putin-reveals-where-donald-trump-meeting-take-place-united-arab-emirates-ukraine-war-2110190",
    "timestamp": "2025-08-07T13:43:22Z"
  },
  {
    "title": "Nasdaq Heads for Record High as Stocks Surge at the Open After Trump Tariffs Kick In",
    "description": "8 min ago\nNasdaq Heads for Record High as Stocks Surge at the Open After Trump Tariffs Kick In\nStocks continued to rise back toward record levels on Thursday, even as President Donald Trump’s global tariffs went into effect and initial jobless claims came in …",
    "link": "https://biztoc.com/x/509afd32d5f80692",
    "timestamp": "2025-08-07T13:41:20Z"
  },
  {
    "title": "TCS rolls out pay hikes; Paytm trims headcount in FY25",
    "description": "Weeks after announcing massive layoffs, TCS said it will raise salaries for 80% of its workforce. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/tcs-rolls-out-pay-hikes-paytm-trims-headcount-in-fy25/articleshow/123168093.cms",
    "timestamp": "2025-08-07T13:41:07Z"
  },
  {
    "title": "Trump’s broad tariffs go into effect just as U.S. economic pain is surfacing",
    "description": "The higher import taxes are part of his strategy to reduce the U.S. trade deficit and encourage foreign investment in America.",
    "link": "https://www.pbs.org/newshour/economy/trumps-broad-tariffs-go-into-effect-just-as-u-s-economic-pain-is-surfacing",
    "timestamp": "2025-08-07T13:41:06Z"
  },
  {
    "title": "Donald Trump Issues Ultimatum To Intel CEO: 'Resign, Immediately'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has called on the new CEO of the technology company Intel to resign immediately.\nWriting on Truth Social on Thursday, Trump said that Lip-Bu Tan was \"highly conflicted.\"\n\"The CEO of INTE…",
    "link": "https://biztoc.com/x/a2018e760742a15c",
    "timestamp": "2025-08-07T13:41:05Z"
  },
  {
    "title": "What private assets in 401(k) plans mean for investors: 'You’re only asking for trouble,' one advisor says",
    "description": "Millions of investors may soon have access to private assets in their 401(k) or other workplace retirement plans. What to know about the risks and rewards.",
    "link": "https://www.cnbc.com/2025/08/07/trump-private-assets-retirement-plans.html",
    "timestamp": "2025-08-07T13:40:46Z"
  },
  {
    "title": "President Trump Reinstates Fitness Test For Kids",
    "description": "By Quinn Delamater, The Daily Signal | August 05, 2025\nPresident Donald Trump has reinstated the Presidential Fitness Test in U.S. schools. The move is part of the president’s effort to “restore health and fitness to America’s youth,” according to a statement…",
    "link": "https://biztoc.com/x/20a01fb243c4d797",
    "timestamp": "2025-08-07T13:40:44Z"
  },
  {
    "title": "Who wins from a Trump-Putin meeting?",
    "description": "Not for the first time, Donald Trump might have jumped the gun when it comes to Vladimir Putin, leaving President Zelenskyy and a mutually agreeable ceasefire in Ukraine appearing equally lost.\nPresident Trump's hope that he can end the war in Ukraine is \"imp…",
    "link": "https://biztoc.com/x/3dc164889bcfd991",
    "timestamp": "2025-08-07T13:40:32Z"
  },
  {
    "title": "Donald Trump ally Sen. Tom Cotton asks Intel’s board about CEO’s ties to China",
    "description": "By Alicia Diaz, Bloomberg\nA top Republican senator asked the chairman of Intel Corp.’s board to answer questions about Chief Executive Officer Lip-Bu Tan’s ties to China, including investments in the country’s semiconductor companies and others with connectio…",
    "link": "https://biztoc.com/x/e4d6d648d3ca8060",
    "timestamp": "2025-08-07T13:40:31Z"
  },
  {
    "title": "Maggie Haberman Says Epstein Survivors Will Be Problem for Trump: ‘Don’t Think These Women Are Going To Stay Quiet’",
    "description": "New York Times White House correspondent Maggie Haberman told CNN anchor Kaitlan Collins that Jeffrey Epstein's victims are going to be a problem for President Donald Trump as he tries to move past the story that has dogged him for months.\nThe post Maggie Hab…",
    "link": "https://www.mediaite.com/media/tv/maggie-haberman-says-epstein-survivors-will-be-problem-for-trump-dont-think-these-women-are-going-to-stay-quiet/",
    "timestamp": "2025-08-07T13:39:53Z"
  },
  {
    "title": "US Treasury to Print $500 Bills?",
    "description": "Rumors are circulating that the United States may begin to print $500 bills. The US Bureau of Engraving and Printing began printing $500 bills in 1861 until 1945, formally discontinuing them in 1969 when Nixon moved to close the gold window. The US Treasury h…",
    "link": "https://freerepublic.com/focus/f-news/4333206/posts",
    "timestamp": "2025-08-07T13:39:42Z"
  },
  {
    "title": "US Treasury to Print $500 Bills?",
    "description": "Rumors are circulating that the United States may begin to print $500 bills. The US Bureau of Engraving and Printing began printing $500 bills in 1861 until 1945, formally discontinuing them in 1969 when Nixon moved to close the gold window. The US Treasury h…",
    "link": "https://freerepublic.com/focus/f-chat/4333206/posts",
    "timestamp": "2025-08-07T13:39:42Z"
  },
  {
    "title": "Trump threatens 100% tariff on chips… but not on Apple",
    "description": "President Trump will soon hit computer makers with a 100% tariff on chips and semiconductors, but that doesn’t include Apple. Here’s why.\n(via Cult of Mac - Your source for the latest Apple news, rumors, analysis, reviews, how-tos and deals.)",
    "link": "https://www.cultofmac.com/news/trump-chip-tariff-apple",
    "timestamp": "2025-08-07T13:39:09Z"
  },
  {
    "title": "Trump Wants to Exclude Illegal Migrants from Next Census",
    "description": "President Donald Trump said Thursday he has instructed his administration to start work on a new census that excludes illegal migrants from the count.\nThe post Trump Wants to Exclude Illegal Migrants from Next Census appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/08/07/trump-wants-to-exclude-illegal-migrants-from-next-census/",
    "timestamp": "2025-08-07T13:38:37Z"
  },
  {
    "title": "Who wins from a Trump-Putin meeting?",
    "description": "US president's hope that face-to-face talks can end the war in Ukraine look 'impossibly optimistic', say analysts",
    "link": "https://theweek.com/world-news/who-wins-from-a-trump-putin-meeting",
    "timestamp": "2025-08-07T13:38:10Z"
  },
  {
    "title": "Trump Should Raise Rights Issues with Azerbaijan Leader",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Sevinj Vagifgizi, editor-in-chief of the online publication Abzas Media, is seen as police squads surround demonstrators and push them back during a rally of journalists against a new media bill, in front of the Parl…",
    "link": "https://www.hrw.org/news/2025/08/07/trump-should-raise-rights-issues-with-azerbaijan-leader",
    "timestamp": "2025-08-07T13:36:25Z"
  },
  {
    "title": "Donald Trump calls on new Intel chief to resign",
    "description": "US president alleges that semiconductor industry veteran Lip-Bu Tan is ‘highly conflicted’",
    "link": "https://www.irishtimes.com/business/2025/08/07/donald-trump-calls-on-new-intel-chief-to-resign/",
    "timestamp": "2025-08-07T13:36:11Z"
  },
  {
    "title": "Donald Trump Issues Ultimatum To Intel CEO: 'Resign, Immediately'",
    "description": "President Donald Trump has called Intel CEO Lip-Bu Tan \"highly conflicted.\"",
    "link": "https://www.newsweek.com/donald-trump-ultimatum-intel-ceo-resign-lip-bu-tan-2110180",
    "timestamp": "2025-08-07T13:36:00Z"
  },
  {
    "title": "“Gaslighting the American people”: Joe Rogan slams Donald Trump as truth battle over Jeffrey Epstein files explodes",
    "description": "Amidst growing public outcry over the unreleased Jeffrey Epstein files, the Trump administration is reportedly considering sending Deputy Attorney General Todd Blanche to The Joe Rogan Experience. This potential interview aims to address accusations of govern…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/gaslighting-the-american-people-joe-rogan-slams-donald-trump-as-truth-battle-over-jeffrey-epstein-files-explodes/articleshow/123168151.cms",
    "timestamp": "2025-08-07T13:35:54Z"
  },
  {
    "title": "‘Something Wrong Here’: Scott Bessent Says BLS Took ‘Lazy Way’ Of Collecting ‘Corrupted’ Data",
    "description": "Scott Bessent said during a “Morning Joe” interview the Bureau of Labor Statistics used “corrupted” data leading to massive mistakes in initial job estimates.",
    "link": "https://dailycaller.com/2025/08/07/something-wrong-here-scott-bessent-says-bls-took-lazy-way-of-collecting-corrupted-data/",
    "timestamp": "2025-08-07T13:35:21Z"
  },
  {
    "title": "Welcome to the Era of Big Stupid in America",
    "description": "America is no longer anti-intellectual. We’re actively anti-intellect. It might be the death of us.",
    "link": "https://www.esquire.com/news-politics/a65595270/america-big-stupid/",
    "timestamp": "2025-08-07T13:35:00Z"
  },
  {
    "title": "JSW Group not directly impacted by Trump tariffs, but trade sentiment could take a hit: Parth Jindal",
    "description": "JSW Group businesses insulated from US tariff hike, but trade sentiment may suffer, says Managing Director Parth Jindal.",
    "link": "https://www.thehindubusinessline.com/companies/jsw-group-not-directly-impacted-by-trump-tariffs-but-trade-sentiment-could-take-a-hit-parth-jindal/article69905791.ece",
    "timestamp": "2025-08-07T13:33:24Z"
  },
  {
    "title": "“Bullsh*t”: Trump and JD Vance Snap Over Epstein Cover-Up Meeting",
    "description": "President Donald Trump and Vice President JD Vance flatly denied reports that they planned to hold a strategy meeting about the government’s next steps in quelling the outrage over Jeffrey Epstein. During a press conference in the Oval Office Wednesday, Trump…",
    "link": "https://newrepublic.com/post/198883/donald-trump-jd-vance-epstein-cover-up-meeting",
    "timestamp": "2025-08-07T13:32:49Z"
  },
  {
    "title": "Nasdaq Heads for Record High as Stocks Surge at the Open After Trump Tariffs Kick In",
    "description": "The Dow, S&P 500, and Nasdaq are rising in early trading as the stock market digests President Donald Trump's reciprocal tariffs, which kicked in at midnight Thursday.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-080725",
    "timestamp": "2025-08-07T13:32:16Z"
  },
  {
    "title": "US applications for jobless benefits up modestly but remain at a healthy level",
    "description": "The number of Americans filing for jobless benefits rose modestly last week, a sign that employers still retaining workers despite economic uncertainty related to U.S. trade policy",
    "link": "https://abcnews.go.com/Business/wireStory/us-applications-jobless-benefits-modestly-remain-healthy-level-124444061",
    "timestamp": "2025-08-07T13:31:20Z"
  },
  {
    "title": "Trump wants Intel CEO out: Meet the chip industry veteran Lip-Bu Tan who is under US President's radar",
    "description": "Donald Trump has urged for Intel CEO Lip-Bu Tan's immediate resignation, alleging ties to China that pose a national security risk. Republican lawmakers, led by Senator Tom Cotton, have raised concerns about Tan's financial involvement in Chinese companies, i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-wants-intel-ceo-out-meet-the-chip-industry-veteran-lip-bu-tan-who-is-under-us-presidents-radar/articleshow/123168056.cms",
    "timestamp": "2025-08-07T13:29:55Z"
  },
  {
    "title": "White House’s Plan For Advanced Semiconductor Regulations Starts To Emerge",
    "description": "New export controls on semiconductors are not imminent from the Trump administration, but future measures are being discussed, including targeting chip smuggling.",
    "link": "https://www.forbes.com/sites/owentedford/2025/08/07/white-houses-plan-for-advanced-semiconductor-regulations-starts-to-emerge/",
    "timestamp": "2025-08-07T13:29:50Z"
  },
  {
    "title": "Trump claims he’s launching a new census, seizing on an idea from the Republican fringe",
    "description": "What's wrong with Donald Trump's apparent plan for a mid-decade U.S. census? The list of problems isn't short.",
    "link": "https://biztoc.com/x/d3eaa7923a2c0e64",
    "timestamp": "2025-08-07T13:29:22Z"
  },
  {
    "title": "JUST IN: Controversial $8 Billion Paramount-Skydance Merger Closes",
    "description": "The controversial $8 billion merger between Paramount and Skydance closed on Thursday morning after months of debate over it. \nThe post JUST IN: Controversial $8 Billion Paramount-Skydance Merger Closes first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-controversial-8-billion-paramount-skydance-merger-closes/",
    "timestamp": "2025-08-07T13:29:16Z"
  },
  {
    "title": "Remittances to Mexico plummet 16.2% in June, the biggest drop in over a decade",
    "description": "The amount of money Mexico received in remittances fell 16.2% annually in June, the largest year-over-year decline for any month in more than a decade. Analysts partially attributed the sharp decline to fear of going out to work among Mexicans in the United S…",
    "link": "https://freerepublic.com/focus/f-news/4333203/posts",
    "timestamp": "2025-08-07T13:28:16Z"
  },
  {
    "title": "Analysis:ESPN-NFL deal faces regulatory hurdles",
    "description": "LOS ANGELES :The National Football League's deal with Walt Disney in which it will gain an equity stake in ESPN in return for prime media assets is expected to face scrutiny from the U.S. Department of Justice, according to legal experts and industry sources.…",
    "link": "https://www.channelnewsasia.com/business/analysisespn-nfl-deal-faces-regulatory-hurdles-5283226",
    "timestamp": "2025-08-07T13:28:10Z"
  },
  {
    "title": "Trump calls on 'highly conflicted' Intel CEO to resign",
    "description": "US President Donald Trump has demanded the immediate resignation of Intel's new CEO, Lip-Bu Tan, calling him \"highly conflicted\" due to his ties to Chinese firms and raising doubts about the future of the American chip icon.",
    "link": "https://www.rte.ie/news/business/2025/0807/1527381-trump-calls-on-highly-conflicted-intel-ceo-to-resign/",
    "timestamp": "2025-08-07T13:25:24Z"
  },
  {
    "title": "Carville calls on Democrats to 'unilaterally' pack Supreme Court, create new blue states 'to save democracy'",
    "description": "James Carville urged Democrats should open \"Pandora's Box\"with controversial power grabs including statehood for Puerto Rico and D.C. to \"save\" democracy.",
    "link": "https://www.foxnews.com/media/carville-calls-democrats-unilaterally-pack-supreme-court-create-new-blue-states-to-save-democracy",
    "timestamp": "2025-08-07T13:24:55Z"
  },
  {
    "title": "Analysis-ESPN-NFL deal faces regulatory hurdles",
    "description": "LOS ANGELES (Reuters) -The National Football League's deal with Walt Disney in which it will gain an equity stake in ESPN in return for prime media assets is expected to face scrutiny from the U.S. Department of Justice, according to legal experts and industr…",
    "link": "https://sports.yahoo.com/article/analysis-espn-nfl-deal-faces-132451502.html",
    "timestamp": "2025-08-07T13:24:51Z"
  },
  {
    "title": "Trump opens $12.5 trillion 401(k) market to crypto and private equity access",
    "description": "President Donald Trump will sign an executive order today directing federal regulators to ease legal pathways for 401(k) plans to include private equity, real estate, crypto, and other alternative assets. As Bloomberg reported, the directive tasks the Departm…",
    "link": "https://cryptoslate.com/trump-opens-12-5-trillion-401k-market-to-crypto-and-private-equity-access/",
    "timestamp": "2025-08-07T13:23:13Z"
  },
  {
    "title": "Does the Stock Market Know Something We Don’t?",
    "description": "The uncomfortable fact about its historic run is that no one is sure why it’s happening—or what could bring it to an end.",
    "link": "https://www.theatlantic.com/economy/archive/2025/08/stock-market-theories/683780/",
    "timestamp": "2025-08-07T13:23:00Z"
  },
  {
    "title": "Democrats question Google's Trump talks over censorship suit and possible 'quid-pro-quo' deal",
    "description": "A group of Democratic senators wrote a letter to Google expressing concern over a possible settlement between the company and President Trump.",
    "link": "https://www.cnbc.com/2025/08/07/google-trump-settlement-democrats.html",
    "timestamp": "2025-08-07T13:21:15Z"
  },
  {
    "title": "Putin calls UAE ‘one of suitable’ venues for upcoming meeting with Trump",
    "description": "Russian President Vladimir Putin on Thursday described the United Arab Emirates (UAE) as “one of the suitable” venues for an upcoming meeting with US President Donald Trump. “We have many friends who are ready to help us organize events of this kind. One of o…",
    "link": "https://freerepublic.com/focus/f-chat/4333198/posts",
    "timestamp": "2025-08-07T13:18:56Z"
  },
  {
    "title": "Trump demands resignation of Intel CEO over China ties",
    "description": "President Donald Trump demanded that Lip-Bu Tan, CEO of tech firm, Intel resign immediately, saying he is “highly conflicted.”",
    "link": "https://biztoc.com/x/4652b269f7e917a3",
    "timestamp": "2025-08-07T13:18:27Z"
  },
  {
    "title": "U.S. applications for jobless benefits up modestly but remain at a healthy level",
    "description": "The Labor Department reported Thursday that jobless claims for the week ending Aug. 2 rose by 7,000 to 226,000, slightly more than the 219,000 new applications analysts forecast.",
    "link": "https://www.pbs.org/newshour/economy/u-s-applications-for-jobless-benefits-up-modestly-but-remain-at-a-healthy-level",
    "timestamp": "2025-08-07T13:18:22Z"
  },
  {
    "title": "US expects $50 billion a month in tariff revenues, US Commerce chief Lutnick says",
    "description": "WASHINGTON (Reuters) -U.S. Commerce Secretary Howard Lutnick said on Thursday he expects the country to collect $50 billion a month in tariff revenues or...",
    "link": "https://finance.yahoo.com/news/us-expects-50-billion-month-131734396.html",
    "timestamp": "2025-08-07T13:17:34Z"
  },
  {
    "title": "Does Trump Actually Know What RFK Jr. Is Doing to Vaccine Research?",
    "description": "Officials in the Trump administration appear to be advancing their own agendas without informing the president.Speaking with reporters at the White House Wednesday, Donald Trump revealed that he was not aware that Health Secretary Robert F. Kennedy Jr. had an…",
    "link": "https://newrepublic.com/post/198881/donald-trump-robert-f-kennedy-jr-mrna-vaccine-research",
    "timestamp": "2025-08-07T13:15:01Z"
  }
]