[
  {
    "title": "This US-owned factory in China made toys for Walmart, tariffs put it on life support",
    "description": "Facing 145% US tariffs, toy maker Huntar Inc. halted China production, slashed jobs, and is racing to relocate to Vietnam. CEO Jason Cheung, caught between trade war crossfire, may shutter the business his immigrant father founded. Like many, he’s running out…",
    "link": "https://economictimes.indiatimes.com/tech/technology/this-us-owned-factory-in-china-made-toys-for-walmart-tariffs-put-it-on-life-support/articleshow/121094046.cms",
    "timestamp": "2025-05-12T03:03:30Z"
  },
  {
    "title": "Jen Psaki holds mock press briefing trashing 'MAGA spin' on White House questions",
    "description": "MSNBC host Jen Psaki resumed her position as a White House press secretary in a mock-up briefing to attack the Trump administration during her show.",
    "link": "https://www.foxnews.com/media/jen-psaki-holds-mock-press-briefing-trashing-maga-spin-white-house-questions",
    "timestamp": "2025-05-12T03:00:03Z"
  },
  {
    "title": "Bobrovsky stops 23 shots, Panthers top Maple Leafs 2-0 in Game 4 and tie series at 2 games apiece",
    "description": "The Florida Panthers beat the Toronto Maple Leafs 2-0 on Sunday night in Game 4 to even the Eastern Conference semifinal series.",
    "link": "https://www.cbc.ca/news/canada/toronto/maple-leafs-panthers-stanley-cup-game-4-may-11-1.7532368",
    "timestamp": "2025-05-12T02:59:23Z"
  },
  {
    "title": "Measles outbreak in North Dakota prompts local health officials to quarantine unvaccinated schoolchildren - NewsBreak",
    "description": "Measles cases continue to accumulate in the United States in what is already the second-worst year since the disease was declared eliminated a quarter-cent",
    "link": "https://www.newsbreak.com/news/3999725586902-measles-outbreak-in-north-dakota-prompts-local-health-officials-to-quarantine-unvaccinated-schoolchildren?noAds=1&amp;_f=app_share&amp;s=i2",
    "timestamp": "2025-05-12T02:59:13Z"
  },
  {
    "title": "‘Dark stablecoins’ could emerge as regulations tighten",
    "description": "Censorship-resistant “dark stablecoins” could come in increasing demand as governments tighten their oversight of the industry. Stablecoins have been used for various groups to store assets due to a lack of government interference; however, with regulations p…",
    "link": "https://cointelegraph.com/news/regulations-spark-censorship-resistant-dark-stablecoins",
    "timestamp": "2025-05-12T02:55:08Z"
  },
  {
    "title": "History will judge Netanyahu and Trump on whether they can keep US-Israel ties ironclad",
    "description": "Israel and the United States are bound not merely by interests but by values: democracy, innovation, and the conviction that free peoples.",
    "link": "https://www.jpost.com/opinion/article-853578",
    "timestamp": "2025-05-12T02:54:52Z"
  },
  {
    "title": "Trump Confirms Qatar Giving U.S. Luxury Boeing Jet 'Free of Charge'",
    "description": "President Donald Trump confirmed that Qatar is giving the United States a luxury Boeing 747 jet \"free of charge,\" which will temporarily replace Air Force One.\nThe post Trump Confirms Qatar Giving U.S. Luxury Boeing Jet ‘Free of Charge’ appeared first on Brei…",
    "link": "https://www.breitbart.com/politics/2025/05/11/trump-confirms-qatar-giving-u-s-luxury-boeing-jet-free-charge/",
    "timestamp": "2025-05-12T02:54:11Z"
  },
  {
    "title": "Zelenskyy to Putin: Meet me in Turkey—but only if you halt the fighting",
    "description": "Ukrainian President Zelenskyy says he will meet Putin in Turkey on Thursday if Russia agrees to a 30-day ceasefire. Russia has proposed talks without preconditions but ignored the ceasefire demand.",
    "link": "https://www.israelnationalnews.com/news/408197",
    "timestamp": "2025-05-12T02:53:19Z"
  },
  {
    "title": "Miranda Devine: Old Joe Biden haunts Demented Dems as they desperately try to flip the script claiming Trump is ‘losing his mind’",
    "description": "As long as Joe Biden keeps popping up in public, the Dems' ruse will fail because Americans can see for themselves which president has lost his grip on reality.",
    "link": "https://nypost.com/2025/05/11/opinion/miranda-devine-old-joe-biden-haunts-demented-dems-as-they-desperately-try-to-flip-the-script-claiming-trump-losing-his-mind/",
    "timestamp": "2025-05-12T02:48:16Z"
  },
  {
    "title": "Ukraine President Volodymyr Zelenskyy agrees meeting with Putin this week",
    "description": "Amidst escalating tensions, Ukrainian President Zelenskyy has expressed his readiness to meet with Russian President Putin in Turkey this week, following a push from Donald Trump for immediate talks. This development comes after European allies issued an ulti…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ukraine-president-volodymyr-zelenskyy-agrees-meeting-with-putin-this-week/articleshow/121093690.cms",
    "timestamp": "2025-05-12T02:48:13Z"
  },
  {
    "title": "US and China to publish details of 'substantial' trade talks in Geneva",
    "description": "The United States and China are set to provide details on Monday of the \"substantial progress\" made during talks in Switzerland over the weekend aimed at cooling trade tensions ignited by President Donald Trump's sweeping tariffs.",
    "link": "https://www.enca.com/business/us-and-china-publish-details-substantial-trade-talks-geneva",
    "timestamp": "2025-05-12T02:47:19Z"
  },
  {
    "title": "'FREE OF CHARGE': Trump defends prospect of Qatar gifting him Air Force One replacement",
    "description": "Donald Trump has defended the possibility of being gifted an Air Force One replacement by the Qatari royal family.",
    "link": "https://news.sky.com/story/donald-trump-defends-prospect-of-air-force-one-replacement-gift-from-qatar-as-a-very-transparent-deal-13366384",
    "timestamp": "2025-05-12T02:47:00Z"
  },
  {
    "title": "‘We want a permanent solution’: Fear and fatigue in Kashmir after ceasefire",
    "description": "The region, which faced the brunt of the India-Pakistan military escalation, limps back to life. But questions remain.",
    "link": "https://www.aljazeera.com/news/2025/5/12/we-want-permanent-solution-fear-and-fatigue-in-kashmir-after-ceasefire",
    "timestamp": "2025-05-12T02:39:51Z"
  },
  {
    "title": "Taiwan wants US security, tech cooperation despite trade hurdles",
    "description": "Around 60% of Taiwanese exports to the United states fall within the information technology sector and are mainly semiconductors, which are used in everything from televisions and cars to weapons and supercomputers.",
    "link": "https://economictimes.indiatimes.com/tech/technology/taiwan-wants-us-security-tech-cooperation-despite-trade-hurdles/articleshow/121093306.cms",
    "timestamp": "2025-05-12T02:33:56Z"
  },
  {
    "title": "Trump Says Prescription Drug Prices Set To Drop By 30% To 80% 'Almost Immediately' Thanks To 'Most Favored Nation' Plan, Mark Cuban Urges President To 'Force Transparency'",
    "description": "On Sunday, President Donald Trump vowed to slash prescription drug prices through a sweeping executive order.\nWhat Happened: Trump took to Truth Social and announced plans to sign a new executive order. Under what he called a \"most favored nation\" pricing pol…",
    "link": "https://biztoc.com/x/d4780dd62ee8dc7a",
    "timestamp": "2025-05-12T02:31:22Z"
  },
  {
    "title": "As Donald Trump cuts funding to Antarctica, will the US be forced off the icy continent?",
    "description": "Since 1958, the US has led on Antarctic diplomacy and science. Trump’s funding cuts will diminish US capacity in Antarctica as China expands its presence.",
    "link": "https://theconversation.com/as-donald-trump-cuts-funding-to-antarctica-will-the-us-be-forced-off-the-icy-continent-254786",
    "timestamp": "2025-05-12T02:30:57Z"
  },
  {
    "title": "Trump's current stance goes further than previous statements on Kashmir issue, says Foreign Expert",
    "description": "Michael Kugelman discussed India-Pakistan tensions. He highlighted Donald Trump's offer to mediate, noting it was more open-ended than before. Kugelman pointed out Pakistan's attempts to draw global attention to the Kashmir issue. He said Pakistan tries to si…",
    "link": "https://economictimes.indiatimes.com/news/india/trumps-current-stance-goes-further-than-previous-statements-on-kashmir-issue-says-foreign-expert/articleshow/121093205.cms",
    "timestamp": "2025-05-12T02:21:44Z"
  },
  {
    "title": "Donald Trump to get a new Air Force luxury jet from Qatar? Here's all we know about the 'flying palace'",
    "description": "Donald Trump is facing scrutiny for planning to accept a luxury Boeing jet from Qatar as a gift. This raises ethical and legal questions. The US Constitution prohibits gifts from foreign states. Trump claims the plane is a temporary gift for the Defence Depar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-to-get-a-new-air-force-luxury-jet-from-qatar-heres-all-we-know-about-the-flying-palace/articleshow/121093203.cms",
    "timestamp": "2025-05-12T02:21:33Z"
  },
  {
    "title": "Trump Plans To Accept Luxury 747 From Qatar To Use As Air Force One",
    "description": "Trump is set to visit Qatar during a trip to the Middle East this week.",
    "link": "https://www.huffpost.com/entry/trump-plan-accept-luxury-747-qatar_n_682157fbe4b09e4e8c342b3d",
    "timestamp": "2025-05-12T02:17:41Z"
  },
  {
    "title": "UK hosts European ministers for Ukraine talks after ceasefire ultimatum",
    "description": "The UK will on Monday host European ministers for “critical” talks on “repelling Russian aggression”, two days after Ukraine’s allies demanded that Moscow accept a ceasefire. Representatives from France, Germany, Italy, Poland, Spain and the EU will join Fore…",
    "link": "https://www.digitaljournal.com/world/uk-hosts-european-ministers-for-ukraine-talks-after-ceasefire-ultimatum/article",
    "timestamp": "2025-05-12T02:12:20Z"
  },
  {
    "title": "UK Hosts European Ministers For Ukraine Talks After Ceasefire Ultimatum",
    "description": "The UK will on Monday host European ministers for \"critical\" talks on \"repelling Russian aggression\", two days after Ukraine's allies demanded that Moscow accept a ceasefire.",
    "link": "https://www.ibtimes.com/uk-hosts-european-ministers-ukraine-talks-after-ceasefire-ultimatum-3773195",
    "timestamp": "2025-05-12T02:12:12Z"
  },
  {
    "title": "Inside the Qatari luxury jet on offer to President Donald Trump",
    "description": "The Scoop\nThe detailed specifications of a Boeing 747 that appears to be the same plane offered by the Qatari government to President Donald Trump are available online, offering a glimpse inside the luxurious jet.\nThe tail number of the plane, which ABC News …",
    "link": "https://biztoc.com/x/b2744c404fac1431",
    "timestamp": "2025-05-12T02:09:25Z"
  },
  {
    "title": "Trump's tariffs rattle Southeast Asia: What it means for Taiwan's supply chain strategy",
    "description": "The latest round of tariffs from US President Donald Trump is shaking up Southeast Asia's manufacturing heartland, dealing a blow to nations that form the backbone of Taiwan's electronics supply chain. Key countries like Vietnam, Thailand, Indonesia, and Mala…",
    "link": "https://www.digitimes.com/news/a20250509PD211/taiwan-supply-chain-southeast-asia-manufacturing-donald-trump-tariffs.html",
    "timestamp": "2025-05-12T02:07:00Z"
  },
  {
    "title": "Thailand attracts Taiwanese investment as trade tensions reshape supply chains",
    "description": "With US President Donald Trump back in the White House, a new wave of tariff and exchange rate issues has impacted global supply chains. However, unlike in the past, businesses are not hastily expanding overseas. Instead, Thailand remains the top choice for c…",
    "link": "https://www.digitimes.com/news/a20250509PD204/thailand-taiwan-investment-labor-market.html",
    "timestamp": "2025-05-12T02:05:53Z"
  },
  {
    "title": "India's fierce attacks on 8 Pakisani military facilities forced Islamabad to plead for ending hostilities",
    "description": "Government sources report that Pakistan sought peace after India destroyed eight of its air bases. US Secretary of State S Jaishankar conveyed that Pakistan got the message after being hammered by Indian missiles. India retaliated after Pakistan attempted to …",
    "link": "https://economictimes.indiatimes.com/news/defence/indias-fierce-attacks-on-8-pakisani-military-facilities-forced-islamabad-to-plead-for-ending-hostilities/articleshow/121092938.cms",
    "timestamp": "2025-05-12T02:05:07Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order on Monday that could bring down the costs of some medications.",
    "link": "https://www.twincities.com/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-12T02:01:07Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications.",
    "link": "https://www.ksat.com/health/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-12T02:00:36Z"
  },
  {
    "title": "TOTALLY WORTHLESS: GOP Controlled House and Senate Sent Fewer Bills to GOP President Than Any Congress in 70 Years",
    "description": "President Trump won the 2024 election in a landslide, winning the US Presidency with 312 electoral votes, all of the battleground states, the popular vote, the US House of Representatives, The US Senate and 2750 counties across the country.\nThe post TOTALLY W…",
    "link": "https://www.thegatewaypundit.com/2025/05/totally-worthless-gop-controlled-house-senate-sent-fewer/",
    "timestamp": "2025-05-12T02:00:23Z"
  },
  {
    "title": "Qatar Says No Final Decision Made On Gifting Trump A Jet To Use As Air Force One",
    "description": "Trump reportedly is ready to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week.",
    "link": "https://www.huffpost.com/entry/trump-qatar-plane-decision_n_68215044e4b01f1185010ce8",
    "timestamp": "2025-05-12T01:55:55Z"
  },
  {
    "title": "Trump Hails Air Force One 'Gift' After Qatari Luxury Jet Reports",
    "description": "Donald Trump on Sunday defended plans to receive a new Air Force One as a gift, after reports he will accept a luxury Boeing jet from Qatar despite strict rules on presents for US presidents.",
    "link": "https://www.ibtimes.com/trump-hails-air-force-one-gift-after-qatari-luxury-jet-reports-3773194",
    "timestamp": "2025-05-12T01:51:17Z"
  },
  {
    "title": "Trump administration fires top copyright official days after firing Librarian of Congress",
    "description": "The Trump administration has fired the nation’s top copyright official, Shira Perlmutter",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-administration-fires-top-copyright-official-days-after-121692677",
    "timestamp": "2025-05-12T01:50:21Z"
  },
  {
    "title": "Former diplomat, politicians come out in support of Foreign Secretary Vikram Misri after he faces online trolling",
    "description": "Vikram Misri faced online criticism after India and Pakistan agreed to stop military actions. Veteran diplomat Nirupama Menon Rao and politicians like Asaduddin Owaisi and Akhilesh Yadav supported Misri. Yadav condemned the abuse and demanded government actio…",
    "link": "https://economictimes.indiatimes.com/news/india/former-diplomat-politicians-come-out-in-support-of-fs-misri-after-he-faces-online-trolling/articleshow/121092800.cms",
    "timestamp": "2025-05-12T01:50:19Z"
  },
  {
    "title": "Trump hails Air Force One ‘gift’ after Qatari luxury jet reports",
    "description": "Donald Trump on Sunday defended plans to receive a new Air Force One as a gift, after reports he will accept a luxury Boeing jet from Qatar despite strict rules on presents for US presidents. Calling the plane a “flying palace,” ABC News, which first reported…",
    "link": "https://www.digitaljournal.com/world/trump-hails-air-force-one-gift-after-qatari-luxury-jet-reports/article",
    "timestamp": "2025-05-12T01:47:32Z"
  },
  {
    "title": "Dollar gains versus yen on US-China trade optimism; Kiwi climbs",
    "description": "The dollar's value increased in early Asian trading. This happened after discussions between the United States and China reduced worries about a trade conflict. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer reached a deal with China…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-gains-versus-yen-on-us-china-trade-optimism-kiwi-climbs/articleshow/121092730.cms",
    "timestamp": "2025-05-12T01:42:25Z"
  },
  {
    "title": "“The Slopadopolus Show” — Trump Rips ABC’s Martha Raddatz for Dragging Him into Papal Coverage",
    "description": "President Trump unloaded on ABC’s Martha Raddatz Sunday after the longtime network anchor took a bizarre detour during her interview with Cardinal Blase Cupich, insisting that the recent historic election of Pope Leo XIV had “nothing to do with Donald Trump.”…",
    "link": "https://www.thegatewaypundit.com/2025/05/slopadopolus-show-trump-rips-abcs-martha-raddatz-dragging/",
    "timestamp": "2025-05-12T01:40:21Z"
  },
  {
    "title": "Gold falls as 'positive' US-China talks erode safe-haven appeal",
    "description": "Gold prices experienced a decline on Monday as positive signals emerged from U.S.-China trade discussions, diminishing investor apprehension and consequently reducing the appeal of gold as a safe-haven asset. The U.S. and China indicated progress in trade neg…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-falls-as-positive-us-china-talks-erode-safe-haven-appeal/articleshow/121092681.cms",
    "timestamp": "2025-05-12T01:36:17Z"
  },
  {
    "title": "Can King Charles heal a royal family crisis before it’s too late?",
    "description": "New York Times: Could the rift undermine the monarchy's attempts to model unity?",
    "link": "https://www.nzherald.co.nz/lifestyle/can-king-charles-heal-a-royal-family-crisis-before-its-too-late/GHI5E77LZNG2ZCFCCGAKZ74UOY/",
    "timestamp": "2025-05-12T01:35:10Z"
  },
  {
    "title": "Investors welcome news of progress in US-China trade talks; US stock futures rise",
    "description": "U.S. and China trade talks brought a sense of relief to investors, hinting at a potential de-escalation in the trade war. While details remain scarce and major breakthroughs are not expected immediately, the conciliatory tone boosted U.S. stock futures.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-welcome-news-of-progress-in-us-china-trade-talks-us-stock-futures-rise/articleshow/121092660.cms",
    "timestamp": "2025-05-12T01:32:41Z"
  },
  {
    "title": "Trump administration fires top copyright official Shira Perlmutter days after firing Librarian of Congress",
    "description": "The Trump administration has terminated Shira Perlmutter, the nation's top copyright official, shortly after dismissing Librarian of Congress Carla Hayden. Perlmutter's office recently released a report examining AI's use of copyrighted materials, emphasizing…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-fires-top-copyright-official-shira-perlmutter-days-after-firing-librarian-of-congress/articleshow/121092654.cms",
    "timestamp": "2025-05-12T01:32:10Z"
  },
  {
    "title": "US And China To Publish Details Of 'Substantial' Trade Talks In Geneva",
    "description": "The United States and China are set to provide details on Monday of the \"substantial progress\" made during talks in Switzerland over the weekend aimed at cooling trade tensions ignited by President Donald Trump's sweeping tariffs.",
    "link": "https://www.ibtimes.com/us-china-publish-details-substantial-trade-talks-geneva-3773191",
    "timestamp": "2025-05-12T01:30:17Z"
  },
  {
    "title": "Letters: It’s pity Joe Duffy didn’t give credit to his hard-working background support staff",
    "description": "I was very disappointed with broadcaster Joe Duffy on Friday’s RTÉ Late Late Show.",
    "link": "https://www.independent.ie/opinion/letters/letters-its-pity-joe-duffy-didnt-give-credit-to-his-hard-working-background-support-staff/a636844603.html",
    "timestamp": "2025-05-12T01:30:00Z"
  },
  {
    "title": "Volodymyr Zelensky in vow to meet Vladimir Putin in person this week for talks",
    "description": "Ukrainian president Volodymyr Zelensky has promised to personally meet Russian president Vladimir Putin in Turkey this week after Russia offered to negotiate a peace deal.",
    "link": "https://www.independent.ie/world-news/europe/volodymyr-zelensky-in-vow-to-meet-vladimir-putin-in-person-this-week-for-talks/a637273237.html",
    "timestamp": "2025-05-12T01:30:00Z"
  },
  {
    "title": "US House approves restrictions on partnerships between US and Chinese universities",
    "description": "Separately, appropriation panel hears Agriculture Department is developing federal plan to limit Chinese ownership of US farmland Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/12/us-house-approves-restrictions-on-partnerships-between-us-and-chinese-universities",
    "timestamp": "2025-05-12T01:30:00Z"
  },
  {
    "title": "Fintechs’ expansion play; Doubling down on Apple",
    "description": "Happy Monday! New-age fintech AMCs are establishing a niche in a market dominated by banks and traditional wealth managers. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/fintechs-expansion-play-doubling-down-on-apple/articleshow/121092541.cms",
    "timestamp": "2025-05-12T01:28:15Z"
  },
  {
    "title": "Prince Harry and Meghan Markle mocked with savage joke on 'Saturday Night Live'",
    "description": "Colin Jost mocked Prince Harry and Meghan Markle with a joke during the \"Weekend Update\" segment on the most recent episode of \"Saturday Night Live.\"",
    "link": "https://www.foxnews.com/entertainment/prince-harry-meghan-markle-mocked-savage-joke-saturday-night-live",
    "timestamp": "2025-05-12T01:28:07Z"
  },
  {
    "title": "Ukraine, Gaza and China: Why Trump's Middle East tour takes on new importance",
    "description": "Donald Trump's tour of the Middle East this week has taken on a new importance after a series of surprising developments on the wars in Ukraine and Gaza, and on trade between the US and China.",
    "link": "https://news.sky.com/story/ukraine-gaza-and-china-why-trumps-middle-east-tour-takes-on-new-importance-13366383",
    "timestamp": "2025-05-12T01:28:00Z"
  },
  {
    "title": "US and China to publish details of ‘substantial’ trade talks in Geneva",
    "description": "The United States and China are set to provide details on Monday of the “substantial progress” made during talks in Switzerland over the weekend aimed at cooling trade tensions ignited by President Donald Trump’s sweeping tariffs. US Treasury Scott Bessent an…",
    "link": "https://www.digitaljournal.com/world/us-and-china-to-publish-details-of-substantial-trade-talks-in-geneva/article",
    "timestamp": "2025-05-12T01:27:32Z"
  },
  {
    "title": "AMERICA Prayer Vigil 5/12/25 {Prayer}",
    "description": "Join together with Fellow FREEPERS to Pray for AMERICA: For those in Authority in Government, Family, Military, Business, Healthcare, Education, Churches, and the Media.'I Urge, then, First of All, that Requests, Prayers, Intercession and Thanksgiving be Made…",
    "link": "https://freerepublic.com/focus/f-religion/4316431/posts",
    "timestamp": "2025-05-12T01:25:11Z"
  },
  {
    "title": "Trump Announces Order To Reduce Prescription Drug Prices",
    "description": "Trump Announces Order To Reduce Prescription Drug Prices\n \nAuthored by Joseph Lord via The Epoch Times,\nPresident Donald Trump announced on May 11 that he would sign an executive order that he said would reduce prescription drug prices “almost immediately.”\n“…",
    "link": "https://biztoc.com/x/77898d5a0749a5fc",
    "timestamp": "2025-05-12T01:24:39Z"
  },
  {
    "title": "Trump to Sign Executive Order to Slash Prescription Drug Prices",
    "description": "President Donald Trump says he will announce a new prescription drug initiative he promises will dramatically—and immediately—reduce the price of pharmaceuticals. “I am pleased to... Read More\nThe post Trump to Sign Executive Order to Slash Prescription Drug …",
    "link": "https://www.dailysignal.com/2025/05/11/trump-sign-executive-order-slash-prescription-drug-prices/",
    "timestamp": "2025-05-12T01:17:13Z"
  },
  {
    "title": "Stock Market Highlights 12 May 2025: Sensex, Nifty soar on India-Pakistan ceasefire agreement, US-China trade talks",
    "description": "Sensex, Nifty, Share Prices: The markets witnessed an unprecedented rally on Monday, with benchmark indices recording their biggest single-day gains in nearly four years, driven by a series of positive geopolitical developments and global trade optimism. The …",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-12-may-2025/article69563844.ece",
    "timestamp": "2025-05-12T01:17:07Z"
  },
  {
    "title": "Sununu says Trump administration has ‘ about six weeks’ on China tariff deal to give market, small businesses confidence - The Hill",
    "description": "Sununu says Trump administration has ‘ about six weeks’ on China tariff deal to give market, small businesses confidenceThe Hill White House announces U.S.-China trade deal, offers few detailsCNBC U.S. and China cite progress in trade talks but release few de…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177453265",
    "timestamp": "2025-05-12T01:15:33Z"
  },
  {
    "title": "Donald Trump prizes more Gulf investment in the US - BBC",
    "description": "Donald Trump prizes more Gulf investment in the USBBC Trump is visiting three of the world’s richest nations. Here’s what’s on their wish listCNN Opinion | This Israeli Government Is Not Our AllyThe New York Times Why Trump is focusing on business deals on hi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177453261",
    "timestamp": "2025-05-12T01:15:13Z"
  },
  {
    "title": "Qatar, Egypt welcome release of Israeli-American hostage Edan Alexander",
    "description": "Qatar and Egypt say that the release of Edan Alexander is a \"goodwill gesture\" toward reviving ceasefire talks.",
    "link": "https://www.israelnationalnews.com/news/408194",
    "timestamp": "2025-05-12T01:14:00Z"
  },
  {
    "title": "Elon Musk’s Regulatory Woes Are Conveniently Vanishing Under Trump",
    "description": "The Trump administration has been a boon for Elon Musk‘s companies’ regulatory issues. The billionaire who has run the so-called Department of Government Efficiency (DOGE) responsible for gutting certain federal agencies is now enjoying less scrutiny over his…",
    "link": "https://biztoc.com/x/65b14b5b997029f0",
    "timestamp": "2025-05-12T01:13:32Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications.",
    "link": "https://www.wsls.com/health/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-12T01:12:09Z"
  },
  {
    "title": "John Fetterman 'Of Course' Being Wooed by GOP Amid Liberal Backlash—Senator",
    "description": "GOP senators defend Fetterman as Democrats debate his future amid health concerns and Republican outreach efforts.",
    "link": "https://www.newsweek.com/john-fetterman-course-wooed-gop-liberal-backlash-senator-2070744",
    "timestamp": "2025-05-12T01:09:42Z"
  },
  {
    "title": "Asian stocks, US futures gain on China trade talks",
    "description": "Shares in Australia, Japan and South Korea advanced at the open, with the Topix index gaining for a 12th day for its longest winning streak since October 2017. Futures contract for the S&P 500 and the Nasdaq 100 both climbed more than 1.2%, while oil rose and…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-us-futures-gain-on-china-trade-talks/articleshow/121092491.cms",
    "timestamp": "2025-05-12T01:02:32Z"
  },
  {
    "title": "Looking for direction, Democrats consult pundits",
    "description": "The Scoop\nIn the wake of their loss to now-President Donald Trump, Democrats are increasingly seeking out answers from prominent figures in the media.\nLast week, Axios reported that New York Times columnist and popular podcaster Ezra Klein was going to brief …",
    "link": "https://biztoc.com/x/1f5516709112058e",
    "timestamp": "2025-05-12T01:02:07Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "Donald Trump announced he will sign an executive order aiming to lower drug costs by tying Medicare prices for certain medications administered in doctor's offices to the lowest prices paid by other countries. This \"most favored nation\" policy, targeting drug…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/articleshow/121092484.cms",
    "timestamp": "2025-05-12T01:00:44Z"
  },
  {
    "title": "'Free of charge': Trump confirms admin is getting a 'gifted' plane from Iran-tied nation",
    "description": "Donald Trump on Sunday confirmed the \"fact\" that the Defense Department will be receiving a free aircraft from a nation with ties to Iran.\n\nIt was reported that Trump's administration would be gifted a $400 million plane from Qatar, and that the plane would b…",
    "link": "https://www.rawstory.com/trump-admits-qatar-gift-plane/",
    "timestamp": "2025-05-12T01:00:32Z"
  },
  {
    "title": "Klobuchar tells NBC she wants to 'move forward,' not dwell on the past, when pressed on Biden comments",
    "description": "Sen. Amy Klobuchar rebuffed questions about former President Biden's recent media appearances on Sunday during \"Meet the Press,\" arguing that the the party needed to move forward.",
    "link": "https://www.foxnews.com/media/klobuchar-tells-nbc-she-wants-move-forward-when-pressed-biden-comments",
    "timestamp": "2025-05-12T01:00:22Z"
  },
  {
    "title": "Prospects of Saudi ties to Israel elusive as Trump seeks $1 trillion bonanza",
    "description": "Supporters of normalizing relations say it would bring stability and prosperity to the region, while countering Iran's influence.",
    "link": "https://www.japantimes.co.jp/news/2025/05/12/world/politics/saudi-ties-israel-trump-trillion/",
    "timestamp": "2025-05-12T01:00:00Z"
  },
  {
    "title": "“Stay true to your risk appetite, but market will certainly award risk-takers, high-growth stocks”, says Motilal Oswal CIO",
    "description": "Sandipan Roy, CIO, Motilal Oswal Private Wealth, is confident about a long-term uptrend in the equity market and urges investors to hold their positions. In a conversation with ET Wealth’s Sameer Bhardwaj, he explains how the recent fiscal and monetary measur…",
    "link": "https://economictimes.indiatimes.com/wealth/invest/stay-true-to-your-risk-appetite-but-market-will-certainly-award-risk-takers-high-growth-stocks-says-motilal-oswal-cio/articleshow/121050637.cms",
    "timestamp": "2025-05-12T01:00:00Z"
  },
  {
    "title": "2nd Maine School District Repeals Pro-Trans Policy After Nearly Unanimous Board Vote",
    "description": "A second Maine school district has voted to revoke its pro-transgender policies in defiance of Democrat Gov. Janet Mills.\nThe post 2nd Maine School District Repeals Pro-Trans Policy After Nearly Unanimous Board Vote appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/11/second-maine-school-district-repeals-pro-trans-policy-board-vote/",
    "timestamp": "2025-05-12T00:59:06Z"
  },
  {
    "title": "Trump Gulf trip promises good news for US business - Financial Times",
    "description": "Trump Gulf trip promises good news for US businessFinancial Times Trump is visiting three of the world’s richest nations. Here’s what’s on their wish listCNN Donald Trump prizes more Gulf investment in the USBBC Opinion | This Israeli Government Is Not Our Al…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177452955",
    "timestamp": "2025-05-12T00:55:02Z"
  },
  {
    "title": "Trump: I won Catholic vote by a lot",
    "description": "United States President Donald Trump slammed ABC News journalist Martha Raddatz, who commented that Cardinal Robert Francis Prevost's election as Pope Leo XIV was not linked to him.\"It came out of now...",
    "link": "https://biztoc.com/x/b851e9b9416309d4",
    "timestamp": "2025-05-12T00:51:03Z"
  },
  {
    "title": "Trump Reportedly Set To Accept 'Flying Palace' From Qatar, White House Says Lavish Gift Of Boeing Jumbo Jet Complies With 'All Applicable Laws'",
    "description": "The Trump administration is preparing to receive a luxurious Boeing 747-8 jumbo jet from Qatar’s royal family.\nWhat Happened: This aircraft is set to become the new Air Force One for President Donald Trump until the conclusion of his term, reported ABC News.\n…",
    "link": "https://biztoc.com/x/ce9425500706e3e3",
    "timestamp": "2025-05-12T00:50:35Z"
  },
  {
    "title": "US and China hail 'constructive' Geneva trade talks",
    "description": "The US and China end high-stakes trade talks on a positive note, with US officials touting a \"deal\" to reduce the US trade deficit while Chinese officials said the sides had reached an \"important consensus\".",
    "link": "https://www.abc.net.au/news/2025-05-12/china-us-hail-constructive-geneva-trade-talks/105280784",
    "timestamp": "2025-05-12T00:49:02Z"
  },
  {
    "title": "Qatar offers Trump jumbo jet to serve as Air Force One",
    "description": "The Qatar royal family gifted President Donald Trump a Boeing 747-8 jumbo jet to use as Air Force One as Boeing prepares the new fleet of presidential planes.",
    "link": "https://www.foxnews.com/politics/qatar-offers-trump-jumbo-jet-serve-air-force-one",
    "timestamp": "2025-05-12T00:47:01Z"
  },
  {
    "title": "Trump Reveals Edan Alexander Released by Hamas: 'Coming Home to His Family'",
    "description": "President Donald Trump revealed that Edan Alexander, 21, who is believed to be the last living American hostage held by Hamas, was released and \"coming home to his family.\"\nThe post Trump Reveals Edan Alexander Released by Hamas: ‘Coming Home to His Family’ a…",
    "link": "https://www.breitbart.com/middle-east/2025/05/11/trump-reveals-edan-alexander-released-hamas-coming-home/",
    "timestamp": "2025-05-12T00:36:57Z"
  },
  {
    "title": "Trump plans to accept 747 from Qatar to use as Air Force One, source says",
    "description": "Donald Trump is reportedly ready to accept a plane so luxurious it is known as a \"flying palace\" from the ruling family of Qatar during his trip to the Middle East this week, while Qatar's media says that \"no decision has been made\".",
    "link": "https://www.abc.net.au/news/2025-05-12/us-discussions-jumbo-jet-gift-trump-from-qatar-family/105280696",
    "timestamp": "2025-05-12T00:32:23Z"
  },
  {
    "title": "‘Coming Home to His Family’: Trump Announces Edan Alexander, Last Living American Held Hostage by Hamas To Be Released",
    "description": "The last American held hostage by Hamas is coming home, Donald Trump confirmed on Sunday after reports that Hamas was going to make a gesture of \"good will.\"\nThe post ‘Coming Home to His Family’: Trump Announces Edan Alexander, Last Living American Held Hosta…",
    "link": "https://www.mediaite.com/news/coming-home-to-his-family-trump-announces-edan-alexander-last-living-american-held-hostage-by-hamas-to-be-released/",
    "timestamp": "2025-05-12T00:26:28Z"
  },
  {
    "title": "'No change in position': India on Trump's offer to mediate on Kashmir",
    "description": "India News: NEW DELHI: Buoyed by his \"mediation\" of what he described as a ceasefire between India and Pakistan, President Donald Trump waded into the J&K issue a.",
    "link": "https://timesofindia.indiatimes.com/india/no-change-in-position-india-on-trumps-offer-to-mediate-on-kashmir/articleshow/121092018.cms",
    "timestamp": "2025-05-12T00:22:29Z"
  },
  {
    "title": "Trump admin fires top US copyright official days after terminating Librarian of Congress",
    "description": "U.S. Copyright Office head Shira Perlmutter was terminated by the Trump administration on Saturday, just days after the Librarian of Congress was fired.",
    "link": "https://www.foxnews.com/politics/trump-admin-fires-top-us-copyright-official-days-after-terminating-librarian-congress",
    "timestamp": "2025-05-12T00:20:15Z"
  },
  {
    "title": "Conflict impact on markets limited but India lacks stronger drivers: Christy Tan, Franklin Templeton",
    "description": "For the Indian equity markets to go from strength to strength, there have to be stronger drivers. And that could be something that is missing. And if you accompany that with rich valuations, then that could set the stage for the upside prospects to be quite l…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/conflict-impact-on-markets-limited-but-india-lacks-stronger-drivers-christy-tan-franklin-templeton/articleshow/121092082.cms",
    "timestamp": "2025-05-12T00:19:03Z"
  },
  {
    "title": "FTC Holds Off on Enforcing ‘Click to Cancel’ Subscription Rule",
    "description": "What if canceling a subscription were as easy as signing up for one? That was the thinking behind the Negative Option Rule — more popularly known as the “click to cancel” regulation, first proposed in 2023.  That rule went into effect earlier this year, with …",
    "link": "https://www.pymnts.com/subscriptions/2025/ftc-holds-off-on-enforcing-click-to-cancel-subscription-rule/",
    "timestamp": "2025-05-12T00:16:44Z"
  },
  {
    "title": "Can AI spark growth and joy for offline retail?",
    "description": "AI-powered location management tools can now update each store’s data across multiple search engines and maps, helping customers find and navigate to their nearest store without any friction.",
    "link": "https://www.livemint.com/opinion/columns/delivery-apps-online-retail-ai-growth-offline-retail-groceries-smartphones-google-maps-apple-maps-customers-offline-11746709913809.html",
    "timestamp": "2025-05-12T00:15:14Z"
  },
  {
    "title": "Trump to Sign Executive Order Reducing Cost of Prescription, Pharmaceutical Drug Prices",
    "description": "President Donald Trump revealed that he would be signing an executive order on Monday reducing the cost of prescription and pharmaceutical drugs by 30 to 80 percent.\nThe post Trump to Sign Executive Order Reducing Cost of Prescription, Pharmaceutical Drug Pri…",
    "link": "https://www.breitbart.com/politics/2025/05/11/trump-executive-order-reducing-cost-prescription-drugs/",
    "timestamp": "2025-05-12T00:13:21Z"
  },
  {
    "title": "South Korean conservative party fails in bid to switch presidential candidates",
    "description": "Seoul, May 11: South Korea’s embattled conservative party cancelled and then reinstated the presidential candidacy of Kim Moon Soo within hours as internal turmoil escalated ahead of the June 3 election. Saturday’s chaotic U-turn, after a failed attempt to re…",
    "link": "https://thehillstimes.in/international/south-korean-conservative-party-fails-in-bid-to-switch-presidential-candidates",
    "timestamp": "2025-05-12T00:10:00Z"
  },
  {
    "title": "Trump says last living American hostage Edan Alexander will be released by Hamas: 'Coming home'",
    "description": "President Donald Trump confirmed that Edan Alexander, a dual U.S.-Israeli citizen, who has been held captive in Gaza since the October 7 Hamas attack on Israel, would return home.",
    "link": "https://www.foxnews.com/politics/trump-says-last-living-american-hostage-edan-alexander-released-hamas-coming-home",
    "timestamp": "2025-05-12T00:09:20Z"
  },
  {
    "title": "Trump's Middle East visit to trigger historic arms race, strengthen US economy with F-15EX deals",
    "description": "Upon learning of Boeing’s plan to develop this new aircraft, the Pentagon quickly recognized it as the ideal replacement for the three US Air Force divisions currently operating the F-15.",
    "link": "https://www.jpost.com/middle-east/article-853591",
    "timestamp": "2025-05-12T00:07:21Z"
  },
  {
    "title": "Lizzy Savetsky criticizes Trump’s recent moves: We’d be outraged if it were Biden",
    "description": "Online pro-Israel advocate Lizzy Savetsky voices concern over President Trump’s recent Middle East moves, including skipping Israel, rumored Hamas and Iran talks, and accepting a $400 million jet from Qatar. “Trump’s record is strong, but things feel differen…",
    "link": "https://www.israelnationalnews.com/news/408193",
    "timestamp": "2025-05-12T00:05:07Z"
  },
  {
    "title": "Big Wall Street comeback is upending a slew of bear market bets",
    "description": "Trades that got crowded in April's tumult have suddenly become vulnerable, among them shorting the US dollar, betting against equities and wagering on higher market volatility. Behind the backfiring wagers has been Donald Trump's concessionary tone on tariffs…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-wall-street-comeback-is-upending-a-slew-of-bear-market-bets/articleshow/121091584.cms",
    "timestamp": "2025-05-12T00:04:14Z"
  },
  {
    "title": "Trump promises to order that the US pay only the price other nations do for some drugs",
    "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications.",
    "link": "https://www.click2houston.com/health/2025/05/11/trump-promises-to-order-that-the-us-pay-only-the-price-other-nations-do-for-some-drugs/",
    "timestamp": "2025-05-12T00:00:40Z"
  },
  {
    "title": "The US Copyright Office has thoughts on how AI is trained. Big Tech may not like it.",
    "description": "AI companies like OpenAI and Meta use data made by others to train their AI models. The US Copyright Office says, in some cases, that may be illegal.",
    "link": "https://www.businessinsider.com/ai-training-copyright-laws-big-tech-fair-use-openai-meta-2025-5",
    "timestamp": "2025-05-11T23:59:36Z"
  },
  {
    "title": "Trump prizes more Gulf investment in the US",
    "description": "Trump prizes more Gulf investment in the US\nWith US President Donald Trump due to visit Gulf states this week, a key focus will be securing significant new investment for the US economy.\n\"President Trump wants the announcement [of more Gulf money for the US],…",
    "link": "https://biztoc.com/x/7b9bebe848859ed4",
    "timestamp": "2025-05-11T23:55:02Z"
  },
  {
    "title": "Donald Trump slammed over gift of $620 million jet from Qatar",
    "description": "‘It’s not just bribery, it’s premium foreign influence with extra legroom.’",
    "link": "https://7news.com.au/news/donald-trump-slammed-over-gift-of-620-million-jet-from-qatar-c-18661713",
    "timestamp": "2025-05-11T23:51:47Z"
  },
  {
    "title": "White South Africans leave for US under Trump refugee plan",
    "description": "White South Africans make up around 7% of the country's population. But they still own some 78% of private farmland in South Africa and have about 20 times the wealth of Black South Africans.",
    "link": "https://www.dw.com/en/white-south-africans-leave-for-us-under-trump-refugee-plan/a-72511336",
    "timestamp": "2025-05-11T23:50:00Z"
  },
  {
    "title": "Pope Leo XIV's Brother Reshared Post Calling Nancy Pelosi A Nasty Term",
    "description": "Pope Leo XIV's brother will need to cop to using some unsavory language at his next confession ... 'cause he called Nancy Pelosi a bad word in a resurfaced social media post. The pope's older brother, Louis Prevost, is a regular poster of political…\n Permalink",
    "link": "https://www.tmz.com/2025/05/11/pope-leo-the-xivs-brother-reshared-post-nancy-pelosi-swear-word/",
    "timestamp": "2025-05-11T23:46:55Z"
  },
  {
    "title": "Trump confirms release of hostage Edan Alexander: 'I am grateful'",
    "description": "US President Donald Trump confirmed on Sunday the release of hostage Edan Alexander, who is being held captive",
    "link": "https://www.jpost.com/breaking-news/article-853596",
    "timestamp": "2025-05-11T23:46:39Z"
  },
  {
    "title": "Trump to sign executive order to cut prescription drug prices by 30% to 80% — he says to match other countries",
    "description": "In a post on Truth Social, Trump said he would sign the executive order on Monday morning to pursue what is known as \"most favored nation\" pricing or international reference pricing.",
    "link": "https://nypost.com/2025/05/11/us-news/trump-to-sign-executive-order-to-cut-prescription-drug-prices-by-30-to-80-he-says-to-match-other-countries/",
    "timestamp": "2025-05-11T23:45:40Z"
  },
  {
    "title": "Trump to sign executive order he says will slash drug prices by up to 80% (Greg Wehner/Fox News)",
    "description": "Greg Wehner / Fox News:\nTrump to sign executive order he says will slash drug prices by up to 80%  —  Trump calls out Democrats and announces plans to drop prices of prescription drugs ‘almost immediately’  —  President Donald Trump announced he plans to sign…",
    "link": "https://www.memeorandum.com/250511/p49",
    "timestamp": "2025-05-11T23:45:01Z"
  },
  {
    "title": "Israeli strikes on Gaza kill 11 people, mostly women and children",
    "description": "Deir Al-Balah (Gaza Strip), May 11: Israeli strikes overnight and into Sunday killed 11 people in the Gaza Strip, mostly women and children, according to local health officials. Two of the strikes hit tents in the southern city of Khan Younis, each killing tw…",
    "link": "https://thehillstimes.in/international/israeli-strikes-on-gaza-kill-11-people-mostly-women-and-children",
    "timestamp": "2025-05-11T23:45:00Z"
  },
  {
    "title": "Trump prizes more Gulf investment in the US",
    "description": "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States.",
    "link": "https://www.bbc.com/news/articles/crk2me7vjxxo",
    "timestamp": "2025-05-11T23:44:47Z"
  },
  {
    "title": "Trump confirms Hamas plans to release US-Israeli hostage",
    "description": "United States President Donald Trump confirmed that Hamas would be releasing US-Israeli hostage Edan Alexander, voicing his hope that the move would be \"the first of those final steps necessary t...",
    "link": "https://biztoc.com/x/d4787b7a6471438b",
    "timestamp": "2025-05-11T23:44:19Z"
  },
  {
    "title": "Why China will win the arms race",
    "description": "When Donald Trump visits the Middle East this week, he will bump into some familiar people. Elon Musk, Mark Zuckerberg, Larry Fink and Sam Altman will also be in Riyadh. I doubt they will spend much time talking about Gaza, or Iran. They are all there for the…",
    "link": "https://biztoc.com/x/7b0ce85b46d116d3",
    "timestamp": "2025-05-11T23:44:17Z"
  }
]