[
  {
    "title": "Sen. Warren Gets Surprise Phone Call From POTUS After Dubbing Him A 'Wannabe Dictator'",
    "description": "Warren got the White House's attention after taking Trump to task over the affordability crisis in a Monday speech.",
    "link": "https://www.huffpost.com/entry/warren-trump-call-wannabe-dictator_n_69669070e4b09c0a939bdd8b",
    "timestamp": "2026-01-13T21:32:00Z"
  },
  {
    "title": "Disguised U.S. Military Plane Attack on Suspected Drug Boat Violates International Law",
    "description": "The Pentagon used a military aircraft painted to look like a civilian plane to attack a boat off the coast of Venezuela in September -- the Trump administration claimed the boat was transporting drugs -- and that deception violates international law, The New …",
    "link": "https://www.tmz.com/2026/01/13/trump-reportedly-committed-perfidy-during-conflict/",
    "timestamp": "2026-01-13T21:31:47Z"
  },
  {
    "title": "Nikki Glaser Says Political Humor Didn’t Belong at the Golden Globes: ‘It’s Not Funny’",
    "description": "The host thinks gags about ICE and Trump feel “too trivial,” adding, “It’s hard to strike the right tone”\nThe post Nikki Glaser Says Political Humor Didn’t Belong at the Golden Globes: ‘It’s Not Funny’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/awards/nikki-glaser-avoided-political-jokes-golden-globes/",
    "timestamp": "2026-01-13T21:31:08Z"
  },
  {
    "title": "Clintons reject US Congress subpoena to testify in Epstein investigation",
    "description": "Former US president and former secretary of state accuse Republicans of seeking to 'harass and embarrass' with probe.",
    "link": "https://www.aljazeera.com/news/2026/1/13/clintons-reject-us-congress-subpoena-to-testify-in-epstein-investigation",
    "timestamp": "2026-01-13T21:30:45Z"
  },
  {
    "title": "'A true American original': Trump, Vance, Musk, and others pay tribute to the late Scott Adams amid leftist attacks",
    "description": "Following the heartbreaking news of Scott Adams' death on Tuesday, the leftist media wasted no time before slinging mud at the ardent conservative cartoonist and author. However many conservative political figures and commentators came to the \"Dilbert\" creato…",
    "link": "https://www.theblaze.com/news/a-true-american-original-trump-vance-musk-and-others-pay-tribute-to-the-late-scott-adams-amid-leftist-attacks",
    "timestamp": "2026-01-13T21:30:00Z"
  },
  {
    "title": "Ticker: Wall Street executives warn Trump: Stop attacking the Fed and credit card industry; At-home STD tests offer new options for screening",
    "description": "Ticker: Wall Street executives warn Trump: Stop attacking the Fed and credit card industry; At-home STD tests offer new options for screening",
    "link": "https://www.bostonherald.com/2026/01/13/ticker-wall-street-executives-warn-trump-stop-attacking-the-fed-and-credit-card-industry-at-home-std-tests-offer-new-options-for-screening/",
    "timestamp": "2026-01-13T21:29:46Z"
  },
  {
    "title": "Trump travel ban leaves Senegal, Ivory Coast fans in limbo for World Cup",
    "description": "Fans of two of Africa's top soccer nations have had their World Cup plans upended because of a travel ban imposed by the Trump administration. Senegal and Ivory Coast were added in December to the list of countries with partial restrictions on entry to the Un…",
    "link": "https://japantoday.com/category/sports/trump-travel-ban-leaves-senegal-ivory-coast-fans-in-limbo-for-world-cup",
    "timestamp": "2026-01-13T21:29:29Z"
  },
  {
    "title": "Experts press for large‑scale US offensive cyber operations at House hearing",
    "description": "The U.S. will be “hamstrung” until it fully integrates cyber and computer network matters into its military doctrine, the head of the McCrary Institute for Cyber and Critical Infrastructure said.",
    "link": "https://www.nextgov.com/cybersecurity/2026/01/experts-press-largescale-us-offensive-cyber-operations-house-hearing/410656/",
    "timestamp": "2026-01-13T21:28:00Z"
  },
  {
    "title": "As enhanced ACA subsidies lapse, millions poised to drop health insurance",
    "description": "About 1.5 million people have dropped their Affordable Care Act marketplace health coverage, federal data shows. The decline comes as premium subsidies lapsed.",
    "link": "https://www.cnbc.com/2026/01/13/enhanced-aca-subsidies-lapse-uninsured.html",
    "timestamp": "2026-01-13T21:27:24Z"
  },
  {
    "title": "Donald Trump Jr. Calls Out Hollywood 'Clowns' for Wearing Anti-ICE Pins After Renee Nicole Good's Death",
    "description": "Donald Trump Jr. has called out Hollywood 'clowns' for wearing anti-ICE pins after Renee Nicole Good was shot by an ICE agnet.",
    "link": "https://radaronline.com/p/donald-trump-jr-renee-nicole-good-death-blasts-hollywood-clowns-pins/",
    "timestamp": "2026-01-13T21:27:15Z"
  },
  {
    "title": "Meta's Trump Hire Dina Powell McCormick Puts a $600B Tech Giant at the Centre of US Politics",
    "description": "Meta appoints former Trump adviser Dina Powell McCormick as president, blending the company's AI ambitions with deep political ties and influence over US policy.",
    "link": "https://www.ibtimes.com/metas-trump-hire-dina-powell-mccormick-puts-600b-tech-giant-centre-us-politics-3795242",
    "timestamp": "2026-01-13T21:27:10Z"
  },
  {
    "title": "Bill Maher Claims He’s Never Won an Emmy Because ‘Woke Town’ Hollywood Hates Him Speaking ‘Freely’",
    "description": "Bill Maher believes he's been snuffed an Emmy win dozens of times because \"woke\" Hollywood hates him speaking \"freely.\"\nThe post Bill Maher Claims He’s Never Won an Emmy Because ‘Woke Town’ Hollywood Hates Him Speaking ‘Freely’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/bill-maher-claims-hes-never-won-an-emmy-because-woke-town-hollywood-hates-him-speaking-freely/",
    "timestamp": "2026-01-13T21:26:41Z"
  },
  {
    "title": "Will inflation report impact feud between Trump, Federal Reserve?",
    "description": "What is the U.S. inflation rate? Why is the DOJ investigating Fed chairman Jerome Powell? Can President Trump fire Federal Reserve chairman?",
    "link": "https://www.deseret.com/business/2026/01/13/donald-trump-jerome-powell-federal-reserve-inflation-interest-rates-doj-investigation/",
    "timestamp": "2026-01-13T21:26:30Z"
  },
  {
    "title": "Trump ending protected immigration status for Somalis, long a target of his anti-immigrant barbs",
    "description": "Donald Trump’s administration said Tuesday it will end temporary protected status for immigrants from Somalia, the latest move in the president's mass deportation agenda.  The move affects hundreds of people who are a small subset of immigrants with TPS prote…",
    "link": "https://japantoday.com/category/world/trump-is-ending-protected-immigration-status-for-somalis-long-a-target-of-his-anti-immigrant-barbs",
    "timestamp": "2026-01-13T21:26:09Z"
  },
  {
    "title": "Trump’s exercise of raw power upends world order, sending friends and foes reeling",
    "description": "He has toppled Venezuela’s leader, vowed to control its vast oil reserves and threatened other Latin American countries with similar military action. He has talked openly about annexing Greenland, even by force. And, beyond the Western Hemisphere, he has warn…",
    "link": "https://japantoday.com/category/world/trump%E2%80%99s-exercise-of-raw-power-upends-world-order-sending-friends-and-foes-reeling1",
    "timestamp": "2026-01-13T21:25:50Z"
  },
  {
    "title": "China urges Canada to break from U.S. influence as PM Carney visits Beijing",
    "description": "As Canadian leader Mark Carney arrives in China on Wednesday, his hosts see an opportunity to peel the longtime U.S. ally away from their rival, at least a bit. China's state media is calling on the Canadian government to set a foreign policy path independent…",
    "link": "https://japantoday.com/category/world/china-urges-canada-to-break-from-us-influence-as-pm-carney-visits-beijing",
    "timestamp": "2026-01-13T21:25:39Z"
  },
  {
    "title": "SIR scrutiny only for voter rolls, not deportation: EC",
    "description": "India News: NEW DELHI: Election Commission on Tuesday told Supreme Court that scrutiny of citizenship during SIR of voter lists was only meant to ensure deletion .",
    "link": "https://timesofindia.indiatimes.com/india/sir-scrutiny-only-for-voter-rolls-not-deportation-ec/articleshow/126512922.cms",
    "timestamp": "2026-01-13T21:25:10Z"
  },
  {
    "title": "Trump’s Detroit trip puts manufacturing back in focus amid U.S. factory job slump",
    "description": "President Donald Trump traveled to Detroit on Tuesday, aiming to refocus attention on U.S. manufacturing and his efforts to tackle high consumer costs as the White House strives to show it is addressing ‌the economic anxieties gripping U.S. households. The vi…",
    "link": "https://japantoday.com/category/world/trump%E2%80%99s-detroit-trip-puts-manufacturing-back-in-focus-amid-us-factory-job-slump",
    "timestamp": "2026-01-13T21:25:05Z"
  },
  {
    "title": "Clintons refuse to testify in House Epstein probe as Republicans threaten contempt proceedings",
    "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton said Tuesday that they will refuse to comply with a congressional subpoena to testify in a House committee's investigation of Jeffrey Epstein even as Republican lawmakers prepare cont…",
    "link": "https://japantoday.com/category/world/clintons-refuse-to-testify-in-house-epstein-investigation-as-republicans-threaten-contempt-charges1",
    "timestamp": "2026-01-13T21:24:58Z"
  },
  {
    "title": "Trump urges Iranians to keep protesting, says 'help is on its way'",
    "description": "U.S. President Donald Trump urged Iranians on Tuesday to keep protesting and said help was on the way, without giving details, as Iran's clerical establishment pressed its crackdown against the biggest demonstrations in years. &quot;Iranian Patriots, KEEP PRO…",
    "link": "https://japantoday.com/category/world/trump-urges-iranians-to-keep-protesting-says-%27help-is-on-its-way%273",
    "timestamp": "2026-01-13T21:24:29Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "Humanitarian Coordinator for the Occupied Palestinian Territory Ramiz Alakbarov has begun a three-day visit to the Gaza Strip. In Khan Younis, he met with displaced families who have been supported by the UN to move away from the flood-prone shoreline to Hama…",
    "link": "https://press.un.org/en/2026/db260113.doc.htm",
    "timestamp": "2026-01-13T21:24:27Z"
  },
  {
    "title": "POTUS Touts ‘Trump Economic Boom' Is Underway",
    "description": "President Donald Trump touted the \"Trump economic boom\" is underway during his remarks at the Detroit Economic Club in Michigan Tuesday.\nThe post POTUS Touts ‘Trump Economic Boom’ Is Underway appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2026/01/13/potus-touts-trump-economic-boom-is-underway/",
    "timestamp": "2026-01-13T21:22:42Z"
  },
  {
    "title": "'Golden Dome' missile shield to be tested by Trump in key American territory",
    "description": "The Golden Dome missile defense system, a scaled-up version of Israel's Iron Dome, will be tested in Guam, according to Del. James Moylan, as tensions rise in the Pacific region.",
    "link": "https://www.foxnews.com/politics/golden-dome-missile-shield-tested-trump-key-american-territory",
    "timestamp": "2026-01-13T21:22:42Z"
  },
  {
    "title": "Trump declares an 'economic boom' as Americans continue to worry over prices",
    "description": "President Donald Trump declared that \"the Trump economic boom has officially begun\" just hours after the Labor Department reported that consumer prices continued to tick upward.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-economic-boom-americans-worry-prices-rcna253629",
    "timestamp": "2026-01-13T21:22:41Z"
  },
  {
    "title": "Bari Weiss Should Do CBS Town Hall On Whose Fault It Is She Sucks So Bad",
    "description": "Our general view here is that we do our viewers the best service by presenting them with the full context they need to assess the story of why Bari Weiss sucks so bad.",
    "link": "https://www.wonkette.com/p/bari-weiss-should-do-cbs-town-hall",
    "timestamp": "2026-01-13T21:20:26Z"
  },
  {
    "title": "Venezuela: 15 Teens Charged with 'Treason' for Allegedly Celebrating Maduro Arrest",
    "description": "A group of at least 15 Venezuelan teenagers was slapped with dubious \"treason\" charges for allegedly celebrating the downfall of socialist dictator Nicolás Maduro, the outlet Runrunes reported.\nThe post Venezuela: 15 Teens Charged with ‘Treason’ for Allegedly…",
    "link": "https://www.breitbart.com/latin-america/2026/01/13/venezuela-15-teens-charged-treason-allegedly-celebrating-maduro-arrest/",
    "timestamp": "2026-01-13T21:18:31Z"
  },
  {
    "title": "'Where Were You Born?': ICE Demanding Citizens Show Their Papers in Minneapolis",
    "description": "US Immigration and Customs Enforcement and other federal agents deployed to Minnesota are pulling many nonwhite residents aside and asking them to prove their citizenship, according to several reports and multiple videos posted to social media this week amid …",
    "link": "https://www.commondreams.org/news/ice-citizen-checks-minneapolis",
    "timestamp": "2026-01-13T21:18:15Z"
  },
  {
    "title": "Trump Says 'F--k You' to Worker Who Seemingly Calls Him a 'Pedophile Protector'",
    "description": "Donald Trump seemingly got into a spat with a worker. The 79-year-old President of the United States was captured trading harsh words with someone, and the exchange is now going viral. Trump was touring the Ford F-150 plant at the Detroit Economic Club on Tue…",
    "link": "https://www.justjared.com/2026/01/13/trump-says-f-k-you-to-worker-who-seemingly-calls-him-a-pedophile-protector/",
    "timestamp": "2026-01-13T21:17:49Z"
  },
  {
    "title": "Japan Courts South Korea Amid Rift With China",
    "description": "But Seoul’s unwillingness to take a side may deny Takaichi the win she wants.",
    "link": "http://foreignpolicy.com/2026/01/13/japan-takaichi-south-korea-lee-china-xi-taiwan/",
    "timestamp": "2026-01-13T21:17:22Z"
  },
  {
    "title": "NAACP says Trump being deceptive about history after reverse discrimination remark",
    "description": "By Kanishka SinghWASHINGTON, Jan 13 (Reuters) - The largest U.S. civil rights group on Tuesday said President Donald Trump was being deceptive in his comments about “reve… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/13/naacp-says-trump-being-deceptive-about-history-after-reverse-discrimination-remark",
    "timestamp": "2026-01-13T21:16:31Z"
  },
  {
    "title": "Why TikTokers say Bears Super Bowl could reset 'wrong timeline'",
    "description": "A viral theory suggests if the Bears win the Super Bowl, the world will go back to its original timeline and not the one it has been in since 2016.",
    "link": "https://www.cincinnati.com/story/sports/nfl/2026/01/13/why-tiktok-democrats-bears-super-bowl-could-reset-wrong-timeline/88160162007/",
    "timestamp": "2026-01-13T21:16:11Z"
  },
  {
    "title": "UW Health, Children’s Wisconsin pausing gender-affirming care for minors",
    "description": "Both UW Health and Children’s Wisconsin will pause offering gender-affirming care treatments to minors following a federal directive.",
    "link": "https://www.wbay.com/2026/01/13/uw-health-childrens-wisconsin-pausing-gender-affirming-care-minors/",
    "timestamp": "2026-01-13T21:15:38Z"
  },
  {
    "title": "German Foreign Minister Wadephul says there is more consensus than disagreement with the US",
    "description": "By Alexander RatzWASHINGTON, Jan 13 (Reuters) - German Foreign Minister Johann Wadephul said on Tuesday that there is more consensus than disagreement with the United Sta… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/13/german-foreign-minister-wadephul-says-there-is-more-consensus-than-disagreement-with-the-us",
    "timestamp": "2026-01-13T21:14:41Z"
  },
  {
    "title": "US Supreme Court conservatives lean toward allowing transgender sports bans",
    "description": "SummaryChallengers say bans violate Constitution and Title IX law Arguments involve laws passed in West Virginia and Idaho Trump backs states in crackdown on transgender athletes",
    "link": "https://freerepublic.com/focus/f-news/4361936/posts",
    "timestamp": "2026-01-13T21:13:27Z"
  },
  {
    "title": "Plane used in boat strike off Venezuela was painted to look like a civilian aircraft, AP sources say",
    "description": "The plane used by the U.S. military to strike a boat accused of smuggling drugs off the coast of Venezuela last fall was painted to look like a civilian...",
    "link": "https://www.yahoo.com/news/articles/plane-used-boat-strike-off-211235340.html",
    "timestamp": "2026-01-13T21:12:35Z"
  },
  {
    "title": "Six federal prosecutors and four DOJ civil rights lawyers quit over Minnesota shooting probe – reports",
    "description": "Six federal prosecutors from the US attorney’s office in Minnesota have quit over the department’s reluctance to investigate the shooter of Renee Nicole Good, the New York Times has reported.",
    "link": "https://www.independent.ie/world-news/north-america/six-federal-prosecutors-and-four-doj-civil-rights-lawyers-quit-over-minnesota-shooting-probe-reports/a745486750.html",
    "timestamp": "2026-01-13T21:10:43Z"
  },
  {
    "title": "e-Pass system launched for Republic Day event in Bengaluru",
    "description": "The govt launched an e-pass system for those who wish to attend the 77th Republic Day celebrations at Field Marshal Manekshaw Parade Ground on Jan 26..",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/e-pass-system-launched-for-republic-day-event-in-bengaluru/articleshow/126511608.cms",
    "timestamp": "2026-01-13T21:10:00Z"
  },
  {
    "title": "Sober up on rumor Trump posted about banning alcohol, bringing back Prohibition",
    "description": "A screenshot shared online in January 2026 authentically showed a post from U.S. President Donald Trump's X account calling for a permanent ban on alcohol in a return to Prohibition-era America.",
    "link": "https://www.snopes.com//fact-check/trump-alcohol-ban-prohibition/",
    "timestamp": "2026-01-13T21:09:00Z"
  },
  {
    "title": "We Can Honor Renee Nicole Good’s Life by Abolishing Death-Making Institutions",
    "description": "Those of us who see ourselves in Renee Good can take this moment to deepen our solidarities with all who are policed.",
    "link": "https://truthout.org/articles/we-can-honor-renee-nicole-goods-life-by-abolishing-death-making-institutions/",
    "timestamp": "2026-01-13T21:09:00Z"
  },
  {
    "title": "Bangalore University faculty association objects to syndicate members in local inspection committee",
    "description": "Bengaluru: The faculty of Bangalore University have objected to the appointment of syndicate and academic council members as chairpersons and members .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/bangalore-university-faculty-association-objects-to-syndicate-members-in-local-inspection-committee/articleshow/126511593.cms",
    "timestamp": "2026-01-13T21:09:00Z"
  },
  {
    "title": "Woman arrested in Karnataka for raising Jai Bangla slogans",
    "description": "Bengaluru: A 27-year-old woman, allegedly an illegal immigrant from Bangladesh, was arrested on charges of raising Jai Bangla slogans at Podu village,.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/woman-arrested-in-karnataka-for-raising-jai-bangla-slogans/articleshow/126511594.cms",
    "timestamp": "2026-01-13T21:09:00Z"
  },
  {
    "title": "Now, up to 10 lakh fines on MU colleges for errors in forms",
    "description": "Mumbai: The Mumbai University has come down heavily on colleges and students who failed to submit completed enrollment forms for first-year undergradu.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/now-up-to-10-lakh-fines-on-mu-colleges-for-errors-in-forms/articleshow/126511599.cms",
    "timestamp": "2026-01-13T21:09:00Z"
  },
  {
    "title": "Majority of Americans — including whopping 66% of Hispanics — support US military intervention in Venezuela: poll",
    "description": "A solid majority of Americans support military intervention in Venezuela -- including an eye-popping 66% of Hispanics.",
    "link": "https://nypost.com/2026/01/13/us-news/majority-of-americans-support-us-military-intervention-in-venezuela/",
    "timestamp": "2026-01-13T21:08:59Z"
  },
  {
    "title": "Trump claims CUSMA is 'irrelevant' to U.S.",
    "description": "U.S. President Donald Trump on Tuesday said the ​Canada-U.S.-Mexico Agreement — the trade pact also known as CUSMA — is not relevant for the U.S., but Canada wants it, as he pushed for companies to bring manufacturing back to American soil.",
    "link": "https://www.cbc.ca/news/world/trump-says-cusma-irrelevant-canada-us-9.7044008",
    "timestamp": "2026-01-13T21:08:32Z"
  },
  {
    "title": "What's next for the best-performing ASX 200 stock of 2025?",
    "description": "This ASX stock boomed in 2026.\nThe post What's next for the best-performing ASX 200 stock of 2025? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2026/01/14/whats-next-for-the-best-performing-asx-200-stock-of-2025/",
    "timestamp": "2026-01-13T21:08:19Z"
  },
  {
    "title": "Nick Fuentes says he wants to take over Kick and asks Adin Ross for help",
    "description": "Controversial online figure Nick Fuentes is reportedly seeking to dominate the streaming platform Kick, even enlisting the help of popular streamer Adin Ross. Fuentes, banned from major sites, sees Ross's influence as key to gaining a foothold and boosting hi…",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/nick-fuentes-says-he-wants-to-take-over-kick-and-asks-adin-ross-for-help/articleshow/126512912.cms",
    "timestamp": "2026-01-13T21:08:09Z"
  },
  {
    "title": "Can EU exert more pressure on Iran with sanctions?",
    "description": "The European Union is contemplating more sanctions against Iran amid a deadly crackdown on anti-government protests that has killed thousands. But could the bloc apply more pressure on the Islamic Republic's regime?",
    "link": "https://www.dw.com/en/can-eu-exert-more-pressure-on-iran-with-sanctions/a-75484027",
    "timestamp": "2026-01-13T21:08:00Z"
  },
  {
    "title": "DHS announces termination of protected status for Somalis after group targeted by Trump",
    "description": "DHS announces termination of protected status for Somalis after group targeted by Trumpgo.com",
    "link": "https://abcnews.go.com/Politics/dhs-announces-termination-protected-status-somalis-after-group/story?id=129167236",
    "timestamp": "2026-01-13T21:07:17Z"
  },
  {
    "title": "Trump Riffs Biden Was ‘High as a Kite’ During Speech: ‘He Was Spruced Up Pretty Good’",
    "description": "President Trump mocked Joe Biden for only giving speeches that lasted \"a matter of seconds\" — except for one time where he claimed Biden was \"high as a kite.\"\nThe post Trump Riffs Biden Was ‘High as a Kite’ During Speech: ‘He Was Spruced Up Pretty Good’ first…",
    "link": "https://www.mediaite.com/politics/trump-riffs-biden-was-high-as-a-kite-during-speech-he-was-spruced-up-pretty-good/",
    "timestamp": "2026-01-13T21:05:33Z"
  },
  {
    "title": "Justice Department lawyers resign after push to investigate Renee Good's widow",
    "description": "Several career employees at the U.S. Department of Justice have resigned over the department’s intention to investigate the widow of Renee Nicole Good, the woman shot to death by a federal agent in Minneapolis last week, and other DOJ actions.",
    "link": "https://www.advocate.com/news/doj-staffers-resign-good-investigation",
    "timestamp": "2026-01-13T21:05:15Z"
  },
  {
    "title": "Beauty clinics to emergency rooms: Botox could help treat snakebites",
    "description": "Researchers are exploring Botox's active compound, botulinum toxin, to combat severe tissue damage from snakebites. Early studies suggest it may significantly reduce swelling and muscle injury linked to viper venom, potentially complementing antivenom by targ…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/beauty-clinics-to-emergency-rooms-botox-could-help-treat-snakebites/articleshow/126512903.cms",
    "timestamp": "2026-01-13T21:03:44Z"
  },
  {
    "title": "FBI Investigating Renee Good While Obstructing Probes Into ICE Killer",
    "description": "At the same time, numerous officials have resigned from the DOJ over its decision to not investigate the killing.",
    "link": "https://truthout.org/articles/fbi-investigating-renee-good-while-obstructing-probes-into-ice-killer/",
    "timestamp": "2026-01-13T21:03:24Z"
  },
  {
    "title": "Maharashtra: Cops visit office of Pune firm managing Ajit Pawar's poll campaign on concluding day",
    "description": "PUNE: Crime Branch officials visited the Pune office of a political campaign management company working for Maharashtra Deputy CM Ajit Pawar-led NCP o.",
    "link": "https://timesofindia.indiatimes.com/city/pune/maharashtra-cops-visit-office-of-pune-firm-managing-ajit-pawars-poll-campaign-on-concluding-day/articleshow/126512905.cms",
    "timestamp": "2026-01-13T21:01:58Z"
  },
  {
    "title": "Judge suggests visa for college student deported mistakenly to Honduras",
    "description": "By Nate RaymondBOSTON, Jan 13 (Reuters) - A U.S. federal judge on Tuesday urged the Trump administration to resolve a “bureaucratic mess” by issuing a student visa to a c… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/13/judge-suggests-visa-for-college-student-deported-mistakenly-to-honduras",
    "timestamp": "2026-01-13T21:01:47Z"
  },
  {
    "title": "Here's What Happened Today: Tuesday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-131-2-6925882-Jan2026/",
    "timestamp": "2026-01-13T21:01:05Z"
  },
  {
    "title": "'HELP IS ON THE WAY'...",
    "description": "President Donald Trump on Tuesday said that any diplomacy with Iran is off the table until it stops killing protesters, promising the Iranian people that the United States will soon aid their uprising against the hardline regime.",
    "link": "https://freebeacon.com/trump-administration/help-is-on-the-way-trump-shuts-door-on-diplomacy-with-islamic-republic-officials-urges-iranian-people-to-seize-government-institutions/",
    "timestamp": "2026-01-13T21:00:15Z"
  },
  {
    "title": "Iran Turmoil Resurrects Specter of Critical Oil Lane Disruption",
    "description": "Oil prices haven’t had a breather since the year started as one geopolitical crisis has moved to another. Just a week after the U.S. intervention in Venezuela captured Nicolas Maduro, U.S. President Donald Trump has turned his sights to Iran, threatening a U.…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Iran-Turmoil-Resurrects-Specter-of-Critical-Oil-Lane-Disruption.html",
    "timestamp": "2026-01-13T21:00:00Z"
  },
  {
    "title": "Joe Rogan and Rand Paul Call Out Trump’s Fentanyl Excuse for Striking Boats as Phony",
    "description": "Joe Rogan and Sen. Rand Paul (R-KY) are in agreement that President Donald Trump's excuse for striking Venezuelan boats is all smoke and mirrors.\nThe post Joe Rogan and Rand Paul Call Out Trump’s Fentanyl Excuse for Striking Boats as Phony first appeared on M…",
    "link": "https://www.mediaite.com/media/podcasts/joe-rogan-and-rand-paul-call-out-trumps-fentanyl-excuse-for-striking-boats-as-phony/",
    "timestamp": "2026-01-13T20:59:50Z"
  },
  {
    "title": "Some Canadians feel uneasy as Trump ramps up talks to 'take' Greenland. What should we do?",
    "description": "How can Canadians begin to protect our nation's sovereignty as our southern neighbour moves in on other countries? Canadian commentator Tod Maffin has some suggestions.",
    "link": "https://www.cbc.ca/radio/checkup/canadians-uneasy-about-trump-talk-greenland-9.7043709",
    "timestamp": "2026-01-13T20:59:37Z"
  },
  {
    "title": "President Trump Filmed Flipping Off Ford Worker Who Called Him 'Pedophile'",
    "description": "Donald Trump turned into Donald Grump during a Tuesday appearance at a Ford plant ... launching into an F bomb attack on a worker who appeared to call him a \"pedophile.\" 47 toured the Ford F-150 plant at the Detroit Economic Club before giving a…",
    "link": "https://www.tmz.com/2026/01/13/trump-flips-off-ford-worker/",
    "timestamp": "2026-01-13T20:58:12Z"
  },
  {
    "title": "No second chance for world should major geopolitical conflict arise, Taoiseach says",
    "description": "Micheál Martin warns real conflict is Russia v EU as Labour leader warns of ‘increasingly despotic US’",
    "link": "https://www.irishtimes.com/politics/2026/01/13/no-second-chance-for-world-should-major-geopolitical-conflict-arise-taoiseach-says/",
    "timestamp": "2026-01-13T20:56:39Z"
  },
  {
    "title": "Europe Should Be Begging Trump to Buy Greenland",
    "description": "President Donald Trump has renewed his push for the United States to acquire Greenland from Denmark, again prompting gasps and outrage from elected Democrats and European elites. But the historical record and geopolitical reality suggest that acquiring the is…",
    "link": "https://freerepublic.com/focus/f-news/4361930/posts",
    "timestamp": "2026-01-13T20:56:35Z"
  },
  {
    "title": "Insiders Lining Up To Blame Jeanine Pirro For Powell Disaster",
    "description": "Poor Judge Jeanine! She just doesn't understand what her real job is -- namely, to turn on a dime after any news cycle that reflects badly on the Orange Lord and Savior. Via Bloomberg News:\nJeanine Pirro didn’t seek sign-off from her bosses at the Justice Dep…",
    "link": "https://crooksandliars.com/2026/01/insiders-lining-blame-jeanine-pirro-powell",
    "timestamp": "2026-01-13T20:56:23Z"
  },
  {
    "title": "'Dilbert' Creator and Right-Wing Commentator Scott Adams Dies at Age 68",
    "description": "Scott Adams, the creator of the \"Dilbert\" comic strip, has died at age 68, his ex-wife announced on Tuesday.",
    "link": "https://www.westernjournal.com/dilbert-creator-right-wing-commentator-scott-adams-dies-age-68/",
    "timestamp": "2026-01-13T20:55:59Z"
  },
  {
    "title": "Tariffs Are a 2026 ‘Overhang’ for Retailers and Shoe Firms",
    "description": "While too early to talk about possible tariff reversal by the U.S Supreme Court, there's at least optimism for higher gross margins.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/tariff-us-supreme-court-optimism-gross-margin-shoe-firms-1238452625/",
    "timestamp": "2026-01-13T20:54:54Z"
  },
  {
    "title": "Rachel Maddow Mocks Trump Over Torrent Of Legal Defeats: 'Shall I Keep Going?'",
    "description": "The MS NOW host on Monday ran through a lengthy series of recent court cases that didn't go the president's way.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-mocks-trump-over-torrent-of-legal-defeats-shall-i-keep-going_n_6966817fe4b0dd199b1a72a7",
    "timestamp": "2026-01-13T20:54:46Z"
  },
  {
    "title": "The Defense Department’s Case Against Mark Kelly Is Even Dumber Than It Sounds",
    "description": "At the same time, it’s still having its intended effect.",
    "link": "https://slate.com/news-and-politics/2026/01/pete-hegseth-mark-kelly-military-law-court-martial.html",
    "timestamp": "2026-01-13T20:53:06Z"
  },
  {
    "title": "Trump rips into GOP defectors as 'real losers' as Senate readies for final vote",
    "description": "Senate prepares for a Wednesday vote on a Venezuela war powers resolution as White House and Republican leadership pressures GOP senators to change their positions.",
    "link": "https://www.foxnews.com/politics/trump-rips-gop-defectors-real-losers-senate-readies-final-vote",
    "timestamp": "2026-01-13T20:51:53Z"
  },
  {
    "title": "As Carney heads to China to talk trade, Ontario premier still '100% dead against' rolling back EV tariffs",
    "description": "With Canada’s prime minister in China this week on a trade mission, Ontario Premier Doug Ford is doubling down on his plea to Mark Carney: do not remove tariffs on Chinese electric vehicles.",
    "link": "https://www.cbc.ca/news/canada/toronto/doug-ford-ontario-china-electric-vehicles-9.7043990",
    "timestamp": "2026-01-13T20:51:30Z"
  },
  {
    "title": "Treasury, State Departments Designate Three Muslim Brotherhood Chapters Terrorist Organizations After Trump-Ordered Review",
    "description": "The U.S. Treasury and State Departments designated several chapters of the Muslim Brotherhood as foreign terrorist organizations (FTOs) or specially designated global terrorists (SDGTs) on Tuesday. The State Department has designated the Lebanese Muslim Broth…",
    "link": "https://freerepublic.com/focus/f-bloggers/4361926/posts",
    "timestamp": "2026-01-13T20:50:11Z"
  },
  {
    "title": "Live: ASX to slip in early trade as Wall Street pulls back from record high",
    "description": "The Australian share market is likely to open slightly lower after Wall Street retreated from its record highs, while Donald Trump continues to hurl insults at Jerome Powell, who is set to face a criminal investigation, and central bank chiefs across the worl…",
    "link": "https://www.abc.net.au/news/2026-01-14/asx-markets-business-live-news/106227246",
    "timestamp": "2026-01-13T20:48:22Z"
  },
  {
    "title": "Joy Behar claims Trump seeking to declare martial law to stop midterm elections amid ICE protests",
    "description": "\"The View\" host Joy Behar claimed that President Donald Trump wanted anti-ICE protests to create chaos so he can declare martial law and cancel the 2026 midterm elections.",
    "link": "https://www.foxnews.com/media/joy-behar-claims-trump-seeking-declare-martial-law-stop-midterm-elections-amid-ice-protests",
    "timestamp": "2026-01-13T20:48:10Z"
  },
  {
    "title": "Trump says Microsoft will make changes to ensure consumers don't pay for power used in AI buildout (Jordan Novet/CNBC)",
    "description": "Jordan Novet / CNBC:\nTrump says Microsoft will make changes to ensure consumers don't pay for power used in AI buildout … President Donald Trump said in a social media post on Monday that Microsoft will announce changes to ensure that Americans won't see risi…",
    "link": "https://www.memeorandum.com/260113/p111",
    "timestamp": "2026-01-13T20:45:06Z"
  },
  {
    "title": "Oil Surges as Iran Tensions Fuel Supply Risk",
    "description": "Trump's warnings and protests in Iran pushed crude to multi-month highs.",
    "link": "https://www.rigzone.com/news/wire/oil_surges_as_iran_tensions_fuel_supply_risk-13-jan-2026-182755-article/",
    "timestamp": "2026-01-13T20:42:53Z"
  },
  {
    "title": "Smithsonian faces a deadline to show Trump its plans for exhibits for America’s 250th birthday",
    "description": "Trump has previously threatened the Smithsonian’s funding.",
    "link": "https://www.bostonherald.com/2026/01/13/smithsonian-trump-exhibits/",
    "timestamp": "2026-01-13T20:42:26Z"
  },
  {
    "title": "Trump Ally Stephen Moore Warns President’s Latest Economic Move Usually Leads to ‘Disaster’",
    "description": "\"Start with the first rule of economics—the first rule of economics says wage and price controls are always, always, always a mistake.\"\nThe post Trump Ally Stephen Moore Warns President’s Latest Economic Move Usually Leads to ‘Disaster’ first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/trump-ally-stephen-moore-warns-presidents-latest-economic-move-usually-leads-to-disaster/",
    "timestamp": "2026-01-13T20:41:45Z"
  },
  {
    "title": "China Elbows into Greenland Debate, Backing Denmark Against Trump's Acquisition Plans",
    "description": "The Chinese Foreign Ministry on Monday elbowed its way into the debate over President Donald Trump’s effort to acquire Greenland, slamming the U.S. for “using other countries as an excuse for pursuing its own selfish interests.”\nThe post China Elbows into Gre…",
    "link": "https://www.breitbart.com/asia/2026/01/13/china-elbows-into-greenland-debate-backing-denmark-against-trumps-acquisition-plans/",
    "timestamp": "2026-01-13T20:40:37Z"
  },
  {
    "title": "'Gross abuse of power!' MAGA prosecutor goes ballistic on judge over disqualification",
    "description": "Courtroom drama unfurled on the docket Monday, as disqualified acting U.S. Attorney for the Eastern District of Virginia Lindsey Halligan joined up with Justice Department leaders Pam Bondi and Todd Blanche to write a furious brief punching back at U.S. Distr…",
    "link": "https://www.rawstory.com/lindsey-halligan-2674879945/",
    "timestamp": "2026-01-13T20:37:36Z"
  },
  {
    "title": "Trump to cut federal payments to sanctuary cities starting Feb. 1 over immigration policies",
    "description": "President Donald Trump will suspend payments to sanctuary cities starting February 1st. He also criticized Minnesota officials over alleged widespread fraud.",
    "link": "https://www.foxnews.com/us/trump-cut-federal-payments-sanctuary-cities-starting-feb-1-over-immigration-policies",
    "timestamp": "2026-01-13T20:36:34Z"
  },
  {
    "title": "Trump to cut federal payments to sanctuary cities starting Feb 1 over immigration policies",
    "description": "President Donald Trump will suspend payments to sanctuary cities starting February 1st. He also criticized Minnesota officials over alleged widespread fraud.",
    "link": "https://www.foxnews.com/politics/trump-cut-federal-payments-sanctuary-cities-starting-feb-1-over-immigration-policies",
    "timestamp": "2026-01-13T20:36:34Z"
  },
  {
    "title": "Trump’s “Homes for People” Plan Distracts From Failing Policies, Experts Say",
    "description": "Trump's proposal to ban institutional investors from buying homes won't make up for damage of tariffs and deportations.",
    "link": "https://truthout.org/articles/trumps-homes-for-people-plan-distracts-from-failing-policies-experts-say/",
    "timestamp": "2026-01-13T20:35:47Z"
  },
  {
    "title": "US seizes more tankers, courts oil companies as post-Maduro Venezuela takes shape",
    "description": "In the week following Washington’s arrest of former Venezuelan leader Nicolás Maduro, regime figures like interim President Delcy Rodriguez, Defense Minister Vladimir Padrino Lopez, and Interior Minister Diosdado Cabello are jockeying for position and decidin…",
    "link": "https://www.longwarjournal.org/archives/2026/01/us-seizes-more-tankers-courts-oil-companies-as-post-maduro-venezuela-takes-shape.php",
    "timestamp": "2026-01-13T20:33:32Z"
  },
  {
    "title": "Is Trump’s MAGA ally Steve Bannon eyeing a 2028 Presidential bid? Can he outdo JD Vance",
    "description": "Steve Bannon is reportedly working behind the scenes to shape the post-Trump Republican landscape, aiming to ensure his \"America First\" agenda prevails. Insiders suggest his efforts, including political gatherings and media projects, are designed to \"kneecap\"…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-trumps-maga-ally-steve-bannon-eyeing-a-2028-presidential-bid-can-he-outdo-jd-vance/articleshow/126510457.cms",
    "timestamp": "2026-01-13T20:33:11Z"
  },
  {
    "title": "Whistleblower lawyer says his security clearance has been restored",
    "description": "A whistleblower lawyer said in a LinkedIn post Tuesday his access to classified information has been restored months after President Donald Trump announced in a memo that he was revoking the Washington, D.C., lawyer's security clearance.",
    "link": "https://www.abajournal.com/news/article/whistleblower-lawyer-mark-zaid-says-his-security-clearance-restored",
    "timestamp": "2026-01-13T20:33:00Z"
  },
  {
    "title": "Trump Roasts Republican Critics During ‘Economic Speech’ — Including ‘Stone-Cold Loser Rand Paul’",
    "description": "President Donald Trump took a few swings at his Republican critics in the Senate during an economic speech in Detroit on Tuesday.\nThe post Trump Roasts Republican Critics During ‘Economic Speech’ — Including ‘Stone-Cold Loser Rand Paul’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/trump-roasts-republican-critics-during-economic-speech-including-stone-cold-loser-rand-paul/",
    "timestamp": "2026-01-13T20:31:22Z"
  },
  {
    "title": "Iran Says It Is Open to Talks with U.S. amid Protest Crackdown",
    "description": "Iranian Foreign Minister Abbas Araghchi said on Monday that his regime remains open to negotiations with the United States, even as President Donald Trump has threatened to take action against the regime for killing protesters.\nThe post Iran Says It Is Open t…",
    "link": "https://www.breitbart.com/middle-east/2026/01/13/iran-says-it-is-open-to-talks-with-u-s-amid-protest-crackdown/",
    "timestamp": "2026-01-13T20:28:13Z"
  },
  {
    "title": "Should EU leaders sit on Trump's 'Board of Peace' for Gaza?",
    "description": "The next phase of the US-sponsored Gaza peace plan involves setting up a \"Board of Peace.\" Trump wants to chair it and, even though it's been heavily criticized, Europeans also want a seat. It's been called everything from a \"neo-colonialist sham\" to \"an affr…",
    "link": "https://www.dw.com/en/israel-gaza-donald-trump-board-of-peace-united-nations-european-union/a-75495127",
    "timestamp": "2026-01-13T20:28:00Z"
  },
  {
    "title": "Minnesota, Illinois File Lawsuits to Halt DHS Operations",
    "description": "Both lawsuits allege the Trump administration is violating the states' and cities' rights to self-governance.",
    "link": "https://truthout.org/articles/minnesota-illinois-file-lawsuits-to-halt-dhs-operations/",
    "timestamp": "2026-01-13T20:27:22Z"
  },
  {
    "title": "Claims of Vehicular Terrorism in Minnesota Don’t Hold Up",
    "description": "The U.S. government is adopting dangerous language to justify unlawful killing.",
    "link": "http://foreignpolicy.com/2026/01/13/vehicular-terrorism-minnesota-trump-ice-protest/",
    "timestamp": "2026-01-13T20:27:07Z"
  },
  {
    "title": "Israeli and Arab officials have privately suggested U.S. hold off on Iran strikes",
    "description": "WASHINGTON — Israeli and Arab officials have told the Trump administration in recent days that they believe the Iranian regime may not yet be weakened to the point where U.S. military strikes would be the decisive blow that topples it, according to a U.S. off…",
    "link": "https://www.nbcnews.com/politics/white-house/israeli-arab-officials-privately-suggested-us-hold-iran-strikes-rcna253718",
    "timestamp": "2026-01-13T20:24:06Z"
  },
  {
    "title": "Democratic Senate candidate calls national party 'condescending,' hostile toward faith in red states",
    "description": "Democratic Texas Senate candidate James Talarico said the national party was \"condescending\" to people, and specifically said it was \"hostile\" to cultural interests, like religion, in red states.",
    "link": "https://www.foxnews.com/media/democratic-senate-candidate-calls-national-party-condescending-hostile-toward-faith-red-states",
    "timestamp": "2026-01-13T20:23:06Z"
  },
  {
    "title": "US: GOP to go after Clintons for contempt in Epstein case",
    "description": "Bill and Hillary Clinton have refused to comply with a Congressional subpoena to testify in a Jeffrey Epstein probe and could face contempt charges.",
    "link": "https://www.dw.com/en/contempt-threat-after-clintons-refuse-epstein-testimony/a-75496671",
    "timestamp": "2026-01-13T20:23:00Z"
  },
  {
    "title": "Nikki Glaser Reveals Cut ICE and Trump Jokes From Golden Globes, Avoided Politics Because ‘It’s Hard to Strike the Right Tone’",
    "description": "In what is now a post-Golden Globes tradition, host Nikki Glaser went on “The Howard Stern Show” to reveal the jokes she left on the cutting room floor. Among the bits that didn’t make it into the kudocast were punchlines about ICE and Donald Trump. Glaser to…",
    "link": "https://variety.com/2026/tv/news/nikki-glaser-cut-jokes-golden-globes-ice-trump-1236628659/",
    "timestamp": "2026-01-13T20:21:36Z"
  },
  {
    "title": "How Trump's White House is trying to run Venezuela through one woman",
    "description": "Venezuela is in the hands of both President Trump and a regime loyal to its ousted leader. The country's future, including the well-being of its people, is likely to depend on how well Delcy Rodríguez can walk a tightrope between Washington's demands and her …",
    "link": "https://www.abc.net.au/news/2026-01-14/venezuelas-interim-president-delcy-rodriguez/106222934",
    "timestamp": "2026-01-13T20:21:26Z"
  },
  {
    "title": "President Trump is Bringing World Peace One Way or Another – the Mexican Cartels May Be Next",
    "description": "President Trump is bringing world peace one way or another.  Agreements were established last year with countries that were willing to come to a peace agreement.\nThe post President Trump is Bringing World Peace One Way or Another – the Mexican Cartels May Be …",
    "link": "https://joehoft.com/president-trump-is-bringing-world-peace-one-way-or-another-the-mexican-cartels-may-be-next/",
    "timestamp": "2026-01-13T20:20:43Z"
  }
]