[
  {
    "title": "Nigerian, Iraqi priests tell of aiding persecuted Christians seen in photo exhibit",
    "description": "A photo display of persecuted Christians in Iraq and Nigeria can be seen at the Saint John Paul II National Shrine in Washington, D.C., until Feb. 8, 2026. / Credit: Madalaine Elhabbal/CNA\n\nWashington, D.C., Dec 3, 2025 / 13:50 pm (CNA).\nA discussion featurin…",
    "link": "https://www.catholicnewsagency.com/news/268229/nigerian-iraqi-priests-tell-of-aiding-persecuted-christians-seen-in-photos",
    "timestamp": "2025-12-03T18:50:00Z"
  },
  {
    "title": "ICE Targets Somalis in Minneapolis as Trump Calls Them “Garbage”",
    "description": "“When they come from hell and they complain and do nothing but bitch, we don’t want them,” Trump said.",
    "link": "https://truthout.org/articles/ice-targets-somalis-in-minneapolis-as-trump-calls-them-garbage/",
    "timestamp": "2025-12-03T18:47:37Z"
  },
  {
    "title": "Who are Henry Cuellar and Imelda Cuellar? Why has President Donald Trump pardoned husband-wife?",
    "description": "Donald Trump's pardons this year have included a string of unlikely beneficiaries who are boldfaced names and frequently politically aligned with the president.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-are-henry-cuellar-and-imelda-cuellar-why-has-president-donald-trump-pardoned-husband-wife/articleshow/125750750.cms",
    "timestamp": "2025-12-03T18:47:13Z"
  },
  {
    "title": "Ex-FIFA president Sepp Blatter slams Gianni Infantino's 48-team World Cup: 'The monster has been unleashed'",
    "description": "Blatter, the FIFA president for nearly two decades, was ousted from the role in 2015 following a corruption scandal that was revealed in separate investigations by the governments of the U.S. and Switzerland",
    "link": "https://www.cbssports.com/soccer/news/ex-fifa-president-sepp-blatter-slams-gianni-infantinos-48-team-world-cup-the-monster-has-been-unleashed/",
    "timestamp": "2025-12-03T18:46:58Z"
  },
  {
    "title": "Costco becomes biggest company demanding refunds on Trump tariffs",
    "description": "Costco is joining other companies that aren’t waiting to see whether the Supreme Court strikes down President Donald Trump’s most sweeping import taxes.",
    "link": "https://biztoc.com/x/262dd03b35ba9bbb",
    "timestamp": "2025-12-03T18:45:44Z"
  },
  {
    "title": "Donald Trump 'Voids' All Documents and Pardons Signed by Joe Biden's Autopen in Fresh Attack on Former Prez",
    "description": "Donald Trump is terminating all documents and pardons his predecessor Joe Biden signed off on using his autopen, claiming they now have 'no legal effect.'",
    "link": "https://radaronline.com/p/donald-trump-voids-pardons-biden-autopen/",
    "timestamp": "2025-12-03T18:45:00Z"
  },
  {
    "title": "Did Donald Trump fall asleep at a cabinet meeting?",
    "description": "And why is Pete Hegseth blaming the “fog of war”?",
    "link": "https://www.bbc.co.uk/sounds/play/p0mldr2g",
    "timestamp": "2025-12-03T18:45:00Z"
  },
  {
    "title": "House Republicans subpoena Jack Smith for closed-door interview about his prosecutions of Trump",
    "description": "Smith had earlier volunteered to appear for an open hearing about his prosecutions of Trump.",
    "link": "https://www.bostonherald.com/2025/12/03/jack-smith-subpoena/",
    "timestamp": "2025-12-03T18:44:30Z"
  },
  {
    "title": "‘I am not going anywhere’: Ilhan Omar says when asked if she ‘started packing bags for Somalia’",
    "description": "Trump has unleashed attacks on Omar, suggesting that she came to the US illegally, and also repeated unsubstantiated allegations that she married her brother to come to America.",
    "link": "https://indianexpress.com/article/world/i-am-not-going-anywhere-ilhan-omar-says-when-asked-if-she-started-packing-bags-for-somalia-10400868/",
    "timestamp": "2025-12-03T18:43:27Z"
  },
  {
    "title": "What to know about Somalia as Trump wants Somalis in the US to leave",
    "description": "The Horn of Africa nation remains fragile after three decades of civil war.",
    "link": "https://www.bostonherald.com/2025/12/03/somalia-trump-what-to-know/",
    "timestamp": "2025-12-03T18:42:49Z"
  },
  {
    "title": "James Solomon wins Jersey City mayoral election, defeating ex-Gov. Jim McGreevey",
    "description": "James Solomon was elected mayor of Jersey City on Tuesday, thwarting former New Jersey Gov. Jim McGreevey’s bid for a political comeback more than two decades after a scandalous resignation.",
    "link": "https://www.pbs.org/newshour/politics/james-solomon-wins-jersey-city-mayoral-election-defeating-ex-gov-jim-mcgreevey",
    "timestamp": "2025-12-03T18:41:08Z"
  },
  {
    "title": "House Republicans subpoena Jack Smith for closed-door interview about his prosecutions of Trump",
    "description": "The Republican-led House Judiciary Committee has subpoenaed former Justice Department special counsel Jack Smith for a closed-door interview later this month...",
    "link": "https://www.yahoo.com/news/articles/house-republicans-subpoena-jack-smith-184010570.html",
    "timestamp": "2025-12-03T18:40:10Z"
  },
  {
    "title": "Poor hiring data points to US economic weakness",
    "description": "US private-sector hiring data released Wednesday painted a downcast picture of the job market in the world’s biggest economy, especially among small businesses. The report showed US companies shed 32,000 jobs in November, payroll firm ADP said, in a surprise …",
    "link": "https://www.digitaljournal.com/world/poor-hiring-data-points-to-us-economic-weakness/article",
    "timestamp": "2025-12-03T18:37:32Z"
  },
  {
    "title": "Costco becomes biggest company demanding refunds on Trump tariffs",
    "description": "Costco is joining other companies that aren’t waiting to see whether the Supreme Court strikes down President Donald Trump’s most sweeping import taxes.",
    "link": "https://www.pbs.org/newshour/economy/costco-becomes-biggest-company-demanding-refunds-on-trump-tariffs",
    "timestamp": "2025-12-03T18:36:34Z"
  },
  {
    "title": "Family Of Colombian Man Killed In US Boat Strike Files Complaint Alleging Murder",
    "description": "The complaint names U.S. Secretary of Defense Pete Hegseth as being responsible for the killing of fisherman Alejandro Carranza Medina.",
    "link": "https://www.huffpost.com/entry/family-of-colombian-man-killed-in-us-boat-strike-files-complaint-alleging-murder_n_69306d47e4b0cee44381f3d8",
    "timestamp": "2025-12-03T18:36:27Z"
  },
  {
    "title": "Trump Pardons Texas Democrat Henry Cuellar, Who Was Indicted After Criticizing Biden's Open Borders",
    "description": "President Donald Trump announced Wednesday that he is pardoning Rep. Henry Cuellar (D-TX) and his wife, Imelda Cuellar, whom President Joe Biden's Department of Justice indicted on bribery charges last year.\nThe post Trump Pardons Texas Democrat Henry Cuellar…",
    "link": "https://www.breitbart.com/politics/2025/12/03/trump-pardons-texas-democrat-henry-cuellar-who-was-indicted-after-criticizing-bidens-open-borders/",
    "timestamp": "2025-12-03T18:35:50Z"
  },
  {
    "title": "The “game recognize game” pardon cycle crosses party lines again",
    "description": "Henry Cuellar is the new Rod Blagojevich: President Donald Trump announced he will pardon U.S. Rep. Henry Cuellar, D-Laredo, and his wife, ending the congressman’s multi-year federal legal battle. Cuellar had faced a dozen charges of bribery, money laundering…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/the-game-recognize-game-pardon-cycle-crosses-party-lines-again",
    "timestamp": "2025-12-03T18:35:42Z"
  },
  {
    "title": "Trump insists ‘Trump is sharp’ despite cabinet meeting appearing to show him struggling to stay awake",
    "description": "With Tuesday’s White House Cabinet meeting chugging past the two-hour mark, President Donald Trump‘s eyes fluttered and closed. His budget director busied himself doodling a fluffy cloud. Defense Secretary Pete Hegseth was lucky enough to speak early, but the…",
    "link": "https://biztoc.com/x/8678a7f74f43d4d5",
    "timestamp": "2025-12-03T18:34:51Z"
  },
  {
    "title": "ACA subsidies on the brink as Congress struggles to reach a deal",
    "description": "Stalled negotiations leave millions facing potential premium increases with no clear path to a extension.",
    "link": "https://www.salon.com/2025/12/03/aca-subsidies-on-the-brink-as-congress-struggles-to-reach-a-deal/",
    "timestamp": "2025-12-03T18:34:49Z"
  },
  {
    "title": "Paramount's Larry and David Ellison might look to Middle East petrostates to help finance a deal for WBD. That's tricky",
    "description": "Donald Trump welcomed Saudi Crown Prince Mohammed bin Salman of Saudi Arabia at the White House in November. Now bin Salman's country is reportedly backing Larry and David Ellisons' bid for Warner Bros. Discovery\nWin McNamee/Getty Images\nParamount owners Larr…",
    "link": "https://biztoc.com/x/676702268addc589",
    "timestamp": "2025-12-03T18:34:49Z"
  },
  {
    "title": "Kash Patel Lets Slip How He’ll Stall Releasing the Epstein Files",
    "description": "The Trump administration is releasing “as much” of the Epstein files as it can—at least, the components that are “lawful,” according to FBI Director Kash Patel.Speaking with Fox News Tuesday evening, Patel insinuated that there were some documents related to …",
    "link": "https://newrepublic.com/post/203914/kash-patel-stall-releasing-epstein-files",
    "timestamp": "2025-12-03T18:32:54Z"
  },
  {
    "title": "'It’s not tariffs!' White House bristles over gloomy new economic report",
    "description": "One of President Donald Trump's top economic advisors is scrambling to blame anything but tariffs after a new jobs report indicated that they might be 'hammering\" small business jobs, a move the New Republic dismissed as \"only damage control.\"“No, no, it’s no…",
    "link": "https://www.rawstory.com/alternet-posts/trump-tariffs-2674366579/",
    "timestamp": "2025-12-03T18:32:08Z"
  },
  {
    "title": "PRESSURE MOUNTS ON HILL...",
    "description": "The scrutiny over Defense Secretary Pete Hegseth's leadership at the Pentagon has been a long time coming on Capitol Hill. Hegseth barely squeaked through his Senate confirmation process at the start of the year. And lawmakers have been uneasy about the lack …",
    "link": "https://apnews.com/article/congress-hegseth-boat-strikes-e68621ec48c7886215359c0110d6d9ca",
    "timestamp": "2025-12-03T18:31:36Z"
  },
  {
    "title": "‘This Is Disgusting’: Trump Pardons Henry Cuellar After Bribery, Money Laundering Charges",
    "description": "President Donald Trump on Wednesday announced that he was pardoning Democratic US Rep. Henry Cuellar, who was indicted by the Department of Justice in 2024 on charges of bribery, conspiracy, and money laundering.In justifying the pardon, Trump baselessly clai…",
    "link": "https://www.commondreams.org/news/trump-pardons-henry-cuellar",
    "timestamp": "2025-12-03T18:30:52Z"
  },
  {
    "title": "NASA’s Next Chief, Jared Isaacman, Gives Answers in Senate Grilling",
    "description": "Jared Isaacman—the presumptive next leader of NASA—answered questions about his plans for the future of U.S. space exploration on Wednesday",
    "link": "https://www.scientificamerican.com/article/nasas-next-chief-jared-isaacman-gives-answers-in-senate-grilling/",
    "timestamp": "2025-12-03T18:30:00Z"
  },
  {
    "title": "Critics Warn “Trump Accounts” Won’t Address Most Families’ Needs",
    "description": "The program is “another giveaway to the richest Americans that leaves everyone else further behind,\" one critic said.",
    "link": "https://truthout.org/articles/critics-warn-trump-accounts-wont-address-most-families-needs/",
    "timestamp": "2025-12-03T18:28:57Z"
  },
  {
    "title": "Netanyahu Wants a Never-Go-to-Jail Card",
    "description": "His case for clemency rests on the assumption that he’s irreplaceable.",
    "link": "https://www.theatlantic.com/international/2025/12/netanyahu-pardon-request-democracy-threat/685121/",
    "timestamp": "2025-12-03T18:26:02Z"
  },
  {
    "title": "Trump Pardons Another Crook",
    "description": "President Piggy has pardoned hundreds of corrupt and/or criminal Republicans, but occasionally he’ll throw a bone to a crook with a D behind his name if it serves Piggy’s purposes. Recall that Trump sprang Rod Blagojevich in his first term. So this isn’t part…",
    "link": "https://balloon-juice.com/2025/12/03/trump-pardons-another-crook/",
    "timestamp": "2025-12-03T18:25:36Z"
  },
  {
    "title": "New health rumors erupt after Trump spotted with fresh bandages on hand",
    "description": "The sighting comes amid continued speculation about the president’s physical condition and stamina.",
    "link": "https://www.silive.com/politics/2025/12/new-health-rumors-erupt-after-trump-spotted-with-fresh-bandages-on-hand.html",
    "timestamp": "2025-12-03T18:25:34Z"
  },
  {
    "title": "Israel receives remains of possible hostage and plans to reopen Gaza crossing into Egypt",
    "description": "Israel received remains of what could be one of the last hostages in Gaza on Wednesday and said it will begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt.",
    "link": "https://www.pbs.org/newshour/world/israel-receives-remains-of-possible-hostage-and-plans-to-reopen-gaza-crossing-into-egypt",
    "timestamp": "2025-12-03T18:25:10Z"
  },
  {
    "title": "Yari dismisses calls for US intervention in Nigeria’s security challenges",
    "description": "Senator Abdulaziz Yari dismisses calls for US intervention in Nigeria’s security challenges, urging the nation’s elite to solve the country’s problems.\n\nRead More: https://punchng.com/yari-dismisses-calls-for-us-intervention-in-nigerias-security-challenges/",
    "link": "https://punchng.com/yari-dismisses-calls-for-us-intervention-in-nigerias-security-challenges/",
    "timestamp": "2025-12-03T18:24:14Z"
  },
  {
    "title": "Trump plans to weaken vehicle mileage rules that limit air pollution",
    "description": "Trump plans to weaken vehicle mileage rules that limit air pollution\nPresident Donald Trump is expected to announce a proposal to weaken vehicle mileage rules for the auto industry\nWASHINGTON -- WASHINGTON (AP) — President Donald Trump is expected to announce…",
    "link": "https://biztoc.com/x/542ae8e12ddab921",
    "timestamp": "2025-12-03T18:23:41Z"
  },
  {
    "title": "Kennedy Center Boss Loses It After Dismal Ticket Sales Leaked",
    "description": "Donald Trump loyalist Ric Grenell erupted on X in a blistering meltdown after a fired Kennedy Center staffer confirmed plunging sales and exposed...",
    "link": "https://www.thedailybeast.com/kennedy-center-boss-loses-it-after-embarrassing-figures-revealed/",
    "timestamp": "2025-12-03T18:23:28Z"
  },
  {
    "title": "Paramount's Larry and David Ellison might look to Middle East petrostates to help finance a deal for WBD. That's tricky.",
    "description": "Paramount might rely on financing from Middle Eastern petrostates for its offer to buy Warner Bros Discovery. That raises some tricky issues.",
    "link": "https://www.businessinsider.com/paramount-warner-discovery-larry-ellison-saudi-arabia-qatar-wbd-deal-2025-12",
    "timestamp": "2025-12-03T18:22:29Z"
  },
  {
    "title": "Trump insists ‘Trump is sharp’ despite cabinet meeting appearing to show him struggling to stay awake",
    "description": "The president sat back in his chair with his eyes occasionally drooping and sometimes shutting completely.",
    "link": "https://fortune.com/2025/12/03/did-trump-fall-asleep-cabinet-meeting-new-york-times-reporting/",
    "timestamp": "2025-12-03T18:22:29Z"
  },
  {
    "title": "Democrats release photos of Epstein's private island",
    "description": "Democrats in the US Congress have released photos and videos showing the luxury island home where convicted sex offender Jeffrey Epstein allegedly forced underage girls into sex with powerful men.",
    "link": "https://www.rte.ie/news/us/2025/1203/1547144-epstein-island/",
    "timestamp": "2025-12-03T18:21:47Z"
  },
  {
    "title": "Israel accused of ‘manoeuvring’ as it says Gaza crossing open one way only",
    "description": "Israel says the crucial Rafah crossing with Egypt will open in the coming days, but only for Palestinians to exit Gaza.",
    "link": "https://www.aljazeera.com/news/2025/12/3/israel-accused-of-manoeuvring-as-it-says-gaza-crossing-open-one-way-only",
    "timestamp": "2025-12-03T18:21:15Z"
  },
  {
    "title": "Trump plans to weaken vehicle mileage rules that limit air pollution",
    "description": "President Donald Trump is expected to announce a proposal to weaken vehicle mileage rules for the auto industry. That would ease pressure on automakers to control pollution from gasoline-powered cars and trucks. Trump is set to announce the plan later…",
    "link": "https://apnews.com/article/trump-gas-mileage-per-gallon-electric-vehicles-363fcad4bb90a0859f6906d086aeac69",
    "timestamp": "2025-12-03T18:20:18Z"
  },
  {
    "title": "‘We’re going to veto them’: Bessent backs new rules to give White House more power over Federal Reserve",
    "description": "Bessent said Treasury will veto Fed regional bank presidents, “unless someone has lived in their district for three years.\"",
    "link": "https://fortune.com/2025/12/03/scott-bessent-federal-reserve-veto-regional-bank-presidents/",
    "timestamp": "2025-12-03T18:19:28Z"
  },
  {
    "title": "Hegseth faces deepening scrutiny from Congress over boat strikes",
    "description": "The scrutiny over Defense Secretary Pete Hegseth's leadership at the Pentagon has been a long time coming on Capitol Hill",
    "link": "https://www.wisn.com/article/hegseth-faces-scrutiny-congress-boat-strikes/69618296",
    "timestamp": "2025-12-03T18:18:13Z"
  },
  {
    "title": "Trump will play a starring role heading into a big weekend at the Kennedy Center",
    "description": "The Kennedy Center, known for theater and opera, becomes the sports world's focus on Friday.",
    "link": "https://www.bostonherald.com/2025/12/03/world-cup-draw-kennedy-center/",
    "timestamp": "2025-12-03T18:17:37Z"
  },
  {
    "title": "Congressmen Unveil Bipartisan War Powers Resolution to Block Trump War on Venezuela",
    "description": "As President Donald Trump and Defense Secretary Pete Hegseth face mounting fury over their deadly boat bombings and threats against Venezuela, a trio of US lawmakers on Tuesday introduced a bipartisan war powers resolution aimed at blocking any attacks on the…",
    "link": "https://www.commondreams.org/news/war-powers-act-trump",
    "timestamp": "2025-12-03T18:14:19Z"
  },
  {
    "title": "Trump’s $2,000 tariff refund plan: Is any $2,000 December relief approved by the IRS — what should Americans know about Recovery Rebate Credit deposits now?",
    "description": "Trump’s $2,000 tariff payment plan is driving confusion as claims spread about IRS $2,000 checks arriving in December 2025. The IRS says no such payments are scheduled. Trump’s proposal remains only a tariff-dividend idea requiring new legislation. No funding…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-2000-tariff-refund-plan-is-any-2000-december-relief-approved-by-the-irs-what-should-americans-know-about-recovery-rebate-credit-deposits-now/articleshow/125749782.cms",
    "timestamp": "2025-12-03T18:14:13Z"
  },
  {
    "title": "Angry California Man Uses Trump Voodoo Doll During Rant: ‘I Hate the Man So Much’",
    "description": "This guy really hates Donald TrumpThe current president of the United States of America, Donald J. Trump, is arguably the most controversial leader in this nation’s history. Now, with that being said, U.S. citizens seem to either love or hate the guy; there i…",
    "link": "https://freerepublic.com/focus/f-chat/4355773/posts",
    "timestamp": "2025-12-03T18:14:12Z"
  },
  {
    "title": "Merchants of Myth: new report exposes plastic recycling as costly failure",
    "description": "A new report from Greenpeace USA reveals plastic recycling has largely failed after decades of being touted by corporations as a solution to the pollution crisis. The report uncovered that only a fifth of the 8.8 million tons of the most commonly produced typ…",
    "link": "https://www.commondreams.org/newswire/merchants-of-myth-new-report-exposes-plastic-recycling-as-costly-failure",
    "timestamp": "2025-12-03T18:12:49Z"
  },
  {
    "title": "The World Cup draw is usually a spectacle. This time, FIFA hopes bigger is better",
    "description": "A record 64 nations will be in Friday's World Cup draw, more than 30% of FIFA's members, as soccer's leaders insist a bigger tournament is better. FIFA expanded the field from 32 teams to 48, and just 42 spots have been determined going into the convoluted ce…",
    "link": "https://sports.yahoo.com/articles/world-cup-draw-usually-spectacle-181241081.html",
    "timestamp": "2025-12-03T18:12:41Z"
  },
  {
    "title": "Exclusive: Sen. Tom Cotton Unveils Bill to Kick Noncitizens Off Welfare, Expedite Deportations",
    "description": "A bill to end federal benefits including Medicaid, housing assistance, student financial aid, and food stamps for noncitizens has been introduced by Sen. Tom Cotton (R-AR) in an effort to \"put American citizens first,\" Breitbart News has learned.\nThe post Exc…",
    "link": "https://www.breitbart.com/immigration/2025/12/03/exclusive-sen-tom-cotton-unveils-bill-to-kick-noncitizens-off-welfare-expedite-deportations/",
    "timestamp": "2025-12-03T18:12:22Z"
  },
  {
    "title": "Trump's Social Media Meltdown Is Actually On Brand",
    "description": "Trump's Social Media Meltdown Is Actually On Brandcafemom.com",
    "link": "https://cafemom.com/entertainment/trump-social-media-meltdown-posts-hours-tantrum",
    "timestamp": "2025-12-03T18:08:13Z"
  },
  {
    "title": "Mike Johnson's leadership of Republicans 'in a state of collapse': report",
    "description": "House Speaker Mike Johnson's (R-LA) leadership position among Republicans is currently \"in a state of collapse,\" according to a top GOP lawmaker.In an interview with The Wall Street Journal on Wednesday, Rep. Elise Stefanik (R-NY) said that Johnson was losing…",
    "link": "https://www.rawstory.com/mike-johnson-republican-collapse/",
    "timestamp": "2025-12-03T18:07:40Z"
  },
  {
    "title": "Elise Stefanik Scorches ‘Political Novice’ Mike Johnson: ‘He Certainly Wouldn’t Have the Votes to Be Speaker’",
    "description": "Rep. Elise Stefanik (R-NY) scorched Speaker of the House Mike Johnson (R-LA) during a Tuesday evening interview with The Wall Street Journal.\nThe post Elise Stefanik Scorches ‘Political Novice’ Mike Johnson: ‘He Certainly Wouldn’t Have the Votes to Be Speaker…",
    "link": "https://www.mediaite.com/media/news/elise-stefanik-scorches-political-novice-mike-johnson-he-certainly-wouldnt-have-the-votes-to-be-speaker/",
    "timestamp": "2025-12-03T18:07:09Z"
  },
  {
    "title": "NATO chief backs US leadership in Ukraine peace push",
    "description": "Rutte supports US leadership as Ukraine and Europe rework peace plan",
    "link": "https://www.euractiv.com/news/nato-chief-backs-us-leadership-in-ukraine-peace-push/",
    "timestamp": "2025-12-03T18:06:22Z"
  },
  {
    "title": "Hegseth Risked Endangering Troops With Signal Messages",
    "description": "An inspector-general report finds that the defense secretary violated his department’s policies.",
    "link": "https://www.theatlantic.com/national-security/2025/12/hegseth-signalgate-trump-defense-pentagon/684997/",
    "timestamp": "2025-12-03T18:02:34Z"
  },
  {
    "title": "Trump targets ‘garbage’ Somalis ahead of ICE raids",
    "description": "What happened\nPresident Donald Trump Tuesday called Somali immigrants “garbage,” saying they have “ripped off” Minnesota and he doesn’t “want them in our country.” Trump’s comments, at the end of a two-hour Cabinet meeting, came as the Department of Homeland …",
    "link": "https://biztoc.com/x/0db4e7b70a953040",
    "timestamp": "2025-12-03T18:01:43Z"
  },
  {
    "title": "‘We will see volatility!’ – Eric Trump defends American Bitcoin’s 40% crash",
    "description": "What fear is lurking beneath the surface of Trump-linked crypto stocks?",
    "link": "https://ambcrypto.com/?p=551018",
    "timestamp": "2025-12-03T18:00:49Z"
  },
  {
    "title": "THE DON NAPS THROUGH CABINET MEETING...",
    "description": "President Donald Trump struggled to make it through a lengthy Cabinet meeting without a bit of shut-eye on the job. The 79-year-old told reporters he was...",
    "link": "https://www.thedailybeast.com/see-every-angle-of-donald-trump-79-nodding-off-in-his-own-cabinet-meeting/",
    "timestamp": "2025-12-03T18:00:15Z"
  },
  {
    "title": "MAGA is boycotting Costco after retail giant sues Trump admin over “unlawfully collected tariffs”",
    "description": "Costco has taken the Trump administration to court over tariffs it argues were imposed illegally, and the MAGA crowd is furious about it. \n\n\nThe retail giant filed a lawsuit in the U.S. Court of International Trade seeking refunds for duties it paid under for…",
    "link": "https://www.dailydot.com/viral-politics/maga-furious-over-costco-lawsuit-against-trump-administration/",
    "timestamp": "2025-12-03T18:00:00Z"
  },
  {
    "title": "CNN Host Works Overtime To Defend Democratic Gov Whose State Was Ripped Off By Somali Scammers",
    "description": "“CNN NewsNight” host Abby Phillip attempted to defend Democratic Gov. Tim Walz of Minnesota against criticism over a welfare fraud epidemic in the state.",
    "link": "https://dailycaller.com/2025/12/03/cnn-host-works-overtime-to-defend-democratic-gov-whose-state-was-ripped-off-by-somali-scammers/",
    "timestamp": "2025-12-03T17:58:31Z"
  },
  {
    "title": "Previewing the CDC’s December Vaccine Advisory Meeting",
    "description": "The vaccine advisory committee of the Centers for Disease Control and Prevention is scheduled to meet Dec. 4 and 5. On the agenda: the hepatitis B vaccine, the overall childhood vaccine schedule and specific vaccine ingredients. We'll summarize what we've wri…",
    "link": "https://www.factcheck.org/2025/12/previewing-the-cdcs-december-vaccine-advisory-meeting/",
    "timestamp": "2025-12-03T17:58:27Z"
  },
  {
    "title": "Hillary Clinton Joins in Blaming TikTok for Young Americans' View That Israel Is Committing Genocide",
    "description": "Since Israel began bombarding Gaza and starving its population of more than 2 million Palestinians in October 2023, the consensus that the Israeli government is committing genocide has steadily grown to include international and Israeli human rights groups, a…",
    "link": "https://www.commondreams.org/news/hillary-clinton-and-israel",
    "timestamp": "2025-12-03T17:56:57Z"
  },
  {
    "title": "Putin goes to India: From fighter jets to trade routes, massive deals are on offer",
    "description": "Military and civilian technology sharing in the air and sea, on land and in space will be discussed during the Russian president’s visit Read Full Article at RT.com",
    "link": "https://www.rt.com/india/628864-putin-india-military-aviation/",
    "timestamp": "2025-12-03T17:56:50Z"
  },
  {
    "title": "Europeans accuse Putin of feigning interest in peace after talks with US envoys",
    "description": "Ukraine's foreign minister urged Putin to “stop wasting the world’s time.”",
    "link": "https://www.bostonherald.com/2025/12/03/russia-ukraine-war-europeans-peace-talks/",
    "timestamp": "2025-12-03T17:56:33Z"
  },
  {
    "title": "‘Available to testify’: Now Jack Smith gets handed subpoena to tell what HE knows",
    "description": "Democrats' lawfare prosecutor facing grilling in Congress",
    "link": "https://www.wnd.com/2025/12/available-testify-now-jack-smith-gets-handed-subpoena/",
    "timestamp": "2025-12-03T17:55:21Z"
  },
  {
    "title": "Jack Smith subpoenaed for closed-door House Judiciary interview (Hailey Fuchs/Politico)",
    "description": "Hailey Fuchs / Politico:\nJack Smith subpoenaed for closed-door House Judiciary interview  —  The House Judiciary Committee issued a subpoena to former special counsel Jack Smith, who led investigations into President Donald Trump, ordering him to appear at a …",
    "link": "https://www.memeorandum.com/251203/p75",
    "timestamp": "2025-12-03T17:55:02Z"
  },
  {
    "title": "The US is getting serious about cheap, one-way attack drones with a new force in the Middle East",
    "description": "The drones resemble Iranian-designed Shaheds, which Russia has used in devastating strikes on Ukraine throughout the war.",
    "link": "https://www.businessinsider.com/us-new-cheap-one-way-attack-drone-force-middle-east-2025-12",
    "timestamp": "2025-12-03T17:54:54Z"
  },
  {
    "title": "Trump plans to weaken vehicle mileage rules that limit air pollution",
    "description": "President Donald Trump is expected to announce a proposal to weaken vehicle mileage rules for the auto industry",
    "link": "https://abcnews.go.com/Business/wireStory/trump-plans-weaken-vehicle-mileage-rules-limit-air-128079954",
    "timestamp": "2025-12-03T17:50:30Z"
  },
  {
    "title": "Yemen’s Houthis release 9 mariners held since July ship attack",
    "description": "The Philippines says it expected nine Filipino mariners held by the Houthis since July attack to be released in Yemen.",
    "link": "https://www.aljazeera.com/news/2025/12/3/yemens-houthis-release-9-mariners-held-since-july-ship-attack",
    "timestamp": "2025-12-03T17:49:35Z"
  },
  {
    "title": "Jamie Raskin Files Complaint To CBS News Ombudsman Over ’60 Minutes’ Edits To Donald Trump Interview",
    "description": "Rep. Jamie Raskin (D-MD), the top Democrat on the House Judiciary Committee, filed a complaint to the newly appointed CBS News ombudsman on Wednesday over...",
    "link": "https://deadline.com/2025/12/trump-60-minutes-interview-investigation-jamie-raskin-1236634642/",
    "timestamp": "2025-12-03T17:49:11Z"
  },
  {
    "title": "Jamie Raskin Files Complaint To CBS News Ombudsman Over ’60 Minutes’ Edits To Donald Trump Interview",
    "description": "Rep. Jamie Raskin (D-MD), the top Democrat on the House Judiciary Committee, filed a complaint to the newly appointed CBS News ombudsman on Wednesday over the way that 60 Minutes edited its recent interview with Donald Trump. Raskin’s letter to the ombudsman,…",
    "link": "http://deadline.com/2025/12/trump-60-minutes-interview-investigation-jamie-raskin-1236634642/",
    "timestamp": "2025-12-03T17:49:11Z"
  },
  {
    "title": "Mark Warner Says ‘Uniformed Military May Help Save Us from This President’",
    "description": "On Wednesday on MS NOW’s “Morning Joe,” Sen. Mark Warner (D-VA) argued the “uniformed military may help save us from” President Donald Trump.Co-host Mika Brzezinski said, “What are some of the questions that you will want answers to from Admiral Bradley tomor…",
    "link": "https://freerepublic.com/focus/f-news/4355768/posts",
    "timestamp": "2025-12-03T17:48:55Z"
  },
  {
    "title": "Trump Sleeps in Cabinet Meeting, Rants Online All Night",
    "description": "Trump Sleeps in Cabinet meeting, rants online all night. Trump fell asleep in public yet again on Tuesday. Maybe he should cut back on the 1:30 a.m. Truth Social posts and prioritize keeping his eyes open during important White House events.",
    "link": "http://nymag.com/intelligencer/article/trump-sleeps-in-cabinet-meeting-rants-online-all-night.html",
    "timestamp": "2025-12-03T17:48:31Z"
  },
  {
    "title": "Hillary Clinton beats Donald Trump (at addressing British MPs)",
    "description": "The former presidential hopeful will speak in Westminster next week.",
    "link": "https://www.politico.eu/article/hillary-clinton-beats-donald-trump-addressing-british-uk-mps/",
    "timestamp": "2025-12-03T17:47:45Z"
  },
  {
    "title": "Trump to scrap Biden’s fuel-economy standards",
    "description": "President Donald Trump’s administration is set to revoke tougher fuel-economy standards put in place by his predecessor Joe Biden, in a move it says will lower car prices, an official said Wednesday. Trump will be joined in the Oval Office mid-afternoon by th…",
    "link": "https://www.digitaljournal.com/world/trump-to-scrap-bidens-fuel-economy-standards/article",
    "timestamp": "2025-12-03T17:47:34Z"
  },
  {
    "title": "Maga explained: how personality and context shape radical movements",
    "description": "Psychology offers valuable insights when it comes to understanding the Maga movement.",
    "link": "https://theconversation.com/maga-explained-how-personality-and-context-shape-radical-movements-270191",
    "timestamp": "2025-12-03T17:46:52Z"
  },
  {
    "title": "‘Nightmare is finally over!’ Trump uses pardon power to rescue beleaguered DEMOCRAT",
    "description": "'I thank God for standing with my family and I during this difficult time'",
    "link": "https://www.wnd.com/2025/12/nightmare-is-finally-trump-uses-pardon-power-rescue/",
    "timestamp": "2025-12-03T17:45:49Z"
  },
  {
    "title": "Scott Galloway on the masculinity crisis: 'I worry we are evolving a new breed of asexual, asocial males' (Steve Rose/The Guardian)",
    "description": "Steve Rose / The Guardian:\nScott Galloway on the masculinity crisis: ‘I worry we are evolving a new breed of asexual, asocial males’  —  When his book Notes on Being a Man was released last month, it raced to the top of the bestseller lists.  The US author, t…",
    "link": "https://www.memeorandum.com/251203/p72",
    "timestamp": "2025-12-03T17:45:01Z"
  },
  {
    "title": "Jack Smith subpoenaed for closed-door testimony before House committee",
    "description": "A lawyer for former special counsel Jack Smith indicated he would comply with the subpoena for testimony.",
    "link": "https://www.cbsnews.com/news/jack-smith-subpoena-house-judiciary-committee-jim-jordan/",
    "timestamp": "2025-12-03T17:44:29Z"
  },
  {
    "title": "GOP wins tight House race in red Tennessee district",
    "description": "Republicans maintained their advantage in the House",
    "link": "https://theweek.com/politics/election-tennessee-republicans-democrats",
    "timestamp": "2025-12-03T17:44:23Z"
  },
  {
    "title": "All that's pledged isn't investment",
    "description": "Saudi Arabia has made headlines by promising a colossal one trillion dollar investment into the US economy. While this is an eye-catching figure, the announcement is vague regarding critical details and deadlines. Experience shows that substantial investment …",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/all-thats-pledged-isnt-investment/articleshow/125749351.cms",
    "timestamp": "2025-12-03T17:42:39Z"
  },
  {
    "title": "Man charged in National Guard shooting pleads not guilty in court appearance from hospital bed",
    "description": "A man accused of shooting two National Guard troops near the White House pleaded not guilty Tuesday to murder and assault charges during his first hearing before a judge, appearing remotely by video from a hospital bed.",
    "link": "https://www.pbs.org/newshour/nation/man-charged-in-national-guard-shooting-pleads-not-guilty-in-court-appearance-from-hospital-bed",
    "timestamp": "2025-12-03T17:42:14Z"
  },
  {
    "title": "China, Russia discuss Ukraine, reach 'consensus' on Japan during Chinese minister's visit",
    "description": "Wang Yi says Beijing and Moscow must \"continue to coordinate and cooperate\" on issues involving Japan and China's diplomatic row.",
    "link": "https://www.channelnewsasia.com/world/china-russia-discuss-ukraine-reach-consensus-japan-during-chinese-ministers-visit-5531821",
    "timestamp": "2025-12-03T17:41:59Z"
  },
  {
    "title": "Donald Trump to pardon Texas Democrat Henry Cuellar (Gabby Birenbaum/The Texas Tribune)",
    "description": "Gabby Birenbaum / The Texas Tribune:\nDonald Trump to pardon Texas Democrat Henry Cuellar  —  Cuellar had faced a dozen charges of bribery, money laundering and conspiracy.  On Wednesday, he filed for reelection as a Democrat, quieting speculation that he migh…",
    "link": "https://www.memeorandum.com/251203/p69",
    "timestamp": "2025-12-03T17:40:00Z"
  },
  {
    "title": "Richard Gere on Dalai Lama Documentary ‘Wisdom of Happiness,’ His 20-Year Oscar Ban and Donald Trump: ‘I Don’t Know How You Explain What He Has Done to This Country’",
    "description": "Richard Gere is more than just an executive producer by name on “Wisdom of Happiness,” a documentary about his longtime friend the Dalai Lama. “I’ve never worked this hard to get a film that I’ve been associated with to be seen in the world,” Gere, who first …",
    "link": "https://variety.com/2025/film/news/richard-gere-dalai-lama-documentary-20-year-oscar-ban-trump-1236597598/",
    "timestamp": "2025-12-03T17:39:22Z"
  },
  {
    "title": "Donald Trump pardons Texas Democratic Rep. Henry Cuellar",
    "description": "President Donald Trump announced on Wednesday that he would pardon Rep. Henry Cuellar, D-Texas, and his wife, Imelda, who were indicted in 2024 on charges of bribery, unlawful foreign influence and money laundering.\nCuellar’s home in Laredo was raided by the …",
    "link": "https://biztoc.com/x/9880612414acdb1b",
    "timestamp": "2025-12-03T17:39:03Z"
  },
  {
    "title": "Jack Smith subpoenaed for closed-door House Judiciary interview",
    "description": "The House Judiciary Committee issued a subpoena to former special counsel Jack Smith, who led investigations into President Donald Trump, ordering him to appear at a closed-door session later this month. \nJudiciary Chair Jim Jordan (R-Ohio) demanded in a lett…",
    "link": "https://biztoc.com/x/57a1613a9fc44156",
    "timestamp": "2025-12-03T17:39:01Z"
  },
  {
    "title": "What to know about Somalia as Trump wants Somalis in the US to leave",
    "description": "U.S. President Donald Trump has called Somali immigrants living in the United States “garbage” and wants them to leave, claiming without evidence that “they ...",
    "link": "https://www.yahoo.com/news/articles/know-somalia-trump-wants-somalis-173755034.html",
    "timestamp": "2025-12-03T17:37:55Z"
  },
  {
    "title": "Trump plans to weaken vehicle mileage rules that limit air pollution",
    "description": "The proposal would significantly reduce fuel economy requirements through the 2031 model years.",
    "link": "https://www.bostonherald.com/2025/12/03/trump-vehicle-pollution/",
    "timestamp": "2025-12-03T17:37:46Z"
  },
  {
    "title": "‘The View’s Alyssa Farah Griffin Addresses Absence From ABC Talk Show",
    "description": "Alyssa Farah Griffin has been missing all week from The View following the Thanksgiving Day weekend break. When the ABC talk show returned on Monday following the holiday weekend, Griffin was absent from the Hot Topics table. Following three days of absence, …",
    "link": "http://deadline.com/2025/12/the-view-alyssa-farah-griffin-absence-abc-talk-show-1236634711/",
    "timestamp": "2025-12-03T17:36:25Z"
  },
  {
    "title": "New Images Reveal Inside Epstein’s Private Island",
    "description": "Oversight Democrats have obtained new photos and videos from Jeffrey Epstein’s private island, offering the most detailed look yet inside the compound.",
    "link": "https://time.com/7338338/epstein-island-photos/",
    "timestamp": "2025-12-03T17:34:47Z"
  }
]