[
  {
    "title": "VICTOR DAVIS HANSON: The Trump Counterrevolution And The Moral Ledger",
    "description": "Despite the media hysteria, President Donald Trump’s counterrevolution remains on course.",
    "link": "https://dailycaller.com/2025/05/02/victor-davis-hanson-trump-moral-counterrevolution-tariffs/",
    "timestamp": "2025-05-02T14:47:26Z"
  },
  {
    "title": "'Trump Crony Club': Chappell Roan Spoof Takes Some Choice Shots At Republicans",
    "description": "'Trump Crony Club': Chappell Roan Spoof Takes Some Choice Shots At Republicanshuffpost.com",
    "link": "https://www.huffpost.com/entry/chappell-roan-spoof-trump-crony-club-late-show_n_6814c483e4b07648cc82d7ba",
    "timestamp": "2025-05-02T14:47:23Z"
  },
  {
    "title": "White House to reveal Trump’s 2026 budget, expected to reduce or eliminate many federal programs",
    "description": "The budget comes as Congress is already deep into drafting the Republican president's big bill of tax breaks, spending cuts and bolstered money for deportations and border security.",
    "link": "https://www.pbs.org/newshour/politics/white-house-to-reveal-trumps-2026-budget-expected-to-reduce-or-eliminate-many-federal-programs",
    "timestamp": "2025-05-02T14:46:13Z"
  },
  {
    "title": "Collections on defaulted student loans may affect millions of people's credit scores",
    "description": "Collections on defaulted student loans may affect millions of people's credit scoresgo.com",
    "link": "https://abcnews.go.com/Business/collections-set-begin-millions-defaulted-college-loans-heres/story?id=121371168",
    "timestamp": "2025-05-02T14:44:56Z"
  },
  {
    "title": "Mark Carney to host first post-election press conference Friday morning",
    "description": "Carney is expected to face questions about an upcoming in-person meeting with U.S. President Donald Trump",
    "link": "https://nationalpost.com/news/politics/mark-carney-first-post-election-press-conference",
    "timestamp": "2025-05-02T14:44:23Z"
  },
  {
    "title": "Trump just said there's 'no inflation' in the US. But it's still higher than what the Fed wants.",
    "description": "Trump has argued that inflation is down before. While it's steadily ebbed in recent years, prices are still rising faster than the Fed would like.",
    "link": "https://www.businessinsider.com/trump-inflation-gas-prices-economy-interest-rates-fed-jerome-powell-2025-5",
    "timestamp": "2025-05-02T14:44:01Z"
  },
  {
    "title": "Kashmir Map Shows Who Controls Territory in Contested Himalayan Region",
    "description": "The Kashmir conflict has been running for nearly eight decades, and the contested region is one of the most heavily fortified in the world.",
    "link": "https://www.newsweek.com/kashmir-conflict-control-territory-india-pakistan-china-2066959",
    "timestamp": "2025-05-02T14:42:41Z"
  },
  {
    "title": "Dublin council block ‘manosphere’ poster featuring Trump, Musk and McGregor on grounds it may be offensive",
    "description": "Dublin City Coucil blocked posters for a feminist protest featuring Donald Trump, Elon Musk and Conor McGregor amid concerns they might be offensive to tourists.",
    "link": "https://www.independent.ie/irish-news/dublin-council-block-manosphere-poster-featuring-trump-musk-and-mcgregor-on-grounds-it-may-be-offensive/a1893673545.html",
    "timestamp": "2025-05-02T14:41:38Z"
  },
  {
    "title": "MAGA + MIGA = MEGA: Dynamics of PM Modi’s Visit to the US",
    "description": "After a landmark visit to France, Prime Minister Narendra Modi concluded his state visit to the US on the invitation of US President Donald Trump. PM Modi is the fourth world leader to meet President Trump after the inauguration of his administration in Janua…",
    "link": "https://www.fairobserver.com/politics/maga-miga-mega-dynamics-of-pm-modis-visit-to-the-us/",
    "timestamp": "2025-05-02T14:40:27Z"
  },
  {
    "title": "American Democracy Is Breaking Down Under the Weight of Extremism",
    "description": "Is the American system of constitutional democracy breaking down? And if so, why? Some analysts call attention to the contempt the Trump administration, President Donald Trump himself and his appointees hold for the constitution and the limitations it imposes…",
    "link": "https://www.fairobserver.com/politics/american-democracy-is-breaking-down-under-the-weight-of-extremism/",
    "timestamp": "2025-05-02T14:40:07Z"
  },
  {
    "title": "The Trump Administration Is Hiding American Casualties of War",
    "description": "The U.S. government is keeping American casualty numbers for the undeclared war on Yemen secret. This is not normal.\nThe post The Trump Administration Is Hiding American Casualties of War appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/02/trump-yemen-war-us-casualties-death-toll/",
    "timestamp": "2025-05-02T14:39:49Z"
  },
  {
    "title": "The Weekly Closeout: NRF chief defends tariffs, Big Lots accelerates store openings",
    "description": "Matt Shay, CEO of the trade group, called duties “an extraordinarily important tool” for President Trump. Meanwhile, the discount retailer is opening 132 stores this month alone.",
    "link": "https://www.retaildive.com/news/national-retail-federation-matt-shay-tariffs-big-lots-store-openings/746902/",
    "timestamp": "2025-05-02T14:37:00Z"
  },
  {
    "title": "The Daily Money: Heard of de minimis? Why care?",
    "description": "Plus: child safety at risk, advocates say",
    "link": "https://www.usatoday.com/story/money/2025/05/02/temu-shein-shipping-de-minimis-ends/83271350007/",
    "timestamp": "2025-05-02T14:36:55Z"
  },
  {
    "title": "What Every Entrepreneur Should Know About Trump’s First 100 Days",
    "description": "What Every Entrepreneur Should Know About Trump’s First 100 Days",
    "link": "https://www.forbes.com/sites/nataliemadeiracofield/2025/05/02/what-every-entrepreneur-should-know-about-trumps-first-100-days/",
    "timestamp": "2025-05-02T14:36:54Z"
  },
  {
    "title": "Elon Musk Admits He Failed to Cut $2 Trillion in Federal Fat, But Says at Least He Enjoyed His Trump Sleepovers With Ice Cream",
    "description": "Failson Elon Musk failed miserably at his goal to cut $2 trillion in federal spending — but he did get to have sleepovers with Donald Trump during his time at the White House. In his first (and presumably last) time meeting press in the West Wing, Musk told r…",
    "link": "https://futurism.com/the-byte/elon-musk-failed-cuts-sleepovers",
    "timestamp": "2025-05-02T14:35:58Z"
  },
  {
    "title": "Elon Musk Is an Evil Piece of Garbage—and an A-Level Fraud Too",
    "description": "When I was growing up in Morgantown, West Virginia, I remember very well when that new building went up at the end of Willowdale Road, near the West Virginia University Medical Center and not too far from my friend Doug’s house.\r\nThese days, Morgantown—driven…",
    "link": "https://newrepublic.com/article/194769/elon-musk-evil-garbage-fraud",
    "timestamp": "2025-05-02T14:35:40Z"
  },
  {
    "title": "Army plans for a potential parade from Arlington to D.C. call for 6,600 soldiers",
    "description": "WASHINGTON (AP) — Detailed Army plans for a potential military parade on President Donald Trump's birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and possibly a couple thousand civilians, The Associated P…",
    "link": "https://www.arlnow.com/2025/05/02/army-plans-for-a-potential-parade-in-june-call-for-6600-soldiers/",
    "timestamp": "2025-05-02T14:35:25Z"
  },
  {
    "title": "‘What They Deserve’: Harvard Will Lose Its Tax Exempt Status, Trump Says",
    "description": "President Donald Trump said Friday that he will be \"taking away\" tax exempt status for Harvard University in a post to Truth Social.",
    "link": "https://dailycaller.com/2025/05/02/harvard-will-lose-its-tax-exempt-status-trump-says/",
    "timestamp": "2025-05-02T14:34:16Z"
  },
  {
    "title": "Trump says he will revoke Harvard University's tax-exempt status",
    "description": "President Donald Trump said Friday that he will revoke Harvard University's tax-exempt status, the latest move in the escalating clash between the administration and the Ivy League school.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-says-will-revoke-harvard-universitys-tax-exempt-status-rcna204398",
    "timestamp": "2025-05-02T14:33:28Z"
  },
  {
    "title": "Free Giant Goldfish Crackers and More Big Menu Changes at This Hot NYC Restaurant",
    "description": "Top Chef winner Danny Garcia changes the menu at his New York City restaurant Time and Tide, with a free giant goldfish cracker for the table,",
    "link": "https://ny.eater.com/2025/5/2/24421846/time-and-tide-nyc-restaurant-menu-changes-free-goldfish-cracker",
    "timestamp": "2025-05-02T14:33:22Z"
  },
  {
    "title": "Army planning potential DC parade on Trump’s birthday",
    "description": "Detailed Army plans for a potential military parade on President Trump's birthday call for more than 6,600 soldiers, 50 helicopters and seven bands.",
    "link": "https://www.nbcwashington.com/news/local/army-planning-potential-dc-military-parade-on-trumps-birthday-with-6k-soldiers-50-helicopters/3904664/",
    "timestamp": "2025-05-02T14:33:14Z"
  },
  {
    "title": "Tim Cook Says Apple Will Invest $500 Billion In The U.S. Over The Next Four Years, Thanks Trump For Advancing Domestic Semiconductor Manufacturing",
    "description": "Amid ongoing tensions between Apple and the new import policies, Apple CEO Tim Cook saw fit to virtually appear this week at a business executive gathering to celebrate President Donald Trump's first 100 days in the office. Cook shared insights on the company…",
    "link": "https://wccftech.com/tim-cook-thanked-trump-says-apple-will-invest-500-billion/",
    "timestamp": "2025-05-02T14:32:16Z"
  },
  {
    "title": "Iran Slams Trump as Nuclear Tensions Grow: \"Destructive and Unlawful\"",
    "description": "A senior Iranian military official has accused President Donald Trump of stoking domestic unrest and destabilizing the global order through what he called aggressive policies, warning that the United States is speeding toward international decline under his l…",
    "link": "https://freerepublic.com/focus/f-chat/4314619/posts",
    "timestamp": "2025-05-02T14:31:55Z"
  },
  {
    "title": "China low-value package tariff exemption ends but questions remain over US collections",
    "description": "WASHINGTON: The Trump administration ended United States duty-free access for low-value shipments from China and Hong Kong on Friday (May 2), removing the \"de minimis\" exemptions availed of by Shein, Temu and other e-commerce firms as well as traffickers of f…",
    "link": "https://www.channelnewsasia.com/world/trump-ends-china-low-value-shipments-duty-free-access-de-minimis-5105226",
    "timestamp": "2025-05-02T14:31:49Z"
  },
  {
    "title": "Tesla's Problems Create an Opportunity Elsewhere",
    "description": "There have been reports this week that the Tesla (TSLA) board have initiated a search for a new CEO to replace Elon Musk. The company has denied them, of course, but the chaos around Tesla’s leadership is adding another element of uncertainty to an industry t…",
    "link": "https://oilprice.com/Energy/Energy-General/Teslas-Problems-Create-an-Opportunity-Elsewhere.html",
    "timestamp": "2025-05-02T14:30:00Z"
  },
  {
    "title": "Shakeup in the Trump administration; Knicks eliminate the Pistons | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_beabab67-9b2e-56a8-97f0-0ed4d8b48ca7.html",
    "timestamp": "2025-05-02T14:30:00Z"
  },
  {
    "title": "China might be ready to make a deal with Trump",
    "description": "After weeks of escalating tariffs, standoffs, and combative rhetoric, Chinese officials have signaled a willingness to start trade talks with the Trump administration — but only if the U.S. is ready to show it’s ready to take things seriously.Read more...",
    "link": "https://qz.com/china-us-trade-war-negotiations-tariffs-trump-xi-1851778817",
    "timestamp": "2025-05-02T14:30:00Z"
  },
  {
    "title": "Lower Oil Prices Lead to Growth Slowdown Across the Middle East",
    "description": "Numbers Report – May 02, 2025 In the latest edition of the Numbers Report, we will take a look at some of the most interesting figures put out this week in the energy and metals sectors. Each week we’ll dig into some data and provide a bit of explanation on w…",
    "link": "https://oilprice.com/Energy/Energy-General/Lower-Oil-Prices-Lead-to-Growth-Slowdown-Across-the-Middle-East.html",
    "timestamp": "2025-05-02T14:30:00Z"
  },
  {
    "title": "Shakeup in the Trump administration; Knicks eliminate the Pistons | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_33fba68e-cfb7-514e-89f0-afa3453e7e55.html",
    "timestamp": "2025-05-02T14:30:00Z"
  },
  {
    "title": "One hundred days into Trump 2.0, is the opposition failing?",
    "description": "Donald Trump faces rising political opposition amid a growing backlash on key policies.",
    "link": "https://www.aljazeera.com/program/upfront/2025/5/2/one-hundred-days-into-trump-2-0-is-the-opposition-failing",
    "timestamp": "2025-05-02T14:28:49Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs Trial Begins Monday: Here’s What To Know About His Federal Charges",
    "description": "The latest news on Sean 'Diddy' Combs' as he awaits trial on charges of sex trafficking and racketeering.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/02/sean-diddy-combs-officially-rejects-plea-deal-heres-the-latest-on-his-federal-charges/",
    "timestamp": "2025-05-02T14:28:40Z"
  },
  {
    "title": "Trump’s War With The Media: Trump Tries To Defund PBS, NPR",
    "description": "President Donald Trump attacked \"60 Minutes\" Wednesday morning amid a report that CBS was set to enter mediation in Trump's lawsuit against the network.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/02/trumps-war-with-the-media-trump-tries-to-defund-pbs-npr/",
    "timestamp": "2025-05-02T14:28:36Z"
  },
  {
    "title": "Mike Waltz’s real mistake had little to do with the Signal scandal",
    "description": "Mike Waltz is a fairly conventional Republican foreign policy hawk, but unlike many in Trump’s foreign policy inner circle, he had actual national security experience.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/mike-waltz-trump-problem-signal-scandal-rcna204222",
    "timestamp": "2025-05-02T14:28:06Z"
  },
  {
    "title": "Why Trump Wants to Cut Federal Funding to NPR, PBS",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has signed an executive order to cut federal funding for National Public Radio (NPR) and the Public Broadcasting Service (PBS), escalating a long-standing conservative critique of public…",
    "link": "https://biztoc.com/x/20fbfb2d705e3260",
    "timestamp": "2025-05-02T14:28:00Z"
  },
  {
    "title": "Trump Tariffs Were An Earthquake. The Trade War Tsunami Is Hitting U.S. Ports",
    "description": "President Donald Trump's trade war has ocean shippers changing course as tariffs bring uncertainty and forecasts of falling demand. U.S. port activity tells the tale.\nThe post Trump Tariffs Were An Earthquake. The Trade War Tsunami Is Hitting U.S. Ports. appe…",
    "link": "https://biztoc.com/x/59f17d1cfe8135ec",
    "timestamp": "2025-05-02T14:27:44Z"
  },
  {
    "title": "Abbe Lowell starts firm to take on Trump — and hires renegade ex-Skadden associate",
    "description": "Rachel Cohen, who dramatically quit her Big Law job at Skadden Arps over how it handled Trump, joined a new firm launched by Abbe Lowell.",
    "link": "https://www.businessinsider.com/rachel-cohen-big-law-abbe-lowell-trump-skadden-2025-5",
    "timestamp": "2025-05-02T14:26:18Z"
  },
  {
    "title": "On taxpayers' money 6600 soldiers to take part in a parade on Donald Trump's birthday? Here's what we know so far",
    "description": "The Army is considering a massive military parade in Washington, D.C., on June 14th to commemorate its 250th anniversary, potentially coinciding with Donald Trump's birthday. The proposed event would involve thousands of troops, vehicles, and aircraft, expand…",
    "link": "https://economictimes.indiatimes.com/news/international/us/on-taxpayers-money-6600-soldiers-to-take-part-in-a-parade-on-donald-trumps-birthday-heres-what-we-know-so-far/articleshow/120827952.cms",
    "timestamp": "2025-05-02T14:25:53Z"
  },
  {
    "title": "Prime Minister Mark Carney to visit Trump at White House next week",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/prime-minister-mark-carney-to-visit-trump-at-white-house-next-week-9.6745127",
    "timestamp": "2025-05-02T14:25:35Z"
  },
  {
    "title": "The Last (Michael) Waltz",
    "description": "Jeet Heer\n\n\n\nWe should welcome the humiliation of Trump’s hawkish, neocon national security adviser.\r\n\n\r\n\n\nThe post The Last (Michael) Waltz appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/michael-waltz-demotion-trump/",
    "timestamp": "2025-05-02T14:25:20Z"
  },
  {
    "title": "Microsoft hikes Xbox prices worldwide as gaming industry faces tariff uncertainty",
    "description": "Amid a backdrop of ongoing tariff uncertainty, more and more gamers are facing price hikes.",
    "link": "https://www.ksat.com/business/2025/05/02/microsoft-hikes-xbox-prices-worldwide-as-gaming-industry-faces-tariff-uncertainty/",
    "timestamp": "2025-05-02T14:23:10Z"
  },
  {
    "title": "Everything Is the ‘Twitter Files’ Now",
    "description": "The State Department is using Elon Musk’s playbook.",
    "link": "https://www.theatlantic.com/technology/archive/2025/05/state-department-beattie-twitter-files/682667/",
    "timestamp": "2025-05-02T14:20:37Z"
  },
  {
    "title": "President Trump signs order seeking to end federal funding for NPR and PBS (CNN)",
    "description": "CNN:\nPresident Trump signs order seeking to end federal funding for NPR and PBS  —  President Donald Trump signed an executive order Thursday directing the Corporation for Public Broadcasting to end federal funding for America's two biggest public broadcaster…",
    "link": "https://www.memeorandum.com/250502/p49",
    "timestamp": "2025-05-02T14:20:00Z"
  },
  {
    "title": "Trump's surgeon general pick touted as 'fierce' MAHA advocate before confirmation hearing",
    "description": "President Donald Trump’s pick for U.S. surgeon general, Dr. Janette Nesheiwat, has been making the rounds on Capitol Hill, garnering support ahead of her upcoming confirmation hearing, with senators describing her as a \"fierce\" advocate for the \"Make America …",
    "link": "https://www.foxnews.com/politics/trump-surgeon-general-pick-touted-fierce-maha-advocate-before-confirmation-hearing",
    "timestamp": "2025-05-02T14:19:35Z"
  },
  {
    "title": "Why Trump Wants to Cut Federal Funding to NPR, PBS",
    "description": "Trump orders an end to federal funding for NPR and PBS, intensifying GOP attacks on public media over alleged political bias.",
    "link": "https://www.newsweek.com/why-trump-cut-pbs-npr-funding-executive-order-2067162",
    "timestamp": "2025-05-02T14:19:35Z"
  },
  {
    "title": "Trump Signs Executive Order Defunding ‘Biased’ NPR, PBS",
    "description": "President Donald Trump signed an executive order on Thursday night axing taxpayer funding for “biased” news outlets NPR and PBS. “National Public Radio and the... Read More\nThe post Trump Signs Executive Order Defunding ‘Biased’ NPR, PBS appeared first on The…",
    "link": "https://www.dailysignal.com/2025/05/02/trump-signs-executive-order-defunding-biased-npr-pbs/",
    "timestamp": "2025-05-02T14:18:59Z"
  },
  {
    "title": "Trump administration discontinues $1 billion in school mental health grants - NewsBreak",
    "description": "The Trump administration will not renew Biden-era grants worth $1 billion that were aimed at boosting mental health services in schools, a Department of E",
    "link": "https://www.newsbreak.com/share/3987831392442-trump-administration-discontinues-1-billion-in-school-mental-health-grants?s=a2&amp;share_destination_id=NTU3NDI0MDMtMTc0NjE5NTQ5MTQ1Mw%3D%3D&amp;pd=03lt91FD&amp;hl=en_US&amp;send_time=1746195491&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v1%2Cns_local_strategy_25q1_exp-v14%2Cns_foryou_blend_exp_25q2-v1%2Cns_foryou_recall_exp_25q2-v7",
    "timestamp": "2025-05-02T14:18:38Z"
  },
  {
    "title": "US Travel Warnings for Middle East, Asia Amid Iran Tensions",
    "description": "It comes as a fourth round of Iran nuclear talks was delayed.",
    "link": "https://www.newsweek.com/middle-east-asia-iran-nuclear-talks-donald-trump-travel-warnings-2067229",
    "timestamp": "2025-05-02T14:18:35Z"
  },
  {
    "title": "How the political consensus on climate change has shattered",
    "description": "In 2019, the UK committed in law to reducing its carbon emissions to net zero by 2050. Now the political climate has changed.",
    "link": "https://www.bbc.com/news/articles/cx20znjejw1o",
    "timestamp": "2025-05-02T14:16:59Z"
  },
  {
    "title": "Employers added a surprising 177,000 jobs, unemployment remains low, as job market shows resilience",
    "description": "President Donald Trump's aggressive and unpredictable policies have clouded the outlook for the economy but Friday's report showed the damage isn't showing up in the labor market yet.",
    "link": "https://www.pbs.org/newshour/economy/employers-added-a-surprising-177000-jobs-unemployment-remains-low-as-job-market-shows-resilience",
    "timestamp": "2025-05-02T14:15:53Z"
  },
  {
    "title": "White House comes out with sharp spending cuts in Trump’s 2026 budget plan",
    "description": "The budget shows a desire to crack down on initiatives to address climate change.",
    "link": "https://www.bostonherald.com/2025/05/02/white-house-trump-budget/",
    "timestamp": "2025-05-02T14:14:36Z"
  },
  {
    "title": "Mike Waltz Was Demoted, Says John Bolton (Who Held Both Roles)",
    "description": "John Bolton countered JD Vance's framing of national security adviser Mike Waltz's role change as a \"promotion.\"",
    "link": "https://www.newsweek.com/mike-waltz-demoted-john-bolton-2067213",
    "timestamp": "2025-05-02T14:14:25Z"
  },
  {
    "title": "Jimmy Kimmel Sees Elon Musk’s Future After Leaving DOGE: He Can “Go Back To Impregnating Women”",
    "description": "Kimmel joked Musk will be able to \"focus on his own disaster of a company.\"",
    "link": "https://decider.com/2025/05/02/jimmy-kimmel-sees-elon-musks-future-after-leaving-doge-he-can-go-back-to-impregnating-women/",
    "timestamp": "2025-05-02T14:13:54Z"
  },
  {
    "title": "'Not Kissinger': Marco Rubio's 'level of seriousness' questioned as he takes on new role",
    "description": "Rep. Eric Swalwell (D-CA) was very blunt when asked on CNN Friday if he thought Marco Rubio could juggle \"both being Secretary of State and national security adviser.\"\n\n\"No,\" Swalwell said, nearly before anchor Kate Bolduan finished her question.\n\nBolduan con…",
    "link": "https://www.rawstory.com/rubio-waltz-level-of-seriousness/",
    "timestamp": "2025-05-02T14:10:49Z"
  },
  {
    "title": "Trump’s Mob-like Shakedown: A Scandal Starring “60 Minutes,” Paramount, and the FCC",
    "description": "Once upon a time, but not so long ago, if an American president was involved with a company that had vital business before a federal agency, it would be expected that the chief executive would steer clear of all government deliberations about that firm and th…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-paramount-skydance-60-minutes-cbs-brendan-carr-fcc-bill-owens/",
    "timestamp": "2025-05-02T14:10:04Z"
  },
  {
    "title": "This Impeachment Push Against Trump Has Become a Complete and Total Disaster (Matt Vespa/Townhall)",
    "description": "Matt Vespa / Townhall:\nThis Impeachment Push Against Trump Has Become a Complete and Total Disaster  —  Who is running the ship?  Who has the conn?  Because this latest impeachment push against President Donald Trump is already coming off the hinges.  It migh…",
    "link": "https://www.memeorandum.com/250502/p47",
    "timestamp": "2025-05-02T14:10:00Z"
  },
  {
    "title": "Sorry, but Trump's transgender policies are just common sense (Kimberly Ross/Washington Examiner)",
    "description": "Kimberly Ross / Washington Examiner:\nSorry, but Trump's transgender policies are just common sense  —  The day he was sworn in as the 47th president, Donald Trump signed an executive order titled “Defending Women From Gender Ideology Extremism and Restoring B…",
    "link": "https://www.memeorandum.com/250502/p46",
    "timestamp": "2025-05-02T14:10:00Z"
  },
  {
    "title": "Warren Buffett's favorite stock market signal shows it may be time to buy",
    "description": "The Buffett Indicator has dropped from all-time highs, suggesting stock valuations are looking more attractive after April's volatility.",
    "link": "https://www.businessinsider.com/warren-buffett-stock-market-indicator-buy-signal-omaha-rally-correction-2025-5",
    "timestamp": "2025-05-02T14:09:51Z"
  },
  {
    "title": "Travel demand decline: How US economy faces billions in losses due to Trump trade policies",
    "description": "Weakening travel demand, fueled by trade war uncertainties and anti-American sentiment, threatens to erase billions from the U.S. economy. Airlines are retracting forecasts, and analysts project a significant hit to GDP from reduced foreign travel spending. D…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/travel-demand-decline-how-us-economy-faces-billions-in-losses-due-to-trump-trade-policies/articleshow/120827858.cms",
    "timestamp": "2025-05-02T14:09:45Z"
  },
  {
    "title": "GM Canada to cut shift at Oshawa Assembly Plant, union calls move ‘reckless’",
    "description": "GM Canada says it plans to cut a shift at its Oshawa Assembly Plant due to updated demand forecasts and the evolving trade environment. The company said Friday that it will move from a three-shift to two-shift operation to “help support a sustainable manufact…",
    "link": "https://financialpost.com/pmn/gm-canada-to-cut-shift-at-oshawa-assembly-plant-union-calls-move-reckless",
    "timestamp": "2025-05-02T14:08:20Z"
  },
  {
    "title": "CNN’s Scott Jennings Teases Announcement Amid Rumors of Trump-Backed Senate Campaign: ‘Something Big Is Coming’",
    "description": "CNN's Scott Jennings teased an announcement on Friday as rumors continue to swirl about him mounting a campaign for the Senate.\nThe post CNN’s Scott Jennings Teases Announcement Amid Rumors of Trump-Backed Senate Campaign: ‘Something Big Is Coming’ first appe…",
    "link": "https://www.mediaite.com/news/cnns-scott-jennings-teases-announcement-amid-rumors-of-trump-backed-senate-campaign-something-big-is-coming/",
    "timestamp": "2025-05-02T14:06:31Z"
  },
  {
    "title": "China Hints at Possible Thaw With US in Trade Talks",
    "description": "China said it is assessing the possibility of trade talks with the US, the first sign since Donald Trump hiked tariffs last month that negotiations could begin between the two sides.\nChina’s Commerce Ministry said in a Friday statement that it had noted senio…",
    "link": "https://biztoc.com/x/2269491918634768",
    "timestamp": "2025-05-02T14:05:42Z"
  },
  {
    "title": "Hilarious! Reporter Ends Schumer’s Entire Career After He Attacks Trump on Bogus 100-Day Poll Numbers (VIDEO)",
    "description": "Senate Minority Leader Chuck Schumer on Tuesday attempted to trash President Trump over bogus poll numbers. The fake news media attacked President Trump this week with reports claiming he has the lowest 100 day approval rating in 80 years. “Twice as many peop…",
    "link": "https://freerepublic.com/focus/f-chat/4314615/posts",
    "timestamp": "2025-05-02T14:05:12Z"
  },
  {
    "title": "ZA Miner Introduces ‘Trump Coin,’ a Politically Themed Digital Asset for Crypto Enthusiasts",
    "description": "ZA Miner launches Trump Coin, a politically inspired digital currency on Ethereum, combining collector appeal with real blockchain utility.......",
    "link": "https://www.globenewswire.com/news-release/2025/05/02/3073355/0/en/ZA-Miner-Introduces-Trump-Coin-a-Politically-Themed-Digital-Asset-for-Crypto-Enthusiasts.html",
    "timestamp": "2025-05-02T14:04:00Z"
  },
  {
    "title": "Trump’s Birthday Parade Now Includes Thousands of Soldiers and Tanks",
    "description": "Happy birthday, Mr. President—it looks like Donald Trump may be getting his wish of a massive parade in his honor.\r\nThe Associated Press reported late Thursday that the Army’s most recent plans to celebrate its 250th anniversary include a large military parad…",
    "link": "https://newrepublic.com/post/194764/trump-birthday-parade-thousands-soldiers-tanks",
    "timestamp": "2025-05-02T14:02:27Z"
  },
  {
    "title": "Seth Meyers Drags Trump for Lecture on Having Less Possessions: The Guy ‘We All Know’ Is Parker Posey’s ‘White Lotus’ Character? | Video",
    "description": "\"The guy with marble fountains and a golden country club is lecturing us on the folly of material possessions?\" the NBC host scoffs\nThe post Seth Meyers Drags Trump for Lecture on Having Less Possessions: The Guy ‘We All Know’ Is Parker Posey’s ‘White Lotus’ …",
    "link": "https://www.thewrap.com/trump-tariffs-empty-shelves-seth-meyers-white-lotus-character/",
    "timestamp": "2025-05-02T14:01:48Z"
  },
  {
    "title": "DOGE expands presence at Wall St regulator, sources say",
    "description": "(Reuters) -Presidential adviser Elon Musk's Department of Government Efficiency (DOGE) is expanding its presence at the U.S. Securities and Exchange...",
    "link": "https://finance.yahoo.com/news/doge-expands-presence-wall-st-140055774.html",
    "timestamp": "2025-05-02T14:00:55Z"
  },
  {
    "title": "Major Tariff Loophole Closed Today—And Cheap Imports Will Be Hit Hard. Here’s What To Expect.",
    "description": "Trump referred to the commonly used trade exemption as a “big scam going on against our country, against really small businesses.”",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/02/major-tariff-loophole-closed-today-and-cheap-imports-will-be-hit-hard-heres-what-to-expect/",
    "timestamp": "2025-05-02T14:00:50Z"
  },
  {
    "title": "Wall Street opens higher following a stronger-than-expected report on the US job market",
    "description": "Wall Street extended its gains to a ninth straight day, marking its longest winning streak since 2004 and reclaiming the ground it lost since President Donald Trump escalated his trade war in early April.",
    "link": "https://www.click2houston.com/business/2025/05/02/asian-shares-rise-as-china-says-its-considering-us-overtures-on-trumps-tariffs/",
    "timestamp": "2025-05-02T14:00:46Z"
  },
  {
    "title": "Donald Trump on his recession: ‘Maybe the children will have 2 dolls instead of 30’",
    "description": "America had a good run as the land of plenty, the country with cheap goods and a solid economy. Say goodbye to the land of plenty, say goodbye to the American Century. Several economic forecasts came out this week and all of them have sent the Trump administr…",
    "link": "https://www.celebitchy.com/920460/donald_trump_on_his_recession_maybe_the_children_will_have_2_dolls_instead_of_30/",
    "timestamp": "2025-05-02T14:00:40Z"
  },
  {
    "title": "Equity Fund Founder Reveals Why XRP ETF Is Anticipated, ‘There’s Value There’",
    "description": "The XRP ETFs have become one of the most anticipated filings in the crypto space, with over 10 already crossing the desk of the Securities and Exchange Commission (SEC). While expectations were that the regulator would approve XRP ETFs for trading at the star…",
    "link": "http://www.newsbtc.com/analysis/xrp/xrp-etf-theres-value-there/",
    "timestamp": "2025-05-02T14:00:24Z"
  },
  {
    "title": "Tariffs Test Big Tech: Apple, Amazon, and Meta Brace for Costly Disruption",
    "description": "In Q1 earnings calls, CEOs reveal how they’re adjusting strategies and managing cost hikes through 2025.",
    "link": "https://www.adweek.com/media/tariffs-big-tech-google-amazon-meta-disruption/",
    "timestamp": "2025-05-02T14:00:19Z"
  },
  {
    "title": "Trump’s Tariffs Are Decimating People’s Wallets. The Solution Is Almost Too Easy.",
    "description": "It’s as simple as calling the tariffs what they are.",
    "link": "https://slate.com/news-and-politics/2025/05/donald-trump-news-tariffs-china-restaurant-bill.html",
    "timestamp": "2025-05-02T14:00:00Z"
  },
  {
    "title": "North Carolina Justice Speaks Out About Republicans’ Effort to Steal Her Seat",
    "description": "Jefferson Griffin has urged courts to throw out tens of thousands of North Carolina ballots in a test-run of Trump's election-rigging strategy.",
    "link": "http://www.rollingstone.com/politics/politics-features/nc-supreme-court-gop-trump-allison-riggs-jefferson-griffin-1235330294/",
    "timestamp": "2025-05-02T14:00:00Z"
  },
  {
    "title": "Brendan Carr Is Turning the FCC Into MAGA’s Censoring Machine",
    "description": "Under its new chairman, the FCC is threatening broadcasters and pushing President Donald Trump’s agenda.",
    "link": "https://www.wired.com/story/plaintext-fcc-brendan-carr-donald-trump/",
    "timestamp": "2025-05-02T14:00:00Z"
  },
  {
    "title": "Democratic senators call for investigation into Elon Musk’s foreign Starlink deals",
    "description": "Democratic senators alleged that billionaire Elon Musk may have used his White House job to drum up deals in foreign countries for Starlink.",
    "link": "https://www.nbcnews.com/tech/elon-musk/democrats-call-investigate-musks-foreign-starlink-deals-rcna204348",
    "timestamp": "2025-05-02T14:00:00Z"
  },
  {
    "title": "Republicans Were Eager to Investigate Biden, But Not Trump",
    "description": "Philip Bump of The Washington Post notes the hypocrisy of Republicans, especially James Comer, chairman of the House Oversight Committee, who searched and searched forevidence of President Biden’s corruption. He never found it but he never stopped looking and…",
    "link": "https://dianeravitch.net/2025/05/02/republicans-were-eager-to-investigate-biden-but-not-trump/",
    "timestamp": "2025-05-02T14:00:00Z"
  },
  {
    "title": "Russian State TV Says Nuclear Strike Would Turn US Into 'Waterworld'",
    "description": "The comments were in response to remarks made recently by Senator John Kennedy directed at Vladimir Putin and the Russian administration.",
    "link": "https://www.newsweek.com/russian-state-tv-says-nuclear-strike-would-turn-us-waterworld-2067134",
    "timestamp": "2025-05-02T13:59:53Z"
  },
  {
    "title": "ROOKE: One Of Trump’s Former Critics Has Turned Into The Admin’s Greatest Workhorse",
    "description": "President Trump has a habit of turning his opponents into allies, and that's precisely what he's done with Secretary of State Marco Rubio.",
    "link": "https://dailycaller.com/2025/05/02/rooke-trump-rubio-walz-national-security-adviser/",
    "timestamp": "2025-05-02T13:59:31Z"
  },
  {
    "title": "English football bosses ban trans athletes from women’s game",
    "description": "England’s Football Association says it is banning transgender athletes from playing for female teams after a Supreme Court ruling Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616661-trans-women-barred-soccer-england/",
    "timestamp": "2025-05-02T13:58:32Z"
  },
  {
    "title": "EU Fine: TikTok's Latest Setback",
    "description": "The massive EU fine against TikTok on Friday marks the latest setback for the popular Chinese-owned social media platform, which has more than one billion users.",
    "link": "https://www.ibtimes.com/eu-fine-tiktoks-latest-setback-3772289",
    "timestamp": "2025-05-02T13:57:17Z"
  },
  {
    "title": "EU Fine: TikTok's Latest Setback",
    "description": "The massive EU fine against TikTok on Friday marks the latest setback for the popular Chinese-owned social media platform, which has more than one billion users.",
    "link": "https://www.ibtimes.com.au/eu-fine-tiktoks-latest-setback-1858476",
    "timestamp": "2025-05-02T13:57:13Z"
  },
  {
    "title": "Trump's Shocking Response to Stephen A. Smith Running for President in 2028",
    "description": "Photo: Cindy Ord, Andrew Harnik (Getty Images)\r\nPresident Donald Trump just celebrated 100 days in office, but he’s already thinking about the next election. Unlike in recent months when he toyed with possibly running for a third term— which the Constitution …",
    "link": "https://www.theroot.com/trumps-shocking-response-to-stephen-a-smith-running-fo-1851778858",
    "timestamp": "2025-05-02T13:57:00Z"
  },
  {
    "title": "The case for chaos: Why Israel must avoid another Gaza containment policy",
    "description": "Israel needs to get used to the idea that, in the absence of an entity willing to take Gaza under its wing, chaos will prevail there.",
    "link": "https://www.jpost.com/opinion/article-852296",
    "timestamp": "2025-05-02T13:56:55Z"
  },
  {
    "title": "Canada’s Carney Set to Meet Trump at White House Early Next Week",
    "description": "Canadian Prime Minister Mark Carney is scheduled to meet with US President Donald Trump in Washington on Tuesday, people familiar with the matter said, their first encounter since Carney won an election in part because of an anti-Trump message.",
    "link": "https://financialpost.com/pmn/business-pmn/canadas-carney-set-to-meet-trump-at-white-house-early-next-week",
    "timestamp": "2025-05-02T13:56:30Z"
  },
  {
    "title": "Mark Carney set to meet Trump at White House early next week",
    "description": "Canadian Prime Minister Mark Carney is scheduled to meet with United States President Donald Trump in Washington on Tuesday. Find out more",
    "link": "https://financialpost.com/news/carney-to-meet-trump-next-week",
    "timestamp": "2025-05-02T13:56:30Z"
  },
  {
    "title": "Donald Trump Signs Executive Order to Defund NPR and PBS",
    "description": "Donald Trump has signed an executive order to cut public funding of NPR and PBS. Trump has claimed that the broadcasters have \"bias\" in",
    "link": "https://exclaim.ca/music/article/donald-trump-signs-executive-order-to-defund-npr-and-pbs",
    "timestamp": "2025-05-02T13:55:58Z"
  },
  {
    "title": "Trump Goes Nuclear in Late-Night Truth Social Post — Torches Radical Democrats for Weaponizing Impeachment Again, Demands GOP Expel Corrupt Leftist Lawmakers",
    "description": "President Donald Trump dropped a late-night truth bomb on Truth Social, absolutely obliterating the radical Left’s latest impeachment obsession — and warning Republicans it’s time to start playing offense.In a fiery post just before midnight, Trump called out…",
    "link": "https://freerepublic.com/focus/f-news/4314614/posts",
    "timestamp": "2025-05-02T13:55:37Z"
  },
  {
    "title": "Trump Tariffs Could Offer Lifeline for World's Finest Cotton",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nEgypt, long recognized for its premium cotton, could gain ground in the global market as a result of President Donald Trump's tariff war with China, industry experts say.\nNewsweek has reached out to the Egypti…",
    "link": "https://biztoc.com/x/0653855690163d7f",
    "timestamp": "2025-05-02T13:55:09Z"
  },
  {
    "title": "Horse Racing Industry Sends Warning to Trump Ahead of Kentucky Derby",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the Kentucky Derby approaches, the horse racing industry is urging President Donald Trump and Congress to take swift action on immigration reform. Business leaders gathered in Louisville on Thursday and cal…",
    "link": "https://biztoc.com/x/6e07634ff38f43bb",
    "timestamp": "2025-05-02T13:55:02Z"
  },
  {
    "title": "Americans see more overreach from the president than from judges, an AP-NORC poll finds",
    "description": "About half of U.S. adults say the president has “too much power” in the way government operates these days.",
    "link": "https://www.bostonherald.com/2025/05/02/donald-trump-poll-presidential-power/",
    "timestamp": "2025-05-02T13:54:42Z"
  },
  {
    "title": "‘The Daily Show’ Has the Cure for ‘Trump Derangement Syndrome’ | Video",
    "description": "“The only disease Trump can give you that doesn’t require you to notify recent sex partners,” host Michael Kosta jokes\nThe post ‘The Daily Show’ Has the Cure for ‘Trump Derangement Syndrome’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-daily-show-cure-for-trump-derangement-syndrome/",
    "timestamp": "2025-05-02T13:54:18Z"
  },
  {
    "title": "‘I Like Authenticity’: Black Trump Voters Tell CNN’s Van Jones They Have No Regrets",
    "description": "Three black voters who cast ballots for President Donald Trump in November told CNN's Van Jones in a Thursday segment that they do not regret their votes.",
    "link": "https://dailycaller.com/2025/05/02/black-trump-voters-tell-cnns-van-jones-no-regrets/",
    "timestamp": "2025-05-02T13:53:04Z"
  },
  {
    "title": "Trump’s Automobile Tariff Exemption Only Benefits Tesla",
    "description": "Unlike Donald Trump’s White House sales pitch for Tesla, The Trump administration tried to cover up its latest big gift to shadow president and megadonor Elon Musk as a blanket policy pronouncement.\nOn Tuesday, Trump’s 100th day in office, Donald Trump signed…",
    "link": "https://crooksandliars.com/2025/05/trump-s-automobile-tariff-exemption-only",
    "timestamp": "2025-05-02T13:52:35Z"
  },
  {
    "title": "Trump isn't the only one to blame for the U.S.'s shrinking economy",
    "description": "Joe Scarborough calls out Republicans for refusing to stand up to Trump over tariffs and says they deserve part of the blame for the struggling U.S. economy.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-blame-republicans-economy-rcna204125",
    "timestamp": "2025-05-02T13:52:10Z"
  },
  {
    "title": "The Trump admin is suing four states to stop them from holding fossil fuel giants accountable for climate damage",
    "description": "The lawsuits mark the administration’s latest attack on climate action in the name of “energy dominance” and has raised fears about states’ ability to pursue action against polluters.",
    "link": "https://www.cnn.com/2025/05/02/climate/trump-climate-lawsuits-hawaii-michigan-new-york-vermont",
    "timestamp": "2025-05-02T13:50:43Z"
  },
  {
    "title": "Horse Racing Industry Sends Warning to Trump Ahead of Kentucky Derby",
    "description": "Industry leaders gathered in Louisville and urged the administration to prioritize a legal pathway for immigrant workers.",
    "link": "https://www.newsweek.com/donald-trump-kentucky-derby-horse-racing-industry-2067202",
    "timestamp": "2025-05-02T13:48:43Z"
  },
  {
    "title": "Democrats Are Terrified Trump’s Policies Are Going to Work",
    "description": "(Daily Signal)—Hello, this is Victor Davis Hanson for The Daily Signal. There’s been a lot of media hysteria, some ambiguous and some negative polls. We have talked about that before, that they seem to be not so disinterested as we might imagine. It’s in line…",
    "link": "https://freerepublic.com/focus/f-news/4314612/posts",
    "timestamp": "2025-05-02T13:48:10Z"
  }
]