[
  {
    "title": "Donald Trump exempts Mexico from tariffs for a month: what happened to Canada?",
    "description": "This announcement follows Trump's decision earlier in the week to impose a 25% tariffs on goods imported from both Mexico and Canada",
    "link": "https://www.merca20.com/donald-trump-exempts-mexico-from-tariffs-for-a-month-what-happened-to-canada/",
    "timestamp": "2025-03-06T18:19:04Z"
  },
  {
    "title": "Was Donald Trump recruited by KGB in 1987? Former intelligence official claims this happened",
    "description": "Former Kazakh intelligence chief Ainur Mussayev has alleged that US President  Donald Trump was recruited by the KGB during his 1987 visit to Moscow. Other former KGB officers have supported the claim, though no verifiable evidence has surfaced. The allegatio…",
    "link": "https://economictimes.indiatimes.com/news/international/us/was-donald-trump-recruited-by-kgb-in-1987-former-intelligence-official-claims-this-happened/articleshow/118767870.cms",
    "timestamp": "2025-03-06T18:18:49Z"
  },
  {
    "title": "Top officials to brief parliamentary panel on US reciprocal tariffs and trade policy",
    "description": "Top Indian officials are set to brief a parliamentary panel on trade policy, including the US's recently announced reciprocal tariffs on India. The meeting, chaired by Shashi Tharoor, aims to address concerns over how these tariffs will affect Indian industry…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/top-officials-to-brief-parliamentary-panel-on-us-reciprocal-tariffs-and-trade-policy/articleshow/118767872.cms",
    "timestamp": "2025-03-06T18:18:47Z"
  },
  {
    "title": "Exclusive -- Rep. Tim Burchett: Democrats Not Standing Up for Child with Brain Cancer Shows 'How Far the Left Has Fallen'",
    "description": "Democrats not standing up for a child with brain cancer during Trump's address on Tuesday evening shows \"how far the left has fallen,\" Rep. Tim Burchett said.\nThe post Exclusive — Rep. Tim Burchett: Democrats Not Standing Up for Child with Brain Cancer Shows …",
    "link": "https://www.breitbart.com/politics/2025/03/06/exclusive-rep-tim-burchett-democrats-not-standing-up-for-child-brain-cancer-shows-how-far-the-left-has-fallen/",
    "timestamp": "2025-03-06T18:18:33Z"
  },
  {
    "title": "Trump Delays Tariffs On Most Imports From Mexico Until April",
    "description": "No change was announced regarding the new tariffs imposed on Canada.",
    "link": "https://www.huffpost.com/entry/trump-tariffs-mexico_n_67c9e668e4b0404dff3004bb",
    "timestamp": "2025-03-06T18:18:32Z"
  },
  {
    "title": "Hamas Accuses Israel Over Bodies as Trump Brands Group 'Sick and Twisted'",
    "description": "A senior Hamas official shared with Newsweek his reaction to a stark threat issued by U.S. President Donald Trump over the nearly 60 living and dead hostages still being held by the group 16 months into its war with Israel.\nShortly after meeting with former h…",
    "link": "https://biztoc.com/x/f7bd521d7ea623ff",
    "timestamp": "2025-03-06T18:17:34Z"
  },
  {
    "title": "Panama President Issues Defiant Response To Donald Trump Over 'Reclaiming' Canal Line",
    "description": "Panama President José Raúl Mulino on Wednesday accused U.S. President Donald Trump of lying when he said in his address to Congress that his administration was “reclaiming” the Panama Canal.\nTrump was referencing a deal announced Tuesday for a consortium led …",
    "link": "https://biztoc.com/x/a02a05241ad339f0",
    "timestamp": "2025-03-06T18:17:20Z"
  },
  {
    "title": "Trump allegedly mulling NATO policy shift",
    "description": "United States President Donald Trump is considering significant changes to the country's engagement in the North Atlantic Treaty Organization (NATO), NBC News reported on Thursday, citing current and ...",
    "link": "https://biztoc.com/x/ec451ffb359d279b",
    "timestamp": "2025-03-06T18:17:15Z"
  },
  {
    "title": "Fired whistleblower chief Hampton Dellinger ends legal fight after ruling against him",
    "description": "A federal appeals court panel said Trump could fire Office of Special Counsel head Hampton Dellinger for now while litigation continued, but Dellinger said Wednesday that he’s ending his legal fight.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/watchdog-dellinger-ends-fight-trump-firing-supreme-court-rcna195092",
    "timestamp": "2025-03-06T18:15:56Z"
  },
  {
    "title": "Trump again spreads baseless claims about Trudeau, Canada’s election",
    "description": "US president accuses outgoing Canadian prime minister of seeking to use issue of tariffs to extend his time in office.",
    "link": "https://www.aljazeera.com/news/2025/3/6/trump-again-spreads-baseless-claims-about-trudeau-canadas-election",
    "timestamp": "2025-03-06T18:15:51Z"
  },
  {
    "title": "BARR: The Climate Control Movement In Europe Is Alive and Still Kicking",
    "description": "In his first few weeks in office, President Donald Trump has been busy bolstering the causes of energy choice and freedom for citizens of the United States.",
    "link": "https://dailycaller.com/2025/03/06/bob-barr-climate-control-movement-europe-energy/",
    "timestamp": "2025-03-06T18:15:21Z"
  },
  {
    "title": "US-Hamas Talks Complicate Gaza Truce Efforts: Analysts",
    "description": "Unprecedented direct talks between the US and Hamas are a sign of dysfunction in fraught negotiations to prolong a truce in Gaza, analysts said Thursday.",
    "link": "https://www.ibtimes.com/us-hamas-talks-complicate-gaza-truce-efforts-analysts-3765360",
    "timestamp": "2025-03-06T18:15:18Z"
  },
  {
    "title": "USA's all-weather ally Israel and members of the Five Eyes to limit intelligence sharing with Donald Trump as they suspect he may leak them to Russia's Putin",
    "description": "US allies like Israel and members of the Five Eyes alliance are reconsidering the intelligence they share with Washington. They fear President Donald Trump's growing relationship with Russian President Vladimir Putin. Concerns are rising about potential leaks…",
    "link": "https://economictimes.indiatimes.com/news/international/us/usas-all-weather-ally-israel-and-members-of-the-five-eyes-to-limit-intelligence-sharing-with-donald-trump-as-they-suspect-he-may-leak-them-to-russias-putin/articleshow/118767121.cms",
    "timestamp": "2025-03-06T18:15:15Z"
  },
  {
    "title": "Ten House Democrats Vote with GOP to Censure Rep. Al Green",
    "description": "Before Speaker Mike Johnson read the censure resolution, Democrats started singing, \"We shall overcome.\"\nThe post Ten House Democrats Vote with GOP to Censure Rep. Al Green first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/ten-house-democrats-vote-with-gop-to-censure-rep-al-green/",
    "timestamp": "2025-03-06T18:15:09Z"
  },
  {
    "title": "Official who safeguards whistleblowers drops lawsuit protesting his firing by Trump",
    "description": "An appeals court had allowed the Trump administration to remove Special Counsel Hampton Dellinger while it heard his case.",
    "link": "https://www.govexec.com/management/2025/03/official-who-safeguards-whistleblowers-drops-lawsuit-protesting-trumps-firing-him/403521/",
    "timestamp": "2025-03-06T18:14:00Z"
  },
  {
    "title": "DOJ drops Biden-era lawsuit that tried to force abortion on doctors",
    "description": "But activist Clinton judge quickly jumps into fray",
    "link": "https://www.wnd.com/2025/03/doj-drops-biden-era-lawsuit-that-tried-to-force-abortion-on-doctors/",
    "timestamp": "2025-03-06T18:14:00Z"
  },
  {
    "title": "Trudeau says trade war between Canada and U.S. expected for the ‘foreseeable future’",
    "description": "Prime Minister Justin Trudeau said Thursday he welcomed indications that the U.S. would delay substantial tariffs on Canadian products for a month, but said Canada’s plan to impose retaliatory tariffs would remain in place for now.",
    "link": "https://www.pbs.org/newshour/economy/trudeau-says-trade-war-between-canada-and-u-s-expected-for-the-foreseeable-future",
    "timestamp": "2025-03-06T18:13:40Z"
  },
  {
    "title": "‘Fascism gunna win bro’: Liberals ashamed by House Democrats new ‘Choose Your Fighter’ meme",
    "description": "The Democratic Party continues to respond to President Donald Trump's chaotic rule with pointless and cringeworthy memes, causing many left-leaning Americans to express hopelessness for the country's future.\n\n\nThe situation reached a fever pitch this week whe…",
    "link": "https://www.dailydot.com/debug/choose-your-fighter-democrat-memes-backlash/",
    "timestamp": "2025-03-06T18:12:54Z"
  },
  {
    "title": "US-Hamas talks complicate Gaza truce efforts: analysts",
    "description": "Unprecedented direct talks between the US and Hamas are a sign of dysfunction in fraught negotiations to prolong a truce in Gaza, analysts said Thursday. Washington revealed it held talks with Hamas, which it designates as a “terrorist” organisation, amid a s…",
    "link": "https://www.digitaljournal.com/world/us-hamas-talks-complicate-gaza-truce-efforts-analysts/article",
    "timestamp": "2025-03-06T18:12:21Z"
  },
  {
    "title": "Ukraine's former army chief says US 'destroying' world order",
    "description": "The popular general spoke as President Volodymyr Zelensky sought to mend fences with Washington after a fiery White House row with President Donald Trump.",
    "link": "https://www.jpost.com/international/article-845052",
    "timestamp": "2025-03-06T18:12:20Z"
  },
  {
    "title": "Veterans say they feel betrayed after firing from federal jobs, including some who voted for Trump",
    "description": "Hooven and other veterans also say they're particularly angered by how they were fired: in an email that cited inadequate job performance — despite receiving positive reviews while they were working.",
    "link": "https://www.pbs.org/newshour/politics/veterans-say-they-feel-betrayed-after-firing-from-federal-jobs-including-some-who-voted-for-trump",
    "timestamp": "2025-03-06T18:12:02Z"
  },
  {
    "title": "Trump delays 25% tariffs on most imports from Mexico until April",
    "description": "No change was announced regarding the new tariffs imposed on Canada.",
    "link": "https://www.thejournal.ie/trump-delays-25-tariffs-on-most-imports-from-mexico-until-april-6641885-Mar2025/",
    "timestamp": "2025-03-06T18:11:13Z"
  },
  {
    "title": "Ukraine's former army chief says US 'destroying' world order",
    "description": "LONDON (Reuters) - Valeriy Zaluzhnyi, Ukraine's former armed forces chief and current ambassador to Britain, said on Thursday that the United States was \"destroying\" the current world order. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/07/ukraine039s-former-army-chief-says-us-039destroying039-world-order",
    "timestamp": "2025-03-06T18:11:00Z"
  },
  {
    "title": "The Specter of American Oligarchy",
    "description": "Generations of Americans have questioned the role of the wealthy few who govern the many.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/america-oligarchy-elon-musk-tech-trump/681942/",
    "timestamp": "2025-03-06T18:11:00Z"
  },
  {
    "title": "RFK Jr. Spotlights Vitamin to Fight Rapidly Spreading Measles — But Experts Say Not So Fast",
    "description": "As measles cases continue to emerge in several U.S. states, treatment and prevention are top of mind. As most infected individuals have been unvaccinated, school-aged children, U.S. health agencies have stressed the importance of receiving two doses of the me…",
    "link": "https://freerepublic.com/focus/f-news/4302560/posts",
    "timestamp": "2025-03-06T18:10:59Z"
  },
  {
    "title": "Trump and Musk’s Plan to Destroy Social Security Started Tuesday Night - NewsBreak",
    "description": "Tuesday night, Donald Trump stood before the nation and, with the full backing of billionaires like Elon Musk, laid the groundwork for the biggest heist i",
    "link": "https://www.newsbreak.com/share/3843406801795-trump-and-musk-s-plan-to-destroy-social-security-started-tuesday-night?s=a7&share_destination_id=NDcxMTk4NzMtMTc0MTI4NDQ4NDk4Ng%3D%3D&pd=03Bi1xdN&hl=en_US&send_time=1741284484&actBtn=full_article_bottom&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-control%2Cns_foryou_model_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v16%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_blend_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v8",
    "timestamp": "2025-03-06T18:10:56Z"
  },
  {
    "title": "European Self-Reliance: Behind the Curve, but Ready To Step Up",
    "description": "Western European countries are dramatically waking up to the new geopolitical reality: Russia is on the horizon, America is cutting support, and European security is solely in the hands of Europeans. The earth is shaking in Europe.  It is not just the murdero…",
    "link": "https://nationalinterest.org/blog/politics/european-self-reliance-behind-the-curve-but-ready-to-step-up/",
    "timestamp": "2025-03-06T18:09:36Z"
  },
  {
    "title": "Rachel Maddow Says Trump May ‘Cook the Books’ to Make Economy Look Better | Video",
    "description": "The MSNBC host worries the president's team may recalculate economic figures with \"special Trump numbers\"\nThe post Rachel Maddow Says Trump May ‘Cook the Books’ to Make Economy Look Better | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/rachel-maddow-trump-economy-cook-the-books-msnbc/",
    "timestamp": "2025-03-06T18:08:56Z"
  },
  {
    "title": "Trump Plans a Crypto Strategic Reserve: What to Know",
    "description": "‘Only one digital asset in the world right now meets the bar and that digital asset is Bitcoin,’ Tyler Winklevoss said.",
    "link": "https://www.theepochtimes.com/business/trump-plans-a-crypto-strategic-reserve-what-to-know-5821061",
    "timestamp": "2025-03-06T18:08:33Z"
  },
  {
    "title": "Trump Delays Tariffs on Most Imports from Mexico",
    "description": "This is the second time Trump has postponed tariffs for a month since he first unveiled the import taxes in early February.",
    "link": "https://time.com/7265281/trump-delays-tariffs-mexico/",
    "timestamp": "2025-03-06T18:08:09Z"
  },
  {
    "title": "He’s About to Co-Lead the FBI—But First, a Word From His MAGA Show Sponsors",
    "description": "On Tuesday, Dan Bongino, the newly named deputy director of the FBI continued to hold forth on his eponymous daily podcast, this time focused on defending President Donald Trump’s Oval Office attack on Ukraine’s president. But first, Bongino offered a word fr…",
    "link": "https://www.motherjones.com/politics/2025/03/dan-bongino-fbi-podcast-maga-trump-sponsors/",
    "timestamp": "2025-03-06T18:08:05Z"
  },
  {
    "title": "Democrats Launch Bizarre Musical Protest on House Floor as Rep. Al Green Is Officially Censured",
    "description": "The House of Representatives voted Thursday to censure Rep. Al Green for disrupting President Donald Trump's joint address this week.",
    "link": "https://www.westernjournal.com/democrats-launch-bizarre-musical-protest-house-floor-rep-al-green-officially-censured/",
    "timestamp": "2025-03-06T18:07:59Z"
  },
  {
    "title": "MSNBC Analyst Ties Trump Cuts to Race: It’s an ‘Attack’ On ‘Government That Used To Be Headed By a Black Man’",
    "description": "MSNBC political analyst Basil Smikle tied race into his argument against President Donald Trump's sweeping cuts to the federal government.\nThe post MSNBC Analyst Ties Trump Cuts to Race: It’s an ‘Attack’ On ‘Government That Used To Be Headed By a Black Man’ f…",
    "link": "https://www.mediaite.com/tv/msnbc-analyst-ties-trump-federal-cuts-to-race-its-an-attack-on-government-that-used-to-be-headed-by-a-black-man/",
    "timestamp": "2025-03-06T18:07:25Z"
  },
  {
    "title": "Cancer survivor DJ Daniel, who was honored by Trump, has message for Dems being ‘mean’ to president: ‘I’m on your bumper’",
    "description": "DJ Daniel, the 13-year-old brain cancer survivor honored by President Trump during his speech to a joint session of Congress this week, had some strong words for Democrats critical of Trump. “Please stop being mean to President Trump because if I see you bein…",
    "link": "https://freerepublic.com/focus/f-news/4302559/posts",
    "timestamp": "2025-03-06T18:07:18Z"
  },
  {
    "title": "Hamas Accuses Israel Over Bodies as Trump Brands Group 'Sick and Twisted'",
    "description": "A Hamas official shared with Newsweek data indicating that Israel was in the possession of hundreds of Palestinian bodies.",
    "link": "https://www.newsweek.com/hamas-accuses-israel-bodies-trump-2040696",
    "timestamp": "2025-03-06T18:07:14Z"
  },
  {
    "title": "Speaker Johnson says censure of Rep. Al Green for Trump disruptions is a 'sad day' for Congress",
    "description": "House Republicans and Democrats voted to censure Rep. Al Green, D-Texas, on Thursday for disrupting President Trump's joint address to Congress.",
    "link": "https://www.foxnews.com/media/speaker-johnson-says-censure-rep-al-green-trump-disruptions-sad-day-congress",
    "timestamp": "2025-03-06T18:07:05Z"
  },
  {
    "title": "George Floyd's Brother Fires Back at Musk, Shapiro Over Chauvin Pardon Idea",
    "description": "Shapiro has launched a petition urging Trump to grant a pardon to Chauvin, saying the former officer was \"unjustly convicted.\"",
    "link": "https://www.newsweek.com/george-floyds-brother-fires-back-musk-shapiro-over-chauvin-pardon-idea-2040777",
    "timestamp": "2025-03-06T18:06:59Z"
  },
  {
    "title": "Will Donald Trump Deport Ukrainian Refugees? What We Know",
    "description": "Experts told Newsweek that revoking of humanitarian parole status would be unprecedented.",
    "link": "https://biztoc.com/x/0117f4a49eff1dc3",
    "timestamp": "2025-03-06T18:05:33Z"
  },
  {
    "title": "Ethics watchdog fired by Trump drops lawsuit challenging dismissal",
    "description": null,
    "link": "https://www.cnbc.com/2025/03/06/ethics-watchdog-fired-by-trump-drops-lawsuit-challenging-dismissal.html",
    "timestamp": "2025-03-06T18:05:15Z"
  },
  {
    "title": "Ontario's Contract with Starlink is Canceled, Even if US Tariffs are Lifted",
    "description": "It's unclear what will happen to rural customers in Ontario with one less option for internet service.",
    "link": "https://www.cnet.com/home/internet/ontarios-contract-with-starlink-is-canceled-even-if-us-tariffs-are-lifted/",
    "timestamp": "2025-03-06T18:05:02Z"
  },
  {
    "title": "29 Years Ago, Charlotte Had A Freakout Over A Play, And The City’s Arts Scene Still Hasn’t Recovered",
    "description": "The play was Tony Kushner’s Angels in America, produced in 1996 by the Charlotte Repertory Theatre. Here’s the story of the fight about it started by a fundamentalist minister, the legal mechanism used to shut the play down, and the decades-long aftereffects …",
    "link": "https://www.charlottemagazine.com/decades-ago-one-production-erupted-charlotte-into-controversy-our-arts-scene-still-hasnt-escaped-it/",
    "timestamp": "2025-03-06T18:04:00Z"
  },
  {
    "title": "Bitcoin, ETH, XRP, SOL, ADA charts versus US crypto reserve rumors — Which to trade?",
    "description": "Bitcoin and the altcoins selected for the US crypto strategic reserve could stay range-bound in the short term, barring a blockbuster announcement on March 7.",
    "link": "https://cointelegraph.com/news/bitcoin-eth-xrp-sol-ada-charts-versus-us-crypto-reserve-rumors-which-to-trade",
    "timestamp": "2025-03-06T18:02:25Z"
  },
  {
    "title": "Bill Belichick's girlfriend, Jordon Hudson, praises Trump in social media post",
    "description": "Jordon Hudson, Bill Belichick's girlfriend, took to social media to celebrate the \"wonderful news\" that the Maine Sea Grant was being reinstated, saying that \"Trump Loves Fisherman.\"",
    "link": "https://www.foxnews.com/sports/bill-belichicks-girlfriend-jordon-hudson-praises-trump-social-media-post",
    "timestamp": "2025-03-06T18:01:22Z"
  },
  {
    "title": "Social Security Workers Aren't Allowed to Read This Story",
    "description": "New internet restrictions at the embattled SSA have cut off access to WIRED, along with other “general news” websites like The Washington Post and The New York Times.",
    "link": "https://www.wired.com/story/social-security-workers-arent-allowed-to-read-this-story/",
    "timestamp": "2025-03-06T18:01:16Z"
  },
  {
    "title": "Veterans are being hit hard by Trump administration firings | CNN Politics",
    "description": "When the Department of Government Efficiency swings an axe, it’s bound to hit a veteran who voted for President Donald Trump.",
    "link": "https://www.cnn.com/2025/03/06/politics/veterans-hit-hard-trump-administration-firings/index.html",
    "timestamp": "2025-03-06T18:01:11Z"
  },
  {
    "title": "'Trump is an antisemite, Israel bores him': An interview with biographer Michael Wolff",
    "description": "Journalist Michael Wolff, author of  'All or Nothing: How Trump Recaptured America,' explains why Trump believes the October 7 attacks wouldn't have happened if he were in power, and why the president thinks 'it's all Netanyahu's fault!'",
    "link": "https://www.haaretz.com/israel-news/2025-03-06/ty-article-magazine/.premium/trump-is-an-antisemite-israel-bores-him-an-interview-with-biographer-michael-wolff/00000195-6b76-d7b0-af95-ef7f79b50000",
    "timestamp": "2025-03-06T18:01:05Z"
  },
  {
    "title": "European rocket successfully carries out first commercial mission",
    "description": "Europe's new rocket Ariane 6 successfully carried out its first commercial mission on Thursday, placing a French military satellite into orbit and confirming the continent's independent access to space. A successful Ariane 6 launch was \"an important step for …",
    "link": "https://economictimes.indiatimes.com/news/science/european-rocket-successfully-carries-out-first-commercial-mission/articleshow/118767566.cms",
    "timestamp": "2025-03-06T18:00:29Z"
  },
  {
    "title": "Is Israel About to Finish the Job Against Hamas?",
    "description": "When President Donald Trump returned to the White House on January 20, 2025, weapons shipments previously halted by the Biden State Department to the Israeli government were sent out the door - including 2000 pound bombs. \"The U.S. authorized the release of 2…",
    "link": "https://freerepublic.com/focus/f-chat/4302557/posts",
    "timestamp": "2025-03-06T18:00:28Z"
  },
  {
    "title": "Washington Post columnist mocks Dem protests at Trump speech, calls out pink outfits and paddle props",
    "description": "A Washington Post column trashed the Democratic Party's method of protesting President Trump's address to Congress, asking if it proves the party has \"nothing left to try.\"",
    "link": "https://www.foxnews.com/media/washington-post-columnist-mocks-dem-protests-trump-speech-calls-out-pink-outfits-paddle-props",
    "timestamp": "2025-03-06T18:00:23Z"
  },
  {
    "title": "EU leaders meet for emergency summit on defense and Ukraine aid amid waning US support",
    "description": "“Spend, spend, spend on defense and deterrence. That’s the most important message.”",
    "link": "https://www.bostonherald.com/2025/03/06/europe-defense-emergency-summit/",
    "timestamp": "2025-03-06T18:00:10Z"
  },
  {
    "title": "Democrats Embarrass Themselves With All-Female ‘Choose Your Fighter’ Video",
    "description": "Democrats never learn. This is how you keep Republicans in power.\nThe post Democrats Embarrass Themselves With All-Female ‘Choose Your Fighter’ Video first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/democrats-embarrass-themselves-with-all-female-choose-your-fighter-video/",
    "timestamp": "2025-03-06T18:00:00Z"
  },
  {
    "title": "Trump Temporarily Lifts Mexico Tariffs",
    "description": "State of the Union: The tariff exemption will remain in place until April 2.\nThe post Trump Temporarily Lifts Mexico Tariffs appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-temporarily-lifts-mexico-tariffs/",
    "timestamp": "2025-03-06T18:00:00Z"
  },
  {
    "title": "Hulu’s ‘Deli Boys’ Bends Genres With Comedy, Crime and Conviction | Digital Cover",
    "description": "Asif Ali, Saagar Shaikh and Poorna Jagannathan tell TheWrap about crafting an \"un-model minority\" story and flipping tropes of South Asians on their head\nThe post Hulu’s ‘Deli Boys’ Bends Genres With Comedy, Crime and Conviction | Digital Cover appeared first…",
    "link": "https://www.thewrap.com/hulu-deli-boys-interview-asif-ali-saagar-shaikh-poorna-jagannathan/",
    "timestamp": "2025-03-06T18:00:00Z"
  },
  {
    "title": "Trump is postponing his tariffs on Mexico for one month, citing 'respect' for its president",
    "description": "President Donald Trump on Thursday said his 25% tariffs on Mexican imports would be temporarily frozen for one month for most goods. For now, his tariffs on Canadian goods are still in full effect. Read more...",
    "link": "https://qz.com/trump-tariffs-mexico-suspend-sheinbaum-canada-trudeau-1851768076",
    "timestamp": "2025-03-06T18:00:00Z"
  },
  {
    "title": "Nine students arrested at Barnard during pro-Palestine sit in",
    "description": "Nine students were arrested after Barnard College called police onto campus to break up a sit-in staged by pro-Palestine demonstrators over the recent expulsion of three student protesters.",
    "link": "https://mondoweiss.net/2025/03/nine-students-arrested-at-barnard-during-pro-palestine-sit-in/",
    "timestamp": "2025-03-06T17:59:18Z"
  },
  {
    "title": "Why automakers’ short reprieve from tariffs isn’t enough to weather Trump’s escalating trade war",
    "description": "It is unclear if Trump will reverse his policy again.",
    "link": "https://www.bostonherald.com/2025/03/06/carmakers-tariffs-explainer/",
    "timestamp": "2025-03-06T17:58:43Z"
  },
  {
    "title": "Why automakers' short reprieve from tariffs isn't enough to weather Trump's escalating trade war",
    "description": "President Donald Trump granted U.S. automakers a short reprieve from stiff new tariffs on imports from Mexico and Canada this week",
    "link": "https://abcnews.go.com/US/wireStory/automakers-short-reprieve-tariffs-weather-trumps-escalating-trade-119517246",
    "timestamp": "2025-03-06T17:58:41Z"
  },
  {
    "title": "Trump's Presidency Reminds Me of the Segregation and Jim Crow of My Youth",
    "description": "Douglas H. White\n\n\n\nThe xenophobic, bigoted, and cruel policies of the Trump administration are bringing back traumatic memories of American racism and all the nightmares that went with it.\r\n\n\r\n\n\nThe post Trump's Presidency Reminds Me of the Segregation and J…",
    "link": "https://www.thenation.com/article/politics/trump-jim-crow-racism/",
    "timestamp": "2025-03-06T17:58:41Z"
  },
  {
    "title": "Apple co-founder says Elon Musk is taking a ‘sledgehammer’ to government agencies",
    "description": "Steve Wozniak, the co-founder of Apple, is criticizing Elon Musk’s Department of Government Efficiency (DOGE). Wozniak spoke to CNBC and said that Musk’s approach is like taking a “sledgehammer” to government agencies after the department implemented mass fir…",
    "link": "https://mobilesyrup.com/2025/03/06/apple-steve-wozniak-says-musk-sledgehammer-government-agencies/",
    "timestamp": "2025-03-06T17:56:23Z"
  },
  {
    "title": "European shares close flat after ECB rate cut boosts bank stocks",
    "description": "Tariff uncertainty lingered, while chip stocks declined on Wall Street",
    "link": "https://www.irishtimes.com/business/2025/03/06/european-shares-close-flat-after-ecb-rate-cut-boosts-bank-stocks/",
    "timestamp": "2025-03-06T17:56:20Z"
  },
  {
    "title": "‘The View’ Co-Hosts Spend Four Minutes Trying To Decide If They Could Be Friends With Trump Supporters",
    "description": "\"The View\" co-hosts spent an entire segment Thursday trying to decide whether they can be friends with supporters of President Donald Trump.",
    "link": "https://dailycaller.com/2025/03/06/the-view-co-hosts-spend-four-minutes-trying-to-decide-if-they-could-be-friends-with-trump-supporters/",
    "timestamp": "2025-03-06T17:56:04Z"
  },
  {
    "title": "Trump’s Gaza development plans worth ‘a closer look’, says Germany’s commissioner against anti-Semitism",
    "description": "Commissioner Felix Klein said ‘any proposal that can help alleviate the suffering in Gaza should be seriously discussed’",
    "link": "https://www.irishtimes.com/world/europe/2025/03/06/trumps-gaza-development-plans-worth-a-closer-look-says-germanys-commissioner-against-anti-semitism/",
    "timestamp": "2025-03-06T17:55:41Z"
  },
  {
    "title": "Ontario putting 25% surcharge on U.S.-bound electricity Monday, Ford says",
    "description": "Ontario Premier Doug Ford says starting Monday, the province will charge 25 per cent more for electricity shipped to 1.5 million Americans in response to U.S. President Donald Trump's tariffs.",
    "link": "https://www.cbc.ca/news/canada/toronto/ontario-electricity-surcharge-us-tariffs-ford-1.7476515",
    "timestamp": "2025-03-06T17:55:28Z"
  },
  {
    "title": "Why automakers' short reprieve from tariffs isn't enough to weather Trump's escalating trade war",
    "description": "President Donald Trump's short reprieve for U.S. automakers from stiff tariffs on imports from Mexico and Canada isn't likely to allow enough time for those companies to make the changes necessary to minimize the damage from Trump's intensifying trade war.\nTr…",
    "link": "https://biztoc.com/x/96d80558198cc2eb",
    "timestamp": "2025-03-06T17:55:10Z"
  },
  {
    "title": "‘Hamilton’ Musical Tells Kennedy Center Kick Rocks After Donald Trump’s Hostile Takeover, MAGA Loyalists Are BIG MAD",
    "description": "Lin-Manuel Miranda and his play 'Hamilton,' tells Donald Trump's Kennedy Center to kick rocks following MAGA takeover. X reacts.",
    "link": "https://hiphopwired.com/playlist/hamilton-cancels-shows-donald-trump-kennedy-center-takeover-reactions/",
    "timestamp": "2025-03-06T17:54:17Z"
  },
  {
    "title": "Here's Yet Another Reminder Of Elon Musk's Outrageous Conflicts Of Interest",
    "description": "OSHA's citations against Tesla help illustrate why Elon Musk's position atop the government-cutting DOGE is so dangerous.",
    "link": "https://www.huffpost.com/entry/tesla-osha-death-musk_n_67c9d045e4b0404dff2ff1a8",
    "timestamp": "2025-03-06T17:53:41Z"
  },
  {
    "title": "Republican Campaign Arm Calls Democratic Lawmaker “Illegal Immigrant”",
    "description": "The Republican Party isn’t even pretending not to be racist now. \r\nThe National Republican Congressional Committee published an atrocious social media post Wednesday calling Hispanic Caucus Chair Adriano Espaillat an “illegal immigrant,” after the New York De…",
    "link": "https://newrepublic.com/post/192432/republican-campaign-democrat-espaillat-illegal-immigrant",
    "timestamp": "2025-03-06T17:53:21Z"
  },
  {
    "title": "CNBC Host Busts Out Laughing As Trump Sec. Lutnick Gets Peppered By Co-Host",
    "description": "David Faber busted out laughing when co-host Sara Eisen peppered Howard Lutnick over his claim that overseas manufacturers will come back to the United States.\nThe post CNBC Host Busts Out Laughing As Trump Sec. Lutnick Gets Peppered By Co-Host first appeared…",
    "link": "https://www.mediaite.com/news/cnbc-host-busts-out-laughing-as-trump-sec-lutnick-gets-peppered-by-co-host/",
    "timestamp": "2025-03-06T17:53:17Z"
  },
  {
    "title": "These will be the car brands most affected by Trump’s tariffs",
    "description": "Trump's tariffs, which take effect in April, will increase vehicle costs, forcing automakers to adjust production chains",
    "link": "https://www.merca20.com/these-will-be-the-car-brands-most-affected-by-trumps-tariffs/",
    "timestamp": "2025-03-06T17:53:09Z"
  },
  {
    "title": "Andy Ogles Proposes Expelling Disruptive Democrats from Committees over 'Juvenile Stunts' During Al Green Censure Vote",
    "description": "Rep. Andy Ogles said he would introduce resolutions to expel several Democrats from their committees for their violations of decorum.\nThe post Andy Ogles Proposes Expelling Disruptive Democrats from Committees over ‘Juvenile Stunts’ During Al Green Censure Vo…",
    "link": "https://www.breitbart.com/politics/2025/03/06/andy-ogles-proposes-expelling-disruptive-democrats-from-committees-over-juvenile-stunts-during-al-green-censure-vote/",
    "timestamp": "2025-03-06T17:52:09Z"
  },
  {
    "title": "Elon Musk ‘Elated’ to Learn Congress Might Rubber-Stamp His Cuts",
    "description": "Elon Musk was reportedly ‘elated’ to learn Congress might rubber-stamp his cuts. The rescissions process could let Congress regularize DOGE cuts, but it could produce another dangerous moment for House Republicans.",
    "link": "http://nymag.com/intelligencer/article/elon-musk-congress-recissions.html",
    "timestamp": "2025-03-06T17:51:33Z"
  },
  {
    "title": "Pras Pushing for Trump Pardon, Wants Tory Lanez Free Too",
    "description": "Even though Pras was found guilty in his federal fraud case ... he's holding out hope his boy Donald Trump will come through with a pardon!!! TMZ Hip Hop caught up with the Fugees rapper on a (rare) rainy day in L.A. this week and he tells us it's…\n Permalink",
    "link": "https://www.tmz.com/2025/03/06/pras-wants-pardon-from-president-trump/",
    "timestamp": "2025-03-06T17:51:26Z"
  },
  {
    "title": "US Treasury's Bessent says FSOC will drive regulatory change, outlines tariff policies",
    "description": "NEW YORK (Reuters) -U.S. Treasury Secretary Scott Bessent on Thursday laid out the Trump administration's ambitions to reshape international trade relations ...",
    "link": "https://ca.finance.yahoo.com/news/us-treasurys-bessent-says-fsoc-175027894.html",
    "timestamp": "2025-03-06T17:50:27Z"
  },
  {
    "title": "Trump’s NIH Pick Advised South African Group That Claimed There Was No Covid Pandemic",
    "description": "Jay Bhattacharya, the Stanford professor of medicine and economics who President Donald Trump has tapped to lead the National Institutes of Health, became prominent during the Covid pandemic as a contrarian. He was a fierce foe of the restrictive measures adv…",
    "link": "https://www.motherjones.com/politics/2025/03/trump-nih-jay-bhattacharya-covid-south-africa-nick-hudson-panda/",
    "timestamp": "2025-03-06T17:50:20Z"
  },
  {
    "title": "Trump pauses Mexican tariffs for another month, no word on Canada",
    "description": "In a social media post, Trump says he made the decision after speaking with Mexican President Claudia Sheinbaum today, adding Mexico has worked with the U.S. on border security.",
    "link": "https://www.nationalobserver.com/2025/03/06/news/trump-pause-mexican-tariffs-month-canada",
    "timestamp": "2025-03-06T17:50:11Z"
  },
  {
    "title": "Trump exempts Mexico goods from tariffs for a month, but doesn't mention Canada",
    "description": "U.S. President Donald Trump on Thursday said Mexico won't be required to pay tariffs on any goods that fall under the United States-Mexico-Canada Agreement on trade until April 2, but made no mention of a reprieve for Canada despite his Commerce secretary say…",
    "link": "https://freerepublic.com/focus/f-news/4302554/posts",
    "timestamp": "2025-03-06T17:50:03Z"
  },
  {
    "title": "Musk Funds Group Behind Deceptive Ads in Critical Wisconsin Supreme Court Race",
    "description": "The ads include misinformation that is aimed at dissuading undecided voters from choosing the liberal candidate.",
    "link": "https://truthout.org/articles/musk-funds-group-behind-deceptive-ads-in-critical-wisconsin-supreme-court-race/",
    "timestamp": "2025-03-06T17:50:02Z"
  },
  {
    "title": "Solana DEX volumes still rival Ethereum’s despite memecoin meltdown: VanEck",
    "description": "Despite declining memecoin trading volumes, Solana’s DEX volumes still rival those of the entire Ethereum (ETH) ecosystem.",
    "link": "https://cointelegraph.com/news/solana-dex-volumes-still-rival-ethereum-s-despite-memecoin-meltdown-van-eck",
    "timestamp": "2025-03-06T17:50:00Z"
  },
  {
    "title": "Gavin Newsom’s MAGA Drift Is Here",
    "description": "As Donald Trump wages an all-out war on just about every corner of American life, Democrats have appeared nothing short of comatose. Their struggle to respond, which has since seen pink attire and auctioneer-styled signs, has instead revealed a party relying …",
    "link": "https://www.motherjones.com/politics/2025/03/gavin-newsoms-maga-drift-is-here/",
    "timestamp": "2025-03-06T17:49:02Z"
  },
  {
    "title": "SCOOP: Dems who derailed Al Green censure could be stripped of House committee roles",
    "description": "Rep. Andy Ogles said he intends to force a vote on a resolution to strip Democrats who derailed House floor proceedings from their committees.",
    "link": "https://www.foxnews.com/politics/scoop-dems-who-derailed-al-green-censure-could-stripped-house-committee-roles",
    "timestamp": "2025-03-06T17:48:45Z"
  },
  {
    "title": "JOHN DOLMAYAN Praises DONALD TRUMP For \"Bringing A Little Sanity Back\"",
    "description": "We're living in the same country, right John?\nThe post JOHN DOLMAYAN Praises DONALD TRUMP For \"Bringing A Little Sanity Back\" appeared first on Metal Injection.",
    "link": "https://metalinjection.net/news/john-dolmayan-praises-donald-trump-for-bringing-a-little-sanity-back",
    "timestamp": "2025-03-06T17:48:37Z"
  },
  {
    "title": "For tribal communities, federal cuts decimate core programs",
    "description": "The federal government’s unique role in supporting tribal services is not an act of generosity.",
    "link": "https://www.bostonherald.com/2025/03/06/federal-cuts-tribal-programs/",
    "timestamp": "2025-03-06T17:47:53Z"
  },
  {
    "title": "U.S. retailers publicly scrap some 'DEI' initiatives while quietly supporting others",
    "description": "Several U.S. retailers that publicly scrapped diversity, equity and inclusion programs — including Target, Amazon and Tractor Supply — are maintaining certain efforts behind the scenes.",
    "link": "https://www.nbcnews.com/news/nbcblk/us-retailers-publicly-scrap-dei-initiatives-quietly-supporting-others-rcna195121",
    "timestamp": "2025-03-06T17:45:41Z"
  },
  {
    "title": "Weekly quiz: Anora cleaned up but who left the Oscars empty-handed?",
    "description": "How much attention did you pay to what has been going on in the world over the past seven days?",
    "link": "https://www.bbc.com/news/articles/cvgwv419ewmo",
    "timestamp": "2025-03-06T17:45:38Z"
  },
  {
    "title": "Trump backs off Mexico tariffs while Canada tensions simmer",
    "description": "<p>WASHINGTON - US President Donald Trump said Thursday that he was pausing sweeping tariffs recently imposed on Mexican imports after talks with Mexican President Claudia Sheinbaum, while tensions with Canada continued to simmer amid strong blowback on world…",
    "link": "https://www.bangkokpost.com/world/2974575/trump-backs-off-mexico-tariffs-while-canada-tensions-simmer",
    "timestamp": "2025-03-06T17:45:00Z"
  },
  {
    "title": "The Crucial, Imminent Election That You Probably Haven't Heard Much About",
    "description": "In 2024, the battleground state of Wisconsin was carried by Donald Trump over Kamala Harris, with the Republican winning by less than one percentage point. The US Senate race went the other way, with Democratic incumbent Tammy Baldwin squeaking through, also …",
    "link": "https://freerepublic.com/focus/f-news/4302551/posts",
    "timestamp": "2025-03-06T17:44:11Z"
  },
  {
    "title": "Bernie Sanders Issues Warning About Elon Musk's Plans for AI: \"You Will Be Out on the Street\"",
    "description": "For years now, experts have been warning that AI automation could soon lead to mass unemployment. And given plenty of early warning signs, their concerns are likely not unwarranted, with tech giants investing heavily in the tech, while simultaneously laying o…",
    "link": "https://futurism.com/bernie-sanders-issues-warning-about-elon-musks-plans-for-ai-you-will-be-out-on-the-street",
    "timestamp": "2025-03-06T17:43:55Z"
  },
  {
    "title": "Why Are We Surprised by the Trump-Putin Alliance?",
    "description": "MAGA’s ideology aligns more closely with authoritarianism than liberal democracy.",
    "link": "https://foreignpolicy.com/2025/03/06/trump-putin-russia-maga-authoritarianism-liberal-democracy-west-ukraine/",
    "timestamp": "2025-03-06T17:43:46Z"
  },
  {
    "title": "Mortgage rates fell again this week to another 2025 low",
    "description": "Homebuyers are getting more relief from high mortgage rates, but not for reasons anyone would hope for.\nThe average 30-year mortgage rate fell to 6.63% for the week through Wednesday, from 6.76% a week earlier, according to Freddie Mac data. The latest drop c…",
    "link": "https://biztoc.com/x/ace1939bfd07ebfe",
    "timestamp": "2025-03-06T17:43:33Z"
  },
  {
    "title": "Sheinbaum vows Mexico, US will keep collaborating",
    "description": "Mexican President Claudia Sheinbaum said on Thursday that she held a respectful and productive call with US President Donald Trump, emphasizing both parties are committed to continued collaboration. S...",
    "link": "https://biztoc.com/x/a545cbd395c188f3",
    "timestamp": "2025-03-06T17:43:22Z"
  },
  {
    "title": "Trump’s VA secretary defends 80,000 layoffs in a wildly unpersuasive way",
    "description": "Defending 80,000 layoffs, Veterans Affairs Secretary Doug Collins said, “The federal government does not exist to employ people.” He’s badly missing the point.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-va-secretary-defends-80000-layoffs-wildly-unpersuasive-way-rcna195145",
    "timestamp": "2025-03-06T17:42:38Z"
  },
  {
    "title": "FBI committed to bringing home American hostages held in foreign countries, director says",
    "description": "FBI Director Kash Patel says the bureau will work to “zero out” the population of Americans detained or held hostage in foreign countries",
    "link": "https://abcnews.go.com/US/wireStory/fbi-committed-bringing-home-american-hostages-held-foreign-119517090",
    "timestamp": "2025-03-06T17:42:24Z"
  },
  {
    "title": "'The Executive Put Itself Above Congress': Trump’s Funding Freeze Blocked By Judge",
    "description": "The judge’s ruling, though preliminary, includes a sharp rebuke to Trump’s attempt to seize power traditionally held by other branches of government.",
    "link": "https://www.huffpost.com/entry/donald-trump-funding-freeze-omb_n_67c9d099e4b0404dff2ff1b4",
    "timestamp": "2025-03-06T17:41:54Z"
  },
  {
    "title": "Major Garrett Hammers Trump Over ‘Spat’ With the Associated Press: ‘It Makes Him Look Weak’",
    "description": "During Trump’s Wednesday night address he declared, “I’ve stopped all government censorship and brought back free speech in America.”\nThe post Major Garrett Hammers Trump Over ‘Spat’ With the Associated Press: ‘It Makes Him Look Weak’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/politics/major-garrett-hammers-trump-over-spat-with-the-associated-press-it-makes-him-look-weak/",
    "timestamp": "2025-03-06T17:41:18Z"
  },
  {
    "title": "Female Dems Absolutely Destroyed Over Bonkers ‘Choose Your Fighter’ Video",
    "description": "Critics have quickly pounced on a group of female House Democrats on Thursday over a bizarre, video game-inspired TikTok clip.\nThe post Female Dems Absolutely Destroyed Over Bonkers ‘Choose Your Fighter’ Video first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/female-dems-absolutely-destroyed-over-bonkers-choose-your-fighter-video/",
    "timestamp": "2025-03-06T17:40:45Z"
  }
]