[
  {
    "title": "Trump Spends Charlie Kirk Memorial Whining About Own Grievances",
    "description": "Charlie Kirk’s memorial was apparently just another opportunity for the president to espouse his typical talking points.The Sunday service intended to honor Kirk’s legacy featured his family, friends, and crucial members of the Trump administration, from Vice…",
    "link": "https://newrepublic.com/post/200738/donald-trump-charlie-kirk-memorial-whining-grievances",
    "timestamp": "2025-09-22T14:45:49Z"
  },
  {
    "title": "After forcing out disobedient prosecutor, Trump’s new nominee makes matters worse",
    "description": "Donald Trump forced out Erik Siebert for failing to prosecute one of his political enemies. The president’s new nominee makes the burgeoning scandal even worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/forcing-disobedient-prosecutor-trumps-new-nominee-makes-matters-worse-rcna232922",
    "timestamp": "2025-09-22T14:42:06Z"
  },
  {
    "title": "Jonathan Turley Says Alleged Would-Be Trump Assassin Has Just 1 Hail Mary Left In His Playbook",
    "description": "GWU law professor Jonathan Turley said Monday that the “only hope” an alleged would-be assassin of President Donald Trump has could be to take the stand.",
    "link": "https://dailycaller.com/2025/09/22/jonathan-turley-alleged-would-be-trump-assassin-1-hail-mary-left/",
    "timestamp": "2025-09-22T14:41:43Z"
  },
  {
    "title": "Angelina Jolie: This Country is a DISASTER!",
    "description": "Reading Time: 3 minutesAngelina Jolie says she loves America. But she's also aghast over what has happened to her country of late.\nAngelina Jolie: This Country is a DISASTER! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/angelina-jolie-this-country-is-a-disaster/",
    "timestamp": "2025-09-22T14:41:20Z"
  },
  {
    "title": "Donald Trump’s Corruption of the Law Is Destroying American Democracy",
    "description": "Jeet Heer\n\n\n\nIf Democrats don’t fight this with everything they have, they are basically admitting that authoritarianism is here to stay.\r\n\n\r\n\n\nThe post Donald Trump’s Corruption of the Law Is Destroying American Democracy appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/donald-trump-corruption-thomas-homan/",
    "timestamp": "2025-09-22T14:40:37Z"
  },
  {
    "title": "Philadelphia Drag Queen Now Delivering Anti-Trump Telegrams – And Wawa",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/09/22/philadelphia-drag-queen-trump-wawa/",
    "timestamp": "2025-09-22T14:39:21Z"
  },
  {
    "title": "Majority Of Americans Think UN Isn’t Doing A Good Job Just Ahead Of Meeting, Poll Says",
    "description": "The majority of voters believe the United Nations (UN) is not doing a good job, according to a Gallup poll released late Sunday.",
    "link": "https://dailycaller.com/2025/09/22/voters-united-nations-gallup-poll/",
    "timestamp": "2025-09-22T14:39:20Z"
  },
  {
    "title": "Ukrainian refugee's train stabbing death becomes early flashpoint in 2026 North Carolina Senate race",
    "description": "The stabbing death of a Ukrainian refugee on a North Carolina commuter train has become an early flashpoint in what will be a lengthy and expensive U.S. Senate campaign",
    "link": "https://abcnews.go.com/Politics/wireStory/ukrainian-refugees-train-stabbing-death-early-flashpoint-2026-125813210",
    "timestamp": "2025-09-22T14:38:16Z"
  },
  {
    "title": "Ghislaine Maxwell goes for stroll at new minimum-security prison as former townhouse hits market",
    "description": "Jeffrey Epstein associate Ghislaine Maxwell continues serving her prison sentence in Texas as her former Manhattan townhouse goes on the market for $18 million.",
    "link": "https://www.foxnews.com/us/ghislaine-maxwell-goes-stroll-new-minimum-security-prison-former-townhouse-hits-market",
    "timestamp": "2025-09-22T14:36:01Z"
  },
  {
    "title": "Autism and Tylenol: What to know ahead of White House announcement",
    "description": "The autism announcement today comes after Robert F. Kennedy Jr. pledged earlier this year that the HHS would determine the cause by September.",
    "link": "https://www.fox5dc.com/news/autism-announcement-tylenol-trump-rfk-watch-live",
    "timestamp": "2025-09-22T14:35:13Z"
  },
  {
    "title": "Trump DOJ shut bribery case against ally Homan",
    "description": "The Justice Department closed a bribery investigation into President Donald Trump’s border czar, Tom Homan",
    "link": "https://theweek.com/politics/tom-homan-trump-ally-doj-investigation",
    "timestamp": "2025-09-22T14:34:48Z"
  },
  {
    "title": "How Donald Trump is killing free speech in America – one late-night TV host at a time",
    "description": "Recent events signal a concerning trend of censorship in American late-night television, once a bastion of free speech and political satire. Corporate interests, regulatory pressures, and political sensitivities are leading to show cancellations and host susp…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/censor-suppress-suspend-how-donald-trump-is-killing-free-speech-in-america-one-late-night-tv-host-at-a-time/articleshow/124050824.cms",
    "timestamp": "2025-09-22T14:33:39Z"
  },
  {
    "title": "US public opinion on Israel is changing, US policy will have to as well",
    "description": "Unconditional US support for Israel will come to an end, but this policy shift may take years.",
    "link": "https://www.aljazeera.com/opinions/2025/9/22/us-public-opinion-on-israel-is-changing-us-policy-will-have-to-as-well",
    "timestamp": "2025-09-22T14:32:20Z"
  },
  {
    "title": "Man representing himself in alleged Trump assassination attempt plans to call just 3 witnesses",
    "description": "Seasoned prosecutors with the U.S. Attorney's Office for the Southern District of Florida rested their case Friday afternoon after spending seven days questioning 38 witnesses in an attempt to make sure Routh spends the rest of his life in prison.",
    "link": "https://www.pbs.org/newshour/politics/man-representing-himself-in-alleged-trump-assassination-attempt-plans-to-call-just-3-witnesses",
    "timestamp": "2025-09-22T14:31:56Z"
  },
  {
    "title": "Always Proud",
    "description": "Virginia Pridefest is the largest LGBTQ+ gathering in the state.",
    "link": "https://richmondmagazine.com/news/features/virginia-pridefest/",
    "timestamp": "2025-09-22T14:30:00Z"
  },
  {
    "title": "Trump Likely to Approve TikTok Takeover This Week – WSJ",
    "description": "US President Donald Trump looks set to approve the US takeover of TikTok’s operations in America this week, a new report says.\nTrump is expected to issue an executive order that says his administration is satisfied that legal requirements linked to TikTok hav…",
    "link": "https://biztoc.com/x/0dc68c21145b9648",
    "timestamp": "2025-09-22T14:29:54Z"
  },
  {
    "title": "Amid H-1B visa row, Indian woman says giving up L1 US visa was ‘best decision’. Here’s why",
    "description": "Amidst anxieties over increased US visa fees, Radhika Agarwal shares her positive experience of returning to India after giving up her L1 visa. She highlights the benefits of India's startup ecosystem, family proximity, community, and career freedom. Despite …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/amid-h-1b-visa-row-indian-woman-says-giving-up-l1-us-visa-was-best-decision-heres-why/articleshow/124051305.cms",
    "timestamp": "2025-09-22T14:27:06Z"
  },
  {
    "title": "WATCH LIVE: Day 1 of the 2025 United Nations General Assembly",
    "description": "High-level general debate at the UN General Assembly begins Tuesday, Sept. 23 at 9 a.m. EDT. Watch Day 1 live here.",
    "link": "https://www.pbs.org/newshour/world/watch-live-day-1-of-the-2025-united-nations-general-assembly",
    "timestamp": "2025-09-22T14:27:00Z"
  },
  {
    "title": "Disney could be forced to choose between Jimmy Kimmel and the NFL as massive ESPN deal looms: report",
    "description": "The Walt Disney Co. could be forced to choose between salvaging its late-night franchise or protecting a multibillion-dollar partnership with the NFL, according to a report.",
    "link": "https://nypost.com/2025/09/22/business/disney-in-crisis-over-jimmy-kimmel-suspension-as-nfl-deal-looms/",
    "timestamp": "2025-09-22T14:26:38Z"
  },
  {
    "title": "Heated Debate After Viral Claims Erika Kirk “Ended The Feminist Movement” At Charlie’s Funeral",
    "description": "“I love submitting to Charlie because he is a phenomenal leader. I want him to come home and be so unbelievably loved on,\" the Turning Point CEO said of her late husband.",
    "link": "https://www.boredpanda.com/debate-ensues-after-claim-erika-kirk-ended-feminism-during-charlie-funeral-speech/",
    "timestamp": "2025-09-22T14:26:36Z"
  },
  {
    "title": "Howard Stern Says ABC’s Jimmy Kimmel Suspension Amid Trump Pressure Is “Wrong For The Direction Of The Country”",
    "description": "Howard Stern weighed in on Jimmy Kimmel’s suspension from his ABC late night show following a threat from Donald Trump’s FCC chairman, Brendan Carr. “I don’t know what their plan is, but it looks like they might be firing [him],” Stern, referring to ABC and K…",
    "link": "http://deadline.com/2025/09/howard-stern-jimmy-kimmel-suspension-trump-1236552264/",
    "timestamp": "2025-09-22T14:24:06Z"
  },
  {
    "title": "US lawmakers visiting China seek to improve military cooperation",
    "description": "The United States wants to improve military ties with China, according to a U.S. lawmaker leading a bipartisan delegation.",
    "link": "https://www.bostonherald.com/2025/09/22/us-lawmakers-visit-china/",
    "timestamp": "2025-09-22T14:24:00Z"
  },
  {
    "title": "Make America Fertile Again: The Strange Bedfellows of the New Baby Boom Agenda",
    "description": "The pronatalist movement is selling bad policies and rigid ideas about gender. There is a better way.",
    "link": "https://reason.com/2025/09/22/make-america-fertile-again-the-strange-bedfellows-of-the-new-baby-boom-agenda/",
    "timestamp": "2025-09-22T14:23:55Z"
  },
  {
    "title": "Tucker Carlson Accused of Wild ‘Antisemitic Innuendo’ at Charlie Kirk’s Memorial Service",
    "description": "Tucker Carlson, the fired Fox News host turned internet provocateur, kicked up a firestorm of controversy over the weekend with his speech at Charlie Kirk’s memorial service.\nThe post Tucker Carlson Accused of Wild ‘Antisemitic Innuendo’ at Charlie Kirk’s Mem…",
    "link": "https://www.mediaite.com/politics/tucker-carlson-accused-of-wild-antisemitic-innuendo-at-charlie-kirks-memorial-service/",
    "timestamp": "2025-09-22T14:21:10Z"
  },
  {
    "title": "How Trump alarmed (and tried to calm) CEOs with his new $100,000 H-1B visa fee",
    "description": "It was a roller coaster weekend for businesses trying to understand how they would be impacted by President Trump's proclamation mandating a $100,000 fee on ...",
    "link": "https://finance.yahoo.com/news/how-trump-alarmed-and-tried-to-calm-ceos-with-his-new-100000-h-1b-visa-fee-142058595.html",
    "timestamp": "2025-09-22T14:20:58Z"
  },
  {
    "title": "Researchers shift tactics to tackle extremism as public health threat",
    "description": "Researchers say state governments and local communities are recognizing they’re on their own.",
    "link": "https://www.bostonherald.com/2025/09/22/extremism-public-health-threat/",
    "timestamp": "2025-09-22T14:20:35Z"
  },
  {
    "title": "Researchers shift tactics to tackle extremism as public health threat",
    "description": "Researchers say state governments and local communities are recognizing they’re on their own.",
    "link": "https://www.denverpost.com/2025/09/22/extremism-public-health-threat/",
    "timestamp": "2025-09-22T14:20:35Z"
  },
  {
    "title": "Tina Brown: King Charles is tired of ‘haughty, Hanoverian’ Prince William",
    "description": "Two weeks ago, in the middle of Prince Harry’s four-day trip to the UK, Tina Brown’s Fresh Hell Substack landed like a bomb. Brown devoted a chunk of her Substack that week to analysis of King Charles’s relationships with his two sons. According to Brown, Cha…",
    "link": "https://www.celebitchy.com/941702/tina_brown_king_charles_is_tired_of_haughty_hanoverian_prince_william/",
    "timestamp": "2025-09-22T14:20:17Z"
  },
  {
    "title": "Bessent Says All Options on Table to Help Milei's Argentina (Patrick Gillespie/Bloomberg)",
    "description": "Patrick Gillespie / Bloomberg:\nBessent Says All Options on Table to Help Milei's Argentina  —  US Treasury Secretary Scott Bessent pledged to provide “all options for stabilization” to Argentine President Javier Milei as the South American country faces a mar…",
    "link": "https://www.memeorandum.com/250922/p38",
    "timestamp": "2025-09-22T14:20:02Z"
  },
  {
    "title": "Trump administration expected to make an announcement on autism",
    "description": "The administration will reportedly link the active ingredient in Tylenol, if used in early pregnancy, to increased autism risk in children.",
    "link": "https://nationalpost.com/news/world/trump-administration-autism",
    "timestamp": "2025-09-22T14:19:16Z"
  },
  {
    "title": "Star of canceled sitcom speaks out on Jimmy Kimmel suspension",
    "description": "The comedian and noted Trump supporter took to X to share her thoughts on the suspension of \"Jimmy Kimmel Live.\"",
    "link": "https://www.masslive.com/politics/2025/09/star-of-canceled-sitcom-speaks-out-on-jimmy-kimmel-suspension.html",
    "timestamp": "2025-09-22T14:18:15Z"
  },
  {
    "title": "US birth rates plummet to all-time low as housing prices continue to rise",
    "description": "The U.S. birth rate plunged to an all-time low in 2024 after being on a downward trajectory for roughly 20 years, with soaring housing costs widely cited as a major contributing factor.",
    "link": "https://www.realtor.com/news/trends/birth-rates-plummet-home-prices-surge-housing-market-family-planning/",
    "timestamp": "2025-09-22T14:17:41Z"
  },
  {
    "title": "Chuck Schumer Gonna 'Hope And Pray' Us Straight Into Fascism",
    "description": "It’s your Sunday show rundown!",
    "link": "https://www.wonkette.com/p/chuck-schumer-gonna-hope-and-pray",
    "timestamp": "2025-09-22T14:15:30Z"
  },
  {
    "title": "Howard Stern Cancels Disney+ in Support of Jimmy Kimmel and Criticizes ABC: ‘Someone’s Got to Step Up and F—ing Say’ That ‘We’re Not Gonna Bow’ to the Government",
    "description": "Howard Stern announced on Monday’s episode of his SiriusXM radio show that he is canceling his Disney+ subscription after ABC suspended “Jimmy Kimmel Live!” Disney is the network’s parent company. Stern joins a growing list of celebrities who have made their …",
    "link": "https://variety.com/2025/tv/news/howard-stern-cancels-disney-plus-jimmy-kimmel-suspended-1236526075/",
    "timestamp": "2025-09-22T14:12:03Z"
  },
  {
    "title": "Trump Praises AOC’s Political Skills as She Weighs Presidential Bid: ‘She’s Got a Little Spunk, She’s Got a Little Something’",
    "description": "President Donald Trump praised Rep. Alexandria Ocasio-Cortez's (D-NY) political talent during an interview with Fox News' Peter Doocy.\nThe post Trump Praises AOC’s Political Skills as She Weighs Presidential Bid: ‘She’s Got a Little Spunk, She’s Got a Little …",
    "link": "https://www.mediaite.com/media/tv/trump-praises-aocs-political-skills-as-she-weighs-presidential-bid-shes-got-a-little-spunk-shes-got-a-little-something/",
    "timestamp": "2025-09-22T14:10:58Z"
  },
  {
    "title": "Drug-smuggling boat struck by US was carrying more than a ton of suspected cocaine, Dominican Republic says",
    "description": "The Dominican Republic announced a significant drug seizure of suspected cocaine after an American air strike against the drug trafficking vessel.",
    "link": "https://www.foxnews.com/world/drug-smuggling-boat-struck-us-carrying-more-than-ton-suspected-cocaine-dominican-republic-says",
    "timestamp": "2025-09-22T14:10:19Z"
  },
  {
    "title": "Russia Waited for NATO Cargo Planes to Land",
    "description": "Russia Waited for NATO Cargo Planes to Land—Then 3000Kg Warhead Destroyed Ukraine's Air Base….",
    "link": "https://freerepublic.com/focus/f-bloggers/4342025/posts",
    "timestamp": "2025-09-22T14:08:57Z"
  },
  {
    "title": "Fox News Panel Urges Trump To Back Off 'Political Weaponization' After New Threat",
    "description": "Panelists on Fox News worried that President Donald Trump was giving political \"fodder\" to Democrats after he launched a new threat against his perceived enemies.\n\n\nIn a post to Truth Social over the weekend, Trump accused Attorney General Pam Bondi of \"all t…",
    "link": "https://crooksandliars.com/2025/09/fox-news-panel-urges-trump-back-political",
    "timestamp": "2025-09-22T14:08:22Z"
  },
  {
    "title": "John Oliver and Ted Cruz have Goodfellas-influenced meeting of minds over ABC’s suspension of Jimmy Kimmel",
    "description": "Late-night host and Republican senator are in rare agreement as both men accuse FCC chairman Brendan Carr of behaving like mafia boss from Martin Scorsese’s crime classic",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/john-oliver-ted-cruz-jimmy-kimmel-b2831310.html",
    "timestamp": "2025-09-22T14:08:21Z"
  },
  {
    "title": "Trump At Charlie Kirk Memorial: 'I Hate My Opponent'",
    "description": "Donald Trump spoke at Charlie Kirk's memorial service, praising him for uniting people and debating his opponents. Trump, however, expressed his hatred for his \"opponent\" during what is supposed to be a solemn event. Trump, who won the evangelical vote, told …",
    "link": "https://crooksandliars.com/2025/09/trump-charlie-kirk-memorial-i-hate-my",
    "timestamp": "2025-09-22T14:08:00Z"
  },
  {
    "title": "Over 70% of H-1B visa holders are Indian citizens. Its government says Trump jacking the fee to $100,000 is ‘likely to have humanitarian consequences’",
    "description": "India’s Ministry of External Affairs issued a response Saturday to President Donald Trump’s decision to impose a $100,000 fee on H-1B visa applications, warning on X that the move could create “humanitarian consequences” by disrupting families, calling for th…",
    "link": "https://biztoc.com/x/fbd5e69e0c1e14fc",
    "timestamp": "2025-09-22T14:07:43Z"
  },
  {
    "title": "Trump Doubles Down on Deranged Demand to Pam Bondi",
    "description": "President Donald Trump doubled down Monday on his threat to send Attorney General Pam Bondi after his political enemies. Speaking to the press on Air Force One, Trump was asked whom he wanted Attorney General Pam Bondi to “focus” on prosecuting. “Everybody, r…",
    "link": "https://newrepublic.com/post/200731/donald-trump-doubles-down-pam-bondi-enemies",
    "timestamp": "2025-09-22T14:06:55Z"
  },
  {
    "title": "Russia Offers To Extend Nuclear Arms Limits With US By One Year",
    "description": "Russia offered Monday to keep abiding by the nuclear warhead limits in a key treaty with the United States once it expires in February, but only for one year and if Washington did the same.",
    "link": "https://www.ibtimes.com/russia-offers-extend-nuclear-arms-limits-us-one-year-3784145",
    "timestamp": "2025-09-22T14:06:11Z"
  },
  {
    "title": "Charlie Kirk honored as ‘martyr’ at memorial rally",
    "description": "At a service for the slain conservative activist, speakers included President Donald Trump and many top administration officials",
    "link": "https://theweek.com/politics/charlie-kirk-memorial-service-trump",
    "timestamp": "2025-09-22T14:05:45Z"
  },
  {
    "title": "IT stocks plunge as Trump’s $100,000 H-1B visa fee rattles markets",
    "description": "Sensex slides 466 points or 0.56% to settle at 82,159, while Nifty drops 124 points or 0.49% to close at 25,202",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/it-stocks-plunge-as-trumps-100000-h-1b-visa-fee-rattles-markets/article70081024.ece",
    "timestamp": "2025-09-22T14:02:43Z"
  },
  {
    "title": "Ryan Routh, accused of attempting to assassinate Trump on golf course, defends himself at trial",
    "description": "Ryan Routh, accused of attempting to assassinate Trump on golf course, defends himself at trialgo.com",
    "link": "https://abcnews.go.com/US/ryan-routh-accused-attempting-assassinate-trump-golf-defends/story?id=125813818",
    "timestamp": "2025-09-22T14:02:14Z"
  },
  {
    "title": "Trump White House to Announce Tylenol Use in Pregnancy Linked to Autism: Report",
    "description": "Trump's White House is reportedly set to announce that using Tylenol, or generic acetaminophen, during pregnancy may contribute to autism risk.\nThe post Trump White House to Announce Tylenol Use in Pregnancy Linked to Autism: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-white-house-to-announce-tylenol-use-in-pregnancy-linked-to-autism-report/",
    "timestamp": "2025-09-22T14:00:27Z"
  },
  {
    "title": "The Art of the Decline",
    "description": "How Trump’s dealmaking has degraded American foreign policy",
    "link": "https://www.theatlantic.com/international/archive/2025/09/trump-foreign-policy/684294/",
    "timestamp": "2025-09-22T14:00:14Z"
  },
  {
    "title": "Putin’s Proposal to Extend New START Treaty Limits by 1 Year 'Positive' - Think Tank",
    "description": "WASHINGTON (Sputnik) - Russian President Vladimir Putin’s offer to extend compliance with nuclear arsenal limits under the New START Treaty by a year is a welcome step, Arms Control Association Executive Director Daryl Kimball told Sputnik on Monday.",
    "link": "https://sputnikglobe.com/20250922/putins-proposal-to-extend-new-start-treaty-limits-by-1-year-positive---think-tank-1122833779.html",
    "timestamp": "2025-09-22T14:00:04Z"
  },
  {
    "title": "Ta-Nehisi Coates Examines Charlie Kirk’s Bigotry",
    "description": "In a bipartisan vote, Congress passed a resolution to honor Charlie Kirk on October 14 as a National Day of Remembrance for him. At a time when Republicans are canonizing Charlie Kirk, it’s useful to remember what he stood for, what he believed, what he advoc…",
    "link": "https://dianeravitch.net/2025/09/22/ta-hisi-coates-examines-charlie-kirks-beliefs/",
    "timestamp": "2025-09-22T14:00:00Z"
  },
  {
    "title": "I Checked Out Trump’s Unhinged Streaming Site. Then Charlie Kirk Was Shot. What I Saw Shocked Me",
    "description": "Truth+ exposes the grift and grief at the heart of Trump’s big media bet.",
    "link": "https://slate.com/technology/2025/09/donald-trump-truth-social-streaming-service-charlie-kirk.html",
    "timestamp": "2025-09-22T14:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Trump’s HHS Revamps Human Trafficking Hotline After Biden Admin’s Provider Missed Calls",
    "description": "FIRST ON THE DAILY SIGNAL—The Trump administration has chosen a new provider to run its human trafficking hotline after complaints that the Biden administration’s provider... Read More\nThe post EXCLUSIVE: Trump’s HHS Revamps Human Trafficking Hotline After Bi…",
    "link": "https://www.dailysignal.com/2025/09/22/exclusive-trumps-hhs-revamps-human-trafficking-hotline-after-biden-admins-provider-missed-calls/",
    "timestamp": "2025-09-22T14:00:00Z"
  },
  {
    "title": "Elon Musk’s Utterly Mundane Vision of Dining",
    "description": "The Tesla Diner looks a lot like what we already have, just weirder and worse.",
    "link": "https://www.theatlantic.com/culture/archive/2025/09/tesla-diner-elon-musk-review/684265/",
    "timestamp": "2025-09-22T14:00:00Z"
  },
  {
    "title": "A multilevel network approach to revealing patterns of online political selective exposure",
    "description": "Selective exposure, individuals’ inclination to seek out information that supports their beliefs while avoiding information that contradicts them, plays an important role in the emergence of polarization and echo chambers. In the political domain, selective e…",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0332663",
    "timestamp": "2025-09-22T14:00:00Z"
  },
  {
    "title": "Don’t worry, it won’t change anything, Starmer reassures Israel",
    "description": "",
    "link": "https://www.thedailymash.co.uk/politics/dont-worry-it-wont-change-anything-starmer-reassures-israel-20250922260610",
    "timestamp": "2025-09-22T13:59:06Z"
  },
  {
    "title": "Rural health clinics are closing after Trump’s ‘One Big Beautiful Bill,’ raising the legislation’s political risks - NewsBreak",
    "description": "Two months after President Donald Trump signed his policy megabill into law, a Virginia health care company cited it when it announced the closure of three",
    "link": "https://www.newsbreak.com/share/4248512782816-rural-health-clinics-are-closing-after-trump-s-one-big-beautiful-bill-raising-the-legislation-s-political-risks?_f=app_share&amp;pd=08h9jIkK&amp;lang=en_US&amp;send_time=1758549267&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.37.0.31%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v3%2Csc_play_button_v1-control&amp;s=i2",
    "timestamp": "2025-09-22T13:55:33Z"
  },
  {
    "title": "Over 70% of H-1B visa holders are Indian citizens. Its government says Trump jacking the fee to $100,000 is ‘likely to have humanitarian consequences’",
    "description": "The founder of Greycroft Partners says \"there is not a single company that I have invested in the last 10 years that could afford to pay this.\"",
    "link": "https://fortune.com/2025/09/22/india-government-responds-trump-h1b-visa-fees-100k-increase/",
    "timestamp": "2025-09-22T13:54:54Z"
  },
  {
    "title": "Over 70% of H-1B visa holders are Indian citizens. Its government says Trump jacking the fee to $100,000 is ‘likely to have humanitarian consequences’",
    "description": "The founder of Greycroft Partners says \"there is not a single company that I have invested in the last 10 years that could afford to pay this.\"",
    "link": "https://www.yahoo.com/news/articles/over-70-h-1b-visa-135454478.html",
    "timestamp": "2025-09-22T13:54:54Z"
  },
  {
    "title": "Europe Residency Gets Harder to Buy as Trump Sells Gold Card",
    "description": "While President Donald Trump is creating new options for the world’s wealthy to move to the US, Europe has been heading in the opposite direction.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-residency-gets-harder-to-buy-as-trump-sells-gold-card",
    "timestamp": "2025-09-22T13:54:47Z"
  },
  {
    "title": "Combatting Trump's classical mandate, Senate reintroduces Democracy in Design Act",
    "description": "The United States Senate has reintroduced the Democracy in Design Act to its chamber. The bill, introduced on September 19 by Senators Chris Van Hollen and Ben Ray Luján, seeks to ensure communities have a voice in shaping federal buildings and that no single…",
    "link": "https://archinect.com/news/article/150500230/combatting-trump-s-classical-mandate-senate-reintroduces-democracy-in-design-act",
    "timestamp": "2025-09-22T13:54:00Z"
  },
  {
    "title": "Russia will complete deliveries of S-400 missile systems to India in 2026",
    "description": "Russia is set to complete its USD 5.43 billion deal with India by delivering the final S-400 Triumf air defense system in 2026. Four systems have already been delivered, despite earlier US warnings about potential sanctions under CAATSA. India has shown inter…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-will-complete-deliveries-of-s-400-missile-systems-to-india-in-2026/articleshow/124050668.cms",
    "timestamp": "2025-09-22T13:53:54Z"
  },
  {
    "title": "Putin says Russia will stick to nuclear arms limits for one more year after treaty with US expires",
    "description": "The 2010 New START treaty is set to expire in February.",
    "link": "https://www.bostonherald.com/2025/09/22/putin-russia-us-nuclear-treaty/",
    "timestamp": "2025-09-22T13:53:15Z"
  },
  {
    "title": "‘I Hate My Opponent!’ Trump’s Crack Undermines Erika Kirk’s Stunning Forgiveness at Charlie Kirk Memorial",
    "description": "At Charlie Kirk’s memorial, Erika forgave his killer. Trump joked about hating his foes — and the crowd laughed. A revealing test of what America chooses.\nThe post ‘I Hate My Opponent!’ Trump’s Crack Undermines Erika Kirk’s Stunning Forgiveness at Charlie Kir…",
    "link": "https://www.mediaite.com/opinion/i-hate-my-opponent-trumps-crack-undermines-erika-kirks-stunning-forgiveness-at-charlie-kirk-memorial/",
    "timestamp": "2025-09-22T13:51:28Z"
  },
  {
    "title": "Why Trump welcomes this government shutdown fight (Semafor)",
    "description": "Semafor:\nWhy Trump welcomes this government shutdown fight  —  President Donald Trump rarely embraces a battle where he's not the aggressor.  The government shutdown fight is an exception to that rule.  —  Six years ago, Trump picked an unwinnable brawl over …",
    "link": "https://www.memeorandum.com/250922/p34",
    "timestamp": "2025-09-22T13:50:01Z"
  },
  {
    "title": "Jay Leno Defends Jimmy Kimmel, Say's He'll Be Back On the Air 'Somewhere'",
    "description": "Jay Leno's not too worried about Jimmy Kimmel after 'Live!' was suspended indefinitely by ABC over his comments about Charlie Kirk's murder ... telling TMZ he'll be back on air \"somewhere.\" Check out the clip ... he was seen out in Los Angeles over…",
    "link": "https://www.tmz.com/2025/09/22/jay-leno-supports-jimmy-kimmel-amid-suspension/",
    "timestamp": "2025-09-22T13:48:43Z"
  },
  {
    "title": "Could the Supreme Court Really Overturn Gay Marriage?",
    "description": "Gay marriage is an unlikely and unpopular issue for Republicans to go after directly.\nThe post Could the Supreme Court Really Overturn Gay Marriage? appeared first on Autostraddle.",
    "link": "http://www.autostraddle.com/obergefell-overturn-supreme-court-gay-marriage/",
    "timestamp": "2025-09-22T13:48:28Z"
  },
  {
    "title": "Trump nominates White House aide to be top US prosecutor for Eastern Virginia",
    "description": "This decision follows the resignation of Erik Siebert, who was pressured to bring charges in a mortgage fraud investigation involving New York Attorney General Letitia James.",
    "link": "https://apnews.com/article/letitia-james-eastern-district-of-virginia-trump-8c84bd8603a4b932f9cb2e451ef057a3",
    "timestamp": "2025-09-22T13:45:00Z"
  },
  {
    "title": "Kremlin labels UK a key supporter of Ukraine conflict",
    "description": "The comment by spokesman Dmitry Peskov follows US President Donald Trump’s visit to London last week Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625063-uk-key-supporter-ukraine-conflict-kremlin/",
    "timestamp": "2025-09-22T13:43:10Z"
  },
  {
    "title": "Nuclear Power Stock Oklo Surged 64% Last Week—Here Are The Key Price Levels to Watch",
    "description": "Shares in Oklo remain in focus after soaring last week as the Trump administration made nuclear energy a focal point in recent trade talks. Monitor these...",
    "link": "https://www.investopedia.com/nuclear-power-stock-oklo-surged-64-percent-last-week-monitor-these-key-price-levels-11814285",
    "timestamp": "2025-09-22T13:43:07Z"
  },
  {
    "title": "H-1B fee hike risks; PhonePe's losses shrink",
    "description": "The H-1B visa fee hike threatens education lenders with riskier loans. This and more in today's ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/h-1b-fee-hike-risks-phonepes-losses-shrink/articleshow/124049870.cms",
    "timestamp": "2025-09-22T13:41:37Z"
  },
  {
    "title": "What is your experience of the H-1B visa, as a worker or employer?",
    "description": "US announces sweeping changes to the H-1B foreign worker visa scheme",
    "link": "https://www.irishtimes.com/business/work/2025/09/22/what-is-your-experience-of-the-h-1b-visa-as-a-worker-or-employer/",
    "timestamp": "2025-09-22T13:41:27Z"
  },
  {
    "title": "IT stocks tumble on US H-1B visa fee hike concerns; combined market valuation erodes by Rs 83,994 crore",
    "description": "IT stocks fell sharply on Monday due to concerns over a steep $100,000 hike in US H-1B visa fees. Wipro declined 2.25%, Infosys fell 2.61%, and TCS slipped 3.02%. The combined market value of top IT firms fell by Rs 83,994 crore, dragging the BSE IT index dow…",
    "link": "https://economictimes.indiatimes.com/tech/information-tech/it-stocks-tumble-on-us-h-1b-visa-fee-hike-concerns-combined-market-valuation-erodes-by-rs-83994-crore/articleshow/124050431.cms",
    "timestamp": "2025-09-22T13:40:37Z"
  },
  {
    "title": "Trump’s New Visa Policy Inspires Mostly Sour Response From Tech Firms",
    "description": "Trump's new visa fees for foreign workers drew widespread condemnation from technology executives, entrepreneurs and investors across social media.",
    "link": "https://www.huffpost.com/entry/trump-new-visa-policy-tech-executives_n_68d14fc1e4b03fb4d9332350",
    "timestamp": "2025-09-22T13:40:20Z"
  },
  {
    "title": "Royalist: The Trump state visit shows that Duchess Meghan played her hand poorly",
    "description": "Last week, the dominant political and royal story was Donald Trump’s state visit to the UK, and the left-behind Windsors doing the most to make Trump feel like the prettiest princess ever. The Windsors gave Trump a weird carriage procession (in which they jus…",
    "link": "https://www.celebitchy.com/941578/royalist_the_trump_state_visit_shows_that_duchess_meghan_played_her_hand_poorly/",
    "timestamp": "2025-09-22T13:40:06Z"
  },
  {
    "title": "WATCH: Here are some of the biggest speeches from the Charlie Kirk memorial",
    "description": "'The storm whispers to the warrior that you cannot withstand my strength and the warrior whispers back, I am the storm'",
    "link": "https://www.wnd.com/2025/09/watch-here-are-some-biggest-speeches-charlie-kirk/",
    "timestamp": "2025-09-22T13:39:31Z"
  },
  {
    "title": "Will Jimmy Kimmel Be Back on the Air? Latest Updates on Potential Return & ABC Negotiations",
    "description": "According to a source, 'everyone' at ABC wants Kimmel back on the air. So, what's the holdup? Here's what we know so far.",
    "link": "https://hollywoodlife.com/feature/is-jimmy-kimmel-coming-back-on-air-5458563/",
    "timestamp": "2025-09-22T13:39:12Z"
  },
  {
    "title": "Trump, Vance among those honoring Charlie Kirk’s Christian legacy",
    "description": "Erika Kirk embraces U.S. President Donald Trump at the conclusion of the memorial service held for Charlie Kirk in Glendale, Arizona, on Sept. 21, 2025. / Credit: Joe Raedle/Getty Images\n\nWashington, D.C. Newsroom, Sep 22, 2025 / 09:35 am (CNA).\nPresident Don…",
    "link": "https://www.catholicnewsagency.com/news/266699/trump-vance-among-those-honoring-charlie-kirk-s-christian-legacy",
    "timestamp": "2025-09-22T13:35:00Z"
  },
  {
    "title": "The $100,000 Visa",
    "description": "The H-1B visa just got a whole helluvalot more expensive: During the pre-weekend Friday news dumb, President Donald Trump made some major announcements about our system for skilled immigration.\nUnder his latest changes, you can essentially buy your way in. Fo…",
    "link": "https://biztoc.com/x/64ddd130fc1e439a",
    "timestamp": "2025-09-22T13:34:40Z"
  },
  {
    "title": "Dollar-Hungry Milei Pauses Crop Tariffs Ahead of Argentine Vote",
    "description": "President Javier Milei temporarily scrapped export tariffs on all of Argentina’s crop cargoes in a bid to bring dollars into the country to shore up a market sell-off before a crucial midterm election.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-hungry-milei-pauses-crop-tariffs-ahead-of-argentine-vote",
    "timestamp": "2025-09-22T13:34:21Z"
  },
  {
    "title": "Hardline lawmakers demand nuclear bomb as Iran braces for UN sanctions",
    "description": "Seventy members of parliament sign a letter calling for a 'change in the defence doctrine' of the nation.",
    "link": "https://www.aljazeera.com/news/2025/9/22/hardline-lawmakers-demand-nuclear-bomb-as-iran-braces-for-un-sanctions",
    "timestamp": "2025-09-22T13:34:20Z"
  },
  {
    "title": "What Pete Buttigieg Meant to Say About Israel",
    "description": "Pete Buttigieg chats with Kara Swisher about Democrats’ credibility problem, Chuck Schumer’s competence, and why he equivocated on Gaza, among other topics.",
    "link": "http://nymag.com/intelligencer/article/on-with-kara-swisher-buttigieg-israel-kirk-shutdown.html",
    "timestamp": "2025-09-22T13:32:37Z"
  },
  {
    "title": "Barack Obama Rips Trump Administration For FCC “Coercion”",
    "description": "Former president Barack Obama ripped the Trump administration for its role in the suspension of Jimmy Kimmel's show on ABC, calling it \"government coercion.\"",
    "link": "https://hiphopwired.com/2841776/barack-obama-rips-trump-administration-for-fcc-coercion/",
    "timestamp": "2025-09-22T13:31:03Z"
  },
  {
    "title": "Justice Ketanji Brown Jackson at UVa reflects on her race and her rise",
    "description": "On a college campus recently rocked by its own diversity policies, Supreme Court Justice Ketanji Brown Jackson told a crowd at UVa, \"Difference can actually be meaningful.\"",
    "link": "https://dailyprogress.com/news/local/education/higher-education/uva/article_75a87537-c0cc-4f96-9a07-6320690639cd.html",
    "timestamp": "2025-09-22T13:30:00Z"
  },
  {
    "title": "WATCH: Trump and Elon Musk reunite at Charlie Kirk Memorial after bitter public feud",
    "description": "Pair seen shaking hands while sitting next to each other during emotional service",
    "link": "https://www.wnd.com/2025/09/watch-trump-elon-musk-reunite-charlie-kirk-memorial/",
    "timestamp": "2025-09-22T13:29:40Z"
  },
  {
    "title": "North Korean leader recalls ‘good personal memories’ of Trump, urges U.S. to drop denuclearization demands",
    "description": "Tensions on the Korean Peninsula have worsened in recent years as Kim has accelerated his weapons buildup and aligned with Russia over the war in Ukraine.",
    "link": "https://www.pbs.org/newshour/world/north-korean-leader-recalls-good-personal-memories-of-trump-urges-u-s-to-drop-denuclearization-demands",
    "timestamp": "2025-09-22T13:29:34Z"
  },
  {
    "title": "How Trump’s visa fees could reshape working in the US",
    "description": "Donald Trump just made hiring some foreign workers much more expensive, as H-1B visa fees jump to $100,000 annually.",
    "link": "https://www.aljazeera.com/video/by-the-numbers-3/2025/9/22/how-trumps-visa-fees-could-reshape-working-in-the-us",
    "timestamp": "2025-09-22T13:28:55Z"
  },
  {
    "title": "Kamala Harris Sounds Alarm On Trump And Free Speech: ‘An Abuse Of Power’",
    "description": "Former Vice President Kamala Harris tried to warn America that if Donald Trump was elected he would seek “revenge” on his adversaries, and she was right. Now, Harris is warning that America is heading toward an erosion of free speech.  Deadline points out tha…",
    "link": "https://hiphopwired.com/2841866/kamala-harris-sounds-alarm-on-trump-and-free-speech-an-abuse-of-power/",
    "timestamp": "2025-09-22T13:28:32Z"
  },
  {
    "title": "What is happening with the H-1B visa scheme in the US and how will it affect Irish tech workers?",
    "description": "Move by Donald Trump has left companies scrambling to figure out exactly what is happening amid fears of hefty new fees",
    "link": "https://www.irishtimes.com/business/2025/09/22/what-is-happening-with-the-h-1b-visa-scheme-in-the-us-and-how-will-it-affect-irish-tech-workers/",
    "timestamp": "2025-09-22T13:27:17Z"
  },
  {
    "title": "TCS to announce Q2 results on October 9, consider second interim dividend for FY26",
    "description": "TCS will announce Q2 results and consider a second interim dividend on October 9, with October 15 as record date. Shares slipped 3% amid Trump’s $100,000 H-1B visa fee shock, pressuring IT stocks.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-to-announce-q2-results-on-october-9-consider-second-interim-dividend-for-fy26/articleshow/124050153.cms",
    "timestamp": "2025-09-22T13:25:39Z"
  },
  {
    "title": "Hamas letter to Trump asks for 60-day ceasefire deal to release half of hostages, sources say",
    "description": "Hamas has written a letter to President Donald Trump offering to release half of the hostages in return for a 60-day pause in hostilities.",
    "link": "https://www.foxnews.com/world/hamas-letter-trump-asks-60-day-ceasefire-deal-release-half-hostages-sources-say",
    "timestamp": "2025-09-22T13:24:19Z"
  },
  {
    "title": "H-1B fee hike: Who’s gaining from these visas – Indian IT or US firms?",
    "description": "Indian companies were the biggest beneficiaries for years. But that's changed; US firms now dominate visa recipients.",
    "link": "https://www.aljazeera.com/news/2025/9/22/h-1b-fee-hike-whos-gaining-from-these-visas-indian-it-or-us-firms",
    "timestamp": "2025-09-22T13:24:05Z"
  },
  {
    "title": "Watch: Camera Catches Trump, Musk Recapturing the Magic at Charlie Kirk Funeral",
    "description": "It's guaranteed that Charlie Kirk would have been thrilled had he seen these two men speaking and shaking heads.",
    "link": "https://www.westernjournal.com/watch-camera-catches-trump-musk-recapturing-magic-charlie-kirk-funeral/",
    "timestamp": "2025-09-22T13:23:49Z"
  },
  {
    "title": "Hamas said to have sent letter to Trump seeking truce",
    "description": "Hamas is said to have appealed directly to United States President Donald Trump through a letter, Fox News reported Monday, citing a US source and another closed to the negotiations. The group offered...",
    "link": "https://biztoc.com/x/9db90f13bbe2dae7",
    "timestamp": "2025-09-22T13:23:23Z"
  }
]