[
  {
    "title": "White House is considering inviting Zelenskyy to Alaska",
    "description": "WASHINGTON — The White House is considering inviting Ukrainian President Volodymyr Zelenskyy to Alaska, where President Donald Trump is scheduled to meet with Russian President Vladimir Putin next week, according to a senior U.S. official and three people bri…",
    "link": "https://biztoc.com/x/863160edb43e9992",
    "timestamp": "2025-08-09T21:52:34Z"
  },
  {
    "title": "Fishing in vast Pacific nature area halted after judge blocks Trump order",
    "description": "Environmentalists challenged Trump's rollback of federal ocean protections.",
    "link": "https://abcnews.go.com/Business/wireStory/commercial-fishing-vast-pacific-nature-area-halted-after-124513767",
    "timestamp": "2025-08-09T21:47:35Z"
  },
  {
    "title": "Fed Gov. Bowman wants three interest rate cuts in 2025",
    "description": "The Federal Reserve has not approved an interest rate cut since before the Nov. 5 election, but one of its governors said she wants three rate cuts this year...",
    "link": "https://www.upi.com/Top_News/US/2025/08/09/federal-reserve-rate-bowman/1681754774717/",
    "timestamp": "2025-08-09T21:43:05Z"
  },
  {
    "title": "Ousted vaccine regulator Vinay Prasad to return to FDA",
    "description": "Laura Loomer, an ally of Donald Trump, had said Prasad was not aligned with the president’s agenda and has aggressively lobbied against his return.",
    "link": "https://fortune.com/2025/08/09/vinay-prasad-fda-return-vaccine-regulator-laura-loomer/",
    "timestamp": "2025-08-09T21:42:54Z"
  },
  {
    "title": "America's New Woke Goddess Sydney Sweeney Set to Rake in $10Millon as Face of Bud Light After Brand’s Trans Scandal",
    "description": "Experts estimate Sweeney could earn a pay day of up to $10 million from Bud Light’s parent company, Anheuser-Busch.",
    "link": "https://radaronline.com/p/america-sydney-sweeney-10millon-bud-light-brands-trans-scandal/",
    "timestamp": "2025-08-09T21:40:00Z"
  },
  {
    "title": "Love Actually: Emma Thompson says she could’ve ‘changed the course of American history’ by accepting date with Trump",
    "description": "The ‘Nanny McPhee’ star said Trump got her phone number by ‘stalking’",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/emma-thompson-donald-trump-date-b2804917.html",
    "timestamp": "2025-08-09T21:39:44Z"
  },
  {
    "title": "Trump eyes reclassifying marijuana as less dangerous drug: report",
    "description": "President Donald Trump is reportedly eyeing reclassifying marijuana as a less dangerous drug.",
    "link": "https://nypost.com/2025/08/09/us-news/trump-eyes-reclassifying-marijuana-as-less-dangerous-drug-report/",
    "timestamp": "2025-08-09T21:36:51Z"
  },
  {
    "title": "Hundreds cheer Arizona Sen. Ruben Gallego as Democrats take offensive against Trump's tax bill",
    "description": "Hundreds of people cheered Sen. Ruben Gallego at a town hall meeting in eastern Iowa Saturday as the first-term Arizona Democrat assailed the massive...",
    "link": "https://www.yahoo.com/news/articles/hundreds-cheer-arizona-sen-ruben-213650016.html",
    "timestamp": "2025-08-09T21:36:50Z"
  },
  {
    "title": "John Leguizamo Slams “Loser” Dean Cain For Joining ICE: “Your Pronouns Are Has/Been”",
    "description": "John Leguizamo is not mincing words in addressing Dean Cain’s recent decision to join ICE. The Bob Trevino Likes It star, who has been a vocal critic of ICE’s increasingly militant behavior toward immigrants, took to his Instagram Friday to share his thoughts…",
    "link": "http://deadline.com/2025/08/john-leguizamo-slams-dean-cain-joining-ice-1236483026/",
    "timestamp": "2025-08-09T21:30:47Z"
  },
  {
    "title": "Goldberg: Trump Was Making The International Sign For \"I'm Building A Dome\" When He Was On The White House Roof",
    "description": "WASHINGTON WEEK: President Trump will slap tariffs on any country, at any time, for any reason. It’s a dramatic and destabilizing way to manage America’s economy and our relationships with other countries. Join moderator Jeffrey Goldberg, Jonathan Karl of ABC…",
    "link": "https://www.realclearpolitics.com/video/2025/08/09/goldberg_trump_was_making_the_international_sign_for_im_building_a_dome_when_he_was_on_the_white_house_roof.html",
    "timestamp": "2025-08-09T21:29:02Z"
  },
  {
    "title": "White House is considering inviting Zelenskyy to Alaska",
    "description": "WASHINGTON — The White House is considering inviting Ukrainian President Volodymyr Zelenskyy to Alaska, where President Donald Trump is scheduled to meet with Russian President Vladimir Putin next week, according to a senior U.S. official and three people bri…",
    "link": "https://www.nbcnews.com/politics/trump-administration/white-house-considering-inviting-zelenskyy-alaska-rcna224070",
    "timestamp": "2025-08-09T21:27:03Z"
  },
  {
    "title": "Why the Democrats are in such a terrible state",
    "description": "'As often happens, they abused power: manipulating the electoral process, weaponizing the justice system'",
    "link": "https://www.wnd.com/2025/08/why-democrats-are-such-terrible-state/",
    "timestamp": "2025-08-09T21:26:45Z"
  },
  {
    "title": "‘Raging Psychopath!’ Mark Levin Trades Brutal Insults With ‘Disgusting Antisemite’ and ‘Clown’ Marjorie Taylor Greene",
    "description": "Mark Levin and Marjorie Taylor Greene went scorched earth in dueling social media posts on Saturday, trading brutal barbs and insults.\nThe post ‘Raging Psychopath!’ Mark Levin Trades Brutal Insults With ‘Disgusting Antisemite’ and ‘Clown’ Marjorie Taylor Gree…",
    "link": "https://www.mediaite.com/media/news/raging-psychopath-mark-levin-trades-brutal-insults-with-disgusting-antisemite-and-clown-marjorie-taylor-greene/",
    "timestamp": "2025-08-09T21:26:20Z"
  },
  {
    "title": "Zelensky rejects land swap idea floated by Trump",
    "description": "Vladimir Zelensky has rebuked the suggestion made by US President Donald Trump a potential peace deal with Russia could involve a land swap Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622713-zelensky-trump-land-swap/",
    "timestamp": "2025-08-09T21:22:27Z"
  },
  {
    "title": "Pennsylvania bill would let illegal immigrants pay same tuition as in-state residents",
    "description": "Americans from out of state still would have to pay higher tuition price Anyone who has lived in Pennsylvania for at least 12 months “regardless of immigration status” would be eligible for in-state tuition under a new bill. Introduced by state Rep. Greg Scot…",
    "link": "https://freerepublic.com/focus/f-news/4333651/posts",
    "timestamp": "2025-08-09T21:17:18Z"
  },
  {
    "title": "Fed Governor Bowman says weak jobs report backs her view for 3 rate cuts this year",
    "description": "Bowman said she is getting more confident that Trump's tariffs “will not present a persistent shock to inflation” and sees it moving closer to 2%.",
    "link": "https://fortune.com/2025/08/09/fed-rate-cuts-outlook-michelle-bowman-jobs-report-inflation-tariffs/",
    "timestamp": "2025-08-09T21:16:25Z"
  },
  {
    "title": "Vinay Prasad Returns To Role As Top Vaccine Regulator At FDA Days After Leaving U.S. Agency",
    "description": "Prasad, an oncologist who was a fierce critic of U.S. COVID-19 vaccine and mask mandates, was named the center's director in May.",
    "link": "https://www.huffpost.com/entry/vinay-prasad-vaccine-regulator-fda_n_6897b873e4b041ecaf505cb3",
    "timestamp": "2025-08-09T21:13:33Z"
  },
  {
    "title": "Trump nominates ex-Fox News host Tammy Bruce as deputy UN ambassador",
    "description": "Bruce, who is currently spokeswoman for the state department, has done \"brilliantly\" according to Trump.",
    "link": "https://www.bbc.com/news/articles/cj9wv49xr0xo",
    "timestamp": "2025-08-09T21:07:54Z"
  },
  {
    "title": "Why young Americans dread turning 26: Health insurance chaos",
    "description": "Amid the challenges of adulthood, there is one rite of passage unique to the US: the need to find your own health insurance by the time you turn 26.",
    "link": "https://www.bostonglobe.com/2025/08/09/nation/why-young-americans-dread-turning-26-health-insurance-chaos/",
    "timestamp": "2025-08-09T21:07:37Z"
  },
  {
    "title": "Four astronauts home from space station after splashdown",
    "description": "WASHINGTON: An international crew of four astronauts is back home on Earth Saturday (Aug 9) after nearly five months aboard the International Space Station, returning safely in a SpaceX capsule. The spacecraft carrying US astronauts Anne McClain and Nichole A…",
    "link": "https://www.channelnewsasia.com/world/astronauts-spacex-nasa-return-outerspace-5286966",
    "timestamp": "2025-08-09T21:06:35Z"
  },
  {
    "title": "Trump Pal And MAGA Influencer Attacks Rep. Jasmine Crockett With Racist Term",
    "description": "The far-right activist quoted a post on X that referenced Crockett’s alleged treatment of her staff.",
    "link": "https://www.huffpost.com/entry/laura-loomer-jasmine-crockett-racially-charged-term_n_6897a03ae4b0e3a604531f55",
    "timestamp": "2025-08-09T21:00:47Z"
  },
  {
    "title": "Emma Thompson Says Donald Trump Was Basically 'Stalking' Her Right After Divorce",
    "description": "Emma Thompson says Donald Trump tried to see if there was any \"Love Actually\" between them ... though he did it in a way that sorta weirded her out. The actress was dishing about a few different topics at the Locarno Film Festival in Switzerland…\n Permalink",
    "link": "https://www.tmz.com/2025/08/09/emma-thompson-donald-trump-stalk-ask-out-date-after-divorce/",
    "timestamp": "2025-08-09T20:59:57Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "HONOLULU (AP) — Commercial fishing that recently resumed in a vast protected area of the Pacific Ocean must halt once again, after a judge in Hawaii sided this week with environmentalists challenging a Trump administration rollback of federal ocean protection…",
    "link": "https://financialpost.com/pmn/commercial-fishing-in-a-vast-pacific-nature-area-is-halted-after-a-judge-blocks-a-trump-order",
    "timestamp": "2025-08-09T20:59:09Z"
  },
  {
    "title": "Commercial fishing in a vast Pacific nature area is halted after a judge blocks a Trump order",
    "description": "Commercial fishing that recently resumed in a vast protected area of the Pacific Ocean must halt once again, after a judge in Hawaii sided this week with...",
    "link": "https://www.yahoo.com/news/articles/commercial-fishing-vast-pacific-nature-205554082.html",
    "timestamp": "2025-08-09T20:55:54Z"
  },
  {
    "title": "A new bull market has begun and is still in the early stages, so buy the dips, top Wall Street analyst says",
    "description": "Wilson's view is part of an increased sense of optimism on Wall Street as fears over tariffs ease with the signing of several trade deals.",
    "link": "https://fortune.com/2025/08/09/new-bull-market-buy-the-dips-stock-outlook-sp500/",
    "timestamp": "2025-08-09T20:55:03Z"
  },
  {
    "title": "Zelenskyy calls for 'lasting peace', not 'pause in the killings', after officials meet in UK",
    "description": "Ukrainian President Volodymyr Zelenskyy says a meeting with European and US officials to discuss the ongoing war with Russia was constructive.",
    "link": "https://www.abc.net.au/news/2025-08-10/ukraine-officials-meet-european-us-leaders/105633512",
    "timestamp": "2025-08-09T20:53:44Z"
  },
  {
    "title": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace deal - Reuters",
    "description": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters President Trump Brokers Another Historic Peace DealThe White House (.gov) Iran rejects planned transit corridor outlined in Armenia-Azerbaijan pactAl Jazeera Donald Trump …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178627668",
    "timestamp": "2025-08-09T20:52:28Z"
  },
  {
    "title": "'The Pitt' Season 2 Will Deal with Trump Administration's Medicaid Cuts, Noah Wyle Says",
    "description": "Noah Wyle is sharing how reality will be reflected in season 2 of The Pitt. HBO Max‘s medical drama didn’t shy away from the reality of an hour in the emergency room during the first season. According to the 54-year-old star and producer of the series, they p…",
    "link": "https://www.justjared.com/2025/08/09/the-pitt-season-2-will-deal-with-trump-administrations-medicaid-cuts-noah-wyle-says/",
    "timestamp": "2025-08-09T20:51:20Z"
  },
  {
    "title": "'Unprecedented': Ex-GOP insider flags 'evidence' Trump 'thinks his supporters are garbage'",
    "description": "Donald Trump on Saturday was accused of committing \"unprecedented treachery\" as he displays \"disdain\" for his own supporters.According to Steve Schmidt, an independent political strategist who worked on former President George W. Bush's campaign, Trump recent…",
    "link": "https://www.rawstory.com/trump-supporters-garbage-steve-schmidt/",
    "timestamp": "2025-08-09T20:48:30Z"
  },
  {
    "title": "Gold plaque, Olympic medals and a jet: Here are the gifts Trump has accepted (Josephine Walker/Axios)",
    "description": "Josephine Walker / Axios:\nGold plaque, Olympic medals and a jet: Here are the gifts Trump has accepted  —  Donald Trump received a glass disc with a 24-karat gold base from Apple CEO Tim Cook on Wednesday, as the tech titan announced a $100 billion investment…",
    "link": "https://www.memeorandum.com/250809/p37",
    "timestamp": "2025-08-09T20:45:01Z"
  },
  {
    "title": "Europe and Ukraine press US ahead of Trump-Putin talks",
    "description": "KYIV/LONDON: European officials were reported to have presented their own Ukraine peace proposals to the United States on Saturday (Aug 9) as President Donald Trump prepared for talks with Russian President Vladimir Putin on ending the war.",
    "link": "https://www.channelnewsasia.com/world/europe-and-ukraine-press-us-ahead-trump-putin-talks-5286951",
    "timestamp": "2025-08-09T20:44:00Z"
  },
  {
    "title": "Trump–Newsom feud could end the governor’s career as White House bid looms",
    "description": "The escalating conflict between California Governor Gavin Newsom and former President Donald Trump takes stage on immigration raids and political disagreements. With the protests, lawsuits, and criticisms, their rivalry will impact the 2028 presidential elect…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumpnewsom-feud-could-end-the-governors-career-as-white-house-bid-looms/articleshow/123210825.cms",
    "timestamp": "2025-08-09T20:40:43Z"
  },
  {
    "title": "GOP Congressman on Trump Tariffs: ‘Steel Prices Are Up’ but It’s ‘For the Good of the Country’",
    "description": "Rep. Ralph Norman (R-SC) acknowledged that prices were up as a result of President Donald Trump’s tariffs, yet emphasized that it’s “for the good of the country” in a Saturday appearance on Fox Report With Jon Scott. Host Jon Scott asked the congressman, who …",
    "link": "https://www.mediaite.com/media/tv/gop-congressman-on-trump-tariffs-steel-prices-are-up-but-its-for-the-good-of-the-country/",
    "timestamp": "2025-08-09T20:39:54Z"
  },
  {
    "title": "Ukraine’s backers make counter-offer ahead of Alaska talks – WSJ",
    "description": "Kiev and several of its backers have reportedly told US officials that only a “reciprocal” territory swap with Moscow is possible Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622711-wsj-europeans-ukraine-prepare-counterproposal-us/",
    "timestamp": "2025-08-09T20:39:26Z"
  },
  {
    "title": "Trump Nominates State Department Spokeswoman Tammy Bruce as Deputy U.S. Representative to the United Nations",
    "description": "President Donald Trump announced Saturday he will nominate Tammy Bruce, currently the State Department’s spokeswoman, to serve as Deputy U.S. Representative to the United Nations with the rank of ambassador.\nThe post Trump Nominates State Department Spokeswom…",
    "link": "https://www.breitbart.com/politics/2025/08/09/trump-nominates-state-department-spokeswoman-tammy-bruce-as-deputy-u-s-representative-to-the-united-nations/",
    "timestamp": "2025-08-09T20:36:56Z"
  },
  {
    "title": "New Zealand and Australia seek closer military ties following Chinese live-fire naval exercise",
    "description": "The leaders of New Zealand and Australia on Saturday discussed closer cooperation between they their expanding militaries against the backdrop of a recent extraordinary Chinese live-fire exercise near their shores. New Zealand Prime Minister Christopher Luxon…",
    "link": "https://japantoday.com/category/world/new-zealand-and-australia-seek-closer-military-ties-following-chinese-live-fire-naval-exercise",
    "timestamp": "2025-08-09T20:36:11Z"
  },
  {
    "title": "Four astronauts return home from space station after splashdown",
    "description": "An international crew of four astronauts is back home on Earth Saturday after nearly five months aboard the International Space Station, returning safely in a SpaceX capsule. The spacecraft carrying U.S. astronauts Anne McClain and Nichole Ayers, Japan's Taku…",
    "link": "https://japantoday.com/category/world/four-astronauts-home-from-space-station-after-splashdown",
    "timestamp": "2025-08-09T20:35:34Z"
  },
  {
    "title": "Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace deal",
    "description": "Iran threatened on Saturday to block a corridor planned in the Caucasus under a regional deal sponsored by U.S. President Donald Trump, Iranian media reported, raising a new question mark over a peace plan hailed as a strategically important shift. A top Azer…",
    "link": "https://japantoday.com/category/world/iran-threatens-planned-trump-corridor-envisaged-by-azerbaijan-armenia-peace-deal",
    "timestamp": "2025-08-09T20:34:50Z"
  },
  {
    "title": "Whitmer tells Trump in private that Michigan auto jobs depend on a tariff change of course",
    "description": "Michigan Gov. Gretchen Whitmer met privately in the Oval Office with President Donald Trump to make a case he did not want to hear: the automotive industry he said he wants to save were being hurt by his tariffs. The Democrat came with a slide deck to make he…",
    "link": "https://japantoday.com/category/world/whitmer-told-trump-in-private-that-michigan-auto-jobs-depend-on-a-tariff-change-of-course",
    "timestamp": "2025-08-09T20:34:27Z"
  },
  {
    "title": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations",
    "description": "Ukrainian President Volodymyr Zelenskyy on Saturday rejected the idea that his country would give up land to end the war with Russia after U.S. President Donald Trump suggested a peace deal could include “some swapping of territories.” Zelenskyy said Ukraine …",
    "link": "https://japantoday.com/category/world/zelenskyy-rejects-formally-ceding-ukrainian-territory-says-kyiv-must-be-part-of-any-negotiations",
    "timestamp": "2025-08-09T20:34:08Z"
  },
  {
    "title": "ICE arrests Guatemalan workers heading to work harvesting berries, advocate group says",
    "description": "The four arrests mark the first publicly known detainment of fieldworkers by ICE agents in Oregon since President Donald Trump took office for his second term.",
    "link": "https://www.oregonlive.com/news/2025/08/ice-arrests-guatemalan-workers-heading-to-work-harvesting-berries-advocate-group-says.html",
    "timestamp": "2025-08-09T20:32:30Z"
  },
  {
    "title": "Emma Thompson reveals Donald Trump asked her out on a date on the day she got divorced - Daily Mail",
    "description": "Emma Thompson reveals Donald Trump asked her out on a date on the day she got divorcedDaily Mail Emma Thompson On Donald Trump Stalking Her On ‘Primary Colors’ SetDeadline Emma Thompson Talks About Donald Trump's 1990s Dinner Invite, Evoking Sliding Doors Pos…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178627534",
    "timestamp": "2025-08-09T20:32:14Z"
  },
  {
    "title": "Old footage of the president defending convicted rapist Mike Tyson has resurfaced as speculation mounts that the president may pardon Ghislaine Maxwell.",
    "description": "President Donald Trump’s shocking defense of a champion boxer who raped a teenage girl has resurfaced as the president faces intense scrutiny of his...",
    "link": "https://www.thedailybeast.com/president-donald-trumps-vile-take-on-teenagers-rape-goes-viral-as-his-jeffrey-epstein-woes-deepen/",
    "timestamp": "2025-08-09T20:27:14Z"
  },
  {
    "title": "Trump accepts plaque with 24k gold base amid surge of lavish gifts",
    "description": "Donald Trump received a glass disc with a 24-karat gold base from Apple CEO Tim Cook on Wednesday, as the tech titan announced a $100 billion investment in U.S. manufacturing facilities.\nWhy it matters: The gold bauble is the latest lavish gift presented to T…",
    "link": "https://biztoc.com/x/2617cabc4cfa486b",
    "timestamp": "2025-08-09T20:23:11Z"
  },
  {
    "title": "Trump nominates Bruce as US deputy representative to UN",
    "description": "US President Donald Trump said he was nominating State Department spokesperson Tammy Bruce as the next US deputy representative to the United Nations.",
    "link": "https://www.rte.ie/news/world/2025/0809/1527711-trump-bruce-un/",
    "timestamp": "2025-08-09T20:23:05Z"
  },
  {
    "title": "Trump nominates Bruce as US deputy representative to UN",
    "description": "US President Donald Trump said he was nominating State Department spokesperson Tammy Bruce as the next US deputy representative to the United Nations.",
    "link": "https://www.rte.ie/news/us/2025/0809/1527711-trump-bruce-un/",
    "timestamp": "2025-08-09T20:23:05Z"
  },
  {
    "title": "IRS Chief Forced Out After Immigrant Tax Data Pushback—Report",
    "description": "The IRS previously agreed to a data-sharing scheme with the Department of Homeland Security to use some sensitive information to identify illegal immigrants.",
    "link": "https://www.newsweek.com/irs-chief-forced-immigrant-tax-data-pushback-report-2111292",
    "timestamp": "2025-08-09T20:22:58Z"
  },
  {
    "title": "Tyrant Trump's Worst Crimes, Dangers, and Destructions Are Yet to Come",
    "description": "The worst crimes of Donald Trump and dangers to America from the unstable, monomaniacal, lying outlaw in the White House have yet to come. He is not satisfied with tearing apart our country’s social safety net for tens of millions of Americans (e.g., Medicaid…",
    "link": "https://www.commondreams.org/opinion/trump-attacks-on-democracy-institutions",
    "timestamp": "2025-08-09T20:14:52Z"
  },
  {
    "title": "Armenians and Azerbaijanis greet US-brokered peace deal with hope but also caution",
    "description": "Residents and politicians in Armenia and Azerbaijan are responding with cautious hope after their leaders signed a U.S.-brokered agreement aimed at ending decades of hostilities",
    "link": "https://abcnews.go.com/International/wireStory/armenians-azerbaijanis-greet-us-brokered-peace-deal-hope-124513324",
    "timestamp": "2025-08-09T20:14:27Z"
  },
  {
    "title": "Zelenskyy says no to territorial concessions: ‘Ukrainians will not give their land to the occupier’",
    "description": "Ukraine won't surrender land to Russia to buy peace, President Volodymyr Zelenskyy warned Saturday, after Washington and Moscow agreed to hold a summit in a bid to end the war.\nPresidents Vladimir Putin and Donald Trump will meet in the US state of Alaska nex…",
    "link": "https://biztoc.com/x/1691c8aa9dc198f3",
    "timestamp": "2025-08-09T20:12:03Z"
  },
  {
    "title": "Trump Nominates Admin Spokesperson, Former TV Host to UN Role",
    "description": "The former Fox host and contributor is one of many to be moved to roles within the Trump administration.",
    "link": "https://www.newsweek.com/trump-nominates-admin-spokesperson-former-tv-host-un-role-2111294",
    "timestamp": "2025-08-09T20:08:37Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.news4jax.com/news/politics/2025/08/09/a-top-federal-reserve-official-says-dour-jobs-data-backs-the-case-for-3-rate-cuts/",
    "timestamp": "2025-08-09T20:05:20Z"
  },
  {
    "title": "Armenians and Azerbaijanis greet US-brokered peace deal with hope but also caution",
    "description": "By LILIT MKHITARYAN YEREVAN, Armenia (AP) — Residents and politicians in Armenia and Azerbaijan responded Saturday with cautious hope — and skepticism in some cases — after their leaders signed a U.S.-brokered agreement at the White House aimed at ending deca…",
    "link": "https://www.denverpost.com/2025/08/09/armenians-and-azerbaijanis-greet-us-brokered-peace-deal-with-hope-but-also-caution/",
    "timestamp": "2025-08-09T20:05:17Z"
  },
  {
    "title": "Exclusive -- Former Sen. Scott Brown: 'I Saw the Unfairness of Trade' Firsthand",
    "description": "\"I saw the unfairness of trade\" firsthand, former Sen. Scott Brown, running for retiring Democrat Sen. Jeanne Shaheen’s seat in New Hampshire, said during an appearance on Breitbart News Saturday, harkening to his time as ambassador to New Zealand during Pres…",
    "link": "https://www.breitbart.com/politics/2025/08/09/exclusive-former-sen-scott-brown-i-saw-the-unfairness-of-trade-firsthand/",
    "timestamp": "2025-08-09T20:03:06Z"
  },
  {
    "title": "Zelenskyy says no to territorial concessions: ‘Ukrainians will not give their land to the occupier’",
    "description": "\"Any decisions against us, any decisions without Ukraine, are also decisions against peace,\" he said",
    "link": "https://www.euractiv.com/section/politics/news/zelenskyy-says-no-to-territorial-concessions-ukrainians-will-not-give-their-land-to-the-occupier/",
    "timestamp": "2025-08-09T20:01:36Z"
  },
  {
    "title": "Trump-Putin summit in Alaska resembles a slow defeat for Ukraine",
    "description": "Location matters, former real estate mogul US President Donald Trump said. Moments later he announced Alaska, a place sold by Russia to the United States 158 years ago for $7.2 million, would be where Russian President Vladimir Putin tries to sell his land de…",
    "link": "https://freerepublic.com/focus/f-news/4333645/posts",
    "timestamp": "2025-08-09T20:00:30Z"
  },
  {
    "title": "Trump is letting Putin manipulate him, again (Max Boot/Washington Post)",
    "description": "Max Boot / Washington Post:\nTrump is letting Putin manipulate him, again  —  The president's desperation to end the Ukraine war might lead to another Munich moment with Russia.  —  Just now  —  President Donald Trump's unhealthy obsession with winning the Nob…",
    "link": "https://www.memeorandum.com/250809/p34",
    "timestamp": "2025-08-09T19:55:01Z"
  },
  {
    "title": "Diddy Lawyer Thinks Rapper Could Align With Trump If Pardoned: ‘It Would Not Surprise Me’ | Video",
    "description": "The two reality television vets share an \"affinity\" after experiencing the legal system, Mark Geragos says\nThe post Diddy Lawyer Thinks Rapper Could Align With Trump If Pardoned: ‘It Would Not Surprise Me’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/diddy-trial-attorney-trump-pardon-alliance/",
    "timestamp": "2025-08-09T19:54:40Z"
  },
  {
    "title": "NYC Mayor Adams vs. the far-left City Council: 14 vetoes on bills ‘defying common sense’ and counting",
    "description": "Mayor Eric Adams has vetoed 14 City Council bills and other measures in less than four years in office, a move supporters hailed as critical to thwart the City Council's radical leftist agenda.",
    "link": "https://nypost.com/2025/08/09/us-news/nyc-mayor-adams-vs-the-far-left-city-council-14-vetoes-on-bills-defying-common-sense-and-counting/",
    "timestamp": "2025-08-09T19:54:30Z"
  },
  {
    "title": "The Big Winners of the Trump-Era Crypto Boom",
    "description": "The crypto world is in a state of euphoria, and it has one person to thank: President Donald Trump. Since his victory last November, the man who promised to be the “crypto president” has rolled out the red carpet for the decentralized finance industry, igniti…",
    "link": "https://biztoc.com/x/ecea988f061ecec6",
    "timestamp": "2025-08-09T19:49:37Z"
  },
  {
    "title": "Emma Thompson Reiterates Claims Donald Trump Once Asked Her on a Date",
    "description": "Emma Thompson recently recalled an unexpected exchange she claims she had with Donald Trump. While speaking during a masterclass at the Locarno Film Festival in Switzerland on Friday, August 8, Thompson alleged that Trump once asked her on a date. “A phone ra…",
    "link": "https://www.usmagazine.com/celebrity-news/news/emma-thompson-recounts-donald-trump-asking-her-out-on-a-date/#article",
    "timestamp": "2025-08-09T19:49:24Z"
  },
  {
    "title": "Ned Ryun: Trump Is Showing Republicans What You Do With Power, Send The Democrats Into The Political Wilderness",
    "description": "American Majority CEO Ned Ryun told FOX News host Jesse Watters on Friday's \"Jesse Watters Primetime\" that Democrats have been gerrymandering Republicans out of blue states, and it is time the Republicans started doing exactly what their opponents have been d…",
    "link": "https://www.realclearpolitics.com/video/2025/08/09/ned_ryun_trump_is_showing_republicans_what_you_do_with_power_send_the_democrats_into_the_political_wilderness.html",
    "timestamp": "2025-08-09T19:47:49Z"
  },
  {
    "title": "Trump Executive Order Opens Up a Whole New World of Possibilities for Your 401(k)",
    "description": "Americans who manage their 401(k) accounts could have a world of new options due to President Donald Trump's latest order.",
    "link": "https://www.westernjournal.com/trump-executive-order-opens-whole-new-world-possibilities-401k/",
    "timestamp": "2025-08-09T19:38:36Z"
  },
  {
    "title": "‘Trump 2028’: Azerbaijan Pres Talking 3rd Term With Trump Goes Viral as Bannon Declares ‘Told Ya’",
    "description": "When Donald Trump said many people want him to run again in 2028, the president of Azerbaijan said \"including us\" -- and that drew Steve Bannon into it.\nThe post ‘Trump 2028’: Azerbaijan Pres Talking 3rd Term With Trump Goes Viral as Bannon Declares ‘Told Ya’…",
    "link": "https://www.mediaite.com/politics/trump/trump-2028-azerbaijan-pres-talking-3rd-term-with-trump-goes-viral-as-bannon-declares-told-ya/",
    "timestamp": "2025-08-09T19:34:21Z"
  },
  {
    "title": "Zelenskyy rejects ceding land as key security officials meet",
    "description": "Ukrainian President Volodymyr Zelenskyy said Kyiv won’t cede territory to bring an end to war as European and American security advisers met in the U.K. in advance of a key U.S.-Russia summit. President Donald Trump announced Friday that he’ll meet Russian Pr…",
    "link": "https://www.bostonherald.com/2025/08/09/zelenskyy-rejects-ceding-land-as-key-security-officials-meet/",
    "timestamp": "2025-08-09T19:31:35Z"
  },
  {
    "title": "Meghan McCain Taunts Andrew Cuomo As 'Out Of Touch Loser'",
    "description": "The former \"View\" host swiped at the ex-New York governor and accused sexual harasser after he made a boastful post on social media.",
    "link": "https://www.huffpost.com/entry/meghan-mccain-taunts-andrew-cuomo-as-out-of-touch-loser_n_689774c5e4b041ecaf5054dc",
    "timestamp": "2025-08-09T19:27:28Z"
  },
  {
    "title": "Nearly 100 Children Dead From Malnutrition in Gaza—Health Ministry",
    "description": "After 22-months of war, nearly 100 children have died from malnutrition-related causes, the Gaza Health Ministry reported.",
    "link": "https://www.newsweek.com/nearly-100-children-dead-malnutrition-gazahealth-ministry-2111286",
    "timestamp": "2025-08-09T19:25:23Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve said Saturday that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.nbcnews.com/business/business-news/federal-reserve-official-dour-jobs-data-backs-3-rate-cut-rcna224078",
    "timestamp": "2025-08-09T19:25:18Z"
  },
  {
    "title": "Who are Premier League title favourites: Liverpool, Arsenal, Man City, Utd?",
    "description": "Liverpool stormed the Premier League last season - can anyone stop them from claiming a record 21st title?",
    "link": "https://www.aljazeera.com/sports/2025/8/9/who-are-premier-league-title-favourites-liverpool-arsenal-man-city-utd",
    "timestamp": "2025-08-09T19:21:32Z"
  },
  {
    "title": "‘Fox & Friends Weekend’ Celebrates Gutfeld’s Fallon Interview as Start of a New Era: ‘Let’s Just All Get Along’ | Video",
    "description": "“It seems like he’s seeing what happened to Stephen Colbert ... people are exhausted of all the in-fighting,” Rachel Campos-Duffy says\nThe post ‘Fox & Friends Weekend’ Celebrates Gutfeld’s Fallon Interview as Start of a New Era: ‘Let’s Just All Get Along’ | V…",
    "link": "https://www.thewrap.com/fox-and-friends-weekend-gutfeld-jimmy-fallon-interview/",
    "timestamp": "2025-08-09T19:19:00Z"
  },
  {
    "title": "Around $30-35 billion of India’s merchandise exports to America at risk from Trump’s tariffs, says UBS Chief India Economist",
    "description": "According to UBS’ Chief India Economist Tanvee Gupta Jain, India may not lose much if it shifts away from cheaper Russian oil as the annual savings right now is only $2 billion",
    "link": "https://indianexpress.com/article/business/economy/around-30-35-billion-of-indias-merchandise-exports-to-america-at-risk-from-trumps-tariffs-says-ubs-chief-india-economist-10180149/",
    "timestamp": "2025-08-09T19:16:22Z"
  },
  {
    "title": "GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts to Vaccine Funding",
    "description": "Sen. Bill Cassidy (R-LA) criticized Health and Human Services (HHS) Secretary Robert F. Kennedy’s decision to cut vaccine funding months after being a key",
    "link": "https://www.newsbreak.com/share/4161769551554-gop-senator-bill-cassidy-who-was-key-vote-to-confirm-rfk-jr-blasts-health-honcho-for-massive-cuts-to-vaccine-funding?s=a2&amp;share_destination_id=MjAzODgwMjUwLTE3NTQ3NjY3MDQ5NjA%3D&amp;pd=0DnSZ895&amp;hl=en_US&amp;send_time=1754766704&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q3-v1%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_model_exp_25q3-v8%2Cns_foryou_rank_exp_25q3-v7",
    "timestamp": "2025-08-09T19:14:42Z"
  },
  {
    "title": "Bass on Trump Criticizing Her on Permits: He Doesn't Know What He's Talking About, But There Are 'Problems All Over'",
    "description": "During an interview aired on Friday’s broadcast of “The Issue Is,” Los Angeles Mayor Karen Bass stated that President Donald Trump “has no clue about what he is talking about” when he criticizes her on permitting, but “there [are] problems\nThe post Bass on Tr…",
    "link": "https://www.breitbart.com/clips/2025/08/09/bass-on-trump-criticizing-her-on-permits-he-doesnt-know-what-hes-talking-about-but-there-are-problems-all-over/",
    "timestamp": "2025-08-09T19:14:14Z"
  },
  {
    "title": "Top Vaccine Regulator Rehired at FDA After Laura Loomer Dubbed Him A ‘Trump-Hating Bernie Bro’",
    "description": "Dr. Vinay Prasad was rehired as the FDA's top vaccine regulator less than two weeks after stepping down amidst pressure from the White House and Laura Loomer.\nThe post Top Vaccine Regulator Rehired at FDA After Laura Loomer Dubbed Him A ‘Trump-Hating Bernie B…",
    "link": "https://www.mediaite.com/politics/top-vaccine-regulator-rehired-at-fda-after-laura-loomer-dubbed-him-a-trump-hating-bernie-bro/",
    "timestamp": "2025-08-09T19:13:46Z"
  },
  {
    "title": "Trump made his MAGA Fed pick. His next choice will be far more consequential",
    "description": "President Donald Trump recently nominated one of his economic advisers to the Federal Reserve’s top ranks, but his next choice will be far more consequential. Plans for picking the next Fed chair are already taking shape.\nTrump on Thursday nominated White Hou…",
    "link": "https://biztoc.com/x/5885f66d0a1b62a6",
    "timestamp": "2025-08-09T19:05:00Z"
  },
  {
    "title": "Top Fed official says weak jobs data backs the case for 3 rate cuts",
    "description": "Michelle Bowman was one of two Fed officials who voted for interest rate cuts.",
    "link": "https://abcnews.go.com/Business/wireStory/top-federal-reserve-official-dour-jobs-data-backs-124512442",
    "timestamp": "2025-08-09T19:03:31Z"
  },
  {
    "title": "Candace Owens, Abandoned By Trump, Is Just Really Upset Right Now",
    "description": "Owens is being sued for claiming Brigitte Macron 'has a penis' and Trump doesn't even care.",
    "link": "https://www.wonkette.com/p/candace-owens-abandoned-by-trump",
    "timestamp": "2025-08-09T19:00:40Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "London police arrest more than 360 protesters, call for the inclusion of Ukraine in Trump-Putin talks, and man arrested in connection with fire at Conor McGregor’s Drimnagh pub.",
    "link": "https://www.thejournal.ie/news-fix-09-08-25-6786767-Aug2025/",
    "timestamp": "2025-08-09T19:00:18Z"
  },
  {
    "title": "Chris Hedges: The Gaza Riviera",
    "description": "This article is read by Eunice Wong, a Juilliard-trained actor, featured on Audible’s list of Best Women Narrators. Her work is on the annual Best Audiobooks lists of the New York Times, Audible, AudioFile, & Library Journal. www.eunicewong.actor Text origina…",
    "link": "https://www.activistpost.com/chris-hedges-the-gaza-riviera/",
    "timestamp": "2025-08-09T19:00:00Z"
  },
  {
    "title": "Oscar-winning actress says Trump once asked her on a date: ‘I could have changed the course of American histo - Syracuse.com",
    "description": "Oscar-winning actress says Trump once asked her on a date: ‘I could have changed the course of American histoSyracuse.com Emma Thompson Says Donald Trump Asked Her Out on a DateVariety Emma Thompson on Getting a “Stalking” Call From Donald Trump and Why ‘Harr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178626864",
    "timestamp": "2025-08-09T18:54:27Z"
  },
  {
    "title": "Putin will meet Trump as a ‘fiscal crunch’ is about to hit Russia’s war machine",
    "description": "Russian President Vladimir Putin will meet U.S. President Donald Trump in Alaska on Aug. 15 to discuss ending Moscow’s war on Ukraine. Meanwhile, Russia’s economy continues to feel the strain of Western sanctions and high interest rates. The Kremlin also face…",
    "link": "https://biztoc.com/x/8d0d8513587498b6",
    "timestamp": "2025-08-09T18:53:43Z"
  },
  {
    "title": "Dr. Phil Defends ICE Raids After Bill Maher Calls Him Out",
    "description": "The “Real Time” host was joined Friday by the former TV therapist and ESPN’s Stephen A. Smith.",
    "link": "https://www.huffpost.com/entry/dr-phil-bill-maher-ice-raids-trumps_n_689788ece4b041ecaf5056c9",
    "timestamp": "2025-08-09T18:50:13Z"
  },
  {
    "title": "\"Not after Hitler and Stalin\"?",
    "description": "The unmentionable odour of death / Offends the September night ... Defenceless under the night / Our world in stupor lies. So wrote a psychically numbed W.H. Auden, 1939. A quarter-century later he seemed to believe that once-stuporous humanity had, however, …",
    "link": "https://www.pmcarpenter.com/post/not-after-hitler-and-stalin",
    "timestamp": "2025-08-09T18:46:49Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.clickorlando.com/news/politics/2025/08/09/a-top-federal-reserve-official-says-dour-jobs-data-backs-the-case-for-3-rate-cuts/",
    "timestamp": "2025-08-09T18:45:08Z"
  },
  {
    "title": "Stephen A. Smith Reveals Possible Presidential Campaign: 'I Haven't Ruled It Out'",
    "description": "Stephen A. Smith is considering all of his career options. While on a recent episode of Real Time with Bill Maher, the 57-year-old NBA analyst shared an update on his potential future in politics. Following the 2024 election, Stephen has been openly critical …",
    "link": "https://www.justjared.com/2025/08/09/stephen-a-smith-reveals-possible-presidential-campaign-i-havent-ruled-it-out/",
    "timestamp": "2025-08-09T18:43:28Z"
  },
  {
    "title": "Why Trump's Tariffs Hit Poor Countries With Higher Rates Than Rich Ones",
    "description": "The tariff policies of Donald Trump‘s administration have been found to disproportionately affect less affluent nations, a stark contrast to the special trading privileges these countries have enjoyed for years from wealthy nations like the U.S.\nWhat Happened…",
    "link": "https://biztoc.com/x/2928cf5260ddf785",
    "timestamp": "2025-08-09T18:42:24Z"
  },
  {
    "title": "Putin will meet Trump as a ‘fiscal crunch’ is about to hit Russia’s war machine",
    "description": "\"Though that may not be enough to compel Putin to seek peace, it does suggest that the walls are closing in on him.\"",
    "link": "https://fortune.com/2025/08/09/russia-economy-fiscal-deficit-trump-putin-meeting-alaska-ukraine-war/",
    "timestamp": "2025-08-09T18:40:13Z"
  },
  {
    "title": "Statue of volunteer firefighter slain during attack on Trump in Pa. placed at the site",
    "description": "A bronze statue of a man who lost his life during an attempted assassination of Donald Trump during a campaign rally in western Pennsylvania in July 2024 has been placed at the site. Corey Comperatore, 50, a volunteer firefighter and former chief, was shot an…",
    "link": "https://freerepublic.com/focus/f-news/4333638/posts",
    "timestamp": "2025-08-09T18:39:06Z"
  },
  {
    "title": "Ousted FDA regulator targeted by Laura Loomer gets job back",
    "description": "Vinay Prasad, the FDA’s top vaccine and gene therapy regulator, was the target of a right-wing pressure campaign over his handling of drug approvals and past support for Democrats.A top Food and Drug Administration official is getting his job back, a spokesma…",
    "link": "https://freerepublic.com/focus/f-chat/4333637/posts",
    "timestamp": "2025-08-09T18:39:00Z"
  },
  {
    "title": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts",
    "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.",
    "link": "https://www.clickondetroit.com/news/politics/2025/08/09/a-top-federal-reserve-official-says-dour-jobs-data-backs-the-case-for-3-rate-cuts/",
    "timestamp": "2025-08-09T18:35:36Z"
  },
  {
    "title": "Iran and Russia stand to lose from US deal with Azerbaijan and Armenia - The Guardian",
    "description": "Iran and Russia stand to lose from US deal with Azerbaijan and ArmeniaThe Guardian President Trump Brokers Another Historic Peace DealThe White House (.gov) Iran threatens planned Trump corridor envisaged by Azerbaijan-Armenia peace dealReuters Donald Trump b…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178626714",
    "timestamp": "2025-08-09T18:35:06Z"
  },
  {
    "title": "Palestinian-American mediator cuts ties with US negotiating team",
    "description": "Dr. Bishara Bahbah, a mediator close to President Trump, says Israel and US left Doha talks too soon, claims gaps with Hamas were bridgeable and will now work independently.",
    "link": "https://www.israelnationalnews.com/news/412994",
    "timestamp": "2025-08-09T18:34:48Z"
  },
  {
    "title": "Donald Trump Is Mostly a Crypto Billionaire Now, Group Says",
    "description": "President Donald Trump’s jaunt to Scotland, where he met the U.K. prime minister and cut a ribbon for a new Trump golf course, highlighted his love for old-money ambiance and mixing personal with official business.\nThe traditional business ventures like golf …",
    "link": "https://biztoc.com/x/91b4b1a90922ec8e",
    "timestamp": "2025-08-09T18:31:46Z"
  },
  {
    "title": "Netanyahu praises Trump for Armenia-Azerbeijan deal",
    "description": "Israeli Prime Minister Benjamin Netanyahu congratulated United States President Donald Trump for his role in brokering the peace deal between Armenia and Azerbaijan, commending him for his \"bold leade...",
    "link": "https://biztoc.com/x/986cd19000db1770",
    "timestamp": "2025-08-09T18:31:31Z"
  }
]