[
  {
    "title": "Trump: No plans to meet Carney during trip",
    "description": "United States President Donald Trump told reporters, while boarding Air Force One for his Asia trip, that he had no plans to meet with Canadian Prime Minister Mark Carney.\"No, I don’t have any plan to...",
    "link": "https://biztoc.com/x/f7318c258dbb4f33",
    "timestamp": "2025-10-25T05:47:54Z"
  },
  {
    "title": "Psychologist Warns of Donald Trump’s ‘Massive Cognitive Decline’ Amid White House Claims of Good Health - NewsBreak",
    "description": "President Donald Trump’s cognitive and physical health has been a significant topic of discussion ever since he returned to office for his second term in J",
    "link": "https://www.newsbreak.com/share/4309447416300-psychologist-warns-of-donald-trump-s-massive-cognitive-decline-amid-white-house-claims-of-good-health?_f=app_share&amp;pd=0FABcCpH&amp;lang=en_US&amp;send_time=1761370613&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.42.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control&amp;s=i2",
    "timestamp": "2025-10-25T05:39:05Z"
  },
  {
    "title": "Gold set to end nine-week winning streak",
    "description": "Gold prices pared losses on Friday after slightly softer-than-expected US inflation data reinforced expectations that the Federal Reserve will cut interest rates next week, but the metal was still set for its first weekly loss in 10 weeks.",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-set-to-end-nine-week-winning-streak/article70200749.ece",
    "timestamp": "2025-10-25T05:38:32Z"
  },
  {
    "title": "New York AG Letitia James Pleads Not Guilty In Mortgage Fraud Case: 'This Is Not About...'",
    "description": "On Friday, New York Attorney General Letitia James entered a “not guilty” plea in a federal mortgage fraud case she and critics say is politically motivated, with trial set for Jan. 26, 2026.\n‘Weaponized' Justice System, James Says\nJames, a longtime political…",
    "link": "https://biztoc.com/x/f329b9462d73d538",
    "timestamp": "2025-10-25T05:36:55Z"
  },
  {
    "title": "'They played dirty, I can play dirtier': Trump blasts Canada, won’t meet Carney over Reagan ad",
    "description": "President Trump canceled trade negotiations with Canada, citing a \"dishonest\" advertisement by the Ontario provincial government featuring Ronald Reagan criticizing tariffs. Trump accused Canada of fraudulently using the ad to interfere with U.S. court decisi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/they-played-dirty-i-can-play-dirtier-trump-blasts-canada-wont-meet-carney-over-reagan-ad/articleshow/124799823.cms",
    "timestamp": "2025-10-25T05:36:15Z"
  },
  {
    "title": "As Argentina votes, Javier Milei face political headwinds",
    "description": "Argentina's libertarian president took office in 2023 with promises to turn the highly indebted country around and stabilize the economy. But ahead of Sunday's parliamentary election, his achievements are mixed. In late summer, Marcela Pagano — a member of pa…",
    "link": "https://www.dw.com/en/as-argentina-votes-javier-milei-face-political-headwinds/a-74488883",
    "timestamp": "2025-10-25T05:27:00Z"
  },
  {
    "title": "Donald Trump To Meet North Korean Leader Kim Jong Un? Here's What A US Official Said",
    "description": "US President Donald Trump is not scheduled to meet North Korean leader Kim Jong Un while in South Korea next week, a senior US official said on October 24. This comes despite speculation about a potential encounter during the US president’s tour of Asia. The …",
    "link": "https://www.ndtvprofit.com/world/donald-trump-to-meet-north-korean-leader-kim-jong-un-heres-what-a-us-official-said",
    "timestamp": "2025-10-25T05:24:43Z"
  },
  {
    "title": "Trump blasts 'dirty play' by Ontario in waiting to pause Reagan trade ad after World Series",
    "description": "President Donald Trump late Friday blasted the Ontario provincial government in Canada for waiting until after the first two games of the World Series to pause a television ad featuring former President Ronald Reagan criticizing tariffs. \"They could have pull…",
    "link": "https://freerepublic.com/focus/f-news/4348511/posts",
    "timestamp": "2025-10-25T05:10:36Z"
  },
  {
    "title": "Brazil holds a rare hand in Trump’s tariff game",
    "description": "Brazil possesses the world's second-largest rare earth mineral reserves, a critical resource for advanced technologies, offering a potential bargaining chip in tariff negotiations with the United States. With China dominating production, Brazil sees a converg…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brazil-holds-a-rare-hand-in-trumps-tariff-game/articleshow/124799547.cms",
    "timestamp": "2025-10-25T05:09:46Z"
  },
  {
    "title": "More anti-abortion pregnancy centers offer medical services as clinics close",
    "description": "More anti-abortion pregnancy centers have been offering medical services such as testing for sexually transmitted infections. With coming changes to Medicaid, more women are expected to be uninsured or lack access to clinics. And more could seek care from the…",
    "link": "https://apnews.com/article/abortion-pregnancy-centers-crisis-medicaid-913614d7622a67af17cdf24339e8e700",
    "timestamp": "2025-10-25T05:06:24Z"
  },
  {
    "title": "Police will bar gatherings at Ampang Park on Oct 26 due to ongoing summit, says KL top cop",
    "description": "KUALA LUMPUR: The police will block any attempts to hold rallies or gatherings at Ampang Park on Sunday (Oct 26), says Comm Datuk Fadil Marsus. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/25/police-will-bar-gatherings-at-ampang-park-on-oct-26-due-to-ongoing-summit-says-kl-top-cop",
    "timestamp": "2025-10-25T05:06:00Z"
  },
  {
    "title": "US dollar makes modest weekly gain after soft inflation data",
    "description": "US inflation eased more than anticipated in September, fueling hopes for Federal Reserve rate cuts.  Meanwhile, trade talks between the US and Canada hit a snag, though focus shifts to an upcoming Trump-Xi meeting.  Oil prices climbed on new US sanctions, imp…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-makes-modest-weekly-gain-after-soft-inflation-data/articleshow/124799489.cms",
    "timestamp": "2025-10-25T05:04:06Z"
  },
  {
    "title": "This week Aldi unveiled a puffer jacket that looks like a giant potato",
    "description": "This week on Dezeen, we showcased supermarket chain Aldi's Jacket Potato Jacket, a puffer jacket complete with a silver foil poncho as an ode to steaming baked potatoes. Described by Aldi as \"comfort food chic\", the limited-edition jacket was designed in coll…",
    "link": "https://www.dezeen.com/2025/10/25/aldi-puffer-coat-giant-jacket-potato-this-week/",
    "timestamp": "2025-10-25T05:00:15Z"
  },
  {
    "title": "Coalition of the Willing aims to force Putin to negotiate",
    "description": "RTÉ's London Correspondent Tommy Meskill looks back at an eventful meeting of the \"Coalition of the Willing\" which saw British Prime Minister Keir Starmer urge countries to provide Ukraine with long range missiles.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/1025/1540510-ukraine-uk-analysis/",
    "timestamp": "2025-10-25T05:00:01Z"
  },
  {
    "title": "Oil slips on skepticism about US commitment to Russian oil sanctions",
    "description": "Oil prices dipped Friday amid doubts about US sanctions on Russia's top oil firms. Brent and US crude futures saw declines after initial gains. These sanctions aim to pressure Russia over the Ukraine war. Chinese and Indian refiners are expected to reduce Rus…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/oil-slips-on-skepticism-about-us-commitment-to-russian-oil-sanctions/articleshow/124799423.cms",
    "timestamp": "2025-10-25T04:59:18Z"
  },
  {
    "title": "Gold trims losses after US inflation data; set to end nine-week win streak",
    "description": "Gold prices saw a dip on Friday, recovering slightly after U.S. inflation data eased. This eased concerns about interest rate hikes by the Federal Reserve. However, gold is still heading for its first weekly decline in ten weeks. Investors are booking profits…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-trims-losses-after-us-inflation-data-set-to-end-nine-week-win-streak/articleshow/124799354.cms",
    "timestamp": "2025-10-25T04:55:09Z"
  },
  {
    "title": "US and China begin trade talks in Malaysia to ease tensions",
    "description": "KUALA LUMPUR: US and Chinese officials kicked off a new round of talks aimed at defusing a standoff between the world's two largest economies before an upcoming leaders' summit. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/10/25/us-and-china-begin-trade-talks-in-malaysia-to-ease-tensions",
    "timestamp": "2025-10-25T04:54:00Z"
  },
  {
    "title": "Where Trump is headed in Asia, and what each country wants from him",
    "description": "In a landmark journey across Asia, President Donald Trump is set to tour Malaysia, Japan, and South Korea, culminating in a significant dialogue with China's Xi Jinping. His mission? To unlock lucrative trade opportunities and reinforce US presence in a regio…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/where-trump-is-headed-in-asia-and-what-each-country-wants-from-him/articleshow/124799344.cms",
    "timestamp": "2025-10-25T04:53:58Z"
  },
  {
    "title": "Europe fights to avoid being sidelined by Trump’s world-shaping plans",
    "description": "Donald Trump has seized a central role on the global stage, leaving European allies on the sidelines",
    "link": "https://abcnews.go.com/International/wireStory/europe-fights-avoid-sidelined-trumps-world-shaping-plans-126855901",
    "timestamp": "2025-10-25T04:53:49Z"
  },
  {
    "title": "Javier Milei weakened as critical Argentinian elections approach",
    "description": "US support has helped calm markets but political and economic missteps have left Argentina’s president vulnerable in advance of midterm elections",
    "link": "https://www.irishtimes.com/world/americas/2025/10/25/javier-milei-weakened-as-critical-argentinian-elections-approach/",
    "timestamp": "2025-10-25T04:53:00Z"
  },
  {
    "title": "Trump hopes China can help end Russia-Ukraine war",
    "description": "United States President Donald Trump told reporters that he hoped China could aid the US in settling the Russia-Ukraine war.\"We want China to help us out on Russia,\" Trump said, while boarding Air For...",
    "link": "https://biztoc.com/x/e95dda0a38ec2215",
    "timestamp": "2025-10-25T04:52:47Z"
  },
  {
    "title": "European shares close at record high on US inflation data, trade hopes",
    "description": "European stock markets reached a new peak on Friday. This surge was fueled by lower than anticipated U.S. inflation figures. Hopes for reduced trade friction between the U.S. and China also contributed to the positive sentiment. Investors reacted to a series …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-close-at-record-high-on-us-inflation-data-trade-hopes/articleshow/124799319.cms",
    "timestamp": "2025-10-25T04:52:15Z"
  },
  {
    "title": "What military force has the US positioned off Venezuela’s coast?",
    "description": "The US has attacked several Venezuelan boats and deployed its largest military buildup in Latin America in decades.",
    "link": "https://www.aljazeera.com/news/2025/10/25/what-military-force-has-the-us-positioned-off-venezuelas-coast",
    "timestamp": "2025-10-25T04:51:17Z"
  },
  {
    "title": "Trump wants China’s hand in solving his Russia problem",
    "description": "President Trump seeks China's assistance in managing strained US-Russia relations during his upcoming Asia trip. The visit, marked by trade disputes and regional tensions, includes potential talks with Chinese President Xi Jinping. Trump aims to secure trade …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-he-wants-china-to-help-us-out-on-russia/articleshow/124799289.cms",
    "timestamp": "2025-10-25T04:49:40Z"
  },
  {
    "title": "Global stocks jump after US inflation data; US dollar nearly flat",
    "description": "Friday brought significant gains to the Indian stock market, echoing the record-breaking performance of major U.S. stock indexes. The catalyst? Lower-than-expected inflation data that sparked fresh hopes for interest rate reductions by the Federal Reserve. Co…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-jump-after-us-inflation-data-us-dollar-nearly-flat/articleshow/124799288.cms",
    "timestamp": "2025-10-25T04:49:30Z"
  },
  {
    "title": "Ontario will pull ads that triggered Trump in order to restart trade talks, Ford says",
    "description": "OTTAWA — Ontario is hitting pause on its short-lived anti-tariff television ad campaign in the United States on Monday so that Canada-U.S. trade talks can resume, Ontario Premier Doug Ford said Friday. Ford said he decided to pull the plug on the campaign aft…",
    "link": "https://financialpost.com/pmn/ontario-will-pull-ads-that-triggered-trump-in-order-to-restart-trade-talks-ford-says-3",
    "timestamp": "2025-10-25T04:48:32Z"
  },
  {
    "title": "Takaichi to make diplomatic debut at ASEAN summit in Malaysia",
    "description": "Japan's new leader will also hold a high-profile summit with U.S. President Donald Trump in Tokyo and then travel to South Korea for APEC meetings.",
    "link": "https://www.japantimes.co.jp/news/2025/10/25/japan/politics/takaichi-diplomatic-debut-asean-trump/",
    "timestamp": "2025-10-25T04:42:00Z"
  },
  {
    "title": "US stocks hit record high after soft CPI, led by tech mega-cap gains",
    "description": "US stocks closed at a new high on Friday, as traders cheered softer-than-anticipated inflation data that underpinned expectations for Federal Reserve interest-rate cuts. Technology giants including Nvidia Corp, Apple Inc and Broadcom Inc led gains in the S&P …",
    "link": "https://www.bloomberg.com/news/articles/2025-10-24/s-p-500-rallies-after-soft-cpi-intel-soars-on-healthy-earnings",
    "timestamp": "2025-10-25T04:40:42Z"
  },
  {
    "title": "US sanctions Colombian president",
    "description": "The US Treasury has sanctioned Gustavo Petro over allegedly enabling drug cartels Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626944-us-sanctions-colombian-president/",
    "timestamp": "2025-10-25T04:39:18Z"
  },
  {
    "title": "Trump heads to 3-country sprint in Asia, meeting with Xi as government shutdown drags on at home",
    "description": "President Trump headed for Asia Friday night for the first time this term, a trip where he’s expected to work on investment deals and peace efforts before meeting face-to-face with Chinese President Xi Jinping to try to de-escalate a trade war.",
    "link": "https://nypost.com/2025/10/25/world-news/trump-heads-to-3-country-sprint-in-asia-meeting-with-xi-as-government-shutdown-drags-on-at-home/",
    "timestamp": "2025-10-25T04:39:02Z"
  },
  {
    "title": "Trump aims to clinch deal with China's Xi during Asia trip",
    "description": "US President Donald Trump's five-day trip spans Malaysia, Japan and South Korea.",
    "link": "https://www.channelnewsasia.com/world/trump-asia-tour-deals-china-japan-south-korea-asean-5424481",
    "timestamp": "2025-10-25T04:38:00Z"
  },
  {
    "title": "Justice Department to monitor polling sites in six counties in California and New Jersey | CNN Politics",
    "description": "The Justice Department announced today it will monitor polling sites in six counties in California and New Jersey ahead of November 4 elections, as voters prepare to cast their ballots in less than two weeks.",
    "link": "https://www.cnn.com/2025/10/24/politics/doj-monitor-polling-sites-california-new-jersey",
    "timestamp": "2025-10-25T04:34:12Z"
  },
  {
    "title": "‘People are homeless and this moron is spending money on this’ – tourists not impressed by Trump’s White House revamp work",
    "description": "With many Washington tourist spots closed due to the US government shutdown, some visitors instead are checking out an unexpected and divisive new attraction in the nation’s capital: President Donald Trump’s surprise demolition of the White House’s East Wing.",
    "link": "https://www.independent.ie/world-news/north-america/people-are-homeless-and-this-moron-is-spending-money-on-this-tourists-not-impressed-by-trumps-white-house-revamp-work/a1357478793.html",
    "timestamp": "2025-10-25T04:30:00Z"
  },
  {
    "title": "Canadian prime minister ready to resume trade talks halted by Donald Trump over Reagan ad",
    "description": "Prime minister Mark Carney said yesterday Canada stands ready to resume trade talks with the United States that president Donald Trump halted over an anti-tariff advertisement issued by Ontario’s provincial government.",
    "link": "https://www.independent.ie/world-news/north-america/canadian-prime-minister-ready-to-resume-trade-talks-halted-by-donald-trump-over-reagan-ad/a751992855.html",
    "timestamp": "2025-10-25T04:30:00Z"
  },
  {
    "title": "Letters: Rioters should be made to face the people they set out to frighten and intimidate",
    "description": "There is no doubt that there is a deep sore of immigrant hate festering within the body politic that erupts and spews out its hate-filled venom whenever an international protection applicant is alleged to have been involved in an assault against any person.",
    "link": "https://www.independent.ie/irish-news/presidential-election/letters-rioters-should-be-made-to-face-the-people-they-set-out-to-frighten-and-intimidate/a1701142861.html",
    "timestamp": "2025-10-25T04:30:00Z"
  },
  {
    "title": "Trump says he's willing to reduce tariffs on Brazil in right circumstances",
    "description": "US President Donald Trump said Friday he would consider reducing tariffs on Brazil “under the right circumstances.” Speaking aboard Air Force One en route to Malaysia for a regional summit, Trump’s remarks hinted at potential trade flexibility amid ongoing ne…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-hes-willing-to-reduce-tariffs-on-brazil-in-right-circumstances/articleshow/124798977.cms",
    "timestamp": "2025-10-25T04:27:02Z"
  },
  {
    "title": "Thailand's former queen Sirikit dies age 93",
    "description": "Thailand's former Queen Sirikit, the mother of the current King Vajiralongkorn and wife of the nation's longest-reigning monarch, has died at the age of 93, the palace said.",
    "link": "https://www.rte.ie/news/asia/2025/1025/1540511-thai-queen-death/",
    "timestamp": "2025-10-25T04:24:17Z"
  },
  {
    "title": "America Ferrera Says It’s Time for Hollywood to ‘Stand Up and Use Our Voices’ Amid a Tense Political Climate | Video",
    "description": "\"Be as brave as the characters we write and as brave as the characters we play,\" the actress adds\nThe post America Ferrera Says It’s Time for Hollywood to ‘Stand Up and Use Our Voices’ Amid a Tense Political Climate | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/america-ferrera-message-for-hollywood-critics-choice-association-event/",
    "timestamp": "2025-10-25T04:16:22Z"
  },
  {
    "title": "More anti-abortion pregnancy centers offer medical services as Planned Parenthood clinics close",
    "description": "More anti-abortion pregnancy centers have been offering medical services such as testing for sexually transmitted infections",
    "link": "https://abcnews.go.com/US/wireStory/anti-abortion-pregnancy-centers-offer-medical-services-planned-126856060",
    "timestamp": "2025-10-25T04:14:50Z"
  },
  {
    "title": "US and China begin trade talks in Malaysia to ease tensions",
    "description": "US and Chinese officials kicked off a new round of talks aimed at defusing a standoff between the world’s two largest economies before an upcoming leaders’ summit.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-25/us-and-china-begin-trade-talks-in-malaysia-to-ease-tensions",
    "timestamp": "2025-10-25T04:13:37Z"
  },
  {
    "title": "Trump might ask China's Xi to release Jimmy Lai",
    "description": "United States President Donald Trump told reporters that he might ask Chinese President Xi Jinping to release Apple Daily founder Jimmy Lai Chee-ying.\"I have a lot of respect for Rick Scott and a lot ...",
    "link": "https://biztoc.com/x/8900491f0996bf02",
    "timestamp": "2025-10-25T04:08:12Z"
  },
  {
    "title": "Europe fights to avoid being sidelined by Trump’s world-shaping plans",
    "description": "When President Donald Trump took the stage in Egypt to hail the U.S.-brokered ceasefire deal between Israel and Hamas, a row of world leaders stood behind...",
    "link": "https://www.yahoo.com/news/articles/europe-fights-avoid-being-sidelined-040720561.html",
    "timestamp": "2025-10-25T04:07:20Z"
  },
  {
    "title": "Trump open to meeting North Korea’s Kim on Asia trip but nothing scheduled",
    "description": "Trump and Kim have both expressed an interest in meeting again, but a US official says meeting is 'not on the schedule'.",
    "link": "https://www.aljazeera.com/news/2025/10/25/trump-open-to-meeting-north-koreas-kim-on-asia-trip-but-nothing-scheduled",
    "timestamp": "2025-10-25T04:07:14Z"
  },
  {
    "title": "US, China seek to avoid trade war escalation, salvage Trump-Xi meeting in Malaysia talks",
    "description": "KUALA LUMPUR (Reuters) -Top economic officials from the U. and China kickstarted talks in Kuala Lumpur on Saturday to avert an escalation of their trade war ...",
    "link": "https://www.yahoo.com/news/articles/us-china-seek-avoid-trade-040644801.html",
    "timestamp": "2025-10-25T04:06:44Z"
  },
  {
    "title": "Peace in Gaza Depends on Palestinians’ Right to Remain — and Return",
    "description": "Trump's peace plan includes a promise not to expel any Palestinians from Gaza. Can't that promise be kept? By David Vine | ( Foreign Policy in Focus ) - Amid some extremely cautious optimism for peace following a tenuous and incomplete ceasefire in Gaza, any …",
    "link": "https://www.juancole.com/2025/10/depends-palestinians-remain.html",
    "timestamp": "2025-10-25T04:06:16Z"
  },
  {
    "title": "Japan's new leader faces diplomatic gauntlet with Trump, China and regional summits",
    "description": "Japan's new Prime Minister Sanae Takaichi faces significant foreign policy challenges just days after taking office",
    "link": "https://abcnews.go.com/US/wireStory/japans-new-leader-faces-diplomatic-gauntlet-trump-china-126854223",
    "timestamp": "2025-10-25T04:05:46Z"
  },
  {
    "title": "Podcasters are calling out Trump — will young male listeners follow suit?",
    "description": "Wildly popular podcasters such as Joe Rogan, Andrew Schulz and Theo Von have distanced themselves from the Trump administration in recent months.",
    "link": "https://www.abc.net.au/news/2025-10-25/popular-podcasters-calling-out-trump-male-listeners/105863690",
    "timestamp": "2025-10-25T04:02:00Z"
  },
  {
    "title": "Multiculturalism Is a Globalist Weapon and You’re Not Allowed To Protect Yourself",
    "description": "If you were alive to witness the events of 9/11, you probably remember the sudden emergence of the “Coexist” bumper stickers and t-shirts across the US after the tragedy. The intended message being that different cultures must be “tolerant” of each other and …",
    "link": "https://www.lewrockwell.com/2025/10/brandon-smith/multiculturalism-is-a-globalist-weapon-and-youre-not-allowed-to-protect-yourself/",
    "timestamp": "2025-10-25T04:01:00Z"
  },
  {
    "title": "Zcash Is The ‘Better Bitcoin’ Satoshi Couldn’t Build, Says Helius Labs CEO",
    "description": "Zcash’s sudden resurgence is not just another rotation, argues Helius CEO Mert Mumtaz; it is a re-centering of crypto on first principles of cryptography and user choice. In a wide-ranging conversation on Messari’s “Fully Diluted” (Oct. 23) with host Dylan Ba…",
    "link": "https://bitcoinist.com/zcash-better-bitcoin-satoshi-couldnt-build/",
    "timestamp": "2025-10-25T04:00:19Z"
  },
  {
    "title": "As a leader in finance, Mark Carney said climate action was critical. Where is that urgency now?",
    "description": "Mark Carney spent a decade as one of the most credible voices on climate action and the economy. Now as prime minister, he is scrapping emissions reductions policies, backing LNG projects and talking pipelines. As Canadians wait for details of his coming ‘cli…",
    "link": "https://www.cbc.ca/news/politics/carneyclimatecred-9.6950761",
    "timestamp": "2025-10-25T04:00:00Z"
  },
  {
    "title": "No Kings: Democrats against the republic",
    "description": "True or false:\r\n\r\nDemocrats aren’t protecting democracy; they’re protesting our republic. True\r\n\r\nDemocrats aren’t protesting a king; they’re protesting a fair election. True.\r\n\r\nMany, if not most, protesters have no...",
    "link": "https://www.americanthinker.com/blog/2025/10/no_kings_democrats_against_the_republic.html",
    "timestamp": "2025-10-25T04:00:00Z"
  },
  {
    "title": "Of kings and monarchs",
    "description": "“In the country of the blind, the one-eyed man is king.” — Desiderius Erasmus\r\n\r\n“Common sense is not so common.” — Voltaire\r\n\r\nSome eighty-odd years ago, a man named Joseph Goebbels proved to the entire world that...",
    "link": "https://www.americanthinker.com/blog/2025/10/of_kings_and_monarchs.html",
    "timestamp": "2025-10-25T04:00:00Z"
  },
  {
    "title": "Will Senator Graham stay for his jubilee term?",
    "description": "There is almost a year left before the U.S. Senate elections, but electoral races in some states seem to have already begun. A serious struggle is flaring up in South Carolina represented by Lindsey Graham since 2003. Republicans Mark Lynch...",
    "link": "https://www.americanthinker.com/blog/2025/10/will_senator_graham_stay_for_his_jubilee_term.html",
    "timestamp": "2025-10-25T04:00:00Z"
  },
  {
    "title": "Trump: No plan to call ballroom after himself",
    "description": "United States President Donald Trump told reporters that he had \"no plan\" to call his newly built White House ballroom after himself while he boarded Air Force One on his way to Kuala Lumpur, Malaysia...",
    "link": "https://biztoc.com/x/e73d1459715dea9c",
    "timestamp": "2025-10-25T03:57:14Z"
  },
  {
    "title": "Takaichi to make diplomatic debut at ASEAN summit in Malaysia",
    "description": "New Prime Minister Sanae Takaichi will also hold a high-profile summit with U.S. President Donald Trump in Tokyo and then travel to South Korea for APEC meetings.",
    "link": "https://www.japantimes.co.jp/news/2025/10/25/japan/politics/takaichi-diplomatic-debut-asean/",
    "timestamp": "2025-10-25T03:56:00Z"
  },
  {
    "title": "US Sanctions Colombia President After Drug Trafficking Claim",
    "description": "President Donald Trump sanctioned Colombia’s leader and members of his inner circle for allegedly enabling drug trafficking, personally targeting an ideological foe and frequent critic of US policy. The measures announced Friday by the US Treasury Department’…",
    "link": "https://www.ndtvprofit.com/world/us-sanctions-colombia-president-after-drug-trafficking-claim",
    "timestamp": "2025-10-25T03:53:11Z"
  },
  {
    "title": "Traders’ guide to what to expect ahead of Trump’s Asia trip and Xi meeting",
    "description": "A successful Trump-Xi meeting, as predicted by the US president, will inject calm into global markets and likely revive appetite for risk assets from Asian shares to regional currencies closely tied to China’s economy.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-25/trump-s-asia-trip-xi-meeting-what-to-expect-for-rare-earths-soybeans-taiwan",
    "timestamp": "2025-10-25T03:51:42Z"
  },
  {
    "title": "Trump heads for Asia and Xi trade talks",
    "description": "US President Donald Trump left on Friday for Asia and high-stakes trade talks with Chinese counterpart Xi Jinping -- adding that he would also like to meet...",
    "link": "https://www.yahoo.com/news/articles/trump-heads-asia-xi-talks-203202231.html",
    "timestamp": "2025-10-25T03:49:10Z"
  },
  {
    "title": "Heigh ho Silver! White metal crashes 17% in just 10 days",
    "description": "After reaching unprecedented heights, silver prices have nosedived 17%, a shift driven by increased availability in London and investors cashing in. Gold, too, shows signs of a subtle retreat. However, experts remain positive about the future of both metals, …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/heigh-ho-silver-white-metal-crashes-17-in-just-10-days/articleshow/124798578.cms",
    "timestamp": "2025-10-25T03:46:40Z"
  },
  {
    "title": "Abby Phillip Asks Scott Jennings if He’d Support a Third Trump Term: ‘Just to Get It on the Record, Scott…’",
    "description": "CNN's Abby Phillip felt compelled to make sure where Scott Jennings stands on the possibility of President Donald Trump attempting to run for an unconstitutional third term.\nThe post Abby Phillip Asks Scott Jennings if He’d Support a Third Trump Term: ‘Just t…",
    "link": "https://www.mediaite.com/media/tv/abby-phillip-asks-scott-jennings-if-hed-support-a-third-trump-term-just-to-get-it-on-the-record-scott/",
    "timestamp": "2025-10-25T03:45:39Z"
  },
  {
    "title": "Wall Street Week Ahead: Megacap-led earnings deluge, Fed meeting headline busy US markets week",
    "description": "A crucial week for the US stock rally unfolds with major tech earnings, a likely Federal Reserve rate cut, and escalating US-China trade tensions. Investors are keenly watching corporate results, particularly from tech giants, and the Fed's forward guidance. …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-megacap-led-earnings-deluge-fed-meeting-headline-busy-us-markets-week/articleshow/124798509.cms",
    "timestamp": "2025-10-25T03:39:38Z"
  },
  {
    "title": "US Slaps Sanctions on Colombia’s President Gustavo Petro",
    "description": "The United States has imposed sanctions on Colombian President Gustavo Petro, his son Nicolas Petro, First Lady Veronica Alcocer and Interior Minister Armando Benedetti, the US Department of the Treasury’s Office of Foreign Assets Control (OFAC) said on Monda…",
    "link": "https://sputnikglobe.com/20251025/us-slaps-sanctions-on-colombias-president-gustavo-petro-1123011863.html",
    "timestamp": "2025-10-25T03:38:00Z"
  },
  {
    "title": "Newsom bails out Planned Parenthood with $140M to keep 100 clinics open after Trump cuts",
    "description": "California governor Gavin Newsom announces $140 million in state funding to keep 109 Planned Parenthood clinics open amid federal cuts and defunding efforts.",
    "link": "https://www.foxnews.com/politics/newsom-bails-out-planned-parenthood-140m-keep-100-clinics-open-after-trump-cuts",
    "timestamp": "2025-10-25T03:35:37Z"
  },
  {
    "title": "Traders Guide to What to Expect Ahead of Trump’s Asia Trip and Xi Meeting - Bloomberg.com",
    "description": "Traders Guide to What to Expect Ahead of Trump’s Asia Trip and Xi MeetingBloomberg.com ‘Throw of the iron dice’: Inside Trump’s most perilous foreign trip yetPolitico Trump will promote big investments in Japan and South Korea, but details are fuzzyPBS Trump …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179867104",
    "timestamp": "2025-10-25T03:32:51Z"
  },
  {
    "title": "Fetterman, McCormick Unite in Bipartisan Push to Reopen Government as Shutdown Hits Pennsylvania",
    "description": "Sen. John Fetterman (D-PA) and Sen. Dave McCormick (R-PA) appeared together in Washington, D.C., Thursday calling for an end to the government shutdown, emphasizing its growing impact on Pennsylvania families, workers, and federal employees.\nThe post Fetterma…",
    "link": "https://www.breitbart.com/politics/2025/10/24/fetterman-mccormick-unite-in-bipartisan-push-to-reopen-government-as-shutdown-hits-pennsylvania/",
    "timestamp": "2025-10-25T03:32:41Z"
  },
  {
    "title": "Stefanik Slams Jeffries’ ‘Commie Mamdani’ Endorsement: NYC Voters Will Reject ‘Jihadist, Antisemitic’ Agenda",
    "description": "House Republican Leadership Chairwoman Elise Stefanik (R-NY) unloaded Friday on House Minority Leader Hakeem Jeffries (D-NY) after he officially endorsed “jihadist communist” Zohran Mamdani for New York City mayor, declaring the decision will doom Democrats’ …",
    "link": "https://www.breitbart.com/politics/2025/10/24/stefanik-slams-jeffries-commie-mamdani-endorsement/",
    "timestamp": "2025-10-25T03:29:23Z"
  },
  {
    "title": "US, China seek to avoid trade war escalation, salvage Trump-Xi meeting in Malaysia talks",
    "description": "In a bid to smooth over trade tensions, key economic leaders from the United States and China have convened in Kuala Lumpur. Their discussions are essential as they pave the way for an anticipated summit between President Trump and President Xi.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-seek-to-avoid-trade-war-escalation-salvage-trump-xi-meeting-in-malaysia-talks/articleshow/124798350.cms",
    "timestamp": "2025-10-25T03:26:22Z"
  },
  {
    "title": "Thai PM cancels ASEAN trip after royal death, may miss ceasefire signing",
    "description": "Thailand's Prime Minister Anutin Charnvirakul has cancelled his trip to Malaysia. This is due to the passing of Queen Mother Sirikit. He may miss a crucial ceasefire deal signing with Cambodia. US President Donald Trump was set to witness this agreement. ASEA…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thai-pm-cancels-asean-trip-after-royal-death-may-miss-ceasefire-signing/articleshow/124798343.cms",
    "timestamp": "2025-10-25T03:25:57Z"
  },
  {
    "title": "Trump Is Rewriting History to Justify His Sketchy Pardon of a Crypto King",
    "description": "After Donald Trump pardoned a billionaire crypto king on Thursday, he claimed that Binance founder Changpeng Zhao was “persecuted” by Joe Biden’s Justice Department as part of what the White House called a “war on cryptocurrency.”\nOn one level, that assertion…",
    "link": "https://biztoc.com/x/36185e41d354345e",
    "timestamp": "2025-10-25T03:23:54Z"
  },
  {
    "title": "ASEAN summit: Trump's Asia return, East Timor's entry take spotlight in landmark meeting",
    "description": "Leaders are expected to focus on regional security, economic resilience and maritime disputes — with US tariffs and shifting global trade patterns looming large over discussions",
    "link": "https://www.thehindubusinessline.com/news/world/asean-summit-trumps-asia-return-east-timors-entry-take-spotlight-in-landmark-meeting/article70200601.ece",
    "timestamp": "2025-10-25T03:22:44Z"
  },
  {
    "title": "Trump travels to Asia amid government shutdown",
    "description": "Donald Trump departed for his five-day tour of Asian countries late Friday, his first time visiting the region since returning to the White House. Trump is expected to meet with Chinese leader Xi Jinping next week. US President Donald Trumphas departed for a …",
    "link": "https://www.dw.com/en/trump-travels-to-asia-amid-government-shutdown/a-74492721",
    "timestamp": "2025-10-25T03:22:00Z"
  },
  {
    "title": "‘Real Time’: Bill Maher Calls White House “Just A Building” After Trump Demolishes East Wing",
    "description": "As Donald Trump stirs up more national outrage over his demolition of the White House‘s East Wing, one of his favorite dinner guests is brushing off the controversy. On Friday’s episode of Real Time, Bill Maher gave a flippant response when guest panelist Mic…",
    "link": "http://deadline.com/2025/10/real-time-bill-maher-calls-white-house-just-building-1236596951/",
    "timestamp": "2025-10-25T03:19:16Z"
  },
  {
    "title": "Department of War receives $130 million from mystery donor to cover troop salaries during shutdown",
    "description": "President Trump announced the gift Thursday, telling supporters that “a friend” sent a check to make up for what he called a “Democrat shutdown.”",
    "link": "https://nypost.com/2025/10/24/us-news/department-of-war-receives-130-million-from-mystery-donor-to-pay-troops/",
    "timestamp": "2025-10-25T03:18:59Z"
  },
  {
    "title": "What does Trump really think about China? | Insiders On Background",
    "description": "Donald Trump has dismissed the prospect of China invading Taiwan. Australia's alliance with the US is deepening, so what does ...",
    "link": "https://biztoc.com/x/bf6c489ac856b615",
    "timestamp": "2025-10-25T03:18:31Z"
  },
  {
    "title": "Andy Beshear Defends Gavin Newsom After Bill Maher Claims the Trump Trolling Has ‘Jumped the Shark’",
    "description": "\"I think he is standing up. I think he's pushing back,\" the governor of Kentucky says\nThe post Andy Beshear Defends Gavin Newsom After Bill Maher Claims the Trump Trolling Has ‘Jumped the Shark’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/andy-beshear-defends-gavin-newsom-bill-maher-trump-trolling-comments/",
    "timestamp": "2025-10-25T03:17:17Z"
  },
  {
    "title": "Major Hollywood Union Says Paramount Taking over Warner Bros. Discovery Would Be a ‘Disaster’ as Trump Backs the Bid",
    "description": "The Hollywood writer’s union is raising the alarm over the possible merger between Warner Bros. Discovery and Paramount Skydance, saying that such a merger would be a “disaster,” but President Donald Trump says he is all for the plan. On Thursday, the Writers…",
    "link": "https://freerepublic.com/focus/f-chat/4348496/posts",
    "timestamp": "2025-10-25T03:10:38Z"
  },
  {
    "title": "DOJ to monitor elections in California, New Jersey as state officials blast move",
    "description": "The department will monitor elections at five sites in California and one in New Jersey ahead of elections in both states on Nov. 4, the agency announced...",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/24/department-of-justice-monitoring-elections-california-new-jersey/86888783007/",
    "timestamp": "2025-10-25T03:04:02Z"
  },
  {
    "title": "Ontario to continue Reagan tariffs ad this weekend, pause campaign after world series to resume US trade talks",
    "description": "Ontario is pausing its US $54 million anti-tariff advertising campaign. The ads featured former US President Ronald Reagan's speech. US President Donald Trump strongly opposed the campaign. He called off trade negotiations with Canada. Ontario's Premier Doug …",
    "link": "https://economictimes.indiatimes.com/news/international/us/ontario-to-continue-reagan-tariffs-ad-this-weekend-pause-campaign-after-world-series-to-resume-us-trade-talks/articleshow/124798095.cms",
    "timestamp": "2025-10-25T03:02:15Z"
  },
  {
    "title": "Maryland governor hints at special session to redraw congressional districts",
    "description": "Maryland Governor Wes Moore strongly hinted today that he is ready to call a special session of the General Assembly to redraw the state congressional districts. That move would flip Maryland’s lone Republican seat in Congress, currently held by Representativ…",
    "link": "https://freerepublic.com/focus/f-news/4348495/posts",
    "timestamp": "2025-10-25T03:01:55Z"
  },
  {
    "title": "Will Trump Pardon Sam Bankman-Fried? Polymarket Odds Surge as Traders React to CZ’s Release",
    "description": "Speculation is heating up in crypto circles as betting markets Polymarket surged on the possibility that former FTX CEO Sam Bankman-Fried (SBF) could receive a presidential pardon from Donald Trump. Related Reading: Tesla Rides Bitcoin Rally To $80 Million Pr…",
    "link": "https://bitcoinist.com/will-trump-pardon-sam-bankman-fried-polymarket-odds/",
    "timestamp": "2025-10-25T03:00:52Z"
  },
  {
    "title": "Traders guide to what to expect ahead of Trump’s Asia trip and Xi meeting",
    "description": "US President Donald Trump is expected to have a sit-down on Oct 30 with Chinese President Xi Jinping. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/traders-guide-to-what-to-expect-ahead-of-trumps-asia-trip-and-xi-meeting",
    "timestamp": "2025-10-25T03:00:06Z"
  },
  {
    "title": "Trump's $300 Million White House Ballroom Could Soon Bear A Very Familiar Name",
    "description": "President Donald Trump is reportedly planning to name his new $300 million White House ballroom after himself.\n‘The President Donald J Trump Ballroom'\nOfficials are already referring to the new space as \"The President Donald J Trump Ballroom,\" sources familia…",
    "link": "https://biztoc.com/x/0500dfed90b61133",
    "timestamp": "2025-10-25T02:50:56Z"
  },
  {
    "title": "US beef prices are soaring. Will Trump's plans lower them?",
    "description": "US beef prices are soaring. Will Trump's plans lower them?\nBeef prices have gotten so high in the US that it has become a political problem.\nEven Donald Trump, who long ago declared inflation \"dead\", is talking about it, as the issue threatens to undercut his…",
    "link": "https://biztoc.com/x/afdd3be1db6498bf",
    "timestamp": "2025-10-25T02:50:46Z"
  },
  {
    "title": "Trump says tech leaders and mayor changed his mind about using federal force in San Francisco",
    "description": "Trump said the increased federal force had been planned for Saturday. He didn't specify whether he was just referring to National Guard troops, which he had threatened to send in, or if he would also halt a potential ramp up of immigration enforcement. U.S. C…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-says-tech-leaders-and-mayor-changed-his-mind-about-using-federal-force-in-san-francisco/articleshow/124798011.cms",
    "timestamp": "2025-10-25T02:50:01Z"
  },
  {
    "title": "‘On the Backs of Digital Slaves’: Musk, Other Trump-Era Tech Elites Building Global Digital Control Grid",
    "description": "Technocracy News founder Patrick Wood explained how key figures in the Trump administration are developing a system for total digital control over global society. Wood’s presentation was one of four at the recent Omniwar Symposium that analyzed the dangers of…",
    "link": "https://www.activistpost.com/on-the-backs-of-digital-slaves-musk-other-trump-era-tech-elites-building-global-digital-control-grid/",
    "timestamp": "2025-10-25T02:44:00Z"
  },
  {
    "title": "Trump Demands Prosecution of Merrick Garland, Jack Smith, and Other ‘Crooked Lowlifes’ for their ‘Highly Unethical Behavior!’",
    "description": "President Donald Trump singled out a handful of former Justice Department officials on Friday night, saying they should be prosecuted for their roles in investigating him.\nThe post Trump Demands Prosecution of Merrick Garland, Jack Smith, and Other ‘Crooked L…",
    "link": "https://www.mediaite.com/politics/trump/trump-demands-prosecution-of-merrick-garland-jack-smith-and-other-crooked-lowlifes-for-their-highly-unethical-behavior/",
    "timestamp": "2025-10-25T02:38:33Z"
  },
  {
    "title": "China and U.S. Resume Trade Talks in Malaysia Amid Hopes for Xi-Trump Meeting",
    "description": "China and the U.S. are holding fresh trade talks in Malaysia as Vice Premier He Lifeng meets Treasury Secretary Scott Bessent. Both nations express optimism about resolving tensions, with Presidents Xi Jinping and Donald Trump expected to meet in South Korea …",
    "link": "https://www.ibtimes.com.au/china-us-resume-trade-talks-malaysia-amid-hopes-xi-trump-meeting-1860989",
    "timestamp": "2025-10-25T02:37:55Z"
  },
  {
    "title": "Putin envoy Dmitriev says US, Ukraine and Russia close to 'diplomatic solution' on war",
    "description": "Russia's special envoy believes a diplomatic solution to the Ukraine war is nearing, despite recent U.S. sanctions. Kirill Dmitriev stated that a meeting between Donald Trump and Vladimir Putin, though postponed, is still likely. He highlighted Ukrainian Pres…",
    "link": "https://economictimes.indiatimes.com/news/defence/putin-envoy-dmitriev-says-us-ukraine-and-russia-close-to-diplomatic-solution-on-war/articleshow/124797894.cms",
    "timestamp": "2025-10-25T02:37:50Z"
  },
  {
    "title": "Five-Point Consensus on Myanmar among issues to be raised during Asean Summit, says Wisma Putra",
    "description": "KUALA LUMPUR: Asean leaders will deliberate various issues during the 47th Asean Summit and related summits, including reviewing the implementation of the Five-Point Consensus (5PC) on Myanmar, says the Foreign Ministry. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/25/five-point-consensus-on-myanmar-among-issues-to-be-raised-during-asean-summit-says-wisma-putra",
    "timestamp": "2025-10-25T02:31:00Z"
  },
  {
    "title": "Hakeem Jeffries endorses Zohran Mamdani for New York City mayor",
    "description": "U.S. House Democratic Party leader Hakeem Jeffries endorsed Democratic Socialist Zohran Mamdani for New York City mayor, 11 days before the Nov. 4 election.",
    "link": "https://www.upi.com/Top_News/US/2025/10/24/NY-Hakeem-Jeffries-endorses-Zohran-Mamdani-city-mayor/3901761330304/",
    "timestamp": "2025-10-25T02:28:22Z"
  },
  {
    "title": "Beijing Unveils Ambitious Plan to Dominate Global Tech by 2035",
    "description": "China announced plans to massively expand its high-tech industries over the next decade, focusing on quantum computing, hydrogen and fusion energy, and brain-computer interfaces. Officials say the initiative will reshape the country's technological landscape …",
    "link": "https://www.ibtimes.com.au/beijing-unveils-ambitious-plan-dominate-global-tech-2035-1860987",
    "timestamp": "2025-10-25T02:26:02Z"
  },
  {
    "title": "U.S., China seek to avoid trade war escalation, salvage Trump-Xi meeting in Malaysia talks",
    "description": "Top economic officials from the U.S. and China will face off in Kuala Lumpur on Saturday to try to avert an escalation of their trade war and ensure that a meeting happens next week between U.S. President Donald Trump and Chinese President Xi Jinping. The tal…",
    "link": "https://japantoday.com/category/world/us-china-seek-to-avoid-trade-war-escalation-salvage-trump-xi-meeting-in-malaysia-talks",
    "timestamp": "2025-10-25T02:18:55Z"
  },
  {
    "title": "Senate Republican admits he'd be 'apoplectic' if Biden did what Trump is doing",
    "description": "Sen. James Lankford (R-Okla.) said he’d be “apoplectic” if former President Joe Biden acted the same way President Donald Trump is regarding recent military operations in Venezuela and the Caribbean Sea – a rare public rebuke from a member of Trump’s own part…",
    "link": "https://www.rawstory.com/james-lankford-2674232077/",
    "timestamp": "2025-10-25T02:16:02Z"
  },
  {
    "title": "Independent Journalist Shocks Jesse Watters With Antifa Members’ Alleged Day Jobs",
    "description": "Independent journalist Karlyn Borysenko appeared to shock Watters when she revealed that members of Antifa hold day jobs, including allegedly being teachers.",
    "link": "https://dailycaller.com/2025/10/24/karlyn-borysenko-jesse-watters-antifa-members/",
    "timestamp": "2025-10-25T02:14:29Z"
  },
  {
    "title": "'US diplomats and troops to monitor Gaza truce': Marco Rubio",
    "description": "Middle East News: Secretary of state Marco Rubio said Friday that a growing number of diplomats would work with US military officers at a new center in Israel aimed at .",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/us-diplomats-troops-to-monitor-gaza-truce-rubio/articleshow/124797654.cms",
    "timestamp": "2025-10-25T02:10:22Z"
  },
  {
    "title": "Trump to undertake official visit to Malaysia from Oct 26-27",
    "description": "KUALA LUMPUR: United States President Donald Trump will undertake an official visit to Malaysia from Oct 26 to 27 at the invitation of Prime Minister Datuk Seri Anwar Ibrahim as the Chairman of Asean 2025, in conjunction with the 13th Asean-United States Summ…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/25/trump-to-undertake-official-visit-to-malaysia-from-oct-26-27",
    "timestamp": "2025-10-25T02:08:00Z"
  },
  {
    "title": "US beef prices are soaring. Will Trump's plans lower them?",
    "description": "US beef prices are soaring. Will Trump's plans lower them?\nBeef prices have gotten so high in the US that it has become a political problem.\nEven Donald Trump, who long ago declared inflation \"dead\", is talking about it, as the issue threatens to undercut his…",
    "link": "https://biztoc.com/x/fd836ac4949e381b",
    "timestamp": "2025-10-25T02:06:27Z"
  },
  {
    "title": "US beef prices are soaring. Will Trump's plans lower them?",
    "description": "Trump is under fire from ranchers, who say his ideas to lower prices address \"symptoms not the problems\".",
    "link": "https://www.bbc.com/news/articles/cr7m2pd3810o",
    "timestamp": "2025-10-25T02:02:58Z"
  }
]