[
  {
    "title": "Letitia James loses again",
    "description": "As general rule, one shouldn’t take pleasure in the misfortune of others. That guideline, however, should not apply to people who maliciously bedevil others, particularly if they’re wielding the power of government to pursue personal and/...",
    "link": "https://www.americanthinker.com/blog/2025/12/letitia_james_loses_again.html",
    "timestamp": "2025-12-04T05:00:00Z"
  },
  {
    "title": "The Art of the Unexpected: Rebranding, ideology, and the new White House fencing match",
    "description": "In modern American politics, the most decisive blows are rarely struck through policy papers or committee hearings. They are delivered in moments—unexpected gestures, rhetorical inversions, and symbolic cross-currents that defy the gravitationa...",
    "link": "https://www.americanthinker.com/blog/2025/12/the_art_of_the_unexpected_rebranding_ideology_and_the_new_white_house_fencing_match.html",
    "timestamp": "2025-12-04T05:00:00Z"
  },
  {
    "title": "The New York Times ... tells the truth?!",
    "description": "Hell has frozen over, and take cover; pigs are flying. The New York Times has told the truth, and in so doing, defended Donald Trump and SecWar Pete Hegesth. The stakes are high:  \r\n\r\n\r\nPolls show trust in the media at an all-time...",
    "link": "https://www.americanthinker.com/blog/2025/12/the_new_york_times_tells_the_truth.html",
    "timestamp": "2025-12-04T05:00:00Z"
  },
  {
    "title": "Report card: How are Ursula von der Leyen’s commissioners getting on?",
    "description": "Europe letter: European Commission president has fewer clear rivals to her influence inside powerful executive this time",
    "link": "https://www.irishtimes.com/world/europe/2025/12/04/report-card-how-are-ursula-von-der-leyens-commissioners-getting-on/",
    "timestamp": "2025-12-04T04:56:00Z"
  },
  {
    "title": "Trump’s Fed choice intensifies pressure on Treasury Secretary Bessent",
    "description": "President Donald Trump is intensely focused on lowering interest rates. He has tasked Treasury Secretary Scott Bessent with finding a new Federal Reserve chair. Trump wants swift rate cuts to boost the economy. The selection process is crucial, with potential…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-fed-choice-intensifies-pressure-on-treasury-secretary-bessent/articleshow/125758364.cms",
    "timestamp": "2025-12-04T04:55:45Z"
  },
  {
    "title": "CEO Behind Trump Stares Skyward and Possibly Yearns for Rapture as President Rages Against Immigrants",
    "description": "Antonio Filosa fidgeted nervously before staring skyward during Donald Trump's rant against Somali immigrants.\nThe post CEO Behind Trump Stares Skyward and Possibly Yearns for Rapture as President Rages Against Immigrants first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/ceo-behind-trump-stares-skyward-and-possibly-yearns-for-rapture-as-president-rages-against-immigrants/",
    "timestamp": "2025-12-04T04:52:34Z"
  },
  {
    "title": "White House renames building the ‘Donald J. Trump Institute of Peace’ - The Washington Post",
    "description": "White House renames building the ‘Donald J. Trump Institute of Peace’The Washington Post Trump Renames Institute of Peace for HimselfThe New York Times Trump's name added to US Institute of Peace ahead of peace deal signingReuters US Institute of Peace rename…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180280661",
    "timestamp": "2025-12-04T04:52:15Z"
  },
  {
    "title": "Cost of living still a sore point for voters as politicians go on holiday",
    "description": "A mammoth year in politics ended with a focus on what is worrying most Australians ahead of Christmas: the cost of living.",
    "link": "https://www.abc.net.au/news/2025-12-04/anthony-albanese-election-coalition-cost-of-living-anika-wells/106087960",
    "timestamp": "2025-12-04T04:48:24Z"
  },
  {
    "title": "Crude oil futures rise as Ukraine continues attacks on Russian oil infrastructure",
    "description": "At 9.57 am on Thursday, February Brent oil futures were at $62.92, up by 0.40% and January crude oil futures on WTI were at $59.26, up by 0.53%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-rise-as-ukraine-continues-attacks-on-russian-oil-infrastructure/article70356191.ece",
    "timestamp": "2025-12-04T04:47:29Z"
  },
  {
    "title": "China, France must overcome 'differences', Macron tells Xi",
    "description": "Macron has sought to pressure Xi to help secure a ceasefire in Ukraine, as the war with Russia drags into a fourth winter. China regularly calls for peace talks and respect for the territorial integrity of all countries, but has never condemned Russia for its…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-france-must-overcome-differences-macron-tells-xi/articleshow/125758203.cms",
    "timestamp": "2025-12-04T04:46:50Z"
  },
  {
    "title": "Sleepy Don? Trump's health under fresh scrutiny",
    "description": "He still mocks his predecessor as \"Sleepy Joe\" Biden. But it was Donald Trump who seemed to be fighting to stay awake at a cabinet meeting.",
    "link": "https://www.citizen.digital/news/sleepy-don-trumps-health-under-fresh-scrutiny-n373968",
    "timestamp": "2025-12-04T04:40:06Z"
  },
  {
    "title": "US halted plans to sanction Chinese spy agency to maintain trade truce",
    "description": "Decision sparks concern among China hawks that Donald Trump is sacrificing national security",
    "link": "https://biztoc.com/x/033c514f5f55a329",
    "timestamp": "2025-12-04T04:38:27Z"
  },
  {
    "title": "Family voices new alarm for Hong Kong’s jailed Jimmy Lai",
    "description": "The children of Hong Kong’s jailed pro-democracy media mogul Jimmy Lai are voicing new alarm for his health, saying his condition has continued to deteriorate.  Lai, who turns 78 next Monday, has been behind bars since late 2020 as China clamps down on the fi…",
    "link": "https://www.digitaljournal.com/world/family-voices-new-alarm-for-hong-kongs-jailed-jimmy-lai-2/article",
    "timestamp": "2025-12-04T04:38:20Z"
  },
  {
    "title": "How Obama Paved The Way For Trump's Venezuelan Killings",
    "description": "How Obama Paved The Way For Trump's Venezuelan Killings\n \nAuthored by Jim Bovard\nThe Trump administration’s killings of scores of Venezuelans are justifiably provoking outrage. Secretary of War Pete Hegseth recently proclaimed, \"We have only just begun to kil…",
    "link": "https://biztoc.com/x/ba0950abc284caa9",
    "timestamp": "2025-12-04T04:38:09Z"
  },
  {
    "title": "Honduras’s Nasralla holds narrow lead over Asfura in presidential vote",
    "description": "With 80 percent of votes counted, centrist candidate widens lead over his Trump-backed conservative rival.",
    "link": "https://www.aljazeera.com/news/2025/12/4/hondurass-nasralla-holds-narrow-lead-over-asfura-in-presidential-vote",
    "timestamp": "2025-12-04T04:34:11Z"
  },
  {
    "title": "Visa chaos and host city threats: How Trump has disrupted World Cup plans",
    "description": "Organizing a World Cup is never simple. But when the host is Donald Trump, it's even more complicated. In just six months, the United States along with Mexico and Canada will host soccer's flagship tournament. And the mercurial U.S.. president has infuriated …",
    "link": "https://japantoday.com/category/sports/visa-chaos-and-host-city-threats-how-trump-disrupted-world-cup-plans",
    "timestamp": "2025-12-04T04:26:39Z"
  },
  {
    "title": "Somalis call Trump’s comments insulting their country a ‘grave mistake’",
    "description": "Somalis are condemning recent comments made by US President Donald Trump insulting their country.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/4/somalis-call-trumps-comments-insulting-their-country-a-grave",
    "timestamp": "2025-12-04T04:20:17Z"
  },
  {
    "title": "Jake marched into America's 'Muslim capital' armed with a lighter and the Quran. Then all hell broke loose...",
    "description": "Dearborn, Michigan, was back in the national spotlight last month after a far-right protest spiraled into street clashes, a near-Quran burning, and the latest debate about religion, identity and political extremism in America's largest Muslim-majority city. T…",
    "link": "https://freerepublic.com/focus/f-chat/4355847/posts",
    "timestamp": "2025-12-04T04:19:37Z"
  },
  {
    "title": "Jared Isaacman Dodges Question On Whether Elon Musk Was Present When Trump Offered Him The NASA Administrator Job: 'Don't Think It's Fair'",
    "description": "On Wednesday, National Aeronautics and Space Administration administrator nominee Jared Isaacman refused to say whether Tesla Inc. (NASDAQ:TSLA) and SpaceX CEO Elon Musk was in the room when President Donald Trump offered him the job.\nSenators Press Isaacman …",
    "link": "https://biztoc.com/x/efddce85245b4782",
    "timestamp": "2025-12-04T04:16:05Z"
  },
  {
    "title": "‘The Daily Show’ Roasts Trump as ‘Drone Strike Santa’ After Oddly Specific Threat for Narco-Terrorists | Video",
    "description": "\"We know the routes they take ... We know where the bad ones live,\" the president said about narco-terrorists earlier Wednesday\nThe post ‘The Daily Show’ Roasts Trump as ‘Drone Strike Santa’ After Oddly Specific Threat for Narco-Terrorists | Video appeared fi…",
    "link": "https://www.thewrap.com/the-daily-show-calls-trump-drone-strike-santa-narco-terrorists-threat-video/",
    "timestamp": "2025-12-04T04:08:04Z"
  },
  {
    "title": "​Republican says women will shoulder burden for GOP health plan: 'They're great shoppers' - NewsBreak",
    "description": "A Republican senator sketched out the contours of President Donald Trump's health care overhaul that would shift the burden for coverage to women. The pres",
    "link": "https://www.newsbreak.com/news/4378925856031-republican-says-women-will-shoulder-burden-for-gop-health-plan-theyre-great-shoppers?noAds=1&amp;_f=app_share&amp;s=a2&amp;share_destination_id=Mjg0MjI3ODEyLTE3NjQ4MjEyMDM3MzU%3D",
    "timestamp": "2025-12-04T04:07:18Z"
  },
  {
    "title": "Trump Pardons Henry Cuellar And Wife Indicted For Taking $600,000 In Bribes, Says Texas Rep Was Targeted For 'Bravely' Speaking Against Open Borders",
    "description": "President Donald Trump on Wednesday pardoned Texas Rep. Henry Cuellar (D) and his wife in a federal bribery and conspiracy case, calling the prosecution proof of a \"weaponized\" justice system and igniting fresh controversy over his sweeping use of clemency.\nT…",
    "link": "https://biztoc.com/x/41a49bfc236b3ef4",
    "timestamp": "2025-12-04T04:04:56Z"
  },
  {
    "title": "Trump applies the brakes in Lebanon and Israel will have to give diplomacy a chance",
    "description": "The appointment by both side of mission heads and Lebanon's willingness to political negotiations could halt the stampede toward a military confrontation. Israel should consider granting achievements to the government in Beirut to curb Hezbollah",
    "link": "https://www.haaretz.com/israel-news/2025-12-04/ty-article/.premium/trump-applies-the-brakes-in-lebanon-and-israel-will-have-to-give-diplomacy-a-chance/0000019a-e65c-d0ea-afff-fe5fce3f0000",
    "timestamp": "2025-12-04T04:01:07Z"
  },
  {
    "title": "Putin visits India amid Ukraine peace push: What’s on the agenda?",
    "description": "President Putin visits India as Russia faces pressure to end war in Ukraine, looking to boost bilateral trade deals.",
    "link": "https://www.aljazeera.com/news/2025/12/4/putin-visits-india-amid-ukraine-peace-push-whats-on-the-agenda",
    "timestamp": "2025-12-04T04:00:03Z"
  },
  {
    "title": "President Trump is a champion in the fight for ‘Venezuelan freedom’",
    "description": "María Corina Machado won this year’s Nobel Peace Prize for her tireless fight to restore freedom in Venezuela and defeat the authoritarian regime of Nicolás Maduro.",
    "link": "https://nypost.com/2025/12/03/opinion/president-trump-is-a-champion-in-the-fight-for-venezuelan-freedom/",
    "timestamp": "2025-12-04T03:54:59Z"
  },
  {
    "title": "Fox News Doc Makes Trump's Very Public Naptime Sound Super Healthy",
    "description": "The network's senior medical analyst put an inventive twist on the president's drowsy appearance during his Cabinet meeting.",
    "link": "https://www.huffpost.com/entry/fox-news-marc-siegel-trump-naps-thomas-edison_n_6930ec3ee4b0824b6df7e1a7",
    "timestamp": "2025-12-04T03:54:53Z"
  },
  {
    "title": "Ex-Honduras president Hernández thanks Trump in first message since release",
    "description": "Honduras' former President Juan Orlando Hernández has thanked U.S. President Donald Trump for pardoning him in his first message after leaving prison",
    "link": "https://abcnews.go.com/International/wireStory/honduras-president-hernndez-trump-message-release-128096871",
    "timestamp": "2025-12-04T03:50:06Z"
  },
  {
    "title": "Erika Kirk takes on the mantle of leading Turning Point USA, founded by slain husband Charlie Kirk",
    "description": "Turning Point USA has continued to expand its network of chapters across American schools since Charlie Kirk's assassination in September, and Erika Kirk on Wednesday subtly highlighted her own connections to political power, including with President Donald T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/erika-kirk-takes-on-the-mantle-of-leading-turning-point-usa-founded-by-slain-husband-charlie-kirk/articleshow/125757397.cms",
    "timestamp": "2025-12-04T03:49:57Z"
  },
  {
    "title": "New York state blocks second Long Island school district from adopting transgender bathroom ban",
    "description": "New York state blocked Locust Valley School District's transgender bathroom ban, marking the second Long Island district prohibited from enforcing such restrictions.",
    "link": "https://www.foxnews.com/us/new-york-state-blocks-second-long-island-school-district-from-adopting-transgender-bathroom-ban",
    "timestamp": "2025-12-04T03:46:13Z"
  },
  {
    "title": "Musk Maps Out MAGA’s Next 12 Years: Trump’s Return, Vance’s Rise",
    "description": "In a virtual address to a private gathering of former federal appointees in Texas last month, Elon Musk outlined what he called a “great 12-year span” — beginning with Donald Trump’s ongoing second term and continuing through two projected terms of Vice Presi…",
    "link": "https://www.breitbart.com/politics/2025/12/03/musk-maps-magas-next-12-years-trumps-return-vances-rise/",
    "timestamp": "2025-12-04T03:45:12Z"
  },
  {
    "title": "House panel pushes Trump to label Muslim Brotherhood a terror group",
    "description": "House Foreign Affairs Committee advances a bipartisan bill urging President Trump to designate the Muslim Brotherhood as a terrorist group.",
    "link": "https://www.israelnationalnews.com/news/418788",
    "timestamp": "2025-12-04T03:44:38Z"
  },
  {
    "title": "Venezuela's Maduro Confirms 'Cordial' Phone Conversation with Trump",
    "description": "The president of Venezuela, Nicolas Maduro, reveals a 10-day-old phone conversation with Donald Trump, calling it \"respectful\" and even \"cordial.\"",
    "link": "https://sputnikglobe.com/20251204/venezuelas-maduro-confirms-cordial-phone-conversation-with-trump-1123222585.html",
    "timestamp": "2025-12-04T03:41:00Z"
  },
  {
    "title": "FBI insiders reveal they're being pressured to investigate Dems who angered Trump: report",
    "description": "FBI insiders revealed on Wednesday that they are being pressured by officials to open an investigation into six Democratic lawmakers who created a video that seemed to make President Donald Trump furious, according to a new report. Bloomberg Law reported on W…",
    "link": "https://www.rawstory.com/fbi-2674368226/",
    "timestamp": "2025-12-04T03:38:54Z"
  },
  {
    "title": "President Trump Cancels Joe Biden CAFE Standards Against Auto Industry",
    "description": "In an effort to return common sense, practicality and affordability to the American consumer base for automobiles, President Trump announced the elimination of Je Biden’s Corporate Average Fuel Economy (CAFE) standards for manufactured cars and trucks.Under t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4355841/posts",
    "timestamp": "2025-12-04T03:33:27Z"
  },
  {
    "title": "President Trump Cancels Joe Biden CAFE Standards Against Auto Industry",
    "description": "In an effort to return common sense, practicality and affordability to the American consumer base for automobiles, President Trump announced the elimination of Je Biden’s Corporate Average Fuel Economy (CAFE) standards for manufactured cars and trucks.Under t…",
    "link": "https://freerepublic.com/focus/f-news/4355841/posts",
    "timestamp": "2025-12-04T03:33:27Z"
  },
  {
    "title": "Trump says 'no problem' releasing video of 2nd strike on alleged drug boat",
    "description": "ABC's Selina Wang asked President Trump about the Sept. 2 strike video and survivors killed.",
    "link": "https://abcnews.go.com/Politics/trump-problem-releasing-video-2nd-strike-alleged-drug/story?id=128088957",
    "timestamp": "2025-12-04T03:24:54Z"
  },
  {
    "title": "Ilhan Omar Claims Trump Demonizing Ethnic Group — Warns Danger of Violence from His Followers",
    "description": "Wednesday on CNN’s “The Lead,” Rep. Ilhan Omar (D-MN) said President Donald Trump’s comments about Somalians were creating a dangerous situation because his followers have “exhibited violence.” Today at the White House, Trump said, “These Somalians have taken…",
    "link": "https://freerepublic.com/focus/f-chat/4355837/posts",
    "timestamp": "2025-12-04T03:18:18Z"
  },
  {
    "title": "'Why did you marry your brother?': Trump vs Ilhan Omar's war of words escalate after US President targets Somalis",
    "description": "President Donald Trump launched a fresh tirade against the Somali-American community and Congresswoman Ilhan Omar and called them 'garbage'. Trump also said he heard Ilhan Omar has married her brother, adding that she tries to deny it but it has happened. Ilh…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/why-did-you-marry-your-brother-trump-vs-ilhan-omars-war-of-words-escalate-after-president-targets-somalis/articleshow/125756982.cms",
    "timestamp": "2025-12-04T03:17:16Z"
  },
  {
    "title": "Ukraine Has Many Things Against It Right Now — Trump",
    "description": "US special envoy Steven Witkoff and Trump’s son-in-law Jared Kushner had a “very good” meeting with Russian President Vladimir Putin in Moscow, but it remains to be seen what comes out of it, US President Donald Trump told reporters at the White House.",
    "link": "https://sputnikglobe.com/20251204/ukraine-has-many-things-against-it-right-now--trump-1123222452.html",
    "timestamp": "2025-12-04T03:17:00Z"
  },
  {
    "title": "Trump grants pardon to sports executive charged by his Justice Department",
    "description": "Tim Leiweke was indicted in July in connection with conspiracy to rig the bidding process for the development of an arena at the University of Texas in Austin.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-pardons-tim-leiweke-oak-view-group-charged-justice-department-rcna247307",
    "timestamp": "2025-12-04T03:15:52Z"
  },
  {
    "title": "OSCE completes closure of Minsk Process and related structures",
    "description": "The OSCE finalized the closure of the Minsk Process and its related structures at 23:59 on 30 November 2025, in line with the Ministerial Council decision MC.DEC/1/25 adopted on 1 September 2025, following a Joint Appeal from Armenia and Azerbaijan to the Fin…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251201-osce01.htm",
    "timestamp": "2025-12-04T03:15:42Z"
  },
  {
    "title": "Houthis release crew of ship they attacked in Red Sea",
    "description": "Crew of the Greek-operated Eternity C, sunk in July after Houthi attacks in the Red Sea, have been released. Eleven seafarers are set to arrive in Oman, ending months of captivity.",
    "link": "https://www.israelnationalnews.com/news/418787",
    "timestamp": "2025-12-04T03:12:12Z"
  },
  {
    "title": "Venezuela’s Maduro confirms ‘cordial’ call with Trump amid tensions with US",
    "description": "Venezuelan leader expresses hope phone call marks beginning of 'respectful dialogue' between Washington and Caracas.",
    "link": "https://www.aljazeera.com/news/2025/12/4/venezuelas-maduro-confirms-cordial-call-with-trump-amid-tensions-with-us",
    "timestamp": "2025-12-04T03:08:39Z"
  },
  {
    "title": "War for Ukraine Day 1,378: One of These Things Is Not Like the Other",
    "description": "Shot: After the meeting with the Americans, Ushakov, who is currently Putin’s aide, came out to the journalists and stated that there is still no compromise plan for ending the war. The Russians are simply dragging things out. The video has subtitles. [image …",
    "link": "https://balloon-juice.com/2025/12/03/war-for-ukraine-day-1378-one-of-these-things-is-not-like-the-other/",
    "timestamp": "2025-12-04T03:06:52Z"
  },
  {
    "title": "U.S. Paid Eswatini Over $5 Million To Accept Deported Migrants",
    "description": "The United States ruling class paid the African nation of Eswatini $5.1 million to accept migrants who were deported. This is a controversial agreement in which at least 15 migrants have been sent to Eswatini since the bilateral deal went into effect in May. …",
    "link": "https://www.activistpost.com/u-s-paid-eswatini-over-5-million-to-accept-deported-migrants/",
    "timestamp": "2025-12-04T03:06:00Z"
  },
  {
    "title": "US retreat from its allies could hurt dollar's status, BoE's Catherine Mann says",
    "description": "The United States could draw lessons from Britain, where the pound's share of global reserves shrank from 80% in 1900 to 5% now, Mann said. The dollar accounted for 58% of global official currency reserves last year, according to data from the International M…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-retreat-from-its-allies-could-hurt-dollars-status-boes-catherine-mann-says/articleshow/125756847.cms",
    "timestamp": "2025-12-04T03:05:13Z"
  },
  {
    "title": "US Institute of Peace officially renamed for Trump as White House moves to dismantle agency: 'Congratulations'",
    "description": "Trump administration renames U.S. Institute of Peace as Donald J. Trump Institute of Peace as State Department calls president \"greatest dealmaker\" in American history.",
    "link": "https://www.foxnews.com/politics/us-institute-peace-officially-renamed-trump-white-house-moves-dismantle-agency-congratulations",
    "timestamp": "2025-12-04T03:02:32Z"
  },
  {
    "title": "Economic Confidence Slips; Holiday Spending Plans Plummet",
    "description": "Americans' economic confidence has fallen to its lowest level in over a year, accompanied by a historic drop in planned holiday spending.",
    "link": "https://news.gallup.com/poll/699311/economic-confidence-slips-holiday-spending-plans-plummet.aspx",
    "timestamp": "2025-12-04T03:00:00Z"
  },
  {
    "title": "Tech Forum 2026: Trump shifts trade tools toward legal frameworks, server supply chain splits into dual tracks",
    "description": "Facing the modern trade environment and supply chain restructuring in the Donald Trump 2.0 era, industry players have many approaches to respond. At the DIGITIMES Tech Forum on December 3, 2025, DIGITIMES deputy director Tom Lo and analyst Chou Yen shared tha…",
    "link": "https://www.digitimes.com/news/a20251204PD205/supply-chain-legal-2026-2025-donald-trump.html",
    "timestamp": "2025-12-04T02:55:26Z"
  },
  {
    "title": "Trump rages at 'sleazebag' governor for refusing to free 'elderly' MAGA acolyte",
    "description": "President Donald Trump raged at a governor whom he derided as a \"sleazbag\" on Wednesday for declining to free one of Trump's allies from prison. Earlier this week, Colorado Gov. Jared Polis' office directed state prison officials not to comply with a request …",
    "link": "https://www.rawstory.com/trump-2674368195/",
    "timestamp": "2025-12-04T02:53:38Z"
  },
  {
    "title": "Israel needs an end to lawfare, not a presidential pardon",
    "description": "There are reasons to oppose the push to pardon Prime Minister Benjamin Netanyahu that originated with President Donald Trump. But his farcical 'trial' should still end.  Opinion.",
    "link": "https://www.israelnationalnews.com/news/418786",
    "timestamp": "2025-12-04T02:51:48Z"
  },
  {
    "title": "Israeli forensic experts working to identify remains handed over from Gaza",
    "description": "Israeli Forensic Experts Working to Identify Remains Handed Over From Gaza. Netanyahu Says He Wouldn't Hesitate to Visit New York, Despite Mamdani Threat to Honor Int'l Arrest Warrant. Trump Says Gaza Cease-fire 'Going Well,' Phase 2 to Begin 'Pretty Soon'",
    "link": "https://www.haaretz.com/israel-news/2025-12-04/ty-article-live/israeli-forensic-experts-working-to-identify-remains-handed-over-from-gaza/0000019a-e731-dac6-a1ff-fff9c3aa0000",
    "timestamp": "2025-12-04T02:46:08Z"
  },
  {
    "title": "'Bread and butter corruption': Senator suspects sinister plot behind Trump's pardon spree",
    "description": "Sen. Chris Murphy (D-CT) tore into President Donald Trump's recent string of pardons for powerful and well-connected criminals and criminal defendants — and suggested there is something much more sinister going on below the surface.Specifically, he argued to …",
    "link": "https://www.rawstory.com/chris-murphy-2674368117/",
    "timestamp": "2025-12-04T02:45:19Z"
  },
  {
    "title": "Critics Take Hakeem Jeffries to Task For Praising Trump's Latest Pardon",
    "description": "Many blasted the House minority leader's reaction to Trump pardoning a Democrat who was indicted on charges of bribery and acting as a foreign agent.",
    "link": "https://www.huffpost.com/entry/hakeem-jeffries-trump-pardon-henry-cuellar_n_6930cf60e4b0824b6df7cad7",
    "timestamp": "2025-12-04T02:41:09Z"
  },
  {
    "title": "Ukraine's push for NATO membership 'key question' of discussion with Putin, US delegation: Kremlin",
    "description": "High-level talks between Russian and US officials in Moscow centered on Ukraine's NATO aspirations, a key Russian security concern. While no breakthrough on peace negotiations was achieved, American representatives conveyed readiness to consider Russian propo…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraines-push-for-nato-membership-key-question-of-discussion-with-putin-us-delegation-says-kremlin/articleshow/125756450.cms",
    "timestamp": "2025-12-04T02:40:40Z"
  },
  {
    "title": "Visa chaos and host city threats: how Trump disrupted World Cup plans",
    "description": "Organizing a World Cup is never simple. But when the host is Donald Trump, it’s even more complicated. In just six months, the United States along with Mexico and Canada will host soccer’s flagship tournament. And the mercurial US president has infuriated his…",
    "link": "https://www.digitaljournal.com/world/visa-chaos-and-host-city-threats-how-trump-disrupted-world-cup-plans/article",
    "timestamp": "2025-12-04T02:37:22Z"
  },
  {
    "title": "Visa chaos and host city threats: how Trump disrupted World Cup plans",
    "description": "Organizing a World Cup is never simple. But when the host is Donald Trump, it's even more complicated.\nThe post Visa chaos and host city threats: how Trump disrupted World Cup plans appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/sports/visa-chaos-and-host-city-threats-how-trump-disrupted-world-cup-plans/article",
    "timestamp": "2025-12-04T02:37:22Z"
  },
  {
    "title": "Florida’s Venezuelans divided on US military buildup",
    "description": "As the United States deploys more military forces and carries out airstrikes on boats in the Caribbean, Venezuelans in South Florida are divided over what President Donald Trump’s next moves should be. Most people in the diaspora here long for a new leader to…",
    "link": "https://www.digitaljournal.com/world/floridas-venezuelans-divided-on-us-military-buildup/article",
    "timestamp": "2025-12-04T02:37:21Z"
  },
  {
    "title": "Colorado Tells DOJ ‘Take a Hike’ as It Rejects Demand for Statewide Voter Data",
    "description": "Colorado Tells DOJ ‘Take a Hike’ as It Rejects Demand for Statewide Voter Data “We will not comply with the Trump Department of Justice’s request for Coloradans’ sensitive voting information,” Griswold said in a statement. “The DOJ can take a hike; it does no…",
    "link": "https://freerepublic.com/focus/f-chat/4355831/posts",
    "timestamp": "2025-12-04T02:35:39Z"
  },
  {
    "title": "Salesforce CEO vies to overcome investors' AI skepticism while touting company's quarterly numbers",
    "description": "Benioff, who helped spearhead the transition to cloud computing after founding Salesforce in 1999, got a chance to try to change the AI narrative late Wednesday with the release of his company's latest quarterly results.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/salesforce-ceo-vies-to-overcome-investors-ai-skepticism-while-touting-companys-quarterly-numbers/articleshow/125756380.cms",
    "timestamp": "2025-12-04T02:33:31Z"
  },
  {
    "title": "Richard Gere says Dalai Lama’s words couldn’t change Trump: ‘What he’s done is astonishing’",
    "description": "Actor Richard Gere doubted even the Tibetan spiritual leader, the Dalai Lama, could change President Donald Trump's mind on things when speaking to Variety.",
    "link": "https://www.foxnews.com/media/richard-gere-says-dalai-lamas-words-couldnt-change-trump-what-hes-done-astonishing",
    "timestamp": "2025-12-04T02:30:14Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,379",
    "description": "These are the key developments from day 1,379 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/4/russia-ukraine-war-list-of-key-events-day-1379",
    "timestamp": "2025-12-04T02:29:52Z"
  },
  {
    "title": "Trump's name added to US Institute of Peace ahead of peace deal signing",
    "description": "President Donald Trump's name now adorns the United States Institute of Peace building. This comes as he hosts leaders from Rwanda and the Democratic Republic of Congo for a peace deal signing. The move follows a controversial administration attempt to take o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-name-added-to-us-institute-of-peace-ahead-of-peace-deal-signing/articleshow/125756353.cms",
    "timestamp": "2025-12-04T02:29:49Z"
  },
  {
    "title": "Murphy: Trump 'Focused on Racial Purification of the Country'",
    "description": "Wednesday on MS NOW's \"All In,\" Sen. Chris Murphy (D-CT) said President Donald Trump was \"focused on racial purification of the country.\"\nThe post Murphy: Trump ‘Focused on Racial Purification of the Country’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/12/03/murphy-trump-focused-on-racial-purification-of-the-country/",
    "timestamp": "2025-12-04T02:27:31Z"
  },
  {
    "title": "Ilhan Omar Claims Trump Demonizing Ethnic Group — Warns Danger of Violence from His Followers",
    "description": "Wednesday on CNN's \"The Lead,\" Rep. Ilhan Omar (D-MN) said President Donald Trump's comments about Somalians were creating a dangerous situation because his followers have \"exhibited violence.\"\nThe post Ilhan Omar Claims Trump Demonizing Ethnic Group — Warns …",
    "link": "https://www.breitbart.com/clips/2025/12/03/ilhan-omar-claims-trump-demonizing-ethnic-group-warns-danger-of-violence-from-his-followers/",
    "timestamp": "2025-12-04T02:26:28Z"
  },
  {
    "title": "Emerging-Market Currencies Gain As Traders See Rate Cuts Ahead",
    "description": "A gauge for emerging-market currencies rose on Wednesday, getting a lift from renewed bets of a Federal Reserve interest-rate cut next week after the latest batch of jobs data showed a weakening labor market.",
    "link": "https://www.ndtvprofit.com/markets/emerging-market-currencies-gain-as-traders-see-rate-cuts-ahead",
    "timestamp": "2025-12-04T02:25:48Z"
  },
  {
    "title": "Trump says he will repeal Biden-era fuel efficiency standards for cars and trucks (Lucy Campbell/The Guardian)",
    "description": "Lucy Campbell / The Guardian:\nTrump says he will repeal Biden-era fuel efficiency standards for cars and trucks  —  Move marks president's latest effort to dismantle pollution regulations and support for cleaner-running vehicles  —  Donald Trump announced on …",
    "link": "https://www.memeorandum.com/251203/p140",
    "timestamp": "2025-12-04T02:25:00Z"
  },
  {
    "title": "Trump praises Nvidia CEO Jensen Huang after discussion about export controls",
    "description": "President Trump met with Nvidia CEO Jensen Huang, stating Huang understands the administration's stance on export controls to China. Huang also met with lawmakers, arguing that state-by-state AI regulations would hinder development. He later downplayed concer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-praises-nvidia-ceo-jensen-huang-after-discussion-about-export-controls/articleshow/125756265.cms",
    "timestamp": "2025-12-04T02:22:04Z"
  },
  {
    "title": "Pardoned Henry Cuellar Answers Whether He’ll Seek Reelection As Democrat",
    "description": "Democratic Texas Rep. Henry Cuellar made it clear Wednesday that he intends to run for another term and he’s doing it as a Democrat.",
    "link": "https://dailycaller.com/2025/12/03/pardoned-henry-cuellar-seek-reelection-democrat/",
    "timestamp": "2025-12-04T02:21:27Z"
  },
  {
    "title": "This World Cup Draw Will Be Unlike One That We Have Ever Seen",
    "description": "Except for Rio Ferdinand, FIFA has decided not to use retired soccer stars at the World Cup draw at the Kennedy Center in Washington, D.C.",
    "link": "https://www.forbes.com/sites/michaellewis/2025/12/03/this-world-cup-draw-will-be-unlike-one-that-we-have-ever-seen/",
    "timestamp": "2025-12-04T02:19:26Z"
  },
  {
    "title": "Who is Kevin Hassett, Trump’s expected pick to lead the Federal Reserve?",
    "description": "Trump's top economic adviser is odds-on favourite to lead the Fed amid concerns over the central bank's independence.",
    "link": "https://www.aljazeera.com/economy/2025/12/4/who-is-kevin-hassett-trumps-expected-pick-to-lead-the-federal-reserve",
    "timestamp": "2025-12-04T02:13:39Z"
  },
  {
    "title": "Trump’s Hateful Oval Office Rant About Somali Immigrants Shines a Harsh Light on the Cowardice of His Cronies",
    "description": "President Donald Trump's rant attacking Rep. Ilhan Omar (D-MN) and other Somali immigrants was an unhinged moment that revealed the cowardice and complicity of the cronies gathered around him from Congress and his cabinet.\nThe post Trump’s Hateful Oval Office…",
    "link": "https://www.mediaite.com/opinion/trumps-hateful-oval-office-rant-about-somali-immigrants-shines-a-harsh-light-on-the-cowardice-of-his-cronies/",
    "timestamp": "2025-12-04T02:11:25Z"
  },
  {
    "title": "Trump Hopes To Bend International Law. This Attempt Isn’t Working.",
    "description": "As the U.S. and Israel pressure the International Criminal Court for its work on Gaza, dozens of global governments sent a signal of support for accountability this week.",
    "link": "https://www.huffpost.com/entry/trump-icc-pressure-campaign-gaza_n_6930c65ae4b0824b6df7c999",
    "timestamp": "2025-12-04T02:10:14Z"
  },
  {
    "title": "Putin visits India for defence, trade talks",
    "description": "President Vladimir Putin is set to begin a two-day visit to India on Thursday, seeking to deepen defence ties even as New Delhi faces growing US pressure to stop buying Russian oil. The Russian leader, making his first trip to India since the start of the Ukr…",
    "link": "https://www.digitaljournal.com/world/putin-visits-india-for-defence-trade-talks/article",
    "timestamp": "2025-12-04T02:08:15Z"
  },
  {
    "title": "Trump to sign Rwanda, DR Congo accord even as violence rages",
    "description": "US President Donald Trump on Thursday brings together the leaders of Rwanda and the Democratic Republic of Congo for what he will hail as his latest peace triumph despite ongoing violence on the ground. Trump hopes the agreement will pave the way for the Unit…",
    "link": "https://www.digitaljournal.com/world/trump-to-sign-rwanda-dr-congo-accord-even-as-violence-rages/article",
    "timestamp": "2025-12-04T02:08:15Z"
  },
  {
    "title": "The 26-minute Tuesday crash, 51% wipeout that deepened Trumps’ crypto woes",
    "description": "US News: The crash Tuesday in the crypto miner American Bitcoin Corp. was instantaneous. At 9.31am on Wall Street, just one minute after trading started, its s.",
    "link": "https://timesofindia.indiatimes.com/world/us/the-26-minute-tuesday-crash-51-wipeout-that-deepened-trumps-crypto-woes/articleshow/125756080.cms",
    "timestamp": "2025-12-04T02:04:13Z"
  },
  {
    "title": "State Department Slaps Trump’s Name on U.S. Institute of Peace Building and Renames It After Him",
    "description": "The State Department announced on Wednesday that it placed President Donald Trump's name on the building that houses the United States Institute of Peace.\nThe post State Department Slaps Trump’s Name on U.S. Institute of Peace Building and Renames It After Hi…",
    "link": "https://www.mediaite.com/politics/trump/state-department-slaps-trumps-name-on-u-s-institute-of-peace-building-and-renames-it-after-him/",
    "timestamp": "2025-12-04T02:01:44Z"
  },
  {
    "title": "Trump pardons media exec indicted by his own DOJ",
    "description": "President Donald Trump has issued a full pardon to Tim Leiweke, a media executive who co-founded the Oak View Group, according to CNN on Wednesday.The move is notable as, unlike many other controversial Trump clemencies for rich and well-connected people, thi…",
    "link": "https://www.rawstory.com/trump-pardons-2674368114/",
    "timestamp": "2025-12-04T02:01:30Z"
  },
  {
    "title": "Dollar weak with rate-cut enthusiasm intact, euro at 7-week high",
    "description": "The U.S. dollar weakened as lackluster economic data bolstered expectations of a Federal Reserve rate cut. This boosted the euro to a near seven-week high and provided relief to the yen. Investors are also considering the potential impact of Kevin Hassett as …",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-weak-with-rate-cut-enthusiasm-intact-euro-at-7-week-high/articleshow/125756096.cms",
    "timestamp": "2025-12-04T02:01:29Z"
  },
  {
    "title": "'Don't Stay Silent!' 30 Celebrities Who Have Spoken Out Against ICE... Including One A-List Actor Who Labeled Agency a 'Racist Force'",
    "description": "Celebrities have issued sharp rebukes of U.S. Immigration and Customs Enforcement (ICE) amid controversial mass deportation efforts and immigration raids.",
    "link": "https://okmagazine.com/p/stars-whove-spoken-out-against-ice-photos/",
    "timestamp": "2025-12-04T02:00:00Z"
  },
  {
    "title": "Gold holds steady after weak US jobs data reinforce rate-cut bets",
    "description": "Gold prices held steady above $4,200 on Thursday, driven by weak private payrolls data. This reinforced expectations of a U.S. interest rate cut at the Federal Reserve's upcoming meeting. The dollar also hit a five-week low, further favoring non-yielding asse…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-holds-steady-after-weak-us-jobs-data-reinforce-rate-cut-bets/articleshow/125756069.cms",
    "timestamp": "2025-12-04T01:57:32Z"
  },
  {
    "title": "With Trump’s focus abroad, Republicans push for midterms pivot to economy | CNN Politics",
    "description": "Some of President Donald Trump’s closest allies in Congress are warning that the party needs to sharpen its affordability message to voters heading into the 2026 elections — or risk big losses that would shackle him for the rest of his second term.",
    "link": "https://www.cnn.com/2025/12/03/politics/republicans-midterm-message-economy-trump",
    "timestamp": "2025-12-04T01:56:28Z"
  },
  {
    "title": "Oil prices firm after Ukrainian strikes on Russian oil infrastructure, stalled peace talks",
    "description": "Oil prices edged higher as Ukrainian attacks on Russia's Druzhba pipeline and stalled peace talks hinted at potential supply disruptions. Despite these factors, weak global demand and oversupply concerns limited gains, with Fitch Ratings lowering its future o…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-prices-firm-after-ukrainian-strikes-on-russian-oil-infrastructure-stalled-peace-talks/articleshow/125756037.cms",
    "timestamp": "2025-12-04T01:55:23Z"
  },
  {
    "title": "Netanyahu to visit New York despite Mamdani arrest threat",
    "description": "Israeli Prime Minister Benjamin Netanyahu will visit New York. Incoming mayor Zohran Mamdani has threatened arrest over an International Criminal Court warrant. Netanyahu stated he will attend a New York Times event. Mamdani supports Israel's right to exist b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/netanyahu-to-visit-new-york-despite-mamdani-arrest-threat/articleshow/125756026.cms",
    "timestamp": "2025-12-04T01:54:32Z"
  },
  {
    "title": "Social media reacts to Diego Pavia's call for Donald Trump's intervention in CFP rankings",
    "description": "Vanderbilt quarterback Diego Pavia has found himself thrusted into the national spotlight after making a special request to U.S President Donald Trump.\n\nFollowing a tumultuous Tenn",
    "link": "https://www.marca.com/en/ncaa/2025/12/04/6930e88522601da6618b45d3.html",
    "timestamp": "2025-12-04T01:50:14Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang visits Republicans as debate over intensifying AI race rages",
    "description": "Nvidia CEO Jensen Huang is making the rounds in Washington",
    "link": "https://abcnews.go.com/Technology/wireStory/nvidia-ceo-jensen-huang-visits-republicans-debate-intensifying-128093184",
    "timestamp": "2025-12-04T01:50:02Z"
  },
  {
    "title": "Trump says Witkoff had 'reasonably good meeting' with Putin despite no breakthrough",
    "description": "President Donald Trump said he was briefed by his envoy Steve Witkoff and son-in-law Jared Kushner about their meeting with Vladimir Putin in Moscow on Tuesday",
    "link": "https://abcnews.go.com/Politics/trump-witkoff-kushner-good-meeting-putin-despite-breakthrough/story?id=128083189",
    "timestamp": "2025-12-04T01:49:30Z"
  },
  {
    "title": "Hegseth could have endangered troop safety with Signal chat - Pentagon watchdog",
    "description": "In sharing details about an attack in a group chat on the unsecured app, the defence secretary put troops at risk, inspector general finds.",
    "link": "https://www.bbc.com/news/articles/cx2ej74pxdro",
    "timestamp": "2025-12-04T01:49:20Z"
  },
  {
    "title": "Healey blasts Trump on threat to withhold SNAP funding, won’t provide data",
    "description": "Gov. Maura Healey is condemning President Donald Trump for threatening to withhold federal SNAP funding from 21 blue states.",
    "link": "https://www.bostonherald.com/2025/12/03/healey-blasts-trump-on-threat-to-withhold-snap-funding-wont-provide-data/",
    "timestamp": "2025-12-04T01:44:55Z"
  },
  {
    "title": "Rand Paul Bashes Pete Hegseth Over Boat Bombings: 'He Was Lying…or He's Incompetent'",
    "description": "Sen. Rand Paul says Defense Secretary Pete Hegseth is either lying about the strikes on alleged drug traffickers in the Caribbean Sea or is incompetent.",
    "link": "https://reason.com/2025/12/03/rand-paul-bashes-pete-hegseth-over-boat-bombings-he-was-lying-or-hes-incompetent/",
    "timestamp": "2025-12-04T01:42:21Z"
  },
  {
    "title": "Trump pardons former top entertainment executive who was charged by his own Justice Department",
    "description": "President Donald Trump issued a “full and unconditional pardon” for Oak View Group co-founder Tim Leiweke, who was indicted by the president’s own Justice Department earlier this year, according to a document released online. A federal grand jury indicted Lei…",
    "link": "https://freerepublic.com/focus/f-news/4355827/posts",
    "timestamp": "2025-12-04T01:40:28Z"
  },
  {
    "title": "Maduro confirms he spoke to Trump",
    "description": "Venezuelan President Nicolas Maduro confirmed on Wednesday that he had a \"respectful and cordial\" conversation with US President Donald Trump about 10 days ago.Maduro added that steps are being taken toward a respectful dialogue between the two countries.",
    "link": "https://www.israelnationalnews.com/flashes/671709",
    "timestamp": "2025-12-04T01:40:05Z"
  },
  {
    "title": "Minneapolis Immigration Raid: ICE Targets Undocumented Somali Migrants After Trump Calls Them 'Garbage'",
    "description": "ICE launched a major crackdown in Minneapolis, targeting undocumented Somali migrants in an operation following comments made by President Donald Trump.",
    "link": "https://www.ibtimes.com/minneapolis-immigration-raid-ice-targets-undocumented-somali-migrants-after-trump-calls-them-3791892",
    "timestamp": "2025-12-04T01:39:59Z"
  },
  {
    "title": "Putin Says Russia Ready for War With Europe: Experts Name Nations Most Likely to Survive WW3",
    "description": "Global tensions rise as Vladimir Putin declares Russia ready for war. Experts identify the safest remote nations, from Antarctica to New Zealand, to survive World War III.",
    "link": "https://www.ibtimes.com/putin-says-russia-ready-war-europe-experts-name-nations-most-likely-survive-ww3-3791889",
    "timestamp": "2025-12-04T01:39:42Z"
  },
  {
    "title": "World Cup draw starts countdown to 2026 finals with Trump presiding",
    "description": "The countdown to the first 48-team World Cup begins in earnest on Friday as the draw for the 2026 finals takes place in Washington, with Donald Trump set to dominate much of the attention.Six places at the finals are still to be decided in playoffs, the winne…",
    "link": "https://sports.yahoo.com/articles/world-cup-draw-starts-countdown-013926163.html",
    "timestamp": "2025-12-04T01:39:26Z"
  }
]