[
  {
    "title": "Carville demands Dems ‘kick the s--- out of’ JD Vance over 'Martha's Vineyard of England vacation",
    "description": "James Carville blasted JD Vance for stumping for Trump's $3.3 trillion legislation and taking a vacation to England's wealthy Oxfordshire region.",
    "link": "https://www.foxnews.com/media/carville-demands-dems-kick-s-out-of-jd-vance-over-marthas-vineyard-england-vacation",
    "timestamp": "2025-08-21T19:00:05Z"
  },
  {
    "title": "Crypto Can Coexist With Banks, Federal Reserve Governor Says",
    "description": "US Federal Reserve Governor Christopher Waller told an audience in Wyoming that crypto transactions should not be treated as something foreign or alarming. Related Reading: Yuan-Pegged Stablecoins On The Horizon As Beijing Rethinks Policy Speaking at the Wyom…",
    "link": "https://bitcoinist.com/crypto-can-coexist-with-banks-federal-reserve-governor-says/",
    "timestamp": "2025-08-21T19:00:04Z"
  },
  {
    "title": "The Irish Times view on the US/EU trade statement: some certainty on tariffs",
    "description": "The agreement to cap pharma tariffs at 15 per cent removes a key risk from the economic outlook",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/08/21/the-irish-times-view-on-the-useu-trade-statement-some-certainty-on-tariffs/",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Creatorverse: The White House Joining TikTok Means It’s Safe, Right?",
    "description": "Though it seems like a U.S. sale is happening, TikTokers are getting sick of this saga\nThe post Creatorverse: The White House Joining TikTok Means It’s Safe, Right? appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creatorverse-the-white-house-is-tiktok-safe/",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Arctic Drilling on the Table as India Buys Discounted Russian Oil",
    "description": "Russia and India are interested in collaborating on joint energy projects, including oil and gas production in Russia’s Far East and Arctic shelf, Russian Foreign Minister Sergei Lavrov said on Thursday after meeting with his Indian counterpart in Moscow. Ear…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Arctic-Drilling-on-the-Table-as-India-Buys-Discounted-Russian-Oil.html",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Walmart to Increase Prices ‘On a Week-to-Week Basis’ Due to Trump Tariffs: Report",
    "description": "Walmart will soon begin increasing prices across its inventory in response to the tariffs imposed by President Donald Trump.\nThe post Walmart to Increase Prices ‘On a Week-to-Week Basis’ Due to Trump Tariffs: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/walmart-to-increase-prices-on-a-week-to-week-basis-due-to-trump-tariffs-report/",
    "timestamp": "2025-08-21T18:59:31Z"
  },
  {
    "title": "Trump admin assigns military attorneys to prosecute DC crimes amid federal crackdown",
    "description": "Military lawyers deployed to handle misdemeanor prosecutions in D.C. while federal law enforcement arrests 630 people in Trump's ongoing crime reduction initiative",
    "link": "https://www.foxnews.com/us/trump-admin-assigns-military-attorneys-prosecute-dc-crimes-amid-federal-crackdown",
    "timestamp": "2025-08-21T18:57:57Z"
  },
  {
    "title": "Carney and Trump speak for the first time since blowing past trade deal deadline",
    "description": "Prime Minister Mark Carney spoke to his U.S. counterpart by phone Thursday — the first time the leaders have spoken since the two sides failed to reach a deal on a trade agreement earlier this month.",
    "link": "https://www.cbc.ca/news/world/carney-trump-phone-call-trade-1.7614947",
    "timestamp": "2025-08-21T18:57:02Z"
  },
  {
    "title": "Ukraine becoming the ‘Silicon Valley’ of defense as startups develop long-range drones and missiles",
    "description": "Last September, a Ukrainian-made drone attacked a Russian ammunition depot more than 620 miles away. This marked a significant achievement for Fire Point, the company behind the drones.",
    "link": "https://www.pbs.org/newshour/world/ukraine-becoming-the-silicon-valley-of-defense-as-startups-develop-long-range-drones-and-missiles",
    "timestamp": "2025-08-21T18:56:37Z"
  },
  {
    "title": "Putin issues formal demands to end Ukraine war after meeting Trump: report",
    "description": "Russian president reportedly willing to freeze current front lines in exchange for Ukraine territorial concessions and NATO membership ban.",
    "link": "https://www.foxnews.com/world/putin-issues-formal-demands-end-ukraine-war-after-meeting-trump-report",
    "timestamp": "2025-08-21T18:56:00Z"
  },
  {
    "title": "Lawyers for Brazil's Bolsonaro surprised by new accusation of obstruction of justice",
    "description": "Lawyers for former Brazilian President Jair Bolsonaro say they are surprised by the federal police's decision to formally accuse him of obstruction of justice",
    "link": "https://abcnews.go.com/International/wireStory/lawyers-brazils-bolsonaro-surprised-new-accusation-obstruction-justice-124857089",
    "timestamp": "2025-08-21T18:54:47Z"
  },
  {
    "title": "House Democrats demand answers on Trump-Paramount “bribe”",
    "description": "The accusation comes after an alleged \"side deal\" between Trump and the media company",
    "link": "https://www.salon.com/2025/08/21/house-democrats-demand-answers-on-trump-paramount-bribe/",
    "timestamp": "2025-08-21T18:54:04Z"
  },
  {
    "title": "Jack White Fires Back After White House Official Name Calling",
    "description": "Jack White fires back at White House Communications Director Steven Cheung after being called a 'has been loser' over his critique of the Oval Office. Continue reading…",
    "link": "https://loudwire.com/jack-white-fires-back-white-house-official/",
    "timestamp": "2025-08-21T18:53:29Z"
  },
  {
    "title": "Court Rules With SpaceX in Case Seeking to Gut NLRB, in Blow to Workers’ Rights",
    "description": "“This disastrous decision cannot stand,” said Sen. Bernie Sanders.",
    "link": "https://truthout.org/articles/court-rules-with-spacex-in-case-seeking-to-gut-nlrb-in-blow-to-workers-rights/",
    "timestamp": "2025-08-21T18:53:04Z"
  },
  {
    "title": "Stephen Miller's latest tirade just exposed Trump's 'major vulnerability': analysts",
    "description": "President Donald Trump's deputy chief of staff, Stephen Miller, went off on a fascist rant during an event that was supposed to be about thanking the National Guard. And two analysts say he just exposed a \"big weakness.\"Vice President JD Vance and Secretary o…",
    "link": "https://www.rawstory.com/stephen-miller-2673908421/",
    "timestamp": "2025-08-21T18:50:19Z"
  },
  {
    "title": "Bernie Sanders and Donald Trump form an unlikely alliance over billions in chipmaker subsidies",
    "description": "Trump has a newfound taste for state involvement in the private sector. It’s a palette Sanders has long enjoyed.",
    "link": "https://fortune.com/2025/08/21/bernie-sanders-donald-trump-intel-chips/",
    "timestamp": "2025-08-21T18:50:13Z"
  },
  {
    "title": "Trump says will patrol streets of US capital with troops Thursday",
    "description": "US President Donald Trump plans to patrol Washington streets with police and National Guard. He deployed troops to combat crime in the Democrat-run city. Vice President JD Vance faced protests during a troop visit. Republican states are sending additional Nat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-will-patrol-streets-of-us-capital-with-troops-thursday/articleshow/123439857.cms",
    "timestamp": "2025-08-21T18:49:56Z"
  },
  {
    "title": "What to know about changing COVID vaccine guidelines",
    "description": "COVID-19 cases are on the rise again, and the federal guidelines for who should get vaccinated are in flux. We’ll unpack how it could impact what insurers are willing to cover this fall. And, as President Trump’s federal takeover of Washington D.C. continues,…",
    "link": "https://www.marketplace.org/episode/2025/08/21/what-to-know-about-changing-covid-vaccine-guidelines",
    "timestamp": "2025-08-21T18:49:34Z"
  },
  {
    "title": "Trump can’t stop America from building cheap EVs",
    "description": "President Donald Trump has made no secret of his disdain for electric vehicles and is slamming the brakes on government incentives to get them into more driveways. He’s been working to undo policies that promote clean technologies while increasing support for…",
    "link": "https://www.vox.com/climate/458567/trump-ford-electric-car-tax-credit-f-f150",
    "timestamp": "2025-08-21T18:48:03Z"
  },
  {
    "title": "NTSB investigating why Tesla is slow in reporting crashes involving self-driving technology",
    "description": "Federal car safety regulators opened an investigation Thursday into why Tesla has repeatedly broken rules requiring it to tell them quickly about crashes involving its self-driving technology.",
    "link": "https://www.pbs.org/newshour/nation/ntsb-investigating-why-tesla-is-slow-in-reporting-crashes-involving-self-driving-technology",
    "timestamp": "2025-08-21T18:46:24Z"
  },
  {
    "title": "Trump to sign executive order to punish those who burn American flags (Alayna Treene/CNN)",
    "description": "Alayna Treene / CNN:\nTrump to sign executive order to punish those who burn American flags  —  President Donald Trump is expected to sign an executive order on Thursday that would direct the Justice Department to try to bring charges against people who burn t…",
    "link": "https://www.memeorandum.com/250821/p87",
    "timestamp": "2025-08-21T18:45:01Z"
  },
  {
    "title": "President Trump to Go on Crime Patrol with Police and Military in Washington, DC",
    "description": "President Donald Trump is slated to go on crime patrol in Washington, DC, with the police and military, he revealed during an interview aired on \"The Todd Starnes Show\" Thursday.\nThe post President Trump to Go on Crime Patrol with Police and Military in Washi…",
    "link": "https://www.breitbart.com/politics/2025/08/21/president-trump-to-go-on-crime-patrol-with-police-and-military-in-washington-dc/",
    "timestamp": "2025-08-21T18:44:18Z"
  },
  {
    "title": "Appeals Court Allows Trump to End 'Temporary' Amnesty for 60,000 Migrants",
    "description": "Trump can end TPS for tens of thousands of migrants living in the United States, the Ninth Circuit Court of Appeals ruled this week.\nThe post Appeals Court Allows Trump to End ‘Temporary’ Amnesty for 60,000 Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/21/appeals-court-allows-trump-end-temporary-amnesty-60000-migrants/",
    "timestamp": "2025-08-21T18:43:50Z"
  },
  {
    "title": "Trump Orders Smithsonian To Display Exhibit Of Old Cracker Barrel Logo",
    "description": "WASHINGTON, D.C. — As part of his comprehensive overhaul of America's national museums, President Donald Trump ordered the Smithsonian to display an exhibit of the now-defunct Cracker Barrel logo.",
    "link": "https://babylonbee.com/news/trump-orders-smithsonian-to-display-exhibit-of-old-cracker-barrel-logo",
    "timestamp": "2025-08-21T18:42:42Z"
  },
  {
    "title": "Ted Cruz Gets Played Off Fox News By Hilariously Loud Background Music",
    "description": "The Texas Republican was criticizing Gov. Gavin Newsom (D-Calif.) for nearly half a minute over a hilariously unrelenting score.",
    "link": "https://www.huffpost.com/entry/ted-cruz-played-off-fox-news-interview-music_n_68a72522e4b0d184fdf4eb8a",
    "timestamp": "2025-08-21T18:41:14Z"
  },
  {
    "title": "Ted Cruz Gets Played Off Fox News By Hilariously Loud Background Music",
    "description": "The Texas Republican was criticizing Gov. Gavin Newsom (D-Calif.) for nearly half a minute over a hilariously unrelenting score.",
    "link": "https://www.huffpost.com/entry/ted-cruz-played-off-fox-news-interview-music_n_68a72522e4b0d184fdf4eb8a?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-21T18:41:14Z"
  },
  {
    "title": "Trump goes on $100 million bond buying spree: Here’s what it could signal about future interest rates",
    "description": "President Donald Trump has reportedly put $100 million into bonds since taking office in January, through a mixed bet on the debt of both big companies like Meta and Home Depot as well as municipal governments and public entities. The move is notable because …",
    "link": "https://biztoc.com/x/8ffc68b0132bb628",
    "timestamp": "2025-08-21T18:41:09Z"
  },
  {
    "title": "Trump, Carney talk trade and security",
    "description": "Canadian Prime Minister Mark Carney spoke with United States President Donald Trump on Thursday, according to a statement from Carney's office. The discussion covered trade issues, economic opportunit...",
    "link": "https://biztoc.com/x/8c0160018a71640a",
    "timestamp": "2025-08-21T18:40:52Z"
  },
  {
    "title": "Gavin Newsom's Trump-style trolling roils critics while thrilling fans",
    "description": "At this point, it feels unfathomable for a politician to campaign or legislate without some form of social media presence. It's a perhaps inevitable technological advance cemented in place by President Donald Trump's bombastic use of the medium. But if Trump …",
    "link": "https://biztoc.com/x/58f6681c0a78610e",
    "timestamp": "2025-08-21T18:40:49Z"
  },
  {
    "title": "VIDEO: WINNING!!! NY Appeals Court Tosses Out $500 Million Trump Civil Fraud Penalty",
    "description": "VIDEOCall it Karmatic Kickback! While CORRUPT Letitia James is now facing federal criminal charges of mortgage fraud, President Donald Trump had the absurd $500 million civil fraud penalty tossed out by the New York Appeals Court in the case that James had be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335934/posts",
    "timestamp": "2025-08-21T18:40:36Z"
  },
  {
    "title": "Laura Loomer Wants to Bring Back the Red Scare",
    "description": "Right-wing influencer Laura Loomer wants to Make America McCarthyist Again. The 32-year-old MAGA influencer, who seemingly has President Donald Trump’s ear, ...",
    "link": "https://www.thedailybeast.com/laura-loomer-wants-to-bring-back-the-red-scare/",
    "timestamp": "2025-08-21T18:40:17Z"
  },
  {
    "title": "Viral: Cracker Barrel's new logo sparks social media backlash, here's why",
    "description": "Cracker Barrel unveiled its updated logo as part of its \"All the More\" fall menu campaign, removing the iconic old man figure. The change has sparked significant backlash online, with critics, including Donald Trump Jr., expressing disappointment. Shares of t…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/viral-cracker-barrels-new-logo-sparks-social-media-backlash-heres-why/articleshow/123439104.cms",
    "timestamp": "2025-08-21T18:40:02Z"
  },
  {
    "title": "Team Trump finds something new to weaponize: mortgage fraud allegations",
    "description": "The Trump administration accused Adam Schiff of mortgage fraud. Then it happened again with Letitia James. And then it happened again with Lisa Cook.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-finds-something-new-weaponize-mortgage-fraud-allegations-rcna226381",
    "timestamp": "2025-08-21T18:39:48Z"
  },
  {
    "title": "RFK Jr.’s Misguided War on mRNA",
    "description": "Covid vaccine mandates and a lack of transparency by public-health experts produced many unintended effects—or what scientists call “off target” responses. One is a political turn against mRNA technology that could damage U.S. innovation and pandemic prepared…",
    "link": "https://freerepublic.com/focus/f-news/4335933/posts",
    "timestamp": "2025-08-21T18:39:38Z"
  },
  {
    "title": "Redistricting would split cities, counties throughout CA",
    "description": "(The Center Square) – Lodi, a Northern California city of 66,000 people, will be divided among three congressional districts if a Democratic Party-backed...",
    "link": "https://www.thecentersquare.com/california/article_e6fadf3d-48a8-4bbc-ba40-65ed086fb61e.html",
    "timestamp": "2025-08-21T18:39:00Z"
  },
  {
    "title": "US DOJ to back off money transmitter cases in shift backed by crypto",
    "description": "The U.S. Justice Department does not plan to target software developers that create decentralized platforms for transmitting cryptocurrencies without criminal intent, a Justice official said on Thursday.Marking the latest sign of the U.S. government's changin…",
    "link": "https://www.channelnewsasia.com/business/us-doj-back-money-transmitter-cases-shift-backed-crypto-5307656",
    "timestamp": "2025-08-21T18:38:19Z"
  },
  {
    "title": "Fatal Florida crash fuels immigration fight between DeSantis and Newsom",
    "description": "Florida Republican Gov. Ron DeSantis dispatched his top deputy to California to oversee the handover of a truck driver accused of making an illegal U-turn that killed three people in Florida",
    "link": "https://abcnews.go.com/US/wireStory/fatal-florida-crash-fuels-immigration-fight-desantis-newsom-124855967",
    "timestamp": "2025-08-21T18:38:18Z"
  },
  {
    "title": "Tesla is slow in reporting crashes and the feds have launched an investigation to find out why",
    "description": "Federal car safety regulators opened an investigation Thursday into why Tesla has repeatedly broken rules requiring it to tell them quickly about crashes involving its self-driving technology that may soon be deployed in millions of its cars on U.S. roads",
    "link": "https://abcnews.go.com/Business/wireStory/tesla-slow-reporting-crashes-feds-launched-investigation-find-124853083",
    "timestamp": "2025-08-21T18:38:17Z"
  },
  {
    "title": "Why Nvidia Matters More To Markets Than The Fed",
    "description": "Options traders are betting Powell's comments will move the market up or down by 0.8 percentage points while Nvidia's q2 2026 results could move the market 0.9 points.",
    "link": "https://www.forbes.com/sites/petercohan/2025/08/21/why-nvidia-matters-more-to-markets-than-the-fed/",
    "timestamp": "2025-08-21T18:36:55Z"
  },
  {
    "title": "South Park Calls Out ChatGPT and Useless Tech Bro Sycophants",
    "description": "Season 27's latest episode rails against a tech industry that simply reinforces our silliest impulses.",
    "link": "https://www.esquire.com/entertainment/tv/a65861699/south-park-season-27-episode-3-recap/",
    "timestamp": "2025-08-21T18:36:00Z"
  },
  {
    "title": "Gavin Newsom's Trump-style trolling roils critics while thrilling fans",
    "description": "The California governor has turned his X account into a cutting parody of Trump's digital cadence, angering Fox News conservatives",
    "link": "https://theweek.com/politics/gavin-newsom-troll-trump-x",
    "timestamp": "2025-08-21T18:35:52Z"
  },
  {
    "title": "About 600 CDC workers terminated after court clears part of Trump admin restructuring plan",
    "description": "About 600 employees were laid off from the Centers for Disease Control and Prevention as part of the Health and Human Services restructuring plan.",
    "link": "https://www.foxnews.com/us/about-600-cdc-workers-terminated-after-court-clears-part-trump-admin-restructuring-plan",
    "timestamp": "2025-08-21T18:34:29Z"
  },
  {
    "title": "Trump goes on $100 million bond buying spree: Here’s what it could signal about future interest rates",
    "description": "Trump’s bond buying strategy could be a mix of tax savings and potential profit-taking.",
    "link": "https://fortune.com/2025/08/21/trump-bond-buying-spree-100-million-stock-market/",
    "timestamp": "2025-08-21T18:34:14Z"
  },
  {
    "title": "Performing fascism",
    "description": "My favorite vignette from this whole “controversy” is some right wing influencer (not looking it up) who posted that you had to excuse him for not believing the DC crime statistics because he got off the train and saw some “youths” if you know what I mean and…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/performing-fascism",
    "timestamp": "2025-08-21T18:33:45Z"
  },
  {
    "title": "Swing-state gov slams Trump plan to nix mail-in voting: He ‘can sign whatever the hell he wants’",
    "description": "Trump faces pushback from Pennsylvania's Josh Shapiro over proposed executive order to end mail-in ballots for 2026 midterm elections and future contests",
    "link": "https://www.foxnews.com/politics/swing-state-gov-slams-trump-plan-nix-mail-in-voting-he-can-sign-whatever-hell-he-wants",
    "timestamp": "2025-08-21T18:32:33Z"
  },
  {
    "title": "Trump Administration's Use of Travel Ban Dealt Blow from Judge",
    "description": "The federal court ruling benefits diversity visa applicants from nations such as Afghanistan, Burma, Togo, Somalia and Iran.",
    "link": "https://www.newsweek.com/trump-travel-ban-visas-migrants-immigration-judge-decision-2117265",
    "timestamp": "2025-08-21T18:31:19Z"
  },
  {
    "title": "Will Trey Parker Still Be ‘D&D’ Buddies with Elon Musk After This Week’s Ketamine-Filled ‘South Park’?",
    "description": "By\n JM McNab\n Published: August 21st, 2025",
    "link": "https://www.cracked.com/article_47980_will-trey-parker-still-be-dd-buddies-with-elon-musk-after-this-weeks-ketamine-filled-south-park.html",
    "timestamp": "2025-08-21T18:30:00Z"
  },
  {
    "title": "Breaking: agreements have been reached with 10 FBI Whistleblowers (and counsel) to include a combination of backpay, security clearance, and reinstatement",
    "description": "Breaking: agreements have been reached with 10 FBI Whistleblowers (and counsel) to include a combination of backpay, security clearance, and reinstatement. We greatly appreciate Donald Trump commitment to transparency and accountability. Thank you to Chuck Gr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335932/posts",
    "timestamp": "2025-08-21T18:26:44Z"
  },
  {
    "title": "Fatal Florida crash fuels immigration fight between DeSantis and Newsom",
    "description": "Florida Republican Gov. Ron DeSantis dispatched his top deputy to California to oversee the handover of a truck driver accused of making an illegal U-turn...",
    "link": "https://www.yahoo.com/news/articles/fatal-florida-crash-fuels-immigration-182549801.html",
    "timestamp": "2025-08-21T18:25:49Z"
  },
  {
    "title": "Meidas: World Leaders Tear Trump to Pieces in Aftermath of Visit",
    "description": "MeidasTouch host Ben Meiselas reports on world leaders losing it with Donald Trump in the aftermath of their meeting in Washington DC this week and they are going public with how pissed they are at Trump.",
    "link": "https://littlegreenfootballs.com/article/54853_Meidas-_World_Leaders_Tear_Tru",
    "timestamp": "2025-08-21T18:23:30Z"
  },
  {
    "title": "A week of summits reveals Trump is closer to Moscow than Europe",
    "description": "US summits with Putin and European leaders offered a glimmer of hope for peace, but Russia seemed to cloud it.",
    "link": "https://www.aljazeera.com/news/2025/8/21/a-week-of-summits-reveals-trump-is-closer-to-moscow-than-europe",
    "timestamp": "2025-08-21T18:21:59Z"
  },
  {
    "title": "Illegal immigration hit record of 14 million in 2023, Pew report finds",
    "description": "A closely watched report says the number of people in the United States illegally surged to an all-time high of 14 million in 2023.",
    "link": "https://www.pbs.org/newshour/nation/illegal-immigration-hit-record-of-14-million-in-2023-pew-report-finds",
    "timestamp": "2025-08-21T18:21:59Z"
  },
  {
    "title": "Russian cruise missiles hit US company in massive Ukraine strike amid Trump’s peace push",
    "description": "In one of the largest overnight strikes since the war began, Russia unleashed some 614 drones, ballistic and cruise missiles across Ukraine, killing one, injuring dozens and destroying an American-owned electronics company less than an hour from two NATO bord…",
    "link": "https://freerepublic.com/focus/f-news/4335930/posts",
    "timestamp": "2025-08-21T18:20:55Z"
  },
  {
    "title": "New shocking surgery details emerge around cause of Hulk Hogan’s death",
    "description": "A potentially massive error during one of his surgeries may have contributed to Hulk Hogan's death.",
    "link": "https://nypost.com/2025/08/21/sports/new-shocking-surgery-details-emerge-around-cause-of-hulk-hogans-death/",
    "timestamp": "2025-08-21T18:20:52Z"
  },
  {
    "title": "'Stalin was soft spoken too': JD Vance under fire for fawning Putin comments",
    "description": "Vice President JD Vance is facing fire after heaping praise on Russian President Vladimir Putin, a former top KGB spy who is now an accused war criminal wanted by the International Criminal Court, with an arrest warrant for war crimes that is enforceable in 1…",
    "link": "https://www.rawstory.com/jd-vance-putin/",
    "timestamp": "2025-08-21T18:20:23Z"
  },
  {
    "title": "Marlow: The Eighth Amendment Takes Down Letitia James’s Trump Case; Now She Should Be Disbarred",
    "description": "In \"Breaking the Law,\" I made the case that the nearly-$500 million fined imposed on Donald Trump by Judge Arthur Engeron in Letitia James’s civil fraud case was a cruel and unusual punishment. Today, the courts agreed with me.\nThe post Marlow: The Eighth Ame…",
    "link": "https://www.breitbart.com/politics/2025/08/21/marlow-the-eighth-amendment-takes-down-letitia-jamess-trump-case-now-she-should-be-disbarred/",
    "timestamp": "2025-08-21T18:19:24Z"
  },
  {
    "title": "Trump Waxes Poetic On Religion And Getting Into Heaven: ‘There Has to be Some Kind of a Report Card’",
    "description": "President Donald Trump waxes poetic about getting into heaven once again and questioned how any evangelical could not vote for him.\nThe post Trump Waxes Poetic On Religion And Getting Into Heaven: ‘There Has to be Some Kind of a Report Card’ first appeared on…",
    "link": "https://www.mediaite.com/media/radio/trump-waxes-poetic-on-religion-and-getting-into-heaven-there-has-to-be-some-kind-of-a-report-card/",
    "timestamp": "2025-08-21T18:19:07Z"
  },
  {
    "title": "Kiev’s European backers want F-35 ‘security guarantee‘ – The Times",
    "description": "President Donald Trump has ruled out deploying American troops, but is open to providing air support Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623383-european-nato-want-us-jets/",
    "timestamp": "2025-08-21T18:18:55Z"
  },
  {
    "title": "Justice Department urges Fed chair to fire top official accused of mortgage fraud",
    "description": "The pressure comes one day after President Donald Trump called for Fed Governor Lisa Cook to resign.",
    "link": "https://biztoc.com/x/c1ac328c64e595b6",
    "timestamp": "2025-08-21T18:18:26Z"
  },
  {
    "title": "Canada's Carney spoke to Trump and discussed trade, Ottawa says",
    "description": "Canadian Prime Minister Mark Carney spoke to U.S. President Donald Trump on Thursday and had \"a productive and wide-ranging conversation\" on trade challenges...",
    "link": "https://www.yahoo.com/news/articles/canadas-carney-spoke-trump-discussed-181647768.html",
    "timestamp": "2025-08-21T18:16:47Z"
  },
  {
    "title": "VINDICATED: Attorney Peter Ticktin Shares on the Tina Peters Case",
    "description": "Tina Peters could not make the VINDICATED event in Las Vegas but her attorney, Peter Ticktin, did make it and he updated the crowd on what is going on and what is next.  Peter Ticktin attended New York Military Academy for high school and was a classmate of f…",
    "link": "https://joehoft.com/vindicated-attorney-peter-ticktin-shares-on-the-tina-peters-case/",
    "timestamp": "2025-08-21T18:15:41Z"
  },
  {
    "title": "Timeline Extension Unlikely For Trump's 50% Tariffs On India: Peter Navarro",
    "description": "Peter Navarro, the White House trade adviser, said that he does not expect US President Donald Trump to extend the timeline for the 50% tariffs imposed on India beyond next week. Aug 27 is the deadline announced by Trump to slap the additional 25% tariffs on …",
    "link": "https://www.ndtvprofit.com/world/timeline-extension-unlikely-for-trumps-50-tariffs-on-india-peter-navarro",
    "timestamp": "2025-08-21T18:15:13Z"
  },
  {
    "title": "Ex-GOP leader goes on CNN, immediately continues feud with Trump loyalist",
    "description": "The former congressman seems like he can't live this down.",
    "link": "https://www.nj.com/politics/2025/08/ex-gop-leader-goes-on-cnn-immediately-continues-feud-with-trump-loyalist.html",
    "timestamp": "2025-08-21T18:13:30Z"
  },
  {
    "title": "‘Huge Win For Donald Trump’: CNN’s Elie Honig Explains ‘Monumental’ Ruling Against Letitia James",
    "description": "CNN's Elie Honig said on Thursday that an appeals court's \"monumental\" ruling against Attorney General Letitia James is a \"huge win\" for President Donald Trump.",
    "link": "https://dailycaller.com/2025/08/21/cnn-elie-honig-court-letitia-james/",
    "timestamp": "2025-08-21T18:13:00Z"
  },
  {
    "title": "India-Russia ties among steadiest of major relationships globally after WW-II: Jaishankar",
    "description": "AGENCY MOSCOW: India and Russia on Thursday vowed to expand their bilateral trade in a “balanced” manner and sustain energy cooperation with External Affairs Minister S Jaishankar underlining the need to “swiftly” address non-tariff barriers and regulatory im…",
    "link": "https://statetimes.in/india-russia-ties-among-steadiest-of-major-relationships-globally-after-ww-ii-jaishankar/",
    "timestamp": "2025-08-21T18:12:38Z"
  },
  {
    "title": "Meet Flamingo, the missile that brings European Russia within Kyiv’s range",
    "description": "\"You don’t need a scary name for a missile that can fly 3,000 kilometers,\" says one of the Flamingo's developers.",
    "link": "https://www.politico.eu/article/flamingo-ukraine-3000km-cruise-missile-woman-vladimir-putin-donald-trump-volodymyr-zelenskyy-drone/",
    "timestamp": "2025-08-21T18:12:34Z"
  },
  {
    "title": "Trump Is Already Lying About His New York Fraud Ruling",
    "description": "Donald Trump declared “total victory” over New York Attorney General Letitia James Thursday after a state appeals court tossed his bank fraud disgorgement.In several lengthy Truth Social posts, the president incorrectly claimed that the court had voted “5 to …",
    "link": "https://newrepublic.com/post/199414/donald-trump-lying-new-york-fraud-ruling",
    "timestamp": "2025-08-21T18:12:22Z"
  },
  {
    "title": "James Comey’s Unravelling Mind",
    "description": "In a bizarre and cringey five-and-a-half-minute video posted by James Comey to social media exclaiming his adoration of Taylor Swift, the former director of the FBI opens by claiming that Donald Trump is humiliating America through his negotiations with Vladi…",
    "link": "https://freerepublic.com/focus/f-news/4335927/posts",
    "timestamp": "2025-08-21T18:11:15Z"
  },
  {
    "title": "What about Texas? California Republicans pressed for answers in redistricting fight",
    "description": "Texas and President Donald Trump struck first in a gerrymandering battle that could tilt the 2026 midterms. That puts California Republicans in a bind as they contest Gov. Gavin Newsom’s redistricting.",
    "link": "https://www.kpbs.org/news/politics/2025/08/21/what-about-texas-california-republicans-pressed-for-answers-in-redistricting-fight",
    "timestamp": "2025-08-21T18:10:08Z"
  },
  {
    "title": "Appeals court throws out Trump's $454 million civil fraud judgment (ABC News)",
    "description": "ABC News:\nAppeals court throws out Trump's $454 million civil fraud judgment  —  A judge ruled last year that Trump inflated his worth to secure better loans.  —  President Donald Trump meets with Ukrainian President Volodymyr Zelensky in the Oval Office at t…",
    "link": "https://www.memeorandum.com/250821/p80",
    "timestamp": "2025-08-21T18:10:03Z"
  },
  {
    "title": "KFF Health News' 'What the Health?': Happy 60th, Medicare and Medicaid!",
    "description": "This summer marks the 60th anniversary of Medicare and Medicaid, the twin government programs that have shaped the health care system into what it is today. In this special episode, KFF Health News’ Julie Rovner interviews two experts on the history, signific…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-411-60th-anniversary-medicare-medicaid-august-21-2025/",
    "timestamp": "2025-08-21T18:10:00Z"
  },
  {
    "title": "Andy McCarthy Explains Why Appeals Court Tossed Letitia James’ ‘Ridiculous’ Penalty Against Trump",
    "description": "Andy McCarthy said the “outrageous penalty” leveled against Donald Trump by New York Judge Arthur Engoron was “ridiculous” given what had been established.",
    "link": "https://dailycaller.com/2025/08/21/andy-mccarthy-explains-why-appeals-court-tossed-letitia-james-ridiculous-penalty-against-trump/",
    "timestamp": "2025-08-21T18:09:20Z"
  },
  {
    "title": "Jasmine Crockett disparages MAGA voters, Trump as 'most unpatriotic people'",
    "description": "Democratic Rep. Jasmine Crockett took aim at President Donald Trump and his supporters on Wednesday, calling them unpatriotic during a conversation with Gavin Newsom.",
    "link": "https://www.foxnews.com/media/jasmine-crockett-tells-newsom-maga-voters-most-unpatriotic-people",
    "timestamp": "2025-08-21T18:08:10Z"
  },
  {
    "title": "Trump: 'Different tack' may be needed in Ukraine war",
    "description": "United States President Donald Trump said on Thursday that it should become clear within the next two weeks if his administration will be able to end the war in Ukraine and stressed that he may take a...",
    "link": "https://biztoc.com/x/2c1ec5b5a5ecfa5e",
    "timestamp": "2025-08-21T18:07:33Z"
  },
  {
    "title": "Tulsi Gabbard to downsize national intelligence office, adding to broader offensive",
    "description": "Director of National Intelligence Tulsi Gabbard speaks during a Cabinet meeting with President Donald Trump on Wednesday April 30, 2025 at the White House in Washington, D.C.",
    "link": "https://biztoc.com/x/78bb7588d1e5709b",
    "timestamp": "2025-08-21T18:07:19Z"
  },
  {
    "title": "Trump’s D.C. Takeover May Be a Prelude to Something Far Worse",
    "description": "It’s possible Donald Trump’s abrupt decision to “federalize” law enforcement in Washington, D.C., was just a one-off power grab, reflecting the federal government’s unique control of the capital city and Trump’s own obsession with Washington as a symbol of th…",
    "link": "https://freerepublic.com/focus/f-news/4335926/posts",
    "timestamp": "2025-08-21T18:06:35Z"
  },
  {
    "title": "Justice Department demanded details on transgender patients from at least 1 hospital",
    "description": "Federal investigators looking at gender-affirming care providers demanded that at least one hospital hand over information about individual patients.",
    "link": "https://www.pbs.org/newshour/nation/justice-department-demanded-details-on-transgender-patients-from-at-least-1-hospital",
    "timestamp": "2025-08-21T18:06:09Z"
  },
  {
    "title": "No Good, Very Rotten Numbers: Fatal Trend Gets Worse For Democrats",
    "description": "Voter registration numbers unveiled on Wednesday reveal the scope to which the Democratic Party has failed and show a fatal trend that is only getting worse.",
    "link": "https://dailycaller.com/2025/08/21/democratic-party-voter-registration-minorities-working-class-donald-trump/",
    "timestamp": "2025-08-21T18:06:02Z"
  },
  {
    "title": "‘Outrageous’: Jonathan Turley says Letitia James might not be done losing to Trump yet",
    "description": "'There are still legitimate questions here with regard to the injunctive relief'",
    "link": "https://www.wnd.com/2025/08/outrageous-jonathan-turley-says-letitia-james-might-not/",
    "timestamp": "2025-08-21T18:05:35Z"
  },
  {
    "title": "Amber Rose Goes After Liberals, Supports Trump’s Crackdown On Crime",
    "description": "Amber Rose unleashed on Liberals that are protesting against the Trump administration's crackdown on crime.",
    "link": "https://dailycaller.com/2025/08/21/amber-rose-support-crime-washington-dc-national-guard-jd-vance/",
    "timestamp": "2025-08-21T18:04:31Z"
  },
  {
    "title": "Cracker Barrel shares plummet after pushback on new logo, brand refresh",
    "description": "Shares of Cracker Barrel plunged over 12% on Thursday after the restaurant unveiled its new logo earlier this week as part of a larger brand refresh.",
    "link": "https://www.cnbc.com/2025/08/21/cracker-barrel-cbrl-new-logo-branding.html",
    "timestamp": "2025-08-21T18:02:23Z"
  },
  {
    "title": "Trump Says He’s ‘Going Out’ In D.C. Tonight To Join Military Patrols",
    "description": "The Trump administration ordered a takeover of the D.C. Metropolitan Police Department earlier this month.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/21/trump-says-hes-going-out-in-dc-tonight-to-join-military-patrols/",
    "timestamp": "2025-08-21T18:01:14Z"
  },
  {
    "title": "Did 70K Cambodian monks nominate Trump for Nobel Peace Prize?",
    "description": "Cambodia's Prime Minister Hun Manet nominated Trump for the Nobel Peace Prize on Aug. 7, 2025.",
    "link": "https://www.snopes.com//fact-check/trump-cambodian-monks-nobel-peace-prize/",
    "timestamp": "2025-08-21T18:01:00Z"
  },
  {
    "title": "US mines are literally throwing away critical minerals",
    "description": "The U.S. discards vast quantities of critical minerals in mine waste each year - including enough lithium to power 10 million EVs.",
    "link": "https://grist.org/science/us-mines-are-literally-throwing-away-critical-minerals/",
    "timestamp": "2025-08-21T18:00:00Z"
  },
  {
    "title": "Our high school clothes are cool again. Now we’re having a midlife crisis",
    "description": "Denim miniskirts. Babydoll tops. Can two elder millennials still pull them off?",
    "link": "https://www.washingtonpost.com/style/fashion/2025/08/18/millennial-fashion-abercrombie-hollister-gap-mall/",
    "timestamp": "2025-08-21T18:00:00Z"
  },
  {
    "title": "Ukraine Begins Work on Military Security Guarantees",
    "description": "The outline of a military component of security guarantees for Ukraine is already taking shape, a top Ukrainian official said as the United States reiterated that European countries will have to shoulder most of the burden in providing the guarantees. Work ha…",
    "link": "https://oilprice.com/Energy/Energy-General/Ukraine-Begins-Work-on-Military-Security-Guarantees.html",
    "timestamp": "2025-08-21T18:00:00Z"
  },
  {
    "title": "Are Syria and Israel about to normalize ties?",
    "description": "For the first time in decades, Syria and Israel have discussed the Golan Heights, Israeli troops in Syria and humanitarian aid for Syria's Druze community. Is this the beginning of establishing diplomatic ties?",
    "link": "https://www.dw.com/en/are-syria-and-israel-about-to-normalize-ties/a-73719699",
    "timestamp": "2025-08-21T17:59:00Z"
  },
  {
    "title": "Trump to visit local law enforcement and National Guard troops in D.C. on Thursday",
    "description": "Trump is expected to greet law enforcement personnel and National Guard troops in Washington, D.C., on Thursday, after he sent federal and military personnel onto the city streets earlier this month in what he said is an effort to fight crime, a White House o…",
    "link": "https://www.nbcnews.com/politics/white-house/trump-visit-local-law-enforcement-national-guard-troops-dc-thursday-rcna226367",
    "timestamp": "2025-08-21T17:57:30Z"
  },
  {
    "title": "Trump: Different tack may be needed in Ukraine war",
    "description": "United States President Donald Trump said on Thursday that it should become clear within the next two weeks if his administration will be able to end the war in Ukraine and stressed that he may take a...",
    "link": "https://biztoc.com/x/fc3329bf5eae607f",
    "timestamp": "2025-08-21T17:56:03Z"
  },
  {
    "title": "Walmart scoops customers from rivals but warns inventory cost is rising",
    "description": "Second-quarter results showed that the retailer has continued to benefit from price sensitivity among US consumers.",
    "link": "https://www.aljazeera.com/economy/2025/8/21/walmart-scoops-customers-from-rivals-but-warns-inventory-cost-is-rising",
    "timestamp": "2025-08-21T17:55:21Z"
  }
]