[
  {
    "title": "Bearing Witness in Black and White—Sebastião Salgado's Photos Against Environmental and Human Injustice | Opinion",
    "description": "The mourning of Sebastião Salgado's passing in Brazil and around the world is a testament to the power and necessity of his life's work. His legacy is to expose, provoke, and bear witness through art, to the realities of a troubled, yet beautiful, world.",
    "link": "https://www.newsweek.com/bearing-witness-black-whitesebastiao-salgados-photos-against-environmental-human-injustice-2096752",
    "timestamp": "2025-07-10T11:00:02Z"
  },
  {
    "title": "Trump's 'big beautiful bill' cuts food stamps for millions — the average family may lose $146 per month, report finds",
    "description": "A new law includes the largest-ever cuts to Supplemental Nutrition Assistance Program benefits. Here's how much that may reduce what families can spend on food.",
    "link": "https://www.cnbc.com/2025/07/10/trumps-big-beautiful-bill-cuts-snap-for-millions-of-families.html",
    "timestamp": "2025-07-10T11:00:01Z"
  },
  {
    "title": "Will Pete Hegseth’s ‘War on Woke’ Sideline Women?",
    "description": "Donald Trump’s Pentagon chief moderated his stance to get the job but is now pushing for change in the name of high standards.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/07/pete-hegseth-women-combat-troops/683454/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Major Real Estate Investment Firms Face Accusations with Criminal Implications",
    "description": "U.S. Developer Vows Vigorous Litigation & Project CompletionClick for Assets  MIAMI, July  10, 2025  (GLOBE NEWSWIRE) -- Two well-known U.S. real......",
    "link": "https://www.globenewswire.com/news-release/2025/07/10/3113124/0/en/Major-Real-Estate-Investment-Firms-Face-Accusations-with-Criminal-Implications.html",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Social Security & The Big Beautiful Bill",
    "description": "Despite hype, Social Security taxes remain unchanged. The new law adds a temporary Senior Bonus Deduction, offering limited relief for middle-income seniors.",
    "link": "https://www.forbes.com/sites/tomhager/2025/07/10/social-security--the-big-beautiful-bill/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "Trump's Tariffs Explained as the Biggest Deadline Gets Delayed Several Weeks",
    "description": "The pause on the biggest of Trump's tariffs won't pass this week, as planned, but the problems they present still loom large.",
    "link": "https://www.cnet.com/personal-finance/trumps-tariffs-explained-as-the-biggest-deadline-gets-delayed-several-weeks/",
    "timestamp": "2025-07-10T11:00:00Z"
  },
  {
    "title": "TikTok Working on Standalone App for American Users",
    "description": "TikTok’s standalone U.S. app will reportedly use a separate algorithm and data system. [contact-form-7] That’s according to a report Wednesday (July 9) by Reuters, citing sources familiar with the matter. These moves, the sources say, set the stage for a pote…",
    "link": "http://www.pymnts.com/news/international/2025/tiktok-working-on-standalone-app-for-american-users/",
    "timestamp": "2025-07-10T10:58:26Z"
  },
  {
    "title": "Hamas Says Israeli Troops Sticking Point In Truce Talks As Gaza Pounded",
    "description": "Hamas on Thursday said it opposes any ceasefire deal that includes a large Israeli military presence in Gaza, after offering to release some hostages and as the civil defence reported scores of civilians killed across the Palestinian territory.",
    "link": "https://www.ibtimes.com/hamas-says-israeli-troops-sticking-point-truce-talks-gaza-pounded-3778112",
    "timestamp": "2025-07-10T10:57:22Z"
  },
  {
    "title": "Ukraine Hit With Deadly Attack As Allies Meet On Recovery",
    "description": "Ukraine’s allies gathering in Rome to discuss the nation’s postwar revival will be forced to grapple with the reality that such a prospect is more remote than ever as Russia unleashed its latest deadly air strike on Kyiv.Two people were killed and 16 wounded …",
    "link": "https://www.ndtvprofit.com/world/ukraine-hit-with-deadly-attack-as-allies-meet-on-recovery",
    "timestamp": "2025-07-10T10:55:35Z"
  },
  {
    "title": "Links 7/10/2025",
    "description": "Our ethereal daily links, including Trump unleashes more tariffs while morphing into a Russia hawk again, Epstein under the rug, and earth spinning faster.",
    "link": "https://www.nakedcapitalism.com/2025/07/links-7-10-2025.html",
    "timestamp": "2025-07-10T10:55:09Z"
  },
  {
    "title": "Secret Service Suspends 6 Agents Over Trump Assassination Attempt in Butler, PA: ‘Operational Failure’",
    "description": "The Secret Service suspended six agents without pay in a move acknowledging critical security failures during last year’s assassination attempt on Trump.\nThe post Secret Service Suspends 6 Agents Over Trump Assassination Attempt in Butler, PA: ‘Operational Fa…",
    "link": "https://www.mediaite.com/media/news/secret-service-suspends-6-agents-over-trump-assassination-attempt-in-butler-pa-operational-failure/",
    "timestamp": "2025-07-10T10:50:58Z"
  },
  {
    "title": "Trump asks Liberian president where he learnt English – it’s Liberia’s official language",
    "description": "President Donald Trump praised his Liberian counterpart for his “beautiful English”, during a meeting at the White House on Wednesday (9 July) – seemingly, and very awkwardly, totally unaware that it’s Liberia’s official language. The US president was hosting…",
    "link": "https://www.thepinknews.com/2025/07/10/trump-liberia-president-joseph-boakai-white-house/",
    "timestamp": "2025-07-10T10:50:10Z"
  },
  {
    "title": "Trump is threatening tariffs on BRICS. What’s got him so worried?",
    "description": "As US President Donald Trump wages a trade war across the globe, a new target has come into his line of fire: the BRICS group of emerging major economies.",
    "link": "https://www.cnn.com/2025/07/10/business/brics-tariff-threat-trump",
    "timestamp": "2025-07-10T10:48:21Z"
  },
  {
    "title": "$4 trillion: Nvidia breaks market value record",
    "description": "The silicon valley chip maker briefly reached a record-breaking $4 trillion valuation. Nvidia has seen a consistent rise over the past 2 years, as enthusiam in AI increases. Shortly after the stock market opened on Wednesday morning, Nvidia’s stock price surg…",
    "link": "https://www.dw.com/en/4-trillion-nvidia-breaks-market-value-record/a-73222540",
    "timestamp": "2025-07-10T10:48:00Z"
  },
  {
    "title": "Nvidia breaks market value record of $4 trillion",
    "description": "The silicon valley chip maker briefly topped a record-breaking $4 trillion valuation. Nvidia has seen a consistent rise over the past two years, as enthusiasm for AI-powered tech continues.",
    "link": "https://www.dw.com/en/nvidia-breaks-market-value-record-of-4-trillion/a-73222540",
    "timestamp": "2025-07-10T10:48:00Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV",
    "link": "https://abcnews.go.com/Business/wireStory/us-funding-hiv-programs-replaced-millions-die-2029-123636206",
    "timestamp": "2025-07-10T10:46:17Z"
  },
  {
    "title": "FEMA’s acting director is MIA — and the media hasn’t even noticed",
    "description": "After the deadly Texas floods, few seem to be questioning Kristi Noem’s apparent takeover of the agency",
    "link": "https://www.salon.com/2025/07/10/femas-acting-director-is-mia-and-the-media-hasnt-even-noticed/",
    "timestamp": "2025-07-10T10:45:22Z"
  },
  {
    "title": "Trump’s tariffs will only accelerate de-dollarization – Kenyan politician",
    "description": "Booker Omole argues that Trump’s proposed tariffs on BRICS nations will only strengthen alternative financial systems Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/621286-trump-tariffs-will-accelerate-de-dollarization/",
    "timestamp": "2025-07-10T10:44:13Z"
  },
  {
    "title": "Iran's Defense Chief Delivers Harsh Warning",
    "description": "With no breakthrough in the resumption of diplomatic talks, tensions between Iran and Israel, backed by the U.S., are growing",
    "link": "https://www.newsweek.com/irans-defense-chief-delivers-harsh-warning-2097105",
    "timestamp": "2025-07-10T10:43:57Z"
  },
  {
    "title": "Trump threatens Brazil with 50% tariff",
    "description": "US President Donald Trump said Brazil would be subject to a 50% tariff, after accusing the country of mistreating former President Jair Bolsonaro.\nTrump has said that Bolsonaro — who is facing a trial over an alleged coup attempt — was the subject of a witch …",
    "link": "https://biztoc.com/x/1c0a000a22683a36",
    "timestamp": "2025-07-10T10:43:17Z"
  },
  {
    "title": "I've run a political party. Elon Musk is not someone you want in that job",
    "description": "Elon Musk listens as President Donald Trump speaks during a news conference in the Oval Office of the White House, Friday, May 30, 2025, in Washington.",
    "link": "https://biztoc.com/x/d77d025af3c72dfd",
    "timestamp": "2025-07-10T10:43:09Z"
  },
  {
    "title": "Donald Trump Scores Major Win Over T-Mobile",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nT-Mobile has announced it is the latest company to scrap its Diversity, Equity and Inclusion (DEI) programs as it seeks regulatory approval from the Federal Communications Commission (FCC) for two new business…",
    "link": "https://biztoc.com/x/aeb63e1fe0f364d7",
    "timestamp": "2025-07-10T10:42:56Z"
  },
  {
    "title": "Trump’s 50% tariffs on copper: Beijing speaks of an “arbitrary” decision that serves no one",
    "description": "\"We have also always believed that the arbitrary imposition of customs duties does not serve the interests of any party,\" a Chinese Foreign Ministry spokesman said.\nThe post Trump’s 50% tariffs on copper: Beijing speaks of an “arbitrary” decision that serves …",
    "link": "https://en.protothema.gr/2025/07/10/trumps-50-tariffs-on-copper-beijing-speaks-of-an-arbitrary-decision-that-serves-no-one/",
    "timestamp": "2025-07-10T10:42:54Z"
  },
  {
    "title": "Why Pam Bondi can’t deliver what MAGA demands",
    "description": "Attorney General Pam Bondi, left, listens to President Donald Trump during a cabinet meeting at the White House, on July 8, 2025.",
    "link": "https://biztoc.com/x/42323dd15089c720",
    "timestamp": "2025-07-10T10:42:49Z"
  },
  {
    "title": "US tariffs: 25% rate not final, says PM after meeting Rubio",
    "description": "KUALA LUMPUR: The 25% tariff rate on Malaysia is not final and there is still one month to negotiate for lower rates with the United States, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/10/us-tariffs-25-rate-not-final-says-pm-after-meeting-rubio",
    "timestamp": "2025-07-10T10:40:00Z"
  },
  {
    "title": "Mexico barred from sending cattle to U.S. after some test positive for the flesh-eating New World screwworm",
    "description": "Mexico exported just over one million head of cattle to the United States in 2024, according to official estimates.",
    "link": "https://fortune.com/2025/07/10/mexico-barred-sending-cattle-us-test-positive-flesh-eating-new-world-screwworm/",
    "timestamp": "2025-07-10T10:39:20Z"
  },
  {
    "title": "Trump’s Talk With Senegal’s President Took A Weird Turn. Then Trump Made It Even Weirder.",
    "description": "The cringeworthy exchange went viral on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-senegal-president_n_686f8db0e4b0d01c494cb608",
    "timestamp": "2025-07-10T10:38:17Z"
  },
  {
    "title": "Europe Court Says S.African Athlete's Trial Wasn't Fair In Gender Testing Case",
    "description": "A top European court Thursday said a Swiss court did not give double Olympic champion Caster Semenya a fair trial in a much-awaited appeals ruling over contested gender testing.",
    "link": "https://www.ibtimes.com.au/europe-court-says-safrican-athletes-trial-wasnt-fair-gender-testing-case-1859618",
    "timestamp": "2025-07-10T10:36:14Z"
  },
  {
    "title": "Medicaid cuts will pummel NY jobs and health care. The Bronx could take the biggest hit.",
    "description": "Medicaid cuts will pummel NY jobs and health care. The Bronx could take the biggest hit.gothamist.com",
    "link": "https://gothamist.com/news/medicaid-cuts-will-pummel-ny-jobs-and-health-care-the-bronx-could-take-the-biggest-hit",
    "timestamp": "2025-07-10T10:35:32Z"
  },
  {
    "title": "Donald Trump Scores Major Win Over T-Mobile",
    "description": "T-Mobile has announced it is ending diversity schemes in a move the Federal Communications Commission chair calls a \"good step.\"",
    "link": "https://www.newsweek.com/donald-trump-scores-major-win-over-t-mobile-2097082",
    "timestamp": "2025-07-10T10:35:06Z"
  },
  {
    "title": "Bill Nye says Texas flood death and destruction compounded by ignoring climate crisis",
    "description": "Bill Nye claims climate change has worsened Texas flooding disasters, arguing that the U.S. government needs to take climate change more seriously.",
    "link": "https://www.foxnews.com/media/bill-nye-says-texas-flood-death-destruction-compounded-ignoring-climate-crisis",
    "timestamp": "2025-07-10T10:30:27Z"
  },
  {
    "title": "‘Flood insurance is not just for coastal or high-risk areas,’ expert says: What homeowners need to know",
    "description": "Homeowners insurance policies typically do not cover flash floods like those in Texas and North Carolina. Here’s what to know about flood insurance.",
    "link": "https://www.cnbc.com/2025/07/10/what-to-know-about-flash-floods-and-homeowners-insurance.html",
    "timestamp": "2025-07-10T10:30:01Z"
  },
  {
    "title": "‘Masterful inactivity’ reigned at Fed’s latest meeting—but notes reveal more officials are coming around to Donald Trump’s way of thinking",
    "description": "Fed officials are increasingly split on rate cuts, though UBS's Paul Donovan says their indecision currently amounts to little more than “masterful inactivity.”",
    "link": "https://fortune.com/2025/07/10/fomc-rate-cut-masterful-inactivity-ubs-deutsche-meeting-notes/",
    "timestamp": "2025-07-10T10:29:37Z"
  },
  {
    "title": "Everything Trump said in leaked audio tapes as Russia responds to 'bomb the s**t' out of Moscow’ threat",
    "description": "Leaked audio tapes revealed that Donald Trump said he told Putin he would 'bomb the s**t out of Moscow', and he's said much more than that",
    "link": "https://www.ladbible.com/news/us-news/trump-leaked-audio-bomb-moscow-russia-018644-20250710",
    "timestamp": "2025-07-10T10:29:36Z"
  },
  {
    "title": "Trump and Congress Make Big Shift on Ukraine",
    "description": "“After half a year of White House skepticism toward Kyiv and friendliness toward Moscow, President Donald Trump and top Republicans have shifted course, with the White House preparing to send additional weaponry to Ukraine and",
    "link": "https://politicalwire.com/2025/07/10/trump-and-congress-make-big-shift-on-ukraine/",
    "timestamp": "2025-07-10T10:28:38Z"
  },
  {
    "title": "U.S. sanctions U.N. expert critical of Israel's war in Gaza",
    "description": "The United States said it was imposing sanctions on Francesca Albanese, the U.N.'s special rapporteur who has been very critical of Israel’s war in Gaza.",
    "link": "https://www.nbcnews.com/world/middle-east/us-sanctions-un-expert-critical-israel-war-gaza-francesca-albanese-rcna217927",
    "timestamp": "2025-07-10T10:26:17Z"
  },
  {
    "title": "Trump Admin Sues California Over Soaring Egg Prices",
    "description": "The lawsuit said California's animal cruelty laws created \"unnecessary red tape\" in egg production, bringing up prices in the U.S.",
    "link": "https://www.newsweek.com/trump-admin-sues-california-over-soaring-egg-prices-2097051",
    "timestamp": "2025-07-10T10:24:39Z"
  },
  {
    "title": "WATCH: Stephen Miller’s Camera Battery Dies in the Middle of ICE Tirade on Fox News",
    "description": "Miller was abruptly cut off mid-rant when his remote camera died as he excitedly talked about new funding that would boost deportations.\nThe post WATCH: Stephen Miller’s Camera Battery Dies in the Middle of ICE Tirade on Fox News first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/watch-stephen-millers-camera-battery-dies-in-the-middle-of-ice-tirade-on-fox-news/",
    "timestamp": "2025-07-10T10:24:24Z"
  },
  {
    "title": "Kremlin says the Ukraine peace process has not stalled",
    "description": "MOSCOW (Reuters) -The Kremlin said on Thursday that Russia did not think peace talks on Ukraine have stalled despite Donald Trump's remarks about Russian President Vladimir Putin and Washington's resumption of some weapons to Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/10/kremlin-says-the-ukraine-peace-process-has-not-stalled",
    "timestamp": "2025-07-10T10:23:00Z"
  },
  {
    "title": "Hamas agrees to release 10 hostages as part of Gaza ceasefire talks",
    "description": "Hamas said it would release 10 hostages held in Gaza in a bid reach a ceasefire deal to end 21 months of war in the Palestinian enclave.",
    "link": "https://www.nbcnews.com/world/middle-east/israel-gaza-ceasefire-hamas-hostage-release-trump-netanyahu-rcna217922",
    "timestamp": "2025-07-10T10:19:12Z"
  },
  {
    "title": "US sanctions UN expert critical of Israel's war in Gaza",
    "description": "The United States has said it is imposing sanctions on Francesca Albanese, the United Nations' special rapporteur on human rights in the occupied Palestinian territories, who has been very critical of US ally Israel's war in Gaza.",
    "link": "https://www.rte.ie/news/world/2025/0710/1522837-francesca-albanese/",
    "timestamp": "2025-07-10T10:17:53Z"
  },
  {
    "title": "Virginia’s AG race heats up with GOP's ‘Soft Jay Jones’ campaign",
    "description": "The campaign, paid for by the Virginia GOP and authorized by Republican Attorney General Jason Miyares, portrays Democrat Jay Jones as soft on crime.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_5504e332-eae2-4c53-9997-4b7644d1844d.html",
    "timestamp": "2025-07-10T10:15:00Z"
  },
  {
    "title": "Hundreds gather at high school stadium to honor the many lost to Texas deadly floods",
    "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas",
    "link": "https://abcnews.go.com/US/wireStory/hundreds-gather-high-school-stadium-honor-lost-texas-123633540",
    "timestamp": "2025-07-10T10:14:21Z"
  },
  {
    "title": "What Happened to Democrats' Patriotism? | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\n\"And I'm proud to be an American,\" goes the refrain of Lee Greenwood's \"God Bless the USA,\" an intensely patriotic song the country singer has frequently performed at political rallies and campaign events for …",
    "link": "https://biztoc.com/x/f81fa12146696277",
    "timestamp": "2025-07-10T10:09:39Z"
  },
  {
    "title": "Canada must match the tax incentives in Trump’s ‘Big Beautiful Bill’",
    "description": "Jeff Baryshnik is the president of Republic Funds, a private equity firm.\nOn the Fourth of July, U.S. President Donald Trump signed into law the One Big Beautiful Bill (OBBB). Observers have focused on its impact on the U.S. fiscal situation and its potential…",
    "link": "https://biztoc.com/x/cdebe22d448f29a1",
    "timestamp": "2025-07-10T10:09:35Z"
  },
  {
    "title": "Video showing MAGA fans clicking selfies outside 'Alligator Alcatraz' goes viral with 1.5 million views",
    "description": "A video has surfaced online which shows a MAGA supporters at Florida's 'Alligator Alcatraz' clicking selfies. The video was widely shared on TikTok and has managed to garner around 1.5 million views. US President Donald Trump last week toured the detention ce…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-video-showing-maga-fans-clicking-selfies-outside-alligator-alcatraz-goes-viral-with-1-5-million-views/articleshow/122363677.cms",
    "timestamp": "2025-07-10T10:08:44Z"
  },
  {
    "title": "Sean Duffy Appointed Interim NASA Administrator",
    "description": "“Let’s launch” Says Enthusiastic Secretary Of Transportation President Donald Trump appointed U.S. Secretary of Transportation Sean P. Duffy to take the reins as interim administrator of NASA in a move Trump said reflects the rising priority of space in natio…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=0FA3FEFD-D9BD-46DB-8AA5-C39B23E730F9",
    "timestamp": "2025-07-10T10:05:00Z"
  },
  {
    "title": "Trump’s 50% levy on Brazil shows world nothing is off limits",
    "description": "Donald Trump threatened Brazil with a 50% tariff, demanding the country drop charges against former President Jair Bolsonaro. This unprecedented move, using trade policy for political interference, drew strong condemnation from Brazil's President Lula, who vo…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-50-levy-on-brazil-shows-world-nothing-is-off-limits/articleshow/122363652.cms",
    "timestamp": "2025-07-10T10:04:13Z"
  },
  {
    "title": "Nine years on, lessons learned from Brexit",
    "description": "Nine years ago, a slim majority of UK voters chose to leave the European Union without a clear plan or the means to do so. Five years on from the de facto departure, relations are slowly being repaired, partly due to the increasingly unpredictable political c…",
    "link": "https://voxeurop.eu/en/nine-years-on-lessons-learned-from-brexit/",
    "timestamp": "2025-07-10T10:03:03Z"
  },
  {
    "title": "Opinion: Maybe helping with the Golden Dome will placate Trump",
    "description": "Addressing fentanyl and axing the DST didn't placate Trump. Missile defence and reforming drug prices and supply management might. Read more",
    "link": "https://financialpost.com/opinion/helping-golden-dome-will-placate-trump",
    "timestamp": "2025-07-10T10:00:43Z"
  },
  {
    "title": "William Watson: Liberal MPs won’t rebel, U.K. Labour-style, so cut away, Carney",
    "description": "It's remarkable how similar British and Canadian politics are these days. One difference? Unlike left-wing Labour MPs, Liberals won't rebel",
    "link": "https://financialpost.com/opinion/liberal-mps-wont-rebel-uk-labour-cut-away-carney",
    "timestamp": "2025-07-10T10:00:40Z"
  },
  {
    "title": "Did the Big Beautiful Bill Accidentally Gut the Gambling Industry?",
    "description": "Buried among the One Big Beautiful Act’s many damaging provisions is at least one happy surprise, writes columnist Ross Barkan.",
    "link": "http://nymag.com/intelligencer/article/trumps-big-beautiful-bill-act-could-gut-gambling-industry.html",
    "timestamp": "2025-07-10T10:00:40Z"
  },
  {
    "title": "Trump cautioned Putin he would ‘bomb the s---' out of Moscow if Russia invaded Ukraine, new book claims",
    "description": "A new book alleges that President Donald Trump told donors he threatened Russian President Vladimir Putin with bombing Moscow if Russia invaded Ukraine.",
    "link": "https://www.foxnews.com/politics/trump-cautioned-putin-he-would-bomb-s-out-moscow-russia-invaded-ukraine-new-book-claims",
    "timestamp": "2025-07-10T10:00:13Z"
  },
  {
    "title": "Democrats' 'massive blind spot' on male voters exposed by New York Times columnist",
    "description": "New York Times columnist Thomas B. Edsall argued the Democratic Party's future looks bleak as men trend toward Republicans, with experts suggesting the party alienated male voters.",
    "link": "https://www.foxnews.com/media/nyt-columnist-claims-dems-have-a-massive-blind-spot-when-comes-male-issues",
    "timestamp": "2025-07-10T10:00:12Z"
  },
  {
    "title": "Oil Steady as Traders Weigh Trump’s Tariffs and Red Sea Attacks",
    "description": "Oil was broadly steady as traders considered the effects of sweeping US trade tariffs and fresh attacks on Red Sea shipping.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steady-as-traders-weigh-trumps-tariffs-and-red-sea-attacks",
    "timestamp": "2025-07-10T10:00:11Z"
  },
  {
    "title": "Rep. Jim Jordan is a liar who abandoned his wrestlers when they needed him most",
    "description": "Yes, I’m a little late to the game, or match in this case, but I finally got around to watching HBO's Surviving Ohio State\r\n, and if you are a survivor of sexual abuse like I am, you come away with tremendous sympathy for the athletes who came forward and int…",
    "link": "https://www.advocate.com/voices/jim-jordan-abandoned-abused-wrestlers",
    "timestamp": "2025-07-10T10:00:03Z"
  },
  {
    "title": "What Happened to Democrats' Patriotism? | Opinion",
    "description": "As Americans marked the 249th anniversary of the Declaration of Independence last weekend, polling data on patriotism highlighted an alarming trend.",
    "link": "https://www.newsweek.com/what-happened-democrats-patriotism-opinion-2096032",
    "timestamp": "2025-07-10T10:00:01Z"
  },
  {
    "title": "Trump loves ICE. Its Workforce Has Never Been So Miserable.",
    "description": "A “mission impossible” deportation campaign has left many employees burned out and morally conflicted.",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/trump-ice-morale-immigration/683477/",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "This Texas County Sought Disaster Resilience Help for Years. Now It’s Too Late.",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. Flooding is a fact of life in Texas Hill Country, a region home to a flood-prone corridor known as “Flash Flood Alley.” Judge Rob Kelly, the top ele…",
    "link": "https://www.motherjones.com/politics/2025/07/texas-flooding-kerr-county-disaster-resilience-funds-preparedness-trump-cuts/",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "DOJ's criminal investigation of Comey and Brennan is a warning",
    "description": "Trump's Justice Department has launched investigations into James Comey and John Brennan in what looks like an authoritarian abuse of power.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/comey-brennan-investigation-trump-rcna217802",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "Cory Booker posts personal record fundraising haul after marathon speech",
    "description": "Sen. Cory Booker, D-N",
    "link": "https://www.nbcnews.com/politics/congress/cory-booker-posts-record-fundraising-haul-marathon-speech-rcna217828",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "Why Pam Bondi can’t deliver what MAGA demands",
    "description": "During Donald Trump’s first term as president, no fewer than eight people served as attorney general.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/pam-bondi-cant-deliver-maga-demands-rcna217784",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "How President Trump Can Bring The Ukraine War To A Successful Close",
    "description": "There’s a simple way for President Trump to get Putin to the negotiating table: Give Ukraine what it needs to push the Russians back.",
    "link": "https://www.forbes.com/sites/steveforbes/2025/07/10/how-president-trump-can-bring-the-ukraine-war-to-a-successful-close/",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "The Private Prison Industry Looks Forward to Soaring Profits Thanks to Trump’s Budget",
    "description": "The $45 billion for immigration detention in the \"Big, Beautiful Bill\" represented a long-sought win for private prisons.\nThe post The Private Prison Industry Looks Forward to Soaring Profits Thanks to Trump’s Budget appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/07/10/corecivic-trump-big-beautiful-bill/",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "Trump’s immigration record so far: High arrests, low deportations",
    "description": "ICE agents last month arrested the most people in at least five years, but deportations are still lagging far behind what President Donald Trump has promised.",
    "link": "https://www.nbcnews.com/politics/immigration/trumps-immigration-record-far-high-arrests-low-deportations-rcna217752",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "I've run a political party. Elon Musk is not someone you want in that job.",
    "description": "Elon Musk has officially declared his intent to launch a new political party, an announcement long on bravado but short on substance",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/elon-musk-third-party-republican-problems-rcna217847",
    "timestamp": "2025-07-10T10:00:00Z"
  },
  {
    "title": "Trump Acts Without Strategy, Resorts to Situational Measures in Ukraine – Professor Sachs",
    "description": "UNITED NATIONS (Sputnik) - US President Donald Trump lacks the knowledge, focus, and competent team to build a coherent strategy for foreign policy challenges, including the conflict in Ukraine, Jeffrey Sachs, a well-known US economist and director of the Cen…",
    "link": "https://sputnikglobe.com/20250710/trump-acts-without-strategy-resorts-to-situational-measures-in-ukraine--professor-sachs-1122422957.html",
    "timestamp": "2025-07-10T09:59:43Z"
  },
  {
    "title": "Trump issues more tariff threats",
    "description": "US President Donald Trump on Wednesday threatened more countries with high tariffs, as analysts warn of the salvo’s geopolitical costs.\nTrump’s letters dictating higher rates effective Aug. 1 hit Southeast Asia especially hard, creating a “tariff wall” around…",
    "link": "https://biztoc.com/x/1635d4f93dcc539f",
    "timestamp": "2025-07-10T09:58:24Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV.",
    "link": "https://www.clickondetroit.com/business/2025/07/10/un-says-if-us-funding-for-hiv-programs-is-not-replaced-millions-more-will-die-by-2029/",
    "timestamp": "2025-07-10T09:57:16Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV.",
    "link": "https://www.news4jax.com/business/2025/07/10/un-says-if-us-funding-for-hiv-programs-is-not-replaced-millions-more-will-die-by-2029/",
    "timestamp": "2025-07-10T09:56:27Z"
  },
  {
    "title": "Ideas: The U.S. Is Switching Sides",
    "description": "Donald Trump is giving Vladimir Putin every incentive to keep killing Ukrainians.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/the-u-s-is-switching-sides-e035448/",
    "timestamp": "2025-07-10T09:55:00Z"
  },
  {
    "title": "The Law Firms’ Deals With Trump Are Looking Worse and Worse",
    "description": "Trump’s assault on Big Law has been a big mess.",
    "link": "https://www.politico.com/news/magazine/2025/07/10/trump-law-firms-deals-mess-column-00445259",
    "timestamp": "2025-07-10T09:55:00Z"
  },
  {
    "title": "Secret Service suspended staff for failings over Trump assassination attempt",
    "description": "The new deputy director says his organisation was \"totally accountable\" for the violence at Trump's rally in 2024.",
    "link": "https://www.bbc.com/news/articles/cy0w9ev559ro",
    "timestamp": "2025-07-10T09:54:24Z"
  },
  {
    "title": "Ideas: Why Do So Many People Think That Trump Is Good?",
    "description": "The work of the moral philosopher Alasdair MacIntyre helps illuminate some central questions of our time.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/why-do-so-many-people-think-that-trump-is-good-e213853/",
    "timestamp": "2025-07-10T09:52:00Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "LONDON (AP) — Years of American-led investment into AIDS programs has reduced the number of people killed by the disease to the lowest levels seen in more than three decades, and provided life-saving medicines for some of the world’s most vulnerable. But in t…",
    "link": "https://financialpost.com/pmn/un-says-if-us-funding-for-hiv-programs-is-not-replaced-millions-more-will-die-by-2029",
    "timestamp": "2025-07-10T09:48:22Z"
  },
  {
    "title": "Iran Fatwa Fundraiser to Kill Donald Trump Raises Over $40 Million",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA fatwa, or religious decree, issued by senior Iranian clerics calling for the assassination of U.S. President Donald Trump has attracted online funding worth tens of millions of dollars, reports say.\nMomentum…",
    "link": "https://biztoc.com/x/82989f00601086d7",
    "timestamp": "2025-07-10T09:47:14Z"
  },
  {
    "title": "Uniqlo Owner’s Profit Misses Estimates on Weak China Sales",
    "description": "Fast Retailing Co. reported third-quarter earnings that missed estimates, as weaker sales in China weighed on the Japanese apparel maker’s performance.",
    "link": "https://www.livemint.com/companies/company-results/uniqlo-owner-s-profit-misses-estimates-on-weak-china-sales-11752140787136.html",
    "timestamp": "2025-07-10T09:46:26Z"
  },
  {
    "title": "Companies have plans for extreme weather and workplace violence. Now, some are planning for ICE raids, too.",
    "description": "As ICE agents raid workplaces across the country, some companies are calling on HR and legal experts to develop a plan.",
    "link": "https://www.businessinsider.com/companies-plan-for-ice-raids-workplace-2025-7",
    "timestamp": "2025-07-10T09:46:01Z"
  },
  {
    "title": "Lawrence O’Donnell Points To 5 Words From Trump As The Brutal ‘Truth’ Of His Presidency",
    "description": "The MSNBC host trashed \"Trumpian stupidity\" and said there's \"no way\" the president \"can fake sounding smart about anything.\"",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-donald-trump-truth-presidency_n_686f7832e4b0d01c494ca0f2",
    "timestamp": "2025-07-10T09:45:29Z"
  },
  {
    "title": "China opposes excessive tariffs, says China's Wang Yi",
    "description": "KUALA LUMPUR: China opposes excessive tariffs, says China's Foreign Minister Wang Yi. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/10/china-opposes-excessive-tariffs-says-china039s-wang-yi",
    "timestamp": "2025-07-10T09:45:00Z"
  },
  {
    "title": "Russia kills 2 in Kyiv with 10-hour drone, missile bombardment, Zelenskyy says",
    "description": "Russia kills 2 in Kyiv with 10-hour drone, missile bombardment, Zelenskyy saysgo.com",
    "link": "https://abcnews.go.com/International/russia-kills-2-kyiv-10-hour-drone-missile/story?id=123635151",
    "timestamp": "2025-07-10T09:44:43Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "Years of American-led investment into AIDS programs has reduced the number of people killed by the disease to the lowest levels seen in more than three...",
    "link": "https://www.yahoo.com/news/un-says-us-funding-hiv-094427538.html",
    "timestamp": "2025-07-10T09:44:27Z"
  },
  {
    "title": "Concern over low HIV treatment uptake among children",
    "description": "According to the latest NASCOP report, only 8 out of every 10 babies born with HIV are initiated on treatment—equivalent to 75 per cent.",
    "link": "https://www.standardmedia.co.ke/health/health-science/article/2001523916/concern-over-low-hiv-treatment-uptake-among-children",
    "timestamp": "2025-07-10T09:40:59Z"
  },
  {
    "title": "The Expensive, Seductive Strategy That Doomed the Democratic Party",
    "description": "During the Reagan revolution, Democrats settled on a new way to win—and it’s destroying them now.",
    "link": "https://slate.com/news-and-politics/2025/07/donald-trump-news-democrats-elections-strategist-brain.html",
    "timestamp": "2025-07-10T09:40:00Z"
  },
  {
    "title": "Iran Fatwa Fundraiser to Kill Donald Trump Raises Over $40 Million",
    "description": "A fatwa or decree against the U.S. president is gaining traction among clerics linked to the Islamic Republic's regime.",
    "link": "https://www.newsweek.com/iran-trump-fatwa-iran-40-million-2097043",
    "timestamp": "2025-07-10T09:38:03Z"
  },
  {
    "title": "Defence stocks retreat after up to 84% rally in 3 months. Is it time to book profits or hold?",
    "description": "India’s defence stocks retreated on Thursday after a sharp three-month rally, with Bharat Dynamics falling the most. The Nifty India Defence Index dropped over 2% amid profit booking and valuation concerns. Analysts, however, see robust long-term growth prosp…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-retreat-after-up-to-84-rally-in-3-months-is-it-time-to-book-profits-or-hold/articleshow/122363032.cms",
    "timestamp": "2025-07-10T09:32:30Z"
  },
  {
    "title": "Trump Hikes Brazil Tariffs; Texas Flood Recovery Efforts",
    "description": "On today's podcast: 1) Donald Trump’s threat to impose 50% tariffs on Brazilian goods sent the country’s currency plunging as the US leader sharply escalated a dispute with Latin America’s largest nation and leftist leader Luiz Inacio Lula da Silva.  2) Crews…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trump-hikes-brazil-tariffs-texas-flood-recovery-efforts",
    "timestamp": "2025-07-10T09:31:05Z"
  },
  {
    "title": "Brics isn’t an anti-US forum, it’s a voice of the Global South",
    "description": "American hostility under Trump could strengthen a group that has little unity, with his threats rallying members together, and thus play into China’s hands. In some ways, Brics represents a contest for leadership of the developing world.",
    "link": "https://www.livemint.com/opinion/online-views/brics-summit-2025-india-china-rivalry-narendra-modi-global-south-donald-trump-tariffs-critical-minerals-lithium-dollar-11752072758586.html",
    "timestamp": "2025-07-10T09:30:19Z"
  },
  {
    "title": "Trump led a distracted America to its hour of crisis",
    "description": "Donald Trump didn’t just try to overturn an election. He’s trying to overturn the very ideal — and reality— of what has historically made America great.While the media fixates on trade, Epstein, and floods, we’re all missing the real story: Trump’s “waste, fr…",
    "link": "https://www.rawstory.com/raw-investigates/trump-led-a-distracted-america-to-its-hour-of-crisis/",
    "timestamp": "2025-07-10T09:30:02Z"
  },
  {
    "title": "Trump stopped the global fight against HIV/AIDS in its tracks. Canada can help fix it",
    "description": "Until recently, the UN was on track to meet its target of ending AIDS as a public health threat by 2030. But with the U.S. rapidly scaling back foreign aid contributions, the UN has released a new report warning of millions more HIV infections and deaths with…",
    "link": "https://www.cbc.ca/radio/asithappens/unaids-report-1.7581265",
    "timestamp": "2025-07-10T09:30:00Z"
  },
  {
    "title": "When GDP Goes Up and Democracy Goes Down",
    "description": "Corbin Trent\n\n\n\nAmerica is being hollowed out by an extractive economy.\r\n\n\r\n\n\nThe post When GDP Goes Up and Democracy Goes Down appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=562861",
    "timestamp": "2025-07-10T09:30:00Z"
  }
]