[
  {
    "title": "Stablecoin, market structure bills should get done this year — Rep. Khanna",
    "description": "US Representative Ro Khanna, a Democrat from California, said at the Digital Assets Summit on March 18 that Congress “should be able to get” both a stablecoin and crypto market structure bill done this year.Khanna added that there are 70 to 80 Democrats now w…",
    "link": "https://cointelegraph.com/news/stablecoin-market-structure-bills-done-this-year-rep-khanna",
    "timestamp": "2025-03-18T19:23:17Z"
  },
  {
    "title": "Putin Seems To Reject 30-Day U.S. Ceasefire Plan Following Call With Trump",
    "description": "The Russian president agreed to a targeted \"energy and infrastructure ceasefire,\" according to the White House.",
    "link": "https://www.huffpost.com/entry/trump-putin-call-limited-ceasefire_n_67d98fbee4b0e500f36ac49a",
    "timestamp": "2025-03-18T19:23:01Z"
  },
  {
    "title": "Goodbye, old tightwad Germany. Berlin approves an epic spending spree for everything from tanks to tunnels",
    "description": "Germany has waved auf wiedersehen to the peace dividend. The country that let its military rot away after the end of the Cold War is about to embark on its biggest rearmament program since the 1930s, as Donald Trump signals that the transatlantic alliance is …",
    "link": "https://biztoc.com/x/5a47d0a208c25ec0",
    "timestamp": "2025-03-18T19:22:08Z"
  },
  {
    "title": "Ellen Pompeo: 'Why Are Old White Men the Only Ones Allowed to Be Felons' Under Trump",
    "description": "ABC's \"Grey's Anatomy\" star Ellen Pompeo bizarrely suggested to the co-hosts of ABC's \"The View\" that \"old, white men\" are \"the only ones who are allowed to be felons\" under President Donald Trump's administration.\nThe post Ellen Pompeo: ‘Why Are Old White Me…",
    "link": "https://www.breitbart.com/entertainment/2025/03/18/ellen-pompeo-why-are-old-white-men-the-only-ones-allowed-to-be-felons-under-trump/",
    "timestamp": "2025-03-18T19:21:11Z"
  },
  {
    "title": "Nation-state actors and cybercrime gangs abuse malicious .lnk files for espionage and data theft",
    "description": "11 state-sponsored APTs exploit malicious .lnk files for espionage and data theft, with ZDI uncovering 1,000 such files used in attacks. At least 11 state-sponsored threat groups have been abusing Windows shortcut files for espionage and data theft, according…",
    "link": "https://securityaffairs.com/175569/apt/nation-state-actors-and-cybercrime-gangs-abuse-malicious-lnk-files-for-espionage-and-data-theft.html",
    "timestamp": "2025-03-18T19:20:50Z"
  },
  {
    "title": "Tesla Owner Repents And Vows To Vote Democrat After Having Car Torched",
    "description": "LAS VEGAS, NV — An awful Republican-voting Tesla owner has repented of his evil ways and vowed to vote Democrat in the future after having their Cybertruck destroyed by a Democrat activist.",
    "link": "https://babylonbee.com/news/tesla-owner-repents-and-vows-to-vote-democrat-after-having-car-keyed",
    "timestamp": "2025-03-18T19:19:40Z"
  },
  {
    "title": "Trump and Putin agree on ‘energy and infrastructure ceasefire’ as step to Ukraine peace deal",
    "description": "U.S. President Donald Trump and Russian President Vladimir Putin on Tuesday agreed on steps toward a total ceasefire and peace deal to end the war in Ukraine, the White House said. Trump and Putin “agreed that the movement to peace will begin with an energy a…",
    "link": "https://freerepublic.com/focus/f-news/4305143/posts",
    "timestamp": "2025-03-18T19:18:19Z"
  },
  {
    "title": "Putin orders partial ceasefire after call with Trump but not the one hoped for",
    "description": "Russian President Vladimir Putin agreed to a 30-day moratorium on striking Ukraine's energy infrastructure and offered guarantees to Ukrainian troops surrendering in the Kursk region.",
    "link": "https://www.foxnews.com/world/putin-orders-partial-ceasefire-after-call-trump-not-one-hoped",
    "timestamp": "2025-03-18T19:18:09Z"
  },
  {
    "title": "Putin agrees to partial ceasefire in Ukraine after Trump call",
    "description": "Vladimir Putin agreed to an immediate 30-day pause on strikes on energy infrastructure in Ukraine during a lengthy phone call with Donald Trump.",
    "link": "https://news.sky.com/story/putin-agrees-to-partial-ceasefire-in-ukraine-after-trump-call-13331581",
    "timestamp": "2025-03-18T19:18:00Z"
  },
  {
    "title": "‘The View’ Co-Host Bluntly Shuts Down Chuck Schumer: 'I Think You Caved'",
    "description": "\"No one wants to fight more than me,\" the New York Democrat said in response to Sunny Hostin's critique.",
    "link": "https://www.huffpost.com/entry/the-view-host-shuts-down-chuck-schumer_n_67d9ab65e4b0bbd8c3b5c3ea",
    "timestamp": "2025-03-18T19:16:08Z"
  },
  {
    "title": "Trump opens up on phone call with Putin",
    "description": "US President Donald Trump has called the conversation “good” after an immediate ceasefire on energy and infrastructure was agreed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614444-trump-comments-call-putin/",
    "timestamp": "2025-03-18T19:15:24Z"
  },
  {
    "title": "Study: Gender-affirming hormone therapy improves mental health",
    "description": "Gender-affirming hormone therapy not only improves the mental health of transgender, nonbinary, and gender-diverse people — it does so over the long term, according to a study published Monday in JAMA Network Open.",
    "link": "https://www.advocate.com/health/hormone-therapy-improves-mental-health",
    "timestamp": "2025-03-18T19:15:21Z"
  },
  {
    "title": "Stablecoin bill could reach Trump’s desk within two months, says Bo Hines",
    "description": "The regulation of stablecoins in the US can reach President Donald Trump’s desk in two months, according to the Executive Director of the Presidential Working Group on Digital Assets Markets, Bo Hines. During a speech at Blockworks’ Digital Asset Summit, Hine…",
    "link": "https://cryptoslate.com/stablecoin-bill-could-reach-trumps-desk-within-two-months-says-bo-hines/",
    "timestamp": "2025-03-18T19:15:14Z"
  },
  {
    "title": "A Meticulous Breakdown of Trump’s Desperate Attempt to Take Credit for the Starliner Crew’s Return",
    "description": "In a Truth Social post on Monday about the Starliner return mission, the president delivered a masterclass in misinformation.",
    "link": "https://gizmodo.com/a-meticulous-breakdown-of-trumps-desperate-attempt-to-take-credit-for-the-starliner-crews-return-2000577445",
    "timestamp": "2025-03-18T19:15:06Z"
  },
  {
    "title": "Valery Real Estate Co-Founder Daniel Foch's Post on Population Boom Shared by Vice President JD Vance As the US-Canada trade war continues",
    "description": "JD Vance comments on the comparison of productivity gains in Canada versus the spike in population JD Vance comments on the comparison of productivity gains in Canada versus the spike in population",
    "link": "https://www.globenewswire.com/news-release/2025/03/18/3044922/0/en/Valery-Real-Estate-Co-Founder-Daniel-Foch-s-Post-on-Population-Boom-Shared-by-Vice-President-JD-Vance-As-the-US-Canada-trade-war-continues.html",
    "timestamp": "2025-03-18T19:15:00Z"
  },
  {
    "title": "Trump and Putin agree to an immediate ceasefire for energy and infrastructure in Ukraine war",
    "description": "The White House said negotiations would “begin immediately.” It was not immediately clear whether Ukraine is on board with the phased ceasefire plan.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_c15b7940-8461-5c84-90ce-44a953d7778e.html",
    "timestamp": "2025-03-18T19:15:00Z"
  },
  {
    "title": "Nearly 90% of Grassroots Voters Call for Schumer to Step Down, Nationwide Survey of 9,000 Our Revolution Members Finds",
    "description": "As the dust continues to settle on Capitol Hill following Senate Minority Leader Chuck Schumer’s stunning decision last week to break ranks with his own caucus to greenlight the reckless Republican spending bill, Our Revolution\r\n—the nation’s largest independ…",
    "link": "https://www.commondreams.org/newswire/nearly-90-of-grassroots-voters-call-for-schumer-to-step-down-nationwide-survey-of-9000-our-revolution-members-finds",
    "timestamp": "2025-03-18T19:14:12Z"
  },
  {
    "title": "Chuck Grassley: Senate Is Working to Solve 'Judicial Overreach'",
    "description": "Senate Judiciary Committee Chairman Chuck Grassley (R-IA) said he is committed to solving \"judicial overreach\" after federal judges moved to stop Trump's deportation of criminal migrants.\nThe post Chuck Grassley: Senate Is Working to Solve ‘Judicial Overreach…",
    "link": "https://www.breitbart.com/politics/2025/03/18/chuck-grassley-senate-working-solve-judicial-overreach/",
    "timestamp": "2025-03-18T19:13:56Z"
  },
  {
    "title": "‘Snow White’ Hopes To Avoid Poison Apples At Box Office With $100M+ Global Opening – Preview",
    "description": "Disney’s feature take of 1937 classic toon Snow White is finally hitting theaters after weathering a tormenting tabloid, blown out of proportion controversy. Domestic is looking to land between a $45M-$50M opening with another $55M abroad. The reported $270M …",
    "link": "http://deadline.com/2025/03/snow-white-box-office-preview-1236329918/",
    "timestamp": "2025-03-18T19:13:14Z"
  },
  {
    "title": "4 things to know about Judge Boasberg as he battles Trump over deportation flights",
    "description": "Judge Boasberg's role overseeing a new case that challenges the deportation of alleged Venezuelan gang members to El Salvador has cast an even brighter light on the longtime judge.",
    "link": "https://www.npr.org/2025/03/18/g-s1-54493/judge-boasberg-trump-deportation-flights",
    "timestamp": "2025-03-18T19:12:44Z"
  },
  {
    "title": "US stablecoin bill likely in ‘next 2 months’ — Trump’s crypto council head",
    "description": "Bo Hines, the executive director of the President’s Council of Advisers on Digital Assets, said comprehensive stablecoin legislation is expected to be finalized in the coming months, underscoring the government’s urgency to maintain the US dollar’s dominance …",
    "link": "https://cointelegraph.com/news/us-stablecoin-bill-likely-next-2-months-bo-hines",
    "timestamp": "2025-03-18T19:12:32Z"
  },
  {
    "title": "Top DC prosecutor announces new election fraud unit, though authority and scope unclear",
    "description": "The top federal prosecutor in Washington, D.C., is leading a new initiative to investigate election fraud cases.Edward R. Martin Jr., who was appointed and sworn…",
    "link": "https://www.abajournal.com/news/article/top-dc-prosecutor-to-investigate-election-fraud",
    "timestamp": "2025-03-18T19:12:00Z"
  },
  {
    "title": "As Donald Trump Announces to Make Files on JFK Assassination Public, Here’s a Look at Electoral Promises He Has Fulfilled So Far",
    "description": "Since assuming a second term in office, Donald Trump has acted quickly on major campaign vows, ranging from immigration reform to economic policies and foreign affairs. The administration has made a series of executive orders and legislative bills, starting w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-donald-trump-announces-to-make-files-on-jfk-assassination-public-heres-a-look-at-electoral-promises-he-has-fulfilled-so-far/articleshow/119176026.cms",
    "timestamp": "2025-03-18T19:11:17Z"
  },
  {
    "title": "Trump: Both Putin and Zelensky want war to end",
    "description": "United States President Donald Trump insisted on Tuesday that both Vladimir Putin and Volodymyr Zelensky, his counterparts from Russia and Ukraine, respectively, would like to see the end of the confl...",
    "link": "https://biztoc.com/x/0b1ec777254c114a",
    "timestamp": "2025-03-18T19:10:59Z"
  },
  {
    "title": "WATCH: Putin Laughs Upon Being Told He's Running Late for Trump Call",
    "description": "Russian president Vladimir Putin can be seen smiling and laughing when he was told that he's running late for his highly anticipated call with President Donald Trump in a video circulating on X, formerly known as Twitter.\nNewsweek reached out to the Ministry …",
    "link": "https://biztoc.com/x/89455e5797ce0dfa",
    "timestamp": "2025-03-18T19:10:56Z"
  },
  {
    "title": "Trump Happily Reports on ‘Very Good’ Call With Putin: ‘Hopefully, for the Sake of Humanity’ We’ll ‘Get the Job Done!’",
    "description": "President Donald Trump provided his own summary of his call with Vladimir Putin on Tuesday, calling it a \"very good and productive\" conversation.\nThe post Trump Happily Reports on ‘Very Good’ Call With Putin: ‘Hopefully, for the Sake of Humanity’ We’ll ‘Get t…",
    "link": "https://www.mediaite.com/news/trump-happily-reports-on-very-good-call-with-putin-hopefully-for-the-sake-of-humanity-well-get-the-job-done/",
    "timestamp": "2025-03-18T19:09:23Z"
  },
  {
    "title": "Trump Dressed Down By Chief Justice Over Crossing The Line With Impeachment Threats Against Judge",
    "description": "The first serious rebuke of Donald Trump’s return to the White House has come from a close ally of the MAGA POTUS. Keeping it short and sweet Tuesday, Chief Justice John Roberts told Trump and his minions to hold their horses when it comes to attacking judges…",
    "link": "http://deadline.com/2025/03/trump-judge-impeachment-threats-chief-justice-1236329799/",
    "timestamp": "2025-03-18T19:08:00Z"
  },
  {
    "title": "'Completely Delusional': Trump Calls for Reinvigorating Domestic Use of US Coal",
    "description": "After U.S. President Donald Trump declared on Truth Social on Monday night that he is ordering his administration \"to immediately begin producing Energy with BEAUTIFUL, CLEAN COAL,\" a leader at the grassroots environmental group Sierra Club quickly hit back, …",
    "link": "https://www.commondreams.org/news/coal-trump-truth-social",
    "timestamp": "2025-03-18T19:06:27Z"
  },
  {
    "title": "Trump Ends White House Public Health Advisory On Gun Violence",
    "description": "The guidance was removed in compliance with Trump's executive order on the Second Amendment.",
    "link": "https://www.huffpost.com/entry/trump-guns-public-health-advisory_n_67d9a4dce4b0af2e3353b767",
    "timestamp": "2025-03-18T19:05:31Z"
  },
  {
    "title": "Donald Trump Strips Joe Biden's Children Of Security Details",
    "description": "The president apparently sees Ashley and Hunter Biden as his political enemies.",
    "link": "https://littlethings.com/entertainment/donald-trump-strips-joe-bidens-children-of-secret-service-protections",
    "timestamp": "2025-03-18T19:05:24Z"
  },
  {
    "title": "Roberts rejects Trump’s call for impeaching judge who ruled against his deportation plans",
    "description": "In an extraordinary display of conflict between the executive and judiciary branches, Chief Justice John Roberts rejected calls for impeaching judges shortly after President Donald Trump demanded the removal of one who ruled against his deportation plans. […]…",
    "link": "https://freerepublic.com/focus/f-backroom/4305141/posts",
    "timestamp": "2025-03-18T19:04:48Z"
  },
  {
    "title": "'Angry base is motivated base': Analyst says 'livid' Dems may have gotten kick they needed",
    "description": "Democrats are angry that their leadership is failing to show any substantive pushback to President Donald Trump's first two months of devastation, which might be exactly what the party needs to get moving in the right direction, argues a new piece from MSNBC.…",
    "link": "https://www.rawstory.com/angry-democrats/",
    "timestamp": "2025-03-18T19:04:29Z"
  },
  {
    "title": "‘Moved into hyperdrive’: Media doubling down with Trump hostility as part of ‘the resistance’",
    "description": "'Both neutrality and objectivity were discarded years ago by many in journalism schools'",
    "link": "https://www.wnd.com/2025/03/moved-into-hyperdrive-media-doubling-down-with-trump-hostility-as-part-of-the-resistance/",
    "timestamp": "2025-03-18T19:03:23Z"
  },
  {
    "title": "Donald Trump-Vladmir Putin phone call failed? No full ceasefire announced. Key takeaways, highlights of meeting",
    "description": "Donald Trump and Vladimir Putin spoke for more than an hour and a half and both expressed hopes for repairing relations between the US and Russia.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-vladmir-putin-phone-call-failed-no-full-ceasefire-announced-key-takeaways-highlights-of-meeting/articleshow/119175754.cms",
    "timestamp": "2025-03-18T19:03:08Z"
  },
  {
    "title": "Chief justice rebukes Trump’s call for judicial impeachment",
    "description": "Chief Justice John Roberts criticized a call by President Donald Trump for the impeachment of a federal trial judge who temporarily barred the federal government from deporting noncitizens pursuant to an executive order published on Saturday. The rare public …",
    "link": "https://www.scotusblog.com/2025/03/chief-justice-rebukes-trumps-call-for-judicial-impeachment/",
    "timestamp": "2025-03-18T19:01:46Z"
  },
  {
    "title": "Putin may well get what he wants in Ukraine",
    "description": "The Russian president is quite close to drawing a thick red line in Eastern Europe that the West will have to respect.",
    "link": "https://www.aljazeera.com/opinions/2025/3/18/putin-may-well-get-what-he-wants-in-ukraine",
    "timestamp": "2025-03-18T19:01:39Z"
  },
  {
    "title": "WATCH: Putin Laughs Upon Being Told He's Running Late for Trump Call",
    "description": "The Russian leader could be seen laughing after being reminded he had a phone call with President Trump.",
    "link": "https://www.newsweek.com/watch-putin-laughs-upon-being-told-hes-running-late-trump-call-2046618",
    "timestamp": "2025-03-18T19:01:22Z"
  },
  {
    "title": "Putin Agrees to Infrastructure Ceasefire After Call with Trump",
    "description": "State of the Union: The Russian leader reiterated his conditions for a full ceasefire, including a complete stop on military aid to Ukraine.\nThe post Putin Agrees to Infrastructure Ceasefire After Call with Trump appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/putin-agrees-to-infrastructure-ceasefire-after-call-with-trump/",
    "timestamp": "2025-03-18T19:01:10Z"
  },
  {
    "title": "Singer Courtney Love announces she's getting UK citizenship, trashes 'emperor' Trump",
    "description": "Singer Courtney Love announced she was going to live in the United Kingdom permanently and getting her British citizenship, in comments trashing President Donald Trump.",
    "link": "https://www.foxnews.com/media/singer-courtney-love-announces-shes-getting-uk-citizenship-trashes-emperor-trump",
    "timestamp": "2025-03-18T19:00:30Z"
  },
  {
    "title": "Hong Kong’s leader takes swipe at Trump but avoids criticism of deal to sell Panama assets",
    "description": "Hong Kong’s leader says his government opposes coercion by foreign governments but stopped short of criticizing a prominent local conglomerate’s decision to sell its Panama Canal port assets to a consortium including American investment bank BlackRock.",
    "link": "https://www.pbs.org/newshour/world/hong-kongs-leader-takes-swipe-at-trump-but-avoids-criticism-of-deal-to-sell-panama-assets",
    "timestamp": "2025-03-18T19:00:13Z"
  },
  {
    "title": "White House Releases Readout of Trump, Putin Call- ‘Many Elements’ of Peace Deal with Ukraine Have Been Agreed To: Talks to Begin Immediately in Mideast",
    "description": "In a significant diplomatic development, President Trump and President Putin's recent call has yielded preliminary agreements on a peace deal for Ukraine, signaling a potential shift in U.S.-Russia relations and broader geopolitical stability.\nThe post White …",
    "link": "https://www.thegatewaypundit.com/2025/03/white-house-releases-readout-trump-putin-call-many/",
    "timestamp": "2025-03-18T19:00:04Z"
  },
  {
    "title": "Kremlin Says US Stopping Ukraine Aid is a ‘Key Condition’ of a Ceasefire",
    "description": "The Kremlin on Tuesday stated that the cessation of foreign aid to Ukraine was a \"key condition\" of a potential ceasefire.\nThe post Kremlin Says US Stopping Ukraine Aid is a ‘Key Condition’ of a Ceasefire first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/kremlin-says-us-stopping-ukraine-aid-is-a-key-condition-of-a-ceasefire/",
    "timestamp": "2025-03-18T18:59:54Z"
  },
  {
    "title": "Report highlights how communities hardest hit by climate change can build resilient water systems",
    "description": "The report released Tuesday was done in part by the Pacific Institute.",
    "link": "https://www.bostonherald.com/2025/03/18/climate-change-wastewater-resilience/",
    "timestamp": "2025-03-18T18:59:48Z"
  },
  {
    "title": "Trump ends Secret Service protections for Joe Biden’s kids, adding to unnerving pattern",
    "description": "There is no modern precedent for an American president to effectively wield security details as a political tool – until Donald Trump came along.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-ends-secret-service-protections-joe-bidens-kids-adding-unnerving-rcna196898",
    "timestamp": "2025-03-18T18:58:38Z"
  },
  {
    "title": "Trump doesn’t use autopen for legally binding documents, unlike Biden, White House says",
    "description": "The Trump administration’s official policy during both of his terms has been to use the president's hand signature on every legally operational or binding document, according to the White House.",
    "link": "https://www.foxnews.com/politics/unlike-biden-trump-doesnt-use-autopen-legally-binding-documents-white-house-says",
    "timestamp": "2025-03-18T18:58:28Z"
  },
  {
    "title": "America's Desperate Scramble for Eggs",
    "description": "\"The US have asked virtually every country in Europe.\"",
    "link": "https://www.newsweek.com/america-scramble-egg-shortage-2046630",
    "timestamp": "2025-03-18T18:57:49Z"
  },
  {
    "title": "'Snow White' has 'heigh-ho'pes for a fairy tale ending at the box office",
    "description": "Remaking Disney's first animated movie \"Snow White and the Seven Dwarfs\" would always be controversial, but Disney's new live-action retelling of the 1937 film may just whistle its way to box office success.",
    "link": "https://www.wesh.com/article/snow-white-box-office/64221778",
    "timestamp": "2025-03-18T18:56:45Z"
  },
  {
    "title": "Chief Justice Issues Rare Statement Over Donald’s Call To Impeach Judge",
    "description": "Chief Justice John Roberts issued a statement after co-president Donald Trump called for impeaching Judge James Boasberg as an unelected “troublemaker and agitator who was sadly appointed by Barack Hussein Obama.\" \nThe Supreme Court made Donald a king, but he…",
    "link": "https://crooksandliars.com/2025/03/roberts-issues-rare-statement-over-donald",
    "timestamp": "2025-03-18T18:56:07Z"
  },
  {
    "title": "Flashback: Medical Association Abandoned its Own Guidance Because Trump Agreed With Them",
    "description": "Last month, I wrote a piece entitled, 'what is wrong with the American Academy of Pediatrics?' I cited a number of pieces of evidence demonstrating how this medical association has been compromised and captured by far-left ideology and partisan politics. Thos…",
    "link": "https://freerepublic.com/focus/f-news/4305140/posts",
    "timestamp": "2025-03-18T18:56:06Z"
  },
  {
    "title": "DOGE Broke Into the Offices of a Pro-Peace Nonprofit: Report",
    "description": "U.S. Institute of Peace reportedly got evicted by Musk and company.",
    "link": "https://gizmodo.com/doge-broke-into-the-offices-of-a-pro-peace-nonprofit-report-2000577536",
    "timestamp": "2025-03-18T18:55:15Z"
  },
  {
    "title": "Pentagon Cutting Up To 60,000 Civilian Positions, Report Says",
    "description": "Defense Secretary Pete Hegseth reportedly said last month the department would work to “cease unnecessary defense spending.”",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/18/pentagon-cutting-up-to-60000-civilian-positions-report-says/",
    "timestamp": "2025-03-18T18:54:18Z"
  },
  {
    "title": "JD Vance tries to mend the MAGA-Tech divide",
    "description": "On Tuesday, Vice President JD Vance publicly acknowledged a simmering â\u0080\u009ctensionâ\u0080\u009d between two warring factions inside the Republican party â\u0080\u0093 the populist MAGA right and the tech billionaires who threw their support to Donald Trump  â\u0080\u0093 and called for a tr…",
    "link": "https://www.theverge.com/policy/632006/jd-vance-maga-tech-divide-andreesen-horowitz",
    "timestamp": "2025-03-18T18:53:26Z"
  },
  {
    "title": "Vivek Ramaswamy’s Latest Idea is Dumber Than the “Gulf of America”",
    "description": "Three weeks into his gubernatorial campaign, and failed presidential candidate Vivek Ramaswamy is already pathetically parroting Donald Trump’s name-changing stunt. \r\nDuring an address to the Lucas County Republican Party last week, Ramaswamy pitched changing…",
    "link": "https://newrepublic.com/post/192882/vivek-ramaswamy-donald-trump-rename-lake-erie",
    "timestamp": "2025-03-18T18:53:20Z"
  },
  {
    "title": "This Video Of Kamala Harris Warning About A Second Trump Presidency Is Going Viral",
    "description": "Much of what Harris predicted on the campaign trail has come to pass since Trump took office again.",
    "link": "https://www.huffpost.com/entry/kamala-harris-donald-trump-viral-video_n_67d9a6d8e4b0af2e3353ba11",
    "timestamp": "2025-03-18T18:53:19Z"
  },
  {
    "title": "Nigeria, seven others may face HIV drug shortages – WHO",
    "description": "The World Health Organisation has warned that the United States’ decision to halt foreign aid has disrupted the supply of HIV treatments in Nigeria, Haiti, Kenya, Lesotho, South Sudan, Burkina Faso, Mali, and Ukraine. The WHO Director-General, Tedros Ghebreye…",
    "link": "https://punchng.com/nigeria-seven-others-may-face-hiv-drug-shortages-who/",
    "timestamp": "2025-03-18T18:52:13Z"
  },
  {
    "title": "California Sen Adam Schiff changes tune on DOJ, reams increasingly 'Orwellian' leadership",
    "description": "Sen. Adam Schiff, D-Calif., has changed his tune on the Justice Department, transforming from one of its staunchest defenders to a vocal critic under President Donald Trump.",
    "link": "https://www.foxnews.com/politics/california-senator-adam-schiff-changes-tune-doj-reams-increasingly-orwellian-leadership",
    "timestamp": "2025-03-18T18:52:01Z"
  },
  {
    "title": "Putin halts strikes on Ukraine’s energy for 30 days",
    "description": "Russian President Vladimir Putin on Tuesday ordered a 30-day halt to strikes on Ukraine’s energy infrastructure following a call with United States President Donald Trump, according to a statement from the Kremlin. The decision came as part of ongoing discuss…",
    "link": "https://punchng.com/putin-halts-strikes-on-ukraines-energy-for-30-days/",
    "timestamp": "2025-03-18T18:51:44Z"
  },
  {
    "title": "German fiscal plan boosts European stocks",
    "description": "Germany’s Bundestag approves reforms  that include a major rollback of the so-called debt brake to increase defence spending",
    "link": "https://www.irishtimes.com/business/2025/03/18/german-fiscal-plan-boosts-european-stocks/",
    "timestamp": "2025-03-18T18:51:19Z"
  },
  {
    "title": "Vice President JD Vance to Serve as Republican National\nCommittee Finance Chairman",
    "description": "WASHINGTON D.C. - The Republican National Committee (RNC) proudly announced today that the Vice President of the United States, JD Vance, will serve as the next RNC Finance Chairman. This will be the first time in the history of the Republican National Commit…",
    "link": "https://freerepublic.com/focus/f-news/4305138/posts",
    "timestamp": "2025-03-18T18:51:13Z"
  },
  {
    "title": "Oracle is reportedly in the lead to save TikTok from US ban",
    "description": "Oracle is closing in on a deal that would have it “vouch” for TikTok’s security in exchange for a small stake in the company’s US operations, according to Bloomberg. The plan, which was reportedly discussed among the Trump administration last week, would incl…",
    "link": "https://www.theverge.com/news/631999/oracle-tiktok-ban-deal-project-texas",
    "timestamp": "2025-03-18T18:50:55Z"
  },
  {
    "title": "Cruise stocks sinking during rough session",
    "description": "Cruise stocks, including Norwegian (NCLH), Royal Caribbean (RCL), and Carnival (CCL), are taking on water. Royal Caribbean shares tumbled six percent today.Read more...",
    "link": "https://qz.com/cruise-ship-shares-tank-1851770806",
    "timestamp": "2025-03-18T18:49:56Z"
  },
  {
    "title": "‘Deep State Asset!’ MAGA-World Erupts Over Rare John Roberts Rebuke of Trump",
    "description": "President Donald Trump's biggest fans in MAGA-world were rather vexed by Chief Justice John Roberts's rebuke of Trump on Tuesday.\nThe post ‘Deep State Asset!’ MAGA-World Erupts Over Rare John Roberts Rebuke of Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/deep-state-asset-maga-world-erupts-over-rare-john-roberts-rebuke-of-trump/",
    "timestamp": "2025-03-18T18:48:37Z"
  },
  {
    "title": "Trump Was Worried About Running Against Newsom",
    "description": "Tara Palmeri interviewed Alex Isenstadt -- author of the new book Revenge -- and learned that Donald Trump was worried that if he hit Joe Biden too hard in the early days, he would take",
    "link": "https://politicalwire.com/2025/03/18/trump-was-worried-about-running-against-gavin-newsom/",
    "timestamp": "2025-03-18T18:48:28Z"
  },
  {
    "title": "FACT CHECK: No, Trump Did Not Make A Truth Social Post About Annexing Greenland And Alaska",
    "description": "A viral image shared on X purports to show a TRUTH Social post from President Donald Trump in which he allegedly claimed he would annex Greenland and Alaska. FFS someone tell him‍♂️ pic.twitter.com/Rg0tN4aUb1 — KGB_News (@GBNews23653867) March 14, 2025 Ve…",
    "link": "https://checkyourfact.com/2025/03/18/fact-check-trump-post-annexing-greenland-alaska/",
    "timestamp": "2025-03-18T18:47:59Z"
  },
  {
    "title": "White House says Trump, Putin will seek limited ceasefire on energy, infrastructure in Ukraine war",
    "description": "WASHINGTON (AP) — President Donald Trump and Russian President Vladimir Putin agreed during a lengthy call Tuesday to an immediate pause in strikes against energy and infrastructure targets in the Ukraine war, but the Russian leader stopped short of backing…",
    "link": "https://www.thesunchronicle.com/news/nation_world/white-house-says-trump-putin-will-seek-limited-ceasefire-on-energy-infrastructure-in-ukraine-war/article_80a06abe-0429-11f0-b656-1fa301a3a99a.html",
    "timestamp": "2025-03-18T18:47:00Z"
  },
  {
    "title": "They worked to prevent violence and terrorism at the agency created after 9/11. Then they got fired",
    "description": "Terminated employees included former social workers and mental health professionals.",
    "link": "https://www.bostonherald.com/2025/03/18/terrorism-office/",
    "timestamp": "2025-03-18T18:46:02Z"
  },
  {
    "title": "Byron Donalds picks up endorsement from fellow House Republican as he eyes Florida governorship",
    "description": "Florida Republican Rep. Vern Buchanan endorses fellow GOP Rep. Byron Donalds for Sunshine State governor. President Donald Trump is already backing Donalds.",
    "link": "https://www.foxnews.com/politics/byron-donalds-picks-up-endorsement-from-fellow-house-republican-he-eyes-florida-governorship",
    "timestamp": "2025-03-18T18:45:45Z"
  },
  {
    "title": "Elon Musk on X: What Tesla Billionaire Has Posted on March 18 So Far",
    "description": "Elon Musk has continued his prolific use of X, formerly Twitter, ever since he purchased the site.",
    "link": "https://www.newsweek.com/elon-musk-x-latest-posts-tweets-update-2046597",
    "timestamp": "2025-03-18T18:45:19Z"
  },
  {
    "title": "Bank of Korea Rejects Bitcoin As Foreign Reserve Asset, Citing Instability and Other Factors: Report",
    "description": "South Korea’s central bank reportedly has no plans to include Bitcoin (BTC) in its foreign exchange reserves. The Bank of Korea said “a cautious approach is needed” when it comes to Bitcoin, citing the top crypto asset’s price volatility, per a new report fro…",
    "link": "https://dailyhodl.com/2025/03/18/bank-of-korea-rejects-bitcoin-as-foreign-reserve-asset-citing-instability-and-other-factors-report/",
    "timestamp": "2025-03-18T18:45:10Z"
  },
  {
    "title": "France to reopen fourth nuclear air base as Europe rushes to rearm (Laura Kayali/Politico)",
    "description": "Laura Kayali / Politico:\nFrance to reopen fourth nuclear air base as Europe rushes to rearm  —  Emmanuel Macron announces site near Germany will be modernized to host nukes amid fears Donald Trump will desert the continent.  —  France will modernize one of th…",
    "link": "https://www.memeorandum.com/250318/p104",
    "timestamp": "2025-03-18T18:45:00Z"
  },
  {
    "title": "The Massive Reason Hollywood's Leftie Stars Are Now BEGGING Donald Trump for Help — After Branding Him Everything from a 'Pig' to 'Fascist Dictator'",
    "description": "Hollywood liberals have performed a stunning U-turn and are now begging Donald Trump for help, despite previously branding president a 'pig' and a 'fascist.'",
    "link": "https://radaronline.com/p/hollywood-leftie-begging-donald-trump-help-fascist-dictator/",
    "timestamp": "2025-03-18T18:45:00Z"
  },
  {
    "title": "‘Tough gig’: Tucker Carlson predicts this name will be 2028 Republican presidential nominee",
    "description": "'The only person in the entire party from my position who's capable of carrying on the Trump legacy and expanding it, making it what it should fully be'",
    "link": "https://www.wnd.com/2025/03/tough-gig-tucker-carlson-predicts-this-name-will-be-2028-republican-presidential-nominee/",
    "timestamp": "2025-03-18T18:43:17Z"
  },
  {
    "title": "How long it will take for stranded NASA astronauts to reach Earth as they begin return mission",
    "description": "NASA astronauts Barry 'Butch' Wilmore and Sunita Williams have been stranded on the International Space Station (ISS) since June 2024",
    "link": "https://www.ladbible.com/news/science/when-nasa-astronauts-return-earth-suni-williams-butch-wilmore-937831-20250318",
    "timestamp": "2025-03-18T18:41:29Z"
  },
  {
    "title": "Judge orders reinstatement of education grants axed by Trump in DEI sweep",
    "description": "A judge ordered the Trump administration to reinstate education grants it had nixed as part of its work to end DEI initiatives.",
    "link": "https://www.cnbc.com/2025/03/18/judge-orders-education-grants-in-trump-dei-sweep-restored.html",
    "timestamp": "2025-03-18T18:41:20Z"
  },
  {
    "title": "Two States Warned of Blizzards, Fires at the Same Time",
    "description": "Simultaneous blizzard and red flag warnings are not common. The storm will move out of the area on Wednesday.",
    "link": "https://www.newsweek.com/nebraska-kansas-warned-blizzards-fires-same-time-2046561",
    "timestamp": "2025-03-18T18:40:10Z"
  },
  {
    "title": "Boycott fever spreads: After Canada, Denmark and Europe join forces in rejecting U.S. products over trade policies",
    "description": "A boycott of American goods is gaining traction in Denmark and Europe as a response to President Trump's trade policies and actions, such as the threat to seize Greenland from Denmark. Social media campaigns and supermarket actions reflect growing displeasure…",
    "link": "https://economictimes.indiatimes.com/news/international/us/boycott-fever-spreads-after-canada-denmark-and-europe-join-forces-in-rejecting-u-s-products-over-trade-policies/articleshow/119173763.cms",
    "timestamp": "2025-03-18T18:39:41Z"
  },
  {
    "title": "Trump Admin Scrubs Biden-Era ‘Firearm Violence’ Advisory From Internet",
    "description": "The Trump administration has removed a surgeon general's advisory on the public health effects of gun violence and a similar webpage from the HHS website.",
    "link": "https://dailycaller.com/2025/03/18/trump-admin-surgeon-general-advisory-hhs-firearm-violence/",
    "timestamp": "2025-03-18T18:39:40Z"
  },
  {
    "title": "Putin Agrees To Incremental, Temporary Ceasefire While Trump Seeks More Ties With Russia In Phone Call",
    "description": "Putin agreed to an incremental and temporary ceasefire during a marathon phone call with Trump which discussed the possibility of a peace deal.",
    "link": "https://dailycaller.com/2025/03/18/vladimir-putin-donald-trump-ceasefire-russia-ukraine-war/",
    "timestamp": "2025-03-18T18:39:26Z"
  },
  {
    "title": "Trump Spox Karoline Leavitt Hit With Brutal X ‘Community Note’ After Stunning Swipe At US Ally",
    "description": "Karoline Leavitt got hit with a brutal X/Twitter \"Community Note\" after she took a stunning shot at longtime ally France in a spat over the Statue of Liberty.\nThe post Trump Spox Karoline Leavitt Hit With Brutal X ‘Community Note’ After Stunning Swipe At US A…",
    "link": "https://www.mediaite.com/news/trump-spox-karoline-leavitt-hit-with-brutal-x-community-note-after-stunning-swipe-at-us-ally/",
    "timestamp": "2025-03-18T18:39:20Z"
  },
  {
    "title": "'We will fight': Anti-woke beer company fires back at beer giant for 'intimidation' amid trademark dispute",
    "description": "A conservative beer company is pushing back after beer giant Anheuser-Busch filed a trademark claim against it after the company went viral for criticizing Bud Light’s association with a transgender influencer. \"Anheuser-Busch has filed a federal trademark op…",
    "link": "https://freerepublic.com/focus/f-news/4305134/posts",
    "timestamp": "2025-03-18T18:39:00Z"
  },
  {
    "title": "Supreme Court chief rebukes Trump over call for judge's impeachment",
    "description": "Supreme Court Justice John Roberts issued a rare public admonishment to President Donald Trump following Trump's call for the impeachment of District Judge James Boasberg. Boasberg had ordered the suspension of deportation flights of alleged illegal migrants,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/supreme-court-chief-rebukes-trump-over-call-for-judges-impeachment/articleshow/119175126.cms",
    "timestamp": "2025-03-18T18:38:26Z"
  },
  {
    "title": "US Supreme Court chief justice issues rare public rebuke of Trump over judicial threats",
    "description": "The News\nIn a rare public statement Tuesday, US Supreme Court Chief Justice John Roberts criticized President Donald Trump’s calls to impeach a federal judge who ruled against the administration.\nRoberts said the president’s suggestion was “not an appropriate…",
    "link": "https://biztoc.com/x/7d7374662866cd16",
    "timestamp": "2025-03-18T18:37:22Z"
  },
  {
    "title": "Newsom asks for nearly another $3B for state health program overwhelmed by illegal immigrants - NewsBreak",
    "description": "The Newsom administration is asking more money from California lawmakers to patch the state's bloated healthcare budget amid costs from illegal immigrants.",
    "link": "https://www.newsbreak.com/share/3861340468398-newsom-asks-for-nearly-another-3b-for-state-health-program-overwhelmed-by-illegal-immigrants?s=a2&amp;share_destination_id=MjE3MjM4NjM3LTE3NDIzMjI0MjAyMzA%3D&amp;pd=0EhVgzXq&amp;hl=en_US&amp;send_time=1742322420&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.43.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_blend_exp_25q1-v5%2Cns_local_strategy_25q1_exp-control",
    "timestamp": "2025-03-18T18:37:15Z"
  },
  {
    "title": "Trump Is Explicitly Targeting Legal Residents Based on the Opinions They Express",
    "description": "Although Mahmoud Khalil is a legal permanent resident of the United States, the Trump administration says, he is \"subject to removal\" because Secretary of",
    "link": "https://reason.com/2025/03/19/trump-is-explicitly-targeting-legal-residents-based-on-the-opinions-they-express/",
    "timestamp": "2025-03-18T18:37:06Z"
  },
  {
    "title": "Israel Kills 400 in Gaza, Resuming Bombings After Months of Ceasefire Violations",
    "description": "Israeli forces have unleashed an intense assault across Gaza, killing at least 174 Palestinian children, reports say.",
    "link": "https://truthout.org/articles/israel-kills-400-in-gaza-resuming-bombings-after-months-of-ceasefire-violations/",
    "timestamp": "2025-03-18T18:36:15Z"
  },
  {
    "title": "Hungary passes anti-LGBTQ+ law banning Pride events",
    "description": "Hungarian lawmakers have passed a law banning Pride events and allowing authorities to use facial recognition software to identify attendees.",
    "link": "https://www.pbs.org/newshour/world/hungary-passes-anti-lgbtq-law-banning-pride-events",
    "timestamp": "2025-03-18T18:36:07Z"
  },
  {
    "title": "Italy rejects Franco-British plan to deploy troops to Ukraine",
    "description": "Prime Minister Giorgia Meloni has said she supports US-backed peace talks between Kiev and Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614429-italy-rejects-ukraine-troop-deployment/",
    "timestamp": "2025-03-18T18:35:43Z"
  },
  {
    "title": "Looks Like Another Trans Attack on a Tesla Dealership",
    "description": "The phenomenon of men who pretend to be women vandalizing Tesla dealerships to punish Elon Musk for exposing Big Government waste and fraud continues. To a list that includes Lucy Grace Nelson and Adam Lansky, it would appear safe to add Erin White: A Buffalo…",
    "link": "https://moonbattery.com/looks-like-another-trans-attack-on-a-tesla-dealership/",
    "timestamp": "2025-03-18T18:35:27Z"
  },
  {
    "title": "Chuck Schumer Mocks Notion That People Resent Spending Money They Earned On Taxes",
    "description": "Democrat Senate Minority Leader Chuck Schumer mocked so-called \"greedy\" Republicans who want to keep the money they earned during an appearance on \"The View.\"",
    "link": "https://dailycaller.com/2025/03/18/chuck-schumer-mocks-money-taxes-the-view/",
    "timestamp": "2025-03-18T18:34:04Z"
  },
  {
    "title": "Former NYPD Inspector: Judge Blocking Deportation Of Terrorists Is ‘Over His Skis’",
    "description": "Paul Mauro told Harris Faulkner the federal judge who demanded flights carrying members of Tren de Aragua (TdA) be turned around was exceeding his authority.",
    "link": "https://dailycaller.com/2025/03/18/former-nypd-inspector-judge-blocking-deportation-of-terrorists-is-over-his-skis/",
    "timestamp": "2025-03-18T18:33:29Z"
  },
  {
    "title": "Jon Stewart criticizes Dems for 'pedaling really hard and not going anywhere,' like stationary bike",
    "description": "Late-night host Jon Stewart compared Democrats to a stationary bike, \"pedaling really hard and not going anywhere,\" on \"The Daily Show\" Monday night.",
    "link": "https://www.foxnews.com/media/jon-stewart-criticizes-dems-pedaling-really-hard-not-going-anywhere-like-stationary-bike",
    "timestamp": "2025-03-18T18:33:00Z"
  },
  {
    "title": "Cuts to Federal Food Aid Are Severing a Lifeline for Natural Disaster Survivors",
    "description": "USDA’s decision to cut $1 billion worth of food aid is causing layoffs and shortfalls, all as hunger continues to climb.",
    "link": "https://grist.org/food-and-agriculture/our-people-are-hungry-usda-federal-food-aid-cuts/",
    "timestamp": "2025-03-18T18:32:57Z"
  },
  {
    "title": "Crypto firms aiming for banking licenses under Trump administration",
    "description": "Fintech and crypto firms are actively pursuing state and national banking licenses under President Donald Trump’s administration to gain regulatory approval that was previously slow to materialize.  According to a Reuters report, industry executives indicate …",
    "link": "https://cryptoslate.com/crypto-firms-aiming-for-banking-licenses-under-trump-administration/",
    "timestamp": "2025-03-18T18:32:48Z"
  }
]