[
  {
    "title": "Ukraine and Russia agree to new prisoner exchange in Istanbul",
    "description": "Talks follow Kyiv’s daring assault on Moscow’s airfields and come despite gulf between two sides’ positions",
    "link": "https://www.irishtimes.com/world/europe/2025/06/02/ukraine-and-russia-agree-to-new-prisoner-exchange-in-istanbul/",
    "timestamp": "2025-06-02T19:34:37Z"
  },
  {
    "title": "'Hottest brand': 2025 Trump Org deals far surpass total from first presidency",
    "description": "The Trump Organization has announced more international deals in the first five months of President Donald Trump's second term than were made in the whole of his first term, according to a Wall Street Journal report\r\n. “During Trump’s first presidency, his co…",
    "link": "https://www.rawstory.com/trump-2672249274/",
    "timestamp": "2025-06-02T19:34:29Z"
  },
  {
    "title": "Tulsa plans $105m in reparations for America's 'hidden' massacre",
    "description": "A century ago, a white mob burned down part of the Oklahoma city known as \"Black Wall Street\", killing hundreds.",
    "link": "https://www.bbc.com/news/articles/c9dqnz37v1wo",
    "timestamp": "2025-06-02T19:28:30Z"
  },
  {
    "title": "Cuba Accuses Top U.S. Diplomat of 'Unfriendly Conduct' for Meeting with Actual Cubans",
    "description": "Cuba issued a warning to the head of the U.S. embassy in Havana, Mike Hammer, accusing him of \"interfering and unfriendly conduct.\"\nThe post Cuba Accuses Top U.S. Diplomat of ‘Unfriendly Conduct’ for Meeting with Actual Cubans appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/06/02/cuba-accuses-top-u-s-diplomat-of-unfriendly-conduct-for-meeting-with-actual-cubans/",
    "timestamp": "2025-06-02T19:28:12Z"
  },
  {
    "title": "'Trolling': Trump's Garden of Heroes plan leaves artists offended",
    "description": "Artists see a President Donald Trump’s plan to create a National Garden of American Heroes as “trolling” and not “very serious,” according to a Politico report\r\n. “It seems completely unworkable,” Daniel Kunitz, editor of Sculpture magazine, told Politico. Th…",
    "link": "https://www.rawstory.com/national-garden-of-american-heroes/",
    "timestamp": "2025-06-02T19:25:41Z"
  },
  {
    "title": "Trump cites California LGBTQ+ centers to justify big cuts to ‘woke’ campuses",
    "description": "San Diego’s community college district finds itself directly in Trump’s crosshairs: Its “pride centers” were the only items called out by name in the administration’s plan to slash more than $10 billion of federal spending on education.",
    "link": "https://www.kpbs.org/news/education/2025/06/02/trump-cites-california-lgbtq-centers-to-justify-big-cuts-to-woke-campuses",
    "timestamp": "2025-06-02T19:24:17Z"
  },
  {
    "title": "Director Yells ‘Free Palestine’ at Canadian Screen Awards on Same Day Boulder Illegal Alien Terror Suspect Screams Chant",
    "description": "A documentary film director and indigenous activist blurted out \"Free Palestine\" Sunday during Canada's Screen Awards, held on the very same day that an Egyptian terrorist tried to murder Jewish Americans at a rally in Boulder, Colorado.\nThe post Director Yel…",
    "link": "https://www.breitbart.com/entertainment/2025/06/02/director-yells-free-palestine-at-canadian-screen-awards-on-same-day-boulder-illegal-alien-terror-suspect-screams-chant/",
    "timestamp": "2025-06-02T19:23:49Z"
  },
  {
    "title": "Families gather in New Mexico to welcome Rio Grande waters after long drought",
    "description": "The release of water from Caballo Dam drew hundreds downriver on Saturday, May 31 to celebrate the release to area parks.",
    "link": "https://www.elpasotimes.com/story/life/outdoors/2025/06/02/flowing-rio-grande-draws-hundreds-to-celebrate-water-release/83989537007/",
    "timestamp": "2025-06-02T19:22:50Z"
  },
  {
    "title": "EXCLUSIVE: Dr. Vichi Ganesh and President Trump Were Targeted by the Same Corrupt Prosecutor Who Worked As Top Man Under Jack Smith",
    "description": "There is evidence that no doctor in US history was ever convicted of crimes based on false, fabricated evidence using 40,000 stolen patient records from an entirely different office until Dr.\nThe post EXCLUSIVE: Dr. Vichi Ganesh and President Trump Were Targe…",
    "link": "https://joehoft.com/exclusive-dr-vichi-ganesh-and-president-trump-were-targeted-by-the-same-prosecutor-who-made-up-evidence-to-imprison-them/",
    "timestamp": "2025-06-02T19:20:17Z"
  },
  {
    "title": "The Secret History of Trump's Private Cellphone (The Atlantic)",
    "description": "The Atlantic:\nThe Secret History of Trump's Private Cellphone  —  “Who's calling?” the president asks as he answers call after call from numbers he doesn't know.  —  Just before election day, a disturbing piece of information made its way to Donald Trump.  Wh…",
    "link": "https://www.memeorandum.com/250602/p100",
    "timestamp": "2025-06-02T19:20:00Z"
  },
  {
    "title": "Trump's Attack on the Federalist Society Is a Bad Omen for Originalism",
    "description": "President Donald Trump remade the Republican Party in his own MAGA image. Will he now do the same to the conservative legal movement? \nDuring his first term, Trump benefited immeasurably from his association with Leonard Leo, the former Federalist Society off…",
    "link": "https://biztoc.com/x/206dd509ca4b1702",
    "timestamp": "2025-06-02T19:18:41Z"
  },
  {
    "title": "Bannon: Either U.S. Intel Didn't Know About Ukraine Attack On Russian Bombers, Or Helped -- Both Very Dangerous",
    "description": "Steve Bannon warned on the \"War Room\" podcast that Ukraine's wildly successful drone attack on Russia's strategic bomber fleet could be construed as an act of war, depending on how much help the U.S. provided to Ukraine. \r\n\r\n\"This is as bold an act of war as …",
    "link": "https://www.realclearpolitics.com/video/2025/06/02/bannon_either_us_intel_didnt_know_about_ukraine_attack_on_russian_bombers_or_helped_--_both_very_dangerous.html",
    "timestamp": "2025-06-02T19:18:16Z"
  },
  {
    "title": "Trump asks the Supreme Court to clear the way for federal downsizing plans",
    "description": "WASHINGTON (AP) — President Donald Trump’s administration on Monday renewed its request for the Supreme Court to clear the way for plans to downsize the federal workforce, while a lawsuit filed by labor unions and cities proceeds.The high court filing came af…",
    "link": "https://freerepublic.com/focus/f-news/4320583/posts",
    "timestamp": "2025-06-02T19:17:56Z"
  },
  {
    "title": "Report Details Global Deterioration of Workers' Rights—Including in US Under Trump",
    "description": "A report released Monday by the International Trade Union Confederation, a global network of unions, states that workers' rights around the world are in \"free fall\"—including in the United States, where U.S. President Donald Trump has taken \"a wrecking ball t…",
    "link": "https://www.commondreams.org/news/international-trade-union-confederation-index-2025",
    "timestamp": "2025-06-02T19:17:52Z"
  },
  {
    "title": "‘Trump Always Chickens Out’ (TACO) Has ‘Let’s Go Brandon’ Staying Power",
    "description": "President Donald Trump has long used nicknames to denigrate his political foes. The nicknames haven't always the cleverest, but that's never been the purpose",
    "link": "https://www.forbes.com/sites/petersuciu/2025/06/02/trump-always-chickens-out-taco-has-lets-go-brandon-staying-power/",
    "timestamp": "2025-06-02T19:16:47Z"
  },
  {
    "title": "President Donald Trump Floats Peculiar Conspiracy Theory That Joe Biden Is A Clone",
    "description": "President Donald Trump took to Truth Social and reshared a post that claimed former President Joe Biden is a clone.",
    "link": "https://hiphopwired.com/2727105/president-donald-trump-conspiracy-theory-joe-biden-clone/",
    "timestamp": "2025-06-02T19:16:39Z"
  },
  {
    "title": "Trump’s Phone Lock Screen Is Going Viral Again",
    "description": "\"Is that not one of the most narcissistic, self-absorbed things you’ve ever seen?\" one social media user questioned.",
    "link": "https://www.huffpost.com/entry/donald-trump-phone-lock-screen_n_683dc3f9e4b095a1384118cd",
    "timestamp": "2025-06-02T19:16:13Z"
  },
  {
    "title": "Jerome Powell resignation: Is the Fed Chairman quitting? Social media abuzz with rumors — what's the truth?",
    "description": "Rumors on social media claimed that US Fed Chair Jerome Powell might resign, but there’s no proof. A betting site shows low chances of him quitting, and the Fed hasn’t commented. This comes after Trump told Powell to cut interest rates, but Powell disagreed.",
    "link": "https://economictimes.indiatimes.com/news/international/us/jerome-powell-resignation-is-the-fed-chairman-quitting-social-media-abuzz-with-rumors-whats-the-truth/articleshow/121579919.cms",
    "timestamp": "2025-06-02T19:15:31Z"
  },
  {
    "title": "The Latest Supreme Court Decision Could Force Disney to Fire Even More Cast Members",
    "description": "In March, Homeland Security Secretary Kristi Noem sought to end a program that began under the Biden Administration. The program allowed immigrants from Cuba, Haiti, Nicaragua, and Venezuela (CHNV) who entered the country legally to live and work in America w…",
    "link": "https://insidethemagic.net/2025/06/supreme-court-decision-could-force-disney-to-fire-more-cast-members-rl1/",
    "timestamp": "2025-06-02T19:14:15Z"
  },
  {
    "title": "Tim Walz says Harris campaign media strategy fell way short",
    "description": "Gov. Tim Walz called out the Harris campaign's media strategy during a conversation with the \"Grounded\" podcast, suggesting they should have focused on podcasts and local media.",
    "link": "https://www.foxnews.com/media/tim-walz-says-harris-campaign-media-strategy-fell-way-short",
    "timestamp": "2025-06-02T19:13:36Z"
  },
  {
    "title": "FBI: Boulder attacker admitted targeting 'Zionist group'; court charges him with federal hate crime",
    "description": "Trump threatened to deport the suspect, claiming he entered the U.S. through 'Biden's ridiculous open border policy.' The president made no mention of Israel or the hostages in his statement",
    "link": "https://www.haaretz.com/israel-news/2025-06-02/ty-article/fbi-boulder-attacker-admitted-targeting-zionist-group-court-charges-hate-crime/00000197-31aa-d079-ab97-75ef92bb0000",
    "timestamp": "2025-06-02T19:13:18Z"
  },
  {
    "title": "Colorado firebomb suspect planned attack for a year, prosecutors say",
    "description": "BOULDER: An Egyptian national charged with tossing gasoline bombs at a pro-Israeli rally in Colorado, injuring a dozen people, spent a year planning his attack and used Molotov cocktails instead o",
    "link": "https://www.channelnewsasia.com/world/colorado-attack-firebomb-suspect-planned-year-pro-israel-rally-5163336",
    "timestamp": "2025-06-02T19:13:00Z"
  },
  {
    "title": "Retailer Temus daily US users halve following end of de minimis loophole",
    "description": "USA-TRUMP/TARIFFS-PDD HLDG (PIX):Retailer Temu's daily US users halve following end of 'de minimis' loophole",
    "link": "https://www.livemint.com/companies/news/retailer-temus-daily-us-users-halve-following-end-of-de-minimis-loophole-11748891533791.html",
    "timestamp": "2025-06-02T19:12:13Z"
  },
  {
    "title": "Russia sets out punitive terms at peace talks with Ukraine",
    "description": "Russia told Ukraine at peace talks on Monday that it would only agree to end the war if Kyiv gives up big new chunks of territory and accepts limits on the size of its army, according to a memorandum reported by Russian media.Two sides talk for barely an hour…",
    "link": "https://freerepublic.com/focus/f-news/4320582/posts",
    "timestamp": "2025-06-02T19:12:01Z"
  },
  {
    "title": "New steel tariffs mixed bag for Indian companies making in US",
    "description": "The US government is doubling tariffs on steel and aluminium imports. This move creates uncertainty, but offers mixed results for Indian firms with US operations. JSW Steel's US units are improving, expecting positive contributions. Hindalco's Novelis anticip…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/steel/new-steel-tariffs-mixed-bag-for-indian-companies-making-in-us/articleshow/121579985.cms",
    "timestamp": "2025-06-02T19:10:54Z"
  },
  {
    "title": "Trump's Attack on the Federalist Society Is a Bad Omen for Originalism",
    "description": "President Donald Trump remade the Republican Party in his own MAGA image. Will he now do the same to the conservative legal movement? During his first",
    "link": "https://reason.com/2025/06/02/trumps-attack-on-the-federalist-society-is-a-bad-omen-for-originalism/",
    "timestamp": "2025-06-02T19:10:02Z"
  },
  {
    "title": "Did Bill Buckley Really Lead a Successful Revolution?",
    "description": "Buckley: The Life and the Revolution that Changed America, by Sam Tanenhaus, Random House, 1,040 pages, $40 For decades, William F. Buckley",
    "link": "https://reason.com/2025/06/03/did-bill-buckley-really-lead-a-successful-revolution/",
    "timestamp": "2025-06-02T19:08:39Z"
  },
  {
    "title": "Trump Got Battered by Federal Courts Across the Country in May",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump was dealt a brutal hand last month by federal district courts across the country as they struck down—or at least temporarily paused—a number of the administration's directives on some of…",
    "link": "https://biztoc.com/x/d4fbb0108ee41ca2",
    "timestamp": "2025-06-02T19:07:31Z"
  },
  {
    "title": "Trans-Identifying Athlete Wins 2 Girls' Track Events In California",
    "description": "Trans-Identifying Athlete Wins 2 Girls' Track Events In California\n \nAuthored by Aldgra Fredly via The Epoch Times,\nA transgender-identifying athlete won two girls’ events at the California high school championship on May 31, despite President Donald Trump th…",
    "link": "https://biztoc.com/x/0d571ed7fc1a9813",
    "timestamp": "2025-06-02T19:07:22Z"
  },
  {
    "title": "To deliver intelligence to Trump, DNI Tulsi Gabbard eyes creative solutions",
    "description": "Donald Trump doesn't like to read intelligence reports, so officials are considering new ideas — including turning briefings into Fox News-style segments.",
    "link": "https://biztoc.com/x/450851adae8080f4",
    "timestamp": "2025-06-02T19:07:03Z"
  },
  {
    "title": "The Supreme Court Thinks It Protected the Economy From Trump. It’s Delusional.",
    "description": "They’re ready to crown a king, and they’re going to do it even if it is King Trump.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-analysis-trump-powell-fed-chair-firing.html",
    "timestamp": "2025-06-02T19:05:46Z"
  },
  {
    "title": "Trump Got Battered by Federal Courts Across the Country in May",
    "description": "The Trump administration was dealt setbacks at courts across the US on a host of issues—but it also snagged a few critical wins.",
    "link": "https://www.newsweek.com/trump-district-courts-wins-losses-may-2078782",
    "timestamp": "2025-06-02T19:05:42Z"
  },
  {
    "title": "Türkiye wants to host Trump, Putin, Zelenskyy meeting: Erdoğan",
    "description": "President Recep Tayyip Erdoğan said he would like to host a meeting between Russian President Vladimir Putin, Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump in Istanbul or Ankara, as he expressed his desire to make Istanbul the center…",
    "link": "https://freerepublic.com/focus/f-chat/4320579/posts",
    "timestamp": "2025-06-02T19:01:46Z"
  },
  {
    "title": "Egyptian outlets paint connection between Colorado attacker, Muslim Brotherhood",
    "description": "US President Donald Trump echoed the theme on Truth Social, writing that the attack showed why “the Muslim Brotherhood must stay banned and its sympathisers removed.”",
    "link": "https://www.jpost.com/international/islamic-terrorism/article-856304",
    "timestamp": "2025-06-02T19:00:40Z"
  },
  {
    "title": "Foreign nationals charged amid Trump visa crackdown for scheme to smuggle US military equipment into China",
    "description": "Two foreign nationals have been charged for their role in a scheme to smuggle U.S. military equipment and technology — including missiles — into China, according to the U.S. Justice Department.",
    "link": "https://www.foxnews.com/politics/foreign-nationals-charged-amid-trump-visa-crackdown-scheme-smuggle-us-military-equipment-china",
    "timestamp": "2025-06-02T18:59:18Z"
  },
  {
    "title": "What 'Russia's Pearl Harbor' Says About Trump's Golden Dome",
    "description": "A Ukrainian drone swarm costing thousands of dollars appears to have caused billions in damage—just as Trump advances a $175 billion missile shield critics call outdated.",
    "link": "https://www.newsweek.com/what-russias-pearl-harbor-says-about-trumps-golden-dome-2079958",
    "timestamp": "2025-06-02T18:59:16Z"
  },
  {
    "title": "'Toxic': Vietnam vet so sickened by Trump he can't bear to fly American flag",
    "description": "An 84-year-old Vietnam veteran is taking a stand against President Donald Trump by taking down the American flag that used to hang outside his California home, according to a report from the Guardian\r\n. “The American flag won’t fly again until things get stra…",
    "link": "https://www.rawstory.com/trump-veteran/",
    "timestamp": "2025-06-02T18:57:43Z"
  },
  {
    "title": "Erdogan outlines vision for Russia-Ukraine talks",
    "description": "The Turkish leader has suggested hosting a leadership-level summit in Istanbul or Ankara Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618559-erdogan-russia-ukraine-summit/",
    "timestamp": "2025-06-02T18:57:34Z"
  },
  {
    "title": "Ukraine peace talks: What are Kyiv and Moscow’s positions?",
    "description": "Delegations from Kyiv and Moscow on Monday held a second round of direct talks on the possibility of ending the war in Ukraine, triggered by Russia’s February 2022 invasion. The two sides exchanged their visions of what a peace settlement could look like at t…",
    "link": "https://www.digitaljournal.com/world/ukraine-peace-talks-what-are-kyiv-and-moscows-positions/article",
    "timestamp": "2025-06-02T18:57:20Z"
  },
  {
    "title": "UK to build attack subs as part of defence review",
    "description": "Prime Minister Keir Starmer warned that \"the threat we now face is more serious, more immediate and more unpredictable than at any time since the Cold War,\" as he launched the review in Glasgow. \"We face war in Europe, new nuclear risks, daily cyber-attacks, …",
    "link": "https://economictimes.indiatimes.com/news/defence/uk-to-build-attack-subs-as-part-of-defence-review/articleshow/121579837.cms",
    "timestamp": "2025-06-02T18:56:56Z"
  },
  {
    "title": "More white South Africans arrive in US under new refugee program",
    "description": "The Trump administration said it is offering refugee status to white South Africans, who it alleges are being persecuted by their Black-led government and are victims of racially motivated violence.",
    "link": "https://www.wcvb.com/article/trump-refugee-program-white-south-africans/64947443",
    "timestamp": "2025-06-02T18:55:53Z"
  },
  {
    "title": "To deliver intelligence to Trump, DNI Tulsi Gabbard eyes creative solutions",
    "description": "Donald Trump doesn't like to read intelligence reports, so officials are considering new ideas — including turning briefings into Fox News-style segments.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/deliver-intelligence-trump-dni-tulsi-gabbard-eyes-creative-solutions-rcna210471",
    "timestamp": "2025-06-02T18:55:21Z"
  },
  {
    "title": "Dem senators pen stern letter urging Noem to reinstate cyber review board",
    "description": "Remember Salt Typhoon? Anyone? A group of Democratic senators has urged Homeland Security Secretary Kristi Noem to reestablish the Cyber Safety Review Board (CSRB), which had been investigating how China's Salt Typhoon hacked US government and telecommunicati…",
    "link": "https://www.theregister.com/2025/06/02/senators_to_noem_reestablish_csrb/",
    "timestamp": "2025-06-02T18:55:17Z"
  },
  {
    "title": "Shorter Republicans: 'Democrats Can't Do What WE Did! Unfair!'",
    "description": "Senate Republicans are in a tizzy because Sen. Dick Durbin of Illinois put a hold on President Donald Trump’s nomination for the U.S. attorney for the Southern District of Florida, and said he’s open to holding up Trump’s other U.S. attorney nominees. \n“[B]ec…",
    "link": "https://crooksandliars.com/2025/06/shorter-republicans-democrats-cant-do-what",
    "timestamp": "2025-06-02T18:54:46Z"
  },
  {
    "title": "More white South Africans arrive in US under new refugee program",
    "description": "The Trump administration said it is offering refugee status to white South Africans, who it alleges are being persecuted by their Black-led government and are victims of racially motivated violence.",
    "link": "https://www.wmur.com/article/trump-refugee-program-white-south-africans/64947443",
    "timestamp": "2025-06-02T18:54:17Z"
  },
  {
    "title": "Polygraphs! Purges! FBI Gets KGB Under Patel And Bongino",
    "description": "But they'll release new Epstein files any day now, you betcha!",
    "link": "https://www.wonkette.com/p/polygraphs-purges-fbi-gets-kgb-under",
    "timestamp": "2025-06-02T18:52:30Z"
  },
  {
    "title": "Israel Official Says Still No Plan for Who Controls Gaza After War",
    "description": "\"It's not for us to determine who is going to be there the day after,\" Israeli diplomat Tsach Saar told Newsweek.",
    "link": "https://www.newsweek.com/israel-official-says-no-plan-who-controls-gaza-after-war-2079965",
    "timestamp": "2025-06-02T18:51:51Z"
  },
  {
    "title": "Ukraine Risks Trump’s Wrath if it Snubs Russia’s Humanitarian Ceasefire Idea",
    "description": "Dmitry Suslov, deputy director of research at the Russian Council on Foreign & Defense Policy, breaks down the key takeaways from Monday’s Russia-Ukraine peace talks in Istanbul, including one Russian proposal he finds particularly clever.",
    "link": "https://sputnikglobe.com/20250602/ukraine-risks-trumps-wrath-if-it-snubs-russias-humanitarian-ceasefire-idea-1122178003.html",
    "timestamp": "2025-06-02T18:50:18Z"
  },
  {
    "title": "Musk's Neuralink raises $650 million in latest funding as clinical trials begin",
    "description": "Elon Musk's Neuralink said on Monday that it had raised $650 million in its latest funding round as its brain implant device enters clinical trials.\"This funding helps us bring our technology to more people — restoring independence for those with unmet medica…",
    "link": "https://www.channelnewsasia.com/business/musks-neuralink-raises-650-million-latest-funding-clinical-trials-begin-5163301",
    "timestamp": "2025-06-02T18:49:50Z"
  },
  {
    "title": "The Anti-Trump Historian Whose Instagram Is Like Xanax for Anxious Liberal Brains",
    "description": "In a culture of reactive chaos, Amanda’s Mild Takes is one of the only things keeping me sane.",
    "link": "https://slate.com/life/2025/06/donald-trump-news-instagram-account-amanda-mild-takes.html",
    "timestamp": "2025-06-02T18:49:18Z"
  },
  {
    "title": "Karol Nawrocki wins Polish presidential election with Catholic values platform",
    "description": "Karol Nawrocki, presidential candidate of the Law and Justice Party (PiS), speaks to supporters following the Polish presidential runoff election on June 1, 2025. / Credit: Marek Antoni Iwaczuk/SOPA Images/LightRocket via Getty Images\n\nCNA Staff, Jun 2, 2025 …",
    "link": "https://www.catholicnewsagency.com/news/264485/karol-nawrocki-wins-polish-presidential-election-with-catholic-values-platform",
    "timestamp": "2025-06-02T18:49:00Z"
  },
  {
    "title": "Trump just turned on the architect of his biggest first-term victories (Austin Sarat/MSNBC)",
    "description": "Austin Sarat / MSNBC:\nTrump just turned on the architect of his biggest first-term victories  —  The president attacked the Federalist Society and its co-founder Leonard Leo, a key adviser to Trump on judicial nominations during his first term.  —  Last week,…",
    "link": "https://www.memeorandum.com/250602/p95",
    "timestamp": "2025-06-02T18:45:01Z"
  },
  {
    "title": "Why the demise of Trump’s NASA pick is different from his other personnel failures",
    "description": "Jared Isaacman was just days away from becoming the new NASA administrator. So why did Donald Trump pull his own nominee?",
    "link": "https://biztoc.com/x/5fd8d0d7e7451d49",
    "timestamp": "2025-06-02T18:44:44Z"
  },
  {
    "title": "Canada Premiers Pitch Carney on New Pipelines, Ports and Mines",
    "description": "Canada’s provincial leaders urged Prime Minister Mark Carney to back new oil pipelines, electricity grids, critical mineral mines, ports and railways at a meeting on Monday meant to identify “nation-building” projects to be fast-tracked.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-premiers-pitch-carney-on-new-pipelines-ports-and-mines",
    "timestamp": "2025-06-02T18:44:29Z"
  },
  {
    "title": "Premiers pitch Mark Carney on new pipelines, ports and mines",
    "description": "Canada’s premiers urged Mark Carney to back new oil pipelines, electricity grids, critical mineral mines, ports and railways. Find out more.",
    "link": "https://financialpost.com/commodities/energy/oil-gas/premiers-pitch-mark-carney-new-pipelines-ports-mines",
    "timestamp": "2025-06-02T18:44:29Z"
  },
  {
    "title": "Piece talks! Kyiv & Moscow end negotiations in an hour",
    "description": "The warring sides met for barely an hour in the Turkish city of Istanbul, for only the second such round of negotiations since March 2022. Turkish President Tayyip Erdogan described it as a great meeting and said he hoped to bring together Russia's Vladimir P…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/piece-talks-kyiv-moscow-end-negotiations-in-an-hour/articleshow/121579535.cms",
    "timestamp": "2025-06-02T18:43:48Z"
  },
  {
    "title": "Ariana Grande, Jamie Lee Curtis, Pedro Pascal Denounce Defunding Proposal for LGBTQ Suicide Hotline: ‘We Will Not Stay Silent’",
    "description": "\"This is about people, not politics,\" the open letter signed by more than 100 Hollywood figures reads\nThe post Ariana Grande, Jamie Lee Curtis, Pedro Pascal Denounce Defunding Proposal for LGBTQ Suicide Hotline: ‘We Will Not Stay Silent’ appeared first on The…",
    "link": "https://www.thewrap.com/ariana-grande-pedro-pascal-lgbtq-suicide-prevention-defunding-open-letter/",
    "timestamp": "2025-06-02T18:43:03Z"
  },
  {
    "title": "What message does Ukraine’s Operation Spider’s Web send to Russia and US?",
    "description": "Ukraine carries out large-scale drone strikes on multiple Russian airbases.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/6/2/what-message-does-ukraines-operation-spiders-web-send-to-russia-and-us",
    "timestamp": "2025-06-02T18:41:36Z"
  },
  {
    "title": "Biden’s Health Secretary Is Taking On RFK Jr.—and, Maybe, Kamala Harris",
    "description": "Xavier Becerra, the former HHS head vying to succeed Gavin Newsom in the Golden State, tells VF that, with his experience, he matches up “better than any of the folks who are running, or thinking of running, for governor.”",
    "link": "https://www.vanityfair.com/news/xavier-becerra",
    "timestamp": "2025-06-02T18:40:38Z"
  },
  {
    "title": "Trump Administration Uses Emergency Power to Rescue Another Dying Fossil Fuel Plant",
    "description": "Consumers are set to foot the bill after the Trump administration intervened late last week to prevent the closure of the fossil fuel-powered Eddystone Generating Station, a Pennsylvania plant owned by Constellation Energy that was set to shut down its remain…",
    "link": "https://www.commondreams.org/news/trump-fossil-fuel-plants",
    "timestamp": "2025-06-02T18:38:52Z"
  },
  {
    "title": "With Jared Isaacman Out, Is NASA in Deeper Trouble?",
    "description": "The space agency is already facing severe budget cuts that could kill several missions.",
    "link": "https://gizmodo.com/with-jared-isaacman-out-is-nasa-in-deeper-trouble-2000610000",
    "timestamp": "2025-06-02T18:34:50Z"
  },
  {
    "title": "‘Habitual Lawbreakers’: ICE Rolls Up Hundreds Of Criminal Illegal Migrants In Sprawling Blue State Operation",
    "description": "Immigration and Customs Enforcement agents arrested well over 1,000 illegal migrants during a moth-long enforcement operation across sanctuary Massachusetts.",
    "link": "https://dailycaller.com/2025/06/02/ice-operation-patriot-arrests-migrants/",
    "timestamp": "2025-06-02T18:34:47Z"
  },
  {
    "title": "Colorado attack shows why ICE can’t just focus on ‘criminals’",
    "description": "On Sunday, Mohamed Sabry Soliman — an Egyptian national admitted under the Biden administration who overstayed a tourist visa — was named as a suspect in a heinous anti-Semitic attack in Boulder, Colo. His arrest shows why “border czar” Tom Homan can’t just f…",
    "link": "https://nypost.com/2025/06/02/opinion/colorado-attack-shows-why-ice-cant-just-focus-on-criminals/",
    "timestamp": "2025-06-02T18:34:23Z"
  },
  {
    "title": "'Fantasy math' masks tax bill's U.S. debt impact, GOP lawmaker said. What the deficit means for your money",
    "description": "The \"One Big Beautiful Bill Act\" would raise U.S. debt by more than $3 trillion over a decade, research finds, likely impacting consumer loans and bond prices.",
    "link": "https://www.cnbc.com/2025/06/02/what-the-national-debt-deficit-mean-for-your-money.html",
    "timestamp": "2025-06-02T18:33:37Z"
  },
  {
    "title": "What is Habeas Corpus? Why Does It Matter?",
    "description": "The Trump administration floated an idea in recent weeks: suspending habeas corpus.\nWhy? Because over and over again—including in the American Civil Liberties Union’s challenge against President Donald Trump’s illegal use of the Alien Enemies Act to deport pe…",
    "link": "https://www.aclu.org/news/immigrants-rights/what-is-habeas-corpus-why-does-it-matter",
    "timestamp": "2025-06-02T18:33:17Z"
  },
  {
    "title": "Mamdani gets key endorsement for NYC mayor in battle for Asian American votes",
    "description": "State Sen. John Liu endorsed Zohran Mamdani for mayor outside City Hall.\n \n\nThe first Asian American to hold citywide elected office endorsed Mamdani’s progressive campaign. [ more › ]",
    "link": "https://gothamist.com/news/mamdani-to-get-key-endorsement-for-nyc-mayor-in-battle-for-asian-american-votes",
    "timestamp": "2025-06-02T18:32:00Z"
  },
  {
    "title": "Kamala's 'Consolation Prize'? California Democrats Bristle at Harris's Run for Governor After Losing Presidency.",
    "description": "Democrats in Kamala Harris's home state of California have expressed frustration that the failed presidential candidate may be using the Golden State as a fallback plan—or a stepping stone toward another White House bid.\nThe post Kamala's 'Consolation Prize'?…",
    "link": "https://freebeacon.com/latest-news/kamalas-consolation-prize-california-democrats-bristle-at-harriss-run-for-governor-after-losing-presidency/",
    "timestamp": "2025-06-02T18:30:05Z"
  },
  {
    "title": "Senate Begins Putting Its Stamp on Giant Trump Tax",
    "description": "\"Significant changes are in store for President Donald Trump’s signature $3.9 trillion tax-cut bill as the Senate begins closed-door talks this week on legislation that squeaked through the House by a single vote,\" Bloomberg reports.",
    "link": "https://politicalwire.com/2025/06/02/senate-begins-putting-its-stamp-on-giant-trump-tax/",
    "timestamp": "2025-06-02T18:30:01Z"
  },
  {
    "title": "What’s Next for Tough-Talking Tim Walz?",
    "description": "Former Democrat vice presidential candidate Tim Walz is talking tough, even while remaining mum on his own political future. The Minnesota governor, whose second term... Read More\nThe post What’s Next for Tough-Talking Tim Walz? appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/06/02/whats-next-tough-talking-tim-walz/",
    "timestamp": "2025-06-02T18:30:00Z"
  },
  {
    "title": "Trump-appointed judge hands president a loss — but also a win",
    "description": "A California judge appointed by President Donald Trump ruled on Monday to block the administration from deporting a Venezuelan national under the Alien Enemies Act (AEA) — but not for the reason other judges have ruled in the past. Politico legal reporter Kyl…",
    "link": "https://www.rawstory.com/trump-alien-enemies-act/",
    "timestamp": "2025-06-02T18:29:49Z"
  },
  {
    "title": "Why the demise of Trump’s NASA pick is different from his other personnel failures",
    "description": "Jared Isaacman was just days away from becoming the new NASA administrator. So why did Donald Trump pull his own nominee?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/demise-trumps-nasa-pick-different-personnel-failures-rcna210461",
    "timestamp": "2025-06-02T18:29:46Z"
  },
  {
    "title": "Elon Musk reportedly stalls on final $100 million payment to Donald Trump amid reports of widening rift",
    "description": "Elon Musk reportedly owes Donald Trump a massive $100 million, sparking questions about a major fallout between the billionaire CEO and the president. Once close allies, their relationship is now strained over money, power, and policy clashes. Reports from Th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-reportedly-stalls-on-final-100-million-payment-to-donald-trump-amid-reports-of-widening-rift/articleshow/121578348.cms",
    "timestamp": "2025-06-02T18:29:10Z"
  },
  {
    "title": "Ten nukes? And a June 15 'go' date?",
    "description": "On May 31, The Frank reported that Iran has a stockpile of 408.6 kilograms of 60%-enriched uranium—enough for roughly 10 nuclear weapons. U.S. officials say it could take Iran less than two weeks to convert this highly enriched uranium into enough weapons-gra…",
    "link": "https://freerepublic.com/focus/f-news/4320568/posts",
    "timestamp": "2025-06-02T18:27:15Z"
  },
  {
    "title": "Even if Putin and Zelenskyy do go face-to-face, don’t expect wonders − their one meeting in 2019 ended in failure",
    "description": "A second round of talks between Russia and Ukraine took place on June 2. Again both leaders were not present.",
    "link": "https://theconversation.com/even-if-putin-and-zelenskyy-do-go-face-to-face-dont-expect-wonders-their-one-meeting-in-2019-ended-in-failure-257093",
    "timestamp": "2025-06-02T18:25:23Z"
  },
  {
    "title": "Meet Josh Divine, the Trump Judicial Nominee Who Argued Christians Are \"Obligated Ethically to Impose Their Beliefs On Others\" (Jay Willis/Balls and Strikes)",
    "description": "Jay Willis / Balls and Strikes:\nMeet Josh Divine, the Trump Judicial Nominee Who Argued Christians Are “Obligated Ethically to Impose Their Beliefs On Others”  —  The highlights of the résumé of Josh Divine, President Donald Trump's nominee to a federal distr…",
    "link": "https://www.memeorandum.com/250602/p89",
    "timestamp": "2025-06-02T18:25:00Z"
  },
  {
    "title": "Trump Shared His Thoughts On Pardoning Diddy And It's Exactly What You'd Expect Him To Say",
    "description": "President Trump resisted giving a definitive answer on whether or not he would pardon Combs.",
    "link": "https://www.buzzfeed.com/marcomargaritoff/donald-trump-sean-diddy-combs-pardon",
    "timestamp": "2025-06-02T18:24:09Z"
  },
  {
    "title": "WATCH: Jake Tapper says the quiet part out loud about media’s incestuous ties to Democrat Party",
    "description": "'I think there's probably a lot of intimidation'",
    "link": "https://www.wnd.com/2025/06/watch-jake-tapper-says-the-quiet-part-out-loud-about-medias-incestuous-ties-to-democrat-party/",
    "timestamp": "2025-06-02T18:22:36Z"
  },
  {
    "title": "WH: Trump open to meeting Putin and Zelensky",
    "description": "White House Press Secretary Karoline Leavitt told the press on Monday that President Donald Trump is \"open\" to the idea of having a meeting with his Russian and Ukrainian counterparts, Vladimir Putin ...",
    "link": "https://biztoc.com/x/e99167033a199b19",
    "timestamp": "2025-06-02T18:21:55Z"
  },
  {
    "title": "Trump Blames Colorado Arson Attack On Biden Immigration Policies",
    "description": "Other GOP leaders took a similar position, with top adviser Stephen Miller calling it an example of “suicidal migration.”",
    "link": "https://www.huffpost.com/entry/trump-boulder-colorado-attack-immigration-policy_n_683dd2e0e4b08b77a460ebec",
    "timestamp": "2025-06-02T18:20:47Z"
  },
  {
    "title": "I’d rather be called a dictator than have people murdered in the streets, says El Salvador’s Bukele",
    "description": "Bukele's war on gangs has led to a drop in the homicide rate to its lowest level in 30 years\nThe post I’d rather be called a dictator than have people murdered in the streets, says El Salvador’s Bukele appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/02/id-rather-be-called-a-dictator-than-have-people-murdered-in-the-streets-says-el-salvadors-bukele/",
    "timestamp": "2025-06-02T18:18:00Z"
  },
  {
    "title": "Major Corporations — Including Oracle, McDonald’s, and Morgan Stanley — Are Dumping Law Firms That Caved to Trump",
    "description": "The law firms that caved to President Donald Trump's demands are losing major clients as a direct result of their appeasement, according to a report by The Wall Street Journal.\nThe post Major Corporations — Including Oracle, McDonald’s, and Morgan Stanley — A…",
    "link": "https://www.mediaite.com/politics/trump/major-corporations-including-oracle-mcdonalds-and-morgan-stanley-are-dumping-law-firms-that-caved-to-trump/",
    "timestamp": "2025-06-02T18:15:13Z"
  },
  {
    "title": "Elon Musk Is Realizing He Made a Huge Mistake",
    "description": "Tesla has been put through the ringer in its CEO Elon Musk's absence. The EV maker saw earnings plummet in the first quarter of this year, with net income cratering an astonishing 71 percent since the first quarter of last year. Musk's highly problematic embr…",
    "link": "https://futurism.com/elon-musk-mistake-tesla-tax-credits",
    "timestamp": "2025-06-02T18:12:45Z"
  },
  {
    "title": "Is the chump we see the real Trump?",
    "description": "Donald Trump's recent outlandish claim about Joe Biden being a robotic clone has sparked a counter-theory. The article humorously suggests that the current Trump might be an AI replica, a 'GenAI DeepFink' version, whose erratic behavior is due to a bug in the…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/is-the-chump-we-see-the-real-trump/articleshow/121578587.cms",
    "timestamp": "2025-06-02T18:12:00Z"
  },
  {
    "title": "The Widening Gyre",
    "description": "“The Caliphate looms; it is inevitable, and the road to its gates is paved with the skulls of English children.” —Peachy Keenan Do you hear those alarm bells ringing? Looks like June is bustin’ out all over, as the old Broadway ditty goes. Bedlam is in the ai…",
    "link": "https://freerepublic.com/focus/f-news/4320564/posts",
    "timestamp": "2025-06-02T18:10:42Z"
  },
  {
    "title": "Pro-Trump Nationalist Wins Poland's Presidential Election",
    "description": "Karol Nawrocki, a historian-turned-politician and nationalist, has won the presidential election in Poland, beating his government-backed rival. As head of state, Nawrocki can undermine Prime Minister Donald Tusk by vetoing key legislation, and has promised t…",
    "link": "https://biztoc.com/x/422c72875f757ca5",
    "timestamp": "2025-06-02T18:10:39Z"
  },
  {
    "title": "Facing 'Dangerous Attacks on Care' From GOP, At Least 20 Planned Parenthood Clinics Close",
    "description": "On the heels of Planned Parenthood announcing clinic closures in the Midwest last month, The Guardian published a Monday analysis showing that the reproductive healthcare provider has closed or disclosed plans to shutter at least 20 locations across seven sta…",
    "link": "https://www.commondreams.org/news/planned-parenthood-closures",
    "timestamp": "2025-06-02T18:10:24Z"
  },
  {
    "title": "ICE arrested nearly 1,500 illegal aliens in Massachusetts last month",
    "description": "Federal immigration authorities announced the arrest of nearly 1,500 people living in Massachusetts illegally but offered few details about those who are now in custody after a monthlong “enforcement operation.”",
    "link": "https://www.bostonherald.com/2025/06/02/ice-arrested-nearly-1500-illegal-aliens-in-massachusetts-last-month/",
    "timestamp": "2025-06-02T18:10:12Z"
  },
  {
    "title": "Trump blames Biden 'open border' policy for Colorado attack",
    "description": "US President says firebomb attack on demonstration in solidarity in history by a terrorist who is in the US illegally demonstrates the need for a secure border.",
    "link": "https://www.israelnationalnews.com/news/409335",
    "timestamp": "2025-06-02T18:10:00Z"
  },
  {
    "title": "Trump’s Hip-Hop Hall Passes - Every Rapper Who Got a Pardoned",
    "description": "Trump to the rescue. Continue reading…",
    "link": "https://www.xxlmag.com/rappers-pardoned-president-donald-trump/",
    "timestamp": "2025-06-02T18:08:12Z"
  },
  {
    "title": "The conservative legal movement and Trump’s tariffs",
    "description": "A group of conservative scholars and lawyers — some anti-Trump libertarians, but some more MAGA-comfortable — have filed a brief arguing against the legality of Trump’s tariffs [gift link]: A powerful sign that President Trump’s tariff-driven trade war is at …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/the-conservative-legal-movement-and-trumps-tariffs",
    "timestamp": "2025-06-02T18:07:44Z"
  },
  {
    "title": "[U.S. Ambassador to Israel Mike] Huckabee slams French push for Palestinian state: ‘Carve it out of the French Riviera’",
    "description": "US Ambassador to Israel Mike Huckabee dismissed France’s potential upcoming recognition of a Palestinian state, calling the move “revolting” while Israel fights Hamas in the Gaza Strip. “It’s incredibly inappropriate in the midst of a war that Israel is deali…",
    "link": "https://freerepublic.com/focus/f-news/4320563/posts",
    "timestamp": "2025-06-02T18:07:07Z"
  },
  {
    "title": "'India, US to resolve all issues bilaterally': Piyush Goyal",
    "description": "India and the US will address trade issues, including increased US tariffs on steel and aluminium. Both nations aim for a bilateral trade agreement, targeting $500 billion in trade by 2030. US officials will visit India for trade discussions. An interim deal …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-to-resolve-all-issues-bilaterally-piyush-goyal/articleshow/121578529.cms",
    "timestamp": "2025-06-02T18:06:58Z"
  },
  {
    "title": "‘How Is It Possible!?’ CNN’s Harry Enten Completely Floored by Slew of Horrible Polls for Democrats",
    "description": "CNN chief data analyst Harry Enten marveled at Democrats' dismal polling during a Monday morning segment with anchor Kate Bolduan.\nThe post ‘How Is It Possible!?’ CNN’s Harry Enten Completely Floored by Slew of Horrible Polls for Democrats first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/how-is-it-possible-cnns-harry-enten-completely-floored-by-slew-of-horrible-polls-for-democrats/",
    "timestamp": "2025-06-02T18:04:39Z"
  },
  {
    "title": "China says U.S. violating tariffs truce with moves on AI chips and student visas",
    "description": "China has blasted the U.S. for issuing AI chip export control guidelines, stopping the sale of chip design software to China, and planning to revoke Chinese student visas.",
    "link": "https://www.pbs.org/newshour/world/china-says-u-s-violating-tariffs-truce-with-moves-on-ai-chips-and-student-visas",
    "timestamp": "2025-06-02T18:04:19Z"
  },
  {
    "title": "Republicans Big Mad At Elon Musk For Telling The Truth About The Big Beautiful Bill",
    "description": "There's a big, obvious imbalance between taxes and spending cuts in the \"One Big Beautiful Bill Act,\" and Republicans are pretending it doesn't exist.",
    "link": "https://www.huffpost.com/entry/elon-musk-big-beautiful-bill_n_683ddcdde4b08b77a460f49e",
    "timestamp": "2025-06-02T18:04:14Z"
  },
  {
    "title": "Election of Trump Ally in Poland Could Alter EU, Ukraine Policies",
    "description": "Poland has elected Karol Nawrocki, a conservative historian and staunch nationalist, as its next president in a closely watched vote that signals a resurgence of right-wing populism in the heart of Europe. Nawrocki, who is set to take office on Aug. 6, is exp…",
    "link": "https://freerepublic.com/focus/f-news/4320561/posts",
    "timestamp": "2025-06-02T18:03:50Z"
  },
  {
    "title": "What Is Ukraine’s Operation Spiderweb?",
    "description": "Ukraine coordinated a massive drone assault targeting Russian bombers and infrastructure on Russian soil, crippling 34 percent of its strategic fleet and exposing vulnerabilities in Moscow’s military defense.\nThe post What Is Ukraine’s Operation Spiderweb? ap…",
    "link": "https://nationalinterest.org/blog/buzz/what-is-ukraines-operation-spiderweb",
    "timestamp": "2025-06-02T18:02:41Z"
  }
]