[
  {
    "title": "‘What they’re doing is illegal’: Kristi Noem says CNN could be prosecuted for ‘encouraging people to avoid law enforcement’",
    "description": "'We're working with the Department of Justice to see if we can prosecute them for that'",
    "link": "https://www.wnd.com/2025/07/what-theyre-doing-is-illegal-kristi-noem-says/",
    "timestamp": "2025-07-01T20:14:05Z"
  },
  {
    "title": "Connecticut governor approves law prohibiting crypto use in government",
    "description": "Connecticut Governor Ned Lamont signed House Bill 7082 into law on Monday, setting the stage for the state government to ban many uses of cryptocurrency.",
    "link": "https://cointelegraph.com/news/connecticut-governor-signs-bill-law-prohibiting-crypto-government",
    "timestamp": "2025-07-01T20:13:28Z"
  },
  {
    "title": "Trump Launches America’s First Concentration Camp, Complete With Tacky Merch",
    "description": "Not content with just shipping people to a foreign concentration camp, Donald Trump now has his own, homegrown concentration camp in Florida. Trump, DHS Secretary Kristi Noem, and Florida Governor Ron DeSantis gleefully toured the hastily constructed concentr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178246914",
    "timestamp": "2025-07-01T20:13:17Z"
  },
  {
    "title": "Trump Nominates Prosecutor Who Arrested Sanctuary City Mayor After Migrant Detention Mayhem",
    "description": "Trump aims to keep Alina Habba, a prosecutor who arrested a sanctuary city mayor and charged another Democrat for an incident at a migrant detention center.",
    "link": "https://dailycaller.com/2025/07/01/trump-nominates-prosecutor-alina-habba/",
    "timestamp": "2025-07-01T20:12:28Z"
  },
  {
    "title": "Oil Gains as Mideast Tensions Reignite",
    "description": "Oil rose slightly as Middle East tensions resurfaced, keeping traders cautious.",
    "link": "https://www.rigzone.com/news/wire/oil_gains_as_mideast_tensions_reignite-01-jul-2025-181009-article/",
    "timestamp": "2025-07-01T20:11:56Z"
  },
  {
    "title": "Consumer Financial Protection Bureau dismisses $95M overdraft case vs. Navy Federal Credit Union",
    "description": "Navy Federal Credit Union will no longer have to refund $80 million to servicemen and women for illegally charging them overdraft fees on their accounts...",
    "link": "https://finance.yahoo.com/news/consumer-financial-protection-bureau-dismisses-201127488.html",
    "timestamp": "2025-07-01T20:11:27Z"
  },
  {
    "title": "South Africa Pays Homage to Ayatollah; Signs Iran's 'Condolence Book'",
    "description": "South Africa's foreign affairs ministry posted a photograph of a senior official with a portrait of Ayatollah Ali Khameni, the so-called \"Supreme Leader\" of Iran, a she signed a \"condolence book\" for Iran in Pretoria.\nThe post South Africa Pays Homage to Ayat…",
    "link": "https://www.breitbart.com/africa/2025/07/01/south-africa-pays-homage-to-ayatollah-signs-irans-condolence-book/",
    "timestamp": "2025-07-01T20:11:22Z"
  },
  {
    "title": "The Senate just passed Trump’s ‘Big Beautiful Bill’ that includes $4.5 trillion in tax cuts. Here’s what else is inside",
    "description": "Three Republican senators joined all Democrats in voting against it.",
    "link": "https://fortune.com/2025/07/01/trump-budget-bill-gop-tax-break-spending-cuts/",
    "timestamp": "2025-07-01T20:10:49Z"
  },
  {
    "title": "Hey Canadian NDP, Just Say No to NATO and More Military Spending",
    "description": "Reprinted from Yves Engler’s website. Donald Trump and NATO have unleashed a spectacular turn towards dangerous, imperialistic and inevitably wasteful militarism in Canada. Two weeks ago, Mark Carney announced an immediate $9 billion boost — $100 billion over…",
    "link": "https://www.antiwar.com/blog/2025/07/01/hey-canadian-ndp-just-say-no-to-nato-and-more-military-spending/",
    "timestamp": "2025-07-01T20:09:59Z"
  },
  {
    "title": "Trump Dismisses Extending Tariff Talks as July 9 Deadline Nears",
    "description": "President Donald Trump said he is not considering delaying his July 9 deadline for higher tariffs to resume and renewed his threat to cut off talks and impose duty rates on several nations, including Japan.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-dismisses-extending-tariff-talks-as-july-9-deadline-nears",
    "timestamp": "2025-07-01T20:08:07Z"
  },
  {
    "title": "Trump Media Takes Streaming Global As President Slashes Voice Of America",
    "description": "Trump’s media company is testing an international launch of its Truth+ streaming platform, raising questions over conflicts of interest as the administration cuts funding to America’s biggest global broadcaster.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/07/01/trump-media-truth-global-streaming-voice-of-america-cuts/",
    "timestamp": "2025-07-01T20:07:37Z"
  },
  {
    "title": "US closes mostly lower after megabill passes Senate",
    "description": "Wall Street stock equities traded mostly with losses at the closing bell on Tuesday after the United States Senate narrowly passed the spending bill endorsed by President Donald Trump. Meanwhile, Fede...",
    "link": "https://biztoc.com/x/48ad42566034ed1c",
    "timestamp": "2025-07-01T20:06:51Z"
  },
  {
    "title": "Trump Launches America’s First Concentration Camp, Complete With Tacky Merch",
    "description": "Not content with just shipping people to a foreign concentration camp, Donald Trump now has his own, homegrown concentration camp in Florida. Trump, DHS Secretary Kristi Noem, and Florida Governor Ron DeSantis gleefully toured the hastily constructed concentr…",
    "link": "https://www.techdirt.com/2025/07/01/trump-launches-americas-first-concentration-camp-complete-with-tacky-merch/",
    "timestamp": "2025-07-01T20:06:47Z"
  },
  {
    "title": "Dow soars almost 400 points as investors rotate out of tech and eye Europe",
    "description": "Investors in the U.S. continued the recent trend of shifting their portfolios to favor European stocks, as the dollar weakens and the euro rises.",
    "link": "https://fortune.com/2025/07/01/dow-soars-almost-400-points-as-investors-rotate-out-of-tech-and-eye-europe/",
    "timestamp": "2025-07-01T20:06:44Z"
  },
  {
    "title": "Lawsuit challenges Trump’s school mental health funding cuts",
    "description": "Democratic AGs are challenging the Trump administration’s cuts to $1 billion in federal funding for school mental health services created in response to school shootings.",
    "link": "https://www.chalkbeat.org/newyork/2025/07/01/trump-administration-school-mental-health-cuts-challenge-in-ags-lawsuit/",
    "timestamp": "2025-07-01T20:06:12Z"
  },
  {
    "title": "Trump OKs using National Guard as immigration judges at Florida detention center (Miami Herald)",
    "description": "Miami Herald:\nTrump OKs using National Guard as immigration judges at Florida detention center  —  President Donald Trump said Tuesday he would approve Florida's plan to expedite deportations by having qualified National Guard members work as immigration judg…",
    "link": "https://www.memeorandum.com/250701/p108",
    "timestamp": "2025-07-01T20:05:00Z"
  },
  {
    "title": "Trump Praises Adams, Threatens to Arrest Mamdani",
    "description": "At a press conference, Donald Trump called Eric Adams a ‘very good person’ and threatened to arrest Zohran Mamdani if he refuses to cooperate with ICE as mayor.",
    "link": "http://nymag.com/intelligencer/article/trump-praises-adams-threatens-to-arrest-mamdani.html",
    "timestamp": "2025-07-01T20:04:46Z"
  },
  {
    "title": "The GOP’s big spending bill could kill renewable energy projects",
    "description": "Senate Republicans today passed a sweeping spending bill that narrowly avoided punitive tax measures on renewable energy but still threatens to stall its growth in the US.  After wrangling over hundreds of amendments for more than 24 hours in a so-called “vot…",
    "link": "https://www.theverge.com/news/696047/senate-republican-spending-bill-passage-renewable-wind-solar-energy",
    "timestamp": "2025-07-01T20:03:51Z"
  },
  {
    "title": "Atomic Energy Chief: Iran’s Enriched Uranium May Have Moved",
    "description": "Rafael Grossi, the head of the International Atomic Energy Agency (IAEA), has said that he doesn't know where Iran's enriched uranium is located currently. It could have been under attack during the 12-day war, or moved prior to United States strikes on its n…",
    "link": "https://www.shtfplan.com/headline-news/atomic-energy-chief-irans-enriched-uranium-may-have-moved",
    "timestamp": "2025-07-01T20:00:51Z"
  },
  {
    "title": "What's Next? Elon Musk Hints at 'Escalating' Brutal Feud With Trump After President Threatens to 'Deport' Billionaire",
    "description": "Elon Musk has made it clear he has the power to take his feud to Donald Trump to the next level after the president 'threatned' to deport the billionaire.",
    "link": "https://radaronline.com/p/elon-musk-escalating-feud-trump-deport-spending-bill/",
    "timestamp": "2025-07-01T20:00:00Z"
  },
  {
    "title": "What In The World Just Happened In The Middle East?",
    "description": "Can anyone explain to me what just happened?  The last 24 hours have been beyond weird.  Just hours ago, everyone was freaking out because Iran had just fired a bunch of missiles at a major U.S. military base in Qatar.  But then we found out that most of the …",
    "link": "https://www.activistpost.com/what-in-the-world-just-happened-in-the-middle-east/",
    "timestamp": "2025-07-01T20:00:00Z"
  },
  {
    "title": "Elon Musk Responds to Donald Trump Threatening Deportation",
    "description": "Elon Musk and Donald Trump are continuing to butt heads on social media. The 54-year-old former DOGE employee and ally to Trump began to turn against the 78-year-old President because of disagreements over the “Big Beautiful Bill.” Since then, the back-and-fo…",
    "link": "https://www.justjared.com/2025/07/01/elon-musk-responds-to-donald-trump-threatening-deportation/",
    "timestamp": "2025-07-01T19:59:57Z"
  },
  {
    "title": "Todd Chrisley: I Nearly Beat the $hit Out of a Prison Inmate!",
    "description": "Reading Time: 3 minutesTodd Chrisley claims he threatened to beat up an inmate who talked trash about his daughter, Savannah. What a tough guy!\nTodd Chrisley: I Nearly Beat the $hit Out of a Prison Inmate! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/07/todd-chrisley-i-nearly-beat-the-hit-out-of-a-prison-inmate/",
    "timestamp": "2025-07-01T19:58:16Z"
  },
  {
    "title": "Medicaid cuts in Trump's 'big beautiful' bill will leave millions uninsured, threaten rural hospitals",
    "description": "The bill would cut $1.1 trillion in health-care spending and result in 11.8 million people losing health coverage over the next decade, according to estimates.",
    "link": "https://www.cnbc.com/2025/07/01/how-trump-bill-medicaid-cuts-will-impact-us-health-care.html",
    "timestamp": "2025-07-01T19:57:47Z"
  },
  {
    "title": "Netanyahu At Crossroads On Gaza Ahead Of White House Meeting",
    "description": "As Israeli Prime Minister Benjamin Netanyahu prepares for his third White House visit this year, President Donald Trump has made clear he expects a Gaza ceasefire “next week.” \nWhile U.S. and Israeli leaders celebrate their strikes on Iran, Netanyahu faces gr…",
    "link": "https://biztoc.com/x/49e6a5a7edd31321",
    "timestamp": "2025-07-01T19:55:50Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Sudan, the Secretary-General’s Personal Envoy for the country is intensifying his good offices efforts to support the de-escalation of the conflict and advance a political solution. He continues to underscore the criticality of scaled-up and more unified d…",
    "link": "https://press.un.org/en/2025/db250701.doc.htm",
    "timestamp": "2025-07-01T19:55:49Z"
  },
  {
    "title": "Early reviewers say Trump's fragrance line doesn't pass the smell test",
    "description": "President Donald Trump has been promoting his Trump-branded merchandise since the moment he came down the golden escalator at Trump Tower. However, his fragrance isn't getting good reviews. Victory 47 for Men pitches itself as having “rich, masculine notes wi…",
    "link": "https://www.rawstory.com/trump-fragrance-2672523955/",
    "timestamp": "2025-07-01T19:55:48Z"
  },
  {
    "title": "At least 17 million Americans would lose insurance under Trump plan (Yasmeen Abutaleb/Washington Post)",
    "description": "Yasmeen Abutaleb / Washington Post:\nAt least 17 million Americans would lose insurance under Trump plan  —  GOP legislation would set back years of progress in expanding health care coverage, unwinding key parts of the Affordable Care Act.  —  The Senate vers…",
    "link": "https://www.memeorandum.com/250701/p106",
    "timestamp": "2025-07-01T19:55:00Z"
  },
  {
    "title": "Republicans now own America’s broken health care system",
    "description": "Senate Republicans have passed President Donald Trump’s “big, beautiful bill,” a move that will make major changes to Medicaid through establishing a work requirement for the first time and restricting states’ ability to finance their share of the program’s c…",
    "link": "https://www.vox.com/health-care/418431/big-beautiful-bill-lose-medicaid-trump",
    "timestamp": "2025-07-01T19:51:43Z"
  },
  {
    "title": "What Is Happening With Bachelor’s Grant Ellis and His Exes? Us Explains",
    "description": "Cameras have been down on Grant Ellis’ season 29 of The Bachelor for months, but the drama hasn’t stopped. Less than three months after the finale aired, Grant, 31, shared that he and Juliana Pasquarosa had called it quits, noting they “both gave this our bes…",
    "link": "https://www.usmagazine.com/celebrity-news/news/what-is-happening-with-bachelors-grant-ellis-and-his-exes-us-explains/#article",
    "timestamp": "2025-07-01T19:51:34Z"
  },
  {
    "title": "DCCC blasts GOP lawmakers for hiking health care costs with 'One Big Beautiful Bill' vote",
    "description": "'Cory Mills, María Elvira Salazar, and Anna Paulina Luna are desperately failing to uphold their campaign promises.'",
    "link": "https://floridapolitics.com/archives/745785-dccc-blasts-gop-lawmakers-for-hiking-health-care-costs-with-one-big-beautiful-bill-vote/",
    "timestamp": "2025-07-01T19:50:29Z"
  },
  {
    "title": "‘One Big Beautiful Bill’ Could Shutter Hundreds Of Planned Parenthood Clinics",
    "description": "Planned Parenthood could be forced to shutter hundreds of its clinics if the Republicans’ One Big Beautiful Bill is signed into law.",
    "link": "https://dailycaller.com/2025/07/01/one-big-beautiful-bill-could-shutter-hundreds-planned-parenthood-clinics/",
    "timestamp": "2025-07-01T19:49:00Z"
  },
  {
    "title": "Trump Wants to Deputize National Guard as Immigration Judges — And Build More ‘Alligator Alcatraz’ Facilities in Florida",
    "description": "During a trip to the migrant detention facility dubbed \"Alligator Alcatraz\" in the Florida Everglades, President Donald Trump declared Gov. Ron DeSantis had his approval to deputize National Guard members as immigration judges to speed up deportations.\nThe po…",
    "link": "https://www.mediaite.com/politics/trump/trump-wants-to-deputize-national-guard-as-immigration-judges-and-build-more-alligator-alcatraz-facilities-in-florida/",
    "timestamp": "2025-07-01T19:48:47Z"
  },
  {
    "title": "Kristi Noem Spreads Bizarre, Unsubstantiated Story About Detaining A Cannibal",
    "description": "The Homeland Security chief's unverified anecdote is the latest attempt to dehumanize immigrants and justify federal agents rounding them up.",
    "link": "https://www.huffpost.com/entry/kristi-noem-bizarre-story-detaining-cannibal_n_68643148e4b06a831253e0b2",
    "timestamp": "2025-07-01T19:48:21Z"
  },
  {
    "title": "Trump threatens to arrest NYC mayoral front-runner if he defies ICE operations",
    "description": "As he departed the White House earlier Tuesday, Trump continued to attack Mamdani, calling him a \"total nut job\" and \"bad news.\"",
    "link": "https://abcnews.go.com/Politics/trump-threatens-arrest-mamdani-nyc-ice/story?id=123382676",
    "timestamp": "2025-07-01T19:47:19Z"
  },
  {
    "title": "Appeals court rules Alabama violated constitutional rights of man sentenced to death",
    "description": "A federal appeals court has ruled Alabama prosecutors violated the constitutional rights of a man sentenced to death in 1990",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-rules-alabama-violated-constitutional-rights-man-123386408",
    "timestamp": "2025-07-01T19:46:53Z"
  },
  {
    "title": "Trump Freezes Cash Flows to Cuba's Most Lucrative Regime-Run Companies",
    "description": "President Donald Trump on Monday signed a National Security Presidential Memorandum (NSPM) implementing a tougher U.S. policy against Cuba's communist regime and reversing concessions granted by former U.S. President Joe Biden.\nThe post Trump Freezes Cash Flo…",
    "link": "https://www.breitbart.com/latin-america/2025/07/01/trump-freezes-cash-flows-to-cubas-most-lucrative-regime-run-companies/",
    "timestamp": "2025-07-01T19:46:17Z"
  },
  {
    "title": "VIDEO: Southern California Cities Cancel 4th of July Events Due to ICE Raids",
    "description": "Fourth of July celebrations are being cancelled or postponed in cities across Southern California due to Immigration and Customs Enforcement's (ICE) crackdown on illegal immigration.\nThe post VIDEO: Southern California Cities Cancel 4th of July Events Due to …",
    "link": "https://www.breitbart.com/crime/2025/07/01/video-southern-california-cities-cancel-4th-of-july-events-due-to-ice-raids/",
    "timestamp": "2025-07-01T19:46:15Z"
  },
  {
    "title": "Figma files for NYSE debut as tech IPO market gains steam",
    "description": "Figma filed its IPO prospectus on Tuesday, as the design software vendor looks to raise money and awareness to take on Adobe.",
    "link": "https://www.cnbc.com/2025/07/01/figma-fig-files-for-ipo-as-tech-debuts-gain-steam.html",
    "timestamp": "2025-07-01T19:46:08Z"
  },
  {
    "title": "Charlie Kirk Says Trump-DeSantis Reconciliation Gives Him Hope About Elon Musk",
    "description": "Charlie Kirk said that Donald Trump's reconciliation with Ron DeSantis is \"evidence\" that he will eventually mend his relationship with Elon Musk.",
    "link": "https://dailycaller.com/2025/07/01/charlie-kirk-trump-desantis-reconciliation-gives-hope-elon-musk/",
    "timestamp": "2025-07-01T19:46:04Z"
  },
  {
    "title": "What's Going On With Tesla Shares Today?",
    "description": "Tesla Inc. (NASDAQ:TSLA) shares are trading lower Tuesday amid disagreements between CEO Elon Musk and President Donald Trump. Additionally, Tesla registrations in Sweden and Denmark fell during June.\nWhat To Know: The drop in Tesla shares follows Musk's voca…",
    "link": "https://biztoc.com/x/25986383acd8222d",
    "timestamp": "2025-07-01T19:44:47Z"
  },
  {
    "title": "Schumer Forces Name Change Of ‘Big Beautiful Bill’ Before Senate Vote",
    "description": "Moments before the Senate passed President Donald Trump’s sweeping tax and spending package, Senate Minority Leader Chuck Schumer succeeded in stripping the bill of its Trump-given title, “One Big Beautiful Bill.” \nSchumer argued the title violated the Byrd R…",
    "link": "https://biztoc.com/x/1305299723e79d27",
    "timestamp": "2025-07-01T19:44:42Z"
  },
  {
    "title": "Mayors, doctor groups sue over Trump’s efforts to restrict Obamacare enrollment",
    "description": "New Trump administration rules give millions of people a shorter timeframe to sign up for the Affordable Care Act’s health care coverage.",
    "link": "https://www.bostonherald.com/2025/07/01/obamacare-lawsuit/",
    "timestamp": "2025-07-01T19:44:41Z"
  },
  {
    "title": "Trump Suggests He’s Open to Deporting Musk as Musk Threatens Some Kind of TBD Nuclear Option",
    "description": "The president and the former first buddy are fighting again.",
    "link": "https://www.vanityfair.com/news/story/trump-suggests-hes-open-to-deporting-musk-as-musk-threatens-some-kind-of-tbd-nuclear-option",
    "timestamp": "2025-07-01T19:44:36Z"
  },
  {
    "title": "Senate passes Trump tax cut & spending bill",
    "description": "Vice President JD Vance had to break a 50-50 tie in the Senate in order for the bill to pass, after three Republicans joined with Democrats to vote against it. We look at what's in the bill, and what still has to happen for it to become law. \nThis episode: Wh…",
    "link": "https://www.npr.org/2025/07/01/1255040239/podcast-trump-tax-cut-spending-bill",
    "timestamp": "2025-07-01T19:44:05Z"
  },
  {
    "title": "Ford sales jump 14% in the second quarter, well above industry forecast",
    "description": "Ford sales rose 14.2% during the second quarter over the year-earlier period, about 10 times the estimated 1.4% industry increase, the automaker said Tuesday",
    "link": "https://www.nbcnews.com/business/autos/ford-sales-jump-14-second-quarter-well-industry-forecast-rcna216317",
    "timestamp": "2025-07-01T19:42:57Z"
  },
  {
    "title": "Murkowski Says Trump’s Budget Sucks Immediately After Voting for It",
    "description": "Republican Senator Lisa Murkowski of Alaska on Tuesday supplied the deciding vote for Senate Republicans to pass Trump’s signature budget bill. After doing so, she registered concerns about the disastrous piece of legislation, even while defending her vote.\r\n…",
    "link": "https://newrepublic.com/post/197490/lisa-murkowski-trump-budget-sucks-vote-defense",
    "timestamp": "2025-07-01T19:42:30Z"
  },
  {
    "title": "Trump tours cages at new immigrant detention camp in Florida Everglades",
    "description": "The establishment of the camp has been condemned as inhumane by Trump’s opponents.",
    "link": "https://www.thejournal.ie/trump-tours-cages-at-new-florida-detention-camp-for-people-arrested-in-anti-immigration-raids-6749549-Jul2025/",
    "timestamp": "2025-07-01T19:40:45Z"
  },
  {
    "title": "Some National Guard troops from Trump’s illiberal publicity stunt in L.A. are being reassigned",
    "description": "The Trump administration is reassigning some of the National Guard troops deployed to Los Angeles as part of an authoritarian publicity stunt so they can instead address a real crisis — rather than the fake crisis of unrest that Trump has tried to fabricate.",
    "link": "https://www.msnbc.com/top-stories/latest/los-angeles-national-guard-firefighting-wildfires-ice-raids-rcna216280",
    "timestamp": "2025-07-01T19:40:29Z"
  },
  {
    "title": "Gavin Newsom Copies Trump, on Wildfires: 'Make America Rake Again'",
    "description": "California Gov. Gavin Newsom is trying to reverse years of failure on wildfires by copying President Donald Trump's proposal to \"rake the forests,\" announcing a new approach Tuesday: \"Make America Rake Again.\"\nThe post Gavin Newsom Copies Trump, on Wildfires:…",
    "link": "https://www.breitbart.com/environment/2025/07/01/gavin-newsom-copies-trump-on-wildfires-make-america-rake-again/",
    "timestamp": "2025-07-01T19:39:39Z"
  },
  {
    "title": "It all came down to Murkowski: Inside the vote on Trump's megabill",
    "description": "It was a matter of who would be the third \"no\" vote Republicans could lose and still pass the \"big, beautiful bill.\" It came down to Susan Collins and Lisa Murkowski.",
    "link": "https://abcnews.go.com/Politics/inside-final-passage-trumps-big-beautiful-bill/story?id=123382846",
    "timestamp": "2025-07-01T19:39:20Z"
  },
  {
    "title": "LOFTUS: Democrats Can’t Even Touch Popular Trump Policy With A Ten-Foot Pole",
    "description": "With the opening of \"Alligator Alcatraz,\" Democrats ought to navigate the murky waters of immigration debates very carefully.",
    "link": "https://dailycaller.com/2025/07/01/democrats-immigration-donald-trump-alligator-alcatraz-florida-criminals/",
    "timestamp": "2025-07-01T19:39:05Z"
  },
  {
    "title": "Trump's ‘Big, Beautiful Bill’ Is An Assault On American Life",
    "description": "It makes the rich get richer, kicks down the poorest, helps ICE detain Americans, kills clean energy jobs and throws grandma out of her nursing home. ",
    "link": "https://www.huffpost.com/entry/trump-big-beautiful-bill-assault-american-life_n_6862b5bfe4b02e5da20654fc",
    "timestamp": "2025-07-01T19:38:58Z"
  },
  {
    "title": "Alligator Alcatraz in the Florida Everglades: Videos of ICE detention center in Ochopee",
    "description": "Where is Alligator Alcatraz? Dubbed East Coast version of famed prison, Trump and Kristi Noem visited new ICE detention center in Ochopee, Florida.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/01/alligator-alcatraz-video-florida-detention-center-dade-collier/84436093007/",
    "timestamp": "2025-07-01T19:37:54Z"
  },
  {
    "title": "Fan With ‘TRUMP WON!’ Flag Trolls ‘Alligator Alcatraz’ Protesters By Blowing Kisses From Electric Scooter",
    "description": "A Trump fan with a \"TRUMP WON\" flag trolled protesters outside the site of Trump's \"Alligator Alcatraz\" photo op by blowing kisses from an electric scooter\nThe post Fan With ‘TRUMP WON!’ Flag Trolls ‘Alligator Alcatraz’ Protesters By Blowing Kisses From Elect…",
    "link": "https://www.mediaite.com/media/news/fan-with-trump-won-flag-trolls-alligator-alcatraz-protesters-by-blowing-kisses-from-electric-scooter/",
    "timestamp": "2025-07-01T19:37:43Z"
  },
  {
    "title": "Mayors, doctor groups sue over Trump's efforts to restrict Obamacare enrollment",
    "description": "New Trump administration rules that give millions of people less time to sign up for the Affordable Care Act’s coverage, and bar some immigrants from buying the health care coverage, are facing a legal challenge from Democratic mayors. The rules, rolled out l…",
    "link": "https://www.seattlepi.com/news/article/mayors-doctor-groups-sue-over-trump-s-efforts-to-20403193.php",
    "timestamp": "2025-07-01T19:37:00Z"
  },
  {
    "title": "Mayors, doctor groups sue over Trump's efforts to restrict Obamacare enrollment",
    "description": "New Trump administration rules that give millions of people less time to sign up for the Affordable Care Act’s coverage, and bar some immigrants from buying the health care coverage, are facing a legal challenge from Democratic mayors.",
    "link": "https://www.news4jax.com/health/2025/07/01/mayors-doctor-groups-sue-over-trumps-efforts-to-restrict-obamacare-enrollment/",
    "timestamp": "2025-07-01T19:35:37Z"
  },
  {
    "title": "Appeals court rules Alabama violated constitutional rights of man sentenced to death",
    "description": "A federal appeals court ruled Alabama prosecutors violated the constitutional rights of a man sentenced to death in 1990, saying Blacks were rejected from the jury during his trial.",
    "link": "https://nypost.com/2025/07/01/us-news/court-rules-alabama-violated-constitutional-rights-of-man-sentenced-to-death/",
    "timestamp": "2025-07-01T19:34:18Z"
  },
  {
    "title": "Trump’s Newest Scam Stinks (Literally) of Desperation",
    "description": "Step right up: For a limited time, you, too, could smell like Donald Trump.\r\nThe president’s latest business venture is a pair of colognes that retail for $249 per 3.3-ounce bottle. The scent is called “Victory 47-45” for men and women, a nod to his dual elec…",
    "link": "https://newrepublic.com/post/197495/donald-trump-newest-scam-fragrance-perfume",
    "timestamp": "2025-07-01T19:32:34Z"
  },
  {
    "title": "UPenn agrees to follow Trump's mandate on protecting women's sports, Education Department says",
    "description": "The Trump administration secured a UPenn agreement to protect women's sports, requiring biology-based definitions and record restoration.",
    "link": "https://www.foxnews.com/sports/upenn-agrees-follow-trumps-mandate-protecting-womens-sports-education-department-says",
    "timestamp": "2025-07-01T19:32:00Z"
  },
  {
    "title": "Can Donald Trump deport Elon Musk? What we know about the Tesla, SpaceX CEO's citizenship",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a085ca3d-4316-4bc4-a4de-b8286656a283",
    "timestamp": "2025-07-01T19:31:50Z"
  },
  {
    "title": "Is Elon Musk's multi-billion dollar empire crumbling?",
    "description": "Tesla stock’s performance can have an outsize impact on the stock market index funds in which millions of Americans 401(k)s have invested their retirement savings.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-elon-musks-multi-billion-dollar-empire-crumbling/articleshow/122190842.cms",
    "timestamp": "2025-07-01T19:31:38Z"
  },
  {
    "title": "Trump Cut Rape Survivor Kits for Congo",
    "description": "\"President Donald Trump's administration cancelled a major contract to supply emergency kits for rape survivors in Congo as violence surged in the east this year, leaving thousands without access to life-saving medication,\" Reuters reports. \"The",
    "link": "https://politicalwire.com/2025/07/01/trump-cut-rape-survivor-kits-for-congo/",
    "timestamp": "2025-07-01T19:30:50Z"
  },
  {
    "title": "Students for Fair Admissions and Naval Academy File Motion to Vacate Opinion Allowing Academy to Use Race in Admissions",
    "description": "Imagine judging a trial, ruling for one party and writing a 179-page opinion, only to find the same parties asking you to vacate your opinion... Read More\nThe post Students for Fair Admissions and Naval Academy File Motion to Vacate Opinion Allowing Academy t…",
    "link": "https://www.dailysignal.com/2025/07/01/students-for-fair-admissions-and-naval-academy-file-motion-to-vacate-opinion-allowing-academy-to-use-race-in-admissions/",
    "timestamp": "2025-07-01T19:30:00Z"
  },
  {
    "title": "The most volatile cryptocurrencies in the first half of 2025",
    "description": "OANDA reports the top volatile cryptocurrencies in early 2025, highlighting Bitcoin's dominance and XRP's significant recovery amid market fluctuations.",
    "link": "https://www.oanda.com/us-en/trade-tap-blog/asset-classes/crypto/most-volatile-crypto-2025-first-half/",
    "timestamp": "2025-07-01T19:30:00Z"
  },
  {
    "title": "Make America Kind Again",
    "description": "From political name-calling to social media meltdowns, public life feels more hostile than ever. But quiet acts of kindness suggest a growing civility, one small moment at a time.",
    "link": "https://www.phillymag.com/news/2025/07/01/kindness-america-empathy/",
    "timestamp": "2025-07-01T19:29:59Z"
  },
  {
    "title": "Qatar presents Israel, Hamas with modified Witkoff hostage deal proposal, aims to reach ceasefire",
    "description": "If a temporary ceasefire is achieved, a US plan for \"the day after\" could serve as the basis for negotiations between Israel and Hamas to end the war. Qatar ...",
    "link": "https://www.yahoo.com/news/qatar-presents-israel-hamas-modified-192913693.html",
    "timestamp": "2025-07-01T19:29:13Z"
  },
  {
    "title": "GOP Senate Pushes Through $3.3 Trillion Tax And Spending Overhaul",
    "description": "At the heart of the measure are permanent extensions to the 2017 tax cuts, a lower corporate tax rate of 17%, and fresh incentives for companies investing in U.S.-based manufacturing, artificial intelligence and advanced technology infrastructure.",
    "link": "https://www.ibtimes.com/gop-senate-pushes-through-33-trillion-tax-spending-overhaul-3777393",
    "timestamp": "2025-07-01T19:28:53Z"
  },
  {
    "title": "Trump Makes Cruel Joke About ‘Alligator Alcatraz’ Immigrant Escapees",
    "description": "The president's brutal comment comes amid concerns from law and policy experts about the facility.",
    "link": "https://www.huffpost.com/entry/trump-alligator-alcatraz-joke_n_6863fd4ce4b0aa65edbb3bd3",
    "timestamp": "2025-07-01T19:28:18Z"
  },
  {
    "title": "Republican Donors Cash In on ‘Alligator Alcatraz’ Immigrant Camp",
    "description": "Contractors who reportedly worked on Florida’s “Alligator Alcatraz” detention camp have been big donors to Ron DeSantis and Donald Trump.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-desantis-donors-alligator-alcatraz-immigrant-camp-1235376856/",
    "timestamp": "2025-07-01T19:27:20Z"
  },
  {
    "title": "Trump Threatens To Arrest Socialist Mamdani If It Comes To It",
    "description": "President Donald Trump warned that Democrat New York City mayoral nominee Zohran Mamdani will be placed under arrest if he interferes with ICE operations.",
    "link": "https://dailycaller.com/2025/07/01/trump-arrest-socialist-mamdani-ice/",
    "timestamp": "2025-07-01T19:25:43Z"
  },
  {
    "title": "Here’s how Trump’s megabill will affect you",
    "description": "Seniors, students, taxpayers, children, parents, low-income Americans and just about everyone else will be affected by the massive tax and spending bill being hashed out in real time on Capitol Hill.",
    "link": "https://www.cnn.com/2025/07/01/politics/congress-senate-bill-tax-spending-trump-gop-explainer",
    "timestamp": "2025-07-01T19:23:55Z"
  },
  {
    "title": "A Vision for Democracy and Progress\nProject 2029",
    "description": "America stands at a crossroads. On one side, there’s Project 2025—a blueprint that threatens the foundations of our democracy, dismantles our institutions, and leaves everyday people behind. On the other, there’s an opportunity: a chance to rebuild trust, pro…",
    "link": "https://freerepublic.com/focus/f-chat/4326356/posts",
    "timestamp": "2025-07-01T19:23:50Z"
  },
  {
    "title": "Rosie O'Donnell Slams Celebrities Who Attended Bezos' Wedding",
    "description": "\"It turned my stomach seeing all these billionaires gathering in the gross excess of it all.\" ",
    "link": "https://littlethings.com/entertainment/rosie-odonnell-bezos-wedding-oprah",
    "timestamp": "2025-07-01T19:23:41Z"
  },
  {
    "title": "Elon Is Asking For It: What Musk’s Latest Trump Spat Means As Tesla Sales Sink",
    "description": "Second-quarter vehicle deliveries are forecast to see one of the company’s biggest ever year-over-year declines and the Senate version of Trump’s budget bill phases out EV tax credits.",
    "link": "https://www.forbes.com/sites/alanohnsman/2025/07/01/what-musks-latest-trump-spat-means-as-tesla-sales-sink/",
    "timestamp": "2025-07-01T19:22:47Z"
  },
  {
    "title": "Trump Tariffs Blamed for Sharpest E-Commerce Slowdown in Years: Survey",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOnline retail activity in the United States has experienced its sharpest slowdown in over a decade, as new data indicates widespread declines across many e-commerce categories.\nWhy It Matters\nThe downturn come…",
    "link": "https://biztoc.com/x/b5e37aba86073665",
    "timestamp": "2025-07-01T19:22:45Z"
  },
  {
    "title": "Trump reiterates July 4th megabill deadline",
    "description": "President Donald Trump reiterated his demand that Congress pass Republicans’ agenda-defining megabill before July 4th, despite softening on that deadline as recently as Tuesday morning. \nTrump urged House Republicans in a social media post on Tuesday afternoo…",
    "link": "https://biztoc.com/x/0d0fce5a253d3e2e",
    "timestamp": "2025-07-01T19:22:30Z"
  },
  {
    "title": "Trump's Travel Ban Will Not Make Americans Safer",
    "description": "President Donald Trump recently banned travel and immigration to the United States for nationals of a dozen countries, insisting that this would protect the U.S. from terrorists and criminals.\nThe ban applies to Afghanistan, Myanmar, Chad, the Republic of Con…",
    "link": "https://biztoc.com/x/ee31933916a91f80",
    "timestamp": "2025-07-01T19:22:29Z"
  },
  {
    "title": "Trump Asked If He'll Deport Elon Musk",
    "description": "President Donald Trump said he would look into deporting billionaire Elon Musk in response to a question about the ally-turned-critic of his signature tax and spending legislation.\n“I don’t know,” Trump told reporters at the White House on Tuesday when asked …",
    "link": "https://biztoc.com/x/6a6ad3fe1d82e5df",
    "timestamp": "2025-07-01T19:22:25Z"
  },
  {
    "title": "Trump and Musk’s feud blows up again with threats of Doge and deportation",
    "description": "Reignited quarrel centers around Musk’s opposition to the president’s signature tax bill as it moves through Congress\nDonald Trump and Elon Musk’s feud reignited this week with the former political allies trading sharp public threats of retribution. The blowu…",
    "link": "https://biztoc.com/x/a27597e8fa72c8f1",
    "timestamp": "2025-07-01T19:22:20Z"
  },
  {
    "title": "Senate GOP removes tax on solar and wind energy but dismantles climate law passed by Democrats",
    "description": "The sprawling Republican budget bill approved by the Senate Tuesday removes a proposed tax on solar and wind energy projects but quickly phases out tax credits for wind, solar and other renewable energy.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/01/senate-gop-removes-tax-on-solar-and-wind-energy-but-dismantles-climate-law-passed-by-democrats/",
    "timestamp": "2025-07-01T19:22:10Z"
  },
  {
    "title": "Trump Tariffs Blamed for Sharpest E-Commerce Slowdown in Years: Survey",
    "description": "\"The uncertainty is what's creating huge issues,\" a retail expert told Newsweek.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-ecommerce-economy-online-2093231",
    "timestamp": "2025-07-01T19:21:42Z"
  },
  {
    "title": "Trump Teases Reopening of OG, Shark-Guarded Alcatraz After Visit to Florida Knock-Off: ‘Conceptual Work Started Six Months Ago…Lots of Promise!’",
    "description": "President Donald Trump teased his plans for reopening the OG, shark-guarded Alcatraz on Tuesday after visiting the Floridian knock-off, \"Alligator Alcatraz.\"\nThe post Trump Teases Reopening of OG, Shark-Guarded Alcatraz After Visit to Florida Knock-Off: ‘Conc…",
    "link": "https://www.mediaite.com/politics/trump/trump-teases-reopening-of-og-shark-guarded-alcatraz-after-visit-to-florida-knock-off-conceptual-work-started-six-months-ago-lots-of-promise/",
    "timestamp": "2025-07-01T19:21:26Z"
  },
  {
    "title": "JD Vance Says Medicaid Cuts for Millions “Immaterial” Compared to Funding ICE",
    "description": "Vance handwaved away the Medicaid cuts — expected to lead to thousands of deaths yearly — as “minutiae.”…",
    "link": "https://truthout.org/articles/jd-vance-says-medicaid-cuts-for-millions-immaterial-compared-to-funding-ice/",
    "timestamp": "2025-07-01T19:21:11Z"
  },
  {
    "title": "Trump says he won't extend July 9 trade deadline, expresses doubt on Japan deal",
    "description": "WASHINGTON :President Donald Trump said on Tuesday he was not thinking of extending the July 9 deadline for countries to negotiate trade deals with the U.S., and continued to express doubt that an agreement could be reached with Japan.\"We've dealt with Japan.…",
    "link": "https://www.channelnewsasia.com/business/trump-says-he-wont-extend-july-9-trade-deadline-expresses-doubt-japan-deal-5214791",
    "timestamp": "2025-07-01T19:20:42Z"
  },
  {
    "title": "Senate GOP removes tax on solar and wind energy but dismantles climate law passed by Democrats",
    "description": "The sprawling Republican budget bill approved by the Senate Tuesday removes a proposed tax on solar and wind energy projects but quickly phases out tax credits for wind, solar and other renewable energy. The Senate approved the bill, 51-50, as President Donal…",
    "link": "https://www.seattlepi.com/news/politics/article/senate-gop-removes-tax-on-solar-and-wind-energy-20403158.php",
    "timestamp": "2025-07-01T19:20:02Z"
  },
  {
    "title": "Who is Robert, who holds 100GB of stolen emails of Donald Trump’s aides? Here’s what do these emails contain",
    "description": "A group connected to Iran claims it has stolen 100GB of emails from Trump aides, including Roger Stone and Susie Wiles. US cybersecurity officials warn this could be part of a foreign campaign to disrupt and discredit the government. Investigations are ongoin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-robert-who-holds-100gb-of-stolen-emails-of-donald-trumps-aides-heres-what-do-these-emails-contain/articleshow/122190679.cms",
    "timestamp": "2025-07-01T19:18:20Z"
  },
  {
    "title": "AI Videos Push Combs Trial Misinformation, Researchers Say",
    "description": "Around two dozen YouTube channels are pumping out AI-generated videos with false claims about music mogul Sean \"Diddy\" Combs's sex trafficking trial, racking up millions of views and profiting from misinformation, researchers say.",
    "link": "https://www.ibtimes.com/ai-videos-push-combs-trial-misinformation-researchers-say-3777391",
    "timestamp": "2025-07-01T19:18:07Z"
  },
  {
    "title": "Trump's Travel Ban Will Not Make Americans Safer",
    "description": "The president's cruel and pointless ban on immigration or visits from nationals of 12 countries will have no significant safety benefit for Americans.",
    "link": "https://reason.com/2025/07/01/trumps-travel-ban-will-not-make-americans-safer/",
    "timestamp": "2025-07-01T19:15:31Z"
  },
  {
    "title": "The Dallas Morning News Names Colleen McCain Nelson Executive Editor",
    "description": "The Dallas Morning News Names Colleen McCain Nelson Executive Editor......",
    "link": "https://www.globenewswire.com/news-release/2025/07/01/3108741/0/en/The-Dallas-Morning-News-Names-Colleen-McCain-Nelson-Executive-Editor.html",
    "timestamp": "2025-07-01T19:15:00Z"
  },
  {
    "title": "'Let's Break It Down': Mamdani Gives His Perspective on Historic NYC Win",
    "description": "Last week, democratic socialist and state Assemblymember Zohran Mamdani stunned in an upset victory over disgraced former New York Gov. Andrew Cuomo in New York City's Democratic mayoral primary—sparking broader conversations about the future of the party and…",
    "link": "https://www.commondreams.org/news/mamdani-video-lets-break-it-down",
    "timestamp": "2025-07-01T19:13:33Z"
  },
  {
    "title": "Old Man Trump Weirdly Refuses to Answer Alligator Alcatraz Question",
    "description": "Donald Trump took off on a winding rant about his summer vacation plans Tuesday when asked a crucial question about “Alligator Alcatraz.”\r\nDuring a press conference at the ICE facility in the middle of the Florida Everglades, the president was asked whether t…",
    "link": "https://newrepublic.com/post/197492/donald-trump-refuses-answer-alligator-alcatraz-florida-cognitive-decline",
    "timestamp": "2025-07-01T19:12:46Z"
  },
  {
    "title": "The Birthright Citizenship Case—Loud Music from the Supreme Court",
    "description": "Amy Coney Barrett's majority opinion used a noise complaint hypothetical to justify letting Trump's blatantly unconstitutional citizenship order blare on for everyone except the specific plaintiffs who sued.\nThe post The Birthright Citizenship Case—Loud Music…",
    "link": "http://washingtonmonthly.com/2025/07/01/the-birthright-citizenship-case-loud-music-from-the-supreme-court/",
    "timestamp": "2025-07-01T19:12:34Z"
  },
  {
    "title": "Trump: We Used FEMA Money Biden Allocated for Luxury Housing for Illegals in NYC to Construct 'Alligator Alcatraz'",
    "description": "The government used FEMA money allocated by the Biden administration to house illegal migrants in luxury hotels in New York City to construct \"Alligator Alcatraz\" in the Florida Everglades, President Donald Trump said Tuesday during a roundtable discussion af…",
    "link": "https://www.breitbart.com/politics/2025/07/01/trump-we-used-fema-money-biden-allocated-for-luxury-housing-for-illegals-in-nyc-to-construct-alligator-alcatraz/",
    "timestamp": "2025-07-01T19:12:20Z"
  },
  {
    "title": "Trump says Japan could pay 30%-35% tariff",
    "description": "United States President Donald Trump told reporters on Tuesday that he \"doubts\" Washington will strike a trade deal with Japan. He suggested that Tokyo could potentially pay a tariff between 30% and 3...",
    "link": "https://biztoc.com/x/8c8f2e060efe9f8a",
    "timestamp": "2025-07-01T19:11:26Z"
  },
  {
    "title": "Trump Administration Weighs Eliminating Funds for Hospitals Offering Gender Care to Minors",
    "description": "The Trump administration is weighing cutting off funds to hospitals that it says provide gender-related treatments for children and teenagers, a move that would sharply escalate officials’ scrutiny of such programs. The potential for increased federal scrutin…",
    "link": "https://freerepublic.com/focus/f-news/4326354/posts",
    "timestamp": "2025-07-01T19:11:17Z"
  },
  {
    "title": "Will Democrats Be Able to Rally Against the Spending Bill?",
    "description": "Maybe. But also, maybe not. As Paul pointed out earlier, this country is a complete disaster and Trump is no less popular now than he was in his first term, despite this term being vastly worse. I’d like to think that this horrifying spending bill will turn p…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/will-democrats-be-able-to-rally-against-the-spending-bill",
    "timestamp": "2025-07-01T19:09:46Z"
  },
  {
    "title": "Rushes | Trump’s Prop-House Party Favors, Streamers to the Front, Villeneuve’s 007",
    "description": "This week’s essential news, articles, sounds, videos, and more from the film world.",
    "link": "https://mubi.com/en/notebook/posts/rushes-trump-s-prop-house-party-favors-streamers-to-the-front-villeneuve-s-007",
    "timestamp": "2025-07-01T19:09:08Z"
  }
]