[
  {
    "title": "Carney announces that Canada is dropping many retaliatory tariffs on U.S. goods",
    "description": "OTTAWA — Canada will drop some retaliatory tariffs on American products to match U.S. tariff exemptions for goods covered under the Canada-United States-Mexico Agreement, Prime Minister Mark Carney announced Friday. After meeting with his cabinet, Carney said…",
    "link": "https://toronto.citynews.ca/2025/08/22/pm-mark-carney-tariffs-update/",
    "timestamp": "2025-08-22T14:52:15Z"
  },
  {
    "title": "CNN anchor flags 'interesting tidbit' as JD Vance leans into 'cryptic' FBI leader comments",
    "description": "CNN's John Berman flagged an \"interesting tidbit\" as news broke about the FBI raid on former national security adviser John Bolton's home.Federal agents executed a search warrant at the home of the prominent critic of President Donald Trump, and the \"CNN News…",
    "link": "https://www.rawstory.com/john-bolton-kash-patel-cryptic/",
    "timestamp": "2025-08-22T14:52:09Z"
  },
  {
    "title": "Iran, Europeans To Meet As Snapback Sanctions Loom",
    "description": "Iran will meet next week with Britain, France and Germany on its nuclear programme, the parties said Friday, as the European powers warned Tehran to engage swiftly to avoid snapback sanctions.",
    "link": "https://www.ibtimes.com/iran-europeans-meet-snapback-sanctions-loom-3781459",
    "timestamp": "2025-08-22T14:51:21Z"
  },
  {
    "title": "FBI raids Trump critic John Bolton’s house",
    "description": "Bolton served as Trump's national security adviser before turning into one of his staunchest critics.",
    "link": "https://www.salon.com/2025/08/22/fbi-raids-trump-critic-john-boltons-house/",
    "timestamp": "2025-08-22T14:50:45Z"
  },
  {
    "title": "Higher tariffs have begun to push up prices, Powell sounds alarm as he cites inflation data",
    "description": "Jerome Powell on Friday hinted that Fed may cut rates soon but gave no hint on the timing of a move. He suggested the central bank will proceed cautiously as it continues to evaluate the impact of tariffs and other policies on the economy. Powell said that th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-higher-tariffs-have-begun-to-push-up-prices-powell-sounds-alarm-as-he-cites-inflation-data/articleshow/123457208.cms",
    "timestamp": "2025-08-22T14:50:44Z"
  },
  {
    "title": "Israel escalates destruction of Gaza City",
    "description": "Quadcopters are being used to encircle residential blocks and coerce civilians into fleeing under armed threat, rights group reports.",
    "link": "https://electronicintifada.net/blogs/nora-barrows-friedman/israel-escalates-destruction-gaza-city",
    "timestamp": "2025-08-22T14:50:05Z"
  },
  {
    "title": "Trump to raise $2B from Congress for Washington DC",
    "description": "United States President Donald Trump told reporters on Friday that $2 billion will be raised from Congress for Washington DC to be \"beautified.\"\"Congress is happy to do it. We are going to wisely spen...",
    "link": "https://biztoc.com/x/8dda02b41fadd9e8",
    "timestamp": "2025-08-22T14:49:48Z"
  },
  {
    "title": "Fed's Powell Issues New Trump Tariffs Warning",
    "description": "The Federal Reserve chair delivered his annual Jackson Hole speech.",
    "link": "https://www.newsweek.com/trump-tariffs-fed-powell-inflation-rates-2117808",
    "timestamp": "2025-08-22T14:49:47Z"
  },
  {
    "title": "Trump Warns ‘Not Playing Games’ in Visit to Federal Police in DC",
    "description": "President Donald Trump visited a Park Police operations facility to thank federal law enforcement officers he’s deployed to patrol the streets of Washington, DC, saying he expected their deployment to last “for a while.”\n“We’re going to then go on to other pl…",
    "link": "https://biztoc.com/x/d20efb367c43b1c1",
    "timestamp": "2025-08-22T14:49:32Z"
  },
  {
    "title": "Trump: TikTok can continue US ops",
    "description": "United States President Donald Trump reaffirmed on Friday that TikTok can continue to operate in the country as \"there are American buyers\" interested in acquiring its business there from China's Byte...",
    "link": "https://biztoc.com/x/381a7932fd6b5e25",
    "timestamp": "2025-08-22T14:49:12Z"
  },
  {
    "title": "Trump Says He Was Not Briefed on FBI Raid of Bolton’s Home",
    "description": "President Donald Trump said Thursday he was not briefed on the FBI raid of former national security adviser John Bolton’s home, according to The Guardian.\nSpeaking during an unplanned visit to the “People’s House” exhibit near the White House, Trump said he o…",
    "link": "https://biztoc.com/x/03f3624456bb8c55",
    "timestamp": "2025-08-22T14:49:11Z"
  },
  {
    "title": "FBI raids home of John Bolton, former Trump adviser turned critic",
    "description": "The raid is one of several probes launched against critics of President Donald Trump, fuelling fears of 'retribution'.",
    "link": "https://www.aljazeera.com/news/2025/8/22/fbi-raids-home-of-john-bolton-former-trump-adviser-turned-critic",
    "timestamp": "2025-08-22T14:49:05Z"
  },
  {
    "title": "Edinburgh TV Festival Takeaways: Star Power, YouTube & ‘Adolescence’-Themed Spice",
    "description": "The Edinburgh TV Festival turned 50 this year and it’s been a ride. After a distinctly doomy 2024, characterized by warnings around the “squeezed middle,” 2025 felt like something of a return to the fest’s creative roots, alongside a few sessions that got jus…",
    "link": "http://deadline.com/2025/08/edinburgh-tv-festival-takeaways-adolescence-youtube-donald-trump-1236493966/",
    "timestamp": "2025-08-22T14:48:48Z"
  },
  {
    "title": "Iran, Europeans to meet as snapback sanctions loom",
    "description": "Iran will meet next week with Britain, France and Germany on its nuclear programme, the parties said Friday, as the European powers warned Tehran to engage swiftly to avoid snapback sanctions. The Islamic republic suspended cooperation with the International …",
    "link": "https://www.digitaljournal.com/world/iran-europeans-to-meet-as-snapback-sanctions-loom/article",
    "timestamp": "2025-08-22T14:47:20Z"
  },
  {
    "title": "Global postal services halt US deliveries over tariffs",
    "description": "Services including Royal Mail and  DHL say they are suspending deliveries until they have proper systems in place.",
    "link": "https://www.bbc.com/news/articles/cx2p17xypgko",
    "timestamp": "2025-08-22T14:47:16Z"
  },
  {
    "title": "TikTok web goes live for some users in India",
    "description": "TikTok has gone live on the Internet after nearly five years in India. This comes after the White House launched an official TikTok account on Tuesday.",
    "link": "https://economictimes.indiatimes.com/tech/technology/tiktok-web-goes-live-for-some-users-in-india/articleshow/123457266.cms",
    "timestamp": "2025-08-22T14:47:11Z"
  },
  {
    "title": "Trump says he will fire Fed Governor Lisa Cook if she doesn't resign",
    "description": "President Donald Trump said he would fire Federal Reserve Governor Lisa Cook if she doesn't resign.",
    "link": "https://www.nbcnews.com/business/economy/trump-says-will-fire-fed-governor-cook-doesnt-resign-rcna226554",
    "timestamp": "2025-08-22T14:45:22Z"
  },
  {
    "title": "Trump Says He'll Fire Fed's Cook If She Doesn't Resign (Skylar Woodhouse/Bloomberg)",
    "description": "Skylar Woodhouse / Bloomberg:\nTrump Says He'll Fire Fed's Cook If She Doesn't Resign  —  US President Donald Trump said he would fire Lisa Cook from the Federal Reserve Board of Governors if she does not resign her post over mortgage-fraud accusations from a …",
    "link": "https://www.memeorandum.com/250822/p40",
    "timestamp": "2025-08-22T14:45:03Z"
  },
  {
    "title": "Lawmakers Will Get Some Epstein Files Today From DOJ—Here’s What To Know",
    "description": "Rep. James Comer said Monday that documents should start being turned over on Friday—though when they could be released to the public remains unclear.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/08/22/lawmakers-will-get-some-epstein-files-today-from-doj-heres-what-to-know/",
    "timestamp": "2025-08-22T14:44:53Z"
  },
  {
    "title": "'Cruel': On Trump Order, DeSantis Removes Rainbow Crosswalk Memorializing LGBTQ+ Nightclub Shooting",
    "description": "Republican Florida Gov. Ron DeSantis, following a directive from US President Donald Trump's administration, painted over a rainbow crosswalk in Orlando that for years had served as a memorial to the victims of the 2016 massacre at Pulse, a local LGBTQ+ night…",
    "link": "https://www.commondreams.org/news/pulse-nightclub-memorial-removed",
    "timestamp": "2025-08-22T14:44:05Z"
  },
  {
    "title": "Yep—Trump Is Still the Most Racist President of the Last 100 Years",
    "description": "You may not know the name Lindsey Halligan. She’s not a scholar. Not a Ph.D. She hasn’t written any books on history. She has, however, worked as an insurance claims lawyer. Her most celebrated achievement, apparently, was defeating a 2019 claim seeking $500,…",
    "link": "https://newrepublic.com/post/199457/yep-trump-still-racist-president-last-100-years",
    "timestamp": "2025-08-22T14:41:54Z"
  },
  {
    "title": "A crowded race for governor has turned into an all-out fight over Trump's endorsement",
    "description": "The crowded Republican race to be South Carolina’s next governor has erupted into an early, all-out battle to secure Donald Trump’s coveted endorsement.",
    "link": "https://www.nbcnews.com/politics/2026-election/crowded-race-governor-turned-fight-trumps-endorsement-rcna226030",
    "timestamp": "2025-08-22T14:41:28Z"
  },
  {
    "title": "'Most difficult': Trump confesses his campaign promise about war is harder than he thought",
    "description": "President Donald Trump visited the Smithsonian museum for the White House on Friday morning while the FBI raided the home of his foe John Bolton. Speaking to the press, Trump answered questions on a variety of issues, including his ongoing fight to establish …",
    "link": "https://www.rawstory.com/trump-russia-ukraine-2673910835/",
    "timestamp": "2025-08-22T14:41:11Z"
  },
  {
    "title": "Postal Services Across Globe Pause US Deliveries as Tariff Shift Sows Confusion",
    "description": "Postal services across the world are suspending parcel deliveries to the US, citing confusion about how to process millions of low-value packages that will lose their duty-free treatment next week. As of Aug. 29, President Donald Trump is ending the …",
    "link": "https://www.insurancejournal.com/news/international/2025/08/22/836701.htm",
    "timestamp": "2025-08-22T14:41:02Z"
  },
  {
    "title": "Wall Street rallies as Fed chief fuels rate cut hopes",
    "description": "Wall Street shares rallied Friday as US Federal Reserve chief Jerome Powell left the door open to cutting interest rates.The Fed has kept interest rates...",
    "link": "https://finance.yahoo.com/news/asian-markets-tick-investors-eye-030724800.html",
    "timestamp": "2025-08-22T14:40:03Z"
  },
  {
    "title": "Trump’s FBI Just Raided the Home of One of His Most Prominent Critics",
    "description": "John Bolton, President Donald Trump’s former national security adviser turned vocal Trump critic, is the latest target of the president’s weaponization of the government against his political adversaries.On Friday morning, the Federal Bureau of Investigation …",
    "link": "https://newrepublic.com/post/199446/donald-trump-fbi-john-bolton-national-security",
    "timestamp": "2025-08-22T14:39:39Z"
  },
  {
    "title": "Cracker Barrel abandons customers, female enlistment surges, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/cracker-barrel-abandons-customers-female-enlistment-surges-more-from-fox-news-opinion",
    "timestamp": "2025-08-22T14:39:21Z"
  },
  {
    "title": "Powell says ‘shifting balance of risks’ may warrant a sooner rate cut",
    "description": "The Federal Reserve chair gave prepared remarks at the Fed’s annual economic symposium in Jackson Hole, Wyoming.",
    "link": "https://fortune.com/2025/08/22/powell-jackson-hole-shifting-balance-risks-september-rate-cut/",
    "timestamp": "2025-08-22T14:38:44Z"
  },
  {
    "title": "Trump says he'll fire Fed Governor Lisa Cook 'if she doesn't resign'",
    "description": "President Donald Trump said Friday he will fire Federal Reserve Governor Lisa Cook if she does not resign from her position.\n\"What she did was bad,\" the president told reporters who asked about Cook, an appointee of former President Joe Biden who has come und…",
    "link": "https://biztoc.com/x/6906fbdac4cbdda8",
    "timestamp": "2025-08-22T14:38:13Z"
  },
  {
    "title": "Jerome Powell signals potential rate cut in speech highlighting precarious job market",
    "description": "President Donald Trump has sought to terminate Federal Reserve Chair Jerome Powell, potentially setting up another constitutional fight if Powell refuses to go.",
    "link": "https://biztoc.com/x/75266d516c9e18c6",
    "timestamp": "2025-08-22T14:38:06Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "The outage has raised concerns among advocates who already were troubled by the disappearance of data sets from government websites after President Donald Trump began his second term.",
    "link": "https://biztoc.com/x/f8aaeb2a361b6230",
    "timestamp": "2025-08-22T14:38:04Z"
  },
  {
    "title": "Cracker Barrel to Aunt Jemima: 5 brands that faced backlash after logo change",
    "description": "On Wednesday, popular US food and gift chain Cracker Barrel announced that they are changing its logo after 48 years, as part of a rebranding effort. The decision to scrap the iconic logo led to backlash on social media. But this is not the first time a popul…",
    "link": "https://freerepublic.com/focus/f-chat/4336082/posts",
    "timestamp": "2025-08-22T14:38:02Z"
  },
  {
    "title": "Florida must stop expanding ‘Alligator Alcatraz’ immigration center, judge says",
    "description": "The judge wrote the state and federal defendants can't bring anyone other than those who are already being detained at the facility onto the property.",
    "link": "https://www.pbs.org/newshour/nation/florida-must-stop-expanding-alligator-alcatraz-immigration-center-judge-says",
    "timestamp": "2025-08-22T14:37:24Z"
  },
  {
    "title": "U.S. stocks jump as Fed chair Jerome Powell opens door to interest rate cut",
    "description": "Wall Street is rallying on Friday after the head of the Federal Reserve indicated cuts to interest rates may be coming, though he gave no clear clue about when.",
    "link": "https://www.cbc.ca/news/business/wall-street-rallies-fed-powell-rate-cut-1.7615541",
    "timestamp": "2025-08-22T14:36:45Z"
  },
  {
    "title": "Trump says he'll fire Fed Governor Lisa Cook 'if she doesn't resign'",
    "description": "President Donald Trump said Friday he will fire Federal Reserve Governor Lisa Cook if she does not resign from her position.",
    "link": "https://www.cnbc.com/2025/08/22/trump-fire-fed-lisa-cook-powell.html",
    "timestamp": "2025-08-22T14:36:35Z"
  },
  {
    "title": "James Comer praises Kash Patel for 'holding deep state accountable' as FBI raids John Bolton's home",
    "description": "Top Republicans are praising FBI Director Kash Patel and Attorney General Pam Bondi for their conduct as federal agents raid John Bolton's home.",
    "link": "https://www.foxnews.com/politics/james-comer-praises-kash-patel-holding-deep-state-accountable-fbi-raids-john-boltons-home",
    "timestamp": "2025-08-22T14:35:31Z"
  },
  {
    "title": "Circle, Coinbase, Strategy Surge as Crypto Stocks Rally on Possible Rate Cut Hopes",
    "description": "Circle, eToro and Marathon led sharp gains on Friday after Federal Reserve Chair Jerome Powell hinted that a policy shift could come next month.",
    "link": "https://www.coindesk.com/markets/2025/08/22/circle-coinbase-strategy-among-crypto-stock-rally-as-powell-signals-september-rate-cuts-may-be-on-the-table",
    "timestamp": "2025-08-22T14:35:02Z"
  },
  {
    "title": "White House Cancels School Field Trip Visits Indefinitely, Page Disappears",
    "description": "All public tours, including those for student groups, are on hold as construction begins on a planned $200 million ballroom.",
    "link": "https://www.newsweek.com/white-house-school-trips-cancelled-2117718",
    "timestamp": "2025-08-22T14:32:48Z"
  },
  {
    "title": "Bolton tweet during raid shows focus was elsewhere as FBI searched his house",
    "description": "Former National Security Advisor John Bolton posted to X about the war in Ukraine when the FBI first raided his home on Friday morning, time stamps of the tweet show.",
    "link": "https://www.foxnews.com/politics/bolton-tweet-during-raid-shows-focus-elsewhere-fbi-searched-his-house",
    "timestamp": "2025-08-22T14:32:33Z"
  },
  {
    "title": "Ethereum, Bitcoin Spike After Powell Signals Interest Rate Cut",
    "description": "The central bank chairman has been under pressure from the White House to cut the rate.",
    "link": "https://decrypt.co/336440/ethereum-bitcoin-jump-powell-hints-interest-rate-cut",
    "timestamp": "2025-08-22T14:31:38Z"
  },
  {
    "title": "EU Accelerates Digital Euro Efforts, Spurred by US Stablecoin Law",
    "description": "The European Union is reportedly speeding up its efforts to launch a digital euro, in part by considering the use of a public blockchain rather than a private one. The shift was prompted by the passage of a stablecoin law in the United States, which has left …",
    "link": "http://www.pymnts.com/cryptocurrency/2025/european-union-accelerates-digital-euro-efforts-spurred-united-states-stablecoin-law/",
    "timestamp": "2025-08-22T14:31:37Z"
  },
  {
    "title": "Fed's Powell hints at possible September rate cut in his biggest speech of the year",
    "description": "In his keynote Jackson Hole address, Fed Chair Jerome Powell spoke about the job market, inflation, and the central bank's future outlook.",
    "link": "https://www.businessinsider.com/jerome-powell-jackson-hole-speech-fed-interest-rate-cut-2025-8",
    "timestamp": "2025-08-22T14:30:05Z"
  },
  {
    "title": "Lorne Michaels Confirms: ‘SNL’ Shakeup Coming In About A Week",
    "description": "By\n Matt Solomon\n Published: August 22nd, 2025",
    "link": "https://www.cracked.com/article_48001_lorne-michaels-confirms-snl-shakeup-coming-in-about-a-week.html",
    "timestamp": "2025-08-22T14:30:00Z"
  },
  {
    "title": "California to hold special election; Sony raises price of Playstation 5 | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_2266813e-91b9-5477-8a30-caef6f863d60.html",
    "timestamp": "2025-08-22T14:30:00Z"
  },
  {
    "title": "California to hold special election; Sony raises price of Playstation 5 | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_e8dc1d48-e272-51bc-a47c-cc92a3675235.html",
    "timestamp": "2025-08-22T14:30:00Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "The outage has raised concerns among advocates who already were troubled by the disappearance of data sets from government websites after President Donald Trump began his second term.",
    "link": "https://www.pbs.org/newshour/politics/federal-data-website-outage-raises-concerns-among-advocates",
    "timestamp": "2025-08-22T14:29:24Z"
  },
  {
    "title": "Jonathan Turley Estimates How Many Years John Bolton Could Spend Behind Bars If Convicted",
    "description": "Jonathan Turley estimated on Friday that John Bolton could spend five to twenty years in prison if convicted of possessing classified information.",
    "link": "https://dailycaller.com/2025/08/22/jonathan-turley-years-prison-john-bolton-raid/",
    "timestamp": "2025-08-22T14:28:19Z"
  },
  {
    "title": "US Halts Visas for Truck Drivers After Fatal Florida Crash",
    "description": "The US will stop issuing worker visas for commercial truck drivers, Secretary of State Marco Rubio said Thursday, the latest in a series of Trump administration moves to clamp down on foreign workers. “Effective immediately we are pausing all issuance …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/08/22/836690.htm",
    "timestamp": "2025-08-22T14:27:39Z"
  },
  {
    "title": "While CFTC Awaits New Chairman, Acting Chief Pham Gets Rolling on Crypto",
    "description": "As U.S. President Donald Trump's chairman nominee, Brian Quintenz, remains in a confirmation holding pattern, the CFTC starts another \"crypto sprint.\"",
    "link": "https://www.coindesk.com/policy/2025/08/22/while-cftc-awaits-new-chairman-acting-chief-pham-gets-rolling-on-crypto",
    "timestamp": "2025-08-22T14:27:11Z"
  },
  {
    "title": "Jerome Powell opens door to potential rate cut in speech highlighting rising economic risks",
    "description": "President Donald Trump has sought to terminate Federal Reserve Chair Jerome Powell, potentially setting up another constitutional fight if Powell refuses to go.",
    "link": "https://www.nbcnews.com/business/economy/trump-jerome-powell-federal-reserve-chair-removal-rcna201703",
    "timestamp": "2025-08-22T14:27:04Z"
  },
  {
    "title": "Newsom fires back at Trump with bold 2028 strategy",
    "description": "California Governor Gavin Newsom has transformed from a regional politician into a national Democratic hero by adopting an unexpected strategy: beating Donald Trump at his own game. The governor’s recent social media blitz and redistricting counterattack have…",
    "link": "https://rollingout.com/2025/08/22/newsom-fires-back-at-trump-with-bold/",
    "timestamp": "2025-08-22T14:26:30Z"
  },
  {
    "title": "Feds nab suspected MS-13 gangster, top 700 arrests in DC crackdown",
    "description": "Washington D.C. sees 40 new arrests Thursday as federal anti-crime operation reaches 719 total suspects, including suspected MS-13 member and illegal firearms seizures.",
    "link": "https://www.foxnews.com/us/feds-nab-suspected-ms-13-gangster-top-700-arrests-dc-crackdown",
    "timestamp": "2025-08-22T14:26:28Z"
  },
  {
    "title": "Suze Orman reveals key information on Costco, Walmart, IRAs",
    "description": "The One Big Beautiful Bill Act (OBBBA) is a comprehensive budget bill that passed Congress and was then signed into law by President Donald Trump on July 4.\nIt modifies federal tax policy, spending programs, and revenue provisions across multiple sectors, inc…",
    "link": "https://biztoc.com/x/cf7dbce96f3e0543",
    "timestamp": "2025-08-22T14:26:26Z"
  },
  {
    "title": "NFL's first trans cheerleader sensationally QUITS the team just days before the start of the season",
    "description": "Justine Lindsay, the NFL's first openly transgender cheerleader, has confirmed she will not return to the Carolina Panthers' TopCats squad for the upcoming season. Lindsay, 32, made history in 2022 when she joined the TopCats, becoming the first transgender w…",
    "link": "https://freerepublic.com/focus/f-news/4336079/posts",
    "timestamp": "2025-08-22T14:26:20Z"
  },
  {
    "title": "Trump administration making the Second Amendment great again in DC",
    "description": "The recent federal takeover of Washington, D.C., appears to have had the intended effect of improving public safety, and the Trump administration is now on a roll, working not only to clean up the streets but to make private gun ownership great again in Ameri…",
    "link": "https://freerepublic.com/focus/f-news/4336078/posts",
    "timestamp": "2025-08-22T14:26:03Z"
  },
  {
    "title": "Democrat Jasmine Crockett Claims 'MAGA Keeps Challenging My Blackness'",
    "description": "Rep. Jasmine Crockett (D-TX) on Wednesday claimed conservatives are \"challenging\" her because she is black and educated.\nThe post Democrat Jasmine Crockett Claims ‘MAGA Keeps Challenging My Blackness’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/22/democrat-jasmine-crockett-claims-maga-keeps-challenging-my-blackness/",
    "timestamp": "2025-08-22T14:25:53Z"
  },
  {
    "title": "The West Bank Is Sliding Toward a Crisis",
    "description": "Unless it changes course, Israel is closer to triggering a second war with West Bank Palestinians than to ending the disastrous conflict in Gaza.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/west-bank-poised-explode/683967/",
    "timestamp": "2025-08-22T14:25:02Z"
  },
  {
    "title": "Delivery Drivers ‘Targeted’ During Trump’s Militarized Takeover Of D.C. Police",
    "description": "Some of the highest-profile arrests during the D.C. “crime emergency” are of immigrants — especially delivery workers for companies like DoorDash.",
    "link": "https://www.huffpost.com/entry/trump-dc-takeover-moped-delivery-drivers_n_68a87005e4b0d5177be9f0d9",
    "timestamp": "2025-08-22T14:24:54Z"
  },
  {
    "title": "Fed Chair Jerome Powell warns of rising risk to US labor market",
    "description": "Federal Reserve Chair Jerome Powell has cautioned that the US jobs market faces growing pressure while tariffs are feeding inflation, though their impact may prove temporary. In a closely watched speech at Jackson Hole, Powell left the door open to an interes…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fed-chair-jerome-powell-warns-of-rising-risk-to-us-labor-market/articleshow/123456935.cms",
    "timestamp": "2025-08-22T14:24:03Z"
  },
  {
    "title": "VICTOR DAVIS HANSON: What Is The Democratic Alternative To Trump?",
    "description": "The Pavlovian Left goes berserk at the prospect of each new Trump initiative. Its escalating reactive venom are calibrated to the success of the latest policy.",
    "link": "https://dailycaller.com/2025/08/22/victor-davis-hanson-aimless-democratic-party-no-direction-plan-alternative-donald-trump/",
    "timestamp": "2025-08-22T14:23:56Z"
  },
  {
    "title": "Powell Says Conditions ‘May Warrant’ Interest Rate Cut In Jackson Hole Speech (Live Updates)",
    "description": "The Trump administration has pressured Powell, whose term as Fed chair expires next year, to step down as chair of the central bank.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/22/powell-says-conditions-may-warrant-interest-rate-cut-in-jackson-hole-speech-live-updates/",
    "timestamp": "2025-08-22T14:22:37Z"
  },
  {
    "title": "FBI Targets Yet Another Trump Enemy Because He Made Trump Mad",
    "description": "Donald Trump’s FBI searched the home of John Bolton, who became one of the president’s most prominent foes after leaving his first administration.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-john-bolton-fbi-targets-enemy-mad-1235413872/",
    "timestamp": "2025-08-22T14:20:32Z"
  },
  {
    "title": "MAGA World Is So Close to Getting It",
    "description": "Gavin Newsom’s parodies are riling people up—and they don’t quite seem to understand why.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/gavin-newsom-social-media-trump/683968/",
    "timestamp": "2025-08-22T14:19:56Z"
  },
  {
    "title": "More Tariffs Loom as US Probes Wind Turbine Imports",
    "description": "The Trump administration has launched an investigation into imported wind turbines and parts, a potential precursor to adding more tariffs on the clean-energy components.",
    "link": "https://www.rigzone.com/news/wire/more_tariffs_loom_as_us_probes_wind_turbine_imports-22-aug-2025-181560-article/",
    "timestamp": "2025-08-22T14:19:44Z"
  },
  {
    "title": "Powell signals Fed may cut rates soon even as inflation risks remain",
    "description": "Federal Reserve Chair Jerome Powell on Friday opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the timing of a move and suggested the central bank will proceed cautiously as it continues to evaluate the…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/powell-signals-fed-may-cut-rates-soon-even-as-inflation-risks-remain/articleshow/123456916.cms",
    "timestamp": "2025-08-22T14:19:33Z"
  },
  {
    "title": "Trump punts on Ukraine peace plan after vowing swift end to war",
    "description": "President Donald Trump is backing away from his bold campaign pledge to swiftly end Russia’s war in Ukraine, instead leaving it to Vladimir Putin and Volodymyr Zelenskyy to organize their own talks. Despite previously claiming he could resolve the conflict “i…",
    "link": "https://www.rawstory.com/trump-russia-2673910816/",
    "timestamp": "2025-08-22T14:19:31Z"
  },
  {
    "title": "US Fed Chair Powell, citing jobs risk, opens door to rate cuts but doesn't commit",
    "description": "JACKSON HOLE, Wyoming: United States Federal Reserve Chair Jerome Powell on Friday (Aug 22) pointed to a possible rate cut at the central bank's September meeting but stopped short of committing to cutting interest rates in remarks that walked a narrow line a…",
    "link": "https://www.channelnewsasia.com/world/us-fed-powell-jobs-risk-opens-door-rate-cuts-does-not-commit-5309461",
    "timestamp": "2025-08-22T14:18:23Z"
  },
  {
    "title": "National Guard soldiers and airmen authorized to carry weapons in DC",
    "description": "Defense Secretary Pete Hegseth has authorized National Guard soldiers and airmen to carry arms in D.C. if their mission requires it. This comes amid a Trump administration crackdown on crime.",
    "link": "https://www.foxnews.com/politics/defense-secretary-hegseth-authorizes-2000-national-guard-troops-carry-weapons-dc-necessary-us-official",
    "timestamp": "2025-08-22T14:17:37Z"
  },
  {
    "title": "Education Secretary Linda McMahon snubs Oklahoma’s extremist superintendent of schools",
    "description": "President Donald Trump’s Education Secretary Linda McMahon didn’t want Oklahoma Superintendent Ryan Walters anywhere near her when she toured a charter school in Oklahoma City this week.",
    "link": "https://www.advocate.com/news/linda-mcmahon-snubs-ryan-walters",
    "timestamp": "2025-08-22T14:16:31Z"
  },
  {
    "title": "Trump declares war on clean energy. The numbers show it’s the only thing keeping America’s lights affordable",
    "description": "With electricity prices rising at more than twice the rate of inflation, President Donald Trump has lashed out at renewable energy sources such as wind and solar power, blaming them for skyrocketing energy costs.\nTrump called wind and solar power “THE SCAM OF…",
    "link": "https://biztoc.com/x/a23a2b81b31e099e",
    "timestamp": "2025-08-22T14:15:33Z"
  },
  {
    "title": "Longtime Trump ally formally succeeds Whatley as Republican Party chair",
    "description": "RNC chair Michael Whatley steps down to run for Senate in North Carolina as Trump-endorsed Joe Gruters takes over leading the Republican National Committee",
    "link": "https://www.foxnews.com/politics/longtime-trump-ally-formally-succeeds-whatley-republican-party-chair",
    "timestamp": "2025-08-22T14:14:56Z"
  },
  {
    "title": "Longtime Trump ally Gruters expected to succeed Whatley as Republican Party chair",
    "description": "RNC chair Michael Whatley steps down to run for Senate in North Carolina as Trump-endorsed Joe Gruters takes over leading the Republican National Committee",
    "link": "https://www.foxnews.com/politics/longtime-trump-ally-gruters-expected-succeed-whatley-republican-party-chair",
    "timestamp": "2025-08-22T14:14:56Z"
  },
  {
    "title": "Cracker Barrel CMO Defends Rebrand After Stock Tumbles",
    "description": "The restaurant chain's shares fell 7.2% on Thursday morning, two days after it unveiled its new logo.",
    "link": "https://www.adweek.com/brand-marketing/cracker-barrel-cmo-defends-rebrand-after-stock-tumbles/",
    "timestamp": "2025-08-22T14:12:49Z"
  },
  {
    "title": "Teen Carjacking Suspects Freed After DOGE Staffer Assault",
    "description": "Two suspects in the Washington, D.C., carjacking attack that left a former Trump administration staffer injured were reportedly freed from detention Thursday.",
    "link": "https://dailycaller.com/2025/08/22/teen-carjacking-suspects-freed-after-doge-staffer-assault/",
    "timestamp": "2025-08-22T14:12:35Z"
  },
  {
    "title": "George Conway Crashes FBI Raid of Bolton’s Home, Gives Impromptu Legal Analysis",
    "description": "Attorney George Conway popped up at John Bolton's Maryland home on Friday amid an FBI raid to offer his legal take.\nThe post George Conway Crashes FBI Raid of Bolton’s Home, Gives Impromptu Legal Analysis first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/george-conway-crashes-fbi-raid-of-boltons-home-gives-impromptu-legal-analysis/",
    "timestamp": "2025-08-22T14:11:30Z"
  },
  {
    "title": "Trump attorney makes bold claim after legal blow—but gets 1 basic fact wrong",
    "description": "Alina Habba got a critical fact about the 2024 election wrong.",
    "link": "https://www.nj.com/politics/2025/08/trump-attorney-makes-bold-claim-after-legal-blowbut-gets-1-basic-fact-wrong.html",
    "timestamp": "2025-08-22T14:11:24Z"
  },
  {
    "title": "Powell signals Fed may cut rates soon even as inflation risks remain",
    "description": "Fed Chair Jerome Powell opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the timing.",
    "link": "https://www.bostonherald.com/2025/08/22/powell-signals-interest-rate-cut/",
    "timestamp": "2025-08-22T14:11:06Z"
  },
  {
    "title": "Powell signals Fed may cut rates soon even as inflation risks remain",
    "description": "Fed Chair Jerome Powell opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the timing.",
    "link": "https://www.denverpost.com/2025/08/22/powell-signals-interest-rate-cut/",
    "timestamp": "2025-08-22T14:11:06Z"
  },
  {
    "title": "Feds block yet another NY congressmember from inspecting an ICE facility",
    "description": "U.S. Rep. Paul Tonko at a press conference in April.\n \n\nA dozen congressmembers have sued the Department of Homeland Security over refusal to provide access. [ more › ]",
    "link": "https://gothamist.com/news/feds-block-yet-another-ny-congress-member-from-inspecting-an-ice-facility",
    "timestamp": "2025-08-22T14:11:00Z"
  },
  {
    "title": "Powell Signals Fed May Cut Rates Soon Even As Inflation Risks Remain",
    "description": "The Federal Reserve chair underscored how tariffs are lifting inflation and could push it even higher in the coming months.",
    "link": "https://www.huffpost.com/entry/ap-us-federal-reserve-powell_n_68a87939e4b037ca0b42d5c7",
    "timestamp": "2025-08-22T14:10:21Z"
  },
  {
    "title": "John Bolton, former Trump official critical of president, has home searched",
    "description": "Law enforcement personnel were spotted Friday outside the Washington-area residence belonging to longtime Republican figure John Bolton, a critic of Donald Trump before and after spending 16 months in his first presidential administration.",
    "link": "https://www.cbc.ca/news/world/fbi-john-bolton-search-1.7615428",
    "timestamp": "2025-08-22T14:08:51Z"
  },
  {
    "title": "Powell indicates conditions 'may warrant' interest rate cuts as Fed proceeds 'carefully'",
    "description": "Powell on Friday gave a tepid indication of possible cuts ahead as he noted a high level of uncertainty.",
    "link": "https://www.cnbc.com/2025/08/22/powell-indicates-conditions-may-warrant-interest-rate-cuts-as-fed-proceeds-carefully.html",
    "timestamp": "2025-08-22T14:07:22Z"
  },
  {
    "title": "'Distraction': Lawmaker questions major FBI move on same day as GOP's Epstein release",
    "description": "Rep. Raja Krishnamoorthi (D-IL) accused President Donald Trump of \"weaponizing\" the Department of Justice against his enemies as a distraction from his own scandal.FBI agents raided the home of former national security adviser John Bolton, who's become a Trum…",
    "link": "https://www.rawstory.com/trump-epstein-files-releasee-distraction/",
    "timestamp": "2025-08-22T14:06:37Z"
  },
  {
    "title": "‘Alligator Alcatraz’ Ordered to Close Within 60 Days, Federal Judge Rules",
    "description": "A federal judge in Miami has ordered the migrant detention facility known as \"Alligator Alcatraz\" to wind down operations within the next two months after a local Indian tribe and environmental group voiced environmental concerns at the detention center.\nThe …",
    "link": "https://www.mediaite.com/media/news/alligator-alcatraz-ordered-to-close-within-60-days-federal-judge-rules/",
    "timestamp": "2025-08-22T14:06:05Z"
  },
  {
    "title": "NVIDIA CEO Huang’s Hidden Agenda In Surprise Taiwan Visit Seemingly Revealed By Analyst",
    "description": "NVIDIA CEO Jensen Huang is in Taiwan to discuss tariffs and transfer pricing concerns with TSMC. Huang made headlines earlier today when he gave a small talk to the media after lading in the island. The NVIDIA shared explained that he was in Taiwan to discuss…",
    "link": "https://wccftech.com/nvidia-ceo-huangs-hidden-agenda-in-surprise-taiwan-visit-seemingly-revealed-by-analyst/",
    "timestamp": "2025-08-22T14:04:33Z"
  },
  {
    "title": "White House Releases List of Smithsonian Exhibits It Objects To",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe White House on Thursday released a list of Smithsonian exhibits and artwork it finds objectionable, amid President Donald Trump's criticism of the institution as being too \"woke.\"\nThe list, published with …",
    "link": "https://biztoc.com/x/05f7cc20177a9e79",
    "timestamp": "2025-08-22T14:04:29Z"
  },
  {
    "title": "Powell faces biggest test yet as Trump demands rate cuts",
    "description": "The most powerful person in American finance is about to face his biggest challenge yet. Federal Reserve Chair Jerome Powell steps into the spotlight Friday with a closely watched speech that could determine the economic fate of millions of Americans struggli…",
    "link": "https://rollingout.com/2025/08/22/powell-faces-biggest-test-yet-as-trump/",
    "timestamp": "2025-08-22T14:04:17Z"
  },
  {
    "title": "How the GOP Operatives Behind ‘Ruthless’ Turned a Niche Podcast Into a Right-Wing Media Sensation",
    "description": "With audiences demanding both ideological credibility and independence -- informality and expertise -- Ruthless is uniquely positioned to capitalize.\nThe post How the GOP Operatives Behind ‘Ruthless’ Turned a Niche Podcast Into a Right-Wing Media Sensation fi…",
    "link": "https://www.mediaite.com/media/news/how-the-gop-operatives-behind-ruthless-turned-a-niche-podcast-into-a-right-wing-media-sensation/",
    "timestamp": "2025-08-22T14:03:59Z"
  },
  {
    "title": "Fed's chair signals likely September rate cut as job growth sputters",
    "description": "Federal Reserve Chair Jerome Powell signaled a likely interest rate cut in September, noting \"downside risks\" to employment.",
    "link": "https://www.usatoday.com/story/money/2025/08/22/fed-powell-september-rate-cut/85768429007/",
    "timestamp": "2025-08-22T14:03:53Z"
  },
  {
    "title": "Powell signals Fed may cut rates soon even as inflation risks remain",
    "description": "Federal Reserve Chair Jerome Powell on Friday opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the...",
    "link": "https://finance.yahoo.com/news/powell-signals-fed-may-cut-140332584.html",
    "timestamp": "2025-08-22T14:03:32Z"
  },
  {
    "title": "EXCLUSIVE: Watchdog Slaps Ex-EPA Official Who Ran To Press With Complaint In Biden’s ‘Gold Bars’ Saga",
    "description": "A government watchdog filed an ethics complaint against a former EPA attorney who ran to the press about the Trump admin's criticism of a Biden-era program.",
    "link": "https://dailycaller.com/2025/08/22/exclusive-watchdog-slaps-ex-epa-official-complaint-bidens-gold-bars/",
    "timestamp": "2025-08-22T14:03:15Z"
  },
  {
    "title": "Where is John Bolton’s house — and why is the FBI raiding it?",
    "description": "Former Trump aide John Bolton’s house in Bethesda, Maryland was searched by the FBI in a classified documents probe. Bolton, who has often criticized Donald Trump, was at home during the raid but not arrested. The longtime Republican figure has faced document…",
    "link": "https://economictimes.indiatimes.com/news/international/us/where-is-john-boltons-house-and-why-is-the-fbi-raiding-it/articleshow/123455505.cms",
    "timestamp": "2025-08-22T14:02:24Z"
  },
  {
    "title": "DNC Chair Proposes Major Reforms to Limit Big Money",
    "description": "Larry Cohen\n\n\n\nParty building vs. candidate addiction has never been more urgent.\r\n\n\r\n\n\nThe post DNC Chair Proposes Major Reforms to Limit Big Money appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/democrats-dark-money-dnc-primaries/",
    "timestamp": "2025-08-22T14:02:19Z"
  },
  {
    "title": "FBI raids home of fierce Trump critic who previously served as his national security adviser",
    "description": "Bolton served as Trump’s adviser in his first term and angered the administration with the publication of a highly critical book.",
    "link": "https://www.thejournal.ie/fbi-raids-home-of-john-bolton-former-trump-national-security-adviser-6796949-Aug2025/",
    "timestamp": "2025-08-22T14:02:16Z"
  },
  {
    "title": "White House Releases List of Smithsonian Exhibits It Objects To",
    "description": "The White House has ordered a wide-ranging review of the Smithsonian's museums and exhibitions.",
    "link": "https://www.newsweek.com/white-house-list-smithsonian-exhibits-2117594",
    "timestamp": "2025-08-22T14:00:56Z"
  },
  {
    "title": "Trump’s Pro-Crypto PAC Gets $21 Million Bitcoin Donation From Billionaire Founders",
    "description": "Donald Trump’s new pro-crypto political action committee has received a very large Bitcoin donation that could help shape the future of digital assets in America. Billionaire twins Cameron and Tyler Winklevoss, who are best known as the founders of the Gemini…",
    "link": "http://www.newsbtc.com/news/bitcoin/trump-crypto-bitcoin-donation/",
    "timestamp": "2025-08-22T14:00:41Z"
  },
  {
    "title": "New York Appeals Court Throws Out Trump's $454 Million Civil Fraud Judgment",
    "description": "Donald Trump was convicted of civil fraud in New York in February 2024. He was ordered to pay over $450 million dollars (penalties were added). Obviously, he appealed, and today the Appeals Court threw out the judgment.\nAll five judges agreed the penalty was …",
    "link": "https://crooksandliars.com/2025/08/new-york-appeals-court-throws-out-trumps",
    "timestamp": "2025-08-22T14:00:40Z"
  },
  {
    "title": "Trump declares war on clean energy. The numbers show it’s the only thing keeping America’s lights affordable",
    "description": "The “scam of the century,” according to Trump, is the only thing keeping bills from soaring.",
    "link": "https://fortune.com/2025/08/22/trump-war-clean-energy-fossil-fuels-prices/",
    "timestamp": "2025-08-22T14:00:39Z"
  }
]