[
  {
    "title": "Barack Obama Mocks Donald Trump For Expensive White House Renovations",
    "description": "Former President Barack Obama went right at President Donald Trump over his expensive renovations to the White House while some Medicare patients struggle to find treatment amid the government shutdown. Speaking to a crowd in Virginia over the…",
    "link": "https://www.tmz.com/2025/11/02/obama-mocks-trump-expensive-white-house-renovations/",
    "timestamp": "2025-11-02T23:36:29Z"
  },
  {
    "title": "How the Democrats Can Play Offense",
    "description": "The November/December issue is here.\nThe post How the Democrats Can Play Offense appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/02/editors-note-november-december-issue-how-the-democrats-can-go-on-offense/",
    "timestamp": "2025-11-02T23:33:27Z"
  },
  {
    "title": "Trump says 'could be' US boots on ground in Nigeria",
    "description": "United States President Donald Trump said there \"could be\" US troops on the ground or air strikes in Nigeria, citing the \"record numbers\" of Christian killings there.More to come......",
    "link": "https://biztoc.com/x/d20a067ffd5528f2",
    "timestamp": "2025-11-02T23:33:12Z"
  },
  {
    "title": "Trump: Not considering giving Ukraine Tomahawk missiles",
    "description": "When asked whether his administration is considering providing Ukraine with long-range Tomahawk missiles, United States President Donald Trump said, \"No, not really.\"\"That could change, but at this mo...",
    "link": "https://biztoc.com/x/4656555a9256f305",
    "timestamp": "2025-11-02T23:33:07Z"
  },
  {
    "title": "Dave Ramsey Says We Keep Electing The 'Same Morons' To Congress. If They Worked For You, You'd 'Fire Their Butt' For Incompetence",
    "description": "Personal finance expert Dave Ramsey delivered a sharp critique during a 2022 episode of “The Ramsey Show,” where he slammed Congress for what he called...",
    "link": "https://finance.yahoo.com/news/dave-ramsey-says-keep-electing-233150397.html",
    "timestamp": "2025-11-02T23:31:50Z"
  },
  {
    "title": "Draining the Online Swamp",
    "description": "Instead of accepting the existing digital political battlefield as inevitable, Democrats should challenge it as a root cause of our dysfunctional politics, and vow to be the party that cleans it up.\nThe post Draining the Online Swamp appeared first on Washing…",
    "link": "http://washingtonmonthly.com/2025/11/02/social-media-reform-democrats/",
    "timestamp": "2025-11-02T23:31:09Z"
  },
  {
    "title": "Trump Defends ICE Raids in CBS Interview, Says ‘They Haven’t Gone Far Enough’",
    "description": "“We have to start off with a policy, and the policy has to be that ‘you came into the country illegally, you’re going to go out.\"\nThe post Trump Defends ICE Raids in CBS Interview, Says ‘They Haven’t Gone Far Enough’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-defends-ice-raids-in-cbs-interview-says-they-havent-gone-far-enough/",
    "timestamp": "2025-11-02T23:30:55Z"
  },
  {
    "title": "How Democrats Can Save Social Security—and Win Elections",
    "description": "The trust fund can be rescued from insolvency without unpopular taxes on workers, and with significant benefit to economic productivity and the security of the middle class.\nThe post How Democrats Can Save Social Security—and Win Elections appeared first on W…",
    "link": "http://washingtonmonthly.com/2025/11/02/how-democrats-can-save-social-security-and-win-elections/",
    "timestamp": "2025-11-02T23:29:30Z"
  },
  {
    "title": "Rural Revival",
    "description": "With the onset of the Great Depression, the United States appeared on the verge of political revolt in rural areas. For half a century, rural people had felt increasingly marginalized by changes in American society and the economy and ignored by political lea…",
    "link": "http://washingtonmonthly.com/2025/11/02/rural-divide-democrats-fdr-trump/",
    "timestamp": "2025-11-02T23:27:50Z"
  },
  {
    "title": "Gov. JB Pritzker tells President Donald Trump to 'f--- all the way off' in viral video",
    "description": "Gov. JB Pritzker told President Donald Trump and his Republican allies to “f--- right off” during a speech last month before Illinois’ largest teachers union. Video of Pritzker’s F-bomb started gaining traction on social media Sunday, two weeks after the Demo…",
    "link": "https://freerepublic.com/focus/f-news/4350312/posts",
    "timestamp": "2025-11-02T23:27:03Z"
  },
  {
    "title": "Trump’s Industrial Policy: What’s Right and Wrong",
    "description": "The president uses government leverage to extract equity stakes, profit-sharing deals, and special voting rights from major corporations. These are familiar tools—but Trump’s unchecked dealmaking could be disastrous.\nThe post Trump’s Industrial Policy: What’s…",
    "link": "http://washingtonmonthly.com/2025/11/02/trumps-industrial-policies-whats-right-and-wrong/",
    "timestamp": "2025-11-02T23:25:19Z"
  },
  {
    "title": "Analysis: How much could the federal government shutdown cost the economy?",
    "description": "In past shutdowns, estimates of lost economic activity have reached into the billions of dollars. In the context of a $30 trillion economy, that’s not a lot. But on the margins, economists say it can have an effect.",
    "link": "https://www.pbs.org/newshour/politics/analysis-how-much-could-the-federal-government-shutdown-cost-the-economy",
    "timestamp": "2025-11-02T23:24:44Z"
  },
  {
    "title": "How to Crush the American Battery Boom",
    "description": "Biden policies put the U.S. in a strong position, but Trump is destroying the American battery industry and good American jobs.\nThe post How to Crush the American Battery Boom appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/02/how-to-crush-the-american-battery-boom/",
    "timestamp": "2025-11-02T23:23:49Z"
  },
  {
    "title": "Trump says US immigration raids 'haven't gone far enough'",
    "description": "Since returning to the White House in January, Trump has pushed for a massive wave of deportations, a hallmark of his 2024 presidential campaign.",
    "link": "https://www.channelnewsasia.com/world/us-president-donald-trump-us-immigration-raids-ice-havent-gone-far-enough-5441176",
    "timestamp": "2025-11-02T23:23:00Z"
  },
  {
    "title": "Trump Promised a Shipbuilding Boom. He’s Sinking It Instead",
    "description": "After pledging to restore America’s maritime might, the president has gutted the very offices, funding streams, and foreign partnerships that could have made it possible.\nThe post Trump Promised a Shipbuilding Boom. He’s Sinking It Instead appeared first on W…",
    "link": "http://washingtonmonthly.com/2025/11/02/trump-promised-a-shipbuilding-boom-hes-sinking-it-instead/",
    "timestamp": "2025-11-02T23:21:56Z"
  },
  {
    "title": "Trump Scoffs at Zohran Mamdani Comparison: ‘I’m a Much Better Looking Person’",
    "description": "President Donald Trump scoffed at a comparison between himself and NYC mayoral frontrunner Zohran Mamdani, saying one difference is he is \"much better looking\"\nThe post Trump Scoffs at Zohran Mamdani Comparison: ‘I’m a Much Better Looking Person’ first appear…",
    "link": "https://www.mediaite.com/media/trump-scoffs-at-zohran-mamdani-comparison-im-a-much-better-looking-person/",
    "timestamp": "2025-11-02T23:18:08Z"
  },
  {
    "title": "'We're Not A Violent City': Chicago's Locals Take On ICE Block-By-Block",
    "description": "The city's patchwork of close-knit neighborhoods has created a type of zone defense meant to slow immigration agents and even force them to withdraw.",
    "link": "https://www.huffpost.com/entry/chicago-locals-take-on-ice-block_n_6907de1ae4b00afef15f36bb",
    "timestamp": "2025-11-02T23:16:41Z"
  },
  {
    "title": "Pure Evil: Sister of Slain Firefighter Corey Comperatore Receives Vile Letter Mocking His Death — Signed and Sent Proudly by “Another Deranged Democrat”",
    "description": "A hateful handwritten letter sent to Kelly Comperatore Meeder, the sister of fallen firefighter Corey Comperatore Kelly Comperatore Meeder, the sister of fallen firefighter Corey Comperatore, who was tragically killed during the assassination attempt on Presi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350310/posts",
    "timestamp": "2025-11-02T23:15:13Z"
  },
  {
    "title": "Ex-ISIS Envoy Who Killed Americans In Iraq To Be Hosted At White House This Month",
    "description": "Ex-ISIS Envoy Who Killed Americans In Iraq To Be Hosted At White House This Month\n \nPresident Donald Trump is set to host Syria's self-appointed interim leader later this month for talks in Washington, marking the first ever visit by a Syrian head of state to…",
    "link": "https://biztoc.com/x/d7f21bfc9de72d0e",
    "timestamp": "2025-11-02T23:11:01Z"
  },
  {
    "title": "Trump held 'Gatsby'-themed Halloween party as SNAP benefits were due to be cut off (USA Today)",
    "description": "USA Today:\nTrump held ‘Gatsby’-themed Halloween party as SNAP benefits were due to be cut off  —  President Donald Trump hosted a 1920's theme party at Mar-A-Lago on Oct. 31, as multiple federal judges ruled the administration could not stop funding food aid …",
    "link": "https://www.memeorandum.com/251102/p72",
    "timestamp": "2025-11-02T23:10:01Z"
  },
  {
    "title": "Donald Trump Suggests Seth Meyers' Jokes About Him Might Be Illegal",
    "description": "Donald Trump says Seth Meyers is such a hater that it might even be illegal ... ripping into the star in another Truth Social rant. The President of the United States shared his raw thoughts about \"Late Night With Seth Meyers\" host Saturday ...…\n Permalink",
    "link": "https://www.tmz.com/2025/11/02/donald-trump-suggests-seth-meyers-comments-about-him-might-be-illegal/",
    "timestamp": "2025-11-02T23:02:33Z"
  },
  {
    "title": "USDA Tells Grocery Stores They Can't Give Discounts to People Hit by Trump's Food Stamp Freeze",
    "description": "As the Trump administration continued its illegal freeze on food assistance, the US Department of Agriculture sent a warning to grocery stores not to provide discounts to the more than 42 million Americans affected.Several grocery chains and food delivery app…",
    "link": "https://www.commondreams.org/news/usda-tells-grocery-stores-they-can-t-give-discounts-to-people-hit-by-trump-s-food-stamp-freeze",
    "timestamp": "2025-11-02T23:02:21Z"
  },
  {
    "title": "SNAP benefits cut off during shutdown, driving long lines at food pantries",
    "description": "Long lines have formed at food pantries across the U.S. as federal food benefits were cut off due to the government shutdown",
    "link": "https://abcnews.go.com/Health/wireStory/snap-benefits-cut-off-shutdown-driving-long-lines-127096897",
    "timestamp": "2025-11-02T23:01:30Z"
  },
  {
    "title": "‘IITians should transform their viewpoint from being job seekers to being job creators’: IIT Kharagpur director at Idea Exchange",
    "description": "A mechanical engineer by training, he is known for his work in fluid mechanics, biomedical engineering and affordable health and diagnostics",
    "link": "https://indianexpress.com/article/idea-exchange/suman-chakraborty-at-idea-exchange-iitians-should-transform-their-viewpoint-from-being-job-seekers-to-being-job-creators-10342290/",
    "timestamp": "2025-11-02T23:00:20Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Democrats have an early lead in next year’s battle for control of Congress amid an ongoing government shutdown, as more voters say President Donald Trump has not lived up to their expectations on several major issues that propelled him back to the White House…",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-november-2-rcna241207",
    "timestamp": "2025-11-02T23:00:00Z"
  },
  {
    "title": "Trump’s New Nuke Tests Won’t Include ‘Explosions’ or ‘Mushroom Clouds,’ Energy Secretary Admits",
    "description": "Chris Wright declared Sunday that Donald Trump's order to start testing the U.S. nuclear arsenal will not include nuclear \"explosions\" in the Nevada desert.\nThe post Trump’s New Nuke Tests Won’t Include ‘Explosions’ or ‘Mushroom Clouds,’ Energy Secretary Admi…",
    "link": "https://www.mediaite.com/media/news/trumps-new-nuke-tests-wont-include-explosions-or-mushroom-clouds-energy-secretary-admits/",
    "timestamp": "2025-11-02T22:58:06Z"
  },
  {
    "title": "Nicki Minaj Sings Trump’s Praises For His Nigeria Comments",
    "description": "The rap superstar said the president’s comments about the West African country gave her a “deep sense of gratitude.”",
    "link": "https://www.huffpost.com/entry/nicki-minaj-trump-nigeria-christian-killings_n_690785c9e4b05a8637e7e2f8",
    "timestamp": "2025-11-02T22:50:25Z"
  },
  {
    "title": "US energy secretary reveals details about nuclear weapon tests",
    "description": "The nuclear weapons tests ordered by President Donald Trump would not involve nuclear explosions, the US energy chief said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627265-us-energy-secretary-nuclear-tests/",
    "timestamp": "2025-11-02T22:49:32Z"
  },
  {
    "title": "Trump’s nuclear weapons tests will involve ‘noncritical explosions,’ not atomic blasts, energy secretary says",
    "description": "New tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions, Energy Secretary Chris Wright said Sunday.\nIt was the first clarity from the Trump administration since the president took to social media l…",
    "link": "https://biztoc.com/x/6680b536bfb33c1c",
    "timestamp": "2025-11-02T22:48:49Z"
  },
  {
    "title": "Trump renews call to remove Omar after Somali allegiance comments",
    "description": "Trump shares footage of Rep. Ilhan Omar saying “Somalia is our home” during a Minnesota rally, urging her to “go back” to Somalia.US President Donald Trump on Saturday criticized Rep. Ilhan Omar (D-MN), a member of “The Squad” of anti-Israel Democrats, in a p…",
    "link": "https://freerepublic.com/focus/f-news/4350304/posts",
    "timestamp": "2025-11-02T22:43:25Z"
  },
  {
    "title": "Trump confirms he's helping Scott Adams get cancer treatment: 'On it'",
    "description": "President Donald Trump on Sunday publicly confirmed that he was working to help \"Dilbert\" creator Scott Adams secure treatment for prostate cancer. Adams publicly reached out to Trump seeking his aid the same day. Trump promptly responded by sharing Adams's p…",
    "link": "https://freerepublic.com/focus/f-news/4350303/posts",
    "timestamp": "2025-11-02T22:42:59Z"
  },
  {
    "title": "Trump says he is ‘on it’ after ‘Dilbert’ creator Scott Adams pleads for lifesaving help",
    "description": "The news comes after Adams, a supporter of Trump, previewed on X that he would ask the president for help receiving a treatment that would “give me a...",
    "link": "https://www.cnn.com/2025/11/02/politics/trump-dilbert-scott-adams-cancer",
    "timestamp": "2025-11-02T22:37:41Z"
  },
  {
    "title": "Faced with footage of ICE tear gassing residential streets and tackling young women, Trump said that his agents have been ‘held back’ in their tactics by liberal judges.",
    "description": "Donald Trump has stood by the growing violence of ICE raids across the country—and said that only “liberal judges” are standing in the way of them getting ev...",
    "link": "https://www.thedailybeast.com/trump-says-his-bloody-ice-raids-havent-gone-far-enough/",
    "timestamp": "2025-11-02T22:37:39Z"
  },
  {
    "title": "Apple Gears Up For A Pivotal Year With Major Product Releases And Challenges",
    "description": "As 2026 approaches, Apple is gearing up for a critical year filled with significant product launches and potential executive changes, all while grappling with regulatory and tariff-related challenges.",
    "link": "https://www.benzinga.com/markets/tech/25/11/48581363/apple-gears-up-for-a-pivotal-year-with-major-product-releases-and-challenges",
    "timestamp": "2025-11-02T22:37:04Z"
  },
  {
    "title": "Hamas Hands Over 3 More Hostages' Bodies As Israeli Airstrike Kills Palestinian Man",
    "description": "The Red Cross is transporting the remains while Israel and Hamas trade blame over repeated violations of the shaky Gaza truce.",
    "link": "https://www.huffpost.com/entry/hamas-hands-over-3-more-hostages-israel-airstrike-palestine-gaza_n_6907d70ee4b0c4a0f50978a0",
    "timestamp": "2025-11-02T22:36:28Z"
  },
  {
    "title": "Trump: ICE Raids 'Haven't Gone Far Enough'",
    "description": "On Sunday, CBS released a preview clip of President Donald Trump's interview, scheduled to air later on \"60 Minutes,\" in which he discussed his immigration policy.\nThe post Trump: ICE Raids ‘Haven’t Gone Far Enough’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/02/trump-ice-raids-havent-gone-far-enough/",
    "timestamp": "2025-11-02T22:35:06Z"
  },
  {
    "title": "Trump’s nuclear weapons tests will involve ‘noncritical explosions,’ not atomic blasts, energy secretary says",
    "description": "The planned testing involves “all the other parts of a nuclear weapon to make sure they deliver the appropriate geometry and they set up the nuclear explosion.”",
    "link": "https://fortune.com/2025/11/02/trump-nuclear-weapons-tests-noncritical-explosions-energy-secretary/",
    "timestamp": "2025-11-02T22:34:58Z"
  },
  {
    "title": "Trump Tells ’60 Minutes’ ICE Raid Tactics of Tear Gas, Breaking Car Windows ‘Haven’t Gone Far Enough’ | Video",
    "description": "The president adds that he approves of the brute use of force \"because you have to get the people out\"\nThe post Trump Tells ’60 Minutes’ ICE Raid Tactics of Tear Gas, Breaking Car Windows ‘Haven’t Gone Far Enough’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-60-minutes-ice-raid-havent-gone-far-enough-video/",
    "timestamp": "2025-11-02T22:17:25Z"
  },
  {
    "title": "Trump says Mamdani 'far worse than a socialist'",
    "description": "United States President Donald Trump labeled New York City mayoral frontrunner Zohran Mamdani as being \"far worse than a socialist,\" in his interview with CBS News' \"60 Minutes.\"More to come......",
    "link": "https://biztoc.com/x/a5c53ac182c9c1ec",
    "timestamp": "2025-11-02T22:15:43Z"
  },
  {
    "title": "Newsom says he saw nothing to suggest Biden couldn't serve through 2029 in NBC interview",
    "description": "Gov. Gavin Newsom, D-Calif., was pressed by NBC News host Kristen Welker on whether he thought former President Joe Biden could have served through 2029, his defense of the former president and Kamala Harris' failed campaign during \"Meet the Press\" on Sunday.…",
    "link": "https://freerepublic.com/focus/f-news/4350299/posts",
    "timestamp": "2025-11-02T22:14:01Z"
  },
  {
    "title": "Trump Insists ICE Raids Haven’t ‘Gone Far Enough’ and Are Stifled By ‘Liberal Judges’ During Stern ’60 Minutes’ Interview",
    "description": "President Trump said he would like to see ICE get even more aggressive deporting people but that its being thwarted by \"liberal judges,\" while on \"60 Minutes\"\nThe post Trump Insists ICE Raids Haven’t ‘Gone Far Enough’ and Are Stifled By ‘Liberal Judges’ Durin…",
    "link": "https://www.mediaite.com/politics/trump-insists-ice-raids-havent-gone-far-enough-and-are-stifled-by-liberal-judges-during-stern-60-minutes-interview/",
    "timestamp": "2025-11-02T22:10:08Z"
  },
  {
    "title": "Trump's testing plans for US nuclear weapons won't include explosions, energy secretary says",
    "description": "Energy Secretary Chris Wright says that new tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions",
    "link": "https://abcnews.go.com/US/wireStory/trumps-testing-plans-us-nuclear-weapons-include-explosions-127116261",
    "timestamp": "2025-11-02T22:05:54Z"
  },
  {
    "title": "Airyn De Niro Says Dad Robert De Niro Has Been 'Non-Stop' Supportive of His Transition",
    "description": "Airyn De Niro says His actor dad Robert De Niro has been \"non-stop\" supportive since Airyn came out as transgender.\nThe post Airyn De Niro Says Dad Robert De Niro Has Been ‘Non-Stop’ Supportive of His Transition appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/11/02/airyn-de-niro-says-dad-robert-de-niro-has-been-non-stop-supportive-of-his-transition/",
    "timestamp": "2025-11-02T22:02:03Z"
  },
  {
    "title": "Trump quips: I can’t imagine we didn’t do better with the Jewish vote",
    "description": "President Trump addresses Republican Jewish Coalition’s Annual Leadership Summit, touts his record on Israel, national security, and fighting antisemitism: “Israel has never had a better friend than President Donald J. Trump.”",
    "link": "https://www.israelnationalnews.com/news/417196",
    "timestamp": "2025-11-02T22:01:09Z"
  },
  {
    "title": "What Zohran Mamdani’s Bid for Mayor Reveals About Being Muslim in America",
    "description": "Rozina Ali writes about the Islamophobic attacks on the candidate, which carry the weight of history and the urgency of the present.",
    "link": "https://www.newyorker.com/news/the-lede/what-zohran-mamdanis-bid-for-mayor-reveals-about-being-muslim-in-america",
    "timestamp": "2025-11-02T22:00:20Z"
  },
  {
    "title": "Trump’s Trip to Asia Signals Second Term China Policy",
    "description": "President Donald Trump recently wrapped up a crucial weeklong trip to Asia, including a significant summit with Xi Jinping, General Secretary of the Communist Party... Read More\nThe post Trump’s Trip to Asia Signals Second Term China Policy appeared first on …",
    "link": "https://www.dailysignal.com/2025/11/02/trumps-trip-to-asia-signals-second-term-china-policy/",
    "timestamp": "2025-11-02T22:00:00Z"
  },
  {
    "title": "Colombia’s ELN rebels face US drug threats amid push for peace talks",
    "description": "The US focus on drugs and nearby Venezuela brings an international dimension to what was an internal Colombian conflict.",
    "link": "https://www.aljazeera.com/news/2025/11/2/colombias-eln-rebels-face-us-drug-threats-amid-push-for-peace-talks",
    "timestamp": "2025-11-02T21:59:30Z"
  },
  {
    "title": "Trump's Testing Plans For U.S. Nuclear Weapons Won't Include Explosions, Energy Secretary Says",
    "description": "Energy Secretary Chris Wright says that new tests of the U.S. nuclear weapons system ordered up by President Donald Trump will not include nuclear explosions.",
    "link": "https://www.huffpost.com/entry/us-trump-nuclear-tests_n_6907d183e4b00afef15f3137",
    "timestamp": "2025-11-02T21:52:32Z"
  },
  {
    "title": "Newsom says he saw nothing to suggest Biden couldn't serve through 2029 in NBC interview",
    "description": "Gov. Gavin Newsom defended former President Joe Biden's mental fitness in an NBC interview, addressing concerns about misleading voters on former president's capabilities.",
    "link": "https://www.foxnews.com/media/newsom-says-he-saw-nothing-suggest-biden-couldnt-serve-through-2029-nbc-interview",
    "timestamp": "2025-11-02T21:44:55Z"
  },
  {
    "title": "Trump: ICE raids haven't gone far enough",
    "description": "United States President Donald Trump said that Immigration and Customs Enforcement (ICE) raids \"haven't gone far enough\" when questioned about some of the more forceful examples of the agency's measur...",
    "link": "https://biztoc.com/x/ff16f00c98bb3af6",
    "timestamp": "2025-11-02T21:42:33Z"
  },
  {
    "title": "Ohtani, Yamamoto make Japan proud helping Dodgers repeat as World Series champions",
    "description": "Sunday morning in Japan began with a palpable buzz after the Los Angeles Dodgers announced Shohei Ohtani would start Game 7 of the World Series. By the time countryman Yoshinobu Yamamoto delivered the final out, Tokyo was erupting with joy. “I am so proud tod…",
    "link": "https://japantoday.com/category/sports/ohtani-yamamoto-make-japan-proud-helping-dodgers-repeat-as-world-series-champions",
    "timestamp": "2025-11-02T21:42:06Z"
  },
  {
    "title": "AOC Claims Most Americans Are ‘Disgusted’ by Trump — Less Than a Year After His Landslide Victory! (VIDEO)",
    "description": "New York Congresswoman Alexandria Ocasio-Cortez (AOC) has claimed that the majority of Americans are “disgusted” by President Trump.\nThe post AOC Claims Most Americans Are ‘Disgusted’ by Trump — Less Than a Year After His Landslide Victory! (VIDEO) appeared f…",
    "link": "https://www.thegatewaypundit.com/2025/11/aoc-claims-most-americans-are-disgusted-trump-less/",
    "timestamp": "2025-11-02T21:40:52Z"
  },
  {
    "title": "Nigeria says U.S. help against Islamist insurgents must respect its sovereignty",
    "description": "Nigeria said on Sunday it would welcome U.S. help in fighting Islamist insurgents as long as its territorial integrity is respected, responding to threats of military action by  President Donald Trump over what he said was the ill-treatment of Christians in t…",
    "link": "https://japantoday.com/category/world/nigeria-says-u.s.-help-against-islamist-insurgents-must-respect-its-sovereignty",
    "timestamp": "2025-11-02T21:39:04Z"
  },
  {
    "title": "Israel warns of intensifying attacks against Hezbollah",
    "description": "Israel on Sunday signalled it could intensify operations in Lebanon against Hezbollah, which Israeli Prime Minister Benjamin Netanyahu accused of rearming, urging Beirut to disarm the Iran-backed group. Despite a November 2024 ceasefire with the Lebanese mili…",
    "link": "https://japantoday.com/category/world/israel-warns-of-intensifying-attacks-against-hezbollah",
    "timestamp": "2025-11-02T21:38:29Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "Republicans and Democrats remained at a stalemate on the government shutdown over the weekend as it headed into its sixth week, with food aid potentially delayed or suspended for millions of Americans and President Donald Trump pushing GOP leaders to change S…",
    "link": "https://japantoday.com/category/world/shutdown-stalemate-set-to-drag-into-sixth-week-as-trump-pushes-republicans-to-change-senate-rules",
    "timestamp": "2025-11-02T21:38:16Z"
  },
  {
    "title": "DNC chair defends party's redistricting push: This isn't 'your grandfather's Democratic Party that just rolled over'",
    "description": "Democratic National Committee Chair Ken Martin defended California’s redistricting efforts while criticizing Republicans’ own efforts as unconstitutional.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-dnc-chair-defends-california-redistricting-push-rcna241412",
    "timestamp": "2025-11-02T21:21:15Z"
  },
  {
    "title": "Newsom accuses Trump of 'rigging' 2026 midterm elections ahead of Prop 50 vote",
    "description": "California Gov. Gavin Newsom on Sunday renewed his call for support of a ballot initiative that would redraw congressional voting maps in the state.",
    "link": "https://www.upi.com/Top_News/US/2025/11/02/newsom-rules-of-game-have-changed/3931762116222/",
    "timestamp": "2025-11-02T21:18:26Z"
  },
  {
    "title": "Trump Warns Nigeria: US 'Guns-a-Blazing' if Christian Killings Continue",
    "description": "President Donald Trump on Saturday said he's ordered the Pentagon to begin planning for potential military action in Nigeria as he stepped up his criticism that the government is failing to rein in the persecution of Christians in the West African country. \"I…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350292/posts",
    "timestamp": "2025-11-02T21:14:36Z"
  },
  {
    "title": "Google pulls Gemma from AI Studio after Senator Blackburn accuses model of defamation | TechCrunch",
    "description": "Senator Martha Blackburn argued Gemma’s fabrications are “not a harmless ‘hallucination,’\" but rather “an act of defamation produced and distributed by a Google-owned AI model.”",
    "link": "https://techcrunch.com/2025/11/02/google-pulls-gemma-from-ai-studio-after-senator-blackburn-accuses-model-of-defamation/",
    "timestamp": "2025-11-02T21:14:06Z"
  },
  {
    "title": "'Voters are disgusted': Ex-Trump lawyer claims GOP 'imploding' from 'reflexive' cruelty",
    "description": "One of President Donald Trump's former attorneys claimed on Sunday that the GOP appears to be \"imploding\" ahead of the midterm election because voters are getting sick of the party's \"reflexive\" cruelty.Michael Cohen, the former attorney for the Trump Organiz…",
    "link": "https://www.rawstory.com/michael-cohen-2674257947/",
    "timestamp": "2025-11-02T21:08:29Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "President Donald Trump says he “won’t be extorted” by Democrats to reopen the government, making clear that he has no plans to negotiate as the government shutdown will soon enter its sixth week.",
    "link": "https://www.click2houston.com/news/politics/2025/11/02/shutdown-stalemate-set-to-drag-into-sixth-week-as-trump-pushes-republicans-to-change-senate-rules/",
    "timestamp": "2025-11-02T21:08:16Z"
  },
  {
    "title": "Mike Benz: Here are 3 criminal charges James Boasberg committed in Arctic Frost scandal for which Pam Bondi could immediately arrest the crooked judge",
    "description": "Sen. Ted Cruz: 'I am right now calling on the House of Representatives to impeach Judge Boasberg'",
    "link": "https://www.wnd.com/2025/11/mike-benz-here-are-3-criminal-charges-james/",
    "timestamp": "2025-11-02T21:08:04Z"
  },
  {
    "title": "Jennifer Lawrence Says Criticizing Trump Adds ‘Fuel to a Fire Ripping the Country Apart’: ‘Celebrities Don’t Make a Difference on Who People Vote For’",
    "description": "Actress Jennifer Lawrence spent years pushing left-wing policies, trashing Republicans, and smearing President Donald Trump. Now she says it is beginning to dawn on her that celebrities constantly spouting off about politics not only hurts the film industry, …",
    "link": "https://www.breitbart.com/entertainment/2025/11/02/jennifer-lawrence-says-criticizing-trump-adds-fuel-to-a-fire-ripping-the-country-apart-celebrities-dont-make-a-difference-on-who-people-vote-for/",
    "timestamp": "2025-11-02T21:04:45Z"
  },
  {
    "title": "Fetterman Salutes ‘Gracious’ President Trump — In Fox News Interview With Lara Trump",
    "description": "John Fetterman revealed he had a great time having dinner with a \"gracious\" and \"pleasant\" President Trump in a Fox News interview with Lara Trump\nThe post Fetterman Salutes ‘Gracious’ President Trump — In Fox News Interview With Lara Trump first appeared on …",
    "link": "https://www.mediaite.com/politics/fetterman-salutes-gracious-president-trump-in-fox-news-interview-with-lara-trump/",
    "timestamp": "2025-11-02T21:03:39Z"
  },
  {
    "title": "Dilbert Creator Scott Adams Appeals For Trump’s Help With New Cancer Drug",
    "description": "Scott Adams asked President Trump to intervene with his health insurance provider after it failed to schedule a potentially life-saving cancer treatment.",
    "link": "https://dailycaller.com/2025/11/02/dilbert-creator-scott-adams-appeals-for-trumps-help-with-new-cancer-drug/",
    "timestamp": "2025-11-02T21:01:43Z"
  },
  {
    "title": "Revolving door of blue city repeat offenders keep being released as DA spent time prosecuting Trump",
    "description": "Manhattan DA Alvin Bragg's lenient policies allow repeat offenders to terrorize NYC streets. Cases include criminals with 134+ arrests walking free under bail reform.",
    "link": "https://www.foxnews.com/us/revolving-door-blue-city-repeat-offenders-keep-being-released-da-spent-time-prosecuting-trump",
    "timestamp": "2025-11-02T21:00:31Z"
  },
  {
    "title": "Trump says Xi assured him China won’t take action on Taiwan",
    "description": "US president claims Chinese leader would never act on Taiwan while he's in office 'because they know the consequences'.",
    "link": "https://www.aljazeera.com/news/2025/11/2/trump-says-xi-assured-him-china-wont-take-action-on-taiwan",
    "timestamp": "2025-11-02T20:59:10Z"
  },
  {
    "title": "Cybertruck fleet to patrol Las Vegas",
    "description": "The nation's largest police fleet of Tesla Cybertrucks is set to begin patrolling the streets of Las Vegas in November thanks to a donation from a U.S. tech billionaire, raising concerns about the blurring of lines between public and private interests.",
    "link": "https://www.bostonherald.com/2025/11/02/cybertruck-fleet-to-patrol-las-vegas/",
    "timestamp": "2025-11-02T20:53:20Z"
  },
  {
    "title": "DHS: Florida Man Arrested for Online Posts Threatening to Kill 'ICE Nazis'",
    "description": "A man in Fort Myers, Florida, is accused of making online death threats against U.S. Immigration and Customs Enforcement (ICE) officers.\nThe post DHS: Florida Man Arrested for Online Posts Threatening to Kill ‘ICE Nazis’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/11/02/dhs-florida-man-arrested-for-online-posts-threatening-to-kill-ice-nazis/",
    "timestamp": "2025-11-02T20:50:31Z"
  },
  {
    "title": "Ex-White House Doctor Calls Out Red Flag in Trump Health Saga - NewsBreak",
    "description": "A top doctor to three U.S. presidents is calling BS on the MAGA administration’s claims that 79-year-old Donald Trump is still in the prime of his life. Je",
    "link": "https://www.newsbreak.com/share/4327814852860-ex-white-house-doctor-calls-out-red-flag-in-trump-health-saga?_f=app_share&amp;pd=0KoS5WQ9&amp;lang=en_US&amp;send_time=1762116468&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.43.0.53%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-02T20:48:53Z"
  },
  {
    "title": "White House Unveils Details Of U.S.-China Deal, Including Resolution To Nexperia Auto Chip Crisis",
    "description": "White House Unveils Details Of U.S.-China Deal, Including Resolution To Nexperia Auto Chip Crisis\n \nThe White House on Saturday unveiled a comprehensive breakdown of the U.S.-China trade and economic deal reached by President Donald Trump and President Xi Jin…",
    "link": "https://biztoc.com/x/e74538f1ffe3e9dd",
    "timestamp": "2025-11-02T20:47:25Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "Republicans and Democrats remained at a stalemate on the government shutdown over the weekend as it headed into its sixth week, with millions of Americans starting to lose food aid benefits and President Donald Trump pushing GOP leaders to change Senate rules…",
    "link": "https://apnews.com/article/shutdown-trump-senate-filibuster-c9c5e0ac3759e707c7a990b1562fb8ad",
    "timestamp": "2025-11-02T20:43:40Z"
  },
  {
    "title": "Karoline Leavitt GOES OFF on Democrats on Day 33 of Schumer Shutdown (VIDEO)",
    "description": "White House Press Secretary Karoline Leavitt was on “Sunday Morning Futures” with host Maria Bartiromo to discuss the government shutdown.\nThe post Karoline Leavitt GOES OFF on Democrats on Day 33 of Schumer Shutdown (VIDEO) appeared first on The Gateway Pund…",
    "link": "https://www.thegatewaypundit.com/2025/11/press-secretary-karoline-leavitt-weighs-government-shutdown-radical/",
    "timestamp": "2025-11-02T20:40:07Z"
  },
  {
    "title": "US not planning nuclear explosions at this time, energy secretary says (Doina Chiacu/Reuters)",
    "description": "Doina Chiacu / Reuters:\nUS not planning nuclear explosions at this time, energy secretary says  —  The nuclear weapons testing ordered by U.S. President Donald Trump will not involve nuclear explosions at this time, Energy Secretary Chris Wright said on Sunda…",
    "link": "https://www.memeorandum.com/251102/p61",
    "timestamp": "2025-11-02T20:40:00Z"
  },
  {
    "title": "Apple Gears Up For A Pivotal Year With Major Product Releases And Challenges",
    "description": "As 2026 approaches, tech behemoth Apple Inc. (NASDAQ:AAPL) is gearing up for a critical year filled with significant product launches and potential executive...",
    "link": "https://finance.yahoo.com/news/apple-gears-pivotal-major-product-203704480.html",
    "timestamp": "2025-11-02T20:37:04Z"
  },
  {
    "title": "Trump held 'Gatsby'-themed Halloween party as SNAP benefits were due to be cut off",
    "description": "President Donald Trump held a \"Roaring 20's\" themed party as food aid for 42 million low-income Americans was set to expire.",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/02/trump-gatsby-1920s-party/87052157007/",
    "timestamp": "2025-11-02T20:36:35Z"
  },
  {
    "title": "Wright says no nuclear test explosions from US for now",
    "description": "United States Energy Secretary Chris Wright signaled on Sunday that, for now, Washington doesn't plan to include nuclear explosions in the nuclear weapons testing ordered by US President Donald Trump....",
    "link": "https://biztoc.com/x/ffe703981f19c22c",
    "timestamp": "2025-11-02T20:36:22Z"
  },
  {
    "title": "Pure evil: Sister of slain firefighter Corey Comperatore receives vile letter mocking his death, sent proudly by ‘another deranged Democrat’",
    "description": "'Can you even fathom this kind of visciousness? Imagine being so proud of it that you sign it with your first and last name, AND affix a return address label to it!'",
    "link": "https://www.wnd.com/2025/11/pure-evil-sister-slain-firefighter-corey-comperatore-receives/",
    "timestamp": "2025-11-02T20:36:11Z"
  },
  {
    "title": "U.S. kills three people in latest strike against an alleged drug boat",
    "description": "The United States killed three people in its latest strike against alleged drug trafficking boats in the Caribbean, U.S. Defense Secretary Pete Hegseth has...",
    "link": "https://www.upi.com/Top_News/US/2025/11/02/us-kills-three-people-drug-boat-bombing/2681762113734/",
    "timestamp": "2025-11-02T20:35:54Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "President Donald Trump says he “won’t be extorted” by Democrats to reopen the government, making clear that he has no plans to negotiate as the government shutdown will soon enter its sixth week.",
    "link": "https://www.news4jax.com/news/politics/2025/11/02/shutdown-stalemate-set-to-drag-into-sixth-week-as-trump-pushes-republicans-to-change-senate-rules/",
    "timestamp": "2025-11-02T20:35:32Z"
  },
  {
    "title": "Nato 'will stand with Ukraine' to get long-lasting peace, senior official tells BBC",
    "description": "Admiral Giuseppe Cavo Dragone tells the BBC the Russia-Ukraine war is bogged down, and it is \"almost time to sit and talk\".",
    "link": "https://www.bbc.com/news/articles/czxng7kxnp9o",
    "timestamp": "2025-11-02T20:34:19Z"
  },
  {
    "title": "What to expect in Colorado on Election Day",
    "description": "Colorado’s new free school meals program will face a key test when voters decide two statewide ballot measures that would put the program on sounder financial footing, mostly by raising taxes on high-income individuals.",
    "link": "https://www.pbs.org/newshour/politics/what-to-expect-in-colorado-on-election-day",
    "timestamp": "2025-11-02T20:32:11Z"
  },
  {
    "title": "Whiny Titty Baby Deems 'Anti Trump' Comedy Sketches 'PROBABLY ILLEGAL!!!'",
    "description": "To The Precious President, being anti-Trump is \"illegal.\" And he's been on a roll since the beginning of his second term, clamping down on late-night comedians, because, how dare you mock him? This is so sad for MAGA. Behold, their alpha-male leader.\n\"Seth Me…",
    "link": "https://crooksandliars.com/2025/11/whiny-titty-baby-deems-anti-trump-comedy",
    "timestamp": "2025-11-02T20:30:01Z"
  },
  {
    "title": "Trump Has Remodeled The Lincoln Bathroom In His Own Gaudy Image",
    "description": "42 million people in America are on the threshold of losing their food benefits, millions more are seeing their health care premiums skyrocket, the government shutdown has taken paychecks and services away from even more - but Donald Trump is using his time i…",
    "link": "https://crooksandliars.com/2025/10/trump-has-remodeled-lincoln-bathroom-his",
    "timestamp": "2025-11-02T20:30:01Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "President Donald Trump says he “won’t be extorted” by Democrats to reopen the government, making clear that he has no plans to negotiate as the government shutdown will soon enter its sixth week.",
    "link": "https://www.clickondetroit.com/news/politics/2025/11/02/shutdown-stalemate-set-to-drag-into-sixth-week-as-trump-pushes-republicans-to-change-senate-rules/",
    "timestamp": "2025-11-02T20:26:24Z"
  },
  {
    "title": "Trump says he ‘won’t be extorted’ by Democrats, shuns negotiations as shutdown drags on",
    "description": "President Donald Trump says he “won’t be extorted” by Democrats to reopen the government, making clear that he has no plans to negotiate as the government shutdown will soon enter its sixth week.…",
    "link": "https://www.bostonherald.com/2025/11/02/trump-says-he-wont-be-extorted-by-democrats-shuns-negotiations-as-shutdown-drags-on/",
    "timestamp": "2025-11-02T20:19:40Z"
  },
  {
    "title": "Stalemate on government shutdown set to drag into sixth week",
    "description": "President Donald Trump says he “won’t be extorted” by Democrats to reopen the government, making clear that he has no plans to negotiate as the government shutdown will soon enter its sixth week",
    "link": "https://www.wsbtv.com/news/business/shutdown-stalemate/C2XQMX24DU6F7N5QLQ6O3VGXCI/",
    "timestamp": "2025-11-02T20:19:40Z"
  },
  {
    "title": "Shutdown stalemate set to drag into sixth week as Trump pushes Republicans to change Senate rules",
    "description": "Republicans and Democrats remained at a stalemate on the government shutdown over the weekend as it headed into its sixth week, with food aid potentially...",
    "link": "https://www.yahoo.com/news/articles/shutdown-stalemate-set-drag-sixth-201940780.html",
    "timestamp": "2025-11-02T20:19:40Z"
  },
  {
    "title": "Trump says he 'won't be extorted' by Democrats, shuns negotiations as shutdown drags on",
    "description": "In an interview on CBS's “60 Minutes\" that aired on Sunday, Trump said that Democrats who are demanding an extension in health care subsidies “have lost their way.\"",
    "link": "https://www.kare11.com/article/politics/associatedpress/shutdown-stalemate-set-to-drag-into-sixth-week-as-trump-pushes-republicans-to-change-senate-rules/616-38b8738a-906d-4cd3-95be-9befb7e3e3d0",
    "timestamp": "2025-11-02T20:19:00Z"
  },
  {
    "title": "Dan Crenshaw defends Trump boat strikes but hesitates on support for strikes on Venezuela itself",
    "description": "Rep. Dan Crenshaw on Sunday defended President Donald Trump’s efforts to oust Venezuela’s Nicolás Maduro but stopped short of endorsing land strikes on the country. \nSpeaking with CBS’ Margaret Brennan on \"Face the Nation,\" the Texas Republican said the admin…",
    "link": "https://biztoc.com/x/76891c56bb4b1eb2",
    "timestamp": "2025-11-02T20:14:08Z"
  },
  {
    "title": "US and China to reopen military hotlines – Hegseth",
    "description": "Washington and Beijing will maintain the key channels to “deescalate” potential flare-ups, War Secretary Pete Hegseth has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627263-us-china-reopen-military-hotlines/",
    "timestamp": "2025-11-02T20:11:32Z"
  },
  {
    "title": "Scott Adams Pleads With Trump ‘To Help Save My Life’ — Trump Says He’s ‘On It’",
    "description": "Donald Trump has responded to a plea from Scott Adams of Dilbert fame, after the author and cartoonist reached out for help with his terminal illness\nThe post Scott Adams Pleads With Trump ‘To Help Save My Life’ — Trump Says He’s ‘On It’ first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/scott-adams-pleads-with-trump-to-help-save-my-life-trump-says-hes-on-it/",
    "timestamp": "2025-11-02T20:11:05Z"
  },
  {
    "title": "US could hike tariffs if China backtracks on rare earths: Bessent",
    "description": "<![CDATA[ US President Donald Trump's administration is prepared to raise tariffs on China if Beijing continues blocking rare earth exports, Treasury Secretary Scott Bessent warned Sunday (Nov 2). Bessent told Fox News: \"The Chinese have cornered the market (…",
    "link": "https://www.channelnewsasia.com/world/us-could-hike-tariffs-if-china-backtracks-rare-earths-bessent-5441011",
    "timestamp": "2025-11-02T20:04:09Z"
  },
  {
    "title": "National populists surge around the world — spelling doom for the global elite",
    "description": "Democrats are flummoxed that President Donald Trump can keep winning when they find his views so despicable. Recent elections from around the world, though, provide the answer: People want conservative populism. Argentine President Javier Milei’s recent unexp…",
    "link": "https://freerepublic.com/focus/f-bloggers/4350276/posts",
    "timestamp": "2025-11-02T20:02:00Z"
  }
]