[
  {
    "title": "Trump Administration To Cut Additional $450 Million in Grants to Harvard, Citing Free Beacon Reports",
    "description": "The Trump administration will strip Harvard University of an additional $450 million in federal grants as it ramps up pressure on the Ivy League school over anti-Semitic campus protests, citing two recent Washington Free Beacon reports, one on racial discrimi…",
    "link": "https://freebeacon.com/latest-news/trump-administration-to-cut-additional-450-million-in-grants-to-harvard-citing-free-beacon-reports/",
    "timestamp": "2025-05-13T15:55:16Z"
  },
  {
    "title": "Jill Biden cut off Pennsylvania Gov. Shapiro during post-debate campaign warning: ‘We gotta go’",
    "description": "\"Alright,\" the Jill Biden said, standing up. \"We gotta go.\"",
    "link": "https://nypost.com/2025/05/13/us-news/jill-biden-cut-off-pennsylvania-gov-shapiro-during-post-debate-campaign-warning-we-gotta-go/",
    "timestamp": "2025-05-13T15:55:04Z"
  },
  {
    "title": "‘Putin is scared’: Zelenskiy insists on face-to-face talks with Russian president",
    "description": "Kremlin yet to say whether Putin will take part in talks with Ukrainian leader in Istanbul this week",
    "link": "https://www.irishtimes.com/world/europe/2025/05/13/ukraine-russia-zelenskiy-putin/",
    "timestamp": "2025-05-13T15:54:55Z"
  },
  {
    "title": "Sanders Calls Trump Anti-Science Agenda an 'Attack Against Anyone Who Has Ever Loved Someone With Cancer'",
    "description": "U.S. President Donald Trump is conducting an \"unprecedented and illegal\" broadside against science and scientists that will have devastating consequences for regular Americans, according to a report released Tuesday by Sen. Bernie Sanders, an Independent from…",
    "link": "https://www.commondreams.org/news/sanders-committee-report-science-funding-trump",
    "timestamp": "2025-05-13T15:54:02Z"
  },
  {
    "title": "BlackRock CEO: Investors are still sitting on trillions in cash as they wait for tariff 'equilibrium'",
    "description": "BlackRock CEO Larry Fink, speaking in Saudi Arabia as President Trump visited, said the uncertainty surrounding trade still has Western investors sitting on ...",
    "link": "https://finance.yahoo.com/news/blackrock-ceo-investors-are-still-sitting-on-trillions-in-cash-as-they-wait-for-tariff-equilibrium-155357932.html",
    "timestamp": "2025-05-13T15:53:57Z"
  },
  {
    "title": "UN rejects US-Israeli plan that ‘weaponises aid’ to Palestinians in Gaza",
    "description": "World Health Organisation official says hunger could have a lasting effect on an ‘entire generation’ in Gaza",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/13/un-rejects-us-israeli-plan-that-weaponises-aid-to-palestinians-in-gaza/",
    "timestamp": "2025-05-13T15:53:25Z"
  },
  {
    "title": "Trump to meet Syrian President Ahmad al-Sharaa on Wednesday",
    "description": "U.S. President Donald Trump agreed to meet Syrian President Ahmad al-Sharaa during his visit to Saudi Arabia on Wednesday, according to a White House official.",
    "link": "https://www.hurriyetdailynews.com/trump-to-meet-syrian-president-ahmad-al-sharaa-on-wednesday-209140",
    "timestamp": "2025-05-13T15:53:08Z"
  },
  {
    "title": "Trump’s Qatari Plane May Not Fly With Republicans",
    "description": "As President Trump defends accepting a luxury jet from the Qatari royal family, many of his fellow Republicans have voiced concerns about the expensive gift.",
    "link": "http://nymag.com/intelligencer/article/trump-qatar-747-plane-gift-draws-republican-criticism.html",
    "timestamp": "2025-05-13T15:52:21Z"
  },
  {
    "title": "Sean Penn Gives Donald Trump New Nickname on Podcast",
    "description": "The \"I Am Sam\" actor didn't hold back his thoughts on the president.",
    "link": "https://biztoc.com/x/23ef1a39509e5d8b",
    "timestamp": "2025-05-13T15:51:50Z"
  },
  {
    "title": "JPMorgan lowers its recession odds as Trump strikes a temporary deal to drop tariffs on China",
    "description": "JPMorgan is walking back its prediction it was 60% likely a recession would hit the U.S. in 2025. The bank wrote in a Tuesday note President Donald Trump’s temporary agreement scaling back tariffs on China while the two trading partners negotiate a trade deal…",
    "link": "https://biztoc.com/x/acef4900dcddf4cd",
    "timestamp": "2025-05-13T15:51:37Z"
  },
  {
    "title": "Judges Ruling Against Trump Receive Unsolicited Pizza Deliveries to Their Homes",
    "description": "“It’s really an unnecessary and an unfortunate threat to our security,” one judge said.",
    "link": "https://truthout.org/articles/judges-ruling-against-trump-receive-unsolicited-pizza-deliveries-to-their-homes/",
    "timestamp": "2025-05-13T15:51:12Z"
  },
  {
    "title": "Trump to attend Istanbul talks if Putin appears: US envoy",
    "description": "U.S. President Donald Trump will attend the Russia-Ukraine peace negotiations in Istanbul, but only if Russian President Vladimir Putin confirms his participation, Trump's special envoy to Ukraine said Tuesday.",
    "link": "https://www.hurriyetdailynews.com/trump-to-attend-istanbul-talks-if-putin-appears-us-envoy-209139",
    "timestamp": "2025-05-13T15:50:13Z"
  },
  {
    "title": "This illness kills babies at their most vulnerable. We can stop it.",
    "description": "If the year 2025 has had a message for developing countries, it’s this: “You’re on your own.” Most notably, the Trump administration began with an unprecedented and ongoing assault on foreign aid, including global health programs. But there have been further …",
    "link": "https://www.vox.com/future-perfect/412847/neonatal-sepsis-infant-death-foreign-aid-test",
    "timestamp": "2025-05-13T15:49:51Z"
  },
  {
    "title": "Trump Cuts Cancer Research Funding By 31% In First 3 Months Of 2025: Report",
    "description": "US President Donald Trump&#039;s administration slashed cancer research funding by 31 per cent in the first three months of 2025 compared to the same period last year, according to a Senate report.",
    "link": "https://www.ndtv.com/world-news/trump-cuts-cancer-research-funding-by-31-in-first-3-months-of-2025-report-8405841",
    "timestamp": "2025-05-13T15:49:19Z"
  },
  {
    "title": "Sean Penn Gives Donald Trump New Nickname on Podcast",
    "description": "The \"I Am Sam\" actor didn't hold back his thoughts on the president.",
    "link": "https://www.newsweek.com/sean-penn-donald-trump-nickname-2071488",
    "timestamp": "2025-05-13T15:49:06Z"
  },
  {
    "title": "Trump Issues Ultimatum, Saying Russia, Ukraine Should Hold Direct Talks — Witkoff",
    "description": "According to the US President special envoy, if direct talks between Russia and Ukraine bring any result, there will be \"a strong chance to getting an end to this conflict\"WASHINGTON, May 13. /TASS/. US President Donald Trump insists that Moscow and Kiev shou…",
    "link": "https://freerepublic.com/focus/f-news/4316718/posts",
    "timestamp": "2025-05-13T15:48:44Z"
  },
  {
    "title": "Trump’s egg price fiction has suddenly become reality | CNN Business",
    "description": "For months, President Donald Trump has falsely claimed that egg prices are tumbling. It wasn’t true then, but it’s true now.",
    "link": "https://www.cnn.com/2025/05/13/business/egg-prices-trump-inflation",
    "timestamp": "2025-05-13T15:48:14Z"
  },
  {
    "title": "We didn’t have ‘the balls’ to fully back Ukraine under Joe Biden, says Boris Johnson",
    "description": "Johnson, who was U.K. PM when Russia invaded Ukraine, criticized the West's Biden-era approach — and said Trump can do better.",
    "link": "https://www.politico.eu/article/we-didnt-have-the-balls-back-ukraine-joe-biden-boris-johnson-war-russia/",
    "timestamp": "2025-05-13T15:47:33Z"
  },
  {
    "title": "Trump hopes for Saudi Arabia to join Abraham Accords and stabilization in the region",
    "description": "Trump's many for the middle east. Aside from Riyadh possibly joining Abraham accords, he hopes for a better deal with Iran and stability for the new Syrian government with all sanctions removed",
    "link": "https://www.jpost.com/breaking-news/article-853816",
    "timestamp": "2025-05-13T15:44:01Z"
  },
  {
    "title": "How Joe Biden Handed the Presidency to Donald Trump",
    "description": "At a fateful event last summer, Barack Obama, George Clooney, and others were stunned by Biden’s weakness and confusion. Why did he and his advisers decide to conceal his condition from the public and campaign for reëlection?",
    "link": "https://www.newyorker.com/news/the-political-scene/how-joe-biden-handed-the-presidency-to-donald-trump",
    "timestamp": "2025-05-13T15:43:09Z"
  },
  {
    "title": "North Carolina justice sworn in after long battle over result",
    "description": "North Carolina Democratic Supreme Court Justice Allison Riggs has been sworn in to a new term after her Republican rival challenged the results over six months",
    "link": "https://abcnews.go.com/US/wireStory/north-carolina-justice-sworn-after-long-battle-result-121755418",
    "timestamp": "2025-05-13T15:42:44Z"
  },
  {
    "title": "US reiterates demand for 5% ‘defence-related’ NATO spending target",
    "description": "Some broader defence-related spending could count toward the target – but not \"a grab bag\" of budget items, the ambassador said.",
    "link": "https://www.euractiv.com/section/defence/news/us-reiterates-demand-for-5-defence-related-nato-spending-target/",
    "timestamp": "2025-05-13T15:42:44Z"
  },
  {
    "title": "Elon Musk flaunts Tesla Optimus Robots to Trump and MBS in high-stakes Saudi visit",
    "description": "During his first international trip, President Trump secured a $600 billion investment commitment from Saudi Arabia. He met with Crown Prince Mohammed bin Salman and various business leaders, including Elon Musk, who showcased Tesla robots. The US and Saudi A…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-flaunts-tesla-optimus-robots-to-trump-and-mbs-in-high-stakes-saudi-visit/articleshow/121143873.cms",
    "timestamp": "2025-05-13T15:42:13Z"
  },
  {
    "title": "SEC hacker counters prosecutors with 366-day sentencing recommendation",
    "description": "Defense lawyers have asked a judge to sentence the person responsible for helping post a fake message announcing regulatory approval of Bitcoin exchange-traded funds to roughly a year in prison, countering prosecutors’ request for a two-year sentence.In a May…",
    "link": "https://cointelegraph.com/news/sec-hacker-sentencing-recommendation-judge",
    "timestamp": "2025-05-13T15:41:32Z"
  },
  {
    "title": "Trump admin cuts another $450 million in grants for Harvard",
    "description": "WASHINGTON (AP) — President Donald Trump’s administration is cutting another $450 million in grants to Harvard University a day after the Ivy League school pushed back against government allegations that it’s a hotbed of liberalism and antisemitism.",
    "link": "https://www.nbcnews.com/news/us-news/trump-administration-cuts-another-450-million-grants-harvard-escalatin-rcna206509",
    "timestamp": "2025-05-13T15:40:47Z"
  },
  {
    "title": "The AI Fix #50: AI brings dead man back for killer’s trial, and the judge loves it",
    "description": "In episode 50 of The AI Fix, AI brings a slain man back from the dead so he can appear at his killer's trial, Mark gets a mysterious phone call, Trump uses AI to become Pope Donald the First, Zuck ponders the nature of friendship, Apple says the quiet part ou…",
    "link": "https://grahamcluley.com/the-ai-fix-50/",
    "timestamp": "2025-05-13T15:40:04Z"
  },
  {
    "title": "Even MAGA influencers are decrying Trump’s plan to take a $400 million jet from Qatar",
    "description": "President Donald Trump’s plan to accept a luxury jet as a gift from the Qatari royal family has led to criticism from many corners — including the MAGA faithful.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-qatar-plane-maga-influencers-laura-loomer-ben-shapiro-rcna206467",
    "timestamp": "2025-05-13T15:39:53Z"
  },
  {
    "title": "US trade negotiator says 10% universal tariff will rebuild domestic manufacturing",
    "description": "Greer told CNBC he would speak to the Indian commerce secretary on Tuesday before leaving for Seoul, South Korea for a meeting of trade ministers from the Asia-Pacific Economic Co-operation (APEC) grouping",
    "link": "https://www.thehindubusinessline.com/news/world/us-trade-negotiator-says-10-universal-tariff-will-rebuild-domestic-manufacturing/article69572425.ece",
    "timestamp": "2025-05-13T15:39:48Z"
  },
  {
    "title": "Stop over the top rhetoric that got Trump elected in the first place (Letters)",
    "description": "\"I thought The Denver Post had gotten over posting these types of smear campaigns. This type of inflammatory rhetoric and lies is why Trump was elected.\" -- Steve Gehrke, Aurora",
    "link": "https://www.denverpost.com/2025/05/13/trump-rhetoric-cinco-de-mayo-column/",
    "timestamp": "2025-05-13T15:38:13Z"
  },
  {
    "title": "Third-party mediation between India, Pak has been reality since 1990: Congress MP Manish Tewari",
    "description": "Manish Tewari asserted that third-party mediation between India and Pakistan has been a recurring reality since 1990, citing instances during the UPA regime and beyond. He highlighted interventions during events like the Kargil conflict, Operation Parakram, a…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/third-party-mediation-between-india-pak-has-been-reality-since-1990-congress-mp-manish-tewari/articleshow/121143892.cms",
    "timestamp": "2025-05-13T15:38:07Z"
  },
  {
    "title": "Police Week: Trump Rips Biden's 'Soft-on-Crime Policies' That Hurt Americans",
    "description": "President Trump honored Peace Officers Memorial Day, blasting former President Biden's (D) administration's policies on crime.\nThe post Police Week: Trump Rips Biden’s ‘Soft-on-Crime Policies’ That Hurt Americans appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/05/13/police-week-trump-rips-bidens-soft-on-crime-policies-hurt-americans/",
    "timestamp": "2025-05-13T15:37:40Z"
  },
  {
    "title": "Amid Starvation, People in Gaza Are Choosing Death at Home Over Displacement",
    "description": "Only two bags of infested flour are left in my house. I interviewed others also facing starvation and ground invasion.",
    "link": "https://truthout.org/articles/amid-starvation-people-in-gaza-are-choosing-death-at-home-over-displacement/",
    "timestamp": "2025-05-13T15:37:40Z"
  },
  {
    "title": "Trump officials talk up 'better chance' of Israel-Hamas ceasefire after hostage release",
    "description": "The White House’s special envoy for the Middle East, Steve Witkoff has said there is a strong chance of further ceasefire and hostage negotiation breakthroughs after Edan Alexander was freed this week.",
    "link": "https://www.abc.net.au/news/2025-05-14/trump-witkoff-edan-alexander/105289044",
    "timestamp": "2025-05-13T15:36:12Z"
  },
  {
    "title": "Shaheen: Dems Will Likely Freeze Trump Nominees Until We Get Answers on Qatar Jet",
    "description": "Senator Jeanne Shaheen (D-NH) said Tuesday on CNN's \"News Central\" that President Donald Trump's judicial nominees could face holds until Attorney General Pam Bondi provides \"answers\" to Congress on the $400 million jet from Qatar.\nThe post Shaheen: Dems Will…",
    "link": "https://www.breitbart.com/clips/2025/05/13/shaheen-dems-will-likely-freeze-trump-nominees-until-we-answers-on-qatar-jet/",
    "timestamp": "2025-05-13T15:35:21Z"
  },
  {
    "title": "Harvard loses another $450 million in grants in escalating battle with Trump administration",
    "description": "A federal antisemitism task force said in a letter to Harvard it will lose grants from eight federal agencies.",
    "link": "https://www.bostonherald.com/2025/05/13/harvard-loses-grants-trump-battle/",
    "timestamp": "2025-05-13T15:34:58Z"
  },
  {
    "title": "Ex-NATO chief warns Trump to stay away from Greenland",
    "description": "It is “shameless” for the US president to threaten American ally Denmark, Anders Fogh Rasmussen has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617476-denmark-greenland-nato-trump/",
    "timestamp": "2025-05-13T15:34:54Z"
  },
  {
    "title": "Egg prices drop for the first time in more than 6 months, but remain high",
    "description": "The average price of eggs of all sizes fell 12.7%, which was the steepest monthly decline since March 1984.",
    "link": "https://www.pbs.org/newshour/nation/egg-prices-drop-for-the-first-time-in-more-than-6-months-but-remain-high",
    "timestamp": "2025-05-13T15:32:55Z"
  },
  {
    "title": "‘White House was lying’: Jake Tapper goes scorched earth on Biden, reveals wheelchair discussion for Joe",
    "description": "'It probably doesn't surprise you'",
    "link": "https://www.wnd.com/2025/05/white-house-was-lying-jake-tapper-goes-scorched-earth-on-biden-reveals-wheelchair-discussion-for-joe/",
    "timestamp": "2025-05-13T15:32:15Z"
  },
  {
    "title": "Old Sleepy Don: Trump Caught Dozing Off In Saudi Arabia",
    "description": "Donald J. Trump landed in Saudi Arabia on Tuesday and is sleepy. Hillary Clinton flew an estimated 946,000 miles while she was Secretary of State, visiting 116 countries, without needing a nap during meetings.\nMaybe, just maybe, he ate too many hamberders. \n\n…",
    "link": "https://crooksandliars.com/2025/05/old-sleepy-don-trump-caught-dozing-saudi",
    "timestamp": "2025-05-13T15:31:43Z"
  },
  {
    "title": "The Dark History of How China Captured Apple",
    "description": "In his new book, Apple in China, Patrick McGee examines how Tim Cook unwittingly led Apple right into the heart of Trump’s trade war.",
    "link": "https://www.vanityfair.com/news/story/apple-in-china-patrick-mcgee-interview",
    "timestamp": "2025-05-13T15:30:23Z"
  },
  {
    "title": "Trump's 'big beautiful bill' would officially kill the IRS's free direct-tax filing tool",
    "description": "Republicans have wanted to end IRS Direct File for years, calling it wasteful and an example of government overreach.",
    "link": "https://www.businessinsider.com/trump-house-republican-kill-irs-direct-file-2025-5",
    "timestamp": "2025-05-13T15:30:16Z"
  },
  {
    "title": "U.S. and Saudi Arabia Sign Major Energy Deals During Trump’s Visit",
    "description": "The United States and Saudi Arabia signed an economic partnership agreement and a number of energy deals between Saudi oil giant Aramco and American companies during the visit of U.S. President Donald Trump to the Kingdom on Tuesday. President Trump signed th…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-and-Saudi-Arabia-Sign-Major-Energy-Deals-During-Trumps-Visit.html",
    "timestamp": "2025-05-13T15:30:00Z"
  },
  {
    "title": "The Best Protection For Students Is a Mass Movement",
    "description": "A conversation with Momodou Taal, the Cornell student suing the Trump Administration for repression against students.",
    "link": "https://inthesetimes.com/article/momodou-tall-students-mass-movement-pym",
    "timestamp": "2025-05-13T15:30:00Z"
  },
  {
    "title": "Israel Left Off Trump’s First Foreign Itinerary",
    "description": "President Donald Trump’s decision to skip Israel on his first Middle East tour has raised questions about the strength of U.S.-Israel ties under his leadership, according to The Wall Street Journal. Trump is visiting Saudi Arabia, Qatar, and the UAE, but not …",
    "link": "https://biztoc.com/x/d2d0e944b55e3f5c",
    "timestamp": "2025-05-13T15:29:30Z"
  },
  {
    "title": "WaPo turmoil deepens: Jeff Bezos appointed CEO Will Lewis vanishes from newsroom, staff cite concerns over his absence and alleged drinking habits",
    "description": "The Washington Post faces internal turmoil. Employees express concern over CEO Will Lewis's absence. Reports suggest issues with his leadership style. This has led to low morale and staff departures. Jeff Bezos's involvement seems limited. Lewis's relationshi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/wapo-turmoil-deepens-jeff-bezos-appointed-ceo-will-lewis-vanishes-from-newsroom-staff-cite-concerns-over-his-absence-and-alleged-drinking-habits/articleshow/121143658.cms",
    "timestamp": "2025-05-13T15:28:43Z"
  },
  {
    "title": "The questions lawyers for people held in El Salvador want the Trump administration to answer",
    "description": "Lawyers for the migrants removed to El Salvador have a list of questions they're pushing to get answered in court this week.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/alien-enemies-act-el-salvador-cecot-prison-rcna206461",
    "timestamp": "2025-05-13T15:28:09Z"
  },
  {
    "title": "US crude oil climbs more than $1 on Saudi investment",
    "description": "U.S. crude oil futures climbed more than $1 a barrel on Tuesday as the White House announced Saudi Arabia's plans to invest $600 billion in the United States.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/us-crude-oil-climbs-more-than-1-on-saudi-investment/articleshow/121143762.cms",
    "timestamp": "2025-05-13T15:27:23Z"
  },
  {
    "title": "Cannes Festival opens under pressure to take stance on Gaza war",
    "description": "The Cannes film festival kicks off on the French Riviera on Tuesday, with organisers facing pressure to take a stance on Israel’s siege of Gaza after a letter from hundreds of top cinema figures denouncing “genocide” in the Palestinian territory. More than 38…",
    "link": "https://www.digitaljournal.com/world/cannes-festival-opens-under-pressure-to-take-stance-on-gaza-war/article",
    "timestamp": "2025-05-13T15:27:20Z"
  },
  {
    "title": "‘Apprentice’ star Jeremy Strong says ‘truth under assault’",
    "description": "“The Apprentice” star Jeremy Strong — who was nominated for an Oscar for playing Donald Trump’s ruthless early mentor — said Tuesday that “truth is under assault”. Strong told reporters at the Cannes Film Festival that lawyer Roy Cohn, who he played in the co…",
    "link": "https://www.digitaljournal.com/world/apprentice-star-jeremy-strong-says-truth-under-assault/article",
    "timestamp": "2025-05-13T15:27:20Z"
  },
  {
    "title": "Zelensky urges Trump to make Putin meeting happen",
    "description": "Ukraine’s Volodymyr Zelensky urged Donald Trump to help secure a meeting with Vladimir Putin in Turkey on Thursday, accusing the Russian leader of not seriously wanting to negotiate an end to the war.   Zelensky told reporters in Kyiv on Tuesday that the West…",
    "link": "https://www.digitaljournal.com/world/zelensky-urges-trump-to-make-putin-meeting-happen/article",
    "timestamp": "2025-05-13T15:27:20Z"
  },
  {
    "title": "Trump to meet Syrian prez who formerly led al Qaeda group — months after US dropped $10M bounty for arrest",
    "description": "RIYADH, Saudi Arabia — President Trump will meet with interim Syrian President Ahmad al-Sharaa on Wednesday — despite the former al Qaeda leader having a $10 million American bounty on his head until recently. “The President agreed to say hello to the Syrian …",
    "link": "https://nypost.com/2025/05/13/us-news/trump-to-meet-syrian-prez-who-formerly-led-al-qaeda-group/",
    "timestamp": "2025-05-13T15:27:17Z"
  },
  {
    "title": "WSJ: Trump Surrendered To China",
    "description": "The Wall Street Journal's editorial board ripped into Donald Trump's tariff flip-flop fiasco in a blistering op-ed.\nTrump immediately pulling back from his 145% tariffs on China is a complete surrender. When reality slaps you in the face, hard, sometimes even…",
    "link": "https://crooksandliars.com/2025/05/wsj-trump-surrendered-china",
    "timestamp": "2025-05-13T15:27:11Z"
  },
  {
    "title": "Harvard loses another $450 million in grants in escalating battle with Trump administration",
    "description": "President Donald Trump's administration is cutting another $450 million in grants to Harvard University a day after the Ivy League school pushed back against government allegations it’s a hotbed of liberalism and antisemitism",
    "link": "https://abcnews.go.com/US/wireStory/harvard-loses-450-million-grants-escalating-battle-trump-121754477",
    "timestamp": "2025-05-13T15:26:52Z"
  },
  {
    "title": "Harvard loses another $450 million in grants in escalating battle with Trump administration",
    "description": "President Donald Trump's administration is cutting another $450 million in grants to Harvard University a day after the Ivy League school pushed back against government allegations it’s a hotbed of liberalism and antisemitism. A federal antisemitism task forc…",
    "link": "https://apnews.com/article/harvard-antisemitism-federal-grants-trump-3c8e4d2d3fa0c5083d98250078f95d00",
    "timestamp": "2025-05-13T15:25:04Z"
  },
  {
    "title": "Carney unveils cabinet aimed at resetting US-Canada ties",
    "description": "OTTAWA (Reuters) - Canadian Prime Minister Mark Carney, who won an election last month promising to stand up to U.S. President Donald Trump, unveiled a new cabinet on Tuesday that he said would help define a new relationship with the United States. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/05/13/carney-unveils-cabinet-aimed-at-resetting-us-canada-ties",
    "timestamp": "2025-05-13T15:25:00Z"
  },
  {
    "title": "Who is Anita Anand, Canada’s new Foreign Minister in Mark Carney's Cabinet overhaul?",
    "description": "Canada’s newly elected Prime Minister Mark Carney has appointed Anita Anand as the new Foreign Minister in a sweeping Cabinet reshuffle. Anand, an Oxford-educated MP of Indian origin, replaces Mélanie Joly and brings extensive ministerial experience to the fo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/who-is-anita-anand-canadas-new-foreign-minister-in-mark-carneys-cabinet-overhaul/articleshow/121143537.cms",
    "timestamp": "2025-05-13T15:23:38Z"
  },
  {
    "title": "Temu and Shein to Rethink Supply Chains During Temporary Lowering of US Tariffs",
    "description": "Temu and Shein reportedly have an opportunity to restock their U.S. warehouses during a temporary reduction in tariffs. An agreement between the U.S. and China that was announced Monday (May 12) lowered tariffs on most Chinese imports from 125% to 30% for 90 …",
    "link": "https://www.pymnts.com/news/retail/2025/temu-and-shein-to-rethink-supply-chains-during-temporary-lowering-of-us-tariffs/",
    "timestamp": "2025-05-13T15:22:36Z"
  },
  {
    "title": "As white South Africans arrive, Trump admin. ends temporary protected status for Afghans",
    "description": "Donald Trump has largely closed the doors to the United States for refugees — with one big exception for white South Africans.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-south-africans-arrive-trump-admin-ends-temporary-protected-statu-rcna206496",
    "timestamp": "2025-05-13T15:21:49Z"
  },
  {
    "title": "The D Brief: Why Yemen strikes ended; Gitmo flights, tallied; Spectrum battle; Turkey’s PKK disbands; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/05/the-d-brief-may-13-2025/405274/",
    "timestamp": "2025-05-13T15:21:44Z"
  },
  {
    "title": "Scheduling underway for meeting with Canadian premiers in Boston",
    "description": "Gov. Maura Healey’s administration said “nearly all” of the six Canadian premiers she and other U.S. governors invited to Boston to discuss the impacts of President Donald Trump’s tariffs have said they are willing to meet.",
    "link": "https://www.bostonherald.com/2025/05/13/scheduling-underway-for-meeting-with-canadian-premiers-in-boston/",
    "timestamp": "2025-05-13T15:21:43Z"
  },
  {
    "title": "US and Saudi Arabia sign $142bn defense sales agreement - live (The Guardian)",
    "description": "The Guardian:\nUS and Saudi Arabia sign $142bn defense sales agreement - live  —  Donald Trump and Mohammed bin Salman also sign strategic economic agreement in Riyadh covering energy, mining and defense  —  Schumer to place hold on Trump DOJ nominees over Qat…",
    "link": "https://www.memeorandum.com/250513/p53",
    "timestamp": "2025-05-13T15:20:01Z"
  },
  {
    "title": "Did Trump Fall Asleep on Camera During Meeting With Saudis? Social Media Sure Thinks So",
    "description": "President Trump struggled to fend off a serious case of the drowsies during a ceremony with a Saudi royal following a red-eye flight to the Middle East.\nThe post Did Trump Fall Asleep on Camera During Meeting With Saudis? Social Media Sure Thinks So first app…",
    "link": "https://www.mediaite.com/trump/did-trump-fall-asleep-on-camera-during-meeting-with-saudis-social-media-sure-thinks-so/",
    "timestamp": "2025-05-13T15:18:42Z"
  },
  {
    "title": "CVS Health, Cigna Stocks Dip Tuesday: What's Going On?",
    "description": "CVS Health Corporation (NYSE:CVS) and The Cigna Group (NYSE:CI) shares trading lower Tuesday. President Donald Trump on Monday signed an executive order aimed at reducing the cost of prescription drugs.\nWhat To Know: According to the Wall Street Journal, the …",
    "link": "https://biztoc.com/x/b23f175ba2bb8a6e",
    "timestamp": "2025-05-13T15:18:12Z"
  },
  {
    "title": "Ken Griffin says Trump won the election by promising lower inflation—so he needs to think ‘long and hard’ about how to protect Americans’ standard of living",
    "description": "Ken Griffin argues that while many voters supported Donald Trump expecting lower inflation and improved living standards, Trump's tariff policies risk causing price hikes and undermining that goal. He urges Trump to reconsider his foreign policy and warns tha…",
    "link": "https://biztoc.com/x/eca5e993a979712f",
    "timestamp": "2025-05-13T15:18:10Z"
  },
  {
    "title": "‘Stitch-up’ or scandal? What triggered the downfall of Britain’s Sea Lord",
    "description": "Convened in a grand 19th-century mansion overlooking Buckingham Palace, the First Sea Lord’s annual Sea Power Conference is a vivid reminder that Britannia...",
    "link": "https://uk.news.yahoo.com/stitch-scandal-triggered-downfall-britain-151728955.html",
    "timestamp": "2025-05-13T15:17:28Z"
  },
  {
    "title": "The US is to Boost Saudi AI Chip Access as Saudi Arabia announces a strategic partnership with NVIDIA",
    "description": "The Trump administration is preparing to announce a deal granting Saudi Arabia more access to advanced semiconductors, paving the way for increased data center capacity in the Gulf nation despite concerns from some US officials about its ties to China, accord…",
    "link": "https://www.patentlyapple.com/2025/05/the-us-is-to-boost-saudi-ai-chip-access-as-saudi-arabia-announces-a-strategic-partnership-with-nvidia.html",
    "timestamp": "2025-05-13T15:17:14Z"
  },
  {
    "title": "Nvidia sending 18,000 AI GPUs to Saudi Arabia's state-backed AI data centers in wake of cancelled export rules",
    "description": "Nvidia is set to send 18,000 AI GPUs to Saudi Arabia to help boost the state's Humain AI operation.",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-sending-18-000-ai-gpus-to-saudi-arabias-state-backed-ai-data-centers-in-wake-of-cancelled-export-rules",
    "timestamp": "2025-05-13T15:17:05Z"
  },
  {
    "title": "Trump’s America Illustrates What Turkey Knows",
    "description": "In both Donald Trump’s America and Recep Tayyip Erdoğan’s Turkey, the message from markets this year is clear: political instability is feeding economic fragility. We should consider ourselves warned: when institutions weaken, inflation is never far behind.",
    "link": "https://www.project-syndicate.org/commentary/trumps-america-mirrors-turkey-pressure-on-central-bank-drives-inflation-higher-risk-premium-by-selva-demiralp-2025-05",
    "timestamp": "2025-05-13T15:16:28Z"
  },
  {
    "title": "How this coal company could help break U.S. dependence on China for rare earths",
    "description": "The discovery of a trove of rare earth elements is potentially a major turn of fortunes for this small mining company.",
    "link": "https://www.cnbc.com/2025/05/13/how-this-coal-company-could-help-break-us-dependence-on-china-for-rare-earths.html",
    "timestamp": "2025-05-13T15:15:50Z"
  },
  {
    "title": "Canadian Prime Minister Carney shakes up Cabinet and names a new foreign minister",
    "description": "Canadian Prime Minister Mark Carney has announced a major Cabinet shakeup, including a new foreign minister",
    "link": "https://abcnews.go.com/International/wireStory/canadian-prime-minister-carney-shakes-cabinet-names-new-121753311",
    "timestamp": "2025-05-13T15:15:31Z"
  },
  {
    "title": "Carney unveils cabinet aimed at resetting US-Canada ties",
    "description": "Canadian Prime Minister Mark Carney, who won an election last month promising to stand up to U.S. President Donald Trump, unveiled a new cabinet on Tuesday...",
    "link": "https://www.yahoo.com/news/carney-unveils-cabinet-aimed-resetting-151521782.html",
    "timestamp": "2025-05-13T15:15:21Z"
  },
  {
    "title": "California Under Investigation for Benefits to Illegal Immigrants",
    "description": "One expert told Newsweek the move by DHS is \"gift-wrapping\" personal data to ICE to carry out Trump's mass deportation plans.",
    "link": "https://www.newsweek.com/california-investigation-benefits-illegal-immigration-2071594",
    "timestamp": "2025-05-13T15:14:24Z"
  },
  {
    "title": "Harvard Bargains With Trump Administration And Loses Another $450 Million In Federal Grants",
    "description": "An additional $450 million in federal grants was revoked from Harvard after the school's president asked for greater freedom to address antisemitism on campus.",
    "link": "https://dailycaller.com/2025/05/13/harvard-trump-administration-450-million-federal-grants/",
    "timestamp": "2025-05-13T15:14:19Z"
  },
  {
    "title": "Jake Tapper Accuses Biden's White House Of Lying About Ex-President's Declining Health",
    "description": "A book co-written by the CNN host says Biden's team worried their boss would have to use a wheelchair if he won reelection.",
    "link": "https://www.huffpost.com/entry/jake-tapper-accuses-biden-white-house-of-lying_n_682346c8e4b0993b52bf0ff8",
    "timestamp": "2025-05-13T15:13:38Z"
  },
  {
    "title": "European economist says Russia's economy is strained due to the Ukraine war and sanctions",
    "description": "A leading economist has been telling EU finance ministers that Russia’s economy is under growing strain as its invasion of Ukraine drags on",
    "link": "https://abcnews.go.com/Business/wireStory/european-economist-russias-economy-strained-due-ukraine-war-121752480",
    "timestamp": "2025-05-13T15:13:19Z"
  },
  {
    "title": "Boeing deliveries nearly double in April",
    "description": "Boeing significantly increased its commercial jet deliveries in April, reaching 45 aircraft, nearly double the previous year's figure, driven by increased 737 MAX deliveries. However, deliveries to Chinese airlines were halted due to trade tensions, impacting…",
    "link": "https://economictimes.indiatimes.com/news/international/business/boeing-deliveries-nearly-double-in-april/articleshow/121143590.cms",
    "timestamp": "2025-05-13T15:12:54Z"
  },
  {
    "title": "Even White Afrikaners Think Trump’s “Refugee” Plan Is Dumb",
    "description": "Donald Trump is paving the way for white South African “refugees” to come to the United States, but they’re not all that interested in taking him up on his offer, The Wall Street Journal reported Tuesday. \r\nThe U.S. president falsely claimed Monday that Afrik…",
    "link": "https://newrepublic.com/post/195178/donald-trump-white-afrikaners-refugee-plan-dumb",
    "timestamp": "2025-05-13T15:12:52Z"
  },
  {
    "title": "New Law Would Ban All AI Regulation for a Decade",
    "description": "New Lease on Fresh Hell Republican lawmakers slipped language into the Budget Reconciliation Bill last night that would ban AI regulation, on the federal and state level, for a decade, 404 Media reported. Per 404, an updated version of the law introduced last…",
    "link": "https://futurism.com/the-byte/new-law-ban-ai-regulation",
    "timestamp": "2025-05-13T15:11:18Z"
  },
  {
    "title": "AI therapy is a surveillance machine in a police state",
    "description": "Mark Zuckerberg wants you to be understood by the machine. The Meta CEO has recently been pitching a future where his AI tools give people something that \"knows them well,\" not just as pals, but as professional help. \"For people who don't have a person who's …",
    "link": "https://www.theverge.com/policy/665685/ai-therapy-meta-chatbot-surveillance-risks-trump",
    "timestamp": "2025-05-13T15:11:05Z"
  },
  {
    "title": "India-Pak standoff: MEA says trade did not come up in discussions with the US",
    "description": "MEA clarifies US did not use trade to mediate India-Pakistan tensions, credits Indian military force for ceasefire.",
    "link": "https://www.thehindubusinessline.com/economy/india-pak-standoff-mea-says-trade-did-not-come-up-in-discussions-with-the-us/article69572304.ece",
    "timestamp": "2025-05-13T15:11:01Z"
  },
  {
    "title": "Forget politicians, top economist claims bond vigilantes are the real global power players, and they've successfully 'boxed in' Donald Trump",
    "description": "President Trump's recent imposition of high global tariffs, dubbed \"Liberation Day,\" triggered significant market selloffs and a surge in Treasury yields as bondholders reacted negatively. The intense market pressure, driven by concerns over long-term damage …",
    "link": "https://economictimes.indiatimes.com/news/international/us/forget-politicians-top-economist-claims-bond-vigilantes-are-the-real-global-power-players-and-theyve-successfully-boxed-in-donald-trump/articleshow/121142035.cms",
    "timestamp": "2025-05-13T15:10:12Z"
  },
  {
    "title": "CNN Hypes ‘Pro-Trump Media Stars’ Revolting Over $400M ‘Murder’ Money Jet",
    "description": "CNN's Brian Stelter said the \"pro-Trump media stars\" revolting against Trump over a $400 million plane from Qatar is the \"biggest break\" of the second term.\nThe post CNN Hypes ‘Pro-Trump Media Stars’ Revolting Over $400M ‘Murder’ Money Jet first appeared on M…",
    "link": "https://www.mediaite.com/news/cnn-hypes-pro-trump-media-stars-revolting-over-400m-murder-money-jet/",
    "timestamp": "2025-05-13T15:10:03Z"
  },
  {
    "title": "Trump to speak at investment forum following meeting with Saudi crown prince (Washington Post)",
    "description": "Washington Post:\nTrump to speak at investment forum following meeting with Saudi crown prince  —  An error occurred.  Please try again later.  —  President Donald Trump is scheduled to speak Tuesday at an investment forum in Riyadh, Saudi Arabia, following a …",
    "link": "https://www.memeorandum.com/250513/p49",
    "timestamp": "2025-05-13T15:10:01Z"
  },
  {
    "title": "Pentagon halting gender-affirming care for transgender troops, memo says",
    "description": "The Pentagon is halting gender-affirming health care for transgender troops.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/pentagon-halting-gender-affirming-health-care-transgender-troops-memo-rcna206482",
    "timestamp": "2025-05-13T15:08:34Z"
  },
  {
    "title": "Saudi Arabia Sets Up Mobile McDonald’s for Trump’s Visit to the Middle East",
    "description": "Journalists covering President Donald Trump’s arrival to Saudi Arabia on Tuesday observed the presence of a mobile McDonald’s set up at a press center for covering the event in Riyadh, an apparent nod to the president’s love of the burger restaurant. Official…",
    "link": "https://freerepublic.com/focus/f-news/4316710/posts",
    "timestamp": "2025-05-13T15:08:26Z"
  },
  {
    "title": "Left-wing pundit Hasan Piker claims he was detained at US border and questioned on political views",
    "description": "American Twitch streamer and left-wing pundit, Hasan Piker, says he was detained by US border agents at an airport and questioned over his political views. The 33-year-old influencer, known for challenging right-wing rhetoric, particularly in the US, claims t…",
    "link": "https://www.thepinknews.com/2025/05/13/hasan-piker-border-us/",
    "timestamp": "2025-05-13T15:07:53Z"
  },
  {
    "title": "Donald Trump's Approval Rating Reaches New Low Point: Poll",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump's approval rating on immigration has reached a new low, according to polling.\nWhy It Matters\nImmigration was the cornerstone of Trump's 2024 campaign and an issue Trump previously polled highly on…",
    "link": "https://biztoc.com/x/cdb4260bfaf5d285",
    "timestamp": "2025-05-13T15:07:34Z"
  },
  {
    "title": "White House Slams 'Incompetence' of California High-Speed Rail",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe White House has blamed \"Democrat incompetence and red tape\" as the reason behind the delays and costs of California's high-speed rail, just days after President Donald Trump withdrew federal funding for th…",
    "link": "https://biztoc.com/x/f72ae24e0e6d850d",
    "timestamp": "2025-05-13T15:07:21Z"
  },
  {
    "title": "New York court hears challenge to Trump tariffs",
    "description": "The News\nUS President Donald Trump’s “Liberation Day” tariffs face a big court test Tuesday, as a three-judge panel on an obscure court in Manhattan hears a challenge from small businesses to the sweeping levies announced in April.\nThe case before the Court o…",
    "link": "https://biztoc.com/x/11808d2ff7bf4f31",
    "timestamp": "2025-05-13T15:07:18Z"
  },
  {
    "title": "Saudi Arabia and US agree $600bn of AI and defence deals",
    "description": "Commitments come as Donald Trump begins first leg of three-nation tour of oil-rich Gulf",
    "link": "https://biztoc.com/x/c5c9ae199dd17322",
    "timestamp": "2025-05-13T15:07:16Z"
  },
  {
    "title": "Saudi Arabia Rolls Out Custom Mobile McDonald's for Trump Visit",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIt's well known that President Donald Trump loves a Big Mac. During his first term, he famously served fast food at White House banquets, and during the 2024 campaign he wore an apron and handed out fries at a…",
    "link": "https://biztoc.com/x/931f9f9ec7d84981",
    "timestamp": "2025-05-13T15:07:11Z"
  },
  {
    "title": "Donald Trump takes a cognitive test | May 13 editorial cartoons",
    "description": "(Image credit: Rick McKee / Copyright 2025 Cagle Cartoons, Inc.)\n(Image credit: David Horsey / Copyright 2025 Tribune Content Agency)\n(Image credit: Chip Bok / Copyright 2025 Creators Syndicate)\n(Image credit: Pat Bagley / Copyright 2025 Cagle Cartoons, Inc.)…",
    "link": "https://biztoc.com/x/afb68c01ecf453cf",
    "timestamp": "2025-05-13T15:06:48Z"
  }
]