[
  {
    "title": "Kansas City Chiefs owner's wife devastated over Charlie Kirk assassination: 'Our hearts ache'",
    "description": "Kansas City Chiefs owner's wife Tavia Hunt posted a tribute to Charlie Kirk after his fatal shooting during speaking event at Utah Valley University.",
    "link": "https://www.foxnews.com/sports/kansas-city-chiefs-owners-wife-devastated-over-charlie-kirk-assassination-our-hearts-ache",
    "timestamp": "2025-09-11T21:47:37Z"
  },
  {
    "title": "Palestine in Pictures: August 2025",
    "description": "A monthly digest of key developments in Palestine showcasing powerful images by photojournalists.",
    "link": "https://electronicintifada.net/content/palestine-pictures-august-2025/50926",
    "timestamp": "2025-09-11T21:47:13Z"
  },
  {
    "title": "US DoJ asks court for emergency ruling to remove Cook from Fed board",
    "description": "Trump administration wants Lisa Cook to be removed from the Fed Reserve board by Monday, ahead of interest rate meet.",
    "link": "https://www.aljazeera.com/economy/2025/9/11/us-doj-asks-court-for-emergency-ruling-to-remove-cook-from-fed-board",
    "timestamp": "2025-09-11T21:46:40Z"
  },
  {
    "title": "Donald Trump is lying about political violence",
    "description": "Charlie Kirk appears at a Utah Valley University event on September 10, 2025, in Orem, Utah. He was speaking on campus when he was shot and killed. | Trent Nelson/The Salt Lake Tribune/Getty Images \nCharlie Kirk, the influential right-wing activist, was shot …",
    "link": "https://biztoc.com/x/0e05efc5f1469cd3",
    "timestamp": "2025-09-11T21:46:33Z"
  },
  {
    "title": "Trump Shreds ‘Radical Left Group of Lunatics’ Over Kirk Killing — Urges Non-Violent Response from His Supporters",
    "description": "President Donald Trump entertained a few questions from the press while on his way to Marine One on Thursday afternoon — during which he again slammed “radical left group of lunatics” over the assassination of conservative activist Charlie Kirk. One reporter …",
    "link": "https://www.mediaite.com/media/news/trump-shreds-radical-left-group-of-lunatics-over-kirk-killing-urges-non-violent-response-from-his-supporters/",
    "timestamp": "2025-09-11T21:44:02Z"
  },
  {
    "title": "GOP goes nuclear in Senate, changing rules to speed confirmation of Trump nominees after negotiations with Democrats collapse",
    "description": "Republicans jammed through a change to Senate rules on Thursday that will allow them to more quickly confirm many of President Donald Trump’s nominees.",
    "link": "https://www.cnn.com/2025/09/11/politics/nuclear-option-senate-trump-nominees",
    "timestamp": "2025-09-11T21:43:58Z"
  },
  {
    "title": "Judge cuts off Ryan Routh's opening statement in unusual day at Trump assassination attempt trial",
    "description": "The trial for the Florida man accused of attempting to assassinate then-candidate Donald Trump began on Thursday. CBS News legal reporter Katrina Kaufman has the details.",
    "link": "https://www.cbsnews.com/video/judge-cuts-off-ryan-routh-opening-statement-trump-assassination-attempt-trial/",
    "timestamp": "2025-09-11T21:43:00Z"
  },
  {
    "title": "Trump Lets Putin Off The Hook After Russian Attack On NATO Ally Poland: ‘Could Have Been a Mistake’",
    "description": "“It could have been a mistake, but regardless, I'm not happy about anything having to do with that whole situation, but hopefully it's going to come to an end”\nThe post Trump Lets Putin Off The Hook After Russian Attack On NATO Ally Poland: ‘Could Have Been a…",
    "link": "https://www.mediaite.com/politics/trump-lets-putin-off-the-hook-after-russian-attack-on-nato-ally-poland-could-have-been-a-mistake/",
    "timestamp": "2025-09-11T21:42:27Z"
  },
  {
    "title": "Exclusive–UIOWA Repeat Offender Fails in Attempt to Mock YAF 9/11 Memorial with Paper Airplanes",
    "description": "The University of Iowa Young Americans for Freedom (YAF) chapter’s annual September 11 ‘Never Forget’ memorial was targeted Wednesday by a student who threw a paper airplane at the display. One effort fell short, while another reached the memorial but caused …",
    "link": "https://www.breitbart.com/politics/2025/09/11/exclusive-uiowa-repeat-offender-fails-in-attempt-to-mock-yaf-9-11-memorial-with-paper-airplanes/",
    "timestamp": "2025-09-11T21:42:06Z"
  },
  {
    "title": "Projects designed by BIG and KPF among eight vying for New York casino licenses",
    "description": "BIG, Gensler, and KPF are among the architecture studios involved in ongoing bids for three casino licenses set to be awarded later this year for developments around New York, with multiple including skyscrapers. Currently, eight projects throughout Manhattan…",
    "link": "https://www.dezeen.com/2025/09/11/new-york-city-casino-gambling-licenses-2025/",
    "timestamp": "2025-09-11T21:41:20Z"
  },
  {
    "title": "Charlie Kirk Suspected Shooter Revealed: Everything We Know About the FBI’s Person …",
    "description": "Reading Time: 3 minutesHere's everything we know about the person being sought in connection with Charlie Kirk's murder.\nCharlie Kirk Suspected Shooter Revealed: Everything We Know About the FBI’s Person … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/charlie-kirk-suspected-shooter-revealed-everything-we-know-about-the-fbis-person-of-interest/",
    "timestamp": "2025-09-11T21:40:56Z"
  },
  {
    "title": "Scarborough Spoke With President Trump After Charlie Kirk Shooting",
    "description": "In the wake of the assassination of Charlie Kirk, there were surely many people who would have liked to speak with President Trump. So, it's notable, for better or worse, that the president apparently accepted Joe Scarborough's call. On today's Morning Joe, S…",
    "link": "https://freerepublic.com/focus/f-bloggers/4339839/posts",
    "timestamp": "2025-09-11T21:40:39Z"
  },
  {
    "title": "Warner Bros Discovery shares surge on buyout reports",
    "description": "The reported bid would be for a business which includes news network CNN, HBO, and the film studio behind Barbie and Harry Potter.",
    "link": "https://www.bbc.com/news/articles/cz9jed2qpq1o",
    "timestamp": "2025-09-11T21:39:49Z"
  },
  {
    "title": "Open Thread: Charlie Kirk’s Impact",
    "description": "Don't be surprised if whoever killed Charlie Kirk has no coherent political ideology, didn't do it for any particular reason, and doesn’t fall anywhere neat on the left/right paradigm. — Mike Rothschild (@rothschildmd.bsky.social) September 10, 2025 at 6:13 P…",
    "link": "https://balloon-juice.com/2025/09/11/open-thread-charlie-kirks-impact/",
    "timestamp": "2025-09-11T21:39:20Z"
  },
  {
    "title": "Donald Trump is lying about political violence",
    "description": "Charlie Kirk, the influential right-wing activist, was shot and killed Wednesday on a college campus in Utah. The shooter is still at large, and as of this writing, little is publicly known about the shooter’s identity or the potential ideological motive behi…",
    "link": "https://www.vox.com/politics/461314/charlie-kirk-death-trump-political-violence-source",
    "timestamp": "2025-09-11T21:37:51Z"
  },
  {
    "title": "Number of Americans filing for jobless benefits last week hits 263,000; most in nearly 4 years",
    "description": "U.S. jobless claim applications jumped to their highest level in almost four years last week, the latest sign that the labor market is softening. The number of Americans filing for unemployment benefits for the week ending Sept. 6 rose 27,000 to 263,000, the …",
    "link": "https://japantoday.com/category/business/the-number-of-americans-filing-for-jobless-benefits-last-week-hits-263-000-most-in-nearly-4-years",
    "timestamp": "2025-09-11T21:37:15Z"
  },
  {
    "title": "Japanese firms' mood turns positive as tariff fears ease: gov't survey",
    "description": "Major Japanese companies took a positive view of business conditions in the three months through September for the first time in two quarters, a government survey showed Thursday, reflecting recovering chip demand and easing concerns about U.S. tariffs. The k…",
    "link": "https://japantoday.com/category/business/japan-firms%27-mood-turns-positive-as-tariff-fears-ease-gov%27t-survey",
    "timestamp": "2025-09-11T21:37:05Z"
  },
  {
    "title": "Charlie Kirk’s casket to be flown on Air Force Two",
    "description": "Conservative influencer Charlie Kirk’s body will be flown from Utah to Phoenix on Air Force Two on Thursday, the airplane reserved for the vice president, sources familiar with the plans confirmed to MSNBC and NBC News",
    "link": "https://www.msnbc.com/top-stories/latest/charlie-kirk-casket-air-force-two-vance-plane-rcna230695",
    "timestamp": "2025-09-11T21:37:04Z"
  },
  {
    "title": "Trump says he has an 'indication' on Kirk killer's motive",
    "description": "United States President Donald Trump said on Thursday that he has \"an indication\" of what motivated the killing of conservative activist Charlie Kirk.\n\"But we'll let you know about...",
    "link": "https://biztoc.com/x/842071e5c121a5f8",
    "timestamp": "2025-09-11T21:35:42Z"
  },
  {
    "title": "S Korea's Lee stresses separating wartime issues from Japan cooperation",
    "description": "South Korean President Lee Jae Myung said Thursday that he will continue to emphasize the importance of separating wartime issues from Japan bilateral cooperation, calling for further enhanced economic ties with the neighboring country. Referring to the polic…",
    "link": "https://japantoday.com/category/politics/s.-korea%27s-lee-stresses-separating-wartime-issues-from-japan-cooperation",
    "timestamp": "2025-09-11T21:35:40Z"
  },
  {
    "title": "Trump Assassination Attempt Trial Gets Off To A Bizarre Start",
    "description": "Defendant Ryan Routh had his opening statement cut short after veering off topic to talk about Adolf Hitler and the war in Gaza.",
    "link": "https://www.huffpost.com/entry/ryan-routh-trump-assassin-attempt-trial_n_68c3361be4b0e84178209bdd",
    "timestamp": "2025-09-11T21:34:18Z"
  },
  {
    "title": "Ex-Brazilian president Jair Bolsonaro found guilty of coup charges",
    "description": "The ruling makes Jair Bolsonaro the first former president in the country’s history to be convicted of attacking democracy.",
    "link": "https://www.abc.net.au/news/2025-09-12/brazil-bolsonaro-guilty-of-coup-charges/105765198",
    "timestamp": "2025-09-11T21:34:08Z"
  },
  {
    "title": "‘Pick up that blood-stained microphone’: Ben Shapiro vows to keep up campus appearances",
    "description": "Promises those who would intimidate, 'we are not going to stop'",
    "link": "https://www.wnd.com/2025/09/pick-up-that-blood-stained-microphone-ben-shapiro/",
    "timestamp": "2025-09-11T21:33:51Z"
  },
  {
    "title": "Brazil’s Bolsonaro faces prison after coup plotting conviction",
    "description": "Brazil’s Supreme Court on Thursday convicted firebrand ex-president Jair Bolsonaro of plotting a coup, sealing his fate with a 4-1 vote that could send him to prison for the rest of his life. All but one judge found the 70-year-old guilty of plotting to overt…",
    "link": "https://www.digitaljournal.com/world/brazils-bolsonaro-faces-prison-after-coup-plotting-conviction/article",
    "timestamp": "2025-09-11T21:32:20Z"
  },
  {
    "title": "Belarus frees 52 prisoners after Trump appeal; U.S. eases some sanctions on Minsk",
    "description": "Belarus freed 52 prisoners including an EU employee on Thursday after an appeal from U.S. President Donald Trump, as Washington and Minsk flirted with a rapprochement that many European leaders have viewed skeptically. Trump had previously urged Belarusian Pr…",
    "link": "https://japantoday.com/category/world/belarus-frees-52-prisoners-after-trump-appeal-us-eases-some-sanctions-on-minsk4",
    "timestamp": "2025-09-11T21:32:00Z"
  },
  {
    "title": "People killed in U.S. boat strike were not Tren de Aragua, Venezuela minister says",
    "description": "None of the 11 people killed in a U.S. military strike on a boat in the Caribbean last week were members of Venezuelan gang Tren de Aragua, Venezuela's interior minister said on Thursday, as the South American nation deployed troops amid heightened tensions w…",
    "link": "https://japantoday.com/category/world/people-killed-in-us-boat-strike-were-not-tren-de-aragua-venezuela-minister-says2",
    "timestamp": "2025-09-11T21:31:53Z"
  },
  {
    "title": "Baltic states prepare push to save U.S. security assistance from Pentagon cuts",
    "description": "The parliaments of Lithuania, Latvia, and Estonia are preparing a joint letter asking key committee heads in the U.S. Congress to save a major security assistance program in the face of ongoing Russian threats, according to a draft of the note and two people …",
    "link": "https://japantoday.com/category/world/baltic-states-prepare-push-to-save-us-security-assistance-from-pentagon-cuts1",
    "timestamp": "2025-09-11T21:31:47Z"
  },
  {
    "title": "Brazil's Bolsonaro guilty of coup charges, court majority decides in landmark trial",
    "description": "Former Brazilian President Jair Bolsonaro was convicted by a Supreme Court majority on Thursday of plotting a coup to remain in power after losing the 2022 election, a powerful blow to the populist far-right movement he created. The presumptive ruling by a ma…",
    "link": "https://japantoday.com/category/world/brazil%27s-bolsonaro-guilty-of-coup-charges-court-majority-decides-in-landmark-trial",
    "timestamp": "2025-09-11T21:31:42Z"
  },
  {
    "title": "Britain's Mandelson fired as U.S. ambassador over Epstein links",
    "description": "Peter Mandelson, Britain's urbane ambassador to the U.S., was sacked by Prime Minister Keir Starmer on Thursday after a trove of emails revealed the depth of his ties with the late convicted U.S. sex offender Jeffrey Epstein. Known for his behind-the-scenes m…",
    "link": "https://japantoday.com/category/world/britain%27s-mandelson-fired-as-us-ambassador-over-epstein-links",
    "timestamp": "2025-09-11T21:31:30Z"
  },
  {
    "title": "Americans mark 24th anniversary of 9/11 attacks with emotional ceremonies",
    "description": "Nearly a quarter century has passed since the Sept 11, 2001, attacks, but for many, the emotions of the day remain raw as ever. On Thursday, America marked the 24th anniversary of the deadly attacks with solemn ceremonies in New York, at the Pentagon and in S…",
    "link": "https://japantoday.com/category/world/Americans-mark-24th-anniversary-of-the-9-11-attacks-with-emotional-ceremonies",
    "timestamp": "2025-09-11T21:31:18Z"
  },
  {
    "title": "U.S. threatens action against foreigners praising Kirk killing",
    "description": "U.S. Deputy Secretary of State Christopher Landau on Thursday warned that Washington may take action against foreigners &quot;praising, rationalizing, or making light&quot; of the killing of conservative activist Charlie Kirk, adding he had directed consular …",
    "link": "https://japantoday.com/category/world/us-threatens-action-against-foreigners-praising-kirk-killing",
    "timestamp": "2025-09-11T21:31:11Z"
  },
  {
    "title": "Trump and other US leaders tighten security as hunt for Charlie Kirk's killer continues",
    "description": "Political figures across the US are adding security and canceling events, as universities receive threats.",
    "link": "https://www.bbc.com/news/articles/c36k0g44yd5o",
    "timestamp": "2025-09-11T21:31:06Z"
  },
  {
    "title": "U.S. authorities find rifle, release photos in hunt for killer of Charlie Kirk",
    "description": "U.S. investigators said on Thursday they had found the bolt-action rifle they believed was used to kill the influential conservative activist Charlie Kirk and released images of a person of interest as they searched for the shooter they described as college a…",
    "link": "https://japantoday.com/category/world/u.s.-authorities-find-rifle-release-photos-in-hunt-for-killer-of-charlie-kirk2",
    "timestamp": "2025-09-11T21:31:01Z"
  },
  {
    "title": "After Charlie Kirk’s murder, what lies ahead could be terrible",
    "description": "Something is profoundly broken in America — and we're all at risk",
    "link": "https://www.salon.com/2025/09/11/after-charlie-kirks-murder-what-lies-ahead-could-be-terrible/",
    "timestamp": "2025-09-11T21:30:38Z"
  },
  {
    "title": "Epstein Birthday Book Renews Pressure On Trump, Other Former Pals",
    "description": "A decades-old book of cheerful, often lewd birthday messages has set off a political bomb in Washington -- helping bring down the British ambassador and inflaming the most perilous scandal of Donald Trump's presidency.",
    "link": "https://www.ibtimes.com/epstein-birthday-book-renews-pressure-trump-other-former-pals-3783142",
    "timestamp": "2025-09-11T21:30:26Z"
  },
  {
    "title": "Brazil's Bolsonaro Faces Prison After Coup Plotting Conviction",
    "description": "Brazil's Supreme Court on Thursday convicted firebrand ex-president Jair Bolsonaro of plotting a coup, sealing his fate with a 4-1 vote that could send him to prison for the rest of his life.",
    "link": "https://www.ibtimes.com/brazils-bolsonaro-faces-prison-after-coup-plotting-conviction-3783139",
    "timestamp": "2025-09-11T21:30:25Z"
  },
  {
    "title": "Security Failures Took Charlie Kirk—Not Guns",
    "description": "The assassination of Charlie Kirk wasn’t a gun problem — it was a catastrophic security collapse. Here’s what went wrong and how to stop it from happening again.\nThe post Security Failures Took Charlie Kirk—Not Guns appeared first on The Truth About Guns.",
    "link": "https://www.thetruthaboutguns.com/charlie-kirk-assassination-security-failures/",
    "timestamp": "2025-09-11T21:30:00Z"
  },
  {
    "title": "Donald Trump 'Played a Huge Part' in Charlie Kirk's Assassination, Rages Dave Portnoy — as Barstool Sports CEO Slams 'Insane' Left Wing Over Tragic Killing of Conservative Influencer",
    "description": "The businessman said there is plenty of blame to go around.",
    "link": "https://radaronline.com/p/trump-charlie-kirk-assassination-dave-portnoy-barstool-sports/",
    "timestamp": "2025-09-11T21:30:00Z"
  },
  {
    "title": "Was Charlie Kirk’s Family There When He Was Shot Dead? About the Horrifying Incident",
    "description": "Kirk's fatal shooting has gripped the nation, and mourners are concerned about his family.",
    "link": "https://hollywoodlife.com/2025/09/11/was-charlie-kirks-family-there-when-he-was-shot/",
    "timestamp": "2025-09-11T21:29:39Z"
  },
  {
    "title": "The right side of the president’s face sparked a wave of online speculation on Thursday.",
    "description": "President Donald Trump was sporting a doozy of a droopy face as he ventured outside the White House Thursday amid mounting questions about his health. The 79...",
    "link": "https://www.thedailybeast.com/trump-79-called-out-for-droopy-face-at-911-memorial/",
    "timestamp": "2025-09-11T21:28:37Z"
  },
  {
    "title": "Graphic video of Kirk shooting was everywhere online, showing how media gatekeeper role has changed",
    "description": "They were careful with the explicit imagery — as usual. But did it make any difference? Traditional news organizations were cautious in their midafternoon coverage of Charlie Kirk's assassination Wednesday not to depict the moment he was shot, instead showing…",
    "link": "https://japantoday.com/category/features/opinions/graphic-video-of-kirk-shooting-was-everywhere-online-showing-how-media-gatekeeper-role-has-changed",
    "timestamp": "2025-09-11T21:28:22Z"
  },
  {
    "title": "Who could replace Peter Mandelson as US ambassador?",
    "description": "Sir Keir Starmer is scrambling to find a new US ambassador after sacking Lord Peter Mandelson over fresh revelations about his friendship with paedophile Jeffry Epstein.",
    "link": "https://news.sky.com/story/who-could-replace-peter-mandelson-as-us-ambassador-13429000",
    "timestamp": "2025-09-11T21:28:00Z"
  },
  {
    "title": "NFL Star Lamar Jackson Shares Super Bowl Champ's Message After Charlie Kirk Assassination",
    "description": "Jackson shared Kirk's Christian message back in AugustCharlie Kirk praised Baltimore Ravens quarterback Lamar Jackson in the weeks before the conservative influencer was assassinated on a Utah campus on Wednesday. Jackson took heat in August for sharing a Bib…",
    "link": "https://freerepublic.com/focus/f-chat/4339836/posts",
    "timestamp": "2025-09-11T21:27:07Z"
  },
  {
    "title": "The Justice Department is reportedly assembling an unprecedented national voter database",
    "description": "The New York Times reports that the Justice Department is putting together a voter roll that could be misused to spread false claims about immigrants voting.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-doj-national-voter-database-non-citizens-rcna230393",
    "timestamp": "2025-09-11T21:26:22Z"
  },
  {
    "title": "Majority of Brazil top court panel votes to convict Bolsonaro of coup plot",
    "description": "Brazil's far-right former president faces the possibility of decades behind bars.",
    "link": "https://www.aljazeera.com/news/2025/9/11/brazils-bolsonaro-found-guilty-of-coup-plot-by-top-court",
    "timestamp": "2025-09-11T21:26:19Z"
  },
  {
    "title": "LAURA INGRAHAM: The Charlie Kirk I knew",
    "description": "The assassination of Charlie Kirk ends the life of a conservative leader who had profound influence on young Americans' political thinking through campus debates.",
    "link": "https://www.foxnews.com/opinion/laura-ingraham-charlie-kirk-i-knew",
    "timestamp": "2025-09-11T21:25:58Z"
  },
  {
    "title": "Trump: 'Hopefully' Israel's Doha strike 'won't affect' hostage deal",
    "description": "United States President Donald Trump voiced his hope that Israel's strike aimed at Hamas leadership in Doha won't affect the hostage deal with the Palestinian militant group.\n\"Hopefully,...",
    "link": "https://biztoc.com/x/c6fc039c42279d1a",
    "timestamp": "2025-09-11T21:24:19Z"
  },
  {
    "title": "Trump: Russian drones in Poland 'could have been a mistake'",
    "description": "United States President Donald Trump told reporters on Thursday that Russia's drone incursion into Poland on Wednesday \"could have been a mistake.\"\n\"But regardless, I'm not hap...",
    "link": "https://biztoc.com/x/ca5c3904de955e31",
    "timestamp": "2025-09-11T21:24:19Z"
  },
  {
    "title": "Can Fed Independence Survive Donald Trump?",
    "description": "",
    "link": "https://biztoc.com/x/ff86e33e4090991d",
    "timestamp": "2025-09-11T21:24:16Z"
  },
  {
    "title": "GOP goes nuclear in Senate, changing rules to speed confirmation of Trump nominees after negotiations with Democrats collapse",
    "description": "Republicans jammed through a change to Senate rules on Thursday that will allow them to more quickly confirm many of President Donald Trump’s nominees. The move came over the objections of Democrats after bipartisan negotiations collapsed. The rules change wi…",
    "link": "https://freerepublic.com/focus/f-news/4339834/posts",
    "timestamp": "2025-09-11T21:23:54Z"
  },
  {
    "title": "Epstein birthday book renews pressure on Trump, other former pals",
    "description": "A decades-old book of cheerful, often lewd birthday messages has set off a political bomb in Washington — helping bring down the British ambassador and inflaming the most perilous scandal of Donald Trump’s presidency. Compiled to celebrate Jeffrey Epstein’s 5…",
    "link": "https://www.digitaljournal.com/world/epstein-birthday-book-renews-pressure-on-trump-other-former-pals/article",
    "timestamp": "2025-09-11T21:23:18Z"
  },
  {
    "title": "Brazil’s Bolsonaro: US-backed firebrand at risk of future behind bars",
    "description": "As a military man Brazil’s ex-president Jair Bolsonaro had a reputation for disobeying orders. As head of state from 2019 to 2022, he thumbed his nose at institutions.  Now he risks 40 years in prison for what prosecutors describe as his most egregious act of…",
    "link": "https://www.digitaljournal.com/news/brazils-bolsonaro-us-backed-firebrand-at-risk-of-future-behind-bars/article",
    "timestamp": "2025-09-11T21:23:18Z"
  },
  {
    "title": "Brazil’s Bolsonaro: US-backed firebrand at risk of future behind bars",
    "description": "As a military man Brazil’s ex-president Jair Bolsonaro had a reputation for disobeying orders. As head of state from 2019 to 2022, he thumbed his nose at institutions.  Now he risks 40 years in prison for what prosecutors describe as his most egregious act of…",
    "link": "https://www.digitaljournal.com/world/brazils-bolsonaro-us-backed-firebrand-at-risk-of-future-behind-bars/article",
    "timestamp": "2025-09-11T21:23:18Z"
  },
  {
    "title": "Man accused of trying to kill Trump is scolded by the judge during opening arguments in his trial",
    "description": "The man accused of attempting to gun down Donald Trump on a Florida golf course was scolded by the judge Thursday as he served as his own lawyer",
    "link": "https://www.nbcnews.com/news/us-news/man-accused-trying-kill-trump-scolded-judge-opening-arguments-trial-rcna230591",
    "timestamp": "2025-09-11T21:22:42Z"
  },
  {
    "title": "BOLSONARO TRIAL: Brazilian Supreme Court Panel Votes to Convict Former President of Bogus ‘Coup D’état’ Charges – Decision Can Be Appealed – UPDATE: Bolsonaro Sentenced to 27 Years in Prison",
    "description": "The unhinged Brazilian Supreme Court has formed a majority to convict Bolsonaro in the ‘Witch-Hunt’.\nThe post BOLSONARO TRIAL: Brazilian Supreme Court Panel Votes to Convict Former President of Bogus ‘Coup D’état’ Charges – Decision Can Be Appealed – UPDATE: …",
    "link": "https://www.thegatewaypundit.com/2025/09/bolsonaro-trial-brazilian-supreme-court-panel-votes-convict/",
    "timestamp": "2025-09-11T21:20:47Z"
  },
  {
    "title": "What Charlie Kirk meant to young conservatives",
    "description": "Charlie Kirk, the 31-year-old conservative activist and firebrand, developed an enormous following, particularly among young people, for his brash, unapologetic positions on social issues. The investigation continues into the circumstances of his killing on W…",
    "link": "https://www.vox.com/today-explained-podcast/461313/charlie-kirk-death-shot-young-conservatives-tpusa",
    "timestamp": "2025-09-11T21:20:24Z"
  },
  {
    "title": "Some Red States Are Trying to Take Control of Their Blue Cities",
    "description": "Trump’s federal takeover of D.C. was just one example of Republicans curbing local autonomy under the banner of public safety.",
    "link": "https://reason.com/2025/09/11/some-red-states-are-trying-to-take-control-of-their-blue-cities/",
    "timestamp": "2025-09-11T21:20:12Z"
  },
  {
    "title": "Israel’s Regional War",
    "description": "The Israeli military has now bombed several countries in addition to its assault on Gaza.",
    "link": "http://foreignpolicy.com/2025/09/11/israel-qatar-yemen-bombing-countries-gaza-war/",
    "timestamp": "2025-09-11T21:19:35Z"
  },
  {
    "title": "Texas drops lawsuit against doctor accused of illegally providing care to transgender youth",
    "description": "Dr. Hector Granados had been accused of falsifying medical records.",
    "link": "https://www.bostonherald.com/2025/09/11/transgender-health-care-doctors/",
    "timestamp": "2025-09-11T21:15:51Z"
  },
  {
    "title": "'1 Nazi Down': Iowa High School Teacher Placed on Administrative Leave After Post Celebrating Charlie Kirk's Assassination",
    "description": "A high school art teacher in Oskaloosa, Iowa, is accused of celebrating the assassination of Turning Point USA founder Charlie Kirk online.\nThe post ‘1 Nazi Down’: Iowa High School Teacher Placed on Administrative Leave After Post Celebrating Charlie Kirk’s A…",
    "link": "https://www.breitbart.com/education/2025/09/11/1-nazi-down-iowa-teacher-accused-of-celebrating-charlie-kirks-assassination/",
    "timestamp": "2025-09-11T21:15:17Z"
  },
  {
    "title": "JD and Usha Vance to Accompany Charlie Kirk's Remains to Phoenix Aboard Air Force Two",
    "description": "Breitbart News can confirm that Vice President JD Vance and Second Lady Usha Vance will accompany Turning Point USA Founder Charlie Kirk's casket as it is transported to Phoenix, Arizona, aboard Air Force Two.  \nThe post JD and Usha Vance to Accompany Charlie…",
    "link": "https://www.breitbart.com/politics/2025/09/11/jd-and-usha-vance-to-accompany-charlie-kirks-remains-to-phoenix-aboard-air-force-two/",
    "timestamp": "2025-09-11T21:15:02Z"
  },
  {
    "title": "FBI Offering $100K Reward for Info Leading to the Arrest of Charlie Kirk's Assassin",
    "description": "The FBI is offering up to a $100,000 reward for information that leads to the arrest of Turning Point USA Founder Charlie Kirk's assassin.\nThe post FBI Offering $100K Reward for Info Leading to the Arrest of Charlie Kirk’s Assassin appeared first on Breitbart.",
    "link": "https://www.breitbart.com/law-and-order/2025/09/11/fbi-offering-100k-reward-for-info-leading-to-the-arrest-of-charlie-kirks-assassin/",
    "timestamp": "2025-09-11T21:14:55Z"
  },
  {
    "title": "GOP triggers nuclear option in Senate to break Dem blockade of Trump nominees",
    "description": "Republicans changed Senate rules to allow President Donald Trump's nominees to be voted on in batches, following months of Democratic opposition to fast-track confirmations.",
    "link": "https://www.foxnews.com/politics/gop-triggers-nuclear-option-senate-break-dem-blockade-trump-nominees",
    "timestamp": "2025-09-11T21:14:13Z"
  },
  {
    "title": "Trump tries to distance U.S. from Israel’s strike on Qatar amid fury from Arab leaders",
    "description": "Just a few months ago, the rulers of Saudi Arabia, the United Arab Emirates and Qatar welcomed U.S. President Donald Trump to their palaces with camel parades and pomp. Now, those same leaders are united in anger after Israel’s strike targeting Hamas leaders …",
    "link": "https://biztoc.com/x/47d09d424e8795fe",
    "timestamp": "2025-09-11T21:13:11Z"
  },
  {
    "title": "Senate GOP goes ‘nuclear’ to break Trump nominee gridlock",
    "description": "Senate Republicans deployed the so-called “nuclear option” on Thursday to begin clearing a pileup of President Donald Trump’s nominees, paving the way for them to be confirmed in potentially large groups starting next week. \nThe 53-45 vote to change the rule …",
    "link": "https://biztoc.com/x/472f4fd71f1f3e70",
    "timestamp": "2025-09-11T21:12:57Z"
  },
  {
    "title": "Senate Republicans trigger 'nuclear option,' changing rules to speed up Trump nominees",
    "description": "Republicans triggered the \"nuclear option\" to change the Senate's rules to speed up confirmation of President Donald Trump's nominees.",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-nuclear-option-change-rules-trump-nominees-rcna230565",
    "timestamp": "2025-09-11T21:11:37Z"
  },
  {
    "title": "ESPN's Pat McAfee speaks out after Charlie Kirk's assassination: 'Pivotal moment' for America",
    "description": "Former NFL punter Pat McAfee said the Charlie Kirk assassination left him startled and sadden. The tragic events also made McAfee question what it means for America’s future.",
    "link": "https://www.foxnews.com/sports/espns-pat-mcafee-speaks-out-after-charlie-kirks-assassination-pivotal-moment-america",
    "timestamp": "2025-09-11T21:11:04Z"
  },
  {
    "title": "Honoring the Memory of Charlie Kirk (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nHonoring the Memory of Charlie Kirk  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  As a mark of respect for the memory of Charlie Kirk, by the authority vested in me as President of the United States by t…",
    "link": "https://www.memeorandum.com/250911/p140",
    "timestamp": "2025-09-11T21:10:00Z"
  },
  {
    "title": "Democrat leaders and Ocasio-Cortez politicize Kirk killing while scolding Trump for blaming the left",
    "description": "As the manhunt continues for the assassin in the killing of Charlie Kirk, Democratic leaders are deflecting blame while hypocritically pointing the finger at Republicans. Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries, both New…",
    "link": "https://www.theblaze.com/news/schumer-aoc-jeffries-kirk-death",
    "timestamp": "2025-09-11T21:10:00Z"
  },
  {
    "title": "Charlie Kirk was very clear about who is better: Michael Jordan or LeBron James; there's no debate!",
    "description": "September 10, 2025, will be remembered as one of the most distressing days in United States history. The assassination of political activist Charlie Kirk has struck the country bru",
    "link": "https://www.marca.com/en/basketball/nba/los-angeles-lakers/2025/09/11/68c32adee2704efa2d8b45ea.html",
    "timestamp": "2025-09-11T21:09:16Z"
  },
  {
    "title": "Tesla Engineer Says He’s Quitting Over Musk’s Leadership",
    "description": "A Tesla engineer in charge of the company’s European energy trading algorithms said he quit the company because of what he calls CEO Elon Musk’s “seriously compromised” leadership.",
    "link": "https://financialpost.com/pmn/business-pmn/tesla-engineer-says-hes-quitting-over-musks-leadership",
    "timestamp": "2025-09-11T21:09:12Z"
  },
  {
    "title": "Comedy Central pulls 'South Park' episode following Charlie Kirk's fatal shooting",
    "description": "The \"South Park\" episode, which features one of its main characters, Eric Cartman, parodying Charlie Kirk, was pulled after Kirk was shot and killed Wednesday.",
    "link": "https://abcnews.go.com/GMA/News/comedy-central-pulls-south-park-episode-charlie-kirks/story?id=125483613",
    "timestamp": "2025-09-11T21:08:35Z"
  },
  {
    "title": "Parents of disabled students wary of Education Department cuts",
    "description": "Thousands of parents have filed complaints to the Education Department.",
    "link": "https://abcnews.go.com/Health/parents-disabled-students-wary-education-department-cuts/story?id=125479999",
    "timestamp": "2025-09-11T21:08:04Z"
  },
  {
    "title": "After Kirk’s Death, a False Social Media Post on Partisan Reaction to Violence",
    "description": "After the fatal shooting of conservative activist Charlie Kirk, social media claims offering political views of the assassination and the reaction to it quickly spread. One message falsely claimed that \"not a single Republican condemned\" the targeted shooting…",
    "link": "https://www.factcheck.org/2025/09/after-kirks-death-a-false-social-media-post-on-partisan-reaction-to-violence/",
    "timestamp": "2025-09-11T21:07:27Z"
  },
  {
    "title": "Paramount Skydance prepares Ellison-backed bid for Warner Bros. Discovery",
    "description": "Paramount Skydance is preparing a majority cash bid to acquire all of Warner Bros. Discovery — including its cable networks and movie studio…\nThe post Paramount Skydance prepares Ellison-backed bid for Warner Bros. Discovery appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/09/11/paramount-skydance-prepares-ellison-backed-bid-for-warner-bros-discovery/",
    "timestamp": "2025-09-11T21:05:59Z"
  },
  {
    "title": "U of T prof who made shooting comment after Charlie Kirk assassination now on leave",
    "description": "'Shooting is honestly too good for so many of you fascist c--ts,' University of Toronto professor Ruth Marshall said on X.",
    "link": "https://nationalpost.com/news/toronto/university-toronto-ruth-marshall-social-media-charlie-kirk-assassination",
    "timestamp": "2025-09-11T21:04:45Z"
  },
  {
    "title": "Iranian State Media: Charlie Kirk a 'Venomous and Deeply Problematic' 'Genocide Denier'",
    "description": "The Iranian government website PressTV, owned by the Islamic Republic of Iran Broadcasting (IRIB), published multiple screeds insulting slain conservative commentator Charlie Kirk on Wednesday, mere hours after an assassin ended his life by shooting him in th…",
    "link": "https://www.breitbart.com/middle-east/2025/09/11/iranian-state-media-charlie-kirk-a-venomous-and-deeply-problematic-genocide-denier/",
    "timestamp": "2025-09-11T21:03:06Z"
  },
  {
    "title": "Trump and Vance gush over extremist at Christian nationalist conference",
    "description": "President Donald Trump and his vice president, JD Vance, issued videotaped remarks to attendees at a conference hosted by an avowed Christian nationalist this week.",
    "link": "https://biztoc.com/x/4a29f855845da798",
    "timestamp": "2025-09-11T21:01:58Z"
  },
  {
    "title": "Market Expert Says Sell All Your XRP Once This Happens",
    "description": "Crypto analyst Egrag Crypto has alluded to an event that could warrant investors having to offload their XRP holdings. The analyst described this potential event as a sign and urged investors to sell everything if it ever happens.  Analyst Advises XRP Holders…",
    "link": "https://bitcoinist.com/sell-your-xrp-once-this-happens/",
    "timestamp": "2025-09-11T21:00:50Z"
  },
  {
    "title": "Democratic lawmaker demands Trump rescind Jan 6 pardons in response to Kirk assassination",
    "description": "Massachusetts Democrat Seth Moulton cited statistics showing 76% of extremist violent attacks come from right-wing sources while condemning political violence on both sides.",
    "link": "https://www.foxnews.com/media/democratic-lawmaker-demands-trump-rescind-jan-6-pardons-response-kirk-assassination",
    "timestamp": "2025-09-11T21:00:23Z"
  },
  {
    "title": "Tucker Carlson’s ALP Donates $1 Million To Kirk Family, Launches Donation Site",
    "description": "ALP is donating $1 million to Charlie Kirk's family and has set up a GiveSendGo website in memory of the slain activist, the Caller has learned.",
    "link": "https://dailycaller.com/2025/09/11/tucker-carlson-neil-patel-alp-charlie-erika-kirk-family-assassination-donate/",
    "timestamp": "2025-09-11T20:59:47Z"
  },
  {
    "title": "Trump tries to distance U.S. from Israel’s strike on Qatar amid fury from Arab leaders",
    "description": "Just a few months ago, the rulers of Saudi Arabia, the United Arab Emirates and Qatar welcomed U.S. President Donald Trump to their palaces with camel parades and pomp. Now, those same leaders are united in anger after Israel’s strike targeting Hamas leaders …",
    "link": "https://www.pbs.org/newshour/politics/trump-tries-to-distance-u-s-from-israels-strike-on-qatar-amid-fury-from-arab-leaders",
    "timestamp": "2025-09-11T20:57:06Z"
  },
  {
    "title": "Ley leadership speculation begins in earnest",
    "description": "Speculation over the leadership of the Liberal Party is coming thick and fast in the wake of the Jacinta Nampijinpa Price fiasco, and the FBI has released images of a 'person of interest' in the Charlie Kirk shooting.\nThe post Ley leadership speculation begin…",
    "link": "http://www.crikey.com.au/2025/09/12/sussan-ley-jacinta-price-liberal-leadership-charlie-kirk-shooter/",
    "timestamp": "2025-09-11T20:56:55Z"
  },
  {
    "title": "‘The West Wing’ Star Joshua Malina Smears Trump as a ‘Dangerous, Hateful Lunatic’ over His WH Response to Charlie Kirk’s Assassination",
    "description": "Actor and \"Scandal\" star Joshua Malina attacked President Donald Trump and called him a \"dangerous, hateful lunatic\" for the president's response to the assassination of conservative rockstar Charlie Kirk.\nThe post ‘The West Wing’ Star Joshua Malina Smears Tr…",
    "link": "https://www.breitbart.com/entertainment/2025/09/11/the-west-wing-star-joshua-malina-smears-trump-as-a-dangerous-hateful-lunatic-over-his-wh-response-to-charlie-kirks-assassination/",
    "timestamp": "2025-09-11T20:56:38Z"
  },
  {
    "title": "Bolsonaro's coup trial gripped Brazil - and his conviction will divide the country",
    "description": "The ex-president's conviction is a milestone critics will welcome, though his punishment remains unclear.",
    "link": "https://www.bbc.com/news/articles/cj3yekj2xygo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-11T20:55:51Z"
  },
  {
    "title": "How Charlie Kirk Used Controversy—Often Delivered In Person—to Construct Our New Media Ecosystem",
    "description": "With his relentless approach and online inescapability, the young conservative movement leader built a culture war behemoth.",
    "link": "https://www.vanityfair.com/news/story/charlie-kirk-new-media-ecosystem",
    "timestamp": "2025-09-11T20:55:22Z"
  },
  {
    "title": "NC lawmakers likely to propose tougher pretrial release laws after fatal stabbing",
    "description": "North Carolina's Republican legislative leaders are pushing for stricter pretrial release laws after a Ukrainian refugee was fatally stabbed on a Charlotte train",
    "link": "https://abcnews.go.com/US/wireStory/nc-lawmakers-propose-tougher-pretrial-release-laws-after-125492251",
    "timestamp": "2025-09-11T20:55:08Z"
  },
  {
    "title": "Trump asks appeals court to let him fire Lisa Cook before next week's Fed meeting",
    "description": "Trump wants the Fed to slash rates in order to spur economic growth and reduce the cost of paying the nation's debts.",
    "link": "https://www.cnbc.com/2025/09/11/trump-lisa-cook-fed-lawsuit-fomc.html",
    "timestamp": "2025-09-11T20:54:21Z"
  },
  {
    "title": "The world’s top diplomat isn’t the man who holds the UN title",
    "description": "U.N. Secretary-General António Guterres, tasked with impartial global mediation, plays the partisan; while Trump, reviled by U.N. elites as a unilateralist, fills the vacuum. Opinion.",
    "link": "https://www.israelnationalnews.com/news/414801",
    "timestamp": "2025-09-11T20:54:18Z"
  },
  {
    "title": "Donald Trump Jr. sparks fury by comparing transgender people to al-Qaeda on 9-11 anniversary",
    "description": "Donald Trump Jr. rebuked the transgender community during the anniversary of 9/11 by comparing them to Al-Qaeda terrorists. The president’s son made his remarks during a Thursday interview on the 'Megyn Kelly Show.' Trump Jr. also claimed transgender individu…",
    "link": "https://freerepublic.com/focus/f-news/4339824/posts",
    "timestamp": "2025-09-11T20:53:54Z"
  },
  {
    "title": "Mehdi Hasan and Ilhan Omar Rag on Charlie Kirk One Day After His Murder",
    "description": "Mehdi Hasan and Rep. Ilhan Omar held nothing back while criticizing Charlie Kirk on Thursday, one day after the conservative activist was assassinated in Utah\nThe post Mehdi Hasan and Ilhan Omar Rag on Charlie Kirk One Day After His Murder first appeared on M…",
    "link": "https://www.mediaite.com/media/news/mehdi-hasan-and-ilhan-omar-rag-on-charlie-kirk-one-day-after-his-murder/",
    "timestamp": "2025-09-11T20:52:16Z"
  },
  {
    "title": "'Teen Mom' Producer Morgan J. Freeman Wonders if Trump Ordered Charlie Kirk's Assassination 'as a Distraction from Epstein' to 'Delay the 2026 Midterms'",
    "description": "TV producer and director Morgan J. Freeman jumped to his X account in the aftermath of the assassination of conservative firebrand Charlie Kirk and spun the wild conspiracy theory that President Donald Trump may have ordered Kirk's death.\nThe post ‘Teen Mom’ …",
    "link": "https://www.breitbart.com/entertainment/2025/09/11/teen-mom-producer-morgan-j-freeman-wonders-if-trump-ordered-charlie-kirks-assassination-as-a-distraction-from-epstein-to-delay-the-2026-midterms/",
    "timestamp": "2025-09-11T20:52:01Z"
  },
  {
    "title": "Brazil's Bolsonaro: US-backed Firebrand At Risk Of Future Behind Bars",
    "description": "As a military man Brazil's ex-president Jair Bolsonaro had a reputation for disobeying orders.",
    "link": "https://www.ibtimes.com/brazils-bolsonaro-us-backed-firebrand-risk-future-behind-bars-3783136",
    "timestamp": "2025-09-11T20:51:16Z"
  },
  {
    "title": "Why Young Conservative Women Loved Charlie Kirk",
    "description": "Charlie Kirk, who was assassinated in Utah September 10, was beloved among young women for convincing them to get married, have babies, and give up careers.",
    "link": "http://www.thecut.com/article/charlie-kirk-young-conservative-women-turning-point-usa.html",
    "timestamp": "2025-09-11T20:50:24Z"
  }
]