[
  {
    "title": "Top Trump aide chosen for Federal Reserve Board on track to win approval as questions swirl about bank independence",
    "description": "President Donald Trump’s effort to remake the board of the Federal Reserve and push the central bank to cut interest rates gained momentum after a top White House adviser appeared to win the endorsement of Republican senators.",
    "link": "https://biztoc.com/x/1d2736ead8f95778",
    "timestamp": "2025-09-04T18:28:21Z"
  },
  {
    "title": "Navy reverses demotion of Rep. Ronny Jackson, Trump’s former White House doctor",
    "description": "In light of the details and context, it's tough to see the Navy's decision to reverse Rep. Ronny Jackson's demotion as anything but overtly political.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/navy-reverses-demotion-rep-ronny-jackson-trumps-former-white-house-doc-rcna229137",
    "timestamp": "2025-09-04T18:28:17Z"
  },
  {
    "title": "Why are there so few affordable EVs in Canada?",
    "description": "In this issue of our environmental newsletter, we look at the more affordable EV models available in Canada — and why there are fewer here compared to other countries; see how plug-in solar panels for balconies work; and find out how beavers can fight wildfir…",
    "link": "https://www.cbc.ca/news/science/what-on-earth-cheap-evs-1.7624821",
    "timestamp": "2025-09-04T18:27:41Z"
  },
  {
    "title": "‘Strapped’ former BigLaw associate is arrested for alleged confrontation with National Guard members",
    "description": "A fired Covington & Burling associate was arrested last week for allegedly thrusting his shoulder into a member of the National Guard and making threatening statements to other National Guard members patrolling Washington, D.C.",
    "link": "https://www.abajournal.com/news/article/strapped-former-biglaw-associate-is-arrested-and-accused-of-throwing-his-shoulder-into-national-guardsman-in-dc",
    "timestamp": "2025-09-04T18:27:00Z"
  },
  {
    "title": "Microsoft set to dodge EU fine with offer to unbundle teams",
    "description": "Microsoft will avoid a major EU antitrust fine after regulators accepted its offer to unbundle Teams from Office packages. The move, prompted by Slack’s 2019 complaint, follows no objections in a market test.",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-set-to-dodge-eu-fine-with-offer-to-unbundle-teams/articleshow/123705096.cms",
    "timestamp": "2025-09-04T18:26:18Z"
  },
  {
    "title": "U.S. stocks drop as new economic data and court ruling on Trump tariffs unsettle markets",
    "description": "U.S. stocks tumbled Tuesday as investors digested new economic data and a recent court ruling that most of President Donald Trump’s tariffs could be potentially blocked. Why it matters: The sell-off raised concerns about the potential that more than $120 bill…",
    "link": "https://techpinions.com/u-s-stocks-drop-as-new-economic-data-and-court-ruling-on-trump-tariffs-unsettle-markets/",
    "timestamp": "2025-09-04T18:26:00Z"
  },
  {
    "title": "Pentagon Halts Military Support Programs for European Countries Bordering Russia",
    "description": "MOSCOW (Sputnik) - The United States will curtail hundreds of millions of dollars in security support programs for European countries bordering Russia, the Financial Times reported on Thursday, citing sources familiar with the matter.",
    "link": "https://sputnikglobe.com/20250904/pentagon-halts-military-support-programs-for-european-countries-bordering-russia-1122728204.html",
    "timestamp": "2025-09-04T18:25:58Z"
  },
  {
    "title": "Alan Dershowitz predicts Supreme Court’s ruling on deporting illegal alien criminals",
    "description": "Gang members exploited Joe Biden's program for parole for undocumented immigrants",
    "link": "https://www.wnd.com/2025/09/alan-dershowitz-predicts-supreme-courts-ruling-deporting-illegal/",
    "timestamp": "2025-09-04T18:24:29Z"
  },
  {
    "title": "Pritzker urged to avoid playing politics on crime issue by former Obama advisor",
    "description": "CNN political commentator David Axelrod urged Gov. J.B. Pritzker against playing 2028 politics on the crime issue as he tried to counter President Donald Trump's efforts.",
    "link": "https://www.foxnews.com/media/axelrod-warns-gov-pritzker-against-playing-2028-politics-crime-issue-urges-him-work-trump",
    "timestamp": "2025-09-04T18:24:14Z"
  },
  {
    "title": "Debt at World War II levels? Ray Dalio warns US economy echoes 1930s chaos as America stays silent",
    "description": "US national debt crisis 2025: Ray Dalio of Bridgewater Associates sees US economy mirroring the 1930s. He cites rising debt and political unrest. Dalio fears government control and silenced voices. He predicts a debt crisis within three years. America's debt …",
    "link": "https://economictimes.indiatimes.com/news/international/us/debt-at-world-war-ii-levels-ray-dalio-warns-us-economy-echoes-1930s-chaos-as-america-stays-silent/articleshow/123703583.cms",
    "timestamp": "2025-09-04T18:23:57Z"
  },
  {
    "title": "US Congress releases missing Epstein jail footage (VIDEO)",
    "description": "The previously released recording on the night of the sex offender’s death jumped by one minute to midnight Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624129-congress-missing-epstein-video/",
    "timestamp": "2025-09-04T18:23:24Z"
  },
  {
    "title": "Publisher agrees to changes in Virginia Giuffre’s memoir after family objections",
    "description": "The book is set to be released on October 21.",
    "link": "https://www.bostonherald.com/2025/09/04/virginia-giuffre-memoir/",
    "timestamp": "2025-09-04T18:22:23Z"
  },
  {
    "title": "Republicans Launch Yet Another Jan. 6 Committee",
    "description": "This may be the Republican Party’s biggest whitewash of them all.",
    "link": "https://www.huffpost.com/entry/republicans-launch-yet-another-jan-6-committee_n_68b9c1dde4b041ed82bdb964",
    "timestamp": "2025-09-04T18:21:39Z"
  },
  {
    "title": "Trump put pressure on European leaders over Russian oil purchases, White House official says",
    "description": "U.S. President Donald Trump told European leaders on Thursday that Europe must stop purchasing Russian oil that he said is helping Moscow fund its war against Ukraine, a White House official said. Trump joined a call of the \"Coalition of the Willing\" countrie…",
    "link": "https://freerepublic.com/focus/f-chat/4338617/posts",
    "timestamp": "2025-09-04T18:21:01Z"
  },
  {
    "title": "Former Russian president warns Moscow may seize 'valuables of the British Crown'",
    "description": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine.",
    "link": "https://news.sky.com/story/former-russian-president-warns-moscow-may-seize-valuables-of-the-british-crown-13425103",
    "timestamp": "2025-09-04T18:20:00Z"
  },
  {
    "title": "Trump's Fed pick says he will keep White House job",
    "description": "Democrats say the arrangement indicates Stephen Miran would be Trump's \"puppet\" at the central bank.",
    "link": "https://www.bbc.com/news/articles/c5yq3z2xd01o",
    "timestamp": "2025-09-04T18:19:18Z"
  },
  {
    "title": "Trump Insults Reporter With A Snide Suggestion In Yet Another Press Clash",
    "description": "The president issued a cranky comeback to a reporter because he didn't like the question.",
    "link": "https://www.huffpost.com/entry/donald-trump-reporter-get-yourself-a-new-job_n_68b9ac25e4b041ed82bd96fb",
    "timestamp": "2025-09-04T18:17:28Z"
  },
  {
    "title": "Top tech CEOs to meet with President Trump at White House",
    "description": "CNBC's Kristina Partsinevelos reports on the upcoming meeting between President Donald Trump and major tech company ...",
    "link": "https://biztoc.com/x/b9ed8065187770bd",
    "timestamp": "2025-09-04T18:14:33Z"
  },
  {
    "title": "Tom Homan: Trump Brought Illegal Immigration Down 96 Percent",
    "description": "Trump Border Czar Tom Homan during a speech on Wednesday outlined President Donald Trump's victories in curbing illegal immigration.\nThe post Tom Homan: Trump Brought Illegal Immigration Down 96 Percent appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/04/tom-homan-trump-brought-illegal-immigration-down-96-percent/",
    "timestamp": "2025-09-04T18:13:04Z"
  },
  {
    "title": "Chris Matthews Blasts Trump’s Epstein Excuses: ‘Nobody Wants Any More Pages, They Want the Names!’ | Video",
    "description": "\"How do you deny to the right wing what they believe intuitively? They believe you guys, rich guys, are covering up this crime,\" the retired MSNBC anchor says\nThe post Chris Matthews Blasts Trump’s Epstein Excuses: ‘Nobody Wants Any More Pages, They Want the …",
    "link": "https://www.thewrap.com/chris-matthews-trump-epstein-files-names-morning-joe-video/",
    "timestamp": "2025-09-04T18:12:21Z"
  },
  {
    "title": "Debate Over Key Climate Change Program Continues In Sacramento",
    "description": "Lawmakers are debating how to extend the state's cap and trade program amid rising energy costs.",
    "link": "https://www.kqed.org/news/12054597/debate-over-key-climate-change-program-continues-in-sacramento",
    "timestamp": "2025-09-04T18:11:44Z"
  },
  {
    "title": "Macron says 26 countries pledge troops for Ukraine when fighting over",
    "description": "KYIV: French President Emmanuel Macron said Thursday (Sep 4) that 26 of Ukraine’s allies have pledged to deploy troops as a “reassurance force” for the war-torn country on",
    "link": "https://www.channelnewsasia.com/world/macron-says-26-countries-pledge-troops-ukraine-when-fighting-over-5333216",
    "timestamp": "2025-09-04T18:11:17Z"
  },
  {
    "title": "Despite Trump’s best efforts to squash the scandal, Epstein’s survivors aren’t letting up",
    "description": "Chris Hayes praises Epstein survivors for speaking out on Capitol Hill, and says the scandal isn't going anywhere, no matter how badly Trump may want it to.",
    "link": "https://www.msnbc.com/top-stories/latest/jeffrey-epstein-survivors-trump-maga-scandal-rcna229083",
    "timestamp": "2025-09-04T18:11:13Z"
  },
  {
    "title": "Two Hampton Roads wind energy grants were canceled. But $20M was already spent.",
    "description": "A Norfolk maritime facility tied to the region’s nascent offshore wind industry plans to shift part of its operational plans after President Donald Trump’s administration killed a $39 million grant. U.S. Transportation Secretary Sean Duffy announced last week…",
    "link": "https://www.pilotonline.com/2025/09/04/hampton-roads-wind-energy-grants-canceled/",
    "timestamp": "2025-09-04T18:10:00Z"
  },
  {
    "title": "New York AG Letitia James to appeal decision that tossed Trump's $454M civil fraud judgment",
    "description": "New York AG Letitia James to appeal decision that tossed Trump's $454M civil fraud judgmentgo.com",
    "link": "https://abcnews.go.com/US/new-york-ag-letitia-james-appeal-decision-tossed/story?id=125265159",
    "timestamp": "2025-09-04T18:08:20Z"
  },
  {
    "title": "Rosie O’Donnell on life in Ireland: ‘I felt very taken care of and understood and appreciated in this country’",
    "description": "The Women’s Podcast with Róisín Ingle",
    "link": "https://www.irishtimes.com/podcasts/the-womens-podcast/rosie-odonnell-on-life-in-ireland-i-felt-very-taken-care-of-and-understood-and-appreciated-in-this-country/",
    "timestamp": "2025-09-04T18:07:32Z"
  },
  {
    "title": "U.S. trade deficit widens more than expected in July",
    "description": "NEW YORK, Sept. 4 (Xinhua) -- The U.S. Commerce Department released a report on Thursday showing that the U.S. trade deficit enlarged to 78.3 billion U.S. dollars in July, up from the revised 59.1 billion dollars in June, and higher than economists' forecast …",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/us-trade-deficit-widens-more-than-expected-in-july",
    "timestamp": "2025-09-04T18:06:00Z"
  },
  {
    "title": "New York AG appeals reversal of Trump's $500 million fraud penalty",
    "description": "New York Attorney General Letitia James on Thursday appealed a court's decision to toss out a $500 million penalty on President Donald Trump and his company in connection with business fraud.\nThe appeal comes two weeks after that punishment imposed by a Manha…",
    "link": "https://biztoc.com/x/fa3cf0ff0548e51a",
    "timestamp": "2025-09-04T18:05:33Z"
  },
  {
    "title": "Trump nominee plans to keep White House job if he's confirmed for Fed post",
    "description": "President Donald Trump's nominee to fill a vacancy on the Federal Reserve board said at his confirmation hearing that he does not plan to leave his position as chair of the White House Council of Economic Advisers if he's confirmed",
    "link": "https://biztoc.com/x/db67b6deb2220dfc",
    "timestamp": "2025-09-04T18:05:24Z"
  },
  {
    "title": "Trump Tells Supreme Court He Will Appeal In E. Jean Carroll Case",
    "description": "Trump Tells Supreme Court He Will Appeal In E. Jean Carroll Case\n \nAuthored by Matthew Vadum via The Epoch Times,\nPresident Donald Trump plans to ask the Supreme Court this fall to overturn a civil jury verdict that found he sexually abused writer E. Jean Car…",
    "link": "https://biztoc.com/x/1ac1cdb09aafd70c",
    "timestamp": "2025-09-04T18:05:12Z"
  },
  {
    "title": "Trump vowed to halve electricity prices. But they’re rising twice as fast as inflation",
    "description": "On the campaign trail last summer, President Donald Trump promised to swiftly cut electricity and energy prices in half if voters returned him to the White House.\n“We intend to slash prices by half within 12 months, maximum of 18 months,” Trump said during a …",
    "link": "https://biztoc.com/x/e3583cc5781b3aea",
    "timestamp": "2025-09-04T18:05:10Z"
  },
  {
    "title": "Donald Trump Risks Finding Himself on Wrong Side of One '80/20' Issue",
    "description": "The White House revels in being on the side of the majority of public opinion when it comes to hot-button cultural debates.",
    "link": "https://biztoc.com/x/fd00c4b259ee1f7d",
    "timestamp": "2025-09-04T18:05:07Z"
  },
  {
    "title": "Trump won't get to heaven if he keeps murdering people on boats (Will Bunch/The Philadelphia Inquirer)",
    "description": "Will Bunch / The Philadelphia Inquirer:\nTrump won't get to heaven if he keeps murdering people on boats  —  If Donald Trump is serious about wanting to get to heaven, he has a very odd strategy.This was the stark subject line on an email the 47th president se…",
    "link": "https://www.memeorandum.com/250904/p79",
    "timestamp": "2025-09-04T18:05:00Z"
  },
  {
    "title": "Conservative ‘South Park’ Fans Demand That the Show Stop Mocking Trump and Go After Joe Biden",
    "description": "The two, six-episode ‘South Park’ seasons released under Biden weren’t nearly this biting",
    "link": "https://www.cracked.com/article_48178_conservative-south-park-fans-demand-that-the-show-stop-mocking-trump-and-go-after-joe-biden.html",
    "timestamp": "2025-09-04T18:05:00Z"
  },
  {
    "title": "'South Park' Features Donald Trump Impregnating Satan in Tariff and Labubu Lampooning Episode",
    "description": "The latest \"South Park\" episode, titled, “Wok is Dead,” depicts President Donald Trump cheating on First Lady Melania Trump with satan, which is then revealed by Fox News.\nThe post ‘South Park’ Features Donald Trump Impregnating Satan in Tariff and Labubu Lam…",
    "link": "https://www.breitbart.com/entertainment/2025/09/04/south-park-features-donald-trump-impregnating-satan-in-tariff-and-labubu-lampooning-episode/",
    "timestamp": "2025-09-04T18:04:16Z"
  },
  {
    "title": "Senators grill Trump's nominee for Fed amid alarms over central bank independence",
    "description": "White House economist Stephen Miran was quizzed by senators about whether he could make decisions independently of President Trump, if he's confirmed to a seat on the Federal Reserve's governing board.",
    "link": "https://www.npr.org/2025/09/04/nx-s1-5526956/senate-federal-reserve-trump-stephen-miran",
    "timestamp": "2025-09-04T18:03:09Z"
  },
  {
    "title": "Missourians won’t let Trump and the GOP gerrymander the state without a fight",
    "description": "Claire McCaskill on how Missouri Republicans are helping Trump carry out his redistricting push and drown out the voices of Democratic voters in Kansas City.",
    "link": "https://www.msnbc.com/top-stories/latest/missouri-trump-redistricting-push-republicans-rcna229072",
    "timestamp": "2025-09-04T18:02:20Z"
  },
  {
    "title": "How Trump is transforming the way corporations do business in the U.S.",
    "description": "President Trump demanded cuts from private businesses. Blacklisted major law firms. And threatened companies to invest more in America. The uncertain legal landscape for U.S. businesses today.",
    "link": "https://www.wbur.org/onpoint/2025/09/04/trump-business-operate-corporations-cuts",
    "timestamp": "2025-09-04T18:00:00Z"
  },
  {
    "title": "The Mass Shooters Are Performing for One Another",
    "description": "The goal of these attacks is to join a lineage of infamous killers.",
    "link": "https://www.theatlantic.com/technology/archive/2025/09/minneapolis-church-shooting-influencers/684083/",
    "timestamp": "2025-09-04T17:58:46Z"
  },
  {
    "title": "Trump threatens to revoke Rosie O'Donnell's citizenship (again) instead of addressing Epstein",
    "description": "Donald Trump has once again threatened to revoke Rosie O'Donnell's U.S. citizenship — something she believes is an attempt to distract from his connection to Jeffrey Epstein.",
    "link": "https://www.advocate.com/news/donald-trump-rosie-odonnell-citizenship",
    "timestamp": "2025-09-04T17:58:34Z"
  },
  {
    "title": "List reveals items FBI seized from John Bolton's home during raid",
    "description": "Court documents reveal the FBI seized multiple devices and Trump-related documents from former national security adviser John Bolton's home last month.",
    "link": "https://www.foxnews.com/politics/list-reveals-which-items-fbi-seized-from-john-boltons-home-during-raid",
    "timestamp": "2025-09-04T17:57:47Z"
  },
  {
    "title": "Trump’s Unsupported Death Penalty Claim",
    "description": "At a Cabinet meeting on Aug. 26, President Donald Trump proposed seeking the death penalty for anyone convicted of murder in Washington, D.C., claiming the death penalty is \"a very strong preventative.\" But the research, which has been difficult to conduct, i…",
    "link": "https://www.factcheck.org/2025/09/trumps-unsupported-death-penalty-claim/",
    "timestamp": "2025-09-04T17:57:29Z"
  },
  {
    "title": "Donald Trump Risks Finding Himself on Wrong Side of One '80/20' Issue",
    "description": "The White House revels in being on the side of the majority of public opinion when it comes to hot-button cultural debates.",
    "link": "https://www.newsweek.com/donald-trump-risks-finding-himself-wrong-side-one-80-20-issue-2124725",
    "timestamp": "2025-09-04T17:56:00Z"
  },
  {
    "title": "Amy Sherald’s Canceled Smithsonian Show Heads to Baltimore Museum of Art",
    "description": "The Baltimore Museum of Art announcement follows Sherald's decision to cancel the Smithsonian iteration in July amid censorship concerns.",
    "link": "https://www.artnews.com/art-news/news/amy-sherald-american-sublime-the-baltimore-museum-of-art-1234750817/",
    "timestamp": "2025-09-04T17:55:10Z"
  },
  {
    "title": "Is a Congressional Stock Trading Ban Even Possible?",
    "description": "There is a growing movement to ban stock trading by members of Congress, but it is altogether unclear whether the two parties will be able... Read More\nThe post Is a Congressional Stock Trading Ban Even Possible? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/04/is-congressional-stock-trading-ban-even-possible/",
    "timestamp": "2025-09-04T17:55:00Z"
  },
  {
    "title": "Lose-lose: Even if the Supreme Court strikes down Trump’s tariffs, consumers likely wouldn’t see a dime from refunds",
    "description": "President Donald Trump likes to boast about how much money the U.S. Treasury is raking in from the massive taxes—tariffs—he’s slapped this year on imports from almost every country in the world.\n“We have trillions of dollars coming into our country,” Trump sa…",
    "link": "https://biztoc.com/x/4c5dfc7185423a52",
    "timestamp": "2025-09-04T17:54:05Z"
  },
  {
    "title": "New York AG appeals reversal of Trump's $500 million fraud penalty",
    "description": null,
    "link": "https://www.cnbc.com/2025/09/04/trump-new-york-appeal-james-fraud.html",
    "timestamp": "2025-09-04T17:52:14Z"
  },
  {
    "title": "Is there anyone left to say, \"NO?\"",
    "description": "We thought someone would put the stop on the worst impulses of Trump, but the courts, the congress, the justice department, and the Maga voters are giving the “all systems go” nod.",
    "link": "https://www.ncspin.com/is-there-anyone-left-to-say-no",
    "timestamp": "2025-09-04T17:51:47Z"
  },
  {
    "title": "Trump nominee plans to keep White House job if he's confirmed for Fed post",
    "description": "President Donald Trump's nominee to fill a vacancy on the Federal Reserve board said at his confirmation hearing that he does not plan to leave his position as chair of the White House Council of Economic Advisers if he's confirmed",
    "link": "https://www.nbcnews.com/politics/white-house/trump-stephen-miran-federal-reserve-senate-hearing-resign-white-house-rcna229099",
    "timestamp": "2025-09-04T17:51:17Z"
  },
  {
    "title": "USA Today Publishes Op-Ed Slamming ‘Trump Haters’ For Resenting ‘Model First Lady’ Melania",
    "description": "USA Today published an op-ed on Tuesday that criticized \"haters\" for being harshly begrudging first lady Melania Trump.",
    "link": "https://dailycaller.com/2025/09/04/usa-today-op-ed-melania-trump/",
    "timestamp": "2025-09-04T17:51:07Z"
  },
  {
    "title": "RFK Jr. mentions DeKalb Officer David Rose, criticizes CDC during testimony",
    "description": "HHS Secretary Robert F. Kennedy Jr. defended his “Make America Healthy Again\" agenda, calling it a shift toward preventing chronic disease.",
    "link": "https://www.fox5atlanta.com/news/rfk-jr-mentions-dekalb-officer-david-rose-criticizes-cdc-during-testimony",
    "timestamp": "2025-09-04T17:50:52Z"
  },
  {
    "title": "Albanese and Trump about critical minerals and security",
    "description": "SYDNEY: Australian Prime Minister Anthony Albanese discussed opportunities for Australia and the United States to cooperate on critical minerals in a phone call with President Donald Trump",
    "link": "https://www.channelnewsasia.com/world/albanese-and-trump-about-critical-minerals-and-security-5333076",
    "timestamp": "2025-09-04T17:50:29Z"
  },
  {
    "title": "The Winklevoss Twins Are Behind Crypto's Next High-Profile IPO. What You Need to Know.",
    "description": "Crypto's next big initial public offering, the exchange Gemini, involves twins credited with being the world's first bitcoin billionaires: brothers Cameron...",
    "link": "https://www.investopedia.com/the-winklevoss-twins-are-behind-crypto-s-next-big-ipo-here-s-what-you-need-to-know-gemini-11803355",
    "timestamp": "2025-09-04T17:50:05Z"
  },
  {
    "title": "Robert F Kennedy Jr's hearing turns rancorous as Democrats press him on COVID vaccine changes",
    "description": "Health Secretary Robert F. Kennedy Jr. faced intense bipartisan scrutiny during a Senate hearing regarding turmoil at federal health agencies and controversial changes to COVID-19 vaccination policies. Contentious exchanges with senators from both parties hig…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/robert-f-kennedy-jrs-hearing-turns-rancorous-as-democrats-press-him-on-covid-vaccine-changes/articleshow/123704303.cms",
    "timestamp": "2025-09-04T17:50:03Z"
  },
  {
    "title": "Top 5 Most Stunning Moments From RFK Jr.’s Bombastic Senate Hearing: ‘Killing Millions!’",
    "description": "A Senate Finance Committee hearing with Robert F. Kennedy Jr. was filled with tense exchanges and heated incidents from almost the moment it started.\nThe post Top 5 Most Stunning Moments From RFK Jr.’s Bombastic Senate Hearing: ‘Killing Millions!’ first appea…",
    "link": "https://www.mediaite.com/media/news/top-5-most-stunning-moments-from-rfk-jr-s-bombastic-senate-hearing-killing-millions/",
    "timestamp": "2025-09-04T17:49:32Z"
  },
  {
    "title": "D.C. attorney general files suit over National Guard deployment",
    "description": "The District of Columbia has filed a lawsuit against President Donald Trump for bringing in National Guard soldiers to police its streets.",
    "link": "https://www.upi.com/Top_News/US/2025/09/04/Washington-DC-Attorney-General-Schwalb-lawsuit-National-Guard-police-Trump/2561757005443/",
    "timestamp": "2025-09-04T17:49:02Z"
  },
  {
    "title": "VIDEO -- 'What Is Enough?': Woman Punched by Career Criminal in Chicago Speaks Out",
    "description": "A man with a lengthy criminal history is accused of punching a woman in downtown Chicago on August 19, the news coming as President Donald Trump plans to crack down on the Democrat-run city's ongoing crime problem.\nThe post VIDEO — ‘What Is Enough?’: Woman Pu…",
    "link": "https://www.breitbart.com/crime/2025/09/04/video-what-is-enough-woman-punched-by-career-criminal-in-chicago-speaks-out/",
    "timestamp": "2025-09-04T17:48:24Z"
  },
  {
    "title": "Canada, US Holding ‘Technical’ Talks on Sectoral Tariffs, Minister Says",
    "description": "Canada and the US agreed to hold technical talks on sectoral tariffs after officials met with Commerce Secretary Howard Lutnick last week, said Canadian cabinet minister Dominic LeBlanc.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-us-holding-technical-talks-on-sectoral-tariffs-minister-says",
    "timestamp": "2025-09-04T17:48:24Z"
  },
  {
    "title": "Here’s what FBI agents took from John Bolton’s house in raid — and what charges he could face",
    "description": "Agents also confiscated two USB drives, a hard drive, four boxes of \"printed daily activities,\" and \"typed documents in folders labeled 'Trump I - IV'\"",
    "link": "https://nypost.com/2025/09/04/us-news/heres-what-fbi-agents-took-from-john-boltons-house-in-raid-and-what-charges-he-could-face/",
    "timestamp": "2025-09-04T17:47:46Z"
  },
  {
    "title": "Trump’s Latest Crypto Play Is His Biggest and Most Corrupt Yet",
    "description": "His family just made as much as $5 billion on a single token launch—while reshaping U.S. policy to keep the industry on their side.",
    "link": "https://slate.com/technology/2025/09/donald-trump-cryptocurrency-bitcoin-world-liberty-financial-wlfi.html",
    "timestamp": "2025-09-04T17:44:53Z"
  },
  {
    "title": "‘Somebody is going to die’: Judges whine, anonymously, that Supreme Court doesn’t ‘have our backs’",
    "description": "Complain that their decisions in their fight against the Trump agenda are being overturned",
    "link": "https://www.wnd.com/2025/09/somebody-is-going-die-judges-whine-anonymously-that/",
    "timestamp": "2025-09-04T17:43:52Z"
  },
  {
    "title": "Trump Expands His Wars — at Home and Abroad",
    "description": "The president is actively threatening to invade Chicago, and bombed a purported drug boat from Venezuela in international waters",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-expands-wars-venezuela-chicago-new-orleans-baltimore-1235421666/",
    "timestamp": "2025-09-04T17:43:38Z"
  },
  {
    "title": "Tariff instability and a break with China is hitting American companies hard, and homegrown manufacturer John Deere is no exception",
    "description": "President Donald Trump has claimed to support domestic manufacturing, but his tariff policies have already hit farmers—and by extension homegrown manufacturer John Deere. An economic battle with China has hit farmers’ pockets as soybean exports to a large buy…",
    "link": "https://biztoc.com/x/c435271e53b6ee92",
    "timestamp": "2025-09-04T17:43:19Z"
  },
  {
    "title": "As Trump pushes Supreme Court to uphold his tariffs, he signals trade deals will be defunct if he loses the case: ‘I guess we’d have to unwind them’",
    "description": "As President Donald Trump faces the potential for his tariffs to be struck down, he hinted the trade deals he had in place with partners such as South Korea and the European Union would unravel. He told reporters at the Oval Office on Wednesday the U.S. could…",
    "link": "https://biztoc.com/x/89dffad01047bcd5",
    "timestamp": "2025-09-04T17:43:02Z"
  },
  {
    "title": "PM Netanyahu claims: The real reason the ICC accused Israel",
    "description": "PM alleges ICC prosecutor fabricated charges against Israel to deflect from personal misconduct, calls for immediate cancellation of 'false' arrest warrants.",
    "link": "https://www.israelnationalnews.com/news/414414",
    "timestamp": "2025-09-04T17:43:00Z"
  },
  {
    "title": "Macron Says 26 Nations to Back Security Guarantees for Ukraine",
    "description": "French President Emmanuel Macron said 26 countries had pledged to provide Ukraine with security guarantees in the event of a ceasefire with Donald Trump stopping short of committing to US backstop.\nRead more:…",
    "link": "https://biztoc.com/x/6fed154bcc0436af",
    "timestamp": "2025-09-04T17:42:45Z"
  },
  {
    "title": "Where states stand in the battle for partisan advantage in US House redistricting maps",
    "description": "Lawmakers in Missouri are the latest to try to draw a new U.S. House map for the 2026 election that could enhance the Republican Party’s numbers in Congress",
    "link": "https://abcnews.go.com/Politics/wireStory/states-stand-battle-partisan-advantage-us-house-redistricting-125264742",
    "timestamp": "2025-09-04T17:42:28Z"
  },
  {
    "title": "Rand Paul Slams Trump For Unilateral Strike On Suspected Drug Vessel: 'Where Does It End?'",
    "description": "The Kentucky Republican sharply criticized Tuesday's lethal attack on suspected traffickers and said that \"even the worst people in our country\" get due process.",
    "link": "https://www.huffpost.com/entry/rand-paul-slams-trump-strike-venezuela-drug-vessel_n_68b989f3e4b0e20f601acde8",
    "timestamp": "2025-09-04T17:42:15Z"
  },
  {
    "title": "Lose-lose: Even if the Supreme Court strikes down Trump’s tariffs, consumers likely wouldn’t see a dime from refunds",
    "description": "The Trump administration might balk at paying back the tariffs it’s collected.",
    "link": "https://fortune.com/2025/09/04/trump-tariff-refunds-supreme-court/",
    "timestamp": "2025-09-04T17:41:37Z"
  },
  {
    "title": "Russia again blasts notion of Western troops in Ukraine ahead of Trump call with Zelenskyy, European leaders",
    "description": "Russia said a proposal to deploy European troops to Ukraine as part of a peace deal would be \"unacceptable\" as world leaders work to end the war.",
    "link": "https://www.foxnews.com/world/russia-again-blasts-notion-western-troops-ukraine-ahead-trump-call-zelenskyy-european-leaders",
    "timestamp": "2025-09-04T17:41:34Z"
  },
  {
    "title": "There's less than a month to get a $7,500 EV tax credit. Here's what you should know.",
    "description": "Drivers in the US have until September 30 to qualify for federal EV tax credits, which President Donald Trump axed as part of his \"Big Beautiful Bill.\"",
    "link": "https://www.businessinsider.com/ev-tax-credit-end-what-to-know-tesla-2025-9",
    "timestamp": "2025-09-04T17:40:40Z"
  },
  {
    "title": "After Legal Setback, What’s Next for Trump’s Effort to Deport Illegal Alien Gang Members?",
    "description": "President Donald Trump’s use of a 1798 law to expedite deportations of foreign gang members is almost certainly headed for the Supreme Court, where legal... Read More\nThe post After Legal Setback, What’s Next for Trump’s Effort to Deport Illegal Alien Gang Me…",
    "link": "https://www.dailysignal.com/2025/09/04/legal-setback-whats-next-trumps-effort-deport-illegal-alien-gang-members/",
    "timestamp": "2025-09-04T17:40:00Z"
  },
  {
    "title": "Trump’s golf tracking site accuses White House of concealing health issues",
    "description": "The website’s decision comes amid persistent public concern and speculation about the president’s well-being.",
    "link": "https://www.masslive.com/news/2025/09/trumps-golf-tracking-site-accuses-white-house-of-concealing-health-issues.html",
    "timestamp": "2025-09-04T17:39:55Z"
  },
  {
    "title": "Why are we allowing this to happen?",
    "description": "It’s easy to swim with the big fish until the hook catches you or someone you love, isn’t it?",
    "link": "https://www.ncspin.com/why-are-we-allowing-this-to-happen",
    "timestamp": "2025-09-04T17:39:45Z"
  },
  {
    "title": "Dem Sen John Fetterman backs use of military force to combat drug trafficking into US",
    "description": "Sen. John Fetterman, a Democrat, indicated that he supports the use of lethal military force to combat drug trafficking in to the country.",
    "link": "https://www.foxnews.com/politics/dem-sen-john-fetterman-backs-use-military-force-combat-drug-trafficking-us",
    "timestamp": "2025-09-04T17:38:06Z"
  },
  {
    "title": "‘The Gates-Arabella Divorce’: Left-wing nonprofits lose massive funding partner",
    "description": "Huge foundation even looking for early exit from grants already launched",
    "link": "https://www.wnd.com/2025/09/gates-arabella-divorce-left-wing-nonprofits-lose-massive/",
    "timestamp": "2025-09-04T17:37:38Z"
  },
  {
    "title": "Democratic Senators urge Trump to cut U.S. funding to GHF, launch investigation into role in Gaza famine",
    "description": "On Thursday, three U.S. Democratic Senators called on President Donald Trump to stop funding the Gaza Humanitarian Foundation, adding that the Foundation's collaboration with the IDF and recorded use of violence against civilians raises serious legal question…",
    "link": "https://www.haaretz.com/us-news/2025-09-04/ty-article/.premium/democratic-senators-call-on-trump-to-cut-ghf-funding-launch-investigation/00000199-157b-d336-addd-7f7f86940000",
    "timestamp": "2025-09-04T17:36:52Z"
  },
  {
    "title": "Trump Administration Moves To Ease Rules For Self-Driving Cars",
    "description": "The Trump administration is taking steps to make it easier for automakers to deploy-self driving cars by removing some requirements designed specifically for human drivers — like windshield wipers.",
    "link": "https://www.ndtvprofit.com/auto/trump-administration-moves-to-ease-rules-for-self-driving-cars",
    "timestamp": "2025-09-04T17:34:56Z"
  },
  {
    "title": "Tariff instability and a break with China is hitting American companies hard, and homegrown manufacturer John Deere is no exception",
    "description": "Trump’s tariff policies are hitting John Deere’s customers hard.",
    "link": "https://fortune.com/2025/09/04/tariffs-donald-trump-john-deere-china-geopolitics/",
    "timestamp": "2025-09-04T17:34:46Z"
  },
  {
    "title": "If Trump's biggest tariffs get thrown out, companies could get a refund - but not consumers",
    "description": "President Donald Trump likes to boast about how much money the U.S. Treasury is raking in from the massive taxes – tariffs -- he’s slapped this year on imports from almost every country in the world",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-biggest-tariffs-thrown-companies-refund-consumers-125258617",
    "timestamp": "2025-09-04T17:34:29Z"
  },
  {
    "title": "Trump’s Fed nominee says he’d take an ‘unpaid leave of absence’ from his White House job if confirmed by the Senate",
    "description": "Stephen Miran, chairman of the White House Council of Economic Advisers, said he wouldn't immediately resign from Trump administration upon his confirmation.",
    "link": "https://fortune.com/2025/09/04/stephen-miran-federal-reserve-confirmation-white-house-leave-senate-trump-nomination/",
    "timestamp": "2025-09-04T17:34:02Z"
  },
  {
    "title": "After Attacking Trump For Criticizing Leftists’ Judicial Coup, Media Hype Rogue Judges’ Attacks On SCOTUS",
    "description": "Prepare for leftists who attacked Trump for criticizing rogue judges to celebrate rogue judges now attacking SCOTUS.",
    "link": "https://thefederalist.com/2025/09/04/after-attacking-trump-for-criticizing-leftists-judicial-coup-media-hype-rogue-judges-attacks-on-scotus/",
    "timestamp": "2025-09-04T17:34:00Z"
  },
  {
    "title": "Where states stand in the battle for partisan advantage in US House redistricting maps",
    "description": "Nationally, Democrats need to gain three seats next year to take control of the House.",
    "link": "https://www.bostonherald.com/2025/09/04/election-2026-redistricting-battle/",
    "timestamp": "2025-09-04T17:31:58Z"
  },
  {
    "title": "Trump’s Reaction to the Epstein Victims’ Rally Is Quite Telling",
    "description": "There's an uncomfortable, gendered spectacle playing out in Washington this week.",
    "link": "https://slate.com/news-and-politics/2025/09/trump-epstein-victims-rally-files-republicans-democrats.html",
    "timestamp": "2025-09-04T17:31:53Z"
  },
  {
    "title": "The first Illinois Republican Gubernatorial Debate",
    "description": "The debate was interesting and the lines already drawn. Questions spanned from Underfunded Pensions to skyrocket energy Prices. What was the one platform that stood out and was only captured by ultimately the best performance of the night? I was pretty impres…",
    "link": "https://freerepublic.com/focus/f-bloggers/4338605/posts",
    "timestamp": "2025-09-04T17:31:50Z"
  },
  {
    "title": "China’s Xi and North Korea’s Kim pledge deeper ties during meeting in Beijing",
    "description": "Experts say Kim likely hopes to restore ties with China.",
    "link": "https://www.bostonherald.com/2025/09/04/china-north-korea/",
    "timestamp": "2025-09-04T17:31:40Z"
  },
  {
    "title": "Amid health rumors, Donald Trump asks supporters for $15 to get him to heaven",
    "description": "Donald Trump has made an unusual appeal for donations. He connects the donations to his spiritual goal of entering heaven. Trump claims surviving an assassination attempt proves God wants him to 'Make America Great Again'. He urges supporters to donate $15 to…",
    "link": "https://economictimes.indiatimes.com/news/international/us/amid-health-rumors-donald-trump-asks-supporters-for-15-to-get-him-to-heaven/articleshow/123703401.cms",
    "timestamp": "2025-09-04T17:30:44Z"
  },
  {
    "title": "The Liberal Bubble",
    "description": "A regular trope presented by our reactionary centrists (shy right wingers) is that liberals/lefties live in some sort of cloistered \"bubble,\" unaware of the concerns and thoughts of right wingers, despite having them blasted at us from every media outlet cons…",
    "link": "https://www.eschatonblog.com/2025/09/the-liberal-bubble.html",
    "timestamp": "2025-09-04T17:30:00Z"
  },
  {
    "title": "Why the UAE’s intervention in West Bank carries real weight",
    "description": "It was the most prominent of the three Arab states to sign diplomatic accords with Israel when Trump was first in office",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/04/why-the-uaes-intervention-in-west-bank-carries-real-weight/",
    "timestamp": "2025-09-04T17:29:13Z"
  },
  {
    "title": "Guyana’s president wins another term in election watched keenly by Venezuela and US",
    "description": "Guyana re-elects Irfaan Ali in election dominated by country’s oil reserves.",
    "link": "https://theconversation.com/guyanas-president-wins-another-term-in-election-watched-keenly-by-venezuela-and-us-264553",
    "timestamp": "2025-09-04T17:28:36Z"
  },
  {
    "title": "Trump’s message to Europe: Stop buying Russian oil – You are funding Putin’s war in Ukraine",
    "description": "Speaking in a teleconference with the leaders of the \"Alliance of the Willing\" countries, Trump stressed that Russia received 1.1 billion euros from fuel sales to the EU in one year - He asked to put economic pressure on China\nThe post Trump’s message to Euro…",
    "link": "https://en.protothema.gr/2025/09/04/trumps-message-to-europe-stop-buying-russian-oil-you-are-funding-putins-war-in-ukraine/",
    "timestamp": "2025-09-04T17:28:00Z"
  },
  {
    "title": "As Trump pushes Supreme Court to uphold his tariffs, he signals trade deals will be defunct if he loses the case: ‘I guess we’d have to unwind them’",
    "description": "“If we don't win that case, our country is going to suffer so greatly, so greatly,” the president said on Wednesday.",
    "link": "https://fortune.com/2025/09/04/donald-trump-unwind-trade-deals-supreme-court-tariffs/",
    "timestamp": "2025-09-04T17:27:14Z"
  },
  {
    "title": "Trump DOJ is looking at ways to ban transgender Americans from owning guns, sources say | CNN Politics",
    "description": "Senior Justice Department officials are weighing proposals to limit transgender people’s right to possess firearms, according to two officials familiar with the internal discussions.",
    "link": "https://www.cnn.com/2025/09/04/politics/transgender-firearms-justice-department-second-amendment",
    "timestamp": "2025-09-04T17:27:06Z"
  },
  {
    "title": "Stephen Miran says he'll take unpaid leave from White House job while serving as Fed governor",
    "description": "Miran said he wouldn't fully resign his position at the White House while serving out the Fed Governor's term, which expires Jan. 31, 2026.",
    "link": "https://www.cnbc.com/2025/09/04/stephen-miran-says-hell-take-unpaid-leave-from-white-house-job-while-serving-as-fed-governor.html",
    "timestamp": "2025-09-04T17:26:29Z"
  },
  {
    "title": "Trump admin and RFK Jr. buried major study on impact alcohol has on cancer: report",
    "description": "In an exclusive report from VOX, it was revealed that President Donald Trump's administration buried a study that detailed the impact alcohol has on cancer.Reporter Dylan Scott noted that the alcohol industry is working to ensure \"most Americans still don’t k…",
    "link": "https://www.rawstory.com/trump-alcohol-study-hidden/",
    "timestamp": "2025-09-04T17:26:09Z"
  },
  {
    "title": "Chinese Hackers May Have Stolen Data From Nearly All Americans, Officials Say",
    "description": "A cyberattack campaign by a China-aligned hacker group called Salt Typhoon may have stolen data from nearly every American, officials said.",
    "link": "https://dailycaller.com/2025/09/04/chinese-hackers-stolen-data-americans-officials-intel-advisory/",
    "timestamp": "2025-09-04T17:26:03Z"
  },
  {
    "title": "Mexico Weighs Tariffs On China, Other Nations Without Trade Deal",
    "description": "Mexico is considering enacting new tariffs on countries with which it does not have a trade agreement, including China, President Claudia Sheinbaum said during her morning press conference on Thursday.",
    "link": "https://www.ndtvprofit.com/global-economics/mexico-weighs-tariffs-on-china-other-nations-without-trade-deal",
    "timestamp": "2025-09-04T17:25:04Z"
  }
]