[
  {
    "title": "NATO tests new deployment model without US ahead of Ukraine war anniversary",
    "description": "NATO is testing its ability to rapidly deploy across eastern Europe — without direct U.S. assistance — as Washington shifts its approach toward European defense and the war in Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/nato-tests-new-deployment-model-us-ahead-ukraine-118771487",
    "timestamp": "2025-02-14T06:38:19Z"
  },
  {
    "title": "TikTok Returns On Apple, Google US App Stores After Nearly A Month As Trump Halts Ban",
    "description": "President Donald Trump had signed an executive order on his first day in office, extending the deadline for ByteDance to divest TikTok's U.S. operations by an additional 75 days, setting a new deadline of April 5.",
    "link": "https://www.ibtimes.com/tiktok-returns-apple-google-us-app-stores-after-nearly-month-trump-halts-ban-3763692",
    "timestamp": "2025-02-14T06:38:07Z"
  },
  {
    "title": "Markets Flash Glimpses of Trump Fatigue as Tariff Risk Queried",
    "description": "(Bloomberg) -- Growing speculation the new tariffs threatened by US President Donald Trump are mainly intended as a negotiating tool are undermining the...",
    "link": "https://finance.yahoo.com/news/markets-flash-glimpses-dollar-fatigue-041052636.html",
    "timestamp": "2025-02-14T06:37:45Z"
  },
  {
    "title": "India to Boost Oil, LNG Imports from US to Avoid Tariffs",
    "description": "India is seeking to boost oil and gas imports from the US in an effort to reduce the trade imbalance between the two countries and avoid potential retaliatory tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/india-to-boost-oil-lng-imports-from-us-to-avoid-tariffs",
    "timestamp": "2025-02-14T06:37:22Z"
  },
  {
    "title": "Exclusive— Defense Secretary Pete Hegseth: Woke Generals 'Will Have a Different Job in Due Time'",
    "description": "Defense Secretary Pete Hegseth told Breitbart News in an exclusive interview on Thursday that he is paying \"very close attention\" to who is executing the lawful orders from President Donald Trump and that woke generals \"will have a different job in due time.\"…",
    "link": "https://www.breitbart.com/politics/2025/02/13/exclusive-defense-secretary-pete-hegseth-woke-generals-have-different-job/",
    "timestamp": "2025-02-14T06:35:33Z"
  },
  {
    "title": "\"Mission-500\": India, US Aim To Double Bilateral Trade By 2030",
    "description": "Following the bilateral meeting between Prime Minister Narendra Modi and President Donald Trump, Foreign Secretary Vikram Misri provided a detailed overview of the key initiatives launched during the visit.",
    "link": "https://www.ndtv.com/world-news/pm-modi-in-us-india-us-aim-to-double-bilateral-trade-to-500-billion-by-2030-mission-500-7706944",
    "timestamp": "2025-02-14T06:32:55Z"
  },
  {
    "title": "Trump’s special gift to PM Modi: A signed book with key memories",
    "description": "Former US President Donald Trump presented a special gift to Prime Minister Narendra Modi - his book 'Our Journey Together', symbolizing their shared diplomatic journey and personal camaraderie over the years. A special gift strengthening ties",
    "link": "https://m.economictimes.com/news/india/trumps-special-gift-to-pm-modi-a-signed-book-with-key-memories/a-special-gift-strengthening-ties/slideshow/118237572.cms",
    "timestamp": "2025-02-14T06:32:44Z"
  },
  {
    "title": "Asia-Pacific higher as investors watch US moves",
    "description": "Major stock indices in the Asia-Pacific region mostly rose on Friday, tracking Wall Street's positive momentum after US President Donald Trump signed a plan for reciprocal tariffs without immediate en...",
    "link": "https://biztoc.com/x/869cb2581fe120b1",
    "timestamp": "2025-02-14T06:31:48Z"
  },
  {
    "title": "TikTok returns to Apple and Google app stores in the US",
    "description": "TikTok has returned to the app stores of Apple and Google in the U.S., after President Donald Trump delayed the enforcement of a TikTok ban.\nTikTok, which is operated by Chinese technology firm ByteDance, was removed from Apple and Google’s app stores on Jan.…",
    "link": "https://biztoc.com/x/b73c4bc0bf75c09f",
    "timestamp": "2025-02-14T06:29:42Z"
  },
  {
    "title": "AI, semiconductors, quantum: Narendra Modi-Donald Trump talks deepen tech ties",
    "description": "\"The US and India are joining forces to develop AI technologies. We want to be on top of AI,\" said US President Donald Trump while addressing a joint press conference with Prime Minister Narendra Modi. The leaders also announced the launch of the US-India TRU…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ai-semiconductors-quantum-narendra-modi-donald-trump-talks-deepen-tech-ties/articleshow/118237428.cms",
    "timestamp": "2025-02-14T06:28:31Z"
  },
  {
    "title": "AI, semiconductors, quantum: Modi-Trump talks deepen tech ties",
    "description": "\"The US and India are joining forces to develop AI technologies. We want to be on top of AI,\" said US President Donald Trump while addressing a joint press conference with Prime Minister Narendra Modi. The leaders also announced the launch of the US-India TRU…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ai-semiconductors-quantum-narendra-modi-donald-trump-talks-deepen-tech-ties/articleshow/118237300.cms",
    "timestamp": "2025-02-14T06:28:28Z"
  },
  {
    "title": "Opinion: Trump's Gaza 'Riviera' Plan Will Show How United The Arabs Really Are",
    "description": "The Kingdom of Saudi Arabia is the leader of the Muslim and Arab world, a factor that has deterred it from normalising and establishing diplomatic relations with Israel. Yet, it has also been challenged on this front.",
    "link": "https://www.ndtv.com/opinion/trumps-gaza-riviera-plan-will-show-how-united-arab-world-really-is-7707875",
    "timestamp": "2025-02-14T06:27:06Z"
  },
  {
    "title": "MSC 2025: Ukraine denies Trump's 3-way talks with Russia",
    "description": "Ukraine said there were no plans to hold talks with Russian representatives at the Munich Security Conference. Russia has not been present since its invasion of Ukraine in 2022.",
    "link": "https://www.dw.com/en/msc-2025-ukraine-denies-trumps-3-way-talks-with-russia/live-71599568",
    "timestamp": "2025-02-14T06:27:00Z"
  },
  {
    "title": "MSC 2025: Conference opens as US pushes to end Ukraine war",
    "description": "Ukraine denied plans claimed by Donald Trump that US, Ukraine and Russia would hold talks at the Munich Security Conference. DW has the latest. The annual Munich Security Conference gathers military leaders and the defense industry to discuss global security.…",
    "link": "https://www.dw.com/en/msc-2025-conference-opens-as-us-pushes-to-end-ukraine-war/live-71599568",
    "timestamp": "2025-02-14T06:27:00Z"
  },
  {
    "title": "PM heckled as wind farms remain key battleground in Labor heartland",
    "description": "Offshore wind is proving a key challenge for the government, with hecklers interrupting the prime minister's announcement of Labor's new candidate in the Illawarra.",
    "link": "https://www.abc.net.au/news/2025-02-14/prime-minister-carol-berry-whitlam-candidate-hecklers-interrupt/104889234",
    "timestamp": "2025-02-14T06:26:38Z"
  },
  {
    "title": "Hostage families to Trump: 'Thank you, keep going. Our hope rests in you'",
    "description": "Hostages and Missing Families Forum Headquarters praises President Trump for securing the release of American hostages and prisoners such as Marc Fogel, express hope for the release of their loved ones.",
    "link": "https://www.israelnationalnews.com/news/403917",
    "timestamp": "2025-02-14T06:26:34Z"
  },
  {
    "title": "Mexico’s Sheinbaum Threatens to Sue Google Over ‘Gulf of America’ Maps Change",
    "description": "Mexico President Claudia Sheinbaum threatened a civil lawsuit against Google for renaming the Gulf of Mexico to Gulf of America on its maps service following an executive order Donald Trump signed after taking office. Sheinbaum insisted Thursday that Alphabet…",
    "link": "https://www.insurancejournal.com/news/international/2025/02/14/811975.htm",
    "timestamp": "2025-02-14T06:25:53Z"
  },
  {
    "title": "Taiwan promises more U.S. investment and purchases to answer Trump call",
    "description": "TAIPEI -- Taiwan's President Lai Ching-te on Friday said his administration will kick off a broad initiative aimed at expanding investment and procurement in the U.S., as he looks to level out the two economies' trade balance and mitigate pressure from his co…",
    "link": "https://biztoc.com/x/3825a1ee5f1befac",
    "timestamp": "2025-02-14T06:24:33Z"
  },
  {
    "title": "USA's reciprocal tariffs create uncertainties; trade deal may help boost ties: Experts",
    "description": "US President Donald Trump's announcement of reciprocal tariffs has created trade uncertainty between India and America. Experts suggest India should protect domestic industries while negotiating a trade deal. Trump's administration aims to reduce the US trade…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/usas-reciprocal-tariffs-create-uncertainties-trade-deal-may-help-boost-ties-experts/articleshow/118237310.cms",
    "timestamp": "2025-02-14T06:24:23Z"
  },
  {
    "title": "Europe fears its second ‘Munich moment’ has come",
    "description": "In today's edition of the Capitals, read about how the US opened Ukraine peace talks with Russia without EU allies, Germany’s AfD steps up far-right diplomacy with Orbán love fest, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-europe-fears-its-second-munich-moment-has-come/",
    "timestamp": "2025-02-14T06:23:07Z"
  },
  {
    "title": "The Indo Daily - Broken dynasty: How Elon Musk's family tree shaped his extreme world view",
    "description": "He’s a billionaire, a tech visionary, many would call him a disruptor and lately, one of the loudest voices on the far right of American politics.",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-broken-dynasty-how-elon-musks-family-tree-shaped-his-extreme-world-view/a1126766602.html",
    "timestamp": "2025-02-14T06:22:55Z"
  },
  {
    "title": "Jimmy Kimmel Fake-Celebrates RFK Jr’s Confirmation: ‘Bobby Brainworm Is on the Job!’ | Video",
    "description": "\"Measles and wide-leg jeans are back,\" the ABC host jokes \nThe post Jimmy Kimmel Fake-Celebrates RFK Jr’s Confirmation: ‘Bobby Brainworm Is on the Job!’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmell-rfk-jr-bobby-brainworm-trump-monologue/",
    "timestamp": "2025-02-14T06:21:06Z"
  },
  {
    "title": "Fico Calls on EU to adapt to new world order amid Trump-Putin talks",
    "description": "BRATISLAVA - Slovak Prime Minister Robert Fico has challenged European leaders’ criticism of US President Donald Trump after he launched immediate peace talks with the Kremlin without involving them.\nFico, known for his pro-Russian stance, shared a photo of h…",
    "link": "https://biztoc.com/x/c8e13769385ac6bd",
    "timestamp": "2025-02-14T06:19:10Z"
  },
  {
    "title": "Bridgerton producer Shonda Rhimes resigns from Kennedy Center board after Trump voted as chairman",
    "description": "Bridgerton executive producer Shonda Rhimes has resigned from the Kennedy Center board after President Donald Trump was voted as chairman.  Trump was named chair of the performing arts centre on Wednesday, following a vote by its board. John F. Kennedy Center…",
    "link": "https://www.thepinknews.com/2025/02/14/shonda-rhimes-resigns-from-kennedy-center/",
    "timestamp": "2025-02-14T06:17:03Z"
  },
  {
    "title": "Exclusive-Xi to chair symposium attended by Jack Ma and other Chinese business leaders, sources say",
    "description": "Xi rarely chairs symposiums about the private sector and the event underscores the numerous challenges currently facing China Inc, from the escalation in...",
    "link": "https://finance.yahoo.com/news/exclusive-xi-chair-symposium-attended-061650551.html",
    "timestamp": "2025-02-14T06:16:50Z"
  },
  {
    "title": "Judge orders Trump administration to temporarily allow funds for foreign aid to flow again",
    "description": "A federal judge ordered the Trump administration on Thursday to temporarily lift a three-week funding freeze that has shut down U.S. aid and development work worldwide, citing the sweeping damage that the sudden shutdown has done to the nonprofits and other o…",
    "link": "https://www.ktvu.com/news/judge-orders-trump-administration-temporarily-allow-funds-foreign-aid-flow-again",
    "timestamp": "2025-02-14T06:16:19Z"
  },
  {
    "title": "USAID Controversy Live Updates: Judge Orders Trump Administration To Temporarily Restore Foreign Aid Funding",
    "description": "Trump has attacked the aid agency’s leadership, saying they were a “bunch of radical lunatics.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/02/14/usaid-controversy-live-updates-judge-orders-trump-administration-to-temporarily-restore-foreign-aid-funding/",
    "timestamp": "2025-02-14T06:14:37Z"
  },
  {
    "title": "As U.S. officials travel to security summit, Europe must step-up on defense or risk being sidelined",
    "description": "As top global officials gather for the Munich Security Conference, the future of Ukraine and reshaping Europe's defense architecture will be central to talks.",
    "link": "https://www.cnbc.com/2025/02/14/as-us-officials-meet-for-the-msc-europe-must-step-up-on-defense.html",
    "timestamp": "2025-02-14T06:12:38Z"
  },
  {
    "title": "TikTok returns to Apple and Google app stores in the US",
    "description": "HONG KONG (AP) — TikTok has returned to the app stores of Apple and Google in the U.S., after President Donald Trump delayed the enforcement of a TikTok ban. TikTok, which is operated by Chinese technology firm ByteDance, was removed from Apple and Google’s a…",
    "link": "https://financialpost.com/pmn/tiktok-returns-to-apple-and-google-app-stores-in-the-us",
    "timestamp": "2025-02-14T06:11:25Z"
  },
  {
    "title": "Taiwan pledges chip talks with US, more investment to mollify Donald Trump",
    "description": "Donald Trump criticised Taiwan on Thursday, stating his goal to bring semiconductor chip manufacturing back to the US and repeating claims that Taiwan had taken the industry he wanted back in the United States. \"Taiwan's government will communicate and discus…",
    "link": "https://economictimes.indiatimes.com/tech/technology/taiwan-pledges-chip-talks-with-us-more-investment-to-mollify-donald-trump/articleshow/118236959.cms",
    "timestamp": "2025-02-14T06:11:18Z"
  },
  {
    "title": "Trump Hostility to US Offshore Wind Reverberates Through Supply Chain",
    "description": "Companies that committed to investments in U.S. offshore wind infrastructure and supply chains are scrapping their plans as the projects they were meant to serve face huge setbacks, including President Donald Trump’s plan to end federal support. The pullback …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/14/811979.htm",
    "timestamp": "2025-02-14T06:09:33Z"
  },
  {
    "title": "TikTok returns to Apple and Google app stores in the US",
    "description": "TikTok has returned to the app stores of Apple and Google in the U.S., after President Donald Trump delayed the enforcement of a TikTok ban.  TikTok, which...",
    "link": "https://finance.yahoo.com/news/tiktok-returns-apple-google-app-060931302.html",
    "timestamp": "2025-02-14T06:09:31Z"
  },
  {
    "title": "US VP Vance threatens sanctions, military action to push Putin into Ukraine deal: Reports",
    "description": "U.S. Vice President JD Vance warned of sanctions and potential military action against Russia if President Putin doesn't agree to a peace deal ensuring Ukraine's independence. President Trump discussed the ongoing conflict with leaders of Russia and Ukraine. …",
    "link": "https://economictimes.indiatimes.com/news/defence/us-vp-vance-threatens-sanctions-military-action-to-push-putin-into-ukraine-deal-wsj-reports/articleshow/118236907.cms",
    "timestamp": "2025-02-14T06:08:47Z"
  },
  {
    "title": "PiS candidate backs Trump: No NATO membership for Ukraine",
    "description": "WARSAW - Karol Nawrocki, the presidential candidate for the opposition PiS party, said he shares US President Donald Trump's view that Ukraine should not join NATO in the near future, nor does he see any prospect of the EU admitting Kyiv.\nUS Secretary of Defe…",
    "link": "https://biztoc.com/x/e5700aceba075034",
    "timestamp": "2025-02-14T06:08:45Z"
  },
  {
    "title": "Fico Calls on EU to adapt to new world order amid Trump-Putin talks",
    "description": "He criticised the EU for “launching a total offensive” against Russia, including sanctions.",
    "link": "https://www.euractiv.com/section/politics/news/fico-calls-on-eu-to-adapt-to-new-world-order-amid-trump-putin-talks/",
    "timestamp": "2025-02-14T06:07:48Z"
  },
  {
    "title": "TikTok is now back on Apple App Store and Google Play Store in the US",
    "description": "You can now download the TikTok app from the Apple App Store or Google Play Store on your devices in the US. Read more...",
    "link": "https://www.neowin.net/news/tiktok-is-now-back-on-apple-app-store-and-google-play-store-in-the-us/",
    "timestamp": "2025-02-14T06:06:01Z"
  },
  {
    "title": "Closing Gitmo in the American Heart",
    "description": "Gitmo, of course!! It’s the freest place “we” have – by which I mean the American government, a.k.a. Donald Trump. No rules apply there, be they international humanitarian law or the U.S. Constitution. It’s a dumping ground, a black hole. It’s the most secure…",
    "link": "https://www.counterpunch.org/2025/02/14/closing-gitmo-in-the-american-heart/",
    "timestamp": "2025-02-14T06:05:55Z"
  },
  {
    "title": "Vance says US has economic and military ‘tools of leverage’ if Russia doesn’t push for peace with Ukraine, WSJ reports",
    "description": "Vice President JD Vance warned on Thursday that the United States could send troops to Ukraine and hit Russia with further sanctions if Vladimir Putin doesn’t negotiate a peace deal in good faith.",
    "link": "https://www.cnn.com/2025/02/14/politics/jd-vance-us-troops-russia-ukraine-intl-hnk/index.html",
    "timestamp": "2025-02-14T06:05:32Z"
  },
  {
    "title": "Hamas says it will continue releasing Israeli hostages under Gaza deal",
    "description": "Hamas has said it is committed to implementing the Gaza ceasefire deal with Israel and will continue releasing hostages as scheduled, raising hopes that a resumption of the war can be averted. Following talks in Cairo, the Palestinian armed group said mediato…",
    "link": "https://thechronicle.com.gh/hamas-says-it-will-continue-releasing-israeli-hostages-under-gaza-deal/",
    "timestamp": "2025-02-14T06:05:22Z"
  },
  {
    "title": "NATO tests new deployment model without US ahead of Ukraine war anniversary",
    "description": "NATO is conducting the Steadfast Dart 2025 exercises with 10,000 troops from nine nations, focusing on rapid deployment across Bulgaria, Romania, and Greece as Russia's invasion of Ukraine nears three years. These exercises mark NATO's strategic evolution and…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-tests-new-deployment-model-without-us-ahead-of-ukraine-war-anniversary/articleshow/118236692.cms",
    "timestamp": "2025-02-14T06:01:03Z"
  },
  {
    "title": "Taiwan's Lai Vows More Investment In US As Chip Tariffs Loom",
    "description": "Taiwan will boost investment in the United States and on its own defences, President Lai Ching-te said Friday, as Taipei seeks to head off US President Donald Trump's threats of tariffs on its semiconductor chips.",
    "link": "https://www.ibtimes.com/taiwans-lai-vows-more-investment-us-chip-tariffs-loom-3763690",
    "timestamp": "2025-02-14T06:00:30Z"
  },
  {
    "title": "When the institutions of the land imply women are inferior, it’s hard not to doubt yourself",
    "description": "It is a fundamental paradox of women’s second-class status that, amid all the talk of toxic masculinity, nobody ever mentions the toxic femininity that gives it life support",
    "link": "https://www.irishtimes.com/opinion/2025/02/14/when-the-institutions-of-the-land-imply-women-are-inferior-the-risk-is-you-start-to-believe-them/",
    "timestamp": "2025-02-14T06:00:06Z"
  },
  {
    "title": "Trump to unveil names of taxpayer scandal beneficiaries: “Billions and billions of dollars being thrown away illegally”",
    "description": "President Donald Trump plans to hold a press conference to name individuals and entities that have illegally benefited from billions of taxpayer dollars, a move aimed at exposing government waste and corruption. The Department of Government Efficiency (DOGE),…",
    "link": "https://www.naturalnews.com/2025-02-14-trump-to-unveil-names-of-taxpayer-scandal-beneficiaries.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Ex-USAID director exposes deep-rooted corruption and waste",
    "description": "The former director of the U.S. Agency for International Development (USAID) has admitted the agency has been a hub of waste and corruption for years. Mark Moyar, who assumed the role of director in February 2018, appeared on Fox News to detail issues he foun…",
    "link": "https://www.naturalnews.com/2025-02-14-ex-usaid-director-exposes-deep-rooted-corruption.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "TikTok returns to U.S. app stores amid legal uncertainty and national security concerns",
    "description": "TikTok was briefly removed from Apple and Google app stores due to a U.S. law targeting its Chinese ownership, citing national security concerns. A 75-day enforcement delay, initiated by President Trump, allowed TikTok to return temporarily while ByteDance se…",
    "link": "https://www.naturalnews.com/2025-02-14-tiktok-app-store-national-security.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Hamas agrees to release hostages as planned, easing ceasefire tensions",
    "description": "Hamas claims it will release three Israeli hostages on Saturday, easing tensions that threatened to reignite the Gaza war. U.S. President Trump and Israeli PM Netanyahu pressured Hamas, warning of resumed hostilities if the deadline wasn’t met. Hamas initiall…",
    "link": "https://www.naturalnews.com/2025-02-14-hamas-agrees-to-release-hostages-ceasefire.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Darren J. Beattie joins Trump State Department â\u0080\u0094 Issues exclusive message to loyal Revolver readers",
    "description": "We are pleased to inform you that Revolver’s own Darren Beattie has landed a top role in the America First Trump administration. Dr. Beattie — a former speechwriter for President Trump and a professor at Duke University — has earned widespread respect for his…",
    "link": "https://www.naturalnews.com/2025-02-14-beattie-joins-trump-state-department.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "U.S. Special Forces to train Mexican Navy: A bold step in the war on drugs or a risky gamble?",
    "description": "The Mexican Senate unanimously approved U.S. Special Forces to train Mexican naval personnel, marking a significant shift in U.S.-Mexico security cooperation. The decision comes under pressure from the Trump administration to combat drug cartels and illegal i…",
    "link": "https://www.naturalnews.com/2025-02-14-us-special-forces-to-train-mexican-navy.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "IRS in the crosshairs: Elon Muskâ\u0080\u0099s top aide arrives as taxpayers brace for turmoil",
    "description": "The Internal Revenue Service (IRS) has a long history of facing accusations of waste, inefficiency and corruption, with notable incidents including the targeting of conservative groups for additional scrutiny in 2013. In 2025, the IRS is under scrutiny by Elo…",
    "link": "https://www.naturalnews.com/2025-02-14-irs-in-crosshairs-elon-musks-top-aide-arrives.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Washington: An empire of grift",
    "description": "In 1992, Murray Rothbard outlined a strategy for confronting the American regime that relied on transforming critiques of state intervention into a full front culture war. In his words, the intellectual battle “must necessarily be a strategy of boldness and c…",
    "link": "https://www.naturalnews.com/2025-02-14-washington-an-empire-of-grift.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Trump administration signals shift: Ukraineâ\u0080\u0099s NATO aspirations unlikely, peace talks on the horizon",
    "description": "President Donald Trump and Defense Secretary Pete Hegseth have declared that Ukraine will not join NATO, citing Russia’s opposition and the impracticality of NATO expansion in the current geopolitical context. The Trump administration is pushing for a negotia…",
    "link": "https://www.naturalnews.com/2025-02-14-ukraines-nato-aspirations-unlikely-peace-talks-on-horizon.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Back to basics: How natural gas is saving Americaâ\u0080\u0099s grid from collapse amid AI boom",
    "description": "PJM Interconnection, the largest U.S. power grid operator, plans to fast-track natural gas power plant construction to meet AI-driven energy demands, approved by FERC. The AI revolution, combined with data centers, electric vehicles and onshoring of manufactu…",
    "link": "https://www.naturalnews.com/2025-02-14-natural-gas-is-saving-americas-grid-from-collapse.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "EPA chief unveils $20 billion scandal: Biden admin’s rush to funnel taxpayer dollars to “corrupt NGOs”",
    "description": "EPA Administrator Lee Zeldin uncovered a $20 billion financial scandal involving taxpayer funds rushed to NGOs by the Biden administration before President Trump’s inauguration. The scandal, described as unprecedented, involves a “green bank” program establis…",
    "link": "https://www.naturalnews.com/2025-02-14-biden-admin-funneled-taxpayer-dollars-to-corrupt-ngos.html",
    "timestamp": "2025-02-14T06:00:00Z"
  },
  {
    "title": "Trump wants peace. Ukrainians fear what that might look like",
    "description": "Trump and Putin want to make a deal. But Ukrainians question how life after a ceasefire will work.",
    "link": "https://www.bbc.com/news/articles/c8xqkw4e08vo",
    "timestamp": "2025-02-14T05:58:48Z"
  },
  {
    "title": "Vance will meet Zelenskyy amid concerns about Trump-Putin talks to end the war in Ukraine",
    "description": "Vice President JD Vance and Secretary of State Marco Rubio will lead the U.S. delegation to the Munich Security Conference amid intense concern and uncertainty over the Trump administration’s foreign policy",
    "link": "https://abcnews.go.com/International/wireStory/vance-meet-zelenskyy-amid-concerns-trump-putin-talks-118814344",
    "timestamp": "2025-02-14T05:58:24Z"
  },
  {
    "title": "Trump Offers To Help End India-China Border Dispute. Centre Says This",
    "description": "India has asserted that it would follow a bilateral approach to resolve its border disputes with China after President Donald Trump offered to mediate an end to the &quot;border skirmishes&quot;.",
    "link": "https://www.ndtv.com/world-news/donald-trump-offers-to-help-end-india-china-border-dispute-centre-says-this-7707703",
    "timestamp": "2025-02-14T05:57:50Z"
  },
  {
    "title": "PiS candidate backs Trump: No NATO membership for Ukraine",
    "description": "The same applies to EU membership, which “should not be unconditional.”",
    "link": "https://www.euractiv.com/section/politics/news/pis-candidate-backs-trump-no-nato-membership-for-ukraine/",
    "timestamp": "2025-02-14T05:57:25Z"
  },
  {
    "title": "Taiwan’s Lai vows more investment in US as chip tariffs loom",
    "description": "Taiwan will boost investment in the United States and on its own defences, President Lai Ching-te said Friday, as Taipei seeks to head off US President Donald Trump’s threats of tariffs on its semiconductor chips.  The self-ruled island is a global power in t…",
    "link": "https://www.digitaljournal.com/world/taiwans-lai-vows-more-investment-in-us-as-chip-tariffs-loom/article",
    "timestamp": "2025-02-14T05:57:20Z"
  },
  {
    "title": "Sánchez leads, Vox rises, PP slips in polls",
    "description": "This is the Socialists' largest monthly gain since May.",
    "link": "https://www.euractiv.com/section/politics/news/sanchez-leads-vox-rises-pp-slips-in-polls/",
    "timestamp": "2025-02-14T05:54:48Z"
  },
  {
    "title": "Trump orders introduction of reciprocal tariffs, beginning with probes",
    "description": "WASHINGTON -- U.S. President Donald Trump on Thursday signed an executive memorandum setting the stage for introducing reciprocal tariffs on imports, instructing probes into countries that have higher tariffs or non-tariff trade barriers against American good…",
    "link": "https://biztoc.com/x/f860607ccbf1dba1",
    "timestamp": "2025-02-14T05:53:37Z"
  },
  {
    "title": "Here Are All The Major Lawsuits Against Trump And Musk: Judge Orders Temporary Restoration Of Foreign Aid Funding",
    "description": "Judges have blocked some of Trump and Musk's early moves—for now.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/14/here-are-all-the-major-lawsuits-against-trump-and-musk-judge-orders-temporary-restoration-of-foreign-aid-funding/",
    "timestamp": "2025-02-14T05:53:34Z"
  },
  {
    "title": "Taiwan pledges chip talks with US, more investment to mollify Trump",
    "description": "TAIPEI: Taiwan President Lai Ching-te pledged on Friday (Feb 14) to talk with the United States about President Donald Trump's concerns over the chip industry and to invest more in and buy more from the",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-us-trump-tariffs-semiconductor-chip-investment-4937726",
    "timestamp": "2025-02-14T05:50:49Z"
  },
  {
    "title": "Snap Insight: Trump’s reciprocal tariffs put Asia’s history of trade openness at risk",
    "description": "US President Donald Trump’s trade policies will leave the rest of the world to decide whether to abandon economic integration or follow America’s example, says Deborah Elms of the Hinrich Foundation.",
    "link": "https://www.channelnewsasia.com/commentary/trump-reciprocal-tariff-trade-asia-global-snap-insight-4938116",
    "timestamp": "2025-02-14T05:50:39Z"
  },
  {
    "title": "Trump offers top-end jets, trade deal to India",
    "description": "U.S. President Donald Trump on Thursday offered to sell state-of-the-art fighter jets to India as he and Prime Minister Narendra Modi vowed to ramp up trade, rekindling a bond that defies the new U.S. administration's punitive approach to much of the world.",
    "link": "https://www.hurriyetdailynews.com/trump-offers-top-end-jets-trade-deal-to-india-205810",
    "timestamp": "2025-02-14T05:50:16Z"
  },
  {
    "title": "Olympic champ Khelif fights back",
    "description": "The IBA announced in a statement on Monday it was filing a complaint with Swiss Attorney General Stefan Blatter against the International Olympic Committee, citing safety concerns over gender eligibility.",
    "link": "https://www.rediff.com/sports/report/olympic-champ-khelif-fights-back/20250214.htm",
    "timestamp": "2025-02-14T05:47:51Z"
  },
  {
    "title": "Zelensky at Munich security meet as Trump-Putin talks spark alarm",
    "description": "President Volodymyr Zelensky is set to meet U.S. Vice President JD Vance in Germany on Friday with a warning against trusting Russia's Vladimir Putin, as concerns mount in Kiev and among its European allies that the Ukraine war will be settled over their head…",
    "link": "https://www.hurriyetdailynews.com/zelensky-at-munich-security-meet-as-trump-putin-talks-spark-alarm-205809",
    "timestamp": "2025-02-14T05:44:46Z"
  },
  {
    "title": "Vaccine skeptic Robert F. Kennedy Jr. is sworn in as Trump’s health chief after a close Senate vote",
    "description": "WASHINGTON (AP) — Robert F. Kennedy Jr. was sworn in Thursday as President Donald Trump’s health secretary after a close Senate vote, putting the prominent vaccine skeptic in control of $1.7 trillion in federal spending, vaccine recommendations and food safet…",
    "link": "https://kfor.com/news/washington-dc-bureau/ap-senate-to-vote-on-vaccine-skeptic-robert-f-kennedy-jr-s-bid-to-become-nations-health-secretary/",
    "timestamp": "2025-02-14T05:41:29Z"
  },
  {
    "title": "TikTok returns on Apple and Google U.S. app stores as Trump delays ban",
    "description": "TikTok returned to the U.S. app stores of Apple and Google on Thursday as President Donald Trump delayed a ban on the Chinese-owned social media app and assured the tech giants they would not be fined for distributing or maintaining it.\nThe popular short vide…",
    "link": "https://biztoc.com/x/80a4ab813e2ea0aa",
    "timestamp": "2025-02-14T05:41:13Z"
  },
  {
    "title": "Hamas expected to name Israeli hostages it will free this weekend",
    "description": "Hamas was expected Friday to name three hostages it will release this weekend as part of a planned exchange for Palestinian prisoners, local media said, after days of uncertainty in which Israel threatened to scrap a nearly month-old Gaza ceasefire deal. Isra…",
    "link": "https://www.digitaljournal.com/world/hamas-expected-to-name-israeli-hostages-it-will-free-this-weekend/article",
    "timestamp": "2025-02-14T05:37:20Z"
  },
  {
    "title": "German Industry Risks New Setback From Power Pricing Overhaul",
    "description": "When the weather in Germany is overcast and calm, the windmills and solar plants don’t send any power to the grid. Instead, they send shockwaves through the markets. One such “Dunkelflaute” day in mid-December saw spot power prices climb to more than €900 ($9…",
    "link": "https://financialpost.com/pmn/business-pmn/german-industry-risks-new-setback-from-power-pricing-overhaul",
    "timestamp": "2025-02-14T05:36:41Z"
  },
  {
    "title": "Taiwan’s Lai Vows to Lift Military Funding After Trump Complaint",
    "description": "Taiwan President Lai Ching-te pledged to boost military spending, a move aimed at showing President Donald Trump the democracy is committed to defending itself from China.",
    "link": "https://financialpost.com/pmn/business-pmn/taiwans-lai-vows-to-lift-military-funding-after-trump-complaint",
    "timestamp": "2025-02-14T05:36:31Z"
  },
  {
    "title": "Hamas Expected To Name Israeli Hostages It Will Free This Weekend",
    "description": "Hamas was expected Friday to name three hostages it will release this weekend as part of a planned exchange for Palestinian prisoners, local media said, after days of uncertainty in which Israel threatened to scrap a nearly month-old Gaza ceasefire deal.",
    "link": "https://www.ibtimes.com/hamas-expected-name-israeli-hostages-it-will-free-this-weekend-3763687",
    "timestamp": "2025-02-14T05:36:25Z"
  },
  {
    "title": "Hamas Expected To Name Israeli Hostages It Will Free This Weekend",
    "description": "Hamas was expected Friday to name three hostages it will release this weekend as part of a planned exchange for Palestinian prisoners, local media said, after days of uncertainty in which Israel threatened to scrap a nearly month-old Gaza ceasefire deal.",
    "link": "https://www.ibtimes.com.au/hamas-expected-name-israeli-hostages-it-will-free-this-weekend-1856164",
    "timestamp": "2025-02-14T05:36:10Z"
  },
  {
    "title": "Trump and Musk Are Going to War Against Military Veterans - NewsBreak",
    "description": "Donald Trump’s new executive order , titled “Implementing the President’s Department of Government Efficiency (DOGE) Workforce Optimization Initiative,” o",
    "link": "https://www.newsbreak.com/share/3809280852361-trump-and-musk-are-going-to-war-against-military-veterans?s=a2&amp;share_destination_id=ODM0Nzg1NzMtMTczOTUxMTIzOTk0MA%3D%3D&amp;pd=05eGabNg&amp;hl=en_US&amp;send_time=1739511239&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v2",
    "timestamp": "2025-02-14T05:35:20Z"
  },
  {
    "title": "Trump says he leaves the decision on Bangladesh to PM Modi",
    "description": "US President Trump, in a meeting with PM Modi, addressed the political crisis in Bangladesh, prompted by the violent 2024 protests against former PM Hasina’s regime. Bangladesh's opposition demands Hasina’s extradition from India following UN reports of human…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-says-he-leaves-the-decision-on-bangladesh-to-pm-modi/articleshow/118235553.cms",
    "timestamp": "2025-02-14T05:34:59Z"
  },
  {
    "title": "Some of the big concerns we all had have been addressed: Shashi Tharoor says PM Modi's meet with Trump is encouraging",
    "description": "Congress leader Shashi Tharoor expressed optimism about the discussions between Prime Minister Narendra Modi and US President Donald Trump. He highlighted the positive press statements, addressing major concerns, ongoing tariff negotiations, and the strengthe…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/some-of-the-big-concerns-we-all-had-have-been-addressed-shashi-tharoor-says-pm-modis-meet-with-trump-is-encouraging/articleshow/118235556.cms",
    "timestamp": "2025-02-14T05:33:46Z"
  },
  {
    "title": "Federal funding freeze disrupts rural organizations supporting foster youth, job growth",
    "description": "Nonprofit organizations across the country were plunged into uncertainty after the White House froze spending on federal loans and grants two weeks ago",
    "link": "https://abcnews.go.com/Health/wireStory/federal-funding-freeze-disrupts-rural-organizations-supporting-foster-118813979",
    "timestamp": "2025-02-14T05:33:45Z"
  },
  {
    "title": "No one can take Gaza from Palestinians: Erdoğan",
    "description": "President Recep Tayyip Erdoğan said no one can take Gaza from the Palestinians, rejecting U.S. President Donald Trump's proposal to “take over” the coastal enclave and relocate the population to neighboring Arab countries.",
    "link": "https://www.hurriyetdailynews.com/no-one-can-take-gaza-from-palestinians-erdogan-205807",
    "timestamp": "2025-02-14T05:32:35Z"
  },
  {
    "title": "Big Focus On Organised Crime In India-US Talks Amid Khalistan Violence",
    "description": "Prime Minister Narendra Modi and US President Donald Trump concluded a high-profile bilateral meeting today, which centred on partnerships across key areas, including security, trade, and technology.",
    "link": "https://www.ndtv.com/world-news/pm-modi-us-donald-trump-big-focus-on-organised-crime-in-india-us-talks-amid-khalistan-violence-7707541",
    "timestamp": "2025-02-14T05:30:43Z"
  },
  {
    "title": "US sanctions ICC’s top prosecutor",
    "description": "The US has sanctioned ICC Prosecutor Karim Khan for issuing charges against Israeli political leaders Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612687-us-sanctions-icc-boss/",
    "timestamp": "2025-02-14T05:28:56Z"
  },
  {
    "title": "EPA chief says he will seek return of $20 billion in clean-energy grants awarded by Biden",
    "description": "In a major reversal, the new head of the Environmental Protection Agency says he'll try to rescind $20 billion in grants awarded by the Biden administration for climate and clean-energy projects",
    "link": "https://abcnews.go.com/Business/wireStory/epa-chief-seek-return-20-billion-clean-energy-118795389",
    "timestamp": "2025-02-14T05:26:30Z"
  },
  {
    "title": "EPA chief says he will seek return of $20 billion in clean-energy grants awarded by Biden",
    "description": "In a major reversal, the new head of the Environmental Protection Agency says he'll try to rescind $20 billion in grants awarded by the Biden administration for climate and clean-energy projects",
    "link": "https://abcnews.go.com/US/wireStory/epa-chief-seek-return-20-billion-clean-energy-118795388",
    "timestamp": "2025-02-14T05:26:29Z"
  },
  {
    "title": "Including people without legal status in census has had little impact on House seats, study finds",
    "description": "Republicans are trying to exclude people who are in the U.S. illegally from the numbers used to portion out congressional seats among the states",
    "link": "https://abcnews.go.com/Politics/wireStory/including-people-legal-status-census-impact-house-seats-118813975",
    "timestamp": "2025-02-14T05:26:27Z"
  },
  {
    "title": "Trump Begins Firing Probationary Staff In A Move To Shrink Federal Work Force",
    "description": "US President Donald Trump&#039;s administration has reportedly begun laying off probationary employees as it moves to the next stage of its plans to aggressively shrink the federal workforce.",
    "link": "https://www.ndtv.com/world-news/trump-begins-firing-probationary-staff-in-a-move-to-shrink-federal-work-force-7707498",
    "timestamp": "2025-02-14T05:24:34Z"
  },
  {
    "title": "USAID Shutdown Crueler Than Atomic Bombs, Former Staffer Writes",
    "description": "President Donald Trump administration's freezing of aid in a push to dismantle the United States Agency for International Development (USAID) is \"one of the cruelest acts\" taken by a democracy, former agency speechwriter Maany Peyvan writes.\nNewsweek reached …",
    "link": "https://biztoc.com/x/39a782b51cd2a58b",
    "timestamp": "2025-02-14T05:22:56Z"
  },
  {
    "title": "Mexico threatens to sue Google over 'Gulf of America' row",
    "description": "Mexican president Claudia Sheinbaum says her government sent a letter to Google to say it was 'wrong' to rename the Gulf of Mexico, but the tech giant is sticking to using the new name for US users.",
    "link": "https://www.abc.net.au/news/2025-02-14/mexico-threatens-to-sue-google-over-gulf-of-america-row/104938636",
    "timestamp": "2025-02-14T05:19:13Z"
  },
  {
    "title": "India to receive billions in US weapons, including F-35 stealth jets: Trump",
    "description": "India's Prime Minister Modi and US President Trump agreed on a security agenda that will also address 'terrorism'.",
    "link": "https://www.aljazeera.com/news/2025/2/14/india-to-receive-billions-in-us-weapons-including-f-35-stealth-jets-trump",
    "timestamp": "2025-02-14T05:18:26Z"
  },
  {
    "title": "Trump announces three-way talks on war in Munich",
    "description": "But a Ukrainian official says talks on ending the war \"are not expected\" and Moscow does not comment.",
    "link": "https://www.bbc.com/news/articles/cy5k6gk50qvo",
    "timestamp": "2025-02-14T05:17:22Z"
  },
  {
    "title": "USAID Shutdown Crueler Than Atomic Bombs, Former Staffer Writes",
    "description": "Former USAID speechwriter said that freezing foreign aid by dismantling the program could cause thousands of children to die.",
    "link": "https://www.newsweek.com/usaid-shutdown-crueler-atomic-bombs-former-staffer-writes-2030995",
    "timestamp": "2025-02-14T05:17:09Z"
  },
  {
    "title": "Federal funding freeze disrupts rural organizations supporting foster youth, job growth",
    "description": "Nonprofit organizations across the country were plunged into uncertainty after the White House froze spending on federal loans and grants two weeks ago. The Trump administration’s order created chaos for nonprofits in the poorest, most rural states, like West…",
    "link": "https://www.seattlepi.com/business/article/federal-funding-freeze-disrupts-rural-20167080.php",
    "timestamp": "2025-02-14T05:16:13Z"
  },
  {
    "title": "Europe’s Pharma, Car Giants Most at Risk From Trump Tariffs",
    "description": "European earnings face significant headwinds should US President Donald Trump’s tariff threats materialize, with the region’s key growth sectors the most exposed.",
    "link": "https://financialpost.com/pmn/business-pmn/europes-pharma-car-giants-most-at-risk-from-trump-tariffs",
    "timestamp": "2025-02-14T05:16:12Z"
  },
  {
    "title": "Trump administration bars AP reporters for third day, news agency says",
    "description": "AP boss Julie Pace condemns 'deeply troubling escalation' in spat over Trump's renaming of the Gulf of Mexico.",
    "link": "https://www.aljazeera.com/news/2025/2/14/trump-administration-bars-ap-reporters-for-third-day-news-agency-says",
    "timestamp": "2025-02-14T05:14:50Z"
  },
  {
    "title": "He's a great leader... He is a special man: What President Trump said about PM Modi during US visit",
    "description": "US President Donald Trump praised PM Narendra Modi as a \"great leader\" with outstanding negotiation skills during their meeting at the White House. Trump emphasized the strong ties between India and the US, highlighting Modi's significant impact in India and …",
    "link": "https://economictimes.indiatimes.com/news/india/hes-a-great-leader-he-is-a-special-man-what-president-trump-said-about-pm-modi-during-us-visit/articleshow/118235189.cms",
    "timestamp": "2025-02-14T05:14:00Z"
  },
  {
    "title": "Fast fashion firm Shein's IPO to be delayed, FT reports",
    "description": "Fast-fashion group Shein's plans to list in the UK stock market are likely to be pushed to the second-half of this year after Donald Trump's move to close so-called \"de minimis\" rules, the Financial Times reported on Friday.The company's business prospects ha…",
    "link": "https://www.channelnewsasia.com/business/fast-fashion-firm-sheins-ipo-be-delayed-ft-reports-4938171",
    "timestamp": "2025-02-14T05:12:58Z"
  },
  {
    "title": "Oil Steadies as Trump’s Reciprocal Tariffs Add to Trade Tensions",
    "description": "Oil steadied as the market digested the fallout from President Donald Trump’s order of potential reciprocal tariffs on US trading partners.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steadies-as-trumps-reciprocal-tariffs-add-to-trade-tensions",
    "timestamp": "2025-02-14T05:11:06Z"
  },
  {
    "title": "Trump delays a sweeping reciprocal tariff plan as global markets rally",
    "description": "US President Donald Trump signed a Presidential memo on reciprocal tariffs to order his administration to investigate the plan, offering time for negotiations. Global markets turned to a risk-on mode following the decision.",
    "link": "https://biztoc.com/x/d42fe4af1e6489ae",
    "timestamp": "2025-02-14T05:10:38Z"
  }
]