[
  {
    "title": "Russian State TV Network Mocks Donald Trump's Attack on Putin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's social media attacks on Vladimir Putin have prompted derision and a warning from Russian state media.\nTrump took to Truth Social to condemn Putin following last weekend's Russian missi…",
    "link": "https://biztoc.com/x/6f6bdb3e1493d28c",
    "timestamp": "2025-05-28T11:13:27Z"
  },
  {
    "title": "King Charles III lends support to Canada in rare speech",
    "description": "The News\nKing Charles III warned that Canada faced “unprecedented” challenges, in a speech widely seen as a rebuke to pressure from US President Donald Trump.\nThe monarch — Canada’s head of state — made the trip from London to open the country’s Parliament at…",
    "link": "https://biztoc.com/x/b387404b5c32a7ef",
    "timestamp": "2025-05-28T11:13:23Z"
  },
  {
    "title": "Trump's pardons of public officials and break-in at Beanie Babies mogul's house: Morning Rundown",
    "description": "A handful of Trump’s recent pardons show a shift in Justice Department priorities.",
    "link": "https://www.nbcnews.com/news/us-news/trumps-pardon-public-officials-beanie-babies-house-morning-rundown-rcna209381",
    "timestamp": "2025-05-28T11:13:06Z"
  },
  {
    "title": "Musk, Republicans criticize Trump spending bill",
    "description": "The News\nElon Musk and top Republicans criticized US President Donald Trump over his spending programs and foreign policy.\nMusk — tasked by Trump with slashing government outlays — told CBS in an interview set for broadcast Sunday that he was “disappointed” b…",
    "link": "https://biztoc.com/x/8a3c7392bf778adb",
    "timestamp": "2025-05-28T11:13:05Z"
  },
  {
    "title": "Musk 'disappointed' by Trump's tax and spending bill",
    "description": "Musk 'disappointed' by Trump's tax and spending bill\nElon Musk has criticised one of the signature policies of his close ally, US President Donald Trump.\nLast week, the US House of Representatives narrowly passed what Trump calls his \"big, beautiful\" bill, wh…",
    "link": "https://biztoc.com/x/38c3e5eea1753e00",
    "timestamp": "2025-05-28T11:13:04Z"
  },
  {
    "title": "'Shocking': UN Report Shows Small Chance of Breaching 2°C of Warming in Near Future",
    "description": "A World Meteorological Organization report released Wednesday predicts there's a small chance that the average global temperature will exceed 2°C of warming above the preindustrial average in at least one of the next five years—an occurrence that one expert s…",
    "link": "https://www.commondreams.org/news/2c-global-warming",
    "timestamp": "2025-05-28T11:10:57Z"
  },
  {
    "title": "Musk says he's 'disappointed' with Trump-backed megabill (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nMusk says he's ‘disappointed’ with Trump-backed megabill  —  The billionaire's criticism could influence the megabill's prospects in the Senate.  —  Elon Musk seems to be unhappy with the sweeping spending bill narrowly passed …",
    "link": "https://www.memeorandum.com/250528/p9",
    "timestamp": "2025-05-28T11:10:00Z"
  },
  {
    "title": "Russian State TV Network Mocks Donald Trump's Attack on Putin",
    "description": "State-run outlet RT said Trump changes his opinion frequently, while a TV anchor said he should remember that Moscow can \"destroy the world several times over.\"",
    "link": "https://www.newsweek.com/russia-ukraine-trump-putin-2077801",
    "timestamp": "2025-05-28T11:09:10Z"
  },
  {
    "title": "Anarchists in the Movement against Police and White Supremacy : From the Los Angeles Riots to the George Floyd Uprising",
    "description": "A timeline tracing anarchist contributions to anti-police uprisings from the Rodney King riots of 1992 to the George Floyd uprising in 2020.",
    "link": "https://crimethinc.com/2025/05/28/anarchists-in-the-movement-against-police-and-white-supremacy-from-the-los-angeles-riots-to-the-george-floyd-uprising",
    "timestamp": "2025-05-28T11:05:25Z"
  },
  {
    "title": "Ukrainians Need (and Want) an End to War",
    "description": "U.S. President Donald Trump’s expressed exasperation\r\n over Russia’s continued attacks on Ukraine seemed to temporarily lift the spirit of pro-war European leaders like France’s Emmanuel Macron, who said he hopes Trump’s anger “translates into action.” The U.…",
    "link": "https://www.commondreams.org/opinion/ukrainians-need-end-to-war",
    "timestamp": "2025-05-28T11:01:03Z"
  },
  {
    "title": "Trump Media’s Stock Drops Despite $2.5 Billion Bitcoin Treasury Announcement",
    "description": "Trump Media (TMTG) announced that it has successfully raised $2.5 billion from institutional investors, marking one of the largest allocations of Bitcoin treasury assets by a public company. However, the announcement was met with a mixed market response, as s…",
    "link": "http://www.newsbtc.com/bitcoin-news/trump-medias-stock-drops-despite-2-5-billion-bitcoin-treasury-announcement/",
    "timestamp": "2025-05-28T11:00:55Z"
  },
  {
    "title": "Right-Wing Dissent Emerges Over Netanyahu's Gaza War Plan. Plus, a Look Inside the Democrats' $20 Million Male Outreach Effort.",
    "description": "Boys will be boys: Democratic donors and strategists have spent much of the year gathered at luxury hotels discussing how to win back male voters. Part of their play is a $20 million effort code-named SAM—short for \"Speaking with American Men: A Strategic Pla…",
    "link": "https://freebeacon.com/newsletters/a-look-inside-the-democrats-20-million-male-outreach-effort-plus-trump-threatens-another-60-minutes-suit/",
    "timestamp": "2025-05-28T11:00:51Z"
  },
  {
    "title": "US military vulnerabilities threaten Trump's 'peace-through-strength' strategy",
    "description": "President Trump advances his 'peace-through-strength' strategy, addressing military vulnerabilities and budget challenges in the Middle East and Asia.",
    "link": "https://www.foxnews.com/opinion/us-military-vulnerabilities-threaten-trumps-peace-through-strength-strategy",
    "timestamp": "2025-05-28T11:00:29Z"
  },
  {
    "title": "Succeeding Trump: 6 Republican potential presidential hopefuls to keep your eyes on in 2028",
    "description": "As Trump appears to dismiss a 2028 White House run, GOP figures like JD Vance and Marco Rubio gain attention, while Democrats begin early moves in next presidential race.",
    "link": "https://www.foxnews.com/politics/succeeding-trump-six-republican-potential-presidential-hopefuls-keep-your-eyes-2028",
    "timestamp": "2025-05-28T11:00:15Z"
  },
  {
    "title": "Dionne Warwick to perform at National Pride Gala, joining other big names",
    "description": "In a year marked by escalating political attacks on LGBTQ+ rights, Dionne Warwick will headline one of the most visible acts of queer resistance in the nation’s capital. On June 4, the Grammy-winning music legend will perform her 1985 anthem “That’s What Frie…",
    "link": "https://www.advocate.com/news/equality-pac-gala-dionne-warwick",
    "timestamp": "2025-05-28T11:00:03Z"
  },
  {
    "title": "I Teach U.S. History at Harvard. Here’s What Donald Trump Gets Wrong About Our Past",
    "description": "\"To see American history as simply a narrative of heroism would be a lie unbecoming a great nation.\"",
    "link": "https://time.com/7289027/history-harvard-donald-trump-wrong/",
    "timestamp": "2025-05-28T11:00:00Z"
  },
  {
    "title": "Developer seeks incentives for new St. Louis health clinic for the VA",
    "description": "A developer behind a health care clinic in the Grand Center neighborhood said Tuesday it needs incentives in order to finish a deal with the U.S. Veterans Affairs.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_b5a117dc-74d5-49fe-aa67-a7ad09131564.html",
    "timestamp": "2025-05-28T11:00:00Z"
  },
  {
    "title": "Donald Trump Jr. wrote that visit to Arlington National Cemetery reminded him of family's 'sacrifices'",
    "description": "Donald Trump Jr. said driving through Arlington National Cemetery reminded him of \"all the sacrifices we'd have to make — giving up a huge chunk of our business and all international deals.\"",
    "link": "https://www.snopes.com//fact-check/donald-trump-jr-arlington-cemetery/",
    "timestamp": "2025-05-28T11:00:00Z"
  },
  {
    "title": "Fact Check: Donald Trump Jr. wrote that visit to Arlington National Cemetery reminded him of family's 'sacrifices'",
    "description": "Trump said he thought of \"all the attacks we'd already suffered as a family … all the sacrifices we'd have to make to help my father succeed.\"",
    "link": "https://www.snopes.com/fact-check/donald-trump-jr-arlington-cemetery/",
    "timestamp": "2025-05-28T11:00:00Z"
  },
  {
    "title": "The Daily Heller: Walking in the Footsteps of the Greats",
    "description": "Steven Heller shares his keynote address for SVA's 50th commencement.\nThe post The Daily Heller: Walking in the Footsteps of the Greats appeared first on PRINT Magazine.",
    "link": "https://www.printmag.com/daily-heller/the-daily-heller-walking-in-the-footsteps/",
    "timestamp": "2025-05-28T11:00:00Z"
  },
  {
    "title": "Links 5/28/2025",
    "description": "Our punchy daily links: prepper gourmets, SpaceX blowup again, sun killingStarlink, cracking Bitcoin encryption., China employment vulnerability, EU v. Hungary again, CIA tie to Israel food aid, education AI crisis, moar Trump v. student immigrants,",
    "link": "https://www.nakedcapitalism.com/2025/05/links-5-28-2025.html",
    "timestamp": "2025-05-28T10:58:24Z"
  },
  {
    "title": "Macy’s cuts profit outlook as tariffs, promotions hit its business",
    "description": "Macy's beat earnings estimates for the fourth quarter, but cut its 2025 profit outlook as tariffs complicate its turnaround strategy.",
    "link": "https://www.cnbc.com/2025/05/28/macys-m-q1-2025-earnings-.html",
    "timestamp": "2025-05-28T10:58:13Z"
  },
  {
    "title": "Over 30% of new crypto users start with meme coins, says Gemini’s 2025 report",
    "description": "94% of meme coin holders also invest in Bitcoin and Ethereum later. US leads in meme coin adoption, with 31% starting their crypto journey with them. Meme coins now have a combined market cap of $74.4 billion. Meme coins are no longer just a punchline in the …",
    "link": "https://coinjournal.net/news/over-30-of-new-crypto-users-start-with-meme-coins-says-geminis-2025-report/",
    "timestamp": "2025-05-28T10:56:11Z"
  },
  {
    "title": "Musk 'disappointed' by Trump's tax and spending bill",
    "description": "As the former Doge chief, Musk had worked to reduce government spending which he says this bill contradicts.",
    "link": "https://www.bbc.com/news/articles/c20q54vn0evo",
    "timestamp": "2025-05-28T10:55:57Z"
  },
  {
    "title": "Bitcoin Is The Golden Standard, According to Trump: What’s the Best New Crypto to Invest In?",
    "description": "US President Donald Trump’s top crypto advisor Bo Hines declared yesterday that ‘Bitcoin is golden standard’ in cryptocurrencies on the first day of the Bitcoin Conference 2025. He added that the US government is looking to acquire as much $BTC as it can get …",
    "link": "https://bitcoinist.com/bitcoin-is-the-golden-standard-best-new-crypto-to-ride-bull-run/",
    "timestamp": "2025-05-28T10:55:16Z"
  },
  {
    "title": "Non-Credible America",
    "description": "By launching a trade war with the rest of the world, Donald Trump has already repudiated the conventional tools used to conclude international agreements, and introduced profound uncertainty about American commitments and the country’s adherence to rule of la…",
    "link": "https://www.project-syndicate.org/commentary/trump-violation-of-trade-statues-and-treaties-destroyed-us-credibility-by-aziz-huq-2025-05",
    "timestamp": "2025-05-28T10:51:59Z"
  },
  {
    "title": "Bitcoin price surge encourages more companies to acquire crypto",
    "description": "Many digital asset firms are trying to emulate software group Strategy’s success",
    "link": "https://www.irishtimes.com/business/2025/05/28/bitcoin-price-surge-encourages-more-companies-to-acquire-crypto/",
    "timestamp": "2025-05-28T10:51:31Z"
  },
  {
    "title": "Russia: Trump lacks info about war in Ukraine",
    "description": "Russian presidential aide Yuri Ushakov claimed on Wednesday that United States President Donald Trump is \"not being informed enough\" about the war in Ukraine. He said Trump is unaware of Ukraine's \"ma...",
    "link": "https://biztoc.com/x/bd5970d6b4fddc25",
    "timestamp": "2025-05-28T10:51:06Z"
  },
  {
    "title": "Like Scott Pelley’s Commencement Rant, 60 Minutes Is Unserious Democrat Propaganda",
    "description": "Scott Pelley's sickening, self-important speech shows he has long forgotten that truth and journalism are best served with humility.",
    "link": "https://thefederalist.com/2025/05/28/like-scott-pelleys-commencement-rant-60-minutes-is-unserious-democrat-propaganda/",
    "timestamp": "2025-05-28T10:48:00Z"
  },
  {
    "title": "This US state is on Trump's radar list as he wants to block funding for transgender athletes. Here's why",
    "description": "President Donald Trump threatened to withhold federal funding if California did not stop a transgender girl in high school from competing in state track and field finals. He said he would discuss it with Governor Gavin Newsom on Tuesday. He said he was orderi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-threatens-block-federal-funds-california-transgender-athletes/articleshow/121463774.cms",
    "timestamp": "2025-05-28T10:47:50Z"
  },
  {
    "title": "Ukraine updates: Zelenskyy and Merz hold talks in Berlin",
    "description": "Ukrainian President Volodymyr Zelensky met German Chancellor Friedrich Merz in Berlin to discuss further military support. Follow DW for updates. Ukrainian President Volodymyr Zelenskyy and German Chancellor Friedrich Merz discuss Berlin's support for Ukraine…",
    "link": "https://www.dw.com/en/ukraine-updates-zelenskyy-and-merz-hold-talks-in-berlin/live-72693164",
    "timestamp": "2025-05-28T10:44:00Z"
  },
  {
    "title": "American-born Team Israel Olympian praises Trump's fight vs antisemitism, but won't play for Team USA",
    "description": "Adam Edelman, a Jewish American bobsledder, strives for Olympic glory with Team Israel while endorsing President Donald Trump's stance on fighting antisemitism in education.",
    "link": "https://www.foxnews.com/sports/american-born-team-israel-olympian-praises-trumps-fight-vs-antisemitism-wont-play-team-usa",
    "timestamp": "2025-05-28T10:41:51Z"
  },
  {
    "title": "Trump administration sues North Carolina over its voter registration records",
    "description": "The Trump administration has accused North Carolina’s election board of violating federal law by failing to ensure that registration records of some applicants contained identifying numbers",
    "link": "https://www.wsoctv.com/news/national/trump-administration/OMGIER5I4NFAFLY7QUSCPS6DAA/",
    "timestamp": "2025-05-28T10:41:06Z"
  },
  {
    "title": "Transcript: Humiliated Trump’s Anger at Putin Grows as GOP Angst Rises",
    "description": "The following is a lightly edited transcript of the May 28 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident …",
    "link": "https://newrepublic.com/article/195767/transcript-humiliated-trump-anger-putin-grows-gop-angst-rises",
    "timestamp": "2025-05-28T10:40:52Z"
  },
  {
    "title": "Who Are The Afrikaners Seeking Refuge In US?",
    "description": "By Jacob Adams, The Daily Signal | May 24, 2025\nPresident Donald Trump raised the issue of the killings of white South Africans in that country during an Oval Office visit by its president this week.\nIt came as the Trump administration expedited the refugee c…",
    "link": "https://biztoc.com/x/a18b1a8e661fb2af",
    "timestamp": "2025-05-28T10:40:18Z"
  },
  {
    "title": "The Librarian Of Congress Should Support The Founders’ Goal Of Protecting American Creators",
    "description": "By Adam Mossoff, The Daily Signal | May 24, 2025\nPresident Donald Trump fired Librarian of Congress Carla Hayden on May 9. Since then, he’s announced that Deputy Attorney General Todd Blanche will assume the role of acting librarian of Congress.\nTrump’s ultim…",
    "link": "https://biztoc.com/x/5eac7221f2dbe423",
    "timestamp": "2025-05-28T10:40:12Z"
  },
  {
    "title": "Apple and US tariffs: The future of iPhone production",
    "description": "President Trump threatened a hefty 25% tariff against Apple unless they manufacture phones sold in the U.S. stateside.",
    "link": "https://www.ketv.com/article/iphone-production-us-tariffs-apple-decision/64901332",
    "timestamp": "2025-05-28T10:39:28Z"
  },
  {
    "title": "Nvidia to have final say on strong earnings season for Big Tech",
    "description": "Nvidia faces a crucial earnings test after a significant rally fueled by strong AI spending commitments from major customers and new demand from the Middle East. Investors are closely watching the supply of Blackwell chips, profit margins, and the impact of U…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-to-have-final-say-on-strong-earnings-season-for-big-tech/articleshow/121463373.cms",
    "timestamp": "2025-05-28T10:38:36Z"
  },
  {
    "title": "Pardoned Todd Chrisley's Son Kyle Hopes for Reconciliation With Family",
    "description": "Todd Chrisley’s son Kyle is hoping for a family reconciliation following President Donald Trump’s decision to pardon his dad and stepmom, Julie. “I’m ecstatic. Truly. I just found out a little bit ago and I still just can’t believe it,” Kyle, 33, told E! News…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisleys-pardon-kyle-hopes-for-family-reconciliation-page/#article",
    "timestamp": "2025-05-28T10:37:29Z"
  },
  {
    "title": "Kremlin Rebuffs Zelensky's Call For Three-way Meeting With Trump, Putin",
    "description": "The Kremlin on Wednesday rebuffed a call by Ukrainian President Volodymyr Zelensky for a three-way summit with Donald Trump and Vladimir Putin as Kyiv seeks to force Moscow to halt its three-year-long invasion.",
    "link": "https://www.ibtimes.com.au/kremlin-rebuffs-zelenskys-call-three-way-meeting-trump-putin-1859122",
    "timestamp": "2025-05-28T10:33:10Z"
  },
  {
    "title": "South Africa's president pushes back on Trump's demand to arrest politician who chanted 'kill the farmer'",
    "description": "South African President Cyril Ramaphosa says he will not have Julius Malema, who repeatedly chants “Kill the farmer,\" arrested despite a demand from President Donald Trump.",
    "link": "https://www.foxnews.com/world/south-africas-president-pushes-back-trumps-demand-arrest-politician-who-chanted-kill-farmer",
    "timestamp": "2025-05-28T10:32:54Z"
  },
  {
    "title": "‘TACO’: Wall Street Mocks Trump With 4-Letter Code to Call Bets Against Him",
    "description": "Wall Street traders have developed a biting new acronym for a strategy that’s become surprisingly lucrative for Trump’s whiplash-inducing trade policy.\nThe post ‘TACO’: Wall Street Mocks Trump With 4-Letter Code to Call Bets Against Him first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/taco-wall-street-mocks-trump-with-4-letter-code-to-call-bets-against-him/",
    "timestamp": "2025-05-28T10:30:38Z"
  },
  {
    "title": "Donald Trump ripped by another rock icon: ‘We are staring down a dark channel’",
    "description": "Donald Trump ripped by another rock icon: ‘We are staring down a dark channel’pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2025/05/donald-trump-ripped-by-another-rock-icon-we-are-staring-down-a-dark-channel.html",
    "timestamp": "2025-05-28T10:30:38Z"
  },
  {
    "title": "Upgraded Very Large Array Telescope Will Spot Baby Solar Systems—If It’s Funded",
    "description": "A new telescope project called the Next-Generation Very Large Array will revolutionize radio astronomy if it gets the funding it needs",
    "link": "https://www.scientificamerican.com/article/upgraded-very-large-array-telescope-will-spot-baby-solar-systems-if-its/",
    "timestamp": "2025-05-28T10:30:00Z"
  },
  {
    "title": "Kayleigh McEnany Makes Chilling Demand For ‘60 Minutes’ Reporter Over Anti-Trump Speech",
    "description": "The Trump White House press secretary-turned-Fox News host railed over Scott Pelley’s now-viral address at Wake Forest University.",
    "link": "https://www.huffpost.com/entry/kayleigh-mcenany-scott-pelley-fox-news-trump-speech_n_6836db0fe4b09d67a28cc9d6",
    "timestamp": "2025-05-28T10:29:47Z"
  },
  {
    "title": "Regime Uncertainty And The Trump New Deal",
    "description": "By William L. Anderson, Mises Wire | May 22, 2025\nAs we moved through the fourth month of the Donald Trump presidency, chaos seems to be the situation for the economy. The recent announcement that the GDP had shrunk slightly has spooked the markets, as the up…",
    "link": "https://biztoc.com/x/f7c4f37d5aaa1430",
    "timestamp": "2025-05-28T10:28:52Z"
  },
  {
    "title": "Japan urges universities to accept students hit by US block",
    "description": "The Japanese government has asked local universities to consider accepting students at US universities as President Donald Trump seeks to force Harvard to submit to unprecedented oversight. Japanese Education Minister Toshiko Abe said on Tuesday that her mini…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/japan-urges-universities-to-accept-students-hit-by-us-block/articleshow/121462836.cms",
    "timestamp": "2025-05-28T10:27:41Z"
  },
  {
    "title": "Why Apple doesn’t make iPhones in America – and probably won’t | CNN Business",
    "description": "In 2011, then-President Barack Obama pressed Apple CEO Steve Jobs on what it would take to bring iPhone production to the United States, according to The New York Times.",
    "link": "https://www.cnn.com/2025/05/28/tech/apple-iphone-trump-america-china",
    "timestamp": "2025-05-28T10:27:07Z"
  },
  {
    "title": "Trump lawyer in Harvard battle says DOJ intends to sue UC over antisemitism allegations",
    "description": "A Justice Department official leading President Donald Trump's battle against Harvard says the administration intends to take the University of California to court over alleged antisemitism.",
    "link": "https://www.jpost.com/international/article-855745",
    "timestamp": "2025-05-28T10:25:49Z"
  },
  {
    "title": "20 EU countries call for action over Hungary’s Pride ban",
    "description": "20 EU countries have called for a response to Hungary’s law banning LGBTQ+ Pride marches. The law was signed into effect by prime minister Viktor Orbán in March, after it was submitted to parliament by his ruling Fidesz party. It set fines of up to 200,000 fo…",
    "link": "https://www.thepinknews.com/2025/05/28/20-eu-countries-call-for-action-over-hungarys-pride-ban/",
    "timestamp": "2025-05-28T10:25:02Z"
  },
  {
    "title": "Trump Bitcoin Company to Go Public",
    "description": "“American Bitcoin, a new bitcoin miner backed by U.S. President Donald Trump's two eldest sons, said on Monday it will list on the Nasdaq via an all-stock merger with Gryphon Digital Mining,” Reuters reports.",
    "link": "https://politicalwire.com/2025/05/28/trump-bitcoin-company-to-go-public/",
    "timestamp": "2025-05-28T10:23:00Z"
  },
  {
    "title": "Centrica Expands to New York With Build-Out of Gas Trading Unit",
    "description": "Centrica Plc is opening a trading office in New York that will underpin its growth in natural gas.",
    "link": "https://financialpost.com/pmn/business-pmn/centrica-expands-to-new-york-with-build-out-of-gas-trading-unit",
    "timestamp": "2025-05-28T10:22:23Z"
  },
  {
    "title": "US scolds Russia for stoking World War Three fears",
    "description": "US President Donald Trump’s envoy, Keith Kellogg, on Wednesday scolded a top Russian official for stoking fears of World War Three after Trump warned President Vladimir Putin was “playing with fire” over Ukraine. -snip- US envoy Kellogg quoted Medvedev’s post…",
    "link": "https://freerepublic.com/focus/f-chat/4319501/posts",
    "timestamp": "2025-05-28T10:21:04Z"
  },
  {
    "title": "Weather researchers kick off 100-hour livestream as data-driven protest against Trump's science cuts",
    "description": "In response to US President Trump's science funding cuts, climate and weather scientists are hosting a 100-hour livestream. The event showcases the importance of their work, from hurricane prediction to climate patterns, emphasizing the threat these cuts pose…",
    "link": "https://economictimes.indiatimes.com/news/international/us/weather-researchers-kick-off-100-hour-livestream-as-data-driven-protest-against-trumps-science-cuts/articleshow/121462977.cms",
    "timestamp": "2025-05-28T10:18:58Z"
  },
  {
    "title": "Kremlin on Trump's 'playing with fire' comments: National interests paramount for Putin",
    "description": "MOSCOW (Reuters) -Kremlin spokesman Dmitry Peskov, in comments about U.S. President Donald Trump's remark that Vladimir Putin was \"playing with fire\" by refusing to engage in ceasefire talks with Kyiv, said the national interest was paramount for the Russian …",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/kremlin-on-trump039s-039playing-with-fire039-comments-national-interests-paramount-for-putin",
    "timestamp": "2025-05-28T10:18:00Z"
  },
  {
    "title": "Peskov: Trump wants speedy settlement in Ukraine",
    "description": "Kremlin spokesperson Dmitry Peskov said on Wednesday that United States President Donald Trump wants a \"speedy\" settlement to the conflict in Ukraine after being asked about Trump's comments that Russ...",
    "link": "https://biztoc.com/x/e3eb7d37b7418cf4",
    "timestamp": "2025-05-28T10:18:00Z"
  },
  {
    "title": "Why Two Republicans Voted Against Trump’s ‘Big, Beautiful’ Bill",
    "description": "By Adam Pack via Daily Caller News Foundation | April 21, 2025\nTwo Republican fiscal hawks voted against the “one big, beautiful bill” despite overwhelming pressure from House GOP leadership and President Donald Trump to support the legislation.\nRepublican Re…",
    "link": "https://biztoc.com/x/0eed12c10e1410a5",
    "timestamp": "2025-05-28T10:17:37Z"
  },
  {
    "title": "Donald Trump Jr. Reveals How Getting 'De-Banked,' 'De-Insured' Led Him And Eric Trump To 'Orange Pill' Their Father On Crypto",
    "description": "Donald Trump Jr., the eldest son of U.S. President Donald Trump, disclosed how he and his brother, Eric Trump, influenced their father’s views on Bitcoin (CRYPTO: BTC) and cryptocurrency.\nWhat Happened: Speaking at the Bitcoin 2025 conference in Las Vegas on …",
    "link": "https://biztoc.com/x/df1e56974d35ea3d",
    "timestamp": "2025-05-28T10:17:37Z"
  },
  {
    "title": "Elon Musk says Trump tax bill weakens Doge cost-cutting efforts",
    "description": "Remarks may widen rift between US president and Tesla boss as Musk appears to criticise Trump’s One Beautiful Bill Act\nElon Musk has publicly criticised Donald Trump’s tax bill, saying the US president’s spending plan undermines cost-cutting efforts that the …",
    "link": "https://biztoc.com/x/baea2e4d3cb4969d",
    "timestamp": "2025-05-28T10:17:35Z"
  },
  {
    "title": "Zelensky meets Merz in Germany for talks on Ukraine war",
    "description": "Ukrainian President Volodymyr Zelensky visited Germany on Wednesday to meet Chancellor Friedrich Merz, who has pledged muscular backing for Kyiv in its fight against Russia.",
    "link": "https://www.thelocal.de/20250528/zelensky-meets-merz-in-germany-for-talks-on-ukraine-war",
    "timestamp": "2025-05-28T10:17:05Z"
  },
  {
    "title": "'Still don't believe it's real': Savannah Chrisley reacts to Trump pardoning parents",
    "description": "After hearing the news that President Donald Trump will pardon reality TV stars Todd and Julie Chrisley, Savannah Chrisley,celebrated the news on Instagram.",
    "link": "https://abcnews.go.com/US/real-savannah-chrisley-reacts-parents-pardoned-trump/story?id=122258896",
    "timestamp": "2025-05-28T10:16:51Z"
  },
  {
    "title": "U.S. Responds to Gaza Aid Mission's Chaotic Start",
    "description": "Food was distributed to Palestinians in a scramble that was also marked by Israeli gunfire",
    "link": "https://www.newsweek.com/us-responds-gaza-aid-missions-chaotic-start-2077788",
    "timestamp": "2025-05-28T10:16:35Z"
  },
  {
    "title": "Musk ‘disappointed’ by Trump’s ‘Big Beautiful Bill’",
    "description": "The billionaire has said the tax bill “undermines” cost-cutting efforts by his efficiency agency Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618250-musk-tax-bill-criticism/",
    "timestamp": "2025-05-28T10:14:38Z"
  },
  {
    "title": "Texas Senate passes bill to define the difference between man and woman based on reproductive organs. Check details",
    "description": "The Texas Senate has passed a bill to define who a woman is. House Bill 229 strictly defines men and women based on the reproductive organs they were born with, and orders state records to reflect this binary. The bill passed on second reading 86-36 after an …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-texas-senate-passes-bill-to-define-the-difference-between-man-and-woman-based-on-reproductive-organs-check-details/articleshow/121462639.cms",
    "timestamp": "2025-05-28T10:13:32Z"
  },
  {
    "title": "What is a stablecoin and what could it mean for your finances?",
    "description": "The crypto tokens could change everyday payments. But they pose risks.",
    "link": "https://abcnews.go.com/Business/stablecoin-finances/story?id=122108448",
    "timestamp": "2025-05-28T10:09:00Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "US banks are cautiously exploring cryptocurrency expansion amid regulatory easing, focusing on pilot projects and partnerships. While JPMorgan remains sceptical, others like Charles Schwab and Bank of America plan crypto offerings. Banks seek clearer guidelin…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-banks-tiptoe-toward-crypto-awaiting-more-green-light-from-regulators/articleshow/121462761.cms",
    "timestamp": "2025-05-28T10:08:22Z"
  },
  {
    "title": "Kremlin on Trump's 'playing with fire' comments: National interests paramount for Putin",
    "description": "Kremlin spokesman Dmitry Peskov, in comments about U.S. President Donald Trump's remark that Vladimir Putin was \"playing with fire\" by refusing to engage in ...",
    "link": "https://www.yahoo.com/news/kremlin-trumps-playing-fire-comments-100821841.html",
    "timestamp": "2025-05-28T10:08:21Z"
  },
  {
    "title": "Iran might accept US IAEA inspectors if nuclear deal reached",
    "description": "DUBAI: Iran might allow the UN atomic watchdog to send US inspectors to Iranian sites if Tehran's talks with Washington succeed, Iran's nuclear chief Mohammad Eslami said on Wednesday (May 28). Tehran and Washington are expected to hold a sixth round of talks…",
    "link": "https://www.channelnewsasia.com/world/iran-might-accept-us-iaea-inspectors-if-nuclear-deal-reached-5156756",
    "timestamp": "2025-05-28T10:08:06Z"
  },
  {
    "title": "Any US-Iran deal should include 'robust' IAEA inspections, Grossi says",
    "description": "VIENNA: Any deal between Iran and the US that would impose fresh nuclear curbs on Iran should include \"very robust\" inspections by the UN nuclear watchdog, International Atomic Energy Agency chief Rafael Grossi said on Wednesday (May 28). The two countries ar…",
    "link": "https://www.channelnewsasia.com/world/any-us-iran-deal-should-include-robust-iaea-inspections-grossi-says-5156756",
    "timestamp": "2025-05-28T10:08:00Z"
  },
  {
    "title": "Nearly Half of Americans Say Trump Not Being Transparent About Health",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNearly half of Americans believe President Donald Trump is not being transparent about his health, according to a new poll.\nThe latest YouGov/Economist poll, conducted between May 23 and 26 among 1,660 adults,…",
    "link": "https://biztoc.com/x/3663df963ebef3f2",
    "timestamp": "2025-05-28T10:06:41Z"
  },
  {
    "title": "Trump Was Right To Shame South African President",
    "description": "By Jarrett Stepman, The Daily Signal | May 22, 2025\nIn one of the most incredible scenes in American diplomatic history, President Donald Trump halted his meeting with the South African president Wednesday to show him a video montage of threats made to white …",
    "link": "https://biztoc.com/x/72751a8416472ace",
    "timestamp": "2025-05-28T10:06:12Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "NEW YORK :Big U.S. banks are holding internal discussions about expanding into cryptocurrencies as they get stronger endorsements from regulators, but initial steps will be tentative, centering on pilot programs, partnerships or limited crypto trading, accord…",
    "link": "https://www.channelnewsasia.com/business/us-banks-tiptoe-toward-crypto-awaiting-more-green-lights-regulators-5156976",
    "timestamp": "2025-05-28T10:05:51Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "NEW YORK :Big U.S. banks are holding internal discussions about expanding into cryptocurrencies as they get stronger endorsements from regulators, but initial steps will be tentative, centering on pilot programs, partnerships or limited crypto trading, accord…",
    "link": "https://www.channelnewsasia.com/business/us-banks-tiptoe-toward-crypto-awaiting-more-green-light-regulators-5156976",
    "timestamp": "2025-05-28T10:05:51Z"
  },
  {
    "title": "Trump has not ‘cancelled’ Pride month – it’s a deepfake video",
    "description": "President Donald Trump hasn’t used a video announcement to cancel Pride month. Althoughthe US president has been criticised for his anti-LGBTQ+ executive orders and making bizarre claims about transgender mice, and for sharing Nazi-era insignia online, he has…",
    "link": "https://www.thepinknews.com/2025/05/28/trump-pride-month-video-deepfake/",
    "timestamp": "2025-05-28T10:05:50Z"
  },
  {
    "title": "Nearly Half of Americans Say Trump Not Being Transparent About Health",
    "description": "The White House physician has said the president is in excellent physical health, but some voters say Trump is not being transparent.",
    "link": "https://www.newsweek.com/nearly-half-americans-say-trump-not-being-transparent-about-health-2077825",
    "timestamp": "2025-05-28T10:04:24Z"
  },
  {
    "title": "Trump Admin Fast-Tracks Approval of Utah Uranium Mine in Mere Weeks",
    "description": "A rapid 14-day environmental review has seen a new uranium mine approved in Utah. The endorsement is part of a refreshed Trump administration process to fast-track permissions for energy and mining projects.\nThe post Trump Admin Fast-Tracks Approval of Utah U…",
    "link": "https://www.breitbart.com/politics/2025/05/28/new-utah-uranium-mine-approved-as-trump-delivers-again-on-promise-to-fast-track-energy-projects/",
    "timestamp": "2025-05-28T10:03:46Z"
  },
  {
    "title": "China and tariffs have wiped off $130 billion from critical chip firm ASML since peak value",
    "description": "ASML, like many chip firms, has been hit by restrictions on exports to China and U.S. tariff uncertainty.",
    "link": "https://www.cnbc.com/2025/05/28/asml-shares-china-and-tariffs-have-wiped-off-130-billion-of-value.html",
    "timestamp": "2025-05-28T10:02:07Z"
  },
  {
    "title": "Atlantic editor doesn't 'understand' the narrative that media covered for Biden's health",
    "description": "Atlantic's Jeffrey Goldberg and CNN's Jake Tapper explore media narratives on Biden's health, referencing the book 'Original Sin' and its investigative findings.",
    "link": "https://www.foxnews.com/media/atlantic-editor-doesnt-understand-narrative-media-covered-bidens-health",
    "timestamp": "2025-05-28T10:00:47Z"
  },
  {
    "title": "Do You Hear What I Hear? Audio Illusions and Misinformation",
    "description": "Are you old enough to remember the “Magic Eye” optical illusion mania that gripped the nation in the 90’s—random patterns that you had to squint at just right for the 3D image to pop out?  It turns out it's not just our eyes that can be fooled. Our ears can p…",
    "link": "https://www.kqed.org/news/12041731/do-you-hear-what-i-hear-audio-illusions-and-misinformation",
    "timestamp": "2025-05-28T10:00:45Z"
  },
  {
    "title": "JD Vance speaking at Bitcoin event today, as Trump's crypto ties grow",
    "description": "The vice president owned over $250,000 worth of Bitcoin as of last year.",
    "link": "https://www.cbsnews.com/news/jd-vance-bitcoin-event-today-trump-administration-crypto-ties-grow/",
    "timestamp": "2025-05-28T10:00:19Z"
  },
  {
    "title": "Democrats Demand Salary Details For Trump’s Political Appointees",
    "description": "Senators want the Trump administration to explain why it's paying \"political cronies\" as much as $195,200 amid its mass firings of civil servants.",
    "link": "https://www.huffpost.com/entry/democrats-trump-political-appointees-salaries_n_68364717e4b09d67a28c7e87",
    "timestamp": "2025-05-28T10:00:06Z"
  },
  {
    "title": "When push comes to shove, Brigitte Macron’s swat was more a mirror than a meme",
    "description": "It came in a blur of cameras and confusion: French President Emmanuel Macron, jaw tense and posture assertive, caught a shove to the face \r\nfrom someone far closer than any protester. The hand belonged to his wife, Brigitte.",
    "link": "https://www.advocate.com/voices/brigitte-emmanuel-macron-shove",
    "timestamp": "2025-05-28T10:00:04Z"
  },
  {
    "title": "Loudmouth Trump just met his match — and it's about damn time",
    "description": "The tide is turning in this fight against Republican fascism, and if you listen you can hear it. And when you hear it, you can feel it. And by God, if you can feel it, well then let it move you to take action.After catching punch after punch from the most ant…",
    "link": "https://www.rawstory.com/raw-investigates/bruce-springsteen-trump/",
    "timestamp": "2025-05-28T10:00:03Z"
  },
  {
    "title": "Trump's Greenland Bid Poses Global Dangers, Says the Woman Facing Him Down",
    "description": "Danish Prime Minister Mette Frederiksen told Newsweek in an interview that Greenland must decide its own fate.",
    "link": "https://www.newsweek.com/trump-greenland-denmark-mette-frederiksen-nato-russia-china-2077596",
    "timestamp": "2025-05-28T10:00:01Z"
  },
  {
    "title": "Harvard faces war of attrition against Trump administration on multiple fronts",
    "description": "The Trump administration's actions against Harvard, including threats to tax-exempt status and foreign student policies, could reshape higher education dynamics.",
    "link": "https://www.foxnews.com/opinion/harvard-faces-war-attrition-against-trump-administration-multiple-fronts",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Yaron Lischinsky and Sarah Milgrim Wanted Peace, Not More Hatred",
    "description": "Before one writes\ncritically about the murders\nof Yaron Lischinsky and Sarah Milgrim in Washington by 31-year-old pro-Palestinian Chicago resident Elias Rodriguez, one must first offer a\nfew obvious though necessary qualifications. First, the killing of these…",
    "link": "https://newrepublic.com/article/195705/lischinsky-milgrim-antisemitic-shooting-embassy",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Trump’s Fury at Harvard Gets More Deranged—and Exposes a Big MAGA Scam",
    "description": "President Donald Trump has mostly justified his lawless attempt to restrict international students from attending Harvard University by pretending it’s designed to root out the antisemites, woke radicals, and dangerous terrorists supposedly nesting in their r…",
    "link": "https://newrepublic.com/article/195766/trump-fury-harvard-maga-scam",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "The Senate's version of Trump's megabill could wind up more harmful than expected",
    "description": "Senate Republicans working on the One Big Beautiful Bill Act recently weakened the filibuster which could help their budget bill past the parliamentarian",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/senate-gop-trump-megabill-rcna209345",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "The Supreme Court Wants to Crush Regulation—But Not the Fed",
    "description": "When my daughter Alice was six, she looked down at a roasted half-chicken on her plate, visualized it for the first time as the body of a once-living creature, and announced that she would henceforth be a vegetarian—“except for bacon.” I thought of Alice last…",
    "link": "https://newrepublic.com/article/195765/supreme-court-trump-federal-reserve",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "The two strongest points in NPR’s lawsuit against the Trump administration",
    "description": "A lawsuit from NPR makes a strong case that President Trump lacks the power to block NPR's funding and that his efforts violate the First Amendment.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/npr-lawsuit-trump-executive-order-rcna209323",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Rage and Resentment Are Killing the Great American Road Trip",
    "description": "A record 45 million Americans were expected to travel this Memorial Day weekend, long considered the unofficial kickoff to summer. And most of them were hitting the road. Sarah Kendzior is no stranger to the family road trip. Her family, in fact, has visited …",
    "link": "https://www.motherjones.com/politics/2025/05/trump-national-parks-summer-road-trips-sarah-kendzior/",
    "timestamp": "2025-05-28T10:00:00Z"
  }
]