[
  {
    "title": "Troubled Israel-Hamas Talks Will Bedevil Trump’s Bid to End War",
    "description": "US President Donald Trump hopes to put Israel and Hamas on the path to ending the war in Gaza this week, but the 60-day ceasefire he’s proposing faces disagreements over troop redeployments and civilian relief.",
    "link": "https://financialpost.com/pmn/business-pmn/troubled-israel-hamas-talks-will-bedevil-trumps-bid-to-end-war",
    "timestamp": "2025-07-06T13:37:11Z"
  },
  {
    "title": "One Big Beautiful Bill Delivers Historic Middle-Class Tax Relief",
    "description": "After decades of broken promises by previous administrations, President Trump has finally put more than $10,000 back into the pockets of working families.\nThe post One Big Beautiful Bill Delivers Historic Middle-Class Tax Relief appeared first on The Gateway …",
    "link": "https://www.thegatewaypundit.com/2025/07/one-big-beautiful-bill-delivers-historic-middle-class/",
    "timestamp": "2025-07-06T13:30:08Z"
  },
  {
    "title": "Netanyahu and Trump to meet in DC as Gaza’s fate without Hamas is debated",
    "description": "Gaza's future without Hamas faces challenges as experts weigh options including technocratic government, Arab coalition support, and local governance amid Trump-Netanyahu talks.",
    "link": "https://www.foxnews.com/world/netanyahu-trump-meet-dc-gazas-fate-without-hamas-debated",
    "timestamp": "2025-07-06T13:30:00Z"
  },
  {
    "title": "Zelenskyy touts 'fruitful' Trump call after US president was 'disappointed' by Putin talk",
    "description": "Zelenskyy and Trump held a strategic call addressing Ukraine's air defense needs, possible Patriot missile sales, as Russia continued its bombing campaign.",
    "link": "https://www.foxnews.com/world/zelenskyy-touts-fruitful-trump-call-after-us-president-disappointed-putin-talk",
    "timestamp": "2025-07-06T13:27:38Z"
  },
  {
    "title": "Desperate Search For Missing Girls As Texas Flood Death Toll Rises",
    "description": "Rescuers were racing against time Sunday to find dozens of missing people, including children, swept away by flash floods that killed more than 50 in Texas, as forecasters warned of new deluges.",
    "link": "https://www.ibtimes.com/desperate-search-missing-girls-texas-flood-death-toll-rises-3777759",
    "timestamp": "2025-07-06T13:27:31Z"
  },
  {
    "title": "A San Francisco Treat for Trump? Scott Wiener Files for Congress",
    "description": "State Senator Scott Wiener, a progressive representing San Francisco who is likely too radical for most moderate Democrats, has decided to run for a seat in the US House of Representatives. This could be a gift to President Donald Trump. He was already handed…",
    "link": "https://freerepublic.com/focus/f-bloggers/4327129/posts",
    "timestamp": "2025-07-06T13:26:30Z"
  },
  {
    "title": "Jobs Report Casts Warning On Immigration And Labor Force Declines",
    "description": "The latest jobs report warns U.S. policymakers that immigration and labor force declines threaten to harm the American economy.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/07/06/jobs-report-casts-warning-on-immigration-and-labor-force-declines/",
    "timestamp": "2025-07-06T13:24:58Z"
  },
  {
    "title": "Fresh Israeli strikes in Gaza kill 38 as Netanyahu heads to US for ceasefire talks",
    "description": "Israeli prime minister is set to meet with Trump in Washington on Monday to discuss a U.S. proposal for a truce.",
    "link": "https://www.politico.eu/article/fresh-israeli-strikes-gaza-kill-38-benjamin-netanyahu-heads-us-ceasefire-talks/",
    "timestamp": "2025-07-06T13:24:52Z"
  },
  {
    "title": "China's humanoid robots cut out US chips, and 90% of the supply chain is now local",
    "description": "As US President Donald Trump intensifies rare earth export negotiations with China, Beijing is countering with a media blitz to highlight its rising independence from US semiconductor technology. In June 2025, Chinese authorities arranged a foreign press tour…",
    "link": "https://www.digitimes.com/news/a20250702VL205/donald-trump-rare-earth-chips-supply-chain-beijing.html",
    "timestamp": "2025-07-06T13:15:50Z"
  },
  {
    "title": "Carney drops digital services tax, LNG Canada starts exports to Asia and auto CEOs ask for EV mandate changes: Business and investing stories for the week of July 6",
    "description": "Carney drops digital services tax, LNG Canada starts exports to Asia and auto CEOs ask for EV mandate changes: Business and investing stories for the week of July 6theglobeandmail.com",
    "link": "https://www.theglobeandmail.com/business/article-carney-trump-digital-services-tax-lng-auto-july-6/",
    "timestamp": "2025-07-06T13:14:55Z"
  },
  {
    "title": "Ukraine’s sovereignty was violated long before Trump",
    "description": "For years, governments in Kyiv have been pressured into implementing policies not in the interests of Ukrainians.",
    "link": "https://www.aljazeera.com/opinions/2025/7/6/ukraines-sovereignty-was-violated-long-before-trump",
    "timestamp": "2025-07-06T13:10:57Z"
  },
  {
    "title": "‘Purposefully trying to drive up the price’: Gasoline crisis looms over California as Dems continue to impose crippling regs",
    "description": "'The founding fathers would be rolling over in their graves if they ever thought the government would be in the business of dictating the type of transportation that Americans can choose'",
    "link": "https://www.wnd.com/2025/07/purposefully-trying-drive-up-price-gasoline-crisis-looms/",
    "timestamp": "2025-07-06T13:09:07Z"
  },
  {
    "title": "Iranian supreme leader appears in public for first time since conflict with Israel",
    "description": "Ali Khamenei emerged from his bunker for first time since the Israel-Iran war began, appearing at Ashoura ceremony but not making public statements.",
    "link": "https://www.foxnews.com/politics/iranian-supreme-leader-appears-public-first-time-since-conflict-israel",
    "timestamp": "2025-07-06T13:03:56Z"
  },
  {
    "title": "Sunday Summary: Still Trying to Figure Out the Politics of It",
    "description": "It’s been more than a week, but much of the commercial real estate industry is still in a daze over Zohran Mamdani’s victory in New York’s Democratic mayoral primary, which was made official on July 1. What does Mamdani mean for the business? Select figures l…",
    "link": "http://commercialobserver.com/2025/07/sunday-summary-still-trying-to-figure-out-the-politics-of-it/",
    "timestamp": "2025-07-06T13:00:27Z"
  },
  {
    "title": "Thanks to Trump, the clean energy industry is in jeopardy",
    "description": "The \"One Big Beautiful Bill Act\" takes aim at American jobs and technology",
    "link": "https://www.salon.com/2025/07/06/thanks-to-trump-the-clean-energy-industry-is-in-jeopardy/",
    "timestamp": "2025-07-06T13:00:13Z"
  },
  {
    "title": "These fishermen made peace with offshore wind. Then Trump came along.",
    "description": "Called ​“traitors” at the docks, over 100 East Coast fishermen are also working for wind developers. Many voted for a president who wants to tear it all down.",
    "link": "http://grist.org/energy/these-fishermen-made-peace-with-offshore-wind-then-trump-came-along/",
    "timestamp": "2025-07-06T13:00:00Z"
  },
  {
    "title": "Posts claim girl called Trump 'a disgrace to this world.' Here's the real story",
    "description": "Social media users shared a clip from a comedy sketch, implying it showed a real interaction between a young girl and U.S. President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/trump-video-girl-disgrace/",
    "timestamp": "2025-07-06T13:00:00Z"
  },
  {
    "title": "As the Dust Settles in Iran, the Regime Is Cracking Down on Dissent",
    "description": "In the weeks since the conflict began, Iranian authorities have arrested more than 700 citizens—all accused of collaborating with foreign powers or spreading anti-government sentiments.\nThe post As the Dust Settles in Iran, the Regime Is Cracking Down on Diss…",
    "link": "https://nationalinterest.org/blog/buzz/iran-regime-cracking-down-dissent-hk",
    "timestamp": "2025-07-06T13:00:00Z"
  },
  {
    "title": "Billionaire’s bold move could destroy Trump’s power",
    "description": "Elon Musk has made his most audacious political move yet, announcing the formation of a brand new political party just weeks after his explosive public feud with President Donald Trump reached a boiling point. The world’s richest man took to his social media …",
    "link": "https://rollingout.com/2025/07/06/billionaires-move-could-destroy-trumps/",
    "timestamp": "2025-07-06T12:58:43Z"
  },
  {
    "title": "EU leaders split over tactics as deadline looms for Trump trade talks",
    "description": "With two days of talks left, some want a quick UK-style deal to avert 50% tariffs while others want to play hardball\nThe EU is entering a crunch week with only two days of talks left to secure a trade deal with Washinton to avert Donald Trump’s threatened 50%…",
    "link": "https://biztoc.com/x/28be8d600a3231a9",
    "timestamp": "2025-07-06T12:58:28Z"
  },
  {
    "title": "Elon Musk Launches ‘America Party’ With Wild String Of X Posts — Trashes Trump’s Bill for ‘Bankrupting Our Country’",
    "description": "Elon Musk made it unofficially official Saturday night — launching the \"America Party\" in response to a Trump bill he says is stuffed with \"waste and graft.\"\nThe post Elon Musk Launches ‘America Party’ With Wild String Of X Posts — Trashes Trump’s Bill for ‘B…",
    "link": "https://www.mediaite.com/media/news/elon-musk-launches-america-party-with-wild-string-of-x-posts-trashes-trumps-bill-for-bankrupting-our-country/",
    "timestamp": "2025-07-06T12:56:45Z"
  },
  {
    "title": "How Rare Earths Create Strategic Leverage",
    "description": "Once obscure and overlooked, rare earth elements (REEs) are now at the heart of the 21st-century technological revolution. From precision-guided missiles and electric vehicles to wind turbines and smartphones, REEs power the critical systems that define our d…",
    "link": "https://www.fairobserver.com/economics/how-rare-earths-create-strategic-leverage/",
    "timestamp": "2025-07-06T12:55:32Z"
  },
  {
    "title": "Israel’s Netanyahu to Visit White House Over Hamas, Iran Conflicts",
    "description": "President Donald Trump is scheduled to welcome Israeli Prime Minister Benjamin Netanyahu to the White House Monday as Israel and Hamas appear to make progress on ceasefire negotiations. The two leaders are also expected to discuss the recent strikes by both t…",
    "link": "https://www.today.com/video/israel-s-netanyahu-to-visit-white-house-over-hamas-iran-conflicts-242755141982",
    "timestamp": "2025-07-06T12:54:59Z"
  },
  {
    "title": "The CIA Critiques Itself",
    "description": "You may have read about the report that the Deputy Director of the CIA for Analysis recently submitted to CIA Director John Ratcliffe on the CIA’s anti-Trump effort at the end of 2016. The report is dated June 26, 2025, and is embedded below. I am not sure wh…",
    "link": "https://freerepublic.com/focus/f-bloggers/4327125/posts",
    "timestamp": "2025-07-06T12:54:51Z"
  },
  {
    "title": "Zohran Mamdani: Hypocrisy, Socialism and the Danger of Elitist Politics",
    "description": "Zohran Mamdani, the Democrat mayoral candidate for New York, has caught the fancy of many around the world. Yet when we take a closer look at him, the 33-year-old does not appear so wonderful. If Mamdani isn’t a fraud, he’s certainly one of the most dangerous…",
    "link": "https://www.fairobserver.com/politics/zohran-mamdani-hypocrisy-socialism-and-the-danger-of-elitist-politics/",
    "timestamp": "2025-07-06T12:48:26Z"
  },
  {
    "title": "Elon Musk's New Party: Who Has Declared Interest?",
    "description": "Some political figures have spoken positively about the billionaire's proposed new political party.",
    "link": "https://www.newsweek.com/elon-musk-new-political-party-2095098",
    "timestamp": "2025-07-06T12:47:28Z"
  },
  {
    "title": "‘Big’ legislative package shifts more of SNAP’s costs to states, saving federal dollars but causing fewer Americans to get help paying for food",
    "description": "Work requirements will expand and exemptions from them will recede. How much states have to pay will be tied to the prevalence of mistakes, not fraud.",
    "link": "https://theconversation.com/big-legislative-package-shifts-more-of-snaps-costs-to-states-saving-federal-dollars-but-causing-fewer-americans-to-get-help-paying-for-food-260166",
    "timestamp": "2025-07-06T12:39:55Z"
  },
  {
    "title": "Inside Trump's supercharged version of Bush's \"War on Terror\"",
    "description": "Mass surveillance. Pre-emptive military strikes in the Middle East. Shipping people to domestic and foreign prisons. Citing national security to hide information from the courts. Labeling people as \"terrorists\" as a political and legal strategy. \nWhy it matte…",
    "link": "https://biztoc.com/x/44fc7dc73c08f056",
    "timestamp": "2025-07-06T12:37:31Z"
  },
  {
    "title": "Fighter Jets Intercept Planes Breaching Trump No Fly Zone",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFive aircraft breached restricted airspace over New Jersey on Saturday, the U.S. military said, as President Donald Trump spent the weekend in Bedminster.\nWhy It Matters\nThe U.S. military polices the airspace …",
    "link": "https://biztoc.com/x/e021bcbef4e76f41",
    "timestamp": "2025-07-06T12:37:12Z"
  },
  {
    "title": "Fighter Jets Intercept Planes Breaching Trump No Fly Zone",
    "description": "A fighter jet carried out what is known as a \"headbutt maneuver\" to get the attention of one particular civilian pilot, the U.S. military said.",
    "link": "https://www.newsweek.com/figther-ets-donald-trump-bedminster-intercept-f16-2095094",
    "timestamp": "2025-07-06T12:34:45Z"
  },
  {
    "title": "Elon Musk Announces New ‘America’ Political Party",
    "description": "The rift between President Donald Trump and his one-time ally Elon Musk is growing with the richest person in the world saying he will create a new political party in response to the passing of Trump’s massive tax and spending bill. Musk says the new politica…",
    "link": "https://www.today.com/video/elon-musk-announces-new-america-political-party-242755141905",
    "timestamp": "2025-07-06T12:33:54Z"
  },
  {
    "title": "Why Greenland is more important to the US than ever",
    "description": "Wittingly or unwittingly, United Airlines gave Donald Trump a birthday present that more than made up for the lackluster army parade put on by Pete Hegseth. On June 14, the day Trump turned 79, the US carrier launched its inaugural flight from Newark to Nuuk,…",
    "link": "https://nypost.com/2025/07/06/world-news/why-greenland-is-more-important-to-the-us-than-ever/",
    "timestamp": "2025-07-06T12:30:00Z"
  },
  {
    "title": "What’s in Trump’s ceasefire proposal and can it end Israel’s war on Gaza?",
    "description": "Discussions over a ceasefire are intensifying as Israel kills more Palestinians, sowing doubts that a deal can happen.",
    "link": "https://www.aljazeera.com/features/2025/7/6/whats-in-trumps-ceasefire-proposal-and-can-it-end-israels-war-on-gaza",
    "timestamp": "2025-07-06T12:29:03Z"
  },
  {
    "title": "Crayola’s now-CEO leaned in to automation when everyone else was offshoring and now he’s reaping the rewards",
    "description": "America’s top producer of children’s art supplies still creates most of its products in the northeastern U.S. But while that keeps it mostly insulated from tariffs, getting there wasn’t an easy process.",
    "link": "https://fortune.com/2025/07/06/crayola-ceo-automation-rewards/",
    "timestamp": "2025-07-06T12:26:00Z"
  },
  {
    "title": "European Auto Investors May Be Underestimating Trump Tariff Threat",
    "description": "European investors appear calm ahead of the deadline on U.S. auto tariff talks. They should remember Trump’s concern over unfair EU tactics which might inhibit a deal.",
    "link": "https://www.forbes.com/sites/neilwinton/2025/07/06/european-auto-investors-may-be-underestimating-trump-tariff-threat/",
    "timestamp": "2025-07-06T12:22:28Z"
  },
  {
    "title": "Trump can’t give up the fight against foreign meddling in US tech",
    "description": "Kudos to President Trump for getting Canada to kill a blatantly unfair tax on US-based companies, but the fight against foreign meddling in America's tech industry is just beginning.",
    "link": "https://nypost.com/2025/07/06/opinion/trump-cant-give-up-the-fight-against-foreign-meddling-in-us-tech/",
    "timestamp": "2025-07-06T12:19:04Z"
  },
  {
    "title": "'What The F...': Dem Governor Is at Complete Loss for Words After Being Asked About Cocaine Use",
    "description": "The governor was investigated for alleged cocaine use in 1990 by state and federal agencies, but no charges were ever filed.",
    "link": "https://www.westernjournal.com/f-dem-governor-complete-loss-words-asked-cocaine-use/",
    "timestamp": "2025-07-06T12:11:39Z"
  },
  {
    "title": "Social Security Email Causes Anger: 'Blatant Political Statement'",
    "description": "The email has raised questions about partisanship at the SSA, which distributes benefits to tens of millions of Americans every month.",
    "link": "https://www.newsweek.com/social-security-email-anger-blatant-political-statement-2095089",
    "timestamp": "2025-07-06T12:08:06Z"
  },
  {
    "title": "'Totally blindsided' Trump-supporting family furious over mom's ICE detainment",
    "description": "The husband of a Canadian national who has been living in the U.S. since she was a child is furious with Donald Trump's administration for arresting his wife on immigration charges while admitting he voted for the current president because he \"wanted change.\"…",
    "link": "https://www.rawstory.com/trump-ice-deportation/",
    "timestamp": "2025-07-06T12:04:14Z"
  },
  {
    "title": "Hamas' Revisions to Truce Deal With Israel Unacceptable - Netanyahu's Adviser",
    "description": "MOSCOW (Sputnik) - Israeli authorities have called changes proposed by Palestinian movement Hamas for a truce deal in the Gaza Strip unacceptable, Israeli Prime Minister Benjamin Netanyahu's adviser Dmitri Gendelman has said.",
    "link": "https://sputnikglobe.com/20250706/hamas-revisions-to-truce-deal-with-israel-unacceptable---netanyahus-adviser-1122400054.html",
    "timestamp": "2025-07-06T12:02:16Z"
  },
  {
    "title": "How politics seized on Boulder’s Pearl Street Mall attack",
    "description": "The antisemitic Pearl Street Mall attack on June 1 led to intense heartache for Colorado's Jewish community. They also watched as politicians and political groups jumped on an opportunity.",
    "link": "https://www.denverpost.com/2025/07/06/politics-boulder-pearl-street-mall-attack/",
    "timestamp": "2025-07-06T12:00:53Z"
  },
  {
    "title": "Has Trump era made immigrants’ lives more difficult? Longtime Coloradans and more recent arrivals weigh in",
    "description": "With immigration front and center in American politics, even immigrants and refugees who are directly affected hold differing opinions about societal tensions and actions targeting their communities.",
    "link": "https://www.denverpost.com/2025/07/06/colorado-immigrants-refugees-trump-administration-discrimination/",
    "timestamp": "2025-07-06T12:00:31Z"
  },
  {
    "title": "Xcel needs new air permit for Pueblo’s Comanche station even as it plans to shutter the coal-fired plant",
    "description": "Colorado's utility companies have been planning for nearly two decades to shutter their coal-burning power plants and transition to cleaner alternatives.",
    "link": "https://www.denverpost.com/2025/07/06/xcel-comanche-coal-station-pollution-permit/",
    "timestamp": "2025-07-06T12:00:17Z"
  },
  {
    "title": "Iran still wants a nuclear weapon despite ‘serious damage’ from US, Israeli strikes: expert warns",
    "description": "Iran remains 'obsessed' with building nuclear deterrent despite damage incurred from U.S. strikes last month, but suggests its still open to negotiation in a move that one expert warns is a ploy to buy time.",
    "link": "https://www.foxnews.com/politics/iran-still-wants-nuclear-weapon-despite-serious-damage-from-us-israeli-strikes",
    "timestamp": "2025-07-06T12:00:11Z"
  },
  {
    "title": "The ruthless reformer reinventing Saudi Arabia",
    "description": "If you want to understand the new Saudi Arabia, don’t start with oil. Start with a video game. The 39-year-old crown prince and prime minister of Saudi Arabia, Mohammed bin Salman — better known as MBS — grew up obsessed with video games, and he continues to …",
    "link": "https://nypost.com/2025/07/06/world-news/the-ruthless-reformer-reinventing-saudi-arabia/",
    "timestamp": "2025-07-06T12:00:00Z"
  },
  {
    "title": "The High Art of Pro Wrestling",
    "description": "Yes, it’s fiction. So is Moby-Dick.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/08/wrestling-say-hello-to-the-bad-guys-review/683259/",
    "timestamp": "2025-07-06T12:00:00Z"
  },
  {
    "title": "WHO pitches health tax on sugar; Dating apps are downsizing: CBC's Marketplace cheat sheet",
    "description": "CBC's Marketplace rounds up the consumer and health news you need from the week.",
    "link": "https://www.cbc.ca/news/business/marketplace-cheat-sheet-july-6-1.7577198",
    "timestamp": "2025-07-06T12:00:00Z"
  },
  {
    "title": "Increased Use of Paper Ballots, Electronic Poll Books Could Boost Election Security",
    "description": "A significant shift toward paper ballots and paper records of electronic votes to more easily audit election results, as well as electronic methods to verify registered... Read More\nThe post Increased Use of Paper Ballots, Electronic Poll Books Could Boost El…",
    "link": "https://www.dailysignal.com/2025/07/06/increased-use-paper-ballots-electronic-poll-books-could-boost-election-security/",
    "timestamp": "2025-07-06T12:00:00Z"
  },
  {
    "title": "Trump’s Only-Okay Economy",
    "description": "He hasn’t crashed it, but he hasn’t made it great either. That’s a problem.",
    "link": "https://www.theatlantic.com/economy/archive/2025/07/trumps-only-okay-economy/683421/",
    "timestamp": "2025-07-06T12:00:00Z"
  },
  {
    "title": "27 GIRLS STILL MISSING",
    "description": "AT least 51 people including children have been killed in the Texas floods – with 27 young girls still missing from their summer camp. Rescuers are still scouring the devastated landscape in …",
    "link": "https://www.the-sun.com/news/14637855/texas-flood-death-toll-climbs-children-camp-mystic/",
    "timestamp": "2025-07-06T11:55:36Z"
  },
  {
    "title": "Trump in the Crosshairs — REVIEW: 'Butler: The Untold Story of the Near Assassination ... (David J. Garrow/The Washington Free ...)",
    "description": "David J. Garrow / The Washington Free Beacon:\nTrump in the Crosshairs  —  REVIEW: 'Butler: The Untold Story of the Near Assassination of Donald Trump and the Fight for America's Heartland' by Salena Zito  —  As an enterprising and hard-working journalist, Sal…",
    "link": "https://www.memeorandum.com/250706/p6",
    "timestamp": "2025-07-06T11:55:01Z"
  },
  {
    "title": "Israeli air strikes kill 33 Palestinians in Gaza as Netanyahu prepares to fly to Washington",
    "description": "The Israeli military said it had struck 130 targets across the Gaza Strip in the last 24 hours.",
    "link": "https://www.thejournal.ie/israeli-air-strikes-netanyahu-washington-6754817-Jul2025/",
    "timestamp": "2025-07-06T11:49:16Z"
  },
  {
    "title": "Gaza ceasefire talks set to resume as Trump to push Netanyahu",
    "description": "Indirect negotiations between Israel and Hamas are set to resume on July 6 in Doha for a Gaza truce and hostage release deal, ahead of a visit by Prime Minister Benjamin Netanyahu to the White House.",
    "link": "https://www.hurriyetdailynews.com/gaza-ceasefire-talks-set-to-resume-as-trump-to-push-netanyahu-211147",
    "timestamp": "2025-07-06T11:45:55Z"
  },
  {
    "title": "Trump, GOP target ballots arriving after Election Day that feed conspiracy fears",
    "description": "President Donald Trump and other Republicans have long criticized states that take weeks to count their ballots after Election Day",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-gop-target-ballots-arriving-after-election-day-123513633",
    "timestamp": "2025-07-06T11:40:16Z"
  },
  {
    "title": "The Psychology of Resistance",
    "description": "In my last article, I detailed how U.S. President Donald Trump misunderstands the fundamental truth about human nature. He projects his own transactional worldview onto all of us, imagining that we're all determined to step on others to rise. I pointed out th…",
    "link": "https://www.commondreams.org/opinion/psychology-of-resistance",
    "timestamp": "2025-07-06T11:31:01Z"
  },
  {
    "title": "Elon Musk Launches ‘America Party’ to ‘Give Back Freedom’",
    "description": "Elon Musk Launches ‘America Party’ to ‘Give Back Freedom’mashable.com",
    "link": "https://in.mashable.com/tech/96679/elon-musk-launches-america-party-to-give-back-freedom",
    "timestamp": "2025-07-06T11:27:16Z"
  },
  {
    "title": "Putin touts historic ‘very friendly’ Russia-US ties",
    "description": "The president noted that Russia once backed US independence from the UK and supported the Union in the Civil War Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621069-putin-touts-historic-friendly-us-ties/",
    "timestamp": "2025-07-06T11:24:12Z"
  },
  {
    "title": "How Trump's tariffs will raise home construction costs",
    "description": "NBC News found tariffs could add $4,000 or more to the cost of a 3-bed home. See how Trump’s plan may affect U.S. housing affordability.",
    "link": "https://nbcnews.com/specials/house-construction-cost-tariff-change",
    "timestamp": "2025-07-06T11:16:32Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up the world's largest 2-way trade relationship",
    "description": "America’s largest trade partner is awaiting word on whether U.S. President Donald Trump will impose punishing tariffs on its goods.",
    "link": "https://www.wsls.com/business/2025/07/06/us-tariffs-on-european-goods-threaten-to-shake-up-the-worlds-largest-2-way-trade-relationship/",
    "timestamp": "2025-07-06T11:12:19Z"
  },
  {
    "title": "FN America To Deliver M240Ls To US Army | Finland Withdraws From Anti-Personal Mines Ban | Japan Gets Remus 300s",
    "description": "Americas Lockheed Martin won a $28.6 million cost-plus-incentive-fee and cost-plus-fixed-fee modification for the extension of integrated logistics support, combat system engineering, and ship integration and test, and in-country integrated test team supports…",
    "link": "https://www.defenseindustrydaily.com/fn-americas-to-deliver-m240ls-to-us-army-finland-withdraws-from-anti-personal-mines-ban-japan-gets-remus-300s-0243140/",
    "timestamp": "2025-07-06T11:05:10Z"
  },
  {
    "title": "Tiger Woods Rumors: The PGA Tour Legend Wedding on Horizon with Vanessa Trump",
    "description": "Tiger Woods and Vanessa Trump are reportedly moving quickly toward the next stages of their relationship, with even talks of wedding plans.",
    "link": "https://www.newsweek.com/sports/golf/tiger-woods-rumors-pga-tour-legend-wedding-horizon-vanessa-trump-2095088",
    "timestamp": "2025-07-06T11:00:01Z"
  },
  {
    "title": "A Writer Who Slows Down the Speed-Reader",
    "description": "Culture and entertainment musts from Ashley Parker",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/a-writer-who-slows-down-the-speed-reader/683424/",
    "timestamp": "2025-07-06T11:00:00Z"
  },
  {
    "title": "Links 7/6/2025",
    "description": "Our strategic daily links: Doodling, shrinking glaciers, Chinese words, tariffic situation, Gaza horrors, Ukraine burning, vanishing privacy, imperial collapse, Trumpishness, Musk world, Dems in distress, immigration troubles, Mr. market, AI, and wretched exc…",
    "link": "https://www.nakedcapitalism.com/2025/07/links-7-6-2025.html",
    "timestamp": "2025-07-06T10:55:28Z"
  },
  {
    "title": "Iran’s supreme leader makes first public appearance since Iran-Israel war started",
    "description": "Iran’s Supreme Leader Ayatollah Ali Khamenei on Saturday made his first public appearance since the 12-day war between Israel and Iran began, attending a mourning ceremony on the eve of Ashoura",
    "link": "https://www.nbcnews.com/world/iran/irans-supreme-leader-makes-first-public-appearance-iran-israel-war-sta-rcna217097",
    "timestamp": "2025-07-06T10:54:00Z"
  },
  {
    "title": "Alligator Alcatraz: American history from the dark side",
    "description": "Yeah, it's a concentration camp. It's also a meme, a troll and an especially ugly distillation of American history",
    "link": "https://www.salon.com/2025/07/06/alligator-alcatraz-american-history-from-the-dark-side/",
    "timestamp": "2025-07-06T10:45:56Z"
  },
  {
    "title": "‘Nothing Stops This Train’—$37 Trillion ‘Emergency’ Behind Tesla CEO Elon Musk’s ‘America Party’ Primes A Bitcoin Price Bombshell",
    "description": "Elon Musk has announced he’s starting his own political party called the “America Party,\" while dropping hints he’s still backing bitcoin...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/06/nothing-stops-this-train-37-trillion-emergency-behind-tesla-ceo-elon-musks-america-party-primes-a-bitcoin-price-bombshell/",
    "timestamp": "2025-07-06T10:45:14Z"
  },
  {
    "title": "India says trade pact with US should give preference to labour-intensive items like textiles and leather",
    "description": "Ball is in US court: Needs to respect sensitivities, support some sector to increase competitiveness, say sources",
    "link": "https://www.thehindubusinessline.com/economy/india-says-trade-pact-with-us-should-give-preference-labour-intensive-items-like-textiles-and-leather/article69779695.ece",
    "timestamp": "2025-07-06T10:39:55Z"
  },
  {
    "title": "Gaza Truce Talks To Resume In Doha Before Netanyahu Heads To US",
    "description": "Indirect negotiations between Israel and Hamas are set to resume Sunday in Doha for a Gaza truce and hostage release deal, ahead of a visit by Prime Minister Benjamin Netanyahu to the White House.",
    "link": "https://www.ibtimes.com.au/gaza-truce-talks-resume-doha-before-netanyahu-heads-us-1859561",
    "timestamp": "2025-07-06T10:36:16Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up trade relationship",
    "description": "America’s largest trade partner is awaiting word on whether U.S. President Donald Trump will impose punishing tariffs on its goods",
    "link": "https://biztoc.com/x/a114b35307091dd7",
    "timestamp": "2025-07-06T10:35:16Z"
  },
  {
    "title": "Ceasefire talks to begin in Doha as 33 killed in Gaza",
    "description": "International mediators seeking to secure a ceasefire deal to end the Israel-Hamas war in Gaza have informed the Palestinian group that negotiations would resume today, while officials in the embattled enclave say 33 Palestinians have died in the latest Israe…",
    "link": "https://www.rte.ie/news/middle-east/2025/0706/1522095-gaza-ceasefire-deal-talks/",
    "timestamp": "2025-07-06T10:31:50Z"
  },
  {
    "title": "How Trump’s policies are reshaping immigration enforcement in Puerto Rico",
    "description": "Residents have decried the \"aggressiveness\" of immigration raids in a U.S. territory without permanent detention centers and immigrants are flown across the ocean to the mainland.",
    "link": "https://www.nbcnews.com/news/latino/immigration-raids-ice-puerto-rico-trump-dominicans-rcna216080",
    "timestamp": "2025-07-06T10:30:00Z"
  },
  {
    "title": "Where does Australia stand if WWIII begins?",
    "description": "Experts have warned our military alliances with the US could draw us into World War III.",
    "link": "https://7news.com.au/news/where-does-australia-stand-if-wwiii-begins-c-19219976",
    "timestamp": "2025-07-06T10:25:58Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up trade relationship",
    "description": "America’s largest trade partner is awaiting word on whether U.S. President Donald Trump will impose punishing tariffs on its goods",
    "link": "https://abcnews.go.com/Business/wireStory/us-tariffs-european-goods-threaten-shake-worlds-largest-123513444",
    "timestamp": "2025-07-06T10:21:39Z"
  },
  {
    "title": "Trump Insider Says Tariff Deadline Is ‘Fake’",
    "description": "“The White House has little to show as President Donald Trump’s self-imposed deadline to reach trade deals with dozens of countries arrives in four days. Trump bragged he would rapidly secure dozens of trade deals,",
    "link": "https://politicalwire.com/2025/07/06/trump-insider-says-tariff-deadline-is-fake/",
    "timestamp": "2025-07-06T10:18:33Z"
  },
  {
    "title": "Tucker Carlson Previews Interview With Iran's President",
    "description": "\"Can you believe everything you hear from the president of Iran? Probably not,\" the former Fox News host said on Saturday.",
    "link": "https://www.newsweek.com/tucker-carlson-iranian-president-interview-masoud-pezeshkian-2095085",
    "timestamp": "2025-07-06T10:18:12Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up the world's largest 2-way trade relationship",
    "description": "The U.S. and EU are in trade talks as President Trump considers imposing tariffs on European goods, potentially raising prices for U.S. consumers. The EU is prepared to retaliate with tariffs on American products if a deal isn't reached.",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-tariffs-on-european-goods-threaten-to-shake-up-the-worlds-largest-2-way-trade-relationship/articleshow/122279188.cms",
    "timestamp": "2025-07-06T10:17:50Z"
  },
  {
    "title": "Israeli airstrikes kill 33 Palestinians in Gaza",
    "description": "Israeli airstrikes in Gaza resulted in at least 33 Palestinian deaths, as Israel targeted over 100 locations. These strikes occurred as Prime Minister Netanyahu prepared for Washington talks to advance ceasefire efforts, while Israel's security Cabinet approv…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-airstrikes-kill-33-palestinians-in-gaza/articleshow/122279174.cms",
    "timestamp": "2025-07-06T10:17:08Z"
  },
  {
    "title": "The electric Slate truck just got $7,500 more expensive",
    "description": "Slate Auto’s upcoming modular electric truck was initially marketed as under $20,000. However, the federal Big Beautiful Bill, signaling the end of the EV tax incentive, has now made it $7,500 more expensive.",
    "link": "https://www.notebookcheck.net/The-electric-Slate-truck-just-got-7-500-more-expensive.1052470.0.html",
    "timestamp": "2025-07-06T10:17:00Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up the world’s largest 2-way trade relationship",
    "description": "FRANKFURT, Germany (AP) — America’s largest trade partner, the European Union, is among the entities awaiting word Monday on whether U.S. President Donald Trump will impose punishing tariffs on their goods, a move economists have warned would have repercussio…",
    "link": "https://financialpost.com/pmn/us-tariffs-on-european-goods-threaten-to-shake-up-the-worlds-largest-2-way-trade-relationship",
    "timestamp": "2025-07-06T10:07:17Z"
  },
  {
    "title": "US tariffs on European goods threaten to shake up the world's largest 2-way trade relationship",
    "description": "America’s largest trade partner, the European Union, is among the entities awaiting word Monday on whether U.S. President Donald Trump will impose punishing ...",
    "link": "https://finance.yahoo.com/news/us-tariffs-european-goods-threaten-100150379.html",
    "timestamp": "2025-07-06T10:01:50Z"
  },
  {
    "title": "We Asked Trump’s Former Prisons Chief How $45 Billion Will Reshape Immigrant Detention",
    "description": "The massive piece of legislation to which President Donald Trump has just attached his legacy allocates $170 billion for immigration and border enforcement over the next four years—including $45 billion to expand the detention of immigrants to fulfill his cam…",
    "link": "https://www.motherjones.com/politics/2025/07/prison-officials-talk-about-trump-budget-spending-ice-enforcement-immigrant-detention-expansion-aligator-alcatraz-deportations/",
    "timestamp": "2025-07-06T10:00:00Z"
  },
  {
    "title": "Why Evangelicals Turned Their Back on PEPFAR",
    "description": "A religious movement that has so often taken public stands has been unusually quiet since Trump gutted the program to combat AIDS in Africa.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/pepfar-evangelical/683418/",
    "timestamp": "2025-07-06T10:00:00Z"
  },
  {
    "title": "Bunker-busting bunkum: events, conspiracies and the inversion of truth",
    "description": "Originally published by Unity News Network ‘Events, dear boy, events’. So said British prime minister Harold Macmillan on the fallibility of leaders due to unanticipated, uncontrollable factors. ‘Shit happens’, to use a slang version.  But what if events are …",
    "link": "https://www.activistpost.com/bunker-busting-bunkum-events-conspiracies-and-the-inversion-of-truth/",
    "timestamp": "2025-07-06T10:00:00Z"
  },
  {
    "title": "This Los Angeles Detention center could be coming to a city near you",
    "description": "There’s a basement about a fifteen-minute walk from where I live.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/los-angeles-ice-immigration-detention-center-rcna216884",
    "timestamp": "2025-07-06T10:00:00Z"
  },
  {
    "title": "Idaho bans ‘Everyone Is Welcome Here’ classroom signs, calling them ideological",
    "description": "After controversy over teacher Sarah Inama’s “Everyone is welcome here’ sign, Chris Hayes explains Idaho’s new law banning ‘ideological’ posters from classrooms.",
    "link": "https://www.msnbc.com/top-stories/latest/idaho-republicans-ban-poster-classroom-rcna216773",
    "timestamp": "2025-07-06T10:00:00Z"
  },
  {
    "title": "Ukraine President says he had 'fruitful' phone call on air defence systems with Trump",
    "description": "President Zelenskyy reported a productive call with US President Trump, securing an agreement to increase joint drone efforts and expressing gratitude for US assistance, particularly Patriot systems for defense against ballistic threats. Meanwhile, Ukraine cl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ukraine-president-says-he-had-fruitful-phone-call-on-air-defence-systems-with-trump/articleshow/122278985.cms",
    "timestamp": "2025-07-06T09:57:32Z"
  },
  {
    "title": "The Trial of Ayla King : The First of the Stop Cop City RICO Cases Goes to Trial",
    "description": "On July 7, 2025, Ayla King will become the first of the Stop Cop City defendants absurdly charged with violating the RICO Act to go to trial.",
    "link": "https://crimethinc.com/2025/07/06/the-trial-of-ayla-king-the-first-of-the-stop-cop-city-rico-cases-goes-to-trial",
    "timestamp": "2025-07-06T09:46:47Z"
  },
  {
    "title": "Palestinian Sheikhs in Hebron Ask Israel for Separate Emirates, Not State",
    "description": "A group of Palestinian sheikhs in the holy city of Hebron has written to the Israeli government formally asking to be given sovereignty over the area as an emirate, and not as part of a larger Palestinian state.\nThe post Palestinian Sheikhs in Hebron Ask Isra…",
    "link": "https://www.breitbart.com/middle-east/2025/07/06/palestinian-sheikhs-in-hebron-ask-israel-for-separate-emirates-not-state/",
    "timestamp": "2025-07-06T09:39:00Z"
  },
  {
    "title": "Israel says Hamas’ changes to Gaza ceasefire deal ‘unacceptable’",
    "description": "Israel has rejected Hamas’ proposed Gaza ceasefire changes but agreed to continue talks in Qatar, the prime minister’s office has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621060-israel-hamas-changes-unacceptable/",
    "timestamp": "2025-07-06T09:32:16Z"
  },
  {
    "title": "Search for missing continues as Texas floods claim 51 lives",
    "description": "TEXAS: Rescue operations are underway in central Texas as authorities search for missing individuals following devastating flash floods that have claimed 51 lives, including 15 children. Kerr County has been hit the hardest, reporting 43 deaths and 27 missing…",
    "link": "https://english.khabarhub.com/2025/06/483802/",
    "timestamp": "2025-07-06T09:29:00Z"
  },
  {
    "title": "'Into a void': Young US college graduates face employment crisis",
    "description": "Over two years, Rebecca Atkins filed more than 250 job applications, and felt like every one was going into a gaping chasm—one opened by the highest unemployment rate for recent college graduates in the United States in more than a decade.",
    "link": "https://phys.org/news/2025-07-void-young-college-employment-crisis.html",
    "timestamp": "2025-07-06T09:28:53Z"
  }
]