[
  {
    "title": "Trump Says Coca-Cola to Replace Corn Syrup With Cane Sugar in U.S. Products Following Push Under MAHA Health Initiative",
    "description": "Trump Says Coca-Cola to Replace Corn Syrup With Cane Sugar in U.S. Products Following Push Under MAHA Health Initiativeviconsortium.com",
    "link": "https://viconsortium.com/vi-health/virgin-islands-trump-says-coca-cola-to-replace-corn-syrup-with-cane-sugar-in-u-s--products-following-push-under-maha-health-initiative",
    "timestamp": "2025-07-17T14:23:45Z"
  },
  {
    "title": "Wall Street steady again after President Donald Trump downplays threat to Fed Chair Jerome Powell’s job",
    "description": "Wall Street appears calm after President Donald Trump walked back his earlier threats to fire Federal Reserve Chair Jerome Powell.\nFutures for the S&P 500 were unchanged before the opening bell Thursday, while futures for the Dow Jones Industrial Average lost…",
    "link": "https://biztoc.com/x/3e393cc9735042e6",
    "timestamp": "2025-07-17T14:22:22Z"
  },
  {
    "title": "What Happens If Trump Fires Fed Chair Jerome Powell?",
    "description": "Donald Trump’s relentless pressure on Jerome Powell is once again roiling markets and raising questions about what would happen next if the president fired the embattled Federal Reserve chair.\nSuch a move would be a first in US history and would almost certai…",
    "link": "https://biztoc.com/x/8baa60a14df5754f",
    "timestamp": "2025-07-17T14:22:13Z"
  },
  {
    "title": "You Won’t Believe Why Trump Suddenly Wants FBI to Investigate Epstein",
    "description": "The Trump administration is looking to use more federal funds to repeat its investigation into Jeffrey Epstein’s pedophilic sex trafficking ring—but only to prove Donald Trump’s theory that the scandal is a “hoax.”Speaking with the far-right network Real Amer…",
    "link": "https://newrepublic.com/post/198060/donald-trump-suddenly-wants-fbi-investigate-epstein",
    "timestamp": "2025-07-17T14:21:08Z"
  },
  {
    "title": "Panicked Trump Rushes to Create a Distraction From Epstein Files",
    "description": "Donald Trump is desperate for anything to distract the angry mob seeking answers on alleged sex trafficker Jeffrey Epstein. Now, he’s hoping to toss them some dirt on Hillary Clinton—too bad nobody cares about that. During an appearance Wednesday on Real Amer…",
    "link": "https://newrepublic.com/post/198057/donald-trump-create-distraction-epstein-files",
    "timestamp": "2025-07-17T14:20:55Z"
  },
  {
    "title": "Justice Department fires Epstein and Diddy prosecutor Maurene Comey",
    "description": "There was no specific reason given for her firing from the U.S. attorney's office in the Southern District of New York, according to one of the people.",
    "link": "https://www.pbs.org/newshour/politics/justice-department-fires-epstein-and-diddy-prosecutor-maura-comey",
    "timestamp": "2025-07-17T14:20:15Z"
  },
  {
    "title": "NPR head asks critics to 'show me a story' that proves liberal bias amid defunding threats",
    "description": "NPR CEO Katherine Maher challenged critics to show her a story that would prove the radio network is biased on Wednesday. Maher defended her organization on CNN's \"The Situation Room\" as it faces efforts by President Donald Trump and congressional Republicans…",
    "link": "https://freerepublic.com/focus/f-news/4329168/posts",
    "timestamp": "2025-07-17T14:20:11Z"
  },
  {
    "title": "These families are most at risk of losing HUD housing due to Trump’s proposed time limits",
    "description": "More than 1 million low-income households — most of them working families with children — who depend on the nation’s public housing and Section 8 voucher programs could be at risk of losing their government-subsidized homes under the Trump administration’s pr…",
    "link": "https://nypost.com/2025/07/17/us-news/these-families-are-most-at-risk-of-losing-hud-housing-due-to-trump/",
    "timestamp": "2025-07-17T14:18:43Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.12onyourside.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:16:31Z"
  },
  {
    "title": "US government forced to return $6.2 million in funding to LGBTQ+ and HIV groups",
    "description": "The US government has been made to restore millions of dollars in funding for LGBTQ+ and HIV groups following a court ruling. Over $6.2 million in federal grant funding has been returned to nine organisations that support LGBTQ+ people and those living with H…",
    "link": "https://www.thepinknews.com/2025/07/17/us-government-lgbtq-funding-hiv-groups/",
    "timestamp": "2025-07-17T14:15:54Z"
  },
  {
    "title": "How Nvidia's Jensen Huang persuaded Trump to sell AI chips to China",
    "description": "Nvidia CEO Jensen Huang, once apolitical, emerged as a key geopolitical player after US restrictions threatened chip sales to China. Lobbying Trump and navigating Washington, he helped reverse the ban, reopening Nvidia’s access to China. His efforts underscor…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/how-nvidias-jensen-huang-persuaded-trump-to-sell-ai-chips-to-china/articleshow/122647212.cms",
    "timestamp": "2025-07-17T14:15:50Z"
  },
  {
    "title": "US applications for jobless benefits fall for fifth straight week, hitting lowest level since April",
    "description": "The number of Americans filing for unemployment benefits fell last week to the lowest level in three months, a sign that the U.S. labor market remains sturdy despite fears over the impact of widespread U.S. tariffs.",
    "link": "https://www.local10.com/business/2025/07/17/fewer-americans-file-for-jobless-benefits-last-week-as-layoffs-remain-at-historically-healthy-levels/",
    "timestamp": "2025-07-17T14:15:28Z"
  },
  {
    "title": "BlackRock goes big on crypto — adds $916 million in Bitcoin and Ethereum in just 16 days",
    "description": "In July 2025, BlackRock significantly increased its crypto portfolio, investing $916 million in Bitcoin and Ethereum within 16 days. This move boosted their Bitcoin holdings to 3.6% of the total supply and expanded their Ethereum presence by 17%. The firm's o…",
    "link": "https://economictimes.indiatimes.com/news/international/us/blackrock-goes-big-on-crypto-adds-916-million-in-bitcoin-and-ethereum-in-just-16-days/articleshow/122645724.cms",
    "timestamp": "2025-07-17T14:15:24Z"
  },
  {
    "title": "Germany and UK sign historic post-Brexit friendship treaty",
    "description": "The UK and Germany have agreed a friendship treaty aimed at resetting the countries' post-Brexit relations. The treaty comes nearly a decade after Britain's vote to leave the European Union.",
    "link": "https://www.dw.com/en/germany-and-uk-sign-historic-post-brexit-friendship-treaty/a-73313982",
    "timestamp": "2025-07-17T14:15:00Z"
  },
  {
    "title": "It's Open Season On Fuel Economy",
    "description": "We're looking at our new Wild West for emissions regulation, as well as Volvo's scaled-back U.S. offerings.",
    "link": "https://www.jalopnik.com/1914755/open-season-on-fuel-economy/",
    "timestamp": "2025-07-17T14:14:59Z"
  },
  {
    "title": "A new mural in France shows the Statue of Liberty covering her eyes in a swipe at Trump",
    "description": "A towering mural in France of the Statue of Liberty covering her eyes is racking up millions of views online with its swipe at U.S. President Donald Trump’s immigration and deportation policies",
    "link": "https://abcnews.go.com/International/wireStory/new-mural-france-shows-statue-liberty-covering-eyes-123833165",
    "timestamp": "2025-07-17T14:14:31Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wtoc.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:13:37Z"
  },
  {
    "title": "Steve Scalise: Inside the Final Push to Pass Trump’s ‘Big, Beautiful Bill’",
    "description": "It was an incredibly hectic and high-stakes 48 hours as House leadership cobbled together the votes to send the One Big Beautiful Bill Act to... Read More\nThe post Steve Scalise: Inside the Final Push to Pass Trump’s ‘Big, Beautiful Bill’ appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/07/17/steve-scalise-inside-the-final-push-to-pass-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-17T14:13:17Z"
  },
  {
    "title": "Energy sanctions on Russia may hit US consumers",
    "description": "US President Donald Trump’s threat to impose new energy-related sanctions on Russia could backfire by hurting American electricity consumers.\nThe main target of sanctions legislation proposed by Sen. Lindsay Graham (R-S.C.) — which Trump said this week he cou…",
    "link": "https://biztoc.com/x/890601a5ee1021c7",
    "timestamp": "2025-07-17T14:11:26Z"
  },
  {
    "title": "'He's just mad': GOP leader pressures Mike Johnson as speaker faces 'brutal' day",
    "description": "A member of the House Republican leadership team is growing impatient with Speaker Mike Johnson (R-LA) for not wrapping up negotiations within his own caucus on the massive budget bill awaiting Donald Trump's signature.According to a report from Politico's Mi…",
    "link": "https://www.rawstory.com/mike-johnson-under-pressure/",
    "timestamp": "2025-07-17T14:11:17Z"
  },
  {
    "title": "The United States Must Reclaim Afghanistan to Protect Its Interests",
    "description": "When the Taliban seized power in Afghanistan in August 2021, the world watched in disbelief — and then, with troubling speed, looked away. Since then, Afghanistan has spiraled into a profound crisis characterized by political illegitimacy, resurging terrorism…",
    "link": "https://www.fairobserver.com/politics/the-united-states-must-reclaim-afghanistan-to-protect-its-interests/",
    "timestamp": "2025-07-17T14:09:01Z"
  },
  {
    "title": "Civil rights group declares 'state of emergency,' pointing at Trump admin",
    "description": "The National Urban League issued a report that takes aim at President Donald Trump's administration, suggesting the nation faces a \"state of emergency.\"",
    "link": "https://www.foxnews.com/politics/civil-rights-group-declares-state-emergency-pointing-trump-admin",
    "timestamp": "2025-07-17T14:08:58Z"
  },
  {
    "title": "Seth Meyers Debunks Trump’s ‘Full Hallucination’ About His Uncle and the Unabomber | Video",
    "description": "\"The whole thing we just heard wasn't just a small lie,\" the NBC host says\nThe post Seth Meyers Debunks Trump’s ‘Full Hallucination’ About His Uncle and the Unabomber | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-debunks-trump-story-uncle-unabomber/",
    "timestamp": "2025-07-17T14:08:52Z"
  },
  {
    "title": "Trump Says Coca-Cola Agrees to Use Cane Sugar for Coke in US",
    "description": "(Bloomberg) -- President Donald Trump said in a Truth Social post on Wednesday that Coca-Cola Co. has agreed to use cane sugar in Coke beverages sold in the ...",
    "link": "https://finance.yahoo.com/news/trump-says-coca-cola-agrees-224034681.html",
    "timestamp": "2025-07-17T14:08:37Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.wect.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:07:25Z"
  },
  {
    "title": "Donald Trump's 'significant' health issue addressed by doctor after worrying photo - NewsBreak",
    "description": "EXCLUSIVE: A health expert has suggested that Donald Trump's swollen ankles could be the sign of something major as speculation about his health continues",
    "link": "https://www.newsbreak.com/share/4111484021135-donald-trump-s-significant-health-issue-addressed-by-doctor-after-worrying-photo?_f=app_share&amp;pd=06OCpLws&amp;lang=en_US&amp;send_time=1752761014&amp;s=i16&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.28.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v4%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v3%2Cns_foryou_rank_exp_25q2-v2",
    "timestamp": "2025-07-17T14:06:38Z"
  },
  {
    "title": "China Reacts As Russia Floats New Geopolitical Power Bloc With India",
    "description": "Closer cooperation between the nuclear-armed neighbors could pose a challenge to U.S. influence",
    "link": "https://www.newsweek.com/russia-china-india-bloc-2100179",
    "timestamp": "2025-07-17T14:06:30Z"
  },
  {
    "title": "This gangster move is just Trump's latest disgrace",
    "description": "At least no one can accuse Donald Trump of hiding his agenda.When Mike Huckabee, his ambassador to Israel, showed up Wednesday at Prime Minister Benjamin (Bibi) Netanyahu’s corruption trial in Tel Aviv, he hadn’t come to schmooze or testify. He wasn’t distrib…",
    "link": "https://www.rawstory.com/raw-investigates/this-gangster-move-is-just-trump-s-latest-disgrace/",
    "timestamp": "2025-07-17T14:06:24Z"
  },
  {
    "title": "The Supreme Court Is Offering Up A Scary New Version Of America",
    "description": "And the conservative justices don’t think they owe you any answers at all.",
    "link": "https://www.huffpost.com/entry/supreme-court-trump-rulings_n_6878f5dee4b007ebff46ce4b",
    "timestamp": "2025-07-17T14:06:20Z"
  },
  {
    "title": "Shane Gillis’ Joke About Caitlin Clark at ESPYS Isn't Sitting Well With Some Fans",
    "description": "Shane Gillis' 2025 ESPYS monologue included a Caitlin Clark joke that drew a mixed reaction.",
    "link": "https://www.today.com/news/sports/shane-gillis-espys-monologue-caitlin-clark-joke-2025-rcna219289",
    "timestamp": "2025-07-17T14:06:12Z"
  },
  {
    "title": "Trump's voters want to see the Epstein files - but have faith in their president",
    "description": "Trump supporters have a new priority on their minds - the release of the so-called Jeffrey Epstein files.",
    "link": "https://www.bbc.com/news/articles/cy4y9k7vmwlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-17T14:04:36Z"
  },
  {
    "title": "Nationwide protests planned against Trump’s immigration crackdown and health care cuts",
    "description": "Protests and events against President Donald Trump's controversial policies, that include mass deportations and cuts to Medicaid.",
    "link": "https://www.westernmassnews.com/2025/07/17/nationwide-protests-planned-against-trumps-immigration-crackdown-health-care-cuts/",
    "timestamp": "2025-07-17T14:03:22Z"
  },
  {
    "title": "Gavin Newsom Furious After Trump 'Pulls the Plug' on His Pet Project",
    "description": "President Donald Trump says California's high-speed rail project has lost its federal cash, but Gov. Gavin Newsom says he will fight the cut.",
    "link": "https://www.westernjournal.com/gavin-newsom-furious-trump-pulls-plug-pet-project/",
    "timestamp": "2025-07-17T14:02:22Z"
  },
  {
    "title": "Trump Jr. rips 'communist' Mamdani with dire prediction about NYC if he wins mayoral race",
    "description": "Fox News Digital spoke to Donald Trump Jr. about the prospect of socialist mayoral candidate Zohran Mamdani becoming the next mayor of New York City.",
    "link": "https://www.foxnews.com/politics/trump-jr-rips-communist-mamdani-dire-prediction-about-nyc-if-he-wins-mayoral-race",
    "timestamp": "2025-07-17T14:00:53Z"
  },
  {
    "title": "The State Department Shuts Down Its Office Combating Human Trafficking",
    "description": "As President Donald Trump takes a beating from his own MAGA crowd for his handling of the case of Jeffrey Epstein, the deceased pedophile and sex trafficker, his State Department pulled a surprising move: It shut down its office combating human trafficking. A…",
    "link": "https://www.motherjones.com/politics/2025/07/human-trafficking-state-department-jeffrey-epstein/",
    "timestamp": "2025-07-17T14:00:20Z"
  },
  {
    "title": "Democratic Voters Who Skipped 2024 Election Want Candidates Like Bernie, AOC",
    "description": "New research suggests the prevailing wisdom in Washington — the idea that Democrats tacked too far to the left last year — might be wrong.",
    "link": "http://www.rollingstone.com/politics/politics-features/biden-harris-bernie-aoc-democrats-voters-skipped-2024-1235387827/",
    "timestamp": "2025-07-17T14:00:00Z"
  },
  {
    "title": "Trump Cryptocurrency Innovation Could Bring Homeownership to Millions",
    "description": "With sky-high interest rates and rising building costs, the American dream of home ownership is slipping further away for millions of Americans. However, an innovative... Read More\nThe post Trump Cryptocurrency Innovation Could Bring Homeownership to Millions…",
    "link": "https://www.dailysignal.com/2025/07/17/trump-cryptocurrency-innovation-could-bring-homeownership-to-millions/",
    "timestamp": "2025-07-17T14:00:00Z"
  },
  {
    "title": "Fentanyl terror: There's a Khalistan-China connection",
    "description": "A China link is emerging in the Khalistan plot to break India, with a focus on fentanyl, an opioid drug causing deaths in the US. The DEA busted an ISI-China-Canada drug cartel, arresting Opinder Singh Sian, who had ties with Chinese chemical suppliers and th…",
    "link": "https://economictimes.indiatimes.com/news/defence/fentanyl-terror-theres-a-khalistan-china-connection/articleshow/122644416.cms",
    "timestamp": "2025-07-17T13:56:12Z"
  },
  {
    "title": "Alberta premier faces criticism, anger at Edmonton panel town hall",
    "description": "After receiving a warm welcome and widespread support just 24 hours earlier, Alberta Premier Danielle Smith faced a more vocally critical and frustrated crowd as she and her hand-picked panel members assembled in Edmonton for the second of a series of summer …",
    "link": "https://www.cbc.ca/news/canada/edmonton/alta-next-panel-1.7587269",
    "timestamp": "2025-07-17T13:54:58Z"
  },
  {
    "title": "Colorado health insurers propose huge price increases for 2026",
    "description": "Colorado health insurance prices in the individual market are poised for a big increase following passage of the One Big Beautiful Bill Act.",
    "link": "http://coloradosun.com/2025/07/17/colorado-health-insurance-prices-one-big-beautiful-bill/",
    "timestamp": "2025-07-17T13:54:19Z"
  },
  {
    "title": "Good Trouble Protest: Full schedule of city-wise timings and key locations for the massive anti-Trump protest",
    "description": "As Americans gather in parks, on courthouse steps, and in public squares this Thursday, the ‘Good Trouble Lives On’ movement seeks to reignite a national conversation about the policies issued by the Trump administration.",
    "link": "https://economictimes.indiatimes.com/news/international/us/good-trouble-protest-location-time-where-is-the-anti-trump-protest-john-lewis-anniversary/articleshow/122644664.cms",
    "timestamp": "2025-07-17T13:54:13Z"
  },
  {
    "title": "'We asked and we asked': GOP 'stonewalled' on details of massive cuts",
    "description": "In the early hours of Thursday morning, Senate Republicans passed legislation that would claw back $9 billion in previously approved congressional funding for public broadcasting and foreign aid programs targeted by President Donald Trump's White House.The fi…",
    "link": "https://www.rawstory.com/we-asked-and-we-asked-gop-stonewalled-on-details-of-massive-cuts/",
    "timestamp": "2025-07-17T13:53:38Z"
  },
  {
    "title": "Just 17% Approve Of Trump’s Handling Of Epstein Files: Poll",
    "description": "Sixty percent of respondents to a Reuters/Ipsos poll said they believe the federal government is hiding information on Epstein’s death.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/17/just-17-approve-of-trumps-handling-of-epstein-files-poll/",
    "timestamp": "2025-07-17T13:52:54Z"
  },
  {
    "title": "Analysis-US companies adopt options strategies to shield euro revenues in case dollar recovers",
    "description": "NEW YORK (Reuters) -Some U.S. companies are taking advantage of more attractive pricing in euro options to protect the revenues they expect from Europe...",
    "link": "https://finance.yahoo.com/news/analysis-us-companies-adopt-options-135249320.html",
    "timestamp": "2025-07-17T13:52:49Z"
  },
  {
    "title": "Democrats hit rock bottom as American voters turn away in record numbers from liberal agenda: poll",
    "description": "Congressional approval ratings reveal Democrats at historic 19% low while Republicans at 33%, as President Trump's approval stands at 40% in latest Quinnipiac survey",
    "link": "https://www.foxnews.com/politics/democrats-hit-rock-bottom-american-voters-turn-away-record-numbers-from-liberal-agenda-poll",
    "timestamp": "2025-07-17T13:51:26Z"
  },
  {
    "title": "Coca-Cola Will Get More Expensive if it Changes to Cane Sugar. Here's Why",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Wednesday, President Donald Trump took to Truth Social to announce that Coca-Cola had agreed to use \"REAL Cane Sugar\" in its beverages produced in the U.S., adding that this \"will be a very good move by the…",
    "link": "https://biztoc.com/x/40ccc7ff57e9a73e",
    "timestamp": "2025-07-17T13:49:38Z"
  },
  {
    "title": "The online gunseller with Donald Trump Jr. on its board makes its market debut. Shares plunge",
    "description": "The online gunseller with Donald Trump Jr. on its board makes its market debut. Shares plunge\nThe online gunseller with Donald Trump Jr. on its board makes its market debut. Shares plunge\nWASHINGTON (AP) — Online firearms seller GrabAGun Digital Holdings, wit…",
    "link": "https://biztoc.com/x/876bfb6c7d9972cd",
    "timestamp": "2025-07-17T13:49:18Z"
  },
  {
    "title": "Donald Trump: The Boy Who Cried Hoax",
    "description": "So often when Donald Trump is cornered, he manages to escape thanks to a simple tactic: He cries hoax. With his latest troubles—caused by his administration’s declaration that there’s nothing new to see or investigate regarding deceased pedophile and sex-traf…",
    "link": "https://www.motherjones.com/politics/2025/07/trump-epstein-hoax-russia-ukraine-charlottesville/",
    "timestamp": "2025-07-17T13:48:10Z"
  },
  {
    "title": "GOP lawmaker puts Trump on notice that he may 'lose the majority this midterm'",
    "description": "Rep. Thomas Massie (R-KY) gave a stark warning to President Donald Trump Thursday that further inter-party attacks will likely see Republicans “lose the majority this midterm.”“Attacking republicans who lean independent or libertarian is how Republicans (Trum…",
    "link": "https://www.rawstory.com/thomas-massie-2673336495/",
    "timestamp": "2025-07-17T13:46:57Z"
  },
  {
    "title": "Voters on Daily Show Brutally Roast Elon Musk’s Political Party: ‘From His Own Loins, He’s Got a Few Supporters’",
    "description": "The Daily Show's Michael Kosta found voters were less than thrilled with Elon Musk's plans to launch his own political party after his falling out Trump.\nThe post Voters on Daily Show Brutally Roast Elon Musk’s Political Party: ‘From His Own Loins, He’s Got a…",
    "link": "https://www.mediaite.com/media/tv/voters-on-daily-show-brutally-roast-elon-musks-political-party-from-his-own-loins-hes-got-a-few-supporters/",
    "timestamp": "2025-07-17T13:46:56Z"
  },
  {
    "title": "Coca-Cola Will Get More Expensive if it Changes to Cane Sugar. Here's Why",
    "description": "Should the company make the switch from corn syrup to cane sugar, as Donald Trump has said, this could see prices of Coca-Cola in the U.S. skyrocket.",
    "link": "https://www.newsweek.com/coca-cola-cane-sugar-more-expensive-trump-2100169",
    "timestamp": "2025-07-17T13:46:20Z"
  },
  {
    "title": "Retail sales rebound in June after 2 straight months of declines",
    "description": "Retail sales rose 0.6% in June after declining 0.9% in May and 0.1% in April, pulled down by a steep drop in auto sales on tariff concerns.",
    "link": "https://fortune.com/2025/07/17/retail-sales-june-increase-0-6-percent-tariffs-inflation/",
    "timestamp": "2025-07-17T13:44:42Z"
  },
  {
    "title": "Trump Just Got Almost $100 Million Richer Thanks to His Meme Coin",
    "description": "President Trump’s meme coin, $TRUMP, just earned him close to $100 million more on paper. Another day, another dollar made off the presidency.",
    "link": "http://nymag.com/intelligencer/article/trump-nets-almost-usd100-million-thanks-to-usdtrump-meme-coin.html",
    "timestamp": "2025-07-17T13:43:30Z"
  },
  {
    "title": "Shane Gillis uses ESPYs monologue to take jab at Trump and make Epstein joke amid client list controversy",
    "description": "Controversial comedian returned to the stage as host of ESPN’s Excellence in Sports Performance Yearly Awards",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/shane-gillis-espys-trump-epstein-b2790879.html",
    "timestamp": "2025-07-17T13:43:15Z"
  },
  {
    "title": "John Fetterman's Approval Rating With Democrats Hits Record Low",
    "description": "A Morning Consult poll has found that John Fetterman's net approval rating among Democrats has fallen 33 points since the end of 2024.",
    "link": "https://www.newsweek.com/john-fetterman-approval-rating-hits-record-low-democrats-poll-2100094",
    "timestamp": "2025-07-17T13:43:11Z"
  },
  {
    "title": "WATCH LIVE: House expected to vote on cryptocurrency bill, cuts to public media and foreign aid",
    "description": "The legislation, which now moves to the House, would have a tiny impact on the nation’s rising debt but could have major ramifications for the Corporation for Public Broadcasting and U.S. food aid internationally.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-house-expected-to-vote-on-cryptocurrency-bill-cuts-to-public-media-and-foreign-aid",
    "timestamp": "2025-07-17T13:42:40Z"
  },
  {
    "title": "Fox News Hosts Pretend the Biggest MAGA Story — The ‘Epstein Hoax’ — Doesn’t Exist",
    "description": "Fox News' top hosts are ignoring the MAGA revolt over Epstein files—choosing loyalty to Trump over reporting a story their own audience wants answers on.\nThe post Fox News Hosts Pretend the Biggest MAGA Story — The ‘Epstein Hoax’ — Doesn’t Exist first appeare…",
    "link": "https://www.mediaite.com/opinion/fox-news-hosts-pretend-the-biggest-maga-story-the-epstein-hoax-doesnt-exist/",
    "timestamp": "2025-07-17T13:40:09Z"
  },
  {
    "title": "Melania’s blunt 4-word response to married Donald Trump for money claim resurfaces, and is going viral again",
    "description": "An old interview of Melania Tramp is trending again. In 1999, she addressed questions about marrying Donal Tramp for money. Melania strongly denied those claims. She said people who thought that did not know her. The couple got engaged in 2004 and married in …",
    "link": "https://economictimes.indiatimes.com/news/international/us/melanias-blunt-4-word-response-to-married-donald-trump-for-money-claim-resurfaces-and-is-going-viral-again/articleshow/122643414.cms",
    "timestamp": "2025-07-17T13:39:14Z"
  },
  {
    "title": "Coca-Cola to use cane sugar in Coke sold in US, Trump says",
    "description": "The Coca-Cola Company has agreed to use cane sugar in its namesake drinks in the US, according to US President Donald Trump.\nIn a post on social media outlet Truth Social yesterday (16 July), Trump said: \"I have been speaking to Coca-Cola about using REAL can…",
    "link": "https://biztoc.com/x/01b96f678d8d386a",
    "timestamp": "2025-07-17T13:38:38Z"
  },
  {
    "title": "Reform council agrees plan to share data with savings unit",
    "description": "The Doge cost-cutting team is seeking data-sharing agreements with all of the councils Reform UK controls.",
    "link": "https://www.bbc.com/news/articles/cx245klpj5wo",
    "timestamp": "2025-07-17T13:37:58Z"
  },
  {
    "title": "Trump has a REVOLT and he's 'in denial' about it: Claire McCaskill",
    "description": "President Donald Trump disowned his supporters who have called for the release of files related to Jeffrey Epstein, chiding them ...",
    "link": "https://biztoc.com/x/42bc554adb7e10d6",
    "timestamp": "2025-07-17T13:36:19Z"
  },
  {
    "title": "No Tax On Overtime Explained",
    "description": "Should working longer hours mean keeping more of your paycheck? The Trump administration and authors seem to think so.",
    "link": "https://www.forbes.com/sites/andrewleahey/2025/07/17/no-tax-on-overtime-explained/",
    "timestamp": "2025-07-17T13:35:25Z"
  },
  {
    "title": "Kevin Warsh touts 'regime change' at Fed and calls for partnership with Treasury",
    "description": "Warsh called for sweeping changes on how the Fed conducts business and suggested a policy alliance with the Treasury Department.",
    "link": "https://www.cnbc.com/2025/07/17/kevin-warsh-touts-regime-change-at-fed-and-calls-for-partnership-with-treasury.html",
    "timestamp": "2025-07-17T13:35:15Z"
  },
  {
    "title": "Shane Gillis uses friend’s wife to fool ESPYs crowd with WNBA joke",
    "description": "In one fell swoop, Shane Gillis managed to humiliate the entire crowd at the ESPYs Wednesday night.",
    "link": "https://nypost.com/2025/07/17/sports/shane-gillis-uses-friends-wife-to-fool-espys-crowd-with-wnba-joke/",
    "timestamp": "2025-07-17T13:34:55Z"
  },
  {
    "title": "Police Scotland requests extra officers from across UK to support upcoming Trump visit",
    "description": "Police Scotland has told Sky News it has requested extra officers from across the UK to support the upcoming visit by US President Donald Trump.",
    "link": "https://news.sky.com/story/police-scotland-requests-extra-officers-from-across-uk-to-support-upcoming-donald-trump-visit-13398024",
    "timestamp": "2025-07-17T13:33:00Z"
  },
  {
    "title": "Nationwide protests planned against Trump immigration crackdown and health cuts",
    "description": "Protests are expected to be held along streets, at court houses and other public spaces. Organizers are calling for them to be peaceful.",
    "link": "https://www.abc15.com/news/national/nationwide-protests-planned-against-trumps-immigration-crackdown-and-health-care-cuts",
    "timestamp": "2025-07-17T13:32:44Z"
  },
  {
    "title": "Trump's tariffs cloud G20 finance chiefs' meeting in SA",
    "description": "South Africa urged G20 countries to show global and cooperative leadership to tackle challenges including rising trade barriers, as the club's finance chiefs met today under the shadow of President Donald Trump's tariff threats.",
    "link": "https://www.rte.ie/news/business/2025/0717/1524015-g20-meetings-in-south-africa/",
    "timestamp": "2025-07-17T13:32:37Z"
  },
  {
    "title": "Alex Jones Panics That Trump Is “Destroying MAGA in Real Time”",
    "description": "Trump’s dismissal of the Jeffrey Epstein case is giving some of his most ardent supporters—like Alex Jones—a bit of an identity crisis. “Trump, we’ve believed in you, we’ve seen you do great work, we’ve seen the bad guys, the worst certified people on earth c…",
    "link": "https://newrepublic.com/post/198054/alex-jones-trump-destroying-maga-real-time-cult",
    "timestamp": "2025-07-17T13:30:09Z"
  },
  {
    "title": "Pentagon Withdraws from Aspen Conference: Exposing the Liberal Mega-Donor Network Behind Globalist Defense Summit",
    "description": "The Pentagon pulled roughly a dozen senior Defense Department officials from the Aspen Security Forum on Monday, July 14, 2025, just hours before the event was set to begin the next day.\nThe post Pentagon Withdraws from Aspen Conference: Exposing the Liberal …",
    "link": "https://www.thegatewaypundit.com/2025/07/pentagon-withdraws-aspen-conference-exposing-liberal-mega-donor/",
    "timestamp": "2025-07-17T13:30:08Z"
  },
  {
    "title": "Struggling Shane Gillis Tells ESPYs Crowd to Lighten Up After Getting Booed",
    "description": "By\n Matt Solomon\n Published: July 17th, 2025",
    "link": "https://www.cracked.com/article_47420_struggling-shane-gillis-tells-espys-crowd-to-lighten-up-after-getting-booed.html",
    "timestamp": "2025-07-17T13:30:00Z"
  },
  {
    "title": "Mars 'Toxic' Food Dyes in M&M's, Skittles Under Scrutiny",
    "description": "Mars Inc. said it planned to remove food dyes from its products in 2016 but has since said this won't apply to certain treats.",
    "link": "https://www.newsweek.com/mars-toxic-food-dyes-mms-skittles-under-scrutiny-2100143",
    "timestamp": "2025-07-17T13:29:59Z"
  },
  {
    "title": "Trump administration pulls $4 billion from California high-speed rail project",
    "description": "The railroad authority was put on notice last month for allegedly breaching terms of its federal contracts.",
    "link": "https://www.cnbc.com/2025/07/17/duffy-trump-california-high-speed-rail-termination.html",
    "timestamp": "2025-07-17T13:29:51Z"
  },
  {
    "title": "Death to Big Bird",
    "description": "Plus: Jerome Powell on Trump's kill list, conservatives embrace speech restrictions, homeschooling heat, and more...",
    "link": "https://reason.com/2025/07/17/death-to-big-bird/",
    "timestamp": "2025-07-17T13:28:43Z"
  },
  {
    "title": "Eric Schmitt Shatters Democrat Scare Tactics About Weather Alerts Amid Debate on PBS/NPR Funding",
    "description": "As RedState previously reported, hysterical Democrats and their mainstream media allies have predictably ramped up the scare tactics in light of the procedural Senate vote Tuesday night to advance debate to the floor on the Trump-backed rescissions package, w…",
    "link": "https://freerepublic.com/focus/f-news/4329154/posts",
    "timestamp": "2025-07-17T13:26:43Z"
  },
  {
    "title": "Nick Offerman Goes Full ‘Parks and Recreation’ and Scolds Trump for Cutting $267 Million From National Parks Budget: ‘That’s Called S—ting the Bed’",
    "description": "Nick Offerman channeled the spirit of his beloved “Parks and Recreation” character Ron Swanson during a recent visit to “The Daily Show,” where the actor scolded Donald Trump for cutting $267 million in funding for America’s national parks. “I have several un…",
    "link": "https://variety.com/2025/tv/news/nick-offerman-trump-national-parks-budget-1236463627/",
    "timestamp": "2025-07-17T13:26:23Z"
  },
  {
    "title": "Trump Makes New Excuse for Appointing Powell Hours After Falsely Claiming It Was Biden",
    "description": "Trump offered a new excuse for his appointment of Federal Reserve Chair Jerome Powell just hours after he falsely claimed Biden appointed Powell.\nThe post Trump Makes New Excuse for Appointing Powell Hours After Falsely Claiming It Was Biden first appeared on…",
    "link": "https://www.mediaite.com/media/news/trump-makes-new-excuse-for-appointing-powell-hours-after-falsely-claiming-it-was-biden/",
    "timestamp": "2025-07-17T13:26:06Z"
  },
  {
    "title": "Trump Uses Obscure Report To Justify New Immigration Restrictions",
    "description": "The Trump administration has cited an obscure Department of Homeland Security report to justify new immigration restrictions.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/07/17/trump-uses-obscure-report-to-justify-new-immigration-restrictions/",
    "timestamp": "2025-07-17T13:24:46Z"
  },
  {
    "title": "Volodymyr Zelenskiy says he and Donald Trump are considering a drone 'mega-deal'",
    "description": "President Zelenskiy revealed that Ukraine and the U.S. are exploring a deal where Washington would acquire Ukrainian battlefield-tested drones. In return, Kyiv would purchase weapons from the U.S., aiming to enhance both nations' aerial capabilities.",
    "link": "https://economictimes.indiatimes.com/news/defence/volodymyr-zelenskiy-says-he-and-donald-trump-are-considering-a-drone-mega-deal/articleshow/122643401.cms",
    "timestamp": "2025-07-17T13:21:25Z"
  },
  {
    "title": "US applications for jobless benefits fall again, hitting lowest level since April",
    "description": "The number of Americans filing for unemployment benefits fell last week to the lowest level in three months, a sign that the U.S. labor market remains sturdy despite fears over the impact of widespread U.S. tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/us-applications-jobless-benefits-fall-straight-week-hitting-123829495",
    "timestamp": "2025-07-17T13:21:11Z"
  },
  {
    "title": "Scott Jennings Pressed About Whether He Will Ditch CNN For Senate Run",
    "description": "Republican strategist Scott Jennings hinted at what might lead him to ditch CNN for a possible Senate campaign during an interview on Real America’s Voice.",
    "link": "https://dailycaller.com/2025/07/17/scott-jennings-pressed-about-whether-he-will-ditch-cnn-for-senate-run/",
    "timestamp": "2025-07-17T13:21:02Z"
  },
  {
    "title": "CNN busts Trump for a new 'colorful story' that 'couldn't possibly be true'",
    "description": "CNN's Daniel Dale fact-checked President Donald Trump over an imaginary tale he told about his uncle and the infamous Unabomber.The president frequently boasts about his late uncle John Trump, who taught electrical engineering for decades at the prestigious M…",
    "link": "https://www.rawstory.com/donald-trump-unabomber-daniel-dale/",
    "timestamp": "2025-07-17T13:19:58Z"
  },
  {
    "title": "Retail sales up a surprising 0.6% in June after a May pullback by consumers",
    "description": "After an earlier pullback, consumers picked up their spending in June showing resilience despite anxiety high over tariffs and the U.S. economy",
    "link": "https://abcnews.go.com/Business/wireStory/retail-sales-surprising-06-june-after-pullback-consumers-123829497",
    "timestamp": "2025-07-17T13:19:50Z"
  },
  {
    "title": "TSMC US chip production may soon only be three years behind Taiwan",
    "description": "TSMC is working to build two plants in Arizona faster, a move that could bring more Apple chip production to Arizona quicker — but don't expect the newest chips.A worker passing a TSMC signThe TSMC facility in Phoenix, known as Fab 21, is the chip foundry's f…",
    "link": "https://appleinsider.com/articles/25/07/17/tsmc-us-chip-production-may-soon-only-be-three-years-behind-taiwan",
    "timestamp": "2025-07-17T13:19:14Z"
  },
  {
    "title": "Musk Uses Grok's AI Replies To Attack Trump Over ‘Epstein Files’",
    "description": "The billionaire has used Trump’s handling of the ‘Epstein files’ issue to repeatedly attack his former ally since their public falling out last month.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/17/musk-uses-groks-ai-replies-to-attack-trump-over-epstein-files/",
    "timestamp": "2025-07-17T13:19:07Z"
  },
  {
    "title": "Lin-Manuel Miranda will turn 'Hamilton' 10th anniversary into a fundraiser for immigration services",
    "description": "Lin-Manuel Miranda is using the 10th anniversary Broadway performance of *Hamilton* to support nonprofits providing immigration services",
    "link": "https://abcnews.go.com/Entertainment/wireStory/lin-manuel-miranda-turn-hamilton-10th-anniversary-fundraiser-123830962",
    "timestamp": "2025-07-17T13:18:18Z"
  },
  {
    "title": "Trump’s Promise on Coke Recipe Fizzles Out Immediately as Coca-Cola Blanks Him",
    "description": "President Donald Trump’s seeming attempt to distract from the Jeffrey Epstein debacle by claiming he had single-handedly changed the recipe of Coca-Cola has ...",
    "link": "https://www.thedailybeast.com/trump-tries-to-distract-base-from-epstein-disaster-with-mexican-coke/",
    "timestamp": "2025-07-17T13:16:13Z"
  },
  {
    "title": "Truth Social Needs Its Own Grok. Trump Has the Trademarks",
    "description": "A MAGA-bot could be on the way.",
    "link": "https://gizmodo.com/truth-social-needs-its-own-grok-trump-has-the-trademarks-2000630410",
    "timestamp": "2025-07-17T13:15:25Z"
  },
  {
    "title": "WATCH: Speaker Mike Johnson Pulls Off Impressive Trump Impression",
    "description": "Speaker of the House Mike Johnson (R-LA) showcased his best impression of President Donald Trump during a recent interview.\nThe post WATCH: Speaker Mike Johnson Pulls Off Impressive Trump Impression first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/watch-speaker-mike-johnson-pulls-off-impressive-trump-impression/",
    "timestamp": "2025-07-17T13:14:52Z"
  },
  {
    "title": "Crypto firm Bitcoin Standard to go public in deal with Cantor-backed SPAC",
    "description": "Crypto firm Bitcoin Standard Treasury Company said on Thursday it is aiming to list on the Nasdaq through a merger with a Cantor Fitzgerald-backed blank check vehicle. The company will merge with Cantor Equity Partners I, a special purpose acquisition company…",
    "link": "https://www.channelnewsasia.com/business/crypto-firm-bitcoin-standard-go-public-in-deal-cantor-backed-spac-5243791",
    "timestamp": "2025-07-17T13:14:28Z"
  },
  {
    "title": "South Africa coalition strained after trade envoy fails to visit US",
    "description": "JOHANNESBURG (Reuters) -South Africa's main coalition partners are embroiled in a spat over how to respond to looming tariffs from a hostile Trump administration, after the smaller party said the president's aide was denied a U.S. visa to negotiate with Washi…",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/south-africa-coalition-strained-after-trade-envoy-fails-to-visit-us",
    "timestamp": "2025-07-17T13:13:00Z"
  },
  {
    "title": "Lin-Manuel Miranda will turn ‘Hamilton’ 10th anniversary into a fundraiser for immigration services",
    "description": "Lin-Manuel Miranda plans to use the 10th anniversary Broadway performance of his award-winning cultural phenomenon “Hamilton” as a fundraiser for a coalition of nonprofits providing immigration services. The Aug. 6 performance of “Hamilton” at Broadway’s Rich…",
    "link": "https://financialpost.com/pmn/lin-manuel-miranda-will-turn-hamilton-10th-anniversary-into-a-fundraiser-for-immigration-services-2",
    "timestamp": "2025-07-17T13:12:42Z"
  },
  {
    "title": "Russian banks prepare for bailouts as Putin’s war hammers economy",
    "description": "Russia’s banks are reportedly seeking to arrange bailouts from Moscow as borrowers struggle to repay loans across the war-battered economy.",
    "link": "https://uk.finance.yahoo.com/news/russian-banks-prepare-bailouts-putin-131232614.html",
    "timestamp": "2025-07-17T13:12:32Z"
  }
]