[
  {
    "title": "Social Security to shift to fully electronic payments starting Sept. 30",
    "description": "The Social Security Administration is transitioning to electronic payments next week after 85 years of issuing paper checks to U.S. retirees.",
    "link": "https://www.cbsnews.com/news/social-security-paper-checks-ending-september-30-electronic-payments/",
    "timestamp": "2025-09-25T16:58:20Z"
  },
  {
    "title": "Trump’s petty vindictiveness on full display as indictment threat looms over James Comey",
    "description": "Chris Hayes breaks down reports that Trump plans to indict former FBI director James Comey, after forcing out a U.S. attorney who refused to do his bidding.",
    "link": "https://www.msnbc.com/top-stories/latest/james-comey-indictment-trump-fbi-retaliation-rcna233678",
    "timestamp": "2025-09-25T16:57:48Z"
  },
  {
    "title": "The Establishment Fights Back: Ex-Fed, Treasury Officials Urge Supreme Court to Block Trump From Ousting Fed’s Cook",
    "description": "A bipartisan roster of former Treasury secretaries, Federal Reserve chairs and other senior economic policymakers asked the Supreme Court to stop President Donald Trump from removing Fed Governor Lisa Cook, warning that the central bank’s independence and the…",
    "link": "https://www.breitbart.com/economy/2025/09/25/the-establishment-fights-back-ex-fed-treasury-officials-urge-supreme-court-to-block-trump-from-ousting-feds-cook/",
    "timestamp": "2025-09-25T16:57:21Z"
  },
  {
    "title": "'Trump’s presidency is effectively over': New polling spells disaster for Trump in 2026",
    "description": "New polling data\r\n on swing states shows that a plurality of voters now favor President Donald Trump being impeached, a figure that one journalist suspects will reach an outright majority ahead of the 2026 midterm elections.“If Democrats win 20-40 seats, whil…",
    "link": "https://www.rawstory.com/trump-2674039637/",
    "timestamp": "2025-09-25T16:57:03Z"
  },
  {
    "title": "Donald Trump heads to the Ryder Cup, embraced by a golf world that once shunned him",
    "description": "Trump will be front and center at the tournament at Bethpage Black on Long Island.",
    "link": "https://www.bostonherald.com/2025/09/25/ryder-cup-trump/",
    "timestamp": "2025-09-25T16:56:12Z"
  },
  {
    "title": "Trump Urges Erdogan to Stop Buying Oil From Russia",
    "description": "President Donald Trump pressed Turkish President Recep Tayyip Erdogan to stop buying oil from Russia and left the door open to Ankara obtaining F-35 fighter jets, as the leaders discussed trade and geopolitical flashpoints.\n“I’d like to have him stop buying a…",
    "link": "https://biztoc.com/x/eb425f386ac66682",
    "timestamp": "2025-09-25T16:56:03Z"
  },
  {
    "title": "Comey Charges Reportedly Looming Days After Prosecutor With Family Ties to Ex-FBI Chief Resigns",
    "description": "DAILY CALLER NEWS FOUNDATION—Former FBI Director James Comey could be indicted in the coming days, according to multiple reports. President Donald Trump appointed Lindsey Halligan, a... Read More\nThe post Comey Charges Reportedly Looming Days After Prosecutor…",
    "link": "https://www.dailysignal.com/2025/09/25/comey-charges-reportedly-looming-days-after-prosecutor-with-family-ties-to-ex-fbi-chief-resigns/",
    "timestamp": "2025-09-25T16:55:03Z"
  },
  {
    "title": "Disney Shareholder Groups Demand Documents Related to ‘Jimmy Kimmel Live’ Suspension",
    "description": "A new letter suggests company brass may have placed \"improper political or affiliate considerations above the best interests of the Company and its stockholders\"",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jimmy-kimmel-disney-shareholders-documents-suspension-1235435368/",
    "timestamp": "2025-09-25T16:54:15Z"
  },
  {
    "title": "‘That’s F**king Crazy’: Trump Torched In New Ad Aimed At The ‘Manosphere’",
    "description": "The president’s hypocrisy is called out in the Home of the Brave’s damning montage.",
    "link": "https://www.huffpost.com/entry/home-of-the-brave-manosphere_n_68d51eaee4b0ca9d88176868",
    "timestamp": "2025-09-25T16:54:09Z"
  },
  {
    "title": "President Trump holds a bilateral meeting with Turkish President Recep Tayyip Erdogan — 9/25/25",
    "description": "President Donald Trump hosts Turkish President Recep Tayyip Erdogan for a bilateral meeting on Thursday. For access to live ...",
    "link": "https://biztoc.com/x/73d8249ce74aaa10",
    "timestamp": "2025-09-25T16:52:01Z"
  },
  {
    "title": "A 'dummies guide' to being Ryder Cup captain",
    "description": "What makes a good Ryder Cup captain? For American chief Keegan Bradley and European counterpart Luke Donald, the next few days will be an examination of their ability to lead - here are four areas that are key to a successful guardianship of golf's most covet…",
    "link": "https://www.rte.ie/sport/golf/2025/0925/1535317-a-dummies-guide-to-being-ryder-cup-captain/",
    "timestamp": "2025-09-25T16:51:58Z"
  },
  {
    "title": "Trump Praises Turkey’s Strongman Erdogan, Jokes He Knows All About ‘Rigged Elections’",
    "description": "Erdogan has cracked down on civil society in Turkey and suppressed his political opposition in what critics see as dangerous democratic backsliding.\nThe post Trump Praises Turkey’s Strongman Erdogan, Jokes He Knows All About ‘Rigged Elections’ first appeared …",
    "link": "https://www.mediaite.com/politics/trump-praises-turkeys-strongman-erdogan-jokes-he-knows-all-about-rigged-elections/",
    "timestamp": "2025-09-25T16:49:44Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump Left Royal Family 'Disgusted' With State of His Room at Windsor Castle — 'There Was Takeout Boxes, Fake Tan and Hair Spray Everywhere'",
    "description": "President Donald Trump has left the royal family in shock after leaving Windsor Castle room covered in trash and fake tan.",
    "link": "https://radaronline.com/p/donald-trump-fake-tan-hair-royal-family-disgusted-windsor-castle-room/",
    "timestamp": "2025-09-25T16:44:55Z"
  },
  {
    "title": "Trump Urges Erdogan To Cut Russian Oil Buys, Floats F-35 Deal",
    "description": "President Donald Trump pressed Turkish President Recep Tayyip Erdogan to stop buying oil from Russia and left the door open to Ankara obtaining F-35 fighter jets, as the leaders discussed trade and geopolitical flashpoints.",
    "link": "https://www.ndtvprofit.com/world/trump-urges-erdogan-to-cut-russian-oil-buys-floats-f-35-deal",
    "timestamp": "2025-09-25T16:44:40Z"
  },
  {
    "title": "Trump DOJ reportedly rushing to indict Comey",
    "description": "Former FBI Director James Comey oversaw the initial 2016 investigation into ties between the Trump campaign and Russia",
    "link": "https://theweek.com/politics/trump-james-comey-indictment-fbi",
    "timestamp": "2025-09-25T16:44:34Z"
  },
  {
    "title": "Recognize Palestine, Then Put Real Pressure on Israel",
    "description": "Meaningful international support for Palestinian liberation remains necessary to defeat terrorism.",
    "link": "http://foreignpolicy.com/2025/09/25/palestine-trump-hamas-terrorism-unga-netanyahu/",
    "timestamp": "2025-09-25T16:42:45Z"
  },
  {
    "title": "Former Fed chairs urge Supreme Court to let Lisa Cook keep her job",
    "description": "Alan Greenspan, Ben Bernanke, Janet Yellen and other former top economic officials appointed by presidents of both parties are urging the Supreme Court to preserve the Federal Reserve’s political independence and allow Lisa Cook to remain as a central bank go…",
    "link": "https://apnews.com/article/trump-federal-reserve-cook-supreme-court-fire-f11b2dee50fd3b83664376f89f3cf9e9",
    "timestamp": "2025-09-25T16:41:33Z"
  },
  {
    "title": "Lula and Trump’s Backstage Breakthrough",
    "description": "The apparent thaw between the two leaders is a reminder of why the U.N. still matters.",
    "link": "http://foreignpolicy.com/2025/09/25/trump-lula-brazil-us-unga-diplomacy-bolsonaro/",
    "timestamp": "2025-09-25T16:41:21Z"
  },
  {
    "title": "He’s the budget scorekeeper for Congress. Lately, it’s been a tough job",
    "description": "CBO Director Phillip Swagel emphasizes the agency plays a nonpartisan role in assessing legislation.",
    "link": "https://www.bostonherald.com/2025/09/25/cbo-director/",
    "timestamp": "2025-09-25T16:40:15Z"
  },
  {
    "title": "Obama Rips Trump for Tying Tylenol to Autism: ‘Violence Against the Truth’ | Video",
    "description": "“We have the spectacle of my successor, in the Oval Office, making broad claims around certain drugs and autism that have been continuously disproved,” the former president says\nThe post Obama Rips Trump for Tying Tylenol to Autism: ‘Violence Against the Trut…",
    "link": "https://www.thewrap.com/obama-trump-tylenol-autism-response/",
    "timestamp": "2025-09-25T16:40:11Z"
  },
  {
    "title": "Accenture beats revenue estimates, plans $865 million restructuring amid AI shift",
    "description": "Accenture expects about $250 million in charges in the November quarter, on top of $615 million recorded in the fourth quarter, for a total of $865 million. The restructuring program highlights the broader trend of companies adapting their workforce and opera…",
    "link": "https://economictimes.indiatimes.com/tech/technology/accenture-beats-revenue-estimates-plans-865-million-restructuring-amid-ai-shift/articleshow/124126201.cms",
    "timestamp": "2025-09-25T16:40:03Z"
  },
  {
    "title": "Pete Hegseth Orders Top Military Leaders to Attend Mystery Meeting",
    "description": "“To say the military leadership is anxious would be an understatement,” one defense official told The Intercept.\nThe post Pete Hegseth Orders Top Military Leaders to Attend Mystery Meeting appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/25/hegseth-military-generals-admirals-washington-dc/",
    "timestamp": "2025-09-25T16:39:59Z"
  },
  {
    "title": "As the shutdown deadline nears, the White House finds new ways to raise the stakes",
    "description": "Can a government shutdown still be avoided? The latest moves from the White House and congressional Republican suggest there’s little reason for optimism.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/shutdown-deadline-nears-white-house-finds-new-ways-raise-stakes-rcna233716",
    "timestamp": "2025-09-25T16:39:39Z"
  },
  {
    "title": "TikToker Hannah Brown Is Losing Followers Over Charlie Kirk’s Memorial",
    "description": "TikTok star Hannah Brown is losing thousands of followers after she was spotted attending Charlie Kirk’s memorial service.",
    "link": "http://www.thecut.com/article/why-is-tiktoker-hannah-brown-losing-followers.html",
    "timestamp": "2025-09-25T16:39:27Z"
  },
  {
    "title": "Transgender track star from N.J. takes legal action over alleged ban",
    "description": "Transgender athlete is involved in multiple lawsuits after being barred from competing in track meets",
    "link": "https://www.nj.com/sports/2025/09/transgender-track-star-from-nj-takes-legal-action-over-alleged-ban.html",
    "timestamp": "2025-09-25T16:36:04Z"
  },
  {
    "title": "GWAR Roar Back Against MAGA Outrage: “GWAR Normalizing Violence Is Patently Absurd”",
    "description": "Frontman Michael “Blöthar the Berserker” Bishop responds to outcry from conservatives about the band's stage antics.\nGWAR Roar Back Against MAGA Outrage: “GWAR Normalizing Violence Is Patently Absurd”\nChris Coplan",
    "link": "https://consequence.net/2025/09/gwar-respond-to-maga-outrage/",
    "timestamp": "2025-09-25T16:35:59Z"
  },
  {
    "title": "Crazy Grandpa Demands Apology... From Kamala Harris?",
    "description": "Donald Trump’s 1.5 percent popular vote victory in 2024 is one of the smallest ever, as it fell short of securing a majority of the popular vote. Still, it's 324 days since the election, and Trump took to Truth Social to claim that he won against former presi…",
    "link": "https://crooksandliars.com/2025/09/crazy-grandpa-launches-rant-demanding",
    "timestamp": "2025-09-25T16:35:32Z"
  },
  {
    "title": "Agencies should prep for mass layoffs if shutdown occurs, White House says",
    "description": "OMB is requesting updated reduction-in-force plans even if a shutdown is averted.",
    "link": "https://www.govexec.com/management/2025/09/agencies-should-prep-mass-layoffs-if-shutdown-occurs-white-house-says/408364/",
    "timestamp": "2025-09-25T16:35:00Z"
  },
  {
    "title": "'South Park' Packs Pro-Kimmel Plot in an Episode Where Trump Nearly Kills Brendan Carr",
    "description": "Comedy Central's \"South Park\" placed a not-so-subtle pro-Jimmy Kimmel message inside the plot of this week's episode that saw President Donald Trump nearly killing FCC chair Brendan Carr during several failed attempts to actually murder his unborn baby being …",
    "link": "https://www.breitbart.com/entertainment/2025/09/25/south-park-packs-pro-kimmel-plot-in-an-episode-where-trump-nearly-kills-brendan-carr/",
    "timestamp": "2025-09-25T16:34:58Z"
  },
  {
    "title": "Trump will 'inspire' US to Ryder Cup victory - DeChambeau",
    "description": "Bryson DeChambeau says the presence of President Donald Trump will \"inspire\" the United States to victory over Europe in the 45th edition of the Ryder Cup. President Trump, who is a keen golf fan, will visit the Bethpage Black course, a short distance outside…",
    "link": "https://www.bbc.com/sport/golf/articles/cvg9r5qyymgo",
    "timestamp": "2025-09-25T16:34:33Z"
  },
  {
    "title": "Trump Laughingly Attacks CNN During Global Oval Office Photo Op",
    "description": "Trump laughingly attacked CNN during an Oval Office meeting even as he agreed to take a question from a reporter from CNN's Turkish affiliate.\nThe post Trump Laughingly Attacks CNN During Global Oval Office Photo Op first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-laughingly-attacks-cnn-during-global-oval-office-photo-op/",
    "timestamp": "2025-09-25T16:34:25Z"
  },
  {
    "title": "Trump Warns 'It's Going to Get Worse' After Dallas ICE Facility Shooting",
    "description": "President Donald Trump again blamed the \"radical left\" and warned that \"it's going to get worse\" after Wednesday's fatal shooting at a Dallas ICE facility.\nIn response to a question about the incident, Trump told reporters Thursday during a meeting with Turki…",
    "link": "https://biztoc.com/x/8bf23b2519ccfaac",
    "timestamp": "2025-09-25T16:34:08Z"
  },
  {
    "title": "Trump Admin Will Use Elon Musk’s Racist Grok AI Chatbot in Government",
    "description": "The Trump administration on Thursday announced an agreement with Elon Musk’s company xAI, making his questionable chatbot Grok available to every federal agency over the next year-and-a-half for a nominal fee of 42 cents.“We value xAI for partnering with [the…",
    "link": "https://newrepublic.com/post/200939/trump-musk-deal-grok-ai-chatbot-government",
    "timestamp": "2025-09-25T16:34:08Z"
  },
  {
    "title": "Trump meets Erdogan: Close to 'some kind of deal' to end Gaza war",
    "description": "US, Turkish Presidents meet at the White House as Erdogan seeks lifting of US ban on selling F-35s to Turkey.",
    "link": "https://www.israelnationalnews.com/news/415416",
    "timestamp": "2025-09-25T16:33:45Z"
  },
  {
    "title": "‘An attempt at intimidation’: White House to slash programs and jobs if shutdown occurs",
    "description": "'Democrats are signaling that they intend … to shut down the government in the coming days over a series of insane demands, including $1 trillion in new spending'",
    "link": "https://www.wnd.com/2025/09/attempt-intimidation-white-house-slash-programs-jobs-if/",
    "timestamp": "2025-09-25T16:31:35Z"
  },
  {
    "title": "Jim Jordan Celebrates Google Caving To His Pressure In Letter That Says Caving To Government Pressure Is Wrong",
    "description": "Look, if you want to cut to the chase: the lawyers working for Google and Meta know that the MAGA world is very, very stupid and very, very gullible, and it’s very, very easy to tell them something that they know will be interpreted as a “victory” while actua…",
    "link": "https://www.techdirt.com/2025/09/25/jim-jordan-celebrates-google-caving-to-his-pressure-in-letter-that-says-caving-to-government-pressure-is-wrong/",
    "timestamp": "2025-09-25T16:31:30Z"
  },
  {
    "title": "Fact check: Vance, rewriting last week’s history, claims FCC chair just made a ‘joke’ about Kimmel | CNN Politics",
    "description": "Vice President JD Vance tried Wednesday to rewrite the history of what happened before ABC suspended late-night host Jimmy Kimmel last week, saying a commissioner on the Federal Communications Commission merely made “a joke on social media” on the subject of …",
    "link": "https://www.cnn.com/2025/09/25/politics/fact-check-vance-fcc-kimmel",
    "timestamp": "2025-09-25T16:31:05Z"
  },
  {
    "title": "Kamala Harris plays up cozy relationship with Hillary Clinton as wedge with Biden widens",
    "description": "Kamala Harris shares campaign anecdotes in new book, including how Hillary Clinton and Bill Clinton immediately offered support after Biden dropped out of the race.",
    "link": "https://www.foxnews.com/politics/kamala-harris-plays-up-cozy-relationship-hillary-clinton-wedge-biden-widens",
    "timestamp": "2025-09-25T16:30:43Z"
  },
  {
    "title": "Truth shared after people discover link between Erika Kirk and Donald Trump as bikini photo resurfaces",
    "description": "Donald Trump was pictured consoling Erika Kirk at her late husband Charlie's funeral",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-erika-kirk-link-beauty-pageant-315677-20250925",
    "timestamp": "2025-09-25T16:30:41Z"
  },
  {
    "title": "EXCLUSIVE: Trump Admin Warns Migrant Sponsors To Pay Their Tab Or Face Consequences",
    "description": "The Trump administration is warning migrant sponsors to take financial responsibility of them or expect to be slapped with steep fines and possible prosecution.",
    "link": "https://dailycaller.com/2025/09/25/sponsors-must-pay-for-their-migrants/",
    "timestamp": "2025-09-25T16:30:32Z"
  },
  {
    "title": "Media Falsely Calls Shooters Trump Supporters Even Trans, Leftists, and Islamic Extremists",
    "description": "A leftist gunman recently opened fire on an ICE facility, killing one and leaving two critically wounded.\nThe post Media Falsely Calls Shooters Trump Supporters Even Trans, Leftists, and Islamic Extremists appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/media-falsely-calls-shooters-trump-supporters-even-trans/",
    "timestamp": "2025-09-25T16:30:11Z"
  },
  {
    "title": "The billionaire politician making a Trump-like comeback in the Czech Republic",
    "description": "Former prime minister Andrej Babiš is seeking a second tilt at power, with potentially serious ramifications for Europe",
    "link": "https://www.irishtimes.com/world/europe/2025/09/25/the-billionaire-politician-making-a-trump-like-comeback-in-the-czech-republic/",
    "timestamp": "2025-09-25T16:30:00Z"
  },
  {
    "title": "What Americans think about legal immigration, according to a new poll",
    "description": "A new poll finds U.S. adults are more likely than they were a year ago to think immigrants in the country legally benefit the economy.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_82fb679f-4469-546c-babb-3b0c90026638.html",
    "timestamp": "2025-09-25T16:30:00Z"
  },
  {
    "title": "North Korea close to developing ICBM that can hit US with nuclear weapon, South Korea's Lee says",
    "description": "SEOUL (Reuters) -North Korea is in the last stage of developing an intercontinental ballistic missile that could hit the United States with a nuclear weapon, though it has yet to master re-entry technology, South Korea's president said on Thursday. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/09/26/north-korea-close-to-developing-icbm-that-can-hit-us-with-nuclear-weapon-south-korea039s-lee-says",
    "timestamp": "2025-09-25T16:29:00Z"
  },
  {
    "title": "Trump Issues Grave Warning to the ‘Radical Left’ After Attack on ICE: ‘Bad Things Happen’",
    "description": "President Donald Trump issued a grave warning to the \"radical left\" on Thursday after fielding a question about the attack on an ICE facility in Dallas the day before.\nThe post Trump Issues Grave Warning to the ‘Radical Left’ After Attack on ICE: ‘Bad Things …",
    "link": "https://www.mediaite.com/media/news/trump-issues-grave-warning-to-the-radical-left-after-attack-on-ice-bad-things-happen/",
    "timestamp": "2025-09-25T16:26:32Z"
  },
  {
    "title": "'He’s a criminal': Student stuns MAGA podcaster in brutal Turning Point shouting match",
    "description": "Right-wing podcast host Megyn Kelly got into a screaming match with a male college student at a Turning Point USA event at Virginia Tech University over whether or not President Donald Trump is fanning the flames of violence in the wake of MAGA influencer Cha…",
    "link": "https://www.rawstory.com/hes-a-criminal-college-student-stuns-maga-podcaster-in-brutal-shouting-match-on-trump/",
    "timestamp": "2025-09-25T16:26:06Z"
  },
  {
    "title": "Disney gears up for court battle with Trump after reinstating Jimmy Kimmel: report",
    "description": "The entertainment giant brought Kimmel back on air Tuesday night after a weeklong suspension for remarks he made on Sept. 15 about Charlie Kirk.",
    "link": "https://nypost.com/2025/09/25/business/disney-gears-up-for-court-battle-with-trump-after-reinstating-jimmy-kimmel/",
    "timestamp": "2025-09-25T16:25:34Z"
  },
  {
    "title": "Meta set to face EU finding it failed to police illegal posts",
    "description": "The European Commission is preparing to issue preliminary findings saying that Meta’s Facebook and Instagram lack an adequate “notice and action mechanism” that would let users flag illegal posts for removal, according to two people familiar with the plans, w…",
    "link": "https://economictimes.indiatimes.com/tech/technology/meta-set-to-face-eu-finding-it-failed-to-police-illegal-posts/articleshow/124125799.cms",
    "timestamp": "2025-09-25T16:25:10Z"
  },
  {
    "title": "Senate Democrats urge DOJ to release files related to border czar Tom Homan bribery investigation",
    "description": "Democrats in Washington are ramping up efforts to investigate White House border czar Tom Homan over allegations that he accepted $50,000 in cash from undercover FBI agents last year.",
    "link": "https://www.nbcnews.com/politics/congress/senate-democrats-urge-doj-files-tom-homan-bribery-investigation-rcna233520",
    "timestamp": "2025-09-25T16:25:08Z"
  },
  {
    "title": "Trump Urges Erdogan to Cut Russian Oil Buys, Floats F-35 Deal",
    "description": "President Donald Trump pressed Turkish President Recep Tayyip Erdogan to stop buying oil from Russia and left the door open to Ankara obtaining F-35 fighter jets, as the leaders discussed trade and geopolitical flashpoints.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-urges-erdogan-to-cut-russian-oil-buys-floats-f-35-deal",
    "timestamp": "2025-09-25T16:25:07Z"
  },
  {
    "title": "Rights advocates accuse Eswatini of stalling case weighing US deportations",
    "description": "A scheduled hearing about the four men deported from the US has been delayed after the presiding judge did not appear.",
    "link": "https://www.aljazeera.com/news/2025/9/25/rights-advocates-accuse-eswatini-of-stalling-case-weighing-us-deportees",
    "timestamp": "2025-09-25T16:24:11Z"
  },
  {
    "title": "Greenspan, Bernanke and Yellen urge Supreme Court to let Lisa Cook keep her job as a Fed governor",
    "description": "Alan Greenspan, Ben Bernanke, Janet Yellen and other former top economic officials appointed by presidents of both parties are urging the Supreme Court to preserve the Federal Reserve’s political independence and allow Lisa Cook to remain as a central ...",
    "link": "https://abcnews.go.com/Business/wireStory/greenspan-bernanke-yellen-urge-supreme-court-lisa-cook-125935031",
    "timestamp": "2025-09-25T16:22:58Z"
  },
  {
    "title": "Dave Portnoy Still Doesn't Get It",
    "description": "It took a few days, but after the Jimmy Kimmel suspension, not only did several prominent Republicans like Ted Cruz and Ben Shapiro take Kimmel's side (with obvious reservations about his politics), but even most of the manosphere sided against...\nRead more...",
    "link": "https://www.pajiba.com/news/barstool-host-blast-his-own-boss-dave-portnoy-over-kimmel-situation.php",
    "timestamp": "2025-09-25T16:22:48Z"
  },
  {
    "title": "Bipartisan group of top officials urges Court to reject Trump's effort to fire Fed governor",
    "description": "A bipartisan group of former Federal Reserve chairs, Treasury secretaries, and top White House economists urged the Supreme Court Thursday to reject an attempt by President Donald Trump to fire Federal Reserve governor Lisa Cook",
    "link": "https://abcnews.go.com/Business/wireStory/bipartisan-group-top-officials-urges-court-reject-trumps-125935027",
    "timestamp": "2025-09-25T16:22:46Z"
  },
  {
    "title": "Jimmy Fallon Gleefully Rides Donald Trump Over Escalator Snafu",
    "description": "Jimmy Fallon Gleefully Rides Donald Trump Over Escalator Snafuhuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-donald-trump-escalator_n_68d55917e4b01e99f72de081",
    "timestamp": "2025-09-25T16:22:45Z"
  },
  {
    "title": "US Intel Leads To Capture Of Cartel-Linked Baby Trafficking, Organ Harvesting Ringleader",
    "description": "U.S. intelligence helped bring an alleged female ringleader of a cartel-linked baby trafficking and organ harvesting network, officials announced Wednesday.",
    "link": "https://dailycaller.com/2025/09/25/us-intel-leads-to-capture-of-cartel-linked-baby-trafficking-organ-harvesting-ringleader/",
    "timestamp": "2025-09-25T16:22:33Z"
  },
  {
    "title": "US to block FIFA’s ban of Israel from 2026 World Cup",
    "description": "The United States government will try to prevent any attempt to ban Israel from competing at the 2026 World Cup.",
    "link": "https://www.101greatgoals.com/football/internationals/us-block-fifa-ban-israel-2026-world-cup/",
    "timestamp": "2025-09-25T16:21:48Z"
  },
  {
    "title": "MAGA Official Behind Trump Bibles in Schools Quits to Join Bigger War",
    "description": "Ryan Walters, responsible for a years-long campaign to suffuse Oklahoma public schools with Christian nationalist and right-wing messages, is out as the state’s education superintendent and headed for the private sector.Speaking on Fox News late Wednesday, Wa…",
    "link": "https://newrepublic.com/post/200933/maga-official-trump-bibles-schools-quits-teachers-unions",
    "timestamp": "2025-09-25T16:21:20Z"
  },
  {
    "title": "Trump didn't tell the UN that 'it burns when I pee'",
    "description": "During an address to the United Nations General Assembly, U.S. President Donald Trump said, \"It burns when I pee.\"",
    "link": "https://www.snopes.com//fact-check/trump-it-burns-when-i-pee/",
    "timestamp": "2025-09-25T16:20:00Z"
  },
  {
    "title": "Poll Shows Rising White-Collar Opposition to Huge H-1B Foreign Worker Program",
    "description": "A poll of white-collar professionals shows that 56 percent of U.S. citizens say the huge H-1B visa-worker program is skewing the labor market and transferring their jobs to foreign migrants.\nThe post Poll Shows Rising White-Collar Opposition to Huge H-1B Fore…",
    "link": "https://www.breitbart.com/immigration/2025/09/25/poll-shows-rising-white-collar-opposition-to-huge-h-1b-foreign-worker-program/",
    "timestamp": "2025-09-25T16:18:08Z"
  },
  {
    "title": "Ryan Walters resigns as Oklahoma’s top public schools official to lead conservative educators’ group",
    "description": "Walters has been involved in several controversial initiatives, including promoting religion in classrooms and requiring teachers to pass ideology exams.",
    "link": "https://www.pbs.org/newshour/politics/ryan-walters-resigns-as-oklahomas-top-public-schools-official-to-lead-conservative-educators-group",
    "timestamp": "2025-09-25T16:17:07Z"
  },
  {
    "title": "Viktor Hovland’s great pursuits: A perfect golf swing and the truth about UFOs",
    "description": "Practicing on the driving range two days before the Ryder Cup begins Friday, the 28-year-old Norwegian said he suddenly felt freed up. “Obviously this is a golf course that you have to drive it really well, and I've been kind of struggling with the driver,” H…",
    "link": "https://sports.yahoo.com/article/viktor-hovland-great-pursuits-perfect-161655863.html",
    "timestamp": "2025-09-25T16:16:55Z"
  },
  {
    "title": "Deadly Shooting at Dallas ICE Hub Was ‘Targeted,’ FBI Say",
    "description": "A shooting at an Immigration and Customs Enforcement center in Dallas left one detainee dead and two others critically injured in what federal officials described as a “targeted attack” against the agency. Federal Bureau of Investigation Director Kash Patel t…",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/09/25/840604.htm",
    "timestamp": "2025-09-25T16:16:17Z"
  },
  {
    "title": "Palestinian president says ready to work with Trump for two-state peace plan",
    "description": "In a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.",
    "link": "https://www.bbc.com/news/articles/czdjgdnjnlgo",
    "timestamp": "2025-09-25T16:15:14Z"
  },
  {
    "title": "Democrat Senator Says His Party Should Not Tone Down Rhetoric Against ICE Agents After Shooting",
    "description": "Democratic Connecticut Sen. Chris Murphy said on Thursday that his party should continue condemning ICE even after the shooting at a facility in Dallas, Texas.",
    "link": "https://dailycaller.com/2025/09/25/chris-murphy-rhetoric-ice-shooting/",
    "timestamp": "2025-09-25T16:15:05Z"
  },
  {
    "title": "Ukraine Pitches First Energy Projects Under US Resources Pact",
    "description": "Ukraine’s biggest oil and gas company is pitching several projects that could be among the first under a resource deal with the US to shore up its wartime economy and help secure support from President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-pitches-first-energy-projects-under-us-resources-pact",
    "timestamp": "2025-09-25T16:15:00Z"
  },
  {
    "title": "Stephen Miller Claims Simply Calling Trump Authoritarian 'Incites Violence and Terrorism'",
    "description": "Stephen Miller, the White House's deputy chief of staff, signaled how far he is willing to go to criminalize dissent against President Donald Trump in a social media post on Wednesday in which he implied that merely describing the president's actions as \"auth…",
    "link": "https://www.commondreams.org/news/miller-says-criticism-of-trump-is-violence",
    "timestamp": "2025-09-25T16:14:49Z"
  },
  {
    "title": "Fox News Host Says Trump Made Jimmy Kimmel ‘Unfireable’ Even If ‘Three People Are Watching’",
    "description": "Fox News host Jessica Tarlov argued President Donald Trump has essentially made Jimmy Kimmel \"unfireable\" following the late night comedian's suspension.\nThe post Fox News Host Says Trump Made Jimmy Kimmel ‘Unfireable’ Even If ‘Three People Are Watching’ firs…",
    "link": "https://www.mediaite.com/media/tv/fox-news-host-says-trump-made-jimmy-kimmel-unfireable-even-if-three-people-are-watching/",
    "timestamp": "2025-09-25T16:14:29Z"
  },
  {
    "title": "Disney shareholders demand company turn over documents related to Jimmy Kimmel suspension: report",
    "description": "American Federation of Teachers, Reporters Without Borders and other groups pressed Disney to release board records surrounding Kimmel’s suspension.",
    "link": "https://nypost.com/2025/09/25/business/disney-shareholders-demand-company-documents-on-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-25T16:13:20Z"
  },
  {
    "title": "DeChambeau yearns to face McIlroy, sees Trump as Cup force",
    "description": "Bryson DeChambeau sees President Donald Trump as a motivational force for United States golfers in the 45th Ryder Cup at Bethpage Black, where he longs to face Europe's Rory McIlroy.There has been verbal sparring between DeChambeau and McIlroy since the Maste…",
    "link": "https://sports.yahoo.com/article/dechambeau-yearns-face-mcilroy-sees-161245251.html",
    "timestamp": "2025-09-25T16:12:45Z"
  },
  {
    "title": "Trump: I am very disappointed in Putin",
    "description": "United States President Donald Trump expressed on Thursday his disappointment with Russian President Vladimir Putin, regarding the lack of progress toward resolving the war in Ukraine.\"With all of the...",
    "link": "https://biztoc.com/x/40edb011351d6c7f",
    "timestamp": "2025-09-25T16:11:53Z"
  },
  {
    "title": "Trump teases 'major announcement' on Syria today",
    "description": "United States President Donald Trump revealed that there would be a \"major announcement\" regarding Syria today, during his meeting with Turkish President Recep Tayyip Erdogan at the White House on Thu...",
    "link": "https://biztoc.com/x/ba6c52616e41fb83",
    "timestamp": "2025-09-25T16:11:52Z"
  },
  {
    "title": "Trump blames 'radical left' for ICE facility shooting",
    "description": "United States President Donald Trump said on Thursday that the \"radical left\" was to blame for the recent deadly shooting at the Dallas Immigration and Customs Enforcement (ICE) field office and simil...",
    "link": "https://biztoc.com/x/9f7b967ff2f746a7",
    "timestamp": "2025-09-25T16:11:45Z"
  },
  {
    "title": "DNC holds onto decades-old Jeffrey Epstein donations after other Dems returned theirs",
    "description": "The Democratic National Committee retained decades-old donations totaling $32,000 from Jeffrey Epstein, unlike other Democratic people and entities who chose to return them.",
    "link": "https://www.foxnews.com/politics/hold-dnc-holds-onto-decades-old-jeffrey-epstein-donations-after-other-democrats-returned-theirs",
    "timestamp": "2025-09-25T16:11:42Z"
  },
  {
    "title": "Trump Welcomes Turkey's Erdogan to White House",
    "description": "Turkish President Recep Tayyip Erdogan is set to visit the White House for the first time in six years, bringing a slate of deals aimed at repairing the fractious ties between the two members of the North Atlantic Treaty Organization.\nThursday’s meeting with …",
    "link": "https://biztoc.com/x/e6ed469430a72af5",
    "timestamp": "2025-09-25T16:11:29Z"
  },
  {
    "title": "Former Fed chairs warn that removing Lisa Cook could lead to inflation boom",
    "description": "A group of the country's top economic leaders, including every living former Federal Reserve chair, filed an amicus brief with the Supreme Court on Thursday in support of Fed governor Lisa Cook, who President Donald Trump is seeking to remove",
    "link": "https://biztoc.com/x/413d798beb3d96cb",
    "timestamp": "2025-09-25T16:11:29Z"
  },
  {
    "title": "Jeffrey Goldberg Wins 2025 John Chancellor Award from Columbia Journalism School",
    "description": "The Chancellor Award is presented to a journalist for their cumulative accomplishments",
    "link": "https://www.theatlantic.com/press-releases/archive/2025/09/jeffrey-goldberg-wins-2025-john-chancellor-award/684364/",
    "timestamp": "2025-09-25T16:10:44Z"
  },
  {
    "title": "White House dares Democrats with nuclear response to looming shutdown",
    "description": "While Democrats continue to dig their heels in ahead of the looming deadline to avert a government shutdown, the White House has made clear that the administration is willing to go nuclear. The Office of Management and Budget, headed by Director Russell Vough…",
    "link": "https://www.theblaze.com/news/white-house-dares-democrats-with-nuclear-response-to-looming-shutdown",
    "timestamp": "2025-09-25T16:10:00Z"
  },
  {
    "title": "MAGA superintendent flees Fox interview as he's grilled on resignation",
    "description": "Oklahoma Superintendent of Public Instruction Ryan Walters fled Fox studios as a reporter tried to question him about his decision to resign.Anchor Wendy Suares said KOKH allowed Walters to use its studios to do an interview with Fox News on Thursday. In the …",
    "link": "https://www.rawstory.com/ryan-walters-2674039663/",
    "timestamp": "2025-09-25T16:09:32Z"
  },
  {
    "title": "Transcript: Kimmel Showed the Rest of the Media How to Fight Trump",
    "description": "The following is a lightly edited transcript of the September 24 episode ofRight Now With Perry Bacon. You can watch this interview here.Perry Bacon: Good morning, everybody. I’m Perry Bacon. I’m the host of the New Republic Show Right Now. I’m really excited…",
    "link": "https://newrepublic.com/article/200902/transcript-kimmel-showed-rest-media-fight-trump",
    "timestamp": "2025-09-25T16:07:28Z"
  },
  {
    "title": "Barack Obama to be conferred with freedom of Dublin at ceremony on Thursday",
    "description": "Proposal to grant honour to former US president and his wife Michelle was passed by council in 2017",
    "link": "https://www.irishtimes.com/ireland/dublin/2025/09/25/barack-obama-to-be-conferred-with-freedom-of-dublin-at-ceremony-on-thursday/",
    "timestamp": "2025-09-25T16:07:20Z"
  },
  {
    "title": "What we know about how a government shutdown would unfold",
    "description": "Prospects for a last-minute compromise look rather bleak.",
    "link": "https://www.bostonherald.com/2025/09/25/congress-shutdown-explained/",
    "timestamp": "2025-09-25T16:06:46Z"
  },
  {
    "title": "What we know about how a government shutdown would unfold",
    "description": "Prospects for a last-minute compromise look rather bleak.",
    "link": "https://www.denverpost.com/2025/09/25/congress-shutdown-explained/",
    "timestamp": "2025-09-25T16:06:46Z"
  },
  {
    "title": "Dr. Ben Carson Joins Trump Administration in Department of Agriculture Advisory Role",
    "description": "Dr. Ben Carson joined the second Trump administration on Wednesday in an advisory role at the Department of Agriculture.\nThe post Dr. Ben Carson Joins Trump Administration in Department of Agriculture Advisory Role appeared first on Breitbart.",
    "link": "https://www.breitbart.com/health/2025/09/25/dr-ben-carson-joins-trump-administration-department-agriculture-advisory-role/",
    "timestamp": "2025-09-25T16:05:32Z"
  },
  {
    "title": "FIFA, UEFA Under Pressure as Calls Grow to Exclude Israel From Global Soccer",
    "description": "UEFA is moving toward a vote on suspending Israel’s soccer federation, a decision that could block its national and club teams from international competitions.",
    "link": "https://www.israelnationalnews.com/news/415414",
    "timestamp": "2025-09-25T16:05:22Z"
  },
  {
    "title": "FBI: ICE Shooting Suspect Searched ‘Charlie Kirk Shot Video’",
    "description": "The initial investigation into Wednesday’s shooting at the immigration detention facility in Dallas reveals “a high degree of pre-attack planning,” according to FBI director Kash Patel.... Read More\nThe post FBI: ICE Shooting Suspect Searched ‘Charlie Kirk Sh…",
    "link": "https://www.dailysignal.com/2025/09/25/fbi-ice-shooting-suspect-searched-charlie-kirk-shot-video/",
    "timestamp": "2025-09-25T16:04:30Z"
  },
  {
    "title": "Prosecutors' memo to new US attorney advised against plans to charge Comey: Sources",
    "description": "In a memo this week, prosecutors in Virginia recommended against potential plans by the new U.S. attorney there to charge ex-FBI Director James Comey, sources say.",
    "link": "https://abcnews.go.com/US/prosecutors-memo-new-us-attorney-recommended-plans-charge/story?id=125925246",
    "timestamp": "2025-09-25T16:03:42Z"
  },
  {
    "title": "Democrats Submit Bill Aimed at Limiting GOP’s Mid-Census Gerrymandering Scheme",
    "description": "Several GOP-led states are hoping to mitigate midterm losses by redistricting their maps before the next census.",
    "link": "https://truthout.org/articles/democrats-submit-bill-aimed-at-limiting-gops-mid-census-gerrymandering-scheme/",
    "timestamp": "2025-09-25T16:03:15Z"
  },
  {
    "title": "Democrats double down on health care demands with government shutdown days away",
    "description": "Democratic leaders insist that any funding legislation must extend the ACA's enhanced tax credits, which are due to expire at the end of the year.",
    "link": "https://www.cnbc.com/2025/09/25/trump-healthcare-government-shutdown-congress.html",
    "timestamp": "2025-09-25T16:01:44Z"
  }
]