[
  {
    "title": "Ukraine, US and Russia: do rare trilateral talks mean peace is possible?",
    "description": "Rush to meet signals potential agreement but scepticism of Russian motives remain",
    "link": "https://theweek.com/world-news/ukraine-us-russia-trilateral-talks-uae-peace",
    "timestamp": "2026-01-23T13:19:22Z"
  },
  {
    "title": "‘The ultimate insult’: Trump downplaying NATO’s Afghanistan involvement causes distress in UK",
    "description": "Donald Trump provoked outrage and distress in the U.K. with his suggestion that troops from NATO countries stayed away from the frontline.",
    "link": "https://www.bostonherald.com/2026/01/23/trump-nato-afghanistan-uk-distress/",
    "timestamp": "2026-01-23T13:14:41Z"
  },
  {
    "title": "Trump sues JPMorgan, Intel's soft guidance, TikTok's joint venture and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2026/01/23/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2026-01-23T13:13:58Z"
  },
  {
    "title": "\"Emperor\" Trump's So-Called Board of Peace Erases Palestinians from Gaza Governance",
    "description": "As President Donald Trump formally inaugurated his so-called Board of Peace at the World Economic Forum in Davos, Switzerland, on Thursday, his son-in-law Jared Kushner presented his vision of turning the Gaza Strip into an upscale seaside resort with gleamin…",
    "link": "https://www.democracynow.org/2026/1/23/trump_kushner_gaza_plan_catastrophic_success",
    "timestamp": "2026-01-23T13:13:33Z"
  },
  {
    "title": "TikTok Finalizes Deal With US to Avoid Ban: What to Know",
    "description": "The United States and China have signed off on a deal that hands control of TikTok’s U.S. operations to a group of American investors. It’s a milestone moment for TikTok after years of battles that began in 2020 when President Donald Trump wanted to ban the a…",
    "link": "https://www.today.com/video/us-and-china-finalize-tiktok-deal-here-s-what-you-need-to-know-256450117768",
    "timestamp": "2026-01-23T13:12:06Z"
  },
  {
    "title": "Outrage after Trump claims NATO troops avoided Afghan front line",
    "description": "Britain has strongly criticized Donald Trump for his remarks about NATO troops in Afghanistan. Trump claimed allied soldiers did not fight on the front lines. This statement angered Britain, which lost 457 soldiers in the conflict. Prime Minister Keir Starmer…",
    "link": "https://economictimes.indiatimes.com/news/defence/outrage-after-trump-claims-nato-troops-avoided-afghan-front-line/articleshow/127285718.cms",
    "timestamp": "2026-01-23T13:11:59Z"
  },
  {
    "title": "Economic leaders say global growth is resilient despite disruption from Trump",
    "description": "The global economy is growing and showing unexpected resilience despite the noise from Donald Trump.",
    "link": "https://www.twincities.com/2026/01/23/economic-leaders-economy-resilient-trump/",
    "timestamp": "2026-01-23T13:11:46Z"
  },
  {
    "title": "US Murder Rate Plunges to Lowest Level in Over a Century Under Trump",
    "description": "The average reported homicide rate declined 21 percent in 35 major U.S. cities in 2025, marking the largest one-year drop of all time.",
    "link": "https://www.westernjournal.com/us-murder-rate-plunges-lowest-level-century-trump/",
    "timestamp": "2026-01-23T13:11:45Z"
  },
  {
    "title": "Purdue blocks admission of many Chinese grad students in unwritten policy",
    "description": "In an unprecedented step for a major research university, Purdue University has begun to curb the flow of Chinese graduate students to its Indiana campuses. The policy follows pressure from Congress and President Donald Trump for U.S. institutions to monitor …",
    "link": "https://freerepublic.com/focus/f-chat/4363553/posts",
    "timestamp": "2026-01-23T13:11:07Z"
  },
  {
    "title": "Taiwan looks forward to more chip investment in Arizona, president says",
    "description": "Taiwan's President Lai Ching-te met with US Senator Ruben Gallego. He expressed anticipation for more semiconductor investment in Arizona. This move aims to bolster ties with the United States. TSMC is already investing significantly in Phoenix. Taiwan and th…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/taiwan-looks-forward-to-more-chip-investment-in-arizona-president-says/articleshow/127285176.cms",
    "timestamp": "2026-01-23T13:09:55Z"
  },
  {
    "title": "Journalist unpacks Stephen Miller’s chilling message to ICE agents: 'It's very striking'",
    "description": "Instances of federal immigration officers firing or drawing guns have surged\r\n under President Donald Trump’s second term, a trend investigative journalist Caitlin Dickerson linked to a recent chilling message from top Trump aide Stephen Miller.Appearing on T…",
    "link": "https://www.rawstory.com/ice-2675008440/",
    "timestamp": "2026-01-23T13:09:15Z"
  },
  {
    "title": "Texas and Oklahoma brace for heavy snow and crippling ice",
    "description": "Forecasters say over half the U.S. population could be affected by snow, ice or bitter cold as a winter storm sweeps across the county",
    "link": "https://www.wsbradio.com/news/texas-oklahoma-brace/OILGWZCZWIYJVEGFJ4SF6OZ6IM/",
    "timestamp": "2026-01-23T13:07:52Z"
  },
  {
    "title": "The Download: chatbots for health, and US fights over AI regulation",
    "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. “Dr. Google” had its issues. Can ChatGPT Health do better?   For the past two decades, there’s been a clear first step fo…",
    "link": "https://www.technologyreview.com/2026/01/23/1131708/the-download-chatbots-for-health-and-us-fights-over-ai-regulation/",
    "timestamp": "2026-01-23T13:07:00Z"
  },
  {
    "title": "Trump claim on NATO role in Afghanistan draws UK condemnation",
    "description": "UK politicians have accused Trump of avoiding military service during the Vietnam War.",
    "link": "https://www.aljazeera.com/news/2026/1/23/trump-claim-on-nato-role-in-afghanistan-draws-condemnation",
    "timestamp": "2026-01-23T13:04:39Z"
  },
  {
    "title": "Economic leaders at Davos say global growth is resilient despite disruption from Trump",
    "description": "The global economy is growing and showing unexpected resilience despite the noise from Donald Trump.",
    "link": "https://www.bostonherald.com/2026/01/23/economic-leaders-economy-resilient-trump/",
    "timestamp": "2026-01-23T13:02:33Z"
  },
  {
    "title": "‘Makes No Political Sense!’ Joe Scarborough Warns Republicans Will ‘Lose’ Against Jack Smith ‘Every Time’",
    "description": "Scarborough argued there were other cases brought against Trump that Republicans could challenge, but Smith was a bad call.\nThe post ‘Makes No Political Sense!’ Joe Scarborough Warns Republicans Will ‘Lose’ Against Jack Smith ‘Every Time’ first appeared on Me…",
    "link": "https://www.mediaite.com/media/tv/makes-no-political-sense-joe-scarborough-warns-republicans-will-lose-against-jack-smith-every-time/",
    "timestamp": "2026-01-23T13:02:12Z"
  },
  {
    "title": "The future of Greenland is America",
    "description": "Europe cannot be trusted to keep out Russia and China from Greenland. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421373",
    "timestamp": "2026-01-23T13:02:06Z"
  },
  {
    "title": "Voltaire, International Newsletter N°159",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. \nVoltaire, International Newsletter i…",
    "link": "https://www.voltairenet.org/article223560.html",
    "timestamp": "2026-01-23T13:01:00Z"
  },
  {
    "title": "Why Latin America Has Been Demure in Davos",
    "description": "U.S. aggression is nothing new for the region.",
    "link": "http://foreignpolicy.com/2026/01/23/latin-america-davos-carney-global-order-us-trump-economy/",
    "timestamp": "2026-01-23T13:00:51Z"
  },
  {
    "title": "Posthaste: Stock markets digest another TACO in high-wire week that leaves world breathing easier — for now",
    "description": "Investors found their feet again as Trump backed down on Greenland and tariff threats and took some hits in his attacks on the Fed. Read on.",
    "link": "https://financialpost.com/news/stock-markets-digest-another-taco-high-wire-week",
    "timestamp": "2026-01-23T13:00:37Z"
  },
  {
    "title": "'Armada' Heading Toward Iran...",
    "description": "The U.S. president said a “massive“ naval force is going towards Islamic Republic.",
    "link": "https://www.newsweek.com/donald-trump-warns-of-armada-heading-to-iran-11404867",
    "timestamp": "2026-01-23T13:00:12Z"
  },
  {
    "title": "Military Buildup In Middle East Continues...",
    "description": "The aircraft carrier USS Abraham Lincoln is on its way to the Middle East while additional air defenses are flowing into the region as well.",
    "link": "http://www.twz.com/news-features/military-buildup-in-the-middle-east-continues-including-what-trump-describes-as-a-big-flotilla",
    "timestamp": "2026-01-23T13:00:12Z"
  },
  {
    "title": "Trump’s new Board of Peace logo feels like a parody",
    "description": "Critics claim it’s \"AI slop”.",
    "link": "https://www.creativebloq.com/design/logos-icons/trumps-new-board-of-peace-logo-feels-like-a-parody",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "Guess When Catholic Cardinals Are Touted for Their Moral Authority?",
    "description": "Leftist media outlets take an extremely opportunistic approach to covering the intersection of religion and politics. They’re appalled at religion when it impedes their agenda,... Read More\nThe post Guess When Catholic Cardinals Are Touted for Their Moral Aut…",
    "link": "https://www.dailysignal.com/2026/01/23/guess-when-catholic-cardinals-are-touted-for-their-moral-authority/",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "Trump’s Greenland Takeover Could Be Silicon Valley’s Libertarian Dream Come True",
    "description": "Tech billionaires have long dreamed of creating industrial colonies with no government oversight, and they see opportunity in Trump's expansionism.",
    "link": "http://www.rollingstone.com/culture/culture-features/greenland-silicon-valley-libertarian-trump-1235502736/",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "British troops were in Afghanistan from start to finish - despite what Trump says",
    "description": "Despite Donald Trump's comments over troops from NATO countries in Afghanistan, it was British troops who were there alongside the US until the end.",
    "link": "https://news.sky.com/story/british-troops-were-in-afghanistan-from-start-to-finish-despite-what-trump-says-13498041",
    "timestamp": "2026-01-23T12:57:00Z"
  },
  {
    "title": "Trump Baselessly Claims NATO Troops Stayed ‘Off The Frontlines’ In Afghanistan",
    "description": "The president also suggested the U.S. should have “put NATO to the test” to advance his domestic agenda.",
    "link": "https://www.huffpost.com/entry/donald-trump-questions-nato-troops-sacrifice_n_69735afae4b0283a09774fbe",
    "timestamp": "2026-01-23T12:55:42Z"
  },
  {
    "title": "Greenland galvanises Europe to confront new US reality",
    "description": "Europe may have rallied to see off President Donald Trump over Greenland, but its leaders recognise the confrontation is unlikely to be the last in dealings with his increasingly strident version of the US.",
    "link": "https://www.rte.ie/news/business/2026/0123/1554709-greenland-galvanises-europe-to-confront-new-us-reality/",
    "timestamp": "2026-01-23T12:55:34Z"
  },
  {
    "title": "TikTok Deal Will Keep It Online in the US, but Your Experience of the App Might Change",
    "description": "TikTok has secured its future by agreeing to split the US app from the global business. But the deal will spark changes to how the app's algorithm works.",
    "link": "https://www.cnet.com/tech/services-and-software/tiktok-strikes-deal-with-white-house-to-split-off-us-app/",
    "timestamp": "2026-01-23T12:54:40Z"
  },
  {
    "title": "Trump angers allies with claim NATO troops ‘stayed a little back’ from frontlines in Afghanistan | CNN",
    "description": "US President Donald Trump has once again questioned whether NATO allies would “be there” if the United States “ever needed them,” claiming that the alliance’s troops “stayed a little back” from the frontlines in Afghanistan.",
    "link": "https://www.cnn.com/2026/01/23/world/trump-nato-afghanistan-frontlines-intl",
    "timestamp": "2026-01-23T12:53:17Z"
  },
  {
    "title": "The underside of the Chagos Islands retrocession",
    "description": "• British Prime Minister Keir Starmer announced the return of the Chagos Islands to the archipelago of Mauritius (cf. VIN 2252). A $139 million annual lease has been signed for the Diego Garcia military base, for 99 years. According to Starmer, it is essentia…",
    "link": "https://www.voltairenet.org/article223559.html",
    "timestamp": "2026-01-23T12:49:31Z"
  },
  {
    "title": "This Trump ploy isn't just scandalously unethical: it's yet another impeachable offense",
    "description": "This isn’t merely scandalous or unethical: it’s impeachable on its face and dangerous to the survival of democracy worldwide.Donald Trump is trying to use a United Nations resolution to justify making himself King of the World via a new “Board of Peace” that …",
    "link": "https://www.rawstory.com/raw-investigates/this-trump-gambit-isn-t-just-scandalously-unethical-it-s-yet-another-impeachable-offense/",
    "timestamp": "2026-01-23T12:48:45Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to Friday, January 23, 2026—the end of the coldest work week of the past year.  Here’s today’s weather, with temperatures in Fahrenheit (!) and the prediction for the next week: And it’s National Pie Day, celebrating another contribution of America to…",
    "link": "https://whyevolutionistrue.com/2026/01/23/friday-hili-dialogue-560/",
    "timestamp": "2026-01-23T12:45:50Z"
  },
  {
    "title": "Meloni joins Merz in urging ‘swift implementation’ of EU-Mercosur trade deal",
    "description": "More than 20 ministers from Italy and Germany are meeting at an opulent Roman villa to discuss closer cooperation.",
    "link": "https://www.politico.eu/article/meloni-joins-merz-in-calling-for-swift-implementation-of-eu-mercosur-trade-deal/",
    "timestamp": "2026-01-23T12:45:07Z"
  },
  {
    "title": "Trump 0, Europe 1 — Ignorance and contempt lose a round — As I wrote yesterday ... (Paul Krugman)",
    "description": "Paul Krugman:\nTrump 0, Europe 1  —  Ignorance and contempt lose a round  —  As I wrote yesterday, Donald Trump and his team clearly went to Davos determined to demean and insult their hosts.  It was, one might say, a novel approach to diplomacy: “You're pathe…",
    "link": "https://www.memeorandum.com/260123/p12",
    "timestamp": "2026-01-23T12:45:00Z"
  },
  {
    "title": "US-EU ties have taken ‘a big blow’ – Kallas",
    "description": "US-EU relations have “taken a big blow” amid Donald Trump’s insistence on acquiring Greenland, top diplomat Kaja Kallas has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631395-us-eu-ties-blow-kallas/",
    "timestamp": "2026-01-23T12:44:51Z"
  },
  {
    "title": "US residents could be justified in shooting federal agents – Democratic official",
    "description": "Arizona’s top prosecutor claims that state law could justify lethal force against masked ICE agents Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631411-us-democrat-shoot-ice/",
    "timestamp": "2026-01-23T12:41:50Z"
  },
  {
    "title": "More than 5,000 killed in recent protests in Iran, rights group says, as regime rejects Trump claims",
    "description": "Iran's top prosecutor on Friday called U.S. President Donald Trump's repeated claims that he halted the hangings of 800 detained protesters there \"completely false.\" Meanwhile, the overall death toll from a bloody crackdown on nationwide demonstrations rose t…",
    "link": "https://www.cbc.ca/news/world/iran-protests-death-toll-trump-claims-9.7057574",
    "timestamp": "2026-01-23T12:41:07Z"
  },
  {
    "title": "Trump says Greenland framework includes mineral rights. What minerals does the island have?",
    "description": "Donald Trump says a possible deal over Greenland could involve mineral rights.",
    "link": "https://www.bbc.com/news/articles/cly9230yw15o",
    "timestamp": "2026-01-23T12:39:51Z"
  },
  {
    "title": "Militarising the Sahel will not defeat terrorism",
    "description": "Escalating force and rival security blocs are turning counterterrorism into a recipe for conflict.",
    "link": "https://www.aljazeera.com/opinions/2026/1/23/militarising-the-sahel-will-not-defeat-terrorism",
    "timestamp": "2026-01-23T12:39:00Z"
  },
  {
    "title": "US completes withdrawal from World Health Organization",
    "description": "The decision follows President Donald Trump's announcement a year ago.",
    "link": "https://www.weau.com/2026/01/23/us-completes-withdrawal-world-health-organization/",
    "timestamp": "2026-01-23T12:38:53Z"
  },
  {
    "title": "'The ultimate insult': Trump downplaying NATO's Afghanistan involvement causes distress in UK",
    "description": "U.S. President Donald Trump has provoked outrage and distress in the U.K. with his suggestion that troops from NATO countries stayed away from the frontline during the war in Afghanistan",
    "link": "https://abcnews.go.com/International/wireStory/ultimate-insult-trump-downplaying-natos-afghanistan-involvement-causes-129485391",
    "timestamp": "2026-01-23T12:37:47Z"
  },
  {
    "title": "Kash Patel purges more FBI agents hours after volatile Jack Smith hearing: report",
    "description": "Hours after the contentious House Judiciary Committee hearing, where former special counsel Jack Smith testified as Democrats and Republicans battled each other over Donald Trump’s incitement of the Jan. 6 insurrection, FBI Director Kash Patel once again went…",
    "link": "https://www.rawstory.com/patel-agent-purge-jack-smith/",
    "timestamp": "2026-01-23T12:37:37Z"
  },
  {
    "title": "Economic leaders at Davos say global growth is resilient despite disruption from Trump",
    "description": "Leading global economic policymakers at the World Economic Forum in Davos urged countries and businesses to filter out the turmoil from a week of clashes with the Trump administration and focus on boosting growth and fighting inequality in a world wher...",
    "link": "https://abcnews.go.com/Business/wireStory/economic-leaders-davos-global-growth-resilient-despite-disruption-129485660",
    "timestamp": "2026-01-23T12:37:26Z"
  },
  {
    "title": "Donald Trump had a huge bruise on his left hand at the ‘Board of Peace’ event",
    "description": "Embed from Getty Images The photos in this post are from Thursday in Davos. Donald Trump attended an event for the “Board of Peace” for Gaza. Jared Kushner did a big-boy presentation for his “New Gaza” plans, which include putting up skyscraper hotels and cas…",
    "link": "https://www.celebitchy.com/958544/donald_trump_had_a_huge_bruise_on_his_left_hand_at_the_board_of_peace_event/",
    "timestamp": "2026-01-23T12:35:50Z"
  },
  {
    "title": "Qatari 747 Will Fly as Air Force One in Summer 2026",
    "description": "The Qatari-donated Boeing 747-8 is set to fly as “VC-25 bridge aircraft” by summer 2026, as delays continue to plague Boeing’s VC-25B presidential aircraft program. The U.S. Air Force expects the Boeing 747 gifted by the government of Qatar to begin flying as…",
    "link": "https://theaviationist.com/2026/01/23/qatari-747-interim-air-force-one-vc-25-bridge/",
    "timestamp": "2026-01-23T12:35:00Z"
  },
  {
    "title": "Doctor Makes Concerning Claims About Donald Trump’s Cognitive Health, Says Symptoms Are Worsening",
    "description": "Doctor Makes Concerning Claims About Donald Trump’s Cognitive Health, Says Symptoms Are Worseninginquisitr.com",
    "link": "https://www.inquisitr.com/doctor-makes-concerning-claims-about-donald-trumps-cognitive-health-says-symptoms-are-worsening",
    "timestamp": "2026-01-23T12:34:40Z"
  },
  {
    "title": "Greenland galvanizes Europe to confront new US reality",
    "description": "Europe learns to confront U.S. challenges post-Trump, emphasizing unity and strategic independence amid rising geopolitical tensions.",
    "link": "https://www.thehindubusinessline.com/news/world/greenland-galvanizes-europe-to-confront-new-us-reality/article70542539.ece",
    "timestamp": "2026-01-23T12:33:18Z"
  },
  {
    "title": "US Officially Exits World Health Organization",
    "description": "The United States officially left the World Health Organization on Thursday. President Donald Trump began the year-long process on his first day back in office.",
    "link": "https://www.ntd.com/us-officially-exits-world-health-organization_1121292.html",
    "timestamp": "2026-01-23T12:30:37Z"
  },
  {
    "title": "Elon Musk Isn’t an Optimist, He’s a Salesman",
    "description": "At Davos, Musk sold a vision of himsel that doesn't align with reality.",
    "link": "https://gizmodo.com/elon-musk-isnt-an-optimist-hes-a-salesman-2000713014",
    "timestamp": "2026-01-23T12:30:35Z"
  },
  {
    "title": "Jack Smith Defends Investigation Into Trump: Key Takeaways",
    "description": "Former Special Counsel Jack Smith on Thursday testified publicly for the first time in a tense hearing before Congress, defending the two criminal cases he had brought against President Donald Trump. NBC’s Kelly O’Donnell reports for TODAY.",
    "link": "https://www.today.com/video/key-takeaways-from-jack-smith-s-testimony-before-congress-256448581723",
    "timestamp": "2026-01-23T12:27:39Z"
  },
  {
    "title": "Don Lemon baits Pam Bondi: ‘Make me the new Jimmy Kimmel’ after charges fall apart",
    "description": "Lemon interviewed protestors entering a church in Minnesota where an ICE official serves as a pastor",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/don-lemon-charged-church-protest-pam-bondi-b2906333.html",
    "timestamp": "2026-01-23T12:24:59Z"
  },
  {
    "title": "Trump Rescinds Canada's Invite to Join 'Board of Peace' After Spat",
    "description": "NBC News has learned that President Donald Trump has discussed adding troops and more military bases in Greenland to support his Golden Dome missile defense system which is still in its planning stages, according to two former U.S. officials. It comes as Trum…",
    "link": "https://www.today.com/video/trump-rescinds-canada-s-invite-to-join-board-of-peace-after-spat-256447557752",
    "timestamp": "2026-01-23T12:24:44Z"
  },
  {
    "title": "The US has an Arctic warfare problem: not enough of the right kinds of weapons and tools",
    "description": "Military competition between the US and rivals Russia and China in the Arctic is exposing weaknesses in the US arsenal.",
    "link": "https://www.businessinsider.com/us-doesnt-have-enough-right-weapons-tools-arctic-warfare-2026-1",
    "timestamp": "2026-01-23T12:24:01Z"
  },
  {
    "title": "Outrage after Trump claims NATO troops avoided Afghan frontline",
    "description": "LONDON: A UK minister said on Friday (Jan 23) that US President Donald Trump was \"plainly wrong\" to claim that NATO soldiers did not fight on the front line in Afghanistan, as the claim sparked outrage in Britain.In an interview with Fox News aired on Thursda…",
    "link": "https://www.channelnewsasia.com/world/outrage-after-trump-claims-nato-troops-avoided-afghan-frontline-5878926",
    "timestamp": "2026-01-23T12:22:14Z"
  },
  {
    "title": "Outrage after Trump claims NATO troops avoided Afghan front line",
    "description": "LONDON: Britain said Donald Trump was \"wrong to diminish\" the role of NATO troops in Afghanistan, as a claim by the US president that they did not fight on the front line sparked outrage.In an interview with Fox News aired on Thursday (Jan 22), Trump appeared…",
    "link": "https://www.channelnewsasia.com/world/outrage-after-trump-claims-nato-troops-avoided-afghan-front-line-5878926",
    "timestamp": "2026-01-23T12:22:00Z"
  },
  {
    "title": "World order changing, not rupturing, finance chiefs say",
    "description": "DAVOS, Switzerland, Jan 23 (Reuters) - The world order ‌is changing but not enduring a rupture, finance leaders said on Friday, pushing back on Canadian ‌Prime Minister Mark Carney's narrative that a new order, driven by major power coercion, was ‌taking shap…",
    "link": "https://www.thestar.com.my/news/world/2026/01/23/world-order-changing-not-rupturing-finance-chiefs-say",
    "timestamp": "2026-01-23T12:22:00Z"
  },
  {
    "title": "Pelosi scolding Democrats over push to hold Clintons in contempt in Epstein case – CNN",
    "description": "Nancy Pelosi has rebuked Democrats over supporting a vote to hold the Clintons in contempt over refusal to testify on the Epstein probe Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631413-pelosi-scolding-democrats-clintons-contempt/",
    "timestamp": "2026-01-23T12:20:35Z"
  },
  {
    "title": "Greenland jolts Europe into facing a changed America",
    "description": "European leaders are bracing for more confrontations with the United States. Following a dispute over Greenland, they are determined to stand firm. Europe is now focused on strengthening its own economic policies and security alliances. The goal is to reduce …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/greenland-jolts-europe-into-facing-a-changed-america/articleshow/127278923.cms",
    "timestamp": "2026-01-23T12:19:55Z"
  },
  {
    "title": "Trump reveals how he got large bruise on his hand as he trashes health conspiracies",
    "description": "Trump said his latest bruise appeared after he bumped a table at the World Economic Forum in Davos.",
    "link": "https://nypost.com/2026/01/23/us-news/trump-blames-hand-bruise-at-davos-on-aspirin/",
    "timestamp": "2026-01-23T12:19:51Z"
  },
  {
    "title": "Millions of Americans brace for dangerous cold and Trump's 'Board of Peace' concerns allies: Morning Rundown",
    "description": "A dangerous winter storm begins moving across the U.S. What to know about Trump's \"Board of Peace.\" And Vance berates Democrats in a visit to Minneapolis.",
    "link": "https://www.nbcnews.com/news/us-news/americans-brace-storm-cold-trump-board-peace-concerns-morning-rundown-rcna255545",
    "timestamp": "2026-01-23T12:18:03Z"
  },
  {
    "title": "Did Trump make Davos great again?",
    "description": "US President Donald Trump stole the show at the World Economic Forum in Davos, but he may have also made the annual gabfest of the global elite relevant again -- at least for a week. If the World Economic Forum is going to be useful, going forward, it has to …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-trump-make-davos-great-again/articleshow/127279412.cms",
    "timestamp": "2026-01-23T12:15:11Z"
  },
  {
    "title": "TikTok was thriving in the U.S., even before a joint venture saved it from a potential ban",
    "description": "TikTok and other China-linked apps dominated U.S. app downloads in 2025, defying mounting political pressure, trade restrictions and national security scrutiny.",
    "link": "https://www.cnbc.com/2026/01/23/tiktok-other-china-linked-apps-thrived-in-the-us-in-2025-.html",
    "timestamp": "2026-01-23T12:14:16Z"
  },
  {
    "title": "Iranian cleric says Iran may target US investments in region if attacked",
    "description": "DUBAI, Jan 23 (Reuters) - An influential Iranian cleric warned on Friday that Iran may target U.S.-linked investments in the region in retaliation for any U.S. attack on … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/23/iranian-cleric-says-iran-may-target-us-investments-in-region-if-attacked",
    "timestamp": "2026-01-23T12:11:17Z"
  },
  {
    "title": "US removes slavery exhibit following Trump directive",
    "description": "The US National Park Service removed a slavery exhibit in Philadelphia, following a directive from President Trump targeting ‘anti-American ideology’.\n\nRead More: https://punchng.com/us-removes-slavery-exhibit-following-trump-directive/",
    "link": "https://punchng.com/us-removes-slavery-exhibit-following-trump-directive/",
    "timestamp": "2026-01-23T12:08:59Z"
  },
  {
    "title": "FBI Director Kash Patel Purges Agents Tied to Past Trump Probes, MS NOW Reports",
    "description": "News of the alleged oustings by Patel broke just hours after former special counsel Jack Smith testified on Capitol Hill.\nThe post FBI Director Kash Patel Purges Agents Tied to Past Trump Probes, MS NOW Reports first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fbi-director-kash-patel-purges-agents-tied-to-past-trump-probes-ms-now-reports/",
    "timestamp": "2026-01-23T12:07:43Z"
  },
  {
    "title": "Ledger eyes US IPO at $4 billion-plus valuation",
    "description": "Ledger's US IPO could boost global crypto security investments, highlighting the US as a key hub for digital asset innovation and growth.\nThe post Ledger eyes US IPO at $4 billion-plus valuation appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/ledger-ipo-plans-us-listing/",
    "timestamp": "2026-01-23T12:06:55Z"
  },
  {
    "title": "Fury over Trump's slur against British troops: Kemi Badenoch leads attack on president for 'flat-out nonsense' claim that NATO allies 'stayed off the front line' in Afghanistan (Daily Mail)",
    "description": "Daily Mail:\nFury over Trump's slur against British troops: Kemi Badenoch leads attack on president for ‘flat-out nonsense’ claim that NATO allies ‘stayed off the front line’ in Afghanistan  —  Politicians and military veterans have reacted with outrage after …",
    "link": "https://www.memeorandum.com/260123/p8",
    "timestamp": "2026-01-23T12:05:02Z"
  },
  {
    "title": "Gavin Newsom's Davos trip mixed Trump criticism, a USA House snub, and bright-red kneepads",
    "description": "At Davos, the California governor criticized Trump, was blocked from the US pavilion, traded insults, waved kneepads, and fueled 2028 speculation.",
    "link": "https://www.businessinsider.com/gavin-newsom-davos-roundup-trump-clash-denied-entry-presidential-speculation-2026-1",
    "timestamp": "2026-01-23T12:04:51Z"
  },
  {
    "title": "US completes withdrawal from World Health Organization",
    "description": "The decision follows President Donald Trump's announcement a year ago.",
    "link": "https://www.kktv.com/2026/01/23/us-completes-withdrawal-world-health-organization/",
    "timestamp": "2026-01-23T12:03:33Z"
  },
  {
    "title": "Trump was 'wrong to diminish British troops' says Downing Street",
    "description": "Donald Trump was \"wrong to diminish the role of troops, including British forces\" in Afghanistan, Downing Street has said. The prime minister's official spokesperson told political lobby journalists: \"Trump was wrong in diminishing sacrifice as part of NATO i…",
    "link": "https://freerepublic.com/focus/f-news/4363549/posts",
    "timestamp": "2026-01-23T12:02:44Z"
  },
  {
    "title": "Jane Fonda, 88, issues stark warning about the US: ‘We’re seeing things that have never happened before’",
    "description": "The actor spoke about Americans protecting their First Amendment rights",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/trump-jane-fonda-warning-stephen-colbert-b2906375.html",
    "timestamp": "2026-01-23T12:01:03Z"
  },
  {
    "title": "Mexico Created ‘Migrant TV’ to Coordinate Migrant Political Action Inside America",
    "description": "In his new book, Peter Schweizer chronicles the Mexican government’s creation of “Migrant TV” to coordinate migrant political action in the United States.\nThe post Mexico Created ‘Migrant TV’ to Coordinate Migrant Political Action Inside America appeared firs…",
    "link": "https://www.breitbart.com/politics/2026/01/23/mexico-created-migrant-tv-to-coordinate-migrant-political-action-inside-america/",
    "timestamp": "2026-01-23T12:00:38Z"
  },
  {
    "title": "Trump And Co. Are Pushing Whole Milk On America — But Actual Health Experts Raise Some Flags",
    "description": "Trump and RFK Jr. have donned milk mustaches on social media, declaring that \"whole milk is back.\" But is it a good idea for everyone?",
    "link": "https://www.huffpost.com/entry/trump-rfk-whole-milk-healthy_l_697246cce4b0dfed7798d45e",
    "timestamp": "2026-01-23T12:00:18Z"
  },
  {
    "title": "NIH Won’t Fund Research That Uses Aborted Baby Tissue",
    "description": "“Now that there is better technology, there’s no scientific harm to this, we’re still going to be able to use the science we need … while at the same time getting rid of this use of aborted fetal tissue which so many people, including me, find morally abhorre…",
    "link": "https://legalinsurrection.com/2026/01/nih-wont-fund-research-that-uses-aborted-baby-tissue/",
    "timestamp": "2026-01-23T12:00:16Z"
  },
  {
    "title": "What obesity drugmakers see next in the market: More pills, easier access and drug combinations",
    "description": "CNBC spoke to executives from Eli Lilly, Novo Nordisk, Pfizer and other drugmakers at the annual JPMorgan Healthcare Conference in San Francisco.",
    "link": "https://www.cnbc.com/2026/01/23/weight-loss-glp-1-drugs-next-steps-for-eli-lilly-novo-nordisk-pfizer.html",
    "timestamp": "2026-01-23T12:00:01Z"
  },
  {
    "title": "Trump claims he's ended 8 wars. Here are the facts",
    "description": "While speaking to a crowd at the World Economic Forum in Davos, Switzerland, Trump asserted he had \"settled\" more than 8 wars.",
    "link": "https://www.snopes.com//news/2026/01/23/trump-ended-8-wars-claim/",
    "timestamp": "2026-01-23T12:00:00Z"
  },
  {
    "title": "'I Don't Care How Much They Scream': William Wolfe Backs Trump's Violent Deportation Operations",
    "description": "Radical Christian nationalist former Trump administration official William Wolfe backs the brutal ICE deportation operations: \"I don't care how much they scream. I don't care how much they cry.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/i-dont-care-how-much-they-scream-william-wolfe-backs-trumps-violent-deportation",
    "timestamp": "2026-01-23T12:00:00Z"
  },
  {
    "title": "Iranian prosecutor denies Trump’s claim 800 prisoners were spared execution",
    "description": "Iran’s top prosecutor called Donald Trump’s claims about halting the hangings of 800 detained protesters “completely false.”",
    "link": "https://www.bostonherald.com/2026/01/23/iranian-prosecutor-denies-trumps-claim/",
    "timestamp": "2026-01-23T11:59:52Z"
  },
  {
    "title": "'Insanely frustrated': Americans in Germany react to Trump's threats against Europe",
    "description": "Relations between Europe and the US were pushed to the brink of disaster this week by President Donald Trump's recent escalations over Greenland. With tensions still high, we asked Americans in Germany for their thoughts.",
    "link": "https://www.thelocal.de/20260123/insanely-frustrated-americans-in-germany-react-to-trumps-threats-against-europe",
    "timestamp": "2026-01-23T11:59:08Z"
  },
  {
    "title": "Revolut scraps US merger plans in favour of push for standalone licence",
    "description": "UK-headquartered fintech had hoped to secure a banking charter through buying an American lender",
    "link": "https://www.irishtimes.com/business/2026/01/23/revolut-scraps-us-merger-plans-in-favour-of-push-for-standalone-licence/",
    "timestamp": "2026-01-23T11:57:37Z"
  },
  {
    "title": "Trump threatens Iran with US fleet as death toll rises",
    "description": "An internet blackout has cut off Iran from the outside world but reports of soaring death tolls are trickling out of the country. US President Donald Trump said the US was sending a \"massive fleet\" to the region. US President Donald Trump renewed the threat o…",
    "link": "https://www.dw.com/en/trump-threatens-iran-with-us-fleet-as-death-toll-rises/a-75618396",
    "timestamp": "2026-01-23T11:57:00Z"
  },
  {
    "title": "Few Are Spared as Trump Unleashes Dozens of Truth Social Posts in Post-Davos Midnight Barrage",
    "description": "Trump fired off more than 70 posts and reposts between 12:40 a.m. to 1:30 a.m. ET in a flurry just hours after flying back to DC from Davos, Switzerland.\nThe post Few Are Spared as Trump Unleashes Dozens of Truth Social Posts in Post-Davos Midnight Barrage fi…",
    "link": "https://www.mediaite.com/online/few-are-spared-as-trump-unleashes-dozens-of-truth-social-posts-in-post-davos-midnight-barrage/",
    "timestamp": "2026-01-23T11:56:36Z"
  },
  {
    "title": "Trump and Newsom seen engaging in 'friendly banter' backstage: 'Gavin, we're good'",
    "description": "President Donald Trump and California Gov. Gavin Newsom engaged in a public war of words this week in Davos, Switzerland, but a Washington, D.C., insider revealed the pair indulged in some friendly backstage backslapping.Trump called out Newsom during his spe…",
    "link": "https://www.rawstory.com/trump-newsom-davos/",
    "timestamp": "2026-01-23T11:55:46Z"
  },
  {
    "title": "UBS Plans Crypto Trading for Some Clients in Digital-Asset Push",
    "description": "UBS would initially allow select clients of its private bank in Switzerland to buy and sell Bitcoin and Ether, one of the people said. The offering may then be rolled out in markets like the Asia-Pacific region and the US, according to the person.",
    "link": "https://www.ndtvprofit.com/markets/ubs-plans-crypto-trading-for-some-clients-in-digital-asset-push-10859930",
    "timestamp": "2026-01-23T11:55:21Z"
  },
  {
    "title": "Wind and solar overtake fossil fuels in EU power supply",
    "description": "Wind and solar power produced more electricity than fossil fuels in the EU for the first time last year.",
    "link": "https://www.rte.ie/news/world/2026/0123/1554694-wind-solar-eu/",
    "timestamp": "2026-01-23T11:51:47Z"
  }
]