[
  {
    "title": "Macy's slashes profit forecast, says tariffs dampen outlook",
    "description": "Macy's slashes profit forecast, says tariffs dampen outlook\nThe retailer is the latest company to warn of ill effects from tariffs.\nMacy's slashed its full-year profit forecast on Wednesday, attributing the downbeat expectations in part to tariffs imposed by …",
    "link": "https://biztoc.com/x/ff0a24a232ed0dd9",
    "timestamp": "2025-05-28T15:52:34Z"
  },
  {
    "title": "Longtime Democrat senator's daughter takes aim at Trump, Musk, RFK Jr, in launch for key House swing seat",
    "description": "Stefany Shaheen, daughter of Sen. Jeanne Shaheen, announces her candidacy for New Hampshire's 1st Congressional District, focusing on healthcare advocacy.",
    "link": "https://www.foxnews.com/politics/senators-daughter-stefany-shaheen-launches-congressional-bid-attacks-trump-musk",
    "timestamp": "2025-05-28T15:52:25Z"
  },
  {
    "title": "New York High Schooler Arrested by ICE at Court",
    "description": "Dylan, a student at Ellis Preparatory Academy in the Bronx, was detained on May 21 after a routine immigration court hearing.",
    "link": "https://www.newsweek.com/new-york-high-school-student-detained-ice-immigration-court-2078018",
    "timestamp": "2025-05-28T15:51:41Z"
  },
  {
    "title": "Judge refuses to toss states’ lawsuit against Elon Musk and DOGE",
    "description": "U.S. District Judge Tanya Chutkan ruled Tuesday that 14 states can proceed with their claims against Musk and DOGE.",
    "link": "https://www.pbs.org/newshour/politics/a-judge-refuses-to-toss-states-lawsuit-against-elon-musk-and-doge",
    "timestamp": "2025-05-28T15:51:08Z"
  },
  {
    "title": "Grand Theft Auto's Publisher Swaps DEI for 'Diversity of Thought' in Annual Report",
    "description": "Take-Two’s latest 10-K report has removed any mention of supporting social justice and LGBT+ rights, as more industries fall in line with President Donald Trump’s anti-DEI agenda.",
    "link": "https://www.wired.com/story/grand-theft-autos-publisher-abandons-dei-for-diversity-of-thought-in-annual-report/",
    "timestamp": "2025-05-28T15:51:08Z"
  },
  {
    "title": "Meet The Mortgage Company Enabling Illegal Immigrants To Buy American Homes",
    "description": "After decades of mass illegal immigration into the United States, untold millions of illegal aliens have settled throughout the country, competing with Americans for government benefits, jobs, and now, for homes. For most illegal aliens, obtaining a mortgage …",
    "link": "https://freerepublic.com/focus/f-bloggers/4319553/posts",
    "timestamp": "2025-05-28T15:50:46Z"
  },
  {
    "title": "Bonus Quote of the Day",
    "description": "\"The guy’s an asshole. And he’s intentionally an asshole.\" -- Chuck Todd, talking to Chris Cillizza about Donald Trump.",
    "link": "https://politicalwire.com/2025/05/28/bonus-quote-of-the-day-2198/",
    "timestamp": "2025-05-28T15:49:44Z"
  },
  {
    "title": "Norway To Randomly Select 100,000 Millennials, Gen Z For Tax Cuts",
    "description": "Norway's government is exploring ways to boost participation in the labor market.",
    "link": "https://www.newsweek.com/norway-tax-cuts-millenials-gen-z-2077979",
    "timestamp": "2025-05-28T15:48:17Z"
  },
  {
    "title": "Trump Spox Karoline Leavitt Takes Shot at CNN Over Bias in Fox News Hit",
    "description": "Karoline Leavitt lashed out at CNN over her perception of their bias as she complained to Fox's Sean Hannity about their Trump vs. Harvard coverage.\nThe post Trump Spox Karoline Leavitt Takes Shot at CNN Over Bias in Fox News Hit first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-spox-karoline-leavitt-takes-shot-at-cnn-over-bias-in-fox-news-hit/",
    "timestamp": "2025-05-28T15:47:59Z"
  },
  {
    "title": "Linda McMahon Says Colleges Must Be 'In Sync' with Trump Administration",
    "description": "Harvard is defying a demand by the White House to make reforms of its governance, admissions and student discipline processes.",
    "link": "https://www.newsweek.com/linda-mcmahon-says-colleges-must-sync-trump-administration-2078065",
    "timestamp": "2025-05-28T15:45:53Z"
  },
  {
    "title": "Sanctions Helping Ukraine Would Restore America’s Global Standing, Lindsey Graham Has Claimed",
    "description": "Lindsey Graham has claimed that his plan to hit Russia's trade partners with 500% tariffs would help Trump push Moscow towards a peace deal with Ukraine. \nThe post Sanctions Helping Ukraine Would Restore America’s Global Standing, Lindsey Graham Has Claimed a…",
    "link": "https://www.globalresearch.ca/sanctions-helping-ukraine-restore-america-global-standing/5888561",
    "timestamp": "2025-05-28T15:45:33Z"
  },
  {
    "title": "Trump says Canada's Golden Dome membership costs $61 billion — or free as 51st state",
    "description": "U.S. President Donald Trump says Canada can join his Golden Dome defence program for $61 billion or free if it becomes the 51st state.",
    "link": "https://nationalpost.com/news/canada/trump-golden-dome-canada-61-billion-51st-state",
    "timestamp": "2025-05-28T15:45:07Z"
  },
  {
    "title": "Savannah Chrisley Shares Emotional Response to Her Parents Being Pardoned",
    "description": "Savannah Chrisley shared her emotional reaction after learning that President Donald Trump planned to pardon her parents, former reality stars Todd and Julie Chrisley.",
    "link": "https://www.today.com/popculture/news/savannah-chrisley-parents-pardon-rcna209415",
    "timestamp": "2025-05-28T15:44:56Z"
  },
  {
    "title": "How The Big Beautiful Budget Bill Can Deliver Decisive Deregulation",
    "description": "Congress quietly pulled powerful deregulation from the Big Beautiful Bill—now it’s up to the Senate to decide if OMB’s $100M boost will shake DC’s foundations.",
    "link": "https://www.forbes.com/sites/waynecrews/2025/05/28/how-the-big-beautiful-budget-bill-can-deliver-decisive-deregulation/",
    "timestamp": "2025-05-28T15:44:29Z"
  },
  {
    "title": "MSNBC’s Michael Steele Compares Trump Deportations to Putin Kidnapping Journalists",
    "description": "Michael Steele drew a comparison between the US deporting Kilmar Abgrego Garcia to foreign governments and groups kidnapping Americans or journalists.\nThe post MSNBC’s Michael Steele Compares Trump Deportations to Putin Kidnapping Journalists first appeared o…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-michael-steele-compares-trump-deportations-to-putin-kidnapping-journalists/",
    "timestamp": "2025-05-28T15:43:23Z"
  },
  {
    "title": "Trump tariff plan will flop",
    "description": "Trump’s tariff policies are unlikely to bring back manufacturing jobs to US. Globally dispersed production has proved to be efficient and profitable",
    "link": "https://www.thehindubusinessline.com/opinion/trump-tariff-plan-will-flop/article69630329.ece",
    "timestamp": "2025-05-28T15:43:21Z"
  },
  {
    "title": "Elon Musk says he is ‘disappointed’ in Trump’s ‘big beautiful bill’",
    "description": "Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, a significant fracture in a partnership that was forged during last year's campaign and was poised to reshape American politics and the federal government.",
    "link": "https://www.pbs.org/newshour/politics/elon-musk-says-he-is-disappointed-in-trumps-big-beautiful-bill",
    "timestamp": "2025-05-28T15:42:40Z"
  },
  {
    "title": "Savannah Chrisley Reveals When Parents Todd & Julie Could Come Home After President Trump’s Pardon",
    "description": "Savannah Chrisley took to Instagram to celebrate President Donald Trump’s decision to pardon her parents, Todd and Julie Chrisley.\n Todd and Julie received full pardons from the POTUS after they were convicted of tax evasion and bank fraud in 2022. The realit…",
    "link": "https://extratv.com/2025/05/28/savannah-chrisley-reveals-when-parents-todd-and-julie-could-come-home-after-president-trump-s-pardon/",
    "timestamp": "2025-05-28T15:41:56Z"
  },
  {
    "title": "Israeli airstrikes target Yemen airport as Netanyahu warns Houthis, Iran",
    "description": "Israel launched airstrikes on Sana'a International Airport in the Yemeni capital on Wednesday, Prime Minister Benjamin Netanyahu said.",
    "link": "https://abcnews.go.com/International/israeli-airstrikes-target-yemen-airport-netanyahu-warns-houthis/story?id=122258140",
    "timestamp": "2025-05-28T15:41:28Z"
  },
  {
    "title": "How to save a magazine — with help from Donald Trump and Elon Musk",
    "description": "Elon Musk and Donald Trump teamed up after the 2024 election. And in 2025, Musk's chainsaw approach to cost-cutting became a major news story.\nAndrew Harnik/Getty Images\nNews publishers weren't expecting a new \"Trump Bump\" in 2025 — they figured consumers had…",
    "link": "https://biztoc.com/x/8fa9cbfe3af9dc75",
    "timestamp": "2025-05-28T15:41:06Z"
  },
  {
    "title": "How Trump Dismantled Any Chance for Peace in Ukraine",
    "description": "There was great excitement and sense of anticipation with the November 5th re-election of Donald Trump as the country’s first ‘America First’ President – since George Washington.\nThe post How Trump Dismantled Any Chance for Peace in Ukraine appeared first on …",
    "link": "https://www.globalresearch.ca/trump-dismantled-chance-peace-ukraine/5888574",
    "timestamp": "2025-05-28T15:40:56Z"
  },
  {
    "title": "Merz says Germany and Ukraine will jointly produce long-range weapons",
    "description": "German Chancellor Friedrich Merz said Wednesday during a visit by Ukrainian President Volodymyr Zelensky that Berlin will help Kyiv develop new long-range weapons that can hit targets well inside Russian territory.",
    "link": "https://www.thelocal.de/20250528/merz-says-germany-and-ukraine-will-jointly-produce-long-range-weapons",
    "timestamp": "2025-05-28T15:40:52Z"
  },
  {
    "title": "Elon Musk Drifts Away From DOGE, Whining and Complaining As He Goes",
    "description": "Elon Musk is drifting away from his destructive role at DOGE, disrespecting Trump’s BBB and expressing hurt feelings over criticism of his work. He’s making sure he will be remembered like a bad nightmare.",
    "link": "http://nymag.com/intelligencer/article/elon-musk-doge-trump-big-beautiful-bill.html",
    "timestamp": "2025-05-28T15:40:03Z"
  },
  {
    "title": "BMW, Mercedes, VW in talks with US over possible tariff deal, sources say",
    "description": "German carmakers, including BMW, Mercedes-Benz, and Volkswagen, are engaged in discussions with Washington regarding a potential import tariff agreement. They aim to leverage their U.S. investments and exports to mitigate the impact of tariffs. The proposed d…",
    "link": "https://economictimes.indiatimes.com/news/international/business/bmw-mercedes-vw-in-talks-with-us-over-possible-tariff-deal-sources-say/articleshow/121469574.cms",
    "timestamp": "2025-05-28T15:39:51Z"
  },
  {
    "title": "On Class and Average American Values (Whatever They May Be)",
    "description": "I have long criticized Jacobin, Then I ignored it for years at it has become utterly irrelevant. Seriously, when is the last time you read anything there? But I thought this interview with Joan Williams really nailed some truths about messaging and positions …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/on-class-and-average-american-values-whatever-they-may-be",
    "timestamp": "2025-05-28T15:38:46Z"
  },
  {
    "title": "Trump to swear in Jeanine Pirro as top prosecutor in DC",
    "description": "President Donald Trump will swear in Jeanine Pirro as the interim U.S. attorney for D.C. during a ceremony in the Oval Office Wednesday afternoon.",
    "link": "https://abcnews.go.com/Politics/trump-swear-jeanine-pirro-top-prosecutor-dc/story?id=122268615",
    "timestamp": "2025-05-28T15:38:42Z"
  },
  {
    "title": "How to save a magazine — with help from Donald Trump and Elon Musk",
    "description": "News publishers weren't expecting a new \"Trump Bump\" this year. So how did Wired sign up 62,000 subscribers in two weeks in February?",
    "link": "https://www.businessinsider.com/wired-katie-drummond-trump-musk-subscribers-peter-kafka-podcast-interview",
    "timestamp": "2025-05-28T15:34:54Z"
  },
  {
    "title": "Zelensky: Trump Thinks Putin Is More Annoying than I Am",
    "description": "Ukrainian President Volodymyr Zelensky told reporters on Tuesday that he believed President Donald Trump found his Russian counterpart, Vladimir Putin, more irritating than him because of his dishonesty. The comments were in response to a journalist directly …",
    "link": "https://freerepublic.com/focus/f-news/4319547/posts",
    "timestamp": "2025-05-28T15:33:55Z"
  },
  {
    "title": "It's not just Elon Musk. Other Trump tech allies are turning on his 'big beautiful bill.'",
    "description": "Elon Musk said in a new interview he was 'disappointed' by the price tag of Trump's 'big beautiful bill.' He is not the only one in the world of tech with...",
    "link": "https://finance.yahoo.com/news/its-not-just-elon-musk-other-trump-tech-allies-are-turning-on-his-big-beautiful-bill-153318314.html",
    "timestamp": "2025-05-28T15:33:18Z"
  },
  {
    "title": "Trump Backs Federal Guarantees in Push to Take Fannie and Freddie Public",
    "description": "Mortgage giants’ shares rise as president says government oversight will remain.\nThe post Trump Backs Federal Guarantees in Push to Take Fannie and Freddie Public appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/05/28/trump-backs-federal-guarantees-in-push-to-take-fannie-and-freddie-public/",
    "timestamp": "2025-05-28T15:33:02Z"
  },
  {
    "title": "The Resistance Is Working Better Than You Think",
    "description": "For all the bluster and bravado, Donald Trump is losing. A lot. Despite reclaiming the White House and commanding a Republican-controlled Congress, Trump’s presidency has hit a wall in the federal courts. In the month",
    "link": "https://politicalwire.com/2025/05/28/the-resistance-is-working-better-than-you-think/",
    "timestamp": "2025-05-28T15:30:40Z"
  },
  {
    "title": "Secret Service Agents Fighting Each Other Outside the Obamas' House Brings MAGA to the Social Media Yard",
    "description": "Photo: Joe Raedle (Getty Images)\r\nThe Obama family rarely gets thrown into scandal, but now, the former president and first lady have found their way to the center of attention. But as usual, it has nothing to do with what either one of them did. Two female S…",
    "link": "https://www.theroot.com/secret-service-agents-fighting-each-other-outside-the-o-1851782695",
    "timestamp": "2025-05-28T15:30:00Z"
  },
  {
    "title": "Rubio urged to punish Iraq with 'maximum pressure' sanctions for its 'complete subjugation' by Iran",
    "description": "GOP lawmakers push for sanctions on Iraq, citing its subjugation by Iran and the need to halt U.S. aid, highlighting past policy failures and security concerns.",
    "link": "https://www.foxnews.com/politics/house-republicans-demand-sanctions-iraq-complete-subjugation-iran",
    "timestamp": "2025-05-28T15:29:51Z"
  },
  {
    "title": "‘Whipping Boy’: Musk Says DOGE Fought Massive ‘Uphill Battle,’ Ended Up Getting Blamed For Everything Bad",
    "description": "Just before a test launch for SpaceX's Starship on Tuesday night, Elon Musk said DOGE became a scapegoat for Washington dysfunction.",
    "link": "https://dailycaller.com/2025/05/28/elon-musk-doge-whipping-boy-spacex/",
    "timestamp": "2025-05-28T15:29:34Z"
  },
  {
    "title": "Tom Homan Calls AOC’s Bluff Over Charged Representative",
    "description": "Donald Trump’s border czar Tom Homan bragged Tuesday that Democratic lawmakers haven’t done anything to stop the prosecution of one of their colleagues. \r\nFox News host Laura Ingraham asked Homan to respond to the “caterwauling” from the left over the outrage…",
    "link": "https://newrepublic.com/post/195783/donald-trump-immigration-tom-homan-aoc-charges-representative",
    "timestamp": "2025-05-28T15:28:43Z"
  },
  {
    "title": "Washington’s Bureaucratic Machine Could Chew Up Trump’s Golden Dome Dreams",
    "description": "Washington's byzantine bureaucracy could be the ultimate roadblock to President Donald Trump's Golden Dome project, several defense experts told Axios.",
    "link": "https://dailycaller.com/2025/05/28/washington-bureaucracy-chew-up-trump-golden-dome-defense-missiles/",
    "timestamp": "2025-05-28T15:25:43Z"
  },
  {
    "title": "Vince McMahon sex trafficking case co-defendant John Laurinaitis agrees to help accuser",
    "description": "The moves comes three weeks after Janel Grant filed an amended lawsuit against wrestling mogul Vince McMahon, WWE and John Laurinaitis.",
    "link": "https://www.cnbc.com/2025/05/28/wwe-vince-mcmahon-laurinaitis-sex-trafficking.html",
    "timestamp": "2025-05-28T15:24:56Z"
  },
  {
    "title": "Judge Uses 26 Exclamation Points to Express How Bad Trump Order Is",
    "description": "The president’s attack on Big Law is so outrageous that it’s made at least one judge raise his voice, even on paper.\r\nU.S. District Judge for the District of Columbia Richard Leon struck down Donald Trump’s executive order targeting law firm WilmerHale Tuesda…",
    "link": "https://newrepublic.com/post/195786/judge-26-exclamation-points-donald-trump-executive-order",
    "timestamp": "2025-05-28T15:24:09Z"
  },
  {
    "title": "Dems Warn Fellow Party Members They Cannot ‘Spend’ Their Way Out Of Current ‘Political Challenge’",
    "description": "Democrats are warning that raising hefty sums of money for Democratic causes may not be able to help the party's current struggles, The Hill reported Wednesday.",
    "link": "https://dailycaller.com/2025/05/28/dems-cannot-spend-way-out-challenge/",
    "timestamp": "2025-05-28T15:21:00Z"
  },
  {
    "title": "6/24/25: How to Survive Fascism: a Powerpoint Comedy Show (Oakland) - FREE",
    "description": "The year is 2025, Donald Trump has been in office for what feels like 8 years. With civil liberties under attack, and layoffs are non-stop, what should we expect to see for the rest of the 3.5years? And how can we prepare?\nThis show will cover ...\nThe post Ho…",
    "link": "https://sf.funcheap.com/survive-fascism-powerpoint-comedy-show-oakland/",
    "timestamp": "2025-05-28T15:20:57Z"
  },
  {
    "title": "San Francisco Public Schools Convert F's to C's, B's to A's in Equity Push",
    "description": "The initiative, part of a broader \"Grading for Equity\" plan to roll out in the fall, is stirring concern among educators, students and parents over academic standards.",
    "link": "https://www.newsweek.com/san-francisco-public-schools-equity-homework-2078003",
    "timestamp": "2025-05-28T15:19:31Z"
  },
  {
    "title": "Wall Street Traders Have A New Nickname For Trump, And It's Hilarious",
    "description": "Donald J. Trump always assigns nicknames to his perceived adversaries. Still, Wall Street traders have one for the co-president over his repeated tariff spasms, which make the market dive, then come back after he inevitably caves. Trump's nickname is TACO, an…",
    "link": "https://crooksandliars.com/2025/05/wall-street-traders-have-new-nickname",
    "timestamp": "2025-05-28T15:18:13Z"
  },
  {
    "title": "'They were lying': Tiger King attacks Trump DOJ after being ignored in pardons",
    "description": "\"Joe Exotic\" known as the \"Tiger King\" complained about being left out in President Donald Trump's latest rounds of pardons in a post on X Tuesday. “I guess being innocent is not enough in America,” the 62-year-old Exotic, whose real name is Joseph Maldonado-…",
    "link": "https://www.rawstory.com/tiger-king-ignored-pardons/",
    "timestamp": "2025-05-28T15:17:42Z"
  },
  {
    "title": "Beloved Trump-Supporting Immigrant Pastor Is Finding Out",
    "description": "Tell me if you have heard this story. An immigrant comes to America illegally, but does all the right things: stays out of trouble, gets a job, has a family, pays taxes. He decides to support Donald Trump because he is one of the \"good immigrants\" and Republi…",
    "link": "https://crooksandliars.com/2025/05/beloved-trump-supporting-immigrant-pastor",
    "timestamp": "2025-05-28T15:17:11Z"
  },
  {
    "title": "Elon Musk criticises Donald Trump tax bill, saying it ‘can’t be both big and beautiful’",
    "description": "Billionaire Elon Musk has criticised President Donald Trump's \"big, beautiful\" tax and spending bill, saying it detracts from his efforts to shrink the US budget deficit.",
    "link": "https://www.independent.ie/world-news/elon-musk-criticises-donald-trump-tax-bill-saying-it-cant-be-both-big-and-beautiful/a1103340844.html",
    "timestamp": "2025-05-28T15:16:46Z"
  },
  {
    "title": "Elon Musk criticises Donald Trump tax bill: ‘can't be both big and beautiful’",
    "description": "Billionaire Elon Musk has criticised President Donald Trump's \"big, beautiful\" tax and spending bill, saying it detracts from his efforts to shrink the US budget deficit.",
    "link": "https://www.independent.ie/world-news/elon-musk-criticises-donald-trump-tax-bill-cant-be-both-big-and-beautiful/a1103340844.html",
    "timestamp": "2025-05-28T15:16:45Z"
  },
  {
    "title": "Dems Want To Spend $20 Million On Study To Reveal Obvious: Trump Cooked Them | Drew Hernandez",
    "description": "Following their 2024 election loss, Democrats are investing tens of millions of dollars to attempt to recapture young male voters, a demographic that shifted significantly toward Donald Trump.\nThe post Dems Want To Spend $20 Million On Study To Reveal Obvious…",
    "link": "https://www.thegatewaypundit.com/2025/05/dems-want-spend-20-million-study-reveal-obvious/",
    "timestamp": "2025-05-28T15:15:46Z"
  },
  {
    "title": "The TACO Kid: Wall Street is mocking Trump — and it has nothing to do with his diet",
    "description": "The TACO Kid: Wall Street is mocking Trump — and it has nothing to do with his dietnj.com",
    "link": "https://www.nj.com/politics/2025/05/the-taco-kid-wall-street-is-mocking-trump-and-it-has-nothing-to-do-with-his-diet.html",
    "timestamp": "2025-05-28T15:15:32Z"
  },
  {
    "title": "U.S. stops scheduling foreign students’ visa interviews while expanding social media vetting",
    "description": "A U.S. official said Tuesday the suspension is intended to be temporary and does not apply to applicants who already had scheduled their visa interviews.",
    "link": "https://www.pbs.org/newshour/education/u-s-stops-scheduling-foreign-students-visa-interviews-while-expanding-social-media-vetting",
    "timestamp": "2025-05-28T15:12:56Z"
  },
  {
    "title": "Georgia Republican Enlists Cross-Dressing Actor in Madcap Ad",
    "description": "In one of the most madcap political ads in recent memory, Georgia Republican Rep. Buddy Carter is hitting the issue of transgender athletes head-on in... Read More\nThe post Georgia Republican Enlists Cross-Dressing Actor in Madcap Ad appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/05/28/georgia-republican-enlists-cross-dressing-actor-in-madcap-ad/",
    "timestamp": "2025-05-28T15:10:51Z"
  },
  {
    "title": "US senator calls for AI competition in Pentagon contracting",
    "description": "Democratic Senator Elizabeth Warren urged the U.S. Department of Defense to ensure competitive AI contracting, according to a letter seen by Reuters on Wednesday, as tech billionaire Elon Musk's artificial intelligence chatbot Grok gains ground in the federal…",
    "link": "https://www.channelnewsasia.com/business/us-senator-calls-ai-competition-pentagon-contracting-5157486",
    "timestamp": "2025-05-28T15:07:39Z"
  },
  {
    "title": "Donald Trump and JD Vance await their next Oval Office visitor | May 28 editorial cartoons",
    "description": "Wednesday's political cartoons include the Big Beautiful Bill's impact on Medicare and Medicaid, Donald Trump and JD Vance plotting in the Oval Office, Russia's expansionist plans, and Trump's phone call with Vladimir Putin.",
    "link": "https://theweek.com/cartoons/todays-political-cartoons-may-28-2025",
    "timestamp": "2025-05-28T15:03:00Z"
  },
  {
    "title": "“The Handmaid’s Tale”: An Oral History Of The Novel-To-TV Cultural Landmark",
    "description": "“More than 20 key stakeholders behind its success — from author Margaret Atwood and adapter Bruce Miller to producers, executives and the cast led by Elisabeth Moss (June/Offred) — share how the Trump-era drama captured the cultural zeitgeist … and launched a…",
    "link": "http://www.hollywoodreporter.com/tv/tv-features/the-handmaids-tale-oral-history-cast-show-secrets-1236223140/",
    "timestamp": "2025-05-28T15:03:00Z"
  },
  {
    "title": "The Administration Takes a Hatchet to the NSC",
    "description": "Friday night’s firings will make the next crisis that much more dangerous.",
    "link": "https://www.theatlantic.com/international/archive/2025/05/trump-national-security-council-firing/682952/",
    "timestamp": "2025-05-28T15:02:30Z"
  },
  {
    "title": "Elon Musk criticizes Trump's 'big beautiful bill,' a fracture in a key relationship",
    "description": "Elon Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, saying he's “disappointed” in what the president calls his “big beautiful bill.”.",
    "link": "https://www.ksat.com/business/2025/05/28/elon-musk-criticizes-trumps-big-beautiful-bill-a-fracture-in-a-key-relationship/",
    "timestamp": "2025-05-28T15:02:05Z"
  },
  {
    "title": "Trudeau turns heads with odd fashion choice at King Charles’ historic speech",
    "description": "If diplomacy is theater, Justin Trudeau walked onstage in costume to greet royalty.",
    "link": "https://nypost.com/2025/05/28/us-news/ex-prime-minister-trudeaus-strange-fashion-for-king-charles-visit/",
    "timestamp": "2025-05-28T15:01:59Z"
  },
  {
    "title": "Fivio Foreign Pleads Guilty To Making Terroristic Threats",
    "description": "Fivio Foreign has pleaded guilty to making terroristic threats after he allegedly pointed a gun at a woman who wanted her car jumpstarted.",
    "link": "https://hiphopdx.com/news/fivio-foreign-pleads-guilty-to-making-terroristic-threats",
    "timestamp": "2025-05-28T15:00:42Z"
  },
  {
    "title": "Sen. Lummis Gears Up To Present 1 Million Bitcoin Acquisition Bill To The Senate Next Week",
    "description": "At the Bitcoin 2025 conference in Las Vegas on Tuesday, Senator Cynthia Lummis, a staunch advocate for BTC and cryptocurrencies, announced that President Donald Trump supports the upcoming Bitcoin Act, which aims to facilitate the purchase of 1 million BTC an…",
    "link": "https://bitcoinist.com/sen-lummis-1-million-bitcoin-acquisition-bill/",
    "timestamp": "2025-05-28T15:00:38Z"
  },
  {
    "title": "A Plan To Deploy NATO Troops To Ukraine Is “Dead”",
    "description": "An anonymous source has told the Financial Times that the plan by the United Kingdom and France to put NATO (North Atlantic Treaty Organization) troops on the ground in Ukraine is \"dead.\" The plan is still being pushed by some Western backers. However, the U.…",
    "link": "https://www.shtfplan.com/headline-news/a-plan-to-deploy-nato-troops-to-ukraine-is-dead",
    "timestamp": "2025-05-28T15:00:37Z"
  },
  {
    "title": "Latest Donald Trump approval ratings: New poll finds changes",
    "description": "Here's what the latest polling data says about Donald Trump's approval rating.",
    "link": "https://www.masslive.com/politics/2025/05/latest-donald-trump-approval-ratings-new-poll-finds-changes.html",
    "timestamp": "2025-05-28T15:00:36Z"
  },
  {
    "title": "Work on Russian peace proposal to Ukraine ‘in final stage’ – Kremlin",
    "description": "Moscow and Kiev must agree the memorandum before ceasefire talks can take place, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618264-russia-ukraine-peace-memorandum/",
    "timestamp": "2025-05-28T15:00:04Z"
  },
  {
    "title": "Trump Criticizes Putin After Deadly Attacks on Ukraine",
    "description": "US President Donald Trump again lashed out at his Russian counterpart Vladimir Putin after Russia capped a three-day bombing spree with its biggest aerial attack of the more than three-year war, which the Kremlin responded to by saying its defending its \"nati…",
    "link": "https://oilprice.com/Geopolitics/International/Trump-Criticizes-Putin-After-Deadly-Attacks-on-Ukraine.html",
    "timestamp": "2025-05-28T15:00:00Z"
  },
  {
    "title": "Elon Musk’s AI Chatbot Grok Is Reciting Climate Denial Talking Points",
    "description": "The latest version of Grok, the chatbot created by Elon Musk’s xAI, is promoting fringe climate viewpoints in a way it hasn’t done before, observers say",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/05/27/is-climate-change-a-threat-it-all-depends-says-elon-musks-ai-chatbot-00367904",
    "timestamp": "2025-05-28T15:00:00Z"
  },
  {
    "title": "‘Tidal wave’: How 75 nations face Chinese debt crisis in 2025",
    "description": "Developing countries to pay a record $22bn this year, mostly linked to loans from China’s Belt and Road Initiative.",
    "link": "https://www.aljazeera.com/news/2025/5/28/tidal-wave-how-75-nations-face-chinese-debt-crisis-in-2025",
    "timestamp": "2025-05-28T15:00:00Z"
  },
  {
    "title": "Russia and Ukraine Just Held Their Largest Prisoner Exchange Yet",
    "description": "One hopes that Russia and Ukraine can build upon the diplomatic and humanitarian momentum of the recent prisoner exchange to develop a permanent peace.\nThe post Russia and Ukraine Just Held Their Largest Prisoner Exchange Yet appeared first on The National In…",
    "link": "https://nationalinterest.org/blog/buzz/russia-and-ukraine-just-held-their-largest-prisoner-exchange-yet",
    "timestamp": "2025-05-28T15:00:00Z"
  },
  {
    "title": "Ethiopian Woman Flees Torture, But Still Facing Deportation",
    "description": "The Trump administration has quietly dismantled access to the United Nations Convention Against Torture.",
    "link": "https://www.kqed.org/news/12041761/ethiopian-woman-flees-torture-but-still-facing-deportation",
    "timestamp": "2025-05-28T14:59:52Z"
  },
  {
    "title": "US Student Visa Pause: What Interviews Are Impacted",
    "description": "The Trump administration is also considering a policy requiring foreign student visa applicants to undergo social media screening.",
    "link": "https://www.newsweek.com/us-student-visa-pause-interview-2077963",
    "timestamp": "2025-05-28T14:59:00Z"
  },
  {
    "title": "Fox News Host Roasts Trump's Mornings: 'Wake Up, Watch Cable News, Create Chaos, Watch The Futures Tank'",
    "description": "Fox News co-host Jessica Tarlov took a swipe at President Donald Trump on X recently, mocking his “morning schedule” as he continues to publicly threaten individual companies like Apple (NASDAQ:AAPL) with tariffs. \nTrump recently warned that he would impose a…",
    "link": "https://biztoc.com/x/6b1c9eead0e404ef",
    "timestamp": "2025-05-28T14:56:33Z"
  },
  {
    "title": "JD Vance accuses courts of trying to ‘literally overturn’ the will of American voters",
    "description": "It is not the job of the courts to defer to a branch of government based on election results. JD Vance apparently finds this confusing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jd-vance-accuses-courts-trying-literally-overturn-will-american-voters-rcna209442",
    "timestamp": "2025-05-28T14:56:31Z"
  },
  {
    "title": "Trump Family's Expanding Crypto Ties Raise Questions On Ethics, Influence, And Investor Risk",
    "description": "The Trump family's growing engagement with the cryptocurrency world has triggered increasing scrutiny, with projects involving everything from meme coins and NFTs to stablecoins and DeFi ventures, many of which are raising ethical and regulatory questions.\nWh…",
    "link": "https://biztoc.com/x/d6be9c1149ed7a6a",
    "timestamp": "2025-05-28T14:56:19Z"
  },
  {
    "title": "Toyota moves production of popular US sedan to Britain",
    "description": "President Donald Trump made tariffs the focal point of his administration's economic policy during the first year of his second non-consecutive term in office. \nAlthough the duties have been unpredictable and unpopular with much of the business community, the…",
    "link": "https://biztoc.com/x/2badc907790f3e4b",
    "timestamp": "2025-05-28T14:56:02Z"
  },
  {
    "title": "A judge refuses to toss states' lawsuit against Elon Musk and DOGE",
    "description": "A federal judge has refused to throw out a lawsuit that accuses billionaire Elon Musk and the Department of Government Efficiency of illegally accessing government data systems, canceling government contracts and firing federal employees",
    "link": "https://abcnews.go.com/US/wireStory/judge-refuses-toss-states-lawsuit-elon-musk-doge-122268367",
    "timestamp": "2025-05-28T14:54:26Z"
  },
  {
    "title": "Fox News’ Andy McCarthy Pours Cold Water on Trump’s ‘Dubious’ Attempt to Defund PBS and NPR",
    "description": "Fox News' Andy McCarthy poured cold water on President Donald Trump's \"dubious\" attempt at unilaterally defunding NPR and PBS.\nThe post Fox News’ Andy McCarthy Pours Cold Water on Trump’s ‘Dubious’ Attempt to Defund PBS and NPR first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/fox-news-andy-mccarthy-pours-cold-water-on-trumps-dubious-attempt-to-defund-pbs-and-npr/",
    "timestamp": "2025-05-28T14:52:44Z"
  },
  {
    "title": "Vladimir Putin issues his conditions for ending the war in Ukraine",
    "description": "President Vladimir Putin's conditions for ending the war in Ukraine include a demand that Western leaders pledge in writing to stop enlarging NATO eastwards, according to reports.",
    "link": "https://nypost.com/2025/05/28/world-news/vladimir-putin-issues-his-conditions-for-ending-war-in-ukraine/",
    "timestamp": "2025-05-28T14:52:05Z"
  },
  {
    "title": "Deep State Feeds Trump Pro-Ukraine Lies?",
    "description": "US President Donald Trump isn’t getting the full scope of intelligence briefings, Michael Maloof, former senior security policy analyst in the Office of the Secretary of Defense, tells Sputnik.",
    "link": "https://sputnikglobe.com/20250528/deep-state-feeds-trump-pro-ukraine-lies-1122148078.html",
    "timestamp": "2025-05-28T14:51:23Z"
  },
  {
    "title": "Live updates: Trump administration news",
    "description": "Follow here for the latest live news updates as President Donald Trump continues to forge ahead with his domestic and foreign policy agenda.",
    "link": "https://www.cnn.com/politics/live-news/trump-presidency-news-05-28-25",
    "timestamp": "2025-05-28T14:50:37Z"
  },
  {
    "title": "Trump FBI launches investigation into leftist violence against Christians in Seattle",
    "description": "Conservative Christians held a prayer rally with music, speeches, and giveaways at Cal Anderson Park in Seattle, Washington, on Saturday. The Mayday USA event — held in support of the \"sanctity of human life, the sacrality of biological gender, the importance…",
    "link": "https://www.theblaze.com/news/trump-fbi-launches-investigation-into-leftist-violence-against-christians-in-seattle",
    "timestamp": "2025-05-28T14:50:00Z"
  },
  {
    "title": "Zelensky: Trump Thinks Putin Is More Annoying than I Am",
    "description": "Ukrainian President Volodymyr Zelensky told reporters on Tuesday that he believed President Donald Trump found his Russian counterpart, Vladimir Putin, more irritating than him because of his dishonesty.\nThe post Zelensky: Trump Thinks Putin Is More Annoying …",
    "link": "https://www.breitbart.com/europe/2025/05/28/zelensky-trump-thinks-putin-is-more-annoying-than-i-am/",
    "timestamp": "2025-05-28T14:48:35Z"
  },
  {
    "title": "7 million new jobs will evaporate this year because of trade war, UN predicts | CNN Business",
    "description": "The United Nations expects that millions of potential jobs will vanish this year because of an economic slowdown triggered by US President Donald Trump’s trade war.",
    "link": "https://www.cnn.com/2025/05/28/business/ilo-7-million-jobs-trade-war-intl",
    "timestamp": "2025-05-28T14:48:26Z"
  },
  {
    "title": "DOGE Cuts Put Margate Icon Lucy the Elephant On Endangered Species List",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/05/28/lucy-the-elephant-margate-doge/",
    "timestamp": "2025-05-28T14:46:53Z"
  },
  {
    "title": "Elon Musk criticizes Trump's 'big beautiful bill,' a fracture in a key relationship",
    "description": "Elon Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, saying he's “disappointed” in what the president calls his “big beautiful bill.”",
    "link": "https://abcnews.go.com/US/wireStory/elon-musk-criticizes-trumps-big-beautiful-bill-fracture-122267091",
    "timestamp": "2025-05-28T14:46:28Z"
  },
  {
    "title": "Israel Is Taking Its Cues From Spanish Conquistadors",
    "description": "Greg Grandin\n\n\n\nCortés has given way to Netanyahu, Putin, and Trump. A new age of conquest is upon us.\r\n\n\r\n\n\nThe post Israel Is Taking Its Cues From Spanish Conquistadors appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/israel-gaza-conquistadors-aztec/",
    "timestamp": "2025-05-28T14:45:55Z"
  },
  {
    "title": "What are Germany’s Taurus missiles that Ukraine wants?",
    "description": "German Chancellor Merz's recent comments cause speculation Berlin will finally send the weapons to Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/28/what-are-germanys-taurus-missiles-that-ukraine-wants",
    "timestamp": "2025-05-28T14:45:36Z"
  },
  {
    "title": "Earthquake between Musk and Trump: Tesla CEO lashes out with harsh statements and defends DOGE team",
    "description": "The stage of harmony and solidarity between tech mogul Elon Musk and President  Donald Trump seems to be going through a rough patch, after the billionaire resigned from the leader",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/05/28/68371f5222601ddb778b458d.html",
    "timestamp": "2025-05-28T14:45:17Z"
  },
  {
    "title": "Elon Musk ‘Disappointed’ in ‘Big Beautiful’ Spending Bill",
    "description": "Department of Government Efficiency head Elon Musk told CBS News Tuesday he is “disappointed” in the spending codified in the Republicans’ “big, beautiful bill.” “I... Read More\nThe post Elon Musk ‘Disappointed’ in ‘Big Beautiful’ Spending Bill appeared first…",
    "link": "https://www.dailysignal.com/2025/05/28/musk-disappointed-big-beautiful-bill/",
    "timestamp": "2025-05-28T14:45:16Z"
  },
  {
    "title": "Bono Sides with Springsteen Against Trump: “There’s Only One Boss in America”",
    "description": "The U2 vocalist became the latest Rock and Roll Hall of Famer to speak out in support of the Jersey rocker.\nBono Sides with Springsteen Against Trump: “There’s Only One Boss in America”\nEddie Fu",
    "link": "https://consequence.net/2025/05/bono-bruce-springsteen-donald-trump/",
    "timestamp": "2025-05-28T14:45:14Z"
  },
  {
    "title": "Missouri will hand over personal data of food aid recipients to feds",
    "description": "Missouri has agreed to abide by a request from the federal government to turn over personal data about anyone receiving food assistance.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_39def998-7cda-48c7-b087-bc4daa581f0f.html",
    "timestamp": "2025-05-28T14:45:00Z"
  },
  {
    "title": "Barbara Walters Grills Taylor Swift, Donald Trump in ‘Tell Me Everything’ Doc Trailer",
    "description": "New film celebrating the famed journalist's career will drop on Hulu next month",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/barbara-walters-tell-me-everything-trailer-taylor-swift-1235349239/",
    "timestamp": "2025-05-28T14:44:47Z"
  },
  {
    "title": "Chrisley children celebrate Trump's plan to pardon reality TV parents in fraud, tax evasion case",
    "description": "Shortly after President Donald Trump announced his plan to pardon Todd and Julie Chrisley for their bank fraud and tax evasion charges, the “Chrisley Knows Best\" stars' children were quick to share their excitement.",
    "link": "https://www.foxnews.com/entertainment/chrisley-children-celebrate-trumps-plan-pardon-reality-tv-parents-fraud-tax-evasion-case",
    "timestamp": "2025-05-28T14:44:46Z"
  },
  {
    "title": "WATCH: Stephen A. Smith says media’s Biden cover-up ‘makes Trump look right’ about fake news and lawfare",
    "description": "'Now the American people are sitting here not knowing what to believe or who to believe anymore. And then you wonder why I'm pissed'",
    "link": "https://www.wnd.com/2025/05/watch-stephen-a-smith-says-medias-biden-cover-up-makes-trump-look-right-about-fake-news-and-lawfare/",
    "timestamp": "2025-05-28T14:44:28Z"
  },
  {
    "title": "Editor Daily Rundown: NPR Claims Trump Admin Pulling Taxpayer Funding Violates First Amendment",
    "description": "NPR SAYS TRUMP YANKING THEIR FUNDING IS A VIOLATION OF THE *FIRST AMENDMENT* ... NPR Sues Trump, Claims Cutting Its Taxpayer Funding Amounts To 'Free Speech' Violation\n\nNational Public Radio (NPR) announced Tuesday that it is suing President Donald Trump over…",
    "link": "https://dailycaller.com/2025/05/28/npr-trump-admin-taxpayer-funding-first-amendment-free-speech/",
    "timestamp": "2025-05-28T14:43:16Z"
  },
  {
    "title": "Will Trump Start Deporting Cows?",
    "description": "A❤️415-wordunder2.5-minuteread All right. Even Donald Trump isn’t likely to start loading cattle on planes destined for El Salvador. I just thought the headline might get people’s attention and I need to broaden my social media footprint to monetize my …",
    "link": "https://energycentral.com/c/cp/will-trump-start-deporting-cows",
    "timestamp": "2025-05-28T14:38:30Z"
  },
  {
    "title": "A judge refuses to toss states’ lawsuit against Elon Musk and DOGE",
    "description": "U.S. District Judge Tanya Chutkan ruled Tuesday that 14 states can proceed with their claims against Musk and DOGE.",
    "link": "https://www.bostonherald.com/2025/05/28/musk-doge-data-access-lawsuit/",
    "timestamp": "2025-05-28T14:38:26Z"
  },
  {
    "title": "Macy's beats on earnings but cuts 2025 guidance due to tariffs",
    "description": "Macy’s gave Wall Street a masterclass in mixed signals on Wednesday: The department store chain beat first-quarter earnings expectations — then cut its full-year profit forecast, citing tariff pressures and cautious consumer spending related to the U.S. trade…",
    "link": "https://qz.com/macys-q1-2025-earnings-guidance-tariffs-1851782670",
    "timestamp": "2025-05-28T14:36:35Z"
  }
]