[
  {
    "title": "France to revoke US envoy’s govt access after summons no-show",
    "description": "France moved on Monday to block US envoy Charles Kushner from having access to government ministers, after he failed to show up to explain comments about a killed far-right activist. The move is the latest instance of diplomatic friction between Paris and the…",
    "link": "https://www.digitaljournal.com/world/france-to-revoke-us-envoys-govt-access-after-summons-no-show/article",
    "timestamp": "2026-02-24T03:33:27Z"
  },
  {
    "title": "Fed seeks feedback on proposal to end Operation Chokepoint 2.0",
    "description": "The Fed is seeking feedback on a proposal to remove \"reputation risk\" from banking supervision in a blow to Operation Chokepoint 2.0.",
    "link": "https://cointelegraph.com/news/fed-seeks-feedback-chokepoint-2-0-ending-proposal",
    "timestamp": "2026-02-24T03:33:00Z"
  },
  {
    "title": "What The FBI Is Investigating In Criminal Probe Of 2020 Election",
    "description": "After the election offices of Georgia’s most populous county were raided last month, the FBI has disclosed information indicating where its investigation is heading.FBI agents are seen at the facility in Union City, Ga., on Jan. 28, 2026. Federal laws may hav…",
    "link": "https://freerepublic.com/focus/f-news/4368063/posts",
    "timestamp": "2026-02-24T03:29:33Z"
  },
  {
    "title": "Russia Ukraine war four years on: Civilian deaths, military losses and economic fallout",
    "description": "The war in Ukraine, now in its fourth year, has caused immense destruction and loss of life. Cities lie in ruins, and millions have been displaced. Ukraine's economy is devastated, while Russia faces economic strain. Both nations grapple with societal changes…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-ukraine-war-four-years-on-civilian-deaths-military-losses-and-economic-fallout/articleshow/128738440.cms",
    "timestamp": "2026-02-24T03:28:18Z"
  },
  {
    "title": "Iran warns of wider consequences if attacked",
    "description": "Iran’s deputy foreign minister warns of wider escalation if attacked by the US, following Trump’s threat over Iran’s nuclear program.",
    "link": "https://www.israelnationalnews.com/news/422888",
    "timestamp": "2026-02-24T03:23:23Z"
  },
  {
    "title": "De Niro: 'Idiot' Trump Should Never Been Allowed to Run for President",
    "description": "Monday on MS NOW's \"The Weeknight,\" actor Robert De Niro claimed President Donald Trump was an \"idiot\" who should not have been allowed to run for president.\nThe post De Niro: ‘Idiot’ Trump Should Never Been Allowed to Run for President appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2026/02/23/de-niro-idiot-trump-should-never-been-allowed-to-run-for-president/",
    "timestamp": "2026-02-24T03:22:12Z"
  },
  {
    "title": "Blue Cities Are Out of Control",
    "description": "The Boston Globe ran a poll last December which found that a full third of respondents were thinking about leaving the state because of the high cost of living.The Globe/Suffolk survey found that about one-third of Massachusetts voters have seriously consider…",
    "link": "https://freerepublic.com/focus/f-news/4368061/posts",
    "timestamp": "2026-02-24T03:19:50Z"
  },
  {
    "title": "Canada PM to push trade, rebuild fractured ties in India trip",
    "description": "Canadian Prime Minister Mark Carney heads to India this week pushing to double trade and mend fractured ties, his first stop on an Asia-Pacific tour that also includes Australia and Japan as he seeks to reduce reliance on the United States. Carney has said th…",
    "link": "https://www.digitaljournal.com/world/canada-pm-to-push-trade-rebuild-fractured-ties-in-india-trip/article",
    "timestamp": "2026-02-24T03:17:20Z"
  },
  {
    "title": "Trump refutes reports of top general advising against war with Iran",
    "description": "WASHINGTON DC: US President Donald Trump refuted media reports claiming that General Daniel Caine has cautioned Washington against the war with Iran. In a post on Truth Social, Trump said that the stories are “100 per cent incorrect” as they do not attribute …",
    "link": "https://english.khabarhub.com/2026/24/536425/",
    "timestamp": "2026-02-24T03:15:45Z"
  },
  {
    "title": "Apple expands US manufacturing with Mac Mini assembly in Houston",
    "description": "The move follows Apple’s earlier pledge to invest $600 billion in the US over four years and comes amid renewed tariff pressure from Donald Trump, who has warned of a 25% levy on overseas-made products.",
    "link": "https://www.thehindubusinessline.com/info-tech/apple-expands-us-manufacturing-with-mac-mini-assembly-in-houston/article70669641.ece",
    "timestamp": "2026-02-24T03:14:34Z"
  },
  {
    "title": "Why did Isaac Hayes’ estate sue Trump? #entertainment",
    "description": "Settlement ends lawsuit over campaign music use Isaac Hayes’ estate and former President Donald Trump reached a private settlement after the estate sued over repeated uses of the 1966 soul song “Hold On, I’m Coming.” The estate alleged the track was played wi…",
    "link": "https://alltoc.com/entertainment/why-did-isaac-hayes-estate-sue-trump",
    "timestamp": "2026-02-24T03:07:55Z"
  },
  {
    "title": "Apple to shift some Mac Mini production to Houston from Asia, WSJ reports",
    "description": "Apple will move some production of its ​Mac Mini desktop computer ​to the US from Asia, with a new manufacturing ​effort set to begin later this year at a Foxconn facility in north Houston, The Wall Street Journal reported on Monday.<br />",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-to-shift-some-mac-mini-production-to-houston-from-asia-wsj-reports/articleshow/128737919.cms",
    "timestamp": "2026-02-24T03:01:32Z"
  },
  {
    "title": "Give govt time, space to assess US tariff situation, Anwar tells Dewan Rakyat",
    "description": "KUALA LUMPUR: Give the government space and time to assess the tariff situation with the US, says Datuk Seri Anwar Ibrahim Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/24/give-govt-time-space-to-assess-us-tariff-situation-anwar-tells-dewan-rakyat",
    "timestamp": "2026-02-24T02:59:00Z"
  },
  {
    "title": "Nifty may slip 100 points at open amid US sell-off, tariff tensions",
    "description": "Indian markets may open lower as Gift Nifty signals a gap-down. Tariff tensions, AI disruption fears and F&O expiry could keep Nifty volatile today.",
    "link": "https://www.thehindubusinessline.com/markets/nifty-may-slip-100-points-at-open-amid-us-sell-off-tariff-tensions/article70669592.ece",
    "timestamp": "2026-02-24T02:54:15Z"
  },
  {
    "title": "Isaac Hayes’ Estate Reaches Settlement with Trump Over Use Of “Hold On, I’m Coming”",
    "description": "Hayes' estate had sued Trump over the unauthorized use of the 1966 song, citing at least 133 instances in which it was played at campaign events.\nIsaac Hayes’ Estate Reaches Settlement with Trump Over Use Of “Hold On, I’m Coming”\nScoop Harrison",
    "link": "https://consequence.net/2026/02/isaac-hayes-trump-settlement/",
    "timestamp": "2026-02-24T02:53:51Z"
  },
  {
    "title": "Christian leaders denounce Trump actions, warn of 'crisis of faith'",
    "description": "Their statement says Christians have a moral obligation to condemn the demonization of immigrants and attacks on civil rights and diversity.",
    "link": "https://www.usatoday.com/story/news/nation/2026/02/23/christian-leaders-denounce-trump-crisis-faith-democracy/88787800007/",
    "timestamp": "2026-02-24T02:52:33Z"
  },
  {
    "title": "President Trump Will Fill Two Massive Court Vacancies as He Continues to Shape the Federal Judiciary",
    "description": "Two more vacancies are reportedly opening at the U.S.\nThe post President Trump Will Fill Two Massive Court Vacancies as He Continues to Shape the Federal Judiciary appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/president-trump-will-fill-two-massive-court-vacancies/",
    "timestamp": "2026-02-24T02:40:53Z"
  },
  {
    "title": "New York hires emergency shovelers after blizzard brings city to standstill",
    "description": "A record-breaking snowstorm pummels the north-eastern United States, bringing cities to a near-standstill for millions of residents.",
    "link": "https://www.abc.net.au/news/2026-02-24/new-york-blizzard-shuts-down-city/106380000",
    "timestamp": "2026-02-24T02:40:04Z"
  },
  {
    "title": "Flavor Flav invites USA women's hockey team to 'real celebration'",
    "description": "The Public Enemy rapper made the offer as the U.S. women's hockey team declined an invitation to the State of the Union address from the White House.",
    "link": "https://www.usatoday.com/story/sports/olympics/2026/02/23/usa-womens-hockey-las-vegas-celebration-flavor-flav/88834651007/",
    "timestamp": "2026-02-24T02:31:38Z"
  },
  {
    "title": "Cuba has survived 66 years of US-led embargoes. Will Trump’s blockade break it now?",
    "description": "The Soviets came to Cuba’s aid in the 1960s. It remains to be seen whether Russia can do the same now.",
    "link": "https://theconversation.com/cuba-has-survived-66-years-of-us-led-embargoes-will-trumps-blockade-break-it-now-276065",
    "timestamp": "2026-02-24T02:24:29Z"
  },
  {
    "title": "Trump seems to mock US women's hockey team while congratulating men on gold",
    "description": "Viral video of Trump's White House invitation to the US men's hockey team sparks backlash online after the president jokes he would be 'impeached' if he did not also include the gold-medal winning women's team.",
    "link": "https://www.abc.net.au/news/2026-02-24/trump-us-mens-hockey-team-under-fire-mocking-womens-team/106380212",
    "timestamp": "2026-02-24T02:23:22Z"
  },
  {
    "title": "Oil hovers below seven-month high as traders eye U.S.–Iran talks, trade policy",
    "description": "Oil prices dipped slightly Tuesday after reaching near seven-month highs, as traders closely watched U.S.-Iran nuclear talks and U.S. trade policy uncertainties. Tensions remain high with renewed diplomatic efforts and concerns over potential military conflic…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-hovers-below-seven-month-high-as-traders-eye-u-s-iran-talks-trade-policy/articleshow/128737094.cms",
    "timestamp": "2026-02-24T02:22:05Z"
  },
  {
    "title": "PM Mark Carney to travel to India, Australia and Japan this week to diversify Canada trade away from US",
    "description": "Canadian Prime Minister Mark Carney will visit India, Australia and Japan to deepen trade ties and cut reliance on the US amid rising tariff tensions with President Donald Trump. The trip includes talks on trade, defense, AI and clean energy, and comes as Can…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pm-mark-carney-to-travel-to-india-australia-and-japan-this-week-to-diversify-canada-trade-away-from-us/articleshow/128736884.cms",
    "timestamp": "2026-02-24T02:21:22Z"
  },
  {
    "title": "Gold falls from three-week high as dollar firms",
    "description": "Gold prices dropped Tuesday after reaching a three-week peak. A stronger dollar pressured the precious metal. U.S. tariff uncertainty and Iran tensions provided some support. Silver, platinum, and palladium also saw declines. Investors are watching U.S. trade…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-falls-from-three-week-high-as-dollar-firms/articleshow/128736986.cms",
    "timestamp": "2026-02-24T02:16:50Z"
  },
  {
    "title": "Report: U.S. Attorney Pirro's Office Halts Case Against Democrats Who Encouraged Military Disobedience",
    "description": "U.S. Attorney for the District of Columbia Jeanine Pirro's office is allegedly halting a case against several Democrats who took part in a video and encouraged military members to disobey orders, according to a report.\nThe post Report: U.S. Attorney Pirro’s O…",
    "link": "https://www.breitbart.com/politics/2026/02/23/report-u-s-attorney-pirros-office-halts-case-democrats-encouraged-military-disobedience/",
    "timestamp": "2026-02-24T02:14:09Z"
  },
  {
    "title": "Trump-Appointed Judge Finds DHS in Contempt for Transferring Detainee and Dumping Him in Texas Without His Belongings",
    "description": "A Trump-appointed judge found DHS in civil contempt for transferring a detainee to El Paso, Texas in direct violation of his order and dumping him without any of his belongings.\nThe post Trump-Appointed Judge Finds DHS in Contempt for Transferring Detainee an…",
    "link": "https://www.mediaite.com/lawcrime/trump-appointed-judge-finds-dhs-in-contempt-for-transferring-detainee-and-dumping-him-in-texas-without-his-belongings/",
    "timestamp": "2026-02-24T02:11:25Z"
  },
  {
    "title": "Defiant Trump is 'digging his own grave' after Supreme Court told him no: ex-MAGA staffer",
    "description": "President Donald Trump's insistence on raising taxes because the Supreme Court told him not to is going to wreck his party, former Trump administration DHS staffer Miles Taylor told MS NOW's \"The Weeknight\" on Monday.Trump has already signaled his intent to u…",
    "link": "https://www.rawstory.com/trump-tariffs-2675303022/",
    "timestamp": "2026-02-24T02:10:38Z"
  },
  {
    "title": "US military strikes alleged drug boat in Caribbean Sea, killing 3",
    "description": "The US military reported killing three individuals on Monday during an operation targeting a suspected drug-smuggling boat in the Caribbean Sea. This incident is part of an ongoing campaign by the Trump administration against alleged traffickers. The strike b…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-military-strikes-alleged-drug-boat-in-caribbean-sea-killing-3/articleshow/128736722.cms",
    "timestamp": "2026-02-24T02:07:34Z"
  },
  {
    "title": "Trump's Suddenly High-Stakes State of the Union (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nTrump's Suddenly High-Stakes State of the Union  —  The president is visiting Congress in a dramatically different place from where he was a year ago.  —  Here's how much things have changed since Donald Trump last addressed Co…",
    "link": "https://www.memeorandum.com/260223/p142",
    "timestamp": "2026-02-24T02:05:00Z"
  },
  {
    "title": "Panama cancels China-linked port deal, hands canal terminals to Maersk, MSC",
    "description": "The simmering dispute has become a geopolitical flashpoint between Washington and Beijing, with Panama caught in the crossfire.",
    "link": "https://www.cnbc.com/2026/02/24/panama-officially-voids-annuls-ck-hutchison-contracts-interim-control-maersk-msc-canal-dispute.html",
    "timestamp": "2026-02-24T02:02:39Z"
  },
  {
    "title": "U.S. debt concerns weigh on Trump’s plan to supersize the Pentagon’s budget to $1.5 trillion, highlighting this law about great-power status",
    "description": "“This will allow us to build the ‘Dream Military’ that we have long been entitled to and, more importantly, that will keep us SAFE and SECURE, regardless of foe,” Trump said.",
    "link": "https://fortune.com/2026/02/23/us-debt-trump-plan-pentagon-budget-interest-costs-great-power-status/",
    "timestamp": "2026-02-24T02:01:00Z"
  },
  {
    "title": "Crypto Enters Extreme Fear Zone as Global Trade Tensions and Policy Shifts Weigh on Prices",
    "description": "The market tumbled sharply on Monday, with BTC briefly slipping below $65,000, as traders reacted to a mix of U.S. trade policy shifts, geopolitical risks, and looming economic data. The sudden losses erased weekend gains and pushed the market deeper into ext…",
    "link": "https://bitcoinist.com/crypto-enter-extreme-fear-zone-global-trade-tension/",
    "timestamp": "2026-02-24T02:00:49Z"
  },
  {
    "title": "Trump Predicts Supreme Court ‘Will Find a Way to Come to the Wrong Conclusion’ on Birthright Citizenship",
    "description": "President Donald Trump predicted Monday that the U.S.\nThe post Trump Predicts Supreme Court ‘Will Find a Way to Come to the Wrong Conclusion’ on Birthright Citizenship appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/trump-predicts-supreme-court-will-find-way-come/",
    "timestamp": "2026-02-24T02:00:31Z"
  },
  {
    "title": "House Democrats Pick 12 Candidates to Back in ‘Red to Blue’ Initiative",
    "description": "The DCCC describes the initiative as \"highly competitive\" and only the top-tier candidates gain access.\nThe post House Democrats Pick 12 Candidates to Back in ‘Red to Blue’ Initiative first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/house-democrats-pick-12-candidates-to-back-in-red-to-blue-initiative/",
    "timestamp": "2026-02-24T02:00:21Z"
  },
  {
    "title": "GOP terrified Trump created a time bomb set to detonate just before the midterms: report",
    "description": "Republicans in vulnerable congressional districts are increasingly worried President Donald Trump has set a trap for his own party that is set to blow up in all their faces just before the midterms, Politico reported on Monday.Specifically, after the Supreme …",
    "link": "https://www.rawstory.com/trump-tariffs-2675302882/",
    "timestamp": "2026-02-24T02:00:01Z"
  },
  {
    "title": "A new U.S. attack on Iran could risk large-scale retaliation",
    "description": "WASHINGTON — Although weakened and facing a domestic crisis, Iran’s regime still has substantial firepower that could potentially inflict damage on American interests and allies in the region, disrupt the global economy and trigger a protracted conflict in re…",
    "link": "https://www.nbcnews.com/politics/national-security/new-us-attack-iran-risk-large-scale-retaliation-rcna259964",
    "timestamp": "2026-02-24T02:00:00Z"
  },
  {
    "title": "For Iran's rulers, refusing US demands is a risk worth taking",
    "description": "Iran faces U.S. military pressure but refuses to yield on its nuclear program and weapons. Experts believe this standoff makes conflict almost inevitable. Iran's leaders prioritize ideology and sovereignty over immediate survival. Talks are ongoing, but a com…",
    "link": "https://economictimes.indiatimes.com/news/defence/for-irans-rulers-refusing-us-demands-is-a-risk-worth-taking/articleshow/128736564.cms",
    "timestamp": "2026-02-24T01:58:41Z"
  },
  {
    "title": "Oil hovers below seven-month high as traders eye US–Iran talks, trade policy",
    "description": "Feb 24 : Oil prices hovered below an almost seven-month high on Tuesday as traders gauged the outlook for U.S.-Iran nuclear talks amid heightened Middle East tensions, while also weighing uncertainty around U.S. trade policy.Brent crude futures eased 9 cents,…",
    "link": "https://www.channelnewsasia.com/business/oil-hovers-below-seven-month-high-traders-eye-us-iran-talks-trade-policy-5948436",
    "timestamp": "2026-02-24T01:55:52Z"
  },
  {
    "title": "Oil rises to near seven-month high on US–Iran tensions, trade policy",
    "description": "Feb 24 : Oil prices rose on Tuesday, nearing seven-month highs, with traders assessing geopolitical risks ahead of another round of U.S.-Iran nuclear talks, while U.S. trade policy uncertainty added to broader concerns.Brent crude futures rose 59 cents, or 0.…",
    "link": "https://www.channelnewsasia.com/business/oil-rises-near-seven-month-high-us-iran-tensions-trade-policy-5948436",
    "timestamp": "2026-02-24T01:55:52Z"
  },
  {
    "title": "Oil rises to near seven-month highs on US-Iran tensions",
    "description": "Feb 24 : Oil prices rose on Tuesday, nearing seven-month highs, with traders assessing risks to supply from any military escalation as another round of U.S.-Iran nuclear talks loomed.Brent crude futures rose 48 cents, or 0.7 per cent, to $71.97 a barrel by 06…",
    "link": "https://www.channelnewsasia.com/business/oil-rises-near-seven-month-highs-us-iran-tensions-5948436",
    "timestamp": "2026-02-24T01:55:52Z"
  },
  {
    "title": "Trump set to deliver second term’s first State of the Union: What to expect",
    "description": "The US president's polarising policies risk voter backlash in the November midterm elections.",
    "link": "https://www.aljazeera.com/news/2026/2/24/trump-set-to-deliver-second-terms-first-state-of-the-union-what-to-expect",
    "timestamp": "2026-02-24T01:54:24Z"
  },
  {
    "title": "Flavor Flav Offers to Host US Women’s Hockey Team in Las Vegas",
    "description": "The Public Enemy rapper wants to \"celebrate these women for real for real.\"\nFlavor Flav Offers to Host US Women’s Hockey Team in Las Vegas\nAlex Young",
    "link": "https://consequence.net/2026/02/flavor-flav-womens-hockey-team/",
    "timestamp": "2026-02-24T01:50:42Z"
  },
  {
    "title": "Dollar languishes as Asia markets reopen to renewed tariff turmoil",
    "description": "The dollar weakened as renewed U.S. tariff threats clouded global trade prospects following a Supreme Court ruling. Asian markets reacted to the uncertainty, with the yen showing slight weakness after reports of U.S. intervention discussions. The European Uni…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-languishes-as-asia-markets-reopen-to-renewed-tariff-turmoil/articleshow/128736409.cms",
    "timestamp": "2026-02-24T01:48:52Z"
  },
  {
    "title": "This MAGA media figure is about to cause 'a whole lot more drama' for Trump: analyst",
    "description": "A MAGA media figure is about to cause \"a whole lot more drama\" for President Donald Trump, according to one analyst. Last week, Tucker Carlson released an interview with Trump's ambassador to Israel, Mike Huckabee, where he accused a former Israeli Prime Mini…",
    "link": "https://www.rawstory.com/trump-2675303066/",
    "timestamp": "2026-02-24T01:48:24Z"
  },
  {
    "title": "Oil Steadies as Trump Reiterates Preference for Deal with Iran",
    "description": "Oil steadied as US President Donald Trump said his preference was for a nuclear deal with Iran before talks this week, though he warned of consequences if an agreement wasn’t reached.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steadies-as-trump-reiterates-preference-for-deal-with-iran",
    "timestamp": "2026-02-24T01:45:45Z"
  },
  {
    "title": "Trump Official Disputes Kristi Noem’s Claim About ‘Cannibal’ Who ‘Tried to Eat Himself’ While in Custody",
    "description": "A wild tale about an undocumented immigrant told by Homeland Security Secretary Kristi Noem \"is completely false,\" a senior federal law enforcement official said.\nThe post Trump Official Disputes Kristi Noem’s Claim About ‘Cannibal’ Who ‘Tried to Eat Himself’…",
    "link": "https://www.mediaite.com/politics/trump-official-disputes-kristi-noems-claim-about-cannibal-who-tried-to-eat-himself-while-in-custody/",
    "timestamp": "2026-02-24T01:44:56Z"
  },
  {
    "title": "House Dem compares Trump's illegal immigration crackdown to 'terrorism,' vows to abolish ICE",
    "description": "Oregon Democrat compares U.S. immigration enforcement to \"terrorism\" in viral town hall video, vowing to dismantle ICE if party regains political power.",
    "link": "https://www.foxnews.com/politics/house-dem-compares-trumps-illegal-immigration-crackdown-terrorism-abolish-ice",
    "timestamp": "2026-02-24T01:44:27Z"
  },
  {
    "title": "US Senate Democrats introduce bill to force refunds of Trump tariffs deemed illegal",
    "description": "Twenty-two Senate Democrats have proposed a bill to refund all tariffs collected under President Donald Trump's administration. These tariffs were recently invalidated by the U.S. Supreme Court. The legislation mandates refunds with interest within 180 days. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senate-democrats-introduce-bill-to-force-refunds-of-trump-tariffs-deemed-illegal/articleshow/128736256.cms",
    "timestamp": "2026-02-24T01:42:20Z"
  },
  {
    "title": "Trump hits out at reports that top general flagged risks of attacking Iran",
    "description": "US president slams reports that General Dan Caine warned him of risks of war with Iran as '100 percent incorrect'.",
    "link": "https://www.aljazeera.com/news/2026/2/24/trump-hits-out-at-reports-that-top-general-flagged-risks-of-attacking-iran",
    "timestamp": "2026-02-24T01:41:30Z"
  },
  {
    "title": "Developer behind Gold Coast Trump Tower proposal went bankrupt twice",
    "description": "A search by the ABC of federal insolvency records reveals the developer has had personal financial scrapes.",
    "link": "https://www.abc.net.au/news/2026-02-24/trump-tower-developer-went-bankrupt-twice/106379446",
    "timestamp": "2026-02-24T01:38:41Z"
  },
  {
    "title": "\"Buyer beware\": Trump threatens steeper tariffs after court setback",
    "description": "U.S. President Donald Trump has issued a severe new warning to U.S. trading partners following a recent Supreme Court decision that quashed his previous global duties.",
    "link": "https://www.digitimes.com/news/a20260224VL206/donald-trump-taiwan-supreme.html",
    "timestamp": "2026-02-24T01:37:09Z"
  },
  {
    "title": "WATCH LIVE: Gov. Spanberger delivers Democratic response to Trump's State of the Union",
    "description": "Virginia Gov. Abigail Spanberger will deliver the Democratic response to President Donald Trump's State of the Union address, just months after resoundingly winning an office previously held by a Republican.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-gov-spanberger-delivers-democratic-response-to-trumps-state-of-the-union",
    "timestamp": "2026-02-24T01:36:44Z"
  },
  {
    "title": "US sheds light on its allegation of Chinese nuclear test and urges nations to push for disarmament",
    "description": "A US official has revealed new details of a Chinese nuclear test from 2020. He urged nations to press China and Russia for nuclear disarmament. The US believes China is rapidly expanding its nuclear arsenal. This comes as the last US-Russia arms pact expired,…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-sheds-light-on-its-allegation-of-chinese-nuclear-test-and-urges-nations-to-push-for-disarmament/articleshow/128736152.cms",
    "timestamp": "2026-02-24T01:36:04Z"
  },
  {
    "title": "Trump Replaces Old Illegal Tariffs With New Illegal Tariffs",
    "description": "The Reason editors discuss the Supreme Court's decision striking down President Donald Trump's 'emergency' tariffs, and what comes next.",
    "link": "https://reason.com/podcast/2026/02/23/trump-replaces-old-illegal-tariffs-with-new-illegal-tariffs/",
    "timestamp": "2026-02-24T01:33:26Z"
  },
  {
    "title": "Trump Settles Suit Over Use of 'Hold On, I'm Coming'",
    "description": "The estate of singer and songwriter Isaac Hayes has dropped its copyright lawsuit against President Trump and his campaign after reaching a settlement over the use of the 1966 soul hit \"Hold On, I'm Coming\" at political rallies. The estate sued in 2024, argui…",
    "link": "https://www.newser.com/story/384234/trump-settles-suit-over-use-of-hold-on-im-coming.html",
    "timestamp": "2026-02-24T01:30:00Z"
  },
  {
    "title": "Trump pulls back endorsement of U.S. Rep. Jeff Hurd after he bucked president on tariff vote",
    "description": "\"Leadership requires independent judgment and the willingness to stand on principle,\" Rep. Jeff Hurd posted online after President Donald Trump revoked his endorsement of the freshman Republican.",
    "link": "https://www.denverpost.com/2026/02/23/jeff-hurd-trump-endorsement-hope-scheppelman/",
    "timestamp": "2026-02-24T01:29:08Z"
  },
  {
    "title": "Trump administration weighs new Section 232 tariffs after Supreme Court setback",
    "description": "According to the The Wall Street Journal, the proposed tariffs would be imposed under Section 232 of the Trade Expansion Act of 1962, separate from the recently announced 15% global tariff",
    "link": "https://www.thehindubusinessline.com/news/world/trump-administration-weighs-new-section-232-tariffs-after-supreme-court-setback/article70669544.ece",
    "timestamp": "2026-02-24T01:28:39Z"
  },
  {
    "title": "Two new federal polls have One Nation gaining on Labor",
    "description": "Polls have the combined primary vote for Labor and the Greens dropping. But there’s no sign of a boost for the Coalition after its leadership change.",
    "link": "https://theconversation.com/two-new-federal-polls-have-one-nation-gaining-on-labor-276595",
    "timestamp": "2026-02-24T01:23:21Z"
  },
  {
    "title": "HERE WE GO: FedEx Sues US, Seeks Refund of Trump’s Tariffs After Supreme Court Ruling",
    "description": "FedEx filed a lawsuit against the US and is seeking a refund of President Trump’s tariffs after the Supreme Court’s ruling.\nThe post HERE WE GO: FedEx Sues US, Seeks Refund of Trump’s Tariffs After Supreme Court Ruling appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/02/here-we-go-fedex-sues-us-seeks-refund/",
    "timestamp": "2026-02-24T01:20:37Z"
  },
  {
    "title": "4 years of war in Ukraine: by the numbers",
    "description": "Russia's invasion of Ukraine four years ago launched Europe's biggest conflict since the Second World War, causing immense suffering for civilians and harrowing ordeals for soldiers while rewriting the post-Cold War security order.",
    "link": "https://www.cbc.ca/news/world/ukraine-russia-fourth-anniversay-war-by-the-numbers-9.7103304",
    "timestamp": "2026-02-24T01:20:32Z"
  },
  {
    "title": "Notorious Mexican Drug Lord Was Killed After Secret Rendezvous with Lover Went Awry",
    "description": "\"As President Trump has made clear, cartels are terrorist groups, and this Department of Justice is devoted to destroying cartels.\"",
    "link": "https://www.westernjournal.com/notorious-mexican-drug-lord-killed-secret-rendezvous-lover-went-awry/",
    "timestamp": "2026-02-24T01:19:39Z"
  },
  {
    "title": "Kristi Noem's outlandish cannibal migrant tale exposed as 'lie': 'Completely made up'",
    "description": "Homeland Security Secretary Kristi Noem's sensational story about a self-cannibalistic immigrant on a U.S. Immigration and Customs Enforcement deportation flight never happened, according to a new report.Noem spun the lurid yarn over the summer while standing…",
    "link": "https://www.rawstory.com/kristi-noem-2675302703/",
    "timestamp": "2026-02-24T01:17:24Z"
  },
  {
    "title": "FedEx sues US for refund on Trump's emergency tariffs",
    "description": "Global firm FedEx has sued for a refund of tariffs imposed by former President Donald Trump. The U.S. Supreme Court recently declared these tariffs illegal. This move is expected to trigger many lawsuits seeking billions in refunds. Trade attorneys anticipate…",
    "link": "https://economictimes.indiatimes.com/news/international/business/fedex-sues-us-for-refund-on-trumps-emergency-tariffs/articleshow/128735785.cms",
    "timestamp": "2026-02-24T01:16:41Z"
  },
  {
    "title": "Exclusive— Sen. Tom Cotton: Democrats Oppose SAVE Act to 'Cheat' in Elections",
    "description": "Sen. Tom Cotton (R-AR) said the Democrats' opposition to the SAVE America Act is because \"they want to make it easy to cheat in our elections\" in an exclusive statement to Breitbart News.\nThe post Exclusive— Sen. Tom Cotton: Democrats Oppose SAVE Act to ‘Chea…",
    "link": "https://www.breitbart.com/politics/2026/02/23/exclusive-sen-cotton-democrats-oppose-save-act-cheat-elections/",
    "timestamp": "2026-02-24T01:16:13Z"
  },
  {
    "title": "Donald Trump State of the Union Address: U.S. President SOTU speech to drop bombshell as approval ratings fall big time?",
    "description": "Donald Trump is expected to host the traditional lunch on Tuesday with anchors from the five main networks: NBC, CBS, ABC, Fox and CNN. Officials said Trump also invited guests from new media outlets.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-state-of-the-union-address-u-s-president-sotu-speech-to-drop-bombshell-as-approval-ratings-go-down/articleshow/128735655.cms",
    "timestamp": "2026-02-24T01:15:47Z"
  },
  {
    "title": "US aims to shift blame for Iran strikes onto Israel – source",
    "description": "Tehran will deem any attack a “full-scale war,” regardless of the direct perpetrator, an Iranian defense source has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632948-iran-us-israel-shift-blame/",
    "timestamp": "2026-02-24T01:14:05Z"
  },
  {
    "title": "Trump denies top US officer warned of Iran strike risks",
    "description": "President Donald Trump denied reports that top US general Dan Caine warned against striking Iran, insisting the US would “easily” win any war. Media outlets reported concerns over casualties and prolonged conflict, but Trump dismissed them as false. While thr…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-denies-top-us-officer-warned-of-iran-strike-risks/articleshow/128735699.cms",
    "timestamp": "2026-02-24T01:13:42Z"
  },
  {
    "title": "Global Market Today | Asian stocks follow US lower on tariff uncertainty",
    "description": "Asian shares declined as AI's impact on profits and tariff uncertainty worried investors. Wall Street saw a significant drop, with tech stocks particularly affected by AI disruption fears. This follows a strong start to the year for Asian markets compared to …",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-market-today-asian-stocks-follow-us-lower-on-tariff-uncertainty/articleshow/128735707.cms",
    "timestamp": "2026-02-24T01:12:21Z"
  },
  {
    "title": "U.S. women's hockey declines Trump invite to State of the Union - ESPN",
    "description": "U.S. women's hockey declines Trump invite to State of the UnionESPN US women’s hockey team declines Trump’s State of the Union invite, citing schedulingCNN US women's gold medal-winning team declines invitation from Trump to attend State of the Union address1…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180851462",
    "timestamp": "2026-02-24T01:12:10Z"
  },
  {
    "title": "US details Chinese nuclear test allegation, urges global push for disarmament",
    "description": "US claims China carried out a 2020 underground nuclear test at Lop Nur, urging Beijing and Moscow to engage in disarmament after New START expired.",
    "link": "https://www.thehindubusinessline.com/news/world/us-details-chinese-nuclear-test-allegation-urges-global-push-for-disarmament/article70669516.ece",
    "timestamp": "2026-02-24T01:11:42Z"
  },
  {
    "title": "Tariff dividend checks that were never happening still not happening",
    "description": "The Supreme Court’s holding that Trump’s IEEPA tariffs were statutorily unauthorized was important, but some things it didn’t change at all: The Supreme Court struck down a centerpiece of President Donald Trump’s tariff agenda on Friday, also dealing a blow t…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/tariff-dividend-checks-that-were-never-happening-still-not-happening",
    "timestamp": "2026-02-24T01:10:36Z"
  },
  {
    "title": "How Trump will use his State of the Union address to appeal to skeptical midterm voters",
    "description": "President Donald Trump's State of the Union address on Tuesday is likely to be a test run of the message Republicans will give to voters in November's elections for control of the House and the Senate.",
    "link": "https://www.pbs.org/newshour/politics/how-trump-will-use-his-state-of-the-union-address-to-appeal-to-skeptical-midterm-voters",
    "timestamp": "2026-02-24T01:10:06Z"
  },
  {
    "title": "Trump Issues New Threat To Countries That Abide By 'Ridiculous Supreme Court' Ruling",
    "description": "President Donald Trump issued a warning to \"any country\" that tried to use the Supreme Court's recent decision to buck his tariffs.\n\n\n\"Any Country that wants to 'play games' with the ridiculous supreme court [sic] decision, especially those that have 'Ripped …",
    "link": "https://crooksandliars.com/2026/02/trump-issues-new-threat-countries-abide",
    "timestamp": "2026-02-24T01:06:56Z"
  },
  {
    "title": "Trump says he's kept all of his campaign promises. PolitiFact's MAGA-Meter shows otherwise",
    "description": "President Donald Trump has said he already delivered on all he returned to office to do. The truth? Trump fulfilled a decent chunk of his domestic agenda in his first year, but many promises remain undelivered.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-hes-kept-all-of-his-campaign-promises-politifacts-maga-meter-shows-otherwise",
    "timestamp": "2026-02-24T01:06:15Z"
  },
  {
    "title": "Trump warns countries that 'play games' with US trade deals will face higher tariffs",
    "description": "President Donald Trump issued a stern warning to nations considering reneging on trade agreements. Following a Supreme Court decision invalidating his emergency tariffs, Trump threatened significantly higher duties and potential license fees. This move has in…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-warns-countries-that-play-games-with-us-trade-deals-will-face-higher-tariffs/articleshow/128735592.cms",
    "timestamp": "2026-02-24T01:05:30Z"
  },
  {
    "title": "Congress Must Rein in ICE to Improve the State of the Union",
    "description": "In times of war and peace, prosperity and depression, American presidents have complied with their constitutional obligation to deliver to Congress an update on the nation.\nIt’s a hallowed tradition, but this year, due to President Donald Trump’s own actions,…",
    "link": "https://www.aclu.org/news/immigrants-rights/congress-must-rein-in-ice-to-improve-the-state-of-the-union",
    "timestamp": "2026-02-24T01:05:02Z"
  },
  {
    "title": "Security forces keep up fight with cartel gunmen a day after the Mexican military killed a drug lord",
    "description": "Mexico's army has killed drug lord Nemesio Oseguera Cervantes, known as El Mencho. His death triggered widespread violence across the country. Roadblocks and fires erupted as cartel fighters retaliated. Over 70 people died in the operation and its aftermath. …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/security-forces-keep-up-fight-with-cartel-gunmen-a-day-after-the-mexican-military-killed-a-drug-lord/articleshow/128735518.cms",
    "timestamp": "2026-02-24T01:01:06Z"
  },
  {
    "title": "White House calls CNN a 'total disgrace' for skipping event honoring victims of illegal immigrant crime",
    "description": "White House officials Kaelan Dorr and Karoline Leavitt blast CNN for insufficient coverage of ceremony honoring families slain by illegal immigrants.",
    "link": "https://www.foxnews.com/media/white-house-calls-cnn-total-disgrace-skipping-event-honoring-victims-illegal-immigrant-crime",
    "timestamp": "2026-02-24T01:00:38Z"
  },
  {
    "title": "US women’s gold medal-winning team declines invitation from Trump to attend State of Union address",
    "description": "The team said it was “sincerely grateful for the invitation.\"",
    "link": "https://www.bostonherald.com/2026/02/23/us-womens-hockey-trump-invitation/",
    "timestamp": "2026-02-24T01:00:35Z"
  },
  {
    "title": "Trump eyes new trade probes to revive tariffs after court defeat",
    "description": "The US administration is preparing new national security investigations that could allow President Donald Trump to impose fresh tariffs after the Supreme Court struck down his country-specific emergency levies last week.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-eyes-new-trade-probes-to-revive-tariffs-after-court-defeat/articleshow/128735513.cms",
    "timestamp": "2026-02-24T00:59:51Z"
  },
  {
    "title": "Senate Democrats push $175 billion tariff refund after Supreme Court ruling",
    "description": "Senate Democrats unveil bill to refund $175 billion in Trump-era tariffs after Supreme Court ruling, pushing relief for small businesses before midterms.",
    "link": "https://www.thehindubusinessline.com/news/world/senate-democrats-push-175-billion-tariff-refund-after-supreme-court-ruling/article70669515.ece",
    "timestamp": "2026-02-24T00:59:27Z"
  },
  {
    "title": "FedEx sues U.S. Government seeking full refund of Trump tariffs after Supreme Court ruling",
    "description": "FedEx has filed a case to get back tariff money from the U.S. government after a court ruling against Trump’s trade policy. The decision has also encouraged many big companies to demand refunds. The case may affect billions of dollars already collected. The s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/fedex-sues-u-s-government-seeking-full-refund-of-trump-tariffs-after-supreme-court-ruling/articleshow/128734921.cms",
    "timestamp": "2026-02-24T00:56:13Z"
  },
  {
    "title": "Judge blocks release of special counsel report",
    "description": "WASHINGTON — A federal judge on Monday permanently barred the release of a report by special counsel Jack Smith on his investigation into President Donald Trump’s hoarding of classified documents, a prosecution that was once seen as the most perilous of the f…",
    "link": "https://www.bostonherald.com/2026/02/23/judge-blocks-release-of-special-counsel-report/",
    "timestamp": "2026-02-24T00:53:45Z"
  },
  {
    "title": "Trump Demanded El Mencho’s Head. Mexicans Are Paying the Price.",
    "description": "The violence in Mexico is fueled by U.S. guns and money. Killing a cartel boss won’t change that.\nThe post Trump Demanded El Mencho’s Head. Mexicans Are Paying the Price. appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/23/trump-el-mencho-mexico-cartel/",
    "timestamp": "2026-02-24T00:52:29Z"
  },
  {
    "title": "US women’s hockey team declines Trump’s State of the Union invite, citing scheduling - CNN",
    "description": "US women’s hockey team declines Trump’s State of the Union invite, citing schedulingCNN Flavor Flav invites US women's hockey team to Las Vegas for Olympic celebration after Trump snubFox News U.S. women's hockey team declines Trump's invitation to the State …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180850806",
    "timestamp": "2026-02-24T00:52:22Z"
  },
  {
    "title": "Trump's big speech will be delivered to a changed nation and a Congress he has sidelined",
    "description": "One year back in office, Trump has emerged as a president defying conventional expectations. He has executed a head-spinning agenda, upending priorities at home, shattering alliances abroad and challenging the nation's foundational system of checks and balanc…",
    "link": "https://www.pbs.org/newshour/politics/trumps-big-speech-will-be-delivered-to-a-changed-nation-and-a-congress-he-has-sidelined",
    "timestamp": "2026-02-24T00:49:30Z"
  },
  {
    "title": "US judge permanently blocks release of report on Trump documents case",
    "description": "A US judge has stopped the Justice Department from releasing a prosecutor's report on Donald Trump's classified documents case. The judge ruled that releasing the report would be unfair to Trump and his associates. The case involved allegations of illegally s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-judge-permanently-blocks-release-of-report-on-trump-documents-case/articleshow/128735333.cms",
    "timestamp": "2026-02-24T00:49:13Z"
  },
  {
    "title": "Gold Price today: Spot gold rate falls. Here's what is impacting Gold, silver",
    "description": "Gold, seen as a safe store of value during economic and geopolitical uncertainty, also tends to perform well when interest rates are low.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-spot-gold-rate-falls-heres-what-is-impacting-gold-silver/articleshow/128735297.cms",
    "timestamp": "2026-02-24T00:48:46Z"
  },
  {
    "title": "U.S. military says strike on alleged drug boat kills 3 in Caribbean Sea",
    "description": "The U.S. military said it killed three people Monday in a strike on an alleged drug-smuggling vessel in the Caribbean Sea as part of the Trump administration's months-long campaign against alleged traffickers.",
    "link": "https://www.cbc.ca/news/world/us-military-strike-alleged-drug-boat-9.7103366",
    "timestamp": "2026-02-24T00:44:21Z"
  },
  {
    "title": "'Fake F**king Outrage': Gavin Newsom Defends Himself After MAGA Blasts Him For Being 'Racist'",
    "description": "The California governor received backlash after he told an Atlanta audience that he’s just like them because he got “a 960 SAT” score and “cannot read.”",
    "link": "https://www.huffpost.com/entry/gavin-newsom-maga-outrage-atlanta-sat-read_n_699cb722e4b01da50152b832",
    "timestamp": "2026-02-24T00:43:02Z"
  },
  {
    "title": "“Spare me your fake f**king outrage”: Newsom lashes out at Hannity over allegations of racism",
    "description": "Newsom called Hannity a hypocrite after the television host accused the governor of racism.",
    "link": "https://www.salon.com/2026/02/23/spare-me-your-fake-fking-outrage-newsom-lashes-out-at-hannity-over-allegations-of-racism/",
    "timestamp": "2026-02-24T00:42:59Z"
  },
  {
    "title": "How Trump’s FDA is breaking his promise to America’s patients",
    "description": "A worrisome new ideological shift at the Food and Drug Administration threatens to undermine President Trump's worthy goals — from within.",
    "link": "https://nypost.com/2026/02/23/opinion/how-trumps-fda-is-breaking-his-promise-to-americas-patients/",
    "timestamp": "2026-02-24T00:39:17Z"
  },
  {
    "title": "'Friction' rising in Trump admin as officials desperately try to revive tariffs: report",
    "description": "President Donald Trump almost immediately vowed to re-implement his global tariffs after the Supreme Court struck down his authority to implement them under emergency powers law — but inside the administration, his officials are scrambling to try to find a wa…",
    "link": "https://www.rawstory.com/trump-tariffs-2675300854/",
    "timestamp": "2026-02-24T00:38:40Z"
  },
  {
    "title": "Trump Eyes Post-State of the Union Texas Trip Before Key Primary",
    "description": "President Donald Trump will head to Texas on Friday, promoting the economic and energy policies he’s expected to tout at his State of the Union address in the heart of one of the most hotly contested Senate primary races.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-eyes-post-state-of-the-union-texas-trip-before-key-primary",
    "timestamp": "2026-02-24T00:34:10Z"
  },
  {
    "title": "Trump’s Suddenly High-Stakes State of the Union",
    "description": "The president is visiting Congress in a dramatically different place from where he was a year ago.",
    "link": "https://www.theatlantic.com/politics/2026/02/trump-state-of-the-union-2026-tariffs-iran/686118/",
    "timestamp": "2026-02-24T00:32:00Z"
  },
  {
    "title": "Stop mis-selling, focus on core business: FM Nirmala Sitharaman to banks",
    "description": "Finance Minister Nirmala Sitharaman has instructed banks to halt the mis-selling of financial products such as insurance and to refocus on their primary role of taking deposits and extending credit. At the same time, the Commerce Ministry is reviewing how the…",
    "link": "https://economictimes.indiatimes.com/industry/banking/finance/banking/stop-mis-selling-focus-on-core-business-fm-nirmala-sitharaman-to-banks/articleshow/128727166.cms",
    "timestamp": "2026-02-24T00:30:00Z"
  }
]