[
  {
    "title": "Trump’s Latest Ukraine Reversal Reveals a Disturbing Truth About the Administration",
    "description": "We didn’t quite know the extent to which no one is in charge.",
    "link": "https://slate.com/news-and-politics/2025/07/trump-news-ukraine-weapons-hegseth-rubio-russia-putin.html",
    "timestamp": "2025-07-08T20:18:35Z"
  },
  {
    "title": "Trump 'visibly' shows 'classic sign of dementia,' expert warns as health fears grow - NewsBreak",
    "description": "As the oldest person ever inaugurated as President of the US, serious question about Donald Trump's mental ability have been raised with even people in his",
    "link": "https://www.newsbreak.com/share/4094700790185-trump-visibly-shows-classic-sign-of-dementia-expert-warns-as-health-fears-grow?s=a2&amp;share_destination_id=MTk1MDk1ODMxLTE3NTIwMDU4Nzg1NDY%3D&amp;pd=0DCbKx5w&amp;hl=en_US&amp;send_time=1752005878&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v2%2Cns_foryou_recall_exp_25q3-v2%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v2",
    "timestamp": "2025-07-08T20:18:23Z"
  },
  {
    "title": "Trump and Netanyahu set to meet again Tuesday on Gaza",
    "description": "U.S. President Donald Trump and Israeli Prime Minister Benjamin Netanyahu will meet for a second time in two days Tuesday afternoon to discuss Gaza.",
    "link": "https://www.cbc.ca/news/world/israel-gaza-ceasefire-trump-netanyahu-1.7580102",
    "timestamp": "2025-07-08T20:18:13Z"
  },
  {
    "title": "Get Ready For 800 Hours Of Blackouts, Trump's DOE Warns",
    "description": "The Department of Energy (DOE) under President Donald Trump released a report warning that the planned shutdown of existing power plants, combined with delays in bringing new energy sources online, could result in a significant increase in blackouts by the en…",
    "link": "https://biztoc.com/x/b6389826eb76df49",
    "timestamp": "2025-07-08T20:16:27Z"
  },
  {
    "title": "SCOTUS lifts mass federal layoff ban",
    "description": "The United States Supreme Court (SCOTUS) lifted on Tuesday the measure blocking the administration of United States President Donald Trump from reducing the size of the federal workforce and cutting g...",
    "link": "https://biztoc.com/x/3a23fbdba56fa26a",
    "timestamp": "2025-07-08T20:16:26Z"
  },
  {
    "title": "US envoy Steve Witkoff suggests Gaza ceasefire deal is close",
    "description": "Trump aide says Washington 'hopeful' a 60-day truce between Israel and Hamas can be reached by the end of the week.",
    "link": "https://www.aljazeera.com/news/2025/7/8/us-envoy-steve-witkoff-suggests-gaza-ceasefire-deal-is-close",
    "timestamp": "2025-07-08T20:16:25Z"
  },
  {
    "title": "Trump Snaps at Reporter Asking About Epstein Records: ‘Are People Still Talking About This Guy?’ | Video",
    "description": "\"It's just seems like a desecration, but you go ahead,\" Trump says before giving the floor to Pam Bondi\nThe post Trump Snaps at Reporter Asking About Epstein Records: ‘Are People Still Talking About This Guy?’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-slams-reporter-jeffrey-epstein-client-list-prison-cell-footage-pam-bondi/",
    "timestamp": "2025-07-08T20:16:23Z"
  },
  {
    "title": "FAIR: ‘The Goal Is to Put the Words “Iran” and “Nuclear” in the Same Sentence’: CounterSpin interview with Adam Johnson on media in war mode",
    "description": "\"The scope of debate...is not 'Do we have any legitimacy to be bombing Iran?' but 'Is bombing Iran the best way to stop them from enriching uranium?'”",
    "link": "https://fair.org/home/the-goal-is-to-put-the-words-iran-and-nuclear-in-the-same-sentence/",
    "timestamp": "2025-07-08T20:15:54Z"
  },
  {
    "title": "Biden's handlers scrambled to change his personal number after journalist reached him on his cell: Book",
    "description": "A New York Times reporter reached President Biden on his personal cell phone for an interview, causing his aides to panic and disconnect the number, a new book claims.",
    "link": "https://www.foxnews.com/media/bidens-handlers-scrambled-change-his-personal-number-after-journalist-reached-him-his-cell",
    "timestamp": "2025-07-08T20:15:17Z"
  },
  {
    "title": "Biden Aides Cut His Phone Line After Surprise Call With Reporter, Book Reveals",
    "description": "After Joe Biden unexpectedly answered a reporter's call and gave unscripted comments about the Trump administration and the 2024 election, his aides scrambled to shut down contact—blocking the reporter and disconnecting Biden's number days later, according to…",
    "link": "https://freebeacon.com/latest-news/biden-aides-cut-his-phone-line-after-surprise-call-with-reporter-book-reveals/",
    "timestamp": "2025-07-08T20:15:02Z"
  },
  {
    "title": "AG Bondi Explains Why Trump Admin Hasn’t Released Epstein Client List",
    "description": "President Donald Trump sharply criticized a reporter for asking a question about deceased pedophile Jeffrey Epstein amid the devastating Texas flash flooding that has killed... Read More\nThe post AG Bondi Explains Why Trump Admin Hasn’t Released Epstein Clien…",
    "link": "https://www.dailysignal.com/2025/07/08/ag-bondi-explains-why-trump-admin-hasnt-released-epstein-client-list/",
    "timestamp": "2025-07-08T20:15:00Z"
  },
  {
    "title": "Trump's tariff deadline delay brings hope, confusion to trade partners, businesses",
    "description": "WASHINGTON, (Reuters) - U.S. President Donald Trump’s latest tariff delay provided some hope to major trade partners Japan, South Korea and the European Union that deals to ease duties could still be reached, while bewildering some smaller exporters such as S…",
    "link": "https://www.nbcnews.com/business/business-news/trumps-tariff-deadline-delay-brings-hope-confusion-trade-partners-busi-rcna217511",
    "timestamp": "2025-07-08T20:13:00Z"
  },
  {
    "title": "BREAKING: U.S. Supreme Court Greenlights Trump’s Federal Government Purge in 8–1 Ruling — Mass Layoffs and Overhaul Back on Track in 20 Federal Agencies",
    "description": "The U.S.\nThe post BREAKING: U.S. Supreme Court Greenlights Trump’s Federal Government Purge in 8–1 Ruling — Mass Layoffs and Overhaul Back on Track in 20 Federal Agencies appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/supreme-court-greenlights-trumps-federal-government-purge-mass/",
    "timestamp": "2025-07-08T20:12:53Z"
  },
  {
    "title": "Supreme Court backs Trump’s effort to dramatically reshape federal government for now",
    "description": "he Supreme Court on Tuesday backed President Donald Trump’s effort to carry out mass firings and reorganizations at federal agencies, putting on hold a lower court order that had temporarily blocked the president from taking those steps without approval from …",
    "link": "https://freerepublic.com/focus/f-news/4327565/posts",
    "timestamp": "2025-07-08T20:10:21Z"
  },
  {
    "title": "'Not getting involved': Trump monitors NYC mayoral race but declines to endorse (Bart Jansen/USA Today)",
    "description": "Bart Jansen / USA Today:\n‘Not getting involved’: Trump monitors NYC mayoral race but declines to endorse  —  Trump has criticized the Democratic nominee, Zohran Mamdani, but was reluctant to back to an opponent in the race.  —  WASHINGTON - President Donald T…",
    "link": "https://www.memeorandum.com/250708/p109",
    "timestamp": "2025-07-08T20:10:00Z"
  },
  {
    "title": "Tucker Carlson Unleashes Bizarre Theories On Why Pam Bondi Is Hiding Epstein List",
    "description": "The conservative pundit thinks he knows precisely the reason why Attorney General Pam Bondi is \"covering up\" Epstein's list.",
    "link": "https://www.huffpost.com/entry/tucker-carlson-pam-bondi-epstein-list_n_686d4403e4b088c62569ae43",
    "timestamp": "2025-07-08T20:09:12Z"
  },
  {
    "title": "Trump flags tariffs of 200pc on pharmaceuticals, 50pc on copper",
    "description": "Donald Trump flags a possible 200 per cent tariff on pharmaceuticals — one of Australia's biggest exports to the US — and says copper could be hit with a 50 per cent levy.",
    "link": "https://www.abc.net.au/news/2025-07-09/donald-trump-tariffs-copper-pharmaceutical-imports/105509914",
    "timestamp": "2025-07-08T20:09:12Z"
  },
  {
    "title": "Ripping GOP Megabill's Attack on Medicaid, Pro-Labor Dan Osborn Runs for Senate in Nebraska",
    "description": "Mechanic and former labor union leader Dan Osborn, who last year ran for the United States Senate as an independent in deep-red Nebraska and came within 63,000 votes of defeating incumbent Republican Sen. Deb Fischer, is getting back into the ring.Osborn anno…",
    "link": "https://www.commondreams.org/news/dan-osborn-senate-2026",
    "timestamp": "2025-07-08T20:08:08Z"
  },
  {
    "title": "Trump: Elon Musk's political party will 'help us'",
    "description": "President Donald Trump said on Tuesday that Elon Musk's new political party will help him, and he is not rethinking any cuts that ...",
    "link": "https://biztoc.com/x/41c1afb1cee570e4",
    "timestamp": "2025-07-08T20:07:24Z"
  },
  {
    "title": "Supreme Court clears the way for Trump's plans to downsize the federal workforce",
    "description": "The Supreme Court has cleared the way for President Donald Trump’s plans to downsize the federal workforce.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/08/supreme-court-clears-the-way-for-trumps-plans-to-downsize-the-federal-workforce/",
    "timestamp": "2025-07-08T20:07:10Z"
  },
  {
    "title": "The plot to stop Mamdani: Democrats scramble to block far-left takeover in New York",
    "description": "Zohran Mamdani's primary victory has sparked party divisions, while rivals Andrew Cuomo and Eric Adams argue over who should drop out in unity bid to topple democratic socialist frontrunner.",
    "link": "https://www.foxnews.com/politics/plot-stop-mamdani-democrats-scramble-block-far-left-takeover-new-york",
    "timestamp": "2025-07-08T20:07:04Z"
  },
  {
    "title": "Supreme Court Clears The Way For Trump's Plans To Downsize The Federal Workforce",
    "description": "The Supreme Court has cleared the way for President Donald Trump’s plans to downsize the federal workforce.",
    "link": "https://www.huffpost.com/entry/trump-mass-firings-supreme-court_n_686d79d3e4b0d2432cccf44e",
    "timestamp": "2025-07-08T20:06:36Z"
  },
  {
    "title": "Supreme Court clears way for Trump's mass federal purge",
    "description": "The Supreme Court was not in session, as it was on summer break, but it issued a ruling on Tuesday afternoon regarding President Donald Trump's cuts to the federal workforce. The high court lifted an order from a lower court that blocked layoffs for federal w…",
    "link": "https://www.rawstory.com/government-cuts-2672963831/",
    "timestamp": "2025-07-08T20:06:36Z"
  },
  {
    "title": "What will be the climate fallout from Trump's 'big beautiful bill'?",
    "description": "The “One Big Beautiful Bill” just signed by President Trump will slash support for clean energy, leaving the US far short of its Paris Agreement pledge",
    "link": "https://www.newscientist.com/article/2487362-what-will-be-the-climate-fallout-from-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-08T20:06:21Z"
  },
  {
    "title": "Supreme Court allows Trump to proceed with firing plans, federal government reorg",
    "description": "The Supreme Court is allowing President Donald Trump to move forward with an executive order mandating a restructure of federal agencies and mass layoffs of workers.",
    "link": "https://abcnews.go.com/Politics/supreme-court-allows-trump-move-forward-plans-mass/story?id=123586738",
    "timestamp": "2025-07-08T20:05:52Z"
  },
  {
    "title": "US closes mostly flat with tariffs in focus",
    "description": "Major stock market indexes in the United States closed mostly flat on Tuesday after President Donald Trump said there would be no further delays to the tariffs scheduled to take effect on August 1.The...",
    "link": "https://biztoc.com/x/0e029800f53fe262",
    "timestamp": "2025-07-08T20:05:20Z"
  },
  {
    "title": "Dow Falls 160 Points as Stocks Slip Again",
    "description": "1 min ago\nDow Falls 160 Points as Stocks Slip Again\nThe stock market slipped again on Tuesday after President Donald Trump insisted tariffs on the bulk of U.S. trading partners will actually kick in on Aug. 1.\nThe Dow Jones Industrial Average dropped 166 poin…",
    "link": "https://biztoc.com/x/02b55fffc63c838f",
    "timestamp": "2025-07-08T20:05:17Z"
  },
  {
    "title": "Mac shipments growth outpaces PC market in face of tariff trouble",
    "description": "Apple's Mac shipments are continuing to grow faster than the rest of the PC market, a report claims, as retailers prepare for an influx of tariff costs.M4 Mac miniIn a report from IDC on Tuesday, global PC shipments in the second quarter of 2025 grew 6.5 perc…",
    "link": "https://appleinsider.com/articles/25/07/08/mac-shipments-growth-outpaces-pc-market-in-face-of-tariff-trouble",
    "timestamp": "2025-07-08T20:05:17Z"
  },
  {
    "title": "Supreme Court Gives Donald Trump New 'Major' Victory",
    "description": "The Tuesday decision said that Trump's executive order directing agencies to develop reduction in force plans are likely lawful.",
    "link": "https://biztoc.com/x/5890afa7a26131b2",
    "timestamp": "2025-07-08T20:04:51Z"
  },
  {
    "title": "Live Nation Asks Trump Administration for Resale Price Caps, Stronger Enforcement of Secondary Market",
    "description": "Live Nation is addressing concerns about the company’s practices and industry more broadly with a new packet of material meant for President Donald Trump’s administration and other government agencies, principally the U.S. Department of Justice (DoJ) and Fede…",
    "link": "https://variety.com/2025/music/news/live-nation-encourages-trump-price-caps-resales-1236449938/",
    "timestamp": "2025-07-08T20:04:16Z"
  },
  {
    "title": "Top Democrats Demand Release of All Epstein Files Naming Trump",
    "description": "House Judiciary Committee Ranking Member Jamie Raskin, along with 15 more of the 19 Democrats on the committee, demanded in a letter Tuesday that Attorney General Pam Bondi release “Epstein file” documents mentioning President Donald Trump. The letter, which …",
    "link": "https://newrepublic.com/post/197718/house-democrats-demand-release-epstein-files-naming-trump",
    "timestamp": "2025-07-08T20:03:19Z"
  },
  {
    "title": "Supreme Court Gives Trump Greenlight To Axe Federal Bureaucrats",
    "description": "The Supreme Court allowed President Donald Trump to move forward with plans to reduce the federal workforce.",
    "link": "https://dailycaller.com/2025/07/08/supreme-court-gives-trump-greenlight-to-axe-federal-bureaucrats/",
    "timestamp": "2025-07-08T20:02:40Z"
  },
  {
    "title": "Supreme Court Gives Donald Trump New 'Major' Victory",
    "description": "The Tuesday decision said that Trump's executive order directing agencies to develop reduction in force plans are likely lawful.",
    "link": "https://www.newsweek.com/supreme-court-gives-donald-trump-new-major-victory-2096314",
    "timestamp": "2025-07-08T20:02:39Z"
  },
  {
    "title": "US supreme court lifts order that blocked Trump’s mass federal lay-offs",
    "description": "Workforce reductions planned at departments of agriculture, commerce, health and more",
    "link": "https://www.irishtimes.com/world/us/2025/07/08/us-supreme-court-lifts-order-that-blocked-trumps-mass-federal-lay-offs/",
    "timestamp": "2025-07-08T20:02:29Z"
  },
  {
    "title": "Trump 'visibly' shows 'classic sign of dementia,' expert warns as health fears grow - NewsBreak",
    "description": "As the oldest person ever inaugurated as President of the US, serious question about Donald Trump's mental ability have been raised with even people in his",
    "link": "https://www.newsbreak.com/share/4094700790185-trump-visibly-shows-classic-sign-of-dementia-expert-warns-as-health-fears-grow?_f=app_share&amp;pd=05axlBno&amp;lang=en_US&amp;send_time=1752004907&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v8%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_recall_exp_25q3-v7%2Cns_foryou_model_exp_25q2_v2-v6&amp;s=i2",
    "timestamp": "2025-07-08T20:02:25Z"
  },
  {
    "title": "Trump Closes Door on Tariff Trade Talk Extensions: Here’s Where Footwear Could Be Hit the Most",
    "description": "Trump said Aug. 1 is the end date for new trade deal talks before tariff rates climb, adding that a US-India agreement is \"close\" at hand.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/trump-aug-1-trade-deal-talks-tariff-us-india-1237971546/",
    "timestamp": "2025-07-08T20:02:00Z"
  },
  {
    "title": "Treasury yields are little changed as traders focus on new Trump tariff announcements",
    "description": "U.S. Treasury yields rose as investors assess President Donald Trump's tariff letters threatening steep duties on several countries, including key allies.",
    "link": "https://www.cnbc.com/2025/07/08/treasury-yields-rise-as-trumps-new-tariff-rates-in-focus.html",
    "timestamp": "2025-07-08T20:00:53Z"
  },
  {
    "title": "NY Fed Finds Inflation Expectations Ease, but Spending Outpaces Income",
    "description": "The June Survey of Consumer Expectations by the Federal Reserve Bank of New York, released Tuesday (July 8), found at least some optimism on inflation, where price increases are still likely to be elevated, but at a slowing pace. [contact-form-7] Spending exp…",
    "link": "http://www.pymnts.com/consumer-insights/2025/new-york-federal-reserve-finds-inflation-expectations-ease-spending-outpaces-income/",
    "timestamp": "2025-07-08T20:00:25Z"
  },
  {
    "title": "Supreme Court grants Trump appeal to lift order blocking his mass federal worker firings",
    "description": "It’s the latest Supreme Court action on a Trump administration request for emergency relief from a lower court ruling.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-trump-mass-federal-worker-firings-rifs-rcna211819",
    "timestamp": "2025-07-08T19:59:45Z"
  },
  {
    "title": "SCOOP: Rep. Mike Collins teases Georgia Senate bid",
    "description": "Georgia Rep. Mike Collins is contemplating a challenge to Democratic Sen. Jon Ossoff in the 2026 Senate race, joining fellow Republicans Buddy Carter and John King in the primary.",
    "link": "https://www.foxnews.com/politics/scoop-rep-mike-collins-teases-georgia-senate-bid",
    "timestamp": "2025-07-08T19:59:25Z"
  },
  {
    "title": "Trump’s Epstein ‘Betrayal’ Won’t Cost Him Anything",
    "description": "For most Americans, the Epstein story is just a disturbing subplot that they don't think about often, and move on quickly from when they do. \nThe post Trump’s Epstein ‘Betrayal’ Won’t Cost Him Anything first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trumps-epstein-betrayal-wont-cost-him-anything/",
    "timestamp": "2025-07-08T19:59:21Z"
  },
  {
    "title": "Liberalism is worth saving. Just ask its critics.",
    "description": "Prior to Kanye West, Lawrence Dennis was America’s most famous Black fascist. Born in 1893, Dennis had European features and light skin that allowed him to pass for white, which he did for nearly his entire life. He attended Phillips Exeter Academy and Harvar…",
    "link": "https://www.vox.com/politics/418116/anti-liberal-moment-end-trump-ahmari-moyn",
    "timestamp": "2025-07-08T19:58:33Z"
  },
  {
    "title": "Measles Cases Surge To Highest Level Since The Disease Was Eliminated In U.S.",
    "description": "At least 1,277 cases have been reported as of Monday, surpassing the previous record set in 2019, despite 2025 being only halfway over.",
    "link": "https://www.huffpost.com/entry/measles-cases-rise-to-highest-level-since-its-elimination_n_686d1da6e4b0525032870a1a",
    "timestamp": "2025-07-08T19:58:17Z"
  },
  {
    "title": "Every reporter in DC has Trump’s phone number – Biden aides allegedly disconnected his after one phone call",
    "description": "Trump frequently takes calls and gives calls to reporters, but after one journalist got ahold of Biden, his aides appeared to disconnect the phone number.",
    "link": "https://dailycaller.com/2025/07/08/donald-trump-phone-number-joe-biden-aides-basement-campaign/",
    "timestamp": "2025-07-08T19:58:13Z"
  },
  {
    "title": "Supreme Court clears the way for Trump’s plans to downsize the federal workforce",
    "description": "WASHINGTON (AP) — The Supreme Court on Tuesday cleared the way for President Donald Trump’s plans to downsize the federal workforce despite warnings that critical government services will be lost and hundreds of thousands of federal employees will be out of t…",
    "link": "https://financialpost.com/pmn/supreme-court-clears-the-way-for-trumps-plans-to-downsize-the-federal-workforce",
    "timestamp": "2025-07-08T19:56:52Z"
  },
  {
    "title": "Trump’s New Tariff Threat Will Send Medication Prices Skyrocketing",
    "description": "President Trump wants to place a 200 percent tariff on your pharmaceuticals. “We’ll be announcing something very soon on pharmaceuticals, we’re gonna give people about a year, year and a half to come in and after that they’re gonna be tariffed. If they have t…",
    "link": "https://newrepublic.com/post/197717/trump-tariff-threat-medication-prices-skyrocket",
    "timestamp": "2025-07-08T19:56:37Z"
  },
  {
    "title": "The wrong lesson to take from Trump’s gutting of Medicaid",
    "description": "Last week, the Senate passed the largest cut to America’s welfare state in modern history. President Donald Trump’s inaptly named “One Big Beautiful Bill” would take health insurance from 11.8 million Americans and slash food assistance to low-income families…",
    "link": "https://www.vox.com/politics/419206/trump-medicaid-cuts-democrats",
    "timestamp": "2025-07-08T19:55:50Z"
  },
  {
    "title": "Trump to attend Club World Cup final at MetLife",
    "description": "U .S. President Donald Trump will attend Sunday's Club World Cup final in East Rutherford, New Jersey, he said at a Cabinet meeting on Tuesday, as world soccer's ruling body FIFA announced it had opened an office in New York's Trump Tower.",
    "link": "https://www.espn.com/soccer/story/_/id/45696463/trump-attend-club-world-cup-final-metlife-stadium",
    "timestamp": "2025-07-08T19:55:03Z"
  },
  {
    "title": "Deepfake targets Trump administration! AI voice is used by imposter to contact foreign, U.S officials posing as Secretary of State Marco Rubio",
    "description": "Several potential solutions have been put forward in recent years to the growing misuse of AI for deception, including criminal penalties and improved media literacy. Concerns about deepfakes have also led to a flood of new apps and AI systems designed to spo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/deepfake-targets-trump-administration-ai-voice-is-used-by-imposter-to-contact-foreign-u-s-officials-posing-as-secretary-of-state-marco-rubio/articleshow/122327963.cms",
    "timestamp": "2025-07-08T19:54:27Z"
  },
  {
    "title": "“This creep?”: Trump is over questions about Epstein",
    "description": "Trump berated a reporter for asking questions about Jeffery Epstein in a Cabinet meeting on Tuesday",
    "link": "https://www.salon.com/2025/07/08/this-creep-trump-is-over-questions-about-epstein/",
    "timestamp": "2025-07-08T19:54:20Z"
  },
  {
    "title": "Supreme Court clears the way for Trump’s plans to downsize the federal workforce",
    "description": "The justices overrode lower court orders that temporarily froze the cuts.",
    "link": "https://www.denverpost.com/2025/07/08/supreme-court-trump-mass-firings/",
    "timestamp": "2025-07-08T19:53:48Z"
  },
  {
    "title": "Supreme Court clears the way for Trump’s plans to downsize the federal workforce",
    "description": "The justices overrode lower court orders that temporarily froze the cuts.",
    "link": "https://www.bostonherald.com/2025/07/08/supreme-court-trump-mass-firings/",
    "timestamp": "2025-07-08T19:53:48Z"
  },
  {
    "title": "An AI voice impersonated Marco Rubio in messages to high-level officials, State Department says",
    "description": "An unknown individual or group using AI impersonated Secretary of State Marco Rubio to contact at least five high-level government, according to a State Department cable.",
    "link": "https://www.nbcnews.com/tech/security/ai-voice-impersonated-marco-rubio-messages-high-level-officials-state-rcna217555",
    "timestamp": "2025-07-08T19:51:34Z"
  },
  {
    "title": "Supreme Court backs Trump’s effort to dramatically reshape federal government for now | CNN Politics",
    "description": "The Supreme Court on Tuesday backed President Donald Trump’s effort to carry out mass firings and reorganizations at federal agencies, putting on hold a lower court order that had temporarily blocked the president from taking those steps without approval from…",
    "link": "https://www.cnn.com/2025/07/08/politics/supreme-court-trump-rifs",
    "timestamp": "2025-07-08T19:50:05Z"
  },
  {
    "title": "My Best Airline Stocks To Ride The Summer Travel Boom",
    "description": "Invest in the summer travel boon with my 5 top airline stocks ready to soar. Check the list and don't miss these opportunities to add new stocks to your portfolio.",
    "link": "https://www.forbes.com/sites/investor-hub/article/my-5-best-airline-stocks-to-buy-ride-summer-travel-boom/",
    "timestamp": "2025-07-08T19:49:50Z"
  },
  {
    "title": "Congress' TikTok ban was misguided — but Trump has no right to block the law",
    "description": "In letters made public via the Freedom of Information Act, Attorney General Pam Bondi argued the president has the authority to nullify laws as he sees fit.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tiktok-law-congress-president-block-sale-bytedance-rcna217323",
    "timestamp": "2025-07-08T19:48:50Z"
  },
  {
    "title": "Trump Says Musk’s 3rd Political Party Pitch Is ‘Good for Me’ — but Maybe Not for Republicans | Video",
    "description": "The president does not appear to be losing sleep over the ex-DOGE boss starting the \"America Party\"\nThe post Trump Says Musk’s 3rd Political Party Pitch Is ‘Good for Me’ — but Maybe Not for Republicans | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-musk-america-political-party-response/",
    "timestamp": "2025-07-08T19:47:54Z"
  },
  {
    "title": "Suddenly one of the hottest issues of the last 3 elections is no longer relevant. Move along plebs [Facepalm]",
    "description": "Suddenly one of the hottest issues of the last 3 elections is no longer relevant. Move along plebs",
    "link": "https://www.fark.com/comments/13734154/Suddenly-one-of-hottest-issues-of-last-3-elections-is-no-longer-relevant-Move-along-plebs",
    "timestamp": "2025-07-08T19:47:42Z"
  },
  {
    "title": "Supreme Court lets Trump move forward with large-scale staff cuts for now",
    "description": "A U.S. district judge in San Francisco had temporarily blocked large-scale federal layoffs known as \"reductions in force.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/08/federal-government-layoffs-supreme-court-trump/83744184007/",
    "timestamp": "2025-07-08T19:46:59Z"
  },
  {
    "title": "Palestinians, human rights activists slam Israeli defence minister's plan to build camp on Rafah's ruins",
    "description": "Critics expressed alarm Tuesday after Israel's defence minister said he plans to move all Palestinians in Gaza into a camp at the southern tip of the war-battered enclave, according to Israeli media, with some saying it would violate international law and amo…",
    "link": "https://www.cbc.ca/news/world/gaza-israel-defence-minister-rafah-1.7579499",
    "timestamp": "2025-07-08T19:44:36Z"
  },
  {
    "title": "Elon Musk Questions How Trump Can Be Trusted After Epstein Memo — Promises New Party Will Uncover the Truth",
    "description": "Musk makes clear he plans to try and capitalize politically on the Trump administration's conclusion that Epstein did not keep a client list and killed himself in jail.\nThe post Elon Musk Questions How Trump Can Be Trusted After Epstein Memo — Promises New Pa…",
    "link": "https://www.mediaite.com/politics/elon-musk-questions-how-trump-can-be-trusted-after-epstein-memo-promises-new-party-will-uncover-the-truth/",
    "timestamp": "2025-07-08T19:44:11Z"
  },
  {
    "title": "Close to deal with India, says Donald Trump amid flurry of letters",
    "description": "President Trump announced potential trade deal with India amidst imposing reciprocal tariffs on several nations, including allies like Japan and South Korea. While India is spared from these tariffs, negotiations continue to finalize a bilateral trade agreeme…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/close-to-deal-with-india-says-donald-trump-amid-flurry-of-letters/articleshow/122327901.cms",
    "timestamp": "2025-07-08T19:43:36Z"
  },
  {
    "title": "Trump threatens to escalate trade war amid confusion over new tariff rates",
    "description": "US president announces tariffs of up to 200% on foreign drugs and 50% on copper as he continues to shift plans\nDonald Trump vowed to further escalate his trade wars on Tuesday, threatening US tariffs of up to 200% on foreign drugs and 50% on copper, amid wide…",
    "link": "https://biztoc.com/x/0df631eee0d9af8c",
    "timestamp": "2025-07-08T19:42:28Z"
  },
  {
    "title": "Trump suggests taking over New York City and Washington",
    "description": "President Trump suggested a federal takeover of New York City and Washington, claiming a \"tremendous power at the White House to run places when we have to.\"",
    "link": "https://abcnews.go.com/Politics/trump-suggests-taking-new-york-city-washington/story?id=123581492",
    "timestamp": "2025-07-08T19:41:33Z"
  },
  {
    "title": "Supreme Court lets Trump resume plans for mass federal layoffs",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court cleared the way on Tuesday for President Donald Trump's administration to resume its plans to carry out mass job...",
    "link": "https://www.yahoo.com/news/us-supreme-court-lifts-order-194015482.html",
    "timestamp": "2025-07-08T19:40:15Z"
  },
  {
    "title": "Migrants deported to El Salvador prison remain under U.S. control, Salvadoran officials tell UN",
    "description": "The revelation was contained in court filings Monday by lawyers for more than 100 migrants who are seeking to challenge their deportations to CECOT, El Salvador’s mega-prison.",
    "link": "https://www.nbcnews.com/news/latino/migrants-deported-el-salvador-prison-remain-under-us-control-rcna217602",
    "timestamp": "2025-07-08T19:40:11Z"
  },
  {
    "title": "Trump Will Stay Out of New York City Mayoral Race",
    "description": "\"President Donald Trump said he aims to root out political corruption in New York City but he begged off making an endorsement in the mayor’s race on July 8,\" USA Today reports. Said Trump: \"I'm",
    "link": "https://politicalwire.com/2025/07/08/trump-will-stay-out-of-new-york-city-mayoral-race/",
    "timestamp": "2025-07-08T19:40:05Z"
  },
  {
    "title": "Todd & Julie Chrisley Address Divorce Rumors After Prison Release",
    "description": "When it comes to their marriage, Todd Chrisley and Julie Chrisley know best.\nThe Chrisley Knows Best alums, who were released from prison in May after receiving presidential pardons from Donald...",
    "link": "https://www.eonline.com/news/1419586/todd-chrisley-julie-chrisley-on-divorce-rumors-after-prison-release",
    "timestamp": "2025-07-08T19:38:00Z"
  },
  {
    "title": "Trump 'visibly' shows 'classic sign of dementia,' expert warns as health fears grow - NewsBreak",
    "description": "As the oldest person ever inaugurated as President of the US, serious question about Donald Trump's mental ability have been raised with even people in his",
    "link": "https://www.newsbreak.com/share/4094700790185-trump-visibly-shows-classic-sign-of-dementia-expert-warns-as-health-fears-grow?s=a2&amp;share_destination_id=MTc1MDU4NjI2LTE3NTIwMDMzNzc3NzU%3D&amp;pd=0BqWkEk8&amp;hl=en_US&amp;send_time=1752003377&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v5%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v8%2Cns_foryou_recall_exp_25q3-v2",
    "timestamp": "2025-07-08T19:36:43Z"
  },
  {
    "title": "Trump Drops New Tariff That Could Shake Up Every American Industry",
    "description": "Copper futures surged to a record high Tuesday after President Donald Trump announced a 50% tariff on all copper imports.",
    "link": "https://dailycaller.com/2025/07/08/trump-new-tariff-copper-howard-lutnick-commerce/",
    "timestamp": "2025-07-08T19:34:30Z"
  },
  {
    "title": "Superman has a problem — and it's not that he's an immigrant",
    "description": "James Gunn's new Superman movie hits theatres this week. While fun, it is also something of a mess.",
    "link": "https://www.cbc.ca/news/entertainment/superman-review-1.7579815",
    "timestamp": "2025-07-08T19:33:46Z"
  },
  {
    "title": "'Gutless': Searing analysis tears into 'Maverick' Republican's latest 'betrayal'",
    "description": "Sen. Lisa Murkowski (R-AK) came under fire Tuesday in a scathing column\r\n accusing her of having “sold (Alaskans) out” for her support for President Donald Trump’s budget reconciliation package that includes the single-largest cut to Medicaid in history\r\n, al…",
    "link": "https://www.rawstory.com/lisa-murkowski-2672956617/",
    "timestamp": "2025-07-08T19:33:03Z"
  },
  {
    "title": "US will hike tariffs on copper to 50%, Trump says",
    "description": "US will hike tariffs on copper to 50%, Trump says\nCopper entering the US from other countries is set to face a new tax of 50%, President Donald Trump has said.\nThe decision carries through on tariff threats he made earlier this year, when he ordered an invest…",
    "link": "https://biztoc.com/x/5efafeac6bb1ea31",
    "timestamp": "2025-07-08T19:31:03Z"
  },
  {
    "title": "Starmer and Macron agree need for 'new deterrent' to stop small boat crossings",
    "description": "Sir Keir Starmer and Emmanuel Macron have agreed the need for a \"new deterrent\" to deter small boats crossings in the Channel, Downing Street has said.",
    "link": "https://news.sky.com/story/starmer-and-macron-agree-need-for-new-deterrent-to-stop-small-boat-crossings-13394281",
    "timestamp": "2025-07-08T19:30:00Z"
  },
  {
    "title": "Zelensky’s right-hand man thanks Trump for reversing Pentagon aid freeze, calls him ‘only leader’ who can end Russia’s invasion",
    "description": "\"We’ve seen President Trump’s recent messaging on Ukraine — and frankly, we’re impressed,\" Andriy Yermak told The Post Tuesday.",
    "link": "https://nypost.com/2025/07/08/us-news/zelenskys-right-hand-man-thanks-trump-for-reversing-pentagon-aid-freeze-calls-him-only-leader-who-can-end-russias-invasion/",
    "timestamp": "2025-07-08T19:28:44Z"
  },
  {
    "title": "US will hike tariffs on copper to 50%, Trump says",
    "description": "Similar threats are looming over pharmaceuticals, lumber and semiconductors.",
    "link": "https://www.bbc.com/news/articles/cjrljr8qv3zo",
    "timestamp": "2025-07-08T19:28:43Z"
  },
  {
    "title": "GOP Lawmaker Won’t Challenge Josh Shapiro",
    "description": "\"At a rally in Pittsburgh in May, Rep. Dan Meuser (R-PA) received the most powerful co-sign in Republican politics: an endorsement from President Donald Trump in the upcoming gubernatorial race,\" ABC News reports. \"But after",
    "link": "https://politicalwire.com/2025/07/08/gop-lawmaker-wont-challenge-josh-shapiro/",
    "timestamp": "2025-07-08T19:27:52Z"
  },
  {
    "title": "Trump says he's 'not happy' with Putin and blames him for 'killing a lot of people' in Ukraine",
    "description": "President Donald Trump says he’s “not happy” with his Russian counterpart, Vladimir Putin",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-happy-putin-blames-killing-lot-people-ukraine-123584705",
    "timestamp": "2025-07-08T19:27:07Z"
  },
  {
    "title": "'I feel used!' Watch MAGA influencer's full-blown meltdown over Epstein files",
    "description": "MAGA influencer Jack Posobiec vented rage at the Trump administration after Attorney General Pam Bondi seemed to wash her hands of files on accused sex trafficker Jeffrey Epstein.At a cabinet meeting on Tuesday, a reporter asked Bondi if Epstein worked for an…",
    "link": "https://www.rawstory.com/jack-posobiec-epstein-files/",
    "timestamp": "2025-07-08T19:26:02Z"
  },
  {
    "title": "Trump to attend Club World Cup final, FIFA opens office in Trump Tower",
    "description": "WASHINGTON/EAST RUTHERFORD, N.J. :U.S. President Donald Trump will attend Sunday's Club World Cup final in East Rutherford, New Jersey, he said at a Cabinet meeting on Tuesday, as world soccer's ruling body FIFA announced it had opened an office in New York's…",
    "link": "https://www.channelnewsasia.com/sport/trump-attend-club-world-cup-final-fifa-opens-office-trump-tower-5227571",
    "timestamp": "2025-07-08T19:25:47Z"
  },
  {
    "title": "Exclusive -- Nate Morris: 'Vile' Andy Barr Would Attack Immigration Activists as 'Nativists'",
    "description": "Kentucky businessman and Senate Republican candidate Nate Morris told Breitbart News that it is \"vile\" that Rep. Andy Barr (R-KY) would attack \"nativists\" in the Republican Party that want to curb legal immigration.\nThe post Exclusive — Nate Morris: ‘Vile’ An…",
    "link": "https://www.breitbart.com/politics/2025/07/08/exclusive-nate-morris-vile-andy-barr-would-attack-immigration-activists-as-nativists/",
    "timestamp": "2025-07-08T19:25:27Z"
  },
  {
    "title": "Abdul El-Sayed Rakes in Over $24K Per Day While Swearing Off PAC Money",
    "description": "\"It's not just that I'm not taking corporate money in this race; it's that I've never taken corporate money,\" El-Sayed told Newsweek.",
    "link": "https://www.newsweek.com/michigan-senate-race-election-abdul-el-sayed-fundraising-2096219",
    "timestamp": "2025-07-08T19:24:54Z"
  },
  {
    "title": "Trump’s Claim on Ukraine Aid Raises Question of Who’s In Control",
    "description": "Donald Trump gracelessly dodged a question Tuesday about weapons shipments to Ukraine, revealing that the commander-in-chief has no idea about what’s going on with his own warchest. During a Cabinet meeting, CNN’s Kaitlan Collins pressed Trump for details abo…",
    "link": "https://newrepublic.com/post/197714/donald-trump-pause-ukraine-aid-in-control",
    "timestamp": "2025-07-08T19:23:55Z"
  },
  {
    "title": "Trump Accuses His Benefactor Putin Of Spewing ‘Bullshit’ About Ukraine Invasion",
    "description": "The president promised he would end the war before he even took office. Instead Putin is slaughtering more Ukrainian civilians.",
    "link": "https://www.huffpost.com/entry/trump-putin-bullshit_n_686d4f6be4b07e11dd994dbc",
    "timestamp": "2025-07-08T19:23:17Z"
  },
  {
    "title": "Stacey Abrams: Trump Taking Steps to Cancel Elections in the U.S.",
    "description": "During an appearance on ABC’s “Jimmy Kimmel Live” on Monday, failed Georgia gubernatorial candidate Stacey Abrams alleged President Donald Trump was taking steps to cancel elections in the United States. Abrams outlined 10 steps to guest host Anthony Anderson…",
    "link": "https://freerepublic.com/focus/f-news/4327558/posts",
    "timestamp": "2025-07-08T19:22:08Z"
  },
  {
    "title": "Trump Claims He’ll Make ‘Changes’ to the Media",
    "description": "President Donald Trump raged at the media during Tuesday’s Cabinet meeting, ominously claiming that the media “ought to make a lot of changes” and adding that “changes are going to be made,\" Mediaite reports.",
    "link": "https://politicalwire.com/2025/07/08/trump-claims-hell-make-changes-to-the-media/",
    "timestamp": "2025-07-08T19:21:40Z"
  },
  {
    "title": "Internet Reacts To Kai Cenat & Target Collab Amid Backlash Over Dropped DEI Commitments",
    "description": "Target linked up with Kai Cenat, but a lot of folks in the Black community see it as a cover-up, not a comeback.",
    "link": "https://hiphopwired.com/playlist/kai-cenat-target/",
    "timestamp": "2025-07-08T19:21:14Z"
  },
  {
    "title": "Trump Media Plans ‘Crypto Blue Chip Fund’ in 3rd ETF Venture",
    "description": "Trump Media is reportedly making another venture into the digital assets space. [contact-form-7] The social media firm owned by President Donald Trump is planning an exchange-traded fund (ETF) that would hold cryptocurrencies such as bitcoin, ether and solana…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/trump-media-plans-crypto-blue-chip-fund-in-3rd-etf-venture/",
    "timestamp": "2025-07-08T19:20:20Z"
  },
  {
    "title": "Trump to impose copper tariffs, in potential blow to Canadian exporters of the metal",
    "description": "U.S. President Donald Trump plans to level tariffs on copper imports, potentially imposing even more pressure on the Canadian economy already reeling from levies on aluminum, steel and autos. \nMr. Trump told reporters at the White House that he plans to forma…",
    "link": "https://biztoc.com/x/134282a10b81247a",
    "timestamp": "2025-07-08T19:19:42Z"
  },
  {
    "title": "Trump says he will impose 50% tariff on copper imports",
    "description": "President Donald Trump said he will impose a 50% tariff on copper imports on Tuesday, and suggested more steep sector-specific duties are on the way.“Today, we’re doing copper,” Trump said during a Cabinet meeting at the White House.",
    "link": "https://biztoc.com/x/73a85750ba0f0349",
    "timestamp": "2025-07-08T19:19:42Z"
  },
  {
    "title": "WATCH: Noem describes scene of parents looking for their children in Texas flood devastation",
    "description": "Homeland Security Secretary Kristi Noem described the scene at Camp Mystic in Kerrville, Texas, at the urging of President Donald Trump as he opened a meeting with his Cabinet at the White House.",
    "link": "https://biztoc.com/x/af7e0def45e73dbb",
    "timestamp": "2025-07-08T19:19:40Z"
  },
  {
    "title": "Donald Trump Caught 'Flat-Footed' By Pentagon's Ukraine Weapons Pause",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has ordered the resumption of U.S. weapons shipments to Ukraine after being caught \"flat-footed\" by a Pentagon decision to pause deliveries of key munitions, three people familiar with t…",
    "link": "https://biztoc.com/x/5bfc9e8552fc1023",
    "timestamp": "2025-07-08T19:19:37Z"
  },
  {
    "title": "Elon Musk: No Faith In Trump Without Epstein Transparency",
    "description": "Billionaire Elon Musk has intensified his political commentary, urging transparency from President Donald Trump while promoting a new political movement. \nIn a post on X, Musk questioned Trump’s credibility, writing, “How can people be expected to have faith …",
    "link": "https://biztoc.com/x/e62b8ca779e4aac1",
    "timestamp": "2025-07-08T19:19:34Z"
  },
  {
    "title": "First U.S. Airline—United—Will Resume Flights To Israel",
    "description": "As the State Department warns citizens to “reconsider travel” to Israel, United says it will restart daily service this month—the first U.S. carrier to do so.",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/07/08/united-airlines-resume-flights-israel/",
    "timestamp": "2025-07-08T19:18:54Z"
  },
  {
    "title": "Kristi Noem Describes Emotional Visit To Texas Camp Ravaged By Flood",
    "description": "Secretary of Homeland Security Kristi Noem's voice broke as she recounted her emotional visit to Camp Mystic in Texas.",
    "link": "https://www.newsweek.com/kristi-noem-gets-emotional-visit-texas-camp-mystic-2096280",
    "timestamp": "2025-07-08T19:17:34Z"
  }
]