[
  {
    "title": "Trump Speaks Out on Netflix-Warner Bros. Merger Proposal",
    "description": "President Donald Trump expressed skepticism toward the proposed merger between Netflix and Warner Bros at the Kennedy Center Honors, saying, “it’s a lot of market share so we’ll have to see what happens.” Trump also says that he will consult some economists b…",
    "link": "https://www.today.com/video/trump-speaks-out-on-netflix-warner-bros-merger-proposal-253957701836",
    "timestamp": "2025-12-08T14:24:22Z"
  },
  {
    "title": "Paramount goes hostile in bid for Warner Bros., challenging a $72 billion bid by Netflix",
    "description": "Paramount is going straight to Warner Bros. shareholders with a $30 per share in cash offer for the entirety of Warner Bros. Discovery.",
    "link": "https://www.bostonherald.com/2025/12/08/paramount-hostile-bid-warner-bros/",
    "timestamp": "2025-12-08T14:22:34Z"
  },
  {
    "title": "Trump proposing $12B farm aid package to soften blow of his tariffs",
    "description": "A White House official says President Donald Trump is planning a $12 billion aid package for U.S. farmers who have struggled to sell their crops while getting hit by rising costs after the president raised tariffs on China as part of a broader trade war. The …",
    "link": "https://apnews.com/article/trump-farmers-aid-07328f260d1ebf26c2bfde79b426230e",
    "timestamp": "2025-12-08T14:22:14Z"
  },
  {
    "title": "Paramount Bids to Acquire Warner Bros., Competing with Netflix",
    "description": "Paramount is attempting to outbid Netflix in a bid to acquire Warner Bros. Discovery Inc. and its associated production properties.",
    "link": "https://screenrant.com/paramount-netflix-warner-bros-takeover-deal/",
    "timestamp": "2025-12-08T14:22:08Z"
  },
  {
    "title": "Greenland hosts annual talks with US at end of a year when Trump revived talk of takeover",
    "description": "NUUK, Greenland (AP) — Greenland is hosting meetings with American officials at the end of a year in which U.S. President Donald Trump ramped up talk of a U.S. takeover of the mineral-rich island, which is a semiautonomous territory of Denmark. The meetings M…",
    "link": "https://financialpost.com/pmn/greenland-hosts-annual-talks-with-us-at-end-of-a-year-when-trump-revived-talk-of-takeover",
    "timestamp": "2025-12-08T14:21:33Z"
  },
  {
    "title": "China trade surplus breaks records despite US decline",
    "description": "China’s export engine roared back to life in November, erasing the previous month’s unexpected stumble and propelling the country’s trade surplus past a historic milestone. The world’s manufacturing powerhouse demonstrated remarkable resilience by diversifyin…",
    "link": "https://rollingout.com/2025/12/08/china-trade-surplus-breaks-records/",
    "timestamp": "2025-12-08T14:21:32Z"
  },
  {
    "title": "Trump hails Netflix’s Sarandos as ‘fantastic man’ but casts mega-merger in doubt ‘There’s no question about it. It could be a problem’",
    "description": "Trump confirmed that he met with Netflix co-CEO Ted Sarandos in the Oval Office before the WBD deal was announced. \"I have a lot of respect for him.\"",
    "link": "https://fortune.com/2025/12/08/netflix-sarandos-trump-market-share-problem-warner-bros-antitrust/",
    "timestamp": "2025-12-08T14:21:15Z"
  },
  {
    "title": "‘Fentanyl Isn’t Being Manufactured in Venezuela’: Laura Loomer Hits DoD Over Drug Boat Strikes",
    "description": "MAGA activist Laura Loomer took issue with the Department of Defense’s recent airstrikes against alleged drug smuggling boats on Monday, pointing out that the majority of the dangerous drugs that enter the U.S. do not come from Venezuela. Loomer, a top adviso…",
    "link": "https://www.mediaite.com/media/news/fentanyl-isnt-being-manufactured-in-venezuela-laura-loomer-hits-dod-over-drug-boat-strikes/",
    "timestamp": "2025-12-08T14:20:46Z"
  },
  {
    "title": "I Asked ChatGPT How Trump’s $2K Dividend Could Impact My Wallet",
    "description": "President Donald Trump has been in the headlines lately with a proposed $2,000 dividend check to be sent to many Americans. Little clarity has been given about the checks that Trump said would be funded by revenue from tariffs on imported goods.\nRead More: 6 …",
    "link": "https://biztoc.com/x/9c546134eafdcf5e",
    "timestamp": "2025-12-08T14:20:22Z"
  },
  {
    "title": "Trump warns Netflix-Warner deal may pose antitrust ‘problem’",
    "description": "Donald Trump raised potential antitrust concerns around Netflix Inc.’s planned acquisition of Warner Bros. Discovery Inc. Read more here",
    "link": "https://financialpost.com/news/trump-netflix-warner-deal-antitrust",
    "timestamp": "2025-12-08T14:20:09Z"
  },
  {
    "title": "Exclusive -- Anti-Establishment Georgia Sen. Colton Moore Running to Replace MTG",
    "description": "State Sen. Colton Moore is jumping into the race to replace Rep. Marjorie Taylor Greene (R-GA), giving voters in the conservative Northwest Georgia district a clear anti-establishment choice in the upcoming special election.\nThe post Exclusive — Anti-Establis…",
    "link": "https://www.breitbart.com/politics/2025/12/08/exclusive-anti-establishment-georgia-sen-colton-moore-running-to-replace-mtg/",
    "timestamp": "2025-12-08T14:20:02Z"
  },
  {
    "title": "Paramount goes hostile in bid for Warner Bros., challenging a $72 billion bid by Netflix",
    "description": "On Sunday, President Trump said the deal struck by Netflix to buy Warner Bros. Discovery ‘could be a problem’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/paramount-warner-bros-hostile-bid-netflix-b2880211.html",
    "timestamp": "2025-12-08T14:19:54Z"
  },
  {
    "title": "Prince Harry MUST Lose Titles After Colbert Cameo to Avoid Diplomatic Incident, Royalists …",
    "description": "Reading Time: 4 minutesRoyalists are clamoring for Prince Harry to be stripped of his titles after his Colbert cameo got political, even asking Parliament to step in.\nPrince Harry MUST Lose Titles After Colbert Cameo to Avoid Diplomatic Incident, Royalists … …",
    "link": "http://www.thehollywoodgossip.com/2025/12/prince-harry-stipped-of-titles-after-colbert/",
    "timestamp": "2025-12-08T14:19:34Z"
  },
  {
    "title": "Even Carvajal cried out against the refereeing: \"The level you give and then crying in the press conference\"",
    "description": "The referee&apos;s report ofQuinteroGonzalez after the Real Madrid-Celta match reflects a night of tension at the Bernabeu. The referee showed six yellow cards to the white team, i",
    "link": "https://www.marca.com/en/football/real-madrid/2025/12/08/6936dd74268e3e77448b4599.html",
    "timestamp": "2025-12-08T14:18:43Z"
  },
  {
    "title": "Supreme Court on verge of using flawed theory to grant Trump unprecedented power: expert",
    "description": "The Supreme Court is poised to hear Trump v. Slaughter, a case that could fundamentally reshape the balance of power between the presidency and Congress.At issue is whether President Donald Trump can fire the heads of independent federal agencies at will — a …",
    "link": "https://www.rawstory.com/trump-v-slaughter/",
    "timestamp": "2025-12-08T14:17:28Z"
  },
  {
    "title": "Department of Justice Halts Protections for Incarcerated Trans and Intersex People",
    "description": "Is it me or does it seem like the U.S. and the UK are locked into a battle of who can be more evil and transphobic than the other?\nThe post Department of Justice Halts Protections for Incarcerated Trans and Intersex People appeared first on Autostraddle.",
    "link": "http://www.autostraddle.com/department-of-justice-halts-protections-for-incarcerated-trans-and-intersex-people/",
    "timestamp": "2025-12-08T14:16:36Z"
  },
  {
    "title": "Paramount makes $108.4bn bid for Warner Bros Discovery",
    "description": "Paramount Skydance has today launched a hostile bid worth $108.4 billion for Warner Bros Discovery, throwing a wrench into the deal with Netflix in a last-ditch effort to create a media powerhouse that would challenge the dominance of the streaming giant.",
    "link": "https://www.rte.ie/news/business/2025/1208/1547888-paramount-makes-108-4bn-bid-for-warner-bros-discovery/",
    "timestamp": "2025-12-08T14:16:05Z"
  },
  {
    "title": "Trump gets his peace prize at FIFA 2026 World Cup draw | The Excerpt",
    "description": "World Cup 2026 draw brings President Donald Trump his coveted peace prize. Awarding of inaugural FIFA prize takes center stage with team groupings.",
    "link": "https://www.usatoday.com/story/news/nation/2025/12/08/fifa-2026-world-cup-draw-mixes-sports-and-politics-the-excerpt/87667730007/",
    "timestamp": "2025-12-08T14:15:56Z"
  },
  {
    "title": "'Disappointed' Trump says Zelenskyy hasn't read latest plan to end Russia's war (Yuliya Talmazan/NBC News)",
    "description": "Yuliya Talmazan / NBC News:\n‘Disappointed’ Trump says Zelenskyy hasn't read latest plan to end Russia's war  —  Despite Trump's suggestion that Russia was “fine” with the most up-to-date version of the peace deal, the Kremlin indicated Sunday it wanted “radic…",
    "link": "https://www.memeorandum.com/251208/p33",
    "timestamp": "2025-12-08T14:15:01Z"
  },
  {
    "title": "Zelenskiy Says No Accord Yet on Ukraine's East in US Talks (Bloomberg)",
    "description": "Bloomberg:\nZelenskiy Says No Accord Yet on Ukraine's East in US Talks  —  Ukrainian President Volodymyr Zelenskiy said negotiators discussing a US-brokered peace initiative remain divided over territory as President Donald Trump expressed disappointment in Ky…",
    "link": "https://www.memeorandum.com/251208/p32",
    "timestamp": "2025-12-08T14:15:01Z"
  },
  {
    "title": "Allred switches from Texas Senate race to a House comeback bid. Crockett's Senate decision looms",
    "description": "Former Rep. Colin Allred is ending his U.S. Senate campaign in Texas and instead will attempt a House comeback bid, potentially paving the way for Rep. Jasmine Crockett to become the early favorite for Democrats’ nomination in a state they have long ho...",
    "link": "https://abcnews.go.com/Politics/wireStory/allred-switches-texas-senate-race-house-comeback-bid-128207577",
    "timestamp": "2025-12-08T14:14:42Z"
  },
  {
    "title": "Gavin Newsom Savagely Taunts Trump's Hosting Of Kennedy Center Honors",
    "description": "The California governor's grade-A trolling of the president's night as host included all-caps, off-the-charts vanity, and a naming rec for the arts venue.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-kennedy-center-peace-prize_n_6936bebee4b0a1c98be2cc05",
    "timestamp": "2025-12-08T14:14:26Z"
  },
  {
    "title": "Paramount launches hostile bid for Warner Bros. Discovery despite Netflix deal",
    "description": "Paramount is launching a hostile bid to acquire Warner Bros.",
    "link": "https://www.nbcnews.com/business/media/paramount-hostile-bid-warner-bros-discovery-rcna247993",
    "timestamp": "2025-12-08T14:14:01Z"
  },
  {
    "title": "House Faces Mass Exit With Nearly 10% Forgoing Reelection",
    "description": "The Congress during President Donald Trump’s final two years in office will look a lot different than the current one. House lawmakers are resigning from Congress at a record rate with 40 members — roughly 10% — passing on running for reelection in 2026. More…",
    "link": "https://dailycaller.com/2025/12/08/house-retirements-2026-midterms-democrats-republicans/",
    "timestamp": "2025-12-08T14:13:41Z"
  },
  {
    "title": "Trump Smacks EU with Official Declaration Saying Their Freeloading Days 'Are Over'",
    "description": "The Trump administration's new national security strategy declares that mass migration may lead to the withering of some NATO allies.",
    "link": "https://www.westernjournal.com/trump-smacks-eu-official-declaration-saying-freeloading-days/",
    "timestamp": "2025-12-08T14:12:41Z"
  },
  {
    "title": "MTG Exposes Just How Much Republicans Actually Hate Trump",
    "description": "Republicans had zero respect for Donald Trump until they realized he was about to re-enter power.In a sit-down interview with 60 Minutes Sunday, outbound Representative Marjorie Taylor Greene explained that the conservative caucus speaks very differently abou…",
    "link": "https://newrepublic.com/post/204094/marjorie-taylor-greene-republicans-mock-donald-trump",
    "timestamp": "2025-12-08T14:11:14Z"
  },
  {
    "title": "Trump Says He’ll Sign Executive Order Curbing State AI Rules",
    "description": "President Donald Trump said he would approve an executive order this week establishing “ONE RULE” on artificial intelligence aimed at limiting state-level policies regulating the technology.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-hell-sign-executive-order-curbing-state-ai-rules",
    "timestamp": "2025-12-08T14:10:17Z"
  },
  {
    "title": "Netanyahu to visit US on December 29",
    "description": "Israeli Prime Minister Benjamin Netanyahu will travel to the United States on December 28 for a meeting with US President Donald Trump the next day, an Israeli government spokesperson said on Monday. ...",
    "link": "https://biztoc.com/x/1afdd19956fc58d3",
    "timestamp": "2025-12-08T14:09:14Z"
  },
  {
    "title": "Paramount makes $108.4 billion hostile bid for Warner Bros Discovery",
    "description": "Dec 8 : Paramount Skydance on Monday launched a hostile bid worth $108.4 billion for Warner Bros Discovery, in a last-ditch effort to outbid Netflix and create a media powerhouse that would challenge the dominance of the streaming giant.Netflix had emerged vi…",
    "link": "https://www.channelnewsasia.com/business/paramount-makes-1084-billion-hostile-bid-warner-bros-discovery-5568256",
    "timestamp": "2025-12-08T14:09:13Z"
  },
  {
    "title": "Netflix and Warner Bros: Hollywood ending for streaming giant?",
    "description": "The deal, symptomatic of Silicon Valley’s ‘grasp’ on entertainment, could entirely ‘reshape’ the industry",
    "link": "https://theweek.com/tech/netflix-and-warner-bros-hollywood-ending-for-streaming-giant",
    "timestamp": "2025-12-08T14:09:07Z"
  },
  {
    "title": "Paramount Launches Hostile Bid To Buy Warner Bros., Offering Billions More Than Netflix",
    "description": "The battle for Warner Bros. is not over yet. After Netflix announced on Friday that it would buy the major of the Warner Bros. entertainment assets, Paramount on Monday announced that it would offer billions more to buy Warner Bros. as part of a hostile takeo…",
    "link": "https://www.gamespot.com/articles/paramount-launches-hostile-bid-to-buy-warner-bros-offering-billions-more-than-netflix/1100-6536758/",
    "timestamp": "2025-12-08T14:09:00Z"
  },
  {
    "title": "Donald Trump Isn’t Convinced by Netflix-Warner Bros. $72 Billion Deal",
    "description": "The President of the United States, Donald Trump, recently expressed his concern over Netflix’s planned $72 billion deal to acquire Warner Bros. Discovery’s ...",
    "link": "https://www.mandatory.com/news/1697993-netflix-warner-bros-deal-donald-trump-comment",
    "timestamp": "2025-12-08T14:08:58Z"
  },
  {
    "title": "President Trump expresses doubts about Netflix’s acquisition of Warner Bros.",
    "description": "\"I will be involved in the decision of the regulators on this acquisition for a price of $83 billion,\" the US president said.\nThe post President Trump expresses doubts about Netflix’s acquisition of Warner Bros. appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/12/08/president-trump-expresses-doubts-about-netflixs-acquisition-of-warner-bros/",
    "timestamp": "2025-12-08T14:07:50Z"
  },
  {
    "title": "The European Union moves ahead with toughening its migration system",
    "description": "European Union officials are finalizing a major overhaul of its migration system, including streamlined deportations and increased detentions",
    "link": "https://abcnews.go.com/International/wireStory/european-union-moves-ahead-toughening-migration-system-128206294",
    "timestamp": "2025-12-08T14:05:59Z"
  },
  {
    "title": "Ex-House Democrat drops out of Texas Senate race as Jasmine Crockett candidacy rumors swirl",
    "description": "Former House Rep. Colin Allred said he will no longer run for Senate in Texas, as rumors swirl of a potential bid by Rep. Jasmine Crockett.",
    "link": "https://www.foxnews.com/politics/ex-house-democrat-drops-out-texas-senate-race-jasmine-crockett-candidacy-rumors-swirl",
    "timestamp": "2025-12-08T14:05:32Z"
  },
  {
    "title": "Nigeria’s security situation requires more effort — US congressman",
    "description": "A US congressman raised concerns over Nigeria’s security situation, including terrorism and killings, during a meeting with Nigeria’s National Security Adv\n\nRead More: https://punchng.com/nigerias-security-situation-requires-more-effort-us-congressman/",
    "link": "https://punchng.com/nigerias-security-situation-requires-more-effort-us-congressman/",
    "timestamp": "2025-12-08T14:05:05Z"
  },
  {
    "title": "Paramount Skydance launches hostile bid for WBD after Netflix deal",
    "description": "Netflix won a bidding war for the Warner Bros. film studio and HBO Max streaming service, but it doesn't plan to buy WBD's TV networks.",
    "link": "https://www.cnbc.com/2025/12/08/paramount-skydance-hostile-bid-wbd-netflix.html",
    "timestamp": "2025-12-08T14:03:36Z"
  },
  {
    "title": "DC police chief resigns amid Trump pressure and crime data manipulation probe",
    "description": "D.C. police chief Pamela Smith announced her resignation after two and a half years amid federal pressure and crime statistics controversy in Washington.",
    "link": "https://www.foxnews.com/us/dc-police-chief-resigns-amid-trump-pressure-crime-data-manipulation-probe",
    "timestamp": "2025-12-08T14:03:20Z"
  },
  {
    "title": "Top bipartisan lawmakers support releasing video of controversial boat strikes | CNN Politics",
    "description": "Top lawmakers who were briefed last week on the September “double-tap” strike on an alleged drug boat in the Caribbean say they would support the release of video from the attack, with Democrats actively calling for it to be made public.",
    "link": "https://www.cnn.com/2025/12/08/politics/lawmakers-boat-strike-video",
    "timestamp": "2025-12-08T14:03:18Z"
  },
  {
    "title": "'MAGA hatred of freedom' fueling Trump turn against Europe: Nobel Prize winner",
    "description": "A turn against Europe from President Donald Trump could be an attempt appease MAGA supporters' \"hatred of freedom,\" according to a Nobel Prize winner.Economist Paul Krugman believes the loosening grip the U.S. has on Europe is because of internal support for …",
    "link": "https://www.rawstory.com/trump-europe-2674378199/",
    "timestamp": "2025-12-08T14:01:08Z"
  },
  {
    "title": "Lisa De Pasquale: Middle Age in the Golden Age — How to Make Your Life Great Again",
    "description": "In my new book, \"The Gen X Handbook for Middle Age: The Pursuit of Health, Success, and Human Fulfillment,\" I write about losing 170 pounds, becoming debt free, finding love the good old-fashioned way, and eagerly leaving a blue state (Virginia) and moving to…",
    "link": "https://www.breitbart.com/health/2025/12/08/de-pasquale-middle-age-in-the-golden-age-how-to-make-your-life-great-again/",
    "timestamp": "2025-12-08T14:00:44Z"
  },
  {
    "title": "Trump’s Peace Deal in Peril as Thailand Bombards Cambodian Border Targets",
    "description": "President Trump had formalized an agreement between the two nations this fall, after weeks of conflict that threatened to lead to war this summer.\nThe post Trump’s Peace Deal in Peril as Thailand Bombards Cambodian Border Targets first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/12/trumps-peace-deal-in-peril-as-thailand-bombards-cambodian-border-targets/",
    "timestamp": "2025-12-08T14:00:36Z"
  },
  {
    "title": "Somali Americans confront Trump’s attacks by trolling MAGA",
    "description": "Turning hate into humor is becoming a strategy of resistance",
    "link": "https://www.salon.com/2025/12/08/somali-americans-confront-trumps-attacks-by-trolling-maga/",
    "timestamp": "2025-12-08T14:00:28Z"
  },
  {
    "title": "Progressives Take Aim At Incumbent Moderate Senator",
    "description": "State Sen. Julie Gonzales argues the incumbent's centrist politics are out of step with the state.",
    "link": "https://www.huffpost.com/entry/progressive-launches-primary-challenge-to-colorado-sen-john-hickenlooper_n_6936347ae4b0020dff80b7d8",
    "timestamp": "2025-12-08T14:00:17Z"
  },
  {
    "title": "Trump bill makes 100% tax write-off a forever thing that could save some US taxpayers six figures. Are you one of them?",
    "description": "Find out what qualifies for this bonus deduction.",
    "link": "https://finance.yahoo.com/news/trump-bill-makes-100-tax-140000592.html",
    "timestamp": "2025-12-08T14:00:00Z"
  },
  {
    "title": "Trump Celebrates Himself: Me! Me!",
    "description": "When Trump allowed his buddy Elon Musk to run a so-called Department of Governmental Efficiency, Musk sent his mentees into every department with a license to terrorize civil servants and destroy their work. Agencies were literally ransacked, employees with d…",
    "link": "https://dianeravitch.net/2025/12/08/trump-celebrates-himself/",
    "timestamp": "2025-12-08T14:00:00Z"
  },
  {
    "title": "Trump says he will sign executive order this week on AI approval process",
    "description": "President Donald Trump said on Monday he would sign an executive order this week related to the artificial intelligence approval process to avoid having different rules in each US state.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/trump-says-he-will-sign-executive-order-this-week-on-ai-approval-process/articleshow/125836597.cms",
    "timestamp": "2025-12-08T13:58:22Z"
  },
  {
    "title": "Top EU official warns the US against interfering in Europe's affairs",
    "description": "A top European Union official has warned the United States against interfering in European affairs",
    "link": "https://abcnews.go.com/International/wireStory/top-eu-official-warns-us-interfering-europes-affairs-128202697",
    "timestamp": "2025-12-08T13:57:38Z"
  },
  {
    "title": "You Got Your War Crimes In My Murder! You Got Your Murder In My War Crimes!",
    "description": "Anonymous military lawyer now to blame.",
    "link": "https://www.wonkette.com/p/you-got-your-war-crimes-in-my-murder",
    "timestamp": "2025-12-08T13:57:30Z"
  },
  {
    "title": "SCOTUS Likely To Rule Against Independent Federal Agencies",
    "description": "This is it, the Holy Grail for Republicans. The Supreme Court's conservative majority today will pretend to weigh whether to kill the concept of independent federal agencies that are supposed to operate at arm’s length from the president. Via NBC News:\nIn a s…",
    "link": "https://crooksandliars.com/2025/12/scotus-likely-rule-against-independent",
    "timestamp": "2025-12-08T13:55:29Z"
  },
  {
    "title": "Florida Republicans Urge Trump to Back Off Offshore Drilling",
    "description": "Florida’s Republican-dominated congressional delegation is urging the Trump administration to drop a plan that would allow new oil drilling for the first time in decades off the state’s coast. A letter signed by Republican Sens. Rick Scott and Ashley Moody …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/12/08/850213.htm",
    "timestamp": "2025-12-08T13:54:02Z"
  },
  {
    "title": "WATCH: Marjorie Taylor Greene blames Trump for death threats against her son",
    "description": "'I got response from President Trump that I will keep private, but it wasn't very nice'",
    "link": "https://www.wnd.com/2025/12/watch-marjorie-taylor-greene-blames-trump-death-threats/",
    "timestamp": "2025-12-08T13:53:55Z"
  },
  {
    "title": "I Asked ChatGPT How Trump’s $2K Dividend Could Impact My Wallet",
    "description": "Could Trump’s $2,000 tariff dividend boost your finances -- or barely make a dent? Here’s what you need to know before counting on that dividend check.",
    "link": "https://finance.yahoo.com/news/asked-chatgpt-trump-2k-dividend-135331705.html",
    "timestamp": "2025-12-08T13:53:31Z"
  },
  {
    "title": "Former Rep. Colin Allred ends Texas Senate campaign and runs for new House seat",
    "description": "Former Democratic Rep. Colin Allred announced Monday that he is ending his Senate campaign in Texas and running for the House, shaking up the primary just hours before filing deadline.",
    "link": "https://www.nbcnews.com/politics/2026-election/former-rep-colin-allred-ends-texas-senate-campaign-runs-new-house-seat-rcna247981",
    "timestamp": "2025-12-08T13:51:41Z"
  },
  {
    "title": "100 schoolchildren abducted in Nigeria are released; more still being held",
    "description": "The Christian Association of Nigeria says 100 schoolchildren abducted from a Catholic school last month have been released",
    "link": "https://abcnews.go.com/International/wireStory/100-schoolchildren-abducted-nigeria-released-held-128205229",
    "timestamp": "2025-12-08T13:51:20Z"
  },
  {
    "title": "Pakistan's top general calls on Afghanistan to pick between ties with Islamabad or Pakistani Taliban",
    "description": "Pakistan’s newly appointed chief of defense forces has warned Afghanistan’s Taliban government to choose between maintaining ties with Islamabad or supporting the Pakistani Taliban, the militant group blamed for a surge in deadly attacks in recent years",
    "link": "https://abcnews.go.com/International/wireStory/pakistans-top-general-calls-afghanistan-pick-ties-islamabad-128205653",
    "timestamp": "2025-12-08T13:49:48Z"
  },
  {
    "title": "Health Department Unveils Strategy to Expand its Adoption of AI Tech",
    "description": "The U.S. Department of Health and Human Services on Thursday outlined a strategy to expand its use of artificial intelligence, building on the Trump administration’s enthusiastic embrace of the rapidly advancing technology while raising questions about how he…",
    "link": "https://www.insurancejournal.com/news/national/2025/12/08/850206.htm",
    "timestamp": "2025-12-08T13:48:53Z"
  },
  {
    "title": "Trump says Zelenskyy Isn’t Ready to Sign Peace Proposal",
    "description": "Russia launched a new wave of attacks inside Ukraine targeting the nation’s infrastructure, as U.S.-led talks to end nearly four years of fighting continue to play out. President Donald Trump says Ukrainian President Volodymyr Zelenskyy isn’t ready to sign th…",
    "link": "https://www.today.com/video/trump-says-zelenskyy-isn-t-ready-to-sign-peace-deal-with-russia-253954117853",
    "timestamp": "2025-12-08T13:48:47Z"
  },
  {
    "title": "Senate Republicans play dumb on Trump’s pardon for a notorious foreign drug trafficker",
    "description": "For all of his “tough on crime” chest-thumping, Donald Trump appears to have a soft spot for drug traffickers. The day after second inaugural, for example, the president pardoned a man convicted of creating a massive online black market for illegal drugs.\nLas…",
    "link": "https://biztoc.com/x/dc29052888a96c92",
    "timestamp": "2025-12-08T13:46:56Z"
  },
  {
    "title": "Trump says Netflix deal to buy Warner Bros. ‘could be a problem’ because of size of market share",
    "description": "By DARLENE SUPERVILLE, Associated Press\nWASHINGTON (AP) — President Donald Trump said Sunday that a deal struck by Netflix to buy Warner Bros. Discovery “could be a problem” because of the size of the combined market share.\nRelated Articles\n \n \n \n Making the …",
    "link": "https://biztoc.com/x/0029e32030a3b4f1",
    "timestamp": "2025-12-08T13:46:52Z"
  },
  {
    "title": "Hegseth Once Warned Military to Not Follow Illegal Orders",
    "description": "“In 2016, as then-presidential candidate Donald Trump vowed that US troops would carry out even his most extreme battlefield orders as commander in chief — some of which former military leaders said would be illegal — Pete Hegseth warned that service members …",
    "link": "https://politicalwire.com/2025/12/08/hegseth-once-warned-military-to-not-follow-illegal-orders/",
    "timestamp": "2025-12-08T13:45:53Z"
  },
  {
    "title": "Did Trump just end the US-Europe alliance?",
    "description": "New US national security policy drops ‘grenade’ on Europe and should serve as ‘the mother of all wake-up calls’",
    "link": "https://theweek.com/defence/trump-security-plan-us-europe-relations",
    "timestamp": "2025-12-08T13:45:45Z"
  },
  {
    "title": "President Trump says he will do \"a ONE RULE\" EO on AI \"this week\" and \"you can't expect a company to get 50 Approvals every time they want to do something\" (Bloomberg)",
    "description": "Bloomberg:\nPresident Trump says he will do “a ONE RULE” EO on AI “this week” and “you can't expect a company to get 50 Approvals every time they want to do something”  —  President Donald Trump said he would approve an executive order this week to establish “…",
    "link": "https://www.techmeme.com/251208/p15",
    "timestamp": "2025-12-08T13:45:01Z"
  },
  {
    "title": "Washington’s Mayor Bowser says the city’s police chief, Pamela Smith, is stepping down",
    "description": "Pamela Smith's tenure unfolded amid a fierce battle over authority, as President Trump asserted federal control.",
    "link": "https://www.bostonherald.com/2025/12/08/dc-police-chief-stepping-down/",
    "timestamp": "2025-12-08T13:44:58Z"
  },
  {
    "title": "FO° Talks: Will Zelenskyy Cede Territory? Putin’s New Demands Put Europe on High Alert",
    "description": "Fair Observer’s Video Producer Rohan Khattar Singh and Sebastian Schäffer, Director of the Institute for the Danube Region and Central Europe, discuss how the war in Ukraine is entering a precarious diplomatic phase, marked by intensifying pressure on the Ukr…",
    "link": "https://www.fairobserver.com/region/central_south_asia/fo-talks-will-zelenskyy-cede-territory-putins-new-demands-put-europe-on-high-alert/",
    "timestamp": "2025-12-08T13:44:02Z"
  },
  {
    "title": "'Destroyed in its infancy!' Trump makes major AI policy announcement",
    "description": "President Donald Trump announced a major policy shift on artificial intelligence Monday amid his administration’s efforts to lead AI development on the world stage — much to the chagrin\r\n of many prominent members of the MAGA movement.“There must be only One …",
    "link": "https://www.rawstory.com/trump-2674378600/",
    "timestamp": "2025-12-08T13:41:01Z"
  },
  {
    "title": "Marjorie Taylor Greene Says She Won't Run For President After Breaking With Trump: 'Don't Know How To Make It More Clear'",
    "description": "Republican Rep. Marjorie Taylor Greene again rejected she intends to run for president in 2028 following her public breakup with Trump and the MAGA movement and her upcoming retirement from the U.S. House of Representatives.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-says-she-wont-run-president-after-breaking-trump-dont-know-how-make-3792106",
    "timestamp": "2025-12-08T13:38:28Z"
  },
  {
    "title": "Trump comments raise doubts over Netflix's $72 billion deal with Warner Bros",
    "description": "Dec 8 : Netflix's $72 billion Warner Bros deal led to several price target cuts by Wall Street analysts as U.S. President Donald Trump warned of market-share concerns, underscoring the tough scrutiny that the acquisition is likely to face.The deal that combin…",
    "link": "https://www.channelnewsasia.com/business/trump-comments-raise-doubts-over-netflixs-72-billion-deal-warner-bros-5568171",
    "timestamp": "2025-12-08T13:38:03Z"
  },
  {
    "title": "\"Domestic Terrorism\": Leaked DOJ Memo Targets \"Anti-Americanism, Anti-Capitalism, Anti-Christianity\"",
    "description": "A leaked memo by U.S. Attorney General Pam Bondi directs the Justice Department and FBI to compile a list of groups that may be labeled “domestic terrorism” organizations based on political views related to immigration, gender and U.S. policy. The memo was ob…",
    "link": "https://www.democracynow.org/2025/12/8/ken_klippenstein_fbi_domestic_terrorism_nspm7",
    "timestamp": "2025-12-08T13:37:11Z"
  },
  {
    "title": "What the US wants from Ukraine: Leave Donbas, one way or another",
    "description": "Kyiv keeps insisting war should be frozen along current lines.",
    "link": "https://www.politico.eu/article/us-wants-from-ukraine-leave-donbas-one-way-or-another/",
    "timestamp": "2025-12-08T13:37:02Z"
  },
  {
    "title": "Pakistan's top general calls on Afghanistan to pick between ties with Islamabad or Pakistani Taliban",
    "description": "Pakistan’s newly appointed armed forces chief called on Afghanistan’s Taliban government on Monday to choose between maintaining ties with Islamabad or...",
    "link": "https://www.yahoo.com/news/articles/pakistans-top-general-calls-afghanistan-133648669.html",
    "timestamp": "2025-12-08T13:36:48Z"
  },
  {
    "title": "2025 Newsmakers of the Year",
    "description": "Golf Digest counts down the top 25 players, events and moments of the year in golf",
    "link": "https://sports.yahoo.com/articles/2025-newsmakers-133549333.html",
    "timestamp": "2025-12-08T13:35:49Z"
  },
  {
    "title": "'Yammering' Trump stage performance earns him 'elderly man' brand",
    "description": "Donald Trump's recent appearance at a FIFA event highlights how he's a full-blown \"elderly man\" losing the support of his hardcore fans, an analyst wrote Monday.The president received the FIFA Peace Prize at the World Cup 2026 draw last week, but his \"yammeri…",
    "link": "https://www.rawstory.com/trump-fifa-2674378354/",
    "timestamp": "2025-12-08T13:34:32Z"
  },
  {
    "title": "Trump says the big Netflix-Warner Bros merger ‘could be a problem’ – here’s why",
    "description": "‘Could be a problem’: Trump wants to personally help decide the Netflix-Warner Bros. Deal – and he’s already highlighted a big reason to block it.",
    "link": "https://www.techradar.com/streaming/netflix/trump-says-the-big-netflix-warner-bros-merger-could-be-a-problem-heres-why",
    "timestamp": "2025-12-08T13:34:14Z"
  },
  {
    "title": "What does it mean to be a new national park? Ocmulgee Mounds in Georgia may soon find out",
    "description": "Ocmulgee Mounds may soon be redesignated by Congress as America’s 64th national park. But what does this actually mean, and why does it matter?",
    "link": "https://theconversation.com/what-does-it-mean-to-be-a-new-national-park-ocmulgee-mounds-in-georgia-may-soon-find-out-268474",
    "timestamp": "2025-12-08T13:34:03Z"
  },
  {
    "title": "Trump says Netflix deal to buy Warner Bros. 'could be a problem' because of size of market share",
    "description": "President Donald Trump says a deal struck by Netflix last week to buy Warner Bros",
    "link": "https://abcnews.go.com/Business/wireStory/trump-netflix-deal-buy-warner-bros-problem-size-128200469",
    "timestamp": "2025-12-08T13:33:58Z"
  },
  {
    "title": "Washington's Mayor Bowser says the city's police chief, Pamela Smith, is stepping down",
    "description": "Washington D.C. Mayor Muriel Bowser says the city's police chief, Pamela Smith, is stepping down",
    "link": "https://abcnews.go.com/US/wireStory/washingtons-mayor-bowser-citys-police-chief-pamela-smith-128204588",
    "timestamp": "2025-12-08T13:33:52Z"
  },
  {
    "title": "Trump says Netflix deal to buy Warner Bros. ‘could be a problem’ because of size of market share",
    "description": "Trump says he will be involved in the decision about whether federal regulators should approve the deal.",
    "link": "https://www.denverpost.com/2025/12/08/trump-netflix-deal-market-share/",
    "timestamp": "2025-12-08T13:33:46Z"
  },
  {
    "title": "Trump says Netflix deal to buy Warner Bros. ‘could be a problem’ because of size of market share",
    "description": "Trump says he will be involved in the decision about whether federal regulators should approve the deal.",
    "link": "https://www.bostonherald.com/2025/12/08/trump-netflix-deal-market-share/",
    "timestamp": "2025-12-08T13:33:46Z"
  },
  {
    "title": "Where things stand in the peace talks on the Ukraine war",
    "description": "U.S. President Donald Trump has unleashed the most extensive diplomatic effort to end the fighting since Russia’s full-scale invasion of Ukraine nearly four years ago",
    "link": "https://abcnews.go.com/International/wireStory/things-stand-peace-talks-ukraine-war-128204627",
    "timestamp": "2025-12-08T13:33:31Z"
  },
  {
    "title": "A Very Big Deal",
    "description": "In Netflix’s plan to acquire Warner Bros. Discovery, CNN is left out—to the reported relief of its staffers.",
    "link": "https://www.cjr.org/the_media_today/very-big-deal-netflix-warner-bros-discovery-cnn-paramount-sarandos.php",
    "timestamp": "2025-12-08T13:30:54Z"
  },
  {
    "title": "The new US National Security Strategy respects those who stood up to Washington, but expects vassals to keep obeying",
    "description": "Western Europe’s establishment has sold out the interests of ordinary Europeans to the US – and is now reaping the consequences Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629173-us-security-strategy-vassals/",
    "timestamp": "2025-12-08T13:29:57Z"
  },
  {
    "title": "Biden's own advisers warned his border policies could create 'chaos': report",
    "description": "Former President Biden's team was warned his border policies could cause chaos before the 2020 election, according to a memo obtained by The New York Times, revealing serious immigration concerns.",
    "link": "https://www.foxnews.com/media/bidens-own-advisers-warned-his-border-policies-would-create-chaos-report",
    "timestamp": "2025-12-08T13:29:28Z"
  },
  {
    "title": "Redistricting in Indiana faces ultimate test in state Senate",
    "description": "Many Indiana Republican senators have been hesitant to stack the deck in their party's favor.",
    "link": "https://www.bostonherald.com/2025/12/08/indiana-congressional-redistricting-trump/",
    "timestamp": "2025-12-08T13:28:03Z"
  },
  {
    "title": "Trump says Netflix deal to buy Warner Bros 'could be a problem' because of size of market share",
    "description": "The Republican president said he will be involved in the decision about whether the federal government should approve the $72 billion deal. If approved by regulators, the merger would put two of the world's biggest streaming services under the same ownership …",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-says-netflix-deal-to-buy-warner-bros-could-be-a-problem-because-of-size-of-market-share/articleshow/125835847.cms",
    "timestamp": "2025-12-08T13:28:01Z"
  },
  {
    "title": "New fighting along the Thai-Cambodian border is rooted in a longstanding territorial dispute",
    "description": "Thailand and Cambodia have resumed fighting over disputed territory, just months after agreeing to a ceasefire",
    "link": "https://abcnews.go.com/International/wireStory/new-fighting-thai-cambodian-border-rooted-longstanding-territorial-128202975",
    "timestamp": "2025-12-08T13:25:55Z"
  },
  {
    "title": "\"I Was Pepper-Sprayed\": Rep. Adelita Grijalva on ICE Raid, Epstein Files, Rising Health Costs & More",
    "description": "Democracy Now! speaks with Democratic Congressmember Adelita Grijalva of Arizona, who says she was attacked by masked ICE agents Friday as she tried to find out more information about a raid taking place at a restaurant in her district in Tucson. Grijalva say…",
    "link": "https://www.democracynow.org/2025/12/8/adelita_grijalva",
    "timestamp": "2025-12-08T13:25:47Z"
  },
  {
    "title": "'United States cannot replace Europe': EU hits back at US and Musk",
    "description": "The European Union was forced to defend itself on Monday after Washington criticised the bloc's policies and in a separate swipe the billionaire Elon Musk blew his top saying the EU should be abolished.",
    "link": "https://www.thelocal.com/20251208/united-states-cannot-replace-europe-eu-hits-back-at-us-and-musk",
    "timestamp": "2025-12-08T13:24:36Z"
  },
  {
    "title": "Economist: Greece remains among the top economies of 2025, strong presence of southern Europe",
    "description": "Greece, which topped the rankings in 2022 and 2023, continues to rank highly - Southern Europe stands out in the list\nThe post Economist: Greece remains among the top economies of 2025, strong presence of southern Europe appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/12/08/economist-greece-remains-among-the-top-economies-of-2025-strong-presence-of-southern-europe/",
    "timestamp": "2025-12-08T13:24:33Z"
  },
  {
    "title": "EU chief says Europe cannot accept US 'threat to interfere'",
    "description": "European Council president Antonio Costa on Monday rejected any attempt by the United States to meddle in Europe's politics, after Washington published a new security strategy sharply criticising the continent's policies.",
    "link": "https://www.hurriyetdailynews.com/eu-chief-says-europe-cannot-accept-us-threat-to-interfere-216590",
    "timestamp": "2025-12-08T13:22:55Z"
  },
  {
    "title": "‘Disappointed’ Trump declared Zelensky ‘hasn’t yet read’ peace proposal — as prez’s son suggests he may walk away from Ukraine",
    "description": "President Trump cast doubt on whether Ukrainian President Volodymyr Zelensky is ready to back the latest peace proposal — as his son warned that the commander in chief may grow impatient and walk away from Ukraine. “I have to say that I’m a little bit disappo…",
    "link": "https://nypost.com/2025/12/08/world-news/disappointed-trump-declared-zelensky-hasnt-yet-read-peace-proposal/",
    "timestamp": "2025-12-08T13:20:35Z"
  },
  {
    "title": "Colin Allred exiting Democratic primary in Texas Senate race",
    "description": "Allred will instead seek the Democratic nomination in the Dallas-based 33rd Congressional District.",
    "link": "https://www.cbsnews.com/texas/news/colin-allred-texas-senate-democratic-primary-dallas/",
    "timestamp": "2025-12-08T13:20:19Z"
  },
  {
    "title": "\"Murder on the High Seas\": War Crimes Prosecutor Reed Brody on Trump's Boat Strikes",
    "description": "Pressure is growing on the Trump administration to release video of a U.S. airstrike on September 2 that killed two men who were left shipwrecked in the Caribbean after an initial U.S. strike on their vessel killed nine people. The Trump administration claims…",
    "link": "https://www.democracynow.org/2025/12/8/pete_hegseth_boat_strikes_war_crimes",
    "timestamp": "2025-12-08T13:15:50Z"
  },
  {
    "title": "42% of student loan borrowers say bills make it harder to cover basic needs such as food, survey finds",
    "description": "A large share of student loan borrowers report that their debt makes it harder to cover basic needs such as food and housing, a new report finds.",
    "link": "https://www.cnbc.com/2025/12/08/student-loan-borrowers-say-bills-make-it-harder-to-cover-basic-needs-survey.html",
    "timestamp": "2025-12-08T13:15:01Z"
  }
]