[
  {
    "title": "BREAKING NEWS: Hollywood actor Actor Woody Harrelson just threatened Donald Trump’s life",
    "description": "BREAKING NEWS: Hollywood actor Actor Woody Harrelson just threatened Donald Trump’s life after claiming he would ‘slip him some cyanide’ if he was Trump’s secret service agent so he could poison him to ‘get rid of him.’",
    "link": "https://freerepublic.com/focus/f-chat/4352063/posts",
    "timestamp": "2025-11-12T08:39:33Z"
  },
  {
    "title": "China and Spain sign agreements to strengthen cooperation on Spanish king's visit",
    "description": "Spanish King Felipe VI and Chinese President Xi Jinping have signed agreements on language exchanges and other areas as both sides vowed to strengthen their cooperation. The meeting Wednesday comes on the Spanish monarch's first state visit to China. Spain, t…",
    "link": "https://apnews.com/article/china-spain-king-felipe-visit-a790cccbd51ec47c5643b45c9e46cbbc",
    "timestamp": "2025-11-12T08:36:20Z"
  },
  {
    "title": "GOP eyes health care reform as Dems push to extend ACA subsidies",
    "description": "Republicans are looking for alternative ways to avoid health care premium spikes in January — separate from Democratic proposals to extend Obamacare enhanced subsidies.",
    "link": "https://www.deseret.com/politics/2025/11/11/senate-lays-groundwork-for-aca-reform/",
    "timestamp": "2025-11-12T08:35:37Z"
  },
  {
    "title": "The government shutdown has escalated the US war on the poor",
    "description": "Volunteers place food items in vehicles during a mobile food distribution at a high school, in Cedar Creek, Texas, US […]\nThe post The government shutdown has escalated the US war on the poor appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/11/12/the-government-shutdown-has-escalated-the-us-war-on-the-poor/",
    "timestamp": "2025-11-12T08:31:00Z"
  },
  {
    "title": "America’s tariff gamble was built on its market power—Did China’s near-monopoly on critical minerals trump it?",
    "description": "America optimistically bet that its market size could force China to bend to its tariffs. But Beijing used its dominance in critical minerals to stand its ground. Eventually, it won, with Washington having to agree to a truce without much of a gain.",
    "link": "https://www.livemint.com/opinion/online-views/america-tariff-gamble-market-power-china-monopoly-critical-minerals-trump-xi-monopsony-11762861119508.html",
    "timestamp": "2025-11-12T08:30:15Z"
  },
  {
    "title": "Donald Trump’s granddaughter says he will miss her LPGA Tour debut as he’s ‘a little busy running the world’",
    "description": "Donald Trump will not attend his granddaughter's LPGA Tour debut as she says he is busy \"running the world\".",
    "link": "https://www.independent.ie/sport/golf/donald-trumps-granddaughter-says-he-will-miss-her-lpga-tour-debut-as-hes-a-little-busy-running-the-world/a324054251.html",
    "timestamp": "2025-11-12T08:23:21Z"
  },
  {
    "title": "Arrival of US aircraft carrier fuels Venezuelan fears of attack",
    "description": "Caracas (AFP) Nov 11, 2025\n\n\n A US aircraft carrier strike group arrived in Latin America Tuesday, escalating a military buildup Venezuela has warned could trigger a full-blown conflict as it announced its own \"massive\" deployment. \n\nThe USS Gerald R. Ford, t…",
    "link": "https://www.spacewar.com/reports/Arrival_of_US_aircraft_carrier_fuels_Venezuelan_fears_of_attack_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "Colombia halts intelligence sharing with U.S. over boat strikes",
    "description": "Washington DC (UPI) Nov 12, 2025 \n\n\n Colombian President Gustavo Petro has ordered the South American nation's security authorities to cease sharing intelligence with the United States over the Trump administration's continued attacks on vessels in the Caribb…",
    "link": "https://www.spacewar.com/reports/Colombia_halts_intelligence_sharing_with_US_over_boat_strikes_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "Trump II could be moment to break US tech power: author",
    "description": "Lisbon (AFP) Nov 11, 2025\n\n\n America's lashing out at trade partners under the second presidency of Donald Trump could prove the moment to break its tech firms' power beyond US borders, activist Cory Doctorow told AFP Tuesday. \n\nA 25-year veteran of digital r…",
    "link": "https://www.spacedaily.com/reports/Trump_II_could_be_moment_to_break_US_tech_power_author_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "Trump says 'we've had a lot of problems' with France",
    "description": "Washington (AFP) Nov 11, 2025\n\n\n President Donald Trump took a sudden swipe at France on Monday during an interview with US broadcaster Fox News, saying \"we've had a lot of problems with the French.\" \n\nFox News presenter Laura Ingraham questioned the US presi…",
    "link": "https://www.spacewar.com/reports/Trump_says_weve_had_a_lot_of_problems_with_France_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "Russia offers US nuclear talks in bid to ease tensions",
    "description": "Moscow (AFP) Nov 11, 2025\n\n\n Russia on Tuesday offered to discuss with the United States allegations from Washington that it had carried out secret underground nuclear tests, in a bid to ease tensions between the world's top two nuclear superpowers. \n\nRussia …",
    "link": "https://www.spacewar.com/reports/Russia_offers_US_nuclear_talks_in_bid_to_ease_tensions_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "Thailand suspends truce with Cambodia after 4 soldiers hurt by landmine",
    "description": "Washington DC (UPI) Nov 11, 2025 \n\n\n Thailand on Tuesday suspended the U.S. President Donald Trump-brokered truce with Cambodia after four soldiers patrolling near their shared border were wounded by landmines. \n \"Agreement suspended,\" the Royal Thai Army sai…",
    "link": "https://www.spacewar.com/reports/Thailand_suspends_truce_with_Cambodia_after_4_soldiers_hurt_by_landmine_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "U.S. carrier strike force positioned in waters near Venezuela",
    "description": "Washington DC (UPI) Nov 11, 2025 \n\n\n A carrier strike group has arrived at an undisclosed location within the U.S. Southern Command's control amid tensions with Venezuela and drug cartels. \n The USS Gerald R. Ford aircraft carrier and supporting vessels have …",
    "link": "https://www.spacewar.com/reports/US_carrier_strike_force_positioned_in_waters_near_Venezuela_999.html",
    "timestamp": "2025-11-12T08:18:40Z"
  },
  {
    "title": "China and Spain sign agreements to strengthen cooperation on Spanish king's visit",
    "description": "Spanish King Felipe VI and Chinese President Xi Jinping have signed agreements on language exchanges and other areas as both sides vowed to strengthen their cooperation",
    "link": "https://abcnews.go.com/Business/wireStory/china-spain-sign-agreements-strengthen-cooperation-spanish-kings-127441462",
    "timestamp": "2025-11-12T08:13:39Z"
  },
  {
    "title": "Why is the stock market surging today? Sensex jumps over 700 pts, Nifty above 25,900; Here are 6 factors steering D-St higher",
    "description": "Indian stocks surged Wednesday, led by financials and IT, as optimism grew over a potential U.S. trade deal and an end to the government shutdown. Positive U.S. labor data fueled rate-cut hopes, while Bihar exit polls favored the ruling NDA. Strong corporate …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-surging-today-sensex-jumps-over-700-pts-nifty-above-25800-here-are-6-factors-steering-d-st-higher/articleshow/125269057.cms",
    "timestamp": "2025-11-12T08:09:48Z"
  },
  {
    "title": "China's soybean glut could defeat US export hopes after trade thaw",
    "description": "China faces a soybean surplus after massive imports from South America. This glut reduces the need for U.S. soybean purchases, even with a trade agreement. Record stockpiles at ports and weak processing margins mean China is unlikely to meet U.S. export targe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chinas-soybean-glut-could-defeat-us-export-hopes-after-trade-thaw/articleshow/125269065.cms",
    "timestamp": "2025-11-12T08:03:57Z"
  },
  {
    "title": "'Tacky AF': Trump Clowned Over 'Embarrassing' White House Renovation Blunder",
    "description": "The president fumbled his words while bragging about the work of a \"very talented person\" on the West Colonnade.",
    "link": "https://www.huffpost.com/entry/trump-brass-bronze-presidential-walk-of-fame-white-house_n_691427fbe4b0c2898becf44c",
    "timestamp": "2025-11-12T08:03:24Z"
  },
  {
    "title": "Does Trump have a defamation case against the BBC?",
    "description": "Donald Trump has announced plans to take the BBC to court, seeking a staggering one billion dollars in damages. He argues that a documentary on the network manipulated his speech's context, portraying him inaccurately. As the case heads to a U.S. courtroom, T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/does-trump-have-a-defamation-case-against-the-bbc/articleshow/125269013.cms",
    "timestamp": "2025-11-12T08:00:16Z"
  },
  {
    "title": "Trump Defends Enrolling International Students",
    "description": "President Donald Trump stressed the value of international students in the U.S. during an interview aired on Fox News Monday. Fox News host Laura Ingraham pressed Trump on why he wouldn’t curb international student enrollments, particularly from China. Trump …",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/11/12/trump-defends-enrolling-international-students",
    "timestamp": "2025-11-12T08:00:00Z"
  },
  {
    "title": "Under Pressure to Cut Costs, a University Closes Its Press",
    "description": "Under Pressure to Cut Costs, a University Closes Its Press\n\n \n\n\n \nkathryn.palmer…\n\nWed, 11/12/2025 - 03:00 AM\n\nBucknell University says it’s closing its storied academic press to focus more resources on undergraduate students. But faculty and other scholars s…",
    "link": "https://www.insidehighered.com/news/faculty-issues/books-publishing/2025/11/12/under-pressure-prove-roi-university-closes-its",
    "timestamp": "2025-11-12T08:00:00Z"
  },
  {
    "title": "Trump says BBC ‘defrauded the public’ with editing of January 6 speech",
    "description": "The US President told Fox News he had an ‘obligation’ to take legal action over the speech.",
    "link": "https://www.thejournal.ie/trump-bbc-2-6871912-Nov2025/",
    "timestamp": "2025-11-12T07:58:58Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Rents rising, housing plan to be signed off and Trump threatens BBC with billion-dollar legal action",
    "link": "https://www.thejournal.ie/9-at-9-wednesday-63-6871910-Nov2025/",
    "timestamp": "2025-11-12T07:58:28Z"
  },
  {
    "title": "Economist Stunned By Trump’s Latest Wild Claim: ‘Quite Literally False’",
    "description": "University of Michigan professor Justin Wolfers said it's \"such a lie that I worry that there's literally a break with reality inside the man's mind.\"",
    "link": "https://www.huffpost.com/entry/justin-wolfers-donald-trump-false-claim_n_69143441e4b09f6fd8c428a7",
    "timestamp": "2025-11-12T07:58:21Z"
  },
  {
    "title": "World oil and gas demand could grow until 2050, IEA says",
    "description": "Global oil and gas demand could grow until 2050, the International Energy Agency said today, departing from its previous expectations of a speedy transition to cleaner fuels and predicting that the world will likely fail to achieve climate goals.",
    "link": "https://www.rte.ie/news/business/2025/1112/1543486-international-energy-agency-outlook/",
    "timestamp": "2025-11-12T07:50:04Z"
  },
  {
    "title": "MAGA Rages at Trump Saying H-1B Visas Needed to Bring in Talent",
    "description": "The centerpiece of President Donald Trump's \"America First\" agenda has been a fierce crackdown on immigration.",
    "link": "https://biztoc.com/x/b6975939f321d9ff",
    "timestamp": "2025-11-12T07:48:56Z"
  },
  {
    "title": "Analysis-China's soybean glut could defeat US export hopes after trade thaw",
    "description": "SINGAPORE/BEIJING (Reuters) -China is grappling with a glut of soybeans after months of record imports, curbing prospects for U. exports despite a recent...",
    "link": "https://finance.yahoo.com/news/analysis-chinas-soybean-glut-could-074813713.html",
    "timestamp": "2025-11-12T07:48:13Z"
  },
  {
    "title": "Colombia suspends intelligence sharing with US over Caribbean airstrikes",
    "description": "Colombian President Gustavo Petro has suspended intelligence sharing with the US over its airstrikes on alleged drug boats in the Caribbean Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627659-colombia-intelligence-sharing-us/",
    "timestamp": "2025-11-12T07:47:59Z"
  },
  {
    "title": "Top 4 reasons why the Dollar is outperforming global currencies",
    "description": "The U.S. dollar regains strength near the 100 mark, supported by the Fed’s cautious stance, easing trade tensions, government shutdown dynamics, and weakness in rival currencies like the euro, yen, and pound.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/top-4-reasons-why-the-dollar-is-outperforming-global-currencies/articleshow/125268625.cms",
    "timestamp": "2025-11-12T07:42:39Z"
  },
  {
    "title": "Donald Trump says he has ‘obligation’ to sue BBC over edit of January 6 speech",
    "description": "US president Donald Trump has said he has an “obligation” to sue the BBC over the way his “beautiful speech” on January 6, 2021 was edited.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-he-has-obligation-to-sue-bbc-over-edit-of-january-6-speech/a29699887.html",
    "timestamp": "2025-11-12T07:41:58Z"
  },
  {
    "title": "Live Around the Planet: Wednesday November 12th",
    "description": "Yes, it's me! Mark Steyn of that ilk - back off my deathbed for another hour of questions from Mark Steyn Club members around the planet. We start at 3pm North American Eastern - which, across the Atlantic, is back to its usual hour: 8pm in the British",
    "link": "https://www.steynonline.com/15714/live-around-the-planet-wednesday-november-12th",
    "timestamp": "2025-11-12T07:40:32Z"
  },
  {
    "title": "Yamaha XSR 155 launched in India at Rs 1.49 lakh: Here's what's new",
    "description": "Powering the motorcycle is the same 155cc, liquid-cooled, single-cylinder engine that also drives the R15 and MT-15. It delivers 18.4hp at 10,000rpm and 14.1Nm of torque at 7,500rpm, paired with a smooth-shifting 6-speed gearbox.",
    "link": "https://timesofindia.indiatimes.com/auto/bikes/yamaha-xsr-155-launched-in-india-at-rs-1-49-lakh-heres-whats-new/articleshow/125255907.cms",
    "timestamp": "2025-11-12T07:37:37Z"
  },
  {
    "title": "K자형 미국 경제가 위험 신호를 보내는 이유",
    "description": "US private payrolls fell by an average of 11,250 jobs per week in the four weeks ended Oct. 25, according to data released Tuesday by ADP Research. Enda Curran reports https://t.co/PHcFTJxp8r pic.twitter.com/IZlpOHgD4S— Bloomberg TV (@BloombergTV) November 11…",
    "link": "https://ryueyes11.tistory.com/511969",
    "timestamp": "2025-11-12T07:36:35Z"
  },
  {
    "title": "Top diplomats from G7 countries meet in Canada as trade tensions rise with Trump",
    "description": "Top diplomats from the Group of Seven industrialized democracies are converging on southern Ontario as tensions rise between the U.S. and traditional allies like Canada over defense spending, trade and uncertainty over President Donald Trump's ceasefire plan …",
    "link": "https://japantoday.com/category/politics/top-diplomats-from-g7-countries-meet-in-canada-as-trade-tensions-rise-with-trump-1",
    "timestamp": "2025-11-12T07:33:18Z"
  },
  {
    "title": "China and Spain signs agreements to strengthen cooperation on Spanish king’s visit",
    "description": "BEIJING (AP) — Spanish King Felipe VI and Chinese President Xi Jinping signed agreements on language exchanges and other areas Wednesday as both sides vowed to strengthen their cooperation. The monarch’s visit comes as Spain, the eurozone’s fourth-largest eco…",
    "link": "https://financialpost.com/pmn/china-and-spain-signs-agreements-to-strengthen-cooperation-on-spanish-kings-visit",
    "timestamp": "2025-11-12T07:29:46Z"
  },
  {
    "title": "Reliance International: How global oil dynamics made Abu Dhabi unit a vital trade artery for Reliance",
    "description": "Reliance International Ltd, a subsidiary of Reliance Industries, has emerged a key unit of the conglomerate contributing nearly one-fifths of the parent's consolidated revenues. Here's how the Abu Dhabi-based, oil-trading unit has emerged a key piece in opera…",
    "link": "https://www.livemint.com/companies/reliance-international-industries-russia-oil-trade-abu-dhabi-uae-crude-sikka-port-petroleum-products-11762885889173.html",
    "timestamp": "2025-11-12T07:22:42Z"
  },
  {
    "title": "‘You Don’t Have Certain Talents’: Trump Defends Need For H-1B Visas In Fox News Interview",
    "description": "Trump said the U.S. doesn’t have “certain talents and people have to learn,” adding that the skilled worker visa was needed to “bring in talent.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/12/you-dont-have-certain-talents-trump-defends-need-for-h-1b-visas-in-fox-news-interview/",
    "timestamp": "2025-11-12T07:21:41Z"
  },
  {
    "title": "Bill to end government shutdown survives key hurdle before House-wide vote",
    "description": "The House is set to vote Wednesday on ending the government shutdown after the funding bill clears a key committee hurdle.",
    "link": "https://www.foxnews.com/politics/bill-end-government-shutdown-survives-key-hurdle-before-house-wide-vote",
    "timestamp": "2025-11-12T07:15:14Z"
  },
  {
    "title": "UK government is caught up in a feud between Trump and the BBC",
    "description": "Britain’s government was due to weigh in Tuesday on a feud between the BBC and U.S. President Donald Trump, who is threatening to sue the broadcaster over the way it edited a speech he made after losing the 2020 presidential election. Culture Secretary Lisa N…",
    "link": "https://freerepublic.com/focus/f-news/4352062/posts",
    "timestamp": "2025-11-12T07:13:11Z"
  },
  {
    "title": "Howie Carr: This judge a Wolfe in sheep’s clothing",
    "description": "Doddering retired US District Court Judge Mark Wolf has always been an insufferable loud-mouthed jerk, and if you don’t believe me, just ask mobster Stevie Flemmi.",
    "link": "https://www.bostonherald.com/2025/11/12/howie-carr-this-judge-a-wolfe-in-sheeps-clothing/",
    "timestamp": "2025-11-12T07:12:59Z"
  },
  {
    "title": "Strictly star La Voix makes awkward BBC resignation joke during live show as host left speechless",
    "description": "Strictly Come Dancing contestant La Voix left the It Takes Two studio speechless with a joke about resignations at the top of the BBC on Tuesday (11 November).",
    "link": "https://www.the-independent.com/tv/culture/strictly-la-voix-trump-sue-bbc-joke-b2863456.html",
    "timestamp": "2025-11-12T07:11:41Z"
  },
  {
    "title": "Explainer-Does Trump have a defamation case against the BBC?",
    "description": "(Reuters) -U.S. President Donald Trump has threatened to sue the BBC for at least $1 billion over its airing of what he says was a deceptively edited documentary, but the case could hinge on whether anyone in Florida watched it online and felt misled. Read fu…",
    "link": "https://www.thestar.com.my/news/world/2025/11/12/explainer-does-trump-have-a-defamation-case-against-the-bbc",
    "timestamp": "2025-11-12T07:07:00Z"
  },
  {
    "title": "Berkeley Moonbats Attack TPUSA Event",
    "description": "The sort of moonbats who killed Charlie Kirk pay tribute to his memory in their own way: A bloody fight broke out near the University of California, Berkeley, on Monday afternoon, ahead of a Turning Point USA event on campus. While details are still unclear, …",
    "link": "https://freerepublic.com/focus/f-chat/4352061/posts",
    "timestamp": "2025-11-12T07:06:22Z"
  },
  {
    "title": "Wike vs Military Officer Yerima: Stanley Ontop Taunts FCT Minister Over Viral Heated Face-Off",
    "description": "Nollywood producer Stanley Ontop reacts to the viral video of Minister Wike’s heated confrontation with military officer Ahmad Yerima, sparking mixed reactions.",
    "link": "https://www.legit.ng/entertainment/celebrities/1682920-wike-military-officer-yerima-stanley-ontop-taunts-fct-minister-viral-heated-face-off/",
    "timestamp": "2025-11-12T07:03:44Z"
  },
  {
    "title": "Reece James’ hilarious response to Donald Trump possibly being at World Cup",
    "description": "Chelsea captain Reece James has given a hilarious response to Donald Trump possibly being at the World Cup.In images that circled around the world, the President of The United States was at The Club W...",
    "link": "https://chelsea.news/2025/11/reece-james-hilarious-response-to-donald-trump-possibly-being-at-world-cup/",
    "timestamp": "2025-11-12T07:00:00Z"
  },
  {
    "title": "Fear and Loathing at Columbia University",
    "description": "On September 17, 2025, one month before I was to teach my annual social justice reporting class at Columbia University’s Graduate School of Journalism, the campus lowered its flag to half-mast in honor of far-right pontificator Charlie Kirk. Nobody deserves t…",
    "link": "https://www.counterpunch.org/2025/11/12/fear-and-loathing-at-columbia-university/",
    "timestamp": "2025-11-12T06:56:27Z"
  },
  {
    "title": "Dangerous Edits: The BBC’s Foolish Gift to Donald Trump",
    "description": "It began with a revelation in The Telegraph on November 3.  The paper had seen an internal memo in the BBC pointing to editing on its October 2024 Panorama programme of two parts of US President Donald Trump’s speech in January 2021.  The sin was not in the e…",
    "link": "https://www.counterpunch.org/2025/11/12/dangerous-edits-the-bbcs-foolish-gift-to-donald-trump/",
    "timestamp": "2025-11-12T06:54:34Z"
  },
  {
    "title": "Transportation Secretary says air traffic controllers who stopped working before missing pay could face consequences",
    "description": "Duffy said he was concerned about the \"dedication\" and \"patriotism\" of controllers who stopped working before missing their pay.",
    "link": "https://www.businessinsider.com/air-traffic-controllers-punish-sick-miss-pay-shutdown-sean-duffy-2025-11",
    "timestamp": "2025-11-12T06:53:50Z"
  },
  {
    "title": "JFK’s grandson, Jack Schlossberg, announces 2026 run for Nadler's seat in Congress",
    "description": "JFK’s grandson, Jack Schlossberg, announces 2026 run for Nadler's seat in Congressgo.com",
    "link": "https://abcnews.go.com/Politics/jfks-grandson-jack-schlossberg-announces-2026-run-nadlers/story?id=127440606",
    "timestamp": "2025-11-12T06:52:16Z"
  },
  {
    "title": "India should press US to roll back \"Russian oil\" tariffs before trade deal: GTRI",
    "description": "India must advocate for the removal of the 25% tariff on Russian oil imposed by the United States, as this is a pivotal move before finalizing any trade agreements. According to experts from the Global Trade Research Initiative, eliminating this tariff will e…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-should-press-us-to-roll-back-russian-oil-tariffs-before-trade-deal-gtri/articleshow/125267647.cms",
    "timestamp": "2025-11-12T06:51:40Z"
  },
  {
    "title": "Singapore sees further cooperation between ASEAN and EU on digital economy, deputy PM says",
    "description": "Singapore DPM Gan Kim Yong said if the EU and ASEAN can come together to discuss a digital economic agreement, it would be a \"major breakthrough.\"",
    "link": "https://www.cnbc.com/2025/11/12/singapore-sees-further-cooperation-between-asean-and-eu-on-digital-economy-deputy-pm-says.html",
    "timestamp": "2025-11-12T06:47:27Z"
  },
  {
    "title": "A historic shutdown is nearly over. It leaves no winners and much frustration",
    "description": "The longest government shutdown in history could conclude as soon as Day 43 with almost no one happy with the final result.",
    "link": "https://www.news4jax.com/news/politics/2025/11/12/a-historic-shutdown-is-nearly-over-it-leaves-no-winners-and-much-frustration/",
    "timestamp": "2025-11-12T06:46:01Z"
  },
  {
    "title": "Parliament poised to go populist",
    "description": "In today’s edition: Parliament braces for a potential first EPP–Patriots alliance in Thursday’s due diligence vote, the EU’s top judge blasts Viktor Orbán over rule-of-law abuse, and lawmakers’ short-lived MFF rebellion fizzles after Commission concessions",
    "link": "https://www.euractiv.com/news/parliament-poised-to-go-populist/",
    "timestamp": "2025-11-12T06:43:38Z"
  },
  {
    "title": "US Senate passes bill to end longest ever government shutdown",
    "description": "The United States is moving closer to ending its record-breaking government shutdown after the Senate took a critical step towards ending its five-week impasse. The upper chamber of Congress on Monday night approved a spending package by a vote of 60 to 40 to…",
    "link": "https://thechronicle.com.gh/us-senate-passes-bill-to-end-longest-ever-government-shutdown/",
    "timestamp": "2025-11-12T06:40:57Z"
  },
  {
    "title": "Thailand demands apology from Cambodia over landmine incident",
    "description": "BANGKOK: Thailand has demanded an apology from Cambodia after accusing it of laying fresh landmines that have injured Thai soldiers, a foreign ministry official said on Wednesday (Nov 12), a day after Bangk",
    "link": "https://www.channelnewsasia.com/asia/thailand-demands-apology-cambodia-landmines-injured-5461966",
    "timestamp": "2025-11-12T06:39:34Z"
  },
  {
    "title": "Syria to join US-led coalition to defeat IS group after Trump meeting",
    "description": "Syria will join the international coalition to combat the Islamic State group, marking a shift in US foreign policy in the Middle East, a senior Trump administration official has confirmed. The announcement came as President Donald Trump met Syrian President …",
    "link": "https://thechronicle.com.gh/syria-to-join-us-led-coalition-to-defeat-is-group-after-trump-meeting/",
    "timestamp": "2025-11-12T06:39:32Z"
  },
  {
    "title": "A historic shutdown is nearly over. It leaves no winners and much frustration",
    "description": "The longest government shutdown in history could conclude as soon as Day 43 with almost no one happy with the final result",
    "link": "https://abcnews.go.com/Politics/wireStory/historic-shutdown-leaves-winners-frustration-127439247",
    "timestamp": "2025-11-12T06:37:56Z"
  },
  {
    "title": "Gulfstream says US business jet demand strong but China slow due to trade tensions",
    "description": "China and the United States have taken steps to ease tensions in recent days following a meeting between U.S. President Donald Trump and Chinese President Xi Jinping.",
    "link": "https://www.thehindubusinessline.com/economy/logistics/gulfstream-says-us-business-jet-demand-strong-but-china-slow-due-to-trade-tensions/article70270053.ece",
    "timestamp": "2025-11-12T06:35:53Z"
  },
  {
    "title": "Jimmy Fallon Roasts Melania Trump’s Past Christmas Decor in Latest East Wing Demolition Jab: ‘A Festive Hell’ | Video",
    "description": "\"It is so cold in Washington, Trump's new ballroom shriveled up into the White House,\" the comedian also jokes\nThe post Jimmy Fallon Roasts Melania Trump’s Past Christmas Decor in Latest East Wing Demolition Jab: ‘A Festive Hell’ | Video appeared first on The…",
    "link": "https://www.thewrap.com/jimmy-fallon-melania-trump-christmas-decor-joke-video/",
    "timestamp": "2025-11-12T06:34:23Z"
  },
  {
    "title": "Trump’s absence from Cop30 an ‘abomination’, says California governor",
    "description": "Gavin Newsom also accuses US president of attempting to rig next election",
    "link": "https://www.irishtimes.com/environment/2025/11/12/trumps-absence-from-cop30-an-abomination-says-california-governor/",
    "timestamp": "2025-11-12T06:27:56Z"
  },
  {
    "title": "Stocks, Bonds Rise as US Data Spurs Rate-Cut Bets: Markets Wrap",
    "description": "Asian stocks advanced alongside Treasuries after softer US jobs data strengthened bets on a Federal Reserve interest-rate cut.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-bonds-rise-as-us-data-spurs-rate-cut-bets-markets-wrap",
    "timestamp": "2025-11-12T06:19:10Z"
  },
  {
    "title": "Trump's attitude to climate change a 'disgrace'",
    "description": "In a stinging address at a COP30 presidency press conference in Belém last night, California Governor Gavin Newsom labelled US President Donald Trump's attitude to climate change as an abomination and a disgrace.",
    "link": "https://www.rte.ie/news/us/2025/1112/1543466-cop30-brazil/",
    "timestamp": "2025-11-12T06:12:00Z"
  },
  {
    "title": "Reagan-appointed judge resigns in protest of Trump, warns of president's 'assault on the rule of law'",
    "description": "A federal judge resigned in protest over President Donald Trump's \"assault on rule of law,\" citing the president's partisan use of the justice system.",
    "link": "https://www.foxnews.com/politics/reagan-appointed-judge-resigns-protest-trump-warns-presidents-assault-rule-law",
    "timestamp": "2025-11-12T06:08:27Z"
  },
  {
    "title": "'Daily Show' Exposes How Trump Just Went 'Stupid' With This 1 Economic Proposal",
    "description": "'Daily Show' Exposes How Trump Just Went 'Stupid' With This 1 Economic Proposalhuffpost.com",
    "link": "https://www.huffpost.com/entry/daily-show-josh-johnson-trump-tariff-check_n_69140de9e4b0c2898bece737",
    "timestamp": "2025-11-12T06:08:02Z"
  },
  {
    "title": "Historic shutdown is nearly over, leaving no winners and much frustration",
    "description": "The longest government shutdown in history could conclude as soon as Day 43 with almost no one happy with the final result. Hundreds of representatives are preparing to return to Washington on Wednesday after a nearly eight-week absence. Democrats didn’t get …",
    "link": "https://apnews.com/article/shutdown-republicans-schumer-health-insurance-tax-credits-a57733892f05a8893f5781203238e889",
    "timestamp": "2025-11-12T06:04:41Z"
  },
  {
    "title": "Colombia’s Petro halts intelligence sharing with US over Caribbean strikes",
    "description": "Announcement comes as US aircraft carrier arrives in the Caribbean and Presidents Trump, Petro feud.",
    "link": "https://www.aljazeera.com/news/2025/11/12/colombias-petro-halts-intelligence-sharing-with-us-over-caribbean-strikes",
    "timestamp": "2025-11-12T06:04:29Z"
  },
  {
    "title": "Renewables outpace fossil fuels despite US policy shift: IEA",
    "description": "Renewable energy is still expanding faster than fossil fuels around the world despite policy changes in the United States, with oil demand possibly peaking “around 2030”, the International Energy Agency said Wednesday. The Paris-based IEA presented different …",
    "link": "https://www.digitaljournal.com/world/renewables-outpace-fossil-fuels-despite-us-policy-shift-iea/article",
    "timestamp": "2025-11-12T06:02:20Z"
  },
  {
    "title": "Exclusive-GM wants parts makers to pull supply chains from China",
    "description": "DETROIT (Reuters) -General Motors has directed several thousand of its suppliers to scrub their supply chains of parts from China, four people familiar with ...",
    "link": "https://finance.yahoo.com/news/exclusive-gm-wants-parts-makers-060115983.html",
    "timestamp": "2025-11-12T06:01:15Z"
  },
  {
    "title": "Boom in weight loss drugs may help protect Ireland's corporation tax haul, says watchdog",
    "description": "The Irish Fiscal Advisory Council has found that Ireland’s corporation tax receipts continue to boom – but it’s again warning of risks.",
    "link": "https://www.thejournal.ie/fiscal-advisory-council-tariffs-6870951-Nov2025/",
    "timestamp": "2025-11-12T06:00:33Z"
  },
  {
    "title": "Kathy Sheridan: With its big, ridiculous mistake, the BBC played into the hands of an authoritarian liar",
    "description": "Does Trump have a reputation to defend where January 6th is concerned? A crowdfunding campaign may be in order",
    "link": "https://www.irishtimes.com/opinion/2025/11/12/kathy-sheridan-with-its-big-ridiculous-mistake-the-bbc-played-into-the-hands-of-an-authoritarian-liar/",
    "timestamp": "2025-11-12T06:00:01Z"
  },
  {
    "title": "Giuliani, Meadows among Trump’s 77 pardons",
    "description": "Trump pardoned key allies (Giuliani, Meadows) tied to 2020 election challenges, sparking Democratic backlash and accusations of undermining accountability. The pardons align with Trump’s broader political strategy, as allies like Texas Gov. Abbott amplify his…",
    "link": "https://www.naturalnews.com/2025-11-12-giuliani-meadows-among-trumps-77-pardons.html",
    "timestamp": "2025-11-12T06:00:00Z"
  },
  {
    "title": "U.S. plans to construct $500M military base near Gaza border amid escalating tensions",
    "description": "The U.S. plans to construct a large military facility near Gaza to house thousands of troops, signaling a major shift in Washington’s involvement and potentially reducing Israel’s control over the enclave. The base will serve as headquarters for a multination…",
    "link": "https://www.naturalnews.com/2025-11-12-us-to-construct-military-base-near-gaza-border.html",
    "timestamp": "2025-11-12T06:00:00Z"
  },
  {
    "title": "Trump’s $80 billion nuclear push for AI: A high-stakes gamble or recipe for disaster?",
    "description": "The Trump administration plans to fund 10 new Westinghouse AP1000 reactors (1,100 MW each) by 2030, backed by hundreds of billions in taxpayer loans via the Department of Energy‘s Loan Programs Office. The goal is to meet exploding energy demands from AI data…",
    "link": "https://www.naturalnews.com/2025-11-12-trump-nuclear-push-ai-gamble-recipe-for-disaster.html",
    "timestamp": "2025-11-12T06:00:00Z"
  },
  {
    "title": "A Strategic Supper: Trump engages corporate America for economic policy reset",
    "description": "US President Donald Trump is expected to host a private dinner at the White House on Wednesday with top business executives, including the CEOs of Nasdaq and JPMorgan Chase. The gathering aims to strengthen ties between the government and corporate leaders as…",
    "link": "https://m.economictimes.com/markets/stocks/news/a-strategic-supper-trump-engages-corporate-america-for-economic-policy-reset/the-event/slideshow/125266661.cms",
    "timestamp": "2025-11-12T05:59:58Z"
  },
  {
    "title": "Grocery stores are anxious for customers to get SNAP benefits restored",
    "description": "Some small grocery stores and neighborhood convenience stores are eager for the U.S. government shutdown to end and for their customers to start receiving federal food aid again. Late last month, the Trump administration froze funding for the SNAP benefits th…",
    "link": "https://apnews.com/article/snap-food-benefits-groceries-stores-shutdown-e52af573b4b29beae9cb193892998b0c",
    "timestamp": "2025-11-12T05:42:53Z"
  },
  {
    "title": "Kim Kardashian lashes out at ‘pathological liar’ psychics who told her she’d pass the bar exam",
    "description": "Reality star said she met with four psychics who told her she would pass",
    "link": "https://www.the-independent.com/life-style/kim-kardashian-california-bar-exam-fail-tiktok-b2863433.html",
    "timestamp": "2025-11-12T05:42:00Z"
  },
  {
    "title": "Jack Schlossberg, member of Kennedy political dynasty, is running for Congress",
    "description": "Jack Schlossberg, the only grandson of late President John F. Kennedy and Jackie Kennedy Onassis, announced Tuesday night that he's running for U.S.",
    "link": "https://www.nbcnews.com/politics/politics-news/jack-schlossberg-member-kennedy-political-dynasty-running-congress-rcna243382",
    "timestamp": "2025-11-12T05:40:26Z"
  },
  {
    "title": "Historic moment! J&K beat Delhi for the first time in 65 years of Ranji Trophy history",
    "description": "J&K’s improvement is an indication of Indian cricket’s far-reaching infrastructure. A new-found clarity in their approach is at the core of their rising stature. Paras Dogra, a veteran in domestic cricket, moved to J&K at the age of 38 when current BCCI presi…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/historic-moment-jk-beat-delhi-for-the-first-time-in-65-years-of-ranji-trophy-history/articleshow/125265871.cms",
    "timestamp": "2025-11-12T05:38:57Z"
  },
  {
    "title": "Google Doodle turns spotlight on the quadratic equation: The formula behind every curve explained",
    "description": "Google's latest doodle in India celebrates the quadratic equation, ax² + bx + c = 0, showcasing its real-world applications in physics, engineering, sports, and business. The interactive feature, linked to Gemini AI, demonstrates how this fundamental algebrai…",
    "link": "https://timesofindia.indiatimes.com/education/learning-with-toi/google-doodle-turns-spotlight-on-the-quadratic-equation-the-formula-behind-every-curve-explained/articleshow/125266040.cms",
    "timestamp": "2025-11-12T05:37:51Z"
  },
  {
    "title": "Trump Says He Hates Socialism. So Why Is He Acting Like a Socialist?",
    "description": "\"America will never be a socialist country!\" says President Donald Trump.\nI hope not.\nTrump rightly declared socialism \"the wrecker of nations and destroyer of societies.\"\nBut I fear he's confused about what socialism is.\n\"Trump says he's against socialism, b…",
    "link": "https://biztoc.com/x/b0feedcbcd689ac5",
    "timestamp": "2025-11-12T05:35:19Z"
  },
  {
    "title": "Swiss draft top executives for diplomatic push to cut US tariffs",
    "description": "As Switzerland closes in on a deal with the US to lower tariffs on the country, it will owe thanks to some of its richest executives who played a key role in wooing US president Donald Trump.",
    "link": "https://www.independent.ie/business/world/swiss-draft-top-executives-for-diplomatic-push-to-cut-us-tariffs/a1242419616.html",
    "timestamp": "2025-11-12T05:30:00Z"
  },
  {
    "title": "‘We must stand up for our journalism’ – departing BBC chief Tim Davie tells staff he’s ‘fiercely proud’ of their work",
    "description": "Outgoing BBC director-general Tim Davie has told staff the corporation has to “stand up for our journalism”, insisting it will control its own narrative that “will not just be given by our enemies”.",
    "link": "https://www.independent.ie/world-news/britain/we-must-stand-up-for-our-journalism-departing-bbc-chief-tim-davie-tells-staff-hes-fiercely-proud-of-their-work/a751590446.html",
    "timestamp": "2025-11-12T05:30:00Z"
  },
  {
    "title": "Mary Trump: Her Uncle on Veterans Day",
    "description": "Mary Trump is the daughter of Donald Trump’s older brother Fred Trump Jr. Mary is a trained psychologist. If you haven’t read her first book about Donald and his dysfunctional family, you should. It’s called: Too Much and Never Enough: How My Family Created t…",
    "link": "https://dianeravitch.net/2025/11/12/mary-trump-her-uncle-on-veterans-day/",
    "timestamp": "2025-11-12T05:30:00Z"
  },
  {
    "title": "A historic shutdown is nearly over. It leaves no winners and much frustration",
    "description": "The longest government shutdown in history could conclude as soon as Day 43 with almost no one happy with the final result.",
    "link": "https://www.click2houston.com/news/politics/2025/11/12/a-historic-shutdown-is-nearly-over-it-leaves-no-winners-and-much-frustration/",
    "timestamp": "2025-11-12T05:26:06Z"
  },
  {
    "title": "Ruby Rose brands Sydney Sweeney a ‘cretin’ after losing out on Christy Martin role",
    "description": "Australian actor claims she was originally attached to play boxer Christy Martin",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/ruby-rose-sydney-sweeney-cretin-christy-b2863426.html",
    "timestamp": "2025-11-12T05:24:09Z"
  },
  {
    "title": "Trump pardons record-breaking trail runner who took prohibited detour as he ran up and down Wyoming’s Grand Teton",
    "description": "\"Well… the trail trial of the century is officially over,\" Sunseri posted on Facebook after being granted the pardon.",
    "link": "https://nypost.com/2025/11/12/us-news/trump-pardons-trail-runner-who-took-prohibited-detour-as-he-ran-up-and-down-wyomings-grand-teton-in-record-time/",
    "timestamp": "2025-11-12T05:21:56Z"
  },
  {
    "title": "Why American factories will keep looking for alternatives to China",
    "description": "The landscape of American manufacturing is evolving as companies increasingly turn their backs on China, opting instead for countries like Vietnam to serve their production needs. Driven by the erratic nature of US-China trade relations, this strategic pivot …",
    "link": "https://economictimes.indiatimes.com/news/international/business/why-american-factories-will-keep-looking-for-alternatives-to-china/articleshow/125265874.cms",
    "timestamp": "2025-11-12T05:21:50Z"
  },
  {
    "title": "Mona Singh: I’ve made a conscious decision to stay away from my phone",
    "description": "Mona Singh discusses her conscious decision to reduce phone usage and the impact of screen fatigue on her life, drawing attention to the challenges of modern technology in the web show Thode Door Thode Paas.",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/mona-singhs-digital-detox-embracing-life-beyond-screens/articleshow/125265791.cms",
    "timestamp": "2025-11-12T05:20:08Z"
  },
  {
    "title": "Diverse and resilient energy production is needed to meet future demand, global report says",
    "description": "Electricity demand will rise much faster than overall energy growth in the coming decades, underscoring the need for diversified energy sources and supply chains, That's according to a new report by the International Energy Agency",
    "link": "https://abcnews.go.com/Business/wireStory/diverse-resilient-energy-production-needed-meet-future-demand-127439336",
    "timestamp": "2025-11-12T05:18:48Z"
  },
  {
    "title": "Small grocers and convenience stores feel an impact as customers go without SNAP benefits",
    "description": "Some small grocery stores and neighborhood convenience stores are eager for the U.S. government shutdown to end and for their customers to start receiving federal food aid again",
    "link": "https://abcnews.go.com/Business/wireStory/small-grocers-convenience-stores-feel-impact-customers-snap-127439244",
    "timestamp": "2025-11-12T05:18:12Z"
  },
  {
    "title": "Small grocers and convenience stores feel an impact as customers go without SNAP benefits",
    "description": "Some small grocery stores and neighborhood convenience stores are eager for the U.S. government shutdown to end and for their customers to start receiving federal food aid again",
    "link": "https://abcnews.go.com/US/wireStory/small-grocers-convenience-stores-feel-impact-customers-snap-127439243",
    "timestamp": "2025-11-12T05:18:11Z"
  },
  {
    "title": "Small grocers and convenience stores feel an impact as customers go without SNAP benefits",
    "description": "A little more than a year ago, Ryan Sprankle welcomed President Donald Trump to one of the three grocery stores his family owns near Pittsburgh. Trump was on the campaign trail; they talked about high grocery prices, and the Republican nominee picked up a bag…",
    "link": "https://financialpost.com/pmn/small-grocers-and-convenience-stores-feel-an-impact-as-customers-go-without-snap-benefits",
    "timestamp": "2025-11-12T05:15:35Z"
  },
  {
    "title": "Pro FX Tech revenue up 30.7% , profit up 44.5% in H1",
    "description": "Pro FX Tech reported a robust first half of FY26, with revenue climbing 30.7% to Rs 79.3 crore and net profit surging 44.5% to Rs 7.3 crore. The audio-visual firm attributed this growth to enhanced operational efficiency and strategic expansion, including add…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/pro-fx-tech-revenue-up-30-7-profit-up-44-5-in-h1/articleshow/125265717.cms",
    "timestamp": "2025-11-12T05:13:01Z"
  }
]