[
  {
    "title": "Chandra Nagamallaiah Killing: Trump Vows Tough Action Against Illegal Cuban Immigrant Suspect",
    "description": "US President Donald Trump on Monday vowed strong action against an illegal Cuban immigrant accused of the murder of Chandra Nagamallaiah, a 50-year-old Indian-origin motel manager in Texas. Nagamallaiah was beheaded in front of his wife and son in Dallas last…",
    "link": "https://www.ndtvprofit.com/world/chandra-nagamallaiah-killing-trump-vows-tough-action-against-illegal-cuban-immigrant-suspect",
    "timestamp": "2025-09-15T02:10:40Z"
  },
  {
    "title": "JD Vance hosting ‘The Charlie Kirk Show’ days after assassination: ‘Tribute to my friend’",
    "description": "The eponymous show will air at noon less than a week after Kirk was assassinated during a college campus visit in Utah.",
    "link": "https://nypost.com/2025/09/14/us-news/jd-vance-hosting-the-charlie-kirk-show-days-after-assassination-tribute-to-my-friend/",
    "timestamp": "2025-09-15T02:08:19Z"
  },
  {
    "title": "South Korea's top trade enovy heading to US for follow-up tariff talks",
    "description": "SEOUL (Reuters) -South Korea's top trade envoy, Yeo Han-koo, is heading to the United States on Monday for follow-up tariff negotiations, the trade ministry ...",
    "link": "https://www.yahoo.com/news/articles/south-koreas-top-trade-enovy-020336957.html",
    "timestamp": "2025-09-15T02:03:36Z"
  },
  {
    "title": "Express View on inflation: Prices stable",
    "description": "Amid US tariffs, moderation in inflation and lowering of GST rates could be spur economy needs",
    "link": "https://indianexpress.com/article/opinion/editorials/express-view-on-inflation-prices-stable-10250067/",
    "timestamp": "2025-09-15T02:03:25Z"
  },
  {
    "title": "Romania summons Russian ambassador over drone 'threat' days after Poland shoot-downs, raising NATO alarm",
    "description": "Romania on Sunday protested the entry of a Russian drone into its airspace during an attack on neighbouring Ukraine, summoning Moscow's ambassador to the foreign ministry over the incident. Foreign Minister Oana Toiu announced that Russia's ambassador to Buch…",
    "link": "https://economictimes.indiatimes.com/news/defence/romania-summons-russian-ambassador-over-drone-threat-days-after-poland-shoot-downs-raising-nato-alarm/articleshow/123890031.cms",
    "timestamp": "2025-09-15T02:02:24Z"
  },
  {
    "title": "New York Gov. Kathy Hochul Endorses Communist Zohran Mamdani in NYC Mayoral Race — Says He Will Not Surrender ‘One Inch’ to President Trump",
    "description": "New York Governor Kathy Hochul has announced her endorsement of the communist Zohran Mamdani in the New York City mayoral race.\nThe post New York Gov. Kathy Hochul Endorses Communist Zohran Mamdani in NYC Mayoral Race — Says He Will Not Surrender ‘One Inch’ t…",
    "link": "https://www.thegatewaypundit.com/2025/09/new-york-gov-kathy-hochul-endorses-communist-zohran/",
    "timestamp": "2025-09-15T02:00:05Z"
  },
  {
    "title": "How Britain’s Labour Party is (quietly) keeping up with the Democrats",
    "description": "Keir Starmer’s chief of staff wants the UK prime minister to lead an alliance of global progressives, even as he looks to woo Donald Trump and US Republicans.",
    "link": "https://www.politico.eu/article/britain-labour-party-democrats-keir-starmer-peter-mandelson-angela-rayner/",
    "timestamp": "2025-09-15T02:00:00Z"
  },
  {
    "title": "Oil holds gains as investors eye impact from attacks on Russian energy facilities",
    "description": "Oil prices saw minimal change on Monday. Investors are closely monitoring the impact of Ukrainian drone attacks on Russian refineries. These attacks could disrupt Russia's crude and fuel exports. The United States fuel-demand growth is also under observation.…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-holds-gains-as-investors-eye-impact-from-attacks-on-russian-energy-facilities/articleshow/123889991.cms",
    "timestamp": "2025-09-15T01:56:50Z"
  },
  {
    "title": "Trump condemns Chandra Nagamallaiah murder, blames Biden’s immigration policies",
    "description": "Donald Trump criticized Joe Biden's immigration policies after Chandra Nagamallaiah's murder. The suspect, Yordanis Cobos-Martinez, an undocumented immigrant, had a prior criminal record. He was released under supervision after Cuba refused his deportation. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-condemns-chandra-nagamallaiah-murder-blames-bidens-immigration-policies/articleshow/123889970.cms",
    "timestamp": "2025-09-15T01:56:05Z"
  },
  {
    "title": "UnitedHealth sought to meet Trump, WSJ reports",
    "description": "UnitedHealth has sought meetings with U.S. President Donald Trump, although it has not secured a meeting yet, The Wall Street Journal reported on Sunday.\nUnitedHealth CEO Stephen Hemsley recently met White House Chief of Staff Susie Wiles to discuss Medicare …",
    "link": "https://biztoc.com/x/6852dd65e8cfe479",
    "timestamp": "2025-09-15T01:55:20Z"
  },
  {
    "title": "Trump and Starmer Set to Seal Sweeping Nuclear Energy Deal",
    "description": "Britain and the United States are set to sign a sweeping agreement to accelerate nuclear power development during U.S. President Donald Trump’s state visit this week, marking what Keir Starmer described as the start of a “golden age of nuclear.” The accord, k…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-and-Starmer-Set-to-Seal-Sweeping-Nuclear-Energy-Deal.html",
    "timestamp": "2025-09-15T01:55:00Z"
  },
  {
    "title": "Gold prices steady near record high ahead of Fed rate decision",
    "description": "Gold prices are stable, close to record highs. Investors are watching the US Federal Reserve meeting. A rate cut is expected after weak labor reports. US-China trade talks concluded in Madrid. Trump is willing to sanction Russia. Silver, platinum show varied …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-steady-near-record-high-ahead-of-fed-rate-decision/articleshow/123889978.cms",
    "timestamp": "2025-09-15T01:54:02Z"
  },
  {
    "title": "'Horrific': Kari Lake blames 'indoctrination camps' for Charlie Kirk's assassination",
    "description": "Kari Lake, the Trump administration's senior advisor for the U.S. Agency for Global Media, claimed during conservative activist Charlie Kirk's memorial service at the Kennedy Center on Sunday that college \"indoctrination camps\" had radicalized Kirk's shooter.…",
    "link": "https://www.rawstory.com/kari-lake-2673993519/",
    "timestamp": "2025-09-15T01:48:53Z"
  },
  {
    "title": "Trump And King Charles: Heads Of State With Opposing Personalities",
    "description": "Donald Trump may adore Britain's royal family but the brash US leader could not be more different from King Charles III, a passionate environmentalist who is always strait-laced in public.",
    "link": "https://www.ibtimes.com/trump-king-charles-heads-state-opposing-personalities-3783343",
    "timestamp": "2025-09-15T01:48:16Z"
  },
  {
    "title": "Trump and King Charles: heads of state with opposing personalities",
    "description": "Donald Trump may adore Britain’s royal family but the brash US leader could not be more different from King Charles III, a passionate environmentalist who is always strait-laced in public. The monarch is 76 years old, the president 79. They are both wealthy, …",
    "link": "https://www.digitaljournal.com/world/trump-and-king-charles-heads-of-state-with-opposing-personalities/article",
    "timestamp": "2025-09-15T01:42:20Z"
  },
  {
    "title": "Far-Left New Republic Urges Democrats: Shun Empathy After Kirk Assassination — Be ‘Callous, Short of Cruel’",
    "description": "The far-left New Republic, in the immediate aftermath of Charlie Kirk’s assassination, declared that Democrats’ responses condemning the killing were “too tasteful for the moment,” warned that “empathy helps prop up Republicans and Trumpists as legitimate and…",
    "link": "https://www.breitbart.com/politics/2025/09/14/new-republic-urges-democrats-shun-empathy-kirk-assassination/",
    "timestamp": "2025-09-15T01:38:33Z"
  },
  {
    "title": "Zohran Mamdani lands key endorsement in New York City mayoral race",
    "description": "Governor Kathy Hochul backed frontrunner Zohran Mamdani for New York City mayor, who could become the first Muslim and millennial leader of the nation's largest city.",
    "link": "https://www.foxnews.com/politics/zohran-mamdani-lands-key-endorsement-new-york-city-mayoral-race",
    "timestamp": "2025-09-15T01:36:26Z"
  },
  {
    "title": "Stephen Colbert Addresses 'Late Show' Cancellation At The Emmys",
    "description": "After “The Late Show” was canceled, Trump said he was “absolutely” happy to see Colbert out of a job.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-job-emmys-late-show-cancellation_n_68c7604fe4b0ca1feefe48b8",
    "timestamp": "2025-09-15T01:35:34Z"
  },
  {
    "title": "Oil Holds Steady With Focus On Russian Trade, Looming Oversupply",
    "description": "Oil was little changed after advancing last week, as traders weighed moves to crack down on Russian flows against forecasts for a surplus later in the year. Brent traded near $67 a barrel, after adding 2.3% last week, while West Texas Intermediate was below $…",
    "link": "https://www.ndtvprofit.com/markets/crude-oil-prices-september-15-check-brent-wti-prices",
    "timestamp": "2025-09-15T01:32:10Z"
  },
  {
    "title": "Global Stocks Hold Near Record As Focus Turns To Fed Meet: Markets Wrap",
    "description": "Stocks hovered near record highs and the dollar steadied as a n ew week began, with investors focused on the Federal Reserve’s upcoming policy decision. The MSCI All Country World Index held steady in early trading after closing at a record Friday. MSCI’s Asi…",
    "link": "https://www.ndtvprofit.com/markets/global-stock-market-sept-15-check-s-and-p-500-nasdaq-nikkei-kospi-hang-seng",
    "timestamp": "2025-09-15T01:23:59Z"
  },
  {
    "title": "Trump heads for historic second UK state visit",
    "description": "Donald Trump will get the red carpet treatment this week on an unprecedented second UK state visit, as Britain counts on royal pomp and circumstance to woo the unpredictable US president. From a flyby and carriage ride with King Charles III to a grand state b…",
    "link": "https://www.digitaljournal.com/world/trump-heads-for-historic-second-uk-state-visit/article",
    "timestamp": "2025-09-15T01:22:20Z"
  },
  {
    "title": "Trump Heads For Historic Second UK State Visit",
    "description": "Donald Trump will get the red carpet treatment this week on an unprecedented second UK state visit, as Britain counts on royal pomp and circumstance to woo the unpredictable US president.",
    "link": "https://www.ibtimes.com/trump-heads-historic-second-uk-state-visit-3783337",
    "timestamp": "2025-09-15T01:21:18Z"
  },
  {
    "title": "Stephen Colbert Receives Standing Ovation at 2025 Emmys",
    "description": "With his Late Show set to end next March, the host seized the moment to jokingly pitch his staff to potential future employers.\nStephen Colbert Receives Standing Ovation at 2025 Emmys\nScoop Harrison",
    "link": "https://consequence.net/2025/09/stephen-colbert-standing-ovation-2025-emmys/",
    "timestamp": "2025-09-15T01:20:37Z"
  },
  {
    "title": "Trump urges foreign companies not to just invest in US but also train American workers",
    "description": "In a statement posted on Truth Social, Trump emphasised the need for the US to relearn advanced manufacturing skills, especially in industries like semiconductors, shipbuilding, and high-tech machinery, by learning directly from foreign companies that are mak…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-urges-foreign-companies-not-to-just-invest-in-us-but-also-train-american-workers/articleshow/123889789.cms",
    "timestamp": "2025-09-15T01:19:51Z"
  },
  {
    "title": "English Has Never Been America’s Official Language. Trump Wants To Change That. Is It Necessary?",
    "description": "Did you know the United States operates without an official language? President Trump wants to declare English the US's official language. But is it necessary?",
    "link": "https://www.forbes.com/sites/dougmelville/2025/09/14/english-has-never-been-americas-official-language-trump-wants-to-change-that-is-it-necessary/",
    "timestamp": "2025-09-15T01:17:44Z"
  },
  {
    "title": "The 'deep state' is proving to Trump it’s a worthy foe",
    "description": "President Donald Trump and his team are crowing about the downsizing of the federal bureaucracy, which is set to shrink by tens of thousands more on Sept. 30 when workers who took a DOGE buyout hang it up. But if Trump’s goal was to dismantle the workforce he…",
    "link": "https://freerepublic.com/focus/f-backroom/4340480/posts",
    "timestamp": "2025-09-15T01:14:50Z"
  },
  {
    "title": "Stop Treating Stephen Colbert Like a Hero",
    "description": "By\n Opheli Garcia Lawler\n Published: September 14th, 2025",
    "link": "https://www.cracked.com/article_48325_stop-treating-stephen-colbert-like-a-hero.html",
    "timestamp": "2025-09-15T01:10:00Z"
  },
  {
    "title": "FBI Director Kash Patel criticized for his actions and posts during Charlie Kirk shooting investigation",
    "description": "FBI Director Kash Patel’s activities during the investigation of Charlie Kirk’s killing raise questions about his decision-making, current and former officials said.",
    "link": "https://www.nbcnews.com/politics/justice-department/kash-patel-criticized-actions-posts-charlie-kirk-shooting-investigatio-rcna231043",
    "timestamp": "2025-09-15T01:07:25Z"
  },
  {
    "title": "Report: Charlie Kirk's Alleged Assassin Joked on Discord that a 'Doppelganger' Committed Murder",
    "description": "Evidence has emerged that Tyler Robinson, the alleged assassin of conservative activist Charlie Kirk, joked with friends on Discord that his \"doppelganger\" murdered Kirk.\nThe post Report: Charlie Kirk’s Alleged Assassin Joked on Discord that a ‘Doppelganger’ …",
    "link": "https://www.breitbart.com/politics/2025/09/14/charlie-kirk-alleged-assassin-joked-doppelganger-committed-murder/",
    "timestamp": "2025-09-15T01:05:01Z"
  },
  {
    "title": "Asian stocks cautious as markets anticipate potential rate cut from US Fed",
    "description": "Asian stocks began cautiously as markets anticipate potential rate cuts from the U.S. Federal Reserve and possibly the Bank of Canada this week. Investors are closely watching the Fed's future guidance amid economic concerns and President Trump's criticism. C…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asia-stocks-cautious-as-markets-anticipate-potential-rate-cut-from-us-fed/articleshow/123889700.cms",
    "timestamp": "2025-09-15T00:57:10Z"
  },
  {
    "title": "Hannah Einbinder’s Emmys acceptance speech bleeped as she slams ICE",
    "description": "‘Hacks’ star who won the Emmy for Outstanding Supporting Actress in a Comedy said ‘f*** ICE’ in her acceptance speech",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/hannah-einbinder-say-emmys-speech-ice-b2826438.html",
    "timestamp": "2025-09-15T00:56:42Z"
  },
  {
    "title": "Trump issues Russia sanctions ultimatum to EU",
    "description": "US President Donald Trump has warned that Washington will only escalate sanctions against Moscow if EU and NATO countries match US measures Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624657-trump-russia-sanctions-eu/",
    "timestamp": "2025-09-15T00:55:52Z"
  },
  {
    "title": "US, China end first day of talks in Spain on trade, TikTok deadline",
    "description": "U.S. and Chinese officials met in Madrid to discuss strained trade ties, TikTok's divestiture deadline, and U.S. demands for tariffs on countries buying Russian oil. Experts anticipate a TikTok deadline extension, with substantial breakthroughs unlikely witho…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-china-end-first-day-of-talks-in-spain-on-trade-tiktok-deadline/articleshow/123889679.cms",
    "timestamp": "2025-09-15T00:52:46Z"
  },
  {
    "title": "Oil holds gains as investors eye impact from attacks on Russian energy facilities",
    "description": "SINGAPORE (Reuters) -Oil prices were little changed on Monday as investors assessed the impact of Ukrainian drone attacks on Russian refineries that could...",
    "link": "https://finance.yahoo.com/news/oil-holds-gains-investors-eye-005217651.html",
    "timestamp": "2025-09-15T00:52:17Z"
  },
  {
    "title": "Oil Holds Steady With Focus on Russian Trade, Looming Oversupply",
    "description": "Oil was little changed after advancing last week, as traders weighed moves to crack down on Russian flows against forecasts for a surplus later in the year.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-steady-with-focus-on-russian-trade-looming-oversupply",
    "timestamp": "2025-09-15T00:48:53Z"
  },
  {
    "title": "Trump administration launches flying taxi program",
    "description": "A pilot program to establish electric flying taxis as a viable transportation option has been unveiled by the administration of President Donald Trump.\nThe Federal Aviation Administration announced Friday that it would administer the pilot program, officially…",
    "link": "https://biztoc.com/x/c8200001b5a96d52",
    "timestamp": "2025-09-15T00:47:54Z"
  },
  {
    "title": "Stephen Colbert Made Pointed Comments About the End of His Show at the 2025 Emmy Awards",
    "description": "Stephen Colbert made a reference to the end of his show at the 2025 Emmy Awards–read his speech here.",
    "link": "https://www.cosmopolitan.com/entertainment/celebs/a66065514/stephen-colbert-2025-emmys-speech/",
    "timestamp": "2025-09-15T00:41:00Z"
  },
  {
    "title": "Memphis Mayor ‘Not Happy’ About Trump National Guard Deployment",
    "description": "Trump announced Friday that he plans to send troops to the Tennessee city next.",
    "link": "https://www.huffpost.com/entry/memphis-mayor-paul-young-trump-national-guard_n_68c7438ae4b0f43001e0c55b",
    "timestamp": "2025-09-15T00:39:08Z"
  },
  {
    "title": "Stephen Colbert Asks ‘Is Anyone Hiring?’ After Receiving Standing Ovation at 2025 Emmys",
    "description": "Stephen Colbert opened the 2025 Emmys to a standing ovation, joking about The Late Show ending and offering his resume to Harrison Ford.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/stephen-colbert-asks-anyone-hiring-2025-emmy-awards-1235427143/",
    "timestamp": "2025-09-15T00:35:38Z"
  },
  {
    "title": "Quite a flutter over stablecoins",
    "description": "The practice of the state’s monopoly over note issuance is just 175 years old. It’s neither been complete nor unchallenged",
    "link": "https://www.thehindubusinessline.com/opinion/quite-a-flutter-over-stablecoins/article70049991.ece",
    "timestamp": "2025-09-15T00:35:00Z"
  },
  {
    "title": "Karoline Leavitt, Robert F. Kennedy Jr. Remember Charlie Kirk As a ‘Beaming Light’ In a Dark World at Vigil",
    "description": "Trump Press Secretary Karoline Leavitt remembered Charlie Kirk as a \"beaming light\" who will inspire her each time she steps to the podium during a Sunday vigil\nThe post Karoline Leavitt, Robert F. Kennedy Jr. Remember Charlie Kirk As a ‘Beaming Light’ In a D…",
    "link": "https://www.mediaite.com/media/karoline-leavitt-robert-f-kennedy-jr-remember-charlie-kirk-as-a-beaming-light-in-a-dark-world-at-vigil/",
    "timestamp": "2025-09-15T00:34:41Z"
  },
  {
    "title": "Stephen Colbert Brings Résumé to Emmy Awards Amid CBS Firing",
    "description": "Stephen Colbert's showing it's never too early to start job hunting ... bringing his résumé to the Emmys to network since he's getting laid off next year. The late-night talk show host took the stage to present the first award for Outstanding…\n Permalink",
    "link": "https://www.tmz.com/2025/09/14/stephen-colbert-brings-resume-emmy-awards-amid-cbs-firing/",
    "timestamp": "2025-09-15T00:31:12Z"
  },
  {
    "title": "War for Ukraine Day 1,298: Putin’s Polish Gambit",
    "description": "I wanted to bring my comment reply on what I think Putin is trying to accomplish with his drone overflights of Poland and now Romania too. I think Russia’s strategy in overflying or attacking Poland and Romania, which I expect will be expanded to the Baltics,…",
    "link": "https://balloon-juice.com/2025/09/14/war-for-ukraine-day-1298-putins-polish-gambit/",
    "timestamp": "2025-09-15T00:28:42Z"
  },
  {
    "title": "Kathy Hochul endorses Zohran Mamdani for NYC mayor in surprise op-ed",
    "description": "New York Gov. Kathy Hochul says she's endorsing Zohran Mamdani for mayor.\n \n\nThe governor called Mamdani a “fearless” ally in confronting Trump and said they’re united by a shared focus on affordability. [ more › ]",
    "link": "https://gothamist.com/news/kathy-hochul-endorses-zohran-mamdani-for-nyc-mayor-in-surprise-op-ed",
    "timestamp": "2025-09-15T00:18:00Z"
  },
  {
    "title": "After Kirk's killing a growing chorus of conservatives wants his critics ostracized or fired",
    "description": "Some conservatives are targeting people and organizations they believe disparaged Charlie Kirk after his death",
    "link": "https://abcnews.go.com/Politics/wireStory/after-kirks-killing-growing-chorus-conservatives-critics-ostracized-125558942",
    "timestamp": "2025-09-15T00:14:29Z"
  },
  {
    "title": "Utah governor says Kirk shooting motive not yet certain, suspect uncooperative",
    "description": "Still, he said suspect Tyler Robinson, 22, disliked the conservative influencer and \"There was clearly a leftist ideology.\"",
    "link": "https://richmond.com/news/nation-world/government-politics/article_e37a0de7-c7fc-561e-abd0-b9de2e856245.html",
    "timestamp": "2025-09-15T00:10:00Z"
  },
  {
    "title": "NATO military campaign will protect Poland's Eastern front",
    "description": "Washington DC (UPI) Sep 13, 2025 \n\n\n The North Atlantic Treaty Organization, NATO is launching a new military campaign in Poland following an incursion by Russian drones in Polish airspace earlier in the week, the military alliance confirmed in a statement. \n…",
    "link": "https://www.spacewar.com/reports/NATO_military_campaign_will_protect_Polands_Eastern_front_999.html",
    "timestamp": "2025-09-15T00:09:18Z"
  },
  {
    "title": "Eurasia’s Shifting Strategic Paradigm",
    "description": "In a region historically shaped by the push and pull of rival powers, Central Asian countries have sought to maintain geopolitical balance by cultivating strategic alliances with multiple global players. But Russia’s war against Ukraine and Donald Trump’s ret…",
    "link": "https://www.project-syndicate.org/magazine/central-asian-countries-geopolitical-balancing-act-by-nargis-kassenova-2025-09",
    "timestamp": "2025-09-15T00:05:00Z"
  },
  {
    "title": "Latin America’s Big, Green Opportunity",
    "description": "Although the United States has abandoned climate leadership, the rest of the world is staying the course, and that gives Latin America a major strategic opportunity. The region has all the ingredients to become the low-carbon juggernaut that the world needs.",
    "link": "https://www.project-syndicate.org/magazine/latin-america-green-industrialization-best-and-only-path-by-laura-carvalho-2025-09",
    "timestamp": "2025-09-15T00:05:00Z"
  },
  {
    "title": "Britain and US to sign nuclear power pact during Trump's visit",
    "description": "LONDON (Reuters) -Britain and the United States will sign a deal to work together on boosting nuclear power during U.S. President Donald Trump's state visit ...",
    "link": "https://www.yahoo.com/news/articles/britain-us-sign-nuclear-power-000423840.html",
    "timestamp": "2025-09-15T00:04:23Z"
  },
  {
    "title": "Trump responds to question about revoking visas of Kirk death celebrants: 'Sick people'",
    "description": "President Donald Trump told reporters on Sunday evening that he was \"looking at names\" when asked if he'd revoke the visas of foreigners living in America who have celebrated Charlie Kirk's death. \"We haven't [starting revoking visas], but we are looking at n…",
    "link": "https://freerepublic.com/focus/f-chat/4340465/posts",
    "timestamp": "2025-09-15T00:00:54Z"
  },
  {
    "title": "ALL MAGA FAMILY",
    "description": "Tyler Robinson’s grandmother is speaking out in defense of her grandson, who is accused of killing Charlie Kirk on Wednesday at Utah Valley University in Orem",
    "link": "https://www.the-independent.com/news/world/americas/crime/tyler-robinson-family-republican-b2825943.html",
    "timestamp": "2025-09-15T00:00:03Z"
  },
  {
    "title": "Mexico's first female president completes first year with high approval, but challenges loom...",
    "description": "Mexican President Claudia Sheinbaum has maintained remarkably high marks despite a spate of domestic and international challenges, the biggest among them...",
    "link": "https://www.yahoo.com/news/articles/mexicos-first-female-president-completes-100000706.html",
    "timestamp": "2025-09-15T00:00:03Z"
  },
  {
    "title": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key vote",
    "description": "Trump administration renews push to fire Fed governor Lisa Cook ahead of key votelocal10.com",
    "link": "https://www.local10.com//business/2025/09/14/trump-administration-renews-push-to-fire-fed-governor-lisa-cook-ahead-of-key-vote/",
    "timestamp": "2025-09-14T23:59:27Z"
  },
  {
    "title": "Trump Expected to Extend TikTok Divestment Deadline Again: Report",
    "description": "The administration would grant ByteDance its fourth reprieve since January as the app remains entangled in broader U.S.-China negotiations.",
    "link": "https://www.newsweek.com/trump-expected-extend-tiktok-divestment-deadline-again-2129751",
    "timestamp": "2025-09-14T23:58:25Z"
  },
  {
    "title": "Charlie Kirk Vigil at Kennedy Center: Mourning, Hope -- and Joy",
    "description": "WASHINGTON, DC — “Charlie Kirk gave his life defending our civili liberties to engage in free and open debate.” So declared State Senator Jake Hoffman of Arizona, a friend of Kirk’s, on opening the vigil for slain youth leader Charlie Kirk\nThe post Charlie Ki…",
    "link": "https://www.breitbart.com/politics/2025/09/14/charlie-kirk-vigil-at-kennedy-center-mourning-hope-and-joy/",
    "timestamp": "2025-09-14T23:56:52Z"
  },
  {
    "title": "Ike Barinholtz Won’t Meet Elon Musk Before Playing Him in ‘Artificial’ Biopic: ‘If He Puts Me in a Gulag, I Hope My Friends Are There’",
    "description": "As Ike Barinholtz prepares to portray Elon Musk in the upcoming feature “Artificial,” he said he doesn’t plan on reaching out to the billionaire and former Donald Trump ally for preparation. “I’m OK,” Barinholtz told Variety’s Marc Malkin on the Emmys red car…",
    "link": "https://variety.com/2025/tv/awards/ike-barinholtz-elon-musk-artificial-1236518447/",
    "timestamp": "2025-09-14T23:53:35Z"
  },
  {
    "title": "Trump blasts ‘the left’ and announces ‘major investigations’ underway after Charlie Kirk assassination",
    "description": "President Trump lambasted “the left\" for stewing hatred that fed into Charlie Kirk's assassination Sunday while adding that \"major investigations\" into groups of interest are already underway as part of the murder probe.",
    "link": "https://nypost.com/2025/09/14/us-news/trump-blasts-the-left-and-announces-major-investigations-underway-after-charlie-kirk-assassination/",
    "timestamp": "2025-09-14T23:51:33Z"
  },
  {
    "title": "Did Donald Trump curse the Yankees? How U.S President's handshake might have exacerbated Aaron Judge's elbow injury",
    "description": "The New York Yankees are regaining momentum this season, accumulating wins and re-establishing themselves as a competitive force. However, injuries to key players continue to raise",
    "link": "https://www.marca.com/en/mlb/new-york-yankees/2025/09/15/68c7516eca4741b84b8b457c.html",
    "timestamp": "2025-09-14T23:49:24Z"
  },
  {
    "title": "Dollar Steady as Traders Turn Focus to Fed Meeting: Markets Wrap",
    "description": "The dollar was steady in early Asian trading as US-China trade talks entered a second day, with investors focused on this week’s Federal Reserve policy decision.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-steady-as-traders-turn-focus-to-fed-meeting-markets-wrap",
    "timestamp": "2025-09-14T23:47:38Z"
  },
  {
    "title": "Rep. McCaul will retire, but GOP hawk worries about World War III after Russian escalation",
    "description": "Republican Rep. Michael McCaul of Texas is worried that Russia's escalation of its invasion of Ukraine could lead to World War III",
    "link": "https://abcnews.go.com/Politics/wireStory/rep-mccaul-retire-gop-hawk-worries-world-war-125559292",
    "timestamp": "2025-09-14T23:42:27Z"
  },
  {
    "title": "U.S. and Britain to announce tech, nuclear energy deals during Trump visit",
    "description": "The United States and Britain will announce agreements on technology and civil nuclear energy during U.S. President Donald Trump’s unprecedented second state visit this week, as the U.K. hopes to finalize steel tariffs under a much-vaunted trade deal. \nTrump …",
    "link": "https://biztoc.com/x/7c306f67355d4ab0",
    "timestamp": "2025-09-14T23:40:04Z"
  },
  {
    "title": "Kristi Noem: 'Last Thing Charlie Texted Me' Was Attacking 'Dangerous' Dem Mayors",
    "description": "Department of Homeland Security Secretary Kristi Noem revealed that MAGA influencer Charlie Kirk demanded that \"dangerous\" Democratic mayors and governors needed to be \"held accountable\" in his final communications with her before he died.\n\n\nWhile speaking to…",
    "link": "https://crooksandliars.com/2025/09/kristi-noem-last-thing-charlie-texted-me",
    "timestamp": "2025-09-14T23:38:53Z"
  },
  {
    "title": "US farmers are being squeezed - and it's testing their deep loyalty to Trump",
    "description": "Why so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy",
    "link": "https://www.bbc.com/news/articles/cjedvwed1xgo",
    "timestamp": "2025-09-14T23:36:44Z"
  },
  {
    "title": "Trump Declares He’s ‘Already Investigating’ People On The Left Who Share Blame for Charlie Kirk’s Murder",
    "description": "President Donald Trump said a lot of radical leftists and Democratic supporters are \"already under major investigation\" after the shooting of Charlie Kirk\nThe post Trump Declares He’s ‘Already Investigating’ People On The Left Who Share Blame for Charlie Kirk…",
    "link": "https://www.mediaite.com/media/news/trump-declares-hes-already-investigating-people-on-the-left-who-share-blame-for-charlie-kirks-murder/",
    "timestamp": "2025-09-14T23:36:38Z"
  },
  {
    "title": "The man, the policies: What makes Modi special",
    "description": "As Narendra Modi celebrates his 75th birthday, his leadership is marked by transformative policies like cleanliness campaigns and economic reforms. He maintains a unique position in Indian politics, balancing national security and international relations amid…",
    "link": "https://www.livemint.com/opinion/columns/the-man-the-policies-what-makes-modi-special-11757873467871.html",
    "timestamp": "2025-09-14T23:30:19Z"
  },
  {
    "title": "After his ICE agents arrested hundreds of South Korean workers, Trump says he doesn’t want to ‘frighten off’ foreign investment in the U.S",
    "description": "President Donald Trump on Sunday said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platf…",
    "link": "https://biztoc.com/x/b574393be1c7ff22",
    "timestamp": "2025-09-14T23:28:47Z"
  },
  {
    "title": "Trump Vents ‘Unfathomable’ Hatred Between Putin and Zelensky Is Blocking Ukraine Peace Talks",
    "description": "President Donald Trump vented the \"unfathomable\" hatred between Vladimir Putin and Volodymyr Zelensky has blocked a peace deal in the Russia-Ukraine War\nThe post Trump Vents ‘Unfathomable’ Hatred Between Putin and Zelensky Is Blocking Ukraine Peace Talks firs…",
    "link": "https://www.mediaite.com/media/news/trump-vents-unfathomable-hatred-between-putin-and-zelensky-blocks-ukraine-peace-talks/",
    "timestamp": "2025-09-14T23:23:13Z"
  },
  {
    "title": "Charlie Kirk's allies warn Americans to mourn him right or face consequences",
    "description": "Social media users celebrating the conservative influencer’s death are facing real-world consequences.",
    "link": "https://7news.com.au/news/charlie-kirks-allies-warn-americans-to-mourn-him-right-or-face-consequences-c-20012451",
    "timestamp": "2025-09-14T23:19:06Z"
  },
  {
    "title": "미국이 통일성과 균일함보다 우선시하는 다양성",
    "description": "The Kirishi oil refinery in the Leningrad region was attacked by Ukrainian drones overnight as Kyiv keeps up the pressure on Russian energy and industrial facilities https://t.co/fxS2rt8VS6— Bloomberg (@business) September 14, 2025 WSJ 칼럼에서 피렌체 메디치 가문이 '돈 경시'…",
    "link": "https://ryueyes11.tistory.com/511866",
    "timestamp": "2025-09-14T23:17:26Z"
  },
  {
    "title": "US-UK Nuclear Pact to Precede Tech, Whisky Deals on Trump Visit",
    "description": "The US and Britain will sign an agreement to make it quicker for companies in both countries to build nuclear power stations when President Donald Trump visits this week, according to the UK government.",
    "link": "https://financialpost.com/pmn/business-pmn/us-uk-nuclear-pact-to-precede-tech-whisky-deals-on-trump-visit",
    "timestamp": "2025-09-14T23:17:04Z"
  },
  {
    "title": "Emmys arrive with ‘The Studio’ and ‘Severance’ vying for top honors",
    "description": "Apple TV+ is poised to have a breakout year with the two most nominated shows.",
    "link": "https://www.bostonherald.com/2025/09/14/emmy-awards-2025/",
    "timestamp": "2025-09-14T23:16:33Z"
  },
  {
    "title": "Emmys arrive with ‘The Studio’ and ‘Severance’ vying for top honors",
    "description": "Apple TV+ is poised to have a breakout year with the two most nominated shows.",
    "link": "https://www.denverpost.com/2025/09/14/emmy-awards-2025/",
    "timestamp": "2025-09-14T23:16:33Z"
  },
  {
    "title": "Trump: Qatar is a great ally, Israel needs to be careful",
    "description": "US President Trump describes Qatar as a \"great ally\" and urges Israel to \"be careful\" following its strike in Doha targeting Hamas leaders.",
    "link": "https://www.israelnationalnews.com/news/414935",
    "timestamp": "2025-09-14T23:13:17Z"
  },
  {
    "title": "Trump Puts Democrat Senator in His Place for Rejecting God-Given Rights",
    "description": "Trump made very clear that Kaine had missed the mark by rejecting the truth that our rights come from God rather than government.",
    "link": "https://www.westernjournal.com/trump-puts-democrat-senator-place-rejecting-god-given-rights/",
    "timestamp": "2025-09-14T23:12:45Z"
  },
  {
    "title": "'Really hit me hard': Supporters remember Charlie Kirk at Kennedy Center prayer vigil",
    "description": "Christine Carmody, 65, came to Charlie Kirk’s vigil from her home in Maryland to pay her “respects” to a “wonderful, wonderful man.”",
    "link": "https://www.usatoday.com/story/news/nation/2025/09/14/charlie-kirk-kennedy-center-vigil/86156026007/",
    "timestamp": "2025-09-14T23:12:31Z"
  },
  {
    "title": "After his ICE agents arrested hundreds of South Korean workers, Trump says he doesn’t want to ‘frighten off’ foreign investment in the U.S.",
    "description": "South Korean President Lee Jae Myung called the raid \"bewildering\" and warned Thursday that the raid could discourage future investment.",
    "link": "https://fortune.com/2025/09/14/ice-raid-georgia-hyundai-lg-south-korean-workers-foreign-investment/",
    "timestamp": "2025-09-14T23:10:25Z"
  },
  {
    "title": "Wayne Gretzky’s controversial silence on Trump’s scandals raises questions about loyalty versus moral responsibility",
    "description": "Wayne Gretzky, celebrated hockey legend, faces scrutiny for his silence amidst the controversies surrounding Donald Trump. Their longstanding friendship raises questions about whether personal loyalty outweighs public responsibility. Critics argue that Gretzk…",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/wayne-gretzkys-controversial-silence-on-trumps-scandals-raises-questions-about-loyalty-versus-moral-responsibility/articleshow/123881715.cms",
    "timestamp": "2025-09-14T23:09:42Z"
  },
  {
    "title": "Caracas accuses US of raiding fishing boat in Venezuelan waters",
    "description": "Caracas on Saturday accused the US of raiding a Venezuelan fishing boat while in Venezuelan waters, underscoring the rising tensions in the region.\nThe allegation comes days after President Donald Trump said US forces struck a vessel carrying drug cartel memb…",
    "link": "https://biztoc.com/x/4d9da5a603641d73",
    "timestamp": "2025-09-14T23:06:52Z"
  },
  {
    "title": "UK and US to announce tech, energy deals during Trump visit",
    "description": "LONDON (Reuters) -The United States and Britain will announce agreements on technology and civil nuclear energy during U.S. President Donald Trump's...",
    "link": "https://www.yahoo.com/news/articles/uk-us-announce-tech-energy-230604172.html",
    "timestamp": "2025-09-14T23:06:04Z"
  },
  {
    "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
    "description": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building p…",
    "link": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
    "timestamp": "2025-09-14T23:01:00Z"
  },
  {
    "title": "What's on? Top 10 TV and streaming tips for Monday",
    "description": "We're back in Slane Castle for more murder and mayhem in The Traitors Ireland, there's a documentary about 60s' icon Twiggy, Molly Parker stars in medical drama Doc, while Blathnaid Ni Chofaigh meets President Higgins . . .",
    "link": "https://www.rte.ie/entertainment/2025/0915/1533100-whats-on-top-10-tv-and-streaming-tips-for-monday/",
    "timestamp": "2025-09-14T23:00:00Z"
  },
  {
    "title": "Thousands of film workers signed letter boycotting Israeli film companies, not Jewish people",
    "description": "One pro-Israel account on social media, exaggerating the scope of the boycott, claimed stars \"signed a pledge vowing not to work\" with Jewish people.",
    "link": "https://www.snopes.com//fact-check/hollywood-israeli-film-boycott/",
    "timestamp": "2025-09-14T23:00:00Z"
  },
  {
    "title": "Trump: EU has to 'toughen up' Russia sanctions",
    "description": "United States President Donald Trump told reporters that the European Union needs to \"toughen up\" its sanctions on Russia.\"Europe is, they're my friends, but they're buying oil from Russia,\" Trump tol...",
    "link": "https://biztoc.com/x/3216b54aca8a9968",
    "timestamp": "2025-09-14T22:55:15Z"
  },
  {
    "title": "The 77th Primetime Emmy Awards Live: Will Severance scoop White Lotus?",
    "description": "All the action from the 77th Primetime Emmy Awards.",
    "link": "https://www.nzherald.co.nz/entertainment/the-77th-primetime-emmy-awards-live-will-severance-scoop-white-lotus/SNNER7BUU5A5XGS7QQI2FWNINE/",
    "timestamp": "2025-09-14T22:55:00Z"
  },
  {
    "title": "'It's a different America': Ex-Ambassador says future Dems could adopt Trumpian 'mood'",
    "description": "A former U.K. ambassador to the U.S. said on Sunday that Democrats could adopt some aspects of Trumpism after President Donald Trump leaves office. Peter Westmacott, who was the U.K. ambassador to the U.S. from 2012 to 2016, discussed how Trump and his \"Ameri…",
    "link": "https://www.rawstory.com/democrats-2673993362/",
    "timestamp": "2025-09-14T22:37:41Z"
  },
  {
    "title": "Will There Be a Joe Biden Presidential Library? One Dem Donor Says No, 'Unless It's a Book-Mobile'",
    "description": "Most presidents, when they leave office, ultimately have a presidential library. It's a place to document their time in office with personal papers, records, artifacts, and often video footage and other exhibits. Currently, we are watching the presidential li…",
    "link": "https://freerepublic.com/focus/f-chat/4340453/posts",
    "timestamp": "2025-09-14T22:37:32Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.wcvb.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:35:22Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.ketv.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:35:18Z"
  },
  {
    "title": "The Federal Reserve is about to have an extremely awkward meeting",
    "description": "While there is little doubt about the outcome of the Fed meeting, there are still questions over who exactly will be voting.",
    "link": "https://fortune.com/2025/09/14/fed-meeting-preview-fomc-stephen-miran-lisa-cook-jerome-powell-trump/",
    "timestamp": "2025-09-14T22:33:09Z"
  },
  {
    "title": "Is there any prospect of ending Russia’s war in Ukraine?",
    "description": "Can Trump fulfil his promise of ending the war, or is the conflict proving more complex than expected?",
    "link": "https://www.aljazeera.com/video/inside-story/2025/9/14/is-there-any-prospect-of-ending-russias-war-in-ukraine",
    "timestamp": "2025-09-14T22:33:03Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.wmtw.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:30:15Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.wgal.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:28:37Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.kcra.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:28:36Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.wlky.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:28:36Z"
  },
  {
    "title": "Doxxing website aims to get people fired for posting about Charlie Kirk's murder",
    "description": "Some of the people whose posts have been highlighted say they’re now receiving a barrage of harassment and are worried about becoming the victims of violence.",
    "link": "https://www.wmur.com/article/people-are-getting-fired-for-allegedly-celebrating-charlie-kirks-murder-looks-like-a-coordinated-effort/66092049",
    "timestamp": "2025-09-14T22:28:30Z"
  }
]