[
  {
    "title": "Zelensky calls for Putin talks as peace efforts stall",
    "description": "Amidst ongoing conflict, Ukrainian President Zelensky advocates for direct talks with Putin as the most effective path forward, even as Russia dismisses immediate meetings. Ukraine celebrates Independence Day, marked by prisoner exchanges and claims of recapt…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-calls-for-putin-talks-as-peace-efforts-stall/articleshow/123491671.cms",
    "timestamp": "2025-08-25T01:19:04Z"
  },
  {
    "title": "Trump administration planning to send National Guard to Chicago amid crime crackdown",
    "description": "The Trump administration is reportedly planning to deploy the National Guard to Chicago as part of an anti-crime and immigration crackdown, though the exact number of troops and timeline remain unclear. Chicago's Mayor Brandon Johnson has condemned the potent…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-planning-to-send-national-guard-to-chicago-amid-crime-crackdown/articleshow/123491628.cms",
    "timestamp": "2025-08-25T01:15:17Z"
  },
  {
    "title": "Texas factory gives Chinese copper firm an edge in tariff war",
    "description": "GANZHOU, China (Reuters) -Chinese copper flat wire manufacturer Wellascent's decision early last year to build a factory in Texas was a hedge against...",
    "link": "https://ca.finance.yahoo.com/news/texas-factory-gives-chinese-copper-011021933.html",
    "timestamp": "2025-08-25T01:10:21Z"
  },
  {
    "title": "Oil Holds Advance As Traders Focus On Supplies And Fed Fallout",
    "description": "Oil steadied after a weekly gain as traders tracked tensions over supplies, as well as the wider mood for risk assets after the Federal Reserve signaled a return to interest-rate cuts.",
    "link": "https://www.ndtvprofit.com/markets/global-oil-prices-august-25-check-brent-wti-prices",
    "timestamp": "2025-08-25T01:10:04Z"
  },
  {
    "title": "National Guard troops begin carrying weapons in Washington",
    "description": "In Washington, the National Guard started carrying weapons. This is part of a crime crackdown. President Donald Trump deployed over 2,200 troops. The troops are authorized to use force as a last resort. Republican politicians claim the capital is mismanaged. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/national-guard-troops-begin-carrying-weapons-in-washington/articleshow/123491539.cms",
    "timestamp": "2025-08-25T01:04:28Z"
  },
  {
    "title": "South Korea's Lee faces pivotal test at first summit with Trump",
    "description": "WASHINGTON/SEOUL (Reuters) -South Korea's new president, Lee Jae Myung, will face a pivotal moment on Monday when he meets U.S. President Donald Trump in...",
    "link": "https://www.yahoo.com/news/articles/south-koreas-lee-faces-pivotal-010318726.html",
    "timestamp": "2025-08-25T01:03:18Z"
  },
  {
    "title": "Ukraine, NATO, & Europe Will NEVER Accept Peace with Russia – You Will See",
    "description": "I have to admit that what I have seen from the Western Press is nothing but absurd propaganda and complete ignorance of the concept of strategy. They love to say Trump failed after previously pushing for a ceasefire and threatening severe consequences for Rus…",
    "link": "https://www.activistpost.com/ukraine-nato-europe-will-never-accept-peace-with-russia-you-will-see-2/",
    "timestamp": "2025-08-25T01:00:00Z"
  },
  {
    "title": "Trump threatens Chris Christie after ABC News interview: 'For the sake of justice'",
    "description": "President Donald Trump threatened one of his former associates on Sunday after he saw an interview they did with ABC News earlier in the day. Chris Christie, who advised Trump during his first term, joined the ABC News show \"This Week\" on Sunday to discuss re…",
    "link": "https://www.rawstory.com/for-the-sake-of-justice-trump-threatens-chris-christie-after-abc-news-interview/",
    "timestamp": "2025-08-25T00:56:54Z"
  },
  {
    "title": "France Summons U.S. Envoy After Rebuke of Macron: ‘Palestinian State Push Rewards Hamas, Endangers Jews’",
    "description": "France summoned U.S. Ambassador Charles Kushner on Sunday after he published a scathing open letter in the Wall Street Journal to President Emmanuel Macron, accusing the French government of failing to adequately combat rising antisemitism and warning that \"p…",
    "link": "https://www.breitbart.com/politics/2025/08/24/france-summons-u-s-envoy-rebuke-macron-palestinian-state-push-rewards-hamas-endangers-jews/",
    "timestamp": "2025-08-25T00:53:30Z"
  },
  {
    "title": "Trump expands cities targeted for possible military deployment to Baltimore in a spat with governor (Associated Press)",
    "description": "Associated Press:\nTrump expands cities targeted for possible military deployment to Baltimore in a spat with governor  —  Some National Guard units patrolling the nation's capital at the direction of President Donald Trump have started carrying firearms, an e…",
    "link": "https://www.memeorandum.com/250824/p47",
    "timestamp": "2025-08-25T00:50:01Z"
  },
  {
    "title": "Trump expands cities targeted for possible military deployment to Baltimore in a spat with governor",
    "description": "Donald Trump considers deploying troops to cities led by Democrats. This follows deployments in Washington D.C. Maryland's Governor, Wes Moore, invited Trump to discuss public safety. Trump mentioned Chicago and New York as possible targets. Leaders in those …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-expands-cities-targeted-for-possible-military-deployment-to-baltimore-in-a-spat-with-governor/articleshow/123491416.cms",
    "timestamp": "2025-08-25T00:49:00Z"
  },
  {
    "title": "Asian shares bounce as markets count on US rate cuts",
    "description": "Asian markets surged, buoyed by expectations of U.S. rate cuts and anticipation surrounding Nvidia's earnings report. Investors are optimistic about potential economic benefits from easing monetary policy, while closely monitoring upcoming U.S. inflation data…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-bounce-as-markets-count-on-us-rate-cuts/articleshow/123491385.cms",
    "timestamp": "2025-08-25T00:45:13Z"
  },
  {
    "title": "Judicial implications of ‘emergency’ tariff powers",
    "description": "The tariffs didn’t stop drugs, but they disrupted supply chains and turned US into an unpredictable trade partner",
    "link": "https://www.thehindubusinessline.com/opinion/judicial-implications-of-emergency-tariff-powers/article69972469.ece",
    "timestamp": "2025-08-25T00:45:00Z"
  },
  {
    "title": "Pentagon Says Some Guard Units In Washington Are Now Carrying Firearms As Trump Targets More Cities",
    "description": "Some National Guard units patrolling the nation’s capital at the direction of President Donald Trump have started carrying firearms.",
    "link": "https://www.huffpost.com/entry/pentagon-national-guard-firearms_n_68abb121e4b0f98d2d957229",
    "timestamp": "2025-08-25T00:42:21Z"
  },
  {
    "title": "If Americans can’t rely on Trump to protect them, how can we?",
    "description": "Donald Trump is now downgrading America's intelligence capability. For countries dependent on that capability like Australia, it's another sign we're on the wrong end of a bad deal.\nThe post If Americans can’t rely on Trump to protect them, how can we? appear…",
    "link": "http://www.crikey.com.au/2025/08/25/australia-defence-security-america-donald-trump-firing-defense-intelligence-agency/",
    "timestamp": "2025-08-25T00:42:19Z"
  },
  {
    "title": "France summons US Ambassador Kushner over 'unacceptable' letter about rising antisemitism",
    "description": "France summoned the U.S. ambassador, Charles Kushner, after he alleged insufficient action against antisemitism in a letter to President Macron. The French foreign ministry deemed Kushner's allegations \"unacceptable\" and a violation of international law. This…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/france-summons-us-ambassador-kushner-over-unacceptable-letter-about-rising-antisemitism/articleshow/123491359.cms",
    "timestamp": "2025-08-25T00:42:14Z"
  },
  {
    "title": "Dollar struggles to recover from dovish Powell gut punch",
    "description": "TOKYO (Reuters) -The U.S. dollar attempted on Monday to pull itself up from a four-week low on the euro after a dovish pivot from Federal Reserve Chair...",
    "link": "https://finance.yahoo.com/news/dollar-struggles-recover-dovish-powell-004117511.html",
    "timestamp": "2025-08-25T00:41:17Z"
  },
  {
    "title": "Dollar struggles to recover from dovish Powell gut punch",
    "description": "TOKYO :The U.S. dollar attempted on Monday to pull itself up from a four-week low on the euro after a dovish pivot from Federal Reserve Chair Jerome Powell sent it tumbling more than 1 per cent.The greenback added 0.2 per cent to $1.1699 per euro early in the…",
    "link": "https://www.channelnewsasia.com/business/dollar-struggles-recover-dovish-powell-gut-punch-5311966",
    "timestamp": "2025-08-25T00:41:17Z"
  },
  {
    "title": "Dollar struggles to recover from Powell's dovish surprise",
    "description": "TOKYO :The U.S. dollar attempted on Monday to pull itself up from a four-week low on the euro after a dovish pivot from Federal Reserve Chair Jerome Powell sent it tumbling more than 1 per cent.The U.S currency added 0.1 per cent to $1.1705 per euro, but rema…",
    "link": "https://www.channelnewsasia.com/business/dollar-struggles-recover-powells-dovish-surprise-5311966",
    "timestamp": "2025-08-25T00:41:17Z"
  },
  {
    "title": "Asia shares bounce as markets count on US rate cuts",
    "description": "SYDNEY (Reuters) -Asian share markets rallied on Monday as investors celebrated the likely resumption of interest rate cuts in the United States, while...",
    "link": "https://finance.yahoo.com/news/asia-shares-bounce-markets-count-003803820.html",
    "timestamp": "2025-08-25T00:38:03Z"
  },
  {
    "title": "EM assets to pull ahead of developed peers amid Fed easing",
    "description": "Fund managers predict emerging-market assets will outperform developed-market peers due to anticipated Federal Reserve policy easing, a shift away from US investments, and prudent fiscal policies in emerging nations. Favorable inflation and attractive valuati…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/em-assets-to-pull-ahead-of-developed-peers/articleshow/123491299.cms",
    "timestamp": "2025-08-25T00:36:15Z"
  },
  {
    "title": "Expect Putin to pay big-time for trolling Trump",
    "description": "We expect Russia’s Vladimir Putin and his top minions to soon regret their decision to make a fool of President Donald Trump.",
    "link": "https://nypost.com/2025/08/24/opinion/expect-putin-to-pay-big-time-for-trolling-trump/",
    "timestamp": "2025-08-25T00:33:25Z"
  },
  {
    "title": "The 11th Circuit Revives a Constitutional Challenge to the Federal Law That Disarms Medical Marijuana Patients",
    "description": "The appeals court concluded that the government had failed to show that policy is consistent with \"this Nation's historical tradition of firearm regulation.\"",
    "link": "https://reason.com/2025/08/25/the-11th-circuit-revives-a-constitutional-challenge-to-the-federal-law-that-disarms-medical-marijuana-patients/",
    "timestamp": "2025-08-25T00:32:03Z"
  },
  {
    "title": "Zelenskyy calls for Putin talks as peace efforts stall",
    "description": "After a push by U.S. President Donald Trump to broker a Ukraine-Russia summit, hopes for peace dimmed when Russia on Friday ruled out any immediate Putin-Zelenskyy meeting.",
    "link": "https://www.japantimes.co.jp/news/2025/08/25/world/politics/zelenskyy-putin-talks-peace/",
    "timestamp": "2025-08-25T00:31:00Z"
  },
  {
    "title": "Below the Line",
    "description": "Below the Line",
    "link": "https://www.thehindubusinessline.com/opinion/below-the-line/article69972425.ece",
    "timestamp": "2025-08-25T00:30:00Z"
  },
  {
    "title": "Trump clashes with Democrats as he expands National Guard plans",
    "description": "Trump this month deployed the National Guard to the streets of Washington in a widely criticized show of force.",
    "link": "https://www.japantimes.co.jp/news/2025/08/25/world/politics/trump-democrats-national-guard/",
    "timestamp": "2025-08-25T00:30:00Z"
  },
  {
    "title": "Foot Drag, Bruises on LEFT Hand: Questions Explode Over Trump Health",
    "description": "Whether the questions are legitimately founded or not, there is no question that Xitter is now bursting with fresh evidence possibly indicating diminishing Trump health. As always, a couple of caveats up top are necessary.",
    "link": "https://politizoom.com/foot-drag-bruises-on-left-hand-questions-explode-over-trump-health/",
    "timestamp": "2025-08-25T00:23:41Z"
  },
  {
    "title": "US cuts to science could mean Australian research, and lives, put at risk",
    "description": "Academics say cuts to US-based scientific agencies could make predicting emergency weather in Australia more difficult, with other critical research projects also at risk.",
    "link": "https://www.abc.net.au/news/2025-08-25/australian-academics-us-funding-cuts-will-hurt-local-research/105684772",
    "timestamp": "2025-08-25T00:18:29Z"
  },
  {
    "title": "Trump Says Intel Agreed to Give US 10% Equity Stake",
    "description": "President Donald Trump said Intel Corp. had agreed to give the US government a 10% equity stake in the beleaguered chipmaker, with a formal announcement expected on Friday, according to people familiar with the matter.\n“They’ve agreed to do it and I think it’…",
    "link": "https://biztoc.com/x/a849e841895068f0",
    "timestamp": "2025-08-25T00:15:11Z"
  },
  {
    "title": "Russia and China Are Not Threats to the US",
    "description": "This article is a continuation of “A Nobel for the Donald?“ To repeat: the geopolitical equivalent of a tree is about ready to fall unheard in the global forest. Once the Trump/Putin peace deal is inked, not one element of the neocons’ scary bedtime stories a…",
    "link": "https://original.antiwar.com/david_stockman/2025/08/24/russia-and-china-are-not-threats-to-the-us/",
    "timestamp": "2025-08-25T00:00:35Z"
  },
  {
    "title": "Jefferies gets in heated clash with CNN host on 'hypocritical' redistricting position and if Dems have a plan",
    "description": "House Minority Leader Hakeem Jeffries defended his record on New York redistricting plans while discussing potential responses to Texas Republicans.",
    "link": "https://www.foxnews.com/media/jefferies-gets-heated-clash-cnn-host-hypocritical-redistricting-position-dems-have-plan",
    "timestamp": "2025-08-25T00:00:18Z"
  },
  {
    "title": "The American Interest Is Not in Committing to Ukraine",
    "description": "Russian President Vladimir Putin returned to the U.S. for the first time in nearly ten years to meet with U.S. President Donald Trump for a bilateral summit centered on pursuing peace in the Russo-Ukrainian War. Initially, President Trump insisted that he wou…",
    "link": "https://original.antiwar.com/roberttorres/2025/08/24/the-american-interest-is-not-in-committing-to-ukraine/",
    "timestamp": "2025-08-25T00:00:04Z"
  },
  {
    "title": "The Bravery of Kilmar Ábrego García vs. the Barbarism of Donald Trump",
    "description": "Activism\n \n \n / \n August 25, 2025\n \r\n\n \nThe Bravery of Kilmar Ábrego García vs. the Barbarism of Donald Trump\r\n\n\n\nThe husband, father, and union worker from Maryland is risking indefinite incarceration in Uganda to stand up for those who cannot stand up for t…",
    "link": "https://www.thenation.com/article/society/kilmar-abrego-garcia-donald-trump-baltimore/",
    "timestamp": "2025-08-25T00:00:00Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures slip after record-setting surge as Nvidia earnings loom",
    "description": "Wall Street is in a holding pattern ahead of mammoth Nvidia earnings following the Dow's 800-point surge.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-slip-after-record-setting-surge-as-nvidia-earnings-loom-235831498.html",
    "timestamp": "2025-08-24T23:58:31Z"
  },
  {
    "title": "National Guard in Washington begin carrying weapons",
    "description": "US National Guard troops patrolling the streets of Washington DC as part of what President Donald Trump said was his crackdown on crime began carrying weapons last night, two officials said.",
    "link": "https://www.rte.ie/news/2025/0825/1529981-us-politics/",
    "timestamp": "2025-08-24T23:58:11Z"
  },
  {
    "title": "National Guard in Washington to begin carrying weapons",
    "description": "US National Guard troops patrolling the streets of Washington DC as part of what US President Donald Trump said was his crackdown on crime will begin carrying weapons last night, two officials said.",
    "link": "https://www.rte.ie/news/2025/0825/1529981-us/",
    "timestamp": "2025-08-24T23:58:11Z"
  },
  {
    "title": "'Put him in now!': Trump rages about Roger Clemens' snub from the MLB Hall of Fame",
    "description": "President Donald Trump raged on Sunday that a famous pitcher has not yet been inducted into the Major League Baseball Hall of Fame. Trump wrote on Truth Social that he played golf with New York Yankees legend Roger Clemens and his son Kacy on Saturday. The fo…",
    "link": "https://www.rawstory.com/trump-2673914383/",
    "timestamp": "2025-08-24T23:45:26Z"
  },
  {
    "title": "‘Nearly two million more casualties’: The numbers that show Russia is years from victory",
    "description": "Donald Trump’s message – or rather, the message he transmitted from Vladimir Putin – to Volodymyr Zelensky in Washington on Monday was stark: accept the deal Russia is offering, because otherwise you’ll lose the war. But if Moscow appears strong now, Ukraine …",
    "link": "https://freerepublic.com/focus/f-news/4336534/posts",
    "timestamp": "2025-08-24T23:43:36Z"
  },
  {
    "title": "Trump adds Baltimore to target cities",
    "description": "President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead \"send in the 'troops.'\"",
    "link": "https://www.bostonherald.com/2025/08/24/trump-adds-baltimore-to-target-cities/",
    "timestamp": "2025-08-24T23:37:11Z"
  },
  {
    "title": "Trump’s threats backfire against defiant Maryland leader",
    "description": "The gloves came off this weekend when Maryland Governor Wes Moore and President Donald Trump engaged in one of the most heated political exchanges seen on social media in recent memory. What began as a policy disagreement over Baltimore’s crime statistics qui…",
    "link": "https://rollingout.com/2025/08/24/trumps-threats-backfire-against-defiant/",
    "timestamp": "2025-08-24T23:30:23Z"
  },
  {
    "title": "France summons US ambassador over anti-Semitism allegations",
    "description": "Foreign Ministry calls Charles Kushner's claim that Paris is not doing enough to combat anti-Semitism 'unacceptable'.",
    "link": "https://www.aljazeera.com/news/2025/8/24/france-summons-us-ambassador-over-anti-semitism-allegations",
    "timestamp": "2025-08-24T23:30:12Z"
  },
  {
    "title": "'Not A Substantial Part Of History': Fox News Pundit Compares Slavery To Plane Crashes",
    "description": "Conservative radio host Clay Travis told Fox News that slavery was like plane crashes and shouldn't be remembered by museums in the U.S.\n\n\nDuring a Sunday panel discussion on Fox News, host Howard Kurtz noted that President Donald Trump had recently complaine…",
    "link": "https://crooksandliars.com/2025/08/not-substantial-part-history-fox-news",
    "timestamp": "2025-08-24T23:29:41Z"
  },
  {
    "title": "Wasserman Schultz Says DeSantis, Trump Want Human Rights Abused at Alligator Alcatraz: ‘Declared War On People Of Color’",
    "description": "The Florida congresswoman said on CNN that Trump and DeSantis only care about one thing: abusing human rights as part of their war on people of color.\nThe post Wasserman Schultz Says DeSantis, Trump Want Human Rights Abused at Alligator Alcatraz: ‘Declared Wa…",
    "link": "https://www.mediaite.com/media/tv/wasserman-schultz-says-desantis-trump-want-human-rights-abused-at-alligator-alcatraz-declared-war-on-people-of-color/",
    "timestamp": "2025-08-24T23:28:30Z"
  },
  {
    "title": "'No magic fixes' for Democrats as party confronts internal and fundraising struggles",
    "description": "Ken Martin, the new chair of the Democratic National Committee, says he's bringing a bazooka to the fight against President Donald Trump and his Republican allies",
    "link": "https://abcnews.go.com/Politics/wireStory/magic-fixes-democrats-party-confronts-internal-fundraising-struggles-124939600",
    "timestamp": "2025-08-24T23:26:25Z"
  },
  {
    "title": "LGBTQ Lobby Incentivizes Transgender Procedures for Minors",
    "description": "But the organization's days could be numbered.There was a time when most people would’ve viewed transgender medical procedures on minors as outright child abuse. Now, not only are countless people fighting tooth and nail to keep “gender affirming care” legal,…",
    "link": "https://freerepublic.com/focus/f-chat/4336532/posts",
    "timestamp": "2025-08-24T23:22:34Z"
  },
  {
    "title": "Chicago leaders denounce Pentagon plans for military deployment in city",
    "description": "Chicago leaders and state officials pilloried the Trump administration for planning to home in on their city — the third most populous in the United States — as the next target for a military deployment in the name of addressing crime, immigration and homeles…",
    "link": "https://freerepublic.com/focus/f-news/4336530/posts",
    "timestamp": "2025-08-24T23:18:01Z"
  },
  {
    "title": "France summons US ambassador Charles Kushner over antisemitism letter",
    "description": "France strongly rejected the “unacceptable” allegations in Kushner’s letter, which the ministry said “fall short of the quality of the transatlantic relationship” between the US and France.",
    "link": "https://www.cnn.com/2025/08/24/europe/france-us-kushner-ambassador-antisemitism-latam-intl",
    "timestamp": "2025-08-24T23:11:24Z"
  },
  {
    "title": "Reeves sends Mississippi National Guard troops to DC. Should they be in Jackson? Take our poll (Mississippi Clarion Ledger)",
    "description": "Mississippi Clarion Ledger:\nReeves sends Mississippi National Guard troops to DC.  Should they be in Jackson?  Take our poll  —  Gov. Tate Reeves has approved the deployment of hundreds of Mississippi National Guard members to Washington, D.C., in support of …",
    "link": "https://www.memeorandum.com/250824/p42",
    "timestamp": "2025-08-24T23:10:00Z"
  },
  {
    "title": "Trump, 79, Spotted With New Bruise on His Other Hand",
    "description": "Trump, 79, Spotted With New Bruise on His Other Handthedailybeast.com",
    "link": "https://www.thedailybeast.com/donald-trump-79-spotted-with-new-bruise-on-his-other-hand/",
    "timestamp": "2025-08-24T23:07:37Z"
  },
  {
    "title": "Zelensky calls for Putin talks as peace efforts stall",
    "description": "Ukraine's President Volodymyr Zelensky insisted Sunday that a meeting with Russian counterpart Vladimir Putin remained \"the most effective way forward\" as the two sides exchange prisoners and the country celebrated Independence Day.Kyiv's general said that Uk…",
    "link": "https://freerepublic.com/focus/f-news/4336525/posts",
    "timestamp": "2025-08-24T23:06:22Z"
  },
  {
    "title": "EU weighs public blockchain for digital euro",
    "description": "European Union policymakers are debating whether to launch the digital euro on public blockchains as they accelerate work on the CBDC in response to the passage of the Genius Act in the US and fears that it could see dollar-baked stablecoins dominate cross-bo…",
    "link": "https://www.finextra.com/newsarticle/46490/eu-weighs-public-blockchain-for-digital-euro",
    "timestamp": "2025-08-24T23:05:41Z"
  },
  {
    "title": "Ecuador: Victims of violent cartels tell BBC they now hide from US authorities",
    "description": "Donald Trump declared some cartels to be terrorist organisations. So why are the victims of cartels in hiding?",
    "link": "https://www.bbc.com/news/articles/cvg4kd385e4o",
    "timestamp": "2025-08-24T23:03:50Z"
  },
  {
    "title": "'Trump has 'fixed the game' and Democrats have 'no idea' how to respond: Insider",
    "description": "President Donald Trump has created a new political playing field, and Democrats seem to be struggling to respond, according to one analyst. Michael Cohen, Trump's former attorney, whom he once described as his \"fixer,\" said on MSNBC's \"The Weekend: Primetime\"…",
    "link": "https://www.rawstory.com/michael-cohen-2673914507/",
    "timestamp": "2025-08-24T23:03:22Z"
  },
  {
    "title": "The OBBB Act is one of the most significant shifts in education in decades",
    "description": "Hardly anyone is talking about it, but Congress has just passed one of the most consequential education reforms in history.Tucked into the One Big Beautiful Bill Act is a provision that could transform how families access education, reshape the politics of sc…",
    "link": "https://freerepublic.com/focus/f-chat/4336524/posts",
    "timestamp": "2025-08-24T23:03:10Z"
  },
  {
    "title": "Private Equity Fundraising Hits Lowest Level in 7 Years",
    "description": "Private equity (PE) operations are reportedly struggling to raise funds despite offering investors unheard-of incentives. Fundraising among PE firms came to just $592 billion in the 12 months to June, the lowest total in seven years, the Financial Times (FT) …",
    "link": "http://www.pymnts.com/news/investment-tracker/2025/private-equity-fundraising-hits-lowest-level-in-7-years/",
    "timestamp": "2025-08-24T23:03:06Z"
  },
  {
    "title": "Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse",
    "description": "Ten child protection organisations have written an urgent letter to the home secretary expressing concern about the omission of child sexual abuse from the government's violence against women and girls strategy, following a Sky News report.",
    "link": "https://news.sky.com/story/urgent-letter-to-home-secretary-over-violence-against-women-and-girls-strategy-as-it-omits-child-abuse-13417619",
    "timestamp": "2025-08-24T23:01:00Z"
  },
  {
    "title": "Chicago mayor calls Trump's National Guard plan 'most flagrant violation of our Constitution'",
    "description": "Mayor Brandon Johnson pushed back against Trump's National Guard plans for Chicago, citing 30% drop in homicides and concerns about eroding police-community trust.",
    "link": "https://www.foxnews.com/politics/chicago-mayor-calls-trumps-national-guard-plan-most-flagrant-violation-our-constitution",
    "timestamp": "2025-08-24T23:00:43Z"
  },
  {
    "title": "UPDATE: Pentagon commandos prepping Mexico attacks......",
    "description": "Trump’s war on cartels is a godsend for a special ops command with an identity crisis",
    "link": "https://www.kenklippenstein.com/p/the-commandos-prepping-mexico-attacks",
    "timestamp": "2025-08-24T23:00:03Z"
  },
  {
    "title": "Fact Check: Breaking down claim Nobel Committee 'quietly removed' Trump from Peace Prize nominee list",
    "description": "The Nobel Committee has no process for \"removing\" a Peace Prize nominee, because no public nominee list exists in the first place.",
    "link": "https://www.snopes.com/fact-check/trump-nobel-committee-peace-prize/",
    "timestamp": "2025-08-24T23:00:00Z"
  },
  {
    "title": "Breaking down claim Nobel Committee 'quietly removed' Trump from Peace Prize nominee list",
    "description": "The Nobel Committee has no process for \"removing\" a Peace Prize nominee, because no public nominee list exists in the first place.",
    "link": "https://www.snopes.com//fact-check/trump-nobel-committee-peace-prize/",
    "timestamp": "2025-08-24T23:00:00Z"
  },
  {
    "title": "After Trump’s Threat to Send National Guard to Chicago, Democrats Push Back - The New York Times",
    "description": "After Trump’s Threat to Send National Guard to Chicago, Democrats Push BackThe New York Times 'Chicago will not waver': Johnson, Pritzker respond to reports Pentagon plans military deployment to ChicagoFOX 32 Chicago Illinois leaders speak out on Washington P…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178851014",
    "timestamp": "2025-08-24T22:55:10Z"
  },
  {
    "title": "National Guard troops in D.C. to begin carrying firearms",
    "description": "WASHINGTON — National Guard troops deployed to Washington this month to support President Donald Trump's effort to mitigate crime will begin carrying firearms Sunday evening, according to a Defense Department official with knowledge of the planning",
    "link": "https://www.nbcnews.com/politics/politics-news/national-guard-troops-dc-begin-carrying-firearms-rcna226890",
    "timestamp": "2025-08-24T22:52:35Z"
  },
  {
    "title": "France summons US ambassador over 'unacceptable' letter about antisemitism",
    "description": "He wrote to Macron alleging France did not do enough to combat antisemitism.",
    "link": "https://abcnews.go.com/US/wireStory/france-summons-us-ambassador-kushner-unacceptable-letter-rising-124938909",
    "timestamp": "2025-08-24T22:50:14Z"
  },
  {
    "title": "Ghislaine Maxwell just made Trump look even more guilty (Dean Obeidallah/The Dean's Report)",
    "description": "Dean Obeidallah / The Dean's Report:\nGhislaine Maxwell just made Trump look even more guilty  —  Trump knew.  —  Ghislaine Maxwell did what I thought was impossible.  She made Donald Trump look even more guilty when it comes to Jeffrey Epstein's crimes.  —  T…",
    "link": "https://www.memeorandum.com/250824/p41",
    "timestamp": "2025-08-24T22:50:00Z"
  },
  {
    "title": "France summons U.S. ambassador Kushner to Paris over antisemitism allegations",
    "description": "France has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the country did not do enough to combat antisemitism.",
    "link": "https://www.pbs.org/newshour/world/france-summons-u-s-ambassador-kushner-to-paris-over-antisemitism-allegations",
    "timestamp": "2025-08-24T22:41:56Z"
  },
  {
    "title": "Nikki Haley urges India to take Trump’s view on Russian oil seriously",
    "description": "NEW YORK, Aug 24: India should take President Donald Trump’s concerns over its procurement of Russian crude oil seriously and work with the White House to find a solution to the issue, Republican leader Nikki Haley has said. The Trump administration has been …",
    "link": "https://thehillstimes.in/international/nikki-haley-urges-india-to-take-trumps-view-on-russian-oil-seriously",
    "timestamp": "2025-08-24T22:35:00Z"
  },
  {
    "title": "Trump clashes with Democrats as he expands National Guard plans",
    "description": "Washington (AFP) Aug 25, 2025 -\nDonald Trump threatened to deploy National Guard troops Sunday to yet another Democratic stronghold, the Maryland city of Baltimore, as the US president seeks to expand his crackdown on crime and immigration.\n\nThe Republican's …",
    "link": "https://www.spacewar.com/reports/Trump_clashes_with_Democrats_as_he_expands_National_Guard_plans_999.html",
    "timestamp": "2025-08-24T22:34:55Z"
  },
  {
    "title": "Nvidia chief says H20 chip shipments to China not a security concern",
    "description": "Taipei (AFP) Aug 22, 2025 -\n\n\nShipping Nvidia's H20 chips to China was \"great\" for Beijing and Washington and not a security threat, the tech giant's chief said Friday. \n\nThe California-based company produces some of the world's most advanced semiconductors b…",
    "link": "https://www.spacedaily.com/reports/Nvidia_chief_says_H20_chip_shipments_to_China_not_a_security_concern_999.html",
    "timestamp": "2025-08-24T22:32:08Z"
  },
  {
    "title": "Game recognize game",
    "description": "Notes on the ongoing death of satire: Rep. Jim Jordan (R–Ohio) has cited Epstein associate Ghislaine Maxwell’s interview with the Department of Justice as apparent exculpatory evidence regarding President Donald Trump’s alleged association with convicted sex …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/game-recognize-game-6",
    "timestamp": "2025-08-24T22:28:29Z"
  },
  {
    "title": "France summons US Ambassador Kushner over 'unacceptable' letter about rising antisemitism",
    "description": "France has summoned the American ambassador to Paris after the diplomat, Charles Kushner, wrote a letter to French President Emmanuel Macron alleging the...",
    "link": "https://www.yahoo.com/news/articles/france-summons-us-ambassador-kushner-222620561.html",
    "timestamp": "2025-08-24T22:26:20Z"
  },
  {
    "title": "Trump expands targets for possible military deployment to more Democratic-led cities",
    "description": "President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead “send in the ‘troops.’”",
    "link": "https://biztoc.com/x/b98f37e868f31e46",
    "timestamp": "2025-08-24T22:22:43Z"
  },
  {
    "title": "Trump expands targets for possible military deployment to more Democratic-led cities",
    "description": "President Donald Trump on Sunday threatened to expand his military deployments to more Democratic-led cities, responding to an offer by Maryland's governor to join him in a tour of Baltimore by saying he might instead “send in the ‘troops.’”",
    "link": "https://www.pbs.org/newshour/politics/trump-expands-targets-for-possible-military-deployment-to-more-democratic-led-cities",
    "timestamp": "2025-08-24T22:20:14Z"
  },
  {
    "title": "'Washington is becoming Chinatown': Wall Street Journal bashes Trump's 'statism' move",
    "description": "The Wall Street Journal's conservative editorial board bashed President Donald Trump's latest business move, arguing that it models China's \"statism.\" On Friday, Trump announced that the U.S. government is taking a 10% stake in computer chip-maker Intel. The …",
    "link": "https://www.rawstory.com/trump-2673914413/",
    "timestamp": "2025-08-24T22:19:43Z"
  },
  {
    "title": "MSNBC Guest Claims U.S. Ignoring National Security Threats To Do Bolton Raid, Revoke Clearances",
    "description": "McClendon, of Pod Save America's Crooked Media, painted the U.S. as at dire risk, defenseless on national security while Trump is doing Bolton raids.\nThe post MSNBC Guest Claims U.S. Ignoring National Security Threats To Do Bolton Raid, Revoke Clearances firs…",
    "link": "https://www.mediaite.com/media/tv/msnbc-guest-claims-u-s-ignoring-national-security-threats-to-do-bolton-raid-revoke-clearances/",
    "timestamp": "2025-08-24T22:19:29Z"
  },
  {
    "title": "Dozens of Planned Parenthood Clinics Closed in 2025",
    "description": "Dozens of Planned Parenthood clinics have closed or will close this year, as the Trump administration battles to defund the abortion organization of taxpayer dollars through Medicaid.\nThe post Dozens of Planned Parenthood Clinics Closed in 2025 appeared first…",
    "link": "https://www.breitbart.com/politics/2025/08/24/dozens-of-planned-parenthood-clinics-closed-in-2025/",
    "timestamp": "2025-08-24T22:15:30Z"
  },
  {
    "title": "Fascism: Experts and Elements",
    "description": "Rarely do I post two essays here in one day! However, someone here asked me, very recently, to name some experts/scholars about Fascism. I will do that and also offer some typical elements of Fascism. I mentioned earlier Robert Reich, professor of economics a…",
    "link": "https://www.patheos.com/blogs/rogereolson/2025/08/fascism-experts-and-elements/",
    "timestamp": "2025-08-24T22:14:21Z"
  },
  {
    "title": "Trump rips trial judge whose $500M penalty was erased on appeal",
    "description": "New York appellate court tosses $500 million penalty against Trump in civil fraud case while upholding liability findings against his company and family.",
    "link": "https://www.foxnews.com/politics/trump-wins-major-appellate-ruling-attacks-judge-who-oversaw-new-york-fraud-trial",
    "timestamp": "2025-08-24T22:12:05Z"
  },
  {
    "title": "Trump demands Roger Clemens be inducted into Baseball Hall of Fame: 'Put him in NOW'",
    "description": "President Donald Trump threw his support behind New York Yankees legend Roger Clemens' Baseball Hall of Fame candidacy on Sunday afternoon.",
    "link": "https://www.foxnews.com/sports/trump-demands-roger-clemens-inducted-baseball-hall-fame-put-him-now",
    "timestamp": "2025-08-24T22:09:20Z"
  },
  {
    "title": "‘I can often give my views’: Christopher Luxon says he gives ‘reckons’ to RBNZ Governor on cash rate calls",
    "description": "The comments potentially breach rules around the Bank's independence.",
    "link": "https://www.nzherald.co.nz/nz/politics/i-can-often-give-my-views-christopher-luxon-says-he-gives-reckons-to-rbnz-governor-on-cash-rate-calls/KXFHMY65ZFB6XDTZ3BVTWVHKS4/",
    "timestamp": "2025-08-24T22:07:31Z"
  },
  {
    "title": "Gov. Wes Moore Says He Might Gerrymander Out Maryland’s Last GOP Rep In Name Of ‘Fairness’",
    "description": "Democratic Gov. Wes Moore of Maryland said the state could redraw its map to target Rep. Andy Harris, the only Republican in the state’s delegation to Congress.",
    "link": "https://dailycaller.com/2025/08/24/wes-moore-maryland-gerrymander-andy-harris/",
    "timestamp": "2025-08-24T22:07:01Z"
  },
  {
    "title": "Epstein accuser Giuffre wrote a memoir. Months after her death, it's coming out",
    "description": "A posthumous memoir by Virginia Giuffre, who alleged she was trafficked for sex to Prince Andrew by Jeffrey Epstein, will be published later this year.",
    "link": "https://www.abc.net.au/news/2025-08-25/virginia-giuffre-memoir-jeffrey-epstein-to-be-relapsed/105692304",
    "timestamp": "2025-08-24T22:06:16Z"
  },
  {
    "title": "Epstein accuser Giuffre wrote a memoir. Months after her death, it's coming out",
    "description": "A posthumous memoir by Virginia Giuffre, who alleged she was trafficked for sex to Prince Andrew by Jeffrey Epstein, will be published later this year.",
    "link": "https://www.abc.net.au/news/2025-08-25/virginia-giuffre-memoir-jeffrey-epstein-to-be-released/105692304",
    "timestamp": "2025-08-24T22:06:16Z"
  },
  {
    "title": "Cities led by Black women are the first targets of Trump’s political power grab",
    "description": "Republican President Donald Trump’s continued power grab in the nation’s capital, and his threat to expand his militarized takeover to other Democratic-led cities, is setting up a high-stakes showdown over the country’s democracy that pits him prominently aga…",
    "link": "https://freerepublic.com/focus/f-news/4336520/posts",
    "timestamp": "2025-08-24T22:05:07Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Vice President JD Vance remains confident the U.S. can broker an end to the war between Russia and Ukraine despite potential hang-ups that have emerged since President Donald Trump’s meeting this month with Russian President Vladimir Putin.“We believe we’ve a…",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-august-24-rcna226701",
    "timestamp": "2025-08-24T22:00:42Z"
  },
  {
    "title": "JD Vance shuts down MAGA succession chatter after Musk report",
    "description": "Vice President JD Vance rejected the \"future of MAGA\" label on Sunday during an interview, telling NBC's Kristen Welker he was focused on being vice president.",
    "link": "https://www.foxnews.com/media/jd-vance-shuts-down-maga-succession-chatter-after-musk-report",
    "timestamp": "2025-08-24T22:00:37Z"
  },
  {
    "title": "Ex-Space Force Sergeant Sentenced to 54 years for Shooting Teen Suspected of Stealing Car",
    "description": "A look at the consequences of misplaced compassion.\nThe post Ex-Space Force Sergeant Sentenced to 54 years for Shooting Teen Suspected of Stealing Car first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/ex-space-force-sergeant-sentenced-to-54-years-for-shooting-teen-suspected-of-stealing-car/",
    "timestamp": "2025-08-24T22:00:25Z"
  },
  {
    "title": "Almost all Epstein files given to Congress were already public...",
    "description": "Republicans say the Justice Department will hand over more files.",
    "link": "https://www.miamiherald.com/news/politics-government/article311824943.html",
    "timestamp": "2025-08-24T22:00:08Z"
  },
  {
    "title": "Elon Musk’s AI Mothership Signals the Next Wave of Superintelligence?",
    "description": "In a newly surfaced presentation, James Altucher outlines Musk’s latest artificial intelligence push — and why its scale could reshape the future. In a newly surfaced presentation, James Altucher outlines Musk’s latest artificial intelligence push — and why i…",
    "link": "https://www.globenewswire.com/news-release/2025/08/24/3138174/0/en/Elon-Musk-s-AI-Mothership-Signals-the-Next-Wave-of-Superintelligence.html",
    "timestamp": "2025-08-24T22:00:00Z"
  },
  {
    "title": "Giuffre's Family: DOJ Let Maxwell 'Rewrite History'",
    "description": "The family of Virginia Giuffre has criticized the Justice Department for releasing transcripts of its interview with Ghislaine Maxwell, saying it gave Jeffrey Epstein's imprisoned accomplice a \"platform to rewrite history\" and undermine the voices of survivor…",
    "link": "https://www.newser.com/story/374035/giuffres-family-doj-let-maxwell-rewrite-history.html",
    "timestamp": "2025-08-24T22:00:00Z"
  },
  {
    "title": "Turley Says Maxwell Transcript Exonerates Trump and Hits ‘Hard in Washington’",
    "description": "Legal scholar and Fox News contributor Jonathan Turley says that, according to interview transcripts recently released by the Department of Justice, Ghislaine Maxwell exonerates President Donald... Read More\nThe post Turley Says Maxwell Transcript Exonerates …",
    "link": "https://www.dailysignal.com/2025/08/24/turley-breaks-down-maxwell-transcripts-mean-trump-d-c/",
    "timestamp": "2025-08-24T22:00:00Z"
  },
  {
    "title": "Zelenskyy calls for Putin talks as peace efforts stall",
    "description": "<![CDATA[ After a push by US President Donald Trump to broker a Ukraine-Russia summit, hopes for peace dimmed when Russia on Friday ruled out any immediate Putin-Zelenskyy meeting. ]]>",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-calls-putin-talks-peace-efforts-stall-5311796",
    "timestamp": "2025-08-24T21:54:00Z"
  },
  {
    "title": "Saturday Night ‘shakeup’! SNL creator Lorne Michaels teases big changes ahead of season 51 premiere",
    "description": "Michaels confirmed he felt ‘pressure to reinvent’ the late-night show this season",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/lorne-michaels-snl-cast-season-51-b2813378.html",
    "timestamp": "2025-08-24T21:52:48Z"
  },
  {
    "title": "Ex-State Dept. Employee Breaks Silence On Firing Over Israel-Palestine Language",
    "description": "Shahed Ghoreishi said his ouster, which came after he tried to inject more empathy into press statements, is creating a \"chilling effect\" within the agency.",
    "link": "https://www.huffpost.com/entry/state-department-employee-breaks-silence-israel-palestinian_n_68ab77c4e4b0f98d2d956592",
    "timestamp": "2025-08-24T21:52:06Z"
  },
  {
    "title": "A Different Kind of College Ranking",
    "description": "A college degree is costly, to both students and taxpayers. Here’s the only list that shows which institutions provide good value to both.\nThe post A Different Kind of College Ranking appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/08/24/a-different-kind-of-college-ranking-4/",
    "timestamp": "2025-08-24T21:49:45Z"
  }
]