[
  {
    "title": "EPA workers silenced as agency cancels hundreds of grants",
    "description": "EPA staffers have been told they are prohibited from communicating with grantee partners they are supposed to monitor, according to multiple sources inside the agency.",
    "link": "https://abcnews.go.com/Politics/epa-workers-silenced-agency-cancels-hundreds-grants/story?id=119715963",
    "timestamp": "2025-03-12T21:45:46Z"
  },
  {
    "title": "Trump makes good on threats to pull funding from Maine due to trans sports defiance",
    "description": "Money flow halted while investigation under way into violations of federal law",
    "link": "https://www.wnd.com/2025/03/trump-makes-good-on-threats-to-pull-funding-from-maine-due-to-trans-sports-defiance/",
    "timestamp": "2025-03-12T21:45:01Z"
  },
  {
    "title": "Rumble embraces Trump-era crypto strategy with $17M BTC purchase",
    "description": "Video-sharing platform Rumble says it had purchased more than $17 million worth of Bitcoin as part of a previously announced investment strategy.In a March 12 notice, Rumble said it had added 188 Bitcoin (BTC) to its treasury for roughly $17.1 million. The in…",
    "link": "https://cointelegraph.com/news/rumble-bitcoin-purchase-donald-trump-inflation-hedge",
    "timestamp": "2025-03-12T21:45:00Z"
  },
  {
    "title": "Things to know about a potential Trump presidential library in Florida",
    "description": "A Florida legislator said that state has a 'high likelihood' of getting its first presidential library.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-presidential-library-florida/",
    "timestamp": "2025-03-12T21:44:44Z"
  },
  {
    "title": "In meeting with Irish leader, Trump accuses Ireland of taking U.S. companies via taxation",
    "description": "President Donald Trump accused Ireland of taking U.S companies via taxation during an hour-long meeting with Irish Taoiseach Micheal Martin at the White...",
    "link": "https://www.upi.com/Top_News/US/2025/03/12/Ireland-Trump-Martin-EU/9821741792469/",
    "timestamp": "2025-03-12T21:44:18Z"
  },
  {
    "title": "Federal judge appears skeptical probationary firings were for performance",
    "description": "Nearly 20 states are seeking a temporary restraining order to stop any more firings.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-mass-firings/",
    "timestamp": "2025-03-12T21:44:11Z"
  },
  {
    "title": "Judge hopes to rule next week on Trump order banning transgender people from military service",
    "description": "It is her 'strong hope' to issue a decision next Tuesday or Wednesday, she said.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-transgender-troops-ruling/",
    "timestamp": "2025-03-12T21:43:49Z"
  },
  {
    "title": "‘Where is Elon Musk?!’ House Dem Loses It Over GOP Colleagues Refusing to Bring Musk in to Talk DOGE",
    "description": "\"He's been on television the last couple of days talking exactly about Social Security, Medicare, and Medicaid and what he intends to do. Privatize it!\"\nThe post ‘Where is Elon Musk?!’ House Dem Loses It Over GOP Colleagues Refusing to Bring Musk in to Talk D…",
    "link": "https://www.mediaite.com/politics/where-is-elon-musk-house-dem-loses-it-over-gop-colleagues-refusing-to-bring-musk-in-to-talk-doge/",
    "timestamp": "2025-03-12T21:42:32Z"
  },
  {
    "title": "What is the Immigration Act of 1952 and why do Trump officials keep talking about it?",
    "description": "Again and again, the Trump White House has turned to a 73-year-old legal statute to defend its immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/immigration-act-1952-trump-officials-talking-119733035",
    "timestamp": "2025-03-12T21:42:31Z"
  },
  {
    "title": "Trump blasts Ireland on trade during traditional visit",
    "description": "WASHINGTON: It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual US trip to mark Saint Patrick's Day - a dressing down from Donald Trump on trade and tariffs. \"We do have a massive deficit with Ireland,\" the US preside…",
    "link": "https://www.channelnewsasia.com/world/trump-blasts-ireland-trade-during-traditional-visit-4996971",
    "timestamp": "2025-03-12T21:42:25Z"
  },
  {
    "title": "Mark Carney to be sworn in as prime minister Friday: sources",
    "description": "Prime minister-designate Mark Carney and his cabinet will be sworn in on Friday at Rideau Hall, Radio-Canada and CBC News have learned.",
    "link": "https://www.cbc.ca/news/politics/carney-swearing-in-friday-1.7482023",
    "timestamp": "2025-03-12T21:41:59Z"
  },
  {
    "title": "The five radical leftist groups protesting Elon Musk – one of which received $7.6m from George Soros",
    "description": "Coordinated protests against Elon Musk are being financed by billionaire philanthropist George Soros and moneyed Democrats.",
    "link": "https://nypost.com/2025/03/12/us-news/radical-anti-elon-musk-group-received-7-6m-from-george-soros/",
    "timestamp": "2025-03-12T21:41:52Z"
  },
  {
    "title": "Explainer: The problematic planning history of Trump’s Doonbeg hotel and golf course",
    "description": "Doonbeg’s ‘grey dunes’ and presence of endangered snail hampered original developer’s plans",
    "link": "https://www.irishtimes.com/politics/2025/03/12/explainer-the-problematic-planning-history-of-trumps-doonbeg-hotel-and-golf-course/",
    "timestamp": "2025-03-12T21:40:13Z"
  },
  {
    "title": "Donald Trump crowns Conor McGregor as his favorite Irishman",
    "description": "President Donald Trump has once again expressed his admiration for UFC star Conor McGregor, despite the fighter&apos;s ongoing legal troubles and extended absence from competition.",
    "link": "https://www.marca.com/en/ufc/2025/03/12/67d1fb5622601d1a558b4596.html",
    "timestamp": "2025-03-12T21:39:24Z"
  },
  {
    "title": "As Elon Musk makes thousands of federal workers jobless, tycoon pushes for $56B Tesla pay deal",
    "description": "Not so much thrown under a bus as under an unwanted electric car Elon Musk is trying yet again to get his $56 billion Tesla pay package reinstated with an appeal to the Delaware Supreme Court. …",
    "link": "https://www.theregister.com/2025/03/12/elon_musk_appeals_voided_pay_package/",
    "timestamp": "2025-03-12T21:38:53Z"
  },
  {
    "title": "‘Everything Is Transgender,’ Complains President Obsessed With Trans People",
    "description": "Donald Trump complained that he hears about transgender people too much as Congress hosted a “Detrans Awareness Day.”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-complains-everything-transgender-1235294888/",
    "timestamp": "2025-03-12T21:38:49Z"
  },
  {
    "title": "‘Deranged bigot’: Law expert warns of 'popular uprising' over Trump's 'political prisoner'",
    "description": "The Saturday night immigration arrest of former Columbia University graduate student Mahmoud Khalil raises a multitude of legal questions – but none as important as how the “kidnapping” of President Donald Trump’s “first political prisoner” was allowed to unf…",
    "link": "https://www.rawstory.com/mahmoud-khalil-2671318570/",
    "timestamp": "2025-03-12T21:38:42Z"
  },
  {
    "title": "Nomura 2nd Japanese bank to exit global climate alliance for industry",
    "description": "Nomura Holdings Inc said Wednesday it has withdrawn from a global climate coalition for banks, becoming the second Japanese financial institution to do so after climate-skeptic U.S. President Donald Trump returned to office. The decision to withdraw from the …",
    "link": "https://japantoday.com/category/business/nomura-2nd-japanese-bank-to-exit-global-climate-alliance-for-industry",
    "timestamp": "2025-03-12T21:38:37Z"
  },
  {
    "title": "The Many Misrepresentations of Mahmoud Khalil",
    "description": "Early this week, as Columbia students scrambled to respond to the United States government’s arrest of recent graduate Mahmoud Khalil, a series of logistical hurdles emerged. What would the protesters do if approached by police? What did the fine print of Col…",
    "link": "https://www.motherjones.com/politics/2025/03/mahmoud-khalil-columbia-arrest-columbia-student-activists-misrepresentations/",
    "timestamp": "2025-03-12T21:38:31Z"
  },
  {
    "title": "Intel names chip industry veteran Lip-Bu Tan as next CEO",
    "description": "New boss is tasked with restoring the fortunes of a pioneering chipmaker that’s become an industry laggard",
    "link": "https://www.irishtimes.com/business/2025/03/12/intel-names-chip-industry-veteran-lip-bu-tan-as-next-ceo/",
    "timestamp": "2025-03-12T21:38:17Z"
  },
  {
    "title": "Kuwait frees a group of jailed Americans, including contractors held on drug charges",
    "description": "The move is seen as a gesture of goodwill between two allies.",
    "link": "https://www.bostonherald.com/2025/03/12/kuwait-americans-released/",
    "timestamp": "2025-03-12T21:37:41Z"
  },
  {
    "title": "What is the Immigration Act of 1952 and why do Trump officials keep talking about it?",
    "description": "The act comes up so frequently because it is the legal foundation of modern immigration law",
    "link": "https://www.bostonherald.com/2025/03/12/immigration-act-of-1952/",
    "timestamp": "2025-03-12T21:37:28Z"
  },
  {
    "title": "Judge denies Pulitzer board’s effort to delay Trump (Russia collusion) defamation case",
    "description": "The ruling paves the way for the discovery process, where Trump’s lawyers are seeking the board’s internal deliberations in its 2018 awards to the New York Times and Washington Post for Russia collusion coverage. A Florida circuit court judge has denied the P…",
    "link": "https://freerepublic.com/focus/f-news/4303856/posts",
    "timestamp": "2025-03-12T21:36:39Z"
  },
  {
    "title": "Liberal North Carolina city's DEI plan for hurricane relief shut down by HUD secretary",
    "description": "Secretary of Department of Housing and Urban Development Scott Turner shut down an Asheville, North Carolina, Hurricane Helene relief plan that included DEI initiatives.",
    "link": "https://www.foxnews.com/politics/liberal-north-carolina-citys-dei-plan-hurricane-relief-shut-down-hud-secretary",
    "timestamp": "2025-03-12T21:36:12Z"
  },
  {
    "title": "Banks acting as validators risks centralization — Everstake exec",
    "description": "New US regulatory guidance allowing banks to become validators for blockchain networks is a major step for institutional adoption but worsens centralization risks, Bohdan Opryshko, chief operating officer of staking service provider Everstake, told Cointelegr…",
    "link": "https://cointelegraph.com/news/banks-as-validators-risks-centralization-everstake-exec",
    "timestamp": "2025-03-12T21:35:59Z"
  },
  {
    "title": "U.S. Senate Democrats debate path forward on government funding bill",
    "description": "U.S. Senate Democrats were wrestling on Wednesday with how to respond to a stopgap funding bill passed by the Republican-controlled House of Representatives, choosing between voting for a bill many of them oppose or allowing a government shutdown. President D…",
    "link": "https://japantoday.com/category/world/us-senate-democrats-debate-path-forward-on-government-funding-bill1",
    "timestamp": "2025-03-12T21:34:48Z"
  },
  {
    "title": "Trump blasts Ireland on trade during traditional visit",
    "description": "It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual U.S. trip to mark St Patrick's Day -- a dressing down from Donald Trump on trade and tariffs. &quot;We do have a massive deficit with Ireland,&quot; the U.S. preside…",
    "link": "https://japantoday.com/category/world/trump-blasts-ireland-on-trade-during-traditional-visit",
    "timestamp": "2025-03-12T21:34:39Z"
  },
  {
    "title": "Iran's Khamenei spurns U.S. talks offer as UAE envoy delivers Trump letter",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei on Wednesday rejected holding negotiations with the United States over a nuclear deal, as a letter was delivered from U.S. President Donald Trump calling for such talks. Last week, Trump said he had sent the letter…",
    "link": "https://japantoday.com/category/world/iran%27s-khamenei-spurns-us-talks-offer-as-uae-envoy-delivers-trump-letter",
    "timestamp": "2025-03-12T21:34:32Z"
  },
  {
    "title": "Cautious Russia weighs Ukraine ceasefire plan as U.S. tries to seal a deal",
    "description": "The Kremlin said on Wednesday it was awaiting details from Washington about a proposal for a 30-day ceasefire in Ukraine before responding, while U.S. Secretary of State Marco Rubio  hoped a deal would be struck within days. As Moscow considered the plan, Pre…",
    "link": "https://japantoday.com/category/world/cautious-russia-weighs-ukraine-ceasefire-plan-as-us-tries-to-seal-a-deal1",
    "timestamp": "2025-03-12T21:34:25Z"
  },
  {
    "title": "Trump vows to take back 'stolen' wealth as tariffs on steel, aluminum imports go into effect worldwide",
    "description": "U.S. President Donald Trump openly challenged U.S. allies on Wednesday by increasing tariffs on all steel and aluminum imports to 25% as he vowed to take back wealth “stolen” by other countries, drawing quick retaliation from Europe and Canada. The Republican…",
    "link": "https://japantoday.com/category/world/trump-vows-to-take-back-%27stolen%27-wealth-as-tariffs-on-steel-and-aluminum-imports-go-into-effect",
    "timestamp": "2025-03-12T21:32:25Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Maine's funding paused after governor, Trump feud over trans athletes",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-trump-takes-aim-maine-amid-transgender-athlete-executive-order-dispute",
    "timestamp": "2025-03-12T21:32:17Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL (Mar, 13, 2025) *PRAYER*",
    "description": "Join with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media. This is the confidence we have in approaching God: that if we a…",
    "link": "https://freerepublic.com/focus/f-religion/4303855/posts",
    "timestamp": "2025-03-12T21:32:08Z"
  },
  {
    "title": "Where U.S.-Canada Relations Go From Here",
    "description": "Quebec’s international relations minister on Trump’s tariffs and the potential for cross-border economic pain.",
    "link": "http://foreignpolicy.com/2025/03/12/quebec-international-relations-minister-trump-tariffs-united-states-canada/",
    "timestamp": "2025-03-12T21:31:44Z"
  },
  {
    "title": "Trump feels 'very badly' after mass firings — but insists 'many of them don't work at all'",
    "description": "President Donald Trump justified his administration's mass firings of federal workers by claiming, without evidence, that many of them simply were collecting a paycheck and doing nothing, NBC4 Washington reported on Wednesday.The firings cover some 200,000 \"p…",
    "link": "https://www.rawstory.com/trump-worker-firings/",
    "timestamp": "2025-03-12T21:31:08Z"
  },
  {
    "title": "Kuwait Frees a Group of Jailed Americans",
    "description": "The release follows a recent visit to the region by Adam Boehler, the Trump administration's top hostage envoy.",
    "link": "https://time.com/7267447/kuwait-frees-jailed-americans/",
    "timestamp": "2025-03-12T21:31:03Z"
  },
  {
    "title": "JD Vance's Sock Choice Stops President Trump Mid-Sentence During Oval Office Meeting",
    "description": "Trump seemed tickled by Vance's decision to honor Wednesday's White House guest with a small outfit choice.",
    "link": "https://www.huffpost.com/entry/trump-reacts-jd-vance-shamrock-socks_n_67d1dec1e4b0668b4e9d48c5",
    "timestamp": "2025-03-12T21:30:51Z"
  },
  {
    "title": "Senate Retirements Make Midterms Harder for Democrats",
    "description": "Democrats should benefit from a stiff midterm breeze in 2026. But with a tough landscape and three seats open (the latest caused by Jeanne Shaheen’s retirement), it’s unlikely they can flip the Senate.",
    "link": "http://nymag.com/intelligencer/article/senate-retirements-make-midterms-harder-for-democrats.html",
    "timestamp": "2025-03-12T21:30:24Z"
  },
  {
    "title": "This Is Why European Stocks Might Be One Of The Best Investment Opportunity In Years",
    "description": "Russia's westward push and U.S. indifference towards European worries may trigger a strong economic revival in the region, benefiting stocks. The new German Chancellor is pushing for that to happen.",
    "link": "https://www.forbes.com/sites/raulelizalde/2025/03/12/this-is-why-european-stocks-might-be-one-of-the-best-investment-opportunity-in-years/",
    "timestamp": "2025-03-12T21:30:23Z"
  },
  {
    "title": "Grad student's detention will stretch on as lawyers spar over Trump's plan to deport him",
    "description": "Mahmoud Khalil will remain detained in Louisiana until at least next week after an initial court hearing Wednesday over the Trump administration's plans to deport the Columbia University graduate student.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d75682ff-d57a-5718-8746-e6a0ab5c9663.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Federal judge orders Trump administration to pay foreign aid contracts for finished work",
    "description": "null / sergign/Shutterstock.\n\nWashington, D.C. Newsroom, Mar 12, 2025 / 17:30 pm (CNA).\nA federal judge has ordered the administration of U.S. President Donald Trump to make foreign aid payments to non-governmental organizations (NGOs) for completed work, but…",
    "link": "https://www.catholicnewsagency.com/news/262701/federal-judge-orders-trump-administration-to-pay-foreign-aid-contracts-for-finished-work",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Schapiro: Demographics, not DEI, imperil Va. schools",
    "description": "Virginia Military Institute and Sweet Briar College can thrive through faith in the future rather than a love affair with the past.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_4eebc146-ff54-11ef-9bc6-47cbd056e906.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "Grad student's detention will stretch on as lawyers spar over Trump's plan to deport him",
    "description": "Mahmoud Khalil will remain detained in Louisiana until at least next week after an initial court hearing Wednesday over the Trump administration's plans to deport the Columbia University graduate student.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_50b0008e-e537-5970-9fed-a40ddca6ecee.html",
    "timestamp": "2025-03-12T21:30:00Z"
  },
  {
    "title": "How Many Americans Have Died of COVID-19?",
    "description": "This week marks five years since March 13, 2020, the day President Donald Trump declared a national state of emergency over the novel coronavirus outbreak. By that date, only 57 Americans had died of COVID-19 and 1,645 had been diagnosed with the virus. Three…",
    "link": "https://biztoc.com/x/d1a34727f895f0f3",
    "timestamp": "2025-03-12T21:29:32Z"
  },
  {
    "title": "In rural Louisiana, Speaker Mike Johnson’s constituents fear potential Medicaid cuts",
    "description": "In House Speaker Mike Johnson’s backyard, many residents rely on anti-poverty programs to help make ends meet — and are pleading with the Louisiana Republican to protect those benefits as Congress weighs steep federal spending cuts.",
    "link": "https://www.nbcnews.com/politics/congress/rural-louisiana-speaker-mike-johnson-potential-medicaid-cuts-rcna196007",
    "timestamp": "2025-03-12T21:28:52Z"
  },
  {
    "title": "AG Bondi to report back to Trump on whether Biden policies infringe on 2nd Amendment",
    "description": "Attorney General Pam Bondi is looking into whether Biden administration policies infringe on Americans' right to bear arms.",
    "link": "https://abcnews.go.com/Politics/ag-bondi-report-back-trump-biden-policies-infringe/story?id=119678797",
    "timestamp": "2025-03-12T21:28:16Z"
  },
  {
    "title": "All things considered, the Taoiseach will be happy with how he handled a tricky Trump encounter",
    "description": "Larry Donnelly says some may criticise Micheál Martin, but what would have been the benefit of his opposing Donald Trump in this instance?",
    "link": "https://www.thejournal.ie/readme/trump-oval-office-micheal-martin-6647743-Mar2025/",
    "timestamp": "2025-03-12T21:28:00Z"
  },
  {
    "title": "Did Trump Signal More Security Cooperation With Pakistan?",
    "description": "Despite a shoutout in the U.S. president’s speech last week, don’t expect a renewed security partnership.",
    "link": "http://foreignpolicy.com/2025/03/12/pakistan-us-counterterrorism-security-cooperation-trump/",
    "timestamp": "2025-03-12T21:26:39Z"
  },
  {
    "title": "The Latest Government Layoffs Put Kids Everywhere At Risk",
    "description": "The Education Department is being cut in half, and every part of the agency is being hit by the layoffs.",
    "link": "https://www.huffpost.com/entry/mass-layoffs-department-education_n_67d1ee94e4b00defe4988acb",
    "timestamp": "2025-03-12T21:26:31Z"
  },
  {
    "title": "Explainer: What's a recession and why is rising anxiety about it roiling markets?",
    "description": "Stock markets are plunging, consumers and businesses have started to sour on the economy, and economists are marking down their estimates for growth this year, with some even seeing rising odds of a recession.",
    "link": "https://www.koat.com/article/whats-a-recession-and-why-is-rising-anxiety/64166283",
    "timestamp": "2025-03-12T21:26:12Z"
  },
  {
    "title": "Ayo Edebiri says an Elon Musk tweet prompted death threats and racial slurs against her: 'He's an idiot'",
    "description": "Ayo Edebiri criticized Elon Musk for  triggering trolls to attack her on social media over a rumor she was cast in a \"Pirates of the Caribbean\" movie.",
    "link": "https://www.businessinsider.com/ayo-edebiri-elon-musk-tweet-pirates-of-the-caribbean-rumor-2025-3",
    "timestamp": "2025-03-12T21:25:49Z"
  },
  {
    "title": "Iran Rejects Trump’s Diplomacy, Setting Up Showdown as War Talk Escalates",
    "description": "The White House on Wednesday reaffirmed its threat to take military action against Iran if the country does not consent to negotiations on its contested nuclear weapons program, ratcheting up pressure just a day after Tehran’s hardline leadership categoricall…",
    "link": "https://freebeacon.com/national-security/iran-rejects-trumps-diplomacy-setting-up-showdown-as-war-talk-escalates/",
    "timestamp": "2025-03-12T21:25:05Z"
  },
  {
    "title": "Hamas official welcomes Trump’s apparent retreat on Gazans displacement call",
    "description": "The statement by the Hamas official came after Trump said on Wednesday that \"nobody is expelling any Palestinians from Gaza.\"",
    "link": "https://www.jpost.com/breaking-news/article-845822",
    "timestamp": "2025-03-12T21:24:05Z"
  },
  {
    "title": "Explainer: What's a recession and why is rising anxiety about it roiling markets?",
    "description": "Stock markets are plunging, consumers and businesses have started to sour on the economy, and economists are marking down their estimates for growth this year, with some even seeing rising odds of a recession.",
    "link": "https://www.wyff4.com/article/whats-a-recession-and-why-is-rising-anxiety/64166283",
    "timestamp": "2025-03-12T21:23:26Z"
  },
  {
    "title": "EPA head says he'll roll back dozens of environmental regulations, including rules on climate change",
    "description": "In what he called the “most consequential day of deregulation in American history,” the head of the Environmental Protection Agency announced a series of actions Wednesday to roll back landmark environmental regulations, including rules on pollution from coal…",
    "link": "https://japantoday.com/category/features/environment/epa-head-says-he%27ll-roll-back-dozens-of-environmental-regulations-including-rules-on-climate-change",
    "timestamp": "2025-03-12T21:23:22Z"
  },
  {
    "title": "‘Health Security Is At Risk’: Inside the Purge of HHS",
    "description": "On Monday night, a longtime employee of the National Institutes of Health (NIH) sat down with his wife at their kitchen table in a D.C. suburb and decided to leave the job he loves. Three days earlier, he was one of thousands of employees at the Department of…",
    "link": "https://www.motherjones.com/politics/2025/03/health-security-is-at-risk-inside-the-purge-of-hhs/",
    "timestamp": "2025-03-12T21:23:22Z"
  },
  {
    "title": "Billionaire Leon Black gave even more money to Jeffrey Epstein than we knew, Senate investigators say",
    "description": "The Apollo Global Management cofounder said he paid Jeffrey Epstein for tax advice. A US Senator investigating the financial transfers is skeptical.",
    "link": "https://www.businessinsider.com/leon-black-money-jeffrey-epstein-senate-investigation-2025-3",
    "timestamp": "2025-03-12T21:22:30Z"
  },
  {
    "title": "The dismantling of the Education Department, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff. Today I’m focusing on the Trump administration’s move …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/403730/trump-education-department",
    "timestamp": "2025-03-12T21:22:27Z"
  },
  {
    "title": "Federal Judge Deals Donald Trump Legal Blow on Executive Order",
    "description": "A federal judge on Wednesday blocked the Trump administration from enforcing parts of an executive order aimed at punishing Perkins Coie, a prominent law firm linked to Democratic-funded opposition research during the 2016 presidential campaign into Donald Tr…",
    "link": "https://biztoc.com/x/0172f954d25f21e3",
    "timestamp": "2025-03-12T21:22:11Z"
  },
  {
    "title": "Federal Judge Deals Donald Trump Legal Blow on Executive Order",
    "description": "In a March 6 order, Trump targeted Perkins Coie, calling the law group out for what he says is \"dishonest and dangerous activity.\"",
    "link": "https://www.newsweek.com/federal-judge-deals-donald-trump-legal-blow-executive-order-2043869",
    "timestamp": "2025-03-12T21:21:57Z"
  },
  {
    "title": "Russia says no peacekeepers in Ukraine ‘under any conditions’ as Trump reups threat of ‘devastating’ sanctions",
    "description": "\"They keep saying, 'nothing about Ukraine without Ukraine,' but they do everything about Russia without Russia,\" Foreign Minister Sergey Lavrov told pro-Kremlin US bloggers.",
    "link": "https://nypost.com/2025/03/12/us-news/russia-says-no-peacekeepers-in-ukraine-under-any-conditions-as-trump-reups-threat-of-devastating-sanctions/",
    "timestamp": "2025-03-12T21:21:53Z"
  },
  {
    "title": "BREAKING: Obama Judge Beryl Howell Sides with Perkins Coie, the DNC Law Firm Linked to Hillary Clinton and Bogus Russia Dossier – Blocks Part of Trump’s Executive Order",
    "description": "U.S. District Judge Beryl Howell's recent ruling blocks the Trump administration's attempt to revoke security clearances from employees at Perkins Coie, a law firm entwined in the 2016 election controversy.\nThe post BREAKING: Obama Judge Beryl Howell Sides wi…",
    "link": "https://www.thegatewaypundit.com/2025/03/breaking-obama-judge-beryl-howell-sides-perkins-coie/",
    "timestamp": "2025-03-12T21:20:51Z"
  },
  {
    "title": "UK Warns Iran Sanctions Could Be Reimposed As UN Security Council Meets",
    "description": "Britain warned on Wednesday that it would trigger a return of U.N. sanctions on Iran, if needed, to prevent it from getting a nuclear weapon as the Security Council met to discuss Tehran&#039;s expansion of its stock of uranium close to weapons grade.",
    "link": "https://www.ndtv.com/world-news/uk-warns-iran-sanctions-could-be-reimposed-as-un-security-council-meets-7911626",
    "timestamp": "2025-03-12T21:19:05Z"
  },
  {
    "title": "Canadian mayors, workers worry about ‘permanent damage’ from Trump tariffs",
    "description": "Canadian mayors, workers and industry representatives are warning that the Trump administration’s punishing tariffs on steel and aluminum could cost jobs and cause lasting damage to industries on both sides of the border. They say Canada is already feeling th…",
    "link": "https://financialpost.com/pmn/canadian-mayors-workers-worry-about-permanent-damage-from-trump-tariffs-2",
    "timestamp": "2025-03-12T21:18:57Z"
  },
  {
    "title": "Trump says Ireland cheats the US as its leader joins him to celebrate St. Patrick's Day",
    "description": "President Donald Trump is hosting Ireland's prime minister, Micheál Martin, for the annual St. Patrick's Day celebration at the White House",
    "link": "https://abcnews.go.com/US/wireStory/trump-ireland-cheats-us-leader-joins-celebrate-st-119732661",
    "timestamp": "2025-03-12T21:18:48Z"
  },
  {
    "title": "With Trump’s Tariffs, the Canadian Art Market Looks for Opportunities Elsewhere",
    "description": "Canada’s robust network of active institutions and enthusiastic collectors paired with stronger relationships with Mexico and Europe could make engaging with the U.S. art market optional.",
    "link": "https://observer.com/2025/03/us-trump-tarrifs-canadian-art-market-imports-shipping/",
    "timestamp": "2025-03-12T21:16:52Z"
  },
  {
    "title": "Trump Hopes He Won't Have to Pressure Putin to Accept Truce",
    "description": "President Donald Trump told reporters in the Oval Office Wednesday that he hoped it wouldn’t be necessary to pressure Russian President Vladimir Putin into accepting a ceasefire deal with Ukraine. “People are going to Russia right now as we speak, and hopeful…",
    "link": "https://biztoc.com/x/8428cbdd9610065a",
    "timestamp": "2025-03-12T21:16:32Z"
  },
  {
    "title": "'Disgraceful': Trump DOJ Guts Unit That Targets Corruption by Public Officials",
    "description": "Weeks after the Trump administration pressured the U.S. government's top anti-corruption prosecutors to drop charges of bribery and other federal crimes against New York Mayor Eric Adams, the Public Integrity Section at the Department of Justice is set to be …",
    "link": "https://www.commondreams.org/news/doj-corruption",
    "timestamp": "2025-03-12T21:15:55Z"
  },
  {
    "title": "Trump's FCC chair wants to know what rules you think he should scrap",
    "description": "FCC Chair Brendan Carr is asking the public what rules should be eliminated fulfill Trump's deregulation agenda.",
    "link": "https://www.businessinsider.com/trump-fcc-chair-wants-to-know-what-rules-should-scrap-2025-3",
    "timestamp": "2025-03-12T21:15:15Z"
  },
  {
    "title": "Schumer says Democrats will block House funding bill",
    "description": "Minority Leader Chuck Schumer said Wednesday that Senate Democrats will not provide the votes to pass the House-approved deal to fund the government.",
    "link": "https://abcnews.go.com/Politics/schumer-democrats-block-house-funding-bill-heightening-shutdown/story?id=119716576",
    "timestamp": "2025-03-12T21:14:55Z"
  },
  {
    "title": "Trump envoy to present ceasefire deal to Russia this week – White House",
    "description": "US special envoy Steve Witkoff will be traveling to Moscow this week, White House spokesperson Karoline Leavitt has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614107-trump-envoy-russia-ceasefire/",
    "timestamp": "2025-03-12T21:14:01Z"
  },
  {
    "title": "Trump’s Anti-Trans Orders Get Most Airtime on Fox News, Report Finds",
    "description": "The lack of coverage from other networks has allowed Fox News to shape the narrative at a crucial time for trans rights.",
    "link": "https://truthout.org/articles/trumps-anti-trans-orders-get-most-airtime-on-fox-news-report-finds/",
    "timestamp": "2025-03-12T21:13:35Z"
  },
  {
    "title": "How Many Americans Have Died of COVID-19?",
    "description": "This week marks five years since March 13, 2020, the day President Donald Trump declared a national state of emergency over the novel coronavirus",
    "link": "https://reason.com/2025/03/12/how-many-americans-have-died-of-covid-19/",
    "timestamp": "2025-03-12T21:13:21Z"
  },
  {
    "title": "UK and France Race to Draft Ukraine Troops Plan Trump Will Buy",
    "description": "The UK and France are scrambling to bolster Ukraine’s negotiating position as US President Donald Trump seeks to force through a settlement in its war with Russia.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-and-france-race-to-draft-ukraine-troops-plan-trump-will-buy",
    "timestamp": "2025-03-12T21:12:30Z"
  },
  {
    "title": "Dalkey-born lawyer Gail Slater approved as head of US antitrust division",
    "description": "Dual citizen inherits major cases against Google and Apple",
    "link": "https://www.irishtimes.com/world/us/2025/03/12/dalkey-born-lawyer-gail-slater-approved-as-head-of-us-antitrust-division/",
    "timestamp": "2025-03-12T21:11:05Z"
  },
  {
    "title": "Steve Bannon Won’t Rule Out Running for President",
    "description": "Steve Bannon \"repeatedly refused to rule out a presidential bid, as GOP sources close to him are increasingly speculating he is serious about running should President Donald Trump himself not campaign for a third term",
    "link": "https://politicalwire.com/2025/03/12/steve-bannon-wont-rule-out-running-for-president/",
    "timestamp": "2025-03-12T21:11:01Z"
  },
  {
    "title": "Tina Brown Slams Meghan Markle’s Netflix Series",
    "description": "Tina Brown criticized the Duchess of Sussex for misjudging the cultural moment, calling it “fake perfection.”",
    "link": "https://www.huffpost.com/entry/tina-brown-meghan-markle-netflix-series_n_67d1afc4e4b06f5968ceeedb",
    "timestamp": "2025-03-12T21:08:10Z"
  },
  {
    "title": "Taoiseach is accused of ‘plámásing’ Trump at White House as critics scorn housing ‘joke’",
    "description": "Sinn Féin’s Eoin Ó Broin said joking about homes crisis was never ‘a good answer’",
    "link": "https://www.irishtimes.com/politics/2025/03/12/taoiseach-is-accused-of-plamasing-trump-at-white-house-as-critics-scorn-housing-joke/",
    "timestamp": "2025-03-12T21:04:18Z"
  },
  {
    "title": "Yes, Vice President JD Vance's cousin Nate fought in Ukraine for three years",
    "description": "Nate Vance spoke with several news outlets in early 2025 following JD Vance's comments about Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.snopes.com//fact-check/jd-vance-cousin-nate-fought-in-ukraine-3-years/",
    "timestamp": "2025-03-12T21:04:00Z"
  },
  {
    "title": "‘Honeymoon Over?’ CNN’s Kasie Hunt Warns Elon Musk Could Sink Trump Politically",
    "description": "\"So is the whiplash of the past few weeks finally destroying this image Americans have of Donald Trump.\"\nThe post ‘Honeymoon Over?’ CNN’s Kasie Hunt Warns Elon Musk Could Sink Trump Politically first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/honeymoon-over-cnns-kasie-hunt-warns-elon-musk-could-sink-trump-politically/",
    "timestamp": "2025-03-12T21:03:39Z"
  },
  {
    "title": "Coincidence or quid pro quo? After Donald Trump says he’ll buy a Tesla, reports surface of Elon Musk’s $100 million MAGA Super PAC donations",
    "description": "Donald Trump publicly showed support for Elon Musk, coinciding with reports of Musk planning to donate $100 million to MAGA super PACs. This timing raised speculation about their relationship, especially as Tesla faced backlash. Trump praised Musk, calling hi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/coincidence-or-quid-pro-quo-after-donald-trump-says-hell-buy-a-tesla-reports-surface-of-elon-musks-100-million-maga-super-pac-donations/articleshow/118949387.cms",
    "timestamp": "2025-03-12T21:02:38Z"
  },
  {
    "title": "Judge temporarily blocks parts of Trump's executive order seeking to punish law firm Perkins Coie",
    "description": "A federal judge has temporarily blocked President Donald Trump’s administration from enforcing portions of an executive order designed to punish a prominent law firm linked to Democratic-funded opposition research during the 2016 presidential campaign ...",
    "link": "https://abcnews.go.com/US/wireStory/judge-temporarily-blocks-parts-trumps-executive-order-seeking-119731982",
    "timestamp": "2025-03-12T21:02:21Z"
  },
  {
    "title": "The battle for Kursk: How Russian soldiers crushed Ukrainian defenses in Sudzha",
    "description": "The rapid offensive, which sent the Ukrainian Armed Forces into flight, was a triumph for the Russian army Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614101-russians-liberated-sudzha-kursk/",
    "timestamp": "2025-03-12T21:01:45Z"
  },
  {
    "title": "Federal Judge References Mahmoud Khalil at Trump Executive Order Hearing",
    "description": "A federal judge on Wednesday referenced the recent arrest of Columbia University graduate Mahmoud Khalil during an unrelated hearing on an executive order from President Donald Trump.\nThe Context\nKhalil was arrested by federal authorities on Saturday night at…",
    "link": "https://biztoc.com/x/2c377e004a88ed8e",
    "timestamp": "2025-03-12T21:01:42Z"
  },
  {
    "title": "Steve Bannon's Brand of Populism Finds Unlikely Support From Gavin Newsom",
    "description": "Steve Bannon, the architect of the MAGA movement that has delivered Donald Trump to the White House twice, believes the right-wing \"economic populism\" that he embraces is starting to gain traction among leading Democrats looking for a way out of the political…",
    "link": "https://biztoc.com/x/e8e7886f5097462b",
    "timestamp": "2025-03-12T21:01:41Z"
  },
  {
    "title": "‘In DOGE we trust’: House GOP embraces Trump and Musk’s efforts to cut government",
    "description": "The Republicans who control Congress and the White House are governing at lightning speed — over the dismantling of the very government itself.",
    "link": "https://www.pbs.org/newshour/politics/in-doge-we-trust-house-gop-embraces-trump-and-musks-efforts-to-cut-government",
    "timestamp": "2025-03-12T21:01:13Z"
  },
  {
    "title": "Trump tariff threats are pushing Canada's largest oil producer to break its dependence on the U.S.",
    "description": "Alberta Premier Danielle Smith said the oil-producing region could look beyond the U.S. for customers if Trump's tariff threats create uncertainty.",
    "link": "https://www.cnbc.com/2025/03/12/trump-tariff-threats-are-pushing-canadas-largest-oil-producer-to-break-its-dependence-on-the-us-.html",
    "timestamp": "2025-03-12T21:01:09Z"
  },
  {
    "title": "Has the stock market learned its lesson yet on underestimating Donald Trump?",
    "description": "Kevin Yin is a contributing columnist for The Globe and Mail and an economics doctoral student at the University of California, Berkeley.\nU.S. equities have lost more than US$4-trillion in value after the administration of Donald Trump declined to rule out re…",
    "link": "https://biztoc.com/x/5d835e1e09ba3f7d",
    "timestamp": "2025-03-12T21:00:50Z"
  },
  {
    "title": "EPA head says he'll roll back dozens of environmental regulations, including rules on climate change",
    "description": "The head of the Environmental Protection Agency has announced a series of actions to roll back landmark environmental regulations, including rules on pollution from coal-fired power plants, climate change and electric vehicles.",
    "link": "https://www.news4jax.com/business/2025/03/12/epa-head-says-hell-roll-back-dozens-of-environmental-regulations-including-rules-on-climate-change/",
    "timestamp": "2025-03-12T21:00:46Z"
  },
  {
    "title": "Canada calls for unity, push back on U.S. tariffs as G7 ministers gather in Quebec",
    "description": "Melanie Joly is welcoming counterparts from the world's most powerful countries as Ottawa works to maintain unity with G7 partners. Read on",
    "link": "https://financialpost.com/news/canada-calls-for-unity-push-back-on-tariffs-g7",
    "timestamp": "2025-03-12T21:00:40Z"
  },
  {
    "title": "Trump tariff threats are pushing Canada's largest oil producer to break its dependence on the U.S",
    "description": "HOUSTON — The deeply integrated North American oil and gas market stands at crossroads, with Canada's largest oil producer warning that it will diversify its exports away from the United States if President Donald Trump's tariff threats do not end.\nAlberta Pr…",
    "link": "https://biztoc.com/x/97748da49521ddb2",
    "timestamp": "2025-03-12T21:00:34Z"
  },
  {
    "title": "Federal Judge References Mahmoud Khalil at Trump Executive Order Hearing",
    "description": "U.S. District Judge Beryl Howell referenced Khalil during an unrelated hearing on Trump's order targeting law firm Perkins Coie.",
    "link": "https://www.newsweek.com/judge-beryl-howell-mahmoud-khalil-arrest-perkins-coie-2043823",
    "timestamp": "2025-03-12T21:00:11Z"
  },
  {
    "title": "USA Tariffs Prompt Criticism at Houston Energy Industry Gathering",
    "description": "During an all-Canadian energy panel at the CERAWeek by S&P Global event in Houston, speakers veered between venting frustration and anger at the tariffs and urging fellow Canadians to seek new, alternative trading partners to the US.",
    "link": "https://www.rigzone.com/news/wire/usa_tariffs_prompt_criticism_at_houston_energy_industry_gathering-12-mar-2025-179901-article/",
    "timestamp": "2025-03-12T21:00:00Z"
  },
  {
    "title": "Iran rejects nuclear talks as UAE delivers Trump's letter",
    "description": "The US president says he has proposed talks on a deal to prevent Iran acquiring nuclear weapons and to avert military action.",
    "link": "https://www.bbc.com/news/articles/c5y02jexjxxo",
    "timestamp": "2025-03-12T20:58:48Z"
  },
  {
    "title": "Trump blasts Ireland on trade during traditional visit",
    "description": "It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual US trip to mark Saint Patrick’s Day — a dressing down from Donald Trump on trade and tariffs. “We do have a massive deficit with Ireland,” the US president said in a…",
    "link": "https://www.digitaljournal.com/world/trump-blasts-ireland-on-trade-during-traditional-visit/article",
    "timestamp": "2025-03-12T20:57:21Z"
  },
  {
    "title": "Trump Blasts Ireland On Trade During Traditional Visit",
    "description": "It was perhaps not the welcome Irish Prime Minister Micheal Martin had hoped for on an annual US trip to mark Saint Patrick's Day -- a dressing down from Donald Trump on trade and tariffs.",
    "link": "https://www.ibtimes.com/trump-blasts-ireland-trade-during-traditional-visit-3766084",
    "timestamp": "2025-03-12T20:57:21Z"
  }
]