[
  {
    "title": "Victim in Epstein case decries ‘political warfare’ in effort to release grand jury transcripts | CNN Politics",
    "description": "Two victims of Jeffrey Epstein’s abuse have filed letters to the court condemning the Justice Department’s request to unseal grand jury testimony and cited the lack of respect they feel has been showed toward them by President Donald Trump and his administrat…",
    "link": "https://www.cnn.com/2025/08/04/politics/epstein-victims-statements-grand-jury",
    "timestamp": "2025-08-04T20:17:03Z"
  },
  {
    "title": "If You Hold a Rally and No One Comes …",
    "description": "What has happened to Trump Derangement Syndrome? Has there been some new cure discovered or are we just developing herd immunity? Saturday, Aug. 2, was... Read More\nThe post If You Hold a Rally and No One Comes … appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/04/if-you-hold-a-rally-and-no-one-comes/",
    "timestamp": "2025-08-04T20:16:48Z"
  },
  {
    "title": "Forget the Space Force! Trump needs to create a Cyber Force, says think tank",
    "description": "One new military branch per term would have to be some sort of record\nThe US Space Force won't be the only new military branch Donald Trump has created if forthcoming recommendations from a group of retired military and civilian leadership end up being adopte…",
    "link": "https://biztoc.com/x/55ee10fdb8ea1d79",
    "timestamp": "2025-08-04T20:15:54Z"
  },
  {
    "title": "It Seems Like The President Who Brags About How Smart He Is Cannot Do Arithmetic",
    "description": "Trump repeated his mystifying claim that he is reducing drug prices by “1500%.”",
    "link": "https://www.huffpost.com/entry/trump-trouble-with-percents_n_68910579e4b0da7485d50c8f",
    "timestamp": "2025-08-04T20:15:50Z"
  },
  {
    "title": "Sydney Sweeney Viciously Heckled At An Event Over 'Racist' American Eagle Ad",
    "description": "Sydney Sweeney has continued to face backlash over her controversial American Eagle ad. The actress was most recently heckled by a female while attending the premiere of her film \"Americana,\" according to reports Sydney Sweeney has remained silent in the face…",
    "link": "https://freerepublic.com/focus/f-chat/4332644/posts",
    "timestamp": "2025-08-04T20:13:52Z"
  },
  {
    "title": "Commentary: How the US Weaponised Pakistan Against India",
    "description": "Many in New Delhi welcomed President Donald Trump’s return to power, expecting him to take the Indo-US relationship to new heights. They must wonder where it all went wrong, given that Trump launched an unprecedented broadside against India this week – threat…",
    "link": "https://freerepublic.com/focus/f-news/4332642/posts",
    "timestamp": "2025-08-04T20:13:20Z"
  },
  {
    "title": "Democrat Voter Drop in PA Shrinks Party Advantage Ahead of 2026",
    "description": "Despite President Donald Trump’s 1.71-point victory in Pennsylvania in 2024, newly released voter registration data from Decision Desk HQ shows Democrats barely maintaining their lead, now just 59,135 voters, as their numbers plummet heading into the 2026 mid…",
    "link": "https://www.breitbart.com/politics/2025/08/04/democrat-voter-drop-in-pa-shrinks-party-advantage-ahead-of-2026/",
    "timestamp": "2025-08-04T20:12:05Z"
  },
  {
    "title": "All major Las Vegas Strip casinos are unionized, defying the national trend",
    "description": "The Culinary Workers Union representing 60,000 hospitality workers in Nevada has achieved a historic victory on the Las Vegas Strip. For the first time in its 90-year history, all major casinos on the Strip are unionized.",
    "link": "https://www.pbs.org/newshour/nation/all-major-las-vegas-strip-casinos-are-unionized-defying-the-national-trend",
    "timestamp": "2025-08-04T20:09:39Z"
  },
  {
    "title": "Were you expecting a Social Security COLA this year? hahahahaha... Sorry about that. We've fired all the math people responsible for making those calculations. Better luck next election [Scary]",
    "description": "Were you expecting a Social Security COLA this year? hahahahaha... Sorry about that. We've fired all the math people responsible for making those calculations. Better luck next election",
    "link": "https://www.fark.com/comments/13765256/Were-you-expecting-a-Social-Security-COLA-this-year-hahahahaha-Sorry-about-that-Weve-fired-all-math-people-responsible-for-making-those-calculations-Better-luck-next-election",
    "timestamp": "2025-08-04T20:08:17Z"
  },
  {
    "title": "The right has filled a void on antisemitism – leaving the Jewish left without a language to talk about it",
    "description": "Left-wing Jewish political journalist Rachel Shabi delivers a nuanced take on antisemitism, legitimate criticism of Israel and the role of race and colonialism.",
    "link": "https://theconversation.com/the-right-has-filled-a-void-on-antisemitism-leaving-the-jewish-left-without-a-language-to-talk-about-it-261105",
    "timestamp": "2025-08-04T20:07:55Z"
  },
  {
    "title": "Forget the Space Force! Trump needs to create a Cyber Force, says think tank",
    "description": "One new military branch per term would have to be some sort of record\nThe US Space Force won't be the only new military branch Donald Trump has created if forthcoming recommendations from a group of retired military and civilian leadership end up being adopte…",
    "link": "https://www.theregister.com/2025/08/04/think_tank_military_cyber_force/",
    "timestamp": "2025-08-04T20:07:49Z"
  },
  {
    "title": "Exclusive-Fed's Daly says time is nearing for rate cuts, may need more than two",
    "description": "(Reuters) -San Francisco Federal Reserve Bank President Mary Daly on Monday said that given mounting evidence that the U.S. job market is softening and no...",
    "link": "https://finance.yahoo.com/news/exclusive-feds-daly-says-time-200727156.html",
    "timestamp": "2025-08-04T20:07:27Z"
  },
  {
    "title": "​Registered Republican Sydney Sweeney roasted for red carpet look: 'Her gays hate her'",
    "description": "The Euphoria actress took some fashion flak following her controversial American Eagle \"great jeans\" campaign.",
    "link": "https://www.out.com/celebs/sydney-sweeney-registered-republican-red-carpet",
    "timestamp": "2025-08-04T20:06:27Z"
  },
  {
    "title": "Jasmine Crockett claims Trump is a 'piece of ****,' demands 'ethics guardrails' for Supreme Court",
    "description": "\"Listen, Donald Trump is a piece of ****, okay? We know that. Yes, yes, he is. But in a functioning democracy, he still would not be able to get away with this.\" =========================================================================== At a rally in Arizona…",
    "link": "https://freerepublic.com/focus/f-bloggers/4332640/posts",
    "timestamp": "2025-08-04T20:05:23Z"
  },
  {
    "title": "Trump, Stubb talk Ukraine peace, security cooperation",
    "description": "Finnish President Alexander Stubb said on Monday that he had a \"productive phone call\" with US President Donald Trump, during which the two leaders discussed the ongoing war in Ukraine and the path to...",
    "link": "https://biztoc.com/x/7acb76c3ff127706",
    "timestamp": "2025-08-04T20:04:44Z"
  },
  {
    "title": "Poop showdown! Furious farmers drench squatters with manure to reclaim their land - video goes viral",
    "description": "French farmers in Hautes-Vosges used tractors to spray manure on squatters. They claimed the squatters illegally occupied their land. Farmers alleged they received no help from the police. A similar incident happened in the United Kingdom. A farmer there soak…",
    "link": "https://economictimes.indiatimes.com/news/international/us/poop-showdown-furious-farmers-drench-squatters-with-manure-to-reclaim-their-land-video-goes-viral/articleshow/123104071.cms",
    "timestamp": "2025-08-04T20:04:44Z"
  },
  {
    "title": "House Dems Trash America At Radical Summit In Mexico",
    "description": "Several Democrats traveled to Mexico for a summit aimed at challenging U.S. global dominance, organized by the director of an openly anti-American group.",
    "link": "https://dailycaller.com/2025/08/04/house-dems-trash-america-radical-left-wing-summit-mexico-city/",
    "timestamp": "2025-08-04T20:04:37Z"
  },
  {
    "title": "DOJ launching grand jury investigation into Russiagate conspiracy allegations: sources",
    "description": "Bondi directed her staff to act on the criminal referral from Director of National Intelligence Tulsi Gabbard related to the alleged conspiracy to tie President Donald Trump to Russia, and the Department of Justice is now opening a grand jury investigation in…",
    "link": "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations-source",
    "timestamp": "2025-08-04T20:04:27Z"
  },
  {
    "title": "Now That They’re Free: Venezuelan Men Sent To CECOT On What They Endured",
    "description": "This story was originally published by ProPublica, along with The Texas Tribune, Alianza Rebelde Investiga, and Cazadores de Fake News. Republished under ProPublica’s CC BY-NC-ND 3.0 license. Now that he’s free, Leonardo José Colmenares Solórzano, a 31-year-o…",
    "link": "https://www.techdirt.com/2025/08/04/now-that-theyre-free-venezuelan-men-sent-to-cecot-on-what-they-endured/",
    "timestamp": "2025-08-04T20:03:13Z"
  },
  {
    "title": "MAGA Melts Down After Jasmine Crockett Calls Trump a “Piece of S***”",
    "description": "Representative Jasmine Crockett has struck a nerve in the MAGA-verse after calling President Trump a “piece of shit” at a Sunday event by the progressive group MoveOn.The Texas representative spoke about the need for Democrats to get “aggressive” with their r…",
    "link": "https://newrepublic.com/post/198797/maga-jasmine-crockett-trump-piece-shit",
    "timestamp": "2025-08-04T20:02:33Z"
  },
  {
    "title": "Confirmed Liar Jeremy Ben-Ami of Soros-Backed J Street Joins Team 'Genocide'",
    "description": "Jeremy Ben-Ami, the leader of the far-left, George Soros-backed J Street, who lied for years about whether his group had taken money from the billionaire, now says Israel's war of self-defense in Gaza is a \"genocide.\"\nThe post Confirmed Liar Jeremy Ben-Ami of…",
    "link": "https://www.breitbart.com/middle-east/2025/08/04/confirmed-liar-jeremy-ben-ami-of-soros-backed-j-street-joins-team-genocide/",
    "timestamp": "2025-08-04T20:02:11Z"
  },
  {
    "title": "EU concedes to President Trump; will delay planned U.S. tariffs for six months",
    "description": "The European Union will pause its planned countermeasures against President Donald Trump’s tariffs, originally scheduled to start…\nThe post EU concedes to President Trump; will delay planned U.S. tariffs for six months appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/04/eu-concedes-to-president-trump-will-delay-planned-u-s-tariffs-for-six-months/",
    "timestamp": "2025-08-04T20:00:12Z"
  },
  {
    "title": "McConnell legacy comes under fire in Kentucky race to replace him in Senate...",
    "description": null,
    "link": "https://apnews.com/article/mitch-mcconnell-nate-morris-kentucky-senate-campaign-1df56e3f0680c3782ef014d8da0e6c9e",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Ex-football coach entering Georgia race...",
    "description": "Dooley's campaign is betting on his newcomer status to appeal to voters.",
    "link": "https://abcnews.go.com/Politics/former-football-coach-derek-dooley-entering-georgia-senate/story?id=124326644",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Trump just debunked his own lie—and it should get him sued",
    "description": "Walmart, Apple , and Amazon, the most successful companies\r\n in the U.S., base their corporate strategies on data: consumer behavior data, market research, financial, product, and competitive analysis data. Any CEO who deliberately relied on falsified data, o…",
    "link": "https://www.rawstory.com/raw-investigates/trump-2673857218/",
    "timestamp": "2025-08-04T20:00:03Z"
  },
  {
    "title": "Tankers Deliver Russian Crude to India Despite USA and EU Pressure",
    "description": "At least four tankers discharged millions of barrels of Russian crude at Indian refineries at the weekend.",
    "link": "https://www.rigzone.com/news/wire/tankers_deliver_russian_crude_to_india_despite_usa_and_eu_pressure-04-aug-2025-181362-article/",
    "timestamp": "2025-08-04T20:00:00Z"
  },
  {
    "title": "Home battery sales are booming, but Tesla is fast losing market share",
    "description": "After surrendering its dominance of Australian electric vehicle sales, Tesla is also now also rapidly losing ground in the home battery market.",
    "link": "https://www.abc.net.au/news/science/2025-08-05/teslas-share-of-home-battery-market-plummeting-as-sales-boom/105596408",
    "timestamp": "2025-08-04T20:00:00Z"
  },
  {
    "title": "Saquon Barkley declines White House sports council invite; 'shocked' by President Donald Trump's mention",
    "description": "Barkley explained his decision to decline the president's invite",
    "link": "https://www.cbssports.com/nfl/news/saquon-barkley-declines-white-house-sports-council-invite-shocked-by-president-donald-trumps-mention/",
    "timestamp": "2025-08-04T19:59:27Z"
  },
  {
    "title": "Texas Gov. Greg Abbott says Democrats have ‘forfeited’ offices by fleeing state",
    "description": "Republican Texas Gov. Greg Abbott says he will begin trying to remove Democratic lawmakers from office Monday if they do not return after dozens of them left the state in an attempt to block the adoption of redrawn U.S. House maps sought by President Donald T…",
    "link": "https://www.bostonherald.com/2025/08/04/texas-gov-says-dems-have-forfeited-offices/",
    "timestamp": "2025-08-04T19:59:26Z"
  },
  {
    "title": "India brushes off Trump tariff threat over Russian oil",
    "description": "India has pushed back against US President Donald Trump's threat to impose higher tariffs on Indian goods. New Delhi condemned Western criticism of its buying oil from Moscow, vowing to protect its national interests.",
    "link": "https://www.dw.com/en/india-brushes-off-trump-tariff-threat-over-russian-oil/a-73528185",
    "timestamp": "2025-08-04T19:58:00Z"
  },
  {
    "title": "U.S. tariffs put 30,000 South African jobs at risk, officials say",
    "description": "South African authorities have warned that U.S. reciprocal tariffs could put an estimated 30,000 jobs at risk. The U.S. plans to impose a 30% tariff on South African goods, creating uncertainty for export industries.",
    "link": "https://www.pbs.org/newshour/world/u-s-tariffs-put-30000-south-african-jobs-at-risk-officials-say",
    "timestamp": "2025-08-04T19:57:08Z"
  },
  {
    "title": "Jasmine Crockett Says Trump May Be A ‘Piece Of S**t’ — But He’s Not The Only Problem",
    "description": "While her contempt for the president was clear, Crockett told Democrats why he's not the only threat to democracy.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-trump-supreme-court_n_6890d474e4b0ef7cc79e1dbc",
    "timestamp": "2025-08-04T19:56:57Z"
  },
  {
    "title": "Crowd erupts as Jasmine Crockett lets fly with profanity-laced anti-Trump tirade",
    "description": "Rep. Jasmine Crockett (D-TX) got the crowd going at a progressive event over the weekend when she launched into President Donald Trump with a profanity-laced attack, according to The Daily Beast.Speaking at a MoveOn event in Arizona, the Texas congresswoman d…",
    "link": "https://www.rawstory.com/jasmine-crockett-2673857890/",
    "timestamp": "2025-08-04T19:56:44Z"
  },
  {
    "title": "Historian: Trump wrong to bring back ‘problematic’ Presidential Fitness Test | The College Fix",
    "description": "Historian: Trump wrong to bring back ‘problematic’ Presidential Fitness Test | The College Fixthecollegefix.com",
    "link": "https://www.thecollegefix.com/historian-trump-wrong-to-bring-back-problematic-presidential-fitness-test/",
    "timestamp": "2025-08-04T19:52:28Z"
  },
  {
    "title": "Argentina’s Milei vetoes pension and disability spending increases, citing fiscal deficit pledge",
    "description": "BUENOS AIRES, Argentina (AP) — Libertarian President Javier Milei on Monday vetoed an attempt to increase spending on pensions in Argentina and a law expanding protections for people with disabilities, saying the legislation would have undermined his flagship…",
    "link": "https://financialpost.com/pmn/milei-vetoes-pension-and-disability-spending-increases-citing-fiscal-deficit-pledge",
    "timestamp": "2025-08-04T19:51:00Z"
  },
  {
    "title": "'Let's just be clear!' CNN host gets stern as former Trump official protests fact check",
    "description": "Economist Stephen Moore, who served as senior economic advisor during Donald Trump's first term, appeared on CNN to support the president's claim that the latest job report put out by the Bureau of Labor Statistics was \"rigged\" against him.Trump fired BLS hea…",
    "link": "https://www.rawstory.com/jobs-report-2673858124/",
    "timestamp": "2025-08-04T19:50:50Z"
  },
  {
    "title": "The Making of Mamdani",
    "description": "A close reading of a new book by New York politician Zohran Mamdani’s father reveals a generational yearning for community and inclusion.",
    "link": "http://foreignpolicy.com/2025/08/04/zohran-mahmood-mamdani-new-york-mayoral-race-politics-book/",
    "timestamp": "2025-08-04T19:49:15Z"
  },
  {
    "title": "Milei vetoes pension and disability spending increases, citing fiscal deficit pledge",
    "description": "Libertarian President Javier Milei on Monday vetoed an attempt to increase spending on pensions in Argentina and a law expanding protections for people with ...",
    "link": "https://www.yahoo.com/news/articles/milei-vetoes-pension-disability-spending-194746491.html",
    "timestamp": "2025-08-04T19:47:46Z"
  },
  {
    "title": "Trump's tariff power grab barrels toward Supreme Court",
    "description": "Legal experts predict Supreme Court appeal in case challenging President Donald Trump's use of IEEPA to impose sweeping tariffs on U.S. trading partners.",
    "link": "https://www.foxnews.com/politics/trumps-tariff-power-grab-barrels-toward-supreme-court",
    "timestamp": "2025-08-04T19:47:05Z"
  },
  {
    "title": "Mitch McConnell’s legacy comes under fire in Kentucky Senate race to replace him",
    "description": "Towering over Kentucky politics for decades, McConnell is regarded as the master strategist behind the GOP’s rise to power in a state long dominated by Democrats.",
    "link": "https://www.pbs.org/newshour/politics/mitch-mcconnells-legacy-comes-under-fire-in-kentucky-senate-race-to-replace-him",
    "timestamp": "2025-08-04T19:47:01Z"
  },
  {
    "title": "New Mexico stays the course in climate change regulation policies amid federal priority shifts (Follows CA lead down the rabbit hole)",
    "description": "New Mexico’s clean energy and environmental advocates are recoiling from energy policy shifts set in motion by the Trump administration this week, including the possible rollback of a major scientific finding about climate change and the delay of rules regula…",
    "link": "https://freerepublic.com/focus/f-chat/4332637/posts",
    "timestamp": "2025-08-04T19:45:51Z"
  },
  {
    "title": "Trump Mega-Bill Total Cost Skyrockets to Add Staggering $4.1 TRILLION to Debt: CBO Analysis",
    "description": "Trump’s One Big Beautiful Bill Act will actually add over $4 trillion to the deficit, some $700 billion more than previously estimated.\nThe post Trump Mega-Bill Total Cost Skyrockets to Add Staggering $4.1 TRILLION to Debt: CBO Analysis first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/trump-mega-bill-total-cost-skyrockets-to-add-staggering-4-1-trillion-to-debt-cbo-analysis/",
    "timestamp": "2025-08-04T19:45:48Z"
  },
  {
    "title": "Team Trump Calls Biographer 'Lying Sack of S---' Who 'Routinely Fabricates Stories' From 'His Peanut-sized Brain' — After 'Fraud' Writer Suggested Prez Ranted He ‘Didn't Have Epstein Killed'",
    "description": "Donald Trump's handlers are once again defending the controversial president over the most recent claim about his connection to pedophile Jeffrey Epstein.",
    "link": "https://radaronline.com/p/trump-michael-wolff-epstein-fabricates-stories-steven-cheung/",
    "timestamp": "2025-08-04T19:45:00Z"
  },
  {
    "title": "Sore-Loser Democrats Fueled Trump-Hating Russia Hoax",
    "description": "The U.S. Justice Department is 100% justified to conduct a criminal investigation of Obama, former CIA directors John Brennan and James Clapper, former FBI Director... Read More\nThe post Sore-Loser Democrats Fueled Trump-Hating Russia Hoax appeared first on T…",
    "link": "https://www.dailysignal.com/2025/08/04/sore-loser-democrats-fueled-trump-hating-russia-hoax/",
    "timestamp": "2025-08-04T19:44:28Z"
  },
  {
    "title": "US stock market rally explodes: Dow soars 500 points, S&P 500 & Nasdaq roar back as Microsoft, Nvidia, Apple, Palantir surge—weak jobs report fuels Fed cut buzz, Trump fires BLS chief in shock move",
    "description": "Stock market rally today has captured Wall Street’s attention as the Dow Jones jumped 500 points, with the S&P 500 and Nasdaq also posting strong gains. This sharp rebound follows a weak U.S. payroll report, which has increased hopes for Federal Reserve rate …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-rally-explodes-dow-soars-500-points-sp-500-nasdaq-roar-back-as-microsoft-nvidia-apple-palantir-surgeweak-jobs-report-fuels-fed-cut-buzz-trump-fires-bls-chief-in-shock-move/articleshow/123103923.cms",
    "timestamp": "2025-08-04T19:44:13Z"
  },
  {
    "title": "Trump mocked after defying basic math: ‘Utterly innumerate’",
    "description": "President Donald Trump left social media users baffled after he claimed on Sunday that he had lowered prescription drug prices by up to 1,500%.\nWhile in Allentown, Pennsylvania, Trump told reporters that Republicans will turn their attention to the “tremendou…",
    "link": "https://biztoc.com/x/02bfef7611d99c3f",
    "timestamp": "2025-08-04T19:41:52Z"
  },
  {
    "title": "The Case for Retaining Faith in Courts That Trump Is Slowly Corrupting",
    "description": "These three judges give reason for hope.",
    "link": "https://slate.com/news-and-politics/2025/08/trump-corruption-emil-bove-vs-good-judges.html",
    "timestamp": "2025-08-04T19:41:38Z"
  },
  {
    "title": "White House anticipates 'ultimate victory' against child sex-change regime despite Letitia James-led lawsuit",
    "description": "President Donald Trump declared war on gender ideology and the corresponding child sex-change regime upon retaking office. Despite the efforts of non-straight activists and overreaching federal judges, the campaign is off to a great start.Pursuant to the pres…",
    "link": "https://www.theblaze.com/news/white-house-anticipates-ultimate-victory-against-child-sex-change-regime-despite-letitia-james-led-lawsuit",
    "timestamp": "2025-08-04T19:40:00Z"
  },
  {
    "title": "Champagne, Anand travelling to Mexico to strengthen Canada's trade ties: sources",
    "description": "Finance Minister François-Philippe Champagne says he and Foreign Affairs Minister Anita Anand will be travelling to Mexico City to look at strengthening Canada’s economic partnership with Mexico.",
    "link": "https://www.cbc.ca/news/politics/champagne-anand-travelling-to-mexico-to-strengthen-canada-s-trade-ties-sources-1.7601077",
    "timestamp": "2025-08-04T19:39:59Z"
  },
  {
    "title": "Champagne, Anand travelling to Mexico to strengthen Canada's trade ties",
    "description": "Finance Minister François-Philippe Champagne says he and Foreign Affairs Minister Anita Anand will travel to Mexico City to look at strengthening Canada’s economic partnership with Mexico.",
    "link": "https://www.cbc.ca/news/politics/champagne-anand-mexico-trip-1.7601077",
    "timestamp": "2025-08-04T19:39:59Z"
  },
  {
    "title": "Oil Slips on Fresh OPEC+ Barrels",
    "description": "Oil fell as traders weighed OPEC+'s supply hike and Trump's renewed tariff threats against India.",
    "link": "https://www.rigzone.com/news/wire/oil_slips_on_fresh_opec_barrels-04-aug-2025-181366-article/",
    "timestamp": "2025-08-04T19:38:18Z"
  },
  {
    "title": "Jeffries: Texas Redistricting an Effort 'Steal the Midterm Elections'",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) said Monday on MSNBC's \"Ana Cabrera Reports\" that Republicans in Texas are attempting to steal the 2026 midterm elections with their redistricting effort.\nThe post Jeffries: Texas Redistricting an Effort ‘Steal the…",
    "link": "https://www.breitbart.com/clips/2025/08/04/jeffries-texas-redistricting-an-effort-steal-the-midterm-elections/",
    "timestamp": "2025-08-04T19:35:55Z"
  },
  {
    "title": "Who is Yeonsoo Go? South Korean student and a priest’s daughter detained by US immigration officials",
    "description": "Yeonsoo Go, a South Korean student, was detained by ICE agents after a routine immigration court visit in New York. The arrest of the 20-year-old, who was in the process of switching to a student visa, has sparked protests. Supporters are demanding her releas…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-yeonsoo-go-south-korean-student-and-a-priests-daughter-detained-by-us-immigration-officials/articleshow/123103982.cms",
    "timestamp": "2025-08-04T19:35:21Z"
  },
  {
    "title": "Trump's sons launch investment vehicle to target a US manufacturer (George Steer/Financial Times)",
    "description": "George Steer / Financial Times:\nTrump's sons launch investment vehicle to target a US manufacturer  —  Blank cheque firm will look for companies able to benefit from federal tax credits or contracts  —  Eric Trump and Donald Trump Jr are backing a new blank c…",
    "link": "https://www.memeorandum.com/250804/p82",
    "timestamp": "2025-08-04T19:35:00Z"
  },
  {
    "title": "American Eagle Stock Jumps 23% After Trump Praises Controversial Sydney Sweeney Ad",
    "description": "Trump also slammed billionaire singer Taylor Swift, luxury vehicle company Jaguar and beer brand Bud Light, all of which he called “woke.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/04/american-eagle-stock-jumps-23-after-trump-praises-controversial-sydney-sweeney-ad/",
    "timestamp": "2025-08-04T19:34:27Z"
  },
  {
    "title": "Warren: 'Would-Be King' Trump Is Setting U.S. Credibility on Fire",
    "description": "Monday on CNBC's \"Squawk on the Street,\" Sen. Elizabeth Warren (D-MA) said \"would-be king\" President Donald Trump's decision to fire Erika McEntarfer as the commissioner of labor statistics was setting the United States' credibility in data collection \"on fir…",
    "link": "https://www.breitbart.com/clips/2025/08/04/warren-would-be-king-trump-is-setting-u-s-credibility-on-fire/",
    "timestamp": "2025-08-04T19:34:06Z"
  },
  {
    "title": "Israel’s Gaza aid cutoff was not only immoral. It was a strategic disaster.",
    "description": "Israel’s restrictions on humanitarian aid in Gaza are, first and foremost, a moral atrocity. Israeli policies since March, most notably the initial shutdown on aid entering the Strip, were very obviously going to cause a hunger crisis down the line. There can…",
    "link": "https://www.vox.com/world-politics/422231/israel-gaza-aid-cut-off-strategy-humanitarian-disaster",
    "timestamp": "2025-08-04T19:33:33Z"
  },
  {
    "title": "Stephen A. Smith, Charlamagne Call Out Kamala Harris For Saying ‘System’ Is ‘Broken’ After Spending Decades In It",
    "description": "ESPN's Stephen A. Smith and radio host Charlamagne Tha God criticized former Vice President Kamala Harris for complaining that “the system” was “broken.\"",
    "link": "https://dailycaller.com/2025/08/04/stephen-a-smith-charlamagne-call-kamala-harris-system-broken/",
    "timestamp": "2025-08-04T19:32:44Z"
  },
  {
    "title": "‘Trump Has Fully Betrayed America’: MAGA Stars Rage About New Law Punishing US States Over Israel",
    "description": "President Donald Trump on Monday drew the ire of MAGA loyalists when it was reported that his administration would punish any state boycotting Israel.\nThe post ‘Trump Has Fully Betrayed America’: MAGA Stars Rage About New Law Punishing US States Over Israel f…",
    "link": "https://www.mediaite.com/politics/trump-has-fully-betrayed-america-maga-stars-rage-about-new-law-punishing-us-states-over-israel/",
    "timestamp": "2025-08-04T19:31:57Z"
  },
  {
    "title": "Today in Dynastic-Corruption-Under-Mercantilism News",
    "description": "The Wall Street Journal reports that two members of the Trump Family political/financial criminal enterprise--presidential sons Eric and Donald Jr.--are \"helping to launch a SPAC targeting American manufacturers, adding to the array of companies the president…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/08/today-in-dynastic-corruption-under-mercantilism-news.html",
    "timestamp": "2025-08-04T19:31:54Z"
  },
  {
    "title": "Abbott orders arrest of AWOL Texas House Dems after warrant issued by House Speaker",
    "description": "Gov. Gregg Abbott says state Democrats who skipped town to derail a GOP-backed redistricting effort could face expulsion from office and even potential felony charges.",
    "link": "https://www.foxnews.com/politics/abbott-orders-arrest-awol-texas-house-dems-after-warrant-issued-house-speaker",
    "timestamp": "2025-08-04T19:30:55Z"
  },
  {
    "title": "AWOL Texas Dems threatened with expulsion, felony charges for absence amid redistricting battle",
    "description": "Gov. Gregg Abbott says state Democrats who skipped town to derail a GOP-backed redistricting effort could face expulsion from office and even potential felony charges.",
    "link": "https://www.foxnews.com/politics/awol-texas-dems-threatened-expulsion-felony-charges-absence-amid-redistricting-battle",
    "timestamp": "2025-08-04T19:30:55Z"
  },
  {
    "title": "Texas Dems gone AWOL may soon be subject to arrest warrants, House Speaker says",
    "description": "Gov. Gregg Abbott says state Democrats who skipped town to derail a GOP-backed redistricting effort could face expulsion from office and even potential felony charges.",
    "link": "https://www.foxnews.com/politics/texas-dems-gone-awol-may-soon-subject-arrest-warrants-house-speaker-says",
    "timestamp": "2025-08-04T19:30:55Z"
  },
  {
    "title": "Congress is in August recess, but tensions lie ahead on spending and Trump nominations",
    "description": "Lawmakers have left Washington for the annual August recess, but a few weeks of relative quiet at the U.S. Capitol can’t mask the partisan tensions that are brewing on government funding and President Donald Trump’s nominees.",
    "link": "https://biztoc.com/x/852149e4c82b0d80",
    "timestamp": "2025-08-04T19:30:46Z"
  },
  {
    "title": "Jason Sullivan Co-Hosts Truth Matters with Tina Peters’ New Lead Attorney — Trump Lawyer Peter Ticktin",
    "description": "Source: Tina Peters’ / The Truth Matters In a powerful new episode of Tina Peters’ official show, Truth Matters, Jason Sullivan steps in to co-host for the first time — joined by none other than Trump attorney Peter Ticktin, who is now representing Tina Peter…",
    "link": "https://www.thegatewaypundit.com/2025/08/jason-sullivan-co-hosts-truth-matters-tina-peters/",
    "timestamp": "2025-08-04T19:30:26Z"
  },
  {
    "title": "Conor McGregor launches petition in attempt to get on ballot to run for President of Ireland",
    "description": "Conor McGregor is hoping a public campaign could lead to changes in procedure in his home nation of Ireland so he can actually run for president.",
    "link": "https://www.mmafighting.com/2025/8/4/24480892/conor-mcgregor-launches-petition-in-attempt-to-get-on-ballot-to-run-for-president-of-ireland",
    "timestamp": "2025-08-04T19:30:00Z"
  },
  {
    "title": "EXCLUSIVE: ABC Scrambles to Launch Investigation into 'The View' and How Show Bosses Were Able to Book 102 Liberal Guests and No Conservatives — as Gabfest is Mocked as 'One-Sided Political Soapbox'",
    "description": "ABC wants to know how 'The View' booked more than 100 liberal guests and zero conservatives amid a 'credibility issue' with the lefty show.",
    "link": "https://radaronline.com/p/abc-investigating-the-view-liberal-guests-no-conservatives/",
    "timestamp": "2025-08-04T19:30:00Z"
  },
  {
    "title": "Trump Melts Down Over ‘Crazed Lunatic’ Democrats In Escalating Confirmation Feud",
    "description": "The president accused Senate Democrats of using confirmations of more than 150 of his nominees as leverage for funding deals.",
    "link": "https://www.huffpost.com/entry/trump-lunatic-democrats-truth-social_n_6890c952e4b0f640c371dd81",
    "timestamp": "2025-08-04T19:28:09Z"
  },
  {
    "title": "St. Louis Fan Removal for MAGA Hat Ignites Debate Over Free Speech",
    "description": "Michael Weitzel was ejected for violating the club’s fan code of conduct, which prohibits “threatening, abusive, or discriminatory\" symbols and language.",
    "link": "https://reason.com/2025/08/04/st-louis-fan-removal-for-maga-hat-ignites-debate-over-free-speech/",
    "timestamp": "2025-08-04T19:27:57Z"
  },
  {
    "title": "Congress is in August recess, but tensions lie ahead on spending and Trump nominations",
    "description": "Lawmakers have left Washington for the annual August recess, but a few weeks of relative quiet at the U.S. Capitol can’t mask the partisan tensions that are brewing on government funding and President Donald Trump’s nominees.",
    "link": "https://www.pbs.org/newshour/politics/congress-is-in-august-recess-but-tensions-lie-ahead-on-spending-and-trump-nominations",
    "timestamp": "2025-08-04T19:27:44Z"
  },
  {
    "title": "Largest Texas Newspaper Rebukes Greg Abbott Over Redistricting 'Power Grab'",
    "description": "\"The lives of Texans come second to the desires of President Trump and his loyalists,\" the Houston Chronicle's editorial board wrote Monday.",
    "link": "https://www.newsweek.com/greg-abbott-texas-redistricting-gerrymandering-floods-2108753",
    "timestamp": "2025-08-04T19:27:40Z"
  },
  {
    "title": "Johnson dines with Netanyahu in landmark visit, highest US official to visit occupied West Bank",
    "description": "Mike Johnson becomes highest-ranking U.S. official to visit occupied West Bank as Israeli government advances plans for territorial sovereignty expansion",
    "link": "https://www.foxnews.com/world/johnson-dines-netanyahu-landmark-visit-highest-us-official-visit-occupied-west-bank",
    "timestamp": "2025-08-04T19:26:25Z"
  },
  {
    "title": "Jasmine Crockett unleashes fierce attack on Trump and GOP",
    "description": "Texas Representative Jasmine Crockett delivered one of the most inflammatory political speeches of the year during a weekend rally in Phoenix, launching an unprecedented verbal assault on President Donald Trump and the entire Republican establishment. The lib…",
    "link": "https://rollingout.com/2025/08/04/jasmine-crockett-unleash-attack-on-trump/",
    "timestamp": "2025-08-04T19:25:35Z"
  },
  {
    "title": "Russia backs off Medvedev rhetoric after Trump says he ordered nuke subs closer to Moscow: ‘There can be no winner in a nuclear war’",
    "description": "WASHINGTON — The Kremlin tried Monday to defuse tensions caused by remarks from one of Russia’s top officials that led President Trump to shift two nuclear submarines closer to Moscow. “As you know, Russia holds a responsible position. President Putin’s stanc…",
    "link": "https://nypost.com/2025/08/04/us-news/russia-backs-off-medvedev-rhetoric-after-trump-says-he-ordered-nuke-subs-closer-to-moscow/",
    "timestamp": "2025-08-04T19:22:10Z"
  },
  {
    "title": "Putin’s mind is ‘sick and twisted and probably not logical,’ says US envoy to NATO",
    "description": "The U.S. ambassador to NATO has said Russian President Vladimir Putin has a “sick and twisted and probably not logical” mind. American diplomat Matthew Whitaker was speaking as President Donald Trump’s deadline for Moscow to make progress toward ending the wa…",
    "link": "https://freerepublic.com/focus/f-chat/4332635/posts",
    "timestamp": "2025-08-04T19:21:44Z"
  },
  {
    "title": "Abbott threatens Democrats with bribery charges for stalling Texas vote",
    "description": "The governor's threat comes as Democratic legislators flee Texas to stall a vote on a redistricting plan that would favour Republicans.",
    "link": "https://www.bbc.com/news/articles/c93dkwnx94ro?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-04T19:21:17Z"
  },
  {
    "title": "Last Month This Month",
    "description": "All the news you may have missed in July.\n \n by The Stranger's Slog AM™️ Specialists\n \n \n \n Last Month This Month is a recap of all the previous month's news, featuring headlines from Slog AM. Find it in every issue of The Stranger! Subscribe to our daily Slo…",
    "link": "https://www.thestranger.com/last-month-this-month/2025/08/04/80180090/last-month-this-month",
    "timestamp": "2025-08-04T19:20:00Z"
  },
  {
    "title": "What does Donald Trump want from Canada? We are about to find out",
    "description": "Where do things stand for Canada after the United States imposed a new, higher tariff last Thursday evening?\nIn the short run, not much has changed. In the long run, a lot may yet change.",
    "link": "https://biztoc.com/x/9dd420c916b6f196",
    "timestamp": "2025-08-04T19:19:28Z"
  },
  {
    "title": "Ron DeSantis in the shadows as Florida Republicans toast Trump's team",
    "description": "White House Chief of Staff Susie Wiles and other members of Trump's inner circle — not Gov. Ron DeSantis — were the stars at the Florida GOP's big annual convention.",
    "link": "https://www.nbcnews.com/politics/trump-administration/ron-desantis-shadows-florida-republicans-toast-trump-team-rcna222331",
    "timestamp": "2025-08-04T19:18:49Z"
  },
  {
    "title": "Tesla awards Musk $29 billion in bid to keep him as CEO",
    "description": "Tesla said it sees Musk as a \"magnet for hiring and retaining talent\" as the company moves more towards developing AI-powered automated transport and robotics.",
    "link": "https://www.dw.com/en/tesla-awards-musk-29-billion-in-bid-to-keep-him-as-ceo/a-73528228",
    "timestamp": "2025-08-04T19:18:00Z"
  },
  {
    "title": "Tesla awards Musk $29 billion in bid to keep him as CEO",
    "description": "Tesla said it sees Musk as a \"magnet for hiring and retaining talent\" as the company moves more towards developing AI-powered automated transport and robotics. Electric auto giant Tesla granted its CEO Elon Musk shares of the company worth some $29 billion (€…",
    "link": "https://www.dw.com/en/tesla-awards-musk-29-billion-in-bid-to-keep-him-as-ceo/a-73528228",
    "timestamp": "2025-08-04T19:18:00Z"
  },
  {
    "title": "Fox News Politics Newsletter: Cornyn's 'Crooked Politicians' Crackdown",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-cornyns-crooked-politicians-crackdown",
    "timestamp": "2025-08-04T19:17:57Z"
  },
  {
    "title": "Florida’s Latest Death Penalty Innovation Is Absolutely Horrifying",
    "description": "If the law remains in place, other death penalty states may be tempted to follow suit.",
    "link": "https://slate.com/news-and-politics/2025/08/florida-worst-state-death-penalty.html",
    "timestamp": "2025-08-04T19:16:39Z"
  },
  {
    "title": "Amazon Is Laying Off Wondery Staff as It Rethinks Its Podcast Business",
    "description": "Amazon is moving some of its Wondery shows to Audible as video podcasts are taking over",
    "link": "https://gizmodo.com/amazon-is-laying-off-wondery-staff-as-it-rethinks-its-podcast-business-2000638666",
    "timestamp": "2025-08-04T19:15:40Z"
  },
  {
    "title": "Why have relations between Trump and Modi nosedived so quickly?",
    "description": "The United States slaps 25 percent tariffs on a nation long viewed as an ally.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/8/4/why-have-relations-between-trump-and-modi-nosedived-so-quickly",
    "timestamp": "2025-08-04T19:15:27Z"
  },
  {
    "title": "In his own words: Trump's comments over the past year on the jobs report",
    "description": "In firing the head of the agency that produces monthly jobs figures, President Donald Trump alleged that the recent weaker-than-expected numbers were phony...",
    "link": "https://www.yahoo.com/news/articles/own-words-trumps-comments-over-191527545.html",
    "timestamp": "2025-08-04T19:15:27Z"
  },
  {
    "title": "Israeli PM decides to fully occupy Gaza: Local media",
    "description": "Israeli Prime Minister Benjamin Netanyahu has decided to fully occupy the Gaza Strip and expand military operations in the enclave, local media said on Monday evening.",
    "link": "https://www.hurriyetdailynews.com/israeli-pm-decides-to-fully-occupy-gaza-local-media-212178",
    "timestamp": "2025-08-04T19:10:28Z"
  },
  {
    "title": "Trump envoy to visit Moscow this week before deadline for ending Ukraine war",
    "description": "Little expectation in Kyiv that Steve Witkoff will make a breakthrough with Vladimir Putin",
    "link": "https://www.irishtimes.com/world/europe/2025/08/04/trump-envoy-to-visit-moscow-this-week-before-deadline-for-ending-ukraine-war/",
    "timestamp": "2025-08-04T19:09:57Z"
  },
  {
    "title": "Fox’s Mark Levin Scolds Those ‘Obsessed With the Epstein Case’ for ‘Distracting’ From Obama-Clinton Conspiracy",
    "description": "Fox News' Mark Levin scolded those \"obsessed with\" the Jeffrey Epstein case on Sunday's edition of Life, Liberty & Levin.\nThe post Fox’s Mark Levin Scolds Those ‘Obsessed With the Epstein Case’ for ‘Distracting’ From Obama-Clinton Conspiracy first appeared on…",
    "link": "https://www.mediaite.com/media/tv/foxs-mark-levin-scolds-those-obsessed-with-the-epstein-case-for-distracting-from-obama-clinton-conspiracy/",
    "timestamp": "2025-08-04T19:09:12Z"
  },
  {
    "title": "Tesla Approves $29 Billion Payday For CEO Elon Musk",
    "description": "The company called the stock deal an “interim award” after a court struck down his last pay package, worth $50 billion, in 2018.",
    "link": "https://www.huffpost.com/entry/tesla-elon-musk-payday-29-billion_n_68910135e4b012f027be3655",
    "timestamp": "2025-08-04T19:08:11Z"
  },
  {
    "title": "Saquon Barkley ‘shocked’ to hear name on Trump’s sports council after turning it down",
    "description": "Eagles running back Saquon Barkley said he did not accept President Donald Trump’s invitation to serve on his council on sports, fitness and nutrition.",
    "link": "https://nypost.com/2025/08/04/sports/saquon-barkley-shocked-to-hear-name-on-trumps-sports-council-after-turning-it-down/",
    "timestamp": "2025-08-04T19:06:32Z"
  },
  {
    "title": "Trump’s Continuing War on Social Security",
    "description": "Despite U.S. President Donald Trump’s assurances\r\n that he will not touch Social Security (or Medicare or Medicaid for that matter), his war against Social Security marches on step by step. Politico\r\n reported last week that “Treasury Secretary Scott Bessent …",
    "link": "https://www.commondreams.org/opinion/trump-war-on-social-security",
    "timestamp": "2025-08-04T19:05:37Z"
  },
  {
    "title": "Lawsuit Aims to Change RI Policy That Allowed Teen to Socially Transition Without Mother’s Knowledge",
    "description": "She got the knife away from her daughter. The teenager looked like a “deer in headlights” after the failed suicide attempt, her mother says.   Driving... Read More\nThe post Lawsuit Aims to Change RI Policy That Allowed Teen to Socially Transition Without Moth…",
    "link": "https://www.dailysignal.com/2025/08/04/lawsuit-aims-change-ri-policy-that-allowed-daughter-socially-transition-without-mothers-knowledge/",
    "timestamp": "2025-08-04T19:05:00Z"
  },
  {
    "title": "Even Cory Booker Realizes Endorsing Mamdani Is A Ticket To Nowhere",
    "description": "Sen. Cory Booker of New Jersey refused to endorse New York City Democratic mayoral candidate Zohran Mamdani when pressed by a CNN reporter on Sunday.",
    "link": "https://dailycaller.com/2025/08/04/cory-booker-endorsing-mamdani-ticket-to-nowhere/",
    "timestamp": "2025-08-04T19:03:55Z"
  },
  {
    "title": "Hochul Will ‘Fight Fire With Fire’ Against Texas Republicans",
    "description": "Governor Kathy Hochul said New York’s leaders are exploring every option to redraw congressional districts in response to Republican gerrymandering in Texas.",
    "link": "http://nymag.com/intelligencer/article/hochul-will-fight-fire-with-fire-against-texas-republicans.html",
    "timestamp": "2025-08-04T19:03:54Z"
  },
  {
    "title": "Redistricting clash escalates in Texas after Democrats scatter",
    "description": "The Texas state House is reconvening Monday afternoon amid a nationally watched clash over the GOP majority’s plan to redraw the state’s congressional lines, with dozens of Democrats fleeing the state to deprive Republicans of the ability to proceed with the …",
    "link": "https://www.nbcnews.com/politics/2026-election/redistricting-clash-escalates-texas-democrats-scatter-republican-house-rcna222867",
    "timestamp": "2025-08-04T19:03:25Z"
  },
  {
    "title": "Bad News For Anyone Who Actually Thought Trump Was Gonna Get Them Free IVF",
    "description": "That was never going to happen.",
    "link": "https://www.wonkette.com/p/bad-news-for-anyone-who-actually",
    "timestamp": "2025-08-04T19:01:07Z"
  }
]