[
  {
    "title": "Is a weaker U.S. dollar a good thing?",
    "description": "“All things considered, the negatives outweigh the positives,” said one San Diego economist.",
    "link": "https://www.sandiegouniontribune.com/2026/02/06/is-a-weaker-u-s-dollar-a-good-thing/",
    "timestamp": "2026-02-06T12:35:27Z"
  },
  {
    "title": "Laura Benanti Returns as Melania Trump, Explains ‘Creepy’ Documentary",
    "description": "Broadway veteran Laura Benanti recently returned to The Late Show with Stephen Colbert, playing the First Lady Melania Trump. Benanti has played the role on multiple occasions in the past, and this time, she used her appearance to mock the First Lady’s new do…",
    "link": "https://www.comingsoon.net/tv/news/2093123-melania-trump-documentary-laura-benanti-stephen-colbert-late-show",
    "timestamp": "2026-02-06T12:33:10Z"
  },
  {
    "title": "Oil Markets Waver as Iran Prepares for Prolonged Nuclear Negotiations",
    "description": "Ahead of the U.S.-Iran nuclear talks on Friday, Tehran signaled that the negotiations will likely be a long process, dashing hopes of a quick and more sustainable de-escalation of tensions in the key oil-producing Middle Eastern regions.   Oil prices initiall…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Markets-Waver-as-Iran-Prepares-for-Prolonged-Nuclear-Negotiations.html",
    "timestamp": "2026-02-06T12:30:00Z"
  },
  {
    "title": "Saga Metals Acknowledges U.S. Strategic Critical Minerals Reserve “Project Vault” and Highlights Titanium’s Strategic Importance to North American Defense Supply Chains",
    "description": "Saga Metals Acknowledges U.S. Strategic Critical Minerals Reserve “Project Vault” and Highlights Titanium’s Strategic Importance to North American Defense...",
    "link": "https://www.globenewswire.com/news-release/2026/02/06/3233757/0/en/Saga-Metals-Acknowledges-U-S-Strategic-Critical-Minerals-Reserve-Project-Vault-and-Highlights-Titanium-s-Strategic-Importance-to-North-American-Defense-Supply-Chains.html",
    "timestamp": "2026-02-06T12:30:00Z"
  },
  {
    "title": "AI video shared by Trump on Truth Social triggers outrage over depiction of the Obamas",
    "description": "President Donald Trump triggered widespread backlash after sharing a manipulated video depicting Barack and Michelle Obama using racist imagery during a late-night Truth Social posting spree. The president published at least 66 posts in under two hours, rangi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ai-video-shared-by-trump-on-truth-social-triggers-outrage-over-depiction-of-the-obamas/articleshow/127989778.cms",
    "timestamp": "2026-02-06T12:29:42Z"
  },
  {
    "title": "Republicans Are Worried About The 'Optics' Of Trump’s DC Overhaul",
    "description": "“Some of these optics just make no sense,\" Sen. Thom Tillis (R-N.C.) said when asked about President Trump reshaping landmarks in the nation's capital.",
    "link": "https://www.huffpost.com/entry/trump-ballroom-arch-dc_n_69852fe0e4b0e27eef5446a6",
    "timestamp": "2026-02-06T12:28:14Z"
  },
  {
    "title": "Trump's Immigration Policy Is 100 Years Old (Jia Lynn Yang/New York Times)",
    "description": "Jia Lynn Yang / New York Times:\nTrump's Immigration Policy Is 100 Years Old … The American public is now finding out what Donald Trump and his team really meant when they promised mass deportations — the upending of communities in a ferocious effort to ferret…",
    "link": "https://www.memeorandum.com/260206/p18",
    "timestamp": "2026-02-06T12:25:01Z"
  },
  {
    "title": "France, UK Should Be Included if Russia-US Arms Control Extends to China - US Expert",
    "description": "WASHINGTON (Sputnik) – France and the United Kingdom should also be involved if a new arms control treaty between Russia and the United States extends to China, former US Army Lt. Col. Earl Rasmussen told Sputnik.",
    "link": "https://sputnikglobe.com/20260206/france-uk-should-be-included-if-russia-us-arms-control-extends-to-china---us-expert-1123599080.html",
    "timestamp": "2026-02-06T12:23:20Z"
  },
  {
    "title": "Transcript: Trump Press Sec Snaps as Spin on 2026 Rigging Threat Tanks",
    "description": "The following is a lightly edited transcript of the February 6 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. The White…",
    "link": "https://newrepublic.com/article/206231/transcript-trump-press-sec-snaps-spin-2026-rigging-threat-tanks",
    "timestamp": "2026-02-06T12:23:20Z"
  },
  {
    "title": "Europe Is Getting Ready to Pivot to Putin",
    "description": "In the face of U.S. bullying, European leaders are considering closer ties with Russia’s president.",
    "link": "http://foreignpolicy.com/2026/02/06/europe-russia-putin-trump-pivot-detente/",
    "timestamp": "2026-02-06T12:23:10Z"
  },
  {
    "title": "Maryland Man Faces Murder Charges in Plot to Kill Trump Official",
    "description": "A 26-year-old Maryland man named Colin Demarco is now in custody and charged with attempted murder after he allegedly showed up at the home of Russell Vought, the director of the Office of Management and Budget. Authorities say Demarco told agents that he was…",
    "link": "https://www.today.com/video/man-charged-with-attempted-murder-of-trump-cabinet-member-257267269539",
    "timestamp": "2026-02-06T12:22:16Z"
  },
  {
    "title": "Russia and US discussed nuclear arms and agreed talks need to start soon, Kremlin says",
    "description": "Without the treaty there are no caps on the two largest atomic arsenals for the first time in more than a half-century.",
    "link": "https://www.bostonherald.com/2026/02/06/russia-us-nuclear-talks-soon/",
    "timestamp": "2026-02-06T12:22:09Z"
  },
  {
    "title": "Trump Posts Vile Video of Obamas in Manic Late-Night Rampage (Cameron Adams/The Daily Beast)",
    "description": "Cameron Adams / The Daily Beast:\nTrump Posts Vile Video of Obamas in Manic Late-Night Rampage  —  FEED FRENZY  —  The 79-year-old president spent the night spewing out conspiracy theories.  —  President Donald Trump shared a racist video of Barack and Michell…",
    "link": "https://www.memeorandum.com/260206/p13",
    "timestamp": "2026-02-06T12:20:05Z"
  },
  {
    "title": "LG Energy Solution to buy Stellantis’s stake in Canadian EV battery joint-venture for just $100",
    "description": "LG will now have full ownership of the NextStar Energy plant in Windsor, Ont., which has received billions in government performance incentives",
    "link": "https://www.theglobeandmail.com/business/industry-news/article-lg-energy-solution-stellantis-ev-battery-nextstar-energy/",
    "timestamp": "2026-02-06T12:15:00Z"
  },
  {
    "title": "Recovering bitcoin still faces macro risks",
    "description": "The day ahead in crypto: Feb. 6, 2026",
    "link": "https://www.coindesk.com/daybook-us/2026/02/06/recovering-bitcoin-still-faces-macro-risks",
    "timestamp": "2026-02-06T12:15:00Z"
  },
  {
    "title": "IRS tax returns could be delayed this season - here's when to expect",
    "description": "IRS refund schedule 2026: The IRS says most 2026 tax refunds arrive within 21 days if filed electronically with direct deposit. The agency began accepting returns on January 26, 2026. Early filers may see refunds by early February. The average refund was $3,1…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-tax-returns-could-be-delayed-this-season-heres-when-to-expect/articleshow/127988914.cms",
    "timestamp": "2026-02-06T12:14:54Z"
  },
  {
    "title": "Edmonton-based Stantec cancels ICE facility contract after backlash",
    "description": "An Edmonton-based engineering and professional services company has pulled out of contracts with ICE after heavy backlash",
    "link": "https://edmontonjournal.com/business/edmonton-based-stantec-cancels-ice-facility-contract-after-backlash",
    "timestamp": "2026-02-06T12:14:06Z"
  },
  {
    "title": "Russia and US discussed nuclear arms and agreed talks need to start soon, Kremlin says",
    "description": "The Kremlin says Russian and U.S. negotiators have discussed the expiration of their last remaining nuclear arms pact",
    "link": "https://abcnews.go.com/International/wireStory/russia-us-discussed-nuclear-arms-agreed-talks-start-129910686",
    "timestamp": "2026-02-06T12:13:33Z"
  },
  {
    "title": "Bitcoin falls below $65,000 to wipe out ‘Trump rally’",
    "description": "Cryptocurrency returns to November 2024 level from 2025 high above $125,000 as it is swept up in tech stock sell-off",
    "link": "https://www.irishtimes.com/business/2026/02/06/bitcoin-falls-below-65000-to-wipe-out-trump-rally/",
    "timestamp": "2026-02-06T12:09:03Z"
  },
  {
    "title": "Donald Trump won’t attend the Super Bowl because he’s afraid of being booed",
    "description": "Last year, Donald Trump waddled out to the Super Bowl and his dinosaur butt got booed. He continued to attend sporting events though, and the boos just kept getting louder and louder. Well, last week, Trump was asked if he planned to attend this year’s Super …",
    "link": "https://www.celebitchy.com/960443/donald_trump_wont_attend_the_super_bowl_because_hes_afraid_of_being_booed/",
    "timestamp": "2026-02-06T12:07:23Z"
  },
  {
    "title": "BREAKING EXCLUSIVE: The DOJ and Todd Blanche’s Story About Ed Martin’s Firing Doesn’t Add Up",
    "description": "Todd Blanche and the DOJ don’t appear to be telling the truth.\nThe post BREAKING EXCLUSIVE: The DOJ and Todd Blanche’s Story About Ed Martin’s Firing Doesn’t Add Up appeared first on The Gateway Pundit.",
    "link": "https://joehoft.com/breaking-exclusive-the-doj-and-todd-blanche-caught-in-lies-about-ed-martins-firing/",
    "timestamp": "2026-02-06T12:06:35Z"
  },
  {
    "title": "Big Business This Week: The SaaS-pocalypse hits the tech markets",
    "description": "Big Business This Week: The SaaS-pocalypse hits the tech marketscheddar.com",
    "link": "https://www.cheddar.com/media/big-business-this-week-the-saas-pocalypse-hits-the-tech-markets/",
    "timestamp": "2026-02-06T12:05:29Z"
  },
  {
    "title": "Trump sparks fury after reaching 'new bottom' with 'disgusting' racist post about Obamas",
    "description": "President Donald Trump sparked fury Friday morning after posting a blatantly racist video\r\n on social media depicting Barack and Michelle Obama as non-human primates, a post critics denounced as a shocking new low for the presidency.“Disgusting behavior by th…",
    "link": "https://www.rawstory.com/trump-2675104804/",
    "timestamp": "2026-02-06T12:00:19Z"
  },
  {
    "title": "Bond Markets Are Now Battlefields",
    "description": "The world is returning to an era of weaponized finance.",
    "link": "http://foreignpolicy.com/2026/02/06/finance-trump-europe-us-treasurys-greenland/",
    "timestamp": "2026-02-06T12:00:10Z"
  },
  {
    "title": "Trump Has Betrayed the People of Coal Country. They Love Him Anyway.",
    "description": "Christy Ratliff is sitting in a folding chair in a public school gym in Grundy, Virginia, waiting for her number to be called. She arrived at 4 a.m. on this October Saturday to secure her position in line to have eight teeth pulled. Genetic gum disease, she e…",
    "link": "https://www.motherjones.com/politics/2026/02/trump-coal-country-grundy-rural-appalachia-virginia/",
    "timestamp": "2026-02-06T12:00:00Z"
  },
  {
    "title": "The Most Racist Thing",
    "description": "<ul>\n<li>Fake Outrage</li>\n<li>Trump-Approved History</li>\n<li>A Key Lesson</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/most-racist-thing",
    "timestamp": "2026-02-06T12:00:00Z"
  },
  {
    "title": "Kid Rock Strange Choice to Headline TPUSA’s ‘Pure’ Alternative to Super Bowl Halftime Show",
    "description": "We're not sure that parents who worry about Bad Bunny corrupting their children will be happy with TPUSA turning their kids on to Kid Rock.",
    "link": "https://www.peoplefor.org/rightwingwatch/kid-rock-strange-choice-headline-tpusas-pure-alternative-super-bowl-halftime-show",
    "timestamp": "2026-02-06T12:00:00Z"
  },
  {
    "title": "Trump Posts Video Depicting Barack and Michelle Obama as Apes",
    "description": "The AI clip is spliced at the end of a 62-second video, shared shortly before midnight, which pushes claims about manipulated vote counting machines.\nThe post Trump Posts Video Depicting Barack and Michelle Obama as Apes first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-posts-video-depicting-barack-and-michelle-obama-as-apes/",
    "timestamp": "2026-02-06T11:54:27Z"
  },
  {
    "title": "In CIA’s decision to shutter World Factbook, information becomes collateral damage",
    "description": "For over 60 years of existence, the CIA manual went from being reference material for intelligence officers to one for the public at large. But it might have become an unwitting casualty of domestic political upheaval",
    "link": "https://indianexpress.com/article/explained/explained-global/cia-world-factbook-shutdown-trump-10517552/",
    "timestamp": "2026-02-06T11:49:29Z"
  },
  {
    "title": "Le général des renseignements russes Vladimir Alekseev visé par une tentative d'assassinat à Moscou (Anglais)",
    "description": "He has been rushed to hospital and the gunman fled the scene, according to reports.",
    "link": "https://kyivindependent.com/russian-general-vladimir-alekseev-shot-multiple-times-in-moscow-russian-media-reports/",
    "timestamp": "2026-02-06T11:49:04Z"
  },
  {
    "title": "BofA’s Hartnett Says Midcaps Are Best Play Ahead of US Midterms",
    "description": "US small- and mid-cap stocks are the best bets ahead of midterm elections as technology heavyweights lose their appeal, according to strategists at Bank of America Corp.",
    "link": "https://financialpost.com/pmn/business-pmn/bofas-hartnett-says-midcaps-are-best-play-ahead-of-us-midterms",
    "timestamp": "2026-02-06T11:46:34Z"
  },
  {
    "title": "Shock Democratic upset in Texas shows voters still hate book bans",
    "description": "Running against Moms for Liberty is a winning 2026 strategy",
    "link": "https://www.salon.com/2026/02/06/shock-democratic-upset-in-texas-shows-voters-still-hate-book-bans/",
    "timestamp": "2026-02-06T11:45:53Z"
  },
  {
    "title": "Judge whose son was killed: Trump-fueled threats must stop or more will die",
    "description": "While a judicial coalition applauded a federal appeals court decision this week to dismiss a complaint against a judge who stopped the Trump administration deporting Venezuelan migrants to El Salvador, the group is continuing to sound the alarm on threats to …",
    "link": "https://www.rawstory.com/raw-investigates/judge-whose-son-was-killed-trump-fueled-threats-must-stop-or-more-will-die/",
    "timestamp": "2026-02-06T11:44:02Z"
  },
  {
    "title": "The Political Fallout from the UK’s Mandelson-gate Scandal Has Only Just Begun",
    "description": "The most high-profile casualty so far of the recent data dump of Epstein e-mails is Peter Mandelson, the former UK ambassador to the US, who is sometimes endearingly referred to as the “Prince of Darkness”. Together with Tony Blair and Gordon Brown, Mandelson…",
    "link": "https://www.nakedcapitalism.com/2026/02/the-political-fallout-from-mandelson-gate-has-only-just-begun.html",
    "timestamp": "2026-02-06T11:42:31Z"
  },
  {
    "title": "US animal rights activist can be extradited from UK over 2003 bombings",
    "description": "LONDON, Feb 6 (Reuters) - An alleged animal rights extremist can be extradited from Britain to the U.S. to stand trial over bombings linked to animal testing more than tw… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/06/us-animal-rights-activist-can-be-extradited-from-uk-over-2003-bombings",
    "timestamp": "2026-02-06T11:38:49Z"
  },
  {
    "title": "Change ‘addictive’ design, EU tells TikTok",
    "description": "The EU finds TikTok in breach of its Digital Services Act due to its addictive design, warning the platform to make changes or risk heavy fines.\n\nRead More: https://punchng.com/change-addictive-design-eu-tells-tiktok/",
    "link": "https://punchng.com/change-addictive-design-eu-tells-tiktok/",
    "timestamp": "2026-02-06T11:36:21Z"
  },
  {
    "title": "'There'll be drama': Republican split expected on bill that could freeze out some voters",
    "description": "A bill set to be presented to the House of Representatives could freeze out military members stationed overseas from voting in elections. Exceptions in the bill do address these concerns, according to co-author Chip Roy (R-Texas), but proponents are calling f…",
    "link": "https://www.rawstory.com/midterm-elections-2026-2675104579/",
    "timestamp": "2026-02-06T11:34:57Z"
  },
  {
    "title": "Pam Bondi has a Fox News problem",
    "description": "From cable news hits to viral X posts, top DOJ figures are igniting backlash — and exposing deeper dysfunction",
    "link": "https://www.salon.com/2026/02/06/pam-bondi-has-a-fox-news-problem/",
    "timestamp": "2026-02-06T11:30:41Z"
  },
  {
    "title": "Canada is taking the lead with a new approach—and Denmark has been invited to join",
    "description": "Without uttering Donald Trump’s name, Canada’s foreign minister, Anita Anand, is inviting the world’s anxious, embattled countries to forge new alliances.",
    "link": "https://politiken.dk/edition/news/art10720910/Canada-is-taking-the-lead-with-a-new-approach%E2%80%94and-Denmark-has-been-invited-to-join",
    "timestamp": "2026-02-06T11:30:00Z"
  },
  {
    "title": "Trump backs Orbán as key Hungary election approaches",
    "description": "The Hungarian prime minister is lagging behind former ally Péter Magyar in election polls ahead of the April vote.",
    "link": "https://www.politico.eu/article/donald-trump-throws-support-behind-viktor-orban-hungary-election-approach/",
    "timestamp": "2026-02-06T11:28:09Z"
  },
  {
    "title": "US urges new three-way nuclear deal with Russia, China",
    "description": "The US is urging a new three-way nuclear deal with Russia and China after the New START treaty expired, aiming to address China’s growing, unlimited arsena\n\nRead More: https://punchng.com/us-urges-new-three-way-nuclear-deal-with-russia-china/",
    "link": "https://punchng.com/us-urges-new-three-way-nuclear-deal-with-russia-china/",
    "timestamp": "2026-02-06T11:26:45Z"
  },
  {
    "title": "Trump’s America First doctrine is remaking global diplomacy",
    "description": "Trump is using military strength and economic pressure to advance US interests.",
    "link": "https://www.aljazeera.com/opinions/2026/2/6/trumps-america-first-doctrine-is-remaking-global-diplomacy",
    "timestamp": "2026-02-06T11:21:05Z"
  },
  {
    "title": "Trump Is Remaking the Global Oil Market, and Exxon and Chevron Want In",
    "description": "Exxon Mobil Corp. and Chevron Corp. are setting their sights on expanding production in nations tied to OPEC, including some of the world’s riskiest geopolitical hotspots, as President Donald Trump’s assertive foreign policy helps them strike deals.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-is-remaking-the-global-oil-market-and-exxon-and-chevron-want-in",
    "timestamp": "2026-02-06T11:20:55Z"
  },
  {
    "title": "Trump signals willingness to defend Diego Garcia military base if future deal threatens US access - foxnews.com",
    "description": "Trump signals willingness to defend Diego Garcia military base if future deal threatens US accessfoxnews.com Trump Softens Criticism of U.K. Deal Ceding Control of Indian Ocean IslandThe Wall Street Journal Donald Trump backs Chagos handover deal, says No 10B…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180745282",
    "timestamp": "2026-02-06T11:12:49Z"
  },
  {
    "title": "Trump posts racist midnight video depicting Barack and Michelle Obama as monkeys",
    "description": "Donald Trump posted a racist video depicting former President Barack Obama and First Lady Michelle Obama as monkeys. The video was shared to Trump's Truth Social account at around midnight on February 6, with the current president sharing a host of posts, inc…",
    "link": "https://www.rawstory.com/trump-obama-2675104687/",
    "timestamp": "2026-02-06T11:10:29Z"
  },
  {
    "title": "Trump Endorses Japan's Takaichi in Upcoming Snap Election",
    "description": "Conservative Japanese Prime Minister Takaichi Sanae has received President Donald Trump's full endorsement ahead of Sunday's snap election in the Asian country.\nThe post Trump Endorses Japan’s Takaichi in Upcoming Snap Election appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2026/02/06/trump-endorses-japans-takaichi-in-upcoming-snap-election/",
    "timestamp": "2026-02-06T11:06:43Z"
  },
  {
    "title": "Trump Announces Dramatic Drop in Ozempic Price",
    "description": "(DCNF)—President Donald Trump announced Thursday that the price of Ozempic will fall from more than $1,000 to $199, a dramatic reduction for one of the most expensive and widely used prescription drugs in the country. Pharmacy “cash price” for a single Ozempi…",
    "link": "https://freerepublic.com/focus/f-chat/4365651/posts",
    "timestamp": "2026-02-06T11:02:06Z"
  },
  {
    "title": "Epstein tracked #MeToo fallout and advised accused men behind the scenes",
    "description": "New files show Jeffrey Epstein joking about being in a \"pariahs club.\"",
    "link": "https://www.salon.com/2026/02/06/epstein-tracked-metoo-fallout-and-advised-accused-men-behind-the-scenes-partner/",
    "timestamp": "2026-02-06T11:00:31Z"
  },
  {
    "title": "6 Big Questions for Pam Bondi on Epstein and ICE",
    "description": "Attorney General Pam Bondi has been very quiet lately, but next week Congress will have a chance to grill her. Here are six big questions she needs to answer about Jeffrey Epstein, ICE, and more.",
    "link": "http://nymag.com/intelligencer/article/pam-bondi-6-big-questions-jeffrey-epstein-ice-alex-pretti-house-judiciary.html",
    "timestamp": "2026-02-06T11:00:27Z"
  },
  {
    "title": "Jack Mintz: Trade policy uncertainty is bad for investment and jobs",
    "description": "Disdain for Trump is fine but Canada has a simple choice: let CUSMA die or make a trade deal with him that includes some tariffs. Read on",
    "link": "https://financialpost.com/opinion/jack-mintz-trade-policy-uncertainty-bad-for-investment",
    "timestamp": "2026-02-06T11:00:17Z"
  },
  {
    "title": "Revisiting Super Bowl 49: Inside infamous Patriots vs. Seahawks matchup, from Malcolm Butler INT to Marshawn Lynch's dominance",
    "description": "Before meeting in Super Bowl 60, the Patriots and Seahawks played a classic in Super Bowl 49.",
    "link": "https://www.sportingnews.com/us/nfl/news/super-bowl-49-patriots-seahawks-malcolm-butler/4bb30968bb92366884ddbdad",
    "timestamp": "2026-02-06T11:00:02Z"
  },
  {
    "title": "How Autocrats Meddle With Elections",
    "description": "The Trump administration has its eyes on the midterms and beyond.",
    "link": "https://www.theatlantic.com/podcasts/2026/02/how-autocrats-meddle-with-elections/685383/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "Win Bigly",
    "description": "The latest episode of Trial Balloon is live for members. What should Democrats do if Donald Trump interferes with the midterm elections? Join now to continue reading. Members get exclusive analysis, bonus features and no advertising. Learn more. If you’re alr…",
    "link": "https://politicalwire.com/2026/02/06/win-bigly-2/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "Does 'Melania' movie director Brett Ratner appear in Epstein files? What we know",
    "description": "Ratner reportedly told U.K. and U.S. media a photograph showed him, his former fiancée and Epstein.",
    "link": "https://www.snopes.com//news/2026/02/06/brett-ratner-photo-epstein/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "Public Health Workers Are Quitting Over Assignments to Guantánamo",
    "description": "Doctors, nurses, and other officers are increasingly being deployed to ICE detention centers. Some have resigned in protest, while others offer a rare look into bleak conditions.",
    "link": "https://www.wired.com/story/public-health-workers-are-quitting-over-assignments-to-guantanamo/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "“Terrorist”: How ICE Weaponized 9/11’s Scarlet Letter",
    "description": "Spencer Ackerman on how the politics of counterterrorism led to ICE and CBP completing their transformation into a death squad — and why the agencies are unreformable.\nThe post “Terrorist”: How ICE Weaponized 9/11’s Scarlet Letter appeared first on The Interc…",
    "link": "https://theintercept.com/2026/02/06/spencer-ackerman-9-11-terrorists-ice/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Nicole Kidman Warned to Shut Down Keith Urban's 'Desperate' Bid to Woo Her Back",
    "description": "Nicole Kidman has been warned to shut down Keith Urban's 'desperate' bid to win her back.",
    "link": "https://radaronline.com/p/nicole-kidman-warned-stop-keith-urban-desperate-win-her-back-bid/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "These Are the Democrat ICE Reform Demands the GOP Calls 'Impossible'",
    "description": "Democrats demand that ICE agents behave as if they might ever have to face consequences for breaking the law. Republicans say \"impossible.\"",
    "link": "https://www.jezebel.com/ice-reform-demands-democrats-congress-gop-john-thune-trump-face-masks-id-body-cameras",
    "timestamp": "2026-02-06T10:59:21Z"
  },
  {
    "title": "CNN's Harry Enten predicts MAGA will \"OUTLAST DONALD TRUMP",
    "description": "\"MAGA is as POWERFUL as it has ever been! ... What he brought into the GOP looks like it's going to last long beyond him.\"\"The Republican base LOVES JD Vance.\"",
    "link": "https://freerepublic.com/focus/f-bloggers/4365650/posts",
    "timestamp": "2026-02-06T10:56:37Z"
  },
  {
    "title": "Hegseth says US strikes force some cartel leaders to halt drug operations",
    "description": "War Secretary Pete Hegseth declared that some cartel drug traffickers have chosen to stop their narcotics activities because of America's attacks in the Caribbean.",
    "link": "https://www.foxnews.com/politics/hegseth-cartel-operations-halt-us-strikes",
    "timestamp": "2026-02-06T10:52:47Z"
  },
  {
    "title": "US calls for new multilateral arms control agreement following expiry of nuclear treaty",
    "description": "GENEVA: The United States on Friday (Feb 6) called for a new arms control agreement after the treaty that set caps on Russian and US strategic nuclear weapons deployments expired on Thursday.Russia had suggested both sides voluntarily extend the terms of the …",
    "link": "https://www.channelnewsasia.com/world/us-new-arms-control-agreement-start-expires-russia-china-nuclear-5912596",
    "timestamp": "2026-02-06T10:51:00Z"
  },
  {
    "title": "US EV slowdown drives $55 billion hit for carmakers",
    "description": "In a turbulent turn of events, major global car manufacturers are grappling with heavy financial losses. Brands like Stellantis, Ford, General Motors, and Volkswagen are reporting billion-dollar writedowns as they reassess their electric vehicle strategies. T…",
    "link": "https://economictimes.indiatimes.com/industry/auto/cars-uvs/us-ev-slowdown-drives-55-billion-hit-for-carmakers/articleshow/127985220.cms",
    "timestamp": "2026-02-06T10:49:16Z"
  },
  {
    "title": "Canada and France opening consulates in Greenland following tensions over US push for control",
    "description": "Canada and France are opening diplomatic consulates in the capital of Greenland",
    "link": "https://abcnews.go.com/International/wireStory/canada-france-opening-consulates-greenland-tensions-us-push-129909670",
    "timestamp": "2026-02-06T10:45:34Z"
  },
  {
    "title": "Brussels’ dependency dilemma: The EU is a victim of its own energy arrogance",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632093-brussels-dependency-energy-russia/",
    "timestamp": "2026-02-06T10:41:44Z"
  },
  {
    "title": "The One Thing Donald Trump (Maybe) Can’t Ruin This Winter",
    "description": "The one thing Donald Trump (maybe) can’t ruin this winter.",
    "link": "https://slate.com/culture/2026/02/2026-winter-olympics-hey-it-could-be-worse.html",
    "timestamp": "2026-02-06T10:40:00Z"
  },
  {
    "title": "What does Iran want from talks with the US?",
    "description": "Tehran (AFP) Feb 5, 2026\n\n\n Iran and the United States are holding talks on Friday in Oman, with Tehran pushing to focus squarely on its nuclear programme, while Washington's demands go beyond that. \n\nThe two foes had held several rounds of Oman-mediated nucl…",
    "link": "https://www.spacewar.com/reports/What_does_Iran_want_from_talks_with_the_US_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Russia, US agree to resume military contacts at Ukraine talks",
    "description": "Abu Dhabi (AFP) Feb 5, 2026\n\n\n Russia and the United States agreed to resume high-level military contacts, in a major step of rapprochement between the world's top nuclear powers at Ukraine talks in Abu Dhabi on Thursday. \n\nMoscow and Washington suspended sen…",
    "link": "https://www.spacewar.com/reports/Russia_US_agree_to_resume_military_contacts_at_Ukraine_talks_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Trump urges new nuclear treaty after Russia agreement ends",
    "description": "Washington, United States (AFP) Feb 6, 2026\n\n US President Donald Trump on Thursday called for a brand new nuclear treaty after the last agreement with Russia expired, prompting fears of a new global arms race. \n\nThe Trump administration has repeatedly presse…",
    "link": "https://www.spacewar.com/reports/Trump_urges_new_nuclear_treaty_after_Russia_agreement_ends_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Why did Xi hold back-to-back calls with Putin, Trump?",
    "description": "Beijing (AFP) Feb 5, 2026\n\n\n China's leader Xi Jinping held back-to-back calls with Russia's Vladimir Putin and US President Donald Trump this week, timing analysts said on Thursday was rare and significant as Beijing positions itself as a stable global power…",
    "link": "https://www.spacewar.com/reports/Why_did_Xi_hold_back-to-back_calls_with_Putin_Trump_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "New START nuclear treaty 'was flawed': senior US official",
    "description": "Geneva (AFP) Feb 6, 2026\n\n\n A senior US official on Friday criticised the last nuclear treaty between Russia and the United States for failing to include Beijing, speaking at the United Nations a day after the New START deal expired. \n\n\"In a nutshell, New STA…",
    "link": "https://www.spacewar.com/reports/New_START_nuclear_treaty_was_flawed_senior_US_official_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "China shuns calls to enter nuclear talks after US-Russia treaty lapses",
    "description": "Beijing (AFP) Feb 5, 2026\n\n\n China rejected calls to enter talks on a new nuclear treaty after a US-Russian agreement expired on Thursday, ending decades of restrictions on how many warheads the two powers can deploy. \n\nCampaigners have warned that the expiry…",
    "link": "https://www.spacewar.com/reports/China_shuns_calls_to_enter_nuclear_talks_after_US-Russia_treaty_lapses_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Iran, US prepare for Oman talks after deadly protest crackdown",
    "description": "Muscat, Oman (AFP) Feb 6, 2026\n\n\n Iran and the United States were preparing for talks on Friday in Oman, with Washington looking to see if there was any prospect of diplomatic progress on the Iranian nuclear programme and other issues while refusing to rule o…",
    "link": "https://www.spacewar.com/reports/Iran_US_prepare_for_Oman_talks_after_deadly_protest_crackdown_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Iran, US hold talks in Oman after deadly protest crackdown",
    "description": "Muscat, Oman (AFP) Feb 6, 2026\n\n\n Iran and the United States began talks on Friday in Oman, with Washington refusing to rule out military action against the Islamic republic over its deadly crackdown on mass protests. \n\nIran has insisted the Oman-mediated tal…",
    "link": "https://www.spacewar.com/reports/Iran_US_hold_talks_in_Oman_after_deadly_protest_crackdown_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Why is bitcoin price today touching $60,000 level and will BTC USD rise now or fall back? Bitcoin fall, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Bitcoin price today touched the $60,000 level after a global crypto sell-off. Investors are watching whether BTC USD will rise or fall further. Bitcoin has lost 26% this year, while ether also declined. Analysts link moves to tech stocks, gold, and market vol…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-bitcoin-price-today-touching-60000-level-and-will-btc-usd-rise-now-or-fall-back-bitcoin-fall-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now-cryptocurrency-market/articleshow/127984218.cms",
    "timestamp": "2026-02-06T10:35:23Z"
  },
  {
    "title": "Kaitlan Collins Addresses Trump's ‘Smile' Attack On Her With A Powerful Point",
    "description": "The CNN anchor responded to the president's slamming of her during a recent press briefing.",
    "link": "https://www.huffpost.com/entry/kaitlan-collins-donald-trump-smile-attack_n_6985b8b3e4b0fa2b1703164d",
    "timestamp": "2026-02-06T10:31:35Z"
  },
  {
    "title": "Just how ‘excellent’ was Trump and Xi Jinping’s phone call, really?",
    "description": "US president raved about his 'extremely good' personal relationship with the Chinese leader, but Xi was more muted.",
    "link": "https://www.aljazeera.com/news/2026/2/6/just-how-excellent-was-trump-and-xi-jinpings-phone-call-really",
    "timestamp": "2026-02-06T10:30:16Z"
  },
  {
    "title": "Trump just proved this powerful group are a bunch of dangerous hypocrites. They don't care",
    "description": "Yesterday I watched, horrified and spellbound — which is becoming a regular thing — as an event purportedly built on prayer, humility, and the teachings of Jesus Christ dissolved into a Trump rally, complete with guffaws, applause, and a bizarre reverence for…",
    "link": "https://www.rawstory.com/raw-investigates/president-trump-speaks-at-national-prayer-breakfast/",
    "timestamp": "2026-02-06T10:30:02Z"
  },
  {
    "title": "Trump May Choose Military Option on Iran If Diplomacy Fails - Vance",
    "description": "US Vice President JD Vance said President Donald Trump will \"keep his options open\" on Iran, pursue \"non-military means\" first, and could ultimately use force.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260205-sputnik01.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "Russia's UN envoy rejects military option against Iran, calls for diplomacy",
    "description": "Russia's United Nations ambassador has strongly rejected any military options against Iran, warning such actions could destabilize the entire region, while stressing Moscow's readiness to support diplomacy without imposing itself as a mediator.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260205-presstv04.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "China expresses regret over expiration of New START Treaty between Russia and the US: FM spokesperson",
    "description": "China expresses regret that the New START Treaty between Russia and the US has expired, which has had great significance for maintaining global strategic stability, the Chinese Foreign Ministry spokesperson Lin Jian said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/02/china-260205-globaltimes03.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "No shift in alliance as US focuses on Western Hemisphere - PH envoy",
    "description": "There is no expected major change in the deep defense partnership between the Philippines and the United States as the latter increases focus on the Western Hemisphere, said Philippine Ambassador to the US Jose Manuel Romualdez.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260205-pna01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Russia, Ukraine hold talks after 'productive' opening session",
    "description": "Russian and Ukrainian negotiators returned to the table for a second day of peace talks following what both sides described as a \"productive\" opening session.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260205-presstv01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Trump invites PH to join 'Board of Peace' -envoy",
    "description": "United States President Donald Trump has invited the Philippines to join the Board of Peace (BOP), a US-initiated multinational body aimed at advancing post-conflict solutions, specifically the Gaza reconstruction.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260205-pna02.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "New START Expires, Russia Assesses It Negatively - Kremlin",
    "description": "The New START (New Strategic Arms Reduction Treaty) expires, Russia assesses this negatively and expresses regret in this regard, Kremlin spokesman Dmitry Peskov said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2026/02/russia-260205-sputnik02.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "New START's end raises alarm over return of US-Russia nuclear rivalry",
    "description": "The impending expiration of the New START, the last remaining nuclear arms control treaty between the United States and Russia, has heightened fears that decades of fragile restraint are giving way to a more dangerous, unregulated nuclear era.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2026/02/russia-260205-presstv01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Ukraine, Russia 'Likely' To Continue Peace Talks In US, Zelenskyy Says As POW Exchange Completed",
    "description": "Ukrainian President Volodymyr Zelenskyy said the next round of US-brokered peace talks with Russia is \"likely\" to take place in the United States as officials from both countries wrapped up a second day of renewed negotiations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260205-rferl01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Diplomatic Showdown Between US And Iran Set For Oman",
    "description": "Iranian and US officials are set to meet in Oman on February 6 for a round of high-stakes diplomacy seen as a last-chance effort to avert a major military escalation in the Persian Gulf.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260206-rferl01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  }
]