[
  {
    "title": "Egg prices continue to increase despite bird flu outbreak slowing",
    "description": "U.S. egg prices increased again last month to a new record-high of $6.23.",
    "link": "https://www.denverpost.com/2025/04/10/egg-prices-increase/",
    "timestamp": "2025-04-10T12:44:52Z"
  },
  {
    "title": "Egg prices continue to increase despite bird flu outbreak slowing",
    "description": "U.S. egg prices increased again last month to a new record-high of $6.23.",
    "link": "https://www.bostonherald.com/2025/04/10/egg-prices-increase/",
    "timestamp": "2025-04-10T12:44:52Z"
  },
  {
    "title": "Trump to lift water curbs to 'make America's showers great again'",
    "description": "WASHINGTON (Reuters) -President Donald Trump, after complaining about it for years, signed an order to lift restrictions on water pressure in showers on Wednesday, saying he wanted to \"take care of my beautiful hair.\" Trump's executive order is aimed at rever…",
    "link": "https://freerepublic.com/focus/f-news/4310140/posts",
    "timestamp": "2025-04-10T12:44:23Z"
  },
  {
    "title": "Trump orders revocation of security clearances for Chris Krebs, SentinelOne",
    "description": "US President Donald Trump has signed an Executive Order on Wednesday to revoke security clearance held by Chris Krebs, the former director of the Cybersecurity and Infrastructure Security Agency (CISA), and his colleagues at SentinelOne. “The Order also suspe…",
    "link": "https://www.helpnetsecurity.com/2025/04/10/chris-krebs-sentinelone-trump-revocation-security-clearances/",
    "timestamp": "2025-04-10T12:44:02Z"
  },
  {
    "title": "US consumer prices dip in March, but Trump’s tariffs stoke inflation fears",
    "description": "U.S. consumer prices fall in March, but inflation risks rise due to Trump's tariffs on Chinese goods.",
    "link": "https://www.thehindubusinessline.com/news/world/us-consumer-prices-dip-in-march-but-trumps-tariffs-stoke-inflation-fears/article69435376.ece",
    "timestamp": "2025-04-10T12:42:48Z"
  },
  {
    "title": "Shanghai finance workers worry after front-row seat to tariff turmoil",
    "description": "As stock prices flashed across a huge screen at a bustling intersection in China’s business hub Shanghai, finance workers shared their concerns after getting front-row seats to the global market turmoil wreaked by Donald Trump this week. After equities tanked…",
    "link": "https://www.digitaljournal.com/world/shanghai-finance-workers-worry-after-front-row-seat-to-tariff-turmoil/article",
    "timestamp": "2025-04-10T12:42:22Z"
  },
  {
    "title": "Shanghai Finance Workers Worry After Front-row Seat To Tariff Turmoil",
    "description": "As stock prices flashed across a huge screen at a bustling intersection in China's business hub Shanghai, finance workers shared their concerns after getting front-row seats to the global market turmoil wreaked by Donald Trump this week.",
    "link": "https://www.ibtimes.com/shanghai-finance-workers-worry-after-front-row-seat-tariff-turmoil-3769572",
    "timestamp": "2025-04-10T12:42:09Z"
  },
  {
    "title": "Bhutan confiscated all documents before sending US-deported Bhutanese refugees to Nepal",
    "description": "It has emerged that the Bhutan government sent 12 Bhutanese refugees deported by the United States to Nepal on March 28 after confiscating all their documents.",
    "link": " https://en.setopati.com/political/164448 ",
    "timestamp": "2025-04-10T12:42:05Z"
  },
  {
    "title": "Tesla Rallies as U.S. Tariff Pause Ignites Comeback Across EV Sector",
    "description": "Tesla leads broad EV sector gains after tariff pause, while investors eye potential U.S.-China trade reset",
    "link": "https://finance.yahoo.com/news/tesla-rallies-u-tariff-pause-124154267.html",
    "timestamp": "2025-04-10T12:41:54Z"
  },
  {
    "title": "Bitcoin, Ethereum Rise as Inflation Drops Sharply in March",
    "description": "U.S. President Donald Trump’s tariffs may make inflation harder to tame, the Federal Reserve has noted.",
    "link": "https://decrypt.co/314293/bitcoin-ethereum-inflation-drops-march",
    "timestamp": "2025-04-10T12:41:37Z"
  },
  {
    "title": "Could Donald Trump Deport Americans? Legal Experts Weigh In",
    "description": "Trump has said it would be an honor to strip criminals of their U.S citizenship and deport them to El Salvador",
    "link": "https://www.newsweek.com/president-donald-trump-deportation-el-salvador-u-s-citizens-leavitt-white-house-2057894",
    "timestamp": "2025-04-10T12:40:39Z"
  },
  {
    "title": "US And Russia Exchange Prisoners",
    "description": "Russia and the United States exchanged prisoners on Thursday, the second such swap since US President Donald Trump returned to the White House as the two superpowers push for closer ties.",
    "link": "https://www.ibtimes.com.au/us-russia-exchange-prisoners-1857750",
    "timestamp": "2025-04-10T12:40:21Z"
  },
  {
    "title": "Trump tariffs drive China, EU to diversify trade",
    "description": "\"Derisk, diversify, and redirect trade\" — a mantra once aimed at China’s expanding grip on global trade — is now being applied to the United States. President Donald Trump’s sweeping tariffs, currently totalling a staggering 125% on Chinese-made goods, have s…",
    "link": "https://biztoc.com/x/9530c13c01d5e862",
    "timestamp": "2025-04-10T12:39:13Z"
  },
  {
    "title": "Trump: Big beautiful bill coming along well",
    "description": "United States President Donald Trump took to TruthSocial on Thursday to share what he called \"great news,\" adding that the \"big, beautiful bill is coming along really well.\" More to come......",
    "link": "https://biztoc.com/x/a663fe88e0f05af4",
    "timestamp": "2025-04-10T12:39:13Z"
  },
  {
    "title": "Wall Street poised to give back some of the historic gains following Trump’s latest tariff pause",
    "description": "By YURI KAGEYAMA and MATT OTT, Associated Press Business Writers\nMarkets on Wall Street Thursday were poised to gave back some of the historic gains made a day earlier when President Donald Trump paused his latest tariff hikes on U.S. trading partners, with t…",
    "link": "https://biztoc.com/x/6869ce0c152970ba",
    "timestamp": "2025-04-10T12:39:02Z"
  },
  {
    "title": "European Union hits pause on planned retaliatory tariffs for U.S",
    "description": "The European Union will pause its first countermeasures against U.S. tariffs after President Donald Trump temporarily lowered the hefty duties he had just imposed on dozens of countries, European Commission chief Ursula von der Leyen said on Thursday.",
    "link": "https://biztoc.com/x/5a80a9304b043f55",
    "timestamp": "2025-04-10T12:39:02Z"
  },
  {
    "title": "Inflation cooled more than expected in March despite Trump's warnings of more tariffs to come",
    "description": "Inflation slowed dramatically in March, even though Trump had warned he'd be imposing additional tariffs.",
    "link": "https://www.businessinsider.com/inflation-march-cpi-consumer-price-index-federal-reserve-interest-rates-2025-4",
    "timestamp": "2025-04-10T12:39:01Z"
  },
  {
    "title": "Russia and US hold fresh talks following prisoner-swap deal",
    "description": "American Ksenia Karelina exchanged for Russian citizen Arthur Petrov as discussions begin in Turkey",
    "link": "https://www.irishtimes.com/world/europe/2025/04/10/russia-and-us-hold-fresh-talks-following-prisoner-swap-deal/",
    "timestamp": "2025-04-10T12:38:48Z"
  },
  {
    "title": "Tariffs turmoil plays havoc with pensions",
    "description": "How do you manage your money as everything changes at a head-spinning rate? What does mean for interest rates?",
    "link": "https://www.irishtimes.com/your-money/2025/04/10/tariffs-turmoil-plays-havoc-with-pensions/",
    "timestamp": "2025-04-10T12:38:32Z"
  },
  {
    "title": "‘He Means What He Says’: Kevin Hassett Spins Trump Tariff Flip-Flop to Fox & Friends",
    "description": "Kevin Hassett offered a bizarre spin on Fox & Friends over what seems a clear Trump cave to broad bipartisan pressure on his \"Liberation Day\" stunt.\nThe post ‘He Means What He Says’: Kevin Hassett Spins Trump Tariff Flip-Flop to Fox & Friends first appeared o…",
    "link": "https://www.mediaite.com/tv/he-means-what-he-says-kevin-hassett-spins-trump-tariff-flip-flop-to-fox-friends/",
    "timestamp": "2025-04-10T12:38:15Z"
  },
  {
    "title": "U.S. Immigration At A Boiling Point: Deportations, Legal Showdowns",
    "description": "U.S. Immigration policy is expanding its focus. Adding to recent deportations, the administration is now even adding legal immigrants whose legal status is being revoked.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/04/10/us-immigration-at-a-boiling-point-deportations-legal-showdowns/",
    "timestamp": "2025-04-10T12:37:08Z"
  },
  {
    "title": "Inflation rate eases to 2.4% in March, lower than expected",
    "description": null,
    "link": "https://www.cnbc.com/2025/04/10/inflation-rate-eases-to-2point4percent-in-march-lower-than-expected.html",
    "timestamp": "2025-04-10T12:36:00Z"
  },
  {
    "title": "Global markets soar after President Trump's tariff pause",
    "description": "Stocks in Europe and Asia followed Wall Street's gains after Trump announced a pause on higher global tariffs, but investors are still waiting on Beijing's next move.",
    "link": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
    "timestamp": "2025-04-10T12:35:38Z"
  },
  {
    "title": "U.S. retail giant overtakes Google as Canada's most reputable company",
    "description": "Costco Canada has claimed the top spot in a new market ranking of Canada's most reputable brands.\r\nLeger, a Canadian market research and analytics company, has just published the results of its 28th Reputation study, which unveils the list of the country's to…",
    "link": "https://dailyhive.com/canada/costco-canada-most-reputable-companies-2025",
    "timestamp": "2025-04-10T12:35:28Z"
  },
  {
    "title": "US regional banks face results test as tariffs trigger uncertainty, growth worries",
    "description": "Heightened uncertainty fueled by the on-and-off U.S. tariffs will likely take center stage as the nation's regional banks gear up to report first-quarter...",
    "link": "https://finance.yahoo.com/news/us-regional-banks-face-results-123508069.html",
    "timestamp": "2025-04-10T12:35:08Z"
  },
  {
    "title": "European Union hits pause on planned retaliatory tariffs for U.S.",
    "description": "The European Union will pause its first countermeasures against U.S. tariffs after President Donald Trump temporarily lowered the hefty duties he had just imposed on dozens of countries, European Commission chief Ursula von der Leyen said on Thursday.",
    "link": "https://www.cbc.ca/news/world/eu-tariff-response-1.7506560",
    "timestamp": "2025-04-10T12:33:51Z"
  },
  {
    "title": "US tariff pause: Cos should explore alternate mkts, create contingency plan, say experts",
    "description": "EY advises corporates to prepare contingency plans and explore alternative markets during the US's 90-day tariff pause. This period allows India to finalize a bilateral trade agreement with the US, aiming for USD 500 billion in trade by 2030.",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/us-tariff-pause-cos-should-explore-alternate-mkts-create-contingency-plan-say-experts/articleshow/120160934.cms",
    "timestamp": "2025-04-10T12:33:15Z"
  },
  {
    "title": "Trump's Buy Tip Before Tariff Reversal Nets Massive One-day Gains for Investors Who Followed",
    "description": "US President Donald Trump said yesterday in a Truth Social post that it is a great time to buy before the stock market surged on his reversal of reciprocal tariffs.",
    "link": "https://www.ibtimes.com/trumps-buy-tip-before-tariff-reversal-nets-massive-one-day-gains-investors-who-followed-3769569",
    "timestamp": "2025-04-10T12:32:46Z"
  },
  {
    "title": "Why IonQ Inc. (IONQ) Went Up On Wednesday?",
    "description": "We recently published a list of 10 Stocks Bolstered by Broader Market Cheer. In this article, we are going to take a look at where IonQ Inc. (NYSE:IONQ...",
    "link": "https://finance.yahoo.com/news/why-ionq-inc-ionq-went-123228236.html",
    "timestamp": "2025-04-10T12:32:28Z"
  },
  {
    "title": "Why MicroChip Technology Inc. (MCHP) Went Up On Wednesday?",
    "description": "We recently published a list of 10 Stocks Bolstered by Broader Market Cheer. In this article, we are going to take a look at where MicroChip Technology Inc. ...",
    "link": "https://finance.yahoo.com/news/why-microchip-technology-inc-mchp-123128555.html",
    "timestamp": "2025-04-10T12:31:28Z"
  },
  {
    "title": "Ecommerce Trends: Tariffs challenge a recovery for online consumer electronics sales",
    "description": "Online sales for the largest Consumer Electronics retailers in North America have been climbing out of a hole, following negative growth year over year in 2023 and 2024, but new tariffs from an escalating trade war between the U.S. and other countries could p…",
    "link": "https://www.digitalcommerce360.com/2025/04/10/ecommerce-trends-tariffs-challenge-recovery-online-consumer-electronics-sales/",
    "timestamp": "2025-04-10T12:30:53Z"
  },
  {
    "title": "U.S. Stocks Set to Tumble Again",
    "description": "“The U.S. stock market, fresh off its third-best day in modern history, is sinking back into reality: Although President Donald Trump paused most of his ‘reciprocal’ tariffs, his other massive import taxes have already inflicted",
    "link": "https://politicalwire.com/2025/04/10/u-s-stocks-set-to-tumble-again/",
    "timestamp": "2025-04-10T12:30:31Z"
  },
  {
    "title": "Dogecoin Long From Here? Possible 300% Extension Could Be Profit-Making Opportunity",
    "description": "Dogecoin dropped by more than 50% after hitting $0.5 leading up to the Donald Trump inauguration. Despite expectations of recovery, the meme coin continued to dip, breaking below major supports like $0.15. However, this could be a unique opportunity for crypt…",
    "link": "https://bitcoinist.com/dogecoin-300-extension/",
    "timestamp": "2025-04-10T12:30:20Z"
  },
  {
    "title": "Is The Bitcoin Bottom In After Trump’s Tariff Pause? Here’s What To Expect",
    "description": "On Wednesday, Bitcoin surged more than 8% to reach a high of $83,588 following President Donald Trump’s announcement of a 90-day pause on new reciprocal tariffs for over 75 countries, excluding China. Investors and market analysts viewed the move as a signal …",
    "link": "http://www.newsbtc.com/bitcoin-news/is-the-bitcoin-bottom-in-trumps-tariff-pause/",
    "timestamp": "2025-04-10T12:30:12Z"
  },
  {
    "title": "EU Offers “Zero-For-Zero” Tariffs To Trump, Threatens Retaliation",
    "description": "European Commission President Ursula von der Leyen offers to eliminate all industrial tariffs for the U.S. to de-escalate trade tensions ahead of an April 9 deadline. The proposal covers cars, pharmaceuticals, machinery and more, aiming to counter the U.S. th…",
    "link": "https://www.shtfplan.com/headline-news/eu-offers-zero-for-zero-tariffs-to-trump-threatens-retaliation",
    "timestamp": "2025-04-10T12:30:11Z"
  },
  {
    "title": "Trump’s Education Chief Linda McMahon Repeatedly Calls AI ‘A1’ in School Speech",
    "description": "Linda McMahon might need new reading glasses.",
    "link": "https://gizmodo.com/trumps-education-chief-linda-mcmahon-repeatedly-calls-ai-a1-in-school-speech-2000587329",
    "timestamp": "2025-04-10T12:30:01Z"
  },
  {
    "title": "Ksenia Karelina, a US-Russia dual national, freed in a prisoner swap with Moscow",
    "description": "Ksenia Karelina was arrested in February 2024 and convicted of treason on charges stemming from a donation of about $52 to a charity aiding Ukraine.",
    "link": "https://roanoke.com/news/nation-world/article_bb27aaed-9d84-5e47-bc3f-b88a2c87221c.html",
    "timestamp": "2025-04-10T12:30:00Z"
  },
  {
    "title": "And so it begins: the painting of protests against fascism as being due to a mental disorder. Cops: \"You're protesting against Donald Trump? That's a 72 hour hold at a mental health facility\" [Scary]",
    "description": "And so it begins: the painting of protests against fascism as being due to a mental disorder. Cops: \"You're protesting against Donald Trump? That's a 72 hour hold at a mental health facility\"",
    "link": "https://www.fark.com/comments/13629496/And-so-it-begins-painting-of-protests-against-fascism-as-being-due-to-a-mental-disorder-Cops-Youre-protesting-against-Donald-Trump-Thats-a-72-hour-hold-at-a-mental-health-facility",
    "timestamp": "2025-04-10T12:29:36Z"
  },
  {
    "title": "Two L.A. Schools Refuse Entry to Federal Homeland Security Officials",
    "description": "Two schools in the Los Angles Unified School District (LAUSD) refused entry to federal officials from the Department of Homeland Security this week, as part of an effort by state and local institutions to block immigration enforcement.\nThe post Two L.A. Schoo…",
    "link": "https://www.breitbart.com/politics/2025/04/10/two-l-a-schools-refuse-entry-to-federal-homeland-security-officials/",
    "timestamp": "2025-04-10T12:29:11Z"
  },
  {
    "title": "Dow Jones Futures Tumble Ahead Of Inflation Report; Nvidia, Tesla Sell Off",
    "description": "Futures for the Dow Jones Industrial Average and other major stock indexes pulled back Thursday after President Donald Trump sparked big market gains Wednesday with a 90-day pause on most tariffs, with the most notable exception being China. Up next is a key …",
    "link": "https://biztoc.com/x/c27d34033301ac16",
    "timestamp": "2025-04-10T12:28:56Z"
  },
  {
    "title": "Donald Trump's Approval Rating Tanks Over Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is facing a sharp decline in approval ratings following the rollout of new tariffs that have rattled markets and sparked backlash from consumers.\nWhy It Matters\nTrump's sliding approval …",
    "link": "https://biztoc.com/x/a09a3fbcb57855be",
    "timestamp": "2025-04-10T12:28:29Z"
  },
  {
    "title": "Why did Donald Trump U-turn on tariffs?",
    "description": "Donald Trump famously Tweeted that \"trade wars are good, and easy to win\". But investors \"think otherwise\" – and Trump has now \"decided maybe investors are right\", said The Wall Street Journal.\nFaced with a sell-off in US government debt, Trump has announced …",
    "link": "https://biztoc.com/x/2fac2fcf6d97285b",
    "timestamp": "2025-04-10T12:28:24Z"
  },
  {
    "title": "Hassett Says Trump Has Trade Offers From 15 Countries",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's top economic adviser said the White House now has trade offers from 15 countries.\n\"We've already got offers on the table from...15 countries,\" Kevin Hassett, director of Trump's Nation…",
    "link": "https://biztoc.com/x/dca53ef02ec167ac",
    "timestamp": "2025-04-10T12:27:56Z"
  },
  {
    "title": "Donald Trump's Approval Rating Tanks Over Tariffs",
    "description": "The tariffs' popularity and impact on the economy could be crucial to the outcome of the 2026 midterm elections.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-tariffs-2057898",
    "timestamp": "2025-04-10T12:27:12Z"
  },
  {
    "title": "America Can Dominate Global Hydrogen By Leveraging Natural Gas",
    "description": "America already has all the tools it needs to dominate the global hydrogen space. All it needs is the will to leverage them.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/04/10/america-can-dominate-global-hydrogen-by-leveraging-natural-gas/",
    "timestamp": "2025-04-10T12:26:03Z"
  },
  {
    "title": "Why did Donald Trump U-turn on tariffs?",
    "description": "President's 'easy-win' trade war couldn't survive the realities of the US economy",
    "link": "https://theweek.com/politics/why-did-donald-trump-u-turn-on-tariffs",
    "timestamp": "2025-04-10T12:25:44Z"
  },
  {
    "title": "Wall Street poised to give back some of the historic gains following Trump’s latest tariff pause",
    "description": "Futures for the S&P 500 were down 1.7% before the bell Thursday, while futures for the Dow Jones Industrial Average dropped 1.4%.",
    "link": "https://www.bostonherald.com/2025/04/10/stock-market-after-tariff-pause/",
    "timestamp": "2025-04-10T12:25:34Z"
  },
  {
    "title": "Wall Street poised to give back some of the historic gains following Trump’s latest tariff pause",
    "description": "Futures for the S&P 500 were down 1.7% before the bell Thursday, while futures for the Dow Jones Industrial Average dropped 1.4%.",
    "link": "https://www.denverpost.com/2025/04/10/stock-market-after-tariff-pause/",
    "timestamp": "2025-04-10T12:25:34Z"
  },
  {
    "title": "EU pauses US tariffs for 90 days following Trump’s hold",
    "description": "The European Union will pause its first countermeasures against U.S. tariffs after President Donald Trump temporarily lowered the hefty duties he had just imposed on dozens of countries, European Commission chief Ursula von der Leyen said on Thursday. The blo…",
    "link": "https://nypost.com/2025/04/10/world-news/eu-pauses-countermeasures-following-trumps-tariff-reprieve/",
    "timestamp": "2025-04-10T12:25:21Z"
  },
  {
    "title": "Will iPhones cost more because of Trump's tariffs on China?",
    "description": "Some analysts say that if costs incurred by tariffs pass to consumers, US iPhone prices could rise by hundreds of dollars.",
    "link": "https://www.bbc.com/news/articles/cx28845z30go",
    "timestamp": "2025-04-10T12:24:21Z"
  },
  {
    "title": "China is now up for the fight in a trade war with the US - and it's not clear Trump knows what he's taking on",
    "description": "If you think it is pensions, investments and jobs that matter most in all this, think again.",
    "link": "https://news.sky.com/story/china-is-now-up-for-the-fight-in-a-trade-war-with-the-us-and-its-not-clear-trump-knows-what-hes-taking-on-13345755",
    "timestamp": "2025-04-10T12:24:00Z"
  },
  {
    "title": "Ukraine's Main Munitions Plant 'Wiped Out' in Russia Air Strike: Report",
    "description": "Russia has persistently targeted Ukraine's northeastern Sumy region, from which Kyiv launched its Kursk offensive last summer.",
    "link": "https://www.newsweek.com/ukraine-ammunition-factory-shostka-sumy-russia-ballistic-missile-strike-2057853",
    "timestamp": "2025-04-10T12:21:53Z"
  },
  {
    "title": "Hassett Says Trump Has Trade Offers From 15 Countries",
    "description": "The White House has these offers \"on the table\" after President Donald Trump unleashed tariffs on America's trading partners.",
    "link": "https://www.newsweek.com/hassett-says-trump-has-trade-offers-15-countries-2057935",
    "timestamp": "2025-04-10T12:21:47Z"
  },
  {
    "title": "Dollar weakens as dust settles on Trump's shock tariff pause",
    "description": "The dollar fell across the board on Thursday, losing ground particularly against safe havens but also more risk sensitive currencies, as traders tried to assess where they stood after Wednesday's dramatic tariff announcement.",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-weakens-as-dust-settles-on-trumps-shock-tariff-pause/articleshow/120160475.cms",
    "timestamp": "2025-04-10T12:21:34Z"
  },
  {
    "title": "Almost every teenager in the US owns an iPhone, study finds",
    "description": "25% of US teenagers plan to upgrade to the iPhone 17",
    "link": "https://www.phonearena.com/news/Almost-every-teenager-in-the-US-owns-an-iPhone-study-finds_id169365",
    "timestamp": "2025-04-10T12:21:03Z"
  },
  {
    "title": "The market's trade war roller coaster rides on. Here's what to watch next",
    "description": "Wall Street staged a dramatic rebound Wednesday after President Donald Trump abruptly hit pause on sweeping tariffs for most countries. The 90-day delay — announced shortly after the duties took effect — whipsawed stocks and rocked major indices.Read more...",
    "link": "https://qz.com/djia-sp500-nasdaq-trump-tariffs-stocks-apple-tesla-1851775583",
    "timestamp": "2025-04-10T12:20:00Z"
  },
  {
    "title": "Audi’s Best-Selling SUV Unsellable in US Thanks to Trump Tariffs",
    "description": "The Audi Q5 is the German brand’s top-selling vehicle in the US. It’s also a prime example of how Donald Trump’s drastic reordering of global trade is wreaking havoc on automakers.",
    "link": "https://financialpost.com/pmn/business-pmn/audis-best-selling-suv-unsellable-in-us-thanks-to-trump-tariffs",
    "timestamp": "2025-04-10T12:19:39Z"
  },
  {
    "title": "Fact Check: Whoopi Goldberg Falsely Claims Egg Prices Have Not Come Down Since Trump Took Office",
    "description": "Egg prices have not fallen by “one cent” since President Donald Trump took office, “The View” co-host Whoopi Goldberg gushed Wednesday. She's wrong.\nThe post Fact Check: Whoopi Goldberg Falsely Claims Egg Prices Have Not Come Down Since Trump Took Office appe…",
    "link": "https://www.breitbart.com/entertainment/2025/04/10/fact-check-whoopi-goldberg-falsely-claims-egg-prices-have-not-come-down-since-trump-took-office/",
    "timestamp": "2025-04-10T12:18:13Z"
  },
  {
    "title": "Ahead of Trump admin-Iran talks, new report says Iran nuclear threat rises to 'extreme danger'",
    "description": "The Trump administration is set to hold talks in Oman on Saturday with Iran on the regime's nuclear program. This comes as a new report warns Iran is nearing the capability to build a atomic weapon.",
    "link": "https://www.foxnews.com/world/ahead-trump-admin-iran-talks-new-report-says-iran-nuclear-threat-rises-extreme-danger",
    "timestamp": "2025-04-10T12:17:32Z"
  },
  {
    "title": "Democrat Protesters Make Fools of Themselves on the Streets, Again",
    "description": "Recent protests have sparked debate as Democratic demonstrators prioritize spectacle over substance. This analysis delves into their approach and the implications for political discourse.\nThe post Democrat Protesters Make Fools of Themselves on the Streets, A…",
    "link": "https://gatewayhispanic.com/video/democratic-protesters-make-fools-of-themselves-on-the-streets-again/",
    "timestamp": "2025-04-10T12:15:06Z"
  },
  {
    "title": "Tariffs, Trade Tensions May Be Positive for Bitcoin Adoption in Medium Term: Grayscale",
    "description": "Tariffs contribute to stagflation, and this benefits scarce assets such as gold and bitcoin, the report said.",
    "link": "https://www.coindesk.com/markets/2025/04/10/tariffs-trade-tensions-may-be-positive-for-bitcoin-adoption-in-medium-term-grayscale",
    "timestamp": "2025-04-10T12:14:36Z"
  },
  {
    "title": "Government protects labor-intensive industries following US tariffs",
    "description": "Deputy Minister of Trade Dyah Roro Esti Widya Putri stated that the government&#39;s strategy to respond to the United States&#39; (US&#39;) reciprocal ...",
    "link": "https://en.antaranews.com/news/351293/government-protects-labor-intensive-industries-following-us-tariffs",
    "timestamp": "2025-04-10T12:14:13Z"
  },
  {
    "title": "U.S.-Russia ballerina freed in prisoner swap",
    "description": "Ksenia Karelina, jailed over a $50 donation to Ukraine, released after U.S.-Russia prisoner swap.",
    "link": "https://www.npr.org/2025/04/10/nx-s1-5358937/u-s-russia-ballerina-freed-in-prisoner-swap",
    "timestamp": "2025-04-10T12:13:48Z"
  },
  {
    "title": "Wasserman Schultz on if Dems Need Message Beyond Opposing Trump: ‘Our Message Has Been Resonating’",
    "description": "On Wednesday’s broadcast of NewsNation’s “On Balance,” Rep. Debbie Wasserman Schultz (D-FL) responded to a question on whether Democrats need a message besides opposing President Donald Trump by stating that “Our message has been resonating.” Host Leland Vitt…",
    "link": "https://freerepublic.com/focus/f-news/4310134/posts",
    "timestamp": "2025-04-10T12:13:02Z"
  },
  {
    "title": "Johnson vows to try again after GOP holdouts block action on Trump’s ‘big, beautiful’ budget bill",
    "description": "House Speaker Mike Johnson is now trying to figure out the cuts and savings “that will satisfy everyone.”",
    "link": "https://www.bostonherald.com/2025/04/10/congress-johnson-trump-budget-bill/",
    "timestamp": "2025-04-10T12:12:45Z"
  },
  {
    "title": "The Download: AI co-creativity, and what Trump’s tariffs mean for batteries",
    "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. How AI can help supercharge creativity Existing generative tools can automate a striking range of creative tasks and offe…",
    "link": "https://www.technologyreview.com/2025/04/10/1114848/the-download-ai-co-creativity-and-what-trumps-tariffs-mean-for-batteries/",
    "timestamp": "2025-04-10T12:10:00Z"
  },
  {
    "title": "Trump signs order to 'make America's showers great again'",
    "description": "The US president says he wants to \"take care of my beautiful hair\" as he eases water flow rules.",
    "link": "https://www.bbc.com/news/articles/cm2eeggyppzo",
    "timestamp": "2025-04-10T12:09:32Z"
  },
  {
    "title": "Donald Trump signs order to 'make America's showers great again'",
    "description": "The US president says he wants to \"take care of my beautiful hair\" as he eases water flow rules.",
    "link": "https://www.bbc.co.uk/news/articles/cm2eeggyppzo",
    "timestamp": "2025-04-10T12:09:32Z"
  },
  {
    "title": "China begins new 84% tariffs on US imports",
    "description": "China officially commenced the implementation of its planned retaliatory tariffs on US goods on Thursday, imposing an additional 84 per cent duty on imports from the U.S. The move came after Washington escalated its trade pressure, with U.S. President Donald …",
    "link": "https://punchng.com/china-begins-new-84-tariffs-on-us-imports/",
    "timestamp": "2025-04-10T12:09:03Z"
  },
  {
    "title": "Trump tariffs drive China, EU to diversify trade",
    "description": "Faced with steep US tariffs, China and the EU are racing to find new trade partners. But with crowded global markets, is Europe again at risk of becoming the world's dumping ground for cheap goods?",
    "link": "https://www.dw.com/en/trump-tariffs-drive-china-eu-to-diversify-trade/a-72176478",
    "timestamp": "2025-04-10T12:09:00Z"
  },
  {
    "title": "Germany's economy is expected to stagnate at best this year",
    "description": "Leading think tanks say that Germany’s economy is likely to stagnate at best in 2025 after shrinking for two years and the impact of U.S. tariffs could weigh down an already unimpressive showing",
    "link": "https://abcnews.go.com/International/wireStory/germanys-economy-expected-stagnate-best-year-120673873",
    "timestamp": "2025-04-10T12:08:20Z"
  },
  {
    "title": "Trump Tariff Confusion Fuels Online Scams",
    "description": "Donald Trump's scatter-gun imposition of tariffs is causing uncertainty around the world—and cybercriminals are exploiting the confusion to spread scams.",
    "link": "https://www.forbes.com/sites/emmawoollacott/2025/04/10/trump-tariff-confusion-fuels-online-scams/",
    "timestamp": "2025-04-10T12:08:15Z"
  },
  {
    "title": "Late Night Host Nukes Trump’s Entire Tariff Saga in 67 Seconds Flat",
    "description": "Late Night host Seth Meyers completely wrecked President Donald Trump’s weeks-long tariff saga in a stunning riff that lasted barely more than a minute.\nThe post Late Night Host Nukes Trump’s Entire Tariff Saga in 67 Seconds Flat first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/late-night-host-nukes-trumps-entire-tariff-saga-in-67-seconds-flat/",
    "timestamp": "2025-04-10T12:07:55Z"
  },
  {
    "title": "American War Against China",
    "description": "In 1997, a group of future members of George W. Bush’s administration co-signed onto the “Project for the New American Century.“ The statement of its core principles declared: \n“we need to accept responsibility for America’s unique role in preserving and …\nTh…",
    "link": "https://www.globalresearch.ca/american-war-against-china/5884099",
    "timestamp": "2025-04-10T12:07:12Z"
  },
  {
    "title": "What Will Xi Jinping do after Donald Trump imposes 104% tariffs on China? Will he sell $760 billion in U.S. debt, Beijing's most underused weapon? Here are his options",
    "description": "The US-China trade war is intensifying, with President Trump’s 104% tariff on Chinese goods pushing both nations to the brink. China’s $760 billion in U.S. Treasury bonds has emerged as a potential tool for retaliation, but experts caution that selling them c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-will-xi-jinping-do-after-donald-trump-imposes-104-tariffs-on-china-will-he-sell-760-billion-in-u-s-debt-beijings-most-underused-weapon-here-are-his-options/articleshow/120158236.cms",
    "timestamp": "2025-04-10T12:07:03Z"
  },
  {
    "title": "Fox News Airs Supercut Of Trump, Officials Faceplanting On Tariffs",
    "description": "“That is sort of obvious,” said one. But it wasn’t.",
    "link": "https://www.huffpost.com/entry/fox-news-montage-trump-tariffs_n_67f79d0fe4b0c6da0010c797",
    "timestamp": "2025-04-10T12:06:57Z"
  },
  {
    "title": "EU pauses retaliatory tariffs on US goods for 90 days",
    "description": "The News\nThe European Union announced Thursday that it would suspend its retaliatory tariffs on US goods for 90 days, after US President Donald Trump backed down on his ‘Liberation Day’ levies.\nEuropean Commission President Ursula von der Leyen said the EU wa…",
    "link": "https://biztoc.com/x/edf93e0d14a9adfe",
    "timestamp": "2025-04-10T12:06:54Z"
  },
  {
    "title": "Capitol agenda: A brutal blow for Johnson and Trump",
    "description": "Donald Trump and Mike Johnson failed to convince enough deficit hawks to back the latest budget plan for the president’s agenda — forcing the speaker to punt his planned Wednesday vote on the resolution and sending House leadership scrambling for a compromise…",
    "link": "https://biztoc.com/x/95a6089569569a4f",
    "timestamp": "2025-04-10T12:06:36Z"
  },
  {
    "title": "Trump’s ‘buy’ tip on social media before his tariffs pause made money for investors who listened",
    "description": "By BERNARD CONDON, Associated Press Business Writer\nNEW YORK (AP) — When Donald Trump offered some financial advice Wednesday morning, stocks were wavering between gains and losses.\nBut that was about to change.\n“THIS IS A GREAT TIME TO BUY!!! DJT,” he wrote …",
    "link": "https://biztoc.com/x/fa5c82a0093ca209",
    "timestamp": "2025-04-10T12:06:20Z"
  },
  {
    "title": "'One-two punch': Reporter says MAGA allies 'see weakness' after standing up to Trump",
    "description": "President Donald Trump received a “one-two punch” which proved “there are, in fact, checks on his power: the markets and, if you squint, his own party,” according to Rachael Bade opined in her Thursday morning politico column. Both the global tariffs, which p…",
    "link": "https://www.rawstory.com/trump-tariffs-2671737236/",
    "timestamp": "2025-04-10T12:06:02Z"
  },
  {
    "title": "Islamic State regains strength in Syria",
    "description": "Recent developments could make it easier for group to show renewed vigour, say experts",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/04/09/world/middleeast/syria-isis-prisoners.html",
    "timestamp": "2025-04-10T12:05:11Z"
  },
  {
    "title": "Trump's 'buy' tip on social media before his tariffs pause made money for investors who listened",
    "description": "NEW YORK - When Donald Trump offered some financial advice Wednesday morning, stocks were wavering between gains and losses.",
    "link": "https://timesofindia.indiatimes.com/world/us/trumps-buy-tip-on-social-media-before-his-tariffs-pause-made-money-for-investors-who-listened/articleshow/120158411.cms",
    "timestamp": "2025-04-10T12:03:10Z"
  },
  {
    "title": "Trump tariffs weigh on Germany as institutes cut forecasts",
    "description": "Leading economic institutes Thursday slashed their 2025 growth forecast for Germany to near stagnation, warning Europe’s struggling top economy will face extra pain from US President Donald Trump’s tariff blitz. The six think-tanks, in their latest joint fore…",
    "link": "https://www.digitaljournal.com/world/trump-tariffs-weigh-on-germany-as-institutes-cut-forecasts/article",
    "timestamp": "2025-04-10T12:02:34Z"
  },
  {
    "title": "Here’s What the Supreme Court’s Recent Rubber-Stamp Rulings Are All About",
    "description": "Elie Mystal\n\n\n\nThe spate of recent Supreme Court decisions overturning Trump administration losses in the lower courts are all about saving face—and securing power.\r\n\n\r\n\n\nThe post Here’s What the Supreme Court’s Recent Rubber-Stamp Rulings Are All About appea…",
    "link": "https://www.thenation.com/article/politics/supreme-courts-rulings-abrego-garcia/",
    "timestamp": "2025-04-10T12:01:00Z"
  },
  {
    "title": "GOP Rep Introduces Bill After Discovering Chinese Communist-Owned Stores on US Military Base",
    "description": "Rep. Pat Harrigan's recent bill aims to address national security concerns raised by Chinese Communist-owned GNC stores on U.S. military bases, highlighting the complexities of foreign influence in sensitive areas.\nThe post GOP Rep Introduces Bill After Disco…",
    "link": "https://www.thegatewaypundit.com/2025/04/gop-rep-introduces-bill-discovering-chinese-communist-owned/",
    "timestamp": "2025-04-10T12:00:51Z"
  },
  {
    "title": "Ksenia Karelina, a US-Russia dual national, freed in a prisoner swap between Moscow and Washington",
    "description": "A U.S.-Russian dual national imprisoned in Russia was freed Thursday in exchange for a Russian-German man.",
    "link": "https://www.bostonherald.com/2025/04/10/us-russia-prisoner-swap/",
    "timestamp": "2025-04-10T12:00:24Z"
  },
  {
    "title": "Trump reportedly suspends Nvidia H20 export ban plan after $1 million dinner with Jensen Huang",
    "description": "U.S. gov't no longer plans to curb sales of Nvidia's H20 to China after Trump and Huang met in Mar-a-Lago to discuss Nvidia's investments in U.S.",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/trump-reportedly-suspends-nvidia-h20-export-ban-plan-after-usd1-million-dinner-with-jensen-huang",
    "timestamp": "2025-04-10T12:00:22Z"
  },
  {
    "title": "Posthaste: CIBC economist warns Canada will end up more tied to U.S. once the tariff dust settles",
    "description": "Benjamin Tal says in a trade war stare down between the U.S. and China, Canada will be forced to choose sides. Keep reading here.",
    "link": "https://financialpost.com/news/cibc-warns-canada-choose-sides-trade-war",
    "timestamp": "2025-04-10T12:00:21Z"
  },
  {
    "title": "Jamie Dimon Appeared on Maria Bartiromo to Warn of Recession Because He Figured Trump Would Tune In — And He Was Right",
    "description": "JPMorgan Chase CEO Jamie Dimon’s reportedly intentional message on tariffs during a Wednesday interview with Fox Business host Maria Bartiromo’s may have been the nudge President Donald Trump needed to take the leap on his stunning tariffs pause. As financial…",
    "link": "https://www.mediaite.com/tv/jamie-dimon-appeared-on-maria-bartiromo-to-warn-of-recession-because-he-figured-trump-would-tune-in-and-he-was-right/",
    "timestamp": "2025-04-10T12:00:16Z"
  },
  {
    "title": "Tesla registrations in Colorado drop nearly 10% over discontent with Elon Musk",
    "description": "“Tesla is taking a beating right now, mostly over politics.\"",
    "link": "https://www.denverpost.com/2025/04/10/tesla-protests-elon-musk-sales-colorado/",
    "timestamp": "2025-04-10T12:00:04Z"
  },
  {
    "title": "Election-Denying, Fake COVID Cure-Pushing Fabulist Is Now Driving Trump Tariff Scheme",
    "description": "Peter Navarro spent four months in prison for refusing to tell Congress about his plan to steal the 2020 election for Trump, but that didn't stop him from returning as a top trade adviser.",
    "link": "https://www.huffpost.com/entry/trump-peter-navarro-tariff_n_67f68d91e4b042fce4c32c1a",
    "timestamp": "2025-04-10T12:00:02Z"
  },
  {
    "title": "Cory Booker’s Blab-a-Thon Underlines ‘Fact-Checker’ Tilt",
    "description": "On April 7, Facebook pulled the plug on the censorship of “independent fact-checkers,” replacing it with a “Community Notes” approach, like Elon Musk’s X uses.... Read More\nThe post Cory Booker’s Blab-a-Thon Underlines ‘Fact-Checker’ Tilt appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/04/10/cory-bookers-blab-a-thon-underlines-fact-checker-tilt/",
    "timestamp": "2025-04-10T12:00:00Z"
  }
]