[
  {
    "title": "Police Offering $50,000 Reward in Search for Savannah Guthrie’s Mom Nancy; Still ‘No Suspects’ or ‘Persons of Interests’ After 5 Days",
    "description": "Sheriff Chris Nanos told reporters during a press conference on Thursday that the police are offering a $50,000 missing person reward in the search for Nancy Guthrie, mother of “Today” co-anchor Savannah Guthrie. Nanos also shared that no suspect has been ide…",
    "link": "https://variety.com/2026/tv/news/savannah-guthrie-mother-nancy-reward-1236652725/",
    "timestamp": "2026-02-05T18:38:29Z"
  },
  {
    "title": "Trump Doesn’t Appear to Notice as Lawmaker Unleashes Veiled Swipes at Him During National Prayer Breakfast Blessing",
    "description": "President Donald Trump didn't seem to notice as Rep. Jonathan Jackson (D-IL) snuck in a few apparent criticisms aimed at the commander in chief during the National Prayer Breakfast on Thursday.\nThe post Trump Doesn’t Appear to Notice as Lawmaker Unleashes Vei…",
    "link": "https://www.mediaite.com/media/news/trump-doesnt-appear-to-notice-as-lawmaker-unleashes-veiled-swipes-at-him-during-national-prayer-breakfast-blessing/",
    "timestamp": "2026-02-05T18:37:19Z"
  },
  {
    "title": "New Project 2025-Backed Trump Rule Guts Protections for 50,000 Federal Workers",
    "description": "The Trump administration on Thursday finalized a major civil service rule change that makes it easier to fire certain federal employees and replace them with political loyalists—a move that critics say increases the likelihood of abuse of power. The new polic…",
    "link": "https://www.commondreams.org/news/opm-rule-change",
    "timestamp": "2026-02-05T18:35:53Z"
  },
  {
    "title": "Woman Who Actually Supports Trump Will Guest Host ‘The View’",
    "description": "Savannah Chrisley, an outspoken supporter of President Donald Trump, will be one of the guest hosts on \"The View.\"",
    "link": "https://dailycaller.com/2026/02/05/savannah-chrisley-the-view-trump/",
    "timestamp": "2026-02-05T18:34:40Z"
  },
  {
    "title": "As Trump reshapes foreign policy, China moves to limit risks, reap gains - NPR",
    "description": "As Trump reshapes foreign policy, China moves to limit risks, reap gainsNPR Donald Trump is making China great again | Steven GreenhouseThe Guardian Podcast: How Trump’s Year of Disruption Has Only Helped ChinaBloomberg.com How Trump is giving China a chance …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180736014",
    "timestamp": "2026-02-05T18:33:06Z"
  },
  {
    "title": "California’s instant EV rebates would require automakers to match state funds",
    "description": "New budget language lays out how Gov. Gavin Newsom plans to structure a $200 million electric vehicle rebate program, including price caps, automaker matching funds and a focus on first-time buyers…",
    "link": "https://www.ocregister.com/2026/02/05/californias-instant-ev-rebates-would-require-automakers-to-match-state-funds/",
    "timestamp": "2026-02-05T18:33:04Z"
  },
  {
    "title": "Fact check: Trump repeats lies about inflation, immigration and elections in NBC interview | CNN Politics",
    "description": "When President Donald Trump claimed to NBC Nightly News anchor Tom Llamas in a Wednesday interview that “I’m getting – starting to get great polls on the economy,” Llamas quickly pushed back by noting that Trump’s polling on the economy is “not great.”",
    "link": "https://www.cnn.com/2026/02/05/politics/fact-check-trump-nbc-interview",
    "timestamp": "2026-02-05T18:30:47Z"
  },
  {
    "title": "Trump to launch TrumpRx.gov, branding his push to lower prescription prices (Dan Diamond/Washington Post)",
    "description": "Dan Diamond / Washington Post:\nTrump to launch TrumpRx.gov, branding his push to lower prescription prices  —  The president has argued his drug-pricing initiative “should win us the midterms.”  Experts say its impact could be positive but limited.  —  Presid…",
    "link": "https://www.memeorandum.com/260205/p68",
    "timestamp": "2026-02-05T18:30:00Z"
  },
  {
    "title": "New poll: Optimism about personal finances on the rise under Trump",
    "description": "'Since the depths of despair in the midst of that government shutdown a couple of months ago, 4 out of 5 polls have shown some improvement'",
    "link": "https://www.wnd.com/2026/02/new-poll-optimism-about-personal-finances-rise-under/",
    "timestamp": "2026-02-05T18:29:23Z"
  },
  {
    "title": "BRIAN MAY On Why QUEEN Won't Tour America Right Now: \"It's A Dangerous Place At The Moment\"",
    "description": "Brian May revealed Queen has no plans to tour the United States in the foreseeable future, citing concerns it's become too dangerous.\nThe post BRIAN MAY On Why QUEEN Won't Tour America Right Now: \"It's A Dangerous Place At The Moment\" appeared first on Metal …",
    "link": "https://metalinjection.net/news/brian-may-on-why-queen-wont-tour-america-right-now-its-a-dangerous-place-at-the-moment",
    "timestamp": "2026-02-05T18:28:54Z"
  },
  {
    "title": "Bitcoin Crash Could Deepen to $38K, Say Analysts—Here's Why",
    "description": "Bitcoin has already tumbled far from its October high, but history suggests the rout could deepen before momentum shifts, according to Stifel.",
    "link": "https://decrypt.co/357089/bitcoin-crash-deepen-38k-analysts-heres-why",
    "timestamp": "2026-02-05T18:27:48Z"
  },
  {
    "title": "Trump administration reclassifies 50,000 federal workers—here's what can happen post this",
    "description": "The Trump administration has issued a rule reclassifying approximately 50,000 senior federal workers into a new \"Schedule Policy/Career\" category. This change aims to make it easier to fire employees involved in policy for poor performance or misconduct. The …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-reclassifies-50000-federal-workersheres-what-can-happen-post-this/articleshow/127948073.cms",
    "timestamp": "2026-02-05T18:25:45Z"
  },
  {
    "title": "Cuba president open to dialogue with US, rejects 'pressure'",
    "description": "The US has prevented oil shipments to Cuba in recent weeks, plunging the country into deeper and more frequent blackouts. Cuba's president said that any talks must be held without interference in its internal affairs.",
    "link": "https://www.dw.com/en/cuba-us-trump-dialogue-talks-blackout-oil/a-75828676",
    "timestamp": "2026-02-05T18:23:00Z"
  },
  {
    "title": "Epstein emails lead Brad Karp to resign as Paul Weiss law firm chairman",
    "description": "The chairman of a major US law firm has stepped down due to the release of extensive emails between him and the late sex offender Jeffrey Epstein.",
    "link": "https://www.channelnewsasia.com/world/epstein-emails-lead-brad-karp-resign-paul-weiss-law-firm-chairman-5910766",
    "timestamp": "2026-02-05T18:23:00Z"
  },
  {
    "title": "Trump backs down on dispute with ally while threatening to take another land mass by force",
    "description": "President Donald Trump walked back his criticism of UK Prime Minister Keir Starmer's agreement to transfer ownership of a strategically located island to Mauritius.The 79-year-old president has complained that the United Kingdom plans to decolonize the Chagos…",
    "link": "https://www.rawstory.com/trump-diego-garcia-threat-force/",
    "timestamp": "2026-02-05T18:22:10Z"
  },
  {
    "title": "Bitcoin slump shakes companies that jumped on crypto-hoarding bandwagon",
    "description": "Feb 5 : Turbulence in the cryptocurrency market is dragging down shares of companies that hold bitcoin and other digital assets on their balance sheets, sparking concerns over potential broader strains in the sector. The number of publicly traded companies in…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-slump-shakes-companies-jumped-crypto-hoarding-bandwagon-5910816",
    "timestamp": "2026-02-05T18:21:18Z"
  },
  {
    "title": "Air National Guard officer: ‘This is the honor of a lifetime. I will not let you or Georgia’s 14th District down’",
    "description": "... Read more",
    "link": "https://www.wnd.com/2026/02/air-national-guard-officer-this-is-honor-lifetime/",
    "timestamp": "2026-02-05T18:20:49Z"
  },
  {
    "title": "Trump signals US support for Chagos handover deal",
    "description": "It comes after the US president suggested last month he could withdraw his support for the deal.",
    "link": "https://www.bbc.com/news/articles/c5yx1wedww2o",
    "timestamp": "2026-02-05T18:19:17Z"
  },
  {
    "title": "Having A Bad Day? One Tuesday For 100-Year-Old War Hero Was Literally Unfathomable",
    "description": "President Donald Trump said he will honor a 100-year-old Navy veteran with the Medal of Honor for a secret dogfight against seven Soviet jets from decades ago.",
    "link": "https://dailycaller.com/2026/02/05/royce-williams-medal-of-honor-trump-korean-war-pilot-soviets/",
    "timestamp": "2026-02-05T18:18:50Z"
  },
  {
    "title": "Bannon Calls for ICE to Engage in Voter Intimidation During the Midterms",
    "description": "“You're damn right we're gonna have ICE surround the polls come November,” former Trump strategist Steve Bannon said.",
    "link": "https://truthout.org/articles/bannon-calls-for-ice-to-engage-in-voter-intimidation-during-the-midterms/",
    "timestamp": "2026-02-05T18:17:35Z"
  },
  {
    "title": "U.S. embassy cuts ties with Polish official over Trump insults",
    "description": "WARSAW, Feb. 5 (Xinhua) -- The U.S. Embassy will have \"no further dealings\" with Polish parliament speaker Wlodzimierz Czarzasty after he insulted U.S. President Donald Trump, U.S. Ambassador to Poland Tom Rose said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/06/us-embassy-cuts-ties-with-polish-official-over-trump-insults",
    "timestamp": "2026-02-05T18:17:00Z"
  },
  {
    "title": "WATCH: Entire Crowd of Wrestling Fans Chant ‘F*ck ICE!’ in Jarring Trump Rebuke",
    "description": "A pro wrestling crowd broke out into a \"Fuck ICE\" chant in the middle of a match during Wednesday night's AEW event in Las Vegas.\nThe post WATCH: Entire Crowd of Wrestling Fans Chant ‘F*ck ICE!’ in Jarring Trump Rebuke first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/sports/watch-entire-crowd-of-wrestling-fans-chants-fck-ice-in-jarring-trump-rebuke/",
    "timestamp": "2026-02-05T18:16:44Z"
  },
  {
    "title": "US-Russia nuclear arms treaty expires as Trump looks to include China",
    "description": "US-Russia nuclear arms treaty expires as Trump looks to include Chinago.com",
    "link": "https://abcnews.go.com/Politics/us-russia-nuclear-arms-treaty-expires-trump-include/story?id=129865642",
    "timestamp": "2026-02-05T18:15:35Z"
  },
  {
    "title": "Donald Trump signals US support for Chagos handover deal",
    "description": "It comes after the US president suggested last month he could withdraw his support for the deal.",
    "link": "https://www.bbc.co.uk/news/articles/c5yx1wedww2o",
    "timestamp": "2026-02-05T18:15:33Z"
  },
  {
    "title": "Prince Andrew's biographer flags Trump links 'clearly taken out' of Epstein files",
    "description": "WASHINGTON — Donald Trump’s connections with the former Prince Andrew are “very close,” a biographer of the disgraced British royal said, rejecting Trump’s denials and saying evidence of the relationship had been taken out of files relating to investigations …",
    "link": "https://www.rawstory.com/trump-epstein-2675101975/",
    "timestamp": "2026-02-05T18:14:28Z"
  },
  {
    "title": "Trump says Chagos air base talks with UK’s Starmer were productive",
    "description": "Feb 5 (Reuters) - U.S. President Donald Trump on Thursday said he had productive discussions with British Prime Minister Keir Starmer about the Diego Garcia air base in t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-says-chagos-air-base-talks-with-uk-s-starmer-were-productive",
    "timestamp": "2026-02-05T18:13:43Z"
  },
  {
    "title": "Trump administration moves to end job protections for about 50,000 federal workers",
    "description": "The Donald Trump administration on Thursday finalized its overhaul of the U.S. government's civil service system, ​according to a government statement, which would give the president the power to hire and fire an estimated 50,000 career federal employees.",
    "link": "https://www.cbc.ca/news/world/trump-opb-kupor-civil-service-changes-9.7075508",
    "timestamp": "2026-02-05T18:13:13Z"
  },
  {
    "title": "Bad Bunny is a controversial pick for the Super Bowl – and that’s the point",
    "description": "Bad Bunny’s rise is inseparable from his activism, which is woven into his artistic choices, television appearances and live performances.",
    "link": "https://theconversation.com/bad-bunny-is-a-controversial-pick-for-the-super-bowl-and-thats-the-point-274477",
    "timestamp": "2026-02-05T18:12:30Z"
  },
  {
    "title": "Why raising NHS spending on new drugs by 25% is the wrong decision – health economist’s view",
    "description": "Giving ministers more power over NHS drug pricing could reshape how public money is spent on health.",
    "link": "https://theconversation.com/why-raising-nhs-spending-on-new-drugs-by-25-is-the-wrong-decision-health-economists-view-273952",
    "timestamp": "2026-02-05T18:12:28Z"
  },
  {
    "title": "Twinless: a sweet, funny and uplifting portrayal of male friendship",
    "description": "The friendship here depicts something that our culture usually finds very difficult to imagine: an image of straight masculinity that is actually lovely.",
    "link": "https://theconversation.com/twinless-a-sweet-funny-and-uplifting-portrayal-of-male-friendship-274674",
    "timestamp": "2026-02-05T18:12:09Z"
  },
  {
    "title": "George Orwell called for a new way of thinking about science",
    "description": "Orwell argued that you don’t have to be a scientist to think more scientifically.",
    "link": "https://theconversation.com/george-orwell-called-for-a-new-way-of-thinking-about-science-274447",
    "timestamp": "2026-02-05T18:12:05Z"
  },
  {
    "title": "A timeline of Jeffrey Epstein investigation and government file release",
    "description": "Explore the timeline of Jeffrey Epstein’s investigations, Ghislaine Maxwell conviction, and Justice Department document releases detailing the high-profile sex trafficking case.",
    "link": "https://www.thehindubusinessline.com/news/world/a-timeline-of-jeffrey-epstein-investigation-and-government-file-release/article70597336.ece",
    "timestamp": "2026-02-05T18:10:57Z"
  },
  {
    "title": "Trump acknowledges Nigeria’s First Lady at National Prayer Breakfast",
    "description": "At the National Prayer Breakfast, Donald Trump acknowledged Nigeria’s First Lady, Remi Tinubu, highlighting her role as a Christian pastor and faith leader\n\nRead More: https://punchng.com/trump-acknowledges-nigerias-first-lady-at-national-prayer-breakfast/",
    "link": "https://punchng.com/trump-acknowledges-nigerias-first-lady-at-national-prayer-breakfast/",
    "timestamp": "2026-02-05T18:10:03Z"
  },
  {
    "title": "Bitcoin Drops, Driving $2 Trillion Slide In Crypto Market Value",
    "description": "The world's largest cryptocurrency fell to a low of $66,675.12, its weakest since October 2024, a month before Trump won the U.S. presidential election.",
    "link": "https://www.huffpost.com/entry/bitcoin-drops-driving-2-trillion-slide-in-crypto-market-value_n_6984db1de4b03d9739277d77",
    "timestamp": "2026-02-05T18:09:17Z"
  },
  {
    "title": "Chairman of prominent law firm Paul Weiss resigns after release of emails linking him to Epstein",
    "description": "Emails show Brad Karp thanking Epstein for hosting an unforgettable evening in 2015.",
    "link": "https://www.bostonherald.com/2026/02/05/paul-weiss-epstein-resignation/",
    "timestamp": "2026-02-05T18:08:58Z"
  },
  {
    "title": "Trump endorses Hungary’s Orban for re-election ahead of April poll",
    "description": "WASHINGTON, Feb 5 (Reuters) - U.S. President Donald Trump on Thursday endorsed Hungarian Prime Minister Viktor Orban ahead of that country’s April 12 election, calling hi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-endorses-hungary-s-orban-for-re-election-ahead-of-april-poll",
    "timestamp": "2026-02-05T18:07:49Z"
  },
  {
    "title": "The Epstein Files Are Becoming a Witch Hunt",
    "description": "\"This type of broad reveal of criminal investigative files, released to a rabid media, will absolutely result in innocent people being hurt,\" warned Clay Higgins.",
    "link": "https://reason.com/2026/02/05/the-epstein-files-are-becoming-a-witch-hunt/",
    "timestamp": "2026-02-05T18:07:04Z"
  },
  {
    "title": "Elizabeth Warren Eviscerates Scott Bessent: 'I Don't Know If You Can't Hear Me?'",
    "description": "Sen. Elizabeth Warren refused to let Trump Treasury Secretary Scott Bessent lie about the state of the US economy and pounded him into the ground with the efficiency of a nail gun in plywood as he tried to do so. \nThe Senator from Massachusetts started her qu…",
    "link": "https://crooksandliars.com/2026/02/sen-elizabeth-warren-eviceraters-scott",
    "timestamp": "2026-02-05T18:06:57Z"
  },
  {
    "title": "Trump would decide whether to investigate Fed pick Warsh over refusal to cut rates: Bessent",
    "description": "Treasury Secretary Scott Bessent left the door open to suing Kevin Warsh as Fed chair in testimony to the Senate Banking, Housing and Urban Affairs Committee.",
    "link": "https://www.cnbc.com/2026/02/05/bessent-trump-investigation-warsh-warren-fed.html",
    "timestamp": "2026-02-05T18:06:31Z"
  },
  {
    "title": "Chairman of law firm Paul Weiss resigns after release of Epstein emails",
    "description": "The chairman of prestigious law firm Paul Weiss has resigned from that position after emails revealed his exchanges with Jeffrey Epstein. Brad Karp will remain at the firm where he's practiced for 40 years and has served as chairman since 2008. He said in a s…",
    "link": "https://apnews.com/article/epstein-karp-paul-weiss-emails-justice-department-0af16206a386198cd85ade0cd6c807d7",
    "timestamp": "2026-02-05T18:05:50Z"
  },
  {
    "title": "Noem deploys to both borders, says ICE won't be deterred by sanctuary officials who 'want to create conflict'",
    "description": "DHS Secretary Kriti Noem deployed to both borders in one day as Trump administration faces criticism over illegal immigration crackdown operations.",
    "link": "https://www.foxnews.com/politics/noem-deploys-both-borders-says-ice-wont-deterred-sanctuary-officials-want-create-conflict",
    "timestamp": "2026-02-05T18:05:34Z"
  },
  {
    "title": "None More Wonderful Than Man: Art, Artists, and MAGA's Hollow View of Humanity (Alan Elrod/Liberal Currents)",
    "description": "Alan Elrod / Liberal Currents:\nNone More Wonderful Than Man: Art, Artists, and MAGA's Hollow View of Humanity  —  MAGA sees art as nothing more than a tool of self-aggrandizement, and artists as less than human.  —  Donald Trump recently announced that the Ke…",
    "link": "https://www.memeorandum.com/260205/p64",
    "timestamp": "2026-02-05T18:05:04Z"
  },
  {
    "title": "Claude has been having a moment — can it keep it up?",
    "description": "Boris Cherny gets recognized in public relatively often. At the bar, at the airport, and in generally any public space, people want to take selfies with the creator and head of Claude Code. For the last couple of months, Anthropic's Claude and its coding plat…",
    "link": "https://www.theverge.com/report/874308/anthropic-claude-code-opus-hype-moment",
    "timestamp": "2026-02-05T18:03:38Z"
  },
  {
    "title": "The Frightening, Very Real Tool ICE Agents Have to Add You to a “Nice Little Database” if You Attend a Protest",
    "description": "Take these threats literally.",
    "link": "https://slate.com/news-and-politics/2026/02/ice-agents-nice-little-database-google-meta-surveillance.html",
    "timestamp": "2026-02-05T18:03:38Z"
  },
  {
    "title": "A timeline of the Jeffrey Epstein investigation and the fight to make the government’s files public",
    "description": "The release is the culmination of a yearslong fight over the records.",
    "link": "https://www.bostonherald.com/2026/02/05/epstein-timeline/",
    "timestamp": "2026-02-05T18:01:57Z"
  },
  {
    "title": "$500M UAE Funds In Trump-Linked Project Draw Congressional Inquiry",
    "description": "United States Rep. Ro Khanna has opened a focused inquiry into a reported $500 million investment by an Abu Dhabi-linked group in World Liberty Financial, a crypto venture tied to the Trump family. Related Reading: Crypto Downturn Slams Galaxy Digital With $2…",
    "link": "https://bitcoinist.com/500m-uae-funds-in-trump-linked-project-draw-congressional-inquiry/",
    "timestamp": "2026-02-05T18:00:31Z"
  },
  {
    "title": "Elizabeth Warren Throws Down With Scott Bessent on Grocery Prices: You’re ‘Denying the Facts’",
    "description": "\"And under Donald Trump, families are paying more and more for groceries. So if you're just going to insult people by denying the facts...\"\nThe post Elizabeth Warren Throws Down With Scott Bessent on Grocery Prices: You’re ‘Denying the Facts’ first appeared o…",
    "link": "https://www.mediaite.com/media/news/elizabeth-warren-throws-down-with-scott-bessent-on-grocery-prices-youre-denying-the-facts/",
    "timestamp": "2026-02-05T18:00:26Z"
  },
  {
    "title": "Can Foreign Investment Save Venezuela’s Broken Oil Sector?",
    "description": "Venezuela’s autocratic ruling regime, led by interim President Delcy Rodriguez, recently announced it created the legal framework required to privatize Venezuela’s oil industry, thus ending PDVSA’s monopoly. This is in accordance with U.S. President Donald Tr…",
    "link": "https://oilprice.com/Energy/Energy-General/Can-Foreign-Investment-Save-Venezuelas-Broken-Oil-Sector.html",
    "timestamp": "2026-02-05T18:00:00Z"
  },
  {
    "title": "Not Now, Kamala",
    "description": "Kamala Harris has relaunched her @KamalaHQ account as Headquarters, a ‘Gen-Z led progressive content hub.’",
    "link": "http://www.thecut.com/article/what-is-headquarters-kamala-harris-launch.html",
    "timestamp": "2026-02-05T17:59:01Z"
  },
  {
    "title": "‘Sex-rejecting procedures’: Trump works to cut funding of trans ideology overseas",
    "description": "Expands Mexico City Policy to include NGOs promotion unscientific agenda",
    "link": "https://www.wnd.com/2026/02/sex-rejecting-procedures-trump-works-cut-funding-trans/",
    "timestamp": "2026-02-05T17:58:30Z"
  },
  {
    "title": "Pima County Sheriff: Nancy Guthrie Search Update, Watch Live",
    "description": "The search for Nancy Guthrie has entered its fifth day ... and the Pima County Sheriff's Department is staying true to its word and providing another update you can watch live. Sheriff Chris Nanos and other authorities are expected to speak on any…",
    "link": "https://www.tmz.com/2026/02/05/pima-county-sheriff-nancy-guthrie-update-live-stream/",
    "timestamp": "2026-02-05T17:57:59Z"
  },
  {
    "title": "Nigeria deploys troops after suspected jihadist fighters killed 170 in overnight attack",
    "description": "Tuesday's assault on Woro village was the deadliest this year in the state bordering Niger, a hotspot where Islamic State West Africa Province and other armed groups have stepped up village attacks and mass kidnappings.",
    "link": "https://nypost.com/2026/02/05/world-news/nigeria-deploys-troops-after-suspected-jihadists-killed-170-in-overnight-attack/",
    "timestamp": "2026-02-05T17:57:41Z"
  },
  {
    "title": "Jen Psaki Sounds Alarm on Trump Over New Election Rant: ‘Laying the Groundwork’ to ‘Undermine’ Midterms",
    "description": "MS NOW host Jen Psaki ripped Trump’s newest rant about taking over elections, warning he's \"laying the groundwork\" to undermine the midterms if he loses.\nThe post Jen Psaki Sounds Alarm on Trump Over New Election Rant: ‘Laying the Groundwork’ to ‘Undermine’ M…",
    "link": "https://www.mediaite.com/media/news/jen-psaki-sounds-alarm-on-trump-over-new-election-rant-laying-the-groundwork-to-undermine-midterms/",
    "timestamp": "2026-02-05T17:57:05Z"
  },
  {
    "title": "Why Washington takes ‘Russophobic steps’",
    "description": "The Trump administration must balance appeasing its European allies and Russophobes at home while pursuing its economic interests Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632071-lavrov-trump-russophobic-steps/",
    "timestamp": "2026-02-05T17:56:39Z"
  },
  {
    "title": "Cubans rendered powerless as outages persist and tensions with US escalate",
    "description": "Many have been forced to cook with coal and firewood.",
    "link": "https://www.bostonherald.com/2026/02/05/cuba-powerless/",
    "timestamp": "2026-02-05T17:56:15Z"
  },
  {
    "title": "Trump endorses Japanese PM Takaichi ahead of Sunday election",
    "description": "Feb 5 (Reuters) - U.S President Donald Trump on Thursday said Japanese Prime Minister Sanae Takaichi had his “total endorsement” ahead of a legislative election in the ea… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-endorses-japanese-pm-takaichi-ahead-of-sunday-election",
    "timestamp": "2026-02-05T17:54:52Z"
  },
  {
    "title": "Disney exec Dana Walden’s friendship with Kamala Harris may have hurt her chances of becoming CEO: report",
    "description": "One possible disadvantage for Walden may have been her decades-long friendship with Harris, who got trounced in the 2024 election by Donald Trump.",
    "link": "https://nypost.com/2026/02/05/business/disney-exec-dana-waldens-friendship-with-kamala-harris-may-have-affected-ceo-chances-report/",
    "timestamp": "2026-02-05T17:54:10Z"
  },
  {
    "title": "The Olympics arrive with the US a favorite, rekindling fond memories of 1980’s ‘Miracle on Ice’",
    "description": "The legend of the gold-medal-winning 1980 U.S. Olympic team only grows with time.",
    "link": "https://www.bostonherald.com/2026/02/05/miracle-on-ice-olympics/",
    "timestamp": "2026-02-05T17:53:06Z"
  },
  {
    "title": "Fiscal watchdog warns defence targets will mean soaring deficits",
    "description": "The fiscal watchdog projects the commitment to increase defence spending to at least 5 per cent of the economy will increase the deficit.",
    "link": "https://nationalpost.com/news/canada/fiscal-watchdog-warns-defence-targets-will-mean-soaring-deficits",
    "timestamp": "2026-02-05T17:52:37Z"
  },
  {
    "title": "CNN’s Harry Enten Spells Out Bad News For Left Who Think Trump’s Grip On GOP Weakening",
    "description": "Harry Enten said that the percentage of Republicans who believe President Donald Trump has \"had a good effect on the GOP\" was tied with its record high.",
    "link": "https://dailycaller.com/2026/02/05/cnns-harry-enten-spells-out-bad-news-for-left-who-think-trumps-grip-on-gop-weakening/",
    "timestamp": "2026-02-05T17:51:11Z"
  },
  {
    "title": "Layoffs Surge to Nearly 20-Year High as Job Openings Plummet",
    "description": "Donald Trump’s economy has led to the worst January in job cuts since the Great Recession in 2009.U.S.-based employers laid off 108,435 employees last month, three times as many as in December and twice as many as January 2025, according to a monthly report f…",
    "link": "https://newrepublic.com/post/206208/january-layoffs-surge-trump-great-recession",
    "timestamp": "2026-02-05T17:50:55Z"
  },
  {
    "title": "Trump says he will stay out of Netflix-Paramount fight over Warner Bros",
    "description": "Warner Bros' film and television studios, along with its vast content library and franchises, are attracting interest from Netflix and Paramount Skydance. Netflix has put forward an offer of $82.7 billion to acquire Warner Bros Discovery. The U.S. Department …",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-says-he-will-stay-out-of-netflix-paramount-fight-over-warner-bros/articleshow/127948379.cms",
    "timestamp": "2026-02-05T17:50:41Z"
  },
  {
    "title": "Donald Trump Became President By Appealing to Conspiracy Theorists — Now He's Driving Them Away (Mike Rothschild/Talking Points Memo)",
    "description": "Mike Rothschild / Talking Points Memo:\nDonald Trump Became President By Appealing to Conspiracy Theorists — Now He's Driving Them Away  —  This excerpt is part of TPM Cafe, TPM's home for opinion and news analysis.  —  Donald Trump may not have been the first…",
    "link": "https://www.memeorandum.com/260205/p62",
    "timestamp": "2026-02-05T17:50:01Z"
  },
  {
    "title": "Trump administration to launch TrumpRx website for discounted drugs",
    "description": "The Trump administration is set to launch TrumpRx, a website to help patients buy prescription drugs directly from manufacturers at discounted rates",
    "link": "https://abcnews.go.com/Health/wireStory/trump-administration-launch-trumprx-website-discounted-drugs-129889155",
    "timestamp": "2026-02-05T17:49:52Z"
  },
  {
    "title": "Give Senator Tillis credit for finally saying and doing the right things",
    "description": "when it comes to the issue that dwarfs all others – Trump’s ongoing effort to rend American democracy and impose authoritarianism – Tillis is siding with the patriots.",
    "link": "https://www.ncspin.com/give-senator-tillis-credit-for-finally-saying-and-doing-the-right-things",
    "timestamp": "2026-02-05T17:48:15Z"
  },
  {
    "title": "UAE plans compound for Palestinians in Israeli-held south Gaza, map shows",
    "description": "By Alexander Cornwell JERUSALEM, Feb 5 (Reuters) - The United Arab Emirates has drafted plans to build a compound to house thousands of displaced...",
    "link": "https://www.yahoo.com/news/articles/uae-plans-compound-palestinians-israeli-161426452.html",
    "timestamp": "2026-02-05T17:47:29Z"
  },
  {
    "title": "The Gaza ceasefire began months ago. Here’s why the fighting persists",
    "description": "At least 556 Palestinians have been killed in Israeli strikes since the truce started.",
    "link": "https://www.bostonherald.com/2026/02/05/gaza-ceasefire-fighting-explained/",
    "timestamp": "2026-02-05T17:45:08Z"
  },
  {
    "title": "The Gaza ceasefire began months ago. Here’s why the fighting persists",
    "description": "At least 556 Palestinians have been killed in Israeli strikes since the truce started.",
    "link": "https://www.denverpost.com/2026/02/05/gaza-ceasefire-fighting-explained/",
    "timestamp": "2026-02-05T17:45:08Z"
  },
  {
    "title": "Pete Hegseth will visit Bath Iron Works on Monday",
    "description": "Maine State Police confirmed that the agency is planning security for the defense secretary's stop at the shipyard.",
    "link": "https://www.pressherald.com/2026/02/05/pete-hegseth-will-visit-bath-iron-works-on-monday/",
    "timestamp": "2026-02-05T17:45:05Z"
  },
  {
    "title": "Alaska oil and gas drilling rights to be auctioned on March 9",
    "description": "The auction will be the first in the reserve since 2019 and is part of at least five lease sales mandated under President Donald Trump’s One Big Beautiful Bill Act",
    "link": "https://www.thehindubusinessline.com/markets/commodities/alaska-oil-and-gas-drilling-rights-to-be-auctioned-on-march-9/article70597279.ece",
    "timestamp": "2026-02-05T17:44:49Z"
  },
  {
    "title": "Elon Musk’s SpaceX is worth every penny of its expected IPO",
    "description": "As the hype builds for the reported $1.5 trillion IPO of Elon Musk’s SpaceX later this year, there will be plenty of critics who argue the company’s marketing has more hot air than one of its rockets. It has been claimed by some that the IPO will be worth mor…",
    "link": "https://freerepublic.com/focus/f-news/4365561/posts",
    "timestamp": "2026-02-05T17:44:08Z"
  },
  {
    "title": "US Citizens Describe Being Shot, Harassed, and Threatened by Immigration Agents",
    "description": "“My own government attempted to execute me — and when they failed, they chose to vilify me,” testified Marimar Martinez.",
    "link": "https://www.democracynow.org/2026/2/5/federal_immigration_agents_renee_good_congress",
    "timestamp": "2026-02-05T17:43:18Z"
  },
  {
    "title": "Nvidia's AI Chip Sale to China's ByteDance Stalled by Attempt to Keep Tech Away from Chinese Military",
    "description": "The Trump administration has indicated willingness to permit Chinese technology giant ByteDance to purchase Nvidia's advanced H200 artificial intelligence chips, but the deal remains stalled over disagreements regarding conditions for their use.\nThe post Nvid…",
    "link": "https://www.breitbart.com/tech/2026/02/05/nvidias-ai-chip-sale-to-chinas-bytedance-stalled-by-attempt-to-keep-tech-away-from-chinese-military/",
    "timestamp": "2026-02-05T17:42:14Z"
  },
  {
    "title": "Out of office but back online: Harris rebrands ‘Kamala HQ’ for 2026 midterms amid 2028 buzz",
    "description": "Kamala Harris relaunches \"Kamala HQ\" as \"Headquarters\" youth project, fueling 2028 presidential speculation amid partnership with advocacy group.",
    "link": "https://www.foxnews.com/politics/out-office-back-online-harris-rebrands-kamala-hq-2026-midterms-amid-2028-buzz",
    "timestamp": "2026-02-05T17:42:03Z"
  },
  {
    "title": "Bitcoin’s monthslong slide continues, hitting fresh 15-month low of $67,000",
    "description": "The original cryptocurrency has lost 46% of its value since Oct. 6.",
    "link": "https://www.bostonherald.com/2026/02/05/bitcoin-drop/",
    "timestamp": "2026-02-05T17:41:37Z"
  },
  {
    "title": "'Leaving MAGA' Billboards Urge Pennsylvanians to Leave America First Movement",
    "description": "An organization known as Leaving MAGA has made headlines by putting up signs across Pennsylvania urging MAGA voters to abandon the America First movement.\nThe post ‘Leaving MAGA’ Billboards Urge Pennsylvanians to Leave America First Movement appeared first on…",
    "link": "https://www.breitbart.com/politics/2026/02/05/leaving-maga-billboards-urge-pennsylvanians-leave-america-first-movement/",
    "timestamp": "2026-02-05T17:40:23Z"
  },
  {
    "title": "Trump admits immigration crackdown needs ‘softer touch’ after deaths",
    "description": "US President Donald Trump has said his immigration enforcement policy could use “a softer touch” after two fatal shootings in Minneapolis Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632070-trump-immigration-crackdown-softer-touch/",
    "timestamp": "2026-02-05T17:40:15Z"
  },
  {
    "title": "Steve Kerr Makes U-Turn After He 'Misspoke' in Donald Trump and ICE Criticism",
    "description": "Golden State Warriors head coach Steve Kerr issued an apology for claiming that U.S. Immigration and Customs Enforcement agents are not 'rooting out violent criminals'Golden State Warriors head coach Steve Kerr walked back his previous comments that U.S. Immi…",
    "link": "https://freerepublic.com/focus/f-news/4365560/posts",
    "timestamp": "2026-02-05T17:39:37Z"
  },
  {
    "title": "Mitch McConnell’s Hospital Stay Is Delaying The SAVE Act",
    "description": "Republican Kentucky Sen. Mitch McConnell's hospitalization Monday evening has further stalled the SAVE Act, which has languished in his committee for months.",
    "link": "https://dailycaller.com/2026/02/05/mitch-mcconnell-hospitalized-kentucky-senate-save-act/",
    "timestamp": "2026-02-05T17:39:28Z"
  },
  {
    "title": "“Not an Angel”: Trump Attacks Alex Pretti and Renee Nicole Good",
    "description": "Weeks after their murders, Donald Trump is still bad-mouthing the two U.S. citizens slain by his administration in Minnesota.The president continued to bash Alex Pretti and Renée Nicole Good during a sit-down interview with NBC News Wednesday, telling the net…",
    "link": "https://newrepublic.com/post/206202/donald-trump-attacks-alex-pretti-renee-nicole-good",
    "timestamp": "2026-02-05T17:36:45Z"
  },
  {
    "title": "‘Get Your F****** Guns’: Antifa Zealot Charged With Unhinged Threats Against ICE",
    "description": "A self-described Antifa supporter who called for armed resistance and other violence against immigration agents in Minnesota was arrested Thursday.",
    "link": "https://dailycaller.com/2026/02/05/get-your-f-guns-antifa-zealot-charged-with-unhinged-threats-against-ice/",
    "timestamp": "2026-02-05T17:35:57Z"
  },
  {
    "title": "GOP fumes as Trump gives Dems leverage on DHS funding: 'We shot ourselves in the foot'",
    "description": "Republicans in Congress expressed frustration at President Donald Trump after he gave Democrats leverage over Department of Homeland Security funding.Fox News reported that Republicans were \"quietly grumbling\" over Trump's deal with Senate Minority Leader Chu…",
    "link": "https://www.rawstory.com/trump-dhs-funding-democrats/",
    "timestamp": "2026-02-05T17:35:14Z"
  },
  {
    "title": "The threats to democracy are real",
    "description": "NC SPIN: Balanced Debate For The Old North State.",
    "link": "https://www.ncspin.com/the-threats-to-democracy-are-real",
    "timestamp": "2026-02-05T17:35:00Z"
  },
  {
    "title": "Texas A&M fired a professor for teaching about gender identity. Now, she's suing",
    "description": "The Texas A&M professor who was fired for teaching about gender identity has filed a lawsuit against the university, accusing officials of violating her First Amendment rights.",
    "link": "https://www.advocate.com/news/texas-am-melissa-mccoul-lawsuit",
    "timestamp": "2026-02-05T17:34:27Z"
  },
  {
    "title": "‘Deploying All Resources’: Trump Backs Efforts To Find Savannah Guthrie’s Missing Mom",
    "description": "President Donald Trump is providing full support and resources to Savannah Guthrie and her family as the search for 84-year-old Nancy Guthrie continues. Trump issued a statement Feb. 4 to Truth Social noting that he had spoken to Guthrie and shared the news w…",
    "link": "https://dailycaller.com/2026/02/05/trump-efforts-nancy-guthrie-savannah-today-abduction-ransom-arizona/",
    "timestamp": "2026-02-05T17:33:30Z"
  },
  {
    "title": "Mediaite’s Luke Touma Gobsmacked by Trump Defending the Clintons on Epstein: ‘These Guys All Stick Together!’",
    "description": "Luke Touma delves into how Donald Trump has crossed party lines to defend longtime foes Bill and Hillary Clinton over their association with Jeffrey Epstein.\nThe post Mediaite’s Luke Touma Gobsmacked by Trump Defending the Clintons on Epstein: ‘These Guys All…",
    "link": "https://www.mediaite.com/media/news/mediaites-luke-touma-gobsmacked-by-trump-defending-the-clintons-on-epstein-these-guys-all-stick-together/",
    "timestamp": "2026-02-05T17:33:13Z"
  },
  {
    "title": "Celebrities Speak Out As Search For Nancy Guthrie Intensifies",
    "description": "Maria Shriver and Jennifer Garner were among the stars who reacted to the \"Today\" show host's emotional message to her mother's possible kidnappers.",
    "link": "https://www.huffpost.com/entry/maria-shriver-jennifer-garner-celebrities-support-savannah-guthrie-missing-mother_n_6984b24be4b03d97392719dc",
    "timestamp": "2026-02-05T17:31:29Z"
  },
  {
    "title": "WATCH LIVE: White House briefing may address DHS funding negotiations, National Prayer Breakfast",
    "description": "It's unclear if President Donald Trump or enough congressional Republicans will agree to any of the Democrats' larger demands on immigration enforcement. Republicans have already pushed back.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-white-house-briefing-may-address-dhs-funding-negotiations-national-prayer-breakfast",
    "timestamp": "2026-02-05T17:31:15Z"
  },
  {
    "title": "Brutal Poll Demolishes Trump and Stephen Miller’s Big Claim on ICE",
    "description": "Roughly two-thirds of Americans believe that Donald Trump’s immigration enforcement crackdown has gone too far, according to a new NPR/PBS/Marist poll released Thursday.Sixty-five percent of respondents said Immigration and Customs Enforcement agents had “gon…",
    "link": "https://newrepublic.com/post/206200/donald-trump-stephen-miller-claim-ice-poll",
    "timestamp": "2026-02-05T17:31:06Z"
  },
  {
    "title": "Trump Shocked Canada Out of Complacency on Defense. Will It Last?",
    "description": "Ottawa has announced ambitious military spending plans, including in the sparsely protected Arctic.",
    "link": "http://foreignpolicy.com/2026/02/05/trump-canada-defense-spending-nato-norad-carney-arctic/",
    "timestamp": "2026-02-05T17:29:27Z"
  },
  {
    "title": "GOP Senator Shoots Down Trump’s Call for National Elections Takeover",
    "description": "Senator Tim Sheehy (R-MT) publicly undercut President Donald Trump’s push to federalize America’s elections on Thursday, flatly warning he did not support the idea, which would require a constitutional amendment. The proposal, first floated by the president o…",
    "link": "https://freerepublic.com/focus/f-chat/4365558/posts",
    "timestamp": "2026-02-05T17:27:16Z"
  },
  {
    "title": "Trump administration to launch TrumpRx website for discounted drugs",
    "description": "The actual savings for consumers remain unclear.",
    "link": "https://www.denverpost.com/2026/02/05/trumprx-launch/",
    "timestamp": "2026-02-05T17:26:08Z"
  },
  {
    "title": "Trump administration to launch TrumpRx website for discounted drugs",
    "description": "The actual savings for consumers remain unclear.",
    "link": "https://www.bostonherald.com/2026/02/05/trumprx-launch/",
    "timestamp": "2026-02-05T17:26:08Z"
  }
]