[
  {
    "title": "China Raises Costs for US Tourists After Trump Tariffs: '104%",
    "description": "Some businesses have been accused of trying to cash in on sentiments sparked by the trade war, given the likely lack of U.S. customers.",
    "link": "https://www.newsweek.com/china-american-tourist-prices-trump-us-tariffs-2057910",
    "timestamp": "2025-04-10T15:55:30Z"
  },
  {
    "title": "Why Trump Retreated on Tariffs",
    "description": "Trump may be about to discover that it is easier to begin a trade war than to end it successfully.\nThe post Why Trump Retreated on Tariffs appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/jacob-heilbrunn/why-trump-retreated-on-tariffs",
    "timestamp": "2025-04-10T15:55:28Z"
  },
  {
    "title": "This tariff gambit better work",
    "description": "Will Trump be remembered like Herbert Hoover? That may be determined by the outcome on his tariff policies.",
    "link": "https://www.ncspin.com/this-tariff-gambit-better-work",
    "timestamp": "2025-04-10T15:55:20Z"
  },
  {
    "title": "Do you know where your groceries come from? Here's what we import and could see price hikes under Trump's tariffs",
    "description": "Most of the fresh fruit, coffee, and fish Americans consume are shipped from overseas from countries like Peru, Chile, and Indonesia.",
    "link": "https://www.businessinsider.com/grocery-prices-trump-tariffs-coffee-seafood-wine-fruit-2025-4",
    "timestamp": "2025-04-10T15:55:17Z"
  },
  {
    "title": "Gold hits record high as US-China trade war intensifies, dollar weakens",
    "description": "Gold prices jumped nearly 3% to an all-time high on Thursday, as a drop in the dollar and an escalating trade war between the U.S. and China drove investors towards the safe-haven allure of the precious metal.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-hits-record-high-as-us-china-trade-war-intensifies-dollar-weakens/articleshow/120168320.cms",
    "timestamp": "2025-04-10T15:55:12Z"
  },
  {
    "title": "Trump administration has tightly restricted access to president's daily intelligence brief (CNN)",
    "description": "CNN:\nTrump administration has tightly restricted access to president's daily intelligence brief  —  The Trump administration has tightly restricted the number of people who have access to President Donald Trump's highly classified daily intelligence report, f…",
    "link": "https://www.memeorandum.com/250410/p61",
    "timestamp": "2025-04-10T15:55:00Z"
  },
  {
    "title": "House GOP holdouts back down and give Trump budget resolution win (Washington Examiner)",
    "description": "Washington Examiner:\nHouse GOP holdouts back down and give Trump budget resolution win  —  House Republicans finally heeded advice from President Donald Trump to “close your eyes” and vote for a GOP budget resolution despite several hard-line conservatives ra…",
    "link": "https://www.memeorandum.com/250410/p60",
    "timestamp": "2025-04-10T15:55:00Z"
  },
  {
    "title": "Elon Musk vs OpenAI: The legal feud explained as ChatGPT maker countersues world's richest person",
    "description": "Sam Altman-backed OpenAI has countersued Elon Musk citing a pattern of harassment by him and asked the judge to hold him responsible for the \"damage he has already caused\" to the company. The Tesla and SpaceX CEO had in August last year filed a lawsuit agains…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-vs-openai-the-legal-feud-explained-as-chatgpt-maker-countersues-worlds-richest-person/articleshow/120168082.cms",
    "timestamp": "2025-04-10T15:54:56Z"
  },
  {
    "title": "House Republicans pass citizenship proof voting bill",
    "description": "Learn how the SAVE Act could reshape voting requirements in the U.S.",
    "link": "https://www.wmur.com/article/house-republicans-citizenship-proof-voting/64443974",
    "timestamp": "2025-04-10T15:53:43Z"
  },
  {
    "title": "Trump figuring out next steps in global tariff battle",
    "description": "President Trump is deciding exactly what he wants out of trade talks with as many as 75 nations in the coming weeks.",
    "link": "https://www.bostonherald.com/2025/04/10/trump-tariffs-next-steps/",
    "timestamp": "2025-04-10T15:53:21Z"
  },
  {
    "title": "Trump Tariffs Prompt Private Lenders to Triage Their Portfolios",
    "description": "In the days before US President Donald Trump’s sweeping global tariffs were set to go into effect, private credit managers had their heads down, trying to assess the impact to their portfolios.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariffs-prompt-private-lenders-to-triage-their-portfolios",
    "timestamp": "2025-04-10T15:53:16Z"
  },
  {
    "title": "Where Is Joy Behar Today? Why Is She Missing ‘The View’?",
    "description": "It's Behar's second absence this week, but we've got our fingers crossed she'll be back tomorrow.",
    "link": "https://decider.com/2025/04/10/where-is-joy-behar-today-why-missing-the-view-2/",
    "timestamp": "2025-04-10T15:52:57Z"
  },
  {
    "title": "Pete Buttigieg — bearded and blunt — calls out Donald Trump’s tariff chaos: ‘This is people’s lives’",
    "description": "Fresh off a family vacation — and rocking a new beard — the former transportation secretary says Trump’s governing style is all chaos, no competence.",
    "link": "https://www.advocate.com/news/pete-buttigieg-blasts-trump",
    "timestamp": "2025-04-10T15:52:38Z"
  },
  {
    "title": "Photographer’s Testimony Key to AP’s Legal Victory Against White House",
    "description": "The federal judge who ordered the White House to restore access to The Associated Press repeatedly cited the plain-spoken testimony from AP Photographer Evan Vucci.\n[Read More]",
    "link": "https://petapixel.com/2025/04/10/photographers-testimony-key-to-aps-legal-victory-against-white-house/",
    "timestamp": "2025-04-10T15:52:26Z"
  },
  {
    "title": "Dem Rep. Himes: Trump Acting Like 'Bolivian Dictator' from the 1950s",
    "description": "Representative Jim Himes (D-CT) claimed Thursday on CNN's \"The Situation Room\" that President Donald Trump was acting like a \"Bolivian dictator\" from the 1950s.\nThe post Dem Rep. Himes: Trump Acting Like ‘Bolivian Dictator’ from the 1950s appeared first on Br…",
    "link": "https://www.breitbart.com/clips/2025/04/10/dem-rep-himes-trump-acting-like-bolivian-dictator-from-the-1950s/",
    "timestamp": "2025-04-10T15:52:19Z"
  },
  {
    "title": "House Republicans pass citizenship proof voting bill",
    "description": "Learn how the SAVE Act could reshape voting requirements in the U.S.",
    "link": "https://www.wtae.com/article/house-republicans-citizenship-proof-voting/64443974",
    "timestamp": "2025-04-10T15:52:12Z"
  },
  {
    "title": "US tariffs cue for ASEAN to bolster independence: govt",
    "description": "Deputy Minister of Foreign Affairs, Arif Havas Oegroseno, has said that the reciprocal tariffs imposed by the United States (US) must serve as impetus for ...",
    "link": "https://en.antaranews.com/news/351325/us-tariffs-cue-for-asean-to-bolster-independence-govt",
    "timestamp": "2025-04-10T15:52:03Z"
  },
  {
    "title": "What the spiralling trade war means for relations between the US and China",
    "description": "Donald Trump has turned up the heat on China, hiking tariffs up to 125%.",
    "link": "https://theconversation.com/what-the-spiralling-trade-war-means-for-relations-between-the-us-and-china-254311",
    "timestamp": "2025-04-10T15:51:54Z"
  },
  {
    "title": "Trump's immigration tactics obstruct efforts to avert bird flu pandemic: Researchers",
    "description": "Immigration raids and threats have undermined efforts to prevent and detect bird flu infections among farmworkers, researchers say.",
    "link": "https://abcnews.go.com/Health/trumps-immigration-tactics-obstruct-efforts-avert-bird-flu/story?id=120677884",
    "timestamp": "2025-04-10T15:51:27Z"
  },
  {
    "title": "Tesla Opens First Showroom In Oil-Rich Saudi Arabia",
    "description": "The Tesla electric vehicle company owned by billionaire Elon Musk on Thursday opened its first showroom in oil-rich Saudi Arabia -- where hybrid cars are still not a common sight.",
    "link": "https://www.ndtv.com/world-news/tesla-opens-first-showroom-in-oil-rich-saudi-arabia-8134665",
    "timestamp": "2025-04-10T15:51:02Z"
  },
  {
    "title": "A Mark Robinson comeback?",
    "description": "The Republican base has been conditioned to believe anything, regardless of the source. So maybe Mark Robinson is right.",
    "link": "https://www.ncspin.com/a-mark-robinson-comeback",
    "timestamp": "2025-04-10T15:50:58Z"
  },
  {
    "title": "Michelle Obama addresses divorce rumors after her absence at Trump’s inauguration",
    "description": "The former first lady alluded to a recent event she was “supposed to” attend and said she decided “to do what was best for me.”",
    "link": "https://www.msnbc.com/top-stories/latest/michelle-obama-trump-inauguration-divorce-rumors-podcast-interview-rcna200598",
    "timestamp": "2025-04-10T15:50:57Z"
  },
  {
    "title": "Boys Will Be Boys, But Women Are Too Emotional for the Supreme Court",
    "description": "Elon Musk and Peter Navarro, both key figures in the Trump administration, are having a little public slap fight. And while any other administration or workplace or group of sentient adults would be embarrassed by this series of public outbursts, the White Ho…",
    "link": "https://msmagazine.com/2025/04/10/boys-will-be-boys-women-emotional-supreme-court-amy-coney-barrett/",
    "timestamp": "2025-04-10T15:50:43Z"
  },
  {
    "title": "Trump Brags About How Tariff Pause Made His Friends Even Richer",
    "description": "Donald Trump is openly bragging about just how much money his billionaire buddies made off of his dangerous tariff gambit. \r\nAfter announcing a 90-day pause Wednesday on his sweeping “reciprocal tariff” policy on nearly every country—with the exception of Chi…",
    "link": "https://newrepublic.com/post/193860/donald-trump-brags-tariff-pause-made-billionaires-richer",
    "timestamp": "2025-04-10T15:50:28Z"
  },
  {
    "title": "Ana Navarro Thinks Trump Should Be “In A Padded Room Playing With His Own Drool” For Causing “Trauma” To Americans With His Tariffs",
    "description": "\"If they’re saying that this was all strategic, then he is a sadist.\"",
    "link": "https://decider.com/2025/04/10/ana-navarro-trump-padded-room-playing-drool-trauma-americans-tariffs/",
    "timestamp": "2025-04-10T15:49:50Z"
  },
  {
    "title": "Just Four Dems Vote To Keep Non-Citizens From Voting In US Elections",
    "description": "Four Democrats joined House Republicans to pass legislation Thursday that calls for stricter regulations to ensure only U.S. citizens are participating in federal elections. The House of Representatives voted 220 to 208 in favor of the H.R. 22, more popularly…",
    "link": "https://dailycaller.com/2025/04/10/four-dems-voted-keep-noncitizens-voting-elections/",
    "timestamp": "2025-04-10T15:49:29Z"
  },
  {
    "title": "Elon Musk's Wisconsin Meddling Backfired, Poll Suggests",
    "description": "Voters didn't support the GOP candidate in the Wisconsin Supreme Court election because of billionaire's endorsement, survey says.",
    "link": "https://www.newsweek.com/elon-musk-wisconsin-supreme-court-election-poll-2058008",
    "timestamp": "2025-04-10T15:49:14Z"
  },
  {
    "title": "Jasmine Crockett Calls Trump a Name We Can’t Put in a Headline",
    "description": "In the long history of the United States, there have been many times when people have declared that our nation was in decline, only to be proven wrong as our resilient people proved more than capable of meeting the challenges before them. It’s hard to deny, h…",
    "link": "https://freerepublic.com/focus/f-news/4310182/posts",
    "timestamp": "2025-04-10T15:49:00Z"
  },
  {
    "title": "USTR Considers Adjusting Port Fee Plan for Chinese Ships After Pushback",
    "description": "President Donald Trump's administration is considering softening its proposed fee on China-linked ships visiting U.S. ports after a flood of negative feedback from industries that said the idea could be economically devastating, according to six sources.",
    "link": "https://gcaptain.com/ustr-considers-adjusting-port-fee-plan-for-chinese-ships-after-pushback/",
    "timestamp": "2025-04-10T15:48:51Z"
  },
  {
    "title": "House GOP approves framework for Trump’s big budget bill after intense talks win over GOP holdouts",
    "description": "Johnson worked into the night to satisfy conservative lawmakers who refused to support the plan. He and Senate Majority Leader John Thune assured conservatives they were on track seeking as much as $1.5 trillion in cuts.",
    "link": "https://www.pbs.org/newshour/politics/house-gop-approves-framework-for-trumps-big-budget-bill-after-intense-talks-win-over-gop-holdouts",
    "timestamp": "2025-04-10T15:48:10Z"
  },
  {
    "title": "Ahead of Trump admin-Iran talks, new report says Iran nuclear threat rises to 'extreme danger'",
    "description": "'The possibility of Iran deciding to build nuclear weapons has been increased by the ongoing military conflicts in the Middle East,' report says JERUSALEM — A leading U.S. research institute devoted to monitoring Iran’s illicit nuclear weapons program publish…",
    "link": "https://freerepublic.com/focus/f-news/4310180/posts",
    "timestamp": "2025-04-10T15:47:48Z"
  },
  {
    "title": "Trump tariffs pause proves he's the best president ever",
    "description": "It's clear from President Donald Trump's decision to pause the sweeping global tariffs he said he would never back down from that the man is a genius.",
    "link": "https://www.usatoday.com/story/opinion/columnist/2025/04/10/trump-tariffs-pause-stock-market-manipulation/83019881007/",
    "timestamp": "2025-04-10T15:47:06Z"
  },
  {
    "title": "Trump’s Escalating Tariffs Threaten to Reverse US Import Boom",
    "description": "U.S. container imports rose 11% year over year in March, continuing this year's outsized monthly gains, but U.S. President Donald Trump's escalating tariffs are dimming the outlook for later this year, trade executives said.",
    "link": "https://gcaptain.com/trumps-escalating-tariffs-threaten-to-reverse-us-import-boom/",
    "timestamp": "2025-04-10T15:46:56Z"
  },
  {
    "title": "The Old War is Over in Gaza and a New One is Underway",
    "description": "Israel’s tactics have changed and so have its objectives.",
    "link": "http://foreignpolicy.com/2025/04/10/war-gaza-israel-hamas-netanyahu/",
    "timestamp": "2025-04-10T15:46:55Z"
  },
  {
    "title": "EU hits pause on counter-tariffs in hope of US trade deal",
    "description": "European ambassadors were briefed on suspension of retaliatory tariffs on Thursday morning",
    "link": "https://www.irishtimes.com/business/2025/04/10/eu-hits-pause-on-counter-tariffs-in-hope-of-us-trade-deal/",
    "timestamp": "2025-04-10T15:46:54Z"
  },
  {
    "title": "CNBC Anchor Predicts ‘A Lot of Volatility’ in Markets After Trump Tariff Pause: ‘Not Clear That We Are Now In a Better Negotiating Position’",
    "description": "Andrew Ross Sorkin predicted \"a lot of volatility\" in the stock market over the next 90 days despite President Donald Trump's tariff pause.\nThe post CNBC Anchor Predicts ‘A Lot of Volatility’ in Markets After Trump Tariff Pause: ‘Not Clear That We Are Now In …",
    "link": "https://www.mediaite.com/tv/cnbc-anchor-predicts-a-lot-of-volatility-in-markets-after-trump-tariff-pause-not-clear-that-we-are-now-in-a-better-negotiating-position/",
    "timestamp": "2025-04-10T15:46:46Z"
  },
  {
    "title": "Apple said to be flying iPhones from India to US to avoid Trump tariffs",
    "description": "Tech firm has reportedly flown 600 tonnes of handsets from Indian factories as Chinese goods face huge tariffs\nApple is reportedly chartering cargo flights to ferry iPhones from its Indian manufacturing plants to the US in an attempt to beat Donald Trump’s ta…",
    "link": "https://biztoc.com/x/5b4343bcd9955d38",
    "timestamp": "2025-04-10T15:46:18Z"
  },
  {
    "title": "Trump Media Stock Pulls Back After Soaring Wednesday",
    "description": "Key Takeaways\n-\nShares of Truth Social parent Trump Media & Technology Group gave back some of Wednesday's sharp gains.\n-\nShares of President Donald Trump's media company surged along with broader markets yesterday as he issued a 90-day pause on most tariffs.…",
    "link": "https://biztoc.com/x/cb2f7d3274c14ce6",
    "timestamp": "2025-04-10T15:46:17Z"
  },
  {
    "title": "Trump signed an executive order targeting another foe: Showerheads that guzzle water",
    "description": "President Donald Trump has long complained about modern rules that limit water flow for showerheads, making it harder for him to wash his \"beautiful hair.''\nIn his first term, Trump directed that restrictions on showerheads be loosened, an action that former …",
    "link": "https://biztoc.com/x/dd9fd36397c70727",
    "timestamp": "2025-04-10T15:46:00Z"
  },
  {
    "title": "China to restrict US film releases after Trump’s tariff hike",
    "description": "After the US president imposed 125% duties on Chinese imports, Beijing says it will restrict American films opening in its lucrative market \nHours after Donald Trump imposed record 125% tariffs on Chinese products entering the US, China has announced it will …",
    "link": "https://biztoc.com/x/40ff06aee4aa302e",
    "timestamp": "2025-04-10T15:45:59Z"
  },
  {
    "title": "Inflation cooled last month, but ‘don’t get used to it’: Trump’s tariffs may drive prices even higher, economists warn",
    "description": "U.S. inflation declined last month as the cost of gas, airline fares, and hotel rooms fell, a sign that price growth was cooling even as President Donald Trump ramped up his tariff threats.\nConsumer prices rose just 2.4% in March from a year earlier, the Labo…",
    "link": "https://biztoc.com/x/231bafa6269765d1",
    "timestamp": "2025-04-10T15:45:58Z"
  },
  {
    "title": "Business Leaders Call for More Work Visas Amid Trump's Crackdown",
    "description": "Granting work visas to 900,000 undocumented construction workers could generate $97.5 billion a year, one leader told Newsweek.",
    "link": "https://www.newsweek.com/business-leaders-call-more-work-visas-amid-trump-crackdown-2057965",
    "timestamp": "2025-04-10T15:45:58Z"
  },
  {
    "title": "Trump's Latest Tariff Hike Brings Additional China Rate To 145%: White House",
    "description": "US President Donald Trump&#039;s steep tariff hike targeting Chinese goods, which took effect Thursday, brings Washington&#039;s additional rate on China to 145 percent, a White House document confirms.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-latest-tariff-hike-brings-additional-china-rate-to-145-white-house-8134601",
    "timestamp": "2025-04-10T15:44:02Z"
  },
  {
    "title": "Trump Administration Raises Eyebrows Over Summer Military Parade Plans",
    "description": "President Donald Trump hasn't signed off on the June 14, which is both his birthday and the 250th anniversary of the U.S. Army.",
    "link": "https://hiphopwired.com/2673131/trump-administration-summer-military-parade-plans/",
    "timestamp": "2025-04-10T15:43:47Z"
  },
  {
    "title": "House GOP adopts budget framework, paving the way for Trump’s ‘big, beautiful bill’",
    "description": "The House finally approved a budget Thursday, uncorking the filibuster-skirting power Republicans need to build and enact President Donald Trump’s dream bill along party lines this year. The final vote was 216-214, with two Republicans — Reps. Victoria Spartz…",
    "link": "https://freerepublic.com/focus/f-news/4310178/posts",
    "timestamp": "2025-04-10T15:42:39Z"
  },
  {
    "title": "King and Queen leave Italy after state visit",
    "description": "The King and Queen took in Italy's cultural highlights and celebrated their 20th wedding anniversary",
    "link": "https://www.bbc.com/news/articles/c4g88ne5jp1o",
    "timestamp": "2025-04-10T15:41:14Z"
  },
  {
    "title": "AOC Calls Out Suspicious Stock Trades in Congress Amid Tariff Fiasco",
    "description": "Representative Alexandria Ocasio-Cortez and other Democrats are accusing Donald Trump and his administration of manipulating the market to their benefit. \r\nJust days after Trump announced his”Liberation Day” tariffs that sparked global financial chaos and tan…",
    "link": "https://newrepublic.com/post/193856/aoc-stocks-insider-trading-congress-tariffs",
    "timestamp": "2025-04-10T15:40:59Z"
  },
  {
    "title": "'Leads her own life': Melania Trump prioritized her $40 million Amazon documentary over Donald Trump",
    "description": "Melania Trump is one of the most mysterious figures in politics. The First Lady of the United States is serving her second term in the role and is busy filming a documentary produced by Amazon Prime Video, focusing on her public image. Melania will receive $2…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/leads-her-own-life-melania-trump-prioritized-her-40-million-amazon-documentary-over-donald-trump/articleshow/120167314.cms",
    "timestamp": "2025-04-10T15:40:50Z"
  },
  {
    "title": "Faisal Islam: Trump may have backtracked, but this is far from over",
    "description": "Trump's 4D game of chess has left China in check - and now there is an anxious wait to find out how this plays out",
    "link": "https://www.bbc.com/news/articles/c20xxv3y9r2o",
    "timestamp": "2025-04-10T15:39:19Z"
  },
  {
    "title": "Shoe Prices Eased in March, But Could Be ‘Sharply Higher’ Later This Year if Tariffs Remain in Place",
    "description": "Retail shoe prices declined moderately in March 2025, down 0.7 percent year-over-year, but could rise sharply if tariffs remain in place.",
    "link": "http://footwearnews.com/business/business-news/shoe-prices-march-2025-ease-inflation-tariffs-1234797950/",
    "timestamp": "2025-04-10T15:39:01Z"
  },
  {
    "title": "Trump's changing stance on Nippon Steel bid adds confusion, sends US Steel shares lower",
    "description": "Donald Trump's latest shift on Nippon Steel's $14 billion bid for U.S. Steel sent shares of the 124-year-old American company down 7% on Thursday, after Trump said a day earlier that he does not want the steel producer to \"go to Japan.\"",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-changing-stance-on-nippon-steel-bid-adds-confusion-sends-us-steel-shares-lower/articleshow/120167646.cms",
    "timestamp": "2025-04-10T15:38:41Z"
  },
  {
    "title": "A much needed pause from the tariff sledgehammer",
    "description": "For US, tariffs cannot be an antidote to sustained deficits. China cannot be rash while dealing with Trump",
    "link": "https://www.thehindubusinessline.com/opinion/a-much-needed-pause-from-the-tariff-sledgehammer/article69436364.ece",
    "timestamp": "2025-04-10T15:38:34Z"
  },
  {
    "title": "Versace’s ‘Quiet Luxury’ Blunder Opened Door to Prada Takeover",
    "description": "Fashion executive John Idol thought Versace leaned too much on ornate designs and aimed to fix it by dialing things down, then boosting prices.",
    "link": "https://www.livemint.com/companies/news/versaces-quiet-luxury-blunder-opened-door-to-prada-takeover-11744299475848.html",
    "timestamp": "2025-04-10T15:37:55Z"
  },
  {
    "title": "Alan Dershowitz Breaks Down How Trump Secured ‘Partial Victory’ In SCOTUS Deportation Case",
    "description": "Noted attorney Alan Dershowitz said Wednesday that the Supreme Court’s ruling on deportations might not be a complete victory for President Donald Trump.",
    "link": "https://dailycaller.com/2025/04/10/alan-dershowitz-breaks-down-how-trump-secured-partial-victory-scotus-deportation/",
    "timestamp": "2025-04-10T15:37:49Z"
  },
  {
    "title": "Trump Signs Executive Order Revitalizing America’s Depleted Maritime Fleet",
    "description": "'The commercial shipbuilding capacity and maritime workforce of the United States has been weakened by decades of Government neglect,' the president wrote.",
    "link": "https://thefederalist.com/2025/04/10/trump-signs-executive-order-revitalizing-americas-depleted-maritime-fleet/",
    "timestamp": "2025-04-10T15:37:15Z"
  },
  {
    "title": "Donald Trump increases tariffs on China to 145% in major move",
    "description": "Donald Trump's tariffs on China are actually 145 percent, not 125 percent as previously thought",
    "link": "https://www.ladbible.com/news/us-news/trump-china-tariffs-145-percent-779993-20250410",
    "timestamp": "2025-04-10T15:36:34Z"
  },
  {
    "title": "Is there a method in Trump’s madness?",
    "description": "Trump wants to create a revised contract with the world. But his efforts to weaken the dollar run up against its unique status as a global reserve currency",
    "link": "https://www.thehindubusinessline.com/opinion/is-there-a-method-in-trumps-madness/article69436342.ece",
    "timestamp": "2025-04-10T15:36:26Z"
  },
  {
    "title": "FLASHBACK: Mitt Romney mocked in 2012 for self-deportation concept that has now become a reality",
    "description": "Former Sen. Mitt Romney was mocked in his 2012 presidential run for promoting the idea that illegal immigrants could be encouraged to self-deport.",
    "link": "https://www.foxnews.com/politics/flashback-mitt-romney-mocked-2012-self-deportation-concept-has-now-become-reality",
    "timestamp": "2025-04-10T15:36:21Z"
  },
  {
    "title": "Student Deportations Spark a Rift Between Ritchie Torres and Former Backers",
    "description": "Jacqueline Sweet\n\n\n\nThe pro-Israel New York congressman denounces protester detentions and faces blowback from former funders who are aiding them. \r\n\n\r\n\n\nThe post Student Deportations Spark a Rift Between Ritchie Torres and Former Backers appeared first on Th…",
    "link": "https://www.thenation.com/article/politics/ritchie-torres-betar-us-deportations/",
    "timestamp": "2025-04-10T15:35:28Z"
  },
  {
    "title": "US stocks tumble again as reality sets back in on Wall Street",
    "description": "The US stock market, fresh off its third-best day in modern history, is sinking back into reality: Although President Donald Trump paused most of his “reciprocal” tariffs, his other massive import taxes have already inflicted significant damage, and the econo…",
    "link": "https://biztoc.com/x/0a7a23564f1bccfe",
    "timestamp": "2025-04-10T15:35:01Z"
  },
  {
    "title": "John Cornyn scores Tim Scott endorsement, but John Rich calls Cornyn 'the Lindsey Graham of Texas'",
    "description": "Sen. Tim Scott supports Sen. John Cornyn for re-election, while country star John Rich supports Ken Paxton and calls Cornyn \"the Lindsey Graham of Texas\"",
    "link": "https://www.foxnews.com/politics/john-cornyn-scores-tim-scott-endorsement-john-rich-calls-cornyn-the-lindsey-graham-texas",
    "timestamp": "2025-04-10T15:34:59Z"
  },
  {
    "title": "Full List of Republicans Who Voted Against Trump-Backed Budget Resolution",
    "description": "Two House Republicans voted against the budget bill backed by President Trump.",
    "link": "https://www.newsweek.com/full-list-republicans-who-voted-against-trump-backed-budget-resolution-2058036",
    "timestamp": "2025-04-10T15:34:45Z"
  },
  {
    "title": "Audi’s top-selling SUV expected to be unsellable in U.S. after Trump tariffs",
    "description": "The Audi Q5 is the German brand’s top-selling vehicle in the U.S. It’s also a prime example of how Donald Trump’s drastic reordering of global trade is wreaking havoc on automakers.\nThe president’s tariffs are hitting the $45,400 model thrice, rendering the s…",
    "link": "https://biztoc.com/x/086adc16c3be5bc5",
    "timestamp": "2025-04-10T15:34:36Z"
  },
  {
    "title": "House Passes Trump-Backed Budget Plan",
    "description": "House Republicans pushed through a Trump-backed budget framework on a 216-214 vote Thursday, providing a boost to the president’s legislative agenda. Democrats voted against it... Read More\nThe post House Passes Trump-Backed Budget Plan appeared first on The …",
    "link": "https://www.dailysignal.com/2025/04/10/house-passes-trump-backed-budget-plan/",
    "timestamp": "2025-04-10T15:34:36Z"
  },
  {
    "title": "Valve leak hints that its next VR headset could be landing sooner than we realized",
    "description": "Valve looks to be starting (or already underway) with production of its Deckard VR headset.",
    "link": "https://www.techradar.com/computing/virtual-reality-augmented-reality/valve-leak-hints-that-its-next-vr-headset-could-be-landing-sooner-than-we-realized",
    "timestamp": "2025-04-10T15:34:23Z"
  },
  {
    "title": "US Steel Falls 10% After Trump Says He Doesn’t Want Japan Owner",
    "description": "United States Steel Corp. shares posted their biggest drop in two months, a day after US President Donald Trump reiterated his long-held position that he doesn’t want to see the steelmaker owned by a Japanese company.",
    "link": "https://www.livemint.com/companies/news/us-steel-falls-10-after-trump-says-he-doesn-t-want-japan-owner-11744299231880.html",
    "timestamp": "2025-04-10T15:33:51Z"
  },
  {
    "title": "Netanyahu’s triple humiliation – on tariffs, Iran, and Erdogan - opinion",
    "description": "Netanyahu missed the historic opportunity to launch a strike on Iran’s nuclear infrastructure and topple the regime during the transition from Biden to Trump.",
    "link": "https://www.jpost.com/opinion/article-849720",
    "timestamp": "2025-04-10T15:32:10Z"
  },
  {
    "title": "These 8 Costco Products Will Likely Cost More Thanks to Tariffs",
    "description": "Even Costco, the warehouse club beloved for keeping its prices low, may start to feel the squeeze of tariffs.\nThe post These 8 Costco Products Will Likely Cost More Thanks to Tariffs appeared first on Reader's Digest.",
    "link": "https://www.rd.com/article/costco-foods-that-will-cost-more-due-to-tariffs-2025/",
    "timestamp": "2025-04-10T15:31:52Z"
  },
  {
    "title": "China Hits Hollywood Despite Gavin Newsom's Olive Branch",
    "description": "Beijing is to reduce U.S. film imports, despite the Californian governor attempting to maintain good relations with the government.",
    "link": "https://www.newsweek.com/china-hollywood-tariffs-films-gavin-newsom-2057960",
    "timestamp": "2025-04-10T15:31:38Z"
  },
  {
    "title": "Democrats focus on possible market manipulation following Trump’s tariffs ‘pause’",
    "description": "Donald Trump encouraged people to start investing shortly before he made an unexpected move that benefited investors. Awkward questions soon followed.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/democrats-focus-possible-market-manipulation-trumps-tariffs-pause-rcna200617",
    "timestamp": "2025-04-10T15:31:35Z"
  },
  {
    "title": "World's top banker pulled a Fox News power play; here's how Jaime Dimon reportedly persuaded Donald Trump to scrap tariffs behind the scenes",
    "description": "JPMorgan Chase CEO Jamie Dimon's television appearance on Fox Business, where he cautioned about the economic risks of tariffs, may have influenced President Trump to temporarily halt their implementation. Trump admitted to watching the show and praised Dimon…",
    "link": "https://economictimes.indiatimes.com/news/international/us/worlds-top-banker-pulled-a-fox-news-power-play-heres-how-jaime-dimon-reportedly-persuaded-donald-trump-to-scrap-tariffs-behind-the-scenes/articleshow/120165294.cms",
    "timestamp": "2025-04-10T15:31:35Z"
  },
  {
    "title": "House Republican Throws Down With Trump Ally and Conspiracy Theorist Laura Loomer: ‘She Is a Liar Weak Lady’",
    "description": "“I think you're playing with fire, sir,” wrote one user in reply to Bacon, to which he commented, “She’s a whacko. No fear.”\nThe post House Republican Throws Down With Trump Ally and Conspiracy Theorist Laura Loomer: ‘She Is a Liar Weak Lady’ first appeared o…",
    "link": "https://www.mediaite.com/politics/house-republican-throws-down-with-trump-ally-and-conspiracy-theorist-laura-loomer-she-is-a-liar-weak-lady/",
    "timestamp": "2025-04-10T15:31:17Z"
  },
  {
    "title": "Judge says Trump must face Central Park Five defamation suit: report",
    "description": "U.S. District Court Judge Wendy Beetlestone declined this week to dismiss a defamation lawsuit against President Donald Trump by a group of Hispanic and Black men known as the Central Park Five.The men, who were wrongly imprisoned for the 1989 rape of a white…",
    "link": "https://www.rawstory.com/trump-central-park-five-lawsuit/",
    "timestamp": "2025-04-10T15:31:12Z"
  },
  {
    "title": "Controversial Ethereum Developer Freed Before Full Sentence",
    "description": "Virgil Griffith, a former Ethereum developer who worked on the Ethereum Name Service (ENS), has been released from prison on parole and relocated to a halfway house. Updates posted on X on Wednesday, April 9, 2025, disclosed that Griffith is now starting his …",
    "link": "https://bitcoinist.com/ethereums-controversial-developer-freed-before-full-sentence/",
    "timestamp": "2025-04-10T15:30:45Z"
  },
  {
    "title": "This Crypto Analyst Predicted The Bitcoin Price Crash At $97,000, He Just Released Another Forecast",
    "description": "Bitcoin’s price crash from $97,000 in late February surprised most crypto market participants but not this analyst. The crypto analyst known as Doctor Profit, who previously warned of a correction when Bitcoin was approaching $97,000, recently released a new …",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-price-forecast/",
    "timestamp": "2025-04-10T15:30:11Z"
  },
  {
    "title": "Billionaires Score Best-Ever Day as Stocks Soar on Tariff Pause (Bloomberg)",
    "description": "Bloomberg:\nBillionaires Score Best-Ever Day as Stocks Soar on Tariff Pause  —  The world's wealthiest people added $304 billion to their combined net worth on Wednesday — the largest one-day gain in the history of the Bloomberg Billionaires Index — as stock m…",
    "link": "https://www.memeorandum.com/250410/p53",
    "timestamp": "2025-04-10T15:30:01Z"
  },
  {
    "title": "Unions Without Strikes",
    "description": "Today's labor movement has been built to rely on forms of power that are all going away.",
    "link": "https://inthesetimes.com/article/unions-labor-strikes-afge-doge-trump-federal-workers",
    "timestamp": "2025-04-10T15:30:00Z"
  },
  {
    "title": "Chinese Amazon Sellers Have A Difficult Choice To Make, You Won't Like It",
    "description": "Get ready for some possibly big changes the next time you shop on Amazon. With nearly half of Amazon resellers being based in China, the recent Trump Administration trade tariffs are expected to affect not just the price of goods, but potentially reduce the a…",
    "link": "https://hothardware.com/news/chinese-amazon-sellers-have-a-difficult-choice-to-make-due-to-tarriffs",
    "timestamp": "2025-04-10T15:29:00Z"
  },
  {
    "title": "House passes GOP bill requiring proof of US citizenship for voting, a Trump priority",
    "description": "The fate of the bill is uncertain in the Senate.",
    "link": "https://www.denverpost.com/2025/04/10/congress-elections/",
    "timestamp": "2025-04-10T15:28:49Z"
  },
  {
    "title": "House passes GOP bill requiring proof of US citizenship for voting, a Trump priority",
    "description": "The fate of the bill is uncertain in the Senate.",
    "link": "https://www.bostonherald.com/2025/04/10/congress-elections/",
    "timestamp": "2025-04-10T15:28:49Z"
  },
  {
    "title": "House passes bill requiring proof of citizenship to vote in federal elections",
    "description": "Four Democrats joined Republicans in supporting the measure, which the Senate will need to pass before it heads to Trump's desk for his signature.",
    "link": "https://www.nbcnews.com/politics/congress/house-passes-bill-requiring-proof-citizenship-vote-federal-elections-rcna200586",
    "timestamp": "2025-04-10T15:28:04Z"
  },
  {
    "title": "Olivia Munn Returns to ‘The Daily Show’ 14 Years Later to Clarify Why Trump Loves His Tariffs So Much | Video",
    "description": "\"It's not the trade deficit. This is all to make up for Donald Trump's enormous deficit of attention and love,\" the former correspondent tells Desi Lydic\nThe post Olivia Munn Returns to ‘The Daily Show’ 14 Years Later to Clarify Why Trump Loves His Tariffs So…",
    "link": "https://www.thewrap.com/the-daily-show-olivia-munn-returns-trump-tariffs-explanation/",
    "timestamp": "2025-04-10T15:27:27Z"
  },
  {
    "title": "Dems fight bill to stop illegal immigrant voting despite polls showing voter support",
    "description": "The House passed the SAVE Act on noncitizen voting on Thursday, but it still needs to pass the Senate before President Donald Trump can sign it into law.",
    "link": "https://www.foxnews.com/politics/dems-fight-bill-stop-illegal-immigrant-voting-despite-polls-showing-voter-support",
    "timestamp": "2025-04-10T15:27:01Z"
  },
  {
    "title": "China urges US to meet halfway; EU suspends counter tariffs",
    "description": "China and EU signal willingness to de-escalate trade tensions with US after Trump's tariff pause, emphasizing negotiation and cooperation.",
    "link": "https://www.thehindubusinessline.com/news/china-urges-us-to-meet-halfway-eu-suspends-counter-tariffs/article69436288.ece",
    "timestamp": "2025-04-10T15:26:33Z"
  },
  {
    "title": "‘There is no question that we will fight,’ says latest law firm targeted in Trump executive order",
    "description": "The latest law firm targeted by the Trump administration, Susman Godfrey, won’t be the last, President Donald Trump said Wednesday.Trump said the administration had signed…",
    "link": "https://www.abajournal.com/news/article/latest-law-firm-targeted-in-executive-order-says-there-is-no-question-that-we-will-fight",
    "timestamp": "2025-04-10T15:26:00Z"
  },
  {
    "title": "The Guardian view on Trump's trade war: no one will win, but China is taking the long view (The Guardian)",
    "description": "The Guardian:\nThe Guardian view on Trump's trade war: no one will win, but China is taking the long view  —  Beijing is braced for turbulence due to swingeing tariffs.  But it sees a bigger, more promising story of US hegemonic decline  —  No one, least of al…",
    "link": "https://www.memeorandum.com/250410/p50",
    "timestamp": "2025-04-10T15:25:00Z"
  },
  {
    "title": "'The View' host Joy Behar warns of US President Donald Trump announcing Martial Law: What is it?",
    "description": "During a recent episode of 'The View,' Joy Behar discussed Donald Trump's actions, suggesting he might be manipulating the stock market for personal gain and instilling chaos to consolidate power, potentially leading to martial law. Martial law involves milit…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/the-view-host-joy-behar-warns-of-us-president-donald-trump-announcing-martial-law-what-is-it/articleshow/120166551.cms",
    "timestamp": "2025-04-10T15:24:26Z"
  },
  {
    "title": "Trump Isolates China With Tariff Pivot, Setting Up Xi Showdown",
    "description": "China has hit back at the US after Donald Trump’s dramatic reversal on tariff threats isolated Beijing as the primary target of his trade offensive, dimming the prospect of immediate de-escalation.\nThe Chinese government on Thursday said it will reduce the nu…",
    "link": "https://biztoc.com/x/e93962fad0d9f9c7",
    "timestamp": "2025-04-10T15:23:54Z"
  },
  {
    "title": "Sunny Hostin Slams Voter ID Requirements: “A Vestige of Post-Slavery Laws”",
    "description": "The View co-host Sunny Hostin has claimed that voter ID laws disproportionately harm Black Americans and women, while asserting that fewer voter restrictions would allow more people to participate. During an episode of The View‘s official podcast, Behind the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4310175/posts",
    "timestamp": "2025-04-10T15:23:47Z"
  },
  {
    "title": "Republicans pass Trump-backed tax plan that could drastically cut Medicaid",
    "description": "Allison Robbert / AFP via Getty Images\nHouse Republicans moved forward on President Donald Trump's sweeping immigration, energy, and tax cut plan.\nTheir plan could lead to significant cuts to Medicaid.\nGOP lawmakers will now have to flesh out their proposal, …",
    "link": "https://biztoc.com/x/d0998cde7a5b2ff1",
    "timestamp": "2025-04-10T15:23:45Z"
  },
  {
    "title": "FNC's Ingraham: The Political Class 'Underestimates' Trump",
    "description": "During her opening monologue on Wednesday's broadcast of FNC's \"The Ingraham Angle,\" host Laura Ingraham praised President Donald Trump's trade policy regarding his use of presidential tariff power.\nThe post FNC’s Ingraham: The Political Class ‘Underestimates…",
    "link": "https://www.breitbart.com/clips/2025/04/10/fncs-ingraham-the-political-class-underestimates-trump/",
    "timestamp": "2025-04-10T15:23:12Z"
  },
  {
    "title": "Sarah Palin, New York Times to Face Off in Defamation Retrial",
    "description": "Sarah Palin and the New York Times are headed back to a courtroom where the former Alaska governor and Republican vice presidential candidate will try convincing a second jury the newspaper defamed her in an editorial about gun control. A …",
    "link": "https://www.insurancejournal.com/news/east/2025/04/10/819376.htm",
    "timestamp": "2025-04-10T15:21:48Z"
  }
]