[
  {
    "title": "Trump and Johnson strategize ahead of budget reconciliation talks",
    "description": "GOP hopes to reshape spending to align with the president’s domestic agenda.",
    "link": "https://abcnews.go.com/Politics/trump-johnson-strategize-ahead-budget-reconciliation-talks-capitol/story?id=121256547",
    "timestamp": "2025-04-28T21:45:23Z"
  },
  {
    "title": "Global stocks mixed amid trade hopes as markets await tech earnings",
    "description": "NEW YORK - Global stocks were steady on Monday as investors welcomed the absence of further trade war escalation over the weekend and as countries seek to temper US President Donald Trump's tariffs.",
    "link": "https://www.bangkokpost.com/business/investment/3013650/global-stocks-mixed-amid-trade-hopes-as-markets-await-tech-earnings",
    "timestamp": "2025-04-28T21:45:00Z"
  },
  {
    "title": "Trump's Eldest Son Don Jr. Claims JB Pritzker is Trying to 'Inspire a 3rd Assassination Attempt' on His Father — As the Illinois Governor Urges Citizens to 'Disrupt' Republicans",
    "description": "Donald Trump Jr. wasn't happy with Illinois governor JB Pritzker's speech over the weekend, claiming someone may attempt another assassination attempt on his father.",
    "link": "https://radaronline.com/p/trump-don-jr-jb-pritzker-assassination-disrupt-republicans/",
    "timestamp": "2025-04-28T21:45:00Z"
  },
  {
    "title": "MoonPay to put down roots in NYC with new US headquarters — leading to predicted crypto real estate boom",
    "description": "It's latest digital currency company to expand its presence in NYC.",
    "link": "https://nypost.com/2025/04/28/business/moonpay-to-put-down-roots-in-nyc-with-new-us-headquarters-leading-to-predicted-crypto-real-estate-boom/",
    "timestamp": "2025-04-28T21:44:31Z"
  },
  {
    "title": "Trump salutes 'incredible' Eagles at White House reception",
    "description": "President Donald Trump lavished praise on the Philadelphia Eagles on Monday, saluting the Super Bowl-winning NFL champions as \"incredible\" at a White House reception.The 2018 Super Bowl-winning Eagles had been in the front line of Trump's spat with the NFL ov…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_3e532cdc-c608-44c9-92b7-2a6d5a726de7",
    "timestamp": "2025-04-28T21:42:30Z"
  },
  {
    "title": "Ford calls on Canadians to 'fight like we've never fought before' amid Trump threats",
    "description": "Ontario Premier Doug Ford says Canadians should \"fight like we’ve never fought before\" to stand up for Canada in the face of \"51st state\" remarks made by U.S. President Donald Trump.",
    "link": "https://www.cbc.ca/news/canada/toronto/ford-comments-trump-1.7520782",
    "timestamp": "2025-04-28T21:42:17Z"
  },
  {
    "title": "Mike Johnson Reacts to Donald Trump's Dropping Approval Ratings",
    "description": "Trump's polling is likely to continue to fluctuate in the coming weeks in response to key policy issues including tariffs.",
    "link": "https://www.newsweek.com/mike-johnson-reacts-donald-trumps-dropping-approval-ratings-2065336",
    "timestamp": "2025-04-28T21:41:32Z"
  },
  {
    "title": "JB Pritzker Calls for ‘Mass Protests’ Against Trump While Hammering ‘Do-Nothing Democrats’",
    "description": "\"These Republicans cannot know a moment of peace. They have to understand that we will fight their cruelty with every megaphone and microphone that we have.\"\nThe post JB Pritzker Calls for ‘Mass Protests’ Against Trump While Hammering ‘Do-Nothing Democrats’ f…",
    "link": "https://www.mediaite.com/politics/jb-pritzker-calls-for-mass-protests-against-trump-while-hammering-do-nothing-democrats/",
    "timestamp": "2025-04-28T21:40:05Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "Enter summary text here and keep the P tags.",
    "link": "https://press.un.org/en/2025/db250428.doc.htm",
    "timestamp": "2025-04-28T21:39:46Z"
  },
  {
    "title": "Trump world's Laura Loomer takes aim at a 'woke' Lockheed Martin and its $2 trillion F-35 program",
    "description": "The F-35 has been plagued with high costs and development issues, but it is widely considered a top fighter jet.",
    "link": "https://www.businessinsider.com/trump-world-laura-loomer-criticizes-lockheed-martin-f-35-2025-4",
    "timestamp": "2025-04-28T21:39:43Z"
  },
  {
    "title": "Top 5 unhinged outcries from liberals after arrest of Wisconsin judge for allegedly protecting illegal alien from ICE",
    "description": "Democrats and progressives have gone all out to voice their anger at the Department of Justice for arresting Milwaukee County Circuit Judge Hannah Dugan after she allegedly obstructed federal agents who were trying to arrest an illegal alien.Federal agents ha…",
    "link": "https://www.theblaze.com/news/top-5-unhinged-outcries-from-liberals-after-arrest-of-wisconsin-judge-for-allegedly-protecting-illegal-alien-from-ice",
    "timestamp": "2025-04-28T21:39:21Z"
  },
  {
    "title": "Nordic MEPs call on the EU not to escalate US medicine tariff fight",
    "description": "Europe should not spearhead the introduction of new trade barriers, warn Danish and Swedish members of the European Parliament’s SANT committee.",
    "link": "https://www.euractiv.com/section/health-consumers/news/nordic-meps-call-on-the-eu-not-to-escalate-us-medicine-tariff-fight/",
    "timestamp": "2025-04-28T21:39:10Z"
  },
  {
    "title": "Tom Homan: Learn About Trump’s Border Czar Amid U.S. Deportations",
    "description": "Homan publicly discussed the removal of a 2-year-old child from the United States to Honduras with her mother, who was deported in April 2025.",
    "link": "https://hollywoodlife.com/feature/who-is-tom-homan-5414490/",
    "timestamp": "2025-04-28T21:37:43Z"
  },
  {
    "title": "EXCLUSIVE: In First 100 Days, NASA Moves Toward Trump’s Goal of US Flag on Mars",
    "description": "FIRST ON THE DAILY SIGNAL—During the Trump administration’s first 100 days, NASA has made significant moves toward planting an American flag on Mars and getting... Read More\nThe post EXCLUSIVE: In First 100 Days, NASA Moves Toward Trump’s Goal of US Flag on M…",
    "link": "https://www.dailysignal.com/2025/04/28/exclusive-first-100-days-nasa-moves-toward-trumps-goal-american-flag-mars/",
    "timestamp": "2025-04-28T21:35:07Z"
  },
  {
    "title": "New York Times Symposium on \"A Road Map of Trump's Lawless Presidency\"",
    "description": "Donald Trump. (llustration: Eddie Marshall | ALEXANDER DRAGO | UPI | Newscom | Midjourney) \n \nEarlier today, the New York Times published a symposium entitled \"A Road Map of Trump's Lawless Presidency.\" Thirty-five legal scholars took part, including myself. …",
    "link": "https://biztoc.com/x/e6fc5300d8d06b91",
    "timestamp": "2025-04-28T21:30:36Z"
  },
  {
    "title": "Trump invited the Philadelphia Eagles to the White House—but not all Super Bowl champions accepted the invitation",
    "description": "President Donald Trump is hosting the 2025 Super Bowl champion Philadelphia Eagles at the White House on Monday, but several players, including quarterback Jalen Hurts, are skipping the celebration.\nHurts and other players cited scheduling conflicts as the re…",
    "link": "https://biztoc.com/x/df03476a593dc2ea",
    "timestamp": "2025-04-28T21:30:35Z"
  },
  {
    "title": "Indian-born Congressman Shri Thanedar (D-MI) files to impeach President Donald Trump",
    "description": "BREAKING: Indian-born Congressman Shri Thanedar (D-MI) files to impeach President Donald Trump. He is bringing forward 7 Articles. I bet Trump is literally shaking. \"Defying a unanimous 9-0 Supreme Court ruling? That has to be the final straw. It's time we im…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313845/posts",
    "timestamp": "2025-04-28T21:30:31Z"
  },
  {
    "title": "For Trump, there's no place like home: From the Politics Desk",
    "description": "New presidents tend to hit the road in the opening stage of their tenures, interacting with the voters who put them to office and building support for their policy agendas.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-no-place-home-politics-desk-rcna203400",
    "timestamp": "2025-04-28T21:30:00Z"
  },
  {
    "title": "White House focuses on border crackdown as it marks 100 days for Trump's second term",
    "description": "The White House on Monday opened a weeklong celebration of Donald Trump's first 100 days in office by focusing on his border crackdown.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_bdf38d5c-d78d-563d-974e-2065df3b31de.html",
    "timestamp": "2025-04-28T21:30:00Z"
  },
  {
    "title": "Donald Trump’s Warren Zeiders Endorsement Is Taking Country Music By Storm",
    "description": "President Donald Trump issued an endorsement Monday, but it had nothing at all to do with politics.",
    "link": "https://dailycaller.com/2025/04/28/donald-trump-endorsed-country-music-singer-warren-zeiders/",
    "timestamp": "2025-04-28T21:29:18Z"
  },
  {
    "title": "Chris Cillizza Says Corporate Media Was ‘Too Willing’ To Buy Biden Team’s Line That He Was Fit As A Fiddle",
    "description": "Chris Cillizza said that he believes the corporate media was \"too willing\" to accept Joe Biden's White House staff's claims that he was exceptionally fit.",
    "link": "https://dailycaller.com/2025/04/28/chris-cillizza-media-biden-teams-line-fit/",
    "timestamp": "2025-04-28T21:28:03Z"
  },
  {
    "title": "Global economy recession risks surge on U.S. tariff shockwaves: poll",
    "description": "Risks are high the global economy will slip into a recession this year, according to a majority of economists in a Reuters poll, with scores of them saying U.S. President Donald Trump's tariffs have damaged business sentiment. Just three months ago, the same …",
    "link": "https://japantoday.com/category/business/global-economy-recession-risks-surge-on-us-tariff-shockwaves-reuters-poll",
    "timestamp": "2025-04-28T21:26:59Z"
  },
  {
    "title": "WATCH: Homan touts border security ‘success’ in White House briefing marking Trump’s 99th day in office",
    "description": "Immigration is President Donald Trump's leading issue in public opinion surveys, and White House press secretary Karoline Leavitt said at a morning briefing the administration is in \"the beginning stages of carrying out the largest deportation campaign in Ame…",
    "link": "https://www.pbs.org/newshour/politics/watch-homan-touts-border-security-success-in-white-house-briefing-marking-trumps-99th-day-in-office",
    "timestamp": "2025-04-28T21:26:34Z"
  },
  {
    "title": "Massive Changes Proposed In New House GOP Student Loan Plan Include Student Loan Repayment Overhaul",
    "description": "The House GOP student loan plan proposes eliminating most income-driven repayment plans. Here’s what it could mean for future student loan borrowers.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/04/28/massive-changes-proposed-in-new-house-gop-student-loan-plan-include-student-loan-repayment-overhaul/",
    "timestamp": "2025-04-28T21:26:33Z"
  },
  {
    "title": "IOC's Bach, ex-U.S. envoy Hagerty among foreigners decorated in Japan",
    "description": "International Olympic Committee President Thomas Bach and U.S. Sen. Bill Hagerty, who served as U.S. ambassador to Japan, are among the 107 foreigners recognized in this year's spring decorations for their contributions to Japan, the government said Tuesday. …",
    "link": "https://japantoday.com/category/national/ioc%27s-bach-ex-u.s.-envoy-hagerty-among-foreigners-decorated-in-japan",
    "timestamp": "2025-04-28T21:25:11Z"
  },
  {
    "title": "Trump says he runs the world",
    "description": "US President Donald Trump appears to be enjoying his new term and believes he now runs the whole world Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616461-trump-runs-whole-world/",
    "timestamp": "2025-04-28T21:24:52Z"
  },
  {
    "title": "With China and U.S. at intense economic odds, nations are being forced to choose sides",
    "description": "One went to the United States. The other went to China. It was a sign of the times. While the Swiss president was in Washington last week to lobby U.S. officials over President Donald Trump's threatened 31% tariff on Swiss goods, the Swiss foreign minister wa…",
    "link": "https://japantoday.com/category/politics/with-china-and-u.s.-at-intense-economic-odds-nations-are-being-forced-to-choose-sides",
    "timestamp": "2025-04-28T21:23:56Z"
  },
  {
    "title": "Japan policy chief warns of Trump tariff impact on Asian security",
    "description": "The policy chief of Japan's ruling Liberal Democratic Party on Monday called on U.S. President Donald Trump to reconsider his plans for reciprocal tariffs, saying they could negatively impact Indo-Pacific security. Former defense minister Itsunori Onodera sai…",
    "link": "https://japantoday.com/category/politics/japan-policy-chief-warns-of-trump-tariff-impact-on-asian-security",
    "timestamp": "2025-04-28T21:23:35Z"
  },
  {
    "title": "Fox News Politics Newsletter: The ICE Man Cometh",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-ice-man-cometh",
    "timestamp": "2025-04-28T21:22:44Z"
  },
  {
    "title": "At 100 Days, Trump Approval Rating Is As Low As First Term",
    "description": "As the 100-day mark of his presidency arrives, polls show Trump’s job approval heading down to where it was at this point in his first term. He has used up most of the political capital that made his comeback possible.",
    "link": "http://nymag.com/intelligencer/article/at-100-days-trump-approval-rating-is-as-low-as-first-term.html",
    "timestamp": "2025-04-28T21:22:25Z"
  },
  {
    "title": "Rob Manfred says he discussed Pete Rose's status with Donald Trump and will rule on reinstatement",
    "description": "Baseball Commissioner Rob Manfred said he discussed Pete Rose with President Donald Trump at a meeting two weeks ago and he plans to rule on a request to end the sport's permanent ban of the career hits leader, who died in September.",
    "link": "https://www.nbcsports.com/mlb/news/rob-manfred-says-he-discussed-pete-roses-status-with-donald-trump-and-will-rule-on-reinstatement",
    "timestamp": "2025-04-28T21:21:59Z"
  },
  {
    "title": "Trump touts immigration crackdown despite concerns about due process",
    "description": "U.S. President Donald Trump's administration touted the early results of his immigration crackdown on Monday despite concerns over due process, displaying photos of alleged criminal offenders on the White House lawn and preparing to target cities and states t…",
    "link": "https://japantoday.com/category/world/trump-touts-immigration-crackdown-despite-concerns-about-due-process2",
    "timestamp": "2025-04-28T21:21:49Z"
  },
  {
    "title": "Canadians vote in election dominated by concerns about Trump",
    "description": "Canadians went to the polls on Monday after an election campaign in which U.S. President Donald Trump's tariffs and musings about annexing Canada became the central issue. Trump's threats ignited a wave of patriotism that swelled support for Liberal Prime Min…",
    "link": "https://japantoday.com/category/world/canadians-vote-in-election-dominated-by-concerns-about-trump3",
    "timestamp": "2025-04-28T21:21:37Z"
  },
  {
    "title": "Russia declares 72-hour ceasefire in Ukraine for next week to mark Victory Day in World War II",
    "description": "Russian President Vladimir Putin on Monday declared a unilateral 72-hour ceasefire next week in Ukraine to mark Victory Day in World War II as the U.S. presses for a deal to end the 3-year-old war. Kyiv insisted on a longer and immediate truce. The Kremlin sa…",
    "link": "https://japantoday.com/category/world/russia-declares-a-ceasefire-in-ukraine-on-may-8-10-for-wwii-victory-day",
    "timestamp": "2025-04-28T21:21:29Z"
  },
  {
    "title": "No One Is Buying Super Bowl MVP’s Excuse for Snubbing Trump",
    "description": "Jalen Hurts, the Philadelphia Eagles quarterback who went viral for snubbing a reporter’s question about his team’s White House visit, has finally offered up...",
    "link": "https://www.thedailybeast.com/no-one-is-buying-super-bowl-mvps-excuse-for-snubbing-trump/",
    "timestamp": "2025-04-28T21:20:40Z"
  },
  {
    "title": "Trump’s First 100 Days Reveal a ‘Strongman’s’ Unprecedented Weakness",
    "description": "No U.S. president has ever surrendered global power so quickly.",
    "link": "http://foreignpolicy.com/2025/04/28/trump-first-100-days-strongman-weakness-russia-china-trade/",
    "timestamp": "2025-04-28T21:20:38Z"
  },
  {
    "title": "GOP Senator Defends Trump Administration's Arrest of Wisconsin Judge",
    "description": "Senator John Cornyn of Texas said Trump is \"following through\" on his campaign promises.",
    "link": "https://www.newsweek.com/john-cornyn-defends-trump-admin-judge-arrest-2065297",
    "timestamp": "2025-04-28T21:20:27Z"
  },
  {
    "title": "War on Welcome and ‘hate media’: Coalition campaign pivots to full-scale culture clash",
    "description": "As the election bus pulls into the station (assuming it hasn't got stuck in a bike lane), Peter Dutton's campaign has resorted to culture warring in a last-ditch effort to win undecided voters.\nThe post War on Welcome and ‘hate media’: Coalition campaign pivo…",
    "link": "http://www.crikey.com.au/2025/04/29/2025-federal-election-culture-wars-peter-dutton/",
    "timestamp": "2025-04-28T21:20:14Z"
  },
  {
    "title": "Bitcoin Momentum Stalls Ahead of Busy Macro Week, Potential Trade Deals",
    "description": "Investors want to know how the threat of Trump’s tariffs are affecting inflation and the labor market.",
    "link": "https://decrypt.co/316784/bitcoin-stalls-ahead-busy-macro-week-potential-trade-deals",
    "timestamp": "2025-04-28T21:18:20Z"
  },
  {
    "title": "Republicans Sneak Staggering Asylum Fee into Budget Bill",
    "description": "So much for poor, huddled masses: Republicans on the House Judiciary Committee intend, to make it prohibitively expensive to immigrate to the United States. \r\nIn a 116-page reconciliation amendment from Chairman Jim Jordan, Republicans have proposed a whoppin…",
    "link": "https://newrepublic.com/post/194518/republicans-sneak-asylum-fee-budget-bill",
    "timestamp": "2025-04-28T21:18:03Z"
  },
  {
    "title": "Violence-weary Trinidadians vote in general election",
    "description": "Residents of Trinidad and Tobago voted in parliamentary elections Monday that will also determine who becomes prime minister as the twin-island Caribbean nation battles an economic slump and rise in gang violence. Former energy minister Stuart Young, 50, took…",
    "link": "https://www.digitaljournal.com/world/violence-weary-trinidadians-vote-in-general-election-2/article",
    "timestamp": "2025-04-28T21:17:20Z"
  },
  {
    "title": "Roundup: Trump's call for free U.S. passage through Suez Canal sparks outcry in Egypt",
    "description": "CAIRO, April 28 (Xinhua) -- U.S. President Donald Trump's recent call for free passage of American ships through the Suez Canal has triggered widespread condemnation in Egypt, where legal experts, political leaders, and citizens have denounced his remarks as …",
    "link": "https://www.thestar.com.my/news/world/2025/04/29/roundup-trump039s-call-for-free-us-passage-through-suez-canal-sparks-outcry-in-egypt",
    "timestamp": "2025-04-28T21:17:00Z"
  },
  {
    "title": "Trump Administration Launches Probes of Harvard Law Review’s Racial Preferences",
    "description": "The Trump administration on Monday launched multiple probes of Harvard University and the Harvard Law Review, citing allegations that the flagship law journal discriminates based on race.\nThe post Trump Administration Launches Probes of Harvard Law Review’s R…",
    "link": "https://freebeacon.com/campus/trump-administration-launches-probes-of-harvard-law-reviews-racial-preferences/",
    "timestamp": "2025-04-28T21:15:58Z"
  },
  {
    "title": "Jalen Hurts among Eagles skipping Super Bowl visit to White House due to 'scheduling conflict'",
    "description": "The Super Bowl-winning quarterback will be skipping the White House visit",
    "link": "https://www.cbssports.com/nfl/news/jalen-hurts-among-eagles-skipping-super-bowl-visit-to-white-house-due-to-scheduling-conflict/",
    "timestamp": "2025-04-28T21:14:59Z"
  },
  {
    "title": "Rob Manfred discussed Pete Rose with President Trump, will rule on reinstatement",
    "description": "Baseball Commissioner Rob Manfred said he discussed Pete Rose with President Donald Trump at a recent meeting, and that he won't \"pocket veto\" the request to end the sport’s permanent ban of the career hits leader.",
    "link": "https://www.foxsports.com/stories/mlb/rob-manfred-discussed-pete-rose-president-trump-will-rule-reinstatement",
    "timestamp": "2025-04-28T21:14:45Z"
  },
  {
    "title": "9/11 families demand extradition of Saudi national tied to video evidence",
    "description": "The \"pissed off\" 9/11 families suing Saudi Arabia in federal court over alleged links to the terror attacks are demanding a key suspect be extradited to the U.S. to stand trial.",
    "link": "https://www.bostonherald.com/2025/04/28/9-11-families-demand-extradition-of-saudi-national-tied-to-video-evidence/",
    "timestamp": "2025-04-28T21:12:30Z"
  },
  {
    "title": "Super Bowl MVP Jalen Hurts to skip Eagles' White House visit with Trump - Axios",
    "description": "Super Bowl MVP Jalen Hurts to skip Eagles' White House visit with TrumpAxios Updates: Eagles celebrating Super Bowl win with President Donald Trump at White House without HurtsNBC10 Philadelphia Eagles star Saquon Barkley hangs out with Trump after Jalen Hurt…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177199173",
    "timestamp": "2025-04-28T21:12:27Z"
  },
  {
    "title": "[Ilya Somin] New York Times Symposium on \"A Road Map of Trump's Lawless Presidency\"",
    "description": "Earlier today, the New York Times published a symposium entitled \"A Road Map of Trump's Lawless Presidency.\" Thirty-five legal scholars took part,",
    "link": "https://reason.com/volokh/2025/04/28/new-york-times-symposium-on-a-road-map-of-trumps-lawless-presidency/",
    "timestamp": "2025-04-28T21:12:15Z"
  },
  {
    "title": "LIVE: President Trump Holds a Rally Celebrating his First 100 Days in Macomb County, MI – 4/29/25 6pm ET",
    "description": "Celebrate President Trump’s Historic First 100 Days in Office April 29th marks the date for President Trump’s historic FIRST 100 DAYS IN OFFICE RALLY — hosted by Securing American Greatness. Thousands of other Trump-loving Patriots will be heading to Michigan…",
    "link": "https://freerepublic.com/focus/f-news/4313840/posts",
    "timestamp": "2025-04-28T21:11:28Z"
  },
  {
    "title": "Karl Rove Raises Red Flag for Trump Administration",
    "description": "The Fox News contributor spoke about a new poll saying the Trump administration is in \"bad shape.\"",
    "link": "https://www.newsweek.com/karl-rove-raises-red-flag-trump-administration-2065303",
    "timestamp": "2025-04-28T21:11:25Z"
  },
  {
    "title": "Trump's blue funeral suit caused uproar. Here's what we know about whether it broke Vatican dress code",
    "description": "The U.S. president wore a blue suit, blue tie and American flag lapel pin to the funeral of Pope Francis on April 26, 2025.",
    "link": "https://www.snopes.com//news/2025/04/28/trump-blue-suit-funeral-pope-francis/",
    "timestamp": "2025-04-28T21:11:00Z"
  },
  {
    "title": "Trump's Independent Voter Problem",
    "description": "In this week's Reason Roundtable, we discuss how current political frustrations are vindicating longstanding libertarian critiques.",
    "link": "https://reason.com/podcast/2025/04/28/trumps-independent-voter-problem/",
    "timestamp": "2025-04-28T21:10:38Z"
  },
  {
    "title": "Trump Healthcare Price Transparency Rule Laying the 'Foundation for a Healthy America'",
    "description": "President Donald Trump's healthcare price transparency rule empowers Americans to make informed choices about their healthcare needs and lays the \"foundation for a healthy America,\" experts said.\nThe post Trump Healthcare Price Transparency Rule Laying the ‘F…",
    "link": "https://www.breitbart.com/politics/2025/04/28/trump-healthcare-price-transparency-rule-laying-the-foundation-for-a-healthy-america/",
    "timestamp": "2025-04-28T21:10:34Z"
  },
  {
    "title": "Italian Street Artist Mocks Far-Right Attendees of the Pope’s Funeral",
    "description": "The artwork depicts the late pontiff from heaven, wondering “who invited” Trump and other conservative politicians the pope openly criticized in his lifetime.",
    "link": "http://hyperallergic.com/1007281/italian-street-artist-mocks-far-right-attendees-of-the-pope-funeral/",
    "timestamp": "2025-04-28T21:10:13Z"
  },
  {
    "title": "Grassley Asks Patel To Declassify FBI Analysis Of Criminal Referral For Famed Russia Collusion Hoaxer",
    "description": "Sen. Chuck Grassley, R-Iowa, asked the FBI on Monday to declassify a document related to the actions of a prominent player in the agency’s baseless Russia collusion hoax. In his letter addressed to FBI Director Kash Patel, the Hawkeye State’s senior senator r…",
    "link": "https://thefederalist.com/2025/04/28/grassley-asks-patel-to-declassify-fbi-analysis-of-criminal-referral-for-famed-russia-collusion-hoaxer/",
    "timestamp": "2025-04-28T21:09:40Z"
  },
  {
    "title": "President Trump wants tush push to stay, dynamic kickoff to go",
    "description": "The Eagles have found a fairly powerful ally in their effort to keep the tush push in pro football.",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/president-trump-wants-tush-push-to-stay-dynamic-kickoff-to-go",
    "timestamp": "2025-04-28T21:09:40Z"
  },
  {
    "title": "Trump to sign order cracking down on 'sanctuary' cities, threaten their federal funding",
    "description": "The order comes as Trump seeks to speed up deportations, following through on a key promise he made on the campaign trail during his third bid for president.",
    "link": "https://www.foxnews.com/politics/trump-sign-order-cracking-down-sanctuary-cities-threaten-federal-funding",
    "timestamp": "2025-04-28T21:08:57Z"
  },
  {
    "title": "Trump taunts Taylor Swift over Chiefs Super Bowl loss during Philadelphia Eagles visit",
    "description": "Both Swift and Trump attended the Super Bowl back in February",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/donald-trump-taylor-swift-eagles-white-house-b2741127.html",
    "timestamp": "2025-04-28T21:08:16Z"
  },
  {
    "title": "Judges are not above the law —even if they’re trying to protect illegal-immigrant thugs",
    "description": "Why was Hannah Dugan arrested? Because the Wisconsin judge allegedly broke the law to save a border jumper.",
    "link": "https://nypost.com/2025/04/28/opinion/wisconsin-judge-hannah-dugan-is-not-above-the-law-dems-stop-trying-to-protect-illegal-immigrant-thugs/",
    "timestamp": "2025-04-28T21:07:47Z"
  },
  {
    "title": "Republicans Float Charging Migrants $1,000 to Claim Asylum",
    "description": "The idea was included in the latest 2025 budget proposals, alongside extra funding for ICE and the Border Patrol.",
    "link": "https://www.newsweek.com/house-gop-new-asylum-application-fee-immigration-budget-2065304",
    "timestamp": "2025-04-28T21:07:47Z"
  },
  {
    "title": "NY lawmaker pitches ban on naming public buildings after felons — to avoid renaming Penn Station after Trump",
    "description": "What’s in a name? State Sen. Brad Hoylman-Sigal (D-Manhattan) is considering introducing a bill to ban public buildings from being named after convicted felons — in a move to stop Penn Station from being renamed after President Trump. The idea — first reporte…",
    "link": "https://nypost.com/2025/04/28/us-news/nyc-lawmaker-pitches-ban-naming-public-buildings-after-felons-to-avoid-renaming-penn-station-after-trump/",
    "timestamp": "2025-04-28T21:06:34Z"
  },
  {
    "title": "Preços do petróleo Brent caem devido a temores sobre demanda",
    "description": "O Brent fechou a US$ 65,86 o barril, queda de 1,51%; o petróleo WTI encerrou a US$ 62,05 o barril, baixa de 1,5%\nThe post Preços do petróleo Brent caem devido a temores sobre demanda appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mercados/precos-do-petroleo-brent-caem-devido-a-temores-sobre-demanda/",
    "timestamp": "2025-04-28T21:05:57Z"
  },
  {
    "title": "Fired Pentagon Official Says He's 'Not Sure' if Pete Hegseth Is OK",
    "description": "Former Pentagon official Colin Carroll described Hegseth as fixated on \"weird details and very agitated.\"",
    "link": "https://www.newsweek.com/fired-pentagon-official-colin-carroll-pete-hegseth-2065282",
    "timestamp": "2025-04-28T21:05:51Z"
  },
  {
    "title": "Manfred to rule on Rose ban after Trump meeting",
    "description": "After meeting with President Trump, MLB commissioner Rob Manfred said he wants to issue a ruling on a request to end the permanent ban of Pete Rose, who died in September.",
    "link": "https://www.espn.com/mlb/story/_/id/44905639/mlb-rule-request-end-pete-rose-ban-trump-meeting",
    "timestamp": "2025-04-28T21:05:37Z"
  },
  {
    "title": "The rapid remaking of a nation, in 100 days",
    "description": "The impact of what President Trump has done so far is being felt in every corner of American life.",
    "link": "https://www.bbc.com/news/articles/cly1n7jz587o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-28T21:05:34Z"
  },
  {
    "title": "Envoy to Israel Huckabee Says Deal Can Be Reached If Iran Gives Up Ambitions of ‘Nuclear Weaponry’",
    "description": "JERUSALEM, Israel—Iran could see a breakthrough in its nuclear nonproliferation negotiations with the United States, but “it’s up to them,” according to U.S. Ambassador to... Read More\nThe post Envoy to Israel Huckabee Says Deal Can Be Reached If Iran Gives U…",
    "link": "https://www.dailysignal.com/2025/04/28/envoy-israel-huckabee-says-deal-can-be-reached-if-iran-agrees-give-up-ambitions-nuclear-weaponry/",
    "timestamp": "2025-04-28T21:05:04Z"
  },
  {
    "title": "Envoy to Israel Huckabee Says Deal Can Be Reached If Iran Gives Up Ambitions of ‘Nuclear Weaponry’",
    "description": "JERUSALEM, Israel—Iran could see a breakthrough in its nuclear nonproliferation negotiations with the United States, but “it’s up to them,” according to U.S. Ambassador to... Read More\nThe post Envoy to Israel Huckabee Says Deal Can Be Reached If Iran Gives U…",
    "link": "https://www.dailysignal.com/2025/04/28/envoy-to-israel-huckabee-says-deal-can-be-reached-if-iran-gives-up-ambitions-of-nuclear-weaponry/",
    "timestamp": "2025-04-28T21:05:00Z"
  },
  {
    "title": "Biggest Political Battles of 2026 Taking Shape",
    "description": "Five senators and eight House representatives have announced they will not seek reelection in 2026",
    "link": "https://www.newsweek.com/biggest-political-battles-2026-taking-shape-2065299",
    "timestamp": "2025-04-28T21:01:58Z"
  },
  {
    "title": "SANDOVAL: Why Are So Many Democrats Okay With Killing Trump? One Poll Has The Answer",
    "description": "Nearly three-quarters of self-identified Democrats believe President Donald Trump is a ‘fascist’ dictator, according to a new survey from Rasmussen Reports",
    "link": "https://dailycaller.com/2025/04/28/democrat-party-poll-assassination-culture-donald-trump-fascist-dictatorship-mahmoud-khalil/",
    "timestamp": "2025-04-28T21:01:14Z"
  },
  {
    "title": "Penn Violated Federal Law by Allowing Biological Men in Women's Sports, Says Trump's Education Department",
    "description": "The Department of Education announced Monday that the University of Pennsylvania violated Title IX, a federal law that prohibits sex-based discrimination, by allowing biological men to compete in women's sports and enter female-only facilities.\nThe post Penn …",
    "link": "https://freebeacon.com/latest-news/penn-violated-federal-law-by-allowing-biological-men-in-womens-sports-says-trumps-education-department/",
    "timestamp": "2025-04-28T21:00:59Z"
  },
  {
    "title": "Justin Sun Bets Big On JUST Token – Here’s Why He Sees 100x Potential",
    "description": "Tron founder Justin Sun has set the crypto community abuzz with a very ambitious forecast that JUST (JST) token will grow a hundred-fold. Related Reading: XRP Nearing Explosive Breakout—$10 Target In Sight, Expert Says Justin Sun Asserts ‘Complete Fundamental…",
    "link": "http://www.newsbtc.com/altcoin/justin-sun-bets-big-on-just-token-heres-why-he-sees-100x-potential/",
    "timestamp": "2025-04-28T21:00:44Z"
  },
  {
    "title": "Elizabeth Warren gets in treasury secretary's face over ​insider trading accusations",
    "description": "Democratic U.S. Sen. Elizabeth Warren is pressing Treasury Secretary Scott Bessent for answers following reports that officials inside President Donald Trump's White House have been providing Wall Street executives with advance notice about potentially market…",
    "link": "https://www.rawstory.com/elizabeth-warren-2671858575/",
    "timestamp": "2025-04-28T21:00:33Z"
  },
  {
    "title": "Stephen Miller Dukes It Out With Reporter Suggesting Trump Admin Is Targeting Mothers And Children",
    "description": "Stephen Miller quarreled with a reporter Monday as he suggested that President Donald Trump's administration is targeting mothers and their young children.",
    "link": "https://dailycaller.com/2025/04/28/stephen-miller-fights-reporter-mothers-children-illegal-immigrants/",
    "timestamp": "2025-04-28T21:00:18Z"
  },
  {
    "title": "'Absolute Insanity': Right-Wing Activist Asks If Trump Will Suspend Habeas Corpus to Expel More Migrants",
    "description": "With the Trump administration making space in the press briefing room for right-wing podcasters and other conservative \"new media\" content creators, viewers of briefings since President Donald Trump took office have seen his press secretary field questions ab…",
    "link": "https://www.commondreams.org/news/suspension-of-habeus-corpus",
    "timestamp": "2025-04-28T21:00:18Z"
  },
  {
    "title": "Yes, iPhone Prices Are Likely to Climb Even if High Tariffs Don't Hit Apple",
    "description": "Many factors could cause the cost of Apple products to rise. Follow these expert tips to save, even if prices go up.",
    "link": "https://www.cnet.com/personal-finance/taxes/yes-iphone-prices-are-likely-to-climb-even-if-high-tariffs-dont-hit-apple/",
    "timestamp": "2025-04-28T21:00:00Z"
  },
  {
    "title": "Lana Del Rey has alienated fans with problematic comments and lyrics. Here's a timeline of the singer's controversies.",
    "description": "Lana Del Rey said she \"kissed Morgan Wallen\" during her recent performance at Stagecoach, fueling speculation about her political beliefs.",
    "link": "https://www.businessinsider.com/lana-del-rey-problematic-backlash-timeline-2021-1",
    "timestamp": "2025-04-28T20:57:29Z"
  },
  {
    "title": "This Week, Three Elections Will Show Trump's Worldwide Impact | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere has probably never been an American president whose actions reverberated globally quite like this. Donald Trump has scrambled politics not only in the United States but across the democratic world. His d…",
    "link": "https://biztoc.com/x/3a67ec49a404e27b",
    "timestamp": "2025-04-28T20:57:21Z"
  },
  {
    "title": "Vance warns ‘Ukrainians aren’t winning the war’ while Trump says he could join Kyiv’s ‘side’",
    "description": "\"There are many forms of weapons,\" Trump said when asked if he'd ever give Ukraine \"full-blown support.\" \"It can be weapons with sanctions. It can be weapons with banking. It can be many other weapons.\"",
    "link": "https://nypost.com/2025/04/28/us-news/vance-warns-ukrainians-arent-winning-the-war-while-trump-says-he-could-join-kyivs-side/",
    "timestamp": "2025-04-28T20:56:27Z"
  },
  {
    "title": "Canada election: Carney and Trump speak by phone as Liberals hold onto power",
    "description": null,
    "link": "https://www.cbc.ca/news/politics/livestory/canada-election-carney-and-trump-speak-by-phone-after-liberals-hold-onto-power-9.6738893",
    "timestamp": "2025-04-28T20:55:40Z"
  },
  {
    "title": "This Week, Three Elections Will Show Trump's Worldwide Impact | Opinion",
    "description": "In Canada's election today, whatever the final result, we have seen a remarkable liberal comeback fueled by burning rage at Trump and MAGA.",
    "link": "https://www.newsweek.com/this-week-three-elections-will-show-trumps-worldwide-impact-opinion-2065144",
    "timestamp": "2025-04-28T20:53:21Z"
  },
  {
    "title": "“It Is A Full-Blown Crisis Already”: Farmers Cry Out For Help As Massive Financial Losses Pile Up And Demand For U.S. Agricultural Products Disappears",
    "description": "China is normally the largest export market for U.S. agricultural products.  In a typical year, we sell tens of billions of dollars worth of agricultural products to the Chinese, but now that door has been slammed shut thanks to the extremely high tariffs tha…",
    "link": "http://theeconomiccollapseblog.com/it-is-a-full-blown-crisis-already-farmers-cry-out-for-help-as-massive-financial-losses-pile-up-and-demand-for-u-s-agricultural-products-disappears/",
    "timestamp": "2025-04-28T20:52:07Z"
  },
  {
    "title": "Study of over 865,000 abortion pill patients: 11% suffer ‘serious adverse events’",
    "description": "null / Credit: ivanko80/Shutterstock\n\nWashington, D.C. Newsroom, Apr 28, 2025 / 16:52 pm (CNA).\nA first-of-its-kind study that delves into public health insurance records found that more than 1 in 10 women who take the abortion pill mifepristone to complete a…",
    "link": "https://www.catholicnewsagency.com/news/263725/study-of-over-865000-abortion-pill-patients-11-percent-suffer-serious-adverse-events",
    "timestamp": "2025-04-28T20:52:00Z"
  },
  {
    "title": "Brand USA: 10+ Years of Fighting for Funding",
    "description": "Ever since its creation in 2010 to be the country's destination marketing organization, Brand USA has faced potential cuts and even threats of elimination. -Rashaad Jorden",
    "link": "http://skift.com/2025/04/28/brand-usas-history-a-skift-timeline/",
    "timestamp": "2025-04-28T20:51:00Z"
  },
  {
    "title": "Trump lashes out over polls, calls for investigations of ‘fake news’",
    "description": "President Donald Trump lashed out at pollsters Monday after recent surveys showed a slump in his support, prompting his call for investigations into “fake news organizations\" and alleged election fraud.",
    "link": "https://www.bostonherald.com/2025/04/28/trump-lashes-out-over-polls-calls-for-investigations-of-fake-news/",
    "timestamp": "2025-04-28T20:50:55Z"
  },
  {
    "title": "Pakistan fears India incursion 'imminent' amid heightened tensions following terror attack",
    "description": "Decades-long tensions between India and Pakistan are once again threatening regional stability, as Islamabad warns New Delhi could launch an incursion following a recent terrorist attack in Kashmir.",
    "link": "https://www.foxnews.com/world/pakistan-fears-india-incursion-imminent-amid-heightened-tensions-following-terror-attack",
    "timestamp": "2025-04-28T20:50:53Z"
  },
  {
    "title": "Past Environmental Officials of Both Parties Assail Trump's First 100 Days",
    "description": "Former environmental agency leaders under Republican and Democratic presidents condemned what they called the dismantling of climate and health rules.",
    "link": "https://www.newsweek.com/past-environmental-officials-both-parties-assail-trumps-first-100-days-2065229",
    "timestamp": "2025-04-28T20:49:12Z"
  },
  {
    "title": "Jalen Hurts Sidesteps Eagles’ Visit With Trump At The White House",
    "description": "When the Eagles won the Super Bowl in 2018, during Trump's first administration, their invitation to the White House was rescinded when not enough players committed to attending.",
    "link": "https://www.huffpost.com/entry/jalen-hurts-eagles-players-white-house-visit_n_680fbb2ce4b0a4f4db7efa59",
    "timestamp": "2025-04-28T20:49:11Z"
  },
  {
    "title": "The Turmoil Following BreachForums Shutdown: Confusion, Risks, and a New Beginning",
    "description": "BreachForums, a major data leak marketplace, shut down on April 15 after a MyBB 0-day exploit allowed law enforcement infiltration. On April 15, BreachForums, one of the top marketplaces for stolen data, abruptly shut down, fueling widespread speculation. Rum…",
    "link": "https://securityaffairs.com/177146/hacking/the-turmoil-following-breachforums-shutdown-confusion-risks-and-a-new-beginning.html",
    "timestamp": "2025-04-28T20:48:56Z"
  },
  {
    "title": "'Dark swerve': Analysis shows US quickly becoming a 'police state' under Trump",
    "description": "President Donald Trump has not quite turned America into a dictatorship, wrote Eduardo Porter in a lengthy analysis for The Washington Post — but many of his actions bear a striking resemblance to how Latin American dictators in the present and the recent pas…",
    "link": "https://www.rawstory.com/trump-2671858509/",
    "timestamp": "2025-04-28T20:47:54Z"
  },
  {
    "title": "Trump Is Trying to Reinstate Columbus Day, Which Was Never Canceled",
    "description": "Trump isn't reviving a canceled holiday; Biden issued Columbus Day proclamations every year. But also, Columbus never set foot in the U.S.",
    "link": "https://time.com/7281083/donald-trump-columbus-day/",
    "timestamp": "2025-04-28T20:47:37Z"
  },
  {
    "title": "'If You Can Keep It': America In Constitutional Crisis",
    "description": "Big news is happening at a breakneck pace these days. But on the cusp of the 100th day of President Donald Trump's second administration, let's take a pause to go back in time to Sept. 30, 1962.\nOn that day, President John F. Kennedy sent U.S. military forces…",
    "link": "https://www.npr.org/2025/04/28/1247707524/1a-04-28-2025",
    "timestamp": "2025-04-28T20:47:07Z"
  },
  {
    "title": "Dan Niles Says NVIDIA (NVDA) $5.5 Billion Charge Shows Demand Issues – ‘They Can’t Resell Chips Anywhere Else’",
    "description": "We recently published a list of 10 Stocks Analysts are Talking About Amid Trump’s Tariff War. In this article, we are going to take a look at where NVIDIA...",
    "link": "https://finance.yahoo.com/news/dan-niles-says-nvidia-nvda-204650745.html",
    "timestamp": "2025-04-28T20:46:50Z"
  },
  {
    "title": "‘Give Me a Break!’ Judge Shreds DOJ Attorney Defending Trump Executive Order Targeting Law Firm",
    "description": "A federal judge firmly swatted down a series of arguments from a Department of Justice attorney defending President Donald Trump’s executive order targeting the Jenner & Block LLP law firm at a hearing Monday, at one point uttering an exasperated “Give me a b…",
    "link": "https://www.mediaite.com/news/give-me-a-break-judge-shreds-doj-attorney-defending-trump-executive-order-targeting-law-firm/",
    "timestamp": "2025-04-28T20:46:32Z"
  },
  {
    "title": "Times Poll finds widespread dissatisfaction with first 100 days of Donald Trump's second term",
    "description": "The disapproval of Trump extends from major issues, especially his handling of tariffs and government workers, to less-substantive ones such as golf and the Oval Office.",
    "link": "https://biztoc.com/x/294daa5c824f4326",
    "timestamp": "2025-04-28T20:46:11Z"
  },
  {
    "title": "US stocks little changed as market awaits big tech results",
    "description": "NEW YORK: Wall Street stocks finished little changed Monday (Apr 28) in the first day of a news-jammed week that includes earnings from several tech giants and major economic data releases. Major indices meandered in and out of positive territory in a session…",
    "link": "https://www.channelnewsasia.com/world/us-stocks-little-changed-market-awaits-big-tech-results-5095666",
    "timestamp": "2025-04-28T20:46:00Z"
  },
  {
    "title": "Global stocks mixed amid trade hopes as markets await tech earnings",
    "description": "NEW YORK: Global stocks were steady on Monday (Apr 28) as investors welcomed the absence of further trade war escalation over the weekend and as countries seek to temper US President Donald Trump's aggres",
    "link": "https://www.channelnewsasia.com/business/global-stocks-mixed-amid-trade-hopes-markets-await-tech-earnings-5095666",
    "timestamp": "2025-04-28T20:46:00Z"
  }
]