[
  {
    "title": "Trump tells crypto leaders he's committed to helping their industry",
    "description": "President Donald Trump said Friday that he was committed to making the U.S. a world leader in cryptocurrencies as industry leaders heaped praise on him for reversing what they said had been unfair attacks on digital assets by the previous administration. \n\n\n\"…",
    "link": "https://www.voanews.com/a/trump-tells-crypto-leaders-he-s-committed-to-helping-their-industry/8003353.html",
    "timestamp": "2025-03-08T00:36:07Z"
  },
  {
    "title": "No evidence Apple removed International Women's Day from calendar app",
    "description": "The globally celebrated day falls annually on March 8.",
    "link": "https://www.snopes.com//news/2025/03/07/international-womens-day-apple-google/",
    "timestamp": "2025-03-08T00:36:00Z"
  },
  {
    "title": "Kraken Plots Public Offering After SEC Agrees to Drop Lawsuit: Bloomberg",
    "description": "Crypto exchange Kraken is preparing to go public next year after previous legal setbacks, according to a report.",
    "link": "https://decrypt.co/309180/kraken-plots-public-offering-report",
    "timestamp": "2025-03-08T00:35:57Z"
  },
  {
    "title": "DOGE Wins Court Battle But Remains Blocked From Payment System",
    "description": "The Department of Government Efficiency (DOGE) reportedly won a court battle Friday but is still blocked from accessing the Treasury payment system by an earlier ruling in another court. On Friday (March 7), a federal judge in Washington, D.C., rejected a req…",
    "link": "https://www.pymnts.com/politics/2025/doge-wins-court-battle-but-remains-blocked-from-payment-system/",
    "timestamp": "2025-03-08T00:35:03Z"
  },
  {
    "title": "'I don't trust a word of it': Federal workers deeply skeptical that Trump will rein in Musk (Politico)",
    "description": "Politico:\n'I don't trust a word of it': Federal workers deeply skeptical that Trump will rein in Musk  —  The president and Republicans have faced political blowback over steep cuts to the workforce.  —  Federal workers, Democrats and even some Republican law…",
    "link": "https://www.memeorandum.com/250307/p129",
    "timestamp": "2025-03-08T00:35:01Z"
  },
  {
    "title": "Was Amy Coney Barrett Trump's Biggest Mistake?",
    "description": "Amy Coney Barrett, one of President Donald Trump's nominees to the U.S. Supreme Court, has voted against him in key cases, including a March 5 decision to stop his cancellations of USAID contracts. Why It Matters Trump has a 6-3 conservative majority on the S…",
    "link": "https://freerepublic.com/focus/f-news/4302857/posts",
    "timestamp": "2025-03-08T00:34:41Z"
  },
  {
    "title": "Poland mulls mines treaty exit, plans military training for men. a possible exit from a landmark anti-mines treaty and large-scale military trainings for men.",
    "description": "Poland, a staunch Ukraine ally, has been arming itself heavily as it eyes warily neighbouring Russia and amid calls from US President Donald Trump for European countries to take more responsibility for their own defence. Warsaw is already far ahead of its all…",
    "link": "https://freerepublic.com/focus/f-news/4302856/posts",
    "timestamp": "2025-03-08T00:34:27Z"
  },
  {
    "title": "Trump should talk to anyone, anywhere, if it can save our hostages",
    "description": "After 17 months of war, it is time to put an end to the hostage crisis, and bring home all our people.",
    "link": "https://www.jpost.com/american-politics/article-845174",
    "timestamp": "2025-03-08T00:33:25Z"
  },
  {
    "title": "Why business schools hold the key in bridging the gender gap",
    "description": "Despite efforts to improve gender diversity in the workplace, women remain underrepresented in leadership roles. Can targeted admissions policies in educational institutions, scholarships, and corporate hiring strategies close the gender gap?",
    "link": "https://www.livemint.com/opinion/online-views/business-schools-bridging-gender-gap-women-in-mba-programmes-women-leaders-dei-initiatives-women-workforce-11741335726140.html",
    "timestamp": "2025-03-08T00:30:19Z"
  },
  {
    "title": "Trump administration cancels $400M in grants and contracts with Columbia University",
    "description": "The Trump administration said Friday it will pull $400 million from Columbia University because of what the government describes as the Ivy League school’s failure to squelch antisemitism.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_b42215c9-bd16-556c-ad72-5d8aa70528d4.html",
    "timestamp": "2025-03-08T00:30:00Z"
  },
  {
    "title": "Trump administration cancels $400M in grants and contracts with Columbia University",
    "description": "The Trump administration said Friday it will pull $400 million from Columbia University because of what the government describes as the Ivy League school’s failure to squelch antisemitism.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_6ab553ce-38d1-5476-abfb-710eecf05233.html",
    "timestamp": "2025-03-08T00:30:00Z"
  },
  {
    "title": "Muslim nations endorse alternative to Trump's Gaza takeover plan",
    "description": "by Haitham EL-TABEIThe Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump's controversial plan to take over Gaza and displace its residents, two ministers told AFP.The decision by the 57-member …",
    "link": "https://www.rawstory.com/trump-gaza-2671289366/",
    "timestamp": "2025-03-08T00:28:42Z"
  },
  {
    "title": "OCC lays out crypto banking after Trump vows to end Operation Chokepoint 2.0",
    "description": "The Office of the Comptroller of the Currency (OCC) has eased \"the burden\" on banks engaging in crypto activities after Donald Trump vowed to end the “ridiculous” Operation Chokepoint 2.0.",
    "link": "https://cointelegraph.com/news/occ-crypto-banking-donald-trump-ends-operation-chokepoint-2-0",
    "timestamp": "2025-03-08T00:28:07Z"
  },
  {
    "title": "Poilievre vows to repeal environmental assessment law to fast-track resource projects",
    "description": "Conservative Leader Pierre Poilievre has vowed to repeal a key Liberal environmental law if his party wins the next federal election to streamline approval of major projects, such as pipelines, mines, and LNG plants.",
    "link": "https://www.nationalobserver.com/2025/03/07/news/poilievre-vows-repeal-environmental-assessment-law-fast-track-resource-projects",
    "timestamp": "2025-03-08T00:27:37Z"
  },
  {
    "title": "Trump threatens Russia with sanctions until Ukraine peace reached",
    "description": "Trump's threat of banking curbs and tariffs followed a report Monday that the White House was preparing to give Russia possible sanctions relief as part of the push to end the war.",
    "link": "https://www.japantimes.co.jp/news/2025/03/08/world/politics/trump-threatens-russia-sanctions-ukraine/",
    "timestamp": "2025-03-08T00:25:00Z"
  },
  {
    "title": "The White House Is Showing Signs It Is (Finally) Tiring of Elon Musk",
    "description": "What's this, rumors of a showdown between Little Marco and the DOGE boss?",
    "link": "https://www.esquire.com/news-politics/politics/a64097264/trump-musk-doge-firings-republicans/",
    "timestamp": "2025-03-08T00:24:00Z"
  },
  {
    "title": "'They will face prison': Kristi Noem vows retribution for 'criminal leakers'",
    "description": "Homeland Security Secretary Kristi Noem announced in a post to X on Friday evening that she has identified two \"leakers\" within the agency — and vowed there would be swift criminal prosecution.\"We have identified criminal leakers within @DHSgov and are prepar…",
    "link": "https://www.rawstory.com/kristi-noem-2671289301/",
    "timestamp": "2025-03-08T00:23:18Z"
  },
  {
    "title": "Breaking down whether Democrats didn't stand and clap for child battling cancer at Trump speech",
    "description": "President Donald Trump brought attention to 13-year-old DJ Daniel during his speech to Congress in March 2025.",
    "link": "https://www.snopes.com//news/2025/03/07/dj-daniel-trump-democrats/",
    "timestamp": "2025-03-08T00:22:00Z"
  },
  {
    "title": "Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol",
    "description": "A company owned by President Donald Trump sued Capital One on Friday, claiming the bank unjustifiably terminated over 300 of the Trump Organization's accounts without cause in 2021, shortly after the Jan. 6 attack on the U.S. Capitol.\nThe suit was filed by th…",
    "link": "https://biztoc.com/x/5cdaa38adc922ea6",
    "timestamp": "2025-03-08T00:20:20Z"
  },
  {
    "title": "Trump Greets Lawmakers After Giving Address to Congress",
    "description": "President Donald Trump delivered the biggest speech of his presidency yet, hitting on partisan talking points favored by his conservative base, while largely sidestepping the effects of his sweeping tariff proposals on consumers.\nThe speech was largely aimed …",
    "link": "https://biztoc.com/x/cd058d9f1bfb3a84",
    "timestamp": "2025-03-08T00:20:01Z"
  },
  {
    "title": "Worried About A 'Trumpcession'? Here's What Finance Experts Say You Should Do Now.",
    "description": "Advisers reveal how to handle this economic and stock market uncertainty and how it may affect your wallet.",
    "link": "https://www.huffpost.com/entry/trump-recession-financial-advice_l_67ca1d3ee4b0404dff301fd6",
    "timestamp": "2025-03-08T00:19:23Z"
  },
  {
    "title": "New EPA guidance says spending items greater than $50,000 must get approval from DOGE",
    "description": "The guidance escalates the role that DOGE plays in EPA operations.",
    "link": "https://www.bostonherald.com/2025/03/07/epa-spending-doge/",
    "timestamp": "2025-03-08T00:18:30Z"
  },
  {
    "title": "Making a better case for foreign aid",
    "description": "LONDON – Foreign aid is being slashed across the Global North, nowhere more so than in the United States. Within his first month back in the White House, President Donald Trump dismantled the US Agency for International Development (USAID) and froze foreign a…",
    "link": "https://english.khabarhub.com/2025/08/441771/",
    "timestamp": "2025-03-08T00:15:31Z"
  },
  {
    "title": "The Trump Organization’s Shake Down of Capital One",
    "description": "The Trump Organization is trying to shake down Capital One. And they’ll probably succeed. The Trump Organization has sued Capital One for closing its accounts in January 2021, allegedly because of Donald Trump’s political views. (Or, put differently, Capital …",
    "link": "https://www.creditslips.org/creditslips/2025/03/the-trump-organizations-shake-down-of-capital-one.html",
    "timestamp": "2025-03-08T00:15:19Z"
  },
  {
    "title": "Ukrainian forces fighting inside Russia are almost surrounded, open source maps show",
    "description": "Ukrainian forces in Russia's Kursk region face encirclement as Russian troops advance, cutting supply lines in a major setback for Kyiv's strategic gambit to gain leverage in potential peace talks.",
    "link": "https://www.jpost.com/breaking-news/article-845172",
    "timestamp": "2025-03-08T00:14:49Z"
  },
  {
    "title": "Report: Monmouth University Polling Institute to Close",
    "description": "Monmouth University reportedly plans to close its polling institute, with sources citing how administrators \"felt it was losing too much money.\"\nThe post Report: Monmouth University Polling Institute to Close appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/07/report-monmouth-university-polling-institute-to-close/",
    "timestamp": "2025-03-08T00:14:48Z"
  },
  {
    "title": "Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol",
    "description": "A company owned by President Donald Trump is suing Capital One",
    "link": "https://abcnews.go.com/US/wireStory/trump-organization-sues-capital-closing-bank-accounts-after-119576053",
    "timestamp": "2025-03-08T00:14:28Z"
  },
  {
    "title": "Trump Organization sues Capital One for closing bank accounts after Jan. 6 attack on US Capitol",
    "description": "The suit was filed by the Donald J. Trump Revocable Trust and Eric Trump in Miami-Dade Circuit Court.",
    "link": "https://www.bostonherald.com/2025/03/07/trump-organization-capital-one/",
    "timestamp": "2025-03-08T00:14:16Z"
  },
  {
    "title": "National Weather Service Suspending Critical Weather Tool Sparks Concerns",
    "description": "Recent cuts to national weather forecasting infrastructure have inspired backlash against the Trump administration.",
    "link": "https://www.newsweek.com/national-weather-service-suspending-critical-weather-tool-sparks-concern-2041552",
    "timestamp": "2025-03-08T00:12:54Z"
  },
  {
    "title": "Trump denied Musk-Rubio clash but watched it like a 'sporting event’: NY Times' Haberman",
    "description": "President Donald Trump had “very little” to say during an explosive Oval Office meeting Wednesday, instead choosing to watch the sparring match unfold between DOGE head Elon Musk and Secretary of State Marco Rubio “like it was some kind of sporting event.”Tha…",
    "link": "https://www.rawstory.com/trump-musk-2671289256/",
    "timestamp": "2025-03-08T00:11:06Z"
  },
  {
    "title": "Report: Kraken May Go Public as Soon as Q1 2026",
    "description": "Cryptocurrency exchange Kraken is reportedly preparing to go public as soon as the first quarter of 2026. The company’s plans could change, though, Bloomberg reported Friday (March 7), citing unnamed sources. When asked about the report by Bloomberg, Kraken d…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/report-kraken-may-go-public-as-soon-as-q1-2026/",
    "timestamp": "2025-03-08T00:07:50Z"
  },
  {
    "title": "Muslim nations endorse alternative to Trump’s Gaza takeover plan",
    "description": "The Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump’s controversial plan to take over Gaza and displace its residents, two ministers told AFP. The decision by the 57-member grouping came at a…",
    "link": "https://www.digitaljournal.com/world/muslim-nations-endorse-alternative-to-trumps-gaza-takeover-plan/article",
    "timestamp": "2025-03-08T00:07:20Z"
  },
  {
    "title": "Republican lawmakers hold telephone town halls as protesters demand more",
    "description": "Protesters in western Michigan are calling on GOP Rep. Bill Huizenga to hold an in-person town hall to address their concerns",
    "link": "https://abcnews.go.com/US/wireStory/republican-lawmakers-hold-telephone-town-halls-protesters-demand-119574904",
    "timestamp": "2025-03-08T00:06:26Z"
  },
  {
    "title": "Muslim Nations Endorse Alternative To Trump's Gaza Takeover Plan",
    "description": "The Organisation of Islamic Cooperation on Friday endorsed an Arab League counter-proposal to US President Donald Trump's controversial plan to take over Gaza and displace its residents, two ministers told AFP.\nThe decision by the 57-member grouping came at a…",
    "link": "https://www.ibtimes.com/muslim-nations-endorse-alternative-trumps-gaza-takeover-plan-3765593",
    "timestamp": "2025-03-08T00:06:12Z"
  },
  {
    "title": "'Security not war': How quickly can Europe move on its ambitious new defence plan?",
    "description": "Movement has been swift so far by EU standards but it’s likely any plan will be slow to put into progress.",
    "link": "https://www.thejournal.ie/eu-summit-defence-plan-what-happens-next-6642327-Mar2025/",
    "timestamp": "2025-03-08T00:05:45Z"
  },
  {
    "title": "Disney returns to thematic element it hasn’t used in 30 years",
    "description": "And it's leaving 'some LGBTQ+ TV lovers a little uneasy'",
    "link": "https://www.wnd.com/2025/03/disney-returns-to-thematic-element-it-hasnt-used-in-30-years/",
    "timestamp": "2025-03-08T00:05:05Z"
  },
  {
    "title": "Democrat's No-Nonsense Hand Gesture At Conservative Pundit Has People Fired Up. Here's Why.",
    "description": "Rep. Marilyn Strickland is winning praise online for responding to Scott Jennings with a motion that needed no words — but spoke volumes, according to experts.",
    "link": "https://www.huffpost.com/entry/cnn-scott-jennings-marilyn-strickland_n_67cb0d5ee4b05512c904895e",
    "timestamp": "2025-03-08T00:03:01Z"
  },
  {
    "title": "US Man Executed By Firing Squad For First Time Since 2010",
    "description": "A South Carolina man convicted of murdering his ex-girlfriend&#039;s parents was put to death by firing squad on Friday in the first such execution in the United States in 15 years, prison officials said.",
    "link": "https://www.ndtv.com/world-news/us-man-brad-sigmon-executed-by-firing-squad-for-first-time-since-2010-7874353",
    "timestamp": "2025-03-08T00:02:59Z"
  },
  {
    "title": "Samsung may want to get closer to Trump in the US",
    "description": "Samsung is reportedly about to make a major change to get closer to the Trump administration in the US. More details here.",
    "link": "https://www.androidheadlines.com/2025/03/samsung-replacing-us-public-affairs-head-trump.html",
    "timestamp": "2025-03-08T00:01:02Z"
  },
  {
    "title": "Trump’s Crypto Reserve Is Really Happening",
    "description": "Now what?",
    "link": "https://www.theatlantic.com/technology/archive/2025/03/trump-crypto-reserve-executive-order/681977/",
    "timestamp": "2025-03-08T00:00:00Z"
  },
  {
    "title": "Panama Maritime Authority to Review CK Hutchison-BlackRock Port Deal",
    "description": "The Panama Maritime Authority, which oversees shipping and port infrastructure in the country, will request all legal and financial documents from a key transaction between CK Hutchison and a consortium backed by BlackRock, minister to presidency Juan Carlos …",
    "link": "https://gcaptain.com/panama-maritime-authority-to-review-ck-hutchison-blackrock-port-deal/",
    "timestamp": "2025-03-07T23:55:35Z"
  },
  {
    "title": "Greenland and Afghanistan: Frontiers in race for critical minerals",
    "description": "Just as discoveries of fossil fuel reserves helped to shape the 20th century, the race for critical minerals is shaping the 21st. These minerals are seen as strategically crucial for modern economies, including those used in construction, energy and manufactu…",
    "link": "https://www.voanews.com/a/greenland-and-afghanistan-frontiers-in-race-for-critical-minerals/8003142.html",
    "timestamp": "2025-03-07T23:50:41Z"
  },
  {
    "title": "Is DOGE Losing Steam? (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nIs DOGE Losing Steam?  —  The Department of Government Efficiency lives.  But Donald Trump is reining in Elon Musk.  —  President Donald Trump's shift on the Department of Government Efficiency began with a warning from an unli…",
    "link": "https://www.memeorandum.com/250307/p126",
    "timestamp": "2025-03-07T23:50:01Z"
  },
  {
    "title": "Trump Says He’ll ‘Probably’ Extend TikTok’s Sale Deadline—Halting Next Month’s Ban",
    "description": "President Donald Trump said he would “probably” extend his April 5 deadline for TikTok to be sold or banned, raising the possibility a deal might not be made after expressing optimism last month that TikTok’s China-based parent company, ByteDance, would reach…",
    "link": "https://freerepublic.com/focus/f-news/4302851/posts",
    "timestamp": "2025-03-07T23:49:19Z"
  },
  {
    "title": "Panama says it will release 112 migrants deported from the U.S. and held in a remote camp",
    "description": "Panama announced Friday that it will allow 112 migrants deported from the United States who have been held in a remote camp in the Darien region since last month to move about the country freely until they decide on their next course of action.",
    "link": "https://www.pbs.org/newshour/world/panama-says-it-will-release-112-migrants-deported-from-the-u-s-and-held-in-a-remote-camp",
    "timestamp": "2025-03-07T23:49:15Z"
  },
  {
    "title": "Dems trumpet value of Education Dept. – without any evidence",
    "description": "Critics say agency serves as a tool to promote leftist 'woke' agenda and should be closed",
    "link": "https://www.wnd.com/2025/03/dems-trumpet-value-of-education-dept-without-any-evidence/",
    "timestamp": "2025-03-07T23:49:02Z"
  },
  {
    "title": "This Week: Border Security, Base Renaming, Good Get for West Point, All Indicators of Thriving DOD",
    "description": "During a weekly update video, Chief Pentagon Spokesman Sean Parnell discussed this week's visit by the defense secretary to the U.S. southern border, base renaming and a standout recruit en route to the United States Military Academy at West Point.",
    "link": "https://www.defense.gov/News/News-Stories/Article/Article/4113361/this-week-border-security-base-renaming-good-get-for-west-point-all-indicators/",
    "timestamp": "2025-03-07T23:49:02Z"
  },
  {
    "title": "This isn’t the economy Trump promised",
    "description": "For a “golden age” of America, that’s a lot of red. | Michael M. Santiago/Getty Images\nWelcome to The Logoff. Today I’m focusing on Donald Trump’s effect on the economy, because we’re seeing some early indications of how the president’s policies are affecting…",
    "link": "https://biztoc.com/x/05f460ccb087cac3",
    "timestamp": "2025-03-07T23:46:29Z"
  },
  {
    "title": "South Carolina man faces federal charges for allegedly threatening to assassinate Trump",
    "description": "A South Carolina man, identified as Travis Keith Lang, was federally indicted this week for allegedly threatening to kill President Donald Trump.",
    "link": "https://www.foxnews.com/politics/south-carolina-man-faces-federal-charges-threatening-assassinate-trump",
    "timestamp": "2025-03-07T23:45:57Z"
  },
  {
    "title": "Jim Jordan subpoena pushes YouTube to restore ‘free speech’ like Meta",
    "description": "Meta may have caved on their content moderation policies for the sake of “free speech”, but there’s a world of other Big Tech companies out there – and more social media platforms for conservatives to de-censor. On Thursday, Rep. Jim Jordan subpoenaed Alphabe…",
    "link": "https://www.theverge.com/news/626320/jim-jordan-alphabet-youtube-subpoena-censorship",
    "timestamp": "2025-03-07T23:45:55Z"
  },
  {
    "title": "Islamic Bloc Adopts Arab Nations' Counter To Trump's Gaza Takeover Plan",
    "description": "The Organisation of Islamic Cooperation on Friday adopted the Arab League&#039;s counter-proposal to US President Donald Trump&#039;s plan to take over Gaza and displace its residents, two ministers told AFP.",
    "link": "https://www.ndtv.com/world-news/islamic-bloc-oic-adopts-arab-nations-counter-to-trumps-gaza-takeover-plan-7874293",
    "timestamp": "2025-03-07T23:45:22Z"
  },
  {
    "title": "European rearmament should avoid US firms: Airbus",
    "description": "Frankfurt, Germany (AFP) Mar 7, 2025\n\n\n European governments should make sure increases in defence spending go to European firms and avoid dependence on US companies, the head of Airbus's defence division said in an interview published Friday. \n\n\"If we spend …",
    "link": "https://www.spacewar.com/reports/European_rearmament_should_avoid_US_firms_Airbus_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "US halts commercial satellite imagery access for Kyiv",
    "description": "Washington (AFP) Mar 7, 2025\n\n Washington has \"temporarily suspended\" Ukraine's access to US government-purchased commercial satellite imagery, a National Geospatial-Intelligence Agency spokesperson said on Friday. \n\nMaxar, one of the companies contracted by …",
    "link": "https://www.spacewar.com/reports/US_halts_commercial_satellite_imagery_access_for_Kyiv_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "Trump invites Iran leader to nuclear talks -- or else",
    "description": "Washington (AFP) Mar 7, 2025\n\n\n US President Donald Trump said Friday that he has written to Iran's supreme leader pressing for new talks on its nuclear program, warning of possible military action if not. \n\nIran's foreign minister told AFP on Friday that his…",
    "link": "https://www.spacewar.com/reports/Trump_invites_Iran_leader_to_nuclear_talks_or_else_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "No talks with US under 'maximum pressure' policy, Iran FM tells AFP",
    "description": "Jeddah, Saudi Arabia (AFP) Mar 7, 2025\n\n\n Iran will not resume negotiations with the United States on its nuclear programme while President Donald Trump applies his \"maximum pressure\" policy, Foreign Minister Abbas Araghchi told AFP on Friday. \n\nIran will mai…",
    "link": "https://www.spacewar.com/reports/No_talks_with_US_under_maximum_pressure_policy_Iran_FM_tells_AFP_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "UK agrees to supply advanced drones to Ukraine",
    "description": "London (AFP) Mar 6, 2025\n\n Ukraine's armed forces will receive more advanced attack drones for its fight against Russia after the UK and an Anglo-US manufacturer sealed a GBP30 million ($38.7 million) deal, London said Thursday. \n\nThe deal with Anduril was ag…",
    "link": "https://www.spacewar.com/reports/UK_agrees_30_mn_deal_to_supply_advanced_drones_to_Ukraine_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "From critic to investor: Trump welcomes crypto leaders to White House",
    "description": "Washington (AFP) Mar 7, 2025\n\n\n Donald Trump on Friday doubled down on his embrace of cryptocurrencies as he hosted top industry players at the White House, while making investments in the field. \n\nUS crypto investors were major supporters of Trump's presiden…",
    "link": "https://www.spacewar.com/reports/From_critic_to_investor_Trump_welcomes_crypto_leaders_to_White_House_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "Trump again casts doubt on his commitment to NATO",
    "description": "Washington (AFP) Mar 6, 2025\n\n\n President Donald Trump on Thursday renewed doubts over his commitment to the NATO alliance, saying countries that are not spending adequately on their militaries do not deserve defense. \n\n\"If they don't pay, I'm not going to de…",
    "link": "https://www.spacewar.com/reports/Trump_again_casts_doubt_on_his_commitment_to_NATO_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "Zelensky again urges air truce after 'massive' Russian attack",
    "description": "Kyiv, Ukraine (AFP) Mar 7, 2025\n\n\n Russia launched a \"massive\" drone and missile attack on Ukrainian energy facilities Friday, as President Volodymyr Zelensky renewed calls for a mutual halt to aerial attacks on critical infrastructure. \n\nThe call from Zelens…",
    "link": "https://www.spacewar.com/reports/Zelensky_again_urges_air_truce_after_massive_Russian_attack_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "Poland expands military training to all men; mulls mines treaty exit; Lithuania quits cluster bomb treaty",
    "description": "Washington DC (UPI) Mar 7, 2025 \n\n Citing \"geopolitical uncertainty,\" Polish Prime Minister Donald Tusk confirmed on Friday the country is aiming to have all men undergo some manner of military training. \n \"By the end of the year, we want to have a model read…",
    "link": "https://www.spacewar.com/reports/Poland_to_have_all_men_undergo_military_training_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "French defence minister to host key European counterparts on Ukraine",
    "description": "Paris (AFP) Mar 7, 2025\n\n France's defence minister is to hold talks next week with counterparts from Britain, Germany, Italy and Poland to discuss support for Ukraine, an aide said on Friday. \n\nThe ministers from Europe's five main military powers will meet …",
    "link": "https://www.spacewar.com/reports/French_defence_minister_to_host_key_European_counterparts_on_Ukraine_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "Russia calls French nuclear comments a 'threat'; EU shifts on defence, 'Macron was right'",
    "description": "Moscow (AFP) Mar 6, 2025\n\n Russia views comments by President Emmanuel Macron about extending France's nuclear deterrent to other European countries as a \"threat\", Foreign Minister Sergei Lavrov said on Thursday. \n\nLavrov also reaffirmed his country's opposit…",
    "link": "https://www.spacewar.com/reports/Russia_calls_French_nuclear_comments_a_threat_999.html",
    "timestamp": "2025-03-07T23:44:24Z"
  },
  {
    "title": "US reviewing visa programs as official says Afghanistan could be included in Trump travel ban | CNN Politics",
    "description": "The US State Department is “undertaking a full review of all visa programs,” a department spokesperson confirmed amid reports of an impending new travel ban, and a US official familiar with the situation told CNN that Afghanistan could be among the countries …",
    "link": "https://www.cnn.com/2025/03/07/politics/state-department-reviewing-visas-travel-ban-afghanistan/index.html",
    "timestamp": "2025-03-07T23:44:01Z"
  },
  {
    "title": "Rubio takes flak for Trump admin's Russia stance, a sharp contrast from his hawkish history",
    "description": "The Trump administration has made overtures to a country that Rubio has railed against during most of his career, especially in relation to Russia's backing of countries like Cuba.",
    "link": "https://www.nbcnews.com/news/latino/rubio-takes-flak-trump-russia-stance-rcna194798",
    "timestamp": "2025-03-07T23:42:51Z"
  },
  {
    "title": "As top podcasters host rank antisemites, Jews need to stand up to the bullies across the spectrum",
    "description": "The only way out of this cycle of degradation is being strong.",
    "link": "https://nypost.com/2025/03/07/opinion/as-top-podcasters-host-antisemites-jews-need-to-stand-up-to-bullies-across-the-spectrum/",
    "timestamp": "2025-03-07T23:42:23Z"
  },
  {
    "title": "Trump sends letter to Iran, pressing for restart of nuclear talks",
    "description": "WHITE HOUSE — U.S. President Donald Trump on Friday appeared to signal that he is ready to take military action on Iran, unless the country agrees to a new deal that would restrain its rapidly advancing nuclear program.\n\n\n“There'll be some interesting days ah…",
    "link": "https://www.voanews.com/a/trump-sends-letter-to-iran-pressing-for-restart-of-nuclear-talks/8003152.html",
    "timestamp": "2025-03-07T23:42:12Z"
  },
  {
    "title": "Trump Administration Set to Detain Illegal Migrant Families with Children",
    "description": "Donald Trump's administration is reviving the policy of detaining illegal migrant families with children that was paused during the Biden era.\nThe post Trump Administration Set to Detain Illegal Migrant Families with Children appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/03/07/trump-administration-set-to-detain-illegal-migrant-families-with-children/",
    "timestamp": "2025-03-07T23:41:20Z"
  },
  {
    "title": "Why Isn’t China Playing Trump’s Game?",
    "description": "Beijing has opted for defiance instead of flattery. Will the strategy backfire?",
    "link": "http://foreignpolicy.com/2025/03/07/china-trump-tariffs-trade-war-beijing-xi-jinping/",
    "timestamp": "2025-03-07T23:41:07Z"
  },
  {
    "title": "USDA eliminates two food safety advisory committees",
    "description": "The USDA eliminated the National Advisory Committee on Microbiological Criteria for Foods and the National Advisory Committee on Meat and Poultry Inspection.",
    "link": "https://www.cnbc.com/2025/03/07/usda-eliminates-two-food-safety-advisory-committees.html",
    "timestamp": "2025-03-07T23:40:33Z"
  },
  {
    "title": "Canada is under existential stress that will make or break us",
    "description": "The possibility that this could be much more than a trade war — the prospect that what U.S. President Donald Trump actually wants is to expand his territory with a takeover of Canada — is ramping up stress to a new level.",
    "link": "https://www.nationalobserver.com/2025/03/07/opinion/canada-unity-tariffs-trade-stress-test",
    "timestamp": "2025-03-07T23:38:20Z"
  },
  {
    "title": "China Swoops In to Court Africa After Trump’s Lesotho Joke",
    "description": "Chinese Foreign Minister Wang Yi told reporters in Beijing on Friday that his government will step up investment, financial assistance, and diplomatic outreach to Africa, seemingly seeking to exploit an opening created by reduced foreign aid under President D…",
    "link": "https://www.breitbart.com/africa/2025/03/07/china-swoops-in-to-court-africa-after-trumps-lesotho-joke/",
    "timestamp": "2025-03-07T23:37:55Z"
  },
  {
    "title": "'Uncertainty among Republicans': Analyst says GOP losing confidence in tariffs",
    "description": "Republican lawmakers are growing increasingly shaky on support for President Donald Trump's tariffs as the economic bill comes due, CNN Washington Bureau Chief David Chalian told anchor Jake Tapper on Friday afternoon.Trump himself appears to be aware of his,…",
    "link": "https://www.rawstory.com/gop-tariffs/",
    "timestamp": "2025-03-07T23:37:54Z"
  },
  {
    "title": "Kamala Harris Lines Up Another Run for Office, Vows She Is 'Staying in This Fight': Report",
    "description": "Despite her loss in the 2024 presidential election, now-former Vice President Kamala Harris believes she has a promising political future.",
    "link": "https://www.westernjournal.com/kamala-harris-lines-another-run-office-vows-staying-fight-report/",
    "timestamp": "2025-03-07T23:37:02Z"
  },
  {
    "title": "This isn’t the economy Trump promised",
    "description": "Welcome to The Logoff. Today I’m focusing on Donald Trump’s effect on the economy, because we’re seeing some early indications of how the president’s policies are affecting the rest of us — and because the markets may influence his behavior going forward. Wha…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/403198/trump-economy-markets-jobs",
    "timestamp": "2025-03-07T23:36:04Z"
  },
  {
    "title": "Bitcoin Reserve and Digital Asset Stockpile: What’s the Difference?",
    "description": "President Trump signed an executive order calling for the U.S. to establish two stashes of cryptocurrencies. Here's how they compare.",
    "link": "https://decrypt.co/309138/bitcoin-reserve-digital-asset-stockpile",
    "timestamp": "2025-03-07T23:35:17Z"
  },
  {
    "title": "Matt LeBlanc Explained Why He Hasn't Done Much Since 'Friends'",
    "description": "LeBlanc got candid in recently resurfaced interviews about why his acting career dwindled, and it seems that it was by design.",
    "link": "https://www.huffpost.com/entry/matt-lablanc-of-friends-fame-describes-his-unambitious-life-goal-and-people-are-into-it_n_67cb3d49e4b07efb43a797f7",
    "timestamp": "2025-03-07T23:34:22Z"
  },
  {
    "title": "During Trump’s Rowdy Speech to Congress, the Quiet Moments Said the Most - The New York Times",
    "description": "During Trump’s Rowdy Speech to Congress, the Quiet Moments Said the MostThe New York Times FACT FOCUS: A look at false and misleading claims made by Trump during his address to CongressThe Associated Press Read NPR's annotated fact check of President Trump's …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176646825",
    "timestamp": "2025-03-07T23:32:39Z"
  },
  {
    "title": "Mayor Adams’ corruption charges should be dropped for good, court-appointed lawyer says",
    "description": "A court appointed lawyer argued that the federal case against Mayor Eric Adams shoudl be dropped for good.\n \n\nPaul Clement said the DOJ can't hang the charges over Mayor Adams' head. [ more › ]",
    "link": "https://gothamist.com/news/mayor-adams-federal-corruption-charges-should-be-permanently-dropped-court-appointed-lawyer-says",
    "timestamp": "2025-03-07T23:31:00Z"
  },
  {
    "title": "Trump Organization sues Capital One for closing its bank accounts four years ago (Kara Scannell/CNN)",
    "description": "Kara Scannell / CNN:\nTrump Organization sues Capital One for closing its bank accounts four years ago  —  President Donald Trump's business trust sued Capital One for closing its bank accounts in 2021, claiming the Virginia lender “debanked” them over their p…",
    "link": "https://www.memeorandum.com/250307/p122",
    "timestamp": "2025-03-07T23:30:01Z"
  },
  {
    "title": "US exits fund to compensate loss and damage in poor nations due to climate change",
    "description": "NEW DELHI, March 7: The United States has withdrawn from a global agreement under which developed nations pledged to compensate developing countries for climate change impacts. The African Group of Negotiators (AGN), a coalition of African nations participati…",
    "link": "https://thehillstimes.in/international/us-exits-fund-to-compensate-loss-and-damage-in-poor-nations-due-to-climate-change",
    "timestamp": "2025-03-07T23:30:00Z"
  },
  {
    "title": "Starlink not allowed in South Africa ‘because I’m not black’ – Musk",
    "description": "Elon Musk has claimed that Starlink was being shunned in South Africa because of his race Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613889-starlink-musk-not-black/",
    "timestamp": "2025-03-07T23:28:36Z"
  },
  {
    "title": "Shutdown watch: GOP favors short-term bill as Democrats express opposition",
    "description": "Congress has one week to pass a spending bill that would avert a shutdown, but lawmakers from both parties are not on the same page about how they'll move forward.",
    "link": "https://abcnews.go.com/Politics/government-shutdown-watch-gop-moves-forward-short-term/story?id=119573970",
    "timestamp": "2025-03-07T23:25:12Z"
  },
  {
    "title": "US health agency plans study into vaccines and autism, sources say",
    "description": "US Health Secretary Robert F Kennedy Jr, who has long promoted anti-vaccine views, heads the department tasked with carrying out the research.",
    "link": "https://www.rnz.co.nz/news/world/544148/us-health-agency-plans-study-into-vaccines-and-autism-sources-say",
    "timestamp": "2025-03-07T23:23:05Z"
  },
  {
    "title": "Analyzing claim Trump confused 'transgenic mice' with 'transgender mice' in address to Congress",
    "description": "Some social media users suggested Trump mistakenly said \"transgender\" instead of \"transgenic.\"",
    "link": "https://www.snopes.com//articles/469397/trump-transgenic-vs-transgender-mice/",
    "timestamp": "2025-03-07T23:22:00Z"
  },
  {
    "title": "'Unsettling': Reporter says Canadians fear Trump's trade war — for what he's really after",
    "description": "A Canadian New York Times investigative reporter said that Canadians she's spoken to don't expect the trade war from President Donald Trump to be the end game. Trump has been all over the map with his proposed tariffs against Mexico and Canada. Speaking to MS…",
    "link": "https://www.rawstory.com/trump-canada-2671289187/",
    "timestamp": "2025-03-07T23:20:40Z"
  },
  {
    "title": "Lauren Boebert Accuses Black Lawmaker of Waving ‘Pimp Cane’ at Trump",
    "description": "Rep. Lauren Boebert suggested that the Black lawmaker who yelled at President Donald Trump during a joint address to Congress is a \"pimp.\" \nThe post Lauren Boebert Accuses Black Lawmaker of Waving ‘Pimp Cane’ at Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/lauren-boebert-accuses-black-lawmaker-of-waving-pimp-cane-at-trump/",
    "timestamp": "2025-03-07T23:20:03Z"
  },
  {
    "title": "SET demands reforms amid sell-off",
    "description": "<p>The Stock Exchange of Thailand (SET) has asked the Finance Ministry to issue a royal decree to enhance tax benefits for long-term investments and strengthen the Securities and Exchange Commission's (SEC) law enforcement powers in order to revive investor c…",
    "link": "https://www.bangkokpost.com/business/general/2975436/set-demands-reforms-amid-sell-off",
    "timestamp": "2025-03-07T23:18:00Z"
  },
  {
    "title": "SET demands reforms amid sell-off",
    "description": "<p>The Stock Exchange of Thailand (SET) has asked the Finance Ministry to issue a royal decree to enhance tax benefits for long-term investments and strengthen the Securities and Exchange Commission's (SEC) law enforcement powers in order to revive investor c…",
    "link": "https://www.bangkokpost.com/business/investment/2975436/set-demands-reforms-amid-sell-off",
    "timestamp": "2025-03-07T23:18:00Z"
  },
  {
    "title": "Here’s How Much the Guests at Trump’s Crypto Summit Donated to His Inauguration",
    "description": "The list of invitees at the White House crypto summit illustrates the tight link between Trump and new cohort of political donors.\nThe post Here’s How Much the Guests at Trump’s Crypto Summit Donated to His Inauguration appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/07/white-house-crypto-summit-trump-donors/",
    "timestamp": "2025-03-07T23:16:17Z"
  },
  {
    "title": "Samsung under spotlight as Trump questions South Korea's tariff policies",
    "description": "In his recent speech to Congress, US president Donald Trump claimed that South Korea's average tariff rate is four times that of the US, raising concerns that the Asian ally, with Samsung Electronics in particular, may become the next target of Trump's trade …",
    "link": "https://www.digitimes.com/news/a20250306PD238/samsung-tariff.html",
    "timestamp": "2025-03-07T23:16:10Z"
  },
  {
    "title": "Ms. Global: On International Women’s Day, What’s the Status of Women Worldwide?",
    "description": "International Women’s Day 2025 finds progress under threat. The global landscape for women’s rights is at a paradox: gains and rollbacks, resilience and repression, victories tempered by the suffocating weight of political inertia. Here's where the fight stan…",
    "link": "https://msmagazine.com/2025/03/07/ms-global-on-international-womens-day-whats-the-status-of-women-worldwide/",
    "timestamp": "2025-03-07T23:15:13Z"
  },
  {
    "title": "How A Tiny Federal Agency’s Lawsuit Could Provide The Smoking Gun Against DOGE",
    "description": "The U.S. African Development Foundation’s standoff with DOGE contradicts the Trump administration’s defenses of Elon Musk’s operation.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-african-development-foundation_n_67cb6408e4b056d451323cc3",
    "timestamp": "2025-03-07T23:15:09Z"
  },
  {
    "title": "Trump's rare minerals play rattles South Korea's semiconductor supply chain",
    "description": "US President Donald Trump has reportedly demanded a cut of Ukraine's mineral and natural resource revenues in exchange for military and economic aid, a proposal dubbed the \"US-Ukraine minerals deal.\" South Korea's tech industry is on edge, fearing potential d…",
    "link": "https://www.digitimes.com/news/a20250306PD220/supply-chain-ukraine-donald-trump-posco-military.html",
    "timestamp": "2025-03-07T23:14:13Z"
  },
  {
    "title": "Trump Organization sues Capital One bank over account closures after Jan. 6 Capitol riot",
    "description": "The Trump Organization sued Capital One in Florida on Friday for allegedly “unjustifiably” closing more than 300 of the company’s bank accounts on the heels of the Jan.",
    "link": "https://www.nbcnews.com/business/business-news/trump-organization-sues-capital-one-bank-account-closures-jan-6-capito-rcna195313",
    "timestamp": "2025-03-07T23:13:39Z"
  },
  {
    "title": "'Disgusting' Donald Trump speech moment as he spits on himself amid health fears - NewsBreak",
    "description": "A viral moment from Donald Trump's controversial Congress speech on Tuesday night left viewers \"disgusted\", as the US President appeared to spit on himself",
    "link": "https://www.newsbreak.com/share/3844918155182-disgusting-donald-trump-speech-moment-as-he-spits-on-himself-amid-health-fears?s=a2&amp;share_destination_id=MTU3Mzc3OTg2LTE3NDEzODkxNTYzODQ%3D&amp;pd=0AeLCcLK&amp;hl=en_US&amp;send_time=1741389156&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2%2Cns_local_strategy_25q1_exp-v5",
    "timestamp": "2025-03-07T23:13:35Z"
  },
  {
    "title": "HHS said to have asked CDC to study vaccines and autism, despite robust evidence showing no link | CNN",
    "description": "The US Department of Health and Human Services asked the US Centers for Disease Control and Prevention to study vaccines and autism, a person familiar with the situation told CNN, despite strong evidence that vaccines do not cause autism.",
    "link": "https://www.cnn.com/2025/03/07/health/hhs-cdc-vaccines-autism/index.html",
    "timestamp": "2025-03-07T23:13:22Z"
  },
  {
    "title": "Texas governor requiring state employees return to office full-time: 'Present and engaged'",
    "description": "Texas Gov. Greg Abbott will require state employees to return to the office full-time and in person, five days a week. The move comes after President Donald Trump issued a similar mandate at the federal level.",
    "link": "https://www.foxnews.com/us/texas-governor-requiring-state-employees-return-office-full-time-present-engaged",
    "timestamp": "2025-03-07T23:12:22Z"
  }
]