[
  {
    "title": "What to know about leucovorin, unproven autism drug touted by Trump",
    "description": "When President Donald Trump’s administration announced it would repurpose an old, generic drug as a new treatment for autism, it came as a surprise to many experts — including the physician who suggested the idea to the nation’s top health officials.",
    "link": "https://www.pbs.org/newshour/health/what-to-know-about-leucovorin-unproven-autism-drug-touted-by-trump",
    "timestamp": "2025-09-24T20:13:01Z"
  },
  {
    "title": "EU’s Kallas Urges Hungary to Stop Buying Russian Energy",
    "description": "The European Union’s top diplomat urged Hungary and other bloc members that still buy Russian energy to end their purchases, even as the Hungarian foreign minister said his country had no plans to do so.",
    "link": "https://financialpost.com/pmn/business-pmn/eus-kallas-urges-hungary-to-stop-buying-russian-energy",
    "timestamp": "2025-09-24T20:11:33Z"
  },
  {
    "title": "Pregnant Influencers Seemingly Try To Own Trump With Tylenol",
    "description": "President Donald Trump said Monday that his top health officials recommended that pregnant women avoid taking Tylenol.",
    "link": "https://dailycaller.com/2025/09/24/pregnant-influencers-women-trump-rfk-autism-tylenol/",
    "timestamp": "2025-09-24T20:11:10Z"
  },
  {
    "title": "From rhetoric to bloodshed: Texas ICE attack caps escalating left-wing terror wave",
    "description": "A shooting at an ICE facility in Dallas killed two people and wounded another, marking the latest in a surge of left-wing political violence targeting law enforcement officers.",
    "link": "https://www.foxnews.com/politics/from-rhetoric-bloodshed-texas-ice-attack-caps-escalating-left-wing-terror-wave",
    "timestamp": "2025-09-24T20:10:48Z"
  },
  {
    "title": "Vance Says Trump FCC Commissioner’s Threat Over Jimmy Kimmel Was a ‘Joke’",
    "description": "JD Vance told a reporter during a Q&A session in North Carolina on Wednesday that the FCC commissioner was \"making a joke\" when threatening ABC over Kimmel\nThe post Vance Says Trump FCC Commissioner’s Threat Over Jimmy Kimmel Was a ‘Joke’ first appeared on Me…",
    "link": "https://www.mediaite.com/politics/vance-says-trump-fcc-commissioners-threat-over-jimmy-kimmel-was-a-joke/",
    "timestamp": "2025-09-24T20:10:35Z"
  },
  {
    "title": "Fact Check: Kamala Harris Claims 2024 Race Was 'Closest' of the 21st Century",
    "description": "Former Vice President Kamala Harris has repeated a blatant lie about her 2024 election performance while on her book promotion media tour, falsely claiming that the results were the \"closest\" of the twenty-first century.\nThe post Fact Check: Kamala Harris Cla…",
    "link": "https://www.breitbart.com/politics/2025/09/24/fact-check-kamala-harris-claims-2024-race-was-closest-of-the-21st-century/",
    "timestamp": "2025-09-24T20:07:51Z"
  },
  {
    "title": "Luigi Mangione’s Lawyers Scorch Trump Admin For ‘Baselessly Linking Him’ To Extremists",
    "description": "Mangione's lawyers slammed the Trump administration's \"greater political narrative that has no place in any criminal case.\"",
    "link": "https://www.huffpost.com/entry/luigi-mangione-trump-left-wing-extremist-accusation_n_68d42ca4e4b0bba54aa9eb47",
    "timestamp": "2025-09-24T20:06:31Z"
  },
  {
    "title": "Russia vows to press offensive, rejects idea Ukraine can retake land",
    "description": "Donald Trump made the remarks after meeting Volodymyr Zelensky at the United Nations.",
    "link": "https://www.nzherald.co.nz/world/russia-vows-to-press-offensive-rejects-idea-ukraine-can-retake-land/6SALFSO7ZNHADI3XY7ALYNY4AU/",
    "timestamp": "2025-09-24T20:06:09Z"
  },
  {
    "title": "Arizona Special Election Winner May Tip Balance Toward Release of Epstein Files",
    "description": "Democrat Adelita Grijalva defeated her Republican opponent by nearly 40 points.",
    "link": "https://truthout.org/articles/arizona-special-election-winner-may-tip-balance-toward-release-of-epstein-files/",
    "timestamp": "2025-09-24T20:04:31Z"
  },
  {
    "title": "China and US running tight race for influence in South-East Asia",
    "description": "New research shows that China retains a very narrow edge over the United States as South-East Asia's most influential partner, with experts predicting it will soon pull further ahead as the Trump administration's policies begin to bite.",
    "link": "https://www.abc.net.au/news/2025-09-25/china-us-influence-south-east-asia/105812866",
    "timestamp": "2025-09-24T20:03:48Z"
  },
  {
    "title": "Jessica Chastain Against Apple Delaying 'The Savant' Release",
    "description": "\"The Savant,\" which stars Chastain as an undercover investigator tracking domestic terrorists, was indefinitely postponed Tuesday.",
    "link": "https://www.huffpost.com/entry/jessica-chastain-the-savant-statement-not-aligned-delay_n_68d417f6e4b0ca9d88169a92",
    "timestamp": "2025-09-24T20:01:58Z"
  },
  {
    "title": "Kimmel Returns, and Washington Has Some Thoughts",
    "description": "Comedian Jimmy Kimmel returned to his late-night show on Tuesday after conversing with Disney executives, and Washington was watching. “I can’t believe ABC Fake News... Read More\nThe post Kimmel Returns, and Washington Has Some Thoughts appeared first on The …",
    "link": "https://www.dailysignal.com/2025/09/24/kimmel-returns-and-washington-has-some-thoughts/",
    "timestamp": "2025-09-24T20:01:54Z"
  },
  {
    "title": "Trump hangs portrait of autopen in Biden's place on White House Presidential Wall of Fame",
    "description": "Trump has ordered an investigation into Biden’s use of an autopen throughout his presidential term.",
    "link": "https://www.thejournal.ie/trump-biden-autopen-6826079-Sep2025/",
    "timestamp": "2025-09-24T20:01:41Z"
  },
  {
    "title": "Chris Hayes: Trump caps off ‘disturbing and dangerous’ 48 hours with ‘off the rails’ speech",
    "description": "Chris Hayes rips Trump over his “disturbing and dangerous” remarks about Tylenol, vaccines, and autism, and his \"off the rails\" United Nations speech.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-disturbing-dangerous-united-nations-tylenol-autism-rcna233517",
    "timestamp": "2025-09-24T20:00:49Z"
  },
  {
    "title": "3 Thoughts From an Autism Researcher on Trump’s Acetaminophen and Vaccine Claims",
    "description": "President Trump and his administration claim there could be a link between autism and acetaminophen and vaccines. We asked a researcher who has studied autism for decades for her thoughts.",
    "link": "https://www.kqed.org/news/12057387/3-thoughts-from-an-autism-researcher-on-trumps-acetaminophen-and-vaccine-claims",
    "timestamp": "2025-09-24T20:00:41Z"
  },
  {
    "title": "‘You were never running ‘ – Conor McGregor’s bid to become President dismissed as ‘not real’ by UFC legend",
    "description": "Conor McGregor’s failed bid to become President of Ireland has been called into question by UFC legend Chael Sonnen.",
    "link": "https://www.independent.ie/sport/other-sports/you-were-never-running-conor-mcgregors-bid-to-become-president-dismissed-as-not-real-by-ufc-legend/a570546746.html",
    "timestamp": "2025-09-24T20:00:26Z"
  },
  {
    "title": "Polymarket Is Taking Bets on ‘South Park’s Polymarket Episode",
    "description": "Oh my God, they bet a bunch of crypto on Kenny",
    "link": "https://www.cracked.com/article_48495_polymarket-is-taking-bets-on-south-parks-polymarket-episode.html",
    "timestamp": "2025-09-24T20:00:00Z"
  },
  {
    "title": "India Says It Wants to Buy More USA Energy",
    "description": "India wants to increase purchase of oil and gas from the U.S., Commerce Minister Piyush Goyal said.",
    "link": "https://www.rigzone.com/news/wire/india_says_it_wants_to_buy_more_usa_energy-24-sep-2025-181896-article/",
    "timestamp": "2025-09-24T20:00:00Z"
  },
  {
    "title": "Sherri Shepherd Makes Light of Jimmy Kimmel’s ‘Unexpected Vacation’ on ABC: ‘You’re So Beloved’ | Video",
    "description": "\"Because Jimmy, we knew you were coming back,\" the talk show host adds\nThe post Sherri Shepherd Makes Light of Jimmy Kimmel’s ‘Unexpected Vacation’ on ABC: ‘You’re So Beloved’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/sherri-shepherd-jimmy-kimmel-abc-return-unexpected-vacation/",
    "timestamp": "2025-09-24T19:59:51Z"
  },
  {
    "title": "France says UN recognition of Palestinian state is a blow to Hamas not a gift",
    "description": "French official Pascal Confavereux defends U.N. Palestinian statehood initiative against Trump's criticism that it rewards Hamas for Oct. 7 attacks.",
    "link": "https://www.foxnews.com/world/france-defends-palestinian-recognition-un-says-move-defeats-hamas-not-rewards",
    "timestamp": "2025-09-24T19:59:43Z"
  },
  {
    "title": "Democrats seize on Tom Homan bribery probe, seek access to FBI recording",
    "description": "Democrats have initiated “a robust oversight inquiry” into the Tom Homan bribery controversy, but will the Trump administration chose silence over transparency?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/democrats-seize-tom-homan-bribery-probe-seek-access-fbi-recording-rcna233528",
    "timestamp": "2025-09-24T19:58:19Z"
  },
  {
    "title": "Trump administration fast-tracks leucovorin for autism despite limited research",
    "description": "A Trump administration decision to repurpose an old chemotherapy drug for autism has surprised many experts — including the physician who recently proposed the idea.",
    "link": "https://www.wesh.com/article/trump-fda-leucovorin-autism-treatment/68037824",
    "timestamp": "2025-09-24T19:56:26Z"
  },
  {
    "title": "Donald Trump Requests Stake In Canadian Lithium Mining Company",
    "description": "Shares of Lithium America rallied more than 97% on Wednesday, after the Trump administration said it would seek a stake in the ...",
    "link": "https://biztoc.com/x/ee362fdf5797de53",
    "timestamp": "2025-09-24T19:55:35Z"
  },
  {
    "title": "Oil Surges Past Key Level",
    "description": "Oil hit its highest since July as Trump's comments on Russia rattled markets.",
    "link": "https://www.rigzone.com/news/wire/oil_surges_past_key_level-24-sep-2025-181898-article/",
    "timestamp": "2025-09-24T19:54:58Z"
  },
  {
    "title": "White House unveils Presidential Walk of Fame with Biden portrait replaced by autopen image",
    "description": "Donald Trump criticized Joe Biden's autopen use after the White House displayed the former president's portrait as an autopen machine in the Presidential Walk of Fame.",
    "link": "https://www.foxnews.com/politics/white-house-unveils-presidential-walk-fame-biden-portrait-replaced-autopen-image",
    "timestamp": "2025-09-24T19:54:57Z"
  },
  {
    "title": "Trump expected to sign a TikTok deal on Thursday",
    "description": "President Donald Trump on Thursday is expected to sign a deal to facilitate the sale of TikTok from a Chinese-based company to a group of American investors, two senior White House officials told NBC News",
    "link": "https://biztoc.com/x/1094743962bcf881",
    "timestamp": "2025-09-24T19:54:41Z"
  },
  {
    "title": "UN traffic in New York is so bad that Emmanuel Macron couldn’t even cross the street while talking to Donald Trump on the phone",
    "description": "French President Emmanuel Macron likes to say that he can get President Donald Trump on the phone any time he wants. In New York for the U.N. General Assembly, he proved it.\nBlocked on Monday night by police officers when he sought to cross a New York street …",
    "link": "https://biztoc.com/x/bee9217a88d5a7e8",
    "timestamp": "2025-09-24T19:54:25Z"
  },
  {
    "title": "The H-1B Visa Fiasco Is Accelerating America’s Decline",
    "description": "Trump’s new $100,000 fee for high-skilled workers is another nail in the coffin for U.S. prosperity.",
    "link": "http://foreignpolicy.com/2025/09/24/trump-immigration-policies-h-1b-visas-fee/",
    "timestamp": "2025-09-24T19:54:05Z"
  },
  {
    "title": "Trump Is Trying to Memory-Hole One of the Most Important Historical Images of Slavery",
    "description": "Virtually every historian of the Civil War knows that slavery was the moving force for secession which led to the Civil War.",
    "link": "https://slate.com/news-and-politics/2025/09/trump-memory-hole-1984-slavery-national-parks.html",
    "timestamp": "2025-09-24T19:54:02Z"
  },
  {
    "title": "Why Argentina is looking to the Trump administration for a bailout − and what the US Treasury can do to help",
    "description": "A sharp sell-off of the peso has seen President Javier Milei seek a financial lifeline from the United States. Washington seems happy to help out.",
    "link": "https://theconversation.com/why-argentina-is-looking-to-the-trump-administration-for-a-bailout-and-what-the-us-treasury-can-do-to-help-265924",
    "timestamp": "2025-09-24T19:50:30Z"
  },
  {
    "title": "Judge scolds Justice Department over public statements in UnitedHealthcare CEO murder case",
    "description": "A New York judge warns Justice Department officials they could face sanctions for public comments about Luigi Mangione's prosecution",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-scolds-justice-department-public-statements-unitedhealthcare-ceo-125900005",
    "timestamp": "2025-09-24T19:50:26Z"
  },
  {
    "title": "Tylenol responds after old tweet about pregnancy resurfaces following Trump's controversial autism claim",
    "description": "Tylenol has responded to a resurfaced tweet attributed to the company, which says pregnant women shouldn't take the drug, after Donald Trump autism claims.",
    "link": "https://www.ladbible.com/news/us-news/tylenol-resurfaced-tweet-pregnant-women-autism-donald-trump-141656-20250924",
    "timestamp": "2025-09-24T19:49:47Z"
  },
  {
    "title": "'Patently Illegal': Experts Raise Major Red Flags About Trump's Drug Boat Bombings",
    "description": "US President Donald Trump has now repeatedly ordered the American military to use deadly force against boats in international waters that are allegedly engaged in drug smuggling, and many experts are raising red flags about both its legality and its effective…",
    "link": "https://www.commondreams.org/news/trump-drug-war",
    "timestamp": "2025-09-24T19:49:16Z"
  },
  {
    "title": "UN traffic in New York is so bad that Emmanuel Macron couldn’t even cross the street while talking to Donald Trump on the phone",
    "description": "\"Guess what? I’m waiting in the street because everything is frozen for you!”",
    "link": "https://fortune.com/2025/09/24/macron-new-york-city-traffic-stopped-united-nations-trump-phone-call/",
    "timestamp": "2025-09-24T19:49:12Z"
  },
  {
    "title": "Dr. Ben Carson, first-term Trump Cabinet member, returns to administration to help in MAHA effort",
    "description": "The USDA said Carson will be advising Trump and Agriculture Secretary Brooke Rollins on policies related to nutrition, rural healthcare quality, and housing accessibility.",
    "link": "https://justthenews.com/politics-policy/health/trump-administration-recruits-ben-carson-maha-position-agriculture",
    "timestamp": "2025-09-24T19:48:08Z"
  },
  {
    "title": "Man Who Called Trump “Hitler” Lectures Us on Calling People Nazis",
    "description": "Vice President JD Vance wants everyone to stop calling people who they disagree with Nazis—but some of us are old enough to remember when he called President Donald Trump “America’s Hitler.”Speaking in Concord, North Carolina, Wednesday, Vance urged people to…",
    "link": "https://newrepublic.com/post/200896/jd-vance-donald-trump-hitler-lectures-calling-people-nazis",
    "timestamp": "2025-09-24T19:46:46Z"
  },
  {
    "title": "Stocks fall as dollar rises, gold falls with Fed rate path in question",
    "description": "NEW YORK/LONDON :MSCI's global equities gauge stayed close to flat on Wednesday while the dollar rose and gold prices dipped, as investors digested cautious comments from Federal Reserve Chair Jerome Powell about when the central bank might next cut U.S. inte…",
    "link": "https://www.channelnewsasia.com/business/stocks-fall-dollar-rises-gold-falls-fed-rate-path-in-question-5365496",
    "timestamp": "2025-09-24T19:46:06Z"
  },
  {
    "title": "Paracetamol use during pregnancy not linked to autism, our study of 2.5 million children shows",
    "description": "Our research provides strong evidence against the concerning claims made recently by US president Donald Trump.",
    "link": "https://theconversation.com/paracetamol-use-during-pregnancy-not-linked-to-autism-our-study-of-2-5-million-children-shows-265919",
    "timestamp": "2025-09-24T19:45:36Z"
  },
  {
    "title": "Trump raised $8 million for Hurricane Helene survivors. Where did it all go? (Katie Myers/Grist)",
    "description": "Katie Myers / Grist:\nTrump raised $8 million for Hurricane Helene survivors.  Where did it all go? … On a dusty, warm day last October, nearly a month after Hurricane Helene tore across the southeastern United States, Donald Trump stood behind a podium in Swa…",
    "link": "https://www.memeorandum.com/250924/p106",
    "timestamp": "2025-09-24T19:45:01Z"
  },
  {
    "title": "Jimmy Kimmel return monologue drives huge online views",
    "description": "The monologue Jimmy Kimmel delivered on his return to late-night television had been seen nearly 19 million times on Google's YouTube and Meta's Instagram by early Wednesday afternoon in the US.",
    "link": "https://www.rte.ie/entertainment/2025/0924/1535178-jimmy-kimmel-return-monologue-drives-huge-online-views/",
    "timestamp": "2025-09-24T19:44:33Z"
  },
  {
    "title": "World leaders at UN shocked by ‘macabre response’ on social media to Charlie Kirk’s death",
    "description": "Serbian President Alexsandar Vucic decried the “sick expression of joy for the crime committed against an innocent person.\"",
    "link": "https://fortune.com/2025/09/24/world-leaders-at-un-shocked-by-macabre-response-on-social-media-to-charlie-kirks-death/",
    "timestamp": "2025-09-24T19:43:53Z"
  },
  {
    "title": "President Trump Reveals Why He Has Once AGAIN Rejected Congressional Democrats’ Demands as They Threaten to Shut Down Govt",
    "description": "President Trump on Wednesday went off on Congressional Democrats as they threaten to shut down the government.\nThe post President Trump Reveals Why He Has Once AGAIN Rejected Congressional Democrats’ Demands as They Threaten to Shut Down Govt appeared first o…",
    "link": "https://www.thegatewaypundit.com/2025/09/president-trump-reveals-why-he-has-once-again/",
    "timestamp": "2025-09-24T19:40:56Z"
  },
  {
    "title": "Trump expected to sign a TikTok deal on Thursday",
    "description": "President Donald Trump on Thursday is expected to sign a deal to facilitate the sale of TikTok from a Chinese-based company to a group of American investors, two senior White House officials told NBC News",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-tiktok-deal-sale-china-rcna233524",
    "timestamp": "2025-09-24T19:40:12Z"
  },
  {
    "title": "The Free Speech Line to Defend: Criticism Isn’t Incitement to Violence",
    "description": "After the killings at an ICE facility in Dallas, Ted Cruz joined new calls against criticizing the people running the country. Ed Kilgore writes that he doesn’t appear to understand why we have a First Amendment.",
    "link": "http://nymag.com/intelligencer/article/ice-dallas-shooting-criticism-isnt-incitement-to-violence.html",
    "timestamp": "2025-09-24T19:39:21Z"
  },
  {
    "title": "Israel Has “Calculated to Destroy” Palestinians, UN Says",
    "description": "A new report from the UN found that Israel has “extensively and systematically demolished civilian infrastructure.”…",
    "link": "https://truthout.org/articles/israel-has-calculated-to-destroy-palestinians-un-says/",
    "timestamp": "2025-09-24T19:38:55Z"
  },
  {
    "title": "Jim Jordan Admits Trump’s Jimmy Kimmel Threat Is Straight-Up Coercion",
    "description": "Donald Trump’s big mouth is starting to bite his allies: Even Ohio Representative Jim Jordan found it difficult to defend the president’s careless remarks regarding his administration’s growing attempts to censor the press.In an interview with CNBC Wednesday,…",
    "link": "https://newrepublic.com/post/200890/jim-jordan-donald-trump-jimmy-kimmel-threat-coercion",
    "timestamp": "2025-09-24T19:36:41Z"
  },
  {
    "title": "Statues of Trump and Jeffrey Epstein holding hands removed from National Mall",
    "description": "U.S. Park Police said they've removed statues that depicted Trump and disgraced financier Jeffrey Epstein holding hands and skipping from the National Mall.",
    "link": "https://www.nbcnews.com/politics/donald-trump/donald-trump-jeffrey-epstein-statues-capitol-national-mall-dc-rcna233492",
    "timestamp": "2025-09-24T19:36:06Z"
  },
  {
    "title": "JD Vance Suggests That FCC Chairman’s Warning To ABC Stations Over Jimmy Kimmel Was Merely “A Joke”",
    "description": "Vice President JD Vance, addressing Jimmy Kimmel’s return to ABC, suggested that FCC Chairman Brendan Carr’s warning to the network’s stations was merely “a joke.” Answering a reporter’s question about the free speech implications that have been raised over t…",
    "link": "http://deadline.com/2025/09/jimmy-kimmel-jd-vance-fcc-joke-1236554834/",
    "timestamp": "2025-09-24T19:35:32Z"
  },
  {
    "title": "JD Vance Suggests That FCC Chairman’s Warning To ABC Stations Over Jimmy Kimmel Was Merely “A Joke”",
    "description": "Vice President JD Vance, addressing Jimmy Kimmel’s return to ABC, suggested that FCC Chairman Brendan Carr’s warning to the network’s stations was merely “a ...",
    "link": "https://deadline.com/2025/09/jimmy-kimmel-jd-vance-fcc-joke-1236554834/",
    "timestamp": "2025-09-24T19:35:32Z"
  },
  {
    "title": "London Mayor Sadiq Khan: Donald Trump 'has a crush on me'. Subby going to agree because the mayor does kinda look like Jeffrey Epstein [Obvious]",
    "description": "London Mayor Sadiq Khan: Donald Trump 'has a crush on me'. Subby going to agree because the mayor does kinda look like Jeffrey Epstein",
    "link": "https://www.fark.com/comments/13822128/London-Mayor-Sadiq-Khan-Donald-Trump-has-a-crush-on-me-Subby-going-to-agree-because-mayor-does-kinda-look-like-Jeffrey-Epstein",
    "timestamp": "2025-09-24T19:33:54Z"
  },
  {
    "title": "Will Trump Sue ABC Over Jimmy Kimmel? Why Claims About ‘Illegal Contributions’ Are False - Forbes",
    "description": "Will Trump Sue ABC Over Jimmy Kimmel? Why Claims About ‘Illegal Contributions’ Are FalseForbes Trump’s new ABC threat proves Jimmy Kimmel right — and his MAGA allies wrongCNN Jimmy Kimmel, in first monologue since show was taken off air, says \"it was never my…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179520708",
    "timestamp": "2025-09-24T19:33:12Z"
  },
  {
    "title": "Brendan Carr Is A Shameless Liar: Now Pretending He Didn’t Break The Law And Censor Comedians Critical Of His Dim, Unpopular Boss",
    "description": "Brendan Carr is fairly typical of a far right wing zealot, in that he has absolutely no compulsion about lying, constantly, about everything. The latest case in point: Brendan Carr is trying to pretend he didn’t abuse FCC power and break the law to try and ce…",
    "link": "https://www.techdirt.com/2025/09/24/brendan-carr-is-a-shameless-liar-now-pretending-he-didnt-break-the-law-and-censor-comedians-critical-of-his-dim-unpopular-boss/",
    "timestamp": "2025-09-24T19:32:21Z"
  },
  {
    "title": "In his first UN speech, Syria’s al-Sharaa urges end to all sanctions",
    "description": "Syria’s first head of state to speak at UNGA in nearly 60 years calls for 'complete lifting of sanctions'.",
    "link": "https://www.aljazeera.com/news/2025/9/24/in-his-first-un-speech-syrias-al-sharaa-urges-end-to-all-sanctions",
    "timestamp": "2025-09-24T19:32:13Z"
  },
  {
    "title": "Minnesota companies brace for hit from Trump’s $100K work visa fees",
    "description": "WASHINGTON — Hiring managers in key Minnesota job sectors, from health care to industrial research, say the state’s already tight labor pool could be further constrained by the new $100,000 fee on new visa applications for highly skilled workers.\nPresident Do…",
    "link": "https://biztoc.com/x/f65e956c21f1b91e",
    "timestamp": "2025-09-24T19:31:58Z"
  },
  {
    "title": "Goodbye petrostates, hello ‘electrostates’: how the clean energy shift is reshaping the world order",
    "description": "The global shift toward renewable energy is challenging old geopolitical power structures. So where does Australia stand?",
    "link": "https://theconversation.com/goodbye-petrostates-hello-electrostates-how-the-clean-energy-shift-is-reshaping-the-world-order-264267",
    "timestamp": "2025-09-24T19:31:47Z"
  },
  {
    "title": "‘You Can Go Straight to Hell!’ Vance Rips Newsom, Dems for Saying ICE Works for ‘Authoritarian’ Trump Government",
    "description": "JD Vance skewered the \"left-wing media\" and Democrats like Gavin Newsom for lying about ICE, saying it led to the fatal shooting at an ICE facility in Texas\nThe post ‘You Can Go Straight to Hell!’ Vance Rips Newsom, Dems for Saying ICE Works for ‘Authoritaria…",
    "link": "https://www.mediaite.com/media/news/you-can-go-straight-to-hell-vance-rips-newsom-dems-for-saying-ice-works-for-authoritarian-trump-government/",
    "timestamp": "2025-09-24T19:31:42Z"
  },
  {
    "title": "D4vd's Streams Double Following Reports of a Dead Body in His Car",
    "description": "In this week's Trending Up, listeners are streaming D4vd twice as much after reports linked him to a dead body found in a car.",
    "link": "http://www.billboard.com/music/chart-beat/d4vd-streams-double-dead-body-trending-up-1236073725/",
    "timestamp": "2025-09-24T19:31:30Z"
  },
  {
    "title": "Luigi Mangione Lawyers Slam Trump’s Charlie Kirk Comparisons",
    "description": "Reading Time: 3 minutesLuigi Mangione's lawyers are locking horns with the Trump administration.\nLuigi Mangione Lawyers Slam Trump’s Charlie Kirk Comparisons was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/luigi-mangione-lawyers-slam-trumps-charlie-kirk-comparisons/",
    "timestamp": "2025-09-24T19:31:13Z"
  },
  {
    "title": "Martin believes Trump has accepted Putin is ‘not serious’ about ending Ukraine invasion",
    "description": "Meeting with Canadian PM ‘copper fasten what is a very strong relationship’, says Taoiseach",
    "link": "https://www.irishtimes.com/politics/2025/09/24/martin-believes-trump-has-accepted-putin-is-not-serious-about-ending-ukraine-invasion/",
    "timestamp": "2025-09-24T19:30:37Z"
  },
  {
    "title": "Luigi Mangione's lawyers cry foul over portrayal of him as 'left-wing' and Antifa",
    "description": "Defense attorneys for Luigi Mangione claim government officials are undermining his right to a fair trial with public statements linking him to left-wing activists.",
    "link": "https://www.foxnews.com/us/luigi-mangione-lawyers-cry-foul-over-portrayal-him-left-wing-antifa",
    "timestamp": "2025-09-24T19:30:07Z"
  },
  {
    "title": "In UN debut, new Syria leader warns on Israel but backs dialogue",
    "description": "Syria’s new leader warned Wednesday that Israel’s persistent attacks put the region at risk, but he backed diplomacy as he won support on his UN debut. Ahmed al-Sharaa is the first Syrian president to address the annual UN General Assembly in decades, marking…",
    "link": "https://www.digitaljournal.com/world/in-un-debut-new-syria-leader-warns-on-israel-but-backs-dialogue/article",
    "timestamp": "2025-09-24T19:28:20Z"
  },
  {
    "title": "Palestinian state recognition result of Oct. 7 attacks, says senior Hamas official",
    "description": "The Hamas official also revealed in the interview that he met with Hezbollah officials, where among the topics discussed was the \"centrality of Palestine. \" ...",
    "link": "https://www.jpost.com/middle-east/article-868468",
    "timestamp": "2025-09-24T19:27:59Z"
  },
  {
    "title": "In UN Debut, New Syria Leader Warns On Israel But Backs Dialogue",
    "description": "Syria's new leader warned Wednesday that Israel's persistent attacks put the region at risk, but he backed diplomacy as he won support on his UN debut.",
    "link": "https://www.ibtimes.com/un-debut-new-syria-leader-warns-israel-backs-dialogue-3784367",
    "timestamp": "2025-09-24T19:27:21Z"
  },
  {
    "title": "Today's X-Men #22 Heads Into Its Age Of Revelation (XSpoilers)",
    "description": "Today's X-Men #22 is heading into the prophesied future of the Age of Revelation. The zero issue, which was dropped on comic book retailers by surprise, told us of the moment that Doug Ramsey would come to Alaska to join the X-Men, welcomed by Cyclops. Now kn…",
    "link": "https://bleedingcool.com/comics/todays-x-men-22-heads-into-its-age-of-revelation-xspoilers/",
    "timestamp": "2025-09-24T19:27:05Z"
  },
  {
    "title": "Ukraine’s Plan to Starve the Russian War Machine",
    "description": "Negotiations have stalled. Trump keeps changing his policies. Ukrainians, backed by Europeans, are taking matters into their own hands. ​​​​​",
    "link": "https://www.theatlantic.com/ideas/archive/2025/09/ukraines-strategy-to-win-the-war/684356/",
    "timestamp": "2025-09-24T19:25:32Z"
  },
  {
    "title": "Exclusive-Trump poised to add Japan stop to upcoming Asia trip",
    "description": "WASHINGTON/TOKYO (Reuters) -U.S. and Japanese officials are making arrangements for a trip by President Donald Trump to Japan next month, according to two government officials and another person briefed on the matter. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/25/exclusive-trump-poised-to-add-japan-stop-to-upcoming-asia-trip",
    "timestamp": "2025-09-24T19:25:00Z"
  },
  {
    "title": "Kraken, Crypto.com execs to attend SEC-CFTC ‘harmonization’ event",
    "description": "Representatives from crypto exchange Kraken and Crypto.com, as well as prediction markets Kalshi and Polymarket, will speak on panels at a SEC-CFTC roundtable on Sept. 29.",
    "link": "https://cointelegraph.com/news/crypto-execs-sec-cftc-regulation-roundtable",
    "timestamp": "2025-09-24T19:24:39Z"
  },
  {
    "title": "‘Go Straight To Hell’: JD Vance Condemns Democrats For Villainizing ICE Agents After Facility Shooting",
    "description": "Vice President J.D. Vance shamed Democrats on Wednesday for villainizing ICE agents in the aftermath of the shooting at an ICE facility in Dallas, Texas.",
    "link": "https://dailycaller.com/2025/09/24/jd-vance-democrats-ice-facility-shooting/",
    "timestamp": "2025-09-24T19:24:13Z"
  },
  {
    "title": "FIFA and CONMEBOL summit in New York on 2030 World Cup: 64 teams and more matches in South America",
    "description": "FIFA is considering a radical expansion of the 2030 World Cup to 64 teams, doubling the matches to 128 in Spain, Portugal, Morocco, and South America.\n In a surprising development, FIFA president Gianni Infantino met in New York with Alejandro Domínguez, head…",
    "link": "https://worldsoccertalk.com/news/fifa-and-conmebol-summit-in-new-york-on-2030-world-cup-64-teams-and-more-matches-in-south-america/",
    "timestamp": "2025-09-24T19:24:00Z"
  },
  {
    "title": "Donald Trump’s Ryder Cup Visit Triggers Ban On One Golf Accessory Fans Shouldn’t Bring In The First Place",
    "description": "Fans who were heading to the Ryder Cup on Friday could already expect a hectic scene before Donald Trump announced he’ll be making the trek to Bethpage Black. That led to an increase in security that involved a number of items being banned, including one that…",
    "link": "https://brobible.com/sports/article/ryder-cup-bans-rangefinders-donald-trump-visit/",
    "timestamp": "2025-09-24T19:23:34Z"
  },
  {
    "title": "Shooting down Russian jets ‘on the table,’ von der Leyen says",
    "description": "The Commission president's comment follows an assertion by U.S. President Donald Trump that NATO countries should shoot down Russian jets that violate their airspace.",
    "link": "https://www.politico.eu/article/ursula-von-der-leyen-russia-nato-airspace/",
    "timestamp": "2025-09-24T19:22:11Z"
  },
  {
    "title": "Trump-Friendly Podcast Bro Rips DHS For Using Him In Deportation Propaganda Video",
    "description": "“i didnt approve to be used in this,” Theo Von said after Homeland Security prominently used him in a video celebrating deportations.",
    "link": "https://www.huffpost.com/entry/trump-friendly-podcast-bro-rips-dhs-for-using-him-in-gross-deportation-propaganda-video_n_68d3ffd3e4b0f19864acd487",
    "timestamp": "2025-09-24T19:21:52Z"
  },
  {
    "title": "Is Trump’s Justice Department giving up on corruption?",
    "description": "President Donald Trump once promised to “drain the swamp” — a metaphor for cleansing Washington, D.C., of corruption. Instead, the Justice Department is being drained of corruption fighters amid evidence of malfeasance in his own administration.\nThe Justice D…",
    "link": "https://biztoc.com/x/33763aed664c1dbe",
    "timestamp": "2025-09-24T19:20:57Z"
  },
  {
    "title": "Reporter's Notebook: Trump cancels meeting with Democrats as shutdown looms",
    "description": "Government shutdown looms as House Speaker Mike Johnson and Senate leaders clash over spending bill with September 30th deadline approaching fast.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-trump-cancels-meeting-democrats-shutdown-looms",
    "timestamp": "2025-09-24T19:20:49Z"
  },
  {
    "title": "Zelenskyy tells UN: Stop Russia's war or face destructive arms race",
    "description": "UNITED NATIONS: Ukrainian President Volodymyr Zelenskyy urged world powers to help stop Russia's war in his country in a speech to the United Nations on Wednesday (Sep 24), warning of a dangerous arms race that he said the fighting was helping unleash.He call…",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-tells-un-stop-russias-war-or-face-destructive-arms-race-5367086",
    "timestamp": "2025-09-24T19:20:03Z"
  },
  {
    "title": "Trump hangs autopen image instead of Biden portrait in presidential portrait gallery",
    "description": "Trump hangs autopen image instead of Biden portrait in presidential portrait gallerygo.com",
    "link": "https://abcnews.go.com/Politics/trump-subs-photo-biden-autopen-new-white-house/story?id=125902014",
    "timestamp": "2025-09-24T19:16:34Z"
  },
  {
    "title": "Trump Treasury Sec Admits They’re Trying to Swing a Foreign Election",
    "description": "Treasury Secretary Scott Bessent openly admitted Wednesday that the Trump administration was looking to sway the outcome of a foreign election. Speaking on Fox Business, Bessent seemed to suggest that the United States government hoped to carry President Javi…",
    "link": "https://newrepublic.com/post/200887/donald-trump-treasury-secretary-swing-election-argentina",
    "timestamp": "2025-09-24T19:13:14Z"
  },
  {
    "title": "Trump Admin Tears Down Trump-Epstein Statue In The Dead Of Night",
    "description": "The anonymous group that erected the statue said it was removed due to \"internal pressure\" from the Trump administration.",
    "link": "https://www.huffpost.com/entry/trump-admin-tears-down-trump-epstein-statue-in-the-dead-of-night_n_68d42cb0e4b0bba54aa9eb56",
    "timestamp": "2025-09-24T19:12:27Z"
  },
  {
    "title": "Actress Jessica Chastain Blasts Apple’s Decision To Delay Show About Hunting White Supremacists",
    "description": "Jessica Chastain released a statement on Wednesday, blasting Apple over their decision to cancel the debut of her show centered on fighting white supremacists.\nThe post Actress Jessica Chastain Blasts Apple’s Decision To Delay Show About Hunting White Suprema…",
    "link": "https://www.mediaite.com/media/news/actress-jessica-chastain-blasts-apples-decision-to-delay-show-about-hunting-white-supremacists/",
    "timestamp": "2025-09-24T19:11:29Z"
  },
  {
    "title": "AOC stars in Newsom redistricting ad, urging Californians to 'fight' Trump for democracy",
    "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., stars in viral California redistricting ad as speculation grows about her potential 2028 presidential ambitions.",
    "link": "https://www.foxnews.com/politics/aoc-stars-newson-redistricting-ad-urging-californians-fight-trump-democracy",
    "timestamp": "2025-09-24T19:11:18Z"
  },
  {
    "title": "DC job market battered by Trump's federal job cuts: report",
    "description": "A new report finds the Department of Government Efficiency’s remaking of the federal workforce has battered the Washington job market and put more households in the metropolitan area in financial distress. Wednesday's report says the number of homes for sale …",
    "link": "https://apnews.com/article/trump-washington-federal-takeover-economy-5a81e02a246995a066db375eb47c5692",
    "timestamp": "2025-09-24T19:10:09Z"
  },
  {
    "title": "Judge warns DOJ over conduct in Mangione case",
    "description": "A New York judge warns Justice Department officials they could face sanctions for public comments about Luigi Mangione's prosecution.",
    "link": "https://www.wisn.com/article/justice-department-mangione-case-public-comments/68039278",
    "timestamp": "2025-09-24T19:08:30Z"
  },
  {
    "title": "The MAGA Media Takeover",
    "description": "Trump and his powerful friends are creating a dangerous moment for free speech.",
    "link": "https://www.theatlantic.com/technology/2025/09/maga-media-takeover-tiktok/684351/",
    "timestamp": "2025-09-24T19:07:04Z"
  },
  {
    "title": "5 times Democrats blasted ICE with harsh rhetoric",
    "description": "Top Democrats' heated rhetoric against ICE comes under scrutiny following a fatal sniper attack on a Dallas federal immigration facility that killed one detainee.",
    "link": "https://www.foxnews.com/politics/5-times-democrats-blasted-ice-harsh-rhetoric",
    "timestamp": "2025-09-24T19:06:40Z"
  },
  {
    "title": "Source: President Trump plans to sign the TikTok deal on Thursday (Nandita Bose/Reuters)",
    "description": "Nandita Bose / Reuters:\nSource: President Trump plans to sign the TikTok deal on Thursday  —  U.S. President Donald Trump will sign the TikTok deal on Thursday, a White House source with knowledge of the matter said.  —  Earlier this week, the White House sai…",
    "link": "https://mediagazer.com/250924/p19",
    "timestamp": "2025-09-24T19:06:22Z"
  },
  {
    "title": "Trump to Dine with Cabinet Members in Rose Garden Wednesday Night",
    "description": "President Donald Trump will dine with members of the Cabinet and senior White House officials Wednesday night in the Rose Garden.\nThe post Trump to Dine with Cabinet Members in Rose Garden Wednesday Night appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/24/trump-to-dine-cabinet-members-rose-garden-wednesday-night/",
    "timestamp": "2025-09-24T19:06:06Z"
  },
  {
    "title": "Trump will sign the TikTok deal on Thursday, source says",
    "description": "Earlier this week, the White House said Trump will declare that a deal to divest TikTok's U.S. operations from its Chinese owner ByteDance will meet requirements set out in a 2024 law, and investors will include Oracle, and private equity firm Silver Lake.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-will-sign-the-tiktok-deal-on-thursday-source-says/articleshow/124098873.cms",
    "timestamp": "2025-09-24T19:04:33Z"
  },
  {
    "title": "Sen. Chuck Grassley Slams Migrant Work-Permit Giveaway: 'Direct Violation of the Law'",
    "description": "Homeland security chief Kristi Noem should stop granting hundreds of thousands of work permits to foreigners for white-collar jobs needed by U.S. graduates, says Iowa Sen. Chuck Grassley, the chairman of the Senate's judiciary committee.\nThe post Sen. Chuck G…",
    "link": "https://www.breitbart.com/economy/2025/09/24/sen-chuck-grassley-slams-migrant-work-permit-giveaway-direct-violation-of-the-law/",
    "timestamp": "2025-09-24T19:04:08Z"
  },
  {
    "title": "Progressive Groups Urge Democrats To Hold The Line As Shutdown Nears",
    "description": "Indivisible, MoveOn and other groups are encouraging Democrats to dig in for health care concessions from Republicans.",
    "link": "https://www.huffpost.com/entry/democrats-government-shutdown-indivisible-moveon_n_68d431ebe4b01e99f72d2117",
    "timestamp": "2025-09-24T19:03:53Z"
  },
  {
    "title": "Newsom has strong fear that ‘son of a b----’ Trump will suspend 2028 presidential election",
    "description": "Gov. Gavin Newsom, D-Calif., warned Tuesday night that President Donald Trump may try to cancel the 2028 presidential election to stay in power.",
    "link": "https://www.foxnews.com/media/newsom-has-strong-fear-son-b-trump-suspend-2028-presidential-election",
    "timestamp": "2025-09-24T19:00:38Z"
  },
  {
    "title": "JD Sports Shrugs Off Tariffs, Says Strained U.S. Shoppers Pose Bigger Risk",
    "description": "JD Sports is brushing off concerns about U.S. tariffs, but CEO Régis Schultz says cash-strapped U.S. consumers could have a bigger impact on the retailer’s long-term growth.",
    "link": "https://www.forbes.com/sites/robertolsen-1/2025/09/24/jd-sports-shrugs-off-tariffs-says-strained-us-shoppers-pose-bigger-risk/",
    "timestamp": "2025-09-24T19:00:09Z"
  },
  {
    "title": "Tough it out? Why Trump's pregnancy advice is dangerous for women",
    "description": "Donald Trump's latest health advice goes against the evidence, stigmatises autism and unfairly blames women.",
    "link": "https://www.abc.net.au/news/health/2025-09-25/trump-tylenol-autism-pregnancy-women-tough-it-out-dangerous/105807506",
    "timestamp": "2025-09-24T19:00:00Z"
  },
  {
    "title": "Uzbekistan and Kazakhstan Ink Major U.S. Deals",
    "description": "You can add Uzbek President Shavkat Mirziyoyev and Kazakh President Kassym-Jomart Tokayev to Donald Trump’s “highly respected” leader list.  Trump in a couple of blasts from his Truth Social account singled out the Uzbek and Kazakh leaders for praise after th…",
    "link": "https://oilprice.com/Energy/Energy-General/Uzbekistan-and-Kazakhstan-Ink-Major-US-Deals.html",
    "timestamp": "2025-09-24T19:00:00Z"
  }
]