[
  {
    "title": "Samsung surprises with Q1 profit as buyers rush ahead of US tariffs",
    "description": "Samsung Electronics flagged a stronger-than-expected operating profit for the first quarter on Tuesday, supported by robust smartphone demand and customer's ...",
    "link": "https://finance.yahoo.com/news/samsung-surprises-q1-profit-buyers-054117504.html",
    "timestamp": "2025-04-08T05:41:17Z"
  },
  {
    "title": "Harvard plans to borrow $750 million amid federal funding threats",
    "description": "Trump has threatened to slash federal funding for U.S. universities that his administration says have tolerated antisemitism on their campuses.",
    "link": "https://www.japantimes.co.jp/news/2025/04/08/world/politics/harvard-federal-funding-threats/",
    "timestamp": "2025-04-08T05:41:00Z"
  },
  {
    "title": "Some foreign firms may turn to Türkiye for investment amid Trump tariffs",
    "description": "Companies from Europe and the Far East that are subject to higher U.S. tariffs than Türkiye might consider investing in Türkiye, says Şekib Avdagiç, president of the Istanbul Chamber of Commerce (İTO).",
    "link": "https://www.hurriyetdailynews.com/some-foreign-firms-may-turn-to-turkiye-for-investment-amid-trump-tariffs-207801",
    "timestamp": "2025-04-08T05:40:10Z"
  },
  {
    "title": "Japan foreign policy report highlights importance of building ties with Trump",
    "description": "The 2025 Diplomatic Bluebook said that Tokyo will communicate closely with Washington over various issues facing the international community.",
    "link": "https://www.japantimes.co.jp/news/2025/04/08/japan/politics/diplomatic-bluebook-2025/",
    "timestamp": "2025-04-08T05:40:00Z"
  },
  {
    "title": "China not backing down as fresh U.S. tariff threat pushes tensions to the brink",
    "description": "China vowed on Tuesday to &quot;fight to the end&quot; if President Donald Trump follows through on a threatened 50% tariff hike, rejecting calls to drop its countermeasures and setting the stage for a high-stakes standoff between the world's top two economie…",
    "link": "https://japantoday.com/category/world/china-not-backing-down-as-fresh-us-tariff-threat-pushes-tensions-to-the-brink",
    "timestamp": "2025-04-08T05:39:55Z"
  },
  {
    "title": "Donald Trump Claims He’s in ‘Perfect Health’—But Will His Annual Physical Examination Reveal a Bigger Issue?",
    "description": "Donald Trump is ready for his first annual medical examination for his second term. Though the process is extremely opaque, the White House will release a summary of results and reports.",
    "link": "https://www.inquisitr.com/donald-trump-claims-hes-in-perfect-health-but-will-his-annual-physical-examination-reveal-a-bigger-issue",
    "timestamp": "2025-04-08T05:39:51Z"
  },
  {
    "title": "Supreme Court Allows Trump to Use 1798 Wartime Law to Deport People",
    "description": "The Supreme Court handed President Trump a massive win, allowing his administration to deport alleged gang members using the Alien Enemies Act.",
    "link": "http://www.rollingstone.com/politics/politics-news/supreme-court-ruling-alien-enemies-act-1798-trump-1235312485/",
    "timestamp": "2025-04-08T05:38:45Z"
  },
  {
    "title": "Strong recovery in Asian markets after Monday’s crash from Trump’s tariffs – Nikkei up 6.41%",
    "description": "Asian markets rebounded after historic fall, boosted by Japan and support from China - Hang Seng recovered 2.25% after Monday's 13% plunge\nThe post Strong recovery in Asian markets after Monday’s crash from Trump’s tariffs – Nikkei up 6.41% appeared first on …",
    "link": "https://en.protothema.gr/2025/04/08/strong-recovery-in-asian-markets-after-mondays-crash-from-trumps-tariffs-nikkei-up-6-41/",
    "timestamp": "2025-04-08T05:38:10Z"
  },
  {
    "title": "Trump’s 'Great Wall of Tariffs' could trap Americans in a grey, gadget-less future",
    "description": "Donald Trump's long-held protectionist trade policies, if fully implemented in his second term, could isolate the US from global markets, leading to a decline in quality and increased resentment among Americans. The US might mirror India's past experience wit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-great-wall-of-tariffs-could-trap-americans-in-a-grey-gadget-less-future/articleshow/120083284.cms",
    "timestamp": "2025-04-08T05:37:35Z"
  },
  {
    "title": "Why stock market is rising today: Sensex jumps over 700 pts; Nifty above 22,350; 5 key factors behind today's surge",
    "description": "Indian markets rebounded strongly on Tuesday, fueled by bargain hunting and positive global cues. The Nifty 50 and Sensex surged, driven by hopes of U.S. tariff negotiations and anticipation of an RBI rate cut. A drop in crude oil prices, falling U.S. bond yi…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-rising-today-sensex-jumps-over-700-pts-nifty-above-22350-5-key-factors-behind-todays-surge/articleshow/120084320.cms",
    "timestamp": "2025-04-08T05:36:38Z"
  },
  {
    "title": "TikTok gets another 75-day extension to avoid US ban",
    "description": "TikTok has gotten another 75-day extension that requires the sale of their US operations or face a country-wide ban. This was announced by President Donald Trump via Truth Social, wanting to avoid a “dark future” for the prominent app. The platform boasts ove…",
    "link": "https://www.yugatech.com/news/tiktok-gets-another-75-day-extension-to-avoid-us-ban/",
    "timestamp": "2025-04-08T05:35:10Z"
  },
  {
    "title": "Seeing stock market headlines but don't get the lingo? Here's what it means",
    "description": "Markets around the world have experienced a sharp declined since Donald Trump announced his latest round of tariffs, prompting lots of talk about markets and recessions. Here's what all the lingo means.",
    "link": "https://www.abc.net.au/news/2025-04-08/markets-explainer-ax-what-is-recession-tariffs-bear-market/105151482",
    "timestamp": "2025-04-08T05:34:47Z"
  },
  {
    "title": "Japan stocks rise nearly 5% as Asia markets trade higher after previous session's steep losses",
    "description": "Asia-Pacific markets rose Tuesday, rebounding from previous session's losses over U.S. President Donald Trump's tariff policy and threats of even higher levies against China. Australia's S&P/ASX 200 added 1.92%. Japan's Nikkei 225 rose 5.31% while the Topix g…",
    "link": "https://freerepublic.com/focus/f-news/4309608/posts",
    "timestamp": "2025-04-08T05:34:08Z"
  },
  {
    "title": "\"Indirect\" Iran-US Talks This Weekend: A Look At History Of Bilateral Ties",
    "description": "Iran and the United States will hold talks in the sultanate of Oman on Saturday in an attempt to jump-start negotiations over Tehran&#039;s rapidly advancing nuclear program.",
    "link": "https://www.ndtv.com/world-news/indirect-iran-us-talks-this-weekend-a-look-at-history-of-bilateral-ties-8113853",
    "timestamp": "2025-04-08T05:33:09Z"
  },
  {
    "title": "'Stupidity', 'weakness' - Economists weigh in on Trump's tariffs",
    "description": "A wide range of economists are voicing alarm over President Donald Trump's steep tariffs on imports into the United States, sparking a trade war that experts say could tip many countries into recession. - 'Malignant stupidity' - Paul Krugman, the Nobel econom…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/stupidity-weakness-economists-weigh-in-on-trumps-tariffs/articleshow/120084340.cms",
    "timestamp": "2025-04-08T05:32:52Z"
  },
  {
    "title": "A small fashion brand owner took to TikTok to lay out 3 big ways the Trump tariffs will hit his company",
    "description": "President Donald Trump imposed a baseline 10% tariff on goods from all countries.\nBloomberg/Bloomberg via Getty Images\nAndrew Chen, who owns a small fashion business, is laying out how Trump's tariffs will affect him.\nChen founded his menswear brand in 2003.\n…",
    "link": "https://biztoc.com/x/9e9d43ad487b6564",
    "timestamp": "2025-04-08T05:32:51Z"
  },
  {
    "title": "Nintendo Pushes Back US Preorders For Switch 2 Amid Trump Tariffs, Launch Remains On Track For June: 'Things May Change In The Days Ahead'",
    "description": "Last week, Nintendo Co. (OTC:NTDOY) announced that preorders for the highly anticipated Nintendo Switch 2 in the U.S. will be delayed due to concerns over the potential impact of President Donald Trump’s new tariffs, although the June 5 launch date remains un…",
    "link": "https://biztoc.com/x/ba0ed735327ceb77",
    "timestamp": "2025-04-08T05:32:23Z"
  },
  {
    "title": "‘Blame China, not Trump’: Piyush Goyal says 3 decades of malpractices helped Beijing to grow at the cost of nations like India",
    "description": "Commerce Minister Piyush Goyal has called out China’s decades-long unfair trade practices, warning they’ve led to economic instability worldwide. Speaking at the India Global Forum, he blamed the global crisis on myopic decisions and urged collective internat…",
    "link": "https://economictimes.indiatimes.com/news/india/blame-china-not-trump-piyush-goyal-says-3-decades-of-malpractices-helped-beijing-to-grow-at-the-cost-of-nations-like-india/articleshow/120083877.cms",
    "timestamp": "2025-04-08T05:30:59Z"
  },
  {
    "title": "China Vows to 'Fight to the End' as Trump Threatens 50% Tariffs",
    "description": "China vowed to \"fight to the end\" after President Donald Trump threatened to impose a 50 percent duty on imports if Beijing does not withdraw the retaliatory 34 percent tariff it imposed on American products last week.\nThe post China Vows to ‘Fight to the End…",
    "link": "https://www.breitbart.com/politics/2025/04/07/china-vows-fight-end-trump-threatens-50-tariffs/",
    "timestamp": "2025-04-08T05:30:57Z"
  },
  {
    "title": "Apple's market cap plummeted by $640 billion amid looming new tariffs on China",
    "description": "Over the past three trading days, Apple has lost nearly $640 billion in market cap, primarily due to Trump's threats to impose additional tariffs on China. Read more...",
    "link": "https://www.neowin.net/news/apples-market-cap-plummeted-by-640-billion-amid-looming-new-tariffs-on-china/",
    "timestamp": "2025-04-08T05:30:01Z"
  },
  {
    "title": "Music industry battling AI with limited success",
    "description": "The music industry is fighting on platforms, through the courts and with legislators in a bid to prevent the theft and misuse of art from generative AI but it remains an uphill battle.",
    "link": "https://www.hurriyetdailynews.com/music-industry-battling-ai-with-limited-success-207785",
    "timestamp": "2025-04-08T05:28:19Z"
  },
  {
    "title": "A small fashion brand owner took to TikTok to lay out 3 big ways the Trump tariffs will hit his company",
    "description": "Costs, uncertainty, and a deterioration of his overseas market were at the forefront of his concerns.",
    "link": "https://www.businessinsider.com/fashion-brand-owner-3-big-ways-trump-tariffs-hit-company-2025-4",
    "timestamp": "2025-04-08T05:25:13Z"
  },
  {
    "title": "China vows 'fight to the end' as Trump warns 50 percent more tariffs",
    "description": "China vowed on Tuesday to \"fight to the end\" against fresh tariffs of 50 percent threatened by U.S. President Donald Trump, further aggravating a trade war that has already wiped trillions off global markets.",
    "link": "https://www.hurriyetdailynews.com/china-vows-fight-to-the-end-as-trump-warns-50-percent-more-tariffs-207800",
    "timestamp": "2025-04-08T05:25:06Z"
  },
  {
    "title": "White House orders agencies to develop AI strategies, name leaders",
    "description": "Agencies ordered to name chief AI officers.",
    "link": "https://www.itnews.com.au/news/white-house-orders-agencies-to-develop-ai-strategies-name-leaders-616382?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-04-08T05:25:00Z"
  },
  {
    "title": "Buffett Says Comments Attributed to Him on X, TikTok ‘All False’",
    "description": "Berkshire Hathaway Inc. said Friday that all reports circulating on social media sites including X, TikTok and Facebook “regarding comments allegedly made” by Warren Buffett are false. While Berkshire didn’t describe the nature of the posts, the firm’s statem…",
    "link": "https://www.insurancejournal.com/news/national/2025/04/08/818934.htm",
    "timestamp": "2025-04-08T05:23:53Z"
  },
  {
    "title": "Iran’s Expanded Uranium Mining Hints at Much Bigger Reserves",
    "description": "Iran is expanding uranium production after indicating that it has significantly higher reserves of the metal than previously estimated, according to the latest nuclear-watchdog data.",
    "link": "https://financialpost.com/pmn/business-pmn/irans-expanded-uranium-mining-hints-at-much-bigger-reserves",
    "timestamp": "2025-04-08T05:22:54Z"
  },
  {
    "title": "Asia higher as China vows to respond to US tariffs",
    "description": "Asia-Pacific markets rose Tuesday as China reaffirmed it would \"fight to the end\" after US President Donald Trump renewed threats of a 50% tariff on Chinese goods. Japan named Ryosei Akazawa its top U...",
    "link": "https://biztoc.com/x/1006ace773a47c8f",
    "timestamp": "2025-04-08T05:21:34Z"
  },
  {
    "title": "Kevin O'Leary says he doesn't think the Trump administration is 'stupid,' expects tariffs to be removed",
    "description": "\"I believe in economics driving everything at the end of the day, and I don't think the Trump administration is stupid,\" Kevin O'Leary said on Monday.\nRoy Rochlin via Getty Images\nKevin O'Leary said he believes President Donald Trump will drop his reciprocal …",
    "link": "https://biztoc.com/x/0b361a1bfe8c2135",
    "timestamp": "2025-04-08T05:21:08Z"
  },
  {
    "title": "Kevin O'Leary says he doesn't think the Trump administration is 'stupid,' expects tariffs to be removed",
    "description": "\"I believe in economics driving everything at the end of the day, and I don't think the Trump administration is stupid,\" O'Leary said.",
    "link": "https://www.businessinsider.com/kevin-oleary-expects-trumps-tariffs-removed-2025-4",
    "timestamp": "2025-04-08T05:17:36Z"
  },
  {
    "title": "Trump-backed World Liberty Financial Proposes USD1 Airdrop to Early Supporters",
    "description": "WLFI’s airdrop test proposal comes amid clashes in Congress over the Trump family’s deep financial ties to the $390 million crypto firm.",
    "link": "https://decrypt.co/313851/trump-backed-wlfi-small-scale-usd1-airdrop-early-supporters",
    "timestamp": "2025-04-08T05:12:23Z"
  },
  {
    "title": "“Red tsunami”: China challenges US economic sovereignty and scares Trump",
    "description": "The American president has made no secret of the fact that for him today there is no greater danger and enemy than Beijing\nThe post “Red tsunami”: China challenges US economic sovereignty and scares Trump appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/04/08/red-tsunami-china-challenges-us-economic-sovereignty-and-scares-trump/",
    "timestamp": "2025-04-08T05:12:13Z"
  },
  {
    "title": "Amid Donald Trump-China tariff slugfest, Zoho founder Sridhar Vembu sees a huge bargain-hunting opportunity for Indian manufacturers",
    "description": "Zoho's Sridhar Vembu suggests Indian manufacturers capitalize on China's overcapacity by acquiring used machinery. With US-China trade tensions escalating, nearly-new equipment is available at reduced prices. Industry veteran Prakash Dadlani highlights succes…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/amid-donald-trump-china-tariff-slugfest-zoho-founder-sridhar-vembu-sees-a-huge-bargain-hunting-opportunity-for-indian-manufacturers/articleshow/120083123.cms",
    "timestamp": "2025-04-08T05:11:09Z"
  },
  {
    "title": "Trump urges Netanyahu to be 'reasonable' with Türkiye, praises Erdoğan ties",
    "description": "U.S. President Donald Trump on Monday pressed Israeli Prime Minister Benjamin Netanyahu to stay “reasonable” in resolving any disputes with Türkiye, while touting his strong bond with Turkish President Recep Tayyip Erdoğan during an Oval Office meeting.",
    "link": "https://www.hurriyetdailynews.com/trump-urges-netanyahu-to-be-reasonable-with-turkiye-praises-erdogan-ties-207797",
    "timestamp": "2025-04-08T05:09:30Z"
  },
  {
    "title": "M'sia to send officials to US to discuss tariffs by end of April, says Amir Hamzah",
    "description": "KUALA LUMPUR: Malaysia is expected to send its officials to the United States to discuss the tariff issue by the end of April, says Datuk Seri Amir Hamzah Azizan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/08/m039sia-to-send-officials-to-us-to-discuss-tariffs-by-end-of-april-says-amir-hamzah",
    "timestamp": "2025-04-08T05:09:00Z"
  },
  {
    "title": "Trump: 'Not Going to Bend'",
    "description": "President Donald Trump doubled down on his tariffs position on Monday, taking to his Truth Social platform to point to a number of things that are happening amid the global market meltdown since his \"Liberation Day\" tariffs were announced last week.\"Rates are…",
    "link": "https://freerepublic.com/focus/f-news/4309607/posts",
    "timestamp": "2025-04-08T05:08:09Z"
  },
  {
    "title": "Asean nations plan tariff talks with US as Anwar seeks unity",
    "description": "<p>Malaysian Prime Minister Anwar Ibrahim said on Tuesday his country and Association of Southeast Asian Nations partners will dispatch officials to Washington for talks following President Donald Trump&rsquo;s rollout of global tariffs.</p>",
    "link": "https://www.bangkokpost.com/business/general/2998304/asean-nations-plan-tariff-talks-with-us-as-anwar-seeks-unity",
    "timestamp": "2025-04-08T05:08:00Z"
  },
  {
    "title": "‘All Of These Crazy Left Judges Are On Notice’: Stephen Miller Says Trump Admin’s SCOTUS Win Sends Clear Message",
    "description": "Stephen Miller said SCOTUS' decision to allow deportations under the Alien Enemies Act of 1798 signals a \"notice\" to all of the \"crazy left judges.\"",
    "link": "https://dailycaller.com/2025/04/08/stephen-miller-scotus-ruling-deportations-donald-trump-boasberg/",
    "timestamp": "2025-04-08T05:06:21Z"
  },
  {
    "title": "Will Trump's tariffs lead to recession? Here's how to know if we're in one",
    "description": "President Trump's recent tariff hikes have rattled Wall Street, sparking recession fears among economists. Goldman Sachs estimates a 45% recession probability, while JPMorgan puts it at 60%, projecting higher inflation. Economists warn the tariffs could disru…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/will-trumps-tariffs-lead-to-recession-heres-how-to-know-if-were-in-one/articleshow/120083658.cms",
    "timestamp": "2025-04-08T05:02:55Z"
  },
  {
    "title": "South Korea goes to polls June",
    "description": "South Korea will hold a presidential election on June 3, the country’s acting president said Tuesday. Former leader Yoon Suk Yeol was removed from office over a disastrous declaration of martial law. The democratic country has been effectively leaderless sinc…",
    "link": "https://punchng.com/south-korea-goes-to-polls-june/",
    "timestamp": "2025-04-08T05:01:05Z"
  },
  {
    "title": "Crude oil futures recover after Monday’s fall",
    "description": "At 9.57 am on Tuesday, June Brent oil futures were at $65.14, up by 1.45%, and May crude oil futures on WTI were at $61.66, up by 1.58%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-recover-after-mondays-fall/article69425797.ece",
    "timestamp": "2025-04-08T05:01:04Z"
  },
  {
    "title": "The voice of the Almighty Dollar is shouting stop, Mr Trump",
    "description": "The most effective pushback against Donald Trump right now is a plunging financial graph",
    "link": "https://www.irishtimes.com/opinion/2025/04/08/trump-tariffs-markets-wall-street/",
    "timestamp": "2025-04-08T05:00:14Z"
  },
  {
    "title": "Legal threats see some climate activists turn to clandestine sabotage activities",
    "description": "Ireland has a long history of courageous climate and environmental activism which includes protests against LNG and fracking, the Corrib gas pipeline, tree felling at the Glen of the Downs, Sitka spruce plantations and data centres",
    "link": "https://www.irishtimes.com/opinion/2025/04/08/legal-threats-see-some-climate-activists-turn-to-clandestine-sabotage-activities/",
    "timestamp": "2025-04-08T05:00:13Z"
  },
  {
    "title": "Tariff crisis has a silver lining for Merz",
    "description": "US action strengthens CDU leader’s hand in government formation discussions with centre-left SPD",
    "link": "https://www.irishtimes.com/business/2025/04/08/tariff-crisis-has-a-silver-lining-for-merz/",
    "timestamp": "2025-04-08T05:00:01Z"
  },
  {
    "title": "Trump holds firm on tariff agenda despite alarm on Wall Street",
    "description": "President threatens to impose further 50% levy if China declines to withdraw retaliation to earlier US duties",
    "link": "https://www.irishtimes.com/politics/2025/04/08/trump-holds-firm-on-tariff-agenda-despite-alarm-on-wall-street/",
    "timestamp": "2025-04-08T05:00:01Z"
  },
  {
    "title": "‘We help Israel a lot’: Trump leverages aid, floats Gaza relocation plan in talks with Israeli PM Benjamin Netanyahu",
    "description": "US President Donald Trump has proposed a controversial plan for America to take control of the Gaza Strip, suggesting relocation of its two million residents and redevelopment of the region. Speaking alongside Israeli Prime Minister Benjamin Netanyahu, Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-help-israel-a-lot-trump-leverages-aid-floats-gaza-relocation-plan-in-talks-with-israeli-pm-benjamin-netanyahu/articleshow/120082148.cms",
    "timestamp": "2025-04-08T04:59:08Z"
  },
  {
    "title": "Bucharest in turmoil over disputed US envoys and Ukraine support",
    "description": "Tensions escalated after one of the appointees made public statements contradicting Romania’s official Ukraine and EU stance.",
    "link": "https://www.euractiv.com/section/politics/news/bucharest-in-turmoil-over-disputed-us-envoys-and-ukraine-support/",
    "timestamp": "2025-04-08T04:54:37Z"
  },
  {
    "title": "Jon Stewart Says Tariffs Are Hitting Like COVID and ‘Trump Released the Contagion’: ‘It’s Your Lab Leak’ | Video",
    "description": "\"It didn't have to be this reckless. You killed the hostage and then went, 'so ransom?'\" the \"Daily Show\" host says\nThe post Jon Stewart Says Tariffs Are Hitting Like COVID and ‘Trump Released the Contagion’: ‘It’s Your Lab Leak’ | Video appeared first on The…",
    "link": "https://www.thewrap.com/jon-stewart-donald-trump-tariff-policies-commentary-daily-show/",
    "timestamp": "2025-04-08T04:53:02Z"
  },
  {
    "title": "Indonesia stocks plunge on Trump tariffs after weeklong break",
    "description": "Indonesian stocks tanked more than seven percent on Tuesday after a weeklong public holiday break, with trading briefly suspended at the open as uncertainty over US President Donald Trump’s global tariffs roils markets. Trump upended the world economy last we…",
    "link": "https://www.digitaljournal.com/world/indonesia-stocks-plunge-on-trump-tariffs-after-weeklong-break/article",
    "timestamp": "2025-04-08T04:52:20Z"
  },
  {
    "title": "Indonesia Stocks Plunge On Trump Tariffs After Weeklong Break",
    "description": "Indonesian stocks tanked more than seven percent on Tuesday after a weeklong public holiday break, with trading briefly suspended at the open as uncertainty over US President Donald Trump's global tariffs roils markets.",
    "link": "https://www.ibtimes.com/indonesia-stocks-plunge-trump-tariffs-after-weeklong-break-3769173",
    "timestamp": "2025-04-08T04:51:16Z"
  },
  {
    "title": "Asia markets and US futures are trading up after days of pain",
    "description": "Markets are up on the back of news that countries are lining up to negotiate the tariffs with Trump's administration.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-market-crash-rebound-outlook-sp500-recession-trump-tariffs-war-2025-4",
    "timestamp": "2025-04-08T04:50:10Z"
  },
  {
    "title": "\"This Is Madness\": The 15 Minutes That Rocked Stock Markets",
    "description": "At just after 10 a.m., shouting erupted on the Siebert trading floor in downtown Manhattan.",
    "link": "https://www.ndtv.com/business-news/the-15-minutes-that-rocked-stock-markets-this-is-madness-8113539",
    "timestamp": "2025-04-08T04:45:36Z"
  },
  {
    "title": "Audit finds Hong Kong firm flouted terms of Panama Canal ports contract",
    "description": "<p>PANAMA CITY - The Hong Kong firm in charge of two ports at either end of the Panama Canal -- which sparked US President Donald Trump's threats to seize the waterway -- has flouted the terms of its contract, according to Panamanian audit results released Mo…",
    "link": "https://www.bangkokpost.com/world/2998279/audit-finds-hong-kong-firm-flouted-terms-of-panama-canal-ports-contract",
    "timestamp": "2025-04-08T04:45:00Z"
  },
  {
    "title": "Ray of hope or false dawn for markets?",
    "description": "European investors still staggering from a nearly 12% plunge over three days in their regional stock benchmark are waking up to a futures market pointing...",
    "link": "https://finance.yahoo.com/news/ray-hope-false-dawn-markets-044114077.html",
    "timestamp": "2025-04-08T04:41:14Z"
  },
  {
    "title": "China's state firms to increase share buying in stabilization push",
    "description": "A number of China's state-owned investment holding companies promised on Tuesday to increase share holdings, in a bid to stabilize a stock market shaken by United States President Donald Trump&#39...",
    "link": "https://biztoc.com/x/cfa8f35106f9320e",
    "timestamp": "2025-04-08T04:37:27Z"
  },
  {
    "title": "Apple Reportedly Plans To Move More iPhone Production To India Amid Trump Tariff Fears: Could This Solve The Potential 40% Price Hike?",
    "description": "Apple Inc. (NASDAQ:AAPL) is reportedly shifting more of its iPhone production to India to mitigate the financial impact of President Donald Trump's escalating tariffs on Chinese goods, potentially offsetting the projected 30% to 40% price increase on its devi…",
    "link": "https://biztoc.com/x/e580cf967235dee1",
    "timestamp": "2025-04-08T04:37:00Z"
  },
  {
    "title": "M'sia will continue with reform strategies to better the economy, says Amir Hamzah",
    "description": "KUALA LUMPUR: Malaysia will continue with its reform strategies for the betterment of the nation's economy amid challenging market conditions, says Datuk Seri Amir Hamzah Azizan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/08/m039sia-will-continue-with-reform-strategies-to-better-the-economy-says-amir-hamzah",
    "timestamp": "2025-04-08T04:37:00Z"
  },
  {
    "title": "Larry Kudlow Presses Scott Bessent About How Administration Decided Trump Tariff Rates",
    "description": "Larry Kudlow pressed US Treasury Secretary Scott Bessent on Fox Business Monday on the rationale behind the tariff rates imposed by President Donald Trump.",
    "link": "https://dailycaller.com/2025/04/08/larry-kudlow-scott-bessent-trump-tariff-rates/",
    "timestamp": "2025-04-08T04:35:32Z"
  },
  {
    "title": "Vietnam says to buy more US goods as it seeks tariff delay",
    "description": "Vietnam will buy more US goods including security and defence products, the government said, as it seeks a last-minute delay to enormous tariffs imposed by Washington. The Southeast Asian manufacturing powerhouse counted the United States as its biggest expor…",
    "link": "https://www.digitaljournal.com/world/vietnam-says-to-buy-more-us-goods-as-it-seeks-tariff-delay/article",
    "timestamp": "2025-04-08T04:32:33Z"
  },
  {
    "title": "Vietnam to buy US defense and security products to address trade gap",
    "description": "Hanoi will also seek faster deliveries of commercial planes that Vietnamese airlines have ordered from the US, Prime MInister Pham Minh Chinh says",
    "link": "https://www.rappler.com/world/asia-pacific/vietnam-buy-united-states-defense-security-products-address-trade-gap/",
    "timestamp": "2025-04-08T04:32:15Z"
  },
  {
    "title": "US tariffs hitting 380 bln euros worth of exports: EU trade chief",
    "description": "The range of U.S. tariffs announced last week by President Donald Trump is hitting 380 billion euros, or about US$416 billion, worth of EU exports to the United States, EU trade commissioner, Maros Sefcovic, told reporters on Monday (April 7). - REUTERS",
    "link": "https://www.bangkokpost.com/video/world/2998256",
    "timestamp": "2025-04-08T04:30:00Z"
  },
  {
    "title": "Jon Stewart Destroys Conservatives With A Page Out Of Trump's Book",
    "description": "The \"Daily Show\" host demolished Republicans' \"best argument\" for the president's tariffs with a blast from the past.",
    "link": "https://www.huffpost.com/entry/jon-stewart-daily-show-trump-tariffs_n_67f49520e4b007ee85d7492d",
    "timestamp": "2025-04-08T04:27:17Z"
  },
  {
    "title": "Trump keeps investors on edge with clashing tariff comments",
    "description": "China would be hit with the higher charge if Beijing did not pull back from a plan to impose 34% retaliatory levies on American goods, the president vowed, a move that would add duties of 84% on many Chinese imports, on top of a 20% rate he already applied ea…",
    "link": "https://www.bloomberg.com/news/articles/2025-04-08/trump-s-clashing-tariff-comments-keep-stock-market-investors-on-edge",
    "timestamp": "2025-04-08T04:26:34Z"
  },
  {
    "title": "China says it will 'fight to the end' after Trump threatens to impose still more tariffs",
    "description": "China says it will “fight to the end” and take countermeasures against the United States to safeguard its own interests after President Donald Trump threatened an additional 50% tariff on Chinese imports",
    "link": "https://biztoc.com/x/9efba68fdee21e94",
    "timestamp": "2025-04-08T04:25:57Z"
  },
  {
    "title": "‘SNL’ Put A Comedic Spin On Morgan Wallen’s Remarks Following His Abrupt Exit",
    "description": "Getty Image\r\n\nCast members Bowen Yang and Kenan Thompson have also spoken out.",
    "link": "https://uproxx.com/country/snl-morgan-wallen-abrupt-exit-response/",
    "timestamp": "2025-04-08T04:25:28Z"
  },
  {
    "title": "Govt explores plan to negotiate suspension of 26% tariffs till bilateral trade agreement is finalised with US: Report",
    "description": "Trump tariffs: India could also negotiate a temporary relief for a select list of high-performing export categories, including textiles, engineering goods and electronics goods.",
    "link": "https://www.businesstoday.in/latest/economy/story/govt-explores-plan-to-negotiate-suspension-of-26-tariffs-till-bilateral-trade-agreement-is-finalised-with-us-report-471105-2025-04-08",
    "timestamp": "2025-04-08T04:23:19Z"
  },
  {
    "title": "FACTBOX - Measures being taken by Asian policymakers as market rout deepens",
    "description": "<p>HONG KONG&nbsp; - Policymakers across Asia are preparing measures to support financial markets as a rout deepened following sweeping tariffs announced by U.S. President Donald Trump that stoked widespread recession worries. Here are some of the announcemen…",
    "link": "https://www.bangkokpost.com/business/general/2998242/factbox-measures-being-taken-by-asian-policymakers-as-market-rout-deepens",
    "timestamp": "2025-04-08T04:22:00Z"
  },
  {
    "title": "Trump's tariffs trigger recession alarm",
    "description": "As stock markets remain volatile, investors are worried the global economy is on the verge of a slump. DW explores the impact of Trump's tariffs on US, Chinese and world growth.",
    "link": "https://www.dw.com/en/us-economy-trump-tariffs-recession-inflation-trade/a-72158605",
    "timestamp": "2025-04-08T04:18:00Z"
  },
  {
    "title": "Trump’s tariffs trigger alarm over looming recession",
    "description": "As stock markets remain volatile, investors are worried the global economy is on the verge of a slump. DW explores the impact of Trump's tariffs on US, Chinese and world growth. The rout on global financial markets continued for a third day on Monday (April 7…",
    "link": "https://www.dw.com/en/trumps-tariffs-trigger-alarm-over-looming-recession/a-72158605",
    "timestamp": "2025-04-08T04:18:00Z"
  },
  {
    "title": "Six teals fighting to be first Qld independents since Hanson, Katter",
    "description": "Deep in Queensland's blue-blood heartland, six female independent candidates are aiming to dismantle decades of an LNP stranglehold on power.",
    "link": "https://www.abc.net.au/news/2025-04-08/climate-200-teal-independent-candidates-queensland-fed-election/105145466",
    "timestamp": "2025-04-08T04:17:06Z"
  },
  {
    "title": "Solar Power doubling every 3 Years; 41% of world Electricity now Low-Carbon",
    "description": "Ann Arbor (Informed Comment) - It may be that Trump can slow the advance of renewables, including solar energy, in the United States. That would be a shame for the US, because consumers will have to pay more for electricity, the grid will be dirtier, and the …",
    "link": "https://www.juancole.com/2025/04/doubling-electricity-carbon.html",
    "timestamp": "2025-04-08T04:15:57Z"
  },
  {
    "title": "China's state companies to increase share holdings",
    "description": "A number of China's state-owned investment holding companies promised on Tuesday to increase share holdings, in a bid to stabilize a stock market shaken by United States President Donald Trump&#39...",
    "link": "https://biztoc.com/x/fd3d71b388da98b9",
    "timestamp": "2025-04-08T04:15:18Z"
  },
  {
    "title": "Trump says high tariffs may have prevented the Great Depression. History says different",
    "description": "In the early days of the Great Depression, Rep. Willis Hawley, a Republican from Oregon, and Utah Republican Sen. Reed Smoot thought they had landed on a way to protect American farmers and manufacturers from foreign competition: tariffs",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-high-tariffs-prevented-great-depression-history-120583196",
    "timestamp": "2025-04-08T04:14:31Z"
  },
  {
    "title": "China says it will 'fight to the end' after Trump threatens to impose still more tariffs",
    "description": "China says it will “fight to the end” and take countermeasures against the United States to safeguard its own interests after President Donald Trump threatened an additional 50% tariff on Chinese imports",
    "link": "https://abcnews.go.com/Business/wireStory/china-fight-end-after-trump-threatens-impose-tariffs-120581294",
    "timestamp": "2025-04-08T04:14:29Z"
  },
  {
    "title": "Jon Stewart Slams the Right for Downplaying Donald Trump’s Widespread Tariffs: ‘We Are Not the World’s Victims’",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart went after President Donald Trump for downplaying the consequences of his widespread tariffs, which has sent the global economy into a tail spin. In a segment labeled “Trade Wars,” in reference to the sc…",
    "link": "https://variety.com/2025/tv/news/jon-stewart-donald-trump-tariffs-the-daily-show-1236362630/",
    "timestamp": "2025-04-08T04:12:40Z"
  },
  {
    "title": "Contract for Hong Kong company to operate Panama Canal ports had irregularities, audit finds",
    "description": "Panama’s comptroller authority says an audit found irregularities in the renewal of a 25-year port concession in the interoceanic canal and it would request an investigation into the authorization of the contract to a Hong Kong company. Comptroller-General An…",
    "link": "https://www.seattlepi.com/news/world/article/contract-for-hong-kong-company-to-operate-panama-20264164.php",
    "timestamp": "2025-04-08T04:11:05Z"
  },
  {
    "title": "Trump says high tariffs may have prevented the Great Depression. History says different",
    "description": "In the early days of the Great Depression, Rep. Willis Hawley, a Republican from Oregon, and Utah Republican Sen. Reed Smoot thought they had landed on a way to protect American farmers and manufacturers from foreign competition: tariffs. Most historians look…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-says-high-tariffs-may-have-prevented-the-20264181.php",
    "timestamp": "2025-04-08T04:11:05Z"
  },
  {
    "title": "Vietnam to buy US defence and security products to address trade gap",
    "description": "Vietnam aims to increase purchases of American goods, including defense and security products, while requesting a 45-day delay in the imposition of U.S. tariffs. Prime Minister Pham Minh Chinh seeks faster deliveries of commercial planes and balanced trade ne…",
    "link": "https://economictimes.indiatimes.com/news/defence/vietnam-to-buy-us-defence-and-security-products-to-address-trade-gap/articleshow/120082463.cms",
    "timestamp": "2025-04-08T04:10:47Z"
  },
  {
    "title": "How this Trump appointee could pressure the CSL share price",
    "description": "A leading expert believes Donald Trump isn’t doing CSL shareholders any favours.\nThe post How this Trump appointee could pressure the CSL share price appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/08/how-this-trump-appointee-could-pressure-the-csl-share-price/",
    "timestamp": "2025-04-08T04:08:26Z"
  },
  {
    "title": "China's state companies vow to increase share holdings",
    "description": "A number of China's state-owned investment holding companies promised on Tuesday to increase share holdings, in a bid to stabilize a stock market shaken by United States President Donald Trump&#39...",
    "link": "https://biztoc.com/x/96d928a49b0017c0",
    "timestamp": "2025-04-08T04:04:24Z"
  },
  {
    "title": "With US Bombers at the ready, can Trump cut a Deal with Iran and avoid a War?",
    "description": "By Amin Saikal, Victoria University (The Conversation) - The United States and Iran are once again on a collision course over the Iranian nuclear program. In a letter dated early March, US President Donald Trump urged Iranian Supreme Leader Ayatollah Ali Kham…",
    "link": "https://www.juancole.com/2025/04/bombers-ready-trump.html",
    "timestamp": "2025-04-08T04:04:08Z"
  },
  {
    "title": "Apple's Plan to Source More iPhones From India May Be Double Blow to China",
    "description": "Apple is planning to source more iPhones from India in an attempt to avoid the high tariffs President Donald Trump has imposed on China, The Wall Street Journal reports.",
    "link": "https://biztoc.com/x/3217ef4ebe4c757f",
    "timestamp": "2025-04-08T04:04:04Z"
  },
  {
    "title": "Sensex surges 1,200 pts, Nifty reclaims 22,500 as bulls fight back after steepest drop in 10 months",
    "description": "Indian benchmark indices Nifty 50 and Sensex rebounded on Tuesday, recovering from Monday's sharp decline triggered by U.S. tariff concerns. Early trading saw widespread buying across sectors, with the BSE Sensex rising 1.56% and the Nifty 50 gaining 1.65%. M…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-1200-pts-nifty-reclaims-22500-as-bulls-fight-back-after-steepest-drop-in-10-months/articleshow/120082267.cms",
    "timestamp": "2025-04-08T04:02:33Z"
  },
  {
    "title": "Gold rises as trade war jitters revive safe-haven demand",
    "description": "Gold prices rebound as trade war fears escalate, with Fed minutes, CPI, and PPI data upcoming.",
    "link": "https://www.thehindubusinessline.com/markets/gold/precious-gold-rises-as-trade-war-jitters-revive-safe-haven-demand/article69425723.ece",
    "timestamp": "2025-04-08T04:01:36Z"
  },
  {
    "title": "Apple's Plan to Source More iPhones From India May Be Double Blow to China",
    "description": "Apple is planning to source more iPhones from India in an attempt to avoid the high tariffs President Donald Trump has imposed on China, The Wall Street Journal reports.",
    "link": "https://www.newsweek.com/apples-plan-source-more-iphones-india-may-double-blow-china-2056603",
    "timestamp": "2025-04-08T04:01:15Z"
  },
  {
    "title": "Watch live: PM Lawrence Wong's ministerial statement on US tariffs and their implications for Singapore",
    "description": "<![CDATA[ Prime Minister Lawrence Wong will give a ministerial statement in parliament on Tuesday (Apr 8) afternoon on the impact of sweeping tariffs announced by US President Donald Trump and its implications for Singapore. ]]>",
    "link": "https://www.channelnewsasia.com/singapore/watch-pm-lawrence-wong-ministerial-statement-trump-tariffs-5050571",
    "timestamp": "2025-04-08T04:01:05Z"
  },
  {
    "title": "President Donald Trump and Chairman Mao",
    "description": "I’ve never met Donald Trump nor had any dealings with him, and since I don’t watch television, I’d barely paid attention to his antics until his unexpectedly strong run for the White House began attracting heavy media coverage in 2015. But some time ago I was…",
    "link": "https://www.lewrockwell.com/2025/04/ron-unz/president-donald-trump-and-chairman-mao/",
    "timestamp": "2025-04-08T04:01:00Z"
  },
  {
    "title": "The Grace of Wayne Gretzky",
    "description": "Hockey’s living legend shows how to lose with class.\nThe post The Grace of Wayne Gretzky  appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-grace-of-wayne-gretzky/",
    "timestamp": "2025-04-08T04:01:00Z"
  },
  {
    "title": "Ukraine and Gaza Bring Shame to America",
    "description": "Our grandchildren will never forgive us. \nThe post Ukraine and Gaza Bring Shame to America appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/ukraine-and-gaza-bring-shame-to-america/",
    "timestamp": "2025-04-08T04:01:00Z"
  },
  {
    "title": "Ending Militarism in America",
    "description": "Originally appeared at TomDispatch. In September 2007, retired Air Force lieutenant colonel and historian William Astore emailed me out of the blue. He’d been reading articles at TomDispatch, the website I set up soon after the 9/11 attacks to deal with this …",
    "link": "https://original.antiwar.com/william_astore/2025/04/07/ending-militarism-in-america/",
    "timestamp": "2025-04-08T04:00:50Z"
  },
  {
    "title": "IRS and DHS reach historic deal to aid in pursuit of illegal immigrants subject to deportation",
    "description": "The Department of Homeland Security and Internal Revenue Service will collaborate to target criminal illegal immigrants subject to deportation.",
    "link": "https://www.foxnews.com/politics/irs-dhs-reach-historic-deal-aid-pursuit-illegal-immigrants-subject-deportation",
    "timestamp": "2025-04-08T04:00:20Z"
  },
  {
    "title": "South Korea to hold presidential election on June 3",
    "description": "South Korea's government has approved June 3 as the date for a snap presidential election, following the removal from office of Yoon Suk Yeol last week over his short-lived declaration of martial law. The cabinet agreed the date on Tuesday after discussions w…",
    "link": "https://japantoday.com/category/world/south-korea-to-hold-snap-presidential-election-on-june-31",
    "timestamp": "2025-04-08T04:00:04Z"
  },
  {
    "title": "Why did Irish pharma exports escape the tariff guillotine?",
    "description": "The Government and IDA Ireland have always been more fearful of a big change in the US tax code",
    "link": "https://www.irishtimes.com/business/economy/2025/04/08/why-did-irish-pharma-exports-escape-the-tariff-guillotine/",
    "timestamp": "2025-04-08T04:00:00Z"
  },
  {
    "title": "Democrats are avoiding Obama like a bad smell",
    "description": "If you're gonna be a master of sneaky pete, a master meddler, you'd better be sure your sneaky schemes work.\r\n\r\nObama's didn't.\r\n\r\nWhich is how he's found himself in this predicament, according to New York Post columnist, Miranda ...",
    "link": "https://www.americanthinker.com/blog/2025/04/democrats_are_avoiding_obama_like_a_bad_smell.html",
    "timestamp": "2025-04-08T04:00:00Z"
  },
  {
    "title": "When The Government Brutalizes Children",
    "description": "Experience hath shewn, that even under the best forms of government those entrusted with power have, in time, and by slow operations, perverted it into tyranny – Thomas Jefferson\r\n\r\nWith all due respect to Jefferson, sometimes that perversion h...",
    "link": "https://www.americanthinker.com/articles/2025/04/when_the_government_brutalizes_children.html",
    "timestamp": "2025-04-08T04:00:00Z"
  },
  {
    "title": "‘Democracy,’ Establishment Style",
    "description": "Political elites in Europe and the United States regard rising populism as an existential threat to their power and wealth.  We have witnessed in recent years the establishment’s efforts to defeat its opponents by prosecuting them and...",
    "link": "https://www.americanthinker.com/articles/2025/04/democracy_establishment_style.html",
    "timestamp": "2025-04-08T04:00:00Z"
  },
  {
    "title": "The Russia Tariff Canard",
    "description": "Cheap political attacks have been part of American life since before the ink dried on the Constitution. Even George Washington took fire from scornful scribes accusing him—the man who freed us from the shackles of the British crown—of mon...",
    "link": "https://www.americanthinker.com/articles/2025/04/the_russia_tariff_canard.html",
    "timestamp": "2025-04-08T04:00:00Z"
  }
]