[
  {
    "title": "Truck driver in fatal Florida crash repeatedly failed driving tests, official says",
    "description": "TALLAHASSEE, Fla. (AP) &mdash; A commercial truck driver who is charged with killing three people in a deadly crash in Florida in August had failed a commercial drive",
    "link": "https://weartv.com/news/local/truck-driver-in-fatal-florida-crash-repeatedly-failed-driving-tests-official-says",
    "timestamp": "2025-10-25T15:49:44Z"
  },
  {
    "title": "Trump's $130 million mystery donor is Mellon heir: NYT",
    "description": "A mystery donor whose $130 million is meant to pay U.S. military during the government shutdown is Timothy Mellon, The New York Times reported Saturday.",
    "link": "https://www.cnbc.com/2025/10/25/trump-timothy-mellon-military-donor-government-shutdown.html",
    "timestamp": "2025-10-25T15:49:05Z"
  },
  {
    "title": "Late Night Hosts Went All In On Donald Trump's Already Infamous White House Ballroom Changes",
    "description": "Hosts aren't holding back on the renovation.",
    "link": "https://www.cinemablend.com/television/jimmy-fallon-stephen-colbert-seth-meyers-critiqued-donald-trump-white-house-ballroom-changes",
    "timestamp": "2025-10-25T15:48:22Z"
  },
  {
    "title": "Jennifer Lawrence Asked Robert Pattinson About Trump's 2013 Breakup Rant",
    "description": "Most millennials can, for better or worse, clearly recall the time now-president Donald Trump weighed in on Robert Pattinson and Kristen Stewart’s breakup scandal — and Jennifer Lawrence is no exception. “I mean, if you think I didn’t ask him about Donald Tru…",
    "link": "https://www.usmagazine.com/celebrity-news/news/jennifer-lawrence-asked-robert-pattinson-about-trumps-2013-breakup-rant/#article",
    "timestamp": "2025-10-25T15:46:45Z"
  },
  {
    "title": "Lewis Hamilton is \"forever grateful for the relationship\" he shares with once-rival Sebastian Vettel",
    "description": "Lewis Hamilton expressed his \"amazing relationship\" with former rival Sebastian Vettel, highlighting his empathy and all-around character. Despite Vettel's retirement in 2022, the two F1 legends remain close, staying in touch and supporting each other while a…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/lewis-hamilton-is-forever-grateful-for-the-relationship-he-shares-with-once-rival-sebastian-vettel/articleshow/124808931.cms",
    "timestamp": "2025-10-25T15:45:29Z"
  },
  {
    "title": "Elon Musk Wants $1 Trillion to Build a “Robot Army” at Tesla",
    "description": "The Take Back Tesla campaign is urging shareholders to reject Musk's proposed $1 trillion compensation package.",
    "link": "https://truthout.org/articles/elon-musk-wants-1-trillion-to-build-a-robot-army-at-tesla/",
    "timestamp": "2025-10-25T15:45:17Z"
  },
  {
    "title": "MSNBC guest pushes bizarre claim Trump plans to use military to kill any person he wants",
    "description": "Says president could use armed forces as his private army to target Americans",
    "link": "https://www.wnd.com/2025/10/5474304/",
    "timestamp": "2025-10-25T15:44:35Z"
  },
  {
    "title": "US, China Seek to Ease Tensions in 'Very Constructive' Malaysia Trade Talks",
    "description": "MOSCOW (Sputnik) - Saturday's trade talks between US and Chinese delegations in Malaysia were \"very constructive,\" a US Treasury Department spokesperson was quoted as saying by the Financial Times newspaper.",
    "link": "https://sputnikglobe.com/20251025/us-china-seek-to-ease-tensions-in-very-constructive-malaysia-trade-talks-1123015226.html",
    "timestamp": "2025-10-25T15:43:19Z"
  },
  {
    "title": "Venezuela In The Trump Administration’s Crosshairs: Will War Follow?",
    "description": "Venezuela's dictator Nicolas Maduro has landed himself in the crosshairs of the Trump administration, but war remains unlikely at this point in time",
    "link": "https://dailycaller.com/2025/10/25/venezuela-in-the-trump-administrations-crosshairs-will-war-follow/",
    "timestamp": "2025-10-25T15:43:00Z"
  },
  {
    "title": "Anonymous donor behind $130M troop payments revealed amid questions over legality",
    "description": "The identity of the anonymous donor who gave $130 million to the Trump administration to pay troops amid the ongoing government shutdown has been revealed to be reclusive billionaire Timothy Mellon\r\n, a donation that, according to a report from The New York T…",
    "link": "https://www.rawstory.com/government-shutdown-2674232858/",
    "timestamp": "2025-10-25T15:41:55Z"
  },
  {
    "title": "I am not done: Kamala Harris hints at another run for president, calls Trump a 'tyrant'",
    "description": "Former Vice President Kamala Harris indicated a potential 2028 presidential run, telling the BBC she is \"not done\" and confident a woman will lead the White House. She criticized Donald Trump as a \"tyrant\" and dismissed polls suggesting she's an outsider for …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/i-am-not-done-kamala-harris-hints-at-another-run-for-president-calls-trump-a-tyrant/articleshow/124808666.cms",
    "timestamp": "2025-10-25T15:39:54Z"
  },
  {
    "title": "Trump says he's willing to reduce tariffs on Brazil in right circumstances",
    "description": "President Donald Trump said on Friday he would consider reducing tariffs on Brazil, under the right circumstances. Trump was speaking on Air Force One...",
    "link": "https://www.yahoo.com/news/articles/trump-says-hes-willing-reduce-153740849.html",
    "timestamp": "2025-10-25T15:37:40Z"
  },
  {
    "title": "Bigg Boss Kannada 12: Kiccha Sudeep pulls up Cockroach Sudhi and Ashwini Gowda for using derogatory term against Rakshitha Shetty",
    "description": "Host Kiccha Sudeep reprimanded contestants Cockroach Sudhi and Ashwini Gowda for their disrespectful comments towards Rakshitha Shetty. Sudeep questioned Sudhi's use of the derogatory term 'sede' and Ashwini's repeated personal attacks, urging them to show ma…",
    "link": "https://timesofindia.indiatimes.com/tv/news/kannada/bigg-boss-kannada-12-kiccha-sudeep-pulls-up-cockroach-sudhi-and-ashwini-gowda-for-using-derogatory-term-against-rakshitha-shetty/articleshow/124808836.cms",
    "timestamp": "2025-10-25T15:37:40Z"
  },
  {
    "title": "MSNBC’s Jen Psaki Gets Defiant After Trump Pal’s Shocking Rant on 2028: ‘This Country Is Still A Democracy!’",
    "description": "Jen Psaki waxed defiant over Steve Bannon's rant about the inevitability of Trump remaining in power in 2028, declaring \"This country is still a democracy!\"\nThe post MSNBC’s Jen Psaki Gets Defiant After Trump Pal’s Shocking Rant on 2028: ‘This Country Is Stil…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-jen-psaki-gets-defiant-after-trump-pals-shocking-rant-on-2028-this-country-is-still-a-democracy/",
    "timestamp": "2025-10-25T15:36:28Z"
  },
  {
    "title": "To Lower Health Costs, Legalize Catastrophic Health Insurance Plans for All",
    "description": "Note: The following column is coauthored by Stephen Moore and David M. Simon.       ...",
    "link": "https://hotair.com/stephen-moore/2025/10/25/to-lower-health-costs-legalize-catastrophic-health-insurance-plans-for-all-n3808194",
    "timestamp": "2025-10-25T15:35:36Z"
  },
  {
    "title": "Donald Trump Issues Warning To Canada: 'I Can Play Dirtier'",
    "description": "Trump condemned ad by Ontario provincial government about President Ronald Reagan’ tariff policy.",
    "link": "https://biztoc.com/x/583ed7751dbf02c7",
    "timestamp": "2025-10-25T15:34:18Z"
  },
  {
    "title": "Trump Pitches Meeting With Kim Jong Un During Asia Tour: ‘Put Out the Word’ - The Wall Street Journal",
    "description": "Trump Pitches Meeting With Kim Jong Un During Asia Tour: ‘Put Out the Word’The Wall Street Journal Donald Trump says he wants to meet Kim Jong Un on Asia tripBBC Trump says he's 'open' to meeting with Kim Jong Un during Asia trip, North Korea is 'sort of a nu…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179870384",
    "timestamp": "2025-10-25T15:32:28Z"
  },
  {
    "title": "Caturday felid trifecta: Trump excoriates Republican Curtis Sliwa for his love of cats; cat survives 8,000-mile trip in shipping container; mountain lion movie; and lagniappe",
    "description": "If you didn’t dislike Trump before (I doubt we have anyone here who didn’t), this is the cherry on the Sundae of Hate. Trump has dissed Republican NYC mayor candidate Curtis Sliwa (misspelled “Curtin” in the story), because Sliwa has a well known love of cats…",
    "link": "https://whyevolutionistrue.com/2025/10/25/caturday-felid-trifecta-trump-excoriates-republican-curtis-sliwa-for-his-love-of-cats-cat-survives-8000-mile-trip-in-shipping-container-mountain-lion-movie-and-lagniappe/",
    "timestamp": "2025-10-25T15:30:26Z"
  },
  {
    "title": "As ballots are counted, misleading claims that the election was ‘rigged’ spread online",
    "description": "Spoiled votes and low turnout were cited to say the election should be re-run.",
    "link": "https://www.thejournal.ie/misleading-posts-spoilthevote-election-rigged-illegitimate-rerun-low-turnout-factcheck-6855692-Oct2025/",
    "timestamp": "2025-10-25T15:30:21Z"
  },
  {
    "title": "Trump Demolishes the East Wing",
    "description": "Panelists discuss what authority the president may have to dismantle the historic White House.",
    "link": "https://www.theatlantic.com/national/archive/2025/10/trump-east-wing-washington-week/684701/",
    "timestamp": "2025-10-25T15:29:45Z"
  },
  {
    "title": "Tulsi Gabbard Reveals How Trump Showed ‘His Seriousness’ Against The Cartels Who Ran Border Under Biden",
    "description": "Tulsi Gabbard noted during a Fox News interview that the capture of a Mexican drug cartel boss shows Trump's \"seriousness\" and that he is \"not messing around.\"",
    "link": "https://dailycaller.com/2025/10/25/tulsi-gabbard-donald-trump-serious-drug-cartels-border-joe-biden/",
    "timestamp": "2025-10-25T15:28:12Z"
  },
  {
    "title": "Trump’s Attack on Ontario’s Reagan Ad Helped Amplify Its Reach",
    "description": "In the global portfolio of political ads that changed history, a handful stand out.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-attack-on-ontarios-reagan-ad-helped-amplify-its-reach",
    "timestamp": "2025-10-25T15:26:51Z"
  },
  {
    "title": "Centre’s green policies hit by power tariff hike: Sardesai",
    "description": "Panaji: The Goa Forward Party (GFP) on Saturday criticised the Goa electricity department’s proposal to increase the nighttime power tariffs by 20%. G.",
    "link": "https://timesofindia.indiatimes.com/city/goa/centres-green-policies-hit-by-power-tariff-hike-sardesai/articleshow/124808708.cms",
    "timestamp": "2025-10-25T15:25:55Z"
  },
  {
    "title": "Depression off Goa coast triggers extreme rainfall",
    "description": "Panaji: A depression over the east-central Arabian Sea that moved barely 380km off the Goa coast triggered very heavy rainfall in some areas, as Canac.",
    "link": "https://timesofindia.indiatimes.com/city/goa/depression-off-goa-coast-triggers-extreme-rainfall/articleshow/124808661.cms",
    "timestamp": "2025-10-25T15:23:49Z"
  },
  {
    "title": "My Quest to Find the East Wing Rubble",
    "description": "An entire part of the White House can’t just disappear.",
    "link": "https://www.theatlantic.com/technology/2025/10/east-wing-rubble/684703/",
    "timestamp": "2025-10-25T15:23:36Z"
  },
  {
    "title": "Special courts in Maharashtra ease fraud pain, say return investor money first",
    "description": "Mumbai: A 36-year-old make-up artist, a 52-year-old cloth merchant, a 41-year-old tailor and a 65-year-old artist were together cheated of more than R.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/special-courts-in-maharashtra-ease-fraud-pain-say-return-investor-money-first/articleshow/124808569.cms",
    "timestamp": "2025-10-25T15:17:09Z"
  },
  {
    "title": "Bicholim electricity bldg demolished; ₹10cr project planned",
    "description": "Bicholim: The old Bicholim electricity department building, which was on the verge of collapse, has been demolished. A new building costing around Rs .",
    "link": "https://timesofindia.indiatimes.com/city/goa/bicholim-electricity-bldg-demolished-10cr-project-planned/articleshow/124808558.cms",
    "timestamp": "2025-10-25T15:16:58Z"
  },
  {
    "title": "Trump: Anonymous Friend Donated $130 Million to Pay Troops During Democrat Government Shutdown",
    "description": "An anonymous donor gave $130 million to the U.S. Department of War to pay troops during the Democrats' government shutdown.\nThe post Trump: Anonymous Friend Donated $130 Million to Pay Troops During Democrat Government Shutdown appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/25/trump-anonymous-friend-donated-130-million-to-pay-troops-during-democrat-government-shutdown/",
    "timestamp": "2025-10-25T15:16:35Z"
  },
  {
    "title": "Pati Patni Aur Panga: Shehnaaz Gill says a guy who makes fun of her is a green flag, Swara Bhaskar calls it a red flag in a hilarious face-off",
    "description": "Shehnaaz Gill's appearance on Pati Patni Aur Panga led to a hilarious moment when she agreed with Fahad Ahmad's take on husbands teasing wives, leaving Swara Bhasker surprised. Despite the playful disagreement, Swara protected Shehnaaz from a smoke bomb, crea…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/pati-patni-aur-panga-shehnaaz-gill-says-a-guy-who-makes-fun-of-her-is-a-green-flag-swara-bhaskar-calls-it-a-red-flag-in-a-hilarious-face-off/articleshow/124807140.cms",
    "timestamp": "2025-10-25T15:14:05Z"
  },
  {
    "title": "This is India’s strategy in the face of Trump’s Russia sanctions",
    "description": "New Delhi signals quiet defiance of US attempts to dictate its oil and trade policies. Read Full Article at RT.com",
    "link": "https://www.rt.com/india/626952-trump-india-sanctions-rosneft/",
    "timestamp": "2025-10-25T15:13:51Z"
  },
  {
    "title": "New Report Identifies Trump 'Friend' Who Gave $130 Million For Military Pay",
    "description": "President Donald Trump previously described the donor as a \"friend of mine\" and a \"patriot.\"",
    "link": "https://www.huffpost.com/entry/donor-military-pay-timothy-mellon_n_68fce54ae4b0bc7dc6202a23",
    "timestamp": "2025-10-25T15:09:54Z"
  },
  {
    "title": "Serbian foreign minister proposes hosting Ukraine-Russia peace negotiations amid ongoing conflict",
    "description": "Serbian Foreign Minister Marko Djuric offers to host Ukraine-Russia peace talks, citing Serbia's friendship with all parties involved in the conflict.",
    "link": "https://www.foxnews.com/world/serbian-foreign-minister-proposes-hosting-ukraine-russia-peace-negotiations-amid-ongoing-conflict",
    "timestamp": "2025-10-25T15:09:21Z"
  },
  {
    "title": "Welcome to Hotel Hamas: 150 dangerous terrorists released by Israel under Gaza peace deal are staying at five-star luxury resort alongside unsuspecting Western tourists",
    "description": "Hamas terrorists released under the Gaza peace deal are staying in a five-star hotel alongside unsuspecting Western tourists. Experts warned of a radical new threat to global security after the Daily Mail tracked down more than 150 of the highly dangerous ext…",
    "link": "https://freerepublic.com/focus/f-news/4348552/posts",
    "timestamp": "2025-10-25T15:08:53Z"
  },
  {
    "title": "Klobuchar: Trump Ballroom Literally a 'Wrecking Ball to Our Democracy'",
    "description": "Friday on MSNBC's \"The Weeknight,\" Sen. Amy Klobuchar (D-MN) said President Donald Trump's White House ballroom project was \"a wrecking ball to our democracy.\"\nThe post Klobuchar: Trump Ballroom Literally a ‘Wrecking Ball to Our Democracy’ appeared first on B…",
    "link": "https://www.breitbart.com/clips/2025/10/25/klobuchar-trump-ballroom-literally-a-wrecking-ball-to-our-democracy/",
    "timestamp": "2025-10-25T15:05:49Z"
  },
  {
    "title": "Mumbai: Two on bike killed in highway ambulance collision in Palghar district, driver booked",
    "description": "Palghar: Two men were killed on the spot in a road accident at Nilmati village in Mokhada taluka, Palghar district, late Friday night. The collision o.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-two-on-bike-killed-in-highway-ambulance-collision-in-palghar-district-driver-booked/articleshow/124808431.cms",
    "timestamp": "2025-10-25T15:05:09Z"
  },
  {
    "title": "Tom Nichols Claims On MSNBC Trump Using Military To ‘Kill’ Anyone He Wants",
    "description": "The Atlantic's Tom Nichols accused Trump of using the military to \"kill anyone\" he wants and claimed that authority could be used by him to remain in.\nThe post Tom Nichols Claims On MSNBC Trump Using Military To ‘Kill’ Anyone He Wants first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/tom-nichols-claims-on-msnbc-trump-using-military-to-kill-anyone-he-wants/",
    "timestamp": "2025-10-25T15:03:48Z"
  },
  {
    "title": "Indonesian President, Thai PM arrive in Malaysia ahead of 47th Asean Summit",
    "description": "SUBANG: Thailand Prime Minister Anutin Charnvirakul arrived in Malaysia on Saturday Night (Oct 25) to attend the 47th ASEAN Summit and Related Summits, to be held from Oct 26 to 28 at the Kuala Lumpur Convention Centre. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/25/indonesian-president-thai-pm-arrive-in-malaysia-ahead-of-47th-asean-summit",
    "timestamp": "2025-10-25T15:02:00Z"
  },
  {
    "title": "Dogecoin Price Macro Target Remains Above $2, And The Market Crash Hasn’t Changed It",
    "description": "Crypto analyst Hov has stated that the macro target for the Dogecoin price remains unchanged despite the recent crypto market crash. This comes as DOGE looks to reclaim the psychological $0.2 level, which could spark a significant rebound for the meme coin.  …",
    "link": "http://www.newsbtc.com/news/dogecoin/dogecoin-macro-target-above-2/",
    "timestamp": "2025-10-25T15:00:43Z"
  },
  {
    "title": "Ripple Joins Major Stakeholders In Published White House List As XRP Rebounds",
    "description": "Ripple has been listed alongside major firms as those who donated to a White House project. This comes as XRP rebounds, recording significant gains today. Ripple Among Big Tech Firms That Donate To White House Project XRP influencer Pumpius shared in an X pos…",
    "link": "https://bitcoinist.com/ripple-joins-major-stakeholders/",
    "timestamp": "2025-10-25T15:00:42Z"
  },
  {
    "title": "Newsmax Guys Wax Nostalgic For Days When 'Being A Woman' Was A Legit 'Pre-Existing Condition'",
    "description": "Thanks for reminding us how gross that was, fellas!",
    "link": "https://www.wonkette.com/p/newsmax-guys-wax-nostalgic-for-days",
    "timestamp": "2025-10-25T15:00:25Z"
  },
  {
    "title": "‘SNL’s’ Most Legendary Writer Speaks: Jim Downey on What Makes Trump Jokes Funny, Improvising That Jeffrey Epstein Bit and the ‘SNL’ Sketch He Still Wants to Make",
    "description": "In comedy, few are as influential — and elusive — as Jim Downey. During his 30-year tenure as a writer on “Saturday Night Live,” he penned era-defining sketches like Chris Farley’s “Chippendales Audition” and defined the show’s political satire with Dana Carv…",
    "link": "https://variety.com/2025/tv/news/jim-downey-snl-trump-jeffrey-epstein-obaa-1236561159/",
    "timestamp": "2025-10-25T15:00:00Z"
  },
  {
    "title": "Trump says he will ask Chinese president to release Jimmy Lai: ‘It’s on my list’",
    "description": "U.S. President Donald Trump boards Air Force One on Oct. 24, 2025, at Joint Base Andrews, Maryland. Trump is traveling to Malaysia for the Association of Southeast Asian Nations summit (ASEAN), Japan, and to South Korea for the Asia-Pacific Economic Cooperati…",
    "link": "https://www.catholicnewsagency.com/news/267405/trump-on-asking-chinese-president-to-release-jimmy-lai-its-on-my-list",
    "timestamp": "2025-10-25T15:00:00Z"
  },
  {
    "title": "Trump Officials Pledge to ‘Protect Unborn Life at All Stages’",
    "description": "Trump administration officials committed to “protect unborn life at all stages” at the five-year anniversary event of a 40-nation coalition of countries that declare that... Read More\nThe post Trump Officials Pledge to ‘Protect Unborn Life at All Stages’ appe…",
    "link": "https://www.dailysignal.com/2025/10/25/trump-admin-congress-celebrate-five-years-declaration-establishing-global-right-life/",
    "timestamp": "2025-10-25T15:00:00Z"
  },
  {
    "title": "U.S. Elections 2025: New York City mayor, New Jersey governor, Virginia governor election: Early voting begins, check candidates, favourites",
    "description": "The off-year elections in the U.S could be bellwethers for Democratic Party leaders as they try to decide what kinds of candidates might be best to lead their resistance to Republican President Donald Trump ’s agenda.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-election-2025-new-york-city-mayor-new-jersey-governor-virginia-governor-election-early-voting-begins-check-candidates-favourites/articleshow/124808303.cms",
    "timestamp": "2025-10-25T14:57:24Z"
  },
  {
    "title": "Majority of GOP voters worried about surging health care costs amid shutdown fight: report",
    "description": "Twenty-four days into the second-longest government shutdown in US history, yet another poll revealed a rising majority of voters across the political spectrum are concerned about skyrocketing health insurance premiums.Data for Progress and Groundwork Collabo…",
    "link": "https://www.rawstory.com/obamacare-2674232815/",
    "timestamp": "2025-10-25T14:55:26Z"
  },
  {
    "title": "Tilak Varma opens up about rare muscle disorder in 2022",
    "description": "India's young cricketer Tilak Varma revealed a severe health scare in 2022 after being diagnosed with rhabdomyolysis, a condition caused by rapid muscle breakdown due to overtraining. The incident led to hospitalization and a critical health warning, but Varm…",
    "link": "https://timesofindia.indiatimes.com/entertainment/telugu/movies/news/tilak-varma-opens-up-about-rare-muscle-disorder-in-2022/articleshow/124808304.cms",
    "timestamp": "2025-10-25T14:55:17Z"
  },
  {
    "title": "Kamala Harris hints she is ready to run again for US president (Louise Guillot/Politico)",
    "description": "Louise Guillot / Politico:\nKamala Harris hints she is ready to run again for US president  —  The Democratic Party hopeful, who lost to Donald Trump in 2024, told the BBC she is “not done” with politics.  —  Former United States Vice President Kamala Harris s…",
    "link": "https://www.memeorandum.com/251025/p27",
    "timestamp": "2025-10-25T14:55:00Z"
  },
  {
    "title": "Japan PM Sanae Takaichi says she has a 'candid' conversation with Trump",
    "description": "Japan's Prime Minister Sanae Takaichi said she spoke with US President Donald Trump on Saturday, just days before a planned visit to Tokyo on a regional tour. Takaichi, who assumed office this week, said in a post on X that she \"had a good and candid conversa…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/japan-pm-sanae-takaichi-says-she-has-a-candid-conversation-with-trump/articleshow/124808300.cms",
    "timestamp": "2025-10-25T14:53:42Z"
  },
  {
    "title": "‘I am not done’: Kamala Harris suggests she may run for US president again",
    "description": "Former vice-president dismisses placing her as an outsider to win a place on Democratic White House ticket for 2028",
    "link": "https://www.irishtimes.com/world/us/2025/10/25/i-am-not-done-kamala-harris-suggests-she-may-run-for-us-president-again/",
    "timestamp": "2025-10-25T14:50:36Z"
  },
  {
    "title": "Glen Powell defends Sydney Sweeney over culture-war backlash against ‘good jeans’ ad",
    "description": "Sweeney’s ‘great jeans’ advert for American Eagle was accused of using eugenic language",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/glen-powell-sydney-sweeney-american-eagle-jeans-b2852146.html",
    "timestamp": "2025-10-25T14:50:07Z"
  },
  {
    "title": "Christian state of Jerusalem is needed – ex-Trump adviser",
    "description": "Steve Bannon has argued that a “three-state solution” is needed to end the war in Gaza for good, with one of them being a “Christian state” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626951-bannon-gaza-christian-state/",
    "timestamp": "2025-10-25T14:46:49Z"
  },
  {
    "title": "Kamala Harris Says She’d ‘Possibly’ Run For President Again: ‘I Am Not Done’",
    "description": "Harris made the comments in an interview with the BBC while stopping in London for her book tour.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/25/kamala-harris-says-shed-possibly-run-for-president-again-i-am-not-done/",
    "timestamp": "2025-10-25T14:46:40Z"
  },
  {
    "title": "Russia seeks \"final solution,\" not just ceasefire, says Putin aide",
    "description": "Russia desires a complete resolution to the Ukraine conflict, not merely a temporary truce. Top Russian envoy Kirill Dmitriev suggests Moscow, Washington, and Kyiv are nearing a diplomatic breakthrough. Talks focus on preventing future fighting. President Tru…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-seeks-final-solution-not-just-ceasefire-says-putin-aide/articleshow/124808166.cms",
    "timestamp": "2025-10-25T14:45:22Z"
  },
  {
    "title": "DAVID MARCUS: LA museum’s desecration of Confederate statues is pure barbarism",
    "description": "Controversial Los Angeles art exhibit displays removed Confederate statues, some covered in graffiti and one mutilated into a monster, sparking debate over historical monuments.",
    "link": "https://www.foxnews.com/opinion/david-marcus-la-museums-desecration-confederate-statues-pure-barbarism",
    "timestamp": "2025-10-25T14:42:39Z"
  },
  {
    "title": "Melania Trump has been silent on demolition of the East Wing, home to first ladies for decades",
    "description": "As the walls come down on the part of the White House that’s been synonymous with American first ladies for decades, Melania Trump has remained silent. The first lady has not publicly spoken about the demolition of the East Wing, which has served as the headq…",
    "link": "https://freerepublic.com/focus/f-news/4348546/posts",
    "timestamp": "2025-10-25T14:42:24Z"
  },
  {
    "title": "Doctor says U.S. targeting of underserved groups, trans health factored into Manitoba move",
    "description": "Another American doctor is citing the current political climate in the U.S. as a reason why he decided to come work in Manitoba.",
    "link": "https://www.cbc.ca/news/canada/manitoba/us-doctor-recruitment-efforts-trump-new-klinic-physician-9.6953423",
    "timestamp": "2025-10-25T14:40:08Z"
  },
  {
    "title": "Hunter Biden Says Trump ‘Wants There To Be Violence’ — Has ‘No Intention Of Leaving’ Power",
    "description": "Hunter Biden said President Donald Trump \"has no intention of leaving in three years\" and that he\"wants there to be violence\" to help him stay in power.\nThe post Hunter Biden Says Trump ‘Wants There To Be Violence’ — Has ‘No Intention Of Leaving’ Power first …",
    "link": "https://www.mediaite.com/online/hunter-biden-says-trump-wants-there-to-be-violence-has-no-intention-of-leaving-power/",
    "timestamp": "2025-10-25T14:36:24Z"
  },
  {
    "title": "Europe’s Neo-Con Moment - EU Summit Fals To Get Tough Enough",
    "description": "Last week’s EU Summit in Copenhagen heralds the need for shift towards a tougher European stance on Russia, the time has come for Europe to have its neo-con moment,",
    "link": "https://www.forbes.com/sites/mikeosullivan/2025/10/25/europes-neo-con-momenteu-summit-fals-to-get-tough-enough/",
    "timestamp": "2025-10-25T14:31:52Z"
  },
  {
    "title": "Can The Media Regain Trust In Age Of AI And Misinformation? NAB Grapples With Loaded Question",
    "description": "The NAB Show is known in large part as a bonanza for tech geeks and engineers, and its New York edition last week was no exception. But the broadcast industry lobbying group made a statement by foregrounding discussion of a central challenge for its members: …",
    "link": "http://deadline.com/2025/10/trust-in-media-ai-misinformation-tv-nab-show-1236596313/",
    "timestamp": "2025-10-25T14:30:00Z"
  },
  {
    "title": "Rapid Fire With NYC Mayoral Candidates",
    "description": "The contest for who will lead New York City come Jan. 1 has become one of the most closely watched races in the US — a possible bellwether for the future of the Democratic party on issues of affordability, Israel and how best to handle President Donald Trump.…",
    "link": "https://biztoc.com/x/91dbb7337634b920",
    "timestamp": "2025-10-25T14:28:06Z"
  },
  {
    "title": "Ireland: Left-wing Connolly wins presidential election",
    "description": "Catherine Connolly, an independent leftist candidate, has won by a landslide in a poll marred by low turnout and spoiled ballots. Her victory is a damning verdict for Ireland's center-right coalition government. Catherine Connolly has won Ireland's presidenti…",
    "link": "https://www.dw.com/en/ireland-left-wing-connolly-wins-presidential-election/a-74496453",
    "timestamp": "2025-10-25T14:26:00Z"
  },
  {
    "title": "Trump's ceasefire plan should be an opportunity to end starvation in Gaza (MSNBC)",
    "description": "MSNBC:\nTrump's ceasefire plan should be an opportunity to end starvation in Gaza  —  The Gaza ceasefire plan means whatever President Donald Trump says it means.  His envoys need to focus on ending the mass starvation of Palestinians.  —  Secretary of State M…",
    "link": "https://www.memeorandum.com/251025/p21",
    "timestamp": "2025-10-25T14:25:03Z"
  },
  {
    "title": "Kamala Harris hints at bold 2028 presidential run",
    "description": "A door left open for the future Kamala Harris is keeping her political ambitions alive, telling the BBC in her first UK interview that she may pursue the presidency again. The former vice president made her strongest indication yet that she’s considering a 20…",
    "link": "https://rollingout.com/2025/10/25/kamala-harris-2028-presidential-run/",
    "timestamp": "2025-10-25T14:21:25Z"
  },
  {
    "title": "Kamala Harris hints she is ready to run again for US president",
    "description": "The Democratic Party hopeful, who lost to Donald Trump in 2024, told the BBC she is \"not done\" with politics.",
    "link": "https://www.politico.eu/article/kamala-harris-ready-run-again-us-president/",
    "timestamp": "2025-10-25T14:15:38Z"
  },
  {
    "title": "The nation’s community health centers face money troubles",
    "description": "Half of community health centers have fewer than 90 days of cash on hand.",
    "link": "https://www.bostonherald.com/2025/10/25/community-health-centers-money-trouble/",
    "timestamp": "2025-10-25T14:10:24Z"
  },
  {
    "title": "Trump Humiliates Mike Johnson Behind Closed Doors",
    "description": "Inside sources reportedly say Donald Trump has been heard privately joking about just how easily he believes he’s able to puppeteer House Speaker Mike...",
    "link": "https://www.thedailybeast.com/president-donald-trump-humiliates-house-speaker-mike-johnson-behind-closed-doors/",
    "timestamp": "2025-10-25T14:08:32Z"
  },
  {
    "title": "Trump Triumphs as Walmart Suspends H-1B Visas Hires – Retailer’s Current H-1B Program So Big It Would Have Cost $240 Million",
    "description": "Who knew that Walmart, of all places, would prove the wisdom and justice of President Donald Trump’s economic policies? According to Bloomberg, the retailing giant has suspended all job offers to candidates whose employment with the chain would require a $100…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348543/posts",
    "timestamp": "2025-10-25T14:08:26Z"
  },
  {
    "title": "Trump Triumphs as Walmart Suspends H-1B Visas Hires – Retailer’s Current H-1B Program So Big It Would Have Cost $240 Million",
    "description": "Who knew that Walmart, of all places, would prove the wisdom and justice of President Donald Trump’s economic policies? According to Bloomberg, the retailing giant has suspended all job offers to candidates whose employment with the chain would require a $100…",
    "link": "https://freerepublic.com/focus/f-news/4348543/posts",
    "timestamp": "2025-10-25T14:08:26Z"
  },
  {
    "title": "A gold crash everyone saw coming lures bargain hunters worldwide",
    "description": "Gold prices experienced a significant plunge of 6.3% this week, marking the largest drop since 2013. Despite professional traders expressing concerns about an \"overcrowded trade,\" retail investors in Bangkok, Singapore, and the US rushed to buy the dip. This …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-gold-crash-everyone-saw-coming-lures-bargain-hunters-worldwide/articleshow/124807628.cms",
    "timestamp": "2025-10-25T14:05:53Z"
  },
  {
    "title": "Trump’s epic meltdown sparked by one Canadian video — here’s what set him off",
    "description": "President Trump got upset over a Canadian ad about his tariffs. The ad used old Reagan clips and said tariffs hurt jobs and prices. Trump called it fake and stopped trade talks with Canada. Ontario said trade with Canada helps Americans. The ad caused a big r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-epic-meltdown-sparked-by-one-canadian-video-heres-what-set-him-off/articleshow/124807251.cms",
    "timestamp": "2025-10-25T14:04:48Z"
  },
  {
    "title": "Bloody letters and battlefield art: Russian museum's tribute to North Korean soldiers in Ukraine",
    "description": "Russia is celebrating troops from North Korea who fought alongside its forces in Ukraine in a new display at Moscow's Museum of Victory.",
    "link": "https://www.nbcnews.com/world/russia/russia-ukraine-war-north-korea-putin-kim-moscow-museum-victory-rcna239528",
    "timestamp": "2025-10-25T14:03:49Z"
  },
  {
    "title": "Early voting begins today for mayor and other NYC races",
    "description": "New Yorkers get to choose the city’s next mayor when early voting kicks off Saturday ahead of the Nov. 4 general election -- and, in the process, whether the so-called \"capital of capitalism\" should be led by a socialist.",
    "link": "https://nypost.com/2025/10/25/us-news/early-voting-begins-today-for-mayor-and-other-nyc-races/",
    "timestamp": "2025-10-25T14:03:14Z"
  },
  {
    "title": "Democrats Post Support for Tish James Amid Arraignment on Federal Mortgage Fraud Charges",
    "description": "\"This is about all of us, and about a justice system which has been weaponized. A justice system which has been used as a tool of revenge. [...] And a justice system which unfortunately is being used as a vehicle of retribution. \"\nThe post Democrats Post Supp…",
    "link": "https://legalinsurrection.com/2025/10/democrats-post-support-for-tish-james-amid-arraignment-on-federal-mortgage-fraud-charges/",
    "timestamp": "2025-10-25T14:00:58Z"
  },
  {
    "title": "Potential 2028 contender campaigns for Spanberger in key Tidewater area",
    "description": "Pennsylvania governor Josh Shapiro campaigns for Virginia's Abigail Spanberger as 2028 presidential speculation grows around the Democratic rising star.",
    "link": "https://www.foxnews.com/politics/potential-2028-contender-campaigns-spanberger-key-tidewater-area",
    "timestamp": "2025-10-25T14:00:52Z"
  },
  {
    "title": "More Bad News Comes for Planned Parenthood in Ohio",
    "description": "Planned Parenthood facilities in Ohio have been affected by the One Big Beautiful Bill Act, which President Donald Trump signed into law on July 4.... Read More\nThe post More Bad News Comes for Planned Parenthood in Ohio appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/25/more-bad-news-comes-for-planned-parenthood-in-ohio/",
    "timestamp": "2025-10-25T14:00:00Z"
  },
  {
    "title": "Jeremy Strong Loves Figuring Out Real People, from Mark Zuckerberg to Jon Landau in ‘Springsteen: Deliver Me from Nowhere’",
    "description": "His quiet role as Bruce Springsteen's manager in Scott Cooper's just-opened biopic could land the \"Succession\" Emmy winner a second Supporting Actor Oscar nomination.",
    "link": "https://www.indiewire.com/features/interviews/jeremy-strong-springsteen-mark-zuckerberg-interview-1235157420/",
    "timestamp": "2025-10-25T14:00:00Z"
  },
  {
    "title": "Trump’s Hidden War with China Could Make Americans Rich",
    "description": "Former CIA advisor Jim Rickards reveals how Trump’s mineral offensive could ignite a $150 trillion American boom Former CIA advisor Jim Rickards reveals how Trump’s mineral offensive could ignite a $150 trillion American boom",
    "link": "https://www.globenewswire.com/news-release/2025/10/25/3174153/0/en/Trump-s-Hidden-War-with-China-Could-Make-Americans-Rich.html",
    "timestamp": "2025-10-25T14:00:00Z"
  },
  {
    "title": "Trump Accuses ‘Fake News’ Of Falsely Reporting He Wants To Name Ballroom After Himself",
    "description": "President Donald Trump accused the \"fake news\" of falsely reporting that he's considering naming the planned White House ballroom after himself.\nThe post Trump Accuses ‘Fake News’ Of Falsely Reporting He Wants To Name Ballroom After Himself first appeared on …",
    "link": "https://www.mediaite.com/media/news/trump-accuses-fake-news-of-falsely-reporting-he-wants-to-name-ballroom-after-himself/",
    "timestamp": "2025-10-25T13:58:49Z"
  },
  {
    "title": "US deploys aircraft carrier to Caribbean as war fears rise",
    "description": "The US Pentagon has ordered an aircraft carrier strike group to the Caribbean, saying it aims to counter drug cartels. But Venzuelan leader Nicolas Maduro says the US military buildup in the region is a war threat. The US government has ordered the aircraft c…",
    "link": "https://www.dw.com/en/us-deploys-aircraft-carrier-to-caribbean-as-war-fears-rise/a-74495957",
    "timestamp": "2025-10-25T13:58:00Z"
  },
  {
    "title": "Rajesh Kumar mourns Sarabhai vs Sarabhai's on-screen father Satish Shah’s demise; says 'Feels like I have lost my father'",
    "description": "Veteran actor and comedian Satish Shah has passed away at the age of 74 due to kidney failure. His friend Ashoke Pandit confirmed the news, highlighting the immense loss to the industry. Rajesh Kumar, who played his son Roshesh in 'Sarabhai vs Sarabhai', expr…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/rajesh-kumar-mourns-sarabhai-vs-sarabhais-on-screen-father-satish-shahs-demise-says-feels-like-i-have-lost-my-father/articleshow/124804719.cms",
    "timestamp": "2025-10-25T13:57:23Z"
  },
  {
    "title": "Niemöller Was Wrong: When They Came for the Communists, People Didn’t Just Stay Silent",
    "description": "It’s one of the most rousing calls to conscience to come out of the 20th century. I’m thinking of Martin Niemöller’s “First they came for the communists.”You know how it goes. It begins, “First they came for the communists, and I did not speak out because I w…",
    "link": "https://www.commondreams.org/opinion/liberal-appeasement-fascism",
    "timestamp": "2025-10-25T13:56:02Z"
  },
  {
    "title": "What Ireland's New President Has Said About Donald Trump",
    "description": "Leftwing independent Catherine Connolly has been elected Ireland’s head of state.",
    "link": "https://biztoc.com/x/beaf096a6b050ded",
    "timestamp": "2025-10-25T13:54:53Z"
  },
  {
    "title": "Early Voting Begins In NYC Mayor's Race And New Jersey's Governor's Race",
    "description": "Early voting is already underway in other states.",
    "link": "https://www.huffpost.com/entry/early-voting-begins-nyc-mayors-race-and-contest-pick-new-jerseys-governor_n_68fcd44fe4b011e808868377",
    "timestamp": "2025-10-25T13:54:52Z"
  },
  {
    "title": "‘Diplomatic solution’ to end Ukraine war in sight, Russian envoy says",
    "description": "Kirill Dmitriev, Putin’s special presidential representative, is set to meet with Trump's envoy Steve Witkoff on Saturday in Florida.",
    "link": "https://www.politico.eu/article/diplomatic-solution-end-war-ukraine-russia-envoy-kirill-dmitriev/",
    "timestamp": "2025-10-25T13:54:51Z"
  },
  {
    "title": "U.S. Sanctions Colombian President Gustavo Petro",
    "description": "State of the Union: The move is part of a broader assertion of U.S. influence in the region.\nThe post U.S. Sanctions Colombian President Gustavo Petro appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/u-s-sanctions-colombian-president-gustavo-petro/",
    "timestamp": "2025-10-25T13:52:54Z"
  },
  {
    "title": "This deep-red state will suffer the most from callous new MAGA policy: report",
    "description": "After almost a month, the partial shutdown of the United States' federal government drags on. And the issue that, more than anything else, is fueling the standoff between GOP and Democratic lawmakers is subsidies for the Affordable Care Act of 2010, a.k.a. Ob…",
    "link": "https://www.rawstory.com/maga-2674232704/",
    "timestamp": "2025-10-25T13:52:19Z"
  },
  {
    "title": "Bitwise CEO Reacts as LinkedIn Founder Buys a CryptoPunk",
    "description": "Hunter Horsley, Bitwise CEO, took to X to highlight that several crypto holders have begun to reveal themselves in recent times. In light of this new trend, ...",
    "link": "https://www.coinspeaker.com/bitwise-ceo-reacts-as-linkedin-founder-buys-a-cryptopunk/",
    "timestamp": "2025-10-25T13:51:06Z"
  },
  {
    "title": "More arrests are coming in NBA betting scandal",
    "description": "Sports pundits and other members of the media are sure that the current arrests on the illegal gambling and betting scandal in the NBA represent the “tip of the iceberg.” The “fear” from the potential fallout of the investigations came after FBI Director Kash…",
    "link": "https://rollingout.com/2025/10/25/more-arrests-coming-nba-betting-scandal/",
    "timestamp": "2025-10-25T13:45:23Z"
  },
  {
    "title": "The Longer The Shutdown Lasts, The Better",
    "description": "We have no idea how the government shutdown, now in its fourth week and the second longest in history, will end, or how. But what is increasingly clear is how badly Democrats miscalculated on this one. Consider three bits of news from this week: First, the sh…",
    "link": "https://freerepublic.com/focus/f-chat/4348539/posts",
    "timestamp": "2025-10-25T13:45:21Z"
  },
  {
    "title": "‘Come home, let's create strong Bharat’: Zoho's Sridhar Vembu urges immigrants",
    "description": "Zoho's Sridhar Vembu urged immigrants to come back to India as the nation has the potential to become a strong and prosperous country. Here's what the multinational tech company founder said…",
    "link": "https://www.livemint.com/companies/people/come-home-lets-create-strong-bharat-zohos-sridhar-vembu-urges-immigrants-11761393536447.html",
    "timestamp": "2025-10-25T13:44:59Z"
  },
  {
    "title": "Shutdowns began as a way to enforce federal law. Now Trump is using it to take more power",
    "description": "A prolonged government shutdown is giving President Donald Trump unprecedented power. Historically, shutdowns aimed to enforce federal law. Now, Trump uses the funding lapse to target political opponents and reshape the federal budget. This approach is harden…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/shutdowns-began-as-a-way-to-enforce-federal-law-now-trump-is-using-it-to-take-more-power/articleshow/124807424.cms",
    "timestamp": "2025-10-25T13:44:16Z"
  },
  {
    "title": "Bill Maher's Reaction to Trump's Ballroom: 'Kind of Jealous'",
    "description": "Comedian Bill Maher joked on Friday night that he was “kind of jealous” of the speed with which President Donald Trump got the East Wing of the White House demolished, though he also warned: “The symbolism is he’s not leaving; that’s what bothered me about it…",
    "link": "https://biztoc.com/x/ba41484b5391479d",
    "timestamp": "2025-10-25T13:44:05Z"
  },
  {
    "title": "Donald Trump deploys nuclear aircraft carrier USS Gerald R. Ford in Latin America as U.S. waging 'war' against Colombia, Venezuela",
    "description": "USS Gerald R. Ford is the first ship in a new class of aircraft carriers named for former President Gerald R. Ford, who served on a carrier during World War II.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-deploys-nuclear-aircraft-carrier-uss-gerald-r-ford-in-latin-america-as-u-s-waging-war-against-colombia-venezuela/articleshow/124807363.cms",
    "timestamp": "2025-10-25T13:43:34Z"
  },
  {
    "title": "X: The CEO of the “North American Punjabi Trucking Association” fears some of his drivers will quit trucking, as they’re “not feeling safe” amid political backlash",
    "description": "johnny maga @_johnnymaga The CEO of the “North American Punjabi Trucking Association” fears some of his drivers will quit trucking, as they’re “not feeling safe” amid political backlash in the aftermath of two horrific deadly crashes in recent weeks. I wish I…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348538/posts",
    "timestamp": "2025-10-25T13:43:01Z"
  }
]