[
  {
    "title": "Pound hits 2021 high against dollar as Trump eyes new Fed boss",
    "description": "The dollar deepened losses against the pound Thursday after President Donald Trump lined up candidates to succeed Federal Reserve boss Jerome Powell, fuelling bets of cuts to US interest rates.",
    "link": "https://economictimes.indiatimes.com/markets/forex/pound-hits-2021-high-against-dollar-as-trump-eyes-new-fed-boss/articleshow/122088299.cms",
    "timestamp": "2025-06-26T09:15:45Z"
  },
  {
    "title": "Britain to purchase 12 nuclear weapons-capable F-35 jets from U.S.",
    "description": "Washington DC (UPI) Jun 25, 2025 \n\n\n Britain is purchasing at least a dozen F-35A fighter jets capable of carrying nuclear weapons from the United States and will be joining NATO's dual-capable aircraft nuclear mission. \n Prime Minister Keir Starmer is expect…",
    "link": "https://www.spacewar.com/reports/Britain_to_purchase_12_nuclear_weapons-capable_F-35_jets_from_US_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Iran lawmakers back suspending cooperation with UN nuclear watchdog",
    "description": "Tehran (AFP) June 25, 2025\n\n Iranian lawmakers voted Wednesday in favour of suspending cooperation with the United Nations' nuclear watchdog, state TV said, after a 12-day war that saw Israeli and US strikes on nuclear facilities. \n\n\"The International Atomic …",
    "link": "https://www.spacewar.com/reports/Iran_lawmakers_back_suspending_cooperation_with_UN_nuclear_watchdog_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "What does NATO's 5% spending deal really mean?",
    "description": "The Hague (AFP) June 25, 2025\n\n\n NATO leaders are set to sign off Wednesday at their Hague summit on a defence spending pledge to satisfy US President Donald Trump's demand for a headline figure of five percent of GDP. \n\nHere are the details of what NATO is s…",
    "link": "https://www.spacewar.com/reports/What_does_NATOs_5_spending_deal_really_mean_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "China hosts Iranian, Russian defence ministers against backdrop of 'momentous change'",
    "description": "Qingdao, China (AFP) June 26, 2025\n\n\n China hosted defence ministers from Iran and Russia for a meeting in its eastern seaside city of Qingdao on Thursday against the backdrop of war in the Middle East and a summit of NATO countries in Europe that agreed to b…",
    "link": "https://www.spacewar.com/reports/China_hosts_Iranian_Russian_defence_ministers_against_backdrop_of_momentous_change_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Mexico president threatens to sue over SpaceX rocket debris",
    "description": "Mexico City (AFP) June 25, 2025\n\n\n Mexican President Claudia Sheinbaum on Wednesday threatened legal action over falling debris and contamination from billionaire Elon Musk's SpaceX rocket launches across the border in the United States. \n\nMexico's government…",
    "link": "https://www.spacedaily.com/reports/Mexico_president_threatens_to_sue_over_SpaceX_rocket_debris_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Trump, White House hit back at leaked Iran nuclear facilities report",
    "description": "Washington DC (UPI) Jun 26, 2025 \n\n\n President Donald Trump and his administration have come out in force to support his claim that last weekend's bombing completely destroyed Iranian nuclear facilities after a leaked preliminary U.S. intelligence report foun…",
    "link": "https://www.spacewar.com/reports/Trump_White_House_hit_back_at_leaked_Iran_nuclear_facilities_report_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Iran willing to return to talks as ceasefire with Israel takes hold",
    "description": "Tehran (AFP) June 24, 2025\n\n\n Iran said on Tuesday that it was ready to return to negotiations with the United States, as a fragile ceasefire in its war with Israel took hold after 12 days of strikes that pummelled the Islamic republic's nuclear facilities. \n…",
    "link": "https://www.spacewar.com/reports/Iran_willing_to_return_to_talks_as_ceasefire_with_Israel_takes_hold_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "NATO chief: US 'totally committed' to collective defence pledge",
    "description": "The Hague (AFP) June 25, 2025\n\n\n NATO Secretary General Mark Rutte said on Wednesday that the United States was \"totally committed\" to the alliance's mutual defence clause, after President Donald Trump appeared to cast doubt on it. \n\n\"For me, there is absolut…",
    "link": "https://www.spacewar.com/reports/NATO_chief_US_totally_committed_to_collective_defence_pledge_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Where is Iran's uranium? Questions abound after US strikes",
    "description": "Vienna (AFP) June 23, 2025\n\n\n After President Donald Trump bragged US strikes had \"obliterated\" Iran's nuclear capabilities, officials cautioned it was still too soon to assess the impact on the country's nuclear programme. \n\nMany questions remain after Sunda…",
    "link": "https://www.spacewar.com/reports/Where_is_Irans_uranium_Questions_abound_after_US_strikes_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "Trump says U.S., Iran to meet next week",
    "description": "Washington DC (UPI) Jun 25, 2025 \n\n\n U.S. and Iranian officials will meet next week to discuss current events but won't necessarily negotiate any agreements, President Donald Trump announced on Wednesday. \n The president didn't say when or where the talks wou…",
    "link": "https://www.spacewar.com/reports/Trump_says_US_Iran_to_meet_next_week_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "UK to reintroduce nuclear weapon-capable aircraft under NATO",
    "description": "London (AFP) June 25, 2025\n\n\n Britain will reintroduce fighter jets capable of carrying atomic weapons to support NATO's nuclear mission, Prime Minister Keir Starmer's office said, as he prepares for a Nato summit Wednesday. \n\nThe country will purchase 12 nuc…",
    "link": "https://www.spacewar.com/reports/UK_to_reintroduce_nuclear_weapon-capable_aircraft_under_NATO_999.html",
    "timestamp": "2025-06-26T09:14:17Z"
  },
  {
    "title": "How 'Daddy' talk and Trump and Rutte's bromance stole the NATO spotlight",
    "description": "It was the \"bromance\" between President Donald Trump and NATO Secretary General Mark Rutte that ultimately threatened to steal NATO's limelight.",
    "link": "https://biztoc.com/x/4b897bc6c2aa3a82",
    "timestamp": "2025-06-26T09:10:15Z"
  },
  {
    "title": "Why we built the Climate Backtracker: Canada’s quiet climate retreat",
    "description": "For Mark Carney, building Canada’s energy sector is likely still going to involve drilling — and a lot of it.",
    "link": "https://www.nationalobserver.com/2025/06/26/opinion/climate-backtracker-canadas-quiet-climate-retreat",
    "timestamp": "2025-06-26T09:09:05Z"
  },
  {
    "title": "Is Europe Putin's next invasion target? Trump says it's ‘possible’ the Russian President may target more countries",
    "description": "World War III: US President Donald Trump said it is “possible” that Vladimir Putin may seek to invade more countries beyond Ukraine. Speaking at the NATO summit in The Hague, Trump described the Russian leader as “misguided” and said ceasefire talks have been…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/world-war-iii-is-europe-putins-next-invasion-target-trump-says-its-possible-the-russian-president-may-target-more-countries/articleshow/122088018.cms",
    "timestamp": "2025-06-26T09:07:44Z"
  },
  {
    "title": "I retired early in my 50s and am re-entering the workforce at 60. I set aside $4,500 to get certifications — I need every advantage I can get.",
    "description": "After retiring at 57 and spending three years living off of his investment portfolio, Chris Mott is returning to work due to economic concerns.",
    "link": "https://www.businessinsider.com/retired-in-50s-and-returning-to-work-based-on-economy-2025-6",
    "timestamp": "2025-06-26T09:07:02Z"
  },
  {
    "title": "Middle East: Three Palestinians killed in West Bank after clashes with Israeli settlers",
    "description": "Dozens of Israeli settlers set fire to houses and cars, resulting in the army intervening and three Palestinians shot dead. DW has all the updates. Three Palestinians shot dead after clashes with settlers\nTrump says US and Iranian officials will meet next wee…",
    "link": "https://www.dw.com/en/middle-east-three-palestinians-killed-in-west-bank-after-clashes-with-israeli-settlers/live-73043809",
    "timestamp": "2025-06-26T09:07:00Z"
  },
  {
    "title": "Battenfeld: Socialist win in New York City lurches Democrats further left",
    "description": "Joe Battenfeld: With the stunning reemergence of Alexandria Ocasio-Cortez and Democratic socialists in the New York City mayor’s election, the Democratic Party is lurching even further to the left.…",
    "link": "https://www.bostonherald.com/2025/06/26/battenfeld-socialist-win-in-new-york-city-lurches-democrats-further-left/",
    "timestamp": "2025-06-26T09:06:06Z"
  },
  {
    "title": "Brits were warned to prepare ‘72-hour survival kit’ as UK told to ‘actively prepare’ for war",
    "description": "Experts have revealed what items to pack in a survival kit amidst the continued talk of war",
    "link": "https://www.ladbible.com/news/uk-news/72-hour-survival-kit-israel-iran-uk-war-394284-20250626",
    "timestamp": "2025-06-26T09:05:50Z"
  },
  {
    "title": "How 'Daddy' talk and Trump and Rutte's bromance stole the NATO spotlight",
    "description": "It was the \"bromance\" between President Donald Trump and NATO Secretary General Mark Rutte that ultimately threatened to steal NATO's limelight.",
    "link": "https://www.cnbc.com/2025/06/26/trump-and-ruttes-bromance-stole-the-spotlight-at-the-nato-summit.html",
    "timestamp": "2025-06-26T09:02:18Z"
  },
  {
    "title": "Morning Glory: Trump's Iran strike and Trump's Doctrine",
    "description": "JCPOA Separation Anxiety Disorder cripples many in legacy media and their \"sources.\"",
    "link": "https://www.foxnews.com/opinion/morning-glory-trumps-iran-strike-trumps-doctrine",
    "timestamp": "2025-06-26T09:00:54Z"
  },
  {
    "title": "Trump Media’s stock has plunged by nearly half since the election. Now it’s taking action | CNN Business",
    "description": "In the weeks before last fall’s election, shares of Trump Media & Technology Group spiked as traders bet Donald Trump would return to the White House and make Truth Social the platform for presidential communications.",
    "link": "https://www.cnn.com/2025/06/26/business/trump-media-stock-truth-social",
    "timestamp": "2025-06-26T09:00:25Z"
  },
  {
    "title": "Andrew Cuomo and the Death of Centrism",
    "description": "Andrew Cuomo’s failure to defeat Zohran Mamdani demonstrates the moral and intellectual rot of the Democratic Establishment.",
    "link": "http://nymag.com/intelligencer/article/zohran-mamdani-andrew-cuomo-centrism.html",
    "timestamp": "2025-06-26T09:00:17Z"
  },
  {
    "title": "Sen. Lummis Says Crypto Framework Must Pass Soon As House Pushes For GENIUS-CLARITY Package",
    "description": "As the upper chamber of the US Congress prepares its version of a market structure framework, Republican Senator Cynthia Lummis recently told CNBC that she hopes the Senate and House of Representatives can soon find a path to pass both crypto bills moving thr…",
    "link": "https://bitcoinist.com/sen-lummis-says-crypto-framework-must-pass-soon-as-house-pushes-for-genius-clarity-package/",
    "timestamp": "2025-06-26T09:00:16Z"
  },
  {
    "title": "GOP bill could shift wealth from young to older generations, study finds",
    "description": "Older, wealthier Americans would see the biggest lifetime benefit from the Republican budget bill, while younger generations could see losses, a new analysis says.",
    "link": "https://www.cbsnews.com/news/one-big-beautiful-bill-young-old-wealth-transfer-penn-wharton/",
    "timestamp": "2025-06-26T09:00:12Z"
  },
  {
    "title": "Ten Years After Landmark Supreme Court Ruling, Is Same-Sex Marriage at Risk?",
    "description": "\"As an interracial gay couple with an adopted daughter, these developments are deeply unsettling,\" Nikhil Patil told Newsweek.",
    "link": "https://www.newsweek.com/2025/07/04/ten-years-after-landmark-supreme-court-ruling-same-sex-marriage-risk-2088309.html",
    "timestamp": "2025-06-26T09:00:01Z"
  },
  {
    "title": "MAGA Dope Pete Hegseth Accidentally Exposes Trump’s Vile Scam on Iran",
    "description": "President Donald Trump and his top advisers have worked themselves up into a fury about the leaked intelligence assessment casting doubt on the success of Trump’s bombing of Iran. Defense Secretary Pete Hegseth unleashed a wild, angry rant about it during a p…",
    "link": "https://newrepublic.com/article/197276/maga-dope-pete-hegseth-accidentally-exposes-trump-vile-scam-iran",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "More Americans oppose the U.S. strikes on Iran, as MAGA supporters line up with Trump",
    "description": "President Donald Trump’s decision to launch airstrikes Saturday on several nuclear facilities in Iran has divided Americans and exposed fault lines within the coalitions of both the parties, according to a new NBC News Decision Desk Poll powered by SurveyMonk…",
    "link": "https://www.nbcnews.com/politics/trump-administration/poll-americans-oppose-us-strikes-iran-maga-supporters-line-trump-rcna214993",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "Nursing homes face 2 threats: Trump's Medicaid cuts and his immigration crackdown",
    "description": "Understaffed nursing homes rely on an immigrant workforce. Cuts to Medicaid and a tough immigration policy amount to a double whammy for the long-term care industry.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/06/26/nx-s1-5443988/nursing-homes-trump-medicaid-big-beautiful-bill-immigration",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "Dual Threats From Trump and GOP Imperil Nursing Homes and Their Foreign-Born Workers",
    "description": "Understaffed nursing homes face a workforce crisis if President Donald Trump and Republicans further curtail immigration and cut Medicaid.",
    "link": "https://kffhealthnews.org/news/article/nursing-home-staffing-immigrants-work-permits-medicaid-trump-gop/",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "DOJ coordinated with Texas AG to kill Texas Dream Act, Trump official says",
    "description": "A DOJ official boasted that he was able to kill a Texas law that gave undocumented immigrants in-state tuition by coordinating with Texas Attorney General Ken Paxton.",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-coordinated-texas-ag-kill-texas-dream-act-trump-official-says-rcna214871",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "Trump Tries to ‘Save’ Netanyahu as Israeli PM Faces Challenges at Home",
    "description": "The U.S. President said his friend is being put through a “witch hunt” corruption trial, but the Israeli leader’s hold on power is threatened by domestic political issues too.",
    "link": "https://time.com/7297951/trump-netanyahu-friend-relationship-israel-prime-minister-corruption-trial-politics/",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "CBS News Leans Into the Climate Connection",
    "description": "Mark Hertsgaard\n\n\n\nSince Trump’s election, the network has produced more than 60 stories on the climate crisis.\r\n\n\r\n\n\nThe post CBS News Leans Into the Climate Connection appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=561572",
    "timestamp": "2025-06-26T09:00:00Z"
  },
  {
    "title": "Trump says U.S. and Iran will talk next week as ceasefire holds: ‘The way I look at it, they fought, the war is done’",
    "description": "Israel and Iran seemed to honor the fragile ceasefire between them for a second day Wednesday and U.S. President Donald Trump asserted that American and Iranian officials will talk next week, giving rise to cautious hope for longer-term peace.\nTrump, who help…",
    "link": "https://biztoc.com/x/319081fa7a767bb4",
    "timestamp": "2025-06-26T08:59:06Z"
  },
  {
    "title": "Trump says U.S. and Iran will talk next week as ceasefire holds: ‘The way I look at it, they fought, the war is done’",
    "description": "Iran has not acknowledged any talks taking place next week, though U.S. Mideast envoy Steve Witkoff has said there has been direct and indirect communication between the countries.",
    "link": "https://fortune.com/2025/06/26/trump-us-iran-talk-ceasefire-holds-they-fought-war-is-done/",
    "timestamp": "2025-06-26T08:50:09Z"
  },
  {
    "title": "Ukraine: Trump-Zelensky meeting confirms US backing",
    "description": "The Ukrainian Armed Forces said Thursday that the meeting between President Volodymyr Zelensky and US President Donald Trump on the sidelines of the NATO summit confirmed continued Washington support ...",
    "link": "https://biztoc.com/x/28d08e61671ce01a",
    "timestamp": "2025-06-26T08:48:16Z"
  },
  {
    "title": "EU summit: Leaders to address wars, US tariffs, migration",
    "description": "Leaders of the European Union are gathering in Brussels for the EU summit on Thursday. They are set to discuss conflicts in Ukraine and the Middle East, as well as the Trump administration tariffs. DW has the latest. The European Union summit begins in Brusse…",
    "link": "https://www.dw.com/en/eu-summit-leaders-to-address-wars-us-tariffs-migration/live-73043764",
    "timestamp": "2025-06-26T08:38:00Z"
  },
  {
    "title": "Lapid: Trump should not interfere in Netanyahu's trial",
    "description": "Israeli Opposition Leader Yair Lapid warned US President Donald Trump on Thursday not to interfere in Israel's internal judicial matters following Trump's call to cancel Prime Minister Benjamin Netany...",
    "link": "https://biztoc.com/x/75445095ec49dd43",
    "timestamp": "2025-06-26T08:37:14Z"
  },
  {
    "title": "Trump is creating a new universe of people to deport",
    "description": "The puzzle pieces are starting to come together for Trump’s master deportation plan",
    "link": "https://www.cnn.com/2025/06/26/politics/immigration-deportations-trump-asylum-seekers",
    "timestamp": "2025-06-26T08:32:40Z"
  },
  {
    "title": "Sa'ar Backs Trump: 'Netanyahu trial has lost all value'",
    "description": "Foreign Minister Gideon Saar supported the call by President Trump to cancel Prime Minister Netanyahu's trial.",
    "link": "https://www.israelnationalnews.com/news/410692",
    "timestamp": "2025-06-26T08:29:39Z"
  },
  {
    "title": "Brand safety: Why social is far more risky than news for marketers",
    "description": "Brand safety and the news industry: Publishers explain why social media is far more risky than news for advertising",
    "link": "https://pressgazette.co.uk/marketing/brand-safety-news/",
    "timestamp": "2025-06-26T08:21:39Z"
  },
  {
    "title": "Macron says EU must prepare to talk to Russia",
    "description": "The EU should prepare to negotiate a new security framework with Russia, French President Emmanuel Macron has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620552-macron-eu-prepare-talks-russia/",
    "timestamp": "2025-06-26T08:21:21Z"
  },
  {
    "title": "Trump-backed World Liberty to release stablecoin audit, make WLFI transferable",
    "description": "Trump’s crypto firm World Liberty Financial plans to publish a stablecoin audit and may soon allow trading of its WLFI governance token, amid retail excitement and skepticism.",
    "link": "https://cointelegraph.com/news/trump-crypto-platform-wlfi-transferable-stablecoin-audit",
    "timestamp": "2025-06-26T08:20:58Z"
  },
  {
    "title": "EU officials embarrassed by NATO chief ‘sucking up’ to Trump – Politico",
    "description": "NATO Secretary-General Mark Rutte called US President Donald Trump “daddy” during the bloc’s summit at The Hague Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620556-trump-rutte-us-nato/",
    "timestamp": "2025-06-26T08:18:19Z"
  },
  {
    "title": "Trump Makes Eye-Rolling New Title Suggestion For Pete Hegseth",
    "description": "The president's throwback title idea went awry.",
    "link": "https://www.huffpost.com/entry/donald-trump-pete-hegseth-title_n_685cf373e4b0f78c5737d4d1",
    "timestamp": "2025-06-26T08:17:57Z"
  },
  {
    "title": "White House Posts 'Daddy's Home' NATO Supercut",
    "description": "The montage was posted hours after NATO Secretary General Mark Rutte referred to President Donald Trump as \"Daddy\" during a press conference.",
    "link": "https://biztoc.com/x/c21b16e083b95104",
    "timestamp": "2025-06-26T08:14:43Z"
  },
  {
    "title": "EU leaders meet to discuss sanctions, tariffs, and Middle East policy",
    "description": "EU leaders gather in Brussels to address sanctions on Russia, US tariffs, and Middle East conflicts.",
    "link": "https://www.aljazeera.com/news/2025/6/26/eu-leaders-meet-to-discuss-sanctions-tariffs-and-middle-east-policy",
    "timestamp": "2025-06-26T08:13:23Z"
  },
  {
    "title": "European shares edge higher as ceasefire holds, Fed independence in focus",
    "description": "European shares edged higher on Thursday, aided by signs that the Israel-Iran ceasefire appeared to be holding, while U.S. President Donald Trump's latest criticism of the Federal Reserve chair revived concerns over the central bank's independence.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-as-ceasefire-holds-fed-independence-in-focus/articleshow/122087111.cms",
    "timestamp": "2025-06-26T08:11:31Z"
  },
  {
    "title": "White House Posts 'Daddy's Home' NATO Supercut",
    "description": "The montage was posted hours after NATO Secretary General Mark Rutte referred to President Donald Trump as \"Daddy\" during a press conference.",
    "link": "https://www.newsweek.com/white-house-usher-daddys-home-nato-rutte-2090916",
    "timestamp": "2025-06-26T08:06:17Z"
  },
  {
    "title": "Dollar Falls on Worries Over Fed Independence",
    "description": "Just In\nDollar Falls on Worries Over Fed Independence\nThe dollar remained weaker after hitting a three-year low Wednesday on concerns about the threat to the Federal Reserve's independence.\nThe WSJ reported that President Donald Trump is considering announcin…",
    "link": "https://biztoc.com/x/36d74bbe23a3eedf",
    "timestamp": "2025-06-26T08:04:20Z"
  },
  {
    "title": "Map Shows How Much Each NATO Member Contributes as Trump Touts Increase",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump on Wednesday touted a plan for NATO member states to raise defense spending to 5 percent of their gross domestic product (GDP) as a \"monumental win\" for the United States.\nThe agreement …",
    "link": "https://biztoc.com/x/9641e72785f72305",
    "timestamp": "2025-06-26T08:04:18Z"
  },
  {
    "title": "Federal judge wants Kilmar Abrego Garcia released but his lawyers worry ICE will arrest and deport him if he’s set free",
    "description": "The Salvadoran national whose mistaken deportation became a flashpoint in the fight over President Donald Trump’s immigration policies has been in jail since he was returned to the U.S. on June 7.",
    "link": "https://fortune.com/2025/06/26/federal-judge-kilmar-abrego-garcia-released-lawyers-worry-ice-arrest-deport/",
    "timestamp": "2025-06-26T08:03:06Z"
  },
  {
    "title": "Israel's war with Iran lasted just 12 days. So why has the fight with Hamas in Gaza lasted for over 600?",
    "description": "Israeli Prime Minister Benjamin Netanyahu has claimed victory over his arch-foe Iran, but the war with a much smaller and stubborn adversary in Hamas drags on. And Netanyahu is facing renewed pressure to end it.",
    "link": "https://www.cbc.ca/news/world/israel-iran-analysis-1.7570372",
    "timestamp": "2025-06-26T08:01:00Z"
  },
  {
    "title": "College campuses could be ground zero for Iranian sleeper cells plotting to harm Americans, experts warn",
    "description": "DHS issued a terrorism bulletin with experts warning of Iranian sleeper cells, campus protest infiltration and online radicalization tactics after U.S. strikes on nuclear sites.",
    "link": "https://www.foxnews.com/us/college-campuses-could-ground-zero-iranian-sleeper-cells-plotting-harm-americans-experts-warn",
    "timestamp": "2025-06-26T08:00:50Z"
  },
  {
    "title": "Map Shows How Much Each NATO Member Contributes as Trump Touts Increase",
    "description": "NATO member states will see dramatic defense spending increases over the next decade, per a new agreement.",
    "link": "https://www.newsweek.com/map-shows-nato-defense-spending-trump-touts-increase-2090787",
    "timestamp": "2025-06-26T08:00:01Z"
  },
  {
    "title": "America's Boomer Population Grows As Birth Rates Fall",
    "description": "America's aging population, coinciding with falling birth rates, has become a growing concern and reflects the wider anxieties felt in the country.",
    "link": "https://www.newsweek.com/americas-boomer-population-grows-birth-rates-fall-2090532",
    "timestamp": "2025-06-26T08:00:01Z"
  },
  {
    "title": "Key US Ally Quietly Prepares for China's Pacific War With America",
    "description": "The Japanese government is taking uncomfortable steps to prepare its citizens for a possible future war that its military would not be able to avoid.",
    "link": "https://www.newsweek.com/us-ally-japan-prepares-plans-us-china-pacific-war-taiwan-strait-2090216",
    "timestamp": "2025-06-26T08:00:01Z"
  },
  {
    "title": "Trump's 'revenge tax' on other countries could hit U.S.",
    "description": "A controversial tax being proposed by President Donald Trump's administration that could cost Canadians and Canadian businesses billions is also likely to cost the U.S. government, according to an assessment by a non-partisan U.S. congressional office.",
    "link": "https://www.cbc.ca/news/politics/trump-tax-impact-canada-1.7571016",
    "timestamp": "2025-06-26T08:00:00Z"
  },
  {
    "title": "Editorial: The 12-Day War — The push to end Iran’s nukes must continue",
    "description": "Now that the 12-Day War of Israel’s pinpoint airstrikes on Iranian military and nuclear targets and Iran’s blind ballistic missiles slamming into Israeli...",
    "link": "https://www.nydailynews.com/2025/06/25/the-12-day-war/",
    "timestamp": "2025-06-26T08:00:00Z"
  },
  {
    "title": "Iran: State disintegration, not regime change",
    "description": "Israel cannot rely on regime change to ensure its security. It must aim at dismantling Iran into separate ethnic entities to ensure that, in the future, it will not become the grave menace that it was in the past. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410698",
    "timestamp": "2025-06-26T08:00:00Z"
  },
  {
    "title": "People 'in disgust' after seeing what official White House account posted following Trump 'daddy' comment",
    "description": "Donald Trump's White House Instagram account has shared a 'Daddy's Home' video on Instagram and people are reacting",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-white-house-daddys-home-114978-20250626",
    "timestamp": "2025-06-26T07:57:57Z"
  },
  {
    "title": "Best Meme Coins Live News Today: Latest Opportunities & Updates (June 26)",
    "description": "Get Early Alpha with Our Immediate Analysis of Today’s Best Meme Coins Check out our Live Update Coverage on the Best Meme Coins for June 26, 2025! Crypto adoption, retail and institutional, is currently exploding. From Strategy and Mastercard to JPMorgan and…",
    "link": "https://bitcoinist.com/meme-coins-live-news-june-26-2025/",
    "timestamp": "2025-06-26T07:57:52Z"
  },
  {
    "title": "US to Withdraw from NATO Under Republican Bill",
    "description": "Senator Mike Lee introduced the Not A Trusted Organization (NATO) Act to withdraw the U.S. from the alliance.",
    "link": "https://www.newsweek.com/nato-us-withdraw-senator-mike-lee-republican-effort-2090914",
    "timestamp": "2025-06-26T07:50:07Z"
  },
  {
    "title": "Editorial: Revised land bill would still be a step forward",
    "description": "Reducing Washington’s massive real estate portfolio by a tiny fraction to allow established communities more room to grow and prosper is hardly akin to “destroying” the nation’s “beautiful places” in service to the “ultra-rich.”",
    "link": "https://www.bostonherald.com/2025/06/26/editorial-revised-land-bill-would-still-be-a-step-forward/",
    "timestamp": "2025-06-26T07:46:35Z"
  },
  {
    "title": "Trump Calls Netanyahu’s Corruption Trial A ‘Witch Hunt’—Says Israel Should Pardon Him",
    "description": "Netanyahu is facing trial on three criminal charges, including “bribery, fraud and breach of trust.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/06/26/trump-calls-netanyahus-corruption-case-a-witch-hunt-say-israel-should-pardon-him/",
    "timestamp": "2025-06-26T07:38:35Z"
  },
  {
    "title": "Stocks mixed with eyes on Mideast, dollar hit by Trump Fed comment",
    "description": "Stocks were mixed Thursday and oil rose as traders kept a nervous eye on the Iran-Israel ceasefire, while the dollar dropped after Donald Trump said he had a...",
    "link": "https://finance.yahoo.com/news/stocks-down-eyes-mideast-dollar-030944041.html",
    "timestamp": "2025-06-26T07:37:41Z"
  },
  {
    "title": "Akazawa leaves for 7th trip to U.S., saying 25% auto tariffs are unacceptable",
    "description": "Japan's chief negotiator on Thursday set off for another round of tariff negotiations with the United States, reiterating before his departure that the 25 percent additional auto tariffs imposed by Washington remain unacceptable. Ryosei Akazawa, minister in c…",
    "link": "https://japantoday.com/category/politics/japan-reiterates-that-higher-u.s.-auto-tariffs-are-unacceptable",
    "timestamp": "2025-06-26T07:33:10Z"
  },
  {
    "title": "Trump Says US-Iran To Meet; Powell's Replacement | Horizons Middle East & Africa 06/26/2025",
    "description": "President Donald Trump says the US will meet with Iran next week, while casting doubt on the need for a diplomatic agreement on ...",
    "link": "https://biztoc.com/x/2e5403d3b6dbb088",
    "timestamp": "2025-06-26T07:26:42Z"
  },
  {
    "title": "Lucas: Unconditional surrender from Iran isn’t enough",
    "description": "President Donald Trump has, metaphorically speaking, wiped out the Democrats as he symbolically did the nuclear bomb-bent bullies in Iran who've long had Israel in their crosshairs.",
    "link": "https://www.bostonherald.com/2025/06/26/lucas-unconditional-surrender-from-iran-isnt-enough/",
    "timestamp": "2025-06-26T07:25:46Z"
  },
  {
    "title": "Melania Trump's Visa Questioned in Congressional Hearing",
    "description": "\"It doesn't take an Einstein to see that the math ain't mathin' here,\" Democratic Representative Jasmine Crockett said.",
    "link": "https://www.newsweek.com/melania-trump-einstein-visa-questioned-jasmine-crockett-2090901",
    "timestamp": "2025-06-26T07:25:29Z"
  },
  {
    "title": "Donald Trump Makes Major Change to Mortgages: What to Know",
    "description": "Regulators have asked housing giants Fannie Mae and Freddie Mac to consider crypto assets for mortgage applications.",
    "link": "https://biztoc.com/x/f0fbc6b5bdba142c",
    "timestamp": "2025-06-26T07:19:51Z"
  },
  {
    "title": "Trump has ‘three or four' candidates in mind for Fed chief",
    "description": "U.S. President Donald Trump said he had a handful of candidates potentially lined up to replace Federal Reserve Chair Jerome Powell, whom he sharply criticised for his handling of the world's top economy.",
    "link": "https://www.hurriyetdailynews.com/trump-has-three-or-four-candidates-in-mind-for-fed-chief-210774",
    "timestamp": "2025-06-26T07:16:18Z"
  },
  {
    "title": "Trump Says US, Iran Will Talk Next Week, Mideast War Paused",
    "description": "'The logic of war has failed - return to the logic of diplomacy', Iran's mission to the UN said.",
    "link": "https://www.rigzone.com/news/wire/trump_says_us_iran_will_talk_next_week_mideast_war_over_for_now-26-jun-2025-180949-article/",
    "timestamp": "2025-06-26T07:15:45Z"
  },
  {
    "title": "Trump: NATO’s new 5% defense spending pledge a ‘big win’",
    "description": "The Hague, June 26: NATO leaders have agreed to ramp up defense spending to 5% of their countries’ economic output […]\nThe post Trump: NATO’s new 5% defense spending pledge a ‘big win’ appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/26/trump-natos-new-5-defense-spending-pledge-a-big-win/",
    "timestamp": "2025-06-26T07:10:00Z"
  },
  {
    "title": "Donald Trump Makes Major Change to Mortgages: What to Know",
    "description": "Regulators have asked housing giants Fannie Mae and Freddie Mac to consider crypto assets for mortgage applications.",
    "link": "https://www.newsweek.com/donald-trump-changes-mortgages-major-what-know-2090894",
    "timestamp": "2025-06-26T07:09:55Z"
  },
  {
    "title": "Republicans Ask Donald Trump to Revoke Zohran Mamdani's Citizenship",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe New York Young Republican Club (NYYRC) has called on the federal government to strip Zohran Mamdani of his citizenship and deport him.\nOn Tuesday evening, Mamdani, a 33-year-old democratic socialist, decla…",
    "link": "https://biztoc.com/x/48cf798c800364cf",
    "timestamp": "2025-06-26T07:08:47Z"
  },
  {
    "title": "Blacklisted by the U.S. and backed by Beijing, this Chinese AI startup has caught OpenAI's attention",
    "description": "OpenAI is putting a spotlight on an under-the-radar artificial intelligence start-up that it believes is on the \"front line\" of China's race to lead the world in AI.",
    "link": "https://www.cnbc.com/2025/06/26/openai-flags-beijing-backed-zhipu-ai-as-a-top-rival.html",
    "timestamp": "2025-06-26T07:06:55Z"
  },
  {
    "title": "Germany to stop funding Mediterranean sea migrant rescues",
    "description": "Germany's conservative-led government will stop funding groups that rescue migrants in the Mediterranean, a foreign ministry source said Wednesday, prompting opposition parties to warn that the decision could worsen a \"humanitarian crisis\".",
    "link": "https://www.thelocal.de/20250626/germany-to-stop-funding-mediterranean-sea-migrant-rescues",
    "timestamp": "2025-06-26T07:05:49Z"
  },
  {
    "title": "IDF Chief: Israel Had Commandos on the Ground in Iran During 12 Day War",
    "description": "Israel Defense Forces (IDF) Chief of Staff Lt. Gen. Eyal Zamir revealed Wednesday that Israeli special operations forces had been on the ground during the 12 Day War with Iran, carrying out covert missions.\nThe post IDF Chief: Israel Had Commandos on the Grou…",
    "link": "https://www.breitbart.com/middle-east/2025/06/26/idf-chief-israel-had-commandos-on-the-ground-in-iran-during-12-day-war/",
    "timestamp": "2025-06-26T07:00:19Z"
  },
  {
    "title": "Graduate Programs Face a Federal Reckoning",
    "description": "Graduate Programs Face a Federal Reckoning\n\n \n\n\n \nLiam Knox\n\nThu, 06/26/2025 - 03:00 AM\n\nCongress wants to significantly cut back on federal loans for grad students. That could decimate the highly profitable graduate degree market—and limit who has access to …",
    "link": "https://www.insidehighered.com/news/admissions/graduate/2025/06/26/can-graduate-programs-survive-federal-loan-caps",
    "timestamp": "2025-06-26T07:00:00Z"
  },
  {
    "title": "Scholars Continue Lambasting Higher Ed While Trump Upends It",
    "description": "Scholars Continue Lambasting Higher Ed While Trump Upends It\n\n \n\n\n \nRyan Quinn\n\nThu, 06/26/2025 - 03:00 AM\n\nThis year’s Heterodox Academy conference—the first since Republicans retook the White House—featured similar complaints about academe as in years past.…",
    "link": "https://www.insidehighered.com/news/faculty-issues/academic-freedom/2025/06/26/scholars-lambaste-higher-ed-while-trump-upends-it",
    "timestamp": "2025-06-26T07:00:00Z"
  },
  {
    "title": "FIU Donor Pulls Funds Over President’s Politics",
    "description": "A Miami businessman has walked back a $1 million donation to Florida International University after lawmakers repealed in-state tuition for undocumented students, The Miami Herald reported.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/06/26/fiu-donor-pulls-funds-over-presidents-politics",
    "timestamp": "2025-06-26T07:00:00Z"
  },
  {
    "title": "Republicans Ask Donald Trump to Revoke Zohran Mamdani's Citizenship",
    "description": "Zohran Mamdani declared victory in the Democratic primary for the 2025 New York mayoral election on Tuesday.",
    "link": "https://www.newsweek.com/republicans-ask-donald-trump-revoke-zohran-mamdani-citizenship-deport-2090891",
    "timestamp": "2025-06-26T06:59:45Z"
  },
  {
    "title": "Sen. Jon Ossoff Shuts Down Project 2025 Architect Using 1 Ferocious Reality Check",
    "description": "The senator hit Russell Vought with a wave of questions about the Trump administration's \"mistakes\" with its budget cuts.",
    "link": "https://www.huffpost.com/entry/sen-jon-ossoff-russell-vought-biden-trump-administration_n_685cd35ee4b0c601d5a1828c",
    "timestamp": "2025-06-26T06:54:43Z"
  },
  {
    "title": "Japan reiterates it cannot accept 25% car tariffs from U.S.",
    "description": "The auto tariffs are a sticking point in U.S.-Japan trade negotiations as Tokyo tries to protect a key economic pillar.",
    "link": "https://fortune.com/asia/2025/06/26/japan-reiterates-cannot-accept-25-percent-car-tariffs-from-us/",
    "timestamp": "2025-06-26T06:54:32Z"
  },
  {
    "title": "Dollar hits 3-year low on report Donald Trump could pick next Federal Reserve chair early - Financial Times",
    "description": "Dollar hits 3-year low on report Donald Trump could pick next Federal Reserve chair earlyFinancial Times Morning Bid: Trump punches at Powell, dollar recoilsReuters USD/INR gains at open as Trump’s attack on Fed’s autonomy batters US DollarFXStreet Asian Curr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178190184",
    "timestamp": "2025-06-26T06:52:49Z"
  },
  {
    "title": "Bezos-Sanchez wedding latest: Celebrations kick off in Venice as locals continue to protest",
    "description": "Jeff Bezos and Lauren Sanchez are in Venice for what is already being dubbed “the wedding of the century.”",
    "link": "https://www.the-independent.com/life-style/jeff-bezos-lauren-sanchez-wedding-celebrations-venice-guest-list-latest-b2776861.html",
    "timestamp": "2025-06-26T06:51:45Z"
  },
  {
    "title": "CNBC Daily Open: Funny how the S&P 500 is teasing a new high amid uncertainties",
    "description": "Markets seem to be transported to a time before \"reciprocal\" tariffs, the \"One Big Beautiful Bill Act,\" and the Israel-Iran war.",
    "link": "https://www.cnbc.com/2025/06/26/cnbc-daily-open-funny-how-sp-500-is-near-a-high-amid-uncertainties.html",
    "timestamp": "2025-06-26T06:49:13Z"
  }
]