[
  {
    "title": "Trump welcomes Syrian president to Washington in high-profile visit as shutdown deal takes shape",
    "description": "Trump hosts Syrian president Ahmed al-Sharaa at White House amid government shutdown, marking first official Syrian leader visit to Washington in years.",
    "link": "https://www.foxnews.com/politics/trump-welcomes-syrian-president-washington-high-profile-visit-shutdown-deal-takes-shape",
    "timestamp": "2025-11-10T13:00:59Z"
  },
  {
    "title": "Colorado case heads to U.S. Supreme Court to consider question in lawsuit against Aurora detention center",
    "description": "\"This case has been going on since 2014, and we ... are deeply frustrated by Geo's efforts to continue delaying this litigation. All we want is the opportunity to have our claims vindicated in court.\"",
    "link": "https://www.denverpost.com/2025/11/10/supreme-court-colorado-case-detention-center-geo/",
    "timestamp": "2025-11-10T13:00:44Z"
  },
  {
    "title": "Air Force Academy’s accreditation under review after cuts to civilian faculty",
    "description": "Concerned alumni and former faculty told The Denver Post they believe the academy is losing too many civilian Ph.D.-level instructors without the ability to replace them with qualified military members.",
    "link": "https://www.denverpost.com/2025/11/10/air-force-academy-accreditation/",
    "timestamp": "2025-11-10T13:00:43Z"
  },
  {
    "title": "As the Senate advances a plan to end the government shutdown, what happens now?",
    "description": "As the shutdown continued, the pieces were in place for Democrats stand firm in support of a popular cause. Eight Senate Democrats folded anyway.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/senate-democrats-republicans-government-shutdown-what-happens-now-rcna242973",
    "timestamp": "2025-11-10T13:00:15Z"
  },
  {
    "title": "Dan Campbell playcalling made Detroit roared loudest",
    "description": "Dan Campbell made a significant change last week that paid immediate dividends Sunday when the Detroit Lions demolished the Washington Commanders 44-22. The head coach took over playcalling duties from first-year offensive coordinator John Morton following an…",
    "link": "https://rollingout.com/2025/11/10/campbell-took-playcalling-made-detroit/",
    "timestamp": "2025-11-10T13:00:03Z"
  },
  {
    "title": "Mamdani’s Far-Left Playbook Will Be Replicated Across the Country",
    "description": "Is America about to be hit with a Mamdani-style socialist tidal wave? That’s what more than a few Americans are thinking as the dust settles... Read More\nThe post Mamdani’s Far-Left Playbook Will Be Replicated Across the Country appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/11/10/mamdanis-far-left-playbook-will-replicated-across-country/",
    "timestamp": "2025-11-10T13:00:00Z"
  },
  {
    "title": "Why Isn’t Everyone Talking About Domhnall Gleeson?",
    "description": "He’s been in behemoth properties like Star Wars and Harry Potter. He's been Alex Garland's muse. In The Paper, he shapeshifted into an unsuspecting comedian—and he's hardly done yet.",
    "link": "https://www.esquire.com/entertainment/tv/a69279493/domhnall-gleeson-the-paper-interview-2025/",
    "timestamp": "2025-11-10T13:00:00Z"
  },
  {
    "title": "Clean, Cheap Energy Looks Like A Political Winner",
    "description": "This week’s newsletter also looks at the magical thinking behind Elon Musk’s $1 trillion pay package and cutting home heating costs with a “lukewarm” geothermal system",
    "link": "https://www.forbes.com/sites/current-climate/2025/11/10/clean-energy-looks-like-a-political-winner/",
    "timestamp": "2025-11-10T13:00:00Z"
  },
  {
    "title": "Dems Blink, Trump Wins. Prove Me Wrong.",
    "description": "Yep, the perfectly appropriate way to celebrate our historic wins this week was for Democratic senators to cave on the shutdown. Am I missing something? At least we know the chance is slim to none chance the House will vote on it.Via Politico:\nSenators have r…",
    "link": "https://crooksandliars.com/2025/11/dems-blink-trump-wins-prove-me-wrong",
    "timestamp": "2025-11-10T12:59:19Z"
  },
  {
    "title": "Dem civil war (Politico)",
    "description": "Politico:\nDem civil war  —  With help from Eli Okun, Bethany Irvine, Ali Bianco and Rachel Umansky-Castro  —  Good Monday morning.  This is Jack Blanchard.  Been a busy old night.  Get in touch.  —  WHILE YOU WERE SLEEPING: President Donald Trump announced pa…",
    "link": "https://www.memeorandum.com/251110/p16",
    "timestamp": "2025-11-10T12:55:01Z"
  },
  {
    "title": "Olympics organisers moving towards blanket ban on transgender women from women's sport",
    "description": "The International Olympic Committee is moving towards a blanket ban on transgender women from women's sport, Sky News understands.",
    "link": "https://news.sky.com/story/olympics-organisers-moving-towards-blanket-ban-on-transgender-women-from-womens-sport-13467845",
    "timestamp": "2025-11-10T12:54:00Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who tried to overturn 2020 election result",
    "description": "The proclamation explicitly says the pardon does not apply to Trump.",
    "link": "https://www.thejournal.ie/rudy-gioliani-pardon-6870027-Nov2025/",
    "timestamp": "2025-11-10T12:52:50Z"
  },
  {
    "title": "Trump Issues Sweeping Pardons To Giuliani, Meadows, Other Key Allies In 2020 Election Interference Cases",
    "description": "President Donald Trump has pardoned dozens of allies accused of efforts to overturn the 2020 presidential election, including former attorney Rudy Giuliani, ex–White House Chief of Staff Mark Meadows, and several “false electors” who attempted to certify alte…",
    "link": "https://biztoc.com/x/a4b7c51a06fe1aa7",
    "timestamp": "2025-11-10T12:52:03Z"
  },
  {
    "title": "Trump found yet another distasteful way to profit from the presidency",
    "description": "President Donald Trump has spent much of his second term so far doing, well, exactly the sorts of things he would be doing if he weren’t president.",
    "link": "https://biztoc.com/x/289a007188c89aa5",
    "timestamp": "2025-11-10T12:51:53Z"
  },
  {
    "title": "Trump pardons Giuliani, Mark Meadows, others involved in effort to block 2020 election result, DOJ official says",
    "description": "The proclamation, posted online late Sunday, explicitly says the pardon does not apply to Trump.",
    "link": "https://fortune.com/2025/11/10/trump-pardons-giuliani-mark-meadows-others-2020-election/",
    "timestamp": "2025-11-10T12:50:48Z"
  },
  {
    "title": "Trump losses have hatched plan to 'sabotage' midterms: George Conway",
    "description": "Conservative lawyer George Conway issued a warning that Donald Trump may \"sabotage\" or even \"ignore\" the results of next year's midterm elections.Conway, who left the Republican Party during the first Trump administration and became an outspoken critic, sugge…",
    "link": "https://www.rawstory.com/donald-trump-midterms-sabotage/",
    "timestamp": "2025-11-10T12:49:32Z"
  },
  {
    "title": "Joe Scarborough Urges Dems to ‘Take the Win’ on Shutdown Deal, Argues Trump Admin ‘Exposed’ Itself",
    "description": "Scarborough slammed Democrats' “wringing of hands” after a deal struck to end the shutdown and, instead, urged the party to “take the win.”\nThe post Joe Scarborough Urges Dems to ‘Take the Win’ on Shutdown Deal, Argues Trump Admin ‘Exposed’ Itself first appea…",
    "link": "https://www.mediaite.com/media/tv/joe-scarborough-urges-dems-to-take-the-win-on-shutdown-deal-argues-trump-admin-exposed-itself/",
    "timestamp": "2025-11-10T12:49:24Z"
  },
  {
    "title": "Trump is hosting Syria’s al-Sharaa for a first-of-its-kind meeting at the White House",
    "description": "It's the first visit to the White House by a Syrian head of state since the Middle Eastern country gained independence from France in 1946.",
    "link": "https://www.bostonherald.com/2025/11/10/trump-syria-president-white-house/",
    "timestamp": "2025-11-10T12:48:48Z"
  },
  {
    "title": "BBC chairman apologises for 'error of judgment' in Trump speech edit",
    "description": "LONDON (Reuters) -BBC Chair Samir Shah on Monday apologised for an \"error of judgment\" in editing a speech by U.S. President Donald Trump in a Panorama documentary, following the resignations of BBC's boss and head of news. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/10/bbc-chairman-apologises-for-039error-of-judgment039-in-trump-speech-edit",
    "timestamp": "2025-11-10T12:46:00Z"
  },
  {
    "title": "Trump Administration Tells States To Claw Back Full SNAP Benefits",
    "description": "Donald Trump *really* wants people to starve in this country. Not only have they gone to court to stop SNAP payments, but when they lost, they appealed all the way to the Supreme Court! And when they found out that some smart states were able to provide SNAP …",
    "link": "https://crooksandliars.com/2025/11/trump-administration-tells-states-claw",
    "timestamp": "2025-11-10T12:44:18Z"
  },
  {
    "title": "From floored to flawed: Does anyone want to win the Super Bowl this season?",
    "description": "The NFL is built on parity. But this season the NFC only has a few contenders while even the best teams in the AFC have worrying flaws",
    "link": "https://sports.yahoo.com/article/floored-flawed-does-anyone-want-124111622.html",
    "timestamp": "2025-11-10T12:41:11Z"
  },
  {
    "title": "H-1B Visa Update: Trump Admin Opens 175 Investigations into Visa 'Abuse'",
    "description": "The Donald Trump administration says it has opened 175 investigations into companies potentially abusing the H-1B visa program for skilled foreign-born workers.\nThe Department of Labor shared the update with Fox News last week, and Labor Secretary Lori Chavez…",
    "link": "https://biztoc.com/x/1f832fe48cc06301",
    "timestamp": "2025-11-10T12:41:02Z"
  },
  {
    "title": "They’re growing up in the Trump era. Here’s what they want from the next president",
    "description": "President Donald Trump speaks with Senate Republicans at the White House. \nThis story originally appeared in Kids Today, Vox’s newsletter about kids, for everyone. Sign up here for future editions.\nWhat does the president do?\nKids might learn the answer to th…",
    "link": "https://biztoc.com/x/7dd1f4ec9842b7e9",
    "timestamp": "2025-11-10T12:40:46Z"
  },
  {
    "title": "SNAP payment benefits coming in November or not? Check latest update for Supplemental Nutrition Assistance Program",
    "description": "SNAP payment benefits: Representative Alexandria Ocasio-Cortez pointed out that the average monthly SNAP benefit is $177 per beneficiary and the average monthly healthcare benefit under the Affordable Care Act is up to $550 per person.",
    "link": "https://economictimes.indiatimes.com/news/international/us/snap-payment-benefits-coming-in-november-or-not-check-latest-update-for-americans/articleshow/125224835.cms",
    "timestamp": "2025-11-10T12:38:31Z"
  },
  {
    "title": "States face uncertainty as Trump administration tries to reverse SNAP food payments",
    "description": "States are facing uncertainty about providing full monthly benefits for a federal food program serving 42 million Americans",
    "link": "https://abcnews.go.com/US/wireStory/states-face-uncertainty-trump-administration-reverse-snap-food-127367446",
    "timestamp": "2025-11-10T12:38:00Z"
  },
  {
    "title": "What's in the legislation to end the federal government shutdown",
    "description": "A legislative package to end the government shutdown appears on track",
    "link": "https://abcnews.go.com/Business/wireStory/legislation-end-federal-government-shutdown-127371161",
    "timestamp": "2025-11-10T12:37:46Z"
  },
  {
    "title": "BBC Chair Apologizes For “Error Of Judgement” That Led To Donald Trump Footage Being Edited",
    "description": "The chair of the BBC has apologized for the Donald Trump editing scandal, which he put down to BBC News wanting its audience to “better understand” how Trump’s January 6 speech was being “received by his own supporters.” In a highly-anticipated letter to the …",
    "link": "http://deadline.com/2025/11/bbc-chair-apologizes-donald-trump-edited-footage-1236612465/",
    "timestamp": "2025-11-10T12:37:22Z"
  },
  {
    "title": "FBI chief makes secret visit to China – Reuters",
    "description": "FBI Director Kash Patel secretly visited China to discuss the fight against fentanyl smuggling, Reuters reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627574-fbi-director-visit-china/",
    "timestamp": "2025-11-10T12:37:02Z"
  },
  {
    "title": "Eight Democratic senators capitulate towards ending the government shutdown",
    "description": "Again, the Republicans have control of the White House, both chambers of Congress and the Supreme Court. The currently unfolding catastrophe is entirely the fault of Republicans. The only meager power the Democratic minority has is through the Senate filibust…",
    "link": "https://www.celebitchy.com/949454/eight_democratic_senators_are_capitulating_to_end_the_government_shutdown/",
    "timestamp": "2025-11-10T12:35:15Z"
  },
  {
    "title": "BBC Chair Says Editing of Trump Speech ‘Did Give the Impression of a Direct Call for Violent Action’: We ‘Apologize for That Error of Judgement’",
    "description": "BBC chair Samir Shah has apologized to the U.K. culture, media and sport committee following a scandal around the editing of a Trump speech in the documentary program “Panorama,” calling it an “error of judgement.” Shah’s statement follows the shock resignati…",
    "link": "https://variety.com/2025/digital/global/bbc-chair-apologizes-editing-trump-speech-error-judgement-1236573879/",
    "timestamp": "2025-11-10T12:34:48Z"
  },
  {
    "title": "Appeals Court Says Trump Must Fully Fund SNAP",
    "description": "“A federal appeals court late on Sunday allowed a judge’s order to stand that directs President Donald Trump’s administration to fully fund this month’s food aid benefits for 42 million low-income Americans during the ongoing government shutdown,” NBC News re…",
    "link": "https://politicalwire.com/2025/11/10/appeals-court-says-trump-must-fully-fund-snap/",
    "timestamp": "2025-11-10T12:34:37Z"
  },
  {
    "title": "Trump Pardons Rudy Giuliani, Allies Accused of Trying to Overturn 2020 Election",
    "description": "Donald Trump is on a pardoning spree ... now wiping the slate clean for Rudy Giuliani and dozens of his close allies accused of trying to overturn the 2020 election. Ed Martin -- the Department of Justice’s Pardon Attorney -- made the…",
    "link": "https://www.tmz.com/2025/11/10/trump-pardons-rudy-giuliani-allies-overturn-2020-election/",
    "timestamp": "2025-11-10T12:34:15Z"
  },
  {
    "title": "US officials in Israel to press truce forward as first phase of Israel-Hamas ceasefire wanes",
    "description": "On Monday, Jared Kushner met with Israeli Prime Minister Benjamin Netanyahu to discuss the fragile agreement.",
    "link": "https://www.bostonherald.com/2025/11/10/israel-hamas-ceasefire-fragile-future/",
    "timestamp": "2025-11-10T12:32:49Z"
  },
  {
    "title": "SpaceX and Musk called on to rescue China's Shenzhou-20 crew",
    "description": "Technical and political obstacles block collaboration following suspected space debris strike on craft SpaceX and Elon Musk are once again being called on to rescue spacefarers — this time, the Chinese crew of Shenzhou-20, delayed on China's Tiangong space st…",
    "link": "https://www.theregister.com/2025/11/10/chinas_shenzhou_problem_shows_a/",
    "timestamp": "2025-11-10T12:32:20Z"
  },
  {
    "title": "Commanders fans face backlash for booing Trump during US military ceremony",
    "description": "Washington Commanders fans caught backlash on social media on Sunday for booing President Donald Trump as he read names of those enlisting in the U.S. military.",
    "link": "https://www.foxnews.com/sports/commanders-fans-face-backlash-booing-trump-during-us-military-ceremony",
    "timestamp": "2025-11-10T12:31:16Z"
  },
  {
    "title": "BBC chairman apologises for Panorama Trump edit",
    "description": "The BBC's director general and head of news both resigned on Sunday after criticism of the programme.",
    "link": "https://www.bbc.com/news/articles/c4gw001kw97o",
    "timestamp": "2025-11-10T12:30:02Z"
  },
  {
    "title": "Trump’s Vendetta Against EVs Is Driving Up Costs for Every Vehicle Owner",
    "description": "This story was originally published by Vox and is reproduced here as part of the Climate Desk collaboration. As President Donald Trump sees it, environmental regulations that attempt to improve efficiency and address climate change only make products more exp…",
    "link": "https://www.motherjones.com/politics/2025/11/trump-vendetta-evs-elecric-vehicles-batteries-costs-tariffs-epa-tailpipe-emissions/",
    "timestamp": "2025-11-10T12:30:00Z"
  },
  {
    "title": "The Growing Mystery Around Donald Trump’s Health — What the White House Isn’t Saying?",
    "description": "Rumors swirl as President Donald Trump’s unexplained monthly absences raise fresh questions about his declining health. Critics wonder if the administration is deliberately hiding the truth behind them.",
    "link": "https://www.inquisitr.com/the-growing-mystery-around-donald-trumps-health",
    "timestamp": "2025-11-10T12:29:59Z"
  },
  {
    "title": "Strongest Earnings Growth Since 2021: US Companies Beat Trade War Worries With Robust Q3 Results",
    "description": "The U.S. corporate sector is experiencing a significant surge in earnings, with the growth rate hitting a four-year high despite concerns over the impact of the trade war initiated by President Donald Trump.\nStrongest Earnings Growth Rate Since 2021\nThe media…",
    "link": "https://biztoc.com/x/bc03daecddc8f4bc",
    "timestamp": "2025-11-10T12:29:38Z"
  },
  {
    "title": "What exactly did the BBC do that led to the resignation of its director general and head of news?",
    "description": "The broadcaster’s edit to segments of a speech by US president Donald Trump included in a documentary led to the resignation of Tim Davie and Deborah Turness.",
    "link": "https://www.thejournal.ie/bbc-trump-documentary-edit-6869928-Nov2025/",
    "timestamp": "2025-11-10T12:27:57Z"
  },
  {
    "title": "Is the government shutdown over? Here's the latest update and the deal to break filibuster",
    "description": "A deal to end the 40-day U.S. government shutdown is close, with Senate leaders and Democrats agreeing on steps to reopen offices and restore pay for workers. The plan still needs House approval and the president’s signature. The shutdown caused food aid dela…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-the-government-shutdown-over-heres-the-latest-update-and-the-deal-to-break-filibuster/articleshow/125224360.cms",
    "timestamp": "2025-11-10T12:27:51Z"
  },
  {
    "title": "What's in the legislation to end the federal government shutdown",
    "description": "What's in the legislation to end the federal government shutdownksat.com",
    "link": "https://www.ksat.com/business/2025/11/10/whats-in-the-legislation-to-end-the-federal-government-shutdown/",
    "timestamp": "2025-11-10T12:25:31Z"
  },
  {
    "title": "Donald Trump: Why was the US president at the Commanders vs Lions NFL game during the government shutdown?",
    "description": "Watch Donald Trump's full appearance in the commentary booth at an NFL game and find out why the President appeared.",
    "link": "https://www.101greatgoals.com/nfl/donald-trump-government-shutdown-game/",
    "timestamp": "2025-11-10T12:24:17Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "A Justice Department official says President Trump pardoned people accused of backing the Republican’s efforts to overturn the 2020 election.",
    "link": "https://www.bostonherald.com/2025/11/10/trump-pardons-giuliani-2020-election/",
    "timestamp": "2025-11-10T12:22:53Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "A Justice Department official says President Trump pardoned people accused of backing the Republican’s efforts to overturn the 2020 election.",
    "link": "https://www.denverpost.com/2025/11/10/trump-pardons-giuliani-2020-election/",
    "timestamp": "2025-11-10T12:22:53Z"
  },
  {
    "title": "What's in legislation to end government shutdown",
    "description": "A legislative package to end the government shutdown appears on track",
    "link": "https://www.wsbtv.com/news/business/deal-end-government/ZX7R3H2K2UYAXNCWDTHQOJHVRQ/",
    "timestamp": "2025-11-10T12:22:04Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "A Justice Department official says President Donald Trump has pardoned his former personal lawyer Rudy Giuliani, his former chief of staff Mark Meadows and others accused of backing the Republican’s efforts to overturn the 2020 election",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-pardons-rudy-giuliani-backed-efforts-overturn-2020-127370114",
    "timestamp": "2025-11-10T12:22:03Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "Trump has pardoned Rudy Giuliani, his former chief of staff Mark Meadows and others accused of backing efforts to overturn the 2020 election, a Justice Department official says.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_2418cb07-006d-5f25-9e46-2db6d532780b.html",
    "timestamp": "2025-11-10T12:20:00Z"
  },
  {
    "title": "BREAKING: President Trump issues pardons for Rudy Giuliani, John Eastman, Tyler Bowyer and more over 2020 election prosecutions",
    "description": "President Donald Trump issued a sweeping pardon proclamation covering allies prosecuted in connection with efforts to challenge the 2020 presidential election, including Rudy Giuliani, John Eastman, and Tyler Bowyer.",
    "link": "https://freerepublic.com/focus/f-bloggers/4351735/posts",
    "timestamp": "2025-11-10T12:19:53Z"
  },
  {
    "title": "BREAKING: President Trump issues pardons for Rudy Giuliani, John Eastman, Tyler Bowyer and more over 2020 election prosecutions",
    "description": "President Donald Trump issued a sweeping pardon proclamation covering allies prosecuted in connection with efforts to challenge the 2020 presidential election, including Rudy Giuliani, John Eastman, and Tyler Bowyer.",
    "link": "https://freerepublic.com/focus/f-news/4351735/posts",
    "timestamp": "2025-11-10T12:19:53Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "Former US President Donald Trump has granted full pardons to Rudy Giuliani, Mark Meadows, Sidney Powell, John Eastman, and others involved in attempts to overturn the 2020 election.",
    "link": "https://indianexpress.com/article/world/trump-pardons-rudy-giuliani-who-backed-efforts-overturn-2020-election-10357140/",
    "timestamp": "2025-11-10T12:17:44Z"
  },
  {
    "title": "Shutdown deal in sight and Arctic blast kicks off storm season: Morning Rundown",
    "description": "An end to the shutdown is in sight after Senators clear a key vote for a deal. An Arctic blast dumps snow on the Midwest. And recapping Chargers vs. Steelers.",
    "link": "https://www.nbcnews.com/news/us-news/shutdown-deal-arctic-blast-storm-season-morning-rundown-rcna242952",
    "timestamp": "2025-11-10T12:16:18Z"
  },
  {
    "title": "A Shot in the Arm: Crypto Daybook Americas",
    "description": "The day ahead in crypto: Nov. 10, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/11/10/a-shot-in-the-arm-crypto-daybook-americas",
    "timestamp": "2025-11-10T12:15:00Z"
  },
  {
    "title": "A deal to end the government shutdown is on track but faces hurdles",
    "description": "A deal to end the government shutdown is on track but faces hurdlesnews4jax.com",
    "link": "https://www.news4jax.com/business/2025/11/10/a-deal-to-end-the-government-shutdown-is-on-track-but-faces-hurdles/",
    "timestamp": "2025-11-10T12:12:19Z"
  },
  {
    "title": "States face uncertainty as Trump administration tries to reverse SNAP food payments",
    "description": "States are facing uncertainty about providing full monthly benefits for a federal food program serving 42 million Americans.",
    "link": "https://www.denverpost.com/2025/11/10/trump-states-food-aid-battle/",
    "timestamp": "2025-11-10T12:12:02Z"
  },
  {
    "title": "States face uncertainty as Trump administration tries to reverse SNAP food payments",
    "description": "States are facing uncertainty about providing full monthly benefits for a federal food program serving 42 million Americans.",
    "link": "https://www.bostonherald.com/2025/11/10/trump-states-food-aid-battle/",
    "timestamp": "2025-11-10T12:12:02Z"
  },
  {
    "title": "Senate votes 60-40 to advance government shutdown deal",
    "description": "The Senate took a decisive step toward ending the prolonged government shutdown Monday morning, voting 60-40 to advance legislation that would reopen federal agencies after 40 days of closure. The breakthrough came after eight Democratic senators and one inde…",
    "link": "https://rollingout.com/2025/11/10/senate-government-shutdown-democrats/",
    "timestamp": "2025-11-10T12:11:19Z"
  },
  {
    "title": "Government shutdown deal faces hurdles",
    "description": "A legislative package to end the government shutdown appears on track. A handful of Senate Democrats joined with Republicans to advance the bill after what's become a deepening disruption of federal programs and services. But hurdles remain. Senators are hope…",
    "link": "https://apnews.com/article/government-shutdown-senate-deal-schumer-trump-33c6e37c68e9bf2d33770de0f3399563",
    "timestamp": "2025-11-10T12:11:02Z"
  },
  {
    "title": "A deal to end the government shutdown is on track but faces hurdles",
    "description": "WASHINGTON (AP) — A legislative package to end the government shutdown appears on track Monday after a handful of Senate Democrats joined with Republicans to break the impasse in what has become a deepening disruption of federal programs and services, the lon…",
    "link": "https://financialpost.com/pmn/a-deal-to-end-the-government-shutdown-is-on-track-but-faces-hurdles",
    "timestamp": "2025-11-10T12:09:14Z"
  },
  {
    "title": "Trump found yet another distasteful way to profit from the presidency",
    "description": "President Donald Trump has spent much of his second term so far doing, well, exactly the sorts of things he would be doing if he weren’t president.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-found-yet-another-distasteful-way-profit-presidency-rcna242700",
    "timestamp": "2025-11-10T12:09:04Z"
  },
  {
    "title": "WATCH: Trump becomes 1st president at a regular-season NFL game since 1978",
    "description": "President Donald Trump became the first commander-in-chief at a regular-season NFL game since 1978, attending Sunday's Commanders-Lions game in Landover, Maryland.",
    "link": "https://abcnews.go.com/Entertainment/video/trump-1st-president-regular-season-nfl-game-1978-127371156",
    "timestamp": "2025-11-10T12:08:41Z"
  },
  {
    "title": "BBC boss and head of news quit over Trump edit",
    "description": "Britain’s biggest and most important media organization, the BBC, is facing turmoil after its top executive and head of news resigned. They quit on Sunday over the broadcaster’s editing of a speech by U.S. President Donald Trump on Jan. 6, 2021, before protes…",
    "link": "https://apnews.com/article/britain-bbc-crisis-trump-panorama-a392fb275af25216ea23537c6f4347e4",
    "timestamp": "2025-11-10T12:08:20Z"
  },
  {
    "title": "Trump pardons key allies who helped in effort to subvert 2020 election results",
    "description": "President Donald Trump has pardoned Rudy Giuliani and scores of others accused of involvement in the effort to overturn the 2020 presidential election, Trump's pardon attorney said late Sunday.",
    "link": "https://biztoc.com/x/d5e2ad00ceee9bee",
    "timestamp": "2025-11-10T12:07:06Z"
  },
  {
    "title": "BBC faces leadership crisis after news bosses quit over Trump speech edit and bias claims",
    "description": "BBC's top executives resigned amid political pressure over the edited Donald Trump speech. The broadcaster faced accusations of bias after splicing remarks from January 6, 2021, to appear as a single quote urging supporters to 'fight like hell.'  Trump welcom…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/bbc-faces-leadership-crisis-after-news-bosses-quit-over-trump-speech-edit-and-bias-claims/articleshow/125224238.cms",
    "timestamp": "2025-11-10T12:05:39Z"
  },
  {
    "title": "President Trump issues new round of pardons tied to Georgia election interference case",
    "description": "The list includes several of Trump’s Fulton County co-defendants and Georgia’s so-called “fake electors.”",
    "link": "https://www.wsbradio.com/news/politics/president-trump-issues-new-round-pardons-tied-georgia-election-interference-case/IVB62MTHERAHPM4BJEFB4VZX24/",
    "timestamp": "2025-11-10T12:05:35Z"
  },
  {
    "title": "Sen. Ro Khanna Calls for Chuck Schumer’s Removal Amid Dem Anger Over Shutdown Vote",
    "description": "Sen. Ro Khanna (D-CA) called for the removal of Senate Minority Leader Chuck Schumer on Sunday, after eight Democratic caucus members broke with the party to advance an agreement that would end the government shutdown against Schumer’s wishes. Democratic unit…",
    "link": "https://www.mediaite.com/media/news/sen-ro-khanna-calls-for-chuck-schumers-removal-amid-dem-anger-over-shutdown-vote/",
    "timestamp": "2025-11-10T12:05:10Z"
  },
  {
    "title": "Morning Bid: A re-open rally",
    "description": "and global markets today , Editor-At-Large, Finance and Markets Just as U. households were fretting about the effect on travel and the wider economy of the...",
    "link": "https://finance.yahoo.com/news/morning-bid-open-rally-120344993.html",
    "timestamp": "2025-11-10T12:03:44Z"
  },
  {
    "title": "Trump pardons Giuliani, other key figures accused of trying to overturn 2020 election results",
    "description": "Trump pardons Giuliani, other key figures accused of trying to overturn 2020 election resultswsbtv.com",
    "link": "https://www.wsbtv.com/news/local/trump-pardons-giuliani-other-key-figures-accused-trying-overturn-2020-election/X4TIGKK6RBBTJOMKIFVUBL636Y/",
    "timestamp": "2025-11-10T12:00:52Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "President Donald Trump has pardoned his former personal lawyer Rudy Giuliani, his former chief of staff Mark Meadows and others accused of backing the Republican’s efforts to overturn the 2020 election, a Justice Department official says.",
    "link": "https://www.wpxi.com/news/local/trump-pardons-rudy-giuliani-others-who-backed-efforts-overturn-2020-election-official-says/TEP3QVAZ4JCHXEHL6M56LZPDSE/",
    "timestamp": "2025-11-10T12:00:51Z"
  },
  {
    "title": "Trump pardons Giuliani and others who backed efforts to overturn 2020 election...",
    "description": "A Justice Department official says President Donald Trump has pardoned his former personal lawyer Rudy Giuliani, his former chief of staff Mark Meadows and others accused of backing the Republican’s efforts to overturn the 2020 election. Government pardon att…",
    "link": "https://apnews.com/article/rudy-giuliani-donald-trump-pardons-2020-election-73348c1c5d2779741bf8af5b5ffb1472",
    "timestamp": "2025-11-10T12:00:16Z"
  },
  {
    "title": "Kremlin says active preparations underway for Putin visit to India",
    "description": "MOSCOW (Reuters) -The Kremlin said on Monday it was \"actively preparing\" for President Vladimir Putin to visit India before the end of the year and hoped it would be a substantive trip. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/10/kremlin-says-active-preparations-underway-for-putin-visit-to-india",
    "timestamp": "2025-11-10T11:58:00Z"
  },
  {
    "title": "BBC News’ Resigning CEO Rejects Trump’s ‘Corrupt Journalists’ Claim, Says Outlet Is ‘Not Institutionally Biased’: We Are the ‘World’s Most Trusted News Provider’",
    "description": "BBC News’ resigning CEO Deborah Turness has responded to criticism from U.S. President Donald Trump and others after the shocking news of her exit alongside director general Tim Davie on Sunday night. When questioned by journalists from her own newsroom outsi…",
    "link": "https://variety.com/2025/digital/global/bbc-news-resigning-ceo-rejects-trump-corrupt-journalists-claim-1236573833/",
    "timestamp": "2025-11-10T11:56:09Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others who backed efforts to overturn 2020 election, official says",
    "description": "",
    "link": "https://biztoc.com/x/f5e64b8e51b01c47",
    "timestamp": "2025-11-10T11:55:55Z"
  },
  {
    "title": "'Very Dishonest People': Trump Slams BBC Bias Crisis as Top Executives Quit",
    "description": "The BBC, which justifies its existence on quality and impartiality, is dishonest and antidemocratic, Trump says, as senior executives resign.\nThe post ‘Very Dishonest People’: Trump Slams BBC Bias Crisis as Top Executives Quit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/11/10/very-dishonest-people-trump-slams-bbc-bias-crisis-as-top-execs-quit/",
    "timestamp": "2025-11-10T11:54:52Z"
  },
  {
    "title": "Behind AI Hype, Climate Consequences",
    "description": "What started as rivulets of hype, hope, and alarm over artificial intelligence have combined into a tsunami-level wave washing over the American consciousness. ChatGPT is the most downloaded application in history, AI stock prices are hitting record market hi…",
    "link": "https://www.commondreams.org/opinion/climate-consequences-of-ai",
    "timestamp": "2025-11-10T11:50:03Z"
  },
  {
    "title": "Trump pardons allies accused of seeking to overturn his 2020 election loss",
    "description": "WASHINGTON (Reuters) -U.S. President Donald has pardoned at dozens of allies accused of trying to overturn his 2020 election loss, including Rudy Giuliani, Mark Meadows, Jeffrey Clark and Sidney Powell, a top U.S. Justice Department official said on Monday. R…",
    "link": "https://www.thestar.com.my/news/world/2025/11/10/trump-pardons-allies-accused-of-seeking-to-overturn-his-2020-election-loss",
    "timestamp": "2025-11-10T11:50:00Z"
  },
  {
    "title": "Trump pardons top allies involved in effort to overturn 2020 election",
    "description": "President Donald Trump has issued pardons for numerous allies and alleged co-conspirators in his efforts to overturn his 2020 election loss.Justice Department Pardon Attorney Ed Martin posted\r\n documents Sunday night showing the president issued “full, comple…",
    "link": "https://www.rawstory.com/trump-pardons-2674280711/",
    "timestamp": "2025-11-10T11:49:04Z"
  },
  {
    "title": "Thailand suspends Cambodia 'peace deal'",
    "description": "The two sides signed the agreement at a ceremony overseen by US President Donald Trump two weeks ago.",
    "link": "https://www.bbc.com/news/articles/c0l722nd283o",
    "timestamp": "2025-11-10T11:48:47Z"
  },
  {
    "title": "Cameron Winklevoss Digs Up News Report From 2013 To Make A Point About Bitcoin: 'You Will Miss Out On The World's Greatest Opportunities...'",
    "description": "Gemini co-founder Cameron Winklevoss took potshots Sunday at the British daily newspaper Financial Times for its 12-year-old article that predicted Bitcoin (...",
    "link": "https://finance.yahoo.com/news/cameron-winklevoss-digs-news-report-114608679.html",
    "timestamp": "2025-11-10T11:46:08Z"
  },
  {
    "title": "Russia Responds to BBC News Trump Impartiality Scandal",
    "description": "Russia attacked the BBC over the scandal involving its editing of video clips that were 54 minutes apart showing President Donald Trump's speech on January 6, 2021, so it misleadingly appeared he had encouraged his supporters to attack the U.S. Capitol.\n“They…",
    "link": "https://biztoc.com/x/00883b761a046a04",
    "timestamp": "2025-11-10T11:45:20Z"
  },
  {
    "title": "Reacher Fight Fatigue in The Daily LITG, 10th of November, 2025",
    "description": "Reacher Fight Fatigue was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history of co…",
    "link": "https://bleedingcool.com/tv/reacher-fight-fatigue-in-the-daily-litg-10th-of-november-2025/",
    "timestamp": "2025-11-10T11:45:04Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani, others involved in efforts to overturn 2020 election, pardon attorney says (Karina Tsui/CNN)",
    "description": "Karina Tsui / CNN:\nTrump pardons Rudy Giuliani, others involved in efforts to overturn 2020 election, pardon attorney says  —  President Donald Trump has pardoned a long list of his political allies for their support or involvement in alleged plans to overtur…",
    "link": "https://www.memeorandum.com/251110/p7",
    "timestamp": "2025-11-10T11:45:00Z"
  },
  {
    "title": "Donald Trump Tells Some Whopping Lies In Fox NFL Interview",
    "description": "Was it any surprise that the president's falsehoods spiraled at the Washington Commanders' football game?",
    "link": "https://www.huffpost.com/entry/donald-trump-lies-fox-nfl-interview-kenny-albert-jonathan-vilma_n_6911baa2e4b003bdc1851ee7",
    "timestamp": "2025-11-10T11:44:51Z"
  },
  {
    "title": "Trump's $2000 tariff dividend - here's how you will get it",
    "description": "Trump’s $2000 tariff dividend plan promises most Americans a payout funded by trade revenues. High-income earners are excluded. Treasury Secretary Scott Bessent said it may come through tax credits, refunds, or direct relief. The $2,000 figure equals potentia…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-2000-tariff-dividend-heres-how-you-will-get-it/articleshow/125223557.cms",
    "timestamp": "2025-11-10T11:43:06Z"
  },
  {
    "title": "Leading from the left in the world's financial capital",
    "description": "The week before his election as mayor of New York, Zohran Mamdani was labeled an ‘Marxist-Islamist' by a Fox News commentator. He was also called a ‘communist' by President Donald Trump, who made his fortune in New York real estate. Elon Musk flew to rival ma…",
    "link": "https://mondediplo.com/2025/11/14zohran-mamdani",
    "timestamp": "2025-11-10T11:42:45Z"
  },
  {
    "title": "Trump pardons election fraud whistleblowers targeted by Biden",
    "description": "The list includes Rudy Giuliani and 76 others indicted over alleged attempts to overturn the 2020 election Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627557-trump-pardons-election-whistleblowers-biden/",
    "timestamp": "2025-11-10T11:42:24Z"
  },
  {
    "title": "States face uncertainty as Trump administration tries to reverse SNAP food payments",
    "description": "States are facing uncertainty about providing full monthly benefits for a federal food program serving 42 million Americans.",
    "link": "https://www.wsls.com/health/2025/11/10/states-face-uncertainty-as-trump-administration-tries-to-reverse-snap-food-payments/",
    "timestamp": "2025-11-10T11:40:36Z"
  },
  {
    "title": "COP30 summit in Brazil: What to know about the UN climate conference?",
    "description": "Delegates from around the world are expected to disagree over how to tackle climate change and who should pay.",
    "link": "https://www.aljazeera.com/news/2025/11/10/cop30-summit-in-brazil-what-to-know-about-the-un-climate-conference",
    "timestamp": "2025-11-10T11:36:51Z"
  },
  {
    "title": "Whistleblower leaks Ghislaine Maxwell pardon plea planned for Trump",
    "description": "Jeffrey Epstein associate Ghislaine Maxwell, having struck out with the Supreme Court in her bid for freedom after being convicted of sex trafficking, is now prepping a package to be given to Donald Trump in the hope that he will commute her sentence.Accordin…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-trump-2674280655/",
    "timestamp": "2025-11-10T11:36:36Z"
  },
  {
    "title": "Trump pardons Giuliani and allies over bid to overturn 2020 election",
    "description": "Donald Trump has pardoned his former personal lawyer, Rudy Giuliani, and others accused of trying to overturn the result of the 2020 election.",
    "link": "https://news.sky.com/story/trump-pardons-giuliani-and-allies-over-bid-to-overturn-2020-election-13467999",
    "timestamp": "2025-11-10T11:35:00Z"
  },
  {
    "title": "A divided America celebrates its 250th birthday",
    "description": "A divided America celebrates its 250th birthday\nThe past, like everything else, has become a partisan battleground\nBy James Bennet, Lexington columnist, The Economist\nDonald Trump may not be the most literary of men, but he hit upon the perfect metaphor when …",
    "link": "https://biztoc.com/x/c8ab7043dcaad9f5",
    "timestamp": "2025-11-10T11:34:38Z"
  },
  {
    "title": "The contours of 21st-century geopolitics will become clearer in 2026",
    "description": "By Zanny Minton Beddoes, Editor-in-chief, The Economist\nIn global politics 2025 was the year when an old order ended. President Donald Trump demolished decades-old norms and institutions as dramatically as he set about reshaping the White House. His tariffs b…",
    "link": "https://biztoc.com/x/7970571992ccb78b",
    "timestamp": "2025-11-10T11:34:36Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani and others involved in bid to overturn 2020 election, attorney says",
    "description": "President Donald Trump has pardoned Rudy Giuliani and scores of others accused of involvement in the effort to overturn the 2020 presidential election, Trump's pardons attorney said late Sunday",
    "link": "https://www.nbcnews.com/politics/elections/trump-pardons-rudy-giuliani-others-involved-bid-overturn-2020-election-rcna242956",
    "timestamp": "2025-11-10T11:34:35Z"
  }
]