[
  {
    "title": "Treasury Secretary Scott Bessent: US Should Take ‘Worldwide Lead in Crypto’",
    "description": "Treasury Secretary Scott Bessent said Friday (March 7) that he is a “big proponent of the U.S. taking the worldwide lead in crypto.” Speaking on CNBC’s “Squawk Box,” Bessent said the U.S. needs to bring cryptocurrency onshore and use the country’s best practi…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/treasury-secretary-scott-bessent-us-should-take-worldwide-lead-in-crypto/",
    "timestamp": "2025-03-07T15:40:19Z"
  },
  {
    "title": "The Situation: A Ukrainian Hostage Situation (Benjamin Wittes/Default)",
    "description": "Benjamin Wittes / Default:\nThe Situation: A Ukrainian Hostage Situation  —  Toying with the lives of Ukrainians in the United States  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Monday compared Donald Tr…",
    "link": "https://www.memeorandum.com/250307/p36",
    "timestamp": "2025-03-07T15:40:02Z"
  },
  {
    "title": "Trump’s crypto summit ‘not going to have anything on taxes’ — White House official",
    "description": "The Trump administration plans to \"roll back\" Joe Biden's war on crypto and treat Bitcoin as the \"digital Fort Knox for digital gold.\"",
    "link": "https://cointelegraph.com/news/trump-crypto-summit-bitcoin-tax-crypto",
    "timestamp": "2025-03-07T15:38:37Z"
  },
  {
    "title": "Trump signs order to create US strategic crypto reserve: ‘Digital Fort Knox’",
    "description": "Under Trump’s directive, the federal government’s crypto stockpile will be built around a Bitcoin reserve worth an estimated $17 billion which has been amassed through legal seizures.",
    "link": "https://nypost.com/2025/03/07/business/trump-signs-executive-order-establishing-crypto-strategic-reserve/",
    "timestamp": "2025-03-07T15:38:15Z"
  },
  {
    "title": "Tusk announces plan to train all Polish men for military service",
    "description": "Poland aims to build up its military to half a million men to face Russia.",
    "link": "https://www.politico.eu/article/donald-tusk-plan-train-poland-men-military-service-russia/",
    "timestamp": "2025-03-07T15:38:12Z"
  },
  {
    "title": "US throws challenge of “macro, large scale” trade agreement to include agriculture before India",
    "description": "US Commerce Secretary says India’s tariff policy towards US needs to be brought down; Trump again labels India as “high tariff country”",
    "link": "https://www.thehindubusinessline.com/economy/us-throws-challenge-of-macro-large-scale-trade-agreement-to-include-agriculture-before-india/article69303801.ece",
    "timestamp": "2025-03-07T15:37:53Z"
  },
  {
    "title": "$860 billion rearmament plan fuels European defense stocks",
    "description": "LONDON — European defense firms appear set to profit from a massive EU investment in armaments, as the bloc reacts to a U.S. pivot away from Europe’s security under President Donald Trump. \n\n\nThe $860 billion “ReArm Europe Plan” faces opposition, however, fro…",
    "link": "https://www.voanews.com/a/billion-rearmament-plan-fuels-european-defense-stocks/8002455.html",
    "timestamp": "2025-03-07T15:37:01Z"
  },
  {
    "title": "Trump sought changes to Canada border deals in February",
    "description": "United States President Donald Trump reportedly told Canadian Prime Minister Justin Trudeau in early February that he wanted to revise the treaty defining the US-Canada border. According to The New Yo...",
    "link": "https://biztoc.com/x/f2c1101ac3c4c91e",
    "timestamp": "2025-03-07T15:36:52Z"
  },
  {
    "title": "Lin-Manuel Miranda Sparks Fight With Donald Trump Over ‘Hamilton’ Cancelation",
    "description": "A strange feud is brewing in Washington, D.C., between President Donald Trump and Hamilton creator and Disney songwriter Lin-Manuel Miranda. Earlier this week, Miranda and Hamilton producer Jeff Sellers took to social media and the New York Times to announce …",
    "link": "https://insidethemagic.net/2025/03/hamilton-cancels-kennedy-center-performances-over-trump-policies-rl1/",
    "timestamp": "2025-03-07T15:36:38Z"
  },
  {
    "title": "Dolly Parton pays musical tribute to late husband with new single If You Hadn't Been There",
    "description": "This is Dolly Parton's first new single in two years. Parton posted her song shortly after she shared a tribute to her late husband Carl Thomas Dean on Instagram. Dean passed away earlier this week. The couple had been married for almost six decades.",
    "link": "https://economictimes.indiatimes.com/news/international/us/dolly-parton-pays-musical-tribute-to-late-husband-with-new-single-if-you-hadnt-been-there/articleshow/118790387.cms",
    "timestamp": "2025-03-07T15:36:03Z"
  },
  {
    "title": "Trump Threatens To Turn Screws On Russia If Battlefield ‘Pounding’ Of Ukraine Continues",
    "description": "President Donald Trump threatened Russia Friday with sanctions and widespread tariffs if Kremlin forces continue attacking Ukraine.",
    "link": "https://dailycaller.com/2025/03/07/trump-threatens-to-turn-screws-on-russia-if-battlefield-pounding-of-ukraine-continues/",
    "timestamp": "2025-03-07T15:36:03Z"
  },
  {
    "title": "Elon Musk celebrates firing of federal worker who refused to remove pronouns from emails",
    "description": "Elon Musk and Texas governor Greg Abbott have celebrated the firing of a worker who refused to remove his pronouns from his email signature.  Former program manager at the Texas real estate commission (TREC), Frank Zamora, was axed from his role after he refu…",
    "link": "https://www.thepinknews.com/2025/03/07/elon-musk-pronouns-texas/",
    "timestamp": "2025-03-07T15:35:02Z"
  },
  {
    "title": "Blockchain industry braces for White House Crypto Summit: What to expect",
    "description": "The White House Crypto Summit brings top industry leaders together as President Trump’s Bitcoin reserve plans spark debate over the future of crypto policy in the US.",
    "link": "https://cointelegraph.com/news/blockchain-industry-braces-for-white-house-crypto-summit-what-to-expect",
    "timestamp": "2025-03-07T15:34:41Z"
  },
  {
    "title": "Trump Threatens New Russia Sanctions Over Ukraine Attacks",
    "description": "President Donald Trump on Friday threatened new sanctions and tariffs on Russia over its bombardments of Ukraine, after previously suspending US aid to Kyiv in a stated bid to encourage diplomacy.",
    "link": "https://www.ndtv.com/world-news/trump-threatens-new-russia-sanctions-over-ukraine-attacks-7872188",
    "timestamp": "2025-03-07T15:30:15Z"
  },
  {
    "title": "Biden’s Russia sanctions ‘egregiously weak’ – US Treasury",
    "description": "The previous administration’s sanctions on Russian energy were politically motivated, according to the Treasury Department Read Full Article at RT.com",
    "link": "https://www.rt.com/business/613862-us-sanctions-russia-ukraine/",
    "timestamp": "2025-03-07T15:30:11Z"
  },
  {
    "title": "Donald Trump gives ultimatum to Russia as he makes penalties threat in new statement",
    "description": "Donald Trump has told Russia and Ukraine to 'get to the table right now' after revealing he's considering banking sanctions and tariffs on Russia.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-sanctions-tariffs-russia-ukraine-832471-20250307",
    "timestamp": "2025-03-07T15:30:08Z"
  },
  {
    "title": "Indian Refiner BPCL Seeks to Buy U.S. WTI Oil in Four Consecutive Months",
    "description": "India’s state-owned refiner Bharat Petroleum Corporation Limited (BPCL) prepares to issue a tender to buy U.S. WTI crude in four consecutive months this summer, a source with knowledge of the plans told Reuters on Friday. Indian refiners are looking to boost …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indian-Refiner-BPCL-Seeks-to-Buy-US-WTI-Oil-in-Four-Consecutive-Months.html",
    "timestamp": "2025-03-07T15:30:00Z"
  },
  {
    "title": "Bitcoin fell all the way to $84,000 as Trump's crypto reserve failed to impress",
    "description": "Just hours before the White House Crypto Summit, President Donald Trump signed an executive order to establish a strategic Bitcoin reserve and a separate stockpile of other digital assets. The news plunged Bitcoin to $84,000 Thursday evening, however, as the …",
    "link": "https://qz.com/bitcoin-plunged-flat-trump-signed-bitcoin-reserve-order-1851768406",
    "timestamp": "2025-03-07T15:30:00Z"
  },
  {
    "title": "Here’s where the jobs are for February 2025 – in one chart",
    "description": "February marked another strong month for health care despite job growth overall coming in weaker than expected but stable.",
    "link": "https://www.cnbc.com/2025/03/07/heres-where-the-jobs-are-for-february-2025-in-one-chart.html",
    "timestamp": "2025-03-07T15:29:39Z"
  },
  {
    "title": "Fox News Host Begs Trump for Tariffs Clarity—as He Makes Things Worse",
    "description": "Donald Trump’s tariffs plan has caused a lot of confusion with his repeated reversals, carve-outs, and threats to raise them. So, in an interview that aired Friday, Fox Business’s Maria Baritromo asked the president to clear things up.\r\n“Can you give us a sen…",
    "link": "https://newrepublic.com/post/192465/fox-news-trump-tariffs-clarity",
    "timestamp": "2025-03-07T15:27:54Z"
  },
  {
    "title": "Trump offers nuclear talks with Iran",
    "description": "US President Donald Trump said he has written to Iran pressing for talks on preventing the development of nuclear weapons, warning it faces possible military action if not. Iran’s foreign minister told AFP on Friday that the country would not negotiate so lon…",
    "link": "https://www.digitaljournal.com/world/trump-offers-nuclear-talks-with-iran/article",
    "timestamp": "2025-03-07T15:27:20Z"
  },
  {
    "title": "Trump Offers Nuclear Talks With Iran",
    "description": "US President Donald Trump said he has written to Iran pressing for talks on preventing the development of nuclear weapons, warning it faces possible military action if not.",
    "link": "https://www.ibtimes.com/trump-offers-nuclear-talks-iran-3765506",
    "timestamp": "2025-03-07T15:27:11Z"
  },
  {
    "title": "‘We have nothing left to lose’: Gazans respond to Trump’s warnings",
    "description": "The US president's threats mean little to a population battered by 16 months of total war",
    "link": "https://www.aljazeera.com/news/2025/3/7/we-have-nothing-left-to-lose-gazans-respond-to-trumps-warnings",
    "timestamp": "2025-03-07T15:26:35Z"
  },
  {
    "title": "Trump says UAW head supports tariffs",
    "description": "United States President Donald Trump took to Truth Social on Friday, seizing on remarks from the United Auto Workers (UAW) to reinforce his stance on trade policy.\"The head of the United Autoworkers o...",
    "link": "https://biztoc.com/x/7c281015214f4249",
    "timestamp": "2025-03-07T15:25:50Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Elon Musk For Wanting To “Pull Out” Of The U.N., NATO: “He Has 14 Kids, He Doesn’t Ever Pull Out”",
    "description": "Kimmel then went on to brutally criticize the \"ridiculous\" names Musk gave his 14 children.",
    "link": "https://decider.com/2025/03/07/jimmy-kimmel-roasts-elon-musk-un-nato-14-kids/",
    "timestamp": "2025-03-07T15:25:09Z"
  },
  {
    "title": "President Trump Will ‘Probably’ Extend TikTok Ban Deadline",
    "description": "President Donald Trump says he will \"probably\" extend the deadline for the sale of TikTok -- as reports suggest there have still not been any negotiations between the app's Chinese owner and prospective buyers.\n[Read More]",
    "link": "https://petapixel.com/2025/03/07/president-trump-will-probably-extend-tiktok-ban-deadline/",
    "timestamp": "2025-03-07T15:24:39Z"
  },
  {
    "title": "NYC's immigrant affairs leader criticized for staying mum on Trump's policies",
    "description": "Manuel Castro, head of the mayor’s Office of Immigrant Affairs, testified before a City Council hearing on Thursday.\n \n\nCommissioner Manuel Castro refused to comment on President Trump's mass deportation plans. [ more › ]",
    "link": "https://gothamist.com/news/nycs-immigrant-affairs-leader-criticized-for-staying-mum-on-trumps-policies",
    "timestamp": "2025-03-07T15:23:00Z"
  },
  {
    "title": "As Crypto Summit Nears, White House Maintains Special Status for Bitcoin",
    "description": "The approach to the newly announced bitcoin reserve grants that BTC deserves special treatment among digital assets, a White House official said.",
    "link": "https://www.coindesk.com/policy/2025/03/07/as-crypto-summit-nears-white-house-maintains-special-status-for-bitcoin",
    "timestamp": "2025-03-07T15:22:29Z"
  },
  {
    "title": "Trump Says Farmers Keen To Quit 'Terrible' S. Africa Welcome In US",
    "description": "President Donald Trump said Friday South African farmers were welcome to settle in the United States after repeating his accusations that the government was \"confiscating\" land from white people as he announced an end to federal funding.",
    "link": "https://www.ibtimes.com/trump-says-farmers-keen-quit-terrible-s-africa-welcome-us-3765500",
    "timestamp": "2025-03-07T15:21:17Z"
  },
  {
    "title": "‘How do you do, fellow trucks?’: Tesla owners are trying to pass their cars off as other makes in growing trend",
    "description": "Embarrassed or nervous owners of Tesla vehicles have been caught disguising their cars and Cybertrucks as Mazdas and pickup trucks. Photos of these attempts to fool or placate Elon Musk critics began appearing across social media platforms in February 2025.\n\n…",
    "link": "https://www.dailydot.com/culture/tesla-disguise-cybertruck-toyota-mazda/",
    "timestamp": "2025-03-07T15:20:54Z"
  },
  {
    "title": "Democrats Who Disrupted Trump's Speech Were Forced Into 'Come to Jesus' Meeting With Party Leaders After: Report",
    "description": "House Democratic leaders privately confronted members who disrupted President Donald Trump's address to Congress as they were asked to not make coverage about themselves",
    "link": "https://www.ibtimes.com/democrats-who-disrupted-trumps-speech-were-forced-come-jesus-meeting-party-leaders-after-3765495",
    "timestamp": "2025-03-07T15:20:45Z"
  },
  {
    "title": "Trump says farmers keen to quit ‘terrible’ S. Africa welcome in US",
    "description": "President Donald Trump said Friday South African farmers were welcome to settle in the United States after repeating his accusations that the government was “confiscating” land from white people as he announced an end to federal funding. Trump posted on his T…",
    "link": "https://www.digitaljournal.com/world/trump-says-farmers-keen-to-quit-terrible-s-africa-welcome-in-us/article",
    "timestamp": "2025-03-07T15:20:34Z"
  },
  {
    "title": "SEC’s Uyeda Expects Slowdown in Rulemaking After ‘Ambitious’ Biden Era",
    "description": "The interim chief of the US Securities and Exchange Commission says he expects a slowdown in the Wall Street regulator’s rulemaking after three-and-half “overly ambitious” years of pursuing market reforms. “The way I look at financial regulation is, we’re not…",
    "link": "https://www.insurancejournal.com/news/national/2025/03/07/814674.htm",
    "timestamp": "2025-03-07T15:20:30Z"
  },
  {
    "title": "Now Trump turns on PUTIN as he issues crippling threat & demands Russia ‘get to table right NOW’ to end war in Ukraine",
    "description": "US President Trump has threatened Putin with \"large-scale\" sanctions and tariffs as he demands Russia to \"get to the table right now before it's too late\". It comes as Zelensky proposed an aerial truce with Moscow after the \"massive\" overnight missile blitz o…",
    "link": "https://freerepublic.com/focus/f-chat/4302751/posts",
    "timestamp": "2025-03-07T15:20:29Z"
  },
  {
    "title": "Trump Asked For The Real Declaration of Independence Be Moved Into His Office, 'Alarming' Aides: Report",
    "description": "President Donald Trump has reportedly asked advisers about the possibility of moving the Declaration of Independence into the Oval Office",
    "link": "https://www.ibtimes.com/trump-asked-real-declaration-independence-moved-his-office-alarming-aides-report-3765492",
    "timestamp": "2025-03-07T15:20:03Z"
  },
  {
    "title": "Trump ends collective bargaining for 50,000 TSA officers",
    "description": "The Trump administration is ending collective bargaining for more than 50,000 TSA officers that staff checkpoints at airports and other transportation hubs.",
    "link": "https://www.cnbc.com/2025/03/07/trump-administration-ends-collective-bargaining-for-50000-tsa-officers.html",
    "timestamp": "2025-03-07T15:19:40Z"
  },
  {
    "title": "America finding out it’s very difficult to import eggs",
    "description": "U.S. officials are searching across oceans to find enough eggs to ease a shortage that has sent prices soaring. Read here for more",
    "link": "https://financialpost.com/commodities/agriculture/america-learning-difficult-to-import-eggs",
    "timestamp": "2025-03-07T15:19:06Z"
  },
  {
    "title": "Trump threatens Russia with sanctions, tariffs until ceasefire with Ukraine",
    "description": "President Donald Trump appeared to turn up the heat against Russia to step up and seek a deal that would end the conflict with Ukraine.",
    "link": "https://abcnews.go.com/Politics/trump-threatens-russia-sanctions-tariffs-ceasefire-peace-deal/story?id=119551657",
    "timestamp": "2025-03-07T15:19:01Z"
  },
  {
    "title": "Donald Trump administration revokes first student visa over participation in pro-Hamas protests",
    "description": "The US State Department has revoked the visa of a foreign student involved in pro-Hamas protests on a college campus. This move follows President Donald Trump's crackdown on anti-Israel demonstrations. The administration is also using AI to monitor social med…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-administration-revokes-first-student-visa-over-participation-in-pro-hamas-protests/articleshow/118790205.cms",
    "timestamp": "2025-03-07T15:18:19Z"
  },
  {
    "title": "Enbridge to Invest $1.39 Billion until 2028 in Mainline Pipeline",
    "description": "Enbridge has earmarked an investment of up to about $1.39 billion until 2028 for a Canada-U.S. liquids pipeline with a capacity of about 3 million barrels a day of crude oil.",
    "link": "https://www.rigzone.com/news/enbridge_to_invest_139_billion_until_2028_in_mainline_pipeline-07-mar-2025-179853-article/",
    "timestamp": "2025-03-07T15:18:10Z"
  },
  {
    "title": "How to Save the Democratic Party From Itself",
    "description": "Jeet Heer\n\n\n\nThe flailing and unpopular party elite needs to be replaced with fighting economic populists.\r\n\n\r\n\n\nThe post How to Save the Democratic Party From Itself appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/save-democratic-party-takeover/",
    "timestamp": "2025-03-07T15:18:00Z"
  },
  {
    "title": "Why a Possible Trump-Putin Rapprochement Is Good for China",
    "description": "Whatever the U.S. intentions, the outcome of the Russia-U.S. dialogue would be beneficial for China.",
    "link": "https://thediplomat.com/2025/03/why-a-possible-trump-putin-rapprochement-is-good-for-china/",
    "timestamp": "2025-03-07T15:18:00Z"
  },
  {
    "title": "U.S. employers add 151,000 jobs last month though unemployment up to 4.1 percent",
    "description": "U.S. employers added solid 151,000 jobs last month, but the outlook is cloudy as President Donald threatens a trade war, purges the federal workforce and promises to deport millions of immigrants.",
    "link": "https://www.pbs.org/newshour/nation/u-s-employers-add-151000-jobs-last-month-though-unemployment-up-to-4-1-percent",
    "timestamp": "2025-03-07T15:17:22Z"
  },
  {
    "title": "Border state lawmaker demands Border Patrol agents be paid during pending shutdown: 'Above and beyond'",
    "description": "Rep. Monica De La Cruz, R-Texas, is reintroducing a bill to make sure that Border Patrol agents are paid in the event of a government shutdown, as numbers drop at the border.",
    "link": "https://www.foxnews.com/politics/border-state-lawmaker-demands-border-patrol-agents-paid-pending-shutdown",
    "timestamp": "2025-03-07T15:16:21Z"
  },
  {
    "title": "Why should America worry about Trump? Answer might be in egg prices",
    "description": "Democrats shift focus to everyday concerns like rising egg prices amid Trump's second term. With egg prices hitting record highs, they argue economic issues resonate more with working-class Americans than abstract constitutional debates. Efforts include highl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-egg-prices-democrats-why-should-america-worry-about-trump-answer-might-be-in-skyrocketing-egg-prices/articleshow/118790229.cms",
    "timestamp": "2025-03-07T15:16:10Z"
  },
  {
    "title": "Is Donald Trump functionally illiterate? Mounting evidence says Yes [Dumbass]",
    "description": "Is Donald Trump functionally illiterate? Mounting evidence says Yes",
    "link": "https://www.fark.com/comments/13587814/Is-Donald-Trump-functionally-illiterate-Mounting-evidence-says-Yes",
    "timestamp": "2025-03-07T15:16:09Z"
  },
  {
    "title": "Alaska leaders optimistic by Trump's mention of LNG pipeline",
    "description": "The proposed gas line has recently seen a significant \"forward momentum\" over the last few months.",
    "link": "https://www.newsminer.com/news/local_news/alaska-leaders-optimistic-by-trumps-mention-of-lng-pipeline/article_d45143f2-faa8-11ef-8394-879f3bf31c66.html",
    "timestamp": "2025-03-07T15:15:00Z"
  },
  {
    "title": "Trump sought changes to US-Canada border deals in February",
    "description": "United States President Donald Trump reportedly told Canadian Prime Minister Justin Trudeau in early February that he wanted to revise the treaty defining the US-Canada border. According to The New Yo...",
    "link": "https://biztoc.com/x/1b4e077f0cbd9141",
    "timestamp": "2025-03-07T15:14:41Z"
  },
  {
    "title": "Reversing Kissinger",
    "description": "The former secretary of state’s 1972 opening to China badly weakened the U.S. By dispensing with that conceit, Trump shows he intends for America to win the great-power competition. The undiplomatic words that Donald Trump had for Ukrainian President Volodymy…",
    "link": "https://freerepublic.com/focus/f-chat/4302750/posts",
    "timestamp": "2025-03-07T15:13:49Z"
  },
  {
    "title": "Rogan Mocks ‘Suicide Cult’ Left for Trying to Mimic His Podcast Success: ‘You Guys Are Out of Your Minds!’",
    "description": "Joe Rogan argued the left can't mimic the success of his and other podcasts because they belong to a \"suicide cult.\"\nThe post Rogan Mocks ‘Suicide Cult’ Left for Trying to Mimic His Podcast Success: ‘You Guys Are Out of Your Minds!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/podcasts/rogan-mocks-suicide-cult-left-for-trying-to-mimic-his-podcast-success-you-guys-are-out-of-your-minds/",
    "timestamp": "2025-03-07T15:13:00Z"
  },
  {
    "title": "US threatens Russia with more sanctions",
    "description": "Washington is ready to use “leverage” on Moscow to facilitate a peace deal in Ukraine, Treasury Secretary Scott Bessent has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613868-us-russia-sanctions-leverage-ukraine/",
    "timestamp": "2025-03-07T15:11:24Z"
  },
  {
    "title": "Bitcoin leaps toward $90K as US jobs data offers pre-crypto summit boost",
    "description": "Bitcoin commentators' attention switches to US macro data as the White House Crypto Summit arrives with the Strategic Reserve already in place.",
    "link": "https://cointelegraph.com/news/bitcoin-leaps-90k-us-jobs-data-crypto-summit-boost",
    "timestamp": "2025-03-07T15:11:02Z"
  },
  {
    "title": "Trump says he is considering putting banking sanctions, tariffs on Russia",
    "description": "(Reuters) - U.S. President Donald Trump said on Friday that he is \"strongly considering\" imposing sanctions, including ones on banking, and tariffs on Russia until a ceasefire and peace agreement is reached with Ukraine.` Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/07/trump-says-he-is-considering-putting-banking-sanctions-tariffs-on-russia",
    "timestamp": "2025-03-07T15:11:00Z"
  },
  {
    "title": "‘The American empire is over’: Economist Richard Wolff",
    "description": "Marc Lamont Hill talks with economist Richard Wolff about Trump’s economic policies and global relations.",
    "link": "https://www.aljazeera.com/program/upfront/2025/3/7/the-american-empire-is-over-economist-richard-wolff",
    "timestamp": "2025-03-07T15:10:37Z"
  },
  {
    "title": "Trump Threatens Russia with ‘Large Scale’ Sanctions",
    "description": "“President Donald Trump indicated Friday that he is considering imposing ‘large scale’ sanctions on Russia to pressure the country into a ceasefire and peace deal with Ukraine,” the Washington Post reports. He added that both",
    "link": "https://politicalwire.com/2025/03/07/trump-threatens-russia-with-large-scale-sanctions/",
    "timestamp": "2025-03-07T15:10:16Z"
  },
  {
    "title": "'Hamilton' cancels itself, Democrats' outrage theater, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/hamilton-cancels-itself-democrats-outrage-theater-more-from-fox-news-opinion",
    "timestamp": "2025-03-07T15:09:50Z"
  },
  {
    "title": "Trump threatens new Russia sanctions over Ukraine attacks",
    "description": "WASHINGTON: President Donald Trump on Friday (Mar 7) threatened new sanctions and tariffs on Russia over its bombardments of Ukraine, after previously suspending US aid to Kyiv in a stated bid to encourage diplomacy. \"Based on the fact that Russia is absolute…",
    "link": "https://www.channelnewsasia.com/world/trump-threatens-new-russia-sanctions-over-ukraine-attacks-4986016",
    "timestamp": "2025-03-07T15:09:42Z"
  },
  {
    "title": "Fox News’ Trey Yingst Rebukes Trump in Awards Speech: ‘Journalists Are Not the Enemy of the People’",
    "description": "Fox News' chief foreign correspondent Trey Yingst rebuked President Donald Trump after receiving an award on Thursday night.\nThe post Fox News’ Trey Yingst Rebukes Trump in Awards Speech: ‘Journalists Are Not the Enemy of the People’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/news/fox-news-trey-yingst-rebukes-trump-in-awards-speech-journalists-are-not-the-enemy-of-the-people/",
    "timestamp": "2025-03-07T15:09:30Z"
  },
  {
    "title": "Trump says he sent letter to Iranian leader to negotiate deal",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said he wants to negotiate a nuclear weapons program deal with Iran and sent a letter to Iran on Wednesday saying he hoped they would negotiate. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/07/trump-says-he-sent-letter-to-iranian-leader-to-negotiate-deal",
    "timestamp": "2025-03-07T15:09:00Z"
  },
  {
    "title": "How Hamas Can Be Destroyed With Military Force | Opinion",
    "description": "Recent events have reignited the debate over whether Hamas can be defeated militarily.",
    "link": "https://www.newsweek.com/how-hamas-can-destroyed-military-force-opinion-2041216",
    "timestamp": "2025-03-07T15:08:15Z"
  },
  {
    "title": "Zelensky shouldn’t ‘take the American people for granted’ – Tulsi Gabbard",
    "description": "President Donald Trump froze aid to Ukraine to make sure it’s not taking US help for granted, intelligence chief Tulsi Gabbard has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613876-zelensky-aid-for-granted/",
    "timestamp": "2025-03-07T15:08:08Z"
  },
  {
    "title": "Trump threatens massive sanctions on Russia for continued attacks on Ukraine, tells Moscow and Kyiv ‘get to the table right now’",
    "description": "President Trump threatened massive sanctions against Russia on Friday over its continued attacks on Ukraine as he attempts to broker a cease-fire in the more than three-year war between the nations. “Based on the fact that Russia is absolutely ‘pounding’ Ukra…",
    "link": "https://freerepublic.com/focus/f-news/4302745/posts",
    "timestamp": "2025-03-07T15:07:52Z"
  },
  {
    "title": "Trump threatens massive sanctions on Russia for continued attacks on Ukraine, tells Moscow and Kyiv ‘get to the table right now’",
    "description": "President Trump threatened massive sanctions against Russia on Friday over its continued attacks on Ukraine as he attempts to broker a cease-fire in the more than three-year war between the nations. “Based on the fact that Russia is absolutely ‘pounding’ Ukra…",
    "link": "https://freerepublic.com/focus/f-chat/4302745/posts",
    "timestamp": "2025-03-07T15:07:52Z"
  },
  {
    "title": "‘Ice Queen’ No More: Sheinbaum Charms Trump on Tariffs",
    "description": "Claudia Sheinbaum’s dispassionate style on the campaign trail was once seen as such a political weakness that her opponent in last year’s Mexican presidential election branded her “The Ice Queen.”",
    "link": "https://financialpost.com/pmn/business-pmn/ice-queen-no-more-sheinbaum-charms-trump-on-tariffs",
    "timestamp": "2025-03-07T15:06:10Z"
  },
  {
    "title": "Trump's Shockingly Lawless Second Term (Rolling Stone)",
    "description": "Rolling Stone:\nTrump's Shockingly Lawless Second Term  —  Donald Trump and Elon Musk are blindly purging the government to make it more MAGA and cruel, ignoring the law, and cashing in like America has never seen  —  T  —  here were less than four days to go …",
    "link": "https://www.memeorandum.com/250307/p30",
    "timestamp": "2025-03-07T15:05:01Z"
  },
  {
    "title": "Zelensky Won't Apologize to Trump Over 'Useful' Conversation: Aide",
    "description": "Ukrainian President Volodymyr Zelensky will not apologize to President Donald Trump after their \"useful\" conversation at the White House on February 28, the adviser to the head of the president's office, Mykhailo Podolyak, told French news outlet Le Point.\nNe…",
    "link": "https://biztoc.com/x/ea7b1314de9ae2b0",
    "timestamp": "2025-03-07T15:03:47Z"
  },
  {
    "title": "Donald Trump threatens Russia with additional sanctions and tariffs",
    "description": "US president calls on Moscow to get to the bargaining table ‘right now’",
    "link": "https://biztoc.com/x/64e995f361c06fc8",
    "timestamp": "2025-03-07T15:03:27Z"
  },
  {
    "title": "Trump finally floats sanctions against Russia — while taking a shot at Ukraine",
    "description": "President Donald Trump is finally talking tough against Russia.In a post on his Truth Social page, the president floated the possibility of hitting Russia with even more economic sanctions given that Moscow so far has shown little willingness to make any conc…",
    "link": "https://www.rawstory.com/trump-russia-2671287506/",
    "timestamp": "2025-03-07T15:03:16Z"
  },
  {
    "title": "SXSW Preview + Hot List: Blake Lively, Jenna Ortega, Michelle Obama, Matthew McConaughey & More Coming To Austin",
    "description": "Usually, it’s the films that are loud at SXSW in Austin, however, this year a parade of personalities in the City of the Violet Crown will be creating plenty of thunder including Blake Lively, Jenna Ortega, former First Lady Michelle Obama, Disney Co-Chairman…",
    "link": "http://deadline.com/2025/03/sxsw-2025-movies-blake-lively-jenna-ortega-ben-affleck-1236313183/",
    "timestamp": "2025-03-07T15:02:50Z"
  },
  {
    "title": "Trump’s Night at the Opera",
    "description": "Trump’s Night at the Opera. A stunning production of Melville’s tale of vengeance and obsession applies to a certain president\nThe post Trump’s Night at the Opera appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/07/trumps-night-at-the-opera/",
    "timestamp": "2025-03-07T15:01:07Z"
  },
  {
    "title": "Bessent Warns of ‘Detox Period’ for Economy, Touts Trump ‘Call’",
    "description": "Treasury Secretary Scott Bessent warned that the US economy may see some disruption as the Trump administration shifts the basis for growth away from the government and toward the private sector.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-warns-of-detox-period-for-economy-touts-trump-call",
    "timestamp": "2025-03-07T15:01:03Z"
  },
  {
    "title": "Marine injured in Abbey Gate bombing praises Trump for not forgetting families after US nabs suspect",
    "description": "Retired Marine Corps. Sgt. Tyler Vargas-Andrews, who was injured in Kabul airport bombing, said President Trump promised \"accountability\" in the U.S. government and beyond.",
    "link": "https://www.foxnews.com/media/marine-injured-abbey-gate-bombing-says-trump-fulfilled-personal-promise-nabbing-terrorist",
    "timestamp": "2025-03-07T15:00:59Z"
  },
  {
    "title": "Mickey 17 Is a Misbegotten Sci-Fi Trump Satire",
    "description": "Robert Pattinson stars as spacefaring multiples in director Bong Joon-ho's disappointing follow-up to 'Parasite'.",
    "link": "https://reason.com/2025/03/07/mickey-17-is-a-misbegotten-sci-fi-trump-satire/",
    "timestamp": "2025-03-07T15:00:52Z"
  },
  {
    "title": "Trump Hints at Extension of TikTok Deadline",
    "description": "The April 5 deadline to decide TikTok's U.S. fate may not be set in stone. While speaking with reporters in the Oval Office on March 6, President Donald Trump indicated that he would extend the deadline for TikTok to find a U.S.-based buyer if a deal is not r…",
    "link": "https://www.adweek.com/media/trump-hints-at-extension-of-tiktok-deadline/",
    "timestamp": "2025-03-07T15:00:51Z"
  },
  {
    "title": "The Role of Differential Privacy in Protecting Sensitive Information in the Era of Artificial Intelligence",
    "description": "Differential privacy (DP) protects data by adding noise to queries, preventing re-identification while maintaining utility, addressing Artificial Intelligence -era privacy challenges. In the era of Artificial Intelligence, confidentiality and security are bec…",
    "link": "https://securityaffairs.com/175061/security/differential-privacy-in-protecting-sensitive-information-in-the-era-of-artificial-intelligence.html",
    "timestamp": "2025-03-07T15:00:38Z"
  },
  {
    "title": "Russia launches major aerial assault on Ukraine days after US shut off military aid | CNN",
    "description": "Russia fired cruise and ballistic missiles at Ukraine in a major overnight attack, Volodymyr Zelensky said Friday, as the Ukrainian president renewed his plea for a partial ceasefire at the end of a week in which the United States suspended military aid and i…",
    "link": "https://www.cnn.com/2025/03/07/world/russia-aerial-assault-ukraine-us-pause-military-aid-intl/index.html",
    "timestamp": "2025-03-07T15:00:37Z"
  },
  {
    "title": "Chilling audio reveals 911 call man made to police sharing his ‘plot to kill Donald Trump’",
    "description": "Audio footage has revealed a chilling call made to 911 from a man making a series of threats against President Donald Trump's life.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-justin-blaxton-threats-audio-911-call-106816-20250307",
    "timestamp": "2025-03-07T15:00:28Z"
  },
  {
    "title": "Health Fears Grow as Donald Trump Spits on Himself During Congress Address—‘Disgusting’ Clip Goes Viral",
    "description": "Donald Trump spitting on himself during his speech has people speculating about his health. Here's why Netizens are worried the President's health could be on the decline.",
    "link": "https://www.inquisitr.com/health-fears-grow-as-donald-trump-spits-on-himself-during-congress-address-disgusting-clip-goes-viral",
    "timestamp": "2025-03-07T15:00:15Z"
  },
  {
    "title": "Meghan McCain Isn't Just Kissing the Ring, She's Spit Polishing It",
    "description": "In December 2017, Joe Biden famously consoled Meghan McCain on The View as she broke down in tears over her father's brain cancer diagnosis that would claim his life the following year. Biden had also lost his son, Beau, to...\nRead more...",
    "link": "https://www.pajiba.com/news/meghan-mccain-isnt-just-kissing-the-ring-shes-spit-polishing-it.php",
    "timestamp": "2025-03-07T15:00:00Z"
  },
  {
    "title": "Washington Post Fact-Checker: Trump’s Lexicon of Lies",
    "description": "Jeff Bezos, the multibillionaire owner of The Washington Post, has driven away great reporters and many readers because of his groveling before the Great Trumputin, but the Post still has Glenn Kessler, perhaps the best fact-checker in the business. It was Ke…",
    "link": "https://dianeravitch.net/2025/03/07/washington-post-fact-checker-trumps-lexicon-of-lies/",
    "timestamp": "2025-03-07T15:00:00Z"
  },
  {
    "title": "Trump Rushes to Defend Elon Musk From Big Bully South Africa",
    "description": "The president has decided to throw some weight behind one of his closest advisers when it comes to dealing with South Africa.\r\nDespite tariff-induced tumult at home, Donald Trump took the time Friday morning to lambast South Africa for how it treats its farme…",
    "link": "https://newrepublic.com/post/192469/donald-trump-elon-musk-south-africa-starlink",
    "timestamp": "2025-03-07T14:59:55Z"
  },
  {
    "title": "Seth Meyers Cracks Up at Democrats ‘Getting Catcalled’ by Trump | Video",
    "description": "\"'Hey, oh, Democrats, you got a pretty face. How about you give us a smile, baby?'\" the NBC host jokes\nThe post Seth Meyers Cracks Up at Democrats ‘Getting Catcalled’ by Trump | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-democrats-getting-catcalled-by-trump/",
    "timestamp": "2025-03-07T14:59:44Z"
  },
  {
    "title": "CNN stunned by 'shocking' poll numbers showing public support for DOGE spending cuts - NewsBreak",
    "description": "CNN's Harry Enten was surprised to see \"shocking\" poll numbers that showed the majority of Americans support Elon Musk and DOGE's influence on cutting gove",
    "link": "https://www.newsbreak.com/share/3843930196314-cnn-stunned-by-shocking-poll-numbers-showing-public-support-for-doge-spending-cuts?_f=app_share&amp;pd=08aKfVOQ&amp;lang=en_US&amp;send_time=1741359482&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.9.1.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_recall_exp_25q1-v6%2Cns_foryou_blend_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v1%2Cns_foryou_rank_exp_25q1-v5&amp;s=i2",
    "timestamp": "2025-03-07T14:58:40Z"
  },
  {
    "title": "What's a Rebel Pundit to Do In the Age of Trump?",
    "description": "Eoin Higgins\n\n\n\nSupposedly contrarian journalists like Bari Weiss, Matt Taibbi, and Glenn Greenwald have a problem: the current establishment loves them.\r\n\n\r\n\n\nThe post What's a Rebel Pundit to Do In the Age of Trump? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/bari-weiss-matt-taibbi-glenn-greenwald-trump/",
    "timestamp": "2025-03-07T14:58:17Z"
  },
  {
    "title": "Zelensky Won't Apologize to Trump Over 'Useful' Conversation: Aide",
    "description": "Relations between Washington and Kyiv may continue to fracture as Ukrainian President Volodymyr Zelensky is refusing to say sorry to President Donald Trump.",
    "link": "https://www.newsweek.com/zelensky-wont-apologize-trump-over-useful-conversation-aide-2041146",
    "timestamp": "2025-03-07T14:58:03Z"
  },
  {
    "title": "Summit Highlights Trump’s Alliance with Crypto Industry",
    "description": "“President Donald Trump is set to host the first White House Crypto Summit on Friday,” the Washington Post reports. “The event will put on display just how much Trump, once a skeptic of cryptocurrency, has",
    "link": "https://politicalwire.com/2025/03/07/summit-highlights-trumps-alliance-with-crypto-industry/",
    "timestamp": "2025-03-07T14:58:00Z"
  },
  {
    "title": "Worrying sign for Donald Trump amid Tariff debate as US creates lower-than-expected jobs",
    "description": "The US witnessed a higher unemployment rate projected at 4.1 per cent.  This came as President Donald Trump had announced stringent tariffs.",
    "link": "https://economictimes.indiatimes.com/news/international/us/worrying-sign-for-donald-trump-amid-tariff-debate-as-us-creates-lower-than-expected-jobs/articleshow/118789880.cms",
    "timestamp": "2025-03-07T14:56:44Z"
  },
  {
    "title": "Tesla's biggest fan on Wall Street says worries over Elon Musk's politics are overblown",
    "description": "Tesla (TSLA) stock was booming as 2024 came to a close, hitting a new all-time high and closing at more than $420 per share. Now sales are getting slammed in Europe and those gains have been all but erased, with most fingers pointing at CEO Elon Musk’s close …",
    "link": "https://qz.com/tesla-stock-market-cap-trump-politics-elon-musk-wedbush-1851768370",
    "timestamp": "2025-03-07T14:56:00Z"
  },
  {
    "title": "Trump threatens Russia with fresh sanctions, tariffs over attacks in Ukraine",
    "description": "US President Donald Trump is considering imposing banking sanctions and tariffs on Russia to push for a ceasefire and peace agreement in Ukraine. This comes after intensified Russian attacks on Ukraine and the recent halt of US military aid to Ukraine. Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-threatens-russia-with-fresh-sanctions-tariffs-over-attack-in-ukraine/articleshow/118789777.cms",
    "timestamp": "2025-03-07T14:55:33Z"
  },
  {
    "title": "As US Markets Look a Bit Wobbly, the Press Looks for the Next Crisis in the Rear View Mirror",
    "description": "The Wall Street Journal worried about the giddy mood at the annual structured industry conference. But is where to look for the next crisis?",
    "link": "https://www.nakedcapitalism.com/2025/03/as-us-markets-look-a-bit-wobbly-the-press-looks-for-the-next-crisis-in-the-rear-view-mirror.html",
    "timestamp": "2025-03-07T14:55:07Z"
  },
  {
    "title": "Hostages freed from Gaza tell Trump he was 'sent by God' to save them, but dozens more remain",
    "description": "President Donald Trump met with hostages freed from Hamas captivity in the Oval Office as his administration works to free the remaining 59 hostages still held in Gaza, including Edan Alexander.",
    "link": "https://www.foxnews.com/world/hostages-freed-from-gaza-tell-trump-he-sent-god-save-them-dozens-more-remain",
    "timestamp": "2025-03-07T14:54:16Z"
  },
  {
    "title": "‘RECORD PACE’: Trump Administration Has Hired Over 2,000 People in Just Weeks",
    "description": "President Donald Trump and his administration have hired more than “2,000 people in these last few weeks,” Presidential Personnel Office Director Sergio Gor said Thursday.... Read More\nThe post ‘RECORD PACE’: Trump Administration Has Hired Over 2,000 People i…",
    "link": "https://www.dailysignal.com/2025/03/07/record-pace-trump-administration-has-hired-2000-people-just-weeks/",
    "timestamp": "2025-03-07T14:53:30Z"
  },
  {
    "title": "What Countries Do Americans See as the Biggest Threat to the United States?",
    "description": "Repeated surveys affirm that Americans hold negative views of Russia, China, North Korea, and Iran, ranking them as the top threats to the U.S.",
    "link": "https://thediplomat.com/2025/03/what-countries-do-americans-see-as-the-biggest-threat-to-the-united-states/",
    "timestamp": "2025-03-07T14:53:00Z"
  },
  {
    "title": "The world cannot ignore Trump’s death threat to the people of Gaza",
    "description": "No, this is not just a “warning”, another “controversial” statement by the US president.",
    "link": "https://www.aljazeera.com/opinions/2025/3/7/the-world-cannot-ignore-trumps-death-threat-to-the-people-of-gaza",
    "timestamp": "2025-03-07T14:52:54Z"
  }
]