[
  {
    "title": "Iran urges confidentiality in diplomatic exchanges amid US letter",
    "description": "The report comes amid contact between the Islamic Republic and the US over reported efforts to reach a nuclear deal.",
    "link": "https://www.jpost.com/middle-east/article-848122",
    "timestamp": "2025-03-30T11:20:03Z"
  },
  {
    "title": "22nd Amendment ‘Hack’: Report Claims Trump Might Serve Beyond 2029",
    "description": "US President Donald Trump might just stick around until he's 90, thanks to a convenient “loophole” in the US Constitution, according to the Daily Mail.",
    "link": "https://sputnikglobe.com/20250330/22nd-amendment-hack-report-claims-trump-might-serve-beyond-2029---1121712793.html",
    "timestamp": "2025-03-30T11:19:29Z"
  },
  {
    "title": "Pentagon chief says US will ensure 'deterrence' across Taiwan Strait",
    "description": "The United States will ensure \"robust, ready and credible deterrence\" across the Taiwan Strait, US Defense Secretary Pete Hegseth said Sunday, calling China \"aggressive and coercive\".Hegseth also stopped short of publicly calling on Tokyo to hike military spe…",
    "link": "https://www.rawstory.com/us-taiwan/",
    "timestamp": "2025-03-30T11:17:14Z"
  },
  {
    "title": "This is the guest list for Jeff Bezos and Lauren Sanchez's wedding: which celebrities will be at the lavish party?",
    "description": "Jeff Bezos and Lauren Sanchez will live one of the best days of their lives, but what a guest list they boast, they definitely have many friends in the world of celebrities\nAfter a",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/03/30/67e923ece2704ec22a8b458e.html",
    "timestamp": "2025-03-30T11:16:15Z"
  },
  {
    "title": "Iran Rejects Direct Negotiations With US Over New Nuclear Agreement",
    "description": "Iranian President Masoud Pezeshkian said Sunday that Tehran had rejected direct negotiations with the United States, responding to a letter sent by President Donald Trump regarding Iran's accelerating nuclear program.\nThe statement marks the first official ac…",
    "link": "https://biztoc.com/x/7e3ed6f169391286",
    "timestamp": "2025-03-30T11:12:37Z"
  },
  {
    "title": "'SNL' Cold Open Takes Swipe at Matt Gaetz in Sketch Ridiculing Signal Leak",
    "description": "Mikey Madison played a teenage girl going on a date with the former Florida representative in a sketch in the latest episode.",
    "link": "https://www.newsweek.com/snl-cold-open-takes-swipe-matt-gaetz-mikey-madison-sketch-ridiculing-signal-leak-2052716",
    "timestamp": "2025-03-30T11:11:19Z"
  },
  {
    "title": "Immigration officials look to collect social media handles from those seeking benefits. Is this new?",
    "description": "U.S. immigration officials are asking the public and federal agencies to comment on a proposal to collect social media handles from people applying to benefits such as green cards or citizenship, to comply with an executive order from President Donald ...",
    "link": "https://abcnews.go.com/US/wireStory/immigration-officials-collect-social-media-handles-seeking-benefits-120308782",
    "timestamp": "2025-03-30T11:10:30Z"
  },
  {
    "title": "Iran has rejected direct negotiations with the US in response to Trump's letter",
    "description": "Iran’s president says Tehran had rejected direct negotiations with the United States in response to a letter from President Donald Trump over its rapidly advancing nuclear program",
    "link": "https://abcnews.go.com/International/wireStory/iran-rejected-direct-negotiations-us-response-trumps-letter-120309077",
    "timestamp": "2025-03-30T11:10:29Z"
  },
  {
    "title": "Nostalgia Won't Lead the US Out of the Trump Mire",
    "description": "George Packer recently wrote an Atlantic piece that cleverly situated the Trump regime within a familiar Orwellian framework.\n\nAccording to Packer, U.S. Sen. Lindsey Graham (R-S.C.), Rep. Mike Johnson (R-La.), and other slavish Trump sycophants have become co…",
    "link": "https://www.commondreams.org/opinion/nostalgia-no-solution-to-trump",
    "timestamp": "2025-03-30T11:10:02Z"
  },
  {
    "title": "Iran Rejects Direct Negotiations With US Over New Nuclear Agreement",
    "description": "The statement marks the first official acknowledgment from Iran about its response to a letter sent by U.S. President Donald Trump.",
    "link": "https://www.newsweek.com/iran-rejects-direct-negotiations-us-over-new-nuclear-agreement-2052734",
    "timestamp": "2025-03-30T11:09:31Z"
  },
  {
    "title": "Pete Hegseth's big praise for Japan in face of Chinese aggression and amid Trump tariff threat",
    "description": "US Defense Secretary Pete Hegseth emphasized Japan's role as an essential ally in countering Chinese military aggression. He announced upgrading the US military command in Japan to a war-fighting headquarters to enhance joint operational capabilities. Both na…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pete-hegseths-big-praise-for-japan-in-face-of-chinese-aggression-and-amid-trump-tariff-threat/articleshow/119753224.cms",
    "timestamp": "2025-03-30T11:08:33Z"
  },
  {
    "title": "‘Nobody Is Safe’—Shock Fed Trump Warning Could Suddenly Trigger Bitcoin Price Chaos",
    "description": "Federal Reserve chair Jerome Powell could be about to trigger bitcoin price and crypto market mayhem...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/03/30/bitcoin-and-crypto-braced-for-a-huge-36-trillion-april-fed-price-flip/",
    "timestamp": "2025-03-30T11:06:27Z"
  },
  {
    "title": "Medical supplies in great need as aid flows into Myanmar after earthquake",
    "description": "Emergency aid has streamed into Southeast Asia in the two days since a massive earthquake struck Myanmar and Thailand.",
    "link": "https://www.npr.org/2025/03/30/g-s1-57213/medical-supplies-in-great-need-as-aid-flows-into-myanmar-after-earthquake",
    "timestamp": "2025-03-30T11:00:49Z"
  },
  {
    "title": "Vulnerable Senate Democrat Ossoff seeks to channel Trump outrage on tough road to reelection | CNN Politics",
    "description": "Jon Ossoff, the nation’s most endangered Senate Democrat, sees a path for reelection in a state President Donald Trump won in 2024 and at a time when Democrats are suffering rock-bottom approval ratings.",
    "link": "https://www.cnn.com/2025/03/30/politics/ossoff-trump-outrage-reelection-georgia/index.html",
    "timestamp": "2025-03-30T11:00:36Z"
  },
  {
    "title": "Elon Musk Has Brought 'The R-Word' Back — And It's Part Of A Disturbing New Trend",
    "description": "It fits in with a \"politics of cruelty\" that's been running rampant in the White House.",
    "link": "https://www.huffpost.com/entry/elon-musk-has-brought-the-r-word-back-and-its-part-of-a-disturbing-new-trend-ano_n_67e59b7ce4b058dc0d445bd0",
    "timestamp": "2025-03-30T11:00:21Z"
  },
  {
    "title": "Is There's A ‘Trump Bump’ In Law School Admissions?",
    "description": "ABC News, 'Trump Bump,' Iffy Economy Cited for Huge Law School Application Spike: Experts: According to the Law School Admission Council, the number of applicants for law school has jumped more than 20% from 2024. What's behind the spike? \"I don't think anyon…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/03/muller-theres-no-trump-bump-in-law-school-admissions.html",
    "timestamp": "2025-03-30T11:00:00Z"
  },
  {
    "title": "Nursing homes say they face setback from Youngkin in push for staff",
    "description": "\"The more staff we have, the better off we are, but where am I going to find the bodies?\"",
    "link": "https://richmond.com/news/state-regional/government-politics/article_74bb2da1-7f2d-4069-85e1-7a0de0dfec7e.html",
    "timestamp": "2025-03-30T11:00:00Z"
  },
  {
    "title": "'No Coca-Cola, Netflix or Pringles': US boycott fever spreads to THIS territory amid Trump's constant threats",
    "description": "Is Trump's obsession with Greenland going to cost him way too much? A large of people in Denmark are boycotting American products- from Netflix to chocolates to chips. Donald Trump has time and again threatened to annex Greenland, a semi-autonomous Danish ter…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-denmark-greenland-boycotts-us-products-netflix-californian-wine-no-coca-cola-netflix-or-pringles-us-boycott-fever-spreads-to-this-territory-amid-trumps-constant-threats/articleshow/119752676.cms",
    "timestamp": "2025-03-30T10:59:35Z"
  },
  {
    "title": "Iran has rejected direct negotiations with the US in response to Trump’s letter",
    "description": "By JON GAMBRELL and AMIR VAHDAT DUBAI, United Arab Emirates (AP) — Iran’s president said Sunday that the Islamic Republic rejected direct negotiations with the United States over its rapidly advancing nuclear program, offering Tehran’s first response to a let…",
    "link": "https://www.bostonherald.com/2025/03/30/iran-has-rejected-direct-negotiations-with-the-us-in-response-to-trumps-letter/",
    "timestamp": "2025-03-30T10:57:14Z"
  },
  {
    "title": "Amid Trump's Tariff Threats, India And US Inch Closer Towards Trade Deal",
    "description": "Amid US President Donald Trump&#039;s reciprocal tariff threats, Indian and US officials held talks in New Delhi this week to discuss trade issues, including tariff reduction and easing of non-tariff barriers.",
    "link": "https://www.ndtv.com/world-news/amid-trumps-tariff-threats-india-and-us-inch-closer-towards-trade-deal-8046546",
    "timestamp": "2025-03-30T10:52:55Z"
  },
  {
    "title": "Trump: couldn't care less if foreign car prices high - BBC.com",
    "description": "Trump: couldn't care less if foreign car prices highBBC.com Trump says he ‘couldn’t care less’ if auto prices rise because of tariffsCNN Trump says he ‘couldn’t care less’ if foreign automakers raise prices due to tariffsNBC News Specter of Auto Tariffs Spurs…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176863881",
    "timestamp": "2025-03-30T10:52:38Z"
  },
  {
    "title": "Trump won't rule out military force to take Greenland",
    "description": "In an interview with NBC News, Trump refused to rule out military force to acquire Greenland. His remarks come a day after Vice President JD Vance's scaled back visit to the island.",
    "link": "https://www.npr.org/2025/03/30/nx-s1-5344942/trump-military-force-not-off-the-table-for-greenland",
    "timestamp": "2025-03-30T10:50:03Z"
  },
  {
    "title": "Trump prompts US allies to reopen nuclear weapons debate",
    "description": "Paris (AFP) Mar 28, 2025\n\n\n Donald Trump's attacks on NATO and the established world order are undermining the confidence of its allies under the US security umbrella, fuelling fears of an eventual proliferation of nuclear weapons, experts told AFP. \n\nSince h…",
    "link": "https://www.spacewar.com/reports/Trump_prompts_US_allies_to_reopen_nuclear_weapons_debate_999.html",
    "timestamp": "2025-03-30T10:47:53Z"
  },
  {
    "title": "Trump says Iran faces 'bad, bad things' if no nuclear deal",
    "description": "Washington (AFP) Mar 28, 2025\n\n\n Donald Trump said Friday that Iran faces severe consequences if it fails to reach a nuclear deal, after Tehran responded to a letter from the US president calling for talks. \n\n\"I sent them a letter just recently, and I said: y…",
    "link": "https://www.spacewar.com/reports/Trump_says_Iran_faces_bad_bad_things_if_no_nuclear_deal_999.html",
    "timestamp": "2025-03-30T10:47:53Z"
  },
  {
    "title": "Labor gains lead in post-budget Newspoll; would be one seat short of majority in YouGov MRP poll",
    "description": "The gains for Labor are probably in spite of a poorly rated federal budget.",
    "link": "https://theconversation.com/labor-gains-lead-in-post-budget-newspoll-would-be-one-seat-short-of-majority-in-yougov-mrp-poll-253410",
    "timestamp": "2025-03-30T10:46:58Z"
  },
  {
    "title": "Elon Musk Secretly Working to Rewrite the Social Security Codebase Using AI",
    "description": "In what feels like another life, Donald Trump ran for presidential election on the promise of \"draining the swamp\" — a direct appeal to the masses of workers and the poor of the US who knew something wasn't quite right with the status quo. It worked, sparking…",
    "link": "https://futurism.com/elon-musk-rewriting-social-security-code-ai",
    "timestamp": "2025-03-30T10:45:54Z"
  },
  {
    "title": "Musk Says He Will Have Cut $1 Trillion Within Weeks",
    "description": "“Elon Musk, whom President Donald Trump has tapped to shrink the government, said on Thursday he would finish most of the work to cut $1 trillion in federal spending when his tenure ends in as",
    "link": "https://politicalwire.com/2025/03/30/musk-says-he-will-have-cut-1-trillion-within-weeks/",
    "timestamp": "2025-03-30T10:44:07Z"
  },
  {
    "title": "Googlers have questions for the company after getting smaller pay bumps",
    "description": "In this Sunday edition of BI Today, we're going inside Google's recent all-hands.",
    "link": "https://www.businessinsider.com/bi-today-google-compensation-backlash-hardcore-2025-3",
    "timestamp": "2025-03-30T10:42:02Z"
  },
  {
    "title": "Trump: couldn't care less if foreign car prices high",
    "description": "Trump says he 'couldn't care less' about higher car prices\nDonald Trump has said he \"couldn't care less\" if carmakers raise prices after his 25% tariffs on foreign-made vehicles comes into effect.\nSome analysts have warned that Trump's charges on businesses i…",
    "link": "https://biztoc.com/x/8d3f7dcbbe6b41b4",
    "timestamp": "2025-03-30T10:39:49Z"
  },
  {
    "title": "Is XRP price around $2 an opportunity or the bull market's end? Analysts weigh in",
    "description": "XRP (XRP) has dropped nearly 40% to around $2.19, two months after hitting a multi-year high of $3.40. The cryptocurrency is tracking a broader market sell-off driven by President Donald Trump’s trade war despite bullish news like the SEC dropping its case ag…",
    "link": "https://cointelegraph.com/news/xrp-price-2-opportunity-bull-market-end-analysts",
    "timestamp": "2025-03-30T10:39:30Z"
  },
  {
    "title": "Trump Effect: W.H.O. Begins Drastic Finance, Staffing Cuts After U.S. Exit",
    "description": "President Donald Trump withdrew the U.S. from the globalist World Health Organization (W.H.O.) on the first day of his second term. The Geneva-based U.N. subsidiary announced Saturday as a consequence it is now beginning a radical restructure and refinancing …",
    "link": "https://www.breitbart.com/europe/2025/03/30/trump-effect-w-h-o-begins-drastic-finance-staffing-cuts-after-u-s-exit/",
    "timestamp": "2025-03-30T10:37:40Z"
  },
  {
    "title": "More than 950 Irish exporters face Trump tariffs",
    "description": "Seen & Heard: Flatley and McGregor, housing bottlenecks, and Fine Gael support slips",
    "link": "https://www.irishtimes.com/business/2025/03/30/more-than-950-irish-exporters-face-trump-tariffs/",
    "timestamp": "2025-03-30T10:34:06Z"
  },
  {
    "title": "NYT reveals ‘secret history’ of US meddling in Ukraine conflict",
    "description": "The US has been engaged in an “extraordinary” secretive partnership with Ukraine to help it fight Russia, a NYT investigation claims Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614965-nyt-investigation-us-secret-meddling-ukraine/",
    "timestamp": "2025-03-30T10:32:55Z"
  },
  {
    "title": "List of Protests, Rallies on Trans Day of Visibility Amid Trump Backlash",
    "description": "Transgender Day of Visibility 2025 features rallies nationwide to honor trans lives and protest anti-LGBTQ legislation.",
    "link": "https://www.newsweek.com/transgender-day-visibility-2025-rally-protest-donald-trump-2050944",
    "timestamp": "2025-03-30T10:30:01Z"
  },
  {
    "title": "Scorecard: How your legislators fared in the General Assembly session",
    "description": "In an election year for the House of Delegates, Republicans who will run in competitive districts had a tough time getting bills through the Democratic majority.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_6861075f-f205-4e30-92a3-9a0454e7c3d4.html",
    "timestamp": "2025-03-30T10:30:00Z"
  },
  {
    "title": "Pentagon Chief Says US Will Ensure 'Deterrence' Across Taiwan Strait",
    "description": "The United States will ensure \"robust, ready and credible deterrence\" across the Taiwan Strait, US Defense Secretary Pete Hegseth said Sunday, calling China \"aggressive and coercive\".",
    "link": "https://www.ibtimes.com/pentagon-chief-says-us-will-ensure-deterrence-across-taiwan-strait-3768188",
    "timestamp": "2025-03-30T10:27:12Z"
  },
  {
    "title": "\"Hamas Leaders In Gaza Can Leave If...\": Netanyahu's Latest Terms",
    "description": "Israeli Prime Minister Benjamin Netanyahu said Sunday that Israel&#039;s intensified military pressure on Hamas in Gaza has been effective, stressing the Palestinian group must lay down its arms.",
    "link": "https://www.ndtv.com/world-news/hamas-leaders-in-gaza-will-be-allowed-to-leave-if-they-lay-down-arms-says-netanyahu-8046397",
    "timestamp": "2025-03-30T10:24:16Z"
  },
  {
    "title": "Will Black Trump Supporters Speak Out Against His Racist and Authoritarian Government?",
    "description": "During the 2024 election campaign, candidate Donald Trump’s most controversial rally occurred at New York’s Madison Square Garden. A comedian on the program referred to the island of Puerto Rico—and by implication Puerto Ricans—as garbage. He and the Trump ca…",
    "link": "https://tomdispatch.com/making-america-white-again/",
    "timestamp": "2025-03-30T10:23:02Z"
  },
  {
    "title": "Stablecoin rules needed in US before crypto tax reform, experts say",
    "description": "United States cryptocurrency regulations need more clarity on stablecoins and banking relationships before lawmakers prioritize tax reform, according to industry leaders and legal experts.“In my view, tax isn’t necessarily the priority for upgrading US crypto…",
    "link": "https://cointelegraph.com/news/us-crypto-leaders-seek-stablecoin-guidance-before-tax-reform",
    "timestamp": "2025-03-30T10:19:41Z"
  },
  {
    "title": "Immigration officials look to collect social media handles from those seeking benefits. Is this new?",
    "description": "U.S. immigration officials are asking the public and federal agencies to comment on a proposal to collect social media handles from people applying to benefits such as green cards or citizenship, to comply with an executive order from President Donald Trump. …",
    "link": "https://www.seattlepi.com/news/politics/article/immigration-officials-look-to-collect-social-20248439.php",
    "timestamp": "2025-03-30T10:10:24Z"
  },
  {
    "title": "Trump Doesn't Rule Out Military Force to Take Greenland",
    "description": "The president said that nothing was \"off the table\" with regards to Washington taking control of the Arctic island.",
    "link": "https://www.newsweek.com/donald-trump-military-force-greenland-denmark-jd-vance-2052718",
    "timestamp": "2025-03-30T10:08:35Z"
  },
  {
    "title": "Trump administration cancels clean energy grants",
    "description": "Hundreds of clean energy projects funded by the Department of Energy are in jeopardy as the president works to speed up fossil fuel development.",
    "link": "https://www.wcvb.com/article/trump-administration-cancels-clean-energy-grants/64330148",
    "timestamp": "2025-03-30T10:08:01Z"
  },
  {
    "title": "China, South Korea And Japan Agree To Strengthen Free Trade",
    "description": "China, South Korea and Japan agreed Sunday to strengthen free trade in the face of a raft of new tariffs imposed by US President Donald Trump.",
    "link": "https://www.ibtimes.com/china-south-korea-japan-agree-strengthen-free-trade-3768179",
    "timestamp": "2025-03-30T10:06:21Z"
  },
  {
    "title": "Melania Trump's US citizenship once again sparks controversy after Maxine Waters' 'deportation' comment. Here's why",
    "description": "Melania Trump's US citizenship has once again sparked controversy after Congresswoman Maxine Waters has called for her 'deportation' amid President Trump's crackdown on illegal immigration. Melania Trump came to the US in the mid-1990s to work as a model. But…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-melania-trumps-us-citizenship-once-again-sparks-controversy-after-maxine-waters-deportation-comment-trump-crackdown-on-illegal-immigration-heres-why/articleshow/119750683.cms",
    "timestamp": "2025-03-30T10:04:40Z"
  },
  {
    "title": "Elbows may be up, but Ontario’s tourism industry is ‘arms open’ amid a welcome boost",
    "description": "Tourism operators in Ontario’s hot spots have been bracing for the fallout of U.S.-Canada tensions, but instead are seeing an uptick in demand that some attribute to Canadian staycationers. Still, experts say a booming summer travel season is not a guarantee …",
    "link": "https://financialpost.com/pmn/elbows-may-be-up-but-ontarios-tourism-industry-is-arms-open-amid-a-welcome-boost",
    "timestamp": "2025-03-30T10:02:54Z"
  },
  {
    "title": "Port of Churchill sees renewed interest as Canada looks to diversify trade routes",
    "description": "Manitoba may be smack dab in the middle of the country, but its premier wishes to remind Canadians it’s a maritime province. “When you think of Manitoba, you think of the Prairies, you think of the bush, but did you know that you can get to saltwater as well?…",
    "link": "https://financialpost.com/pmn/port-of-churchill-sees-renewed-interest-as-canada-looks-to-diversify-trade-routes",
    "timestamp": "2025-03-30T10:01:13Z"
  },
  {
    "title": "Trump’s transportation secretary is prioritizing funds based on birth and marriage rates, and red states could benefit | CNN Politics",
    "description": "A plan to target federal funds for communities with birth and marriage rates above the national average could end up disproportionately benefiting pro-Trump areas, according to a CNN analysis of Census and health data.",
    "link": "https://www.cnn.com/2025/03/30/politics/transportation-funds-birth-marriage-rates-invs/index.html",
    "timestamp": "2025-03-30T10:00:36Z"
  },
  {
    "title": "Virginia school puts up controversial ABCs display on Women's History Month, starting with 'A is for Abortion'",
    "description": "A public high school in Virginia featured a controversial display officials called \"The ABCs to ME\" for Women's History Month, featuring posters such as \"A is for Abortion.\"",
    "link": "https://www.foxnews.com/media/virginia-school-puts-up-controversial-abcs-display-womens-history-month-starting-a-abortion",
    "timestamp": "2025-03-30T10:00:35Z"
  },
  {
    "title": "Trump administration cancels clean energy grants",
    "description": "Hundreds of clean energy projects funded by the Department of Energy are in jeopardy as the president works to speed up fossil fuel development.",
    "link": "https://www.wtae.com/article/trump-administration-cancels-clean-energy-grants/64330148",
    "timestamp": "2025-03-30T10:00:33Z"
  },
  {
    "title": "GOP vows to stop lone activist judges from halting Trump agenda",
    "description": "Republicans are bashing a federal judge's ruling blocking the deportation of suspected gang members and say they are moving to ensure such an occurrence does not happen again.",
    "link": "https://www.foxnews.com/politics/gop-vows-stop-lone-activist-judges-from-halting-trump-agenda",
    "timestamp": "2025-03-30T10:00:24Z"
  },
  {
    "title": "Congress members denounce VA's end to gender-affirming care, demand answers",
    "description": "Sixty-nine members of Congress, led by gay Rep. Mark Takano, have sent a letter to Secretary of Veterans Affairs Doug Collins opposing his decision to phase out gender-affirming care for transgender veterans and demanding some answers.",
    "link": "https://www.advocate.com/politics/congress-members-condemn-va",
    "timestamp": "2025-03-30T10:00:03Z"
  },
  {
    "title": "‘No one will be left behind’: Ukraine struggles to return Mariupol defenders from Russia three years after port siege",
    "description": "Families of soldiers killed and hurt in Olenivka prison ‘massacre’ ask Donald Trump to intercede with Kremlin",
    "link": "https://www.irishtimes.com/world/europe/2025/03/30/no-one-will-be-left-behind-ukraine-struggles-to-return-mariupol-defenders-from-russia-three-years-after-port-siege/",
    "timestamp": "2025-03-30T10:00:00Z"
  },
  {
    "title": "Signalgate Can Teach Democrats How to Take Down Elon Musk",
    "description": "The second Trump era is something of an exercise in natural consequences. What happens if you put the most flamboyantly stupid goons in charge of everything? The results will neither surprise nor confound you: It is an absolute omnishambles. Trump’s not nearl…",
    "link": "https://newrepublic.com/post/193255/signalgate-teach-democrats-take-down-musk",
    "timestamp": "2025-03-30T10:00:00Z"
  },
  {
    "title": "Don’t think ‘it can’t happen here’ — it’s already happening",
    "description": "Demonizing rhetoric from the White House, arrests without due process, deporting immigrants to a brutal prison in a foreign country. This is America today.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/ice-deportation-el-salvador-prison-camps-rcna197889",
    "timestamp": "2025-03-30T10:00:00Z"
  },
  {
    "title": "Farmers in Trump Country Banked on Clean Energy Grants. Then Things Changed.",
    "description": "This story was reported by Floodlight, a nonprofit newsroom that investigates the powerful interests stalling climate action. The US Department of Agriculture announced late Tuesday it will release previously authorized grant funds to farmers and small rural …",
    "link": "https://www.motherjones.com/politics/2025/03/farmers-in-trump-country-banked-on-clean-energy-grants-then-things-changed/",
    "timestamp": "2025-03-30T10:00:00Z"
  },
  {
    "title": "First Nations leaders in northern Ontario say tariffs violate treaty rights, demand seat at table",
    "description": "First Nations leaders in northern Ontario argue that tariffs imposed by Canada and the U.S. violate treaty rights and ignore their historical trade networks.",
    "link": "https://www.cbc.ca/news/canada/sudbury/first-nations-tariffs-northern-ontario-1.7495380",
    "timestamp": "2025-03-30T09:59:00Z"
  },
  {
    "title": "Hegseth calls Japan indispensable in the face of Chinese aggression",
    "description": "U_S_ Defense Secretary Pete Hegseth has called Japan an “indispensable partner” in deterring growing Chinese assertiveness in the region and announced upgrading the U_S_ military command in Japan to a new “war-fighting headquarters.”",
    "link": "https://abcnews.go.com/International/wireStory/hegseth-calls-japan-indispensable-face-chinese-aggression-120308411",
    "timestamp": "2025-03-30T09:58:29Z"
  },
  {
    "title": "Medical supplies in great need as international assistance flows into Myanmar after earthquake",
    "description": "Emergency aid has streamed into Southeast Asia in the two days since a massive earthquake struck Myanmar and Thailand",
    "link": "https://abcnews.go.com/International/wireStory/medical-supplies-great-international-assistance-flows-myanmar-after-120308219",
    "timestamp": "2025-03-30T09:58:25Z"
  },
  {
    "title": "US: Ties to Japanese ''crucial' to countering China",
    "description": "On a trip to Toyko, US Defense Secretary Pete Hegseth has said the US and Japan need to maintain a strong relationship to deter China's \"military aggression.\"",
    "link": "https://www.dw.com/en/us-ties-to-japanese-crucial-to-countering-china/a-72086606",
    "timestamp": "2025-03-30T09:54:00Z"
  },
  {
    "title": "No firings over Signal leak – Trump",
    "description": "The US president has said he still trusts National Security Adviser Michael Waltz and Defense Secretary Pete Hegseth Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614963-trump-signal-waltz-hegseth/",
    "timestamp": "2025-03-30T09:50:04Z"
  },
  {
    "title": "Man strikes Tesla counter-protester with vehicle in Idaho, police say",
    "description": "Man strikes Tesla counter-protester with vehicle in Idaho, police saygo.com",
    "link": "https://abcnews.go.com/US/man-strikes-tesla-counter-protester-vehicle-idaho-police/story?id=120308032",
    "timestamp": "2025-03-30T09:44:56Z"
  },
  {
    "title": "Trump quickly works to consolidate power and muzzle dissenting voices",
    "description": "Moving at a rapid-fire clip, Donald Trump has been concentrating power in his hands, pushing the bounds of executive authority.",
    "link": "https://biztoc.com/x/bd5324fe69d81bb4",
    "timestamp": "2025-03-30T09:44:21Z"
  },
  {
    "title": "As world leaders grapple with instability, Trump’s attacks are making moderates popular again",
    "description": "Donald Trump has been giving leaders such as Mark Carney, Mexican Claudia Sheinbaum, Emmanuel Macron and Keir Starmer a popularity boost, experts say.",
    "link": "https://biztoc.com/x/6d55a4ec7d303352",
    "timestamp": "2025-03-30T09:44:18Z"
  },
  {
    "title": "Canada’s snowbirds reconsider calling America their second home | CNN Business",
    "description": "Trade tensions and a war of words have caused many Canadians to avoid travel to the US. Some are weighing whether to sell vacation homes in the US, as well.",
    "link": "https://www.cnn.com/2025/03/30/business/canada-snowbirds-trump-trade-war-tariffs/index.html",
    "timestamp": "2025-03-30T09:39:39Z"
  },
  {
    "title": "Trump tells NBC he 'couldn't care less' if car makers hike prices due to tariffs - Reuters",
    "description": "Trump tells NBC he 'couldn't care less' if car makers hike prices due to tariffsReuters Trump says he ‘couldn’t care less’ if auto prices rise because of tariffsCNN Trump says he ‘couldn’t care less’ if foreign automakers raise prices due to tariffsNBC News F…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176863475",
    "timestamp": "2025-03-30T09:32:35Z"
  },
  {
    "title": "Inside President Trump’s Ambitious Policy Strategy",
    "description": "President Donald Trump’s pace since returning to the White House has surprised the president’s friends, perhaps even more than his enemies. On the 66th day... Read More\nThe post Inside President Trump’s Ambitious Policy Strategy appeared first on The Daily Si…",
    "link": "https://www.dailysignal.com/2025/03/30/president-donald-trump-policy-strategy/",
    "timestamp": "2025-03-30T09:30:00Z"
  },
  {
    "title": "'It's just a witch hunt': No one will be fired over Signal chat group blunder, says Trump",
    "description": "No one will be fired over a national security blunder which saw a journalist mistakenly added to a Signal chat group discussing planned strikes on Yemen, US President Donald Trump has said.",
    "link": "https://news.sky.com/story/no-one-will-be-fired-over-signal-chat-group-blunder-says-president-trump-13338576",
    "timestamp": "2025-03-30T09:24:00Z"
  },
  {
    "title": "Hegseth announces plan for US command upgrades in Japan to deter China",
    "description": "U.S. Secretary of Defense Pete Hegseth announced a plan to upgrade the U.S. military command in Japan, an \"indispensable\" country against Chinese aggression.",
    "link": "https://www.foxnews.com/world/hegseth-announces-plan-us-command-upgrades-japan-deter-china",
    "timestamp": "2025-03-30T09:22:42Z"
  },
  {
    "title": "‘Extremely High’ Odds of V-Shaped Recovery for Stock Market, According to Fundstrat’s Tom Lee",
    "description": "The head of research of market intelligence firm Fundstrat says that the odds of a V-shaped recovery for the stock market in April are overwhelmingly high. In a new interview with CNBC Television, Tom Lee says that based on historical patterns, the stock mark…",
    "link": "https://dailyhodl.com/2025/03/30/extremely-high-odds-of-v-shaped-recovery-for-stock-market-according-to-fundstrats-tom-lee/",
    "timestamp": "2025-03-30T09:15:49Z"
  },
  {
    "title": "Philly tourism officials worried about rift with Canada",
    "description": "The industry is bracing for potential fallout from the Trump administration’s tariffs and hostile rhetoric toward traditional allies such as Canada.",
    "link": "https://www.inquirer.com/business/tourism-concerns-canada-trump-tariffs-20250330.html",
    "timestamp": "2025-03-30T09:12:12Z"
  },
  {
    "title": "Possible cuts to Medicaid funding threaten Nevada families, health providers",
    "description": "Kristy Burley-Evans experiences Medicaid from both sides: By day, she administers home care services to patients who depend on the program; and by night, she relies on the same ...",
    "link": "https://lasvegassun.com/news/2025/mar/30/possible-cuts-to-medicaid-funding-threaten-nevada/",
    "timestamp": "2025-03-30T09:07:56Z"
  },
  {
    "title": "President Donald Trump Appears Set to Extend a 112-Year Streak -- Will Wall Street Pay the Price?",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_081dfa09-3f7b-453f-bca0-2de5a0054cd2",
    "timestamp": "2025-03-30T09:06:00Z"
  },
  {
    "title": "UK prepared to retaliate against US tariffs, No 10 sources say",
    "description": "MAR 30 - The UK would not hesitate to retaliate against US tariffs if needed, according to Downing Street sources. The government is in last-minute Kenya breaking news | Kenya news today |",
    "link": "https://www.capitalfm.co.ke/business/2025/03/uk-prepared-to-retaliate-against-us-tariffs-no-10-sources-say/",
    "timestamp": "2025-03-30T09:01:53Z"
  },
  {
    "title": "Morgan Wallen Raises Eyebrows After Walking Off 'SNL' Stage",
    "description": "After his latest appearance on the \"SNL\" stage this weekend, Morgan Wallen made a hasty exit as the credits were still rolling.",
    "link": "https://www.newsweek.com/morgan-wallen-walks-off-snl-stage-2052715",
    "timestamp": "2025-03-30T09:00:49Z"
  },
  {
    "title": "Trump is using the power of government to punish opponents. They’re struggling to respond | CNN Politics",
    "description": "President Donald Trump is using the power of the federal government to intimidate or neuter potential sources of opposition to him.",
    "link": "https://www.cnn.com/2025/03/30/politics/trump-punish-opponents/index.html",
    "timestamp": "2025-03-30T09:00:35Z"
  },
  {
    "title": "Trump and Musk Are Making It Harder for the IRS to Catch Wealthy Tax Cheats",
    "description": "The DOGE dismantlement/takeover of the IRS continues apace.",
    "link": "https://www.nakedcapitalism.com/2025/03/trump-and-musk-are-making-it-harder-for-the-irs-to-catch-wealthy-tax-cheats.html",
    "timestamp": "2025-03-30T09:00:31Z"
  },
  {
    "title": "Ethereum Playing Catch-Up? Bloomberg Examines ETH’s Struggles In New Report",
    "description": "The Ethereum price will be happy to see March come to a close after posting one of its worst first-quarter performances ever. According to CoinGlass data, the price of ETH is down by nearly 50% in the last three months. While much of ETH’s struggles can be pe…",
    "link": "https://bitcoinist.com/ethereum-playing-catch-up-bloomberg-assesses-eths/",
    "timestamp": "2025-03-30T09:00:29Z"
  },
  {
    "title": "Florida and Wisconsin Elections: What to Know as Democrats Hope to Rally",
    "description": "On April 1, voters in Florida's 1st and 6th districts will decide two U.S. House races, while Wisconsinites will elect a state Supreme Court justice.",
    "link": "https://www.newsweek.com/florida-wisconsin-elections-what-know-democrats-hope-rally-2052667",
    "timestamp": "2025-03-30T09:00:02Z"
  },
  {
    "title": "Trump quickly works to consolidate power and muzzle dissenting voices",
    "description": "Moving at a rapid-fire clip, Donald Trump has been concentrating power in his hands, pushing the bounds of executive authority.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-quickly-works-consolidate-power-muzzle-dissenting-voices-rcna197766",
    "timestamp": "2025-03-30T09:00:00Z"
  },
  {
    "title": "Trump's new tariffs, the Fed's Powell speaks, and jobs numbers: What to watch in the markets this week",
    "description": "President Donald Trump’s “liberation day” is on Wednesday. The president will unveil “reciprocal tariffs” on many U.S. trading partners, and delayed 25% duties on Mexico and Canada are also scheduled to go into effect.Read more...",
    "link": "https://qz.com/trump-tariffs-federal-reserve-powell-stocks-markets-1851773156",
    "timestamp": "2025-03-30T09:00:00Z"
  },
  {
    "title": "As world leaders grapple with instability, Trump’s attacks are making moderates popular again",
    "description": "Donald Trump has been giving leaders such as Mark Carney, Mexican Claudia Sheinbaum, Emmanuel Macron and Keir Starmer a popularity boost, experts say.",
    "link": "https://www.nbcnews.com/news/world/world-leaders-grapple-instability-trumps-attacks-are-making-moderates-rcna198521",
    "timestamp": "2025-03-30T09:00:00Z"
  },
  {
    "title": "'Immigrant who took your job': Anti-Tesla, Elon Musk protests mount over the continued US govt purge",
    "description": "Protestors swarmed Tesla showrooms in US and across the world as criticism against Elon Musk has continued to mount over his role in DOGE and purge in the US government under President Donald Trump. Musk, the world’s richest person, heads the so-called “depar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/immigrant-who-took-your-job-anti-tesla-elon-musk-protests-mount-over-the-continued-us-govt-purge/articleshow/119748340.cms",
    "timestamp": "2025-03-30T08:59:48Z"
  },
  {
    "title": "Elon Musk is finding out why Warren Buffett steers clear of politics",
    "description": "Elon Musk's allegiance to President Donald Trump has come at a cost to Tesla.\nAndrew Harnik/Getty Images\nElon Musk's central role in the Trump administration has sparked a fierce backlash against Tesla.\nWarren Buffett stays out of politics as he knows his emp…",
    "link": "https://biztoc.com/x/7f98bc96f71747d5",
    "timestamp": "2025-03-30T08:59:43Z"
  },
  {
    "title": "Price hikes and premium push: What explains automakers’ latest moves?",
    "description": "Maruti Suzuki, Tata Motors, Mahindra &amp; Mahindra, Hyundai, and Kia—accounting for nearly 85% of India's passenger vehicle market—have announced price hikes of up to 4%. What explains their latest move amid a subdued passenger car market?",
    "link": "https://www.livemint.com/industry/car-price-hikes-premium-cars-slowing-auto-sales-us-auto-tariffs-trump-tariffs-indian-carmakers-auto-components-makers-11743320348885.html",
    "timestamp": "2025-03-30T08:59:07Z"
  },
  {
    "title": "Japan, US share ‘warrior ethos’ to deter China, says Pentagon’s Hegseth",
    "description": "US Defense Secretary Pete Hegseth says Japan is an 'indispensable partner' against Beijing in the Asia Pacific.",
    "link": "https://www.aljazeera.com/news/2025/3/30/japan-us-share-warrior-ethos-to-deter-china-says-pentagons-hegseth",
    "timestamp": "2025-03-30T08:57:55Z"
  },
  {
    "title": "Old & Busted: Compromised Signal chats full of critical sensitive information. New Hotness: Leaked spreadsheets full of critical sensitive information [Awkward]",
    "description": "Old & Busted: Compromised Signal chats full of critical sensitive information. New Hotness: Leaked spreadsheets full of critical sensitive information",
    "link": "https://www.fark.com/comments/13615846/Old-Busted-Compromised-Signal-chats-full-of-critical-sensitive-information-New-Hotness-Leaked-spreadsheets-full-of-critical-sensitive-information",
    "timestamp": "2025-03-30T08:50:00Z"
  },
  {
    "title": "Musk's daughter calls Tesla chief ‘insecure buffoon’, says Mars colonisation plans a ‘marketing scheme’",
    "description": "She claimed that Tesla operates like a Ponzi scheme and said, “Look up PE ratio and then look at Tesla stock compared to other car companies.' | Trending",
    "link": "https://www.wionews.com/trending/musk-daughter-calls-tesla-chief-insecure-buffoon-says-mars-colonisation-plans-a-marketing-scheme-tesla-chief-8906520",
    "timestamp": "2025-03-30T08:47:37Z"
  },
  {
    "title": "Elon Musk is finding out why Warren Buffett steers clear of politics",
    "description": "Tesla is being targeted over Elon Musk's ties to Donald Trump, showing Warren Buffett was right to worry that getting political could hit his company.",
    "link": "https://www.businessinsider.com/tesla-elon-musk-backlash-warren-buffett-politics-trump-spacex-government-2025-3",
    "timestamp": "2025-03-30T08:47:02Z"
  },
  {
    "title": "2025 SkS Weekly Climate Change & Global Warming News Roundup #13",
    "description": "A listing of 31 news and opinion articles we found interesting and shared on social media during the past week: Sun, March 23, 2025 thru Sat, March 29, 2025.\nThis week's roundup is again published by category and sorted by number of articles included in each.…",
    "link": "https://skepticalscience.com/2025-SkS-Weekly-News-Roundup_13.html",
    "timestamp": "2025-03-30T08:35:37Z"
  },
  {
    "title": "Nigerians having babies abroad: women explain their reasons",
    "description": "Having the support of family members living in a foreign country was one of the reasons Nigerian women gave for choosing to have their babies overseas.",
    "link": "https://theconversation.com/nigerians-having-babies-abroad-women-explain-their-reasons-251067",
    "timestamp": "2025-03-30T08:31:18Z"
  },
  {
    "title": "Trump says he 'couldn't care less' about higher car prices",
    "description": "Trump says he hopes foreign carmakers raise prices as it means people will buy US-made cars.",
    "link": "https://www.bbc.com/news/articles/cgrgj51gl25o",
    "timestamp": "2025-03-30T08:27:58Z"
  },
  {
    "title": "Americans haven't been this freaked out about their jobs since the Great Recession",
    "description": "People are worried about their jobs and the impending threat of layoffs. That's bad news for consumer spending and the US economy.",
    "link": "https://www.businessinsider.com/americans-worried-unemployment-layoffs-recession-jobs-hiring-2025-3",
    "timestamp": "2025-03-30T08:27:01Z"
  },
  {
    "title": "Why do clocks go forward – and could daylight saving time be scrapped?",
    "description": "US president Donald Trump has suggested he wants to scrap daylight savings time",
    "link": "https://www.the-independent.com/life-style/clocks-go-forward-daylight-savings-time-b2724019.html",
    "timestamp": "2025-03-30T08:26:49Z"
  }
]