[
  {
    "title": "Trump Keeps Skipping Work to Show Off Ugly White House Renovations",
    "description": "Donald Trump has reportedly become consumed by his large-scale remodeling at the White House, wandering away from his presidential duties to survey renovations.  The president has repeatedly derailed visits from foreign dignitaries to give lengthy tours of hi…",
    "link": "https://newrepublic.com/post/201814/donald-trump-skipping-work-show-off-white-house-renovations",
    "timestamp": "2025-10-15T19:39:54Z"
  },
  {
    "title": "Judge snaps at Trump's DOJ: 'You're not even prepared'",
    "description": "The Justice Department appeared in court after President Donald Trump and his administration fired thousands of federal workers. Trump publicly threatened Democrats, saying that if they didn't end the government shutdown, he would start layoffs. The firings w…",
    "link": "https://www.rawstory.com/government-employees-fired/",
    "timestamp": "2025-10-15T19:39:36Z"
  },
  {
    "title": "Here's What Happened Today: Wednesday",
    "description": "Male teenager dies in suspected stabbing in Dublin, third person charged with murder of Barry Daly in Cork, and Dáil passes confidence motion in Simon Harris",
    "link": "https://www.thejournal.ie/news-rundown-wednesday-october-6845580-Oct2025/",
    "timestamp": "2025-10-15T19:39:06Z"
  },
  {
    "title": "Funding for softwood industry imminent, federal minister says",
    "description": "Financial support for Canada’s softwood lumber sector can be expected soon, the federal industry minister told a Fredericton business group on Wednesday.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/joly-softwood-lumber-support-9.6939710",
    "timestamp": "2025-10-15T19:38:07Z"
  },
  {
    "title": "‘Shut Up!’: Nancy Pelosi Loses It At Reporter Asking Simple Question About J6",
    "description": "Former House Speaker Nancy Pelosi raged at a LindellTV reporter who asked if she is concerned about being found liable for not deploying the National Guard.",
    "link": "https://dailycaller.com/2025/10/15/nancy-pelosi-lindelltv-reporter-j6-national-guard/",
    "timestamp": "2025-10-15T19:37:52Z"
  },
  {
    "title": "Do Republicans have a health care plan?",
    "description": "The shutdown hinges on the answer",
    "link": "https://theweek.com/politics/republicans-health-care-plan-government-shutdown",
    "timestamp": "2025-10-15T19:37:24Z"
  },
  {
    "title": "US Judge 'Reluctantly' Tosses Youth Case Challenging Trump Climate Policies",
    "description": "A federal judge on Wednesday tossed a youth-led lawsuit accusing US President Donald Trump's fossil-fuel agenda of trampling their inalienable rights, ruling that he lacked jurisdiction to intervene.",
    "link": "https://www.ibtimes.com/us-judge-reluctantly-tosses-youth-case-challenging-trump-climate-policies-3787172",
    "timestamp": "2025-10-15T19:36:14Z"
  },
  {
    "title": "Zohran Mamdani won’t ask Hamas to disarm, stands by Netanyahu arrest pledge",
    "description": "Mayoral front-runner Zohran Mamdani on Wednesday refused to say that Hamas should lay down its weapons -- as he stood by his promise to arrest Israeli Prime Minister Benjamin Netanyahu if he comes to New York City.",
    "link": "https://nypost.com/2025/10/15/us-news/zohran-mamdani-wont-say-hamas-should-lay-down-its-weapons-stands-by-netanyahu-arrest-pledge/",
    "timestamp": "2025-10-15T19:35:39Z"
  },
  {
    "title": "The European Commission reveals its military plan – The EU must be ready for war with Russia by 2030",
    "description": "The European Union has five years to prepare for a potential war, according to a military plan drafted by the European Commission, which will be presented tomorrow in Brussels\nThe post The European Commission reveals its military plan – The EU must be ready f…",
    "link": "https://en.protothema.gr/2025/10/15/the-european-commission-reveals-its-military-plan-the-eu-must-be-ready-for-war-with-russia-by-2030/",
    "timestamp": "2025-10-15T19:35:32Z"
  },
  {
    "title": "Aussies no fans of Trump, but see no alternative to US alliance, poll shows",
    "description": "New polling shows most Australians want to stick with the US alliance, despite holding overwhelmingly negative views towards the Trump administration and harbouring deep worries about the erosion of American democracy.",
    "link": "https://www.abc.net.au/news/2025-10-16/polls-no-alternative-united-states-ally-trump-negative/105895536",
    "timestamp": "2025-10-15T19:33:57Z"
  },
  {
    "title": "Taliban Foreign Minister Spends the Week in India",
    "description": "The trip marks the culmination of a remarkable turnaround in ties.",
    "link": "http://foreignpolicy.com/2025/10/15/india-afghanistan-taliban-foreign-minister-visit/",
    "timestamp": "2025-10-15T19:33:35Z"
  },
  {
    "title": "Supreme Court seems inclined to limit race-based electoral districts under the Voting Rights Act",
    "description": "The Supreme Court appears ready to gut a key tool of the Voting Rights Act that's helped root out racial discrimination in voting for more than a half century",
    "link": "https://abcnews.go.com/Politics/wireStory/supreme-court-inclined-limit-race-based-electoral-districts-126534649",
    "timestamp": "2025-10-15T19:33:32Z"
  },
  {
    "title": "Rushes | Jane Fonda Speaks Freely, the Birth of Tilly Norton, Remembering Keaton and Jacobs",
    "description": "This week’s essential news, articles, sounds, videos, and more from the film world.",
    "link": "https://mubi.com/en/notebook/posts/rushes-jane-fonda-speaks-freely-the-birth-of-tilly-norton-remembering-keaton-and-jacobs",
    "timestamp": "2025-10-15T19:32:00Z"
  },
  {
    "title": "Trump’s Treasury Secretary Says US Will Impose ‘Price Floors’ To Combat China Manipulating Markets",
    "description": "Treasury Secretary Scott Bessent told CNBC on Wednesday that the United States will be introducing \"price floors\" in different markets to combat China.\nThe post Trump’s Treasury Secretary Says US Will Impose ‘Price Floors’ To Combat China Manipulating Markets…",
    "link": "https://www.mediaite.com/media/tv/trumps-treasury-secretary-says-us-will-impose-price-floors-to-combat-china-manipulating-markets/",
    "timestamp": "2025-10-15T19:30:51Z"
  },
  {
    "title": "Trump move spares troops' pay, but Republicans warn shutdown risks remain",
    "description": "House GOP lawmakers praised President Donald Trump's decision to ensure military pay during the government shutdown while pushing for a broader resolution to the funding impasse.",
    "link": "https://www.foxnews.com/politics/trump-move-spares-troops-pay-republicans-warn-shutdown-risks-remain",
    "timestamp": "2025-10-15T19:30:44Z"
  },
  {
    "title": "Trump wants this ‘lazy’ GOP congressman gone. He just broke a record",
    "description": "He posted a TK gain since last quarter.",
    "link": "https://www.nj.com/politics/2025/10/trump-wants-this-lazy-gop-congressman-gone-he-just-broke-a-record.html",
    "timestamp": "2025-10-15T19:30:30Z"
  },
  {
    "title": "Trump's boat strikes are killing potentially innocent civilians. They must be stopped.",
    "description": "On Tuesday, President Donald Trump announced that the U.S. military had killed six people in a strike on a boat that, Trump said, was “trafficking narcotics.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-claims-deadly-boat-strikes-are-alleged-drug-trafficking-still-il-rcna237681",
    "timestamp": "2025-10-15T19:30:30Z"
  },
  {
    "title": "‘Don’t Ask Don’t Tell’: Ohio Schools Caught Saying They’d Conceal Trans Students’ Sex, Complaint Alleges",
    "description": "Administrators at two Ohio school districts admitted the schools would allow a male student to access female sports and facilities and help hide his identity.",
    "link": "https://dailycaller.com/2025/10/15/dont-ask-dont-tell-ohio-schools-caught-saying-theyd-conceal-trans-students-sex-complaint-alleges/",
    "timestamp": "2025-10-15T19:30:04Z"
  },
  {
    "title": "The Supreme Court Is Poised to Rule That It’s Racist to Remedy Racism",
    "description": "It's going to be an electoral bonanza for Republicans.",
    "link": "https://slate.com/news-and-politics/2025/10/supreme-court-racist-racism-congress-gerrymandering.html",
    "timestamp": "2025-10-15T19:30:01Z"
  },
  {
    "title": "Federal workers endure financial strain and fear layoffs as government shutdown drags on",
    "description": "Hundreds of thousands of federal employees furloughed or working without pay during the government shutdown face mounting financial strain. Now they're confronting new uncertainty with the Trump administration's promised layoffs.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_3d20376e-c0b6-5ce8-9ce8-80dea8b89463.html",
    "timestamp": "2025-10-15T19:30:00Z"
  },
  {
    "title": "Late-Night Is Having a Lot of Fun with Trump’s Saggy Neck",
    "description": "By\n Opheli Garcia Lawler\n Published: October 15th, 2025",
    "link": "https://www.cracked.com/article_48776_late-night-is-having-a-lot-of-fun-with-trumps-saggy-neck.html",
    "timestamp": "2025-10-15T19:30:00Z"
  },
  {
    "title": "Concerns ripple through auto industry after Stellantis shifts away from Ont. plant",
    "description": "TORONTO — Fears that Canada’s automotive industry could lose out to the U.S. are becoming more of a reality after Stellantis said it was moving planned production of its Jeep Compass from Brampton, Ont., to Illinois. The decision, announced as part of a broad…",
    "link": "https://financialpost.com/pmn/concerns-ripple-through-auto-industry-after-stellantis-shifts-away-from-ont-plant",
    "timestamp": "2025-10-15T19:29:53Z"
  },
  {
    "title": "Eric Trump Confirms Plans to Tokenize Real Estate With World Liberty Financial",
    "description": "The World Liberty Financial co-founder said in a CoinDesk TV interview he is currently working on tokenizing a real estate project tied to a building under development.",
    "link": "https://www.coindesk.com/business/2025/10/10/eric-trump-confirms-plans-to-tokenize-real-estate-with-world-liberty-financial",
    "timestamp": "2025-10-15T19:29:34Z"
  },
  {
    "title": "Gen Z like protests in 2500 towns and cities in US against Trump - who's behind the October 18 No Kings Protest",
    "description": "No Kings Protest October 18: Millions of Americans are set to protest nationwide on Saturday, October 18. The 'No Kings' movement opposes President Trump's actions and the ongoing government shutdown. Organizers describe it as a stand for equality and democra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/no-kings-protest-october-18-in-2500-towns-and-cities-in-us-against-trump-whos-behind-the-october-18-no-kings-protest/articleshow/124587930.cms",
    "timestamp": "2025-10-15T19:29:21Z"
  },
  {
    "title": "The US Can Break Free From China’s Control Of Rare Earth Minerals",
    "description": "By Helen Raleigh via The Daily Signal | October 15, 2025\nPresident Donald Trump has recently signaled his intent to impose an additional 100% tariff on Chinese goods due to Beijing’s sweeping restrictions on rare earth minerals. This escalation highlights tha…",
    "link": "https://biztoc.com/x/8928b21553e58b4f",
    "timestamp": "2025-10-15T19:28:59Z"
  },
  {
    "title": "WH said to authorize covert CIA actions against Maduro",
    "description": "The administration of United States President Donald Trump authorized the Central Intelligence Agency (CIA) to conduct covert operations inside Venezuela, with the ultimate aim of weakening and toppli...",
    "link": "https://biztoc.com/x/63ca587d9500dcf1",
    "timestamp": "2025-10-15T19:28:36Z"
  },
  {
    "title": "Marjorie Taylor Greene Keeps Breaking With Her Party. What’s Going On?",
    "description": "Even Trump has reportedly noticed that something's amiss.",
    "link": "https://slate.com/news-and-politics/2025/10/marjorie-taylor-greene-republicans-donald-trump-mike-johnson.html",
    "timestamp": "2025-10-15T19:27:22Z"
  },
  {
    "title": "US is working on doubling aid to Argentina to $40 billion",
    "description": "The Trump administration is looking to provide an additional $20 billion in financing for Argentina. This would be on top of a $20 billion credit swap line pledged earlier this month to support Argentina's currency. Treasury Secretary Scott Bessent said Wedne…",
    "link": "https://apnews.com/article/trump-argentina-financing-economy-milei-billion-peso-fd38553ae03f4c33ce1288999469f7fb",
    "timestamp": "2025-10-15T19:25:53Z"
  },
  {
    "title": "Scott Bessent: Slowed Job Growth Is Due to 2 Million Deportations; Americans Are 'Doing Quite Well' Getting Jobs",
    "description": "Treasury Sec. Scott Bessent said U.S. job growth has slowed down in part due to two million illegals being deported or self-deporting.\nThe post Scott Bessent: Slowed Job Growth Is Due to 2 Million Deportations; Americans Are ‘Doing Quite Well’ Getting Jobs ap…",
    "link": "https://www.breitbart.com/economy/2025/10/15/scott-bessent-slowed-job-growth-due-to-2-million-deportations-americans-doing-quite-well-getting-jobs/",
    "timestamp": "2025-10-15T19:24:46Z"
  },
  {
    "title": "Trump-Allied Erebor Gains Federal Charter for Crypto Bank, Shaking Up Stablecoin Wars",
    "description": "The bank, backed by some of Silicon Valley’s most prominent White House allies, now boasts a key advantage in the race to dominate the emerging U.S. stablecoin market.",
    "link": "https://decrypt.co/344456/trump-allied-erebor-gains-federal-charter-crypto-bank-stablecoin-wars",
    "timestamp": "2025-10-15T19:24:35Z"
  },
  {
    "title": "‘Trump knows this’: Analysts say this Cabinet member is president's 'biggest threat'",
    "description": "Two analysts say that one politician who has \"a cult of his own\" represents the biggest threat to President Donald Trump. Former Republican strategist Rick Wilson and journalist Molly Jong-Fast posited that Trump is afraid of Robert F. Kennedy Jr., his secret…",
    "link": "https://www.rawstory.com/robert-f-kennedy-jr-2674200926/",
    "timestamp": "2025-10-15T19:24:24Z"
  },
  {
    "title": "The only GOP gubernatorial candidates running in 2025 elections lean into Trump's MAGA campaign tactics",
    "description": "New Jersey's Jack Ciattarelli and Virginia Lt. Gov. Winsome Earle-Sears adopt President Donald Trump's campaign strategies ahead of November 4 elections.",
    "link": "https://www.foxnews.com/politics/only-gop-gubernatorial-candidates-running-2025-elections-lean-trumps-maga-campaign-tactics",
    "timestamp": "2025-10-15T19:22:28Z"
  },
  {
    "title": "The Jan. 6 attack gets in the way of Republican Party talking points (again)",
    "description": "There have been jokes about Republicans forgetting who was president in 2020, but the GOP’s habit of forgetting about the Jan. 6 attack is far less funny.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jan-6-attack-gets-way-republican-party-talking-points-rcna237847",
    "timestamp": "2025-10-15T19:20:42Z"
  },
  {
    "title": "House Republican shrugs off farm bankruptcies in his own state: No 'free pass'",
    "description": "U.S. Rep. Dusty Johnson (R-SD) assured CNN anchor John Berman that farmers are enduring the collapse of the U.S. soybean market, despite President Donald Trump disrupting all sales to their biggest international buyer.“I was at the Farm Aid concert in Minneso…",
    "link": "https://www.rawstory.com/dusty-johnson-2674202221/",
    "timestamp": "2025-10-15T19:20:35Z"
  },
  {
    "title": "US War Secretary threatens Russia",
    "description": "Washington will “impose costs” on Moscow if the Ukraine conflict isn’t settled, US War Secretary Pete Hegseth has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626500-us-war-secretary-threatens-russia/",
    "timestamp": "2025-10-15T19:20:03Z"
  },
  {
    "title": "Trump says Israel could resume fighting in Gaza if Hamas fails to uphold ceasefire deal, CNN reports",
    "description": "President Donald Trump stated that Israel would resume military action in Gaza if Hamas violates the ceasefire agreement. He indicated that Israel is prepared to re-enter the streets and confront Hamas if the terms of the deal are not met, particularly regard…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-israel-could-resume-fighting-in-gaza-if-hamas-fails-to-uphold-ceasefire-deal-cnn-reports/articleshow/124589155.cms",
    "timestamp": "2025-10-15T19:18:10Z"
  },
  {
    "title": "Government Shutdown Day 15: White House Warns More Than 10,000 Jobs Could Be Cut As Court Pauses Firings",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/15/government-shutdown-day-15-white-house-warns-more-than-10000-jobs-could-be-cut-as-court-pauses-firings/",
    "timestamp": "2025-10-15T19:17:56Z"
  },
  {
    "title": "Judge dismisses young climate activists’ lawsuit challenging Trump on fossil fuels",
    "description": "A federal judge in Montana has dismissed a lawsuit from young climate activists seeking to block President Donald Trump’s executive orders promoting fossil fuels",
    "link": "https://abcnews.go.com/US/wireStory/judge-dismisses-young-climate-activists-lawsuit-challenging-trump-126558164",
    "timestamp": "2025-10-15T19:17:53Z"
  },
  {
    "title": "Trump threatened to move World Cup games away from Boston, but it’s up to FIFA to pick sites",
    "description": "“We could take them away,” President Donald Trump said of the World Cup games. “I love the people of Boston and I know the games are sold out. But your mayor is not good.”",
    "link": "https://biztoc.com/x/493487186c20f74c",
    "timestamp": "2025-10-15T19:17:53Z"
  },
  {
    "title": "Trump: Israel could return to fighting in Gaza if Hamas violates deal",
    "description": "President Trump tells CNN Israel could return to Gaza 'as soon as I say the word' if Hamas fails to meet ceasefire terms, including full hostage return.",
    "link": "https://www.israelnationalnews.com/news/416308",
    "timestamp": "2025-10-15T19:17:47Z"
  },
  {
    "title": "Navi Mumbai: 2 men arrested for sexually assaulting 3 minor girls in Turbhe and Khandeshwar",
    "description": "Navi Mumbai: Two separate Pocso cases have been registered at Khandeshwar and Turbhe police stations on Sunday wherein two accused men have been arres.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/navi-mumbai-2-men-arrested-for-sexually-assaulting-3-minor-girls-in-turbhe-and-khandeshwar/articleshow/124589090.cms",
    "timestamp": "2025-10-15T19:15:38Z"
  },
  {
    "title": "Secrets of Happiness",
    "description": "So I might be the happiest human being on the planet. How and why? Some honest thoughts: First, I think this is like an insanely huge one, the criticality of this new big thought: trying to get 12 hours of sleep a night. At first I think a lot of people thoug…",
    "link": "https://erickimphotography.com/blog/2025/10/15/secrets-of-happiness-2/",
    "timestamp": "2025-10-15T19:15:33Z"
  },
  {
    "title": "Dhuper, Senapati take Odisha to safety in Ranji Trophy opener against Baroda",
    "description": "Odisha staged a remarkable recovery on day one of their Ranji Trophy opener against Baroda, thanks to a crucial 156-run partnership for the fifth wicket. After a dramatic top-order collapse saw them slump to 49 for four, Subhranshu Senapati (79) and Rajesh Dh…",
    "link": "https://timesofindia.indiatimes.com/city/cuttack/dhuper-senapati-take-odisha-to-safety-in-ranji-trophy-opener-against-baroda/articleshow/124589033.cms",
    "timestamp": "2025-10-15T19:14:56Z"
  },
  {
    "title": "Digital moral science book for Karnataka schools from Nov 1",
    "description": "Bengaluru: The dept of school education and literacy will roll out a digital copy of the moral science book in govt schools on Nov 1.The govt had anno.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/digital-moral-science-book-for-karnataka-schools-from-nov-1/articleshow/124589069.cms",
    "timestamp": "2025-10-15T19:14:18Z"
  },
  {
    "title": "Princeton and MIT bring back SAT/ACT: Why is Columbia still test-optional?",
    "description": "Columbia University has emerged as the last Ivy League school to maintain a fully test-optional admissions policy, even as peers like Princeton and MIT reinstate SAT and ACT requirements. The policy, aimed at promoting equity and holistic evaluation, has spar…",
    "link": "https://timesofindia.indiatimes.com/education/news/princeton-and-mit-bring-back-sat/act-why-is-columbia-still-test-optional/articleshow/124588484.cms",
    "timestamp": "2025-10-15T19:12:59Z"
  },
  {
    "title": "Convent Road in Bengaluru in shambles again with open drain, illegal parking",
    "description": "Bengaluru: One of the oldest schools in Bengaluru is unable to function peacefully, all thanks to poor-quality roads and indiscriminate parking. Conve.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/convent-road-in-bengaluru-in-shambles-again-with-open-drain-illegal-parking/articleshow/124589016.cms",
    "timestamp": "2025-10-15T19:12:31Z"
  },
  {
    "title": "Supreme Court Voting-Rights Ruling Could Blow Up Midterms",
    "description": "Justices seem ready to weaken the Voting Rights Act. The ruling could erase minority districts, locking in GOP House control in 2026 and beyond.",
    "link": "http://nymag.com/intelligencer/article/supreme-court-voting-rights-ruling-could-blow-up-midterms.html",
    "timestamp": "2025-10-15T19:12:00Z"
  },
  {
    "title": "Trump threatened to move World Cup games away from Boston, but it’s up to FIFA to pick sites",
    "description": "“We could take them away,” President Donald Trump said of the World Cup games. “I love the people of Boston and I know the games are sold out. But your mayor is not good.”",
    "link": "https://www.pbs.org/newshour/politics/trump-threatened-to-move-world-cup-games-away-from-boston-but-its-up-to-fifa-to-pick-sites",
    "timestamp": "2025-10-15T19:11:24Z"
  },
  {
    "title": "Alaska process ‘not finished’ – Lavrov",
    "description": "Moscow is still waiting for an American response to its Ukraine conflict peace roadmap, Foreign Minister Sergey Lavrov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626499-alaska-process-not-finished-lavrov/",
    "timestamp": "2025-10-15T19:11:12Z"
  },
  {
    "title": "Calangute liquor shops shut for booze sale after 10pm",
    "description": "Calangute: Several retail and wholesale liquor outlets in Calangute, found selling alcohol after 10pm, were shut down by the excise department on Tues.",
    "link": "https://timesofindia.indiatimes.com/city/goa/calangute-liquor-shops-shut-for-booze-sale-after-10pm/articleshow/124588915.cms",
    "timestamp": "2025-10-15T19:10:35Z"
  },
  {
    "title": "Kiran Mazumdar-Shaw finds support from BJP MP; Lad continues tirade",
    "description": "Bengaluru: Even as brickbats kept streaming in from ministers for a second straight day, Biocon chief Kiran Mazumdar-Shaw Wednesday found an ally in B.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/kiran-mazumdar-shaw-finds-support-from-bjp-mp-lad-continues-tirade/articleshow/124588948.cms",
    "timestamp": "2025-10-15T19:09:48Z"
  },
  {
    "title": "Mumbai Fire Brigade appeals to citizens to celebrate Diwali responsibly by following safety norms",
    "description": "Mumbai: Mumbai Fire Brigade has appealed to citizens to celebrate Diwali responsibly by following safety norms and avoiding activities that cause air .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-fire-brigade-appeals-to-citizens-to-celebrate-diwali-responsibly-by-following-safety-norms/articleshow/124588941.cms",
    "timestamp": "2025-10-15T19:09:44Z"
  },
  {
    "title": "Bihar in driver’s seat against Arunachal Pradesh in Ranji Trophy opener",
    "description": "Sakib Hussain's stellar six-wicket haul and Ayush Loharuka's unbeaten 155 powered Bihar to a commanding position against Arunachal Pradesh on Day 1. Arunachal Pradesh was dismissed for a mere 105. Bihar responded strongly, ending the day at 283/2, securing a …",
    "link": "https://timesofindia.indiatimes.com/city/patna/bihar-in-drivers-seat-against-arunachal-pradesh-in-ranji-trophy-opener/articleshow/124588166.cms",
    "timestamp": "2025-10-15T19:08:42Z"
  },
  {
    "title": "‘Focus is on strengthening position as year-round tourism destination’ - Tourism ministers’ conference",
    "description": "Panaji: At the tourism ministers’ conference that concluded in Udaipur on Wednesday, the tourism department emphasised its commitment to enhancing inf.",
    "link": "https://timesofindia.indiatimes.com/city/goa/focus-is-on-strengthening-position-as-year-round-tourism-destination-tourism-ministers-conference/articleshow/124588883.cms",
    "timestamp": "2025-10-15T19:08:27Z"
  },
  {
    "title": "Judge temporarily blocks the Trump administration from firing workers during the government shutdown",
    "description": "A federal judge has temporarily blocked President Donald Trump’s administration from firing workers during the government shutdown, saying the human cost \"cannot be tolerated.”.",
    "link": "https://www.ksat.com/business/2025/10/15/judge-says-shes-inclined-to-block-the-trump-administration-from-firing-workers-during-the-shutdown/",
    "timestamp": "2025-10-15T19:07:55Z"
  },
  {
    "title": "Navi Mumbai: PAP protest against chemical plant project",
    "description": "Navi Mumbai: People protesting against the Rashtriya Chemicals and Fertilisers (RCF) project lit up vehicle tyres opposite the RCF-Thal unit, Alibag o.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/navi-mumbai-pap-protest-against-chemical-plant-project/articleshow/124588900.cms",
    "timestamp": "2025-10-15T19:07:54Z"
  },
  {
    "title": "Judge dismisses young climate activists’ lawsuit challenging Trump on fossil fuels",
    "description": "The plaintiffs included youths who were victorious in a landmark climate trial against Montana.",
    "link": "https://www.bostonherald.com/2025/10/15/youth-climate-lawsuit-trump-dismissed/",
    "timestamp": "2025-10-15T19:07:34Z"
  },
  {
    "title": "'Dr. Antifa's' Mediterranean move partially financed by fellow Rutgers professors, other American academics",
    "description": "Mark Bray, dubbed 'Dr. Antifa,' flees to Spain with wife after President Donald Trump announces crackdown on Antifa and receives support from fellow academics.",
    "link": "https://www.foxnews.com/us/dr-antifa-mediterranean-move-partially-financed-by-fellow-rutgers-professors-other-american-academics",
    "timestamp": "2025-10-15T19:07:26Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow from Judge Over Shutdown Layoffs",
    "description": "A federal judge in California has temporarily blocked the Trump administration from proceeding with mass layoffs of federal workers during the ongoing partial government shutdown. U.S. District Judge Susan Illston issued the order Wednesday in San Francisco a…",
    "link": "https://biztoc.com/x/6802b65a79e24423",
    "timestamp": "2025-10-15T19:07:07Z"
  },
  {
    "title": "What Donald Trump gets right in the Middle East",
    "description": "What Donald Trump gets right in the Middle East\nIt’s not what you think\nMany american presidents try to ignore the Middle East. Barack Obama wanted to pivot to Asia; Joe Biden told advisers to keep the region off his desk. But it is not so easily ignored. The…",
    "link": "https://biztoc.com/x/0f2265b7d242b808",
    "timestamp": "2025-10-15T19:07:04Z"
  },
  {
    "title": "Ganeshpuri dacoity: B’desh duo remanded in 9-day custody",
    "description": "Mapusa: The Mapusa court on Wednesday remanded two Bangladeshi nationals, arrested in connection with the Ganeshpuri dacoity, to nine days in police c.",
    "link": "https://timesofindia.indiatimes.com/city/goa/ganeshpuri-dacoity-bdesh-duo-remanded-in-9-day-custody/articleshow/124588853.cms",
    "timestamp": "2025-10-15T19:07:03Z"
  },
  {
    "title": "The Abu Dhabi investor that's funding AI while trying to save TikTok — with help from Trump",
    "description": "Abu Dhabi's MGX, launched last year, has emerged as one of the key players funding the AI boom and is now part owner of TikTok's U.S. business.",
    "link": "https://www.cnbc.com/2025/10/15/abu-dhabis-mgx-investments-in-trump-crypto-tiktok-openai-.html",
    "timestamp": "2025-10-15T19:05:25Z"
  },
  {
    "title": "3603 - It's Taco Trump China Version; No Kings Protests w/ Jostein Hauge, Hunter Dunn",
    "description": "It's Hump Day on the Majority Report On today's show: Trump uses the government shutdown as an excuse to slash \"Democrat programs\" even though these cuts have been in motion since before the shutdown began. Michigan Senator Abdul El-Sayed makes an explainer v…",
    "link": "https://majorityfm.libsyn.com/3603-its-taco-trump-china-version-no-kings-protests-w-jostein-hauge-hunter-dunn",
    "timestamp": "2025-10-15T19:05:00Z"
  },
  {
    "title": "JD Vance’s ‘Hitler’ Comment Haunts Him In Heated CNN Panel On Young Republicans’ Racist Texts",
    "description": "The vice president addressed the recent scandal involving highly offensive messages between Young Republican leaders by deflecting to a Democrat.",
    "link": "https://www.huffpost.com/entry/jd-vance-address-young-republican-group-chat-cnn-hitler_n_68efc590e4b04b9d4235b8d2",
    "timestamp": "2025-10-15T19:05:00Z"
  },
  {
    "title": "Judge blocks Trump from firing federal workers during government shutdown for now",
    "description": "The Trump administration warned it would use the shutdown to shed federal jobs. President Trump  said that the cuts were aimed at \"Democrat agencies.\"",
    "link": "https://www.cnbc.com/2025/10/15/judge-trump-jobs-government-shutdown.html",
    "timestamp": "2025-10-15T19:04:28Z"
  },
  {
    "title": "EXCLUSIVE: ICE Agents Still ‘Risking Their Lives’ Despite ‘Working Without Pay’ Amid Shutdown",
    "description": "FIRST ON THE DAILY SIGNAL—U.S. Immigration and Customs Enforcement agents continuing to risk their lives arresting criminal illegal aliens even while not being paid during... Read More\nThe post EXCLUSIVE: ICE Agents Still ‘Risking Their Lives’ Despite ‘Workin…",
    "link": "https://www.dailysignal.com/2025/10/15/exclusive-ice-agents-still-risking-their-lives-despite-working-without-pay-amid-shutdown/",
    "timestamp": "2025-10-15T19:04:02Z"
  },
  {
    "title": "Judge orders Trump administration to pause shutdown layoffs",
    "description": "Last week the Trump administration began the process of laying off about 4,000 workers, saying it was due to the federal shutdown.",
    "link": "https://www.bbc.com/news/articles/c2056ynn2ppo",
    "timestamp": "2025-10-15T19:02:35Z"
  },
  {
    "title": "Democratic Establishment Targets Maine Working-Class Senate Candidate Graham Planter",
    "description": "Shortly after Maine Gov. Janet Mills announced her candidacy for the US Senate on Tuesday, journalists noted her campaign's joint fundraising committee with the Democratic establishment—which swiftly drew strong criticism, given that she has a primary opponen…",
    "link": "https://www.commondreams.org/news/2026-maine-senate-race",
    "timestamp": "2025-10-15T19:02:25Z"
  },
  {
    "title": "“House of Dynamite” Shows That Missile Defense Is a Dangerous Fantasy",
    "description": "The new film \"House of Dynamite\" demonstrates that a leak proof missile shield like the proposed Golden Dome is a dangerous fantasy.",
    "link": "https://www.forbes.com/sites/williamhartung/2025/10/15/house-of-dynamite-shows-that-missile-defense-is-a-dangerous-fantasy/",
    "timestamp": "2025-10-15T19:00:43Z"
  },
  {
    "title": "Judge temporarily blocks Trump’s firing of federal workers during shutdown",
    "description": "A federal judge has temporarily blocked President Donald Trump’s administration from firing workers during the government shutdown.",
    "link": "https://www.pbs.org/newshour/nation/judge-temporarily-blocks-trumps-firing-of-federal-workers-during-shutdown",
    "timestamp": "2025-10-15T19:00:26Z"
  },
  {
    "title": "Crude Oil Could Fall Below $50, BofA Warns",
    "description": "Oil prices extended losses on Wednesday as rising OPEC+ supply and escalating U.S.-China trade tensions deepened concerns over global demand, prompting Bank of America to warn that Brent crude could drop below $50 per barrel in the months ahead. In midday tra…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Crude-Oil-Could-Fall-Below-50-BofA-Warns.html",
    "timestamp": "2025-10-15T19:00:00Z"
  },
  {
    "title": "Hackers Hit Airport PA Systems With Pro-Palestine Messages Denouncing Trump and Benjamin Netanyahu",
    "description": "Flights were briefly delayed by hacks of the public address systems at two North American airports where travelers heard pro-Palestinian messages praising Hamas and denouncing President Donald Trump and Israeli Prime Minister Benjamin Netanyahu.\nThe post Hack…",
    "link": "https://www.breitbart.com/middle-east/2025/10/15/hackers-hit-airport-pa-systems-with-pro-palestine-messages-denouncing-trump-and-benjamin-netanyahu/",
    "timestamp": "2025-10-15T18:57:33Z"
  },
  {
    "title": "Ukraine imposes blackouts in most regions after Russian power grid attacks",
    "description": "This will be the fourth consecutive winter of outages since Russia launched its full-scale invasion in February 2022.",
    "link": "https://www.bbc.com/news/articles/c15p32dvy0vo",
    "timestamp": "2025-10-15T18:57:10Z"
  },
  {
    "title": "Lawrence O’Donnell Slams Trump for Not Firing Aide Tied to Leaked ‘I Love Hitler’ Group Chat | Video",
    "description": "\"Elon Musk and Donald Trump this year have fired thousands of federal workers, but they're keeping this guy?\" the \"Last Word\" host questions\nThe post Lawrence O’Donnell Slams Trump for Not Firing Aide Tied to Leaked ‘I Love Hitler’ Group Chat | Video appeared…",
    "link": "https://www.thewrap.com/lawrence-odonnell-trump-michael-bartels-i-love-hitler-young-republican-group-chat/",
    "timestamp": "2025-10-15T18:56:58Z"
  },
  {
    "title": "Argentina First? Trump Treasury Sec Reveals Bailout Amount Has Doubled",
    "description": "One day after Donald Trump celebrated a multibillion dollar bailout for Argentina, his administration moved to double the ante.Treasury Secretary Scott Bessent told reporters at the Treasury building Wednesday that the U.S. is “working on a $20 billion facili…",
    "link": "https://newrepublic.com/post/201811/donald-trump-treasury-secretary-argentina-bailout-doubled",
    "timestamp": "2025-10-15T18:56:32Z"
  },
  {
    "title": "Austin’s ‘Black Artists Matter’ Mural, Rainbow Crosswalk May Be Removed",
    "description": "The removal is part of a larger federal directive under the Trump administration to get rid of political and artistic road murals across the country.",
    "link": "https://www.artnews.com/art-news/news/austin-black-artists-matter-rainbow-crosswalk-to-be-removed-1234757239/",
    "timestamp": "2025-10-15T18:56:16Z"
  },
  {
    "title": "From Doubters to Leaders-India Emerges as Engine of World Economy: Gaurav",
    "description": "STATE TIMES NEWS JAMMU: BJP Spokesperson for Jammu & Kashmir UT, Gaurav Gupta, has welcomed the recent remarks by IMF Managing Director Kristalina Georgieva, calling them a powerful global endorsement of Prime Minister Narendra Modi’s visionary economic leade…",
    "link": "https://statetimes.in/from-doubters-to-leaders-india-emerges-as-engine-of-world-economy-gaurav/",
    "timestamp": "2025-10-15T18:55:47Z"
  },
  {
    "title": "Canadian trade delegation heads back to Washington, while Ford urges Carney to 'fight back'",
    "description": "Doug Ford says Canada needs to get tougher with the U.S. as two of Prime Minister Mark Carney's top trade negotiators returned to Washington",
    "link": "https://nationalpost.com/news/politics/canadian-trade-delegation-heads-back-to-washington-while-ford-urges-carney-to-fight-back",
    "timestamp": "2025-10-15T18:55:45Z"
  },
  {
    "title": "Trump ties $20B Argentina bailout to Milei votes",
    "description": "What happened\nPresident Donald Trump Tuesday explicitly tied his $20 billion bailout for Argentina to upcoming elections in the South American country. If President Javier Milei’s party loses ground in the Oct. 26 midterms, “we are not going to be generous wi…",
    "link": "https://biztoc.com/x/498e9b164bd4bee4",
    "timestamp": "2025-10-15T18:55:30Z"
  },
  {
    "title": "Trump signs executive order to reform federal hiring practices",
    "description": "Gold has topped $4,200. Here’s why Yardeni thinks the rally could go even higher.\nInvesting.com -- President Donald Trump signed an executive order Wednesday that overhauls federal hiring procedures, requiring agencies to establish Strategic Hiring Committees…",
    "link": "https://biztoc.com/x/c1f314e5b262c188",
    "timestamp": "2025-10-15T18:55:29Z"
  },
  {
    "title": "Trump: Israel ready to strike 'as soon as I say the word'",
    "description": "United States President Donald Trump said on Wednesday he might permit Israeli Prime Minister Benjamin Netanyahu to resume military strikes in Gaza if Hamas fails to meet the terms of the ceasefire. S...",
    "link": "https://biztoc.com/x/eddb8d65fd39189a",
    "timestamp": "2025-10-15T18:55:16Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from firing workers amid government shutdown",
    "description": "The emergency order came after federal agencies started issuing layoff notices Friday aimed at reducing the size of the federal government.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_b5cb34b6-3af9-507f-a443-db619a451463.html",
    "timestamp": "2025-10-15T18:55:00Z"
  },
  {
    "title": "Republicans fume as Democrats block 9th GOP bid to reopen government",
    "description": "Senate Majority Leader John Thune, R-S.D., and Republicans believe Senate Democrats won't end the shutdown until after Saturday's protest, while open enrollment deadline looms.",
    "link": "https://www.foxnews.com/politics/republicans-fume-democrats-block-9th-gop-bid-reopen-government",
    "timestamp": "2025-10-15T18:54:53Z"
  },
  {
    "title": "Hamas claims it returned all deceased hostages in our possession",
    "description": "Hamas claims it no longer holds additional deceased hostages as the Red Cross prepares to receive several bodies, while President Trump warns fighting may resume if the deal is breached.",
    "link": "https://www.israelnationalnews.com/news/416307",
    "timestamp": "2025-10-15T18:53:00Z"
  },
  {
    "title": "Surging CO2 levels a sign Canada must resist climate backsliding: scientist",
    "description": "A leading Canadian climate scientist says a new report showing planet-warming carbon dioxide levels have soared to record amounts in 2024 is the latest sign Canada must resist pressure to backslide on climate action. The World Meteorological Organization’s an…",
    "link": "https://financialpost.com/pmn/surging-co2-levels-a-sign-canada-must-resist-climate-backsliding-scientist",
    "timestamp": "2025-10-15T18:52:32Z"
  },
  {
    "title": "US judge extends block on Trump deploying National Guard in Portland, Oregon",
    "description": "(Reuters) -A federal judge in Oregon on Wednesday extended temporary restraining orders that block President Donald Trump's administration from deploying any...",
    "link": "https://www.yahoo.com/news/articles/us-judge-extends-block-trump-185230819.html",
    "timestamp": "2025-10-15T18:52:30Z"
  },
  {
    "title": "State Data Reveals Just 0.5% of Florida ICE Detainees Are Gang-Affiliated",
    "description": "Amid repeated assertions by administration figures that President Donald Trump's deadly anti-immigrant blitz is \"targeting the worst of the worst\" among \"criminal illegal aliens,\" critics of the crackdown this week pointed to official data belying those claim…",
    "link": "https://www.commondreams.org/news/trump-lies-about-gang-members",
    "timestamp": "2025-10-15T18:51:28Z"
  },
  {
    "title": "Tim Cook's China Power Play: Apple Doubles Down as Trump's Tariff Threat Looms",
    "description": "Apple's CEO bets big on Beijing ties even as Washington pressures the tech giant to shift production abroad.",
    "link": "https://finance.yahoo.com/news/tim-cooks-china-power-play-184929776.html",
    "timestamp": "2025-10-15T18:49:29Z"
  },
  {
    "title": "JUST IN: Federal Judge Blocks Trump From More Layoffs During Shutdown",
    "description": "A federal judge on Wednesday temporarily blocked President Donald Trump’s administration from laying off more government employees, after the administration had already pushed to cut thousands of workers during the U.S. government shutdown. This is a breaking…",
    "link": "https://www.mediaite.com/media/news/just-in-federal-judge-blocks-trump-from-more-layoffs-during-shutdown/",
    "timestamp": "2025-10-15T18:49:03Z"
  },
  {
    "title": "US wants Australia's rare earths but Trump-Albanese meeting 'critical'",
    "description": "As rare earths re-emerge as a central battleground in the US-China trade war, Australian companies are already striking deals to supply America. A policy expert says talks at the White House next week could secure a national agreement.",
    "link": "https://www.abc.net.au/news/2025-10-16/us-is-open-to-make-rare-earth-deals-with-australia/105895128",
    "timestamp": "2025-10-15T18:47:30Z"
  },
  {
    "title": "GOP Blocks Warren Bill to Stop Trump’s “Brazen” $20B Argentina Bailout",
    "description": "“For Trump, the leader of Argentina is more important than American families struggling with rising costs,” said Warren.",
    "link": "https://truthout.org/articles/gop-blocks-warren-bill-to-stop-trumps-brazen-20b-argentina-bailout/",
    "timestamp": "2025-10-15T18:46:25Z"
  },
  {
    "title": "Historic squadron rebooted ahead of Albanese-Trump meeting",
    "description": "The federal government has re-established the Number 12 Squadron in SA at the same time as Australia's anti-submarine capability is expanding with the arrival of new aircraft.",
    "link": "https://www.abc.net.au/news/2025-10-16/poseidon-12-squadron-defence-air-force-australia-us-china/105895342",
    "timestamp": "2025-10-15T18:45:23Z"
  },
  {
    "title": "Trump's Health 'Troubles' Explained?: Former RFK Jr Advisor Goes Off on Prez's 'Brain Fog' as Dementia Rumors Threaten to Sink Don's Career",
    "description": "Donald Trump is believed to be dealing with several medical problems, despite the president claiming he's in the best shape ever.",
    "link": "https://radaronline.com/p/trump-health-problems-explained-rfk-jr-brain-fog-dementia-rumors/",
    "timestamp": "2025-10-15T18:45:00Z"
  },
  {
    "title": "US Air Force Boeing aircraft faces mid-air emergency, Defense Secretary Pete Hegseth likely on-board, claim",
    "description": "NATO Secretary-General Mark Rutte said he expected further pledges, noting that $2 billion already had been committed through the mechanism.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-air-force-boeing-aircraft-faces-mid-air-emergency-defense-secretary-pete-hegseth-likely-on-board-claim/articleshow/124588196.cms",
    "timestamp": "2025-10-15T18:44:58Z"
  }
]