[
  {
    "title": "Family of Colombian Man Killed in Boat Strike Files Complaint Against US",
    "description": "This is the first known filing of its kind, and comes amid increasing scrutiny over the military’s boat strike campaign.",
    "link": "https://truthout.org/articles/family-of-colombian-man-killed-in-boat-strike-files-complaint-against-us/",
    "timestamp": "2025-12-03T20:58:30Z"
  },
  {
    "title": "AI is Infringing on Your Civil Rights. Here’s How We Can Stop That",
    "description": "Searching for an apartment online, applying for a loan, going through airport security, or looking up a question on a search engine – you might not think anything of these exchanges other than that they are mundane things you do, but, in many of these instanc…",
    "link": "https://www.aclu.org/news/racial-justice/ai-is-infringing-on-your-civil-rights-heres-how-we-can-stop-that",
    "timestamp": "2025-12-03T20:57:54Z"
  },
  {
    "title": "Donald Trump Pardons Texas Congressman Henry Cuellar",
    "description": "President Donald Trump is pre-emptively pardoning U.S. Congressman Henry Cuellar, a sitting Democratic Representative from Texas who's been federally charged with bribery and money laundering. POTUS posted on Truth Social Wednesday, accusing former…\n Permalink",
    "link": "https://www.tmz.com/2025/12/03/donald-trump-henry-cuellar-pardon/",
    "timestamp": "2025-12-03T20:57:34Z"
  },
  {
    "title": "Bessent says White House may 'veto' Federal Reserve presidents",
    "description": "Treasury Secretary Scott Bessent said Wednesday he would push a new requirement that the Federal Reserve’s regional bank presidents live in their districts for at least three years before taking office, a move that could give the White House more power over t…",
    "link": "https://apnews.com/article/federal-reserve-trump-bessent-6ddd9c8b204668551caecf6c5fe51388",
    "timestamp": "2025-12-03T20:56:20Z"
  },
  {
    "title": "Forget Whether Or Not DOGE Exists: Will Anyone Be Held Accountable For 600,000 Deaths?",
    "description": "First, let’s dispense with the theater: the question of whether DOGE “still exists” as a formal entity completely misses the point. The always-misleadingly-named “Department of Government Efficiency” was never really about efficiency. It was Elon Musk’s excus…",
    "link": "https://www.techdirt.com/2025/12/03/forget-whether-or-not-doge-exists-will-anyone-be-held-accountable-for-600000-deaths/",
    "timestamp": "2025-12-03T20:55:45Z"
  },
  {
    "title": "Oil Closes Up as Peace Deal Falls Short",
    "description": "Crude settled modestly higher after US-Russia talks failed to produce a Ukraine peace deal, keeping sanctions risks elevated.",
    "link": "https://www.rigzone.com/news/wire/oil_closes_up_as_peace_deal_falls_short-03-dec-2025-182447-article/",
    "timestamp": "2025-12-03T20:55:26Z"
  },
  {
    "title": "EU proposes using frozen Russian assets to fund Ukraine",
    "description": "Belgium is pushing back on a European proposal to use frozen Russian assets to help financially support Ukraine.",
    "link": "https://www.abc.net.au/news/2025-12-04/eu-proposes-using-frozen-russian-assets-to-fund-ukraine/106099644",
    "timestamp": "2025-12-03T20:54:08Z"
  },
  {
    "title": "If You're Sick Of RFK Jr., This 'Cabaret' Spoof Is Just What The Doctor Ordered",
    "description": "Randy Rainbow needles the health secretary in a musical blockbuster.",
    "link": "https://www.huffpost.com/entry/randy-rainbow-rfk-jr-cabaret_n_693057fce4b0cee44381e1f7",
    "timestamp": "2025-12-03T20:52:58Z"
  },
  {
    "title": "Human rights groups warn against US immigration raids during World Cup",
    "description": "The draw for the 48-nation tournament will be held Friday in Washington.",
    "link": "https://www.thejournal.ie/world-cup-immigration-raids-6892884-Dec2025/",
    "timestamp": "2025-12-03T20:51:30Z"
  },
  {
    "title": "Sports icons Brady, Gretzky, Shaq join stars for 2026 World Cup draw",
    "description": "NFL legend Tom Brady, Wayne Gretzky, and Shaq will be among the stars helping conduct the draw for the 2026 World Cup co-hosted by the USA, Canada & Mexico\n\nRead More: https://punchng.com/sports-icons-brady-gretzky-shaq-join-stars-for-2026-world-cup-draw/",
    "link": "https://punchng.com/sports-icons-brady-gretzky-shaq-join-stars-for-2026-world-cup-draw/",
    "timestamp": "2025-12-03T20:51:24Z"
  },
  {
    "title": "Trump administration rolls back fuel economy standards, again | TechCrunch",
    "description": "The regulatory decision would make it harder for future administrations to implement stricter fuel efficiency standards.",
    "link": "https://techcrunch.com/2025/12/03/trump-administration-rolls-back-fuel-economy-standards-again/",
    "timestamp": "2025-12-03T20:51:09Z"
  },
  {
    "title": "World Cup 2026 Draw surrounded by viral “Prophecy” claims — But what’s the real story?",
    "description": "Viral story sparks curiosity just days before 2026 World Cup seedingsWorld Cup 2026 Draw surrounded by viral “Prophecy” claims — But what’s the real story?As anticipation builds for the FIFA W...",
    "link": "https://foot-africa.com/en/news/world-cup-2026-draw-surrounded-by-viral-prophecy-claims-but-whats-the-real-story-987728/",
    "timestamp": "2025-12-03T20:50:00Z"
  },
  {
    "title": "Did TPUSA former employee say Candace Owens is right? New shocking claim about Turning Point USA leadership goes viral. Here's all details",
    "description": "Did TPUSA former employee say Candace Owens is right? A social post shared a video of a claimed former Turning Point USA employee who supported Candace Owens allegations related to Charlie Kirk’s death. The claim linked donor concerns, internal issues and Owe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-tpusa-former-employee-say-candace-owens-is-right-new-shocking-claim-about-turning-point-usa-leadership-goes-viral-heres-all-details-turning-point-usa-staff-member-video-donors-internal-decisions-charlie-kirk-death-case-utah-valley-university-tyler-robinson/articleshow/125752876.cms",
    "timestamp": "2025-12-03T20:46:24Z"
  },
  {
    "title": "Hey Dozy Donald: 'Affordability' Is Not A 'Scam'",
    "description": "During Trump's creepy cabinet meeting, he claimed that affordability is a Democratic party scam and a con job, and also, the word doesn't mean anything to anybody.\nMaybe he should stop using Rasmussen as a main pollster and propagandist.\nTrump's constant deni…",
    "link": "https://crooksandliars.com/2025/12/trump-calls-affordability-scam-americans",
    "timestamp": "2025-12-03T20:37:44Z"
  },
  {
    "title": "Millions Face Exhorbitant Health Premiums; GOP Has 'No Plan'",
    "description": "Personally, if I were a Republican senator who saw last night's election results in Tennessee, I'd be a little worried about kicking several million people off their healthcare plans. I mean, it looks kind of like a suicide mission. Via the Associated Press:\n…",
    "link": "https://crooksandliars.com/2025/12/millions-facing-outrageous-healthcare",
    "timestamp": "2025-12-03T20:37:36Z"
  },
  {
    "title": "Trump Pollster Wants Republicans to Pivot to Drug Prices",
    "description": "“A top pollster for President Donald Trump advised a group of House Republicans on how to defend against Democrats’ attacks over expiring Obamacare tax credits: focus on reducing drug prices instead,” Politico reports. “Tony Fabrizio showed new polling to mem…",
    "link": "https://politicalwire.com/2025/12/03/pollster-wants-republicans-to-pivot-to-drug-prices/",
    "timestamp": "2025-12-03T20:35:37Z"
  },
  {
    "title": "MAGA Pillow Baron Mike Lindell Files Paperwork To Run For Minnesota Governor",
    "description": "MyPillow Founder and CEO Mike Lindell filed paperwork to run for Minnesota governor in 2026, the Minnesota Star Tribune reported on Wednesday.",
    "link": "https://dailycaller.com/2025/12/03/mike-lindell-mypillow-minnesota-governor/",
    "timestamp": "2025-12-03T20:29:55Z"
  },
  {
    "title": "Trump's 2025 Spotify Wrap Reveals He Listened To 'God Bless The USA' 160,000 Times",
    "description": "WASHINGTON, D.C. — Americans received further proof that their president remained laser-focused on nothing but leading the country, as Donald Trump's Spotify Wrap revealed that he listened to &#34;God Bless the USA&#34; 160,000 times this year.",
    "link": "https://babylonbee.com/news/trumps-2025-spotify-wrap-reveals-he-listened-to-god-bless-the-usa-160000-times",
    "timestamp": "2025-12-03T20:29:34Z"
  },
  {
    "title": "Sex, Power and Impunity: Epstein’s Legacy in Historical Perspective",
    "description": "The scandal that has preoccupied much of mainstream U.S. politics has, been, at one level, delightful: We have seen extremist Republicans—Reps. Marjorie Taylor Greene, Lauren Boebert, Thomas Massie and Nancy Mace—break with their party and its president in an…",
    "link": "https://msmagazine.com/2025/12/03/trump-epstein-files-history-evelyn-nesbit-kennedy/",
    "timestamp": "2025-12-03T20:29:33Z"
  },
  {
    "title": "White House tours resume in time for Christmas, but they’re different than before",
    "description": "Tours resumed Tuesday after being suspended in September because of the ballroom construction.",
    "link": "https://www.bostonherald.com/2025/12/03/white-house-public-tours/",
    "timestamp": "2025-12-03T20:29:02Z"
  },
  {
    "title": "WATCH: Minnesota Somalis express strong preference for Shariah over U.S. law",
    "description": "Man-on-the-street interviews also delve into forced marriage, insulting Muhammad",
    "link": "https://www.wnd.com/2025/12/watch-minnesota-somalis-express-strong-preference-shariah-u/",
    "timestamp": "2025-12-03T20:26:49Z"
  },
  {
    "title": "Kai Trump to help broadcast new Golf Channel Games at Trump National",
    "description": "The live made-for-TV primetime event on Golf Channel and USA Network will be staged at Trump National Golf Club.",
    "link": "https://golfweek.usatoday.com/story/sports/golf/pga/2025/12/03/golf-channel-games-broadcast-kai-trump-rory-mcilroy-scottie-scheffler/87589796007/",
    "timestamp": "2025-12-03T20:26:15Z"
  },
  {
    "title": "Popular Fox News Host Gets New Show on Saturdays",
    "description": "Getting her own show.\nThe post Popular Fox News Host Gets New Show on Saturdays appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More.",
    "link": "https://www.comingsoon.net/tv/news/2070076-fox-news-host-new-show-program-saturday",
    "timestamp": "2025-12-03T20:25:24Z"
  },
  {
    "title": "EXCLUSIVE: Prince Harry Facing Fresh Blow In Estrangement From King Charles — This Time in U.S.",
    "description": "Prince Harry now faces a new setback in his strained ties with his 'dying' father King Charles.",
    "link": "https://radaronline.com/p/prince-harry-faces-fresh-blow-estrangement-king-charles-united-states/",
    "timestamp": "2025-12-03T20:19:34Z"
  },
  {
    "title": "Trump’s legal fees could cost Georgia taxpayers millions",
    "description": "Trump's attorney said the legal fees in a recently dismissed racketeering case could cost millions.",
    "link": "https://www.salon.com/2025/12/03/trumps-legal-fees-could-cost-georgia-taxpayers-millions/",
    "timestamp": "2025-12-03T20:18:35Z"
  },
  {
    "title": "Trump's orbit fear he's now 'flying blind': report",
    "description": "President Donald Trump is losing touch and becoming isolated, a White House journalist said Wednesday. Past presidents have also had to deal with appearing — or actually being — out of touch with what everyday Americans go through, between heightened security…",
    "link": "https://www.rawstory.com/bubble-wrapped-trump-flying-blind/",
    "timestamp": "2025-12-03T20:18:08Z"
  },
  {
    "title": "Longest US government shutdown cost Delta Air Lines $200 million",
    "description": "Delta Air Lines estimates that it lost $200 million due to the longest government shutdown on record",
    "link": "https://abcnews.go.com/Business/wireStory/longest-us-government-shutdown-cost-delta-air-lines-128083819",
    "timestamp": "2025-12-03T20:17:36Z"
  },
  {
    "title": "Halle Berry Declares Gavin Newsom “Probably Should Not Be Our Next President” Over Menopause Bill Veto; Governor To Follow Oscar Winner At NYC Conference Today",
    "description": "Gavin Newsom hasn’t officially launched his all-but-certain campaign for the White House yet, but the California Governor has already lost Halle Berry’s vote. “Back in my great state of California, my very own governor, Gavin Newsom, has vetoed our menopause …",
    "link": "http://deadline.com/2025/12/halle-berry-gavin-newsom-menopause-veto-1236634920/",
    "timestamp": "2025-12-03T20:17:34Z"
  },
  {
    "title": "Miami mayoral candidate reveals how he will flip script on Dem rival's 'city of renters' strategy",
    "description": "Miami Republican mayoral candidate Emilio Gonzalez is accusing his far-left opponent Eileen Higgins of wanting to “create a city of renters,\" despite pushing a message of affordability.",
    "link": "https://www.foxnews.com/politics/miami-mayoral-candidate-reveals-how-he-will-flip-script-dem-rivals-strategy",
    "timestamp": "2025-12-03T20:17:12Z"
  },
  {
    "title": "MyGovernor! Mike Lindell files paperwork to run for Minnesota’s top job",
    "description": "MyPillow manufacturer says official campaign kickoff likely this month",
    "link": "https://www.wnd.com/2025/12/mygovernor-mike-lindell-files-paperwork-run-minnesotas-top/",
    "timestamp": "2025-12-03T20:16:47Z"
  },
  {
    "title": "MyPillow CEO Mike Lindell Files Paperwork for Potential Minnesota Governor Run to Unseat Tim Walz",
    "description": "MyPillow CEO Mike Lindell is mulling a bid for governor in Minnesota, filing paperwork opening the door for a possible run.\nThe post MyPillow CEO Mike Lindell Files Paperwork for Potential Minnesota Governor Run to Unseat Tim Walz appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/03/mypillow-ceo-mike-lindell-files-paperwork-for-potential-minnesota-governor-run-to-unseat-tim-walz/",
    "timestamp": "2025-12-03T20:15:20Z"
  },
  {
    "title": "Olivia Nuzzi’s Disastrous Memoir Rollout Is a Doomed Attempt to Have It Both Ways",
    "description": "“Reporter” and “subject” are antonyms for a reason: They’re different roles that require different skill sets to excel within. The former Washington correspondent Olivia Nuzzi is learning this the hard way. In the fall of 2024, the writer went from chroniclin…",
    "link": "https://variety.com/2025/tv/columns/olivia-nuzzi-american-canto-rollout-disaster-1236598895/",
    "timestamp": "2025-12-03T20:15:00Z"
  },
  {
    "title": "4 Republican states will help Homeland Security obtain driver’s license records",
    "description": "Florida, Indiana, Iowa and Ohio agreed to aid the Trump administration as part of a legal settlement.",
    "link": "https://www.bostonherald.com/2025/12/03/homeland-security-drivers-license-data/",
    "timestamp": "2025-12-03T20:14:47Z"
  },
  {
    "title": "At Donald Trump’s prompting, Benjamin Netanyahu seeks a pardon – but insists he has done nothing wrong",
    "description": "Netanyahu says the charges are politically motivated and will stop him doing his job properly.",
    "link": "https://theconversation.com/at-donald-trumps-prompting-benjamin-netanyahu-seeks-a-pardon-but-insists-he-has-done-nothing-wrong-271136",
    "timestamp": "2025-12-03T20:14:36Z"
  },
  {
    "title": "DOJ Indictment Targets Pedophile Cult That Gave Birth To Global Child Exploitation Threat",
    "description": "Federal officials are stopping an online cult's yearslong child sexual abuse spree with charges and arrests across multiple states, the DOJ said.",
    "link": "https://dailycaller.com/2025/12/03/doj-pedophile-cult-764-child-abuse-foreign-terrorists/",
    "timestamp": "2025-12-03T20:14:26Z"
  },
  {
    "title": "ICE protester who identified as 'bin Laden' faces charges over alleged sexually explicit threats to agents",
    "description": "Federal charges filed against Oregon man who protested ICE facility, made violent threats against law enforcement officers and their wives in posts.",
    "link": "https://www.foxnews.com/politics/ice-protester-who-identified-bin-laden-faces-charges-over-alleged-sexually-explicit-threats-agents",
    "timestamp": "2025-12-03T20:12:04Z"
  },
  {
    "title": "Federal agents begin immigration operations in New Orleans and Minneapolis (NBC News)",
    "description": "NBC News:\nFederal agents begin immigration operations in New Orleans and Minneapolis  —  The operations were launched a day after President Donald Trump said he'd be sending National Guard troops to New Orleans and disparaged Somali immigrants in Minneapolis.…",
    "link": "https://www.memeorandum.com/251203/p90",
    "timestamp": "2025-12-03T20:10:00Z"
  },
  {
    "title": "Family of man slain in a US boat strike in the Caribbean lodges complaint",
    "description": "Family of Colombian fisherman Alejandro Carranza say his right to life was violated in US 'narco-terrorist' strikes.",
    "link": "https://www.aljazeera.com/news/2025/12/3/family-of-man-slain-in-a-us-boat-strike-in-the-caribbean-lodges-complaint",
    "timestamp": "2025-12-03T20:09:24Z"
  },
  {
    "title": "What to know about the administration's plan to withhold states' money to manage SNAP food aid",
    "description": "President Donald Trump's administration says it will withhold money to help manage SNAP food aid from states that don't give the federal government information on individual recipients",
    "link": "https://abcnews.go.com/US/wireStory/administrations-plan-withhold-states-money-manage-snap-food-128084627",
    "timestamp": "2025-12-03T20:05:51Z"
  },
  {
    "title": "Vanderbilt QB Wants Trump to Get Involved in College Football After Team Gets Left Out of Playoff in Latest Ranking",
    "description": "Vanderbilt quarterback Diego Pavia called on President Donald Trump to sign an executive order that would allow the team to make the College Football Playoff.\nThe post Vanderbilt QB Wants Trump to Get Involved in College Football After Team Gets Left Out of P…",
    "link": "https://www.mediaite.com/media/sports/vanderbilt-qb-wants-trump-to-get-involved-in-college-football-after-team-gets-left-out-of-playoff-in-latest-ranking/",
    "timestamp": "2025-12-03T20:05:49Z"
  },
  {
    "title": "New Face of GOP Healthcare Fix Is Senator Linked to Largest Medicare Fraud Scheme in US History",
    "description": "US Sen. Rick Scott, former CEO of the company that was at the center of the biggest Medicare fraud scheme in American history, has emerged as the most vocal Republican proponent of healthcare reform, warning his fellow GOP lawmakers that continued refusal to …",
    "link": "https://www.commondreams.org/news/rick-scott-medicare-fraud",
    "timestamp": "2025-12-03T20:04:43Z"
  },
  {
    "title": "Trump's son-in-law almost certainly just broke the law: analyst",
    "description": "President Donald Trump's son-in-law likely broke the law this week, one analyst wrote Wednesday.Jared Kushner traveled to Moscow on Tuesday to participate in high-stakes foreign policy negotiations with Russian President Vladimir Putin over a potential peace …",
    "link": "https://www.rawstory.com/jared-kushner-2674367194/",
    "timestamp": "2025-12-03T20:03:36Z"
  },
  {
    "title": "Kids and teens go full throttle for E-bikes as federal oversight stalls",
    "description": "Federal rules requiring safety standards for batteries in e-bikes and e-scooters are in limbo.",
    "link": "https://www.bostonherald.com/2025/12/03/ebikes-federal-oversight-stalls/",
    "timestamp": "2025-12-03T20:01:45Z"
  },
  {
    "title": "Who is Henry Cuellar, the 70-year-old Texas Democrat accused of ‘acting as a foreign agent’ whom Trump just pardoned and what other charges did he face?",
    "description": "President Donald Trump issued a full and unconditional pardon to Texas Democratic Representative Henry Cuellar and his wife, Imelda. The announcement came after the Justice Department charged the couple in 2024 with bribery and acting as a foreign agent, alle…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-henry-cuellar-the-70-year-old-texas-democrat-accused-of-acting-as-a-foreign-agent-whom-trump-just-pardoned-and-what-other-charges-did-he-face/articleshow/125752462.cms",
    "timestamp": "2025-12-03T20:01:32Z"
  },
  {
    "title": "Trump Pardons Texas Democrat Rep. Henry Cuellar",
    "description": "In May 2024, the Biden administration charged Cuellar and his wife for allegedly accepting $600,000 in bribes from a company owned by the Azerbaijan government and a bank in Mexico City.\nThe post Trump Pardons Texas Democrat Rep. Henry Cuellar first appeared …",
    "link": "https://legalinsurrection.com/2025/12/trump-pardons-texas-democrat-rep-henry-cuellar/",
    "timestamp": "2025-12-03T20:00:51Z"
  },
  {
    "title": "Melinda Gates says businesses ending DEI programs are 'affecting families'",
    "description": "Melinda Gates, Bill Gates' ex-wife, mourned the loss of diversity, equity and inclusion initiatives as major companies have begun to roll back DEI programs.",
    "link": "https://www.foxnews.com/media/melinda-gates-says-businesses-ending-dei-programs-affecting-families",
    "timestamp": "2025-12-03T20:00:51Z"
  },
  {
    "title": "Top Democrat Stands By Trump Pardoning Rep. Henry Cuellar, Indicted On Conspiracy And Bribery Charges",
    "description": "House Minority Leader Hakeem Jeffries stood by President Donald Trump's decision to pardon Democratic Rep. Henry Cuellar, indicted on federal conspiracy and bribery charges last year.",
    "link": "https://www.ibtimes.com/top-democrat-stands-trump-pardoning-rep-henry-cuellar-indicted-conspiracy-bribery-charges-3791883",
    "timestamp": "2025-12-03T20:00:27Z"
  },
  {
    "title": "New Epstein Island Photos and Videos Reveal Disturbing Rooms, Statues Around the Compound",
    "description": "House Democrats release harrowing photos of Jeffrey Epstein's private island, intensifying the push for transparency as new banking records from J.P. Morgan and Deutsche Bank emerge.",
    "link": "https://www.ibtimes.com/new-epstein-island-photos-videos-reveal-disturbing-rooms-statues-around-compound-3791881",
    "timestamp": "2025-12-03T20:00:06Z"
  },
  {
    "title": "DHS to increase operations in Twin Cities region as Somali fraud becomes unignorable",
    "description": "As deportation operations continue to clean up sanctuary cities across the country, the Department of Homeland Security is focusing on another hub of problematic immigration: the Minneapolis-St. Paul region of Minnesota. The Washington Examiner reported that …",
    "link": "https://www.theblaze.com/news/dhs-to-increase-operations-in-twin-cities-region-as-somali-fraud-becomes-unignorable",
    "timestamp": "2025-12-03T20:00:00Z"
  },
  {
    "title": "Former Economist Larry Summers",
    "description": "The American Economic Association banned him for life. Given how wrong Summers has been in every major area of policy advice, why did his public disgrace require the Epstein files rather than a reckoning with his serial failures as an economist?\nThe post Form…",
    "link": "http://prospect.org/2025/12/03/former-economist-larry-summers/",
    "timestamp": "2025-12-03T20:00:00Z"
  },
  {
    "title": "Company backed by Donald Trump Jr.'s firm nabs $620M government contract | TechCrunch",
    "description": "Vulcan Elements, a rare-earth magnets startup, has secured a $620 million contract from the U.S. defense department.",
    "link": "https://techcrunch.com/2025/12/03/company-backed-by-donald-trump-jr-s-firm-nabs-620m-government-contract/",
    "timestamp": "2025-12-03T19:58:32Z"
  },
  {
    "title": "Scott Bessent Blasts New York Times At Their Own Event Over Coverage On Trump’s Health",
    "description": "Treasury Secretary Scott Bessent blasted The New York Times over their reporting on President Donald Trump's health versus former President Joe Biden's.",
    "link": "https://dailycaller.com/2025/12/03/scott-bessent-new-york-times-trump-health/",
    "timestamp": "2025-12-03T19:57:40Z"
  },
  {
    "title": "Binance Appoints Co-Founder Yi He as Co-CEO Alongside Richard Teng",
    "description": "Cryptocurrency exchange Binance has appointed Yi He, the company’s co-founder and executive leader, as co-CEO alongside Richard Teng, who has been CEO since 2023. Teng announced the appointment during his keynote speech at Binance Blockchain Week, the company…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/binance-appoints-co-founder-yi-he-as-co-ceo-alongside-richard-teng/",
    "timestamp": "2025-12-03T19:56:11Z"
  },
  {
    "title": "'If someone took Trump's land, how would he feel?' - Ukrainians view peace talks with suspicion",
    "description": "An initial proposal envisaged the Ukrainian government giving up Donetsk and Luhansk, the two regions that make up the Donbas, to Russia. But troops on the frontline are against the plans.",
    "link": "https://news.sky.com/story/if-someone-took-trumps-land-how-would-he-feel-ukrainians-view-peace-talks-with-suspicion-13478972",
    "timestamp": "2025-12-03T19:55:00Z"
  },
  {
    "title": "Previously unseen images of Epstein's island released",
    "description": "The new images come as a deadline for the broader release of documents held by the US government looms.",
    "link": "https://www.bbc.com/news/articles/c4g5rrlve33o",
    "timestamp": "2025-12-03T19:54:44Z"
  },
  {
    "title": "Trump plans to weaken vehicle mileage rules that limit air pollution",
    "description": "WASHINGTON (AP) — President Donald Trump is expected to announce a proposal Wednesday to weaken vehicle mileage rules for the auto industry, loosening regulatory pressure on automakers to control pollution from gasoline-powered cars and trucks, according to s…",
    "link": "https://freerepublic.com/focus/f-news/4355791/posts",
    "timestamp": "2025-12-03T19:54:34Z"
  },
  {
    "title": "At 83, author John Irving 'ruffles feathers' with his 16th novel",
    "description": "John Irving marches to his own drummer. Hence his methodology when creating a work of fiction.",
    "link": "https://nationalpost.com/entertainment/john-irving",
    "timestamp": "2025-12-03T19:54:22Z"
  },
  {
    "title": "Rand Paul Says Trump Boat Strikes ‘Prelude to War’ With Venezuela",
    "description": "DAILY CALLER NEWS FOUNDATION—Republican Kentucky Sen. Rand Paul said Tuesday that the Trump administration’s strikes on alleged drug boats is bringing the United States closer... Read More\nThe post Rand Paul Says Trump Boat Strikes ‘Prelude to War’ With Venez…",
    "link": "https://www.dailysignal.com/2025/12/03/rand-paul-says-trump-boat-strikes-prelude-to-war-with-venezuela/",
    "timestamp": "2025-12-03T19:53:12Z"
  },
  {
    "title": "What We Know About Trump’s $100 National Park Fee for International Tourists",
    "description": "Starting next year, international visitors to U.S. parks like Yosemite will face steeper-than-ever fees.",
    "link": "https://www.kqed.org/news/12065737/yosemite-national-park-new-fees-international-tourists-foreigners-annual-pass-2026",
    "timestamp": "2025-12-03T19:52:20Z"
  },
  {
    "title": "Tennessee Election Has GOP Fearing 2026 Blowout For Democrats",
    "description": "Democrats predicting at least 70 House seats are now in play for 2026, after Tuesday's Tennessee special election",
    "link": "https://time.com/7338426/tennessee-election-takeaways-republicans-democrats/",
    "timestamp": "2025-12-03T19:51:42Z"
  },
  {
    "title": "Here's Why The Trump Officials Are Targeting The Hepatitis B Shot",
    "description": "A federal vaccine advisory committee this week is expected to discuss whether newborns should still get the hepatitis B vaccine — the first shot found to prevent cancer.",
    "link": "https://www.huffpost.com/entry/hepatitis-b-vaccine-trump-officials-rfk-jr-target_n_693092f1e4b0cee4438216e8",
    "timestamp": "2025-12-03T19:48:31Z"
  },
  {
    "title": "Ukraine’s NATO membership ‘key question’ in US talks: Russia",
    "description": "Russian and US negotiators met in Moscow for almost five hours but there are no signs of any breakthrough.",
    "link": "https://www.aljazeera.com/news/2025/12/3/ukraines-nato-membership-key-question-in-us-talks-says-russia",
    "timestamp": "2025-12-03T19:46:57Z"
  },
  {
    "title": "Report: Pete Gets a Pass for Signalgate",
    "description": "Republicans are already spinning the report as a \"nothing burger.\"",
    "link": "https://gizmodo.com/report-pete-gets-a-pass-for-signalgate-2000695193",
    "timestamp": "2025-12-03T19:45:23Z"
  },
  {
    "title": "ICE Targets New Orleans In Latest Operation, Aims for 5,000 Arrests In The Region",
    "description": "The Department of Homeland Security officially launched what they’re calling “Operation Catahoula Crunch” in New Orleans on Wednesday, expanding President Donald Trump and his administration’s ongoing immigration crackdown in Louisiana. Federal immigration of…",
    "link": "https://www.motherjones.com/politics/2025/12/ice-swamp-sweep-new-orleans/",
    "timestamp": "2025-12-03T19:44:26Z"
  },
  {
    "title": "House Republicans subpoena Jack Smith for closed-door interview about Trump prosecutions",
    "description": "A lawyer for Smith says the prosecutor offered nearly six weeks ago to appear before the committee in an open hearing but would nonetheless appear as scheduled for the deposition.",
    "link": "https://www.pbs.org/newshour/politics/house-republicans-subpoena-jack-smith-for-closed-door-interview-about-trump-prosecutions",
    "timestamp": "2025-12-03T19:44:18Z"
  },
  {
    "title": "Rupee slide not a worry, says CEA V Anantha Nageswaran as FDI set to top $100 billion",
    "description": "Chief Economic Adviser V Anantha Nageswaran downplayed concerns over the rupee's depreciation, stating it's not pressuring inflation and expecting recovery next year. He also highlighted the need for India to \"up its game\" to attract higher FDI inflows amidst…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/rupee-slide-not-a-worry-says-cea-v-anantha-nageswaran-as-fdi-set-to-top-100-billion/articleshow/125752230.cms",
    "timestamp": "2025-12-03T19:43:46Z"
  },
  {
    "title": "Pentagon's Signalgate review finds Pete Hegseth violated military regulations",
    "description": "WASHINGTON - The Defense Department Inspector General concluded in a report filed Tuesday that the information Defense Secretary Pete Hegseth shared on a group Signal chat about a pending military operation in Yemen was considered classified, according to two…",
    "link": "https://www.nbcnews.com/politics/politics-news/pentagons-signalgate-review-finds-pete-hegseth-violated-military-regul-rcna247023",
    "timestamp": "2025-12-03T19:43:06Z"
  },
  {
    "title": "Bessent to push residency requirement for regional US Fed bank presidents",
    "description": "The move is another effort by the Trump administration to have more control over the US Federal Reserve.",
    "link": "https://www.aljazeera.com/economy/2025/12/3/bessent-to-push-residency-requirement-for-regional-us-fed-bank-presidents",
    "timestamp": "2025-12-03T19:42:50Z"
  },
  {
    "title": "Sleep will be difficult the night before the announcement of the winner of the first FIFA World Peace Prize",
    "description": "Who will win? Vladimir Putin? Benjamin Netanyahu? Adolph Hitler? (He’s dead, but like Oliver St. Jean-Mollusc, he’s not necessarily out of the competition). Robbie Williams, Andrea Bocelli and the Village People are to perform as part of a “world-class entert…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/sleep-will-be-difficult-the-night-before-the-announcement-of-the-winner-of-the-first-fifa-world-peace-prize",
    "timestamp": "2025-12-03T19:41:00Z"
  },
  {
    "title": "Western Cuba faces blackout as government seeks to update energy grid",
    "description": "Electrical failures due to ageing infrastructure, hurricanes and a struggling economy have prompted widespread protests.",
    "link": "https://www.aljazeera.com/news/2025/12/3/western-cuba-faces-blackout-as-government-seeks-to-update-energy-grid",
    "timestamp": "2025-12-03T19:40:17Z"
  },
  {
    "title": "‘It is their greed and the pollution from their products that hurt consumers’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-oil-conflicts-trump-israel",
    "timestamp": "2025-12-03T19:39:52Z"
  },
  {
    "title": "Ilhan Omar gets asked: ‘Have you begun packing your bags for Somalia?’",
    "description": "Reporter confronts congresswoman after Trump called her 'garbage'",
    "link": "https://www.wnd.com/2025/12/ilhan-omar-gets-asked-have-you-begun-packing/",
    "timestamp": "2025-12-03T19:38:31Z"
  },
  {
    "title": "Longest US government shutdown cost Delta Air Lines $200 million",
    "description": "It's the first disclosure by a U.S. airline regarding the shutdown’s financial impact.",
    "link": "https://www.bostonherald.com/2025/12/03/government-shutdown-airlines/",
    "timestamp": "2025-12-03T19:37:47Z"
  },
  {
    "title": "‘Political Stunt Wrapped in Badges’: New Orleans Readies Resistance as Trump Operation Begins",
    "description": "The Trump administration on Wednesday launched a major operation against what it said are \"criminal illegal aliens\" in New Orleans but that critics contend is political theater targeting what the Louisiana city's mayor-elect called people “just trying to surv…",
    "link": "https://www.commondreams.org/news/trump-new-orleans",
    "timestamp": "2025-12-03T19:37:37Z"
  },
  {
    "title": "Trump Wants You to Know Affordability Is a Hoax and You’ve Never Had It So Good",
    "description": "In explaining away affordability concerns, Trump is making the same mistake that his predecessor made. Perhaps he’s believing his own hype about American Greatness.",
    "link": "http://nymag.com/intelligencer/article/trump-says-affordability-is-a-hoax-voters-should-thank-him.html",
    "timestamp": "2025-12-03T19:36:06Z"
  },
  {
    "title": "Due to His Nutty Recent Actions, Pete Hegseth Might Be the Next Republican Leader Thrown Under the Bus",
    "description": "The Secretary of Defense’s explanations for his campaign in the Caribbean are getting less and less believable—and they didn’t start in a good place.",
    "link": "https://www.esquire.com/news-politics/politics/a69622737/hegseth-scrutiny/",
    "timestamp": "2025-12-03T19:36:00Z"
  },
  {
    "title": "Trump's pro-growth energy policies ‘saved AI industry’ says Nvidia CEO Jensen Huang",
    "description": "Speaking on an episode of The Joe Rogan Experience, Nvidia CEO Jensen Huang ‘flat out’ that the current growth of the AI industry in the US would not have been possible without Trump's energy policies. Trump reportedly also met Huang on Wednesday.",
    "link": "https://www.livemint.com/companies/people/trumps-pro-growth-policies-saved-ai-industry-says-nvidia-ceo-jensen-huang-11764790396439.html",
    "timestamp": "2025-12-03T19:35:33Z"
  },
  {
    "title": "Cory Booker Praises ‘Groundbreaking’ Trump Provision In Signature Bill He Slammed As ‘Moral Obscenity’",
    "description": "Democratic New Jersey Sen. Cory Booker is effusively praising a provision within a Trump-backed law despite calling the legislation a “moral obscenity” several months earlier. Booker, a left-wing Democrat with presidential ambitions, applauded a multibillion …",
    "link": "https://dailycaller.com/2025/12/03/cory-booker-trump-accounts-child-investment-big-beautiful-bill/",
    "timestamp": "2025-12-03T19:35:23Z"
  },
  {
    "title": "Mike Johnson buried over plan to rapidly swear in Republican after making Dem wait 50 days",
    "description": "Speaker of the House Mike Johnson is coming under fire after a report revealed he expects to swear in this week the newest Republican elected to Congress, Matt Van Epps, for whom Johnson campaigned. Van Epps won a narrow victory Tuesday night in a deep red Te…",
    "link": "https://www.rawstory.com/alternet-posts/johnson-swearing-in-republican/",
    "timestamp": "2025-12-03T19:34:34Z"
  },
  {
    "title": "Kremlin says Putin accepted some US proposals on Ukraine and is ready to continue talking",
    "description": "Kremlin spokesman Dmitry Peskov was speaking after talks in Moscow between Putin and U.S. President Donald Trump's special envoy, Steve Witkoff, and son-in-law Jared Kushner went into the early hours of Wednesday morning, with a Kremlin aide saying afterwards…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/kremlin-says-putin-accepted-some-us-proposals-on-ukraine-and-is-ready-to-continue-talking/articleshow/125752036.cms",
    "timestamp": "2025-12-03T19:31:44Z"
  },
  {
    "title": "Trump met with Nvidia CEO Jensen Huang on export controls, source says",
    "description": "Dec 3 : U.S. President Donald Trump met with chip giant Nvidia's CEO Jensen Huang on Wednesday to discuss export controls, a source familiar with the matter told Reuters. Nvidia did not immediately respond to a Reuters request for comment. Huang was in the U.…",
    "link": "https://www.channelnewsasia.com/business/trump-met-nvidia-ceo-jensen-huang-export-controls-source-says-5537606",
    "timestamp": "2025-12-03T19:30:19Z"
  },
  {
    "title": "Trump praises Nvidia CEO Jensen Huang after discussion about export controls",
    "description": "U.S. President Donald Trump said on Wednesday he had visited with Nvidia's CEO Jensen ​Huang and said the chip giant executive was aware of where he ‌stood on...",
    "link": "https://finance.yahoo.com/news/trump-met-nvidia-ceo-jensen-193019469.html",
    "timestamp": "2025-12-03T19:30:19Z"
  },
  {
    "title": "Trump met with Nvidia CEO Jensen Huang about export controls, CBS News' reporter says",
    "description": "Dec 3 : U.S. President Donald Trump met with chip giant Nvidia CEO Jensen Huang on Wednesday to discuss export controls, a CBS News reporter said in a post on X. Nvidia did not immediately respond to a Reuters request for comment.",
    "link": "https://www.channelnewsasia.com/business/trump-met-nvidia-ceo-jensen-huang-about-export-controls-cbs-news-reporter-says-5537606",
    "timestamp": "2025-12-03T19:30:19Z"
  },
  {
    "title": "JUST IN: MyPillow Founder and Trump Ally Mike Lindell Files To Run For Minnesota Governor",
    "description": "MyPillow founder Mike Lindell filed paperwork to run for governor of Minnesota, though he is not \"100%\" yet on whether he will actually run.\nThe post JUST IN: MyPillow Founder and Trump Ally Mike Lindell Files To Run For Minnesota Governor first appeared on M…",
    "link": "https://www.mediaite.com/media/news/just-in-mypillow-founder-and-trump-ally-mike-lindell-files-to-run-for-minnesota-governor/",
    "timestamp": "2025-12-03T19:28:07Z"
  },
  {
    "title": "Is the Royal Family Coming to America in 2026? Breaking Down the Rumors",
    "description": "Some members of the royal family might be traveling to America next year. Multiple reports claimed in November that Prince William and Princess Kate Middleton would be taking a trip to the United States in the coming months. Page Six was first to report the n…",
    "link": "https://www.usmagazine.com/celebrity-news/news/is-the-royal-family-coming-to-america-in-2026-rumors-explained/#article",
    "timestamp": "2025-12-03T19:26:53Z"
  },
  {
    "title": "Stop wasting the world's time, Ukraine tells Putin after US talks in Moscow",
    "description": "Ukrainian Foreign Minister Andrii Sybiha‎ spoke after high-stakes talks on ending the war failed to produce tangible results.",
    "link": "https://www.bbc.com/news/articles/c7731n5z6d3o",
    "timestamp": "2025-12-03T19:25:30Z"
  },
  {
    "title": "Henry Cuellar will seek reelection as a Democrat after Trump pardon (Politico)",
    "description": "Politico:\nHenry Cuellar will seek reelection as a Democrat after Trump pardon  —  Texas Rep. Henry Cuellar filed for reelection Wednesday as a Democrat and told reporters he had no intention to retire or switch parties hours after President Donald Trump annou…",
    "link": "https://www.memeorandum.com/251203/p82",
    "timestamp": "2025-12-03T19:25:00Z"
  },
  {
    "title": "Was the Bitcoin Jump a 'Fake Breakout'?",
    "description": "Bitcoin surged on Tuesday but lost momentum. Analysts debate whether the rally will last as markets brace for the Federal Reserve's rate decision next week.",
    "link": "https://decrypt.co/350787/was-bitcoin-jump-fake-breakout",
    "timestamp": "2025-12-03T19:23:40Z"
  },
  {
    "title": "'McScuse me?' Senate Republican under fire over food stamp crackdown bid",
    "description": "Sen. Joni Ernst (R-IA) faced criticism for a proposal to limit where food stamp recipients can purchase meals.The Iowa Republican, who is not seeking re-election, told Fox Business that she would introduce a bill to prevent SNAP recipients from using their go…",
    "link": "https://www.rawstory.com/joni-ernst-2674367045/",
    "timestamp": "2025-12-03T19:22:54Z"
  },
  {
    "title": "'Disturbing look': Democrats release photos and videos from Jeffrey Epstein's islands",
    "description": "Release made 'to ensure public transparency ... and to help piece together the full picture of Epstein’s horrific crimes,' said committee member",
    "link": "https://nationalpost.com/news/world/jeffrey-epstein-islands-photos-released",
    "timestamp": "2025-12-03T19:22:35Z"
  },
  {
    "title": "‘Utter Bullsh*t’: Josh Shapiro Lashes Out At Kamala Harris Over Memoir Tales",
    "description": "Democratic Gov. Josh Shapiro of Pennsylvania profanely disputed stories in Kamala Harris’ memoir of the 2024 campaign during an interview with The Atlantic.",
    "link": "https://dailycaller.com/2025/12/03/utter-bullsht-josh-shapiro-lashes-out-at-kamala-harris-over-memoir-tales/",
    "timestamp": "2025-12-03T19:20:43Z"
  },
  {
    "title": "Brazil Emerges as AI Hot Spot With TikTok’s Data Center Push",
    "description": "A 200 billion reais ($38 billion) commitment from ByteDance’s TikTok to help build a massive data center complex in Brazil is cementing the nation’s position as the leading location in the region for AI-related investment.",
    "link": "https://financialpost.com/pmn/business-pmn/brazil-emerges-as-ai-hot-spot-with-tiktoks-data-center-push",
    "timestamp": "2025-12-03T19:19:58Z"
  },
  {
    "title": "19 Countries Blocked From Immigrating to US",
    "description": "The Trump administration is pushing pause on immigration applications from 19 countries and reviewing approved applications from those same nations. Multiple reports indicate the list of nations could be expanded.   For now, the... Read More\nThe post 19 Count…",
    "link": "https://www.dailysignal.com/2025/12/03/19-countries-blocked-from-immigrating-to-us/",
    "timestamp": "2025-12-03T19:19:09Z"
  }
]