[
  {
    "title": "Republicans Just Can't Seem To Condemn Trump's Policy Shift Toward Putin",
    "description": "GOP officials who have supported Ukraine are trying to balance their opposition to Russia while remaining loyal to Trump.",
    "link": "https://www.huffpost.com/entry/republicans-condemn-trump-policy-putin-ukraine_n_67bba650e4b0249e5d5afa6b",
    "timestamp": "2025-02-24T00:45:23Z"
  },
  {
    "title": "Trump administration is eliminating 2,000 USAID positions in US, notice says",
    "description": "Elon Musk’s Department of Government Efficiency has led an effort to gut USAID, the main delivery mechanism for American foreign assistance.",
    "link": "https://www.usatoday.com/story/news/politics/2025/02/23/trump-administration-lay-off-usaid-workers/79881762007/",
    "timestamp": "2025-02-24T00:42:06Z"
  },
  {
    "title": "Germany's conservatives win election but hard coalition talks loom",
    "description": "Germany's conservatives won the national election, placing Friedrich Merz in a difficult position as chancellor. A fractured vote boosted the far-right AfD to its best result, complicating coalition talks amidst Germany's divided society and strained internat…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/germanys-conservatives-win-election-but-hard-coalition-talks-loom/articleshow/118516315.cms",
    "timestamp": "2025-02-24T00:40:50Z"
  },
  {
    "title": "New FBI Director Kash Patel will also be named acting head of the ATF, official says",
    "description": "Washington, Feb 23 (AP) New FBI Director Kash Patel is expected to be named the acting head of the Bureau of Alcohol, Tobacco, Firearms and Explosives, a Justice Department official said Saturday. Patel could be sworn in next week, the official said, putting …",
    "link": "https://thehillstimes.in/international/new-fbi-director-kash-patel-will-also-be-named-acting-head-of-the-atf-official-says",
    "timestamp": "2025-02-24T00:40:00Z"
  },
  {
    "title": "Trump fires top US general in major Pentagon shake-up",
    "description": "US President Donald Trump has fired Force General CQ Brown as chairman of the US Joint Chiefs of Staff as part of a wider shake-up of top military leadership. “I want to thank General Charles ‘CQ’ Brown for his over 40 years of service to our country, includi…",
    "link": "https://thechronicle.com.gh/trump-fires-top-us-general-in-major-pentagon-shake-up/",
    "timestamp": "2025-02-24T00:38:15Z"
  },
  {
    "title": "Texas sues NCAA to demand ‘sex screening’ of student athletes",
    "description": "The state of Texas have launched a lawsuit against the National Collegiate Athletic Association (NCAA) to force the organisation to screen the biological sex of student athletes. The Republican attorney general of Texas, Ken Paxton, is currently seeking a cou…",
    "link": "https://www.thepinknews.com/2025/02/24/texas-sues-ncaa-to-demand-sex-screening-of-student-athletes/",
    "timestamp": "2025-02-24T00:37:37Z"
  },
  {
    "title": "Ukraine hemmed in as U.S. backing frays three years after Russian invasion",
    "description": "Thousands of Ukrainian citizens have died and over 6 million live as refugees abroad since Russian President Vladimir Putin ordered the invasion by land, sea and air.",
    "link": "https://www.japantimes.co.jp/news/2025/02/24/world/politics/ukraine-us-backing-three-years/",
    "timestamp": "2025-02-24T00:37:00Z"
  },
  {
    "title": "March for Ukraine draws thousands in Boston as war moves into fourth year",
    "description": "“Today we gather again on this lawn to express our solidarity with the people of Ukraine and its struggle for freedom amid months of political turmoil and the unprecedented pressure that is being applied on Ukrainian leadership, Ukrainian people, and military…",
    "link": "https://www.bostonherald.com/2025/02/23/march-for-ukraine-draws-thousands-in-boston-as-war-moves-into-fourth-year/",
    "timestamp": "2025-02-24T00:32:44Z"
  },
  {
    "title": "Most USAID workers to be fired or placed on leave",
    "description": "Most employees at USAID will be placed on leave or fired by midnight on Sunday, the aid agency said, as President Donald Trump’s administration plows ahead in slashing government spending. Around 1,600 workers based in the United States will be laid off in a …",
    "link": "https://www.digitaljournal.com/world/most-usaid-workers-to-be-fired-or-placed-on-leave/article",
    "timestamp": "2025-02-24T00:32:21Z"
  },
  {
    "title": "Trump administration threatens tariffs for any nation that dares to tax Big Tech",
    "description": "Digital services taxes, network build levies, touted as violations of US sovereignty\nUnited States president Donald Trump last Friday issued a memorandum that suggests imposition of tariffs on nations that dare to tax big tech companies.…",
    "link": "https://www.theregister.com/2025/02/24/trump_administration_dst_countertariffs/",
    "timestamp": "2025-02-24T00:31:47Z"
  },
  {
    "title": "Trump Fires Joint Chiefs of Staff After Alleged Coup Plot Exposed by James O’Keefe Video",
    "description": "By: Collin Campbell @ProjectConstitu(Watch The Video Here) https://x.com/ProjectConstitu/status/1893527590087852473Feb 22, 2025 - Washington, D.C. In a stunning and unprecedented move, President Donald Trump has fired the Joint Chiefs of Staff, the highest-ra…",
    "link": "https://freerepublic.com/focus/f-news/4299950/posts",
    "timestamp": "2025-02-24T00:29:44Z"
  },
  {
    "title": "Some US agencies tell workers not to reply to Musk's 'What did you do last week' email",
    "description": "WASHINGTON: Multiple US agencies have told employees not to respond immediately to a demand by President Donald Trump's adviser Elon Musk to list their accomplishments in the past week or be f",
    "link": "https://www.channelnewsasia.com/world/some-us-agencies-tell-workers-not-reply-musks-what-did-you-do-last-week-email-4955306",
    "timestamp": "2025-02-24T00:28:00Z"
  },
  {
    "title": "Trump's border czar Tom Homan is 'bringing hell' to Boston",
    "description": "\"Take that badge off your chest, put it in the desk drawer because you became a politician, you forgot what it was like to be a cop.”",
    "link": "https://www.boston.com/news/politics/2025/02/23/trump-border-czar-attacks-police-commissioner-says-hes-bringing-hell-to-boston/",
    "timestamp": "2025-02-24T00:26:50Z"
  },
  {
    "title": "Trump again attacks USAID, claims USD 18 mn given to India to help with elections",
    "description": "Washington, Feb 23: US President Donald Trump has claimed that the Biden administration allocated USD 18 million in funding to India to help with its elections, arguing that the country doesn’t need this money. His remarks during a speech at the Conservative …",
    "link": "https://thehillstimes.in/international/trump-again-attacks-usaid-claims-usd-18-mn-given-to-india-to-help-with-elections",
    "timestamp": "2025-02-24T00:25:00Z"
  },
  {
    "title": "Three years on, Ukraine's extinction nightmare has returned",
    "description": "Three years on from Russia's invasion of Ukraine, the return of Donald Trump has changed everything",
    "link": "https://www.bbc.com/news/articles/cx2xngznyego",
    "timestamp": "2025-02-24T00:24:59Z"
  },
  {
    "title": "Democrats Panic over President Trump’s Talk of Reforming U.S. Postal Service",
    "description": "House Oversight Committee Democrats are panicking over comments President Donald Trump made Friday about reforming the U.S. Postal Service. While Trump has not established a specific plan, he criticized the Postal Service and talked about how it might be impr…",
    "link": "https://freerepublic.com/focus/f-news/4299948/posts",
    "timestamp": "2025-02-24T00:24:04Z"
  },
  {
    "title": "AG Pam Bondi Issues Warning to Democrat Governors Refusing to Deport Illegals — ‘You Better Comply’",
    "description": "Attorney General Pam Bondi has issued a stern warning to Democrat governors who are refusing to deport illegal aliens, saying, “You better comply.” Bondi issued the warning during an appearance on Fox News on Friday. Immediately after being sworn in, Bondi fi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4299947/posts",
    "timestamp": "2025-02-24T00:23:55Z"
  },
  {
    "title": "Musk unilaterally shutters USAID",
    "description": "It’s clear where this was headed: The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development on leave worldwide and eliminating at least 1,600 U.S.-based jobs. The move was the late…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/musk-unilaterally-shutters-usaid",
    "timestamp": "2025-02-24T00:22:10Z"
  },
  {
    "title": "Germany's Merz vows 'independence' from Trump's America, warning NATO may soon be dead (Politico)",
    "description": "Politico:\nGermany's Merz vows ‘independence’ from Trump's America, warning NATO may soon be dead  —  BERLIN — Friedrich Merz did not even wait for the final results in Germany's election before delivering what could well be a defining verdict on U.S. Presiden…",
    "link": "https://www.memeorandum.com/250223/p72",
    "timestamp": "2025-02-24T00:20:01Z"
  },
  {
    "title": "No comfort in rebased inflation figures",
    "description": "STICKING to its promise, the National Bureau of Statistics announced Nigeria’s rebased inflation data on February 18. The headline inflation rate was revised downwards to 24.48 per cent in January from 34.80 per cent in December. This is a huge difference. It…",
    "link": "https://punchng.com/no-comfort-in-rebased-inflation-figures/",
    "timestamp": "2025-02-24T00:10:08Z"
  },
  {
    "title": "Trump defends mass deportations, says he is draining swamp",
    "description": "Washington, Feb 23: US President Donald Trump has defended the mass deportation of undocumented foreign nationals, saying his administration draining the swamp by sending home fraudsters, cheaters, globalists and deep state bureaucrats. Trump has made the mas…",
    "link": "https://thehillstimes.in/international/trump-defends-mass-deportations-says-he-is-draining-swamp",
    "timestamp": "2025-02-24T00:10:00Z"
  },
  {
    "title": "How the UK Is Weakening Safety Worldwide",
    "description": "This week, the UK put the entire world at risk. I understand that may sound like alarmist hyperbole, but follow me. To understand, we hav...",
    "link": "https://blog.thenewoil.org/how-the-uk-is-weakening-safety-worldwide",
    "timestamp": "2025-02-24T00:09:16Z"
  },
  {
    "title": "Trump administration directing ICE to track down unaccompanied minors: Source",
    "description": "There are more than 600,000 migrant children who have crossed the southern border without a legal guardian or parent since 2019, according to government data.",
    "link": "https://abcnews.go.com/Politics/trump-administration-directing-ice-track-unaccompanied-minors-source/story?id=119107322",
    "timestamp": "2025-02-24T00:07:03Z"
  },
  {
    "title": "Democrats Panic over President Trump’s Talk of Reforming U.S. Postal Service",
    "description": "House Oversight Committee Democrats are panicking over comments President Donald Trump made about reforming the U.S. Postal Service.\nThe post Democrats Panic over President Trump’s Talk of Reforming U.S. Postal Service appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/23/democrats-panic-over-president-trumps-talk-of-reforming-u-s-postal-service/",
    "timestamp": "2025-02-24T00:05:10Z"
  },
  {
    "title": "States threaten fines, jail time for local officials who resist Trump’s immigration crackdown",
    "description": "Atlanta (US), Feb 23: Republican state lawmakers seeking to aid President Donald Trump’s crackdown on illegal immigration are threatening local officials who resist with lawsuits, fines and even potential jail time. Lawmakers in more than 20 states this year …",
    "link": "https://thehillstimes.in/international/states-threaten-fines-jail-time-for-local-officials-who-resist-trumps-immigration-crackdown",
    "timestamp": "2025-02-24T00:05:00Z"
  },
  {
    "title": "Trump’s second term: A political earthquake with global aftershocks",
    "description": "THINK ABOUT IT: Trump’s second term is shaking global stability and U.S. governance, with sweeping policy changes, agency cuts, and high-stakes geopolitical shifts.",
    "link": "https://www.jpost.com/opinion/article-843423",
    "timestamp": "2025-02-24T00:01:39Z"
  },
  {
    "title": "The rupture in diplomatic norms has left Ukraine and Europe reeling - as Russia's invasion reaches three-year mark",
    "description": "In less than a fortnight, Donald Trump has shredded long-standing security assumptions about American support for Europe, creating a new crisis for Ukraine and leaving the whole continent in greater peril than at any time since the end of the Second World War.",
    "link": "https://news.sky.com/story/the-rupture-in-diplomatic-norms-has-left-ukraine-and-europe-reeling-as-russias-invasion-reaches-three-year-mark-13316013",
    "timestamp": "2025-02-24T00:01:00Z"
  },
  {
    "title": "Coinbase says SEC has agreed to drop enforcement case",
    "description": "Coinbase is claiming victory in its long-running tussle with the Securities Exchange Commission, stating that the regulator has agreed to drop its enforcement case against the crypto firm.",
    "link": "https://www.finextra.com/newsarticle/45546/coinbase-says-sec-has-agreed-to-drop-enforcement-case",
    "timestamp": "2025-02-24T00:01:00Z"
  },
  {
    "title": "West Bank 'turning into mini-Gaza' as Israeli troops bulldoze homes",
    "description": "A bulldozer tears huge chunks out of buildings in an emptied-out Palestinian neighbourhood.",
    "link": "https://news.sky.com/story/operation-iron-wall-west-bank-areas-turning-into-mini-gaza-as-israeli-troops-raid-homes-13313593",
    "timestamp": "2025-02-24T00:01:00Z"
  },
  {
    "title": "John Oliver has no plans to stop poking fun at his adopted homeland",
    "description": "John Oliver has been unleashing his searing, satirical take on the U.S., his adopted homeland, for years. The comedian plans to continue for \"as long as America has systemic problems.\"",
    "link": "https://www.cbsnews.com/news/john-oliver-last-week-tonight-comedy-60-minutes-transcript/",
    "timestamp": "2025-02-24T00:00:31Z"
  },
  {
    "title": "Confusion, fear at the Justice Department under Trump",
    "description": "The Department of Justice is in upheaval from firings and resignations in the first weeks of the Trump administration. Fear has silenced many in the department, but two prosecutors are speaking up.",
    "link": "https://www.cbsnews.com/news/justice-department-under-trump-60-minutes/",
    "timestamp": "2025-02-24T00:00:20Z"
  },
  {
    "title": "Firings and resignations at the Department of Justice",
    "description": "President Trump says his administration is cleaning up a Justice Department corrupted by politics. Amid the firings and resignations, one leader described a workplace of \"confusion\" and \"fear.\"",
    "link": "https://www.cbsnews.com/news/justice-department-firings-resignations-60-minutes-transcript/",
    "timestamp": "2025-02-24T00:00:18Z"
  },
  {
    "title": "Fake videos show Barron Trump singing on 'America's Got Talent'",
    "description": "The videos displayed clear signs of being generated using artificial intelligence (AI) software.",
    "link": "https://www.snopes.com//fact-check/barron-trump-americas-got-talent-videos/",
    "timestamp": "2025-02-24T00:00:00Z"
  },
  {
    "title": "Trump administration moves ahead with firing 2,000 USAID workers, with thousands more put on leave",
    "description": "The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development on leave worldwide and eliminating 2,000 U.S.-based staff positions.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-moves-ahead-with-firing-2000-usaid-workers-with-thousands-more-put-on-leave",
    "timestamp": "2025-02-23T23:58:49Z"
  },
  {
    "title": "Texas Lawmakers Scramble To Stop Solar Energy But It Just Keeps Coming",
    "description": "The solar energy is still alive and kicking in Texas, although two anti-renewables bills will go into effect on September 1 if state legislators pass them into law.\nThe post Texas Lawmakers Scramble To Stop Solar Energy But It Just Keeps Coming appeared first…",
    "link": "https://cleantechnica.com/2025/02/23/texas-lawmakers-scramble-to-stop-solar-energy-but-it-just-keeps-coming/",
    "timestamp": "2025-02-23T23:58:46Z"
  },
  {
    "title": "Asia markets live update: Asia markets primed to fall",
    "description": "Asia markets live update: Asia markets primed to fallcnbc.com",
    "link": "https://www.cnbc.com/2025/02/24/asia-markets-live-update-asia-markets-primed-to-fall.html",
    "timestamp": "2025-02-23T23:58:31Z"
  },
  {
    "title": "Federal Union Leader Fires Back At 'Unelected And Unhinged' Elon Musk",
    "description": "A federal union leader told the administration to retract its insulting \"what did you do last week?\" email, saying it violates the law and wastes everybody's time.",
    "link": "https://www.huffpost.com/entry/elon-musk-email-federal-employees_n_67bba9aee4b0249e5d5afa90",
    "timestamp": "2025-02-23T23:58:24Z"
  },
  {
    "title": "Disturbing reason NASA 'abandoned' stranded astronauts in space, according to experts",
    "description": "A public blame-game has erupted over who's responsible for leaving two NASA astronauts stuck on the International Space Station (ISS) for over eight months. Last week, Elon Musk blamed NASA's choice to extend Sunita Williams and Barry Wilmore's ISS mission on…",
    "link": "https://freerepublic.com/focus/f-chat/4299942/posts",
    "timestamp": "2025-02-23T23:57:19Z"
  },
  {
    "title": "Zelensky says he is willing to step down if it means peace in Ukraine | Honolulu Star-Advertiser",
    "description": "KYIV >> Ukraine’s President Volodymyr Zelensky said on Sunday he was willing to give up his position if it meant peace in Ukraine, adding that he could exchange his departure for his country’s entry into the NATO military alliance.",
    "link": "https://www.staradvertiser.com/2025/02/23/breaking-news/zelensky-says-he-is-willing-to-step-down-if-it-means-peace-in-ukraine/",
    "timestamp": "2025-02-23T23:57:06Z"
  },
  {
    "title": "Meloni slams Left’s double standards",
    "description": "Washington, Feb 23: Italian Prime Minister Giorgia Meloni has slammed the Left’s “double standards” in perceiving conservatives globally, saying when leaders like herself, US President Donald Trump and Prime Minister Narendra Modi collaborate they are called …",
    "link": "https://thehillstimes.in/international/meloni-slams-lefts-double-standards",
    "timestamp": "2025-02-23T23:55:00Z"
  },
  {
    "title": "Ukraine hemmed in as US backing frays three years after Russian invasion - Reuters",
    "description": "Ukraine hemmed in as US backing frays three years after Russian invasionReuters  Opinion | Who Will Stand Up to Trump on Ukraine?The New York Times  Donald Trump&rsquo;s Putinization of AmericaThe New Yorker  A Grand Bargain With Russia Would Be a DisasterFor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176360007",
    "timestamp": "2025-02-23T23:52:24Z"
  },
  {
    "title": "New Jersey athletic association to keep policy on trans athletes",
    "description": "The agency overseeing school sports in New Jersey is refusing to change its policy on trans athletes, despite executive orders from President Donald Trump banning trans athletes from competing. The New Jersey State Interscholastic Athletic Association (NJSIAA…",
    "link": "https://www.thepinknews.com/2025/02/23/new-jersey-athletic-association-to-keep-policy-on-trans-athletes/",
    "timestamp": "2025-02-23T23:50:57Z"
  },
  {
    "title": "President Trump’s granddaughter Kai shares insider’s look at White House on inauguration night",
    "description": "While the rest of the family posed for photos at the White House, Kai Trump broke away from the group to pop inside her favorite rooms.",
    "link": "https://nypost.com/2025/02/23/us-news/kai-trump-shares-insiders-look-at-white-house-on-inauguration-night/",
    "timestamp": "2025-02-23T23:50:04Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave",
    "description": "The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development on leave worldwide and eliminating 2,000 U.S.-based staff positions.",
    "link": "https://www.wlwt.com/article/trump-administration-firing-usaid-workers-thousands-on-leave/63892031",
    "timestamp": "2025-02-23T23:48:32Z"
  },
  {
    "title": "Biden’s UN Ambassador Susan Rice Claims Trump ‘Throwing Ukraine Under The Bus’ Will Embolden China to Invade Taiwan",
    "description": "Former United Nations Ambassador Susan Rice said President Donald Trump's policy towards ending the war in Ukraine will embolden China to invade Taiwan. \nThe post Biden’s UN Ambassador Susan Rice Claims Trump ‘Throwing Ukraine Under The Bus’ Will Embolden Chi…",
    "link": "https://www.mediaite.com/news/bidens-un-ambassador-susan-rice-claims-trump-throwing-ukraine-under-the-bus-will-embolden-china-to-invade-taiwan/",
    "timestamp": "2025-02-23T23:47:35Z"
  },
  {
    "title": "Australians invade London’s right-wing ARC conference, and the anti-Trump dam is breaking",
    "description": "The ARC of political history is bending towards Trumpism, pulling even the conflicted and hesitant along with the tide.\nThe post Australians invade London’s right-wing ARC conference, and the anti-Trump dam is breaking appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/24/arc-cpac-conference-donald-trump-conservative-politics/",
    "timestamp": "2025-02-23T23:46:53Z"
  },
  {
    "title": "France and Britain’s leaders head to Washington to urge Trump not to abandon Ukraine",
    "description": "The leaders of France and Britain are making tag-team visits to Washington this week as Europe attempts to persuade President Donald Trump not to abandon Ukraine in pursuit of a peace deal in the three-year-old war with Russia.",
    "link": "https://www.pbs.org/newshour/world/france-and-britains-leaders-head-to-washington-to-urge-trump-not-to-abandon-ukraine",
    "timestamp": "2025-02-23T23:42:49Z"
  },
  {
    "title": "You can judge your own integrity by the corruption of your enemies.",
    "description": "If Republicans won’t prosecute the crooked Democrats, then they are in on it, too. And, yes, every crooked politician is an enemy of America. And if the straight politicians won’t fight for us, we’re done. \"Corruption runs so deep in DC that Democrats and Rep…",
    "link": "https://freerepublic.com/focus/f-chat/4299939/posts",
    "timestamp": "2025-02-23T23:39:33Z"
  },
  {
    "title": "You can judge your own integrity by the corruption of your enemies.",
    "description": "If Republicans won’t prosecute the crooked Democrats, then they are in on it, too. And, yes, every crooked politician is an enemy of America. And if the straight politicians won’t fight for us, we’re done. \"Corruption runs so deep in DC that Democrats and Rep…",
    "link": "https://freerepublic.com/focus/f-news/4299939/posts",
    "timestamp": "2025-02-23T23:39:33Z"
  },
  {
    "title": "Donald Trump knew exactly who to call to connect with Daniel Penny — me!",
    "description": "The Post's Cindy Adams shares that President Trump reached out to connect with former Marine Daniel Penny after he was acquitted.",
    "link": "https://nypost.com/2025/02/23/opinion/donald-trump-knew-exactly-who-to-call-to-connect-with-daniel-penny-me/",
    "timestamp": "2025-02-23T23:39:06Z"
  },
  {
    "title": "Trump administration fires 2,000 USAID workers, puts thousands of others on leave",
    "description": "Washington — The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development on leave worldwide and eliminating 2,000 U.S.-based staff positions.\n\n\nThe move was the latest and one of the…",
    "link": "https://www.voanews.com/a/trump-administration-firing-2-000-usaid-workers-putting-thousands-of-others-on-leave/7985347.html",
    "timestamp": "2025-02-23T23:37:57Z"
  },
  {
    "title": "Who Is Friedrich Merz? Germany's Likely Next Chancellor",
    "description": "The German federal polls have closed, and the exit polls appear to have handed the Christian Democratic Union (CDU) a victory.",
    "link": "https://www.newsweek.com/friedrich-merz-germany-chancellor-2035041",
    "timestamp": "2025-02-23T23:34:40Z"
  },
  {
    "title": "Grok blocked results saying Musk and Trump “spread misinformation”",
    "description": "Grok, Elon Musk’s ChatGPT competitor, temporarily refused to respond with “sources that mention Elon Musk/Donald Trump spread misinformation,” according to xAI’s head of engineering, Igor Babuschkin. After Grok users noticed that the chatbot had been given in…",
    "link": "https://www.theverge.com/news/618109/grok-blocked-elon-musk-trump-misinformation",
    "timestamp": "2025-02-23T23:33:35Z"
  },
  {
    "title": "Zelenskyy says he’s willing to step down as president for a NATO membership",
    "description": "President Volodymyr Zelenskyy said that he’s willing to step down if it means a NATO membership for Ukraine.",
    "link": "https://www.wmur.com/article/president-zelenskyy-ukraine-russia-nato-membership-02232025/63891800",
    "timestamp": "2025-02-23T23:30:31Z"
  },
  {
    "title": "Most USAID workers placed on leave, Trump administration says",
    "description": "Some 2,000 employees will also be laid-off in a \"reduction in force\" effort, according to an email sent to staff.",
    "link": "https://www.bbc.com/news/articles/cr42r2gw5wzo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-23T23:27:07Z"
  },
  {
    "title": "Some US agencies tell workers not to reply to Musk's 'accomplishments email'",
    "description": "Washington — Multiple U.S. federal agencies told employees not to respond immediately to a demand by President Donald Trump's adviser Elon Musk to list their accomplishments in the last week or be fired, as a chaotic campaign to cull the bureaucracy pushes fo…",
    "link": "https://www.voanews.com/a/some-us-agencies-tell-workers-not-to-reply-to-musk-s-accomplishments-email-/7985346.html",
    "timestamp": "2025-02-23T23:24:28Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development",
    "link": "https://www.newsbreak.com/share/3826251146028-the-trump-administration-is-firing-2-000-usaid-workers-and-putting-thousands-of-others-on-leave?s=a2&share_destination_id=MTc5NTk0Nzc5LTE3NDAzNTI4NzE1MDc%3D&pd=0C9Ynzwh&hl=en_US&send_time=1740352871&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v2",
    "timestamp": "2025-02-23T23:23:16Z"
  },
  {
    "title": "A Ukrainian Drone Chased A Blind Russian Turtle Tank Into A Deep Hole—And Blew It Up",
    "description": "Adding armor can obscure tank drivers’ visibility on battlefields buzzing with drones.",
    "link": "https://www.forbes.com/sites/davidaxe/2025/02/23/a-ukrainian-drone-chased-a-blind-russian-turtle-tank-into-a-deep-hole-and-blew-it-up/",
    "timestamp": "2025-02-23T23:23:14Z"
  },
  {
    "title": "Conservatives win German election - as far-right AfD makes historic gains, projections show",
    "description": "Germany's conservative Christian Democrats (CDU) and their Bavarian sister party the Christian Social Union (CSU) have won the country's federal elections, latest projections show - as the far-right Alternative for Germany (AfD) scores its best-ever result an…",
    "link": "https://news.sky.com/story/conservatives-win-german-election-as-far-right-afd-makes-historic-gains-and-olaf-scholzs-spd-collapses-projections-show-13316017",
    "timestamp": "2025-02-23T23:20:00Z"
  },
  {
    "title": "Trump is reviving a tariff strategy from America’s ‘Gilded Age’. It didn’t end well last time",
    "description": "Donald Trump praises the 19th-century “reciprocal” tariff policy of former president William McKinley. But that strategy damaged the US economy – and the Republican Party.",
    "link": "https://theconversation.com/trump-is-reviving-a-tariff-strategy-from-americas-gilded-age-it-didnt-end-well-last-time-250389",
    "timestamp": "2025-02-23T23:17:56Z"
  },
  {
    "title": "USAID funding row : Congress says PM Modi , EAM S Jaishankar must answer why govt silent despite Donald Trump ‘insulting’ India",
    "description": "NEW DELHI, Feb 23: Amid the USAID funding row, the Congress on Sunday accused the BJP of indulging in “anti-national work” by spreading “fake news from America” and asserted that Prime Minister Narendra Modi and External Affairs minister S Jaishankar will als…",
    "link": "https://thehillstimes.in/national/usaid-funding-row-congress-says-pm-modi-eam-s-jaishankar-must-answer-why-govt-silent-despite-donald-trump-insulting-india",
    "timestamp": "2025-02-23T23:15:00Z"
  },
  {
    "title": "A military vet and a scientist were securing America's food system. Trump fired them",
    "description": "Derek Copeland was 11 days away from hitting his one-year mark with the U.S. Department of Agriculture when he received his termination letter on Feb. 14. \"You have not demonstrated that your further employment at the Agency would be in the public interest,\" …",
    "link": "https://freerepublic.com/focus/f-news/4299935/posts",
    "timestamp": "2025-02-23T23:13:49Z"
  },
  {
    "title": "Philadelphia Eagles Reportedly Make Final Decision On White House Visit Following Super Bowl 59 Win - NewsBreak",
    "description": "The Philadelphia Eagles have reportedly made a decision on whether or not they will visit the White House following their Super Bowl win earlier this month",
    "link": "https://www.newsbreak.com/share/3826206290260-philadelphia-eagles-reportedly-make-final-decision-on-white-house-visit-following-super-bowl-59-win?_f=app_share&pd=05axlBno&lang=en_US&send_time=1740352357&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_rank_exp_25q1-v7&s=i2",
    "timestamp": "2025-02-23T23:13:03Z"
  },
  {
    "title": "Letters to the Editor, February 24, 2025: Obscene comparison",
    "description": "Readers of The Jerusalem Post have their say.",
    "link": "https://www.jpost.com/opinion/article-843422",
    "timestamp": "2025-02-23T23:06:19Z"
  },
  {
    "title": "‘A moral travesty’ Hundreds rally in Penn Square Sunday in support of Church World Service",
    "description": "Less than a month after the Trump administration cut funding to nonprofits that help refugees and immigrants, over 200 Lancaster residents gathered in Penn Square on Sunday to support the more than 60 Church World Service employees who were furloughed…",
    "link": "https://lancasteronline.com/news/local/a-moral-travesty-hundreds-rally-in-penn-square-sunday-in-support-of-church-world-service/article_781c9a30-f23a-11ef-9604-3b23d5224cf5.html",
    "timestamp": "2025-02-23T23:04:00Z"
  },
  {
    "title": "How Paychecks Would Look in Each State If Trump Dropped Federal Income Tax",
    "description": "While campaigning for the presidency, Donald Trump suggested abolishing the United States income tax in favor of an \"all tariff policy.\" Despite the fact...",
    "link": "https://finance.yahoo.com/news/paychecks-look-state-trump-dropped-160033371.html",
    "timestamp": "2025-02-23T23:02:04Z"
  },
  {
    "title": "US B-52 Bombers Fly Over Nine Countries in the Middle East",
    "description": "This flyover is meant as a show of force against Iran, the CENTCOM chief said The US conducted a major flyover of bombers and fighter jets over nine countries across the Middle East, in a show of force against Iran and its allies. The Central Command (CENTCOM…",
    "link": "https://www.activistpost.com/us-b-52-bombers-fly-over-nine-countries-in-the-middle-east/",
    "timestamp": "2025-02-23T23:00:00Z"
  },
  {
    "title": "Donald Trump Fires 1,600 USAID Employees, Others On Paid Leave",
    "description": "All USAID direct hire personnel except workers essential for critical functions, have been placed on leave.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-fires-1-600-usaid-employees-others-on-paid-leave-7779620",
    "timestamp": "2025-02-23T22:58:39Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development",
    "link": "https://www.newsbreak.com/share/3826251146028-the-trump-administration-is-firing-2-000-usaid-workers-and-putting-thousands-of-others-on-leave?s=a2&share_destination_id=MjU3NzY2Mzk4LTE3NDAzNTE0MzQ4MjU%3D&pd=0HRYoY4Z&hl=en_US&send_time=1740351434&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v3%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v8",
    "timestamp": "2025-02-23T22:58:05Z"
  },
  {
    "title": "Trump’s Late-Night Social Media Endorsement Could Upend Florida’s Fragile Peace With Disney World",
    "description": "The fragile peace between The Walt Disney Company and Florida Governor Ron DeSantis has lasted for months. The two sides decided to put down their dueling lawsuits. Disney agreed to invest billions in its Central Florida property, bringing thousands of jobs a…",
    "link": "https://insidethemagic.net/2025/02/trump-endorses-byron-donalds-for-florida-governor-disney-prospects-rl1/",
    "timestamp": "2025-02-23T22:57:55Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development",
    "link": "https://www.newsbreak.com/share/3826251146028-the-trump-administration-is-firing-2-000-usaid-workers-and-putting-thousands-of-others-on-leave?_f=app_share&pd=04YuWvKH&lang=en_US&send_time=1740351265&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-v1%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v1&s=i2",
    "timestamp": "2025-02-23T22:55:44Z"
  },
  {
    "title": "Trump Purge of ‘Virtually the Entire USAID Workforce’ to Begin Sunday Night After Clearing Legal Challenge",
    "description": "The Trump administration will fire 2,000 United States Agency for International Development employees and place thousands more on leave Sunday after a judge ruled President Donald Trump has the authority to make cuts at the agency. According to CNN’s Kevin Li…",
    "link": "https://www.mediaite.com/tv/trump-purge-of-virtually-the-entire-usaid-workforce-to-begin-sunday-night-after-clearing-legal-challenge/",
    "timestamp": "2025-02-23T22:54:28Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development",
    "link": "https://www.newsbreak.com/share/3826251146028-the-trump-administration-is-firing-2-000-usaid-workers-and-putting-thousands-of-others-on-leave?_f=app_share&pd=07CPyGp2&lang=en_US&send_time=1740350914&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.41.0.37%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v3%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v1&s=i2",
    "timestamp": "2025-02-23T22:50:40Z"
  },
  {
    "title": "More Artists and Celebrities Canceling Shows at Kennedy Center to Protest Trump",
    "description": "More artists and performers are canceling their shows at D.C.'s John F. Kennedy Center for the Performing Arts in protest over President Donald Trump, a report claims.\nThe post More Artists and Celebrities Canceling Shows at Kennedy Center to Protest Trump ap…",
    "link": "https://www.breitbart.com/entertainment/2025/02/23/more-artists-and-celebrities-canceling-shows-at-kennedy-center-to-protest-trump/",
    "timestamp": "2025-02-23T22:50:18Z"
  },
  {
    "title": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave",
    "description": "The Trump administration said that it is eliminating 2,000 positions at the U.S. Agency for International Development (USAID) and placing all but a fraction of other staffers worldwide on leave.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-firing-2000-usaid-workers-putting-thousands-leave-rcna193387",
    "timestamp": "2025-02-23T22:49:37Z"
  },
  {
    "title": "Hundreds gather in Halifax to mark 3-year anniversary of Russia's invasion of Ukraine",
    "description": "Hundreds of people gathered at Halifax’s Grand Parade on Sunday to mark the three year anniversary of Russia’s invasion of Ukraine.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/hundreds-gather-in-halifax-to-mark-3-year-anniversary-of-russia-s-invasion-of-ukraine-1.7466455",
    "timestamp": "2025-02-23T22:47:54Z"
  },
  {
    "title": "Trump Celebrates Conservative Party Win in Germany and Promises 'Many More Victories to Follow!'",
    "description": "President Donald Trump took to social media to celebrate the victory grasped by Germany's conservative opposition in the recent federal election.",
    "link": "https://www.ibtimes.com/trump-celebrates-conservative-party-win-germany-promises-many-more-victories-follow-3764765",
    "timestamp": "2025-02-23T22:45:27Z"
  },
  {
    "title": "Asian Equities to Fall After Wall Street Slump: Markets Wrap",
    "description": "Stocks in Asia were primed to fall after Wall Street notched up its worst session of the year on lacklustre US economic data. The euro strengthened following an election in Germany.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-equities-to-fall-after-wall-street-slump-markets-wrap",
    "timestamp": "2025-02-23T22:45:21Z"
  },
  {
    "title": "'Abandoned Ukraine': Fox News Host Confronts Pete Hegseth Over Putin 'Victory Lap'",
    "description": "Fox News host Shannon Bream confronted U.S. Defense Secretary Pete Hegseth after Russian President Vladimir Putin planned to take a \"victory lap\" because the Kremlin believes President Donald Trump \"abandoned Ukraine.\"\n\n\nDuring an interview on Fox News Sunday…",
    "link": "https://crooksandliars.com/2025/02/abandoned-ukraine-fox-news-host-confronts",
    "timestamp": "2025-02-23T22:45:00Z"
  },
  {
    "title": "Trump fires 2,000 USAID workers",
    "description": "The Trump administration said Sunday that it is eliminating 2,000 positions at the U.S. Agency for International Development and placing all but a fraction of other staffers worldwide on leave.",
    "link": "https://www.bostonherald.com/2025/02/23/trump-fires-2000-usaid-workers/",
    "timestamp": "2025-02-23T22:44:14Z"
  },
  {
    "title": "'Lies and distortions': New York Times offers unusually blunt assessment of Trump tactics",
    "description": "Some liberal critics of the New York Times in the past have accused the paper of \"sane-washing\" President Donald Trump by using euphemisms that downplay Trump's routine dishonesty and seeming detachment from reality.However, a piece written by the New York Ti…",
    "link": "https://www.rawstory.com/trump-lies-2671203352/",
    "timestamp": "2025-02-23T22:42:02Z"
  },
  {
    "title": "James Carville Makes Bold Prediction About When Trump’s White House Will ‘Collapse’",
    "description": "James Carville predicted that President Donald Trump’s White House team will “collapse” in less than a month. The famed Democratic Party strategist claimed...",
    "link": "https://www.thedailybeast.com/james-carville-makes-bold-prediction-about-when-trumps-white-house-will-collapse/",
    "timestamp": "2025-02-23T22:37:52Z"
  },
  {
    "title": "Mother Charged With Murder Over Baby's Fentanyl Overdose Death",
    "description": "A 23-year-old mother has been charged with second-degree murder over her child's fentanyl-related death that happened last year.",
    "link": "https://www.newsweek.com/mother-charged-murder-over-babys-fentanyl-overdose-death-2035036",
    "timestamp": "2025-02-23T22:34:04Z"
  },
  {
    "title": "Key federal agencies refuse to comply with Musk's latest demand in his cost-cutting crusade",
    "description": "Key federal agencies have instructed their employees not to comply with Elon Musk’s latest demand that they explain what they accomplished last week or risk losing their job.",
    "link": "https://roanoke.com/news/nation-world/government-politics/doge-elon-musk-president-donald-trump-federal-workforce-job-cuts-cost-cutting/article_7ea8184c-007b-59f5-9d9d-771cd6bbb977.html",
    "timestamp": "2025-02-23T22:30:00Z"
  },
  {
    "title": "Key federal agencies refuse to comply with Musk's latest demand in his cost-cutting crusade",
    "description": "Key federal agencies have instructed their employees not to comply with Elon Musk’s latest demand that they explain what they accomplished last week or risk losing their job.",
    "link": "https://richmond.com/news/nation-world/government-politics/doge-elon-musk-president-donald-trump-federal-workforce-job-cuts-cost-cutting/article_4469bc71-1d82-5d3d-bb63-17264462fdb4.html",
    "timestamp": "2025-02-23T22:30:00Z"
  },
  {
    "title": "CDC layoffs strike deeply at its ability to respond to health emergencies - NewsBreak",
    "description": "In just a few short weeks, the Trump administration has brought drastic changes to the Centers for Disease Control and Prevention and public health. Beginn",
    "link": "https://www.newsbreak.com/share/3825781650218-cdc-layoffs-strike-deeply-at-its-ability-to-respond-to-health-emergencies?s=a2&amp;share_destination_id=MjA3OTQ4Mzk1LTE3NDAzNDk3NDY4MTY%3D&amp;pd=0E4WsNAN&amp;hl=en_US&amp;send_time=1740349746&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v3",
    "timestamp": "2025-02-23T22:29:37Z"
  },
  {
    "title": "Germany’s Merz seeks ‘independence’ from Trump’s America, warning NATO may soon be dead",
    "description": "Election winner likens the Trump administration to Putin's Russia as he bids to take Europe in a new direction.",
    "link": "https://www.politico.eu/article/friedrich-merz-germany-election-united-states-donald-trump-nato/",
    "timestamp": "2025-02-23T22:28:51Z"
  },
  {
    "title": "Most USAID workers placed on leave, Trump administration says",
    "description": "Some 2,000 employees will also be laid-off in a \"reduction in force\" effort, according to an email sent to staff.",
    "link": "https://www.bbc.com/news/articles/cr42r2gw5wzo",
    "timestamp": "2025-02-23T22:24:54Z"
  },
  {
    "title": "You’re fired! Network cancels Trump-hating, prime-time anchor",
    "description": "'I can't tell you how many slow news days she helped me through. I hope she finds somewhere else to spout her inane bullsh**'",
    "link": "https://www.wnd.com/2025/02/youre-fired-network-cancels-trump-hating-prime-time-anchor/",
    "timestamp": "2025-02-23T22:23:17Z"
  },
  {
    "title": "Joy Reid departs MSNBC as network overhauls its weekday lineup",
    "description": "Joy Reid is set to depart MSNBC as the network overhauls its programming. The final episode of 'The ReidOut' will air this week.",
    "link": "https://ew.com/joy-reid-departs-msnbc-as-network-overhauls-its-weekday-lineup-11684805",
    "timestamp": "2025-02-23T22:22:06Z"
  },
  {
    "title": "Sec Def Pete Hegseth Talks with Shannon Bream on “Fox News Sunday” – “The President Deserves to Pick His Key National Security and Military Advisory Team”(VIDEO)",
    "description": "In an exclusive interview, Secretary of Defense Pete Hegseth reveals significant changes at the Pentagon, including a notable reshuffling of top military leadership. Tune in for insights on this pivotal moment.\nThe post Sec Def Pete Hegseth Talks with Shannon…",
    "link": "https://www.thegatewaypundit.com/2025/02/sec-def-pete-hegseth-talks-shannon-bream-fox/",
    "timestamp": "2025-02-23T22:20:58Z"
  },
  {
    "title": "James Carville predicts Trump, GOP are in ‘midst of a collapse’ — and gives them 4 to 6 weeks to fully implode",
    "description": "\"What I have said very publicly is that Democrats need to play possum. This whole thing is collapsing,\" Carville said.",
    "link": "https://nypost.com/2025/02/23/us-news/james-carville-predicts-trump-republicans-are-in-the-midst-of-a-collapse/",
    "timestamp": "2025-02-23T22:20:48Z"
  },
  {
    "title": "Labor crashes to a 55–45 deficit in Resolve despite interest rate cut",
    "description": "In a blow to the Albanese government, the latest polling has the two-party preferred gap widening, and Labor headed for defeat.",
    "link": "https://theconversation.com/labor-crashes-to-a-55-45-deficit-in-resolve-despite-interest-rate-cut-250150",
    "timestamp": "2025-02-23T22:20:20Z"
  },
  {
    "title": "Stephen A. Smith Leads Kamala Harris, Michelle Obama in Betting Odds for 2028 Democrat Nomination",
    "description": "Even though President Donald Trump’s presidency is only a month old, there is already speculation about who could possibly take the reins of the sinking Democratic Party for the 2028 election, and one seemingly unlikely name has just zoomed up to fourth place…",
    "link": "https://freerepublic.com/focus/f-news/4299923/posts",
    "timestamp": "2025-02-23T22:16:09Z"
  },
  {
    "title": "‘A Total FAKE JOB!’ Trump Rages Against Author Michael Wolff, Claims His New Book is ‘Obviously Fictitious’",
    "description": "President Donald Trump lashed out at author Michael Wolff for his new book All Or Nothing: How Trump Recaptured America for being \"obviously fictitious.\"\nThe post ‘A Total FAKE JOB!’ Trump Rages Against Author Michael Wolff, Claims His New Book is ‘Obviously …",
    "link": "https://www.mediaite.com/trump/a-total-fake-job-trump-rages-against-author-michael-wolff-claims-his-new-book-is-obviously-fictitious/",
    "timestamp": "2025-02-23T22:14:37Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Federal employees receive emails asking them to justify their work. Zelenskyy is willing to resign for peace. And Ohio police feud with a Catholic hospital.",
    "link": "https://www.nbcnews.com/news/weekend-rundown-feb-23-rcna193278",
    "timestamp": "2025-02-23T22:12:33Z"
  },
  {
    "title": "Kamala Harris Fearmongers at NAACP Image Awards: 'Shadows Gathering over Our Democracy'",
    "description": "Former Vice President Kamala Harris fearmongered to audience members on Saturday during her acceptance speech after receiving the Chairman's Award at the 56th NAACP Image Awards, where she claimed there are \"flames on our horizons, rising waters in our cities…",
    "link": "https://www.breitbart.com/politics/2025/02/23/kamala-harris-fearmongers-at-naacp-image-awards-shadows-gathering-over-our-democracy/",
    "timestamp": "2025-02-23T22:05:41Z"
  }
]