[
  {
    "title": "Trump Endorses Japan's Takaichi in Upcoming Snap Election",
    "description": "Conservative Japanese Prime Minister Takaichi Sanae has received President Donald Trump's full endorsement ahead of Sunday's snap election in the Asian country.\nThe post Trump Endorses Japan’s Takaichi in Upcoming Snap Election appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2026/02/06/trump-endorses-japans-takaichi-in-upcoming-snap-election/",
    "timestamp": "2026-02-06T11:06:43Z"
  },
  {
    "title": "Trump Announces Dramatic Drop in Ozempic Price",
    "description": "(DCNF)—President Donald Trump announced Thursday that the price of Ozempic will fall from more than $1,000 to $199, a dramatic reduction for one of the most expensive and widely used prescription drugs in the country. Pharmacy “cash price” for a single Ozempi…",
    "link": "https://freerepublic.com/focus/f-chat/4365651/posts",
    "timestamp": "2026-02-06T11:02:06Z"
  },
  {
    "title": "Epstein tracked #MeToo fallout and advised accused men behind the scenes",
    "description": "New files show Jeffrey Epstein joking about being in a \"pariahs club.\"",
    "link": "https://www.salon.com/2026/02/06/epstein-tracked-metoo-fallout-and-advised-accused-men-behind-the-scenes-partner/",
    "timestamp": "2026-02-06T11:00:31Z"
  },
  {
    "title": "6 Big Questions for Pam Bondi on Epstein and ICE",
    "description": "Attorney General Pam Bondi has been very quiet lately, but next week Congress will have a chance to grill her. Here are six big questions she needs to answer about Jeffrey Epstein, ICE, and more.",
    "link": "http://nymag.com/intelligencer/article/pam-bondi-6-big-questions-jeffrey-epstein-ice-alex-pretti-house-judiciary.html",
    "timestamp": "2026-02-06T11:00:27Z"
  },
  {
    "title": "Jack Mintz: Trade policy uncertainty is bad for investment and jobs",
    "description": "Disdain for Trump is fine but Canada has a simple choice: let CUSMA die or make a trade deal with him that includes some tariffs. Read on",
    "link": "https://financialpost.com/opinion/jack-mintz-trade-policy-uncertainty-bad-for-investment",
    "timestamp": "2026-02-06T11:00:17Z"
  },
  {
    "title": "Revisiting Super Bowl 49: Inside infamous Patriots vs. Seahawks matchup, from Malcolm Butler INT to Marshawn Lynch's dominance",
    "description": "Before meeting in Super Bowl 60, the Patriots and Seahawks played a classic in Super Bowl 49.",
    "link": "https://www.sportingnews.com/us/nfl/news/super-bowl-49-patriots-seahawks-malcolm-butler/4bb30968bb92366884ddbdad",
    "timestamp": "2026-02-06T11:00:02Z"
  },
  {
    "title": "Does 'Melania' movie director Brett Ratner appear in Epstein files? What we know",
    "description": "Ratner reportedly told U.K. and U.S. media a photograph showed him, his former fiancée and Epstein.",
    "link": "https://www.snopes.com//news/2026/02/06/brett-ratner-photo-epstein/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "Public Health Workers Are Quitting Over Assignments to Guantánamo",
    "description": "Doctors, nurses, and other officers are increasingly being deployed to ICE detention centers. Some have resigned in protest, while others offer a rare look into bleak conditions.",
    "link": "https://www.wired.com/story/public-health-workers-are-quitting-over-assignments-to-guantanamo/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "How Autocrats Meddle With Elections",
    "description": "The Trump administration has its eyes on the midterms and beyond.",
    "link": "https://www.theatlantic.com/podcasts/2026/02/how-autocrats-meddle-with-elections/685383/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "Win Bigly",
    "description": "The latest episode of Trial Balloon is live for members. What should Democrats do if Donald Trump interferes with the midterm elections? Join now to continue reading. Members get exclusive analysis, bonus features and no advertising. Learn more. If you’re alr…",
    "link": "https://politicalwire.com/2026/02/06/win-bigly-2/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "“Terrorist”: How ICE Weaponized 9/11’s Scarlet Letter",
    "description": "Spencer Ackerman on how the politics of counterterrorism led to ICE and CBP completing their transformation into a death squad — and why the agencies are unreformable.\nThe post “Terrorist”: How ICE Weaponized 9/11’s Scarlet Letter appeared first on The Interc…",
    "link": "https://theintercept.com/2026/02/06/spencer-ackerman-9-11-terrorists-ice/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Nicole Kidman Warned to Shut Down Keith Urban's 'Desperate' Bid to Woo Her Back",
    "description": "Nicole Kidman has been warned to shut down Keith Urban's 'desperate' bid to win her back.",
    "link": "https://radaronline.com/p/nicole-kidman-warned-stop-keith-urban-desperate-win-her-back-bid/",
    "timestamp": "2026-02-06T11:00:00Z"
  },
  {
    "title": "These Are the Democrat ICE Reform Demands the GOP Calls 'Impossible'",
    "description": "Democrats demand that ICE agents behave as if they might ever have to face consequences for breaking the law. Republicans say \"impossible.\"",
    "link": "https://www.jezebel.com/ice-reform-demands-democrats-congress-gop-john-thune-trump-face-masks-id-body-cameras",
    "timestamp": "2026-02-06T10:59:21Z"
  },
  {
    "title": "CNN's Harry Enten predicts MAGA will \"OUTLAST DONALD TRUMP",
    "description": "\"MAGA is as POWERFUL as it has ever been! ... What he brought into the GOP looks like it's going to last long beyond him.\"\"The Republican base LOVES JD Vance.\"",
    "link": "https://freerepublic.com/focus/f-bloggers/4365650/posts",
    "timestamp": "2026-02-06T10:56:37Z"
  },
  {
    "title": "Hegseth says US strikes force some cartel leaders to halt drug operations",
    "description": "War Secretary Pete Hegseth declared that some cartel drug traffickers have chosen to stop their narcotics activities because of America's attacks in the Caribbean.",
    "link": "https://www.foxnews.com/politics/hegseth-cartel-operations-halt-us-strikes",
    "timestamp": "2026-02-06T10:52:47Z"
  },
  {
    "title": "US calls for new multilateral arms control agreement following expiry of nuclear treaty",
    "description": "GENEVA: The United States on Friday (Feb 6) called for a new arms control agreement after the treaty that set caps on Russian and US strategic nuclear weapons deployments expired on Thursday.Russia had suggested both sides voluntarily extend the terms of the …",
    "link": "https://www.channelnewsasia.com/world/us-new-arms-control-agreement-start-expires-russia-china-nuclear-5912596",
    "timestamp": "2026-02-06T10:51:00Z"
  },
  {
    "title": "US EV slowdown drives $55 billion hit for carmakers",
    "description": "In a turbulent turn of events, major global car manufacturers are grappling with heavy financial losses. Brands like Stellantis, Ford, General Motors, and Volkswagen are reporting billion-dollar writedowns as they reassess their electric vehicle strategies. T…",
    "link": "https://economictimes.indiatimes.com/industry/auto/cars-uvs/us-ev-slowdown-drives-55-billion-hit-for-carmakers/articleshow/127985220.cms",
    "timestamp": "2026-02-06T10:49:16Z"
  },
  {
    "title": "Canada and France opening consulates in Greenland following tensions over US push for control",
    "description": "Canada and France are opening diplomatic consulates in the capital of Greenland",
    "link": "https://abcnews.go.com/International/wireStory/canada-france-opening-consulates-greenland-tensions-us-push-129909670",
    "timestamp": "2026-02-06T10:45:34Z"
  },
  {
    "title": "Brussels’ dependency dilemma: The EU is a victim of its own energy arrogance",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632093-brussels-dependency-energy-russia/",
    "timestamp": "2026-02-06T10:41:44Z"
  },
  {
    "title": "The One Thing Donald Trump (Maybe) Can’t Ruin This Winter",
    "description": "The one thing Donald Trump (maybe) can’t ruin this winter.",
    "link": "https://slate.com/culture/2026/02/2026-winter-olympics-hey-it-could-be-worse.html",
    "timestamp": "2026-02-06T10:40:00Z"
  },
  {
    "title": "What does Iran want from talks with the US?",
    "description": "Tehran (AFP) Feb 5, 2026\n\n\n Iran and the United States are holding talks on Friday in Oman, with Tehran pushing to focus squarely on its nuclear programme, while Washington's demands go beyond that. \n\nThe two foes had held several rounds of Oman-mediated nucl…",
    "link": "https://www.spacewar.com/reports/What_does_Iran_want_from_talks_with_the_US_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Russia, US agree to resume military contacts at Ukraine talks",
    "description": "Abu Dhabi (AFP) Feb 5, 2026\n\n\n Russia and the United States agreed to resume high-level military contacts, in a major step of rapprochement between the world's top nuclear powers at Ukraine talks in Abu Dhabi on Thursday. \n\nMoscow and Washington suspended sen…",
    "link": "https://www.spacewar.com/reports/Russia_US_agree_to_resume_military_contacts_at_Ukraine_talks_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Why did Xi hold back-to-back calls with Putin, Trump?",
    "description": "Beijing (AFP) Feb 5, 2026\n\n\n China's leader Xi Jinping held back-to-back calls with Russia's Vladimir Putin and US President Donald Trump this week, timing analysts said on Thursday was rare and significant as Beijing positions itself as a stable global power…",
    "link": "https://www.spacewar.com/reports/Why_did_Xi_hold_back-to-back_calls_with_Putin_Trump_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Trump urges new nuclear treaty after Russia agreement ends",
    "description": "Washington, United States (AFP) Feb 6, 2026\n\n US President Donald Trump on Thursday called for a brand new nuclear treaty after the last agreement with Russia expired, prompting fears of a new global arms race. \n\nThe Trump administration has repeatedly presse…",
    "link": "https://www.spacewar.com/reports/Trump_urges_new_nuclear_treaty_after_Russia_agreement_ends_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "New START nuclear treaty 'was flawed': senior US official",
    "description": "Geneva (AFP) Feb 6, 2026\n\n\n A senior US official on Friday criticised the last nuclear treaty between Russia and the United States for failing to include Beijing, speaking at the United Nations a day after the New START deal expired. \n\n\"In a nutshell, New STA…",
    "link": "https://www.spacewar.com/reports/New_START_nuclear_treaty_was_flawed_senior_US_official_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Iran, US hold talks in Oman after deadly protest crackdown",
    "description": "Muscat, Oman (AFP) Feb 6, 2026\n\n\n Iran and the United States began talks on Friday in Oman, with Washington refusing to rule out military action against the Islamic republic over its deadly crackdown on mass protests. \n\nIran has insisted the Oman-mediated tal…",
    "link": "https://www.spacewar.com/reports/Iran_US_hold_talks_in_Oman_after_deadly_protest_crackdown_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "China shuns calls to enter nuclear talks after US-Russia treaty lapses",
    "description": "Beijing (AFP) Feb 5, 2026\n\n\n China rejected calls to enter talks on a new nuclear treaty after a US-Russian agreement expired on Thursday, ending decades of restrictions on how many warheads the two powers can deploy. \n\nCampaigners have warned that the expiry…",
    "link": "https://www.spacewar.com/reports/China_shuns_calls_to_enter_nuclear_talks_after_US-Russia_treaty_lapses_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Iran, US prepare for Oman talks after deadly protest crackdown",
    "description": "Muscat, Oman (AFP) Feb 6, 2026\n\n\n Iran and the United States were preparing for talks on Friday in Oman, with Washington looking to see if there was any prospect of diplomatic progress on the Iranian nuclear programme and other issues while refusing to rule o…",
    "link": "https://www.spacewar.com/reports/Iran_US_prepare_for_Oman_talks_after_deadly_protest_crackdown_999.html",
    "timestamp": "2026-02-06T10:39:07Z"
  },
  {
    "title": "Why is bitcoin price today touching $60,000 level and will BTC USD rise now or fall back? Bitcoin fall, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Bitcoin price today touched the $60,000 level after a global crypto sell-off. Investors are watching whether BTC USD will rise or fall further. Bitcoin has lost 26% this year, while ether also declined. Analysts link moves to tech stocks, gold, and market vol…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-bitcoin-price-today-touching-60000-level-and-will-btc-usd-rise-now-or-fall-back-bitcoin-fall-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now-cryptocurrency-market/articleshow/127984218.cms",
    "timestamp": "2026-02-06T10:35:23Z"
  },
  {
    "title": "Kaitlan Collins Addresses Trump's ‘Smile' Attack On Her With A Powerful Point",
    "description": "The CNN anchor responded to the president's slamming of her during a recent press briefing.",
    "link": "https://www.huffpost.com/entry/kaitlan-collins-donald-trump-smile-attack_n_6985b8b3e4b0fa2b1703164d",
    "timestamp": "2026-02-06T10:31:35Z"
  },
  {
    "title": "Just how ‘excellent’ was Trump and Xi Jinping’s phone call, really?",
    "description": "US president raved about his 'extremely good' personal relationship with the Chinese leader, but Xi was more muted.",
    "link": "https://www.aljazeera.com/news/2026/2/6/just-how-excellent-was-trump-and-xi-jinpings-phone-call-really",
    "timestamp": "2026-02-06T10:30:16Z"
  },
  {
    "title": "Trump just proved this powerful group are a bunch of dangerous hypocrites. They don't care",
    "description": "Yesterday I watched, horrified and spellbound — which is becoming a regular thing — as an event purportedly built on prayer, humility, and the teachings of Jesus Christ dissolved into a Trump rally, complete with guffaws, applause, and a bizarre reverence for…",
    "link": "https://www.rawstory.com/raw-investigates/president-trump-speaks-at-national-prayer-breakfast/",
    "timestamp": "2026-02-06T10:30:02Z"
  },
  {
    "title": "Trump May Choose Military Option on Iran If Diplomacy Fails - Vance",
    "description": "US Vice President JD Vance said President Donald Trump will \"keep his options open\" on Iran, pursue \"non-military means\" first, and could ultimately use force.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260205-sputnik01.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "Russia's UN envoy rejects military option against Iran, calls for diplomacy",
    "description": "Russia's United Nations ambassador has strongly rejected any military options against Iran, warning such actions could destabilize the entire region, while stressing Moscow's readiness to support diplomacy without imposing itself as a mediator.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260205-presstv04.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "China expresses regret over expiration of New START Treaty between Russia and the US: FM spokesperson",
    "description": "China expresses regret that the New START Treaty between Russia and the US has expired, which has had great significance for maintaining global strategic stability, the Chinese Foreign Ministry spokesperson Lin Jian said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/02/china-260205-globaltimes03.htm",
    "timestamp": "2026-02-06T10:29:20Z"
  },
  {
    "title": "Russia, Ukraine hold talks after 'productive' opening session",
    "description": "Russian and Ukrainian negotiators returned to the table for a second day of peace talks following what both sides described as a \"productive\" opening session.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260205-presstv01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "No shift in alliance as US focuses on Western Hemisphere - PH envoy",
    "description": "There is no expected major change in the deep defense partnership between the Philippines and the United States as the latter increases focus on the Western Hemisphere, said Philippine Ambassador to the US Jose Manuel Romualdez.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260205-pna01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Ukraine, Russia 'Likely' To Continue Peace Talks In US, Zelenskyy Says As POW Exchange Completed",
    "description": "Ukrainian President Volodymyr Zelenskyy said the next round of US-brokered peace talks with Russia is \"likely\" to take place in the United States as officials from both countries wrapped up a second day of renewed negotiations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260205-rferl01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "New START Expires, Russia Assesses It Negatively - Kremlin",
    "description": "The New START (New Strategic Arms Reduction Treaty) expires, Russia assesses this negatively and expresses regret in this regard, Kremlin spokesman Dmitry Peskov said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2026/02/russia-260205-sputnik02.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Diplomatic Showdown Between US And Iran Set For Oman",
    "description": "Iranian and US officials are set to meet in Oman on February 6 for a round of high-stakes diplomacy seen as a last-chance effort to avert a major military escalation in the Persian Gulf.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260206-rferl01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Trump invites PH to join 'Board of Peace' -envoy",
    "description": "United States President Donald Trump has invited the Philippines to join the Board of Peace (BOP), a US-initiated multinational body aimed at advancing post-conflict solutions, specifically the Gaza reconstruction.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260205-pna02.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "New START's end raises alarm over return of US-Russia nuclear rivalry",
    "description": "The impending expiration of the New START, the last remaining nuclear arms control treaty between the United States and Russia, has heightened fears that decades of fragile restraint are giving way to a more dangerous, unregulated nuclear era.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2026/02/russia-260205-presstv01.htm",
    "timestamp": "2026-02-06T10:28:36Z"
  },
  {
    "title": "Trump Is Destroying the Far-Right Brand",
    "description": "With its unparalleled global visibility, the United States offers an unavoidable case study of radical right-wing governance in action. Just as Brexit ultimately strengthened support for the European Union, MAGA-era America may serve as a cautionary example, …",
    "link": "https://www.project-syndicate.org/commentary/trump-authoritarianism-will-make-liberal-democracy-look-better-harm-far-right-by-maciej-kisilowski-and-anna-wojciuk-2026-02",
    "timestamp": "2026-02-06T10:26:43Z"
  },
  {
    "title": "Donald Trump’s Truth Social Account Shares Apparent AI Video Of Obamas As Apes",
    "description": "An apparently AI-generated clip portraying Barack and Michelle Obama as apes has been shared on Donald Trump’s Truth Social account. Overnight, the U.S. president’s verified account twice posted a minute-long video about voting machine anomolies, which featur…",
    "link": "http://deadline.com/2026/02/donald-trump-truth-social-ai-video-obamas-apes-1236710978/",
    "timestamp": "2026-02-06T10:25:58Z"
  },
  {
    "title": "Crypto Advocates Round on Democrats’ ‘Crypto Crash’ Message",
    "description": "Industry leaders condemned a Democratic Party social media post mocking crypto market losses amid billions of dollars in liquidations.",
    "link": "https://decrypt.co/357163/crypto-advocates-round-on-democrats-crypto-crash-message",
    "timestamp": "2026-02-06T10:18:15Z"
  },
  {
    "title": "Davos chief probed over alleged Epstein ties – media",
    "description": "WEF CEO Borge Brende reportedly requested the probe himself over his Epstein ties after revelations of business dinners, emails, and texts Read Full Article at RT.com",
    "link": "https://www.rt.com/business/632088-davos-ceo-probed-epstein-ties/",
    "timestamp": "2026-02-06T10:17:35Z"
  },
  {
    "title": "Oman confirms it mediated indirect US-Iran nuclear talks",
    "description": "Oman announced it mediated indirect talks between Iran and the United States concerning Iran's nuclear program. Foreign Minister Badr al-Busaidi met separately with Iranian and American officials. The consultations aimed to prepare for diplomatic and technica…",
    "link": "https://economictimes.indiatimes.com/news/defence/oman-confirms-it-mediated-indirect-us-iran-nuclear-talks/articleshow/127983916.cms",
    "timestamp": "2026-02-06T10:17:21Z"
  },
  {
    "title": "Donald Trump just shared racist monkey video of Barack and Michelle Obama",
    "description": "Donald Trump shared a clip depicting Barack and Michelle Obama as monkeys",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-racist-video-barack-michelle-obama-monkeys-710797-20260206",
    "timestamp": "2026-02-06T10:15:37Z"
  },
  {
    "title": "UN Security Council to exempt sanctions on humanitarian aid for North Korea, source says",
    "description": "By Heejin KimSEOUL, Feb 6 (Reuters) - A United Nations committee has approved exemptions from wide-reaching sanctions against North Korea to allow fresh humanitarian aid … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/06/un-security-council-to-exempt-sanctions-on-humanitarian-aid-for-north-korea-source-says",
    "timestamp": "2026-02-06T10:10:25Z"
  },
  {
    "title": "Brazil signals new openness to Mercosur-China talks as Beijing seeks deeper ties",
    "description": "BRASILIA/MONTEVIDEO, Feb 6 (Reuters) - Brazil is considering pushing for a partial trade agreement between the Mercosur bloc and China for the first time, senior Brazilia… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/06/brazil-signals-new-openness-to-mercosur-china-talks-as-beijing-seeks-deeper-ties",
    "timestamp": "2026-02-06T10:08:08Z"
  },
  {
    "title": "Politics affects Floridians’ plans for Super Bowl halftime",
    "description": "A poll from the University of North Florida finds the state’s Democrats and Republicans are deeply divided over whether they’ll watch the Super Bowl halftime show featuring Bad Bunny.",
    "link": "https://www.sun-sentinel.com/2026/02/06/most-florida-republicans-wont-watch-bad-bunny-halftime-show-at-super-bowl-poll-finds/",
    "timestamp": "2026-02-06T10:07:52Z"
  },
  {
    "title": "Donald Trump just shared a video depicting Barack and Michelle Obama as monkeys",
    "description": "Donald Trump just shared a video depicting Barack and Michelle Obama as monkeyspennlive.com",
    "link": "https://www.pennlive.com/nation-world/2026/02/donald-trump-just-shared-a-video-depicting-barack-and-michelle-obama-as-monkeys.html",
    "timestamp": "2026-02-06T10:07:09Z"
  },
  {
    "title": "Two killed in US strike on 'narco-terrorists'",
    "description": "The US military has conducted at least 36 attacks on boats allegedly transporting drugs since September in the Caribbean Sea and eastern Pacific Ocean.",
    "link": "https://news.sky.com/story/two-killed-in-us-strike-on-narco-terrorists-as-forces-attack-alleged-drug-boat-13503995",
    "timestamp": "2026-02-06T10:04:00Z"
  },
  {
    "title": "'Everybody is rooting for you': VP Vance leads US Olympics delegation.",
    "description": "Vice President JD Vance, as head of the US delegation to the 2026 Winter Olympics in Italy, tells athletes 'everybody is rooting for you guys.'",
    "link": "https://www.usatoday.com/story/news/politics/2026/02/06/jd-vance-us-delegation-olympics/88528444007/",
    "timestamp": "2026-02-06T10:03:30Z"
  },
  {
    "title": "Minnesota green energy program funded by Obama fined for killing bald eagle: ‘National treasure’",
    "description": "The University of Minnesota is facing a penalty of over $14,000 after it was discovered that a green energy initiative funded by was responsible for the gruesome death of a bald eagle.",
    "link": "https://www.foxnews.com/politics/minnesota-green-energy-program-funded-obama-fined-killing-bald-eagle-national-treasure",
    "timestamp": "2026-02-06T10:00:46Z"
  },
  {
    "title": "How the Epstein Files Turned Everyone Into Conspiracists",
    "description": "The Epstein Files show that we really are governed by an overclass of degenerate elites. And now anyone can investigate them.",
    "link": "http://nymag.com/intelligencer/article/how-the-epstein-files-turned-everyone-into-conspiracists.html",
    "timestamp": "2026-02-06T10:00:43Z"
  },
  {
    "title": "Architects' designs for Donald J Trump Airport",
    "description": "In the latest episode of Dezeen Weekly we ask: does Donald Trump approve of modernist buildings if they have his name on them? And are we living through an era of \"gentleism\"? In this week's podcast, we discuss architects' proposals for an overhaul of Eero Sa…",
    "link": "https://www.dezeen.com/2026/02/06/washington-airport-niall-mclaughlin-brexit-dezeen-weekly-podcast/",
    "timestamp": "2026-02-06T10:00:24Z"
  },
  {
    "title": "How Worried Should Democrats Be About Trump Stealing the Next Election?",
    "description": "Be vigilant, be imaginative, but also remember that everything Trump is doing to impose restrictive voting measures is backfiring on Republicans, just like his previous efforts. \nThe post How Worried Should Democrats Be About Trump Stealing the Next Election?…",
    "link": "http://washingtonmonthly.com/2026/02/06/trump-stealing-the-election-democrats-2026/",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "With ICE Using Medicaid Data, Hospitals and States Are in a Bind Over Warning Immigrant Patients",
    "description": "The Trump administration’s move to give deportation officials access to Medicaid data is forcing hospitals and states to consider alerting immigrant patients that information from emergency medical coverage applications could be used in efforts to remove them…",
    "link": "https://kffhealthnews.org/news/article/ice-immigrants-medicaid-data-sharing-hospitals-states-deportation/",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "How ICE is using facial recognition to bring surveillance to the streets",
    "description": "Immigration agents flooding U.S. streets are using a new surveillance tool kit that's alarming civil liberties advocates, lawmakers and activists.",
    "link": "https://www.nbcnews.com/tech/security/ice-agent-facial-recognition-video-protest-movile-fortify-photo-rcna257331",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "Trump Press Sec Snaps at Media as Spin on Threat to Rig 2026 Goes Awry",
    "description": "White House press secretary Karoline Leavitt lost her temper with a reporter who asked if Donald Trump intends to flood polling places with ICE agents during the midterms. She called the question “silly” and “hypothetical” and “disingenuous,” even though Stev…",
    "link": "https://newrepublic.com/article/206228/trump-press-sec-snaps-media-spin-threat-rig-2026-goes-awry",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "Trump’s Authoritarian Envy: The Plight and Peril of a Lame Duck",
    "description": "Envious of Putin, Xi, and other authoritarians who have no clock ticking, the president is more dangerous than ever. \nThe post Trump’s Authoritarian Envy: The Plight and Peril of a Lame Duck appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/06/trumps-authoritarian-envy-the-plight-and-peril-of-a-lame-duck/",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "Bad Bunny 101: Your guide to his lyrics and more ahead of his halftime show",
    "description": "Bad Bunny 101: Your guide to his lyrics and more ahead of his Super Bowl halftime show",
    "link": "https://www.nbcnews.com/pop-culture/music/bad-bunny-super-bowl-halftime-show-guide-lyrics-popularity-rcna257181",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "Democratic primary season kicks off with an anti-establishment earthquake",
    "description": "There’s no official winner yet, but the Democratic primary for the special election in New Jersey’s 11th Congressional District already amounts to a political earthquake in the state",
    "link": "https://www.nbcnews.com/politics/2026-election/steve-kornacki-new-jersey-primary-anti-establishment-earthquake-rcna257738",
    "timestamp": "2026-02-06T10:00:00Z"
  },
  {
    "title": "'Kind Of Creepy': Stephen Colbert Exposes Trump's Strange New Fundraising Messages",
    "description": "The \"Late Show\" host found the president's latest appeal for cash to be a little too desperate.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-fundraising_n_69859bd3e4b06f7f7bb82ea4",
    "timestamp": "2026-02-06T09:58:54Z"
  },
  {
    "title": "Fighting Abroad and At Home: Remembering the Experiences of Black Vietnam Veterans",
    "description": "If you were a twelve-year-old kid, as I was in the summer of 1966, N. Fifth Street in Columbus, Ohio seemed a bucolic place. Every neighborhood kid seemed to have a bicycle. Trees shaded homes. Men went to work in",
    "link": "https://lithub.com/fighting-abroad-and-at-home-remembering-the-experiences-of-black-vietnam-veterans/",
    "timestamp": "2026-02-06T09:58:38Z"
  },
  {
    "title": "Anduril founder says U.S. can spend billions less on defense: 'We spend too much money on the wrong thing'",
    "description": "Defense companies aren't incentivized to innovate because military strength is measured by how much the government spends, said Palmer Luckey, Anduril's founder.",
    "link": "https://www.cnbc.com/2026/02/06/us-can-spend-billions-less-on-defense-says-anduril-industries-founder.html",
    "timestamp": "2026-02-06T09:54:58Z"
  },
  {
    "title": "Germany: Rising concern over social inequality",
    "description": "Chancellor Friedrich Merz and his conservatives have seen a dip in the polls. This follows weeks of debates over the latest controversial proposals to restructure the welfare state.",
    "link": "https://www.dw.com/en/germany-rising-concern-over-social-inequality/a-75836870",
    "timestamp": "2026-02-06T09:54:00Z"
  },
  {
    "title": "Germans increasingly concerned over social inequality",
    "description": "Chancellor Friedrich Merz and his conservatives have seen a dip in the polls. This follows weeks of debates over the latest controversial proposals to restructure Germany's welfare state.",
    "link": "https://www.dw.com/en/germans-increasingly-concerned-over-social-inequality/a-75836870",
    "timestamp": "2026-02-06T09:54:00Z"
  },
  {
    "title": "Trump has been clear on wanting new nuclear arms control treaty, says US official",
    "description": "By Olivia Le PoidevinGENEVA, Feb 6 (Reuters) - The U.S. on Friday called for a new arms control agreement after the treaty that set caps on Russia and the U.S.’s strategi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/06/trump-has-been-clear-on-wanting-new-nuclear-arms-control-treaty-says-us-official",
    "timestamp": "2026-02-06T09:50:51Z"
  },
  {
    "title": "‘Pure hell’ – Moscow on Epstein files",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova has accused the West of covering up global child trafficking linked to Jeffrey Epstein Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632085-zakharova-epstein-pure-hell/",
    "timestamp": "2026-02-06T09:46:24Z"
  },
  {
    "title": "‘Laughable,’ says Raut as he rubbishes Speaker Birla’s LS claim",
    "description": "Shiv Sena (UBT) leader Sanjay Raut has called Lok Sabha Speaker Om Birla's statement about Congress MPs potentially threatening Prime Minister Narendra Modi 'laughable'. Raut asserted that the country is in danger due to the current government and claimed Ind…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/laughable-says-raut-as-he-rubbishes-speaker-birlas-ls-claim/articleshow/127982489.cms",
    "timestamp": "2026-02-06T09:46:15Z"
  },
  {
    "title": "Savannah Guthrie’s Brother Issues Direct Plea To Person Holding Their Mother",
    "description": "Camron Guthrie’s message came hours after a sheriff said investigators don't have proof Nancy Guthrie is alive but believe “she's still out there.\"",
    "link": "https://www.huffpost.com/entry/savannah-guthrie-brother-appeal_n_6985b436e4b0e27eef5495de",
    "timestamp": "2026-02-06T09:43:41Z"
  },
  {
    "title": "Dragging NATO Into Arctic Raises Regional Tensions - Russian Ambassador to Denmark",
    "description": "MOSCOW (Sputnik) - Denmark, by dragging NATO into the Arctic, is pushing confrontational approaches that lead to a weakening of security and increased military tensions in the region, Russian Ambassador to Copenhagen Vladimir Barbin told Sputnik.",
    "link": "https://sputnikglobe.com/20260206/dragging-nato-into-arctic-raises-regional-tensions---russian-ambassador-to-denmark-1123597969.html",
    "timestamp": "2026-02-06T09:40:41Z"
  },
  {
    "title": "Trump and the NFL - why it's complicated",
    "description": "After a lawsuit and many failed team bids, Donald Trump looked to have ended his 40-year feud with the NFL - but is their relationship set for another twist?",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_7748259f-a11e-49a7-b55b-59f829dd59fd",
    "timestamp": "2026-02-06T09:38:22Z"
  },
  {
    "title": "U.S. Signs Reciprocal Trade and Investment Agreement with Argentina",
    "description": "The United States and Argentina on Thursday signed an Agreement on Reciprocal Trade and Investment (ARTI), granting U.S. goods preferential market access to the South American nation.\nThe post U.S. Signs Reciprocal Trade and Investment Agreement with Argentin…",
    "link": "https://www.breitbart.com/latin-america/2026/02/06/u-s-signs-reciprocal-trade-and-investment-agreement-with-argentina/",
    "timestamp": "2026-02-06T09:37:46Z"
  },
  {
    "title": "China Urges US to Resume Dialogue With Russia on Strategic Stability After New START",
    "description": "BEIJING (Sputnik) - China urges the United States to resume dialogue with Russia on strategic stability and discuss further steps after the New START (New Strategic Arms Reduction Treaty) expires, Chinese Foreign Ministry spokesman Lin Jian said on Friday.",
    "link": "https://sputnikglobe.com/20260206/china-urges-us-to-resume-dialogue-with-russia-on-strategic-stability-after-new-start-1123597834.html",
    "timestamp": "2026-02-06T09:35:54Z"
  },
  {
    "title": "Trump posts election conspiracy video with Obamas depicted as monkeys",
    "description": "Video repeats false allegations that ballot-counting company Dominion Voting Systems helped steal the 2020 election from Trump",
    "link": "https://timesofmalta.com/article/trump-posts-election-conspiracy-video-obamas-depicted-monkeys.1123675",
    "timestamp": "2026-02-06T09:35:00Z"
  },
  {
    "title": "Iran and US to reopen nuclear talks in Oman after weeks of tension",
    "description": "The U.S. is seeking \"zero nuclear capability\" from Iran, the White House said.",
    "link": "https://abcnews.go.com/International/iran-us-reopen-nuclear-talks-oman-after-weeks/story?id=129907788",
    "timestamp": "2026-02-06T09:34:58Z"
  },
  {
    "title": null,
    "description": "Donald Trump warns that terrorists know what is coming if they attack Christians, citing his administration’s actions against ISIS in Nigeria.\n\nRead More: https://punchng.com/2056936-2/",
    "link": "https://punchng.com/2056936-2/",
    "timestamp": "2026-02-06T09:20:08Z"
  },
  {
    "title": "Ian McKellen Reveals The Moment He Took Aim At Trump While Filming New Marvel Movie",
    "description": "“Will I be allowed back in the country?”",
    "link": "https://www.huffpost.com/entry/ian-mckellan-donald-trump-avengers_n_6985a671e4b0fa2b17030e38",
    "timestamp": "2026-02-06T09:15:10Z"
  },
  {
    "title": "US senators reportedly want SpaceX probed for potential Chinese ownership",
    "description": "Chinese investment in Elon Musk's company SpaceX has been cited as a \"national security threat\", according to senators Elizabeth Warren and Andy Kim.",
    "link": "https://www.abc.net.au/news/2026-02-06/pentagon-asked-to-probe-spacex-chinese-ownership/106311868",
    "timestamp": "2026-02-06T09:14:31Z"
  },
  {
    "title": "'How Dare You!': Jimmy Kimmel Torches Trump Over 'Disgusting' New Comment",
    "description": "The late night host said the president's new interview was \"nuts\" even by his standards.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-disgusting_n_69859224e4b0e27eef54831d",
    "timestamp": "2026-02-06T09:12:26Z"
  },
  {
    "title": "Canada, France Open Greenland Consulates as Arctic Tensions Rise",
    "description": "For Canada, establishing a diplomatic outpost in Nuuk signals a desire for a larger role in the fast-globalizing far north",
    "link": "https://financialpost.com/pmn/business-pmn/canada-france-open-greenland-consulates-as-arctic-tensions-rise",
    "timestamp": "2026-02-06T09:07:50Z"
  },
  {
    "title": "Two dead in US strike on suspected narco boat in Pacific – military",
    "description": "A strike on a suspected drug boat in the eastern Pacific has killed two people, the US Southern Command has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632086-us-strike-drugs-pacific/",
    "timestamp": "2026-02-06T09:02:44Z"
  },
  {
    "title": "US strikes another alleged drug-trafficking boat in Eastern Pacific",
    "description": "The U.S. military says it has carried out another deadly strike on a vessel accused of trafficking drugs in the eastern Pacific Ocean",
    "link": "https://abcnews.go.com/US/wireStory/us-strikes-alleged-drug-trafficking-boat-eastern-pacific-129905934",
    "timestamp": "2026-02-06T09:01:52Z"
  },
  {
    "title": "Bitcoin/Crypto Crash Captures Headlines as Potentially More Serious Tech-Driven Debt Retreat Progresses",
    "description": "As much fun as it is to watch Bitcoin swoon, a more serious erosion is underway on the big tech borrowing front.",
    "link": "https://www.nakedcapitalism.com/2026/02/bitcoin-crypto-crash-captures-headlines-as-potentially-more-serious-tech-driven-debt-retreat-progresses.html",
    "timestamp": "2026-02-06T09:01:33Z"
  },
  {
    "title": "Inuit delegation in Greenland for opening of Canadian consulate has a message for Trump: 'Back off'",
    "description": "A delegation of Inuit from Canada is in Greenland for the official opening of the new Canadian consulate in the capital of Nuuk, both to show solidarity with Greenlandic Inuit and to bring a stern message for U.S. President Donald Trump: 'That land is not for…",
    "link": "https://www.cbc.ca/news/politics/inuit-delegation-canadian-consulate-greenland-9.7074387",
    "timestamp": "2026-02-06T09:00:00Z"
  },
  {
    "title": "U.S.-Russia nuclear weapons treaty has expired. What happens now?",
    "description": "The treaty between the U.S. and Russia limiting their deployment of strategic nuclear weapons has expired, leaving plenty of questions about what U.S. President Donald Trump and Russian President Vladimir Putin intend to do next.",
    "link": "https://www.cbc.ca/news/world/nuclear-weapons-treaty-us-russia-start-expired-analysis-9.7076033",
    "timestamp": "2026-02-06T09:00:00Z"
  }
]