[
  {
    "title": "Trump advisor calls West Bank 'Samaria' in meeting with regional council head",
    "description": "Massad Boulos, a Lebanese-born American businessman and an advisor to US President Donald Trump, called the We",
    "link": "https://www.jpost.com/breaking-news/article-845395",
    "timestamp": "2025-03-10T05:53:45Z"
  },
  {
    "title": "WATCH: Kids can't contain excitement seeing Donald Duck in person",
    "description": "Max and Finn Beachy lit up with joy when they saw Donald Duck at Chef Mickey's restaurant in Walt Disney Resort. Their mom Elizabeth said it was a moment she'll cherish forever.",
    "link": "https://abcnews.go.com/GMA/Family/video/kids-excitement-donald-duck-person-119573684",
    "timestamp": "2025-03-10T05:53:16Z"
  },
  {
    "title": "US Envoy Says Gaza Hostage Deal Could Be Reached Within Weeks",
    "description": "The US envoy who held unprecedented direct talks with Hamas said Sunday the meeting had been &quot;very helpful&quot; and he was confident a hostage release deal could be reached &quot;within weeks.&quot;",
    "link": "https://www.ndtv.com/world-news/us-envoy-says-gaza-hostage-deal-could-be-reached-within-weeks-7889057",
    "timestamp": "2025-03-10T05:51:39Z"
  },
  {
    "title": "Trump \"attacking Canadian workers, families and businesses,\" says Canada's next prime minister",
    "description": "Ottawa, March 10 (Xinhua) -- Mark Carney, who won the election on Sunday to succeed Justin Trudeau a",
    "link": "http://en.people.cn/n3/2025/0310/c90000-20287376.html",
    "timestamp": "2025-03-10T05:50:56Z"
  },
  {
    "title": "Ukraine set for crucial talks with US on ending war with Russia",
    "description": "Ukrainian President Volodymyr Zelensky is due to arrive in Saudi Arabia on Monday, a day ahead of crucial talks between Ukrainian and U.S. officials on ending the war with Russia.",
    "link": "https://www.hurriyetdailynews.com/ukraine-set-for-crucial-talks-with-us-on-ending-war-with-russia-206701",
    "timestamp": "2025-03-10T05:47:24Z"
  },
  {
    "title": "How Social Security Administration Cuts Affect You - The American Prospect",
    "description": "This paper, published just last week, estimated that for every 10 percent decrease in field office employees in a particular county, there was a small reduction (0.06 percent) in enrollment for traditional Social Security, and a larger reduction—about 0.32 pe…",
    "link": "https://prospect.org/health/2025-03-06-how-social-security-administration-cuts-affect-you/",
    "timestamp": "2025-03-10T05:47:01Z"
  },
  {
    "title": "Crypto and Donald Trump’s Strategic Baseball Card Reserve",
    "description": "The Republicans and Donald Trump seem set on establishing a strategic crypto reserve. They are claiming this will somehow be an important source of economic security for the country. It’s clear that establishing the reserve will be an important way to give te…",
    "link": "https://www.counterpunch.org/2025/03/10/crypto-and-donald-trumps-strategic-baseball-card-reserve/",
    "timestamp": "2025-03-10T05:45:31Z"
  },
  {
    "title": "Iran says won't negotiate under 'intimidation' as Trump ramps up pressure",
    "description": "<p>TEHRAN - Iran said on Monday it would not negotiate under \"intimidation\", after US President Donald Trump sought to ratchet up pressure on Tehran by ending a sanctions waiver that had allowed Iraq to buy electricity from its Shiite neighbour.</p>",
    "link": "https://www.bangkokpost.com/world/2976706/iran-says-wont-negotiate-under-intimidation-as-trump-ramps-up-pressure",
    "timestamp": "2025-03-10T05:45:00Z"
  },
  {
    "title": "Meet the federal worker who went rogue: ‘I hope that it lights a fire under people’",
    "description": "To billionaire Elon Musk and his cost-cutting team at the Department of Government Efficiency, Karen Ortiz may just be one of many faceless bureaucrats.",
    "link": "https://www.clickondetroit.com/news/politics/2025/03/10/meet-the-federal-worker-who-went-rogue-i-hope-that-it-lights-a-fire-under-people/",
    "timestamp": "2025-03-10T05:44:10Z"
  },
  {
    "title": "China Rattles Crop Markets With Levies On Canadian Farm Exports",
    "description": "China’s weekend move to impose tariffs on Canadian rapeseed products has sent prices for the crop plunging, adding more uncertainty to global food flows that are being buffeted by a series of trade wars.",
    "link": "https://financialpost.com/pmn/business-pmn/china-rattles-crop-markets-with-levies-on-canadian-farm-exports",
    "timestamp": "2025-03-10T05:43:15Z"
  },
  {
    "title": "Trump’s tantrums: Should India talk tougher in the powwow over auto, farm sectors?",
    "description": "Agriculture is a sensitive sector in India, and the auto sector lacks a level-playing field compared to other countries. Reduction of tariffs here and influx of imports would hit livelihoods.",
    "link": "https://www.moneycontrol.com/news/business/trump-s-tantrums-should-india-talk-tougher-in-the-powwow-over-auto-farm-sectors-12960059.html",
    "timestamp": "2025-03-10T05:40:47Z"
  },
  {
    "title": "Truce talks to resume in Qatar as Israel cuts off electricity in Gaza",
    "description": "Israel is due to send a delegation to Doha on Monday for a fresh round of talks on extending a fragile ceasefire in Gaza, after cutting off the electricity supply to ramp up pressure on Hamas.",
    "link": "https://www.hurriyetdailynews.com/israeli-negotiators-head-to-qatar-for-gaza-truce-talks-206700",
    "timestamp": "2025-03-10T05:40:00Z"
  },
  {
    "title": "The EPA Under Lee Zeldin",
    "description": "In his first term as president, Donald Trump picked to head the U.S. Environmental Protection Agency a virulent anti-EPA figure, Scott Pruitt. As the International Bar Association said back then, Pruit had been “the scourge of the EPA as attorney general of O…",
    "link": "https://www.counterpunch.org/2025/03/10/the-epa-under-lee-zeldin/",
    "timestamp": "2025-03-10T05:39:02Z"
  },
  {
    "title": "China bond yields jump to three-month highs as investors pare rate cut expectations",
    "description": "Chinese government bond yields moved further away from January's historic lows amid optimism in the faltering economy and a stock market rally.",
    "link": "https://www.cnbc.com/2025/03/10/chinese-government-bond-yields-jumped-amid-renewed-hopes-for-economy-rate-cut-delays.html",
    "timestamp": "2025-03-10T05:35:04Z"
  },
  {
    "title": "Trump to meet tech CEOs on Monday",
    "description": "United States President Donald Trump will hold a roundtable with top tech chief executive officers (CEOs) on Monday, at 2:00 pm and 3:00 pm, Eastern time, according to the official White House schedul...",
    "link": "https://biztoc.com/x/ba668aac8a320ea3",
    "timestamp": "2025-03-10T05:34:40Z"
  },
  {
    "title": "‘Canada Will Never, Ever…Be Part Of America’: Trudeau’s Successor Carney Lays Into Trump After Winning Leadership Race",
    "description": "Mark Carney said Canada's retaliatory tariffs which are designed to have “maximum impact\" in the U.S. will remain in place “until the Americans show us respect.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/03/10/canada-will-never-everbe-part-of-america-trudeaus-successor-carney-takes-shots-at-trump-after-winning-leadership-race/",
    "timestamp": "2025-03-10T05:31:34Z"
  },
  {
    "title": "Meet Mark Carney, the former central banker elected to replace Canadian Prime Minister Justin Trudeau in the thick of tariff talk",
    "description": "Mark Carney is expected to replace Canadian Prime Minister Justin Trudeau as Canada grapples with Trump's tariffs.",
    "link": "https://www.businessinsider.com/mark-carney-canada-justin-trudeau-prime-minister-replacement-background-2025-3",
    "timestamp": "2025-03-10T05:30:28Z"
  },
  {
    "title": "Top US health agency makes $25,000 buyout offer to most of its employees",
    "description": "Most of the 80,000 federal workers were emailed an offer to leave their job for as much as a $25,000 payment.",
    "link": "https://www.kwqc.com/2025/03/09/top-us-health-agency-makes-25000-buyout-offer-most-its-employees/",
    "timestamp": "2025-03-10T05:30:26Z"
  },
  {
    "title": "Canada will win trade war with US – new PM",
    "description": "Canada’s new Liberal Party leader has pledged to maintain tariffs on US goods until Americans “show respect” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613960-canada-will-win-trade-war/",
    "timestamp": "2025-03-10T05:29:23Z"
  },
  {
    "title": "Stock market today: Asian stocks are mixed as week starts with uncertainty over tariffs",
    "description": "Asian stocks got a mixed start to trading Monday as uncertainty persisted over what President Donald Trump will do with tariffs.  U.S. futures were lower and...",
    "link": "https://finance.yahoo.com/news/stock-market-today-asian-stocks-052707655.html",
    "timestamp": "2025-03-10T05:27:07Z"
  },
  {
    "title": "Hong Kong, Shanghai lead losses in mixed Asian markets.",
    "description": "Shares in Hong Kong and Shanghai sank Monday on a mixed day for Asian markets after data showing Chinese consumer prices slipped back into deflation stoked fresh concerns over the world’s number two economy. The reading compounded uncertainty on trading floor…",
    "link": "https://punchng.com/hong-kong-shanghai-lead-losses-in-mixed-asian-markets/",
    "timestamp": "2025-03-10T05:26:41Z"
  },
  {
    "title": "NZ stocks end firm after late surge - Market close",
    "description": "NZ stocks close almost one percent higher after a late buying surge.",
    "link": "https://www.nzherald.co.nz/business/nz-stocks-end-firm-after-late-surge-market-close/W5PPQKXOWZAI7LENDOMQ7E3SKM/",
    "timestamp": "2025-03-10T05:26:37Z"
  },
  {
    "title": "\"Don't Think Zelensky Is Grateful\": Trump Jibe Follows Elon Musk's Warning",
    "description": "US President Donald Trump has again accused his Ukrainian counterpart Volodymyr Zelensky of not being &quot;grateful&quot; for getting billions of dollars from the United States under the previous Biden administration.",
    "link": "https://www.ndtv.com/world-news/dont-think-zelensky-is-grateful-trump-jibe-follows-elon-musks-warning-7888873",
    "timestamp": "2025-03-10T05:24:18Z"
  },
  {
    "title": "Ukraine replaces India as world’s top arms importer; US remains biggest seller",
    "description": "Since 2022, Ukraine has become the world's largest arms importer, largely due to the ongoing conflict with Russia. The US is Ukraine's primary arms supplier, contributing 45% of imports. European nations have also increased imports by 155%. India, previously …",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-replaces-india-as-worlds-top-arms-importer-us-remains-biggest-seller/articleshow/118831676.cms",
    "timestamp": "2025-03-10T05:24:08Z"
  },
  {
    "title": "The Trump nominee uniting Democrats and Republicans",
    "description": "Both the left and the right like Donald Trump’s antitrust nominee. Wall Street doesn’t",
    "link": "https://biztoc.com/x/08bbe70603ddc801",
    "timestamp": "2025-03-10T05:23:32Z"
  },
  {
    "title": "Secret Service shoots man near White House",
    "description": "Police in Washington are investigating the shooting of a man Sunday by U.S. Secret Service personnel near the White House.\n\n\nA Secret Service spokesperson said a day before the shooting, police had shared information about “a suicidal individual” who may have…",
    "link": "https://www.voanews.com/a/secret-service-shoots-man-near-white-house/8004874.html",
    "timestamp": "2025-03-10T05:21:34Z"
  },
  {
    "title": "Mark Carney wins race to replace Trudeau as Canada's PM",
    "description": "The former central banker has already launched a scathing attack on Donald Trump.",
    "link": "https://7news.com.au/business/mark-carney-wins-race-to-replace-trudeau-as-canadas-pm-c-17985156",
    "timestamp": "2025-03-10T05:19:47Z"
  },
  {
    "title": "Meet the federal worker who went rogue: ‘I hope that it lights a fire under people’",
    "description": "To billionaire Elon Musk and his cost-cutting team at the Department of Government Efficiency, Karen Ortiz may just be one of many faceless bureaucrats",
    "link": "https://abcnews.go.com/Business/wireStory/meet-federal-worker-rogue-hope-lights-fire-people-119623306",
    "timestamp": "2025-03-10T05:18:16Z"
  },
  {
    "title": "Watch: SNL Pokes Fun At Trump After Musk And Rubio Clash In Cabinet Meeting",
    "description": "The SNL sketch showed Donald Trump acting as a peace broker to mend ties between his two aides, Elon Musk and Marco Rubio.",
    "link": "https://www.ndtv.com/world-news/watch-snl-pokes-fun-at-trump-after-musk-and-rubio-clash-in-cabinet-meeting-7888833",
    "timestamp": "2025-03-10T05:18:03Z"
  },
  {
    "title": "FEMA Cancels Classes at National Fire Academy Amid Federal Funding Cuts",
    "description": "The country’s preeminent federal fire training academy canceled classes, effective immediately, on Saturday amid the ongoing flurry of funding freezes and staffing cuts by President Donald Trump’s administration. The Federal Emergency Management Agency announ…",
    "link": "https://www.insurancejournal.com/news/national/2025/03/10/814765.htm",
    "timestamp": "2025-03-10T05:16:49Z"
  },
  {
    "title": "EU ministers to discuss joint borrowing for defence, use of existing funds",
    "description": "BRUSSELS (Reuters) - European Union finance ministers will discuss on Monday how to pay for defence through new joint borrowing, existing EU funds and a greater role for the European Investment Bank, with a view to decisions in June, the Polish EU presidency …",
    "link": "https://www.thestar.com.my/news/world/2025/03/10/eu-ministers-to-discuss-joint-borrowing-for-defence-use-of-existing-funds",
    "timestamp": "2025-03-10T05:16:00Z"
  },
  {
    "title": "EU braces for Hungarian move against Russia sanctions",
    "description": "EU leaders managed to parry Hungary’s attempt to derail their Ukraine summit last week, but diplomats are now bracing for a bare-knuckled brawl over Russia sanctions this week.",
    "link": "https://www.euractiv.com/section/politics/news/eu-braces-for-hungarian-move-against-russia-sanctions/",
    "timestamp": "2025-03-10T05:15:36Z"
  },
  {
    "title": "Trump tariff 'bomb' rattles South Korea's chip and auto sectors",
    "description": "SEOUL -- South Korean industry is reeling from U.S. President Donald Trump's threat of heavy tariffs on automobiles and his pledge to scrap billions of dollars in subsidies for chipmakers investing in America\nAt a forum in Seoul last week, a semiconductor ass…",
    "link": "https://biztoc.com/x/9ec98ebae70631ab",
    "timestamp": "2025-03-10T05:12:13Z"
  },
  {
    "title": "Who is Mark Carney, the former banker turned Canada’s next prime minister?",
    "description": "Canada’s next leader is a relative political newcomer, coming instead from a decades-long career in finance where he steered governments through major global crises and periods of upheaval – experience he’s hoping to now leverage as he prepares to take over f…",
    "link": "https://www.cnn.com/2025/03/10/business/mark-carney-canada-pm-profile-intl-hnk/index.html",
    "timestamp": "2025-03-10T05:09:16Z"
  },
  {
    "title": "Zelenskyy heads to Saudi Arabia ahead of crunch US talks",
    "description": "President Zelenskyy meets Saudi Crown Prince Mohammed bin Salman ahead of critical talks with U.S. officials on ending the war with Russia. With U.S. policies shifting and military support in question, Zelenskyy seeks European backup and a minerals deal with …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelenskyy-heads-to-saudi-arabia-ahead-of-crunch-us-talks/articleshow/118831485.cms",
    "timestamp": "2025-03-10T05:07:42Z"
  },
  {
    "title": "Zelenskiy heads to Saudi Arabia ahead of crunch US talks",
    "description": "KYIV (Reuters) - President Volodymyr Zelenskiy travels to Saudi Arabia to meet Crown Prince Mohammed bin Salman on Monday, ahead of talks between Ukrainian and U.S. officials on ending the war with Russia at an increasingly precarious moment for Kyiv. Read fu…",
    "link": "https://www.thestar.com.my/news/world/2025/03/10/zelenskiy-heads-to-saudi-arabia-ahead-of-crunch-us-talks",
    "timestamp": "2025-03-10T05:06:00Z"
  },
  {
    "title": "No More Trump Tariffs For Now? Mexico President's Big Claim To Supporters",
    "description": "Mexican President Claudia Sheinbaum told cheering crowds Sunday that she is confident that her country has headed off the threat of US tariffs for now.",
    "link": "https://www.ndtv.com/world-news/no-more-donald-trump-tariffs-for-now-mexico-president-claudia-sheinbaums-big-claim-to-supporters-7888349",
    "timestamp": "2025-03-10T05:05:56Z"
  },
  {
    "title": "Four reasons Europe can’t trust the US to protect it anymore",
    "description": "How far will Trump go to force Europeans to grow up? In the meantime, can the Europeans rely on America? Are the Americans Europe’s friend or foe?",
    "link": "https://www.euractiv.com/section/defence/news/four-reasons-europe-cant-trust-the-us-to-protect-it-anymore/",
    "timestamp": "2025-03-10T05:00:40Z"
  },
  {
    "title": "Proton CEO: Tech sovereignty requires demand for European services",
    "description": "\"Europe needs to realise is that there is no difference between tech sovereignty and actual sovereignty,\" said Andy Yen.",
    "link": "https://www.euractiv.com/section/tech/interview/proton-ceo-tech-sovereignty-requires-demand-for-european-services/",
    "timestamp": "2025-03-10T05:00:15Z"
  },
  {
    "title": "Luxury Tech Specialist Deda Stealth Buys AI Pricing Firm Competitoor",
    "description": "Deda Stealth expands its tech influence to the U.S. by acquiring AI pricing platform Competitoor, enhancing market strategies for luxury brands.",
    "link": "http://wwd.com/business-news/technology/deda-stealth-buys-ai-firm-competitoor-1237026060/",
    "timestamp": "2025-03-10T05:00:00Z"
  },
  {
    "title": "Trump signs order for U.S. Bitcoin Reserve—But there’s a catch…",
    "description": "With exchange reserves plunging, could a Bitcoin's supply squeeze be imminent?",
    "link": "https://ambcrypto.com/trump-signs-order-for-u-s-bitcoin-reserve-but-theres-a-catch/",
    "timestamp": "2025-03-10T05:00:00Z"
  },
  {
    "title": "US says Ukraine 'ready to move forward' on truce demand",
    "description": "Ukraine is under US pressure to accept a quick truce to end the war with Russia, with US-Ukrainian talks set to begin in Saudi Arabia.",
    "link": "https://www.bbc.com/news/articles/cy9dp5rr2x9o",
    "timestamp": "2025-03-10T04:55:23Z"
  },
  {
    "title": "What to know ahead of the talks between the US and Ukraine in Saudi Arabia",
    "description": "Saudi Arabia is hosting critical talks between the U.S. and Ukraine to resolve tensions from President Zelenskyy's recent White House visit. The discussions in Jeddah aim to ensure continued U.S. support for Ukraine amid its ongoing conflict with Russia, high…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-to-know-ahead-of-the-talks-between-the-us-and-ukraine-in-saudi-arabia/articleshow/118831076.cms",
    "timestamp": "2025-03-10T04:53:25Z"
  },
  {
    "title": "Congress MP gives adjournment notice in Lok Sabha, asks govt to explain “Concessions” to the US in tariffs",
    "description": "The adjournment notice states that transparency in trade negotiations is essential to protect national economic interests and to maintain a balanced approach towards international commitments",
    "link": "https://www.thehindubusinessline.com/news/national/congress-mp-gives-adjournment-notice-in-lok-sabha-asks-govt-to-explain-concessions-to-the-us-in-tariffs/article69312110.ece",
    "timestamp": "2025-03-10T04:49:54Z"
  },
  {
    "title": "Trump says former Australian PM lacked China insight",
    "description": "United States President Donald Trump criticized Malcolm Turnbull, Australia's former prime minister, questioning his understanding of China and leadership abilities.\nIn a statement, Trump claimed...",
    "link": "https://biztoc.com/x/d654c17ca2ca1f2c",
    "timestamp": "2025-03-10T04:49:49Z"
  },
  {
    "title": "Drawing huge crowds, Bernie Sanders steps into leadership of the anti-Trump resistance",
    "description": "At 83 years old, Bernie Sanders has emerged as an unlikely leader of the Democratic resistance to Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/drawing-huge-crowds-bernie-sanders-steps-leadership-anti-119623034",
    "timestamp": "2025-03-10T04:46:28Z"
  },
  {
    "title": "Trump’s Chaos Is a Gift to Xi Jinping, Ex-Australian PM Says",
    "description": "A former Australian prime minster said the Trump administration’s treatment of longtime allies was providing an opportunity for China, in remarks that came shortly before the US president delivered a personal rebuff.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-chaos-is-a-gift-to-xi-jinping-ex-australian-pm-says",
    "timestamp": "2025-03-10T04:42:58Z"
  },
  {
    "title": "‘Weak and ineffective’: Donald Trump lashes out at former Australian prime minister Malcolm Turnbull",
    "description": "US president’s late-night social media post came after Turnbull criticised Trump’s leadership as ‘chaotic’",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b8d883e9-afba-414d-ba0c-0b0ac743bd55",
    "timestamp": "2025-03-10T04:40:34Z"
  },
  {
    "title": "Russian forces depleted and stalling on eastern front, Ukraine says",
    "description": "Ukrainian forces have managed to halt the Russian offensive in the Donetsk region and regained small territories. Despite Russia conducting daily assaults, their resources and equipment are depleting. Ukrainian soldiers remain cautious of potential intensifie…",
    "link": "https://economictimes.indiatimes.com/news/defence/russian-forces-depleted-and-stalling-on-eastern-front-ukraine-says/articleshow/118830693.cms",
    "timestamp": "2025-03-10T04:39:20Z"
  },
  {
    "title": "What to do while waiting for stock market-minded Trump to say enough is enough",
    "description": "Our president, Donald Trump , tells us that \"what we are doing is big,\" so there might be economic consequences to come that we don't like. But he can't change the plan, whatever the heck the plan is. Our Treasury secretary, Scott Bessent, comes on CNBC and t…",
    "link": "https://biztoc.com/x/ac8b5557c3fa1f06",
    "timestamp": "2025-03-10T04:38:34Z"
  },
  {
    "title": "Rupee plunges 30 paise to 87.25 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened weak at 87.24 amid intense volatility and touched the low of 87.34 before trading at 87.25 against the greenback in early deals",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-plunges-30-paise-to-8725-against-us-dollar-in-early-trade/article69312104.ece",
    "timestamp": "2025-03-10T04:36:58Z"
  },
  {
    "title": "Trump angry with King Charles over Zelensky reception – media",
    "description": "US President Donald Trump was upset over Vladimir Zelensky’s meeting with King Charles III, the Daily Mail says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613961-trump-angry-charles-zelensky-meeting/",
    "timestamp": "2025-03-10T04:36:15Z"
  },
  {
    "title": "윤석열·국민의힘·조선일보發 핵무장론 확산에 미, AI·원자력 민감국가 분류",
    "description": "Japan’s workers saw their base pay rise at the fastest clip in 32 years, a result that sends a positive signal to the Bank of Japan https://t.co/cdxZc4ZB7P— Bloomberg Economics (@economics) March 10, 2025 Star Entertainment is considering a last-minute recapi…",
    "link": "https://ryueyes11.tistory.com/511522",
    "timestamp": "2025-03-10T04:32:31Z"
  },
  {
    "title": "Five Key Moves in March the White House Has Made for Crypto",
    "description": "Last week, Trump hosted crypto leaders at the White House and unveiled a Bitcoin-first strategy, vowing to “never sell.” Here's the latest.",
    "link": "https://decrypt.co/309281/five-key-moves-in-march-the-white-house-has-made-for-crypto",
    "timestamp": "2025-03-10T04:32:02Z"
  },
  {
    "title": "Canada's next prime minister managed the financial crisis, then Brexit and now Trump's trade war",
    "description": "Canada’s next prime minister has helped run two Group of Seven economies in crisis before and now will try to steer Canada through a looming trade war brought by U.S. President Donald Trump, a threat of annexation and an expected federal election",
    "link": "https://abcnews.go.com/International/wireStory/canadas-prime-minister-managed-financial-crisis-brexit-now-119623213",
    "timestamp": "2025-03-10T04:30:17Z"
  },
  {
    "title": "‘Be quiet, small man—Ukraine would collapse without Starlink’: Elon Musk clashes with Polish minister",
    "description": "Elon Musk and Polish Foreign Minister Radoslaw Sikorski engaged in a heated exchange over Starlink’s role in Ukraine’s defence. Sikorski claimed Poland funds a significant portion of Ukraine’s access to the satellite network, while Musk dismissed the remarks,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/be-quiet-small-manukraine-would-collapse-without-starlink-elon-musk-clashes-with-polish-minister/articleshow/118830357.cms",
    "timestamp": "2025-03-10T04:26:44Z"
  },
  {
    "title": "US energy secretary promises executives faster industry development",
    "description": "CERAWEEK-ENERGY/ (PIX):CERAWEEK-US energy secretary promises executives faster industry development",
    "link": "https://www.livemint.com/companies/news/us-energy-secretary-promises-executives-faster-industry-development-11741580709819.html",
    "timestamp": "2025-03-10T04:25:09Z"
  },
  {
    "title": "Meet the federal worker who went rogue: ‘I hope that it lights a fire under people’",
    "description": "NEW YORK (AP) — To billionaire Elon Musk and his cost-cutting team at the Department of Government Efficiency, Karen Ortiz may just be one of many faceless bureaucrats. But to some of her colleagues, she is giving a voice to those who feel they can't speak ou…",
    "link": "https://ca.finance.yahoo.com/news/meet-federal-worker-went-rogue-041925679.html",
    "timestamp": "2025-03-10T04:19:25Z"
  },
  {
    "title": "As undersea cables break off Europe and Taiwan, proving sabotage is hard",
    "description": "Officials have pointed to China and Russia as likely culprits, but legal challenges make prosecutions difficult.",
    "link": "https://www.aljazeera.com/news/2025/3/10/as-undersea-cables-break-down-proving-sabotage-a-difficult-task",
    "timestamp": "2025-03-10T04:18:11Z"
  },
  {
    "title": "Lutnick Plays Down Recession Fears as BTC Lingers in 80K Range",
    "description": "Treasury Secretary Howard Lutnick is dismissing warnings that Trump’s trade policies will drive economic growth, as a Bitcoin chill hits the markets.",
    "link": "https://www.coindesk.com/markets/2025/03/10/lutnick-plays-down-recession-fears-at-btc-lingers-in-80k-range",
    "timestamp": "2025-03-10T04:17:34Z"
  },
  {
    "title": "US immigration agents arrest Palestinian student protester at Columbia University in Trump crackdown",
    "description": "U.S. immigration agents detained Palestinian student Mahmoud Khalil, a key figure in pro-Palestinian protests at Columbia University, citing 'activities aligned to Hamas.' Civil rights groups condemned the arrest, calling it an attack on free speech. Presiden…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-immigration-agents-arrest-palestinian-student-protester-at-columbia-university-in-trump-crackdown/articleshow/118830132.cms",
    "timestamp": "2025-03-10T04:17:30Z"
  },
  {
    "title": "Israel Cuts Electricity for Water to Gaza, as Smotrich plans Expulsion of 5,000 Palestinian Civilians a Day for One Year",
    "description": "Ann Arbor (Informed Comment) - The Basil Maghribi at the Israeli newspaper Arab 48 reports that Energy and Infrastructure Minister Eli Cohen ordered late Sunday that all electricity deliveries from Israel to Gaza be halted immediately. Maghribi cautions that …",
    "link": "https://www.juancole.com/2025/03/electricity-expulsion-palestinian-civilians.html",
    "timestamp": "2025-03-10T04:15:18Z"
  },
  {
    "title": "John Oliver Says ICE Assertion That Detention Is “Nonpunitive” Is Like Claiming ‘Wicked’ Wasn’t Too Long: “Undercut By Empirical Evidence”",
    "description": "For his main topic of the evening, Last Week Tonight host John Oliver delved into ICE detention centers, delving into various ethical and legal issues revolving around detaining undocumented immigrants for uncertain periods of time. At one point, the politica…",
    "link": "http://deadline.com/2025/03/john-oliver-last-week-tonight-wicked-ice-1236320477/",
    "timestamp": "2025-03-10T04:09:31Z"
  },
  {
    "title": "Nepo Babies of ‘American Idol’: A Backstreet Boys Son, MAGA Daughter",
    "description": "Baylee Littrell, son of Backstreet Boys member Brian Littrell, auditioned on the season 23 premiere of show, which aired Sunday night.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/american-idol-nepo-baby-backstreet-boys-brian-baylee-littrell-1236159159/",
    "timestamp": "2025-03-10T04:07:13Z"
  },
  {
    "title": "Trump Admin Detains Pro-Palestinian Campus Protest Leader",
    "description": "Immigration officers have arrested a leader of the protests at Columbia University against Israel's war in Gaza, authorities said Sunday, after US President Donald Trump vowed to deport foreign pro-Palestinian student demonstrators.",
    "link": "https://www.ibtimes.com/trump-admin-detains-pro-palestinian-campus-protest-leader-3765751",
    "timestamp": "2025-03-10T04:06:12Z"
  },
  {
    "title": "Can Trump’s Gold Card Scheme Work?",
    "description": "American citizenship is already on sale; it’s all a matter of price.\nThe post Can Trump’s Gold Card Scheme Work? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/can-trumps-gold-card-scheme-work/",
    "timestamp": "2025-03-10T04:05:00Z"
  },
  {
    "title": "Living in Red-Card America: From Fear to Action",
    "description": "( Tomdispatch.com ) - “It is pretty wild how you can make someone mad by just holding a sign,” my 18-year-old Ro told me, as an irate driver peeled out of the intersection, shaking both his middle fingers at us but managing not to hit us. Phew!  Ro was right.…",
    "link": "https://www.juancole.com/2025/03/living-america-action.html",
    "timestamp": "2025-03-10T04:04:29Z"
  },
  {
    "title": "DeSantis Plots a Comeback",
    "description": "The failed 2024 candidate wants to try again—but his wife may be more likely to win the White House one day. \nThe post DeSantis Plots a Comeback appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/desantis-plots-a-comeback/",
    "timestamp": "2025-03-10T04:03:00Z"
  },
  {
    "title": "MAGA Should Embrace a Stronger Europe",
    "description": "America’s allies across the pond are getting serious about security. \nThe post MAGA Should Embrace a Stronger Europe appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/maga-should-embrace-a-stronger-europe/",
    "timestamp": "2025-03-10T04:03:00Z"
  },
  {
    "title": "Trump admin detains pro-Palestinian campus protest leader",
    "description": "Immigration officers have arrested a leader of the protests at Columbia University against Israel’s war in Gaza, authorities said Sunday, after US President Donald Trump vowed to deport foreign pro-Palestinian student demonstrators. Mahmoud Khalil, one of the…",
    "link": "https://www.digitaljournal.com/world/trump-admin-detains-pro-palestinian-campus-protest-leader/article",
    "timestamp": "2025-03-10T04:02:20Z"
  },
  {
    "title": "What’s a Trade War and How Did We End Up In One?",
    "description": "A couple of months ago, I wrote an article titled “Trump, Trudeau, and the 51st State.” It began with the words, “These are strange days in Canada.” Little did I know—though I suppose I should have predicted—that they would only get stranger.See Also\r\n<ul><li…",
    "link": "https://www.challies.com/articles/whats-a-trade-war-and-how-did-we-end-up-in-one/",
    "timestamp": "2025-03-10T04:02:00Z"
  },
  {
    "title": "As Trump seeks to transform global geopolitics, Israel must think much bigger than Gaza",
    "description": "In Trump's new geopolitical map, Russia would ally with the U.S. against China, Iran would sign a renewed nuclear deal, and the Gulf states would provide a safety net – leaving Israel at risk of being seen as an obstacle preventing this vision",
    "link": "https://www.haaretz.com/israel-news/2025-03-10/ty-article/.premium/as-trump-seeks-to-transform-global-geopolitics-israel-must-think-much-bigger-than-gaza/00000195-7cba-d0f8-a1f7-7cfbe4960000",
    "timestamp": "2025-03-10T04:01:21Z"
  },
  {
    "title": "Andrew Tate and the Art of Selling",
    "description": "Like most people, I am turned off by the stereotypical salesman personality. Saleswomen, too, although they are easier to tolerate if attractive enough. I know, I’m superficial. I’m not sure about transgender salespersons and their pronouns. But there is boun…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/andrew-tate-and-the-art-of-selling/",
    "timestamp": "2025-03-10T04:01:00Z"
  },
  {
    "title": "The Dark MAGA Gov-Corp Technate",
    "description": "What does the title of this article—not to mention each unusual word in it — even mean? This is not a rhetorical question. We urgently need to understand each term. A precise political philosophy underpins each. A combination of these interrelated philosophie…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/the-dark-maga-gov-corp-technate/",
    "timestamp": "2025-03-10T04:01:00Z"
  },
  {
    "title": "Tens of thousands of Mexicans rally with president to celebrate US decision to delay tariffs",
    "description": "Tens of thousands of people have packed into Mexico’s City main plaza to celebrate with President Claudia Sheinbaum a decision by the U.S. to postpone tariffs on many of the country’s goods.",
    "link": "https://www.ksat.com/business/2025/03/09/tens-of-thousands-of-mexicans-rally-with-president-to-celebrate-us-decision-to-delay-tariffs/",
    "timestamp": "2025-03-10T04:00:45Z"
  },
  {
    "title": "Pausing Aid to Ukraine: The World Should Have Seen It Coming",
    "description": "At the end of June, 2024, the world got its first glimpse at what Donald Trump’s plan to end the war in Ukraine in one day might look like. Retired Lieutenant General Keith Kellogg and former CIA analyst Fred Fleitz submitted a plan to then candidate Trump. I…",
    "link": "https://original.antiwar.com/ted_snider/2025/03/09/pausing-aid-to-ukraine-the-world-should-have-seen-it-coming/",
    "timestamp": "2025-03-10T04:00:35Z"
  },
  {
    "title": "Is Social Security a “Ponzi Scheme”?",
    "description": "To all retired Americans, its benefits are very real.",
    "link": "http://foreignpolicy.com/2025/03/10/social-security-musk-ponzi-scheme-benefits/",
    "timestamp": "2025-03-10T04:00:32Z"
  },
  {
    "title": "Everything You Know About the USAID Case May be Wrong",
    "description": "(h.t. to Mark W. Smith of the Four Boxes Diner here and here.)\r\n\r\nWelcome to your chance to nerd out on the difference between process and merits in legal actions. Our case of interest is AIDS Vaccine Advocacy v. Department of State. For non-lawyers,...",
    "link": "https://www.americanthinker.com/articles/2025/03/everything_you_know_about_the_usaid_case_may_be_wrong.html",
    "timestamp": "2025-03-10T04:00:00Z"
  },
  {
    "title": "Trump’s Timber Triumph: An America First Blueprint for Prosperity",
    "description": "On March 1, 2025, President Donald Trump signed the “Freeing Our Forests” executive order, igniting a bold vision to vault U.S. lumber production to unprecedented heights. This is no mere policy tweak—it’s a seismic shift alig...",
    "link": "https://www.americanthinker.com/articles/2025/03/trump_s_timber_triumph_an_america_first_blueprint_for_prosperity.html",
    "timestamp": "2025-03-10T04:00:00Z"
  },
  {
    "title": "The escalating leftist violence against conservatives from Trump and Musk on down",
    "description": "The news lately has been filled with stories of the escalating violence against conservatives. We already saw it last year with the two assassination attempts against Donald Trump, but it’s now spread to Musk, Vance, and conservatives generally...",
    "link": "https://www.americanthinker.com/blog/2025/03/the_escalating_leftist_violence_against_conservatives_from_trump_and_musk_on_down.html",
    "timestamp": "2025-03-10T04:00:00Z"
  },
  {
    "title": "Aid cuts, threats to neighbours and on the border with Russia: How Trump's first 50 days has affected millions",
    "description": "In just 50 days, Donald Trump has upended our world. He has ripped up rules, attacked allies and sided with enemies.",
    "link": "https://news.sky.com/story/how-donald-trump-has-upended-millions-of-lives-in-his-first-50-days-in-office-13323230",
    "timestamp": "2025-03-10T04:00:00Z"
  },
  {
    "title": "Sensex off to a muted start, Nifty above 22,550 as US tariff uncertainty looms",
    "description": "Market sentiment could be affected by U.S. Commerce Secretary Gina Raimondo's statement that President Donald Trump will continue to apply tariff pressure on Mexico, Canada, and China regarding their management of fentanyl.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-off-to-a-muted-start-nifty-above-22550-as-us-tariff-uncertainty-looms/articleshow/118829867.cms",
    "timestamp": "2025-03-10T03:59:16Z"
  },
  {
    "title": "Scholars stranded in America and abroad amid funding freeze of State Department programs",
    "description": "The U.S. State Department has frozen funding indefinitely for thousands of scholars participating in long-established cross-cultural programs connecting the U.S. to other parts of the world",
    "link": "https://abcnews.go.com/Politics/wireStory/scholars-stranded-america-abroad-amid-funding-freeze-state-119621843",
    "timestamp": "2025-03-10T03:58:27Z"
  },
  {
    "title": "10 Biggest Parallels Between Daredevil: Born Again's Wilson Fisk And President Donald Trump",
    "description": "After only two episodes of Daredevil: Born Again, there are several key parallels between New York's new mayor Wilson Fisk and President Donald Trump.",
    "link": "https://screenrant.com/daredevil-born-again-wilson-fisk-donald-trump-parallels-list/",
    "timestamp": "2025-03-10T03:55:19Z"
  },
  {
    "title": "AI Mania Makes ByteDance Cofounder Zhang Yiming China’s Richest Person",
    "description": "ByteDance cofounder Zhang Yiming has become China’s richest man as investors bet on companies with AI potential.",
    "link": "https://www.forbes.com/sites/ywang/2025/03/09/ai-mania-makes-bytedance-cofounder-zhang-yiming-chinas-richest-person/",
    "timestamp": "2025-03-10T03:52:58Z"
  },
  {
    "title": "Mark Carney Wins Vote To Replace Trudeau As Canada PM",
    "description": "Canada's Liberal Party overwhelmingly elected Mark Carney as the country's next prime minister Sunday, as the former central banker warned of \"dark days\" brought on by the United States under President Donald Trump.",
    "link": "https://www.ibtimes.com/mark-carney-wins-vote-replace-trudeau-canada-pm-3765750",
    "timestamp": "2025-03-10T03:50:00Z"
  },
  {
    "title": "Trump: Ukraine ‘may not survive’",
    "description": "Donald Trump said Ukraine “may not survive” as the White House put pressure on Volodymyr Zelensky to give up territory seized by Russia.Ahead of the start of peace talks in Saudi Arabia this week, Mr Trump suggested Ukraine may cease to exist as a sovereign s…",
    "link": "https://freerepublic.com/focus/f-news/4303257/posts",
    "timestamp": "2025-03-10T03:47:20Z"
  },
  {
    "title": "Ukraine set for crucial talks with US on ending war with Russia",
    "description": "<p>KYIV - Ukrainian President Volodymyr Zelensky is due to arrive in Saudi Arabia on Monday, a day ahead of crucial talks between Ukrainian and US officials on ending the war with Russia.</p>",
    "link": "https://www.bangkokpost.com/world/2976678/ukraine-set-for-crucial-talks-with-us-on-ending-war-with-russia",
    "timestamp": "2025-03-10T03:45:00Z"
  },
  {
    "title": "Ukraine set for crucial talks with US on ending war with Russia",
    "description": "Ukrainian President Volodymyr Zelensky is scheduled to meet with Saudi Crown Prince Mohammed bin Salman, followed by talks with U.S. officials on resolving the conflict with Russia. The discussions aim to establish a framework for a peace agreement and an ini…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-set-for-crucial-talks-with-us-on-ending-war-with-russia/articleshow/118829563.cms",
    "timestamp": "2025-03-10T03:38:57Z"
  },
  {
    "title": "Trump says four bidders in play for TikTok deal soon",
    "description": "ByteDance Ltd.’s TikTok faces a deadline of April 5 to strike a deal for its US operations — or be banned from the country under a bipartisan law passed during the Biden administration",
    "link": "https://www.bloomberg.com/news/articles/2025-03-10/trump-says-four-different-groups-in-play-for-tiktok-deal",
    "timestamp": "2025-03-10T03:36:48Z"
  },
  {
    "title": "Mark Carney ’87 Chosen Prime Minister of Canada in Landslide Liberal Vote - Harvard Crimson",
    "description": "Mark Carney ’87 Chosen Prime Minister of Canada in Landslide Liberal VoteHarvard Crimson How Trudeau Successor Took On Trump In Maiden Speech After Landslide WinNDTV Liberal leadership race: Event underway as party chooses Trudeau's successorCBC.ca Harvard gr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176663603",
    "timestamp": "2025-03-10T03:33:03Z"
  },
  {
    "title": "Singapore and Hong Kong face growth risks over U.S. tariff war with China",
    "description": "Economists lowered the growth outlook for Singapore and Hong Kong in the second half of this year on increased uncertainties from U.S. President Donald Trump imposing higher tariffs on China’s exports, according to the median of a Bloomberg survey.\nSingapore’…",
    "link": "https://biztoc.com/x/61ed6d1fb734b930",
    "timestamp": "2025-03-10T03:31:58Z"
  },
  {
    "title": "Mark Carney set to pilot Canada — Can he steer ties with India out of the ditch?",
    "description": "Mark Carney, set to become Canada's next Prime Minister, has pledged to restore and strengthen trade relations with India. Carney, who recently secured an overwhelming victory in the Liberal Party leadership race, is determined to diversify Canada’s economic …",
    "link": "https://economictimes.indiatimes.com/news/india/mark-carney-set-to-pilot-canada-can-he-steer-ties-with-india-out-of-the-ditch/articleshow/118829416.cms",
    "timestamp": "2025-03-10T03:28:22Z"
  },
  {
    "title": "Metals decline on weak China data and US tariff uncertainty",
    "description": "Copper extended its slide from a four-month high, dropping 0.3% to $9,588 a ton by 10:23 a.m. Shanghai time on the London Metal Exchange",
    "link": "https://www.bloomberg.com/news/articles/2025-03-10/metals-decline-on-weak-china-data-and-us-tariff-uncertainty",
    "timestamp": "2025-03-10T03:25:23Z"
  }
]