[
  {
    "title": "Trump orders 'powerful' U.S. military action against Yemen's Houthis; At least nine killed",
    "description": "The strikes are intended to reopen naval routes after the Houthis resumed attacks on Israeli ships in waters off Yemen, in response to Israel's blockade on Gaza aid",
    "link": "https://www.haaretz.com/israel-news/2025-03-15/ty-article/trump-orders-powerful-u-s-military-action-against-yemens-houthis-at-least-nine-killed/00000195-9b2c-d865-ad95-9b3d4de90000",
    "timestamp": "2025-03-15T19:44:47Z"
  },
  {
    "title": "US strikes Yemen’s Huthis as Trump vows end to shipping threat",
    "description": "The United States has launched “decisive and powerful military action” to end the threat posed to Red Sea shipping by Yemen’s Huthi rebels, President Donald Trump said Saturday. In a social media post that came after Huthi media reported strikes on the Yemeni…",
    "link": "https://www.digitaljournal.com/world/us-strikes-yemens-huthis-as-trump-vows-end-to-shipping-threat/article",
    "timestamp": "2025-03-15T19:43:20Z"
  },
  {
    "title": "Trump Orders Strikes on Iran-Backed Houthi Rebels in Yemen and Issues New Warning",
    "description": "“Our brave war-fighters are right now carrying out aerial attacks on the terrorists' bases, leaders, and missile defenses,\" Trump said.",
    "link": "https://time.com/7268661/trump-orders-strikes-on-iran-backed-houthi-rebels-in-yemen/",
    "timestamp": "2025-03-15T19:43:14Z"
  },
  {
    "title": "Trump orders U.S. strikes in Yemen, promising ‘lethal force’ until Houthis stop sea attacks",
    "description": "President Donald Trump said he ordered a series of airstrikes on Yemen's capital, Sanaa, on Saturday, promising to use “overwhelming lethal force” until Iranian-backed Houthi rebels cease their attacks on shipping along a vital maritime corridor.",
    "link": "https://www.pbs.org/newshour/world/trump-orders-u-s-strikes-in-yemen-promising-lethal-force-until-houthis-stop-sea-attacks",
    "timestamp": "2025-03-15T19:42:13Z"
  },
  {
    "title": "BREAKING: Radical Activist Obama Judge Blocks Trump’s Plan to Invoke Alien Enemies Act and Deport Venezuelan Nationals",
    "description": "A radical federal judge has moved to block former President Donald Trump’s efforts to secure America’s borders and protect its citizens. On Saturday, Chief Judge James E. Boasberg, an Obama-appointed leftist, granted a temporary restraining order to stop the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4304514/posts",
    "timestamp": "2025-03-15T19:41:59Z"
  },
  {
    "title": "BREAKING: Radical Activist Obama Judge Blocks Trump’s Plan to Invoke Alien Enemies Act and Deport Venezuelan Nationals",
    "description": "A radical federal judge has moved to block former President Donald Trump’s efforts to secure America’s borders and protect its citizens. On Saturday, Chief Judge James E. Boasberg, an Obama-appointed leftist, granted a temporary restraining order to stop the …",
    "link": "https://freerepublic.com/focus/f-news/4304514/posts",
    "timestamp": "2025-03-15T19:41:59Z"
  },
  {
    "title": "Mary Trump Slams Uncle: 'The Trump Regime Is Weakening Us on Every Single Front'",
    "description": "Recent moves by President Donald Trump have raised questions about the future stability of the U.S. economy and programs, and sparked new commentary from a familiar critic.\nWhat Happened: These concerns were highlighted in an analysis by Mary Trump, the Presi…",
    "link": "https://biztoc.com/x/e3c4ab6060d921ac",
    "timestamp": "2025-03-15T19:39:27Z"
  },
  {
    "title": "Donald Trump launches wave of air strikes on Yemen's Houthis",
    "description": "US President Donald Trump cited the armed group's recent attacks in the Red Sea as justification.",
    "link": "https://www.bbc.co.uk/news/articles/c05mvr3j3yro",
    "timestamp": "2025-03-15T19:37:40Z"
  },
  {
    "title": "Sneaking into backyards of the ultra-rich inspired author's new novel",
    "description": "Robert Lukins' third novel is a Succession-like saga set in a wealthy enclave in Connecticut in the 1990s.",
    "link": "https://www.abc.net.au/news/2025-03-16/robert-lukins-author-somebody-down-there-likes-me/105042750",
    "timestamp": "2025-03-15T19:32:05Z"
  },
  {
    "title": "President Trump orders strikes on Iran-backed Houthi rebels in Yemen and issues new warning",
    "description": "President Donald Trump said he ordered a series of airstrikes on Yemen’s capital, Sanaa, on Saturday, promising to use “overwhelming lethal force” until Iranian-backed Houthi rebels cease their attacks on shipping along a vital maritime corridor.",
    "link": "https://www.wpxi.com/news/local/president-trump-orders-strikes-iran-backed-houthi-rebels-yemen-issues-new-warning/4AJREK4OYZB2ZKCXV32JRZEDCQ/",
    "timestamp": "2025-03-15T19:30:32Z"
  },
  {
    "title": "How America ripped off Australia with 'free trade'",
    "description": "If the events of the past few weeks have proven anything, it is that free trade agreements are worthless, at least when it comes to trade.",
    "link": "https://www.abc.net.au/news/2025-03-16/verrender-us-free-trade-analysis/105053766",
    "timestamp": "2025-03-15T19:30:00Z"
  },
  {
    "title": "Is the ASX 200 on the verge of a market correction?",
    "description": "Here's how close we are to a market correction after another horror week. \nThe post Is the ASX 200 on the verge of a market correction? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/03/16/sunis-the-asx-200-on-the-verge-of-a-market-correction-11-2025/",
    "timestamp": "2025-03-15T19:30:00Z"
  },
  {
    "title": "US launches wave of air strikes on Yemen's Houthis",
    "description": "US President Donald Trump cited the armed group's recent attacks in the Red Sea as justification.",
    "link": "https://www.bbc.com/news/articles/c05mvr3j3yro",
    "timestamp": "2025-03-15T19:28:43Z"
  },
  {
    "title": "Could Trump's Birthright Citizenship Battle Reshape Judicial Power?",
    "description": "President Donald Trump has filed an emergency appeal with the U.S. Supreme Court, requesting it to limit the authority of lower-court judges who issue nationwide injunctions blocking federal policies.\nThe appeal, centered on his controversial executive order …",
    "link": "https://biztoc.com/x/de7dd72fb42fe4d8",
    "timestamp": "2025-03-15T19:28:25Z"
  },
  {
    "title": "Trump signs bill to fund the government for another 6 months",
    "description": "President Donald Trump signed into law a continuing resolution that funds the government through September 30.\nJoe Raedle/Getty Images\nTrump has signed into law a continuing resolution that averts a government shutdown.\nThe bill keeps the government funded th…",
    "link": "https://biztoc.com/x/5815e8e19f5f4949",
    "timestamp": "2025-03-15T19:28:11Z"
  },
  {
    "title": "Trump signs bill to fund the government for another 6 months",
    "description": "Trump on Saturday signed into law a high-stakes continuing resolution that keeps the government funded through late September.",
    "link": "https://www.businessinsider.com/trump-signs-gop-continuing-resolution-avoids-government-shutdown-2025-3",
    "timestamp": "2025-03-15T19:21:41Z"
  },
  {
    "title": "Fetterman rips AOC for criticizing Dems backing bill preventing government shutdown",
    "description": "Sen. John  Fetterman (D-Pa.) is ripping \"Squad\" Rep. Alexandria Ocasio-Cortez over her harsh criticism of Senate Democrats like him who are backing a Republican spending bill being pushed by President Trump to avoid a government shutdown.",
    "link": "https://nypost.com/2025/03/15/us-news/fetterman-rips-aoc-for-criticizing-dems-backing-billl-to-avoid-government-shutdown/",
    "timestamp": "2025-03-15T19:21:00Z"
  },
  {
    "title": "Trump launches strikes against Yemen's Houthis and warns Iran (Phil Stewart/Reuters)",
    "description": "Phil Stewart / Reuters:\nTrump launches strikes against Yemen's Houthis and warns Iran  —  U.S. President Donald Trump launched strikes against Yemen's Houthis on Saturday over the group's attacks against ships in the Red Sea, warning if Houthi attacks did not…",
    "link": "https://www.memeorandum.com/250315/p55",
    "timestamp": "2025-03-15T19:20:00Z"
  },
  {
    "title": "Trump Orders Strikes On Houthi Rebels In Yemen And Issues New Warning",
    "description": "“No terrorist force will stop American commercial and naval vessels from freely sailing the Waterways of the World,\" Trump said in a social media post.",
    "link": "https://www.huffpost.com/entry/trump-orders-strikes-houthi-rebels-in-yemen-and-issues-new-warning_n_67d5d0a2e4b0ae541d66c5f1",
    "timestamp": "2025-03-15T19:19:39Z"
  },
  {
    "title": "Trump rejects reports of delayed meeting with Putin",
    "description": "United States President Donald Trump dismissed reports that Russian President Vladimir Putin made his envoy, Steve Witkoff, wait for nine hours.\nIn a statement, Trump said there was \"no wait wha...",
    "link": "https://biztoc.com/x/f25d5cb663d1842f",
    "timestamp": "2025-03-15T19:17:22Z"
  },
  {
    "title": "Shane Ross: Ireland is in a good place now after Micheál Martin’s visit to the Oval Office",
    "description": "Last Wednesday, the US president was likely to be in foul form. Wall Street was in freefall and Europe had just announced tit-for-tat tariffs against the US. As bad luck would have it, the Taoiseach was the first European leader in the White House since US-Eu…",
    "link": "https://www.independent.ie/opinion/shane-ross-ireland-is-in-a-good-place-now-after-micheal-martins-visit-to-the-oval-office/a867425732.html",
    "timestamp": "2025-03-15T19:15:58Z"
  },
  {
    "title": "Trump signs bill funding government for 6 months, avoiding a shutdown",
    "description": "Largely retains levels set during Joe Biden's presidency",
    "link": "https://www.wnd.com/2025/03/trump-signs-bill-funding-government-for-6-months-avoiding-a-shutdown/",
    "timestamp": "2025-03-15T19:13:28Z"
  },
  {
    "title": "How Alberta is responding to Donald Trump’s tariffs — and which other provinces have joined in",
    "description": "As provinces like Alberta step forward to protect their local industries, the fallout from this escalating trade conflict may have lasting effects on Canada-U.S. relations.",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-alberta-is-responding-to-donald-trumps-tariffs-and-which-other-provinces-have-joined-in/articleshow/119054617.cms",
    "timestamp": "2025-03-15T19:12:46Z"
  },
  {
    "title": "US launches major air strikes on Houthi targets in Yemen; At least 9 killed",
    "description": "President Trump warns Houthis, promises intensified action as US strikes escalate in Yemen.",
    "link": "https://www.aljazeera.com/news/2025/3/15/us-launches-major-air-strikes-on-houthi-targets-in-yemen-at-least-9-killed",
    "timestamp": "2025-03-15T19:12:37Z"
  },
  {
    "title": "Russia Says It Will Agree To Ceasefire As Soon As It’s Done Conquering Ukraine",
    "description": "MOSCOW — In an encouraging development for the seemingly deadlocked negotiations, Russia now says that it would agree to a ceasefire as soon as it is done conquering the rest of Ukraine. Experts had been skeptical regarding the prospects of any lasting peace …",
    "link": "https://freerepublic.com/focus/f-chat/4304511/posts",
    "timestamp": "2025-03-15T19:12:26Z"
  },
  {
    "title": "Trump orders strikes on Yemen's Houthi rebels, issues fresh threats to backer Iran",
    "description": "U.S. President Donald Trump said he ordered a series of airstrikes on Yemen's capital, Sanaa, on Saturday, promising to use \"overwhelming lethal force\" until Iranian-backed Houthi rebels cease their attacks on shipping along a vital maritime corridor.",
    "link": "https://www.cbc.ca/news/world/trump-houthi-yemen-iran-1.7484848",
    "timestamp": "2025-03-15T19:12:11Z"
  },
  {
    "title": "Trump Says He Ordered Military Action Against Houthis in Yemen (Susanne Barton/Bloomberg)",
    "description": "Susanne Barton / Bloomberg:\nTrump Says He Ordered Military Action Against Houthis in Yemen  —  President Donald Trump says he ordered the US military to launch decisive and powerful action against the “Houthi terrorists” in Yemen.",
    "link": "https://www.memeorandum.com/250315/p53",
    "timestamp": "2025-03-15T19:10:02Z"
  },
  {
    "title": "Donald Trump Launches 'Decisive' Military Action Against Yemen's Houthis",
    "description": "President Donald Trump announced the action in a post on Truth Social and included a warning to Iran against supporting the Houthi forces in Yemen.",
    "link": "https://biztoc.com/x/eaab1236514ab945",
    "timestamp": "2025-03-15T19:05:58Z"
  },
  {
    "title": "Donald Trump Launches 'Decisive' Military Action Against Yemen's Houthis",
    "description": "President Donald Trump announced the action in a post on Truth Social and included a warning to Iran against supporting the Houthi forces in Yemen.",
    "link": "https://www.newsweek.com/donald-trump-launches-decisive-military-action-yemen-houthis-2045462",
    "timestamp": "2025-03-15T19:05:37Z"
  },
  {
    "title": "Trump admin expels South African ambassador, escalating tensions",
    "description": "The United States has expelled South African Ambassador Ebrahim Rasool for criticizing the Trump administration, further heightening tensions between the two countries.",
    "link": "https://www.msnbc.com/top-stories/latest/marco-rubio-south-africa-ambassador-ebrahim-rasool-race-trump-rcna196577",
    "timestamp": "2025-03-15T19:05:04Z"
  },
  {
    "title": "Hamas offer to free American hostage a calculated move as Gaza talks stall",
    "description": "Israel has been unable to get a deal with Hamas and has waited for the US to make the move.",
    "link": "https://www.jpost.com/arab-israeli-conflict/gaza-news/article-846184",
    "timestamp": "2025-03-15T19:03:34Z"
  },
  {
    "title": "Trump’s Latest Executive Order Aims to Dismantle Voice of America",
    "description": "President Trump signed an executive order Friday seeking to dismantle seven more federal agencies, including one that oversees Voice of America.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-executive-order-dismantle-voice-of-america-1235297241/",
    "timestamp": "2025-03-15T19:03:22Z"
  },
  {
    "title": "Trump orders attacks against Houthis in Yemen",
    "description": "Trump said the US will use \"lethal force until we have achieved our objective.\"",
    "link": "https://abcnews.go.com/Politics/trump-orders-attacks-houthis-yemen/story?id=119835025",
    "timestamp": "2025-03-15T19:03:00Z"
  },
  {
    "title": "Bill de Blasio argues the 2024 presidential election was 'winnable' for Democrats",
    "description": "Former New York City Mayor Bill de Blasio said on Thursday that the Democratic Party fumbled a “winnable election\" by failing to cite former President Biden’s decline.",
    "link": "https://www.foxnews.com/media/bill-de-blasio-argues-2024-presidential-election-winnable-democrats",
    "timestamp": "2025-03-15T19:00:38Z"
  },
  {
    "title": "The Future of Nigeria's Energy Sector Remains Unclear",
    "description": "Nigeria has long been known for being an oil-rich state, as the biggest fossil fuel producer in Africa. In recent years, the government has increasingly focused on expanding the country’s renewable energy capacity to boost its energy security. However, this m…",
    "link": "https://oilprice.com/Energy/Energy-General/The-Future-of-Nigerias-Energy-Sector-Remains-Unclear.html",
    "timestamp": "2025-03-15T19:00:00Z"
  },
  {
    "title": "Real #diversity should focus on class — not race",
    "description": "Harvard claimed they believed in racial justice, but evidence revealed that it routinely rated Asian American students lower on their personal score which was meant to capture qualities like “integrity,” “courage,” and “empathy.”",
    "link": "https://nypost.com/2025/03/15/opinion/real-diversity-should-focus-on-class-not-race/",
    "timestamp": "2025-03-15T19:00:00Z"
  },
  {
    "title": "Trump launches ‘powerful military action’ against Houthis",
    "description": "US President Donald Trump has announced a military operation against the Yemeni-based Houthi militants demanding they stop attacking ships Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614278-trump-launches-military-action-yemen/",
    "timestamp": "2025-03-15T18:59:32Z"
  },
  {
    "title": "Trump orders strikes on Iran-backed Houthi rebels in Yemen and issues new warning to Iran",
    "description": "WEST PALM BEACH, Fla. (AP) — President Donald Trump said he ordered a series of airstrikes on Yemen’s capital, Sanaa, on Saturday, promising to use “overwhelming lethal force” until Iranian-backed Houthi rebels cease their attacks on shipping along a vital ma…",
    "link": "https://freerepublic.com/focus/f-news/4304507/posts",
    "timestamp": "2025-03-15T18:57:27Z"
  },
  {
    "title": "Trump launches strikes against Yemen's Houthis and warns Iran",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump launched strikes against Yemen's Houthis on Saturday over the group's attacks against ships in the Red Sea, warning if Houthi attacks did not stop \"hell will rain down upon you like nothing you have ever seen…",
    "link": "https://www.thestar.com.my/news/world/2025/03/16/trump-launches-strikes-against-yemen039s-houthis-and-warns-iran",
    "timestamp": "2025-03-15T18:56:00Z"
  },
  {
    "title": "Minnesota Senate Republicans Propose Legislation to Classify ‘Trump Derangement Syndrome’ as a Mental Illness",
    "description": "Minnesota Senate Republicans have introduced legislation to officially classify “Trump Derangement Syndrome” (TDS) as a mental illness under state law. The bill, spearheaded by Republican Senators Eric Lucero, Steve Drazkowski, Walter Hudson, Justin Eichorn, …",
    "link": "https://freerepublic.com/focus/f-bloggers/4304505/posts",
    "timestamp": "2025-03-15T18:55:41Z"
  },
  {
    "title": "Trump orders 'powerful' strikes against Yemen's Houthis",
    "description": "United States President Donald Trump announced he ordered \"powerful\" and \"decisive' military strikes against the Houthis in Yemen, describing them as a terrorist threat that has dis...",
    "link": "https://biztoc.com/x/1bc91eed31bfaa99",
    "timestamp": "2025-03-15T18:54:56Z"
  },
  {
    "title": "Trump launches airstrikes against Houthi rebels in Yemen, says action will be 'powerful'",
    "description": "President Donald Trump initiated airstrikes targeting the Houthi rebels in Yemen on Saturday, according to a Truth Social post.",
    "link": "https://www.foxnews.com/world/trump-announces-decisive-powerful-airstrikes-against-houthi-terrorists-yemen",
    "timestamp": "2025-03-15T18:54:11Z"
  },
  {
    "title": "Trump orders strikes on Iran-backed Houthi rebels in Yemen and issues new warning to Iran",
    "description": "President Trump ordered airstrikes on Yemen's Sanaa, targeting Houthi rebels to protect American shipping and restore navigational freedom. He warned Iran against supporting the Houthis and vowed accountability. The strikes follow Houthi threats to resume att…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-orders-strikes-on-iran-backed-houthi-rebels-in-yemen-and-issues-new-warning-to-iran/articleshow/119054406.cms",
    "timestamp": "2025-03-15T18:54:08Z"
  },
  {
    "title": "Donald Trump Signs Funding Bill to Avoid Government Shutdown",
    "description": "President Donald Trump signed the government funding bill into law on Saturday, avoiding a government shutdown, in a win for the president and Republicans in Congress.\nThe post Donald Trump Signs Funding Bill to Avoid Government Shutdown appeared first on Bre…",
    "link": "https://www.breitbart.com/politics/2025/03/15/donald-trump-signs-funding-bill-avoid-government-shutdown/",
    "timestamp": "2025-03-15T18:53:37Z"
  },
  {
    "title": "Trump Signs Bill Funding the Government for Six Months, Avoiding a Shutdown",
    "description": "The bill largely keeps government funding at levels set during Joe Biden's presidency, though with some changes.",
    "link": "https://time.com/7268637/trump-signs-bill-funding-government-six-months-avoiding-shutdown/",
    "timestamp": "2025-03-15T18:50:05Z"
  },
  {
    "title": "With Trump’s zigzag actions on trade, March came in like a lion",
    "description": "WASHINGTON. March 15: A gobsmacked planet is wondering what’s next from President Donald Trump on the tariff spree he’s set in zigzag motion. In recent weeks, Trump has announced punishing tariffs against allies and adversaries alike, selectively paused and i…",
    "link": "https://thehillstimes.in/business/with-trumps-zigzag-actions-on-trade-march-came-in-like-a-lion",
    "timestamp": "2025-03-15T18:45:00Z"
  },
  {
    "title": "Donald Trump launches strikes against Yemen's Houthis",
    "description": "US President Donald Trump has launched strikes against the Houthis in Yemen.",
    "link": "https://news.sky.com/story/donald-trump-launches-strikes-against-yemens-houthis-13329695",
    "timestamp": "2025-03-15T18:44:00Z"
  },
  {
    "title": "‘His Miserable Life Was Terminated’: US Military Strikes ISIS No. 2 Terrorist Leader Abdallah Makki Muslih al-Rifai",
    "description": "A U.S.-led coalition airstrike killed the second-highest-ranking leader of the Islamic State of Iraq and al-Sham (ISIS) Thursday, authorities announced.",
    "link": "https://dailycaller.com/2025/03/15/united-states-central-command-iraqi-forces-kill-abdallah-makki-muslih-al-rifai-abu-khadijah-islamic-state-isis-airstrike-iraq/",
    "timestamp": "2025-03-15T18:43:29Z"
  },
  {
    "title": "Mexico's president Claudia Sheinbaum is the talk of the town as Donald Trump calls her tough; here's what she has done to earn the President's praise",
    "description": "Claudia Sheinbaum, Mexico’s first female president, earns Trump’s praise for her tough stance on migration and drug trafficking. Initially doubted for her ability to manage U.S.-Mexico relations, Sheinbaum’s strategic leadership impressed Donald Trump, delayi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/mexicos-president-claudia-sheinbaum-is-the-talk-of-the-town-as-donald-trump-calls-her-tough-heres-what-she-has-done-to-earn-the-presidents-praise/articleshow/119050466.cms",
    "timestamp": "2025-03-15T18:41:49Z"
  },
  {
    "title": "Shaquille O'Neal admits he wants to see Stephen A. Smith run for U.S. president",
    "description": "Shaquille O&apos;Neal is quite a character when it comes to making statements, outside of the NBA he has adapted perfectly to television and has shown a lot of charisma in front of",
    "link": "https://www.marca.com/en/basketball/nba/2025/03/15/67d5c85e22601d09158b4595.html",
    "timestamp": "2025-03-15T18:41:35Z"
  },
  {
    "title": "A judge limits Trump's ability to deport people under the 18th century Alien Enemies Act",
    "description": "A federal judge on Saturday blocked the Trump administration from using an 18th century law known as the Alien Enemies Act to deport five Venezuelans...",
    "link": "https://www.yahoo.com/news/judge-limits-trumps-ability-deport-184126243.html",
    "timestamp": "2025-03-15T18:41:26Z"
  },
  {
    "title": "Trump Admin Decision to Axe Advisory Groups May Spell Trouble for Food Safety",
    "description": "The move comes after hospitalizations and deaths from foodborne illnesses more than doubled last year in the US.",
    "link": "https://www.thenewlede.org/2025/03/decision-to-axe-advisory-groups-could-spell-trouble-for-us-food-safety/",
    "timestamp": "2025-03-15T18:38:23Z"
  },
  {
    "title": "Stephen King: US Economy in \"Misery;\" Trump, Musk Are \"Annie Wilkes\"",
    "description": "When POtuS Donald Trump and his resident DOGE-bag Elon Musk aren't containing to turn the U.S. into the world's biggest punchline, they're also blindly chainsawing nearly anything and everything having to do with the U.S. Government (though we're not quite su…",
    "link": "https://bleedingcool.com/tv/stephen-king-us-economy-in-misery-trump-musk-are-annie-wilkes/",
    "timestamp": "2025-03-15T18:37:09Z"
  },
  {
    "title": "‘They Are Sick Degenerates!’ Trump Flips Out On ‘Fake News’ Over Story Putin Kept His Envoy Waiting 9 Hours: ‘They Made Up That Story!”",
    "description": "Donald Trump blew his stack on Saturday over reports claiming that Russian President Vladimir Putin deliberately kept a U.S. envoy waiting as a \"power play.\"\nThe post ‘They Are Sick Degenerates!’ Trump Flips Out On ‘Fake News’ Over Story Putin Kept His Envoy …",
    "link": "https://www.mediaite.com/trump/they-are-sick-degenerates-trump-flips-out-on-fake-news-over-story-putin-kept-his-envoy-waiting-9-hours-they-made-up-that-story/",
    "timestamp": "2025-03-15T18:36:47Z"
  },
  {
    "title": "‘Sick lying bastards’: MTG unloads on media over Trump, Russia",
    "description": "President posted correction to reports claiming Vladimir Putin kept U.S. envoy waiting 9 hours",
    "link": "https://www.wnd.com/2025/03/sick-lying-bastards-mtg-unloads-on-media-over-trump-russia/",
    "timestamp": "2025-03-15T18:32:19Z"
  },
  {
    "title": "Should House, Senate members be allowed to trade stocks?",
    "description": "Nevada members of Congress, including those whose financial disclosures reveal significant trading, say House and Senate members shouldn’t be allowed to trade individual stocks.",
    "link": "https://www.reviewjournal.com/post/3320648",
    "timestamp": "2025-03-15T18:30:34Z"
  },
  {
    "title": "Trump has no time for 'mateship' sentimentality and neither should Australia",
    "description": "When a malignant force bears down on the country, Australians have shown a tendency to swing behind the leader.",
    "link": "https://www.abc.net.au/news/2025-03-16/donald-trump-ukraine-troops-anthony-albanese-peter-dutton/105051788",
    "timestamp": "2025-03-15T18:30:00Z"
  },
  {
    "title": "Trump filmed stumbling up Marine One steps as health fears continue to grow - NewsBreak",
    "description": "People have compared Donald Trump to former President Joe Biden after the new leader of the White House was caught on camera stumbling up steps of his Mari",
    "link": "https://www.newsbreak.com/share/3857318792394-trump-filmed-stumbling-up-marine-one-steps-as-health-fears-continue-to-grow?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3NDIwNjMzNDQ3MzA%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1742063344&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_rank_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v2%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v8",
    "timestamp": "2025-03-15T18:29:29Z"
  },
  {
    "title": "Trump signs a bill funding the government for 6 months, avoiding a shutdown",
    "description": "President Donald Trump has signed legislation funding the government through September, preventing a partial shutdown. The bill keeps funding at levels from Joe Biden's presidency with minor changes, causing division among Democrats but ultimately passing to …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-signs-a-bill-funding-the-government-for-6-months-avoiding-a-shutdown/articleshow/119053794.cms",
    "timestamp": "2025-03-15T18:29:09Z"
  },
  {
    "title": "President Trump signs continuing resolution, officially averting a shutdown",
    "description": "A government shutdown has officially been averted, as President Donald Trump signs the continuing resolution into law.",
    "link": "https://www.foxnews.com/politics/president-trump-signs-continuing-resolution-officially-averting-shutdown",
    "timestamp": "2025-03-15T18:28:52Z"
  },
  {
    "title": "Department of Education cuts expected to have 'huge impacts' on teachers",
    "description": "After the Department of Education gutted nearly 50% of its workforce, educators have expressed deep concern -- not only for students' futures but for their own as well.",
    "link": "https://abcnews.go.com/Politics/department-education-cuts-expected-huge-impacts-teachers/story?id=119801563",
    "timestamp": "2025-03-15T18:26:56Z"
  },
  {
    "title": "New York Senators Chuck Schumer and Kirsten Gillibrand Vote to Prevent a Government Shutdown But Incur Wrath of House Democrats",
    "description": "Fellow Brooklynite, Rep. Hakeem Jeffries ignores questions about the leadership of the Senate Minority leader.",
    "link": "https://www.vanityfair.com/news/story/ny-schumer-gillibrand-incur-wrath-house-democrats",
    "timestamp": "2025-03-15T18:25:15Z"
  },
  {
    "title": "Trump Signs Order to Gut Voice of America, Other Agencies",
    "description": "President Donald Trump signed an executive order on Friday aimed at gutting the parent of U.S. government-funded media outlet Voice of America and six other federal agencies, his administration's latest step to shrink bureaucracy. President Donald Trump signe…",
    "link": "https://freerepublic.com/focus/f-news/4304496/posts",
    "timestamp": "2025-03-15T18:24:06Z"
  },
  {
    "title": "Trump Signs Order to Gut Voice of America, Other Agencies",
    "description": "President Donald Trump signed an executive order on Friday aimed at gutting the parent of U.S. government-funded media outlet Voice of America and six other federal agencies, his administration's latest step to shrink bureaucracy. President Donald Trump signe…",
    "link": "https://freerepublic.com/focus/f-bloggers/4304496/posts",
    "timestamp": "2025-03-15T18:24:06Z"
  },
  {
    "title": "Exclusive: EPA Administrator Lee Zeldin Launches Largest Deregulatory Effort in U.S. History to 'Save Coal, Bring Down Cost of Living'",
    "description": "EPA Administrator Lee Zeldin said it is \"not a binary choice\" to to either protect the environment or grow the economy.\nThe post Exclusive: EPA Administrator Lee Zeldin Launches Largest Deregulatory Effort in U.S. History to ‘Save Coal, Bring Down Cost of Liv…",
    "link": "https://www.breitbart.com/environment/2025/03/15/exclusive-epa-administrator-lee-zeldin-launches-largest-deregulatory-effort-us-history-save-coal-bring-down-cost-living/",
    "timestamp": "2025-03-15T18:23:56Z"
  },
  {
    "title": "Tens of thousands join pro-Europe rally in Rome, amid worries over European Union's plan to rearm",
    "description": "Tens of thousands of Italians have joined a pro-Europe rally in the center of Rome, waving blue European Union flags in a sign of support and unity amid a European push for rearmament that has split the country",
    "link": "https://abcnews.go.com/International/wireStory/tens-thousands-join-pro-europe-rally-rome-amid-119834828",
    "timestamp": "2025-03-15T18:22:43Z"
  },
  {
    "title": "Trump filmed stumbling up Marine One steps as health fears continue to grow - NewsBreak",
    "description": "People have compared Donald Trump to former President Joe Biden after the new leader of the White House was caught on camera stumbling up steps of his Mari",
    "link": "https://www.newsbreak.com/share/3857318792394-trump-filmed-stumbling-up-marine-one-steps-as-health-fears-continue-to-grow?s=a2&amp;share_destination_id=Mjc1NjI4OTE3LTE3NDIwNjI2NzgxOTE%3D&amp;pd=0IeVfhMY&amp;hl=en_US&amp;send_time=1742062678&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-control%2Cns_local_strategy_25q1_exp-v11%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v5",
    "timestamp": "2025-03-15T18:22:36Z"
  },
  {
    "title": "Trump signs GOP’s 6-month government funding bill passed by Congress",
    "description": "President Donald Trump has signed into law legislation funding the government through the end of September, ending the threat of a partial government shutdown and capping off a struggle in Congress that deeply divided Democrats.",
    "link": "https://biztoc.com/x/37de7e4fe77f7d5e",
    "timestamp": "2025-03-15T18:22:08Z"
  },
  {
    "title": "Trump signs GOP’s 6-month government funding bill passed by Congress",
    "description": "President Donald Trump has signed into law legislation funding the government through the end of September, ending the threat of a partial government shutdown and capping off a struggle in Congress that deeply divided Democrats.",
    "link": "https://www.pbs.org/newshour/politics/trump-signs-gops-6-month-government-funding-bill-passed-by-congress",
    "timestamp": "2025-03-15T18:17:57Z"
  },
  {
    "title": "NEWT GINGRICH: The Trump-Johnson-Thune budget victory",
    "description": "Former House Speaker Newt Gingrich writes that President Trump, Senate Majority Leader Thune and House Speaker Johnson pulled off a major political feat by getting the continuing resolution passed.",
    "link": "https://www.foxnews.com/opinion/newt-gingrich-trump-johnson-thune-budget-victory",
    "timestamp": "2025-03-15T18:17:46Z"
  },
  {
    "title": "VIDEO: Sen. Mark Kelly Trades In His Tesla to Protest Trump Admin, Gets Mocked Instantly",
    "description": "Sen. Mark Kelly (D-AZ) received a wave of criticism on Friday when he announced plans to trade in his Tesla to protest Elon Musk and Donald Trump.\nThe post VIDEO: Sen. Mark Kelly Trades In His Tesla to Protest Trump Admin, Gets Mocked Instantly appeared first…",
    "link": "https://www.breitbart.com/politics/2025/03/15/video-so-brave-democrat-senator-mocked-for-trading-in-tesla-to-protest-elon-musk-and-president-trump/",
    "timestamp": "2025-03-15T18:17:12Z"
  },
  {
    "title": "US Democrats Fume As Some In Party Cave To Trump On Spending Bill",
    "description": "Anger was rising in the Democratic ranks Saturday after the party's top US senator led a band of lawmakers in reluctant support of a Republican measure that prevented a government shutdown.",
    "link": "https://www.ibtimes.com/us-democrats-fume-some-party-cave-trump-spending-bill-3766401",
    "timestamp": "2025-03-15T18:12:10Z"
  },
  {
    "title": "US Democrats Fume As Some In Party Cave To Trump On Spending Bill",
    "description": "Anger was rising in the Democratic ranks Saturday after the party's top US senator led a band of lawmakers in reluctant support of a Republican measure that prevented a government shutdown.",
    "link": "https://www.ibtimes.com.au/us-democrats-fume-some-party-cave-trump-spending-bill-1856886",
    "timestamp": "2025-03-15T18:12:07Z"
  },
  {
    "title": "Trump Administration say South Africa's Ambassador to U.S. 'persona non grata'",
    "description": "Secretary of State Marco Rubio says he's kicking out the Ambassador from South Africa -accusing him of hating America and hating Donald Trump.",
    "link": "https://www.npr.org/2025/03/15/nx-s1-5329268/trump-administraiton-south-africas-ambassador-to-u-s-persona-non-grata",
    "timestamp": "2025-03-15T18:11:55Z"
  },
  {
    "title": "Trade War May Boost Airbus Over Boeing — AerCap CEO Says 'No One's Going To Want To Pay That'",
    "description": "In the escalating trade war initiated by President Donald Trump, Boeing Co (NYSE:BA) may face significant challenges, potentially tipping the scales in favor of its European competitor, Airbus SE (OTC:EADSY).\nWhat Happened: The increased tariffs imposed by Tr…",
    "link": "https://biztoc.com/x/be6d076ae6700f0d",
    "timestamp": "2025-03-15T18:11:03Z"
  },
  {
    "title": "CNN Guest Trashes Republican Defense of Trump’s Claim That Negative Media Coverage Is Illegal: ‘This Is Insanity’",
    "description": "Seneca Project founder Tara Setmayer adds that it is \"insane for a president\" to accuse media outlets of \"totally illegal\" practices\nThe post CNN Guest Trashes Republican Defense of Trump’s Claim That Negative Media Coverage Is Illegal: ‘This Is Insanity’ app…",
    "link": "https://www.thewrap.com/cnn-republican-defends-trump-attacks-on-media/",
    "timestamp": "2025-03-15T18:09:28Z"
  },
  {
    "title": "US expels South Africa's ambassador, calling him 'race-baiting' Trump hater",
    "description": "The United States is expelling South African Ambassador Ebrahim Rasool, accusing him of being a race-baiting politician who dislikes America and President Trump. This move highlights the deepening tensions between the U.S. and South Africa, aggravated by disa…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-expels-south-africas-ambassador-calling-him-race-baiting-trump-hater/articleshow/119053226.cms",
    "timestamp": "2025-03-15T18:08:13Z"
  },
  {
    "title": "Amid tensions, Canada says reviewing purchase of US jets",
    "description": "Canada is reviewing a major purchase of US-made F-35 combat planes amid serious tensions with the Trump administration, a spokesperson for the Canadian defense ministry told AFP on Saturday. That announcement came two days after Portugal said it too was reexa…",
    "link": "https://www.digitaljournal.com/world/amid-tensions-canada-says-reviewing-purchase-of-us-jets/article",
    "timestamp": "2025-03-15T18:07:20Z"
  },
  {
    "title": "Heartwarming moment between Trump and Elon Musk’s son ‘Lil X’ goes viral",
    "description": "The image, which was posted to X by the White House, shows Trump giving his signature thumbs up while Musk’s son, X Æ A-12, also known as \"Lil X,\" happily smiling at the cameras as they headed to the famous chopper on Friday.",
    "link": "https://nypost.com/2025/03/15/us-news/heartwarming-moment-of-trump-with-musks-son-lil-x-goes-viral/",
    "timestamp": "2025-03-15T18:04:11Z"
  },
  {
    "title": "Fear of Social Security Cuts Fuel Town Hall Confrontations With Republicans",
    "description": "GOP representatives have increasingly been pressed by constituents over possible Social Security cuts.",
    "link": "https://www.newsweek.com/fear-social-security-cuts-fuel-town-hall-confrontations-republicans-2045429",
    "timestamp": "2025-03-15T18:02:30Z"
  },
  {
    "title": "Everybody believes Ukraine won – Zelensky",
    "description": "Kiev has achieved a major “victory” at the talks with the US in Jeddah by agreeing to a 30-day truce proposal, Vladimir Zelensky has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614276-everybody-believe-ukraine-won-zelensky/",
    "timestamp": "2025-03-15T18:01:57Z"
  },
  {
    "title": "Trump signs order to cut staff at Voice of America and other US-funded media organizations",
    "description": "US President Donald Trump's administration has initiated significant cuts to Voice of America and other pro-democracy programs without congressional approval, targeting agencies like the US Agency for Global Media. The reductions impact several networks inclu…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-signs-order-to-cut-staff-at-voice-of-america-and-other-us-funded-media-organizations/articleshow/119053023.cms",
    "timestamp": "2025-03-15T18:01:39Z"
  },
  {
    "title": "Trump signs order to cut staff at Voice of America, other U.S.-funded media",
    "description": "Trump directed his administration to reduce the functions of several agencies to the minimum required by law.",
    "link": "https://www.cbsnews.com/news/trump-signs-order-to-cut-staff-at-voice-of-america-media/",
    "timestamp": "2025-03-15T18:01:04Z"
  },
  {
    "title": "Trump signs bill to avert government shutdown",
    "description": "United States President Donald Trump signed a bill on Saturday to fund the government through the end of September, preventing a partial shutdown.\nThe continuing resolution will keep funding close to...",
    "link": "https://biztoc.com/x/fe3bdeac94f4b332",
    "timestamp": "2025-03-15T18:00:13Z"
  },
  {
    "title": "Why has checking facts become fuel for the culture wars?",
    "description": "Checking facts is as old as journalism and Donald Trump's political rise has underscored its value. So why have media organisations like Meta changed tack?",
    "link": "https://www.abc.net.au/news/2025-03-16/fact-checking-partisan-media-meta-trump-politics/105046680",
    "timestamp": "2025-03-15T18:00:00Z"
  },
  {
    "title": "Trump signs a bill funding the government for 6 months, avoiding a shutdown",
    "description": "President Donald Trump has signed into law legislation funding the government through the end of September",
    "link": "https://biztoc.com/x/a8b6c5bb025cf8ac",
    "timestamp": "2025-03-15T17:59:47Z"
  },
  {
    "title": "Italian unions worried about job cuts at U.S. military bases",
    "description": "Italian unions are mobilizing against potential job cuts for local staff at U.S. military bases in response to government downsizing plans led by President Trump and Elon Musk. The unions demand clear answers as more than 4,000 Italian civilian personnel, inc…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/italian-unions-worried-about-job-cuts-at-u-s-military-bases/articleshow/119053035.cms",
    "timestamp": "2025-03-15T17:58:54Z"
  },
  {
    "title": "An alternative grand bargain for Trump: Bigger win, greater leverage",
    "description": "The plan to 'give teeth to bilateral, trilateral, and multilateral security cooperation'",
    "link": "https://www.wnd.com/2025/03/an-alternative-grand-bargain-for-trump-bigger-win-greater-leverage/",
    "timestamp": "2025-03-15T17:57:44Z"
  },
  {
    "title": "Trump snaps at 'sick degenerates' in the media for reporting on Putin negotiations delay",
    "description": "A day after Donald Trump used a speech at Department of Justice to call his opponents \"scum\" and then accuse CNN and MSNBC of \"illegal\" behavior,\" he jumped on his Truth Social platform to attack the press some more.Reacting to reports that his envoy was kept…",
    "link": "https://www.rawstory.com/trump-degenerates/",
    "timestamp": "2025-03-15T17:56:08Z"
  },
  {
    "title": "Attack targets Yemeni capital Sana'a, Houthi-run TV says",
    "description": "The United States carried out large-scale military strikes against dozens of Houthi targets in Yemen, two seni",
    "link": "https://www.jpost.com/breaking-news/article-846181",
    "timestamp": "2025-03-15T17:55:52Z"
  },
  {
    "title": "Kubilius: Brussels mulling new military intel satellites",
    "description": "“The European Commission is considering expanding its satellite capacities to improve geospatial intelligence support for security,” EU defense chief tells the FT.",
    "link": "https://www.politico.eu/article/kubilius-commission-mulls-new-military-intel-satellites/",
    "timestamp": "2025-03-15T17:52:01Z"
  },
  {
    "title": "New MassJacker clipper targets pirated software seekers",
    "description": "Pirated software seekers are targeted by the new MassJacker clipper malware, according to CyberArk researchers. A new malware campaign spreading a new clipper malware dubbed MassJacker targets users searching for pirated software, Cyberark users warn. A clipp…",
    "link": "https://securityaffairs.com/175433/malware/new-massjacker-clipper-targets-pirated-software-seekers.html",
    "timestamp": "2025-03-15T17:49:50Z"
  },
  {
    "title": "Trump’s ‘America First’ foreign policy explained",
    "description": "President's 2nd term has ushered in a restoration of the Monroe Doctrine",
    "link": "https://www.wnd.com/2025/03/trumps-america-first-foreign-policy-explained/",
    "timestamp": "2025-03-15T17:49:47Z"
  },
  {
    "title": "Donald Trump Caught Stumbling Up Marine One Steps In New Video Amid Growing Health Concerns - NewsBreak",
    "description": "President Donald Trump stumbled while boarding Marine One, raising fresh questions about his health. The incident, captured on video and widely shared onli",
    "link": "https://www.newsbreak.com/share/3857532860875-donald-trump-caught-stumbling-up-marine-one-steps-in-new-video-amid-growing-health-concerns?s=a7&share_destination_id=MjMyMDY5NTM0LTE3NDIxMzE1Njg2NjI%3D&pd=0Fhjt0mW&hl=en_US&send_time=1742131568&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v12%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v2",
    "timestamp": "2025-03-15T17:49:41Z"
  },
  {
    "title": "Trump signs order to gut voice of America, other agencies",
    "description": "President Donald Trump signed an executive order on Friday to significantly reduce operations of federal agencies, including the Voice of America. The order targets seven entities, aiming to shrink bureaucracy and reduce operations to the legal minimum, follo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-signs-order-to-gut-voice-of-america-other-agencies/articleshow/119052761.cms",
    "timestamp": "2025-03-15T17:48:52Z"
  },
  {
    "title": "South African ambassador 'no longer welcome' in US, Rubio says",
    "description": "The US is expelling South Africa's ambassador to Washington, with Secretary of State Marco Rubio describing him as a \"race-baiting politician\". In a post on X, Rubio accused Ebrahim Rasool of hating the US and President Donald Trump, and said the ambassador w…",
    "link": "https://freerepublic.com/focus/f-news/4304489/posts",
    "timestamp": "2025-03-15T17:46:35Z"
  },
  {
    "title": "Trump signs a bill funding the government for 6 months, avoiding a shutdown",
    "description": "The bill largely keeps government funding at levels set during Joe Biden’s presidency, though with changes.",
    "link": "https://www.wpxi.com/news/local/trump-signs-bill-funding-government-6-months-avoiding-shutdown/7BKP7VLSWFCQFNNHPPOKYX5CCE/",
    "timestamp": "2025-03-15T17:45:27Z"
  }
]