[
  {
    "title": "Trump criticizes 'distorted' portrait in Colorado Capitol",
    "description": "United States President Donald Trump voiced his dissatisfaction with a portrait of himself displayed in the Colorado State Capitol, saying it was \"purposefully distorted.\"\n\"Nobody like...",
    "link": "https://biztoc.com/x/9e9de045dfc0b55a",
    "timestamp": "2025-03-24T03:52:47Z"
  },
  {
    "title": "Why isn’t there an opposition leader to unite Democrats in the US?",
    "description": "Many other democracies have is a central figure to lead the opposition party – and deliver a counter-narrative to the party in power. It’s different in Washington.",
    "link": "https://theconversation.com/why-isnt-there-an-opposition-leader-to-unite-democrats-in-the-us-252384",
    "timestamp": "2025-03-24T03:52:22Z"
  },
  {
    "title": "Russia Ukraine War: Key Developments Since Trump's Inauguration",
    "description": "As more talks on a ceasefire in the Ukraine war are planned for Monday, here are the main developments since US President Donald Trump was inaugurated on January 20, 2025.",
    "link": "https://www.ndtv.com/world-news/russia-ukraine-war-key-developments-since-trumps-inauguration-7995733",
    "timestamp": "2025-03-24T03:46:52Z"
  },
  {
    "title": "White House Claims Yemen Airstrikes Took out Top Houthi Missile Expert",
    "description": "White House National Security Adviser Mike Waltz said in an interview on Sunday airstrikes against Houthi terrorists in Yemen had resulted in the elimination of their \"head missileer,\" among other important terror officials.\nThe post White House Claims Yemen …",
    "link": "https://www.breitbart.com/middle-east/2025/03/23/white-house-claims-yemen-airstrikes-took-out-top-houthi-missile-expert/",
    "timestamp": "2025-03-24T03:44:06Z"
  },
  {
    "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
    "description": "Former U.S. Rep. Mia Love of Utah, a daughter of Haitian immigrants who became the first Black Republican woman elected to Congress, died on Sunday",
    "link": "https://abcnews.go.com/US/wireStory/former-utah-rep-mia-love-black-republican-woman-120085571",
    "timestamp": "2025-03-24T03:42:25Z"
  },
  {
    "title": "Mia Love, GOP’s First Black Woman Elected to Congress, Dies at 49",
    "description": "Love, who battled brain cancer, became the first Black Republican woman elected to Congress in 2014 and represented Utah for two terms.",
    "link": "https://time.com/7271008/mia-love-utah-republican-congresswoman-brain-cancer-obituary/",
    "timestamp": "2025-03-24T03:40:00Z"
  },
  {
    "title": "US alleges Columbia student covered up his work for UNRWA",
    "description": "A March 17 document in his deportation case informed Khalil he could be removed because he failed to disclose that he was a political officer of UNRWA in 2023.",
    "link": "https://www.jpost.com/breaking-news/article-847320",
    "timestamp": "2025-03-24T03:34:12Z"
  },
  {
    "title": "US alleges Columbia student covered up his work for UNRWA",
    "description": "The U.S. government has alleged that Columbia University student and pro-Palestinian demonstrator Mahmoud Khalil withheld that he worked for a United Nations...",
    "link": "https://www.yahoo.com/news/us-alleges-columbia-student-covered-033356211.html",
    "timestamp": "2025-03-24T03:33:56Z"
  },
  {
    "title": "Former Utah Rep. Mia Love, The First Black Republican Woman Elected To The US House, Has Died",
    "description": "Former U.S. Rep. Mia Love of Utah, a daughter of Haitian immigrants who became the first Black Republican woman elected to Congress, died on Sunday.",
    "link": "https://www.huffpost.com/entry/mia-love-dead_n_67e0d0ebe4b0806f890ea361",
    "timestamp": "2025-03-24T03:29:48Z"
  },
  {
    "title": "Remembering George Foreman",
    "description": "Foreman, US President Donald Trump stated in a tribute on his Truth Social account, had the 'heaviest and biggest punch in the history of boxing'. Foreman, Trump added, was a 'great person, with a personality that was bigger than life.'",
    "link": "https://www.rediff.com/sports/report/remembering-george-foreman/20250324.htm",
    "timestamp": "2025-03-24T03:29:27Z"
  },
  {
    "title": "Billion-Dollar US Levies On Chinese Ships Risk ‘Trade Apocalypse’",
    "description": "By Laura Curtis, Weilun Soon and James Attwood Mar 23, 2025 (Bloomberg) –For a symbol of the chaos engulfing world trade since the Trump administration walked into the White House, look...",
    "link": "https://gcaptain.com/billion-dollar-us-levies-on-chinese-ships-risk-trade-apocalypse/",
    "timestamp": "2025-03-24T03:28:46Z"
  },
  {
    "title": "Hannah Einbinder Condemns Israel's 'Massacre' of Palestinians",
    "description": "The 'Hacks' star spoke out while being honored by the Human Rights Campaign, adding, \"I see it as antithetical to our deepest Jewish traditions to fall in line and not question the actions of a state enacting atrocities in our name.\"",
    "link": "http://www.hollywoodreporter.com/news/general-news/hannah-einbinder-israel-massacre-palestinians-hrc-1236170941/",
    "timestamp": "2025-03-24T03:27:59Z"
  },
  {
    "title": "Carney Warns Trump ‘Wants to Break Us’ as High-Stakes Canadian Election Begins",
    "description": "Mark Carney began his bid for election with a stark warning that US President Donald Trump is serious about wanting to annex Canada, launching his effort to convince Canadians he can protect the country from US aggression.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-warns-trump-wants-to-break-us-as-high-stakes-canadian-election-begins",
    "timestamp": "2025-03-24T03:27:55Z"
  },
  {
    "title": "Trump gives Harris advice on potential CA governor run (Michael Lee/Fox News)",
    "description": "Michael Lee / Fox News:\nTrump gives Harris advice on potential CA governor run  —  Harris' name has been floated as a potential candidate for governor of California  —  President Donald Trump offered up some advice for former Vice President Kamala Harris if s…",
    "link": "https://www.memeorandum.com/250323/p68",
    "timestamp": "2025-03-24T03:25:01Z"
  },
  {
    "title": "Belgian FM: EU should fight fire with fire in Trump’s trade war",
    "description": "Targeting Big Tech could be among the EU’s options to hit Washington where it hurts, Belgium’s foreign minister says.",
    "link": "https://www.politico.eu/article/belgian-eu-donald-trump-trade-war-tariffs-america-washington/",
    "timestamp": "2025-03-24T03:19:00Z"
  },
  {
    "title": "Wisconsin Supreme Court race; candidates hit the campaign trail",
    "description": "In less than 10 days, Wisconsin voters will go to the polls for the state's April 1 election.",
    "link": "https://www.fox6now.com/news/wisconsin-supreme-court-race-candidates-hit-campaign-trail",
    "timestamp": "2025-03-24T03:18:50Z"
  },
  {
    "title": "Musk's Balancing Act Goes Viral, Internet Praises Him For Being Himself",
    "description": "In a viral video, Elon Musk is seen attempting to balance a fork and two spoons on the tip of his finger.",
    "link": "https://www.ndtv.com/world-news/elon-musks-balancing-act-goes-viral-internet-praises-him-for-being-himself-7995580",
    "timestamp": "2025-03-24T03:17:22Z"
  },
  {
    "title": "‘Tell Your People To Stop Firebombing’ Tesla Facilities, Fox Host Tells Democratic Strategist",
    "description": "Fox News’ Jesse Watters on Friday evening urged Democratic Party strategist and fellow Fox panelist Jessica Tarlov to tell her “people” to “stop firebombing” Tesla facilities. Protests against billionaire Elon Musk and his electric vehicle company Tesla erupt…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306360/posts",
    "timestamp": "2025-03-24T03:17:14Z"
  },
  {
    "title": "U.S. delegation to visit Greenland as Trump talks of takeover",
    "description": "Trump has made the U.S. annexation of Greenland a major talking point since taking office for a second time on Jan. 20.",
    "link": "https://www.japantimes.co.jp/news/2025/03/24/world/politics/us-delegation-greenland-trump/",
    "timestamp": "2025-03-24T03:11:00Z"
  },
  {
    "title": "Trump targets lawyers who he says file 'frivolous' lawsuits against his administration",
    "description": "A new memo from Trump authorizes the attorney general and the homeland security secretary to sanction law firms that file lawsuits they deem “frivolous.\"",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-targets-lawyers-frivolous-lawsuits-administration-rcna197698",
    "timestamp": "2025-03-24T03:08:59Z"
  },
  {
    "title": "Comics Skewer Donald Trump’s Kennedy Center Takeover As Conan O’Brien Accepts Its Mark Twain Prize",
    "description": "As he presented the Mark Twain Prize to Conan O’Brien at the end of a ceremony at the Kennedy Center this evening, David Letterman said to the audience, “I’m not a historian, but I believe that history will show, in history for all time, this will have been t…",
    "link": "http://deadline.com/2025/03/conan-obrien-trump-kennedy-center-1236347437/",
    "timestamp": "2025-03-24T03:07:34Z"
  },
  {
    "title": "Asian markets fluctuate as traders prepare for ‘Liberation Day’",
    "description": "Asian markets swung on Monday as the White House prepares to impose tariffs on key trading partners next week that many fear could deal a painful blow to the global economy. A report saying US President Donald Trump was considering a more targeted approach to…",
    "link": "https://www.digitaljournal.com/world/asian-markets-fluctuate-as-traders-prepare-for-liberation-day/article",
    "timestamp": "2025-03-24T03:07:32Z"
  },
  {
    "title": "Asian Markets Fluctuate As Traders Prepare For 'Liberation Day'",
    "description": "Asian markets swung on Monday as the White House prepares to impose tariffs on key trading partners next week that many fear could deal a painful blow to the global economy.",
    "link": "https://www.ibtimes.com/asian-markets-fluctuate-traders-prepare-liberation-day-3767367",
    "timestamp": "2025-03-24T03:06:15Z"
  },
  {
    "title": "Former Republican Congresswoman Mia Love Dead at 49",
    "description": "Mia Love, the former Republican congresswoman from Utah's 4th district, passed away on Sunday at the age of 49 following a multiyear battle with brain cancer.\nThe post Former Republican Congresswoman Mia Love Dead at 49 appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/23/former-republican-congresswoman-mia-love-dead-49/",
    "timestamp": "2025-03-24T03:04:33Z"
  },
  {
    "title": "Gaps In US, Russian Expectations As Ukraine Peace Deal Talks Begin In Saudi",
    "description": "US and Ukrainian officials met in Saudi Arabia on Sunday night for &quot;productive and focused&quot; talks on de-escalating the war with Russia, with Washington hoping for &quot;real progress&quot; even as Moscow warned of &quot;difficult negotiations&quot; …",
    "link": "https://www.ndtv.com/world-news/gulf-in-us-russian-expectations-as-ukraine-peace-deal-talks-begin-in-saudi-7995523",
    "timestamp": "2025-03-24T03:03:21Z"
  },
  {
    "title": "Why was Elon playing with forks at White House dinner?",
    "description": "As Twitter/X owner Elon Musk continues to cosy up to US president Donald Trump and his second administration, a number of videos of the billionaire have gone viral online. The latest one involves a fork and two spoons.Musk, who’s currently in a spot of bother…",
    "link": "https://www.indy100.com/politics/elon-musk-forks-spoons-white-house",
    "timestamp": "2025-03-24T03:01:39Z"
  },
  {
    "title": "Carney calls April election in Canada, seeking mandate to face down Trump...",
    "description": "Carney calls April election in Canada, seeking mandate to face down Trump...\r\n\n \n \n \n (First column, 17th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'He wants to break us'...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://www.yahoo.com/news/carney-calls-april-election-canada-163701544.html",
    "timestamp": "2025-03-24T03:01:39Z"
  },
  {
    "title": "Postal service workers rally against privatization...",
    "description": "A renewed push from President Donald Trump to privatize the United States Postal Service (USPS) has sparked concern among postal workers.",
    "link": "https://wjla.com/news/local/possible-take-over-of-usps-by-trump-administration-united-states-postal-service-rally-president-donald-trump-doge-elon-musk-federal-workers-mail-agency-department-of-government-efficiency-cuts",
    "timestamp": "2025-03-24T03:01:39Z"
  },
  {
    "title": "Man arrested after firing stun gun at crowd...",
    "description": "Man arrested after firing stun gun at crowd...\r\n\n \n \n \n (First column, 13th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:FBI Warns Americans to 'Exercise Vigilance' at TESLA Dealerships...",
    "link": "http://www.berkeleyside.org/2025/03/22/berkeley-trump-supporter-tesla-protest-fourth-street-arrest",
    "timestamp": "2025-03-24T03:01:39Z"
  },
  {
    "title": "'He wants to break us'...",
    "description": "'He wants to break us'...\r\n\n \n \n \n (First column, 18th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Carney calls April election in Canada, seeking mandate to face down Trump...",
    "link": "https://www.yahoo.com/news/under-threat-trump-canada-set-013052629.html",
    "timestamp": "2025-03-24T03:01:39Z"
  },
  {
    "title": "Noem to visit El Salvador prison that took in hundreds of deported criminals: 'Clear message'",
    "description": "FIRST ON FOX: Secretary of Homeland Security Kristi Noem is planning to visit several spots in Central America next week – including El Salvador's Terrorism Confinement Center, where hundreds of migrant criminals were famously deported last week. On Sunday, D…",
    "link": "https://freerepublic.com/focus/f-news/4306357/posts",
    "timestamp": "2025-03-24T03:00:11Z"
  },
  {
    "title": "Bitcoin bottom forming as Fed eases, Trump softens on tariffs: Analyst",
    "description": "Bitcoin may have bottomed and could rebound toward $90,000 after US President Donald Trump signaled a willingness to ease tariffs and the Federal Reserve resisted short-term pressure last week, according to a crypto analyst.“Bitcoin is attempting to form a bo…",
    "link": "https://cointelegraph.com/news/bitcoin-bottom-as-trump-fed-make-adjustments-10x-research",
    "timestamp": "2025-03-24T02:55:02Z"
  },
  {
    "title": "US Delegation Aims For Maritime Ceasefire In The Black Sea",
    "description": "By Pesha Magid and Pavel Polityuk RIYADH/KYIV, March 24 (Reuters) – A U.S. delegation will seek progress toward a Black Sea ceasefire and a broader cessation of violence in the war in Ukraine when it...",
    "link": "https://gcaptain.com/us-delegation-aims-for-maritime-ceasefire-in-the-black-sea/",
    "timestamp": "2025-03-24T02:45:56Z"
  },
  {
    "title": "Trump Meme Coin Spikes, Retreats After POTUS Takes To Truth Social For 'Greatest of Them All' Post — Whale Takes Losses",
    "description": "Official Trump (CRYPTO: TRUMP) dramatically surged Sunday after none other than President Donald Trump promoted the meme coin on social media.\nWhat happened: The Solana (CRYPTO: SOL)-based token ripped over 11% within an hour after Trump posted from his Truth…",
    "link": "https://biztoc.com/x/4f3d588c0b201e67",
    "timestamp": "2025-03-24T02:45:32Z"
  },
  {
    "title": "US-Russia talks on Ukraine to begin in Saudi Arabia",
    "description": "<p>RIYADH (SAUDI ARABIA) - US and Russian officials meet in Saudi Arabia on Monday for talks on a partial ceasefire in the Ukraine war, a day after delegates from Washington and Kyiv had their own discussions.</p>",
    "link": "https://www.bangkokpost.com/world/2986221/us-russia-talks-on-ukraine-to-begin-in-saudi-arabia",
    "timestamp": "2025-03-24T02:45:00Z"
  },
  {
    "title": "‘Truly the Worst!’ Trump Trashes His Own ‘Distorted’ CO Portrait, Blames ‘Radical Left’ Gov. Jared Polis: ‘Should Be Ashamed of Himself’",
    "description": "Side by side images show Colorado portraits of Obama and Trump by the same artist. Trump claims his is deliberately \"distorted\" and attacked Gov. Polis over it.\nThe post ‘Truly the Worst!’ Trump Trashes His Own ‘Distorted’ CO Portrait, Blames ‘Radical Left’ G…",
    "link": "https://www.mediaite.com/trump/truly-the-worst-trump-trashes-his-own-distorted-co-portrait-blames-radical-left-gov-jared-polis-should-be-ashamed-of-himself/",
    "timestamp": "2025-03-24T02:38:00Z"
  },
  {
    "title": "Trump revokes security clearances for Kamala Harris, Hillary Clinton",
    "description": "WASHINGTON, March 22 (Xinhua) -- U.S. President Donald Trump on Friday revoked security clearances f",
    "link": "http://en.people.cn/n3/2025/0324/c90000-20292957.html",
    "timestamp": "2025-03-24T02:33:20Z"
  },
  {
    "title": "Who is Han Duck-soo, South Korea's PM who returns as acting leader?",
    "description": "Prime Minister Han Duck-soo, a seasoned technocrat, briefly served as South Korea's acting president until his impeachment, which the Constitutional Court later overturned. Han's extensive experience under five presidents and his commitment to staying apoliti…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/who-is-han-duck-soo-south-koreas-pm-who-returns-as-acting-leader/articleshow/119401819.cms",
    "timestamp": "2025-03-24T02:30:41Z"
  },
  {
    "title": "US envoy Steve Witkoff hopeful of peace deal as Americans hold talks with Ukraine in Saudi Arabia",
    "description": "Ukrainian and US delegations yesterday discussed proposals to protect energy facilities and critical infrastructure, Ukraine’s defence minister said, part of a diplomatic push by US president Donald Trump to end three years of war.",
    "link": "https://www.independent.ie/world-news/us-envoy-steve-witkoff-hopeful-of-peace-deal-as-americans-hold-talks-with-ukraine-in-saudi-arabia/a1660524155.html",
    "timestamp": "2025-03-24T02:30:00Z"
  },
  {
    "title": "Canadian prime minister Mark Carney calls snap election, saying Donal Trump wants to ‘break’ the country",
    "description": "New Canadian prime minister Mark Carney yesterday called a snap election for April 28, saying he needed a strong mandate to deal with the threat posed by US president Donald Trump, who “wants to break us so America can own us”.",
    "link": "https://www.independent.ie/world-news/north-america/canadian-prime-minister-mark-carney-calls-snap-election-saying-donal-trump-wants-to-break-the-country/a23399460.html",
    "timestamp": "2025-03-24T02:30:00Z"
  },
  {
    "title": "Trump Says His Meme Coin is 'Greatest of Them All,' Price Soars",
    "description": "Trump's social media endorsement triggered an immediate spike, even as the token's ownership structure raises conflict of interest concerns.",
    "link": "https://decrypt.co/311294/trump-says-his-meme-coin-is-greatest-of-them-all-price-soars",
    "timestamp": "2025-03-24T02:26:24Z"
  },
  {
    "title": "China reassures Apple, Pfizer, Cargill, others of business potential",
    "description": "Vice Premier He Lifeng assured major foreign companies like Apple, Pfizer, and Mastercard of China's commitment to improving its business environment. He highlighted the economy's resilience while meeting with business leaders. This comes as China seeks to at…",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-reassures-apple-pfizer-cargill-others-of-business-potential/articleshow/119401670.cms",
    "timestamp": "2025-03-24T02:25:39Z"
  },
  {
    "title": "Zelensky Regime Likely to Collapse Soon - Economist Sachs",
    "description": "NEW YORK (RIA Novosti), Lenka White - The government of the Ukraine's Volodymyr Zelensky will probably be replaced soon as it does not have enough public support and is corrupt, renowned American economist and Columbia University professor Jeffrey Sachs told …",
    "link": "https://sputnikglobe.com/20250324/zelensky-regime-likely-to-collapse-soon---economist-sachs-1121676234.html",
    "timestamp": "2025-03-24T02:24:00Z"
  },
  {
    "title": "Malaysian tech stocks slammed by Trump, then by DeepSeek",
    "description": "KUALA LUMPUR -- Malaysia's semiconductor sector finds itself in the midst of significant upheaval, grappling with two challenges: the rapid rise of DeepSeek -- China's artificial intelligence model -- and the reintroduction of U.S. protectionist trade policie…",
    "link": "https://biztoc.com/x/8cefbb50346caa35",
    "timestamp": "2025-03-24T02:23:27Z"
  },
  {
    "title": "Tesla trade-ins at highest levels ever while consumers boycott Musk",
    "description": "Tesla is facing an unprecedented boycott.\nProtests at showrooms and acts of vandalism against Tesla vehicles have popped up around the world due to CEO Elon Musk's affiliation with President Donald Trump and other far-right parties. Musk has also been a drivi…",
    "link": "https://biztoc.com/x/21deb4c76ca1ee42",
    "timestamp": "2025-03-24T02:23:12Z"
  },
  {
    "title": "US-Russia talks on Ukraine to begin in Saudi Arabia",
    "description": "US and Russian officials meet in Saudi Arabia on Monday for talks on a partial ceasefire in the Ukraine war, a day after delegates from Washington and Kyiv had their own discussions. US President Donald Trump is pushing for a rapid end to the three-year war a…",
    "link": "https://www.digitaljournal.com/world/us-russia-talks-on-ukraine-to-begin-in-saudi-arabia/article",
    "timestamp": "2025-03-24T02:18:23Z"
  },
  {
    "title": "US-Russia Talks On Ukraine To Begin In Saudi Arabia",
    "description": "US and Russian officials meet in Saudi Arabia on Monday for talks on a partial ceasefire in the Ukraine war, a day after delegates from Washington and Kyiv had their own discussions.",
    "link": "https://www.ibtimes.com/us-russia-talks-ukraine-begin-saudi-arabia-3767363",
    "timestamp": "2025-03-24T02:18:18Z"
  },
  {
    "title": "Tiger Woods Confirms His Relationship With Vanessa Trump, Ex-Wife of Don Jr.",
    "description": "Vanessa is the ex-wife of Don Jr. and the mother of the President’s granddaughter Kai, who is an avid golfer and attends the same school as Woods’ two children.",
    "link": "https://time.com/7270976/tiger-woods-vanessa-trump-relationship-don-jr-ex-wife-kai/",
    "timestamp": "2025-03-24T02:15:00Z"
  },
  {
    "title": "Trump's firing of FTC commissioners speaks volumes about his love for billionaires",
    "description": "Donald Trump illegally fired the two Democratic members at the Federal Trade Commission earlier this week in a move that violates Supreme Court precedent. MSNBC's Ayman Mohyeldin speaks with Alvaro Bedoya, one of the affected FTC commissioners, about what thi…",
    "link": "https://biztoc.com/x/c56c1826a736b113",
    "timestamp": "2025-03-24T02:12:01Z"
  },
  {
    "title": "Australia to speed up $1 billion in defence spending in budget, says defence minister",
    "description": "Australia will bring forward A$1 billion in defence spending in Tuesday's federal budget to boost its military capability, including guided weapons...",
    "link": "https://www.yahoo.com/news/australia-speed-1-billion-defence-020232461.html",
    "timestamp": "2025-03-24T02:02:32Z"
  },
  {
    "title": "Revised Beneficial Ownership Information (BOI) Rule Exempts U.S. Companies From Reporting",
    "description": "U.S. businesses no longer have to comply with the beneficial ownership information (BOI) reporting filing requirements of the Corporate Transparency Act (CTA).",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/03/23/revised-beneficial-ownership-information-boi-rule-exempts-us-companies-from-reporting/",
    "timestamp": "2025-03-24T02:01:46Z"
  },
  {
    "title": "Jessica Aber, who resigned after President Trump took office was found dead: Who was she?",
    "description": "Jessica Aber, former U.S. attorney for the Eastern District of Virginia, passed away at 43. Her death is under investigation, though early reports suggest natural causes. Aber resigned on the day of Donald Trump's second inauguration, and was praised for her …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/all-about-jessica-aber-former-federal-prosecutor-resigning-after-president-trump-took-office-and-was-found-dead-in-home/articleshow/119400897.cms",
    "timestamp": "2025-03-24T02:01:33Z"
  },
  {
    "title": "'Hit pieces': Trump melts down over 'Maggot Hagerman' and 'deranged' NYT editors",
    "description": "Donald Trump on Sunday berated a familiar target of his: the New York Times.\n\nSpecifically, the President took to his own social media site, Truth Social, to attack journalist Maggie Haberman. Recently, Trump attacked Haberman after she reported on purported …",
    "link": "https://www.rawstory.com/trump-hit-pieces-nyt-editors/",
    "timestamp": "2025-03-24T02:01:28Z"
  },
  {
    "title": "'Pawn Stars' Rick Harrison recalls the one time Trump apologized to him: 'This is all my fault'",
    "description": "\"Pawn Stars\" boss Rick Harrison remembered a time when President Donald Trump apologized for the way Secret Service blocked him from a congressional rally.",
    "link": "https://www.foxnews.com/entertainment/pawn-stars-rick-harrison-recalls-one-time-trump-apologized-him-this-all-my-fault",
    "timestamp": "2025-03-24T02:01:09Z"
  },
  {
    "title": "The world according to Grok: India must keep trade issues apart from free speech",
    "description": "Irony may seem writ large in a legal move made by Elon Musk’s X in India amid a dust-up over his AI chatbot. We must keep matters of free speech out of trade talks with the US. What Grok can or can’t say is for India’s judiciary to determine.",
    "link": "https://www.livemint.com/opinion/online-views/india-donald-trump-elon-musk-tesla-spacex-xai-india-us-relations-reciprocal-tariffs-free-speech-us-tariffs-indian-export-11742734723023.html",
    "timestamp": "2025-03-24T02:00:06Z"
  },
  {
    "title": "Dollar drifts as traders await Trump tariff clarity",
    "description": "Global exchange rates fluctuate as traders await U.S. tariff announcements. The dollar remains strong near a three-week high, influenced by rising Treasury yields, while the euro and yen show minor shifts. Goldman Sachs analysts predict some dollar strength d…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-drifts-as-traders-await-trump-tariff-clarity/articleshow/119400848.cms",
    "timestamp": "2025-03-24T01:55:21Z"
  },
  {
    "title": "Iran under threat: Is Trump preparing for decisive action?",
    "description": "What a beautiful image it is – when the embassies of Israel and the United States once again raise their flags in free Tehran.",
    "link": "https://www.jpost.com/opinion/article-847223",
    "timestamp": "2025-03-24T01:50:37Z"
  },
  {
    "title": "US allies in Europe want answers over unspent USAID money",
    "description": "Sweden, Norway and the Netherlands have contact US officials asking for their unspent contributions to USAID — a program Donald Trump has halted — to be refunded.",
    "link": "https://www.abc.net.au/news/2025-03-24/americas-european-allies-want-unspent-usaid-money-back/105088146",
    "timestamp": "2025-03-24T01:49:31Z"
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump in a social media post | CNN",
    "description": "Tiger Woods has confirmed his relationship with the former daughter-in-law of President Donald Trump, publishing two images to social media in a post that said, “Love is in the air.”",
    "link": "https://www.cnn.com/2025/03/23/sport/tiger-woods-vanessa-trump-spt/index.html",
    "timestamp": "2025-03-24T01:47:49Z"
  },
  {
    "title": "Futures buoyant, dollar drifts as markets sail toward tariff storm",
    "description": "Financial markets made an mixed start on Monday with U.S. stock futures rising but the dollar wavering ahead of a week driven by data, Chinese earnings and...",
    "link": "https://finance.yahoo.com/news/futures-buoyant-dollar-drifts-markets-014640185.html",
    "timestamp": "2025-03-24T01:46:40Z"
  },
  {
    "title": "OSU's Wyatt Hendrickson celebrates NCAA win with President Trump",
    "description": "OSU's Wyatt Hendrickson celebrates NCAA win with President Trumpkoco.com",
    "link": "https://www.koco.com/article/osu-wyatt-hendrickson-salutes-president-donald-trump-ncaa-wrestling/64266307",
    "timestamp": "2025-03-24T01:45:34Z"
  },
  {
    "title": "Trump's US migrant hunt spares no one from deportation",
    "description": "<p>SPRING, United States - Franco Caraballo was arrested while at a US immigration center for an appointment. Shirly Guardado was detained while at work. Camila Munoz was taken into custody on her way home from her honeymoon.</p>",
    "link": "https://www.bangkokpost.com/world/2986180/trumps-us-migrant-hunt-spares-no-one-from-deportation",
    "timestamp": "2025-03-24T01:45:00Z"
  },
  {
    "title": "What did Donald Trump Jr. say about Vanessa Trump and Tiger Woods' relationship?",
    "description": "It has been confirmed what until today were simply rumors. The Paparazzi were behind it, but for Tiger Woods it was time to make it official, but above all public. The golf legend",
    "link": "https://www.marca.com/en/golf/2025/03/24/67e0b5cd46163fc1a68b4574.html",
    "timestamp": "2025-03-24T01:42:04Z"
  },
  {
    "title": "Tiger Woods confirms Vanessa Trump romance",
    "description": "Tiger Woods took the unusual step of confirming his romance with Donald Trump's former daughter-in-law on Sunday in a brief post on social media. Golf superstar Woods -- renowned for jealously guarding his private life over the years -- confirmed in a post on…",
    "link": "https://japantoday.com/category/sports/%27love-is-in-the-air%27-woods-confirms-vanessa-trump-romance",
    "timestamp": "2025-03-24T01:41:25Z"
  },
  {
    "title": "EU afraid Trump could cut off weapons support – WaPo",
    "description": "EU officials are concerned that Donald Trump could stop helping to maintain US-supplied weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614677-eu-afraid-trump-could-cut/",
    "timestamp": "2025-03-24T01:36:45Z"
  },
  {
    "title": "Dollar coasts as traders await Trump tariff clarity",
    "description": "TOKYO :The dollar drifted just below a three-week high versus major peers on Monday as traders cautiously awaited clarity on U.S. President Donald Trump's next round of tariffs.The euro rose slightly following three straight sessions of declines, while the ye…",
    "link": "https://www.channelnewsasia.com/business/dollar-coasts-traders-await-trump-tariff-clarity-5019686",
    "timestamp": "2025-03-24T01:32:26Z"
  },
  {
    "title": "Dollar drifts as traders await Trump tariff clarity",
    "description": "TOKYO : The dollar drifted just below a three-week high versus major peers on Monday as traders cautiously awaited clarity on U.S. President Donald Trump's next round of tariffs.The euro rose slightly following three straight sessions of declines, while the y…",
    "link": "https://www.channelnewsasia.com/business/dollar-drifts-traders-await-trump-tariff-clarity-5019686",
    "timestamp": "2025-03-24T01:32:26Z"
  },
  {
    "title": "Dollar gains on improving US business activity, tariff optimism",
    "description": "NEW YORK (Reuters) -The dollar jumped to multi-week highs against the euro and yen on Monday after data showed U.S. business activity picked up in March and ...",
    "link": "https://finance.yahoo.com/news/dollar-drifts-traders-await-trump-013226782.html",
    "timestamp": "2025-03-24T01:32:26Z"
  },
  {
    "title": "US Second Lady Usha Vance to visit Greenland",
    "description": "JD Vance's wife, Second Lady Usha Vance, will travel to Greenland on Thursday. US President Donald Trump has said he wants to take control of the mineral-rich, autonomous Danish territory.",
    "link": "https://www.dw.com/en/us-second-lady-usha-vance-to-visit-greenland/a-72013993",
    "timestamp": "2025-03-24T01:30:00Z"
  },
  {
    "title": "Canada's Carney calls snap election, saying Trump wants to break Canada",
    "description": "In calling the election now, Carney is hoping to capitalize on a remarkable recovery by his Liberal Party in the polls since January.",
    "link": "https://www.japantimes.co.jp/news/2025/03/24/world/politics/canada-carney-snap-election/",
    "timestamp": "2025-03-24T01:28:00Z"
  },
  {
    "title": "France’s Dassault says upping Rafale warplane output",
    "description": "France’s Dassault Aviation is looking to ramp up production of its Rafale combat planes, its CEO said on Sunday, after President Emmanuel Macron said the country would increase orders. European countries including France have been seeking to boost defence spe…",
    "link": "https://www.digitaljournal.com/world/frances-dassault-says-upping-rafale-warplane-output/article",
    "timestamp": "2025-03-24T01:27:32Z"
  },
  {
    "title": "Trump's US Migrant Hunt Spares No One From Deportation",
    "description": "Franco Caraballo was arrested while at a US immigration center for an appointment.",
    "link": "https://www.ibtimes.com/trumps-us-migrant-hunt-spares-no-one-deportation-3767360",
    "timestamp": "2025-03-24T01:27:22Z"
  },
  {
    "title": "Hijacking News: Fake Media Sites Sow Ukraine Disinformation",
    "description": "A fake news website falsely claimed that Ukraine's president is paying Western reporters to tarnish US President Donald Trump -- part of a series of deceptive reports spread by Russian-linked portals mimicking media outlets.",
    "link": "https://www.ibtimes.com/hijacking-news-fake-media-sites-sow-ukraine-disinformation-3767357",
    "timestamp": "2025-03-24T01:27:20Z"
  },
  {
    "title": "Trump's US Migrant Hunt Spares No One From Deportation",
    "description": "Franco Caraballo was arrested while at a US immigration center for an appointment.",
    "link": "https://www.ibtimes.com.au/trumps-us-migrant-hunt-spares-no-one-deportation-1857157",
    "timestamp": "2025-03-24T01:27:18Z"
  },
  {
    "title": "David's goal helps Canadian men past United States to finish 3rd in CONCACAF Nations League",
    "description": "Canada leaves the CONCACAF Nations League with a third-place finish — and a smile after defeating the United States 2-1 on Sunday.",
    "link": "https://www.cbc.ca/sports/soccer/concacaf-nations-league-canada-united-states-third-place-1.7491387",
    "timestamp": "2025-03-24T01:23:05Z"
  },
  {
    "title": "Hijacking news: Fake media sites sow Ukraine disinformation",
    "description": "A fake news website falsely claimed that Ukraine’s president is paying Western reporters to tarnish US President Donald Trump — part of a series of deceptive reports spread by Russian-linked portals mimicking media outlets. The disinformation tactic, amid hei…",
    "link": "https://www.digitaljournal.com/world/hijacking-news-fake-media-sites-sow-ukraine-disinformation/article",
    "timestamp": "2025-03-24T01:22:49Z"
  },
  {
    "title": "'Love is in the air': Tiger Woods confirms his relationship with Donald Trump Jr.’s ex-wife Vanessa Trump",
    "description": "Tiger Woods confirmed his relationship with Vanessa Trump, publishing photos on social media. Woods, known for keeping his personal life private, has requested privacy. The announcement comes after Woods ruptured his Achilles tendon, sidelining him for the Ma…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/love-is-in-the-air-tiger-woods-confirms-his-relationship-with-donald-trump-jr-s-ex-wife-vanessa-trump/articleshow/119400068.cms",
    "timestamp": "2025-03-24T01:22:34Z"
  },
  {
    "title": "Trump’s US migrant hunt spares no one from deportation",
    "description": "Franco Caraballo was arrested while at a US immigration center for an appointment. Shirly Guardado was detained while at work. Camila Munoz was taken into custody on her way home from her honeymoon. US President Donald Trump’s hunt for migrants to expel from …",
    "link": "https://www.digitaljournal.com/world/trumps-us-migrant-hunt-spares-no-one-from-deportation/article",
    "timestamp": "2025-03-24T01:22:20Z"
  },
  {
    "title": "P2P lending in slow lane; HCL-Foxconn’s new hunt",
    "description": "Happy Monday! The central bank’s regulatory sword hangs heavy on the peer-to-peer (P2P) lending sector. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/p2p-lending-in-slow-lane-hcl-foxconns-new-hunt/articleshow/119399377.cms",
    "timestamp": "2025-03-24T01:22:14Z"
  },
  {
    "title": "Hijacking news: Fake media sites sow Ukraine disinformation",
    "description": "A fake news website falsely claimed that Ukraine's president is paying Western reporters to tarnish US President Donald Trump -- part of a series of...",
    "link": "https://www.yahoo.com/news/hijacking-news-fake-media-sites-012025969.html",
    "timestamp": "2025-03-24T01:20:25Z"
  },
  {
    "title": "Clinton Pollster Mark Penn Says the Dem Party Is in Ruins",
    "description": "On Friday, former Clinton pollster Mark Penn told Fox News host Sean Hannity that key voter groups are fleeing the Democratic Party. He says the Democrat Party is in ruins. The Democratic Party’s favorability rating plummeted to a new low of 29%, according to…",
    "link": "https://freerepublic.com/focus/f-bloggers/4306337/posts",
    "timestamp": "2025-03-24T01:19:00Z"
  },
  {
    "title": "Trump and Congress Have a Right and a Duty To Kill the Department of Education",
    "description": "The feds have no constitutional authorization to meddle in education.",
    "link": "https://reason.com/2025/03/24/trump-and-congress-have-a-right-and-a-duty-to-kill-the-department-of-education/",
    "timestamp": "2025-03-24T01:18:02Z"
  },
  {
    "title": "Iran rejects nuclear talks with US amid continued pressure",
    "description": "Iran's Foreign Minister Abbas Araqchi clarifies that negotiations with the United States are not possible unless Washington changes its approach.",
    "link": "https://www.israelnationalnews.com/news/405819",
    "timestamp": "2025-03-24T01:16:22Z"
  },
  {
    "title": "Major progressive groups launch anti-Trump Substack",
    "description": "The Scoop\nA coalition of some of the largest Democratic grassroots groups want to use Substack to promote their pushback against President Donald Trump’s agenda.\nMoveOn, Indivisible, and Working Families Power, the 504(c)(4) arm of the Working Families Party,…",
    "link": "https://biztoc.com/x/ac17bda7e9c42687",
    "timestamp": "2025-03-24T01:15:36Z"
  },
  {
    "title": "US stock futures rise as new tariffs seen targeted",
    "description": "S&P 500 futures rose, Japanese shares fluctuated between gains and losses in early trade, while Australia’s market fell. The dollar was softer against major peers, while the 10-year US Treasury yield advanced.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-rise-as-new-tariffs-seen-targeted/articleshow/119399818.cms",
    "timestamp": "2025-03-24T01:13:33Z"
  },
  {
    "title": "ICE Arrests 68 Tren de Aragua Gang Members",
    "description": "Federal authorities arrested 68 members of the notorious gang Tren De Aragua this week, according to a new report from the Department of Homeland Security (DHS). “In less than 100 days, the Trump Administration has arrested 394 members of the Tren De Aragua—a…",
    "link": "https://freerepublic.com/focus/f-news/4306335/posts",
    "timestamp": "2025-03-24T01:13:11Z"
  },
  {
    "title": "Are Tiger Woods & Vanessa Trump Dating? Inside the Rumors",
    "description": "Multiple reports surfaced in early March suggesting that Tiger and Vanessa were quietly dating. Find out if it's true and learn more about their relationship here.",
    "link": "https://hollywoodlife.com/2025/03/23/tiger-woods-vanessa-trump-dating/",
    "timestamp": "2025-03-24T01:10:08Z"
  },
  {
    "title": "Share Market Highlights: Sensex jumps 1.4%, Nifty gains 1.32% as foreign buying lifts markets",
    "description": "Sensex, Nifty updates on 24 March 2025: The benchmark BSE Sensex jumped 1.4% to 77,984.38, while the NSE Nifty gained 1.32% to 23,658, driven by renewed foreign investor interest and bargain hunting. Banking and IT stocks led the rally. The Indian rupee surge…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-highlights-24-march-2025/article69365394.ece",
    "timestamp": "2025-03-24T01:10:00Z"
  },
  {
    "title": "Russia-Ukraine War Live News Updates: Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "description": "Russia-Ukraine War Live News Updates: Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-pm-modi-donald-trump-kunal-kamra-eknath-shinde-venessa-trump-tiger-woods-elon-musk-pope-francis-gaza-israel-war-ukraine-russia-heathrow-airport-march-24/liveblog/119399580.cms",
    "timestamp": "2025-03-24T01:04:17Z"
  },
  {
    "title": "CNBC Daily Open: Tariff flexibility sounds good, but also signals uncertainty",
    "description": "\"Flexibility\" connotes openness to change. U.S. President Donald Trump expressed Friday the possibility of being flexible with tariffs, which may have helped stocks tick up, pushing the three key U.S. benchmarks into the green for the week.\nBut, in its sugges…",
    "link": "https://biztoc.com/x/b43018b40e7dc5d7",
    "timestamp": "2025-03-24T01:04:01Z"
  },
  {
    "title": "Nikki Glaser Says She Now Considers Possibility Of Death Threats Or Being “Detained” Before Doing Political Humor: “It’s Like A Real Fear”",
    "description": "﻿Nikki Glaser was one of the few celebrities to walk the red carpet at this year’s Mark Twain Prize — certainly not because of the honoree, but perhaps because of the “elephant in the room.” Glaser said that she expected the evening would focus on honoree Con…",
    "link": "http://deadline.com/2025/03/nikki-glaser-death-threats-political-jokes-1236347416/",
    "timestamp": "2025-03-24T01:01:58Z"
  },
  {
    "title": "TV News Orgs Avoid Saying ‘Gulf of Mexico’ During Astronaut Splashdown, Transcript Review Shows",
    "description": "Newscasters \"tied themselves in knots, performing linguistic gymnastics to stay out of Donald Trump’s crosshairs,\" Oliver Darcy writes\nThe post TV News Orgs Avoid Saying ‘Gulf of Mexico’ During Astronaut Splashdown, Transcript Review Shows appeared first on T…",
    "link": "https://www.thewrap.com/tv-news-avoid-gulf-of-mexico-astronaut-splashdown-trump/",
    "timestamp": "2025-03-24T01:01:16Z"
  },
  {
    "title": "Small-cap mutual funds can be good starting point for new investors: Vinit Sambre, Equities head, DSP Investment Managers",
    "description": "Unlike many fund managers, Vinit Sambre, Head, Equities, DSP Investment Managers, believes that small-cap funds are ideal for first-time investors. This, despite the category taking a massive beating during this market fall. In conversation with Kayezad E. Ad…",
    "link": "https://economictimes.indiatimes.com/wealth/invest/small-cap-mutual-funds-can-be-good-starting-point-for-new-investors-vinit-sambre-equities-head-dsp-investment-managers/articleshow/119310959.cms",
    "timestamp": "2025-03-24T01:00:00Z"
  },
  {
    "title": "Serbia’s massive protests: The risks and opportunities for Vucic",
    "description": "Vucic himself could emerge from the ongoing protests in a stronger position domestically if he only heeds the EU’s recommendations.",
    "link": "https://www.jpost.com/opinion/article-847232",
    "timestamp": "2025-03-24T00:56:55Z"
  },
  {
    "title": "Schumer: 'I won't step down' amid pressure from critics",
    "description": "Senate Minority leader Chuck Schumer, D-N,Y, has rejected calls from his critics to vacate his post, part of the ongoing rancor swirling in Congress about...",
    "link": "https://www.upi.com/Top_News/US/2025/03/23/schumer-wont-step-down-amid-pressure/2051742777471/",
    "timestamp": "2025-03-24T00:56:01Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump Confirm Relationship With PDA Photo",
    "description": "Tiger Woods and Vanessa Trump's love is in full swing—and Instagram official.\nThe golf champion and the 47-year-old, ex-wife of President Donald Trump's eldest son Donald Trump Jr., has confirmed...",
    "link": "https://www.eonline.com/news/1415142/tiger-woods-confirms-hes-dating-vanessa-trump",
    "timestamp": "2025-03-24T00:54:03Z"
  },
  {
    "title": "Netanyahu After Deadliest Night Yet for Gazan Children: This is Just the Beginning",
    "description": "Israel Katz, the IDF head, says the ‘game has changed’ in Gaza Israeli Prime Minister Benjamin Netanyahu, who is particularly bold these days because he owns the occupant inside the White House, warned Gazans that the airstrikes that killed at least 430 — inc…",
    "link": "https://www.activistpost.com/netanyahu-after-deadliest-night-yet-for-gazan-children-this-is-just-the-beginning/",
    "timestamp": "2025-03-24T00:54:00Z"
  }
]