[
  {
    "title": "NATO plans to sideline Zelenskyy at June summit to keep Trump happy",
    "description": "NATO’s Secretary-General Mark Rutte said the agenda “is still under discussion”.",
    "link": "https://www.euractiv.com/section/defence/news/nato-plans-to-sideline-zelenskyy-at-june-summit-to-keep-trump-happy/",
    "timestamp": "2025-05-15T06:52:39Z"
  },
  {
    "title": "King Charles & Trump’s Relationship Takes Dramatic Turn as the Monarch Makes an ‘Unprecedented’ Move",
    "description": "The monarch also had a 'frightening' health update.King Charles still plans to meet with US President Donald Trump. The monarch previously expressed interest in meeting him shortly after he was inaugurated. Prince Charles wrote a letter to President Trump wit…",
    "link": "https://freerepublic.com/focus/f-news/4317082/posts",
    "timestamp": "2025-05-15T06:51:10Z"
  },
  {
    "title": "Putin and Trump leave Zelenskyy in the dust, skipping peace talks in Turkey",
    "description": "Neither Russian President Vladimir Putin nor U.S. President Donald Trump look likely to attend peace talks that were due to be held in Turkey on Thursday.",
    "link": "https://www.cnbc.com/2025/05/15/putin-and-trump-wont-attend-peace-talks-with-ukraines-zelenskyy.html",
    "timestamp": "2025-05-15T06:50:27Z"
  },
  {
    "title": "Tesla chair sold stock worth $230M while profits at Elon Musk's carmaker plunged",
    "description": "The chair of Tesla sold more than $230 million in company stock since Elon Musk’s endorsement of Donald Trump alienated car buyers and dragged profits lower",
    "link": "https://biztoc.com/x/a223f17bae7f46ee",
    "timestamp": "2025-05-15T06:46:56Z"
  },
  {
    "title": "Trump Says He's Open to Talking to Pope Leo About Immigration",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump said he was open to talking to Pope Leo XIV about immigration.\nThe new pope's brother John Prevost said in an interview with the New York Times last week that Leo is \"not happy with…",
    "link": "https://biztoc.com/x/dc51b9b2ea2cc107",
    "timestamp": "2025-05-15T06:46:52Z"
  },
  {
    "title": "Putin Swerves Zelensky Turkey Summit, Sends Low-Level Delegates",
    "description": "The absence of both Vladimir Putin and President Donald Trump from the talks dampens hopes for a significant breakthrough in resolving the conflict",
    "link": "https://www.newsweek.com/putin-swerves-zelensky-turkey-summit-sends-low-level-delegates-2072539",
    "timestamp": "2025-05-15T06:45:01Z"
  },
  {
    "title": "Edan Alexander was injured when a tunnel collapsed on him in captivity, father says - NYT",
    "description": "Edan's time held hostage by Hamas terrorists left him \"physically changed\" after his \"skin grew sallow from lack of sunshine and covered in red welts,\" NYT reported.",
    "link": "https://www.jpost.com/israel-news/article-854049",
    "timestamp": "2025-05-15T06:44:46Z"
  },
  {
    "title": "Trump Says He's Open to Talking to Pope Leo About Immigration",
    "description": "\"He does seem to disagree with you on immigration,\" Sean Hannity said.",
    "link": "https://www.newsweek.com/donald-trump-talk-pope-leo-immigration-2072536",
    "timestamp": "2025-05-15T06:42:15Z"
  },
  {
    "title": "Tesla chair sold stock worth $230M while profits at Elon Musk's carmaker plunged",
    "description": "The chair of Tesla sold more than $230 million in company stock since Elon Musk’s endorsement of Donald Trump alienated car buyers and dragged profits lower",
    "link": "https://abcnews.go.com/Business/wireStory/chair-tesla-sold-stock-worth-230-million-profits-121816237",
    "timestamp": "2025-05-15T06:39:26Z"
  },
  {
    "title": "Qatar Airways Places Record-Breaking Order for Widebody Jets with Boeing",
    "description": "Qatar Airways has ordered 160 Boeing widebody jets with another 50 options in a ceremony in Doha. This will literally be two years of Boeing's Dreamliner aircraft supply at current production rates. \nThe post Qatar Airways Places Record-Breaking Order for Wid…",
    "link": "https://livefromalounge.com/qatar-airways-order-widebody-jets-boeing/",
    "timestamp": "2025-05-15T06:37:27Z"
  },
  {
    "title": "New militarized border zone spurs charges against hundreds of immigrants",
    "description": "Several hundred immigrants have been charged with unauthorized access to a newly designated militarized zone along the southern U.S. border in New Mexico and Western Texas since the Department of Justice introduced the new approach",
    "link": "https://abcnews.go.com/US/wireStory/new-militarized-border-zone-spurs-national-security-charges-121816634",
    "timestamp": "2025-05-15T06:36:25Z"
  },
  {
    "title": "\"When Tharoor Saab Speaks...\": Congress Sends A \"Lakshman Rekha\" Message",
    "description": "Flowers from foes, fire from friends -- this sums up what Congress leader Shashi Tharoor is going through these days. While the Thiruvananthapuram MP has drawn cheers from his critics for articulating India&#039;s position amid its tensions with Pakistan",
    "link": "https://www.ndtv.com/india-news/shashi-tharoor-jairam-ramesh-operation-sindoor-when-tharoor-saab-speaks-congress-sends-a-lakshman-rekha-message-8418833",
    "timestamp": "2025-05-15T06:30:07Z"
  },
  {
    "title": "CNBC Daily Open: Trump's deals help Nvidia become the latest 'Magnificent Seven' stock to pare losses",
    "description": "The \"Magnificent Seven\" stocks were among the hardest hit by U.S. President Donald Trump’s tariffs.",
    "link": "https://www.cnbc.com/2025/05/15/cnbc-daily-open-nvidia-recoups-its-losses-for-the-year.html",
    "timestamp": "2025-05-15T06:30:02Z"
  },
  {
    "title": "Taiwan's Computex to showcase AI advances, Nvidia's Jensen Huang to take centre stage",
    "description": "At Taiwan’s Computex trade show, AI and geopolitics take centre stage. Nvidia’s Jensen Huang leads a line-up of tech giants showcasing AI advancements amid rising US tariffs and tighter export controls. Collaboration and industrial innovation dominate, reflec…",
    "link": "https://economictimes.indiatimes.com/tech/technology/taiwans-computex-to-showcase-ai-advances-nvidias-jensen-huang-to-take-centre-stage/articleshow/121180072.cms",
    "timestamp": "2025-05-15T06:28:37Z"
  },
  {
    "title": "Ukrainian Filmmakers Weather ‘Turbulence,’ ‘Uncertainty’ of Trump 2.0, Set Sights on Post-War Rebuild: ‘We Are Still Here’",
    "description": "When Ukrainian production powerhouse Film.UA set a late-February release date for “Puppies,” an offbeat comedy about a woman afflicted with a strange curse that turns her lovers into canines, hopes were high for strong returns at the box office. Just last yea…",
    "link": "https://variety.com/2025/film/focus/ukrainian-filmmakers-post-war-rebuild-1236378183/",
    "timestamp": "2025-05-15T06:27:00Z"
  },
  {
    "title": "Ukraine-Russia Breakthrough Hopes Fade as NATO Diplomats Meet",
    "description": "Top US and European diplomats are gathering in Antalya, Turkey on Thursday as the outlook dims for any major breakthrough in expected peace talks between Ukraine and Russia.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-russia-breakthrough-hopes-fade-as-nato-diplomats-meet",
    "timestamp": "2025-05-15T06:24:29Z"
  },
  {
    "title": "Group of 21 economies — including U.S. and China — warns of growth slowdown over trade tensions",
    "description": "The Asia Pacific Economic Cooperation forecasts growth to drop to 2.6% in 2025, from 3.6% in the prior year.",
    "link": "https://www.cnbc.com/2025/05/15/apec-including-us-china-warns-of-growth-slowdown-over-trade-tensions.html",
    "timestamp": "2025-05-15T06:22:35Z"
  },
  {
    "title": "Pakistan vows 'swift response' if India violates ceasefire",
    "description": "The spokesman for Pakistan's Armed Forces has vowed a \"swift and assured response\" to India if it violates the ceasefire with Pakistan.",
    "link": "https://news.sky.com/story/pakistan-vows-swift-response-if-india-violates-ceasefire-13368060",
    "timestamp": "2025-05-15T06:20:00Z"
  },
  {
    "title": "Opinion: How India's 'New Normal' Sets The Record Straight On Terrorism - And Pakistan",
    "description": "By shifting the presumption on Pakistan, India has placed upon it the responsibility of stopping the harbouring, training, sponsoring and commission of acts of cross-border terror.",
    "link": "https://www.ndtv.com/opinion/how-indias-new-normal-sets-the-record-straight-on-terrorism-and-pakistan-8418729",
    "timestamp": "2025-05-15T06:17:15Z"
  },
  {
    "title": "Trump, Putin not planning on traveling to Turkey for Ukraine talks",
    "description": "US President Donald Trump and Russian President Vladimir Putin are not planning on traveling to Turkey for tal",
    "link": "https://www.jpost.com/breaking-news/article-854047",
    "timestamp": "2025-05-15T06:17:06Z"
  },
  {
    "title": "Poland votes for a new president Sunday as worries grow about the future",
    "description": "Voters in Poland will cast ballots Sunday in a presidential election to choose a successor to conservative incumbent Andrzej Duda",
    "link": "https://abcnews.go.com/International/wireStory/poland-votes-new-president-sunday-worries-grow-future-121825001",
    "timestamp": "2025-05-15T06:14:19Z"
  },
  {
    "title": "NZ sharemarket up as Sanford produces bumper result - Market close",
    "description": "The New Zealand sharemarket rose today, with key shares including Fonterra increasing.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/nz-sharemarket-up-as-sanford-produces-bumper-result-market-close/MIRBG2FLLBHFLKKA7AAVJUPTDE/",
    "timestamp": "2025-05-15T06:10:07Z"
  },
  {
    "title": "How Trump's man in Beijing swung from trade globalist to China hawk",
    "description": "David Perdue, the new U.S. ambassador to China and a close ally of former President Trump, arrives in Beijing aiming to restore U.S.-China communication following a recent trade truce. A former trade advocate turned China hawk, Perdue is expected to focus on …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-trumps-man-in-beijing-swung-from-trade-globalist-to-china-hawk/articleshow/121179593.cms",
    "timestamp": "2025-05-15T06:07:56Z"
  },
  {
    "title": "Huge Cost Of Military Parade On Trump's Birthday Is Revealed",
    "description": "Twin celebrations of the Army's 250th anniversary and the president's birthday will include as many as 25 tanks rolling through Washington.",
    "link": "https://www.huffpost.com/entry/cost-military-parade-trump-birthday_n_682582f9e4b0da44a3e0859f",
    "timestamp": "2025-05-15T06:07:02Z"
  },
  {
    "title": "Pakistan strikes deal with Trump family-backed crypto venture",
    "description": "Despite being newly established, the PCC hosted a high-profile delegation from the WLF, led by co-chairman Zachary Witkoff, son of Steve Witkoff, a known associate of Donald Trump. The delegation, which included other WLF executives, was welcomed by senior of…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/pakistan-strikes-deal-with-trump-family-backed-crypto-venture/articleshow/121179568.cms",
    "timestamp": "2025-05-15T06:06:47Z"
  },
  {
    "title": "Trump taps Fox News’ Judge Jeanine Pirro as interim U.S. attorney for D.C.",
    "description": "President Donald Trump selected Judge Jeanine Pirro, a former Westchester County District Attorney and Fox News legal commentator, as interim U.S. attorney for Washington, D.C., praising her as “incredibly well qualified” and a top prosecutor in New York hist…",
    "link": "https://www.naturalnews.com/2025-05-15-trump-appoints-pirro-as-interim-us-attorney.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Reduced Russian drone strike sets the stage for Istanbulâ\u0080\u0099s critical peace talks",
    "description": "Russia launched only 10 drones in an overnight attack on Ukraine — its smallest strike in months — amid mounting tensions ahead of potential peace talks in Istanbul. Ukraine intercepted the attack with no major damage. Ukraine demands a formal ceasefire and P…",
    "link": "https://www.naturalnews.com/2025-05-15-reduced-russian-drone-strike-istanbul-peace-talks.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "RFK Jr. orders FDA review of abortion pill after study reveals alarming safety risks",
    "description": "HHS Secretary Robert F. Kennedy Jr. orders an FDA review of mifepristone after new data shows 11% of women experience severe complications, far higher than the 0.5% previously claimed. A study of 865,727 women revealed 1 in 10 suffered life-threatening issues…",
    "link": "https://www.naturalnews.com/2025-05-15-rfk-fda-review-abortion-pill-risks.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Kraft Heinz pours $3 billion into U.S. factories as Trump tariffs reshape manufacturing",
    "description": "Kraft Heinz is investing $3 billion to upgrade U.S. factories, its largest domestic spending in a decade, creating 3,500 construction jobs amid Trump’s tariff-driven push for American manufacturing. The company aims to boost efficiency and innovation while na…",
    "link": "https://www.naturalnews.com/2025-05-15-kraft-heinz-billion-factories-trump-tariffs.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Farm labor shift and sanctuary cities clash as GOP tackles immigration and employment",
    "description": "A bold plan proposes phasing out H-2A seasonal farm visas over seven years to replace foreign workers with American labor, addressing shortages and incentivizing domestic employment in agriculture. Critics argue mechanization and higher wages could attract un…",
    "link": "https://www.naturalnews.com/2025-05-15-farm-labor-shift-and-sanctuary-cities-clash.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "CLIMATE PONZI SCHEME DENIED: Trump begins the exit of the BIGGEST WASTE of money, resources and human lives ever and the climate alarmists are freaking out",
    "description": "Are you not interested in donating your hard-earned money that’s triple taxed to the wealthiest jerks in the world so they can spray chemicals in the sky to block out the sun? Why not? Are you not interested in donating all of your savings to billionaires who…",
    "link": "https://www.naturalnews.com/2025-05-15-climate-ponzi-scheme-denied-by-trump.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Trump urges House Speaker Johnson to raise taxes on wealthiest Americans",
    "description": "President Donald Trump reportedly urged Speaker Mike Johnson to raise the top individual tax rate from 37 percent to 39.6 percent for incomes over $2.5 million or $5 million for joint filers, while closing the carried interest loophole to fund middle-class ta…",
    "link": "https://www.naturalnews.com/2025-05-15-trump-urges-johnson-raise-taxes-wealthiest-americans.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "U.S.-China trade talks signal potential policy shift",
    "description": "The Trump administration is considering reducing tariffs on Chinese imports from as high as 145 percent to around 50-54 percent to ease trade tensions and facilitate negotiations ahead of critical talks in Geneva on May 10. U.S. and Chinese officials, includi…",
    "link": "https://www.naturalnews.com/2025-05-15-china-trade-talks-signal-potential-policy-shift.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Israel-Iran tensions intensify as diplomatic efforts struggle",
    "description": "Geopolitical Tensions Escalate: Israel-Iran conflict intensifies as Netanyahu advocates military action, while Trump pushes diplomacy, signaling a U.S. foreign policy shift. Netanyahu’s Hawkish Approach: Israeli PM frames Iran as an existential threat, emphas…",
    "link": "https://www.naturalnews.com/2025-05-15-israel-iran-tensions-intensify-as-diplomatic-efforts-struggle.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Israelâ\u0080\u0099s full-scale assault on Gaza escalates as Netanyahu vows to continue until Hamas is “destroyed”",
    "description": "Netanyahu vows to continue military operations in Gaza until Hamas is defeated, despite rising civilian deaths and famine risks. Over 52,800 Palestinians have been killed, with half a million facing starvation due to Israel’s blockade, sparking accusations of…",
    "link": "https://www.naturalnews.com/2025-05-15-israel-assault-gaza-ecalates-until-hamas-destroyed.html",
    "timestamp": "2025-05-15T06:00:00Z"
  },
  {
    "title": "Cryptocurrency industry calls for regulatory clarity",
    "description": "The start of President Donald Trump's term earned rave reviews at the world's leading crypto conference, but top industry lawyers said digital platforms wanted regulatory clarity while the Republicans control Congress.",
    "link": "https://www.hurriyetdailynews.com/cryptocurrency-industry-calls-for-regulatory-clarity-209204",
    "timestamp": "2025-05-15T05:58:36Z"
  },
  {
    "title": "Ukraine and Russia to hold first direct talks since 2022 but Putin not on list of attendees",
    "description": "Volodymyr Zelenskyy had challenged Putin to meet him in person in Istanbul, but the Russian delegation names only a lower-level team.",
    "link": "https://www.thejournal.ie/ukraine-and-russia-to-hold-first-direct-talks-since-2022-6705319-May2025/",
    "timestamp": "2025-05-15T05:56:06Z"
  },
  {
    "title": "WATCH: What’s next for Diddy’s defense team after star witness testimony",
    "description": "ABC News’ Linsey Davis talks to criminal defense attorney Bernarda Villalona about how hard it will be for the defense to overcome testimony from star witness Cassie Ventura.",
    "link": "https://abcnews.go.com/US/video/whats-diddys-defense-team-afterstar-witness-testimony-121815237",
    "timestamp": "2025-05-15T05:54:50Z"
  },
  {
    "title": "Trump signed plenty of contracts in the Middle East, but he’s no closer to the two ‘deals’ he really wants",
    "description": "Trump skirted the ongoing tragedy in Gaza, bypassed Israel and offered no new initiatives on Iran’s nuclear program.",
    "link": "https://theconversation.com/trump-signed-plenty-of-contracts-in-the-middle-east-but-hes-no-closer-to-the-two-deals-he-really-wants-256778",
    "timestamp": "2025-05-15T05:54:32Z"
  },
  {
    "title": "Trump Is Making America Constitutionally Literate—By Violating the Constitution",
    "description": "Few modern political figures have done more to prompt spontaneous national discussions about the Bill of Rights and constitutional limits on government power than Donald Trump—if only because he tramples on them so frequently. Indeed, President Trump has beco…",
    "link": "https://www.counterpunch.org/2025/05/15/trump-is-making-america-constitutionally-literate-by-violating-the-constitution/",
    "timestamp": "2025-05-15T05:54:28Z"
  },
  {
    "title": "Argentina orders immigration crackdown with new decree to 'make Argentina great again'",
    "description": "Argentina’s right-wing President Javier Milei has issued a decree curbing immigration to the South American nation, a move coinciding with the immigration restrictions put in place by the Trump administration",
    "link": "https://abcnews.go.com/International/wireStory/argentina-orders-immigration-crackdown-new-decree-make-argentina-121823126",
    "timestamp": "2025-05-15T05:50:30Z"
  },
  {
    "title": "Why Selling Indie Movies To China, Rest Of Asia, Was A Tough Business Even Before Trump’s Tariffs",
    "description": "As the Cannes market heads into its first weekend, it’s fair to say it’s a nerve-wracking time for the international film sales business. Barely recovered from the shocks of pandemic and Hollywood strikes, the industry now faces the threat of tariffs imposed …",
    "link": "http://deadline.com/2025/05/selling-indie-movies-china-asia-trump-tariffs-1236391338/",
    "timestamp": "2025-05-15T05:48:34Z"
  },
  {
    "title": "Stablecoin bill won’t target Trump as Senate aims to pass it next week",
    "description": "The US Senate could pass a key bipartisan stablecoin bill as soon as next week after removing language targeting President Donald Trump and his family’s sprawling crypto interests.Republican Senator Cynthia Lummis said onstage at an event by Coinbase’s lobbyi…",
    "link": "https://cointelegraph.com/news/stablecoin-bill-wont-target-trump-senate-could-pass-may-26",
    "timestamp": "2025-05-15T05:46:09Z"
  },
  {
    "title": "BBC joins Gaza children as they are evacuated to Jordan for treatment",
    "description": "The BBC's Fergal Keane accompanies children being evacuated from Gaza on their journey to Jordan.",
    "link": "https://www.bbc.com/news/articles/cg5v2rjp84ro",
    "timestamp": "2025-05-15T05:44:20Z"
  },
  {
    "title": "Syrian leader says lifting of US sanctions 'historic and courageous'",
    "description": "Syrian interim President Ahmed al-Sharaa on Wednesday welcomed U.S. President Donald Trump's \"courageous\" lifting of sanctions on his country.",
    "link": "https://www.hurriyetdailynews.com/syrian-leader-says-lifting-of-us-sanctions-historic-and-courageous-209201",
    "timestamp": "2025-05-15T05:43:06Z"
  },
  {
    "title": "Colbert Imagines a Trump Version of the Trojan War After New Excuse for Accepting ‘Bribe Mobile’ Gift Jet | Video",
    "description": "The host of \"The Late Show\" roasts the president, panders hard to fans of Ancient Greece\nThe post Colbert Imagines a Trump Version of the Trojan War After New Excuse for Accepting ‘Bribe Mobile’ Gift Jet | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-monologue-donald-trump-qatar-jet-trojan-war/",
    "timestamp": "2025-05-15T05:40:35Z"
  },
  {
    "title": "Trump to close deal-making Gulf tour in UAE",
    "description": "U.S. President Donald Trump on Thursday closes a Middle East tour in the United Arab Emirates as he focuses squarely on seeking deals after billions of dollars of pledges from Saudi Arabia and Qatar.",
    "link": "https://www.hurriyetdailynews.com/trump-to-close-deal-making-gulf-tour-in-uae-209200",
    "timestamp": "2025-05-15T05:35:59Z"
  },
  {
    "title": "US Supreme Court weighs judicial checks on Trump with birthright case",
    "description": "The US Supreme Court is reviewing a case concerning Donald Trump's attempt to end birthright citizenship, challenging the power of federal judges to issue nationwide injunctions against presidential policies. Trump's executive order, which seeks to deny autom…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-supreme-court-weighs-judicial-checks-on-trump-with-birthright-case/articleshow/121177819.cms",
    "timestamp": "2025-05-15T05:34:02Z"
  },
  {
    "title": "Trump to visit US troops in Qatar",
    "description": "President Donald Trump on Thursday will visit a U.S. installation at the center of American involvement in the Middle East... Trump plans to address troops at Qatar’s al-Udeid Air Base, which was a major staging ground during the U.S. wars in Iraq and Afghani…",
    "link": "https://freerepublic.com/focus/f-news/4317081/posts",
    "timestamp": "2025-05-15T05:32:17Z"
  },
  {
    "title": "The Jungle – in 2025",
    "description": "Prologue The British writer Adam Weymouth tracked a wolf that had walked some 1,000 miles across Europe. That was the post-Cold War Europe opened to people and protective of wildlife, including wolves. But ecological crises, especially the anthropogenic clima…",
    "link": "https://www.counterpunch.org/2025/05/15/the-jungle-in-2025/",
    "timestamp": "2025-05-15T05:30:04Z"
  },
  {
    "title": "Trump's Greenland threats spark Iceland jitters",
    "description": "Donald Trump's interest in Greenland has Iceland reconsidering its defense arrangements with the US and NATO. A majority of Icelanders view Trump's Arctic ambitions as a threat, prompting discussions about alternative security strategies. While Iceland values…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-greenland-threats-spark-iceland-jitters/articleshow/121178542.cms",
    "timestamp": "2025-05-15T05:29:54Z"
  },
  {
    "title": "Trump’s critical minerals drive paves the way for a deep-sea gold rush",
    "description": "U.S. President Donald Trump's critical minerals drive looks set to pave the way for a gold rush on the ocean floor.\nSeeking to counter China's mineral dominance, the Trump administration in April signed a sweeping executive order to fast-track deep-sea mining…",
    "link": "https://biztoc.com/x/c693cd36a7853966",
    "timestamp": "2025-05-15T05:29:17Z"
  },
  {
    "title": "Meeting on Ukraine in Turkey: Is Putin “tricking” Trump with the composition of the Russian mission?",
    "description": "Absences and low expectations at the meeting, as Russia once again chooses not to enter into a meaningful dialogue - Questions about the next move of the US President\nThe post Meeting on Ukraine in Turkey: Is Putin “tricking” Trump with the composition of the…",
    "link": "https://en.protothema.gr/2025/05/15/meeting-on-ukraine-in-turkey-is-putin-tricking-trump-with-the-composition-of-the-russian-mission/",
    "timestamp": "2025-05-15T05:28:31Z"
  },
  {
    "title": "Gaza rescuers say 80 killed in Israeli strikes amid hostage release talks",
    "description": "Gaza rescuers said at least 80 people were killed in Israeli bombardment across the Palestinian territory on Wednesday, as Israeli Prime Minister Benjamin Netanyahu spoke to U.S. envoy Steve Witkoff about the release of hostages.",
    "link": "https://www.hurriyetdailynews.com/gaza-rescuers-say-80-killed-in-israeli-strikes-amid-hostage-release-talks-209199",
    "timestamp": "2025-05-15T05:28:03Z"
  },
  {
    "title": "Nebraska Lawmakers Approve Crypto Mining Limits in Final Reading",
    "description": "If signed by the Governor, Nebraska's bill would take effect this October, regulating crypto miners using over 1 MW of electricity.",
    "link": "https://decrypt.co/320160/nebraska-lawmakers-approve-crypto-mining-limits-in-final-reading",
    "timestamp": "2025-05-15T05:27:44Z"
  },
  {
    "title": "Japanese American museum head laments Trump-led cuts to financing",
    "description": "The Department of Government Efficiency, led by billionaire Elon Musk, has stopped funding for the National Endowment for the Humanities, which financially supports museums.",
    "link": "https://www.japantimes.co.jp/news/2025/05/15/japan/janm-interview/",
    "timestamp": "2025-05-15T05:26:00Z"
  },
  {
    "title": "Ukraine, Russia to hold first direct talks since 2022 in Istanbul",
    "description": "War rivals Ukraine and Russia are set to go into their first direct talks in more than three years on Thursday, with Russian President Vladimir Putin not included on the list of attendees.",
    "link": "https://www.hurriyetdailynews.com/ukraine-russia-to-hold-first-direct-talks-since-2022-in-istanbul-209198",
    "timestamp": "2025-05-15T05:23:38Z"
  },
  {
    "title": "Trump’s critical minerals drive paves the way for a deep-sea gold rush",
    "description": "\"The thing that people have missed is that there is zero chance that this will not happen,\" Gerard Barron, CEO of The Metals Company, told CNBC by video call.",
    "link": "https://www.cnbc.com/2025/05/15/trumps-critical-minerals-drive-paves-the-way-for-a-deep-sea-gold-rush.html",
    "timestamp": "2025-05-15T05:22:24Z"
  },
  {
    "title": "Shunned by Trump, U.S. researchers wooed by world: report",
    "description": "NEW YORK, May 14 (Xinhua) -- As U.S. President Donald Trump cuts billions of federal dollars from sc",
    "link": "http://en.people.cn/n3/2025/0515/c90000-20315241.html",
    "timestamp": "2025-05-15T05:13:06Z"
  },
  {
    "title": "Argentina orders immigration crackdown with decree to 'make Argentina great again'",
    "description": "In a country that has long prided itself on its openness to immigrants, the declaration drew criticism from the Argentine president's opponents and prompted comparisons to U.S. President Donald Trump.",
    "link": "https://www.npr.org/2025/05/15/nx-s1-5399047/argentina-immigration-crackdown-maga-trump-milei",
    "timestamp": "2025-05-15T05:11:52Z"
  },
  {
    "title": "Denmark's economy is booming on drug exports — Trump's tariffs threat won't slow it down",
    "description": "Denmark's economic growth, which was driven by what economists described as an \"exceptional surge\" in pharmaceutical exports, is expected to weaken this year.",
    "link": "https://www.cnbc.com/2025/05/15/trumps-pharma-tariffs-threat-wont-slow-denmark-down.html",
    "timestamp": "2025-05-15T05:11:26Z"
  },
  {
    "title": "Tulsi: it is a fireable offense to present facts that are inconvenient for Dear Leader",
    "description": "There were people who thought this authoritarian lickspittle would be a viable presidential candidate for the Democratic Party: Director of National Intelligence Tulsi Gabbard has fired two top intelligence officials who oversaw a recent intelligence assessme…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/tulsi-it-is-a-fireable-offense-to-present-facts-that-are-inconvenient-for-dear-leader",
    "timestamp": "2025-05-15T05:10:33Z"
  },
  {
    "title": "India's 6-Point Rebuttal To US On Every Pakistan Ceasefire Claim",
    "description": "India on Tuesday issued a six-point rebuttal to recent statements by US President Donald Trump and senior members of his administration regarding the India-Pakistan ceasefire agreement announced over the weekend.",
    "link": "https://www.ndtv.com/india-news/india-pakistan-ceasefire-indias-6-point-rebuttal-to-us-on-every-pakistan-ceasefire-claim-8418233",
    "timestamp": "2025-05-15T05:09:21Z"
  },
  {
    "title": "Trump just blew it with 'strongest adversary we've ever had': Ex-defense leaders",
    "description": "Donald Trump's decision to threaten massive tariffs on China only to retreat risks making the U.S. a “paper tiger” and encouraging Chinese aggression against Taiwan, a former U.S. ambassador to Beijing and a former CIA chief and defense secretary said.“We hav…",
    "link": "https://www.rawstory.com/trump-china-tariffs-2672019128/",
    "timestamp": "2025-05-15T05:09:03Z"
  },
  {
    "title": "Trump to visit US troops in Qatar",
    "description": "President Donald Trump is set to visit a U.S. installation at the center of American involvement in the Middle East as he uses his four-day visit to Gulf states to reject the “interventionism” of America’s past in the region",
    "link": "https://abcnews.go.com/International/wireStory/trump-visit-us-troops-qatar-rejects-americas-interventionist-121823693",
    "timestamp": "2025-05-15T05:07:12Z"
  },
  {
    "title": "‘Significant step’: Russia-Ukraine talks in Turkiye – what to expect",
    "description": "Zelenskyy will be in Turkiye, but Putin is not on Russia's team for the first direct Moscow-Kyiv talks since 2022.",
    "link": "https://www.aljazeera.com/news/2025/5/15/significant-step-russia-ukraine-talks-in-turkiye-what-to",
    "timestamp": "2025-05-15T05:06:49Z"
  },
  {
    "title": "US deep sea mining plan would likely violate international law",
    "description": "The Trump administration plan to allow mining of deep sea metals in the Pacific Ocean would unequivocally violate international law, experts said, making any attempt to sell the minerals - used in batteries, weapons and smartphones - open to challenge by othe…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250514-rfa02.htm",
    "timestamp": "2025-05-15T05:06:45Z"
  },
  {
    "title": "Trump’s Middle East tour has more substance than the White House let on",
    "description": "There’s more to Donald Trump’s Middle East trip than billion-dollar contracts, parades of camels and a storm back home over Qatar’s offer to give the president a new Air Force One. A tour narrowly billed by the White House as a chance for Trump to show he’s a…",
    "link": "https://freerepublic.com/focus/f-news/4317077/posts",
    "timestamp": "2025-05-15T05:05:52Z"
  },
  {
    "title": "Gingrich Blasts Corporate Media For Missing Two Aspects Of Trump’s Middle East Speech With ‘Truly Historic’ Benefits",
    "description": "Newt Gingrich ripped corporate media for missing Trump's shift on both the economic and national security benefits during his time in the Middle East.",
    "link": "https://dailycaller.com/2025/05/15/newt-gingrich-corporate-media-missing-donald-trump-speech-middle-east-historic-jesse-watters/",
    "timestamp": "2025-05-15T05:05:44Z"
  },
  {
    "title": "US Supreme Court weighs judicial checks on Donald Trump with birthright case",
    "description": "The US Supreme Court hears a case Thursday that could result in a radical reversal of constitutional interpretation and sharply curb the judiciary's ability to rein in Donald Trump -- or future American presidents. - Uniformity of US citizenship - The Trump a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-weighs-judicial-checks-on-donald-trump-with-birthright-case/articleshow/121177870.cms",
    "timestamp": "2025-05-15T05:04:02Z"
  },
  {
    "title": "Mukesh Ambani meets Trump, Emir of Qatar in Doha during US President's West Asia visit",
    "description": "Mukesh Ambani, head of Reliance Industries, met Donald Trump and Qatar's Emir in Doha. Sources say this visit aims to strengthen global ties for Reliance. Ambani attended a state dinner for Trump at Lusail Palace. This follows Qatar's pledge to invest $10 bil…",
    "link": "https://economictimes.indiatimes.com/news/india/mukesh-ambani-meets-trump-emir-of-qatar-in-doha-during-us-presidents-west-asia-visit/articleshow/121177781.cms",
    "timestamp": "2025-05-15T05:03:14Z"
  },
  {
    "title": "In Tesla’s Wake, More Big Companies Propose Voting ‘Dexit’ to Depart Delaware",
    "description": "In the coming weeks, investors in nine public companies worth at least $1 billion each will vote on proposals to ditch Delaware as their place of incorporation, potentially denting the state’s longtime reputation as Corporate America’s capital, Reuters has fo…",
    "link": "https://www.insurancejournal.com/news/east/2025/05/15/823818.htm",
    "timestamp": "2025-05-15T05:00:28Z"
  },
  {
    "title": "Finn McRedmond: Could a Nigel Farage or Giorgia Meloni be good for Irish democracy?",
    "description": "Moving the needle on the status quo here is almost impossible. It takes a figure with a rare set of qualities",
    "link": "https://www.irishtimes.com/opinion/2025/05/15/ireland-might-benefit-from-having-its-own-nigel-farage-or-giorgia-meloni/",
    "timestamp": "2025-05-15T05:00:01Z"
  },
  {
    "title": "Boeing secures ‘largest-ever’ order from Qatar during Trump visit | CNN Business",
    "description": "Boeing has secured a deal with Qatar for up to 210 jets in what the White House is calling the aircraft makers’s “largest-ever” widebody order worth $96 billion dollars.",
    "link": "https://www.cnn.com/2025/05/15/business/boeing-order-qatar-deal-trump-hnk-intl",
    "timestamp": "2025-05-15T04:59:05Z"
  },
  {
    "title": "A Wisconsin judge set to enter a plea for immigration help",
    "description": "A Wisconsin judge accused of helping a man evade U.S. immigration authorities is set to enter a plea in federal court",
    "link": "https://abcnews.go.com/US/wireStory/wisconsin-judge-accused-helping-man-evade-immigration-agents-121823694",
    "timestamp": "2025-05-15T04:57:22Z"
  },
  {
    "title": "Trump to visit US troops in Qatar as he rejects America's 'interventionist' past in region",
    "description": "Donald Trump is set to visit a US base in Qatar. He aims to shift away from past US intervention policies in the Middle East. Trump praises Gulf nations' economic growth. He seeks a deal with Iran on its nuclear program. Trump plans to recognize Syrian Presid…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-visit-us-troops-in-qatar-as-he-rejects-americas-interventionist-past-in-region/articleshow/121177471.cms",
    "timestamp": "2025-05-15T04:46:20Z"
  },
  {
    "title": "MAGA goes east: Romania's presidential frontrunner rides hard-right wave",
    "description": "George Simion, a nationalist who campaigns to \"Make Romania Great Again,\" opposes military aid to Ukraine and is critical of the EU's leadership.",
    "link": "https://www.japantimes.co.jp/news/2025/05/15/world/politics/maga-east-romania-president/",
    "timestamp": "2025-05-15T04:45:00Z"
  },
  {
    "title": "The U.S. will never win a trade war with China",
    "description": "For sure, the 90-day truce is merely temporary relief. As long as negotiations continue as they are, the U.S. will not be able to win a trade war with China",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/15/world/us-china-trade-war/",
    "timestamp": "2025-05-15T04:41:00Z"
  },
  {
    "title": "Trump reciprocal tariff impact on global industries",
    "description": "US President Donald Trump's implementation of reciprocal tariffs marked a significant shift in global trade dynamics. Designed to counter what his administration saw as unfair trade practices - particularly from China - these tariffs aimed to equalize trade r…",
    "link": "https://www.digitimes.com/reports/item.asp?id=20250514RS400",
    "timestamp": "2025-05-15T04:32:12Z"
  },
  {
    "title": "Trump border czar fires back at AOC over DOJ probe remarks: ‘Why doesn’t she pass some legislation?’",
    "description": "'I'm doing my job. The border is secure... She should try doing her job,' Homan told Fox News Digital.",
    "link": "https://nypost.com/2025/05/15/us-news/trump-border-czar-fires-back-at-aoc-over-doj-probe-remarks-why-doesnt-she-pass-some-legislation/",
    "timestamp": "2025-05-15T04:29:27Z"
  },
  {
    "title": "Democrat ‘Election Deniers’ Try To Overturn Election Of Their Own Party Vice Chair",
    "description": "For years, Democrats have decried Republicans as “election deniers,” even using the phrase to justify lawfare against then-former President Donald Trump. But as it turns out, when elections don’t go their way suddenly the process is flawed and democracy is ne…",
    "link": "https://freerepublic.com/focus/f-news/4317074/posts",
    "timestamp": "2025-05-15T04:26:35Z"
  },
  {
    "title": "Trump Admin Plans to Delay, Eliminate Limits on ‘Forever Chemicals’ in U.S. Drinking Water",
    "description": "PFAS are linked with cancer, fertility issues, and developmental delays in children — yet the E.P.A. has moved to weaken regulations designed to protect Americans",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-epa-forever-chemicals-pfas-drinking-water-1235339967/",
    "timestamp": "2025-05-15T04:25:33Z"
  },
  {
    "title": "Australia's travel advice for the US has toughened three times since April",
    "description": "Between early April and early May, Australia's Department of Foreign Affairs and Trade has changed the language of its travel warnings for the US three times in response to the Trump administration's tougher border stance.",
    "link": "https://www.abc.net.au/news/2025-05-15/australia-government-travel-advice-usa-trump-border-control/105293186",
    "timestamp": "2025-05-15T04:25:26Z"
  },
  {
    "title": "Putin and Trump to skip Ukraine peace talks Putin himself proposed",
    "description": "Trump and Putin will skip Thursday’s first potential Moscow-Kyiv peace talks in three years, with Russia sending technocrats instead.",
    "link": "https://www.euractiv.com/section/politics/news/putin-and-trump-to-skip-ukraine-peace-talks-putin-himself-proposed/",
    "timestamp": "2025-05-15T04:24:08Z"
  },
  {
    "title": "Smartmatic Accuses Fox, Rupert Murdoch of Destroying Evidence in $2.7 Billion Defamation Lawsuit Over 2020 Election",
    "description": "Fox News denies the accusations\nThe post Smartmatic Accuses Fox, Rupert Murdoch of Destroying Evidence in $2.7 Billion Defamation Lawsuit Over 2020 Election appeared first on TheWrap.",
    "link": "https://www.thewrap.com/smartmatic-accuses-fox-news-of-destroying-evidence-in-defamation-lawsuit/",
    "timestamp": "2025-05-15T04:18:53Z"
  },
  {
    "title": "Medicine firms try to unscramble Donald Trump’s conflicting populist visions",
    "description": "Forcing Big Pharma to cut prices seems designed to deter investment, not incentivise it",
    "link": "https://www.irishtimes.com/business/2025/05/15/medicine-firms-try-to-unscramble-donald-trumps-conflicting-populist-visions/",
    "timestamp": "2025-05-15T04:15:00Z"
  },
  {
    "title": "Trump's sanctions on ICC prosecutor have halted tribunal's work",
    "description": "Nearly three months ago, U.S. President Donald Trump slapped sanctions on the International Criminal Court's chief prosecutor, Karim Khan",
    "link": "https://abcnews.go.com/International/wireStory/trumps-sanctions-icc-prosecutor-halted-tribunals-work-121824057",
    "timestamp": "2025-05-15T04:14:45Z"
  },
  {
    "title": "Newark Mayor Ras Baraka set to appear in court on charge of trespassing at immigration facility",
    "description": "Newark Mayor Ras Baraka is set to appear in federal court for a status conference on the Trump administration’s charge he trespassed at an immigration detention center in the city last week",
    "link": "https://abcnews.go.com/US/wireStory/newark-mayor-ras-baraka-set-court-charge-trespassing-121823695",
    "timestamp": "2025-05-15T04:14:24Z"
  },
  {
    "title": "Bondi sold at least $1 million in Trump Media shares on \"Liberation Day\"",
    "description": "Attorney General Pam Bondi's stake in Trump Media was worth somewhere between $1 million and $5.5 million at the time of the sale, which occurred on April 2, documents showed.",
    "link": "https://www.cbsnews.com/news/pam-bondi-sold-at-least-1-million-dollars-trump-media-shares-on-liberation-day/",
    "timestamp": "2025-05-15T04:12:06Z"
  },
  {
    "title": "Trump's Tax Plan Is a Leftist Economic Agenda Wrapped in Populist Talking Points",
    "description": "If you voted for President Donald Trump last November because you believed he'd increase economic freedom, it's safe to say you were fooled. Following a reckless tariff barrage, the White House and its allies are preparing a new wave of tax code gimmickry tha…",
    "link": "https://biztoc.com/x/c9f788bbcd88f64c",
    "timestamp": "2025-05-15T04:11:53Z"
  },
  {
    "title": "Iran pitches ‘joint nuclear venture’ with US – NYT",
    "description": "Iran has floated the idea of a joint nuclear project with U.S. investments, The New York Times reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617560-iran-report-joint-nuclear/",
    "timestamp": "2025-05-15T04:10:30Z"
  }
]