[
  {
    "title": "Trump’s Latest Visa “Pause” Targets 75 Countries He Thinks Are Lazy",
    "description": "Last Wednesday, the Trump administration “paused” immigrant visa applications for people from 75 countries, mostly in the Global South, on the supposed grounds that people from those countries are of “nationalities at high risk of public benefits usage.” Sinc…",
    "link": "https://www.motherjones.com/politics/2026/01/trump-public-charge-visa-ban-immigration/",
    "timestamp": "2026-01-26T19:57:59Z"
  },
  {
    "title": "'Mr. Trump, stop killing American citizens,' Kinew says after 2nd fatal shooting in Minnesota",
    "description": "Manitoba's premier says he's reached out to his counterpart in Minnesota again following the killing of another American citizen by federal immigration officials, calling on U.S. President Donald Trump to stop the violence.",
    "link": "https://www.cbc.ca/news/canada/manitoba/manitoba-trade-deal-american-citizens-9.7061668",
    "timestamp": "2026-01-26T19:56:09Z"
  },
  {
    "title": "3566 - In the Wake of Another ICE Killing w/ Wali Khan",
    "description": "Welcome back to the Majority Report\r\n On today's program:\r\n Border agents have executed another American citizen in Minnesota, Alex Peretti, a 37-year-old VA nurse. Peretti was murdered while helping a woman that had been shoved to the ground by a fed.\r\n Wali…",
    "link": "https://majorityfm.libsyn.com/3566-in-the-wake-of-another-ice-killing-w-wali-khan",
    "timestamp": "2026-01-26T19:56:00Z"
  },
  {
    "title": "Trump Announces DOJ Probe Into Ilhan Omar as White House Trashes Her",
    "description": "In the wake of yet another citizen being shot and killed in broad daylight by Donald Trump’s roving militia, the White House is now attempting to deflect blame by accusing Minnesota Representative Ilhan Omar of fraud.Trump announced the so-called investigatio…",
    "link": "https://newrepublic.com/post/205704/donald-trump-karoline-leavitt-ilhan-omar-investigation",
    "timestamp": "2026-01-26T19:55:16Z"
  },
  {
    "title": "‘I Failed’: House Democrat Who Voted To Fund ICE Publicly Apologizes",
    "description": "Democratic New York Rep. Tom Suozzi voiced regret on Monday after crossing party lines to fund Immigration and Customs Enforcement (ICE) last week. Suozzi, a centrist Democrat representing a House district President Donald Trump won in 2024, apologized for vo…",
    "link": "https://dailycaller.com/2026/01/26/tom-suozzi-ice-funding-public-apology/",
    "timestamp": "2026-01-26T19:54:48Z"
  },
  {
    "title": "Reporters Press Karoline Leavitt On Whether Tom Homan’s Visit To Minnesota Spells Trouble For Kristi Noem",
    "description": "White House press secretary Karoline Leavitt answered whether President Donald Trump still has trust in DHS Secretary Kristi Noem ahead of Tom Homan's trip.",
    "link": "https://dailycaller.com/2026/01/26/reporters-karoline-leavitt-tom-homan-minnesota-kristi-noem/",
    "timestamp": "2026-01-26T19:54:44Z"
  },
  {
    "title": "No endgame doctrine: What Trump is doing to the world order",
    "description": "Why Trump’s new foreign policy struggles to turn pressure into outcomes Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631536-no-endgame-doctrine-trump/",
    "timestamp": "2026-01-26T19:54:24Z"
  },
  {
    "title": "Wiles and Miller ‘fully turned’ against two other top Trump officials as admin 'splinters'",
    "description": "The Trump administration was reportedly splintering Monday over the fatal ICE shooting of 37-year-old ICU nurse Alex Pretti in Minneapolis. President Donald Trump's chief of staff Susie Wiles and White House deputy chief of staff for policy Stephen Miller — t…",
    "link": "https://www.rawstory.com/trump-admin-2675034827/",
    "timestamp": "2026-01-26T19:53:33Z"
  },
  {
    "title": "Army General Tapped to Lead NSA Said He Doesn’t Know Much About the Biggest NSA Controversy",
    "description": "In the Senate this week, NSA pick Lt. Gen. Joshua Rudd could face tough questions on “backdoor” searches about Americans.\nThe post Army General Tapped to Lead NSA Said He Doesn’t Know Much About the Biggest NSA Controversy appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/26/nsa-joshua-rudd-confirmation-hearings-senate-pick/",
    "timestamp": "2026-01-26T19:52:40Z"
  },
  {
    "title": "Tim Walz wants to ‘work together’ – Trump",
    "description": "US President Donald Trump has spoken to Minnesota Governor Tim Walz by phone, after two fatal shootings in the state by federal agents Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631552-trump-walz-minnesota-call/",
    "timestamp": "2026-01-26T19:47:01Z"
  },
  {
    "title": "Ran Gvili's family speaks out: Our pride is stronger than the sorrow",
    "description": "Speaking outside their home in Meitar, the Gvili family thanked the IDF, Israeli and US leaders, and the public following Ran Gvili’s return from Hamas captivity.",
    "link": "https://www.israelnationalnews.com/news/421509",
    "timestamp": "2026-01-26T19:46:43Z"
  },
  {
    "title": "Court filled with Trump appointees shuts down Alina Habba's appeal on unlawful appointment",
    "description": "A panel of judges — including two of President Donald Trump's appointees — refused to hear an appeal on a lower court's ruling that found Alina Habba had been unlawfully appointed as U.S. Attorney.Last year, U.S. District Judge Matthew Brann found that the Tr…",
    "link": "https://www.rawstory.com/panel-of-judges-with-trump-appointees-refuse-appeal-on-alina-habba-s-unlawful-appointment/",
    "timestamp": "2026-01-26T19:45:51Z"
  },
  {
    "title": "Treasury Department ends Booz Allen Hamilton contracts after leak of Trump's tax returns",
    "description": "The Treasury Department has cut contracts with Booz Allen Hamilton after a former contractor leaked tax information about wealthy individuals, including Donald Trump.",
    "link": "https://www.pbs.org/newshour/nation/treasury-department-ends-booz-allen-hamilton-contracts-after-leak-of-trumps-tax-returns",
    "timestamp": "2026-01-26T19:45:16Z"
  },
  {
    "title": "Absconding Congman arrested in Karnataka",
    "description": "Bengaluru: Chikkaballapura police arrested expelled Congress functionary Rajiv Gowda after a 13-day search in connection with allegedly abusing and th.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/absconding-congman-arrested-in-karnataka/articleshow/127569327.cms",
    "timestamp": "2026-01-26T19:45:00Z"
  },
  {
    "title": "Most of the government could shut down this weekend. ICE operations would carry on.",
    "description": "WASHINGTON — Most of the federal government could shut down at the end of the week.",
    "link": "https://www.nbcnews.com/politics/congress/government-shut-weekend-ice-operations-carry-rcna255971",
    "timestamp": "2026-01-26T19:42:36Z"
  },
  {
    "title": "White House Press Secretary Sidesteps Question Of Whether Stephen Miller Will Apologize For Calling Alex Pretti An “Assassin” And “Domestic Terrorist”",
    "description": "As a number of news outlets called out Trump administration officials for false claims about the killing of Alex Pretti, White House Press Secretary Karoline Leavitt tried to sidestep questions of whether there was a rush to judgment. That included comments t…",
    "link": "http://deadline.com/2026/01/white-house-stephen-miller-ice-alex-pretti-1236697162/",
    "timestamp": "2026-01-26T19:42:23Z"
  },
  {
    "title": "Trump Talks Cooperation with Tim Walz in Minnesota While ICE Operations and Fraud Investigations Continue",
    "description": "President Donald Trump and his officials are releasing conciliatory messages after a weekend when another street activist was killed in a Minneapolis scuffle caused by Democrat-backed, anti-enforcement crowds.\nThe post Trump Talks Cooperation with Tim Walz in…",
    "link": "https://www.breitbart.com/crime/2026/01/26/trump-talks-cooperation-with-tim-walz-in-minnesota-while-ice-operations-and-fraud-investigations-continue/",
    "timestamp": "2026-01-26T19:41:56Z"
  },
  {
    "title": "California Post brings brash New York-style tabloid news to the West Coast",
    "description": "The Los Angeles outpost of the New York Post will be “digital first.”",
    "link": "https://www.bostonherald.com/2026/01/26/california-post-launch/",
    "timestamp": "2026-01-26T19:40:31Z"
  },
  {
    "title": "Israeli and Palestinian captives and prisoners: A timeline of key events",
    "description": "Israelis held captive in Gaza and Palestinians swept into Israel detention centres have been focus of ceasefire talks.",
    "link": "https://www.aljazeera.com/news/2026/1/26/israeli-and-palestinian-captives-and-prisoners-a-timeline-of-key-events",
    "timestamp": "2026-01-26T19:40:06Z"
  },
  {
    "title": "A man is under arrest for allegedly assaulting US Rep. Maxwell Frost at the Sundance Film Festival",
    "description": "The suspect reportedly crashed the private party.",
    "link": "https://www.bostonherald.com/2026/01/26/rep-frost-assaulted/",
    "timestamp": "2026-01-26T19:37:20Z"
  },
  {
    "title": "Here Are The Republicans Questioning ICE In Minnesota",
    "description": "A growing number of GOP lawmakers are questioning the continued federal law enforcement presence in Minnesota following the fatal shooting of Alex Pretti.",
    "link": "https://dailycaller.com/2026/01/26/alex-pretti-james-comer-andrew-garbarino-law-enforcement-minnesota/",
    "timestamp": "2026-01-26T19:35:57Z"
  },
  {
    "title": "These Companies—Palantir, AT&T, Deloitte—Have The Biggest ICE Contracts As DHS Funding Under Fire",
    "description": "Demonstrations have demanded an end to federal funding for ICE, after two protesters were killed by federal agents in Minneapolis.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/26/these-companies-palantir-att-deloitte-have-the-biggest-ice-contracts-as-dhs-funding-under-fire/",
    "timestamp": "2026-01-26T19:33:59Z"
  },
  {
    "title": "Karoline Leavitt Grilled on Trump’s Commitment to 2nd Amendment After Alex Pretti Shooting",
    "description": "White House press secretary Karoline Leavitt affirmed President Donald Trump's staunch support of the Second Amendment and right to bear arms after the shooting of Alex Pretti in Minnesota on Saturday.\nThe post Karoline Leavitt Grilled on Trump’s Commitment t…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-grilled-on-trumps-commitment-to-2nd-amendment-after-alex-pretti-shooting/",
    "timestamp": "2026-01-26T19:33:40Z"
  },
  {
    "title": "Businesses face pressure to respond to immigration enforcement while also becoming a target of it",
    "description": "Businesses are coming into the crosshairs of President Donald Trump’s mass deportation campaign, whether it’s public pressure for them to speak out against aggressive immigration enforcement or becoming the sites for arrests themselves",
    "link": "https://abcnews.go.com/Business/wireStory/businesses-face-pressure-respond-immigration-enforcement-becoming-target-129567788",
    "timestamp": "2026-01-26T19:33:32Z"
  },
  {
    "title": "WATCH: iShowSpeed pulls off dangerous backflip at Ghana’s Black Star Square during live stream",
    "description": "American streamer iShowSpeed thrilled fans by performing a daring backflip next to Ghana's Black Star monument on January 26, 2026. The stunt occurred during his Africa tour's final show at Black Star Square, showcasing his adventurous streaming style. While …",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/watch-ishowspeed-pulls-off-dangerous-backflip-at-ghanas-black-star-square-during-live-stream/articleshow/127571330.cms",
    "timestamp": "2026-01-26T19:30:56Z"
  },
  {
    "title": "India, EU finalise FTA, deal set to be announced today",
    "description": "India and the European Union have finalized a comprehensive free trade agreement after 18 years of talks, poised to boost trade and investment. The deal, expected to be announced Tuesday, aims for significant tariff reductions on most goods, with India gainin…",
    "link": "https://timesofindia.indiatimes.com/india/india-eu-finalise-fta-deal-set-to-be-announced-today/articleshow/127570923.cms",
    "timestamp": "2026-01-26T19:29:04Z"
  },
  {
    "title": "President Donald Trump says he won’t attend Super Bowl",
    "description": "'I’m anti-them,' Trump said of the planned musical performers on Super Bowl Sunday.",
    "link": "https://www.bostonherald.com/2026/01/26/president-donald-trump-says-he-wont-attend-super-bowl/",
    "timestamp": "2026-01-26T19:26:54Z"
  },
  {
    "title": "Trump tells New York Magazine he'll sue its 'a-- off' if reporter writes 'bad story' on his health",
    "description": "President Donald Trump reportedly threatened to sue New York Magazine's \"a-- off\" if it wrote a \"bad\" story about his health during an Oval Office interview.",
    "link": "https://www.foxnews.com/media/trump-tells-new-york-magazine-hell-sue-a-off-reporter-writes-bad-story-his-health",
    "timestamp": "2026-01-26T19:26:28Z"
  },
  {
    "title": "Starmer would be a fool to follow Carney in embracing Beijing",
    "description": "Sir Keir Starmer recently tried to take credit for his role in Donald Trump’s partial climbdown on tariffs relating to Greenland. Whether he played any meaningful part is debatable. What is beyond doubt, however, is that Donald Trump will happily reach for th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364071/posts",
    "timestamp": "2026-01-26T19:26:26Z"
  },
  {
    "title": "Paul Allen ‘taking a few days off’ after ‘paid protestors’ claim",
    "description": "Vikings announcer Paul Allen said he'll be taking a few days off following comments he made about \"paid protestors\" in the snowy and bitter cold temperatures durng the immigration crackdown in Minnesota.",
    "link": "https://nypost.com/2026/01/26/sports/kfans-paul-allen-taking-a-few-days-off-after-paid-protestors-claim/",
    "timestamp": "2026-01-26T19:26:15Z"
  },
  {
    "title": "Gold’s digital rally mirrors increasing stress on US dollar",
    "description": "Tether’s XAUt now dominates the gold-backed stablecoin market as investors turn to digital and physical gold amid a weakening US dollar and rising geopolitical uncertainty.",
    "link": "https://cointelegraph.com/news/gold-digital-rally-mirrors-rising-stress-dollar",
    "timestamp": "2026-01-26T19:23:38Z"
  },
  {
    "title": "Leavitt says Trump spoke to Walz, demands Minnesota 'work together peacefully' with ICE: 'Let cops be cops'",
    "description": "President Donald Trump demanded Minnesota Gov Tim Walz cooperate on immigration enforcement after a direct phone call on Monday.",
    "link": "https://www.foxnews.com/politics/trump-says-spoke-walz-demands-minnesota-work-together-peacefully-ice-let-cops-cops",
    "timestamp": "2026-01-26T19:23:23Z"
  },
  {
    "title": "A safe space: How figure skating became a comfort zone for the LGBTQ+ community amid perilous times",
    "description": "Those in skating's LGBTQ+ community are leaning on each other amid a tumultuous time.",
    "link": "https://www.bostonherald.com/2026/01/26/figure-skating-lgbtq-safe-space/",
    "timestamp": "2026-01-26T19:23:05Z"
  },
  {
    "title": "'Out of control': Gov. Healey criticizes Trump administration",
    "description": "\"Kristi Noem has got to go. ICE has got to get out of these communities now. And Donald Trump needs to act and step up,\" Gov. Healey said.",
    "link": "https://www.wcvb.com/article/healey-massachusetts-pretti-minnesota-shooting-reaction/70144428",
    "timestamp": "2026-01-26T19:22:35Z"
  },
  {
    "title": "‘Fluid Situation’: Karoline Leavitt Awkwardly Responds After Being Confronted on Officials Calling Alex Pretti an ‘Assassin’",
    "description": "Karoline Leavitt appeared to acknowledge that Trump Cabinet members jumped to conclusions when they labeled Alex Pretti an \"assassin.\"\nThe post ‘Fluid Situation’: Karoline Leavitt Awkwardly Responds After Being Confronted on Officials Calling Alex Pretti an ‘…",
    "link": "https://www.mediaite.com/politics/fluid-situation-karoline-leavitt-awkwardly-responds-after-being-confronted-on-officials-calling-alex-pretti-an-assassin/",
    "timestamp": "2026-01-26T19:22:07Z"
  },
  {
    "title": "ICE protest draws thousands in Salt Lake City",
    "description": "On Sunday afternoon, thousands of protestors gathered at the Wallace F. Bennett Federal Building in downtown Salt Lake City to protest Immigration and Customs Enforcement (ICE) — following the killing of Alex Pretti, a 37-year old nurse in Minneapolis, by ICE…",
    "link": "https://dailyutahchronicle.com/2026/01/26/thousands-protest-ice/",
    "timestamp": "2026-01-26T19:22:05Z"
  },
  {
    "title": "Is TikTok Censoring Anti-ICE Content?",
    "description": "Many users are raising concerns about the platform's content moderation under it new ownership.",
    "link": "https://www.cosmopolitan.com/politics/a70144099/tiktok-ice-censorship/",
    "timestamp": "2026-01-26T19:22:00Z"
  },
  {
    "title": "Trump and U.S. government have declared war on Minneapolis, says former mayor",
    "description": "Former mayor of Minneapolis R. T. Rybak says people in his city are coming together against what he sees as an attack from the U.S. federal government.",
    "link": "https://www.cbc.ca/radio/thecurrent/minneapolis-mayor-ice-shooting-9.7061500",
    "timestamp": "2026-01-26T19:21:36Z"
  },
  {
    "title": "CNN Data Chief Declares ICE Operations a ‘Political Disaster’ for Trump Admin: DHS Secretary Noem Negative in ‘Every Single Poll’",
    "description": "CNN chief data analyst Harry Enten on Monday declared that ICE's conduct has proven to be a \"political disaster\" for President Donald Trump.\nThe post CNN Data Chief Declares ICE Operations a ‘Political Disaster’ for Trump Admin: DHS Secretary Noem Negative in…",
    "link": "https://www.mediaite.com/politics/cnn-data-chief-declares-ice-operations-a-political-disaster-for-trump-admin-dhs-secretary-noem-negative-in-every-single-poll/",
    "timestamp": "2026-01-26T19:20:30Z"
  },
  {
    "title": "LLM Brainrot Is Here: Grokipedia Is Starting to Show Up in ChatGPT Citations",
    "description": "GPT-5.2 is \"learning\" from Musk’s AI-generated version of Wikipedia.",
    "link": "https://gizmodo.com/llm-brainrot-is-here-grokipedia-is-starting-to-show-up-in-chatgpt-citations-2000714001",
    "timestamp": "2026-01-26T19:20:01Z"
  },
  {
    "title": "Trump Backpedals From Portraying Alex Pretti As a 'Domestic Terrorist' and 'Would-Be Assassin'",
    "description": "Although the president initially reinforced that plainly inaccurate narrative, his subsequent comments cast doubt on the initial justification for shooting the Minneapolis protester.",
    "link": "https://reason.com/2026/01/26/trump-backpedals-from-portraying-alex-pretti-as-a-domestic-terrorist-and-would-be-assassin/",
    "timestamp": "2026-01-26T19:18:34Z"
  },
  {
    "title": "Gateway Pundit Reporter Tees Up Karoline Leavitt to Blast ‘Liberal Biased Media’ for ‘Picking and Choosing Victims’",
    "description": "Gateway Pundit's Jordan Conradson hand-fed a friendly question to press secretary Karoline Leavitt comparing Alex Pretti with Ashli Babbitt.\nThe post Gateway Pundit Reporter Tees Up Karoline Leavitt to Blast ‘Liberal Biased Media’ for ‘Picking and Choosing Vi…",
    "link": "https://www.mediaite.com/media/news/gateway-pundit-reporter-tees-up-karoline-leavitt-to-blast-liberal-biased-media-for-picking-and-choosing-victims/",
    "timestamp": "2026-01-26T19:15:28Z"
  },
  {
    "title": "White House backs Noem, Border Patrol as Homan takes point in Minneapolis after fatal shooting",
    "description": "Border czar Tom Homan deployed to Minnesota following fatal shootings of Alex Pretti and Renee Good by federal agents, as White House addresses immigration enforcement tensions.",
    "link": "https://www.foxnews.com/politics/white-house-backs-noem-border-patrol-homan-takes-point-minneapolis-after-fatal-shooting",
    "timestamp": "2026-01-26T19:15:12Z"
  },
  {
    "title": "Americans largely at odds with Trump administration on immigration, ICE tactics: Polls",
    "description": "Americans largely at odds with Trump administration on immigration, ICE tactics: Pollsgo.com",
    "link": "https://abcnews.go.com/Politics/americans-largely-odds-trump-administration-immigration-ice-tactics/story?id=129567440",
    "timestamp": "2026-01-26T19:14:49Z"
  },
  {
    "title": "President Trump says he won’t attend Super Bowl, criticizes Bad Bunny and Green Day - The Athletic - The New York Times",
    "description": "President Trump says he won’t attend Super Bowl, criticizes Bad Bunny and Green Day - The AthleticThe New York Times Why is Trump skipping the Super Bowl? Oft-traveling president says it’s ‘too far’latimes.com Donald Trump will skip Super Bowl, disses its per…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180660602",
    "timestamp": "2026-01-26T19:12:40Z"
  },
  {
    "title": "Lula, Trump discuss ‘Board of Peace’, agree to meet in Washington: Brazil",
    "description": "Lula criticises US actions in Venezuela, calling the capture of Maduro an unacceptable line against regional stability.",
    "link": "https://www.aljazeera.com/news/2026/1/26/lula-trump-discuss-board-of-peace-agree-to-meet-in-washington-brazil",
    "timestamp": "2026-01-26T19:11:57Z"
  },
  {
    "title": "Trump says U.S. used secret 'discombobulator' on Venezuelan equipment during Maduro raid",
    "description": "President Trump says the U.S. used a secret weapon to disable Venezuelan equipment when the U.S. captured Nicolás Maduro.",
    "link": "https://www.pbs.org/newshour/nation/trump-says-u-s-used-secret-discombobulator-on-venezuelan-equipment-during-maduro-raid",
    "timestamp": "2026-01-26T19:11:49Z"
  },
  {
    "title": "President Herzog: 'An entire nation breathes a sigh of relief tonight'",
    "description": "President Isaac Herzog and US Ambassador Mike Huckabee spoke about Ran Gvili's return at the annual lecture of the Jabotinsky Institute at the President’s Residence in Jerusalem.",
    "link": "https://www.israelnationalnews.com/news/421506",
    "timestamp": "2026-01-26T19:11:31Z"
  },
  {
    "title": "Minnesota Cops Surrender Entire City Blocks To Lawless Rioters",
    "description": "Local and state police have been slow to respond to crowds blocking roads and attacking a hotel during protests against immigration enforcement.",
    "link": "https://dailycaller.com/2026/01/26/minnesota-cops-surrender-entire-city-blocks-to-lawless-rioters/",
    "timestamp": "2026-01-26T19:10:44Z"
  },
  {
    "title": "Melania Trump hosts star-studded White House screening ahead of her film's release",
    "description": "First lady Melania Trump hosted an exclusive White House screening of her upcoming film \"MELANIA,\" featuring an array of A-list guests and branded gifts.",
    "link": "https://www.foxnews.com/lifestyle/melania-trump-hosts-star-studded-white-house-screening-ahead-film-release",
    "timestamp": "2026-01-26T19:10:15Z"
  },
  {
    "title": "U.S. Posts Minneapolis On Craigslist ($50 OBO)",
    "description": "U.S. — Seemingly at a loss as to how to solve the ongoing problems originating from the North Star State, everyone else in the United States reached a joint agreement to post Minnesota on Craigslist for $50 or best offer.",
    "link": "https://babylonbee.com/news/us-posts-minneapolis-on-craigslist-50-obo",
    "timestamp": "2026-01-26T19:07:18Z"
  },
  {
    "title": "Top African health chief slams Trump plan for human experiments in Africa - NewsBreak",
    "description": "The clash between African health leaders and the Trump administration over a controversial vaccine study in Guinea-Bissau has quickly become a test of who",
    "link": "https://www.newsbreak.com/share/4459938919309-top-african-health-chief-slams-trump-plan-for-human-experiments-in-africa?_f=app_share&amp;pd=05JR3wtB&amp;lang=en_US&amp;send_time=1769454260&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.51.1.3%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-26T19:05:57Z"
  },
  {
    "title": "Abraham Lincoln Carrier Strike Group Has Arrived In The Middle East",
    "description": "U.S. Central Command confirmed on Monday that USS Abraham Lincoln was deployed to promote regional security and stability",
    "link": "https://www.forbes.com/sites/petersuciu/2026/01/26/abraham-lincoln-carrier-strike-group-has-arrived-in-the-middle-east/",
    "timestamp": "2026-01-26T19:05:26Z"
  },
  {
    "title": "The New Political Football: To Boycott The World Cup, Or Not",
    "description": "Several soccer and government officials have expressed varying opinions on whether their countries should boycott the World Cup this summer.",
    "link": "https://www.forbes.com/sites/michaellewis/2026/01/26/the-new-political-football-to-boycott-the-world-cup-or-not/",
    "timestamp": "2026-01-26T19:05:22Z"
  },
  {
    "title": "Donald Trump eyeing trip to watch Rory McIlroy defend title on DP World Tour",
    "description": "Rory McIlroy is expected to return to a popular DP World Tour event in 2026 with significant expectations as the defending champion. The tournament is already drawing attention due to its setting and place on the golfing calendar.",
    "link": "https://www.hitc.com/donald-trump-eyeing-trip-to-watch-rory-mcilroy-defend-title-on-dp-world-tour/",
    "timestamp": "2026-01-26T19:05:00Z"
  },
  {
    "title": "Be Not Afraid: School Choice Is a Winning Issue",
    "description": "There are three certainties in life: death, taxes, and the claim that any school choice proposal will spell doom for public schools. With each new... Read More\nThe post Be Not Afraid: School Choice Is a Winning Issue appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/26/be-not-afraid-school-choice-is-a-winning-issue/",
    "timestamp": "2026-01-26T19:05:00Z"
  },
  {
    "title": "Ticketless travel: BMTC collects Rs 6.5L in fines in Dec",
    "description": "Bengaluru: Line-checking officials of Bengaluru Metropolitan Transport Corporation (BMTC) imposed penalties totalling Rs 6.3 lakh on passengers travel.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/ticketless-travel-bmtc-collects-rs-6-5l-in-fines-in-dec/articleshow/127567978.cms",
    "timestamp": "2026-01-26T19:04:00Z"
  },
  {
    "title": "Judd Apatow Blasts Trump's Illegal Immigration Crackdown as 'Completely Heinous': 'Everybody Has to Get Involved and Wake Up'",
    "description": "Hollywood producer and directing powerhouse Judd Apatow is calling on fellow left-wingers to get more active in the fight against President Donald Trump and the federal government's illegal immigration crackdown.\nThe post Judd Apatow Blasts Trump’s Illegal Im…",
    "link": "https://www.breitbart.com/entertainment/2026/01/26/judd-apatow-blasts-trumps-illegal-immigration-crackdown-as-completely-heinous-everybody-has-to-get-involved-and-wake-up/",
    "timestamp": "2026-01-26T19:03:51Z"
  },
  {
    "title": "Trump Talks With Key Democrat Politician Following Second Deadly Shooting in Minnesota",
    "description": "President Donald Trump said he had a “good call” with Minnesota Gov. Tim Walz on Monday, just two days after a second fatal shooting in... Read More\nThe post Trump Talks With Key Democrat Politician Following Second Deadly Shooting in Minnesota   appeared fir…",
    "link": "https://www.dailysignal.com/2026/01/26/trump-talks-with-key-democrat-politician-following-second-deadly-shooting-in-minnesota/",
    "timestamp": "2026-01-26T19:02:55Z"
  },
  {
    "title": "Trump Forgets the Word for Alzheimer’s Disease While Insisting That He Doesn’t Have It",
    "description": "\"What do they call it?\" \nThe post Trump Forgets the Word for Alzheimer’s Disease While Insisting That He Doesn’t Have It appeared first on Futurism.",
    "link": "http://futurism.com/health-medicine/trump-forgets-word-alzheimers",
    "timestamp": "2026-01-26T19:01:32Z"
  },
  {
    "title": "Trump scrambles to pass buck as Kennedy Center bleeds money: 'I merely came in to save it'",
    "description": "As ticket sales plummet\r\n and performances get canceled\r\n at the Kennedy Center following Donald Trump’s takeover of the institution earlier this year, the president took to social media Monday to shift blame for the venue’s financial troubles\r\n to past admin…",
    "link": "https://www.rawstory.com/trump-2675034728/",
    "timestamp": "2026-01-26T19:01:02Z"
  },
  {
    "title": "Trump Orders Review That Could Reopen Offshore Oil Leasing Off California",
    "description": "U.S. President Donald Trump has taken the first formal step toward reopening offshore oil and gas leasing off California, after the federal government launched a process that could lead to the first new offshore lease sales in the state in decades. The Bureau…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Orders-Review-That-Could-Reopen-Offshore-Oil-Leasing-Off-California.html",
    "timestamp": "2026-01-26T19:00:00Z"
  },
  {
    "title": "Self-described Minn Antifa member calls for 'armed' men to stop immigration agents he calls 'mass murderers'",
    "description": "Minneapolis Antifa activist Kyle Wagner demands armed response against federal immigration agents after two anti-ICE agitators killed this month.",
    "link": "https://www.foxnews.com/us/self-described-minn-antifa-member-calls-armed-men-stop-immigration-agents-he-calls-mass-murderers",
    "timestamp": "2026-01-26T18:59:33Z"
  },
  {
    "title": "Man charged with assaulting Rep. Maxwell Frost at Sundance Film Festival",
    "description": "Frost writes on X that he was punched by a man who claimed President Donald Trump would deport him.",
    "link": "https://www.pbs.org/newshour/politics/man-charged-with-assaulting-rep-maxwell-frost-at-sundance-film-festival",
    "timestamp": "2026-01-26T18:58:18Z"
  },
  {
    "title": "Minister claims 'sabotage' behind Chagos debate delay",
    "description": "The Conservatives have raised further concerns after Donald Trump described the agreement as a \"great act of stupidity\".",
    "link": "https://www.bbc.com/news/articles/czjgwllmy99o",
    "timestamp": "2026-01-26T18:58:11Z"
  },
  {
    "title": "America's business leaders need to say something. Now.",
    "description": "It's understandable that CEOs and other leaders are wary of wading into the latest shooting in Minneapolis. But that's not an excuse for silence.",
    "link": "https://www.businessinsider.com/business-leader-ceo-silence-alex-pretti-killing-minneapolis-2026-1",
    "timestamp": "2026-01-26T18:57:58Z"
  },
  {
    "title": "China's aging population is saving its way towards economic stagnation",
    "description": "Unlike many Western economies, Chinese households stash away more than 40 per cent of their income. But the pressure to boost local consumption is mounting for Beijing.",
    "link": "https://www.abc.net.au/news/2026-01-27/chinas-aging-population-is-saving-towards-economic-stagnation/106270300",
    "timestamp": "2026-01-26T18:57:54Z"
  },
  {
    "title": "BREAKING: Canada Backs Down on China Deal After Trump Threatens Carney with Tariffs",
    "description": "Trump issued the warning Saturday, threatening 100 percent tariffs if Canada moved forward with a trade agreement with China.",
    "link": "https://www.westernjournal.com/breaking-canada-backs-china-deal-trump-threatens-carney-tariffs/",
    "timestamp": "2026-01-26T18:57:52Z"
  },
  {
    "title": "Donald Trump 'Planning Brutal Revenge on Rod Stewart' After Grizzled Rocker Attacked Prez Over 'Brit Afghan Coward Soldiers' Outburst",
    "description": "Donald Trump has been planning brutal revenge after rocker Rod Stewart criticized his Afghan remarks.",
    "link": "https://radaronline.com/p/donald-trump-planned-revenge-rod-stewart-afghan-comments/",
    "timestamp": "2026-01-26T18:57:05Z"
  },
  {
    "title": "Canada holds firm on trade pivot as Energy Minister heads to India",
    "description": "Canada's trade diversification strategy will not be deterred by US threats, according to Foreign Minister Anita Anand. Despite President Trump's tariff warning, Canada is committed to reducing its reliance on the US market and forging new trade partnerships, …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/canada-holds-firm-on-trade-pivot-as-energy-minister-heads-to-india/articleshow/127569851.cms",
    "timestamp": "2026-01-26T18:56:45Z"
  },
  {
    "title": "Are New Owners Censoring TikTok? Top Democrats, Influencers, Celebrities Raising Concerns",
    "description": "TikTok pointed to a power outage at a U.S. data center after some users reported trouble getting views or uploading videos.",
    "link": "https://www.forbes.com/sites/conormurray/2026/01/26/are-new-owners-censoring-tiktok-top-democrats-influencers-celebrities-raising-concerns/",
    "timestamp": "2026-01-26T18:55:48Z"
  },
  {
    "title": "Is Trump looking for an off-ramp out of Minnesota?",
    "description": "The Trump administration seems convinced that because “immigration” was a winning issue for them in 2024 literally anything they do with respect to immigration will be popular. The truth is that military invasions of American cities that involve killing rando…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/is-trump-looking-for-an-off-ramp-out-of-minnesota",
    "timestamp": "2026-01-26T18:54:39Z"
  },
  {
    "title": "Gov candidate Steve Hilton launches CAL DOGE to expose billions in waste, fraud: ‘This is about accountability’",
    "description": "He blamed Democrats for allowing the state’s bloated budget.",
    "link": "https://nypost.com/2026/01/26/us-news/steve-hilton-launches-cal-doge-to-expose-billions-in-fraud/",
    "timestamp": "2026-01-26T18:53:53Z"
  },
  {
    "title": "One of the Few House Democrats Who Voted With Republicans to Fund DHS Says 'I Failed'",
    "description": "One of the seven Democrats who voted with nearly all Republicans in the House of Representatives to pass a multibillion-dollar Department of Homeland Security funding bill last week expressed remorse after DHS killed another US citizen in Minnesota.\"I failed …",
    "link": "https://www.commondreams.org/news/dhs-funding",
    "timestamp": "2026-01-26T18:52:54Z"
  },
  {
    "title": "This Hong Kong billionaire invests 25% of his wealth in gold: ‘If you have the physical gold … nobody owes you anything’",
    "description": "It’s all about the era of “vault flight,” Cheah Cheng Hye told Bloomberg. You don’t want your money in America as much.",
    "link": "https://fortune.com/2026/01/26/hong-kong-billionaire-25-percent-of-his-wealth-gold-vault-flight-capital-away-from-america/",
    "timestamp": "2026-01-26T18:50:23Z"
  },
  {
    "title": "Karoline Leavitt Turns the Heat Back Up On Tim Walz Shortly After He and Trump Buried the Hatchet: ‘Spreading Lies’",
    "description": "Karoline Leavitt slammed Tim Walz for encouraging the \"hysteria\" against ICE that she said directly contributed to the shooting death of Alex Pretti\nThe post Karoline Leavitt Turns the Heat Back Up On Tim Walz Shortly After He and Trump Buried the Hatchet: ‘S…",
    "link": "https://www.mediaite.com/politics/karoline-leavitt-turns-the-heat-back-up-on-tim-walz-shortly-after-he-and-trump-buried-the-hatchet-spreading-lies/",
    "timestamp": "2026-01-26T18:50:14Z"
  },
  {
    "title": "NATO chief wishes ‘good luck’ to those who think Europe can defend itself without US help",
    "description": "Tensions are festering within NATO over US President Donald Trump’s renewed threats in recent weeks to annex Greenland, which is a semiautonomous territory of NATO ally Denmark.",
    "link": "https://indianexpress.com/article/world/nato-chief-wishes-good-luck-who-think-europe-can-defend-itself-without-us-help-10496063/",
    "timestamp": "2026-01-26T18:48:33Z"
  },
  {
    "title": "Republic Day: Delhi CM Rekha Gupta lays foundation stone for slum development projects",
    "description": "\"The previous governments spread fear that the BJP would stop free electricity and water, but these slum dwellers can now live peacefully. We are committed to providing them a good and quality life,\" Gupta told reporters.",
    "link": "https://timesofindia.indiatimes.com/india/republic-day-delhi-cm-rekha-gupta-lays-foundation-stone-for-slum-development-projects/articleshow/127569334.cms",
    "timestamp": "2026-01-26T18:48:27Z"
  },
  {
    "title": "Immigration officers fear Trump just doomed their jobs: 'We lost all trust'",
    "description": "Current and former immigration officers spoke out against President Donald Trump's crackdown in Minnesota Monday.A Customs and Border Patrol agent shot and killed 37-year-old Alex Pretti over the weekend, less than three weeks after a veteran Immigration and …",
    "link": "https://www.rawstory.com/immigration-crackdown-minneapolis/",
    "timestamp": "2026-01-26T18:47:04Z"
  },
  {
    "title": "Is the Trump administration’s immigration crackdown working?",
    "description": "There has been a second fatal shooting in the US state of Minnesota this month.",
    "link": "https://www.aljazeera.com/video/inside-story/2026/1/26/is-the-trump-administrations-immigration-crackdown-working",
    "timestamp": "2026-01-26T18:47:03Z"
  },
  {
    "title": "Judge Weighs Whether to Block ICE Surge in Minnesota",
    "description": "U.S. District Judge Katherine Menendez pressed attorneys for Minnesota and the Justice Department on Monday about the state’s claims that federal government violated the Tenth... Read More\nThe post Judge Weighs Whether to Block ICE Surge in Minnesota appeared…",
    "link": "https://www.dailysignal.com/2026/01/26/judge-weighs-whether-block-ice-surge-minnesota/",
    "timestamp": "2026-01-26T18:47:00Z"
  },
  {
    "title": "Trump's antisemitism envoy slams Walz for comparing ICE enforcement to Anne Frank, Holocaust",
    "description": "Trump's antisemitism envoy slammed Gov. Tim Walz for comparing immigration enforcement to Holocaust and Anne Frank's tragic story during World War II conflict.",
    "link": "https://www.foxnews.com/politics/trumps-antisemitism-envoy-slams-walz-comparing-ice-enforcement-anne-frank-holocaust",
    "timestamp": "2026-01-26T18:46:14Z"
  },
  {
    "title": "Walz says Trump agreed to look into reducing federal agents in Minnesota",
    "description": "The post is a change of tune for Trump, as he has threatened to invoke the Insurrection Act and send federal troops into Minnesota.",
    "link": "https://www.kare11.com/article/news/local/ice-in-minnesota/president-trump-calls-gov-walz-says-theyre-on-a-similar-wavelength/89-5990ba2e-d8cb-4850-af27-6871d49ecc17",
    "timestamp": "2026-01-26T18:45:48Z"
  },
  {
    "title": "One year, one chart and an eye-popping jump in Ilhan Omar’s personal wealth",
    "description": "Ilhan Omar's federal disclosures reveal dramatic asset increases in husband's ventures, with eStCru LLC winery rising from $15,000-$50,000 to $1-5 million.",
    "link": "https://www.foxnews.com/politics/one-year-one-chart-eye-popping-jump-ilhan-omars-personal-wealth",
    "timestamp": "2026-01-26T18:45:35Z"
  },
  {
    "title": "Despite pardon, court says disbarment might be appropriate for lawyer who stormed the Capitol",
    "description": "Public reprimand was not enough punishment for a lawyer who admitted to entering the U.S. Capitol Building with rioters on Jan. 6, 2021, the Georgia Supreme Court recently found.",
    "link": "https://www.abajournal.com/news/article/despite-pardon-court-says-disbarment-might-be-appropriate-for-lawyer-who-stormed-the-capitol",
    "timestamp": "2026-01-26T18:45:00Z"
  },
  {
    "title": "Prior notice to accused not needed in cheque-bounce cases: Karnataka HC",
    "description": "Bengaluru: In cheque-bounce cases, a court is not required to issue notice to the accused or hear them before taking cognisance of the offence, the Ka.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/prior-notice-to-accused-not-needed-in-cheque-bounce-cases-karnataka-hc/articleshow/127567849.cms",
    "timestamp": "2026-01-26T18:45:00Z"
  },
  {
    "title": "Iran-backed militias in Iraq and Yemen threaten new attacks as U.S. carrier approaches region",
    "description": "Yemen's Houthi rebels hinted at resuming attacks on Red Sea shipping. Iraq's Kataib Hezbollah also issued a threat on Sunday, warning of \"total war\" if Iran is targeted.",
    "link": "https://www.pbs.org/newshour/world/iran-backed-militias-in-iraq-and-yemen-threaten-new-attacks-as-u-s-carrier-approaches-region",
    "timestamp": "2026-01-26T18:43:39Z"
  },
  {
    "title": "WATCH: Venezuelan Ex-Political Prisoner Dresses as Teddy Bear to Surprise His Children",
    "description": "Venezuelan ex-political prisoner Víctor Borjas surprised his two daughters – whom he had not seen in over a year – by wearing a teddy bear costume in a heartfelt Sunday reunion after his release from unjust imprisonment.\nThe post WATCH: Venezuelan Ex-Politica…",
    "link": "https://www.breitbart.com/national-security/2026/01/26/watch-venezuelan-ex-political-prisoner-dresses-as-teddy-bear-to-surprise-his-children/",
    "timestamp": "2026-01-26T18:43:12Z"
  },
  {
    "title": "‘TERRORISTIC THREATS’: Librarian arrested for allegedly recruiting killers to assassinate President Trump",
    "description": "'This is an active criminal investigation with documented and troubling concerns'",
    "link": "https://www.wnd.com/2026/01/terroristic-threats-librarian-arrested-allegedly-recruiting-killers-assassinate/",
    "timestamp": "2026-01-26T18:42:57Z"
  },
  {
    "title": "Stephen Colbert To Be Honored With WGA East’s Walter Bernstein Award",
    "description": "With The Late Show set to end in May, Stephen Colbert is receiving this year’s Walter Bernstein Award from the Writers Guild of America East. The honor will be bestowed on March 8 at the WGA Awards‘ East Coast ceremony in New York, which takes place concurren…",
    "link": "http://deadline.com/2026/01/stephen-colbert-wga-east-walter-bernstein-award-1236697081/",
    "timestamp": "2026-01-26T18:42:52Z"
  },
  {
    "title": "Limit Peace Board to Gaza, Lula sets conditions for joining Trump",
    "description": "Brazil’s President Lula asks President Trump to limit his proposed Board of Peace to the Gaza conflict and to include a seat for Palestine.\n\nRead More: https://punchng.com/limit-peace-board-to-gaza-lula-sets-conditions-for-joining-trump/",
    "link": "https://punchng.com/limit-peace-board-to-gaza-lula-sets-conditions-for-joining-trump/",
    "timestamp": "2026-01-26T18:40:56Z"
  },
  {
    "title": "Republican senator criticises Vance, Navarro & Trump for blocking India trade deal: Audio",
    "description": "Republican Senator Ted Cruz has reportedly criticized US Vice President JD Vance, White House adviser Peter Navarro, and President Donald Trump. The criticism centers on their alleged blocking of a proposed trade deal with India. These allegations surfaced fr…",
    "link": "https://economictimes.indiatimes.com/news/india/republican-senator-criticises-vance-navarro-trump-for-blocking-india-trade-deal-audio/articleshow/127569098.cms",
    "timestamp": "2026-01-26T18:40:56Z"
  },
  {
    "title": "Gov. Tim Walz Gives A 'Pro-Tip' To Pam Bondi Over Her Demands",
    "description": "Minnesota Gov. Tim Walz was asked about Attorney General Pam Bondi's demands after ICE agents executed another American citizen, Alex Pretti, an appalling action that's become a tipping point in this country. Bondi's avalanche of lies is coming under scrutiny…",
    "link": "https://crooksandliars.com/2026/01/gov-tim-walz-gives-pro-tip-pam-bondi-over",
    "timestamp": "2026-01-26T18:40:13Z"
  },
  {
    "title": "‘My People Need Me!!! And I Need Them’: Bad Bunny’s Political Awakening in Puerto Rico",
    "description": "An exclusive excerpt from the book 'P FKN R: How Bad Bunny Became the Global Voice of Puerto Rican Resistance' traces the star's music and activism.",
    "link": "http://www.rollingstone.com/music/music-latin/bad-bunny-politics-protests-pfknr-book-excerpt-1235504162/",
    "timestamp": "2026-01-26T18:39:28Z"
  },
  {
    "title": "Malta weighing invitation to join Trump's 'Board of Peace'",
    "description": "PM tells parliament Malta will do whatever is in the national interest, irrespective of EU position",
    "link": "https://timesofmalta.com/article/malta-weighing-invitation-join-trump-board-peace.1123132",
    "timestamp": "2026-01-26T18:38:07Z"
  },
  {
    "title": "Minnesota GOP gubernatorial candidate Chris Madel drops out, faults Trump immigration policy",
    "description": "Republican candidate for Minnesota governor Chris Madel has ended his campaign in a surprise video announcement",
    "link": "https://abcnews.go.com/Politics/wireStory/minnesota-gop-gubernatorial-candidate-chris-madel-drops-faults-129570999",
    "timestamp": "2026-01-26T18:37:53Z"
  },
  {
    "title": "‘Politically Disastrous!’ Fox’s Kennedy Calls Out Kristi Noem and Stephen Miller in Surprising Commentary",
    "description": "Kennedy placed blame on several parties for the Alex Pretti shooting, rebuking Kristi Noem and Stephen Miller for causing a \"politically disastrous\" headache for President Trump.\nThe post ‘Politically Disastrous!’ Fox’s Kennedy Calls Out Kristi Noem and Steph…",
    "link": "https://www.mediaite.com/media/tv/politically-disastrous-foxs-kennedy-calls-out-kristi-noem-and-stephen-miller-in-surprising-commentary/",
    "timestamp": "2026-01-26T18:37:46Z"
  },
  {
    "title": "US-Taliban talks ‘stalled’ over Guantanamo prisoner – NYT",
    "description": "The Taliban has reportedly offered to release the last two US detainees in exchange for an Afghan prisoner held in Guantanamo Bay Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631544-us-taliban-talks-stalled-guantanamo/",
    "timestamp": "2026-01-26T18:36:37Z"
  },
  {
    "title": "US Treasury Department ends contracts with Booz Allen Hamilton after Trump tax leak",
    "description": "US Treasury Department ends contracts with Booz Allen Hamilton after Trump tax leak",
    "link": "https://www.livemint.com/companies/us-treasury-department-ends-contracts-with-booz-allen-hamilton-after-trump-tax-leak-11769452595272.html",
    "timestamp": "2026-01-26T18:36:34Z"
  }
]