[
  {
    "title": "This High Tech Billionaire Was Anti-Trump – Now He Wants Him to Send the National Guard to San Francisco and the Left is Outraged",
    "description": "Marc Benioff is the founder and CEO of Salesforce.\nThe post This High Tech Billionaire Was Anti-Trump – Now He Wants Him to Send the National Guard to San Francisco and the Left is Outraged appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/this-high-tech-billionaire-was-anti-trump-now/",
    "timestamp": "2025-10-14T03:20:46Z"
  },
  {
    "title": "Fake TV President Martin Sheen Gives Real President Donald Trump Advice on Being Real President: 'Start Being Human' (Warner Todd Huston/Breitbart)",
    "description": "Warner Todd Huston / Breitbart:\nFake TV President Martin Sheen Gives Real President Donald Trump Advice on Being Real President: ‘Start Being Human’  —  Actor Martin Sheen, who liberals love for pretending to be a president in the early 2000s as President Jed…",
    "link": "https://www.memeorandum.com/251013/p126",
    "timestamp": "2025-10-14T03:20:00Z"
  },
  {
    "title": "Did Trump’s ‘beautiful’ praise for Meloni during Gaza Summit make her uncomfortable? Here’s what the 79 years old US President say for 48-year-old Italian PM in Egypt",
    "description": "During a Gaza summit in Egypt, Trump unexpectedly praised Italian Prime Minister Giorgia Meloni, calling her \"beautiful\" and \"incredible.\" Trump acknowledged the potential for his comments to be seen as sexist, but stated he would \"take his chances.\" Meloni, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-trumps-beautiful-praise-for-meloni-during-gaza-summit-make-her-uncomfortable-heres-what-the-79-years-old-us-president-say-for-48-year-old-italian-pm-in-egypt/articleshow/124542216.cms",
    "timestamp": "2025-10-14T03:15:03Z"
  },
  {
    "title": "Maxine Waters threatens to keep gov't shut down if Dems don't get health insurance tax credits",
    "description": "“The left has framed these subsidies as an act of compassion,” Sally Pipes said. “In reality, they are corporate welfare for insurers and a driver of dependency.”",
    "link": "https://justthenews.com/nation/states/center-square/la-congresswoman-insists-health-insurance-tax-credits",
    "timestamp": "2025-10-14T03:13:41Z"
  },
  {
    "title": "Starmer mocked after humiliating moment with Trump where PM 'thought he was being invited to speak'",
    "description": "Sir Keir Starmer has been mocked after he awkwardly thought Donald Trump was inviting him to the stage to speak. The UK Prime Minister was lined up behind the US President as he spoke to the world's media in Egypt, taking time to praise leaders for their invo…",
    "link": "https://freerepublic.com/focus/f-news/4346220/posts",
    "timestamp": "2025-10-14T03:13:36Z"
  },
  {
    "title": "Monday, October 13. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,329.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/10/13/monday-october-13-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-10-14T03:10:43Z"
  },
  {
    "title": "Sen. Markwayne Mullin Says Only People With ‘Deranged Hatred’ Protest Trump",
    "description": "Sen. Markwayne Mullin said the only reason one would protest President Donald Trump is if one had a \"deranged hatred\" of Trump.\nThe post Sen. Markwayne Mullin Says Only People With ‘Deranged Hatred’ Protest Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/sen-markwayne-mullin-says-only-people-with-deranged-hatred-protest-trump/",
    "timestamp": "2025-10-14T03:10:17Z"
  },
  {
    "title": "Indian textile exporters turn to Europe, offer discounts to offset US tariffs",
    "description": "(Reuters) -Indian textile exporters are seeking new buyers in Europe and offering discounts to existing U. customers to cushion the blow from steep U.",
    "link": "https://finance.yahoo.com/news/indian-textile-exporters-turn-europe-030959322.html",
    "timestamp": "2025-10-14T03:09:59Z"
  },
  {
    "title": "US Threats Cast Doubt On Shipping Emissions Deal",
    "description": "An ambitious plan by the UN's shipping agency to cut maritime emissions could be scuttled at the last minute after the United States threatened to impose sanctions on those supporting it.",
    "link": "https://www.ibtimes.com/us-threats-cast-doubt-shipping-emissions-deal-3786870",
    "timestamp": "2025-10-14T03:06:14Z"
  },
  {
    "title": "Letitia James campaigns for Zohran Mamdani in her first public appearance since federal indictment",
    "description": "New York Attorney General Letitia James delivered an impassioned speech Monday night in support of New York mayoral candidate Zohran Mamdani in her first public appearance since her federal indictment last week.“He is a leader fighting for a better future for…",
    "link": "https://www.nbcnews.com/politics/elections/letitia-james-campaigns-zohran-mamdani-public-appearance-indictment-rcna237458",
    "timestamp": "2025-10-14T03:06:08Z"
  },
  {
    "title": "U.S. investments, and rhetoric, help AstraZeneca seal drug deal with Trump",
    "description": "Deal to lower drug costs for Americans and shield the drugmaker from import tariffs was the culmination of efforts stretching back to November last year, sources say.",
    "link": "https://www.japantimes.co.jp/business/2025/10/14/companies/astrazeneca-medicine-deal-trump/",
    "timestamp": "2025-10-14T03:05:00Z"
  },
  {
    "title": "Watch: Egyptian F-16 fighter jets surprise Air Force One, escort President Trump into Sharm el-Sheikh ahead of Gaza Peace Summit",
    "description": "Egyptian fighter jets provided an impressive escort for US President Donald Trump's aircraft as it entered Egyptian airspace. This military cooperation preceded the historic Gaza Peace Summit. President Trump acknowledged the advanced Egyptian F-16s. The summ…",
    "link": "https://economictimes.indiatimes.com/news/international/us/watch-egyptian-f-16-fighter-jets-surprise-air-force-one-escort-president-trump-into-sharm-el-sheikh-ahead-of-gaza-peace-summit/articleshow/124542058.cms",
    "timestamp": "2025-10-14T03:03:03Z"
  },
  {
    "title": "China starts charging fees for US ships as trade tensions rise",
    "description": "It comes as the US is set to start collecting fees on China-linked ships from 14 October.",
    "link": "https://www.bbc.com/news/articles/ce3x1elkxvvo",
    "timestamp": "2025-10-14T03:00:41Z"
  },
  {
    "title": "Ex-DOJ lawyer issues stark warning about Trump's deportations: 'Already past the point'",
    "description": "Former federal prosecutor Joyce Vance issued a stark warning about President Donald Trump's deportations in a new Substack essay on Monday. Vance, a law professor at the University of Alabama, argued in the essay that Trump's deportations are putting American…",
    "link": "https://www.rawstory.com/hard-to-watch-ex-doj-lawyer-issues-stark-warning-about-trump-s-deportations/",
    "timestamp": "2025-10-14T02:57:38Z"
  },
  {
    "title": "Asian Stocks Pare Tariff-led Losses, Tokyo Hit By Political Turmoil",
    "description": "Most Asian stocks rose Tuesday, tracking a rally on Wall Street, after Donald Trump tempered his rhetoric against China, which he has threatened with 100 percent tariffs, while Tokyo struggled amid Japanese political turmoil.",
    "link": "https://www.ibtimes.com/asian-stocks-pare-tariff-led-losses-tokyo-hit-political-turmoil-3786867",
    "timestamp": "2025-10-14T02:57:18Z"
  },
  {
    "title": "Actor Martin Sheen Laughably Lectures Trump on How to Be President Because He Once Played One on TV",
    "description": "Veteran actor Martin Sheen once played a U.S. president on The West Wing. We can assume that’s why he foolishly...",
    "link": "https://twitchy.com/warren-squire/2025/10/13/actor-martin-sheen-goes-after-trump-n2420317",
    "timestamp": "2025-10-14T02:54:47Z"
  },
  {
    "title": "US, China to roll out tit-for-tat port fees, threatening more turmoil at sea",
    "description": "The United States and China have initiated reciprocal port fee charges on ocean shipping firms, escalating their trade war. These levies, affecting vessels moving goods and oil, aim to reshape the global maritime industry. Analysts warn of distorted freight f…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-china-to-roll-out-tit-for-tat-port-fees-threatening-more-turmoil-at-sea/articleshow/124541878.cms",
    "timestamp": "2025-10-14T02:50:24Z"
  },
  {
    "title": "'Hand It Back!': Roger Stone Calls On Nobel Peace Prize Winner To Surrender Award To Trump",
    "description": "The longtime Trump ally explained why the winner should consider \"bestowing\" the coveted award to the president.",
    "link": "https://www.huffpost.com/entry/roger-stone-nobel-peace-prize-surrender-trump_n_68ed9bb4e4b09c6fd0c3527a",
    "timestamp": "2025-10-14T02:49:44Z"
  },
  {
    "title": "Trump: US Forces Could Soon Be On The Ground In Venezuela",
    "description": "President Donald Trump has suggested that United States forces could soon be on the ground in Venezuela. The U.S. ruling class could quickly escalate a brewing conflict from sea to land operations, expanding what the ruler has called “a war on terrorist drug …",
    "link": "https://www.activistpost.com/trump-us-forces-could-soon-be-on-the-ground-in-venezuela/",
    "timestamp": "2025-10-14T02:48:00Z"
  },
  {
    "title": "Project 2025: Trump Has Implemented Half of Conservative Plan—Tracker",
    "description": "President Donald Trump has enacted nearly half of Project 2025 during his first nine months in office, according to a tracker. Newsweek reached out to the White House for comment via email. Why It Matters Project 2025, a 900-page blueprint developed by conser…",
    "link": "https://freerepublic.com/focus/f-chat/4346214/posts",
    "timestamp": "2025-10-14T02:47:55Z"
  },
  {
    "title": "‘Crowd FUD’ is the best signal for when to buy Bitcoin: Analyst",
    "description": "US political developments have driven at least four major crypto slumps this year, giving smart traders a chance to stack crypto each time, according to Santiment.",
    "link": "https://cointelegraph.com/news/bitcoin-fud-retail-selloff-trump-tariffs-2025",
    "timestamp": "2025-10-14T02:44:50Z"
  },
  {
    "title": "Bessent: Trump on track to meet Xi, tensions have de-escalated",
    "description": "US News: WASHINGTON: US President Donald Trump was on track to meet with Chinese leader Xi Jinping in South Korea as the two sides de-escalate tensions over tr.",
    "link": "https://timesofindia.indiatimes.com/world/us/bessent-trump-on-track-to-meet-xi-tensions-have-de-escalated/articleshow/124541678.cms",
    "timestamp": "2025-10-14T02:41:25Z"
  },
  {
    "title": "US, China to roll out tit-for-tat port fees, threatening more turmoil at sea",
    "description": "BEIJING/LOS ANGELES () -The United States and China on Tuesday will begin charging additional port fees on ocean shipping firms that move everything from...",
    "link": "https://www.yahoo.com/news/articles/us-china-roll-tit-tat-024050674.html",
    "timestamp": "2025-10-14T02:40:50Z"
  },
  {
    "title": "How Obama and Biden Alienated Egypt’s Sisi, a Core Ally in Trump’s Peace Deal",
    "description": "Egypt’s President Abdel Fattah el-Sisi has proven to be a key partner in President Donald Trump’s peace plan for Gaza, helping with the negotiations and hosting a triumphant Gaza peace conference in the city of Sharm el-Sheikh on Monday.\nThe post How Obama an…",
    "link": "https://www.breitbart.com/middle-east/2025/10/13/how-obama-biden-alienated-egypts-sisi-core-ally-trumps-peace-deal/",
    "timestamp": "2025-10-14T02:35:53Z"
  },
  {
    "title": "House Speaker Predicts This Shutdown Will Break The Previous Record Under Trump",
    "description": "The longest U.S. government shutdown lasted for 35 days under Trump from December 2018 to January 2019.",
    "link": "https://www.huffpost.com/entry/mike-johnson-predict-shutdown-will-break-the-previous-record-under-trump_n_68ed920fe4b058bb20d37326",
    "timestamp": "2025-10-14T02:34:49Z"
  },
  {
    "title": "Brit Hume Predicts Renewed Saudi-Israeli Talks As Hamas Loses Grip On Region",
    "description": "Brit Hume said Monday renewed normalization talks between Saudi Arabia and Israel could soon resume as Hamas loses its standing in the region.",
    "link": "https://dailycaller.com/2025/10/13/brit-hume-saudi-israel-talk/",
    "timestamp": "2025-10-14T02:33:59Z"
  },
  {
    "title": "New York Attorney General Letitia James, facing fraud charges, strikes defiant tone at Mamdani rally",
    "description": "New York Attorney General Letitia James has struck a defiant tone as she faces federal fraud charges",
    "link": "https://abcnews.go.com/Politics/wireStory/new-york-attorney-general-letitia-james-facing-fraud-126492454",
    "timestamp": "2025-10-14T02:29:32Z"
  },
  {
    "title": "Private numbers of Australia PM and Donald Trump Jr publicly listed on website",
    "description": "It is unclear how the website - which uses AI to scrape the internet - obtained the private contact details.",
    "link": "https://www.bbc.com/news/articles/c5y03zg5wwxo",
    "timestamp": "2025-10-14T02:29:08Z"
  },
  {
    "title": "At summit in Egypt, Trump urges all to put old feuds to rest",
    "description": "Middle East News: SHARM AL SHEIKH: President Donald Trump called for a new era of harmony in the Middle East on Monday during a global summit on Gaza's future, trying t.",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/at-summit-in-egypt-trump-urges-all-to-put-old-feuds-to-rest/articleshow/124541477.cms",
    "timestamp": "2025-10-14T02:23:59Z"
  },
  {
    "title": "Why has the latest Afghanistan-Pakistan conflict erupted?",
    "description": "Late on Saturday, Taliban forces attacked Pakistani military posts along the length of the 2,600-kilometer border, with Pakistani forces later retaliating.",
    "link": "https://www.japantimes.co.jp/news/2025/10/14/world/politics/afghanistan-pakistan-conflict-explainer/",
    "timestamp": "2025-10-14T02:23:00Z"
  },
  {
    "title": "China says will 'fight to the end' in US trade war",
    "description": "China declared its readiness to \"fight to the end\" in a trade war with the United States following President Trump's announcement of an additional 100 percent tariff on all Chinese goods. Beijing stated its export controls on rare earths are legitimate action…",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-says-will-fight-to-the-end-in-us-trade-war/articleshow/124541482.cms",
    "timestamp": "2025-10-14T02:21:28Z"
  },
  {
    "title": "Democrat Strategist Stunned by Trump’s Success in the Middle East: ‘It’s Historic And He Deserves All The Credit’ (VIDEO)",
    "description": "Dan Turrentine is a regular contributor on Mark Halperin’s ‘2 Way’ program.\nThe post Democrat Strategist Stunned by Trump’s Success in the Middle East: ‘It’s Historic And He Deserves All The Credit’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/democrat-strategist-stunned-trumps-success-middle-east-its/",
    "timestamp": "2025-10-14T02:20:29Z"
  },
  {
    "title": "Trump says focus is on \"rebuilding of Gaza,\" declines to comment on Palestinian statehood",
    "description": "US President Donald Trump avoided taking a stance on recognizing a Palestinian state. He emphasized the immediate need to rebuild Gaza and negotiate peace. Trump stated that discussions on the political structure of a future Palestinian state would take time.…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-focus-is-on-rebuilding-of-gaza-declines-to-comment-on-palestinian-statehood/articleshow/124541425.cms",
    "timestamp": "2025-10-14T02:16:35Z"
  },
  {
    "title": "Venezuelan Nobel Winner Says Maduro Will Leave Power 'With Or Without' Talks",
    "description": "Nicolas Maduro's time is up but he can still leave power peacefully, Venezuelan Nobel Peace Prize laureate Maria Corina Machado told AFP in an interview from hiding on Monday.",
    "link": "https://www.ibtimes.com/venezuelan-nobel-winner-says-maduro-will-leave-power-without-talks-3786861",
    "timestamp": "2025-10-14T02:15:20Z"
  },
  {
    "title": "Venezuelan Nobel Winner Says Maduro Will Leave Power 'With Or Without' Talks",
    "description": "Nicolas Maduro's time is up but he can still leave power peacefully, Venezuelan Nobel Peace Prize laureate Maria Corina Machado told AFP in an interview from hiding on Monday.",
    "link": "https://www.ibtimes.com.au/venezuelan-nobel-winner-says-maduro-will-leave-power-without-talks-1860832",
    "timestamp": "2025-10-14T02:15:09Z"
  },
  {
    "title": "U.S. consumers will pay 55% of Trump tariff costs, Goldman Sachs says",
    "description": "U.S. consumers will likely pay for more than half the cost of tariffs this year through higher prices, according to a new Goldman Sachs analysis.",
    "link": "https://www.upi.com/Top_News/US/2025/10/13/consumers-55-Trump-tariffs-goldman-sachs/8051760404249/",
    "timestamp": "2025-10-14T02:15:04Z"
  },
  {
    "title": "Dollar rebounds as fears of renewed US-China trade feud abate",
    "description": "The dollar held steady as President Trump's softened rhetoric on China tariffs and a potential meeting with Xi Jinping eased trade tensions. This de-escalation boosted the dollar, impacting other currencies like the euro, sterling, and New Zealand dollar. Mea…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-rebounds-as-fears-of-renewed-us-china-trade-feud-abate/articleshow/124541368.cms",
    "timestamp": "2025-10-14T02:11:06Z"
  },
  {
    "title": "Five things to know about Australia's critical minerals",
    "description": "Sydney (AFP) Oct 14, 2025\n\n\n Australia is pushing to lock in a critical minerals deal with the United States, dangling access to its vast reserves as an alternative to China. \n\nChina dominates the production of metals used in everything from solar panels to p…",
    "link": "https://www.spacedaily.com/reports/Five_things_to_know_about_Australias_critical_minerals_999.html",
    "timestamp": "2025-10-14T02:10:36Z"
  },
  {
    "title": "Top Ukraine officials head to US for defence talks: Zelensky aide",
    "description": "Kyiv, Ukraine (AFP) Oct 13, 2025\n\n Top Ukrainian officials were travelling to Washington for defence talks with US officials, the presidential office said Monday, as Russia intensifies attacks on Ukraine's energy grid and Washington weighs the delivery of lon…",
    "link": "https://www.spacewar.com/reports/Top_Ukraine_officials_head_to_US_for_defence_talks_Zelensky_aide_999.html",
    "timestamp": "2025-10-14T02:10:36Z"
  },
  {
    "title": "Trump says would be 'great to get a peace deal' with Iran",
    "description": "Jerusalem (AFP) Oct 13, 2025\n\n\n US President Donald Trump on Monday said he wanted a peace deal with Iran, after the United States joined Israel in striking the Islamic republic's nuclear sites during a brief war earlier this year. \n\n\"They got it from one sid…",
    "link": "https://www.spacewar.com/reports/Trump_says_would_be_great_to_get_a_peace_deal_with_Iran_999.html",
    "timestamp": "2025-10-14T02:10:36Z"
  },
  {
    "title": "Oil edges up as US-China de-escalate trade tensions",
    "description": "Oil prices edged higher as U.S.-China trade tensions showed signs of easing, boosting market sentiment and alleviating concerns over global fuel demand. Despite recent setbacks, both nations are reportedly engaged in substantial communications, with a potenti…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-edges-up-as-us-china-de-escalate-trade-tensions/articleshow/124541346.cms",
    "timestamp": "2025-10-14T02:08:25Z"
  },
  {
    "title": "Gold hits record high on safe-haven rush; silver follows suit",
    "description": "Gold and silver prices have reached all-time peaks. This surge is driven by renewed trade tensions between the U.S. and China, increasing global uncertainty. Expectations of U.S. interest rate cuts are also supporting the precious metals. Analysts predict fur…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-hits-record-high-on-safe-haven-rush-silver-follows-suit/articleshow/124541322.cms",
    "timestamp": "2025-10-14T02:05:28Z"
  },
  {
    "title": "China says will 'fight to the end' in US trade war",
    "description": "BEIJING: China said on Tuesday (Oct 14) it was ready to \"fight to the end\" in a trade war with the United States after President Donald Trump said he would impose an additional 100 per cen",
    "link": "https://www.channelnewsasia.com/east-asia/china-us-trade-war-fight-end-trump-tariffs-5399996",
    "timestamp": "2025-10-14T02:04:31Z"
  },
  {
    "title": "Wall Street ends sharply higher on Trump China comments; Broadcom surges",
    "description": "Indian markets saw a strong rebound on Monday.  Chipmakers like Broadcom led the gains.  President Donald Trump's conciliatory tone on U.S.-China trade eased investor worries.  AI stocks were major beneficiaries.  Investors are now looking towards upcoming qu…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-sharply-higher-on-trump-china-comments-broadcom-surges/articleshow/124541290.cms",
    "timestamp": "2025-10-14T02:02:20Z"
  },
  {
    "title": "‘Damage is done’: Mass firings and dysfunction at CDC spark chaos for public health, critics warn - NewsBreak",
    "description": "The firings of hundreds of employees at the Centers for Disease Control and Prevention , and their sudden reinstatement after an “error” sent layoff notice",
    "link": "https://www.newsbreak.com/share/4289758329196-damage-is-done-mass-firings-and-dysfunction-at-cdc-spark-chaos-for-public-health-critics-warn?s=a7&amp;share_destination_id=NzI1ODg2OTUtMTc2MDQwNzI4OTg2MA%3D%3D&amp;pd=04uZdPbD&amp;hl=en_US&amp;send_time=1760407289&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-14T02:02:05Z"
  },
  {
    "title": "Donald Trump, the shakedown president",
    "description": "Soon, everyone will get wiser and realize they have alternatives — and that when they unite, the U.S. president will be unable to continue his shake down operations.",
    "link": "https://www.politico.eu/article/donald-trump-us-white-house-shakedown-president/",
    "timestamp": "2025-10-14T02:02:00Z"
  },
  {
    "title": "Trump Signs Historic Gaza Ceasefire Deal In Egypt With Middle East Leaders",
    "description": "Alongside several Middle East leaders US President Doanld Trump signed a Gaza ceasefire deal during his visit to Egypt. Trump while visiting the Israeli parliament said that the “long and painful nightmare is finally over.” He further added that, “This is a h…",
    "link": "https://www.ndtvprofit.com/world/trump-signs-historic-gaza-ceasefire-deal-in-egypt-with-middle-east-leaders",
    "timestamp": "2025-10-14T02:00:12Z"
  },
  {
    "title": "New York Times, AP, Reuters and Newsmax among news organizations fighting new press rules",
    "description": "News organizations including the New York Times, The Associated Press and the conservative Newsmax television network said Monday they will not sign a Defence Department document about its new press rules, making it likely the Trump administration will evict …",
    "link": "https://www.cbc.ca/news/world/new-york-times-ap-newsmax-pentagon-rules-9.6937341",
    "timestamp": "2025-10-14T01:59:18Z"
  },
  {
    "title": "Indicted Trump foe defies president at rally for NY mayoral frontrunner",
    "description": "New York's top law officer Letitia James, charged with crimes by Donald Trump's justice department, defiantly threw her weight Monday behind mayoral...",
    "link": "https://www.yahoo.com/news/articles/indicted-trump-foe-defies-president-015910749.html",
    "timestamp": "2025-10-14T01:59:10Z"
  },
  {
    "title": "Why crypto briefly but dramatically crashed when President Trump renewed his trade war",
    "description": "Cryptocurrencies plunged in value on Friday in a short but significant flash crash, leaving investors with billions of dollars in losses and highlighting the volatility associated with the industry.",
    "link": "https://www.kcra.com/article/crypto-volatility-trump-tariff-fears-explainer/69021091",
    "timestamp": "2025-10-14T01:56:02Z"
  },
  {
    "title": "Why crypto briefly but dramatically crashed when President Trump renewed his trade war",
    "description": "Cryptocurrencies plunged in value on Friday in a short but significant flash crash, leaving investors with billions of dollars in losses and highlighting the volatility associated with the industry.",
    "link": "https://www.wmur.com/article/crypto-volatility-trump-tariff-fears-explainer/69021091",
    "timestamp": "2025-10-14T01:55:36Z"
  },
  {
    "title": "US China News Updates: China says will 'fight to the end' in US trade war",
    "description": "China said on Tuesday it was ready to \"fight to the end\" in a trade war with the United States after President Donald Trump said he would impose an additional 100 percent tariff on the world's second-largest economy.",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-live-updates-china-us-trade-war-bjp-congress-israel-pakistan-afghanistan-ukraine-russia-war/liveblog/124541214.cms",
    "timestamp": "2025-10-14T01:55:28Z"
  },
  {
    "title": "Trump hails 'tremendous day for Middle East' as leaders sign Gaza declaration",
    "description": "US President Donald Trump declared a \"tremendous day for the Middle East\" as he and regional leaders signed a Gaza ceasefire declaration. This followed the exchange of hostages held by Hamas for nearly 2,000 Palestinian prisoners released by Israel, marking a…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-hails-tremendous-day-for-middle-east-as-leaders-sign-gaza-declaration/articleshow/124541211.cms",
    "timestamp": "2025-10-14T01:55:24Z"
  },
  {
    "title": "Trump already trying to walk back his new tariff threat with China: WSJ",
    "description": "President Donald Trump was ramping up another round of trade salvos with China, but now he appears to be looking for a way to back down and make nice, wrote the conservative Wall Street Journal editorial board — and the feeling looks mutual.\"After threatening…",
    "link": "https://www.rawstory.com/trump-tariffs-china-2674181165/",
    "timestamp": "2025-10-14T01:55:02Z"
  },
  {
    "title": "‘Glad You Upgraded Me’: Trump, Canadian Prime Minister Exchange Jokes In Hot Mic Moment",
    "description": "Following President Donald Trump's remarks on peace in the Middle East, Canadian Prime Minister Mark Carney joked that he had given him an \"upgraded\" title.",
    "link": "https://dailycaller.com/2025/10/13/donald-trump-canadian-prime-minister-exchange-jokes-hot-mic-moment/",
    "timestamp": "2025-10-14T01:54:16Z"
  },
  {
    "title": "Why crypto briefly but dramatically crashed when President Trump renewed his trade war",
    "description": "Cryptocurrencies plunged in value on Friday in a short but significant flash crash, leaving investors with billions of dollars in losses and highlighting the volatility associated with the industry.",
    "link": "https://www.wgal.com/article/crypto-volatility-trump-tariff-fears-explainer/69021091",
    "timestamp": "2025-10-14T01:53:29Z"
  },
  {
    "title": "Trump basks in the spotlight in Egypt with harder part to come",
    "description": "Trump has offered a vision for a broader Middle East peace after the success of U.S.-led mediation efforts to end the fighting in Gaza. But these goals are formidable.",
    "link": "https://www.japantimes.co.jp/news/2025/10/14/world/politics/trump-middle-east-peace-focus/",
    "timestamp": "2025-10-14T01:53:00Z"
  },
  {
    "title": "Why crypto briefly but dramatically crashed when President Trump renewed his trade war",
    "description": "Cryptocurrencies plunged in value on Friday in a short but significant flash crash, leaving investors with billions of dollars in losses and highlighting the volatility associated with the industry.",
    "link": "https://www.wtae.com/article/crypto-volatility-trump-tariff-fears-explainer/69021091",
    "timestamp": "2025-10-14T01:51:28Z"
  },
  {
    "title": "Blinken says Trump's Gaza peace plan based on Biden administration work",
    "description": "Former President Joe Biden and Antony Blinken each took some credit Monday for President Donald Trump's Israel-Hamas cease-fire deal, arguing it followed groundwork laid by the Biden administration.",
    "link": "https://www.foxnews.com/politics/biden-blinken-take-credit-groundwork-behind-trumps-gaza-ceasefire-deal",
    "timestamp": "2025-10-14T01:50:46Z"
  },
  {
    "title": "Trump, Xi spark another standoff with world economy at risk",
    "description": "U.S. President Donald Trump and Chinese leader Xi Jinping’s latest tit-for-tat showdown has both countries claiming the ball is now in the other’s court, with the clock ticking toward another escalation in import tariffs.\nAfter Trump signaled openness to doin…",
    "link": "https://biztoc.com/x/33e4633919ab9fb3",
    "timestamp": "2025-10-14T01:49:35Z"
  },
  {
    "title": "Sensex Today | Stock Market LIVE Updates: GIFT Nifty signals a muted start; Asian shares trade mixed",
    "description": "Sensex Today | Stock Market LIVE Updates: The Indian market closed lower on Monday, dragged down primarily by IT stocks, as renewed U.S.-China trade tensions weighed on investor sentiment. The decline came after U.S. President Donald Trump intensified tariff …",
    "link": "https://m.economictimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-14-october-2025/liveblog/124541150.cms",
    "timestamp": "2025-10-14T01:46:50Z"
  },
  {
    "title": "Oil Edges Higher With US-China Trade Tensions, Demand in Focus",
    "description": "Oil advanced after paring a slump in the week’s opening session, as investors weigh the fallout of renewed US-China trade tensions against demand.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-edges-higher-with-us-china-trade-tensions-demand-in-focus",
    "timestamp": "2025-10-14T01:45:28Z"
  },
  {
    "title": "Obama: Trump’s Deployment of National Guard Is ‘Inherently Corrupting’ and Un-American",
    "description": "Former President Barack Obama stated that President Donald Trump’s deployment of National Guard troops to quell crime in Democrat-run cities is “inherently corrupting,” arguing that he would have received a different reaction from conservative media if he had…",
    "link": "https://freerepublic.com/focus/f-backroom/4346212/posts",
    "timestamp": "2025-10-14T01:44:00Z"
  },
  {
    "title": "Obama: Trump’s Deployment of National Guard Is ‘Inherently Corrupting’ and Un-American",
    "description": "Former President Barack Obama stated that President Donald Trump’s deployment of National Guard troops to quell crime in Democrat-run cities is “inherently corrupting,” arguing that he would have received a different reaction from conservative media if he had…",
    "link": "https://freerepublic.com/focus/f-news/4346212/posts",
    "timestamp": "2025-10-14T01:44:00Z"
  },
  {
    "title": "Trump, disruptor-in-chief, becomes the unlikely peacemaker in Gaza",
    "description": "It is immensely heartening that the guns have fallen silent, the hostages have returned home, and the spotlight is on Palestine. Will Hamas disarm and Israel withdraw?",
    "link": "https://indianexpress.com/article/opinion/editorials/trump-disruptor-in-chief-becomes-the-unlikely-peacemaker-in-gaza-10305254/",
    "timestamp": "2025-10-14T01:40:41Z"
  },
  {
    "title": "Trump to greet Argentina's Milei at 1 pm ET",
    "description": "United States President Donald Trump will welcome Argentine President Javier Milei at the White House on Tuesday for their scheduled meeting, according to Trump's official schedule.\nThe US presid...",
    "link": "https://biztoc.com/x/dc5f54c8140c4b6c",
    "timestamp": "2025-10-14T01:39:06Z"
  },
  {
    "title": "Donald Trump's Granddaughter Kai Asked For 'Best Advice' On The Golf Course — Grandpa's Answer Is Echoed By These Successful People",
    "description": "During a weekend golf outing captured on her YouTube channel, U.S. President Donald Trump shared heartfelt life advice with his granddaughter Kai Trump — a message that mirrors what some of the world's most successful people have said for decades.\nTrump's Sim…",
    "link": "https://biztoc.com/x/8ee6ee5ce01a9e9b",
    "timestamp": "2025-10-14T01:38:27Z"
  },
  {
    "title": "Trump, Xi spark another standoff with world economy at risk",
    "description": "The question now is which side blinks first.",
    "link": "https://www.japantimes.co.jp/business/2025/10/14/economy/trump-xi-standoff-world-economy/",
    "timestamp": "2025-10-14T01:38:00Z"
  },
  {
    "title": "'Pakistan And India Will Live Very Nicely Together,' Says Trump, Asks Sharif 'Right?' | Watch",
    "description": "India and Pakistan are going to \"live very nicely together\", US President Donald Trump said on Tuesday, in the presence of many world leaders during a summit in Egypt.",
    "link": "https://www.ndtvprofit.com/world/pakistan-and-india-will-live-very-nicely-together-says-trump-asks-sharif-right-watch",
    "timestamp": "2025-10-14T01:37:40Z"
  },
  {
    "title": "Pakistan Prime Minister Shehbaz Sharif Endorses Trump For Nobel Peace Prize, Again",
    "description": "Pakistan Prime Minister Shehbaz Sharif has once again endorsed Donald Trump for the Nobel Peace Prize, an accolade he recently missed out to Venezuelan activist María Corina Machado Parisca. Speaking at the Gaza Peace Summit in Egypt, Sharif said he would lik…",
    "link": "https://www.ndtvprofit.com/world/pakistan-prime-minister-shehbaz-sharif-endorses-trump-for-nobel-peace-prize-again",
    "timestamp": "2025-10-14T01:37:17Z"
  },
  {
    "title": "Jasmine Crockett Launches Investigation Into Alleged Cover Up Of Trump’s Failing Health: ‘The American People Deserve the Truth’ - NewsBreak",
    "description": "Congresswoman Jasmine Crockett (TX-30) has formally demanded answers from the White House regarding President Donald J. Trump’s health, citing what she cal",
    "link": "https://www.newsbreak.com/share/4286932363008-jasmine-crockett-launches-investigation-into-alleged-cover-up-of-trump-s-failing-health-the-american-people-deserve-the-truth?s=a2&amp;share_destination_id=ODg1MTU1ODEtMTc2MDQwNTczMjg5NA%3D%3D&amp;pd=05zOwfH7&amp;hl=en_US&amp;send_time=1760405732&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-14T01:35:58Z"
  },
  {
    "title": "Stephen Colbert guest-stars in quirky mystery series as murdered talk show host",
    "description": "Show host Stephen Colbert played a murdered talk show host in the 'Elsbeth' season 3 premiere, coincidentally airing a few months after CBS announced his show's 2026 cancellation.",
    "link": "https://www.foxnews.com/media/stephen-colbert-guest-stars-quirky-mystery-series-murdered-talk-show-host",
    "timestamp": "2025-10-14T01:30:36Z"
  },
  {
    "title": "Indonesian president asks Trump for meeting with son Eric in 'hot mic' moment (Reuters)",
    "description": "Reuters:\nIndonesian president asks Trump for meeting with son Eric in ‘hot mic’ moment  —  Indonesian President Prabowo Subianto asked U.S. President Donald Trump on Monday if he could meet with Trump's son Eric, an executive vice president of the Trump Organ…",
    "link": "https://www.memeorandum.com/251013/p116",
    "timestamp": "2025-10-14T01:30:02Z"
  },
  {
    "title": "Obama: Trump's Deployment of National Guard Is 'Inherently Corrupting' and Un-American",
    "description": "Former President Barack Obama stated that President Donald Trump's deployment of National Guard troops to quell crime in Democrat-run cities is \"inherently corrupting,\" arguing that he would have received a different reaction from conservative media if he had…",
    "link": "https://www.breitbart.com/politics/2025/10/13/obama-trumps-deployment-national-guard-inherently-corrupting-un-american/",
    "timestamp": "2025-10-14T01:28:55Z"
  },
  {
    "title": "Federal government shutdown could be the longest ever, House Speaker Johnson warns",
    "description": "At its core, the shutdown is a debate over health care policy — particularly the Affordable Care Act subsidies that are expiring for millions of Americans",
    "link": "http://coloradosun.com/2025/10/13/federal-government-shutdown-colorado-mike-johnson/",
    "timestamp": "2025-10-14T01:27:36Z"
  },
  {
    "title": "CNBC Daily Open: There's a hopeful mood in the Middle East and the markets",
    "description": "Trump, when asked by reporters if the war in the Middle East has ended, gave an unequivocal \"yes,\" Reuters reported.",
    "link": "https://www.cnbc.com/2025/10/14/cnbc-daily-open-theres-a-hopeful-mood-in-the-middle-east-and-the-markets.html",
    "timestamp": "2025-10-14T01:24:59Z"
  },
  {
    "title": "Trump hails India as ‘great country’; predicts India-Pakistan will ‘live very nicely together’",
    "description": "At the Gaza peace summit in Egypt’s Sharm el-Sheikh, U.S. President Donald Trump praised India as “a great country” led by “a very good friend of mine,” referring to PM Modi.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-hails-india-as-great-country-predicts-india-pakistan-will-live-very-nicely-together/article70161113.ece",
    "timestamp": "2025-10-14T01:24:26Z"
  },
  {
    "title": "Fmr. Biden Israel Amb.: Trump Has 'Unique Ability' to Create Urgency to Avoid His 'Wrath' and That Got Hostage Deal",
    "description": "On Monday’s broadcast of CNN’s “OutFront,” Jack Lew, who was the U.S. Ambassador to Israel under President Joe Biden, said that President Donald Trump created “a force field where other principals feel that they’re compelled to act. He did that\nThe post Fmr. …",
    "link": "https://www.breitbart.com/clips/2025/10/13/fmr-biden-israel-amb-trump-has-unique-ability-to-create-urgency-to-avoid-his-wrath-and-that-got-hostage-deal/",
    "timestamp": "2025-10-14T01:20:14Z"
  },
  {
    "title": "Brandel Chamblee Reveals what President Trump Told Him About the Future of LIV Golf",
    "description": "Former golf pro and LIV Golf critic Brandel Chamblee has revealed what President Donald Trump told him about LIV Golf.\nThe post Brandel Chamblee Reveals what President Trump Told Him About the Future of LIV Golf appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/10/13/brandel-chamblee-reveals-what-president-trump-told-him-about-future-liv-golf/",
    "timestamp": "2025-10-14T01:10:39Z"
  },
  {
    "title": "War for Ukraine Day 1,327: Another Day Another War Crime",
    "description": "(Image by NEIVANMADE) The Russians dropped a glide bomb on a hospital in Kharkiv about four or five hours ago. I’ll get to all of that, as well as the other genocidal war crimes after the jump. One quick note on another matter: the twenty surviving hostages a…",
    "link": "https://balloon-juice.com/2025/10/13/war-for-ukraine-day-1327-another-day-another-war-crime/",
    "timestamp": "2025-10-14T01:09:57Z"
  },
  {
    "title": "Japanese Stocks Open Lower, Silver Sets New Peak: Markets Wrap",
    "description": "Japanese shares and the yen fell amid a brewing political crisis in the country, even as renewed optimism over US-China trade talks lifted sentiment across global markets. Futures indicated further gains for US stocks.",
    "link": "https://www.ndtvprofit.com/markets/japanese-stocks-open-lower-silver-sets-new-peak-markets-wrap",
    "timestamp": "2025-10-14T01:09:43Z"
  },
  {
    "title": "How to Attend a ‘No Kings’ Rally Saturday",
    "description": "This Saturday, mutants from coast to coast will assemble outside the basements and Pokémon clubs for the first time…since the last time this coalition of unlovable virgins and elderly, unliked parents gathered together to fool themselves into thinking they mi…",
    "link": "https://freerepublic.com/focus/f-news/4346209/posts",
    "timestamp": "2025-10-14T01:08:32Z"
  },
  {
    "title": "Alan Dershowitz Makes Case For Pardoning Netanyahu",
    "description": "Alan Dershowitz called for Israeli President Isaac Herzog to pardon Prime Minister Benjamin Netanyahu on Newsmax Monday.",
    "link": "https://dailycaller.com/2025/10/13/alan-dershowitz-pardon-netanyahu/",
    "timestamp": "2025-10-14T01:08:05Z"
  },
  {
    "title": "Kristi Noem says Coast Guard members will get paid during the government shutdown",
    "description": "The Department of Homeland Security found an \"innovative solution\" to ensure Coast Guard personnel get paid. Most federal workers aren't receiving paychecks.",
    "link": "https://www.nbcnews.com/politics/trump-administration/kristi-noem-coast-guard-members-will-get-paid-government-shutdown-rcna237439",
    "timestamp": "2025-10-14T01:02:28Z"
  },
  {
    "title": "Tech Leader Roasted For Backing Trump's Threat To Send National Guard To San Francisco",
    "description": "Comments from Salesforce CEO Marc Benioff were met with fierce backlash.",
    "link": "https://www.huffpost.com/entry/marc-benioff-salesforce-trump-national-guard_n_68ed8391e4b0e8380ba9aadb",
    "timestamp": "2025-10-14T01:01:50Z"
  },
  {
    "title": "New York Times, AP, Newsmax among news outlets who say they won't sign new Pentagon rules",
    "description": "The New York Times, The Associated Press and the conservative television network Newsmax are among five outlets on Monday who say they won't sign a new Defense Department document about its new press rules.",
    "link": "https://www.news4jax.com/business/2025/10/13/new-york-times-ap-newsmax-among-news-outlets-who-say-they-wont-sign-new-pentagon-rules/",
    "timestamp": "2025-10-14T01:00:38Z"
  },
  {
    "title": "Crypto Market Rebounds 5% as U.S.–China Trade Tensions Ease and $550B Flows Back In",
    "description": "Crypto snapped back on Monday as a diplomatic cool-down between Washington and Beijing helped erase part of Friday’s historic wipeout. Total crypto market cap jumped roughly 5%, with over $550 billion flowing back into digital assets after a panic sparked by …",
    "link": "https://bitcoinist.com/crypto-rebounds-5-as-u-s-china-trade-tensions-ease/",
    "timestamp": "2025-10-14T01:00:30Z"
  },
  {
    "title": "Trump Jr. Reminds Alyssa Farah Griffin She Promised to Wear MAGA Hat on ‘The View’ if Israeli Hostages Were Freed",
    "description": "The former White House staffer made the declaration during a December 2024 episode of ABC morning talk show\nThe post Trump Jr. Reminds Alyssa Farah Griffin She Promised to Wear MAGA Hat on ‘The View’ if Israeli Hostages Were Freed appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-jr-alyssa-farah-griffin-maga-hat-the-view-israeli-hostages/",
    "timestamp": "2025-10-14T00:57:32Z"
  },
  {
    "title": "France's embattled prime minister faces clutch day in parliament",
    "description": "France is in a deep political crisis that has spooked markets and raised concern about its minority government's ability to govern and ease the country's debt burden.",
    "link": "https://www.japantimes.co.jp/news/2025/10/14/world/politics/french-pm-parliament/",
    "timestamp": "2025-10-14T00:57:00Z"
  },
  {
    "title": "IMF chief Kristalina Georgieva dismisses impact of Trump trade war: ‘Trade is like water, you put in an obstacle, it goes around it’",
    "description": "The escalating trade clash between the U.S. and China has investors on edge, fearing it could mark the beginning of the end for global cooperation as we know it. On Friday, President Donald Trump called China’s new export controls “extraordinarily aggressive”…",
    "link": "https://biztoc.com/x/4135e8e1d2e62137",
    "timestamp": "2025-10-14T00:54:14Z"
  },
  {
    "title": "Trump to greet Argentina's Milei on Tuesday at 1 pm ET",
    "description": "United States President Donald Trump will welcome Argentine President Javier Milei at the White House on Tuesday for their scheduled meeting, according to Trump's official schedule.\nThe US presid...",
    "link": "https://biztoc.com/x/50e11edc98a60f37",
    "timestamp": "2025-10-14T00:54:03Z"
  },
  {
    "title": "After two years of dodging deals, Netanyahu allies claim he had a plan all along",
    "description": "Despite Netanyahu's initial resistance, the Trump administration's intervention appears to have forced both Israel and Hamas's hand. While not invited to the critical summit in Sharm el-Sheikh, Netanyahu claimed the deal as a victory, citing military and dipl…",
    "link": "https://www.haaretz.com/israel-news/2025-10-14/ty-article/.premium/after-two-years-of-dodging-deals-netanyahu-allies-claim-he-had-a-plan-all-along/00000199-dfea-d0f8-a7df-fffbc71e0000",
    "timestamp": "2025-10-14T00:52:09Z"
  },
  {
    "title": "Fake TV President Martin Sheen Gives Real President Donald Trump Advice on Being Real President: ‘Start Being Human’",
    "description": "Actor Martin Sheen, who liberals love for pretending to be a president in the early 2000s as President Jed Bartlett on the hit NBC series \"The West Wing,\" is deigning to give real-life President Donald Trump advice about how to comport himself in the White Ho…",
    "link": "https://www.breitbart.com/entertainment/2025/10/13/fake-tv-president-martin-sheen-gives-real-president-donald-trump-advice-on-being-real-president-start-being-human/",
    "timestamp": "2025-10-14T00:51:07Z"
  },
  {
    "title": "Asian stocks mixed as US-China trade optimism lifts sentiment",
    "description": "Japanese stocks are expected to decline as markets reopen, despite global equity gains fueled by renewed US-China trade optimism. This comes as the nation's ruling coalition collapses, creating political uncertainty. Meanwhile, US markets saw a strong rebound…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-as-us-china-trade-optimism-lifts-sentiment/articleshow/124540791.cms",
    "timestamp": "2025-10-14T00:50:36Z"
  },
  {
    "title": "'Dishonor will remain': Ex-Trump official warns GOP will rue not reining in his abuses",
    "description": "Former Trump administration official Sarah Matthews had a harsh message on Monday's edition of MSNBC's \"The Weeknight\" for lawmakers allowing presidential abuses of power to happen: History isn't going to be kind.This came as the panel discussed the upcoming …",
    "link": "https://www.rawstory.com/sarah-matthews-2674181021/",
    "timestamp": "2025-10-14T00:49:17Z"
  },
  {
    "title": "Hamas carries out wave of Gaza killings, citing crime and security concerns",
    "description": "U.S. President Donald Trump, speaking on his way to the Middle East, suggested Hamas had been given a temporary green light to police Gaza.",
    "link": "https://www.japantimes.co.jp/news/2025/10/14/world/hamas-gaza-killings-security/",
    "timestamp": "2025-10-14T00:43:00Z"
  },
  {
    "title": "“When Trump Won the Presidency, They Stopped Spitting on Me” – Former Hostage Tells How Hamas was Scared of Trump (Video)",
    "description": "Hamas barbarians abducted Omer Shem Tov from the Nova music festival on October 7, 2023.\nThe post “When Trump Won the Presidency, They Stopped Spitting on Me” – Former Hostage Tells How Hamas was Scared of Trump (Video) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/when-trump-won-presidency-they-stopped-spitting-me/",
    "timestamp": "2025-10-14T00:40:50Z"
  },
  {
    "title": "‘You Are The Biggest Nothing in the World’: Martin Sheen Tears Into Trump at Live MSNBC Event",
    "description": "Hollywood star Martin Sheen tore into President Donald Trump during a live MSNBC event on Monday, calling the president \"the biggest nothing in the world.\"\nThe post ‘You Are The Biggest Nothing in the World’: Martin Sheen Tears Into Trump at Live MSNBC Event …",
    "link": "https://www.mediaite.com/media/tv/you-are-the-biggest-nothing-in-the-world-martin-sheen-tears-into-trump-at-live-msnbc-event/",
    "timestamp": "2025-10-14T00:38:40Z"
  }
]