[
  {
    "title": "Bitcoin On The Brink As Crypto Braces For Fed Price Bombshell",
    "description": "Traders are braced for the latest U.S. inflation data that could unleash enthusiasm for risk assets if price pressures are seen to be easing...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/12/bitcoin-on-the-brink-as-crypto-braces-for-fed-price-bombshell/",
    "timestamp": "2025-08-12T11:30:08Z"
  },
  {
    "title": "Trump's big bill is powering his mass deportations. Congress is starting to ask questions",
    "description": "Included in the Republican Party's big bill of tax breaks and spending cuts is funding to power Trump's deportation agenda. Polling shows Americans' views on the issue are shifting.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_abf4692e-4650-59b9-97d2-6fcf5d9257b7.html",
    "timestamp": "2025-08-12T11:30:00Z"
  },
  {
    "title": "Trump's big bill is powering his mass deportations. Congress is starting to ask questions",
    "description": "Included in the Republican Party's big bill of tax breaks and spending cuts is funding to power Trump's deportation agenda. Polling shows Americans' views on the issue are shifting.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_e05fe400-54f8-58e6-bfcb-d05be6deb4ba.html",
    "timestamp": "2025-08-12T11:30:00Z"
  },
  {
    "title": "‘A Guy Who Never Dies’",
    "description": "On July 26 Donald Trump played a round of golf at his own Turnberry course in Scotland. Over footage of the event from Sky News, we hear a reporter shouting, “Mr. Trump, can you escape the Jeffrey Epstein crisis?” At that point in the clip, the volume surges …",
    "link": "http://www.nybooks.com/online/2025/08/12/a-guy-who-never-dies/",
    "timestamp": "2025-08-12T11:30:00Z"
  },
  {
    "title": "Teachers Have Become AI Super-Users",
    "description": "The chatbot takeover of education is just getting started.",
    "link": "https://www.theatlantic.com/technology/archive/2025/08/ai-takeover-education-chatgpt/683840/",
    "timestamp": "2025-08-12T11:30:00Z"
  },
  {
    "title": "China Escalates Canada Trade Spat With More Canola Levies",
    "description": "China will implement more levies on Canadian rapeseed after an anti-dumping probe, escalating a trade spat that’s disrupted crop flows.",
    "link": "https://financialpost.com/pmn/business-pmn/china-escalates-canada-trade-spat-with-more-canola-levies",
    "timestamp": "2025-08-12T11:29:53Z"
  },
  {
    "title": "Trump Seizes Control of DC Police, Activates National Guard",
    "description": "Hundreds of National Guard troops are expected to begin deployment on the streets of Washington, D.C., on orders from President Donald Trump. The rollout is part of the president’s unprecedented push to combat crime but with DC statistics showing violent crim…",
    "link": "https://www.today.com/video/trump-seizes-control-of-dc-police-activates-national-guard-244768325551",
    "timestamp": "2025-08-12T11:29:44Z"
  },
  {
    "title": "Trump says Intel CEO has an 'amazing story' days after calling for his resignation",
    "description": "Less than a week after President Donald Trump called for the resignation of Intel’s CEO, shares of the chipmaker are rising after Trump said he had a “very interesting” meeting with Lip-Bu Tan",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-intel-ceo-amazing-story-days-after-calling-124569631",
    "timestamp": "2025-08-12T11:26:32Z"
  },
  {
    "title": "NFL’s first trans cheerleader Justine Lindsay returning next season",
    "description": "Trans NFL cheerleader Justine Lindsay will be returning next season.  Lindsay made history in June 2022 when she by became the NFL’s first out trans cheerleader, after joining the Carolina Panthers. And, according to reports, she will be back on the touchline…",
    "link": "https://www.thepinknews.com/2025/08/12/nfls-first-trans-cheerleader-justine-lindsay-returning-next-season/",
    "timestamp": "2025-08-12T11:25:07Z"
  },
  {
    "title": "Shoplifters with $100k Mercedes Steal Thousands in Clothes (13 minute video)",
    "description": "Shoplifters with $100k Mercedes Steal Thousands in Clothes Body Cam Watch 869K subscribers 3.4M views 6 months ago On March 23, 2024 in Florida, officers responded to a shoplifting call from Carter's after the suspects had fled the store. The caller stated th…",
    "link": "https://freerepublic.com/focus/f-chat/4334111/posts",
    "timestamp": "2025-08-12T11:22:45Z"
  },
  {
    "title": "Diddy to Reportedly Publicly Support Trump if Pardoned",
    "description": "Mark Geragos, a celebrity attorney who is the father of one of the attorneys who represented Sean “Diddy” Combs during his sex trafficking and racketeering trial, says that he believes Diddy would throw his support behind Donald Trump if he received a preside…",
    "link": "https://mediatakeout.com/diddy-to-reportedly-publicly-support-trump-if-pardoned/",
    "timestamp": "2025-08-12T11:17:19Z"
  },
  {
    "title": "Joe Scarborough Chides Dem ‘Friends’ for Publicly Fuming About Trump DC Takeover While Quietly Demanding Crime Crackdown",
    "description": "Scarborough called out Democrat “friends” who privately shared their belief that “Washington should have gotten involved years ago” to fix D.C. crime “mess.\"\nThe post Joe Scarborough Chides Dem ‘Friends’ for Publicly Fuming About Trump DC Takeover While Quiet…",
    "link": "https://www.mediaite.com/media/tv/joe-scarborough-chides-dem-friends-for-publicly-fuming-about-trump-dc-takeover-while-quietly-demanding-crime-crackdown/",
    "timestamp": "2025-08-12T11:17:00Z"
  },
  {
    "title": "Trump's D.C. takeover met with confusion and 2 dead in steel factory explosion: Morning Rundown",
    "description": "Donald Trump said National Guard troops will be deployed to Washington, D.C., and Pam Bondi will \"take command\" of local police.",
    "link": "https://www.nbcnews.com/news/us-news/trump-dc-takeover-steel-factory-explosion-morning-rundown-rcna224470",
    "timestamp": "2025-08-12T11:16:15Z"
  },
  {
    "title": "Ex-NBA star Sebastian Telfair pleads for Trump pardon before reporting to jail",
    "description": "Former NBA star Sebastian Telfair pleaded for a pardon from President Donald Trump as he's set to enter prison for violating the terms of his sentence in a healthcare fraud scandal.",
    "link": "https://www.foxnews.com/sports/ex-nba-star-sebastian-telfair-pleads-trump-pardon-before-reporting-jail",
    "timestamp": "2025-08-12T11:16:10Z"
  },
  {
    "title": "When will voters blame Trump for this economy?",
    "description": "Donald Trump's economic policies face scrutiny as Americans grapple with financial challenges. Polls reveal concerns about inflation and the impact of Trump's economic agenda. Blue-collar voters express worries over tariffs. Republicans risk political setback…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/when-will-voters-blame-trump-for-this-economy/articleshow/123256631.cms",
    "timestamp": "2025-08-12T11:16:02Z"
  },
  {
    "title": "Donald Trump Dials Down Trade Tension With China",
    "description": "",
    "link": "https://biztoc.com/x/a0780f5306d5e9e9",
    "timestamp": "2025-08-12T11:15:48Z"
  },
  {
    "title": "Iraq begins power restoration after outage",
    "description": "The disruption came as Baghdad experienced extreme temperatures reaching 47 degrees Celsius.",
    "link": "https://www.power-technology.com/news/iraq-power-restoration-after-outage/",
    "timestamp": "2025-08-12T11:15:12Z"
  },
  {
    "title": "Klas: Justice Department’s demands for your data are a suspicious fishing expedition",
    "description": "With his approval rating sinking lower and lower, and facing the prospect of losing control of the House to Democrats, President Donald Trump is engaged in an unprecedented attempt to manipulate the midterm elections.\nNot only has he demanded that Texas redra…",
    "link": "https://biztoc.com/x/2f4c4bdb90666474",
    "timestamp": "2025-08-12T11:15:07Z"
  },
  {
    "title": "Nobody knows what Trump is talking about anymore and no one seems to care [Obvious]",
    "description": "Nobody knows what Trump is talking about anymore and no one seems to care",
    "link": "https://www.fark.com/comments/13774198/Nobody-knows-what-Trump-is-talking-about-anymore-no-one-seems-to-care",
    "timestamp": "2025-08-12T11:15:00Z"
  },
  {
    "title": "Trump's Gross Gold White House Makeover Is Likely Illegal",
    "description": "President Donald Trump's rush to build a hideously ostentatious ballroom at the White House could run afoul of federal law, as he has yet to seek approval for the project that he claims will begin next month, The Washington Post reported.\nFederal law requires…",
    "link": "https://crooksandliars.com/2025/08/trumps-gross-gold-white-house-makeover",
    "timestamp": "2025-08-12T11:14:07Z"
  },
  {
    "title": "Roger Stone Whines About Having To Sell Guitar After Arrest",
    "description": "Roger Stone, a longtime adviser to Donald Trump, revealed that he had to sell many of his belongings, including an electric guitar, after a 2018 arrest in connection with former special counsel Robert Mueller's probe into Russian election interference.\n\n\nWhil…",
    "link": "https://crooksandliars.com/2025/08/bible-roger-stone-whines-about-having-sell",
    "timestamp": "2025-08-12T11:12:28Z"
  },
  {
    "title": "Jimmy Kimmel says second Trump term is ‘so much worse’ as he reveals he has Italian citizenship",
    "description": "The talk show host has been a longtime critic of the president",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/trump-jimmy-kimmel-italian-citizenship-b2806083.html",
    "timestamp": "2025-08-12T11:08:42Z"
  },
  {
    "title": "Putin wants a photo op with Trump and a sanctions delay, says EU foreign policy chief",
    "description": "Russian President Vladimir Putin is not actually interested in negotiating when he meets his U.S. counterpart Donald Trump to discuss the war in Ukraine, European Union foreign policy chief Kaja Kallas told CNBC on Tuesday.\nEuropean officials and Ukrainian Pr…",
    "link": "https://biztoc.com/x/45c061cede789121",
    "timestamp": "2025-08-12T11:04:04Z"
  },
  {
    "title": "Nova Scotia Bans Hiking and Other Forest Activities Due to Fire Risks",
    "description": "Meanwhile, the constitutionality of potential Alberta separation referendum question is set to be evaluated by a judge.\nThe post Nova Scotia Bans Hiking and Other Forest Activities Due to Fire Risks first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/nova-scotia-bans-hiking-and-other-forest-activities-due-to-fire-risks/",
    "timestamp": "2025-08-12T11:00:16Z"
  },
  {
    "title": "Black fatherlessness is turning DC into a war zone",
    "description": "Liberal policies and absent fathers fuel crime and violence in D.C. A cultural change is needed alongside Trump's law enforcement approach.",
    "link": "https://www.foxnews.com/opinion/black-fatherlessness-turning-dc-war-zone",
    "timestamp": "2025-08-12T11:00:09Z"
  },
  {
    "title": "will.i.am calls out ICE raids on new single ‘East L.A.’",
    "description": "'I love Mexicanas from the border.'\nThe post will.i.am calls out ICE raids on new single ‘East L.A.’ appeared first on HipHopDX.",
    "link": "http://hiphopdx.com/news/will-i-am-calls-out-ice-raids-on-new-single-east-l-a/",
    "timestamp": "2025-08-12T11:00:07Z"
  },
  {
    "title": "Trump Is Right That D.C. Has a Serious Crime Problem",
    "description": "But he has the wrong answer for how to fix it.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/dc-crime-statistics-trump-police-takeover/683838/",
    "timestamp": "2025-08-12T11:00:00Z"
  },
  {
    "title": "Survey found 47% of Republicans would still vote for Trump even if implicated in Epstein's crimes",
    "description": "A July 2025 survey found that 47% of Republican voters said they'd still support U.S. President Donald Trump even if he were officially implicated in the late Jeffrey Epstein's sex crimes.",
    "link": "https://www.snopes.com//fact-check/republican-voters-trump-epstein/",
    "timestamp": "2025-08-12T11:00:00Z"
  },
  {
    "title": "Putin wants a photo op with Trump and a sanctions delay, says EU foreign policy chief",
    "description": "Russian President Vladimir Putin and his U.S. counterpart Donald Trump are set to meet this week to discuss the war in Ukraine.",
    "link": "https://www.cnbc.com/2025/08/12/putin-wants-a-photo-op-with-trump-says-eu-foreign-policy-chief.html",
    "timestamp": "2025-08-12T10:59:07Z"
  },
  {
    "title": "Banking heavyweights pull markets down ahead of inflation data",
    "description": "The Sensex fell 368.49 points (0.46%) to 80,235.59 after an 833-point swing, while the Nifty 50 dropped 97.65 points (0.40%) to 24,487.40, slipping below the 24,500 mark.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/banking-heavyweights-pull-markets-down-ahead-of-inflation-data/article69923834.ece",
    "timestamp": "2025-08-12T10:55:34Z"
  },
  {
    "title": "Russian forces make sudden thrust in eastern Ukraine ahead of Putin-Trump summit later this week",
    "description": "Russian forces have made a sudden thrust into eastern Ukraine near the mining town of Dobropillia in a move that may be designed to increase the pressure on Ukraine to cede land as the US and Russian presidents prepare to meet.",
    "link": "https://www.independent.ie/world-news/russian-forces-make-sudden-thrust-in-eastern-ukraine-ahead-of-putin-trump-summit-later-this-week/a1935776150.html",
    "timestamp": "2025-08-12T10:55:26Z"
  },
  {
    "title": "MAGA states face devastation as GOP pushes through sneak Obamacare assault: report",
    "description": "Donald Trump and congressional Republicans have found a sneaky new way to gut Obamacare without the messy optics of an outright repeal—and experts say it could be even more damaging than their failed 2017 effort.Unlike the dramatic showdown that saw John McCa…",
    "link": "https://www.rawstory.com/obamacare-maga/",
    "timestamp": "2025-08-12T10:55:04Z"
  },
  {
    "title": "Playbook: Dems' D.C. dilemma (Politico)",
    "description": "Politico:\nPlaybook: Dems' D.C. dilemma  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  On today's Playbook Podcast, Adam Wren and Dasha Burns talk about President Donald Trump sending the National Guard to patrol the streets of D.C., the messag…",
    "link": "https://www.memeorandum.com/250812/p11",
    "timestamp": "2025-08-12T10:55:00Z"
  },
  {
    "title": "Inside Trump's decision to deploy the National Guard in D.C. (Washington Post)",
    "description": "Washington Post:\nInside Trump's decision to deploy the National Guard in D.C.  —  President Donald Trump long had a playbook for such a move and a week ago had new motivation after a former aide was injured in an attempted carjacking  —  Just now  —  Even bef…",
    "link": "https://www.memeorandum.com/250812/p10",
    "timestamp": "2025-08-12T10:55:00Z"
  },
  {
    "title": "Donald Trump nominates E.J. Antoni as Bureau of Labor Statistics chief",
    "description": "The announcement comes one day before the BLS is scheduled to release the latest inflation data for July.",
    "link": "https://www.wmur.com/article/trump-conservative-economist-to-head-agency-that-compiles-jobs-inflation-data/65663123",
    "timestamp": "2025-08-12T10:54:13Z"
  },
  {
    "title": "China Reacts to Trump, Putin Meeting Without Ukraine, EU",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nChina said it hopes all those with a stake in the Russia-Ukraine war would play a role in the peace negotiations, as U.S. President Donald Trump prepares for a summit with Russian President Vladimir Putin in A…",
    "link": "https://biztoc.com/x/450cf57f18ed071e",
    "timestamp": "2025-08-12T10:53:35Z"
  },
  {
    "title": "Fact checking Trump's Washington DC crime claim - BBC",
    "description": "Fact checking Trump's Washington DC crime claimBBC Trump declared federal control of DC police and is deploying the National Guard. Here’s how he is able to do itCNN For Trump, Cities Like Washington Are Real Estate in Need of Fixing UpThe New York Times Top …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178652698",
    "timestamp": "2025-08-12T10:53:21Z"
  },
  {
    "title": "Trump promised payback for Letitia James. He seems to have kept his word",
    "description": "Subpoenas sent to New York Attorney General Letitia James suggest Donald Trump is making good on his threats against people he says have wronged him.",
    "link": "https://biztoc.com/x/eb266d4c47c630c1",
    "timestamp": "2025-08-12T10:53:12Z"
  },
  {
    "title": "China tariffs delayed again, hours before sharp increase was to take hold - The Washington Post",
    "description": "China tariffs delayed again, hours before sharp increase was to take holdThe Washington Post Trump Extends China Tariff Truce by Three MonthsThe New York Times Fact Sheet: President Donald J. Trump Continues the Suspension of the Heightened Tariffs on ChinaTh…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178652694",
    "timestamp": "2025-08-12T10:53:11Z"
  },
  {
    "title": "Trump To Judge Putin 'In The First Two Minutes' — Will Walk Out If No Fair Deal: 'That'll Be The End'",
    "description": "President Donald Trump signaled his expectations for his summit with Russian President Vladimir Putin, stating he was prepared to walk away if a deal could not be reached.\nTrump: Deal or Walk in ‘First Two Minutes’\nTrump has indicated that he will know within…",
    "link": "https://biztoc.com/x/bddd1139dea9cbd9",
    "timestamp": "2025-08-12T10:53:03Z"
  },
  {
    "title": "Russia to test revolutionary Burevestnik nuclear cruise missile with unlimited range as Putin gets ready to meet Trump over Ukraine war",
    "description": "Russia is preparing to test its 9M730 Burevestnik nuclear-powered cruise missile in the Novaya Zemlya archipelago, prompting airspace closures and deployment of Rosatom vessels. This development occurs ahead of a crucial meeting between Putin and Trump to dis…",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-to-test-revolutionary-burevestnik-nuclear-cruise-missile-with-unlimited-range-as-putin-gets-ready-to-meet-trump-over-ukraine-war/articleshow/123257045.cms",
    "timestamp": "2025-08-12T10:52:44Z"
  },
  {
    "title": "It's been 10 years since Putin went to the US - here's what happened last time and what to expect on Friday",
    "description": "Vladimir Putin is set to travel to the US for the first time since 2015, as he meets Donald Trump for a bilateral summit. Here, we look at what happened during that trip and what can be expected on Friday.",
    "link": "https://news.sky.com/story/its-been-10-years-since-putin-went-to-the-us-heres-what-happened-last-time-and-what-to-expect-on-friday-13410525",
    "timestamp": "2025-08-12T10:51:00Z"
  },
  {
    "title": "Sanctions Choke Crude Shipments to Indian Refiner Nayara",
    "description": "Indian refiner Nayara Energy is set to receive the lowest-ever amount of crude this month, as oil imports and product exports buckle under the weight of EU sanctions.",
    "link": "https://financialpost.com/pmn/business-pmn/sanctions-choke-crude-shipments-to-indian-refiner-nayara",
    "timestamp": "2025-08-12T10:49:12Z"
  },
  {
    "title": "China Reacts to Trump, Putin Meeting Without Ukraine, EU",
    "description": "Presidents Donald Trump and Vladimir Putin will meet to discuss ending Russia's invasion of Ukraine.",
    "link": "https://www.newsweek.com/china-trump-putin-russia-ukraine-war-2112170",
    "timestamp": "2025-08-12T10:48:24Z"
  },
  {
    "title": "On the United States’ “Imminent” Military Intervention Against Mexico",
    "description": "The Trump administration's latest escalatory threat comes just days after Rolling Stone reported on a secret drug trafficking cartel operating out of Fort Bragg.",
    "link": "https://www.nakedcapitalism.com/2025/08/the-united-states-imminent-military-intervention-against-mexico.html",
    "timestamp": "2025-08-12T10:45:41Z"
  },
  {
    "title": "Left-Wing Australian PM Scolds Netanyahu -- 'In Denial' over Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu is \"in denial\" over the on-the-ground consequences of the violence roiling Gaza and should correct his thinking. So said his left-wing Australian counterpart Anthony Albanese knowingly on Tuesday from some 7,589 miles…",
    "link": "https://www.breitbart.com/europe/2025/08/12/left-wing-australian-pm-scolds-netanyahu-in-denial-over-gaza/",
    "timestamp": "2025-08-12T10:44:44Z"
  },
  {
    "title": "Whistleblower says who was behind classified leaks to target Trump and more top headlines",
    "description": "Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.",
    "link": "https://www.foxnews.com/us/whistleblower-says-who-behind-classified-leaks-target-trump-more-top-headlines",
    "timestamp": "2025-08-12T10:44:13Z"
  },
  {
    "title": "Emerging Market Stocks Trade Steady Before US Inflation Data",
    "description": "Emerging-market stocks and currencies were steady as traders awaited US inflation data for clues on the path for Federal Reserve interest-rate cuts.",
    "link": "https://financialpost.com/pmn/business-pmn/emerging-market-stocks-trade-steady-before-us-inflation-data",
    "timestamp": "2025-08-12T10:44:07Z"
  },
  {
    "title": "Morning Bid: CPI on radar after US-China rollover",
    "description": "World markets got a minor fillip from the expected 90-day rollover of the U.S.-China trade tariff truce, clearing one of Tuesday's two big hurdles.  Much...",
    "link": "https://finance.yahoo.com/news/morning-bid-cpi-radar-us-104232145.html",
    "timestamp": "2025-08-12T10:42:32Z"
  },
  {
    "title": "China 'glad to see' Russia, US improve relations",
    "description": "Chinese Foreign Ministry spokesperson Lin Jian commented on Tuesday on the upcoming meeting between United States President Donald Trump and Russian President Vladimir Putin, stating that China is \"gl...",
    "link": "https://biztoc.com/x/0864a18b606c0b9d",
    "timestamp": "2025-08-12T10:42:12Z"
  },
  {
    "title": "Brian Cox says Donald Trump is a ‘very good example of a villain’: ‘No empathy whatsoever’",
    "description": "‘Succession’ star argued that the US president is moving the country towards an ‘oligarchy’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-brian-cox-succession-hbo-b2806058.html",
    "timestamp": "2025-08-12T10:40:44Z"
  },
  {
    "title": "Russia reveals expectations for Putin-Trump summit",
    "description": "The Alaska meeting could boost efforts to restore ties with the US, Deputy Foreign Minister Sergey Ryabkov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622794-russia-expectations-putin-trump-summit/",
    "timestamp": "2025-08-12T10:36:47Z"
  },
  {
    "title": "Retail inflation eases to over 8-year low of 1.55% in July aided by cooling food prices",
    "description": "India’s retail inflation fell to 1.55% in July, the lowest since June 2017 and below the Reserve Bank of India’s 2%–6% tolerance band for the first time in over six years, government data showed. The reading was down from 3.16% in April and 3.54% in July 2024…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/retail-inflation-eases-to-over-8-year-low-at-1-55-in-july-aided-by-cooling-food-prices/articleshow/123256183.cms",
    "timestamp": "2025-08-12T10:35:03Z"
  },
  {
    "title": "JD Vance says Elon Musk should return to White House — but calls fight with Trump a ‘mistake’",
    "description": "The vice president shared his hopes of having the tech tycoon back at 1600 Pennsylvania Ave. by the 2026 midterm elections.",
    "link": "https://nypost.com/2025/08/12/us-news/jd-vance-says-elon-musk-should-return-to-white-house-but-calls-fight-with-trump-a-mistake/",
    "timestamp": "2025-08-12T10:35:02Z"
  },
  {
    "title": "Trump to deploy National Guard to D.C. and federalize city police - Axios",
    "description": "Trump to deploy National Guard to D.C. and federalize city policeAxios Trump declared federal control of DC police and is deploying the National Guard. Here’s how he is able to do itCNN Donald Trump’s Washington DC intervention labelled as ‘unsettling and unp…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178652570",
    "timestamp": "2025-08-12T10:34:52Z"
  },
  {
    "title": "USA-China Tariff Truce Extension Helps Oil",
    "description": "Pressure on crude oil futures decreased and prices rebounded slightly, said Maria Agustina Patti, Financial Markets Strategist Consultant to Exness.",
    "link": "https://www.rigzone.com/news/usachina_tariff_truce_extension_helps_oil-12-aug-2025-181441-article/",
    "timestamp": "2025-08-12T10:34:42Z"
  },
  {
    "title": "Oaktree to Take Over Wind Blade Maker TPI After Bankruptcy",
    "description": "Oaktree Capital Management is set to take over wind turbine blade manufacturer TPI Composites Inc. as part of its debt restructuring in Chapter 11 bankruptcy.",
    "link": "https://financialpost.com/pmn/business-pmn/oaktree-to-take-over-wind-blade-maker-tpi-after-bankruptcy",
    "timestamp": "2025-08-12T10:33:56Z"
  },
  {
    "title": "Inflation likely moved higher last month as tariffs bite, putting the Fed in bind",
    "description": "Inflation likely moved higher last month as tariffs bite, putting the Fed in bindlocal10.com",
    "link": "https://www.local10.com//business/2025/08/12/inflation-likely-moved-higher-last-month-as-tariffs-bite-putting-the-fed-in-bind/",
    "timestamp": "2025-08-12T10:32:28Z"
  },
  {
    "title": "Trump’s Giddy Intimidation of Washington, D.C.",
    "description": "Big-city liberalism has become a very effective GOP bogeyman in recent years, writes columnist Ross Barkan.",
    "link": "http://nymag.com/intelligencer/article/the-dark-reality-of-trumps-d-c-takeover.html",
    "timestamp": "2025-08-12T10:30:36Z"
  },
  {
    "title": "Trump’s ‘dictator-like’ D.C. takeover is an assault on democracy, critics warn",
    "description": "President Donald Trump’s decision to seize control of Washington, D.C.’s police force and flood the city’s streets with National Guard troops has drawn urgent warnings from lawmakers, human rights advocates, and civil rights groups who say the move represents…",
    "link": "https://www.advocate.com/news/trump-dc-dictatorship-underway",
    "timestamp": "2025-08-12T10:30:03Z"
  },
  {
    "title": "Stock Market Today: Investors await July's heavily-watched inflation print",
    "description": "Plus: Fed officials Barkin and Schmid are expected to add their two cents",
    "link": "https://www.thestreet.com/investing/stock-market-today-august-12-2025",
    "timestamp": "2025-08-12T10:29:23Z"
  },
  {
    "title": "Car shipper says US tariff haze still affecting auto trade flows",
    "description": "STOCKHOLM (Reuters) -Europe's car exporters are still struggling with uncertainty over U.S. tariffs despite last month's trade deal, Wallenius Wilhelmsen...",
    "link": "https://finance.yahoo.com/news/car-shipper-says-us-tariff-102850716.html",
    "timestamp": "2025-08-12T10:28:50Z"
  },
  {
    "title": "South Park’s unhinged secret season 27 episode 2 post-credits scene is only available to stream on Paramount+, and there’s a good reason why",
    "description": "If you thought watching South Park season 27 episode 2 was a wild ride, just wait until you stream the secret post-credits scene exclusively on Paramount+.",
    "link": "https://www.techradar.com/streaming/paramount-plus/south-parks-unhinged-secret-season-27-episode-2-post-credits-scene-is-only-available-to-stream-on-paramount-and-theres-a-good-reason-why",
    "timestamp": "2025-08-12T10:27:20Z"
  },
  {
    "title": "Trump Media’s Truth Social BTC ETF Backed by Crypto.com to Uplift the Best Altcoins",
    "description": "Trump Media (parent company of Truth Social) has updated its Securities and Exchange Commission (SEC) filing for the Truth Social Bitcoin ETF. The fund’s latest plan is to hold $BTC directly, with Crypto.com acting as the custodian, execution agent, and liqui…",
    "link": "https://bitcoinist.com/best-altcoins-to-buy-alongside-truth-social-btc-etf/",
    "timestamp": "2025-08-12T10:26:36Z"
  },
  {
    "title": "Donald Trump commits huge double slip up as he tells reporters 'he's going to Russia' on Friday",
    "description": "People have been left confused online after US President Donald Trump said he was 'going to Russia' this week.",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-visiting-russia-alaska-mistake-vladimir-putin-693991-20250812",
    "timestamp": "2025-08-12T10:25:31Z"
  },
  {
    "title": "US stock futures mixed as investors await key inflation report",
    "description": "July's consumer price index is expected to rise an annual 2.8% from June's 2.7%, according to a Reuters poll of economists.",
    "link": "https://www.usatoday.com/story/money/markets/2025/08/12/us-stocks-tuesday-inflation-consumers/85620080007/",
    "timestamp": "2025-08-12T10:24:30Z"
  },
  {
    "title": "Gold Holds Loss As Traders Seek Clarity On Trump's No-Tariff Vow",
    "description": "Gold held a loss after President Donald Trump said imports of bullion won’t be subject to US tariffs, although traders were still waiting for formal clarification over the policy following a federal ruling last week that sowed chaos and confusion across the m…",
    "link": "https://www.ndtvprofit.com/markets/gold-holds-loss-as-traders-seek-clarity-on-trump-no-tariff-vow-august-12-2025",
    "timestamp": "2025-08-12T10:22:10Z"
  },
  {
    "title": "SiriusXM Execs Need To Go Out Of Their Way To Keep Howard Stern ‘Away’ From Alex Cooper When She’s In The NYC Offices: Report",
    "description": "SiriusXM execs reportedly have to spend their time keeping Howard Stern “away” from Alex Cooper when she’s in the New York City offices. Cooper and her massive $125 million contract reportedly “bug” Stern. Earlier this month, it was reported that SirisXM is g…",
    "link": "https://brobible.com/culture/article/howard-stern-alex-cooper-siriusxm/",
    "timestamp": "2025-08-12T10:20:00Z"
  },
  {
    "title": "Is David Bailey About To Spend A Jaw-Dropping $1 Billion On Bitcoin? Here's What We Know",
    "description": "David Bailey, the CEO of Bitcoin (CRYPTO: BTC) treasury company Nakamoto Holdings Inc., created a buzz on Monday by announcing a $1 billion BTC purchase.\nWhat's The Truth Behind?\nBailey, known for his role as CEO of Bitcoin Magazine and as a Bitcoin advisor t…",
    "link": "https://biztoc.com/x/9e7fcfb4860d97e4",
    "timestamp": "2025-08-12T10:19:50Z"
  },
  {
    "title": "World Liberty Financial token valued at $0.20 in Trump crypto project’s ALT5 treasury deal",
    "description": "World Liberty Financial treasury company ALT5 values WLFI tokens at $0.20 apiece in share acquisition deal. It's the first time the token has received a...",
    "link": "https://www.dlnews.com/articles/deals/world-liberty-financial-alt5-treasury-firm-deal-puts-price-on-wlfi-token/",
    "timestamp": "2025-08-12T10:19:50Z"
  },
  {
    "title": "Ex–Alaska Lt. Governor Says Wants Dialogue, Friendship Between US, Russia",
    "description": "ANCHORAGE (Sputnik) – The United States and Russia should maintain dialogue and friendship, Alaska’s former Lieutenant Governor Loren Leman told RIA Novosti, commenting on the upcoming summit between US President Donald Trump and Russian President Vladimir Pu…",
    "link": "https://sputnikglobe.com/20250812/exalaska-lt-governor-says-wants-dialogue-friendship-between-us-russia-1122597804.html",
    "timestamp": "2025-08-12T10:16:03Z"
  },
  {
    "title": "Like Mike Johnson, Pete Hegseth is another Republican obsessed with gay sex",
    "description": "A couple of years ago, I wrote about Speaker Mike Johnson’s\r\n persistent fixation on gay sex\r\n. Sure, he loaths the LGBTQ+ community as a whole and abhors same-sex marriage, but the physical act itself really rubs Johnson the wrong way.",
    "link": "https://www.advocate.com/voices/opinion-hegseth-johnson-gay-men",
    "timestamp": "2025-08-12T10:15:03Z"
  },
  {
    "title": "Jobs data triggered Trump, but Fed officials saw it not as rigged, but as reason to cut",
    "description": "WASHINGTON (Reuters) -The very data that caused President Donald Trump to fire the head of the Bureau of Labor Statistics because he did not like the July...",
    "link": "https://finance.yahoo.com/news/jobs-data-triggered-trump-fed-101418737.html",
    "timestamp": "2025-08-12T10:14:18Z"
  },
  {
    "title": "Trump fires off full-throated endorsement well in advance of GOP primary in Georgia governor's race",
    "description": "President Donald Trump endorsed Georgia Lt. Gov. Burt Jones for governor well ahead of the GOP gubernatorial primary in the Peach State",
    "link": "https://www.foxnews.com/politics/trump-fires-off-full-throated-endorsement-well-advance-gop-primary-georgia-governors-race",
    "timestamp": "2025-08-12T10:13:36Z"
  },
  {
    "title": "Trump in the Falklands",
    "description": "Like British Prime Minister Margaret Thatcher in 1982, US President Donald Trump is betting that the surest way to win a war is to bring overwhelming force to bear. With one trade partner after another meekly accepting Trump's huge new tariffs, could he be ri…",
    "link": "https://www.project-syndicate.org/commentary/trump-tariffs-exploit-overwhelming-force-like-falklands-war-by-barry-eichengreen-2025-08",
    "timestamp": "2025-08-12T10:10:34Z"
  },
  {
    "title": "President Trump on Holds News Conference on Washington, DC Security (National Politics)",
    "description": "National Politics:\nPresident Trump on Holds News Conference on Washington, DC Security  —  President Donald Trump announced a federal takeover of Washington, DC's police department and that around 800 National Guard troops would be deployed in DC.  These acti…",
    "link": "https://www.memeorandum.com/250812/p7",
    "timestamp": "2025-08-12T10:10:01Z"
  },
  {
    "title": "Oil Steadies in Thin Summer Trading Ahead of Trump-Putin Meet",
    "description": "In This Article:\n(Bloomberg) -- Oil drifted in muted summer trading as investors weighed President Donald Trump’s deferral of lofty US tariffs on China against possible outcomes from his planned meeting with Russia’s Vladimir Putin.\nBrent was just shy of $67 …",
    "link": "https://biztoc.com/x/0378a8baa879c329",
    "timestamp": "2025-08-12T10:09:20Z"
  },
  {
    "title": "Explainer-Can Trump take control of Washington to fight the city's crime?",
    "description": "(Reuters) -U.S. President Donald Trump has repeatedly threatened to put Washington, D.C., under full federal control to reduce crime, even as city officials stressed crime is already falling. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/12/explainer-can-trump-take-control-of-washington-to-fight-the-city039s-crime",
    "timestamp": "2025-08-12T10:09:00Z"
  },
  {
    "title": "Trump hiked Canada's tariff rate to 35%, but just who’s paying it remains a mystery",
    "description": "When U.S. President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n published an open letter to Prime Minister \n \n \n \n \n \n \n \n \n \n Mark Carney\n \n \n \n \n \n \n \n \n \n in late July, declaring his intention to impose a \n \n \n \n \n \n \n \n \n \n 35 per cent tariff\n \n \n…",
    "link": "https://biztoc.com/x/729418188875c18d",
    "timestamp": "2025-08-12T10:08:58Z"
  },
  {
    "title": "Analysis-Companies plan stablecoins under new law, but experts say hurdles remain",
    "description": "(Reuters) -Financial companies from Bank of America to Fiserv are preparing to launch their own dollar-backed crypto tokens now that a new U.S. law has...",
    "link": "https://finance.yahoo.com/news/analysis-companies-plan-stablecoins-under-100640489.html",
    "timestamp": "2025-08-12T10:06:40Z"
  },
  {
    "title": "Intel to Collaborate with U.S. Government in Manufacturing Resurrection",
    "description": "Last time, we reported that U.S. President Donald Trump called for the resignation of Intel’s CEO, Lip-Bu Tan. However, tides are shifting at the White House as President Trump and Lip-Bu Tan meet to discuss the strategic importance of Intel for U.S. semicond…",
    "link": "https://www.madshrimps.be/news/intel-to-collaborate-with-u-s-government-in-manufacturing-resurrection/",
    "timestamp": "2025-08-12T10:05:58Z"
  },
  {
    "title": "Gold plunges ₹1,000 amid sell-off in global markets",
    "description": "Gold prices drop in Delhi due to global sell-off, Trump's tariff announcement; silver prices also decline, rupee strengthens.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/gold-plunges-1000-amid-sell-off-in-global-markets/article69923614.ece",
    "timestamp": "2025-08-12T10:05:56Z"
  },
  {
    "title": "US-China Tariff Truce; Fed Chair Search Expands | Horizons Middle East & Africa 8/12/2025",
    "description": "US President Donald Trump has signed an executive order extending the US tariff truce with China for 90 days. Also on the show: ...",
    "link": "https://biztoc.com/x/c1787fd850575c40",
    "timestamp": "2025-08-12T10:05:23Z"
  },
  {
    "title": "Over 100K Americans rush to join Trump's massive ICE hiring spree nationwide, DHS says",
    "description": "ICE has received over 100,000 job applications in roughly two weeks amid the Trump administration's push to hire 10,000 new immigration enforcement agents.",
    "link": "https://www.foxnews.com/politics/over-100k-americans-rush-join-trumps-massive-ice-hiring-spree-nationwide-dhs-says",
    "timestamp": "2025-08-12T10:04:06Z"
  },
  {
    "title": "How Pakistan's Asim Munir crafted his America trap",
    "description": "In a surprising turn, the US seems to be warming up to Pakistan, designating Baloch insurgents as terrorists amid potential mineral deals. Pakistan's army chief, Asim Munir, is credited with this shift, seemingly charming President Trump with flattery and pro…",
    "link": "https://economictimes.indiatimes.com/news/defence/how-pakistans-asim-munir-crafted-his-america-trap/articleshow/123256170.cms",
    "timestamp": "2025-08-12T10:02:16Z"
  },
  {
    "title": "How Pakistan's Asim Munir crafted his America trap",
    "description": "In a surprising turn, the US seems to be warming up to Pakistan, designating Baloch insurgents as terrorists amid potential mineral deals. Pakistan's army chief, Asim Munir, is credited with this shift, seemingly charming President Trump with flattery and pro…",
    "link": "https://economictimes.indiatimes.com/news/defence/how-pakistans-asim-munir-crafted-his-america-trap/articleshow/123256229.cms",
    "timestamp": "2025-08-12T10:02:16Z"
  },
  {
    "title": "Chris Christie praises Trump's 'long overdue' DC crime crackdown",
    "description": "Chris Christie praises Trump's decision to activate National Guard and federalize D.C. police under Pam Bondi to restore law and order in Washington.",
    "link": "https://www.foxnews.com/media/chris-christie-praises-trumps-long-overdue-dc-crime-crackdown",
    "timestamp": "2025-08-12T10:00:58Z"
  },
  {
    "title": "The Trump-Putin summit is amateurish and politically driven",
    "description": "A veteran diplomat explains the problems with Trump's upcoming meeting with Putin.",
    "link": "https://www.salon.com/2025/08/12/the-trump-putin-summit-is-amateurish-and-politically-driven_partner/",
    "timestamp": "2025-08-12T10:00:32Z"
  },
  {
    "title": "Democrats Are Pouring Into This Red-State Senate Race",
    "description": "State Rep. Josh Turek, a former Paralympian, is the fifth major Democratic candidate to challenge Republican Sen. Joni Ernst in Iowa.",
    "link": "https://www.huffpost.com/entry/the-democratic-senate-field-in-this-red-state-is-getting-awfully-crowded_n_689aa74be4b0be3f5edc9b82",
    "timestamp": "2025-08-12T10:00:17Z"
  },
  {
    "title": "William Watson: Economic forecasters, beware Donald Trump’s personality penalty",
    "description": "A new study finds one-person autocracies underperform economically. The reasons why may also apply to democracies, including the US. Read on",
    "link": "https://financialpost.com/opinion/economic-forecasters-beware-donald-trump-personality-penalty",
    "timestamp": "2025-08-12T10:00:15Z"
  },
  {
    "title": "Trump hiked Canada’s tariff rate to 35%, but just who’s paying it remains a mystery",
    "description": "Donald Trump hiked Canada's tariff rate to 35%, but just who’s paying it remains a mystery as most exports are shielded by CUSMA. Read more.",
    "link": "https://financialpost.com/news/economy/trump-hiked-canada-tariff-rate-35-whos-paying-mystery",
    "timestamp": "2025-08-12T10:00:15Z"
  },
  {
    "title": "Trump’s AI Action Plan Is at War With Itself",
    "description": "A self-contradictory mix of U.S. policies may already be stimulating Chinese AI.",
    "link": "http://foreignpolicy.com/2025/08/12/trump-ai-action-plan-american-stack-contradictions/",
    "timestamp": "2025-08-12T10:00:11Z"
  },
  {
    "title": "Ghislaine Maxwell Was More Powerful Than Anyone Knew",
    "description": "A new biography of Prince Andrew reveals how Ghislaine Maxwell used the royal as bait to pull famous men into Jeffrey Epstein’s orbit. She was no mere accomplice — she was at least his co-equal.",
    "link": "http://nymag.com/intelligencer/article/entitled-prince-andrew-andrew-lownie-ghislaine-maxwell-epstein.html",
    "timestamp": "2025-08-12T10:00:07Z"
  }
]