[
  {
    "title": "5 Reasons Trump’s Trade Deal With China Is Bad News for the Middle Class",
    "description": "Trump’s trade deal with China may hit the middle class hard. Discover 5 key reasons it could raise costs, affect jobs and shake your financial future.",
    "link": "https://finance.yahoo.com/news/5-reasons-trump-trade-deal-155814555.html",
    "timestamp": "2025-07-29T15:58:14Z"
  },
  {
    "title": "“Trump Accounts” Are The Next Generation’s First Steps Toward Financial Independence",
    "description": "New federal law creates $1,000 investment accounts for all babies born 2025-2028. Parents can contribute $5K annually. Could mean $360K by age 18 for full participation.",
    "link": "https://www.forbes.com/sites/sarahkeohanewilliamson/2025/07/29/trump-accounts-are-the-next-generations-first-steps-toward-financial-independence/",
    "timestamp": "2025-07-29T15:57:34Z"
  },
  {
    "title": "Fed meeting and rate cut buzz take center stage as Powell weighs tariffs and inflation—will markets get the dovish signal they’re hoping for?",
    "description": "Trump pressures Fed for rate cuts as inflation rises and the July 30 meeting nears, putting Jerome Powell in the hot seat. With U.S. inflation hitting 2.7% in June, Trump is demanding aggressive interest rate cuts down to 1%, while also slamming the Fed’s $2.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-fed-meeting-and-rate-cut-buzz-take-center-stage-as-powell-weighs-tariffs-and-inflationwill-markets-get-the-dovish-signal-theyre-hoping-for-as-july-30-decision-loomss/articleshow/122979494.cms",
    "timestamp": "2025-07-29T15:57:11Z"
  },
  {
    "title": "Tariff deal will result in ‘considerable negative repercussions’, German industry warns",
    "description": "Companies in Germany’s critical automotive sector are reportedly beginning their own direct trade talks with Washington",
    "link": "https://www.irishtimes.com/business/economy/2025/07/29/tariff-deal-will-result-in-considerable-negative-repercussions-german-industry-warns/",
    "timestamp": "2025-07-29T15:56:35Z"
  },
  {
    "title": "Trump Revokes Scientific Finding on Climate Change",
    "description": "\"President Donald Trump’s administration on Tuesday proposed revoking a scientific finding that has long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change,\" the AP reports. \"The proposed",
    "link": "https://politicalwire.com/2025/07/29/trump-revokes-scientific-finding-on-climate-change/",
    "timestamp": "2025-07-29T15:54:57Z"
  },
  {
    "title": "Laura Ingraham's Latest Attack On Jasmine Crockett Evokes 'Ugliest Roots Of American History'",
    "description": "\"An addiction to hate is arguably the most contagious and deadly of all human diseases,\" an expert in American studies said.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-laura-ingraham-maga-culture-cruelty_n_6887c3a8e4b0b5f7e9083e0c",
    "timestamp": "2025-07-29T15:52:48Z"
  },
  {
    "title": "The State as Liar",
    "description": "Today marks the first anniversary of the slaughter at Southport - at one of those summer-resort activities you sign your kids up for, with nary a thought. In this case, it was a Taylor Swift dance-class, from which three little girls never came home: Alice da…",
    "link": "https://freerepublic.com/focus/f-news/4331448/posts",
    "timestamp": "2025-07-29T15:51:21Z"
  },
  {
    "title": "UK to recognise Palestine as a state in September - unless Israel meets conditions",
    "description": "The British government has said it will officially recognise Palestine as a state in September - unless Israel meets certain conditions.",
    "link": "https://news.sky.com/story/uk-to-recognise-palestine-as-a-state-in-september-unless-israel-meets-conditions-13399534",
    "timestamp": "2025-07-29T15:50:00Z"
  },
  {
    "title": "Sen. Hawley Introduces $600 Tariff Rebate Legislation",
    "description": "Senator Hawley introduces a tariff rebate of $600 per taxpayer and each dependent children.",
    "link": "https://www.forbes.com/sites/jimwang/2025/07/29/sen-hawley-introduces-600-tariff-rebate-legislation/",
    "timestamp": "2025-07-29T15:48:05Z"
  },
  {
    "title": "White House X Account Suddenly Becomes Trump Golf Club Fan Account",
    "description": "It looks like the White House official social media is being used as unofficial advertising space for the Trump family’s newest golf course.To close out his four-day taxpayer-funded trip to Scotland, the president attended the grand opening ceremony of the Tr…",
    "link": "https://newrepublic.com/post/198555/donald-white-house-x-account-golf-club-commercial",
    "timestamp": "2025-07-29T15:47:38Z"
  },
  {
    "title": "US set to scrap landmark finding that sets limit on carbon emission",
    "description": "Experts warn the move will severely curb the federal government's ability to combat climate change.",
    "link": "https://www.bbc.com/news/articles/c0mlzz1gy39o",
    "timestamp": "2025-07-29T15:44:18Z"
  },
  {
    "title": "Trade deals: It’s advantage America",
    "description": "A three-fold rise in US tariffs seems to be the ultimate aim",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/trade-deals-its-advantage-america/article69868940.ece",
    "timestamp": "2025-07-29T15:44:01Z"
  },
  {
    "title": "US Consumer Confidence Rises On Outlook For Economy, Job Market",
    "description": "US consumer confidence increased in July as concerns eased about the outlook for the broader economy and the labor market. The Conference Board’s gauge of confidence rose 2 points to 97.2, data released Tuesday showed. The median estimate in a Bloomberg surve…",
    "link": "https://www.ndtvprofit.com/global-economics/us-consumer-confidence-rises-on-outlook-for-economy-job-market",
    "timestamp": "2025-07-29T15:40:46Z"
  },
  {
    "title": "Brace for the Most Expensive Coffee Yet, as Trump’s Tariffs Mix With the Climate Crisis",
    "description": "From drought-stricken farms to rising trade barriers, the global coffee industry is facing unprecedented strain.",
    "link": "https://gizmodo.com/brace-for-the-most-expensive-coffee-yet-as-trumps-tariffs-mix-with-the-climate-crisis-2000636087",
    "timestamp": "2025-07-29T15:40:29Z"
  },
  {
    "title": "Senate introduces bill for tariff rebate checks after Trump suggestion",
    "description": "Sen. Josh Hawley, R-Mo., introduced a bill to send tariff rebate checks to American families after President Donald Trump suggested the idea.",
    "link": "https://biztoc.com/x/f512406b8d1ded73",
    "timestamp": "2025-07-29T15:39:25Z"
  },
  {
    "title": "Trump Administration Restricting Kratom: What to Know",
    "description": "FDA officials also called for federal scheduling of the substance due to its risks, distinguishing it from the natural kratom plant.",
    "link": "https://www.newsweek.com/fda-restriction-7-oh-kratom-donald-trump-2105793",
    "timestamp": "2025-07-29T15:39:10Z"
  },
  {
    "title": "North Korea breaks silence on Trump's return, sends message from 'Rocket Man'",
    "description": "Trump-Kim relations aren't dead, says high ranking official Kim Yo Jong — but if denuclearization is on the table, Pyongyang says don’t bother picking up the phone.",
    "link": "https://www.foxnews.com/politics/north-korea-breaks-silence-trumps-return-sends-message-from-rocket-man",
    "timestamp": "2025-07-29T15:37:50Z"
  },
  {
    "title": "Dems All But Coronate Star Recruit In Key Midterm Race As Ex-Rep Drops Bid",
    "description": "Former Democratic North Carolina Rep. Wiley Nickel announced Tuesday that he is suspending his bid for the state's open Senate seat and endorsing Roy Cooper.",
    "link": "https://dailycaller.com/2025/07/29/wiley-nickel-roy-cooper-north-carolina-senate/",
    "timestamp": "2025-07-29T15:37:22Z"
  },
  {
    "title": "The Fed's Two-Day Policy Meeting Kicked Off Tuesday—What You Need To Know",
    "description": "Federal Reserve officials are unlikely to cut their influential interest rate in their two-day meeting this week, despite pressure from President Donald...",
    "link": "https://www.investopedia.com/the-fed-s-two-day-policy-meeting-kicked-off-tuesday-what-you-need-to-know-11780829",
    "timestamp": "2025-07-29T15:34:21Z"
  },
  {
    "title": "Yes, Tariffs Are Raising Prices",
    "description": "Economic data from the past few months provide a preview of what's to come after the August 1 tariffs hit: Higher prices for Americans.",
    "link": "https://reason.com/2025/07/29/yes-tariffs-are-raising-prices/",
    "timestamp": "2025-07-29T15:34:08Z"
  },
  {
    "title": "'Worst-case Scenario' Unfolding In Gaza, Food Crisis Experts Warn",
    "description": "Recent developments have “dramatically worsened” the situation, including “increasingly stringent blockades” by Israel, the alert said.",
    "link": "https://www.huffpost.com/entry/worst-case-scenario-gaza-famine_n_6888e7eae4b0f42ad3888732",
    "timestamp": "2025-07-29T15:33:53Z"
  },
  {
    "title": "Chief Justice John Roberts Stepped in to Prevent Firing of National Portrait Gallery Director",
    "description": "Chief Justice John Roberts reportedly stepped in to prevent the firing of National Portrait Gallery director Kim Sajet.",
    "link": "https://www.artnews.com/art-news/news/john-roberts-smithsonian-kim-sajet-firing-1234748455/",
    "timestamp": "2025-07-29T15:33:05Z"
  },
  {
    "title": "Argentina Welcomes Kristi Noem with Horseback Riding and Famous Local Barbecue",
    "description": "Department of Homeland Security (DHS) Sec. Kristi Noem received a warm welcome from President Javier Milei and his cabinet during her official visit to Argentina on Monday — including horseback riding with Security Minister Patricia Bullrich and enjoying the …",
    "link": "https://www.breitbart.com/latin-america/2025/07/29/argentina-welcomes-kristi-noem-with-horseback-riding-and-famous-local-barbecue/",
    "timestamp": "2025-07-29T15:32:00Z"
  },
  {
    "title": "The D Brief: Two mass shootings; US nukes to UK?; Trump’s new deadline; Europe’s defense-AI startups; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/07/the-d-brief-july-29-2025/407057/",
    "timestamp": "2025-07-29T15:31:33Z"
  },
  {
    "title": "Jorge Masvidal will call in 'favor' for UFC White House, pitches Colby Covington rematch",
    "description": "Jorge Masvidal says Donald Trump owes him a \"favor,\" and he plans to call it in to compete at UFC's White House event.",
    "link": "https://mmajunkie.usatoday.com/story/sports/ufc/2025/07/29/jorge-masvidal-pitches-colby-covington-rematch-ufc-white-house-donald-trump/85402930007/",
    "timestamp": "2025-07-29T15:30:38Z"
  },
  {
    "title": "“No leader asked Bharat to stop operation,” Modi on Trump’s truce claim",
    "description": "PM Modi refutes Trump's claim on India-Pakistan peace, asserts no foreign leader asked to halt Operation Sindoor.",
    "link": "https://www.thehindubusinessline.com/news/no-leader-asked-bharat-to-stop-operation-modi-on-trumps-truce-claim/article69870463.ece",
    "timestamp": "2025-07-29T15:30:19Z"
  },
  {
    "title": "Trump Slams High Taxes on UK’s North Sea Oil",
    "description": "Hours after meeting with UK’s Prime Keir Starmer, U.S. President Donald Trump hit out at the high taxes on the North Sea oil industry in yet another criticism of Britain’s energy policies.  “North Sea Oil is a TREASURE CHEST for the United Kingdom. The taxes …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Slams-High-Taxes-on-UKs-North-Sea-Oil.html",
    "timestamp": "2025-07-29T15:30:00Z"
  },
  {
    "title": "'No doubt!' Wolf Blitzer stunned as Israeli official calls CNN starvation pics propaganda",
    "description": "CNN's Wolf Blitzer continuously challenged Israel's Ambassador to the United States, Yechiel Leiter, for claiming the charges of Israeli-imposed starvation in Gaza were fabricated.During a lengthy interview Tuesday, Blitzer confronted Leiter with a video of I…",
    "link": "https://www.rawstory.com/israel-gaza-2673779678/",
    "timestamp": "2025-07-29T15:29:15Z"
  },
  {
    "title": "Trump nukes Biden’s broadband gimmick, saving taxpayers billions",
    "description": "Biden’s broadband plan wasted billions, favored political allies, and failed rural voters. Trump scrapped it — and Democrats are furious. President Trump has consistently applied one simple litmus test to any government program: Does it work? If so — a rare o…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331444/posts",
    "timestamp": "2025-07-29T15:29:04Z"
  },
  {
    "title": "Harvard Reportedly Willing To Surrender In War With Trump Admin — Even If It Costs $500,000,000",
    "description": "Harvard University is considering dropping up to $500 million to settle its dispute with the Trump administration, The New York Times reported on Monday.",
    "link": "https://dailycaller.com/2025/07/29/harvard-reportedly-willing-to-drop-500-million-to-settle-trump-admin-dispute/",
    "timestamp": "2025-07-29T15:28:53Z"
  },
  {
    "title": "DOJ Takes Action Against Judge Boasberg For Plot Against Trump",
    "description": "An anti-Trump judge who has stymied the president’s agenda with nationwide injunctions is now seeing the tables turned thanks to a newly filed complaint by the U.S. Justice Department. U.S. Attorney General Pam Bondi, in the complaint, accuses District Judge …",
    "link": "https://freerepublic.com/focus/f-chat/4331443/posts",
    "timestamp": "2025-07-29T15:27:59Z"
  },
  {
    "title": "Jon Stewart Jokes Trump Did What Anybody Who Was Innocent of Working With Epstein Would Do: ‘Fled the Country’ | Video",
    "description": "Plus, the \"Daily Show\" host gets a surprise appearance from \"Shrinking\" star and former senior correspondent Jessica Williams\nThe post Jon Stewart Jokes Trump Did What Anybody Who Was Innocent of Working With Epstein Would Do: ‘Fled the Country’ | Video appea…",
    "link": "https://www.thewrap.com/daily-show-jon-stewart-trump-epstein-fled-jessica-williams/",
    "timestamp": "2025-07-29T15:27:37Z"
  },
  {
    "title": "Trump Cranks Showtunes to Drown Out Epstein Grilling — As Reporters Debate Song Title in Comical Scene",
    "description": "Trump cranked up the volume on his showtunes to drown out Epstein questions as reporters debated the song title in a comical scene at Trump Turnberry.\nThe post Trump Cranks Showtunes to Drown Out Epstein Grilling — As Reporters Debate Song Title in Comical Sc…",
    "link": "https://www.mediaite.com/media/news/trump-cranks-showtunes-to-drown-out-epstein-grilling-as-reporters-debate-song-title-in-comical-scene/",
    "timestamp": "2025-07-29T15:26:50Z"
  },
  {
    "title": "Judge blocks eight Youngkin appointees to boards of Mason, UVa, VMI",
    "description": "Democratic state senators said their committee vote constitutes a rejection of Youngkin's picks. Lawyers for Attorney General Jason Miyares say the full General Assembly must take such a vote.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_61ac74a6-8955-4f2a-a8c5-5a330ac01918.html",
    "timestamp": "2025-07-29T15:26:00Z"
  },
  {
    "title": "Trump Environmental Protection Agency moves to repeal finding that allows climate regulation",
    "description": "The Trump administration, via the EPA, proposed revoking the 2009 endangerment finding, which declared greenhouse gases a threat to public health and welfare. This action could dismantle numerous climate regulations under the Clean Air Act.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-environmental-protection-agency-moves-to-repeal-finding-that-allows-climate-regulation/articleshow/122979593.cms",
    "timestamp": "2025-07-29T15:24:57Z"
  },
  {
    "title": "Russian strikes kill dozens in Ukraine after Trump shortens peace deal deadline",
    "description": "Prison bombed three years to the night after similar strike killed more than 50 Ukrainians",
    "link": "https://www.irishtimes.com/world/europe/2025/07/29/russian-strikes-kill-dozens-in-ukraine-after-trump-shortens-peace-deal-deadline/",
    "timestamp": "2025-07-29T15:24:49Z"
  },
  {
    "title": "Eric Trump Shares Highlights from President Donald Trump’s Aberdeen Golf Course Inauguration",
    "description": "Donald Trump inaugurated his latest golf course, Trump International Golf Links, in Balmedie, Scotland, with festivities including fireworks and bagpipes. Eric Trump designed the course, calling it his father's \"passion project.\" Trump touted his Scottish her…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/eric-trump-shares-highlights-from-president-donald-trumps-aberdeen-golf-course-inauguration/articleshow/122979530.cms",
    "timestamp": "2025-07-29T15:24:23Z"
  },
  {
    "title": "Trump Admin Reportedly Denies Taiwanese President US Visit",
    "description": "President Donald Trump reportedly denied the Taiwanese President Lai Ching-te a visit to the U.S. amid trade talks with the People's Republic of China",
    "link": "https://dailycaller.com/2025/07/29/trump-reportedly-denies-taiwanese-president-us-visit-china/",
    "timestamp": "2025-07-29T15:24:12Z"
  },
  {
    "title": "Karoline Leavitt’s Failed Congressional Bid Comes Back to Bite Her",
    "description": "Debt creditors are on the prowl for federal officials.White House press secretary Karoline Leavitt owes $326,370.50 in the aftermath of her failed 2022 congressional campaign, according to a new disclosure filed with the Federal Election Commission. Her campa…",
    "link": "https://newrepublic.com/post/198558/karoline-leavitt-failed-congressional-bid-debt",
    "timestamp": "2025-07-29T15:22:04Z"
  },
  {
    "title": "Republican Senator Introduces Bill to Send Thousands of Dollars in Trump Tariff ‘Rebate Checks’ to Families",
    "description": "Hawley, who hails from the economic populist wing of the GOP, announced the American Worker Rebate Act in a press release Monday.\nThe post Republican Senator Introduces Bill to Send Thousands of Dollars in Trump Tariff ‘Rebate Checks’ to Families first appear…",
    "link": "https://www.mediaite.com/politics/republican-senator-introduces-bill-to-send-thousands-of-dollars-in-trump-tariff-rebate-checks-to-families/",
    "timestamp": "2025-07-29T15:20:32Z"
  },
  {
    "title": "Apple to Open Manufacturing Academy in Detroit, but Don't Expect a US iPhone in Near Future",
    "description": "The manufacturing program will train businesses in AI and new production techniques.",
    "link": "https://www.cnet.com/tech/apple-to-open-manufacturing-academy-in-detroit-but-dont-expect-a-us-iphone-in-near-future/",
    "timestamp": "2025-07-29T15:18:02Z"
  },
  {
    "title": "Trump Used Your Tax Dollars to Open His New Scottish Golf Course",
    "description": "Donald Trump inaugurated a new, private golf course in Scotland during an official state trip funded by taxpayers.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-opens-scotland-golf-course-taxpayer-funded-trip-1235395950/",
    "timestamp": "2025-07-29T15:17:50Z"
  },
  {
    "title": "Trump opens new golf course in Scotland, capping trip to promote his luxury properties",
    "description": "The new course is part of Trump International Golf Links, Scotland, and hosts a PGA Seniors Championship event later this week.",
    "link": "https://www.pbs.org/newshour/politics/trump-opens-new-golf-course-in-scotland-capping-trip-to-promote-his-luxury-properties",
    "timestamp": "2025-07-29T15:16:40Z"
  },
  {
    "title": "US mining billionaire welcomes Trump tariffs on copper",
    "description": "Robert Friedland of Ivanhoe Mines told the BBC the 50% tariffs would help re-establish the US copper mining industry.",
    "link": "https://www.bbc.com/news/articles/cx23m55ej1zo",
    "timestamp": "2025-07-29T15:15:57Z"
  },
  {
    "title": "MAGA Bends Over Backward to Blame Zohran Mamdani for NYC Shooting",
    "description": "The right-wing commentariat is using Monday’s deadly mass shooting in Manhattan, in which a gunman shot and killed four people, to discredit the candidacy of mayoral front-runner Zohran Mamdani.The attacks ran the gamut, from mischaracterizations of the Democ…",
    "link": "https://newrepublic.com/post/198553/maga-blames-zohran-mamdani-nyc-shooting",
    "timestamp": "2025-07-29T15:14:54Z"
  },
  {
    "title": "Gaza Humanitarian Foundation: What to know about the US-backed aid group",
    "description": "The U.S.-backed Gaza Humanitarian Foundation operates four sites providing food boxes with 2,400 daily calories, while facing criticism from the U.N. and several American allies.",
    "link": "https://www.foxnews.com/world/gaza-humanitarian-foundation-what-know-about-us-backed-aid-group",
    "timestamp": "2025-07-29T15:14:32Z"
  },
  {
    "title": "How a Nazi Helped the New York Times Smear Zohran Mamdani",
    "description": "This post contains a video, which you can also view here. To support more videos like this, head to patreon.com/rebecca! Transcript: Hey, did you guys hear? The guy who won the Democratic primary for mayor of New York City checked the boxes for “African” and …",
    "link": "https://skepchick.org/2025/07/how-a-nazi-helped-the-new-york-times-smear-zohran-mamdani/",
    "timestamp": "2025-07-29T15:14:07Z"
  },
  {
    "title": "Huckabee: 'French recognizing Palestine like giving Nazis a victory after WW2'",
    "description": "US Amb. to Israel says there is no \"rift\" between Netanyahu and Trump, warns French move to recognize Palestine as a state causing Hamas to harden its positions.",
    "link": "https://www.israelnationalnews.com/news/412438",
    "timestamp": "2025-07-29T15:13:45Z"
  },
  {
    "title": "No leader of any country asked India to stop Operation Sindoor: PM Modi in LS",
    "description": "NEW DELHI: Prime Minister Narendra Modi on Tuesday affirmed in the Lok Sabha that no leader of any country asked India to stop Operation Sindoor but lamented that while the nation got support from the entire world, the Congress and its allies could not stand …",
    "link": "https://statetimes.in/no-leader-of-any-country-asked-india-to-stop-operation-sindoor-pm-modi-in-ls/",
    "timestamp": "2025-07-29T15:13:41Z"
  },
  {
    "title": "Nancy Pelosi Praises Lady Gaga After Attending Mayhem Ball",
    "description": "Nancy Pelosi praised Lady Gaga after attending a Mayhem Ball tour show in San Francisco.",
    "link": "http://www.billboard.com/music/music-news/nancy-pelosi-praises-lady-gaga-attending-mayhem-ball-1236032324/",
    "timestamp": "2025-07-29T15:13:37Z"
  },
  {
    "title": "Targeting Democrats, Alabama’s Tommy Tuberville flunks a test of self-awareness",
    "description": "When it comes to blocking White House nominees, Tommy Tuberville appears shocked that Senate Democrats are doing the same thing he did during Joe Biden's term.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-confirmation-delay-senate-democrats-rcna221714",
    "timestamp": "2025-07-29T15:12:47Z"
  },
  {
    "title": "Off-duty NYPD officer, father of 2 killed in deranged gunman's Manhattan rampage",
    "description": "Off-duty NYPD officer Didarul Islam is being remembered as a hero after he was killed while providing security for an office building in Manhattan when a gunman opened fire.",
    "link": "https://www.foxnews.com/us/off-duty-nypd-officer-father-2-killed-deranged-gunmans-manhattan-rampage",
    "timestamp": "2025-07-29T15:12:26Z"
  },
  {
    "title": "Leftist Canada PM Mark Carney Again Lowers Expectations on Trump Trade Deal",
    "description": "Canadian Prime Minister Mark Carney described his country's trade negotiations with the United States as \"intense\" and \"complex\" on Monday, failing to express confidence that the parties would meet the August 1 deadline for an agreement to prevent Washington …",
    "link": "https://www.breitbart.com/economy/2025/07/29/leftist-canada-pm-mark-carney-again-lowers-expectations-on-trump-trade-deal/",
    "timestamp": "2025-07-29T15:12:14Z"
  },
  {
    "title": "Sydney Sweeney's ad shows an unbridled cultural shift toward whiteness",
    "description": "Advertisements are always mirrors of society, and sometimes what they reflect is ugly and startling. This week, American Eagle, which brought us baby tees and low-rise denim in the aughts, debuted an advertisement campaign starring actor Sydney Sweeney. Sween…",
    "link": "https://freerepublic.com/focus/f-news/4331440/posts",
    "timestamp": "2025-07-29T15:11:52Z"
  },
  {
    "title": "FOMO won, I own a Switch 2 now",
    "description": "Well, that didn’t even last two months. Just after the launch of the Nintendo Switch 2, I wrote about how, despite the tremendous amount of FOMO, I, like so many gamers, felt the Nintendo Switch 2 wasn’t a necessary purchase just yet. Most consoles don’t prov…",
    "link": "https://www.polygon.com/nintendo-switch-2/617002/fomo-buying-switch-tariffs-price-increase",
    "timestamp": "2025-07-29T15:11:04Z"
  },
  {
    "title": "'Ogling women': Pete Buttigieg doesn't hold back as he wades into Trump-Epstein saga",
    "description": "Former Secretary of Transportation Pete Buttigieg laid into President Donald Trump in an interview\r\n published Tuesday over his close ties with Jeffrey Epstein — ties which he argued went well beyond a casual relationship.“We all know for a fact that there we…",
    "link": "https://www.rawstory.com/pete-buttigieg-2673779543/",
    "timestamp": "2025-07-29T15:08:44Z"
  },
  {
    "title": "Oil Advances on US Consumer Surprise, Trump’s Truce Pressure",
    "description": "In This Article:\n(Bloomberg) -- Oil extended gains amid better-than-expected US economic data and concerns about international supply disruptions.\nMost Read from Bloomberg\nWest Texas Intermediate crude traded above $67 a barrel after US President Donald Trump…",
    "link": "https://biztoc.com/x/aa1c7906d3376d03",
    "timestamp": "2025-07-29T15:06:33Z"
  },
  {
    "title": "Trump acknowledges \"real starvation\" in Gaza, vows to increase food aid",
    "description": "Donald Trump has recognised the Gaza hunger crisis. The US will increase food aid to the war-hit area. Trump plans to set up food centres in Gaza. This follows meetings with European leaders. They spoke of the suffering in Gaza. Trump criticised existing aid …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-acknowledges-real-starvation-in-gaza-vows-to-increase-food-aid/articleshow/122979297.cms",
    "timestamp": "2025-07-29T15:06:30Z"
  },
  {
    "title": "EXCLUSIVE: GOP Revs Up Election Integrity Efforts With Midterms Fast Approaching",
    "description": "A little more than a year out from the midterm elections, the Republican National Committee is ramping up election integrity efforts",
    "link": "https://dailycaller.com/2025/07/29/gop-election-integrity-virginia-training-republican-national-committee-michael-whatley-midterms/",
    "timestamp": "2025-07-29T15:06:29Z"
  },
  {
    "title": "New York Mass Shooter Blamed NFL For His Brain Injuries",
    "description": "A man who killed four people, then committed suicide in a New York skyscraper, may have been targeting the NFL offices there because he blamed the American football league for brain injuries he said he suffered, Mayor Eric Adams said Tuesday.",
    "link": "https://www.ibtimes.com/new-york-mass-shooter-blamed-nfl-his-brain-injuries-3779724",
    "timestamp": "2025-07-29T15:06:16Z"
  },
  {
    "title": "Trump Says He’ll Go To China — But ‘Only If Xi Invites Him’",
    "description": "US President Donald Trump rejected recent reports he was looking to meet with his Chinese counterpart Xi Jinping, adding that he might go to China but only if Xi were to invite him.\n“The Fake News is reporting that I am SEEKING a “Summit” with President Xi of…",
    "link": "https://biztoc.com/x/389f0cc6a1cb3e11",
    "timestamp": "2025-07-29T15:05:18Z"
  },
  {
    "title": "‘No Other Land’ Contributor Odeh Hadalin Killed in West Bank Settler Attack",
    "description": "Odeh Hadalin, a contributor to the Oscar-winning documentary 'No Other Land,' was reportedly killed in an attack by Israeli settlers in the West Bank.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/no-other-land-contributor-odeh-hadalin-killed-west-bank-1235395741/",
    "timestamp": "2025-07-29T15:03:47Z"
  },
  {
    "title": "Charlamagne Calls Out ‘Liberal Media’ Double Standard Over Epstein",
    "description": "Charlamagne Tha God suggested that left-wing media is only covering Donald Trump's alleged ties to Jeffrey Epstein so intensely due to its bias.",
    "link": "https://dailycaller.com/2025/07/29/charlamagne-calls-out-liberal-media-epstein/",
    "timestamp": "2025-07-29T15:03:43Z"
  },
  {
    "title": "Charlamagne Attacks ‘Liberal Media’ for Focusing on Trump-Epstein Relationship and Ignoring Bill Clinton Connection",
    "description": "Charlamagne claimed the \"liberal media\" is showing its bias by focusing on President Donald Trump's Epstein relationship more than Bill Clinton's connections.\nThe post Charlamagne Attacks ‘Liberal Media’ for Focusing on Trump-Epstein Relationship and Ignoring…",
    "link": "https://www.mediaite.com/media/radio/charlamagne-attacks-liberal-media-for-focusing-on-trump-epstein-relationship-and-ignoring-bill-clinton-connection/",
    "timestamp": "2025-07-29T15:03:27Z"
  },
  {
    "title": "Trump Squeezes In Round Of Golf Before Returning To ‘Put Out Fires’",
    "description": "The president opened his newest Scottish golf course, ending a $10 million taxpayer-funded foreign trip.",
    "link": "https://www.huffpost.com/entry/trump-golf-put-out-fires_n_6888c5a8e4b0d2f593268d4c",
    "timestamp": "2025-07-29T15:02:09Z"
  },
  {
    "title": "Blue States Try To Stop Trump Admin From Investigating Food Stamp Fraud",
    "description": "A coalition of Democrat attorneys general is waging a court battle to block the Trump administration from obtaining food stamp data on millions of recipients.",
    "link": "https://dailycaller.com/2025/07/29/blue-states-sue-over-food-stamp-data/",
    "timestamp": "2025-07-29T15:00:46Z"
  },
  {
    "title": "Stablecoin On The Crosshair For $110-B Firm Interactive Brokers",
    "description": "Interactive Brokers is thinking about rolling out a stablecoin. The brokerage firm, which manages about $110 billion in client assets, says this could let its 3.87 million customers move money instantly, day or night. It’s a big move for a company known for l…",
    "link": "https://bitcoinist.com/stablecoin-on-the-crosshair-for-110-b-firm-interactive-brokers/",
    "timestamp": "2025-07-29T15:00:39Z"
  },
  {
    "title": "White House allows workers to display Bibles in workplace",
    "description": "Federal employees can also hold prayer groups in offices during off hours, new guidance from the government’s HR office states Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622152-us-federal-employees-bible-workplace/",
    "timestamp": "2025-07-29T15:00:35Z"
  },
  {
    "title": "Trump EPA moves to repeal landmark finding that allows climate regulation",
    "description": "The EPA rule proposed rescinds a 2009 declaration that determined carbon dioxide and other greenhouse gases endanger public health.",
    "link": "https://www.denverpost.com/2025/07/29/epa-repeal-landmark-finding-effort/",
    "timestamp": "2025-07-29T15:00:22Z"
  },
  {
    "title": "Trump EPA moves to repeal landmark finding that allows climate regulation",
    "description": "The EPA rule proposed rescinds a 2009 declaration that determined carbon dioxide and other greenhouse gases endanger public health.",
    "link": "https://www.bostonherald.com/2025/07/29/epa-repeal-landmark-finding-effort/",
    "timestamp": "2025-07-29T15:00:22Z"
  },
  {
    "title": "UPDATE: FBI Has Secret Prison Tape With No 'Missing Minute'...",
    "description": "The FBI has a version of the surveillance video filmed near Jeffrey Epstein’s prison block on the night of his",
    "link": "https://dnyuz.com/2025/07/29/fbi-has-secret-epstein-prison-tape-with-no-missing-minute/",
    "timestamp": "2025-07-29T15:00:03Z"
  },
  {
    "title": "Brent Jumps Above $70 on Secondary Tariff Fears",
    "description": "Donald Trump rattled markets again by threatening secondary sanctions on Russian energy buyers and setting a tighter ceasefire deadline for Moscow, driving Brent crude above $70 as traders also eyed progress on US-China trade talks. Trump’s $750 Billion Energ…",
    "link": "https://oilprice.com/Energy/Oil-Prices/Brent-Jumps-Above-70-on-Secondary-Tariff-Fears.html",
    "timestamp": "2025-07-29T15:00:00Z"
  },
  {
    "title": "Senate introduces bill for tariff rebate checks after Trump suggestion",
    "description": "Sen. Josh Hawley, R-Mo., introduced a bill to send tariff rebate checks to American families after President Donald Trump suggested the idea.",
    "link": "https://www.cnbc.com/2025/07/29/tariff-rebate-check-trump.html",
    "timestamp": "2025-07-29T14:58:46Z"
  },
  {
    "title": "EPA moves to repeal landmark finding that allows climate regulation",
    "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change",
    "link": "https://abcnews.go.com/US/wireStory/trump-epa-moves-repeal-landmark-finding-allows-climate-124173885",
    "timestamp": "2025-07-29T14:58:35Z"
  },
  {
    "title": "What Trump’s ‘Big Beautiful Bill’ Could Mean for SNAP Benefits",
    "description": "What exactly does Trump's One Big Beautiful Bill mean for SNAP recipients?",
    "link": "https://www.yahoo.com/news/articles/trump-big-beautiful-bill-could-145835648.html",
    "timestamp": "2025-07-29T14:58:35Z"
  },
  {
    "title": "Abortion and the 2026 Elections",
    "description": "While public support for abortion rights remains strong, the issue has become localized, losing prominence as a national political priority.",
    "link": "https://www.forbes.com/sites/bowmanmarsico/2025/07/29/abortion-and-the-2026-elections/",
    "timestamp": "2025-07-29T14:58:23Z"
  },
  {
    "title": "Trump Administration Boycotts UN ‘Publicity Stunt’ Conference On Palestinian Statehood",
    "description": "The Trump administration says it boycotted a United Nations conference promoting the two-state solution on Monday, calling the event a “publicity stunt” and an “insult.” “This week, the U.N. will serve as host to an unproductive and ill-timed conference on th…",
    "link": "https://freerepublic.com/focus/f-news/4331433/posts",
    "timestamp": "2025-07-29T14:58:14Z"
  },
  {
    "title": "'Playing dress-up': Purged FBI vet slaps back at old bosses in scorching attack",
    "description": "President Donald Trump's handpicked leaders for the FBI are essentially cosplaying their roles, according to a veteran agent pushed out by the pair's purge of the bureau's ranks.Michael Feinberg, a 15-year veteran working as an assistant special agent in char…",
    "link": "https://www.rawstory.com/kash-patel-dan-bongino-2673778874/",
    "timestamp": "2025-07-29T14:57:52Z"
  },
  {
    "title": "Trump’s Environmental Protection Agency moves to repeal finding that allows climate regulation",
    "description": "WASHINGTON (AP) — President Donald Trump’s administration on Tuesday proposed revoking a scientific finding that has long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change. The proposed Environmental Protecti…",
    "link": "https://financialpost.com/pmn/trump-epa-moves-to-repeal-landmark-finding-that-allows-climate-regulation",
    "timestamp": "2025-07-29T14:56:59Z"
  },
  {
    "title": "GOP Wants To Re-Name Kennedy Center, 'Trump Something'",
    "description": "After President John F. Kennedy was assassinated in 1963, the arts center was named after the former President. But never mind all that, because a House Republican's bill would strip former President Kennedy's name from the Washington institution created in t…",
    "link": "https://crooksandliars.com/2025/07/gop-bill-seeks-remove-jfk-s-name-kennedy",
    "timestamp": "2025-07-29T14:55:00Z"
  },
  {
    "title": "IMF warns on risks to global economy amid tariff trade shock – as it happened",
    "description": "",
    "link": "https://biztoc.com/x/096b450a3b02e68e",
    "timestamp": "2025-07-29T14:54:42Z"
  },
  {
    "title": "Trump Environmental Protection Agency moves to repeal finding that allows climate regulation",
    "description": "President Donald Trump's administration on Tuesday proposed revoking a scientific finding that has long been the central basis for U.S. action to regulate...",
    "link": "https://www.yahoo.com/news/articles/trump-epa-moves-repeal-landmark-145318150.html",
    "timestamp": "2025-07-29T14:53:18Z"
  },
  {
    "title": "How Sports Tickets Got So Expensive—Or Did They?",
    "description": "The number of games and seating capacity at games haven't increased in the last 25 years, so as interest has gone up, prices have too.",
    "link": "https://reason.com/2025/07/29/how-sports-tickets-got-so-expensive-or-did-they/",
    "timestamp": "2025-07-29T14:53:05Z"
  },
  {
    "title": "How Spanish olive exporters survived Trump tariffs since 2017",
    "description": "STORY: Spain's black olive exporters were slapped with harsh tariffs in U.S. President Donald Trump's first term.Only four major players remain among the 25 ...",
    "link": "https://finance.yahoo.com/video/spanish-olive-exporters-survived-trump-145232667.html",
    "timestamp": "2025-07-29T14:52:32Z"
  },
  {
    "title": "Stephen Colbert mocks Paramount, SkyDance merger with vulgar monologue",
    "description": "Stephen Colbert dug in on the SkyDance-Paramount merger on Monday during his monologue, mocking the news with pee jokes as the company will trade under the ticker, \"PSKY.\"",
    "link": "https://www.foxnews.com/media/stephen-colbert-mocks-paramount-skydance-merger-vulgar-monologue",
    "timestamp": "2025-07-29T14:51:39Z"
  },
  {
    "title": "Russia Strikes Kill 25 In Ukraine As Kremlin Notes New Trump Deadline",
    "description": "Russia said on Tuesday that it wanted peace in Ukraine, hours after mounting attacks that killed at least 25 people, including a 23-year-old pregnant woman and more than a dozen prison inmates.",
    "link": "https://www.ibtimes.com.au/russia-strikes-kill-25-ukraine-kremlin-notes-new-trump-deadline-1859879",
    "timestamp": "2025-07-29T14:51:06Z"
  },
  {
    "title": "Trump’s tariffs could squeeze U.S. factories and raise costs by up to 4.5%, a new analysis finds",
    "description": "The analysis by the Washington Center for Equitable Growth warns of economic and political costs, especially in swing states with significant manufacturing sectors, like Michigan and Wisconsin.",
    "link": "https://www.pbs.org/newshour/economy/trumps-tariffs-could-squeeze-u-s-factories-and-raise-costs-by-up-to-4-5-a-new-analysis-finds",
    "timestamp": "2025-07-29T14:51:02Z"
  },
  {
    "title": "Somali Socialist Running For Minneapolis Mayor Defended Fraudsters Who Stole Food From Poor Kids",
    "description": "Omar Fateh, the Somalian American democratic socialist running for mayor of Minneapolis, once went to bat for the fraudsters behind a $250 million scam that involved stealing from a government child nutrition program during the COVID pandemic. Later, when the…",
    "link": "https://freerepublic.com/focus/f-news/4331430/posts",
    "timestamp": "2025-07-29T14:50:49Z"
  },
  {
    "title": "Georgia Rep. Claims Big Numbers in Early Senate Fundraising",
    "description": "Republican Rep. Mike Collins of Georgia claims he’s on a fundraising roll after announcing his bid Monday to unseat Democrat incumbent Sen. Jon Ossoff in... Read More\nThe post Georgia Rep. Claims Big Numbers in Early Senate Fundraising appeared first on The D…",
    "link": "https://www.dailysignal.com/2025/07/29/georgia-rep-claims-big-numbers-in-early-senate-fundraising/",
    "timestamp": "2025-07-29T14:50:00Z"
  },
  {
    "title": "Donald Trump calls New York shooting 'senseless' violence by 'crazed lunatic'",
    "description": "US President Donald Trump on Tuesday called a mass shooting in New York a \"senseless act of violence\" carried out by a \"lunatic.\" \"I trust our Law Enforcement Agencies to get to the bottom of why this crazed lunatic committed such a senseless act of violence,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-calls-new-york-shooting-senseless-violence-by-crazed-lunatic/articleshow/122979100.cms",
    "timestamp": "2025-07-29T14:48:19Z"
  },
  {
    "title": "Cargo surge amid tariff turmoil drives the Port of Savannah to its 2nd busiest year",
    "description": "Retailers scrambling to stock up ahead of anticipated stiff tariffs on imports boosted the Port of Savannah, one of the top U.S. container ports, to its...",
    "link": "https://www.yahoo.com/news/articles/cargo-surge-amid-tariff-turmoil-144757768.html",
    "timestamp": "2025-07-29T14:47:57Z"
  },
  {
    "title": "Friday fury ahead? India's tariff clock is ticking",
    "description": "As the August 1st deadline looms, India faces potential US tariffs due to unresolved trade negotiations. The US team's visit on August 25th signals a missed deadline, increasing the risk of punitive measures. Trump's administration may use tariffs to pressure…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/friday-fury-ahead-indias-tariff-clock-is-ticking/articleshow/122979084.cms",
    "timestamp": "2025-07-29T14:47:30Z"
  },
  {
    "title": "Barstool Sports and the Current MAGA Moment",
    "description": "As someone who doesn’t watch or care about sports, I know very little about sports media, so my familiarity with Dave Portnoy and Barstool Sports was very much on my periphery. I had a vague sense of how awful him/it was, but no information to go on beyond th…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/barstool-sports-and-the-current-maga-moment",
    "timestamp": "2025-07-29T14:46:40Z"
  }
]