[
  {
    "title": "Kristi Noem's Reality Show",
    "description": "My new essay for The Hill explains why DHS Sec. Kristi Noem probably couldn’t pass the civics test for naturalized citizens. Here is the gist: Immigration’s twisted new reality is beneath America Although it sounds like the premise for an absurdist sitcom or …",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/05/kristi-noems-reality-show.html",
    "timestamp": "2025-05-27T16:13:08Z"
  },
  {
    "title": "Why Trump’s radical offensive against Harvard won’t affect just the university",
    "description": "The more Donald Trump tries to punish Harvard, the more people who have nothing to do with the university will feel the effects of his offensive.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-harvard-university-grants-foreign-students-rcna209237",
    "timestamp": "2025-05-27T16:12:47Z"
  },
  {
    "title": "US Supreme Court rejects Native American case against large copper project",
    "description": "High court declines to hear bid to block a project that an Apache Indigenous group says would destroy a religious site.",
    "link": "https://www.aljazeera.com/news/2025/5/27/us-supreme-court-rejects-native-american-case-against-large-copper-project",
    "timestamp": "2025-05-27T16:11:23Z"
  },
  {
    "title": "Queen Camilla's Latest Rewear Nods to Meghan Markle and Prince Harry",
    "description": "For King Charles and Queen Camilla's historic visit to Canada, the queen opted for the same pale pink coat-dress she wore to Prince Harry and Meghan Markle's royal wedding back in 2018.",
    "link": "https://www.vanityfair.com/style/story/queen-camillas-latest-rewear-nods-to-meghan-markle-and-prince-harry",
    "timestamp": "2025-05-27T16:10:38Z"
  },
  {
    "title": "Democratic strategists question influence of Obama-era campaign operatives in party's future",
    "description": "As the Democratic Party weighs their future, strategists question the influence of Obama-era operatives as some call for a new approach following Kamala Harris' defeat.",
    "link": "https://www.foxnews.com/media/democratic-strategists-question-role-obama-campaign-operatives-partys-future",
    "timestamp": "2025-05-27T16:10:14Z"
  },
  {
    "title": "Canada is at 'critical moment,' King Charles tells parliament amid Trump annexation threats",
    "description": "King Charles III delivered a speech to Canada's parliament Monday in what is viewed as a show of support in the face of annexation threats by Donald Trump.",
    "link": "https://www.nbcnews.com/world/canada/king-charles-canada-parliament-speech-carney-donald-trump-annexation-rcna209156",
    "timestamp": "2025-05-27T16:10:04Z"
  },
  {
    "title": "Netanyahu faces mounting international doubts over Gaza war",
    "description": "Israeli Prime Minister Netanyahu faces growing criticism from key allies. While support remains, statements from the US and Europe signal a shift in tone and a more complex diplomatic landscape. After more than 18 months of war in Gaza, international patience…",
    "link": "https://www.dw.com/en/netanyahu-faces-mounting-international-doubts-over-gaza-war/a-72688767",
    "timestamp": "2025-05-27T16:08:00Z"
  },
  {
    "title": "Trump asks agencies to cut $100 million from Harvard’s federal contracts",
    "description": "The government already has canceled more than $2.6 billion in federal research grants for the Ivy League school, which has pushed back on the administration's demands for changes to several of its policies.",
    "link": "https://www.pbs.org/newshour/politics/trump-asks-agencies-to-cut-100-million-from-harvards-federal-contracts",
    "timestamp": "2025-05-27T16:07:45Z"
  },
  {
    "title": "Trump Says Putin ‘Playing With Fire’—As He Ratchets Up Attacks On Russian Leader",
    "description": "President Donald Trump said in a Truth Social post Tuesday morning that if it weren’t for him, “lots of really bad things would have already happened to Russia.”",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/05/27/trump-says-putin-playing-with-fire-as-he-ratchets-up-attacks-on-russian-leader/",
    "timestamp": "2025-05-27T16:07:03Z"
  },
  {
    "title": "Maryland Lawmaker Denied Access to Abrego García During El Salvador Visit",
    "description": "\"If there is nothing to hide, cut the crap,\" said a Maryland congressman late Monday after being denied a visit with his constituent, Kilmar Abrego García, who is being held in a prison in El Salvador after being wrongly expelled by the Trump administration t…",
    "link": "https://www.commondreams.org/news/trump-deporting-to-el-salvador",
    "timestamp": "2025-05-27T16:06:51Z"
  },
  {
    "title": "US Consumers Now More Optimistic, Ending 5 Straight Months Of Decline In Confidence Index",
    "description": "U.S. consumer confidence increased in May after five months of decline, beating economists' expectations.",
    "link": "https://dailycaller.com/2025/05/27/consumers-optimistic-ending-months-decline-confidence-index/",
    "timestamp": "2025-05-27T16:06:01Z"
  },
  {
    "title": "Putin is playing with fire, Trump says",
    "description": "(Reuters) -U.S. President Donald Trump said on Tuesday that Russian President Vladimir Putin was \"playing with fire.\" Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/putin-is-playing-with-fire-trump-says",
    "timestamp": "2025-05-27T16:06:00Z"
  },
  {
    "title": "NPR Uses Conservative Supreme Court Justice's Words Against Donald Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA lawsuit filed Tuesday by National Public Radio (NPR) against the Trump administration quotes words scribed by former conservative U.S. Supreme Court Justice Antonin Scalia nearly 40 years ago.\nWhy It Matters…",
    "link": "https://biztoc.com/x/7d590c9fed6c7494",
    "timestamp": "2025-05-27T16:05:58Z"
  },
  {
    "title": "Zelensky Raises Alarm Over New Russian Offensive: 'Ample Evidence'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThere is \"ample evidence\" that Russia is preparing to mount a fresh offensive in Ukraine, President Volodymyr Zelensky has said, as U.S.-brokered peace talks grind on with few results and U.S. President Donald…",
    "link": "https://biztoc.com/x/fd6046021a61daeb",
    "timestamp": "2025-05-27T16:05:43Z"
  },
  {
    "title": "Japan's Nippon Steel To Acquire US Steel At $55 Per Share: Report",
    "description": "Japan's Nippon Steel is set to finalize its acquisition of U.S. Steel Corp. (NYSE:X) at $55 per share, according to sources familiar with the matter. \nThe Details: President Donald Trump confirmed his approval of the deal on Friday, describing it as a \"partne…",
    "link": "https://biztoc.com/x/c363da1e2e5370d0",
    "timestamp": "2025-05-27T16:05:36Z"
  },
  {
    "title": "Putin Giving 'Shadow Fleet' Warship Escorts: Finland Defense Official",
    "description": "Russia is now \"protecting its shadow fleet\" in the Baltic Sea, Finnish Defense Minister Antti Häkkänen said.",
    "link": "https://www.newsweek.com/putin-shadow-fleet-warships-escorts-finland-2077555",
    "timestamp": "2025-05-27T16:05:33Z"
  },
  {
    "title": "Trump Media Ramps Up Crypto Shadiness With Bitcoin Plans",
    "description": "It looks like Donald Trump is seeking to further cash in on cryptocurrency while he’s president. \r\nThe president’s social media company, Trump Media & Technology Group, announced Tuesday that it plans to sell $1.5 billion in stock and $1 billion in convertibl…",
    "link": "https://newrepublic.com/post/195730/trump-media-crypto-bitcoin",
    "timestamp": "2025-05-27T16:05:15Z"
  },
  {
    "title": "Trump Calls Putin 'Crazy,' Says He's Eyeing Russia Sanctions",
    "description": "President Donald Trump said he was “absolutely” considering new sanctions against Russia as Ukraine said Moscow launched its largest drone barrage of the war during a third night of strikes.\nTrump’s comments, made to reporters in New Jersey on Sunday came as …",
    "link": "https://biztoc.com/x/0c666cc12e92666c",
    "timestamp": "2025-05-27T16:05:14Z"
  },
  {
    "title": "Live updates: NPR and stations file lawsuit against Trump, arguing ending federal funding is illegal (Associated Press)",
    "description": "Associated Press:\nLive updates: NPR and stations file lawsuit against Trump, arguing ending federal funding is illegal  —  Public radio stations are being targeted for cuts by President Donald Trump.  This week, he signed an executive order aimed at slashing …",
    "link": "https://www.memeorandum.com/250527/p61",
    "timestamp": "2025-05-27T16:05:01Z"
  },
  {
    "title": "NPR Uses Conservative Supreme Court Justice's Words Against Donald Trump",
    "description": "Legal counsel for NPR told Newsweek that Trump's executive order targeting NPR and PBS \"is blatantly unconstitutional.\"",
    "link": "https://www.newsweek.com/npr-donald-trump-pbs-lawsuit-scotus-2077484",
    "timestamp": "2025-05-27T16:04:51Z"
  },
  {
    "title": "Court order challenges Trump's plan to move federal student loans to Small Business Administration",
    "description": "A federal judge has blocked the Trump administration's plans to transfer the country's $1.6 trillion student loan portfolio to the SBA.",
    "link": "https://www.cnbc.com/2025/05/27/court-order-challenges-trumps-plans-to-move-student-loans-to-sba.html",
    "timestamp": "2025-05-27T16:04:48Z"
  },
  {
    "title": "Trump uses pardon power to build army of devoted MAGA vigilantes: analyst",
    "description": "President Donald Trump is sending a clear message to law enforcement officers who break the law, conservative analyst Bill Kristol wrote for The Bulwark in an urgent analysis published on Tuesday — you can do whatever you like as long as you're loyal to me.Tr…",
    "link": "https://www.rawstory.com/trump-sheriffs/",
    "timestamp": "2025-05-27T16:02:59Z"
  },
  {
    "title": "Leo Terrell: DOJ Will 'Review All Leads' After Left-Wing Pro-Hamas Praise of D.C. Attack",
    "description": "Leo Terrell, senior counsel at the DOJ, pledged to “review all leads” after a left-wing pro-Hamas influencer praised the murder of two Israeli embassy staffers in Washington, DC.\nThe post Leo Terrell: DOJ Will ‘Review All Leads’ After Left-Wing Pro-Hamas Prai…",
    "link": "https://www.breitbart.com/politics/2025/05/27/leo-terrell-doj-will-review-all-leads-after-left-wing-pro-hamas-praise-d-c-attack/",
    "timestamp": "2025-05-27T16:01:44Z"
  },
  {
    "title": "King Charles Says Canada 'Strong and Free' Following Trump Row with Carney",
    "description": "Delivering the Speech from the Throne, King Charles highlighted Canada's resilience and independence.",
    "link": "https://www.newsweek.com/king-charles-says-canada-strong-free-following-trump-row-carney-2077570",
    "timestamp": "2025-05-27T16:01:34Z"
  },
  {
    "title": "Tesla loses more ground in Europe, while BYD makes gains | TechCrunch",
    "description": "In April, Tesla sold 7,261 vehicles in the European Union, European Free Trade Association, and U.K., a 49% year-over-year decline.",
    "link": "https://techcrunch.com/2025/05/27/tesla-loses-more-ground-in-europe-while-byd-makes-gains/",
    "timestamp": "2025-05-27T16:00:42Z"
  },
  {
    "title": "Student reporters are under pressure to protect sources — and still tell the truth",
    "description": "Last December, Andrew Massie got a text from his roommate: He thought he had story for him. An hour later, Massie, who is a journalist at The Fordham Ram student […]\nThe post Student reporters are under pressure to protect sources — and still tell the truth a…",
    "link": "https://www.poynter.org/reporting-editing/2025/student-journalism-challenges-anonymous-sources-off-record/",
    "timestamp": "2025-05-27T16:00:23Z"
  },
  {
    "title": "How is the new Gaza aid plan supposed to work — and why are so many aid groups against it?",
    "description": "Israel has blocked almost all aid to Gaza for nearly three months.",
    "link": "https://www.bostonherald.com/2025/05/27/gaza-aid-system-explained/",
    "timestamp": "2025-05-27T16:00:02Z"
  },
  {
    "title": "Supreme Court Hands Trump Win in Fight Against Rogue Administrative State",
    "description": "As Americans began to prepare for Memorial Day weekend, the Supreme Court quietly handed President Donald Trump a significant victory in the fight to rein... Read More\nThe post Supreme Court Hands Trump Win in Fight Against Rogue Administrative State appeared…",
    "link": "https://www.dailysignal.com/2025/05/27/supreme-court-hands-trump-win-in-fight-against-rogue-administrative-state/",
    "timestamp": "2025-05-27T16:00:00Z"
  },
  {
    "title": "Joy Behar Resurrects Disputed ‘Suckers And Losers’ Story To Attack Trump Over West Point Speech",
    "description": "\"The View\" co-host Joy Behar resurrected a debunked story on Tuesday about President Donald Trump calling veterans \"suckers and losers.\"",
    "link": "https://dailycaller.com/2025/05/27/the-view-joy-behar-suckers-losers-story-trump/",
    "timestamp": "2025-05-27T15:59:17Z"
  },
  {
    "title": "Zelensky Raises Alarm Over New Russian Offensive: 'Ample Evidence'",
    "description": "\"I've always had a very good relationship with Vladimir Putin of Russia, but something has happened to him,\" said President Trump.",
    "link": "https://www.newsweek.com/zelensky-new-russia-offensive-sumy-kharkiv-donetsk-2077471",
    "timestamp": "2025-05-27T15:59:00Z"
  },
  {
    "title": "4 Things the Middle Class Needs To Do Now To Thrive in the Trump Economy",
    "description": "On the campaign trail in 2024, President Donald Trump made a number of promises to the middle class. He promised that, if elected president for a second term, he would ensure the end of inflation, slash energy and electricity bills, and put a temporary cap on…",
    "link": "https://biztoc.com/x/22d2fc5def63c5b8",
    "timestamp": "2025-05-27T15:54:42Z"
  },
  {
    "title": "Trump post to Putin",
    "description": "Donald J. Trump @realDonaldTrump What Vladimir Putin doesn’t realize is that if it weren’t for me, lots of really bad things would have already happened to Russia, and I mean REALLY BAD. He’s playing with fire! May 27, 2025, 11:44 AM",
    "link": "https://freerepublic.com/focus/f-news/4319347/posts",
    "timestamp": "2025-05-27T15:54:32Z"
  },
  {
    "title": "Trump: Putin playing with fire",
    "description": "United States President Donald Trump remarked on Tuesday that his Russian counterpart Vladimir Putin is \"playing with fire\" regarding the conflict in Ukraine.\"What Vladimir Putin doesn't realize is th...",
    "link": "https://biztoc.com/x/c7589cb9bd686eb2",
    "timestamp": "2025-05-27T15:54:25Z"
  },
  {
    "title": "South Africa denies bending the rules to give Musk’s Starlink preferential treatment",
    "description": "JOHANNESBURG (AP) — South Africa’s minister of communications on Tuesday denied accusations that a draft policy watering down Black ownership requirements for tech firms was not proposed to benefit the Starlink business of white South African-born tech billio…",
    "link": "https://financialpost.com/pmn/south-africa-denies-bending-the-rules-to-give-musks-starlink-preferential-treatment",
    "timestamp": "2025-05-27T15:53:33Z"
  },
  {
    "title": "Lindsey Graham Threatens to Go Over Trump’s Head to Stop Putin",
    "description": "While the Trump administration extends its long leash on Russia, Republicans are running out of rope for dealing with the White House.\r\nIn reaction to a Wall Street Journal editorial note demanding change in America’s negotiating strategy, Senator Lindsey Gra…",
    "link": "https://newrepublic.com/post/195733/lindsey-graham-donald-trump-vladimir-putin-sanctions",
    "timestamp": "2025-05-27T15:53:30Z"
  },
  {
    "title": "Trump Media says investors will fund a company ‘bitcoin reserve’ through share purchases",
    "description": "President Donald Trump’s media company said Tuesday that institutional investors will buy $2.5 billion in the company’s stock with the proceeds going to build up a bitcoin reserve. About 50 institutional investors will put up $1.5 billion in the private place…",
    "link": "https://financialpost.com/pmn/trump-media-says-investors-will-fund-a-company-bitcoin-reserve-through-share-purchases",
    "timestamp": "2025-05-27T15:53:13Z"
  },
  {
    "title": "¿Trump inclinará la carrera de la IA a favor de China?",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/why-china-may-win-the-ai-race-by-qiyuan-xu-and-yaqiang-wang-2025-05/spanish",
    "timestamp": "2025-05-27T15:51:27Z"
  },
  {
    "title": "Will Trump Tip the AI Race in China’s Favor?",
    "description": "If history is any guide, China’s AI capabilities are likely to catch up to – and even surpass – those of the United States. And US President Donald Trump’s trade and immigration policies, along with his administration’s gutting of research spending, could acc…",
    "link": "https://www.project-syndicate.org/commentary/why-china-may-win-the-ai-race-by-qiyuan-xu-and-yaqiang-wang-2025-05",
    "timestamp": "2025-05-27T15:51:27Z"
  },
  {
    "title": "WATCH: South Africa’s Ramaphosa Defends ‘Kill the Boer’: It’s a ‘Liberation Chant’",
    "description": "South African President Cyril Ramaphosa defended the “Kill the Boer” slogan as a “liberation chant” Tuesday, refusing U.S. President Donald Trump’s demand to arrest opposition figure Julius Malema for using it. Last Wednesday, during a meeting in the Oval Off…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319345/posts",
    "timestamp": "2025-05-27T15:51:18Z"
  },
  {
    "title": "Polish Trump Fans Gather To 'Make Poland Great Again'",
    "description": "The crowd, some with signature red hats bearing US President Donald Trump's name, cheered when the man on the stage asked if they were happy that America was becoming great again.",
    "link": "https://www.ibtimes.com.au/polish-trump-fans-gather-make-poland-great-again-1859103",
    "timestamp": "2025-05-27T15:51:17Z"
  },
  {
    "title": "Polish Trump Fans Gather To 'Make Poland Great Again'",
    "description": "The crowd, some with signature red hats bearing US President Donald Trump's name, cheered when the man on the stage asked if they were happy that America was becoming great again.",
    "link": "https://www.ibtimes.com/polish-trump-fans-gather-make-poland-great-again-3774606",
    "timestamp": "2025-05-27T15:51:17Z"
  },
  {
    "title": "Carney Pledges Economic Transformation in Speech Read by King",
    "description": "Prime Minister Mark Carney said he intends to lead Canada to “the largest transformation of its economy since the Second World War,” in a speech delivered by King Charles III to open the new parliamentary session.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-pledges-economic-transformation-in-speech-read-by-king",
    "timestamp": "2025-05-27T15:51:07Z"
  },
  {
    "title": "Trump Media to raise $2.5bn to invest in Bitcoin",
    "description": "Trump Media says the money will be used to create a 'Bitcoin treasury'.",
    "link": "https://www.aljazeera.com/economy/2025/5/27/trump-media-to-raise-2-5bn-to-invest-in-bitcoin",
    "timestamp": "2025-05-27T15:47:14Z"
  },
  {
    "title": "Trump wished happy Memorial Day to 'scum' that spent last 4 years 'trying to destroy our country'",
    "description": "A screenshot shared online in late May 2025 authentically showed a Truth Social post by U.S. President Donald Trump wishing a happy Memorial Day to \"the scum that spent the last four years trying to destroy our country.\"",
    "link": "https://www.snopes.com//fact-check/trump-memorial-day-message/",
    "timestamp": "2025-05-27T15:47:00Z"
  },
  {
    "title": "Trump's 'ultimate foe' obsession plunges US state into 'cloud of chaos': mayor",
    "description": "President Donald Trump is leaving Massachusetts in a “cloud of chaos” as his moves against so-called “woke universities” have wide-reaching effects across the Bay State, according to a Boston Globe Correspondent, Kara Miller\r\n. \n“In epic tales, heroes and vil…",
    "link": "https://www.rawstory.com/trump-v-massachusetts/",
    "timestamp": "2025-05-27T15:46:53Z"
  },
  {
    "title": "Trump's Team Discovers That Diplomacy Is Hard",
    "description": "Diplomacy is better than war in Ukraine, Gaza, and Iran. But that doesn't mean it's easy.",
    "link": "https://reason.com/2025/05/27/trumps-team-discovers-that-diplomacy-is-hard/",
    "timestamp": "2025-05-27T15:43:44Z"
  },
  {
    "title": "Donald Trump Gets Good News from Consumers Amid Tariff Pullbacks",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAfter months of economic anxiety fueled by aggressive trade policies, Americans are starting to feel more optimistic. Consumer confidence rebounded sharply in May, following a string of five consecutive monthl…",
    "link": "https://biztoc.com/x/0305324a3522d5a5",
    "timestamp": "2025-05-27T15:43:22Z"
  },
  {
    "title": "Europe closes higher as US delays EU tariffs",
    "description": "Major stock market indexes in Europe closed higher on Tuesday after United States President Donald Trump decided to delay the introduction of a 50% tariff on the European Union's exports following a c...",
    "link": "https://biztoc.com/x/835574fb4577a1f2",
    "timestamp": "2025-05-27T15:43:21Z"
  },
  {
    "title": "Republican Wants to Loosen Child Labor Laws",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA GOP-led bill introduced in the House of Representatives last week would allow teenagers to work longer and later hours if signed into law by President Donald Trump.\nNewsweek has contacted Representative Dust…",
    "link": "https://biztoc.com/x/407567bf81d5116c",
    "timestamp": "2025-05-27T15:43:17Z"
  },
  {
    "title": "Trump’s NATO doubts rattle allies — but embolden Russia",
    "description": "The United States has long played a leadership role in NATO, the most successful military alliance\r\n in history.The U.S. and 11 other countries in North America and Europe founded NATO\r\n in 1949, following World War II. NATO has since grown its membership to …",
    "link": "https://www.rawstory.com/trumps-nato-doubts-rattle-allies-embolden-russia/",
    "timestamp": "2025-05-27T15:41:40Z"
  },
  {
    "title": "Republican Wants to Loosen Child Labor Laws",
    "description": "A new piece of legislation would allow young teenagers to work later and longer hours.",
    "link": "https://www.newsweek.com/republican-bill-loosen-child-labor-laws-2077479",
    "timestamp": "2025-05-27T15:39:24Z"
  },
  {
    "title": "Tesla’s monthly sales in Europe plunge by half, signaling backlash against Musk runs deep",
    "description": "Meanwhile, sales of gasoline and diesel powered cars slumped.",
    "link": "https://www.bostonherald.com/2025/05/27/tesla-european-sales/",
    "timestamp": "2025-05-27T15:39:19Z"
  },
  {
    "title": "Donald Trump Gets Good News from Consumers Amid Tariff Pullbacks",
    "description": "President Trump's latest moves appear to have eased some of the uncertainty clouding the economic outlook among consumers.",
    "link": "https://www.newsweek.com/donald-trump-gets-good-news-consumers-amid-tariff-pullbacks-2077558",
    "timestamp": "2025-05-27T15:38:40Z"
  },
  {
    "title": "Letters to Editor",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters-to-editor/article69626281.ece",
    "timestamp": "2025-05-27T15:38:27Z"
  },
  {
    "title": "‘Devastating Piece Of Legislation’: Wealthy Universities Fret Over ‘Big, Beautiful’ Bill’s Endowment Tax Proposal",
    "description": "Universities with large endowments are fretting a provision in the \"big, beautiful\" bill that would significantly raise the tax rate on their investment income.",
    "link": "https://dailycaller.com/2025/05/27/universities-fret-endowment-tax-big-beautiful-bill/",
    "timestamp": "2025-05-27T15:38:21Z"
  },
  {
    "title": "Putin rejects Trump's Vatican push as Kremlin accuses him of being 'emotional': envoy Kellogg",
    "description": "Putin rejects Trump's Vatican peace talks proposal for Russia-Ukraine, suggesting Geneva instead. Trump condemns Putin's drone strikes as 'crazy' on social media.",
    "link": "https://www.foxnews.com/world/putin-rejects-trumps-vatican-push-kremlin-accuses-him-being-emotional-envoy-kellogg",
    "timestamp": "2025-05-27T15:36:42Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
    "description": "Indian markets ended lower Tuesday as the Sensex fell 624 points and Nifty declined 175, dragged by profit booking in Financial and IT stocks amid weak global cues and muted FII activity. Mid- and small-cap stocks showed resilience, backed by strong Q4 result…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/121442909.cms",
    "timestamp": "2025-05-27T15:35:27Z"
  },
  {
    "title": "Dem strategy session to stop hemorrhaging of male voters ridiculed",
    "description": "Facing criticism and low favorability, Democrats hold strategy talks to address outreach to male voters and improve their standing after 2024 election setbacks.",
    "link": "https://www.foxnews.com/politics/democrat-strategy-session-stop-hemorrhaging-male-working-class-voters-criticized",
    "timestamp": "2025-05-27T15:34:45Z"
  },
  {
    "title": "Trump Says 'Slow Walking' European Union Changed Their Tune After 50 Per Cent Tariff Threat",
    "description": "Europe rushed to set up meetings with U.S. negotiators after Trump fired a metaphorical shot across the bows.\nThe post Trump Says ‘Slow Walking’ European Union Changed Their Tune After 50 Per Cent Tariff Threat appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/05/27/trump-says-slow-walking-european-union-changed-their-tune-after-50-per-cent-tariff-threat/",
    "timestamp": "2025-05-27T15:34:10Z"
  },
  {
    "title": "Trump Threatens To Revoke $3B in Harvard Grants To Give to Trade Schools",
    "description": "President Donald Trump has threatened to take away $3 billion in federal grants from Harvard University and redirect the money to trade schools, escalating a months-long battle with the Ivy League institution. \"I am considering taking Three Billion Dollars of…",
    "link": "https://freerepublic.com/focus/f-news/4319340/posts",
    "timestamp": "2025-05-27T15:33:53Z"
  },
  {
    "title": "4 Things the Middle Class Needs To Do Now To Thrive in the Trump Economy",
    "description": "The middle class faces new challenges in the Trump economy. Discover 4 essential strategies to protect your finances and build long-term wealth now.",
    "link": "https://finance.yahoo.com/news/4-things-middle-class-needs-153332472.html",
    "timestamp": "2025-05-27T15:33:32Z"
  },
  {
    "title": "Critically Ill Girl Facing Deportation Could Die Within Days If Care Halted",
    "description": "The girl's family wrote in a post on GoFundMe that without treatment, she will die.",
    "link": "https://www.newsweek.com/deysi-vargas-girl-ill-deportation-california-2077528",
    "timestamp": "2025-05-27T15:32:45Z"
  },
  {
    "title": "Trump’s latest tariff reversal offers fresh evidence: He’s bad for business",
    "description": "Those who saw Donald Trump as the “pro-business” candidate in the 2024 race had it backwards. Take his latest tariff whiplash, for example.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-latest-tariff-reversal-offers-fresh-evidence-s-bad-business-rcna209221",
    "timestamp": "2025-05-27T15:31:59Z"
  },
  {
    "title": "Trump accuses EU of dragging its heels on a tariff deal with the US",
    "description": "Fears of trade war reignited as the American president makes veiled threat on his Truth Social platform\nDonald Trump said the EU had been dragging its heels “to put it mildly” on sealing a tariff deal with the US repeating his assessment that his threat of a …",
    "link": "https://biztoc.com/x/4292d8691c4b87ff",
    "timestamp": "2025-05-27T15:31:42Z"
  },
  {
    "title": "How to Watch Elon Musk Unveil SpaceX’s Mars Colonization Roadmap",
    "description": "Musk will discuss progress and next steps toward building a human presence on the Red Planet ahead of Starship’s ninth test flight today.",
    "link": "https://gizmodo.com/how-to-watch-elon-musk-unveil-spacexs-mars-colonization-roadmap-2000607685",
    "timestamp": "2025-05-27T15:30:31Z"
  },
  {
    "title": "Trump steps in as 'cold war' between top Hegseth aides causes Pentagon chaos",
    "description": "A personality clash between two of defense secretary Pete Hegseth's top aides has attracted notice from the White House.The conflict has persisted for months, even after Hegseth purged some political appointees in April, and the tension has resulted in dysfun…",
    "link": "https://www.rawstory.com/pete-hegseth-chaos/",
    "timestamp": "2025-05-27T15:30:21Z"
  },
  {
    "title": "'Common sense, good science': Trump admin ends Covid vaccine recommendation for healthy kids, pregnant women",
    "description": "The Trump administration, guided by Health Secretary Robert F. Kennedy Jr., has removed COVID-19 vaccine recommendations for healthy children and pregnant women from the CDC's schedule. This decision aligns with President Trump's agenda to reduce federal gove…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/common-sense-good-science-trump-admin-ends-covid-vaccine-recommendation-for-healthy-kids-pregnant-women/articleshow/121442656.cms",
    "timestamp": "2025-05-27T15:29:35Z"
  },
  {
    "title": "Tesla sales in Europe plunge 50% amid backlash over Musk and competition from hybrids, Chinese brands",
    "description": "According to new figures from the European Automobile Manufacturers' Association (ACEA), Tesla sold 7,261 cars in Europe in April. That marks a 49% decrease compared to the same month a year earlier when European sales were at 14,228 units. Sales for the Janu…",
    "link": "https://www.techspot.com/news/108069-tesla-sales-europe-plunge-50-amid-backlash-over.html",
    "timestamp": "2025-05-27T15:26:00Z"
  },
  {
    "title": "FBI announces new probes into Dobbs Supreme Court leak, White House cocaine incident",
    "description": "WASHINGTON (Reuters) -The FBI will launch new probes into the 2023 discovery of cocaine at the White House during President Joe Biden's term and the 2022 leak of the Supreme Court's draft opinion overturning Roe v. Wade, a top official announced on Monday. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/05/27/fbi-announces-new-probes-into-dobbs-supreme-court-leak-white-house-cocaine-incident",
    "timestamp": "2025-05-27T15:23:00Z"
  },
  {
    "title": "King Charles III starts delivering historic speech at Canadian Parliament",
    "description": "King Charles III has started delivering a historic speech before the Canadian Parliament that will set out the new legislative priorities in Canada. Charles was delivering the speech on Tuesday. He's the first monarch delivering what’s called the speech from …",
    "link": "https://www.seattlepi.com/entertainment/article/king-charles-to-outline-mark-carney-s-priorities-20346535.php",
    "timestamp": "2025-05-27T15:22:38Z"
  },
  {
    "title": "Supreme Court declines to halt land transfer that would destroy sacred site for Western Apache | CNN Politics",
    "description": "The Supreme Court declined Tuesday to halt a land transfer in Arizona that Western Apache people say will destroy a sacred site in order to mine for copper.",
    "link": "https://www.cnn.com/2025/05/27/politics/western-apache-supreme-court-transfer",
    "timestamp": "2025-05-27T15:22:34Z"
  },
  {
    "title": "Gold slips as Trump delays EU tariffs, Russia-Ukraine conflict escalates, and China’s gold demand surges—what’s next for investors?",
    "description": "Gold prices remain steady but slightly lower this week as calm U.S. and U.K. markets open after holidays. Positive U.S.-EU trade talks and Trump’s tariff delay ease tensions, while rising geopolitical risks from Ukraine and Russia keep gold attractive. China’…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-slips-as-trump-delays-eu-tariffs-russia-ukraine-conflict-escalates-and-chinas-gold-demand-surgeswhats-next-for-investors/articleshow/121440170.cms",
    "timestamp": "2025-05-27T15:21:35Z"
  },
  {
    "title": "Trump administration: ‘We are out of business with Harvard’",
    "description": "Letter confirms removal of last remaining federal subsidies to school's leftism",
    "link": "https://www.wnd.com/2025/05/trump-administration-we-are-out-of-business-with-harvard/",
    "timestamp": "2025-05-27T15:21:06Z"
  },
  {
    "title": "Circle’s IPO Goals Hinge on Becoming Digital Money’s Infrastructure Layer",
    "description": "Each week, the evolution of the ongoing cryptocurrency-FinTech convergence seems to get another headline to hang its hat on. Last week, it was the news Thursday (May 22) that J.P. Morgan Chase, Bank of America, Wells Fargo and Citigroup are exploring the laun…",
    "link": "https://www.pymnts.com/news/ipo/2025/circle-ipo-goals-hinge-becoming-digital-money-infrastructure-layer/",
    "timestamp": "2025-05-27T15:21:01Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting federal funding",
    "description": "National Public Radio on Tuesday sued President Donald Trump over his executive order to cease all federal funding for the nonprofit broadcaster. Trump’s May 1 order violates the First Amendment’s protections of speech and the press and steps on Congress’ aut…",
    "link": "https://freerepublic.com/focus/f-news/4319337/posts",
    "timestamp": "2025-05-27T15:21:00Z"
  },
  {
    "title": "Trump Media slides by 10% on Bitcoin fund news",
    "description": "Trump Media and Technology Group Corp.'s shares slumped by 10% on Tuesday after United States President Donald Trump's enterprise announced the creation of a Bitcoin treasury worth about $2.5 billion....",
    "link": "https://biztoc.com/x/195cc4fcbf5801df",
    "timestamp": "2025-05-27T15:20:47Z"
  },
  {
    "title": "Fed chair calls out Trump’s Harvard attacks during bombshell Princeton speech",
    "description": "Fed chair calls out Trump’s Harvard attacks during bombshell Princeton speech\nIn a decision handed down on Thursday, May 22, the U.S. Supreme Court indicated that President Donald Trump does not have the power to fire U.S. Federal Reserve Chairman Jerome Powe…",
    "link": "https://biztoc.com/x/d2e3383b209ebe5f",
    "timestamp": "2025-05-27T15:20:24Z"
  },
  {
    "title": "Kiev’s actions harming peace process – Kremlin",
    "description": "Spokesman Dmitry Peskov has cited a recent uptick in Ukrainian UAV attacks on Russian territory, echoing a statement by the Defense Ministry Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618212-peskov-kiev-actions-harming-peace-process/",
    "timestamp": "2025-05-27T15:20:04Z"
  },
  {
    "title": "King says Canada will remain 'strong and free' despite facing 'unprecedented' challenges",
    "description": "King Charles says Canada will remain \"strong and free\" - in a speech viewed by many Canadians as a show of support for the country's sovereignty following annexation threats by Donald Trump.",
    "link": "https://news.sky.com/story/king-says-canada-will-remain-strong-and-free-despite-facing-unprecedented-challenges-13375539",
    "timestamp": "2025-05-27T15:20:00Z"
  },
  {
    "title": "ICE Is Waiting Outside Immigration Courtrooms to Fast-Track Deportations",
    "description": "Officers are arresting people after hearings and putting them into expedited proceedings that do not require a judge.",
    "link": "https://capitalandmain.com/ice-detains-people-after-immigration-court-hearings-in-nationwide-operation",
    "timestamp": "2025-05-27T15:18:06Z"
  },
  {
    "title": "I Studied iPhone Prices Going Back to 2007. Tariff or Not, We're Due for a Price Hike",
    "description": "Commentary: The math, not the tariffs and politics, leads me to predict a higher price for the iPhone 17 this year.",
    "link": "https://www.cnet.com/tech/mobile/i-studied-iphone-prices-going-back-to-2007-tariff-or-not-were-due-for-a-price-hike/",
    "timestamp": "2025-05-27T15:18:00Z"
  },
  {
    "title": "DJT shares fall 10% as Trump Media says it's raising $2.5 billion to buy bitcoin",
    "description": "The Trump Media announcement comes as bitcoin nears record highs and the Bitcoin 2025 conference gets underway in Las Vegas.",
    "link": "https://www.cnbc.com/2025/05/27/djt-trump-media-bitcoin.html",
    "timestamp": "2025-05-27T15:17:51Z"
  },
  {
    "title": "Jamie Dimon warned Trump’s agenda would push U.S. allies toward China—Greenland already says it may ‘look elsewhere’ for mining investment",
    "description": "JPMorgan Chase boss warned Trump’s foreign agenda may push America's allies away—and Greenland has hinted this may already be the case.",
    "link": "https://www.yahoo.com/news/jamie-dimon-warned-trump-agenda-151747805.html",
    "timestamp": "2025-05-27T15:17:47Z"
  },
  {
    "title": "iPhone buyers worldwide may see higher prices because of Trump's tariffs",
    "description": "Every iPhone buyer in the world may get hit with the side-effects of President Donald Trump's tariffs, as Apple may choose to hike prices everywhere to keep profit margins up.Morgan Stanley says the iPhone 16 Pro would cost 35% more if it were made in the US …",
    "link": "https://appleinsider.com/articles/25/05/27/iphone-buyers-worldwide-may-see-higher-prices-because-of-trumps-tariffs",
    "timestamp": "2025-05-27T15:17:36Z"
  },
  {
    "title": "NPR Sues Donald Trump For “Textbook Retaliation” Over Executive Order Cutting Federal Funding",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0a75d835-9825-41c2-91a2-22b4151a7aee",
    "timestamp": "2025-05-27T15:16:46Z"
  },
  {
    "title": "’60 Minutes’ correspondent ripped as ‘fraud’ and ‘liar’ for anti-Trump commencement speech",
    "description": "Conservative social media users criticized CBS News correspondent Scott Pelley for his anti-Trump commencement speech at Wake Forest University last week.",
    "link": "https://www.foxnews.com/media/60-minutes-correspondent-ripped-fraud-liar-anti-trump-commencement-speech",
    "timestamp": "2025-05-27T15:16:33Z"
  },
  {
    "title": "Trump Throws Wild New Wrench in EU Tariff Talks",
    "description": "Donald Trump announced Tuesday he was perfectly content to levy massive tariffs on goods from the European Union, while his economic advisers maintained that a lower rate is likely to stay in place no matter what. \r\nIn a post on Truth Social, Trump wrote that…",
    "link": "https://newrepublic.com/post/195731/donald-trump-new-wrench-european-union-tariffs",
    "timestamp": "2025-05-27T15:16:10Z"
  },
  {
    "title": "Trump pardons former Virginia sheriff convicted of fraud and bribery - The Guardian",
    "description": "Trump pardons former Virginia sheriff convicted of fraud and briberyThe Guardian President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and briberyBBC Trump pardons former Virginia sheriff convicted of taking $75K in bribesFox…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177811423",
    "timestamp": "2025-05-27T15:15:21Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting funding for public broadcasting",
    "description": "NPR sued President Donald Trump over his executive order cutting federal funding for NPR and PBS. The suit, filed in a Washington, DC federal court by NPR and public radio stations in Colorado, claims that Trump’s effort to slash the broadcasters’ congression…",
    "link": "https://www.theverge.com/news/674754/npr-lawsuit-trump-executive-order-cutting-funding-pbs",
    "timestamp": "2025-05-27T15:15:21Z"
  },
  {
    "title": "Trump pardons former Virginia sheriff convicted of bribery, fraud (Sabrina Malhi/Washington Post)",
    "description": "Sabrina Malhi / Washington Post:\nTrump pardons former Virginia sheriff convicted of bribery, fraud  —  Former sheriff Scott Jenkins was found guilty of accepting more than $75,000 in bribes.  —  President Donald Trump announced on Monday his pardon of former …",
    "link": "https://www.memeorandum.com/250527/p50",
    "timestamp": "2025-05-27T15:15:00Z"
  },
  {
    "title": "Another Indefensible Trump Pardon (The Bulwark)",
    "description": "The Bulwark:\nAnother Indefensible Trump Pardon  —  The president's use of the power, which he deployed again over the weekend, is legal.  It's also a grave threat to the rule of law.  —  Not even Donald Trump's own White House staff can keep track of what his…",
    "link": "https://www.memeorandum.com/250527/p49",
    "timestamp": "2025-05-27T15:15:00Z"
  },
  {
    "title": "‘Not Normal’: Dems Say Their Party Members ‘Have Begun To Speak Like Professors’",
    "description": "Democrats are arguing that members of their party need to reconsider their use of left-wing words to better connect with voters, The Washington Post reported.",
    "link": "https://dailycaller.com/2025/05/27/dems-tell-members-ditch-not-normal-left-wing-language/",
    "timestamp": "2025-05-27T15:11:26Z"
  }
]