[
  {
    "title": "ABC Viewers Slam Jimmy Kimmel as he Says Trump Is Ordering ICE to 'Kill You'",
    "description": "Jimmy Kimmel drew backlash online after a monologue in which he accused President Donald Trump of enabling deadly force through U.S. Immigration and Customs Enforcement. In a segment aired on Wednesday, Kimmel referenced the recent fatal shooting of a 37-year…",
    "link": "https://freerepublic.com/focus/f-news/4361460/posts",
    "timestamp": "2026-01-10T23:46:51Z"
  },
  {
    "title": "More than 500 people protest Trump, ICE and America's involvement in Venezuela",
    "description": "More than 500 people protest Trump, ICE and America's involvement in Venezuelainforum.com",
    "link": "https://www.inforum.com/news/fargo/500-plus-pack-bridge-to-protest-trump-ice-and-americas-involvement-in-venezue",
    "timestamp": "2026-01-10T23:45:00Z"
  },
  {
    "title": "US and allies launches large-scale strikes on Islamic State in Syria after attack that killed 3 Americans",
    "description": "Military says it targeted the jihadist group throughout Syria in response to attack on US and Syrian troops in Palmyra.",
    "link": "https://indianexpress.com/article/world/us-and-allies-launches-large-scale-strikes-on-islamic-state-in-syria-10466648/",
    "timestamp": "2026-01-10T23:36:31Z"
  },
  {
    "title": "John Harbaugh reportedly not planning to interview for certain head coach openings",
    "description": "John Harbaugh reportedly plans to meet with only three or four NFL teams despite eight head coaching vacancies, as President Donald Trump endorses him for the New York Giants job.",
    "link": "https://www.foxnews.com/sports/john-harbaugh-reportedly-not-planning-interview-certain-head-coach-openings",
    "timestamp": "2026-01-10T23:36:22Z"
  },
  {
    "title": "U.S. launches new retaliatory strikes against ISIS in Syria after deadly ambush",
    "description": "Saturday’s strikes are part of a part of Trump’s response to the deadly ISIS attack that killed Sgt. Edgar Brian Torres-Tovar, Sgt. William Nathaniel Howard, and Ayad Mansoor Sakat last month.",
    "link": "https://fortune.com/2026/01/10/u-s-launches-new-retaliatory-strikes-against-isis-in-syria-after-deadly-ambush/",
    "timestamp": "2026-01-10T23:34:54Z"
  },
  {
    "title": "Renee Nicole Good’s Award-Winning Poem: Read in Full (It’s awful, Jim)",
    "description": "Renee Nicole Good, a 37-year-old Minneapolis poet, wife and mother, was shot and killed Wednesday by an Immigration and Customs Enforcement (ICE) officer, setting off nationwide protests over the officer’s actions and the Trump administration’s immigration en…",
    "link": "https://freerepublic.com/focus/f-news/4361458/posts",
    "timestamp": "2026-01-10T23:33:31Z"
  },
  {
    "title": "US, coalition launch major strikes on ISIS across Syria",
    "description": "CENTCOM announces that US and partner forces carried out major strikes on ISIS across Syria under Operation Hawkeye Strike.",
    "link": "https://www.israelnationalnews.com/news/420698",
    "timestamp": "2026-01-10T23:25:07Z"
  },
  {
    "title": "ICE quoting white separatist ethno-nationalist song lyrics in recruiting materials",
    "description": "Wearing a black cowboy hat and a bandana covering most of his face, “Odin,” a soft-spoken Proud Boys member, was getting choked up. He stood on a flatbed truck in Sacramento last November outside the state Capitol building, its colonnades a vibrant cream behi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/ice-quoting-white-separatist-ethno-nationalist-song-lyrics-in-recruiting-materials",
    "timestamp": "2026-01-10T23:24:14Z"
  },
  {
    "title": "Montrealers rally in support of Iranian people amid anti-regime protests, internet blackout in Iran",
    "description": "Iranian Montrealers rallied in the downtown core Saturday afternoon in a show of support for the people of Iran. Over the past two weeks, the country has been rocked by massive protests that began over Iran's ailing economy and continue to be fueled by anger …",
    "link": "https://www.cbc.ca/news/canada/montreal/montreal-community-protest-iran-solidarity-9.7041072",
    "timestamp": "2026-01-10T23:13:15Z"
  },
  {
    "title": "Maren Morris Slams 'Dicey' Country Music Industry: 'No One Is Very Friendly'",
    "description": "Country music star Maren Morris is coming to her own defense as a woman in a male-dominated industry. “The choices I have made over the years, being a woman in music, especially country music, over the years, is very calculated,” Morris, 35, said in a video s…",
    "link": "https://www.usmagazine.com/celebrity-news/news/maren-morris-reveals-why-she-stepped-away-from-heated-country-music/#article",
    "timestamp": "2026-01-10T23:13:12Z"
  },
  {
    "title": "Steve Bannon Reportedly ‘Laying the Groundwork’ for Presidential Run in 2028",
    "description": "Steve Bannon is reportedly preparing to run for president in 2028 by setting up a PAC and talking \"with allies to see who might work for him.\"\nThe post Steve Bannon Reportedly ‘Laying the Groundwork’ for Presidential Run in 2028 first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/steve-bannon-reportedly-laying-the-groundwork-for-presidential-run-in-2028/",
    "timestamp": "2026-01-10T23:12:56Z"
  },
  {
    "title": "Slow-moving prisoner releases in Venezuela enter 3rd day",
    "description": "Venezuela’s government has pledged to free a significant number of prisoners.",
    "link": "https://abcnews.go.com/International/wireStory/slow-moving-prisoner-releases-venezuela-enter-3rd-day-129092386",
    "timestamp": "2026-01-10T23:11:28Z"
  },
  {
    "title": "Sorry, Mr. President – Nobel Committee Says Prizes Cannot Be ‘Revoked, Shared, or Transferred’",
    "description": "A Nobel Peace Prize cannot be \"revoked, shared, or transferred\" to someone else, the Nobel Prize Committee announced Friday. The statement was an apparent response to Venezuelan opposition leader Maria Corina Machado's desire to share her own Peace Prize with…",
    "link": "https://www.thewrap.com/media-platforms/politics/nobel-prize-committee-prizes-not-shared-machado-trump/",
    "timestamp": "2026-01-10T23:10:45Z"
  },
  {
    "title": "President Trump Offers NY Giants Coaching Search Advice That His Biggest Haters Would Agree With",
    "description": "In a very random post on Saturday, President Donald Trump urged the New York Giants to make a specific person […]",
    "link": "https://sportsnaut.com/nfl/giants-coach-search-trump-harbaugh",
    "timestamp": "2026-01-10T23:10:36Z"
  },
  {
    "title": "Anti-ICE protesters assemble across the US after shootings in Minneapolis and Portland, Oregon",
    "description": "MINNEAPOLIS (AP) — Thousands of people marched in Minneapolis Saturday to protest the fatal shooting of a woman by a federal immigration officer there and the shooting of<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/anti-ice-protesters-assemble-acr…",
    "link": "https://whdh.com/news/anti-ice-protesters-assemble-across-the-us-after-shootings-in-minneapolis-and-portland-oregon/",
    "timestamp": "2026-01-10T23:08:37Z"
  },
  {
    "title": "Protesters gather at Providence City Hall to oppose U.S. military action in Venezuela",
    "description": "A demonstration was held in Providence Saturday to protest against the U.S. military's activity in Venezuela.",
    "link": "https://turnto10.com/news/local/protesters-gather-at-providence-city-hall-to-oppose-us-military-action-in-venezuela",
    "timestamp": "2026-01-10T23:06:10Z"
  },
  {
    "title": "Jim Mellon Says Venezuela's Oil Recovery Is 5+ Years Away, But US Refiners Could Benefit: 'I'd Suggest Loading Up On Oil And Gas'",
    "description": "Billionaire investor Jim Mellon said that Venezuela’s oil industry faces a long and difficult road to recovery, with meaningful production gains unlikely to ...",
    "link": "https://finance.yahoo.com/news/jim-mellon-says-venezuelas-oil-230212952.html",
    "timestamp": "2026-01-10T23:02:12Z"
  },
  {
    "title": "Dave Matthews Scorches 'Revolting' Trump Officials And Masked ICE 'Thugs’: ‘‘F**k Them’",
    "description": "\"If that language offends you … Come on. We all heard it before,\" the singer said.",
    "link": "https://www.huffpost.com/entry/dave-matthews-trump-ice-shootin_n_6962c277e4b0068b9689394a",
    "timestamp": "2026-01-10T23:02:10Z"
  },
  {
    "title": "US could lift additional sanctions on Venezuela next week to facilitate oil sales",
    "description": "Bessent said late on Friday that almost $5 billion worth of Venezuela's currently frozen IMF Special Drawing Rights monetary assets could be deployed to help rebuild the country's economy.",
    "link": "https://nypost.com/2026/01/10/world-news/us-could-lift-additional-sanctions-on-venezuela-next-week-to-facilitate-oil-sales/",
    "timestamp": "2026-01-10T23:01:41Z"
  },
  {
    "title": "Portland top cop confirms Tren de Aragua ties of people who attacked Border Patrol agents, then CRIES and APOLOGIZES to Latinos for 'victim blaming'",
    "description": "Portland Police Chief Bob Day became emotional Friday as he confirmed new information showing that two people shot by a US Customs and Border Protection agent in Portland who allegedly tried to run over the officials with their car have ties to the Venezuelan…",
    "link": "https://freerepublic.com/focus/f-chat/4361453/posts",
    "timestamp": "2026-01-10T23:00:34Z"
  },
  {
    "title": "Nobel Institute says Peace Prize cannot be transferred after Machado suggestion (Jarrett Renshaw/Reuters)",
    "description": "Jarrett Renshaw / Reuters:\nNobel Institute says Peace Prize cannot be transferred after Machado suggestion  —  The Norwegian Nobel Institute said the Nobel Peace Prize cannot be transferred, shared, or revoked, following remarks by Venezuelan opposition leade…",
    "link": "https://www.memeorandum.com/260110/p46",
    "timestamp": "2026-01-10T23:00:29Z"
  },
  {
    "title": "Roar of a paper tiger?",
    "description": "Despite its tough exterior, the Trump administration is hollowing out in domestic support while it continues to weaken an already diminished Western alliance. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/behind-the-headlines/2026/01/11/roar-of-a--paper-tiger",
    "timestamp": "2026-01-10T23:00:00Z"
  },
  {
    "title": "Malaysia vs Proximate Imperialism",
    "description": "The old world order is dead; Malaysia and Asean need to make bold foreign policy choices to shape the new one. Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/all-the-pieces-matter/2026/01/11/malaysia-vs-proximate-imperialism",
    "timestamp": "2026-01-10T23:00:00Z"
  },
  {
    "title": "Trump and Epstein Sittin’ in a Tree",
    "description": "Move along, there’s nothing else to see Note: Many thanks to Peter Secosh for much of this information. He has helped me immensely with his incomparable research skills. Our Congress, which is noted for honestly representing the interests of the general, unwa…",
    "link": "https://www.activistpost.com/trump-and-epstein-sittin-in-a-tree/",
    "timestamp": "2026-01-10T23:00:00Z"
  },
  {
    "title": "Somali state senator tells ICE to ‘get the hell out' of Oregon",
    "description": "Somali-born Oregon state Senate senator Kayse Jama criticized federal immigration enforcement officers Thursday night following a federal agent’s shooting of two people in Portland, telling them they were not welcome in the community. Speaking at a news confe…",
    "link": "https://freerepublic.com/focus/f-chat/4361451/posts",
    "timestamp": "2026-01-10T22:56:24Z"
  },
  {
    "title": "U.S. Launches Large-Scale Strikes Against ISIS In Syria After Deadly Ambush",
    "description": "The United States launched another round of strikes against the Islamic State in Syria following an ambush last month that killed two soldiers and a civilian interpreter.",
    "link": "https://www.huffpost.com/entry/us-strikes-syria-isis_n_6962d60de4b013d88e4e5a8a",
    "timestamp": "2026-01-10T22:50:39Z"
  },
  {
    "title": "Thousands march against Renee Good's killing as hundreds of protests planned across US",
    "description": "The demonstration in Minneapolis was one of hundreds of protests planned in towns and cities across the US over the weekend, demanding an end to large-scale deployments of ICE agents.",
    "link": "https://news.sky.com/story/thousands-march-against-renee-goods-killing-as-hundreds-of-protests-planned-across-us-13492955",
    "timestamp": "2026-01-10T22:46:00Z"
  },
  {
    "title": "Maduro loyalists stage modest rally as Venezuelan govt courts US",
    "description": "Supporters of Venezuela’s deposed leader Nicolas Maduro staged protests Saturday, a week after his dramatic capture by US forces, but only hundreds turned out to demand his release as the interim government moved to revive ties with Washington. Waving flags a…",
    "link": "https://www.digitaljournal.com/world/maduro-loyalists-stage-modest-rally-as-venezuelan-govt-courts-us/article",
    "timestamp": "2026-01-10T22:42:20Z"
  },
  {
    "title": "Cory Doctorow explains how legalising reverse engineer would end enshitification",
    "description": "'Donald Trump’s tariffs have opened up a new possibility for the technology we have become increasingly dependent on. Today, nearly all of our tech comes from US companies, and it arrives as a prix fixe meal. If you want to talk with your friends on a Meta pl…",
    "link": "https://slashdot.org/submission/17343914/cory-doctorow-explains-how-legalising-reverse-engineer-would-end-enshitification",
    "timestamp": "2026-01-10T22:41:07Z"
  },
  {
    "title": "U.S. launches new retaliatory strikes against ISIS in Syria after deadly ambush",
    "description": "The U.S. has launched another round of retaliatory strikes against the Islamic State in Syria following last month’s ambush that killed two U.S. soldiers and one American civilian interpreter in the country. The large-scale strikes, conducted by the U.S. alon…",
    "link": "https://japantoday.com/category/world/us-launches-new-retaliatory-strikes-against-isis-in-syria-after-deadly-ambush",
    "timestamp": "2026-01-10T22:41:00Z"
  },
  {
    "title": "Nicaragua frees dozens of prisoners amid pressure from Trump administration",
    "description": "Opposition groups say release triggered by 'political chess moves' following US abduction of Venezuela's Nicolas Maduro.",
    "link": "https://www.aljazeera.com/news/2026/1/10/nicaragua-frees-dozens-of-prisoners-amid-pressure-from-trump-administration",
    "timestamp": "2026-01-10T22:40:36Z"
  },
  {
    "title": "Trump Tariffs Allowed To Stand For Now, But Polymarket Traders Predict Only 25% Chance Of SCOTUS Approval",
    "description": "The U.S. Supreme Court did not issue a ruling Friday on President Donald Trump’s sweeping global tariffs, as traders price in a 75% chance that the Supreme...",
    "link": "https://finance.yahoo.com/news/trump-tariffs-allowed-stand-now-223245417.html",
    "timestamp": "2026-01-10T22:32:45Z"
  },
  {
    "title": "CNN Host Trounces Trump For 'Declaring Himself King Of The World' Like In 'Titanic'",
    "description": "Abby Phillip cited President Donald Trump's “brazen” capture of now-ousted Venezuelan leader Nicolás Maduro and his plans to take over Greenland.",
    "link": "https://www.huffpost.com/entry/abby-phillip-trounces-trump-king-of-the-world-titanic_n_6962a35ce4b08ce691f81b28",
    "timestamp": "2026-01-10T22:31:53Z"
  },
  {
    "title": "트럼프의 중간선거와 지정학적 긴장",
    "description": "The president's longtime trade adviser, Peter Navarro, discusses tariffs, doing business with Beijing, and the Supreme Court case that could define his legacy with Mishal Husain in this weekend's interview. Read more: https://t.co/x9ct0G30Gx️: Bonnie Cash/B…",
    "link": "https://ryueyes11.tistory.com/512042",
    "timestamp": "2026-01-10T22:28:55Z"
  },
  {
    "title": "‘Never relent’: Trump administration strikes ISIS targets in Syria",
    "description": "'Part of our ongoing commitment to root out Islamic terrorism'",
    "link": "https://www.wnd.com/2026/01/never-relent-trump-administration-strikes-isis-targets-syria/",
    "timestamp": "2026-01-10T22:26:20Z"
  },
  {
    "title": "Rallies across US against shooting of woman by ICE agent",
    "description": "Thousands of demonstrators chanting the name of the woman killed by a federal agent in Minneapolis took to the city's streets today, amid widespread anger at use of force in the Trump administration's immigration crackdown.",
    "link": "https://www.rte.ie/news/us/2026/0110/1552475-rallies-us-ice/",
    "timestamp": "2026-01-10T22:25:16Z"
  },
  {
    "title": "Armed Iran protesters battle police in Tehran streets as Trump warns of forceful US response",
    "description": "Iran protests turn more violent with 65 reportedly killed by Friday and over 2,300 arrested as authorities imposed an internet blackout amid nationwide anti-regime unrest.",
    "link": "https://www.foxnews.com/world/armed-iran-protesters-battle-police-tehran-streets-trump-warns-forceful-us-response",
    "timestamp": "2026-01-10T22:18:37Z"
  },
  {
    "title": "Trump Administration Launches ‘Large-Scale’ Military Strikes Against ISIS in Syria: ‘We Will Find You and Kill You’",
    "description": "The U.S. military conducted a \"large-scale\" strike against ISIS in Syria on Saturday after President Trump vowed \"serious retaliation\" for an attack last month\nThe post Trump Administration Launches ‘Large-Scale’ Military Strikes Against ISIS in Syria: ‘We Wi…",
    "link": "https://www.mediaite.com/politics/trump-administration-launches-large-scale-military-strikes-against-isis-in-syria-we-will-find-you-and-kill-you/",
    "timestamp": "2026-01-10T22:17:16Z"
  },
  {
    "title": "The end is near for Iran’s mullahs",
    "description": "As a wave of protests swept across Iran last night, the internet was completely shut down. I have no idea what is happening to my friends, my family, or anyone else. My best friend Champ was at the demonstration.",
    "link": "https://nypost.com/2026/01/10/opinion/the-end-is-near-for-irans-mullahs/",
    "timestamp": "2026-01-10T22:12:23Z"
  },
  {
    "title": "Justice Barrett, Trump v. Slaughter, and Presidential Removal Power from 1969 to 1989",
    "description": "Humphrey's Executor from 1969 to 1989.",
    "link": "https://reason.com/volokh/2026/01/11/justice-barrett-trump-v-slaughter-and-presidential-removal-power-from-1969-to-1989/",
    "timestamp": "2026-01-10T22:08:12Z"
  },
  {
    "title": "Iran protests grow despite regime crackdown",
    "description": "Anti- government protesters have flooded the streets of the Iranian capital for a third night as Donald Trump repeats his support for the movement. Reza Pahlavi, the US-based son of Iran's ousted shah, has called for nationwide strikes as authorities signal i…",
    "link": "https://www.bbc.co.uk/programmes/w172zssj5hjpk48",
    "timestamp": "2026-01-10T22:07:00Z"
  },
  {
    "title": "Mark Ruffalo Teases Political Future: 'People in America Are Suffering'",
    "description": "Actor Mark Ruffalo, known for his political activism, is not ruling out the possibility of one day running for office. “It isn’t on my game card right now, but who knows. I mean, you never say never,” Ruffalo, 58, exclusively told Us Weekly on Friday, January…",
    "link": "https://www.usmagazine.com/celebrity-news/news/mark-ruffalo-teases-political-future-people-in-america-are-suffering/#article",
    "timestamp": "2026-01-10T22:06:55Z"
  },
  {
    "title": "Claim: A US Takeover of Greenland Would Deny Access to Climate Scientists",
    "description": "I can't recall the USA ever stopping foreign scientists from visiting, but apparently that will be a thing in the future.",
    "link": "https://wattsupwiththat.com/2026/01/10/claim-a-us-takeover-of-greenland-would-deny-access-to-climate-scientists/",
    "timestamp": "2026-01-10T22:00:00Z"
  },
  {
    "title": "Put Trump on the ballot in 2026",
    "description": "President 'has proven himself a master at wagging the dog’s tail, leading the media wherever he wants, forcing them to cover what he says at his rallies'",
    "link": "https://www.wnd.com/2026/01/put-trump-ballot-2026/",
    "timestamp": "2026-01-10T21:59:55Z"
  },
  {
    "title": "‘American? No!’ says Greenland after latest Trump threat",
    "description": "Greenland’s political parties said they did not want to be under Washington as US President Donald Trump again suggested using force to seize the mineral-rich Danish autonomous territory, raising concern worldwide. The statement late Friday came after Trump r…",
    "link": "https://www.digitaljournal.com/world/american-no-says-greenland-after-latest-trump-threat/article",
    "timestamp": "2026-01-10T21:58:15Z"
  },
  {
    "title": "Trump urges John Harbaugh to take the Giants head coaching job following stunning Ravens firing",
    "description": "President Donald Trump said the New York Giants should \"without question\" hire former Baltimore Ravens coach John Harbaugh, adding that the 63-year-old should take the job.",
    "link": "https://www.foxnews.com/sports/trump-urges-john-harbaugh-take-giants-head-coaching-job-following-stunning-ravens-firing",
    "timestamp": "2026-01-10T21:53:01Z"
  },
  {
    "title": "How a GOP Rep is working with Trump to ban large investors from buying single-family homes",
    "description": "Housing issues could become cornerstone of Republicans' affordability agenda",
    "link": "https://www.wnd.com/2026/01/how-gop-rep-is-working-trump-ban-large/",
    "timestamp": "2026-01-10T21:52:43Z"
  },
  {
    "title": "‘Never Relent’: Trump Admin Strikes ISIS Targets In Syria",
    "description": "The Department of War (DOW) carried out airstrikes against ISIS targets in Syria, U.S. Central Command (CENTCOM) announced Saturday afternoon.",
    "link": "https://dailycaller.com/2026/01/10/donald-trump-pete-hegseth-war-department-strikes-isis-targets-syria/",
    "timestamp": "2026-01-10T21:50:31Z"
  },
  {
    "title": "Dozens feared dead as Iran hit by largest protests in years",
    "description": "Separate mobile-camera footage from Fardis, a city about 31 miles west of Tehran, showed at least seven bodies covered in blood inside a building.",
    "link": "https://www.bostonherald.com/2026/01/10/dozens-feared-dead-as-iran-hit-by-largest-protests-in-years/",
    "timestamp": "2026-01-10T21:47:39Z"
  },
  {
    "title": "ICE, immigration officials have shot at people at least 16 times in Trump second term",
    "description": "Renee Nicole Good, who was shot and killed by an Immigration and Customs Enforcement agent in Minneapolis on Jan. 7, was at least the 15th person fired upon by immigration officials in President Donald Trump's second term. Now, a shooting in Portland, Oregon,…",
    "link": "https://freerepublic.com/focus/f-news/4361436/posts",
    "timestamp": "2026-01-10T21:44:20Z"
  },
  {
    "title": "President Donald Trump implores New York Giants to hire John Harbaugh",
    "description": "President Donald Trump says the New York Giants should hire John Harbaugh as their next head coach \"without question.\"",
    "link": "https://giantswire.usatoday.com/story/sports/nfl/giants/2026/01/10/president-donald-trump-implores-new-york-giants-hire-john-harbaugh/88121375007/",
    "timestamp": "2026-01-10T21:40:22Z"
  },
  {
    "title": "Protests in Iran reach the 2-week mark as authorities intensify crackdown on demonstrators",
    "description": "\"Iran is looking at FREEDOM, perhaps like never before,\" U.S. President Donald Trump said on social media. \"The USA stands ready to help!!!\"",
    "link": "https://richmond.com/news/nation-world/government-politics/article_3659bb80-be87-5e3f-b57e-8c9306a9b76d.html",
    "timestamp": "2026-01-10T21:40:00Z"
  },
  {
    "title": "US announces ‘large-scale’ strikes against IS in Syria",
    "description": "US and allied forces carried out large-scale strikes against the Islamic State (IS) group in Syria in response to an attack that killed three Americans.\n\nRead More: https://punchng.com/us-announces-large-scale-strikes-against-is-in-syria/",
    "link": "https://punchng.com/?p=2032690",
    "timestamp": "2026-01-10T21:37:55Z"
  },
  {
    "title": "Trump answers on whether he'd order a mission to capture Putin",
    "description": "President Donald Trump pushed back on suggestions from Ukrainian President Volodymyr Zelenskyy that the United States could capture Russian President Vladimir Putin after Zelensky pointed to Washington’s recent action against Venezuelan dictator Nicolás Madur…",
    "link": "https://freerepublic.com/focus/f-news/4361433/posts",
    "timestamp": "2026-01-10T21:33:22Z"
  },
  {
    "title": "U.S. launches large-scale strikes on ISIS targets across Syria",
    "description": "The U.S. has carried out what it called “large-scale strikes” against ISIS in Syria, U.S.",
    "link": "https://www.nbcnews.com/world/syria/us-strikes-isis-in-syria-rcna253353",
    "timestamp": "2026-01-10T21:29:09Z"
  },
  {
    "title": "Protests against ICE spread across U.S. after shootings in Minneapolis and Portland",
    "description": "Thousands of people marched in Minneapolis Saturday to protest the fatal shooting of a woman by a federal immigration officer there and the shooting of two people in Portland, Oregon. It was was one of hundreds of protests planned in towns and cities across t…",
    "link": "https://www.pbs.org/newshour/nation/protests-against-ice-spread-across-u-s-after-shootings-in-minneapolis-and-portland",
    "timestamp": "2026-01-10T21:28:50Z"
  },
  {
    "title": "US announces 'large-scale' strikes against IS in Syria",
    "description": "US and allied forces carried out \"large-scale\" strikes against the Islamic State jihadist group in Syria today, the US military said, in the latest response to an attack last month that left three Americans dead.",
    "link": "https://www.rte.ie/news/world/2026/0110/1552474-us-strikes-syria/",
    "timestamp": "2026-01-10T21:27:02Z"
  },
  {
    "title": "Trump signs executive order meant to protect the money from Venezuelan oil",
    "description": "President Donald Trump’s new executive order on Venezuelan oil revenue is meant to ensure that the money remains protected from being used in judicial proceedings. The executive order, made public on Saturday, says that if the funds were to be seized for such…",
    "link": "https://japantoday.com/category/world/trump-signs-executive-order-meant-to-protect-the-money-from-venezuelan-oil",
    "timestamp": "2026-01-10T21:22:57Z"
  },
  {
    "title": "After fatal ICE shooting, Minneapolis mayor tells protesters to avoid Trump's 'bait'",
    "description": "Minneapolis Mayor Jacob Frey on Saturday urged demonstrators protesting the fatal shooting of a motorist by a U.S. immigration agent to stay peaceful, saying that any unlawful actions would play into U.S. President Donald Trump's hands. Frey, a Democrat, ‌cau…",
    "link": "https://japantoday.com/category/world/after-fatal-ice-shooting-minneapolis-mayor-tells-protesters-to-avoid-trump%27s-%27bait%27",
    "timestamp": "2026-01-10T21:22:48Z"
  },
  {
    "title": "Iran authorities signal intensified crackdown as unrest grows",
    "description": "Iran's authorities indicated on Saturday they could intensify their crackdown on the biggest anti-government demonstrations in years, with the Revolutionary Guards blaming unrest on terrorists and vowing to safeguard the governing system. U.S. President Donal…",
    "link": "https://japantoday.com/category/world/iran-authorities-signal-intensified-crackdown-as-unrest-grows3",
    "timestamp": "2026-01-10T21:22:42Z"
  },
  {
    "title": "Bitcoin mining difficulty falls in first adjustment of 2026",
    "description": "The relative difficulty in mining blocks on the Bitcoin network fell in January 2026, the first Bitcoin difficulty adjustment of the new year.",
    "link": "https://cointelegraph.com/news/bitcoin-difficulty-falls-first-adjustment-2026",
    "timestamp": "2026-01-10T21:22:20Z"
  },
  {
    "title": "US military strikes Islamic State group targets in Syria, officials say",
    "description": "US President Donald Trump ordered \"large-scale strikes\" on Islamic State group targets in Syria on Saturday, US Central Command announced.",
    "link": "https://www.bbc.co.uk/news/articles/cly9597r4qpo",
    "timestamp": "2026-01-10T21:19:59Z"
  },
  {
    "title": "How the fatal Minneapolis ICE shooting unfolded",
    "description": "Renee Nicole Good’s final moments were spent in her maroon Honda Pilot, her son’s stuffed animals peeking out from the glove compartment. She had stopped in the middle of a tree-lined south Minneapolis street and motioned for unmarked government vehicles to d…",
    "link": "https://www.cnn.com/2026/01/10/us/ice-shooting-minneapolis-renee-good",
    "timestamp": "2026-01-10T21:15:41Z"
  },
  {
    "title": "Federal judge blocks Trump Admin. orders aimed at vote-by-mail in Washington, Oregon",
    "description": "On Friday, a federal judge blocked President Donald Trump's administration from enforcing executive orders",
    "link": "https://komonews.com/news/politics/federal-judge-blocks-trump-admin-orders-aimed-at-vote-by-mail-in-washington-oregon-washington-state-attorney-general-nick-brown-election",
    "timestamp": "2026-01-10T21:14:58Z"
  },
  {
    "title": "Anti-ICE Protesters Assemble Across U.S. After Shootings In Minneapolis And Portland",
    "description": "Minneapolis is on edge since the killing of Renee Good on Wednesday by an Immigration and Customs Enforcement officer.",
    "link": "https://www.huffpost.com/entry/anti-ice-protests-across-us-minneapolis-portland_n_6962bd15e4b08ce691f81c84",
    "timestamp": "2026-01-10T21:12:48Z"
  },
  {
    "title": "US military strikes Islamic State group targets in Syria, officials say",
    "description": "US President Donald Trump ordered \"large-scale strikes\" on ISIS targets in Syria on Saturday, US Central Command announced.",
    "link": "https://www.bbc.com/news/articles/cly9597r4qpo",
    "timestamp": "2026-01-10T21:12:44Z"
  },
  {
    "title": "Can Maduro’s defense team pull off the unthinkable?",
    "description": "Argument based on alleged international law violations could fall apart",
    "link": "https://www.wnd.com/2026/01/can-maduros-defense-team-pull-unthinkable/",
    "timestamp": "2026-01-10T21:08:47Z"
  },
  {
    "title": "Trump pushes a 1-year, 10% cap on credit card interest rates and banks balk",
    "description": "Trump pushes a 1-year, 10% cap on credit card interest rates and banks balklocal10.com",
    "link": "https://www.local10.com//business/2026/01/10/trump-pushes-a-1-year-10-cap-on-credit-card-interest-rates-and-banks-balk/",
    "timestamp": "2026-01-10T21:05:15Z"
  },
  {
    "title": "Protests in Iran reach 2-week mark as authorities intensify crackdown on demonstrators",
    "description": "Tehran escalated its threats Saturday, with the Iran's attorney general, Mohammad Movahedi Azad, warning that anyone taking part in protests will be considered an \"enemy of God,\" a death-penalty charge.",
    "link": "https://www.pbs.org/newshour/world/protests-in-iran-reach-2-week-mark-as-authorities-intensify-crackdown-on-demonstrators",
    "timestamp": "2026-01-10T21:03:40Z"
  },
  {
    "title": "Trump order says Venezuelan oil revenue is being held by the U.S. for ‘governmental and diplomatic purposes’ and not subject to private claims",
    "description": "The executive order says that if the funds were to be seized for such use, it could “undermine critical U.S. efforts to ensure economic and political stability in Venezuela.”",
    "link": "https://fortune.com/2026/01/10/trump-order-venezuelan-oil-revenue-us-governmental-diplomatic-purposes-court-proceedings-private-claims/",
    "timestamp": "2026-01-10T21:01:36Z"
  },
  {
    "title": "Leftist Group Dodges Accountability for ‘Hate Group’ Accusation After Judge Blocks Discovery",
    "description": "A federal judge dismissed a conservative nonprofit’s defamation lawsuit against the Southern Poverty Law Center Wednesday, reversing a previous judge’s theory of the case. Critics... Read More\nThe post Leftist Group Dodges Accountability for ‘Hate Group’ Accu…",
    "link": "https://www.dailysignal.com/2026/01/10/splc-leftist-group-dodges-accountability-hate-group-accusation-after-judge-blocks-discovery/",
    "timestamp": "2026-01-10T21:01:00Z"
  },
  {
    "title": "Bill Gates-backed ‘Cowboy Chernobyl’ nuclear reactor races toward approval in Wyoming",
    "description": "A Bill Gates-backed nuclear reactor dubbed “Cowboy Chernobyl” by critics is nearing approval in Wyoming as regulators accelerate reviews under a Trump-era order, alarming residents and nuclear safety experts worried about containment and waste risks.",
    "link": "https://nypost.com/2026/01/10/us-news/bill-gates-backed-reactor-pushed-fast-in-wyoming-critics-warn/",
    "timestamp": "2026-01-10T21:00:01Z"
  },
  {
    "title": "Ticker: Trump signs executive order meant to protect the money from Venezuelan oil",
    "description": "President Donald Trump’s new executive order on Venezuelan oil revenue is meant to ensure that the money remains protected from being used in judicial proceedings.",
    "link": "https://www.bostonherald.com/2026/01/10/ticker-trump-signs-executive-order-meant-to-protect-the-money-from-venezuelan-oil/",
    "timestamp": "2026-01-10T20:59:02Z"
  },
  {
    "title": "\"Stupidest Detail Of All Time\" — People Just Noticed The Pin On Donald Trump's Suit, And They Can't Stop Cringing",
    "description": "We are living in an episode of Veep.View Entire Post ›",
    "link": "https://www.buzzfeed.com/michaelabramwell/donald-trump-viral-pin",
    "timestamp": "2026-01-10T20:58:22Z"
  },
  {
    "title": "People Just Noticed The Pin Donald Trump Wore On His Suit During A White House Meeting, And They Can't Stop Cringing",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_411b659a-5419-48f3-8b6c-a9107439ce0b",
    "timestamp": "2026-01-10T20:58:22Z"
  },
  {
    "title": "Trump signs executive order meant to protect the money from Venezuelan oil",
    "description": "Trump signs executive order meant to protect the money from Venezuelan oillocal10.com",
    "link": "https://www.local10.com//business/2026/01/10/trump-signs-executive-order-meant-to-protect-the-money-from-venezuelan-oil/",
    "timestamp": "2026-01-10T20:55:42Z"
  },
  {
    "title": "U.S. cities brace for anti-ICE protests this weekend after Minneapolis shooting",
    "description": "Organizers say more than 1,000 protests against the Trump administration’s immigration agenda are expected to take place in cities across the country this weekend, following the fatal shooting of a woman in Minneapolis by an Immigration and Customs Enforcemen…",
    "link": "https://www.nbcnews.com/news/us-news/anti-ice-protests-rcna253336",
    "timestamp": "2026-01-10T20:50:25Z"
  },
  {
    "title": "New Details: PA official's meeting with Trump Peace Council chairman",
    "description": "A meeting took place at Hussein al-Sheikh's office with Nikolay Mladenov ahead of establishing a Gaza Peace Council under the Trump plan.",
    "link": "https://www.israelnationalnews.com/news/420694",
    "timestamp": "2026-01-10T20:49:07Z"
  },
  {
    "title": "'It's another kind of slavery': Greenland residents fume over Trump's six-figure bribes as he tries to seize their island",
    "description": "Longtime Greenlanders have told the Daily Mail they are furious with President Donald Trump for once again floating the possibility of taking over their country. Trump revived talk about the United States asserting formal control over Greenland on Sunday, one…",
    "link": "https://freerepublic.com/focus/f-news/4361426/posts",
    "timestamp": "2026-01-10T20:46:53Z"
  },
  {
    "title": "If Trump takes control of Greenland, he would have to build a welfare state ‘that he doesn’t want for his own citizens,’ expert says",
    "description": "Greenlanders currently have Danish citizenship and access to the Danish welfare system, including free health care and schooling.",
    "link": "https://fortune.com/2026/01/10/trump-greenland-denmark-social-benefits-welfare-state/",
    "timestamp": "2026-01-10T20:45:38Z"
  },
  {
    "title": "Ted Cruz Reacts To Renee Good's Killing By ICE, And It's A Doozy",
    "description": "Texas Sen. Ted Cruz gargled Donald Trump's balls as he blamed Renee Nicole Good's murder on the left, and his reaction is revealing of the talking points we're hearing from the right. \nInterestingly, this is the same Ted Cruz who has repeatedly described Capi…",
    "link": "https://crooksandliars.com/2026/01/ted-cruz-reacts-renee-goods-killing-ice",
    "timestamp": "2026-01-10T20:42:07Z"
  },
  {
    "title": "Trump's DHS hit with brutal 'reminder' after 'embarrassing' statement on hurting cops",
    "description": "Political experts and observers alike hit Donald Trump's Department of Homeland Security with brutal corrections on Saturday, after the agency released what some called an \"embarrassing\" statement about violence against police officers.It started ahead of the…",
    "link": "https://www.rawstory.com/trump-dhs-2674872101/",
    "timestamp": "2026-01-10T20:42:01Z"
  },
  {
    "title": "Trump's Hold On The Male Youth Vote Is Crumbling Fast",
    "description": "President Donald Trump’s grip on young men is slipping—and fast.\nOnce a natural draw for this crucial voting bloc that helped fuel his 2024 victory, the president is now facing growing distrust and frustration, according to a new poll from the Speaking with A…",
    "link": "https://crooksandliars.com/2026/01/trumps-hold-male-youth-vote-crumbling-fast",
    "timestamp": "2026-01-10T20:41:24Z"
  },
  {
    "title": "US used powerful mystery weapon that brought Venezuelan soldiers to their knees during Maduro raid: witness account",
    "description": "WASHINGTON — The US used a powerful mystery weapon that brought Venezuelan soldiers to their knees, “bleeding through the nose” and vomiting blood during the daring raid to capture dictator Nicolas Maduro, according to a witness account posted Saturday on X b…",
    "link": "https://freerepublic.com/focus/f-news/4361424/posts",
    "timestamp": "2026-01-10T20:40:27Z"
  },
  {
    "title": "‘What we call corruption’: Harvard economist and former Venezuelan minister says Trump’s oil profit motives have no place in Venezuela’s future",
    "description": "President Donald Trump has assured the people of Venezuela that his undertaking to restore the country’s oil infrastructure will be mutually beneficial to both them and the U.S. Ricardo Hausmann, professor of the practice of international political economy at…",
    "link": "https://freerepublic.com/focus/f-news/4361423/posts",
    "timestamp": "2026-01-10T20:38:43Z"
  },
  {
    "title": "Exclusive-US may lift more Venezuela sanctions next week, Bessent says",
    "description": "By David LawderSAVAGE, Minnesota, Jan 10 (Reuters) - U.S. Treasury Secretary Scott Bessent has told Reuters that additional U.S. sanctions on Venezuela could be lifted as… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/10/exclusive-us-may-lift-more-venezuela-sanctions-next-week-bessent-says",
    "timestamp": "2026-01-10T20:34:14Z"
  },
  {
    "title": "Fact-Checking Trump’s Justifications for the Venezuela Operation - The New York Times",
    "description": "Fact-Checking Trump’s Justifications for the Venezuela OperationThe New York Times Trump Is Not Playing Five-Dimensional Chess in VenezuelaThe Atlantic In Donald Trump’s world, the strong take what they canThe Economist Trump’s credibility problem on Venezuel…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180560422",
    "timestamp": "2026-01-10T20:32:44Z"
  },
  {
    "title": "Trump seeks to stop courts, creditors from seizing Venezuelan oil revenue in the U.S.",
    "description": "Any use of judicial process against the funds will interfere with efforts to \"ensure economic and political stability in Venezuela,\" the order says.",
    "link": "https://www.cnbc.com/2026/01/10/trump-venezuela-oil-revenue.html",
    "timestamp": "2026-01-10T20:32:41Z"
  },
  {
    "title": "Left-wing reporter facing congressional subpoena after doxxing Delta Force commander",
    "description": "Included officer's 1st, last name and the fact he has a wife, 5 daughters",
    "link": "https://www.wnd.com/2026/01/left-wing-reporter-facing-congressional-subpoena-after-doxxing/",
    "timestamp": "2026-01-10T20:30:41Z"
  }
]