[
  {
    "title": "EU Gets 15% US Tariff For Cars, But Fails To Get Wine Reprieve",
    "description": "The US and EU released details of a trade deal Thursday that foresees lower car tariffs but no relief for Europe's wine sector, but Brussels said it would push for further concessions.",
    "link": "https://www.ibtimes.com.au/eu-gets-15-us-tariff-cars-fails-get-wine-reprieve-1860198",
    "timestamp": "2025-08-21T19:42:12Z"
  },
  {
    "title": "Trump Crows About Election Change He Believes Will Win GOP a ‘Hundred Seats’ in 2026",
    "description": "\"That's the only way. I say we'd pick up a hundred seats if you had real elections, meaning you go to the voters. I think I would have won California.\"\nThe post Trump Crows About Election Change He Believes Will Win GOP a ‘Hundred Seats’ in 2026 first appeare…",
    "link": "https://www.mediaite.com/media/news/trump-crows-about-election-change-he-believes-will-win-gop-a-hundred-seats-in-2026/",
    "timestamp": "2025-08-21T19:40:40Z"
  },
  {
    "title": "Alina Habba, Trump’s former personal lawyer, is not legally serving as the acting US attorney for New Jersey, judge rules",
    "description": "A federal judge on Thursday said President Donald Trump’s former personal lawyer Alina Habba is not legally serving as the acting US attorney for New Jersey, laying the groundwork for a potential appellate court review of the Trump administration’s method for…",
    "link": "https://www.cnn.com/2025/08/21/politics/alina-habba-new-jersey-us-attorney-ruling",
    "timestamp": "2025-08-21T19:39:49Z"
  },
  {
    "title": "Judge rules Alina Habba was unlawfully appointed as US Attorney in New Jersey",
    "description": "WASHINGTON (Reuters) -A U.S. judge on Thursday sided with two New Jersey criminal defendants who sought to block a former personal lawyer to President Donald...",
    "link": "https://www.yahoo.com/news/articles/judge-rules-alina-habba-unlawfully-193930474.html",
    "timestamp": "2025-08-21T19:39:30Z"
  },
  {
    "title": "Here's What Happened Today: Thursday",
    "description": "Teenager charged with Ian Walsh’s murder, garda suspended following man’s death in Dublin, and 15% tariff rate agreed for pharma sector",
    "link": "https://www.thejournal.ie/news-fix-thursday-august-3-6796317-Aug2025/",
    "timestamp": "2025-08-21T19:38:38Z"
  },
  {
    "title": "Federal judge rules Trump appointee Alina Habba is unlawfully serving as US attorney",
    "description": "A judge found that Alina Habba was unlawfully serving in the role of acting U.S. attorney of New Jersey after President Donald Trump sidestepped typical processes to keep her in charge.",
    "link": "https://www.foxnews.com/politics/federal-judge-rules-trump-appointee-alina-habba-unlawfully-serving-us-attorney",
    "timestamp": "2025-08-21T19:38:14Z"
  },
  {
    "title": "Trump administration reviewing all 55M people with US visas for potential deportable violations",
    "description": "The State Department said Thursday that it’s reviewing the records of more than 55 million foreigners who hold valid U.S. visas for potential revocation or deportable violations of immigration rules. In a written answer to a question posed by The Associated P…",
    "link": "https://freerepublic.com/focus/f-news/4335950/posts",
    "timestamp": "2025-08-21T19:37:15Z"
  },
  {
    "title": "Trump signs exec order creating National Design Studio",
    "description": "US President Donald Trump signed an executive order on Thursday creating a new National Design Studio and the role of a new Chief Design Officer.\"The Chief Design Officer will help recruit top creativ...",
    "link": "https://biztoc.com/x/0b9bb8f455fc1f2d",
    "timestamp": "2025-08-21T19:36:35Z"
  },
  {
    "title": "Trump Orders Smithsonian To Display Exhibit Of Old Cracker Barrel Logo",
    "description": "https://babylonbee.com/news/trump-orders-smithsonian-to-display-exhibit-of-old-cracker-barrel-logoWASHINGTON, D.C. — As part of his comprehensive overhaul of America's national museums, President Donald Trump ordered the Smithsonian to display an exhibit of t…",
    "link": "https://freerepublic.com/focus/f-chat/4335949/posts",
    "timestamp": "2025-08-21T19:36:30Z"
  },
  {
    "title": "Major Russian attack on western Ukraine US-factory despite push for peace",
    "description": "KYIV: Russia launched a rare drone and missile attack on western Ukraine overnight, officials said Thursday (Aug 21), striking targets including a US-owned electronics plant and injecting further uncertainty into the effort",
    "link": "https://www.channelnewsasia.com/world/major-russian-attack-western-ukraine-us-factory-despite-push-peace-5307611",
    "timestamp": "2025-08-21T19:35:36Z"
  },
  {
    "title": "Trump signs executive order creating role of chief design officer",
    "description": "U.S. President Donald Trump on Thursday signed an executive order to establish a National Design Studio and create the role of a chief design officer to help improve the \"usability and aesthetics\" of Federal digital and physical services.The studio will advis…",
    "link": "https://www.channelnewsasia.com/business/trump-signs-executive-order-creating-role-chief-design-officer-5307721",
    "timestamp": "2025-08-21T19:34:09Z"
  },
  {
    "title": "Trump to appoint Airbnb co-founder Gebbia to remake government websites",
    "description": "U.S. President Donald Trump will appoint Airbnb co-founder Joe Gebbia to lead a team charged with remaking the government’s digital services, according to two officials familiar with the matter, as part of his goal to transform federal agencies in the name of…",
    "link": "https://www.channelnewsasia.com/business/trump-appoint-airbnb-co-founder-gebbia-remake-government-websites-5307721",
    "timestamp": "2025-08-21T19:34:09Z"
  },
  {
    "title": "The US and EU release a bare-bones account of their trade deal, but it’s a work in progress - AP News",
    "description": "The US and EU release a bare-bones account of their trade deal, but it’s a work in progressAP News Trump Live Updates: U.S. and E.U. Agree on Details of Trade DealThe New York Times U.S. and EU spell out tariffs for autos, pharmaceuticals and moreCNBC Donald …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178811616",
    "timestamp": "2025-08-21T19:33:27Z"
  },
  {
    "title": "Groups urge US colleges to end campus surveillance to protect protesters",
    "description": "A coalition of more than 30 privacy and civil rights groups is calling on U.S. universities to dismantle campus surveillance and data collection in order to protect student protesters from government retaliation",
    "link": "https://abcnews.go.com/Politics/wireStory/privacy-civil-rights-groups-urge-us-colleges-end-124858085",
    "timestamp": "2025-08-21T19:33:05Z"
  },
  {
    "title": "Putin to visit India by year’s end – Moscow",
    "description": "The Russian president received Indian Foreign Minister S. Jaishankar at the Kremlin on Thursday Read Full Article at RT.com",
    "link": "https://www.rt.com/india/623384-putin-visit-india/",
    "timestamp": "2025-08-21T19:32:50Z"
  },
  {
    "title": "Trump: 'I Will Save California!'",
    "description": "\"Gavin Newscum is way down in the polls. He is viewed as the man who is destroying the once Great State of California. I will save California!!!\nThe post Trump: ‘I Will Save California!’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/21/trump-i-will-save-california/",
    "timestamp": "2025-08-21T19:32:37Z"
  },
  {
    "title": "Two Recent In Custody Deaths Increase Scrutiny Over San Diego Jails",
    "description": "San Diego County is facing a class action lawsuit over conditions in the jail system.",
    "link": "https://www.kqed.org/news/12053105/two-recent-in-custody-deaths-increase-scrutiny-over-san-diego-jails",
    "timestamp": "2025-08-21T19:32:18Z"
  },
  {
    "title": "Donald Trump Now a Serious Nobel Peace Prize Bet",
    "description": "Alfred Nobel meant for the Peace Prize to go to those who actually end wars – not those who merely wax poetic about peaceWhen Rwandan and Congolese leaders signed a peace treaty at the White House on June 27, it addressed one of the bloodiest conflicts of the…",
    "link": "https://freerepublic.com/focus/f-news/4335947/posts",
    "timestamp": "2025-08-21T19:30:43Z"
  },
  {
    "title": "What's it like with the National Guard on the streets of DC?",
    "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'> Follow Trump100 on your podcast app  </a>",
    "link": "https://news.sky.com/story/whats-it-like-with-the-national-guard-on-the-streets-of-dc-13415882",
    "timestamp": "2025-08-21T19:29:00Z"
  },
  {
    "title": "Texas is gerrymandering the only LGBTQ+ member of Congress from the South out of her seat",
    "description": "Texas Republicans' redrawn congressional maps will split up the district of the only out LGBTQ+ representative from the South.",
    "link": "https://www.advocate.com/politics/texas-gerrymanding-lgbtq-julie-johnson",
    "timestamp": "2025-08-21T19:28:30Z"
  },
  {
    "title": "Are Gas Prices Falling Because U.S. Oil Production Is Surging?",
    "description": "Gas prices are falling in 2025, but is surging U.S. oil production under Trump the reason? A closer look at supply, demand, and global forces tells a different story.",
    "link": "https://www.forbes.com/sites/rrapier/2025/08/21/are-gas-prices-falling-because-us-oil-production-is-surging/",
    "timestamp": "2025-08-21T19:28:15Z"
  },
  {
    "title": "Melania Trump 'peace letter' to Putin hailed by Usha Vance, who calls her a 'trailblazer'",
    "description": "Usha Vance called Melania Trump a \"role model\" on Thursday for caring about children's welfare, referencing Mrs. Trump's letter to Vladimir Putin about protecting future generations globally.",
    "link": "https://www.foxnews.com/lifestyle/melania-trump-peace-letter-putin-hailed-usha-vance-calls-her-trailblazer",
    "timestamp": "2025-08-21T19:27:30Z"
  },
  {
    "title": "Apple CEO Tim Cook Featured in Latest South Park Episode",
    "description": "Popular cartoon series South Park has been satirizing U.S. President Donald Trump, and the latest episode, titled \"Sickofancy,\" includes Apple CEO Tim Cook.\n\n\n\n\n\nA cartoon version of Cook is depicted visiting Trump in the White House to provide him with a gif…",
    "link": "https://www.macrumors.com/2025/08/21/apple-ceo-tim-cook-south-park/",
    "timestamp": "2025-08-21T19:27:18Z"
  },
  {
    "title": "Trump Confidante Doesn't Think Pregnant Women Should Have Government Jobs",
    "description": "\"Is there not a man who is qualified?” she asked.",
    "link": "https://www.huffpost.com/entry/donald-trump-pregnant-women-careers_n_68a74bbde4b07d3afdf14ccd",
    "timestamp": "2025-08-21T19:25:43Z"
  },
  {
    "title": "The U.S. cut off a medical lifeline for Gazan children — and Laura Loomer may be to blame",
    "description": "Chris Hayes details far-right influencer Laura Loomer's influence on staffing and policy inside the Trump White House, after the U.S. paused a Gaza visa program.",
    "link": "https://www.msnbc.com/top-stories/latest/laura-loomer-gaza-children-trump-marco-rubio-rcna226345",
    "timestamp": "2025-08-21T19:25:12Z"
  },
  {
    "title": "Live updates: Special session starts with competing proposals to fix shortfall in Colorado budget",
    "description": "The Colorado legislature gaveled in Thursday for its latest special session to fix a budget gap caused by federal tax changes. Here are the latest updates.",
    "link": "https://www.denverpost.com/2025/08/21/legislature-special-session-budget-ai-wolves/",
    "timestamp": "2025-08-21T19:24:54Z"
  },
  {
    "title": "Exclusive: Trump Initiates Deportations for 86,000 Illegal Aliens Left in Limbo by Biden Administration",
    "description": "USCIS has initiated deportation proceedings of tens of thousands of illegal aliens who had previously been left in legal limbo.\nThe post Exclusive: Trump Initiates Deportations for 86,000 Illegal Aliens Left in Limbo by Biden Administration appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/08/21/exclusive-trump-initiates-deportations-for-86000-illegal-aliens-left-in-limbo-by-biden-administration/",
    "timestamp": "2025-08-21T19:24:44Z"
  },
  {
    "title": "Trump and Carney Talk About Trade, Agree to Speak Again Soon",
    "description": "US President Donald Trump and Canadian Prime Minister Mark Carney had a “wide-ranging conversation” Thursday that included trade and the war in Ukraine, according to Carney’s office.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-and-carney-talk-about-trade-agree-to-speak-again-soon",
    "timestamp": "2025-08-21T19:24:20Z"
  },
  {
    "title": "The Cure for Trump Derangement Syndrome? Success!",
    "description": "At this point in his second term, President Donald Trump has higher approval ratings than Presidents George W. Bush and Barack Obama in their second terms. According to the RealClear Politics average of presidential approval polls, Trump, on Aug. 13, 2025, ha…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335946/posts",
    "timestamp": "2025-08-21T19:24:05Z"
  },
  {
    "title": "Tesla faces U.S. auto safety probe over faulty crash reporting",
    "description": "Tesla sells electric vehicles equipped with a standard Autopilot system, or premium Full Self-Driving Supervised option, which is also known as FSD, in the U.S.",
    "link": "https://www.cnbc.com/2025/08/21/tesla-musk-safety-probe-crash-report.html",
    "timestamp": "2025-08-21T19:22:17Z"
  },
  {
    "title": "Nicolle Wallace: Joe Rogan refuses to ‘buy the BS’ Epstein excuses peddled by Trump",
    "description": "Podcast host Joe Rogan has continued to hammer Donald Trump and his administration over their handling of the Jeffrey Epstein case.",
    "link": "https://www.msnbc.com/top-stories/latest/joe-rogan-hammers-trump-jeffrey-epstein-rcna226387",
    "timestamp": "2025-08-21T19:21:43Z"
  },
  {
    "title": "Trump administration reviewing all 55M people with US visas for deportable violations",
    "description": "It's looking for things such as visa overstays, criminal activity, threats to public safety, engaging in terrorist activity or providing support to a terrorist organization.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_a5a6ce6c-8f43-55cf-9128-805fca8f4d56.html",
    "timestamp": "2025-08-21T19:17:00Z"
  },
  {
    "title": "D.C. Democrats Are Furious At Trump For Stopping All The Homicides",
    "description": "Democrats in Washington, D.C., are furious — not because violent crime was spiraling out of control, but because President Donald Trump did something to stop it. A new Washington Post-Schar School poll found that roughly 8 in 10 D.C. residents oppose Trump’s …",
    "link": "https://thefederalist.com/2025/08/21/d-c-democrats-are-furious-at-trump-for-stopping-all-the-homicides/",
    "timestamp": "2025-08-21T19:16:49Z"
  },
  {
    "title": "On Trump Civil Fraud Decision, Both Sides Claim a Win",
    "description": "President Donald Trump is off the hook of paying the nearly half-billion-dollar fine imposed following a decision in a 2023 civil fraud case in New York. At the same time, the state’s attorney general, Letitia James, is touting an appeals court’s decision to …",
    "link": "http://commercialobserver.com/2025/08/trump-civil-fraud-fine-tossed-appeals-court/",
    "timestamp": "2025-08-21T19:14:57Z"
  },
  {
    "title": "Stock Is Falling Thursday: What's Driving The Action?",
    "description": "First Solar Inc (NASDAQ:FSLR) shares are trading lower Thursday afternoon, caught in a downdraft affecting the entire renewable energy sector. Here’s what investors need to know.\nWhat To Know: According to a report from CNBC, the decline was triggered by comm…",
    "link": "https://biztoc.com/x/bf212a061afdc3a1",
    "timestamp": "2025-08-21T19:14:34Z"
  },
  {
    "title": "Privacy and civil rights groups urge US colleges to end campus surveillance to protect protesters",
    "description": "The demands come as Trump has pressed schools to take a harder line on demonstrations.",
    "link": "https://www.bostonherald.com/2025/08/21/campus-protests-rights-groups/",
    "timestamp": "2025-08-21T19:13:47Z"
  },
  {
    "title": "Vance touts Trump’s tax bill, takes a shot at local Dem senator during Georgia trip",
    "description": "Vice President JD Vance visits Peachtree City, Georgia to promote Trump's tax bill while targeting opponents ahead of 2026 midterm elections.",
    "link": "https://www.foxnews.com/politics/vance-touts-trumps-tax-bill-takes-shot-local-dem-senator-during-georgia-trip",
    "timestamp": "2025-08-21T19:12:01Z"
  },
  {
    "title": "FanDuel Will Soon Allow Stock Betting—As Line Between Wall Street And Sportsbooks Blurs",
    "description": "The popular sports betting app will soon host event-based contracts linked to oil and gas prices, gold, the S&P 500 and more.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/08/21/fanduel-will-soon-allow-stock-betting-as-line-between-wall-street-and-sportsbooks-blurs/",
    "timestamp": "2025-08-21T19:11:58Z"
  },
  {
    "title": "Top Trump DOJ Official Deletes Photo of Him Meeting With Colleague — Who Appears to Be a Jan. 6 Rioter Who Urged to ‘Kill’ Cops",
    "description": "The DOJ's Ed Martin posted to social media -- then deleted -- a photo of himself and a colleague who was also a Jan. 6 defendant.\nThe post Top Trump DOJ Official Deletes Photo of Him Meeting With Colleague — Who Appears to Be a Jan. 6 Rioter Who Urged to ‘Kil…",
    "link": "https://www.mediaite.com/media/news/top-trump-doj-official-deletes-photo-of-him-meeting-with-colleague-who-appears-to-be-a-jan-6-rioter-who-urged-to-kill-cops/",
    "timestamp": "2025-08-21T19:11:39Z"
  },
  {
    "title": "‘America First’ Does Not Mean ‘America Everywhere’",
    "description": "It’s time for Europe and the United States to accept how different they actually are.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/europe-transatlanticism-vance-trump-america-first/683949/",
    "timestamp": "2025-08-21T19:10:10Z"
  },
  {
    "title": "Hungary Howls as Ukraine Strikes Key Pipeline",
    "description": "Ukraine has struck the Druzhba pipeline carrying Russian oil to Hungary and Slovakia, even as widening attacks indicating the war is spreading to the Eurasian landmass. “The Druzhba oil pipeline is taking a rest,” crowed Robert “Magyar” Brovdi, Ukraine’s dron…",
    "link": "https://freerepublic.com/focus/f-news/4335941/posts",
    "timestamp": "2025-08-21T19:07:02Z"
  },
  {
    "title": "Trump Administration Reviewing All 55M People With U.S. Visas For Potential Deportable Violations",
    "description": "The Trump administration says it’s reviewing all the more than 55 million people with U.S. visas for potential deportable violations.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-deportations-us-visas-deportable-violations_n_68a76d66e4b03a473eb1c9e8",
    "timestamp": "2025-08-21T19:06:06Z"
  },
  {
    "title": "Data: Number of Canadians Returning by Car from U.S. Drops Nearly 37 Percent",
    "description": "The number of Canadians making return journeys from the United States has dropped significantly, according to recent data.\nThe post Data: Number of Canadians Returning by Car from U.S. Drops Nearly 37 Percent appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/08/21/data-number-of-canadians-returning-via-car-from-u-s-drops-nearly-37-percent/",
    "timestamp": "2025-08-21T19:05:49Z"
  },
  {
    "title": "Trump Announces He Will Personally Patrol DC",
    "description": "President Trump announced on Thursday that he will be hitting the DC streets with the police and national guard tonight.",
    "link": "https://dailycaller.com/2025/08/21/donald-trump-personally-patrol-washington-dc-crime/",
    "timestamp": "2025-08-21T19:05:39Z"
  },
  {
    "title": "New Sheriff in Town! Trump to Join National Guard Patrolling D.C.",
    "description": "Donald Trump’s authoritarian takeover is looking more and more like a senseless stunt made for television.While speaking to conservative radio host Todd Starnes Thursday, Trump claimed that he planned to do a ride-along with law enforcement in Washington, D.C…",
    "link": "https://newrepublic.com/post/199415/donald-trump-join-national-guard-patrol-washington-dc",
    "timestamp": "2025-08-21T19:05:26Z"
  },
  {
    "title": "Trump administration reviewing all 55M people with US visas for potential deportable violations",
    "description": "The State Department said it was looking for indicators of ineligibility such as overstays or criminal activity.",
    "link": "https://www.denverpost.com/2025/08/21/trump-visa-reviews/",
    "timestamp": "2025-08-21T19:03:30Z"
  },
  {
    "title": "Bernie Sanders and Donald Trump form an unlikely alliance over billions in chipmaker subsidies",
    "description": "U.S. Sen. Bernie Sanders (I-Vt.) has been a longtime political enemy of President Donald Trump. However, in a political plot twist, Sanders, considered a progressive, has lined up behind his foe’s plan to turn multibillion-dollar semiconductor subsidies into …",
    "link": "https://biztoc.com/x/5ad1624e05662c0f",
    "timestamp": "2025-08-21T19:03:20Z"
  },
  {
    "title": "California redistricting special election plan cuts Texas, GOP states from language",
    "description": "California's Democratic leaders are now moving forward with an effort to change Congressional district maps so that they heavily favor Democrats, regardless of what Texas or other Republican states do.",
    "link": "https://www.kcra.com/article/california-redistricting-aca-8-removes-texas/65863424",
    "timestamp": "2025-08-21T19:03:16Z"
  },
  {
    "title": "Trump Might Sell Out Taiwan—Here’s How to Prevent It",
    "description": "Taipei needs to spend more on defense and invest more in the U.S.",
    "link": "http://foreignpolicy.com/2025/08/21/trump-taiwan-sellout-china-xi-jinping-ukraine-war/",
    "timestamp": "2025-08-21T19:02:33Z"
  },
  {
    "title": "No, Tariffs Can't Replace Income Taxes",
    "description": "Tariffs are not a realistic tax base. They're among the worst taxes imaginable—narrow, arbitrary, unstable, and regressive.",
    "link": "https://reason.com/2025/08/21/no-tariffs-cant-replace-income-taxes/",
    "timestamp": "2025-08-21T19:02:13Z"
  },
  {
    "title": "Eric Adams aide faces corruption charges amid New York City mayoral race",
    "description": "Former adviser Ingrid Lewis-Martin faces new indictments as pressure on Mayor Eric Adams grows during election season.",
    "link": "https://www.aljazeera.com/news/2025/8/21/eric-adams-aide-faces-corruption-charges-amid-new-york-city-mayoral-race",
    "timestamp": "2025-08-21T19:01:24Z"
  },
  {
    "title": "Carville demands Dems ‘kick the s--- out of’ JD Vance over 'Martha's Vineyard of England vacation",
    "description": "James Carville blasted JD Vance for stumping for Trump's $3.3 trillion legislation and taking a vacation to England's wealthy Oxfordshire region.",
    "link": "https://www.foxnews.com/media/carville-demands-dems-kick-s-out-of-jd-vance-over-marthas-vineyard-england-vacation",
    "timestamp": "2025-08-21T19:00:05Z"
  },
  {
    "title": "Crypto Can Coexist With Banks, Federal Reserve Governor Says",
    "description": "US Federal Reserve Governor Christopher Waller told an audience in Wyoming that crypto transactions should not be treated as something foreign or alarming. Related Reading: Yuan-Pegged Stablecoins On The Horizon As Beijing Rethinks Policy Speaking at the Wyom…",
    "link": "https://bitcoinist.com/crypto-can-coexist-with-banks-federal-reserve-governor-says/",
    "timestamp": "2025-08-21T19:00:04Z"
  },
  {
    "title": "The Irish Times view on the US/EU trade statement: some certainty on tariffs",
    "description": "The agreement to cap pharma tariffs at 15 per cent removes a key risk from the economic outlook",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/08/21/the-irish-times-view-on-the-useu-trade-statement-some-certainty-on-tariffs/",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Arctic Drilling on the Table as India Buys Discounted Russian Oil",
    "description": "Russia and India are interested in collaborating on joint energy projects, including oil and gas production in Russia’s Far East and Arctic shelf, Russian Foreign Minister Sergei Lavrov said on Thursday after meeting with his Indian counterpart in Moscow. Ear…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Arctic-Drilling-on-the-Table-as-India-Buys-Discounted-Russian-Oil.html",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Creatorverse: The White House Joining TikTok Means It’s Safe, Right?",
    "description": "Though it seems like a U.S. sale is happening, TikTokers are getting sick of this saga\nThe post Creatorverse: The White House Joining TikTok Means It’s Safe, Right? appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creatorverse-the-white-house-is-tiktok-safe/",
    "timestamp": "2025-08-21T19:00:00Z"
  },
  {
    "title": "Walmart to Increase Prices ‘On a Week-to-Week Basis’ Due to Trump Tariffs: Report",
    "description": "Walmart will soon begin increasing prices across its inventory in response to the tariffs imposed by President Donald Trump.\nThe post Walmart to Increase Prices ‘On a Week-to-Week Basis’ Due to Trump Tariffs: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/walmart-to-increase-prices-on-a-week-to-week-basis-due-to-trump-tariffs-report/",
    "timestamp": "2025-08-21T18:59:31Z"
  },
  {
    "title": "Trump admin assigns military attorneys to prosecute DC crimes amid federal crackdown",
    "description": "Military lawyers deployed to handle misdemeanor prosecutions in D.C. while federal law enforcement arrests 630 people in Trump's ongoing crime reduction initiative",
    "link": "https://www.foxnews.com/us/trump-admin-assigns-military-attorneys-prosecute-dc-crimes-amid-federal-crackdown",
    "timestamp": "2025-08-21T18:57:57Z"
  },
  {
    "title": "Carney and Trump speak for the first time since blowing past trade deal deadline",
    "description": "Prime Minister Mark Carney spoke to his U.S. counterpart by phone Thursday — the first time the leaders have spoken since the two sides failed to reach a deal on a trade agreement earlier this month.",
    "link": "https://www.cbc.ca/news/world/carney-trump-phone-call-trade-1.7614947",
    "timestamp": "2025-08-21T18:57:02Z"
  },
  {
    "title": "Ukraine becoming the ‘Silicon Valley’ of defense as startups develop long-range drones and missiles",
    "description": "Last September, a Ukrainian-made drone attacked a Russian ammunition depot more than 620 miles away. This marked a significant achievement for Fire Point, the company behind the drones.",
    "link": "https://www.pbs.org/newshour/world/ukraine-becoming-the-silicon-valley-of-defense-as-startups-develop-long-range-drones-and-missiles",
    "timestamp": "2025-08-21T18:56:37Z"
  },
  {
    "title": "Putin issues formal demands to end Ukraine war after meeting Trump: report",
    "description": "Russian president reportedly willing to freeze current front lines in exchange for Ukraine territorial concessions and NATO membership ban.",
    "link": "https://www.foxnews.com/world/putin-issues-formal-demands-end-ukraine-war-after-meeting-trump-report",
    "timestamp": "2025-08-21T18:56:00Z"
  },
  {
    "title": "Lawyers for Brazil's Bolsonaro surprised by new accusation of obstruction of justice",
    "description": "Lawyers for former Brazilian President Jair Bolsonaro say they are surprised by the federal police's decision to formally accuse him of obstruction of justice",
    "link": "https://abcnews.go.com/International/wireStory/lawyers-brazils-bolsonaro-surprised-new-accusation-obstruction-justice-124857089",
    "timestamp": "2025-08-21T18:54:47Z"
  },
  {
    "title": "House Democrats demand answers on Trump-Paramount “bribe”",
    "description": "The accusation comes after an alleged \"side deal\" between Trump and the media company",
    "link": "https://www.salon.com/2025/08/21/house-democrats-demand-answers-on-trump-paramount-bribe/",
    "timestamp": "2025-08-21T18:54:04Z"
  },
  {
    "title": "Jack White Fires Back After White House Official Name Calling",
    "description": "Jack White fires back at White House Communications Director Steven Cheung after being called a 'has been loser' over his critique of the Oval Office. Continue reading…",
    "link": "https://loudwire.com/jack-white-fires-back-white-house-official/",
    "timestamp": "2025-08-21T18:53:29Z"
  },
  {
    "title": "Court Rules With SpaceX in Case Seeking to Gut NLRB, in Blow to Workers’ Rights",
    "description": "“This disastrous decision cannot stand,” said Sen. Bernie Sanders.",
    "link": "https://truthout.org/articles/court-rules-with-spacex-in-case-seeking-to-gut-nlrb-in-blow-to-workers-rights/",
    "timestamp": "2025-08-21T18:53:04Z"
  },
  {
    "title": "Stephen Miller's latest tirade just exposed Trump's 'major vulnerability': analysts",
    "description": "President Donald Trump's deputy chief of staff, Stephen Miller, went off on a fascist rant during an event that was supposed to be about thanking the National Guard. And two analysts say he just exposed a \"big weakness.\"Vice President JD Vance and Secretary o…",
    "link": "https://www.rawstory.com/stephen-miller-2673908421/",
    "timestamp": "2025-08-21T18:50:19Z"
  },
  {
    "title": "Bernie Sanders and Donald Trump form an unlikely alliance over billions in chipmaker subsidies",
    "description": "Trump has a newfound taste for state involvement in the private sector. It’s a palette Sanders has long enjoyed.",
    "link": "https://fortune.com/2025/08/21/bernie-sanders-donald-trump-intel-chips/",
    "timestamp": "2025-08-21T18:50:13Z"
  },
  {
    "title": "Trump says will patrol streets of US capital with troops Thursday",
    "description": "US President Donald Trump plans to patrol Washington streets with police and National Guard. He deployed troops to combat crime in the Democrat-run city. Vice President JD Vance faced protests during a troop visit. Republican states are sending additional Nat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-will-patrol-streets-of-us-capital-with-troops-thursday/articleshow/123439857.cms",
    "timestamp": "2025-08-21T18:49:56Z"
  },
  {
    "title": "What to know about changing COVID vaccine guidelines",
    "description": "COVID-19 cases are on the rise again, and the federal guidelines for who should get vaccinated are in flux. We’ll unpack how it could impact what insurers are willing to cover this fall. And, as President Trump’s federal takeover of Washington D.C. continues,…",
    "link": "https://www.marketplace.org/episode/2025/08/21/what-to-know-about-changing-covid-vaccine-guidelines",
    "timestamp": "2025-08-21T18:49:34Z"
  },
  {
    "title": "Trump can’t stop America from building cheap EVs",
    "description": "President Donald Trump has made no secret of his disdain for electric vehicles and is slamming the brakes on government incentives to get them into more driveways. He’s been working to undo policies that promote clean technologies while increasing support for…",
    "link": "https://www.vox.com/climate/458567/trump-ford-electric-car-tax-credit-f-f150",
    "timestamp": "2025-08-21T18:48:03Z"
  },
  {
    "title": "NTSB investigating why Tesla is slow in reporting crashes involving self-driving technology",
    "description": "Federal car safety regulators opened an investigation Thursday into why Tesla has repeatedly broken rules requiring it to tell them quickly about crashes involving its self-driving technology.",
    "link": "https://www.pbs.org/newshour/nation/ntsb-investigating-why-tesla-is-slow-in-reporting-crashes-involving-self-driving-technology",
    "timestamp": "2025-08-21T18:46:24Z"
  },
  {
    "title": "Trump to sign executive order to punish those who burn American flags (Alayna Treene/CNN)",
    "description": "Alayna Treene / CNN:\nTrump to sign executive order to punish those who burn American flags  —  President Donald Trump is expected to sign an executive order on Thursday that would direct the Justice Department to try to bring charges against people who burn t…",
    "link": "https://www.memeorandum.com/250821/p87",
    "timestamp": "2025-08-21T18:45:01Z"
  },
  {
    "title": "President Trump to Go on Crime Patrol with Police and Military in Washington, DC",
    "description": "President Donald Trump is slated to go on crime patrol in Washington, DC, with the police and military, he revealed during an interview aired on \"The Todd Starnes Show\" Thursday.\nThe post President Trump to Go on Crime Patrol with Police and Military in Washi…",
    "link": "https://www.breitbart.com/politics/2025/08/21/president-trump-to-go-on-crime-patrol-with-police-and-military-in-washington-dc/",
    "timestamp": "2025-08-21T18:44:18Z"
  },
  {
    "title": "Appeals Court Allows Trump to End 'Temporary' Amnesty for 60,000 Migrants",
    "description": "Trump can end TPS for tens of thousands of migrants living in the United States, the Ninth Circuit Court of Appeals ruled this week.\nThe post Appeals Court Allows Trump to End ‘Temporary’ Amnesty for 60,000 Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/21/appeals-court-allows-trump-end-temporary-amnesty-60000-migrants/",
    "timestamp": "2025-08-21T18:43:50Z"
  },
  {
    "title": "Trump Orders Smithsonian To Display Exhibit Of Old Cracker Barrel Logo",
    "description": "WASHINGTON, D.C. — As part of his comprehensive overhaul of America's national museums, President Donald Trump ordered the Smithsonian to display an exhibit of the now-defunct Cracker Barrel logo.",
    "link": "https://babylonbee.com/news/trump-orders-smithsonian-to-display-exhibit-of-old-cracker-barrel-logo",
    "timestamp": "2025-08-21T18:42:42Z"
  },
  {
    "title": "Ted Cruz Gets Played Off Fox News By Hilariously Loud Background Music",
    "description": "The Texas Republican was criticizing Gov. Gavin Newsom (D-Calif.) for nearly half a minute over a hilariously unrelenting score.",
    "link": "https://www.huffpost.com/entry/ted-cruz-played-off-fox-news-interview-music_n_68a72522e4b0d184fdf4eb8a",
    "timestamp": "2025-08-21T18:41:14Z"
  },
  {
    "title": "Ted Cruz Gets Played Off Fox News By Hilariously Loud Background Music",
    "description": "The Texas Republican was criticizing Gov. Gavin Newsom (D-Calif.) for nearly half a minute over a hilariously unrelenting score.",
    "link": "https://www.huffpost.com/entry/ted-cruz-played-off-fox-news-interview-music_n_68a72522e4b0d184fdf4eb8a?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-21T18:41:14Z"
  },
  {
    "title": "Trump goes on $100 million bond buying spree: Here’s what it could signal about future interest rates",
    "description": "President Donald Trump has reportedly put $100 million into bonds since taking office in January, through a mixed bet on the debt of both big companies like Meta and Home Depot as well as municipal governments and public entities. The move is notable because …",
    "link": "https://biztoc.com/x/8ffc68b0132bb628",
    "timestamp": "2025-08-21T18:41:09Z"
  },
  {
    "title": "Trump, Carney talk trade and security",
    "description": "Canadian Prime Minister Mark Carney spoke with United States President Donald Trump on Thursday, according to a statement from Carney's office. The discussion covered trade issues, economic opportunit...",
    "link": "https://biztoc.com/x/8c0160018a71640a",
    "timestamp": "2025-08-21T18:40:52Z"
  },
  {
    "title": "Gavin Newsom's Trump-style trolling roils critics while thrilling fans",
    "description": "At this point, it feels unfathomable for a politician to campaign or legislate without some form of social media presence. It's a perhaps inevitable technological advance cemented in place by President Donald Trump's bombastic use of the medium. But if Trump …",
    "link": "https://biztoc.com/x/58f6681c0a78610e",
    "timestamp": "2025-08-21T18:40:49Z"
  },
  {
    "title": "VIDEO: WINNING!!! NY Appeals Court Tosses Out $500 Million Trump Civil Fraud Penalty",
    "description": "VIDEOCall it Karmatic Kickback! While CORRUPT Letitia James is now facing federal criminal charges of mortgage fraud, President Donald Trump had the absurd $500 million civil fraud penalty tossed out by the New York Appeals Court in the case that James had be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4335934/posts",
    "timestamp": "2025-08-21T18:40:36Z"
  },
  {
    "title": "Laura Loomer Wants to Bring Back the Red Scare",
    "description": "Right-wing influencer Laura Loomer wants to Make America McCarthyist Again. The 32-year-old MAGA influencer, who seemingly has President Donald Trump’s ear, ...",
    "link": "https://www.thedailybeast.com/laura-loomer-wants-to-bring-back-the-red-scare/",
    "timestamp": "2025-08-21T18:40:17Z"
  },
  {
    "title": "Viral: Cracker Barrel's new logo sparks social media backlash, here's why",
    "description": "Cracker Barrel unveiled its updated logo as part of its \"All the More\" fall menu campaign, removing the iconic old man figure. The change has sparked significant backlash online, with critics, including Donald Trump Jr., expressing disappointment. Shares of t…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/viral-cracker-barrels-new-logo-sparks-social-media-backlash-heres-why/articleshow/123439104.cms",
    "timestamp": "2025-08-21T18:40:02Z"
  },
  {
    "title": "Team Trump finds something new to weaponize: mortgage fraud allegations",
    "description": "The Trump administration accused Adam Schiff of mortgage fraud. Then it happened again with Letitia James. And then it happened again with Lisa Cook.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-finds-something-new-weaponize-mortgage-fraud-allegations-rcna226381",
    "timestamp": "2025-08-21T18:39:48Z"
  },
  {
    "title": "RFK Jr.’s Misguided War on mRNA",
    "description": "Covid vaccine mandates and a lack of transparency by public-health experts produced many unintended effects—or what scientists call “off target” responses. One is a political turn against mRNA technology that could damage U.S. innovation and pandemic prepared…",
    "link": "https://freerepublic.com/focus/f-news/4335933/posts",
    "timestamp": "2025-08-21T18:39:38Z"
  },
  {
    "title": "Redistricting would split cities, counties throughout CA",
    "description": "(The Center Square) – Lodi, a Northern California city of 66,000 people, will be divided among three congressional districts if a Democratic Party-backed...",
    "link": "https://www.thecentersquare.com/california/article_e6fadf3d-48a8-4bbc-ba40-65ed086fb61e.html",
    "timestamp": "2025-08-21T18:39:00Z"
  },
  {
    "title": "US DOJ to back off money transmitter cases in shift backed by crypto",
    "description": "The U.S. Justice Department does not plan to target software developers that create decentralized platforms for transmitting cryptocurrencies without criminal intent, a Justice official said on Thursday.Marking the latest sign of the U.S. government's changin…",
    "link": "https://www.channelnewsasia.com/business/us-doj-back-money-transmitter-cases-shift-backed-crypto-5307656",
    "timestamp": "2025-08-21T18:38:19Z"
  },
  {
    "title": "Fatal Florida crash fuels immigration fight between DeSantis and Newsom",
    "description": "Florida Republican Gov. Ron DeSantis dispatched his top deputy to California to oversee the handover of a truck driver accused of making an illegal U-turn that killed three people in Florida",
    "link": "https://abcnews.go.com/US/wireStory/fatal-florida-crash-fuels-immigration-fight-desantis-newsom-124855967",
    "timestamp": "2025-08-21T18:38:18Z"
  },
  {
    "title": "Tesla is slow in reporting crashes and the feds have launched an investigation to find out why",
    "description": "Federal car safety regulators opened an investigation Thursday into why Tesla has repeatedly broken rules requiring it to tell them quickly about crashes involving its self-driving technology that may soon be deployed in millions of its cars on U.S. roads",
    "link": "https://abcnews.go.com/Business/wireStory/tesla-slow-reporting-crashes-feds-launched-investigation-find-124853083",
    "timestamp": "2025-08-21T18:38:17Z"
  },
  {
    "title": "Why Nvidia Matters More To Markets Than The Fed",
    "description": "Options traders are betting Powell's comments will move the market up or down by 0.8 percentage points while Nvidia's q2 2026 results could move the market 0.9 points.",
    "link": "https://www.forbes.com/sites/petercohan/2025/08/21/why-nvidia-matters-more-to-markets-than-the-fed/",
    "timestamp": "2025-08-21T18:36:55Z"
  },
  {
    "title": "South Park Calls Out ChatGPT and Useless Tech Bro Sycophants",
    "description": "Season 27's latest episode rails against a tech industry that simply reinforces our silliest impulses.",
    "link": "https://www.esquire.com/entertainment/tv/a65861699/south-park-season-27-episode-3-recap/",
    "timestamp": "2025-08-21T18:36:00Z"
  },
  {
    "title": "Gavin Newsom's Trump-style trolling roils critics while thrilling fans",
    "description": "The California governor has turned his X account into a cutting parody of Trump's digital cadence, angering Fox News conservatives",
    "link": "https://theweek.com/politics/gavin-newsom-troll-trump-x",
    "timestamp": "2025-08-21T18:35:52Z"
  },
  {
    "title": "About 600 CDC workers terminated after court clears part of Trump admin restructuring plan",
    "description": "About 600 employees were laid off from the Centers for Disease Control and Prevention as part of the Health and Human Services restructuring plan.",
    "link": "https://www.foxnews.com/us/about-600-cdc-workers-terminated-after-court-clears-part-trump-admin-restructuring-plan",
    "timestamp": "2025-08-21T18:34:29Z"
  }
]